{"doi":"10.1007\/s00216-010-4054-4","coreId":"113906","oai":"oai:epubs.surrey.ac.uk:2983","identifiers":["oai:epubs.surrey.ac.uk:2983","10.1007\/s00216-010-4054-4"],"title":"The increasing importance of carbon nanotubes and nanostructured conducting polymers in biosensors.","authors":["Lahiff, E","Lynam, C","Gilmartin, N","O'Kennedy, R","Diamond, D"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-10","abstract":"The growing need for analytical devices requiring smaller sample volumes, decreased power consumption and improved performance have been driving forces behind the rapid growth in nanomaterials research. Due to their dimensions, nanostructured materials display unique properties not traditionally observed in bulk materials. Characteristics such as increased surface area along with enhanced electrical\/optical properties make them suitable for numerous applications such as nanoelectronics, photovoltaics and chemical\/biological sensing. In this review we examine the potential that exists to use nanostructured materials for biosensor devices. By incorporating nanomaterials, it is possible to achieve enhanced sensitivity, improved response time and smaller size. Here we report some of the success that has been achieved in this area. Many nanoparticle and nanofibre geometries are particularly relevant, but in this paper we specifically focus on organic nanostructures, reviewing conducting polymer nanostructures and carbon nanotubes","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2983<\/identifier><datestamp>\n      2017-10-31T14:07:50Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6368656D6963616C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2983\/<\/dc:relation><dc:title>\n        The increasing importance of carbon nanotubes and nanostructured conducting polymers in biosensors.<\/dc:title><dc:creator>\n        Lahiff, E<\/dc:creator><dc:creator>\n        Lynam, C<\/dc:creator><dc:creator>\n        Gilmartin, N<\/dc:creator><dc:creator>\n        O'Kennedy, R<\/dc:creator><dc:creator>\n        Diamond, D<\/dc:creator><dc:description>\n        The growing need for analytical devices requiring smaller sample volumes, decreased power consumption and improved performance have been driving forces behind the rapid growth in nanomaterials research. Due to their dimensions, nanostructured materials display unique properties not traditionally observed in bulk materials. Characteristics such as increased surface area along with enhanced electrical\/optical properties make them suitable for numerous applications such as nanoelectronics, photovoltaics and chemical\/biological sensing. In this review we examine the potential that exists to use nanostructured materials for biosensor devices. By incorporating nanomaterials, it is possible to achieve enhanced sensitivity, improved response time and smaller size. Here we report some of the success that has been achieved in this area. Many nanoparticle and nanofibre geometries are particularly relevant, but in this paper we specifically focus on organic nanostructures, reviewing conducting polymer nanostructures and carbon nanotubes.<\/dc:description><dc:date>\n        2010-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2983\/4\/licence.txt<\/dc:identifier><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2983\/7\/Microsoft_Word_-_increasing_importance.pdf<\/dc:identifier><dc:identifier>\n          Lahiff, E, Lynam, C, Gilmartin, N, O'Kennedy, R and Diamond, D  (2010) The increasing importance of carbon nanotubes and nanostructured conducting polymers in biosensors.   Anal Bioanal Chem, 398 (4).  pp. 1575-1589.      <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s00216-010-4054-4<\/dc:relation><dc:relation>\n        10.1007\/s00216-010-4054-4<\/dc:relation><dc:language>\n        eng<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2983\/","http:\/\/dx.doi.org\/10.1007\/s00216-010-4054-4","10.1007\/s00216-010-4054-4"],"year":2010,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"1 \n \nReview Article: The Increasing Importance of Carbon Nanotubes and \nNanostructured Conducting Polymers in Biosensors \n \nEmer Lahiff*#1, Carol Lynam*2, Niamh Gilmartin2, Richard O’Kennedy2, Dermot \nDiamond1 \n \n1 CLARITY: The Centre for Sensor Web Technologies, National Centre for Sensor Research, Dublin \nCity University, Dublin 9, Ireland. \n2 School of Biotechnology and Biomedical Diagnostics Institute, National Centre for Sensor Research, \nDublin City University, Dublin 9, Ireland. \n \n*Authors contributed equally. \n \n#Corresponding author. \nE-mail: emer.lahiff@dcu.ie. Phone: +353-1-7007926. Fax: +353-1-7007995 \n \nAbstract \nThe growing needs for analytical devices requiring smaller sample volumes, \ndecreased power consumption and improved performance have been driving forces \nbehind the rapid growth in nanomaterials research.  Due to their dimensions, \nnanostructured materials display unique properties not traditionally observed in bulk \nmaterials. Characteristics such as increased surface area along with enhanced \nelectrical\/optical properties make them suitable for numerous applications such as \nnanoelectronics, photovoltaics and chemical\/biological sensing. In this review we \nexamine the potential that exists to use nanostructured materials for biosensor devices. \nBy incorporating nanomaterials, it is possible to achieve enhanced sensitivity, an \nimproved response time and smaller size. Here we report some of the success that has \nbeen achieved in this area. Many nanoparticle and nanofibre geometries are \nparticularly relevant, in this paper however we specifically focus on organic \nnanostructures, reviewing conducting polymer nanostructures and carbon nanotubes.  \n \nKeywords: Biosensor, carbon nanotubes, conducting polymers, nanomaterials, \nbiomolecule immobilisation.  \n \n \nIntroduction \n2 \n \nInvestment in nanomaterials research has grown exponentially over the last number of \nyears. This is due to the huge range of opportunities afforded by nanomaterials in \nareas such as clean energy (for example solar panels and hydrogen storage), \nenvironmental monitoring (sensors for harmful chemicals or biological agents), \nimproved materials (such as stronger\/lighter plastics and antimicrobial surfaces), and \nnew products (for example nanoscale transistors). It is clear that nanotechnologies \ncome with the potential to drive economic growth, hence in 2000 the US government \nset up the National Nanotechnology Initiative and since then investment has grown \nannually (Figure 1).  The investment by NNI member agencies for 2011 is nearly $1.8 \nbillion (http:\/\/www.nano.gov\/). Currently most commercial success has resulted from \nthe incorporation of nanomaterials into composites for reinforcement. This improves \nthe strength of materials which can typically be used in products such as sports \nequipment (for example Babolat tennis rackets). Nanomaterials are also of interest for \na number of other applications such as nanoelectronics (IBM and Intel both have \nactive nanomaterials research programs). It is clear that nanotechnology will feature \nin many future products. Here we focus on the potential they offer for developing \nimproved biosensors.  \n \nNanomaterials are defined as matter with dimensions between 1 and 100 nm (Figure \n2). To put this into perspective, a sheet of paper is about 100,000 nanometers thick \nwhereas a single gold atom is about a third of a nanometer in diameter. Nanomaterials \ntherefore are larger than individual atoms\/molecules but smaller than bulk materials, \nand thus have characteristic properties that neither completely obey quantum- nor \nclassical-physics. Nanoparticles can be zero-, one-, or two-dimensional. The low \ndimensionality of nanoparticles results in large surface-to-volume ratios, and \nenhanced electronic and optical properties when compared with bulk samples of the \nsame material. They are of interest for numerous applications including sensing, \nwhere the large surface area of nanomaterials specifically facilitates interaction with \nan increased number of target molecules when compared to their bulk counterparts (1-\n5). Their small size is also responsible for superior electronic and optical properties \nwhich, due to quantum confinement effects, are very sensitive to minor perturbations. \nThus nanomaterials can be used to facilitate label-free detection, and develop \nbiosensors with enhanced sensitivities and improved response times. The use of \nnanoparticles in biosensors is increasing due to this enhancement in sensitivity (as \n3 \n \nseen in Table 1), which is of major importance for clinical diagnostics as the \nconcentration of targets can be very low in biological samples.  A good example of \nthis is DNA sensors which generally rely on polymerase chain reaction (PCR) for \nsignal amplification. By developing biosensors with improved sensitivity it will \neliminate the need for PCR and thus simplify DNA biosensors. This can be achieved \nusing nanomaterials which, due to their large surface area, allow a greater number of \nDNA strands to be immobilised (6). Nanomaterials can be incorporated into many \ntypes of biosensor configurations to develop magnetic, optical, electrical or \nelectrochemical biodevices for the detection of many biological molecules including \nnucleic acids, antibodies, proteins, toxins and bacteria (7-13)  \n \nThe first biosensors were reported in the early 1960’s, where a pH response for a 10 \nmg per cent solution of glucose was reported (14). Since then there have been many \nadvances made in the field, and devices are now more sensitive and more portable.  In \ngeneral, a biosensor can be described as a device which has a biological sensing \nelement connected to (or integrated with) a transducer, thus transforming a biological \nevent into a signal which can then be interpreted. The recognition biomolecule within \na biosensor is highly selective, and can be immobilised by physical adsorption, \nentrapment or covalent attachment (8, 15-18). The sensitivity of a biosensor is \ndependent on the number and accessibility of recognition biomolecules present. \nNanomaterials enable the development of improved biosensors because they allow for \nincorporation of a greater number of recognition biomolecules which are more readily \naccessible to the target species, owing to greater porosity and surface area. \nNanomaterials thus typically enable lower detection limits and faster response times, \nthey can also enable label-free detection which is a major advantage (19, 20). Many \ntypes of nanomaterials are suitable for biosensor applications including metallic \nnanoparticles (such as gold), magnetic nanoparticles (such as iron oxide), \nsemiconducting nanoparticles (such as quantum dots and silicon nanowires), and \norganic nanoparticles (such as conducting polymers, carbon nanotubes) (13, 20-25). \nOrganic materials are more likely to be biocompatible and in this review article we \nwill consider only organic nanomaterials, in particular we review conducting polymer \nnanostructures (CPs) and carbon nanotubes (CNTs).  \n \n1. Nanomaterials \n4 \n \n1.1 Carbon Nanotubes \n \nCarbon nanotubes (CNTs), discovered by Iijima in 1991 (26), are an allotrope of \ncarbon comprised of graphene sheets rolled up into cylinders of sp2 hybridized atoms. \nCNTs exist as single- (SWNTs), double- (DWNTs) and multi-walled (MWNTs) \nstructures. MWNTs are essentially a number of concentric SWNTs and hence have a \nlarger diameter (Figure 3). The diameter for SWNTs is usually less than 2nm, whereas \ndiameters for MWNTs range between 2-100 nm, depending on the number of shells \npresent. CNTs are typically microns long but, tubes up to 4cm in length have been \nreported (27). Combined with their narrow diameter, this leads to excellent material \nproperties such as a high aspect ratio and large surface area. CNTs can be \napproximated to one-dimensional nanostructures, as a result (28).  \n \nThe electrical properties of a CNT are determined by the tube helicity and diameter \n(Figure 4) (8). If a CNT is imagined as a rolled-up graphene sheet, the helicity of the \ntube depends on the angle at which it is rolled-up, and can be described by its chiral \nvector, Ch =  na1 + ma2 (where a1 and a2 are unit vectors of the hexagonal lattice and, \nn and m are integers) (28). The direction of Ch is perpendicular to the axis of the \nnanotube. The chiral angle (θ), is the angle between vectors Ch and a1. The n, m and θ \nvalues for a particular CNT, determine the electronic behaviour of the tube. If n - m is \na multiple of 3 the tube is metallic otherwise, the tube is semiconducting (28). This \nstipulates that one-third of all tubes are metallic with the remaining two-third \nsemiconducting. \n \nThe exponential increase in CNT patents filed in recent years reflects the level of \ncommercial interest. However, applications for CNTs are currently limited by the \ndifficulties associated with purification and the lack of precise control over the \nproperties (such as chirality) of CNTs produced. At the moment, production of \nexactly one type of CNT is limited to the number of walls on the CNT, with some \nSWNT batches even containing DWNTs and MWNTs, among other types of \nnanostructured carbon. Exact production of a single type of chiral or semi-conducting \nSWNT, without contaminants, is unfortunately not yet possible and considerable \nbatch to batch variation is also common. In addition, no clear cut strategy for \n5 \n \npurification of CNT type has been discovered to date. Therefore current CNT research \nis limited to working with CNT mixtures. \n \nEarly CNT research primarily focused on determining and exploiting the properties of \nthe pristine materials. More recently however, exploration into the chemistry of \nCNTs, including their functionalisation, has begun to dominate the field (29, 30). The \nfirst attempts at chemical functionalisation of CNTs were in response to their poor \nsolubility. Pristine CNTs align parallel with one another to form bundles (31), thus \nincreasing van der Waals interactions, but also preventing their dissolution. Although \npristine CNTs have been shown to form stable dispersions with the aid of surfactants \n(32) and biomolecules (33) or low concentration dispersions with short-term stability \nin amides such as N,N-dimethylformamide (DMF), N-methylpyrrolidone (NMP), and \nother non-hydrogen bonding Lewis bases (34) better methods for solvation are \nrequired. \n \nCNTs are susceptible to functionalisation mediated by oxidative processes that form \nreactive groups at their end-caps and defect sites, or by direct modification of their \nsidewalls, both covalently and non-covalently. Covalent attachment involves the \ndirect addition of functionality to CNTs via the formation of chemical bonds, whereas \nnon-covalent attachment involves CNT-molecule interactions involving electrostatic, \nvan der Waals and\/or hydrophobic interactions. A high degree of covalent \nfunctionalisation, which alters carbon-carbon bonds from sp2 to sp3 structure, can \nhowever, result in a sizeable loss of electrical conductivity of the functionalised \nSWNTs (35). \n \nSince the purification of CNTs is often carried out using oxidative methods that \nintroduce carbonyl and carboxylic acid groups on the open ends of the CNTs and at \ndefect sites along the CNT sidewalls (36-39), this has become one of the favoured \nroutes of covalently attaching biomolecules to CNTs. The proliferation of amino \nfunctionalities on proteins, enzymes and antibodies among other biomolecules, allows \nfor facile amide functionalisation with CNT carboxylates (Figure 5). A wide variety \nof biomolecules such as carbohydrates (40), oligonucleotides (41), proteins (42, 43), \nenzymes (44, 45) and even DNA (46-48) have been attached to CNTs in this fashion. \nHowever, such functionalisation can be difficult to reproduce since the extent of \n6 \n \nfunctionalisation is dependent on the degree and type of nanotube carboxylation, \nwhich in turn varies according to CNT source. \n \nAlthough rather uncontrollable, non-covalent attachment (physical adsorption) has \nbeen used effectively to attach a variety of moieties to CNTs. Unfortunately, proteins \nand antibodies in particular, may lose their biological activity when adsorbed on a \nCNT surface. This can be due to a change in conformation when binding with the \nCNT and\/or unfavourable orientation of the active site. The interaction of \nbiomolecules with CNTs has been of particular interest with a view to their use as \nbiosensors (49) or improving biocompatibility (50). Non-covalent binding of \nstreptavidin to CNTs has been achieved via covalent attachment to linkers that are \nadsorbed along the CNT axis (51). DNA has been shown to strongly interact with \nCNTs, forming uniform coatings (52). The wrapping of CNTs has recently been \nextended to other biopolymers including chitosan, chondroitin sulphate and \nhyaluronic acid (53, 54). Biomolecules of interest, including antibodies, may \nsubsequently be anchored to these biopolymers wrapped around the CNTs (55). \n \n \n1.2 Conducting Polymer Nanostructures \nCPs are of interest for biosensor applications as they can be interfaced with \nbiomolecules for effective signal transduction. CPs can be tailored to create substrates \nwith a high surface area, controllable morphology and conductivity. These properties \nmake them excellent transducer materials which can facilitate rapid electron transfer \nbetween immobilised biomolecules and an electrode surface (56). Like \nmetals\/semiconductors, CPs can conduct charge carriers such as holes and electrons. \nUnlike metals\/semiconductors however they are low cost, and can be easily prepared \nand modified (57). In 1977 Alan Heeger, Alan, MacDiarmid and Hideki Shirakawa \ndiscovered that when polyacetylene was exposed to bromine vapours, its conductivity \nrose by seven orders of magnitude (58). Polyacetylene is a pi-conjugated polymer \nmeaning there are alternating single and double bonds along the polymer backbone. In \na conjugated polymer the pi-electrons can become delocalised and shared along the \npolymer chain, enabling them to conduct electricity. CPs are extremely useful as they \ncombine the electrical properties of a metal with the low density and cost of a \n7 \n \npolymer. Potential applications include light emitting diodes, photovoltaics, \nelectostatic discharge coatings and printable electronics (59-62). The conductivity of a \nCP is however sensitive to its chemical environment and can be varied over ten orders \nof magnitude (ranging typically from 10-10S\/m to 100S\/m). This change in \nconductivity results from a change in the bonding structure, and is accompanied by a \nchange in the colour\/spectroscopy of the material (63). Hence CPs are suitable for \ndeveloping amperometric, potentiometric, conductometric, electrochemical, optical, \ncalorimetric and piezoelectric biosensors(56). \n \nCertain CPs, such as polyacetylene, however are unstable thus limiting them from use \nin practical applications. CPs such as polyaniline (PAni), polypyrrole, polythiophenes \nand poly-ethylene-dioxythiophene (PEDOT) have greater stability and are more \ncommonly investigated (Figure 6). PAni, for example, switches between a non-doped \ninsulating emeraldine base form and a doped conducting emeraldine salt form (Figure \n7). Switching is reversible and accompanied by a colour change from purple to green. \nIn the conductive form, delocalised electrons (called bipolarons) form along the \npolymer backbone and are responsible for charge transfer. A disruption in the \nconjugation of the polymer backbone results in a decrease in conductivity of the \nmaterial, making it suitable for sensing applications. As PAni conductivity relies on \nprotonation of the polymer by acid molecules, it’s conductivity tends to be poor in \nsolutions at neutral pHs (64).  This can be dealt with by covalently attaching acid \nmolecules to CP backbones, resulting in a self-doping polymer (65, 66).  \n \nThe conductivity of a CP is always dependant on its oxidation state, and short term \nredox stability is a limitation which all unmodified CPs suffer from. CPs also tend to \nsuffer from poor mechanical properties, for example polyprrole has been reported to \nhave poor ductility, and is brittle (67). Therefore, although CP films can be cast onto \nsubstrates, it is not generally possible to produce robust CP films with sufficient \nmechanical integrity to be free-standing. The mechanical properties of CPs can \nhowever, be improved by incorporating materials such as CNTs for reinforcement \n(68). CPs also tend to have poor solubility in common solvents and are typically \nhydrophobic (69). Large CP particles tend to agglomerate resulting in poor \ndispersions which are difficult to process. Using the nano- (versus bulk-) form of CPs \nhowever, tend to produce more stable homogenous dispersions. Stable aqueous \n8 \n \ncolloids of PAni nanofibres have been produced without the need for surfactant \nstabilisation (70).  \n \nFor sensing applications, the response time and sensitivity of detection is also \nimproved for the nano- versus the bulk-form of the material (Figure 7). This is due to \nthe increased number of reaction sites available for interaction with a target species \n(71). Until recently nanofibres of CPs were synthesised by solution-based methods \nsuch as electrospinning. However, this process can be complicated by the fact that \nmost CPs are difficult to dissolve. A simpler method to synthesise nanofibres is by \nchemical means and Kaner et al. have demonstrated the synthesis of PAni nanofibres \nby interfacial polymerisation and also by a rapid mix process (72, 73). The BET \nsurface area of nanofibers produced using these methods is typically in the region of \n40 m2\/g (72). \n \nLike other conductive nanomaterials, CPs are of interest as they enable simultaneous \nbiomolecule immobilisation along with rapid electron transfer (facilitating enhanced \ncommunication with an electrode surface) (74-78) (79). However, they are cheaper to \nproduce when compared with many other conductive nanomaterials and properties \nsuch as roughness, porosity, hydrophobicity, stability and conductivity can be \ncontrolled. Increasing the surface roughness has been shown to increase the sensitivity \nof CP-based biosensors (80). CPs can be incorporated into numerous biosensor \nconfigurations to enable low limits of detection, and can be tailored to detect a range \nof target biomolecules (Table 1). A key aspect in biosensor applications is integration \nof the electrical component (CP) with the biological recognition component. After \nimmobilization it is critical that molecules maintain their activity and are accessible to \nthe analyte so that hybridization of complimentary oligonucleotides, antigen-antibody \nbinding, or enzyme-catalysed reactions can be monitored. \n \n2. Biosensing \nCentral to much sensor research is the ability to monitor biomarkers (in particular \ndisease biomarkers) in ‘real-time’, with high sensitivity and selectivity in real \nuntreated samples. This demand for sensitive, rapid, ‘on-site’ biosensor techniques \nhas taken advantage of the latest advances in nanotechnology. To improve \n9 \n \nsensitivities, intense research has been carried out in signal amplification by \nnanomaterials.  \n \n2.1 CNTs \n2.1.1 CNT-Electrical sensors \nThe oldest and most commonly used transducers in biosensors are electrochemical. \nElectrical detection methods are appealing because of their low cost, low power \nconsumption, ease of miniaturization, and potential multiplexing capability (81, 82). \nDue to their size and electronic properties, CNTs can be used to develop highly \nsensitive and specific nanoscale biosensors (83-85). Challenges remain however in \ncreating macro-sized structures that fully utilise the properties of the individual CNT \nnanocomponents. Three approaches to the development of electrochemical biosensors \nusing CNTs dominate the literature (Figure 8) (86, 87). In the simplest method, CNTs \nare randomly deposited onto conductive surfaces in a mat configuration (CNT-mats) \nor packed into a micropipette for use as electrodes. This method results in an \nunknown configuration of CNTs which although easy to achieve may not offer \noptimal signals. However it allows for CNTs pre-functionalised with biomolecules to \nbe used. Alternatively the CNTs can be coated with the biomolecule of interest post \nelectrode fabrication. The second approach involves vertically aligned CNT forests, \nwith one end in contact with the underlying electrode and the other end exposed in the \nelectrolyte solution. This configuration may be achieved by growing the CNTs \ndirectly from the surface or by self assembly of shortened CNTs. Typically CNTs are \nfunctionalised after this electrode type has been assembled. A third type of \nnanoelectrode uses just a single CNT. If the type of CNT used could be exactly \ncontrolled (SWNT vs. MWNT, metallic vs semiconducting) this would ultimately \ngive the best performance. However, the fabrication and manipulation challenges \ninvolved will limit its practical use.  \n \nFor many important enzymes direct electron transfer with conventional electrodes is \nnot easily achieved or is too slow for sensor applications. CNTs are comparable in \nsize to many biomacromolecules. Their nanodimensions and high aspect ratio \ntherefore exploit the possibility of bringing CNTs into close proximity with proteins, \nwhich is not as easily achieved by bulk substrates. This close proximity allows CNTs \nto communicate with the redox-active sites of biomolecules which are sometimes \n10 \n \nobscured\/ inaccessible due to the surrounding insulating protein shell. Effective \nelectrical communication enables CNTs to act as one dimensional channels for \nelectron transfer in proteins (88-90). This electron transfer can be further enhanced by \nthe rapid transfer kinetics and high electrocatalytic activity of the tips of oxidised \nCNTs (91, 92). \n \nElectrochemical sensors can be based on potentiometry, amperometry, voltammetry, \ncoulometry, AC conductivity or capacitance measurements (93). Most CNT-based \nelectrochemical biosensors detect biomolecules amperometrically. The range within \nwhich the sensor is sensitive is an important sensor parameter. Glucose sensors for \nexample need to be sensitive in the range of a few µmol\/l to 15 mmol\/L since normal \nblood sugar levels are usually less than 6 mmol\/L of glucose, while a level of 7 \nmmol\/L or higher implies diabetes. Since the first biosensors, measuring glucose, \nwere reported in the early 60’s, it has become one of the most frequently performed \nroutine analyses in medicine. It is thus hardly surprising that an enormous amount of \nliterature exists on glucose biosensors and more recently CNT-based glucose \nbiosensors, which are covered in some recent reviews (94-97). Here we will highlight \nsome general characteristics of these biosensors and present a few pertinent examples.  \n \nAn example of a CNT-mat amperometric biosensor incorporated dispersed SWNTs \nwith the enzyme glucose oxidase into redox polymer hydrogels (63). These enzymatic \nredox composite films resulted in up to a 10-fold increase in the oxidation and \nreduction peak currents, while the glucose electro-oxidation current was increased 3-\nfold for glucose sensors. CNT-mat electrodes do not seem to provide significant \nadvantages in reversibility or signal-to-noise ratio compared to the best redox protein \nfilms on conventional electrodes except in a few special cases (e.g. glucose oxidase) \n(98). Rubianes and Rivas (99) showed how using dispersed CNTs allowed the \ndevelopment of highly sensitive glucose biosensors without redox mediators, metals \nor anti-interferent layers. The sensitivity of the CNT-mat electrode was 43 times \nhigher than that obtained with the control graphite composite electrode, with a \nclinically relevant linear range and negligible interference from ascorbic acid (AA), \nuric acid (UA) and acetaminophen; all common blood interferents. \n \n11 \n \nEven though the nanodimensions of CNTs makes them amenable to close contact \nwith the redox active centres of proteins and enzymes, Gooding and co-workers have \ndemonstrated that CNTs may not fully probe the protein active site (44). In an \ninteresting paper they describe how a self-assembled aligned shortened CNT forest \nprobes the redox active centre of glucose oxidase, flavin adenine dinucleotide (FAD). \nIn one experiment they conjugated glucose oxidase directly to the ends of the \nshortened CNTs in the aligned forest. They compared its electrochemistry to that of \nan array conjugated to the enzyme active centre, FAD, with subsequent enzyme \nreconstitution around the CNT-immobilized FAD. They found that the latter approach \nallowed for more efficient electron transfer to the glucose oxidase active centre. \nHence, even though CNTs offer more efficient ways of communicating electrically \nwith the active sites of biomolecules then traditional bulk substrates, there is still \nroom for improvement when fabricating biosensors composed of them. \n \nCholesterol sensors must have sensitivity in the range of 2.5–10 mmol\/L since a total \nblood cholesterol level of less than ~5 mmol\/L is considered to be risk-free, whereas \nhigh cholesterol levels greater than ~6 mmol\/L are considered dangerous. The layer-\nby-layer adsorption technique was used to immobilise cholesterol oxidase in a \nMWNT-mat immobilised on a gold electrode to create a biosensor for cholesterol \n(100). The sensor response was found to be linear in the range of 0.2–6 mmol\/L. In \nanother case, a screen-printed carbon paste electrode modified with a MWNT-mat and \ncholesterol oxidase could detect cholesterol directly in blood in the clinically relevant \nranges (101). The authors noted how CNTs promoted the electron transfer; nearly \ndoubled the sensitivity and improved the linearity of the electrode compared to the \ncontrol. Furthermore, the CNT electrode results gave good correlation with results \nfrom clinical assays of 31 patients’ blood samples.  \n \nDetecting genomic DNA sequences and identifying mutations is vital in the treatment \nof inheritable and infectious diseases. Electrochemical methods are aptly-suited to the \ndetection of DNA with their high sensitivity and rapid response. CNT-based DNA \nsensors are well covered in recent reviews (94-97), therefore we will highlight using \nexamples some general characteristics of these biosensors. Sensors may be fabricated \nby immobilising single-stranded DNA (ssDNA) onto an electrode, allowing \nhybridisation of the complementary DNA sequence to be detected by a current \n12 \n \nchange. An electroactive DNA intercalator is often used to amplify the signal. A 24-\nbase pair DNA could be detected using differential pulse voltammetry and the \nintercalator duanomycin, at a MWNT mat electrode modified with complementary \nssDNA (102). This sensor exhibited good selectivity (on the order of 4 µA\/nmol\/L \nover a linear range of 0.2–50 nmol\/L) over oligonucleotide sequences having a \nmismatch of only a few bases. When these electrodes were decorated with Pt \nnanoparticles however, a superior response was obtained, again showing the \namplification achieved with nanoparticles (103). The limit of detection for target \nDNA using the Pt nanoparticle-modified MWNTs was 1.0×10−11 mol\/L.  \n \nBy monitoring the electrochemical oxidation of guanine, DNA can be detected \nwithout an indicator. Labuda and co-workers (104) evaluated DNA biosensors from \nboth the redox signals of the marker [Co(phen)3]3+ and guanine residues. They used \nscreen printed electrodes modified with nanostructured mats of MWCNT, \nhydroxyapatite and montmorillonite. Based on AC voltammetric detection of guanine, \na label-free DNA hybridization sensor was developed by attaching MWNTs onto a \ncarbon paste electrode using a hybridisation assay (105). The MWNT-mat electrode \nexhibited large signal improvements compared to the control. Screen printed \nelectrodes modified with MWNT, which catalysed the electrooxidation of guanine \nand adenine residues, were reported by Ye and Ju (106) for fast and sensitive \ndetection of DNA and RNA. To improve the response of guanine oxidation a redox \nmediator can be used. For example, Ru(bby)2+3 allowed attomoles of oligonucleotides \nto be detected at ssDNA-modified MWNT forests (107). A 17-fold higher oxidation \nsignal for DNA oxidation at CNTs compared to a glassy carbon control electrode was \nreported by Wang et al. (108). They used chronopotentiometric adsorptive-stripping \nin the presence of copper to measure the purine nucleobases (guanine in this case). \nWell defined hybridisation signals were obtained for the BRCA1 breast cancer gene \nwith an LOD of 40 ng\/mL. Gooding and co-workers have reported advantages of \nusing bamboo type CNTs for the oxidation of DNA bases in a mat-type configuration \n(109). The presence of edge planes of graphene at regular intervals along the walls of \nthe bamboo CNT were attributed to the enhancement in the oxidation signals of \nguanine residues.  \n \n13 \n \nExamples of where CNTs were used for amplified detection include enzyme-linked \nCNTs carrying numerous enzymes (110, 111). Wang et al. (112)  described the use of \nCNTs in two ways, both for the recognition and transduction events. Target DNA \nstrands were labelled with CNTs carrying numerous alkaline phosphatase tags. DNA \ntarget strands were captured by DNA immobilised on magnetic beads. The signal of \nthe target analyte underwent double step amplification in both the recognition and \ntransduction events. The CNT-alkaline phosphatase enzymatic amplification was \ndetected using chronopotentiometric stripping at a CNT-mat electrode. The \npotentiometric detection of DNA was demonstrated with high sensitivity using \nssDNA connected to enzyme-loaded CNTs immobilized on a glassy carbon electrode. \nThis led to a reported detection limit of 54 aM for DNA.  \n \nImmunosensors are a good alternative to traditional immunoassays since conventional \nimmunoassays such as enzyme-linked immunosorbent assay (ELISA) can be complex \nand laborious to perform. They use the high affinity reaction between an antibody, as \nrecognition element, with its corresponding antigen, in combination with a transducer. \nImmunosensors can be used to monitor the presence of the antibody or antigen and \neither the antibody or the antigen can be immobilised or labelled depending on the \nassay requirements. When immobilising the antibody, it is of crucial importance that \nthe method of immobilisation maintains the stability and activity of the antibody.  \n \nTo boost the detection sensitivity of PSA (prostate specific antigen, a biomarker for \nprostate cancer) in serum, an amplification step was incorporated by combining \nSWNT forest immunosensors with HRP-MWNT-Ab2 bioconjugates. The secondary \nantibody (Ab2) and HRP tag were covalently linked to MWNTs at high ratios of \n1:200 (89). This amplification strategy improved the detection limit 100-fold to 4 pg \nml-1 and the sensitivity by 800-fold, compared to conventional ELISA. These results \nhighlight the excellent promise CNTs show in ultrasensitive immunoassay research in \nproteomics and systems biology. \n \nCNT-FETs \nIn addition to electrochemical sensors using CNTs as an electrode substrate, sensors \nbased on transistor arrangements using CNTs have been developed (113). SWNTs are \nthe most likely candidate for miniaturizing electronics beyond the micro \n14 \n \nelectromechanical scale currently used in electronics. They exhibit electric properties \nnot shared by their multi-walled counterparts and certain sizes of SWNT act as \nsemiconductors. The intrinsic bandgap in semiconducting SWNTs (typically 0.5eV, \nbut this is diameter-dependent) allows them to be used as nanosized semiconducting \nchannels in field-effect transistors (FETs) (114). Since FET-based biomolecular \ndetection does not employ fluorescence, electrochemical, or magnetic tags it has been \ntermed as ‘label-free’ methodology (115-117). FETs generally consist of a substrate \n(gate), two microelectrodes (source and drain), and a SWNT (or SWNT network) that \nbridges the electrodes. Usually SWNTs are grown directly via chemical vapour \ndeposition (CVD) or cast from a dispersion onto a substrate either before or after the \nelectrodes are patterned (118). Single-nanotube FETs require arduous screening of \ndevices to eliminate metallic SWNTs. This need is obviated for nanotube networks \ncast from dispersions, where the 2 to 1 ratio of semiconducting to metallic SWNTs \nrenders the likelihood of forming a continuous metallic pathway between source and \ndrain unlikely. Sensing is based on the fact that the current flow in SWNT FETs is \nextremely sensitive to the binding of biomolecules and produces a detectable signal. A \nwide variety of applications for CNT FETs have been investigated, including the \ndetection of proteins, antibody-antigen interactions, glucose, DNA and DNA \nhybridization. The detection limit for the sensing of proteins or protein-protein \ninteractions has generally been in the range of 100 pM to 100 nM (98).  \n \nAn SWNT-FET binding assay typically involves first immobilising a biological \nreceptor, for example, a nucleotide, aptamer, antibody, or cofactor, thus providing \nrecognition sites for target analytes, for example, complementary DNA strand, \nprotein, antigen, or apo-protein. The current–voltage characteristics or conductance of \nthe receptor-modified SWNT-FET are measured prior to analyte binding. This is \ngenerally followed by a blocking step to minimize non-specific binding of targets. \nFinally, the current–voltage characteristics or conductance of the SWNT-FET device \nis measured following exposure to the analyte (119).  \n \n50-amino-modified aptamers (oligonucleic acid or peptide molecules that bind to a \nspecific target molecule) immobilised on a CNT-FET were used to detect \nimmunoglobulin E (IgE) (120). The net current change increased with the IgE \nconcentration and a detection limit for IgE of 250 pM was reported. Li et al. (121) \n15 \n \nstudied the detection of PSA with a FET comprised of a network of SWNTs. The \nauthors measured the electronic interaction of an anti-PSA antibody in the act of \ncapturing PSA. The interaction is thought to be a charge-transfer mechanism with a \nreported limit of detection of 14 pM, at a signal-to-noise ratio of 2. SWNT-FET \nbiosensors can achieve pM detection limits for DNA hybridization (110) and \nantibody–antigen binding (98, 122). \n \n2.1.2 CNT-Optical sensors \nIndividual semiconducting SWNTs exhibit photoluminescence, with discrete bands in \nthe near-infrared region between 900 and 1600nm. Since biologically relevant \nsamples such as blood and tissue have low absorption in this region, the sharp \nnanotube fluorescence spectra may be detected even in a complex biological \nenvironment. Such semiconducting SWNTs were used as near-IR fluorescent tags for \ncell imaging and to selectively probe cell surface receptors (123). The nanotubes were \nfirst non-covalently functionalised with amine groups using the surfactant PL-PEG-\nNH2, followed by conjugation with antibodies recognising both the CD20 cell surface \nreceptor (Rituxan) and the HER2\/neu receptor on certain breast cancer cells \n(Herceptin). In vitro near-IR fluorescence imaging showed specific binding of the \nantibody-conjugated SWNTs to the host cells, with high specificity for the different \nantibodies (55:1 and 20:1 for host cells:non-host cells).  \n \nBarone et al. linked enzyme reactions to CNT fluorescence, creating a sensor whereby \nan enzymatic reaction could be followed by monitoring fluorescence (124). The \nauthors non-covalently functionalised SWNTs with glucose oxidase (GOx) and \npotassium ferricyanide. The functionalisation with potassium ferricyanide quenches \nthe SWNT fluorescence. Addition of glucose to the GOx-SWNT sensing complex \nresulted in the ferricyanide ions leaving the surface of the CNT yielding a recovery of \nthe CNT fluorescence. The authors could relate the CNT near-infrared fluorescence to \nthe glucose concentration and maintain that this type of sensor, enveloped in a small \ndialysis capillary, could be implanted in the body. The capillary could allow glucose \nto diffuse in, easily allowing sugar levels to be measured. This research demonstrates \nthe feasibility of using CNT sensor systems in implantable biomedical sensors. \n \n2.2 CPs \n16 \n \n2.2.1 CP-Electrochemical sensors \nAn L.O.D. of 3.4 x 10-10 mol\/L was reported for a simple electrochemical \noligonucleotide (ODN) sensor made using PAni nanotubes (125). Solutions used \nduring PAni synthesis contain polymeric acid (polymethyl vinyl ether-alt-maleic \nacid), and hence nanotubes have residual carboxylic acid functionalities which can be \nused to covalently graft ODN via carbodiimide chemistry. The authors report that they \nexpect to achieve an even lower detection limit by optimizing the nanotube surface \narea. PAni nanowires can also be synthesised electrochemically, and subsequently \nmodified with oligonucleotides via EDC coupling between phosphate groups and the \namino groups of PAni (126). Using this method the complimentary DNA target could \nbe detected down to a concentration of 1 x 10-12 mol\/L. DNA-functionalised \npolyaniline nanofibres (100nm diameter) can also be used to specifically detect \nGonorrhea. Up to 0.5 × 10−15 M of complementary target could be detected by \ndifferential pulse voltammetry within 60 seconds of hybridisation (127). These \nelectrodes are found to be highly specific to distinguish the presence of N. \ngonorrhoeae from N. meningitidis and other Gram-negative bacteria, (such as E. coli). \nThe performance of this STD sensor in clinical samples is being explored by the \nauthors, and findings are expected to also have implications in relation to the clinical \ndiagnosis of other sexually transmitted diseases. \n \nCPs can also be used to detect many other targets for example, Dhand et al. report an \nelectrode biosensor where cholesterol oxidase (ChOx) is covalently immobilised onto \nnano-structured PANI on indium tin oxide (ITO). Using this set-up good selectivity \ncan be achieved and it is significant that interferants such as AA, UA, glucose, lactic \nacid, sodium pyruvate and urea were found to have a negligible effect on the sensor. \nChOx\/PANI\/ITO electrodes retain about 85% activity after 11 weeks (when stored at \n4 oC) and can be used ~ 20 times with 2–3% error range. Another example of a \ncholesterol sensor is where the electropolymerisation an enzyme with laponite \nnanoparticles in a polypyrrole matrix was shown to increase the sensitivity of \ndetection from 5.1 (without laponite nanoparticles) to 13.2 mA M-1 cm-2 (128). \n \nAlong with good sensitivity and selectivity, nanostructured biosensors typically \nexhibit fast response times. For example an amperometric biosensor designed for the \ndetection of phosphate ions has a response time of 6 seconds (129). In this example, \n17 \n \npyruvate oxidase (PyO) was covalently immobilised onto nano-particles (5-40nm) of \npoly-5,2′:5′,2″-terthiophene-3′-carboxylic acid (PTCA). The electron transfer rate \nconstant from immobilised PyO was determined to be 0.65 s−1, with a detection limit \nof ~0.3 µM.  This biosensor can be stored and re-used for up to one month without \nany loss in sensitivity. A similar biosensor of PTCA nanoparticles was used to \ncovalently immobilise glutamate oxide. Glutamate concentrations could be \ndetermined, and an LOD of 0.1µM was reported for an in vitro measurement (wherein \nthe biosensor was implanted into a rat’s brain). \n \nPolypyrrole is another example of a CP which can be used in the nanoform for low \nL.O.D biomolecule detection. An example of this is where a pyrrole monomer and \nbiomolecule receptor (avidin) were electropolymerised within 100 nm wide channels \n(130). When exposed to biotin−DNA, the conducting polymer nanowires generated a \nrapid change in resistance, with sensitivity as low as 1 nM. The method described \noffers advantages of direct incorporation of functional biological molecules into the \nconducting-polymer nanowire during its synthesis, site-specific positioning, built-in \nelectrical contacts, and scalability to high-density nanoarrays.  Polypyrrole nanofibres \nwere also developed with an even lower L.O.D of 100-200 fg mL -1. Nanofibres were \nused to detect salivary protein markers. An exceptionally low L.O.D of 10aM was \nreported by the authors for IL-8 mRNA (131). Advantages of this method are the low \nL.O.D combined with the fact that the detection method is label-free with excellent \ncontrol over non-specific binding.  \n \n2.4 CP-Optical sensors \nAs well as electrochemical detection, nanostructured CPs can also be used for the \noptical detection of biomolecules. An example of this is where functionalised silica-\nPPy nanocomposites were used to detect anti-HSA. Flocculation of the \nnanocomposite dispersion occurs upon anti-HSA binding and the system can therefore \nbe used for visual diagnostic assays (132). Human serum albumin (HSA) is of interest \nas a target as it was previously used to detect renal disease. In another example of a \nHSA biosensor, pyrrole-propylic acid nanowires can be synthesized electrochemically \nvia a templated method and subsequently modified using EDC crosslinker to \ncovalently bind anti-HSA. Using this as a platform, HSA can then be detected using \n18 \n \noptical or electrical methods. Using an FET configuration nanomolar levels of HSA \nwere reported (133). \n \n3. Composites \nBy using nanostructured (versus bulk) materials, it is possible to develop biosensors \nwhich exhibit higher signal-to-background ratios, shorter response times, higher \nsensitivities and greater selectivity than previous biosensor configurations. Many \ndifferent nanostructured geometries can be used to develop biosensors with improved \nsensing capabilities. However, it is interesting to also consider hybrid composites \ncomposed of two or more materials (134). Using this approach the advantageous \nproperties of each constituent can be exploited. CNT and CPs can be combined \ntogether (and also with other materials) to produce improved biosensors (19, 135). In \ngeneral the incorporation of CNTs tend to improve the sensitivity and selectivity of a \nbiosensor (69). \n \nComposites can be used to improve the selectivity of biosensors, for example in \ndopamine monitoring. Dopamine (DA) is an important neurotransmitter and abnormal \nlevels can be used to diagnose certain nervous diseases such as Parkinsons and \nepilepsy. DA is easily oxidisable which can enable detection (typically levels in urine \nsamples are monitored). However other electroactive compounds are present along \nwith DA. In particular AA and UA can cause a problem as they oxidise at almost the \nsame potential resulting in interference. Incorporation of CNTs and surfactant, along \nwith CPs, have been used as ways to selectively detect DA(25). CPs can also be \ncombined with gold and Mathiyarasu et al. report Poly(3,4-ethylenedioxythiophene), \nPEDOT-Au nanocomposite films for sensing DA and UA simultaneously (115 mV \nand 246 mV, for DA and UA respectively) (76). It is significant that detection can be \nachieved in the presence of excess AA which is present in both blood and urine, thus \ncomplicating detection. Abnormal levels of UA are symptomatic of diseases such as \ngout and Lesch-Nyhan syndrome. The PEDOT matrix contributes towards the peak \nseparation (selectivity) while also promoting catalytic oxidation of the above \ncompounds. Gold nano-particles facilitate nanomolar sensing (sensitivity). Thus, it is \npossible to detect nanomolar levels of DA and UA in presence of excess AA. This \ncomposite nanomaterial shows superior selectivity and sensitivity compared to the \npolymer film alone, and presents an interesting step forward as a major challenge is to \n19 \n \ndevelop a sensitive and selective method for UA and DA detection (Ates et al., \n2009(25)). \n \nGold can also be combined with other CPs, and Prabhakar et al.\n \n(136) report a nucleic \nacid sensor whereby pathogen-specific DNA and PNA (peptide nucleic acid) probes \nwere covalently immobilized onto a PAni-Au electrode. These nanostructured \nelectrodes were then utilized for the detection of hybridization with a complementary \nsequence (M. tuberculosis in this case). The PNA-PANI\/Au electrode exhibits a \ndetection limit of 0.125 × 10-18 M, with the DNA-PANI\/Au electrode showing 2.5 × \n10-18 M. Improved specificity (1000 times) was also observed for PNA-PANI\/Au. \nResponses were observed within 30 seconds of hybridization time. These DNA-\nPANI\/Au and PNA-PANI\/Au electrodes can be used 6−7 and 13−15 times, \nrespectively. For increased sensitivity, reusability, and better detection limit, authors \nrecommend the development of nanocomposites and functionalized conducting \npolymers. In this way it should be possible to detect other pathogens including \nSalmonella typhimurium and Nesseria gonorrhea. \n \nQu et al. report a nanostructured composite amperometric biosensor for choline (16), \nwhich is based on a functionalised CNT-PAni multilayer film. Carboxylic acid groups \nwere attached to the CNTs and the films were prepared using a layer-by-layer \nassembly method. By linking choline oxidase (CHOD), a choline biosensor was \nprepared with a linear response range of 1 × 10−6 to 2 × 10−3 M, and a response time \nof 3s. The commonly encountered interference arising from AA and uric acid UA \ncould be rejected successfully by the polymer. The same approach can be applied to \nimmobilise other oxidase enzymes, such as glucose oxidase and cholesterol oxidase, \nfor the fabrication of biosensors. This anti-interference biosensor displays a rapid \nresponse, an expanded linear response range, excellent reproducibility and good \nstability. \n \nLiu et al. report how polyaniline-carbon nanotube multilayer films can be prepared by \nthe layer-by-layer assembly method and used for stable low-potential detection of β-\nnicotinamide adenine dinucleotide (NADH) (7). The carbon nanotubes are modified \nwith poly(aminobenzenesulfonic acid), and this acts as a PAni dopant, thus shifting its \nelectroactivity to a neutral pH environment. Resulting films show good \n20 \n \nelectrocatalytic ability toward the oxidation of reduced NADH at a much lower \npotential than usual. The response is linear with concentration between 5 × 10-6 and 1 \n× 10-3 M, and the detection limit can go down to 1 × 10-6 M. Therefore the system \nshows good potential for developing dehydrogenase-based biosensors depending on \nNADH as a cofactor. \n \nIt is evident from the literature that incorporating nanoparticles into CNT-based \nglucose biosensors yields higher sensitivity. This is attributed to the enhanced \ncatalytic activity and large surface area obtained by combining CNTs and \nnanoparticles. The most sensitive glucose biosensors however do not always operate \nin the most important clinical ranges as highlighted by Balasubramanian and \nBurghard (94). Tang et al. (137) have reported what can be regarded as an ideal yet \npractical sensor as it exhibits good sensitivity within a large clinically relevant \ndetection range. In this case a CNT forest was grown directly on the graphite substrate \nfollowed by functionalisation with Pt nanoparticles, glucose oxidase and a thin layer \nof Nafion to improve stability. This system showed good reproducibility, \ndemonstrated good correlation with independent clinical values in the analysis of \nglucose levels in serum and was able to deliver a signal in less than five seconds. A \ncomparable sensor set-up was reported by Claussen et al. where they describe \nfabricating a ‘CNT forest’ like electrode decorated with Au-coated Pd nanocubes \n(138). The outer gold surface allowed for glucose oxidase functionalisation to yield a \nsensor with a wide working range and response time of just 6 seconds. Glucose can \nalso be detected by a novel multilayer AU NP \/ MWNT \/ glucose oxidase membrane, \ndeveloped by Liu et al. (139).  This membrane showed excellent electrocatalytic \ncharacter for glucose biosensing at a relatively low potential (-0.2 V).  The resulting \nsensor could detect glucose up to 9.0 mM with a detection limit of 128 mM.  \n \n \n4. Conclusion and Outlook \nA key aspect in biosensor development still remains the integration of the electrical \ncomponent with the biological recognition molecule. The development of \nminiaturised biosensors with improved sensitivity requires immobilisation of \nbiomolecules (including DNA, antibodies, aptamers, PNAs and enzymes) onto a \nsurface, such that a maximum number of biomolecules per unit area can be attached, \n21 \n \nwhile simultaneously being accessible to target species. Nanostructured surfaces are \nbecoming increasingly significant in this regard as they possess high surface-to-\nvolume ratios, providing a greater number of sites for attachment. It is important to be \nable to functionalise nanostructures with specific biomolecules in a controllable and \nreproducible fashion. Biomolecular probes must also be carefully attached to prevent \nreactivity loss. We have shown here that both CPs and CNTs are effective transducers \nwhich can be used for the immobilisation of biomolecules. Both materials are \nconductive and stable in biological systems. Future requirements include improving \nimmobilisation efficiency, tailoring nanostructured interfaces, and integrating these \noptimised nanobiosensors into external circuitry. The improvement of transduction \nmechanisms continues to be an important focus for biosensor research, and here we \nhave shown that CPs and CNTs show great promise as efficient transducers. Graphene \nis the 2D form of CNTs and is also becoming increasingly important for biosensor \napplications (96). Quantum effects play a significant role in the behaviour of \nnanomaterials and can lead to novel optical, electrical and electrochemical properties. \nCareful engineering of materials at the nanoscale means that their small size and novel \ncharacteristics can be exploited for practical bio-applications. Physical and chemical \nproperties of materials, such as colour, and ability to conduct charge, are different at \nthe nanoscale making it possible to achieve a number of improvements over more \ntraditional bulk substrates.  \n \nThe use of hybrid nanomaterials is becoming increasingly popular as it offers the \nopportunity to combine the advantageous properties of each individual constituent in a \nsingle composite material (140). Composites are suitable for multiplexed biosensing \nenabling the detection of multiple analytes using a single assay. The signal to noise \nratio could be further improved using a combination of optimised nanomaterials and \nadvanced circuitry. It is also interesting to consider the idea of personalised healthcare \nwhereby wearable sensors are becoming increasingly important (141). Many \nchallenges still remain in this area including the miniaturisation of integrated sensors \nand also issue of power supply. Thus as we have described, a wide range of \nnanomaterials and detection mechanisms are suitable for biosensing. The high surface \narea, porosity, and unique properties of nanomaterials facilitate the ultimate aim of a \nbiosensor to achieve a significantly lower limit of biomolecule detection. The \ndevelopment of nanostructured biosensors is critical for further advancing the field of \n22 \n \nmedical diagnostics. Therefore, the importance of nanomaterials for biosensor \ndevelopment cannot be overstated.  \n \n \n \nAcknowledgements \nThis material is based upon research supported by the Science Foundation Ireland \nunder Grant No. 05\/CE3\/B754. NG acknowledges The EU seventh Framework Grant \nNo. FP7-SME-2008-232037. CL acknowledges the EU Seventh Framework \nProgramme for support in the form of a Marie Curie Re-Integration Grant No. \nPIRG02-GA-2007-224880. EL and DD acknowledge SFI 07\/CE\/I1147 - \"CLARITY: \nCentre for Sensor Web Technologies\", and Enterprise Ireland PC\/2008\/0149. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n23 \n \n \n    \nFigure 1: Nanomaterials have many potential applications. Images (left) show; a \nCNT-based flexible full-colour e-paper device (Samsung, 2008), a flexible transparent \nCNT composite (image courtesy of E. Lahiff), and a CNT-reinforced BMC bike used \nin the 2005 Tour de France Nanotechnology is expected to generate $2.5 trillion by \n2015 (right: Sourced from Lux Research Inc.) \n \n24 \n \n \nFigure 2: The relative size of some nanoparticles in comparison with biological molecules. \n 25 \n \n \n \n              \nFigure 4: A SWNT can be visualised as a rolled-up sheet of graphite capped by half a C60 \nmolecule (left). CNTs can also exist as DWNTs and MWNTs. TEM images reveal the \nnumber of walls present (right shows 5, 2 and 7  layers)(26). Reproduced with permission \nfrom the Nature Publishing Group. \n \n \n \nFigure 4: Nanotubes possess an armchair, zig-zag or chiral structure depending on the angle \nat which they are rolled up (this determines n, m and θ values).  \n \n \n \nZig-zag \nArmchair \n (m = n) \n 26 \n \n     \nFigure 5: Biomolecules can be covalently attached to acid functionalities on CNT surfaces \nvia EDC\/NHS coupling with amide groups on a biomolecule (scheme shown top). TEM can \nbe used to effectively image CNTs before (left) and after (right) biomolecule attachment. \nDark spheres represent the iron core of HRP attached to CNT surfaces (Images courtesy of C. \nLynam). \n \n \n \n 27 \n \nFigure 6:  The chemical structure of relevant CPs. Conjugated bonds facilitate improved \nelectron transport. \n 28 \n \n \n   \nFigure 7: The chemical bonding structure of the CP PAni is sensitive to the chemical \nenvironment of the material (left). In its nanoform, the material is more response than in the \nbulk form (sensing results, right)(142). Reproduced with permission from the American \nChemical Society. \n \n \n \n \n \n \n \n 29 \n \nFigure 8: Schematic representation of biomolecular sensing using carbon nanotubes in \nvarious device configuration and signal amplification strategies (114). Reproduced with \npermission from Wiley-VCH Verlag GmbH. \n 30 \nTable 1: Enhanced biosensor sensitivity can be achieved by incorporating NPs. \nNanoparticle  Detection \nSystem \nAnalyte Limit of detection (L.O.D) Ref \nCP (PAni) Photometric Cholesterol Oxidase 25mg\/dL (71) \nCP (PTCA) Amperometric Pyruvate oxidase \nGlutamate oxidase \n0.3µM \n0.1µM \n(76) \n(15) \nCP (PPy) Amperometric Biotin-DNA 1nM (77) \nCP (PAni) Amperometric ODN 3.4x10-10 mol\/L (0.34 nM) (78)  \nCP (PAni) Voltammetry Gonorrhea 0.5x10-15 M (0.5 fM) (77) \nCP (Pani)  Capacitive human IgG 1.87 ng mL−1 (1.87 ng\/ml) (143) \nPAni-gold Amperometric Tuberculosis DNA 0.125x10-18 M (0.125 aM) (77) \nPani-CNTs  Electrochemical \nimpedance \nspectroscopy \nNADH 1x10-6 M (1 µM) (77) \nMWNT Amperometric Cholesterol 0.2 mmol\/l (0.2 mM) (101) \nMWNT-Pt  Differential pulse \nvoltammetry \nDNA 1x10-11 mol\/l (10 pM) (103) \nSWNT Amperometric PSA 4 pg\/ml (110) \nSWNT FET Thrombin 10nM (144) \nSWNT FET Carcinoembryonic \nantigen \n300fM (129) \n 31 \nReferences \n \n1. Auffan M RJ, Bottero J, Lowry G, Jolivet J, Wiesner M 2009. Nat Nanotech 4: 634–\n41 \n2. Pushparaj VL SM, Kumar A, Murugesan S, Ci L, Vajtai R, Linhardt RJ, Nalamasu \nO, Ajayan PM 2007. Nat Acad Sci (USA) 104: 13574-7 \n3. Cadek M CJ, Ryan KP, Nicolosi V, Bister G, Fonseca A, Nagy JB, Szostak K, \nBéguin F, Blau WJ 2004. Nano Letters 4: 353-6 \n4. Spinks GM MV, Bahrami-Samani M, Whitten PG, Wallace GG 2006. Adv Mater 18: \n637-40 \n5. Fanchini G, Miller S, Parekh LB, Chhowalla M. 2008. Nano Letters 8: 2176-9 \n6. Xu K, Huang J, Ye Z, Ying Y, Li Y. 2009. Sensors 9: 5534-57 \n7. Liu ZM LJ, Shen GL, Yu RQ. 2009. Anal Lett 42: 3046-57 \n8. Chen J W-JB, Lynam C, Ngamna O, Moulton S, Zhang W, Wallace GG 2006. \nElectrochem Solid St 9: H68-H70 \n9. Ko YJ MJ, Ahn Y,  Hwang SY, Cho NG,  Lee SH. 2008. Electrophoresis 29: 3466-76 \n10. Healy DA HC, Leonard P, McKenna L, O'Kennedy R 2007. Trends Biotechnol 25: \n125-31 \n11. Byrne B SE, Gilmartin N, O'Kennedy R 2009. Sensors 9: 4407-45 \n12. Sanvicens N PC, Pascual N,  Marco MP 2009. Trends Anal Chem 28: 1243-52  \n13. Sepúlveda B, González-Díaz JB, García-Martín A, Lechuga LM, Armelles G. \nPhysical Review Letters 104: 147401 \n14. Leland CC, Jr., Champ L. 1962. Annals of the New York Academy of Sciences 102: \n29-45 \n15. Halliwell CM, Simon E, Toh C-S, Bartlett PN, Cass AEG. 2002. Analytica Chimica \nActa 453: 191-200 \n16. Qu F, Yang M, Jiang J, Shen G, Yu R. 2005. Analytical Biochemistry 344: 108-14 \n17. Rahman MA, Kwon N-H, Won M-S, Choe ES, Shim Y-B. 2005. Analytical Chemistry \n77: 4854-60 \n18. Morrin A, Ngamna O, Killard A, J., Moulton S, E., Smyth M, R. , Wallace G, G. . \n2005. Electroanalysis 17: 423-30 \n19. Hong C, Ying X, Pin-Gang H, Yu-Zhi F. 2003. Electroanalysis 15: 1864-70 \n20. Sepúlveda B, Angelomé PC, Lechuga LM, Liz-Marzán LM. 2009. Nano Today 4: \n244-51 \n21. Wang  J. 2009. ChemPhysChem 10: 1748-55 \n22. Wanekaya AK, Chen W, Myung NV, Mulchandani A. 2006. Electroanalysis 18: 533-\n50 \n23. Hahm J-i, Lieber CM. 2003. Nano Letters 4: 51-4 \n24. Zheng G, Patolsky F, Cui Y, Wang WU, Lieber CM. 2005. Nat Biotech 23: 1294-301 \n25. Ates M, Sarac AS. 2009. Progress in Organic Coatings 66: 337-58 \n26. Iijima S. 1991. Nature 354: 56-8 \n27. Dresselhaus M DG, Avouris P 2001. Springer, Berlin  \n28. 2002. Acc Chem Res 35: 997-1113 \n29. Tasis D, Tagmatarchis N, Bianco A, Prato M. 2006. Chem Rev 106: 1105-36 \n 32 \n30. Wildgoose GG, Banks CE, Leventis HC, Compton RG. 2006. Microchimica Acta \n152: 187-214 \n31. Thess A, Lee R, Nikolaev P, Dai H, Petit P, et al. 1996. Science 273: 483-7 \n32. Bandow S, Rao AM, Williams KA, Thess A, Smalley RE, Eklund PC. 1997. J. Phys. \nChem. B, 101: 8839–42 \n33. Lynam C, Moulton SE, Wallace GG. 2007. Advanced Materials 19: 1244–8 \n34. Ausman KD, Piner R, Lourie O, Ruoff RS, Korobov M. 2000. J. Phys. Chem. B, 104: \n8911–5 \n35. Lynam C, Wallace GG, D. L. Officer. 2007. Journal of Nanoscience and \nNanotechnology 7: 3487–94 \n36. Mawhinney DB, Naumenko V, Kuznetsova A, Yates JT, Liu J, Smalley RE. 2000. \nChemical Physics Letters 324: 213-6 \n37. Hu H, Bhowmik P, Zhao B, Hamon MA, Itkis ME, Haddon RC. 2001. Chemical \nPhysics Letters 345: 25-8 \n38. Hu H, Ni YC, Montana V, Haddon RC, Parpura V. 2004. Nano Letters 4: 507-11 \n39. Kong H, Gao C, Yan DY. 2004. Macromolecules 37: 4022-30 \n40. Chen QD, Dai LM, Gao M, Huang SM, Mau A. 2001. Journal of Physical Chemistry \nB 105: 618-22 \n41. Hazani M, Naaman R, Hennrich F, Kappes MM. 2003. Nano Letters 3: 153-5 \n42. Fu KF, Huang WJ, Lin Y, Zhang DH, Hanks TW, et al. 2002. Journal of \nNanoscience and Nanotechnology 2: 457-61 \n43. Huang WJ, Taylor S, Fu KF, Lin Y, Zhang DH, et al. 2002. Nano Letters 2: 311-4 \n44. Liu JQ, Chou A, Rahmat W, Paddon-Row MN, Gooding JJ. 2005. Electroanalysis \n17: 38-46 \n45. Gooding JJ, Wibowo R, Liu JQ, Yang WR, Losic D, et al. 2003. Journal of the \nAmerican Chemical Society 125: 9006-7 \n46. Williams KA, Veenhuizen PTM, de la Torre BG, Eritja R, Dekker C. 2002. Nature \n420: 761- \n47. Dwyer C, Guthold M, Falvo M, Washburn S, Superfine R, Erie D. 2002. \nNanotechnology 13: 601-4 \n48. Lee CS, Baker SE, Marcus MS, Yang WS, Eriksson MA, Hamers RJ. 2004. Nano \nLetters 4: 1713-6 \n49. Chen RJ, Bangsaruntip S, Drouvalakis KA, Kam NWS, Shim M, et al. 2003. \nProceedings of the National Academy of Sciences of the United States of America 100: \n4984-9 \n50. Shim M, Kam NWS, Chen RJ, Li YM, Dai HJ. 2002. Nano Letters 2: 285-8 \n51. Chen RJ, Zhang YG, Wang DW, Dai HJ. 2001. Journal of the American Chemical \nSociety 123: 3838-9 \n52. Guo ZJ, Sadler PJ, Tsang SC. 1998. Advanced Materials 10: 701-3 \n53. Moulton SE, Minett AI, Murphy R, Ryan KP, McCarthy D, et al. 2005. Carbon 43: \n1879-84 \n54. Moulton SE, Maugey M, Poulin P, Wallace GG. 2007. Journal of the American \nChemical Society 129: 9452-7 \n55. Lynam C, Gilmartin N, Minett AI, O'Kennedy R, Wallace G. 2009. Carbon 47: \n2337-43 \n56. Gerard M, Chaubey A, Malhotra BD. 2002. Biosensors and Bioelectronics 17: 345-59 \n 33 \n57. Lahiff E, Woods T, Blau W, Wallace GG, Diamond D. 2009. Synthetic Metals 159: \n741-8 \n58. Hideki Shirakawa EJL, Alan G. MacDiarmid, Chwan K. Chiang and Alan J. \nHeeger. 1977. J. Chem. Soc., Chem. Commun.: 578 - 80 \n59. Gustafsson G, Cao Y, Treacy GM, Klavetter F, Colaneri N, Heeger AJ. 1992. Nature \n357: 477-9 \n60. Greenham NC, Moratti SC, Bradley DDC, Friend RH, Holmes AB. 1993. Nature \n365: 628-30 \n61. Arias AC, Granström M, Thomas DS, Petritsch K, Friend RH. 1999. Physical \nReview B 60: 1854 \n62. Morrin A, Ngamna O, O'Malley E, Kent N, Moulton SE, et al. 2008. Electrochimica \nActa 53: 5092-9 \n63. Joshi PP MS, Wang Y, Schmidtke DW 2005. Anal Chem 77: 3183-8 \n64. MacDiarmid AG. 2001. Angewandte Chemie-International Edition 40: 2581-90 \n65. Yue J, Wang ZH, Cromack KR, Epstein AJ, MacDiarmid AG. 1991. Journal of the \nAmerican Chemical Society 113: 2665-71 \n66. Lahiff E, Lynam C, Gilmartin N, Wallace G, O’Kennedy R, Diamond D. 2009. \nMater. Res. Soc. Symp. Proc.  : 240-WW06-02 \n67. Kincal D, Kumar A, Child AD, Reynolds JR. 1998. Synthetic Metals 92: 53-6 \n68. Spinks GM, Mottaghitalab V, Bahrami-Samani M, Whitten PG, Wallace GG. 2006. \nAdvanced Materials 18: 637-40 \n69. Guimard NK, Gomez N, Schmidt CE. Progress in Polymer Science 32: 876-921 \n70. Li D, Huang J, Kaner RB. 2008. Accounts of Chemical Research 42: 135-45 \n71. Dhand C, Singh SP, Arya SK, Datta M, Malhotra BD. 2007. Analytica Chimica Acta \n602: 244-51 \n72. Huang J, Kaner RB. 2003. Journal of the American Chemical Society 126: 851-5 \n73. Huang JX, Kaner RB. 2006. Chemical Communications: 367-76 \n74. Khan R, Solanki P, Kaushik A, Singh S, Ahmad S, Malhotra B. 2009. Journal of \nPolymer Research 16: 363-73 \n75. Malhotra BD, Chaubey A, Singh SP. 2006. Analytica Chimica Acta 578: 59-74 \n76. Mathiyarasu J, Senthilkumar S, Phani KLN, Yegnaraman V. 2007. Journal of \nNanoscience and Nanotechnology 7: 2206-10 \n77. Peng H, Soeller C, Vigar NA, Caprio V, Travas-Sejdic J. 2007. Biosensors and \nBioelectronics 22: 1868-73 \n78. Sangodkar H, Sukeerthi S, Srinivasa RS, Lal R, Contractor AQ. 1996. Analytical \nChemistry 68: 779-83 \n79. Ahuja T, Mir IA, Kumar D, Rajesh. 2007. Biomaterials 28: 791-805 \n80. Wang JJ, Myung NV, Yun MH, Monbouquette HG. 2005. Journal of \nElectroanalytical Chemistry 575: 139-46 \n81. Lisdat F, Schafer D. 2008. Analytical and Bioanalytical Chemistry 391: 1555-67 \n82. Daniels JS, Pourmand N. 2007. Electroanalysis 19: 1239-57 \n83. Wang J. 2005. Electroanal 17: 7-14 \n84. Yun Y DZ, Shanov V, Heineman WR,  Halsall HB, Bhattacharya A, Conforti L, \nNarayan RK, Ball WS, Schulz MJ 2007. Nano Today 2: 30-7 \n85. Pumera M, Sánchez S, Ichinose I, Tang J. 2007. Sensors and Actuators B: Chemical \n123: 1195-205 \n 34 \n86. Wang J. 2005. Analyst 130: 421-6 \n87. Gooding J. 2005. Electrochim Acta 50: 3049-60 \n88. Zhao YD ZW, Chen H, Luo QF, Li SFY 2002. Sens Actuators B 87: 168–72 \n89. Wang JX LM, Shi ZJ, Li NQ, Gu ZN 2002. Anal Chem 74: 1993–7 \n90. Davis JJ CR, Hill HAO 1997. J Electroanal Chem 440: 279–82 \n91. Li J, Cassell A, Delzeit L, Han J, Meyyappan M. 2002. Journal of Physical Chemistry \nB 106: 9299-305 \n92. Gao M, Dai LM, Wallace GG. 2003. Electroanalysis 15: 1089-94 \n93. Goepel W, Jones TA, Kleitz M, Lundstroem J, Seiyama T. 1991. In Sensors: a \ncomprehensive survey, ed. W Goepel, J Hesse, JN Zemel. Weinheim: Verlag Chemie \n94. Balasubramanian K, Burghard M. 2006. Anal Bioanal Chem 385: 452-68 \n95. Rivas GA, Rubianes MD, Rodriguez MC, Ferreyra NF, Luque GL, et al. 2007. \nTalanta 74: 291-307 \n96. Yang W, Ratinac KR, Ringer SP, Thordarson P, Gooding JJ, Braet F. 2010. Angew \nChem Int Ed Engl 49: 2114-38 \n97. Jacobs CB, Peairs MJ, Venton BJ. 2010. Anal Chim Acta 662: 105-27 \n98. Rusling JF ZZ. 2003. Vol 111: Marcel Dekker, New York \n99. Rubianes MD, Rivas GA. 2003. Electrochemistry Communications 5: 689-94 \n100. Guo ML, Chen JH, Li J, Nie LH, Yao SZ. 2004. Electroanalysis 16: 1992-8 \n101. Li G, Liao JM, Hu GQ, Ma NZ, Wu PJ. 2005. Biosensors & Bioelectronics 20: 2140-\n4 \n102. Cai H, Cao X, Jiang Y, He P, Fang Y. 2003. Anal Bioanal Chem 375: 287-93 \n103. Zhu N, Chang Z, He P, Fang Y. 2005. Analytica Chimica Acta 545: 21-6 \n104. Ferancová A, Ovádeková R, Vaní M, ccaron, ková, et al. 2006. Electroanalysis 18: \n163-8 \n105. Kerman K, Morita Y, Takamura Y, Ozsoz M, Tamiya E. 2004. Electroanalysis 16: \n1667-72 \n106. Ye Y, Ju H. 2005. Biosensors and Bioelectronics 21: 735-41 \n107. Li J, Ng HT, Cassell A, Fan W, Chen H, et al. 2003. Nano Letters 3: 597-602 \n108. Wang J, Kawde AN, Musameh M. 2003. Analyst 128: 912-6 \n109. Heng LY, Chou A, Yu J, Chen Y, Gooding JJ. 2005. Electrochemistry \nCommunications 7: 1457-62 \n110. Yu X MB, Patel V, Jensen G, Bhirde A,  Gong JD, Kim SN, Gillespie J, Gutkind JS, \nPapadimitrakopoulos F, Rusling JF 2006. J Am Chem Soc 128: 11199-205 \n111. Wang J LGJM. 2004. J Am Chem Soc 126: 3010-1 \n112. Wang J, Liu G, Jan MR. 2004. J Am Chem Soc 126: 3010-1 \n113. Lin YY, Wang J, Liu G, Wu H, Wai CM, Lin Y. 2008. Biosens Bioelectron 23: 1659-\n65 \n114. Kim SN, Rusling, J.F., Papadimitrakopoulos, F. . 2007. Adv Mater 19: 3214–28 \n115. Chen RJ BS, Drouvalakis KA, Kam NWS, Shim M, Li Y, Kim W, Utz PJ, Dai H \n2003. Proc Natl Acad Sci USA 100: 4984-489 \n116. Star A TE, Niemann J, Gabriel JCP, Joiner CS, Valcke C 2006. Proc Natl Acad Sci \n(USA) 103: 921-6 \n117. Zheng G PF, Cui Y, Wang WU, Lieber CM. 2005. Nature Biotechnol 23: 1294-301 \n118. Stokes P KS. 2008. Nanotechnology 19: 175202\/1-4 \n 35 \n119. Lu F GL, Meziani MJ, Wang X, Luo PG, Veca LM, Cao L, Sun YP 2009. Adv Mater \n21: 139–52 \n120. Maehashi K KT, Kerman K, Takamura Y, Matsumoto K, Tamiya E 2007. Anal \nChem 79: 782-7 \n121. Li C CM, Lin H, Lei B, Ishikawa FN, Datar R, Cote R, Thompson M, Zhou C 2005. \nAm Chem Soc 127: 484-5 \n122. Byon HR CH. 2006. J Am Chem Soc 128: 2188-9 \n123. Welsher K LZ, Daranciang D, Dai H 2008. Nano Lett 8: 586-90 \n124. Barone PW BS, Heller DA, Strano MS 2005. Nature Materials 4: 86-92 \n125. Zhang L, Peng H, Kilmartin PA, Soeller C, Travas-Sejdic J. 2007. Electroanalysis \n19: 870-5 \n126. Zhu N, Chang Z, He P, Fang Y. 2006. Electrochimica Acta 51: 3758-62 \n127. Singh R, Prasad R, Sumana G, Arora K, Sood S, et al. 2009. Biosensors and \nBioelectronics 24: 2232-8 \n128. Geetha S, Rao CRK, Vijayan M, Trivedi DC. 2006. Analytica Chimica Acta 568: 119-\n25 \n129. Rahman MA, Park D-S, Chang S-C, McNeil CJ, Shim Y-B. 2006. Biosensors and \nBioelectronics 21: 1116-24 \n130. Ramanathan K, Bangar MA, Yun M, Chen W, Myung NV, Mulchandani A. 2004. \nJournal of the American Chemical Society 127: 496-7 \n131. Wei F, Liao W, Xu Z, Yang Y, Wong DT, Ho C-M. 2009. Small 5: 1784-90 \n132. Azioune A, Ben Slimane A, Hamou LA, Pleuvy A, Chehimi MM, et al. 2004. \nLangmuir 20: 3350-6 \n133. Tolani S, Craig M, DeLong R, Ghosh K, Wanekaya A. 2009. Analytical and \nBioanalytical Chemistry 393: 1225-31 \n134. Agüí L, Yáñez-Sedeño P, Pingarrón JM. 2008. Analytica Chimica Acta 622: 11-47 \n135. Cheng G, Zhao J, Tu Y, He P, Fang Y. 2005. Analytica Chimica Acta 533: 11-6 \n136. Prabhakar N, Arora K, Singh H, Malhotra BD. 2008. The Journal of Physical \nChemistry B 112: 4808-16 \n137. Tang H, Chen J, Yao S, Nie L, Deng G, Kuang Y. 2004. Anal Biochem 331: 89-97 \n138. Claussen JC, Franklin AD, Ul Haque A, Porterfield DM, Fisher TS. 2009. ACS \nNano 3: 37-44 \n139. Liu Y WS, Ju H, Xu L 2007. Electroanal 19: 986-92 \n140. Yinghong X, Chang Ming L. 2008. Electroanalysis 20: 648-62 \n141. Diamond D, Coyle S, Scarmagnani S, Hayes J. 2008. Chemical Reviews 108: 652-79 \n142. Virji S, Kaner RB, Weiller BH. 2006. Journal of Physical Chemistry B 110: 22266-70 \n143. Bandodkar A, Dhand C, Arya S, Pandey M, Malhotra B. Biomedical Microdevices \n12: 63-70 \n144. So H-M, Won K, Kim YH, Kim B-K, Ryu BH, et al. 2005. Journal of the American \nChemical Society 127: 11906-7 \n \n \n"}