{"doi":"10.1016\/j.neuropsychologia.2007.04.019","coreId":"65818","oai":"oai:dro.dur.ac.uk.OAI2:4601","identifiers":["oai:dro.dur.ac.uk.OAI2:4601","10.1016\/j.neuropsychologia.2007.04.019"],"title":"Spared ability to recognise fear from static and moving whole-body cues following bilateral amygdala damage.","authors":["Atkinson,  A. P.","Heberlein,  A. S.","Adolphs,  R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-05-08","abstract":"Bilateral amygdala lesions impair the ability to identify certain emotions, especially fear, from facial expressions, and neuroimaging studies have demonstrated differential amygdala activation as a function of the emotional expression of faces, even under conditions of subliminal presentation, and again especially for fear. Yet the amygdala's role in processing emotion from other classes of stimuli remains poorly understood. On the basis of its known connectivity as well as prior studies in humans and animals, we hypothesised that the amygdala would be important also for the recognition of fear from body expressions. To test this hypothesis, we assessed a patient (S.M.) with complete bilateral amygdala lesions who is known to be severely impaired at recognising fear from faces. S.M. completed a battery of tasks involving forced-choice labelling and rating of the emotions in two sets of dynamic body movement stimuli, as well as in a set of static body postures. Unexpectedly, S.M.'s performance was completely normal. We replicated the finding in a second rare subject with bilateral lesions entirely confined to the amygdala. Compared to healthy comparison subjects, neither of the amygdala lesion subjects was impaired in identifying fear from any of these displays. Thus, whatever the role of the amygdala in processing whole-body fear cues, it is apparently not necessary for the normal recognition of fear from either static or dynamic body expressions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65818.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4601\/1\/4601.pdf","pdfHashValue":"0c3b63606781ef4e8f6ab78ee63b2f0ad0b2f9da","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4601<\/identifier><datestamp>\n      2017-03-08T12:18:13Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Spared ability to recognise fear from static and moving whole-body cues following bilateral amygdala damage.<\/dc:title><dc:creator>\n        Atkinson,  A. P.<\/dc:creator><dc:creator>\n        Heberlein,  A. S.<\/dc:creator><dc:creator>\n        Adolphs,  R.<\/dc:creator><dc:description>\n        Bilateral amygdala lesions impair the ability to identify certain emotions, especially fear, from facial expressions, and neuroimaging studies have demonstrated differential amygdala activation as a function of the emotional expression of faces, even under conditions of subliminal presentation, and again especially for fear. Yet the amygdala's role in processing emotion from other classes of stimuli remains poorly understood. On the basis of its known connectivity as well as prior studies in humans and animals, we hypothesised that the amygdala would be important also for the recognition of fear from body expressions. To test this hypothesis, we assessed a patient (S.M.) with complete bilateral amygdala lesions who is known to be severely impaired at recognising fear from faces. S.M. completed a battery of tasks involving forced-choice labelling and rating of the emotions in two sets of dynamic body movement stimuli, as well as in a set of static body postures. Unexpectedly, S.M.'s performance was completely normal. We replicated the finding in a second rare subject with bilateral lesions entirely confined to the amygdala. Compared to healthy comparison subjects, neither of the amygdala lesion subjects was impaired in identifying fear from any of these displays. Thus, whatever the role of the amygdala in processing whole-body fear cues, it is apparently not necessary for the normal recognition of fear from either static or dynamic body expressions.<\/dc:description><dc:subject>\n        Biological motion<\/dc:subject><dc:subject>\n         Body gestures<\/dc:subject><dc:subject>\n         Emotion recognition<\/dc:subject><dc:subject>\n         Point-light.<\/dc:subject><dc:publisher>\n        Elsevier<\/dc:publisher><dc:source>\n        Neuropsychologia, 2007, Vol.45(12), pp.2772-2782 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-05-08<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4601<\/dc:identifier><dc:identifier>\n        issn:0028-3932<\/dc:identifier><dc:identifier>\n        doi:10.1016\/j.neuropsychologia.2007.04.019<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4601\/<\/dc:identifier><dc:identifier>\n        https:\/\/doi.org\/10.1016\/j.neuropsychologia.2007.04.019<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4601\/1\/4601.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0028-3932","0028-3932"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Biological motion","Body gestures","Emotion recognition","Point-light."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n26 February 2009\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nAtkinson, A. P. and Heberlein, A. S. and Adolphs, R. (2007) ’Spared ability to recognise fear from static and\nmoving whole-body cues following bilateral amygdala damage.’, Neuropsychologia., 45 (12). pp. 2772-2782.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1016\/j.neuropsychologia.2007.04.019\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n26 February 2009\nVersion of attached file:\nAccepted\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nAtkinson, A. P. and Heberlein, A. S. and Adolphs, R. (2007) 'Spared ability to recognise fear from static and\nmoving whole-body cues following bilateral amygdala damage.', Neuropsychologia., 45 (12), pp.\u00002772-2782.\nFurther information on publishers website:\nhttp:\/\/dx.doi.org\/10.1016\/j.neuropsychologia.2007.04.019\n1 \nRunning head: Amygdala Damage Spares Fearful Body Recognition \n \nSpared ability to recognise fear from static and moving whole-body cues \nfollowing bilateral amygdala damage  \n \nAnthony P. Atkinson\na*\n \nAndrea S. Heberlein\nb \nRalph Adolphs\nc\n \n \na \nDepartment of Psychology, Durham University, Durham, DH1 3LE, UK \nb\n Department of Psychology, Harvard University, Cambridge, MA 02138, USA \n \nc \nCalifornia Institute of Technology, Pasadena, CA 91125, USA \n \n \n*Address correspondence to: \nAnthony P. Atkinson \nDepartment of Psychology, Durham University, \nScience Laboratories, South Road, Durham, DH1 3LE, U.K. \nTel. +44 - (0)191 - 3343234 Fax. +44 - (0)191 – 3343241 \nEmail: a.p.atkinson@durham.ac.uk \nAmygdala Damage Spares Fearful Body Recognition 2 \nAbstract \nBilateral amygdala lesions impair the ability to identify certain emotions, especially \nfear, from facial expressions, and neuroimaging studies have demonstrated \ndifferential amygdala activation as a function of the emotional expression of faces, \neven under conditions of subliminal presentation, and again especially for fear. Yet \nthe amygdala’s role in processing emotion from other classes of stimuli remains \npoorly understood. On the basis of its known connectivity as well as prior studies in \nhumans and animals, we hypothesized that the amygdala would be important also for \nthe recognition of fear from body expressions. To test this hypothesis, we assessed a \npatient (S.M.) with complete bilateral amygdala lesions who is known to be severely \nimpaired at recognising fear from faces. S.M. completed a battery of tasks involving \nforced-choice labelling and rating of the emotions in two sets of dynamic body \nmovement stimuli, as well as in a set of static body postures. Unexpectedly, S.M.’s \nperformance was completely normal. We replicated the finding in a second rare \nsubject with bilateral lesions entirely confined to the amygdala. Compared to healthy \ncomparison subjects, neither of the amygdala lesion subjects was impaired in \nidentifying fear from any of these displays. Thus, whatever the role of the amygdala \nin processing whole-body fear cues, it is apparently not necessary for the normal \nrecognition of fear from either static or dynamic body expressions.  \n \nKeywords: Biological motion; body gestures; emotion recognition; point-light. \nAmygdala Damage Spares Fearful Body Recognition 3 \nSpared ability to recognise fear from static and moving whole-body cues \nfollowing bilateral amygdala damage \n1. Introduction \nBilateral amygdala lesions impair the ability to recognise fear, and to a more \nvariable extent anger and other negatively valenced emotions, from static facial \nexpressions (e.g., Adolphs, Tranel, Damasio, & Damasio, 1994, 1995; Adolphs et al., \n1999; Calder, Young, Rowland, Perrett, Hodges, & Etcoff, 1996). The amygdala is \nalso activated by fearful facial expressions in neuroimaging studies, although this \nfinding is more variable and appears to be less specific to fear (e.g., Breiter, Etcoff, \nWhalen, Kennedy, Rauch, & Buckner, et al., 1996; Morris, Frith, Perrett, Rowland, \nYoung, Calder, et al., 1996; Whalen, Shin, McInerney, Fischer, Wright, & Rauch, \n2001; Winston, O'Doherty, & Dolan, 2003), and does not require conscious \nperception of the emotion (Morris, Ohman, & Dolan, 1999) or even of the face (Jiang \n& He, 2006; Morris, de Gelder, Weiskrantz, & Dolan, 2001; Williams, Morris, \nMcGlone, Abbott, & Mattingley, 2004). While other visual stimuli have been less \ninvestigated, greater amygdala activation has been recorded also for fearful versus \nneutral whole-body postures and movements (Atkinson, Heining, & Phillips, in \npreparation; de Gelder, Snyder, Greve, Gerard, & Hadjikhani, 2004; Hadjikhani & de \nGelder, 2003). Yet, as is the case with facial expressions, fear is not the only emotion \nto activate the amygdala when expressed by body movements and such fearful \nmovements do not always activate the amygdala (Grézes, Pichon, & de Gelder, 2007; \nPeelen, Atkinson, Andersson,\n \n& Vuilleumier, under review). Considered together, \nthese findings suggest that the amygdala automatically and rapidly processes \nemotional information from a broader class of visual stimuli, notably including fear \nfrom facial expressions but likely extending also to other social visual stimuli such as \nAmygdala Damage Spares Fearful Body Recognition 4 \nbody postures and movement. \nHowever, to demonstrate that the amygdala is necessary for recognition of fear \nfrom body postures and movement, lesion studies are required. To date only one study \nhas examined the effect of amygdala damage on emotion recognition from body \nexpressions in the absence of facial expressions. Sprengelmeyer et al. (1999) reported \nimpaired identification of fear from static body postures, faces and voices in a male \npatient with a bilateral amygdala lesion, relative to the performance of similarly aged \nneurologically healthy control subjects (a group of 10 in the case of the body posture \ntask). The posture recognition impairment was specific to fear, moderately large (2\/10 \ncorrect compared to control group mean of 6.5\/10; z-score: -2.37), and not easily \nattributable to more general perceptual deficits. However, this subject’s lesion was not \nentirely restricted to the amygdala, notably including some damage to left thalamus, \nnor did the lesion encompass the entire extent of both amygdalae, the damage to the \nleft amygdala being incomplete and smaller than that to the right amygdala. Thus it is \npossible that the impaired recognition of fear from body postures in this subject was \nnot entirely a consequence of amygdala damage. Furthermore, Sprengelmeyer et al.’s \n(1999) study did not examine emotion recognition from moving bodily expressions. \nThe purpose of the present study was to examine more thoroughly the critical role of \nthe amygdala in the recognition of emotions from a large set of whole-body emotional \nstimuli including both moving and static expressions. We tested a subject, S.M., \nwhose brain damage encompasses all of the amygdala bilaterally, and who has been \nextensively documented to be severely impaired at recognising fear from faces (e.g., \nAdolphs et al., 1994, 1995, 1999). To replicate the findings and confirm their \nspecificity to the amygdala, we also tested a second subject, A.P., who has bilateral \ndamage encompassing most of the amygdala and confined completely to the \nAmygdala Damage Spares Fearful Body Recognition 5 \namygdala. \n2. Methods \n2.1 Participants \nWe tested two extremely rare women with bilateral amygdala lesions resulting \nfrom Urbach-Wiethe disease, S.M. and A.P. Background information, \nneuroanatomical data, and face and facial emotion recognition abilities for both \nsubjects with amygdala lesions have been described previously (Adolphs et al., 1994, \n1995, 1999; Buchanan, Tranel, & Adolphs, in press), and are summarised in Table 1. \nWhereas S.M. has complete bilateral amygdala damage, as well as minor damage to \nanterior entorhinal cortex, A.P. has bilateral damage encompassing approximately \n70% of the amygdala, which does not extend beyond the amygdala at all. S.M. was 39 \nyears old when she undertook the first set of tasks (reported as Tasks 3 and 4 in \nSections 2.3.3 and 2.3.4) and 40 when she carried out the second set (reported as \nTasks 1 and 2 in Sections 2.3.1 and 2.3.2). A.P. was 21 years old at the time of \ntesting. \n----- Insert Table 1 about here. ----- \n We compared performances given by S.M. and A.P. with those given by 2 \nneurologically and psychiatrically healthy comparison groups of women. One normal \ncomparison group (NC1) comprised 11 females, with a mean age of 33.9 years (range \n27-43 years, SD = 6.6) and a mean of 13.5 years in formal education (range 12-15 \nyears, SD = 0.82). The second normal comparison group (NC2) comprised 12 \nfemales, with a mean age of 46.7 years (range 31 – 57 years, SD = 7.8) and a mean of \n15.1 years in formal education (range 12-18 years, SD = 2.1). \n2.2 Normal reference groups and scoring of the emotion-labelling tasks \nSince the perception of the body expression stimuli may well differ from what \nAmygdala Damage Spares Fearful Body Recognition 6 \nthe actors intended, we did not use the intended emotions as the “correct” answer for \nour emotion-labelling tasks. Instead, we used the answers given by two large \nreference groups of neurologically normal subjects, distinct from our healthy \ncomparison groups, both to assign stimuli to specific emotion categories and to assign \nemotion recognition scores to the amygdala lesion subjects and each member of the \nnormal comparison (NC1 and NC2) groups. We assessed emotion recognition \nperformance using both percentage correct and partial-credit scores, as detailed \nbelow. \nOne of the independent normal reference groups, used for Tasks 1 and 2, \ncomprised 77 people (52 females, 25 males), with a mean age of 26.3 years (range 16 \n– 64, SD = 9.8) and a mean of 15.4 years in formal education (SD = 3.2). The other \nindependent normal reference group, used for Task 3, comprised 109 people (73 \nfemales, 36 males), with a mean age of 25.6 years (range 19 – 69 years, SD = 11.6) \nand all with a minimum of 12 years of formal education. \nAssignment of stimuli to emotion categories was determined according to the \nmodal response of the normal reference groups (see Adolphs & Tranel, 2003; \nHeberlein, Adolphs, Tranel, & Damasio, 2004): a stimulus was considered a “happy” \nposture, for example, if a majority of the reference group called it happy. In order to \ntest for possible effects of gender and age on the emotion recognition performance of \nthe normal reference groups, we first assigned percentage correct recognition scores \nto each reference group subject relative to the modal responses of the rest of their \nrespective reference group; that is, if a response accorded with the majority response \nof the relevant reference group, then it was considered correct, otherwise incorrect. \nFor Task 1 there were no effects of gender for any emotion. Age was also \nuncorrelated with recognition performance for any emotion, except for a marginally \nAmygdala Damage Spares Fearful Body Recognition 7 \nsignificant correlation of age with surprise recognition in males (Spearman’s rho = \n0.442, p < 0.05 two-tailed, uncorrected for multiple emotion comparisons). For Task 2 \nthe age of subjects was not correlated with their recognition performance for any of \nthe emotions and there was no effect of gender. For Task 3 the age of female subjects \nwas not significantly correlated with their emotion-labelling accuracy, while the age \nof male subjects was significantly correlated only with their accuracy at labeling \nhappy expressions in patch-light displays (Spearman’s rho = -.486, p < .005, two-\ntailed but uncorrected for multiple emotions). There was no effect of gender on this \ntask. \nThe amygdala lesion and normal comparison subjects were assigned \npercentage correct recognition scores for each emotion in each task, relative to the \nmodal responses of the relevant reference group. As a further means of quantifying \neach subject’s emotion recognition ability relative to the independent normal \nreference groups, the amygdala lesion and normal comparison subjects were also \nassigned partial credit scores, calculated in relation to the relative frequencies of \noccurrence of responses given by the relevant normal reference group (Heberlein et \nal., 2004). Thus, if 100% of normal reference subjects called a scene “happy”, for \nexample, a brain-damaged or normal comparison subject would get a score of 1.0 for \nchoosing the label “happy” and 0.0 for all other choices. On the other hand, if 50% of \nnormal reference subjects called a scene “surprise”, 40% called it “afraid”, and 10% \ncalled it “sad”, a subject would receive a score for that scene of 1.0 if choosing the \nlabel “surprise”, 0.8 if choosing the label “afraid”, and 0.2 if choosing the label “sad”. \nIn this way, correctness was made a parametric function solely of the distribution of \nresponses that the normal reference subjects gave: high scores correspond to relatively \nbetter performance, low scores to relatively worse performance. We first examined \nAmygdala Damage Spares Fearful Body Recognition 8 \nperformance on emotion recognition in general by calculating overall partial credit \nscores averaged across all stimuli presented in a given task. We then examined \nperformance on the recognition of individual emotions by calculating partial credit \nscores for each emotion category from the subset of stimuli in that task with clear \nmodal responses. \n2.3 Stimuli and tasks \nIn order to examine the effects of bilateral amygdala damage on the ability to \njudge emotions from both motion and form cues in whole-body gestures, we used 4 \nsets of stimuli, comprising portrayals of basic emotions in (1) full-light static displays \n(newly created), (2) point-light dynamic displays (similar to those used by Heberlein \net al., 2004), and sets of (3) patch-light and (4) corresponding full-light dynamic \ndisplays (from Atkinson, Dittrich, Gemmell, & Young, 2004, and Atkinson, Tunstall, \n& Dittrich, in press), as detailed below. In the point-light and patch-light displays the \nstatic form information is minimal or absent but motion and form-from-motion \ninformation is preserved (Johansson, 1973). The full-light dynamic displays contain \nboth motion and full form information. Due to practical and time constraints, one of \nthe neurologically normal comparison groups (NC1) completed the tasks involving \nthe static posture and point-light body movement stimuli, whereas the comparison \ndata for the tasks involving the patch-light displays and identical movements in the \nfull-light displays were acquired from a different normal comparison group (NC2). \nAll participants gave informed consent to participate in these studies, which were \napproved by either the Internal Review Board of the University of Iowa, the \nCambridge Local Research Ethics Committee, the Internal Review Board of Harvard \nUniversity, or the Durham University Ethics Advisory Committee, in accordance with \nthe Declaration of Helsinki. \nAmygdala Damage Spares Fearful Body Recognition 9 \n2.3.1 Task 1: Forced-choice emotion labelling of static body postures \nEmotion recognition from static body postures was investigated using a 6-\nalternative forced-choice emotion-labelling task with a set of photographic images of \nstatic body postures. Four professional actors, 2 male and 2 female, were depicted in \nneutral poses and in postures portraying 5 basic emotions (anger, fear, happiness, \nsadness, and surprise) in front of a white wall, standing on a grey floor. Faces were \nGaussian blurred such that expressions were not identifiable (see Figure 1); we chose \nthis method of eliminating face information in preference over completely erasing the \nface or obscuring it, since the latter methods generated stimuli that looked more \njarring. Eighty-two stimuli were piloted on 15 adult pilot subjects, out of which we \nchose 63 stimuli whose emotion was labelled the most reliably. \n----- Insert Fig. 1 about here. ----- \nFor the present study, the participants were asked to match each of the 63 \nstimuli to a single word from a list of six words (angry, afraid, happy, sad, surprised, \nor neutral) in terms of how they thought the person depicted in each picture might \nfeel. The stimuli were presented in a different random order for each subject. There \nwas no time limit and response times were not recorded. For scoring purposes, 57 of \nthese 63 stimuli had clear modal responses, that is, were assigned a single label by \nmore than 50% of the independent normal reference group. The set of 57 stimuli with \nclear modal responses comprised 13 fearful, 13 angry, 12 sad, 10 neutral, 5 happy, \nand 4 surprised postures. \n2.3.2 Task 2: Forced-choice emotion labelling of point-light walkers \nEmotion recognition from whole-body displays of biological motion was \ninvestigated using a 5-alternative forced-choice emotion-labelling task with a set of \nshort digital movie clips of point-light walkers. The stimuli were similar to those \nAmygdala Damage Spares Fearful Body Recognition 10 \ndescribed in Heberlein et al. (2004), and included 6 clips from that earlier study. \nThese stimuli were created by filming six professional or student actors, three male \nand three female, who walked across the frame of a movie camera from left to right, \nwith locomotory patterns intended to convey specific emotions. Small lights were \nattached to their wrists, ankles, knees, elbows, outer hip, waist, outer shoulder, and \nhead; they were filmed in the dark so that only the moving lights were visible. A set \nof 40 of these stimuli was presented to the normal reference group (described above), \nwho were asked to choose the best word from a list of five words — angry, afraid, \nhappy, sad, or neutral — to describe how they thought the person depicted in each \nclip might feel. The stimuli were presented individually in a different random order \nfor each subject. For scoring purposes, 39 of the 40 stimuli received clear modal \nresponses from the normal reference group: 10 for anger, 9 for fear, 8 for sadness, 7 \nfor happiness, and 5 for neutral. \n2.3.3 Task 3: Forced-choice emotion labelling of patch-light and full-light body \ngestures \nThe stimuli in this task were grey-scale digital movie clips of people \nexpressing emotions with whole-body movement, presented in patch-light (PL) and \nfull-light (FL) displays, as developed by Atkinson et al. (2004). In the PL displays all \nthat is visible against the black background are 13 thin strips of white tape that were \nattached to the actor (one wrapped around each ankle, knee, elbow and hand, one on \neach hip and shoulder, and one on the forehead), whereas in the FL displays the whole \nbody and head of the actor is visible but not his or her face. Student amateur actors \ngave short, individual portrayals of anger, disgust, fear, happiness, and sadness with \nwhole-body movements and gestures. They were free to interpret and express these \nemotions as they saw fit, with only minimal guidance as to the sorts of situations in \nAmygdala Damage Spares Fearful Body Recognition 11 \nwhich people might experience those emotions. This resulted in a varied set of mostly \nconventional and sometimes symbolic (Buck, 1984) movements. A subset of these \noriginal stimuli was selected for use in the present study, with the play length of each \nclip adjusted to 3 seconds. The selection process, described in Atkinson et al. (in \npress), was blind to the particular movements made by the actors, and an informal \ninspection of the selected set revealed a range of movements representative of the \nlarger set, as described in Atkinson et al. (2004). Furthermore, the stimulus sets for \neach emotion consisted in identical sequences of movement across the two lighting \nconditions (FL and PL). Consequently, an objection that differences in performance \nacross these two stimulus conditions could be due to differences in movement \nsequences between the conditions, rather than to differences in the amount of static \nform information in each stimulus type, can be ruled out. Examples of these stimuli \ncan be viewed online at http:\/\/www.dur.ac.uk\/a.p.atkinson\/. \nThe subjects viewed all 50 PL gestures sequentially in a single block, followed \nby the 50 corresponding FL gestures. The stimuli were presented in a different \nrandom order for each block and for each participant. The task was to classify each \nstimulus in a 5-alternative forced-choice emotion-labelling task (angry, disgusted, \nfearful, happy, sad). The amygdala lesion and NC2 subjects were required to respond \nverbally, whereas the normal reference group provided manual keyboard responses. \nS.M.’s performance on this task was compared with the performance of the \nNC2 group in terms of percentage correct recognition scores and partial credit scores, \nrelative to the independent normal reference group, as described above. Ninety-six of \nthe 100 stimuli received clear modal responses from the normal reference group. For \nthe FL displays, 10 were categorised as angry, 9 disgusted, 10 fearful, 10 happy, and \n10 sad; for the PL displays, 10 were categorised as angry, 7 disgusted, 9 fearful, 10 \nAmygdala Damage Spares Fearful Body Recognition 12 \nhappy, and 11 sad. Only one of these 96 stimuli was frequently labelled with an \nemotion (sadness) other than that intended by the actor (disgust). \n2.3.4 Task 4: Emotion-rating task with patch-light and full-light body gestures \nThe stimuli for this task comprised half of the stimuli used for the forced-\nchoice emotion-labelling task described in Section 2.3.3, such that there were 5 \nversions of each of 5 emotions in each of the 2 lighting conditions, with the PL and \nFL conditions again containing identical movement sequences. The participants first \nviewed the 25 patch-light gestures, presented sequentially and in a random order, and \nwere asked to rate, on a 0 – 5 scale, how much anger was in each display. (The \ninstructions indicated that 0 = not at all angry, and 5 = extremely angry.) They \nprovided verbal responses, which were entered into the computer by the experimenter. \nThe participants then saw the same 25 stimuli again, in a different random order \n(different random orders were also used for each participant), and were asked to rate \nhow much fear was in each display, using a similar 0 – 5 scale. This procedure was \nrepeated for subsequent ratings of disgust, happiness, and sadness, and the whole \nprocedure was then repeated for the full-light versions of these gestures, such that at \nthe end of the task the participants had rated the 25 patch-light followed by the 25 \nmatching full-light gestures on each of anger, fear, disgust, happiness, and sadness (all \nparticipants rated the emotions in that same order). Such an emotion-rating task has \nbeen used extensively with static facial expressions (e.g., Adolphs et al., 1994, 1995, \n1999). \nIn addition to presenting raw emotion intensity ratings, we calculated Pearson \ncorrelation scores as follows (see also Adolphs et al., 1994, 1995, 1999). The rating \nprofile given to each body stimulus by S.M. was correlated with the mean rating \nprofile given to that stimulus by the NC2 group. Thus, correlations near 1 indicate that \nAmygdala Damage Spares Fearful Body Recognition 13 \nS.M. rated the stimulus normally; correlations near 0 (or negative) indicate that she \nrated the stimulus very abnormally. This procedure essentially prevents floor and \nceiling effects, and controls for idiosyncratic global response biases. To calculate \naverages for correlations over several body stimuli (e.g., the average correlation for \nall five happy bodies), S.M.’s correlation for each individual stimulus was Fisher z-\ntransformed, the transformed correlations were averaged over all 5 stimuli that \nexpressed a given emotion, and the average was then inverse transformed to obtain \nthe mean correlation for that emotion. \n2.3.5 Control tasks  \nSubject S.M. and the NC2 group judged the speed and size of the same PL and \nFL body movements they had seen in the emotion-rating task. They were first \npresented the 25 PL displays followed by the 25 FL displays (the stimuli in each \ncondition were presented in a random order) and for each stimulus were asked to rate \nthe speed of the body movements on a scale of 1 (extremely slow movements) to 6 \n(extremely fast movements). They then saw the same stimuli again (PL then FL, in \ndifferent random orders) and were asked to rate the size of the body movements on a \nscale of 1 (extremely small movements) to 6 (extremely large movements). \nS.M. and the NC2 group also completed a forced-choice action judgement \ntask, in which they were presented with stimuli displaying individual male or female \nactors portraying simple body movements and actions. The stimulus set comprised the \naforementioned 32 PL and 32 FL displays of emotionally neutral body actions (4 \nportrayals X 8 actions in each lighting condition), as described in Atkinson et al. (in \npress). In the present control task, for each stimulus the participants were asked to \nchoose from the following list the one label that best described the depicted \nmovement: bending, hopping, jumping-jacks (or in the UK, star-jumps), walking, \nAmygdala Damage Spares Fearful Body Recognition 14 \ndigging, kicking, knocking, pushing. The PL displays were presented first, followed \nby the FL displays (with a different random order for each condition and each \nparticipant). \n2.2.6 Testing environments \nS.M. completed Task 1 in a quiet room with an experimenter present, Task 2 \nvia the internet, viewing the stimuli on a computer in her home, and Tasks 3 and 4 \nand the control tasks in a laboratory with an experimenter. A.P. completed the web-\nbased versions of Tasks 1 and 2 at her home. The NC1 subjects participated in Tasks \n1 and 2 via the internet, viewing the stimuli on computers in their homes or \ninstitutions. The NC2 subjects were tested individually either in a laboratory or in \ntheir homes, with an experimenter present. For the web-based versions of the tasks, all \nstimuli were preloaded on the host computer before the participant could begin each \ntask, to ensure constant play of the movie clips at the standard 25 frames per second \nirrespective of the speed of the internet connection. \n3. Results \n3.1 Task 1: Forced-choice emotion labelling of static body postures \nThe forced-choice emotion labelling accuracy data for the static body postures \nobtained from S.M. and A.P., along with the data from the normal comparison group, \nare shown in Fig. 2. The partial credit scores are shown in Table 2. (Partial credit \nscores closer to 1 indicate greater correspondence in the pattern of responses relative \nto the normal reference group.) Both S.M.’s and A.P.’s labelling of emotions \nexpressed by static body postures were normal, except for a mild impairment for A.P. \nin labelling surprised expressions (accuracy z-score relative to the NC1 group = -\n1.71). For surprise, however, there were only 4 stimuli with this modal response label, \nand all 3 that A.P. labelled incorrectly she called afraid. S.M. labelled one surprised \nAmygdala Damage Spares Fearful Body Recognition 15 \nposture incorrectly, also calling it afraid. Confusions between surprise and fear were \ncommon for the NC1 group as well, likely because they are semantically similar \nemotions and have postural similarities. Indeed, when A.P.’s performance on this \nposture task is assessed in terms of partial credit scores (Table 2), the apparent \ndifference compared to the NC1 group for surprised expressions essentially \ndisappears (z-score = -1.17). Notably, her classification of fearful postures was \nalways well within the normal range (indeed, she achieved 100% correct performance \non two out of three testing sessions). S.M. showed similarly consistent performance \non this same task when tested again via the internet more than a year after the original \ntesting session, including normal classification of fearful postures. \n----- Insert Fig. 2 about here. ----- \n----- Insert Table 2 about here. ----- \n3.2 Task 2: Forced-choice emotion labelling of point-light walkers \nThe forced-choice emotion labelling accuracy data for the point-light walkers \nobtained from S.M. and A.P., along with the data from the normal comparison group, \nare shown in Fig. 3. Partial credit scores are shown in Table 2. Both S.M.’s and A.P.’s \nlabelling of emotions expressed by these point-light walkers were entirely normal. \n----- Insert Fig. 3 about here. ----- \n3.3 Task 3: Forced-choice emotion labelling of patch-light and full-light body \ngestures \nAs shown in Fig. 4, S.M. labelled the PL and FL body movements normally, \nexcept for expressions of anger in both conditions, for which she performed \nsignificantly below the level of the NC2 group (z-scores: PL = -4.4, FL = -10.8). This \ndifference was also evident in the partial credit scores (Table 2), indicating that S.M. \nlabelled angry postures differently from the NC2 group. Examination of S.M.’s \nAmygdala Damage Spares Fearful Body Recognition 16 \nresponses revealed that she consistently misclassified angry expressions as disgusted \nfor both the PL (4 out of 10 gestures; z-score = 4.5) and FL (6 out of 10 gestures; z-\nscore = 15) displays. Similar performance was recorded in a subsequent testing \nsession with S.M. on the following day, when she again labelled the PL and FL body \nmovements normally, except for angry gestures (z-scores: PL = -4.4, FL = -8.9). This \ntime, however, while she again tended to label more FL angry expressions as \ndisgusted compared to the normal comparison group (4 out of 10 gestures; z-score = \n9.9), this was not the case for the PL displays of anger, for which she labelled only 1 \nexemplar as disgusted (z-score = 0.7), but 2 as happy and 2 as sad (z-scores = 6.6 in \neach case). \n----- Insert Fig. 4 about here. ----- \n The partial credit scores for this task (Table 2) reveal a marginal overall \nemotion identification impairment for S.M. compared to the NC2 group with the PL \ndisplays (z-score: -2.004). Yet she did not show an overall emotion identification \nimpairment with identical movements in the FL displays, or with any of the specific \nemotion categories in either the PL or FL displays. \n3.4 Task 4: Emotion-rating task with patch-light and full-light body gestures \nThe raw emotion intensity ratings for S.M. and the normal comparison (NC2) \ngroup are shown in Figure 5. As this figure indicates, S.M.’s emotion ratings of both \nthe FL and the PL body expressions showed similar patterns to those of the normal \ncomparison group. This was confirmed by examination of the z-scores for S.M.’s \nmean emotion intensity ratings, all of which were within 2 standard deviations from \nthe NC2 mean ratings. Notable but relatively minor departures from the comparison \ngroup performance for S.M. were evident for ratings of some of the PL displays, \nnamely: lower disgust ratings for expressions of disgust (z-score = -1.5) and lower \nAmygdala Damage Spares Fearful Body Recognition 17 \nhappiness ratings for expressions of happiness (z-score = -1.3). S.M. also gave higher \nsadness ratings for PL expressions of sadness than did the comparison group (she \ngave the maximum rating of 5 for 4 of these 5 expressions of sadness), although the z-\nscore for this rating was only 0.8, and higher sadness ratings for 3 of the PL disgust \ndisplays, although when averaged across all 5 PL displays of disgust S.M.’s mean \nsadness ratings did not differ from that of the NC2 group. \n----- Insert Fig. 5 about here. ----- \nIn light of the fact that S.M. frequently labelled angry body movements as \ndisgusted in the forced-choice task (Task 3), it is noteworthy that she tended not to \nrate angry body expressions as highly disgusted. She rated 6 of the 10 intended angry \nexpressions with 0 on the disgust scale (“not at all disgusted”), and the other 4 \nreceived ratings of 1, 2 (for 2 stimuli) or 3 on the six point scale, all of which were \nlower than her anger intensity ratings for those same stimuli. \nAs detailed in Section 2.3.4, we calculated correlation scores for S.M.’s \nemotion intensity ratings relative to the mean normal ratings, to obtain a single \nmeasure of performance that avoided floor and ceiling effects. This correlation \nmeasure was calculated from the rating profile one sees across a horizontal band of an \nemotion category in Fig. 5. The correlation scores are shown in Table 3, which shows \nthat S.M.’s emotion rating profiles correlated highly with the emotion rating profiles \nprovided by the normal comparison group for all emotions in both the FL and PL \ndisplays. Nonetheless, S.M.’s correlation scores were slightly lower for the PL than \nfor the FL displays for all emotions except sadness. \n----- Insert Table 3 about here. ----- \nAmygdala Damage Spares Fearful Body Recognition 18 \n3.5 Control tasks \nS.M.’s movement ratings tended to be lower than the comparison group’s \n(NC2) ratings (Figure 6), but she was ‘impaired’ on only size ratings for FL anger (z \n= -2.11) and happiness (z = -2.92), and on speed ratings for PL fear (z = -2.02). S.M. \nperformed identically to the NC2 group on the action-naming task, correctly \nclassifying all the FL and PL displays of whole-body actions. \n----- Insert Fig. 6 about here. ----- \n4. Discussion \n We found that neither of two very rare subjects with bilateral amygdala lesions \nwas impaired at recognising fear from body movements or static body postures, \ncompared to the performance of healthy comparison subjects. One of these \nindividuals (S.M.) has complete bilateral amygdala damage, as well as minor damage \nto anterior entorhinal cortex, whereas the other (A.P.) has bilateral damage \nencompassing approximately 70% of the amygdala, which does not extend beyond the \namygdala at all. S.M., who is known to be severely impaired at recognising fear from \nfaces, performed normally across 4 different tasks involving two sets of dynamic \nbody movement stimuli and a set of static body postures. A.P., who was tested with a \nsubset of these tasks, also performed normally. S.M. appeared to be impaired at \nidentifying angry body movements, but only because she frequently labelled them as \ndisgusted when ‘disgust’ was a response option, likely reflecting the conceptual \noverlap between these two emotions (see below). S.M. also showed a borderline \nimpairment in her overall emotion recognition score with patch-light body \nmovements, as indicated by the partial-credit score, although not in her overall \nemotion recognition score with identical movements in full-light displays or with any \nspecific emotion in either of these two display types. \nAmygdala Damage Spares Fearful Body Recognition 19 \n These results contrast with those of Sprengelmeyer et al. (1999), who reported \nimpaired identification of fear from static body postures in a patient with bilateral \namygdala damage (recognition accuracy was within or above normal levels for happy, \nsurprised, sad, disgusted, and angry postures). However, this person’s lesion was not \nentirely restricted to bilateral amygdala (in contrast to A.P.) and did not encompass \nthe entire extent of both amygdalae (in contrast to S.M.). Thus our study provides a \nstronger test of whether the amygdala is necessary for the normal recognition of fear \nfrom static body postures, a test that we extended to moving as well as static bodily \nexpressions of emotion. \nAdolphs and Tranel (2003) found that S.M. and other subjects with bilateral \namygdala damage were impaired at recognising anger from static images of social \nscenes containing facial and body posture cues, mistaking anger for a variety of other \nemotions. Yet when the faces in these images were obscured, these amygdala lesion \nsubjects judged anger normally. In the present study, the actors’ faces were not visible \nand yet S.M. was apparently impaired at labelling angry body movements. Tellingly, \nhowever, she was impaired on anger only in the task in which ‘disgust’ was a \nresponse option (Task 3), frequently judging angry body movements as disgusted. \nS.M. did not label disgusted expressions as angry, nor did she tend to rate angry \nexpressions as disgusted more than did the controls in the emotion-rating task (Task \n4). Prior to commencing Tasks 3 and 4, all subjects were provided short definitions of \nthe meaning of each emotion label and written examples of situations in which one \nmight experience each emotion. The definition of disgust that we provided \ncorresponded to what Rozin and colleagues (Rozin, Lowery, & Ebert, 1994; Rozin, \nHaidt, & McCauley, 2000) term \"core\" disgust, which is related to a distaste food \nrejection system responsive to such stimuli as offensive smells and bad tastes, and \nAmygdala Damage Spares Fearful Body Recognition 20 \nextends to stimuli that remind humans of their animal origins, such as faeces, poor \nhygiene and death. All our disgusted body stimuli were clearly intended as \nexpressions of core disgust (e.g., miming of blowing away a bad smell or of retching). \nOther theoretical as well as lay conceptions of disgust overlap with those of anger \n(e.g., Rozin, Lowery, Imada, & Haidt, 1999; Russell & Fehr, 1994; Shaver, Schwartz, \nKirson, & O'Connor, 1987; Storm & Storm, 1987). For example, Rozin et al. (1994, \n2000) distinguish core disgust from interpersonal disgust, related to contact with \nundesirable persons, and moral disgust, related to violations of moral \"purity\". These \nlatter conceptions of disgust are close in definition to contempt, disdain or scorn, that \nis, to a feeling of dislike toward somebody or something considered as inferior or \nundeserving of respect, and thus closer in definition to anger (Rozin, 1996). \nMoreover, the word disgust has a common everyday usage that embodies a \ncombination of the meanings of disgust and anger, at least in the USA (Nabi, 2002). \nConfusions between disgusted and angry facial expressions are not uncommon (e.g., \nEkman & Friesen, 1976; McKelvie, 1995; Palermo & Coltheart, 2004), more so in \nchildren (e.g., Russell & Bullock, 1985) and in younger than in older adults (Suzuki, \nHoshino, Shigemasu, & Kawamura, 2007). Part of the reason for this confusion is \nlikely that facial expressions of anger and disgust have certain “facial action units” or \nmuscle contractions in common (Ekman & Friesen, 1976; Young, Perrett, Calder, \nSprengelmeyer, & Ekman, 2002). Yet conceptual overlap between disgust and anger \nalso likely contributes to confusions in the classification of facial expressions of those \nemotions (e.g., Rozin et al., 1999; Russell & Bullock, 1985, 1986; Widen & Russell, \n2003). Bodily expressions of core disgust and anger, including those used in the \npresent study, share few postural and movement characteristics (Atkinson et al., 2004; \nWallbott, 1998). Thus we speculate that, rather than having a perceptual deficit \nAmygdala Damage Spares Fearful Body Recognition 21 \nselective for angry body expressions, or confusing disgusted and angry expressions \nbecause of their perceptual similarities, S.M. tended to apply distinct but overlapping \nconceptions of disgust to the disgusted and angry gestures, viz. core disgust and a \nsense of disgust that is closer in meaning to anger, respectively. \nOn the basis of prior functional imaging evidence and what is known about the \namygdala’s cortical connectivity, we had hypothesised that the amygdala would be \nimportant for the recognition of fear from body expressions, as it is for the recognition \nof fear from facial expressions. Fearful versus neutral whole-body postures have been \nshown to activate the amygdala (de Gelder et al., 2004; Hadjikhani & de Gelder, \n2003), as have some of the fearful body postures and movements used in the present \nstudy (Atkinson et al., in preparation). Nonetheless, as in the case of facial \nexpressions, fearful body movements do not necessarily activate the amygdala \n(Grézes et al., 2007) and the amygdala can show activation to bodily expressed \nemotions other than fear (Peelen et al., under review). Studies in monkeys and other \nnon-human animals demonstrate that the amygdala has strong reciprocal connections \nto various cortical regions, including visual processing regions in temporal cortex \n(Amaral, Price, Pitkanen, & Carmichael, 1992; Price, 2003). In humans, such \nconnections may underlie modulatory influences of the amygdala on visual cortex, \nserving to prioritise visual processing of emotionally salient stimuli (Vuilleumier, \n2005; Vuilleumier, Richardson, Armony, Driver, & Dolan, 2004), including bodies as \nwell as faces. Indeed, a recent study, Peelen et al. (under review) showed that \namygdala responses to emotional versus neutral whole-body movements positively \ncorrelated with the activation by the same stimuli of body-selective areas in temporal \ncortex (i.e., the extrastriate body area, or EBA, and the fusiform body area, or FBA). \nFurthermore, the activity of these body-selective regions but not of a face-selective \nAmygdala Damage Spares Fearful Body Recognition 22 \nregion (the fusiform face area, or FFA) was modulated by the emotional content of \nthe body stimuli, suggesting that emotional cues from body movements produce \ntopographically selective influences on category-specific populations of neurons in \nvisual cortex. \nIn the light of these functional imaging studies, our results indicate that while \nthe amygdala may sometimes be involved in processing whole-body fear cues, it is \nnot necessary for the normal recognition of fear from either static or dynamic body \nexpressions. What, then, might explain amygdala damage sparing the ability to \nrecognise fear and other basic emotions expressed in whole-body gestures, especially \ndespite a typically concomitant impairment in identifying fear in faces? \nOne possibility is that bilateral amygdala damage particularly impacts on the \nability to recognise emotions from faces more so than from other stimuli. Adolphs and \nTranel (2003), for example, demonstrated that bilateral (but not unilateral) amygdala \ndamage reduced the ability to recognise emotions from static images of complex \nsocial scenes when subjects utilised information from facial expressions, but not for \nnegative emotions when the faces were obscured such that the participants had to rely \non other cues including body posture, hand gestures, and interpersonal stances. More \nrecently, Adolphs, Gosselin, Buchanan, Tranel, Schyns, and Damasio (2005) showed \nthat S.M.’s impaired perception of fear in faces is due to a lack of spontaneous \nfixations on the eyes of viewed faces and a consequent inability to use information \nfrom the eye region when judging emotions, a region that is especially diagnostic for \nthe discrimination of fearful expressions (Smith, Cottrell, Gosselin, & Schyns, 2005). \nThe results of the present study demonstrate that the amygdala is not necessarily \ninvolved in emotion recognition across all modes of expression. Nevertheless, the \namygdala’s role in social perception, including the recognition of emotions, is not \nAmygdala Damage Spares Fearful Body Recognition 23 \nrestricted to the eyes or even to faces. For instance, S.M.’s descriptions of the \nmovements of the Heider and Simmel (1944) stimulus, which depicts simple \ngeometric shapes moving on a plain background, are abnormal. Solely on the basis of \nthe movements of these shapes, normal and brain-damaged control subjects attribute \nsocial and emotional states to the objects. S.M., however, failed to describe these \nmovements spontaneously in social terms, an impairment that was not the result of a \nglobal inability to describe social stimuli or of a bias in language use (Heberlein & \nAdolphs, 2004). Taken together with our finding of a borderline impairment in S.M.’s \noverall emotion recognition score with patch-light body movements, these results \nprompt further, more detailed investigation of motion processing following amygdala \ndamage, especially in the context of social perception. \nAnother possible explanation of the spared ability to recognise fear and other \nbasic emotions in whole-body gestures following bilateral amygdala lesions is that \nemotion recognition relies on processes of emotional contagion or simulation, and that \nthe engagement of these processes by visually presented bodies relies less on the \namygdala than does the engagement of such processes by viewed static faces. The \nemotional contagion proposal (e.g., Hatfield, Cacioppo, & Rapson, 1994; Wild, Erb, \n& Bartels, 2001) is that viewing another’s emotional expression triggers that emotion \nin oneself, either directly or via unintentional mimicry of that expression, which \nallows one then to attribute that emotion to the other person. Alternatively, viewing \nanother’s emotional expression might involve simulating the viewed emotional state \nvia the generation of a somatosensory image of the associated body state (Adolphs, \n2002), or simulating the motor programmes for producing the viewed expression \n(Carr, Iacoboni, Dubeau, Mazziotta, & Lenzi, 2003; Gallese, Keysers, & Rizzolatti, \n2004; Leslie, Johnson-Frey & Grafton, 2004). (For discussions of these proposals, see \nAmygdala Damage Spares Fearful Body Recognition 24 \nAtkinson, 2006.) Right somatosensory cortices have a critical role in the recognition \nof emotions expressed in the face (Adolphs, Damasio, Tranel, Cooper, & Damasio, \n2000; Pourtois et al., 2004), body (Heberlein et al., 2004), and voice (Adolphs, \nDamasio, & Tranel, 2002; van Rijn et al., 2005), and thus may be central to processes \nof emotional contagion or simulation, or both. Whether the amygdala is also critically \ninvolved in such processes is less clear, although it is known to have a role in linking \nthe perception of stimuli to somatic responses or representations thereof (see e.g., \nAdolphs, 2002), and to have direct connections to insular cortex, amongst other \ncortical regions (e.g., Amaral et al., 1992). Nevertheless, it is still an open question \nwhether the amygdala is more critical to the engagement of contagion or simulation \nprocesses by emotional bodies than by emotional faces. \nA final suggested explanation of our findings is that S.M. is relying on general \nprocesses of visual inference and knowledge of how people hold and move their \nbodies when emotional – for example, that people stamp their feet and shake their \nfists in anger, cower in fear, move slowly and bow their heads when sad – which do \nnot depend on an intact amygdala. Knowledge about emotion-related body postures \nand movement is likely to be dominated by symbolic or emblematic cues. Perhaps \nmore so than facial expressions, some bodily gestures have come to serve as widely \nused and recognised symbols that represent emotional states; for instance, raised \nclenched fists can signal anger or joy, a bowed head with the face buried in one’s \nhands or the miming of sniffing and wiping away tears can signal sadness. Buck \n(1984, 1991) distinguished symbolic emotional communication, which is \npropositional, intentional, and referential, from spontaneous emotional \ncommunication, which is nonpropositional, involuntary, and expressive. These \ncategories likely reflect opposing ends of a continuum: bodily signals of emotion vary \nAmygdala Damage Spares Fearful Body Recognition 25 \nin their symbolic or emblematic nature. Our body posture and movement stimuli \nexemplify this variation in symbolic content, both within the stimulus sets and \nbetween them, with the Heberlein et al. (2004) point-light body movements being in \ngeneral less symbolic than the Atkinson et al. (2004) body movements, given that the \nformer all involve the actors walking, running, or dancing across the screen in a way \nintended to imply individual basic emotional states, whereas the actors for the latter \nstimulus set generally faced the camera and were given much more freedom as to how \nthey moved and portrayed emotions with their bodies. Interestingly, S.M. was not \nimpaired with either stimulus set. Thus, if in our tasks S.M. was relying on general \nprocesses of visual inference and knowledge of how people hold and move their \nbodies when emotional, then she was unlikely to have been relying solely on the \nsymbolic nature of the postures and movements. \nIn conclusion, the amygdala is not a critical structure for the conscious \nrecognition of fear or other basic emotions from whole-body static postures and \nmovements, at least as assessed by our battery of tasks, even if the amygdala may \nsometimes be involved in processing whole-body fear cues. Further research is \nrequired to assess whether these findings extend to more automatic and rapid \nprocessing of emotional signals from the body. \nAmygdala Damage Spares Fearful Body Recognition 26 \nAcknowledgments \nA.P.A.’s contribution to this research was supported by a Short-term Fellowship from \nthe Human Frontier Science Program (ST00302\/2002-C), held at the Department of \nNeurology, University of Iowa Hospitals and Clinics, Iowa City, USA, and by a grant \nas part of the McDonnell Project in Philosophy and the Neurosciences. A.S.H. was \nsupported by a training grant from the National Institutes of Health (T32-NS07413), \nheld at the Children's Hospital of Philadelphia and the Center for Cognitive \nNeuroscience, University of Pennsylvania. R.A.’s contribution was supported by \ngrants from the National Institute of Mental Health and the National Institute of \nNeurological Disorders and Stroke. We are grateful to all the participants for their \ntime and effort, to Dan Tranel for discussion and for facilitating access to brain-\ndamaged subjects, to Elaine Behan for creating the internet versions of the tasks, and \nto Winand Dittrich for first suggesting the construction of the stimuli used in Tasks 3 \nand 4 and for his advice on their development.  \nAmygdala Damage Spares Fearful Body Recognition 27 \nReferences \nAdolphs, R. (2002). Recognizing emotion from facial expressions: \nPsychological and neurological mechanisms. Behavioral and Cognitive Neuroscience \nReviews, 1, 21-62. \nAdolphs, R., Damasio, H., Tranel, D., Cooper, G., & Damasio, A.R. (2000). A \nrole for somatosensory cortices in the visual recognition of emotion as revealed by \nthree-dimensional lesion mapping. Journal of Neuroscience, 20, 2683-2690. \nAdolphs, R., Gosselin, F., Buchanan, T.W., Tranel, D., Schyns, P., & Damasio, \nA.R. (2005). A mechanism for impaired fear recognition after amygdala damage. \nNature, 433, 68-72. \nAdolphs, R., Damasio, H., & Tranel, D. (2002). Neural systems for the \nrecognition of emotional prosody: A 3-D lesion study. Emotion, 2, 23-51 \nAdolphs, R., & Tranel, D. (2003). Amygdala damage impairs emotion \nrecognition from scenes only when they contain facial expressions. \nNeuropsychologia, 41, 1281-1289. \nAdolphs, R., Tranel, D., Damasio, H., & Damasio, A. (1994). Impaired \nrecognition of emotion in facial expressions following bilateral damage to the human \namygdala. Nature, 372, 669-672. \nAdolphs, R., Tranel, D., Damasio, H., & Damasio, A.R. (1995). Fear and the \nhuman amygdala. Journal of Neuroscience, 15, 5879-5891. \nAdolphs, R., Tranel, D., Hamann, S., Young, A. W., Calder, A.J., Phelps, E.A., \nAnderson, A., Lee, G.P., & Damasio, A.R. (1999). Recognition of facial emotion in \nnine individuals with bilateral amygdala damage. Neuropsychologia, 37, 1111-1117. \nAmaral, D.G., Price, J.L., Pitkanen, A., & Carmichael, S.T. (1992). Anatomical \norganization of the primate amygdaloid complex. In J.P. Aggleton (Ed.), The \nAmygdala Damage Spares Fearful Body Recognition 28 \namygdala: Neurobiological aspects of emotion, memory, and mental dysfunction (pp. \n1-66). New York: Wiley-Liss. \nAtkinson, A.P. (2006). Face processing and empathy. In T.F.D. Farrow & \nP.W.R. Woodruff (Eds.), Empathy in mental illness and health (pp.360-385). \nCambridge: Cambridge University Press. \nAtkinson, A.P., Dittrich, W.H., Gemmell, A.J., & Young, A.W. (2004). \nEmotion perception from dynamic and static body expressions in point-light and full-\nlight displays. Perception, 33, 717-746. \nAtkinson, A.P., Heining, M., & Phillips, M.L. (submitted). Emotional \nenhancement of distinct neural systems by the form and motion of fearful bodies.  \nAtkinson, A.P., Tunstall, M.L., & Dittrich, W.H. (2007). Evidence for distinct \ncontributions of form and motion information to the recognition of emotions from \nbody gestures. Cognition, 104, 59-72. \nBenton, A. L., Sivan, A. B., Hamsher, K. S., Varney, N. S., & Spreen, O. \n(1994). Contributions to neuropsychological assessment: A clinical manual. New \nYork: Oxford University Press. \nBreiter, H. C., Etcoff, N. L., Whalen, P. J., Kennedy, W. A., Rauch, S. L., \nBuckner, R. L., et al. (1996). Response and habituation of the human amygdala during \nvisual processing of facial expression. Neuron, 17, 875-887. \nBuchanan, T. W., Tranel, D., & Adolphs, R. (in press). The human amygdala in \nsocial function. In P. W. Whalen & L. Phelps (Eds.), The human amygdala. New \nYork: Oxford University Press. \nBuck, R. (1984). The communication of emotion. New York: Guilford Press. \nAmygdala Damage Spares Fearful Body Recognition 29 \nBuck, R. (1991). Motivation, emotion, and cognition: A developmental-\ninteractionalist view. In K. T. Strongman (Ed.), International Review of Emotion (Vol. \n1, pp. 101-142). New York: John Wiley. \nCalder, A.J., Young, A.W., Rowland, D., Perrett, D.I., Hodges, J.R., & Etcoff, \nN.L. (1996). Facial emotion recognition after bilateral amygdala damage: \nDifferentially severe impairment of fear. Cognitive Neuropsychology, 13, 699-745. \nCarr, L., Iacoboni, M., Dubeau, M.C., Mazziotta, J.C., & Lenzi, G.L. (2003). \nNeural mechanisms of empathy in humans: a relay from neural systems for imitation \nto limbic areas. Proceedings of the National Academy of Sciences, 100, 5497-5502. \nde Gelder, B., Snyder, J., Greve, D., Gerard, G., & Hadjikhani, N. (2004). Fear \nfosters flight: a mechanism for fear contagion when perceiving emotion expressed by \na whole body. Proceedings of the National Academy of Sciences, 101, 16701-16706. \nEkman, P., & Friesen, W. V. (1976). Pictures of facial affect. Palo Alto, CA: \nConsulting Psychologist’s Press. \nGallese, V., Keysers, C., & Rizzolatti, G. (2004). A unifying view of the basis \nof social cognition. Trends in Cognitive Sciences, 8, 396-403. \nGrézes, J., Pichon, S., & de Gelder, B. (2007). Perceiving fear in dynamic body \nexpressions. NeuroImage, 35, 959-967. \nHadjikhani, N., & de Gelder, B. (2003). Seeing fearful body expressions \nactivates the fusiform cortex and amygdala. Current Biology, 13, 2201-2205. \nHatfield, E., Cacioppo, J. T., & Rapson, R. L. (1994). Emotional contagion. \nNew York: Cambridge University Press. \nHeberlein, A.S., & Adolphs, R. (2004). Impaired spontaneous \nanthropomorphizing despite intact perception and social knowledge. Proceedings of \nthe National Academy of Sciences, 101, 7487-7491. \nAmygdala Damage Spares Fearful Body Recognition 30 \nHeberlein, A.S., Adolphs, R., Tranel, D., & Damasio, H. (2004). Cortical \nregions for judgments of emotions and personality traits from point-light walkers. \nJournal of Cognitive Neuroscience, 16, 1143-1158. \nHeider, F., & Simmel, M. (1944). An experimental study of apparent behavior. \nAmerican Journal of Psychology, 57, 243-259. \nJiang, Y., & He, S. (2006). Cortical responses to invisible faces: Dissociating \nsubsystems for facial-information processing. Current Biology, 16, 2023-2029. \nJohansson, G. (1973). Visual perception of biological motion and a model for \nits analysis. Perception and Psychophysics, 14, 201-211. \nLeslie, K.R., Johnson-Frey, S.H., & Grafton, S.T. (2004). Functional imaging of \nface and hand imitation: towards a motor theory of empathy. NeuroImage, 21, 601-\n607. \nMcKelvie, S.J. (1995). Emotional expression in upside-down faces: Evidence for \nconfigurational and componential processing. British Journal of Social Psychology, \n34, 325-334. \nMorris, J. S., de Gelder, B., Weiskrantz, L., & Dolan, R. J. (2001). Differential \nextrageniculostriate and amygdala responses to presentation of emotional faces in a \ncortically blind field. Brain, 124, 1241-1252. \nMorris, J. S., Frith, C. D., Perrett, D. I., Rowland, D., Young, A. W., Calder, A. \nJ., et al. (1996). A differential neural response in the human amygdala to fearful and \nhappy facial expressions. Nature, 383, 812-815. \nMorris, J. S., Ohman, A., & Dolan, R. J. (1999). A subcortical pathway to the \nright amygdala mediating \"unseen\" fear. Proceedings of the National Academy of \nSciences, U.S.A, 96, 1680-1685. \nNabi, R. L. (2002). The theoretical versus the lay meaning of disgust: \nAmygdala Damage Spares Fearful Body Recognition 31 \nImplications for emotion research. Cognition & Emotion, 16, 695-703. \nPalermo, R., & Coltheart, M. (2004). Photographs of facial expression: \nAccuracy, response times, and ratings of intensity. Behavior Research Methods \nInstruments & Computers, 36, 634-638. \nPeelen, M.V., Atkinson, A.P., Andersson, F., & Vuilleumier, P. (in press). \nEmotional modulation of body-selective visual areas. Social Cognitive and Affective \nNeuroscience. \nPourtois, G., Sander, D., Andres, M., Grandjean, D., Reveret, L., Olivier, E., & \nVuilleumier, P. (2004). Dissociable roles of the human somatosensory and superior \ntemporal cortices for processing social face signals. European Journal of \nNeuroscience, 20, 3507-3515. \nPrice, J. L. (2003). Comparative aspects of amygdala connectivity. Annals of the \nNew York Academy of Sciences, 985, 50-58. \nRozin, P. (1996). Towards a psychology of food and eating: From motivation to \nmodule to marker, morality, meaning, and metaphor. Current Directions in \nPsychological Science, 5, 18-24. \nRozin, P., Lowery, L., & Ebert, R. (1994). Varieties of disgust faces and the \nstructure of disgust. Journal of Personality and Social Psychology, 66, 870-881. \nRozin, P., Lowery, L., Imada, S., & Haidt, J. (1999). The CAD triad hypothesis: \na mapping between three moral emotions (contempt, anger, disgust) and three moral \ncodes (community, autonomy, divinity). Journal of Personality and Social \nPsychology, 76, 574-586. \nRozin, P., Haidt, J., & McCauley, C.R. (2000). Disgust. In M. Lewis & J. \nHavliand (Eds.), Handbook of emotions (2nd ed., pp. 637-653). New York: Guilford \nPress. \nAmygdala Damage Spares Fearful Body Recognition 32 \nRussell, J. A., & Bullock, M. (1985). Multidimensional-scaling of emotional \nfacial expressions: Similarity from preschoolers to adults. Journal of Personality and \nSocial Psychology, 48, 1290-1298. \nRussell, J. A., & Bullock, M. (1986). Fuzzy concepts and the perception of \nemotion in facial expressions. Social Cognition, 4, 309-341. \nRussell, J. A., & Fehr, B. (1994). Fuzzy concepts in a fuzzy hierarchy: Varieties \nof anger. Journal of Personality and Social Psychology, 67, 186-205. \nShaver, P., Schwartz, J., Kirson, D., & O'Connor, C. (1987). Emotion \nknowledge: further exploration of a prototype approach. Journal of Personality and \nSocial Psychology, 52, 1061-1086. \nSmith, M. L., Cottrell, G. W., Gosselin, F., & Schyns, P. G. (2005). \nTransmitting and decoding facial expressions. Psychological Science, 16, 184-189. \nSprengelmeyer, R., Young, A.W., Schroeder, U., Grossenbacher, P.G., \nFederlein, J., Buttner, T., & Przuntek, H. (1999). Knowing no fear. Proceedings of the \nRoyal Society of London, Series B: Biological Sciences, 266, 2451-2456. \nStorm, C., & Storm, T. (1987). A taxonomic study of the vocabulary of \nemotions. Journal of Personality and Social Psychology, 53, 805-816. \nSuzuki, A., Hoshino, T., Shigemasu, K., & Kawamura, M. (2007). Decline or \nimprovement? Age-related differences in facial expression recognition. Biological \nPsychology, 74, 75-84. \nvan Rijn, S., Aleman, A., van Diessen, E., Berckmoes, C., Vingerhoets, G., & \nKahn, R.S. (2005). What is said or how it is said makes a difference: role of the right \nfronto-parietal operculum in emotional prosody as revealed by repetitive TMS. \nEuropean Journal of Neuroscience, 21, 3195-3200. \nAmygdala Damage Spares Fearful Body Recognition 33 \nVuilleumier, P., Richardson, M. P., Armony, J. L., Driver, J., & Dolan, R. J. \n(2004). Distant influences of amygdala lesion on visual cortical activation during \nemotional face processing. Nature Neuroscience, 7, 1271-1278. \nVuilleumier, P. (2005). How brains beware: neural mechanisms of emotional \nattention. Trends in Cognitive Sciences, 9, 585-594. \nWallbott, H. G. (1998). Bodily expression of emotion. European Journal of \nSocial Psychology, 28, 879-896. \nWhalen, P. J., Shin, L. M., McInerney, S. C., Fischer, H., Wright, C. I., & \nRauch, S. L. (2001). A functional MRI study of human amygdala responses to facial \nexpressions of fear versus anger. Emotion, 1, 70-83. \nWiden, S. C., & Russell, J. A. (2003). A closer look at preschoolers' freely \nproduced labels for facial expressions. Developmental Psychology, 39, 114-128. \nWild, B., Erb, M., & Bartels, M. (2001). Are emotions contagious? Evoked \nemotions while viewing emotionally expressive faces: quality, quantity, time course \nand gender differences. Psychiatry Research, 102, 109-124. \nWilliams, M. A., Morris, A. P., McGlone, F., Abbott, D. F., & Mattingley, J. B. \n(2004). Amygdala responses to fearful and happy facial expressions under conditions \nof binocular suppression. Journal of Neuroscience, 24, 2898-2904. \nWinston, J. S., O'Doherty, J., & Dolan, R. J. (2003). Common and distinct \nneural responses during direct and incidental processing of multiple facial emotions. \nNeuroImage, 20, 84-97. \nYoung, A.W., Perrett, D.I., Calder, A.J., Sprengelmeyer, R., & Ekman, P. \n(2002). Facial expressions of emotion: stimuli and tests (FEEST). Bury St. Edmunds: \nThames Valley Test Company. \n34 \n \nTable 1. Background neuropsychological performance and demographics of the two \nsubjects with bilateral amygdala lesions. \n \nAge in years at time of testing (S.M. was 39 when she completed tasks 3 and 4, and \n40 when she completed tasks 1 and 2). Education: Mean number of years of formal \neducation. VIQ, PIQ, and full-scale IQ: verbal, performance and full-scale IQ from \nthe Wechsler Adult Intelligence Scale (Revised for S.M., III for A.P.; age-corrected \nscaled scores). Benton face-matching test, judgement of line orientation, Hopper \nVisual Organization Test, and Complex Figure Test: all from Benton, Sivan, \nHamsher, Varney, and Spreen (1994).\n S.M. A.P. \nAge 39\/40 21 \nEducation 12 16 \nVIQ 86 92 \nPIQ 95 106 \nFull-scale IQ 88 98 \nBenton face-matching test 90th percentile 85th percentile \nJudgement of line orientation 22nd percentile > 74th percentile \nHooper Visual Organization Test 25.5\/30 24\/30 \nComplex Figure Test (copying) 32\/36 36\/36 \n \nAmygdala Damage Spares Fearful Body Recognition 35 \n Table 2. Mean partial credit scores (and SDs) for the bilateral amygdala lesion \nsubjects and the matched normal comparison groups (NC1 and NC2), relative to the \nlarger normal reference groups, for the forced-choice emotional labelling of each \nstimulus type in Tasks 1 – 3. \n Partial credit scores \n \nStatic postures \n(Task 1) \nPoint-light walkers \n(Task 2) \nFull-light \ndynamic \ngestures \n(Task 3) \nPatch-light \ndynamic \ngestures \n(Task 3) \nJudgement \ncategory \nS.M. A.P. NC1 S.M. A.P. NC1 S.M. NC2 S.M. NC2 \nAfraid 0.9 1.0 0.88 \n(0.09) \n0.81 1.0 0.83 \n(0.15) \n1.0 0.96 \n(0.09) \n0.9 0.87 \n(0.14) \nAngry 0.88 1.0 0.91 \n(0.06) \n1.0 0.91 0.94 \n(0.07) \n0.43* 0.96 \n(0.05) \n0.55* 0.94 \n(0.09) \nHappy 1.0 0.63 0.84 \n(0.23) \n1.0 \n \n1.0 0.95 \n(0.05) \n0.84 0.9 \n(0.14) \n0.86 0.83 \n(0.12) \nSad 0.97 1.0 0.86 \n(0.13) \n0.91 1.0 0.87 \n(0.09) \n0.91 0.87 \n(0.11) \n0.83 0.83 \n(0.12) \nSurprised 0.72 0.64 0.82 \n(0.16) \n— —  — — — — \nDisgusted — — — — —  1.0 0.87 \n(0.15) \n1.0 0.91 \n(0.1) \nNeutral 1.0 1.0 0.95 \n(0.09) \n0.72 0.79 0.79 \n(0.16) \n— — — — \nOverall\n¶\n 0.92 0.9 0.88 \n(0.05) \n0.9 0.93 0.88 \n(0.05) \n0.84 0.91 \n(0.04) \n0.82* 0.89 \n(0.03) \n \n¶\n The overall average partial credit scores provide a measure of overall emotion \nrecognition performance calculated across all stimuli presented in a task, including \nthose stimuli that did not receive clear modal responses from the normal reference \ngroups. The partial credit scores for each emotion category were calculated across \nAmygdala Damage Spares Fearful Body Recognition 36 \nonly those stimuli that received clear modal responses. See text (Section 2.2) for \nfurther details of how the partial credit scores were calculated. \n* Indicates z-score > 2 SDs below the NC mean partial credit score. \nThe absence of an entry in a cell of the table indicates that the corresponding \njudgement category was not a response option in that task.\nAmygdala Damage Spares Fearful Body Recognition 37 \nTable 3. Mean correlation scores for S.M.’s emotion intensity ratings relative to the \nmean emotion intensity ratings of the normal comparison group (NC2), as a function \nof lighting condition and emotion category. \n \nEmotion Lighting Condition \n Full-light Patch-light \nAnger \n0.89 0.69 \nDisgust \n0.8 0.61 \nFear \n0.91 0.74 \nHappiness \n0.97 0.82 \nSadness \n0.92 0.91 \n \nAmygdala Damage Spares Fearful Body Recognition 38 \nFigure Captions \nFig. 1. Illustrative examples of stimuli used in (a) Task 1 (a fearful static posture) and \n(b) and (c) Tasks 3 and 4 (still frames extracted from full-light and patch-light movie \nclips that showed a fearful body movement). \nFig. 2. Mean percentage correct classification of emotions in the static whole-body \npostures (Task 1) for patients S.M. and A.P. and the normal comparison (NC1) group. \nData are for the 57 stimuli with clear modal responses from the normal reference \ngroup (a further 6 stimuli did not have clear modal responses). Error bars indicate +\/- \n1 standard deviation. \nFig. 3. Mean percentage correct classification of emotions in the point-light walker \nstimuli (Task 2) for patients S.M. and A.P. and the normal comparison (NC1) group. \nData are for the 39 stimuli with clear modal responses from the normal reference \ngroup (an additional stimulus did not have a clear modal response). Error bars indicate \n+\/- 1 standard deviation. \nFig. 4. Mean percentage correct classification of emotions in the full-light (top) and \npatch-light (bottom) displays of moving whole-body gestures for S.M. and the normal \ncomparison (NC2) group. Data are for the 49 full-light movies and 47 patch-light \nmovies with clear modal responses from the normal reference group (1 FL and 3 PL \nstimuli did not have clear modal responses). Error bars indicate +\/- 1 standard \ndeviation. \nFig. 5. Plots of the raw emotion intensity ratings of the full-light (left) and patch-light \n(right) body gesture stimuli for S.M. (bottom) and the normal comparison group \n(NC2; top). The emotional stimuli (25 dynamic body gestures in each display type; 5 \nof each basic emotion indicated) are ordered on the y-axis according to their \nperceived similarity by the normal comparison group (stimuli perceived to be similar \nAmygdala Damage Spares Fearful Body Recognition 39 \nare adjacent). The five emotion labels on which subjects rated the faces are displayed \non the x-axis. Colour encodes the mean rating given to each body stimulus, as \nindicated in the scale. Thus, a purple or red line indicates a lower mean rating than an \norange or yellow line for a given body gesture; and a thin yellow or white line for a \ngiven emotion category indicates that few stimuli of that emotion received a high \nrating, whereas a thick yellow or white line indicates that many or all stimuli within \nthat emotion category received high ratings. \nFig. 6. Mean speed of movement ratings (top 2 panels) and size of movement ratings \n(bottom 2 panels) for the full-light and patch-light displays of moving whole-body \ngestures for S.M. and the normal comparison (NC2) group. Both scales ranged from 1 \n(extremely slow\/small movements) to 6 (extremely fast\/large movements). Error bars \nindicate +\/- 1 standard deviation. \nAmygdala Damage Spares Fearful Body Recognition 40 \nFigure 1. \nAmygdala Damage Spares Fearful Body Recognition 41 \nFigure 2. \nAmygdala Damage Spares Fearful Body Recognition 42 \nFigure 3. \nAmygdala Damage Spares Fearful Body Recognition 43 \nFigure 4. \nAmygdala Damage Spares Fearful Body Recognition 44 \nFigure 5. \nAmygdala Damage Spares Fearful Body Recognition 45 \nFigure 6. \n \n \n \n \n \n \n"}