{"doi":"10.1080\/14649880701371067","coreId":"135931","oai":"oai:bradscholars.brad.ac.uk:10454\/3949","identifiers":["oai:bradscholars.brad.ac.uk:10454\/3949","10.1080\/14649880701371067"],"title":"Understanding Agency in Collective Action.","authors":["Cleaver, Frances D."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2007","abstract":"NoParticipatory approaches to natural resource management encompass ideas about the desirability of citizens actively engaging in the institutions, policies and discourses that shape their access to resources. Underpinning such approaches are assumptions about the nature of human agency. Purposive individual action is seen as instrumentally desirable as well as potentially radical and transformatory. Through participation in collective resource management it is claimed that people can re-negotiate norms, challenge inequalities, claim their rights and extend their access. This paper draws on insights from theories of structuration, governmentality and gendered empowerment to explore understandings of how individual human agency shapes and is shaped by social relationships and institutions. It outlines six factors that constrain and enable the exercise of agency for different people; cosmologies, complex individual identities, the unequal interdependence of livelihoods, structure and voice, embodiment and emotionality. The paper concludes by considering some of the implications for research and development interventions","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/3949<\/identifier><datestamp>\n                2014-05-19T15:28:38Z<\/datestamp><setSpec>\n                com_10454_225<\/setSpec><setSpec>\n                col_10454_6343<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nUnderstanding Agency in Collective Action.<\/dc:title><dc:creator>\nCleaver, Frances D.<\/dc:creator><dc:subject>\nParticipation<\/dc:subject><dc:subject>\nAgency;<\/dc:subject><dc:subject>\nNatural resource management<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nParticipatory approaches to natural resource management encompass ideas about the desirability of citizens actively engaging in the institutions, policies and discourses that shape their access to resources. Underpinning such approaches are assumptions about the nature of human agency. Purposive individual action is seen as instrumentally desirable as well as potentially radical and transformatory. Through participation in collective resource management it is claimed that people can re-negotiate norms, challenge inequalities, claim their rights and extend their access. This paper draws on insights from theories of structuration, governmentality and gendered empowerment to explore understandings of how individual human agency shapes and is shaped by social relationships and institutions. It outlines six factors that constrain and enable the exercise of agency for different people; cosmologies, complex individual identities, the unequal interdependence of livelihoods, structure and voice, embodiment and emotionality. The paper concludes by considering some of the implications for research and development interventions.<\/dc:description><dc:date>\n2009-11-18T11:40:01Z<\/dc:date><dc:date>\n2009-11-18T11:40:01Z<\/dc:date><dc:date>\n2007<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nnot applicable paper<\/dc:type><dc:identifier>\nCleaver, F.D. (2007).  Understanding Agency in Collective Action.   Journal of Human Development. Vol. 8, No. 2, pp. 223-244.<\/dc:identifier><dc:identifier>\n90007941<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/3949<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1080\/14649880701371067<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1080\/14649880701371067"],"year":2007,"topics":["Participation","Agency;","Natural resource management"],"subject":["Article","not applicable paper"],"fullText":null}