{"doi":"10.1002\/jid.1456","coreId":"209943","oai":"oai:eprints.lse.ac.uk:21260","identifiers":["oai:eprints.lse.ac.uk:21260","10.1002\/jid.1456"],"title":"Paying for environmental services: the case of Brazilian Amazonia","authors":["Hall, Anthony"],"enrichments":{"references":[{"id":17206929,"title":"Agroforestry Experiences in the Brazilian Amazon: Constraints and Opportunities. Pilot Programme to Conserve the Brazilian Rain Forest\/ World Bank: Brası ´lia.","authors":[],"date":"1998","doi":null,"raw":"Smith N, Dubois J, Current D, Lutz E, Clement C. 1998. Agroforestry Experiences in the Brazilian Amazon: Constraints and Opportunities. Pilot Programme to Conserve the Brazilian Rain Forest\/ World Bank: Brası ´lia.","cites":null},{"id":17206911,"title":"Amazon Forest Degradation and Fragmentation: Implications for Biodiversity Conservation.","authors":[],"date":"2000","doi":"10.1017\/s003060530003088x","raw":"Lovejoy T. 2000. Amazon Forest Degradation and Fragmentation: Implications for Biodiversity Conservation. In Hall A (ed.) Amazonia at the Crossroads: the challenge of sustainable development. Institute of Latin American Studies, University of London: London. 41–57.","cites":null},{"id":17206870,"title":"Amazonian forest dieback under climate-cycle carbon projections for the 21st century. Theoretical Applied Climatology,","authors":[],"date":"2004","doi":"10.1007\/s00704-004-0049-4","raw":"Cox PM, Betts RA, Collins M, Harris PP, Huntigford C, Jones CD. 2004. Amazonian forest dieback under climate-cycle carbon projections for the 21st century. Theoretical Applied Climatology, (April): 78: 137–156.","cites":null},{"id":17206934,"title":"Assessing Environment’s Contribution to Poverty Reduction. United Nations Development Program:","authors":[],"date":"2005","doi":null,"raw":"UNDP. 2005. Assessing Environment’s Contribution to Poverty Reduction. United Nations Development Program: New York.","cites":null},{"id":17206864,"title":"At Loggerheads? Agricultural Expansion, Poverty Reduction and Environment in the Tropical Forests. World Bank:","authors":[],"date":"2007","doi":null,"raw":"Chomitz K, Buys P, De Luca G, Thomas T, Wertz-Kanounnikoff S. 2007. At Loggerheads? Agricultural Expansion, Poverty Reduction and Environment in the Tropical Forests. World Bank: Washington, DC.","cites":null},{"id":17206862,"title":"Biodivesidade na Amazo ˆnia Brasileira. Instituto Socioambiental: Sa ˜o Paulo.","authors":[],"date":"2001","doi":null,"raw":"Capobianco JP, Verrı ´ssimo A, Moreira A, Sawyer D, dos Santos I, Pinto LP (eds). 2001. Biodivesidade na Amazo ˆnia Brasileira. Instituto Socioambiental: Sa ˜o Paulo.","cites":null},{"id":17206917,"title":"Carbon Sequestration and Sustainable Livelihoods: A Workshop Synthesis.","authors":[],"date":"2005","doi":null,"raw":"Murdiyarso D, Herawati H, Iskandar H. 2005. Carbon Sequestration and Sustainable Livelihoods: A Workshop Synthesis. CIFOR: Bogor, Indonesia.","cites":null},{"id":17206932,"title":"Celso Amorim, Marina Silva and Sergio Rezende: the Amazon is ours. It is not for sale...’","authors":[],"date":"2006","doi":null,"raw":"The Independent. 2006. ‘Celso Amorim, Marina Silva and Sergio Rezende: the Amazon is ours. It is not for sale...’ 1 November.","cites":null},{"id":17206913,"title":"Climate change in the Amazon basin: from interannual variability to climate change. Philosophical Transactions of the Royal Society B, These Issue ‘Climatic change and the fate of the Amazon’","authors":[],"date":"2008","doi":null,"raw":"Marengo JA. 2008. Climate change in the Amazon basin: from interannual variability to climate change. Philosophical Transactions of the Royal Society B, These Issue ‘Climatic change and the fate of the Amazon’ 2008. Published online. doi:10.1098\/rstb.2007.0034 May P, Veiga Neto P, Denardin V, Loureiro W. 2002. The ecological value-added tax: municipal responses in Parana ´ and Minas Gerais, Brazil. In Selling Forest Environmental Services: MarketBased Mechanisms for Conservation, Pagiola S, Bishop J, Landell-Mills N (eds). Earthscan: London.","cites":null},{"id":17206866,"title":"Coalition for Rainforest Nations,","authors":[],"date":"2006","doi":null,"raw":"Coalition for Rainforest Nations, 2006 http:\/\/www.rainforestcoalition.org\/eng\/ (accessed on 16 November).","cites":null},{"id":17206878,"title":"Declarac ¸a ˜o do presidente e ´ contrariado pelos nu ´meros, Estado de Sa ˜oPaulo,","authors":[],"date":null,"doi":null,"raw":"ESP. 2007b. Declarac ¸a ˜o do presidente e ´ contrariado pelos nu ´meros, Estado de Sa ˜oPaulo, 26 September.","cites":null},{"id":17206861,"title":"Declarac ¸a ˜o dos Povos da Floresta. 2 o Encontro Nacional dos Povos da","authors":[],"date":"2007","doi":null,"raw":"Brazil. 2007. Declarac ¸a ˜o dos Povos da Floresta. 2 o Encontro Nacional dos Povos da Floresta, Brasilia, 21 September.","cites":null},{"id":17206887,"title":"Deforestation in Brazilian Amazonia: history, rates and consequences.","authors":[],"date":"2005","doi":"10.1111\/j.1523-1739.2005.00697.x","raw":"Fearnside P. 2005. Deforestation in Brazilian Amazonia: history, rates and consequences. Conservation Biology 19(June): 680–688.","cites":null},{"id":17206900,"title":"Developing Amazonia: Deforestation and Social Conﬂict in Brazil’s Caraja ´s Programme.","authors":[],"date":"2008","doi":"10.2307\/3059815","raw":"Copyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008) DOI: 10.1002\/jid Paying for Environmental Services 979Hall A. 1989. Developing Amazonia: Deforestation and Social Conﬂict in Brazil’s Caraja ´s Programme. Manchester University Press: Manchester.","cites":null},{"id":17206890,"title":"Direct payments to conserve biodiversity.","authors":[],"date":"2002","doi":"10.1126\/science.1078104","raw":"Ferraro P, Kiss A. 2002. Direct payments to conserve biodiversity. Science, 298: 1718–1719.","cites":null},{"id":17206922,"title":"DOI: 10.1002\/jid 980 A. HallNascimento Madureira D.","authors":[],"date":"2008","doi":null,"raw":"Copyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008) DOI: 10.1002\/jid 980 A. HallNascimento Madureira D. 2006. Incentivo para a preservac ¸a ˜o amplia impacto regional, Valor Econo ˆmico, 24 October.","cites":null},{"id":17206891,"title":"Eating Up the Amazon, Greenpeace International,","authors":[],"date":"2006","doi":"10.1007\/springerreference_306425","raw":"Greenpeace. 2006a. Eating Up the Amazon, Greenpeace International, April 6.","cites":null},{"id":17206905,"title":"Editorial: incentives to reduce tropical deforestation.","authors":[],"date":"2006","doi":"10.1016\/j.jfe.2005.10.003","raw":"Heal G, Conrad K. 2006. Editorial: incentives to reduce tropical deforestation. Journal of Forest Economics, 11: 201–203.","cites":null},{"id":17206888,"title":"Environmental services as a basis for the sustainable use of tropical forests in Brazilian Amazonia.","authors":[],"date":"2006","doi":null,"raw":"Fearnside P. 2006a. Environmental services as a basis for the sustainable use of tropical forests in Brazilian Amazonia. In Ortega E, Ulgiati S (eds). IV International Biennial Workshop Advances in Energy Studies: Energy-Ecology in Latin America. Campinas, Sa ˜o Paulo, Brazil, June 16–19, 2004. University of Campinas (UNICAMP): Campinas, Sa ˜o Paulo; 31–36.","cites":null},{"id":17206885,"title":"Environmental services as a strategy for sustainable development in rural Amazonia.","authors":[],"date":"1997","doi":"10.1016\/s0921-8009(96)00066-3","raw":"Fearnside P. 1997. Environmental services as a strategy for sustainable development in rural Amazonia. Ecological Economics, 20(1): 53–70.","cites":null},{"id":17206886,"title":"Environmentalists split over Kyoto and Amazonian deforestation.","authors":[],"date":"2001","doi":"10.1017\/s0376892901000315","raw":"Fearnside P. 2001. Environmentalists split over Kyoto and Amazonian deforestation. Environmental Conservation, 28(4): 295–299.","cites":null},{"id":17206904,"title":"Extractive Reserves: Building Natural Assets in the Brazilian Amazon,","authors":[],"date":"2006","doi":"10.7135\/upo9781843313465.007","raw":"Hall A. 2006. Extractive Reserves: Building Natural Assets in the Brazilian Amazon, In Boyce J, Narain S,Stanton E(eds).ReclaimingNature:EnvironmentalJusticeandEcologicalRestoration. Anthem: London.","cites":null},{"id":17206894,"title":"Fight for the Forest: Chico Mendes in His Own Words.","authors":[],"date":"1989","doi":"10.1002\/jid.3380020409","raw":"Gross A. 1989. Fight for the Forest: Chico Mendes in His Own Words. Latin America Bureau: London.","cites":null},{"id":17206892,"title":"Financial Incentives for Biodiversity Conservation: The ICMS Ecolo ´gico","authors":[],"date":"2000","doi":"10.2139\/ssrn.279173","raw":"Grieg-Gran M. 2000. Financial Incentives for Biodiversity Conservation: The ICMS Ecolo ´gico in Brazil. International Institute for the Environment and Development: London.","cites":null},{"id":17206925,"title":"Flames in the Rain Forest: Origins, Impacts and Alternatives to Amazonian Fire. Pilot Programme to Conserve the Brazilian Rain Forest: Brasilia;","authors":[],"date":"1999","doi":null,"raw":"Nepstad D, Moreira A, Alencar A. 1999. Flames in the Rain Forest: Origins, Impacts and Alternatives to Amazonian Fire. Pilot Programme to Conserve the Brazilian Rain Forest: Brasilia; 1.","cites":null},{"id":17206884,"title":"Forest management in Amazonia: the need for new criteria in evaluating development options.","authors":[],"date":"1989","doi":"10.1016\/0378-1127(89)90083-2","raw":"Fearnside P. 1989. Forest management in Amazonia: the need for new criteria in evaluating development options. Forest Ecology and Management, 27(1): 61–79.","cites":null},{"id":17206889,"title":"Fragile soils and deforestation impacts: the rationale for environmental services on standing forest as a development paradigm in Amazonia. In","authors":[],"date":"2006","doi":null,"raw":"Fearnside P. 2006b. Fragile soils and deforestation impacts: the rationale for environmental services on standing forest as a development paradigm in Amazonia. In D Posey, M Balick (eds.). Human Impacts on Amazonia: The Role of Traditional Ecological Knowledge in Conservation and Development. Columbia University Press: New York; 158–171.","cites":null},{"id":17206916,"title":"Getting Biodiversity Projects to Work: Towards More Effective Conservation and Development.","authors":[],"date":"2004","doi":null,"raw":"McShane T, Wells M (eds). 2004. Getting Biodiversity Projects to Work: Towards More Effective Conservation and Development. Columbia University Press: New York. MMA.2005.ProjetosDemostrativos—PDA:Suainﬂue ˆncianaconstruc ¸a ˜odoProambiente.Ministry of the Environment: Brası ´lia.","cites":null},{"id":17206903,"title":"Global Impact, Local Action: New Environmental Policy","authors":[],"date":"2005","doi":null,"raw":"Hall A (ed.). 2005. Global Impact, Local Action: New Environmental Policy in Latin America. Institute for the Study of the Americas, University of London: London.","cites":null},{"id":17206927,"title":"Gradual climate change or ‘‘Tipping Points’’ in the system? Philosophical Transactions of the Royal Society B, These Issue ‘Climatic change and the fate of the Amazon’","authors":[],"date":"2008","doi":null,"raw":"Nobre C. 2008. Gradual climate change or ‘‘Tipping Points’’ in the system? Philosophical Transactions of the Royal Society B, These Issue ‘Climatic change and the fate of the Amazon’ 2008. Published online. doi:10.1098\/rstb.2007.0034 Revkin A. 1990. The Burning Season: The Murder of Chico Mendes and the Fight for the Amazon Rain Forest. Collins: London.","cites":null},{"id":17206893,"title":"How can market mechanisms for forest environmental services help the poor? Preliminary lessons from Latin America. World Development,","authors":[],"date":"2005","doi":"10.1016\/j.worlddev.2005.05.002","raw":"Grieg-Gran M, Porras I, Wunder S. 2005. How can market mechanisms for forest environmental services help the poor? Preliminary lessons from Latin America. World Development, 33(9): 1511–1527.","cites":null},{"id":17206909,"title":"Incentives to Reduce GHG Emissions from Deforestation: Lessons Learned from Costa Rica and Mexico.","authors":[],"date":"2007","doi":"10.1787\/oecd_papers-v7-art1-en","raw":"Karaousakis K. 2007. Incentives to Reduce GHG Emissions from Deforestation: Lessons Learned from Costa Rica and Mexico. OECD: Paris.","cites":null},{"id":17206899,"title":"Instrumentos Econo ˆmicos para o Desenvolvimento Sustenta ´vel da Amazo ˆnia. Ministry of the Environment: Brası ´lia.","authors":[],"date":"2002","doi":null,"raw":"Haddad P, Rezende F. 2002. Instrumentos Econo ˆmicos para o Desenvolvimento Sustenta ´vel da Amazo ˆnia. Ministry of the Environment: Brası ´lia.","cites":null},{"id":17206914,"title":"Local sustainable effects of carbon projects in Brazil and Bolivia: a view form the ﬁeld. Paper presented at the international conference on Rural Livelihoods, Forests and Biodiversity,","authors":[],"date":"2003","doi":null,"raw":"May P, Boyd E, Chang M, Veiga F. 2003. Local sustainable effects of carbon projects in Brazil and Bolivia: a view form the ﬁeld. Paper presented at the international conference on Rural Livelihoods, Forests and Biodiversity, 19–23 May, Bonn, Germany.","cites":null},{"id":17206879,"title":"Lula lanc ¸a cu ´pula sobrebiocombustı ´vel edefende etanol, Estado deSa ˜oPaulo,","authors":[],"date":null,"doi":null,"raw":"ESP.2007c. Na ONU, Lula lanc ¸a cu ´pula sobrebiocombustı ´vel edefende etanol, Estado deSa ˜oPaulo, 26 September.","cites":null},{"id":17206865,"title":"Marina Silva destaca importa ˆncia do Fundo de Compensac ¸o ˜es Ambientais. Conservation International, Press release,","authors":[],"date":"2006","doi":null,"raw":"CI. 2006. Marina Silva destaca importa ˆncia do Fundo de Compensac ¸o ˜es Ambientais. Conservation International, Press release, 16 March.","cites":null},{"id":17206930,"title":"Modelling conservation in the Amazon Basin.","authors":[],"date":"2006","doi":"10.1038\/nature04389","raw":"Soares-Filho BS, Nepstad DC, Curran LM, Coutirho Cerqueira G, Alexandrino Garcia R, Azevedo Ravos C, Voll E, McDonald A, Lefebure P, Schlesinger P. 2006. Modelling conservation in the Amazon Basin. Nature 440: 520–523. SternN.2006.TheEconomicsofClimateChange:TheSternReview.HMTreasury—CabinetOfﬁce: London.","cites":null},{"id":17206939,"title":"National greenhouse gas inventory data for the period 1990–2004 and status of reporting (Annex I countries),","authors":[],"date":null,"doi":null,"raw":"UNFCCC. 2006a. National greenhouse gas inventory data for the period 1990–2004 and status of reporting (Annex I countries), Nairobi, 19 October.","cites":null},{"id":17206874,"title":"Nature’s Services: Societal Dependence on Natural Ecosystems.","authors":[],"date":"1997","doi":"10.2307\/3244191","raw":"Daily GC. 1997. Nature’s Services: Societal Dependence on Natural Ecosystems. Island Press: Covelo, California.","cites":null},{"id":17206851,"title":"O Destino da Floresta: Reservas Extractivistas e Desenvolvimento Sustenta ´vel na Amazo ˆnia. Relume Dumara ´: Rio de Janeiro.","authors":[],"date":"1994","doi":null,"raw":"Arnt R. 1994. O Destino da Floresta: Reservas Extractivistas e Desenvolvimento Sustenta ´vel na Amazo ˆnia. Relume Dumara ´: Rio de Janeiro.","cites":null},{"id":17206912,"title":"On the hydrological cycle of the Amazon basin: a historical review and current state-of-the-art.","authors":[],"date":"2006","doi":null,"raw":"Marengo JA. 2006. On the hydrological cycle of the Amazon basin: a historical review and current state-of-the-art. Revista Brasileira de Metereologia, 21(3): 1–19.","cites":null},{"id":17206944,"title":"Payment for environmental services: an analysis of participation","authors":[],"date":"2004","doi":"10.1016\/j.worlddev.2004.07.012","raw":"Zbinden S, Lee D. 2004. Payment for environmental services: an analysis of participation in Costa Rica’s PSA Programme. World Development, 33(2): 255–272.","cites":null},{"id":17206915,"title":"Payments for Environmental Services: A Survey and Assessment of Current Schemes.","authors":[],"date":"2004","doi":null,"raw":"Mayrand K, Paquin M. 2004. Payments for Environmental Services: A Survey and Assessment of Current Schemes. Unisfera International Centre: Montreal.","cites":null},{"id":17206942,"title":"Payments for environmental services: Some nuts and bolts.","authors":[],"date":"2005","doi":null,"raw":"Wunder S. 2005. Payments for environmental services: Some nuts and bolts. CIFOR Occasional Paper No. 42, Jakarta.","cites":null},{"id":17206850,"title":"Pecua ´ria na Amazo ˆnia: Tende ˆncias e Implicac ¸o ˜es para a Conservac ¸a ˜o. Imazon: Bele ´m.","authors":[],"date":"2005","doi":null,"raw":"Arima E, Barreto P, Brito M. 2005. Pecua ´ria na Amazo ˆnia: Tende ˆncias e Implicac ¸o ˜es para a Conservac ¸a ˜o. Imazon: Bele ´m.","cites":null},{"id":17206902,"title":"Peopling the environment: a new agenda for research, policy and action in Brazilian Amazonia.","authors":[],"date":"1997","doi":null,"raw":"Hall A. 1997b. Peopling the environment: a new agenda for research, policy and action in Brazilian Amazonia. European Review of Latin American and Caribbean Studies. 62(June): 9–31.","cites":null},{"id":17206938,"title":"Reducing emissions from deforestation in developing countries: approaches to stimulate action.","authors":[],"date":null,"doi":null,"raw":"UNFCCC. 2005b. Reducing emissions from deforestation in developing countries: approaches to stimulate action. 11th Conference of the Parties, Montreal, 28 November to 9 December.","cites":null},{"id":17206898,"title":"Relac ¸a ˜o entre cultivo de soja e desmatamento: coomprendendo a dina ˆmica. Grupo de Trabalho de Florestas, Fo ´rum Brasileiro de Organizac ¸o ˜es Na ˜o Governamentais e Movimentos Sociais para o Meio Ambiente e o Desenvolvimento, Sa ˜o Paulo.","authors":[],"date":"2005","doi":null,"raw":"GTF. 2005. Relac ¸a ˜o entre cultivo de soja e desmatamento: coomprendendo a dina ˆmica. Grupo de Trabalho de Florestas, Fo ´rum Brasileiro de Organizac ¸o ˜es Na ˜o Governamentais e Movimentos Sociais para o Meio Ambiente e o Desenvolvimento, Sa ˜o Paulo.","cites":null},{"id":17206931,"title":"Rewarding rainforest conservation to help global warming’","authors":[],"date":"2006","doi":null,"raw":"The Economist. 2006. ‘Rewarding rainforest conservation to help global warming’ 27 April.","cites":null},{"id":17206910,"title":"Silver Bullet or Fool’s Gold? AGlobal Review of Markets for Forest Environmental Services and Their Impacts on the Poor. International Institute for the Environment and Development:","authors":[],"date":"2002","doi":null,"raw":"Landell-Mills N, Porras I. 2002. Silver Bullet or Fool’s Gold? AGlobal Review of Markets for Forest Environmental Services and Their Impacts on the Poor. International Institute for the Environment and Development: London.","cites":null},{"id":17206936,"title":"Sixth compilation and synthesis of initial national communications from Parties not included in Annex I to the Convention,","authors":[],"date":null,"doi":null,"raw":"UNFCCC. 2005a. Sixth compilation and synthesis of initial national communications from Parties not included in Annex I to the Convention, Montreal, 6 December.","cites":null},{"id":17206876,"title":"Strategic Perceptions and Frontier Policies in Brazil.","authors":[],"date":"2000","doi":null,"raw":"Dreifuss R. 2000. Strategic Perceptions and Frontier Policies in Brazil. In Hall A (ed.). Amazonia at the Crossroads: the challenge of sustainable development. Institute of Latin American Studies, University of London: London; 205–232.","cites":null},{"id":17206940,"title":"Submission from Brazil: Positive Incentives for Voluntary Action in Developing Countries to Address Climate Change: Brazilian Perspective on Reducing Emissions from","authors":[],"date":null,"doi":null,"raw":"UNFCCC. 2006b. Submission from Brazil: Positive Incentives for Voluntary Action in Developing Countries to Address Climate Change: Brazilian Perspective on Reducing Emissions from Deforestation, 12th Conference of the Parties to the UNFCCC, Nairobi, Kenya, 14 November. http:\/\/unfccc.int\/ ﬁles\/meetings\/dialogue\/application\/pdf\/wp_21_braz.pdf (accessed on 16 November).","cites":null},{"id":17206901,"title":"Sustaining Amazonia: Grassroots Action for Productive Conservation.","authors":[],"date":"1997","doi":"10.2307\/3985347","raw":"Hall A. 1997a. Sustaining Amazonia: Grassroots Action for Productive Conservation. Manchester University Press: Manchester.","cites":null},{"id":17206849,"title":"Targeting Payments for Environmental Services: The Role of Risk.","authors":[],"date":"2003","doi":"10.2139\/ssrn.836144","raw":"Alix-Garcia J, de Janvry A, Sadoulet E. 2003. Targeting Payments for Environmental Services: The Role of Risk. Giannini Foundation of Agricultural Economics: Berkeley, CA. Amazonas.2007.Leidemudanc ¸asclima ´ticas,conservac ¸a ˜oambientaledesenvolvimentosustenta ´vel. Manaus. AraujoLimaC,PiedadeMT,BarbosaF.1998.WaterasamajorresourceoftheAmazon.InDaviesde Freitas ML (ed.). Amazonia: Heaven of a New World. Editora Campus: Rio de Janeiro.","cites":null},{"id":17206882,"title":"Test case for EU carbon sinks.","authors":[],"date":"2002","doi":null,"raw":"EU. 2002. Test case for EU carbon sinks. EU Forest Watch, 66, September. FAO.1999.Brazil.PilotProgrammetoConserve theBrazilianRainforest(PPG-7):AnEvaluationof Six Demonstration Projects (PD\/As). FAO: Rome.","cites":null},{"id":17206943,"title":"The efﬁciency of payments for environmental services in tropical conservation.","authors":[],"date":"2006","doi":"10.1111\/j.1523-1739.2006.00559.x","raw":"Wunder S. 2006. The efﬁciency of payments for environmental services in tropical conservation. Conservation Biology, 21(1): 48–58.","cites":null},{"id":17206875,"title":"The New Economy of Nature.","authors":[],"date":"2008","doi":"10.1016\/b978-0-08-028112-4.50003-x","raw":"Copyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008) DOI: 10.1002\/jid 978 A. HallDaily G, Ellison K. 2002. The New Economy of Nature. Island Press: Washington, DC.","cites":null},{"id":17206877,"title":"The potential of avoided deforestation to protect the Amazon and mitigate climate change. Philosophical Transactions of the Royal Society B, These Issue ‘Climatic change and the fate of the Amazon’","authors":[],"date":"2008","doi":null,"raw":"Ebeling J. 2008. The potential of avoided deforestation to protect the Amazon and mitigate climate change. Philosophical Transactions of the Royal Society B, These Issue ‘Climatic change and the fate of the Amazon’ 2008. Published online. doi:10.1098\/rstb.2007.0034 ESP. 2007a. RioR15 comec ¸a sem grandes autoridades, mas com pole ˆmica, Estado de Sa ˜oPaulo, 20 September.","cites":null},{"id":17206941,"title":"The Wealth of the Poor: Managing Ecosystems to Fight Poverty. United Nations Development Programme, World Bank, World Resources Institute:","authors":[],"date":"2005","doi":null,"raw":"WRI. 2005. The Wealth of the Poor: Managing Ecosystems to Fight Poverty. United Nations Development Programme, World Bank, World Resources Institute: New York.","cites":null},{"id":17206928,"title":"Tropical deforestation and the Kyoto Protocol.","authors":[],"date":"2005","doi":"10.1007\/s10584-005-8074-6","raw":"Santilli M, Moutinho P, Schwartzman S, Nepstad D, Curran L, Nobre C. 2005. Tropical deforestation and the Kyoto Protocol. Climatic Change, 71: 267–276.","cites":null},{"id":17206854,"title":"Voluntary Carbon Markets.","authors":[],"date":"2006","doi":"10.1177\/1086026607313683","raw":"Bayon R, Hawn A, Hamilton K. 2006. Voluntary Carbon Markets. Earthscan: London.","cites":null},{"id":17206859,"title":"What impacts would the dieback of Amazonia have on regional and global climate, carbon, water and energy cycles? In the present volume.","authors":[],"date":"2008","doi":null,"raw":"Betts R. 2008. What impacts would the dieback of Amazonia have on regional and global climate, carbon, water and energy cycles? In the present volume.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-10","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/209943.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/21260\/1\/__Libfile_repository_Content_Hall%2C%20A_Paying%20for%20environmental_Paying%20for%20environmental%20%28lsero%29.pdf","pdfHashValue":"ff691ec0bbaa0779e2c780c20cdf3d380baa0f08","publisher":"John Wiley and Sons, Inc","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:21260<\/identifier><datestamp>\n      2012-09-25T13:58:40Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5341<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/21260\/<\/dc:relation><dc:title>\n        Paying for environmental services: the case of Brazilian Amazonia<\/dc:title><dc:creator>\n        Hall, Anthony<\/dc:creator><dc:subject>\n        GF Human ecology. Anthropogeography<\/dc:subject><dc:subject>\n        H Social Sciences (General)<\/dc:subject><dc:publisher>\n        John Wiley and Sons, Inc<\/dc:publisher><dc:date>\n        2008-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/21260\/1\/__Libfile_repository_Content_Hall%2C%20A_Paying%20for%20environmental_Paying%20for%20environmental%20%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Hall, Anthony  (2008) Paying for environmental services: the case of Brazilian Amazonia.  Journal of International Development, 20 (7).  pp. 965-981.  ISSN 0954-1748     <\/dc:identifier><dc:relation>\n        http:\/\/eu.wiley.com\/WileyCDA\/WileyTitle\/productCd-JID.html<\/dc:relation><dc:relation>\n        10.1002\/jid.1456<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/21260\/","http:\/\/eu.wiley.com\/WileyCDA\/WileyTitle\/productCd-JID.html","10.1002\/jid.1456"],"year":2008,"topics":["GF Human ecology. Anthropogeography","H Social Sciences (General)"],"subject":["Article","PeerReviewed"],"fullText":"  \nAnthony Hall  \nPaying for environmental services: the case \nof Brazilian Amazonia \n \nArticle (Accepted version) \n(Refereed) \n \n \n Original citation: \nHall, Anthony (2008) Paying for environmental services: the case of Brazilian Amazonia. Journal \nof international development , 20 (7). pp. 965-981. ISSN 0954-1748  \n DOI: 10.1002\/jid.1456 \n \n© 2008 John Wiley and Sons, Ltd \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/21260\/ \nAvailable in LSE Research Online: September 2012  \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n \nPAYING FOR ENVIRONMENTAL\nSERVICES: THE CASE OF\nBRAZILIAN AMAZONIA\nANTHONY HALL*\nDepartment of Social Policy, London School of Economics, London, WC2A 2AE, UK\nAbstract: Compensating natural resource users for the environmental services they supply is\nbecoming an increasingly attractive policy option in a number of countries. Ranging from\nofficial carbon trading through the Clean Development Mechanism (CDM) of the Kyoto\nProtocol to more informal arrangements, payments for environmental services (PES) can offer\nfinancial incentives for promoting ecologically sound conservation and development practices.\nPES principles could be applied more widely in Brazilian Amazonia to help curb high rates of\ndeforestation which are gradually undermining the region’s capacity to supply key services\nsuch as carbon sequestration, biodiversity maintenance and water cycling, and to sustain\npeople’s natural resource-dependent livelihoods. This potential could be especially significant\nif avoided deforestation were eventually to be permitted for acquiring certified emissions\noffsets under the CDM. Copyright # 2008 John Wiley & Sons, Ltd.\nKeywords: environmental services; deforestation; livelihoods; Amazonia; Kyoto Protocol\n1 INTRODUCTION\nProviding financial compensation to natural resource-users for their contribution to the\nlong-term preservation of the physical environment through ‘payments for environmental\nservices’ (PES) has climbed high on the international policy agenda (UNDP, 2005; WRI,\n2005; Stern, 2006). The search for new instruments such as PES has intensified with the\ngradual move away from a total reliance on punitive, command-and-control interventions\nin environmental policy, and towards a sustainable development approach which attempts\nto reconcile outright protectionism with economic activities to sustain the livelihoods of\nJournal of International Development\nJ. Int. Dev. 20, 965–981 (2008)\nPublished online 8 July 2008 in Wiley InterScience\n(www.interscience.wiley.com) DOI: 10.1002\/jid.1456\n*Correspondence to: Anthony Hall, Reader in Social Planning, Department of Social Policy, London School of\nEconomics, Houghton Street, London, WC2A 2AE, UK. E-mail: a.l.hall@lse.ac.uk\nCopyright # 2008 John Wiley & Sons, Ltd.\nlocal populations. Paying people to conserve ecosystems for wider benefit rather than\ndegrade them for individual, short-term gain has an obvious appeal. Not only are punitive\nsystems based solely on negative sanctions notoriously ineffective in the context of\ndeveloping countries with weak institutions and limited policing capacity. Providing\nfinancial incentives to the poor can generate income and employment for resource users\nwhile helping to conserve ecosystems, supporting local populations as major stewards of\nthe environment.\nPaying resource users to sustain vital environmental services adds a significant\ndimension to previous approaches by recognising that usually intangible functions, which\nhave traditionally been considered ‘free’ public goods, have a value that can bemeasured in\neconomic, social and ecological terms. The growing scarcity of these services as\necosystems come under pressure makes them tradable; they include, for example,\nbiodiversity conservation, carbon sequestration, watershed management and maintenance\nof landscape beauty. They underpin environmental sustainability at local, national and\nglobal levels; a case of local action having global impacts and implications (Hall, 2005).\nYet the PES approach also recognises that, as a contingent method, costs are incurred and\ntrade-offs are inevitable as competing interests are reconciled through the making of\ncompensation payments.\nBrazil is becoming a testing ground for the design and application of environmental\nservice payments, illustrating both the potential for this method as well as its pitfalls and\nlimitations. Although still very much in its infancy, experiments with PES are being made\nin the southern industrial heartland (see below). Yet it is in the Amazon region where PES\noffers the greatest potential for simultaneously improving the livelihoods of poor\nresource-users while helping to reduce rates of deforestation and limit greenhouse gas\nemissions. Globally, deforestation is the source of about 20 per cent of greenhouse gases,\nthe second largest contributor after fossil fuels. In Brazil, however, where Amazonia covers\nalmost two-thirds of the surface area, deforestation and associated burning was responsible\nfor over 70 per cent of the country’s CO2 emissions by the early 1990s and this proportion\nhas increased since then (UNFCCC, 2005a; Stern, 2006). The strategic targeting of PES\npolicies on critical areas of settlement and deforestation in Amazonia could, therefore, help\nslow down the region’s persistently high rates of destruction and maintain key\nenvironmental services generated by the standing forest.\nThe main market in environmental services involves greenhouse gas emissions trading,\nprincipally for the purpose of carbon sequestration. In terms of international financial\nflows, the potential role of forests (Amazonia in particular) in averting global warming is\nespecially significant (WRI, 2005; Stern, 2006). Based on article 12 of the Kyoto Protocol,\nforest carbon projects entered the policy arena via the Clean Development Mechanism\n(1997) of the 1992 UN Framework Convention on Climate Change (UNFCC). For the first\ncommitment period (2008–2012), the CDM has set a mandatory combined emissions\nreduction target for industrialised countries of 5 per cent below 1990 levels. Individual\ncountry targets vary, while the US and Australia infamously refused to sign up.\nWithin the CDM, Northern enterprises producing ‘excessive’ greenhouse gases may\noffset their surplus by purchasing credits from organisations that under-produce such\nemissions, moving towards ‘carbon neutral’ status in due course. In their turn, although not\nyet bound to specific targets by the CDM, developing countries have begun to sell carbon\ncredits to northern enterprises. In the forest sector such trading is based on environmental\nservices generated by the restoration of degraded lands and reforestation projects.\nControversially, the maintenance of standing forest (‘avoided deforestation’) is not at\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\n966 A. Hall\npresent included in the CDM as a vehicle for the acquisition of carbon credits.1 This\nrestriction has major implications for Brazil’s future participation in carbon trading markets.\nA growing number of industrial enterprises are entering into voluntary agreements outside\nof the Kyoto Protocol. This ‘informality’ has the dual advantage of allowing companies to test\nhow the system works for future reference and to strengthen their ‘green’ credentials.\nAccording to the World Bank, the value of carbon trading has grown from US$10 billion in\n2005 to US$30 billion in 2006 (Capoor and Ambrosi, 2007). These credits were purchased\nmainly by rich countries under the EU Emissions Trading Scheme (US$24.3 billion) and to\nmeet their obligations under the CDM (US$4.8 billion), but voluntary offsets have grown to\nreach US$100million in 2006. Not just industrial enterprises but also banks, airlines and other\ncompanies are joining the fray through trading channels such as the Chicago Climate\nExchange and the New SouthWalesMarket (Bayon et al., 2006; Capoor andAmbrosi, 2007).\n2 PAYING FOR ENVIRONMENTAL SERVICES\nIt has been established that natural ecosystems provide services which benefit humanity,\nthus possessing both intrinsic and potential economic value (Daily, 1997; Daily and\nEllison, 2002). In the case of Amazonia, arguments have long been put forward for the\nmore rational use of economic instruments to promote sustainable forest management to\nattend to the basic needs of local populations and wider interests (Fearnside, 1989, 1997).\nIn order to harness this value, making PES is based on the principle that the external\nbeneficiaries of such services may make direct, contractual payments to local landholders\nand resource-users in return for adopting practices to restore and sustain ecosystems. By\nproviding incentives to both suppliers and consumers of environmental services, PES\nhopes to encourage ecosystem preservation in situations where traditional comman-\nd-and-control methods are on their own unlikely to work properly.\nThe PES approach has certain distinctive features which make it broadly appealing to\nstakeholders (Wunder, 2005). In principle, it has the following advantages: (i) Voluntarism.\nUnlike conventional ‘fences-and-fines’ policies, PES is essentially a voluntary, negotiated\nframework between those who supply environmental services and those who exercise demand\nfor them. However, the principle of payments can also be built into more traditional, obligatory\nconservation policies to reward service suppliers; (ii)Quantification. In order for payments to be\ncalculated, services should ideally be quantifiable; for example, in terms of tons of carbon stored,\narea reforested, deforestation avoided or volume of clean water supplied; (iii) Contingency-\nbased. Payments to service providers are conditional upon a continuous supply beingmaintained\nand uponmonitoring of compliancewithin negotiated agreements; and (iv) Flexible format. PES\nschemes may adopt a number of formats. They are mainly area-based (for example, protected\nconservation units and catchments or forest-carbon plantations). Increasingly, however, they are\nproduct-focused around ‘green’ or certified items such as sustainably managed timber, forest\nfruits or ecotourism. There is no guarantee, however, that revenues generated will feed back into\necosystem maintenance. Schemes may be publicly managed (as in the case of Costa Rica\nmentioned below) or, far more typically, involve mixed arrangements embracing partnerships of\ncommunities, government agencies, private companies and NGOs.\n1In the CDM, the only eligible activities under the ‘land-use, land-use change and forestry’ (LULUCF) category\nare reforestation, afforestation and forest management. An industrialised country is allowed to offset no more than\n1 per cent of its base-year emissions through CDM forestry projects. In practice, such projects have not proved to\nbe a popular option and they are expected to account for just 0.22 per cent of CDM credits by 2012 (Karaousakis,\n2007).\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\nPaying for Environmental Services 967\nBy 2004, some 300 PES schemes had been identified around the world, located\nprincipally in the industrialised countries (Mayrand and Paquin, 2004). At September\n2007, almost 800 projects were registered under the CDM, with a further 78 having\nrequested registration and over 2100 more in the pipeline (UNFCCC\/CDM, 2007). India\nhas the largest proportion of registered schemes (35 per cent), followed by China (15 per\ncent), Brazil (14 per cent) and Mexico (11 per cent). In addition, other projects are funded\nthrough an increasingly large, informal carbon market (Bayon et al., 2006).\nCosta Rica boasts the world’s only national PES system. Introduced in 1996, it rewards\nlandowners for conserving forests through reforestation and maintenance of existing areas.\nIndustries compensate their carbon emissions through a tax on fossil fuels and purchase of\ncarbon offset certificates, the revenue from which helps fund the PES programme. Initial\nsupport was received from the World Bank and the Global Environmental Facility (GEF).\nThe scheme now covers some 10 per cent of the country and benefits around 8000\nlandowners engaged in forest protection, management and reforestation over 500 000\nhectares, at a cost to date of US$120 million (Zbinden and Lee, 2004; Karaousakis, 2007).\nApart from Costa Rica’s national PES programme, other experiences in the South are\nlimited to a relatively small number of projects in Latin America and elsewhere\n(Landell-Mills and Porras, 2002; McShane and Wells, 2004; Grieg-Gran et al., 2005). For\nexample, in the Cauca Valley, Colombia, downstream sugarcane growers affected by flooding\npay poor upland farmers to protect thewatershed, reducing damage and bringing development\nbenefits to the communities. From 1995 to 2000, some $1.5 million was generated for\ninvestments in the uplands. Mexico’s pioneering programme of payments for environmental\nhydrological services (PEHS), introduced in 2003, protects over 600000 hectares of cloud\nforest and lowland rain forest in both private and collective (ejido) areas (Karaousakis, 2007).\nChina’s sloping land programme, started in 1999 to encourage planting in erosion-vulnerable\nareas, covers seven million hectares and is set to double in size (Chomitz et al., 2007).\nAlthough resource conservation and not poverty alleviation was the original, overriding\nobjective of PES schemes, the idea has been seized upon for its potential to link\nenvironmental payments to the strengthening of local livelihoods (Grieg-Gran et al., 2005;\nMurdiyarso et al., 2005; Wunder, 2005). Indeed, this ‘pro-poor PES’ concept is enshrined\nin the Millennium Development Goals.2 The discovery of this potential is hardly\nsurprising, given the fact that local inhabitants and resource-users, if provided with\nappropriate support, are arguably the most effective guardians of forests and other\npopulated ecosystems. Although there is an issue to be considered when designing such\nschemes concerning equity versus efficiency (see below), research shows that PES\npayments can have a significant impact on the livelihoods of the poor and may contribute\nup to 40 per cent or more of household income (Wunder, 2005).\n3 THE AMAZON CONTEXT\nDeforestation is an increasingly serious problem in the Amazon. About three-quarters of\nBrazilian Amazonia comprises tropical moist forest, with the remainder consisting of savannah\ngrassland (cerrado), largely on its southern fringes. In recent years, annual forest loss has\naveraged about 20 000km2; in 2003–2004 it rose to 27 000km2, the second highest ever\nrecorded (having reached 29000km2 in 1995) but in 2005–2006 fell back to 13 100m2. A\n2MDG Target 9, Goal 7 identifies the preservation of ecosystem services for ‘equitable environmental manage-\nment and poverty reduction’.\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\n968 A. Hall\nfurther 15000km2 is damaged annually by forest fires and illegal logging (Nepstad et al.,\n1999). Although just 17 per cent of Brazil’s Amazon rainforest has been totally lost to\nclear-felling, half of the region has been affected by human activity, with currently intact areas\nin the west coming under growing threat. Forest fragmentation has led to further biodiversity\nloss owing to the reduced ability of small areas to support flora and fauna (Lovejoy, 2000).\nIt has been calculated that, at current rates of destruction, almost 50 per cent of the\nAmazon rainforest will have disappeared by 2050 (Soares-Filho et al., 2006).\nDeforestation and forest fires in Brazil emit 200–300 million tons of carbon a year\n(reaching up to 500 tons per hectare annually in dense rainforest), while fossil fuels account\nfor less than 100 tons overall. Climate change projections for the Amazon based on the\nHadCM3 model3 predict major forest die-back and savannisation of the region by 2050 at\ncurrent rates of deforestation, leading to an average temperature rise of 28–38C and a\nrainfall reduction of 10–20 per cent (Cox et al., 2004; Marengo, 2006, 2008; Greenpeace,\n2006; Betts, 2008; Huntingford et al., 2008; Nobre, 2008).\nThese disturbing figures attest to the steady erosion of Amazonia’s natural resource base\nand the seemingly inexorable undermining of its ability to supply vital environmental\nservices. Under the military regime from 1964 to 1985 an aggressive strategy of regional\ndevelopment was implemented, favouring large landowners and commercial enterprises but\nalso encouraging small farmer settlement (Hall, 1989). Overall, medium and large-scale\ncattle ranching has been responsible for around 70 per cent of forest loss in the region,\nsmall-scale farming for some 20 per cent and commercial logging and mining for the\nremainder (Fearnside, 2005). Subsequent civilian governments have been equally supportive\nof settlement and commercial development policies that have led to consistently high rates of\nforest loss. Expansion of the highway network and soybean cultivation in the Amazon has\nrecently added to such pressures (Fearnside, 2005; GTF, 2005; Greenpeace, 2006).\nDeforestation rates in Brazilian Amazonia respond principally, at least in the short to\nmedium term, not to environmental policy as such but rather to the macro-economic\nclimate and the resulting financial incentives that encourage land speculation, ranching and\nfarming. For example, the peak rainforest destruction year of 1995 reflects economic\nrecovery under Brazil’s Plano Real which encouraged investment, while the subsequent\ndrop in deforestation during 1996–1997 was a response to the fall in inflation and land\nvalues (Fearnside, 2005). Similarly, the fall in deforestation rates registered during\n2005–2006 has been attributed in large measure to the drop in commodity prices and US\ndollar, while the subsequent increase in forest loss has been put down to the increased price\nof soybean (ESP, 2007b). In terms of policies designed to directly control deforestation, the\nmost successful strategy has arguably been the designation of protected areas. Some 40 per\ncent of the region is set aside under either the National System of Conservation Units—\nSNUC (including biological reserves, national parks, national forests and extractive\nreserves, amongst others) or as indigenous reserves.\nLevels of legal protection vary considerably by state, ranging from the relatively intact\nand sparsely populated Amazonas in the west to long-settled, degraded and conflict-ridden\nPara´ in the east of the region. Outright conservation has been relatively effective\nin preventing deforestation and maintaining environmental services, although serious\nproblems remain with vigilance and law enforcement, including susceptibility to illegal\nlogging and informal mining. Brazil’s Forest Code (1965) requires that 80 per cent of forest\ncover on individual properties in the Amazon be maintained. Yet owners have no direct\n3Hadley Centre Coupled Model, version 3.\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\nPaying for Environmental Services 969\neconomic incentive to do so and the law is frequently flouted as land is converted to pasture\nor other legally designated ‘productive’ uses requiring forest removal.\nThere is an urgent need for new policy instruments such as PES to be applied in Amazonia,\ncomplementing existing conservation measures, in order to create a more effective\nenvironmental policy framework. Since the Earth Summit (1992), increasing emphasis has\nbeen placed in Brazil and elsewhere on the incorporation of forest dwellers into programmes\nof environmental governance. These have typically been labelled under the rubric of\n‘integrated conservation and development projects’ (ICDPs) such as terrestrial and aquatic\nextractive reserves, sustainable forest management, agroforestry initiatives and ecotourism.\nThis move towards reconciling natural resource conservation with livelihood strengthening,\nor ‘productive conservation’ (Hall, 1997a), is still in its infancy but is finding greater space on\nthe policy agenda. However, the provision of indirect payments to encourage conservation\nthrough ICDPs and similar schemes suffers from a number of problems. These include\ninstitutional complexity, high administrative and financial costs and poor sustainability\n(Ferraro and Kiss, 2002). Being a more direct form of remuneration to forest peoples, PES\ncould help overcome some of these obstacles by generating longer-term income flows for\nparticipating groups in return for their conservation efforts. Yet as noted in the concluding\nsection below, many operational challenges remain.\n4 PES POTENTIAL IN AMAZONIA\nBrazilian Amazonia, the world’s largest remaining area of tropical rainforest, supplies\nenvironmental services which are vital for national and global climatic stability. Although\ncalculating the economic value of environmental services is notoriously difficult, it has\nbeen estimated that in the case of Brazilian Amazonia such payments could generate\nbetween US$500 million and $2.5 billion a year in revenues which could be used for\nconservation (Fearnside, 2006a,b; The Economist, 2006). Farmers in the Amazon currently\ndestroy rainforest to create croplands and pastures worth perhaps US$200 per hectare. This\nsame area could yield US$10 000 in carbon payments at the EU price of US$20 per ton for\nthe average 500 tons of carbon emissions per hectare saved through avoided deforestation\n(Chomitz et al., 2007). Yet even at far more modest prices, carbon payments could provide\na powerful incentive for farmers to preserve forest.\nAmazonia supplies the following major environmental services:\n(i) Carbon sequestration and storage. Carbon is stored in the biomass and soil, making\nup half of the dry weight of trees. Deforestation releases much of this as carbon\ndioxide (CO2) and methane (CH4) contributing to global warming. As already noted,\ndeforestation is the second largest global source of carbon after fossil fuels. In Brazil\nitself, deforestation now accounts for almost 80 per cent of the nation’s CO2\nemissions. Brazil is presently the world’s fourth largest emitter of total greenhouse\ngases after the US, China and Russia (UNFCCC, 2005a, 2006a). As a vital\ncarbon sink, Amazonia accounts for 38 per cent of total tropical biomass, while\nAmazon deforestation itself contributes significantly to GHG emissions. Slowing\ndown deforestation could play an important role in curbing those very emissions and\nameliorating the process of global warming.4\n4Deforestation, 20 per cent of which occurs in Brazil, accounts for some 18 per cent of global GHG emissions,\n(Stern, 2006). Since in Brazil this is almost entirely due to forest loss in the Amazon it can be inferred that\ndeforestation in Brazilian Amazonia is thus responsible for around 3.5 per cent of the world’s emissions.\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\n970 A. Hall\n(ii) Biodiversity protection. It is estimated that Brazilian Amazonia houses 20 per cent of\nthe world’s estimated 1.5 billion species (Capobianco et al., 2001). Aside from its\nintrinsic value, this natural capital stock represents incalculable economic, social and\nenvironmental wealth which has not only huge commercial potential for the country\nbut is essential for supporting the livelihoods of forest dwellers and local commu-\nnities. Protection of biodiversity would automatically accompany forest maintenance\nas mutually dependent environmental services.\n(iii) Water cycling. The River Amazon contributes one-fifth of total global fluvial\ndischarge into the oceans (Araujo Lima et al., 1998). Deforestation substantially\nreduces the region’s ability to recycle water vapour. Several studies have shown that\nlocal evapotranspiration accounts for a large proportion of Amazonia’s rainfall,\nranging from about half to over 80 per cent (Marengo, 2006). Deforestation can\nthus seriously affect water recycling patterns, giving rise to local and national impacts\non the weather and result in negative feed-back loops which may lead to further forest\ndie-back (as predicted by the HadCM3 climate change model mentioned above). The\nsouth-eastern state of Sa˜o Paulo, for example, is dependent on the Amazon for 70 per\ncent of its rainfall in December (Fearnside, 2005). Any reductions due to deforestation\nwill have serious repercussions, as has already been demonstrated during recent\ndrought episodes and resulting power blackouts.\n(iv) Landscape beauty. Ecotourism is a fast-expanding field, with pro-poor ecotourism\ngradually establishing itself as a niche market catering for outsiders who wish to\nspend time living in traditional communities (Landell-Mills and Porras, 2002).\nPreservation of Amazonia’s diverse ecosystems for tourism purposes by both larger\noperators and small communities offers a valuable potential revenue source with a\nbuilt-in environmental service component. It can both help reduce deforestation and\nmaintain biodiversity by providing an alternative income source.\nAs the second commitment period (2013–2017) of the Kyoto Protocol approaches, there\nwill be intense pressure on major developing countries such as China, India and Brazil,\ncurrently amongst theworld’s top polluters, to go beyond ratification of the treaty and make\nfirm commitments to emissions reductions. Brazil is gradually joining the emissions\ntrading arena and has embarked on a number of carbon sequestration projects.\n4.1 Existing PES Schemes in Brazil\n4.1.1 Carbon projects\nBrazil has the distinction of being home to the world’s first project officially registered\nunder the Clean Development Mechanism of the Kyoto protocol. The Nova Gerar landfill\nscheme, located in the industrial region of Nova Iguac¸u in Rio de Janeiro, is funded through\nthe Prototype Carbon Fund (PCF), managed by the World Bank. It will capture an\nestimated 2.9 million tons of CO2 equivalent greenhouse gases by 2012. In the forest sector,\nexperience has so far been limited to a handful of voluntary carbon sequestration projects\nbased on reforestation of degraded areas. Three projects stand out, of which two are in the\nAmazon (May et al., 2003; Grieg-Gran et al., 2005).\nThe Plantar carbon project in Minas Gerais (situated outside of Amazonia) and funded\nthrough the World Bank’s Prototype Carbon Fund aims to generate certified emissions\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\nPaying for Environmental Services 971\nreductions (CERs) to maintain the use of charcoal in the pig-iron industry instead of switching\nto mineral coke, and to reforest 23 000 hectares with eucalyptus. It has, however, attracted\nmuch criticism.5 The Peugeot carbon sink project is intended to reforest 2000 hectares in the\n‘deforestation arc’ inMato Grosso. There is at present no intention to seek carbon credits under\nKyoto but rather to improve the environmental image of the car industry (sequestering\n0.5 million tons of carbon over a period of 100 years) and to gain experience in the emerging\ncarbon market while encouraging forestry extension activities. Finally, the Bananal Island\nconservation project in Tocantins state around the Araguaia National Park has been set up to\ntest the potential for carbon storage based on avoided deforestation, forest recuperation\nand conservation inside public parklands. In addition to these carbon projects, the private\nsector in Brazil is expanding its environmental actions in other ways. For example, the\nBotica´rio Foundation (Brazil’s equivalent of the UK’s Body Shop) has announced plans to pay\nUS$12 million over 10 years to landowners who conserve the Atlantic rainforest at the\nheadwaters of Greater Sa˜o Paulo’s rivers (Nascimento Madureira, 2006).\n4.1.2 Proambiente\nThe first three above examples of corporate-sponsored carbon sequestration are promising\nexperiments in PES but they do not significantly touch upon the lives of local populations.\nAnother initiative designed to compensate for environmental services rendered by the region’s\nestimated 2.5 million small producers (including family farmers, extractivists, fishers and\nindigenous groups) in a total regional population of around 20 million is the ‘Sustainable\nDevelopment Programme for Rural Family Production in Amazonia’ (Proambiente). Originally\ninspired by the non-governmental organisation IPAM, several pilot community schemes were\nset up from 2001 by the Federation of Rural Trades Unions (FETAGRI), a broad coalition of\nNGOs and small farmer organisations in search of an alternative development model that would\noffer policy options to reconcile conservation with livelihood support in Amazonia. Following\nconsultation between civil society and government authorities,Proambientewas officially taken\nover in 2003 by the Ministry of the Environment (MMA, 2005).\nProambiente revolves around a ‘Programme of Socio-Environmental Services’\nsupported by a ‘Social-Environmental Fund’ to provide payments to small producers\nfor environmental services rendered, as well as a Support Fund for technical guidance,\nextension, monitoring and certification, supplemented where necessary by production\ncredit. Some 350 families in each of 11 ‘development poles’ throughout Amazonia (about\n4000 families altogether) were initially involved. Certification of sustainable local development\npractices would in theory allow each participating family to receive one-third of a minimum\nsalary (about US$35) per month as payment for environmental services supplied.\nBy late 2007, however, results of Proambiente were mixed. Only half a dozen of the\nprojects were effectively operational and just 40 per cent of farmers in the scheme had\nreceived one-off payments, amounting to R$650 (US$325) per household, considerably\nless than that had been planned.6 Furthermore, because it has not yet been possible to\nestablish a formal channel for government budgetary support to Proambiente as originally\nintended, emergency funding was granted through the G7 Pilot Programme. The\n5Rural unions and environmental NGOs have opposed the inclusion of Plantar in the CDM on the grounds that it\nhas had negative environmental impacts by lowering the water table and caused social tensions with local farmers.\nOther criticisms relate to its allegedly poor carbon storage potential and dubious baseline assumptions (EU, 2002).\n6Comments on Proambiente, unless otherwise stated, are based on the author’s interviews with project\nbeneficiaries, local technicians and staff from the Ministry of the Environment and Ministry of Agrarian\nDevelopment, during August 2007.\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\n972 A. Hall\nestablishment of a proper financial mechanism has been hampered by the lack of legal\nrecognition in Brazil at the federal level of the concept environmental services and of their\neconomic value. This situation contrasts with that of Costa Rica and Mexico, for example,\nwhere a legal framework and government funding channels for their respective PES\nprogrammes were established from the outset. In Brazil, the problem is only now being\naddressed through several draft bills to Congress which aim to set up a ‘National\nProgramme of Environmental Services’ or ‘Green Fund’ (Bolsa Verde) for small farmers to\nbe financed through international donations. Provision is also being made to secure more\npermanent domestic funding for PES from the national budget.7\nThe state of Amazonas has stolen a march on the federal government by introducing the\ncountry’s first PES legislation. Under its ‘Law on Climatic Change, Environmental\nConservation and Sustainable Development’ (published in April, 2007), a monthly grant\n(Bolsa Floresta) of R$50 (US$25) will be made to over 2000 households in six ‘sustainable\ndevelopment’ protected areas within the state as compensation for their conservation\nactivities, eventually extending to 30 such reserves (Amazonas, 2007). AUS$1 billion fund\nis to be established from domestic and international sources to finance the scheme over the\nlong-term. The Amazonian state of Acre is also entertaining a similar idea and it is possible\nthat, in future, state governments will assume an increasingly large responsibility for\ninstituting PES systems.8\n4.1.3 Ecological VAT\nThe ‘ecological value-added tax’ (ICMS-E) allocates 2.5 per cent of state VAT revenues to\ncompensate regional governments for tax income lost due to the designation of standing\nforests as protected areas. Introduced originally in southern Brazil, it has also been applied\nin the Amazon states of Rondoˆnia and Mato Grosso. The measure has encouraged\nconservation in states with high levels of protection (above 25 per cent) but it has tended to\nbenefit larger landowners disproportionately (as in the Costa Rican case) and its potential\nas a mechanism for ‘pro-poor’ PES is currently being examined (Grieg-Gran, 2000; May\net al., 2002; IIED, 2006).\n4.2 Potential PES Initiatives in the Amazon\nAlthough the number of PES initiatives in Brazil is extremely limited, there is major\npotential for adding a service payment dimension to a range of existing ‘productive\nconservation’ projects in order to help them become more financially self-sufficient. In\nAmazonia, extractive reserves, agroforestry and sustainable forest management are related\nareas in which PES could help generate a more continuous income stream to make them\nmore independent of the fixed project cycle and budget on which so many such projects are\nalmost totally dependent, especially during their earlier phase. This perception found\npolitical expression at the second meeting of Amazonia’s ‘peoples of the forest’ held in\nBrasilia in September 2007. The final declaration demanded that ‘indigenous peoples\nand traditional communities should be remunerated with dignity for environmental\n7These bills are being introduced by Deputies Anselmo de Jesus (PT-Rondoˆnia) and Antonio Palocci (PT-Sa˜o\nPaulo) as well as by the Ministry of the Environment.\n8Discussions with Acre state government officials, August 2007.\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\nPaying for Environmental Services 973\nservices provided for Brazil and the world by preserved areas in the face of climate change’\n(Brazil, 2007).\nThe ‘extractive reserve’ (resex) was introduced onto the statute books in 1990 under the\nadministration of President Jose´ Sarney. This followed the rubber tappers’ campaign to\ndefend their lands in southern Acre against encroachment by cattle ranchers, which\nculminated in the murder of their leader, Francisco ‘Chico’ Mendes in 1988 (Gross, 1989;\nRevkin, 1990; Arnt, 1994). As the first formal instrument in Brazil that attempted to\nreconcile forest conservation with strengthening resource users’ livelihoods, it was a major\nlandmark in environmental policy for that country (Hall, 1997a,b). The first four federal\nreserves set up in Acre, Rondoˆnia and Amapa´ covered two million hectares, and by 2005 a\nfurther 32 had been created in Amazonia with more in the pipeline (IBAMA, 2006). Resex\nare jointly managed by local resource users and government agencies at federal or state\nlevel under a form of cooperative, private usufruct on 30-year leases. Yet although they\nhave been quite successful in terms of containing deforestation, extractive reserves suffer\nfrom continuing problems of over-dependence on single products, weak management,\nlack of alternative income sources, poor levels of social investment and consequent\nout-migration, which can deprive reserves of the human resources necessary for vigilance\nand management purposes (Hall, 2006).\nAgroforestry combines small-scale agriculture with the cultivation of perennial tree\ncrops (Brazil nuts, fruits, resins, palm products, etc.), replacing slash-and-burn farming\nwith sedentary production that minimises forest removal. Hundreds of such projects exist\nin the Amazon region, and it is estimated that 35 million hectares of degraded lands could\nbe adapted for this purpose (Smith et al., 1998; FAO, 1999). Agroforestry schemes have a\nhighly mixed record of success, but the guarantee of a more stable income flow from\nenvironmental services could help many embryonic community schemes through their\ninitial phases, as envisaged in Proambiente, discussed above.\nSustainable forest management (SFM) caters for the growing international and Brazilian\nmarket in certified timber. Brazil has 3.5 million hectares certified by the Forest\nStewardship Council (FSC) of which half lies in the Amazon. Of the country’s 62 certified\noperations, 22 are in Amazonia (two large-scale commercial companies and the remainder\ncommunity-based). Brazil’s Law on the Management of Public Forests (2006) is designed\nto expand this potential by promoting commercial and community concessions on\n13 million hectares of publicly owned forests in Amazonia. Although general fears have\nbeen expressed about government capacity for monitoring of compliance with SFM\nguidelines, the law does for the first time recognise the use of standing forest as a\n‘productive’ sustainable development activity and hence a source of environmental\nservices which could in due course be sold.\nIn a region as vast as Brazilian Amazonia, the targeting of PES schemes in areas where\nthey are likely to be most effective becomes a critical issue. Although PES schemes might\nbe technically feasible, they may not be an attractive policy option everywhere. There may\nbe little sense in pushing PES either in well preserved areas with relatively little\nanthropogenic pressure (such as Amazonas and Amapa´), or in states where commercial\npressures are so intense that PES cannot compete with logging, ranching and soybean\nfarming (for example, in Mato Grosso or Para´). It is in ‘middling’ areas of competing\ninterests where no single activity dominates in which PES may prove critical in tipping the\nbalance in favour of conservation, providing incentives for more sustainable forms of\ndevelopment as a realistic alternative to large-scale forest conversion. Thus, in order to\nmake PES more efficient, it would probably be necessary to target lands at high risk of\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\n974 A. Hall\nbeing lost rather than adopt an indiscriminate flat payment approach. However, the\nefficiency criterion would have to be weighed up against equality of access to PES.\nResearch on avoided deforestation schemes in Mexican ejidos suggests that risk-targeted\npayments are more efficient environmentally speaking, but flat payments are more\negalitarian (Alix-Garcia et al., 2003). In the Mexican case, it has been estimated that only\n11 per cent of forests in the PES programme are high-risk (Karaousakis, 2007).\nEstablishing sources of revenue to fund PES schemes in Brazil is a major challenge. The\nBank of Amazonia, berated over the years for favouring cattle ranching and big business\nover small producers, has an annual fund of about US$1.7 billion for production which\ncould be harnessed for PES (Arima et al., 2005). Following the practice in Costa Rica,\nroyalties could be charged on the activities of private companies in order to fund\nconservation. Under a new Brazilian government proposal, firms whose activities generate\nmajor environmental impacts would be required to pay 0.5 per cent of their turnover into an\nEnvironmental Compensation Fund (CI, 2006). The ecological VAT discussed above is\nanother source, while the rural land tax could be reformed to reward conservation of forests\nrather than their removal as a sign of ‘productive’ activity (Haddad and Rezende, 2002).\nAs already noted, new federal laws are planned to provide for the establishment of\ngovernment funding channels for PES schemes such as Proambiente.\nThere is little doubt that funding for PES in the Amazon would have to draw on\ninternational sources to complement domestic financing. The inclusion of avoided\ndeforestation under the Kyoto CDM during the second commitment period (2013–2017) is\na clear option open to negotiators. However, the country’s potential for capturing\ninternational payments as a source of funding for sustainable development is limited by the\nfact that there is strong resistance in some quarters to recognising the validity of avoided\ndeforestation as a source of carbon credits. Although environmental organisations and\ncommunity groups in Amazonia are strongly supportive of the idea, Brazil’s Ministry of\nForeign Affairs (Itamaraty) has opposed it on the grounds that national sovereignty and\ncontrol over forest resources might somehow be compromised by undue foreign\ninvolvement. This has always been a delicate issue in the strategically sensitive Amazon\nregion and the spectre of ‘foreign interference’ is periodically raised (Dreifuss, 2000).\nIn response to a suggestion by the UK Secretary of State for the Environment that the\nAmazon rainforest should be ‘privatised’ in order to protect it, the Brazilian government\nresponded unequivocally that the region is ‘not for sale’ (Folha de Sa˜o Paulo, 2006; The\nIndependent, 2006). President Lula himself made a similar declaration at the UN General\nAssembly in September 2007.9 Furthermore, the large European environmental NGOs\nhave also been against the proposal, which has been seen as letting the US and other\nindustrial powers off the hook in terms of reducing consumption of fossil fuels by allowing\nthem to buy ‘rainforest credits’ (Fearnside, 2001). This position has also been shared by\nBrazil’s Ministry of Science and Technology (ESP, 2007a).\nHowever, these entrenched positions are gradually softening. One proposal based on the\nprinciple of ‘compensated reduction’ has been put forward (Santilli et al., 2005). Countries\nchoosing to reduce deforestation levels in relation to an agreed baseline would receive\npost facto compensation in the form of tradable carbon certificates that would generate\nincome for promoting conservation and sustainable development. Two competing ideas\nwere aired at the 12th meeting of the Conference of the Parties to the UN Convention on\n9Claiming success for the federal government in reducing Amazon deforestation rates, he declared that, ‘under no\ncircumstances will Brazil forfeit its sovereignty nor its responsibility for Amazonia’ (ESP, 2007c).\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\nPaying for Environmental Services 975\nClimate Change (COP12) held in Nairobi in November 2006. The Coalition of Rainforest\nNations (a block of over 30 developing countries headed by Papua New Guinea and Costa\nRica) lobbied for the inclusion of avoided deforestation as a criterion for acquiring certified\nemissions offsets within global carbon emissions markets in addition to reforestation and\nafforestation (UNFCCC, 2005b; Heal and Conrad, 2006); Coalition for Rainforest Nations,\n2006; Chomitz et al., 2007). The issue of providing compensation for ‘reduced emissions\nfrom deforestation’ (RED), or maintenance of standing forest, is being considered by\nscientific groups under the aegis of the UNFCCC. Recommendations were considered at\nthe Conference of the Parties (COP-13) held in Bali, Indonesia in December 2007, and the\nissue of RED is currently under consideration by the scientific body of the UNFCCC.\nAt COP-12 in Nairobi, Brazil’s Minister of the Environment proposed the creation of a\nvoluntary international fund supported by the industrialised nations to compensate\ncountries for the ‘effective reduction of emission from deforestation’ rather than avoided\ndeforestation or carbon stock maintenance (UNFCCC, 2006b: p. 3). However, serious\ndoubts have been raised about the viability of a major voluntary fund such as that suggested\nby Brazil compared with market-based alternatives. Avoluntary mechanism would have to\ncompete for scarce official development aid in the forestry sector. Furthermore, donors\nwould be reluctant to finance the scheme in the absence of verifiable measures of progress\ntowards meeting specific targets in reducing deforestation.\n5 CONCLUSION\nPES ventures in Brazilian Amazonia have so far been limited to a handful of carbon\nprojects, the ecological VAT and the incipient Proambiente programme for small farmers.\nIt could also be argued that much of the funding channelled into sustainable development\nprojects since the 1990s actually represents a form of indirect compensation for\nenvironmental services rendered; for example, the small projects (PD\/A) component of the\nPilot Programme to Conserve the Brazilian Rainforest (PPG7) in key activities such as\nagroforestry, support for extractive reserves, sustainable forest management, ecotourism\nand prevention of forest fires (FAO, 1999). Yet this funding is neither contingent upon the\nprovision of quantified and monitored environmental services nor is financial support\nassured beyond the early years. Furthermore, the generation of environmental benefits is\nassumed to be an automatic by-product and there is no accounting system in place.\nPromabiente itself as well as the Amazonas state-level PES scheme could also be accused\nof the same shortcomings.\nInternational cooperation to assist developing countries in preventing deforestation\nthrough carbon trading is now regarded as one essential vehicle for mitigating the impacts\nof global warming (Stern, 2006). While no panacea, it is increasingly seen as one viable\npolicy option if appropriately conceived and implemented. Yet neither should PES be\nviewed through rose-coloured spectacles. Many problems must be overcome if its potential\nis to be realised.\nA major first hurdle will be to establish appropriate funding mechanisms to finance PES\ninitiatives on a sustainable basis. In the early stages, overseas development assistance has\nbeen instrumental in helping to kick-start PES schemes, as witnessed in the cases of Costa\nRica and Mexico, for example, where the World Bank, the Global Environmental Facility\n(GEF) and bilateral donors have played a key role. Conversely, as discussed above, lack of\ngovernment funding has created major problems for Proambiente.\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\n976 A. Hall\nFunding options for PES are on the increase internationally. Specialised funds already\nexist, such as the BioCarbon Fund, set up in 2004 as a private sector trust managed by the\nWorld Bank. The Bank’s US$128million Community Development Carbon Fund (CDCF),\na multi-donor Trust Fund, set up in 2003 to benefit the poorest countries, could be extended.\nThe World Bank’s proposed ‘Global Forest Initiative’ would bring together major\nconservation NGOs and the private sector, which would include a US$300 million Forest\nCarbon Partnership Facility (FCPF) to pilot RED schemes. However, according to some\nobservers, the potential for significantly expanding voluntary transfer payments (along the\nlines envisaged by the Brazilian government) to reduce deforestation is in reality extremely\nlimited. Since foreign aid for the forestry sector has been in decline for over a decade, it is\nsuggested that a project- or sector-based market approach could offer much greater\npossibilities to reduce emissions from deforestation (Karaousakis, 2007).\nYet even assuming that it is possible to generate sufficient ‘willingness to pay’ on the part\nof buyers—by no means a foregone conclusion—this is but the first step towards installing\nan effective PES system (Wunder, 2005, 2006; Karaousakis, 2007). The actual imple-\nmentation of PES schemes faces many operational challenges in terms of setting up an\nappropriate legal framework and institutional structure, establishing a permanent funding\nmechanism and introducing appropriate implementation methodologies. The latter\ninclude, for example: (i) identifying those geographical areas where such payments are\nlikely to have most impact on environmental service provision, (ii) estimating carbon\nemissions from forest conservation activities in diverse situations where the carbon content\nof forests may vary considerably, (iii) documenting or quantifying the value of\nenvironmental services against an agreed baseline to calculate payments, (iv) monitoring\ncompliance with agreed targets and guidelines, (v) deciding how to distribute available\nresources while reconciling equity and programme efficiency in facilitating access to PES\nschemes—should large producers who are normally responsible for most deforestation\nbe allowed to monopolise PES payments? (v) providing the required implementation\ncapacity amongst stakeholders, including agricultural extensionists, community-based\norganisations, state officials and financial institutions, (vi) ensuring compliance and (vii)\nfacilitating cross-sector collaboration amongst government and non-governmental\norganisations to promote an integrated approach in meeting the needs of resource-users.\nAn increasing number of countries seeking to conserve natural resources and support\nlocal livelihoods are experimenting with PES schemes. Although only Costa Rica has a\nnational programme in place, many other nations are supporting individual projects and\narea-based programmes (Mayrand and Paquin, 2004; McShane and Wells, 2004). Brazil\nhas been relatively slow on the uptake so far but RED discussions have widened the global\nresponse to climate change. The government has gradually warmed to the principle of PES\nand is supporting the idea of compensation for forest conservation, albeit through voluntary\ninternational funding rather than via market-based carbon trading. However, before such\narrangements can be implemented, a number of problems would have to be resolved\n(Ebeling, 2008). These include concerns over ‘market flooding’ by a large volume of\ncredits which would depress carbon prices, the causality issue of attributing changes in\ndeforestation levels to government action (versus the impact of macro-economic forces\nsuch as international commodity prices) and the possible non-permanence of emissions\nreductions due to forest conservation as against reductions from fossil-fuel combustion.\nHowever, even if agreement can be reached over these issues in a post-2012 policy\nscenario and if some of the legal, bureaucratic and logistical problems mentioned in the\npreceding paragraphs can be overcome, schemes such as Proambiente and Bolsa Floresta\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\nPaying for Environmental Services 977\nwill become increasingly popular as a form of providing direct conservation incentives to\npoor resource-users. Indeed, in such a large country as Brazil, decentralised, state-level\nPES projects could prove particularly effective if applied in strategic areas under growing\nthreat of deforestation. While it would be a mistake to underestimate the difficulties\ninvolved, paying the people for their contribution to conservation and sustainable\ndevelopment promises to become a significant arm of environmental policy in the Brazilian\nAmazon.\nACKNOWLEDGEMENTS\nThanks to two anonymous reviewers for their valuable comments on a first draft. Special\nthanks are due to Shigeo Shiki, Hurben Correa da Silva and Brent Millikan for their support.\nREFERENCES\nAlix-Garcia J, de Janvry A, Sadoulet E. 2003. Targeting Payments for Environmental Services: The\nRole of Risk. Giannini Foundation of Agricultural Economics: Berkeley, CA.\nAmazonas. 2007. Lei de mudanc¸as clima´ticas, conservac¸a˜o ambiental e desenvolvimento sustenta´vel.\nManaus.\nAraujo Lima C, PiedadeMT, Barbosa F. 1998.Water as a major resource of the Amazon. In Davies de\nFreitas ML (ed.). Amazonia: Heaven of a New World. Editora Campus: Rio de Janeiro.\nArima E, Barreto P, Brito M. 2005. Pecua´ria na Amazoˆnia: Tendeˆncias e Implicac¸o˜es para a\nConservac¸a˜o. Imazon: Bele´m.\nArnt R. 1994. O Destino da Floresta: Reservas Extractivistas e Desenvolvimento Sustenta´vel na\nAmazoˆnia. Relume Dumara´: Rio de Janeiro.\nBayon R, Hawn A, Hamilton K. 2006. Voluntary Carbon Markets. Earthscan: London.\nBetts R. 2008. What impacts would the dieback of Amazonia have on regional and global climate,\ncarbon, water and energy cycles? In the present volume.\nBrazil. 2007. Declarac¸a˜o dos Povos da Floresta. 2o Encontro Nacional dos Povos da Floresta,\nBrasilia, 21 September.\nCapobianco JP, Verrı´ssimo A, Moreira A, Sawyer D, dos Santos I, Pinto LP (eds). 2001.\nBiodivesidade na Amazoˆnia Brasileira. Instituto Socioambiental: Sa˜o Paulo.\nCapoor K, Ambrosi P. 2007. State and Trends of the Carbon Market 2007. World Bank:\nWashington, DC.\nChomitz K, Buys P, De Luca G, Thomas T, Wertz-Kanounnikoff S. 2007. At Loggerheads?\nAgricultural Expansion, Poverty Reduction and Environment in the Tropical Forests. World Bank:\nWashington, DC.\nCI. 2006. Marina Silva destaca importaˆncia do Fundo de Compensac¸o˜es Ambientais. Conservation\nInternational, Press release, 16 March.\nCoalition for Rainforest Nations, 2006 http:\/\/www.rainforestcoalition.org\/eng\/ (accessed on\n16 November).\nCox PM, Betts RA, Collins M, Harris PP, Huntigford C, Jones CD. 2004. Amazonian forest dieback\nunder climate-cycle carbon projections for the 21st century. Theoretical Applied Climatology,\n(April): 78: 137–156.\nDaily GC. 1997. Nature’s Services: Societal Dependence on Natural Ecosystems. Island Press:\nCovelo, California.\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\n978 A. Hall\nDaily G, Ellison K. 2002. The New Economy of Nature. Island Press: Washington, DC.\nDreifuss R. 2000. Strategic Perceptions and Frontier Policies in Brazil. In Hall A (ed.). Amazonia at\nthe Crossroads: the challenge of sustainable development. Institute of Latin American Studies,\nUniversity of London: London; 205–232.\nEbeling J. 2008. The potential of avoided deforestation to protect the Amazon and mitigate climate\nchange. Philosophical Transactions of the Royal Society B, These Issue ‘Climatic change and the\nfate of the Amazon’ 2008. Published online. doi:10.1098\/rstb.2007.0034\nESP. 2007a. RioR15 comec¸a sem grandes autoridades, mas com poleˆmica, Estado de Sa˜oPaulo,\n20 September.\nESP. 2007b. Declarac¸a˜o do presidente e´ contrariado pelos nu´meros, Estado de Sa˜oPaulo,\n26 September.\nESP. 2007c. Na ONU, Lula lanc¸a cu´pula sobre biocombustı´vel e defende etanol, Estado de Sa˜oPaulo,\n26 September.\nEU. 2002. Test case for EU carbon sinks. EU Forest Watch, 66, September.\nFAO. 1999. Brazil. Pilot Programme to Conserve the Brazilian Rainforest (PPG-7): An Evaluation of\nSix Demonstration Projects (PD\/As). FAO: Rome.\nFearnside P. 1989. Forest management in Amazonia: the need for new criteria in evaluating\ndevelopment options. Forest Ecology and Management, 27(1): 61–79.\nFearnside P. 1997. Environmental services as a strategy for sustainable development in rural\nAmazonia. Ecological Economics, 20(1): 53–70.\nFearnside P. 2001. Environmentalists split over Kyoto and Amazonian deforestation. Environmental\nConservation, 28(4): 295–299.\nFearnside P. 2005. Deforestation in Brazilian Amazonia: history, rates and consequences. Con-\nservation Biology 19(June): 680–688.\nFearnside P. 2006a. Environmental services as a basis for the sustainable use of tropical forests in\nBrazilian Amazonia. In Ortega E, Ulgiati S (eds). IV International Biennial Workshop Advances\nin Energy Studies: Energy-Ecology in Latin America. Campinas, Sa˜o Paulo, Brazil, June 16–19,\n2004. University of Campinas (UNICAMP): Campinas, Sa˜o Paulo; 31–36.\nFearnside P. 2006b. Fragile soils and deforestation impacts: the rationale for environmental services\non standing forest as a development paradigm in Amazonia. In D Posey, M Balick (eds.). Human\nImpacts on Amazonia: The Role of Traditional Ecological Knowledge in Conservation and\nDevelopment. Columbia University Press: New York; 158–171.\nFerraro P, Kiss A. 2002. Direct payments to conserve biodiversity. Science, 298: 1718–1719.\nFolha de Sa˜o Paulo. 2006. Proposta contra desmatamento do Brasil e´ volunta´ria. [15] November.\nGreenpeace. 2006a. Eating Up the Amazon, Greenpeace International, April 6.\nGrieg-Gran M. 2000. Financial Incentives for Biodiversity Conservation: The ICMS Ecolo´gico in\nBrazil. International Institute for the Environment and Development: London.\nGrieg-Gran M, Porras I, Wunder S. 2005. How can market mechanisms for forest environmental\nservices help the poor? Preliminary lessons from Latin America. World Development, 33(9):\n1511–1527.\nGross A. 1989. Fight for the Forest: Chico Mendes in His Own Words. Latin America Bureau:\nLondon.\nGTF. 2005. Relac¸a˜o entre cultivo de soja e desmatamento: coomprendendo a dinaˆmica. Grupo de\nTrabalho de Florestas, Fo´rum Brasileiro de Organizac¸o˜es Na˜o Governamentais e Movimentos\nSociais para o Meio Ambiente e o Desenvolvimento, Sa˜o Paulo.\nHaddad P, Rezende F. 2002. Instrumentos Econoˆmicos para o Desenvolvimento Sustenta´vel da\nAmazoˆnia. Ministry of the Environment: Brası´lia.\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\nPaying for Environmental Services 979\nHall A. 1989. Developing Amazonia: Deforestation and Social Conflict in Brazil’s Caraja´s\nProgramme. Manchester University Press: Manchester.\nHall A. 1997a. Sustaining Amazonia: Grassroots Action for Productive Conservation. Manchester\nUniversity Press: Manchester.\nHall A. 1997b. Peopling the environment: a new agenda for research, policy and action in Brazilian\nAmazonia. European Review of Latin American and Caribbean Studies. 62(June): 9–31.\nHall A (ed.). 2005. Global Impact, Local Action: New Environmental Policy in Latin America.\nInstitute for the Study of the Americas, University of London: London.\nHall A. 2006. Extractive Reserves: Building Natural Assets in the Brazilian Amazon, In Boyce J,\nNarain S, Stanton E (eds). Reclaiming Nature: Environmental Justice and Ecological Restoration.\nAnthem: London.\nHeal G, Conrad K. 2006. Editorial: incentives to reduce tropical deforestation. Journal of Forest\nEconomics, 11: 201–203.\nHuntingford C, Fisher R, Mercado L, Booth B, Sitch S, Harris P, Cox P, Jones C, Betts R. 2008. The\nsensitivity of the HadCM3 ‘‘dieback’’ result to climatic forcings. Philosophical Transactions of the\nRoyal Society B, These Issue ‘Climatic change and the fate of the Amazon’ 2008. Published online.\ndoi:10.1098\/rstb.2007.0034\nIBAMA. 2006 www.ibama.gov.br (accessed on 13 April).\nIIED. 2006 http:\/\/www.iied.org\/NR\/agbioliv\/bio_liv_projects\/ecologico.html (accessed on 18 April).\nKaraousakis K. 2007. Incentives to Reduce GHG Emissions from Deforestation: Lessons Learned\nfrom Costa Rica and Mexico. OECD: Paris.\nLandell-Mills N, Porras I. 2002. Silver Bullet or Fool’s Gold? AGlobal Review of Markets for Forest\nEnvironmental Services and Their Impacts on the Poor. International Institute for the Environment\nand Development: London.\nLovejoy T. 2000. Amazon Forest Degradation and Fragmentation: Implications for Biodiversity\nConservation. In Hall A (ed.) Amazonia at the Crossroads: the challenge of sustainable\ndevelopment. Institute of Latin American Studies, University of London: London. 41–57.\nMarengo JA. 2006. On the hydrological cycle of the Amazon basin: a historical review and current\nstate-of-the-art. Revista Brasileira de Metereologia, 21(3): 1–19.\nMarengo JA. 2008. Climate change in the Amazon basin: from interannual variability to climate\nchange. Philosophical Transactions of the Royal Society B, These Issue ‘Climatic change and the\nfate of the Amazon’ 2008. Published online. doi:10.1098\/rstb.2007.0034\nMay P, Veiga Neto P, Denardin V, Loureiro W. 2002. The ecological value-added tax: municipal\nresponses in Parana´ and Minas Gerais, Brazil. In Selling Forest Environmental Services: Market-\nBased Mechanisms for Conservation, Pagiola S, Bishop J, Landell-Mills N (eds). Earthscan:\nLondon.\nMay P, Boyd E, Chang M, Veiga F. 2003. Local sustainable effects of carbon projects in Brazil and\nBolivia: a view form the field. Paper presented at the international conference on Rural\nLivelihoods, Forests and Biodiversity, 19–23 May, Bonn, Germany.\nMayrand K, Paquin M. 2004. Payments for Environmental Services: A Survey and Assessment of\nCurrent Schemes. Unisfera International Centre: Montreal.\nMcShane T, Wells M (eds). 2004. Getting Biodiversity Projects to Work: Towards More Effective\nConservation and Development. Columbia University Press: New York.\nMMA. 2005. Projetos Demostrativos—PDA: Sua influeˆncia na construc¸a˜o do Proambiente. Ministry\nof the Environment: Brası´lia.\nMurdiyarso D, Herawati H, Iskandar H. 2005. Carbon Sequestration and Sustainable Livelihoods: A\nWorkshop Synthesis. CIFOR: Bogor, Indonesia.\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\n980 A. Hall\nNascimento Madureira D. 2006. Incentivo para a preservac¸a˜o amplia impacto regional, Valor\nEconoˆmico, 24 October.\nNepstad D, Moreira A, Alencar A. 1999. Flames in the Rain Forest: Origins, Impacts and Altern-\natives to Amazonian Fire. Pilot Programme to Conserve the Brazilian Rain Forest: Brasilia; 1.\nNobre C. 2008. Gradual climate change or ‘‘Tipping Points’’ in the system? Philosophical\nTransactions of the Royal Society B, These Issue ‘Climatic change and the fate of the Amazon’\n2008. Published online. doi:10.1098\/rstb.2007.0034\nRevkin A. 1990. The Burning Season: The Murder of Chico Mendes and the Fight for the Amazon\nRain Forest. Collins: London.\nSantilli M, Moutinho P, Schwartzman S, Nepstad D, Curran L, Nobre C. 2005. Tropical deforestation\nand the Kyoto Protocol. Climatic Change, 71: 267–276.\nSmith N, Dubois J, Current D, Lutz E, Clement C. 1998. Agroforestry Experiences in the Brazilian\nAmazon: Constraints and Opportunities. Pilot Programme to Conserve the Brazilian Rain Forest\/\nWorld Bank: Brası´lia.\nSoares-Filho BS, Nepstad DC, Curran LM, Coutirho Cerqueira G, Alexandrino Garcia R, Azevedo\nRavos C, Voll E, McDonald A, Lefebure P, Schlesinger P. 2006. Modelling conservation in the\nAmazon Basin. Nature 440: 520–523.\nStern N. 2006. The Economics of Climate Change: The Stern Review. HMTreasury—Cabinet Office:\nLondon.\nThe Economist. 2006. ‘Rewarding rainforest conservation to help global warming’ 27 April.\nThe Independent. 2006. ‘Celso Amorim, Marina Silva and Sergio Rezende: the Amazon is ours. It is\nnot for sale. . .’ 1 November.\nUNDP. 2005. Assessing Environment’s Contribution to Poverty Reduction. United Nations Devel-\nopment Program: New York.\nUNFCCC. 2005a. Sixth compilation and synthesis of initial national communications from Parties\nnot included in Annex I to the Convention, Montreal, 6 December.\nUNFCCC. 2005b. Reducing emissions from deforestation in developing countries: approaches to\nstimulate action. 11th Conference of the Parties, Montreal, 28 November to 9 December.\nUNFCCC. 2006a. National greenhouse gas inventory data for the period 1990–2004 and status of\nreporting (Annex I countries), Nairobi, 19 October.\nUNFCCC. 2006b. Submission from Brazil: Positive Incentives for Voluntary Action in Developing\nCountries to Address Climate Change: Brazilian Perspective on Reducing Emissions from Deforesta-\ntion, 12th Conference of the Parties to the UNFCCC, Nairobi, Kenya, 14 November. http:\/\/unfccc.int\/\nfiles\/meetings\/dialogue\/application\/pdf\/wp_21_braz.pdf (accessed on 16 November).\nUNFCCC\/CDM. 2007. CDM Statistics http:\/\/cdm.unfccc.int\/Statistics\/ (accessed on 20 September).\nWRI. 2005. The Wealth of the Poor: Managing Ecosystems to Fight Poverty. United Nations\nDevelopment Programme, World Bank, World Resources Institute: New York.\nWunder S. 2005. Payments for environmental services: Some nuts and bolts. CIFOR Occasional\nPaper No. 42, Jakarta.\nWunder S. 2006. The efficiency of payments for environmental services in tropical conservation.\nConservation Biology, 21(1): 48–58.\nZbinden S, Lee D. 2004. Payment for environmental services: an analysis of participation in Costa\nRica’s PSA Programme. World Development, 33(2): 255–272.\nCopyright # 2008 John Wiley & Sons, Ltd. J. Int. Dev. 20, 965–981 (2008)\nDOI: 10.1002\/jid\nPaying for Environmental Services 981\n"}