{"doi":"10.1017\/S0031182006000849","coreId":"70959","oai":"oai:eprints.lancs.ac.uk:9116","identifiers":["oai:eprints.lancs.ac.uk:9116","10.1017\/S0031182006000849"],"title":"Apoptosis-like death as a feature of malaria infection in mosquitoes.","authors":["Hurd, H.","Grant, Karen M.","Arambage, S. C."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-03","abstract":"Malaria parasites of the genus Plasmodium make a hazardous journey through their mosquito vectors. The majority die in the process, many as a result of the action of mosquito defence mechanisms. The mosquito too is not unscathed by the encounter with these parasites. Tissue damage occurs as a result of mid-gut invasion and reproductive fitness is lost when many developing ovarian follicles are resorbed. Here we discuss some of the mechanisms that are involved in killing the parasite and in the self-defence mechanisms employed by the mosquito to repair the mid-gut epithelium and to manipulate resources altering the trade-off position that balances reproduction and survival. In all cases, cells die by apoptotic-like mechanisms. In the midgut cells, apoptosis-induction pathways are being elucidated, the molecules involved in apoptosis are being recognised and Drosophila homologues sought. The death of ookinetes in the mosquito mid-gut lumen is associated with caspase-like activity and, although homologues of mammalian caspases are not present in the malaria genome, other cysteine proteases that are potential candidates have been discussed. In the ovary, apoptosis of patches of follicular epithelial cells is followed by resorption of the developing follicle and a subsequent loss of egg production in that follicle","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70959.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/9116\/1\/download.pdf","pdfHashValue":"376fd925faed55f38077be06cd5e7e4de6ebf110","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:9116<\/identifier><datestamp>\n      2018-01-24T03:20:13Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5148:5148333031<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Apoptosis-like death as a feature of malaria infection in mosquitoes.<\/dc:title><dc:creator>\n        Hurd, H.<\/dc:creator><dc:creator>\n        Grant, Karen M.<\/dc:creator><dc:creator>\n        Arambage, S. C.<\/dc:creator><dc:subject>\n        QH301 Biology<\/dc:subject><dc:description>\n        Malaria parasites of the genus Plasmodium make a hazardous journey through their mosquito vectors. The majority die in the process, many as a result of the action of mosquito defence mechanisms. The mosquito too is not unscathed by the encounter with these parasites. Tissue damage occurs as a result of mid-gut invasion and reproductive fitness is lost when many developing ovarian follicles are resorbed. Here we discuss some of the mechanisms that are involved in killing the parasite and in the self-defence mechanisms employed by the mosquito to repair the mid-gut epithelium and to manipulate resources altering the trade-off position that balances reproduction and survival. In all cases, cells die by apoptotic-like mechanisms. In the midgut cells, apoptosis-induction pathways are being elucidated, the molecules involved in apoptosis are being recognised and Drosophila homologues sought. The death of ookinetes in the mosquito mid-gut lumen is associated with caspase-like activity and, although homologues of mammalian caspases are not present in the malaria genome, other cysteine proteases that are potential candidates have been discussed. In the ovary, apoptosis of patches of follicular epithelial cells is followed by resorption of the developing follicle and a subsequent loss of egg production in that follicle.<\/dc:description><dc:date>\n        2006-03<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/9116\/1\/download.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0031182006000849<\/dc:relation><dc:identifier>\n        Hurd, H. and Grant, Karen M. and Arambage, S. C. (2006) Apoptosis-like death as a feature of malaria infection in mosquitoes. Parasitology, 132 (Supple). S33-S47. ISSN 0031-1820<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/9116\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0031182006000849","http:\/\/eprints.lancs.ac.uk\/9116\/"],"year":2006,"topics":["QH301 Biology"],"subject":["Journal Article","PeerReviewed"],"fullText":"Apoptosis-like death as a feature of malaria infection\nin mosquitoes\nH. HURD*, K. M. GRANT and S. C. ARAMBAGE\nCentre for Applied Entomology and Parasitology, Institute for Science and Technology in Medicine, University of Keele,\nStaffordshire, ST5 5BG, UK\nSUMMARY\nMalaria parasites of the genus Plasmodiummake a hazardous journey through their mosquito vectors. The majority die in\nthe process, many as a result of the action of mosquito defence mechanisms. The mosquito too is not unscathed by the\nencounter with these parasites. Tissue damage occurs as a result of mid-gut invasion and reproductive fitness is lost when\nmany developing ovarian follicles are resorbed. Here we discuss some of the mechanisms that are involved in killing the\nparasite and in the self-defence mechanisms employed by the mosquito to repair the mid-gut epithelium and to manipulate\nresources altering the trade-off position that balances reproduction and survival. In all cases, cells die by apoptotic-like\nmechanisms. In the midgut cells, apoptosis-induction pathways are being elucidated, the molecules involved in apoptosis\nare being recognised and Drosophila homologues sought. The death of ookinetes in the mosquito mid-gut lumen is\nassociated with caspase-like activity and, although homologues of mammalian caspases are not present in the malaria\ngenome, other cysteine proteases that are potential candidates have been discussed. In the ovary, apoptosis of patches of\nfollicular epithelial cells is followed by resorption of the developing follicle and a subsequent loss of egg production in that\nfollicle.\nKey words: Apoptosis, Plasmodium, malaria, mosquito cysteine proteases.\nINTRODUCTION\nMosquitoes play an essential role in the transmission\nand spread of malaria. If a female mosquito ingests\nblood containing Plasmodium gametocytes, the male\nand female gametes emerge from their erythrocytes\nwithin minutes of arriving in the mosquito midgut\nlumen and fertilization occurs within the first hour\npost-feeding. The zygote differentiates into a motile\nookinete 8–24 hours later, moves out of the blood\nbolus and migrates across the peritrophic matrix, a\nchitin-containing layer secreted by the midgut epi-\nthelial cells in response to blood feeding. Ookinetes\ninvade the single layer of columnar midgut epithelial\ncells, often travelling laterally through one or more\nadjacent cells, and finally exit on the basal side of\nthe cells, coming to rest between the cell membrane\nand the basal lamina in the basal subepithelial space.\nHere they transform into a non-motile vegetative\nstage, the oocyst. The oocyst grows from about 5\nto 50 mm in diameter whilst the nucleus divides\napproximately once a day to produce 2–8000 nuclei\nin 12–18 days. Following division of the cytoplasm,\nsporozoites develop at the edge of the oocyst and are\neventually released into the haemolymph. A small\nproportion of these invade the lateral lobes of the\nsalivary glands. Eventually a small number of sporo-\nzoites are injected into a new host when the infected\nmosquito takes the next blood meal (Sinden, 2002;\nBaton and Ranford-Cartwright, 2005b).\nAlthough several species of Plasmodium can\nreadily be maintained in laboratory colonies of mos-\nquitoes, several factors mitigate against the success-\nful completion of the mosquito stage of the life\ncycle in the field. Plasmodium has a surprisingly long\ndevelopmental period relative to the life expectation\nof a mosquito in the wild, and many infected\nmosquitoes will die before sporozoites have invaded\nthe salivary glands. Furthermore, the few mosquito\nspecies that can act as vectors of Plasmodium have\nrobust anti-parasite defence mechanisms; although\nthese are more effective in some vector\/parasite\ncombinations than others. Mosquitoes thus exhibit\nvarying degrees of refractoriness and this will\ndetermine prevalence and\/or intensity of infection\nwithin a mosquito population (Ghosh, Edwards\nand Jacobs-Lorena, 2000; Sinden, Alavi and Raine,\n2004). Our understanding of these defence mechan-\nisms is expanding rapidly and has been the subject\nof many reviews including recent ones by Michel\nand Kafatos (2005) and Vlachou and Kafatos (2005).\nThe most significant loss of malaria parasites\noccurs in the first 24 h following an infective blood\nmeal. This also appears to be a critical time for\nthe infected mosquito. During this period, infection\ninflicts considerable fitness costs upon the mosquito\nbecause ookinete invasion of mosquito-midgut cells\n* Corresponding author: Centre for Applied Entomology\nand Parasitology, Institute for Science and Technology in\nMedicine, University of Keele, Staffordshire, ST5 5BG,\nUK. Tel: +44 1782 583034. Fax: +44 1782 583516.\nEmail : h.hurd@keele.ac.uk\nS33\nParasitology (2006), 132, S33–S47. f 2006 Cambridge University Press\ndoi:10.1017\/S0031182006000849 Printed in the United Kingdom\nresults in cell death and expulsion from the epithelial\nlayer. The production of a batch of eggs that is\ntaking place at this time is severely impaired due to\nthe death of cells in the follicular epithelium of many\novarioles. It is clear that the complex molecular\ninteractions between Plasmodium and its vector that\noccur at this time help to establish and maintain the\ninfection and may ensure that the vector remains\nalive for long enough for sporozoites to develop and\nparasite transmission to occur. Evolutionary press-\nures will be operating upon the mosquito resulting\nin selection in favour of survival following infection.\nThey will also be operating on the parasite to maxi-\nmise its fitness without compromising vector sur-\nvival ; at least until transmission is ensured. We have\nproposed that death of parasite and vector cells plays\na key role in this relationship (Hurd and Carter,\n2004). In this review we discuss the mode of death\nof parasite and vector cells, potential triggers that\ninduce this death and the role this death may have\nin the maintenance of the infection.\nMOSQUITO DEFENCE RESPONSES\nAGAINST MALARIA\nA complex anti-parasite response is mounted by\nthe mosquito within 24 h of taking a Plasmodium-\ninfected blood meal. Several defence molecules have\nalready been implicated in this response, including\nantimicrobial peptides, host pattern recognition\nreceptors (PRRs) such as peptidoglycan recognition\nproteins, Gram-negative binding proteins, thioester\ncontaining proteins (TEPs), scavenger receptors\n(SCRs), C-type lectins (CTLs) and molecules in the\nmelanisation cascade (Michel and Kafatos, 2005).\nThe genes encoding some of these molecules exhibit\ntranscriptional activation or up-regulation in re-\nsponse toPlasmodium infection (Richman et al. 1997;\nDimopoulos, 2003; Danielli et al. 2005) and a few\nhave now been implicated in parasite-killing or\nprotection from death, as demonstrated by the\nchange in oocyst numbers when gene expression is\naltered (Blandin and Levashina, 2004; Osta et al.\n2004b ; Abraham et al. 2005).\nAttention has been focused on the death of\nookinetes as they traverse the midgut epithelium and\nexit beneath the basal lamina. Two processes have\nbeen reported to occur, namely, melanisation and\n‘lysis ’ of ookinetes. In a few strains of mosquito,\nspecifically selected to be refractory, ookinetes are\nmelanised as they emerge from epithelial cells and\ncome into contact withmolecules in the haemolymph\n(Collins et al. 1986; Zheng et al. 2003; Hurd et al.\n2006). However, it would appear that, even in\nsusceptible mosquitoes, many parasites disappear\nbefore oocyst formation. This disappearance\nmechanisms has been termed ‘lysis ’, though cell lysis\nis rarely visualized, and is likely to be mediated by\nthe antagonistic action of the leucine rich-repeat\nimmune gene, LRIM1 (Osta et al. 2004a). These\nparasites can be protected from death by a mechan-\nism mediated by 2 members of the C-type lectin\nfamily (Osta et al. 2004a). Ookinetes undergoing\nlysis have been observed in mid-gut cells of a re-\nfractory line of Aedes aegypti (Vernick et al. 1995).\nHowever, this has not been observed in the midgut\nepithelium of anopheline mosquitoes and it is\nnot clear whether disappearance of parasites in\nAnopheles gambiae occurs in the epithelial cells or,\nprior to invasion, in the mid-gut lumen.\nTHE MID-GUT LUMEN IS A HOSTILE\nENVIRONMENT\nIn addition to the response mounted against the\nparasite by the mosquito, toxic components from the\nblood meal surround the developing ookinetes.\nWithin the bolus of the blood meal, zygotes and\nookinetes are directly exposed to white blood cell\nproducts and also serum and plasma factors. All of\nthese reduce gametocyte infectivity (Lensen et al.\n1998). A reactive oxygen–rich environment is cre-\nated, partly as a result of the release of oxidative\nhaem when haemoglobin is digested. The mid-gut\nenvironment may, in this respect, resemble the\nsituation surrounding developing trophozoites in\nthe vertebrate host (Atamna and Ginsburg, 1993).\nThe cytotoxic effect of O2\nx upon Plasmodium berghei\nhas been reported andO2\nx has been implicated in loss\nof gametocyte infectivity (Harada et al. 2001). In\naddition to the generation of O2\nx by haemoactivity\nwithin the mid-gut lumen, L-DOPA-dependent\ngeneration of O2\nx occurs in the mid-gut epithelium\nand it is suggested that parasite invasion may induce\ntransportation of L-DOPA from the haemolymph\ninto mid-gut epithelial cells (Lanz-Mendoza et al.\n2002). The latter authors reported that P. berghei\nookinetes differ in their susceptibility to O2\nx.\nInterestingly, the identification of peroxidase active\norganelles in the trophozoites of P. falciparum\nsuggests the presence of antioxidant defensive\nmechanisms in Plasmodium. However, database\nsearches of the P. falciparum genome failed to\nidentify genes encoding peroxisomal enzymes or the\nclassical peroxisomal import systems (McIntosh,\nElliott and Joiner, 2005). In contrast, cytosolic redox\nsystems that protect against oxidative insults result-\ning from the asexual stage’s metabolism of haemo-\nglobin are well documented and reviewed in Muller\n(2004) and a potential antioxidant, lipoic acid, that\nmay be synthesised by the apicomplast could also be\nutilized as an antioxidant by the parasite (Toler,\n2005).\nNITRIC OXIDE\nOne molecule that has been particularly implicated\nin the killing of Plasmodium is nitric oxide (NO).\nH. Hurd, K. M. Grant and S. C. Arambage S34\nInducible NO is synthesised during the oxidation\nof L-alanine to L-citrulline; catalysed by inducible\nNO-synthase enzymes (iNOS). NO rapidly forms\nreactive nitrogen intermediates (RNIs).\nNO has long been known to be an anti-pathogen\nagent, although its pleiotrophic effects are dependent\nupon its concentration, location and reaction with\nsuperoxide. The complex relationship between NO\nand P. falciparum infections in the vertebrate host\nis still unresolved (Clark, Rockett and Burgner,\n2003). It is likely that the bioavailability of NO in\nthe vasculature of malaria-infected hosts is low, due\nto NO scavenging by haemoglobin and O2\nx, and\nthere is evidence that NO does not have a killing\neffect on rodent-malaria (reviewed in Sobolewski\net al. 2005) although this conclusion is controversial\n(Balmer et al. 2000). It appears that NO-derived\nproducts such as nitrosothiols, rather than NO itself,\nare toxic to the parasite (Rockett et al. 1991).\nThe situation in the insect midgut lumen may,\nhowever, be different compared with that in the\nvertebrate. Several workers have demonstrated\nthat RNIs reduce malaria transmission by affecting\ngametocyte infectivity, and this inactivation has\nbeen associated with the presence of white blood\ncells (Motard et al. 1993; Naotunne et al. 1993).\nFurthermore the killing effect of NO on ookinetes\nhas been demonstrated by trypan blue staining\n(Herrera-Ortiz et al. 2004).\nIn addition to NO generated within the blood\nmeal, the expression of an inducible form of the\nA. stephensi NOS gene (AsNOS) has been shown\nto increase transiently in P. berghei-infected mos-\nquitoes. Dietary provision of the NOS substrate,\nL-arginine, or a NOS inhibitor, L-NAME, reduced\nor increased oocyst numbers in infected mosquitoes,\nrespectively; demonstrating that parasite numbers\nare limited by NO (Luckhart et al. 1998). P. berghei-\ninfected blood meals also induce iNOS in the\nmidguts of A. pseudopunctipennis, as does L-DOPA;\nindicating the participation of H2O2 (Herrera-Ortiz\net al. 2004). P. falciparum has been shown to induce\nexpression of AsNOS as early as 6 h post-infection\n(Crampton and Luckhart, 2001; Lim et al. 2005).\nThere is evidence to support the proposition\nthat one inducer of AsNOS expression is an\nimmunomodulatory cytokine from the host, namely\nmammalian transforming growth factor b1\n(TGFb1). This factor plays a role in regulating\ninducible NOS in vertebrates. TGFb1 is present in\nthe blood in an inactive form and is activated in\nthe midgut lumen, probably by haem or the redox\nproduct of NO, nitroxyl anion. It significantly re-\nduces the number of P. falciparum oocysts develop-\ning on the midgut wall and induces NOS expression\nin an A. stephensi cell line (Luckhart et al. 2003).\nInterestingly, a member of the TGFb super-family,\nAs60A, has been isolated from A. stephensi and is\nexpressed in the midgut, brain, eyes, fat body and\novaries. In the mosquito carcass, induction ofAs60A\nwas detected 1 h after an infected blood meal, earlier\nthan the induction seen at 3 h in the midgut. The\nexpression of both As60A and AsNOS appears to\nbe correlated with the intensity of parasite density,\nwith high densities inducing expression and low\ndensities suppressing it (Crampton and Luckhart,\n2001).\nThere now appears to be a third source of NOS\ninducers: the parasite itself. Luckhart and colleagues\nhave shown that the glycosylphosphatidylinositol\n(PfGPI) anchors of P. falciparum also induce\nAsNOS expression in midgut epithelial cells. Within\nthe gut lumen PfGPIs could be derived from both\nsexual and asexual stages of Plasmodium. Merozoites\nact upon an Anopheles stephensi cell line to induce\nNOS expression in a dose-dependent manner, as do\npurified PfGPIs (Lim et al. 2005). This is in line\nwith other studies showing that vertebrate-host\nproinflammatory cytokines and NO can be induced\nby parasite GPIs, and may be major factors that\ncontribute to malaria pathogenesis (Tachado et al.\n1996; Zhu, Krishnegowda and Gowda, 2005).\nPARASITE DEATH\nOxygen radicals, nitric oxide and reactive nitrogen\nintermediates (RNIs) are known inducers of pro-\ngrammed cell death or apoptosis (Murphy, 1999;\nBai et al. 2001) as discussed in Hurd and Carter\n(2004). There is evidence that H2O2 causes the\ndeath of P. berghei ookinetes (Herrera-Ortiz et al.\n2004) but it is unclear whether this death equates\nto the apoptotic-like death observed in ookinetes\nin vivo and in vitro (Al-Olayan, Williams and Hurd,\n2002). However, what is certain is that very few of\nthe thousands of mosquito stages that begin their\ndevelopment in this hostile environment survive\nto become oocysts (Vaughan, Hensley and Beier,\n1994a ; Vaughan, Noden and Beier, 1994b ; Alavi\net al. 2003). Data for the reduction in numbers of\nP. falciparum, P. yoelii and P. vivax as they pass\nthrough different stages in development has been\ntabulated in Ghosh et al. (2000). These figures reflect\nlarge differences in the successful survival of the\nparasite in different malaria\/mosquito species com-\nbinations, with losses ranging from 40- to 1223-fold\nat the gametocyte to ookinete stage and 69- to 660-\nfold from ookinetes to oocysts. This latter loss is\nusually detected by counting ookinetes in the midgut\nlumen of a cohort of mosquitoes and then examining\nthe midguts of a further group of mosquitoes for\nthe presence of oocysts several days later. Although\nit has been assumed that this loss occurs during\nthe transit of the midgut epithelial layer (Whitten,\nShiao and Levashina, 2006), there is evidence that a\nlarge proportion of ookinetes die whilst still in the\nmidgut lumen, and that this death rate increases\nthe longer they are exposed to the increasingly toxic\nMalaria, mosquitoes and apoptosis S35\nenvironment (Al-Olayan et al. 2002). It is feasible\nthat NO and\/or RNIs and O2\nx are the triggers that\ninduce ookinete death. We propose that parasites die\nin the midgut lumen by a process of apoptosis and\nthat this may be equivalent to the ‘ lysis ’ discussed\nby many authors.\nINDICATORS OF APOPTOSIS-LIKE CELL\nDEATH IN PLASMODIUM\nApoptosis inPlasmodium spp. was first demonstrated\nwhen one marker of apoptosis, nuclear chromatin\nfragmentation, was detected in the erythrocytic\nstages of chloroquine-sensitive P. falciparum which\nhad been exposed to the drug in vitro (Picot et al.\n1997). More recent work has reported that\napoptosis can be detected in both stressed cultures\nand untreated healthy cultures of erythrocytic stages\n(Deponte and Becker, 2004). However, there was\nsignificant increase in the in situ terminal-deoxy-\nnucleotidyl-transferase-mediated dUTP-biotin nick\nend labeling (TUNEL)-positive apoptotic schizonts\ntreated with anti-malarials and H2O2, compared to\nthe control (Deponte and Becker, 2004). Results of\nfurther experiments, conducted by these authors, to\ndemonstrate externalization of phosphatidylserine\nfrom the inner to the outer leaflet of the parasite\nplasma membrane were confounded by the two\nadditional membranes, the parasitophorous vacuole\nmembrane and the erythrocyte membrane, that\nsurround the parasite plasma membrane. Contami-\nnation of the parasite preparation with erythrocyte\nghosts may have led to false-positive staining with\nannexin V.\nMultiple features of apoptosis, such as chromatin\ncondensation, detected with acridine orange label-\ning; DNA fragmentation, as detected by TUNEL\nlabeling; phosphatidylserine translocated to the\nexternal leaflet of the plasma membrane, as detected\nby annexin labeling; and activation of a caspase-\nlike enzyme activity (Fig. 1) have been observed in\nP. berghei ookinetes. Apoptosis occurs both in vivo,\nin the mosquito gut lumen, and in vitro (Al-Olayan\net al. 2002). Apoptosis in P. berghei was inhibited\nby the general caspase inhibitors, z-VAD.fmk and\nBoc-ASP, and the caspase 3-specific inhibitor,\nz-DEVD.fmk, thus confirming the involvement\nof caspase-like activity in cell death in Plasmodium.\nIn vitro, the presence of ookinetes exhibiting con-\ndensed chromatin was reduced from 80% to less\nthan 10% by incubation with the caspase inhibitor\nz-DEVD.fmk and, in vivo, addition of z-VAD.fmk to\nthe blood meal resulted in a reduction in the number\nof ookinetes exhibiting condensed chromatin from\napproximately 70% to 20%. Moreover, inclusion of\na caspase inhibitor in the blood meal resulted in\ndouble the number of oocysts developing on the\nmidgut wall in vivo, suggesting that apoptosis plays\na major role in the mechanism that governs parasite\nnumbers in the mosquito midgut lumen (Al-Olayan\net al. 2002). The involvement of caspase-like activity\nmust, however, be interpreted with caution, as\nDeponte and Becker (2004) pointed out, since\nnothing is known about uptake and stability of\ncaspase inhibitors in P. falciparum.\nCASPASE-LIKE ACTIVITY\nIn P. berghei, two different methods employing\ncaspase-specific inhibitors have been used to detect\na caspase-like enzyme in ookinetes: (1) whole cells\nwere labeled with a fluorescently labeled caspase\ninhibitor (CaspaTag, a carboxyfluorescein-labeled\nfluoromethyl ketone peptide inhibitor, FAM-VAD-\nfmk) (Fig. 1). This labeling correlates well with\nanother marker for apoptosis, chromatin conden-\nsation (as visualized by acridine orange staining)\n(Fig. 1). (2) Ookinete cell extracts were incubated\nwith a biotinylated caspase inhibitor (biotin-VAD.\nfmk) and the proteins which bound the inhibitor\nwere subsequently visualized on a Western blot\n(Al-Olayan et al. 2002).\nTherefore, P. berghei appears to possess a caspase-\nlike activity that correlates with other markers of\napoptosis. However, interrogation of the genome\ndatabases of P. berghei and the closely related\nP. falciparum, reveals that Plasmodium does\nnot appear to possess a classical caspase enzyme.\nFig. 1. Plasmodium berghei ookinetes exhibiting features\nof apoptosis-like cell death. A: ookinete viewed under\nphase contrast, B: the same ookinete viewed under\nconditions that show staining with acridine orange and\ncontaining a nucleus with condensed chromatin (thin\narrow). C: ookinete viewed under phase contrast, D: the\nsame ookinete viewed under conditions that show\ncaspase-like activity in the cytoplasm after labelling with\nCaspaTagTM (Intergen Company) (green). The nucleus is\nstained with Hoechst stain (thick arrow).\nH. Hurd, K. M. Grant and S. C. Arambage S36\nThis calls into the question the true intracellular\ntarget of the ‘caspase-specific’ inhibitors.\nCaspases are cysteine proteases belonging to the\nclan CD (Barrett and Rawlings, 2001). They possess\na conserved caspase fold and a catalytic dyad, His\nand Cys, which are indispensable for proteolytic\nactivity. One of the main limitations of working\nwith caspase inhibitors is that their specificity is\nnot as tight as once believed. These inhibitors do\ndemonstrate remarkable specificity in vitro but this\nspecificity is not maintained in cell-based assays\n(Rozman-Pungercar et al. 2003). This may be due\nto the irreversible nature of the inhibitor: non-\noptimal inhibitors may still bind weakly to the active\nsite and, once bound, they will become covalently\nlinked to the enzyme. The longer the incubation\nperiod, the greater chance there is that an inhibitor\nwill become irreversibly attached to a non-optimal\nprotease target. Moreover, many of these peptide-\nbased inhibitors are not cell permeable and, to\novercome this problem, ester-derivatives (where\nthe aspartic acid of, for example, z-VAD, has been\nesterified) are commonly used in cell-based assays.\nOnce in the cell, esterases are thought to remove the\nester group, releasing the active inhibitor. However,\nthe ester-derivatives lack the specificity of the free\nacid peptide inhibitors, thus confounding the\nsituation further.\nThe peptide-based inhibitors act by mimicking\nthe substrate and binding into the catalytic site\n(Fig. 2). Caspases have an absolute requirement for\na single amino acid residue at P1 and exclusively\nhydrolyse the peptide bond following an aspartic acid\nresidue; the residue at the P4 position is also a\ncritical determinant of specificity (Thornberry,\n1997; Thornberry et al. 1997). However, many of\nthe inhibitors designed to fulfill these criteria, for\nexample z-VAD and z-DEVD, also fulfill the\nspecificity determinants for cysteine proteases of\na different clan, CA. Clan CA, which includes the\nlysosomal cathepsins and the calcium-dependent\ncalpains, prefer a hydrophobic or large residue at\nP2 but have no preference for the P1 residue\n(Mottram et al. 2003). Hence, the alanine in z-VAD\nand the valine in z-DEVD, comply with clan CA\nrequirements and these inhibitors have indeed\nbeen shown to inhibit cathepsin B, another clan CA\nprotease (Rozman-Pungercar et al. 2003).\nMetacaspase\nSo, if Plasmodium lacks true caspases, what other\nproteases could represent the target for the caspase\ninhibitors? One possible alternative is the recently\ndiscovered metacaspase proteins, another clan CD\nprotease, which are distantly related to caspases.\nMetacaspases represent one of two families of\nancient caspase-like proteins (paracaspases and\nmetacaspases) which have been identified recently in\nmetazoans (including humans), fungi and Protozoa\n(Uren et al. 2000). Based on evaluation of the\nP. falciparum genome sequence, this parasite appears\nto possess two metacaspases, although neither have\nbeen characterized or shown to be enzymatically\nactive (Rosenthal, 2004). P. berghei has also been\nshown to possess two metacaspases genes to date\n(GenBank, accession numbers AJ555625 and\nAJ555626). Alignment of the Plasmodium meta-\ncaspases with caspases reveals that they retain the\ntypical caspase fold and the catalytic dyad (His, Cys)\nrequired for catalytic activity but there is consider-\nable sequence diversity in the vicinity of the active\nsite cleft, whichmay indicate a difference in substrate\nspecificity (Wu et al. 2003). Moreover, aspartic acid-\ndirected processing sites in metacaspases cannot\nbe predicted from homology with the caspases,\nimplying that they are not processed in a similar\nmanner (Mottram et al. 2003).\nPhylogenetic analysis suggests that the meta-\ncaspases belong to a distinct clade which may rep-\nresent the evolutionary progenitor of mammalian\ncaspases (Mottram et al. 2003). In support of this\ntheory is the fact that the yeast metacaspase has been\nshown to regulate programmed cell death in this\nunicellular organism (Madeo et al. 2002; Mazzoni\net al. 2005). Induction of apoptosis is accompanied\nby an increase in a protease activity which cleaves\ncaspase-specific substrates. Apoptosis is abrogated\nin metacaspase null mutants and is exacerbated in\nyeast which over-express the metacaspase. The yeast\nmetacaspase can also be inhibited by z-VAD (Madeo\net al. 2002).\nz-NH-CH-CO-NH-CH-CO-NH-CH-CO-NH-CH-COO-fmk \nCH2 CH2 CH2\nCH2COO2\nCOO2\nCOO2\nCH\nCH3 CH3\nP2 \nPeptidase Active Site\nCleavage\nsite\n \nS2 S1 \nS1’\nS2’\n(A) \n(B)\nP1 \nP1’\nP2’\nP2 P1 P2’ \nP1’\n \nFig. 2. Diagrammatic representation of the active site of\na protease enzyme. (A) P1, P2, P1k and P2k refer to amino\nacid residues in the protein\/peptide substrate relative to\nthe cleavage site. S1, S2, S1k and S2k refer to the sub-sites\nwithin the active site of the enzyme. These bind amino\nacid residues in the protein or peptide substrate with\ndifferent affinities and thus confer the specificity\nof the proteolysis. (B) protease inhibitors, such as\nz-DEVD-fmk, bind irreversibly into the active site\nand prevent binding of the substrate.\nMalaria, mosquitoes and apoptosis S37\nCalpain\nAnother possible target for caspase inhibitors in\nPlasmodium is the calpains, cytosolic calcium-\ndependent cysteine proteases. Calpains are clan CA\ncysteine proteases but can be inhibited by caspase\ninhibitors such as z-VAD (Waterhouse et al. 1998).\nCalpains have been implicated in apoptosis in\nmammalian cells (Squier and Cohen, 1997) and are\nthought to be involved in both caspase-dependent\n(Nakagawa and Yuan, 2000; Blomgren et al. 2001)\nand caspase-independent pathways (Wolf et al.\n1999).Moreover, calpain inhibitors have been shown\nto inhibit apoptosis in neuronal cells (Squier et al.\n1994; Blomgren et al. 2001). Calpains may act in\nmultiple ways: cleaving and activating effector\ncaspases, cleaving caspase targets to potentiate their\neffects and disturbing calcium homeostasis and\nhence trigger apoptosis (Nakagawa and Yuan, 2000;\nBlomgren et al. 2001).\nDatabase mining of the P. falciparum genome\nsequence has identified two putative calpain homol-\nogues in this parasite (Wu et al. 2003). They possess\na catalytic domain with three active sites, which\ntogether constitute the catalytic cleft, but lack a\ncalcium-binding domain, suggesting that the\nmalarial calpains are calcium independent (Wu et al.\n2003).\nCathepsins\nFinally, the caspase inhibitors could be targeting\nlysosomal cysteine proteases, cathepsin L-like\nenzymes, of which Plasmodium has many, including\nthe falcipains (or berghipains in P. berghei) and\nthe SERAs (Wu et al. 2003; Rosenthal, 2004). In\nmammalian cells, lysosomal proteases have been\nimplicated in apoptosis : some are thought to act\nindirectly by activating caspases (Turk et al. 2002) ;\nsome are thought to act directly on apoptosis sub-\nstrates (Stoka et al. 2001; Turk et al. 2002) and others\nhave proposed that lysosomal proteases elicit pro-\ngrammed cell death through an alternative pathway,\nautophagy (Bursch, 2001).\nThe most characterized cathepsin L-like enzymes\nin Plasmodium are the falcipains. P. falciparum has\nfour falcipain orthologues, falcipain 1, 2, 2k and 3\n(Rosenthal, 2004). Falcipain 2 and 3 are involved\nin haemoglobin hydrolysis in the erythrocytic\nstages of the parasite (Rosenthal, 1995; Gamboa de\nDominguez and Rosenthal, 1996; Rosenthal et al.\n1996), but this does not preclude them having a dis-\ntinct role in the insect stages. Falcipain 1 is thought\nto play a role in oocyst development (Eksi et al.\n2004). Falcipain 1 null mutant parasites were viable\nand normal in the erythrocytic stages, gametocytes\nand gametes but produced 70–90% less oocysts\nwhen fed to mosquitoes. However, it is not clear\nwhen falcipain 1 acts during oocyst development: its\ntranscription escalates dramatically in gametocytes\nand gametes but falcipain 1 knockout mutants are\nmorphologically normal at these stages (Eksi et al.\n2004), raising the possibility that falcipain 1 acts\nduring the intervening stage, the ookinete. Genes\nencoding falcipain homologues in other plasmodial\nspecies, including P. berghei, have been identified\n(Rosenthal et al. 2002). P. berghei has one falcipain\n1 homologue and one falcipain 2\/3 homologue.\nThe falcipains are expressed to different extents in\ndifferent life cycle stages of the malaria parasite\n(Le Roch et al. 2003) but no data exists for their\nexpression in the ookinete or oocyst stages.\nAnother group of abundant cathepsin L-like\ncysteine proteases in Plasmodium, are the serine-\nrepeat antigen or SERA proteins (Rosenthal, 2004).\nThere are nine SERA protease genes, eight of which\nare located in an array on chromosome 2 and another\nsingle gene on chromosome 9 of P. falciparum. The\nSERA genes are expressed throughout the parasite’s\nlife cycle: in rings (SERA1), trophozoites (SERA2,\n3 and 9), schizonts (SERA2-9), merozoites (apart\nfrom SERA8), gametocytes (SERA1, 2, 4, 6, 7 and 9)\nand sporozoites (apart from SERA3 and 5) (Miller\net al. 2002; Bozdech et al. 2003; LeRoch et al. 2003).\nNo data exists for the expression of SERA genes in\nookinetes. In erythrocytic stages, despite all 9 genes\nbeing expressed, only SERAs4-7 could be detected\nat the protein level (Miller et al. 2002). SERA5 is the\nmost abundant and has been implicated in parasite\negress and\/or erythrocyte invasion (Pang, Mitamura\nand Horii, 1999).\nAll SERA proteins contain a central domain with\nstrong homology to papain-family cysteine proteases\nbut several SERAs, including the abundant SERA5,\nhave a serine residue in place of the active site\ncysteine (Kiefer et al. 1996; Gor et al. 1998; Hodder\net al. 2003) which will undoubtedly influence the\nsubstrate specificity and inhibitor sensitivity. For\nexample, SERA5 possesses a chymotrypsin-like pro-\ntease activity, with a P1 specificity for an aromatic\namino acid, which can be inhibited by a serine\nprotease inhibitor (Hodder et al. 2003). Thus it is\nextremely unlikely that SERA5, and perhaps the\nother SERAs with active site serines, would be\ninhibited by the caspase inhibitors.\nMore detailed inhibitor studies are required, using\ninhibitors which can differentiate between the dif-\nferent potential candidates, to be able to ascertain\nwhich of these potential proteases could be the\ncaspase-like enzyme in apoptotic ookinetes. The\nclassical clan CA protease inhibitor, L-trans epoxy-\nsuccinyl-leucylamido-(4-guanidino)-butane or E64,\nwill only inhibit the lysosomal cysteine proteases,\nalthough recent studies suggest that falcipain 1 may\nbe insensitive to this inhibitor (Goh, Goh and Sim,\n2005). Alternatively, tripeptide aldehyde inhibitors,\nsuch as antipain, could be used to inhibit the lyso-\nsomal cysteine proteases. Calpain inhibitors, such\nH. Hurd, K. M. Grant and S. C. Arambage S38\nas Z-LLY-FMK, also exist, and may be useful in\neliminating these candidates.\nGenome mining of the completed P. falciparum\ndatabase unearths very few genes encoding for\nproteins involved in apoptosis. Not only are caspases\nmissing but their downstream substrates, such as\nBcl proteins, are also absent. Thus it appears that,\nalthough Plasmodium undergoes a form of cell death\nwhich resembles apoptosis, where the end results\nare conserved (chromatin condensation, DNA\nfragmentation etc.), the pathways are not the same\nas mammalian cells. Since Plasmodium possesses a\nmetacaspase, which is thought to be the ancestral\nprogenitor of the mammalian caspases (Wu et al.\n2003), it suggests that higher eukaryotes have\nevolved and elaborated the caspase pathways in a\nvery different manner from protozoa.\nTiming of events\nMarkers of apoptosis are good indicators to study\nthe onset of cell death and the sequence of events\nin the apoptotic pathway. Al-Olayan et al. (2002)\nstudied the increase in the number of dying ookinetes\nin a population by detecting nuclear chromatin\ncondensation. According to their results, apoptotic\nookinetes were first observed at 12 h post-culture\nof gametocytaemic blood, and the proportion\nundergoing apoptosis increased up to 31% and 80%\nat 24 h and 36 h respectively. We studied the se-\nquence of occurrence of two apoptotic markers,\nnuclear condensation and activation of caspase-like\nmolecules, between 18 h to 26 h post-culture. A\nsignificant and increasing proportion of ookinetes\nbecome labelled with CaspaTag (FAM-VAD.fmk)\nfrom 18–26 h post culture of gametocytaemic blood\nonwards and this labelling correlates well with\nanother marker for apoptosis, acridine orange\nlabelling. Dead cells were detected by propidium\niodide staining, identifying cells with compromised\nmembranes, and were detected from 20 h onwards.\nThe proportion of dead cells increased slowly with\ntime but was significantly lower than ookinetes\ndemonstrating markers of apoptosis (unpublished\nobservations).\nTemporal profiles of apoptosis-like cell death have\nyet to be performed in vivo. The observations made\nin vitro may not be comparable with the situation\nin vivo, where live ookinetes rapidly escape from\ntheir toxic environment as they invade the midgut,\nwith the total numbers of ookinetes per midgut\nfalling rapidly from 18–24 h post-feeding (Al-Olayan\net al. 2002). At 18 h, a much higher proportion\nof ookinetes exhibit signs of apoptosis-like death\nin vivo than in vitro, suggesting that the triggers\nwhich induce apoptosis are more potent in the\nmosquito than in our culture conditions. By 24 h,\nhowever, the proportion of dying ookinetes in culture\nhas reached similar levels to those in the midgut\nlumen. This equalization of the proportion of dying\ncells may simply reflect the escape from the gut\nlumen of healthy parasites in vivo. We do not know\nhow rapidly apoptosis-like cell death progresses in\nP. berghei. Ookinetes labelled with fluorochrome\nindicators of apoptosis appear normal when viewed\nunder white light, their membrane permeability\nmay be unaffected for several hours and they may\neven be capable of the gliding motility necessary for\nmovement out of the blood bolus and cell invasion.\nOOKINETE-INDUCED APOPTOSIS IN THE\nMID-GUT EPITHELIUM\nDuring their passage out of the hostile environment\nof the mid-gut, ookinetes must traverse the mono-\nlayer of midgut epithelial cells. The route of their\npassage has been controversial. Observations of\nvarious malaria parasite\/host combinations have\ngenerated hypotheses suggesting exclusively intra-\ncellular, exclusively intercellular or both routes.\nThis debate has been reviewed recently (Baton and\nRanford-Cartwright, 2004, 2005a) and will not be\ndiscussed in detail here, other than to observe that\nthere now appears to be a consensus supporting\nthe view that ookinetes do invade the epithelial cells\nrather than pass between them (Han et al. 2000;\nZieler andDvorak, 2000; Vlachou et al. 2004) though\nLevashina and co-workers (Whitten et al. 2006)\nreport a much higher proportion of P. berghei\nookinetes in extracellular spaces than intercellular.\nWhat is also now clear is that, in several malaria\nparasite\/vector permutations, transit through the\ncells causes damage. Invaded midgut epithelial cells\nrapidly exhibit morphological changes including loss\nof microvilli, nuclear pyknosis, surface blebbing\nand decrease in refractive index (reviewed in Hurd\nand Carter (2004) and Hurd, Carter and Nacer\n(2005). Invaded cells are extruded from the epithelial\nlayer into the gut lumen.\nThe time-bomb theory\nOokinetes rapidly move laterally away from the\ntoxic environment of the dying cell, often invading\nseveral cells before moving out of the epithelium\nand into the basal subepithelial space. This lateral\ninvasion has been observed by video microscopy\nin vivo in P. gallinaceum-infected A. aegypti (Zieler\nand Dvorak, 2000) and by time confocal microscopy\nof P. berghei infection in both A. stephensi and A.\ngambiae (Vlachou et al. 2004). Han and co-workers\ncoined the phrase ‘time-bomb theory’ to describe\ntheir hypothesis that the invading ookinetes trigger\nepithelial cell destruction (detonate a bomb) from\nwhich they must rapidly escape if they are to survive\n(Han et al. 2000; Han and Barillas-Mury, 2002;\nBaton and Ranford-Cartwright, 2004). They ob-\nserved that 95% of the invading parasites escape\nMalaria, mosquitoes and apoptosis S39\nunharmed from the dying cells and suggested that\nthe majority of parasite losses occur before the\nookinete invades the epithelium or after the oocyst\nis formed. Invasion of additional cells may be\ndependent upon the speed at which invaded cells\nare extruded and Baton and Ranford-Cartwright\n(2005a) have proposed that rapid extrusion of in-\nvaded cells results in a cellular treadmill whereby\nookinetes move from one cell to an adjacent one as\nthe first cell is pushed out of the epithelial layer.\nVlachou et al. (2004) observed the cells sur-\nrounding the invaded cell undergoing extensive\nlamellipodia crawling to fill in the gap in the epi-\nthelial barrier caused by loss of the damaged cell.\nInvaded cells produced a ‘hood’ of lamellipodia\nthat surrounds the ookinete as it exits the epithelial\ncell. These observations supplement the proposal\nof Han et al. that expulsion of invaded cells from\nthe epithelial layer may be aided by a purse-string\ncontraction of a basal actin ring in the damaged cell,\nalthough the method of cell extrusion may vary\nbetween different mosquito species (Gupta et al.\n2005).\nIn addition to the GPI-anchored surface protein\nP28, ookinetes secrete a subtilisin-like serine pro-\ntease, PbSub2, into the cytoplasm of invaded cells\nand this forms protein aggregates, often associated\nwith the actin cytoskeleton (Han et al. 2000; Han and\nBarillas-Mury, 2002). The putative involvement of\nthese parasite molecules in triggering up-regulation\nof midgut NOS and\/or midgut cell apoptosis has\nyet to be investigated.\nApoptosis of mid-gut cells\nMid-gut epithelial cells that have been invaded by\nookinetes are undergoing apoptosis as they protrude\ninto the mid-gut lumen and are budded off. DNA\nfragmentation has been detected by TUNEL (Han\net al. 2000). The apoptotic death of invaded cells was\nalso revealed using Yo-PRO-1 staining as the dye\npasses selectively through the plasma membranes of\napoptotic cells. In contrast, propidium iodide was\nexcluded, ruling out necrotic cell death (Vlachou\net al. 2004). Furthermore, caspase-like activity was\ndetected in the invadedmidgut cells ofP. gallinaceum\ninfected Ae. aegypti by preloading cells with the\ncell-permeable protease substrate PhilPhilLux-G1D2\nprior to invasion (Zieler and Dvorak, 2000).\nBiochemical events occurring in P. berghei-\ninvaded mid-gut cells have been investigated by\nthe group of Barillas-Mury (Han et al. 2000). Using\nimmunofluorescence staining with antibodies raised\nagainst the ookinete surface molecule, P28, and a\nuniversal anti-NOS rabbit polyclonal, they were\nable to co-localise the parasite with NOS express-\ning mid-gut cells. They also demonstrated the\nA. gambiae transcription factor AgSTAT was\nexpressed very weakly in the cytoplasm and not at\nall in the nuclei of invaded cells. Epithelial cells\nprotruding into the mid-gut lumen had lower levels\nof AgSTAT and their nuclei were TUNEL positive.\nThis group propose that cell invasion causes physical\ndamage and molecular changes that ultimately lead\nto death by apoptosis (Han et al. 2000).\nBiochemical reactions that may initiate apoptosis\nAs discussed above, several authors have reported\nthat, following Plasmodium infection, a generalized\nup-regulation of the NOS gene occurs in the gut that\nmay be induced by a combination of mammalian,\nparasite and mosquito factors. Our understanding\nof the regulation of the mosquito inducible NOS\nand the damage that nitrosative stress may cause to\nvector tissues is still rudimentary. Interestingly, the\nrecently identified mosquito peroxiredoxin enzyme,\nA. stephensi 2-Cys peroxiredoxin (AsPrx-47830) has\nbeen shown to protect against stresses induced by\nNO, nitroxyl, peroxynitrite and hydrogen peroxide\n(Peterson and Luckhart, 2006). Peroxinitrite, for\ninstance, is involved in reactions that cause DNA\ndamage and nitration of proteins (see discussion in\nPeterson and Luckhart, 2006). Feeding on an un-\ninfected blood meal was shown to induce an increase\nin AsPrx-47830 midgut expression from 2–20 h post\nblood meal with a higher level of induction being\nobserved in P. berghei infected-mosquito midguts\nfrom 12.5–48 h post blood meal (Peterson and\nLuckhart, 2006). It would thus appear that there\nmay be measures in place to protect midgut cells\nfrom the potential cytotoxic effect of levels of nitric\noxide generated as a result of the presence of an\ninfected bloodmeal.\nIn addition to a general up-regulation of midgut\nNOS, levels of NOS expression that are detectable\nby immunostaining have been shown to specifically\nco-localise with invaded cells. This expression\nhas been associated with the subsequent death by\napoptosis of cells (Kumar et al. 2004). This apoptosis\nis thought to be initiated by nitric oxide, whose\nproduction is catalyzed by NOS activity in cells\ninvaded by P. falciparum or P. berghei (Han et al.\n2000; Luckhart et al. 1998). As discussed earlier,\nNO is one of the prime inducers of apoptosis and\nNO induced intracellular mechanisms result in the\nactivation of caspases (Murphy, 1999).\nAlthough titres of NO that are generated specifi-\ncally in invaded cells could, in themselves, initiate\nthe death of the cell, Kumar and colleagues (Kumar\net al. 2004; Kumar and Barillas-Mury, 2005) pro-\npose that protein nitration may be involved in\ninitiating apoptosis. They suggest that reactive\nnitrogen intermediates are produced that lead to\nprotein nitration in some of the invaded cells, as\ndetected by immunofluorescent staining of nitro-\ntyrosine. Two different tyrosine nitration pathways\nhave been proposed (Kumar et al. 2004; Kumar and\nH. Hurd, K. M. Grant and S. C. Arambage S40\nBarillas-Mury, 2005). In the classic pathway, NO\nreacts with superoxide ion to form peroxynitrite\nwhilst the alternative pathway involves the initial\nconversion of NO to nitrite followed by its oxidation\nby peroxidases, in the presence of hydrogen per-\noxide, to nitrogen dioxide and eventual generation\nof peroxynitrite (Fig. 3). Inducible peroxidases\nwere identified in P. berghei-infected A. stephensi\nthat were gluteraldehyde, but not paraformaldehyde,\nresistant (Kumar et al. 2004) and high peroxidase\nactivity was located in cells in advanced stages of\napoptosis. Additionally, out of sixteen peroxidase\ngenes, six were found to be differentially expressed in\nthe midguts of P. berghei-infected A. gambiae, five\nwere induced and the expression of the other one was\nreduced. Tyrosine nitration may inactivate proteins,\nparticularly those with a tyrosine residue at the\ncatalytic site (Alvarez and Radi, 2003), but a direct\nlink between protein nitration and apoptosis in\nmosquito midgut epithelial cells has not been\ndemonstrated. Although the work of Kumar and\ncolleagues (Kumar et al. 2004) showed that per-\noxidase expression is associated with apoptosis\nin midgut cells, it did not demonstrate that protein\nnitration initiated cell death. Indeed, as nitration\nwas only detected in cells in an advanced stage of\napoptosis, it is unlikely to be a direct inducer\nof apoptosis. In addition, there is, as yet, no complete\npicture of the induction pathway for apoptosis.\nNeither all the intermediates in the classical nor\nthe alternative pathways proposed by Kumar and\nco-workers were demonstrated to be up-regulated\nspecifically in invaded cells.\nCurrently, we have no understanding of the bio-\nchemical pathways involved in controlling apoptosis\nin the infected-mosquito midgut. Anacaspase-7 is\none of three apoptosis-related molecules that has\nbeen identified in cDNA libraries enriched for\nsequences expressed immediately after midgut in-\nvasion (Abraham et al. 2004). It shares 40% identity\nand 60% homology with the Drosophila caspase\nDECAY. Antibodies raised against Anacaspase-7\nwere used to recognise a putative proteolytic product\nthat was only present in gut cells after invasion by\nlarge numbers of ookinetes, suggesting a dose-related\nactivation of a caspase-related molecule (Abraham\net al. 2004). Putative anti-apoptotic genes were\nexpressed when oocysts were present (Srinivasan\net al. 2004). Additionally, microarray analyses of\nthe mosquito transcriptome at varying hours post\ninfection have also detected upregulation of genes\ninvolved in apoptosis (Hall et al. 2005; Xu et al.\n2005).\nINFECTION-INDUCED APOPTOSIS IN\nMOSQUITO OVARIES\nPlasmodium infection also results in apoptosis of cells\nin another epithelial layer, the follicular epithelium.\nThese cells surround developing oocytes in the\nterminal follicle of each ovariole. Ingestion of a\nblood meal immediately initiates a gonotrophic cycle\nin anopheline mosquitoes. Yolk protein, or vitello-\ngenin, is synthesised in the fat body and transported\nto the ovaries, where it is taken into developing\noocytes by receptor mediated endocytosis. To gain\naccess to the oolemma, vitellogenin must pass\nthrough the spaces that develop between the fo-\nllicular epithelial cells. Provided the blood meal is\nlarge enough, all the terminal follicles in each ovary\nwill produce an egg within about 50 hours. However,\nby 12 h post-feeding on an infected blood meal,\npatches of cells in the follicular epithelium of some of\nthe ovarioles show characteristic signs of apoptosis.\nStaining with acridine orange and examination\nof ultrathin sections demonstrated nuclear con-\ndensation and DNA fragmentation was observed\nfollowing a TUNEL assay (Hopwood et al. 2001).\nA comparison of ovaries from uninfected and\nPlasmodium yoelii nigeriensis-infected A. stephensi,\nat various times post-feeding, identified signs of\napoptosis in 14–16% of follicles from infected\nfemales but never more than 4% in uninfected ones\n(Hopwood et al. 2001). In A. gambiae ovaries,\nP. y. nigeriensis infection was associated with the\nactivation of a caspase-like molecule that could be\ndetectedwithFAM-VAD.fmk in approximately 25%\nof the ovarian follicles. Injection of the immune\nelicitor lipopolysaccharide or sephadex beads that\nstimulate melanisation also produced a significant\nNitric oxide\nsynthase\nProtein\nnitration\nperoxidases\nH2O + ½O2 \ncatalase\nL-arginine L-citrulline \n2NO–2\n   +  H2O2 2NO2 + H2O\nHydrogen\nperoxide\nNitrite Nitrogen\ndioxide\nperoxynitrite O–2\nNitric\noxide +\nSuperoxide ion \n1.\n2.\nFig. 3. Schematic of proposed reactions in a midgut cell\ninvaded by an ookinete. Nitric oxide synthase catalyses\nthe synthesis of nitric oxide. Superoxide ions are\nproduced by the oxidation of oxygen. Peroxynitrite\nmay be formed by one of two pathways (1, 2). Based on\nKumar et al. (2004).\nMalaria, mosquitoes and apoptosis S41\nincrease in the number of follicles displaying\ncaspase-like activity (Ahmed and Hurd, 2006).\nFollicle cell apoptosis resulted in the resorption\nof developing oocytes (Hopwood et al. 2001), thus\nsmaller egg batches were produced by infected\nmosquitoes (reviewed in Hurd (2003)). Artificial in-\nduction of an immune response also caused fecundity\nreduction as a result of follicle resorption (Ahmed\net al. 2002).\nApoptotic pathways in the ovary\nAlthough we have identified caspase-like activity as\nimportant for the initiation of follicle resorption,\nwe know nothing of the exact molecules involved in\ninitiating or inhibiting apoptosis in the ovarian tissue\nof mosquitoes. In Drosophila, apoptosis occurs in\nresponse to both developmental and environmental\nsignals. Whilst the death of nurse cells late in\noogenesis is part of the normal developmental pro-\ncess, whole egg chambers, including follicle cells,\nundergo apoptosis in response to several triggers\nincluding a diet lacking protein or no transfer of male\nsex peptide duringmating. Themolecular genetics of\nthis have been comprehensively summarised by\nMcCall (McCall, 2004). Based on a variety of studies,\na pathway for programmed cell death during\nmid-oogenesis was proposed that was initiated by\ninsulin signalling-inhibited ecdysone signalling. It is\nsuggested that a reduction in ecdysone signalling\nmay act on the Apf-1 orthologue Dark, which\nactivates an unknown initiator caspase. This, in turn,\nactivates the effector caspase Dcp-1 which may be\nrequired to activate another effector caspase, Drice.\nApoptosis activators such as reaper (rpr), head\ninvolution defective (hid) and (grim) are not required\nfor germline apoptosis, however rpr and hid-induced\napoptotic death in follicle cells results in death\nof follicles before maturity (Chao and Nagoshi,\n1999). Cytochrome c is specifically expressed at late\noogenesis and it is proposed that the initiator, Dredd,\nand other caspases may be involved at this stage\n(McCall, 2004).\nSeveral caspases have been identified in the\nA. gambiae genome, and some of the Drosophila\ncaspases have Anopheles orthologues (Christophides\net al. 2002). These workers grouped the mosquito\ncaspase S8with theDrosophilaS-prodomain caspase,\ndcp1, and dammwasmost similar toAnophelesS9 and\nS10. The caspases dredd and dronc also have ortho-\nlogues, but rpr has not been identified in A. gambiae.\nPeaks of expression of A. stephensi E517 caspase\ntranscript and a bax-like inhibitor of apoptosis\ntranscript occur in the midgut at 40 h and 14–20 d\n(Xu et al. 2005). In A. gambiae an analysis of tran-\nscriptome response tomidgut invasion was examined\nby comparison with the transcriptome from mos-\nquitoes fed a circumsporozoite and TRAP-related\nprotein knockout (CTRPko) that develops in the\nmidgut lumen but is unable to invade the epithelium.\nFive inhibitor-of-apoptosis protein (IAPs) were up-\nregulated and one down-regulated during ookinete\ninvasion. Three of these, together with viral IAP-\nassociated factor, mapped to the major cytoskeleton\nclusters CL15 and CL12, together with the gene\nencoding the serpin SRPN10. There was also dif-\nferential regulation of genes implicated in redox\nmetabolism and detoxification included thioredoxin\nreductase, two thioredoxin peroxidases, a general\nperoxidase precursor and 3 glutathione–S-trans-\nferases (Vlachou et al. 2005).\nPlasmodium does not come into direct contact with\nmosquito ovaries, so the induction of apoptosis and\nfollicle resorption is not induced by invasion (as it\nis in the midgut) and must be triggered by external\nsignals. Crampton and Luckhart noticed non-\nuniform expression of As60A, a member of the\nTGFb1 super-family (see above), in the developing\neggs of infected A. stephensi at 24 h post blood meal.\nIt is possible that this expression could up-regulate\nNOS, but expression of NOS in ovarian follicles\nhas, so far, not been reported. Elevated levels of\nNO or RNIs in the haemolymph are associated\nwith infection and must be considered as candidate\ntriggers. Finally, an infection-induced change in\nendocrine status may mirror events that lead to\napoptosis in Drosophila follicles, though no examin-\nation of ecdysteroid or juvenile hormone titres have\nbeen reported in infected insects to date.\nTHE FUTURE\nOur knowledge of interactions that occur between\nmalaria parasites and their mosquito vectors has\nexpanded enormously during the past decade, and\nis continuing to do so. This has been assisted by\nthe publication of the full genome sequence of\nA. gambiae, a major malaria vector in Africa (Holt\net al. 2002) and a human malaria parasite, P. falci-\nparum (Gardner et al. 2002). The availability of\nassociated bioinformatics resources (Kriventseva\net al. 2005) is aiding the burgeoning application\nof genomics, transcriptomics and proteomics to\nmapping the sporogonic cycle of Plasmodium and\nthe response of the mosquito to infection. It is to\nbe hoped that this wealth of data will, eventually,\nassist in the unravelling of the molecular path-\nways controlling apoptosis in parasite and host,\nthough its immediate use is limited as homologues\nor orthologues of most apoptosis related genes in\nmammalian, C. elegans or Drosophila pathways are\nabsent.\nACKNOWLEDGEMENTS\nWe are grateful for financial support from The Wellcome\nTrust (069162\/Z\/02\/Z) and helpful comments on the\nmanuscript made by J. Mottram and S. Luckhart.\nH. Hurd, K. M. Grant and S. C. Arambage S42\nREFERENCES\nAbraham, E. G., Islam, S., Srinivasan, P., Ghosh,\nA. K., Valenzuela, J. G., Ribeiro, J. M., Kafatos,\nF. C., Dimopoulos, G. and Jacobs-Lorena, M.\n(2004). Analysis of the Plasmodium and Anopheles\ntranscriptional repertoire during ookinete development\nand midgut invasion. Journal of Biological Chemistry\n279, 5573–5580.\nAbraham, E. G., Pinto, S. B., Ghosh, A.,\nVanlandingham,D. L., Budd, A., Higgs, S., Kafatos,\nF. C., Jacobs-Lorena, M. and Michel, K. (2005). An\nimmune-responsive serpin, SRPN6, mediates mosquito\ndefense against malaria parasites. Proceedings of the\nNational Academy of Sciences, USA 279, 5573–5580.\nAhmed, A. M., Baggott, S., Maingon, R. and Hurd, H.\n(2002). The costs of mounting an immune response\nare reflected in the reproductive fitness of Anopheles\ngambiae. Oikos 97, 371–377.\nAhmed, A. M. and Hurd, H. (2006). Immune\nstimulation and malaria infection impose reproductive\ncosts in Anopheles gambiae via follicular apoptosis.\nMicrobes and Infection 8, 308–315.\nAlavi, Y., Arai, M., Mendoza, J., Tufet-Bayona, M.,\nSinha, R., Fowler, K., Billker, O., Franke-Fayard,\nB., Janse, C. J., Waters, A. and Sinden, R. E. (2003).\nThe dynamics of interactions between Plasmodium and\nthe mosquito: a study of the infectivity of Plasmodium\nberghei and Plasmodium gallinaceum, and their\ntransmission by Anopheles stephensi, Anopheles gambiae\nand Aedes aegypti. International Journal for Parasitology\n33, 933–943.\nAl-Olayan, E. M., Williams, G. T. and Hurd, H.\n(2002). Apoptosis in the malaria protozoan, Plasmodium\nberghei : a possible mechanism for limiting intensity of\ninfection in the mosquito. International Journal for\nParasitology 32, 1133–1143.\nAlvarez, B. and Radi, R. (2003). Peroxynitrite\nreactivity with amino acids and proteins. Amino Acids\n25, 295–311.\nAtamna, H. and Ginsburg, H. (1993). Origin of\nreactive oxygen species in erythrocytes infected with\nPlasmodium falciparum.Molecular and Biochemical\nParasitology 61, 231–241.\nBai, P., Bakondi, E., Szabo, E., Gergely, P., Szabo, C.\nand Virag, L. (2001). Partial protection by\npoly(ADP-ribose) polymerase inhibitors from\nnitroxyl-induced cytotoxity in thymocytes. Free\nRadical Biology and Medicine 31, 1616–1623.\nBalmer, P., Phillips, H. M., Maestre, A. E.,\nMcMonagle, F. A. and Phillips, R. S. (2000). The\neffect of nitric oxide on the growth of Plasmodium\nfalciparum, P. chabaudi and P. berghei in vitro. Parasite\nImmunology 22, 97–106.\nBarrett, A. J. and Rawlings, N. D. (2001). Evolutionary\nlines of cysteine peptidases. Biological Chemistry 382,\n727–733.\nBaton, L. A. and Ranford-Cartwright, L. C. (2004).\nPlasmodium falciparum ookinete invasion of the midgut\nepithelium of Anopheles stephensi is consistent with the\nTime Bomb model. Parasitology 129, 663–676.\nBaton, L. A. and Ranford-Cartwright, L. C. (2005a).\nHow do malaria ookinetes cross the mosquito midgut\nwall? Trends in Parasitology 21, 22–28.\nBaton, L. A. and Ranford-Cartwright, L. C. (2005b).\nSpreading the seeds of million-murdering death:\nmetamorphoses of malaria in the mosquito. Trends\nin Parasitology 21, 573–580.\nBlandin, S. and Levashina, E. A. (2004). Mosquito\nimmune responses against malaria parasites. Current\nOpinion in Immunology 16, 16–20.\nBlomgren, K., Zhu, C., Wang, X., Karlsson, J. O.,\nLeverin, A. L., Bahr, B. A., Mallard, C. and\nHagberg, H. (2001). Synergistic activation of caspase-3\nby m-calpain after neonatal hypoxia-ischemia: a\nmechanism of ‘‘pathological apoptosis ’’? Journal of\nBiological Chemistry 276, 10191–10198.\nBozdech, Z., Zhu, J., Joachimiak, M. P., Cohen, F. E.,\nPulliam, B. and DeRisi, J. L. (2003). Expression\nprofiling of the schizont and trophozoite stages of\nPlasmodium falciparum with a long-oligonucleotide\nmicroarray. Genome Biology 4, R9 Epub.\nBursch, W. (2001). The autophagosomal-lysosomal\ncompartment in programmed cell death. Cell Death\nand Differentiation 8, 569–581.\nChao, S. and Nagoshi, R. N. (1999). Induction of\napoptosis in the germline and follicle layer of\nDrosophila egg chambers.Mechanisms of Development\n88, 159–172.\nChristophides, G. K., Zdobnov, E., Barillas-Mury, C.,\nBirney, E., Blandin, S., Blass, C., Brey, P. T., Collins,\nF. H., Danielli, A., Dimopoulos, G., Hetru, C., Hoa,\nN. T., Hoffmann, J. A., Kanzok, S. M., Letunic, I.,\nLevashina, E. A., Loukeris, T. G., Lycett, G.,\nMeister, S., Michel, K., Moita, L. F., Muller, H. M.,\nOsta, M. A., Paskewitz, S. M., Reichhart, J. M.,\nRzhetsky, A., Troxler, L., Vernick, K. D., Vlachou,\nD., Volz, J., von Mering, C., Xu, J., Zheng, L., Bork,\nP. and Kafatos, F. C. (2002). Immunity-related genes\nand gene families in Anopheles gambiae. Science 298,\n159–165.\nClark, I. A., Rockett, K. A. and Burgner, D. (2003).\nGenes, nitric oxide and malaria in African children.\nTrends in Parasitology 19, 335–337.\nCollins, F. H., Sakai, R. K., Vernick, K. D.,\nPaskewitz, S., Seeley, D. C., Miller, L. H.,\nCollins, W. E., Campbell, C. C. and Gwadz, R. W.\n(1986). Genetic selection of a Plasmodium-refractory\nstrain of the malaria vector Anopheles gambiae. Science\n234, 607–610.\nCrampton, A. and Luckhart, S. (2001). The role of\nAs60A, a TGF-beta homolog, in Anopheles stephensi\ninnate immunity and defense against Plasmodium\ninfection. Infection Genetics and Evolution 1, 131–141.\nDanielli, A., Barillas-Mury, C., Kumar, S., Kafatos,\nF. C. and Loukeris, T. G. (2005). Overexpression and\naltered nucleocytoplasmic distribution of Anopheles\novalbumin-like SRPN10 serpins in Plasmodium-infected\nmidgut cells. Cellular Microbiology 7, 181–190.\nDeponte, M. and Becker, K. (2004). Plasmodium\nfalciparum – do killers commit suicide? Trends in\nParasitology 20, 165–169.\nDimopoulos, G. (2003). Insect immunity and its\nimplication in mosquito-malaria interactions. Cell\nMicrobiology 5, 3–14.\nEksi, S., Czesny, B., Greenbaum, D. C., Bogyo, M.\nand Williamson, K. C. (2004). Targeted disruption\nof Plasmodium falciparum cysteine protease, falcipain 1,\nMalaria, mosquitoes and apoptosis S43\nreduces oocyst production, not erythrocytic stage\ngrowth.Molecular Microbiology 53, 243–250.\nFox, B. A. and Bzik, D. J. (1994). Analysis of\nstage-specific transcripts of the Plasmodium falciparum\nserine repeat antigen (SERA) gene and transcription\nfrom the SERA locus.Molecular and Biochemical\nParasitology 68, 133–144.\nGamboa de Dominguez, N. D. and Rosenthal, P. J.\n(1996). Cysteine proteinase inhibitors block early steps\nin hemoglobin degradation by cultured malaria\nparasites. Blood 87, 4448–4454.\nGardner, M. J., Hall, N., Fung, E., White, O.,\nBerriman, M., Hyman, R. W., Carlton, J. M., Pain,\nA., Nelson, K. E., Bowman, S., Paulsen, I. T.,\nJames, K., Eisen, J. A., Rutherford, K., Salzberg,\nS. L., Craig, A., Kyes, S., Chan, M. S., Nene, V.,\nShallom, S. J., Suh, B., Peterson, J., Angiuoli, S.,\nPertea, M., Allen, J., Selengut, J., Haft, D., Mather,\nM. W., Vaidya, A. B., Martin, D. M., Fairlamb,\nA. H., Fraunholz, M. J., Roos, D. S., Ralph, S. A.,\nMcFadden, G. I., Cummings, L. M., Subramanian,\nG. M., Mungall, C., Venter, J. C., Carucci, D. J.,\nHoffman, S. L., Newbold, C., Davis, R. W., Fraser,\nC. M. and Barrell, B. (2002). Genome sequence of\nthe human malaria parasite Plasmodium falciparum.\nNature 419, 498–511.\nGhosh, A., Edwards, M. J. and Jacobs-Lorena, M.\n(2000). The journey of the malaria parasite in the\nmosquito: hopes for the new century. Parasitology\nToday 16, 196–201.\nGoh, S. L., Goh, L. L. and Sim, T. S. (2005). Cysteine\nprotease falcipain 1 in Plasmodium falciparum is\nbiochemically distinct from its isozymes. Parasitology\nResearch 97, 295–301.\nGor, D. O., Li, A. C., Wiser, M. F. and Rosenthal, P. J.\n(1998). Plasmodial serine repeat antigen homologues\nwith properties of schizont cysteine proteases.Molecular\nand Biochemical Parasitology 95, 153–158.\nGupta, L., Kumar, S., Han, Y. S., Pimenta, P. F. and\nBarillas-Mury, C. (2005). Midgut epithelial responses\nof different mosquito-Plasmodium combinations: the\nactin cone zipper repair mechanism in Aedes aegypti.\nProceedings of the National Academy of Sciences, USA\n102, 4010–4015.\nHall, N., Karras, M., Raine, J. D., Carlton, J. M.,\nKooij, T. W., Berriman, M., Florens, L.,\nJanssen, C. S., Pain, A., Christophides, G. K.,\nJames, K., Rutherford, K., Harris, B., Harris, D.,\nChurcher, C., Quail,M. A., Ormond, D., Doggett, J.,\nTrueman, H. E., Mendoza, J., Bidwell, S. L.,\nRajandream, M. A., Carucci, D. J., Yates, J. R., 3rd,\nKafatos, F. C., Janse, C. J., Barrell, B., Turner, C. M.,\nWaters, A. P. and Sinden, R. E. (2005). A\ncomprehensive survey of the Plasmodium life cycle\nby genomic, transcriptomic, and proteomic analyses.\nScience 307, 82–86.\nHan, Y. S. and Barillas-Mury, C. (2002). Implications\nof Time Bomb model of ookinete invasion of midgut\ncells. Insect Biochemistry and Molecular Biology 32,\n1311–1316.\nHan, Y. S., Thompson, J., Kafatos, F. C. and\nBarillas-Mury, C. (2000). Molecular interactions\nbetween Anopheles stephensi midgut cells and\nPlasmodium berghei : the time bomb theory of ookinete\ninvasion of mosquitoes. The EMBO Journal 19,\n6030–6040.\nHarada, M., Owhashi, M., Suguri, S., Kumatori, A.,\nNakamura, M., Kanbara, H., Matsuoka, H. and\nIshii, A. (2001). Superoxide-dependent and\n-independent pathways are involved in the\ntransmission blocking of malaria. Parasitology\nResearch 87, 605–608.\nHerrera-Ortiz, A., Lanz-Mendoza, H.,\nMartinez-Barnetche, J., Hernandez-Martinez, S.,\nVillarreal-Trevino, C., Aguilar-Marcelino, L. and\nRodriguez, M. H. (2004). Plasmodium berghei\nookinetes induce nitric oxide production in\nAnopheles pseudopunctipennis midguts cultured\nin vitro. Insect Biochemistry and Molecular Biology\n34, 893–901.\nHodder, A. N., Drew, D. R., Epa, V. C., Delorenzi, M.,\nBourgon, R., Miller, S. K., Moritz, R. L.,\nFrecklington, D. F., Simpson, R. J., Speed, T. P.,\nPike, R. N. and Crabb, B. S. (2003). Enzymic,\nphylogenetic, and structural characterization of the\nunusual papain-like protease domain of Plasmodium\nfalciparum SERA5. Journal of Biological Chemistry 278,\n48169–48177.\nHolt, R. A., Subramanian, G. M., Halpern, A., Sutton,\nG. G., Charlab, R., Nusskern, D. R., Wincker, P.,\nClark, A. G., Ribeiro, J. M., Wides, R., Salzberg,\nS. L., Loftus, B., Yandell, M., Majoros, W. H.,\nRusch, D. B., Lai, Z., Kraft, C. L., Abril, J. F.,\nAnthouard, V., Arensburger, P., Atkinson, P. W.,\nBaden,H., de Berardinis, V., Baldwin, D., Benes, V.,\nBiedler, J., Blass, C., Bolanos, R., Boscus, D.,\nBarnstead, M., Cai, S., Center, A., Chaturverdi, K.,\nChristophides, G. K., Chrystal, M. A., Clamp, M.,\nCravchik, A., Curwen, V., Dana, A., Delcher, A.,\nDew, I., Evans, C. A., Flanigan, M., Grundschober-\nFreimoser, A., Friedli, L., Gu, Z., Guan, P., Guigo,\nR., Hillenmeyer, M. E., Hladun, S. L., Hogan, J. R.,\nHong, Y. S., Hoover, J., Jaillon, O., Ke, Z., Kodira,\nC., Kokoza, E., Koutsos, A., Letunic, I., Levitsky, A.,\nLiang, Y., Lin, J. J., Lobo, N. F., Lopez, J. R., Malek,\nJ. A., McIntosh, T. C., Meister, S., Miller, J.,\nMobarry, C., Mongin, E., Murphy, S. D., O’Brochta,\nD. A., Pfannkoch, C., Qi, R., Regier, M. A.,\nRemington, K., Shao, H., Sharakhova, M. V., Sitter,\nC. D., Shetty, J., Smith, T. J., Strong, R., Sun, J.,\nThomasova, D., Ton, L. Q., Topalis, P., Tu, Z.,\nUnger, M. F., Walenz, B., Wang, A., Wang, J.,\nWang, M., Wang, X., Woodford, K. J., Wortman,\nJ. R., Wu, M., Yao, A., Zdobnov, E. M., Zhang, H.,\nZhao, Q., Zhao, S., Zhu, S. C., Zhimulev, I., Coluzzi,\nM., della Torre, A., Roth, C. W., Louis, C., Kalush,\nF.,Mural, R. J., Myers, E. W., Adams,M. D., Smith,\nH. O., Broder, S., Gardner, M. J., Fraser, C. M.,\nBirney, E., Bork, P., Brey, P. T., Venter, J. C.,\nWeissenbach, J., Kafatos, F. C., Collins, F. H. and\nHoffman, S. L. (2002). The genome sequence of the\nmalaria mosquito Anopheles gambiae. Science 298,\n129–149.\nHopwood, J. A., Ahmed, A. M., Polwart, A.,\nWilliams, G. T. and Hurd, H. (2001).\nMalaria-induced apoptosis in mosquito ovaries: a\nmechanism to control vector egg production. Journal\nof Experimental Biology 204, 2773–2780.\nH. Hurd, K. M. Grant and S. C. Arambage S44\nHurd, H. (2003). Manipulation of medically important\ninsect vectors by their parasites. Annual Review of\nEntomology 48, 141–161.\nHurd, H. and Carter, V. (2004). The role of programmed\ncell death in Plasmodium-mosquito interactions.\nInternational Journal for Parasitology 34, 1459–1472.\nHurd, H., Carter, V. and Nacer, A. (2005).\nInteractions between malaria and mosquitoes: the role\nof apoptosis in parasite establishment and vector\nresponse to infection. Current Topics in Microbiology\nand Immunology 289, 185–217.\nHurd, H., Taylor, P., Adams, D., Underhill, A. and\nEggleston, P. (2006). Evaluating the costs of mosquito\nresistance to malaria. Evolution 59, 2560–2572.\nKiefer, M. C., Crawford, K. A., Boley, L. J.,\nLandsberg, K. E., Gibson, H. L., Kaslow, D. C.\nand Barr, P. J. (1996). Identification and cloning of a\nlocus of serine repeat antigen (sera)-related genes from\nPlasmodium vivax.Molecular and Biochemical\nParasitology 78, 55–65.\nKriventseva, E. V., Koutsos, A. C., Blass, C., Kafatos,\nF. C., Christophides, G. K. and Zdobnov, E. M.\n(2005). AnoEST: toward A. gambiae functional\ngenomics. Genome Research 15, 893–899.\nKumar, S. and Barillas-Mury, C. (2005). Ookinete-\ninduced midgut peroxidases detonate the time bomb\nin anopheline mosquitoes. Insect Biochemistry and\nMolecular Biology 35, 721–727.\nKumar, S., Gupta, L., Han, Y. S. and Barillas-Mury, C.\n(2004). Inducible peroxidases mediate nitration of\nanopheles midgut cells undergoing apoptosis in response\nto Plasmodium invasion. Journal of Biological Chemistry\n279, 53475–53482.\nLanz-Mendoza, H., Hernandez-Martinez, S.,\nKu-Lopez, M., Rodriguez Mdel, C., Herrera-Ortiz,\nA. and Rodriguez, M. H. (2002). Superoxide anion\nin Anopheles albimanus hemolymph and midgut is\ntoxic to Plasmodium berghei ookinetes. Journal of\nParasitology 88, 702–706.\nLe Roch, K. G., Zhou, Y., Blair, P. L., Grainger, M.,\nMoch, J. K., Haynes, J. D., De La Vega, P., Holder,\nA. A., Batalov, S., Carucci, D. J. andWinzeler, E. A.\n(2003). Discovery of gene function by expression\nprofiling of the malaria parasite life cycle. Science 301,\n1503–1508.\nLensen, A., Mulder, L., Tchuinkam, T.,\nWillemsen, L., Eling, W. and Sauerwein, R.\n(1998). Mechanisms that reduce transmission of\nPlasmodium falciparum malaria in semiimmune and\nnonimmune persons. Journal of Infectious Disease\n177, 1358–1363.\nLim, J., Gowda, D. C., Krishnegowda, G. and\nLuckhart, S. (2005). Induction of nitric oxide synthase\nin Anopheles stephensi by Plasmodium falciparum :\nmechanism of signaling and the role of parasite\nglycosylphosphatidylinositols. Infection and Immunity\n73, 2778–2789.\nLuckhart, S., Crampton, A. L., Zamora, R.,\nLieber, M. J., Dos Santos, P. C., Peterson, T. M.,\nEmmith, N., Lim, J., Wink, D. A. and Vodovotz, Y.\n(2003). Mammalian transforming growth factor beta1\nactivated after ingestion by Anopheles stephensi\nmodulates mosquito immunity. Infection and Immunity\n71, 3000–3009.\nLuckhart, S., Vodovotz, Y., Cui, L. and Rosenberg, R.\n(1998). The mosquito Anopheles stephensi limits malaria\nparasite development with inducible synthesis of nitric\noxide. Proceedings of the National Academy of Sciences,\nUSA 95, 5700–5705.\nMadeo, F., Herker, E., Maldener, C., Wissing, S.,\nLachelt, S., Herlan, M., Fehr, M., Lauber, K.,\nSigrist, S. J., Wesselborg, S. and Frohlich, K. U.\n(2002). A caspase-related protease regulates apoptosis\nin yeast.Molecular Cell 9, 911–917.\nMazzoni, C., Herker, E., Palermo, V., Jungwirth, H.,\nEisenberg, T., Madeo, F. and Falcone, C. (2005).\nYeast caspase 1 links messenger RNA stability to\napoptosis in yeast. EMBO Reports 6, 1076–1081.\nMcCall, K. (2004). Eggs over easy: cell death in the\nDrosophila ovary. Developmental Biology 274, 3–14.\nMcIntosh, M. T., Elliott, D. A. and Joiner, K. A.\n(2005). Plasmodium falciparum : discovery of peroxidase\nactive organelles. Experimental Parasitology 111,\n133–136.\nMichel, K. and Kafatos, F. C. (2005). Mosquito\nimmunity against Plasmodium. Insect Biochemistry and\nMolecular Biology 35, 677–689.\nMiller, S. K., Good, R. T., Drew, D. R., Delorenzi, M.,\nSanders, P. R., Hodder, A. N., Speed, T. P.,\nCowman, A. F., Koning-ward, T. F. and Crabb, B. S.\n(2002). A subset of Plasmodium falciparum SERA\ngenes are expressed and appear to play an important\nrole in the erythrocytic cycle. Journal of Biological\nChemistry 277, 47524–47532.\nMotard, A., Landau, I., Nussler, A., Grau, G.,\nBaccam, D., Mazier, D. and Targett, G. A. (1993).\nThe role of reactive nitrogen intermediates in\nmodulation of gametocyte infectivity of rodent malaria\nparasites. Parasite Immunology 15, 21–26.\nMottram, J. C., Helms, M. J., Coombs, G. H. and\nSajid, M. (2003). Clan CD cysteine peptidases of\nparasitic protozoa. Trends in Parasitology 19, 182–187.\nMu¨ller, S. (2004). Redox and antioxidant systems of the\nmalaria parasite Plasmodium falciparum.Molecular\nMicrobiology 53, 1291–1305.\nMurphy, M. P. (1999). Nitric oxide and cell death.\nBiochimica et Biophysica Acta 1411, 401–414.\nNakagawa, T. and Yuan, J. (2000). Cross-talk between\ntwo cysteine protease families. Activation of caspase-12\nby calpain in apoptosis. Journal of Cell Biology 150,\n887–894.\nNaotunne, T. S., Karunaweera, N. D., Mendis, K. N.\nand Carter, R. (1993). Cytokine-mediated\ninactivation of malarial gametocytes is dependent\non the presence of white blood cells and involves\nreactive nitrogen intermediates. Immunology 78,\n555–562.\nOsta, M. A., Christophides, G. K. and Kafatos, F. C.\n(2004a). Effects of mosquito genes on Plasmodium\ndevelopment. Science 303, 2030–2032.\nOsta, M. A., Christophides, G. K., Vlachou, D. and\nKafatos, F. C. (2004b). Innate immunity in the malaria\nvector Anopheles gambiae : comparative and functional\ngenomics. Journal of Experimental Biology 207,\n2551–2563.\nPang, X. L., Mitamura, T. and Horii, T. (1999).\nAntibodies reactive with the N-terminal domain of\nPlasmodium falciparum serine repeat antigen inhibit\nMalaria, mosquitoes and apoptosis S45\ncell proliferation by agglutinating merozoites and\nschizonts. Infection and Immunity 67, 1821–1827.\nPeterson, T. m. L. and Luckhart, S. (2006). A mosquito\n2-Cys peroxiredoxin protects against nitrosative and\noxidative stresses associated with malaria parasite\ninfection. Free Radical Biology and Medicine 40,\n1067–1082.\nPicot, S., Burnod, J., Bracchi, V., Chumpitazi, B. f. F.\nand Ambroise-Thomas, P. (1997). Apoptosis related\nto chloroquine sensitivity of the human malaria\nparasite Plasmodium falciparum. Transactions of the\nRoyal Society of Tropical Medicine and Hygiene 91,\n590–591.\nRichman, A. M., Dimopoulos, G., Seeley, D. and\nKafatos, F. C. (1997). Plasmodium activates the innate\nimmune response of Anopheles gambiae mosquitoes.\nEMBO Journal 16, 6114–6119.\nRockett, K. A., Awburn, M. M., Cowden, W. B. and\nClark, I. A. (1991). Killing of Plasmodium falciparum\nin vitro by nitric oxide derivatives. Infection and\nImmunity 59, 3280–3283.\nRosenthal, P. J. (1995). Plasmodium falciparum : effects\nof proteinase inhibitors on globin hydrolysis by cultured\nmalaria parasites. Experimental Parasitology 80,\n272–281.\nRosenthal, P. J. (2004). Cysteine proteases of malaria\nparasites. International Journal for Parasitology 34,\n1489–1499.\nRosenthal, P. J., Olson, J. E., Lee, G. K., Palmer, J. T.,\nKlaus, J. L. and Rasnick, D. (1996). Antimalarial\neffects of vinyl sulfone cysteine proteinase inhibitors.\nAntimicrobial Agents and Chemotherapy 40, 1600–1603.\nRosenthal, P. J., Sijwali, P. S., Singh, A. and Shenai,\nB. R. (2002). Cysteine proteases of malaria parasites:\ntargets for chemotherapy. Current Pharmaceutical\nDesign 8, 1659–1672.\nRozman-Pungercar, J., Kopitar-Jerala, N., Bogyo,M.,\nTurk, D., Vasiljeva, O., Stefe, I., Vandenabeele, P.,\nBromme, D., Puizdar, V., Fonovic, M.,\nTrstenjak-Prebanda, M., Dolenc, I., Turk, V.\nand Turk, B. (2003). Inhibition of papain-like\ncysteine proteases and legumain by caspase-specific\ninhibitors: when reaction mechanism is more important\nthan specificity. Cell Death and Differentiation 10,\n881–888.\nSinden, R. E. (2002). Molecular interactions between\nPlasmodium and its insect vectors. Cellular Microbiology\n4, 713–724.\nSinden, R. E., Alavi, Y. and Raine, J. D. (2004).\nMosquito–malaria interactions: a reappraisal of the\nconcepts of susceptibility and refractoriness. Insect\nBiochemistry and Molecular Biology 34, 625–629.\nSobolewski, P., Gramaglia, I., Frangos, J., Intaglietta,\nM. and van der Heyde, H. C. (2005). Nitric oxide\nbioavailability in malaria. Trends in Parasitology 21,\n415–422.\nSquier, M. K. and Cohen, J. J. (1997). Calpain, an\nupstream regulator of thymocyte apoptosis. Journal of\nImmunology 158, 3690–3697.\nSquier, M. K., Miller, A. C., Malkinson, A. M. and\nCohen, J. J. (1994). Calpain activation in apoptosis.\nJournal of Cell Physiology 159, 229–237.\nSrinivasan, P., Abraham, E. G., Ghosh, A. K.,\nValenzuela, J., Ribeiro, J. M., Dimopoulos, G.,\nKafatos, F. C., Adams, J. H., Fujioka, H. and\nJacobs-Lorena, M. (2004). Analysis of the\nPlasmodium and Anopheles transcriptomes during\noocyst differentiation. Journal of Biological Chemistry\n279, 5581–5587.\nStoka, V., Turk, B., Schendel, S. L., Kim, T. H.,\nCirman, T., Snipas, S. J., Ellerby, L. M., Bredesen,\nD., Freeze, H., Abrahamson, M., Bromme, D.,\nKrajewski, S., Reed, J. C., Yin, X. M., Turk, V. and\nSalvesen, G. S. (2001). Lysosomal protease pathways\nto apoptosis. Cleavage of bid, not pro-caspases, is the\nmost likely route. Journal of Biological Chemistry 276,\n3149–3157.\nTachado, S. D., Gerold, P., McConville, M. J.,\nBaldwin, T., Quilici, D., Schwarz, R. T. and\nSchofield, L. (1996). Glycosylphosphatidylinositol\ntoxin of Plasmodium induces nitric oxide synthase\nexpression in macrophages and vascular endothelial\ncells by a protein tyrosine kinase-dependent and\nprotein kinase C-dependent signaling pathway.\nJournal of Immunology 156, 1897–1907.\nThornberry, N. A. (1997). The caspase family of\ncysteine proteases. British Medical Bulletin 53, 478–490.\nThornberry, N. A., Rano, T. A., Peterson, E. P.,\nRasper, D. M., Timkey, T., Garcia-Calvo, M.,\nHoutzager, V. M., Nordstrom, P. A., Roy, S.,\nVaillancourt, J. P., Chapman, K. T. and Nicholson,\nD. W. (1997). A combinatorial approach defines\nspecificities of members of the caspase family and\ngranzyme B. Functional relationships established for\nkey mediators of apoptosis. Journal of Biological\nChemistry 272, 17907–17911.\nToler, S. (2005). The plasmodial apicoplast was retained\nunder evolutionary selective pressure to assuage blood\noxidative stress.Medical Hypothesis 65, 683–690.\nTurk, B., Stoka, V., Rozman-Pungercar, J., Cirman,\nT., Droga-Mazovec, G., Oresic, K. and Turk, V.\n(2002). Apoptotic pathways: involvement of lysosomal\nproteases. Biological Chemistry 383, 1035–1044.\nUren, A. G., O’Rourke, K., Aravind, L., Pisabarro,\nM. T., Seshagiri, S., Koonin, E. V. and Dixit, V. M.\n(2000). Identification of paracaspases and metacaspases:\ntwo ancient families of caspase-like proteins, one of\nwhich plays a key role in MALT lymphoma. Molecular\nCell 6, 961–967.\nVaughan, J. A., Hensley, L. and Beier, J. C. (1994a).\nSporogonic development of Plasmodium yoelii in five\nanopheline species. Journal of Parasitology 80, 674–681.\nVaughan, J. A., Noden, B. H. and Beier, J. C. (1994b).\nSporogonic development of cultured Plasmodium\nfalciparum in six species of laboratory-reared Anopheles\nmosquitoes. American Journal of Tropical Medicine\nand Hygiene 51, 233–243.\nVernick, K. D., Fujioka, H., Seeley, D. C., Tandler, B.,\nAikawa, M. and Miller, L. H. (1995). Plasmodium\ngallinaceum : a refractory mechanism of ookinete killing\nin the mosquito, Anopheles gambiae. Experimental\nParasitology 80, 583–595.\nVlachou, D. and Kafatos, F. C. (2005). The complex\ninterplay between mosquito positive and negative\nregulators of Plasmodium development. Current Opinion\nin Microbiology 8, 415–421.\nVlachou, D., Schlegelmilch, T., Christophides, G. K.\nand Kafatos, F. C. (2005). Functional genomic analysis\nH. Hurd, K. M. Grant and S. C. Arambage S46\nof midgut epithelial responses in Anopheles during\nPlasmodium invasion. Current Biology 15, 1185–1195.\nVlachou, D., Zimmermann, T., Cantera, R., Janse,\nC. J., Waters, A. P. and Kafatos, F. C. (2004).\nReal-time, in vivo analysis of malaria ookinete\nlocomotion and mosquito midgut invasion. Cellular\nMicrobiology 6, 671–685.\nWaterhouse, N. J., Finucane, D. M., Green, D. R.,\nElce, J. S., Kumar, S., Alnemri, E. S., Litwack, G.,\nKhanna, K., Lavin, M. F. and Watters, D. J. (1998).\nCalpain activation is upstream of caspases in radiation-\ninduced apoptosis. Cell Death and Differentiation 5,\n1051–1061.\nWhitten, M. m. A., Shiao, S. H. and Levashina, E. A.\n(2006). Mosquito midguts and malaria: cell biology,\ncompartmentalization and immunology. Parasite\nImmunology 28, 121–130.\nWolf, B. B., Schuler, M., Echeverri, F. and Green,\nD. R. (1999). Caspase-3 is the primary activator of\napoptotic DNA fragmentation via DNA fragmentation\nfactor-45\/inhibitor of caspase-activated DNase\ninactivation. Journal of Biological Chemistry 274,\n30651–30656.\nWu, Y., Wang, X., Liu, X. and Wang, Y. (2003).\nData-mining approaches reveal hidden families of\nproteases in the genome of malaria parasite. Genome\nResearch 13, 601–616.\nXu, X., Dong, Y., Abraham, E. G., Kocan, A.,\nSrinivasan, P., Ghosh, A. K., Sinden, R. E.,\nRibeiro, J. M., Jacobs-Lorena, M., Kafatos, F. C.\nand Dimopoulos, G. (2005). Transcriptome\nanalysis of Anopheles stephensi–Plasmodium berghei\ninteractions.Molecular and Biochemical Parasitology\n142, 76–87.\nZheng, L., Wang, S., Romans, P., Zhao, H., Luna, C.\nand Benedict, M. Q. (2003). Quantitative trait loci\nin Anopheles gambiae controlling the encapsulation\nresponse against Plasmodium cynomolgi Ceylon. BMC\nGenetics 4, 16. Oct 24; 4, 16: http:\/\/www.\nbiomedcentral.com\/1471-2156\/4\/16.\nZhu, J., Krishnegowda, G. and Gowda, D. C. (2005).\nInduction of proinflammatory responses in\nmacrophages by the glycosylphosphatidylinositols\nof Plasmodium falciparum : the requirement of\nextracellular signal-regulated kinase, p38, c-Jun\nN-terminal kinase and NF-kappaB pathways for the\nexpression of proinflammatory cytokines and nitric\noxide. Journal of Biological Chemistry 280, 8617–8627.\nZieler, H. and Dvorak, J. A. (2000). Invasion in vitro\nof mosquito midgut cells by the malaria parasite\nproceeds by a conserved mechanism and results in\ndeath of the invaded midgut cells. Proceedings of\nthe National Academy of Sciences, USA 97,\n11516–11521.\nMalaria, mosquitoes and apoptosis S47\n"}