{"doi":"10.1111\/j.1365-313X.2011.04551.x","coreId":"197033","oai":"oai:lra.le.ac.uk:2381\/9255","identifiers":["oai:lra.le.ac.uk:2381\/9255","10.1111\/j.1365-313X.2011.04551.x"],"title":"Molecular and genetic analyses of Tic20 homologues in Arabidopsis thaliana chloroplasts","authors":["Kasmati, Ali Reza","Töpel, Mats","Patel, Ramesh","Murtaza, Ghulam","Jarvis, Paul"],"enrichments":{"references":[{"id":43682398,"title":"A 1-megadalton translocation complex containing Tic20 and Tic21 mediates chloroplast protein import at the inner envelope membrane.","authors":[],"date":"2009","doi":"10.1105\/tpc.108.063552","raw":"Kikuchi, S., Oishi, M., Hirabayashi, Y., Lee, D.W., Hwang, I. and Nakai, M. (2009) A 1-megadalton translocation complex containing Tic20 and Tic21 mediates chloroplast protein import at the inner envelope membrane. Plant Cell 21, 1781-1797.","cites":null},{"id":43682418,"title":"A high-throughput Arabidopsis reverse genetics system.","authors":[],"date":"2002","doi":null,"raw":"Sessions, A., Burke, E., Presting, G., Aux, G., McElver, J., Patton, D., Dietrich, B., Ho, P., Bacwaden, J., Ko, C., Clarke, J.D., Cotton, D., Bullis, D., Snell, J., Miguel, T., Hutchison, D., Kimmerly, B., Mitzel, T., Katagiri, F., Glazebrook, J., Law, M. and Goff, S.A. (2002) A high-throughput Arabidopsis reverse genetics system. Plant Cell 14, 2985-2994.","cites":null},{"id":43682424,"title":"A molecular timeline for the origin of photosynthetic eukaryotes.","authors":[],"date":"2004","doi":"10.1093\/molbev\/msh075","raw":"Yoon, H.S., Hackett, J.D., Ciniglia, C., Pinto, G. and Bhattacharya, D. (2004) A molecular timeline for the origin of photosynthetic eukaryotes. Mol. Biol. Evol. 21, 809-818.","cites":null},{"id":43682422,"title":"A novel serine\/proline-rich domain in combination with a transmembrane domain is required for the insertion of AtTic40 into the inner envelope membrane of chloroplasts.","authors":[],"date":"2007","doi":"10.1111\/j.1365-313x.2007.03279.x","raw":"Tripp, J., Inoue, K., Keegstra, K. and Froehlich, J.E. (2007) A novel serine\/proline-rich domain in combination with a transmembrane domain is required for the insertion of AtTic40 into the inner envelope membrane of chloroplasts. Plant J. 52, 824-838.","cites":null},{"id":43682417,"title":"An Arabidopsis thaliana T-DNA mutagenized population (GABI-Kat) for flanking sequence tag-based reverse genetics.","authors":[],"date":"2003","doi":"10.1023\/b:plan.0000009297.37235.4a","raw":"Rosso, M.G., Li, Y., Strizhov, N., Reiss, B., Dekker, K. and Weisshaar, B. (2003) An Arabidopsis thaliana T-DNA mutagenized population (GABI-Kat) for flanking sequence tag-based reverse genetics. Plant Mol. Biol. 53, 247-259.","cites":null},{"id":43682399,"title":"Analysis of the interactions of preproteins with the import machinery over the course of protein import into chloroplasts.","authors":[],"date":"1997","doi":"10.1083\/jcb.139.7.1677","raw":"Kouranov, A. and Schnell, D.J. (1997) Analysis of the interactions of preproteins with the import machinery over the course of protein import into chloroplasts. J. Cell Biol. 139, 1677-1685.","cites":null},{"id":43682402,"title":"chloroplast protein import.","authors":[],"date":"2005","doi":"10.1111\/j.1365-313x.2004.02307.x","raw":"Kovacheva, S., Bédard, J., Patel, R., Dudley, P., Twell, D., Ríos, G., Koncz, C. and Jarvis, P. (2005) In vivo studies on the roles of Tic110, Tic40 and Hsp93 during chloroplast protein import. Plant J. 41, 412-428.","cites":null},{"id":43682406,"title":"Conservation and variability in the structures of serine proteinases of the chymotrypsin family.","authors":[],"date":"1996","doi":"10.1006\/jmbi.1996.0264","raw":"Lesk, A.M. and Fordham, W.D. (1996) Conservation and variability in the structures of serine proteinases of the chymotrypsin family. J. Mol. Biol. 258, 501-537.","cites":null},{"id":43682405,"title":"Functional specialization amongst the Arabidopsis Toc159 family of chloroplast protein import receptors.","authors":[],"date":"2004","doi":"10.1105\/tpc.104.023309","raw":"Kubis, S., Patel, R., Combe, J., Bédard, J., Kovacheva, S., Lilley, K., Biehl, A., Leister, D., Ríos, G., Koncz, C. and Jarvis, P. (2004) Functional specialization amongst the Arabidopsis Toc159 family of chloroplast protein import receptors. Plant Cell 16, 2059-2077.","cites":null},{"id":43682401,"title":"Further in vivo studies on the role of the molecular chaperone, Hsp93, in plastid protein import.","authors":[],"date":"2007","doi":"10.1111\/j.1365-313x.2007.03060.x","raw":"Kovacheva, S., Bédard, J., Wardle, A., Patel, R. and Jarvis, P. (2007) Further in vivo studies on the role of the molecular chaperone, Hsp93, in plastid protein import. Plant J. 50, 364-379.","cites":null},{"id":43682425,"title":"GENEVESTIGATOR. Arabidopsis microarray database and analysis toolbox.","authors":[],"date":"2004","doi":null,"raw":"Zimmermann, P., Hirsch-Hoffmann, M., Hennig, L. and Gruissem, W. (2004) GENEVESTIGATOR. Arabidopsis microarray database and analysis toolbox. Plant Physiol. 136, 2621-2632.","cites":null},{"id":43682396,"title":"MAFFT version 5: improvement in accuracy of multiple sequence alignment.","authors":[],"date":"2005","doi":"10.1093\/nar\/gki198","raw":"Katoh, K., Kuma, K., Toh, H. and Miyata, T. (2005) MAFFT version 5: improvement in accuracy of multiple sequence alignment. Nucleic Acids Res. 33, 511-518.","cites":null},{"id":43682395,"title":"Modular cloning in plant cells.","authors":[],"date":"2005","doi":"10.1016\/j.tplants.2005.01.008","raw":"Karimi, M., De Meyer, B. and Hilson, P. (2005) Modular cloning in plant cells. Trends Plant Sci. 10, 103-105.","cites":null},{"id":43682403,"title":"Predicting transmembrane protein topology with a hidden Markov model: application to complete genomes.","authors":[],"date":"2001","doi":"10.1006\/jmbi.2000.4315","raw":"Krogh, A., Larsson, B., von Heijne, G. and Sonnhammer, E.L. (2001) Predicting transmembrane protein topology with a hidden Markov model: application to complete genomes. J. Mol. Biol. 305, 567-580.","cites":null},{"id":43682419,"title":"Protein import into chloroplasts: an ever-evolving story.","authors":[],"date":"2006","doi":"10.1139\/b06-050","raw":"Smith, M.D. (2006) Protein import into chloroplasts: an ever-evolving story. Can. J. Bot. 84, 531-542.","cites":null},{"id":43682420,"title":"Protein import into chloroplasts.","authors":[],"date":"2004","doi":"10.1038\/nrm1333","raw":"Soll, J. and Schleiff, E. (2004) Protein import into chloroplasts. Nat. Rev. Mol. Cell Biol. 5, 198-208.","cites":null},{"id":43682415,"title":"Rapid identification of Arabidopsis insertion mutants by nonradioactive detection of T-DNA tagged genes.","authors":[],"date":"2002","doi":"10.1046\/j.1365-313x.2002.01416.x","raw":"Ríos, G., Lossow, A., Hertel, B., Breuer, F., Schaefer, S., Broich, M., Kleinow, T., Jasik, J., Winter, J., Ferrando, A., Farras, R., Panicot, M., Henriques, R., Mariaux, J.B., Oberschall, A., Molnar, G., Berendzen, K., Shukla, V., Lafos, M., Koncz, Z., Redei, G.P., Schell, J. and Koncz, C. (2002) Rapid identification of Arabidopsis insertion mutants by nonradioactive detection of T-DNA tagged genes. Plant J. 32, 243-253.","cites":null},{"id":43682407,"title":"Reconstitution of protein targeting to the inner envelope membrane of chloroplasts.","authors":[],"date":"2006","doi":"10.1083\/jcb.200605162","raw":"Li, M. and Schnell, D.J. (2006) Reconstitution of protein targeting to the inner envelope membrane of chloroplasts. J. Cell Biol. 175, 249-259.","cites":null},{"id":43682410,"title":"The Arabidopsis plastidic glucose 6-phosphate\/phosphate translocator GPT1 is essential for pollen maturation and embryo sac development.","authors":[],"date":"2005","doi":"10.1105\/tpc.104.029124","raw":"Niewiadomski, P., Knappe, S., Geimer, S., Fischer, K., Schulz, B., Unte, U.S., Rosso, M.G., Ache, P., Flügge, U.I. and Schneider, A. (2005) The Arabidopsis plastidic glucose 6-phosphate\/phosphate translocator GPT1 is essential for pollen maturation and embryo sac development. Plant Cell 17, 760-775.","cites":null},{"id":43682404,"title":"The Arabidopsis ppi1 mutant is specifically defective in the expression, chloroplast import, and accumulation of photosynthetic proteins.","authors":[],"date":"2003","doi":"10.1105\/tpc.012955","raw":"Kubis, S., Baldwin, A., Patel, R., Razzaq, A., Dupree, P., Lilley, K., Kurth, J., Leister, D. and Jarvis, P. (2003) The Arabidopsis ppi1 mutant is specifically defective in the expression, chloroplast import, and accumulation of photosynthetic proteins. Plant Cell 15, 1859-1871.","cites":null},{"id":43682416,"title":"The Arabidopsis thaliana cDNAs coding for eIF4E and eIF(iso)4E are not functionally equivalent for yeast complementation and are differentially expressed during plant development.","authors":[],"date":"1998","doi":"10.1046\/j.1365-313x.1998.00047.x","raw":"Rodriguez, C.M., Freire, M.A., Camilleri, C. and Robaglia, C. (1998) The Arabidopsis thaliana cDNAs coding for eIF4E and eIF(iso)4E are not functionally equivalent for yeast complementation and are differentially expressed during plant development. Plant J. 13, 465-473.","cites":null},{"id":43682413,"title":"The evolutionary origin of the proteintranslocating channel of chloroplastic envelope membranes: identification of a cyanobacterial homolog.","authors":[],"date":"1999","doi":"10.1073\/pnas.96.2.784","raw":"Reumann, S., Davila-Aponte, J. and Keegstra, K. (1999) The evolutionary origin of the proteintranslocating channel of chloroplastic envelope membranes: identification of a cyanobacterial homolog. Proc. Natl. Acad. Sci. USA 96, 784-789.","cites":null},{"id":43682397,"title":"The function and diversity of plastid protein import pathways: a multilane GTPase highway into plastids.","authors":[],"date":"2006","doi":"10.1111\/j.1600-0854.2005.00382.x","raw":"Kessler, F. and Schnell, D.J. (2006) The function and diversity of plastid protein import pathways: a multilane GTPase highway into plastids. Traffic 7, 248-257.","cites":null},{"id":43682411,"title":"The Omp85-related chloroplast outer envelope protein OEP80 is essential for viability in Arabidopsis. Plant Physiol.","authors":[],"date":"2008","doi":"10.1104\/pp.108.122754","raw":"Patel, R., Hsu, S., Bédard, J., Inoue, K. and Jarvis, P. (2008) The Omp85-related chloroplast outer envelope protein OEP80 is essential for viability in Arabidopsis. Plant Physiol. 148, 235-245.","cites":null},{"id":43682414,"title":"The origin and establishment of the plastid in algae and plants.","authors":[],"date":"2007","doi":"10.1146\/annurev.genet.41.110306.130134","raw":"Reyes-Prieto, A., Weber, A.P. and Bhattacharya, D. (2007) The origin and establishment of the plastid in algae and plants. Annu. Rev. Genet. 41, 147-168.","cites":null},{"id":43682412,"title":"The preprotein translocase of the mitochondrial inner membrane: function and evolution.","authors":[],"date":"1999","doi":"10.1006\/jmbi.1998.2455","raw":"Rassow, J., Dekker, P.J., van Wilpe, S., Meijer, M. and Soll, J. (1999) The preprotein translocase of the mitochondrial inner membrane: function and evolution. J. Mol. Biol. 286, 105-120.","cites":null},{"id":43682400,"title":"Tic20 and Tic22 are new components of the protein import apparatus at the chloroplast inner envelope membrane.","authors":[],"date":"1998","doi":"10.1083\/jcb.143.4.991","raw":"Kouranov, A., Chen, X., Fuks, B. and Schnell, D.J. (1998) Tic20 and Tic22 are new components of the protein import apparatus at the chloroplast inner envelope membrane. J. Cell Biol. 143, 991-1002.","cites":null},{"id":43682421,"title":"Tic21 is an essential translocon component for protein translocation across the chloroplast inner envelope membrane.","authors":[],"date":"2006","doi":"10.1105\/tpc.106.044305","raw":"Teng, Y.S., Su, Y.S., Chen, L.J., Lee, Y.J., Hwang, I. and Li, H.M. (2006) Tic21 is an essential translocon component for protein translocation across the chloroplast inner envelope membrane. Plant Cell 18, 2247-2257.","cites":null},{"id":43682423,"title":"Toxoplasma gondii Tic20 is essential for apicoplast protein import.","authors":[],"date":"2008","doi":"10.1073\/pnas.0803862105","raw":"van Dooren, G.G., Tomova, C., Agrawal, S., Humbel, B.M. and Striepen, B. (2008) Toxoplasma gondii Tic20 is essential for apicoplast protein import. Proc. Natl. Acad. Sci. USA 105, 13574-13579.","cites":null},{"id":43682409,"title":"Translocation of proteins into mitochondria.","authors":[],"date":"2007","doi":"10.1146\/annurev.biochem.76.052705.163409","raw":"Neupert, W. and Herrmann, J.M. (2007) Translocation of proteins into mitochondria. Annu. Rev. Biochem. 76, 723-749.","cites":null},{"id":43682408,"title":"Two components of the chloroplast protein import apparatus, IAP86 and IAP75, interact with the transit sequence during the recognition and translocation of precursor proteins at the outer envelope.","authors":[],"date":"1996","doi":"10.1083\/jcb.134.2.315","raw":"Ma, Y., Kouranov, A., LaSala, S.E. and Schnell, D.J. (1996) Two components of the chloroplast protein import apparatus, IAP86 and IAP75, interact with the transit sequence during the recognition and translocation of precursor proteins at the outer envelope. J. Cell Biol. 134, 315-327.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-04-04","abstract":"The Tic20 protein was identified in pea (Pisum sativum) as a component of the chloroplast protein import apparatus. In Arabidopsis, there are four Tic20 homologues, termed atTic20-I, atTic20-IV, atTic20-II and atTic20-V, all with predicted topological similarity to the pea protein (psTic20). Analysis of Tic20 sequences from many species indicated that they are phylogenetically unrelated to mitochondrial Tim17-22-23 proteins, and that they form two evolutionarily conserved subgroups [characterized by psTic20\/atTic20-I\/IV (Group 1) and atTic20-II\/V (Group 2)]. Like psTic20, all four Arabidopsis proteins have a predicted transit peptide consistent with targeting to the inner envelope. Envelope localization of each one was confirmed by analysis of YFP fusions. RT-PCR and microarray data revealed that the four genes are expressed throughout development. To assess the functional significance of the genes, T-DNA mutants were identified. Homozygous tic20-I plants had an albino phenotype that correlated with abnormal chloroplast development and reduced levels of chloroplast proteins. However, knockouts for the other three genes were indistinguishable from the wild type. To test for redundancy, double and triple mutants were studied; apart from those involving tic20-I, none was distinguishable from the wild type. The tic20-I tic20-II and tic20-I tic20-V double mutants were albino, like the corresponding tic20-I parent. In contrast, tic20-I tic20-IV double homozygotes could not be identified, due to gametophytic and embryonic lethality. Redundancy between atTic20-I and atTic20-IV was confirmed by complementation analysis. Thus, atTic20-I and atTic20-IV are the major functional Tic20 isoforms in Arabidopsis, with partially overlapping roles. While the Group 2 proteins have been conserved over approximately 1.2 billion (1.2 × 109) years, they are not essential for normal development.Peer reviewedPost prin","downloadUrl":"www.blackwell-synergy.com.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/9255\/2\/Kasmati%20et%20al.%2c%202011%2c%20LRApdf.pdf","pdfHashValue":"37a95a8a38e054ff64200747371cb9c4535cac6a","publisher":"Blackwell Publishing in association with the Society for Experimental Biology","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/9255<\/identifier><datestamp>\n                2016-04-08T11:01:31Z<\/datestamp><setSpec>\n                com_2381_74<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_75<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nMolecular and genetic analyses of Tic20 homologues in Arabidopsis thaliana chloroplasts<\/dc:title><dc:creator>\nKasmati, Ali Reza<\/dc:creator><dc:creator>\nTöpel, Mats<\/dc:creator><dc:creator>\nPatel, Ramesh<\/dc:creator><dc:creator>\nMurtaza, Ghulam<\/dc:creator><dc:creator>\nJarvis, Paul<\/dc:creator><dc:description>\nThe Tic20 protein was identified in pea (Pisum sativum) as a component of the chloroplast protein import apparatus. In Arabidopsis, there are four Tic20 homologues, termed atTic20-I, atTic20-IV, atTic20-II and atTic20-V, all with predicted topological similarity to the pea protein (psTic20). Analysis of Tic20 sequences from many species indicated that they are phylogenetically unrelated to mitochondrial Tim17-22-23 proteins, and that they form two evolutionarily conserved subgroups [characterized by psTic20\/atTic20-I\/IV (Group 1) and atTic20-II\/V (Group 2)]. Like psTic20, all four Arabidopsis proteins have a predicted transit peptide consistent with targeting to the inner envelope. Envelope localization of each one was confirmed by analysis of YFP fusions. RT-PCR and microarray data revealed that the four genes are expressed throughout development. To assess the functional significance of the genes, T-DNA mutants were identified. Homozygous tic20-I plants had an albino phenotype that correlated with abnormal chloroplast development and reduced levels of chloroplast proteins. However, knockouts for the other three genes were indistinguishable from the wild type. To test for redundancy, double and triple mutants were studied; apart from those involving tic20-I, none was distinguishable from the wild type. The tic20-I tic20-II and tic20-I tic20-V double mutants were albino, like the corresponding tic20-I parent. In contrast, tic20-I tic20-IV double homozygotes could not be identified, due to gametophytic and embryonic lethality. Redundancy between atTic20-I and atTic20-IV was confirmed by complementation analysis. Thus, atTic20-I and atTic20-IV are the major functional Tic20 isoforms in Arabidopsis, with partially overlapping roles. While the Group 2 proteins have been conserved over approximately 1.2 billion (1.2 × 109) years, they are not essential for normal development.<\/dc:description><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPost print<\/dc:description><dc:date>\n2011-04-19T14:26:27Z<\/dc:date><dc:date>\n2011-04-19T14:26:27Z<\/dc:date><dc:date>\n2011-04-04<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nThe Plant Journal, 2011, 66 (5), pp. 877-889.<\/dc:identifier><dc:identifier>\n0960-7412<\/dc:identifier><dc:identifier>\nhttp:\/\/onlinelibrary.wiley.com\/doi\/10.1111\/j.1365-313X.2011.04551.x\/abstract<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/9255<\/dc:identifier><dc:identifier>\n10.1111\/j.1365-313X.2011.04551.x<\/dc:identifier><dc:identifier>\n1365-313X<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\n© 2011 The Authors.  The Plant Journal © 2011 Blackwell Publishing Ltd.  Deposited with reference to the publisher's archiving policy available from the journal Exclusive Licence Form, which permits posting of the accepted version of the Article as originally submitted for publication and updated to include any amendments made after peer review 12 months after publication.  The definitive version is available at www.blackwell-synergy.com.<\/dc:rights><dc:publisher>\nBlackwell Publishing in association with the Society for Experimental Biology<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["1365-313x","issn:1365-313X","0960-7412","issn:0960-7412"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2011,"topics":[],"subject":["Article"],"fullText":"CONFIDENTIAL\n \n \nMolecular and genetic analyses of Tic20 homologues \nin Arabidopsis thaliana chloroplasts \n \n \nAli Reza Kasmati1, Mats Töpel2, Ramesh Patel1, Ghulam Murtaza1,†, and \nPaul Jarvis1,* \n \n1\n Department of Biology, University of Leicester, University Road, Leicester LE1 7RH, United \nKingdom, and \n2\n Department of Plant and Environmental Sciences, Göteborg University, Box 461, SE-405 30 \nGöteborg, Sweden. \n \n* For correspondence (fax +44-116-252-3330; tel +44-116-223-1296; e-mail rpj3@le.ac.uk). \n \n \n†\n Present address: Department of Botany, City Campus, The University of AJK, Muzaffarabad 13100, \nPakistan. \n \n \nRunning Title: Arabidopsis tic20 mutants \nKeywords: Arabidopsis, chloroplast protein import, protein targeting, Tic20, TOC\/TIC machinery, \ntranslocon \n \nNumber of words: 6994 \nNumber of data displays: 9 figures, 1 table, 6 supplementary figures, 2 supplementary tables. \n \nPage 1 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 2 of 29 \nSUMMARY \n \nThe Tic20 protein was identified in pea as a chloroplast protein import apparatus component. In \nArabidopsis, there are four Tic20 homologues termed atTic20-I, atTic20-IV, atTic20-II, atTic20-V, all \nwith predicted topological similarity to the pea protein (psTic20). Analysis of Tic20 sequences from \nmany species indicated that they are phylogenetically unrelated to mitochondrial Tim17-22-23 proteins, \nand that they form two evolutionarily-conserved subgroups (characterized by psTic20\/atTic20-I\/IV \n[Group 1] and atTic20-II\/V [Group 2]). Like psTic20, all four Arabidopsis proteins have a predicted \ntransit peptide consistent with targeting to the inner envelope. Envelope localization of each one was \nconfirmed by analysis of YFP fusions. RT-PCR and microarray data revealed that the four genes are \nexpressed throughout development. To assess functional significance of the genes, T-DNA mutants \nwere identified. Homozygous tic20-I plants had an albino phenotype that correlated with abnormal \nchloroplast development and reduced levels of chloroplast proteins. However, knockouts for the other \nthree genes were indistinguishable from wild type. To test for redundancy, double and triple mutants \nwere studied; apart from those involving tic20-I, none was distinguishable from wild type. The tic20-I \ntic20-II and tic20-I tic20-V doubles were albino, like the corresponding tic20-I parent. In contrast, tic20-\nI tic20-IV double homozygotes could not be identified, due to gametophytic and embryonic lethality. \nRedundancy between atTic20-I and atTic20-IV was confirmed by complementation analysis. Thus, \natTic20-I and atTic20-IV are the major functional Tic20 isoforms in Arabidopsis, with partially \noverlapping roles. While the Group 2 proteins have been conserved over ~1.2 billion (1.2 × 109) years, \nthey are not essential for normal development. \nPage 2 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 3 of 29 \nINTRODUCTION \n \nMost chloroplast proteins are translated on cytosolic ribosomes and imported into plastids (Inaba and \nSchnell, 2008; Jarvis, 2008; Kessler and Schnell, 2006; Smith, 2006; Soll and Schleiff, 2004). They are \nsynthesized as precursors with N-terminal extensions called transit peptides, and are post-translationally \nimported after binding to the chloroplast outer envelope membrane. The cleavable transit peptide is \nessential for chloroplast targeting and translocation across the envelope membranes. Import is mediated \nby multiprotein complexes in the outer and inner envelope membranes, termed TOC and TIC \n(Translocon at the Outer\/Inner envelope membrane of Chloroplasts), respectively. \n Biochemical studies using pea chloroplasts identified several TOC and TIC components. The \ncore TOC system consists of preprotein receptors (Toc159 and Toc34) and a transmembrane channel \nprotein (Toc75). While several TIC components have been identified (Tic110, Tic62, Tic55, Tic40, \nTic32, Tic22, Tic21 and Tic20), their roles are not well understood (Inaba and Schnell, 2008; Jarvis, \n2008; Kessler and Schnell, 2006; Smith, 2006; Soll and Schleiff, 2004). Arguably the most crucial \nfunction of the TIC complex is channel formation, and yet there is uncertainty about the identity of the \nrelevant component(s); it has been suggested that Tic20 (Kouranov et al., 1998), Tic110 (Balsera et al., \n2009; Heins et al., 2002), and Tic21 (Teng et al., 2006) may each perform this role. Tic20 and Tic21 \nshare topological similarity and complementary expression patterns, and so it was initially proposed that \nthe former operates during early plant development with the latter taking over later on (Teng et al., \n2006). Nonetheless, both proteins have been detected together in a 1 MDa complex, and it is suggested \nthat this corresponds to the core, channel-forming TIC complex (Kikuchi et al., 2009). Interestingly, \nTic110 was absent from this assembly, suggesting that it acts later by serving as a scaffold to coordinate \nstromal chaperones (e.g., Hsp93) that bind to preproteins as they emerge from the translocon (Inaba et \nal., 2003). Such chaperones may drive translocation and\/or facilitate protein folding following transit \npeptide cleavage. \n The pea Tic20 (psTic20) protein was identified by chemical crosslinking and shown to be \nclose to preproteins engaged in import at an intermediate stage (Kouranov and Schnell, 1997; Ma et al., \n1996). It was initially proposed to have three transmembrane α-helices, but it now seems clear that there \nPage 3 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 4 of 29 \nare four such domains (Chen et al., 2002; Kouranov et al., 1998). The predicted topology of Tic20 \nmakes it a good candidate for the protein-conducting channel. Initial phylogenetic studies suggested a \ndistant relationship between Tic20 and bacterial branched-chain amino acid transporters (Reumann et \nal., 1999). Because such a relationship was also reported to exist between these transporters and channel \nproteins of the mitochondrial protein import machinery (Tim22 and Tim23) (Rassow et al., 1999), the \nnotion of a channel-forming role for Tic20 was further supported. Nonetheless, there is a lack of in vitro \nevidence to substantiate this proposal (Soll and Schleiff, 2004). \n Homologues of Tic20 have been identified in different species, including cyanobacteria, red \nand green algae, bryophytes, and the apicomplexan parasite, Toxoplasma gondii (Kalanon and \nMcFadden, 2008; van Dooren et al., 2008). Toxoplasma gondii Tic20 is an integral component of the \ninnermost membrane of the complex plastid found in this organism (the apicoplast; the relevant \nmembrane is equivalent to the inner envelope membrane of plant chloroplasts), and was predicted to be \nstructurally similar to psTic20. Furthermore, analysis of a null mutant revealed that T. gondii Tic20 is \nessential for parasite viability, and that its loss severely impairs apicoplast protein import (van Dooren \net al., 2008). \n Four different Tic20-related sequences were reported to exist in the Arabidopsis genome, and \nnamed according to their chromosomal locations: atTic20-I, atTic20-IV, atTic20-II and atTic20-V \n(Bédard and Jarvis, 2005; Kalanon and McFadden, 2008). Protein sequence identities shared between \nthese four and psTic20 were reported to be 62%, 35%, 25% and 25%, respectively, across the aligning \nregions (Bédard and Jarvis, 2005). Thus, while atTic20-I is likely the direct functional orthologue of \npsTic20, roles in protein import for the other Tic20 homologues cannot be excluded. Antisense \ntechnology was employed to elucidate the role of atTic20-I in vivo (Chen et al., 2002). The antisense \nplants exhibited a pale-green phenotype, growth defects, underdeveloped chloroplasts, and reduced \nlevels of chloroplast proteins. Protein import studies using chloroplasts isolated from atTic20-I \nantisense plants revealed a defect in preprotein translocation across the inner envelope (Chen et al., \n2002). More recently, complete knockout of atTic20-I was reported to cause albinism (Teng et al., \n2006), and this was correlated with an import defect with apparent specificity for photosynthesis-related \npreproteins (Kikuchi et al., 2009). \nPage 4 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 5 of 29 \n In this study, we analysed all four Arabidopsis Tic20-related sequences with the aim of \nelucidating their phylogenetic and functional interrelationships. \n \n \n \nRESULTS \n \nPhylogenetic analysis of Tic20 homologues in Arabidopsis \n \nAccording to our database searches, there are four Tic20 homologues in Arabidopsis (atTic20-I \n[At1g04940], atTic20-IV [At4g03320], atTic20-II [At2g47840] and atTic20-V [At5g55710]). Full-\nlength, sequenced cDNA clones are available for each gene (accession numbers AK117165, AF361633, \nAY050346 and BT001996, respectively), confirming that they are all expressed. Protein sequences \npredicted using these cDNAs were analysed in silico. TargetP predicted that all four Tic20 homologues \nhave a transit peptide with high confidence (Emanuelsson et al., 2000), which is consistent with \nlocalization to the inner envelope membrane (Hofmann and Theg, 2005). Moreover, analysis using \nTMHMM indicated that the four proteins are topologically similar to psTic20 (Krogh et al., 2001); i.e., \nthey each have four predicted transmembrane domains, and these are similarly located (Figure S1). \n To gain insight into the evolutionary (and, by extension, functional) relationships between the \nfour Arabidopsis proteins, the pea protein, and related proteins in other species, we conducted a \nphylogenetic analysis. Extensive database searches retrieved 59 sequences from 32 species, which were \nthen analysed in a Bayesian framework. The resulting tree (Figure 1) shows that a gene duplication \nhappened early in the evolution of eukaryote Tic20 proteins, resulting in two clades: Group 1 (including \npsTic20, atTic20-I and atTic20-IV) and Group 2 (including atTic20-II and atTic20-V), with \nrepresentatives from red algae and viridiplantae in both groups (the position of the three Phaeodactylum \nand Thalassiosira proteins in Group 2 implies that there are two Tic20 types in the chromalveolates as \nwell [see asterisks], although support for this is low and inconclusive). To assess whether the gene \nduplication happened in the eukaryotic lineage or in a pre-endosymbiotic organism, we conducted an \nPage 5 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 6 of 29 \nadditional phylogenetic analysis of the proteins in Figure 1 together with an extensive set of sequences \nfrom cyanobacteria (data not shown). This showed that cyanobacterial proteins do not belong in either \nGroup 1 or Group 2, and from this we conclude that the duplication happened after the endosymbiotic \nevent leading to the formation of chloroplasts ~1.5 billion years ago (Ga), but before the split into red \nalgae and viridiplantae (~1.2-1.5 Ga) (Butterfield, 2000; Reyes-Prieto et al., 2007; Yoon et al., 2004). \n It is noteworthy that many plant and algal species are represented in Group 1 and Group 2 \n(e.g., red and green algae, bryophytes and angiosperms), as this suggests that the proteins in both clades \nplay an important functional role, having been maintained over millions of years of evolution. Also \nworth noting is the long branch separating the land plant proteins (the clade including Picea, \nPhyscomitrella and the angiosperms) from the rest of the clade, in Group 1 but not in Group 2 (see \narrows in Figure 1). This indicates that an ancestral protein of Group 1 evolved much faster than the \nhomologue in Group 2, and that this evolutionary burst happened prior to, or during, adaptation to land \nlife in plants. Interestingly, the two major functional isoforms in Arabidopsis (atTic20-I and atTic20-IV; \nsee later) as well as psTic20 are derived from this ancestral protein (Figure 1). \n A phylogenetic analysis of Tic20-related sequences was reported previously (Kalanon and \nMcFadden, 2008), but this did not include such a large number of sequences and so was unable to reach \nthe three main conclusions of our analysis, which can be summarized as follows: (1) Group 1 and \nGroup 2 proteins separated ~1.2-1.5 Ga, after the evolution of chloroplasts; (2) red algae and \nviridiplantae, and possibly also chromalveolates, are represented in both groups; and (3) rapid evolution \nhas occurred in Group 1. \n Despite earlier reports indicating a phylogenetic relationship between Tic20, bacterial \nbranched-chain amino acid transporters, and the mitochondrial Tim17-22-23 proteins (Rassow et al., \n1999; Reumann et al., 1999), we could find no such link. Attempts to align the Tic20 dataset with these \nproteins (to include them in our phylogenetic analyses) failed, as homologous characters in the different \ndatasets could not be identified. Nonetheless, we tested the proposed similarity as follows. First, we \nmanually aligned a representative set of Tic20 and Tim17-22-23 proteins to the prokaryotic sequences, \nand adjusted the alignment according to that presented by Rassow et al. (1999). We then created four \nconsensus sequences, one for each of the following groups: atTic20\/psTic20, atTim17-22-23, scTim17-\nPage 6 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 7 of 29 \n22-23, and the prokaryote proteins (Figure S2). Consensus sequences are useful when comparing \ndistantly-related proteins as they only show conserved positions less prone to accumulate mutations; \ni.e., functional sites or positions required for maintenance of three-dimensional structure (Lesk and \nFordham, 1996). Our analysis shows that no position shares the same residue in all four consensus \nsequences, and that the Tic20 sequence does not match with the prokaryotic sequence in any position. \nTherefore, we conclude that the similarity previously reported between Tic20, the prokaryotic branched-\nchain amino acid transporters, and Tim17-22-23 is more likely the result of convergent evolution than \nevidence of homology. \n \n  \nAnalysis of Tic20 homologue localization \n \nTo provide experimental support for the TargetP predictions, the subcellular localization of the \nArabidopsis Tic20 homologues was assessed by analysing YFP fusion proteins. Full-length coding \nsequences for each of the four genes were inserted into a vector that adds a C-terminal YFP tag. \nArabidopsis protoplasts were then transfected using these constructs, and analysed by fluorescence \nmicroscopy (Figure 2). The red fluorescent signal of chlorophyll shows the location of the chloroplasts \nin each case. For all four fusion proteins, the yellow-green fluorescence of YFP was observed in a ring-\nlike pattern around the periphery of each chloroplast. This pattern was strongly reminiscent of the \ndistributions seen for atTic110:YFP and atTic40:YFP fusion proteins in a previous study (Bédard et al., \n2007), indicating that the Arabidopsis Tic20 homologues are all targeted to the chloroplast envelope. \nConsidering that most outer envelope proteins do not possess a transit peptide (as the four Arabidopsis \nTic20 homologues do) (Hofmann and Theg, 2005), and the aforementioned topological and \nphylogenetic similarities between the Arabidopsis proteins and psTic20, these results strongly support \nthe hypothesis that Arabidopsis Tic20 homologues are localized in the chloroplast inner envelope \nmembrane. \n \n \nPage 7 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 8 of 29 \nExpression profiles of the Arabidopsis TIC20 homologues \n \nTo gain insight into the functional relationships between the Arabidopsis Tic20 homologues, their \ndevelopmental and tissue-specific gene expression patterns were studied by quantitative real time RT-\nPCR (Figure 3). The results indicated that atTIC20-I expression is highest in mature photosynthetic \ntissues (e.g., 14 dL and Rosettes; Figure 3), and relatively weak in non-photosynthetic tissues (5 dD and \nRoots; Figure 3). This suggests that atTIC20-I may be relatively more important for photosynthetic \ndevelopment, which is in-line with previous observations (Kikuchi et al., 2009), including those made \nin relation to the dominant isoforms of the TOC receptors (Bauer et al., 2000; Kubis et al., 2003). \n The expression pattern of atTIC20-IV was different, and somewhat complementary to that of \nthe other Group 1 gene, with low levels in rosette leaves and relatively high levels in non-\nphotosynthetic tissues (Figure 3). Thus, atTIC20-IV may be relatively more important for non-\nphotosynthetic development. In general, this gene was expressed at lower levels than atTIC20-I, \nindicating that atTic20-I is the dominant isoform amongst the Group 1 proteins. Indeed, database \nsearches using the BLAST program (Altschul et al., 1990) detected 90 expressed sequence tags (ESTs) \nfor atTIC20-I and just 25 for atTIC20-IV. Nonetheless, expression of atTIC20-IV did exceed that of \natTIC20-I in roots (Figure 3). \n The two Group 2 genes (atTIC20-II and atTIC20-V) were expressed at relatively high levels \nthroughout development, and shared similar patterns of expression (Figure 3); EST numbers detected \nwere 92 and 95, respectively. The expression profiles of atTIC20-II and atTIC20-V were both more \nsimilar to that of atTIC20-I than to that of atTIC20-IV (amongst the Group 1 genes); nonetheless, the \nphotosynthetic vs. non-photosynthetic expression intensity differential was considerably less for \natTIC20-II than for atTIC20-V, and so in this sense the profile of the former was relatively more similar \nto that of atTIC20-IV. \n To corroborate the aforementioned conclusions, publicly-available microarray data were \nanalysed using the Genevestigator tool (Zimmermann et al., 2004). This revealed that three of the four \nArabidopsis Tic20 genes are expressed throughout the plant’s life-cycle (Figure S3); unfortunately, \natTIC20-I could not be analysed due to the absence of a reliable probe-set from the Affymetrix \nPage 8 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 9 of 29 \nmicroarray (Teng et al., 2006). The two Group 2 genes exhibited similar patterns of expression at \nroughly equivalent levels. In agreement with the RT-PCR data, atTIC20-IV exhibited low levels of \nexpression in mature photosynthetic tissues, while markedly higher expression in mature siliques and \ngerminating seeds (neither of which was analysed by RT-PCR) suggested that atTIC20-IV may be \nparticularly important during seed development.  \n It should be borne in mind that relative transcript levels (as determined in these studies) do not \nnecessarily reflect protein abundances. Thus, in the future, when suitable isoform-specific antibodies \nbecome available, it will be prudent to provide final confirmation of these expression patterns by \nimmunoblotting. \n \n \nIdentification and analysis of Arabidopsis Tic20 T-DNA insertion mutants \n \nTo elucidate the functional significance of the Arabidopsis Tic20 homologues in vivo, we identified two \nindependent T-DNA insertion mutants for each of the four genes. Firstly, all T-DNA insertion sites \nwere confirmed by genomic PCR, and by sequencing the T-DNA\/gene junctions at one or both sides, as \nindicated (Figure 4a). Segregation analysis was performed to ensure identification of only single-locus \ninsertion lines; a Mendelian ratio of three antibiotic-resistant plants to one antibiotic-sensitive plant \nindicates the presence of a single T-DNA insertion (Table S2). Further segregation analysis identified \nhomozygous lines for analysis, and the zygosity of these was confirmed by genomic PCR (Figure S4). \n The effect of each T-DNA insertion on Tic20 gene expression was assessed by RT-PCR \n(Figure 4b). This confirmed that the relevant full-length mRNA was absent for all of the mutants except \ntic20-I-2, tic20-II-1 and tic20-II-2; these three displayed expression levels reduced to 29.0%, 8.4% and \n58.0% of that in the wild type, respectively, and so are considered to be knockdown alleles (Figure 4c). \nThe other five mutants are all true knockout alleles. \n \n \n \nPage 9 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 10 of 29 \nThe tic20-I mutants exhibit albinism and severe defects in chloroplast biogenesis \n \nAmongst the mutants identified, only tic20-I-1 and tic20-I-2 exhibited a phenotype that was obviously \ndifferent from wild type. In populations segregating for these two mutations, significant numbers of \nindividuals exhibited a striking albino-like appearance (Table S2). Co-segregation of the albino \nphenotypes with the T-DNA insertions was confirmed by PCR analysis; we genotyped 25 albinos and \n38 green plants from tic20-I-1 populations, and 38 albinos and 65 greens from tic20-I-2 populations; all \nalbinos were found to be homozygous mutant, whereas the greens were either heterozygous or wild \ntype. The proportion of homozygous albino plants in such populations was frequently less than the 25% \nexpected for normal inheritance (particularly for the knockout allele, tic20-I-1), suggesting that the \nhomozygotes have reduced viability at an early developmental stage.  \n Plants carrying these two mutations are shown in Figure 5a; the atToc159 knockout mutant, \nplastid protein import 2 (ppi2), is shown for comparison purposes, as this mutant also exhibits an albino \nphenotype (Bauer et al., 2000). Interestingly, we observed that tic20-I-2 plants are slightly larger than \ntic20-I-1 plants, and that they are somewhat greener in appearance (Figure 5a); this is consistent with \nthe observation that tic20-I-2 is a knockdown allele (Figure 4b). The ppi2 mutant grew to a larger size \nthan either of the tic20-I mutants, which may reflect the continued expression of related TOC receptor \nproteins in ppi2 (Kubis et al., 2004). \n Impaired greening in the tic20-I mutants suggested defective chloroplast development, and so \nplastid ultrastructure was analysed by electron microscopy (Figure 6). In tic20-I-1 plants, hardly any \nchloroplast development was observed: the plastids did not contain any thylakoid membranes, and a \nsignificant proportion were found to contain large inclusions or were surrounded by multilayered \nenvelope membrane structures. By contrast, while chloroplasts in the tic20-I-2 mutant were much \nsmaller than those in wild type, they did exhibit significant thylakoid membrane development, \nespecially after 14 days; this is consistent with the greener appearance of plants carrying this allele \n(Figure 5a). Taken together, these data support the notion that atTic20-I is essential for chloroplast \nbiogenesis and development. Figure 6 also shows that the development of ppi2 plastids is severely \nPage 10 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 11 of 29 \ndisturbed, as was reported previously (Bauer et al., 2000; Kubis et al., 2004), although the defect is less \nsevere than that in tic20-I-1 as inclusions and multilayered structures were not apparent. \n To further characterize the chloroplast developmental defect in the tic20-I mutants, levels of \nseveral chloroplast proteins were assessed by immunoblotting. These studies focused on components of \nthe protein import machinery (Figure 7a,c), and various components of the photosynthetic or \nbiochemical apparatus (Figure 7b,d). In each case, the visibly similar ppi2 mutant was included as a \ncontrol. Surprisingly, levels of most of the translocon components investigated were not dramatically \naffected by the tic20 mutations. For the Toc proteins, this may reflect the fact that the TIC machinery is \nnot required for their biogenesis. On the other hand, the Tic110 and Tic40 proteins are predicted to \nrequire a functional TIC apparatus for proper import and assembly, via the post-import pathway (Li and \nSchnell, 2006; Tripp et al., 2007). While these two Tic proteins are somewhat depleted in tic20 plants, \nthe effect is not strong, and so it is possible that compensatory mechanisms (e.g., reduced turnover) are \nactivated that help to maintain their levels and so compensate for the loss of Tic20. Dramatic effects \nwere observed in relation to components of the photosynthetic apparatus (LHCP, OE33 and FNR), with \namounts reduced to less than 10% of that seen in the wild type. In addition, the tetrapyrrole biosynthetic \nenzyme, CPO, was also strongly depleted in the tic20 mutants, providing a further indication that plastid \nbiogenesis is strongly disrupted. \n \n \nGenetic interactions between tic20-I and the other tic20 mutations \n \nTo study functional relationships between atTic20-I and the other three genes, tic20-I heterozygotes \n(both alleles) were crossed to the other mutants. Individual green plants from resulting F2 (or F3, in the \ncase of tic20-I-1 tic20-V-1) generations were genotyped, and plants that were heterozygous for tic20-I \nand homozygous for each of the other tic20 mutations were identified. For all such double mutants \ninvolving tic20-II and tic20-V, albino plants were observed in the subsequent generation, following self-\npollination, at the expected frequency (Table 1); for each of the four relevant crosses, ten albino plants \nwere genotyped and shown to be double homozygotes (data not shown). Moreover, these double-\nPage 11 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 12 of 29 \nhomozygous albino plants were not phenotypically different from the corresponding tic20-I single-\nmutant parent (Figure 5b). This suggests that atTic20-I shares little or no functional redundancy with \nthe Group 2 proteins. \n By contrast, in the F3 progeny of the tic20-1 tic20-IV double mutants, no albinos were \nobserved (Table 1). Our failure to identify any albinos amongst >3000 F3 or F4 individuals suggested \nthat the double homozygotes are not viable. To ensure that the double homozygotes were not amongst \nthe green individuals, ~30-60 such plants from each cross were PCR-genotyped; none of them was \nfound to be double homozygous (data not shown). To investigate the possibility that the double \nhomozygous genotypes were embryo lethal, the siliques of individuals that were heterozygous for tic20-\nI and homozygous for tic20-IV were studied. In each case, we observed a significant number of very \nsmall, brown aborted seeds, and a much larger proportion of even smaller, white failed ovules (Figure \n8a). Detailed scoring revealed the frequencies of these defective structures to be ~5-10% and ~40-50%, \nrespectively (Figure 8b). This implied a strong but incomplete defect in female gametophyte \ndevelopment, and furthermore indicated that any double homozygotes that do form arrest during \nembryo and seed development. \n To test the hypothesis that the tic20-I tic20-IV double mutations affect female gametophytic \ntransmission, we conducted reciprocal crossing experiments between the double mutants and wild type \n(Figure 8c). The results revealed essentially normal transmission through the male gametes \n(transmission efficiency was 93.6%), and a strong defect in transmission through the female gametes \n(34.4%) (Howden et al., 1998). These results are consistent with phenotypic observations made upon \nanalysing the double-mutant siliques (Figure 8a,b), and with the conclusions drawn there from. \n \n \nAnalysis of single, double and triple mutations affecting atTic20-IV, atTic20-II and atTic20-V \n \nNone of the tic20-IV, tic20-II and tic20-V single mutants was detectably different from wild type. To \ninvestigate the possibility that this might be due to functional redundancy, we proceeded to identify a \nseries of double- and triple-mutant combinations. For all tested combinations, doubly or triply \nPage 12 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 13 of 29 \nhomozygous mutant plants could be identified. However, none of these plants exhibited an obvious \nmutant phenotype, and in each case chlorophyll content and photosynthetic performance was similar to \nthat in wild type (Figure S5). This suggests that the three genes do not play major roles in chloroplast \ndevelopment under the conditions tested, and implies that they share little or no functional redundancy. \nIt is not surprising that no genetic interactions were detected between tic20-IV and the Group 2 \nmutations, as the tic20-I mutations also did not exhibit detectable interaction with either tic20-II or \ntic20-V (Figure 5b; Table 1). It is possible that our failure to identify a complete knockout for atTic20-II \nis responsible for the lack of any detectable interactions amongst the Group 2 mutants. However, this \nseems unlikely as in the tic20-II-1 allele at least, a very strong reduction in transcript abundance was \nobserved (Figure 4). A more likely explanation is that the Group 2 proteins only play a significant role \nunder non-standard conditions that were not assessed in our studies. \n \n \nAnalysis of functional interrelationships by complementation analysis \n \nTo further investigate the possibility of redundancy between the different Arabidopsis Tic20 \nhomologues, we attempted to complement the tic20-I-1 mutant with different Tic20 overexpressor \nconstructs. Heterozygous +\/tic20-I-1 plants were transformed with constructs comprising the atTIC20-I, \natTIC20-IV, atTIC20-II and atTIC20-V coding sequences under the control of the cauliflower mosaic \nvirus 35S promoter. For each construct, a total of ~8-10 transformants were identified, and from these \nfour independent lines were selected on the basis of overexpression of the relevant TIC20 transgene, as \nestimated by RT-PCR. The genotypes of the transformants were all verified by genomic PCR. \n As expected, the 35S:TIC20-I control construct was very effective at mediating \ncomplementation of tic20-I-1 (Figure S6). In accordance with the phylogenetic and double-mutant \nanalyses indicating a close relationship between atTic20-I and atTic20-IV (Figures 1 and 8), the \n35S:TIC20-IV construct also mediated significant complementation (Figure 9). However, while the \n35S:TIC20-IV transformants grew to a significantly larger size than the untransformed control plants, \nthis construct was not able to restore normal greening to tic20-I, unlike the control 35S:TIC20-I \nPage 13 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 14 of 29 \nconstruct. This indicated significant but incomplete functional redundancy between atTic20-I and \natTic20-IV. \n By contrast, 35S:TIC20-II and 35S:TIC20-V constructs did not mediate any detectable \ncomplementation of tic20-I-1, in any of the transformants identified (Figure S6). One caveat is that we \nwere unable to identify transformants (for either of these constructs) that exhibited very high levels of \noverexpression, in contrast with the situation for the Group 1 constructs. The reason for this is \nuncertain, although it may relate to transcript stability. Nonetheless, our genetic analyses (Figures 5b \nand S5) do suggest that, even with higher levels of overexpression, a positive complementation result \nwould be unlikely in these experiments. \nPage 14 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 15 of 29 \nDISCUSSION \n \nFour Arabidopsis Tic20 genes were identified previously based on similarity with the original isolate \nfrom pea (Bédard and Jarvis, 2005; Kalanon and McFadden, 2008). Here we show that these four \nhomologues are expressed, that they are likely to be topologically similar to the pea protein, and that \nthey are targeted to the chloroplast envelope (Figures S1 and 2). Phylogenetic analysis of a large \nnumber of sequences revealed two evolutionarily conserved sub-classes, termed Group 1 (characterized \nby psTic20, atTic20-I and atTic20-IV) and Group 2 (characterized by atTic20-II and atTic20-V) (Figure \n1). The former is more important in Arabidopsis, as the loss of these proteins results in albinism or \ndevelopmental arrest during gametophyte or embryo development. The albino phenotype of the tic20-I \nT-DNA lines (Figure 5) is consistent with previous results (Teng et al., 2006), and with the observation \nthat antisense-mediated down-regulation of atTIC20-I inhibits greening (Chen et al., 2002). Our genetic \nand complementation analyses demonstrated that the two Arabidopsis Group 1 proteins share functional \nredundancy (Figures 8 and 9), although the redundancy is incomplete as overexpression of atTic20-IV \ncould only partially complement tic20-I-1. \n All four Arabidopsis Tic20 genes are expressed throughout development (Figures 3 and S3). \nNonetheless, atTIC20-I and atTIC20-IV do exhibit quite different patterns of expression, suggesting that \nthe former is relatively more important for photosynthetic development, and that the latter acts during \nnon-photosynthetic growth and seed development. High expression of atTIC20-IV in seeds is consistent \nwith the observation that its inactivation, in conjunction with tic20-I, causes developmental arrest \nduring female gametogenesis or embryogenesis. That the two genes exhibit distinct expression patterns, \nbiased in favour of either photosynthetic or non-photosynthetic growth, parallels observations made in \nrelation to the TOC receptors, Toc159 and Toc33 (Bauer et al., 2000; Gutensohn et al., 2000; Jarvis et \nal., 1998; Kubis et al., 2003; Kubis et al., 2004). Analyses of different isoforms of these receptors \nindicated that the dominant one in each case (atToc159 and atToc33, respectively) is specialized for the \nimport of highly-abundant, photosynthesis-related preproteins, and that the lesser isoforms (atToc132, \natToc120 and atToc34) preferentially mediate import of low-abundance, housekeeping preproteins. In \nthis regard, it is noteworthy that analysis of tic20-I plants using an in vivo import assay revealed a \nPage 15 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 16 of 29 \nstrong effect on the import of a photosynthetic precursor, but little effect on a housekeeping protein \n(Kikuchi et al., 2009). \n One hypothesis accounting for the sub-functionalization of TOC receptors holds that this \nprevents damaging competition effects between preproteins; in the absence of such client-specific \nreceptor complexes, the bulk-flow of photosynthetic precursors might interfere with the import of other \npreproteins (Jarvis, 2008; Kessler and Schnell, 2006). It has been suggested that the different import \npathways converge at the TIC machinery, based on observations that some TIC components (e.g., \nTic110) have not undergone similar sub-functionalization in Arabidopsis (Kovacheva et al., 2005). \nHowever, recent evidence suggests that there may be at least two different TIC complexes, and that the \none containing Tic110 acts downstream of that containing Tic20 (Kikuchi et al., 2009). If this is the \ncase, it is possible that the aforementioned client-specific import pathways do extend to the inner \nmembrane (at Tic20), and that convergence only happens later at Tic110. That is, there may be distinct \nTic20-containing channel complexes (e.g., containing either atTic20-I or atTic20-IV), but just a single \nTic110-containing chaperone complex. \n Several TOC\/TIC components are known to be essential during embryogenesis (Baldwin et \nal., 2005; Hust and Gutensohn, 2006; Inaba et al., 2005; Kovacheva et al., 2005; Patel et al., 2008), but \nthere have been few reports of lesions in chloroplast proteins leading to gametophyte arrest. Examples \nare the gpt1 mutations that affect the glucose 6-phosphate\/phosphate translocator (GPT) of the inner \nenvelope membrane (Niewiadomski et al., 2005). However, in contrast with the Group 1 Tic20 mutants, \ngpt1 mutants exhibited defective transmission through both male and female gametes; these effects \nwere attributed to a reduced supply of reducing equivalents via the oxidative pentose phosphate \npathway, which in turn affects fatty acid synthesis leading to defective membrane biogenesis. That the \ngametophytic defects in tic20-I tic20-IV are less severe suggests that the Tic20 complex is not essential \nfor the biogenesis of inner membrane carrier proteins such as GPT, or that pre-meiotically synthesized \nTic20 persists long enough to mediate sufficient GPT biogenesis. \n Another example of plastid-linked defective gametogenesis occurs in the Arabidopsis Hsp93 \ndouble mutant (Kovacheva et al., 2007). Transmission of hsp93-V-1 hsp93-III-2 through female \ngametes was reduced to 46.8%, and consequently a significant number of failed ovules were observed \nPage 16 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 17 of 29 \nin heterozygous double-mutant plants. These results are similar to those reported here, although the \nfemale transmission efficiency defect was stronger in the case of tic20-I tic20-IV (at 34.4%), and so a \ngreater proportion of defective reproductive structures (mostly failed ovules) was observed. This \nseverity of the Group 1 Tic20 double-mutant phenotype during reproductive growth (Figure 8) parallels \nthat seen in single-mutant tic20-I plants (which are even more sick than the ppi2 albino; Figure 5), and \nsuggests that Tic20 plays a crucial role in the import mechanism (e.g., translocation channel formation). \n The roles of the Group 2 Tic20 proteins remain uncertain, as no mutant phenotypes were \ndetected in any of the mutant genotypes analysed (Figure S5). Nonetheless, because these genes are \nexpressed at high levels (Figure 3) and have been conserved over millions of years of evolution in many \nspecies (Figure 1), it seems likely that they do perform some important role. One possibility is that they \nare somehow analogous to Tim17 in mitochondria; the role of this protein is uncertain, although it has \nbeen proposed to regulate channel formed by the related protein, Tim23 (Neupert and Herrmann, 2007). \nIn contrast with the Group 2 Tic20 proteins, however, Tim17 is essential for viability in yeast. It is \nconceivable that the roles of atTic20-II and atTic20-V become critical only under non-standard \nconditions that were not tested during the course of this study. \n \n \nPage 17 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 18 of 29 \nEXPERIMENTAL PROCEDURES \n \nPhylogenetics and consensus sequence analysis \n \nIn total, 59 sequences from the Tic20 protein family were obtained by BLAST queries of databases at \nNCBI (http:\/\/www.ncbi.nlm.nih.gov\/), DOE Joint Genome Institute (http:\/\/genome.jgi-psf.org\/), and the \nCyanidioschyzon merolae genome project (http:\/\/merolae.biol.s.u-tokyo.ac.jp\/) (Table S1). The \nsequences were aligned with mafft-linsi v.6.717b (Katoh et al., 2005) and the N-terminal part of the \nmatrix (starting at position 83 of the psTic20 sequence) was analysed with MrBayes v.3.2 (Huelsenbeck \nand Ronquist, 2001) under the mixed amino acid model. For further details, see Appendix S1. \n Representative sequences from the Tic20 and Tim17-22-23 protein families were aligned to \nfour prokaryotic sequences using mafft-linsi v.6.717b (Katoh et al., 2005) and manually adjusted \naccording to the alignment presented by Rassow et al. (1999). Consensus sequences were created in \nSeaView v.4.2 (Gouy et al., 2010) using the default settings. For further details, see Appendix S1. \n \n \nPlant growth conditions \n \nArabidopsis thaliana plants were Columbia-0 ecotype, and were grown as described previously \n(Aronsson and Jarvis, 2002). To select for T-DNA insertions, antibiotics were added to the MS \nmedium: kanamycin monosulfate, 50 µg\/ml (tic20-I-1, tic20-I-2, tic20-II-1 and tic20-V-2); DL-\nphosphinothricin, 10 µg\/ml (tic20-IV-1 and pB2GW7 transformants); hygromycin B, 15 µg\/ml (tic20-\nIV-2 and tic20-V-1); and sulfadiazine, 11.25 µg\/ml (tic20-II-2).  \n \n \n \n \nPage 18 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 19 of 29 \n Protoplast transfection and subcellular localization analysis \n \nFull-length Tic20 coding sequences, each one lacking the native stop codon, were PCR-amplified and \ninserted into the p2GWY7 vector (Karimi et al., 2005); for primer sequences, see Appendix S1. \nProtoplasts were prepared from 14-day-old, wild-type plants, and transfected, as described previously \n(Bédard et al., 2007). Fluorescence microscopy employed a Nikon Eclipse TE-2000E inverted \nmicroscope equipped with filters for analysing YFP (exciter HQ500\/20x, emitter HQ535\/30m) and \nchlorophyll autofluorescence (exciter D480\/30x, emitter D660\/50m) (Chroma Technologies). \n \n \nQuantitative real-time (QPCR) and standard RT-PCR  \n \nRNA was isolated using an RNeasy Plant Mini Kit (Qiagen, Hilden, Germany), and treated with DNAse \nI. Reverse transcription was performed as described previously (Kovacheva et al., 2005; Kovacheva et \nal., 2007); see Appendix S1 for more detail.  \n For QPCR, three biological replicates were analysed, and each one was measured in triplicate \nusing a Chromo4 Gradient Cycler (MJ Research) and SYBR Green Jump Start Taq Ready Mix (Sigma). \nData were normalized using similarly-derived ACTIN2 (At3g18780) data. \n For semi-quantitative analysis, RT-PCR products were resolved by electrophoresis and stained \nwith SYBR Safe (Invitrogen). To avoid saturation, only 25 amplification cycles were employed. Bands \nwere quantified using ImageQuant (GE Healthcare), and data were normalized using equivalent eIF4E1 \nvalues (Rodriguez et al., 1998). \n \n \nIdentification and analysis of the Tic20 mutants \n \nThe tic20-I-1, tic20-I-2, tic20-II-1and tic20-V-2 mutants were from the Salk Institute Genomic Analysis \nLaboratory (lines SALK_039676, SALK_071877, SALK_064931 and SALK_013444, respectively) \nPage 19 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 20 of 29 \n(Alonso et al., 2003; Teng et al., 2006). The tic20-IV-1 mutant was from Syngenta (line Garlic_97_F10) \n(Sessions et al., 2002). The tic20-IV-2 and tic20-V-1 mutants were from the Csaba Koncz laboratory \n(pool 113, line 11324 and pool 53, line 5290, respectively) (Ríos et al., 2002). The tic20-II-2 mutant \nwas from GABI-Kat (line 879A01) (Rosso et al., 2003). Mutant genotypes were assessed by PCR (see \nFigure S4 and Appendix S1). The location of each T-DNA insertion was determined precisely (Figure \n4a) by sequencing junction-spanning PCR products. \n Transmission electron microscopy was performed as described previously (Aronsson et al., \n2007), with minor modifications (see Appendix S1). Immunoblotting employed previously described \nprocedures (Kovacheva et al., 2005; Kovacheva et al., 2007), using secondary antibodies conjugated to \neither alkaline phosphatase or horseradish peroxidase. For further details, see Appendix S1. \n \n \nComplementation experiments \n \nFull-length Tic20 coding sequences, each one retaining the native stop codon, were PCR-amplified and \ninserted into the pB2GW7 vector (Karimi et al., 2005); for primer sequences, see Appendix S1. \nConstructs were stably introduced into wild-type plants using the floral dip method (Clough and Bent, \n1998). Transformants were identified by screening on MS medium containing phosphinothricin. \nHomozygotes were identified in the T3 or T4 generations. \n \n \n \nPage 20 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 21 of 29 \nACKNOWLEDGEMENTS \n \nWe thank Natalie Allcock and Stefan Hyman for electron microscopy, Sybille Kubis for assistance with \nthe YFP studies, and Anthony Wardle for technical support. We thank Jocelyn Bédard (atToc33, \natTic40) and Feijie Wu (atToc75-III, atToc120) for preparing antigens for immunization, and Bernhard \nGrimm, Neil Hoffman, Felix Kessler, and Henrik Scheller for providing antibodies. This work was \nsupported by a Biotechnology and Biological Sciences Research Council (BBSRC) PhD studentship, by \nthe Royal Society Rosenheim Research Fellowship, and by BBSRC grants 91\/C18638, BBS\/B\/03629, \nBBS\/C006348\/1, BB\/D016541\/1 and BB\/F020325\/1 (to P.J.). \n \n \n \nTABLES \n \nTable 1. Segregation of the albino phenotype in various tic20-I double-mutant populations. \nPage 21 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 22 of 29 \nFIGURE LEGENDS \n \nFigure 1. Phylogenetic analysis of Tic20-related sequences from different species. \nAmino acid sequences of Tic20 homologues were aligned and used to produce a phylogenetic tree; the \nN-terminal part of the matrix, equivalent to the first 82 residues of psTic20 (Kouranov et al., 1998), was \nexcluded before the analysis. Eukaryote sequences form two major clades, termed Group 1 and Group \n2. Arrows indicate branches of differing lengths leading to land plant proteins in the two groups. \nChromalveolate sequences are indicated with asterisks. Branch lengths in the phylogram are \nproportional to the number of expected changes (see scale). Posterior probability values appear above \nthe branches. \n \n \nFigure 2. Subcellular localization of the Arabidopsis Tic20 proteins as assessed by YFP fusion-protein \nanalysis. \nWild-type Arabidopsis protoplasts were transfected with the indicated plasmids (atTic20-I:YFP, \natTic20-IV:YFP, atTic20-II:YFP and atTic20-V:YFP) and then analysed for YFP fluorescence (green, \nleft panels) and chlorophyll autofluorescence (red, centre-left panels), as well as under bright field \nillumination (right panels). An overlay of the YFP and chlorophyll images is presented (centre-right \npanels). Scale bars = 10 µm. \n \n \nFigure 3. Expression of the Tic20 genes in different tissues and at different developmental stages.  \nQuantitative RT-PCR analysis of total-RNA from whole seedlings grown in vitro for five days in the \ndark (5dD), or five and 14 days in the light (5dL and 14dL, respectively), as well as from three different \ntissues of mature plants gown on soil (roots, rosette leaves, and siliques). RNA samples were \nrepresentative of ~10-30 seedlings (5dD, 5dL and 14dL), or 5-25 mature plants (roots, rosettes and \nsiliques). Tic20 data were normalized relative to the control gene, ACTIN2 (At3g18780), and then \nexpressed relative to the atTIC20-I 5dL value. Data shown were derived from three independent \nPage 22 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 23 of 29 \namplifications done on three biological replicates. Panels (a) and (b) contain the same data presented in \ndifferent ways. \n \n \nFigure 4. Molecular characterization of the Tic20 T-DNA insertion lines. \n(a) Diagrams showing the structure of each gene and the locations of T-DNA insertions. Protein-coding \nexons are represented by black boxes, untranslated regions by white boxes, and introns by thin lines \nbetween the boxes. Locations of RT-PCR primers are shown by arrows beneath each gene model. T-\nDNA insertion sites are indicated precisely, but insertion sizes are not to scale. ATG, translation \ninitiation codon; Stop, translation termination codon; p(A), polyadenylation site; LB, T-DNA left \nborder; RB, T-DNA right border. \n(b) Expression of Tic20 genes in wild-type and mutant plants was analysed by RT-PCR. Locations of \nthe amplification primers are shown in (a). Similar analysis of atTOC33 and of the translation initiation \nfactor gene, eIF4E1 (At4g18040), was used to normalize loading. Amplicon sizes are indicated at right \n(in kb). RNA samples were from whole, 10-day-old homozygous plants grown in vitro, and were \nrepresentative of ~20-30 seedlings. \n(c) Semi-quantitative RT-PCR analysis of tic20-I-2, tic20-II-1 and tic20-II-2. This was necessary \nbecause data in (b) revealed that these mutants are not null; it was conducted essentially as described in \n(b). Values shown are means (±SE) derived from four independent amplifications, and are expressed as \npercentages of the wild-type value. Data were normalized relative to eIF4E1. PCR amplifications were \nperformed over 25 cycles. \n \n \nFigure 5. Albino phenotypes of tic20-I single- and double-mutant plants. \nPopulations segregating for the indicated tic20-I mutation, either in the wild-type background (a) or in \nthe indicated homozygous tic20-II or tic20-V mutant background (b), were plated on standard MS \nmedium. After eight days, homozygous albino mutants were rescued to medium containing 3% sucrose \n(they are unable to survive photoautotophically) and grown until they were 43 days old. Representative \nPage 23 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 24 of 29 \nplants were photographed. A similarly-grown ppi2 mutant is shown for comparison (a). Plants were \nilluminated with dim light (~10 µmol\/m2\/sec), under a standard long-day cycle, to aid growth. \n \n \nFigure 6. Plastid ultrastructure in the tic20-I single mutants. \nCotyledons of 10- and 14-day-old plants (10d and 14d, respectively) were analysed by transmission \nelectron microscopy. Seeds were plated on standard MS medium; after five days, homozygous albino \nmutants were rescued to medium containing 3% sucrose. On average, ~30 whole-chloroplast \nmicrographs from each of three independent plants per genotype per age (a minimum of 55 chloroplasts \nper genotype per age) were analysed, and used to select the representative images shown. Size bars = \n1.0 µm. \n \n \nFigure 7. Chloroplast protein levels in Tic20-deficient mutants. \n(a,b) Equal protein samples (20 µg) from 10-day-old homozygous, MS-grown plants of the indicated \ngenotypes were analysed by immunoblotting using the antibodies shown. LHCP, light-harvesting \nchlorophyll-binding protein; OE33, oxygen-evolving complex, 33 kD subunit; FNR, ferredoxin-NADP \nreductase; CPO, coproporphyrinogen oxidase; H3, histone H3. \n(c,d) Chloroplast protein bands in (a) and (b) (as well as those in other, similar experiments) were \nquantified using Aida software (Raytest), and then the data were normalized using equivalent H3 data. \nValues shown are means (±SE) derived from 2-6 independent measurements (experiments with just two \nrepeats were exclusively those displaying the clearest results, shown in [b]). \n \n \nFigure 8. Genetic analysis of tic20-I tic20-IV double mutants.  \n(a,b) Siliques of mature, soil-grown plants of the indicated genotypes were opened and inspected. In \ntic20-1 tic20-IV double-mutant plants (genotype: +\/tic20-I; tic20-IV\/tic20-IV), a large proportion of \nfailed ovules and a smaller number of aborted seeds was observed; a representative tic20-I-1 tic20-IV-1 \nPage 24 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 25 of 29 \nsilique is shown (a). White arrows indicate failed ovules; black arrows indicate aborted seeds. \nFrequencies of failed ovules, aborted seeds, and normal seeds in double-mutant and control genotypes \nwere recorded (b); data shown are means (±SE) derived from analyses of, on average, 30 siliques (a \nminimum of 400 seeds) per genotype. \n(c) Reciprocal crossing analysis. Transmission of the tic20-I tic20-IV double mutations, through the \nfemale and male gametes, was assessed by crossing three of the four double-mutant genotypes shown in \n(b) to wild type, multiple times, in both directions; simultaneous inheritance of both mutations in the F1 \nprogeny was assessed by PCR genotyping or antibiotic resistance. Transmission efficiencies were \ncalculated for each double-mutant genotype, and then those three values were used to derive the means \nshown (±SE). \n \n \nFigure 9. Complementation of tic20-I-1 by overexpression of atTIC20-IV. \n(a,b) Expression of the 35S:TIC20-IV transgene in three independent transformants (3-10, 8-3 and 11-\n4). Total-RNA samples were extracted from pools (~20-30 individuals) of 10-day-old, T4-generation, \nMS-grown seedlings that were homozygous for the relevant transgene, as well as from similar wild-type \nplants. RT-PCR employed atTIC20-IV primers indicated in Figure 4a, and 25 amplification cycles. \nAmplicon sizes are indicated to the right of the gel image (in kb). The chart shows mean fold-change \nvalues (±SE), relative to wild type, derived from four independent amplifications; values have been \nnormalized using eIF4E1 data. \n(c) Rosette size in the transgenic lines. Diameters of the rosettes (at their widest points) of the plants \ndescribed in (d) below, as well as of other similar plants, were measured. Values shown are means \n(±SE) derived from ~8-24 different plants per genotype. \n(d) Appearance of the transgenic lines. Populations segregating for tic20-I-1 (and which either lacked \nthe 35S:TIC20-IV transgene [tic20-I-1 control], or were homozygous for the indicated transgene [T4 \ngeneration]) were plated on standard MS medium; after five days, homozygous albino individuals were \nrescued to medium containing 3% sucrose and grown until they were 38 days old. Representative plants \nwere photographed. \nPage 25 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 26 of 29 \nSUPPLEMENTARY MATERIAL \n \nAdditional supporting information may be found in the online version of this article: \n \nFigure S1. Annotated alignment of the Arabidopsis and pea Tic20 proteins. \nFigure S2. Assessment for possible homology between Tic20, bacterial amino acid transporter, and \nTim17-22-23 sequences. \nFigure S3. Expression of the Arabidopsis Tic20 genes as assessed using publicly-available microarray \ndata. \nFigure S4. Analysis of the Tic20 T-DNA mutants by genomic PCR. \nFigure S5. Phenotypic analysis of various tic20 single, double and triple mutant plants. \nFigure S6. Transgenic overexpression of atTIC20-I, atTIC20-II and atTIC20-V in tic20-I-1 mutant \nplants. \nTable S1. The Tic20-related amino acid sequences used for the phylogenetic analysis. \nTable S2. Segregation analysis of the T-DNA-associated antibiotic resistance marker in each one of the \nTic20 mutants. \nAppendix S1. Supplementary information for experimental procedures. \n \nPage 26 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 27 of 29 \n REFERENCES \n \nAlonso, J.M., Stepanova, A.N., Leisse, T.J., Kim, C.J., Chen, H., Shinn, P., Stevenson, D.K., \nZimmerman, J., Barajas, P., Cheuk, R., Gadrinab, C., Heller, C., Jeske, A., Koesema, E., \nMeyers, C.C., Parker, H., Prednis, L., Ansari, Y., Choy, N., Deen, H., Geralt, M., Hazari, \nN., Hom, E., Karnes, M., Mulholland, C., Ndubaku, R., Schmidt, I., Guzman, P., Aguilar-\nHenonin, L., Schmid, M., Weigel, D., Carter, D.E., Marchand, T., Risseeuw, E., Brogden, \nD., Zeko, A., Crosby, W.L., Berry, C.C. and Ecker, J.R. (2003) Genome-wide insertional \nmutagenesis of Arabidopsis thaliana. Science 301, 653-657. \nAltschul, S.F., Gish, W., Miller, W., Myers, E.W. and Lipman, D.J. (1990) Basic local alignment \nsearch tool. J. Mol. Biol. 215, 403-410. \nAronsson, H. and Jarvis, P. (2002) A simple method for isolating import-competent Arabidopsis \nchloroplasts. FEBS Lett. 529, 215-220. \nAronsson, H., Boij, P., Patel, R., Wardle, A., Töpel, M. and Jarvis, P. (2007) Toc64\/OEP64 is not \nessential for the efficient import of proteins into chloroplasts in Arabidopsis thaliana. Plant J. \n52, 53-68. \nBaldwin, A., Wardle, A., Patel, R., Dudley, P., Park, S.K., Twell, D., Inoue, K. and Jarvis, P. \n(2005) A molecular-genetic study of the Arabidopsis Toc75 gene family. Plant Physiol. 138, \n715-733. \nBalsera, M., Goetze, T.A., Kovács-Bogdán, E., Schürmann, P., Wagner, R., Buchanan, B.B., Soll, \nJ. and Bölter, B. (2009) Characterization of Tic110, a channel-forming protein at the inner \nenvelope membrane of chloroplasts, unveils a response to Ca2+ and a stromal regulatory \ndisulfide bridge. J. Biol. Chem. 284, 2603-2616. \nBauer, J., Chen, K., Hiltbunner, A., Wehrli, E., Eugster, M., Schnell, D. and Kessler, F. (2000) The \nmajor protein import receptor of plastids is essential for chloroplast biogenesis. Nature 403, \n203-207. \nBédard, J. and Jarvis, P. (2005) Recognition and envelope translocation of chloroplast preproteins. J. \nExp. Bot. 56, 2287-2320. \nBédard, J., Kubis, S., Bimanadham, S. and Jarvis, P. (2007) Functional similarity between the \nchloroplast translocon component, Tic40, and the human co-chaperone, Hsp70-interacting \nprotein (Hip). J. Biol. Chem. 282, 21404-21414. \nButterfield, N.J. (2000) Bangiomorpha pubescens n. gen., n. sp.: implications for the evolution of sex, \nmulticellularity, and the Mesoproterozoic\/Neoproterozoic radiation of eukaryotes. Paleobiology \n26, 386-404. \nChen, X., Smith, M.D., Fitzpatrick, L. and Schnell, D.J. (2002) In vivo analysis of the role of \natTic20 in protein import into chloroplasts. Plant Cell 14, 641-654. \nClough, S.J. and Bent, A.F. (1998) Floral dip: a simplified method for Agrobacterium-mediated \ntransformation of Arabidopsis thaliana. Plant J. 16, 735-743. \nEmanuelsson, O., Nielsen, H., Brunak, S. and von Heijne, G. (2000) Predicting subcellular \nlocalization of proteins based on their N-terminal amino acid sequence. J. Mol. Biol. 300, 1005-\n1016. \nGouy, M., Guindon, S. and Gascuel, O. (2010) SeaView version 4: A multiplatform graphical user \ninterface for sequence alignment and phylogenetic tree building. Mol. Biol. Evol. 27, 221-224. \nGutensohn, M., Schulz, B., Nicolay, P. and Flügge, U.I. (2000) Functional analysis of the two \nArabidopsis homologues of Toc34, a component of the chloroplast protein import apparatus. \nPlant J. 23, 771-783. \nHeins, L., Mehrle, A., Hemmler, R., Wagner, R., Küchler, M., Hörmann, F., Sveshnikov, D. and \nSoll, J. (2002) The preprotein conducting channel at the inner envelope membrane of plastids. \nEMBO J. 21, 2616-2625. \nHofmann, N.R. and Theg, S.M. (2005) Chloroplast outer membrane protein targeting and insertion. \nTrends Plant Sci. 10, 450-457. \nPage 27 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 28 of 29 \nHowden, R., Park, S.K., Moore, J.M., Orme, J., Grossniklaus, U. and Twell, D. (1998) Selection of \nT-DNA-tagged male and female gametophytic mutants by segregation distortion in \nArabidopsis. Genetics 149, 621-631. \nHuelsenbeck, J.P. and Ronquist, F. (2001) MRBAYES: Bayesian inference of phylogenetic trees. \nBioinformatics 17, 754-755. \nHust, B. and Gutensohn, M. (2006) Deletion of core components of the plastid protein import \nmachinery causes differential arrest of embryo development in Arabidopsis thaliana. Plant \nBiol. (Stuttg.) 8, 18-30. \nInaba, T. and Schnell, D.J. (2008) Protein trafficking to plastids: one theme, many variations. Biochem \nJ. 413, 15-28. \nInaba, T., Li, M., Alvarez-Huerta, M., Kessler, F. and Schnell, D.J. (2003) atTic110 functions as a \nscaffold for coordinating the stromal events of protein import into chloroplasts. J. Biol. Chem. \n278, 38617-38627. \nInaba, T., Alvarez-Huerta, M., Li, M., Bauer, J., Ewers, C., Kessler, F. and Schnell, D.J. (2005) \nArabidopsis Tic110 is essential for the assembly and function of the protein import machinery \nof plastids. Plant Cell 17, 1482-1496. \nJarvis, P. (2008) Targeting of nucleus-encoded proteins to chloroplasts in plants (Tansley Review). \nNew Phytol. 179, 257-285. \nJarvis, P., Chen, L.J., Li, H., Peto, C.A., Fankhauser, C. and Chory, J. (1998) An Arabidopsis \nmutant defective in the plastid general protein import apparatus. Science 282, 100-103. \nKalanon, M. and McFadden, G.I. (2008) The chloroplast protein translocation complexes of \nChlamydomonas reinhardtii: a bioinformatic comparison of Toc and Tic components in plants, \ngreen algae and red algae. Genetics 179, 95-112. \nKarimi, M., De Meyer, B. and Hilson, P. (2005) Modular cloning in plant cells. Trends Plant Sci. 10, \n103-105. \nKatoh, K., Kuma, K., Toh, H. and Miyata, T. (2005) MAFFT version 5: improvement in accuracy of \nmultiple sequence alignment. Nucleic Acids Res. 33, 511-518. \nKessler, F. and Schnell, D.J. (2006) The function and diversity of plastid protein import pathways: a \nmultilane GTPase highway into plastids. Traffic 7, 248-257. \nKikuchi, S., Oishi, M., Hirabayashi, Y., Lee, D.W., Hwang, I. and Nakai, M. (2009) A 1-\nmegadalton translocation complex containing Tic20 and Tic21 mediates chloroplast protein \nimport at the inner envelope membrane. Plant Cell 21, 1781-1797. \nKouranov, A. and Schnell, D.J. (1997) Analysis of the interactions of preproteins with the import \nmachinery over the course of protein import into chloroplasts. J. Cell Biol. 139, 1677-1685. \nKouranov, A., Chen, X., Fuks, B. and Schnell, D.J. (1998) Tic20 and Tic22 are new components of \nthe protein import apparatus at the chloroplast inner envelope membrane. J. Cell Biol. 143, 991-\n1002. \nKovacheva, S., Bédard, J., Wardle, A., Patel, R. and Jarvis, P. (2007) Further in vivo studies on the \nrole of the molecular chaperone, Hsp93, in plastid protein import. Plant J. 50, 364-379. \nKovacheva, S., Bédard, J., Patel, R., Dudley, P., Twell, D., Ríos, G., Koncz, C. and Jarvis, P. \n(2005) In vivo studies on the roles of Tic110, Tic40 and Hsp93 during chloroplast protein \nimport. Plant J. 41, 412-428. \nKrogh, A., Larsson, B., von Heijne, G. and Sonnhammer, E.L. (2001) Predicting transmembrane \nprotein topology with a hidden Markov model: application to complete genomes. J. Mol. Biol. \n305, 567-580. \nKubis, S., Baldwin, A., Patel, R., Razzaq, A., Dupree, P., Lilley, K., Kurth, J., Leister, D. and \nJarvis, P. (2003) The Arabidopsis ppi1 mutant is specifically defective in the expression, \nchloroplast import, and accumulation of photosynthetic proteins. Plant Cell 15, 1859-1871. \nKubis, S., Patel, R., Combe, J., Bédard, J., Kovacheva, S., Lilley, K., Biehl, A., Leister, D., Ríos, \nG., Koncz, C. and Jarvis, P. (2004) Functional specialization amongst the Arabidopsis Toc159 \nfamily of chloroplast protein import receptors. Plant Cell 16, 2059-2077. \nLesk, A.M. and Fordham, W.D. (1996) Conservation and variability in the structures of serine \nproteinases of the chymotrypsin family. J. Mol. Biol. 258, 501-537. \nLi, M. and Schnell, D.J. (2006) Reconstitution of protein targeting to the inner envelope membrane of \nchloroplasts. J. Cell Biol. 175, 249-259. \nPage 28 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n \nKasmati et al., page 29 of 29 \nMa, Y., Kouranov, A., LaSala, S.E. and Schnell, D.J. (1996) Two components of the chloroplast \nprotein import apparatus, IAP86 and IAP75, interact with the transit sequence during the \nrecognition and translocation of precursor proteins at the outer envelope. J. Cell Biol. 134, 315-\n327. \nNeupert, W. and Herrmann, J.M. (2007) Translocation of proteins into mitochondria. Annu. Rev. \nBiochem. 76, 723-749. \nNiewiadomski, P., Knappe, S., Geimer, S., Fischer, K., Schulz, B., Unte, U.S., Rosso, M.G., Ache, \nP., Flügge, U.I. and Schneider, A. (2005) The Arabidopsis plastidic glucose 6-\nphosphate\/phosphate translocator GPT1 is essential for pollen maturation and embryo sac \ndevelopment. Plant Cell 17, 760-775. \nPatel, R., Hsu, S., Bédard, J., Inoue, K. and Jarvis, P. (2008) The Omp85-related chloroplast outer \nenvelope protein OEP80 is essential for viability in Arabidopsis. Plant Physiol. 148, 235-245. \nRassow, J., Dekker, P.J., van Wilpe, S., Meijer, M. and Soll, J. (1999) The preprotein translocase of \nthe mitochondrial inner membrane: function and evolution. J. Mol. Biol. 286, 105-120. \nReumann, S., Davila-Aponte, J. and Keegstra, K. (1999) The evolutionary origin of the protein-\ntranslocating channel of chloroplastic envelope membranes: identification of a cyanobacterial \nhomolog. Proc. Natl. Acad. Sci. USA 96, 784-789. \nReyes-Prieto, A., Weber, A.P. and Bhattacharya, D. (2007) The origin and establishment of the \nplastid in algae and plants. Annu. Rev. Genet. 41, 147-168. \nRíos, G., Lossow, A., Hertel, B., Breuer, F., Schaefer, S., Broich, M., Kleinow, T., Jasik, J., \nWinter, J., Ferrando, A., Farras, R., Panicot, M., Henriques, R., Mariaux, J.B., \nOberschall, A., Molnar, G., Berendzen, K., Shukla, V., Lafos, M., Koncz, Z., Redei, G.P., \nSchell, J. and Koncz, C. (2002) Rapid identification of Arabidopsis insertion mutants by non-\nradioactive detection of T-DNA tagged genes. Plant J. 32, 243-253. \nRodriguez, C.M., Freire, M.A., Camilleri, C. and Robaglia, C. (1998) The Arabidopsis thaliana \ncDNAs coding for eIF4E and eIF(iso)4E are not functionally equivalent for yeast \ncomplementation and are differentially expressed during plant development. Plant J. 13, 465-\n473. \nRosso, M.G., Li, Y., Strizhov, N., Reiss, B., Dekker, K. and Weisshaar, B. (2003) An Arabidopsis \nthaliana T-DNA mutagenized population (GABI-Kat) for flanking sequence tag-based reverse \ngenetics. Plant Mol. Biol. 53, 247-259. \nSessions, A., Burke, E., Presting, G., Aux, G., McElver, J., Patton, D., Dietrich, B., Ho, P., \nBacwaden, J., Ko, C., Clarke, J.D., Cotton, D., Bullis, D., Snell, J., Miguel, T., Hutchison, \nD., Kimmerly, B., Mitzel, T., Katagiri, F., Glazebrook, J., Law, M. and Goff, S.A. (2002) A \nhigh-throughput Arabidopsis reverse genetics system. Plant Cell 14, 2985-2994. \nSmith, M.D. (2006) Protein import into chloroplasts: an ever-evolving story. Can. J. Bot. 84, 531-542. \nSoll, J. and Schleiff, E. (2004) Protein import into chloroplasts. Nat. Rev. Mol. Cell Biol. 5, 198-208. \nTeng, Y.S., Su, Y.S., Chen, L.J., Lee, Y.J., Hwang, I. and Li, H.M. (2006) Tic21 is an essential \ntranslocon component for protein translocation across the chloroplast inner envelope \nmembrane. Plant Cell 18, 2247-2257. \nTripp, J., Inoue, K., Keegstra, K. and Froehlich, J.E. (2007) A novel serine\/proline-rich domain in \ncombination with a transmembrane domain is required for the insertion of AtTic40 into the \ninner envelope membrane of chloroplasts. Plant J. 52, 824-838. \nvan Dooren, G.G., Tomova, C., Agrawal, S., Humbel, B.M. and Striepen, B. (2008) Toxoplasma \ngondii Tic20 is essential for apicoplast protein import. Proc. Natl. Acad. Sci. USA 105, 13574-\n13579. \nYoon, H.S., Hackett, J.D., Ciniglia, C., Pinto, G. and Bhattacharya, D. (2004) A molecular timeline \nfor the origin of photosynthetic eukaryotes. Mol. Biol. Evol. 21, 809-818. \nZimmermann, P., Hirsch-Hoffmann, M., Hennig, L. and Gruissem, W. (2004) \nGENEVESTIGATOR. Arabidopsis microarray database and analysis toolbox. Plant Physiol. \n136, 2621-2632. \n \nPage 29 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n  \n \n \n \n231x192mm (600 x 600 DPI)  \n \n \nPage 30 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n  \n \n \n \n95x90mm (600 x 600 DPI)  \n \n \nPage 31 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n  \n \n \n \n82x111mm (600 x 600 DPI)  \n \n \nPage 32 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n  \n \n \n \n167x117mm (600 x 600 DPI)  \n \n \nPage 33 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n  \n \n \n \n89x86mm (600 x 600 DPI)  \n \n \nPage 34 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n  \n \n \n \n119x79mm (600 x 600 DPI)  \n \n \nPage 35 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n  \n \n \n \n89x176mm (600 x 600 DPI)  \n \n \nPage 36 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n  \n \n \n \n96x167mm (600 x 600 DPI)  \n \n \nPage 37 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nCONFIDENTIAL\n  \n \n \n \n94x131mm (600 x 600 DPI)  \n \n \nPage 38 of 38\nSUBMITTED MANUSCRIPT\nThe Plant Journal\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n"}