{"doi":"10.1109\/JSTQE.2003.820912","coreId":"100898","oai":"oai:epubs.surrey.ac.uk:299","identifiers":["oai:epubs.surrey.ac.uk:299","10.1109\/JSTQE.2003.820912"],"title":"Direct measurement of facet temperature up to melting point and COD in high-power 980-nm semiconductor diode lasers","authors":["Sweeney, Stephen","Lyons, LJ","Adams, Alfred","Lock, DA"],"enrichments":{"references":[{"id":859906,"title":"A brief history of high-power semiconductor lasers,”","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":866433,"title":"A highly reliable GaInAs-GaInP 0.98-m window laser,”","authors":[],"date":"2000","doi":"10.1109\/3.853558","raw":null,"cites":null},{"id":872921,"title":"A theoretical analysis of the influence of well and facet temperatures on the facet emission spectra of normally operating quantum well lasers,” in","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":876079,"title":"Adams was awarded the Duddell Medal and Prize by the Institute of Physics,","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":875405,"title":"Authorized licensed use limited to: University of Surrey. Downloaded on","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":868107,"title":"Catastrophic damage of Al Ga As double-heterostructure material,”","authors":[],"date":"1979","doi":"10.1063\/1.326278","raw":null,"cites":null},{"id":874763,"title":"he joined Marconi Caswell Technology (now Bookham Technology) where he is engaged in the research of telecommunications semiconductor laser devices.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":864635,"title":"High-performance 980-nm quantum-well lasers using a hybrid material system of an Al-free InGaAs-InGaAsP active region and AlGaAs cladding layers grown by metal-organic chemical vapor deposition,”","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":863221,"title":"High-power 0.8 m InGaAsP\/InGaP\/AlGaAs single quantum well lasers with tensile-strained","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":865225,"title":"High-power highly-reliable operation of 0.98-m InGaAs-InGaP strain-compensated single-quantum-well lasers with tensile strained","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":867141,"title":"High-power single-mode AlGaAs lasers with bent-waveguide nonabsorbing etched-mirrors,”","authors":[],"date":"1992","doi":"10.1063\/1.351601","raw":null,"cites":null},{"id":864587,"title":"Highly reliable and stable-lateral-mode operation of high-power 0.98-m InGaAs-InGaAsP lasers with an exponential-shaped flared stripe,”","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":865998,"title":"Improvement of Catastrophic Optical Damage (COD) level for high-power 0.98-m GaInAs-GaInP laser diodes using impurity induced layer disordering,”","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":870880,"title":"Influence of local heating on current-optical output power characteristics InGa Al As lasers,”","authors":[],"date":"1986","doi":"10.1063\/1.337628","raw":null,"cites":null},{"id":877531,"title":"Lock is an Associate Member of the Institute of Physics, London, U.K. Authorized licensed use limited to:","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":876727,"title":"Lock was born in Towcester, U.K., in 1968. He received the B.Sc. (Hons.) degree in physics with nuclear astrophysics from the University of Surrey,","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":869525,"title":"Long Wavelength Semiconductor Lasers.","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":872228,"title":"Measurement of the well and facet temperatures of normally operating quantum well lasers by analysis of the spontaneous emission from the facets,” in","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":871595,"title":"Micro-temperature measurements on semiconductor laser mirrors by reflectance modulation: A newly developed technique for laser characterization,”","authors":[],"date":"1993","doi":"10.1143\/JJAP.32.5514","raw":null,"cites":null},{"id":868760,"title":"Physical Properties of III–V Semiconductor Compounds,","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":860513,"title":"Reliability improvement of 980-nm laser diodes with a new facet passivation process,”","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":863887,"title":"Semiconductor diode laser and method of manufacturing same,”","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":867826,"title":"Semiconductor laser with non-absorbing mirror facet,” U.S.","authors":[],"date":"1985","doi":null,"raw":null,"cites":null},{"id":862529,"title":"Strain-overcompensated GaInP-AlGaInP quantum-well laser structures for improved reliability at high-output powers,”","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":861213,"title":"Surface treatment by Ar plasma irradiation in electron cyclotron resonance chemical vapor deposition,”","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":873315,"title":"Sweeney (S’98–M’99) was born in","authors":[],"date":"1973","doi":null,"raw":null,"cites":null},{"id":874007,"title":"Sweeney is a Chartered Physicist and a member of The Institute of Physics, London, U.K. Leslie Jamieson Lyons was born in","authors":[],"date":"1978","doi":null,"raw":null,"cites":null},{"id":869946,"title":"The effect of temperature dependent processes on the performance of 1.5 m compressively strained InGaAs(P) MQW semiconductor diode lasers,”","authors":[],"date":"1998","doi":"10.1109\/68.701507","raw":null,"cites":null},{"id":870216,"title":"The temperature dependence of 1.3-m and 1.5-m compressively strained InGaAs(P) MQW semiconductor lasers,”","authors":[],"date":"1999","doi":"10.1109\/2944.788398","raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-09-01","abstract":"<p>The authors describe a straightforward experimental technique for measuring the facet temperature of a semiconductor laser under high-power operation by analyzing the laser emission itself. By applying this technique to 1-mm-long 980-nm lasers with 6- and 9-mum-wide tapers, they measure a large increase in facet temperature under both continuous wave (CW) and pulsed operation. Under CW operation, the facet temperature increases from similar to25 degreesC at low currents to over 140 degreesC at 500 mA. From pulsed measurements they observe a sharper rise in facet temperature as a function of current (similar to 400 degreesC at 500 mA) when compared with the CW measurements. This difference is caused by self-heating which limits the output power and hence facet temperature under CW operation. Under pulsed operation the maximum measured facet temperature was in excess of 1000 degreesC for a current of 1000 mA. Above this current, both lasers underwent. catastrophic optical damage (COD). These results show a striking increase in facet temperature under high-power operation consistent with the facet melting at COD. This is made possible by measuring the laser under pulsed operation.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"IEEE-INST ELECTRICAL ELECTRONICS ENGINEERS INC","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:299<\/identifier><datestamp>\n      2017-10-31T13:57:39Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:70686F746F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/299\/<\/dc:relation><dc:title>\n        Direct measurement of facet temperature up to melting point and COD in high-power 980-nm semiconductor diode lasers<\/dc:title><dc:creator>\n        Sweeney, Stephen<\/dc:creator><dc:creator>\n        Lyons, LJ<\/dc:creator><dc:creator>\n        Adams, Alfred<\/dc:creator><dc:creator>\n        Lock, DA<\/dc:creator><dc:description>\n        <p>The authors describe a straightforward experimental technique for measuring the facet temperature of a semiconductor laser under high-power operation by analyzing the laser emission itself. By applying this technique to 1-mm-long 980-nm lasers with 6- and 9-mum-wide tapers, they measure a large increase in facet temperature under both continuous wave (CW) and pulsed operation. Under CW operation, the facet temperature increases from similar to25 degreesC at low currents to over 140 degreesC at 500 mA. From pulsed measurements they observe a sharper rise in facet temperature as a function of current (similar to 400 degreesC at 500 mA) when compared with the CW measurements. This difference is caused by self-heating which limits the output power and hence facet temperature under CW operation. Under pulsed operation the maximum measured facet temperature was in excess of 1000 degreesC for a current of 1000 mA. Above this current, both lasers underwent. catastrophic optical damage (COD). These results show a striking increase in facet temperature under high-power operation consistent with the facet melting at COD. This is made possible by measuring the laser under pulsed operation.<\/p><\/dc:description><dc:publisher>\n        IEEE-INST ELECTRICAL ELECTRONICS ENGINEERS INC<\/dc:publisher><dc:date>\n        2003-09-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/299\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Sweeney, Stephen, Lyons, LJ, Adams, Alfred and Lock, DA  (2003) Direct measurement of facet temperature up to melting point and COD in high-power 980-nm semiconductor diode lasers   IEEE JOURNAL OF SELECTED TOPICS IN QUANTUM ELECTRONICS, 9 (5).  pp. 1325-1332.      <\/dc:identifier><dc:relation>\n        10.1109\/JSTQE.2003.820912<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/299\/","10.1109\/JSTQE.2003.820912"],"year":2003,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"IEEE JOURNAL OF SELECTED TOPICS IN QUANTUM ELECTRONICS, VOL. 9, NO. 5, SEPTEMBER\/OCTOBER 2003 1325\nDirect Measurement of Facet Temperature up to\nMelting Point and COD in High-Power 980-nm\nSemiconductor Diode Lasers\nStephen John Sweeney, Member, IEEE, Leslie Jamieson Lyons, Alfred R. Adams, Fellow, IEEE, and\nDaren Alfred Lock\nAbstract—The authors describe a straightforward experimental\ntechnique for measuring the facet temperature of a semiconductor\nlaser under high-power operation by analyzing the laser emission\nitself. By applying this technique to 1-mm-long 980-nm lasers with\n6- and 9- m-wide tapers, they measure a large increase in facet\ntemperature under both continuous wave (CW) and pulsed oper-\nation. Under CW operation, the facet temperature increases from\n25 C at low currents to over 140 C at 500 mA. From pulsed\nmeasurements they observe a sharper rise in facet temperature as\na function of current ( 400 C at 500 mA) when compared with\nthe CW measurements. This difference is caused by self-heating\nwhich limits the output power and hence facet temperature under\nCW operation. Under pulsed operation the maximum measured\nfacet temperature was in excess of 1000 C for a current of 1000\nmA. Above this current, both lasers underwent catastrophic\noptical damage (COD). These results show a striking increase in\nfacet temperature under high-power operation consistent with\nthe facet melting at COD. This is made possible by measuring the\nlaser under pulsed operation.\nIndex Terms—Laser thermal factors, optical fiber communica-\ntion, power lasers, semiconductor device measurement, semicon-\nductor lasers, temperature measurement.\nI. INTRODUCTION\nTHERE is an increasing demand for inexpensivehigh-power semiconductor lasers with applications\nranging from domestic use in recordable digital versatile\ndiscs (DVD-R) and rewritable compact discs (CD-RW), both\nof which are now becoming commonplace, for printing and\nmarking technologies, for telecommunications systems, and\nincreasingly in medical applications such as photodynamic\ntherapy, photo-coagulation or ablation, thermal therapy, and for\ninvasive and noninvasive surgery. In each of these applications,\nhigh-power visible or near infrared lasers form the essential\ncomponent due largely to their compact and robust nature.\nTelecommunications has pushed forward the rapid evolution of\nhigh power semiconductor lasers. In particular, the development\nof erbium-doped fiber amplifiers (EDFAs) gave rise to the need\nfor semiconductor lasers emitting several hundred milliwatts\nof power at 980 or 1480 nm [1]. More recently, there has been\nwidespread interest in developing distributed Raman amplifiers\nManuscript received February 14, 2003; revised July 23, 2003.\nS. J. Sweeney, A. R. Adams, and D. A. Lock are with the Advanced Tech-\nnology Institute, School of Electronics and Physical Sciences, University of\nSurrey, Surrey GU2 7XH, U.K. (e-mail: s.sweeney@surrey.ac.uk).\nL. J. Lyons is with Bookham Technology, Towcester, NN12 8EQ, U.K.\nDigital Object Identifier 10.1109\/JSTQE.2003.820912\nwhich offer the advantage of using the existing optical fiber\nitself as the amplifying medium. In order to produce gain in\nthe important 1530–1560-nm telecommunications C-band,\nRaman amplifiers require semiconductor lasers emitting in the\nrange 1430–1460 nm with fiber coupled powers 0.5 W [1].\nThus, for many applications, output powers of several hundred\nmilliwatts are required frequently giving rise to power densities\nat the laser facets 1-10 MWcm . Power densities of this\nmagnitude can easily damage many materials; indeed, it is\nprecisely this that makes them suitable for many of their appli-\ncations. However, power densities of this order at the laser facet\ncan give rise to local facet damage. This damage may either\nbe in the form of locally induced defects which can propagate,\nthereby reducing the lifetime of the laser, or alternatively it\nmay cause a catastrophic failure of the laser itself. The latter\nof these problems is commonly known as catastrophic optical\ndamage (COD) and it is the problem of COD in 980-nm pump\nlasers that we address in this paper. In order to eliminate, or\nreduce the probability of COD occurring in high power lasers,\nit is useful to be able to ascertain what is happening at the laser\nfacet at high powers. As we shall discuss in Section II, COD\noccurs due to extreme heating of the laser facet resulting in the\nphysical melting of a region of the facet itself. Many different\nlaser materials\/structures have been considered to minimize\nthe likelihood of COD ranging from strain overcompensation,\nfacet passivation, and stripe\/ridge tapering to intermixing at the\nlaser facet [2]–[13]. In order to be able to assess the relative\nmerits of different designs, it is useful to be able to quantify\ntheir effectiveness in terms of how well they reduce the rate at\nwhich the facet heats up. In this paper, we describe a method\nof directly measuring the local facet temperature by analyzing\nthe spontaneous emission emerging from the facet. From these\nmeasurements we have been able to observe the rate of facet\nheating with increasing laser bias current\/output power up\nto the point at which the laser undergoes COD. Using this\ntechnique, we compared two 980-nm lasers which incorporate\nlinear tapers along the ridge to reduce the power density at the\nlaser facet [14]. From these measurements we find that, for\nour lasers, the taper had little effect on the current at which the\ndevices underwent COD. We attribute this to the relatively short\ntaper length. Interestingly, with this technique, for these lasers\nwe measured facet temperatures up to the melting point (MP)\nof GaAs ( 1240 C [15]) under pulsed operation and observed\nthat the temperature increased steadily and superlinearly with\nincreasing current\/power up to COD. Our results show that this\n1077-260X\/03$17.00 © 2003 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:09 from IEEE Xplore.  Restrictions apply.\n1326 IEEE JOURNAL OF SELECTED TOPICS IN QUANTUM ELECTRONICS, VOL. 9, NO. 5, SEPTEMBER\/OCTOBER 2003\nFig. 1. SEM images of a laser facet having undergone COD. (a) Material near\nthe facet has molten and pushed through the facet before finally resolidifying.\nThe facet coating has been lifted up by the force of the ejected material. (b)\nMost damage occurs at the center, where the optical field intensity is at a\nmaximum. Also visible is an elliptical pattern where the material has been\ndisturbed corresponding well with the overall shape of the laser near-field\npattern.\ntechnique is a very useful tool for the analysis of semiconductor\nlasers for high power operation.\nIn Section II, we discuss COD in semiconductor lasers and its\nwavelength dependence. In Section III, we discuss techniques\nfor measuring the laser facet temperature and discuss the un-\nderlying theory behind our chosen technique. In Section IV, we\ndescribe the experimental methodology. In Section V, we de-\nscribe the results of this technique applied to 980-nm lasers\nunder pulsed and continuous wave (CW) operation. Finally, in\nSection VI we conclude.\nII. CATASTROPHIC OPTICAL DAMAGE\nOne of the greatest challenges in producing long-lived high-\npower laser diodes emitting at 980 nm is to solve the problem\nof COD. COD occurs at the facet due to severe heating. Cata-\nstrophic failure of the facet arises when the temperature reaches\nthe MP of the semiconductor layers forming the device. Evi-\ndence for this can be seen from scanning electron microscope\n(SEM) images of post-COD laser facets. Fig. 1 shows two typ-\nical images of 980-nm lasers that have undergone COD. From\nFig. 1(a), the outline of the laser ridge (upper half of the figure)\nis clearly visible below which a protrusion can be seen. The most\nplausible cause of this is that, at COD, material close to the facet\nmelts and pushes through. The exact chemical composition of\nthis material is presently unknown and is the subject of ongoing\ninvestigations. The mechanics of this are discussed in [16]. It\ncan also be seen that the facet coating has fractured and lifted\nup due to the force from the molten material. The elliptical pat-\ntern evident in the image is consistent with the shape of the near\nfield pattern of the optical mode with the major damage occur-\nring close to the center corresponding to the maximum intensity\nposition of the optical field.\nGaAs has an MP of 1240 C (at atmospheric pressure) and\nthe MPs of related alloys are of similar values [15]. The under-\nlying origin of the facet heating arises due to the strong absorp-\ntion of the laser radiation close to the laser facet followed by\nnonradiative recombination and energy transferred to the lattice\nvia the emission of phonons, consequently giving rise to a lo-\ncalized temperature increase. This temperature increase itself\nleads to bandgap shrinkage, giving rise to further absorption in\na self-depreciating manner. Possible causes of the absorption at\nthe laser facet can be due to both intrinsic material properties of\nthe laser and extrinsic properties relating to the environment in\nwhich the laser is placed.\nIntrinsic properties relate to the structure of the laser itself.\nTypical 980-nm laser structures consist of highly ( 1%) com-\npressively strained QWs within unstrained GaAs barriers sur-\nrounded by AlGaAs cladding on a GaAs substrate. This is a\nconvenient means of obtaining 980-nm emission using a GaAs\nsubstrate but produces a large net positive strain in the structure.\nGrowing an epilayer, e.g., a quantum well (QW), in a state of bi-\naxial compression requires that the “bulk” lattice constant of the\nepilayer is higher than that of the substrate, in this case GaAs.\nDuring growth, the epilayer is forced to have the lattice con-\nstant of the substrate giving rise to a tetragonal distortion in the\nactive region. One of the principal effects on the energy band\nstructure of the QW is an increase in the bandgap. However,\nclose to the facet, this compressive strain will relax, causing the\nfacet to “bulge” slightly outwards. The loss of strain close to the\nfacet therefore causes the bandgap to shrink producing a region\nof strong absorption. This problem was previously identified in\nvisible Al(GaInP)-based lasers which have even lower COD tol-\nerance than 980-nm devices (Valster et al. [4]). Thus, in highly\ncompressively strained QWs, facet absorption is an intrinsic de-\nvice property. Strain overcompensation techniques can be suc-\ncessfully employed to alleviate this problem as have been dis-\ncussed in further detail elsewhere [4], [6]. Extrinsic properties\nof the laser can also strongly influence absorption at the laser\nfacet. These can broadly be divided into two mechanisms. The\nfirst of these arises due to the fact that at the laser facet surface\nstates arise due to the dangling bonds of surface layer atoms.\nWithout passivation, these states are susceptible to oxidation\nwhich produces further absorption centers [2]. Band structure\nchanges at the interface (unrelated to strain) may also compli-\ncate the absorption spectrum. Secondly, impurities present on\nthe laser facet which themselves do not interact chemically with\nthe semiconductor may still absorb laser radiation and give rise\nto localized heating. Cleaning of the laser facet prior to coating\nis, therefore, a key aspect of laser processing [3]. QW inter-\nmixing at the laser facet can also reduce absorption due to the\nlocal increase in bandgap at the laser facet [11].\nOne might expect that facet absorption and COD will occur\nin any semiconductor laser operating at high power. However,\nthis appears not to be the case, as evident from the literature.\nCOD is known to be a significant problem in Al(GaInP)\/GaAs\nvisible lasers and InGaAs–GaAs devices. However, InP-based\ndevices such as those emitting at the telecommunications wave-\nlengths ( 1.3 and 1.5 m) seem immune to COD. Such\ndevices are based upon InP, rather than GaAs as used for the\nshorter wavelength devices. It may be that the increased thermal\nconductivity of InP (0.68 WKcm [17]) compared with GaAs\n(0.44 WK cm [17]) makes heat dissipation more effective.\nIn addition, the surface recombination velocity of InP is two\norders of magnitude lower than that of GaAs, and hence sur-\nface defect-related current paths are likely to be considerably\nmore important in GaAs [18]. Long wavelength InP-based de-\nvices also tend to suffer from overall device heating due to in-\ntrinsic inefficiencies as a result of dominant nonradiative loss\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:09 from IEEE Xplore.  Restrictions apply.\nSWEENEY et al.: DIRECT MEASUREMENT OF FACET TEMPERATURE UP TO MELTING POINT 1327\nprocesses [19], [20]. Thus, under normal operating tempera-\ntures, it is likely that such devices rollover before reaching the\nCOD threshold for the material. Other possible explanations\nmay be due to the much lower photon energies ( 0.8–1.0 eV\nfor long wavelength devices compared with 1.2–2.0 eV for\n980 nm and visible devices, respectively) so that less energy\nneeds to be dissipated into the lattice following absorption. Dif-\nferences in phonon energies between the two materials systems\nwill also influence the rate at which energy is dissipated. A de-\ntailed discussion of such effects can be found in the review paper\nof Eliseev [21].\nIII. DETERMINING FACET TEMPERATURE\nIn order to ascertain the degree to which absorption and\nconsequently facet heating affect different laser structures, it is\nuseful to be able to measure the local temperature at the laser\nfacet . Such a measurement can then be used to compare\nlaser variants such as QW\/barrier compositions, cavity lengths,\ntaper widths, facet coatings, intermixed facets and so on, which\nthemselves will, to varying extents, influence heat dissipation.\nWhile it is reasonably straightforward to estimate the junction\ntemperature as a function of current\/power (e.g., from the\nthermally induced shifts in the laser emission wavelength) it is\na considerably more difficult task to determine the local facet\ntemperature. Strategies for measuring the facet temperature\ninclude the following: Raman microprobe microscopy [22]\nwhich relies upon measuring the Stokes\/anti-Stokes phonon\nline intensity ratio. A drawback of this technique is it tends to\nbe very slow and is typically limited to an accuracy of 20 K.\nAlso, the relatively high excitation laser power may itself\ncause heating of the facet, thereby obscuring the actual facet\ntemperature. Since this is effectively a CW measurement it\nmay itself impede COD from occurring at all. Since it will be\nunable to register the temperature during a pulse, the measured\nfacet temperature may consequently be an average rather than\na peak value. Micro-Photomodulated reflectance ( PR) is a\nvariation on photoreflectance where only a very small sample\narea is investigated [23]. -PR can be used to monitor the facet\ntemperature since the facet temperature can be related to the\nchange in facet reflectivity. This is a very rapid measurement\ntechnique but experimentally very challenging as it requires\nvery accurate alignment of an external laser on the laser facet.\nThis introduces an error whereby the measured temperature\nmay not exactly coincide with the temperature at the peak\nof the semiconductor laser optical mode. Furthermore, since\nthis technique also uses an incident excitation laser, this may\ncause some facet heating itself and suffers from the same\naveraging effect as discussed above. The technique used for\nthis paper relies on measuring the high energy facet electro-\nluminescence emitted from the laser facet itself [24]. This\ntechnique utilizes the semiconductor emission itself as a means\nof determining the facet temperature. While this is a reasonably\nstraightforward technique it can be time-consuming (up to\none hour per measurement). In this experiment, the very high\nenergy Boltzmann tail of the amplified spontaneous emission\nis measured. One of the major strengths of this technique is\nthat it can be performed with the laser driven in either pulsed\nor CW mode. Under pulsed operation, internal self-heating of\nthe laser is minimized (see later), allowing the laser to reach\nhigh optical power densities at the facet. With this technique,\nthe facet temperature is, therefore, determined during the short\npulse (while the instantaneous output power is high) so that the\nfacet temperature can be measured close to the point of COD.\nThe basic idea of this technique can be understood as follows.\nFrom simple theory, it can be shown [24] that the rate of spon-\ntaneous emission for a given photon energy, may be written\nas\n(1)\nproviding that is several larger than the energy separa-\ntion between the two quasi-Fermi levels, . Here,\nis Boltzmann’s constant and is a constant. is the optical\nconfinement factor in the cavity for light of energy (the pro-\nportion of the flux overlapping the active region) and is the ef-\nfective bulk absorption coefficient at energy . The coefficient\nmakes this expression very complicated since it varies with\nenergy in an unknown manner depending on the joint density of\nstates and the matrix elements which determine the optical tran-\nsitions between the conduction and valence bands. However, if\nwe consider only light being emitted from the end facet, this\nwill have been guided along the laser cavity and have suffered\nre-absorption. Thus, if we assume that the laser is being uni-\nformly pumped so that is a constant, we may write\n, the number of photons of energy emitted by the facet, as\n(2)\nwhere is the distance along the laser cavity. The value of this\nintegral is simply\n(3)\nand thus both and cancel to leave a simple expression for\nwhere\n(4)\nThus, a plot of against is just a straight line of\ngradient (1\/kT) yielding the absolute temperature . typi-\ncally varies from about 1%–3% per well for just above the\nground state to about 30% for light of energy greater than\nthe bandgap of the barrier material resulting in the observation\nof light from 10-20 m to 1 m, respectively. In practice,\na large temperature gradient extends from the facet toward the\nbulk of the laser. This means that it is very difficult to obtain sen-\nsible temperature measurements based upon the QW emission\n(unless more sophisticated analysis is used [25]). However, due\nto the higher photon energy and correspondingly larger absorp-\ntion coefficient, the light emitted from the barrier\/SCH layers\nthat is ultimately detected will only have come from a region\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:09 from IEEE Xplore.  Restrictions apply.\n1328 IEEE JOURNAL OF SELECTED TOPICS IN QUANTUM ELECTRONICS, VOL. 9, NO. 5, SEPTEMBER\/OCTOBER 2003\nFig. 2. Triple-spectrometer setup used to measure the high energy emission\nfrom the laser facet. Laser emission is first passed into the optical band-pass\nfilter which selects only the high energy tail of the emission spectrum. This is\nthen passed into a monochromator and dispersed onto a cooled silicon CCD\narray detector. The whole system is controlled via a PC.\nvery close to the facet. Hence, by measuring the tail of the bar-\nrier emission, the temperature in the vicinity of the facet may be\ndetermined.\nIV. MEASUREMENT TECHNIQUE\nIn a typical experiment on a 980-nm laser with GaAs bar-\nrier\/waveguide layers, in order to extract the facet temperature\nit is necessary to examine the emission spectrum several\nabove the GaAs emission peak. For the purposes of this investi-\ngation it was, therefore, deemed necessary to look at the emis-\nsion present over the wavelength range nm.\nExperimentally, this poses two problems. Firstly, the emission\nat these short wavelengths is considerably weaker than the peak\nintensity at 980 nm, 10 10 times less intense, depending\non the drive current. This itself gives rise to detection problems\ndue to the low photon count. Associated with this, due to the\nmuch higher photon count at the 980-nm emission peak, scatter\nof light within a spectrometer can lead to severe distortions in\nthe spectra at the shorter wavelengths. Thus, conventional op-\ntical spectrum analyzers proved to be unsuitable for this type of\nmeasurement. Instead, a Spex triple spectrometer together with\na liquid nitrogen cooled CCD array was used as shown in Fig. 2.\nThe triple spectrometer is configured as an optical band pass\nfilter followed by a single monochromator. The optical band\npass stage selects the spectral region of interest and rejects all\nother emission including the laser line at 980 nm. This filtered\nlight is then fed into the monochromator and dispersed onto the\nhigh sensitivity liquid-nitrogen cooled silicon CCD array.\nThe lasers were bonded and mounted on T0–style headers in-\ncorporating a tungsten–copper heat sink. The base temperature\nwas maintained at 25 C using a Peltier effect thermoelectric\nheater\/cooler system. The lasers were driven under both\npulsed and CW operation using an ILX-LDP3811\/3 and a\nILX LDC3220, respectively. For the pulsed measurements,\n500-ns long pulses were used at a repetition rate of 10 kHz.\nFig. 3 shows an example of a power-current characteristic\nunder pulsed (dashed line) and CW (solid line) operation. Note\nthat the measured power under pulsed operation is the power\nover the duration of the pulse. Pulsed measurements minimize\nFig. 3. Example of the power–current characteristic of a 980-nm laser under\npulsed (dashed line) and CW (solid curve) operation. Under CW operation,\ndue to joule heating caused by the injected current, the power rolls over with\nincreasing current. However, under pulsed operation, the peak power can\nincrease further due to the much reduced joule heating. One can observe COD\nmore easily under pulsed operation due to the higher peak power.\ncurrent (Joule) heating effects and hence one can achieve\nhigher instantaneous optical power levels compared with CW\noperation. Joule heating can contribute to both overall device\nheating and may also reduce the facet temperature due to the\nreduced optical power for a given current. Thus, in practice it\nis easier to observe COD when driving a laser under pulsed\nmode. A drawback of using pulsed current is that it increases\nthe duration of the experiment since longer scan times become\nnecessary to achieve a sufficient time-averaged power level.\nTypically, the CW measurements took between 30 s and 1 h,\ndepending on the drive current. When performing pulsed\nmeasurements there is a compromise between minimizing the\nlevel of noise and reducing the duration of the experiment.\nThus, the pulsed measurements took approximately twice as\nlong as the CW measurements to obtain reasonable, albeit\nsignificantly noisier spectra.\nThe devices studied were all 1-mm long with a 3- m ridge\ntapering to either 6 or 9 m. The active regions for both sets\nof devices consisted of two, 1.5% compressively strained In-\nGaAs QWs within GaAs barriers and a GaAs separate confine-\nment heterostructure. The cladding layers were composed of\nwith a graded interface. The structures were\ngrown by metal–organic chemical vapor deposition (MOCVD)\non n-doped GaAs substrates. Further details of the structures are\ngiven elsewhere [14]. It should be noted that the experimental\ndevices selected for this investigation were fabricated with the\naim of investigating aspects of design optimization including ta-\npers and did not include the coatings or facet treatments used in\nproduction devices to combat COD.\nV. RESULTS AND DISCUSSION\nA. CW Measurements\nIn Fig. 4, we show a typical spectrum for a 6- m-wide tapered\nlaser driven CW at a current of 20 mA (below laser threshold,\n). In the inset of Fig. 4 we show the part of the spectrum\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:09 from IEEE Xplore.  Restrictions apply.\nSWEENEY et al.: DIRECT MEASUREMENT OF FACET TEMPERATURE UP TO MELTING POINT 1329\nFig. 4. Typical emission spectrum showing the QW emission peak and the\nhigh energy emission tail (inset) from the GaAs barrier layers from which the\nfacet temperature may be extracted.\nFig. 5. Plot of ln(L=E ) versusE using the high energy Boltzmann tail of the\nfacet emission at 20 (circles) and 500 mA (diamonds) for a 6-\u0016m taper device\nunder CW operation. From the slope of the plots, the facet temperature T can\nbe deduced. Here, we find that at 20 mA (below I ) T = 23 C which is in\ngood agreement with the base temperature of 25 C. At 500 mA, the decrease in\nslope corresponds to a facet temperature of 167 C. This clearly shows a strong\nincrease in facet temperature under high-power operation.\ncorresponding to the tail of the GaAs barrier emission which\nhas been isolated using the bandpass of the triple spectrometer.\nIn Fig. 5, this data is replotted in the form versus\nwhere the measured data is given by the circles. It can be\nseen that over this energy range the plot is linear and upon per-\nforming a least squares linear fit (solid line) to the data we ob-\ntain a value for the gradient and hence the temper-\nature which we find to be 23 C. This is in close agreement\nwith the fixed substrate temperature of 25 C and indicates an\nerror in our measurement of about C. The diamonds rep-\nresent the corresponding data for the laser driven at a CW cur-\nrent of 500 mA corresponding to an output power\n300 mW. Again, we observe a linear variation albeit with a\nshallower gradient. From this gradient we deduce a facet tem-\nperature of 167 C. Clearly, therefore, under high power oper-\nFig. 6. (a) Variation in extracted facet temperature as a function of CW current\nfor the 6- (squares) and 9-\u0016m (circles) taper devices. At low currents, the facet\ntemperature remains approximately equal to the base temperature; however,\nwith increasing current, the temperature increases significantly up to 167 C\nand 140 C for the 6- and 9-\u0016m taper devices, respectively. (b) Same data is\nplotted as a function of output power. Interestingly, in this plot there is little\ndifference between the two sets of data. This suggests that there is, in fact, little\ndifference in the facet power density for the two structures.\nation one can measure a significant increase in the local laser\nfacet temperature. In Fig. 6, for many such measurements we\nplot the variation of the extracted facet temperature for devices\nwith both a 6- (squares) and a 9- m (circles) taper as a function\nof: (a) CW drive current and (b) measured output power. The\ndashed line indicates the temperature of the laser base main-\ntained using the Peltier system. From Fig. 6(a), we observe that\nat low currents the laser facet temperature initially re-\nmains approximately equal to the base temperature. However,\nwith increasing current, the temperature increases superlinearly\nup to a maximum of 167 and 140 C for the 6- and 9- m taper\ndevices at 500 mA, the highest current achievable with the cur-\nrent source. From this graph it would seem that the wider 9- m\ntaper device is indeed reducing the heating at the facet. However,\nin Fig. 6(b), where we plot the facet temperature as a function of\noutput power, there appears to be little difference between the\n6- and 9- m taper devices. The reason for this can be seen in\nFig. 7 where we plot the near-field width as a function of\ncurrent for the 6- and 9- m taper devices. At low currents we\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:09 from IEEE Xplore.  Restrictions apply.\n1330 IEEE JOURNAL OF SELECTED TOPICS IN QUANTUM ELECTRONICS, VOL. 9, NO. 5, SEPTEMBER\/OCTOBER 2003\nFig. 7. Measured 1=e near field widths for the 6- (squares) and 9-\u0016m (circles)\ntaper devices as a function of CW current. While the mode width of the 6-\u0016m\ntaper device remains relatively constant with increasing current, the mode width\ndecreases significantly for the 9-\u0016m taper device with increasing current such\nthat the two devices have similar mode widths at high current. This explains\nwhy there is little difference in the facet temperature as a function of power for\nthe two devices.\nobserve that the width is approximately equal to the taper\nwidth. However, with increasing current the two widths appear\nto converge such that at 500 mA, the near field widths are almost\nequal in size. Therefore, with increasing current, there is little\ndifference in the mode size and hence the optical power density\nfor the two devices is approximately equal. Thus, in terms of\nfacet heating, the devices behave similarly at high power. This\nresult suggests that the 1-mm-long tapered cavity is insufficient\nto allow the mode to expand under high power operation and\nindicates the need to use devices with longer taper lengths.\nB. Pulsed Measurements\nFrom the CW measurements we clearly observed significant\nheating of the laser facet. However, as discussed earlier in this\npaper (and shown in Fig. 3), due to self-heating of the active\nregion, the power–current characteristic under CW operation\ntends to roll over and, hence, one cannot observe catastrophic\nfailure of the facet. Under pulsed operation one can achieve con-\nsiderably higher power levels over the duration of the pulses. In\nFig. 8, we plot the variation of the facet temperature with pulsed\ncurrent for the 6- and 9- m taper devices. The solid line is in-\ntended as a guide to the eye. While the data is clearly noisier, it\ndoes show that under pulsed operation, the facet temperature in-\ncreases very sharply with current. At low current (up to 120 mA)\nthe facet temperature (24 C–26 C) is approximately equal to\nthe base temperature for both taper width devices. For a further\nincrease in current the facet temperature increases superlinearly\nsuch that by 500 mA, the facet temperature is 400 100 C.\nEven allowing for this large error, it is clear that under pulsed\noperation the heating is considerably higher than under CW op-\neration [Fig. 6(a)] for which the facet reached a temperature\nof 140–167 C. The apparent decrease in facet temperature be-\ntween 500 and 600 mA for the 9- m taper device may be caused\nby spatial hole burning whereby the laser then oscillates in a\nFig. 8. Variation in facet temperature as a function of pulsed current for the 6-\n(circles) and 9-\u0016m (squares) taper devices. Solid line is a guide to the eye. We\nobserve that for both devices, above\u0018120 mA, the facet temperature increases\nsharply with current such that by 500 mA, T \u0018 400 C. This is higher than\nthe corresponding CW current due to the higher output power under pulsed\noperation. Increasing the current further leads to further heating such that by\n1000 mA, T \u0018 1000 C. Beyond this current, both devices underwent COD.\nDotted line indicates the melting point of GaAs. Rate of increase of facet\ntemperature with current is consistent with the facet melting at COD.\nhigher order mode resulting in a decrease in the facet power\ndensity. By further increasing the pulsed current the facet tem-\nperature continued to increase such that at 1000 mA ,\nthe facet temperature 1000 C. When the current was fur-\nther increased to 1100 mA, both devices underwent COD. The\ndashed line in Fig. 8 shows the melting point of GaAs at atmo-\nspheric pressure (1240 C). Our results confirm that the laser\nfacet reached in excess of 1000 C at COD, consistent with the\nmelting point of the semiconductor itself. Interestingly, these\nresults show that the facet temperature increases steadily with\nincreasing current close to the point of COD.\nVI. CONCLUSION\nIn summary, we have outlined and demonstrated a practical\ntechnique for measuring the facet temperature of a semicon-\nductor laser under high-power operation. By applying this tech-\nnique to 6- and 9- m 1-mm-long tapered 980-nm lasers we mea-\nsure a large increase in facet temperature under CW and pulsed\noperation. Under CW operation, the facet temperature increases\nfrom 25 C at low currents to over 140 C at 500 mA. We\nfound little difference in facet temperature between the devices\nwith respect to output power. This is due to the fact that the near\nfield width of the devices is approximately equal at high power.\nHence, for 1-mm-long devices, there is, in fact, little difference\nin optical power density at the facet. From pulsed measurements\nwe observe a sharper rise in facet temperature as a function of\ncurrent ( 400 C at 500 mA) when compared with the CW\nmeasurements. This arises due to self-heating under CW opera-\ntion which limits the output power and hence facet heating due\nto the overall device Joule heating. Under pulsed operation the\nmaximum measured facet temperature was in excess of 1000 C\nfor a current of 1000 mA. Beyond this, both lasers underwent\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:09 from IEEE Xplore.  Restrictions apply.\nSWEENEY et al.: DIRECT MEASUREMENT OF FACET TEMPERATURE UP TO MELTING POINT 1331\nCOD. This was made possible by measuring the facet heating\nduring the pulse itself. These results demonstrate that the laser\nfacet temperature increases sharply with current\/power and is\nconsistent with the facet melting at COD at a temperature com-\nparable with the melting point of GaAs.\nACKNOWLEDGMENT\nThe authors would like to thank Dr. R. Beanland for\nproducing the SEM images shown in this paper and Dr. D.\nLancefield for assistance with the triple spectrometer. They\nalso would like to thank the laser team at Bookham Technology\nPLC, Caswell, for the fabrication and supply of the lasers used\nin this study.\nREFERENCES\n[1] D. F. Welch, “A brief history of high-power semiconductor lasers,” IEEE\nJ. Select. Topics Quantum Electron., vol. 6, pp. 1470–1477, 2000.\n[2] H. Horie, H. Ohta, and T. Fujimori, “Reliability improvement of 980-nm\nlaser diodes with a new facet passivation process,” IEEE J. Select. Topics\nQuantum Electron., vol. 5, pp. 832–838, 1999.\n[3] J.-I. Hashimoto, N. Ikoma, M. Murata, J. Fukui, T. Nomaguchi, and T.\nKatsuyama, “Surface treatment by Ar plasma irradiation in electron cy-\nclotron resonance chemical vapor deposition,” Jpn. J. Appl. Phys., vol.\n39, pp. 2761–2766, 2000.\n[4] A. Valster, A. T. Meney, J. R. Downes, D. A. Faux, A. R. Adams, A. A.\nBrouwer, and A. J. Corbijn, “Strain-overcompensated GaInP-AlGaInP\nquantum-well laser structures for improved reliability at high-output\npowers,” IEEE J. Select. Topics Quantum Electron., vol. 3, pp. 180–187,\n1997.\n[5] T. Fukunaga, M. Wada, and T. Hayakawa, “High-power 0.8 \u0016m In-\nGaAsP\/InGaP\/AlGaAs single quantum well lasers with tensile-strained\nInGaP barriers,” Jpn. J. Appl. Phys., vol. 38, pp. L387–L389, 1999.\n[6] A. R. Adams, A. T. Meney, J. R. Downes, A. Valster, and G. A. Acket,\n“Semiconductor diode laser and method of manufacturing same,” U.S.\nPatent 5 956 359, 1999.\n[7] M. Sagawa, K. Hiramoto, T. Toyonaka, T. Kikawa, S. Fujisaki, and K.\nUomi, “Highly reliable and stable-lateral-mode operation of high-power\n0.98-\u0016m InGaAs-InGaAsP lasers with an exponential-shaped flared\nstripe,” IEEE J. Select. Topics Quantum Electron., vol. 3, pp. 666–671,\n1997.\n[8] G. W. Yang, R. J. Hwu, Z. T. Xu, and X. Y. Ma, “High-performance\n980-nm quantum-well lasers using a hybrid material system of an\nAl-free InGaAs-InGaAsP active region and AlGaAs cladding layers\ngrown by metal-organic chemical vapor deposition,” IEEE J. Quantum\nElectron., vol. 35, pp. 1535–1541, 1999.\n[9] M. Sagawa, T. Toyonaka, K. Hiramoto, K. Shinoda, and K. Uomi,\n“High-power highly-reliable operation of 0.98-\u0016m InGaAs-InGaP\nstrain-compensated single-quantum-well lasers with tensile strained\nInGaAsP barriers,” IEEE J. Select. Topics Quantum Electron., vol. 1,\npp. 189–195, 1995.\n[10] J. K. Lee, K. H. Park, D. H. Jang, H. S. Cho, C. S. Park, K. E. Pyun,\nand J. Jeong, “Improvement of Catastrophic Optical Damage (COD)\nlevel for high-power 0.98-\u0016m GaInAs-GaInP laser diodes using impu-\nrity induced layer disordering,” IEEE Photon. Technol. Lett., vol. 10, pp.\n1226–1228, 1998.\n[11] J.-I. Hashimoto, N. Ikoma, M. Maruta, and T. Katsuyama, “A highly re-\nliable GaInAs-GaInP 0.98-\u0016m window laser,” IEEE J. Quantum Elec-\ntron., vol. 36, pp. 971–977, 2000.\n[12] F. R. Gfeller, P. Buchmann, P. W. Epperlein, H. P. Meier, and J. P. Rei-\nthmaier, “High-power single-mode AlGaAs lasers with bent-waveguide\nnonabsorbing etched-mirrors,” J. Appl. Phys., vol. 72, pp. 2131–2135,\n1992.\n[13] D. Botez, “Semiconductor laser with non-absorbing mirror facet,” U.S.\nPatent 4 523 316, 1985.\n[14] Proc. 1998 Institute Physics Semiconductor Integrated Optoelectronics\nConf., Cardiff, U.K..\n[15] J. C. Brice, Properties of GaAs, 2nd ed. London, U.K.: INSPEC, 1991,\np. 20.\n[16] C. H. Henry, P. M. Petroff, R. A. Logan, and F. R. Merritt, “Catastrophic\ndamage of Al Ga As double-heterostructure material,” J. Appl.\nPhys., vol. 50, pp. 3721–3732, 1979.\n[17] S. Adachi, Physical Properties of III–V Semiconductor Compounds, InP,\nInAs, GaAs, GaP, InGaAs, and InGaAsP. New York: Wiley, 1992, p.\n58.\n[18] G. P. Agarawal and N. K. Dutta, Long Wavelength Semiconductor\nLasers. New York: Van Nostrand Reinhold, 1986, pp. 115–116.\n[19] S. J. Sweeney, A. F. Phillips, A. R. Adams, E. P. O’Reilly, and P.\nJ. A. Thijs, “The effect of temperature dependent processes on the\nperformance of 1.5 \u0016m compressively strained InGaAs(P) MQW\nsemiconductor diode lasers,” IEEE Photon. Technol. Lett., vol. 10, pp.\n1076–1078, 1998.\n[20] A. F. Phillips, S. J. Sweeney, A. R. Adams, and P. J. A. Thijs, “The tem-\nperature dependence of 1.3-\u0016m and 1.5-\u0016m compressively strained In-\nGaAs(P) MQW semiconductor lasers,” IEEE J. Select. Topics Quantum\nElectron., vol. 5, pp. 401–412, 1999.\n[21] P. G. Eliseev, “Optical strength of semiconductor laser materials,” Prog.\nQuantum Electron., vol. 20, pp. 1–82, 1996.\n[22] S. Todoroki, “Influence of local heating on current-optical output power\ncharacteristics InGa Al As lasers,” J. Appl. Phys., vol. 60, pp.\n61–65, 1986.\n[23] P.-W. Epperlein, “Micro-temperature measurements on semiconductor\nlaser mirrors by reflectance modulation: A newly developed technique\nfor laser characterization,” Jpn. J. Appl. Phys., vol. 32, pp. 5514–5522,\n1993.\n[24] A. R. Adams, E. Cariou, P. Vicente, B. Couzinet, and A. Raymond,\n“Measurement of the well and facet temperatures of normally operating\nquantum well lasers by analysis of the spontaneous emission from the\nfacets,” in Proc. 7th Eur. Conf. Integrated Optics (ECIO’95), 1995, pp.\n121–124.\n[25] P. E. L. Fermor and A. R. Adams, “A theoretical analysis of the influence\nof well and facet temperatures on the facet emission spectra of normally\noperating quantum well lasers,” in Proc. Institute Physics, 1998 Con-\ndensed Matter Materials Physics Conf., Manchester, U.K..\nStephen John Sweeney (S’98–M’99) was born in\nLuton, U.K., in 1973. He received the B.Sc. (Hons.)\ndegree in applied physics and the Certificate in Ed-\nucation from the University of Bath, Bath, U.K., in\n1995 and the Ph.D. degree in semiconductor laser\nphysics at the University of Surrey, Surrey, U.K., in\n1999.\nAfter two years as a Postdoctoral Researcher he\nworked as a Scientist for Marconi Optical Compo-\nnents on the development of signal and pump sources\nfor telecommunications applications. He is currently\na Lecturer in semiconductor laser physics at the University of Surrey. His re-\nsearch interests include understanding the gain and loss processes underpinning\nthe performance of semiconductor lasers utilizing a combination of novel exper-\nimental techniques coupled with complementary theoretical modeling. His cur-\nrent research activities include long-wavelength InGaAs(P)-, AlGaInAs-, and\nGaInNAs-based MQW semiconductor lasers for cooler-free applications and\nfuture GaAs-based vertically integrated devices. He is also interested in failure\nmechanisms in high power semiconductor lasers for fiber amplifiers and has\nworked on both visible VCSEL and edge-emitting lasers as well as 1.3-µm\nquantum dot structures.\nDr. Sweeney is a Chartered Physicist and a member of The Institute of\nPhysics, London, U.K.\nLeslie Jamieson Lyons was born in Edinburgh, U.K., in 1978. He received the\nM.Phys. (Hons.) degree in physics from Heriot-Watt University, U.K., in 1999,\nstudying also at l’Ecole Nationale Supérieure de Physique de Marseille, France,\nas part of this degree.\nIn June 2000, he joined Marconi Caswell Technology (now Bookham Tech-\nnology) where he is engaged in the research of telecommunications semicon-\nductor laser devices.\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:09 from IEEE Xplore.  Restrictions apply.\n1332 IEEE JOURNAL OF SELECTED TOPICS IN QUANTUM ELECTRONICS, VOL. 9, NO. 5, SEPTEMBER\/OCTOBER 2003\nAlfred R. Adams (M’82–SM’00–F’01) was born in\nthe U.K., in 1939. He received the B.Sc., Ph.D., and\nD.Sc. degrees in physics from the University of Le-\nicester, Leicester, U.K., in 1961, 1964, and 1986, re-\nspectively. After completing his Ph.D. research into\nthe electrical and optical properties of orthorhombic\nsulphur he spent two years at the University of Karl-\nsruhe, Karlsruhe, Germany, studying the thermal and\nthermoelectric properties of selenium and tellurium.\nIn 1967, he joined the University of Surrey, Surry,\nU.K., where he is now a Professor of physics and\nLeader of the Optoelectronic Devices and Materials research group. Semicon-\nductor lasers have been one of his major interests since 1980 when he spent\nsabbatical leave at Tokyo Institute of Technology, Tokyo, Japan. He held the\nHitachi Visiting Chair at Tokyo Institute of Technology in 1992 and was CNRS\nVisiting Researcher at the University of Montpellier in 1993.\nDr. Adams was awarded the Duddell Medal and Prize by the Institute of\nPhysics, U.K., in 1995 for his work on strained-layer lasers. He is a Fellow of\nthe Institute of Physics, London, U.K., and the Institute of Electrical Engineers,\nU.K. In 1996, he was Elected Fellow of the Royal Society.\nDaren Alfred Lock was born in Towcester, U.K.,\nin 1968. He received the B.Sc. (Hons.) degree\nin physics with nuclear astrophysics from the\nUniversity of Surrey, Surrey, U.K., in 2000. He is\ncurrently working toward the Ph.D. degree at the\nUniversity of Surrey.\nHis research interests include experimental\nmethods to investigate the underlying processes\ninvolved in catastrophic optical damage and high\npower recombination effects in semiconductor lasers\nfor fiber amplifiers.\nMr. Lock is an Associate Member of the Institute of Physics, London, U.K.\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 26, 2009 at 10:09 from IEEE Xplore.  Restrictions apply.\n"}