{"doi":"10.5194\/angeo-20-41-2002","coreId":"194750","oai":"oai:lra.le.ac.uk:2381\/709","identifiers":["oai:lra.le.ac.uk:2381\/709","10.5194\/angeo-20-41-2002"],"title":"Effects of multiple scatter on the propagation and absorption of electromagnetic waves in a field-aligned-striated cold plasma:implications for ionospheric modification experiments","authors":["Robinson, T. R."],"enrichments":{"references":[{"id":44681933,"title":"A thermal oscillating two-stream instability,","authors":[],"date":"1983","doi":"10.1063\/1.863993","raw":"Dysthe, K. B., Mjølhus, E., Pe´cseli, H. L., and Rypdal, K.: A thermal oscillating two-stream instability, Phys. Fluids., 26, 146– 157, 1983.","cites":null},{"id":44681942,"title":"Anomalous absorption and reflection in ionospheric radio modification experiments,","authors":[],"date":"1985","doi":"10.1029\/ja090ia05p04269","raw":"Mjølhus, E.: Anomalous absorption and reflection in ionospheric radio modification experiments, J. Geophys. Res., 90, 4269– 4279, 1985.","cites":null},{"id":44681935,"title":"Anomalous radio wave absorption due to ionospheric heating effects,","authors":[],"date":"1976","doi":"10.1029\/rs011i012p01057","raw":"Graham, K. N. and Fejer, J. A.: Anomalous radio wave absorption due to ionospheric heating effects, Radio Sci., 11, 1057–1063, 1976.","cites":null},{"id":44681946,"title":"Dielectric constant perturbations caused by the conversion of an electromagnetic wave at small-scale plasma inhomogeneities,","authors":[],"date":"1988","doi":null,"raw":"Vaskov, V. V.: Dielectric constant perturbations caused by the conversion of an electromagnetic wave at small-scale plasma inhomogeneities, Sov. J. Plasma Phys. (Eng. Trans.), 14, 686–690, 1988.","cites":null},{"id":44681937,"title":"Electromagnetic wave propagation in a field-alignedstriated cold magnetoplasma with application to the ionosphere,","authors":[],"date":"1984","doi":"10.1016\/0021-9169(84)90148-x","raw":"Hagfors, T.: Electromagnetic wave propagation in a field-alignedstriated cold magnetoplasma with application to the ionosphere, J. Atmos. Terr. Phys., 46, 211–216, 1984.","cites":null},{"id":44681934,"title":"Field-aligned scattering from a heated region of the ionosphere-Observations at HF and VHF,","authors":[],"date":"1974","doi":"10.1029\/rs009i011p00923","raw":"Fialer, P. A.: Field-aligned scattering from a heated region of the ionosphere-Observations at HF and VHF, Radio Sci., 9, 923– 940, 1974.","cites":null},{"id":44681939,"title":"Frequency dependence of anomalous absorption caused by high power radio waves,","authors":[],"date":"1984","doi":"10.1016\/0021-9169(84)90140-5","raw":"Jones, T. B., Robinson, T., Stubbe, P., and Kopka, H.: Frequency dependence of anomalous absorption caused by high power radio waves, J. Atmos. Terr. Phys., 46, 147–153, 1984.","cites":null},{"id":44681936,"title":"Nonlinear phenomena in the ionosphere,","authors":[],"date":"1978","doi":"10.1007\/978-3-642-87649-3","raw":"Gurevich, A. V.: Nonlinear phenomena in the ionosphere, Springer Verlag, Berlin, 1978.","cites":null},{"id":44681947,"title":"Nonlinear resonant instability of a plasma in the field of an ordinary wave,","authors":[],"date":"1976","doi":null,"raw":"Vaskov. V. V., and Gurevich, A. V.: Nonlinear resonant instability of a plasma in the field of an ordinary wave, Sov. Phys. JETP (Eng. Trans.), 42, 91–97, 1976.","cites":null},{"id":44681944,"title":"O and X mode heating effects observed simultaneT. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves 55 ously with the CUTLASS and EISCAT radars and low power HF diagnostics at Tromsø,","authors":[],"date":"1997","doi":null,"raw":"Robinson, T. R., Stocker, A. J., Bond, G., Eglitis, P., Wright, D., and Jones, T. B.: O and X mode heating effects observed simultaneT. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves 55 ously with the CUTLASS and EISCAT radars and low power HF diagnostics at Tromsø, Ann. Geophysicae, 15, 134–136, 1997.","cites":null},{"id":44681938,"title":"Observations of HF backscatter associated with heating experiments at Tromsø,","authors":[],"date":"1983","doi":"10.1029\/rs018i006p00840","raw":"Hedberg, A˚., Derblom, H., Thide´, B., Kopka, H., and Stubbe, P.: Observations of HF backscatter associated with heating experiments at Tromsø, Radio Sci., 18, 840–850, 1983. Inhester, B., Das, A. C., and Fejer, J. A.: Generation of small-scale field-aligned irregularities in ionospheric heating experiments, J.","cites":null},{"id":44681941,"title":"Radio frequency scattering from a heated ionospheric volume, 1, VHF\/UHF fieldaligned and plasma-line backscatter measurements,","authors":[],"date":"1974","doi":"10.1029\/rs009i011p00941","raw":"Minkoff, J., Kugelman, P., and Weissman, I.: Radio frequency scattering from a heated ionospheric volume, 1, VHF\/UHF fieldaligned and plasma-line backscatter measurements, Radio Sci., 9, 941–955, 1974.","cites":null},{"id":44681940,"title":"Radio frequency scattering from a heated ionospheric volume, 3, Cross section calculations,","authors":[],"date":"1974","doi":"10.1029\/rs009i011p00997","raw":"Minkoff, J.: Radio frequency scattering from a heated ionospheric volume, 3, Cross section calculations, Radio Sci., 9, 997–1004, 1974.","cites":null},{"id":44681932,"title":"Radio-reflectivity detection of artificial modification of the ionospheric F-layer,","authors":[],"date":"1970","doi":"10.1029\/ja075i031p06439","raw":"Cohen, R. and Whitehead, J. D.: Radio-reflectivity detection of artificial modification of the ionospheric F-layer, J. Geophys. Res., 75, 6439–6445, 1970.","cites":null},{"id":44681943,"title":"The heating of the high latitude ionosphere by high power radio waves,","authors":[],"date":"1989","doi":"10.1016\/0370-1573(89)90005-7","raw":"Robinson, T. R.: The heating of the high latitude ionosphere by high power radio waves, Phys. Rep., 179, 79–209, 1989.","cites":null},{"id":44681945,"title":"Wide band attenuation of radio waves caused by powerful HF waves: Satuaration and dependence on ionospheric variability,","authors":[],"date":"1992","doi":"10.1029\/ja087ia03p01551","raw":"Stix, T. H.: Waves in plasmas, Am. Inst. Phys., New York, 1992. Stubbe, P., Kopka, H., Jones, T. B., and Robinson, T.: Wide band attenuation of radio waves caused by powerful HF waves: Satuaration and dependence on ionospheric variability, J. Geophys.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-01-31","abstract":"Available from the publisher website at http:\/\/www.ann-geophys.net\/20\/41\/2002\/angeo-20-41-2002.html © Author(s) 2002. This work is distributed\\ud\nunder the Creative Commons Attribution 3.0 License.A new theory of the propagation of low power electromagnetic test waves through the upper-hybrid resonance layer in the presence of magnetic field-aligned plasma density striations, which includes the effects of multiple scatter, is presented. The case of sinusoidal striations in a cold magnetoplasma is treated rigorously and then extended, in an approximate manner, to the broad-band striation spectrum and warm plasma cases. In contrast to previous, single scatter theories, it is found that the interaction layer is much broader than the wavelength of the test wave. This is due to the combined electric fields of the scattered waves becoming localised on the contour of a fixed plasma density, which corresponds to a constant value for the local upper-hybrid resonance frequency over the whole interaction region. The results are applied to the calculation of the refractive index of an ordinary mode test wave during modification experiments in the ionospheric F-region. Although strong anomalous absorption arises, no new cutoffs occur at the upper-hybrid resonance, so that in contrast to the predictions of previous single scatter theories, no additional reflections occur there. These results are consistent with observations made during ionospheric modification experiments at Tromsø, Norway","downloadUrl":"http:\/\/hdl.handle.net\/2381\/709","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/709\/1\/angeo-20-41-2002.pdf","pdfHashValue":"38a9f2ed2f901ca178867b870d15273aaaf21862","publisher":"European Geosciences Union (EGU), Copernicus Publications, Springer Verlag (Germany)","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/709<\/identifier><datestamp>\n                2016-02-02T03:44:03Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nEffects of multiple scatter on the propagation and absorption of electromagnetic waves in a field-aligned-striated cold plasma:implications for ionospheric modification experiments<\/dc:title><dc:creator>\nRobinson, T. R.<\/dc:creator><dc:subject>\nIonosphere (active experiments; ionospheric irregularities)<\/dc:subject><dc:subject>\nRadio science (ionospheric propagation)<\/dc:subject><dc:description>\nAvailable from the publisher website at http:\/\/www.ann-geophys.net\/20\/41\/2002\/angeo-20-41-2002.html © Author(s) 2002. This work is distributed\\ud\nunder the Creative Commons Attribution 3.0 License.<\/dc:description><dc:description>\nA new theory of the propagation of low power electromagnetic test waves through the upper-hybrid resonance layer in the presence of magnetic field-aligned plasma density striations, which includes the effects of multiple scatter, is presented. The case of sinusoidal striations in a cold magnetoplasma is treated rigorously and then extended, in an approximate manner, to the broad-band striation spectrum and warm plasma cases. In contrast to previous, single scatter theories, it is found that the interaction layer is much broader than the wavelength of the test wave. This is due to the combined electric fields of the scattered waves becoming localised on the contour of a fixed plasma density, which corresponds to a constant value for the local upper-hybrid resonance frequency over the whole interaction region. The results are applied to the calculation of the refractive index of an ordinary mode test wave during modification experiments in the ionospheric F-region. Although strong anomalous absorption arises, no new cutoffs occur at the upper-hybrid resonance, so that in contrast to the predictions of previous single scatter theories, no additional reflections occur there. These results are consistent with observations made during ionospheric modification experiments at Tromsø, Norway.<\/dc:description><dc:date>\n2009-12-08T16:24:08Z<\/dc:date><dc:date>\n2009-12-08T16:24:08Z<\/dc:date><dc:date>\n2002-01-31<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAnnales Geophysicae: Atmospheres Hydrospheres and Space Science, 2002, 20 (1), pp.41-55<\/dc:identifier><dc:identifier>\nhttp:\/\/www.ann-geophys.net\/20\/41\/2002\/angeo-20-41-2002.html<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/709<\/dc:identifier><dc:identifier>\n10.5194\/angeo-20-41-2002<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:relation>\nRadio and Space Plasma Physics<\/dc:relation><dc:publisher>\nEuropean Geosciences Union (EGU), Copernicus Publications, Springer Verlag (Germany)<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007","Radio and Space Plasma Physics"],"year":2002,"topics":["Ionosphere (active experiments; ionospheric irregularities)","Radio science (ionospheric propagation)"],"subject":["Article"],"fullText":"Annales Geophysicae (2002) 20: 41–55 c© European Geophysical Society 2002\nAnnales\nGeophysicae\nEffects of multiple scatter on the propagation and absorption of\nelectromagnetic waves in a field-aligned-striated cold\nmagneto-plasma: implications for ionospheric modification\nexperiments\nT. R. Robinson\nUniversity of Leicester, Leicester, LE1 7RH, UK\nReceived: 14 August 2000 – Revised: 8 June 2001 – Accepted: 12 June 2001\nAbstract. A new theory of the propagation of low power\nelectromagnetic test waves through the upper-hybrid reso-\nnance layer in the presence of magnetic field-aligned plasma\ndensity striations, which includes the effects of multiple scat-\nter, is presented. The case of sinusoidal striations in a cold\nmagnetoplasma is treated rigorously and then extended, in\nan approximate manner, to the broad-band striation spectrum\nand warm plasma cases. In contrast to previous, single scat-\nter theories, it is found that the interaction layer is much\nbroader than the wavelength of the test wave. This is due\nto the combined electric fields of the scattered waves becom-\ning localised on the contour of a fixed plasma density, which\ncorresponds to a constant value for the local upper-hybrid\nresonance frequency over the whole interaction region. The\nresults are applied to the calculation of the refractive index of\nan ordinary mode test wave during modification experiments\nin the ionospheric F-region. Although strong anomalous ab-\nsorption arises, no new cutoffs occur at the upper-hybrid\nresonance, so that in contrast to the predictions of previous\nsingle scatter theories, no additional reflections occur there.\nThese results are consistent with observations made during\nionospheric modification experiments at Tromsø, Norway.\nKey words. Ionosphere (active experiments; ionospheric ir-\nregularities) Radio science (ionospheric propagation)\n1 Introduction\nOne of the most frequently observed and consistently char-\nacterised phenomena in experiments which modify the iono-\nspheric F-region by means of high power radio waves is\nthe anomalous absorption of low power test waves that tra-\nverse the heated volume. This effect was first discovered in\nionospheric modification (heating) experiments at Platteville\n(Cohen and Whitehead, 1970). Soon after being reported,\nanomalous absorption was explained in terms of the scat-\ntering of electromagnetic waves into high frequency electro-\nCorrespondence to: T. R. Robinson (txr@ion.le.ac.uk)\nstatic waves at the upper-hybrid resonance, due to the pres-\nence of small-scale plasma density irregularities (Graham\nand Fejer, 1976; Vaskov and Gurevich, 1976). These irreg-\nularities, which are strongly elongated along the direction of\nthe geomagnetic field, are generated by a high power electro-\nmagnetic pump wave in the vicinity of its own upper-hybrid\nresonance. They have been regularly observed by coherent\nbackscatter radars during ionospheric modification experi-\nments (Fialer, 1974; Minkoff et al., 1974; Hedberg et al.,\n1983; Robinson et al., 1997). Moreover, Minkoff (1974)\nhas shown that the spectral power of the irregularities pro-\nduced in heating experiments is primarly confined to cross-\nfield scale sizes in excess of 1 m. This result is also consistent\nwith the estimate of a few tens of km for the scale length of\nthe irregularities along the geomagnetic field line (Jones et\nal., 1984), since their aspect ratio is expected to be of the\norder of the ratio of the electron-neutral collision frequency,\nνen , to the electron gyro-frequency, . This ratio is around\na few times 10−4 in the F-region. The presence of these ir-\nregularities, together with the fact that anomalous absorption\nonly occurs for ordinary mode (O-mode) test waves and only\nfor overdense conditions, provides strong evidence for this\nfield-aligned striations-upper-hybrid resonance (FASTUHR)\ntheory. Extraordinary mode (X-mode) test waves do not suf-\nfer anomalous absorption, as expected from this theory, since\ntheir reflection point occurs below the upper-hybrid reso-\nnance height. For similar reasons, only an O-mode pump can\nexcite short-scale field-aligned plasma density irregularities\nand only in overdense conditions.\nIn several previous papers (Graham and Fejer, 1976; Vas-\nkov and Gurevich, 1976; Dysthe et al., 1983; Jones et al.,\n1984), calculations of the level of anomalous absorption of\na low power test wave have been carried out using the FAS-\nTUHR theory by straightforward energy considerations. This\ninvolves equating the vertical decay of the Poynting flux of\nthe incident electromagnetic wave with the Joule loss rate per\nunit volume due to scattering into electrostatic waves. Fur-\nthermore, in these previous calculations, it was assumed that\nthe propagation of the electromagnetic wave was unaffected\n42 T. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves\nby the striations. This essentially means that changes in the\nreal part of the refractive index of the test wave, due to the\npresence of the striations, were neglected, whilst those in the\nimaginary part were not. Hagfors (1984) was the first to point\nout the inconsistency of this assumption and showed that, in\nfact, there was necessarily a strong change in the real part of\nthe refractive index which lead to a new cutoff frequency at\nthe upper-hybrid resonance. This cutoff, in principle, causes\nreflection at the upper-hybrid resonance. Indeed, Mjølhus\n(1985), using a formulation similar to that of Hagfors (1984),\ndemonstrated that the anomalous absorption level could not\nexceed approximately 50% with the other 50% of the inci-\ndent energy being reflected.\nA further inconsistency in the anomalous absorption cal-\nculations of Graham and Fejer, (1976), Vaskov and Gurevich\n(1976), Dysthe et al. (1983) and Jones et al. (1984) is that a\nWKB approximation is used to integrate the loss rate across\nthe resonance layer. The problem here is that the width of\nthe upper-hybrid layer for exactly field-aligned irregularities\nis of the order of (νen\/ω)H , where ω\/2pi is the test wave\nfrequency and H is the scale height of the background elec-\ntron density. For typical F-region conditions, at altitudes\nof around 200 km, this layer is only a metre or so wide.\nThis is much smaller than the wavelengths of the test waves,\nwhich are typically several tens of metres. Under these con-\nditions the WKB approximation is invalid. It is, therefore,\nrather surprising that values of anomalous absorption levels\nobtained on the basis of the apparently inconsistent calcu-\nlations of Graham and Fejer, (1976), Vaskov and Gurevich\n(1976), Dysthe et al. (1983) and Jones et al. (1984) agree\nwell with the observations, whilst those of Mjølhus (1985) do\nnot. For example, levels of anomalous absorption observed at\nthe EISCAT high power facility at Tromsø can exceed 15 dB\n(Stubbe et al., 1982), which are clearly well beyond the up-\nper limit of around 3 dB predicted by Mjølhus (1985). On the\nbasis of their calculation, Jones et al. (1984) found that these\nlevels could be obtained with striation amplitudes, indicated\nby the fractional deviation in electron density, δ, of around\n1.5%. These striation amplitudes are also consistent with ob-\nserved backscatter radar cross sections (Minkoff, 1974).\nThe source of the difficulty is not too hard to find. All of\nthe above papers that deal with the FASTUHR theory effec-\ntively assume a weak scatter process, so that the test wave\nis scattered by a single Fourier component of the striations\ninto a single electrostatic mode. In the cold plasma approxi-\nmation, this electrostatic mode is non-propagating. Even un-\nder warm plasma conditions, the high frequency electrostatic\nwave propagates only at the electron thermal speed which\nis typically three orders of magnitude below the characteris-\ntic speed of the electromagnetic wave in the ionospheric F-\nregion. Thus, wave energy piles up in the upper-hybrid layer\nsuch that the electrostatic wave field is of the order of δω\/νen\ntimes the incident test wave electric field. This factor can\nbe much greater than unity under F-region conditions, which\nleads to a significant distortion of the refractive index of the\ntest wave in the vicinity of the upper-hybrid layer. Both the\nreal and imaginary parts are affected and hence, the possibil-\nity of new cutoffs, as demonstrated by Hagfors (1984). How-\never, an electrostatic wave with an amplitude larger than the\noriginal test wave can itself efficiently scatter into a further\nhigh frequency electrostatic mode. When δω\/νen is much\nlarger than unity, this process can repeat, in principle, ad\ninfinitum. Inhester et al. (1981) were the first to recognise\nthe importance of higher order scatter of this type in the in-\nstability process by which the short-scale field-aligned stria-\ntions are generated in the first place. Below, a new theory of\nanomalous absorption of a low power test wave by the FAS-\nTUHR process is developed, which completely takes into ac-\ncount scatter to effectively infinite order in a cold plasma. It\nturns out that the higher order scatter has a remarkable ef-\nfect on the nature of the resonance region. Instead of being\nonly a few metres wide, as predicted by the previous theo-\nries mentioned above, it becomes many hundreds of metres\nwide and, therefore, is much broader than the wavelength of\na typical test wave. Furthermore, the change in the refractive\nindex in the vicinity of the upper-hybrid resonance is now\nonly of the order of δ. With values of δ typically less than\n0.05, this has a negligible effect on the real part of the refrac-\ntive index of the test wave and hence, there are, in fact, no\nnew cutoffs. However, the change to the imaginary part of\nthe refractive index is of the same order and this does lead\nto significant absorption. Remarkably, this new calculation\npredicts levels of anomalous absorption that are virtually the\nsame as those predicted by the apparently inconsistent, single\norder scatter versions of the FASTUHR theory, cited above.\nVaskov (1988) has suggested that thermal effects are suffi-\ncient to broaden the resonance region and can alleviate some\nof the inconsistencies indicated above. However, as will be\ndemonstrated below, the resonance broadening due to higher\norder scatter, even in a cold plasma approximation, is greater\nthan that due to thermal effects. The physical reasons for the\nbroadening due to higher order scatter, which will also be\ndealt with below, are particularly interesting. They are asso-\nciated with the localisation of the combined electric fields of\nthe scattered waves. This leads to a remarkably simple inter-\npretation in which the interaction layer is actually distorted\nin such a way that it follows the contours of the constant local\nupper-hybrid frequency. Indeed, it is the localisation effect in\nthe cold plasma, rather than thermal effects, that ultimately\nlimits the width of the resonance.\nBefore developing an expression for the complex refrac-\ntive index of electromagnetic waves due to FASTUHR with\nmultiple scattering effects in Sect. 3 below, the properties of\ncold plasma waves are briefly reviewed in Sect. 2. The pur-\npose of this review is to clarify the physical processes that\nneed to be considered when coupling is introduced between\nthe electrostatic and electromagnetic waves. Anomalous ab-\nsorption and propagation calculations appropriate to iono-\nspheric modification experiments will be presented in Sect. 4.\nA discussion of the physical basis of the new theory, together\nwith certain thermal effects will be treated in Sects. 5 and 6,\nrespectively.\nIt should be stressed that only the effects on low power test\nwaves are considered in the present paper and the striations\nT. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves 43\nare regarded as pre-existing features which are not affected\nby the test wave. The case of a monochromatic k-spectrum of\nstriations will be treated rigorously and then the broad-band\ncase will be dealt with by extending the monochromatic re-\nsult in an approximate way. The related issue of the genera-\ntion of the striations by a high power electromagnetic pump\nwave will also be touched on briefly, but a detailed discus-\nsion of this important topic is beyond the scope of the present\npaper and will be treated in a future publication. Finally, the\ntopic of anomalous absorption in the vicinity of harmonics of\nthe electron gyro-frequency will not be treated in this paper,\nsince it is strictly beyond the scope of cold plasma theory.\nIt will, therefore, be assumed that the present theory applies\nonly to test waves with frequencies which are not close to the\nharmonics of the electron gyro-frequency.\n2 Electromagnetic waves and the upper-hybrid reso-\nnance\nThe purpose of this section is to review the dispersive proper-\nties and field equations for electromagnetic and electrostatic\nmodes in a uniform cold magnetoplasma. Strictly speak-\ning, there are no propagating electrostatic waves in a cold\nplasma. Instead, they correspond to resonances in which the\nrefractive index tends towards infinity (Stix, 1992). However,\nthese oscillations do have well-defined wavevectors and can\nbe treated as longitudinal waves propagating at speeds much\nsmaller than the speed of light. This approach, which follows\nHagfors (1984) and Mjølhus (1985), makes it possible to es-\ntablish the relationship between the electric field and elec-\ntric current oscillations for the two modes. This facilitates\na straightforward and clear extension to the coupled mode\ncase, in the presence of irregularities in the plasma density.\nIn addition, in what follows, only electron dynamics needs to\nbe considered and ion motion is neglected.\nThe usual Maxwell equations for oscillations in the elec-\ntromagnetic fields and currents of the form exp[i(k · x−ωt)]\nlead to the relation\nn2\n(\nE(k, ω)− k1k1 ·E(k, ω)\n)\n−E(k, ω)\n= iµ0c\n2\nω\nJ (k, ω) (1)\nwhere n,E(k, ω) and J (k, ω) are the general refractive in-\ndex, electric field and current density, respectively. Also in\nEq. (1), µ0 is the permeability of free space, c is the speed\nof light, ω and k are the wave frequency and wavevector, re-\nspectively, and k1 is a unit vector along k. It is assumed in\nwhat follows that the unstriated background plasma is only\nweakly inhomogeneous and has a small uniform gradient\nwith a characteristic scale length that is much larger than the\nwavelength of any wave present. Thus, in the absence of\nplasma density striations, the only contribution to the current\ndensity is\nJ (k, ω) = −N0eV (k, ω) (2)\nwhere N0 is the background electron density, e is the size\nof the electronic charge and V (k, ω) represents the electron\nvelocity. In the presence of a background magnetic field and\ncollisions between electrons and neutrals, V (k, ω) is given\nby\nV (k, ω) = − i\n(1+ iZ)2 − Y 2\n(\n(1+ iZ)Y\nB0\nE(k, ω)\n− Y\n3\n(1+ iZ)B0 b1b1 ·E(k, ω)+\niY 2\nB0\nb1 ∧E(k, ω)\n)\n(3)\nwhere Y = \/ω,Z = νen\/ω and, B0 is the flux density of\nthe background geomagnetic field, and b1 is a unit vector in\nthe geomagnetic field direction. It is important to notice that\nin the cold plasma approximation, V (k, ω) is always inde-\npendent of the plasma density. It is just proportional to the\nelectric field strength and contains no nonlinear components\n(unless the electron particle velocities approach the speed of\nlight, which they do not in the present low power test wave\ncase).\nSubstituting Eq. (3) into (2) and then (2) into (1) yields\n(5+ 6)E(k, ω) = 0 (4)\nwhere 5 and 6 are matrices of the form\n5 =\n n2 cos2 θ − 1 0 −n2 cos θ sin θ0 n2 − 1 0\n−n2 cos θ sin θ 0 n2 sin2 θ − 1\n (5)\n6 = X\n(1+ iZ)2 − Y 2\n1+ iZ −iY 0iY 1+ iZ 0\n0 0 (1+iZ)\n2−Y 2\n1+iZ\n (6)\nand where X = (ωe\/ω)2 and ωe is the electron plasma fre-\nquency. In what follows, the coordinate system will always\nbe chosen so that the z-axis is along b1. In Eq. (5), θ is the\nangle between k and b1. Thus far, the direction of k and con-\nsequently the value of θ is arbitrary. Furthermore, the direc-\ntion of k will, in general, vary as the wave propagates through\nthe inohogeneous plasma. However, the geometry for a typi-\ncal ionospheric modification experiment under consideration\nbelow involves only vertical propagation of electromagnetic\ntest waves in a horizontally stratified plasma. This case is\nadequately handled by choosing k for the electromagnetic\nmodes (but not the electrostatic ones, see below) to be paral-\nlel to the weak background density gradient. This means that\nthe direction of k and the value of θ may be taken as constant\nover the inhomogeneous plasma layers. This greatly simpli-\nfies the propagation calculations in Sect. 4 below, where k is\nchosen to lie in the x−z plane for all electromagnetic modes\nconsidered.\nThe matrix Eq. (4) then has the explicit form n2 cos2 θ − S −iD −n2 cos θ sin θiD n2 − S 0\n−n2 cos θ sin θ 0 n2 sin2 θ − P\n ·\nExEy\nEz\n = 0\n(7)\n44 T. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves\nwhere\nS = 1− X(1+ iZ)\n(1− iZ)2 − Y 2\nD = XY\n(1+ iZ)2 − Y 2\nP = 1− X\n1+ iZ\nThe column vector which follows the 3× 3 matrix in Eq. (7)\nrepresents the cartesian components of the electric field of\nthe wave. To obtain the dispersion relation for the waves, the\ndeterminant of the 3×3 matrix in Eq. (7) is set to equal zero,\nwhich yields the well-known expression\nn =\n√\nB ±√B2 − 4AC\n2A\n(8)\nwhere\nA = S sin2 θ + P cos2 θ\nB = (S2 −D2) sin2 θ + PS( cos2 θ + 1) (9)\nC = P (S2 −D2)\nThe electromagnetic modes of interest correspond to so-\nlutions of Eq. (8) in which the condition 0 ≤ |n| ≤ 1 is\nsatisfied. The positive sign option in Eq. (8) is associated\nwith the O-mode and the negative option with the X-mode.\nThe properties of electrostatic waves in cold plasma can\nalso be obtained from the above expressions. In warm plas-\nmas, the characteristic propagation speed of high frequency\nelectrostatic waves is the electron thermal speed. In the cold\nplasma approximation, this characteristic speed necessarily\ntends towards zero. Thus, in this approximation, electrostatic\nwaves correspond to the resonance limit, n → ∞. From\nEq. (1), this implies that\nk ∧ k ∧E(k, ω) = 0 (10)\nand hence, that E(k, ω) lies in the direction of k. Thus,\nE(k, ω) = E(k, ω)k1 (11)\nwhere k1 is a unit vector along k. Furthermore, the scalar\nproduct of k1 with Eq. (1) yields the field equation for the\nelectrostatic oscillations, which takes the form\n−E(k, ω)− iµ0c\n2\nω\nk1 · J (k, ω) = 0 (12)\nIn matrix form, Eq. (12) is\nk1 (−I+6) k1E(k, ω) = 0 (13)\nwhere I is the unit matrix.\nA further necessary condition in the resonance limit isA =\n0, which from Eq. (9) yields\nX = (1+ iZ) (1+ iZ)2 − Y 2(\n1+ iZ)2 − Y 2 cos2 θ (14)\nIn what follows, the main interest will be in electrostatic\nwaves that have wavevectors orthogonal to the background\nmagnetic field and hence, θ = pi\/2. This requires S = 0 and\nthen\nX =\n(\n1+ iZ)2 − Y 2(\n1+ iZ) (15)\nThe expression in Eq. (15) corresponds to the upper-hybrid\nresonance in the collisional case.\n3 Effects of field-aligned plasma striations\n3.1 The coupled equations\nIn the following, it is assumed that an electromagnetic wave\nwith an electric field E(m, ω) and wavevector m propagates\nvertically at an angle θ to the background magnetic field.\nSince the wavevector of all electromagnetic modes has been\nassumed to lie in the x − z plane, this implies that the x-\naxis lies in the vertical plane, orthogonal to the geomag-\nnetic field. The electromagnetic wave gives rise to an elec-\ntron velocity,V (m, ω), in the plasma. It is assumed that\nthere is a preexisting set of plane standing monochromatic\nplasma density striations with electron densities of the form\nN(s, 0) + N(−s, 0), in addition to the background density.\n±s are the wavevectors of the striations and are assumed to\nbe orthogonal to the background magnetic field. The zeros\nin the second element of the argument in the striation den-\nsity indicates that they have zero frequency in the frame of\nthe background plasma. The presence of the striations leads\nto new oscillating current densities in addition to those rep-\nresented by Eq. (2) above. These currents constitute two\nsidebands in the k-space which, in a weakly inhomogeneous\nbackground plasma density, take the form\nJ (m± s, ω) = −N(±s, 0)eV (m, ω) (16)\nNow these currents can be inserted as additional terms\nin the field equations of the type expressed in Eq. (13), for\na pair of high frequency electrostatic waves with electric\nfields E(m ± s, ω). It will be assumed in what follows that\n|m| \u001c |s|, so that these electrostatic waves will also have\nwave vectors parallel to s and orthogonal to the background\nmagnetic field. It will be shown below that the electrostatic\nfields are large in the vicinity of the upper-hybrid resonance\nand will, in turn, give rise to a pair of electron velocities\nV (m ± s, ω), which will, in turn, give rise to further higher\norder current density sidebands (in the k-space) of the form\nJ (m ± 2s, ω) and also J (m, ω). These will provide addi-\ntional contributions to the currents associated with the orig-\ninal electromagnetic wave, as well as to two further electro-\nstatic waves. The generation of electric field sidebands with\nwavevectors which are multiples of s and all with frequency\nω can continue in this way ad infinitum. This leads to a set\nof coupled equations for the electromagnetic and the electro-\nstatic wave fields. Defining δ(±s, 0) as N(±s, 0)\/N0 and s1\nT. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves 45\nas a unit vector along s (i.e. orthogonal to the geomagnetic\nfield), these field equations take the form(\n5+ 6)E(m, ω)+ 6s1(δ(s, 0)E(m− s, ω)\n+ δ(−s, 0)E(m+ s, ω)\n)\n= 0 (17)\ns1\n(− I+6)s1E(m+ s, ω)\n+ s16\n(\ns1δ(−s, 0)E(m+ 2s, ω)\n+ δ(s, 0)E(m, ω)\n)\n= 0 (18)\ns1\n(− I+6)s1E(m− s, ω)\n+ s16\n(\ns1δ(s, 0)E(m− 2s, ω)\n+ δ(−s, 0)E(m, ω)\n)\n= 0 (19)\nand for integer p satisfying |p| > 1\ns1\n(− I+6)s1E(m+ ps, ω)\n+ s16s1\n(\nδ(−s, 0)E(m+ (p + 1)s, ω))\n+ δ(s, 0)E(m+ (p − 1)s, ω) = 0 (20)\nEq. (17) above is derived from Eqs. (3) and (4) and is es-\nsentially the modified field equation for the electromagnetic\nwave. Equations (18) and (19) are derived from Eqs. (3)\nand (13) for electrostatic waves with sideband currents in-\nvolving those caused directly by the electromagnetic wave.\nEquation (20) is derived from Eqs. (3) and (13) and really\nstands for an infinite set of equations which apply to all\nthe higher order purely electrostatic interactions with inte-\nger p satisfying |p| > 1. The solution to the set of coupled\nEqs. (17) to (20) is found below.\n3.2 The coupling function\nAlthough it might at first sight be thought that the solution of\nthe infinite set of coupled equations above presents formida-\nble problems, the special symmetric form of the infinite set\nof equations represented by Eq. (20), with |p| > 1, lends\nitself to a rather simple analysis. A little care needs to be\nexercised by treating the sidebands with positive and negative\np slightly differently. Although for positive p, p + 1 is of a\nhigher order than p, for the negative values of p, p − 1 is of\na higher order than p.\nFirst, Eq. (20) is divided throughout by E(m + ps, ω).\nThen, after evaluating the matrices, the following expression\nis obtained for positive p,\n1− x−srp+1 − x+sr−1p = 0 (21)\nwhere\nrp = E\n(\nm+ (p + 1)s, ω)\nE(m+ ps, ω) (22)\nx±s = δ(±s, 0)W1−W (23)\nW = X(1+ iZ)\n(1+ iZ)2 − Y 2 (24)\nIn evaluating the matrices, it is assumed that\ns1 = (cosα, sinα, 0) (25)\nwhere α is the azimuthal angle of s in the plane orthogonal to\nthe background magnetic field (i.e. in the x−y plane). Equa-\ntion (21) can then be solved iteratively to yield a continued\nfraction of the form\nrp = x+s\n1− x−sx+s\n1− x−sx+s\n1− · · ·\n(26)\nIt should be noted that the continued fraction in Eq. (26)\nhas a self-similarity and simply yields\nrp = x+s1− x−srp (27)\nComparing this with Eq. (21) indicates that rp and rp+1\nare identical. Thus, rp is independent of p and the subscript\nmay be dropped. Equation (27) is then a quadratic in r and\nyields the usual pair of complementary solutions. The neg-\native square root is chosen here as this ensures that the cou-\npling function, r , tends towards zero, away from the upper-\nhybrid resonance region, as would be expected on physical\ngrounds. Thus,\nr =\n1−W −\n√\n(1−W)2 −W 2δ20\n2Wδ(−s), 0 (28)\nwhere\nδ20 = 4δ(s, 0)δ(−s, 0) (29)\nConsidering definition (29), it is also convenient to choose\nδ(−s, 0) to be the complex conjugate of δ(s, 0). Then, δ0 is\nthe total amplitude of the fractional electron density perturba-\ntion in the striations. This also means that δ(s, 0)+ δ(−s, 0)\nis real and is just equal to δ0. A similar procedure is used\nfor the negative values of p, when p < −1. Writing\nq = E(m+ (p− 1)s, ω)\/E(m+ps, ω), subject to the latter\ninequality, then q satisfies\nq = x−s\n1− x+sq (30)\nThus, q−1 satisfies the same quadratic as r and conse-\nquently, q is either identical to r−1 or q−1 and r form a pair\nof complementary solutions to the quadratic. The latter op-\ntion is chosen here, for reasons indicated below. If q−1 is\ncomplementary to r , then q is given by\n1\nq\n=\n1−W +\n√\n(1−W)2 −W 2δ20\n2Wδ(−s, 0) (31)\nAfter some manipulation, this leads to\nq =\n1−W −\n√\n(1−W)2 −W 2δ20\n2Wδ(s, 0)\n(32)\n46 T. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves\nThe negative square root now appears in Eq. (32) for q,\nwhich is virtually identical to Eq. (28) for r . The reason for\nthe choice of a positive square root in Eq. (31) is now clear.\nAs with r , it ensures that q also goes to zero, away from\nthe upper-hybrid resonance. Furthermore, only the products\nrδ(−s, 0) and qδ(s, 0) appear in the coupled field equations.\nThen, Eqs. (28) and (32) imply that negative and positive\norder contribute equally to the coupling. Writing\nF = rδ(−s, 0) =\n1−W −\n√\n(1−W)2 −W 2δ20\n2W\n(33)\nand inserting F into Eqs. (17), (18) and (19) yields the mod-\nified dispersion relation for the electromagnetic waves in the\npresence of the striations.\n3.3 The modified electromagnetic dispersion function\nInserting F into Eqs. (18) and (19) yields expressions for\nE(m+s, ω) and E(m−s, ω) in terms ofE(m, ω). Inserting\nthese results into Eq. (17) then yields the purely electromag-\nnetic field equation of the form\n(5+6 +1)E(m, ω) = 0 (34)\nwhere\n1 = −δ\n2\n0\n2\n(6s1) (s16)\ns1 (−I+ 6) s1 + F s16s1\nIn explicit matrix form, Eq. (34) is then n2m cos2 θ − S1 −iD1 −n2m cos θ sin θ−iD2 n2m − S2 0\n−n2m cos θ sin θ 0 n2m sin2 θ − P\n\n\nEmx\nEmy\nEmz\n = 0\n(35)\nwhere\nn2m =\nc2\nω\nm2\nand a unit vector, m1, in the direction of m is\nm1 = (sin θ, 0, cos θ)\nAlso,\nS1 = S −11x S2 = S −12y\nD1 = D + i11y D2 = D − i12x\n11x = G\n[\n(1+ iZ)2 cos2 α + Y 2 sin2 α\n]\n11y = G\n([\n(1+ iZ)2 − Y 2\n]\nsinα cosα − i (1+ iZ) Y\n)\n12x = G\n([\n(1+ iZ)2 − Y 2\n]\nsinα cosα + i (1+ iZ) Y\n)\n12y = G\n[\n(1+ iZ)2 sin2 α + Y 2 cos2 α\n]\nG = − δ\n2\n00V\n2\n[\n(1+ iZ)2 − Y 2]2\nδ00 = Xδ0\nV = 1\nW(1+ F)− 1\nIt should be noted that δ00 is defined so that |N(s, 0)| does\nnot itself vary with altitude, even though N0 is assumed to be\nweakly inhomogeneous. This is a somewhat arbitrary defini-\ntion and reduces simply to a matter of choosing which height\nto fix a value of N0. Here, the expression for δ00 is con-\nsistent with choosing the reflection height at which X = 1.\nThis follows previous calculations in Jones et al. (1984) and\nRobinson (1989). The modified refractive index is then ob-\ntained explicitly by setting the determinant of the 3×3 matrix\nin Eq. (35) to zero, which yields\nnm =\n√√√√B1 ∓√(B21 − 4A1C1)\n2A1\n(36)\nwhere\nA1 = S1 sin2 θ + P cos2 θ\nB1 =\n(\nS1S2 −D1D2\n)\nsin2 θ + P\n(\nS2 cos\n2 θ + S1\n)\nC1 = P\n(\nS1S2 −D1D2\n)\nBefore looking in more detail at the form of the refractive\nindex in Eq. (36), it is worthwhile examining the form of the\nupper-hybrid resonance in this new formulation.\n3.4 The upper-hybrid resonance region\nThe form of the upper-hybrid resonance in the present for-\nmulation, which takes into account higher order scatter, is\nsignificantly different from that obtained by previous authors\nwho only included first order scatter (see Hagfors, 1984 and\nMjølhus, 1985). The coupling function, r , in Eq. (28) gov-\nerns the ratio of the size of any given wave amplitude to\nthat of the next highest order sideband. Its structure across\nthe upper-hybrid resonance is calculated below for the case\nwhen a linear background density as a function of altitude\nis assumed. The calculations below are greatly simplified if\nthe propagation direction is taken along the density gradient,\nwhich is assumed to be vertical. Defining a scaled coordinate\nlength, h, in units of H , in the direction of m1, then\nX = 1+ h (37)\nThus, actual distances in the vertical direction is just hH .\nClearly, Eq. (37) implies X = 1 at the origin, which thus\ncoincides with the reflection point of the ordinary electro-\nmagnetic mode. Inserting Eq. (37) into Eq. (28) then yields,\nfor r as function of ζ = (h+ Y 2)\/δ00\nr = −ζ + iZ\n(\n1+ Y 2)\nδ00\n−\n√\n−ζ + iZ (1+ Y 2)\nδ00\n− 1 (38)\nThe real and imaginary parts of r as a function of ζ in the\nvicinity of the upper-hybrid layer (at h = Y 2 and ζ = 0,\nare displayed in Fig. 1. Typical values of Z = 10−5 and\nY = 0.3, which are applicable to F-region conditions and a\nhigh frequency radio wave have been used. In addition, since\nthe experimentally determined amplitudes of the striations\nare quoted in terms of their root-mean-square (rms) values,\nT. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves 47\n-2 -1 1 2 Ζ\n-1\n-0.8\n-0.6\n-0.4\n-0.2\nIm\u0002r\u0003 b\n∆rms\u0004 0.015\nY\u0004 0.3\n-2 -1 1 2 Ζ\n-1\n-0.5\n0.5\n1\nRe\u0002r\u0003 a\n∆rms\u0004 0.015\nY\u0004 0.3\nFig. 1Fig. 1. The real (a) and imaginary (b) parts of the multiple scatter\ncoupling function, r , as a function of coordinate, ζ .\nδrms = δ00\/\n√\n2 has been used to define this parameter in\nthe calculations which follow. Here, a fairly typical value of\nδrms = 0.015 has been employed (Robinson, 1989). Thus,\nthe condition Z\/δ00 \u001c 1 is strongly satisfied.\nThe two most striking characteristics of the function r in\nFig. 1 are first, that its imaginary part is only significantly\ndifferent from zero for values of h between −Y 2 ± δ0 (i.e.\nbetween −1 ≤ ζ ≤ 1). This is a result of the expression\nwithin the square root in Eq. (38) being essentially negative\nin this interval, even in the absence of collisions. Thus, the\nresonance width is 2δ00H . The real part of r is linear in this\ninterval. Second, the sizes of both real and imaginary parts\nof r peak at a value very close to unity. Indeed, this value is\nexactly unity in the limit of no collisions, when Z → 0, as\nis clear from Eq. (38). The value of |r|2 is almost constant\nand close to unity throughout the interval h = −Y 2 ± δ00, as\nindicated in Fig. 2, which also contains the phase of r, φr . In\naddition, the value of φr changes by pi across the resonance\ninterval. It is interesting to note that the results in Figs. 1\nand 2 show that the scattered waves are all equal in amplitude\nand essentially (see Sect. 5 below) also equal to the ampli-\ntude of the test wave, within the resonance interval between\n−Y 2 ± δ00. The fact that the width of the upper-hybrid res-\nonance is much broader than that predicted by single scatter\ntheory can be seen by comparing the curves in Fig. 1 to those\n-2 -1 1 2 Ζ\n\u0003Π\n\u0003\nΠ\n\u0005\u0005\u0005\u0005\n2\nΦr b\n∆rms\b 0.015\nY\b 0.3\n-2 -1 1 2 Ζ\n0.2\n0.4\n0.6\n0.8\n1\n\u0002r\u0002^2 a\n∆rms\b 0.015\nY\b 0.3\nFig. 2Fig. 2. The amplitude squared (a) and phase (b) of the multiple\nscatter coupling function, r , as a function of coordinate, ζ .\nin Fig. 3, in which the values of the real and imaginary parts\nof the function s, where\nrs = 12\nδ00W\n1−W =\n1\n2\n(\n−ζ + iZ\n(\n1+ Y 2)\nδ00\n)−1\n(39)\nhave been plotted. The corresponding amplitude and phase\ncurves for rs are also plotted in Fig. 4. rs is the ratio of the\namplitude of the electric field of the pair of electrostatic wave\nsidebands to that of the electromagnetic test wave in the sin-\ngle scatter approximation and is found by setting the last\nterm on the LHS of Eq. (21) to zero. In the present example,\nwith Z \u001c δ00, it is clear that the width of rs is much smaller\nthan that of r . Further, |rs | peaks at values much larger than\nunity. Moreover, in the limit as Z → 0, the peak of |rs | con-\ntinues to grow as its width becomes smaller, in contrast to\nr , whose amplitude just converges to unity and whose width\nconverges to 2δ00. Despite the obvious differences between\nthe functions r and rs , it turns out that the areas under the\ncurves representing their respective imaginary parts are equal\nin the limit of small Y . This result can easily be appreciated\nby noting that the amplitude of Im(r) is 1, whilst its width\n(in terms of h) is 2δ00. Thus, its area is of the order of δ00.\nNow the width of the Imrs curve is 2Z and its amplitude is\nδ00\/Z. Thus, its area is also approximately δ00. Since it is\nthese imaginary parts that determine the levels of anomalous\n48 T. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves\n-0.004 -0.002 0.002 0.004 Ζ\n-1500\n-1000\n-500\nIm\u0002rs\u0003 b\n∆rms\u0004 0.015\nY\u0004 0.3\n-0.004 -0.002 0.002 0.004 Ζ\n-1000\n-750\n-500\n-250\n250\n500\n750\n1000\nRe\u0002rs\u0003 a\n∆rms\u0004 0.015\nY\u0004 0.3\nFig. 3Fig. 3. The real (a) and imaginary (b) parts of the single scatter\nresonance function, rs , as a function of coordinate, ζ .\nabsorption of the test wave (see Sect. 4), this explains why\nsingle scatter theory (if changes to the real part of the refrac-\ntive index are ignored) gives the same result for anomalous\nabsorption as the more rigorous multiple scatter theory.\n4 Calculation of propagation and absorption effects\nUsing Eq. (36), the real and imaginary parts of the modified\nrefractive index of an O-mode electromagnetic test wave in a\ncold plasma with field-aligned plasma density striations have\nbeen calculated as functions of scaled altitude, h. In this cal-\nculation, the angle between the magnetic field and the test\nwave propagation direction, θ , is taken as 12◦, which is con-\nsistent with the geomagnetic field geometry at the site of the\nhigh power facility at Tromsø. In addition, the value of the\nangle α, between the normal to the plane of the striations and\nthe plane containing both the magnetic field and the test wave\npropagation direction is chosen arbitrarily to be 0◦in this ex-\nample. The resulting curves are displayed in Fig. 5. Values\nof Y,Z and δ00 are the same as those for Figs. 1 to 4, above.\nPanel (a) in Fig. 5 also contains the real part of the refractive\nindex in the absence of striations, as a dashed curve. The\nfact that this dashed curve is virtually obliterated by the solid\ncurve which represents the case with striations is testament\nto the fact that the striations have a negligible effect on the\n-0.004 -0.002 0.002 0.004 Ζ\n\u0003Π\n\u0003\nΠ\n\u0005\u0005\u0005\u0005\n2\nΦs b\n∆rms\b 0.015\nY\b 0.3\n-0.004 -0.002 0.002 0.004 Ζ\n500000\n1\t106\n1.5\t106\n2\t106\n2.5\t106\n3\t106\n3.5\t106\n\u0002rs\u0002^2 a\n∆rms\b 0.015\nY\b 0.3\nFig\u0001.4Fig. 4. The amplitude squared (a) and phase (b) of the single scatter\nresonance function, rs , as a function of coordinate, ζ .\nreal part. Thus, the striations do not affect the propagation\n(i.e. phase and group speed) of the test wave in the vicinity\nof the upper-hybrid resonance, which is near h = 0.09 in the\npresent example. With the present striation amplitude, it is\nclear that a new cutoff at the upper-hybrid resonance, pre-\ndicted by the single scatter theory (Hagfors, 1984), does not\nactually occur. The striations do, however, have a significant\neffect on the imaginary part of the refractive index, as is clear\nfrom panel (b). Although much less than Re(nm), Im(nm)\nacquires a positive value in the vicinity of the upper-hybrid\nresonance, which is much greater than that due to collisions.\nThis indicates strong absorption. The shape of the Im(nm)\ncurve in the interval h = −Y 2 ± δ00 is similar in form to that\nof Im(r) in Fig. 1, panel(b), though of opposite sign.\nThe dependence of the above results on the orientation\nof the striations, as defined by the angel α, in relation (25)\nwas also investigated. It was found that the results were only\nvery weakly dependent on this parameter. This is not too sur-\nprising since at the upper-hybrid resonance, the electric field\nof the electromagnetic test wave is almost exactly circularly\npolarised in a plane orthogonal to the background magnetic\nfield and is thus rather insensitive to azimuth in this plane.\nThe value of the anomalous absorption, 0, for the test\nwave propagating vertically and at a small angle to the back-\nground magnetic field, in traversing the upper-hybrid reso-\nT. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves 49\n-0.3 -0.25 -0.2 -0.15 -0.1 -0.05 0 h\n0.001\n0.002\n0.003\n0.004\n0.005\nIm\u0002nm\u0003 b\n∆rms\u0003 0.015\nY\u0003 0.3\ndB\u0003 10.6\n-0.3 -0.25 -0.2 -0.15 -0.1 -0.05 0 h\n0.2\n0.4\n0.6\n0.8\n1\nRe\u0002nm\u0003 a\n∆rms\u0003 0.015\nY\u0003 0.3\n         Fig.5Fig. 5. The real (a) and imaginary (b) parts of the refractive index,\nnm, of an O-mode test wave, as a function of scaled height coordi-\nnate, h, for the rms fractional striation amplitude, δrms = 0.015.\nnance, is easily obtained from\n0 = 4Hω\nc\n∞∫\n−∞\nIm(nm)dh (40)\nThe factor of 4 in Eq. (40) allows for the fact that the power\nin the wave is proportional to its amplitude squared and that\nthe wave traverses the upper-hybrid resonance twice, in prop-\nagating from the ground and reflecting from the layer where\nX = 1. Equation (40) correctly predicts the levels of ab-\nsorption since the width of the resonance is much larger than\nthe wavelength of a typical test wave. In the example un-\nder consideration, with H = 40 km, the width of the reso-\nnance is 1.6 km and the wavelength of the test wave at the\nupper-hybrid resonance, allowing for refraction, is approx-\nimately 120 m. Thus, the resonance is many wavelengths\nwide. However, the observed scale length of the striations\nalong the geomagnetic field of a few tens of km (Jones et\nal. 1984) means that the amplitude of the striations, δ00, can\nstill be considered as constant over the resonance interval.\nThe corresponding value of 0 is 10.6 dB, which is consistent\nwith that observed during ionospheric modification experi-\nments using the high power facility at Tromsø (Robinson,\n1989).\nIn the limit of small Y , Eq. (40) approximates to\n0 = piδ200\nHω\nc\n1√\nY\n(41)\nwhich is identical to that obtained by Gurevich (1978) and\nJones et al. (1984), using energy considerations and single\nscatter theory. Expression (41) indicates that 0 is propor-\ntional to δ00 and is independent of νen.\nFinally, in this section, it is worth briefly examining\nwhether there are circumstances under which the propaga-\ntion of a test wave could be affected if the striation amplitude\nwere large enough. Curves for the case when δrms = 0.1\nare displayed in Fig. 6. The first thing to notice about these\ncurves is that the width of the resonance region is signifi-\ncantly broader than that in Fig. 5, as expected. However,\nalthough the distortion to the Re(nm) curve, which is brought\nabout by the striations, is more noticeable than in Fig. 5, it is\nstill not substantial and certainly is far from introducing any\nnew cutoff. What is significant here is the anomalous absorp-\ntion level, which turns out to be 2230 dB. This is of course\nunrealistically large. It should be kept in mind that any high\npower pump wave which creates striations in an ionospheric\nmodification experiment also undergoes anomalous absorp-\ntion at similar and usually greater levels than lower power\ntest waves. Since the high power wave has to overcome\nits own self-absorption in these circumstances (Robinson,\n1989), this exceptionally high level of anomalous absorption\nmeans that the high power wave would extinguish itself be-\nfore it penetrated even a tiny fraction of the resonance region.\nThus, values of δrms of the order of 0.1 are probably not prac-\ntically achievable. Thus, it is unlikely that a new cutoff at the\nupper-hybrid resonance could ever be produced by the action\nof a high power radio wave in the ionosphere, at least with\nthe present capabilities.\n5 Nature of the resonance broadening process\n5.1 The case of sinusoidal striations\nAt first sight, the broadening of the upper-hybrid resonance\nseems puzzling. After all, all of the individual resonances\nassociated with each order of the scattered electrostatic wave\nfields appear to occur at precisely the same altitude, i. e.\nwhere condition (15) is satisfied. However, further consid-\nerations indicate that there is actually some uncertainty in\nthe position of the resonance, due to the variation in the\nplasma density in the plane perpendicular to the magnetic\nfield, which is due to the striations. However, it is not imme-\ndiately obvious how variations in plasma density in the per-\npendicular plane might affect the position of the resonance\nalong the ζ coordinate. Although x and ζ are not exactly\northogonal, in general, they may be taken to be close to or-\nthogonal in most cases of interest. To explain this remarkable\nbroadening effect, it is necessary to evaluate the plasma den-\nsity ‘seen’ by the electric field in the resonance region. Since\nthe results above are essentially independent of the azimuthal\n50 T. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves\n-0.3 -0.25 -0.2 -0.15 -0.1 -0.05 0 h\n0.005\n0.01\n0.015\n0.02\n0.025\n0.03\n0.035\nIm\u0002nm\u0003 b\n∆rms\u0003 0.1\nY\u0003 0.3\ndB\u0003 2230.\n-0.3 -0.25 -0.2 -0.15 -0.1 -0.05 0 h\n0.2\n0.4\n0.6\n0.8\n1\nRe\u0002nm\u0003 a\n∆rms\u0003 0.1\nY\u0003 0.3\n         Fig.6Fig. 6. Same as in Fig. 5, but with δrms = 0.1.\nangle, α, of vector s1, in what follows, s1 will be taken along\nthe x-axis. Then, with the aid of Eqs. (18) and (28), the first\norder electrostatic field can be expressed in terms of the elec-\ntromagnetic wave amplitude as\nE (m+ s, ω) = rE0 (42)\nwhere E0 is Emx − iYEmy . The total electric field, 6E , of\nall of the superposed electrostatic waves is then just\n6E = E0\n∞∑\np=0\nrp\n(\nexp(ipsx)+ exp(−ipsx)) (43)\nwhere s is |s|. The sums of the pair of infinite geometric\nseries in Eq. (43) are easily evaluated, so that the size of the\nfield |6E | is just\n|6E| = |E0|\n√\nA2\nB2\n(44)\nwith\nA2 = 1− (r + r∗) cos(sx)+ r∗r cos2(sx)\nB2 = 1+ 4r∗r cos2(sx)+ (r∗r)2 + (r∗2 + r2)\n− 2(r + r∗)(1+ r∗r) cos(sx)\nwhere r∗ is the complex conjugate of r . It has been assumed,\nin writing Eq. (44), that the ratio of each successively higher\norder term to its predecessor is less than unity, as will be-\ncome clear below. The most straightforward way to simplify\nEq. (44) is to write Eq. (38) as\nr − 2R + r−1 = 0 (45)\nwhere\nR = −ζ + iZ\n(\n1+ Y 2)\nδ00\nThen, from Eq. (45), it may be shown that\n1+\n(\nr∗2 + r2\n)\n+ (rr∗)2 = (r + r∗)2 + (1− r∗r)2 (46)\nand(\n1− r∗r) = −2ImR\nImr\nrr∗ (47)\nThen, with Z\/δ00 \u001c 1, the following relations are satified to\nhigh accuracy, within the resonance interval\nr∗r = 1 (48)\nImr = −\n√\n1− ζ 2 (49)\nRer = −ζ (50)\nThe RHS of Eq. (47) is very small and positive. Although\nEq. (48) is correct to a very good approximation, Eqs. (47)\nto (50) together imply that r∗r is just slightly smaller than\n1, allowing the sum to infinity in Eq. (43) to be performed\nlegitimately. Substituting Eqs. (46) to (50) into Eq. (44), then\nyields, after some manipulation,\n|6E | = |E0|\n 1+ 2ζ cos(sx)+ cos\n2(sx)\n(cos(sx)+ ζ )2 + Z\n2 (1+ Y 2)2\nδ200\n(\n1− ζ 2)\n\n1\/2\n(51)\nThus, the peak values of |6E | lie along a contour which sat-\nisfies\ncos(sx) = −ζ (52)\nFurthermore, the peak amplitude itself, |6E |max, along this\ncontour is then\n|6E |max = |E0| δ00 1− ζ\n2\nZ(1+ Y 2) (53)\nand the half-width, in terms of sx, is approximately\n1(sx) = Z(1+ Y\n2)\nδ00\n√\n1− ζ 2 (54)\nEquations (53) and (54) indicate that the peak in 6E dimin-\nishes in amplitude and broadens in width (in the x-direction)\ntowards the boundaries of the resonance region.\nThe profound implications of Eq. (52) become clear when\nit is noted that the local plasma frequency, when the effect\nT. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves 51\nof the striations is taken into account, may be represented by\nX′, the perturbed value of X, as\nX′ = X(1+ δ0 cos(sx)) (55)\nInserting Eq. (52) into Eq. (55) yields, after some manipula-\ntion\nX′ = 1− Y 2 (56)\nThus, the peak in the total electric field lies precisely along\nthe local upper-hybrid contour which makes clear how the\nupper-hybrid layer is spread. Due to the incident electro-\nmagnetic wave, which is itself highly uniform in the plane\nperpendicular to the geomagnetic field, electrostatic fluctua-\ntions in any layer where it encounters the local upper-hybrid\nresonance condition start to excite. This occurs throughout\nthe region where −1 ≤ ζ ≤ 1.\nThe total electric field, whose amplitude is given by\nEq. (51) is illustrated quasi-schematically in Fig. 7, together\nwith the upper-hybrid contour. Apart from points close to\nwhere |ζ | = 1, the upper-hybrid contour lies almost paral-\nlel to the geomagnetic field and the angle between them is\nroughly pi\/(2sδ00H). This angle is only around 10−3 radi-\nans in the present example.\nThe reason why the single scatter approach produces a nar-\nrow resonance interval along the direction of the striations\nmay be also seen in similar terms. The size of the total elec-\ntric field |Es | is then just\n|Es | = |E0| δ00 cos(sx)√\nζ 2δ200 + Z2\n(\n1+ Y 2)2 (57)\nClearly, in contrast to Eq. (51), the electrostatic wave field\nin Eq. (57) is both sinusoidal in nature and also its phase\nalong the x-axis is not dependent on the ζ coordinate. Thus,\nthe mean plasma density ‘seen’ by the field, in this case, is\nalwaysN0, and there is no spreading of the resonance interval\nin the ζ direction, due to changes in plasma density in the\nstriations.\n5.2 The case of broad-band striations\nWith the insight gained from the sinusoidal case above, the\ndiscussion concerning the resonance broadening is readily\nextended, albeit in an approximate way to the case of a broad-\nband spectrum of plasma density striations. The spectrum of\nirregularities may then be taken to be centred on, for exam-\nple, wavenumber, s, and with a non-zero spectral width, σs .\nThis implies that the autocorrelation function of the density\nof the striations is a quasi-gaussian function in x, but, as be-\nfore, independent of the direction parallel to the magnetic\nfield. The width of the k-spectrum of the density irregulari-\nties, although no longer a single Fourier component, is still\nmuch narrower than the final spectrum of electric field com-\nponents, as in the case of sinusoidal irregularities. This may\nbe understood in the following way. With the same test wave\nas before, the spectrum of the first order scattered electric\nfield will occupy the same spectral band as that of the irreg-\nularities. The second order scatter, centred on 2s, will be\nbroader, with a width of approximately (\n√\n2)σs . Subsequent\nscattering will broaden the widths of successive orders of the\nscattered electric field, so that the nth order scatter, centred\non ns, has a width\n√\nn times that of the first order. The effect\nwill be to smear the spectrum of the higher order scattered\nwave field into a continuous flat distribution in wavenum-\nber. The result of this smearing is illustrated schematically\nin Fig. 8. The first order scattered electrostatic field, which\ncorresponds to low wavenumbers in the band occupied by the\nstriations, is indicted by the subscript ‘L’ and the higher or-\nders of the scattered electrostatic field, which has wavenum-\nbers beyond the striation waveband, are indicated by the sub-\nscript ‘H ’. The broad-band coupling may then be approxi-\nmated by an equation coupling each first order electrostatic\nsideband to the electromagnetic wave and a band of higher\norder scatter, together with a second equation which han-\ndles the coupling between the higher order modes. These\ncoupling equations are, respectively, with the aid of Eqs. (6)\nand (24)(\n1− 1\nW\n)\nEL(k, ω)+ δ(k, 0)E0\n+\n∞∫\n0\nδ(−l, 0)EH (k + l, ω)dl = 0 (58)\n(\n1− 1\nW\n)\nEH (k, ω)\n+\n∞∫\n−∞\nδ(−l, 0)EH (k + l, ω)dl = 0 (59)\nwhere k and l represent variable wavenumbers. It should be\nnoted that both irregularity sidebands are combined in one\nintegral in Eq. (59), but have to be separated in Eq. (58). Fur-\nthermore, the broad-band case requires r to become a func-\ntion r(k) of the wavenumber of the striation spectrum and F\nin the first line of Eq. (33) to be replaced by an integral over\nthe striation spectrum. Hence,\nF =\n∞∫\n0\nr(k)δ(−k, 0)dk (60)\nwhere δ(k, 0) now represents a spectral density. The broad-\nband replacement for Eq. (20) implies that EH (k+ l, ω) may\nbe replaced by r(l)EL(k, ω) in Eq. (58), which then yields,\nwith the aid of Eq. (60)\nEL(k, ω) = − δ(k, 0)E0\n1− 1\nW\n+ F\n(61)\nMultiplying Eq. (61) by δ(−k, 0) and integrating over k then\nyields, with the aid of Eqs. (42) and (60), a quadratic equa-\n52 T. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves\n-6 -4 -2 0 2 4 6\nsx\u0002\u0003\n-1\n-0.5\n0\n0.5\n1\nΖ\n\u0002\n\u0003\nb\n-6 -4 -2 0 2 4 6\nsx\u0002\u0003\n-1\n-0.5\n0\n0.5\n1\nΖ\n\u0002\n\u0003\na\nFig. 7\nFig. 7. (a) Depicts the contours of the plasma density perturbations\nin the vicinity of the UHR in the x − ζ plane (lighter shading indi-\ncates higher values). (b) Illustrates the corresponding contour plot\nof the total electric field, together with the UHR contour (dashed).\ntion for F of the form\nF = 1\n1− 1\nW\n+ F\n∞∫\n0\nδ(−k, 0)δ(k, 0)dk. (62)\nThus, F satisfies the same expression as in the sinusoidal\ncase (Eq. 33) as long as δ20 is replaced by the integrated spec-\nk\u0002\u0003\nE0\nEL\u0002k,Ω\u0003EL\u0002\u0002k,Ω\u0003\nEH\u0002k,Ω\u0003 \u0002\u0003\u0005\u0002 EH\u0002\u0002k,Ω\u0003\nFig.8\nFig. 8. A schematic representation of the scattered electric field\nspectrum in the broad-band case. The continuous curve represents\nthe electric field and the dashed curve represents the striation spec-\ntrum. Subscript ‘L’ indicates broad-band first order wavenumbers\nand ‘H ’ indicates all higher orders.\ntral power\n〈|δ|2〉 =\n∞∫\n0\n(\nδ(k, 0)+ δ(−k, 0))2dk\n= 4\n∞∫\n0\nδ(k, 0)δ(−k, 0)dk.\nThus, the width of the resonance in the broad-band case is\neffectively determined by the rms fractional plasma density\ndeviation level, as could be reasonably expected.\nFinally, the location of the peak in the total electric field\nmay be estimated for the broad-band case, as follows. The\ncoupling of Eq. (59) for the higher order scatter is inverse\nFourier transformed to yield(\n1− 1\nW\n+ δN (x)\n)\nEH (x) = 0 (63)\nwhere δN (x) and EH (x) are the fractional perturbation in\nelectron density and the total higher electric field in spatial\ncoordinates, respectively. This implies that the high order\nscattered field, which contains the overwhelming proportion\nof the power of the total scattered electric field, is only non-\nzero where the first factor in Eq. (63) is exactly zero. This is\nagain, as with the sinusoidal case, precisely along the local\nupper-hybrid contour (Eq. 56).\n6 Thermal effects\nWarm plasma effects can modify the above results in a num-\nber of ways. First, radio wave heating of the plasma by a\nhigh power electromagnetic pump wave which sets up the\nstriations can increase the electron temperature and enhance\nsome of the transport coefficients. In particular, the electron-\nneutral collision frequency can be increased considerably by\nT. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves 53\nheating in the upper-hybrid layer (Gurevich, 1978). How-\never, even if the electron temperature were to increase ten-\nfold in this region, this would only increase the resonance\nwidth to around 10 m, which is still much smaller than the\nwavelength of the test wave. Second, in a warm plasma, high\nfrequency electrostatic waves propagate at the electron ther-\nmal speed and the wave dispersion effects arise. This has the\neffect of shifting the resonance slightly away from the upper-\nhybrid frequency. Then Eq. (15) becomes, approximately,\nfor an electrostatic wave of wavevector, k\nX = 1+ iZ − Y\n2\n1+ k2λ2D\n(64)\nwhere λD is the Debye length. Now λD is of the order of a\nfew millimetres in the ionospheric F-region. Consequently,\nwith 2pi\/|k| of the order of 1 m or greater for a typical spec-\ntrum of striations encountered in ionospheric modification\nexperiments (Minkoff, 1974), the spread from the upper-\nhybrid resonance altitude caused by the warm plasma effect\nwill only be of the order of a few metres in the single scatter\ncase.\nThe multiple scatter case, in a warm plasma, has previ-\nously been investigated by Inhester et al. (1981) in the con-\ntext of the striation generation process. Inhester et al. (1981)\nshowed that in the warm plasma case, with sinusoidal stria-\ntions, Eq. (27) for r needs to be replaced by rt , where\nr\n(p)\nt =\nxps\n1− xpsx(p+1)s\n1− x(p+1)sx(p+2)s\n1− x(p+2)sx(p+3)s\n1− · · ·\n(65)\nand\nx(p+j)s = δ00\n1−X\n(\n1+ λ2D\n(\n(p + j)s)2 − Y 2 − iZ) (66)\nNow unlike Eq. (26), Eq. (65) does not have a self-similarity\nproperty. Furthermore, rt now depends on p and it cannot be\neasily evaluated analytically. The real and imaginary parts\nof rt in Eq. (65), for the p = 1 case, are plotted as solid\ncurves in panels (a) and (b), respectively, in Fig. 9. These\nplots are somewhat schematic in order to illustrate the effect,\nrather than as an accurate representation. An arbitrary value\nof (sλD)2\/δ00 = 0.003 has been used in obtaining these\ncurves. Also, following Inhester et al. (1981), a small p-\ndependent, imaginary term has been introduced into Eq. (66)\nto account for Landau damping. The dashed curves in each\npanel in Fig. 9 represent the real and imaginary parts of rt ,\nrespectively. Although, as is clear from Fig. 9, rt is much\nmore structured than r , it is remarkably confined to the same\nresonance interval, |ζ | < 1, as r . This result is independent\nof the value of sλD chosen, apart from the number of peaks\nin the resonance interval, which appears to be approximately\nequal to\n√\nδ00\/(sλD). It is clear that it is the multiple scatter\neffects that control the broadening of the resonance and not\n-1.5 -1 -0.5 0.5 1 1.5 Ζ\n-1.2\n-1\n-0.8\n-0.6\n-0.4\n-0.2\nIm\u0002rt\u0003 b\n-1.5 -1 -0.5 0.5 1 1.5 Ζ\n-1\n-0.5\n0.5\nRe\u0002rt\u0003 a\nFig. 9Fig. 9. Solid curves: The real (a) and imaginary (b) parts of the\nmultiple scatter coupling function rt , with thermal effects included,\nfor the case where p = 1 and (sλD)2\/δ00 = 0.003. The dashed\ncurves are the corresponding cold plasma functions, as in Fig. 1.\nthe shift due to warm plasma dispersion effects. Moreover,\nthe areas under the two curves in panel (b) of Fig. 9, which\nrepresent imaginary parts, were evaluated by numerical inte-\ngration and were found to be identical, within the limits of\naccuracy of the calculation. This is an important result as it\nis the areas under these curves which determines the levels\nof anomalous absorption caused by the FASTUHR process\nin each case. This result shows that warm plasma effects\nplay no major role in determining anomalous absorption un-\nder these conditions.\n7 Conclusions\nA theory in which the effects of multiple scatter on the prop-\nagation and absorption of electromagnetic test waves in a\ncold magnetoplasma containing field-aligned plasma density\nstriations has been developed above. The theory has been\nused to calculate the complex refractive index of a test wave\nin conditions that are applicable to ionospheric modification\nexperiments in which artificial striations, generated by the\naction of a high power electromagnetic pump, cause anoma-\nlous absorption of the test wave. The main findings of the\nnew theory are as follows:\n(1) The refractive index of an ordinary mode wave is modi-\nfied in the vicinity of the upper-hybrid resonance as a re-\n54 T. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves\nsult of the presence of striations of sufficient amplitude,\nbut the width of the resonance region, in the multiple\nscatter case, is much larger than obtained in previous,\nsingle scatter, calculations. This width is found to be\ntypically several tens of times the wavelength of the test\nwave, under normal F-region conditions, rather than a\nsmall fraction of a wavelength, as previously predicted.\nMoreover, the multiple scatter resonance function re-\nmains finite in the limit of zero collision frequency,\nunlike the single scatter case. The reason for this be-\nhaviour is the localisation of the scattered electrostatic\nfield at the upper-hybrid resonance layer which follows\nprecisely the undulations imposed by the plasma density\nstriations.\n(2) With fractional striation amplitudes of a few percent, the\nimaginary part of the refractive index in the resonance\nlayer is much larger than that due to electron-neutral\ncollisions and this leads to strong anomalous absorption\nof the test wave. However, the real part of the refractive\nindex is almost unaffected and, contrary to previous the-\noretical predictions, no new cutoffs appear at the upper-\nhybrid layer. Thus, there are no new test wave reflection\neffects associated with ionospheric modification exper-\niments.\n(3) Multiple scatter effects also appear to be the dominant\nmechanism for the upper-hybrid resonance broadening,\neven when warm plasma effects are included. Further-\nmore, the results presented above also appear to be rath-\ner independent of the detailed spectrum of the striations,\nas long as they are strongly aligned with the background\nmagnetic field.\nThe calculations above are also entirely consistent with test\nwave anomalous absorption observations made during nu-\nmerous ionospheric modification experiments, at least for\ncases where the test wave frequency is not close to a har-\nmonic of the electron gyro-frequency. Kinetic theory is need-\ned to explain these latter, rather special conditions. Multiple\nscatter theory, thus, seems to clear up a number of rather in-\nconsistent aspects of the previous, single scatter, theories of\nanomalous absorption and propagation of test waves.\nFinally, the theory above may also have some important\nconsequences for the action of the high power electromag-\nnetic pump itself. Although a detailed investigation of this\ntopic is beyond the scope of the present study, it is worth\nspeculating briefly on how the new results might impact on\nthis important issue. For example, the broadening of the res-\nonance, which is such an important aspect of the new theory,\nmay increase the sensitivity of the pump to self-absorption\nprocesses which may limit the growth of the instability by\nwhich the pump creates the striations. Furthermore, the way\nin which the multiple scatter leads to a total electric field of\nthe superposed scattered waves that is made up essentially of\nbroad-band noise, could have a profound effect on the nature\nof the heating processes itself. In the previous single scatter\napproach, it was assumed that the coherent electromagnetic\npump wave had its energy converted into a quasi-coherent,\nthough large amplitude, electrostatic wave in the vicinity of\nthe upper-hybrid resonance and that the large electric field\nof this slowly propagating wave heated the plasma through\nelectron-neutral collisions (e.g. Robinson, 1989). However,\nas is now clear, the electric field of the scattered wave field\nis itself effectively randomised by the randomly meandering\ncontours of the plasma density in the ionosphere. This means\nthat the electron motion driven by this electric field will al-\nready be random to some degree and does not have to rely en-\ntirely on the randomising effects of collisions with neutrals.\nThus, the temperature of the electron gas is affected directly\nby the random component in the wave field and truly colli-\nsionless heating can arise for a sufficiently powerful pump\nwave.\nAcknowledgement. The Editor in Chief thanks E. Mjølhus and T.\nHagfors for their help in evaluating this paper.\nReferences\nCohen, R. and Whitehead, J. D.: Radio-reflectivity detection of ar-\ntificial modification of the ionospheric F-layer, J. Geophys. Res.,\n75, 6439–6445, 1970.\nDysthe, K. B., Mjølhus, E., Pe´cseli, H. L., and Rypdal, K.: A ther-\nmal oscillating two-stream instability, Phys. Fluids., 26, 146–\n157, 1983.\nFialer, P. A.: Field-aligned scattering from a heated region of the\nionosphere-Observations at HF and VHF, Radio Sci., 9, 923–\n940, 1974.\nGraham, K. N. and Fejer, J. A.: Anomalous radio wave absorption\ndue to ionospheric heating effects, Radio Sci., 11, 1057–1063,\n1976.\nGurevich, A. V.: Nonlinear phenomena in the ionosphere, Springer\nVerlag, Berlin, 1978.\nHagfors, T.: Electromagnetic wave propagation in a field-aligned-\nstriated cold magnetoplasma with application to the ionosphere,\nJ. Atmos. Terr. Phys., 46, 211–216, 1984.\nHedberg, A˚., Derblom, H., Thide´, B., Kopka, H., and Stubbe, P.:\nObservations of HF backscatter associated with heating experi-\nments at Tromsø, Radio Sci., 18, 840–850, 1983.\nInhester, B., Das, A. C., and Fejer, J. A.: Generation of small-scale\nfield-aligned irregularities in ionospheric heating experiments, J.\nGeophys. Res., 86, 9101–9106, 1981.\nJones, T. B., Robinson, T., Stubbe, P., and Kopka, H.: Frequency\ndependence of anomalous absorption caused by high power radio\nwaves, J. Atmos. Terr. Phys., 46, 147–153, 1984.\nMinkoff, J.: Radio frequency scattering from a heated ionospheric\nvolume, 3, Cross section calculations, Radio Sci., 9, 997–1004,\n1974.\nMinkoff, J., Kugelman, P., and Weissman, I.: Radio frequency scat-\ntering from a heated ionospheric volume, 1, VHF\/UHF field-\naligned and plasma-line backscatter measurements, Radio Sci.,\n9, 941–955, 1974.\nMjølhus, E.: Anomalous absorption and reflection in ionospheric\nradio modification experiments, J. Geophys. Res., 90, 4269–\n4279, 1985.\nRobinson, T. R.: The heating of the high latitude ionosphere by high\npower radio waves, Phys. Rep., 179, 79–209, 1989.\nRobinson, T. R., Stocker, A. J., Bond, G., Eglitis, P., Wright, D., and\nJones, T. B.: O and X mode heating effects observed simultane-\nT. R. Robinson: Effects of multiple scatter on the propagation and absorption of electromagnetic waves 55\nously with the CUTLASS and EISCAT radars and low power HF\ndiagnostics at Tromsø, Ann. Geophysicae, 15, 134–136, 1997.\nStix, T. H.: Waves in plasmas, Am. Inst. Phys., New York, 1992.\nStubbe, P., Kopka, H., Jones, T. B., and Robinson, T.: Wide band\nattenuation of radio waves caused by powerful HF waves: Sat-\nuaration and dependence on ionospheric variability, J. Geophys.\nRes., 87, 1551–1555, 1982.\nVaskov, V. V.: Dielectric constant perturbations caused by the con-\nversion of an electromagnetic wave at small-scale plasma inho-\nmogeneities, Sov. J. Plasma Phys. (Eng. Trans.), 14, 686–690,\n1988.\nVaskov. V. V., and Gurevich, A. V.: Nonlinear resonant instability\nof a plasma in the field of an ordinary wave, Sov. Phys. JETP\n(Eng. Trans.), 42, 91–97, 1976.\n"}