{"doi":"10.1063\/1.3295070","coreId":"140087","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5318","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5318","10.1063\/1.3295070"],"title":"Shock compression and recovery of microorganism-loaded broths and an emulsion","authors":["Hazell, P. J.","Groves, K.","Stennett, C.","Beveridge, C."],"enrichments":{"references":[{"id":37967606,"title":"A 50 mm bore gas gun for dynamic loading of materials and structures”,","authors":[],"date":"2003","doi":"10.1088\/0957-0233\/14\/3\/304","raw":"Bourne, N.K., “A 50 mm bore gas gun for dynamic loading of materials and structures”, Meas. Sci. Technol. 14, 273, 2003.","cites":null},{"id":37967613,"title":"A study on the emulsification of oil by power ultrasound”,","authors":[],"date":"2008","doi":"10.1016\/j.ultsonch.2008.02.004","raw":"Cucheval, A. and Chow, R. C. Y., “A study on the emulsification of oil by power ultrasound”, Ultrason. Sonochem., 15, 916, 2008. 10 μm (a) (b) 10 μm (a) (b) Figure 4. (a) Emulsion before treatment and (b) emulsion after the passage of the shock wave (with air gap).","cites":null},{"id":37967611,"title":"Applications of yeast flocculation in biotechnological processes”,","authors":[],"date":"2000","doi":"10.1007\/bf02942185","raw":"Domingues, L., et al., “Applications of yeast flocculation in biotechnological processes”, Biotechnol. Bioprocess. Eng., 5, 288, 2000.","cites":null},{"id":37967603,"title":"Bugbuster—survivability of living bacteria upon shock compression”,","authors":[],"date":"2006","doi":"10.1016\/j.epsl.2006.03.054","raw":"Willis, M. J., et al., “Bugbuster—survivability of living bacteria upon shock compression”, Earth Planet. Sci. Lett., 247, 185, 2006.","cites":null},{"id":37967607,"title":"Cavitation in water: a review”,","authors":[],"date":"2006","doi":"10.1103\/physreve.74.041603","raw":"Caupin, F., and Herbert, E., “Cavitation in water: a review”, C. R. Physique, 7, 1000, 2006.","cites":null},{"id":37967604,"title":"Experimental evidence for the potential impact ejection of viable microorganisms from Mars and Mars-like planets”,","authors":[],"date":null,"doi":"10.1016\/j.icarus.2006.11.007","raw":"Stöffler, D., et al., “Experimental evidence for the potential impact ejection of viable microorganisms from Mars and Mars-like planets”, Icarus 186, 585,","cites":null},{"id":37967605,"title":"Inactivation of microorganisms using pulsed high underwater discharges”, Innovative Food Science and Emerging Technologies 3,","authors":[],"date":"2002","doi":"10.1016\/s1466-8564(02)00052-8","raw":"Zuckerman H., et al., “Inactivation of microorganisms using pulsed high underwater discharges”, Innovative Food Science and Emerging Technologies 3, 329, 2002.","cites":null},{"id":37967608,"title":"Motility of Escherichia coli cells in clusters formed by chemotactic aggregation”,","authors":[],"date":"2003","doi":"10.1073\/pnas.2233626100","raw":"Mittal, N., et al., “Motility of Escherichia coli cells in clusters formed by chemotactic aggregation”, PNAS 100, 13259, 2003.","cites":null},{"id":37967601,"title":"Repeated application of shock waves as a possible method for food preservation”,","authors":[],"date":"1999","doi":"10.1007\/s001930050138","raw":"Loske, A. M., et al., “Repeated application of shock waves as a possible method for food preservation”, Shock Waves 9, 49, 1999.","cites":null},{"id":37967602,"title":"Survival of bacteria and spores under extreme shock pressures”,","authors":[],"date":"2004","doi":"10.1111\/j.1365-2966.2004.08015.x","raw":"Burchell, M. J., et al., “Survival of bacteria and spores under extreme shock pressures”, Mon. Not. R. Astron. Soc., 352, 1273, 2004.","cites":null},{"id":37967612,"title":"The physical and biological effects of high-frequency sound waves of great intensity”,","authors":[],"date":"1927","doi":"10.1080\/14786440908564348","raw":"Wood, R. W., and Loomis, A. L., “The physical and biological effects of high-frequency sound waves of great intensity”, Philos. Mag., 4, 417, 1927.","cites":null}],"documentType":{"type":1}},"contributors":["Elert, ML, Buttler, WT, Furnish, MD, Anderson, WW, Proud, WG."],"datePublished":"2009-12-31T00:00:00Z","abstract":"The microorganisms Escherichia coli, Enterococcus faecalis and Zygosaccharomyces\nbailii and an oil-based emulsion, have been subjected to shock compression using\nthe flyer-plate technique to initial pressures of 0.8 GPa (in the suspension).\nIn each experiment, a stainless steel capsule was used to contain the broths and\nallow for recovery without contamination. Where cavitation was mostly suppressed\nby virtue of simultaneous shock and dynamic compression, no kill was observed.\nBy introducing an air gap behind the suspension, limited kill was measured in\nthe yeast. Results also suggest that stable emulsification occurs in coarse oil-\nbased emulsions that are subjected to shock","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140087.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1063\/1.3295070","pdfHashValue":"846013ff390b1a60001b342e61febd44c828ef70","publisher":"AIP American Institute of Physics","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5318<\/identifier><datestamp>2011-05-17T16:05:13Z<\/datestamp><setSpec>hdl_1826_13<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Shock compression and recovery of microorganism-loaded broths and an emulsion<\/dc:title><dc:creator>Hazell, P. J.<\/dc:creator><dc:creator>Groves, K.<\/dc:creator><dc:creator>Stennett, C.<\/dc:creator><dc:creator>Beveridge, C.<\/dc:creator><dc:subject>Shock compression<\/dc:subject><dc:subject>microorganisms, yeast, capsule design<\/dc:subject><dc:description>The microorganisms Escherichia coli, Enterococcus faecalis and Zygosaccharomyces\nbailii and an oil-based emulsion, have been subjected to shock compression using\nthe flyer-plate technique to initial pressures of 0.8 GPa (in the suspension).\nIn each experiment, a stainless steel capsule was used to contain the broths and\nallow for recovery without contamination. Where cavitation was mostly suppressed\nby virtue of simultaneous shock and dynamic compression, no kill was observed.\nBy introducing an air gap behind the suspension, limited kill was measured in\nthe yeast. Results also suggest that stable emulsification occurs in coarse oil-\nbased emulsions that are subjected to shock.<\/dc:description><dc:publisher>AIP American Institute of Physics<\/dc:publisher><dc:contributor>Elert, ML, Buttler, WT, Furnish, MD, Anderson, WW, Proud, WG.<\/dc:contributor><dc:date>2011-05-10T23:18:25Z<\/dc:date><dc:date>2011-05-10T23:18:25Z<\/dc:date><dc:date>2009-12-31T00:00:00Z<\/dc:date><dc:type>Conference paper<\/dc:type><dc:identifier>978-0-7354-0732-9<\/dc:identifier><dc:identifier>0094-243X<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1063\/1.3295070<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5318<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0094-243X","0094-243x"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["Shock compression","microorganisms, yeast, capsule design"],"subject":["Conference paper"],"fullText":"  \n \n \nSHOCK COMPRESSION AND RECOVERY OF MICROORGANISM-\nLOADED BROTHS AND AN EMULSION \n \nP. J. Hazell1, C. Beveridge2,3, K. Groves2, C. Stennett1 \n \n1 Cranfield Defence and Security, Cranfield University, Shrivenham, Swindon, SN6 8LA \n2 Leatherhead Foods International, Randalls Road, Leatherhead, Surrey, KT22 7RY \n3 Present address: CBC, 49 Adkin Way, Wantage, Oxfordshire, OX12 9HN \n \nAbstract.  The microorganisms Escherichia coli, Enterococcus faecalis and Zygosaccharomyces bailii \nand an oil-based emulsion, have been subjected to shock compression using the flyer-plate technique \nto initial pressures of 0.8 GPa (in the suspension). In each experiment, a stainless steel capsule was \nused to contain the broths and allow for recovery without contamination. Where cavitation was mostly \nsuppressed by virtue of simultaneous shock and dynamic compression, no kill was observed. By \nintroducing an air gap behind the suspension, limited kill was measured in the yeast. Results also \nsuggest that stable emulsification occurs in coarse oil-based emulsions that are subjected to shock.   \nKeywords: Shock compression; microorganisms, yeast, capsule design. \nPACS: 62.50.Ef, 47.40.Nm, 47.57.Bc, 87.18-h \n \nINTRODUCTION \n \nVarious attempts have been tried in the past to \nkill microorganisms via a process of inducing \nshock waves in a medium. On one hand, using \nweak underwater shock waves has been suggested \nas a method for food preservation [1]. Whereas on \nthe other hand, researchers have focused their \nattention on the response of microorganisms to \nstrong shock waves to elucidate possible \nmechanisms for Panspermia (i.e., microorganisms \nare distributed throughout the Universe and spread \nnaturally to seed life) [2-4]. Loske et al. [1] \nreported a kill of microorganisms via a process of \nelectro-discharge within a vat of water. Here they \nreported that multiple shock waves of c.a. 44 MPa \nresulted in mortality of E. Coli with increasing \ndeath rates as the number of applied shock waves \nincreased.  Zuckerman et al. [5] used similar \ntechniques to generate pressures of c.a. 100 MPa \nresulting in inactivation in just 5 pulses. In this \nwork we report results where we interrogate the \nmortality of microorganisms that have been \nsubjected to shock compression. Using the flyer-\nplate technique we subject the samples to pressures \nthat are much higher than those seen using electro-\ndischarge techniques. Further, an oil-based \nemulsion has also been subjected to similar shock \nloading resulting in significant breakdown of the \noil particles.   \n \nEXPERIMENTAL PROCEDURE  \n  \nAll the experiments were conducted using a \n50-mm single-stage light gas-gun [6].  10-mm \nthick copper flyer plates were accelerated to \nvelocities of between 345 m\/s and 450 m\/s and \nwere used to dynamically load a stainless steel \ncapsule containing the suspension of interest.  The \nmeasured shock magnitudes in the stainless steel \ncover plates that sealed the capsules, were c.a. 6.4 \nGPa and 8.6 GPa, corresponding to velocities of \n345 m\/s and 450 m\/s. The velocities of the \nprojectile were measured by using a sequential pin \nshorting system to an accuracy of 0.5%. \nTwo capsule designs were used to house the \nmicroorganisms and emulsion (see Fig 1). In the \nfirst experiments, the cavity within the capsule \n Gauge package\nCu cover plate 304 L cover plate\n10-mm thick flyer\n15 μm Mylar layer \napplied in Set 2\n \nFigure 1. Experimental setup showing the arrival of a \n10-mm thick Cu flyer. \n \nwas completely filled then sealed, taking care to \nminimize the presence of air.  \nIn the second set of experiments, a 15μm Mylar \nlayer was introduced to separate the fluid from the \nsteel by c.a. 3 mm thereby providing an air gap. Six \nexperiments were conducted in total; hydrocode \n(AUTODYN) simulations were also carried out to \nassess the dynamic deformation of the cover plate \nand the pressure history within the fluid layers. \n The microorganisms used for this experiment \nwere Zygosaccharomyces bailii DSM 70492 and a \ncocktail of Escherichia coli NCTC 9001 and \nEnterococcus faecalis, culture ATCC 19433. Z. \nbailii is a common spoilage yeast in the food \nindustry chiefly affecting fruit juices; E. coli and E. \nfaecalis are relatively harmless members of a \nhealthy gut flora. \nThe Z. bailii experimental culture was prepared \nby incubating in malt extract broth (prepared from \nOxoid powder) at 25°C for 3 days to provide a 108 \ncolony forming units\/ml (cfu\/ml). A cocktail of E. \ncoli NCTC and E. faecalis culture ATCC 19433 \n9001 was incubated in nutrient broth (prepared \nfrom Oxoid powder) at 37°C for 1 day to achieve \nthe 108 cfu\/ml. These cultures were then \nindividually subjected to the shock loading. \nAfter subjecting the capsules to the shock-\nloading they were recovered and opened using \naseptic techniques. A 1 ml sample was withdrawn \nand serially diluted into 8 by 9 ml of half-strength \nringer’s solution. 0.1 ml of each of the dilutions \nwas then plated onto nutrient agar for incubation \nand subsequent numerical evaluation.  \n \nRESULTS AND DISCUSSION \n \nWave propagation \n \nHydrocode simulations of each capsule design \nshowed the response of the system to impact. Fig 2 \nshows one such example of a 10-mm thick copper \nflyer plate striking the capsule at c.a. 450 m\/s. A \nshock magnitude of c.a. 8.5 GPa was measured at \nthe gauge location shown in Fig 1. This lasted for \napproximately 3.2 μs before the arrival of the \nrelease wave. After the flyer-plate struck the \ncopper cover plate, the stainless steel plate was \nextruded forward. Simultaneously the shock passed \ninto the suspension and subsequently rung-up \nresulting in peak pressures of 1.2 GPa in the fluid \nlayer. In doing so, a divergent wave front emerged \nby virtue of the fact that the stainless steel cover \nplate was extruding in a hemispherical fashion (see \nFig 2).  The simultaneous shock and dynamic \ncompression of the fluid extended the time over \nwhich fluid was compressed and thereby mostly \nsuppressed the formation of a negative phase that \nwould otherwise lead to cavitation.  \n In the second set of experiments, an airgap was \nintroduced behind the fluid layer by using a 15-μm \n+5 μs\nPressure (GPa)\n1.2\n-0.5\n(a) (b)\n \nFigure 2. ANSYS® AUTODYN simulation showing the deformation of the cover plate and the pressure in the water. \n thick layer of Mylar® film. This resulted in the the \nformation of a negative phase with the fluid layer \nbeing subjected to “stretching” [7]; this was \nassumed to lead to cavitation. \n \nEffect on the microorganisms \n \nAnalysis of the shocked specimens showed that \nthe compression pulse had little effect on the \nbacterial samples when cavitation was mostly \nsuppressed; no reduction in numbers was observed \nwhen compared to the control (unshocked) \nspecimen for both the bacteria and the yeast \nsamples. This is somewhat surprising given the \nhigh compression that was achieved using this \ntechnique and given that other researchers have \nnoted bacterial kill with much lower pressures \n[1,5]. This suggests that the mechanisms of kill \nwere not dependent on solely the magnitude of the \npressure but rather other factors such as the degree \nof repetition and exposure to UV light.  \nHowever, when the air-gap was introduced in \nthe cavity limited kill was observed with 1-log \nreduction in the yeast sample only. Again, no \nmeasureable reduction was seen in the bacterial \nsamples. Furthermore, it was noted that, with the \nyeast sample, clumping of the microorganisms was \nobserved c.a. 30 minutes after the experiment (see \nFig 3). The reason for this was unclear however it \nhas previously been reported that certain \nmicroorganisms undergo aggregation during stress \nand therefore the observed behavior maybe a \nsurvival mechanism [8,9]. \nThe reason for the high survival rates of the \nmicroorganisms is, perhaps, surprising given the \nexpected violence of the cavitation in the second \nset of experiments. These results confirm the hardy \nnature of certain micro-organisms that have been \nsubjected to shock loading as noted by Burchell et \nal. [2]. The reason for high survival rates when \nsubjected to shock loading for the cells contained \nin a suspension demands explanation and is \nprobably due to the materials and structure of the \ncells. It should be pointed out that the cell make-up \nconsists of materials that are of similar shock \nimpedance to the fluid medium that contains them. \nConsequently, to kill these organisms it is probable \nthat higher shocks are required to induce \ndelamination of the cell structure.  \n \nEffect on the emulsion \n \nPerhaps more enlightening are the effects that \nthe shock wave had on the emulsification of the \noil-based suspensions. The coarse emulsions prior \nto the passage of the shock wave possessed a \nvolume mean particle size of 13.6 µm with a \ndistribution (by % volume) of particle sizes as \nfollows: 10% ≤ 1.2 μm, 50% ≤ 13.0 μm and 90% ≤ \n25.1 μm. After the passage of the shockwave, the \ndroplet size distribution changed, producing \nsmaller droplets with a volume mean particle size \nof 8.2 μm and a distribution of: 10% ≤ 1.2μm, 50% \n≤ 7.3 μm and 90% ≤ 16.7μm. \n For the second experimental setup where \ncavitation was promoted, significant emulsification \noccurred as shown in Fig 4. After the passage of \nthe shockwave, the droplet size distribution \nchanged, producing smaller droplets with a volume \nmean particle size of 7.8 µm and a distribution as \nfollows: 10% ≤ 0.7 μm, 50% ≤ 2.6 μm and 90%  \n≤16.5 μm. These results demonstrate a shift in \npopulation from 10-20 microns to 1-10 microns. \nFurthermore, measuring the droplet size \ndistribution 7 days later confirmed the presence of \na stable emulsion. Although to the authors’ \nknowledge, no work has been done to examine \nhigh pressure shock wave interaction with \nemulsions, ultrasonic approaches have been \nextensively studied e.g., [10]. Current thinking \nsuggest that emulsification by ultrasound at least is \ngoverned by a localised cavitation zone [11]. These \nresults are consistent with our shock studies. \nHowever, as noted above, a certain degree of \n10 μm  \nFigure 3. Aggregation of the yeast cells after shock \ncompression. \n emulsification has occurred where mostly \ncavitation was suppressed. Consequently, a \ndifferent mechanism of break up may be at play \nand this demands explanation. One possibility is \nthat the divergent wave front reflected from the \ndeforming cover plate (see Fig 2) is inducing shear \nin the oil droplets. This may well be expected to \ncause a breakdown of the droplets however we are \nunable to verify this using the current setup. \n \nCONCLUSIONS \n \nDifferent bacterial suspensions and an emulsion \nhave been subjected to shock loading where the \nmagnitude of the shock wave in the stainless steel \nwas measured to be 6.2 GPa and 8.5 GPa resulting \nin a shock pressure in the broth of up to c.a. 1.2 \nGPa. We have shown that when cavitation was \nboth reduced and encouraged, the shock pressure \nhad little effect on microorganisms such as Z. \nbailii, E. coli and E. faecalis. However, stable \nemulsification of a coarse oil and water emulsion \ndid occur when cavitation was promoted. \nConsiderably less emulsification occurred when \ncavitation was mostly suppressed. \nOther researchers have noted significant \nbacterial kill with much lower pressures [1,5]. This \nwork confirms that the mortality seen previously \nwas not dependent on purely the magnitude of the \npressure but probably on other factors present in \nthose experiments such as degree of shock \nrepetition and exposure to UV light. \n \nACKNOWLEDGEMENTS \n \nFunding was provided by DEFRA under the \nLINK collaborative research programme (project \nAFM 264). The authors thank Mr. Gary Cooper \nand Mr. Gareth Appleby-Thomas for providing \nvaluable experimental support. \n \nREFERENCES \n1. Loske, A. M., et al., “Repeated application of shock \nwaves as a possible method for food preservation”, \nShock Waves 9, 49, 1999. \n2. Burchell, M. J., et al., “Survival of bacteria and \nspores under extreme shock pressures”, Mon. Not. \nR. Astron. Soc., 352, 1273, 2004. \n3. Willis, M. J., et al., “Bugbuster—survivability of \nliving bacteria upon shock compression”, Earth \nPlanet. Sci. Lett., 247, 185, 2006. \n4. Stöffler, D., et al., “Experimental evidence for the \npotential impact ejection of viable microorganisms \nfrom Mars and Mars-like planets”, Icarus 186, 585, \n2007. \n5. Zuckerman H., et al., “Inactivation of \nmicroorganisms using pulsed high underwater \ndischarges”, Innovative Food Science and Emerging \nTechnologies 3, 329, 2002. \n6. Bourne, N.K., “A 50 mm bore gas gun for dynamic \nloading of materials and structures”, Meas. Sci. \nTechnol. 14, 273, 2003. \n7. Caupin, F., and Herbert, E., “Cavitation in water: a \nreview”, C. R. Physique, 7, 1000, 2006. \n8. Mittal, N., et al., “Motility of Escherichia coli cells \nin clusters formed by chemotactic aggregation”, \nPNAS 100, 13259, 2003.  \n9. Domingues, L., et al., “Applications of yeast \nflocculation in biotechnological processes”, \nBiotechnol. Bioprocess. Eng., 5, 288, 2000. \n10. Wood, R. W., and Loomis, A. L., “The physical and \nbiological effects of high-frequency sound waves of \ngreat intensity”, Philos. Mag., 4, 417, 1927. \n11. Cucheval, A. and Chow, R. C. Y., “A study on the \nemulsification of oil by power ultrasound”, \nUltrason. Sonochem., 15, 916, 2008. \n10 μm\n(a) (b)\n \nFigure 4. (a) Emulsion before treatment and (b) emulsion after the passage of the shock wave (with air gap). \n"}