{"doi":"10.1016\/S0377-2217(02)00554-4","coreId":"135626","oai":"oai:bradscholars.brad.ac.uk:10454\/3257","identifiers":["oai:bradscholars.brad.ac.uk:10454\/3257","10.1016\/S0377-2217(02)00554-4"],"title":"Enterprise  resource planning: A taxonomy of critical factors.","authors":["Zairi, Mohamed","Al-Mudimigh, A.S.","Al-Mashari, M."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2003","abstract":"NoThis paper presents a novel taxonomy of the critical success factors in enterprise resource planning (ERP) implementation process. ERP benefits cannot be fully realised unless a strong alignment and reconciliation mechanism is established between technical and organisational imperatives based on the principles of process orientation. It is suggested in the taxonomy that measurement takes place in a balanced perspective, and for the purpose of providing useful information that can enable the decision making process and, which can help deliver the corporate objectives and therefore lead the business competitively forward. Upon this premise, the taxonomy is based on a comprehensive analysis of ERP literature combining research studies and organisational experiences. The taxonomy reflects the essential features of ERP systems, as being built based on the principles of business process management. Furthermore, it illustrates that ERP benefits are realised when a tight link is established between implementation approach and business process performance measures","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/3257<\/identifier><datestamp>\n                2016-07-25T17:10:43Z<\/datestamp><setSpec>\n                com_10454_232<\/setSpec><setSpec>\n                col_10454_6344<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nEnterprise  resource planning: A taxonomy of critical factors.<\/dc:title><dc:creator>\nZairi, Mohamed<\/dc:creator><dc:creator>\nAl-Mudimigh, A.S.<\/dc:creator><dc:creator>\nAl-Mashari, M.<\/dc:creator><dc:subject>\nERP<\/dc:subject><dc:subject>\nCritical success factors<\/dc:subject><dc:subject>\nTaxonomy<\/dc:subject><dc:subject>\nDeployment<\/dc:subject><dc:subject>\nEvaluation<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nThis paper presents a novel taxonomy of the critical success factors in enterprise resource planning (ERP) implementation process. ERP benefits cannot be fully realised unless a strong alignment and reconciliation mechanism is established between technical and organisational imperatives based on the principles of process orientation. It is suggested in the taxonomy that measurement takes place in a balanced perspective, and for the purpose of providing useful information that can enable the decision making process and, which can help deliver the corporate objectives and therefore lead the business competitively forward. Upon this premise, the taxonomy is based on a comprehensive analysis of ERP literature combining research studies and organisational experiences. The taxonomy reflects the essential features of ERP systems, as being built based on the principles of business process management. Furthermore, it illustrates that ERP benefits are realised when a tight link is established between implementation approach and business process performance measures.<\/dc:description><dc:date>\n2009-08-10T10:03:56Z<\/dc:date><dc:date>\n2009-08-10T10:03:56Z<\/dc:date><dc:date>\n2003<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nNo full-text available in the repository<\/dc:type><dc:identifier>\nMohammed, Z., Al-Mudimigh, A. and Al-Mashari, M. (2003).  Enterprise  resource planning: A taxonomy of critical factors.   European Journal of Operational Research. Vol. 146, No. 2, pp. 352-364.<\/dc:identifier><dc:identifier>\n90005219<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/3257<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1016\/S0377-2217(02)00554-4<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1016\/S0377-2217(02)00554-4"],"year":2003,"topics":["ERP","Critical success factors","Taxonomy","Deployment","Evaluation"],"subject":["Article","No full-text available in the repository"],"fullText":null}