{"doi":"10.1103\/PhysRevA.66.063411","coreId":"66465","oai":"oai:dro.dur.ac.uk.OAI2:1392","identifiers":["oai:dro.dur.ac.uk.OAI2:1392","10.1103\/PhysRevA.66.063411"],"title":"Nondipole effects in photon emission by laser-driven ions.","authors":["Chirilă, C. C.","Kylstra, N. J.","Potvliege, R. M.","Joachain, C. J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-12","abstract":"The influence of the magnetic-field component of the incident pulse on the emission of photons by multiply charged ions interacting with intense, near-infrared laser pulses is investigated theoretically using a strong-field approximation that treats the coupling of the atom with the incident field beyond the dipole approximation. For peak pulse intensities approaching 1017 W cm-2, the electron drift in the laser propagation direction due to the magnetic-field component of the incident pulse strongly influences the photon emission spectra. In particular, emission is reduced and the plateau structure of the spectra modified, as compared to the predictions in the dipole approximation. Nondipole effects become more pronounced as the ionization potential of the ion increases. Photon emission spectra are interpreted by analysing classical electron trajectories within the semiclassical recollision model. It is shown that a second pulse can be used to compensate the magnetic-field induced drift for selected trajectories so that, in a well-defined spectral region, a single attosecond pulse is emitted by the ion.\\ud\n\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66465.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1392\/1\/1392.pdf","pdfHashValue":"e31407ce6c37cf09b73576be6706f9219db9d6b9","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1392<\/identifier><datestamp>\n      2010-09-15T15:44:50Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Nondipole effects in photon emission by laser-driven ions.<\/dc:title><dc:creator>\n        Chirilă, C. C.<\/dc:creator><dc:creator>\n        Kylstra, N. J.<\/dc:creator><dc:creator>\n        Potvliege, R. M.<\/dc:creator><dc:creator>\n        Joachain, C. J.<\/dc:creator><dc:description>\n        The influence of the magnetic-field component of the incident pulse on the emission of photons by multiply charged ions interacting with intense, near-infrared laser pulses is investigated theoretically using a strong-field approximation that treats the coupling of the atom with the incident field beyond the dipole approximation. For peak pulse intensities approaching 1017 W cm-2, the electron drift in the laser propagation direction due to the magnetic-field component of the incident pulse strongly influences the photon emission spectra. In particular, emission is reduced and the plateau structure of the spectra modified, as compared to the predictions in the dipole approximation. Nondipole effects become more pronounced as the ionization potential of the ion increases. Photon emission spectra are interpreted by analysing classical electron trajectories within the semiclassical recollision model. It is shown that a second pulse can be used to compensate the magnetic-field induced drift for selected trajectories so that, in a well-defined spectral region, a single attosecond pulse is emitted by the ion.\\ud\n\\ud\n<\/dc:description><dc:subject>\n        Order harmonic-generation<\/dc:subject><dc:subject>\n         Attosecond pulses<\/dc:subject><dc:subject>\n         Intense<\/dc:subject><dc:subject>\n         Ionization<\/dc:subject><dc:subject>\n         Field<\/dc:subject><dc:subject>\n         Atoms<\/dc:subject><dc:subject>\n         Stabilization<\/dc:subject><dc:subject>\n         Regime<\/dc:subject><dc:subject>\n         Train.<\/dc:subject><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review A, 2002, Vol.66(6), pp.063411 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2002-12<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1392<\/dc:identifier><dc:identifier>\n        issn:1050-2947<\/dc:identifier><dc:identifier>\n        issn: 1094-1622<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevA.66.063411<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1392\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevA.66.063411<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1392\/1\/1392.pdf<\/dc:identifier><dc:rights>\n        © 2002 by The American Physical Society. All rights reserved. <\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1050-2947"," 1094-1622","1050-2947","issn: 1094-1622"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2002,"topics":["Order harmonic-generation","Attosecond pulses","Intense","Ionization","Field","Atoms","Stabilization","Regime","Train."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n15 September 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nChiril, C. C. and Kylstra, N. J. and Potvliege, R. M. and Joachain, C. J. (2002) ’Nondipole effects in photon\nemission by laser-driven ions.’, Physical review A., 66 (6). 063411.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevA.66.063411\nPublisher’s copyright statement:\n2002 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nNondipole effects in photon emission by laser-driven ions\nC. C. Chirila˘, N. J. Kylstra, and R. M. Potvliege\nDepartment of Physics, University of Durham, Durham DH1 3LE, United Kingdom\nC. J. Joachain\nPhysique The´orique CP 227, Universite´ Libre de Bruxelles, B–1050 Brussels, Belgium\nand Max-Planck-Institute fu¨r Quantenoptik, D-85748 Garching, Germany\n~Received 19 September 2002; published 20 December 2002!\nThe influence of the magnetic-field component of the incident pulse on the emission of photons by multiply\ncharged ions interacting with intense, near-infrared laser pulses is investigated theoretically using a strong-field\napproximation that treats the coupling of the atom with the incident field beyond the dipole approximation. For\npeak pulse intensities approaching 1017 W cm22, the electron drift in the laser propagation direction due to the\nmagnetic-field component of the incident pulse strongly influences the photon emission spectra. In particular,\nemission is reduced and the plateau structure of the spectra modified, as compared to the predictions in the\ndipole approximation. Nondipole effects become more pronounced as the ionization potential of the ion\nincreases. Photon emission spectra are interpreted by analysing classical electron trajectories within the semi-\nclassical recollision model. It is shown that a second pulse can be used to compensate the magnetic-field\ninduced drift for selected trajectories so that, in a well-defined spectral region, a single attosecond pulse is\nemitted by the ion.\nDOI: 10.1103\/PhysRevA.66.063411 PACS number~s!: 42.50.Hz, 32.80.Rm, 42.65.Ky\nI. INTRODUCTION\nAtoms and ions interacting with intense infrared laser\npulses emit high-order harmonics of the driving field in the\nform of coherent attosecond pulses @1–6#. This process is\nreadily understood in terms of the semiclassical recollision,\nor ‘‘Simpleman’s model,’’ whereby electrons are detached\nfrom their parent atom or ion by quasistatic tunneling ioniza-\ntion, oscillate in the field, and return to the core where they\nradiatively recombine @7–11#. A fully quantum version of\nthis model has formed the basis of a vast number of theoret-\nical investigations of high-order-harmonic generation @10–\n12#, and has been used successfully to analyze experiment\n~see, e.g., Ref. @13#!. This theory relies on the strong-field\napproximation ~SFA!, which assumes that the interaction of\nthe detached electron with the field is much stronger than its\ninteraction with the core so that the latter can be neglected.\nIn addition to explaining high-order-harmonic generation,\nthe model also forms the basis of our present understanding\nof other processes occurring in low-frequency laser fields,\nsuch as high-order above threshold ionization ~ATI! and\nrecollision-induced multiple ionization.\nOnce detached, the electron is accelerated by both the\nelectric-field and magnetic-field components of the incident\nbeam. The magnetic-field component tends to deflect the tra-\njectory towards the direction of propagation of the beam,\nwith the result that the electron never returns to the nucleus if\ndetached with zero velocity. The drift in the propagation di-\nrection imparted by the Lorentz force is largely offset by the\nwidth of the returning wave packet, and is therefore negli-\ngible at the intensities and wavelengths normally used in\nexperiments on high-order-harmonic generation ~typically\n1014–1015 W cm22 in the visible or near infrared!. In these\nconditions, the Lorentz force does not need to be taken into\naccount and the coupling of the electron with the incident\nfield is accurately described within the dipole approximation.\nHowever, at much higher intensities the drift is no longer\nnegligible and the dipole approximation ceases to be valid.\nMoreover, the electron’s dynamics becomes relativistic at\nvery high intensities. ~At the Ti:sapphire wavelength, 800\nnm, the ratio of the nonrelativistic ponderomotive energy of\nthe electron to its rest energy exceeds unity for an intensity\nof 8.531018 W cm22.!\nRecent theoretical investigations of atomic stabilization in\nthe high-frequency stabilization regime @14–18# and of pho-\nton emission by ions interacting with intense near-infrared\nlaser pulses @19–24# have established the existence of a\n‘‘nondipole nonrelativistic’’ dynamical regime, in which the\neffect of the magnetic-field component of the laser is too\nlarge for the dipole approximation to be appropriate but not\nso large that a relativistic description is necessary. At the\nTi:sapphire wavelength, the dipole approximation is ex-\npected to remain valid up to intensities of about 531016–1\n31017 W cm22 ~depending on the system, as will be seen\nbelow!. Due to the magnetic drift, the probability that the\nelectron recombines with the core is non-negligible only if\nthe electron is initially detached with a nonzero velocity in\nthe direction opposite to the propagation direction of the in-\ncident beam. However, the detachment probability falls off\nrapidly if this initial velocity departs from zero @25,26#. The\nconsequence is that the harmonic generation is weaker and\nvaries differently as a function of the frequency of the emit-\nted photon than would be the case in the absence of the\nLorentz force.\nThe dipole approximation has been assumed in nearly all\nthe theoretical work to date on high-order-harmonic genera-\ntion in low-frequency fields. Only a few fully quantum cal-\nculations, all based on the strong-field approximation, have\naddressed the role of the magnetic drift in this context. Ex-\npressions for the dipole moment of an atom or ion in the\nPHYSICAL REVIEW A 66, 063411 ~2002!\n1050-2947\/2002\/66~6!\/063411~13!\/$20.00 ©2002 The American Physical Society66 063411-1\nnondipole nonrelativistic regime have been developed by\nWalser et al. @21# and, in another form, by us @22,27#, and\napplied to emission driven by ultrashort pulses. A relativistic\nformulation of harmonic generation in stationary fields,\nbased on the Klein-Gordon equation, has also been given by\nMilosˇevic´, Hu, and Becker @20,24#.\nIn the present paper, we give a detailed account of the\nnondipole SFA sketched in Ref. @22# and relate it to the\ntheory of Walser et al. @21#. We also assess the importance of\nthe relativistic effects neglected in our approach by compar-\ning with results obtained by Milosˇevic´, Hu, and Becker @20#.\nWe consider, in particular, the emission of photons by iso-\nlated Li21, Be31, and Ne61 ions exposed to strong near-\ninfrared pulses. We do not study emission from neutrals, as\nonly multicharged ions can withstand the intensities at which\nthe magnetic drift becomes significant without ionizing im-\nmediately. The importance of the nondipole effects is inves-\ntigated by comparing the nondipole nonrelativistic photon\nemission spectra with dipole spectra for long pulses ~repre-\nsented by stationary fields! as well as for few-cycle pulses.\nThe numerical results are interpreted with the help of the\nrecollision model, generalized to the nondipole case. The tra-\njectories we consider are real and obey the classical equa-\ntions of motion. This approach complements the description\nof the electron’s dynamics in terms of complex trajectories\ndiscussed in Ref. @20#; the two approaches lead to essentially\nthe same physical picture. Finally, we illustrate how a sec-\nond, weak laser pulse can be used to compensate for the\nmagnetic drift of the electron. In particular, we show that the\nrecombination probability of selected electron trajectories\ncan be enhanced by several orders of magnitude in this way,\nthereby leading to photon emission in the form of a single\nattosecond x-ray pulse. Unless otherwise indicated, atomic\nunits are used throughout the paper.\nII. THEORETICAL APPROACH\nA. Nondipole nonrelativistic approximation\nWe assume that the vector potential describing the laser\nfield can be written as\nA~h!5eˆ~E\/v! f ~h!sin~h!, ~1!\nwith h5v(t2kˆ\u0095r\/c). The field has a carrier wavelength l\n52pc\/v , field strength E, is linearly polarized with polar-\nization vector eˆ, and propagates in the direction kˆ . The func-\ntion f (h) describes the temporal profile of the pulse; f (h)\n[1 for a stationary field.\nThe influence of the magnetic-field component of the la-\nser on the electron dynamics can be accounted for in the\nlong-wavelength and nonrelativistic regime considered here\nby expanding the vector potential to first order in 1\/c . As-\nsuming the atom to be initially located at the origin leads to\nA~h!.A~vt !1\n1\nc\n~kˆ\u0095r!E~vt !, ~2!\nwhere E(vt)52(d\/dt)A(vt)52eˆ(d\/dt)A(vt)5eˆE(vt).\nOur work is based on the time-dependent Schro¨dinger equa-\ntion\ni\n]\n]t\nC~r,t !5S 12 @2i\u00931A~vt !#211c ~kˆ\u0095r!@2i\u0093\n1A~vt !#\u0095E~vt !1V~r ! DC~r,t !, ~3!\nwhich is exact up to order 1\/c in the atom-field interaction.\nWe neglect the spin of the electron. The potential V(r) de-\nscribes the interaction of the electron with the ionic core.\nThere are two nondipole terms in the Hamiltonian: the first\none, in \u0093\u0095E(vt), gives rise to electric quadrupole and mag-\nnetic dipole transitions. The second one, in A(vt)\u0095E(vt),\ncontributes to the drift in the propagation direction induced\nby the magnetic-field component of the incident beam and\nhas a large influence on the emission of photons by ions at\nhigh laser intensities.\nAt low frequencies, it is appropriate to transform the time-\ndependent Schro¨dinger equation to the length gauge, with the\nresult\ni\n]\n]t\nCL~r,t !5S 2 12 „21Fr2 ic ~kˆ\u0095r!\u0093G\n\u0095E~vt !1V~r ! DCL~r,t !, ~4!\nwhere CL(r,t)5exp@iA(vt)\u0095r#C(r,t). By introducing the\nretarded Green’s function associated with the Hamiltonian of\nEq. ~4!, the wave function CL(r,t) can be obtained as the\nsolution of a time-dependent Lippmann-Schwinger equation.\nIn the SFA approach of Lewenstein and co-workers @1,10#,\nthis Green’s function is replaced by the Volkov Green’s func-\ntion associated with the Hamiltonian that describes a free\nelectron in the laser field, GV\n(1)(r,t;r8,t8). To account for the\nmagnetic-field component of the laser pulse at high intensi-\nties, we employ the nondipole Volkov Green’s function dis-\ncussed in the Appendix. Neglecting continuum-continuum\ntransitions @28#, the dipole moment of the atom then reduces\nto\nd~ t !.E\n2‘\nt\ndt8E drdr8f0*~r,t !\n3~2r!GV\n(1)~r,t;r8,t8!H int~ t8!f0~r8,t8!1c.c.\n~5!\nThe atom or ion is initially in its ground state and is de-\nscribed by the wave function f0(r,t)5f0(r)exp(iIpt), Ip be-\ning the ionization potential of the state. H int(t8) is the atom-\nfield interaction Hamiltonian\nH int~ t8!5Fr2 ic ~kˆ\u0095r!\u0093G\u0095E~vt8!. ~6!\nEquation ~5! can also be written in the form\nCHIRILA˘ et al. PHYSICAL REVIEW A 66, 063411 ~2002!\n063411-2\nd~ t !.2ImE\n0\nt\ndt8E dpdrec* @p~p,t !#\n3exp@2iS~p,t ,t8!#d ion@p~p,t8!,t8# , ~7!\nwhere\np~p,t !5p1A~vt !1\n1\nc\nFp\u0095A~vt !1 12 A2~vt !Gkˆ , ~8!\nS~p,t ,t8!5\n1\n2Et8\nt\ndt9@p~p,t9!#21Ip~ t2t8!, ~9!\ndrec~q!5~2p!23\/2E dre2iq\u0095r~2r!f0~r!, ~10!\nand\nd ion~q,t !5~2p!23\/2E dre2iq\u0095rH int~ t !f0~r!. ~11!\nThe spectrum of the emitted photons is then obtained by\ncalculating ueˆ\u0095a(V)u2, for emission polarized parallel to the\npolarization direction of the incident pulse, and ukˆ\u0095a(V)u2,\nfor emission polarized along the direction of propagation of\nthe incident pulse. In these expressions, V denotes the angu-\nlar frequency of the emitted photon and a(V) the Fourier\ntransform of d¨ (t). The ratio V\/v is an effective ‘‘harmonic\norder.’’ Results in the dipole approximation are obtained by\nsetting 1\/c50. The SFA is readily modified to include the\ndepletion of the ground state @1,10#; however we can neglect\ndepletion for the laser parameters and atomic systems con-\nsidered here.\nB. Saddle-point integration\nThe quasiclassical action S(p,t ,t8) is a rapidly varying\nfunction of p, t, and t8, and therefore the required integra-\ntions in Eq. ~7! can be carried out using the saddle-point\nmethod. We proceed by first using the relation\nd ion@p~p,t8!,t8#52i\nd\ndt8\nE dr\n~2p!3\/2\ne2ip(p,t8)\u0095rf0~r!\n52i\nd\ndt8\nf˜ @p~p,t8!# , ~12!\nwhere\nf˜ @p~p,t8!#5\n~8Ip!5\/4\n8p\n1\n@p2~p,t8!\/21Ip#2\n5\n~8Ip!5\/4\n8p F2 ]]t8 S~p,t ,t8!G\n22\n~13!\nis the Fourier transform of the ground-state wave function of\nthe ion. We have assumed that V(r) is a Coulomb potential\nwith effective nuclear charge (2Ip)1\/2. Equation ~7! is then\nintegrated by parts. Since H int(t850)50, the boundary term\nat t850 is zero while the boundary term at t85t can be\nignored; it corresponds to the process whereby the electron\nboth ionizes and recombines at time t. Next, the integral over\np is approximated using the saddle-point method, with the\nresult\nd~ t !.2Im\n~8Ip!5\/4\n8p E0\nt\ndt8C~t!drec* @p~ps ,t !#\n3exp@2iS~ps ,t ,t8!#F ]\n]t8\nS~ps ,t ,t8!G21. ~14!\nThe saddle momentum ps depends on t and t8 and is obtained\nby solving\n\u0093pS~p,t ,t8!up5ps50. ~15!\nThe factor\nC~t!5~2p!3\/2S ~«1it!3F12 1\nc2\n~eˆ\u0095ps!2G D 21\/2, ~16!\nwith t5t2t8 and « a small positive parameter, can be un-\nderstood physically as arising from wave-packet spreading.\nThe integral over t8 in Eq. ~14! is straightforward to\nevaluate numerically. However, the integration must be re-\npeated for each value of t, due to the dependence of the\nintegrand on t. The total computational effort required for\ncalculating the temporal variation of the dipole moment thus\nincreases as the square of the laser-pulse duration. For this\nreason, and because of the rapid oscillations of the exponen-\ntial term, it is advantageous to calculate the integral using the\nsaddle-point method. The saddle times ts are complex and\nare determined by the equation\n2\n]\n]t8\nS~ps ,t ,t8!u t85ts5@p\n2~ps ,t8!\/21Ip#u t85ts50.\n~17!\nExpanding the denominator in Eq. ~14! in a Taylor series,\nretaining only the linear term, and noting that the integrand\nhas a first-order pole at the saddle times @29#, the dipole\nmoment is found to be\nd~ t !.22Re\n~8Ip!5\/4\n8 (ts\nC~ t2ts!drec* @p~ps ,t !#\n3exp@2iS~ps ,t ,ts!#Fp~ps ,t8!\u0095 ]\n]t8\np~ps ,t8!G\nt85ts\n21\n.\n~18!\nIn all the cases considered, we have found that the spectra\ncalculated using Eq. ~18! are in very good agreement with\nthose obtained by carrying out the integration over t8 in Eq.\nNONDIPOLE EFFECTS IN PHOTON EMISSION BY . . . PHYSICAL REVIEW A 66, 063411 ~2002!\n063411-3\n~14! numerically. Typically, they differ by less than a factor\nof 2, and the agreement improves as the laser intensity in-\ncreases.\nThe saddle time can also be obtained using a semianalyti-\ncal approach, similar to that described by Ivanov, Brabec,\nand Burnett @30# for calculations in the dipole approxima-\ntion. In this approach, the saddle time is expressed as ts5td\n1D , with td determined by solving\npe~ps ,td!5eˆ\u0095p~ps ,td!50. ~19!\nEquation ~17! is then expanded in powers of D ,\n2\n]\n]t8\nS~ps ,t ,t8!u t85ts5s01s1D1\n1\n2 s2D\n21O~D3!.\n~20!\nIn terms of the component of p(ps ,td) in the propagation\ndirection,\npk~ps ,td!5kˆ\u0095p~ps ,td!\n52\n1\n2c~ t2td!\nE\ntd\nt\ndt9uA~vt9!2A~vtd!u2, ~21!\nthe first coefficient is\ns05Ip1\n1\n2 pk\n2~ps ,td!. ~22!\nAnalytical expressions for s1 and s2 are lengthy, and in prac-\ntice can be obtained numerically. Setting Eq. ~20! equal to\nzero and solving for D , the dipole moment ~18! is evaluated\nusing\nS~ps ,t ,ts!.S~ps ,t ,td!2s0D2 12 s1D22 16 s2D3 ~23!\nand\nFp~ps ,t8!\u0095 ]\n]t8\np~ps ,t8!G\nt85ts\n.s11Ds2 . ~24!\nWe have verified that this approach yields results that are for\nall practical purposes identical to those derived using Eqs.\n~17! and ~18!.\nThe calculations can be simplified even further by ne-\nglecting terms of order 1\/c2 and higher in the saddle momen-\ntum. In this approximation\nps52\na1~ t ,t8!\nt2t8\neˆ1\n1\nc Fa12~ t ,t8!~ t2t8!2 2 a2~ t ,t8!2~ t2t8!Gkˆ , ~25!\nwhere\nan~ t ,t8!5E\nt8\nt\ndt9An~ t9!. ~26!\nThis means that p(ps ,td) and S(ps ,t ,td), respectively, will\nbe correct to order 1\/c and 1\/c2. Using Eq. ~25!, Eq. ~19!\nreduces to\nE\ntd\nt\ndt9@A~vt9!2A~vtd!#50, ~27!\nthereby giving td in the dipole approximation. The coeffi-\ncients s1 and s2, to order 1\/c2, are then found to be\ns15\npk\n2~ps ,td!\nt2td\n, ~28!\ns25E2~vtd!F11 1c pk~ps ,td!G1 3s1t2td . ~29!\nNote that all of the nondipole corrections to the expansion\ncoefficients si are of order 1\/c2. Hence, consistent with the\naction being correct to order 1\/c2, we set\ns150, s25E2~vtd!. ~30!\nThe resulting dipole moment can be expressed as @21,30#\nd~ t !.22Im(\ntd\narec* ~ t ,td!apr~ t ,td!a ion~ t ,td!, ~31!\nwith the ionization, propagation, and recombination ampli-\ntudes, respectively, given by\na ion~ t ,td!5\n~8Ip!5\/4\n8~2s0s2!1\/2\nexpF213 S 8s0\n3\ns2\nD 1\/2G , ~32!\napr~ t ,td!5C~ t2ts! exp@2iS~ps ,t ,td!# , ~33!\narec* ~ t ,td!5drec* @p~ps ,t !# . ~34!\nWe have evaluated the accuracy of the formula ~31! by cal-\nculating ueˆ\u0095a(V)u2 and comparing with the results obtained\nusing exact numerical complex saddle times ts in Eq. ~18!,\nfor the laser parameters and ions considered in Sec. III. The\napproximation given by Eq. ~31! works extremely well: the\nspectra cannot be distinguished on the scales used in the\ndiagrams.\nThe expression of d(t) given by Walser et al. @21# is ob-\ntained by ignoring the nondipole corrections in the preexpo-\nnential factor in the ionization amplitude ~32! and the recom-\nbination amplitude ~34! @31#. These additional\napproximations have no significant effect on the emission\nspectra for photons polarized along the laser polarization di-\nrection. Setting 1\/c50 in all three amplitudes in Eq. ~31!\nleads to the formula obtained by Ivanov, Brabec, and Burnett\n@30# in the dipole approximation.\nC. Classical electron trajectories\nA simple physical interpretation can be given to the re-\nquirement that the detachment time td satisfy Eq. ~19!, as\nwill now be discussed. We start with the classical analog of\nthe Hamiltonian operator in Eq. ~3!,\nCHIRILA˘ et al. PHYSICAL REVIEW A 66, 063411 ~2002!\n063411-4\nH5\n1\n2 @p1A~vt !#\n21\n1\nc\n~kˆ\u0095r!@p1A~vt !#\u0095E~vt !,\n~35!\nobtained by replacing the operator 2i\u0093 with the classical\ncanonical momentum p. The corresponding classical equa-\ntions of motion are solved readily: If, at time t0, the electron\nis located at the origin and has velocity v0, at time t1 its\nposition and velocity are, respectively,\nr~ t1!5E\nt0\nt1\ndt9v~ t9! ~36!\nand\nv~ t1!5ve~ t1!eˆ1vk~ t1!kˆ , ~37!\nwith\nve~ t1!5eˆ\u0095v01@A~vt1!2A~vt0!#11c E~vt1!Et0\nt1\ndt9vk~ t9!\n~38!\nand\nvk~ t1!5kˆ\u0095v01 12c @ve~ t0!1A~vt1!2A~vt0!#22\n1\n2c ve\n2~ t0!.\n~39!\nThe corresponding acceleration is v˙(t1)5v˙ e(t1)eˆ1v˙ k(t1)kˆ ,\nwith\nv˙ e~ t1!52E~vt1!1\n1\nc\nE˙ ~vt1!kˆ\u0095r~ t1!21c A˙ ~vt1!vk~ t1!\n~40!\nand\nv˙ k~ t1!5\n1\nc\nA˙ ~vt1!@ve~ t0!1A~vt1!2A~vt0!# . ~41!\nThe first two terms on the right-hand side of Eq. ~40! can be\nrecognized as the acceleration imparted by the electric-field\ncomponent of the laser, corrected to first order in 1\/c for its\nspatial inhomogeneity in the propagation direction. The third\nterm and the right-hand side of Eq. ~41! describe the accel-\neration due to the Lorentz force, also to first order in 1\/c . A\nwave packet formed by a linear superposition of nondipole\nVolkov waves, Eq. ~A4!, which at time t0 is localized at the\norigin and has velocity v0 , follows the classical trajectory\n~36! @22#.\nConsider now an electron that is detached from the core at\ntime t0 with zero initial velocity in the polarization direction.\nIn the recollision model, the electron follows a classical tra-\njectory unperturbed by the atomic potential. A trajectory re-\nturning to the core leads to photon emission via recombina-\ntion, with the energy of the emitted photon being the sum of\nthe ionization potential and the kinetic energy of the electron\nat the time of recombination. Working within the dipole ap-\nproximation, Lewenstein and co-workers @10# have shown\nthat there is a one-to-one correspondence between the clas-\nsical trajectories of the recollision model and the saddle\ntimes obtained from Eq. ~27!. Such a correspondence also\nexists in our nondipole approach. In particular, it is straight-\nforward to show that a necessary and sufficient condition for\nthe electron to return to the origin at time t is that t0 is any of\nthe saddle times td defined by Eq. ~19! and that v0\n5pk(ps ,td)kˆ , where pk(ps ,td) is defined by Eq. ~21!. In the\nclassical model, pk(ps ,td) is thus the velocity in the pulse\npropagation direction that the electron must have at the time\nof detachment, td , in order to return to the nucleus at the\ntime of recombination, t. This initial velocity compensates\nexactly the displacement imparted by the magnetic-field\ncomponent of the pulse on the free electron in the field @21#.\nHow upk(ps ,td)u varies with t2td is shown in Fig. 1, for\na stationary field of 800 nm wavelength and 1.8\n31017 W cm22 intensity. Results are given for trajectories\nstarting at equally spaced values of td . Few or no trajectories\ncome back to the origin in certain time intervals, hence the\ngaps in the data. Also given in Fig. 1, for each trajectory, are\nthe strength of the electric field at the time of detachment,\nuE(td)u, the maximum speed the electron reaches between td\nand t, vmax , and its speed at the time of recombination, v(t).\nAs will be seen below, all of these quantities are relevant for\nunderstanding the features of the nondipole spectra.\nAt this stage, we recall that the maximum kinetic energy\nof a returning electron in the dipole approximation is\n3.17Up , where Up is the ponderomotive energy. This maxi-\nmum fixes the position of the cutoff frequency in the spec-\ntrum of emitted photons when nondipole effects are ne-\nglected @8–10#. The corresponding maximum velocity is\nindicated by the dashed vertical line in Fig. 1. Another well\nknown fact is that several trajectories return with the same\nFIG. 1. Shown, for trajectories that return to the core, are ~i! the\nelectron’s speed perpendicular to the laser polarization direction\nwhen it is detached, upk(ps ,td)u; ~ii! the electron’s speed when it\nreturns to the core, v(t); ~iii! its maximum speed between detach-\nment and recombination, vmax ; and ~iv! the strength of the electric\nfield at the time of detachment, uE(td)u. These quantities are plotted\nas functions of the duration of the trajectory, t2td , for a stationary\nfield of 800 nm wavelength and intensity 1.831017 W cm22.\nNONDIPOLE EFFECTS IN PHOTON EMISSION BY . . . PHYSICAL REVIEW A 66, 063411 ~2002!\n063411-5\nkinetic energy during each half cycle, namely, a short trajec-\ntory ~that lies to the left of the dashed line! and one or sev-\neral long trajectories ~that lie to the right of the dashed line!.\nThe long trajectories with return times of more than one\nperiod can give rise to intermediate plateaus and, through\ninterference, to oscillations in the dipole spectrum.\nWe see in Fig. 1 that the behavior of the four plotted\nquantities is very different depending on whether the trajec-\ntory is long or short. In particular, for the short trajectories,\nthe velocity upk(ps ,td)u and the magnitude of the electric\nfield at the detachment time decrease rapidly with decreasing\nt2td . In addition, the electron attains its maximum velocity\nwhen it returns to the core. In contrast, for the long trajecto-\nries, upk(ps ,td)u, uE(vtd)u, and the maximum velocity of the\nelectron remain nearly constant close to their maximum al-\nlowed values. Note, in particular, that for the field considered\nin the figure, upk(ps ,td)u, is about 3 a.u. for these trajecto-\nries.\nIII. RESULTS AND DISCUSSION\nA. Nondipole effects in photon emission\nDipole and nondipole nonrelativistic spectra are compared\nin Figs. 2 and 3 for photon emission by multiply charged\nions driven by a stationary 800-nm laser field. The modulus\nsquared of the Fourier transform of the dipole acceleration is\nplotted against the effective harmonic order, V\/v . The Fou-\nrier transform of the dipole acceleration is defined as\na~V!5\n1\n~2p!1\/2\nE\nT\nT12p\/v\ndt exp~2iVt !d¨ ~ t !, ~42!\nwhere T is chosen large enough so as to include the long\ntrajectories that contribute to the dipole moment. We use the\nnotation ae(V)5eˆ\u0095a(V) and ak(V)5kˆ\u0095a(V) for the com-\nponents of the acceleration.\nThe gradual breakdown of the dipole approximation with\nincreasing intensity is illustrated in Fig. 2 for emission by a\nNe61 ion (Ip5207.3 eV). Going from 0.5 to 4\n31017 W cm22, the influence of the magnetic-field compo-\nnent first manifests itself as a reduction in photon emission\npolarized along eˆ as compared to the dipole approximation,\nthen to a ‘‘bending over’’ of the plateaus, and finally to a\nmarked suppression of emission at both ends of the spectrum\nand the disappearance of the intermediate cutoffs which\nseparate the plateaus in the dipole approximation. A small\nshift in the position of the cutoffs is also noticeable.\nNondipole spectra for emission polarized parallel to the\ndirection of propagation of the incident field are also shown\nin Fig. 2. Emission of photons polarized in this direction is\nforbidden in the dipole approximation. Compared to emis-\nsion polarized along eˆ , emission polarized along the propa-\nFIG. 2. The magnitude\nsquared of the Fourier transform\nof the dipole acceleration ~in a.u.!\nas a function of the photon energy\n~in units of \\v), for a Ne61 ion\ninteracting with a stationary laser\nfield of wavelength 800 nm. Spec-\ntra for the emission of photons po-\nlarized along the laser polarization\ndirection obtained in the dipole\napproximation (De) and in the\nnondipole nonrelativistic approxi-\nmation (NDe) are shown, as well\nas the nondipole nonrelativistic\nspectra for photon emission polar-\nized along the laser propagation\ndirection (NDk).\nFIG. 3. The magnitude squared of the Fourier transform of the\ndipole acceleration ~in a.u.! as a function of the harmonic order\n~upper plots!. Results for the ions Li21 and Be31 in the dipole\napproximation ~gray curves! and in the nondipole nonrelativistic\napproximation ~black curves! are shown. The ions are irradiated by\na stationary field of peak intensity 1.831017 W cm22 and wave-\nlength 800 nm. In the lower plots the ionization rate defined by Eq.\n~43!, w(t ,td), is given for electron trajectories that return to the\ncore, as a function of the harmonic order of the photon emitted at\nrecombination. The dipole and nondipole values of w(t ,td) are in-\ndicated by crosses and circles, respectively.\nCHIRILA˘ et al. PHYSICAL REVIEW A 66, 063411 ~2002!\n063411-6\ngation direction is weaker, but the spectra are otherwise simi-\nlar in most respects. The dip visible in the low-energy part of\nFigs. 2~a! and 2~b! also occurs when ions are driven by ul-\ntrashort pulses, and can be attributed to accidental cancella-\ntions between different terms contributing to the dipole mo-\nment @22#.\nIn Fig. 2~a!, we observe that uae(V)u2 is reduced by more\nthan one order of magnitude compared to the predictions of\nthe dipole approximation at the relatively weak intensity of\n531016 W cm22. This reduction contrasts with the smaller\ndecrease found for a Li21 ion irradiated by a two-cycle\n800-nm pulse of 931016 W cm22 peak intensity @22,27#,\nand the even smaller nondipole effects found for a He1 ion\nirradiated by a 5-fs 800-nm pulse of 531016 W cm22 peak\nintensity @21#. As will be seen later, the duration of the pulse\ninfluences to some degree the overall effect of the magnetic-\nfield component on photon emission. However, the origin of\nthe difference between the results of Fig. 2 and the results for\nHe1 and Li21 can be attributed to the larger ionization po-\ntential of Ne61. That Ip plays an important role is demon-\nstrated in the upper part of Fig. 3, where photon emission by\nLi21 (Ip5122.5 eV) and Be31 (Ip5217.7 eV) are com-\npared for the same incident field @32#. Although the intensity\nis the same for both ions, the relative difference between the\ndipole and nondipole spectra is much less for Li21.\nThe strong dependence on Ip , and in fact all the major\ndifferences between the dipole and nondipole spectra, can be\nreadily understood within the framework of the recollision\nmodel. Only two key quantities need to be considered: the\neffective detachment rate when the electron is born and its\nkinetic energy when it returns to the core. In the lower part\nof Fig. 3 we show, for each trajectory of Fig. 1, the detach-\nment rate at time td of an electron with velocity v’\n[pk(ps ,td) transverse to the electric field @33#,\nw~ t ,td!5\n4\np\n~2Ip!3\nuE~vtd!u2\nexpF2 23 ~2Ip1v’\n2 !3\/2\nuE~vtd!u\nG , ~43!\nas a function of the harmonic order of the photon emitted at\nrecombination, @Ip1v2(t)\/2#\/v . We indicate the nondipole\nvalues of w(t ,td) by circles and the dipole values ~obtained\nby setting v’50) by crosses. The rate ~43! varies with the\nfield in the same way as the square of the ionization ampli-\ntude ~32!, a ion\n2 (t ,td), and has the same exponential depen-\ndence on Ip . Since the propagation and recombination am-\nplitudes vary far less in magnitude than a ion(t ,td) from\ntrajectory to trajectory, the importance of the contribution to\nthe spectrum of the different trajectories can be effectively\ngauged by the corresponding values of w(t ,td). As has been\nshown for He1 interacting with a short laser pulse @34#,\nmuch insight about the photon emission spectrum can be\ngained from this type of plot.\nIn the dipole approximation, w(t ,td) is largest for the long\ntrajectories, as electrons having short trajectories are de-\ntached at lower electric fields. ~See Fig. 1.! Therefore, short\ntrajectories tend to contribute less to the photon emission\nspectrum. However, when the magnetic-field component of\nthe laser field is taken into account, the opposite is true. This\nis due to the fact that pk(ps ,td) is larger for the long trajec-\ntories than for the short ones. The exponential dependence of\na ion(t ,td) on the initial transverse velocity means that the\nionization amplitude tends to be smaller for the long trajec-\ntories than for the short ones, and the latter end up dominat-\ning the spectrum over much of its range @20#. The secondary\nplateaus, which arise from the longest trajectories, almost\ncompletely vanish ~although they still visibly contribute to\nthe beryllium nondipole spectrum below V\/v52500). The\noscillations evident in the dipole spectrum largely disappear\nbecause at most frequencies only one set of trajectories ~the\nshort ones! significantly contribute to emission. The spec-\ntrum bends over as ionization is exponentially suppressed,\ndue to the relatively small value of uE(td)u for the short tra-\njectories that give rise to the lower harmonics, and to the\nlarge initial transverse velocity for the short trajectories that\nproduce the high harmonics. Finally, the reduction in har-\nmonic emission is proportionally larger for Be31 than for\nLi21 because the ionization amplitude varies faster with v’\n2\nwhen Ip is larger.\nWe now evaluate the importance of the relativistic effects\nneglected in our approach by comparing, in Fig. 4, our non-\ndipole nonrelativistic results with relativistic results recently\nobtained by Milosˇevic´, Hu, and Becker @20,24#. The case of\na Ne61 ion interacting with a stationary field of wavelength\n1054 nm and intensities 0.731017 and 1.431017 W cm22 is\nconsidered. Milosˇevic´’s, Hu, and Becker’s calculations are\nalso done within the SFA but are based on the Klein-Gordon\nequation rather than on the Schro¨dinger equation. The rela-\ntivistic results shown in the figure are the emission rates\npresented in Fig. 2 of Ref. @20#, rescaled so as to facilitate\ncomparison @35#.\nThe large differences between the dipole and nondipole\nresults indicate a strong influence of the magnetic-field com-\nponent of the laser field for these parameters. As in Figs. 2~d!\nand 2~e!, the nondipole spectrum is completely dominated by\nthe short trajectories at 1.431017 W cm22. At this intensity,\nthe maximum velocity of the electron, vmax , is at most 42%\nof the speed of light ~i.e., vmax\n2 \/c250.18) for any returning\ntrajectory. The good agreement between our nondipole non-\nrelativistic spectra and the relativistic spectra, aside from an\narbitrary overall factor, suggests that the relativistic effects\nthat are not taken into account in our model are not impor-\ntant. The difference is largest for the highest harmonics, as\ncould be expected, since vmax\n2 \/c2 grows linearly with the en-\nergy of the photon emitted at recombination for electrons\nfollowing short trajectories. Compared to the spectra ob-\ntained in the dipole approximation, the cutoffs occur at a\nslightly higher photon energy in the nondipole nonrelativistic\ncalculation. The origin of this effect is the additional kinetic\nenergy the returning electron acquires due to its drift along\nthe pulse propagation direction. However, the nondipole non-\nrelativistic calculation neglects other effects, such as the in-\ncrease in the inertial mass, which contribute to the kinetic\nenergy to order 1\/c2. In the relativistic results, these addi-\ntional effects lead to a small displacement of the cutoffs to\nlower energies. We have verified that the classical calcula-\ntions within the recollision model yield the same shifts as in\nNONDIPOLE EFFECTS IN PHOTON EMISSION BY . . . PHYSICAL REVIEW A 66, 063411 ~2002!\n063411-7\nour nondipole nonrelativistic spectra and as in Milosˇevic´,\nHu, and Becker spectra when the dynamics of the detached\nelectron is described, respectively, by the Hamiltonian ~35!\nand by the relativistic Lorentz equation. Finally, we note that\nvmax\n2 \/c2 is less than 0.18 for the short trajectories responsible\nfor the generation of photons below the harmonic order\n30 000 at 800 nm wavelength, and is less than 0.10 for the\nshort trajectories responsible for the strongest photon emis-\nsion in Figs. 2 and 3. The relativistic effects neglected in our\napproach are therefore not expected to be significant at the\nintensities considered.\nTo conclude this section, we briefly discuss photon emis-\nsion by ions driven by ultrashort pulses. Spectra for three-\nand four-cycle pulses are shown in the top and middle dia-\ngrams of Fig. 5. The field is described by Eqs. ~1! and ~2!\nwith\nf ~h!5sin2S h2n D , ~44!\nwhere n denotes the number of optical cycles of the pulse.\nThe pulse is assumed to extend over all space. The corre-\nsponding Fourier transform of the dipole acceleration is\na~V!5\n1\n~2p!1\/2\nE\n0\n2pn\/v\ndt exp~2iVt !d¨ ~ t !. ~45!\nThe integral extends over the entire duration of the pulse\ninstead of just one optical cycle as in the case of a stationary\nfield. Results for a stationary field of the same intensity are\nshown in the bottom diagram. The plateau structure of the\nspectra for few-cycle pulses largely originates from the tem-\nporal variation of the intensity rather than from the contribu-\ntion of very long trajectories @34#. ~For every half-cycle dur-\ning an ultrashort pulse, the trajectories are detached with\ndifferent probabilities and return with different kinetic ener-\ngies.! Overall, the magnetic-field component of an ultrashort\npulse affects photon emission in a similar way as for station-\nary fields. However, for short pulses, photon emission is not\nas strongly suppressed at the low-energy end of the spec-\ntrum, and plateau structures with oscillations are still visible.\nThis indicates that more than one electron trajectory is con-\ntributing to the emission of a particular harmonic in the larg-\nest part of the spectrum. Consider, for example, the low har-\nmonics. As noted above, these are weak in the stationary\ncase because they can be produced only through the return of\nan electron detached in a weak electric field. For few-cycle\npulses, they can also be produced through the return of an\nelectron detached near the end of the pulse, at a time where\nFIG. 4. The magnitude\nsquared of the Fourier transform\nof the dipole acceleration ~in a.u.!\nas a function of the photon energy\n~in units of \\v). Spectra for a\nNe61 ion obtained in the dipole\nand nondipole nonrelativistic ap-\nproximations are shown for the\nemission of photons polarized\nalong the laser polarization direc-\ntion. The ion is irradiated by a sta-\ntionary laser field of peak intensi-\nties 0.7 and 1.431017 W cm22, as\nindicated, and wavelength 1054\nnm. The nondipole results are\ncompared with the relativistic re-\nsults ~R! of Milosˇevic´, Hu, and\nBecker @20#.\nFIG. 5. The magnitude squared of the Fourier transform of the\ndipole acceleration ~in a.u.! as a function of the photon energy ~in\nunits of \\v!. Spectra for a Be31 ion obtained in the dipole and\nnondipole approximations are shown for the emission of photons\npolarized along the laser polarization direction (De , NDe) for a\nthree cycle pulse (n53), a four cycle pulse (n54), and a station-\nary field. The peak intensity is 3.631017 W cm22 and l\n5800 nm.\nCHIRILA˘ et al. PHYSICAL REVIEW A 66, 063411 ~2002!\n063411-8\nthe electric field is strong but the intensity envelope of the\npulse falls off rapidly. Since the falloff prevents it from at-\ntaining a high velocity, the electron can only contribute low-\nenergy photons and is not deflected as much by the\nmagnetic-field component of the pulse.\nB. Selective compensation of the magnetic drift\nusing a second laser pulse\nAt intensities where the dipole approximation is valid, the\ncontribution of each electron trajectory to photon emission\ndepends primarily on the electric-field strength at the time of\nionization. At higher intensities, the contribution of a particu-\nlar trajectory can be drastically reduced by the drift induced\nby the magnetic component of the field. As noted above, to\nreturn to the nucleus the electron must be emitted with a\nnonzero velocity transverse to the electric field, and the prob-\nability for this is exponentially small in the tunneling regime.\nAt the intensities considered here, the Lorentz force acting\non the electron has a magnitude comparable to that exerted\nby the electric-field component of a relatively weak laser\nfield. This suggests that the magnetic drift can be compen-\nsated, at least for certain trajectories, by irradiating the ion\nwith a second, weak laser field, polarized along the propaga-\ntion direction of the intense one. In this section, we show by\nan example that a selective compensation of the magnetic\ndrift through this mechanism is indeed possible.\nWe consider the case of a Ne61 ion irradiated by a com-\nbination of two ultrashort pulses, both with the same carrier\nwavelength ~800 nm!. The first pulse, with vector potential\nA, propagates in the direction kˆ and has the polarization\nvector eˆ . The second pulse has the vector potential Aw and\nthe polarization vector eˆw , with eˆw[kˆ . We assume that the\nsecond pulse is weak enough to be treated in the dipole ap-\nproximation. Therefore, the Schro¨dinger equation governing\nthe motion of the electron in the nondipole nonrelativistic\napproach reads\ni\n]\n]t\nC~r,t !5S 12 @2i\u00931A~vt !1Aw~vt !#211c ~kˆ\u0095r!\n3@2i\u00931A~vt !#\u0095E~vt !1V~r ! DC~r,t !,\n~46!\nwith E(vt)52(d\/dt)A(vt). Within the SFA, the dipole\nmoment of the ion can be still be expressed as in Eqs. ~14!\nand ~18!, with the saddle momentum and the saddle times\ndetermined by Eqs. ~15! and ~17!; however, we now have\np~p,t !5p1A~vt !1Aw~vt !1\n1\nc\nFp\u0095A~vt !1 12 A2~vt !Gkˆ .\n~47!\nWe assume that the two pulses have the same envelope,\nwith the second pulse delayed by a time tw with respect to\nthe first one. We take, specifically,\nA~vt !5\nE\nv\nsin2S vt2n D sin~vt !eˆ ~48!\nand\nAw~vt !5\nEw\nv\nsin2S vt2d2n D sin~vt2d!kˆ , ~49!\nwhere d5vtw and n is the number of optical cycles encom-\npassed by each pulse. In the classical model, an electron\ndetached at a time td must have an initial velocity\nv’52\n1\nt2td\nH E\ntd\nt\ndt9@Aw~vt9!2Aw~vtd!#\n1\n1\n2cEtd\nt\ndt9@A~vt9!2A~vtd!#2J kˆ ~50!\nto return at the nucleus at time t. The electric-field amplitude\nof the second pulse, Ew , and the time delay tw are chosen so\nthat v’’0 for a particular group of trajectories.\nThe left panel in Fig. 6 shows the magnitude squared of\nthe Fourier transform of the dipole acceleration of Ne61 as a\nfunction of the photon energy for a two-cycle Ti:sapphire\npulse with E53.2 a.u. acting alone (Ew50). In order to il-\nlustrate more clearly the differences between the dipole and\nnondipole results, the fast oscillations in the spectra have\nbeen averaged by convoluting with a Gaussian window func-\ntion. Let us first consider the trajectory of an electron ‘‘born’’\nat time td5116 a.u. during the laser pulse. If the Lorentz\nforce was negligible, the electron would return to the nucleus\nat time t’190 a.u., where it could recombine with the emis-\nsion of a photon of energy 7500v . However, the Lorentz\nforce is not negligible: in order to return the electron must\nhave an initial velocity of about 2 a.u. opposite to the direc-\ntion of propagation of the pulse. Correspondingly, uae(V)u2\nis much reduced, compared to its value in the dipole approxi-\nmation.\nIf, in addition, the ion is irradiated by a second two-cycle\npulse, of field strength Ew50.37 a.u., and delayed by tw\n562 a.u. with respect to the first pulse, the electron returns\nto the core if detached with zero velocity at time td5116 a.u.\nIn the center panel in Fig. 6 we see that the magnitude of the\nnondipole spectrum is now comparable to the spectrum ob-\ntained in the dipole approximation in the region of the\n7500th harmonic. The small difference is due to the fact that\nthe magnetic drift is compensated only for some of the tra-\njectories that contribute to emission in this part of the spec-\ntrum, namely, those with td’116 a.u.\nPhoton emission in the region of the cutoff of the second\nplateau can be enhanced in a similar manner, by choosing the\ndelay and the strength of the second pulse to be tw5280\na.u. and E50.32 a.u., respectively. The resulting spectrum is\nshown in the right panel of Fig. 6.\nC. Single attosecond pulse generation\nFinally, we investigate how the magnetic-field component\nof the laser pulse influences photon emission in the time\nNONDIPOLE EFFECTS IN PHOTON EMISSION BY . . . PHYSICAL REVIEW A 66, 063411 ~2002!\n063411-9\ndomain. To this end, we calculate the frequency-resolved di-\npole acceleration for emission in a narrow frequency window\ncentered about V , defined by @36#\nae~ t ,V!5\n1\n~2p!1\/2\neiVtE\n0\n‘\ndV8ei(V82V)t\n3F~V82V!eˆ\u0095a~V8!, ~51!\nwhere F(V82V) is a Gaussian window centered at V8\n5V . The square modulus of ae(t ,V) is shown in Fig. 7, for\nNe61 interacting with a four-cycle pulse of 3.6\n31017 W cm22 peak intensity at 800 nm wavelength. We\nconcentrate on the emission of 3.9-keV photons (V\n52500v).\nThe results calculated in the dipole approximation are\nshown in Fig. 7~a!. Each spike in this diagram corresponds to\na burst of emission of 3.9-keV photons. The spikes occur\nprecisely at the instants where, in the recollision model, de-\ntached electrons return to the nucleus with the speed required\nfor emission at this energy. Seven bursts are particularly\nstrong and have approximately the same intensity, showing\nthat in the dipole approximation the emission is dominated\nby seven groups of trajectories.\nHowever, the magnetic drift, when taken into account,\nchanges this picture dramatically. The central part of the fig-\nure, where the nondipole results are plotted, shows that all\nbut one of the seven returns that contribute most in the dipole\napproximation are severely suppressed. The only significant\nemission event occurs towards the end of the pulse and\nFIG. 6. The magnitude squared of the Fourier transform of the dipole acceleration, in a.u., of Ne61 as a function of the photon energy\n~in units of \\v). The laser-pulse duration is two cycles, with peak intensity 3.631017 W cm22 and wavelength 800 nm. Dipole (De) and\nnondipole (NDe) spectra are shown. In plots ~b! and ~c!, the nondipole results are for the case in which the ion interacts with a second,\nweaker laser pulse polarized along the propagation direction of the intense pulse ~see text!. In plot ~b!, the time delay (tw562 a.u.) and\nintensity (Iw54.831015 W cm22) of the second pulse were chosen such that photon emission in the neighborhood of the 7500th harmonic\nis enhanced, while in plot ~c!, tw5280 a.u. and Iw53.631015 W cm22, leading to the enhancement of emission around the 30 000th\nharmonic.\nFIG. 7. The magnitude squared of the frequency-resolved dipole acceleration for photon emission centered about the 2500th harmonic of\nthe driving field by a single Ne61 ion interacting with a four-cycle Ti:sapphire pulse of 3.631017 W cm22 peak intensity. Shown are results\nobtained in the dipole approximation ~a! and in the nondipole nonrelativistic approximation ~b!,~c!. Plot ~c! shows the enhancement by a\nsecond laser pulse of photon emission at 3.4 laser periods. The peak intensity of the second pulse, Iw , is 2.231014 W cm22 and the delay\ntw is 30.8 a.u.\nCHIRILA˘ et al. PHYSICAL REVIEW A 66, 063411 ~2002!\n063411-10\ndominates the spectrum. The corresponding trajectory is de-\nflected less than the others, owing to the decrease in the\nstrength of the magnetic-field during the trailing edge of the\npulse. The width of the spike indicates that the duration of\nthe burst is about 20 as. ~It is worth noting that the intensity\nof this emission depends crucially on how the envelope of\nthe pulse decreases at the end of the pulse: the slower the\ndecrease, e.g., the longer the pulse, and the weaker the emis-\nsion.! The other trajectories make a smaller contribution;\ntheir main effect is to induce, by interference, the oscillations\nin the nondipole spectrum which are visible in the lower\ncurve of Fig. 8.\nIn Fig. 7~c!, we present uae(t ,V)u2 calculated for a super-\nposition of the same intense pulse with another Ti-sapphire\npulse, as discussed in Sec. III B. The electric-field amplitude\nof the second pulse, Ew , and the delay between the two\npulses, tw , are chosen so as to compensate the magnetic drift\nfor the trajectory giving rise to the strongest burst of emis-\nsion in Fig. 7~b!. As seen from the diagram, when the mag-\nnetic drift is compensated, emission is as strong as in the\ndipole approximation. The other trajectories are further sup-\npressed by the second pulse, with the consequence that a\nsingle attosecond pulse of x-ray photons is emitted. The\nsame conclusions can be drawn from the corresponding spec-\ntrum, shown in Fig. 8. In fact, one sees from the spectrum\nthat with the second pulse, emission is much more intense\nand occurs as a single burst ~note the absence of oscilla-\ntions!, not only for V52500v but also in a large range of\nfrequencies around this value.\nIV. CONCLUSIONS\nIn this paper we have given a detailed account of the\napproach introduced in Refs. @21,22# for describing photon\nemission by ions interacting with laser fields ~stationary or\npulsed! whose peak intensities are sufficiently high so that\nthe dipole approximation is no longer applicable. This ap-\nproach can be viewed as a nondipole generalization of the\nSFA theory of Lewenstein and co-workers @1,10#. It applies\nto the dynamical regime that lies between the usual nonrel-\nativistic dipole regime and the fully relativistic regime. Us-\ning the nondipole nonrelativistic Volkov wave functions ~A4!\nand within the SFA, we have shown that the time-dependent\ndipole moment of the ion in the laser field, d(t), can be\nreduced to the simple form given by Eq. ~18!. Then through\na series of approximations, none of which compromise the\naccuracy of the calculations in any significant way, we re-\ncover the expression for the dipole moment derived by\nWalser et al. @21#, whereby d(t) is obtained as a sum over\namplitudes arising from particular electron trajectories.\nThe trajectories satisfy two simple classical criteria. First,\nif the electron is detached at some earlier time td , its dis-\nplacement along the polarization direction must be zero at\ntime t. Second, at time td its velocity along the laser-pulse\npropagation direction, v’ , must be equal and opposite to the\naverage velocity that the free electron acquires in the propa-\ngation direction due to the Lorentz force between the times td\nand t. These are, of course, nothing more than the conditions\nthat must be imposed if a classical electron detached at time\ntd is to return to the core at time t. One recognizes immedi-\nately the language of the recollision model, modified so as to\naccount for the magnetic-field induced drift of the detached\nelectron. As in the intensity regime where the dipole approxi-\nmation is applicable, it follows that the main features of pho-\nton emission spectra can be understood from two key quan-\ntities, namely, the tunnel ionization rate when the electron is\ndetached and the kinetic energy of the electron when it re-\nturns to the core. In contrast to the dipole approximation, the\ntunnel ionization rates now depend strongly on v’ , and in\nparticular on its magnitude relative to Ip and the magnitude\nof the electric field at the time of detachment. The overall\neffect of the dependence on v’ results, at sufficiently high\nintensities, is a strong suppression of photon emission. Only\ntrajectories with t2td and uv’u small contribute meaning-\nfully to the emission spectrum. As was emphasized recently\nin Ref. @5#, it is remarkable that multiphoton processes in\natoms interacting with intense laser fields, processes that\nwould at first sight appear to be exceedingly complex, can in\nfact be largely understood in terms of classical trajectories of\nelectrons that are detached and then subsequently return to\ntheir parent ion. These processes, in addition, provide a fas-\ncinating example of a system whose dynamics lies at the\ninterface between quantum and classical mechanics.\nTypically, a number of electron trajectories contribute in a\ncomparable way to photon emission in some frequency in-\nterval or to ATI spectra in some energy range. We have dis-\ncussed a scheme whereby a second laser pulse can be used to\ncontrol an individual electron trajectory. By the appropriate\nchoice of the laser parameters, the effect of the drift induced\nby the magnetic-field component of the pulse can be com-\npensated for a selected trajectory, and enhanced for others,\nleading to the emission of a single attosecond pulse of high-\nfrequency photons. The scheme has similarities to the pro-\nFIG. 8. The magnitude squared of the Fourier transform of the\ndipole acceleration of a single Ne61 ion interacting with a four-\ncycle Ti:sapphire pulse of 3.631017 W cm22 peak intensity. Shown\nare results obtained in the nondipole nonrelativistic approximation,\nwith the upper curve illustrating the enhancement of photon emis-\nsion around V\/v52500 when the ion interacts with a second,\nweaker laser pulse having the same peak intensity and delay as in\nFig. 7. The high-energy part of the spectrum is not shown.\nNONDIPOLE EFFECTS IN PHOTON EMISSION BY . . . PHYSICAL REVIEW A 66, 063411 ~2002!\n063411-11\nposal by Corkum, Burnett, and Ivanov for producing an iso-\nlated attosecond pulse, in which single returning trajectories\nare selected by a temporal variation of the ellipticity of the\nincident field @37#.\nMany of the issues regarding the consequences of the\nbreakdown of the dipole approximation discussed here apply\nequally well to strong-field recollision processes leading to\nsingle and multiple ionization. For instance, the reduced\nrecollision probability in the nondipole nonrelativistic re-\ngime means, as has recently been observed experimentally in\nnonsequential multiple ionization @38#, that these processes\nare strongly suppressed at very high intensity. This could\nwell impose a practical barrier to the experimental study of\nstrong-field recollision processes at intensities where relativ-\nistic effects become important. The selective compensation\nof the effect of the magnetic drift by a second laser pulse, as\ndiscussed above, may offer a way to alleviate this difficulty.\nACKNOWLEDGMENTS\nThe authors thank D. B. Milosˇevic´ for discussions con-\ncerning the nondipole results shown in Fig. 3 and for com-\nmunicating the relativistic results shown in Fig. 4. This work\nwas supported by the UK EPSRC.\nAPPENDIX: NONDIPOLE NONRELATIVISTIC VOLKOV\nWAVE FUNCTION\nThe required nondipole nonrelativistic Volkov Green’s\nfunction can be expressed as\nGV\n(1)~r,t;r8,t8!52iu~ t2t8!E dpCpL~r,t !@CpL~r8,t8!#*,\n~A1!\nwhere the function Cp\nL(r,t) is a solution of the time-\ndependent Schro¨dinger equation ~TDSE! ~4! with V(r)50.\nCalling Cp(r,t) the solution of the TDSE ~3! with V(r)\n50, introducing the wave function Cp8(r,t) as\nCp~r,t !5expS ic F2i\u0093\u0095A~vt !1 12 A2~vt !G~kˆ\u0095r! DCp8~r,t !,\n~A2!\nand recalling that \u0093\u0095A(vt) commutes with kˆ\u0095r, it is seen\nthat\ni\n]\n]t\nCp8~r,t !5\n1\n2 S 2i\u00931A~vt !1 1c F2i\u0093\u0095A~vt !\n1\n1\n2 A\n2~vt !Gkˆ D 2Cp8~r,t !. ~A3!\nThe Hamiltonian operator in Eq. ~A3! commutes with the\nmomentum operator, so that the TDSE is easily solved.\nTransforming back to the length gauge, the nondipole Volkov\nwave function reads\nCp\nL~r,t !5\n1\n~2p!3\/2\nexpS ip~p,t !\u0095r2 i2E tdt9@p~p,t9!#2D ,\n~A4!\nwhere p(p,t) is defined in Eq. ~8!. The nondipole Volkov\nwave function ~A4! is also readily obtained by expanding the\nrelativistic Volkov wave function in powers of 1\/c and ne-\nglecting terms of orders 1\/c2 and higher. It reduces to the\nfamiliar nonrelativistic, dipole Volkov wave function when\n1\/c→0.\n@1# P. Salie`res, A. L’Huillier, P. Antoine, and M. Lewenstein, Adv.\nAt., Mol., Opt. Phys. 41, 83 ~1999!.\n@2# T. Brabec and F. Krausz, Rev. Mod. Phys. 72, 545 ~2000!.\n@3# P.M. Paul, E.S. Toma, P. Breger, G. Mullot, F. Auge´, P. Balcou,\nH.G. Muller, and P. Agostini, Science 292, 1689 ~2001!.\n@4# M. Hentschel, R. Kienberger, C. Spielmann, G.A. Reider, N.\nMilosevic, T. Brabec, P. Corkum, U. Heinzmann, M. Drescher,\nand F. Krausz, Nature ~London! 414, 509 ~2001!.\n@5# P. Salie`res et al., Science 292, 902 ~2001!.\n@6# R.A. Bartels, A. Paul, H. Green, H.C. Kapteyn, M.M. Mur-\nnane, S. Backus, I.P. Christov, Y. Liu, D. Attwood, and C.\nJacobsen, Science 297, 376 ~2002!.\n@7# J.L. Krause, K.J. Schafer, and K.C. Kulander, Phys. Rev. Lett.\n68, 3535 ~1992!.\n@8# K.C. Kulander, K.J. Schafer, and J.L. Krause, in Super-Intense\nLaser-Atom Physics, edited by B. Piraux, A. L’Huillier, and K.\nRzazewski ~Plenum Press, New York, 1993!, p. 95.\n@9# P.B. Corkum, Phys. Rev. Lett. 71, 1994 ~1993!.\n@10# M. Lewenstein, P. Balcou, M.Y. Ivanov, A. L’Huillier, and P.\nCorkum, Phys. Rev. A 49, 2117 ~1994!.\n@11# W. Becker, S. Long, and J.K. McIver, Phys. Rev. A 50, 1540\n~1994!.\n@12# M.Y. Kuchiev, JETP Lett. 45, 404 ~1987!.\n@13# N. Milosˇevic´, A. Scrinzi, and T. Brabec, Phys. Rev. Lett. 88,\n093905 ~2002!.\n@14# J.R. Vazquez de Aldana and L. Roso, Opt. Express 5, 144\n~1999!.\n@15# A.V. Kim, M.Y. Ryabikin, and A.M. Sergeev, Usp. Fiz. Nauk\n169, 58 ~1999!.\n@16# N.J. Kylstra, R.A. Worthington, A. Patel, P.L. Knight, J.R.\nVa´zquez de Aldana, and L. Roso, Phys. Rev. Lett. 85, 1835\n~2000!.\n@17# M.Y. Ryabikin and A.M. Sergeev, Opt. Express 7, 417 ~2000!.\n@18# J.R. Vazquez de Aldana, N.J. Kylstra, L. Roso, P.L. Knight,\nA.S. Patel, and R.A. Worthington, Phys. Rev. A 64, 013411\n~2001!.\n@19# V.D. Taranukhin, Laser Phys. 10, 330 ~2000!.\n@20# D.B. Milosˇevic´, S.X. Hu, and W. Becker, Phys. Rev. A 63,\n011403~R! ~2001!.\n@21# M.W. Walser, C.H. Keitel, A. Scrinzi, and T. Brabec, Phys.\nRev. Lett. 85, 5082 ~2000!.\n@22# N.J. Kylstra, R.M. Potvliege, and C.J. Joachain, J. Phys. B 34,\nL55 ~2001!.\nCHIRILA˘ et al. PHYSICAL REVIEW A 66, 063411 ~2002!\n063411-12\n@23# V.D. Taranukhin and N.Y. Shubin, Quantum Electron. 31, 179\n~2001!.\n@24# D.B. Milosˇevic´, S.X. Hu, and W. Becker, Laser Phys. 12, 389\n~2002!.\n@25# A.M. Perelomov, V.S. Popov, and M.V. Terent’ev, Sov. Phys.\nJETP 24, 207 ~1967!.\n@26# N.B. Delone and V.P. Krainov, J. Opt. Soc. Am. B 8, 1207\n~1991!.\n@27# N.J. Kylstra, R.M. Potvliege, and C.J. Joachain, Laser Phys.\n12, 409 ~2002!.\n@28# D.B. Milosˇevic´, in Super-Intense Laser-Atom Physics, edited\nby B. Piraux and K. Rza¸z˙ewski ~Kluwer Academic, Dordrecht,\n2001!, p. 229.\n@29# V.A. Borovikov, Uniform Stationary Phase Method ~The Insti-\ntution of Electrical Engineers, London, 1994!.\n@30# M.Y. Ivanov, T. Brabec, and N. Burnett, Phys. Rev. A 54, 742\n~1996!.\n@31# In the notation of Ref. @21#, Px(t ,t0) and Pz(t ,t0) are identical,\nrespectively, to eˆ\u0095ps and kˆ\u0095ps , where ps is defined by\nEq. ~25! and Pzd[2pk(ps ,td). We take that the\nequation defining Sm(t ,t0) in Ref. @21# should read\nSm(t ,t0) 5 (1 \/2m) * t0\nt dt8$Pz(t ,t0) 2 e \/ (mc2)@Px(t ,t0 )A (t8 )\n2e\/(2c)A2(t8)#%2.\n@32# The nondipole nonrelativistic spectrum for Li21 shown in Fig.\n3 is in excellent agreement with the results of a recent, unpub-\nlished relativistic calculation @D.B. Milosˇevic´ ~private commu-\nnication!#.\n@33# The exponential factor appearing in Eq. ~43! was derived by\nDelone and Krainov @26#. It is multiplied by a preexponential\nfactor which ensures that the integral of w(t ,td) over v’ in the\nplane normal to E(vtd) is identical to the total rate of ioniza-\ntion of an hydrogenic ion of binding energy Ip in a static\nelectric field E(vtd), as given by the familiar tunneling for-\nmula @L.D. Landau and E.M. Lifshitz, Quantum Mechanics:\nNon-Relativistic Theory ~Pergamon, Oxford, 1977!#.\n@34# R.M. Potvliege, N.J. Kylstra, and C.J. Joachain, J. Phys. B 33,\nL743 ~2000!.\n@35# The rates of Ref. @20# are proportional to the square of the\nmodulus of the Fourier transform of d(t) multiplied by the\ncube of the frequency of the emitted photon, V @D.B.\nMilosˇevic´ ~private communication!#. In order to compare them\nwith the values of uae(V)u2 we have obtained, the rates have\nbeen multiplied by V and an arbitrary numerical factor. ~The\nsame factor is used for both intensities.!\n@36# K.J. Schafer and K.C. Kulander, Phys. Rev. Lett. 78, 638\n~1997!.\n@37# P.B. Corkum, N.H. Burnett, and M.Y. Ivanov, Opt. Lett. 19,\n1870 ~1994!.\n@38# M. Dammasch, M. Do¨rr, U. Eichmann, E. Lenz, and W. Sand-\nner, Phys. Rev. A 64, 061402~R! ~2001!.\nNONDIPOLE EFFECTS IN PHOTON EMISSION BY . . . PHYSICAL REVIEW A 66, 063411 ~2002!\n063411-13\n"}