{"doi":"10.1016\/S0362-546X(96)00343-4","coreId":"96867","oai":"oai:generic.eprints.org:443\/core69","identifiers":["oai:generic.eprints.org:443\/core69","10.1016\/S0362-546X(96)00343-4"],"title":"A mechanochemical model for normal and abnormal dermal wound repair","authors":["Olsen, L.","Maini, P. K.","Sherratt, J. A."],"enrichments":{"references":[{"id":785034,"title":"A mathematical model for fibroproliferative wound healing disorders,","authors":[],"date":"1996","doi":"10.1007\/bf02459482","raw":null,"cites":null},{"id":784781,"title":"A mechanochemical model for adult dermal wound contraction and the permanence of the contracted tissue displacement profile,","authors":[],"date":"1995","doi":"10.1006\/jtbi.1995.0230","raw":null,"cites":null},{"id":784617,"title":"Overview and general considerations of wound repair, in The Molecular and Cellular Biology of Wound Repair (Edited by","authors":[],"date":"1988","doi":"10.2307\/1311049","raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1997","abstract":"n\/","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96867.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/443\/1\/89.pdf","pdfHashValue":"d05de6c05c82e27192a2a15f68493cfec667bd2d","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:443<\/identifier><datestamp>\n      2015-05-29T18:22:19Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4143:4D3932<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/443\/<\/dc:relation><dc:title>\n        A mechanochemical model for normal and abnormal dermal wound repair<\/dc:title><dc:creator>\n        Olsen, L.<\/dc:creator><dc:creator>\n        Maini, P. K.<\/dc:creator><dc:creator>\n        Sherratt, J. A.<\/dc:creator><dc:subject>\n        Biology and other natural sciences<\/dc:subject><dc:description>\n        n\/a<\/dc:description><dc:date>\n        1997<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/443\/1\/89.pdf<\/dc:identifier><dc:identifier>\n          Olsen, L. and Maini, P. K. and Sherratt, J. A.  (1997) A mechanochemical model for normal and abnormal dermal wound repair.  Nonlinear Analysis Theory, Methods & Applications, 30  (6).   pp. 3333-3338.      <\/dc:identifier><dc:relation>\n        10.1016\/S0362-546X(96)00343-4<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/443\/","10.1016\/S0362-546X(96)00343-4"],"year":1997,"topics":["Biology and other natural sciences"],"subject":["Article","PeerReviewed"],"fullText":"Nonlinear Analysis, Theory, Methods & Applicarions, Vol. 30, No. 6, pp. 3333-3338, 1997 \nProc. 2nd World Congress of Nonlinear Analysrs \nQ 1997 Elsevier Science Ltd \nPII: SO362-546X(96)00343-4 \nPrinted in Great Britain. All rights reserved \n0362-546X\/97 $17.00 + 0.00 \nA MECHANOCHEMICAL MODEL FOR NORMAL AND ABNORMAL DERMAL \nWOUND REPAIR \nLUKE OLSEN, t PHILIP MAINIt and JONATHAN SHERRATTI \ntCentre for Mathematical Biology, Mathematical Institute, 24-29 St Giles’, Oxford, OX1 3LB, UK; and \n$Nonlinear Systems Laboratory, Mathematics Institute, University of Warwick, Coventry, CV4 7AL, UK \nKey words and phrases: Wound contraction, fibroproliferative disorders, growth factors \n1. INTRODUCTION \nThe healing of full-thickness excisional skin wounds in adult mammals involves a complex sequence \nof inter-regulatory biological processes (see [l] f  or review). A key process involves the movement of \ncells into the wound in response to mechanical and chemical cues. These cells exert traction forces \nwhich pull the wound together, leading to normal wound healing, in which the skin is in a contracted \nstate. Abnormal regulation of this process may result in a number of healing disorders. One such \ndisorder results in increased tissue in the wound leading to fibroproliferative diseases such as keloid \nscarring. In this paper we consider the general mathematical model framework for dermal wound \nhealing proposed in [a]. We briefly describe the model in Section 2 and review its properties. In \nSection 3 we show, by looking at a simpler version of the model, that it can generate contracted \nsteady states. In Section 4, we investigate another version of the model to focus on fibroproliferative \ndiseases. \n2. MECHANOCHEMICAL MODEL FRAMEWORK \nHere, we briefly present a mechanochemical model for dermal wound healing based on the frame- \nwork developed by Murray and coworkers (see [3] f  or review). For full details and experimental \njustification for each term, see [2]. The full model consists of five field variables and, for simplicity, \nwe present here only the one-dimensional version of the model. The model considers two distinct \ncell types - fibroblasts and myofibroblasts, denoted by n(z,t) and m(z, t), respectively, where zr is \nspace and t is time. It is assumed that fibroblasts secrete a growth factor, c(z, t), and move into the \nwound in response to gradients in c. The fibroblast equation takes the form: \ng = Dn$ - T&,n); + n$] + R(c)n(l - ;, - = \nck + c \n+ t&m - d,n. (2.1) \nThe first three terms on the right hand side model the following contributions to cell flux: cell \ndiffusion with constant diffusion coefficient, D,, cell chemotaxis with chemotactic sensitivity x(c, n), \nand convection in response to the displacement, ~(2, t), of the extracellular matrix (ECM) substratum \non which cells move. The next four terms describe, respectively, logistic cell growth with linear \nrate enhanced by growth factor, conversion to myofibroblast phenotype mediated by growth factor, \nconversion from myofibroblast to fibroblast cell type, and cell death. \nThe myofibroblasts satisfy the equation \ndm \nat = ax \nAI-m:] + c,R(c)m(l - E) + 5 - &n - d,m, \nk c \n(2.2) \nwhere it is assumed that the dominant contribution to myofibroblast flux is convection, and that \nmitosis takes the same form as that for fibroblasts to within a scale factor cr. \nThe growth factor, c, diffuses, is convected by the ECM, and is secreted and degraded by both \ncell types. Therefore, it satisfies the equation \n3333 \n3334 Second World Congress of Nonlinear Analysts \ng = Dcg + &-~$1 + S(n, m, c) - d,c. \nThe ECM: density p(z, t), moves primarily by convection and satisfies the equation \n(2.4) \nwhere B(n, m, c, p) represents ECM biosynthesis and degradation. \nFinally, modelling the ECM as a linear, isotropic, viscoelastic material, the displacement 21 satisfies \nthe force balance equation \np&+EZ+ wh m, P) ax = Fb, u), (2.5) \nwhere the first two terms on the left hand side model viscous and elastic forces, respectively, and the \nthird term models cell traction forces. These forces are balanced by the body forces F(p, u). \nEquations (2.1)-(2.5), with appropriate initial and boundary conditions (see below), consti- \ntute the mechanochemical model framework. Using biologically realistic forms for the functions \nx(c,n),R(c),S(n,m,c),B(n,m.c,p),7(n,p),F(p,v), and estimates derived from experimental data \nfor the parameters D,, DC, K,kl,k2,Ck,d,,d,,d,,~~,~ and E, it can be shown that this model ex- \nhibits solutions for the decay of growth factor and rate of wound closure that closely agree with \nexperimental results (see [2] for full details). Using a caricature model, we now proceed to analyse \nthe possible contracted steady states exhibited by the model. \n3. SPATIALLY VARYING CONTRACTED STEADY STATES \nTo consider the potential of the model framework (2.1))(2.5) to exhibit spatially varying con- \ntracted steady states we consider a simpler version of the model of the form \n2 = Dn$ + &n$] + n(l - n) (3.1) \n(3.2) \np&+*2+ ah P) ~ = F(p,u). ax \nHere, we have chosen to consider the purely mechanical aspects of the dynamics and have sim- \nplified the model by considering only one cell type, have non-dimensionalised the model so that the \nlogistic growth term takes an algebraically simpler form, and assumed that there is negligible syn- \nthesis and degradation of ECM on the timescale of wound closure. This is a reasonable assumption \nto make in the stages prior to tissue remodelling. \nBy defining the initial wound space as -1 5 z 5 1 and using symmetry at x = 0 (the wound \ncentre), we may restrict attention to the semi-infinite domain 0 5 z < 03. The initial half-wound is \nset to unity by the scaling for z. The boundary conditions are thus \ng(O, t) = $(O, t) = ~(0, t) = 0 and n(co, t) = p(co, t) = 1, u(oo, t) = 0. \nSecond World Congress of Nonlinear Analysts 3335 \nThe initial conditions are \nn(x, 0) = H(x - l), p(z,O) = pi + (1 - pi) H(x - l), U(Z,O) = 0, \nwhere the initial ECM density pi inside the wound is due to the early, provisional wound matrix \nwhich is low in collagen and satisfies 0 < pi < 1, and H(.) is the Heaviside step function. \nConsider now the healed steady state, n = 1. Linearising (3.2) about the init,ial profile, we have \n{ \nPi (1 - au\/ax) ) 0 5 x < 1 \nP= \nI -au\/ax, a>1 \nas suggested by the small-strain restriction (since the convective flux should be small). Substituting \nthis into the steady state equation for u, we have a second order ordinary differential equation for u, \nwhich we can write in the (resealed) form \n21’ = v (2) \n1 \nS&U(l - w) \n1 - pi7[p,(l - v)J’ \nO<x<l \nv’ = \nsu(1 - U) \n1 - 7(1 - V) ’ \nx>l \n(3) \nwhere 7(p) G vlnzl, and u satisfies the boundary conditions u(O) = U(CCI) = 0. He we have \nassumed that the body force, F(p,u), is due to external tethering to the basement membrane and \nhave modelled it by a linear spring, that is, F(p,u) = sup, where s is a constant. \nStandard phase plane analysis of (3.4)-(3.5) s h ows that for x > 1, the origin is a saddle (centre) \ni f f  7(l) < 1 (> 1). However, linear stability analysis of the partial differential equation system (3.1)- \n(3.3) shows that the healed steady state is stable i f f  7(l) < 1. As this must be the case, we have \nthat the origin of the ordinary differential equation system (3.4)-(3.5) is a saddle, and the boundary \ncondition I = 0 implies that the solution must converge towards the origin along the stable \nmanifold as x tends to co. By tracing backwards in x from infinity along the stable manifold, the \nsolution reaches a point in the (u, u\/)-phase plane corresponding to x = 1 where u = ~1, say. This \nmust match the solution for 0 5 x < 1. \nNow, at the wound centre, u(O) = 0, but w(0) . IS unspecified. Rather, it is determined by matching \nto the “outer” solution at x = 1. For 0 5 1 < 1, it can be shown that the origin can either be a \nsaddle or a centre, depending on the form of the function ~(n, p) and the values of the parameters. \nIf  the origin is a saddle point, then the solution in 0 5 x < 1 is expected to be either monotonic \nincreasing with increasing gradient or monotonic decreasing with decreasing gradient. I f  the origin \nis a centre, then the solution in 0 < z < 1 may be oscillatory. Figure 1 illustrates the qualitative \nconstruction of such a solution and Figure 2 illustrates various theoretically-possible forms of steady \nstate solutions. Modelling the traction term, 7(n,p), by ~(n,p) = ~np\/(T~ + p’), to account for \nthe fact that traction forces depend on adhesion between cell surface receptors and binding sites on \ncollagen fibres, but the ability of a cell to extend and retract protrusions within a collagen substrate \nis inhibited at relatively high collagen densities, where TO and T are constant parameters, we have \nfound, by numerical simulation, steady states for (3.1)-(3.3) of the form illustrated in Figure 2(a)-(e). \n3336 Second World Congress of Nonlinear Analysts \nFig. 1. Qualitative illustration of a possible solution trajectory as described in the text, showing a \ncase in which the origin is a centre for 0 5 z < 1 and a saddle point for x > 1 with U(Z) + 0 from \nbelow as 2 -+ 00. See also Figure 2(b) below. Dashed curves denote phase trajectories, with the \ncontracted solution curve highlighted by solid arrows. \n(4 \nFig. 2. Possible qualitative forms of the solution u(z) of the boundary value problem (3.4)-(3.5), \nrepresenting contracted tissue displacement profiles. The point (u, u’) = (0,O) must be a saddle point \nfor z > 1 in the (u, u\/)-phase plane, with u increasing to zero and U’ decreasing to zero monotonically \nalong the stable manifold in the top-left quadrant as z -S co. For 0 5 CC < 1, the origin may be either \na saddle point, in which case the profiles for u and u’ are monotonic decreasing as shown in (a), or \na centre, in which case u and 2~’ oscillate about the origin as shown in (b-f); within this region, any \nnumber of oscillations is possible-for example, (f) is equivalent to (b) modulo one period. Note that \nthe above steady-state profiles but with reversed signs of u and U’ are also admissible solutions of \n(3.4)-(3.5), representing expanded tissue displacement profiles since ~(1) would be positive. Recall \nthat x = 1 is the initial wound boundary. \nSecond World Congress of Nonlinear Analysts \n4. FIBROPROLIFERATIVE WOUND HEALING DISORDERS \n3337 \nWe now consider the application of the mechanochemical model framework to fibroproliferative \nwound healing disorders. Such disorders are characterised by abnormally large amounts of tissue. The \nfull model can exhibit solutions in which an excess of cells is observed, corresponding to a pathological \nstate. To understand this more fully, we focus purely on the chemical aspects of (2.1)-(2.5). Consider \nnow the cell-growth factor sub-model of (2.1)-(2.5), namely, \n(4.1) \nwhere x(c, n) = a\/(\/3 + c)~, and cr,p, I’, &, IE, and y  are positive constants (see [4] for full details). \nThis caricature model has two uniform steady states, (n, c) = (0, 0), (K, 0) corresponding, respec- \ntively, to the trivial, or non-healing, state, and the normal dermal state. For appropriate parameter \nvalues, two other steady states exist which have both n and c non-zero, with n > K. These are the \npathological, or diseased, steady states. A bifurcation analysis can be carried out for (4.1)-(4.2), in \nthe absence of diffusion, and it can be shown that for ~~ = K: (calculated in terms of the other pa- \nrameters) the dermal steady state remains locally stable but loses global stability as the pathological \nsteady states appear. At ~~ = & the dermal steady state loses stability and the pathological state \nwith higher cell density level becomes globally stable. \nThe spatiotemporal dynamics of the model can be analysed by travelling wave analysis, which \nshows that travelling wave trajectories from the dermal state to the pathological state are possible \nand a minimum wavespeed can be determined. Numerical simulations of the system show that such \ntravelling waves do exist, but that reducing K~ can cause the waves to stop and to regress (see Figure \n3). \n5. DISCUSSION \nThe mechanochemical framework presented in Section 2 has been proposed to model dermal \nwound healing. Numerical simulations of the full model have shown that it can capture key aspects \nof normal and abnormal wound healing. The complexity of the model makes it difficult to fully un- \nderstand what roles the various mechanisms play during these processes. To investigate the model in \nmore detail, we have chosen to analyse caricature models which focus on certain model mechanisms. \nIn Section 3, we considered a purely mechanical model and showed how it could exhibit contracted \nsteady states, characteristic in normal wound healing. In Section 4, we focussed on the chemical as- \npects of the full model and showed how the system could evolve to a pathological state corresponding \nto a fibroproliferative state. In this case, our analysis shows that reducing K~, the linear rate at which \ncells secrete growth factor, can cause the disease to regress back to the normal dermal state. More \ndetailed analysis of this model ([4]) d e t ermines analytically how the bifurcation values of q depend \non the other parameters in the model. This provides a clinically-testable method to help reduce this \ntype of fibroproliferative disorder. \n3338 \n120 \n100 \n80 \n60 \n40 \n20 \nSecond World Congress of Nonlinear Analysts \ncells, n(x,t) chemical, c(x.t) \nI I \nX X \nn(x.t) c(x,t) \n120 \n100 \n80 \n60 \n40 \n20 \n0 \n0 5 10 0 5 \nFig. 3. Numerical simulations of (4.1)-(4.2) showing progression to pathological steady state (a), \nand cessation and regression for the case where IE, in reduced to zero after a certain time (b). See \n[4] for parameter values. \nAcknowledgement: L. 0. expresses gratitude to the Engineering and Physical Sciences Research \nCouncil of Great Britain for a Research Studentship award to support this work. We also thank the \nLondon Mathematical Society for support. \nREFERENCES \n[l] Clark, R. A. F., Overview and general considerations of wound repair, in The Molecular and \nCellular Biology of Wound Repair (Edited by R. A. F. Clark and P. M. Henson), pp. 3-34. Plenum, \nNew York (1988). \n[2] Olsen, L., Sherratt, J. A. & Maini, P.K., A mechanochemical model for adult dermal wound \ncontraction and the permanence of the contracted tissue displacement profile, J. theor. Eiol. 17’7, \n113-128 (1995). \n[3] Murray, J.D., Mathematical Biology, Springer-Verlag (1989). \n[4] Olsen, L., Sherratt, J. A. & Maini, P.K., A mathematical model for fibroproliferative wound \nhealing disorders, Bull. Math. Biol. 58, 787-808 (1996). \n"}