{"doi":"10.1111\/j.1365-2788.2006.00938.x","coreId":"56190","oai":"oai:eprints.lincoln.ac.uk:1284","identifiers":["oai:eprints.lincoln.ac.uk:1284","10.1111\/j.1365-2788.2006.00938.x"],"title":"Emotional and behavioural problems in offenders with intellectual disability: comparative data from three forensic services","authors":["Hogue, T.","Mooney, P.","Morrissey, C.","Steptoe, L.","Johnston, S.","Lindsay, W. R.","Taylor, J."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2007","abstract":"Background. Despite an increasing knowledge base concerning the assessment of emotional and behavioural problems in people with intellectual disabilities (ID), relatively little research has examined such problems in offenders with ID. Methods The study assessed 172 male offenders with ID in three service settings (high, medium-low security and community) using the Behaviour Rating Scale of the Emotional Problem Scales (EPS), with the aim of assessing differences in Externalizing and Internalizing Behaviour Problems. Results Normative information is presented on the Behaviour Rating Scale of the EPS across three levels of forensic ID care. It was found that offenders in higher secure care scored higher on sub-scales reflecting physical aggression than those in lower secure care. However, there was no difference in terms of other Externalizing Behaviour Problems, such as verbal aggression, non-compliance or hyperactivity. In addition, those offenders in higher secure care scored significantly higher on all Internalizing Behaviour Problems sub-scales, including anxiety, depression and low self-esteem. Conclusions Implications for research and clinical pratice are discussed, including the utility of the EPS as a measure of clinical need and treatment outcom","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:1284<\/identifier><datestamp>\n      2013-03-13T08:26:15Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F43:6A6163735F43383030<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F43:6A6163735F43383930<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F43:6A6163735F43383430<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/1284\/<\/dc:relation><dc:title>\n        Emotional and behavioural problems in offenders with intellectual disability: comparative data from three forensic services<\/dc:title><dc:creator>\n        Hogue, T.<\/dc:creator><dc:creator>\n        Mooney, P.<\/dc:creator><dc:creator>\n        Morrissey, C.<\/dc:creator><dc:creator>\n        Steptoe, L.<\/dc:creator><dc:creator>\n        Johnston, S.<\/dc:creator><dc:creator>\n        Lindsay, W. R.<\/dc:creator><dc:creator>\n        Taylor, J.<\/dc:creator><dc:subject>\n        C800 Psychology<\/dc:subject><dc:subject>\n        C890 Psychology not elsewhere classified<\/dc:subject><dc:subject>\n        C840 Clinical Psychology<\/dc:subject><dc:description>\n        Background. Despite an increasing knowledge base concerning the assessment of emotional and behavioural problems in people with intellectual disabilities (ID), relatively little research has examined such problems in offenders with ID. Methods The study assessed 172 male offenders with ID in three service settings (high, medium-low security and community) using the Behaviour Rating Scale of the Emotional Problem Scales (EPS), with the aim of assessing differences in Externalizing and Internalizing Behaviour Problems. Results Normative information is presented on the Behaviour Rating Scale of the EPS across three levels of forensic ID care. It was found that offenders in higher secure care scored higher on sub-scales reflecting physical aggression than those in lower secure care. However, there was no difference in terms of other Externalizing Behaviour Problems, such as verbal aggression, non-compliance or hyperactivity. In addition, those offenders in higher secure care scored significantly higher on all Internalizing Behaviour Problems sub-scales, including anxiety, depression and low self-esteem. Conclusions Implications for research and clinical pratice are discussed, including the utility of the EPS as a measure of clinical need and treatment outcome<\/dc:description><dc:date>\n        2007<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/1284\/1\/uoa44th03.pdf<\/dc:identifier><dc:identifier>\n          Hogue, T. and Mooney, P. and Morrissey, C. and Steptoe, L. and Johnston, S. and Lindsay, W. R. and Taylor, J.  (2007) Emotional and behavioural problems in offenders with intellectual disability: comparative data from three forensic services.  Journal of Intellectual Disability Research, 51  (10).   pp. 778-785.  ISSN 0964-2633  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1111\/j.1365-2788.2006.00938.x<\/dc:relation><dc:relation>\n        10.1111\/j.1365-2788.2006.00938.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lincoln.ac.uk\/1284\/","http:\/\/dx.doi.org\/10.1111\/j.1365-2788.2006.00938.x","10.1111\/j.1365-2788.2006.00938.x"],"year":2007,"topics":["C800 Psychology","C890 Psychology not elsewhere classified","C840 Clinical Psychology"],"subject":["Article","PeerReviewed"],"fullText":null}