{"doi":"10.1080\/0010751031000095125","coreId":"68325","oai":"oai:eprints.lancs.ac.uk:32856","identifiers":["oai:eprints.lancs.ac.uk:32856","10.1080\/0010751031000095125"],"title":"Synchronization:a universal concept in nonlinear science","authors":["McClintock, Peter V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-03","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68325.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/32856\/1\/synchcpPrePrint.pdf","pdfHashValue":"85a489a0d568cfd173c6a726ad5b3431dc6d617d","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:32856<\/identifier><datestamp>\n      2018-01-06T00:02:45Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Synchronization:a universal concept in nonlinear science<\/dc:title><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:date>\n        2003-03<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/32856\/1\/synchcpPrePrint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1080\/0010751031000095125<\/dc:relation><dc:identifier>\n        McClintock, Peter V. E. (2003) Synchronization:a universal concept in nonlinear science. Contemporary Physics, 44 (2). pp. 185-186. ISSN 0010-7514<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/32856\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1080\/0010751031000095125","http:\/\/eprints.lancs.ac.uk\/32856\/"],"year":2003,"topics":["QC Physics"],"subject":["Journal Article","NonPeerReviewed"],"fullText":"Synchronization\nReview of Synchronization: A universal concept in nonlinear science, by A. Pikovsky,\nM. Rosenblum and M. Kurths, Cambridge University Press, 2001.\nWhile lying sick in bed for a couple of days during 1665, the distinguished Dutch scientist\nChristiaan Huygens was astonished to observe “...a wonderful effect that nobody could\nhave thought of before”. The pendula of two clocks in the room seemed to be swinging\nin exact antiphase: when one pendulum swung to the right, the other swung to the\nleft, and vice versa. Furthermore, their synchronization continued for as long as his\npatience lasted, making it extremely unlikely that the effect could have arisen by chance.\nHe quickly realised that the “eternal agreement” of the clocks was attributable to a weak\ncoupling, through their being mounted on the same beam: the movement of one pendulum\ninfinitesimally moved the beam, and thus the other clock. The interaction of the two\noscillations, although extremely weak, was sufficient to bring about their synchronization.\nOver the ensuing centuries it has become clear that synchronization by no means\nrestricted to swinging pendula, nor even to mechanical systems. Rather, it is a quite\ngeneral phenomenon that can arise in innumerable different situations including, for ex-\nample, electronic circuits, adjacent organ pipes (which can almost silence each other by\nresonating in antiphase), lasers, the light pulses emitted by clouds of fireflies, and flocks\nof flying birds flapping their wings in synchrony.\nHow does one define synchronization? The authors take synchronization to be an ad-\njustment of rhythms of oscillating objects due to their weak interaction. Of course, where\nthe interaction is not weak, the notion of synchronization no longer makes any sense\nbecause there is then only a single unified system. The oscillations of the separate subsys-\ntems must also be self-sustained. Thus the population oscillations in the famous hare-lynx\nsystem do not represent synchronization because neither population would separately os-\ncillate. In true synchronization, the adjustment of rhythms occurs for a restricted range\nof frequency mismatch within which, if the frequency of one oscillator is slowly varied,\nthe second oscillator will be constrained to follow.\nSynchronization phenomena are important in a myriad of different ways. One topical\nexample is the Millennium Bridge in London, where the steps taken by pedestrians were ef-\nfectively synchronized by the “global coupling” provided by the weak oscillatory response\nof the bridge to their feet – leading to large and potentially dangerous excursions. (The\nbridge had to remain closed for several months while damping systems were incorporated.)\n1\nPublished in Contemp. Phys. 44, 185-186 (20030.\nAnother example is the mammalian cardio-respiratory system, where episodes of synchro-\nnization occur between breathing and heart beat. The lengths of these episodes seem to\nbe associated with the state of the system, being longer in athletes than sedentary indi-\nviduals and completely absent in a patient in coma. Recent evidence has emerged linking\nthe synchronization number (i.e. the number of heartbeats per breath) during anæsthesia\nto the depth of anæsthesia – which could obviously have useful applications.\nThe authors have attempted to provide a definitive account of synchronization that is\naccessible on many levels. They address the wide audience of scientists that are likely to\nthe interested, taking explicit account of their differing levels of mathematical preparation.\nThe book is in three parts. Following the Introduction, there are five chapters treating the\nsubject with a minimum of mathematics. They concentrate on the basic physical concepts,\nsupported by diagrams, graphs, and only the most basic of equations. This part should\nbe comprehensible to anybody willing to read the text carefully, study the diagrams,\nand think. The six chapters forming the second part treat classical syncronization in\nall its aspects, including large populations of globally coupled oscillators such as the\nlight-emitting fireflies mentioned above. Part III consists of three chapters that treat the\nforms of synchronization that are now known to arise in systems exhibiting deterministic\nchaos. The appendices include translations from French and Latin of some of Huygens’\nhistoric writings, which are apposite and extremely interesting, as well as some more\nformal mathematical material.\nHave the authors succeeded in their aims? They certainly have, in my opinion. Their\nbook has all the hallmarks of a classic. It is currently unique, the first attempt to cover\nsynchronization phenomena in a comprehensive and unified way in English. By drawing\ntogether many different threads from diverse areas of science, and weaving them into a\ncoherent whole, they come close to identifying a new scientific subject – or, at least, to\nconferring respectability on a subject that was already starting to emerge. They have\npresented it in a comprehensible and interesting way, but with full mathematical detail\nfor those who need it, and provided an extensive bibliography. Every scientist working in\nthe area will want a copy of this book, and every science librarian should buy one. No\ndoubt it will run through many editions, and deservedly.\nP.V.E. McClintock\n(Lancaster University)\n2\n"}