{"doi":"10.1002\/arp.241","coreId":"135784","oai":"oai:bradscholars.brad.ac.uk:10454\/3766","identifiers":["oai:bradscholars.brad.ac.uk:10454\/3766","10.1002\/arp.241"],"title":"Geophysical  surveys at King Lobengula's Palace KoBulawayo, Zimbabwe.","authors":["Gaffney, Christopher F.","Hughes, G.","Gater, J.A."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2004","abstract":"NoThis report covers the application of magnetic survey, primarily using a magnetic susceptibility field instrument, at the historically attested site of KoBulawayo, Zimbabwe. The approximate position of the site was known before the geophysical survey took place; it was believed to comprise a Royal Enclosure, a surrounding open space possibly used as a military parade ground and the Commoner\/Peripheral Settlement of Lobengula, King of the Ndebele. Occupation at the site was short lived and after only 11 years the capital of the Ndebele state was destroyed by fire in 1881. A pilot survey was undertaken in 1994 to assess the suitability of survey techniques. Consequently, a second, more extensive survey was carried out in late 1996 and early 1997 with the intention of delimiting the Royal Enclosure. Further periods of data collection took place later in 1997 and in 1998. This report describes the methods used and the interpretation of the geophysical results in the context of the understanding and management of this important historical site. Additionally, some of the results of the geophysical work have been tested by excavation and a discussion of the correlation between these data sets is also reported in this article","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/3766<\/identifier><datestamp>\n                2016-08-18T17:11:29Z<\/datestamp><setSpec>\n                com_10454_152<\/setSpec><setSpec>\n                col_10454_6342<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nGeophysical  surveys at King Lobengula's Palace KoBulawayo, Zimbabwe.<\/dc:title><dc:creator>\nGaffney, Christopher F.<\/dc:creator><dc:creator>\nHughes, G.<\/dc:creator><dc:creator>\nGater, J.A.<\/dc:creator><dc:subject>\nMagnetic susceptibility<\/dc:subject><dc:subject>\nZimbabwe<\/dc:subject><dc:subject>\nKoBulawayo<\/dc:subject><dc:subject>\nNdebele<\/dc:subject><dc:subject>\nKing Lobengula<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nThis report covers the application of magnetic survey, primarily using a magnetic susceptibility field instrument, at the historically attested site of KoBulawayo, Zimbabwe. The approximate position of the site was known before the geophysical survey took place; it was believed to comprise a Royal Enclosure, a surrounding open space possibly used as a military parade ground and the Commoner\/Peripheral Settlement of Lobengula, King of the Ndebele. Occupation at the site was short lived and after only 11 years the capital of the Ndebele state was destroyed by fire in 1881. A pilot survey was undertaken in 1994 to assess the suitability of survey techniques. Consequently, a second, more extensive survey was carried out in late 1996 and early 1997 with the intention of delimiting the Royal Enclosure. Further periods of data collection took place later in 1997 and in 1998. This report describes the methods used and the interpretation of the geophysical results in the context of the understanding and management of this important historical site. Additionally, some of the results of the geophysical work have been tested by excavation and a discussion of the correlation between these data sets is also reported in this article.<\/dc:description><dc:date>\n2009-10-27T13:16:20Z<\/dc:date><dc:date>\n2009-10-27T13:16:20Z<\/dc:date><dc:date>\n2004<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nNo full-text available in the repository<\/dc:type><dc:identifier>\nGaffney, C.F., Hughes, G and Gater, J.A. (2004). Geophysical  surveys at King Lobengula's Palace KoBulawayo, Zimbabwe.   Archaeological Prospection. Vol. 12, No. 1, pp. 31-49.<\/dc:identifier><dc:identifier>\n90008083<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/3766<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1002\/arp.241<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1002\/arp.241"],"year":2004,"topics":["Magnetic susceptibility","Zimbabwe","KoBulawayo","Ndebele","King Lobengula"],"subject":["Article","No full-text available in the repository"],"fullText":null}