{"doi":"10.1116\/1.590601","coreId":"102981","oai":"oai:epubs.surrey.ac.uk:2635","identifiers":["oai:epubs.surrey.ac.uk:2635","10.1116\/1.590601"],"title":"Electron field emission from amorphous silicon","authors":["Silva, SRP","Forrest, RD","Shannon, JM","Sealy, BJ"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1999-03-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2635<\/identifier><datestamp>\n      2017-10-31T14:06:04Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2635\/<\/dc:relation><dc:title>\n        Electron field emission from amorphous silicon<\/dc:title><dc:creator>\n        Silva, SRP<\/dc:creator><dc:creator>\n        Forrest, RD<\/dc:creator><dc:creator>\n        Shannon, JM<\/dc:creator><dc:creator>\n        Sealy, BJ<\/dc:creator><dc:date>\n        1999-03-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2635\/1\/electron_field_emission_amorphous_silicon_SILVA_99.pdf<\/dc:identifier><dc:identifier>\n          Silva, SRP, Forrest, RD, Shannon, JM and Sealy, BJ  (1999) Electron field emission from amorphous silicon   JOURNAL OF VACUUM SCIENCE & TECHNOLOGY B, 17 (2).  pp. 596-600.      <\/dc:identifier><dc:relation>\n        http:\/\/avspublications.org\/jvstb\/resource\/1\/jvtbd9\/v17\/i2\/p596_s1<\/dc:relation><dc:relation>\n        10.1116\/1.590601<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2635\/","http:\/\/avspublications.org\/jvstb\/resource\/1\/jvtbd9\/v17\/i2\/p596_s1","10.1116\/1.590601"],"year":1999,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Electron field emission from amorphous silicon\nS. R. P. Silva,a) R. D. Forrest, J. M. Shannon, and B. J. Sealy\nSchool of Electronic Engineering, Information Technology and Mathematics, University of Surrey,\nGuildford, Surrey GU2 5XH, United Kingdom\n~Received 19 July 1998; accepted 7 December 1998!\nHydrogenated amorphous silicon ~a-Si:H! is used commercially for large area device fabrication in\nactive matrix flat panel displays as the switching element in thin film transistors. We have found that\na-Si:H thin films can be conditioned to field emit electrons at relatively low electric fields. Once\nconditioned, emission from nonoptimized films at macroscopic vacuum fields below 20 V\/mm is\nroutinely obtained. The threshold fields for electron emission appears to be dependent on the film\nthickness and fields below 10 V\/mm have also been recorded. The Schottky junction between the\na-Si:H and Cr is important to the electron emission process at low fields and plays a major role in\nhelping to fully deplete the a-Si:H film such that electrons that enter the conduction band of the film\nby thermionic emission over the barrier ~or tunneling through the barrier! can become ‘‘hot.’’ If the\nemission is localized, it still appears to be controlled by space charge and the back contact barrier.\nWe have examined the electron emission from multilayer structures that contain Schottky and ohmic\nback contacts as well as thin n1surface layers. Although the electron emission can be fitted to a\nFowler–Nordheim type curve, the values obtained for the barrier and emission area for the\nnominally flat thin films are unrealistic. We explain the observed emission using a space charge\ninduced hot electron model, where the a-Si:H acts as an interlayer in which the electrons are heated.\n© 1999 American Vacuum Society. @S0734-211X~99!00702-7#I. INTRODUCTION\nThe properties of hydrogenated amorphous silicon ~a-\nSi:H! thin films have been studied for a number of years, and\ncurrently it is the only widely used large area amorphous\nsemiconductor for electronic applications.1 Despite its low\nelectron mobility, it is used both for passive and active de-\nvices, especially in the flat panel displays area. Last year we\nreported the experimental observation of electron field emis-\nsion from flat a-Si:H films at relatively low electric fields.2\nThis was surprising due to the fact that the measured electron\naffinity of these films is of the order of 4 eV, and, therefore\nit would be difficult to envisage that electron emission can\ntake place from these nominally flat films at low fields purely\ndue to a Fowler–Nordheim like tunneling mechanism. The\nFowler–Nordheim model states that electrons can leave the\nsurface of a metal into vacuum due to the tunneling of elec-\ntrons from the Fermi level of the metal into the vacuum by\nthe application of a high electric field. These fields must be\nof the order of thousands of volts per micron for emission to\ntake place from flat films that have a typical electron affinity\nof 4 eV. Therefore, in order to obtain emission from metal\nsurfaces, tips with high curvatures or high beta factors need\nto be fabricated using microlithographic techniques.3 Thus,\nthe holy grail for cathode manufacturers has been the pro-\nduction of a large area stable flat cathode that emits electrons\nat relatively low electric fields. If the emission is governed\nby the Fowler–Nordheim tunneling, this could only occur if\nthe films have a low electron affinity or sharp features ~high\nbeta! that would increase the localized electric field experi-\nenced by the electrons due to geometric considerations.\na!Electronic mail: S.Silva@ee.surrey.ac.uk596 J. Vac. Sci. Technol. B 17\u00842\u0085, Mar\/Apr 1999 0734-211X\/99Amorphous carbon ~a-C! and polycrystalline diamond\nthin films have been shown to emit electrons from nominally\nflat films at low electric fields.4–7 Based on these results\nmajor industrial effort has been expended on researching\nthese flat cathodes and it has been announced that they will\nprobably be used for the next generation of electron emitters\nin field emission flat panel displays that are currently based\non Spindt tip emitters.8 The emission obtained from the\na-Si:H thin films reported in this article are comparable to\nthose obtained from the diamond-like carbon ~DLC! thin\nfilms. Since a-Si technology is at a significantly more ad-\nvanced state than DLC, it is envisaged that these films hold\nconsiderable promise as a practical cathode material for flat\npanel displays. The use of a-Si:H as a cathode is further\nsupported by the ability of a-Si:H to form active components\nsuch as thin film transistors, which will help in the fabrica-\ntion of three terminal devices, which would be necessitated if\nthe current in the cold cathode were to be space charge\nlimited.4\nII. EXPERIMENT\nThe a-Si:H thin films were grown using SiH4 and H2 as\nfeed gases in a standard plasma enhanced chemical vapor\ndeposition system at a temperature of 250 °C and a growth\nrate of ;25 Å\/min. The films were undoped, and deposited\non glass substrates coated with Cr ~50 nm!. The Cr films\nwere continuous with no evidence of island growth. The\na-Si:H films were of the quality used to produce switching\nelements for thin film transistors\/diodes in matrix-addressed\nflat panel displays. The hydrogen content in the deposited\na-Si:H films was around 10 at. %. The films have an optical\nTauc gap of 1.74 eV. The ‘‘gap’’ state defect density is ex-596\/17\u00842\u0085\/596\/5\/$15.00 ©1999 American Vacuum Society\n597 Silva et al. : Electron field emission from amorphous silicon 597FIG. 1. Typical electron field emission characteristic showing the need for an initiation field to be applied before reproducible I – E characteristics are obtained.\nThe data in set 2 was obtained after exposing the 100-nm-thick a-Si:H film to air and remeasuring the I – E characteristics.pected to be below 1016 cm23 eV21 in the middle of the\ngap. The films are slightly n type due to a structural ~bond-\ning! defect present in the a-SiH films.\nFor field emission measurements a spherical stainless\nsteel anode, 5 mm in diameter was placed above the cathode\nsurface which was greater than 20 mm 3 20 mm in area, by\nmeans of a micrometer-controlled apparatus. The current (I)\nversus voltage (V) was obtained at a vacuum better than 5\n31026 mbar. The electric field discussed in this article are\nmacroscopic fields applied to a vacuum gap of 40 mm. Elec-\ntron emission was not observed from flat single crystal n1-Si\n~0.1 V cm! substrates at fields as high as 120 V\/mm, the limit\nof our apparatus. Reverse leakage currents were measured\nafter each experiment. Reverse leakage currents were less\nthan the minimum detectable limit of 131029 A for the\nmeasurement system used. Each current recorded is the av-\nerage of ten measurements at the fixed bias, with a fixed\ndelay period between each measurement of 2 s. The voltage\nwas then ramped slowly to the next value, and the next mea-\nsurement taken after a delay of 60 s. The electric field (E)\nshown in Figs. 1, 2, and 3, is calculated simply by dividing\nthe applied voltage (V) by the anode cathode spacing (d).\nAs shown in Fig. 1, an initiation field has to be applied to the\ncathodes to turn them on. Thereafter, the threshold field at\nwhich the emission takes place from the cathodes can be\nreduced by cycling the electric field over two to three peri-\nods. This we refer to as conditioning. If during this condi-\ntioning period we increase the current emitted above a cur-JVST B - Microelectronics and Nanometer Structuresrent threshold limit for a prolonged period of time, there\nresults a noticeable change in surface morphology. These\nfilms that show surface morphological changes we refer to as\nstressed films, see Fig. 4. The reverse leakage current for all\nthe results shown in this study remained below the detection\nlimit of our measurement system.\nIII. RESULTS AND DISCUSSION\nThe variation of a typical (I – E) characteristic showing\nthe initiation process and conditioning is shown in Fig. 1.\nThe data marked as set 1 in Fig. 1 shows three cycles of\nemission current readings obtained when the voltage was\ncycled three times between preset current limits. The varia-\ntion shown is for a 100-nm-thick a-Si:H film, which after\ninitiation follows a fixed I – E characteristic quite reproduc-\nibly. The data referred to as set 2 in Fig. 1 was obtained from\nthe same cathode region that had been let up to air for several\nhours and the retested under the same conditions after a pe-\nriod of 24 h. It is noticeable that the initiation that is required\nin the second run is significantly lower than the first run, and\nis tending towards the steady state values despite being ex-\nposed to air. The I – E curve obtained for set 2 matches that\nobtained for set 1 quite closely.\nOnce the cathode has been initiated, and conditioned, the\nexponentially rising region of the field emission current is\nfollowed by what almost looks like a superlinear region. This\nwould be expected if the current were to be bulk film limited\n598 Silva et al. : Electron field emission from amorphous silicon 598FIG. 2. Variation of the I – E curves as a function of film thickness. The a-Si:H films with thicknesses of 25, 50, and 100 nm are used to obtain the emission.as expected from a space-charge-limited current process\nthrough the thin film. The exponential turn-on region re-\nmains for over three orders of magnitude, spread over 20\nV\/mm, and then shows a much reduced increase in field\nemission current with electric field. The threshold field for\nthis cathode is of the order of 10 V\/mm, which is comparable\nto those observed for undoped diamond-like carbon thin\nfilms.9,10 The variation observed as a function of film thick-\nness for the a-Si:H films, where I – Es both for before and\nafter initiation appear in Fig. 2. The threshold field appears\nto first decrease and then increase with decreasing film thick-\nness, a feature that should remain approximately constant if\nthe emission was purely a surface effect as expected for\nFowler–Nordheim-like tunneling into vacuum. All the films\nshow an exponentially increasing current region of greater\nthan three orders of magnitude followed by a much shal-\nlower increase. In addition, the initial rate of increase is dif-\nferent for the three films analyzed with the thickest film\nshowing the least emission current increase per unit increase\nin electric field and the thinnest film showing the highest\nslope. Both the variation of threshold field and rate of in-\ncrease would be expected for films whose electron emission\nproperties were primarily controlled by band bending in the\nfilms and therefore would be critically dependent upon the\nthickness’ of films that controlled its space charge capability.\nThe field required to obtain emission from the cathodes may\nbe of significance as well. The initiation field increases as a\nfunction of film thickness indicating the need for higher\nfields to penetrate fully into the films before they becomeJ. Vac. Sci. Technol. B, Vol. 17, No. 2, Mar\/Apr 1999fully depleted. Latham11 first proposed the use of a ‘‘hot\nelectron emission model’’ to explain emission from insulat-\ning materials, which was later modified to incorporate elec-\ntron emission from semiconductors as a result of space\ncharge induced band bending which gives a thickness depen-\ndent electric field,4 as seen in these films. It is possible that\nthe emission observed in these films are localized as no site\ndensity information is available as yet. But, it is unlikely to\nbe a result of breakdown as inferred by scanning electron\nmicroscopy ~SEM! analysis. If the emission is localized, it\ntoo appears to be controlled by the space charge and the back\ncontact barrier.\nAll the films discussed in Fig. 2 have Schottky barriers\npresent between the Cr metal back contact and the a-Si:H\nthin film. As a result, the barrier present at the back contact\nwould block the flow of charge into the thin a-Si:H films\nuntil the band bending in the films due to space-charge con-\nsiderations is very large. The electrons that then thermioni-\ncally overcome the barrier ~and\/or tunnel through! at the\nback contact and enter the conduction band of the a-Si:H\nfilm will gather much kinetic energy while traversing down\nthe electric field towards the front surface of the cathode, in\nthe process becoming hot. It is then possible that close to the\nfront surface of the cathodes the energy of these hot electrons\nwill be great enough to overcome the surface electron affin-\nity and thereby leave the film as field emitted electrons.\nThe emission current observed experimentally in the\nfilms, although following a Fowler–Nordheim type tunneling\ncurrent equation, did not give realistic values for the fitting\n599 Silva et al. : Electron field emission from amorphous silicon 599FIG. 3. Electron field emission vs macroscopic electric field for a n1 a-Si:H thin film. In this case there is an ohmic back contact to the a-Si:H film.parameters. The barrier values obtained assuming a Fowler–\nNordheim type conduction mechanism is one to two orders\nof magnitude too small which then manifests itself as a very\nlow area of emission which is unrealistic for the cathodes\nanalyzed in this article. It is well known that the electron\naffinity of a-Si:H is close to 4 eV, and therefore it is highly\nunlikely that the emission will be purely due to Fowler–\nNordheim like tunneling at the front surface. The emission\ncurrent measured appears to follow a space-charge-limited\ncurrent more closely, which would be expected if the\ncurrent-limiting process was purely due to a space charge in\nthe film as proposed for DLC.4 In the case of the a-Si:H films\ninstead of a heterojunction ~as in DLC films in Ref. 4! at the\nback surface of the films, the reverse-biased Schottky barrier\nrequires a high field across the film before electrons can be\ninjected into the film by thermionic field emission. If these\nelectrons gain enough energy in traveling across the thin\nfilms, they can surmount the vacuum barrier at the front sur-\nface of the cathode and I – E currents as those observed\nwould be measured. Not all the electrons will be able to\nleave the cathode and therefore with time a pool of electrons\nmay collect at the front surface of the cathode, which will in\ntime decrease the band bending and thus turn off the emis-\nsion. We have experimentally observed the decrease and\nturning off of the emission current, with time.2,9 The time\nscales involved in this electron limiting process may be quite\nfast if the charge limiting was to occur as a result of modi-\nfication of the fields and bands within the a-Si:H as a result\nof the emission. On the other hand modification as a result of\nthe occupation of electronic defect states by electrons would\nbe much slower, and avoidable by pulsed mode operation of\nthe device, with the surface charge extracted by means of aJVST B - Microelectronics and Nanometer Structuresgated electrode. A possible band diagram when emission oc-\ncurs in these films together with a more complete account of\nthe charge limiting process will be published shortly.\nThe importance of the Schottky barrier at the back contact\nis highlighted in the emission characteristic shown in Fig. 3\nfor an n1 doped 100-nm-thick a-Si:H film. In this case the\nSchottky barrier is replaced by an ohmic contact which\nwould not present a barrier at the back contact. The film is\nthus prevented from becoming fully depleted and the forma-\ntion of a space charge layer that would lend itself to the\ncreation of hot electrons is not allowed. It can be observed\nthat the turn on threshold field of this cathode, even after\nconditioning, is not reproducible and is also significantly\nhigher than the other films analyzed. Also, the current satu-\nration level is lower than the other nondoped a-Si:H thin\nfilms with a slope that is much less steep.\nThe electron emission process at low electric fields from\nflat cathodes is not properly understood as of yet. Emission\nmodels based purely on Fowler–Nordheim type tunneling\nfrom the front contact does not appear to fit the measured\ndata unless very large beta factors or sharp surface features\nare assumed.10 It seems unlikely that such features could\nexist on a microscopic scale without it being observed in the\nscanning electron microscopic ~SEM! study performed upon\nsome of these a-Si:H cathodes. Films discussed in this article\nhave shown mirror-quality surfaces before and after electron\nemission. On the other hand, by increasing the current\nthreshold of the measurement system above a specified limit\nwe can ‘‘stress’’ the films such that surface features of Fig. 4\nresult. In this case, a-Si:H cathodes were continuously run at\nvery high current levels, for over 30 h, such that they would\nbecome stressed, and then subject to a SEM study. The\n600 Silva et al. : Electron field emission from amorphous silicon 600emission current levels of these diode structures were quite\nsteady after the initial burn-in period, but as shown in Fig. 4\na ‘‘pock-marked’’ surface resulted. A comparison of the\nI – E characteristics of the stressed and ‘‘unstressed’’ films\nhas been published previously.2 A close up of feature B\nshown in Fig. 4~a!, under a low accelerating voltage is\nshown in Fig. 4~b!. An energy dispersive x-ray ~EDX! study\nof the film revealed a surface that was still covered by a Si\nfilm, with Cr underneath. Under higher SEM accelerating\nvoltages, the disruption to the underlying Cr layer is more\nvisible. The boundary of the electron emission region shown\nby arrow D highlights the fact that there has been some\nchange in the composition of the film for it to change in\ncontrast. This could be due to hydrogen movement when\nemission takes place or charging of the cathode area after\nemission and cannot be elucidated in this study. The area\nshown by arrow A is typical for films that were not stressed,\nand the observed contrast between the emitted and nonemit-\nted regions was not present. The features shown in Fig. 4~b!\nwere less than 500 nm in height, and were composed prima-\nrily of Si and Cr.\nThe variation of the threshold field with film thickness\nattributed to a space charge model may be explained by ex-\namining the voltages that are required to fully deplete a thin\nfilm. As the film thickness increases, the external voltage\nFIG. 4. SEM micrograph of a stressed a-Si:H film that has been operated for\nover 30 h continuously, above a critical current threshold. Region B in ~a!\nhas been expanded in ~b!. ~a! Region of 8503650 mm and ~b! an area of\n1503115 mm.J. Vac. Sci. Technol. B, Vol. 17, No. 2, Mar\/Apr 1999required to fully deplete the film increases in a nonlinear\nmanner, which manifests itself as a higher electric field. On\nthe other hand, if the film thickness is too low, the electrons\nthat enter the conduction band of the a-Si:H film do not gain\nenough energy in traversing down the electric field to over-\ncome the surface potential barrier. These two conditions dic-\ntate that there will be an optimum film thickness window for\nelectron emission. This phenomenon has been shown to oc-\ncur for amorphous carbon thin films too.12\nIV. CONCLUSION\nIn this article we have shown that electron field emission\ncan be observed from flat cathodes made of a-Si:H thin\nfilms, at relatively low electric fields. The Schottky barrier\nthat is formed between the Cr back contact and the a-Si:H is\ncrucial for the operation of this device. The emission appears\nto be controlled primarily by the combined effect of the\nSchottky barrier and space-charge-induced band bending in\nthe film. This is confirmed by the film thickness dependence\nof the field assisted electron emission characteristics of the\ndiode structures. The a-Si thin films are candidates for cold\ncathodes as they can be incorporated easily into a field emis-\nsion display in the form of active devices.\nACKNOWLEDGMENTS\nR. D. F. would like to thank Philips Research Laborato-\nries, Redhill for an industrial studentship. The authors also\nacknowledge the support received from EPSRC ~GR\/\nL77638! for this work.\n1R. A. Street, in Hydrogenated Amorphous Silicon ~Cambridge University\nPress, Cambridge, 1991!.\n2S. R. P. Silva, R. D. Forrest, and J. M. Shannon, J. Non-Cryst. Solids\n227–230, 1101 ~1998!.\n3C. A. Spindt et al., IEEE Trans. Electron Devices 38, 2355 ~1991!.\n4G. A. J. Amaratunga and S. R. P. Silva, Appl. Phys. Lett. 68, 2529\n~1996!.\n5W. Zhu et al., Appl. Phys. Lett. 67, 1157 ~1995!.\n6A. A. Talin et al., J. Vac. Sci. Technol. A 14, 2 ~1996!.\n7J. Robertson, Mater. Res. Soc. Symp. Proc. 498, 197 ~1998!.\n8J. Jaskie, E-MRS Meeting, Strasbourg, June 1998 ~unpublished!; MRS\nBull. 21, 59 ~1996!.\n9S. R. P. Silva, R. D. Forrest, D. A. Munindradasa, and G. A. J. Amara-\ntunga, Diamond Relat. Mater. 7, 645 ~1998!.\n10X. Shi, S. R. P. Silva, L. K. Cheah, and B. K. Tay, Appl. Phys. Lett. ~in\npress!.\n11R. V. Latham, in High Voltage Vacuum Insulation ~Academic, New\nYork, 1981!.\n12R. D. Forrest, A. P. Burden, S. R. P. Silva, L. K. Cheah, and X. Shi, Appl.\nPhys. Lett. 73, 3784 ~1998!.\n"}