{"doi":"10.1136\/jech.2005.039784","coreId":"71324","oai":"oai:eprints.lancs.ac.uk:2479","identifiers":["oai:eprints.lancs.ac.uk:2479","10.1136\/jech.2005.039784"],"title":"Socioeconomic lifecourse influences on women's smoking status in early adulthood.","authors":["Graham, Hilary","Francis, Brian","Inskip, Hazel M.","Harman, Juliet",", Southampton Women Study Group"],"enrichments":{"references":[{"id":16368513,"title":"A life course approach to chronic disease epidemiology: tracing the origins of ill health from early to adult life. 2nd ed. Oxford:","authors":[],"date":"2003","doi":null,"raw":"Kuh DL, Ben-Shlomo Y, eds. A life course approach to chronic disease epidemiology: tracing the origins of ill health from early to adult life. 2nd ed. Oxford: Oxford University Press, 2003.","cites":null},{"id":16368514,"title":"A life course approach to women’s health. Oxford:","authors":[],"date":"2002","doi":"10.1093\/ije\/dyg332","raw":"Kuh D, Hardy R, eds. A life course approach to women’s health. Oxford: Oxford University Press, 2002.","cites":null},{"id":16368538,"title":"A life course perspective on women’s health behaviours.","authors":[],"date":null,"doi":"10.1093\/acprof:oso\/9780192632890.003.0013","raw":"Schooling M, Kuh D. A life course perspective on women’s health behaviours. In: Kuh D, Hardy R, eds. A life course approach to women’s health. Oxford: Oxford University Press, 2002:279–302.","cites":null},{"id":16368578,"title":"A researcher’s guide to the National Statistics socioeconomic classification.","authors":[],"date":"2003","doi":"10.4135\/9780857024725","raw":"Rose D, Pevalin DJ, eds. A researcher’s guide to the National Statistics socioeconomic classification. London: Sage, 2003.","cites":null},{"id":16368612,"title":"Are there socioeconomic differentials in under-reporting of smoking in pregnancy? Tob Control","authors":[],"date":"2003","doi":"10.1136\/tc.12.4.434","raw":"Graham H, Owen O. Are there socioeconomic differentials in under-reporting of smoking in pregnancy? Tob Control 2003;12:434–4.","cites":null},{"id":16368541,"title":"Changing social gradients in cigarette smoking and cessation over two decades of adult follow-up in a British birth cohort.","authors":[],"date":null,"doi":"10.1093\/pubmed\/fdh110","raw":"Jefferis B, Power C, Graham H, et al. Changing social gradients in cigarette smoking and cessation over two decades of adult follow-up in a British birth cohort. J Public Health Med 2004;26:13–8.","cites":null},{"id":16368534,"title":"Childhood poverty, early motherhood and adult social exclusion.","authors":[],"date":null,"doi":"10.1080\/00071310120071151","raw":"Hobcraft J, Kiernan K. Childhood poverty, early motherhood and adult social exclusion. Br J Sociol 2001;52:495–517.","cites":null},{"id":16368536,"title":"Childhood predictors of adult obesity: a systematic review. Int J Obes Relat Metab Disord 1999;23(suppl 8):S1–107.","authors":[],"date":null,"doi":null,"raw":"Parsons TJ, Power C, Logan S, et al. Childhood predictors of adult obesity: a systematic review. Int J Obes Relat Metab Disord 1999;23(suppl 8):S1–107.","cites":null},{"id":16368516,"title":"Childhood socioeconomic circumstances and cause-specific mortality in adulthood: systematic review and interpretation. Epidemiol Rev","authors":[],"date":"2004","doi":"10.1093\/epirev\/mxh008","raw":"Galobardes B, Lynch JW, Davey Smith G. Childhood socioeconomic circumstances and cause-specific mortality in adulthood: systematic review and interpretation. Epidemiol Rev 2004;26:7–21.","cites":null},{"id":16368573,"title":"Cohort profile: the Southampton Women’s Survey. Int J Epidemiol. Published online first 2005;doi: 10,","authors":[],"date":null,"doi":null,"raw":"Inskip HM, Godfrey KM, Robinson SM, et al. Cohort profile: the Southampton Women’s Survey. Int J Epidemiol. Published online first 2005;doi: 10, 1093\/ ije\/dyi202.","cites":null},{"id":16368608,"title":"Collecting retrospective data: accuracy of recall after 50 years judged against historical records. Soc Sci Med","authors":[],"date":null,"doi":"10.1016\/s0277-9536(97)00088-9","raw":"Berney LR, Blane DB. Collecting retrospective data: accuracy of recall after 50 years judged against historical records. Soc Sci Med","cites":null},{"id":16368581,"title":"Dream on: the logic of sexual practice.","authors":[],"date":null,"doi":"10.1080\/713684385","raw":"Thomson R. Dream on: the logic of sexual practice. Journal of Youth Studies","cites":null},{"id":16368565,"title":"Effects of childhood socio-economic circumstances on persistent smoking.","authors":[],"date":null,"doi":"10.2105\/ajph.94.2.279","raw":"Jefferis B, Power C, Graham H, et al. Effects of childhood socio-economic circumstances on persistent smoking. Am J Public Health 2004;94:279–85.","cites":null},{"id":16368518,"title":"Evaluating the evidence for models of life course socioeconomic factors and cardiovascular outcomes: a systematic review.","authors":[],"date":null,"doi":null,"raw":"Pollitt RA, Rose KM, Kaufman JS. Evaluating the evidence for models of life course socioeconomic factors and cardiovascular outcomes: a systematic review. BMC Public Health 2005;5:7.","cites":null},{"id":16368551,"title":"Explanations for socioeconomic differentials in mortality.","authors":[],"date":"1994","doi":"10.1093\/eurpub\/4.2.131","raw":"Davey Smith G, Blane D, Bartley M. Explanations for socioeconomic differentials in mortality. Eur J Public Health 1994;4:131–44.","cites":null},{"id":16368622,"title":"Health related lifestyle in adolescence predicts adult educational level.","authors":[],"date":null,"doi":"10.1136\/jech.52.12.794","raw":"Koivusilta L, Rimpela A, Rimpela M. Health related lifestyle in adolescence predicts adult educational level. J Epidemiol Community Health","cites":null},{"id":16368528,"title":"household and Individual Income in France, Germany, Italy, the Netherlands, Sweden, the USA and the UK, Luxembourg Income Study Working Paper 332. New York: Maxwell School of Citizenship and Public Affairs,","authors":[],"date":"2002","doi":null,"raw":"Rake K, Daly M. Gender, household and Individual Income in France, Germany, Italy, the Netherlands, Sweden, the USA and the UK, Luxembourg Income Study Working Paper 332. New York: Maxwell School of Citizenship and Public Affairs, Syracuse University, 2002.","cites":null},{"id":16368575,"title":"Impact of educational attainment on the quality of young women’s diets.","authors":[],"date":null,"doi":"10.1038\/sj.ejcn.1601946","raw":"Robinson SM, Crozier SR, Borland SE, et al. Impact of educational attainment on the quality of young women’s diets. Eur J Clin Nutr 2004;58:1174–80.","cites":null},{"id":16368549,"title":"in nine European countries.","authors":[],"date":"2000","doi":"10.1136\/sti.76.2.110","raw":"and 2000 in nine European countries. J Epidemiol Community Health","cites":null},{"id":16368554,"title":"Inequalities in lung cancer by educational level in 10 European populations.","authors":[],"date":null,"doi":"10.1016\/j.ejca.2003.10.018","raw":"Mackenbach JP, Huisman M, Andersen O, et al. Inequalities in lung cancer by educational level in 10 European populations. Eur J Cancer","cites":null},{"id":16368604,"title":"inequality and the rich countries of the G-20, Luxembourg Income Study Working Paper 330.","authors":[],"date":"2002","doi":"10.2139\/ssrn.1809030","raw":"Smeeding T. Globalization, inequality and the rich countries of the G-20, Luxembourg Income Study Working Paper 330. New York: Maxwell School of Citizenship and Public Affairs, Syracuse University, 2002.","cites":null},{"id":16368559,"title":"Influences on women’s smoking status: the contribution of socio-economic status in adolescence and adulthood.","authors":[],"date":null,"doi":"10.1093\/eurpub\/9.2.137","raw":"Graham H, Der G. Influences on women’s smoking status: the contribution of socio-economic status in adolescence and adulthood. Eur J Public Health","cites":null},{"id":16368546,"title":"International comparisons of trends in cigarette smoking prevalence.","authors":[],"date":"1989","doi":"10.2105\/ajph.79.2.152","raw":"Pierce JP. International comparisons of trends in cigarette smoking prevalence. Am J Public Health 1989;79:152–7.","cites":null},{"id":16368520,"title":"Key indicators of women’s position in Britain. London: Women and Equality Unit,","authors":[],"date":"2002","doi":null,"raw":"Women and Equality Unit. Key indicators of women’s position in Britain. London: Women and Equality Unit, 2002.","cites":null},{"id":16368601,"title":"Male youth culture: understanding the context of health-related behaviours. Health Educ Res","authors":[],"date":"1999","doi":"10.1093\/her\/14.5.583","raw":"Pavis S, Cunningham-Burley S. Male youth culture: understanding the context of health-related behaviours. Health Educ Res 1999;14:583–96.","cites":null},{"id":16368548,"title":"Office for National Statistics. Living in Britain: Results from the 2000\/01 General Household Survey. London: Office for National Statistics,","authors":[],"date":"2001","doi":null,"raw":"Office for National Statistics. Living in Britain: Results from the 2000\/01 General Household Survey. London: Office for National Statistics, 2001.","cites":null},{"id":16368613,"title":"Patterns and predictors of smoking cessation among women. Health Promot Int","authors":[],"date":"1999","doi":"10.1093\/heapro\/14.3.231","raw":"Graham H, Der G. Patterns and predictors of smoking cessation among women. Health Promot Int 1999;14:231–9.","cites":null},{"id":16368615,"title":"Patterns and predictors of smoking cessation in the general population. In:","authors":[],"date":null,"doi":"10.1159\/000062072","raw":"Jarvis MJ. Patterns and predictors of smoking cessation in the general population. In: Bolliger CT, Fagerstrom KO, eds. The tobacco epidemic. Basle: Karger, 1997:151–64.","cites":null},{"id":16368603,"title":"Performing coolness: smoking refusal and adolescent identities. Health Educ Res","authors":[],"date":"2002","doi":"10.1093\/her\/17.2.167","raw":"Plumridge EW, Fitzgerald LJ, Abel GM. Performing coolness: smoking refusal and adolescent identities. Health Educ Res 2002;17:167–79.","cites":null},{"id":16368584,"title":"Qualitative research and the evidence-base of policy: insights from studies of teenage mothers in the UK.","authors":[],"date":null,"doi":"10.1017\/s0047279405009360","raw":"Graham H, McDermott E. Qualitative research and the evidence-base of policy: insights from studies of teenage mothers in the UK. J Soc Policy","cites":null},{"id":16368524,"title":"reproduction and education: women, children and work in a British perspective. Population and Development Review","authors":[],"date":null,"doi":"10.1111\/j.1728-4457.2002.00445.x","raw":"Joshi H. Production, reproduction and education: women, children and work in a British perspective. Population and Development Review","cites":null},{"id":16368544,"title":"Smoking from adolescence to adulthood.","authors":[],"date":null,"doi":"10.1016\/s1054-139x(04)00059-x","raw":"Paavola M, Vartiainen E, Haukkala A. Smoking from adolescence to adulthood. Eur J Public Health 2004;14:417–21.","cites":null},{"id":16368522,"title":"Social and economic trajectories and women’s health.","authors":[],"date":null,"doi":"10.1093\/acprof:oso\/9780192632890.003.0011","raw":"Bartley M, Sacker A, Schoon I. Social and economic trajectories and women’s health. In: Kuh D, Hardy R, eds. A lifecourse approach to women’s health. Oxford: Oxford University Press, 2002:233–54.","cites":null},{"id":16368616,"title":"Social class and adolescent smoking behaviour. Soc Sci Med","authors":[],"date":"1994","doi":"10.1016\/0277-9536(94)90283-6","raw":"Glendinning A, Shucksmith J, Hendry L. Social class and adolescent smoking behaviour. Soc Sci Med 1994;38:1449–60.","cites":null},{"id":16368530,"title":"Socioeconomic disadvantage and adolescent women’s sexual and reproductive behaviour: the case of five developed countries. Fam Plann Perspect","authors":[],"date":"2001","doi":"10.2307\/3030192","raw":"Singh S, Darroch JE, Frost JJ, et al. Socioeconomic disadvantage and adolescent women’s sexual and reproductive behaviour: the case of five developed countries. Fam Plann Perspect 2001;33:251–8.","cites":null},{"id":16368618,"title":"Stage of change, low income and benefit status: a profile of women’s smoking in early pregnancy.","authors":[],"date":null,"doi":"10.1177\/001789699905800408","raw":"Batten L, Graham H, High S, et al. Stage of change, low income and benefit status: a profile of women’s smoking in early pregnancy. Health Educ J","cites":null},{"id":16368526,"title":"Still different? Income distribution in the Nordic countries in a European perspective.","authors":[],"date":"2001","doi":null,"raw":"Fritzell J. Still different? Income distribution in the Nordic countries in a European perspective. In, Kautto M, Fritzell J, Hvinden B, et al. Nordic welfare states in the European context London, Routledge, 2001.","cites":null},{"id":16368532,"title":"Teenage mothers and the health of their children. Popul Trends","authors":[],"date":"1998","doi":null,"raw":"Botting B, Rosato M, Wood R. Teenage mothers and the health of their children. Popul Trends 1998;93:19–27.","cites":null},{"id":16368563,"title":"The contribution of childhood and adult socioeconomic position to adult obesity and smoking behaviour: an international comparison.","authors":[],"date":null,"doi":"10.1093\/ije\/dyh394","raw":"Power C, Graham H, Due P, et al. The contribution of childhood and adult socioeconomic position to adult obesity and smoking behaviour: an international comparison. Int J Epidemiol 2005;34:355–44.","cites":null},{"id":16368570,"title":"The contribution of lone parenthood and economic difficulties to smoking. Soc Sci Med","authors":[],"date":"2005","doi":"10.1016\/j.socscimed.2004.11.044","raw":"Rahkonen O, Laaksonen M, Karvonen S. The contribution of lone parenthood and economic difficulties to smoking. Soc Sci Med 2005;61:211–16.","cites":null},{"id":16368624,"title":"The family gap in pay: evidence from seven industrialised countries, CASE paper 29. London: Centre for Analysis of Social Exclusion, London School of Economics,","authors":[],"date":"1999","doi":null,"raw":"Harkness S, Waldfogel J. The family gap in pay: evidence from seven industrialised countries, CASE paper 29. London: Centre for Analysis of Social Exclusion, London School of Economics, 1999.","cites":null},{"id":16368568,"title":"The health trap: poverty, smoking and lone parenthood. London: Policy Studies Institute,","authors":[],"date":"1998","doi":null,"raw":"Dorsett R, Marsh A. The health trap: poverty, smoking and lone parenthood. London: Policy Studies Institute, 1998.","cites":null},{"id":16368619,"title":"The role of childbirth in smoking cessation.","authors":[],"date":null,"doi":"10.1006\/pmed.1993.1019","raw":"Brenner H, Mielck A. The role of childbirth in smoking cessation. Prev Med","cites":null},{"id":16368609,"title":"The validity of self-reported smoking: a review and meta-analysis.","authors":[],"date":"1994","doi":"10.2105\/ajph.84.7.1086","raw":"Patrick DL, Cheadle A, Thompson DC, et al. The validity of self-reported smoking: a review and meta-analysis. Am J Public Health 1994;84:1086–93.","cites":null},{"id":16368606,"title":"Trends in poverty and income inequality in cross-national comparison.","authors":[],"date":null,"doi":null,"raw":"Ritakallio V-M. Trends in poverty and income inequality in cross-national comparison. European Journal of Social Security 2002;4:151–77.","cites":null},{"id":16368621,"title":"Unequal entry to motherhood and unequal starts in life: evidence from the first survey of the UK Millenium Cohort, Working Paper 6. London: Centre for Longitudinal Studies, Institute of Education,","authors":[],"date":"2004","doi":null,"raw":"Hawkes D, Joshi H, Ward K. Unequal entry to motherhood and unequal starts in life: evidence from the first survey of the UK Millenium Cohort, Working Paper 6. London: Centre for Longitudinal Studies, Institute of Education, 2004.","cites":null},{"id":16368610,"title":"Validation of self-reported smoking by serum cotinine measurement in a community-based study.","authors":[],"date":null,"doi":"10.1136\/jech.56.3.167","raw":"Vartiainen E, Seppa ¨la ¨ T, Lillsunde P, et al. Validation of self-reported smoking by serum cotinine measurement in a community-based study. J Epidemiol Community Health 2005;56:167–70.","cites":null},{"id":16368556,"title":"When does cardiovascular risk start? Past and present socioeconomic circumstances and risk factors in adulthood.","authors":[],"date":"1999","doi":"10.1136\/jech.53.12.757","raw":"Brunner E, Shipley MJ, Blane D, et al. When does cardiovascular risk start? Past and present socioeconomic circumstances and risk factors in adulthood. J Epidemiol Community Health 1999;53:757–64.","cites":null},{"id":16368625,"title":"Why do the poor behave poorly? Variation in adult health behaviors and psychosocial characteristics by stages of the socioeconomic lifecourse. Soc Sci Med","authors":[],"date":"1997","doi":"10.1016\/s0277-9536(96)00191-8","raw":"Lynch JW, Kaplan GA, Salonen JT. Why do the poor behave poorly? Variation in adult health behaviors and psychosocial characteristics by stages of the socioeconomic lifecourse. Soc Sci Med 1997;44:809–19.","cites":null},{"id":16368627,"title":"Working class matters: socioeconomic disadvantage, race\/ethnicity, gender and smoking","authors":[],"date":"2008","doi":"10.2105\/ajph.94.2.269","raw":"Barbeau E, Krieger N, Soobader M-J. Working class matters: socioeconomic disadvantage, race\/ethnicity, gender and smoking in NHIS 2000. Am J Public Health 2004;94:269–78. Socioeconomic lifecourse influences on women’s smoking status 233 www.jech.com on 1 April 2008  jech.bmj.com Downloaded from","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-03-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71324.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/2479\/1\/228.pdf","pdfHashValue":"61fe7cf42ffd686c2e28c60168ecd1442938420a","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:2479<\/identifier><datestamp>\n      2018-01-24T02:46:22Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D52:5241:524130343231<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Socioeconomic lifecourse influences on women's smoking status in early adulthood.<\/dc:title><dc:creator>\n        Graham, Hilary<\/dc:creator><dc:creator>\n        Francis, Brian<\/dc:creator><dc:creator>\n        Inskip, Hazel M.<\/dc:creator><dc:creator>\n        Harman, Juliet<\/dc:creator><dc:creator>\n        , Southampton Women Study Group<\/dc:creator><dc:subject>\n        RA0421 Public health. Hygiene. Preventive Medicine<\/dc:subject><dc:date>\n        2006-03-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/2479\/1\/228.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1136\/jech.2005.039784<\/dc:relation><dc:identifier>\n        Graham, Hilary and Francis, Brian and Inskip, Hazel M. and Harman, Juliet and , Southampton Women Study Group (2006) Socioeconomic lifecourse influences on women's smoking status in early adulthood. Journal of Epidemiology and Community Health, 60 (3). pp. 228-233. ISSN 1470-2738<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/2479\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1136\/jech.2005.039784","http:\/\/eprints.lancs.ac.uk\/2479\/"],"year":2006,"topics":["RA0421 Public health. Hygiene. Preventive Medicine"],"subject":["Journal Article","PeerReviewed"],"fullText":"doi:10.1136\/jech.2005.039784 \n 2006;60;228-233 J. Epidemiol. Community Health\n  \nHilary Graham, Brian Francis, Hazel M Inskip, Juliet Harman and SWS Study Group \n  \n smoking status in early adulthood\nSocioeconomic lifecourse influences on women’s\n http:\/\/jech.bmj.com\/cgi\/content\/full\/60\/3\/228\nUpdated information and services can be found at: \n These include:\n References\n http:\/\/jech.bmj.com\/cgi\/content\/full\/60\/3\/228#otherarticles\n4 online articles that cite this article can be accessed at: \n  \n http:\/\/jech.bmj.com\/cgi\/content\/full\/60\/3\/228#BIBL\nThis article cites 26 articles, 17 of which can be accessed free at: \nRapid responses\n http:\/\/jech.bmj.com\/cgi\/eletter-submit\/60\/3\/228\nYou can respond to this article at: \n service\nEmail alerting\ntop right corner of the article \nReceive free email alerts when new articles cite this article - sign up in the box at the\nTopic collections\n (871 articles) Socioeconomic Determinants of Health \u0095\n (569 articles) Other Obstetrics and Gynecology \u0095\n (1126 articles) Smoking \u0095\n  \nArticles on similar topics can be found in the following collections \n Notes   \n http:\/\/journals.bmj.com\/cgi\/reprintform\nTo order reprints of this article go to: \n http:\/\/journals.bmj.com\/subscriptions\/\n go to: Journal of Epidemiology and Community HealthTo subscribe to \n on 1 April 2008 jech.bmj.comDownloaded from \nRESEARCH REPORT\nSocioeconomic lifecourse influences on women’s smoking\nstatus in early adulthood\nHilary Graham, Brian Francis, Hazel M Inskip, Juliet Harman, and SWS Study Team\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\nSee end of article for\nauthors’ affiliations\n. . . . . . . . . . . . . . . . . . . . . . .\nCorrespondence to:\nProfessor H Graham,\nDepartment of Health\nSciences, Area 2,\nSeebohm Rowntree\nBuilding, University of\nYork, YO30 6AS, UK;\nhmg501@york.ac.uk\nAccepted for publication\n25 October 2005\n. . . . . . . . . . . . . . . . . . . . . . .\nJ Epidemiol Community Health 2006;60:228–233. doi: 10.1136\/jech.2005.039784\nStudy objective: To incorporate women’s domestic trajectories and circumstances into analyses of the\nsocioeconomic influences on women’s smoking status (current and former smoking) in early adulthood.\nDesign: Cross sectional survey\nSetting: Southampton, UK.\nParticipants: 8437 women aged 25–34 recruited from 1998–2002 via patient lists of general practices\nMain results: Domestic lifecourse factors contributed to the odds of being a current smoker and former\nsmoker in models that included conventional measures of the socioeconomic lifecourse. Early motherhood,\nnon-cohabitation, and lone motherhood increased the odds of smoking; early motherhood and non-\ncohabitation reduced the odds of former smoking. For example, relative to childless women, odds ratios\n(OR) for women who had become mothers ,20 years were 1.71 for smoking and 0.76 for former\nsmoking. The effects of education and current SEP remained strong with the inclusion of childbearing and\ncohabitation variables for both outcomes. For instance, compared with women in education to age >22,\nthe odds ratio for smoking for those leaving school (16 was 3.37 and for former smoking was 0.42.\nConclusions: Both the conventionally measured socioeconomic lifecourse and the domestic lifecourse\ncontributed separately to the odds of smoking and former smoking, suggesting that lifecourse analyses\nshould incorporate women’s domestic circumstances as an important pathway of influence on their\nsmoking status in early adulthood.\nI\nncreasing evidence that the socioeconomic environment in\nboth childhood and adulthood influences adult health is\nstarting to stimulate research on how social disadvantage\ntakes its toll across the course of people’s lives.1 2 This\nresearch has been characterised by, firstly, a reliance on a\ncomparatively narrow conceptualisation of the socioeconomic\nlifecourse and, secondly, its application to a comparatively\nnarrow range of health related outcomes.\nConceptually, the socioeconomic lifecourse is represented as a\nperson’s journey from the socioeconomic environment of the\nnatal family (typically indexed by father’s occupation), through\nthe education system (years\/level of education) to adulthood\n(own occupation). This trajectory captures important determi-\nnants of life chances and living standards in rich industrialised\nsocieties, and ones with powerful effects on disease and\nmortality risk in adulthood.3 4 But defining the socioeconomic\nlifecourse through a person’s relationship to the formal\ninstitutions of the labour market and the education system\nobscures their position in the informal institutions of home and\nfamily, positions that are integral to women’s socioeconomic\nlifecourse. Thus, single women are more likely to live in lower\nincome households than single men, and entry into and exit\nfrom marriage have greater effects on women’s employment\npatterns, earnings, and household incomes.5 6 Parenthood has\nhigher economic opportunity costs for women, reducing\nemployment rates and lifetime earnings.7 Lone mothers face\nadditional economic penalties, with poverty rates well above the\nmean across rich industrialised countries.8 9 As such patterns\nsuggest, a woman’s partnership and parenthood trajectories are\ninseparable from the conventionally defined lifecourse. Thus\npoor childhood circumstances and low educational attainment\nanticipate early entry into motherhood,10 11 a pathway to\nadulthood that in turn increases the risk of lone parenthood\nand future socioeconomic disadvantage.11 12\nThe primary application of the lifecourse perspective has\nbeen to physiological markers of health risk, morbidity, and\nmortality.3 4 13 But the concept is also important for under-\nstanding health related behaviours like cigarette smoking,\nwhich tracks across the lifecourse,14–16 increasingly displays\nsocioeconomic gradients,17–20 and makes an important con-\ntribution to socioeconomic health inequalities.21 22\nThere is evidence that current socioeconomic position\n(SEP) has a powerful effect on smoking status after\nadjustment for childhood circumstances.14 23–25 Childhood\neffects have also been found, both for smoking23 25 and\nquitting,14 25 and more strongly for women than men,23 25 with\neducation mediating the association between childhood SEP\nand adult smoking status.14 24 26 While smoking status is\nrelated to social mobility, with the upwardly mobile less\nlikely to smoke than those they leave behind, the overall\neffects of social mobility on smoking status are modest.15 16\nWomen’s domestic trajectories and circumstances are\nrarely included in these socioeconomic lifecourse analyses.\nHowever, there is evidence that living with a partner reduces\na woman’s odds of smoking, after adjustment for childhood\ncircumstances, education, and current SEP,24 that both poor\nchildhood circumstances and early motherhood contribute\nseparately to the risk of adult smoking,12 26 and that lone\nparenthood and economic hardship have separate effects on\nthe odds of smoking.27 28 In an analysis that included\nmeasures of the conventional socioeconomic lifecourse and\nwomen’s domestic trajectories, age at entry into motherhood\nand being a single parent at age 33 increased the odds of\npersistent smoking across adulthood.26\nBuilding on these studies, we include childbearing\nhistories and cohabitation status in an analysis of the\nsocioeconomic predictors of women’s smoking status in early\nadulthood.\n228\nwww.jech.com\n on 1 April 2008 jech.bmj.comDownloaded from \nMETHODS\nSample\nThe study is based on the Southampton Women’s Survey\n(SWS) of 12 484 women aged 20–34 years who were not\ncurrently pregnant, resident in the city of Southampton,\nsouthern England. It was approved by the Southampton and\nSouth West Hampshire local research ethics committee.\nParticipants were recruited from 1998 to 2002 via patient\nlists of general practices.29 30 Of those approached, 75% agreed\nto take part. The final sample is representative of the study\npopulation and has a deprivation and ethnic profile in line\nwith that of England and Wales. To include both educational\nand childbearing trajectories in the transition to adulthood,\nour analyses are restricted to women aged 25 to 34. Women\nwho had never had a paid job and whose occupation could\ntherefore not be coded (8% in the target age group) were\nexcluded, leaving a sample of 8437 for analysis.\nMeasures\nAll data were self reported. Current smokers were defined as\nthose who smoked >1 cigarette per day; former smokers had\nsmoked >1 cigarette per day for at least a year but were not\ncurrent smokers at the time of the interview.\nTable 1 lists socioeconomic lifecourse measures. Childhood\nSEP (based on father’s occupation at birth) and current SEP\n(own full time current\/last occupation, or part time occupa-\ntion if never worked full time) were classified using the\nNational Statistics-Socioeconomic Classification (NS-SEC)\nthat, by categorising occupations according to their employ-\nment relations and conditions, provides an equivalent\nschema for male and female occupations.31 The simplified\nclassification was used (see table 1). For childhood SEP,\nwomen not reporting father’s occupation (14%) were\nincluded as a separate category. Own SEP was coded by\ncurrent\/last full time occupation (or part time if never worked\nfull time). Seventy seven per cent were currently in full or\npart time employment; others, such as full time students and\nhousewives out of the labour market who had previously\nworked, were coded by their last occupation.\nEducational and childbearing trajectories were measured,\nrespectively, by age of leaving full time education and by\nwhether, and at what age, the woman had become a mother.\nMaternal status was derived from household information,\nand excludes children who had died or who were resident\nelsewhere. Cohabitation status was defined as living\/not\nliving with a partner. Age was included in the analyses as a\ncontinuous measure.\nData analysis\nIn initial analyses, logistic regression was used to predict\ncurrent smoking and former smoking separately for each\nlifecourse factor. In mutually adjusted models that included\nage and childhood SEP, we examined the effects on smoking\nbehaviour of the domestic lifecourse (childbearing histories\nand cohabitation status) before widening the model to\ninclude education and adult SEP. We show the statistical\nsignificance of removing each variable from this final model\nusing the likelihood ratio test. Potential interactions between\nchildhood SEP and subsequent lifecourse factors were also\ninvestigated.\nRESULTS\nTable 1 describes the socioeconomic and smoking profile of\nthe sample. Smoking prevalence (29%) was lower and quit\nrates (36%) were higher than national rates for women aged\n25–34 in 2000 (32% and 29% respectively).18 These rate\ndifferences were in line with regional variations in smoking\nTable 1 Socioeconomic and smoking profile of the sample\nNumber of cases % Of sample\nFather’s collapsed NS-SEC\u0001\nProfessional and Managerial 2084 24.7\nIntermediate 2582 30.6\nSemi-routine\/routine 2579 30.6\nMissing 1192 14.1\nWoman’s collapsed NS-SEC\u0001\nProfessional and Managerial 3254 38.6\nIntermediate 2850 33.8\nSemi-routine\/routine 2333 27.7\nAge of leaving full time education\n22 and over 1218 14.4\n19–21 1123 13.3\n17–18 2330 27.6\n16 and under 3766 44.6\nAge of entry into motherhood\nNo births at time of interview 3696 43.8\n25 and over 2178 25.8\n22–24 1085 12.9\n20 and 21 690 8.2\n,20 788 9.3\nLone motherhood\nNo 7623 90.4\nYes 814 9.6\nCohabitation status\nLives with partner 6106 72.4\nDoes not live with a partner 2331 27.6\nCurrent smoker\nNo 5959 70.6\nYes 2478 29.4\n% Of ever smoked\nFormer smoker\nNo 2478 64.0\nYes 1395 36.0\nTotal who ever smoked 3873 100.0\nNS-SEC, National Statistics-Socioeconomic Classification.\nSocioeconomic lifecourse influences on women’s smoking status 229\nwww.jech.com\n on 1 April 2008 jech.bmj.comDownloaded from \nstatus in England, with prevalence in the south east lower\nthan both northern regions and the country as a whole.18\nSmoking behaviour was socially patterned. Across both\nconventional and domestic lifecourse indicators, women on\ndisadvantaged social trajectories had higher rates and\nunadjusted odds of current smoking, and had lower rates\nand odds of cessation (tables 2 and 3, columns A and B).\nThe initial mutually adjusted model, including only age\nand childhood SEP, showed that women from professional\/\nmanagerial backgrounds have a lower odds of smoking and\nhigher odds of quitting than other groups (tables 2 and 3,\ncolumn C). When the model was extended to include the\ndomestic lifecourse (column D), age of motherhood, cohabi-\ntation status, and lone motherhood contributed separately to\nthe prediction of current smoking, and age of motherhood\nand cohabitation status to the odds of quitting. Compared\nwith women who were not mothers, the odds of smoking\namong women whose first child was born at age ( 21 were\nconsiderably higher; their odds of quitting were appreciably\nreduced. Women entering motherhood at >25 years had\nlower odds of smoking and higher odds of quitting than the\nreference group of non-mothers.\nIn the final model (tables 2 and 3, column E), domestic\nfactors continued to influence the odds of both outcomes.\nWhile attenuated, strong effects for age of motherhood\nremain. For current smoking, odds were higher for those who\nhad become mothers in their late teens and early 20s, relative\nboth to women who were still childless and to those who\nwere mothers at age 25 and over. Odds rose as age of\nmotherhood fell (OR 1.71, CI 1.41, 2.08, for first birth at ,20\nyears). Living without a partner (OR 1.22, CI 1.05, 1.42) and,\nover and above this, being a lone mother (OR 1.93, CI 1.54,\n2.42) added further to the odds of smoking. The odds\ndeclined with age.\nFor quitting, odds were lower for women who became a\nmother before age 20 than for the reference group of women\nwho were still childless. But odds were at their highest\namong women who entered motherhood at or after the age of\n25 (OR 1.64, CI 1.33,2.02). Partnership status also contrib-\nuted separately to the prediction of quitting, with odds\nconsiderably lower (OR 0.64, CI 0.51,0.80) for non-cohabiting\nwomen. Being a lone mother had no additional effect over\nand above age of motherhood and partnership status. The\nodds of quitting increased with age.\nIn this final model, education and adult SEP contributed\nseparately to the odds of both outcomes. The odds of smoking\nfor women who left full time education at the minimum age\nare over three times higher (OR 3.37, CI 2.75, 4.13) than for\nthose staying beyond age 21; their odds of quitting were more\nthan halved (OR 0.42, CI 0.32, 0.54).\nBecause our measure of childhood and adult SEP includes\na wide range of occupations within its three categories, we\nrepeated the modelling process using the registrar general’s\nsocial class classification (social class I\/II, III non-manual, III\nmanual, IV\/V) in place of NS-SEC. The odds ratios for the\nother variables were unchanged, with pronounced effects of\neducation and the domestic lifecourse remaining (results not\ngiven). We also repeated the analysis, entering childhood\nSEP, education and current SEP together first and then\nadding the three domestic lifecourse measures. The effects of\nthe conventional lifecourse measures were little attenuated\nby the inclusion of the domestic lifecourse measures (results\nnot given).\nTesting for interactions in model E, childhood circum-\nstances were found to modify the effect of lone motherhood\non current smoking. The effect of lone motherhood was\ngreater for women from professional and managerial back-\ngrounds (OR 2.51, CI 1.63,3.89) than for women whose\nTable 2 Current smoking: prevalence rates, unadjusted and mutually adjusted odds ratios (95% confidence intervals)\n(n = 8437). Effects of childhood socioeconomic position, parenthood histories and domestic circumstances, and education and\nadult socioeconomic position\n%\nUnadjusted OR\nand 95% CI Mutually adjusted OR and 95% CI\nA B C D E\nAge\u0001 0.98 (0.96, 1.00) 0.98 (0.96,1.00) 0.99 (0.97,1.00) 0.97 (0.95,0.99)**\nFather’s collapsed NS-SEC\nProfessional and Managerial 22.4 1 1 1 1***\nIntermediate 26.6 1.26 (1.10,1.44) 1.26 (1.11,1.45) 1.17 (1.02,1.35) 0.97 (0.84,1.12)\nSemi-routine\/routine 34.4 1.82 (1.60,2.07) 1.83 (1.60,2.08) 1.52 (1.32,1.74) 1.13 (0.98,1.30)\nMissing 36.5 1.99 (1.70,2.33) 2.00 (1.71,2.34) 1.68 (1.43,1.98) 1.36 (1.15,1.61)\nAge of entry into motherhood\nNo births at time of interview 25.0 1 1 1****\n25 and over 19.8 0.74 (0.65,0.84) 0.74 (0.64,0.87) 0.63 (0.54,0.74)\n22–24 32.8 1.47 (1.27,1.70) 1.26 (1.06,1.49) 0.87 (0.73,1.04)\n20 and 21 47.4 2.72 (2.30,3.21) 2.15 (1.78,2.60) 1.35 (1.10,1.65)\nUnder 20 55.6 3.75 (3.20,4.40) 3.01 (2.51,3.60) 1.71 (1.41,2.08)\nCohabitation status\nLives with a partner 26.3 1 1 1*\nDoes not live with a partner 37.5 1.68 (1.52,1.86) 1.24 (1.07,1.45) 1.22 (1.05,1.42)\nLone mother (child\/no partner)`\nNo 26.5 1 1 1****\nYes 56.1 3.55 (3.06,4.11) 2.01 (1.61,2.51) 1.93 (1.54,2.42)\nAge of leaving full time education\n22 + 12.6 1 1****\n19–21 17.5 1.46 (1.16,1.84) 1.40 (1.11,1.77)\n17–18 25.6 2.38 (1.96,2.89) 2.10 (1.71,2.57)\n16 and under 40.7 4.73 (3.95,5.67) 3.37 (2.75,4.13)\nWoman’s collapsed NS-SEC\nProfessional and Managerial 20.4 1 1****\nIntermediate 28.0 1.51 (1.35,1.70) 1.08 (0.95,1.22)\nSemi-routine\/routine 43.6 3.01 (2.68,3.39) 1.55 (1.35,1.78)\nSignificance in model E: p,0.0001****; p,0.001***; p,0.01**; p,0.05*. \u0002For age, the odds ratio refers to a one year increase in age. `The odds ratio for lone\nmothers in models D and E gives the additional effect of living with a child for a woman without a partner.\n230 Graham, Francis, Inskip, et al\nwww.jech.com\n on 1 April 2008 jech.bmj.comDownloaded from \nfathers had been in semi-routine\/routine occupations (OR\n1.46, CI 0.77,2.78).\nDISCUSSION\nThe socioeconomic lifecourse is a theoretical construct\nintroduced into social epidemiology to highlight the associa-\ntion between social circumstances at different life stages, and\nthe ways in which these accumulate and interact in the\nrelation with adult health. Conventionally measured by\nchildhood SEP, education, and adult SEP, the concept can\nobscure factors known to have a stronger effect on life\nchances and living standards of women than men, including\npartnership and parenting trajectories. As a rich seam of\nsociological research has shown, women’s socioeconomic\ntrajectories are fashioned by both gender and socioeconomic\ninequality, with investment in early motherhood central to\nthe identities of young women negotiating a pathway to\nadulthood against a backdrop of material and social\ndisadvantage.32 33 As such research suggests, the socioeco-\nnomic lifecourse is gendered. Conventional indicators may\ntherefore be detecting only some of its influences on health\nbehaviours that, like cigarette smoking, track from adoles-\ncence into adulthood.14 26 34 35\nThere are few prospective studies capable of identifying the\ntemporal relations between women’s socioeconomic trajec-\ntories and their smoking careers. Most of the birth cohort\nstudies relate to men and to older cohorts growing up in a\ntime of greater stability in domestic trajectories.3 4 Analyses\nbased on such studies may therefore underestimate the effect\nof early motherhood and lone motherhood on the smoking\ncareers of young women today. This contemporary study was\nbased in the UK, where, as in other rich societies, transitions\nTable 3 Quitting smoking: prevalence rates, unadjusted and mutually adjusted odds ratios (95% confidence intervals)\n(n = 3873). Effects of childhood socioeconomic position, parenthood histories and domestic circumstances, and education and\nadult socioeconomic position\n%\nUnadjusted OR\nand 95% CI Mutually adjusted OR and 95% CI\nA B C D E\nAge\u0001 1.04 (1.01,1.06) 0.98 (0.96,1.00) 1.02 (0.99,1.05) 1.03 (1.01,1.06)*\nFather’s collapsed NS-SEC\nProfessional and Managerial 43.9 1 1 1 1\nIntermediate 36.9 0.75 (0.62,0.90) 0.74 (0.62,0.89) 0.79 (0.65,0.95) 0.89 (0.74,1.09)\nSemi-routine\/routine 32.1 0.60 (0.50,0.72) 0.60 (0.50,0.71) 0.65 (0.54,0.79) 0.82 (0.67,0.99)\nMissing 32.2 0.61 (0.49,0.75) 0.60 (0.49,0.75) 0.68 (0.54,0.84) 0.81 (0.64,1.01)\nAge of entry into motherhood\nNo births at time of interview 37.2 1 1 1****\n25 and over 49.3 1.64 (1.38,1.95) 1.46 (1.19,1.79) 1.64 (1.33,2.02)\n22–24 35.2 0.91 (0.75,1.12) 0.93 (0.74,1.17) 1.22 (0.96,1.55)\n20 and 21 26.0 0.59 (0.47,0.75) 0.64 (0.49,0.84) 0.90 (0.68,1.19)\nUnder 20 21.4 0.46 (0.37,0.58) 0.49 (0.38,0.63) 0.76 (0.58,0.99)\nCohabitation status\nLives with a partner 40.5 1 1 1****\nDoes not live with a partner 25.7 0.51 (0.44,0.59) 0.62 (0.50,0.78) 0.64 (0.51,0.80)\nLone mother (child\/no partner)`\nNo 38.7 1 1 1\nYes 20.4 0.40 (0.33,0.50) 0.74 (0.54,1.02) 0.76 (0.55,1.05)\nAge of leaving full time education\n22 + 57.2 1 1****\n19–21 47.5 0.68 (0.50,0.90) 0.70 (0.52,0.95)\n17–18 37.9 0.46 (0.36,0.58) 0.51 (0.39,0.66)\n16 and under 29.7 0.32 (0.25,0.40) 0.42 (0.32,0.54)\nWoman’s collapsed NS-SEC\nProfessional and Managerial 45.8 1 1****\nIntermediate 38.1 0.73 (0.62,0.85) 0.91 (0.76,1.08)\nSemi-routine\/routine 25.2 0.40 (0.34,0.47) 0.60 (0.50,0.72)\nSignificance in model E: p,0.0001****; p,0.001***; p,0.01**; p,0.05*. \u0002For age, the odds ratio refers to a one year increase in age. `The odds ratio for lone\nmother in models D and E gives the additional effect of living with a child for a woman without a partner.\nPolicy implications\nPublic health policies should be widened beyond their\ntraditional focus on changing individual behaviour, to\nmoderating the unequal lifecourse pathways in which\nsmoking careers are embedded. This broader vision of\ntobacco control policy would include evaluation of policies\nthat influence children’s exposure to disadvantage, the life\nchances of young people heading for early school leaving\nand early parenthood, and the social and material\ncircumstances of women, particularly lone mothers, whose\nemployment opportunities are restricted to the low waged\nsectors of the labour market.\nWhat this paper adds\nN It extends the concept of the socioeconomic lifecourse\nbeyond its conventional focus on childhood circum-\nstances, education, and adult socioeconomic position\nto include domestic trajectories and circumstances that\nare integral to women’s socioeconomic lifecourse.\nN Through an analysis of a contemporary study of\nwomen, it highlights the contribution of the domestic\nlifecourse, as well as the conventionally measured\nlifecourse, to the odds of smoking and quitting in early\nadulthood.\nN It suggests that women’s domestic trajectories and\ncircumstances should be recognised as important\npathways of influence on smoking in public health\nresearch and policy.\nSocioeconomic lifecourse influences on women’s smoking status 231\nwww.jech.com\n on 1 April 2008 jech.bmj.comDownloaded from \nto adulthood are lengthening and poverty rates among young\nadults have been rising,9 36 37 family structures are changing,\nand more young adults are forming single person households\nand lone parent families.9 36 37 Childhood SEP was derived\nfrom recalled father’s occupation and smoking status was self\nreported. Validation studies show that both measures are\nbroadly reliable,38 39 with no systematic socioeconomic biases\nin underreporting of smoking.40 41\nIn line with other studies in rich societies, we found that\nsmoking risk was strongly patterned by social background,\neducational pathways, and current occupational status.15 23–25\nConsistent with their findings, education and, to a lesser\ndegree, current SEP were predictive of quitting.42 43 Our\nlimited measures of childhood and adult SEP may have\nresulted in an overestimation of the effects of education, with\neducation capturing dimensions of both family background\nand current circumstances. However, other studies have\nsimilarly noted the importance of educational trajectories in\nshaping smoking careers.14 24 42 44\nOur study adds to these findings by highlighting the\nassociation between women’s domestic circumstances and\nsmoking status in early adulthood, with effects that remain\nafter adjustment for conventional measures of the socio-\neconomic lifecourse. Women following disadvantaged trajec-\ntories into early and lone motherhood had higher odds of\nsmoking than those who deferred childbearing and parented\nwithin a cohabiting relationship; among the ever-smokers,\nearly motherhood and non-cohabitation reduced the odds of\nquitting. Reliance on own occupation to measure adult SEP\nmay underestimate its contribution relative to domestic\nlifecourse factors, with the latter potentially capturing the\neffects of partner’s socioeconomic position on women’s living\nstandards and life chances. However, substituting household\nmeasures of SEP (social housing and receipt of means tested\nbenefits) for own NS-SEC left the effects of both the\nconventional and the domestic lifecourse factors on the odds\nof current smoking and quitting largely unchanged.\nElsewhere, early motherhood has been found to increase\nthe odds of adult smoking, over and above the effects of poor\nchildhood circumstances12 26 and lone parenthood to both\nincrease the odds of smoking27 28 and to reduce the odds of\nquitting.27 43\nThe lowest odds of smoking and the highest odds of\nquitting were among women who had their first child at age\n>25: they were less likely to smoke and more likely to have\nquit than both younger mothers and women who were not\nmothers at the time of interview. While rates of post-partum\nresumption are high, pregnancy has a long term cessation\neffect,42 an effect that is more pronounced for first time\nmothers.45 46 Consistent with these patterns, women who\nwere mothers by their mid-20s were more likely to be former\nsmokers and less likely to be smokers than non-mothers.\nWhile our study points to the importance of the domestic\nlifecourse for women’s smoking status in early adulthood, its\ncross sectional design means that findings are suggestive not\nconclusive. Further caveats need to be made. Firstly, father’s\noccupation was not recorded for 14% of the sample, a group\nwith higher adjusted odds of smoking than women from\nsemi-routine and routine backgrounds. Compared with\nwomen from these backgrounds, women with missing\ninformation on childhood SEP were more likely to have\nstayed in education beyond 16 (50% v 42%) and to be in a\nprofessional\/managerial occupation (34% v 28%). But they\nwere more likely to have lost contact with their fathers (21% v\n1%) and to be adopted (8% v 0.3%). As this suggests, the\n‘‘missing data’’ category may be measuring dimensions of\npsychosocial disadvantage not captured by father’s NS-SEC.\nWhen analyses were redone to exclude this group, the odds\nratios for all predictors were little changed for either smoking\noutcome, and childhood SEP remained a significant predictor\nof current smoking at the 5% level. None the less,\ninformation on father’s occupation would have enabled the\ngroup to be classified within the NS-SEC schema, with a\npotentially larger effect on the predictors.\nSecondly, our measure of parenthood trajectories, derived\nfrom a sample of women at various points in their\nreproductive careers, combined being a mother with age at\nfirst birth. Other datasets suggest that, for women ,25 years,\nage at first birth is strongly associated with past and future\nsocioeconomic circumstances and with adult smoking sta-\ntus.12 47 At ages>25, women are less socially differentiated by\nage at first birth; in consequence, the measure adds little\nexplanatory power to lifecourse models for older women.12 47\nAs a further check, we repeated the analyses for the\nsubsample of women who were already mothers\n(n = 4741). With lone motherhood included, cohabitation\nstatus was redundant. The lifecourse predictors, and their\nrelative contribution to the prediction of current smoking and\nquitting, were unchanged.\nThirdly, there is some evidence that adolescent smoking\nstatus influences subsequent social mobility,48 effects that are\nhard to detect in cross sectional surveys. A limited check of\nthe effects of a change in NS-SEC between childhood and\nadulthood on the odds of smoking was undertaken. Such a\nchange was found to have no extra effect over and above\nthose of childhood and adult SEP.\nFinally, the study is located in a society where the\neconomic opportunity cost of caring for children is higher\nthan elsewhere.49 In separate analyses of the SWS, we\nexamined the contribution of women’s domestic and socio-\neconomic trajectories to their current SEP. While strong\neffects of childhood circumstances and education were seen,\nboth parenthood histories and partnership status emerged as\npowerful predictors. As this suggests, it would be important\nto repeat the analysis in societies where the socioeconomic\nimpact of women’s reproductive trajectories is less pro-\nnounced, to build a cross-national perspective on the effects\nof childbearing and cohabitation status on women’s smoking\nstatus in early adulthood.\nCONCLUSIONS\nOur study builds on evidence that domestic trajectories and\ncircumstances capture exposures that have yet to be\nincorporated into the concept of the socioeconomic lifecourse.\nConsistent with other studies, it shows that women’s\ndomestic circumstances may represent an important pathway\nof influence on their smoking status, operating over and\nabove the effects of the childhood SEP-education-adult SEP\ntrajectory.\nTwo broad conclusions can be drawn. Firstly, it suggests\nthat lifecourse analyses should be widened to include\npathways into social and health disadvantage beyond those\nindexed by conventional measures of SEP. Our focus on\ngendered socioeconomic pathways is one part of this larger\ntask of elucidating the processes that shape health risk over\nthe lifecourse in rich, but increasingly diverse, dynamic, and\npolarised, societies.\nSecondly, our study adds to evidence that public health\npolicies should be widened beyond their traditional focus on\nchanging individual behaviour, to moderating the unequal\nlifecourse pathways in which smoking careers are\nembedded.50 51 This broader vision of tobacco control policy\nwould include evaluation of policies that influence children’s\nexposure to disadvantage, the life chances of young people\nheading for early school leaving and early parenthood, and\nthe social and material circumstances of women, particularly\nlone mothers, whose employment opportunities are restricted\nto the low waged sectors of the labour market.\n232 Graham, Francis, Inskip, et al\nwww.jech.com\n on 1 April 2008 jech.bmj.comDownloaded from \nACKNOWLEDGEMENTS\nWe thank the women who took part in the Southampton Women’s\nSurvey and the survey staff who recruited the women and collected\nand processed the data. We also wish to thank MB for her helpful\ncomments on an earlier version of the paper.\nAuthors’ affiliations\n. . . . . . . . . . . . . . . . . . . . .\nH Graham, Department of Health Sciences, University of York, UK\nB Francis, J Harman, Centre for Applied Statistics, Lancaster University,\nUK\nH M Inskip, MRC Epidemiology Resource Centre, University of\nSouthampton, Southampton General Hospital, UK\nSWS Study Group, MRC Epidemiology Resource Centre, University of\nSouthampton\nFunding: the paper forms part of a project based on the SWS funded by\nCancer Research UK, grant no C5649\/A4694. The SWS was funded by\nthe Dunhill Medical Trust, the Medical Research Council and the\nUniversity of Southampton\nCompeting interests: none declared.\nREFERENCES\n1 Kuh DL, Ben-Shlomo Y, eds. A life course approach to chronic disease\nepidemiology: tracing the origins of ill health from early to adult life. 2nd ed.\nOxford: Oxford University Press, 2003.\n2 Kuh D, Hardy R, eds. A life course approach to women’s health. Oxford:\nOxford University Press, 2002.\n3 Galobardes B, Lynch JW, Davey Smith G. Childhood socioeconomic\ncircumstances and cause-specific mortality in adulthood: systematic review\nand interpretation. Epidemiol Rev 2004;26:7–21.\n4 Pollitt RA, Rose KM, Kaufman JS. Evaluating the evidence for models of life\ncourse socioeconomic factors and cardiovascular outcomes: a systematic\nreview. BMC Public Health 2005;5:7.\n5 Women and Equality Unit. Key indicators of women’s position in Britain.\nLondon: Women and Equality Unit, 2002.\n6 Bartley M, Sacker A, Schoon I. Social and economic trajectories and women’s\nhealth. In: Kuh D, Hardy R, eds. A lifecourse approach to women’s health.\nOxford: Oxford University Press, 2002:233–54.\n7 Joshi H. Production, reproduction and education: women, children and work\nin a British perspective. Population and Development Review\n2002;28:445–74.\n8 Fritzell J. Still different? Income distribution in the Nordic countries in a\nEuropean perspective. In, Kautto M, Fritzell J, Hvinden B, et al. Nordic welfare\nstates in the European context London, Routledge, 2001.\n9 Rake K, Daly M. Gender, household and Individual Income in France,\nGermany, Italy, the Netherlands, Sweden, the USA and the UK, Luxembourg\nIncome Study Working Paper 332. New York: Maxwell School of Citizenship\nand Public Affairs, Syracuse University, 2002.\n10 Singh S, Darroch JE, Frost JJ, et al. Socioeconomic disadvantage and\nadolescent women’s sexual and reproductive behaviour: the case of five\ndeveloped countries. Fam Plann Perspect 2001;33:251–8.\n11 Botting B, Rosato M, Wood R. Teenage mothers and the health of their\nchildren. Popul Trends 1998;93:19–27.\n12 Hobcraft J, Kiernan K. Childhood poverty, early motherhood and adult social\nexclusion. Br J Sociol 2001;52:495–517.\n13 Parsons TJ, Power C, Logan S, et al. Childhood predictors of adult obesity: a\nsystematic review. Int J Obes Relat Metab Disord 1999;23(suppl 8):S1–107.\n14 Schooling M, Kuh D. A life course perspective on women’s health behaviours.\nIn: Kuh D, Hardy R, eds. A life course approach to women’s health. Oxford:\nOxford University Press, 2002:279–302.\n15 Jefferis B, Power C, Graham H, et al. Changing social gradients in cigarette\nsmoking and cessation over two decades of adult follow-up in a British birth\ncohort. J Public Health Med 2004;26:13–8.\n16 Paavola M, Vartiainen E, Haukkala A. Smoking from adolescence to\nadulthood. Eur J Public Health 2004;14:417–21.\n17 Pierce JP. International comparisons of trends in cigarette smoking\nprevalence. Am J Public Health 1989;79:152–7.\n18 Office for National Statistics. Living in Britain: Results from the 2000\/01\nGeneral Household Survey. London: Office for National Statistics, 2001.\n19 Cavelaars AE, Kunst AE, Geurts JJ, et al. Educational differences in smoking:\ninternational comparison. BMJ 2000;320:1102–7.\n20 Giskes K, Kunst AE, Benach J, et al. Trends in smoking behaviour between\n1985 and 2000 in nine European countries. J Epidemiol Community Health\n2005;59:395–401.\n21 Davey Smith G, Blane D, Bartley M. Explanations for socioeconomic\ndifferentials in mortality. Eur J Public Health 1994;4:131–44.\n22 Mackenbach JP, Huisman M, Andersen O, et al. Inequalities in lung cancer by\neducational level in 10 European populations. Eur J Cancer\n2004;40:126–35.\n23 Brunner E, Shipley MJ, Blane D, et al. When does cardiovascular risk start?\nPast and present socioeconomic circumstances and risk factors in adulthood.\nJ Epidemiol Community Health 1999;53:757–64.\n24 Graham H, Der G. Influences on women’s smoking status: the contribution of\nsocio-economic status in adolescence and adulthood. Eur J Public Health\n1999;9:137–41.\n25 Power C, Graham H, Due P, et al. The contribution of childhood and adult\nsocioeconomic position to adult obesity and smoking behaviour: an\ninternational comparison. Int J Epidemiol 2005;34:355–44.\n26 Jefferis B, Power C, Graham H, et al. Effects of childhood socio-economic\ncircumstances on persistent smoking. Am J Public Health 2004;94:279–85.\n27 Dorsett R, Marsh A. The health trap: poverty, smoking and lone parenthood.\nLondon: Policy Studies Institute, 1998.\n28 Rahkonen O, Laaksonen M, Karvonen S. The contribution of lone parenthood\nand economic difficulties to smoking. Soc Sci Med 2005;61:211–16.\n29 Inskip HM, Godfrey KM, Robinson SM, et al. Cohort profile: the Southampton\nWomen’s Survey. Int J Epidemiol. Published online first 2005;doi: 10, 1093\/\nije\/dyi202.\n30 Robinson SM, Crozier SR, Borland SE, et al. Impact of educational attainment\non the quality of young women’s diets. Eur J Clin Nutr 2004;58:1174–80.\n31 Rose D, Pevalin DJ, eds. A researcher’s guide to the National Statistics socio-\neconomic classification. London: Sage, 2003.\n32 Thomson R. Dream on: the logic of sexual practice. Journal of Youth Studies\n2000;3:407–27.\n33 Graham H, McDermott E. Qualitative research and the evidence-base of\npolicy: insights from studies of teenage mothers in the UK. J Soc Policy\n2006;35:1.\n34 Pavis S, Cunningham-Burley S. Male youth culture: understanding the context\nof health-related behaviours. Health Educ Res 1999;14:583–96.\n35 Plumridge EW, Fitzgerald LJ, Abel GM. Performing coolness: smoking refusal\nand adolescent identities. Health Educ Res 2002;17:167–79.\n36 Smeeding T. Globalization, inequality and the rich countries of the G-20,\nLuxembourg Income Study Working Paper 330. New York: Maxwell School of\nCitizenship and Public Affairs, Syracuse University, 2002.\n37 Ritakallio V-M. Trends in poverty and income inequality in cross-national\ncomparison. European Journal of Social Security 2002;4:151–77.\n38 Berney LR, Blane DB. Collecting retrospective data: accuracy of recall\nafter 50 years judged against historical records. Soc Sci Med\n1997;45:1519–25.\n39 Patrick DL, Cheadle A, Thompson DC, et al. The validity of self-reported\nsmoking: a review and meta-analysis. Am J Public Health 1994;84:1086–93.\n40 Vartiainen E, Seppa¨la¨ T, Lillsunde P, et al. Validation of self-reported smoking\nby serum cotinine measurement in a community-based study. J Epidemiol\nCommunity Health 2005;56:167–70.\n41 Graham H, Owen O. Are there socioeconomic differentials in under-reporting\nof smoking in pregnancy? Tob Control 2003;12:434–4.\n42 Graham H, Der G. Patterns and predictors of smoking cessation among\nwomen. Health Promot Int 1999;14:231–9.\n43 Jarvis MJ. Patterns and predictors of smoking cessation in the general\npopulation. In: Bolliger CT, Fagerstrom KO, eds. The tobacco epidemic. Basle:\nKarger, 1997:151–64.\n44 Glendinning A, Shucksmith J, Hendry L. Social class and adolescent smoking\nbehaviour. Soc Sci Med 1994;38:1449–60.\n45 Batten L, Graham H, High S, et al. Stage of change, low income and benefit\nstatus: a profile of women’s smoking in early pregnancy. Health Educ J\n1999;58:378–88.\n46 Brenner H, Mielck A. The role of childbirth in smoking cessation. Prev Med\n1993;22:225–36.\n47 Hawkes D, Joshi H, Ward K. Unequal entry to motherhood and unequal starts\nin life: evidence from the first survey of the UK Millenium Cohort, Working\nPaper 6. London: Centre for Longitudinal Studies, Institute of Education, 2004.\n48 Koivusilta L, Rimpela A, Rimpela M. Health related lifestyle in adolescence\npredicts adult educational level. J Epidemiol Community Health\n1998;52:794–801.\n49 Harkness S, Waldfogel J. The family gap in pay: evidence from seven\nindustrialised countries, CASE paper 29. London: Centre for Analysis of Social\nExclusion, London School of Economics, 1999.\n50 Lynch JW, Kaplan GA, Salonen JT. Why do the poor behave poorly?\nVariation in adult health behaviors and psychosocial characteristics by stages\nof the socioeconomic lifecourse. Soc Sci Med 1997;44:809–19.\n51 Barbeau E, Krieger N, Soobader M-J. Working class matters: socioeconomic\ndisadvantage, race\/ethnicity, gender and smoking in NHIS 2000. Am J Public\nHealth 2004;94:269–78.\nSocioeconomic lifecourse influences on women’s smoking status 233\nwww.jech.com\n on 1 April 2008 jech.bmj.comDownloaded from \n"}