{"doi":"10.1017\/S0031182009991466","coreId":"195887","oai":"oai:lra.le.ac.uk:2381\/8014","identifiers":["oai:lra.le.ac.uk:2381\/8014","10.1017\/S0031182009991466"],"title":"The three-spined stickleback-Schistocephalus solidus system: an experimental model for investigating host-parasite interactions in fish","authors":["Barber, Iain","Scharsack, J. P."],"enrichments":{"references":[{"id":44731876,"title":"Modulating the modulators: parasites, neuromodulators and host behavioural change. 650","authors":[],"date":null,"doi":"10.1159\/000067790","raw":"Animal Evolutionary Ecology Group, Institute for Evolution and Biodiversity, University of 5 Münster, Huefferstr. 1, D-48149 Münster, GERMANY 6 Adamo, S. A. (2002). Modulating the modulators: parasites, neuromodulators and host behavioural change. 650 Brain, Behavior and Evolution 60, 370-377. 651 Aeschlimann, P., Häberli, M. and Milinski, M. (2000). Threat-sensitive feeding strategy of immature 652 668. 697 Bell, A. M. (2005). Behavioural differences between individuals and two populations of stickleback 698 (Gasterosteus aculeatus). Journal of Evolutionary Biology 18, 464-473. 699 Bell, A. M. and Stamps, J. A. (2004). Development of behavioural differences between individuals and 700 populations of sticklebacks, Gasterosteus aculeatus. Animal Behaviour 68, 1339-1348. 701 Bell, M. A. and Foster, S. A. (Eds.) (1994). The Evolutionary Biology of the Threespine Stickleback, Oxford 702 University Press, Oxford, UK. 703 Bergersen, R. (1996). Sticklebacks from Greenland. Journal of Fish Biology 48, 799-801. 704 Bråten, T. (1966). Host specificity in Schistocephalus solidus. Parasitology 56, 657-&. 705 Bunnajirakul, S., Steinhagen, D., Hetzel, U., Korting, W. and Drommer, W. (2000). A study of sequential 706 histopathology of Trypanoplasma borreli (Protozoa : Kinetoplastida) in susceptible common carp 707 Cyprinus carpio. Diseases of Aquatic Organisms 39, 221-229. 708 Candolin, U. and Voigt, H. R. (2001). No effect of a parasite on reproduction in stickleback males: a laboratory 709 artefact? Parasitology 122, 457-464. 710 Chappell, L. H. (1969). Parasites of three-spined stickleback Gasterosteus aculeatus L from a Yorkshire Pond 711 .1. Seasonal variation of parasite fauna. Journal of Fish Biology 1, 137-152. 712 Chubb, J. C., Seppala, O., Luscher, A., Milinski, M. and Valtonen, E. T. (2006). Schistocephalus cotti n. sp 713 (Cestoda : Pseudophyllidea) plerocercoids from bullheads Cottus gobio L. in an Arctic river in Finland, 714 with a key to the plerocercoids of the Palaearctic species of the genus. Systematic Parasitology 65, 715 161-170. 716 Clarke, A. S. (1954). Studies on the life cycle of the pseudophyllidean cestode Schistocephalus solidus. 717 Proceedings of the Zoolical Society of London 124, 257–302. 718 Colosimo, P. F., Hosemann, K. E., Balabhadra, S., Villarreal, G., Dickson, M., Grimwood, J., Schmutz, J., 719 Myers, R. M., Schluter, D. and Kingsley, D. M. (2005). Widespread parallel evolution in sticklebacks 720 by repeated fixation of ectodysplasin alleles. Science 307, 1928-1933. 721 Coombs, I. and Crompton, D. W. T. (1991). A guide to human helminths Taylor & Francis Ltd, London. 722 Dantzer, R. (2004). Cytokine-induced sickness behaviour: A neuroimmune response to activation of innate 723 immunity. European Journal of Pharmacology 500, 399-411. 724 Dick, T. L. (1816). Account of the worm with which the stickleback is infested. Annals of Philosophy 7, 106-725 109. 726 Dörücü, M., Wilson, D. and Barber, I. (2007). Differences in adult egg output of Schistocephalus solidus from 727 singly- and multiply-infected sticklebacks. Journal of Parasitology 93, 1521-1523. 728 Engelsma, M. Y., Huising, M. O., Van Muiswinkel, W. B., Flik, G., Kwang, J., Savelkoul, H. F. and 729 Verburg-Van Kemenade, B. M. (2002). Neuroendocrine-immune interactions in fish: a role for 730 interleukin-1. Veterinary Immunology and Immunopathology 87, 467-479. 731 Folstad, I., Hope, A. M., Karter, A. and Skorping, A. (1994). Sexually selected color in male sticklebacks - a 732 signal of both parasite exposure and parasite resistance. Oikos 69, 511-515. 733 French, J. R. P. and Muzzall, P. M. (2008). First report of Schistocephalus sp (Cestoda : pseudophyllidea) in 734 slimy sculpin, Cottus cognatus Richardson, 1836, from Lake Michigan, USA. Comparative 735 Parasitology 75, 132-134. 736 Gibson, G. (2005). The synthesis and evolution of a supermodel. Science 307, 1890-1891. 737 Giles, N. (1983). Behavioral effects of the parasite Schistocephalus solidus (Cestoda) on an intermediate host, 738 the 3-spined stickleback, Gasterosteus aculeatus L. Animal Behaviour 31, 1192-1194. 739 Giles, N. (1987a). A comparison of the behavioral responses of parasitized and non-parasitized 3-spined 740 sticklebacks, Gasterosteus aculeatus L, to progressive hypoxia. Journal of Fish Biology 30, 631-638. 741 Giles, N. (1987b). Predation risk and reduced foraging activity in fish - Experiments with parasitized and non-742 parasitized 3-spined sticklebacks, Gasterosteus aculeatus L. Journal of Fish Biology 31, 37-44. 743 Godin, J. G. J. and Sproul, C. D. (1988). Risk-taking in parasitized sticklebacks under threat of predation - 744 Effects of energetic need and food availability. Canadian Journal of Zoology-Revue Canadienne De 745 Zoologie 66, 2360-2367. 746 Hammerschmidt, K., Koch, K., Milinski, M., Chubb, J. C. and Parker, G. A. (2009). When to go: 747 optimization of host switching in parasites with complex life cycles. Evolution [Epub ahead of print]. 748 Hammerschmidt, K. and Kurtz, J. (2005). Surface carbohydrate composition of a tapeworm in its consecutive 749 intermediate hosts: Individual variation and fitness consequences. International Journal for 750 Parasitology 35, 1499-1507. 751 Hammerschmidt, K. and Kurtz, J. (2007). Schistocephalus solidus: Establishment of tapeworms in 752 sticklebacks - fast food or fast lane? Experimental Parasitology 116, 142-149. 753 Hammerschmidt, K. and Kurtz, J. (2009). Ecological immunology of a tapeworms' interaction with its two 754 consecutive hosts. Advances in Parasitology 68, 111-137. 755 Hart, B. L. (1990). Behavioral adaptations to pathogens and parasites - 5 strategies. Neuroscience and 756 Biobehavioral Reviews 14, 273-294. 757 Hart, B. L. (1992). Behavioral adaptations to parasites - an ethological approach. Journal of Parasitology 78, 758 256-265. 759 Hart, B. L. (1997). Behavoural defence. In Host-parasite evolution: general principle and avian models (eds. 760 Clayton, D. H. & Moore, J.), pp. 59-77. Oxford University Press, Oxford, UK. 761 Heins, D. C. and Baker, J. A. (2008). The stickleback-Schistocephalus host-parasite system as a model for 762 understanding the effect of a macroparasite on host reproduction. Behaviour 145, 625-645. 763 Heins, D. C., Singer, S. S. and Baker, J. A. (1999). Virulence of the cestode Schistocephalus solidus and 764 reproduction in infected threespine stickleback, Gasterosteus aculeatus. Canadian Journal of Zoology-765 Revue Canadienne De Zoologie 77, 1967-1974. 766 Herve, M., Angeli, V., Pinzar, E., Wintjens, R., Faveeuw, C., Narumiya, S., Capron, A., Urade, Y., 767 Capron, M., Riveau, G. and Trottein, F. (2003). Pivotal roles of the parasite PGD(2) synthase and of 768 the host D prostanoid receptor 1 in schistosome immune evasion. European Journal of Immunology 33, 769 2764-2772. 770 Hoberg, E. P., Henny, C. J., Hedstrom, O. R. and Grove, R. A. (1997). Intestinal helminths of river otters 771 (Lutra canadensis) from the Pacific Northwest. Journal of Parasitology 83, 105-110. 772 Hopkins, C. A. and Smyth, J. D. (1951). Notes on the Morphology and Life History of Schistocephalus- 773 Solidus (Cestoda, Diphyllobothriidae). Parasitology 41, 283-&. 774 Hyslop, E. J. and Chubb, J. C. (1983). Schistocephalus pungitii Dubinina, 1959 (Cestoda) in Britain. 775 Parasitology 87, R30-R30. 776 Jäger, I. and Schjørring, S. (2006). Multiple infections: Relatedness and time between infections affect the 777 establishment and growth of the cestode Schistocephalus solidus in its stickleback host. Evolution 60, 778 616-622. 779 Jakobsen, P. J., Johnsen, G. H. and Larsson, P. (1988). Effects of predation risk and parasitism on the feeding 780 ecology, habitat use, and abundance of lacustrine threespine stickleback (Gasterosteus aculeatus). 781 Canadian Journal of Fisheries and Aquatic Sciences 45, 426-431. 782 Jakobsen, P. J. and Wedekind, C. (1998). Copepod reaction to odor stimuli influenced by cestode infection. 783 Behavioral Ecology 9, 414-418. 784 Kennedy, C. R. (1974). Checklist of British and Irish freshwater fish parasites with notes on their distribution. 785 Journal of Fish Biology 6, 613-644. 786 Keymer, A. E. and Read, A. F. (1991). Behavioural ecology: the impact of parasitism. In Parasite–Host 787 Associations, Coexistence or Conflict (eds. Toft, C. A., Aeschlimann, A. & Bolis, L.), Oxford Scientific 788 Publications, Oxford, UK. 789 Kingsley, D. M. (2003). Sequencing the genome of threespine sticklebacks (Gasterosteus aculeatus). In 790 National Human Genome Research Institute White Paper 791 Kingsley, D. M., Zhu, B. L., Osoegawa, K., De Jong, P. J., Schein, J., Marra, M., Peichel, C., Amamiya, C., 792 Schluter, D., Balabhadra, S., Friedlander, B., Cha, Y. M., Dickson, M., Grimwood, J., Schmutz, 793 J., Talbot, W. S. and Myers, R. (2004). New genomic tools for molecular studies of evolutionary 794 change in threespine sticklebacks. Behaviour 141, 1331-1344. 795 Kurtz, J., Kalbe, M., Aeschlimann, P. B., Haberli, M. A., Wegner, K. M., Reusch, T. B. H. and Milinski, 796 M. (2004). Major histocompatibility complex diversity influences parasite resistance and innate 797 immunity in sticklebacks. Proceedings of the Royal Society of London Series B-Biological Sciences 798 271, 197-204. 799 Lafferty, K. D. (1992). Foraging on prey that are modified by parasites. American Naturalist 140, 854-867. 800 Lester, R. J. G. (1971). Influence of Schistocephalus plerocercoids on respiration of Gasterosteus and a possible 801 resulting effect on behavior of fish. Canadian Journal of Zoology 49, 361-366. 802 Lobue, C. P. and Bell, M. A. (1993). Phenotypic manipulation by the cestode parasite Schistocephalus solidus 803 of its intermediate host, Gasterosteus aculeatus, the threespine stickleback. American Naturalist 142, 804 725-735. 805 Loot, G., Giraudel, J. L. and Lek, S. (2002). A non-destructive morphometric technique to predict Ligula 806 intestinalis L. plerocercoid load in roach (Rutilus rutilus L.) abdominal cavity. Ecological Modelling 807 156, 1-11. 808 Luscher, A. and Wedekind, C. (2002). Size-dependent discrimination of mating partners in the simultaneous 809 hermaphroditic cestode Schistocephalus solidus. Behavioral Ecology 13, 254-259. 810 Maccoll, A. D. C. (2009). Parasite burdens differ between sympatric three-spined stickleback species. 811 Ecography 32, 153-160. 812 Macnab, V. L., Katsiadaki, I. and Barber, I. (in press). Reproductive potential of Schistocephalus solidus 813 infected male three-spined stickleback (Gasterosteus aculeatus) from two UK populations. Journal of 814 Fish Biology. 815 Maizels, R. M. and Yazdanbakhsh, M. (2003). Immune regulation by helminth parasites: cellular and 816 molecular mechanisms. Nature Reviews Immunology 3, 733-744. 817 Manning, M. J. (1994). Fishes. In Immunology: a comparative approach (ed. Turner, R. J.), John Willey & 818 Sons, Chichester, New York, USA. 819 Mckinnon, J. S., Mori, S., Blackman, B. K., David, L., Kingsley, D. M., Jamieson, L., Chou, J. and 820 Schluter, D. (2004). Evidence for ecology's role in speciation. Nature 429, 294-298. 821 Mcphail, J. D. and Peacock, S. D. (1983). Some effects of the cestode (Schistocephalus solidus) on 822 reproduction in the threespine stickleback (Gasterosteus aculeatus): Evolutionary aspects of a host-823 parasite interaction. Canadian Journal of Zoology-Revue Canadienne De Zoologie 61, 901-908. 824 Milinski, M. (1984). Parasites determine a predator's optimal feeding strategy. Behavioral Ecology and 825 Sociobiology 15, 35-37. 826 Milinski, M. (1985). Risk of predation of parasitized sticklebacks (Gasterosteus aculeatus L) under competition 827 for food. Behaviour 93, 203-215. 828 Milinski, M. (1990). Parasites and host decision-making. In Parasitism and host behaviour (eds. Barnard, C. J. 829 & Behnke, J. M.), pp. 95-116. Taylor and Francis, London. 830 Milinski, M. and Bakker, T. C. M. (1990). Female sticklebacks use male coloration in mate choice and hence 831 avoid parasitized males. Nature 344, 330-333. 832 Minchella, D. J. (1985). Host life-history variation in response to parasitism. Parasitology 90, 205-216. 833 Ness, J. H. and Foster, S. A. (1999). Parasite-associated phenotype modifications in threespine stickleback. 834 Oikos 85, 127-134. 835 Orr, T. S. C., Hopkins, C. A. and Charles, G. H. (1969). Host specificity and rejection of Schistocephalus 836 solidus. Parasitology 59, 683-&. 837 Östlund -Nilsson, S., Mayer, I. and Huntingford, F. A. (2006). Biology of the three-spined stickleback, CRC 838 Press, Boca Raton. FL. 839 Øverli, O., Páll, M., Borg, B., Jobling, M. and Winberg, S. (2001). Effects of Schistocephalus solidus 840 infection on brain monoaminergic activity in female three-spined sticklebacks Gasterosteus aculeatus. 841 Proceedings of the Royal Society of London Series B-Biological Sciences 268, 1411-1415. 842 Parker, G. A., Ball, M. A., Chubb, J. C., Hammerschmidt, K. and Milinski, M. (2009). When should a 843 trophically transmitted parasite manipulate Its host? Evolution 63, 448-458. 844 Pasternak, A. F., Huntingford, F. A. and Crompton, D. W. T. (1995). Changes in metabolism and behavior 845 of the fresh-water copepod Cyclops strenuus abyssorum Infected with Diphyllobothrium spp. 846 Parasitology 110, 395-399. 847 Peichel, C. L., Nereng, K. S., Ohgi, K. A., Cole, B. L. E., Colosimo, P. F., Buerkle, C. A., Schluter, D. and 848 Kingsley, D. M. (2001). The genetic architecture of divergence between threespine stickleback species. 849 Nature 414, 901-905. 850 Pennycuick, L. (1971). Quantitative effects of three species of parasites on a population of three-spined 851 sticklebacks, Gasterosteus aculeatus. Journal of Zoology 165, 143-162. 852 Poulin, R. (1994). The evolution of parasite manipulation of host behavior - a theoretical analysis. Parasitology 853 109, S109-S118. 854 Ranta, E. (1995). Schistocephalus infestation improves prey-size selection by 3-spined sticklebacks, 855 Gasterosteus aculeatus. Journal of Fish Biology 46, 156-158. 856 Reimchen, T. E. (1997). Parasitism of asymmetrical pelvic phenotypes in stickleback. Canadian Journal of 857 Zoology-Revue Canadienne De Zoologie 75, 2084-2094. 858 Reimchen, T. E. and Nosil, P. (2001). Lateral plate asymmetry, diet and parasitism in threespine stickleback. 859 Journal of Evolutionary Biology 14, 632-645. 860 Rijkers, G. T., Frederixwolters, E. M. H. and Vanmuiswinkel, W. B. (1980). The immune system of cyprinid 861 fish - kinetics and temperature dependence of antibody producing cells in carp (Cyprinus carpio). 862 Immunology 41, 91-97. 863 Rushbrook, B. J. and Barber, I. (2006). Nesting, courtship and kidney hypertrophy in Schistocephalus-infected 864 male three-spined stickleback from an upland lake. Journal of Fish Biology 69, 870-882. 865 Scharsack, J. P., Kalbe, M., Derner, R., Kurtz, J. and Milinski, M. (2004). Modulation of granulocyte 866 responses in three-spined sticklebacks Gasterosteus aculeatus infected with the tapeworm 867 Schistocephalus solidus. Diseases of Aquatic Organisms 59, 141-150. 868 Scharsack, J. P., Koch, K. and Hammerschmidt, K. (2007). Who is in control of the stickleback immune 869 system: interactions between Schistocephalus solidus and its specific vertebrate host. Proceedings of the 870 Royal Society B-Biological Sciences 274, 3151-3158. 871 Seppala, T., Chubb, J. C., Niemela, E. and Valtonen, E. T. (2007). Introduced bullheads Cottus gobio and 872 infection with plerocercoids of Schistocephalus cotti in the Utsjoki, an Arctic river in Finland. Journal 873 of Fish Biology 70, 1865-1876. 874 Shapiro, M. D., Bell, M. A. and Kingsley, D. M. (2006). Parallel genetic origins of pelvic reduction in 875 vertebrates. Proceedings of the National Academy of Sciences of the United States of America 103, 876 13753-13758. 877 Shapiro, M. D., Marks, M. E., Peichel, C. L., Blackman, B. K., Nereng, K. S., Jonsson, B., Schluter, D. and 878 Kingsley, D. M. (2004). Genetic and developmental basis of evolutionary pelvic reduction in threespine 879 sticklebacks. Nature 428, 717-723. 880 Smyth, J. D. (1946). Studies on tapeworm physiology. I. The cultivation of Schistocephalus solidus in vitro. 881 Journal of Experimental Biology 23, 47-70. 882 Smyth, J. D. (1947). The physiology of tapeworms. Biological Reviews 22, 214-238. 883 Smyth, J. D. (1990). In vitro cultivation of parasitic helminths CRC Press, Boca Raton, FL. 884 Smyth, J. D. and Mcmanus, D. P. (1989). The physiology and biochemisty of cestodes, Cambridge University 885 Press, Cambridge. 886 Takizawa, F., Araki, K., Kobayashi, I., Moritomo, T., Ototake, M. and Nakanishi, T. (2008a). Molecular 887 cloning and expression analysis of T-bet in ginbuna crucian carp (Carassius auratus langsdorfii). 888 Molecular Immunology 45, 127-136. 889 Takizawa, F., Mizunaga, Y., Araki, K., Moritomo, T., Ototake, M. and Nakanishi, T. (2008b). GATA3 890 mRNA in ginbuna crucian carp (Carassius auratus langsdorfii): cDNA cloning, splice variants and 891 expression analysis. Developmental and Comparative Immunology 32, 898-907. 892 Thomas, F., Adamo, S. and Moore, J. (2005). Parasitic manipulation: where are we and where should we go? 893 Behavioural Processes 68, 185-199. 894 Tierney, J. F. (1994). Effects of Schistocephalus solidus (Cestoda) on the food intake and diet of the three-895 spined stickleback, Gasterosteus aculeatus. Journal of Fish Biology 44, 731-735. 896 Tierney, J. F. and Crompton, D. W. T. (1992). Infectivity of plerocercoids of Schistocephalus solidus 897 (Cestoda, Ligulidae) and fecundity of the adults in an experimental definitive host, Gallus gallus. 898 Journal of Parasitology 78, 1049-1054. 899 Tierney, J. F., Huntingford, F. A. and Crompton, D. W. T. (1993). The relationship between infectivity of 900 Schistocephalus solidus (Cestoda) and antipredator behavior of its intermediate host, the three-spined 901 stickleback, Gasterosteus aculeatus. Animal Behaviour 46, 603-605. 902 Tierney, J. F., Huntingford, F. A. and Crompton, D. W. T. (1996). Body condition and reproductive status in 903 sticklebacks exposed to a single wave of Schistocephalus solidus infection. Journal of Fish Biology 49, 904 483-493. 905 Urdal, K., Tierney, J. F. and Jakobsen, P. J. (1995). The tapeworm Schistocephalus solidus alters the activity 906 and response, but not the predation susceptibility of infected copepods. Journal of Parasitology 81, 907 330-333. 908 Vanmuiswinkel, W. B. (1995). The piscine immune system: innate and acquired immunity. In Fish Diseases 909 and Disorders. Volume 1, Protozoan and Metazoan Infections (ed. Woo, P. T. K.), pp. 729-750. CAB 910 International, Wallingford, UK. 911 Vollmer-Conna, U. (2001). Acute sickness behaviour: an immune system-to-brain communication? 912 Psychological Medicine 31, 761-767. 913 Walkey, M. and Meakins, R. H. (1970). An attempt to balance energy budget of a host-parasite system. 914 Journal of Fish Biology 2, 361-372. 915 Wang, L. J., Cao, Y. and Shi, H. N. (2008). Helminth infections and intestinal inflammation. World Journal of 916 Gastroenterology 14, 5125-5132. 917 Wedekind, C. (1997). The infectivity, growth, and virulence of the cestode Schistocephalus solidus in its first 918 intermediate host, the copepod Macrocyclops albidus. Parasitology 115, 317-324. 919 Wedekind, C. and Little, T. J. (2004). The clearance of hidden cestode infection triggered by an independent 920 activation of host defense in a teleost fish. Journal of Parasitology 90, 1329-1331. 921 Wedekind, C. and Milinski, M. (1996). Do three-spined sticklebacks avoid consuming copepods, the first 922 intermediate host of Schistocephalus solidus? An experimental analysis of behavioural resistance. 923 Parasitology 112, 371-383. 924 Wegner, K. M., Kalbe, M., Kurtz, J., Reusch, T. B. H. and Milinski, M. (2003). Parasite selection for 925 immunogenetic optimality. Science 301, 1343-1343. 926 Wootton, R. J. (1976). The biology of the sticklebacks Academic Press, London 927 Wootton, R. J. (1984). A functional biology of sticklebacks, University of California Press, Berkeley, CA. 928 Wright, H. A., Wootton, R. J. and Barber, I. (2006). The effect of Schistocephalus solidus infection on meal 929 size of three-spined stickleback. Journal of Fish Biology 68, 801-809. 930 Wright, H. A., Wootton, R. J. and Barber, I. (2007). Compensatory growth in threespine sticklebacks 931 (Gasterosteus aculeatus) inhibited by experimental Schistocephalus infection. Canadian Journal of 932 Fisheries and Aquatic Sciences 64, 819-826. 933","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-03","abstract":"Plerocercoids of the pseudophyllidean cestode Schistocephalus solidus infect the three-spined stickleback Gasterosteus aculeatus, with important consequences for the biology of host fish. Techniques for culturing the parasite in vitro and generating infective stages that can be used to infect sticklebacks experimentally have been developed, and the system is increasingly used as a laboratory model for investigating aspects of host-parasite interactions. Recent experimental laboratory studies have focused on the immune responses of hosts to infection, the consequences of infection for the growth and reproductive development of host fish and the effects of infection on host behaviour. Here we introduce the host and the parasite, review the major findings of these recent experimental infection studies and identify further aspects of host parasite interactions that might be investigated using the system","downloadUrl":"http:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=7293024#.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/8014\/3\/BarberScharsack_final.pdf","pdfHashValue":"0cbd9c0c70c92e5da6f2b027cb05631e7e5d0713","publisher":"Cambridge University Press (CUP)","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/8014<\/identifier><datestamp>\n                2015-12-14T16:59:34Z<\/datestamp><setSpec>\n                com_2381_74<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_75<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nThe three-spined stickleback-Schistocephalus solidus system: an experimental model for investigating host-parasite interactions in fish<\/dc:title><dc:creator>\nBarber, Iain<\/dc:creator><dc:creator>\nScharsack, J. P.<\/dc:creator><dc:description>\nPlerocercoids of the pseudophyllidean cestode Schistocephalus solidus infect the three-spined stickleback Gasterosteus aculeatus, with important consequences for the biology of host fish. Techniques for culturing the parasite in vitro and generating infective stages that can be used to infect sticklebacks experimentally have been developed, and the system is increasingly used as a laboratory model for investigating aspects of host-parasite interactions. Recent experimental laboratory studies have focused on the immune responses of hosts to infection, the consequences of infection for the growth and reproductive development of host fish and the effects of infection on host behaviour. Here we introduce the host and the parasite, review the major findings of these recent experimental infection studies and identify further aspects of host parasite interactions that might be investigated using the system.<\/dc:description><dc:date>\n2010-06-08T14:53:58Z<\/dc:date><dc:date>\n2010-06-08T14:53:58Z<\/dc:date><dc:date>\n2010-03<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nParasitology, 2010, 137 (Special Issue 3), pp. 411-424.<\/dc:identifier><dc:identifier>\n0031-1820<\/dc:identifier><dc:identifier>\nhttp:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=7293024&fileId=S0031182009991466<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/8014<\/dc:identifier><dc:identifier>\n10.1017\/S0031182009991466<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis is the author's final draft of the paper published as Parasitology, 2010, 137 (Special Issue 3), pp. 411-424.  The final version is available from http:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=7293024#.  Doi: 10.1017\/S0031182009991466<\/dc:rights><dc:publisher>\nCambridge University Press (CUP)<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0031-1820","0031-1820"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article"],"fullText":" 1 \nThe three-spined stickleback - Schistocephalus solidus system: 1 \nan experimental model for investigating host-parasite interactions in fish 2 \n \nI. Barber\n1\n* & J. P. Scharsack\n2\n 3 \n \n1 \nDepartment of Biology, University of Leicester, University Road, Leicester LE1 7RH, UK 4 \n2 \nAnimal Evolutionary Ecology Group, Institute for Evolution and Biodiversity, University of 5 \nMünster, Huefferstr. 1, D-48149 Münster, GERMANY 6 \n 7 \n \n*Corresponding author, email: ib50@le.ac.uk, phone: +44(0)116 252 3462, fax: +44(0)116 8 \n252 3330 9 \n \n10 \n 2 \nSUMMARY 11 \nPlerocercoids of the pseudophyllidean cestode Schistocephalus solidus infect three-spined 12 \nstickleback Gasterosteus aculeatus, with important consequences for the biology of host fish. 13 \nTechniques for culturing the parasite in vitro and generating infective stages that can be used 14 \nto experimentally infect sticklebacks have been developed, and the system is increasingly 15 \nused as a laboratory model for investigating aspects of host-parasite interactions. Recent 16 \nexperimental laboratory studies have focused on the immune responses of hosts to infection, 17 \nthe consequences of infection for the growth and reproductive development of host fish and 18 \nthe effects of infection on host behaviour. Here we introduce the host and the parasite, review 19 \nthe major findings of these recent experimental infection studies and identify further aspects 20 \nof host parasite interactions that might be investigated using the system. 21 \n 22 \n 23 \nKey words: threespine, Cestoda, Pseudophyllidea, laboratory model, growth, immunology, 24 \nLigula intestinalis, behaviour, fitness 25 \n26 \n 3 \nINTRODUCTION 27 \nPlerocercoids of the pseudophyllidean cestode Schistocephalus solidus are common parasites 28 \nof three-spined sticklebacks Gasterosteus aculeatus in freshwater and brackish habitats 29 \nthroughout the geographical range of the fish. The three-spined stickleback-S. solidus host-30 \nparasite system has become an important model in experimental parasitology and is 31 \nincreasingly used to investigate a wide range of questions about host-parasite interactions and 32 \nco-evolution. Here we present a review of recent studies that have used controlled 33 \nexperimental infections to investigate host-parasite interactions in this system. 34 \nWe begin our review with background information on the parasite’s lifecycle, on the host fish 35 \nand the ‘typical’ phenotype of infected sticklebacks in nature, and briefly discuss emerging 36 \nvariation in infection phenotype. We then examine how aspects of the life cycle can be 37 \nexperimentally manipulated in the lab to allow experimental infections of sticklebacks to be 38 \nundertaken. The remainder of our review focuses on how experimental infection studies have 39 \nbeen used to illuminate host-parasite interactions in the stickleback-S. solidus system, 40 \nincluding the immune responses of the fish host, the energetic consequences of infection and 41 \nthe consequences of infections for fish behaviour and fitness. 42 \n 43 \nLife cycle of S. solidus in nature 44 \nSchistocephalus solidus is a trophically transmitted pseudophyllidean cestode with a three-45 \nhost life cycle. The definitive host can be any warm-blooded vertebrate; most typically these 46 \nare fish-eating birds though other endotherms can harbour adult worms, including otters 47 \n(Hoberg et al., 1997) and – though presumably only rarely – humans (Coombs and Crompton, 48 \n1991). Schistocephalus solidus does not grow in the gut of the definitive host but undergoes 49 \nthe final stages of sexual maturation there, reproducing sexually either by selfing (if singly 50 \ninfected) or by cross-fertilization (in multiple infections). Eggs released into the water with 51 \n 4 \nthe bird’s faeces hatch to produce free-swimming coracidia that are transmitted trophically to 52 \na wide range of cyclopoid copepods, the 1\nst\n intermediate hosts. Here the parasites develop in 53 \nthe copepod haemocoel into procercoids, becoming infective to three-spined sticklebacks, the 54 \nobligatory specific 2\nnd\n intermediate hosts (Bråten, 1966), with the formation of a hooked 55 \ncercomer. Sticklebacks acquire infections when they feed on parasitized copepods, and in the 56 \nstickleback digestive tract infective procercoids shed their outer layer, together with the 57 \ncercomer, and penetrate the wall of the intestine. The parasite then develops into a 58 \nplerocercoid, which grows to a large size in the fish host’s body cavity. The life cycle is 59 \ncompleted when sticklebacks harbouring infective plerocercoids are ingested by a definitive 60 \nhost (Clarke, 1954). 61 \nThe geographical distribution of the parasite is limited by the distribution of the only obligate 62 \nhost in the life cycle, the three-spined stickleback, which is restricted to the Northern 63 \nhemisphere and occurs around the margins of the Atlantic and Pacific Oceans (Bell and 64 \nFoster, 1994). In this geographical region S. solidus is a regular parasite of three-spined 65 \nstickleback populations inhabiting freshwater and brackish ecosystems, and is most common 66 \nfound in those in lacustrine or slow flowing habitats (Kennedy, 1974; Wootton, 1976; Barber, 67 \n2007). 68 \n  69 \nSpecificity of stickleback host 70 \nThree-spined sticklebacks are the only recognised fish host of S. solidus, although other 71 \nSchistocephalus spp. infect nine-spined stickleback Pungitius pungitius and sculpins (Hyslop 72 \nand Chubb, 1983; Chubb et al., 2006; Seppala et al., 2007; French and Muzzall, 2008). 73 \nExperimental exposure of nine-spined sticklebacks (Pungitius pungitius) to infective stages of 74 \nS. solidus led to much slower plerocercoid growth and infections were cleared after 14 days, 75 \nwhile plerocercoids kept on growing in three-spined sticklebacks (Orr et al., 1969). 76 \n 5 \nHeterotransplants of S. solidus plerocercoids from G. aculeatus to other species of fish 77 \n(Cottus gobio, Nemacheilus barbatula, Phoxinus phoxinus, Salmo trutta, Coregonus 78 \nclupeoides, Perca fluviatilis, Rutilus rutilus, Esox lucius), including P. pungitius, died within 79 \n2-10 days after transfer, while homotransplants between G. aculeatus survived (Bråten 1966). 80 \nThese observations indicate that in principle S. solidus plerocercoids can be cleared by a fish 81 \nimmune system, but obviously S. solidus plerocercoids are able to avoid an effective immune 82 \nresponse in G. aculeatus, their specific second intermediate host.   83 \n 84 \nSticklebacks as experimental model hosts 85 \nA major attraction of the stickleback-S. solidus host-parasite system for ecological and 86 \nevolutionary biologists is the rich history of studies investigating the natural history, 87 \nbehaviour and evolutionary biology of the host fish, and a correspondingly substantial 88 \nliterature that has been regularly and thoroughly reviewed (Wootton, 1976; Wootton, 1984; 89 \nBell and Foster, 1994; Östlund -Nilsson et al., 2006). This background permits a wide range 90 \nof ecologically and evolutionarily relevant questions to be addressed. Furthermore, the three-91 \nspined stickleback has, in recent years, assumed even more importance as a model species in 92 \nbiology; the publication of linkage and chromosome maps (Peichel et al., 2001; Kingsley et 93 \nal., 2004) and the sequencing of its genome (Kingsley, 2003) has greatly enhanced its utility 94 \nin molecular studies of evolution and development (McKinnon et al., 2004; Shapiro et al., 95 \n2004; Colosimo et al., 2005; Gibson, 2005; Shapiro et al., 2006). Sticklebacks are also readily 96 \nbred in laboratory aquaria (Barber and Arnott, 2000), facilitating the challenge of naïve 97 \nindividuals and thus fulfilling both scientific and local ethical requirements for experimental 98 \ninfection studies. 99 \n 100 \nField studies of S. solidus infected sticklebacks 101 \n 6 \nA number of studies have examined S. solidus infection prevalence and intensity in natural 102 \nstickleback populations, and the phenotype (including the appearance, energetic condition, 103 \nreproductive capacity and behaviour) of naturally infected sticklebacks has been well 104 \ndocumented. Observations on the phenotype of infected fish from populations where S. 105 \nsolidus is endemic are summarised in Table 1. The proportion of fish harbouring infections 106 \ncan be extremely high, in some cases approaching 100% (Dick, 1816; Smyth, 1947; Hopkins 107 \nand Smyth, 1951), but this varies considerably between populations (MacColl, 2009), and 108 \ntemporally within them (Chappell, 1969). Typical features of classical ‘schistocephalosis’ 109 \ninclude characteristic distension of the fish’s abdomen, an altered swimming gait, increased 110 \nrisk-taking behaviour, reduced body condition and functional (if not physiological) castration. 111 \nHowever, as more host populations are studied it is becoming clear that there is significant 112 \nvariation in infection phenotype, and there are a number of exceptions to these ‘typical’ 113 \ninfection phenotypes. Notably, intensive studies of some Alaskan populations suggest that the 114 \ntraditional view of S. solidus as an absolute castrator of female sticklebacks may need to be 115 \nrevised (Heins and Baker, 2008), and in a small number of populations infection is 116 \nadditionally associated with almost complete demelanisation (Lobue and Bell, 1993; Ness and 117 \nFoster, 1999). 118 \n 119 \nIn vitro culture of S. solidus  120 \nPioneering work by the parasite physiologist J.D. Smyth in the 1940-50s developed protocols 121 \nfor the in vitro culture of adult helminths, including S. solidus (Smyth, 1946; Smyth and 122 \nMcManus, 1989; Smyth, 1990). In brief, plerocercoids recovered from infected sticklebacks 123 \nare removed and placed into sterilised culture vessels containing a buffered medium that 124 \nprovides a suitable physico-chemical environment for parasite development (such as horse 125 \nserum and \/ or a cell culture medium such as RPMI-1640). Antibiotics may be added to 126 \n 7 \nreduce contamination. The plerocercoid(s) are not placed directly into the medium but are 127 \ninstead constrained within narrow diameter semi-permeable dialysis tubing, which mimics the 128 \nsmall intestine of the definitive host and provides the constriction needed for successful 129 \nfertilisation (Smyth, 1990). Culture vessels are placed into a water bath set to 40ºC and 130 \nshaken gently to aid the dissolution of metabolic products from developing worms. Due to the 131 \nprogenetic development of pseudophyllidean plerocercoids, sexual maturation occurs rapidly 132 \nand within 48h the adult worms begin producing eggs. The fact that S. solidus attains its final 133 \nsize in the fish body cavity and matures so rapidly to the adult form made it possible for the 134 \nfirst time to maintain adult cestodes under sterile experimental conditions and undertake 135 \ndetailed physiological studies. Such studies had been impossible with most other tapeworm 136 \nspecies, which typically grow and mature over prolonged time periods in the host intestine, 137 \nand S. solidus became an extremely valuable model in parasite physiology (Smyth and 138 \nMcManus, 1989). 139 \nUsing Smyth’s techniques – or slightly modified versions of them – large numbers of 140 \neggs can be generated and hatched to yield coracidia, which in turn can be used to infect lab-141 \nbred copepods (Wedekind, 1997). After a period of development to the infective cercomer-142 \nbearing stage, procercoids can be fed to sticklebacks inside infected copepods, either by 143 \ngavage or by natural feeding, to generate experimentally infected fish hosts and allowing 144 \ndetailed experimental studies of fish-parasite interactions. 145 \n 146 \n 147 \nMECHANISMS OF RESISTING S. SOLIDUS INFECTION: HOST BEHAVIOUR, 148 \nIMMUNE RESPONSES AND HOST MANIPULATION 149 \nAnimals have evolved three major types of mechanisms to avoid, or reduce the likelihood of 150 \ndeveloping, debilitating parasite infections; behavioural mechanisms that limit contact with 151 \n 8 \ninfectious agents, physical barriers to invasive stages and immune systems. The ability to 152 \nexperimentally infect intermediate hosts in large numbers means that it is possible to examine 153 \nthe responses of hosts to controlled, experimental challenge. In recent years, experimental 154 \ninfection studies have been used to examine both behavioural and immunological aspects of 155 \nstickleback responses to infective stages of S. solidus. 156 \n 157 \nBehavioural resistance 158 \nThe strong selection pressure placed on host organisms to avoid debilitating parasite 159 \ninfections, together with the typically high costs of mounting immune responses against 160 \ninvading pathogens, has led to the evolution of a wide range of strategies of behavioural 161 \nresistance in animals (Hart, 1990; Hart, 1992; Hart, 1997). For parasites that are transmitted 162 \ntrophically between hosts, avoiding infected prey intuitively reduces the level of exposure to 163 \ninfection, but this requires that infected prey are identifiable, and that the benefits of avoiding 164 \nparasitized prey outweigh the costs of ignoring them. In some cases, feeding on parasitized 165 \nprey that are easy to catch may benefit potential hosts if the risks of becoming infected, and\/or 166 \nthe costs of infection, are low (Lafferty, 1992).  167 \nCopepods infected with procercoids of S. solidus and other related pseudophyllidean cestodes 168 \nbehave differently to those that are non-infected, providing the potential for avoidance by 169 \ndiscriminating fish. However, the behaviours that are altered by infection – which include 170 \nactivity patterns, swimming ability and responses to disturbance – make infected copepods 171 \nmore susceptible to human ‘predators’ armed with pipettes (Pasternak et al., 1995; Urdal et 172 \nal., 1995; Wedekind and Milinski, 1996) and so potentially make them more visible to, and \/ 173 \nor more easily caught by, fish predators. Infected copepods have also been reported to 174 \nactively approach sticklebacks (Jakobsen and Wedekind, 1998). It is therefore likely that 175 \nbehaviour changes in infected copepods are adaptations of the parasite to facilitate 176 \n 9 \ntransmission (Parker et al., 2009), and recent evidence examining temporal aspects of their 177 \nbehaviour change supports this (Hammerschmidt et al., 2009; Hammerschmidt and Kurtz, 178 \n2009). So do sticklebacks avoid eating infected copepods? The results of two critical 179 \nexperimental tests suggest that sticklebacks have no behavioural defence against S. solidus, 180 \nand may even feed on infected copepods preferentially (Urdal et al., 1995; Wedekind and 181 \nMilinski, 1996). However, there is still further work to be done in this area. One possibility 182 \nfor the apparent non-evolution of avoidance behaviour is that sticklebacks are simply unable 183 \nto discriminate infected from non-infected copepods, so avoiding infection would mean 184 \nexcluding an important prey type, which is just too costly. Also, because few tests have been 185 \ncarried out, it is not known whether all populations are equally non-discriminating, or whether 186 \nsome populations have evolved to be more selective in their prey choice. Further, individual 187 \nsticklebacks are known to vary in key personality traits (Bell and Stamps, 2004; Bell, 2005) 188 \nso are all individuals within populations as likely as others to approach infected copepods, or 189 \ndo fish exhibiting particular personality types suffer increased exposure? Because the 190 \nprobability of acquiring infections after feeding appears to be relatively high (at least in 191 \nlaboratory studies, see below), and the consequences of infections are typically severe, it 192 \nseems unlikely that feeding on more easily caught infected copepods could be beneficial to 193 \nsticklebacks. However, it is possible that wild fish develop better immune responses than 194 \nthose reared under sterile laboratory conditions and face a lower risk of infection per infective 195 \nstage ingested, reducing the pressure to evolve discrimination (see also Hammerschmidt and 196 \nKurtz, 2009). 197 \nThe presence of debilitating parasites in the environment can also drive the evolution of mate 198 \npreferences, either by the avoidance of mates harbouring directly transmissible parasites, or 199 \nby the selection of individuals with genes that confer parasite resistance on offspring (Keymer 200 \nand Read, 1991; Andersson, 1994). In sticklebacks, preferences for males with the brightest 201 \nred nuptial colouration have evolved at least in part as a mechanism for avoiding parasitised 202 \n 10 \nmales (Milinski and Bakker, 1990; Bakker and Milinski, 1991). To test the hypothesis that 203 \nfemales selecting brightly ornamented males gain indirect genetic benefits by producing more 204 \nresistant offspring, Barber et al. (2001) produced clutches of maternal half-sibling fish that 205 \ndiffered only the brightness of the male parent, and exposed them to infective S. solidus 206 \nprocercoids. The results showed that male brightness significantly affected the proportion of 207 \nhalf-sibships that developed infections, with brighter males producing the most resistant 208 \noffspring, suggesting indirect benefits of ornamentation based mate choice. 209 \n 210 \nDynamics of S. solidus transmission from copepods to sticklebacks 211 \nInteractions of S. solidus with its first intermediate copepod host were recently reviewed in 212 \ndetail by Hammerschmidt and Kurtz (2009). With no strong evidence that sticklebacks are 213 \ncapable of adopting behaviours to avoid ingesting infected copepods, those in populations 214 \nwith endemic infection are likely to be exposed regularly to infective S. solidus procercoids. 215 \nAfter the ingestion of a S. solidus infected copepod the prey is digested in the stomach and 216 \nprocercoids are released from copepod tissues. Procercoids retain their outer layer – which is 217 \nrich in PNA-binding sugars (GalNac, D-galactose) – in the stickleback stomach, and 218 \npresumably this protects the parasite from enzymatic digestion (Hammerschmidt and Kurtz, 219 \n2007). During passage through the stomach, the outer layer is shed (or digested) together with 220 \nthe cercomer and in the intestine the underlying tegument with microtriches is exposed. 221 \nTypically for vertebrate cell surfaces this cuticle is rich in sialic acid residues, which may help 222 \nthe parasite evade the stickleback’s immune system (Hammerschmidt and Kurtz, 2005). From 223 \nthe intestine, the parasites penetrate the gut wall and enter the body cavity. 224 \nThe period from ingestion to establishment in the stickleback body cavity is critically 225 \nimportant in determining infection success, with 50-75% of ingested parasites failing to 226 \ncomplete this phase (Hammerschmidt and Kurtz, 2007). In an experimental infection 227 \n 11 \nexperiment, the majority (>90%) of parasites recovered from sticklebacks were alive in the 228 \nstomach 16h post-exposure (p-e). After 22h p-e, approximately 40% were still alive in the 229 \nstomach, 40% had entered the body cavity and about 20% of parasites recovered (by 230 \ndissection and histological analysis) were dead. By 24h p-e, the majority (>90%) of detectable 231 \nparasites were alive in the body cavity whereas dead or damaged parasites were no longer 232 \ndetectable, presumably due to progressing degradation in the digestive tract (Hammerschmidt 233 \nand Kurtz, 2007). This indicates that parasites are vulnerable to the aggressive environment in 234 \nthe digestive tract after losing their outer layer, and progression to the intestine and passage 235 \nthrough the gut wall must be achieved quickly to avoid significant losses in viability. In terms 236 \nof preventing S. solidus establishment, the relative contribution of hostile conditions in the 237 \nfish digestive tract and the host immune system is difficult to estimate; however, no 238 \nattachment of phagocytic cells to, or encapsulation of, S. solidus stages during gut wall 239 \npenetration or in the body cavity was observed (Hammerschmidt and Kurtz, 2007). 240 \nThere is little evidence yet for a prominent reduction of S. solidus viability once the body 241 \ncavity is reached (i.e. clearance by the immune system). In another infection experiment, 242 \nrelatively few dead parasites (n = 4) were found in the body cavity of infected sticklebacks at 243 \n7d and 17d p-e, while 78 S. solidus plerocercoids were recovered alive after these times 244 \n(Scharsack et al., 2007). During this experiment, infection rates changed from >60% at 7d and 245 \n17d p-e to approximately 50% after 27-67d p-e (Scharsack et al., 2007). This suggests that 246 \nwhile clearance of S. solidus plerocercoids in the body cavity is possible during early stages 247 \nof infection it occurs less frequently later on. 248 \nStimulation of immunity soon after S. solidus infection seems to reduce the infection success 249 \nof S. solidus. Wedekind & Little (2004) triggered activation of the host immune system by 250 \ntissues injury through spine clipping at 7d p-e to S. solidus. At 90d p-e, the spine-clipped 251 \nsticklebacks showed significantly lower infection rates compared to controls without spine 252 \n 12 \nclipping (Wedekind and Little, 2004). At which time plerocercoids were cleared was not 253 \nrecorded in this study, but the results might indicate that immune stimulation was most 254 \nefficient in the early (1-2w) stage of infection, when S. solidus is still vulnerable to immune 255 \nattack. 256 \n 257 \nLymphatic organs and leukocytes during S. solidus infection Responses from different 258 \nimmunologically active organs have been recorded in sticklebacks infected experimentally 259 \nwith S. solidus. The spleens of S. solidus infected sticklebacks were enlarged compared to non 260 \ninfected fish (Arnott et al., 2000). Enlargement of the spleen is often observed during parasite 261 \ninfections of fish, e.g. in common carp Cyprinus carpio infected with the blood flagellate 262 \nTrypanoplasma borreli, due to proliferation of leukocytes and increased amounts of antigen-263 \nantibody immune complexes, which are removed from the blood stream by spleen 264 \nmacrophages (Bunnajirakul et al., 2000). In the stickleback-S. solidus system, specific reasons 265 \nfor the enlargement of spleens are to date unclear and await further investigation. In the blood 266 \nof S. solidus infected sticklebacks, distinct changes of leukocyte subsets have been observed. 267 \nEarly in the infection the proportion of granulocytes increased, while the proportion of 268 \nlymphocytes decreased in the peripheral blood, with both trends levelling out after 60-96d p-e 269 \n(Scharsack et al., 2004). The offspring of more brightly ornamented male sticklebacks 270 \nshowed elevated white blood cell counts and were less susceptible to S. solidus infection 271 \n(Barber et al., 2001). These observations suggest that peripheral blood leukocytes may indeed 272 \nplay a role in the S. solidus infection, but the underlying mechanisms are not yet well 273 \nunderstood. Most information about leukocyte responses to S. solidus has been generated 274 \nfrom experiments with stickleback head kidney leukocytes (see later). To date, limited 275 \ninformation is available on the interplay of lymphatic tissues during S. solidus infection, in 276 \nparticular the role of (cellular) immune defence at the site of infection, the body cavity. 277 \n 13 \nHowever, because the teleost head kidney is a site of antigen presentation, leukocyte 278 \nactivation, proliferation and maturation - and consequently interacts closely with 279 \nimmunological activity in the periphery (Manning, 1994; VanMuiswinkel, 1995) - 280 \ninformation derived from head kidney leukocyte studies can be regarded as representative for 281 \nimmune activity in the periphery, even if specific interactions at the site of infection might 282 \nremain concealed. 283 \n 284 \nCellular innate immunity 285 \nRespiratory burst and monocyte proliferation The respiratory burst activity of head kidney 286 \nleukocytes (HKL) is one of the most important mechanisms of cellular innate immunity, so 287 \nmay be expected to be up-regulated at an early stage in exposed sticklebacks. However, the 288 \nHKL respiratory burst from S. solidus exposed sticklebacks 7-37d after an experimental 289 \nchallenge did not differ from that of sham-exposed controls, suggesting the mechanism is not 290 \nimportant in early defence against infection (Scharsack et al., 2007). Interestingly, the 291 \nrespiratory burst of HKLs was up-regulated from 47-67d p-e, but as neither the survival nor 292 \nthe growth rates of S. solidus plerocercoids were affected during this period this appears to be 293 \nan ineffective defence mechanism.  294 \nNevertheless, the proliferation of head kidney monocytes – a component of the cellular innate 295 \nimmune response – was up-regulated among exposed sticklebacks at 7d p-e, suggesting that 296 \nthe mobilisation of monocytes could play a role in early defence against S. solidus. Among 297 \nfish that developed infections, monocyte proliferation dropped then below sham-exposed 298 \ncontrols at 17 d p-e, recovered and dropped again, indicating possible immune-manipulation 299 \nby S. solidus (Scharsack et al., 2007) (see later). Interestingly the kinetics of monocyte 300 \nproliferation in exposed fish that did not develop infections followed a similar pattern, 301 \nsuggesting an early priming of monocyte responses. 302 \n 14 \n 303 \nMonocyte manipulation? The idea that S. solidus is capable of substantially manipulating 304 \nstickleback monocyte responses is supported by in vitro experiments. Monocytic leucocytes 305 \n(granulocytes and macrophages) isolated from the head kidney of experimentally infected 306 \nsticklebacks at 45d p-e failed to respond to S. solidus antigens in vitro (Scharsack et al., 307 \n2004). This was not a general anergy, as monocytes from the same sticklebacks responded to 308 \nstimulation with a non-specific antigen (poke weed mitogen, PWM) in a comparable manner 309 \nas cells from sham-exposed controls (Scharsack et al., 2004). Thus S. solidus does not appear 310 \nto immune-compromise its stickleback host, but is apparently capable of manipulating 311 \n(evading) immune traits that are specifically directed against parasite antigens.  312 \n 313 \nImmune priming and susceptibility Priming of the immune system by S. solidus does not 314 \ninduce resistance in G. aculeatus, as super infections are possible by sequential exposures (i.e. 315 \nthere is no ‘vaccination effect’). Experimentally infected nine-spined sticklebacks (Pungitius 316 \npungitius) have been shown to reject S. solidus plerocercoids more rapidly after pre-exposure 317 \nto the parasite (Orr et al., 1969). However, S. solidus plerocercoids were not able to survive in 318 \nP. pungitius longer than 14d (Orr et al. 1966). Detailed analysis of infections harboured by 319 \nthree-spined sticklebacks that had been sequentially exposed to S. solidus showed that 320 \nplerocercoids from later exposures survived better and grew larger than ‘pioneering’ worms 321 \n(Jäger and Schjørring, 2006). These results include exposures where only the secondary S. 322 \nsolidus survived and may be explained by the first invading worm paying higher costs of 323 \nimmune manipulation \/ priming (Jäger and Schjørring, 2006).  324 \nThese findings, together with the observation that priming of monocytes is detectable in 325 \nexposed sticklebacks that do not develop infections (Scharsack et al., 2007) and the loss of 326 \nresponsiveness of monocytes to (secondary) in vitro exposure to S. solidus antigens 327 \n 15 \n(Scharsack et al., 2004), suggest that S. solidus has a strong impact on the stickleback 328 \nimmune system. Immune priming, initiated to protect the invading parasite from host immune 329 \nattack, seems to be so efficient that it persists even if the first invader is cleared, facilitating 330 \nthe establishment of subsequent infections.  331 \nTo what extent immune priming by S. solidus can influence susceptibility of sticklebacks to 332 \nother parasites has not yet been experimentally investigated. In populations with endemic S. 333 \nsolidus infection, fish harbouring plerocercoids tend to be more heavily infected by 334 \nGyrodactylus sp. parasites than those free from S. solidus (M. Kalbe, personal 335 \ncommunication). Experimental exposure of S. solidus infected sticklebacks to other parasites 336 \ncould reveal the extent to which S. solidus can influence susceptibility to additional parasites. 337 \n 338 \nAdaptive immunity 339 \nClearance of S. solidus infection seems to depend mainly on an early innate immune response, 340 \npotentially facilitated by previous exposure of the parasite to the aggressive environment in 341 \nthe digestive tract. An adaptive immune response - including the presence of specific 342 \nantibodies - would need about 2-3 weeks to be fully in place in fish maintained at 18°C 343 \n(Rijkers et al., 1980). Thus substantial involvement of antibody-mediated immunity in early 344 \ndefence against invading S. solidus is unlikely, and since clearance of infection at later stages 345 \n(beyond 17d p-e) was not observed, antibody-mediated responses to S. solidus infection are 346 \nnot expected to make a significant contribution. However, due to the lack of specific tools 347 \nsuch responses have not yet been fully investigated. 348 \n 349 \nLymphocyte activation Nevertheless, in a kinetics study of immune parameters following 350 \nexposure to S. solidus, the proliferation of lymphocytes (B- and T-cells) was measured in 351 \nhead kidney isolates. The clonal expansion and proliferation of lymphocytes forms a 352 \n 16 \nsignificant component of the adaptive immune response and is expected 1-4 weeks after 353 \ninfection. In S. solidus infected sticklebacks, significant changes in lymphocyte proliferation, 354 \ncompared to sham exposed controls, were only observed among exposed fish that did not 355 \ndevelop infections. Among these fish, lymphocyte proliferation was elevated at 7d p-e, 356 \ndropped below controls at 17d p-e before returning to control values from 27 to 67d p-e 357 \n(Scharsack et al., 2004). (A less prominent and statistically non-significant pattern was 358 \nrecorded among sticklebacks that developed infections). The pattern of lymphocyte 359 \nproliferation among exposed sticklebacks that did not become infected suggests a possible 360 \nrole in defence against S. solidus. Since lymphocyte proliferation dipped below controls at 361 \n17d p-e, B-cell proliferation and production of antibodies (T-helper cell 2 - Th2 mediated 362 \nhumoral immunity) is unlikely. Early lymphocyte proliferation might alternatively be 363 \nexplained by the proliferation of T-cells, maintaining a Th1 response that activates cellular 364 \nimmunity. This corresponds to the observation that monocyte proliferation was regulated 365 \ncontemporarily (see Scharsack et al. 2007). 366 \n 367 \nPotential role of the Th1-Th2 system? In mammals, helminth parasites are considered a 368 \nclassical inducer of Th2 responses, which have the potential to damage parasites and clear 369 \ninfections (Maizels and Yazdanbakhsh, 2003; Wang et al., 2008). However, the nature of 370 \ninteractions between helminth parasites and the Th1-Th2 system remains controversial 371 \n(Maizels and Yazdanbakhsh, 2003); for example, schistosomes appear to have evolved 372 \nimmune evasion strategies in which the Th1-Th2 system is driven towards a Th1 response, 373 \nthereby avoiding humoral responses (Herve et al., 2003). 374 \nInformation on Th1-Th2 mediated immune function in teleost fish is scarce, but molecular 375 \nstudies indicate that the Th1-Th2 system is at least present (Takizawa et al., 2008a; Takizawa 376 \net al., 2008b). The available information does not point towards a typical Th2 response in S. 377 \n 17 \nsolidus infected stickleback, as lymphocyte proliferation after an initial weak increase 378 \nremained unaffected (Scharsack et al., 2007) and degenerative changes at the surface of 379 \nprocercoids (as a result of a Th2 induced humoral response) were not detected by means of 380 \nelectron microscopy (Orr et al., 1969). The extent to which protection against S. solidus 381 \ninfections in stickleback hosts might involve a Th1 response (or an abrogated Th2 response) 382 \ntherefore requires further investigation. 383 \n 384 \nThe MHC and influences on plerocercoid growth Overall, adaptive immunity seems unlikely 385 \nto protect three-spined sticklebacks from S. solidus infection, but there is evidence that it can 386 \nrestrict parasite growth during ongoing infection. Proteins of the major histocompatibility 387 \ncomplex (MHC) play a central role in presenting antigens to the adaptive immune system. 388 \nUsing three-spined sticklebacks that varied in their individual MHC class IIB allelic diversity, 389 \nKurtz et al. (2004) observed that S. solidus grew larger in sticklebacks with low and high 390 \nMHC diversity compared with those having an intermediate number of MHC alleles. The 391 \nunderlying molecular mechanism is unknown, but these results support observations that 392 \nsticklebacks with intermediate (optimal) MHC IIB diversity suffered less from parasite 393 \ninfections compared to fish with high and low (suboptimal) MHC IIB diversity (Wegner et 394 \nal., 2003). 395 \n 396 \nSummary: innate and adaptive immunity 397 \nClearance of S. solidus by the immune system of its specific second intermediate host, the 398 \nthree-spined stickleback, appears to be the exception rather than the rule. Damage to the 399 \nparasite by the aggressive gut environment might reduce the infection success at least as 400 \nprominently as attack by the immune system. S. solidus does not appear to be very vulnerable 401 \nto immune attack, but rather appears to be capable of substantial immune evasion and 402 \n 18 \nmanipulation. The typically rapid death of plerocercoids following experimental transfer to 403 \nfish species other than three-spined sticklebacks (Bråten, 1966; Orr et al., 1969) strongly 404 \nsuggests that fish immune systems can, in principle, clear S. solidus infections. It therefore 405 \nseems most likely that specific adaptation of S. solidus to the immune system of the three-406 \nspined stickleback permits its invulnerability to host immune responses. From an evolutionary 407 \nperspective, adaptation to a host immune system is costly and balancing selection on S. 408 \nsolidus has resulted in an extremely high degree of specialisation towards a three-spined 409 \nstickleback host. 410 \nThe results on immune responses of stickleback against S. solidus described here are mainly 411 \nderived from laboratory experiments. In the wild, S. solidus infection success and 412 \ndevelopment in sticklebacks might be constrained by factors acting on the host immune 413 \nsystem, such as activation of the immune system by pre-exposure to other parasites, and by 414 \nother environmental stressors, both natural and anthropogenic.  415 \n 416 \nIMPACTS OF EXPERIMENTAL S. SOLIDUS INFECTIONS ON HOST ENERGETICS 417 \nAND BEHAVIOUR 418 \nSchistocephalus solidus infections are expected to impact host energetics and behaviour of 419 \nhost sticklebacks for two main reasons. First, plerocercoids grow to a large size and – because 420 \nthe nutrients to fuel this growth are entirely host-derived – this incurs a considerable energetic 421 \nburden on host fish (Walkey and Meakins, 1970; Lester, 1971). Second, the parasite relies on 422 \nthe ingestion of the stickleback host to complete its life cycle, facilitating the evolution of 423 \nparasite adaptations that increase the predation risk of host sticklebacks. A number of studies 424 \nhave quantified infection-associated variation in stickleback energetics and behaviour among 425 \nfish from naturally infected populations. Experimental infection studies allow a number of 426 \nfitness correlates to be measured under standardised conditions.  427 \n 19 \n 428 \nEffects of experimental infections on host energetics, growth and sexual development 429 \nLaboratory investigations of the impact of S. solidus on the growth and development of 430 \nstickleback hosts have been the subject of a recent review (Barber et al., 2008), so here we 431 \nprovide an overview of the major findings of these studies and outline future approaches and 432 \npotentially research questions. 433 \nIn naturally infected populations, fish infected with S. solidus typically exhibit low growth 434 \nand poor body condition, and as a result – in most studied populations at least – they suffer 435 \nreduced sexual development and are unlikely to participate successfully in spawning (Arme 436 \nand Owen, 1967; Pennycuick, 1971; Tierney et al., 1996; Bagamian et al., 2004; Heins and 437 \nBaker, 2008). However, when naturally or experimentally-infected fish are maintained under 438 \nlaboratory conditions such effects are less frequently observed, often because ethical guidance 439 \non animal husbandry requires fish to experience benign environments, with access to 440 \nabundant, high quality food. The growth and energetic condition of infected fish can even 441 \nexceed that of non-infected individuals under certain types of lab housing. 442 \n 443 \nExperimental studies of fish held under benign conditions Barber & Svensson (2003) 444 \nexperimentally exposed lab-bred juvenile sticklebacks to single infective procercoids and held 445 \nthem under a constant host ration of 8% body mass per day. Following, the length of infected 446 \nsticklebacks followed approximately the same trajectory of non-exposed, control fish over the 447 \n16-week p-e period. The mass of infected fish (including plerocercoid mass) also followed a 448 \nsimilar trajectory to controls, with infected fish actually showing elevated growth rates during 449 \nweeks 5-7 p-e. However, when the mass contributed by developing plerocercoids was 450 \nremoved, the trajectory of mass increase of infected fish clearly differed from that of controls, 451 \nand infected fish weighed significantly less at the end of the experiment. On dissection, 452 \n 20 \ninfected females were found to have equivalent liver mass, but lower perivisceral fat reserves 453 \nand, surprisingly, larger ovaries than non-exposed control fish. One explanation for the 454 \ncounterintuitive investment in gonad development is that it may reflect a life history change 455 \nthat could compensate for the likely reduction in survival associated with infection 456 \n(Minchella, 1985). 457 \nOther studies under similarly benign conditions have recorded a similar lack of detectable 458 \nimpact of the parasite on host growth. In a recent infection experiment sticklebacks were fed 459 \nad libitum with frozen chironomids 3 times a week. Here, the mass of infected stickleback 460 \nincluding parasite mass was significantly higher at 57 and 67d p-e compared to controls, but 461 \nequally high with parasite mass subtracted (Koch, Scharsack, Hammerschmidt, unpublished 462 \ndata). In a study by Arnott et al. (2000), experimentally infected fish were held individually 463 \nand fed ad libitum to excess each day. Under these conditions, infected sticklebacks outgrew 464 \nnon-infected fish, weighing significantly more than the latter at the end of the study even 465 \nwhen correcting for plerocercoid mass. Infected female fish (though not males) held under 466 \nthese conditions also developed significantly larger livers relative to their body size, and they 467 \nhad an equivalent amount of perivisceral fat to fish that did not develop infections after 468 \nexposure. 469 \n 470 \nExperimental studies of fish held under more naturalistic conditions The results describesd 471 \nabove suggest that the feeding regime experienced by hosts has considerable influence on the 472 \nenergetic costs of infection experience by host fish, and hence the phenotype exhibited by S. 473 \nsolidus infection. Synthesising the results from a number of lab studies, Barber et al. (2008) 474 \nshowed that infection phenotypes more closely reflecting those found in natural populations, 475 \nwere more commonly found when experimentally infected fish are reared under less benign 476 \nconditions in the lab. For example, when housing exposed and non-exposed sticklebacks 477 \n 21 \ntogether in groups, effectively forcing competition between infection classes, Barber (2005) 478 \nfound the relative liver mass (hepatosomatic index, HSI) to be significantly reduced among 479 \nexperimentally-infected, compared to sham-exposed, females. Wright et al (2007) examined 480 \nthe effect of temporary food restriction on the growth and energetics of sticklebacks 481 \nexperimentally infected with S. solidus. In contrast to sham-exposed sticklebacks – which 482 \nundertook rapid compensatory growth on commencement of ad libitum feeding to catch up to 483 \nthe mass of continually-fed fish after only three weeks of re-feeding – experimentally infected 484 \nsticklebacks showed only partial compensation, reaching just 80% of the mass of continually-485 \nfed infected fish after six weeks of re-feeding. Infected fish reared under the compensatory 486 \nregime also developed smaller livers than sham-exposed ‘compensatory’ fish, whereas 487 \ninfection status did not affect liver size among fish held under a continual feeding regime. 488 \nAnalysis of the food intake of individual fish revealed that the likely cause of the inability of 489 \ninfected fish to compensate was their failure to mount significant hyperphagic responses post-490 \ndeprivation (Wright et al., 2007). A subsequent study confirmed that the maximum voluntary 491 \nmeal size of infected fish was reduced in infected sticklebacks (Wright et al., 2006). Because 492 \nfish in natural environments, with temporally unpredictable food availability, are expected to 493 \nrely heavily on compensatory growth responses, the inability to undertake such responses 494 \nmay exacerbate the growth effects of S. solidus and represent a hitherto ‘hidden cost’ of 495 \ninfection. 496 \nThe goal of laboratory investigations of the stickleback-S. solidus system is generally to better 497 \nunderstand the selective role that parasites play in nature, so it is becoming increasingly clear 498 \nthat investigating the growth and development effects of S. solidus in lab studies presents 499 \ncertain challenges. However, at the same time there is an urgent need to better understand 500 \nhow parasites and hosts interact under altered environments. A possible way in which 501 \nlaboratory studies of the stickleback-S. solidus system could contribute considerably to our 502 \nunderstanding of host-parasite interactions in nature is to investigate the role of variation in 503 \n 22 \nthe rearing environment experienced. To date few studies have systematically investigated 504 \nsuch effects, but the effects of factors such as temperature, food availability and other 505 \nenvironmental stressors (including pollutants) could readily be examined in an experimental 506 \nframework. 507 \n 508 \nBehavioural effects of infection 509 \nInfection associated behavioural variation among wild-caught fish A number of authors have 510 \ncompared the behaviour of wild caught sticklebacks naturally infected with S. solidus with 511 \nnon-infected fish from the same population. These studies have identified a wide range of 512 \nbehaviours in which individual variation is associated with infection status, including shoaling 513 \nbehaviour (Barber and Huntingford, 1995; Barber et al., 1995; Barber et al., 1998) 514 \nantipredator and risk-taking behaviour (Giles, 1983; Milinski, 1985; Giles, 1987b; Giles, 515 \n1987a; Godin and Sproul, 1988; Tierney et al., 1993; Ness and Foster, 1999), prey choice 516 \n(Milinski, 1984; Ranta, 1995) and competitive ability (Barber and Ruxton, 1998). In many 517 \ncases behaviour studies are carried out to investigate hypotheses about the basis of altered 518 \nbehaviour, and specifically whether they may constitute examples of host ‘manipulation’ by 519 \nparasites (Poulin, 1994). However although the results of these studies often suggest adaptive 520 \nmanipulation by parasites, such an approach can only ever produce correlational data, as 521 \ninfection status is not imposed experimentally. Alternative explanations, including the 522 \npossibility that pre-existing behavioural variation influences exposure to infections, or 523 \nunderlying ‘quality’ factors that impact both susceptibility to infection and behaviour, mean 524 \nthat experimental infection studies are needed to unambiguously assign causality. 525 \n 526 \nBehaviour change in experimentally infected fish In contrast to studies of wild-caught, 527 \nnaturally infected sticklebacks, relatively few have examined the behaviour in experimentally 528 \n 23 \ninfected sticklebacks. Aeschlimann et al. (2000) tested the risk taking behaviour of 529 \nexperimentally infected sticklebacks under threat of predation by pike Esox lucius during the 530 \nearly phase of infection before the parasite was infective to the definitive host. The aim of the 531 \nstudy was to examine whether experimentally infected fish increased their risk-taking 532 \nbehaviour in order to maximise food intake, to reach sexual maturity early in an attempt to 533 \nreduce the fitness impacts of infection. The results showed that during these early stages of 534 \ninfection, when host behaviour was predicted to reflect host responses to infection rather than 535 \nbeing influenced by ‘manipulative’ parasites, there was no effect of infection status on the 536 \npropensity to taking risks whilst foraging. This suggests that infected fish do not respond to 537 \ninfection by exploiting risky yet available prey, and is consistent with the finding that 538 \nincreased food intake actually appears to benefit parasites as well as hosts (Barber, 2005). 539 \nStudies of naturally and experimentally infected sticklebacks suggest that reduced predator 540 \navoidance behaviour is typically shown when fish harbour either a high burden (parasite 541 \nindex > 25%) of S. solidus (Milinski, 1984; Milinski, 1985) or when parasite mass exceeds 542 \n50mg (Tierney et al., 1993), but not during early stages of infection (Aeschlimann et al., 543 \n2000). Given the fact that 50mg appears to be the threshold mass for successful production of 544 \nfertile eggs in the avian host (Tierney and Crompton, 1992), these observations are consistent 545 \nwith adaptive manipulation of behaviour. To examine this more closely, Barber et al. (2004) 546 \nexperimentally infected juvenile sticklebacks and used image analysis to track parasite growth 547 \nalongside behavioural analysis of host escape responses over a 16 week p-e period. Reduced 548 \nantipredator behaviour responses to a heron model were only observed in experimentally 549 \ninfected fish once plerocercoids had reached an estimated mass of 50mg, corroborating 550 \nobservational studies of the behaviour of naturally infected stickleback. This was the first 551 \nstudy to use experimentally infected sticklebacks to demonstrate that S. solidus was 552 \nresponsible for the observed changes in behaviour. 553 \n 24 \n 554 \nPotential for laboratory artefacts in behavioural studies However, extrapolating results from 555 \nexperimental lab studies to the field situation may again be difficult, as benign laboratory 556 \nconditions can also affect the behaviours exhibited by S. solidus infected sticklebacks. 557 \nCandolin and Voigt (2001) captured nest-holding males from a population in which 26% of 558 \nmales harboured S. solidus and showed that nest holders were almost exclusively (33\/35) non-559 \ninfected. They then transferred naturally infected fish to the lab, and found that after a 7d 560 \nperiod of ad libitum feeding, with access to nesting territory and materials, most infected fish 561 \nreadily built nests and courted females. Schistocephalus solidus therefore appears to have 562 \ninfluenced reproductive performance of males in this population indirectly, by reducing the 563 \nability of host sticklebacks to gain access to resources (food, territory, nesting material etc) 564 \nessential for successful reproduction. There also appears to be population variation in the 565 \ncapacity to reverse the effects of infection under lab housing, with naturally infected males 566 \nfrom different populations being differentially capable of reproductive behaviour following a 567 \nperiod of benign housing (Rushbrook and Barber, 2006; Macnab et al., in press). 568 \n 569 \nManipulation of host behaviour: potential role of the immune system 570 \nReduced predator avoidance behaviour in the stickleback-S. solidus system is thought to be 571 \ncaused by increased concentrations of monoamine neurotransmitters in neuronal tissues of the 572 \nbrain in S. solidus infected sticklebacks (Øverli et al., 2001). Whether the neuronal changes 573 \nare a consequence of changes in energy or endocrine status of the fish or are induced directly 574 \nby the parasite, for instance by the release of a neuroactive substance is unclear. However, 575 \nchanges in neuroendocrine status are consistent with a chronic stress response in infected fish, 576 \nwhich could be, among other stressors, the result of an immune response (Øverli et al., 2001).  577 \n 25 \nInvestigations of immune kinetics in S. solidus infected sticklebacks, detailed in section 2.3 578 \nabove, reveal distinct changes in immune parameters during the period of parasite growth that 579 \ncorresponds with host behaviour change, when the parasites had passed the 50mg threshold 580 \nweight between 40-60d p-e. Nonetheless, effects on parasite survival and fitness were not 581 \nobserved and plerocercoids kept on growing to attain 150mg at 67d p-e (Scharsack et al., 582 \n2007) and about 200mg by 98d p-e (Scharsack et al., 2004). As immune responses are 583 \npresumably very costly for the host, but do not appear to have any effects on the parasite 584 \nsurvival at this late stage of infection, one possible explanation for the observed pattern is that 585 \nS. solidus – on attaining an infective size – triggers the stickleback immune system (in a 586 \n‘controlled’ manner that is not harmful for the parasite) to interfere with the crosstalk between 587 \nneuro-endocrine system and immune system to induce reduced predation avoidance behaviour 588 \nof its stickleback host (Scharsack et al., 2007). A second explanation could be that S. solidus 589 \ninteracts directly with the neuro-endocrine system and that the observed changes in immune 590 \nparameters are side effects of a host stress response. However, stress responses generally 591 \nresult in a broad (ubiquitous) activation of immunity, to which S. solidus is apparently 592 \nvulnerable (Wedekind and Little, 2004; see above). The survival and growth of S. solidus 593 \nplerocercoids relies on their ability to control the stickleback immune system, which would be 594 \nmore costly to maintain in a stress-induced activation of several immune traits, instead of 595 \nsingle immune traits manipulated specifically by the parasite.  596 \nDue to the complex interactions between immunity and nervous system, it is difficult to 597 \ndistinguish whether a parasite directly or indirectly manipulates its host behaviour (Milinski, 598 \n1990; Adamo, 2002; Thomas et al., 2005). In mammals the crosstalk between the immune 599 \nresponse and brain is known as acute sickness behaviour, where behavioural changes that are 600 \nassociated with acute infections are typically immunologically mediated (Vollmer-Conna, 601 \n2001). For the S. solidus infection of sticklebacks, the exact mechanism responsible for 602 \ntranslating the immune signal into a neural signal is still unclear, but it is well established in 603 \n 26 \nteleosts and mammals that activation of innate immunity interferes with the neuro-endocrine 604 \nsystem (Engelsma et al., 2002; Dantzer, 2004). The observed changes in leukocyte responses 605 \nduring late infection with S. solidus could thus lead to the neuronal changes, which induce 606 \nbehavioural modifications of the stickleback and so elegantly enhance parasite transmission to 607 \nthe final host (Scharsack et al., 2007) 608 \n 609 \nSTUDIES OF IN VIVO PARASITE GROWTH AND FITNESS 610 \nThe large size of S. solidus plerocercoids relative to their stickleback hosts, and the 611 \nsubsequent distension of the host body cavity that is associated with infection, provides a 612 \nuseful tool to examine the growth of plerocercoids in vivo. The degree of distension caused by 613 \nsuch parasites can be accurately measured using digital photography and image analysis 614 \nsoftware and converted into an estimate of plerocercoid mass (Barber, 1997; Loot et al., 2002; 615 \nBarber and Svensson, 2003), enabling plerocercoid growth to be examined non-invasively 616 \nover the post-infection period. If fish are fed singly-infected copepods then the mass of 617 \nindividual plerocercoids can be tracked. This approach enabled Barber & Svensson (2003) to 618 \nconstruct the growth curve for plerocercoids infecting stickleback hosts fed on a fixed ration 619 \nof 8%bw.d-1 and could be of considerable value in future studies designed to establish the 620 \nimpacts of host environmental factors on plerocercoid performance. 621 \nFurthermore, the ability to sexually mature the worms recovered from sticklebacks and collect 622 \ndata on adult fecundity makes it possible to examine the effects of host rearing environments 623 \nand plerocercoid growth history on the fecundity of adult parasites (Dörücü et al., 2007) as 624 \nwell as providing useful models for investigating egg production strategies, mate choice and 625 \nthe ‘hermaphrodite’s dilemma’ (Luscher and Wedekind, 2002). 626 \n  627 \nCONCLUSIONS 628 \n 27 \nIn many ways S. solidus plerocercoids are unusual parasites; their typically extreme body size 629 \nrelative to the stickleback host is a dominant feature of infection that is not often observed in 630 \nother host-parasite systems. It is likely that some of the effects of the parasites on stickleback 631 \nhosts will be rather specific to this and a limited number of other systems that involve large 632 \nbodied parasites, such as Ligula intestinalis infections of cyprinid fish, Spirometra 633 \nmansonoides infections of mammals and some invertebrate-parasitoid systems. On the other 634 \nhand, S. solidus exhibits features common to many ecologically important parasites, such as 635 \nan indirect life cycle with trophic transmission and the potential to affect host growth, 636 \nreproduction and survival. The great utility of the system lies in three key attributes; the 637 \ntypically important consequences that infections have for host performance, the ready 638 \navailability of experimental infection techniques and the fact that the host fish is an extremely 639 \nwell characterised model organism. These attributes combine to facilitate experimental 640 \ninvestigations into the role of parasites as agents of selection in host populations. 641 \n 642 \n 643 \nAcknowledgements 644 \nWe are grateful to the editor and two anonymous referees for constructive, insightful 645 \ncomments on the manuscript.646 \n 28 \nTable I. Selected field studies documenting traits associated with Schistocephalus solidus infection in natural stickleback populations 647 \nAspect of stickleback \nbiology studied Infection-associated trait Reference \nNutritional condition Infected fish had reduced body condition in the spring and autumn (Tierney et al., 1996) \n Infected fish had reduced stomach fullness and fed on smaller prey (Tierney et al., 1996) \n Seasonal differences in stomach fullness and diet composition of infected and \nnon-infected fish \n(Bergersen, 1996) \n Infected fish had reduced body condition and liver energy reserves (Tierney, 1994) \nSexual development  Infected females showed reduced gonad development (Arme and Owen, 1967) \n Infected females were less likely to be gravid (Heins et al., 1999) \n Infected males developed less red nuptial coloration (McPhail and Peacock, 1983) \nBehaviour Infected males were less likely to hold nests (Folstad et al., 1994) \n Infected fish found further from cover in autumn (Candolin and Voigt, 2001) \nMorphology Infected fish had less symmetric lateral plate counts (Jakobsen et al., 1988) \n Adults with asymmetric pelvis had increased incidence of infection (pattern \nreversed in 0+ fish). \n(Reimchen and Nosil, 2001) \n Skin of infected fish was demelanised (Reimchen, 1997) \n 29 \nReferences 648 \n 649 \nAdamo, S. A. (2002). Modulating the modulators: parasites, neuromodulators and host behavioural change. 650 \nBrain, Behavior and Evolution 60,  370-377. 651 \nAeschlimann, P., Häberli, M. and Milinski, M. (2000). Threat-sensitive feeding strategy of immature 652 \nsticklebacks (Gasterosteus aculeatus) in response to recent experimental infection with the cestode 653 \nSchistocephalus solidus. Behavioral Ecology and Sociobiology 49,  1-7. 654 \nAndersson, M. (1994). Sexual selection, Princeton University Press, Princeton. 655 \nArme, C. and Owen, R. W. (1967). Infections of 3-spined stickleback Gasterosteus aculeatus L with 656 \nplerocercoid larvae of Schistocephalus solidus (Müller 1776) with special reference to pathological 657 \neffects. Parasitology 57,  301-304. 658 \nArnott, S. A., Barber, I. and Huntingford, F. A. (2000). Parasite-associated growth enhancement in a fish-659 \ncestode system. Proceedings of the Royal Society of London Series B-Biological Sciences 267,  657-660 \n663. 661 \nBagamian, K. H., Heins, D. C. and Baker, J. A. (2004). Body condition and reproductive capacity of three-662 \nspined stickleback infected with the cestode Schistocephalus solidus. Journal of Fish Biology 64,  1568-663 \n1576. 664 \nBakker, T. C. M. and Milinski, M. (1991). The advantages of being red - sexual selection in the stickleback. In 665 \nConference on Behavioural Ecology of Fishes pp. 287-300. Erice, Italy. 666 \nBarber, I. (1997). A non-invasive morphometric technique for estimating cestode plerocercoid burden in small 667 \nfreshwater fish. Journal of Fish Biology 51,  654-658. 668 \nBarber, I. (2005). Parasites grow larger in faster growing fish hosts. International Journal for Parasitology 35,  669 \n137-143. 670 \nBarber, I. (2007). Host–parasite interactions of the three-spined stickleback. In Biology of the Three-Spined 671 \nStickleback (eds. Östlund-Nilsson, S., Mayer, I. & Huntingford, F. A.), pp. 271-318. CRC Press, Boca 672 \nRaton, FL. 673 \nBarber, I. and Arnott, S. A. (2000). Split-clutch IVF: A technique to examine indirect fitness consequences of 674 \nmate preferences in sticklebacks. Behaviour 137,  1129-1140. 675 \nBarber, I., Arnott, S. A., Braithwaite, V. A., Andrew, J. and Huntingford, F. A. (2001). Indirect fitness 676 \nconsequences of mate choice in sticklebacks: offspring of brighter males grow slowly but resist 677 \n 30 \nparasitic infections. Proceedings of the Royal Society of London Series B-Biological Sciences 268,  71-678 \n76. 679 \nBarber, I., Downey, L. C. and Braithwaite, V. A. (1998). Parasitism, oddity and the mechanism of shoal 680 \nchoice. Journal of Fish Biology 53,  1365-1368. 681 \nBarber, I. and Huntingford, F. A. (1995). The effect of Schistocephalus solidus (Cestoda: Pseudophyllidea) on 682 \nthe foraging and shoaling behaviour of three-spined sticklebacks, Gasterosteus aculeatus. Behaviour 683 \n132,  1223-1240. 684 \nBarber, I., Huntingford, F. A. and Crompton, D. W. T. (1995). The effect of hunger and cestode parasitism 685 \non the shoaling decisions of small fresh-water fish. Journal of Fish Biology 47,  524-536. 686 \nBarber, I. and Ruxton, G. D. (1998). Temporal prey distribution affects the competitive ability of parasitized 687 \nsticklebacks. Animal Behaviour 56,  1477-1483. 688 \nBarber, I. and Svensson, P. A. (2003). Effects of experimental Schistocephalus solidus infections on growth, 689 \nmorphology and sexual development of female three-spined sticklebacks, Gasterosteus aculeatus. 690 \nParasitology 126,  359-367. 691 \nBarber, I., Walker, P. and Svensson, P. A. (2004). Behavioural responses to simulated avian predation in 692 \nfemale three spined sticklebacks: The effect of experimental Schistocephalus solidus infections. 693 \nBehaviour 141,  1425-1440. 694 \nBarber, I., Wright, H., Arnott, S. and Wootton, R. (2008). Growth and energetics in the stickleback–695 \nSchistocephalus host–parasite system: a review of experimental infection studies. Behaviour 145,  647-696 \n668. 697 \nBell, A. M. (2005). Behavioural differences between individuals and two populations of stickleback 698 \n(Gasterosteus aculeatus). Journal of Evolutionary Biology 18,  464-473. 699 \nBell, A. M. and Stamps, J. A. (2004). Development of behavioural differences between individuals and 700 \npopulations of sticklebacks, Gasterosteus aculeatus. Animal Behaviour 68,  1339-1348. 701 \nBell, M. A. and Foster, S. A. (Eds.) (1994). The Evolutionary Biology of the Threespine Stickleback, Oxford 702 \nUniversity Press, Oxford, UK. 703 \nBergersen, R. (1996). Sticklebacks from Greenland. Journal of Fish Biology 48,  799-801. 704 \nBråten, T. (1966). Host specificity in Schistocephalus solidus. Parasitology 56,  657-&. 705 \nBunnajirakul, S., Steinhagen, D., Hetzel, U., Korting, W. and Drommer, W. (2000). A study of sequential 706 \nhistopathology of Trypanoplasma borreli (Protozoa : Kinetoplastida) in susceptible common carp 707 \nCyprinus carpio. Diseases of Aquatic Organisms 39,  221-229. 708 \n 31 \nCandolin, U. and Voigt, H. R. (2001). No effect of a parasite on reproduction in stickleback males: a laboratory 709 \nartefact? Parasitology 122,  457-464. 710 \nChappell, L. H. (1969). Parasites of three-spined stickleback Gasterosteus aculeatus L from a Yorkshire Pond 711 \n.1. Seasonal variation of parasite fauna. Journal of Fish Biology 1,  137-152. 712 \nChubb, J. C., Seppala, O., Luscher, A., Milinski, M. and Valtonen, E. T. (2006). Schistocephalus cotti n. sp 713 \n(Cestoda : Pseudophyllidea) plerocercoids from bullheads Cottus gobio L. in an Arctic river in Finland, 714 \nwith a key to the plerocercoids of the Palaearctic species of the genus. Systematic Parasitology 65,  715 \n161-170. 716 \nClarke, A. S. (1954). Studies on the life cycle of the pseudophyllidean cestode Schistocephalus solidus. 717 \nProceedings of the Zoolical Society of London 124,  257–302. 718 \nColosimo, P. F., Hosemann, K. E., Balabhadra, S., Villarreal, G., Dickson, M., Grimwood, J., Schmutz, J., 719 \nMyers, R. M., Schluter, D. and Kingsley, D. M. (2005). Widespread parallel evolution in sticklebacks 720 \nby repeated fixation of ectodysplasin alleles. Science 307,  1928-1933. 721 \nCoombs, I. and Crompton, D. W. T. (1991). A guide to human helminths Taylor & Francis Ltd, London. 722 \nDantzer, R. (2004). Cytokine-induced sickness behaviour: A neuroimmune response to activation of innate 723 \nimmunity. European Journal of Pharmacology 500,  399-411. 724 \nDick, T. L. (1816). Account of the worm with which the stickleback is infested. Annals of Philosophy 7,  106-725 \n109. 726 \nDörücü, M., Wilson, D. and Barber, I. (2007). Differences in adult egg output of Schistocephalus solidus from 727 \nsingly- and multiply-infected sticklebacks. Journal of Parasitology 93,  1521-1523. 728 \nEngelsma, M. Y., Huising, M. O., Van Muiswinkel, W. B., Flik, G., Kwang, J., Savelkoul, H. F. and 729 \nVerburg-Van Kemenade, B. M. (2002). Neuroendocrine-immune interactions in fish: a role for 730 \ninterleukin-1. Veterinary Immunology and Immunopathology 87,  467-479. 731 \nFolstad, I., Hope, A. M., Karter, A. and Skorping, A. (1994). Sexually selected color in male sticklebacks - a 732 \nsignal of both parasite exposure and parasite resistance. Oikos 69,  511-515. 733 \nFrench, J. R. P. and Muzzall, P. M. (2008). First report of Schistocephalus sp (Cestoda : pseudophyllidea) in 734 \nslimy sculpin, Cottus cognatus Richardson, 1836, from Lake Michigan, USA. Comparative 735 \nParasitology 75,  132-134. 736 \nGibson, G. (2005). The synthesis and evolution of a supermodel. Science 307,  1890-1891. 737 \nGiles, N. (1983). Behavioral effects of the parasite Schistocephalus solidus (Cestoda) on an intermediate host, 738 \nthe 3-spined stickleback, Gasterosteus aculeatus L. Animal Behaviour 31,  1192-1194. 739 \n 32 \nGiles, N. (1987a). A comparison of the behavioral responses of parasitized and non-parasitized 3-spined 740 \nsticklebacks, Gasterosteus aculeatus L, to progressive hypoxia. Journal of Fish Biology 30,  631-638. 741 \nGiles, N. (1987b). Predation risk and reduced foraging activity in fish - Experiments with parasitized and non-742 \nparasitized 3-spined sticklebacks, Gasterosteus aculeatus L. Journal of Fish Biology 31,  37-44. 743 \nGodin, J. G. J. and Sproul, C. D. (1988). Risk-taking in parasitized sticklebacks under threat of predation - 744 \nEffects of energetic need and food availability. Canadian Journal of Zoology-Revue Canadienne De 745 \nZoologie 66,  2360-2367. 746 \nHammerschmidt, K., Koch, K., Milinski, M., Chubb, J. C. and Parker, G. A. (2009). When to go: 747 \noptimization of host switching in parasites with complex life cycles. Evolution [Epub ahead of print]. 748 \nHammerschmidt, K. and Kurtz, J. (2005). Surface carbohydrate composition of a tapeworm in its consecutive 749 \nintermediate hosts: Individual variation and fitness consequences. International Journal for 750 \nParasitology 35,  1499-1507. 751 \nHammerschmidt, K. and Kurtz, J. (2007). Schistocephalus solidus: Establishment of tapeworms in 752 \nsticklebacks - fast food or fast lane? Experimental Parasitology 116,  142-149. 753 \nHammerschmidt, K. and Kurtz, J. (2009). Ecological immunology of a tapeworms' interaction with its two 754 \nconsecutive hosts. Advances in Parasitology 68,  111-137. 755 \nHart, B. L. (1990). Behavioral adaptations to pathogens and parasites - 5 strategies. Neuroscience and 756 \nBiobehavioral Reviews 14,  273-294. 757 \nHart, B. L. (1992). Behavioral adaptations to parasites - an ethological approach. Journal of Parasitology 78,  758 \n256-265. 759 \nHart, B. L. (1997). Behavoural defence. In Host-parasite evolution: general principle and avian models (eds. 760 \nClayton, D. H. & Moore, J.), pp. 59-77. Oxford University Press, Oxford, UK. 761 \nHeins, D. C. and Baker, J. A. (2008). The stickleback-Schistocephalus host-parasite system as a model for 762 \nunderstanding the effect of a macroparasite on host reproduction. Behaviour 145,  625-645. 763 \nHeins, D. C., Singer, S. S. and Baker, J. A. (1999). Virulence of the cestode Schistocephalus solidus and 764 \nreproduction in infected threespine stickleback, Gasterosteus aculeatus. Canadian Journal of Zoology-765 \nRevue Canadienne De Zoologie 77,  1967-1974. 766 \nHerve, M., Angeli, V., Pinzar, E., Wintjens, R., Faveeuw, C., Narumiya, S., Capron, A., Urade, Y., 767 \nCapron, M., Riveau, G. and Trottein, F. (2003). Pivotal roles of the parasite PGD(2) synthase and of 768 \nthe host D prostanoid receptor 1 in schistosome immune evasion. European Journal of Immunology 33,  769 \n2764-2772. 770 \n 33 \nHoberg, E. P., Henny, C. J., Hedstrom, O. R. and Grove, R. A. (1997). Intestinal helminths of river otters 771 \n(Lutra canadensis) from the Pacific Northwest. Journal of Parasitology 83,  105-110. 772 \nHopkins, C. A. and Smyth, J. D. (1951). Notes on the Morphology and Life History of Schistocephalus- 773 \nSolidus (Cestoda, Diphyllobothriidae). Parasitology 41,  283-&. 774 \nHyslop, E. J. and Chubb, J. C. (1983). Schistocephalus pungitii Dubinina, 1959 (Cestoda) in Britain. 775 \nParasitology 87,  R30-R30. 776 \nJäger, I. and Schjørring, S. (2006). Multiple infections: Relatedness and time between infections affect the 777 \nestablishment and growth of the cestode Schistocephalus solidus in its stickleback host. Evolution 60,  778 \n616-622. 779 \nJakobsen, P. J., Johnsen, G. H. and Larsson, P. (1988). Effects of predation risk and parasitism on the feeding 780 \necology, habitat use, and abundance of lacustrine threespine stickleback (Gasterosteus aculeatus). 781 \nCanadian Journal of Fisheries and Aquatic Sciences 45,  426-431. 782 \nJakobsen, P. J. and Wedekind, C. (1998). Copepod reaction to odor stimuli influenced by cestode infection. 783 \nBehavioral Ecology 9,  414-418. 784 \nKennedy, C. R. (1974). Checklist of British and Irish freshwater fish parasites with notes on their distribution. 785 \nJournal of Fish Biology 6,  613-644. 786 \nKeymer, A. E. and Read, A. F. (1991). Behavioural ecology: the impact of parasitism. In Parasite–Host 787 \nAssociations, Coexistence or Conflict (eds. Toft, C. A., Aeschlimann, A. & Bolis, L.), Oxford Scientific 788 \nPublications, Oxford, UK. 789 \nKingsley, D. M. (2003). Sequencing the genome of threespine sticklebacks (Gasterosteus aculeatus). In 790 \nNational Human Genome Research Institute White Paper  791 \nKingsley, D. M., Zhu, B. L., Osoegawa, K., De Jong, P. J., Schein, J., Marra, M., Peichel, C., Amamiya, C., 792 \nSchluter, D., Balabhadra, S., Friedlander, B., Cha, Y. M., Dickson, M., Grimwood, J., Schmutz, 793 \nJ., Talbot, W. S. and Myers, R. (2004). New genomic tools for molecular studies of evolutionary 794 \nchange in threespine sticklebacks. Behaviour 141,  1331-1344. 795 \nKurtz, J., Kalbe, M., Aeschlimann, P. B., Haberli, M. A., Wegner, K. M., Reusch, T. B. H. and Milinski, 796 \nM. (2004). Major histocompatibility complex diversity influences parasite resistance and innate 797 \nimmunity in sticklebacks. Proceedings of the Royal Society of London Series B-Biological Sciences 798 \n271,  197-204. 799 \nLafferty, K. D. (1992). Foraging on prey that are modified by parasites. American Naturalist 140,  854-867. 800 \n 34 \nLester, R. J. G. (1971). Influence of Schistocephalus plerocercoids on respiration of Gasterosteus and a possible 801 \nresulting effect on behavior of fish. Canadian Journal of Zoology 49,  361-366. 802 \nLobue, C. P. and Bell, M. A. (1993). Phenotypic manipulation by the cestode parasite Schistocephalus solidus 803 \nof its intermediate host, Gasterosteus aculeatus, the threespine stickleback. American Naturalist 142,  804 \n725-735. 805 \nLoot, G., Giraudel, J. L. and Lek, S. (2002). A non-destructive morphometric technique to predict Ligula 806 \nintestinalis L. plerocercoid load in roach (Rutilus rutilus L.) abdominal cavity. Ecological Modelling 807 \n156,  1-11. 808 \nLuscher, A. and Wedekind, C. (2002). Size-dependent discrimination of mating partners in the simultaneous 809 \nhermaphroditic cestode Schistocephalus solidus. Behavioral Ecology 13,  254-259. 810 \nMaccoll, A. D. C. (2009). Parasite burdens differ between sympatric three-spined stickleback species. 811 \nEcography 32,  153-160. 812 \nMacnab, V. L., Katsiadaki, I. and Barber, I. (in press). Reproductive potential of Schistocephalus solidus 813 \ninfected male three-spined stickleback (Gasterosteus aculeatus) from two UK populations. Journal of 814 \nFish Biology. 815 \nMaizels, R. M. and Yazdanbakhsh, M. (2003). Immune regulation by helminth parasites: cellular and 816 \nmolecular mechanisms. Nature Reviews Immunology 3,  733-744. 817 \nManning, M. J. (1994). Fishes. In Immunology: a comparative approach (ed. Turner, R. J.), John Willey & 818 \nSons, Chichester, New York, USA. 819 \nMckinnon, J. S., Mori, S., Blackman, B. K., David, L., Kingsley, D. M., Jamieson, L., Chou, J. and 820 \nSchluter, D. (2004). Evidence for ecology's role in speciation. Nature 429,  294-298. 821 \nMcphail, J. D. and Peacock, S. D. (1983). Some effects of the cestode (Schistocephalus solidus) on 822 \nreproduction in the threespine stickleback (Gasterosteus aculeatus): Evolutionary aspects of a host-823 \nparasite interaction. Canadian Journal of Zoology-Revue Canadienne De Zoologie 61,  901-908. 824 \nMilinski, M. (1984). Parasites determine a predator's optimal feeding strategy. Behavioral Ecology and 825 \nSociobiology 15,  35-37. 826 \nMilinski, M. (1985). Risk of predation of parasitized sticklebacks (Gasterosteus aculeatus L) under competition 827 \nfor food. Behaviour 93,  203-215. 828 \nMilinski, M. (1990). Parasites and host decision-making. In Parasitism and host behaviour (eds. Barnard, C. J. 829 \n& Behnke, J. M.), pp. 95-116. Taylor and Francis, London. 830 \n 35 \nMilinski, M. and Bakker, T. C. M. (1990). Female sticklebacks use male coloration in mate choice and hence 831 \navoid parasitized males. Nature 344,  330-333. 832 \nMinchella, D. J. (1985). Host life-history variation in response to parasitism. Parasitology 90,  205-216. 833 \nNess, J. H. and Foster, S. A. (1999). Parasite-associated phenotype modifications in threespine stickleback. 834 \nOikos 85,  127-134. 835 \nOrr, T. S. C., Hopkins, C. A. and Charles, G. H. (1969). Host specificity and rejection of Schistocephalus 836 \nsolidus. Parasitology 59,  683-&. 837 \nÖstlund -Nilsson, S., Mayer, I. and Huntingford, F. A. (2006). Biology of the three-spined stickleback, CRC 838 \nPress, Boca Raton. FL. 839 \nØverli, O., Páll, M., Borg, B., Jobling, M. and Winberg, S. (2001). Effects of Schistocephalus solidus 840 \ninfection on brain monoaminergic activity in female three-spined sticklebacks Gasterosteus aculeatus. 841 \nProceedings of the Royal Society of London Series B-Biological Sciences 268,  1411-1415. 842 \nParker, G. A., Ball, M. A., Chubb, J. C., Hammerschmidt, K. and Milinski, M. (2009). When should a 843 \ntrophically transmitted parasite manipulate Its host? Evolution 63,  448-458. 844 \nPasternak, A. F., Huntingford, F. A. and Crompton, D. W. T. (1995). Changes in metabolism and behavior 845 \nof the fresh-water copepod Cyclops strenuus abyssorum Infected with Diphyllobothrium spp. 846 \nParasitology 110,  395-399. 847 \nPeichel, C. L., Nereng, K. S., Ohgi, K. A., Cole, B. L. E., Colosimo, P. F., Buerkle, C. A., Schluter, D. and 848 \nKingsley, D. M. (2001). The genetic architecture of divergence between threespine stickleback species. 849 \nNature 414,  901-905. 850 \nPennycuick, L. (1971). Quantitative effects of three species of parasites on a population of three-spined 851 \nsticklebacks, Gasterosteus aculeatus. Journal of Zoology 165,  143-162. 852 \nPoulin, R. (1994). The evolution of parasite manipulation of host behavior - a theoretical analysis. Parasitology 853 \n109,  S109-S118. 854 \nRanta, E. (1995). Schistocephalus infestation improves prey-size selection by 3-spined sticklebacks, 855 \nGasterosteus aculeatus. Journal of Fish Biology 46,  156-158. 856 \nReimchen, T. E. (1997). Parasitism of asymmetrical pelvic phenotypes in stickleback. Canadian Journal of 857 \nZoology-Revue Canadienne De Zoologie 75,  2084-2094. 858 \nReimchen, T. E. and Nosil, P. (2001). Lateral plate asymmetry, diet and parasitism in threespine stickleback. 859 \nJournal of Evolutionary Biology 14,  632-645. 860 \n 36 \nRijkers, G. T., Frederixwolters, E. M. H. and Vanmuiswinkel, W. B. (1980). The immune system of cyprinid 861 \nfish - kinetics and temperature dependence of antibody producing cells in carp (Cyprinus carpio). 862 \nImmunology 41,  91-97. 863 \nRushbrook, B. J. and Barber, I. (2006). Nesting, courtship and kidney hypertrophy in Schistocephalus-infected 864 \nmale three-spined stickleback from an upland lake. Journal of Fish Biology 69,  870-882. 865 \nScharsack, J. P., Kalbe, M., Derner, R., Kurtz, J. and Milinski, M. (2004). Modulation of granulocyte 866 \nresponses in three-spined sticklebacks Gasterosteus aculeatus infected with the tapeworm 867 \nSchistocephalus solidus. Diseases of Aquatic Organisms 59,  141-150. 868 \nScharsack, J. P., Koch, K. and Hammerschmidt, K. (2007). Who is in control of the stickleback immune 869 \nsystem: interactions between Schistocephalus solidus and its specific vertebrate host. Proceedings of the 870 \nRoyal Society B-Biological Sciences 274,  3151-3158. 871 \nSeppala, T., Chubb, J. C., Niemela, E. and Valtonen, E. T. (2007). Introduced bullheads Cottus gobio and 872 \ninfection with plerocercoids of Schistocephalus cotti in the Utsjoki, an Arctic river in Finland. Journal 873 \nof Fish Biology 70,  1865-1876. 874 \nShapiro, M. D., Bell, M. A. and Kingsley, D. M. (2006). Parallel genetic origins of pelvic reduction in 875 \nvertebrates. Proceedings of the National Academy of Sciences of the United States of America 103,  876 \n13753-13758. 877 \nShapiro, M. D., Marks, M. E., Peichel, C. L., Blackman, B. K., Nereng, K. S., Jonsson, B., Schluter, D. and 878 \nKingsley, D. M. (2004). Genetic and developmental basis of evolutionary pelvic reduction in threespine 879 \nsticklebacks. Nature 428,  717-723. 880 \nSmyth, J. D. (1946). Studies on tapeworm physiology. I. The cultivation of Schistocephalus solidus in vitro. 881 \nJournal of Experimental Biology 23,  47-70. 882 \nSmyth, J. D. (1947). The physiology of tapeworms. Biological Reviews 22,  214-238. 883 \nSmyth, J. D. (1990). In vitro cultivation of parasitic helminths CRC Press, Boca Raton, FL. 884 \nSmyth, J. D. and Mcmanus, D. P. (1989). The physiology and biochemisty of cestodes, Cambridge University 885 \nPress, Cambridge. 886 \nTakizawa, F., Araki, K., Kobayashi, I., Moritomo, T., Ototake, M. and Nakanishi, T. (2008a). Molecular 887 \ncloning and expression analysis of T-bet in ginbuna crucian carp (Carassius auratus langsdorfii). 888 \nMolecular Immunology 45,  127-136. 889 \n 37 \nTakizawa, F., Mizunaga, Y., Araki, K., Moritomo, T., Ototake, M. and Nakanishi, T. (2008b). GATA3 890 \nmRNA in ginbuna crucian carp (Carassius auratus langsdorfii): cDNA cloning, splice variants and 891 \nexpression analysis. Developmental and Comparative Immunology 32,  898-907. 892 \nThomas, F., Adamo, S. and Moore, J. (2005). Parasitic manipulation: where are we and where should we go? 893 \nBehavioural Processes 68,  185-199. 894 \nTierney, J. F. (1994). Effects of Schistocephalus solidus (Cestoda) on the food intake and diet of the three-895 \nspined stickleback, Gasterosteus aculeatus. Journal of Fish Biology 44,  731-735. 896 \nTierney, J. F. and Crompton, D. W. T. (1992). Infectivity of plerocercoids of Schistocephalus solidus 897 \n(Cestoda, Ligulidae) and fecundity of the adults in an experimental definitive host, Gallus gallus. 898 \nJournal of Parasitology 78,  1049-1054. 899 \nTierney, J. F., Huntingford, F. A. and Crompton, D. W. T. (1993). The relationship between infectivity of 900 \nSchistocephalus solidus (Cestoda) and antipredator behavior of its intermediate host, the three-spined 901 \nstickleback, Gasterosteus aculeatus. Animal Behaviour 46,  603-605. 902 \nTierney, J. F., Huntingford, F. A. and Crompton, D. W. T. (1996). Body condition and reproductive status in 903 \nsticklebacks exposed to a single wave of Schistocephalus solidus infection. Journal of Fish Biology 49,  904 \n483-493. 905 \nUrdal, K., Tierney, J. F. and Jakobsen, P. J. (1995). The tapeworm Schistocephalus solidus alters the activity 906 \nand response, but not the predation susceptibility of infected copepods. Journal of Parasitology 81,  907 \n330-333. 908 \nVanmuiswinkel, W. B. (1995). The piscine immune system: innate and acquired immunity. In Fish Diseases 909 \nand Disorders. Volume 1, Protozoan and Metazoan Infections (ed. Woo, P. T. K.), pp. 729-750. CAB 910 \nInternational, Wallingford, UK. 911 \nVollmer-Conna, U. (2001). Acute sickness behaviour: an immune system-to-brain communication? 912 \nPsychological Medicine 31,  761-767. 913 \nWalkey, M. and Meakins, R. H. (1970). An attempt to balance energy budget of a host-parasite system. 914 \nJournal of Fish Biology 2,  361-372. 915 \nWang, L. J., Cao, Y. and Shi, H. N. (2008). Helminth infections and intestinal inflammation. World Journal of 916 \nGastroenterology 14,  5125-5132. 917 \nWedekind, C. (1997). The infectivity, growth, and virulence of the cestode Schistocephalus solidus in its first 918 \nintermediate host, the copepod Macrocyclops albidus. Parasitology 115,  317-324. 919 \n 38 \nWedekind, C. and Little, T. J. (2004). The clearance of hidden cestode infection triggered by an independent 920 \nactivation of host defense in a teleost fish. Journal of Parasitology 90,  1329-1331. 921 \nWedekind, C. and Milinski, M. (1996). Do three-spined sticklebacks avoid consuming copepods, the first 922 \nintermediate host of Schistocephalus solidus? An experimental analysis of behavioural resistance. 923 \nParasitology 112,  371-383. 924 \nWegner, K. M., Kalbe, M., Kurtz, J., Reusch, T. B. H. and Milinski, M. (2003). Parasite selection for 925 \nimmunogenetic optimality. Science 301,  1343-1343. 926 \nWootton, R. J. (1976). The biology of the sticklebacks Academic Press, London  927 \nWootton, R. J. (1984). A functional biology of sticklebacks, University of California Press, Berkeley, CA. 928 \nWright, H. A., Wootton, R. J. and Barber, I. (2006). The effect of Schistocephalus solidus infection on meal 929 \nsize of three-spined stickleback. Journal of Fish Biology 68,  801-809. 930 \nWright, H. A., Wootton, R. J. and Barber, I. (2007). Compensatory growth in threespine sticklebacks 931 \n(Gasterosteus aculeatus) inhibited by experimental Schistocephalus infection. Canadian Journal of 932 \nFisheries and Aquatic Sciences 64,  819-826. 933 \n 934 \n 935 \n 936 \n"}