{"doi":"10.1016\/j.annals.2008.11.001","coreId":"101699","oai":"oai:epubs.surrey.ac.uk:1129","identifiers":["oai:epubs.surrey.ac.uk:1129","10.1016\/j.annals.2008.11.001"],"title":"Reading Tourism Education:Neoliberalism Unveiled","authors":["Ayikoru, M","Tribe, J","Airey, D"],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2009-04","abstract":"This article deploys poststructuralist discourse theory to examine ideological influences in tourism higher education in England. It foregrounds neoliberalism and managerialism circulating from government policy to higher education institutions and illustrates how the notions of competition, markets, performativity and quality assurance, commonly associated with industry and commerce, converge in tourism higher education. It highlights the role of power in mediating the relationship between tourism higher education and institutions responsible for producing and disseminating the texts analyzed. It. points to the discursive construction of tourism higher education in England and concludes by posing the question: to what extent has this state of affairs contributed to furthering its venerability within the broader higher education academe","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"PERGAMON-ELSEVIER SCIENCE LTD","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1129<\/identifier><datestamp>\n      2017-10-31T14:00:46Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:746F757269736D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1129\/<\/dc:relation><dc:title>\n        Reading Tourism Education:Neoliberalism Unveiled<\/dc:title><dc:creator>\n        Ayikoru, M<\/dc:creator><dc:creator>\n        Tribe, J<\/dc:creator><dc:creator>\n        Airey, D<\/dc:creator><dc:description>\n        This article deploys poststructuralist discourse theory to examine ideological influences in tourism higher education in England. It foregrounds neoliberalism and managerialism circulating from government policy to higher education institutions and illustrates how the notions of competition, markets, performativity and quality assurance, commonly associated with industry and commerce, converge in tourism higher education. It highlights the role of power in mediating the relationship between tourism higher education and institutions responsible for producing and disseminating the texts analyzed. It. points to the discursive construction of tourism higher education in England and concludes by posing the question: to what extent has this state of affairs contributed to furthering its venerability within the broader higher education academe?<\/dc:description><dc:publisher>\n        PERGAMON-ELSEVIER SCIENCE LTD<\/dc:publisher><dc:date>\n        2009-04<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1129\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Ayikoru, M, Tribe, J and Airey, D  (2009) Reading Tourism Education:Neoliberalism Unveiled   ANN TOURISM RES, 36 (2).  pp. 191-221.      <\/dc:identifier><dc:relation>\n        10.1016\/j.annals.2008.11.001<\/dc:relation><dc:language>\n        EN<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1129\/","10.1016\/j.annals.2008.11.001"],"year":2009,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" 1 \n \n \nREADING TOURISM EDUCATION \nNeoliberalism Unveiled \n 2 \nREADING TOURISM EDUCATION \nNeoliberalism Unveiled \nMaureen Ayikoru \nUniversity of Surrey, Guildford, GU2 7XH, UK \nTel: +44 (0)7886 977446 \nE-mail:ayikorum@yahoo.co.uk \nJohn Tribe \nUniversity of Surrey, Guildford, GU2 7XH, UK  \nTel: +44 (0)1483 686319  \nE-mail: j.tribe@surrey.ac.uk  \nDavid Airey \nUniversity of Surrey, Guildford, GU2 7XH, UK \nTel: +44 (0)1483 689656 \nE-mail: d.airey@surrey.ac.uk  \n \nMaureen Ayikoru completed her PhD in Tourism at the University of Surrey (Guildford, \nGU2 7XH, UK, E-mail: ayikorum@yahoo.co.uk). Her research interests include \nmethodological issues in tourism research, higher education policies, sustainability and \ntourism in Uganda. John Tribe is Professor and Chair of the Tourism Program at the \nUniversity of Surrey. David Airey is Professor of Tourism Management and Pro Vice- \nChancellor at the University of Surrey. \n \n 3 \nAbstract: This article deploys poststructuralist discourse theory to examine ideological \ninfluences in tourism higher education in England. It foregrounds neoliberalism and \nmanagerialism circulating from government policy to higher education institutions and \nillustrates how the notions of competition, markets, performativity and quality assurance, \ncommonly associated with industry and commerce, converge in tourism higher education. It \nhighlights the role of power in mediating the relationship between tourism higher education \nand other institutions responsible for producing and disseminating the texts analyzed. It \npoints to the discursive construction of tourism higher education in England and concludes by \nposing the question: to what extent has this state of affairs contributed to furthering its \nvenerability within the broader higher education academe? Keywords: Ideology, \nNeoliberalism, Managerialism, Higher Education. \n \nINTRODUCTION  \nTourism education can be described as one of the main sub sectors of the multifaceted \ntourism phenomenon and one whose manifestation could impact on the whole of the tourism \nsector, directly or indirectly. The United Nations World Tourism Organization (UNWTO) \nhas singled out tourism (higher) education as holding a potential to achieving customer \nsatisfaction and also improving the competitiveness of tourism businesses and regions if \nspecific education and training are guaranteed (Fayos Solà 1997). Tourism higher education \nhas attained formal recognition in several countries worldwide. This is evidenced by among \nother things the dedication of a special journal issue on the theme ‘tourism education’ in \nAnnals of Tourism Research (Jafari and Ritchie 1981) and more recently the publication of \ntwo major edited collections namely ‘An International Handbook of Tourism Education’ \n(Airey and Tribe 2005) and ‘Global Tourism Higher Education’ (Hsu 2005). The latter was \nsimultaneously co-published as Journal of Teaching in Travel and Tourism, Volume 5, \n 4 \nNumbers 1\/2\/3 2005 (Hsu 2005). Furthermore, there are three journals specifically dedicated \nto tourism education research; namely, the Journal of Teaching in Travel and Tourism, the \nJournal of Hospitality and Tourism Education and the Journal of Hospitality, Leisure, Sport \nand Tourism Education. \n \nMeanwhile the provision of tourism education poses fundamental challenges to educators in \nthat different stakeholders have specific tourism education needs they deem appropriate for \ntheir own purposes (Cooper & Shepherd 1997). Moreover, training as opposed to education \nhas traditionally dominated the tourism industry in which vocationally-oriented courses \nplayed a crucial role in providing the necessary craft skills for many years (Cooper & \nShepherd 1997; Gillespie & Baum 2000). A notable distinction between education and \ntraining emanates from Zais’ (1976) work on curriculum in which he defines training as “a \ntechnical model directed toward specific behavioral changes” meanwhile “education is \ndirected toward expanding ones awareness of human environment and how to cope with this \nenvironment” (p. 317). The challenges facing tourism educators are further exacerbated by \nthe observation that much of the tourism industry comprises small operating units that are \nfound in different geographical locations (Sigala and Baum 2003); with a dependency on \nsemi or unskilled labour supply (Baum 2006). Writing about tourism education in Canada, \nMacLaurin (2005) comments on the disparity in interest between educators and the \ngovernment, while acknowledging that an alliance has been established, with strong \nprospects of providing sustainable source of skilled employees for the future. Evans (2001) \nhowever points at how employers do not consider a degree in tourism as a necessary \nrequirement for employment, perhaps due to ignorance or confusion about what is on offer. \nThis has been reiterated by Reichel (2005), who while explaining the industry-academic \n 5 \nrelations in Israel notes that there is anecdotal evidence pointing to the hospitality industry’s \nslowness in recruiting graduates of hospital and tourism program.  \n \nSuch issues have in the past been researched extensively by focusing on aspects such as \ncurriculum content and planning and stakeholder approaches to curriculum design (See for \nexample Leiper 1981; Koh 1995; Tribe 2002), and also enquiries into human resource \ndevelopment issues, strategies and policies (see for example Baum and Szivas 2008; Liu & \nWall 2005; Singh 1997). A noteworthy example is taken from Koh’s (1995) marketing \napproach to tourism curriculum design in which he employed the Delphi technique to design \na four-year tourism curriculum with the industry. Koh (1995) expressed concerns over the \nfact that educators designed tourism curricula in most USA universities with little or no \nrepresentation from the industry. Drawing on a panel of experts from both the industry and \nthe education sector, Koh identified the types of tourism graduates ‘useful’ to the industry. \nThese included among others; “Tourism product development specialists, tourism marketers, \ntourism market researchers, facility managers, convention planners\/organizers, and special \nevents planners… ” (Koh 1995: 854).  Although these issues constitute legitimate concerns \nthat tourism as a relatively new field of study in higher education has had to grapple with \nfrom an educational perspective, there have been other waves of change that have swept \nacross the whole of higher education that require further understanding.  \n \nNotable in this case has been the changing mode of state intervention in education that some \nargue emanates from the changes in the global economy, powerful influences from industry \nand commerce all of which tend to force higher education in general to respond to the needs \nof a constantly changing and increasingly diverse society (Barnett 2000; Baird 2006). Despite \nnumerous debates on its (post) disciplinary status (see for example Coles et al 2006; Echtner \n 6 \n& Jamal, 1997; Leiper, 1981; Tribe 1997), tourism studies is replete with examples of partial \nrepresentation of tourism through the discourses of economics and business management \n(Airey and Johnson 1998; Higgins-Desbiolles 2006; Stuart-Hoyle 2003). This is substantiated \nby the findings of a survey of the aims and objectives of tourism degree courses in the UK for \nthe academic year 1997\/1998 (Airey and Johnson 1998). This survey was conducted to \nidentify the aims and objectives of 99 tourism undergraduate and postgraduate courses \nthrough the information obtained from the prospectuses of the participating institutions. The \nfindings of the survey show the ‘top twenty’ aims and objectives of these institutions and are \nworth quoting at length.  That is, \n…The focus on vocational, business management courses is highlighted…. over three \nquarters (77%) of the prospectuses mention ‘career  opportunities’ and in excess of a \nhalf (54%)  cite ‘employment’ as reasons why prospective students might consider \ntaking a place on the course… and over a third  (36%) state that the students will be \ntaught ‘management’ and\/or ‘business’ skills…and educational concepts such as \nproviding students with a broad education and equipping them with analytical skills \nare cited by only about a fifth of the courses surveyed (22% and 20% respectively)… \n(Airey and Johnson 1998:6-7). \nA similar observation from Phillip Pearce while commenting on assessment of tourism \neducation (in Australia) is that “many institutions promote their tourism degrees with the rich \nallure of future jobs in an expanding tourism world” (2005:263). As a direct response to the \nforegone observations, Higgins-Desbiolles (2006:1192) notes that ‘the discourse of tourism \nas an ‘‘industry’’ has overshadowed other conceptualizations of the tourism phenomenon’, \nshe argues in favor of an understanding of tourism that has broader benefits to society.  \n \n 7 \nIn an attempt to understand the manifestation of these ‘new’ changes in tourism studies, this \npaper poses the question ‘is tourism higher education ideological?’ Ideology refers to an \noverarching network of guiding ideas that frame, direct and inform thinking. They are often \ntaken for granted so that we are not aware of their existence because we have become deeply \nacculturated to their ways.  Ideology has been defined as \n A structure… structures can capture, can impose themselves; but they can \nusually be entered willingly, they can be abandoned and they can even be \ndemolished and new ones created in their place… (Barnett 2003:57).   \nIdeology within the context of (tourism higher) education has been analyzed mainly in terms \nof curriculum planning and knowledge (Barnett 2003; Busby 2001; Scrimshaw 1983; Tribe \n2000). However the discursive ideological representation of tourism in the light of these new \nwaves of change has scarcely (if at all) been analyzed in the tourism studies literature. This \npaper then draws on poststructuralist discourse theory, particularly the works of Michel \nFoucault, and to some extent Ernesto Laclau and Chantal Mouffe as well as some recent \ncontributions in political economy and (higher) education policy to address this problematic. \nIt offers a discursive analysis of higher education policy and non-policy texts and discourses \nthrough which tourism is represented. It deploys the Foucauldian notion of governmentality \nand disciplinary power to posit the simultaneous existence of several techniques and \ndiscourses that encompass neoliberal governance in tourism higher education in England. The \nconcept of ‘government’ used here according to Foucault entails \n… not only the legitimately constituted forms of political or economic \nsubjection but also modes of action, more or less considered and calculated, \nthat were destined to act upon the possibilities of action of other people \n(1994:241).  \n 8 \nThe starting point for the ensuing analysis is the distinction made by Foucault (1988) between \ntwo forms of control. That is, relations of force and relations of power.  Foucault suggests \nthat relations of force exclude the option for consent as they are outright imposed but at the \nsame time difficult to sustain. On the other hand, relations of power entail some form of \nfreedom from direct coercion and that those on whom power is wielded are free in the liberal \nsense of freedom, although they are somehow made to ‘behave’ in the desired ways. This in a \nsense describes what happens in liberal societies, where self-managing individuals and \ninstitutions like those of higher education operate under a regulated autonomy. Such \nindividuals and institutions according to Foucault, manage themselves while their private \nfreedoms are concomitantly made “subject to power” through the programmes and \ntechniques of liberal governments (Foucault 1988:83-84).  \n \nOne further explanation for this state of affairs is contemplated here. It draws upon the \nFoucauldian conceptualization of power as “meaning (s) in circulation” (Hollinshead \n1999:13). This implies that a given power relation is possible in part because of its seemingly \nnon-coercive, silent and secret way of operating through the everyday routines of a given \nsocial entity.  This insidious extension of power to the mundane operations of an organization \nis what Foucault describes as  \nDisciplinary power [underpinned by] hierarchized, continuous and \nfunctional surveillance…. [that] became an “integrated” system linked from \nthe inside to the economy and to the aims of the mechanism in which it was \npracticed…[This] power…is not possessed as a thing…[rather it] \ndistributes individuals in this permanent and continuous field… This \nenables the disciplinary power to be both absolutely indiscreet since it is \neverywhere and always alert …constantly supervises the very individuals \n 9 \nwho are entrusted with the task of supervising…and absolutely \ndiscreet…for it functions in silence (Rabinow 1984:192).   \nAt the heart of disciplinary power is its ‘normalization’ effect by which is meant its tendency \nto create particular subjects and objects, and ensconcing them in the privileged locus of a \ngiven regime of truth while systematically subjugating others. In order to realize this \npotential, disciplinary power somehow garners consent from the very individuals or \ninstitutions that bear its brunt, thus giving it a hegemonic status (Laclau and Mouffe 1985). It \nis this that highlights the discursively constituted ideological nature of tourism higher \neducation. Thus the overarching theme from Foucault that is pertinent to an understanding of \nthe manifestation of neoliberalism in tourism higher education is the view that the \ngovernment is concerned partly with creating and maintaining autonomous individuals and \ninstitutions. Once established, the deployment of various governmental techniques culminates \nin subjecting the individuals and institutions so-constructed to the play of external forces \nwhile simultaneously permitting them to act as authors and subjects of their own conduct \n(Rabinow, 1984; also cf. Marginson, 1997; Hollinshead, 1999; Davies, 2006; Shore and \nWright, 2000).   \n \nThe paper argues that the ‘governmentalization’ of higher education makes possible through \nspecific policies, the survival and entrenchment of particular discursive ideologies by \ncontinuously (re)defining what are thought to be ‘important’ values in higher education (cf. \nFoucault 1994).  Such values articulated over time assume hegemonic status by ‘partially \nfixing’ the most dominant meanings perpetuated in higher education (Torfing 1999; Laclau \nand Mouffe 1985). But this does not in anyway suggest the docility of institutions and \neducators that provide tourism higher education, given the view that hegemony inherently \nconnotes the existence of struggles (Laclau and Mouffe 1985; Eagleton 1991; Pickett 1996; \n 10 \nHowarth 2000). That is, for hegemonic articulations to be realized in practice, there must \nexist [at least?] two conditions including “the presence of antagonistic forces and instability \nof the frontiers that separate them” (Laclau and Mouffe 1985:136).  \n \nThree notable examples suffice to clarify the foregone assertion. First is an attempt by Tribe \n(2002) to move the debate on tourism education beyond its vocational emphasis through his \nconcept of philosophic practitioner that attempts to introduce liberal emancipatory discourses \nto balance the predominant vocationalist perspective in tourism higher education. The second \nis a more recent contribution from Botterill and Gale (2005) on postgraduate and PhD \neducation. Rather than accept and perhaps laud the orthodoxy of tourism (and very often \nmanagement) studies that engulfs (much of?) postgraduate curriculum, they problematise the \n‘situated knowledge’ that is often presented as an organic reality to the international \nclassroom. They suggest the possibility of reformulating tourism knowledge to include a \nmore diverse ‘situatedness’, with the prospects of enabling previously silent voices an \nopportunity to contribute to and thus create ‘new tourism knowledge’ (P.478). In a similar \nvein, Pritchard & Morgan (2007) in their chapter on ‘de-centering tourism’s intellectual \nuniverse’ proffer a critique of the discourse of knowledge production (in and about tourism) \nby pinpointing the role played by the tourism’s academic gatekeepers. They crucially suggest \nthat “time has come to scrutinize just how this masculine, Anglo-Saxon, business-focused \ndomination of the field of tourism has shaped its architecture of knowledge” (2007:17).  The \npresence of such (minority?) critical perspectives within tourism studies highlight the role of \nantagonistic forces that in turn act as vanguards against complete dominance of a particular \ndiscursive ideological articulation (Torfing 1999).  \n \n 11 \nThis type of discursive analysis that draws on Foucault is not new to tourism studies. An \ninfluential work by John Urry (1990) in which he used the Foucauldian concept of the \ndisciplinary gaze to conceptualize his notion of the tourist gaze serves as a key reference text. \nMeanwhile Keith Hollinshead recently offered a critique of the power of surveillance in \ntourism by explaining the ways in which the Foucauldian eye-of-power crucially acts through \nthe organizations and agencies of travel and tourism as well as in tourism research \n(Hollinshead 1999). His analysis implicates tourists and those who work in tourism as \nparticipants in the regulation of the world and concomitant mastery of its socio-cultural and \ngeographic environments while becoming subject to self-regulation. \n  \nThe structure of this article is as follows. First the terms neoliberalism and managerialism are \nbriefly examined as a way of introducing the literature from political economy and higher \neducation (policy). Second the method of discourse analysis is explained. Then, drawing on \nthe logics and concepts of poststructuralist discourse theory, it examines the under-researched \nideological influences in tourism higher education in England. It distinguishes various \nmanifestations of neoliberalism and managerialism in government policy and higher \neducation institutions (HEIs). The final part constitutes the concluding remarks where the \ncontribution of the study is discussed.  \n \nNEOLIBERALISM AND MANAGERIALISM  \nNeoliberalism is one of the most debated ideologies in both education and political economy \n(Apple 2001; Torres and Schugurensky 2002; Harvey 2005, 2006) but to what extent is it \nrepresented in and through tourism higher education in England? Neoliberalism encompasses \na ‘new’ set of reconfigurations in social and political ideologies that struggle to create and fix \nhegemonic meanings of both educational and social issues (Apple 2001). Apple further adds \n 12 \n“...Its overall aims are in providing the educational conditions believed necessary both for \nincreasing international competitiveness, profit, and discipline….” (Apple 2001:410).  \nMeanwhile for Harvey,  \nNeoliberalism is in the first instance a theory of political economic \npractices which proposes that human well-being can best be advanced by \nthe maximization of entrepreneurial freedoms within an institutional \nframework characterized by private property rights, individual liberty, free \nmarkets and free trade (2006:145). \nMarginson and Considine (2000) associate neoliberalism with the adoption of a management-\nlike approach in handling the affairs of the public sector and the unprecedented interest in \nachieving efficiency and better performance. This perspective will later be described as \nmanagerialism, one of the many ways in which neoliberalism is operationalized. Some key \nfeatures of neoliberalism are ‘competition’, ‘profitability’, ‘performativity’, ‘progress’, \n‘entrepreneurship’, ‘individuality’, ‘economic rationality’ and ‘free’ market environment.  \n \nWithin tourism studies, Burns (2004) alludes to a central feature of neoliberalism in his \nconceptual paper on tourism planning that offers a lucid critique of the traditional left\/right \npolitics (‘development first’ vs ‘tourism first’ respectively) that has dominated tourism \nplanning. Prior to adapting Gidden’s ‘third way’ to politics as an alternative, Burns notes that \nthe traditional right, framed by the values of neoliberalism, sees market forces as providing \nthe only alternative (P.24). On a similar note, Clancy (1999) drawing mainly from \ncontemporary theories in political economy posits a statist approach to development against a \nneoliberal approach to explain the dynamics in the Mexican tourism development over a \nperiod of 30 years. Clancy argues that inasmuch as neoliberal accounts of tourism dynamism \nin Mexico consider it a success story due to minimum protectionist barriers and the largely \n 13 \nprivate sector ownerships, such a transformation would be difficult to imagine without the \nactivist role of the Mexican state.  \n \nNeoliberalism in higher education can be understood in terms of the emergence of a new \npolicy consensus that lays emphasis on the relations between higher education and the \neconomy (Lingard 2000). It embodies two main discursive strategies namely the strategies of \nlegitimation and implementation (Apple 2001; Leonardo 2003). The strategy of legitimation \ncan be linked to the unprecedented need for higher education to demonstrate its contribution \nto the economy and wealth creation above any other values ever associated with it (Peters \n1992; Barnetson and Cutright 2000). The emphasis on ‘individual choice’ or the ‘market \nmodel’ to the exclusion of all other competing and alternative views is what gives \nneoliberalism its ideological character.  The strategy of legitimation is then achieved through \npolicy imperatives that continuously define the aims and values of higher education, where \nthe logic of inclusion\/exclusion (Laclau & Mouffe 1985) is very eminent. The other strategy \nentails the implementation of ideas legitimated at policy level at higher education institutions’ \nlevel.  \n \nManagerialism is an example of a commonly encountered ideology that has been widely \ndebated in higher education and one that has only been implicitly commented upon in tourism \nhigher education, despite its omnipresence within this field. Newson describes managerialism \nin higher education as \nThe shift from collegial self-governance to managerialism as the dominant \nmode of institutional decision-making, one which links the programmatic \nactivities of the university more directly to the control and influence of \nexternal constituencies like governments, the business community, funding \n 14 \nagencies and the like…a shift in the primary objectives of the universities \nfrom the creation, preservation and dissemination of social knowledge to \nthe production, and distribution of market knowledge (1994:152).  \nManagerialism conjures up the image of universities as businesses as opposed to \nconventional sites of autonomous knowledge (Delanty 2001; Hoyle and Wallace 2005).  Here \nuniversities increasingly have to replicate business-like practices whereby they have to \ncompete with each other for students, the best professors, and also a share of the ever-\ndiminishing state budget (Delanty 2001; Aronowitz and Giroux 1991).  This state of affairs is \nbecoming more and more evident in the mission statements of universities as well as \nbrochures of specific programmes of study. Departments seeking to attract more students \nemphasize their strengths by depicting: the number of best professors; the scope of research \nin terms of general publications and on-going research by academics and research students; \nstate-of-the–art facilities; external recognition; industry links; accreditations and\/or \naffiliations with top professional bodies and high level of graduate employment. These are \nintended to demonstrate the competitiveness of provision to prospective students, academics \nand most importantly to the state and other external funding agencies. HEIs and specific \ndepartments lay emphasis on these issues to a certain extent because they are contained in the \nstructure of the research assessment exercise (RAE) submission (Page 2003). \n \nSubsequently, the most commented-upon example of managerialism in higher education and \nimplicitly tourism higher education entails the introduction and thus existence to-date of a \nnumber of RAEs operationalized through a form of peer reviews (Willmott 2003; Page 2003).  \nThese RAEs according to Willmott encapsulate the pressure from the state to minimise the \nunit cost of higher education products such as knowledge, and knowledge workers while at \nthe same time ensuring university research is more responsive to commercial and political \n 15 \nneeds. Meanwhile Page (2003) intimates that one of the growing debates within public sector \nagencies that fund research in higher education in most countries is the requirement for \ngreater accountability, transparency and measure to evaluate performance. This according to \nBarnett (1990) is reflected in the discourse that pervades higher education insofar as the state \nis concerned, that is,  \nThere is a new emphasis on value-for-money, accountability, planning, efficiency, \ngood management, resource allocation, unit costs, performance indicators and \nselectivity …. Subjects within the curriculum are favoured to the extent that they \nmake a clear contribution to the economy: the sciences and the technological subjects \nare supported, even though they do not always find it easy to recruit students; the \nhumanities and social science subjects try to prove their worth by, developing skills-\noriented courses. (1990:25\/26).  \nNevertheless the “purpose of RAEs is to rate the ‘quality’ of research conducted in university \ndepartments and research units as a basis for determining the funding for research-oriented \nactivity” (Willmott 2003:131; Page 2003; Tribe 2004).  This implies that RAE performance \nindicators play a crucial role in delineating ‘good research’ that deserves funding, which in \nturn has implications for the inflow of research funding from the public sector (ibid).  \nLikewise, the performance of various universities and particular subjects has implications for \nstaff motivation as well as student enrolment, particularly the tuition-fee paying students. \n \nTo this end, commentaries in the literature suggest marginalisation and invisibility of tourism \nresearch in the 2001 RAE (Botterill 2002; Tribe 2003) and also the 2008 RAE. In this regard, \nBotterill (2002) explains how the difficulties faced by academic staff conducting tourism \nresearch are compounded by the influences of the funding structures for research in UK \nhigher education. Further pointing out that through the RAE, the internal debates on the \n 16 \nintrinsic worth of tourism studies became structurally determined, with the subsequent units \nof assessment (UoA) having implications for the distribution of government research funding \nfor the universities around identified subject units (cf Page 2003). Botterill crucially notes \nthat “the place for reporting tourism research within the structures of the RAE has never been \nclear. The guidance notes on submissions to the RAE 2001 failed to mention ‘tourism’ at all \nin any major subject listing …” (2002:73). \n \nWhile commenting on the earlier stages of the 2008 RAE, Tribe (2004), just like Botterill \nbefore him, noted “researchers in Leisure, Hospitality and Tourism (HL&T) will search in \nvain for an explicit mention of their fields of study in the 2008 RAE proposals. They are not \nto be found in the titles of any of the proposed UoAs” (2004:2). This is reminiscent of a \nconclusion drawn by Stephen Page on the previous RAEs that “Given the competitive nature \nof the RAE, the status quo will probably prevail and the overall outputs in Tourism may \nincrease, but the status of Tourism research within the wider academic community is unlikely \nto change…, the current RAE [2001] does not serve Tourism well” (2003:622). It is worth \nnoting that RAE and its various implications for tourism studies is outlined here to highlight \none of the key features of managerialism, one that entails control and influence from external \nconstituencies and the ensuing implications. Such an example points to the significance of \npositing the Foucauldian concept of disciplinary power, governmentality and also Laclau and \nMouffe’s notion of hegemonic discourse as useful theoretical frameworks by which to reflect \non the contemporary influences on tourism higher education. \n \nStudy Methods \nThis study deploys poststructuralist discourse theory that emphasizes the central role of \nlanguage in constituting social reality (Jaworski and Coupland 1999) as its theoretical \n 17 \nframework. The term discourse encompasses multiple meanings and understandings \n(Hannam & Knox 2005) and it has multiple definitions and applications in social inquiry. \nDiscourses may be defined as “those practices that systematically form the objects of which \nthey speak” (Foucault 1972:49) which in turn define the limits of what can [and cannot] be \nsaid. Jaworski and Coupland (1999:3) have noted that “discourse is language reflecting social \norder but also language shaping social order and shaping individuals’ interaction with \nsociety”.  Social reality is produced and understood through discourse, and social interactions \nwould remain incomprehensible if references were not made to the [broader] discourses that \ngive meaning to them (Phillips and Hardy 2002).   \n \nTo operationalise the abstract definitions of the concept of discourse, the study deploys \ndiscourse analysis as a method of inquiry, and purposive sampling (Morse and Richards 2002; \nTonkiss 1998) to select publicly available texts for analysis. According to Morse and \nRichards (2002), purposive sampling  \n…May involve choosing the “best” most optimal example of the phenomenon and the \nsetting in which you are most likely to see whatever it is you are interested in.... \nAlternatively you may select a setting because it allows you to obtain examples of \neach of several stances or experiences (2002:67)  \nA valuable observation was drawn from Tonkiss (1998) who cautioned that a key \nrequirement for data selection and collection under discourse analytic research is the \nidentification of material that aptly gives insights into the research problem being \ninvestigated. Adding  \nThe most important consideration in selecting your data is not the amount of material \nyou gather; … rather, the primary concern of the discourse analyst is to find data that \n 18 \nwill provide insight into a problem. In this sense, a single speech or newspaper report \nor conversation can generate very fruitful themes for analysis. What matters is the \nrichness of textual detail, rather than the number of texts analysed (Tonkiss 1998:252-\n253; see also Fairclough 1995, 2003).  \nSilverman (2005:55) further adds that, “textual analysis depends upon very detailed analysis. \n[And that] to make such an analysis effective, it is imperative to have a limited body of data \nwith which to work”. With these sampling issues in mind, this study interrogates a limited \nnumber of higher education policy and non-policy texts, and prospectuses from selected \nuniversities to explain the discursive representation of neoliberalism and managerialism in \nEngland. The term text is used here to describe “data consisting of words and\/or images \nwhich have become recorded without the intervention of a researcher (through avenues such \nas interviews)” (Silverman 2001:119).  The focus is on written texts as a deliberate attempt to \ntranscend the conventional approach in social (tourism) inquiry in which texts are useful \ninsofar as they provide background information that in turn is used for the ‘real’ analysis \n(Silverman 2001).   \n \nWhen choosing texts, the general criterion for inclusion was that selected texts ought to have \nsome broad concerns with higher education, or tourism education in England or the UK.   \nThis resulted in the inclusion of 15 specific texts grouped into four broad categories, namely \ngovernment policy and related texts, national tourism and higher education organizations’ \ntexts, tourism education resource text (book) and the final category covers prospectuses taken \nfrom the online course information of seven higher education institutions (HEIs) in England \nfor the academic year 2006\/2007. Details of the specific texts and the justification for their \ninclusion for analysis are contained in vignette 1.  \n 19 \n(Vignette 1 to be inserted here). \n \nData analysis in this study drew insights from the theoretical perspective adopted for the \nstudy (post-structuralist discourse theory) as well as previous discursive analytic inquiries.  \nThe strategy of basing data analysis on theoretical propositions is a powerful aid in guiding \nanalysis as it helps in pointing out where and on what should attention be focused (Robson \n2002, Tonkiss 1998).  In this respect, Tonkiss (1998) suggests that analysis ought to begin by \ninitially selecting a number of themes and sections of data that somehow address the research \nobjectives (see also Phillips and Hardy 2002).  A noteworthy observation on description of \nanalytic procedures in discourse analysis emanates from Wetherell and Potter (1992) for \nwhom \nMuch of the work of discourse analysis is a craft skill, ..., which is not easy to render \nor describe in an explicit or codified manner. Indeed as the analyst becomes more \npracticed it becomes harder and harder to identify explicit procedures that could be \ncalled analysis (Wetherell & Potter 1992:55). \nThis in essence remains a major challenge and critique of discourse analysis as a method of \ninquiry, particularly when judged through the lenses of positivistic canons of conducting \nsocial inquiry (Walle 1997). Nevertheless discourse analysis in this study proceeded in two \nmain ways that were pursued simultaneously. The first entailed identification of key themes \n(for instance ‘aims of tourism\/higher education’ and ‘quality assurance in tourism\/higher \neducation’) articulated in the text (cf. Tonkiss 1998) and the second dealt with identification \nof discourses discerned from the texts (cf. Parker 1992, Fairclough 1995, Phillips and \nJorgensen 2002).  It involved a repeated reading of all the texts selected for this analysis and \ninterrogating these for the type of discourses with implications for tourism higher education \nin England.  The specific units of analysis encompassed selected words and word classes or \n 20 \nphrases, statements or sentences that were used to represent or construct the discourses \nidentified in the literature (cf. Titscher et al. 2000).  The term ‘unit of analysis’ is defined as \n“that unit which seems, to an observer, to be relevant to the particular text as a unit to be \ninvestigated…” (Titscher et al. 2000:34).  \n \nHowever Phillips & Jorgensen (2002) point out that a decision on where one discourse stops \nand where another begins is a very difficult one in social inquiry to the extent that is elusive \nin many theoretical perspectives on discourse analysis.  They suggest that  \nWe treat discourse ….as an analytic concept,… as an entity that the researcher \nprojects onto the reality in order to create a framework for study. … Delimitation can \nbegin with the aid of secondary literature that identifies particular discourses… \n(2002:143-144). \nWith this observation, the focus initially was on the discourses that underpin (tourism) higher \neducation in the study setting identified in the literature. The latter points to some defining \ncharacteristics of neoliberalism and managerialism as dominant discourses. This was the \nbasis on which the units of analyses were selected.  These defining units of analysis include \nterms such as ‘accountability’, ‘efficiency and effectiveness’ ‘competitiveness’, ‘research \nassessment exercise’, ‘performance indicators’, and ‘value for money’ (see for example \nDelanty 2001, Willmott 2003, Barnett 1990; Botterill 2002; Page 2003). This strategy of \ndelimiting discourses with the help of secondary data was deployed throughout the analysis \nas will become apparent in the next subsection. It involved a simultaneous identification of \nknown units of analysis or emergent units of analysis for which a literature search (in the case \nof the latter) led to delimitation of the particular discourses, and the ensuing discursive \nideological analysis presented in the next subsection.  \n 21 \nFurthermore, there was a deliberate attempt to interrogate texts for the main objects or actors \nconstructed in these (emerging) discourses (cf. Phillips and Hardy 2002).  For instance for \ntexts that depict the discourse of managerialism as underpinning tourism higher education, \nthe analysis further sought to know the objects or actors constructed in or through this \ndiscourse such as employers, HEIs (universities and colleges), students, educators and so \nforth and how they are constructed.  The significance of identifying objects or actors was that \nit served to provide clues into the nature of power relations implicit in the texts and the \npossibility for theorizing such relationships. \n \nNeoliberalism as a Governmental Technique in Tourism Higher Education  \nAn analysis of the aims of both higher education and tourism higher education taken from \npolicy and other texts was undertaken to examine the extent to which neoliberalism is \nmanifested in this study. It must be noted that policy texts are presented here as serving the \nstrategy of legitimation (Apple 2001) where they define aims and objectives and \nconcomitantly identify areas that need ‘special’ attention. The aims and objectives \ncontemplated by the Robbins Report initially articulate broad values in higher education.  \nThis can be seen in the response to the general question posed in paragraph 22 that is “to \nbegin with aims and objectives - what purposes, what general social ends should be served by \nhigher education?”(1963:6). Paragraph 23 on the same page responds to this question by \nsuggesting that various areas of study that draw from eclectic sources or disciplines, tourism \nbeing of interest here, be allowed a place in higher education.  \n \nParagraph 25 provides an entry point for and thus rationalizes the emphasis on skills \ntraining by presenting it as something that has for a long time been subordinated in \n 22 \nhigher education.  It also valorizes the perception of higher education in terms of \nfuture career prospects, arguing that it is something one should not be ashamed of.  \n…Certainly this was not the attitude of the past: the ancient universities of \nEurope were founded to promote the training of the clergy, doctors and \nlawyers; and though at times there may have been many who attended for \nthe pursuit of pure knowledge or of pleasure, they must surely have been a \nminority (Robbins Report 1963:6). \nThe strategy here is to draw on history to defend the emphasis on skills and vocational fields \nof study in higher education while simultaneously vitiating any other counter claims. Such \nadvocacy for skills draws attention to the fact that it was a ‘mere’ attempt to create balance in \nhigher education that embraced the ‘ivory tower’ mentality (Barnett 1990). But the way in \nwhich ‘skills’ in higher education later accrued a wide field of meanings, associations and \nconnotations came to surpass this original articulation which did not refer to skills any more, \nit became an articulation of something else, an ideology known as vocationalism. It must \nhowever be noted that vocationalism and skills training are not exactly synonymous; rather, \nthe former encompasses the latter whilst not being reducible to it.  \n \nIn the last part of paragraph 25 can be discerned the way in which emphasis on skills, career \nprospects and in essence vocationalism as an ideology, serves to articulate neoliberalist \nideals. Thus the view that \n… In our own times, progress - and particularly the maintenance of a \ncompetitive position - depends to a much greater extent than ever before on \nskills demanding special training. A good general education, valuable \nthough it may be, is frequently less than we need to solve many of our most \npressing problems (Robbins Report 1963:6).  \n 23 \nIn a Foucauldian sense, the articulation of skills as a particular objective to be pursued in \nhigher education brings to the fore a distinct ‘regime of truth’ initially in higher education.  \nHere, further policy statements begin to emerge and to legitimize not only ‘skills’ but also the \nrelationship amongst ‘skills’, ‘competition’ and ‘progress’. This, it is argued, is one way in \nwhich neoliberalism articulated through concerns for ‘skills’ and thus vocationalism, starts to \nfeature initially in higher education.  \n \nWithin the present context, the HMI Report (1992: 7) paragraph 16, points to the strong link \nbetween the aims of tourism and related courses and employment. This is seen in the sentence \n‘a common aim is to “equip students with the understanding and skill” required to be \n“effective managers”…’ These concerns, particularly with skills become even more apparent, \nin the CNAA Review Report (1993) on Tourism Studies Degree Courses in the UK. Apart \nfrom pointing to the common sense view that ‘degrees and postgraduate qualifications in \ntourism are “primarily vocationally oriented”’ (CNAA 1993:1), paragraph 1.4 alludes to an \nimportant discursive strategy deployed in many programs. That is, the strategy of making \nreference to statistics or some other source of information from institutions with established \nauthority as a basis to describe the aims and objectives of tourism programs The CNAA \nReport then quotes a typical prospectus in paragraph 1.4 that makes initial reference to the \ngovernment Department of Employment in describing the aim of the tourism course in \nquestion.  \n \nGiven that the Department for Employment at that time was the national authority \nresponsible for employment and skills inter alia, such a strategy connotes a response to \n‘national concerns’, particularly at a time when the state agencies sought to address the high \nlevel of graduate unemployment (Botterill and Gale 2005). The strategy depicted in \n 24 \nparagraph 1.4 is also easily identifiable in contemporary prospectuses and it highlights the \nproblematic of competition where universities and colleges compete strongly for applicants. \nThis is necessary both as a means to meet policy objectives in increasing access to and \nwidening participation in higher education and to cover budgetary deficits (Delanty 2001; \nNewson 1994; DES 1987). It necessitates the adoption of marketing strategies that can \neffectively ‘sell’ programs on offer in order to realize the enrolment targets necessary to \nsustain course provision.  \n \nA cursory investigation into the framing of three undergraduate programs from the mature \ndisciplines of law, sociology and philosophy points to the difference with tourism in \nconstructing course aims (vignette 2). For instance, London Metropolitan University states \nthe aim of its sociology program as follows: “This course has been designed to give you an \nin-depth knowledge of sociology and contemporary social issues. It emphasizes the applied \nnature of sociological knowledge and inquiry… (Vignette 2). Meanwhile, London School of \nEconomics and Political Science (LSE) describes its undergraduate program in Philosophy, \nLogic and Scientific Method by emphasizing some central themes within the discipline of \nphilosophy, with no direct appeal to any particular employer or professional body. \nInterestingly, it mentions service based industries (excluding tourism) as places where recent \ngraduates have been employed. Finally, The University of Surrey’s law program promises the \nstudents the prospects of tackling “fundamental questions facing society…” and also \ndevelopment of professional skills. \n \nWhat is noteworthy from these two reports (HMI 1992; CNAA 1993) and the course titles \ndrawn from different universities that provide tourism programs (in vignette 2) is that the \ncommon thread is preparing students for work or management careers in the industry. For \n 25 \ninstance there is no mention anywhere in the last two reports and in vignette 2 about \n‘development of the powers of the mind’ or ‘cultivated’ students, which contrast with the \naims of Sociology, Law (a predominantly vocational discipline) and Philosophy just \ndescribed (vignette 2). Meanwhile the term ‘skills’ whether these are ‘in-depth skills’ or \n‘skills required in travel and tourism operations’ or ‘problem-solving skills’ is prevalent in \nthe tourism prospectuses interrogated in this study. In the same vein, the implied definition of \ntourism here seems to be that of a business in which the key players are the industry and the \nemployers. This is construed as one way in which neoliberalism appears in tourism higher \neducation. \n \nUnlike the Robbins Report, paragraph 1.5 of the 1987 Education White Paper (DES 1987:2) \nalludes to “meeting the needs of the economy” and how “this aim…must be vigorously \npursued”. This also points to a strategy that deploys public policies in legitimizing economic \nimperatives in higher education (Little 2005) through what Foucault (1994) might describe as \na form of ‘governmental technique’. It results in to the partial fixation of the most dominant \nmeanings that eventually assume hegemonic status (Laclau and Mouffe 1985; Torfing 1999).    \nBut to attain this sort of hegemony necessitates the constructing of a set of schema that \njuxtaposes some of the ‘new’ values being espoused along with concepts ‘naturally’ \nassociated with higher education that seem innocuous (Wright 1989; Harvey 2006).  Hence in \nparagraph 1.5, “achievement of greater commercial and industrial relevance in higher \neducation”; is associated with “teaching, research, technology transfer and on occasions, \nhelp…with equipment and finance” as well as “… positive attitudes to enterprise which are \ncrucial for both institutions and their students” (DES 1987:2).  This could be mentioned as \none context in which tourism higher education (perceived and) pursued mainly through the \nlenses of business and management framework can be understood.  \n 26 \nAn example from the literature deserves mention here, which is closely tied to the importance \nof tourism as a driver of a postmodern economy and its business and management \nsituatedness in higher education. Describing knowledge in subjects such as tourism as a \nvaluable commodity, Botterill and Gale (2005:477) observe that “higher education in general \nand tourism in particular has increasingly become politicized as a part of macro-economic \npolicy and international relations”. Adding that this is a positive development for tourism \nstudies, the tutors, and institutional managers inter alia, who have interest in controlling \naccess to the commodity. They however point out that  \n“the pursuit of an intellectual basis for subject development becomes subject to \nincreasing amounts of (distorting) commercial pressure. Locally, institutional \neconomic reality drives a managerialist strategy; recruitment targets and income \nstream projections….tutors find themselves embroiled in achieving economic \nperformance indicators and not intellectual projects” (2005:478).  \nThis view is further reinforced in paragraph 1.6 through an implicit ‘carrot and stick’ \nmechanism where by it is stated  “the government and its central funding agencies will do all \nthey can to encourage and reward approaches by higher education institutions which bring \nthem closer to the world of business” (DES 1987:2). Here appears another face of \n‘governmental technique’ that attempts to use this policy to wield a certain form of power to \ninduce HEIs into acting in the predetermined way.  That is, to work in partnership with \nindustry and commerce as a means to ensure the competitiveness of the economy and other \nbenefits thought to be realizable from such partnerships. Paragraphs 1.5 and 1.6 connote the \nway in which neoliberalist ideals are legitimated and valorized in higher education, and why \nit may not be a surprise when a new field of study such as tourism begins to embrace such \nvalues to the exclusion of others.  \n \n 27 \nHowever an account of tourism higher education in mainland China (Zhang and Fan 2005) \nand Hong Kong (Lo 2005) suggest there are deliberate attempts espoused by academics to \nembrace the neoliberal approach to tourism education.  For example Wen Zhang and Xixia \nFan make a number of suggestions for enhancing tourism higher education in China by \nfocusing on issues such as the formation of subject association, enhancing the reputation of \nthe discipline and effective teaching methods and so forth. A noteworthy suggestion with \nreference to this paper is the call for cooperation with industry through “offering tailor-made \ntraining programs and participating in consultancy and management of tourism enterprises” \nin return for “financial support from the industry…and that “such an educational system can \noptimize the allocation of resources and adapt to the law of the market” (2005:132-133).  \nThis particular example serves to highlight the importance of the definition of ideology \ndeployed in this paper, that is, it can be externally imposed or self-imposed (Barnett 2003), a \nstrategic approach to ensuring survival.  \n \nThese views are reiterated in later policy reports whereby the Dearing Report crucially re-\nstates the key issues initially seen in the Robbins Report, and the role of competition from \nexternal forces as well as implications for the economy are once more well articulated as seen \nin paragraphs 23 and 24 (Dearing Report 1997). The 2003 Education White Paper (DfES \n2003:8) makes reference to the Robbins Report and emphasizes the links between higher \neducation, the economy, business and employment.  These are captured under the subtitle on \nvalues, in paragraphs 1.1 under ‘national asset’ and ‘contribution to the economic and social \nwell-being’; in 1.2 ‘teaching “educates and skills” the nation for a knowledge-dominated age’ \nand 1.3 ‘Working with business, it “powers the economy”’.  But of course one aspect that \nseems to have found a special meaning in tourism higher education (cf Airey and Johnson \n1998; Stuart-Hoyle 2003) is taken from 1.3, thus ‘in a… competitive world, the role of higher \n 28 \neducation in equipping the labour force with appropriate and relevant skills…is central’ (cf \nparagraph 24, Dearing Report 1997:20).  \n \nThe values articulated in these policy and committee reports are construed in this study as the \nlegitimizing techniques in government policy intended to re-structure higher education \nthrough an economic rationality and also inducements to work with industry.  The overall \ngoal here is to ensure higher education plays an important part in creating and enhancing the \ncompetitiveness of the economy.  This implies an overt attempt at policy level to espouse \nneoliberalism as a dominant ideology in higher education, articulated with and\/or through \nvocationalism and managerialism.  \n \nA remarkable example that showcases the entrepreneurial logic and external influence on \ntourism higher education through partnerships with employers and community suffices for \nillustration.  This was traced to the MA in Tourism Business Administration offered by \nBirmingham College of Food, Tourism and Creative studies (now known as University \nCollege Birmingham), quoted at length here below. \n …All of our courses are the result of close cooperation with employers and \nthe community. We take care to consult large and small employers… when \ndesigning new courses and when renewing the operation of others. We even \ninvite employers to help us make decisions on whether we should run \nparticular courses. A long experience of working with employers has \nhelped us to develop a responsive 'tailor made' service, in which the \nparticular needs of individual (or consortia) of employers are met through \nspecially designed courses…  \n 29 \nTaken in the context of the policy imperatives to ensure higher education-industry links and \nalso relevance of programmes to employers, this is a laudable move, perhaps not so unique to \nBirmingham. In describing the impact of government budget cuts in Hong Kong higher \neducation, Ada Lo (2005) urges tourism education to adopt an approach similar to \nBirmingham’s (just described). The most striking example here is the view that industry \nparticipates in \nselecting candidates for hospitality and tourism programs, …to help the educational \ninstitutions in selecting candidates with the appropriate attitude, personality and \npassion for the industry…Currently both universities offering degree programs are \ninviting industry executives to participate in panel interviews for the applicants \n(205:163). \nThis state of affairs is not easily discernible from prospectuses on sociology, philosophy and \nlaw, which make general reference to a broad understanding and application of their \ndisciplines. The over reliance on external publics in the foregone examples is therefore seen \nas an attempt to fulfill the ‘market relevance’ of the programs (Koh 1995) and also a strategy \nfor coping with budgetary cuts from the state.  The choices resulting from such programmes \nreflect the key interests of the main external players in a way that challenges the idea of \nmaturation of a field of study in higher education.  A key understanding of maturation \nconventionally entails minimum (if at all) external pressure in defining and possibly revising \nwhat needs to be taught or discarded (Newson 1994; Barnett 2000).  However, to proceed \nwith these discussions, it is imperative to demonstrate how managerialism fits in to this \ncomplex picture.   \n(Vignette 2 to be inserted here) \n \n \n 30 \nManagerialism as a Form of Surveillance and Normalizing Discourse \nTo continue with the analysis, the paper looks at the role of the terms ‘performance’ and \n‘competition’ identified previously to further explore the extent to which managerialism and \nneoliberalism are represented in tourism higher education.  The salience of this observation \ncan be traced in the work of the QAA, particularly its subject reviews (Peters 1992; Brennan \nand Shah 2000). For instance the stated purposes of subject reviews according to QAA \n(2001) Subject Overview Report for Hospitality, Leisure, Recreation, Sport and Tourism are: \nTo ensure that the public funding provided is supporting education of an \nacceptable quality, to provide public information on that education through \nthe publication of reports, and to provide information and insights in order \nto encourage improvements in education. (QAA 2001:2). \nThis highlights Newson’s preceding description of managerialism in higher education \nthrough external influence among other things.  It allows for the notions of ‘performativity’ \nand ‘competition’ to be explored as well as the manifestation of the inherent ideologies.  \nLyotard (1984: xxiv) uses the notion of ‘performativity’ to explain the discourse of business \nand management that are pivoted around “optimizing [a] system’s performance-efficiency”.  \nAs a crucial way of achieving its purpose, the QAA undertakes subject reviews described as \nfollows: \nSubject review is carried out in relation to the subject aims and objectives \nset by each provider. It measures the extent to which each subject provider \nis successful in achieving its aims and objectives….  Subject reviews \n…cover the full breadth of teaching and learning activities…captured \nwithin a core set of six aspects of provision, each of which is graded on a \nfour-point assessment scale (1 to 4), in ascending order of merit. The \naspects of provision are: Curriculum Design, Content and Organisation; \n 31 \nTeaching, Learning and Assessment; Student Progression and \nAchievement; Student Support and Guidance; Learning Resources; Quality \nManagement and Enhancement (QAA 2001:2). \nThis implies that HEIs inevitably become entangled in complex power relations with QAA \nand effectively the government and the general public,   ‘forcing’ them to keep a watchful \neye on themselves.  In other words, HEIs become subject to the play of external forces, while \nsimultaneously taking positions as authors and subjects of their own conducts (Foucault \n1994; Davies 2006).  This is compounded by the fact that the aims and objectives are set out \nby the provider, but these ought to reflect the ‘core set of six aspects of provision’ outlined by \nQAA, thus not completely as provider-instigated as it looks at the surface. It therefore seems \nappropriate to suggest that apart from the RAE mentioned previously, managerialism \nbecomes manifest in HEIs through the discourse of quality, turning  ‘acceptable quality’ in \nhigher education into one of the main normalizing discursive formations through which it \npermeates in and through tourism higher education.  \n \nIn a Foucauldian sense, it is where the power of surveillance becomes intricately woven into \nthe aims and objectives pursued by HEIs against which they get judged and which in turn \ndistributes them in this more or less permanent and continuous field (Hollinshead 1999; \nRabinow 1984; Davies 2006).  This is preconditioned by the two way review process that \nentails: \n1. Preparation by the subject provider of a self-assessment in the subject, \nbased on the provider's own aims and objectives, and set out in the structure \nprovided by the core set of aspects of provision.  2. A three-day visit carried \nout by a team of reviewers. The team grades each of the aspects of \nprovision to make a graded profile of the provision, and derives from that \n 32 \nprofile an overall judgement. Provided that each aspect is graded 2 or \nbetter, the quality of the education is approved (QAA 2001:2). \nThe process connotes the pinnacle of performativity in that it encompasses an elaborate \npreparation by HEIs in terms of specially written scripts that cover the aspects of provision to \nbe reviewed.  This may well involve setting targets and working to achieve them in a way \nthat may come to mimic quasi-legal frameworks intended to fulfill contractual performance \nobligations to funding agencies, the students and the general public.   \n \nHowever it is important to realize that ideologies may be imposed or willingly entered into \n(Barnett 2003).  To illustrate the turns in the performative and thus competitive culture that \nresults from this process of quality assurance, analysis of ‘An International Handbook of \nTourism Education’ was found revealing.  It encompasses an elaborate coverage of the key \nissues that preoccupy the QAA.  This is found in the last three parts of the book under the \nsection titles ‘Teaching, Learning and Assessment’; ‘Resources, Progression and Quality’ and \nfinally under the ‘Postscript’.  In all, there are fifteen chapters devoted to discussing these \nissues, (of which authors of nine chapters are from HEIs in England).  But even more crucial \nis the fact that chapter titles closely reflect the six core aspects of provision on which the \nQAA subject reviews focus, apart from explicit references to QAA and the Dearing Report to \nexplain the relevant issues.  For instance, chapter 21 focuses on ‘student experience’, chapter \n23 entails ‘assessment’, chapter 27 looks at ‘teaching and research’ all of which are the key \nareas of QAA’s subject review.  \n \nLikewise, chapter 30 focuses on ‘learning resources’; chapter 32 is devoted to ‘quality \nassurance’ and chapter 34 under postscript addresses ‘practical issues for design, delivery, \nevaluation and resourcing of courses’.  An important observation here is that unlike the \n 33 \nauthors of the International Tourism Higher Education, similar emphasis on quality assurance \nemanating from external sources were not directly traced from the authors of Global Tourism \nHigher Education (that really only focuses on Australasia, Europe and North America). \nInstead, one notes the concerns expressed by academics on quality of programs, curriculum, \nresources and teaching among other issues, particularly by authors from Turkey, China, Hong \nKong and Taiwan. Highlighting the coverage of features of quality assurance in these books \nserves to demonstrate the normalizing effects of managerialism.  In other words, how these \nideologies have been simultaneously imposed and embraced with some resistance that \noperates under the double function of mastery and submission (Davies 2006).  \n \nAn example suffices.  After a detailed discussion of quality assurance in chapter 32, Robbins \nnotes in the conclusion that  \nThe UK agenda is substantially set by the QAA to which institutions have, \nout of necessity, acquiesced. They have developed a “language” of quality \nwhich focuses on “standards” and “academic quality” placing the emphasis \non student achievement and student experience, for which the QAA has \ndeveloped techniques to judge and to measure. …. the lecturers’ response to \ntheir institution’s performance under Subject Review…is as strong an \nendorsement as one could reasonably expect, despite their criticisms over \ntime, effort and stress that the process created. ….. (Robbins 2005:467-468) \nThis is where discursive regularities emanating from the QAA avoid direct central regulation \nbut determine the rules of the game, the forms and limits of what can be achieved so that \nHEIs are governed through remote control (Foucault 1972; Marginson 1997; Vidovich 2002).  \n \n 34 \nThese ideologies thus appear both inescapable and self-imposed.  This stems from the \nrealization that the outcome of performative undertakings for the purpose of quality assurance \ntend to create conditions of possibility for tourism higher education to gain credibility and \nacceptance both within higher education and also from the general public.  This is the result \nof the requirement to publish review reports by the QAA as contained in this excerpt below \nIn addition to individual report of reviews, the QAA publishes subject \noverview reports at the conclusion of reviews in a subject... The subject \noverview reports are distributed widely to schools and FE colleges, public \nlibraries and careers services. … (QAA 2001:2). \nThe distribution of reports has been widely used as a marketing tool by various HEIs that \nprovide tourism programs, depicting the difference in strategy, based on research or teaching.  \nFor instance the course website for Oxford Brookes mentions, ‘teaching in the Department of \nHospitality, Leisure and Tourism Management received an excellent rating in the last \nassessment by the Government's Quality Assurance Agency’.  In essence, it gives the public \ninformation about the legitimated quality of its ‘excellent’ teaching across the entire \ndepartment. Of course, as was shown in the preceding discussions, this is only one aspect of \nwhat QAA validates.  London Metropolitan University website emphatically states ‘our \ncourses are regularly reviewed by the Quality Assurance Agency for Higher Education. In the \nmost recent review our Business and Management provision [which also houses tourism \nprograms] was awarded the best possible rating and is officially classed as “Excellent”’.   \n \nMeanwhile both LSE and the University of Surrey highlight their 5* rated research highly, \nwith LSE declaring its quality assessment score of 22\/24 with no discernible rhetoric strategy \nto ‘sell’ the program. In a nutshell, the discourses of quality and research assessment have \nseen institutions (un) consciously join in the ‘competitive bidding’ for public support which \n 35 \nin turn has implications for student enrolments\/recrutiment and funding.  So that this act of \nwidely distributing reports of the review - very good in a sense - seems to (un) intentionally \nsupport the ‘long hands’ of the media in constructing league tables that may be of \ndisadvantage to some institutions and favorable to others. For instance league tables offer a \ndistinct marketing advantage to the University of Surrey as seen in this statement from the \ncourse website that is, ‘we are ranked 1st for Tourism Management in the Guardian League \nTable 2006’.  This statement comes as a response to the question ‘why study tourism \nmanagement at University of Surrey’?  This is bound to have an influence on the public in \nterms of choice of Tourism Management programs offered by University of Surrey compared \nto other HEIs.  It would be interesting to see how a university rated differently on the same \nleague tables develops its marketing strategy.   \n \nThe league tables effectively (and unduly) influence the student and public perception in a \nfragile and highly commodified world where market interests are increasingly shaping much \nof everyday reality (Marginson 1997; Fitzsimons 2002; Marginson and Considine 2000; \nDavies 2006; Barnett 2003).  This may also be one avenue through which HEIs offering the \nsame range of programmes find themselves engaging in unprecedented competition with each \nother.  What seems apparent then is that the type of information made available and the \naccess to it shape the type of response from the public on quality of provision of programmes \n(Fitzsimons 2002).  It is in this sense that neoliberalism is implicated as a dominant ideology \nrepresented in and through tourism higher education, where managerialism and vocationalism \nfunction directly and indirectly to operationalise its ideals.  \n \n \n \n 36 \nCONCLUSION \nThis study has attempted to bring to the fore some concrete workings and instances of \nneoliberalism and managerialism represented in tourism higher education in England in order \nto highlight the crucial but subtle role of power in mediating the relationship between tourism \nhigher education and the other institutions responsible for producing and disseminating texts \nanalyzed in this study.  It demonstrates that the new wave of changes in higher education \nrequire broad conceptualization and interpretation, necessitating a move away from narrow \nbut important issues on curriculum, teaching and learning to broader issues related to power, \nideology and discourse that have been well articulated in the sociology of knowledge, \npostructuralism and political science inter alia. The issues discussed here therefore depict a \nwider problem in higher education although the empirical data is restricted to England\/UK.  \n \nCompetition amongst institutions for students, need to make courses relevant to industry, \nconcerns over quality of provision are ‘universal’ issues in tourism studies and indeed in \nhigher education in general. But the extent to which these issues pervade tourism, a relatively \nnew field in higher education seems to surpass similar influences in mature disciplines in the \nhumanities and social sciences. The paper offers an explanation of the influence of \nneoliberalism and managerialism that have until recently remained only implicit in tourism \nliterature.  This in turn suffices to reveal the silent power of these ideologies in delimiting \nwhat can and cannot be said.  The paper suggests how it may be unwise to ignore the obvious \nand insidious influence wielded by them (Freeden 2001) on the everyday practices within \ntourism studies. The apparent driving force is changing government policy on higher \neducation. The emphasis on students’ learning experiences (positive in a sense) and the \njuxtaposition of learning, teaching and research with funding all necessitate considerable \nattention from HEIs in attempting to fulfill these contract-like obligations (Sigala and Baum \n 37 \n2003).  This is simply because excelling in these areas has implications for recruitment \ntargets as well as winning public confidence and by extension a bid for funding, (Newson \n1994).  Tourism higher education in this study context demonstrates a strong commitment to \nensuring the relevance of programs to students and end prospective employers. \n \nThis happens to be one of the paradoxes in which tourism studies is engulfed.  It befits the \ndominant representation and perpetuation of tourism as a vocational field of study in higher \neducation in England, underpinned by a business management framework (Stuart-Hoyle \n2003; Airey and Johnson 1998).  Such a paradox may be understood by drawing an example \nfrom elsewhere in which Clark (2006:138) while elaborating on the struggles of a new field \nof study in attaining a disciplinary status, notes that “being associated with a high status \ndiscipline such as mathematics was vital to computing [computer sciences] being taken \nseriously in the academy”. Within tourism higher education, Reichel (2005) offers an account \nof how tourism and hospitality programs at Ben-Gurion University in Israel ended up in the \ndefacto faculty. He notes that “the link with the prestigious faculty of engineering sciences \nhelped to position the department in terms of quality and emphasis on management issues” \n(2005:77). This paper perceives the ‘organic’ association of much vocational tourism \nprograms with business and management in a similar light. That is, a means to ensure \nrelevance of programs to students and employers as well as an (easier?) route to respectability \nwithin the largely conservative higher education academe. This perception is rationalized \namong other things by the observation that much tourism research end(ed) up under the unit \nof assessment for business and management, and the ensuing implications (Tribe 2003; Page \n2003). This however does not discount the significance attached to vocational tourism \nprograms with business management focus by educators, students and employers. \n \n 38 \nThis being the case in England, the plausibility of the accounts given in this study must be \nseen in the sense of opening up an agenda for ‘progressive research’ (cf. Barnett 1990) in \ntourism higher education. Such an agenda holds up to the view that any dominant ideas or \ndiscourses can only partially fix the meanings of social reality (Laclau and Mouffe 1985) and \na study such as this one and indeed other (minority) critical voices referenced here (Tribe \n2002; Page 2003; Botterill and Gale 2005; Burns 2004; Pritchard and Morgan 2007) will \nalways surface to articulate alternative views. Subsequently, the avenues for critical dialogue \non the discursive ideologies in question and their implications for practice continue to remain \nan open possibility.  \n \nWith this in mind, and also in recognition of the limitation of this study to England, the \nauthors wish to invite academics in other world regions to explore the extent to which such \ndiscursive ideological influences impact upon tourism higher education. It would be useful to \nexamine the extent to which government policies, local or global socio-economic and any \nother trends drive these influences, and how academics respond to these issues in different \nworld regions. The investigations may follow a similar line of enquiry or an approach that is \ncontext-specific, with the possibility of drawing analytical\/theoretical generalizations into the \nextent to which neoliberalism and managerialism have pervaded tourism higher education. A \ncomparison with trends in other (mature) disciplines is bound to be enriching.  The paper \nconcludes by posing the question ‘to what extent has such a discursive ideological \nconstruction of tourism higher education in England or indeed elsewhere resulted in \n‘respectability’ within the largely conservative higher education academe?  \n \n \n 39 \nVignette 1: Details of Texts and Justification for their selection for analysis \n \nCategory one: Policy and Related Texts \nThe Robbins’ Report was commissioned by the government in 1961 and published in 1963.  It raised many issues of concern in \nhigher education to, and their implications for different interest groups and institutions in the UK.  Of interest to this study was \namong other things concerns raised over questions on whether narrowly vocational subjects should have a place in the university \ncurriculum.  This particular issue of vocational subjects and their place in university curriculum (broadening undergraduate \ncurriculum) have had ramifications for tourism higher education in the UK (Airey 2005). Much has changed in higher education \nsince the publication of this Report and some of these changes have been manifest in tourism higher education.  This consideration \nresulted in the inclusion of the Robbins’ Report for the final analysis, which focused on chapter II, paragraphs 13 to 40.  The \nchapter covers the ‘Aims and Principles’ of full time higher education in Great Britain and a host of related issues deemed \ninsightful for this study. \nAlso included for the present analysis was the Dearing Report of the National Committee of Inquiry in Higher Education (NCIHE) \npublished in 1997.  Like the previous Reports, it raises issues of concern in higher education to the government, institutions of \nhigher education, individual members of society, students, public and the private sector and so forth.  Of interest to this present \nstudy were: widening participation in higher education to previously excluded members of society; the contribution of graduates to \nthe economy; students and learning; the nature of programmes; and, qualifications and standards in higher education.  Tourism \nhigher education is one area where statistics shows an unprecedented increase in student numbers in the last three decades (Airey \n2005; Botterill and Gale 2005).  For that reason, the Dearing Report was included as part of the texts analysed in this study, \ndrawing mainly on some of the recommendations, (one of which has been the establishment of the UK's Quality Assurance Agency \nfor higher education) but also other insightful paragraphs for interrogation.   \nThe 2003 Education White Paper on “The Future of Higher Education” produced by the former Department for Education and \nSkills (DfES 2003).  Highlighted in this White Paper is the observation that universities exist in an increasingly dynamic and \ncompetitive world that results into two main challenges they must address.  First, the need for these Universities to make better \nprogress in harnessing knowledge to the process of creating wealth.  Secondly, to extend the opportunities of higher education to all \nof the population, irrespective of their personal and economic background.  Some of the issues of interest to this study included: the \nlink between higher education and business (industry), teaching and learning, expanding higher education, fair access and widening \nparticipation in higher education among others.  Commentaries in the literature show that some of these issues have specific \nramifications on tourism higher education (Airy 2005; Tribe 2003), although these commentaries do not explain the role of \ndiscourses in and\/or through which these ramifications have been realized.  Likewise, the White Paper also highlights some issues \nthat initially appeared in the previous two Committee Reports into higher education, thus a good example of intertextuality (the \nlatter describes “how texts draw upon, incorporate, recontextualize and dialogue with other texts (Fairclough 2003:17) )in this \nstudy.  This made the 2003 Education White Paper a part of the source data for this present analysis, where interrogations focused \non some recommendations and specific paragraphs. \n The 1987 Education White Paper on “Higher education: Meeting the Challenge” was considered for analysis, at a later stage of this \nstudy.  This was based on the realization that some key themes in this study, particularly on increasing access to and widening \nparticipation in higher education, as well as concerns with quality and efficiency had been articulated in this paper.  It meant later \ntexts such as the Dearing Report and the Education White Paper for 2003 for instance were expounding on issues previously \ncontained in this White Paper, which also drew on the Robbins’ Report of 1963.  Theoretically speaking, this happened to be a \ngood example of theoretical sampling, intertextuality and the iterative nature of sampling in practice, hence its inclusion in the final \nanalysis.   \nCategory two: Tourism and Higher Education Institutions Texts \nThe Council for National Academic Awards (CNAA) was until 1993, the largest single degree-awarding body in the UK outside \nthe universities.  Established in 1987, the Council’s committee for consumer and leisure studies undertook several systematic \nreviews of all the degree subjects for which it was responsible.  There were over 140 institutions offering first degrees and \npostgraduate level courses approved by the CNAA.  The institutions involved included polytechnics, institutions of higher \neducation, Scottish central institutions, colleges of art and various other colleges throughout the UK.  This was abolished by the \n1992 UK Further and Higher Education Act.  Of particular interest to this study was the fact that many tourism studies degree \ncourses in the former polytechnics, some of which are the new universities in England were being monitored, reviewed, validated \nand awarded by this body.  It was thus felt a lot could be discerned from CNAA in terms of the authority vested in it. But perhaps \nmore crucially, it seemed to be an avenue through which the status of tourism studies in HEIs (in the past and at the present) could \nbe put in perspective.  This study therefore included for analysis a report on the “Review of Tourism Studies Degree Courses” \npublished by the CNAA in 1993.   \nQuality and standards in schools and within higher education outside the universities in the UK has been until recently the province \nof Her Majesty’s Inspectorate (HMI) since its establishment in 1839 (Lee and Fitz 1997).  This implied that HMI had \nresponsibilities both in considering and advising on the quality delivery of the curriculum.   In this regard there have been a series \nof publications by HMI on different themes concerned with higher education.  One such publication that was considered for \ninclusion in this study was on the theme “Higher Education in the Polytechnics and Colleges: Hotel, Catering \n 40 \n \nand Tourism”. The report published in 1992 describes and assesses the provision of these subject areas in \npolytechnics and other colleges, as well as the local authority sectors of higher education.  Some of these former \npolytechnics are the new universities or the so-called post 1992 universities in the UK.  Some issues in this report \nsuch as: the link between colleges and industry in planning courses; programmes providing good balance between \ntheory and practice; the strong vocational commitment amongst teaching staff and students to the hotel, catering and \ntourism industries all reflect some of the existing debates in tourism higher education.  These also point closely to \ngovernment policy pronouncements on higher education in the whole country. This publication was therefore \nconsidered an important resource in addressing the objectives set out for this study.   \nThe government established the QAA in 1997, and since then, it has the responsibility of assessing the quality of \nhigher education in England and Northern Ireland under the terms of contract with the Higher Education Funding \nCouncil for England.   Of interest to this study was the idea of quality in tourism higher education, an issue with \nwhich tourism higher education like any other programme of higher education is pre-occupied.  It was of interest to \nthis study to interrogate the meanings and values attached to socially constructed concepts such as “quality” and how \nthis in turn facilitates a discernment of the discursive ideologies inherent.  On this basis, the “Subject Overview \nReport for Hospitality, Leisure, Recreation, Sport and Tourism\" published by the QAA following the 2000-2001 \nquality assessment exercise was included for analysis. This, it was envisaged would be crucial to revealing the \ndiscursive nature of tourism higher education in the study context. \n \nCategory three: Tourism Higher Education Resource Text \nThis book reflects the current thinking on some of the key themes in this present study.  This includes concerns with \nthe curriculum, teaching and learning, resources, progression and quality.  These key themes have found a dominant \nexpression in particularly policy related texts and other national and tourism higher education texts such as CNAA \nand QAA.  Given its recent date of publication at a time when this study was being contemplated, it was considered \nworthwhile to investigate the discourses inherent and the overall implications of the way different texts emanating \ndirectly from tourism higher educators pronounce themselves on tourism higher education in the study context.  This \ntext was therefore included in the final analysis for this study. \nCategory Four: Prospectuses from Higher Education Institutions in England \nThis last category included a selection of prospectuses of various universities and colleges of higher education that \noffer tourism at undergraduate and taught postgraduate levels in England.  The prospectuses are the most readily \navailable public documents that describe key features of a given programme of study.  The previous studies on the \naims and purposes of tourism education in the UK (Airey and Johnson 1998) drew mainly from prospectuses.  The \nlatter were regarded as reflecting both explicitly and implicitly the various discourses that construct tourism higher \neducation as presented to international, national and local audiences. In this light, 11 prospectuses were earmarked \nfor analysis, but only 6 were included in the final study, based on the relative ease with which information was \ndownloadable and suitable for editing.  An important discriminating criterion was to ensure both pre and post 1992 \nuniversities were included, the latter of which are in the majority in terms of provision of tourism programmes in the \nUK.  The final list of prospectuses analysed in this study were drawn from: Birmingham College of Food, Tourism \nand Creative Studies (now referred to as University College Birmingham) (http:\/\/www.bcftcs.ac.uk); London \nMetropolitan University (www.londonmet.ac.uk); Oxford Brookes University (www.brookes.ac.uk); University of \nSurrey (http:\/\/www.surrey.ac.uk); University of Brighton (http:\/\/www.brighton.ac.uk); London School of Economics \nand Political Science (http:\/\/www.lse.ac.uk\/) and University of Teesside (www.tees.ac.uk). \n 41 \nVignette 2: Aims and Objectives of Programs from Selected Prospectuses \n \n \nPurpose of BA (Hons) (BA CertHE) DipHE Entrepreneurship in Travel and Tourism at University of Brighton \nThe course prepares students for the unique challenges they will face in the start-up and management of small businesses within the \ntravel and tourism sector. Skills required in travel and tourism operations are integrated with administrative and problem-solving \nskills essential to the management of small businesses. In addition, students are able to learn the concept, development, marketing \nand business planning techniques that will enable them to develop the necessary entrepreneurial skills for success.  \nPurpose of Bsc (Hons) Tourism Management at University of Surrey \nThe degree is designed for students who wish to understand and make a career in one of the largest Sectors of the world economy. \nHigh-level study of Management and business is combined with opportunities to develop understanding and insights into the \ncomplex range of business, social and cultural issues raised by tourism.  \nAims of BA (Hons) Leisure and Tourism Management at University of Teesside \nIt's designed to produce graduates with an understanding of business, specialist knowledge of the leisure and tourism industry and \ngood communication skills. You'll examine the social, economic and political issues which influence leisure and tourism related \norganisations in terms of their activities and decisions made by their managers. You'll also gain the ability to apply what you've learnt \nto 'real world', practical management situations.  \nApplied Social Sciences: Sociology (Bsc Hons Single, Joint) at London Metropolitan University \nThis course has been designed to give you an in-depth knowledge of sociology and contemporary social issues. It emphasizes the \napplied nature of sociological knowledge and inquiry, and focuses on providing a practical knowledge of sociological methodologies \nand research approaches. You will also have extensive opportunities to choose specialist areas such as the sociology of cities, \nethnicity and race. The course aims to enable you to own and apply sociological perspectives, concepts and research methods in order \nto understand contemporary society, social relations and social data. \nhttp:\/\/www.londonmet.ac.uk\/ug-prospectus\/courses-08-09\/sociology.cfm \nPhilosophy, Logic and Scientific Method at London School of Economics and Political Science \nStudying philosophy means engaging with some profound and fascinating questions; questions that any inquisitive and critical \nthinker will find her or himself asking at some point in her or his life, but which many non-philosophers do not pursue in depth.  \nSome of these questions are: \n• How does science generate knowledge? What distinguishes knowledge from superstition, ideology or pseudoscience?  \n• Can we hope to have as exact a knowledge of humans and human society as scientists seem to have of electrons and \nplanets; and can the methods of the physical sciences be applied to psychology, sociology, etc? Or does the existence of \nconsciousness and free will call for a different kind of knowledge and different kinds of methods of investigation when \ndealing with humans?  \n• What does morality require? What reasons do we have to act as morality requires?  \n• What does it mean to say that we have 'free will'? What type of freedom of the will is required for moral responsibility?  \n• Is death bad for the person who dies?  \nRecent graduates have gone on to work in the areas of media, financial services, management consultancy, and education, and have \nalso proved very successful in gaining entry to postgraduate programmes.  \nhttp:\/\/www.lse.ac.uk\/resources\/undergraduateProspectus2008\/courses\/Philosophy_Logic_and_Scientific_Method\/Default.htm \nWhy study Law at Surrey? \nLaw at the University of Surrey is both challenging and rewarding. As a law student you will tackle the \nfundamental questions facing society, develop your understanding of key areas of English and European \nLaw and investigate and evaluate ideas like fairness, justice and equality. You will be provided with a \nstimulating learning environment that blends traditional and modern teaching methods. Not only \nwill you be challenged to understand the law, but you will also be encouraged to apply it and to \ndevelop your professional skills. The School of Law is particularly proud of its long tradition of providing \nstudents with legal work placements as part of their study and of its links with the local legal profession. \nwww.surrey.ac.uk\/law \n \n 42 \nREFERENCES \nAirey, D., and S. Johnson \n1998 The Profile of Tourism Studies Degree Courses in the UK, Guideline 7: 1997\/98.  \nLondon: The National Liaison Group for Higher Education in Tourism.  \nAirey, D., and J. Tribe, Eds. \n2005 An International Handbook of Tourism Education. Oxford: Elsevier. \nApple, M. W.  \n2001 Comparing Neo-Liberal Projects and Inequality in Education. Comparative Education \n37(4):409-423. \nAronowitz, S., and H. Giroux  \n1991 Postmodern Education: Politics, Culture and Social Criticism. Minneapolis: \nUniversity of Minnesota Press. \nBaird, L.  \n2006 Moving into the Next 75 Years. Journal of Higher Education 77(1): I-ii. \nBarnetson, B., and M. Cutright  \n2000 Performance Indicators as Conceptual Technologies. Higher Education 40(3): 277-\n292. \nBarnett, R. \n1990 The Idea of Higher Education. Buckingham: Open University Press. \n2003 Beyond All Reason: Living with Ideology in the University. London: Open University \nPress. \n2000 Supercomplexity and the Curriculum. Studies in Higher Education. 25 (3): 255-265 \nBaum, T.  \n2006 Human Resource Management for Tourism, Hospitality, and Leisure: An \nInternational Perspective. London: Thomson \n 43 \nBaum, T and E. Szivas \n2008 Human Resource Development in tourism: A role for government? Tourism \nManagement 29 (2008) 783–794. \nBotterill, D.  \n2002 Tourism Studies and Research Quality Assessment in UK Universities. Journal of \nHospitality, Leisure, Sport and Tourism Education 1 (2): 71-74 \nBotterill, D. and T. Gale \n2005 Postgraduate and PhD Education. In An International Handbook of Tourism \nEducation, Airey, D., and Tribe, J. eds. Oxford: Elsevier, pp. 469-480 \nBrennan, J. and T. Shah \n2000 Quality Assessment and Institutional Change: Experiences from 14 Countries. Journal \nof Higher Education 40(3):331-349. \nBurns, P. \n2004 Tourism Planning: A Third Way? Annals of Tourism Research, 31(1): 24–43. \nBusby, G.  \n2001 Vocationalism in Higher Level Tourism Courses: the British Perspective. Journal of \nFurther and Higher Education 25(1):30-43. \nClancy, M.  \n1999 Tourism and Development: Evidence from Mexico.  Annals of Tourism Research, \n26(1): 1-20 \nClark, M. \n2006 A Case in the Acceptance of a New Discipline. Studies in Higher Education \n31(2):133-148. \nColes, T., M. Hall., and T. Duval. \n2006 Tourism and Post-Disciplinary Enquiry. Current Issues in Tourism 9 (4\/5): 293-319. \n 44 \nCooper, C. and R. Shepherd.  \n1997 The Relationship between Tourism Education and the Tourism Industry: Implications \nfor Tourism Education. Tourism Recreation Research. 22 (1): 34-47 \nCouncil for National Academic Awards  \n1993 Review of Tourism Studies Degree Courses. Committee for Consumer and Leisure \nStudies, CNAA. \nDavies, B.  \n2006 Subjectification: the Relevance of Butler's Analysis for  \nEducation. British Journal of Sociology of Education 27 (4):425-438. \nDelanty, G.  \n2001 Challenging Knowledge: The University in the Knowledge Society. Buckingham: \nOpen University Press. \nDepartment for Education and Skills (DfES)  \n2003 The Future of Higher Education: White Paper. London: HMSO (cm 5735) Sourced \n<http:\/\/www.dfes.gov.uk\/hegateway\/uploads\/White Pape.pdf> (20 September 2006). \nDepartment of Education and Science (DES)  \n1987 Higher Education: Meeting the Challenge: White Paper. London: HMSO, (Cmnd \n114). \nEagleton, T.  \n1991 Ideology: An Introduction. London: Verso. \nEchtner, C. M. and T. Jamal. \n1997 The Disciplinary Dilemma of Tourism Studies. Annals of Tourism Research 24 (4): \n868-883. \nEvans, N.  \n 45 \n2001 The Development and Positioning of Business Related University Tourism Education: \nA UK perspective. Journal of Teaching in Travel & Tourism 1 (1): 17-36 \nFairclough, N.  \n2003 Analysing Discourse: Textual Analysis for Social Research. London: Routledge. \n1995 Critical Discourse Analysis: The Critical Study of Language. Harlow: Longman. \nFayos Solà, E.  \n1997 An Introduction to TEDQUAL (Tourism Education Quality), 1st ed., Madrid: World \nTourism Organisation (WTO). \nFitzsimons, P.  \n2002 Neoliberalism and Education: The Autonomous Chooser. \nRadical Pedagogy 4(2): Sourced <http:\/\/radicalpedagogy.icaap.org\/content\/issue4_2\/> (31 \nDecember 2006) \nFoucault, M.  \n1994 Power. New York: New Press. \n1988 Madness and Civilization: A History of Insanity in the Age of Reason (R. Howard, \nTranslator). New York: Vintage Books. \n1972 The Archaeology of Knowledge. London: Tavistock. \nFreeden, M.  \n2001 Editorial: What is Special about Ideologies? Journal of Political Ideologies 6(1):5-12. \nGillespie, C., and T. Baum \n2000 Innovation and Creativity in Professional Higher Education: Development of a CD-\nRom to Support Teaching and Learning in Food and Beverage Management. Scottish \nJournal of Adult and Continuing Education, 6 (2):147-165 \nHannam, K., and D. Knox \n 46 \n2005 Discourse Analysis in Tourism Research: A Critical Perspective. Tourism Recreation \nResearch 30(2): 23-30. \nHarvey, D.  \n2005 A Brief History of Neoliberalism. Oxford: Oxford University Press. \n2006 Neoliberalism as Creative Destruction. Geografiska Annaler, Series B: Human \nGeography 88(2):145. \nHer Majesty's Inspectorate  \n1992 Higher Education in the Polytechnics and Colleges: Hotel, Catering and Tourism \nManagement. London: HMSO. \nHiggins-Desbiolles, F. \n2006 More than an ‘‘industry’’: The forgotten power of tourism as a social force. Tourism \nManagement 27 (2006): 1192–1208 \nHollinshead, K.  \n1999 Surveillance of the Worlds of Tourism: Foucault and the Eye-Of Power. Tourism \nManagement 17 (2): 133-139 \nHowarth, D.  \n2000 Discourse: Concepts in the Social Sciences. Buckingham, Philadelphia: Open \nUniversity Press. \nHsu, H. C., Ed. \n 2005 Global Tourism Higher Education: Past, Present and Future. New York: The \nHaworth Hospitality Press. \nJafari, J. and B. Ritchie \n1981 Towards a Framework for Tourism Education: Problems and Prospects. Annals of \nTourism Research 8 (1): 13-34 \nJaworski, A., and N.Coupland, Eds. \n 47 \n1999 The Discourse Reader. London: Routledge. \nKoh, K. \n1995 Designing the Four- Year Tourism Management Curriculum: A Marketing Approach. \nJournal of Travel Research 24(1):68-72. \nLaclau, E., and C. Mouffe  \n1985 Hegemony and Socialist Strategy. London: Verso. \nLeiper, N. \n1981 Towards a Cohesive Curriculum in Tourism: The Case for a distinct Discipline. \nAnnals of Tourism Research 8 (1): 69-84 \nLeonardo, Z.  \n2003 Discourse and Critique: Outlines of a Post-structural Theory of Ideology. Education \nPolicy 18(2):203-214. \nLingard, B.  \n2000 It is and it isn't: Vernacular Globalization, Educational Policy and Restructuring. In \nGlobalization and Education: Critical Perspectives, N. Burbules and C. Torres, eds., pp. 79 \n108. London: Routledge.  \nLittle, B.  \n2005 Policies Towards Work-Focused Higher Education: Are they Meeting Employer’s \nNeeds? Tertiary Education and Management 11:131-146. \nLiu, A and G. Wall \n2005 Human Resources Development in China. Annals of Tourism Research 32 (3): 689–\n710 \nLo. A. \n 48 \n2005 The Past, Present and Future of Hospitality and Tourism Higher Education in Hong \nKong. In Global Tourism Higher Education: Past, Present and Future, C. Hsu, ed., pp. 137 - \n166. New York: The Haworth Hospitality Press.  \nLyotard, J. F.  \n1984 The Postmodern Condition: A Report on Knowledge. Manchester: Manchester \nUniversity Press. \nMacLaurin, D. \n2005 Tourism Education in China: Past, Present and Future Directions. In Global Tourism \nHigher Education: Past, Present and Future, C. Hsu, ed., pp. 1 - 25. New York: The \nHaworth Hospitality Press. \nMarginson, S. \n1997 Steering from a Distance: Power Relations in Australian Higher Education. Higher \nEducation 34(1):63-80. \nMarginson, S., and M. Considine \n2000 The Enterprise University: Power, Governance and Reinvention in Australia. \nCambridge: Cambridge University Press. \nMorse, J., and L. Richards \n2002 Read me first for user’s Guide to Qualitative Methods. Thousand Oaks: Sage. \nNational Committee of Inquiry into Higher Education (NCIHE) \n1997 Higher Education in the Learning Society (Dearing Committee Report). \nNewson, A. J.  \n1994 Subordinating Democracy: The Effects of Fiscal Retrenchment and University-\nBusiness Partnerships on Knowledge Creation and Knowledge Dissemination in \nUniversities. Higher Education 27(2):141-161. \nPage, S. J.  \n 49 \n2003 Evaluating Research Performance in Tourism: The UK Experience. Tourism \nManagement 24: 607-622 \nParker, I.  \n1992 Discourse Dynamics: Critical Analysis for Social and Individual Psychology. London: \nRoutledge. \nPearce, P. \n2005 Australian Tourism Education: The Quest for Status. In Global Tourism Higher \nEducation: Past, Present and Future, C. Hsu, ed., pp. 251 - 267. New York: The Haworth \nHospitality Press. \nPeters, M.  \n1992 Performance and Accountability in Post-industrial Society: The  \nCrisis of British Universities. Studies in Higher Education 17(2): 123-139. \nPhillips, L., and M.W Jorgensen \n2002 Discourse Analysis as Theory and Method. London: Sage. \nPhillips, N., and C. Hardy \n2002 Discourse Analysis: Investigating Processes of  \nSocial Construction. Thousand Oaks, London, New Delhi: Sage. \nPickett, B. L \n1996 Foucault and the Politics of Resistance. Polity 28 (4): 445-466 \nPritchard, A. and N. Morgan.  \n2007 De-centring Tourism's Intellectual Universe or Traversing the Dialogue between \nChange and Tradition. In The Critical Turn in Tourism Studies: Innovative Research \nMethodologies, I. Ateljevic., A. Pritchard and N. Morgan, eds., pp. 11-28. Oxford: Elsevier. \nQAA  \n2001 Subject Overview Report for Hospitality, Leisure, Recreation, Sport and Tourism \n 50 \n2000-2001. Gloucester: Quality Assurance Agency for Higher Education, Q03\/2001 \nwww.qaa.ac.uk. \nRabinow, P.  \n1984 The Foucault Reader: An Introduction to Foucault’s Thought.  \nNewYork, Toronto: Pantheon Books, Random House Inc. \nReichel, A. \n2005 Tourism and Hospitality Higher Education in Israel. In Global Tourism Higher \nEducation: Past, Present and Future, C. Hsu, ed., pp. 61 - 88. New York: The Haworth \nHospitality Press. \nRobbins, D.  \n2005 Quality Assurance. In An International Handbook of Tourism Education, D. Airey \nand J. Tribe, eds., pp. 451-468. Oxford: Elsevier. \nRobson, C.  \n2002 Real World Research: A Resource for Social Scientists and Practitioner Researchers. \n2nd ed., Oxford: Blackwell. \nScrimshaw, P.  \n1983 Educational Ideologies: Purpose and Planning in the  \nCurriculum (Unit 2, E204). Milton Keynes: Open University Press. \nShore, C. & Wright, S. \n2000 Coercive Accountability: The Rise of Audit Culture in Higher Education. In Audit \nCultures: Anthropological Studies in Accountability, Ethics and the Academy, M. \nStrathern, Ed. London: Routledge, pp. 57-89 \nSigala, M., and T. Baum \n2003 Trends and Issues in Tourism and Hospitality Higher Education. Tourism and \nRecreation Research 4(4):367-375. \n 51 \nSilverman, D. \n2001 Interpreting Qualitative Data: Methods for Analysing Talk, Text and Interaction, \n(2nded.). London: Sage. \nSingh, S. \n1997 Developing human resources for the tourism industry with reference to India. Tourism \nManagement 18 (5): 299-306. \nStuart-Hoyle, M.  \n2003 The Purpose of Undergraduate Tourism Programmes in the United Kingdom. Journal \nOf Hospitality, Leisure, Sport and Tourism Education 2(1):49-74. \nThe Robbins Report of the Committee on Higher Education  \n1963 Report and Appendix I Committee on Higher Education. London: Her Majesty’s \nStationery Office, Cmnd. 2154. \nTitscher, S., M. Meyer, R, Wodak and E. Vetter  \n2000 Methods of Text and Discourse Analysis’, (Translated by Bryan Jenner), London, \nThousand Oaks, New Delhi: Sage. \nTonkiss, F.  \n1998 Analysing Discourse. In Researching Society and Culture, C. Seale, ed., pp. 245-260, \nLondon: Sage.  \nTorfing, J.  \n1999 New Theories of Discourse: Laclau, Mouffe and Žižek. Oxford: Blackwell. \nTorres, C. A., and D. Schugurensky \n2002 The Political Economy of Higher Education in the Era of Neoliberal Globalization: \nLatin America in Comparative Perspective. Higher Education. 43(4):429-455. \nTribe, J.  \n 52 \n2004 The 4Ps of Research: Practice, Policy, Principles and Positioning. Journal of \nHospitality, Leisure, Sport and Tourism Education 3 (1): 1-4 \n2003 The RAE-ification of Tourism Research in the UK. International Journal of Tourism \nResearch 5: 225-234 \n2002 The Philosophic Practitioner. Annals of Tourism Research 29 (2): 338-357 \n2000 Balancing the Vocational: Theory and Practice of Liberal Education in Tourism. \nTourism and Hospitality Research 2(2):9-25. \n1997 The Indiscipline of Tourism. Annals of Tourism Research 24 (3) 638-657 \nUrry, J.  \n1990 The Tourist Gaze. Thousand Oaks: Sage. \nVidovich, L.  \n2002 Quality Assurance in Australian Higher Education:  \nGlobalization and ‘Steering at a distance’. Higher Education 43(3):391-408. \nWalle,  \n1997 Quantitative Versus Qualitative Tourism Research. Annals of Tourism Research 24 \n(3): 524-536 \nWetherell, M. and J. Potter. \n1992 Mapping the Language of Racism: Discourse and the Legitimation of Exploitation. \nBrighton: Harvester\/Wheatsheaf. \nWillmott, H.  \n2003 Commercializing Higher Education in the UK: The State, Industry and Peer Review. \nStudies in Higher Education 28 (2): 129-141 \nWright, P. G.  \n1989 Who Defines Quality in Higher Education? Reflections on the  \n 53 \nRole of Professional Power in Determining Conceptions of Quality in English Higher \nEducation. Higher Education 18(2):149-165. \nZais, R. \n1976 Curriculum: Principles and Foundations. New York: Thomas Crowell. \nZhang, W. and X. Fan \n2005 Tourism Higher Education in China: Past and Present, Opportunities and Challenges. \nIn Global Tourism Higher Education: Past, Present and Future, C. Hsu, ed., pp. 61 - 88. \nNew York: The Haworth Hospitality Press. \n  \n \n"}