{"doi":"10.1093\/bjsw","coreId":"65483","oai":"oai:dro.dur.ac.uk.OAI2:5702","identifiers":["oai:dro.dur.ac.uk.OAI2:5702","10.1093\/bjsw"],"title":"Critical commentary : social work ethics.","authors":["Banks,  Sarah."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2008-09-01","abstract":"This short article explores the expanding and contested terrain of social work ethics, considering the form and content of future areas for development. It charts the broadening of the field beyond a focus on professional codes of ethics, principle-based theories, difficult cases and decision-making models towards more embedded and situated approaches to ethics in professional life. The potential for further empirical research into ethical issues in social work, including how practitioners conceptualize and handle ethical difficulties, is noted, alongside the scope for focused studies and monographs drawing on moral, political and religious philosophy to examine particular theoretical approaches (such as virtue ethics or the ethics of care) or to develop new ways of approaching ethics in social work, drawing on its radical, critical and transformatory traditions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65483.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5702\/1\/5702.pdf","pdfHashValue":"5015fb78fb249a79f7a8dce5bf0fe1ba031e2d09","publisher":"Oxford University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5702<\/identifier><datestamp>\n      2011-11-09T09:37:29Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Critical commentary : social work ethics.<\/dc:title><dc:creator>\n        Banks,  Sarah.<\/dc:creator><dc:description>\n        This short article explores the expanding and contested terrain of social work ethics, considering the form and content of future areas for development. It charts the broadening of the field beyond a focus on professional codes of ethics, principle-based theories, difficult cases and decision-making models towards more embedded and situated approaches to ethics in professional life. The potential for further empirical research into ethical issues in social work, including how practitioners conceptualize and handle ethical difficulties, is noted, alongside the scope for focused studies and monographs drawing on moral, political and religious philosophy to examine particular theoretical approaches (such as virtue ethics or the ethics of care) or to develop new ways of approaching ethics in social work, drawing on its radical, critical and transformatory traditions. <\/dc:description><dc:subject>\n        Social work ethics<\/dc:subject><dc:subject>\n         Professional ethics<\/dc:subject><dc:subject>\n         Moral philosophy.<\/dc:subject><dc:publisher>\n        Oxford University Press<\/dc:publisher><dc:source>\n        British journal of social work, 2008, Vol.38(6), pp.1238-1249 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2008-09-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5702<\/dc:identifier><dc:identifier>\n        issn:0045-3102<\/dc:identifier><dc:identifier>\n        issn: 1468-263X<\/dc:identifier><dc:identifier>\n        doi:10.1093\/bjsw\/bcn099<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5702\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1093\/bjsw\/bcn099<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5702\/1\/5702.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1468-263X"," 1468-263x","0045-3102","issn:0045-3102"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":["Social work ethics","Professional ethics","Moral philosophy."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n18 January 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBanks, Sarah. (2008) ’Critical commentary : social work ethics.’, British journal of social work., 38 (6). pp.\n1238-1249.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1093\/bjsw\/bcn099\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n01 July 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nAccepted for publication version \n \nCitation for published item: \nBanks, Sarah. (2008) 'Critical commentary : social work ethics.', British journal of social \nwork., 38 (6). pp. 1238-1249. \n \nFurther information on publishers website: \nhttp:\/\/dx.doi.org\/10.1093\/bjsw\/bcn099 \n \nPublisher’s copyright statement: \nThis is a pre-copy-editing author-produced PDF of an article accepted for publication in \nBritish journal of social work following peer review. The definitive publisher-authenticated \nversion Banks, Sarah. (2008) 'Critical commentary : social work ethics.', British journal of \nsocial work., 38 (6). pp. 1238-1249. is available online at: \nhttp:\/\/dx.doi.org\/10.1093\/bjsw\/bcn099 \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \n 1 \nThis is a preprint of an article whose final and definitive form has been \npublished in the journal, British Journal of Social Work, 38, 6, 2008, pp. 1238-\n1249, published by Oxford University Press, \nhttp:\/\/bjsw.oxfordjournals.org\/cgi\/content\/abstract\/38\/6\/ \n \n \nManuscript version of article: \n \nBanks, S. (2008) ‘Critical commentary: social work ethics’, British \nJournal of Social Work, 38, 6, pp. 1238-1249. \n \n \nSarah Banks is Professor in the School of Applied Social Sciences, Durham \nUniversity, UK. She writes and researches on ethical issues relating to the social \nprofessions, and has just completed a book with Ann Gallagher on Ethics in \nprofessional life: virtues for health and social care, to be published by Palgrave \nMacmillan.   \n \nCorrespondence to: \nProfessor  Sarah Banks  \nSchool of Applied Social Sciences \nUniversity of Durham \nElvet Riverside 2 \nNew Elvet \nDurham. DH1 3JT \n0191 3341497 \ns.j.banks@durham.ac.uk \n 2 \nCritical commentary: Social work ethics \nSarah Banks \n \nSummary \n \nThis short article explores the expanding and contested terrain of social work ethics, \nconsidering the form and content of future areas for development. It charts the \nbroadening of the field beyond a focus on professional codes of ethics, principle-\nbased theories, difficult cases and decision-making models towards more embedded \nand situated approaches to ethics in professional life. The potential for further \nempirical research into ethical issues in social work, including how practitioners \nconceptualise and handle ethical difficulties, is noted, alongside the scope for focused \nstudies and monographs drawing on moral, political and religious philosophy to \nexamine particular theoretical approaches (such as virtue ethics or the ethics of care) \nor to develop new ways of approaching ethics in social work, drawing on its radical, \ncritical and transformatory traditions.  \n \nKey words: social work ethics, professional ethics, moral philosophy \n  \n 3 \nIntroduction \n \nThis critical commentary focuses on social work ethics as an emerging subject area \nwithin the professional discipline of social work\n1\n. In this context I am using the term \n‘social work ethics’ as a singular term to refer to a specialist area of professional \nethics comprising the study of the norms of right action, good qualities of character \nand values relating to the nature of the good life that are aspired to, espoused and \nenacted by social workers in the context of their work.. \n \nThe body of literature on social work ethics is still relatively small compared with that \nin related fields such as medical or nursing ethics, but it is rapidly growing. There are \nseveral reasons for this expansion, including the continuing professionalization of \nsocial work and the establishment of new and longer higher education programmes in \nmany countries across the world. This is resulting in a growth of social work literature \ngenerally and the emergence of specialist areas of knowledge for research, teaching \nand practice, of which social work ethics is one.  \n \nSocial work ethics is also being influenced by the same global trends that are creating \n‘applied ethics’ as a topical subject area.  High profile environmental, medical, \nscientific and socio-political issues such as climate change, developments in genetic \ntechnologies and global terrorism are bringing to the fore new versions of perennial \n                                                 \n1\n The critical commentary  is not designed to offer an historical or comprehensive \noverview of relevant literature on social work ethics – good lists of references can be \nfound in the many recent textbooks on the subject, such as Reamer (2006), Black et \nal. (2002, with a revised version due shortly) or Banks (2006). Rather it selects some \nexamples of different types of published work, with an emphasis on recent English-\nlanguage publications, with the aim of considering the current state of the field and \nthe potential for future development.  \n \n 4 \nethical questions about human responsibilities, the nature and value of human and \nanimal life and social justice in the recognition of diversity and distribution of scarce \nresources. These factors influence the context in which social work is practised and \ntheorized. The ‘postmodern’ turn in sociological and philosophical thinking has \ncontributed to a questioning of universal values, all-embracing foundational theories \n(including ethical theories) and the legitimacy and roles of ‘expert’ professional \npractitioners in relation to service users. There has also been a heightened concern to \nmonitor and manage risk in social welfare work; a restructuring of welfare systems in \nmany countries; the introduction of mechanisms for surveillance and control of \ncitizens and service users; and increasing regulation of the work of professional \npractitioners. These factors are contributing to a continuing concern with professional \npower, legitimacy, credibility, conduct\/misconduct and a questioning of the traditional \nprofessional-client relationship – all themes that fall within the scope of social work \nethics.  \n \nThis expansion in the field of social work ethics clearly involves an increase in \nquantity of literature published and in the amount of time spent on the subject in \nprofessional education.  There is also an expansion in the forms of literature \ncomprising the corpus of work on social work ethics – going beyond the traditional \nprofessional codes, ethical guidelines, textbooks and scholarly articles, to include \nempirically-based articles, with signs of potential for more specialist texts and \nresearch monographs.  Finally, the expansion includes a broadening of the substantive \ncontent of the social work ethics literature and teaching curricula to include not just \nprinciple-based theories of ethics, but also virtue-, care- and narrative-based \n 5 \napproaches; to include descriptive as well as normative ethics; and a focus on ethics in \nsocial work research as well as in social work practice.    \n \nIn this paper I will discuss briefly the expansion of social work ethics using the three \nheadings identified above. I will not specifically cover ethics in social work research \n(although this is certainly relevant, particularly with the growth of practitioner \nresearch), as this is a rapidly expanding and complex area, worthy of consideration in \nits own right (see, for example: Antle and Regehr, 2003; D’Cruz and Jones, 2004).     \n   \nQuantity: the ‘ethics boom’2 \n \nOne indicator of the growth of interest in social work ethics is the recent introduction \nof two specialist journals: The Journal of Social Work Values and Ethics (a USA-\nbased electronic open access journal with a specific focus on social work launched in \n2005) and Ethics and Social Welfare (a British-based subscription journal launched in \n2007 with a broader focus covering ethics in social policy and the social professions, \nbut with a strong emphasis on social work). The small core of student textbooks on \nsocial work ethics, which started to develop in the 1980s, grew significantly in the \n1990s. Until recently this field was dominated in the English-speaking world by North \nAmerican publications, the most significant of which is the work of Frederic Reamer \n(for example: Rhodes, 1986; Reamer, 1990, 1999; Loewenberg and Dolgoff, 1996; \nCongress, 1999; Linzer, 1999). This body of work is now growing internationally, \nwith revised and new texts by Australian, British and Irish authors (for example: \n                                                 \n2\n The term ‘ethics boom’ was used by Davis (1999), writing from a North American \nperspective, referring to the growth of interest in applied ethics. The ‘boom’ has \ncontinued apace during the first decade of the twenty-first century.  \n 6 \nBeckett and Maynard, 2005; Banks, 2006; Bowles et al., 2006; Parrott, 2006; \nCharleton, 2007). The availability of textbooks on social work ethics in languages \nother than English is difficult to assess, but reports from colleagues internationally \nsuggest a shortage, which is now beginning to be addressed (see Diekmann, 2003, for \nan overview of some relevant European literature). Indeed, there is evidence of an \nemerging literature on social work ethics published in various languages (for example,   \nRouzel, 1997; Lingås, 1999; Henriksen and Vetlesen, 2001; Martin, 2001; Barroco, \n2004), although sometimes this comprises translations of existing English-language \npublications (Banks, 1997, 1999; Mach-Zagel and Nøhr, 2007). Specific modules on \nsocial work ethics are more frequently being taught on professional qualifying \nprogrammes, and attention is being paid to methods and approaches to learning and \nteaching in this area (for example: Reamer and Abramson, 1982; Black et al., 2002; \nBanks and Nøhr, 2003; Banks, 2005; Gray and Gibbon, 2007).  \n \nWe are also seeing a proliferation of new and revised codes of ethics\/professional \nconduct, alongside other ethical guidance and discussion documents produced by \nprofessional associations and regulatory bodies (see Banks, 2006, chapter 4, for an \ninternational overview). In countries where social work is a relatively new profession, \ncodes of ethics and procedures for regulation and disciplining of members are being \nproduced for the first time (for example, Croatia Association of Social Workers, 2004; \nNational Federation of Social Workers in Romania, 2004); whilst significant \ndevelopments and revisions are in evidence in parts of the world where social work is \nlonger established (for example: General Social Care Council, 2002; Japanese \nAssociation of Social Workers et al., 2004; Canadian Association of Social Workers, \n2005). Even in some countries and communities where western-style codes of conduct \n 7 \nbased on individual rights and duties seem less relevant, nevertheless codes or \ndeclarations of ethics have been developed, sometimes taking the form of a pledge \n(for example: South African Black Social Workers’ Association, no date; Tata \nInstitute of Social Sciences Social Work Educators’ Forum, 1997), or existing codes \nhave been modified to take account of indigenous values, as in New Zealand’s bi-\ncultural and bilingual code of ethics (Aotearoa New Zealand Association of Social \nWorkers, 1993).   \n \nForm: beyond the code and textbook \n \nProfessional ethics is traditionally associated with codes of ethics and textbooks \ndesigned for use on professional education programmes. Codes of ethics usually \ncomprise statements of purpose and lists of values, principles, standards and rules for \nthe implementation of principles in practice. Textbooks vary, but the majority offer \nsome kind of overview of ethical theories, followed by analysis of difficult cases in \nterms of principles derived from these theories and\/or from codes of ethics and \nsometimes structured around ethical decision-making models. This approach presents \na picture of professional ethics as a rational process involving the application of \nethical principles to practice, tackling difficult cases (often described as ‘dilemmas’) \nand making decisions. The titles of many of the North American textbooks reflect this \nfocus (Rhodes, 1986; Reamer, 1990; Congress, 1999; Linzer, 1999; Dolgoff et al., \n2005). However, this construction of social work ethics is being challenged and \nbroadened not only by scholarly academic articles, but also by empirical studies of \nsocial workers’ perceptions, attitudes and actions.  \n \n 8 \nRossiter et al. (2000) in their study of Canadian social workers report that codes of \nethics are not used in practice and practitioners are often only dimly aware of their \nexistence. Similarly, they did not find social workers using ethical decision-making \nmodels. This is not a surprising finding. For in many cases there is no time for the \nprofessional to consult a step-by-step model. Furthermore, despite the textbook \nrhetoric, these models are not designed to be used on a daily basis. They are mainly a \nway of encouraging students (often in a classroom or supervision setting) to reason \nand reflect systematically on ethical issues in practice, some aspects of which may \nthen become intuitive or ‘second nature’ as they practise social work.  There is, \nhowever, a surprisingly large body of literature focusing on the development, \nperfection and use of such decision-making models, which inevitably contributes to \nthe construction of a particular kind of discourse about social work ethics (for recent \nthinking on ethical decision-making in social work see McAuliffe and Chenoweth, \n2007; Harrington and Dolgoff, 2008).  \n \nFor our purposes here, the interesting feature of the study undertaken by Rossiter et \nal. (2000) is that it comprises empirical research designed to explore and describe \nhow practitioners conceptualize and tackle ethical issues in their day-to-day practice \nand uses this to critique ‘textbook’ accounts of ethics. It falls into the category of what \nphilosophers call ‘descriptive’ or ‘empirical’ ethics (describing people’s ethical \nvalues, beliefs and actions), as opposed to meta-ethics (conceptual analysis of ethical \nconcepts such as ‘rights’, ‘responsibilities’, ‘professional integrity’) or normative \nethics (prescribing what people should do in terms of ethical principles, rules and \nspecific actions).  \n \n 9 \nThe role and validity of ‘empirical ethics’, and how, if at all, it relates to what has \ntraditionally been conceived of as ‘philosophical ethics’ is an area of debate within \nmoral philosophy and other fields of professional ethics (Hope, 1999; Widdershoven \nand Van Der Scheer, 2004; Smajdov et al., 2008). The issues are complex and would \nbenefit from further attention in relation to social work. This is particularly important \nas empirical studies with a focus on aspects of social work ethics are growing (for \nrecent examples see:  Banks, 2004, pp. 125-178; McAuliffe, 2005; Strom-Gottfried, \n2006; Jawad, 2007; McLaren, 2007) and look set to expand as empirical research in \nsocial work grows and a number of doctoral students are choosing research topics \nrelated to social work ethics.   \n \nHitherto there have been few specialist research monographs or advanced texts on \naspects of social work ethics (either theoretically or empirically based). Baptista’s \n(1998) specialist book in Portuguese on the relevance of the moral philosophy of \nLevinas for social education work is one example. Books by Clark (2000), Banks \n(2004) and Hugman (2005) could be regarded as advanced texts, which, although still \ngeneral in scope, eschew ethical decision-making models and offer more in-depth \ncritical analysis than introductory textbooks. We might expect and hope for more such \ncontributions in the future as the subject area matures and develops and some of the \nempirically focused doctoral dissertations are written up for publication.  Indeed, this \nis needed to broaden and deepen social work ethics as a subject area.  \n \nContent: taking account of character, care and context \n \n 10 \nThe most interesting aspect of the thinking and literature on social work ethics is \nobviously its substantive content, and what this tells us about how the subject area is \nchanging and developing as an academic-professional discourse. Not surprisingly, \ndevelopments and trends in philosophical ethics, including moral philosophical \nanalyses and studies in cognate areas of professional and applied ethics (particularly \nmedical, nursing and health care ethics) comprise  one of the main influences on \ntheoretical approaches to social work ethics. In philosophical ethics there has been a \nchallenge to the dominance of principle-based theories of ethics such as Kantianism \n(focusing on respect for persons and duty) and consequentialism (focusing on the \noutcomes of actions). These challenges have come from a revival of virtue ethics \n(focussing on qualities of character), the development of an ethics of care (focusing \non caring relationships), communitarian ethics (focusing on community, responsibility \nand cooperation) and pluralist, discursive, postmodern or anti-theory approaches to \nethics (eschewing single, foundational all-embracing theories). These trends are \nbeginning to be recognised not only in introductory and advanced textbooks that give \noverviews of relevant theories (Banks, 2004; Hugman, 2005), but also in scholarly \narticles arguing for the relevance of some of these approaches to social work ethics, \nparticularly virtue ethics (McBeath and Webb, 2002; Clark, 2006; Gray and Lovat, \n2007) and the ethics of care, often associated with feminist approaches to ethics \n(Clifford, 2002; Orme, 2002; Parton, 2003; Graham, 2007). Some of these articles are \nrather speculative, which is not surprising, given the difficulty of  articulating a \ndetailed theoretical approach and showing its relevance to social work practice in a \nsingle article. The next stage for social work ethics will be the publication of detailed \nbook-length expositions outlining what, for example, an ethics of care or virtue ethics \nfor social work would look like, along the lines of those developed in health care, \n 11 \nsocial policy and related fields (for example: Pellegrino and Thomasma, 1993; Kuhse, \n1997; Sevenhuisen, 1998; Oakley and Cocking, 2001). \n \nThese ‘new’ approaches to social work ethics pay attention to the situated nature of \nvalues and conduct, as embedded in families, relationships, communities and cultures, \nand take account of commitments to specific others, motives and emotions. They are \nnot based on universally valid, abstract principles, promoting individual freedoms and \nrights that apply world-wide across all cultures. They may offer more scope, \ntherefore, to respond to the critique of the dominance of western (particularly Anglo-\nAmerican) approaches to ethics, which place the individual moral agent in the centre \nof the picture, rationally weighing up the balance of individual duties and rights. The \ncritique of the cultural imperialism of a particular version of principle-based ethics is \nnot new in social work (see Ejaz, 1991; Silavwe, 1995). Indeed, it is an on-going \ntheme for debate (Yip, 2004; Healy, 2007; Hugman, 2008), especially in relation to \nthe recently created international standards for social work and revised statement of \nethical principles (International Federation of Social Workers and International \nAssociation of Schools of Social Work, 2004, 2005). The debate about the extent to \nwhich there are or should be universally valid ethical principles or criteria for judging \ncharacter and conduct is particularly pertinent in social work. For social work is both \nan international social movement concerned to promote social justice across the \nworld, and a situated practice that takes place in a context of national laws, policies \nand cultures, albeit with increasingly multi-ethnic populations. These issues about \nuniversalism, relativism and particularism in ethics are very much alive in moral \nphilosophy, often linked to contemporary social and political concerns around \nconflicts relating to ethnicity, religion and culture (Browning, 2006; Nussbaum, 2006; \n 12 \nAppiah, 2007; Sullivan and Kymlicka, 2007). This suggests that mutual benefit could \nbe gained from more cross-fertilization between moral, political and religious \nphilosophy and social work ethics, especially as social workers are dealing on a daily \nbasis with some of these conflicts and dilemmas at an individual, family and \nneighbourhood level. \n \nThe idea of a situated social work ethics and its relationship to philosophy and \npolitics  \n \nI will end this brief paper with a plea for a further development of the relationship \nbetween social work and moral philosophy. Awareness of the links between social \nwork and philosophy is longstanding (Bosanquet, 1916; Pumphrey, 1961: Ragg, \n1977; Reamer, 1993; Timms and Watson, 1978). However, this is often confined to \nthe philosophy of social work (political and moral philosophical justifications for and \nanalysis of the rationale and core purpose of social work), rather than philosophy in \nsocial work (analyses and discussion of everyday practice in philosophical terms). \nAlthough there are several examples of philosophers who have been involved in the \nwriting of books on social work ethics (Downie and Telfer, 1980; Bowles et al., 2006; \nCharleton, 2007), by and large moral philosophers have not contributed directly to the \ndebates and literature in social work ethics in the way they have in some other areas \nof applied and professional ethics, particularly health care and medical ethics. Hence \nthe field of social work ethics has been constructed largely from within the discipline \nof social work, with social work authors drawing on and using relevant concepts and \ntheories from moral philosophy (and other areas of professional ethics) as relevant, \nsometimes in rather piecemeal and simplistic ways.     \n 13 \n \nThere is also a need for more conscious linkages between social work ethics and \npolitics. The literature on radical, transformative and anti-oppressive social work has \ntended to remain relatively separate from the literature on social work ethics. Yet \nethics and politics are intimately connected. Matters of conduct, ethical judgement \nand decision-making of individual professionals cannot be abstracted from the \npolitical and policy contexts in which they take place. Individual professionals are \nboth influenced by and help create the ethical discourses of the organizations where \nthey work and the policy frameworks within which they practise.  However, there is a \ntendency in some of the ethics literature to focus on the individual practitioner making \ndifficult ethical decisions in cases that are sometimes constructed in ways that are \ndecontextualized, both from the character and motives of the individual people \ninvolved and from the organization, policy, political and social context. This \ninfluences how practitioners conceive of and demarcate the domain of ‘the ethical’ \nand their perceptions of their ability to act. The focus on difficult cases makes it seem \nas if ‘ethical’ issues arise only when a problematic case or difficult dilemma is \nexperienced. As Rossiter et al. (2000) point out, this can result in practitioners \nregarding the more contextual and policy related issues in their work (such as \nhierarchical management structures), which are not framed as ‘cases’, as to do with \n‘politics’ and therefore not part of their sphere of decision-making influence. It also \nleads to ignoring the ethical dimensions of other aspects of practice, which are not \nimmediately about action and decision-making – for example, motives, qualities of \ncharacter, professional wisdom and moral perception as precursors to invoking \nprinciples or making decisions.  \n \n 14 \nConcluding comments \n \nSocial work ethics is at an interesting stage in its development. Other areas of \nprofessional and applied ethics, particularly medical, bio- and health care ethics, are \nmuch more well-developed, so provide interesting sources of ideas and lessons for \nsocial work ethics in its developmental trajectory. Social work ethics, if it continues to \nbroaden its scope beyond traditional professional ethics (focusing on codes and \ndifficult cases) to ethics in professional life (including virtues, relationships of care \nand the critical moral competence for everyday and transformatory practice), will \nbenefit from more serious engagement with moral, political and religious philosophy. \nSigns of these developments are emerging, as an overview of the early contributions \nto the new journal, Ethics and Social Welfare, demonstrates, with articles on \nexistentialist, care, virtue and Habermasian discourse ethics, as well as the role of \nreligion in social work (Banks, 2008). There is also the potential to link some of the \nsociological ethnographic and discourse analytic studies of everyday social work \npractice (for example: de Montigny, 1995; Taylor and White, 2000; White and \nStancombe, 2003; Hall et al., 2006) with the large body of moral philosophical work \non personal integrity, moral distress, moral perception, imagination and the ethics of \ncommitment and resistance.  In conclusion, this brief and partial account of certain \naspects of the current literature and thinking in this field suggests that we can look \nforward to a flourishing and diverse literature on social work ethics over the coming \ndecade.   \n \n \nReferences \n 15 \n \nAntle, B. and Regehr, C. (2003) ‘Beyond Individual Rights and Freedoms: Metaethics \nin Social Work Research’, Social Work, 48(1), pp. 135-144. \n \nAppiah, K.A. (2007) Cosmopolitanism: Ethics in a World of Strangers, London, \nPenguin. \n \nAotearoa New Zealand Association of Social Workers (1993) Code of Ethics, \nDunedin, ANZASW (revised bilingual version due 2008, see \nwww.anzasw.org.nz). \n \nBanks, S. (1997) Etica y valores en el trabajo social, Barcelona\/Buenos Aires, \nEdiciones Paidos Iberica. \n \nBanks, S. (1999) Etica e valori nel servizio sociale: Dilemmi morali e operatiri \nriflessivi nel welfare mix, Trento, Italy, Erickson. \n \nBanks, S. (2004) Ethics, Accountability and the Social Professions, Basingstoke, \nPalgrave Macmillan. \n \nBanks, S. (2005) ‘The Ethical Practitioner in Formation: Issues of Courage, \nCompetence and Commitment’, Social Work Education, 24(7), pp. 737-753. \n \nBanks, S. (2006) Ethics and Values in Social Work (3rd Edition), Basingstoke, \nPalgrave Macmillan. \n 16 \n \nBanks, S. (2008) ‘Ethics and Social Welfare: the State of Play’, Ethics and Social \nWelfare, 2(1), pp. 1-9. \n \nBanks, S. and Nøhr, K. (eds.) (2003) Teaching Practical Ethics for the Social \nProfessions, FESET, Copenhagen. \n \nBaptista, I. (1998) Ética e Educação, Porto, Portucalense. \n \nBarroco, M. (2004) Ētica y Servicio Social: Fundamentos Ontológicos, São Paulo, \nBrazil, Biblioteca Latinoamericana de Servicio Social. \n \nBeckett, C. and Maynard, A. (2005) Values and Ethics in Social Work: An \nIntroduction, Sage, London. \n \nBlack, P., Congress, E. and Strom-Gottfried, K. (eds.) (2002) Teaching Social Work \nValues and Ethics: a curriculum resource, Council on Social Work Education, \nAlexandra, Va. \n \nBosanquet, B. (1916) ‘The Philosophy of Casework’, Charity Organisation Review, \n39(March), pp. 117-33. \n \nBowles, W., Collingridge, M., Curry, S. and Valentine, B. (2006) Ethical Practice in \nSocial Work: An Applied Approach, Crow’s Nest, New South Wales, Allen \nand Unwin. \n 17 \n \nBrowning, D. (ed.) (2006) Universalism vs. Relativism: Making Moral Judgements in \na Changing, Pluralistic, and Threatening World, Rowman and Littlefield, \nLanham, Maryland. \n \nCanadian Association of Social Workers (2005) Code of ethics, Ottawa, CASW. \n \nCharleton, M. (2007) Ethics for Social Care in Ireland: Philosophy and Practice, \nDublin, Gill and Macmillan. \n \nClark, C. (2000) Social Work Ethics: Politics, Principles and Practice, Basingstoke, \nMacmillan. \n \nClark, C. (2006) ‘Moral Character in Social Work’, British Journal of Social Work, \n36, pp. 75-89. \n \nClifford, D. (2002) ‘Resolving uncertainties? The contribution of some recent \nfeminist ethical theory to the social professions’, European Journal of Social \nWork, 5(1), pp. 31-41. \n \nCongress, E. (1999) Social work values and ethics: identifying and resolving \nprofessional dilemmas, Chicago, Nelson-Hall. \n \nCroatia Association of Social Workers (2004) Etički Kodeks Socijalnih Radnika, \nZagreb, Croatia Association of Social Workers. \n 18 \n \nD’Cruz, H. and Jones, M. (2004) Social Work Research: Ethical and Political \nContexts, London, Sage. \n \nDavis, M. (1999) Ethics and the University, London, Routledge. \n \nde Montigny, G. (1995) Social Working: An Ethnography of Front-Line Practice, \nToronto, University of Toronto Press. \n \nDiekmann, W. (2003) ‘Some useful literature for teaching professional ethics’, in \nBanks, S. and Nohr, K. (eds.) Teaching Practical Ethics for the Social \nProfessions, Copenhagen, FESET, pp. 159-167. \n \nDolgoff, R., Loewenberg, F. and Harrington, D. (2005) Ethical Decisions for Social \nWork Practice, Belmont, CA, Brooks Cole. \n \nDownie, R. and Telfer, E. (1980) Caring and Curing, London, Methuen. \n \nEjaz, F.K. (1991) ‘Self-determination:  Lessons to be Learned from Social Work \nPractice in India’, British Journal of Social Work, 21, pp. 127-142. \n \nGeneral Social Care Council (2002) Codes of Practice for Social Care Workers and \nEmployers, London, GSCC (available at www.gscc.org.uk). \n \n 19 \nGraham, M. (2007) ‘The Ethics of Care, Black Women and the Social Professions: \nImplications of a New Analysis’, Ethics and Social Welfare, 1(2), pp. 194-\n207. \n \nGray, M. and Gibbon, J. (2007) ‘There are no Answers, Only Choices: Teaching \nEthical Decision Making in Social Work’, Australian Social Work, 60(2), pp. \n222-238. \n \nGray, M. and Lovat, T. (2007) ‘Horse and Carriage: Why Habermas’s Discourse \nEthics Gives Virtue a Praxis in Social Work’, Ethics and Social Welfare, 1(3), \npp. 310-28. \n \nHall, C., Slembrouck, S. and Sarangi, S. (2006) Language Practices in Social Work: \nCategorisation and accountability in child welfare, London, Routledge. \n \nHarrington, D. and Dolgoff, R. (2008) ‘Hierarchies of Ethical Principles for Ethical \nDecision Making in Social Work’, Ethics and Social Welfare, 2(2), pp. \nforthcoming, July 2008. \n \nHealy, L. (2007) ‘Universalism and cultural relativism in social work ethics’, \nInternational Social Work, 50(1), pp. 11-26. \n \nHenriksen, J.O. and Vetlesen, A. (2001) Etik i arbete med människor, Lund, Sweden, \nStudentlittertur. \n \n 20 \nHope, T. (1999) ‘Empirical medical ethics’, Journal of Medical Ethics, 25, pp. 219-\n220. \n \nHugman, R. (2005) New Approaches in Ethics for the Caring Professions, \nBasingstoke and New York, Palgrave Macmillan. \n \nHugman, R. (2008) ‘Ethics in a world of difference’, Ethics and Social Welfare, 2(2), \nforthcoming, July 2008. \n \nInternational Federation of Social Workers and International Association of Schools \nof Social Work (2004) Ethics in Social Work, Statement of Principles, Berne, \nIFSW and IASSW (available at: www.ifsw.org). \n \nInternational Federation of Social Workers and International Association of Schools \nof Social Work (2005) Global Standards for Social Work Education, Berne, \nIFSW and IASSW (available at: www.ifsw.org). \n \nJapanese Association of Social Workers, Japanese Association of Social Workers in \nHealth, Japanese Association of Certified Social Workers and Japanese \nAssociation of Psychiatric Social Workers (2004) Code of Ethics of Social \nWorkers, Tokyo, Joint Committee on Ethics, JASW et al. \n \nJawad, R. (2007) ‘Human Ethics and Welfare Particularism: An Exploration of the \nSocial Welfare Regime in Lebanon’, Ethics and Social Welfare, 1(2), pp. 123-\n146. \n 21 \n \nKuhse, H. (1997) Caring: Nurses, Women and Ethics, Oxford, Blackwell. \n \nLingås, L. (1999) Etik for social - og sundhedsarbejdere. En grundbog, Copenhagen, \nHans Reitzels Forlag. \n \nLinzer, N. (1999) Resolving Ethical Dilemmas for Social Work Practice, Needham \nHeights, Mass, Allyn and Bacon. \n \nLoewenberg, F. and Dolgoff, R. (1996) Ethical Decisions for Social Work Practice, \nItasca, Illinois, F.E. Peacock. \n \nMach-Zagel, R. and Nøhr, K. (eds.) (2007) Etiske dilemmaer i paedagogisk arbejde, \nHans Reitzels Forlag, Copenhagen. \n \nMartin, E. (2001) Sozialpädagogische Berufsethik. Auf der Suche nach dem richtigen \nHandeln, Weinhem, Germany, Juventa. \n \nMcAuliffe, D. (2005) ‘I’m Still Standing: Impacts and Consequences of Ethical \nDilemmas in Direct Practice’, Journal of Social Work Ethics and Values, 2(1), \npp. www.socialworker.com\/jswve\/content\/blogcategory\/10\/34. \n \nMcAuliffe, D. and Chenoweth, L. (2007) ‘Leave No Stone Unturned: The Inclusive \nModel of Ethical Decision-making’, Ethics and Social Welfare, 2(1), pp. 38-\n49. \n 22 \n \nMcBeath, G. and Webb, S. (2002) ‘Virtue Ethics and Social Work: Being Lucky, \nRealistic, and not Doing one’s Duty’, British Journal of Social Work, 32, pp. \n1015-36. \n \nMcLaren, H. (2007) ‘Exploring the Ethics of Forewarning: Social Workers, \nConfidentiality and Potential Child Abuse Disclosures’, Ethics and Social \nWelfare, 1(1), pp. 22-40. \n \nNational Federation of Social Workers in Romania (2004) Ethical Code of the \nProfession of Social Worker, Mamamures, National Federation of Social \nWorkers in Romania. \n \nNussbaum, M. (2006) Frontiers of Justice, Cambridge, Mass, Belnap\/Harvard \nUniversity Press. \n \nOakley, J. and Cocking, D. (2001) Virtue Ethics and Professional Roles, Cambridge, \nCambridge University Press. \n \nOrme, J. (2002) ‘Social work, gender, care and justice’, British Journal of Social \nWork, 32(6), pp. 799-814. \n \nParrott, L. (2006) Values and Ethics in Social Work Practice, Exeter, Learning \nMatters. \n \n 23 \nParton, N. (2003) ‘Rethinking Professional Practice: The contributions of Social \nConstructionism and the Feminist “Ethics of Care’’’, British Journal of Social \nWork, 33, pp. 1-16. \n \nPellegrino, E. and Thomasma, D. (1993) The Virtues in Medical Practice, New York, \nOxford University Press. \n \nPumphrey, R. (1961) The heritage of American social work: Readings in its \nphilosophical and institutional development, New York, Columbia University \nPress. \n \nRagg, N. (1977) People not cases: a philosophical approach to social work, London, \nRoutledge and Kegan Paul. \n \nReamer, F. (1990) Ethical Dilemmas in Social Service (2nd Edition), New York, \nColumbia University Press. \n \nReamer, F. (1993) The Philosophical Foundations of Social Work, New York, \nColumbia University Press. \n \nReamer, F. (1999) Social  Work Values and Ethics (2nd Edition), New York, \nColumbia University Press. \n \nReamer, F. (2006) Social  Work Values and Ethics (3rd Edition), New York, \nColumbia University Press. \n 24 \n \nReamer, F. and Abramson, M. (1982) The Teaching of Social Work Ethics, Hastings-\non-Hudson, New York, Hastings Center. \n \nRhodes, M. (1986) Ethical Dilemmas in Social Work Practice, Boston, Mass., \nRoutledge and Kegan Paul. \n \nRossiter, A., Prilleltensky, I. and Walsh-Bowers, R. (2000), ‘A postmodern \nperspective on professional ethics’, in Fawcett, B., Featherstone, B., Fook, J. \nand Rossiter, A. (eds.), Postmodern Feminist Perspectives: Practice and \nResearch in Social Work, London, Routledge, pp. 83-103. \n \nRouzel, J. (1997) Le travail d’éducateur spécialisé: éthique et pratique, Paris, Dunod. \n \nSevenhuisen, S. (1998) Citizenship and the Ethics of Care: Feminist Considerations \non Justice, Morality and Politics, London, Routledge. \n \nSilavwe, G.W. (1995) ‘The Need for a New Social Work Perspective in an African \nSetting:  The Case of Social Casework in Zambia’, British Journal of Social \nWork, 25, pp. 71-84. \n \nSmajdov, A., Ives, J., Baldock, E. and Langlois, A. (2008) ‘Getting from the Ethical \nto the Empirical and Back Again: The Danger of Getting it Wrong, and the \nPossibilities for Getting it Right.’ Health Care Analysis, 16(1), pp. 7-16. \n \n 25 \nSouth African Black Social Workers’ Association (no date, received 1999) Code of \nEthics, South Africa, SABSWA. \n \nStrom-Gottfried, K. (2006) ‘Ethical Decision-making Among Hospital Social \nWorkers’, Journal of Social Work Ethics and Values, 3(1), \nwww.socialworker.com\/jswve\/content\/new\/27\/44. \n \nSullivan, W. and Kymlicka, W. (eds.) (2007) The Globalisation of Ethics, Cambridge \nUniversity Press, Cambridge. \n \nTata Institute of Social Sciences Social Work Educators’ Forum (1997) ‘Declaration \nof Ethics for Professional Social Workers’, The Indian Journal of Social \nWork, 58(2), pp. 335-341. \n \nTaylor, C. and White, S. (2000) Practising Reflexivity in Health and Welfare, \nBuckingham, Open University Press. \n \nTimms, N. and Watson, D. (eds.) (1978) Philosophy in social work, Routledge and \nKegan Paul, London. \n \nWhite, S. and Stancombe, J. (2003) Clinical Judgement in the Health and Welfare \nProfessions: Extending the Evidence Base, Maidenhead, Open University \nPress. \n \n 26 \nWiddershoven, G. and Van Der Scheer, L. (2004) ‘Integrated empirical ethics: loss of \nnormativity?’ Medicine, Health Care and Philosophy, 7(1), pp. 71-79. \n \nYip, K.-S. (2004) ‘A Chinese cultural critique of the global qualifying standards for \nsocial work education’, Social Work Education, 23(5), pp. 597-612. \n \n \n \n \n"}