{"doi":"10.1080\/00050060701648191","coreId":"101766","oai":"oai:epubs.surrey.ac.uk:1197","identifiers":["oai:epubs.surrey.ac.uk:1197","10.1080\/00050060701648191"],"title":"Towards a systemic model of coaching supervision: Some lessons from psychotherapeutic and counselling models","authors":["Gray, DE"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-12-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AUSTRALIAN PSYCHOLOGICAL SOC","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1197<\/identifier><datestamp>\n      2017-10-31T14:00:59Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:6D676D74<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1197\/<\/dc:relation><dc:title>\n        Towards a systemic model of coaching supervision: Some lessons from psychotherapeutic and counselling models<\/dc:title><dc:creator>\n        Gray, DE<\/dc:creator><dc:publisher>\n        AUSTRALIAN PSYCHOLOGICAL SOC<\/dc:publisher><dc:date>\n        2007-12-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1197\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Gray, DE  (2007) Towards a systemic model of coaching supervision: Some lessons from psychotherapeutic and counselling models   AUSTRALIAN PSYCHOLOGIST, 42 (4).  pp. 300-309.      <\/dc:identifier><dc:relation>\n        10.1080\/00050060701648191<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1197\/","10.1080\/00050060701648191"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" 1 \n \n \n \n \n \n \n \nTowards a systemic model of coaching supervision – \nsome lessons from psychotherapeutic and counselling \nmodels \n \n \n \n \n \n \n \n \n \nProfessor David E Gray \nSchool of Management \nUniversity of Surrey, UK \n \n \n \n \n \n \nSubmitted 11 July 2007 \n 2 \nTowards a systemic model of coaching supervision – some lessons from \npsychotherapeutic and counselling models \nTo what extent are coaches engaging with supervision, is this important to their \nprofessional practice, and, if so, what kinds of processes or models of supervision are \nappropriate?  These questions now have some urgency, partly because of the \nexponential growth in people offering coaching services to organisations and \nindividuals, but also because (at least currently) the coaching profession is largely \nunregulated, and many coaches not professionally qualified, as coaches.  Indeed, in \ncontrast to some professional services, there is, as yet, no universally recognised \ncoaching qualification, or regulated set of approved skills or competencies for entry \ninto the coaching ‘industry’.  This contrasts starkly, for example, with the professional \ntraining and development of counsellors and psychotherapists who engage with \nsupervision through their professional training and as part of their ongoing \nprofessional practice. \nRecent research reveals a growing engagement amongst coaches with supervision.  \nStudies reported by Hawkins and Schwenk (2006), for example, suggest that 88 per \ncent of coaches believe that they should have continuous and regular supervision.  \nHowever, a study by The Association for Coaching (2007) showed that only just under \nhalf of respondents had a supervisor, whilst a third had some kind of arrangement \nsuch as peer supervision.  This means that just under a third had no supervision of \nany kind.  Reasons given for this lack of engagement include cost and the lack of \nexperienced supervisors available.  Also, while the organisations that purchase \ncoaching are clear that the coaches they hire should have supervision, they are \nunclear as to what forms that supervision should take (Hawkins and Schwenk, 2006). \nThis article, then, sets out to identify what kinds of models of supervision are \nappropriate to coaches.  In undertaking this objective, models and lessons from the \nsupervision of counsellors and psychotherapists will be explored.  There are three \nreasons for this.  Firstly, many current practicing coaches are professionally trained \nand have practiced, or are practising, as counsellors or psychotherapist.  Secondly, \nthere has been over 30 years of debate and analysis of alternative models of \nsupervision from which lessons for coaching supervision can be drawn.  Thirdly, even \nwhen coaching focuses ostensibly on business issues, personal, experiential and \nproblem-based themes often flow out of the coaching process.  These include ‘red \nflag’ issues when the coachee may be experiencing psychological difficulties.  As \nWhybrow and Palmer (2006) suggest, even non-clinical populations contain potentially \nvulnerable clients.  It seems, therefore, that (arguably) supervision models from a \ncounselling or psychological background may have some relevance for all business \nand evidence-based coaches.  \nWHAT DO WE MEAN BY SUPERVISION? \nAs Carroll (1996) points out, supervision is a word that has many meanings, its most \ncommon usage being to ‘oversee’.  This, however, is not the way in which many \ncommentators on supervision would define the term.  Loganbill et al., for example, \ndescribe it as: ‘an intensive, interpersonally focused, one-to-one relationship in which \none person is designated to facilitate the development of therapeutic competence in \nthe other person (1986: 4).  For Page and Wosket (1994) it is a two-way, interactive \nprocess in which the supervisor and supervisee act upon and influence one another, \nand where the end (re-contracting) mirrors the beginning (the contract).  It is a \ndynamic process where both parties develop together. The British Association for \nCounselling and Psychotherapy sees supervision as a formal collaborative process \nintended to help supervisees maintain ethical and professional standards of practice \nand to enhance creativity (BACP, 2005).   \n 3 \nThere is a sense, then, that supervision is a process in which the supervisor assists a \nsupervisee towards an agreed goal.  Carroll (1996), however, distinguishes between \ntraining supervision, in which someone undergoes initial professional development for \none of the helping professions, and consultative supervision, an arrangement between \ntwo qualified persons where one helps the other to reflect on their professional \npractice (a kind of co-supervision).  Trainee supervision, then, may indeed include (or \neven comprise) an element of overseeing and assessment – as well as collaboration.  \nThe supervision of qualified practitioners is more likely to contain a collaborative \nelement. \nThe tension between this assessment and support functions is well reflected in \nBernard and Goodyear’s (1998) definition of supervision as being a relationship which \nis:  \nAn intervention provided by a more senior member of a profession to a more \njunior member or members of that same profession.  This relationship is \nevaluative, extends over time, and has the simultaneous purposes of enhancing \nthe professional functioning of the more junior person(s), monitoring the quality \nof professional services offered to the client(s) she, he, or they see(s) and \nserving as a gatekeeper of those who are to enter the particular profession.  \n(Bernard and Goodyear, 1998: 6) \nVarious models of supervision are discussed next, not as a means of covering the \nentire territory, but as a means of illustrating a diversity of approaches that may have \nsome relevance to the supervision of coaches. \nSOME MODELS OF SUPERVISION \nCarroll (1996) describes three phases in the evolution of models of supervision within \nthe fields of counselling and psychotherapy.  Phase 1 was associated with \npsychoanalytic models.  In the days of Freud, supervision was largely informal, but in \n1922 the International Psychoanalytic Society formulated a set of standards within \nwhich personal analysis of the trainee was the cornerstone.   Thus began the tension \nbetween supervision and therapy that, according to Carroll (1996) remains unresolved \nto this day.  In other words, in some models of supervision, the supervisor provides \nboth supervision and personal therapy to the supervisee – a kind of blurring of roles.  \nThe second Phase of supervision, based on Counselling models, emerged in the \n1950s with an emphasis on skills development and a rather didactic framework in \nsome supervisory approaches.  As in Phase 1, the supervisor remained firmly fixed \nwithin his or her parent theoretical orientation and taught through this view of the \nworld.  Phase 3, beginning in the 1970s, was associated with developmental and \nsocial role models that emphasised the roles and tasks of the supervisor and the \nlearning stages of the supervisee.  \nIs it necessary, though, to have a model of supervision?  Hess (1986) takes a \nsomewhat phlegmatic view that the work of supervision probably gets done, \nirrespective of the particular theory or model used by the supervisor.  This is partly \nbecause reality demands it.  If the supervision misses core problems, these will return \nto irritate the supervisor-supervisee relationship until they are resolved.  It also \nhappens because the essential elements of supervision while addressed, are being \ngiven different terms by people with different theoretical orientations.  Hence, what a \npsychotherapeutically orientated supervisor may call a therapeutic alliance, a client \ncentred supervisor may call positive regard.  What is clear, however, is that while, for \nexample, psychotherapy can be seen as helpful to the process of supervision, it is not \nin itself a theory of supervision.  A theory of supervision has to address issues that are \nthose of the supervisee, not those of the client.  The remainder of this section outlines \nsome of these theoretical models.  Note that while it is recognised that group \n 4 \nsupervision is possible, the focus here will be on individual supervision, primarily \nbecause it is, at least currently, probably the most widely adopted format. \nDevelopmental models of supervision \nA developmental model of supervision has dominated counsellor-psychotherapist \nsupervision for many years, focused primarily on a stages model of development \n(Ronnestad and Skovholt, 1993). Indeed, Holloway (1987) comments that \ndevelopmental models of supervision have become the ‘zeitgeist of supervision \nthinking and research’ (1897: 209).  Developmental models are useful, because they \nallow us to understand changes in a trainee’s personal constructs through the process \nof assimilation, accommodation, conflict and disequilibrium (Stoltenberg, 1993).   \nOne of the first developmental models was suggested by Hogan (1964) who outlined \na four-stage process.  At Stage 1, the therapist tries to apply everything he\/she has \nlearned, demonstrating high degrees of dependence (on the supervisor) and \ninsecurity.  One of the supervision methods at this level is direct teaching.  At Level 2 \nthe therapist’s growth is characterised by what Hogan terms a dependency-autonomy \nconflict, with the therapist oscillating between being overconfident to being \noverwhelmed by the responsibilities involved in working within the profession.  This \nperiod also involves considerable fluctuations in levels of motivation.  Level 3 is where \nthe therapist becomes a master of his (sic) trade, with stable levels of motivation and \nincreased professional self-confidence.  At Level 4 the therapist demonstrates an \nartistry and creativity that is characteristic of being at a ‘master’ level.  Hence, he\/she \nis both insightful but also aware of the limitations of insightfulness, personally secure \nbut aware of insecurity.  At this level, the use of a peer supervisor is preferred to that \nof a control supervisor.  Hogan makes it clear, however, that the four levels are not \nmutually exclusive or discreet and that within his\/her own lifetime, the therapist may \nmove from Level 1 to 4 many times.  Subsequent models, however, tend to abandon \nthis approach, preferring a more sequential, linear formulation. \nStoltenberg (1981) takes Hogan’s (1964) model to develop what he calls the \ncounsellor complexity model with counsellors achieving more cognitive development \nas they progress through a series of developmental stages.  Stage 1 is characterised \nby a process in which the counsellor is encouraged to develop personal autonomy but \nwithin a structured environment.  At the next stage new skills and advice are offered \nby the supervisor whilst in Stage 3 more sharing and collegiality are encouraged.  In \nthe final, master, stage, consultation is provided but only when it is sought.  We find, \nthen, a developmental process in which the supervisee moves from a dependent to a \nmore autonomous position and in which the interventions of the supervisor are largely \ndetermined by these stages of growth. \nStoltenberg and Delworth (1987) suggest a three-stage Integrated Developmental \nModel (IDM) in which trainees move through a series of levels, progressing against \nthree primary structures – self-awareness and other-awareness, motivation and \nautonomy.  In terms of self and other-awareness, what they term Level 1, trainees \nfocus primarily on themselves, especially in terms of fears and uncertainties.  This \noften clouds the trainee’s ability to be empathetic and insightful about the needs of \ntheir clients.   At Level 2, the trainee begins to focus more on the emotional and \ncognitive needs of the client.  But by trying to see issues from the perspective of the \nclient, the Level 2 trainee may become immersed in their problems and as confused \nand pessimistic as the client themselves.  In contrast, Level 3 trainees are able to \nidentify the impact a client’s problems have on themselves and can move backwards \nand forwards between a focus on his\/her own emotional responses to the client and \nwhat the client is experiencing.  Levels of motivation also fluctuate across the three \nlevels.  Level 1 trainees tend to be highly motivated, but this is motivation \ncharacterised by uncertainty and a desire to follow the ‘correct’ approach to \n 5 \ncounselling.  At Level 2, trainees work with clients with a greater breadth of problems, \nand find that their own skills levels challenged, often resulting in fluctuations in \nmotivation levels.  At Level 3, motivation becomes more consistent as the trainee \nbegins to gain greater self-knowledge and understand and accept his\/her own \nstrengths and weaknesses. \nThe IDM model is dynamic in the sense that a trainee may be at Level 2 in some \ndomains (such as intervention skills, assessment techniques or theoretical orientation) \nbut at Level 1 in others.  Stoltenberg and Delworth (1987) suggest, however, that a \nfourth, higher level occurs (the Level 3 Integrated Counselor) when the therapist has \nintegrated Level 3 skills and knowledge across all the domains.  This, however, is a \nstage not attained by most therapists and can be regarded as a ‘master therapist’ \nlevel, reflecting both horizontal movement across domains as well as depth.   \nEmpirical research by Chagnon and Russell (1995), however, raises questions about \nthe validity of developmental models in general by exploring the developmental model \nproposed by Stoltenberg’s (1981).  If the model is to be trusted, not only must it be \nshown that trainees move sequentially through the stages, but supervisors must be \nable to assess the stage their trainees have reached and to adapt their intervention \naccordingly.  Chagnon and Russell’s (1995) study of 48 supervisors found that \nexperience was not significantly related to the assessment of trainee’s development \nlevel – in other words, both low and highly experienced supervisors tended to be \nequally effective in assessing the developmental level of the trainees.  However, most, \nregardless of experience level, had most difficulty in identifying development Level 2 \nin Stoltenberg’s (1981) model.  According to Chagnon and Russell (1995) this raises \nsome questions about the model itself.  It may be that, instead of discreet \ndevelopment levels, that are mutually independent, the levels are overlapping and \ninterdependent.  This may be particularly true of Level 2 trainees who exhibit \ncharacteristics of both Level 1 and Level 3.  Hence, rather than a sequential process, \ntrainees may ‘ebb and flow from one developmental level to the next’ (Chagnon and \nRussell, 1995: 557).  Holloway (1987) is also prepared to give developmental models \nonly marginal support.  Analysing the results of numerous empirical studies, she finds \nthat differences between levels appear most pronounced at a very beginning-level and \namongst internee-level trainees, and that these are largely based on relationship \ncharacteristics.  Hence, as we have seen, initial-level trainees seem to need more \nsupport, while interns demonstrate a sense of increasing independence.   \nSocial role supervision models \nAs noted above, social role models emerged in the 1970s and 1980s, emphasising \nthe roles and tasks of the supervisor as well as the stages of development of the \nsupervisee.  One of the most influential is the six focused model developed by \nHawkins and Shohet (2000). \nThe six focused model \nHawkins and Shohet (2000) present what they call a ‘double matrix’ model of \nsupervision, arguing that it differs to other models because it concentrates on the \nprocess of supervision, but within an organisational context, constraints and social \nnorms.  Far from supervision moving through a series of stages, supervision involves, \nat any time, operating at many different levels.  Four elements are involved: a \nsupervisor, a therapist (supervisee), a client and a work context.  While usually only \nthe supervisor and supervisee are present during the supervision, Hawkins and \nShohet (2000) argue that both the client and work (social) context are carried into the \nsupervision session (both consciously and unconsciously).  Hence, the supervision \nprocess involves two interlocking matrices: \n 6 \n• A therapy system connecting the supervisee and the client (foci 1 to 3 in \nFigure 1) \n• A supervision system connecting the supervisor and supervisee (foci 4 to 6 in \nFigure 1) \n \n[Figure 1 about here] \nThe purpose of the supervision system is to pay attention to the therapy system. This \ncan happen in two ways - through discussing reports, viewing written notes or viewing \nvideotapes, or through how that session is reflected in the here-and-now experiences \nof the supervision process.  In brief, the six elements consist of: \n1 Reflection on content of session (therapist narrative) \nThe aim here is to help the therapist to focus on the client and the choices the client is \nmaking.  The first stage here might be to get the therapist to describe the client in \nsome detail, including their physical appearance, their verbal and non-verbal \nbehaviours and how they came to engage with therapy. \n2 Exploration of strategies and interventions (therapist activity) \nHere the aim is to improve the therapist’s choices and skills in intervention, by \nexploring the strategies they used and what alternative strategies were available.  \nNew options are generated through brainstorming, with the supervisor taking care not \nto impose their own strategies but to get the therapist to devise their own. \n3 Exploration of the therapy relationship (therapy process) \nIn this mode, the supervisor focuses on what is happening at the conscious but also \nthe unconscious level in the therapy session.  This includes what is happening ‘around \nthe edges’ of the session, the metaphors and images that emerged and changes of \nvoice, posture, and Freudian slips.  It also involves looking for clues to the \ntransference that is happening from the client to the therapist (and the therapist’s \ncounter transference – see next section)   \n4  Focusing on the therapist’s counter-transference (supervisee’s state) \nAt this level, the focus is on the therapist’s own internal processes and how these are \naffecting the therapy process.  These include the therapist’s counter-transference, a \npredominantly unconscious reaction by the therapist to the client’s transference.   \n5 Focusing on the supervisory relationship (supervision process) \nHere, the processes at work between the client and therapist are explored through \nhow they are reflected in the relationship between the supervisor and the therapist.  \nSo, a therapist who is experiencing challenging behaviour from a client, may exhibit \nchallenging behaviour towards the supervisor.  The task of the supervisor is to identify \nthis process so that learning can emerge from it. \n6 Focusing on the supervisor’s own process (supervisor’s experience) \nThe emphasis here is on counter-transference towards the therapist.  For example, do \nthey feel threatened, challenged or merely bored?  In this mode, the supervisor has to \nbe aware of their own shifting feelings and sensations towards the therapist, while at \nthe same time attending to the content and process of the session.  Ellis (in Bernard \nand Goodyear, 1998) suggests that the choice of focus for any particular supervision \nsession should be determined by factors such as the contract between the supervisor \nand supervisee, the developmental stage of the supervisee, their theoretical \norientation and the learning needs identified from previous sessions.  The \nimplementation of some of these factors is discussed later. \n 7 \nThe Discrimination model \nThe Discrimination Model (Bernard and Goodyear, 1998) is another example of a \nsocial role supervision model.  It purports to be ‘a-theoretical’, and focuses instead on \nthe role of the supervisor who has three roles: teacher, counsellor and consultant and \nfor each of these can adopt three different types (foci) or supervision: \n• Intervention, where the supervisor concentrates on the supervisee’s intervention \nskills \n• Conceptualisation, that is, how the supervisee understands what is occurring in \nthe session \n• Personalisation, or how the supervisee adopts a style of approach which is \nuncontaminated by personal issues and counter-transference responses \nFor example, in the role of teacher, the supervisor might adopt an intervention focus \nthat didactically teaches the supervisee a therapeutic technique.  Again as a teacher, \nbut this time adopting a conceptualisation role, the supervisor might use transcripts of \nsessions to help the supervisee to identify themes within the client’s statements.  In \nthe role of counsellor, and adopting a focus of intervention, the supervisor might help \nthe supervisor to identify how the client is impacting on him\/her and undermining \nhis\/her ability to use his skills in therapy sessions.   \nIt is called a discrimination model, precisely because it requires the supervisor to tailor \nher or his responses to the supervisee based on their individual needs.  It is also a \nsocial model because it requires the supervisor to tailor their intervention, depending \non the situation they face.  Hence, at any one moment, the supervisor might be \nresponding in any one of nine ways (three roles multiplied by three foci).  As in other \nmodels, there is a recognition that for novice supervisee’s, there may be more of a \nfocus on the teaching role of the supervisor.  For more advanced supervisees, greater \nemphasis is placed on the consultant role, or a balance across all roles.  Implicit, then, \nis the acceptance that supervisees do pass through developmental stages. \nTOWARDS A MODEL OF COACHING SUPERVISION \nAlthough the models of counselling and psychotherapeutic supervision just described \nillustrate a range of debates and arguments, a number of themes (for coaching \nsupervision) appear relevant: \n• Supervision involves facilitating the development of the supervisee in terms of \nconfidence, motivation and knowledge \n• The relationship is complex and includes paying attention to what is happening \nboth between the supervisor and supervisee and the supervisee’s relationship \nwith their client \n• The supervisee’s development is not necessarily linear and can involve \nprogressing at varying speeds for different functions and processes.  It can \nalso include regression (for example, in confidence) \n• Teaching (or more accurately, learning) is at the heart of the relationship, both \nfor the supervisee but also for the supervisor \n• The supervisor\/supervisee relationship is influenced by social and \norganisational contexts within which it occurs \nAs Carroll (2006) warns, supervising coaches is not the same as supervising \ncounsellors, in part, because coaches are often working in and for organisations, and \nit is the organisation that sets the coaching agenda, particularly if they are sponsoring \nthe coaching intervention.  The role of the supervisor becomes one of handling the \n 8 \ntensions between the coach, the coachee and their organisation (Paisley, 2006) and \ncoping with complex dynamics such as maintaining professional boundaries, \nmanaging contracts and being aware of the needs and responsibilities of each player \n(Carroll, 2006).  Hence, while a coach and coachee may negotiate a set of objectives \nas part of a contracting process, the needs and requirements of the coachee’s \nsponsoring organisation are never far from the surface.  Towler calls the organisation \nthe ‘invisible client’ (2005: 309), which imposes unconscious influences in the \nsupervision room.  The supervisors of coaches, therefore, need to add the systemic \nand cultural aspects of organisations to their knowledge sets, as well as their \nunderstanding of an individual‘s perspectives.  The influences of organisational culture \nbecome a significant rather than an incidental factor in the process of supervision \n(Towler, 2005). \nFigure 2, then, offers a systemic model of coaching supervision that highlights some \nof the elements necessary within a supervisor-supervisee relationship (contracting, \nthe relationship itself, teaching and evaluation) but one which is bounded within \norganisational and social contexts, and within ethical norms.  What follows is offered \nin the spirit of discussion, rather than as a definitive model.   \n \n[Figure 2 about here] \n \nContracting \nSupervision starts with defining and structuring the supervisor-coach relationship.  \nThis, then, is the entry point to the systemic model.  Applying the work of Ronnestad \nand Skovholt (1993) to coaching, contracts can serve to identify and clarify: \n• The supervisee’s (coach’s) developmental needs including their education and \nwork experience \n• The supervisor’s competencies, making these explicit in terms of their \nprofessional skills and experience (including knowledge of organisational \nbehaviour) \n• Opportunities (and limitations) provided by work settings so that goals set are \npractical and realistic \n• Supervisory goals, methods and focus which are made explicit \nIt is important that both supervisor and coach explore each other’s expectations to see \nif they match.  It there is a mismatch, it is important that these differences are explored \nand negotiated.   \nThe contract should deal with the expectations and needs of third parties such as the \nclient or their sponsoring organisation (Copeland, 1998; Hawkins and Shohet, 2000).  \nIt is essential that the boundaries between operational and any clinical issues that \narise are described (Towler, 2005).  Organisations may have their own policies on \nsupervision, but even if they do not, they are likely to have clear expectations about \nthe quality of the work.  As Copeland (2006) also warns, the culture and values of \nsupervisors and the organisations in which they operate, may often be diametrically \nopposed.   \nWhatever the supervision approach, ground rules need to be established.  Hawkins \nand Shohet (2000) suggest that these include the frequency, duration and timing of \nthe supervisory sessions.  Boundary issues should also be made explicit, including the \nessential issue of confidentiality.  They warn, however, that confidentiality is easier to \n 9 \npromise than always keep.  When reporting on the progress of a coaching \nintervention, for example, supervisors (and coaches) will have to take care in \ndefending the anonymity of individual coachees.  Some organisations, of course, may \ninsist that individuals (for example those who are under-performing) are named.  The \ndegree of anonymity, then, needs defining explicitly in the contract.  Counsellors, \npsychotherapists and others then have a choice of whether to take part in such a \nprogramme or withdraw due to ethical reservations.   \nThe supervisory relationship \nAccording to Bernard and Goodyear a supervisory relationship is ‘a product of the \nuniqueness of two individuals, paired with the purposes of meeting for supervision and \nmodified by the demands of the various contexts that are the subject or content of the \nexperience’ (1998: 34).  This complex, unique, yet evolving relationship, is, of course, \ninfluenced and shaped by many internal and external factors and processes.  One is \nthe self-presentation of the coach, that is, his or her behaviours, confidence (or \nanxiety) and expectations.  Belief systems, theoretical orientation, and cultural \ndifferences (including both racial and gender differences) are all likely to play a \nsignificant role in the relationship. \nAn important issue raised by some commentators (Worthington, 1987; Feltham and \nDryden, 1994) is whether the supervisor and supervisee should come from the same \ntheoretical traditions.  Coaches who are trained in transactional analysis (TA), for \nexample, might find the supervision of someone steeped in a person-centred \nperspective ‘woolly’ and lacking in clear guidelines.  An empirical study by Efstation et \nal. (1990) found that of the 185 supervisors contacted, 25% took a psychodynamic \nposition, 17% cognitive behavioural, and 27% eclectic – but a total of 8 different \napproaches were identified.  Of course, creating homogeneity between supervisor and \ncoach may run the risk of failing to stimulate the creativity of active debate.   \nA more pluralistic approach may go some way to overcoming this, particularly in the \nway in which supervisors may be prepared to critically challenge the orthodoxy of a \nmodel.  In general, however, Feltham and Dryden (1994) warn that a pluralistic model \nis probably more suited to those at the ‘journeyperson’ or master craft person’ stages \nof development than to those who are still trying to consolidate their understanding.  \nOf course, in any one supervision session, some or all of these processes may be \nprominent.  In agreeing a supervisory contact it is important that both parties agree on \nwhat theoretical models the supervision draws upon and what are being requested. \nPluralism may be taken a stage further.  Foster (2000) points to the USA and Canada, \nwhere hierarchical supervision is available to trainees, but once qualified, the \napproach is more often one of peer group consultation.  The management of \nsupervision services, particularly in large organisations, may benefit from economies \nof scale (and diversity of support) if peer or group supervision is established. \nTeaching methods \nWe have seen that direct teaching or instruction does not play a particularly prominent \nrole in the psychotherapeutic models described earlier.  Nevertheless, there may be \ntimes when a supervisor wishes (or needs) to pass on skills, knowledge or ideas in a \nfairly didactic way.  There may, however, be different ways of approaching this. \nInstruction \nDuring the early stages of supervision, the supervisor may need to provide direct \ninstruction to the coach, especially in terms of building their skills.  Bernard and \nGoodyear (1998) outline four steps in what they call microtraining. \n 10 \n• Teaching one skill at a time.  Sometimes these skills will comprise part of a larger \nset of meta-skills or a more complex intervention. \n• Present the skill.  The supervisor demonstrates or models the skill. \n• Practice the skill.  This can be achieved through, say, role playing with the \nsupervisor.  However, this might prove uncomfortable to the coach and might be \nbetter accomplished through a group supervision model. \n• Allow for mastery.  This can only be achieved by practice, but also through \nassessing the level of mastery achieved.  According to Gagné et al. (1992), this \ncan only be determined by defining the criteria that demonstrate the achievement \nmastery. \nSometimes, the supervisor may even recommend books or other reading matter \n(Carroll, 1996).   \nIn supervising organisation-based coaches, supervisors need to consider learning \nopportunties embedded within the organisation itself.  These might include accessing \nor co-ordinating with mentoring and appraisal systems, and with attaining feedback \nfrom the coachee’s sponsor, peers and line managers on their progress and \nperformance.  \nSelf reflection \nIt is important to stand back and to reflect on the supervision process, particularly in \nrelation to whether it is fulfilling personal needs and goals.  Such reflectivity may \nimprove the supervisee’s work with their clients as well as their overall professional \njudgement (Neufeldt et al., 1996).  This reflective process is triggered by causal \nconditions, often the supervisee’s feelings of uncertainty, dilemma or surprise.  Before \nmoving towards understanding phenomena, intervening conditions mediate between \nthe problem and reflective processes.  These include the cognitive capabilities of the \nsupervisee (some will be more capable of reflection than others) and the \norganisational environment.  In searching to understand the phenomenon, attention \nwill be directed by the supervisor towards the coach’s reflections on their own actions, \nthoughts and emotions and secondly towards the interaction between the supervisor \nand coach themselves.  The reflective process needs to avoid defensive self-\nprotection and look to changing perceptions and practice, and the capability to make \nmeaning out of experience.  Hawkins and Shohet, (2000) recommend that this self-\nreflection can be used to identify the strengths and weaknesses of the current support \nsystem, decide whether the contract with the supervisor requires some renegotiation, \nor whether alternative forms of supervision (such as peer supervision) needs to be \narranged.  Given the influences of the organisational context in which the supervision \nmay be taking place, this could include the occasional introduction of non-therapeutic \nsupervisors if a more business-orientated perspective is needed.   \nModelling \nModelling involves the coach observing the supervisor engaged in the process of \nprofessional practice, and can provide a useful means of demystifying the process \nand providing the individual with a template for their own work (Stoltenberg, 1993).  As \nRonnestad and Skovholt (1993) point out, one of the hazards of modelling is that even \nexperienced supervisors may demonstrate inappropriate model characteristics.  \nSenior practitioners, for example, may tend to operate from her\/his own expert \nexperience base, while novice practitioners under supervision may prefer a more \nstructured, simple and step-by-step modelled procedure.  So, supervisors may need \nto reflect on (or discuss through their own supervision), what kinds of modelling \nbehaviours they are going to demonstrate, and how. \n 11 \nFeedback \nFeedback is part of the coaches’ learning process because it comprises an evaluative \nquality or judgement by the supervisor.  For the coach to learn from feedback it must \nbe clear, concise and honest.  This may sometimes mean that the feedback is critical \nand even confrontational.  When provided in an organisational context, feedback \nmight include a focus on how the coach is dealing with organisational objectives and \nneeds during the coaching process.  It may be prudent to prepare coaches at an early \nstage by indicating in the contract that feedback of this kind may occur.  Feedback is \nalso a form of evaluation.  So not only may evaluation influence the coach’s choice of \nteaching interventions, it may even trigger a re-contracting process. \nEvaluation \nAccording to Gray (2004), coaching should be evaluated, because it allows us a \ncritical window into professional practice.  It also allows us to develop self-knowledge, \nand the opportunity to identify how personal interactions, processes and outcomes \ncan be improved.  But if evaluation is appropriate for coaching, then it must be equally \nvalid for the supervision of coaching.  According to Loganbill, et al. (1982), evaluation \nis the final function of the supervision process, but one that may suffer from a tension \nwith the goal of other functions such as promoting the development of the supervisee.  \nOne approach might be to ignore or deny this judgemental element of evaluation.  A \nbetter approach, however, would be to encourage an ongoing dialogue involving the \neffects of evaluation upon the supervisor-supervisee relationship.  Indeed, as Hawkins \nand Shohet (2000) argue, evaluation should be a two-way process and needs to be \nscheduled into the arrangements for supervision.   \nA first, and obvious, question, however, is: what should be evaluated?  Bordin (1983) \nsuggests that this will be determined by the specific goals identified at the beginning of \nthe supervisor-trainee relationship.  Feltham and Dryden (1994) suggest three key \nareas for evaluation.  The first is how the supervisee is progressing.  Feedback on \nperformance may be important to inexperienced supervisees who are anxious to know \nif they are attaining an appropriate standard.  Supervisors may wish to provide \nfeedback on both their perceived strengths and weaknesses.  A second evaluation \ntheme is: ‘How are we getting on?’, with a focus on the supervisory alliance itself.  \nThis may include an evaluation of the original contract to see if it still holds.  The third \ntheme is to identify and discuss some of the recurring concerns that have emerged \nduring the supervision process, such as the supervisee’s lack of challenge to the client \nwhen necessary.  It is also important that trainees evaluate some of their less \nsuccessful interventions (Brown, 1985).  If supervision is taking place in a work-based \ncontext, then an important focus of evaluation will have to be whether the \norganisation’s objectives have been fulfilled and the problems that were encountered \nin meeting them. \nEthical issues \nAs Figure 2 shows, all the systemic elements within supervision are bounded by \nethical framework and constraints.  If psychotherapists supervise coaches who are \nalso psychotherapists, then there will be a congruence between the ethical codes of \neach.  Complications arise, however, when, say, the supervisor is a professional \npsychotherapist but the coach in not.  The latter may be a member of one of the \nprofessional coaching associations with its own code of ethics.  The EMCC, for \nexample, stipulates that its members must always act in the best interests of the \nclient, function from the position of dignity, autonomy and personal respect for the \nclient, and ensure that the client comes to no harm.  For the International Coaching \nFederation, coaches are required to (inter alia), respect the confidentiality of the \nclient’s information, set clear, appropriate and culturally sensitive boundaries and \n 12 \nhonour all agreements with clients.  In the future, it may be necessary for both \npsychotherapy and coaching associations to consider how their ethical codes \ninterface, the potential for conflicts and how these can be resolved. \nCONCLUSIONS  \nWe have seen, then, that many of the developmental models of supervision, drawn \nfrom psychotherapy and counselling, have been largely superseded by alternative and \nsomewhat more socially rooted approaches.  What most of these models have in \ncommon, however, is at least some notion of progress, development and change on \nthe part of the supervisee – whether this takes place through distinct, sequential \nstages or not.  For the supervision process to succeed, it needs to commence with a \nclearly defined set of principles in the form of a contract.  This is the bedrock of the \nsupervisor-supervisee relationship and should define the expected outcomes, \nprocess, and methodology that is going to be used.  Even how the contract can be \nmodified to meet changing circumstances should be described.   \nThe nature of the supervisor-supervisee relationship within coaching, however, is \nmuch harder to define, particularly if each party is working from different theoretical \nmodels.  This may occur when the supervisee is, for example, an evidence-based \nbusiness coach, while the supervisor is professionally trained as a psychotherapist.  \nThey may exhibit different cognitive styles, belief systems and differences in ethical \nperspectives.  Both parties, then, need to be sensitive to their potential similarities, but \nseek to work to resolve any differences.  How they do this, of course, could be \nspecified in the contract.  The relationship between the supervisor and supervisee will \ninvolve one or several approaches to teaching, ranging from didactic instruction \n(probably not a common occurrence) to collective reflection, modelling and feedback.  \nAll elements will be subject to evaluation (including the evaluation process itself).  \nGiven that coaching (even when ostensibly performance-related) often throws up \nemotional and psychological issues, it is worth considering a networked approach to \nsupervision, where supervision can be augmented, when required, by a supervisor \nfrom an alternative tradition.  For example, a psychotherapeutic supervisor could call \nupon a business-focused supervisor when issues of organisational behaviour or \npolitics are flagged as major problems for the coach. \nWhat key issues remain?  One is a very practical one - the extent to which coaches \nare actually engaging with supervision.  It seems from some recent studies that a \nsignificant proportion are not.  In those cases where coaches are actively engaging \nthe services of a supervisor, are these supervisors from the kinds of counselling and \npsychotherapeutic backgrounds discussed in this article?  Should the models of \ncoaching used by supervisors and coaches match?  Or is it better to engage the \nservices of a supervisor from a paradigm that contrasts with that of the coach?  Does \nmatching or non-matching affect the levels of satisfaction with the supervision process \nand even its skills and knowledge outcomes?  How can contracts be written that focus \non realistic outcomes and which are capable of meeting multi-stakeholder interests?  \nShould supervisors work in networks comprising different theoretical traditions \n(including different psychotherapeutic traditions) in order to offer a diverse level of \nsupport?  Should we move from a tradition of hierarchical supervision to peer \nsupervision? \nThese, and many other questions, are worthy of further empirical research.  \nAnswering these questions may take us some way towards what is needed - a \ndistinctive, accepted and applied model of supervision for coaches that moves us from \nclinical to professional developmental needs, as well as the needs of ‘the invisible \nclient’.   \n 13 \nREFERENCES \nAssociation for Coaching (2007) ‘Association for Coaching Supervision Report’ at: \nwww.associationforcoaching.com (Accessed 3 July). \nBernard, J.M. and Goodyear, R.K. (1998) Fundamentals of Clinical Supervision.  2nd \ned.  Needham Heights, MA: Allyn & Bacon. \nBordin, E.S. (1983)  ‘A Working Alliance Based Model of Supervision.’  The \nCounseling Psychologist  11  35-41. \nBritish Association for Counselling and Psychotherapy (2005)  Code of Ethics and \nPractice for the Supervision of Counsellors, \n(http:\/\/www.bacp.co.uk\/prof_conduct\/public_code_supervision.htm).  Accessed 19 \nMarch. \nBrown, D. (1985)  ‘The Preservice Training and Supervision of Consultants.’  The \nCounseling Psychologist  13(3)  410-425. \nCarroll, M. (1996)  Counselling Supervision: Theory, Skills and Practice.  London: \nCassell. \nCarroll, M. (2006) ‘Supervising executive coaches’ Therapy Today 17(5).   \nChagnon, J., and Russell, R.K. (1995)  ‘Assessment of Supervisee Developmental \nLevel and Supervision Environment Across Supervisor Experience’.  Journal of \nCounseling & Development  May\/June  73  553-558. \nCopeland, S. (1998) ‘Counselling supervision in organisational contexts’.  British \nJournal of Guidance & Counselling  26(3) 377-386. \nCopeland, S. (2006) ‘Supervision comes out of the closet’.  Therapy Today.  17(2). \nCraig, C.H. & Sleight, C.C. (1990) ‘Personality relationships between supervisors and \nstudents in communication disorders as determined by the Myers-Briggs Type \nIndicator’.  The Clinical Supervisor 8(1) 41-51. \nEfstation, J.F., Patton, M.J., and Kardash, C.M. (1990) ‘Measuring the Working \nAlliance in Counselor Supervision’  Journal of Counseling Psychology  37(3) 322-\n329. \nEllis, M.V. (unpublished manuscript) cited in Bernard, J.M. and Goodyear, R.K. (1998) \nFundamentals of Clinical Supervision.  2nd ed.  Needham Heights, MA: Allyn & \nBacon p.31. \nFeltham, C. and Dryden, W. (1994) Developing Counsellor Supervision.  London: \nSage. \nFoster, J. (2000) ‘Counselling in primary care and the new NHS’  British Journal of \nGuidance & Counselling 28(2) 175 – 190. \nGagné, R., Briggs, L.J. and Wager, W.W. (1992)  Principles of Instructional Design  \nOrlando, FL: Harcourt, Brace Jovanovich College Publishers. \nGray, D.E. (2004) ‘Principles and processes in coaching evaluation’.  International \nJournal of Mentoring and Coaching.  2(2) Online. \nHawkins, P. and Schwenk, G. (2006)  Coaching Supervision: A Paper Prepared for \nthe CIPD Coaching Conference  London: CIPD. \nHawkins, P. and Shohet, R. (2000) 2nd ed.  Supervision in the Helping Professions \nBuckingham Open University Press. \n 14 \nHesse, A.K. (1986)  ‘Growth of Supervision: Stages of Supervisee and Supervisor \nDevelopment.’  The Clinical Supervisor  4 51-67. \nHirsh, S.K. and Kummerow, J. (2000) 3rd ed.  Introduction to Type in Organisations  \nOxford: OPP. \nHogan, R.A. (1964)  ‘Issues and Approaches in Supervision’.  Psychotherapy, Theory, \nResearch & Practice.  1 139-141. \nHolloway, E.L. (1987)  ‘Developmental Models of Supervision: Is It Development?  \nProfessional Psychology: Research and Practice  18 (3)  209-216. \nLoganbill, C., Hardy, E., & Delworth, U. (1982) ‘Supervision: A conceptual model’.  \nThe Counseling Psycholgist, 10, 3-42. \nNeufeldt, S.A., Karno, M.P. and Nelson, M.L. (1996)  ‘A Qualitative Study of Experts’ \nConceptualization of Supervisee Reflectivity’.  Journal of Counseling Psychology  \n43(1) 3-9. \nPaisley, P. ‘Towards a theory of supervision for coaching – an integrated approach’, \ncited in Carroll, M. (2006) ‘Supervising executive coaches’ Therapy Today 17(5).   \nPage, S. and Wosket, V. (1994)  Supervising the Counsellor: a cyclical model.  \nLondon: Routledge. \nRonnestad, M.H. & Skovholt, T.M. (1993) ‘Supervision of Beginning and Advanced \nGraduate Students of Counseling and Psychotherapy’  Journal of Counseling & \nDevelopment  March\/April  71  396-405. \nStoltenberg, C.D. (1981)  ‘Approaching supervision from a developmental perspective: \nThe counselor complexity model’.  Journal of Counseling Psychology  28  59-65. \nStoltenberg, C.D. (1993) ‘Supervising Consultants in Training: An Application of a \nModel of Supervision’  Journal of Counseling & Development  \nNovember\/December 72  131-138. \nStoltenberg, C.D and Delworth, U. (1987)  Supervising Counselors and Therapists   \nSan Fransisco: Jossey-Bass Publishers. \nTowler, J. (2005)  A grounded theory study of organisational supervision of \ncounsellors: The influence of the invisible client  PhD thesis, University of Surrey. \nWhybrow, A. & Palmer, S. (2006) ‘Taking stock: A survey of Coaching Psychologists’ \npractices and perspectives’. International Coaching Psychology Review  1(1) 56 – \n70. \nWorthington, E.L. (1987)  ‘Changes in supervision as counselors and supervisors gain \nexperience: A Review’.  Professional Psychology  18  189-208. \n 15 \n \nFigure 1  The six foci of supervision (Hawkins and Shohet, 2000) \n \n \n \n \n \nFigure 2  A systemic model of coaching supervision \n \n"}