{"doi":"10.1029\/2009JA014336","coreId":"59286","oai":"oai:nora.nerc.ac.uk:8371","identifiers":["oai:nora.nerc.ac.uk:8371","10.1029\/2009JA014336"],"title":"Three-dimensional diffusion simulation of outer radiation belt electrons during the 9 October 1990 magnetic storm","authors":["Albert, J. M.","Meredith, N. P.","Horne, R. B."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009","abstract":"Relativistic (>1 MeV) electron flux increases in the Earth's radiation belts are significantly underestimated by models that only include transport and loss processes, suggesting that some additional acceleration process is required. Here we use a new, three-dimensional code that includes radial diffusion and quasi-linear pitch angle and energy diffusion due to chorus waves, including cross terms, to simulate the 9 October 1990 magnetic storm. The diffusion coefficients are activity dependent, and time-dependent boundary conditions are imposed on all six boundary faces, taken from fits to CRRES Medium Electrons A electron data. Although the main phase dropout is not fully captured, the persistent phase space density peaks observed during the recovery phase are well explained, but this requires both chorus wave acceleration and radial diffusion","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/59286.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/8371\/1\/627539_2_merged_1245706485.pdf","pdfHashValue":"817acd757be9407bf4d9d76249da64f55b995182","publisher":"American Geophysical Union","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:8371<\/identifier><datestamp>\n      2012-11-22T12:04:59Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533235<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8371\/<\/dc:relation><dc:title>\n        Three-dimensional diffusion simulation of outer radiation belt electrons during the 9 October 1990 magnetic storm<\/dc:title><dc:creator>\n        Albert, J. M.<\/dc:creator><dc:creator>\n        Meredith, N. P.<\/dc:creator><dc:creator>\n        Horne, R. B.<\/dc:creator><dc:subject>\n        Space Sciences<\/dc:subject><dc:description>\n        Relativistic (>1 MeV) electron flux increases in the Earth's radiation belts are significantly underestimated by models that only include transport and loss processes, suggesting that some additional acceleration process is required. Here we use a new, three-dimensional code that includes radial diffusion and quasi-linear pitch angle and energy diffusion due to chorus waves, including cross terms, to simulate the 9 October 1990 magnetic storm. The diffusion coefficients are activity dependent, and time-dependent boundary conditions are imposed on all six boundary faces, taken from fits to CRRES Medium Electrons A electron data. Although the main phase dropout is not fully captured, the persistent phase space density peaks observed during the recovery phase are well explained, but this requires both chorus wave acceleration and radial diffusion.<\/dc:description><dc:publisher>\n        American Geophysical Union<\/dc:publisher><dc:date>\n        2009<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/8371\/1\/627539_2_merged_1245706485.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Albert, J. M.; Meredith, N. P.; Horne, R. B..  2009  Three-dimensional diffusion simulation of outer radiation belt electrons during the 9 October 1990 magnetic storm.   Journal of Geophysical Research, 114, A09214. 21, pp.  https:\/\/doi.org\/10.1029\/2009JA014336 <https:\/\/doi.org\/10.1029\/2009JA014336>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.agu.org\/pubs\/crossref\/2009\/2009JA014336.shtml<\/dc:relation><dc:relation>\n        10.1029\/2009JA014336<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/8371\/","http:\/\/www.agu.org\/pubs\/crossref\/2009\/2009JA014336.shtml","10.1029\/2009JA014336"],"year":2009,"topics":["Space Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"JOURNAL OF GEOPHYSICAL RESEARCH, VOL. ???, XXXX, DOI:10.1029\/,\nThree-dimensional diffusion simulation of outer1\nradiation belt electrons during the October 9, 1990,2\nmagnetic storm3\nJay M. Albert,\n1\nNigel P. Meredith,\n2\nand Richard B. Horne\n2\nJ. M. Albert, Air Force Research Laboratory\/RVBX, 29 Randolph Road, Hanscom AFB, MA\n01731-3010, USA.\nN. P. Meredith and R. B. Horne, British Antarctic Survey, Natural Environment Research\nCouncil, Madingley Road, Cambridge, CB3 0ET, UK. (nmer@bas.ac.uk; r.horne@bas.ac.uk)\n1Air Force Research Laboratory, Space\nVehicles Directorate, Hanscom Air Force\nBase, Massachusetts, USA.\n2British Antarctic Survey, Natural\nEnvironment Research Council, Cambridge,\nUK.\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 2 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nAbstract.4\nRelativistic (> 1 MeV) electron flux increases in the Earth’s radiation belts5\nare significantly underestimated by models that only include transport and6\nloss processes, suggesting that some additional acceleration process is required.7\nHere we use a new, 3D code that includes radial diffusion and quasi-linear8\npitch angle and energy diffusion due to chorus waves, including cross terms,9\nto simulate the October 9, 1990, magnetic storm. The diffusion coefficients10\nare activity dependent, and time-dependent boundary conditions are imposed11\non all six boundary faces, taken from fits to CRRES\/MEA electron data. Al-12\nthough the main phase dropout is not fully captured, the persistent phase13\nspace density peaks observed during the recovery phase are well explained,14\nbut this requires both chorus wave acceleration and radial diffusion.15\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 3\n1. Introduction\nOuter zone radiation belt electrons exhibit highly dynamic behavior during geomagnetic16\nstorms. It has been well documented that the energetic flux drops rapidly during the storm17\nmain phase but recovers over several days, often to higher than original levels. Radial18\ndiffusion accelerates particles (as they move inward at constant first and second adiabatic19\ninvariant), but is hard-pressed to reproduce the rate and extent of the recovery, especially20\nwhen losses are considered, without an additional source of energization.21\nThe moderate storm that occurred on October 9, 1990 has been particularly well studied,22\nbecause of its detailed observation by CRRES. Brautigam and Albert [2000] simulated it23\nwith activity-dependent radial diffusion and a realistic, variable outer boundary condition.24\nPlasmaspheric hiss was the only loss process considered. This model was found to work25\nreasonably well for electrons with first adiabatic invariant M ≈ 100 − 300 MeV\/G, but26\nwas unable to account for the increase, and inward-pointing phase space density gradient,27\nfor M ≈ 700 − 1000 MeV\/G. Many other one dimensional (1D) simulations of radial28\ndiffusion have been performed, usually with timescale estimates for wave-induced losses29\n[e.g., Shprits and Thorne, 2004; Shprits et al., 2005, 2006b; Fei et al., 2006; Lam et al.,30\n2007] and with an estimated internal source term [Tu et al., 2009]. The results are mixed,31\nbut generally support the finding that radial diffusion is insufficient.32\nEnergy diffusion, caused by cyclotron-resonant interactions with whistler mode cho-33\nrus waves, is frequently invoked as a candidate mechanism for additional energization34\n[Horne and Thorne, 1998; Summers et al., 1998]. Indeed, the gradual acceleration of35\nelectrons to relativistic energies during the recovery phase of the October 9, 1990 storm36\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 4 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nwas associated with prolonged substorm activity as monitored by the AE index, electron37\ninjections at subrelativistic energies, and enhanced chorus amplitudes [Meredith et al.,38\n2002]. Furthermore, flat-topped electron pitch angle distributions, characteristic of pitch39\nangle and energy scattering by resonant wave-particle interactions with whistler mode40\nchorus waves, developed at MeV energies [Horne et al., 2003]. Much work has been done41\nin recent years to document enhanced chorus waves during storms [e.g., Meredith et al.,42\n2003a; Smith et al., 2004], to evaluate the corresponding quasi-linear diffusion coefficients43\n[Albert, 2005; Glauert and Horne, 2005], and to estimate the particle evolution using a44\n1D energy diffusion equation [e.g., Summers and Ma, 2000; Summers et al., 2002; Horne45\net al., 2005a,b].46\nSeveral idealized 2D simulations of diffusion in pitch angle and energy near L = 4.5 have47\nbeen done, accounting for chorus waves [Albert and Young, 2005; Shprits et al., 2006a; Tao48\net al., 2008; Xiao et al., 2009], hiss combined with magnetosonic waves [Tao et al., 2009],49\nand chorus waves combined with VLF hiss and electromagnetic ion cyclotron (EMIC)50\nwaves in high density plumes [Li et al., 2007]. None of these studies included radial51\ndiffusion. No studies seem to have solved the local diffusion equation with radial diffusion52\ntreated as a source or loss term, although Thorne et al. [2007] used lifetimes, obtained53\nfrom a pitch angle diffusion equation, in separate 1D equations for radial diffusion and54\nenergy diffusion.55\nSome preliminary three dimensional simulations, including radial, pitch angle, and en-56\nergy diffusion, have been performed [Varotsou et al., 2005, 2008; Subbotin et al., 2008].57\nFurthermore, some progress has been made in adding pitch angle and energy diffusion to58\nadvection-driven ring current codes, which are bounce averaged but not drift averaged59\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 5\nand so are essentially four dimensional. Fok et al. [2008] treated pitch angle and energy60\ndiffusion by chorus, while Jordanova et al. [2008] included pitch angle diffusion by EMIC61\nwaves.62\nIt is widely believed that the generation of chorus waves inherently involves nonlinear63\nwave-particle coupling [e.g., Nunn, 1974, 1997; Katoh and Omura, 2007a,b.] However, the64\nparticles involved are generally of much lower energy than the ones considered here, which65\nare taken to interact “parasitically” with fully developed chorus. Individual, coherent66\nwhistler mode waves can lead to particle diffusion, phase trapping, or phase bunching67\n(without trapping), depending primarily on the competing effects of wave amplitude and68\nbackground magnetic field inhomogeneity at resonance [Albert, 2000, 2002; Trakhtengerts69\net al., 2003; Omura and Summers, 2006; Demekhov et al., 2006; Bortnik et al., 2008].70\nHowever, the applicability of this picture to the global evolution of energetic particle71\ndistributions during storm conditions has not yet been established. This paper is based72\non quasi-linear diffusion, both because to some extent “it seems to work,” and as a basis73\nfor comparison with future developments in nonlinear modeling.74\nThis paper combines diffusion by chorus waves with radial diffusion in a carefully chosen75\nthree dimensional grid. Cross diffusion, which was not treated by any of the papers just76\ncited except Albert and Young [2005], Tao et al. [2008, 2009], and Xiao et al. [2009], is77\nincluded. CRRES\/MEA data is used to evaluate time-dependent boundary conditions at78\nlow and high E and α0, as well as at high and low L. This required substantial fitting,79\ninterpolation, and extrapolation of the data, as described below. The particle data was80\nused to drive the boundaries only; after initialization, data was not assimilated into the81\ninterior of the grid (as was done by Shprits et al. [2007]).82\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 6 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\n2. The Diffusion Equation\nCyclotron-resonant wave-particle interactions break the first two adiabatic invariants,83\nwhile drift-resonant electric and magnetic fluctuations break only the third invariant.84\nThe assumptions of continuous, small, uncorrelated resonances lead to a multidimensional85\ndiffusion equation for the phase space density, f , written as86\n∂f\n∂t\n=\n∂\n∂J1\n(\nD11\n∂f\n∂J1\n+ D12\n∂f\n∂J2\n)\n+\n∂\n∂J2\n(\nD12\n∂f\n∂J1\n+ D22\n∂f\n∂J2\n)\n+\n∂\n∂J3\nD33\n∂f\n∂J3\n. (1)\nThe cyclotron frequency and drift frequency interactions are considered uncoupled, so no87\nterms involving D13 or D23 are included.88\nIt is common to change variables from (J1, J2, J3) to (α0, E, L), where L (often denoted89\nL∗) labels the drift shell [Roederer, 1970], E is energy, and α0 denotes equatorial pitch90\nangle. Actually, in a non-axisymmetric magnetic field, the minimum (equatorial) value91\nof α will vary for different magnetic field lines of a particle’s drift shell. However, it is92\nreasonable to relate the two sets of variables using the expressions suitable for a dipole93\nfield. This can be considered simply a convenient change of variables, as long as the94\ninvariants are properly computed in a realistic magnetic field model, and gives95\n∂f\n∂t\n=\n1\nG\n∂\n∂α0\nG\n(Dα0α0\np2\n∂f\n∂α0\n+\nDα0p\np\n∂f\n∂p\n)\n+\n1\nG\n∂\n∂p\nG\n(Dα0p\np\n∂f\n∂α0\n+ Dpp\n∂f\n∂p\n)\n+ L2\n∂\n∂L\nDLL\nL2\n∂f\n∂L\n, (2)\nwhere G = p2T (α0) sinα0 cosα0 [Schulz, 1991] and T (α0) ≈ 1.30 − 0.56 sinα0 is the96\nnormalized bounce period [e.g., Lyons et al., 1972]. It is understood that the L derivatives97\nare evaluated at fixed (J1, J2), not fixed (α0, p). Because E and p are simply related, terms98\nlike “energy diffusion” and “diffusion in p” will often be used interchangeably.99\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 7\n2.1. Pitch Angle and Energy Diffusion Coefficients\nThe pitch angle and energy diffusion coefficients are evaluated according to bounce-100\nand drift-averaged quasi-linear theory [Albert, 2005; Glauert and Horne, 2005], requiring101\nmodels of wave intensity, B2w, and its distribution in frequency and wave normal angle, as102\nwell as values of the plasma frequency-to-gyrofrequency ratio, fpe\/fce. As mentioned, only103\nwhistler mode chorus waves will be considered. Values of B2w and fpe\/fce were taken from104\nstatistical maps of CRRES observations, compiled with resolution of 1 hour in magnetic105\nlocal time and 0.1 in L. The maps were also parameterized by Kp (into three ranges:106\nKp < 2, 2 ≤ Kp < 4, and Kp ≥ 4), and by latitude (“equatorial,” within 15◦ of the107\nequator, and “mid-latitude,” 15◦ − 30◦ off the equator). The resulting values are shown108\nin Figs. 1 and 2. A similar model, parameterized by AE, was presented by Meredith et109\nal. [2003b].110\nThe frequency and wave normal angle distributions were represented, as usual, by111\ntruncated Gaussians. The peak, width, lower cutoff, and upper cutoff for ω and x =112\ntan θ were (ωm, δω, ωLC , ωUC) = (0.35, 0.15, 0.125, 0.575)Ωeq and (xm, δx, xmin, xmax) =113\n(0, tan 30◦, 0, 1), respectively. These were used to compute tables of diffusion coefficients114\nfor 89 integer values of α0, 40 values of E between 0.01 and 10 MeV, and 9 values of fpe\/fce115\nbetween 1 and 20, using the computational techniques of Albert [2005]. These tables were116\nthen scaled in B2w and interpolated in fpe\/fce, in conjunction with the statistical maps,117\nto obtain drift-averaged diffusion coefficients for the three ranges of Kp. A very similar118\nprocedure was followed by Varotsou et al. [2008]. Results at L = 4.55 are shown in Fig.119\n3.120\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 8 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\n2.2. Radial Diffusion Coefficients\nElectric and magnetic radial diffusion coefficients, DLL = De + Dm, were taken from\nBrautigam and Albert [2000] and are also Kp-dependent. The magnetic contribution is\ngiven as Dm = 10\n0.506Kp−9.325L10 (in units of day−1), while\nDe =\n1\n4\nc2\nR2e\nE˜2\nB20\nT\n1 + (ωDT\/2)2\nL6. (3)\nThis expression is in Gaussian units, with B0 ≈ 0.31 G, and is based on electric field\nfluctuations with E˜ and the fluctuation decay time T given by\nE˜ = E0 + E1(Kp− 1), T = 2700 s, (4)\nwith numerical values E0 = 3.33 × 10−9 statvolt\/cm (0.1 mV\/m) and E1 = 8.67 × 10−9\nstatvolt\/cm (0.26 mV\/m). The drift frequency ωD may be written as\nωD =\n3\n2\nL\nmec\neB0\nc2\nR2e\n(p\/mc)2 sin2 α0√\n1 + (p\/mc)2 sin2 α0\n. (5)\nRepresentative values of DLL are also shown in Fig. 3.121\n2.3. Variables and Grids\nRadial diffusion occurs at constant first and second adiabatic invariant, so it is most122\nsimply treated in the variables (J1, J2, J3). Cyclotron-resonant interactions are more nat-123\nurally expressed as diffusion in pitch angle and energy, both because the boundaries124\ncorrespond more closely to real particle detectors, and because terms involving cross dif-125\nfusion are typically dominated by pitch angle diffusion. However, cross diffusion, which126\nexpresses the physical relationship between resonant changes in α0 and p, can have sig-127\nnificant consequences, since typically Dα0α0\/p\n2 > |Dα0p|\/p > Dpp. Thus it is preferable to128\nretain it despite the numerical difficulties it presents to straightforward finite differencing129\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 9\nin (α0, E, L) [Albert, 2004, 2009]. These difficulties may be overcome in a number of ways130\n[Albert and Young, 2005; Tao et al., 2008, 2009; Xiao et al., 2009].131\nThe method of Albert and Young [2005] used the diffusion coefficients themselves to132\nconstructs new variables, (Q1, Q2) at a fixed L, in which cross diffusion vanished; it133\nconsisted of choosing Q1 = α0 and integrating a differential equation for curves of constant134\nQ2. This can be carried out independently at each L. To make radial diffusion easy to135\nimplement, the three dimensional grid is generated from a convenient set of (α0, E) at one136\nL value, mapped to other L at constant J1 and J2 as in a dipole field, and then converted137\nto (Q1, Q2). This gives138\n∂f\n∂t\n=\n1\nΓ\n( ∂\n∂Q1\nΓD1\n∂f\n∂Q1\n+\n∂\n∂Q2\nΓD2\n∂f\n∂Q2\n)\n+ L2\n∂\n∂L\nDLL\nL2\n∂f\n∂L\n, (6)\nwhere Γ = |∂(J1, J2)\/∂(Q1, Q2)| and again radial diffusion operates at fixed (J1, J2), not139\nfixed (Q1, Q2).140\nSince the points are not regularly aligned in the (Q1, Q2) plane, finite differencing re-141\nquires interpolation in Q2, though not in Q1 (since the mapping in L preserves alignment142\nin Q1 ≡ α0). Exactly analgous interpolation would be required even without cross diffu-143\nsion, since the mapped points are not aligned in the (α0, E) plane either [Subbotin et al.,144\n2008]. This procedure was carried out using diffusion coefficients for each of the three Kp145\nranges. When the appropriate range of Kp changes in the course of a run, the values of146\n(Q1, Q2) (and D1, D2, Γ) are changed, but the grid points retain their values of α0, E, L,147\nand f .148\nFig. 4 illustrates how mapping in L shifts and distorts the range of E. At L = 6.15,149\nthe computational grid covers E = 0.2− 2 MeV, while at L = 3.55 this becomes roughly150\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 10 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\n0.5 − 4 MeV. With this scheme, there are no wasted grid points; all of the grid points151\ncan couple to the computational domain through diffusion in all of the variables. Fig. 5152\nshows the grid points in more detail in (α0, E) planes at several values of L. Also shown153\nare the same physical points plotted in (Q1, Q2) coordinates (evaluated for Kp < 2), as154\nwell as in (J1, J2) coordinates. Grid points plotted in red lie within the energy range of155\nthe CRRES\/MEA detector, so that actual measurements are at least potentially available156\nto initialize the flux values, and for comparison during the simulation.157\n3. CRRES\/MEA Data Processing\nThe version of MEA data used by Brautigam and Albert [2000] was limited by both158\nsaturation and contamination by high energy protons, which prohibited the use of the159\ntwo lowest energy channels. The version used here, available through the National Space160\nScience Data Center (NSSDC), has been reprocessed, including a “foldover correction,”161\nwhich overcomes these limitations [Vampola, 1996; Lemaire et al., 1998]. Thus this MEA162\ndata set provides flux at α = 5◦, 10◦, . . . , 90◦, and 17 values of energy (E = 0.148 MeV to163\n1.581 MeV), every 60 seconds. The problem is to determine values at points (αi, Ej, Lk)164\nof the computational grid, at any time t. (For grid points, αi means equatorial pitch angle165\nα0.)166\nThe CRRES ephemeris files used provide time-tagged satellite location and local mag-\nnetic field B every 30 seconds. For each entry, the ONERA code [Boscher et al., 2004-2008]\nwas used with the Olson-Pfitzer quiet and IGRF magnetic field models to determine and\nthe adiabatic invariants K and L corresponding to the 18 local pitch angle values, (L\ndepends weakly on α, but not on energy. K is defined to be proportional to J2\/\n√\nJ1\n[Schulz, 1991], so that it is also independent of energy.) Results with L within δL = 0.05\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 11\nof a grid value Lk were recorded, along with the earliest and latest times, t1 and t2, of\neach “visit” to each Lk. Equatorial pitch angles α0 were then determined from\nY (sinα0)\nsinα0\n=\nK\nLRe\n√\nBeq\n,\nwhere Re is the radius of the Earth, Beq is the value of the (model) magnetic field at the167\nequator, and Y (sinα0) is taken to be the function corresponding to a dipole. (See the168\ndiscussion in the previous section.) The sets of α0 values were averaged to assign a single169\nα0 to each Lk, local pitch angle bin, and time interval (t1, t2). Schematically, these steps170\nare:171\n(x, B)(t)→ {K,L}(t)→ {α0, L}(t)\n→ ({α0}, Lk)(t1, t2), (7)\nwhere {} indicates a set corresponding to the 18 different values of local pitch angle α.172\nFlux measurements taken during each interval (t1, t2) were identified, and log(j) was173\ntime-averaged for each value of α and E to uniquely specify j as a function of α0, E,174\nand t¯ = (t1 + t2)\/2. Next, since the data was far too sparse to cover all values of α0,175\nthe flux was fit to a function of the form A sinn α0 for each MEA energy channel (or, if176\nn was negative, j was simply averaged, equivalent to setting n = 0). Interpolating in177\nα0, where the data was sufficient, yields the flux values shown in Fig. 6. In making this178\nplot of j(L, t), the constant value J2 = 1.78× 10−16 g(cm\/s)Re was chosen. This follows179\nBrautigam and Albert [2000], who were performing 1D simulations of f(L, t) at constant180\nvalues of J1 and J2 and determined that this value of J2 maximized the overlap with the181\navailable data. This should remain roughly true even though a different magnetic field182\nmodel is used here, and allows for at least rough correspondence to the previous work.183\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 12 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nThe data coverage was then extended by extrapolating the A sinn α0 fits beyond the184\nmeasured values, and by linear interpolation and extrapolation of log j in logE. Finally,185\nfor arbitrary times t, linear interpolation of log j(t) was performed at fixed (α0, E, L).186\nThis allows j to be evaluated at any grid point (αi, Ej, Lk) at any time. Schematically,187\n[{j}](t)→ [{j}](t1, t2)→ [A, n](t¯)→ [j(α0)](t¯)\n→ j(αi, E, t¯)→ j(αi, Ej, Lk, t), (8)\nwhere [ ] refers to a set corresponding to the 17 different energy channels of MEA. The188\nresults are shown in Fig. 7, for the same fixed value of J2. (No values are shown below L =189\n4.2 for 0.42 MeV, because this is off the computational grid.) These fits, interpolations,190\nand extrapolations of the available data are regrettable but unavoidable if values are to191\nbe determined (or assigned) to the entire computational grid.192\nOnce determined, the fluxes were converted to phase space density, and are shown in193\nFig. 8 at fixed values of first adiabatic invariant M = J1 (given in units of MeV\/G).194\nThese values are now taken to represent the actual data, and will be used to initialize the195\nsimulations, to drive them at the boundaries, and for comparison with the results.196\n4. Simulations\nData from CRRES\/MEA was processed as just described, for the interval October 8 –197\n18, 1990 (day of year 281 – 291). Dst for that interval is shown in Fig. 6, and indicates a198\nmoderate geomagnetic storm beginning during October 9 (day 282 of 1990). As discussed199\nin detail by Brautigam and Albert [2000], a storm sudden commencement at 1315 UT200\n(time 282.54) was accompanied by strong flux decrease at L = 5 for E = 0.42−1.47 MeV.201\nThis was followed by an injection of several-hundred keV electrons at L > 6 an hour into202\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 13\nthe recovery phase (time 283.37). Within the next 5 hours (by time 283.58), ∼ 100 keV203\nelectron flux at L = 3 − 6 had greatly increased, while ∼ 1 MeV flux increased much204\nmore gradually. This trend of increase near L = 5 was interrupted by notable dips around205\nt=285.0 and t=288.5. This behavior is reproduced in the interpolated and extrapolated206\ndata of Fig. 7.207\nThe corresponding values shown in Fig. 8 were used not only to initialize the simulation,\nbut also for time-dependent boundary values on all six planar faces of the 3D simulation\ndomain. Thus both radial diffusion and local heating were supplied with realistic, dynamic\n“seed populations” from which to generate flux at relativistic energies. Grid resolution\nwas 43 values of Q1, 25 points in Q2, and 27 points in L, covering 3.55 ≤ L ≤ 6.15 with\nΔL = 0.10, Δα0 ≈ 2◦, and Ej+1\/Ej ≈ 1.1 (although only in L was the spacing constant,\nas discussed). For simplicity, a fully explicit finite differencing scheme was used, which\nlimited the time step by the Courant-Friedrichs-Lewy condition for linear stability, namely\nmax\n[\nD1\n(ΔQ1)2\n+\nD2\n(ΔQ2)2\n+\nDLL\n(ΔL)2\n]\nΔtCFL <\n1\n2\n. (9)\nThe actual time step was taken to be 0.5ΔtCFL, and was reevaluated whenever Kp208\nchanged. This resulted in Δt ≈ 16 s for Kp < 2, Δt ≈ 4.3 s for 2 ≤ Kp < 4, and209\nΔt ≈ 0.77 s for Kp ≥ 4. The entire 9.5 day simulation ran in about 50 minutes on a210\nstandard PC.211\n4.1. Overview\nAs mentioned, the value J2 = 1.78 × 10−16 g(cm\/s)Re was used for the comparisons.212\nFirst, the wave-induced pitch angle and energy diffusion were omitted, leaving just radial213\ndiffusion. Results are shown in Fig. 9, and qualitatively reproduce the results of Brautigam214\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 14 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nand Albert [2000]. In particular, fairly good agreement with the measurements (shown in215\nFig. 8) is found for M = 100 and M = 200 MeV\/G, although the dropouts around t = 283216\nare too weak, while the increases for M = 500 and M = 1000 MeV\/G starting around217\nt = 286 are far too weak and transient. As noted by Brautigam and Albert [2000], the218\nresults are essentially driven by transport of the time-dependent values at the outer radial219\nboundary, L = 6.15. As found previously, this is sufficient to account for the observed220\nincreases at lower L for M ≤ 200, but evidently not for M ≥ 500.221\nNext, a simulation was done with diffusion in (α0, E) but omitting radial diffusion. As222\nshown in Fig. 10, this leads to large, widespread, sustained increase in phase space density223\nfor M ≥ 200 – far larger, in fact, than seen in the data, especially at L > 4.5. Finally,224\nallowing diffusion in α0, E, and L to operate leads to intermediate values, as seen in Fig.225\n11. Varotsou et al. [2008] also found this ordering of phase space density values when226\nincluding chorus and radial diffusion separately and together. Figure 11 also shows that227\nthese intermediate values also match the data of Fig. 8 fairly well.228\n4.2. Detailed evolution\nA more detailed comparison is shown in Fig. 12, which shows f(t) from the three229\nsimulations at M = 200 and M = 1000 MeV\/G, at several fixed values of L. Results for230\nM = 100 are similar to those for M = 200, and results for M = 500 are similar to those231\nfor M = 1000. (The corresponding values of E and α0 can be determined from the top232\nrow of Fig. 5.)233\nIn all cases, the dropout around t = 283 is not fully captured, especially at low L234\n(hence high E), presumably because of wave-induced precipitation not represented in the235\nsimulations, such as by hiss (in the plasmasphere and in plumes), electromagnetic ion236\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 15\ncyclotron waves, or possibly by fast magnetosonic waves [Li et al., 2007; Horne et al.,237\n2007; Albert, 2008]. A check verifies that f at M = 1000 does decrease rapidly near the238\ndropout for larger values of J2 (smaller values of α0) in response to lower values at the239\ncorresponding grid boundary, but evidently the pitch angle diffusion rates are too low for240\nthe values shown to change much before the boundary conditions recover. Of course, this241\nis subject to limitations in deriving the boundary conditions from fits to the limited data.242\nOn the other hand, the increases are captured rather well by the combination of radial243\nand chorus diffusion – better than by either mechanism acting alone. The largest discrep-244\nancies are for M = 1000 at L = 4.55 and especially at L = 4.05, where the small values245\n(at the dropout) are far too large, and the large values (late in the simulation) are too246\nsmall by about a factor of 2 or 3. For L ≥ 4.55, the chorus-and-DLL results usually lie247\nbelow the chorus-only values and above the DLL-only values. This was evident in the 2D248\nplots. Thus chorus seems to act as the source of phase space density, while radial diffusion249\nacts mostly to transport it away. However, at L = 4.05 the values from combined chorus250\nand radial diffusion are higher than from either alone, which implies net radial diffusion251\ninto, not away from, L = 4.05.252\nIt is reasonable to question the development of agreement at late time (t ≈ 290) from253\nsubstantial disagreement at earlier times (t ≈ 283). Therefore, the simulations were254\nrepeated starting at t = 283.4, when the measured fluxes are near minimum. The results255\nare shown in Fig. 13, and are generally seen to revert to the same values as the previous256\nrun after a day or two. This indicates that fluxes are determined by transport of the257\ntime-dependent sources at the boundaries more than by existing interior values. Varotsou258\net al. [2008] also found that large differences in initial conditions could lead to relatively259\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 16 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nsimilar states after about a day. This is not surprising, since the timescales associated260\nwith the diffusion coefficients are ∼ 1 day, as shown in Fig. 3. An exception occurs for261\nM = 1000 at L = 4.05 for the chorus-only run, which yields f almost as low as the262\nDLL-only run. Here it is very evident that chorus and DLL do not compete, but instead263\ncooperate, to produce the recovery of phase space density.264\n4.3. Sensitivity to diffusion coefficients\nAs a sensitivity test, the radial and chorus diffusion coefficients were both included but265\nwere doubled and halved, separately and together. Starting the simulation at t = 281.5,266\nthe effects were small for M = 200 MeV\/G (especially at large L) and substantial for267\nM = 1000 MeV\/G, as seen in Fig. 14. Relative to the “standard” run, shown again as268\nthe black curves, increasing DLL (solid blue curve) led to a more realistic, though lagged,269\ndropout around t = 283.4, and lower recovered values of f at late times. Decreasing270\nDchorus (dashed red curve) had a similar effect, while increasing Dchorus (solid red curve)271\nor decreasing DLL (dashed blue curve) tended to have the opposite effect, leading to larger272\nf both at the dropout and later. Doubling or halving the strength of both processes at273\nthe same time (solid and dashed green curves, respectively) tended to produce smaller274\nchanges, suggesting that chorus and radial diffusion compete in determining f . However,275\nthis interpretation is not consistent with the runs starting at t = 283.4, shown in Fig. 15,276\nespecially for low L and large M . Decreasing the strength of either process, or both, led277\nto considerably lower f , again indicating that here chorus and radial diffusion reinforce278\neach other in producing the recovery of f . Also note that in both Figs. 14 and 15, the279\nruns with doubled Dchorus produced excellent agreement with the measured values, except280\nfor the shallowness of the dropout obtained in Fig. 14.281\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 17\n4.4. Radial profiles\nFigs. 16 – 17 show the simulation results as radial profiles, f(L) at fixed M and J2.282\nFig. 16 shows snapshots at several values of t for M = 1000 MeV\/G, from the start of283\nthe simulations at t = 281.5 to the end near t = 291, as well as the CRRES data at284\nthe ending time. The initial profile increases essentially monotonically with increasing L.285\nThe simulation with only radial diffusion develops internal peaks, caused by the varying286\nboundary conditions at the maximum and minimum L, but ends up again monotonic287\nand maximum at the outermost L, in qualitative as well as quantitative disagreement288\nwith the data. The chorus-only simulation produces profiles that remain monotonic or289\nnearly so, as well as becoming too large. This is contrary to what might be expected from290\na localized internal source [Green and Kivelson, 2004]. The combination of chorus and291\nradial diffusion produces robust internal peaks around L = 4.5 that resemble the data,292\nthough they are a bit too low as noted above.293\nFig. 17 shows analogous snapshots of f(L) for several values of M . The curves in294\nthe top row of plots, based on the fit CRRES data, start out monotonically increasing295\nwith increasing L, but quickly develop internal peaks at all M which, for M = 500 and296\nM = 1000 MeV\/G, persist throughout the time interval. The simulations with DLL,297\nwith or without chorus, reproduce this behavior for M = 100 and M = 200 MeV\/G,298\nbut without chorus the simulated peaks at M = 500 and M = 1000 are too short-lived.299\nThe chorus-only run never displays internal peaks. Only the run combining chorus with300\nDLL shows qualitative agreement with the data throughout the run, at both low and high301\nvalues of M .302\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 18 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\n4.5. Effect of cross terms\nFinally, we briefly consider the effect of omitting the cross-diffusion terms, involving303\nDα0p. The placement of grid points in (α0, E) was unchanged, but the coefficient Dα0p304\nwas artificially set to zero, and the numerical procedures (such as tracing constant-Q2305\ncurves, which become constant-E curves) were carried out as before. Fig. 18 shows the306\nratio of f(α0, E) with and without cross diffusion for the chorus-only run starting at307\nt = 283.4, at L = 4.05, t = 285.5. As expected from previous 2D studies with similar308\nchorus models [Albert and Young, 2005; Tao et al., 2008, 2009], the effect is concentrated309\nabove E = 1 MeV and low values of α0, with a peak ratio of about 50, and is modest310\nelsewhere. Fig. 19 shows how this ratio, evaluated at E = 1.8 MeV and α0 = 25\n◦,311\nbehaves with time (dash-dotted red curve). It is initially 1 (since the initial conditions are312\nidentical regardless of cross terms), but quickly grows to a persistent level of about 10.313\nThis case, which simulates the production of ∼ 1 MeV electrons from a depleted state, is314\nrepresentative of how 2D simulations of storm time chorus heating are usually performed.315\nHowever, for the chorus-only run starting at t = 281.5 (red solid curve), the ratio only316\ngrows to about 3. More significantly, the runs with both chorus and radial diffusion also317\nshow a ratio of about 3, starting from either t = 283.4 (dashed black curve) or t = 281.5318\n(solid black curve). Thus, at least for the diffusion models used here, the substantial319\neffect of the cross terms in 2D simulations is considerably reduced in the presence of320\nradial diffusion.321\n5. Summary and Discussion\nIn summary, we have performed a 3D simulation of the October 9, 1990, magnetic322\nstorm accounting for radial diffusion and chorus wave-induced diffusion in pitch angle and323\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 19\nenergy, including cross terms. Grid points were aligned in a natural way for L diffusion324\n(at constant M and J2), while at each L a grid in (Q1, Q2) was constructed for the chorus325\ndiffusion. In the spirit of Brautigam and Albert [2000], CRRES\/MEA particle data has326\nbeen used to obtain realistic, time-dependent boundary conditions, which are transported327\nthroughout the computational domain using activity-dependent diffusion coefficients. The328\nresulting agreement with data is reasonably good, especially when chorus diffusion is329\nincreased by a factor of 2, except for the depth of the main phase dropout. However, this330\neffect of this deficiency is short-lived, since runs initialized before and immediately after331\nthe dropout quickly converge to each other. (The beneficial factor of 2 for Dchorus should332\nnot be taken too literally, given the uncertainties in the wave models.)333\nExperimentation shows that the 3D combination of DLL and chorus is essential, and334\nthat either process alone does not give even rough quantitative agreement with the per-335\nsistent internal peaks seen in the data. Such phase space density peaks are a common336\nfeature seen during magnetic storms [e.g., Green and Kivelson, 2004; Iles et al., 2006;337\nChen et al., 2007]. Furthermore, the combination of the two processes is complex, since338\nchorus can cause either increase phase space density through energy diffusion or decrease339\nit by pitch angle diffusion, and radial diffusion can act to either increase or decrease f340\ndepending on gradients. Thus simple interpretations based on ‘competition,’ or indeed341\n‘cooperation,’ can be misleading. The three-dimensional simulations presented here sup-342\nport the paradigm of inward radial diffusion of lower-energy “seed” electrons which are343\nenergized by chorus waves, and then radially diffused both inward and outward, resulting344\nin the observed internal peaks [Horne, 2007].345\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 20 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nAs indicated, the reasonable success in reproducing the CRRES data for this storm346\ndepended on having boundary values on all six of the grid boundaries, which raises the347\nquestion of practicality for space weather forecasting. While it is not unreasonable to348\npresume the availability of data at all needed values of (α0, E) at Lmin and Lmax, one349\ncannot count on having a time series measurements at, say, all (α0, L) at fixed Emin.350\nHowever, these may be supplied by a ring current code, which almost by definition aims351\nto simulate particles up to lower radiation belt energies.352\nThese results support the effectiveness of simulating chorus-electron interactions by353\nquasi-linear diffusion, despite the increasingly-appreciated nonlinear nature of chorus354\nwaves. More work is therefore needed not only to develop quasi-linear modeling, but355\nto understand why it seems to work as well as it does.356\nReferences\nAlbert, J. M. (2000), Gyroresonant interactions of radiation belt particles357\nwith a monochromatic electromagnetic wave, J. Geophys. Res., 105, 21,191,358\ndoi:10.1029\/2000JA000008.359\nAlbert, J. M. (2002), Nonlinear interaction of outer zone electrons with VLF waves,360\nGeophys. Res. Lett., 29, 1275, doi:10.1029\/2001GL013941.361\nAlbert, J. M. (2004), Using quasi-linear diffusion to model acceleration and loss from362\nwave-particle interactions, Space Weather, 2, S09S03, doi:10.1029\/2004SW000069.363\nAlbert, J. M. (2005), Evaluation of quasi-linear diffusion coefficients for whistler mode364\nwaves in a plasma with arbitrary density ratio, J. Geophys. Res., 110, A03218,365\ndoi:10.1029\/2004JA010844.366\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 21\nAlbert, J. M. (2008), Efficient approximations of quasi-linear diffusion coefficients in the367\nradiation belts, J. Geophys. Res., 113, A06208, doi:10.1029\/2007JA012936.368\nAlbert, J. M. (2009), The coupling of pitch angle and energy diffusion, J. Atmos. Sol.369\nTerr. Phys., doi:10.1016\/j.jastp.2008.11.014, in press.370\nAlbert, J. M., and S. L. Young (2005), Multidimensional quasi-linear diffusion of radiation371\nbelt electrons, Geophys. Res. Lett., 32, L14110, doi: 10.1029\/2005GL023191.372\nBortnik, J., R. M. Thorne, and U. S. Inan (2008), Nonlinear interaction of ener-373\ngetic electrons with large amplitude chorus, Geophys. Res. Lett., 35, L21102, doi:374\n10.1029\/2008GL035500.375\nBoscher, D., S. Bourdarie, P. O’Brien, and T. Guild (2004-2008), ONERA-DESP libray376\nV4.2, Toulouse, France.377\nBrautigam, D. H. and J. M. Albert (2000), Radial diffusion analysis of outer radiation378\nbelt electrons during the October 9, 1990, magnetic storm, J. Geophys. Res., 105, 291,379\ndoi:10.1029\/1999JA900344.380\nChen, Y., G. D. Reeves, and R. H. W. Friedel (2007), The energization of relativistic381\nelectrons in the outer Van Allen radiation belt, Nature Physics, 3, 614.382\nDemekhov, A. G., V. Y. Trakhtengerts, M. J. Rycroft, and D. Nunn (2006), Electron ac-383\nceleration in the magnetosphere by whistler-mode waves of varying frequency, Geomag.384\nAeron. 46, 711, doi:10.1134\/S0016793206060053.385\nFei, Y., A. A. Chan, S. R. Elkington, and M. J. Wiltberger (2006), Radial diffusion386\nand MHD particle simulation of relativistic electron transport by ULF waves in the387\nSeptember 1998 storm, J. Geophys. Res., 111, A12209, doi:10.1029\/2005JA011211.388\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 22 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nFok, M.-C., R. B. Horne, N. P. Meredith, and S. A. Glauert (2008), Radiation Belt389\nEnvironment model: Application to space weather nowcasting, J. Geophys. Res., 113,390\nA03S08, doi:10.1029\/2007JA012558.391\nGlauert, S. A., and R. B. Horne (2005), Calculation of pitch angle and energy diffusion392\ncoefficients with the PADIE code, J. Geophys. Res., 110, A, doi:10.1029\/2004JA010851.393\nGreen, J. C., and M. G. Kivelson (2004), Relativistic electrons in the outer radiation394\nbelt: Differentiating between acceleration mechanisms, J. Geophys. Res., 109, A03213,395\ndoi:10.1029\/2003JA010153.396\nHorne, R. B., and R. M. Thorne (1998), Potential waves for relativistic electron scattering397\nand stochastic acceleration during magnetic storms, Geophys. Res. Lett., 25, 3011-3014,398\ndoi:10.1029\/98GL01002.399\nHorne, R. B., and R. M. Thorne (2003), Relativistic electron acceleration and precipitation400\nduring resonant interactions with whistler-mode chorus, Geophys. Res. Lett., 30, 1527,401\ndoi:10.1029\/2003GL016973.402\nHorne, R. B., N. P. Meredith, R. M. Thorne, D. Heynderickx, R. H. A. Iles, and R. R.403\nAnderson (2003), Evolution of energetic electron pitch angle distributions during storm404\ntime electron acceleration to megaelectronvolt energies, J. Geophys. Res., 108, 1016,405\ndoi:10.1029\/2001JA009165.406\nHorne, R. B., R. M. Thorne, S. A. Glauert, J. M. Albert, N. P. Meredith, and R. R.407\nAnderson (2005a), Timescale for radiation belt electron acceleration by whistler mode408\nchorus waves, J. Geophys. Res., 110, A03225, doi:10.1029\/2004JA010811.409\nHorne, R. B., R. M. Thorne, Y. Y. Shprits, N. P. Meredith, S. A. Glauert, A. J. Smith,410\nS. G. Kanekal, D. N. Baker, M. J. Engebretson, J. L. Posch, M. Spasojevic, U. S. Inan,411\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 23\nJ. S. Pickett, and P. M. E. Decreau (2005b), Wave acceleration of electrons in the Van412\nAllen radiation belts, Nature, 437, 227, doi:10.1038\/nature03939.413\nHorne, R. B. (2007), Plasma astrophysics: Acceleration of killer electrons, Nature Physics,414\n3, 590.415\nHorne, R. B., R. M. Thorne, S. A. Glauert, N. P. Meredith, D. Pokhotelov, and O. Santolik416\n(2007), Electron acceleration in the Van Allen radiation belts by fast magnetosonic417\nwaves, Geophys. Res. Lett., 34, L17107, doi:10.1029\/2007GL030267.418\nIles, R. H. A., N. P. Meredith, A. N. Fazakerley, and R. B. Horne (2006), Phase space419\ndensity analysis of the outer radiation belt energetic electron dynamics, J. Geophys.420\nRes., 111, A03204, doi:10.1029\/2005JA011206.421\nJordanova, V. J., J. M. Albert, and Y. Miyoshi (2008), Relativistic electron precipitation422\nby EMIC waves from self-consistent global simulations, J. Geophys. Res., 113, A00A10,423\ndoi:10.1029\/2008JA013239.424\nKatoh, Y., and Y. Omura (2007a), Computer simulation of chorus wave gen-425\neration in the Earth’s inner magnetosphere, Geophys. Res. Lett., 34, L03102,426\ndoi:10.1029\/2006GL028594.427\nKatoh, Y., and Y. Omura (2007b), Relativistic particle acceleration in the pro-428\ncess of whistler-mode chorus wave generation, Geophys. Res. Lett., 34, L13102,429\ndoi:10.1029\/2007GL029758.430\nLam, M. M., R. B. Horne, N. P. Meredith, and S. A. Glauert (2007), Modeling the effects431\nof radial diffusion and plasmaspheric hiss on outer radiation belt electrons, Geophys.432\nRes. Lett., 34, L20112, doi:10.1029\/2007GL031598.433\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 24 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nLemaire, J., D. Heynderickx, M. Kruglanski, A. D. Johnstone, D. J. Rodgers, S. Szita, G.434\nJones, E. Keppler, R. Friedel, and G. Loidl (1998), TREND-3 Radiation Environments435\nof Astronomy Missions and LEO Missions, Final Report.436\nLi, W., Y. Y. Shprits, and R. M. Thorne (2007), Dynamic evolution of energetic outer437\nzone electrons due to wave-particle interactions during storms, J. Geophys. Res., 112,438\nA10220, doi:10.1029\/2007JA012368.439\nLyons, L. R., R. M. Thorne, and C. F. Kennel (1972), Pitch-angle diffusion of440\nradiation belt electrons within the plasmasphere, J. Geophys. Res., 77, 3455,441\ndoi:10.1029\/JA077i019p03455.442\nMeredith N. P., R. B. Horne, R. H. A. Iles, R. M. Thorne, R. R. Anderson, and D. Heyn-443\nderickx (2002), Outer zone relativistic electron acceleration associated with substorm-444\nenhanced whistler mode chorus, J. Geophys. Res., 107, 1144, 10.1029\/2001JA900146.445\nMeredith, N. P., M. Cain, R. B. Horne, R. M. Thorne, D. Summers, and R. R. An-446\nderson (2003a), Evidence for chorus-driven electron acceleration to relativistic ener-447\ngies from a survey of geomagnetically-disturbed periods, J. Geophys. Res., 108, 1248,448\ndoi:10.1029\/2002JA009764.449\nMeredith, N. P., R. B. Horne, R. M. Thorne, and R. R. Anderson (2003b), Favored450\nregions for chorus-driven electron acceleration to relativistic energies in the Earth’s451\nouter radiation belt (2003b), Geophys. Res. Lett., 30, 1871, doi:10.1029\/2003GL017698.452\nNunn, D. (1974), A self-consistent theory of triggered VLF emissions, Planet. Space Sci.453\n22(22), 349.454\nNunn, D., Y. Omura, H. Matsumoto, I. Nagano, and S. Yagitani (1997), The numerical455\nsimulation of VLF chorus and discrete emissions observed on the Geotail satellite using456\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 25\na Vlasov code, J. Geophys. Res., 102, 27,083, doi:10.1029\/97JA02518.457\nOmura, Y., and D. Summers (2006), Dynamics of high-energy electrons interacting458\nwith whistler mode chorus in the magnetosphere, J. Geophys. Res., 111, A09222,459\ndoi:10.1029\/2006JA011600.460\nRoederer, J. G. (1970), Dynamics of Geomagnetically Trapped Radiation, Springer-Verlag,461\nNew York.462\nSchulz, M. (1991), The magnetosphere, in Geomagnetism, vol. 4, edited by J. A. Jacobs,463\npp. 87-293, Academic, San Diego, Calif.464\nShprits, Y. Y., and R. M. Thorne (2004), Time dependent radial diffusion model-465\ning of relativistic electrons with realistic loss rates, Geophys. Res. Lett., 31, L08805,466\ndoi:10.1029\/2004GL019591.467\nShprits, Y. Y., R. M. Thorne, G. D. Reeves, and R. Friedel (2005), Radial diffusion mod-468\neling with empirical lifetimes: comparison with CRRES observations, Ann. Geophys.,469\n23, 1467.470\nShprits, Y. Y., R. M. Thorne, R. B. Horne, S. A. Glauert, M. Cartwright, C. T. Russell,471\nD. N. Baker, and S. G. Kanekal (2006a), Acceleration mechanism responsible for the472\nformation of the new radiation belt during the 2004 Halloween solar storm, Geophys.473\nRes. Lett., 33, L05104, doi:10.1029\/2005GL024256.474\nShprits, Y. Y., R. M. Thorne, R. Friedel, G. D. Reeves, J. Fennell, D. N. Baker, and S. G.475\nKanekal (2006b), Radial diffusion driven by losses at magnetopause, J. Geophys. Res.,476\n111, A11214, doi:10.1029\/2006JA011657.477\nShprits, Y., D. Kondrashov, Y. Chen, R. Thorne, M. Ghil, R. Friedel, and G. Reeves478\n(2007), Reanalysis of relativistic radiation belt electron fluxes using CRRES satellite479\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 26 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\ndata, a radial diffusion model, and a Kalman filter, J. Geophys. Res., 112, A12216,480\ndoi:10.1029\/2007JA012579.481\nSmith, A. J., N. P. Meredith, and T. P. O’Brien (2004), Differences in ground-chorus for482\ngeomagnetic storms with and without enhanced relativistic electron fluxes, J. Geophys.483\nRes., 109, 11,204, doi:10.1029\/2004JA010491.484\nSubbotin, D., Y. Shprits, M. Gkioulidou, S. Merkin, F. Toffoletto, R. Thorne, C. Wang,485\nand L. Lyons (2008), RCM-VERB Coupled simulations of the dynamics of radiation486\nbelts during storms, Eos Trans. AGU, 89(53), Fall Meet. Suppl., Abstract SM21A-1651.487\nSummers, D., R. M. Thorne, and F. Xiao (1998), Relativistic theory of wave-particle488\nresonant diffusion with application to electron acceleration in the magnetosphere, J.489\nGeophys. Res., 103, 20,487, doi:10.1029\/98JA01740.490\nSummers, D., and C. Ma (2000), A model for generating relativistic electrons in the491\nEarth’s magnetosphere based on gyroresonant wave-particle interactions, J. Geophys.492\nRes., 105, 2625, doi:10.1029\/1999JA900444.493\nSummers, D., C. Ma, N. P. Meredith, R. B. Horne, R. M. Thorne, D. Heynderickx, and R.494\nR. Anderson (2002), Model of the energization of outer-zone electrons by whistler-mode495\nchorus during the Ovtober 9, 1990 geomagnetic storm, Geophys. Res. Lett., 29, 2174,496\ndoi:10.1029\/2002GL016039.497\nTao X., A. A. Chan, J. M. Albert, and J. A. Miller (2008), Stochastic modeling of498\nmultidimensional diffusion in the radiation belts, J. Geophys. Res., 113, A07212,499\ndoi:10.1029\/2007JA012985.500\nTao X., J. M. Albert, and A. A. Chan (2009), Numerical modeling of multidimensional501\ndiffusion in the radiation belts using layer methods, J. Geophys. Res., 114, A02215,502\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 27\ndoi:10.1029\/2008JA013826.503\nThorne, R. M., Y. Y. Shprits, N. P. Meredith, R. B. Horne, W. Li, and L. Lyons (2007),504\nRefilling of the slot region between the inner and outer electron radiation belts during505\ngeomagnetic storms, J. Geophys. Res., 112, A06203, doi:10.1029\/2006JA012176.506\nTrakhtengerts, V. Y., M. J. Rycroft, D. Nunn, and A. G. Demekhov (2003), Cyclotron507\nacceleration of radiation belt electrons by whistlers, J. Geophys. Res., 108, 1138,508\ndoi:10.1029\/2002JA009559.509\nTu, W., X. Li, Y. Chen, G. D. Reeves, and M. Temerin (2009), Storm-dependent radiation510\nbelt electron dynamics, J. Geophys. Res., 114, A02217, doi:10.1029\/2008JA013480.511\nVampola, A. L. (1996), Outer zone energetic electron environment update, in Final Report512\nof ESA\/ESTEC\/WMA\/P.O. 151351.513\nVarotsou A., D. Boscher, S. Bourdarie, R. B. Horne, S. A. Glauert, and N. P. Meredith514\n(2005), Simulation of the outer radiation belt electrons near geosynchronous orbit in-515\ncluding both radial diffusion and resonant interaction with whistler-mode chorus waves,516\nGeophys. Res. Lett., 32, L19106, doi:10.1029\/2007GL023282.517\nVarotsou A., D. Boscher, S. Bourdarie, R. B. Horne, N. P. Meredith, S. A. Glauert, and518\nR. H. Friedel (2008), Three-dimensional test simulations of the outer radiation belt519\nelectron dynamics including electron-chorus resonant interactions, J. Geophys. Res.,520\n113, A12212, doi:10.1029\/2007JA012862.521\nXiao, F., Z. Su, H. Zheng, and S. Wang (2009), Modeling of outer radiation belt522\nelectrons by multi-dimensional diffusion process, J. Geophys. Res., 114, A03201,523\ndoi:10.1029\/2008JA013580.524\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 28 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nFigure 1. Models of the chorus wave magnetic field intensity, based on CRRES measurements,\nused to calculate pitch angle and energy diffusion coefficients for different ranges of Kp.\nFigure 2. Models of equatorial fpe\/fce, based on CRRES measurements, used to calculate\npitch angle and energy diffusion coefficients for different ranges of Kp.\nFigure 3. Diffusion coefficients at L = 4.55, in units of day−1. The sign of Dα0p is indicated\nby σ (red for positive, blue for negative). DLL is evaluated at Kp = 1, Kp = 3, and Kp = 5.\nFigure 4. The 3D computational grid, in (α0, E, L) space.\nFigure 5. Computational grid points in 2D for Kp < 2, expressed in several sets of variables.\nThe red points are in the range of the CRRES MEA detector. The blue curves indicate several\nvalues of first adiabatic invariant M , in MeV\/G. The green curves indicate the reference value\nJ2 = 1.78× 10−16 g(cm\/s)Re.\nFigure 6. Electron flux as measured by CRRES\/MEA, in units of #\/cm2-s-ster-MeV, as well\nas Dst and Kp.\nFigure 7. CRRES MEA electron flux, interpolated and extrapolated to cover the computa-\ntional grid.\nFigure 8. CRRES MEA electron flux, interpolated, extrapolated, and converted to phase\nspace density f .\nFigure 9. Phase space density, simulated with radial diffusion only.\nFigure 10. Phase space density, simulated with chorus diffusion only.\nFigure 11. Phase space density, simulated with both radial diffusion and chorus diffusion.\nFigure 12. Phase space density, in units of s3\/km6, as determined from CRRES data (black\ndiamonds), and simulations starting at t = 281.5, with DLL only (blue curves), with chorus only\n(red curves), and with both (black curves).\nD R A F T June 10, 2009, 1:29pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 29\nFigure 13. Phase space density, in units of s3\/km6, as determined from CRRES data (black\ndiamonds), and simulations starting at t = 283.4, with DLL only (blue curves), with chorus only\n(red curves), and with both (black curves).\nFigure 14. Phase space density as determined from CRRES data (black diamonds) and\nsimulations starting at t = 281.5, with both DLL and chorus (black curves), with DLL doubled\n(solid blue curves) and halved (dash-dotted blue curves), Dchorus doubled (solid red curves) and\nhalved (dash-dotted red curves), and with both doubled (solid green curves) and halved (dash-\ndotted green curves).\nFigure 15. Phase space density as determined from CRRES data (black diamonds) and\nsimulations as in Fig. 14, starting at t = 283.4.\nFigure 16. Snapshots of phase space density vs. L at various values of t for M = 1000 MeV\/G,\nsimulated with DLL only, Dchorus only, and both. CRRES data at the end of the simulation is\nshown as red diamonds in all three plots.\nFigure 17. Snapshots of phase space density vs. L at various values of t, determined from\nCRRES data (top row), and simulated with DLL only (second row), Dchorus only (third row), and\nboth (bottom row).\nFigure 18. Ratio of simulated f without cross diffusion to f with cross diffusion, at L = 4.05,\nt = 285.5, for the chorus-only run starting at t = 283.4.\nD R A F T June 10, 2009, 1:29pm D R A F T\nX - 30 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nFigure 19. Ratio of simulated f without cross diffusion to f with cross diffusion, at L = 4.05,\nwith chorus only (red) curves and with both DLL and chorus (black curves), starting at t = 281.5\n(solid curves) and at t = 283.4 (dash-dotted curves).\nD R A F T June 9, 2009, 6:17pm D R A F T\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 31\nFigure 1. Models of the chorus wave magnetic field\nintensity, based on CRRES measurements, used to cal-\nculate pitch angle and energy diffusion coefficients for\ndifferent ranges of Kp.\nFigure 2. Models of equatorial fpe\/fce, based on CR-\nRES measurements, used to calculate pitch angle and\nenergy diffusion coefficients for different ranges of Kp.\nX - 32 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nFigure 3. Diffusion coefficients at L = 4.55, in units\nof day−1. The sign of Dα0p is indicated by σ (red for\npositive, blue for negative). DLL is evaluated at Kp = 1,\nKp = 3, and Kp = 5.\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 33\nFigure 4. The 3D computational grid, in (α0, E, L) space.\nX - 34 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nFigure 5. Computational grid points in 2D for Kp < 2,\nexpressed in several sets of variables. The red points are\nin the range of the CRRES MEA detector. The blue\ncurves indicate several values of first adiabatic invariant\nM , in MeV\/G. The green curves indicate the reference\nvalue J2 = 1.78× 10−16 g(cm\/s)Re.\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 35\nFigure 6. Electron flux as measured by CRRES\/MEA, in units of #\/cm2-s-ster-MeV, as well as Dst and Kp.\nX - 36 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nFigure 7. CRRES MEA electron flux, interpolated and extrapolated to cover the computational grid.\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 37\nFigure 8. CRRES MEA electron flux, interpolated, extrapolated, and converted to phase space density f .\nX - 38 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nFigure 9. Phase space density, simulated with radial diffusion only.\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 39\nFigure 10. Phase space density, simulated with chorus diffusion only.\nX - 40 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nFigure 11. Phase space density, simulated with both radial diffusion and chorus diffusion.\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 41\nFigure 12. Phase space density, in units of s3\/km6,\nas determined from CRRES data (black diamonds), and\nsimulations starting at t = 281.5, with DLL only (blue\ncurves), with chorus only (red curves), and with both\n(black curves).\nX - 42 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nFigure 13. Phase space density, in units of s3\/km6,\nas determined from CRRES data (black diamonds), and\nsimulations starting at t = 283.4, with DLL only (blue\ncurves), with chorus only (red curves), and with both\n(black curves).\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 43\nFigure 14. Phase space density as determined from\nCRRES data (black diamonds) and simulations starting\nat t = 281.5, with both DLL and chorus (black curves),\nwith DLL doubled (solid blue curves) and halved (dash-\ndotted blue curves), Dchorus doubled (solid red curves)\nand halved (dash-dotted red curves), and with both dou-\nbled (solid green curves) and halved (dash-dotted green\ncurves).\nX - 44 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nFigure 15. Phase space density as determined from\nCRRES data (black diamonds) and simulations as in Fig.\n14, starting at t = 283.4.\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 45\nFigure 16. Snapshots of phase space density vs. L at\nvarious values of t for M = 1000 MeV\/G, simulated with\nDLL only, Dchorus only, and both. CRRES data at the\nend of the simulation is shown as red diamonds in all\nthree plots.\nX - 46 ALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION\nFigure 17. Snapshots of phase space density vs. L at\nvarious values of t, determined from CRRES data (top\nrow), and simulated with DLL only (second row), Dchorus\nonly (third row), and both (bottom row).\nALBERT ET AL.: THREE-DIMENSIONAL DIFFUSION SIMULATION X - 47\nFigure 18. Ratio of simulated f without cross diffusion\nto f with cross diffusion, at L = 4.05, t = 285.5, for the\nchorus-only run starting at t = 283.4.\nFigure 19. Ratio of simulated f without cross diffu-\nsion to f with cross diffusion, at L = 4.05, with cho-\nrus only (red) curves and with both DLL and chorus\n(black curves), starting at t = 281.5 (solid curves) and at\nt = 283.4 (dash-dotted curves).\n"}