{"doi":"10.1016\/j.ins.2011.03.020","coreId":"140386","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5744","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5744","10.1016\/j.ins.2011.03.020"],"title":"Modelling collaboration using complex networks","authors":["Durugbo, Christopher","Hutabarat, Windo","Tiwari, Ashutosh","Alcock, Jeffrey R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-08-01T00:00:00Z","abstract":"Collaboration means working together to achieve a common goal or to solve a\nproblem, and in modern businesses, it is an important factor for information\nsharing and quality. This is due to the ability of collaborations to shape the\nstructure and behaviour of organisations through the pooling of expertise and\nstandardising of work patterns. Grounded on complex network theory and\ncollaborative design research, a mathematical model of information flow for\nanalysing collaboration in organisations is proposed in this article. The model\ndefines concepts for characterising organisational structures for collaboration\nand proposes indicators for assessing organisational behaviour in terms of\ncollaboration within organisations. The article concludes by discussing the\napplications and limitations of the proposed model","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140386.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.ins.2011.03.020","pdfHashValue":"46f285a58b5d91b659a5fbf45a495d74150faac5","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5744<\/identifier><datestamp>2012-10-23T08:31:59Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Modelling collaboration using complex networks<\/dc:title><dc:creator>Durugbo, Christopher<\/dc:creator><dc:creator>Hutabarat, Windo<\/dc:creator><dc:creator>Tiwari, Ashutosh<\/dc:creator><dc:creator>Alcock, Jeffrey R.<\/dc:creator><dc:description>Collaboration means working together to achieve a common goal or to solve a\nproblem, and in modern businesses, it is an important factor for information\nsharing and quality. This is due to the ability of collaborations to shape the\nstructure and behaviour of organisations through the pooling of expertise and\nstandardising of work patterns. Grounded on complex network theory and\ncollaborative design research, a mathematical model of information flow for\nanalysing collaboration in organisations is proposed in this article. The model\ndefines concepts for characterising organisational structures for collaboration\nand proposes indicators for assessing organisational behaviour in terms of\ncollaboration within organisations. The article concludes by discussing the\napplications and limitations of the proposed model.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2012-08-04T23:01:20Z<\/dc:date><dc:date>2012-08-04T23:01:20Z<\/dc:date><dc:date>2011-08-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Christopher Durugbo, Windo Hutabarat, Ashutosh Tiwari and Jeffrey R. Alcock. Modelling collaboration using complex networks. Information Sciences,Volume 181, Issue 15, 1 August 2011, Pages 3143-3161<\/dc:identifier><dc:identifier>0020-0255<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.ins.2011.03.020<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5744<\/dc:identifier><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0020-0255","0020-0255"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2011,"topics":[],"subject":["Article"],"fullText":"1 \n \nModelling Collaboration using Complex Networks \n \nChristopher Durugbo*, Windo Hutabarat, Ashutosh Tiwari and Jeffrey R. Alcock \n \nSchool of Applied Sciences,  \nCranfield University,  \nBedfordshire,  \nMK43 0AL \nUnited Kingdom \n \nCorresponding author email: c.durugbo@cranfield.ac.uk  \nTelephone: +44 (0) 1234 750 111 Ext 5656 \n \n  \n2 \n \nModelling Collaboration using Complex Networks \n \nAbstract: Collaboration means working together to achieve a common goal or to solve a \nproblem, and in modern businesses, it is an important factor for information sharing and \nquality. This is due to the ability of collaborations to shape the structure and behaviour of \norganisations through the pooling of expertise and standardising of work patterns.  \nGrounded on complex network theory and collaborative design research, a mathematical \nmodel of information flow for analysing collaboration in organisations is proposed in this \narticle. The model defines concepts for characterising organisational structures for \ncollaboration and proposes indicators for assessing organisational behaviour in terms of \ncollaboration within organisations. The article concludes by discussing the applications and \nlimitations of the proposed model. \n \nKeywords: Network analysis; Conceptual modelling; Social networks; Information flows; \nOrganisational design \n \n \n  \n3 \n \n1. INTRODUCTION  \n \n1.1. Research background \nComplex networks in scientific research have proven to be useful paradigms\/disciplines for \ndelineating organisations. This is due to on-going studies and renewed interests in \norganisational\/network theory that are driven by the proliferation of web-based systems and \ntechnologies such as: e-mail, peer-to-peer and grid computing, video-conferencing and \nmobile\/broadband connectivity [2, 11, 45, 52]. Consequently, complex network concepts \nhave been used to analyse organisational characteristics such as hierarchies [3, 26] and \ndecision making [14].   \nCollaboration, although not a new organisational characteristic, has become a critical factor \nthat determines the success of businesses (profit-driven organisations) [4]. It means working \ntogether in group(s) to achieve a common task or goal [4, 27, 44] and irrespective of \ngeographical separation [2, 20, 49]. This task or goal is often beyond the capabilities of the \nparticipants involved in the collaboration. Within collaborations, participants closely work \ntogether based on durable relationships and strong commitments to a common goal with a \nview to pooling expertise and standardising operations [24, 45]. \n \n1.2. Aim of paper \nIn this article, collaboration is analysed in organisations as complex networks. The aim of this \narticle is to propose a mathematical model that analyses how individuals in organisations \nwork together to solve a problem or achieve a common goal. In order to accomplish this, the \narticle will identify existing research that study organisations as complex networks, analyse \ncharacteristics of collaboration and propose modelling concepts for assessing the level of \ncollaboration in organisations.    \n \n1.3. Organisations as complex networks \nA complex network can be described as a graph G = (V, E) containing a set of vertices V \n(called nodes or points) that are associated by edges E (called links or lines) [5] as shown in \nFig. 1. The vertices represent entities within a network whereas edges indicate interactions \nbased on relationships in which the entire graph is connected (i.e. for a vertex i in the graph, \nthere is a path made up of edges to another vertex j) or disconnected. A complex network can \ncontain a subgraph (G') = (V', E') – a subset of G where V' and E’ are subsets of V and E \nrespectively. In Fig. 1, subgraphs can be created between sets of vertices (A, B, C, D), (A, D, \nG), (B, C, D, F) and so on. \nVertices, edges and topology (that depicts how vertices and edges are arranged) are the main \nconcepts used to characterise information structures for analysing domains such as the World \nWide Web, social networks, brain networks and genetic networks [5, 33]. \nThe mindset of ‘an organisation as a network’ is widely considered in research as a useful \napproach for promoting organisational flexibility and adaptability, particularly in the quality \nand sharing of information [34]. It is for this reason that complex networks can offer useful \ninsights into how people work together based on media choice (depending on the context and \nneeds of information flow), and communication media that influence information sharing [16, \n17, 37, 31]. \n4 \n \nWithin complex network research, social network analysis (SNA) is the main approach \nadopted by researchers to study and understand relationships, social roles and social structure \nin organisations [2, 5, 18, 19, 38, 47, 50]. Examples of the use of SNA in characterising \norganisations include friendship networks for informal interactions and friendships [12, 32] \nand hierarchical networks for filling administrative layers [3, 26]. \nWhilst the concept of organisations as networks is viewed by some social network \nresearchers as a ‘counter-model’ to the bureaucratic organisation [2, 34, 36], other authors \nhave argued and shown how organisations, at least for administrative purposes, can be \nanalysed as hierarchical networks [3, 26].  \nSNA is often associated with organisation theory [29] and is used to identify clear patterns of \nrelations and involvement (centralized and decentralized) based on gathered data such as the \nage, gender, and race of actors [2, 18, 29]. It makes use of techniques from sociology and \nmathematics for the representation and quantification of an organisation’s information \nstructure [19, 29]. Although networks can be represented as a matrix or a graph, most \nresearchers prefer graph representations in which vertices represent actors within networks, \nand edges indicate the relationships between the actors with a view to improving processes \nand performances [33, 42]. However, the use of the term ‘actor’ is open to the interpretation \nof researchers. For instance, Pryke and Pearson [36] used the term actor to represent a ‘role-\nholding firm’ whereas Van Der Aalst et al. [43] applied the term actor as individuals within \nan organisation.   \nQuantitatively, SNA is based on sociocentric (whole) approaches in which groups and group \ninteractions are studied, and egocentric (personal) approaches in which an individual and an \nindividual’s interaction is assessed [9, 18, 42]. Sociocentric and egocentric approaches are \nprimarily studied through cohesion and centrality respectively for characterising the \ninformation behaviour of social networks [19, 38]. \nCohesion is a network attribute that characterises the structural interconnectedness of two \nvertices i and j in a network and is assessed in terms of: distance between vertices computed \nas the sum of edges along the shortest path between i and j, reachability between vertices that \nestablishes if i and j are linked directly or indirectly, and density between i and j that \ncompares number of actual edges to the number of possible edges. Centrality is a network \nattribute that characterises the structural prominence or importance of a vertex i within a \nnetwork and is evaluated with regards to: degree centrality that is computed as the number of \ndirectly connected vertices to i, closeness centrality that is measured as the inverse of the \ndistance between i and network vertices, and betweenness centrality that is calculated as the \namount of times i connects other vertices to each other. These quantitative concepts offer a \nuseful avenue for giving exact meanings and mathematical definitions for terms that \nordinarily can only be described metaphorically using phrases such as ‘social role’ and \n‘prominence’ [29]. \n \n1.4. Research motivation and focus \nRenewed research interest in collaboration for organisations is motivated by the awareness \nthat modern day business are increasingly becoming dependent on cumulative knowledge of \nkey stakeholders such as customers and staff, for maintaining firm competitiveness and \ninformation sharing [2, 11, 13, 18, 22, 39, 47, 48]. Collaboration studies in recent years has \n5 \n \nalso been motivated by increasing informal interactions that causes companies to adopt flatter \nand flexible structures [4, 11] and the need to explore and integrate differences of team \nmembers and groups within an organisation [11, 40]. These differences stem from pre-\nexisting work patterns and expectations of quality and success from collaborating groups and \nindividuals. For this reason, collaboration is conceptually designed based on the use of agent- \nor web-based systems [39, 45]. Web based systems make use of a client\/server architecture \nwhereas agent based systems involve networks of problem solvers working together to solve \nproblems that are beyond their individual capabilities.  \nWithin the context of social network analysis, collaboration theory has so far centred on \nintra- and inter-organisational collaboration i.e. within and between organisations [11, 18, 22, \n25, 28]. For instance, Cross et al. [11], in a study of 40 informal networks within 23 \norganisations, studied how collaboration can exist across functional and hierarchical \ndimensions, and concluded that informal networks are an important avenue for enabling \ncollaboration within an organisation. Focusing on inter-organisational relationships, White \n[46] formulated the idea of collaborative advantage for synergies that emanate from \ncollaborative activities and collaborative inertia related to the outcome that determines \ncollaboration progress or advantage. Other forms of research for inter-organisational \ncollaboration include: scientific collaboration networks [32] formed as a result of connecting \npapers that are co-authored by two or more scientists at different institutions and \ntransorganisation development for improving collaboration between partner organisations [9], \nand inter-organisational relationships that assesses the level and performance of partnerships \nbetween organisations [22, 25].  \nWith the exception of few studies such as Chinowsky et al. [8], Cross et al. [11] and White \n[46] that base collaboration on a subjective assessment of actors, literature suggests an \nabsence of quantitative indicators for assessing collaboration. Rather studies within SNA \nhave examined or proposed models that directly or indirectly influence the level of \ncollaboration within an organisation [2, 17-19, 22, 25, 29, 34, 36, 42, 43, 46]. However, \nproviding quantitative indicators for complex networks offers potentials for guiding \nresearchers and industrial practitioners in monitoring the evolution of the organisational \ncharacteristics at intra-organisational (individual or group) and inter-organisational levels \n[17]. Table 1 summaries some of the related literature on modelling collaboration using social \nnetwork analysis. \nThe focus of this paper is to make use of complex network concepts to: (i) define topologies, \nvertices and edges for the information structure of intra-organisational collaboration and (ii) \npropose quantitative indicators for the information behaviour that can be used to characterise \ncollaboration in organisations. Key collaboration characteristics will be derived from \ncollaborative research literature and used to propose concepts for analysing collaboration in \norganisations. Using a case scenario from literature, the applications and limitations of the \nproposed concepts will then be highlighted and discussed.  \nThe paper plans to contribute to knowledge by: (i) proposing a model of information flow for \nanalysing collaborations in organisations and (ii) demonstrating the use of the model in a case \nscenario. \n \n \n6 \n \n1.5. Structure of paper \nThe remainder of the paper is organised as follows: §2 describes the research method, §3 \nintroduces the concepts for a mathematical model that can be used to analyse collaboration in \norganisations and a case scenario that demonstrates the use of the model whereas §4 \ndiscusses some applications and limitations of the proposed model. \n \n \n2. RESEARCH METHOD \n An analytical, applied research methodology [23] was adopted for this research. The \nresearch began analytically to capture and evaluate the characteristics of collaboration, and \nthe information used during this evaluation was derived from a review of literature. Using the \ncollaboration characteristics as a set of criteria, the current state of social network analysis \nresearch was evaluated and the identified gaps were then identified as ‘modelling goals’ for \nproposing the mathematical model.  \nThe analytical, applied approach adopted in this paper is typical of model development \napproaches such as López et al. [26] that proposed the coordination degree model for \nhierarchical networks and Ehsani et al. [14] that proposed decision networks. In these \napproaches, researchers have extended or formulated new aspects of existing network \nmodels. \nDriven by the adopted research methodology, the mathematical model development was \ncarried out in four main stages: characteristics identification, social network analysis \nevaluation, model conceptualisation and demonstration, as shown in Fig. 2. \n \n 2.1. Characterising collaboration \nThe first step in the development of the model focused on identifying collaboration \ncharacteristics as seen through the perspective of collaborative design research. To determine \nthese characteristics, key articles of collaborative design (based on citation within SCOPUS \nan online database for literature accessible via www.scopus.com), relevant to this work, were \nsourced using keywords ‘collaborative design’. Of the top ten cited articles returned by the \nsearch, seven were relevant to this work. The review paper on collaborative design by Wang \net al. [45] was also analysed to capture key characteristics of collaboration. The idea behind \nthis search and analysis of articles was to ground the model within collaborative design \nresearch. Based on the search, the following collaboration characteristics were summarised \nfrom literature: \nC1. Collaboration requires a network in which individuals\/ groups are interconnected [35, \n45, 50] i.e. a social network \nC2. Collaboration requires a network in which tasks\/processes are linked [21, 45] i.e. an \nactivity network \nC3. Collaboration is required to explore and integrate differences of group members who \ntake part in solving problems of allocated tasks that contribute to a common goal [39, \n40, 50] \nC4. Collaboration is closely connected and dependent on decision making, teamwork, and \ncoordination that typify relationships and communication roles [24, 40, 41, 50] \n7 \n \nCoordination involves harmonising interactions between individuals to achieve a common \ngoal [9] while decision making refers to how choices are made based on rules and procedures \n[9, 36]. Teamwork involves pooling skills and resources [44] and forms the basis for \ncollaboration within organisations [4].  \n \n2.2. Social network analysis evaluation  \nIn Table 2, a set of modelling goals based on the collaboration characteristics identified in \n§2.1 was used to assess the current state of social network analysis. Using SCOPUS, a search \nfor articles with keywords ‘collaboration’ and ‘social network analysis’ returned 18 related \narticles that were analysed to determine the focus and current implementations in research \nthat relate to the set of criteria. The evaluation demonstrated that no visualisation for linked \nprocesses and indicators for coordination, decision making and teamwork, within the context \nof this research, were available in social network analysis research. In addition, the analysis \nshowed that current models were inadequate for characterising formal relationships that \nsymbolise collaboration roles and responsibilities. \nThese formal relationships are defined by formal work practises for which tasks and events \nneed to be defined particularly for process-intensive organisations [6, 16, 21] and information \nis usually stored in a more structured form [43]. It is for this reason, that existing structures \nstudied in SNA may not be enough to model collaboration. Nevertheless, the SNA is a \nflexible approach in which basic SNA concepts can be adapted by researchers to propose new \nattributes\/indicators to characterise phenomena and systems [36]. Consequently, for the \nmodel proposed in this paper, the SNA approach has been augmented with adapted \ntechniques from other domains and novel indicators for characterising collaboration.  \n \n2.3. Model conceptualisation  \nThe next phase in the research involved making use of the identified collaboration \ncharacteristics to conceptualise the mathematical model. To do this, two main derivatives (D1 \nand D2) were identified by the authors of this paper based on the analysis of literature in §2.1 \nthat produced C1-C4: \n \nD1. Intra-organisational collaboration information structure consists of: social and \nactivity networks (C1, C2 and C3),  \nFrom this derivative, the main information structure concepts for analysing collaboration \nwere then obtained as a combination of social vertices and edges for individuals\/groups (C1 \nand C3), and activity vertices and edges for tasks\/processes (C2 and C3).  \nTo derive topologies of the social network for collaboration, some possible configurations for \nthe dictator, mutual and exclusive collaboration forms captured in Maher et al. [27], and  \nwere investigated and adopted to: (i) illustrate the potential use of the model, (ii) simplify the \nmodel, and (iii) align the model with existing collaborative design research.  \nThe topologies of the activity network in the proposed model for collaboration were based on \nthe activity-on-node (AON), a traditional activity network employed in the widely used \nProject Evaluation and Review Technique and critical path method [51]. Its selection for use \nin the model was based on the popular use of the AON in the design and management of \ncollaboration related tasks such as organisational projects.  \n8 \n \nActivity-on-node representation makes use of dependencies for organising activities \naccording to two main configurations: series and parallel configurations [10]. Dependencies \nexist if subsequent activities must wait for preceding activities to finish. In addition, within \nactivity-on-node representations, a process occurs once with no feedbacks or loops [10].  \nTo conceptualise formal relationships that symbolise roles and responsibilities, the authors of \nthis paper have introduced a set of edges for interfacing social vertices with activity vertices. \nThe introduced ‘interface edges’ represent relationships that are associated with individuals, \nteams and organisations for involvement in linked processes that contribute to a common \ngoal. \n \nD2. Intra-organisational collaboration requires indicators for authority (decision \nmaking), teamwork, and coordination within topologies, vertices and edges (C3 and \nC4). \nBased on this derivative, a set of novel indicators for collaboration was proposed by the \nauthors, and to compute each indicator a constant is introduced to quantify the strength of \nnetwork relationships and the availability of collaboration information. The introduced \nconstants are as follows: coordination constant (αi), decision constant (βi) and teamwork \nconstant (γi). These constants are subjective probabilities that are based on the availability of \na vertex i to: harmonise interactions (αi), make choices (βi), and pool resources (γi). \nThe proposed collaboration indicators for a vertex i include: decision-making scale (δi), \ncoordination scale (χi) and teamwork scale (τi). These identified indicators are consistent with \nexisting studies in complex network research where decision making measures have been \nintroduced for agent-based systems [14] and coordination quantities for edges between \nvertices have been investigated for hierarchical networks [3, 26].  \nThe proposed collaboration indicators are introduced because existing quantities identified in \nliterature have been used in different contexts to those defined in §2.1 for decision making, \nteamwork and coordination. For instance, the coordination degree by López et al. [26] \nmeasures the ability of a vertex i to interchange information with another vertex j within a \nnetwork and the coordination score by White [46] assesses the degree to which networks are \nconcentrated around important vertices.   \nThe indicators as shown in Fig. 3 are derived as sums of existing SNA measures for \nclustering coefficient, closeness and degree centrality. These quantities were selected because \nthey reflect interconnectedness within groups, individual connections for relationships and \nactivity of individuals respectively [18, 42]. \nThe degree centrality (Dci) is a ratio of number of directly connected vertices to the number \nof possible vertices in a network and can be computed as:  \n \n1\ndeg\nN\nDc ii  \n(1) \nWhere, N is the number of vertices in the network and [deg]i is the number of vertices \ndirectly connected to i.  \nThe clustering coefficient (Cci) assesses the density between vertices and represents the \ntendency for vertices to cluster together. If a vertex i, connects to bi neighbours, and the \n9 \n \nnumber of possible edges between the vertices is given as bi(bi – 1)\/2, then Cci for i can be \ncomputed as: \n \n1\n2\nii\ni\ni\nbb\nn\nCc  \n(2) \nWhere ni is the number of edges between bi neighbours. \nThe closeness (cij) between vertices defines the order with which one vertex connects to \nanother vertex. It is computed as the inverse of the geodesic distance (dij) between a pair of \nvertices i and j. dij is the number of edges along the shortest path between i and j. cij can be \ncalculated as: \n \nNji\nij\nij\nd\nc\n1\n \n(3) \nFor instance, if an individual connects directly to another collaborator (i.e. participant in a \ncollaboration), the closeness is given as 1, if an edge is established as a result of connecting \nto a third vertex k acting as a hub or by dictator collaboration [45], then vertex i has a \ncloseness of 0.5 to vertex j. \nIn the proposed model, configurations proposed in D1 were used to develop eqns. (4-7) that \nanalyse the information structure for social and activity networks. Eqns. (4-7) were then used \nin combination with eqns. (1-3) to formulate the collaboration indicators of eqns. (8-13). \n \n2.4. Scenario demonstration \nTo demonstrate the use of the model for analysing collaboration in organisations, an example \nfrom literature [15] was presented and analysed. The example was selected for familiarisation \nand simplicity purposes. In the demonstration, case scenarios of collaboration will be \ngenerated from the example and possible topologies, vertices and edges based on the \nproposed model will be investigated. Coordination, team-work and decision making \nindicators for each case scenario will then be compared.  \nThe proposed model will also be assessed against the collaboration characteristics criteria \nidentified in §2.1. \n \n \n3. AN INTRA-ORGANISATIONAL COLLABORATION MODEL \nIntra-organisational collaboration (IOC), in this paper, is modelled as a connected, \npartitioned, non-overlapping hypergraph G = (V, E) containing a graph for characterising the \ncollaborative social network of individuals\/groups Gs = (Vs, Es) and a digraph for \ncharacterising the collaborative activity network of processes\/tasks Gp = (Vp, Ep), as shown in \nFig. 4. Vs represents social vertices of collaborating individuals, teams or organisations, and \nVp represents activity vertices for processes that are required to achieve a common goal that \ncould not be achieved by the collaborating individuals. Es and Ep correspond to edges \nbetween teams (or individuals) and processes.  \n10 \n \nFor the proposed model, processes become part of a collaboration based on the set of \ninterface edges T created by vertices within collaborators i.e. T associates Vs with Vp.  \nInterface edges are connections between individuals\/groups and tasks\/processes for the \nexchange of resources. For instance, a machine operator may work on a problem and \nexchange information with a piece of equipment as part of a process in an intra-organisational \ncollaboration. This interaction, related to formal work practise, can be enabled by edges \n(defined here as interface edges) for human-machine relationships. Each social vertex can be \nlinked to as many as Vp activity vertices.   \nThe maximum number of possible interface edges in the model is given as Vs × Vp in which \nevery social vertex is linked to every activity vertex. Consequently G is defined by V = Vs ∪ \nVp and Vs ∩ Vp = Ø. Similarly, E = Es ∪ Ep ∪ T and Es ∩ Ep ∩ T = Ø.  \nThis section makes use of complex network concepts and properties to characterise the \nunderlying topology, composed vertices and connected edges of the IOC model. \n \n3.1. Collaboration social network \nFor f groups (each containing g social vertices) within the social network Gs, three different \n(Types 1 to 3) topologies for characterising IOC are proposed as shown in Fig. 5. \nIn Type 1 topologies, based on dictatorship, collaboration between groups and individuals is \nrealised by means of a leading hub in each group that is appointed to dictate or dominate \ninteractions for collaborations between individuals and groups. In the proposed configuration, \ncollaborating spokes within an organisation are connected to the group hubs (i.e. as a star or \nhub-and-spokes arrangement).  \nFor a group containing a single hub, the social network contains g –1 spokes that are \nconnected to the hub.  The total number of hubs that enable collaboration in multiple groups \nis given as f while the total number of spokes within f groups is given as f (g – 1) i.e. f g – f. \nType 2 topologies, motivated by mutual collaboration, enable edges between connected \nsocial vertices who occupy themselves working with other social vertex in a group to achieve \na specific goal that is posed. Also, groups are connected by a ‘connector hub’ that maintains \ncollaboration across groups. Within a type 2 topology containing f groups, f g – f social \nvertices (or spokes) can link with f hubs with connector roles. Each vertex within a group can \nalso connect to other vertices within its group (i.e. g –1 vertices) to work on a separate part of \na problem that contributes to a common goal.  \nType 3 topologies involve exclusive collaboration and enable edges between connected \nsocial vertices (that act as hubs) with similar or dissimilar specialties. Each social vertex \nworks on achieving a collaborative goal and occasionally connects and negotiates with other \nvertices across collaborating groups for advice and updates on the status of factors such task  \nprerequisites and dependencies, and to solve by uni-, inter- or multi-disciplinary problems. In \nthe type 3 topology, collaboration is based on exclusive roles and the number of collaborating \nteams across organisations is equal to f whereas collaboration is enabled by maximum of Vs \ncollaborating vertices. \nIn all the forms of social network topologies proposed in the IOC model, the number of \nvertices within the social network (Gs) can be calculated as the sum of social vertices from \neach group i.e.: \n \n11 \n \nf\ni\nis gV\n1\n (4) \nWhere |Vs| is the cardinality of Vs, f is the number of groups involved in collaboration and gi \nis the number of social vertices that form a group i. \nWithin Gs, as shown in Fig. 5, two forms of edges facilitate connections: collaborative- and \nnetwork- edges.  \nCollaborative-edges (E's), shown in Fig. 5 as gray coloured lines between vertices, are a \nsubset of edges that form a sub-graph of the social network (Gs') for enabling collaboration \nbetween groups. Within the type 1 and 2 topologies, f social vertices across teams (inter-\nteam) acting as hubs can form f(f –1)\/2 collaborative edges with each other.  In the type 3 \ntopology, each social vertex exclusively collaborates (i.e. creates edges) across groups by \nestablishing g × f(f – 1)\/2 edges based on factors such as common disciplines or pre-defined \nproblems,.  \nNetwork edges (Es) on the other hand, are possible edges for the topologies shown in Fig. 5, \nand their cardinality |Es| are computed as follows:  \n \nType 1 topology: \n\n spokeshubs\ngf\nff\n1\n2\n1\n \n \nType 2 topology: \n chainshubs\ngfgff\n2\n1\n2\n1\n \n \nType 3 topology: \ngffgfg\nfgfgfg\ngroupsacrossgroupswithin\n22 2\n2\n1\n2\n1\n2\n1\n\n (5) \n \n3.2. Collaboration activity network \nThe activity network Gp within the IOC model is derived from: serial topologies that impose \nprecedence in dependencies for creating an additive chain of processes, and parallel \ntopologies that enforce multiple dependencies for concurrent processes. The parallel topology \nmay involve multiple processes that are dependent on a single process (burst) or a single \nprocess that is dependent on multiple processes (merge) as shown in Fig. 6.  \nFor an activity network (Gp) contains I and J number of serial and parallel configurations for \nvertices, the number of vertices within Gp i.e. |Vp| can be computed as:  \n \n parallel\nJ\nJj\nj\nserial\nI\nIi\nip psV  \n(6) \nWhere, si and pj are the number of processes in each serial and parallel configuration \nrespectively and |Vp| is the cardinality of Vp. Suppose an intra-organisational collaboration is \nset up to carry out 4, 3, 5 and 2 processes with parallel dependencies and 9 serially dependent \n12 \n \nprocesses, and if the IOC makes use of 5 collaborating teams each containing 6 team \nmembers, then the number of vertices within the IOC will be 53, broken down as 5 × 6 = 30 \nsocial vertices for Gs and (4 + 3 + 5 + 2) + 9 = 23 activity vertices for Gp \nIf the activity network is made up of I serial, L parallel (burst) and M parallel (merge) then \nprocesses within Gp of the IOC are associated by Ep input and output edges in the \nformulation:  \n \n  parallel\nM\nm\nm\nL\nl\nl\nserial\nI\ni\nip cbaE\n111\n \n(7) \n|Ep| is the cardinality of Ep, a'i and b'l are inputs to I serial and L parallel (burst) sets of \nconfigured vertices and cm is the output edge from M parallel (merge) sets of configured \nvertices where Ep = a'i ∪ b'l ∪ cm and a'i ∩ b'l ∩ cm = Ø. The maximum number of edges \nwithin Gp can be computed as Vp (Vp – 1)\/2. However, when L = 0 then the maximum number \nof edges within Gp can be simplified to 2Vp – 2 activity edges. Two edges are subtracted from \nthe total number for terminal vertices– the start vertex that has no preceding vertices and the \nend vertex that has no following vertices. \n \n3.3. Collaboration indicators  \nWithin the IOC network (i.e. Gs and Gp), three collaboration indicators with values greater \nthan or equal to zero and less than or equal to two are proposed.  \n \nThe first indicator termed the ‘teamwork scale’ (τi) is introduced to assess the activity of a \nsocial vertex i and interconnectedness within a cluster for teamwork. To do this, the degree \ncentrality and clustering coefficient of i are multiplied by a teamwork constant (γi) that is \nbased on the availability and capability of i (i.e. the participant) to pool resources. The \nteamwork scale τi can be calculated as: \n \nFor a social vertex i\n \ni\ncentrality\ns\ni\ntcoefficienclust\nss\ns\ni\nVVV\nE\n deg__\n1\ndeg\n1\n2\n  (8)\n \n Where, [deg\ns\n]i is the number of social vertices  that are directly linked to i. For the overall \nIOC network, the average teamwork scale (τ) can be calculated as: \n \nsV\ni\ni\nsV 1\n1\n \n(9) \nWhere, Vs' is a sub-graph consisting of social vertices at group, inter-group or organisational \nlevel. \n \n13 \n \nThe ‘decision-making scale’ (δi) is the second collaboration indicator introduced to assess the \nease with which a social vertex i within the intra-organisational network can make decisions \nbased on the interconnectedness and connections for relationships. To do this, the clustering \ncoefficient and closeness of i in a defined sub-graph (group or overall organisation) of the \ncollaboration social network are multiplied by a decision constant (βi) that is dependent on \nthe availability and capability of i to make choices. It is calculated as: \n \nFor a social vertex i\n \ni\ntcoefficienclust\nss\ni\ncloseness\nVji\nij\ni\nVV\nE\nd\ns\n _\n1\n21\n \n(10)\n \nWhere, dij is the distance between two vertices i and j, Ei is the number of edges created with \ndirectly connected vertices. The average decision-making scale (δ) for social vertices in the \nIOC network can then be computed as: \n \ns\ns\nV\nVi\ni\nsV\n1\n \n(11) \nThe third indicator, the ‘coordination scale’ (χi) assesses the connections and activity \nassociated with which a social vertex i through which interactions can be harmonised. To do \nthis, a coordination constant (αi) that is dependent on the availability and capability of i for \nharmonising interactions, is multiplied by the sum of the closeness and degree centrality of i \ntowards the social and activity network. The activity network is included to take into account \ncoordination theory that depicts dependencies as emerging from tasks [1]. The coordination \nscale χi can be calculated as: \n \nFor a social vertex i\n \ni\ncentrality\np\nTi\ns\ni\ncloseness\nVki\nik\nVji\nij\ni\nVV\ndd\nps\n    \ndeg_\n1\ndeg\n1\ndeg\n2\n1\n2\n1\n1\n \n (12)\n \nWhere, Vp' is a sub-graph consisting of activity vertices and [deg\ns\n]i(T) is the number of activity \nvertices  that are directly linked to i through interface edges that constitute T. The average \ncoordination scale (χ) for social vertices in the IOC network can then be computed as: \n \ns\ns\nV\nVi\ni\nsV\n1\n \n(13) \n \n3.4. An example: intra-organisational collaboration for product development  \nEppinger [15], adapted to exemplify the application of the proposed model in this paper, is \nbased on the management of the development of power trains at General Motors. No \n14 \n \nindication is given as to the social network for collaborating teams or the number of members \nin each team, rather the focus of Eppinger [15] was to make use of the design structure matrix \napproach to analyse the sequence and configuration of processes based on the frequency of \ninformation flow feed-forwards and feed-backs.  \nThe frequency of communications involving information flow, centred on daily, weekly and \nmonthly interactions and the main design challenge was to improve communications for \nsystems integration. This challenge was dealt with by reorganising the information flow \nthrough the introduction of a systems integration team and four new ‘overlapping’ teams. \nTeams were overlapped based on the sequence of processes and regular team interactions.   \n \n3.4.1. Pre-existing information flow  \nPrior to reorganisation, as shown in Fig. 7a and Table 3, the intra-organisational collaboration \nfor product development (IOC-PD) was made up of four teams that deliver short block \nsystems (SBS), valve train systems (VTS), induction systems (IS), and emissions and \nelectrical systems (EES). The IOC-PD is also made up of 22 processes i.e. an activity \nnetwork made up of 22 activity vertices (A to V), assigned as follows: the SBS team was \nresponsible for developing engine blocks (A), crankshafts (B), flywheels (C), pistons (D), \nconnecting rods (E) and lubrication (F), the VTS team was responsible for cylinder heads \n(G), camshaft\/valve trains (H), and water pump\/cooling (I), the IS team was responsible for \nintake manifold (J), fuel system (K), accessory drive (L), air cleaner (M), AIR (N) and \nthrottle body (O), the EES team was responsible for exhaust (P), EGR (Q), EVAP (R), \nignition (S), ECM (T), and electrical system (U), while all collaborating teams were \nresponsible for engine assembly (V). This demonstration assumes that each team the initial \nIOC-PD is made up of five members corresponding to 20 human collaborators i.e. a social \nnetwork made up of 20 social vertices. Five is chosen for this demonstration because it is the \nminimal value of the magic number for group sizes that is widely accepted as seven plus or \nminus seven [6]. \nTable 4 presents the main results of the IOC-PD demonstration. The table provides data on \nthe number of nodes, groups, participants, hubs and spokes (where appropriate DERIVED \nFROM the description of the scenario. Using these values and topologies from Fig. 7, the \nvalues for SNA measures (clustering coefficient, degree centrality and closeness) were then \ncomputed. The last nine rows of Table 4 present the collaboration indications (individual and \naverage) based on the calculated SNA measures. \nThe first step in determining the collaboration indicators involves calculating the SNA \nmeasures of the network. \n \nClustering coefficient  \nWhereas the maximum number of vertices in a fully connected social network for the IOC-\nPD can be computed as fg(fg  – 1)\/2 i.e. 190, the hubs and spokes in Type 1 topologies can \nform ((f(f  – 1)\/2) +  (g  – 1)) and (g  – 1) actual edges respectively as shown in Fig. 7a. The \nclustering coefficient (Cci) for each hub and spoke in the Type 1 topology can then be \ncomputed as ((4(4 – 1)\/2) + (5 – 1))\/190 = 0.0526 and (5 – 1)\/190 = 0.0211 respectively. \nFor Type 2 and 3 topologies, each hub and spoke can have ((f(f  – 1)\/2) +  (g (g  – 1)\/2)) and \ng (g  – 1)\/2 actual edges corresponding to Cci values of 0.0842 and 0.0526 respectively.  \n15 \n \n \nDegree centrality  \nWithin the social network of the IOC-PD, each hub would have (f – 1) + (g – 1) i.e. 7 \nneighbours whereas the spokes would have 1 neighbour (the dictator hub) in the Type 1 \ntopology and g – 1 i.e. 4 neighbours in the Type 2 topology. From eqn. (1) and Fig. 7a, the \ndegree centrality (Dci) for hubs can then be computed as 7\/(20 – 1) = 0.3684. Dci for spokes \ncan be calculated as 1\/(20 – 1)  = 0.0526 and 4\/(20 – 1)  = 0.2105 for Type 1 and Type 2\/3 \ntopologies respectively.  \nWithin the Type 1 topology, Dci for social vertices within the entire network of social and \nactivity vertices can be calculated, using the interface edges shown in Table 3, as follows: \n \nFor SBS, IS and EES teams \n(Hubs) (7+7)\/((20 – 1) + 22) = 0.3415 \n(Spokes) (1+7)\/((20 – 1) + 22) = 0.1951 \nFor VTS team \n(Hubs) (7+4)\/((20 – 1) + 22) = 0.2683 \n(Spokes) (1+4)\/((20 – 1) + 22) = 0.1220 \n \nValues for Dci in Type 2 and 3 topologies have been computed using similar approaches and \nare shown in Table 4. \n \nCloseness \nWithin the social network of the IOC-PD, the value of dij: between two hubs is 1, between a \nhub and a spoke in the hub’s team is 1, between a hub and a spoke in a different groups is 2, \nbetween two spokes in a different group is 3, and between two spokes in the same group is 2 \nfor Type 1 and 1 for Type 2 topologies. The geodesic distance for social vertices within the \nsocial network can therefore be computed as follows: \n \nFor each hub: \n   )_()_()_(\n1)1(2)1(1)1(1\ngroupdifferentspokehubgroupsamespokehubgroupsacrosshubhub\ngfgf  \nFor each spoke in \nType 1 topology: \n    )_()_()_()_(\n1)1(3)2(2)1(211\nteamdifferentspokespoketeamsamespokespoketeamdifferenthubspoketeamsamehubspoke\ngfgf\n \nFor each spoke in \nType 2  topology: \n    )_()_()_()_(\n1)1(3)2(1)1(211\nteamdifferentspokespoketeamsamespokespoketeamdifferenthubspoketeamsamehubspoke\ngfgf\n \n \nSimilarly, dik for social vertices to an activity vertex k via interface edges T can be calculated \nfrom the edges of topology of the activity network, shown in Fig. 7a, as follows: \n \nShort block \nteam \n(SBS) \n     tasksassignedEEStasksassignedIStasksassignedVTStasksassignedSBS ________\n2223223232323271  \nValve train \nsystem team \n(VTS) \n   tasksassignedEEStasksassignedIStasksassignedVTStasksassignedSBS ________\n223222624162  \n16 \n \nInduction \nsystem team \n(IS) \n   tasksassignedEEStasksassignedIStasksassignedVTStasksassignedSBS ________\n627132323232\n Emissions \nand \nelectrical \nsystem team \n(EES) \n   tasksassignedEEStasksassignedIStasksassignedVTStasksassignedSBS ________\n716232222322\n \n \nValues for Dci in Type 2 and 3 topologies have been computed using similar approaches and \nare shown in Table 4. \nUsing the dij and dik, of social vertex i the closeness of i within the social network and the \nentire IOC-PD network can be computed as shown in Table 4. \n \nCollaboration Indicators \nThe next step in deriving the collaboration indicators involves multiplying the different SNA \nquantities with the various constants proposed in the model. \nAssuming each vertex is always available and capable to harmonise interactions, pool \nresources and make choices, i.e. γi, αi and βi, are all 1, then the various collaboration \nindicators can be calculated, using Fig. 7a and eqns. (8-13), as shown in Table 4.  \nThe table shows that the most effective means for collaboration was the Type 3 topology with \n0.4526 (22.6%), 0.1165(5.8%) and 0.3513 (17.6%) out of a possible value of 2 for teamwork, \ndecision-making and coordination. \n \n3.4.2. Reorganised information flow  \nFollowing the reorganisation, the old IOC-PD configuration is replaced with four new teams \n(numbered 1 to 4) and an integration team. In the new IOC-PD, the teams are assigned to 6, \n7, 8 and 5 tasks respectively with multiple teams working on the few overlapping processes \nas shown in Table 5 and Fig. 7b.  The integration team is exclusively assigned to five \nprocesses L-V.  \nIn Eppinger [15], the reorganisation involved the restructuring of available personnel which \nin this example corresponds to five groups made up of four personnel giving a total of 20 \ncollaborating social vertices as in §3.4.1. Using the intra-collaboration model, the updated \nvalues for collaboration indicators can be derived as shown in Table 4.   \nFor the Type 1 topology, an additional hub and more edges between hubs due to increased \nnumber of group causes an improvement to the clustering coefficient of the social network, \nwhereas degree centrality and closeness values remain constant. The overall effect of the \nreorganisation is that collaboration improves for the Type 1 topology. \nFor the Type 2 topology, the additional connector hub causes a decrease in the Cci, Dci and cij \nvalues for connected social vertices. This results in an overall decrease in the collaboration \nindicators although these values remain higher than those of the Type 1 topology. \nWithin the Type 3 topology, each social vertex acts as a hub meaning Cci and Dci values \nremain the same. However, the closeness decreases and counteracts gains due to increased \ncoupling of processes. Consequently, teamwork and decision-making scales remain constant \nwhereas coordination decreases slightly. Nonetheless, the Type 3 topology based on \n17 \n \nexclusive collaboration offers the highest values for collaboration indicators in both the pre-\nexisting and re-organised information flow, correlating with previous empirical studies such \nas Maher et al. [27] which suggest that exclusive collaborations are the most effective and \nproductive. \n \n \n4. DISCUSSION \nIn Table 6, the intra-organisational collaboration model proposed in this paper is evaluated \nbased on the characteristics of collaboration identified in §2.1, with regards to the \ninformation structure and behaviour for organisations. The table demonstrates coverage of the \nrequired characteristics for collaboration in organisations.  \nThis section highlights and discusses some applications and limitations of the proposed \nmodel.   \n \n4.1. Applications of the model  \nThe intra-organisational collaboration model proposed in this paper can be applied by \nresearchers and practitioners in two main ways: (i) for enhancing the quality and sharing of \ninformation within organisations and (ii) for analysing roles for communication during \ncollaboration.  \n \n4.1.1. Enhancing information quality and sharing  \nInformation quality describes the free flow of information within an organisation whereas \ninformation sharing is a factor of information flow that describes the joint use of critical and \nproprietary information that could be generic (inventory control policies) or specific (weekly \nmanufacturing schedule) in nature [13].  \nIn terms of enhancing information quality and sharing, the proposed model can be used to \nplan the configuration of organisations through the identification and selection of suitable \ncollaboration topologies. Possible configurations such as those identified in §3.1 and §3.2 \ncould be generated and collaboration indicators such as those proposed in §3.3 may then be \nused to analyse potentials for collaboration. This is typical of network analysis techniques \nthat explore the paradox of peripherality versus centrality of actors in an organisation [46].  \nFor the case scenario of the IOC-PD presented in §3.4, the type 3 configuration scored \nhighest in terms of potentials for teamwork, decision-making and coordination with τ, δ, and \nχ values of 0.4526, 0.1165 and 0.3513 respectively, as shown in Table 4. However, the \nreorganised information flow for the type 3 configuration failed to improve the collaboration \nindicators. Rather, the coordination degree decreased by a value of 0.0003 (-0.85%). In \ncontrast, the generated values for τ, δ, and χ in the type 2 configuration decreased by 0.0458 \n(-15.21%), 0.014 (-16.91%) and 0.0145 (-5.02%) respectively. \nFor the type 2 configuration in §3.4, the results of comparing the pre-existing and re-\norganised information flow showed that generated τ, δ, and χ values increased by 0.0173 \n(+12.08%), 0.0022 (+4.39%) and 0.0075 (+3.27%) respectively. \nThe managerial implication of the results is that enhancements to information flow must be \ndriven by an analysis of the initial configuration of organisations. In practice, the \nconfiguration of an organisation may involve a combination of all the topologies identified in \n18 \n \n§3.1 and §3.2. An initial analysis of the organisation’s topology is therefore required prior to \nreorganisation. For instance, managers could decide to change an organisation’s topology \nfrom a type 1 to a type 3 configuration. Alternatively, strategies for improving information \nflow could be investigated and analysed. Using the proposed model for instance, alternative \nstructures for social and activity vertices can be applied to improve intra-organisation \ncollaboration as shown by the plots in Fig. 8. Fig. 8a depicts a chart of the average decision-\nmaking scales, Fig. 8b shows the average coordination scales, whereas Fig. 8c presents the \naverage teamwork scale chart. In the plots, four different configurations are applied to \ngenerate collaboration indicators for the IOC-PD. The first two markers in each chart from \nleft to right represent the collaboration indicators for the pre-existing and reorganised \ninformation flow respectively. The third markers (that offer highest values for coordination as \nshown in Fig. 8b) represent changes to the pre-existing information flow achieved through \nhigh coupled processes in which each of the original four teams are assigned to 21 \noverlapping tasks each. The fourth markers (that offer highest values for decision-making and \nteamwork as shown in Fig. 8a and 8c) indicate modification to the pre-existing information \nflow by means of restructuring personnel to two groups made up of ten members each. In Fig. \n8, γi, αi and βi are all 1 (i.e. vertex is always available and capable to harmonise interactions, \npool resources and make choices).  \nIn practice, the proposed collaboration indicators can vary depending on factors such as skill \nlevels, staff knowledge and experience, working hours, study\/sick leaves and involvement in \nmultiple projects. High values of collaboration indicators for vertices towards therefore \nsuggest high potentials for working together whereas low collaboration indicators could \nimply high independent work\/ research. Consequently, collaboration indicators could offer a \nuseful avenue for planning staff availability, implementing staff covers and backup, and \nestablishing multiple information access points. \n \n4.1.2. Analysing communication roles  \nAs shown in Table 1, existing literature on modelling collaboration using social network \nanalysis have largely concentrated on evaluating how participants communicate during \ncollaboration. Within the proposed IOC model, human participants can take up key roles as \nhubs or spokes according to nature of the collaboration – dictatorship, mutual or exclusive.  \nWithin the case scenario of the IOC-PD, type 1 topology hubs share similar pre-existing Dci \n(individual connections) and cij (activity) scores of 0.3684 and 0.0323 respectively, with type \n2 and 3 topology hubs. However, in terms of interconnectedness, type 1 topology hubs have \nlower Cci scores of 0.0526 in comparison to the Cci scores of 0.0842 for the type 2 and 3 \ntopology hubs. Similarly, as shown in Table 4, the Dci, cij and Cci scores for the type 1 \ntopology spokes are lower than the type 2 topology spokes. \nFor organisational managers, periodical assessments of Dci, cij and Cci scores could offer a \nuseful avenue for evaluating the performance of an organisation’s agent- and web-based \nsystems. In the analysis of agent based systems multiple agents may assume the role of a \nsingle vertex and a vertex may assume multiple roles, an occurrence known as ‘interlocking’ \nthat has been the focus of studies in which individuals, usually directors affiliated to one \norganisation, sit on the board of other organisations [30]. Similar interlocking ideas have \nbeen applied in industrial practise for design processes with a view to promoting coupled \n19 \n \ndesigns [40].  Also, in web-based systems social vertices acting as servers may be included in \nthe social network to serve as hubs for clients. Special considerations for server-to-server \nedges could then be made for enhancing collaboration through the timely synchronisation of \nservers across groups with minimal disruption to the availability of information. Furthermore, \nas shown in Fig. 8, a combination of fewer groups and coupled tasks could be combined or \ntraded-off for improved collaboration. Consequently, layers of groups resembling \nhierarchical structures could be created for effective collaborative work that requires high \nnumbers of social vertices. Where this is the case, groups of ‘collaborative actors’ may then \nbecome the unit for analysis for social vertices in the IOC model.  \n \n4.2. Limitations of the model  \nAlthough this paper identifies a single indicator for each collaboration characteristic, it is \nhowever important to note that users of the proposed model still require some training or \nexperience in the use SNA. This is because terms such as closeness and clustering coefficient \nare fundamental quantities from the SNA technique. The simplicity of the proposed model \nhas also meant that basic quantities and collaboration forms have been adopted. For instance, \nthe degree is a measure used in the model that can be broken down further into indegree and \noutdegree that characterise the direction of edges between two vertices. If the degree is based \non directed edges towards a vertex i then it is known as the indegree whereas if it is based on \ndirected vertices from i then the measure is known as the outdegree [46]. Furthermore, in the \nmodel the presence as opposed to the strength of edges is employed. This strength of \nrelationships accounts for why individuals with similar characteristics usually associate with \none another, a trend known as homophily [49].  \nAlso, in this paper, the proposed collaboration indicators are analysed from the perspective of \nsocial vertices within the network in accordance with the SNA technique from which the \nmodel in this paper was proposed. Furthermore, in the case scenario of the IOC-PD, it is \nassumed that vertices are always available and capable of establishing edges for harmonising \ninteractions, pooling resources and making choices. However in real-world scenarios, \nactivities may be automated or semi-automated for activity vertices to take over some \ncollaborative work resulting in ‘indirect influences’ and improvements on the level of \ncollaboration in organisations.  \n \n \n4.3. Future Research Directions \nPrior works by authors such as López et al. [26] and Ehsani et al. [14] have proposed or \ndemonstrated the use of mathematical models for analysing collaboration characteristics or \nrelationships. Similarly, this article has proposed and demonstrated the use of a mathematical \nmodel, i.e. the IOC model, for analysing collaborations in organisations. However, the case \nscenario used in the demonstration was based on an example from academic literature.  \nConsequently, challenges exist to explore the practicality and usability of the IOC model for \nanalysing real-life organisations and processes. There is therefore a need to examine if the \nIOC model can be applied for specific or a wide range of companies and to define the \nperformance of the model for effective collaborations. Some useful research areas that could \nbe explored include the extent to which the IOC model could be applied for analysing \n20 \n \ncollaborations, the performance of the IOC model against other tools, and the validation of \nthe model across different organisations.  \nCase studies of companies could be used to capture the topologies, vertices and edges of the \nIOC model and to outline lessons that could be learnt and used to improve collaborations.  \n \n \n5. CONCLUSIONS \nIn this article, a sociological and technical (i.e. socio-technological) perspective has been \napplied to mathematically model an organisation as a network that collaborates to solve a \nproblem or achieve a goal. Useful insights from the proposed ‘intra-organisational \ncollaboration model’ in this paper suggested that an organisation can be: analysed as an \namalgamation of social networks of human actors and activity networks of processes, and \nassessed through indicators for teamwork - to tally the manner in which participants and \ngroups pool resources to achieve a goal, purposely, or inadvertently, decision-making - to \nscore the manner in which choices are made during collaborations through dictated decisions \nby a dictating entity, participatory decisions made by participating entities and democratic \ndecisions based on collaborators who are individually responsible for decision making, and \ncoordination - to measure the ability of collaborators to harmonise interactions for \nmaintaining and updating the flow of resources such as materials, funds and information.  \nA case scenario of the management of the development of power trains was used to \ndemonstrate how the mathematical model can be used to analyse collaborations within an \norganisation. The scenario compared the pre-existing information flow involving 4 teams of 5 \nmembers and the re-organised information flow involving 4 teams of 4 members. The \nanalysis of the case scenario showed that for topologies based on mutuality, collaboration \nindicator values decreases whereas for topologies based on dictatorship, collaboration \nimproves. However, collaboration indicator values remain constant for topologies based on \nexclusivity. These findings suggested that merely discovering and concentrating on working \nin a group may not be adequate for collaboration, there is a need to factor the number and \nlevels of collaboration much like hierarchies in traditional organisations as well as the \noverlapping of tasks that may be automated or semi-automated.   \nWithin the proposed IOC model, communication is enabled by social, activity and interface \nedges. For researchers and industrial practitioners, the presence of these different edges \npresents a wide range of communication roles for enabling human-to-human, human-to-\nprocess and process-to-process communications. Furthermore, within the proposed IOC \nmodel, initial or regular analysis of the information structure and behaviour for collaboration \ncan be conducted to determine and review information flow factors such as group sizes, data \nstorage roles, and flow control policies. Also, as discussed in the paper, the proposed model \ncan serve as a benchmarking approach for improving the free flow and exchange of \ninformation within organisations.  \n \n \n21 \n \n6. ACKNOWLEDGMENTS \nThe authors would like to extend their sincere thanks to the Engineering and Physical Sciences Research \nCouncil (EPSRC), for its support via the Cranfield Innovative Manufacturing Research Centre (CIMRC), \ntowards the work carried out in the preparation of this paper. \n \n \n7. REFRENCES \n[1] V. Albino, P. Pontrandolfo, B. Scozzi, Analysis of information flows to enhance the coordination of \nproduction processes, International Journal of Production Economics 75 (2002) 7−19. \n[2] J.G. Anderson, Evaluation in health informatics: social network analysis, Computers in Biology and \nMedicine, 32 (2002) 179−193.  \n[3] D. Ben-Arieh, M.A. Pollatscheck, Analysis of information flow in hierarchical organizations, International \nJournal of Production Research 40 (2002) 3561−3573. \n[4] M.M. Beyerlein, S. Freedman, C. McGee, L. Moran, Beyond Teams: Building the Collaborative \nOrganization, Jossey-Bass\/Pfeiffer, San Francisco, 2003.  \n[5] S. Boccaletti, V. Latora, Y. Moreno, M. Chavez, D.-U. Hwang, Complex networks: structure and dynamics, \nPhysics Reports 424  (2006)  175−308 \n[6] B.G. Cain, J.O. Coplien, N.B. Harrison, Social patterns in productive software development organizations, \nAnnals of Software Engineering 2 (1996) 259−286.   \n[7]  C. Chen, Social networks at Sempra Energy's IT division are key to building strategic capabilities, Global \nBusiness and Organizational Excellence 26 (2007) 16−24.  \n[8] P.S. Chinowsky, J. Diekmann, J. O'Brien, Project organizations as social networks, Journal of Construction \nEngineering and Management 136  (2010) 452−458.  \n[9] N. Clarke, Transorganization development for network building, Journal of Applied Behavioral Science 41 \n(2005) 30−46. \n[10] D.L. Cook, Program evaluation and review techniques, applications in education, U.S. Office of Education \nCooperative Monograph 17 (OE-12024) (1966). \n[11] R. Cross, S.P. Borgatti, A. Parker, Making invisible work visible: Using social network analysis to support \nstrategic collaboration, California Management Review 44 (2002) 25−46.  \n[12] P. De Meo, A. Nocera, G. Terracina, D. Ursino, Recommendation of similar users, resources and social \nnetworks in a Social Internetworking Scenario, Information Sciences 181 (2011) 1285−1305.  \n[13] C. Durugbo, A. Tiwari, J.R. Alcock, Managing Information Flows for Product-Service Systems Delivery. \nProceedings of the 2nd CIRP IPS2 Conference, Linköping, Sweden, 2010, pp. 365−370. \n[14] M. Ehsani, A. Makui, S. Sadi Nezhad, A methodology for analyzing decision networks, based on \ninformation theory, European Journal of Operational Research 202 (2010) 853−863.   \n[15] S.D. Eppinger, Innovation at the speed of information, Harvard Business Review 79 (2001) 149−158, 178. \n[16] D.G. Gregg, Designing for collective intelligence, Communications of the ACM 53 (2010) 134−138. \n[17] F. Grippa, A social network scorecard to monitor knowledge flows across communication media, \nKnowledge Management Research and Practice 7 (2009) 317−328.  \n[18] J.-P. Hatala, J.G. Lutta, Managing information sharing within an organizational setting: A social network \nperspective, Performance Improvement Quarterly 21 (2009) 5−33.  \n[19] P. Hawe, C. Webster, A. Shiell, A glossary of terms for navigating the field of social network analysis, \nJournal of Epidemiology and Community Health 58  (2004) 971−975.  \n[20] D.W. Hsiao, A.J.C. Trappey, L. Ma, P.-S. Ho, An integrated platform of collaborative project management \nand silicon intellectual property management for IC design industry, Information Sciences 179 (2009) \n2576−2590.  \n[21] M. Klein, C. Dellarocas, Knowledge-based approach to handling exceptions in workflow systems, \nComputer Supported Cooperative Work: CSCW: An International Journal 9 (2000) 399−412.  \n[22] M. Krauss, N. Mueller, D. Luke, Interorganizational relationships within state tobacco control networks: a \nsocial network analysis, Preventing chronic disease 1 (2004) A08.  \n[23] R. Kumar, Research methodology, Longman, London, 1996. \n22 \n \n[24] T. Kvan, Collaborative design: What is it? Automation in Construction, 9 (2000) 409−415.  \n[25] J.M. Lewis, J.I. Baeza, D. Alexander, Partnerships in primary care in Australia: Network structure, \ndynamics and sustainability, Social Science and Medicine 67 (2008) 280−291.  \n[26] L. López, J.F.F. Mendes, M.A.F. Sanjuán, Hierarchical social networks and information flow, Physica A: \nStatistical Mechanics and its Applications, 316 (2002) 695−708.  \n[27] M.L. Maher, A. Cicognani, S.J. Simoff, An experimental study of computer mediated collaborative design, \nInternational Journal of Design Computing 1 (1998) available online: \nhttp:\/\/wwwfaculty.arch.usyd.edu.au\/kcdc\/ijdc\/vol01\/papers\/maherFrameset.htm  \n[28] J.A. Martin, K.M. Eisenhardt, Rewiring: Cross-business-unit collaborations in multibusiness organizations, \nAcademy of Management Journal 53 (2010) 265−301.  \n[29] H.B. Milward, K.G. Provan, Measuring network structure, Public Administration 76 (1998) 387−407.  \n[30] M.S. Mizruchi, What do interlocks do? An analysis, critique and assessment of research on interlocking \ndirectorates, Annual Review of Sociology 22 (1996) 271–298. \n[31] R. Monclar, A. Tecla, J. Oliveira, J.M. de Souza, MEK: Using spatial-temporal information to improve \nsocial networks and knowledge dissemination, Information Sciences 179 (2009) 2524−2537. \n[32] M.E.J. Newman, The structure of scientific collaboration networks, Proceedings of the National Academy \nof Sciences of the United States of America 98 (2001) 404−409. \n[33] Y. Ni, L. Xie, Z.-Q. Liu, Minimizing the expected complete influence time of a social network, Information \nSciences 180 (2010) 2514−2527.  \n[34] A. Oberg, P. Walgenbach, Hierarchical structures of communication in a network organization, \nScandinavian Journal of Management 24 (2008) 183−198.  \n[35] F. Pahng, N. Senin, D. Wallace, Distribution modelling and evaluation of product design problems, CAD \nComputer Aided Design 30 (1998) 411−423. \n[36] S. Pryke, S. Pearson, Project governance: Case studies on financial incentives, Building Research and \nInformation 34 (2006) 534−545.  \n[37] D. Richards, A social software\/Web 2.0 approach to collaborative knowledge engineering, Information \nSciences 179 (2009) 2515−2523  \n[38] B. Schultz-Jones, Examining information behavior through social networks: An interdisciplinary review, \nJournal of Documentation 65 (2009) 592−631  \n[39] N. Shyamsundar, R. Gadh, Collaborative virtual prototyping of product assemblies over the Internet, CAD \nComputer Aided Design 34 (2002) 755−768.  \n[40] D.H. Sonnenwald, Communication roles that support collaboration during the design process, Design \nStudies 17 (1996) 277−30. \n[41] J. Stempfle, P. Badke-Schaub, Thinking in design teams - An analysis of team communication, Design \nStudies 23 (2002) 473−496. \n[42] T.W. Valente, K.A. Coronges, Stevens, G.D., Cousineau, M.R., Collaboration and competition in a \nchildren's health initiative coalition: A network analysis, Evaluation and Program Planning 31 (2008) \n392−402.  \n[43] W.M.P. Van Der Aalst, H.A. Reijers, M. Song, Discovering social networks from event logs, Computer \nSupported Cooperative Work: CSCW: An International Journal 14 (2005) 549−593.  \n[44] X.B. Wang, P.D.F. Kilduff, Structuring a concurrent design environment for effective product design and \ndevelopment, Journal of the Textile Institute Part 1: Fibre Science and Textile Technology 90 (1999) \n83−91. \n[45] L. Wang, W. Shen, H. Xie, J. Neelamkavil, A. Pardasani, Collaborative Conceptual Design—state of art \nand future trends, CAD Computer-Aided Design 34 (2002) 981–996.  \n[46] L. White, Connecting organizations: developing the idea of network learning in inter-organizational \nsettings, Systems Research and Behavioral Science 25 (2008) 701−716.  \n[47] H. Wi, S. Oh, J. Mun, M. Jung, A team formation model based on knowledge and collaboration, Expert \nSystems with Applications 36 (2009) 9121−9134.  \n[48] T. Wolf, A. Schröter, D. Damian, L.D. Panjer, T.H.D. Nguyen, Mining task-based social networks to \nexplore collaboration in software teams, IEEE Software 26 (2009) 58−66. \n23 \n \n[49] F. Wu, B.A. Huberman, L.A. Adamic, J.R. Tyler, Information flow in social groups, Physica A: Statistical \nMechanics and its Applications 337 (2004) 327−335.  \n[50] X.W. Xu, T. A. Liu, Web-enabled PDM system in a collaborative design environment, Robotics and \nComputer-Integrated Manufacturing 19 (2003) 315−328.  \n[51] A. Yassine, D. Falkenburg, K. Chelst, Engineering Design Management: An Information Structure \nApproach, International Journal of Production Research 37 (1999) 2957−2975.  \n[52] J. Zhu, J. Gong, W. Liu, T. Song, J. Zhang, A collaborative virtual geographic environment based on P2P \nand Grid technologies, Information Sciences 177  (2007) 4621−4633. \n \n \n \n \n \n"}