{"doi":"10.1109\/TNET.2011.2160997","coreId":"220192","oai":"oai:eprints.lse.ac.uk:37539","identifiers":["oai:eprints.lse.ac.uk:37539","10.1109\/TNET.2011.2160997"],"title":"Congestion-dependent pricing and forward contracts for complementary segments of a communication network","authors":["Reiter, Miklós","Steinberg, Richard"],"enrichments":{"references":[{"id":17291545,"title":"A contract and balancing mechanism for sharing capacity in a communication network,”","authors":[],"date":"2006","doi":"10.1287\/mnsc.1050.0455","raw":"E. Anderson, F. Kelly, and R. Steinberg, “A contract and balancing mechanism for sharing capacity in a communication network,” Management Science, vol. 52, no. 1, pp. 39–53, Jan. 2006.","cites":null},{"id":17291509,"title":"Congestion pricing and user adaptation,” in","authors":[],"date":"2001","doi":"10.1109\/infcom.2001.916288","raw":"A. Ganesh, K. Laevens, and R. Steinberg, “Congestion pricing and user adaptation,” in Proc. INFOCOM, 2001, pp. 959–965.","cites":null},{"id":17291605,"title":"Congestion-dependent pricing of network services,”","authors":[],"date":"2000","doi":"10.1109\/90.842140","raw":"I. C. Paschalidis and J. Tsitsiklis, “Congestion-dependent pricing of network services,” IEEE\/ACM Trans. Netw., vol. 8, no. 2, pp. 171–184, Apr. 2000.","cites":null},{"id":17291553,"title":"Contract-switching paradigm for Internet value ﬂows and risk management,” in","authors":[],"date":"2008","doi":"10.1109\/infocom.2008.4544624","raw":"M. Yuksel, A. Gupta, and S. Kalyanaraman, “Contract-switching paradigm for Internet value ﬂows and risk management,” in Proc. IEEE Global Internet Symposium, 2008.","cites":null},{"id":17291608,"title":"Dynamic contract trading in spectrum markets,”","authors":[],"date":"2010","doi":"10.1109\/allerton.2010.5706988","raw":"G. Kasbekar, S. Sarkar, K. Kar, P. K. Muthusamy, and A. Gupta, “Dynamic contract trading in spectrum markets,” in Proceedings of 48th Annual Allerton Conference on Communication, Control, and Computing, 2010, pp. 791–799. Mikl´ os Reiter received the B.A., M.Math. and the Ph.D. degrees in mathematics and operations research from the University of Cambridge in 2003, 2004 and 2007 respectively. He now works as Senior Quantitative Researcher at eValue FE Ltd., London. His research interests include game theory and ﬁ-nancial risk modelling. Richard Steinberg (M ’10) received the B.A. degree from Reed College, Portland, Oregon in 1976, the M.Math. and Ph.D. degrees in combinatorics and optimization from the University of Waterloo, Waterloo, Ontario, Canada, in 1976 and 1979, respectively, and the M.B.A. from the University of Chicago, Chicago, IL, in 1980. He has worked at AT&T Bell Laboratories and has served on the faculties of the University of Chicago, Columbia University, and the University of Cambridge. He is currently Chair in Operations Research and Head of the Management Science Group at the London School of Economics. His current research interests include Internet economics and auctions.","cites":null},{"id":17291578,"title":"Enabling dynamic market-managed QoS interconnection in the next generation internet by a modiﬁed BGP mechanism,”","authors":[],"date":"2002","doi":"10.1109\/icc.2002.997325","raw":"J. Hwang, J. Altmann, H. Oliver, and A. Su´ arez, “Enabling dynamic market-managed QoS interconnection in the next generation internet by a modiﬁed BGP mechanism,” in IEEE International Conference on Communications, 2002.","cites":null},{"id":17291607,"title":"Equilibrium in competitive insurance markets: An essay on the economics of imperfect information,”","authors":[],"date":"1976","doi":"10.1007\/978-94-015-7957-5_18","raw":"M. Rothschild and J. E. Stiglitz, “Equilibrium in competitive insurance markets: An essay on the economics of imperfect information,” The Quarterly Journal of Economics, vol. 90, no. 4, pp. 629–649, Nov. 1976.","cites":null},{"id":17291492,"title":"Forward contracts for complementary segments of a communication network,” in","authors":[],"date":"2010","doi":"10.1109\/infcom.2010.5462101","raw":"M. Reiter and R. Steinberg, “Forward contracts for complementary segments of a communication network,” in Proc. INFOCOM, Mar. 2010.","cites":null},{"id":17291579,"title":"Internet trafﬁc engineering,”","authors":[],"date":"2001","doi":"10.1109\/mcom.2002.1039867","raw":"R. M. Mortier, “Internet trafﬁc engineering,” Ph.D. dissertation, Univ. Cambridge, Cambridge, UK, Oct. 2001.","cites":null},{"id":17291543,"title":"Peering and provisioning of differentiated Internet services,” in","authors":[],"date":"2000","doi":"10.1109\/infcom.2000.832214","raw":"N. Semret, R. Liao, A. Campbell, and A. Lazar, “Peering and provisioning of differentiated Internet services,” in Proc. INFOCOM, Mar. 2000.","cites":null},{"id":17291565,"title":"Price duopoly and capacity constraints,”","authors":[],"date":"1972","doi":"10.2307\/2525908","raw":"R. Levitan and M. Shubik, “Price duopoly and capacity constraints,” International Economic Review, vol. 13, no. 1, pp. 111–122, Feb. 1972.","cites":null},{"id":17291522,"title":"Pricing Communication Networks.","authors":[],"date":"2003","doi":"10.1002\/0470867175","raw":"C. Courcoubetis and R. Weber, Pricing Communication Networks. Wiley, Chichester, 2003.","cites":null},{"id":17291511,"title":"Pricing internet service,”","authors":[],"date":"2003","doi":"10.1007\/0-387-25002-6_6","raw":"R. Steinberg, “Pricing internet service,” in Managing Business Interfaces: Marketing, Engineering, and Manufacturing Perspectives. Kluwer, Dordrecht, 2003, pp. 175–201.","cites":null},{"id":17291510,"title":"Pricing network services,” in","authors":[],"date":"2003","doi":"10.1109\/infcom.2003.1208958","raw":"J. Shu and P. Varaiya, “Pricing network services,” in Proc. INFOCOM, 2003, pp. 1221–1230.","cites":null},{"id":17291606,"title":"Quantity precommitment and Bertrand competition yield Cournot outcomes,”","authors":[],"date":"1983","doi":"10.2307\/3003636","raw":"D. M. Kreps and J. A. Scheinkman, “Quantity precommitment and Bertrand competition yield Cournot outcomes,” The Bell Journal of Economics, vol. 14, no. 2, pp. 326–337, 1983.","cites":null},{"id":17291566,"title":"Rationing rules and Bertrand-Edgeworth equilibria in large markets,”","authors":[],"date":"1986","doi":"10.1016\/0165-1765(86)90047-9","raw":"X. Vives, “Rationing rules and Bertrand-Edgeworth equilibria in large markets,” Economics Letters, vol. 21, no. 2, pp. 113–116, Feb. 1986.","cites":null},{"id":17291494,"title":"Resource pricing and the evolution of congestion control,”","authors":[],"date":"1999","doi":"10.1016\/s0005-1098(99)00135-1","raw":"R. Gibbens and F. Kelly, “Resource pricing and the evolution of congestion control,” Automatica, vol. 35, pp. 1969–1985, 1999.","cites":null},{"id":17291534,"title":"Spot and derivative markets in admission control,”","authors":[],"date":"1999","doi":null,"raw":"N. Semret and A. Lazar, “Spot and derivative markets in admission control,” in 16th International Teletrafﬁc Congress, Edinburgh, UK, Jun. 1999.","cites":null},{"id":17291555,"title":"Strategic regulation policy in the internet,”","authors":[],"date":"2006","doi":"10.1007\/s11149-006-0009-2","raw":"O. Foros, H. J. Kind, and L. Sørgard, “Strategic regulation policy in the internet,” Journal of Regulatory Economics, vol. 30, no. 1, pp. 63–84, 2006.","cites":null},{"id":17291604,"title":"The history of communications and its implications for the Internet,”","authors":[],"date":null,"doi":"10.2139\/ssrn.235284","raw":"A. M. Odlyzko, “The history of communications and its implications for the Internet,” 2000.14","cites":null},{"id":17291533,"title":"The Mathematics of Internet Congestion Control. Birkhauser,","authors":[],"date":"2004","doi":"10.1007\/978-0-8176-8216-3","raw":"R. Srikant, The Mathematics of Internet Congestion Control. Birkhauser, Boston, 2004.","cites":null},{"id":17291564,"title":"The pure theory of monopoly,” in Papers Relating to Political Economy,","authors":[],"date":"1925","doi":"10.2307\/2547849","raw":"F. Y. Edgeworth, “The pure theory of monopoly,” in Papers Relating to Political Economy, vol. 1. Macmillan, London, 1925, pp. 111–142.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2012-04-18","abstract":"Congestion-dependent pricing is a form of traffic management that ensures the efficient allocation of bandwidth between users and applications. As the unpredictability of congestion prices creates revenue uncertainty for network providers and cost uncertainty for users, it has been suggested that forward contracts could be used to manage these risks. We develop a novel game-theoretic model of a multiprovider communication network with two complementary segments and investigate whether forward contracts would be adopted by service providers. Service on the upstream segment is provided by a single Internet service provider (ISP) and priced dynamically to maximize profit, while several smaller ISPs sell connectivity on the downstream network segment, with the advance possibility of entering into forward contracts with their users for some of their capacity. We show that the equilibrium forward contracting volumes are necessarily asymmetric, with one downstream provider entering into fewer forward contracts than the other competitors, thus ensuring a high subsequent downstream price level. In practice, network providers will choose the extent of forward contracting strategically based not only on their risk tolerance, but also on the market structure in the interprovider network and their peers' actions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/220192.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/37539\/1\/__Libfile_repository_Content_SBDLQP~4_CM5OQO~K_Congestion-dependent%20pricing%20and%20forward%20contracts%20for%20complementary%20segments%20of%20a%20communication%20network%20%28LSE%20RO%29.pdf","pdfHashValue":"29d9e6690bbd9a2aec5d46aaae9b551ed657e3a1","publisher":"IEEE and Association for Computing Machinery","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:37539<\/identifier><datestamp>\n      2013-12-02T12:25:35Z<\/datestamp><setSpec>\n      74797065733D43454E54524553:4C53455F52435F4D616E5F536369<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D4D414E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/37539\/<\/dc:relation><dc:title>\n        Congestion-dependent pricing and forward contracts for complementary segments of a communication network<\/dc:title><dc:creator>\n        Reiter, Miklós<\/dc:creator><dc:creator>\n        Steinberg, Richard<\/dc:creator><dc:subject>\n        HF Commerce<\/dc:subject><dc:subject>\n        QA75 Electronic computers. Computer science<\/dc:subject><dc:description>\n        Congestion-dependent pricing is a form of traffic management that ensures the efficient allocation of bandwidth between users and applications. As the unpredictability of congestion prices creates revenue uncertainty for network providers and cost uncertainty for users, it has been suggested that forward contracts could be used to manage these risks. We develop a novel game-theoretic model of a multiprovider communication network with two complementary segments and investigate whether forward contracts would be adopted by service providers. Service on the upstream segment is provided by a single Internet service provider (ISP) and priced dynamically to maximize profit, while several smaller ISPs sell connectivity on the downstream network segment, with the advance possibility of entering into forward contracts with their users for some of their capacity. We show that the equilibrium forward contracting volumes are necessarily asymmetric, with one downstream provider entering into fewer forward contracts than the other competitors, thus ensuring a high subsequent downstream price level. In practice, network providers will choose the extent of forward contracting strategically based not only on their risk tolerance, but also on the market structure in the interprovider network and their peers' actions.<\/dc:description><dc:publisher>\n        IEEE and Association for Computing Machinery<\/dc:publisher><dc:date>\n        2012-04-18<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/37539\/1\/__Libfile_repository_Content_SBDLQP~4_CM5OQO~K_Congestion-dependent%20pricing%20and%20forward%20contracts%20for%20complementary%20segments%20of%20a%20communication%20network%20%28LSE%20RO%29.pdf<\/dc:identifier><dc:identifier>\n          Reiter, Miklós and Steinberg, Richard  (2012) Congestion-dependent pricing and forward contracts for complementary segments of a communication network.  IEEE\/ACM Transactions on Networking, 20 (2).  pp. 436-449.  ISSN 1063-6692     <\/dc:identifier><dc:relation>\n        http:\/\/www.ton.seas.upenn.edu\/<\/dc:relation><dc:relation>\n        10.1109\/TNET.2011.2160997<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/37539\/","http:\/\/www.ton.seas.upenn.edu\/","10.1109\/TNET.2011.2160997"],"year":2012,"topics":["HF Commerce","QA75 Electronic computers. Computer science"],"subject":["Article","NonPeerReviewed"],"fullText":"  \nMiklós Reiter and Richard Steinberg \nCongestion-dependent pricing and forward \ncontracts for complementary segments of a \ncommunication network \n \nArticle (Accepted version) \n(Refereed) \n \nOriginal citation: \nReiter, Miklós and Steinberg, Richard (2012) Congestion-dependent pricing and forward \ncontracts for complementary segments of a communication network. IEEE\/ACM Transactions on \nnetworking, 20 (2). pp. 436-449. ISSN 1063-6692  \n \nDOI:10.1109\/TNET.2011.2160997 \n \n© 2012 IEEE and Association for Computing Machinery \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/37539\/  \n \nAvailable in LSE Research Online: July 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \n \n1Congestion-Dependent Pricing and\nForward Contracts for Complementary Segments\nof a Communication Network\nMiklo´s Reiter and Richard Steinberg, Member, IEEE\nAbstract—Congestion-dependent pricing is a form of traffic\nmanagement that ensures the efficient allocation of bandwidth\nbetween users and applications. As the unpredictability of con-\ngestion prices creates revenue uncertainty for network providers\nand cost uncertainty for users, it has been suggested that forward\ncontracts could be used to manage these risks. We develop a novel\ngame-theoretic model of a multi-provider communication net-\nwork with two complementary segments, and investigate whether\nforward contracts would be adopted by service providers. Service\non the upstream segment is provided by a single Internet Service\nProvider (ISP) and priced dynamically to maximize profit,\nwhile several smaller ISPs sell connectivity on the downstream\nnetwork segment, with the advance possibility of entering into\nforward contracts with their users for some of their capacity.\nWe show that the equilibrium forward contracting volumes are\nnecessarily asymmetric, with one downstream provider entering\ninto fewer forward contracts than the other competitors, thus\nensuring a high subsequent downstream price level. In practice,\nnetwork providers will choose the extent of forward contracting\nstrategically based not only on their risk tolerance, but also on the\nmarket structure in the interprovider network and their peers’\nactions.\nIndex Terms—Internet, contracts, traffic control (communi-\ncation), communication systems, communication system traffic,\ngame theory, economics.\nI. INTRODUCTION\nThe pricing for Internet service is currently based on access\nbandwidth and usage. However, with the growing diversity of\napplications using the Internet, there is considerable interest\nin designing a future Internet architecture that would allow\nusers to indicate the value they place on network service\nby purchasing end-to-end Quality of Service (QoS) from the\nservice provider.\nCongestion-dependent pricing for communication networks\nhas been proposed [2]–[7] as a method of traffic manage-\nment that can efficiently allocate bandwidth among users—\ne.g. households, small businesses, large service providers—\nwho place different value on their applications. Congestion-\ndependent pricing ensures that users have an incentive to\ncontrol congestion. The highly influential paper of Gibbens\nand Kelly [2] proposed a mechanism to implement usage-\nbased charging. In that scheme, prices are set on the basis\nof aggregate traffic and communicated periodically to users,\nwho can then decide for themselves how to best satisfy their\nrequirements at the given price.\nThis paper is an extended version of a paper, “Forward Contracts for\nComplementary Segments of a Communication Network” that was presented\nat IEEE INFOCOM, San Diego, CA, March 15–19, 2010.\nFinancial contracts could be used to provide more pre-\ndictable prices to both service providers and users in a network\nwith congestion pricing. Semret and Lazar and their co-\nauthors published a series of papers on bandwidth pricing\nand contracts. These include Semret and Lazar [8], which\nproposes a market for circuit switched calls, wherein calls are\nadmitted or rejected at or soon after their arrival time and, if\nadmitted, receive a fixed allocation of capacity and have the\noption of securing the resource at a guaranteed maximum price\nfor a guaranteed minimum duration. The reservation fee is\ndetermined using the Black-Scholes option pricing approach.\nSemret, Liao, Campbell and Lazar [9] consider a game-\ntheoretic model of capacity provisioning in a differentiated\nservices Internet, where the players consist of one capacity\nseller per network, one broker per service per network, and\na set of network users. The purchase of forward contracts\nby the network users is proposed by Anderson et al. as a\n“Contract and Balancing Mechanism” [10], which is shown to\ngive users an incentive to control congestion, while avoiding\nthe network provider’s perverse incentive to cause congestion.\nOn the other hand, Yuksel et al. [11] propose a “contract-\nswitched” Internet, featuring a dynamic inter-provider pricing\nsystem to provide end-to-end QoS, in conjunction with longer-\nterm financial contracts used for risk management.\nIn this paper, we ask whether long-term forward contracts\nwould be offered to users in a future Internet with a dynamic\ninter-provider pricing system. Our analysis differs from the\nabove papers by considering the fraction of a provider’s capac-\nity to be funded by long-term contracts as a strategic variable.\nWhile our analysis is motivated by contracts between Internet\nService Providers and end-users, our model is sufficiently\ngeneral to be applicable to contracting by large corporate\ncustomers, as considered in [10].\nTo study the dynamic interactions between multiple network\nproviders in a tractable setting, we develop a two-stage model\nof bandwidth sold on two complementary1 segments of a\nmulti-provider communication network by means of dynamic\npricing (a spot market). Specifically, the upstream segment is\nprovided by a single large Internet Service Provider, denoted\nUISP, and the downstream segment is provided by several\nsmaller ISPs, denoted ISP1, ISP2, . . . , ISPn. The upstream\nISP connects the downstream ISPs to the Internet backbone. A\nschematic diagram of the business relationships is displayed in\n1Two services are said to be complementary if they are used together\nbecause they have little or no value when used separately.\n2· · ·\np1 p2 pn\npU\nISP1 ISP2 ISPn\nUISP\nInternet\nbackbone\nCustomers\nFigure 1. Network diagram\nFigure 1. Foros, Kind, and Sørgard [12] point out that the ques-\ntion of whether backbone providers have incentives to abuse\ntheir potential market power has received much attention, both\ntheoretically and in antirust cases. They analyze the interplay\nbetween firms and regulatory authorities in different countries\nby considering a scenario with a single backbone provider.\nIn the first stage of our model, the downstream ISPs choose\nthe capacity to sell using forward contracts. In the second\nstage, all ISPs set prices to maximize their respective revenue.\nCustomers must purchase the same amount of bandwidth\nupstream and downstream in order to use the network services.\nThis paper is organized as follows. Section II presents an\noverview of our two-stage model. In section III we describe\na novel extension of the Bertrand-Edgeworth pricing game\nto model the second-stage interaction between the upstream\nISP and the capacity-constrained downstream ISPs competing\nin prices with each other. We show in section IV that,\nfor sufficiently low market potential, downstream prices are\ncompeted down to marginal cost, while for sufficiently high\nmarket potential, there may be multiple pure-strategy Nash\nequilibrium outcomes, with different divisions of the total in-\ndustry profit between the upstream and downstream providers.\nWe assume the large upstream ISP has all the bargaining power\nand can choose which equilibrium will arise. In the region of\nintermediate market potential, we find an equilibrium point\nusing mixed strategies for the downstream ISPs (section V).\nWith uncertain future demand for network service, providers\nhave an incentive to enter into forward contracts in the first\nstage. However, the extent of forward contracting changes the\ndynamic price outcome in the second stage. In section VI\nwe use the pricing analysis to investigate the downstream\nISPs’ incentives for using forward contracts to fund their\nbandwidth. We find that a downstream ISP choosing a low\ncontracting volume is able to raise the general downstream\nprice level, allowing its competitors to contract more. A pure-\nstrategy Nash equilibrium of contracting volumes, if it exists,\nmust have a unique lowest volume of contracting. We further\nprove that an increase in this lowest volume has a nega-\ntive marginal externality2 on other downstream ISPs’ utility,\nwhereas an increase in any other contracting volume creates\npositive marginal externalities. In section VII, we present\nconclusions. In order to aid readability, we have relegated the\nmore technical aspects of the proofs of the first two theorems\nto three lemmas, which are proved in the appendix.\nII. MODEL OVERVIEW\nWe consider the following two-stage contracting and pricing\ngame played by UISP and ISP1, . . . , ISPn. In the first stage,\nthe ISPi simultaneously choose to sell capacities 0≤ fi ≤ k\nby means of forward contracts, where k is each ISPi’s total\ncapacity. This bandwidth is sold at a price which is fixed in\nthe first stage.\nIn the second stage, the providers UISP and ISP1, . . . , ISPn\nsimultaneously set prices pU and p1, . . . , pn, to maximize\nprofits piU and pi1, . . . , pin from their uncontracted capacity.\nThe second-stage profits are functions of the prices and the\nforward contracts fi chosen in the first stage.\nThe price sensitivity of bandwidth demand is not known\nat the time of contracting, but dynamic pricing allows the\nISPs to choose their second-stage prices based on the realized\nprice sensitivity. We therefore model the price sensitivity β\nas a random variable which is revealed between the two\nstages of the game. This means that a risk-averse ISPi has\nan incentive to enter into forward contracts to hedge against\ndemand uncertainty and maximize its total expected utility\nΠi(f1, . . . , fn) = EβU (Ii + Eppii), (1)\nwhere Eβ denotes expectation over the random price sensi-\ntivity β, U is ISPi’s increasing and strictly concave utility\nfunction, Ii is ISPi’s income derived from forward contracting,\nEp denotes expectation over the second-stage mixed strategy\nprices, and pii is ISPi’s second stage profit. Although the\nincome Ii from forward contracting is fixed during the first\nstage and so does not depend on the prices realized during\nthe second stage, we will assume that it does depend on\nthe expected second-stage prices EβEppi, as this is the fair-\nmarket level at which risk-neutral users are willing to enter\ninto forward contracts.\nBefore we can fully define and analyze the first-stage\ncontracting game in section VI, we first need to develop the\nsecond-stage pricing model.\nIII. PRICING MODEL\nWe model the second-stage behavior of the downstream\nISPs as “Bertrand-Edgeworth” price competition with capacity\nconstraints, first studied by Edgeworth who showed that the\nduopoly case might not have an equilibrium in prices [13].\nThe formulation of the problem with the “rationing rule”\nconsidered here is due to Levitan and Shubik [14]. They\nfound that prices are competed down to the perfectly com-\npetitive level equal to marginal cost when demand is low;\n2An externality of an economic transaction is an impact on a party that is\nnot directly involved in the transaction. The marginal externality of an ISP’s\ncontracting strategy is the impact of a unit increase in that ISP’s contracting\nvolume.\n3and there is a pure-strategy Nash equilibrium, a pair of prices\nsuch that neither firm can increase its profit by unilaterally\nchanging its price when demand is high. For the interme-\ndiate region of demand, they derived a Nash equilibrium in\nmixed (random) strategies. Vives [15] established the mixed-\nstrategy equilibrium for the case of symmetric oligopoly with\nmore than two competitors and proved convergence to the\nperfectly competitive price as the number of firms increases.\nFor any fixed choice of upstream price pU , our downstream\npricing model differs by taking into account forward contracts\npreviously sold by the ISPi for diverse fractions of their\nbandwidth. An important analytic contribution of this paper\nis the characterization of the mixed-strategy equilibrium for\nthis more complicated asymmetric model. This result is used\nto find an equilibrium for the full second-stage pricing game\nwhere UISP and the ISPi choose prices simultaneously.\nWe assume that UISP is a large provider connecting the ISPi\nto the Internet backbone and has all the bargaining power.\nThus, where the second-stage pricing game has multiple\nequilibria, the equilibrium with largest pU arises. In the special\ncase of n = 1, ISP1 is another monopolist and our game\ndescribes a bilateral monopoly.\nOn the other hand, where the pricing game has no pure-\nstrategy Nash equilibrium and prices fluctuate, a realistic\nanalysis needs to take into account the timescales over which\nproviders are likely to adjust their prices. This in turn de-\npends on the technologies used for price updates. While the\ndownstream providers can directly broadcast their prices to\nlocal users connected to their networks every few seconds,\nthis approach does not scale to a large multi-provider network\nsuch as the Internet. The monopolistic transit provider is more\nlikely to make use of a general pricing system. Proposals for\nimplementing inter-provider pricing by extending the Border\nGateway Protocol (BGP) [16] have been made by [17], [18].\nSuch a system would propagate price changes over the BGP\nconvergence timescale of several minutes. For this reason, we\nassume that the downstream ISPs’ prices are updated on a\nshorter timescale than the upstream ISP’s price, and we model\nthe downstream ISPs’ behavior by mixed strategies and the\nupstream ISP’s behavior by a pure strategy.\nThe bandwidth demand DU on the upstream ISP’s network\nis the sum of the bandwidth demands Di served by each ISPi\non the complementary network segment, i.e.,\nDU =\nn∑\ni=1\nDi. (2)\nWe assume the costs of building the firms’ infrastructure are\nsunk, and zero marginal costs are incurred during operation\nof the network. According to Odlyzko [19], “marginal costs\nare zero up to the point where congestion occurs and forces\naddition of new capacity.” Of course, ISPs also incur non-\nbandwidth marginal costs, such as the costs of billing and\ncustomer support. However, any constant marginal costs can\nbe normalized to zero by redefining the prices, provided the\nmarginal costs incurred by the competing downstream ISPs\nare equal. Let the upstream ISP’s payoff be\npiU = pUDU . (3)\nSuppose each ISPi has previously sold capacity fi by means\nof forward contracts, so his (second-stage) payoff is3\npii = pi(Di−fi). (4)\nIn order to obtain closed-form expressions for the equilib-\nrium, we work with a linear demand function [14], which has\nbeen used in the network pricing literature, e.g., [20],\ndmarket(p) = α− βp, (5)\nwhere the total price p ≡ pU + pm and pm is the price\ncharged by the marginal ISPi with a positive market share,\nthat is, the highest price charged by any ISPi with a positive\nmarket share. The downstream ISPs’ incentives for choosing\ntheir contracting volumes fi under demand uncertainty are to\nbe discussed in section VI. For the first-stage pricing model,\nwe suppose simply that the market potential4 α and the\nprice sensitivity β are given non-negative constants, and the\ncontracting volumes are given constants with 0 < fi < k for\nsome k.\nAssume the upstream ISP is not subject to any capacity\nconstraint, other than the total capacity nk resulting from the\ncapacity of the complementary network segment. To determine\nthe market share of each ISP, we use the rationing rule\nmaximizing consumer surplus chosen by [14], [21], which can\nintuitively be seen as a “water-filling” model: demand fills the\ndownstream ISPs’ capacities in increasing order of price, up\nto the point where the total demand at the next ISPi’s price\nwould be insufficient to leave any market share to that ISPi.\nDemand is split equally between several ISPs with the same\nprice where there is not enough demand to fill their networks\ncompletely. An implicit economic assumption in the “water-\nfilling” model is that there is no income effect5 on bandwidth\nconsumption.\nMore formally, “water-filling” specifies the bandwidth Di\nprovided by ISPi and the total bandwidth provided by the\nupstream (and downstream) network DU by the following four\nconditions. The bandwidth provided by ISPi must satisfy the\ncapacity constraint\n0 ≤ Di ≤ k, (6)\nthe capacity of ISPi must be exhausted if market demand at\nprice pi exceeds the total bandwidth used in the network\ndmarket(pU+pi) > DU ⇒ Di=k, (7)\nthe bandwidth provided by ISPi must be zero if market\ndemand at price pi is less than the total bandwidth used in\nthe network\ndmarket(pU+pi) < DU ⇒ Di=0, (8)\nand, finally, demand splits equally between ISPs choosing the\nsame price\npi=pj ⇒ Di=Dj . (9)\n3A choice of price pi such that Di < fi can be interpreted as ISPi\npurchasing bandwidth from the customers.\n4The market potential is the maximum achievable demand, which is given\nby the limit of the demand function as the price goes to zero.\n5The income effect occurs when a decrease in the price for a good, other\nthings remaining the same, will leave the consumer with more income left\nover, some of which will be spent on buying more of the good.\n4In the rest of this paper, we shall assume without loss\nof generality that the ISPi are ordered by their contracting\nvolumes as\n0 < f1 ≤ f2 ≤ · · · ≤ fn < k.\nIV. PURE-STRATEGY EQUILIBRIUM ANALYSIS\nThe equilibrium outcome of the pricing game depends on\nthe available bandwidth capacity compared to the market po-\ntential. More precisely, the following definition partitions the\nrange of market potential α into three regions by comparing\nit with the number n of ISPis, the capacity k of each ISPi,\nand the contracting volume f1 of firm 1.\nDefinition 1 (high, low, intermediate market potential). Let\n0 ≤ f1 < k. Consider the thresholds\nαl(f1) = 2(n−1)k + 2f1, (10)\nαh(f1) = (2n+1)k − f1. (11)\nWe say that market potential is f1-high if\nα ≥ αh(f1); (12)\nthat market potential is f1-low if\nα ≤ αl(f1); (13)\nand that market potential is f1-intermediate if\nαl(f1) < α < αh(f1). (14)\nAs we will now show, in the region of f1-high market po-\ntential network capacity is exhausted. Thus, the total upstream\nand downstream price p1 + pU is the congestion price, the\nlowest price at which demand can be satisfied. In the region\nof f1-low market potential, competition forces the downstream\nmarket price p1 down to marginal cost, which is normalized\nto zero. In the region of f1-intermediate market potential,\noscillatory price behavior follows, as will be explored in the\nnext section. The following theorem characterizes the pure-\nstrategy Nash equilibria in the three regions.\nTheorem 1. Pure-strategy equilibria are characterized as\nfollows:\n(i) If market potential is f1-high in the pricing game, then\nthere is a range of pure-strategy equilibria given by\np1 = p2 = · · · = pn (15)\nβ(p1 + pU ) = α− kn (16)\nk−βp1 ≤ fi ∀i (17)\nβpU ≥ kn, (18)\nmoreover, any f1-high pure-strategy equilibrium is of\nthis form.\n(ii) If market potential is f1-low, then there is a unique pure-\nstrategy equilibrium such that every ISPi sets a zero\nprice (pi=0) and UISP sets pU = α2β .\n(iii) If market potential is f1-intermediate and n = 1, then\nthere is a unique pure-strategy equilibrium given by\np1 =\nα− 2f1\n3β\n, pU =\nα+ f1\n3β\n. (19)\nIf market potential is f1-intermediate and n ≥ 2, then\nthere is no pure-strategy equilibrium.\nSome observations may be in order. To begin, note that the\ngeneral form of the result only differs between the bilateral\nmonopoly (n=1) and the true downstream oligopoly case (n≥\n2) when market potential is f1-intermediate and competition\nresults in the non-existence of any pure-strategy equilibrium\nin the oligopoly case. However, the boundaries between the\nregions depend on the number n of downstream firms. In the\nbilateral monopoly case, for example, the equilibrium with\np1 = 0 arises only if f1 ≥ α2 . In the absence of competition\nto force the downstream price to zero, this will only happen\nwhen market potential is so low that, given the contracting\nvolume f1, provider ISP1 cannot obtain a positive profit by\nsetting p1>0.\nOn the other hand, when n ≥ 2, the theorem says that a\npure-strategy equilibrium where the ISPi set positive prices\npi>0 is necessarily of the form given by (15)–(18). It is easy\nto check that this system is inconsistent when market potential\nis not f1-high, so an equilibrium of this form can only exist\nfor f1-high market potential.\nObserve that none of the results stated in Theorem 1 depend\non the contracting volumes f2, . . . , fn, but only on the lowest\ncontracting volume f1. In general, any contracting weakens\na downstream provider’s incentive to set a high price in the\npricing game, and the provider with the lowest contracting\nvolume, ISP1, will have the strongest incentive to do so. When\nUISP holds all the bargaining power and market potential is\nf1-high, the equilibrium with the highest pU arises, and the\nequilibrium price levels are determined by ISP1 and UISP, the\nother downstream ISPs being able to follow ISP1’s price p1.\nWhen the downstream ISPs have some of the bargaining\npower, the prices they set increase with market potential. The\ncompetition between the downstream ISPs is more significant\nin this case, and the game is closer to the classical Bertrand-\nEdgeworth price competition with capacity constraints.\nProof of Theorem 1: If market potential is f1-high, this\nallows the choice of p1, pU satisfying the outlined conditions.\nWe verify that these choices of prices do indeed constitute a\npure-strategy Nash equilibrium. Here, UISP serves a market\nof maximal size nk, and he can do no better by cutting his\nprice. The effect on UISP’s profit of a rise in pU is\n∂piU\n∂pU\n∣∣∣∣\n+\n= α− β(pU+p1)− βpU ≤ nk − βpU ≤ 0,\nat the chosen point as well as for any higher value of pU .\nTherefore, UISP has no incentive to change his strategy.\nSince firm ISP1’s market share α − β(pU+p1) − (n−1)k\nis equal to k at our chosen point, and f1 ≤ k, it follows that\nISP1 cannot gain by cutting his price. Moreover ISP1 cannot\nincrease his profit by raising his price either, since\n∂pi1\n∂p1\n∣∣∣∣\n+\n= α− β(pU + p1)− (n−1)k − βp1 − f1 ≤ 0, (20)\nwhere the inequality follows from (17). We have shown that\nthe chosen point is indeed a pure-strategy Nash equilibrium.\nIf market potential is f1-low, consider the set of strategies\npi = 0 ∀i, βpU = α2 . The price pU is clearly UISP’s best\n5response to the zero strategy chosen by the ISPi: it is the\nmonopolistic price. Observe that the total market served is\nDU =\nα\n2 ≤ (n−1)k + f1. Therefore, if ISPi were to choose\nany other price pi > 0, his profit would be negative. We\nhave established that this set of strategies is indeed a Nash\nequilibrium.\nConversely, consider any pure-strategy equilibrium given by\nthe tuple of prices (pU ; p1, p2, . . . , pn). We will start by\nshowing that the equilibrium satisfies (15)–(18) for n ≥ 2\nprovided some piDi > 0. Let i be such that piDi > 0 with\npi maximal. Suppose there was some j such that pj > pi.\nThen we would have Dj = 0 by the definition of i, so ISPj\nwould have an incentive to set pj equal to pi. Suppose now\nthat there was some j such that pj < pi. It follows from\nassumptions (7)–(8) that Dj = k and ISPj would be able to\nincrease his price to any pj < pi while retaining a market\nshare of k. Since fj < k, he would increase his profit by\ndoing so. Therefore, we have shown that all prices are equal\nin our equilibrium (15).\nSuppose we had D1<k. Then, if n≥2, ISP1 would have an\nincentive to increase his market share by cutting his price by\nany small amount. Hence we must have D1=k at equilibrium\nand the total market served is nk (16).\nOur previous argument shows that (17) and (18) must hold\nat equilibrium, so the ISP1 and UISP respectively have no\nincentive to increase their price. We have therefore shown\nthat every non-trivial pure-strategy equilibrium is of the given\nform.\nTo show the unique characterization for the equilib-\nrium, consider any pure-strategy Nash equilibrium in prices\n(pU ; p1, p2, . . . , pn). We use the following two results,\nwhich are direct consequences of the definitions of the down-\nstream ISPs’ demand and payoff functions (4)–(9) and of\nthe thresholds for high and low market potential given in\nDefinition 1.\n• Suppose market potential is not f1-low. Then there exists\n1≤ i≤n such that ISPi has piDi>0 in equilibrium.\n• Suppose market potential is not f1-high. If n ≥ 2 then\nevery ISPi has pi=0 in equilibrium.\nIf market potential is f1-high, the first result shows that\nsome piDi > 0 in equilibrium. For n≥2, we have shown that\nany such equilibrium must be of the form given by (15)–(18).\nFor n=1, the same argument shows (17)–(18), and it is easy\nto see that, if no provider has an incentive to cut his price,\nthen we have (16).\nIf market potential is f1-low, n ≥ 2, the second result shows\nthat every ISPi has piDi = 0. If market potential is f1-low\nand n = 1, it is easy to see that the unique pure-strategy\nequilibrium is given by p1 = 0, pU = α2β .\nIf market potential is f1-intermediate and n ≥ 2, the\ntwo results are contradictory, so there is no pure-strategy\nequilibrium. Finally, if market potential is f1-intermediate\nand n = 1, it is easy to see that the unique pure-strategy\nequilibrium is given by (19). This completes the proof of the\ntheorem.\nV. MIXED-STRATEGY EQUILIBRIUM ANALYSIS\nFrom Theorem 1, we know that for f1-intermediate market\npotential there is no pure-strategy Nash equilibrium when\nthe downstream market is a true oligopoly (n ≥ 2). Since\nthe downstream ISPs set their prices on a shorter timescale\nthan the upstream ISP, we assume they use mixed strategies,\ninterpreted as distributions of fluctuating prices following [14].\nThe pricing game can be shown to have an equilibrium point.\nTheorem 2. Suppose n ≥ 2 and market potential is f1-\nintermediate in the pricing game. Then there exists a unique\nequilibrium point (pU ; p1, . . . , pn) where the price pU is a\npure strategy for UISP and the prices pi are mixed strategies\nfor each ISPi, respectively, such that pU is locally optimal\nand each pi is optimal given the other ISPs’ strategies.\nLocal optimality of the upstream equilibrium price pU\nmeans that UISP has no incentive to make small-scale de-\nviations. The question of global optimality of pU is of little\nimportance, since the other ISPs can in any case not be\nexpected to maintain their strategies if UISP makes large-scale\ndeviations.6 However, an interesting question that remains\nis whether allowing UISP to play a mixed strategy leads\nto a different equilibrium point. We will consider this in\nTheorem 3.\nProof of Theorem 2: The proof of this theorem makes\nuse of a generalization of the solution of the Bertrand-\nEdgeworth oligopoly in [14], [15], taking forward contracting\ninto account.\nPreliminaries: Reduced Pricing Game: We start by con-\nsidering the reduced pricing game arising between the ISPi if\nUISP has precommitted to a fixed price pU . In analogy with\nDefinition 1, the following regions turn out to be useful.\nDefinition 2. Let 0 ≤ f1 ≤ k. We say that market potential\nis (f1, pU )-high if\nβpU ≤ α− k(n+ 1) + f1; (21)\nthat market potential is (f1, pU )-low if\nβpU ≥ α− k(n−1)− f1; (22)\nand that market potential is (f1, pU )-intermediate if\nα− k(n+ 1) + f1 < βpU < α− k(n−1)− f1. (23)\nThe form of the equilibrium depends on the level of market\npotential. The following lemma (proved in the appendix)\nshows that the reduced pricing game between the ISPi has\na unique pure-strategy equilibrium if market potential is\n(f1, pU )-high or low, and a unique mixed-strategy equilibrium\nif market potential is (f1, pU )-intermediate. For high market\npotential, every ISPi sets the same positive price, while for low\nmarket potential, every ISPi sets price zero. For intermediate\nmarket potential, each ISPi sets a random price chosen from\nan interval whose upper bound is a decreasing function in its\ncontracting volume fi. ISP1’s strategy may include setting the\nprice to the upper bound with a positive probability.\n6This argument for the stability of local equilibria is made in [22].\n6Lemma 1. The reduced pricing game has the following Nash\nequilibria.\n(i) If market potential is (f1, pU )-high, then there is a\nunique pure-strategy equilibrium, in which each ISPi\nchooses almost surely (i.e., with probability one)\npi =\nα− βpU − kn\nβ\n. (24)\n(ii) If market potential is (f1, pU )-low, then there is a unique\npure-strategy equilibrium, in which each ISPi chooses\nalmost surely\npi = 0. (25)\n(iii) If market potential is (f1, pU )-intermediate, then the\nreduced pricing game has the following unique mixed-\nstrategy equilibrium. Let\np11 ≡\nα− βpU − k(n−1)− f1\n2β\n(26)\np0 ≡ β(p\n1\n1)\n2\nk−f1 (27)\nh(p) =\np− p0\np(kn− α+ β(p+ pU )) (28)\nHj(p) = (k−fj)h(p). (29)\nDefine pi+11 ∈ [0, p11] to be the unique value satisfying\nh(pi+11 ) ≡\n(k−fi+1)i−1∏i\nj=1(k−fj)\nfor 2 ≤ (i+1) ≤ n (30)\npn+11 ≡ p0. (31)\nFor each 1 ≤ j ≤ n, define the function Gj(p) on\n[p0, p\nj\n1] piecewise for p ∈ [pi+11 , pi1], i ≥ j, i ≥ 2\nas\nGj(p) ≡\n\n(∏\nk≤i, k 6=j Hk(p)\n(Hj(p))i−2\n) 1\ni−1\nif p > p0,\n0 if p = p0.\n(32)\nThen the reduced pricing game has a unique mixed-\nstrategy Nash equilibrium, in which each ISPj plays a\nrandom pj ∈ [p0 pj1) according to the cumulative density\nfunction Gj , and ISP1 chooses the value p1 = p11 with\npositive probability 1− k−f2k−f1 .\nThe mixed strategies pi (as random variables) almost\nsurely satisfy\nmax\n{\n0,\nα− kn\nβ\n− pU\n}\n< pi <\nα− k(n−1)\nβ\n− pU ,\n(33)\nand ISPi’s expected payoff over every mixed strategy pj\nis\nEppii = p0(k−fi). (34)\nMoreover, Epmax ≡ Emaxi{pi} is everywhere a continuous\nfunction of pU . It is continuously differentiable in the region\nof (f1, pU )-intermediate market potential, but it is not differ-\nentiable at the boundary points βpU = α−k(n+ 1) +f1 and\nβpU = α− k(n−1)− f1 towards (f1, pU )-low and (f1, pU )-\nhigh market potential.\nExistence: This lemma allows us to complete the proof\nof Theorem 2 by showing the existence of the equilibrium\npoint. Let pU be such that\nmax {k(n−1), α−k(n+1)+f1} ≤ βpU ≤ min\n{\nkn,\nα\n2\n}\n.\nIt follows that\nβpU ≤ α\n2\n= α− α\n2\n< α− k(n−1)− f1,\nsince α > 2(n−1)k + 2f1.\nLet {pi}i be the mixed-strategy equilibrium of Lemma 1.\nThen the mixed strategy pi maximizes ISPi’s profit. To prove\nour theorem, we just need to show that UISP’s expected profit\nis at a local maximum at some pU in this range.\nFirst, suppose that βpU > α− k(n+ 1) + f1. Then UISP’s\nexpected profit is\nEpiU = pU (α− β(pU + Epmax)),\nwhich is locally maximized by pU if and only if\npU =\nα− βEpmax\n2β\n. (35)\nAt the upper bound of the allowed range for pU , if pU =\nmin\n{\nkn, α2\n}\n, then\nEpmax ≥ α\nβ\n− 2pU .\nAt the lower bound of the allowed range, if βpU = k(n−\n1) > α− k(n+ 1) + f1, then\nEpmax ≤ α− k(n−1)\nβ\n− pU = α\nβ\n− 2pU .\nSince Epmax is continuous in pU , the Intermediate\nValue Theorem shows that there exists a value p∗U ∈[\nk(n−1), min{kn, α2 }] such that (35) holds.\nOn the other hand, at the lower bound βpU = α −\nk(n+ 1) + f1 ≥ k(n− 1) the mixed-strategy equilibrium\nof pi turns out to be the pure-strategy equilibrium given by\npi = Epmax = α−βpU−knβ <\nα\nβ − 2pU since βpU < kn.\nHere, by the Intermediate Value Theorem, there exists a\nvalue p∗U ∈\n(\nα− k(n+1) + f1, min\n{\nkn, α2\n}]\nsuch that (35)\nholds. Since βp∗U > α−k(n+1)+f1, the total demand served\nby UISP retains its functional form in some neighborhood of\np∗U , and p\n∗\nU does indeed locally maximize UISP’s profit.\nUniqueness: To prove that there is only one equilibrium\npoint with the given properties, we first need a technical\nlemma, proved in the appendix, on the variation with the\nconstant price pU of the expected maximum price chosen by\nan ISPi.\nLemma 2. Suppose market potential is f1-intermediate.\nLet the expected maximum downstream price be Epmax =\nEpmax (pU , (fi)ni=1) as specified in Lemma 1. Let p∗U be\nthe pure strategy followed by UISP at the equilibrium point\nconstructed above. Then, at p∗U , the function Epmax satisfies\n∂Epmax\n∂pU\n∣∣∣∣\npU=p\n∗\nU\n> −2. (36)\n7Consider any equilibrium point (pU ; p1, . . . , pn), where\npU is a locally optimal pure strategy and each pi is an\noptimal mixed strategy. It follows from the non-existence of\na pure-strategy equilibrium, proved in Theorem 1, that market\npotential is (f1, pU )-intermediate.\nConsider the function\nf(pU ) = α− 2βpU − βEpmax(pU ).\nAt any equilibrium point satisfying our assumptions, we have\nf(pU ) = 0. We have already shown the existence of such\na point pU = p\n(1)\nU . It follows from Lemma 1 that f is\ncontinuously differentiable. By Lemma 2 f ′(p(1)U ) = −2β −\nβ ∂Epmax∂pU < 0.\nSuppose, for a contradiction, that there exists p(2)U 6= p(1)U\nwith the same properties. Without loss of generality p(1)U <\np\n(2)\nU . It follows from the sign of the derivative of f that we\ncan find 0 < \u000f1, \u000f2 < 12 (p\n(2)\nU −p(1)U ) such that f(p(1)U +\u000f1) < 0\nand f(p(2)U − \u000f2) > 0. Since f is a continuous function, the\nIntermediate Value Theorem gives p(3)U ∈ (p(1)U +\u000f1, p(2)U −\u000f2)\nsuch that f(p(3)U ) = 0.\nInductively, we obtain an infinite sequence\np\n(1)\nU , p\n(2)\nU , p\n(3)\nU , . . . of distinct points in [p\n(1)\nU , p\n(2)\nU ] such that\nf(p\n(1)\nU ) = f(p\n(2)\nU ) = · · · = 0. By the Bolzano-Weierstrass\nTheorem, this sequence must have an accumulation point pU .\nClearly then f(pU ) = 0 and f ′(pU ) = 0, which contradicts\nLemma 2. We have therefore established uniqueness of\nUISP’s equilibrium price p(1)U . By Lemma 1, the equilibrium\npoint is unique.\nOne remaining question is whether allowing the upstream\nISP to play any mixed strategy gives rise to a different\nequilibrium. It turns out that this is not the case for mixed-\nstrategy Nash equilibria where bandwidth demand can be\nserved completely and is sufficient to fill all but one down-\nstream ISPs’ networks almost surely.\nTheorem 3. Let market potential be f1-intermediate. Suppose\nthere exists a mixed-strategy Nash equilibrium in the pricing\ngame such that almost surely\nk(n−1) ≤ α− β(pU+pi) ≤ kn. (37)\nThen pU is a pure strategy and the equilibrium is the equilib-\nrium point given in Theorem 2.\nProof of Theorem 3: Let\npU = sup{p : P{pU <p} = 0},\npU = inf{p : P{pU >p} = 0}.\nInequality (37) must still hold almost surely if UISP plays\nany pure strategy pU ∈ [pU , pU ]. For any such pure strategy,\nUISP’s expected profit is\nEpiU (pU ) = pU (α− βpU − βEpmax).\nThis is a quadratic function with a unique maximum on the\ndomain pU ∈ [pU , pU ]. Therefore, UISP plays a pure strategy.\nGiven the forward contracts entered into by the downstream\nproviders, we have thus completely characterized the ISPs’\npricing behavior. In general, the size of the market potential\nrelative to the available capacity determines whether the game\nhas a pure or mixed-strategy equilibrium.\nWhen market potential is low, there is a pure-strategy Nash\nequilibrium with downstream prices equal to zero or marginal\ncost. The downstream ISPs compete the price down in this\ncase, or, for a single downstream firm operating as part of\na bilateral monopoly, the capacity sold by forward contracts\nabsorbs all demand.\nWhen market potential is high, there is a range of pure-\nstrategy Nash equilibria with different divisions of the same\ntotal network price between the upstream and downstream\nindustries. Bandwidth demand attains the level of available\ncapacity. At this point the total price is equal to the value of\na marginal unit of capacity. This price is commonly referred\nto as the congestion price. The balance of bargaining power\nbetween the firms determines which equilibrium arises. When\nthe upstream ISP has all the bargaining power, the fraction\nof the total income obtained by the downstream industry is a\ndecreasing function of the lowest contracting volume f1, but\nis independent of all other contracting volumes.\nFor intermediate market potential, there is a pure-strategy\nNash equilibrium only in the case of a bilateral monopoly\n(and capacity is not exhausted in this case). For a downstream\noligopoly (n ≥ 2), there exists an equilibrium point consisting\nof optimal mixed strategies for each downstream ISP and a\nlocally optimal pure strategy for the upstream ISP.\nDespite the different pricing outcome in the two non-trivial\ncases of intermediate and high market potential, the next\nsection shows that the incentives for forward contracting can\nbe analyzed in a uniform way over both regions.\nVI. FORWARD CONTRACTING\nHaving analyzed the second-stage pricing subgame in sec-\ntions III through V, by backward induction we can turn\nour attention to the first stage choice of forward contract-\ning in the game described in section II. In particular, we\nwill analyze the network providers’ choice of contracting\nunder uncertain bandwidth demand. We will establish that\nthe equilibrium contracting volumes are always asymmetric,\nwith one provider choosing the unique lowest contracting\nvolume, before deriving the form of the externalities within\nthe oligopoly that are due to the choice of contracting volumes\nin equilibrium. The results of the previous sections show\nthat the lowest contracting volume is an important factor\nin determining second-stage prices. In the case of the pure-\nstrategy equilibrium outcome, the lowest contracting volume\nis the only contracting volume that determines the second-\nstage outcome. As the smallest contracting volume increases,\ndownstream prices decline, hurting all downstream providers.\nHowever, the firm with the smallest contracting volume is\nclearly subject to more price risk than the other providers.\nWe now relax the assumption that 0 < fi < k to allow\ncapacities 0≤ fi≤ k sold by forward contracting. When some\nfi= 0 or fi=k, we assume the outcome of the second-stage\npricing game is the continuous extension of the pure-strategy\n8equilibrium of Theorem 1 or the equilibrium of Theorem 2,\nas appropriate.7\nWe formally define the first-stage income from forward\ncontracts sold at the expected second-stage price as\nIi = fiEβEppi. (38)\nRecall from Definition 1 that the market potential α is 0-\nhigh if α≥(2n+1)k and 0-low if α≤2(n−1)k. In the case of\n0-high market potential, it is easy to show that a pure-strategy\nNash equilibrium of contracting volumes exists and all but one\ncontracting volumes are maximal f2 = f3 = · · · = fn = k in\nequilibrium. In the more general case where we only know that\nmarket potential is not 0-low (so the downstream ISPs may\nnot compete prices down to zero in the second stage), we do\nnot know whether there is a pure-strategy Nash equilibrium\nin the first-stage choice of contracting volumes. However, any\nsuch equilibrium must satisfy the following result.\nTheorem 4. Suppose market potential is not 0-low and the\nISPs’ second-stage moves are the ones predicted by Theo-\nrems 1 and 2, assuming the greatest pU when there are mul-\ntiple equilibria. Suppose there is a pure-strategy equilibrium\nof positive first-stage contracting volumes, so without loss of\ngenerality\n0 < f1 ≤ fi for every i. (39)\nThen the lowest contracting volume is unique, i.e.,\nf1 < fi for every i > 1. (40)\nThus when market potential is not 0-low, any contracting\nequilibrium where the downstream ISPs obtain positive pay-\noffs must be asymmetric. A risk-averse provider would seek to\nset a high contracting volume as insurance against price risk,\nhoping that some other provider will choose a low contracting\nvolume and thereby raise the downstream second-stage price\nlevel.\nHow would the lowest contracting ISPi be chosen in\npractice? Although no provider would want to be the one\nchoosing the lowest contracting volume, such a provider may\narise naturally in practice, for example, due to asymmetries\nin information, risk aversion, or timing. Nevertheless, the lack\nof symmetric equilibrium may be a source of uncertainty for\nnetwork providers considering investment into bandwidth.\nProof of Theorem 4: Clearly market potential is not f1-\nlow, since ISP1 can achieve a positive profit by choosing a\n7It is easy to show that this extension is well-defined and constitutes\nan equilibrium. However, when fi = k the equilibrium may no longer be\nuniquely characterized as above. In this case ISPi is indifferent between two\nprices if even the higher one guarantees full network utilization. This leads\nto the emergence of equilibria where ISPi can raise his price without any\nloss of second-stage income, violating the law of one price. To exclude such\nunrealistic equilibria, our construction explicitly restricts attention to equilibria\nthat are the limit of equilibria arising when every fj<k.\nWhen fi=0, additional equilibria exist where prices are set so high that\nzero demand is served by the network DU = 0. Such equilibria, where the\nISPs effectively refuse to interconnect are unrealistic if another equilibrium\nexists where all ISPs have positive profits, as is the case in the regions of high\nand intermediate market potential. These equilibria disappear if at least one\nISPi has fi > 0, as ISPi then has an incentive to set pi =0. In the region\nof low market potential, fi=0 again leads to additional equilibria, where the\ndownstream ISPs have zero profit.\nsufficiently low contracting volume f1> 0, subject to market\npotential not being 0-low.\nSuppose first that market potential is f1-high. The second-\nstage subgame has a pure-strategy equilibrium, which is in-\ndependent of fj , for j > 1. Since ISPj , j > 1, is strictly risk-\naverse, he has an incentive to choose fj>f1.\nSuppose that market potential is f1-intermediate instead.\nSuppose, for a contradiction, that f2=f1. We will show that,\nif ISP1 has no incentive to choose a lower contracting volume,\nthen he must have an incentive to choose a higher one. For\neach β, ISP1’s profit varies with f1=f2 according to\nd\ndf1\n∣∣∣∣\n±\n(Eppi1 + I1) = (p0(β)(k−f1) + f1EβEp1)\n= −p0 + (k−f1)\n(\n∂p0\n∂f1\n∣∣∣∣\n±\n+\n∂p0\n∂pU\ndEp∗U\ndf1\n∣∣∣∣\n±\n)\n+ EβEp1 + f1Eβ\n(\n∂Ep1\n∂f1\n∣∣∣∣\n±\n+\n∂Ep1\n∂pU\ndEp∗U\ndf1\n∣∣∣∣\n±\n)\n,\nwhere\ndEp∗U\ndf1\n∣∣∣∣\n±\n= − ∂Epmax\n∂f1\n∣∣∣∣\n±\n(\n2 +\n∂Epmax\n∂pU\n)−1\n.\nIt is easy to check that\n∂Ep1\n∂f1\n∣∣∣∣\n−\n≤ ∂Ep1\n∂f1\n∣∣∣∣\n+\nand\n∂Epmax\n∂f1\n∣∣∣∣\n−\n≤ ∂Epmax\n∂f1\n∣∣∣∣\n+\n.\nTrivially\n∂p0\n∂f1\n∣∣∣∣\n−\n< 0 =\n∂p0\n∂f1\n∣∣∣∣\n+\n.\nSince ∂Ep1∂pU < 0 and\n∂p0\n∂pU\n< 0, clearly\nd\ndf1\n∣∣∣∣\n−\n(Eppi1 + I1) <\nd\ndf1\n∣∣∣∣\n+\n(Eppi1 + I1),\nso\n∂\n∂f1\n∣∣∣∣\n+\nEβU (Eppi1 + I1) >\n∂\n∂f1\n∣∣∣∣\n−\nEβU (Eppi1 + I1).\nThe right-hand side must be non-negative since ISP1 has no\nincentive to decrease his contracting volume. Hence the left-\nhand side is positive, and ISP1 can increase his expected\nutility by raising his contracting volume slightly. This is a\ncontradiction, so f2 6= f1 as required.\nWe now quantify the impact of one downstream provider’s\nchoice of contracting volume on its competitors’ utility.\nTheorem 5. Suppose\n0 ≤ f1 < f2 ≤ · · · ≤ fn < k, (41)\nand the ISPs’ second-stage moves are the ones predicted by\nTheorems 1 and 2, assuming the greatest pU when there are\nmultiple equilibria.\nIf market potential is f1-intermediate, an increase of f1 by\nISP1 results in a negative marginal externality on the other\ndownstream ISPs’ payoffs; and an increase of fj by ISPj , for\nany j > 1, results in a positive marginal externality on the\nother downstream ISPs’ payoffs.\n9If market potential is f1-high, an increase of f1 by ISP1\nresults in a negative marginal externality on the other down-\nstream ISPs’ payoffs; and an increase of fj by ISPj , for\nany j > 1, results in zero marginal externality on the other\ndownstream ISPs’ payoffs.\nChoosing a low contracting volume f1 is like providing a\n“public good”8 to the oligopoly, by raising the general price\nlevel, but doing so is privately costly to ISP1, as it implies\na low level of insurance against demand uncertainty. In the\ncase of f1-intermediate market potential, the choices of the\ncontracting volumes f2, . . . , fn result in externalities with\nthe opposite sign, so greater contracting volumes benefit other\nISPs. The presence of externalities means that downstream\nproviders have an incentive to coordinate their actions by\ncollusion. In this case, there is a particular incentive for a\nprovider to make side-payments to a competitor in return for\nthis provider agreeing to refrain from entering into forward\ncontracts.\nProof of Theorem 5: If market potential is f1-high, every\nISPi charges price p1 = k−f1β in the second stage. The theorem\nis trivial in this case.\nIf market potential is f1-intermediate, let p∗0 = p0(p\n∗\nU ) and\nEpp∗i = (Eppi)(p∗U ). Then:\ndp∗0\ndfi\n=\n∂p0\n∂fi\n− ∂p0\n∂pU\n∂Epmax\n∂fi\n(\n2 +\n∂Epmax\n∂pU\n)−1\n,\ndEp∗j\ndfi\n=\n∂Epj\n∂fi\n− ∂Epj\n∂pU\n∂Epmax\n∂fi\n(\n2 +\n∂Epmax\n∂pU\n)−1\n.\nWhen fi>f1, ∂p0∂fi =0,\n∂p0\n∂pU\n<0 and dp\n∗\nU\ndfi\n>0. Hence dp\n∗\n0\ndfi\n>0.\nOn the other hand, ∂p0∂f1 <0 and\ndp∗U\ndfi\n>0, so dp\n∗\n0\ndf1\n<0.\nSimilarly, when 1<i 6=j, ∂Epj∂fi ≥0 and\n∂Epj\n∂pU\n<0, so we have\ndEp∗j\ndfi\n>0. On the other hand, if j>1, ∂Epj∂f1 ≤0, so\ndEp∗j\ndf1\n<0.\nSince ISPj’s profit is the stochastic quantity Ij+Eppij where\nIj = fjEβEpp∗j and Eppij = p∗0(k−fj), the result follows\nimmediately.\nVII. CONCLUSIONS\nThis article started with the observation that a dynamic\npricing system for the Internet would ensure a more efficient\nallocation of resources. However, without forward contracting,\nproviders would be exposed to substantial price risk due to\nthe uncertainty in market demand. Could forward contract-\ning remove this price risk? In the absence of any strategic\ninteraction, e.g. in a communication network operated by a\nsingle provider, the answer is yes. When strategic interaction\nis considered in a multi-provider network, the situation is more\ncomplex. Forward contracting weakens a provider’s strategic\nincentive to charge high prices. Thus, in the presence of an\nupstream monopoly, the optimal forward contracting strategy\nis a trade-off between reducing price risk and seeking to ensure\nhigh prices in the future. When the contracting provider is part\n8A public good is a good that is non-excludable and non-rivalrous, i.e., it\nis not possible to exclude someone from using the good, and one individual’s\nusage does not prevent another from using it.\nof an oligopoly, the optimal contracting strategy will also be\ndependent on its competitors’ strategies.\nIn this paper, we have analyzed the incentives for forward\ncontracting by ISPs competing to supply bandwidth on a\ndownstream network segment, when a single ISP with signif-\nicant market power supplies bandwidth on a complementary\nupstream network segment. In order to determine the incen-\ntives for contracting, we have first studied the subsequent pric-\ning equilibrium which arises in different contracting scenarios.\nDepending on the level of market potential compared with\nthe available bandwidth capacity, the pricing outcome can be\ncharacterized as an equilibrium in pure or mixed strategies.\nWe can draw some conclusions on the choice of for-\nward contracts over two stages assuming the market’s price-\nsensitivity is random and the downstream firms are risk-averse.\nNote that in addition to the benefits, there are also risks associ-\nated with forward contracting. Provided that market potential\nis not so low that downstream prices are competed down to\nzero, we prove that any pure-strategy Nash equilibrium of\npositive contracting volumes must be asymmetric and have a\nunique lowest contracting volume. This gives rise to a version\nof the game of “Chicken”: as the provider who chooses this\nlowest contracting volume is exposed to the risk of more\nprice uncertainty than the other competitors, no selfish risk-\naverse provider would want to be the one choosing the lowest\nequilibrium contracting volume. In practice, this instability\nmay discourage investment into bandwidth. The reason is\nthat forward contracts have a negative impact on a provider’s\nstrategic incentives during the pricing stage. A natural low-\ncontracting provider may arise in the presence of asymmetries,\nfor example, in risk aversion or timing.\nWe further prove that the choice of contracting volumes\ncauses externalities, both negative and positive. An increase\nin the lowest contracting volume has a negative marginal\nexternality on other downstream ISPs. An increase in any\nother contracting volume has no externality for high market\npotential, but a positive marginal externality for intermediate\nmarket potential. In this sense, we can think of the downstream\nISP with the least forward contracting as providing a public\ngood to the oligopoly. A consequence is an incentive for\nproviders to collude on contracting choice, as discussed below.\nIn summary, for risk averse ISPs operating under this market\nstructure employing forward contracts, this paper provides\nsome initial practical guidelines. First, if an ISP believes\nthat every competitor will choose a high volume of forward\ncontracting, then he would be well-advised to choose a low\ncontracting volume. Second, a provider with a high contracting\nvolume might want to act in such a way that a low-contracting\nprovider would choose a lower contracting volume than would\nbe privately optimal. It could achieve this through side-\npayments or other strategic behavior. Third, given that forward\ncontracts have a negative impact on a provider’s strategic\nincentives during the pricing stage, network providers might\nwant to vertically integrate with the upstream provider in\norder to eliminate this effect. Of course, this paper is an\ninitial investigation into this topic, and our model is somewhat\nrestrictive. One interesting direction for future research would\nbe to consider interactions between ISPs linked by other\n10\nnetwork shapes.\nFinally, our framework could have other networking appli-\ncations; for example, similar risk-return trade-offs might exist\nin last-hop wireless spectrum markets, see [23].\nAPPENDIX\nProof of Lemma 1:\n(i) Assume market potential is (f1, pU )-high. At the given\nprices, assumptions (5)–(7) imply that capacity is ex-\nhausted, so no ISPi has an incentive to lower his price.\nFrom (21) and (24), it follows that βpi ≥ k−f1 ≥ k−fi,\nand it was shown in (20) that, together with the fact\nthat capacity is exhausted, this implies that ISPi has no\nincentive to raise his price. Therefore this point is indeed\na pure-strategy equilibrium.\nTo establish uniqueness, consider any pure-strategy equi-\nlibrium. Note that every ISPi must have a positive profit\nand, in particular, a positive market share Di > 0 in\nequilibrium, since ISPi can achieve a positive profit\nby choosing the price given in (24) regardless of its\ncompetitors’ strategies. It follows that any two ISPi and\nISPj must choose the same price pi=pj , since otherwise\nthe ISP with the lower price would have an incentive to\nraise its price.\nNext, assumptions (7)–(9) imply that, unless the price pi\nequals the value given in (24), either each downstream\nISP’s market share is less than its capacity k or the total\ndemand cannot be served by the downstream ISPs. In\nboth cases, a downstream ISP would have an incentive\nto change its price, which shows that (24) must hold in\nequilibrium. This establishes uniqueness.\n(ii) Assume market potential is (f1, pU )-low. If every\ndownstream network chooses a price of zero, then\nfrom (5), (22) the total demand satisfies dmarket ≤\nk(n−1) + f1. Assumptions (7)–(8) imply that ISPi’s\nsecond-stage profit when choosing pi > 0 is negative.\nTherefore, this point is a pure-strategy equilibrium.\nFor uniqueness, consider any pure-strategy equilibrium.\nWe will show that if pi> 0 then pii< 0 so ISPi has an\nincentive to set pi=0. Let ISPi be the network choosing\nthe highest price. First, if Di=0 then pii<0 is trivial.\nSecond, in the case where Di > 0, suppose there are\nm downstream ISPs choosing price pi. From assump-\ntions (7)–(9), the market share obtained by each is\nDi = (α− βpU − βpi − k(n−m))\/m < k, where the\ninequality follows from (22) and the fact that f1 < k.\nIf m> 1 then every provider choosing price pi has an\nincentive to just undercut the other providers choosing\nprice pi, contradicting the equilibrium assumption. On\nthe other hand, if m=1, then assumptions (7)–(9), (22)\nimply that pii<0. We have therefore shown uniqueness.\n(iii) Assume market potential is (f1, pU )-intermediate. The\nfollowing results are direct consequences of the defini-\ntions stated in the lemma.\n• We have\n0 < p0 < p\n1\n1 <\nk−f1\nβ\n. (42)\n• For p0 ≤ p ≤ p11, we have\nk(n−1) < dmarket(p+ pU ) < kn. (43)\n• The functions h(p) and H1(p) are continuous and\nstrictly increasing on [p0, p11], with H1(p0) = 0,\nH1(p\n1\n1) = 1.\n• We have\np0 = p\nn+1\n1 ≤ pn1 ≤ · · · ≤ p21 = p11, (44)\nwhere, for 1 < i < n, pi1 = p\ni+1\n1 if and only if\nfi = fi+1. Also pi1 > p0 since fi < k.\n• For any j, Gj is a continuous and strictly increasing\nfunction on [p0, p\nj\n1]. For j > 1, Gj(p\nj\n1) = 1.\nG1(p\n1\n1) =\nk−f2\nk−f1 .\n• Finally, for p0 ≤ p ≤ pi1, the cumulative density\nfunction of maxj 6=i{pj} satisfies\nG−i(p) ≡\n∏\nj 6=i, pj1>p\nGj(p) = Hi(p). (45)\nGiven this, we can show that the strategies defined in\nthe lemma form a Nash equilibrium. Note that by in-\nequality (43) and assumptions (7)–(8), if maxj 6=i{pj} >\npi, then ISPi’s market share Di = k, whereas if\nmaxj 6=i{pj} < pi, then ISPi’s market share is the\nresidual demand after the other (n− 1) downstream\nnetworks’ capacities are exhausted, Di = dmarket(pi +\npU )− k(n−1). Thus ISPi’s market share depends only\non pi and maxj 6=i{pj}.\nSince the probability distributions have no point mass at\nany p0 < p < p11, and at least one ISPj with j 6= i has\npj > p0 almost surely, the event that maxj 6=i{pj} = p\nhas zero probability for any p < p11.\nThus ISPi’s profit, when choosing some p0 ≤ p < pi1, is\nEpii(p) = (1−G−i(p))p(k−fi) +G−i(p)p(dmarket(p+\npU )− k(n−1)− fi) = p0(k−fi) = Epii(p0).\nMoreover, for ISP1, Epi1(p11) = p0(k−f1) = Epi1(p0).\nTo establish the equilibrium, we just need to prove that,\nconditional on the other ISPs’ strategies, no ISPi can\nincrease his profit by choosing a price p outside the\nsupport of Gi, [p0, pi1].\nFirst, since each ISPi can set price p0 for a market share\nof k, setting a lower price p < p0 leads to lower profits:\nEpii(p) = p(k−fi) < p0(k−fi) = pii(p0).\nSecond, if ISPi sets price pi1 < p ≤ p11, then by (44),\npj+11 ≤ p ≤ pj1 for some j. Let p(−j)max ≡ maxj 6=i{pj}\nand let G(−j)max be the cumulative density function of\np\n(−j)\nmax. Observe that, under the equilibrium strategies, for\npj+11 ≤ p ≤ pj1, we have\nG(−j)max(p) =\nj∏\nl=1\nGl(p) =\n(\nh(p)\nj∏\nl=1\n(k−fl)\n) 1\nj−1\nh(p)\n≥\n(\nh(pj+11 )\nj∏\nl=1\n(k−fl)\n) 1\nj−1\nh(p) ≥ Hi(p), (46)\nwhere the first inequality follows from the monotonicity\nof h and the second inequality follows from i ≤ j + 1.\n11\nThus ISPi’s profit is Epii(p) = (1−G(−j)max(p))p(k−fi)+\nG\n(−j)\nmax(p)p(dmarket(p+ pU )− k(n−1)− fi) ≤ Epii(p0),\nwhere the inequality follows from (43) and (46). This\nshows that ISPi has no incentive to set a price pi1 < p ≤\np11.\nIt now only remains to consider a third case where ISPi\nsets price p > p11. His profit function takes the form\nEpii(p) = p(dmarket(p + pU ) − k(n−1) − fi), which\nis a quadratic function attaining its maximum in (0, p11].\nHowever, from (26)–(27), (42) and fi ≥ f1, we have\nEpii(p11) = (k−f1)p0− (fi−f1)p11 ≤ Epii(p0), showing\nthat ISPi has no incentive to deviate by setting p > p11.\nThis establishes that ISPi has no incentive to deviate\nfrom his equilibrium strategy, and therefore the given\nmixed strategies form a Nash equilibrium.\nConversely, to prove uniqueness, consider any mixed-\nstrategy Nash equilibrium given by cumulative density\nfunctions Gj(p) = P{pj < p}. Consider the well-\ndefined low- and high-price thresholds for each ISPj\npj0 = sup{p : Gj(p) = 0},\npj1 = inf{p : Gj(p) = 1}.\nNote that\n• Every ISPj obtains a positive expected profit Epij\nin equilibrium. Indeed, we have already shown that\nISP1’s profit is positive when choosing p11 regardless\nof his competitors’ strategies. But ISP1 must then\nhave a positive low-price threshold p10 and any\ncompetitor ISPj can obtain a positive profit by\nslightly undercutting this price.\n• In equilibrium, there is sufficient capacity for the\ntotal demand at each low-price threshold:\nα− β(pj0 + pU ) ≤ kn;\nand each ISPj’s market share is positive even at his\nhigh-price threshold:\nα− β(pj1 + pU ) > k(n−1).\nIt is easy to check that the first inequality is required\nfor ISPj to have no incentive to play a mixed strat-\negy with a higher pj0, and that the second inequality\nis required for the ISPj with the highest price p\nj\n1 to\nhave no incentive to play a mixed strategy with a\nlower pj1.\nIt follows that every ISPj has the low-price threshold\np0 defined in (27), i.e. p\nj\n0 = p0 ∀j; every ISPj has the\nexpected profit given in (34), i.e. Epij = p0(k−fj); and\nISP1 has the high-price threshold p11 defined in (26), and\nno high-price threshold exceeds it: p11 = p\n1\n1 ≥ pj1 ∀j.\nDefine cumulative density functions for maxi6=j{pi} as\nbefore:\nG−j(p) =\n∏\ni6=j\nGi(p).\nFrom the equilibrium requirement that ISPj should\nhave no incentive to change his mixed strategy, it is\nstraightforward to verify the following. There exists an\nopen interval U ⊃ [p0, p11] such that whenever p ∈ U ,\nwe have\nG−j(p) ≥ Hj(p); (47)\nand, whenever G−j(p) > Hj(p), we have\n∃ \u000f > 0 : Gj(p− \u000f) = Gj(p+ \u000f). (48)\nBy the definition of pj1, Gj cannot be locally constant\nat pj1, so\nG−j(p\nj\n1) = Hj(p\nj\n1). (49)\nFurther, the following is easily shown:\n• Each Gj is continuous on (p0, p11]. (So the mixed\nstrategies have no point mass, except possibly at p0\nand p11.) Moreover, for j 6= 1, Gj has no point mass\nat p11, so\nGj(p\nj\n1) = 1. (50)\n• If fi < fj , then p\nj\n1 ≤ pi1. Whenever fi = fi+1,\nwe can re-order ISPi, ISPi+1, so that pi+11 ≤ pi1.\nLetting pn+11 ≡ p0, without loss of generality\npn+11 ≡ p0 ≤ pn1 ≤ pn−11 ≤ · · · ≤ p11 = p11. (51)\nThen (49)–(51) imply, for 2 ≤ i ≤ n:\nG−i(pi1) =\ni−1∏\nj=1\nGj(pi1) = Hi(p\ni\n1). (52)\n• We have p21 = p\n1\n1 = p\n2\n1.\nWe are ready to prove that the mixed strategies employed\nare indeed those of our constructed equilibrium.\nWe now prove by induction that, for each 2 ≤ i ≤ n:\n(a) pi1 = p\ni\n1,\n(b) Gj(p) = G˜ij(p) piecewise for p ∈ [pi+11 , pi1], i ≥ j,\nG˜ij(p) ≡\n\n(\n∏\nl≤i, l 6=j Hl(p))\n1\ni−1\n(Hj(p))\ni−2\ni−1\nif p > p0,\n0 if p = p0.\nFor the case i = 2, we already know p21 = p\n2\n1 = p\n1\n1,\nso (a) holds. For part (b), we have already shown\nthat Gj(p11) = 1 = G˜2j (p\n1\n1) for j 6= 1. For the case\nj= 1, equation (52) implies that G−2(p21) = G1(p\n1\n1) =\nH2(p\n1\n1) =\nk−f2\nk−f1 = G˜\n1\n1(p\n1\n1), so (b) holds.\nNow assume the inductive hypothesis holds for some\ni − 1 < n. We first show (a). Using part (b) of the\ninductive hypothesis for i−1 allows us to rearrange (52)\nas\nh(pi1) =\n(k−fi)i−2∏i−1\nj=1(k−fj)\n.\nThe unique solution of this equation is pi1 = p\ni\n1, by the\ndefinition (30) of pi1, so (a) holds.\nWe now show (b). In the case pi+11 = p\ni\n1, we have\nGj(p) = Gj(p\ni\n1) = G˜\ni−1\nj (p\ni\n1) = G˜\ni\nj(p\ni\n1) by the\n12\ninductive hypothesis and the definition (30) of pi1, so (b)\nholds.\nConsider the case pi+11 < p\ni\n1. For every p\ni+1\n1 ≤ p ≤ pi1,\nif p > p0, then\nGj(p) =\n(∏\nl≤i, l 6=j G−l(p)\n) 1\ni−1\n(G−j(p))\ni−2\ni−1\n. (53)\nTo establish (b), it is sufficient to show that G−l(p) =\nHl(p) for every l ≤ i, p ∈ (pi+11 , pi1): then Gj(p) =\nG˜ij(p) for p ∈ [pi+11 , pi1] by (53) (using continuity at the\ninterval bounds).\nSuppose, for a contradiction, that there exists some\nl ≤ i, p ∈ (pi+11 , pi1) such that G−l(p) 6= Hl(p).\nThen G−l(p) > Hl(p) by property (47). We start by\nshowing that, for this value p, we have Gj(p) > G˜ij(p)\nfor every j ≤ i. We show this separately for j such\nthat G−j(p) = Hj(p) and j such that G−j(p) > Hj(p).\nFirst, for every j such that G−j(p) = Hj(p), we have\nGj(p) > G˜ij(p) by (53). Second, for every l satisfying\nG−l(p) > Hl(p), define\npl = sup{q : G−l(q′) > Hl(q′) ∀p ≤ q′ ≤ q}. (54)\nBy the inductive hypothesis for i−1, property (48) does\nnot hold at pi1, so the supremum exists and pl ≤ pi1.\nG−l(pl) = Hl(pl) (55)\nfollows by continuity if pl < pi1, and by the inductive\nhypothesis for i − 1 if pl = pi1. Using expression (53)\nfor Gl(pl), equation (55), and inequality (47) for G−k,\nk 6= l, gives\nGl(pl) ≥ G˜il(pl). (56)\nNote that by the choice of l and (55), we must have\np < pl. From (54), for p ≤ q′ < pl, we have G−l(q′) >\nHl(q\n′), so property (48) implies that Gl is constant on\n(p, pl). Continuity at p and left-continuity at pl imply\nGl(p) = Gl(pl). From (56) and the fact that G˜il is strictly\nincreasing: Gl(p) = Gl(pl) ≥ G˜il(pl) > G˜il(p). Thus we\nhave shown that Gj(p) > G˜ij(p) for every j ≤ i.\nIt follows directly that, for every j ≤ i,\nG−j(p) =\n∏\nl≤i, l 6=j\nGl(p) > Hj(p).\nNext, note that the set S ≡ {p′ ∈ [pi+11 , p] : Gl(p′′) >\nG˜il(p\n′′) ∀p′ ≤ p′′ ≤ p, l ≤ i} is open in [pi+11 , p], since\neach Gl is locally constant at every point inside it, and\neach G˜il is increasing. Again, using the monotonicity\nof G˜il , it is easy to check that S = {p′ ∈ [pi+11 , p] :\nGl(p\n′) = Gl(p) ∀l ≤ i}, which is closed by continuity\nof Gl. But since S is non-empty, open and closed, it\nmust be the entire interval [pi+11 , p].\nTo obtain the desired contradiction, we consider the\ncases i = n and i ≤ n separately. First, in the case\ni = n, we have p0 = pi+11 ∈ S, so Gl(p0) > G˜il(p0)\nfor every l ≤ i. This implies that property (48) holds\nat p0, which contradicts the definition of p0. Second,\nin the case i < n, each Gl, l ≤ i, is constant on S,\nso G−(i+1) is constant on S. Thus G−(i+1)(p\ni+1\n1 ) =\nG−(i+1)(p) ≥ Hi+1(p) > Hi+1(pi+11 ), where the\ninequalities follow from (47) and the fact that Hi+1 is\nstrictly increasing. This contradicts (52). In both cases,\nwe have a contradiction, so we have shown part (b) of\nthe inductive hypothesis. This completes the inductive\nargument.\nSince Gj(p) = 0 for p ≤ p0, 1 ≤ j ≤ n, we have\nproved that the cumulative density functions specifying\nthe mixed strategies employed by the ISPj in any\nequilibrium coincide with those in the equilibrium we\nhave explicitly constructed. Hence the mixed-strategy\nequilibrium of our game is unique.\nContinuous differentiability of Epmax as a function of\npU is trivial inside the regions of (f1, pU )-high and -low\nmarket potential. For (f1, pU )-intermediate market potential,\nit is obvious that p11 and p0 are continuously differentiable\nfunctions of pU . The existence of a continuous derivative of\npi1 follows from p\ni\n1 = p\n1\n1 when fi = f1, and from h\n′(pi1) > 0\nby the implicit function theorem when fi 6= f1. We can write\nEpmax =\n∫ ∞\n0\n(1− P{pmax < p}) dp\n= p0 +\nn∑\ni=2\n∫ pi1\npi+11\n1−( i∏\nl=1\nHl(p)\n) 1\ni−1\n dp. (57)\nWe now check that Epmax is continuously differentiable\nwith respect to pU . The limits of each integral are continuously\ndifferentiable with respect to pU . Moreover, each integrand\nis continuously differentiable with respect to pU and with\nrespect to p, where the derivative with respect to pU can be\nbounded above by an integrable function independently of pU ,\nfor values of pU in some sufficiently small interval. These\nconditions are sufficient for continuous differentiability of each\nintegral with respect to pU . Therefore Epmax is a continuously\ndifferentiable function of pU for (f1, pU )-intermediate market\npotential. Continuity and lack of differentiability are easy to\nverify at the boundary points, completing the proof of the\nlemma.\nProof of Lemma 2: As we have seen in the proof\nof Lemma 1, the function Epmax satisfies the assumptions\nrequired for the existence of a continuous derivative which\ncan be found by differentiating the expression in (57) after\nsubstituting the definition of Hl given in (29):\n∂Epmax\n∂pU\n= −1\n2\n(\n1− k−f2\nk−f1\n)\n−Q, (58)\nwhere\nQ ≡\nn∑\nj=2\n∫ pj1\npj+11\nj\nj−1\n(\nh(p)\nj∏\nl=1\n(k−fl)\n) 1\nj−1\n∂h(p)\n∂pU\ndp. (59)\nThe proof that ∂Epmax∂pU is always greater than −2 is done in\ntwo parts: for δ ≡ α−2(n−1)k−2f1 smaller than 125 (k−f1),\n13\nand for δ greater than 209 (k−f1). (Note that these regions\noverlap.)\nConsider the first case, δ < 125 (k−f1). The function h is\nincreasing, and p ≤ pj1 in each integral in (59), so using (30):(\nh(p)\nj∏\nl=1\n(k−fl)\n) 1\nj−1\n≤ k−fj ≤ k−f1, (60)\nUsing j≥2 and (60) in (59):\nQ ≤ 2(k−f1)\nn∑\nj=2\n∫ pj1\npj+11\n∂h(p)\n∂pU\ndp\n= 2(k−f1)\n∫ p11\np0\nβ\n(\n1− p0\np11\n)\n(p11 − p)\np\n(\np11\np0\nβ(p11 − p0)− β(p11 − p)\n)2 dp ≡ Q.\nLetting γ ≡ p0\np11\n, with the change of variable t ≡ p−p0\np11−p0 , yields\nQ = 2γ\n(γ − 1)(log γ − log(1−γ)) + (2γ−1)\n(2γ−1)2 . (61)\nAlthough the evaluated integral is undefined for γ = 12 , an\napplication of L’Hoˆpital’s Rule shows that it can be extended\nto this point, giving a continuous function of γ on (0, 1). Note\nthat Q is an increasing function of γ.\nBy the definitions in Lemma 1, Epmax ≤ p11. From (35),\npU =\nα−βEpmax\n2β ≥ α−βp\n1\n1\n2β . Substituting this inequality into\nthe definition of p11 gives p\n1\n1 ≤ δ3β . This together with (27)\ngives γ = p0\np11\n=\nβp11\nk−f1 ≤ δ3(k−f1) ≤ 45 . Since Q is increasing\neverywhere on 0<γ<1 and Q( 45 )<\n3\n2 , it follows that Q(γ)<\n3\n2 for any 0 < γ ≤ 45 . Substituting f1 ≤ f2 and Q ≤ Q < 32\ninto (58) establishes the lemma for δ < 125 (k−f1).\nConsider now the second case, δ > 209 (k−f1). The following\nbound is straightforward to verify:\n∂h(p)\n∂pU\n≤ ∂h(p)\n∂p\n+\nh(p)\np\n. (62)\nSubstituting this inequality into (59) gives\nQ ≤ Q1 +Q2, (63)\nwhere\nQ1 ≡\nn∑\nj=2\n∫ pj1\npj+11\nj\nj−1\n(\nh(p)\nj∏\nl=1\n(k−fl)\n) 1\nj−1\n∂h(p)\n∂p\ndp,\nQ2 ≡\nn∑\nj=2\n∫ pj1\npj+11\nj\nj−1\n(\nh(p)\nj∏\nl=1\n(k−fl)\n) 1\nj−1\nh(p)\np\ndp.\nIntegrating:\nQ1 =\nn∑\nj=2\n(k−fj)j − (k−fj+1)j∏j\nl=1(k−fl)\n=\nk−f2\nk−f1 . (64)\nUsing j≥2 with p ≥ p0 and Epmax ≥ p0:\nQ2 ≤ 2\np0\n(p11 − Epmax) ≤ 2\n(\nk−f1\nβp11\n− 1\n)\n. (65)\nFrom Epmax ≥ p0 and (35) we have pU ≤ α−βp02β , whence\np11 ≥\nα+ βp0 − 2k(n−1)− 2f1\n4β\n.\nUsing the definition of p0, we can re-state this as\n(p11)\n2 − 4(k−f1)\nβ\np11 +\nδ(k−f1)\nβ2\n≤ 0.\nThus p11 is at least as large as the smaller root of the quadratic:\np11 ≥\n2(k−f1)\nβ\n(\n1−\n√\n1− δ(α)\n4(k−f1)\n)\n>\n2(k−f1)\n3β\n, (66)\nwhere the second inequality follows from the assumption that\nδ(α) > 209 (k−f1).\nWe now substitute (66) into (65), obtaining Q2 < 1.\nCombining (58), (63), (64) and Q2<1, we get\n∂Epmax\n∂pU\n> −1\n2\n(\n1− k−f2\nk−f1\n)\n− k−f2\nk−f1 − 1 ≥ −2,\nwhich establishes the lemma for δ > 209 (k−f1).\nREFERENCES\n[1] M. Reiter and R. Steinberg, “Forward contracts for complementary\nsegments of a communication network,” in Proc. INFOCOM, Mar. 2010.\n[2] R. Gibbens and F. Kelly, “Resource pricing and the evolution of\ncongestion control,” Automatica, vol. 35, pp. 1969–1985, 1999.\n[3] A. Ganesh, K. Laevens, and R. Steinberg, “Congestion pricing and user\nadaptation,” in Proc. INFOCOM, 2001, pp. 959–965.\n[4] J. Shu and P. Varaiya, “Pricing network services,” in Proc. INFOCOM,\n2003, pp. 1221–1230.\n[5] R. Steinberg, “Pricing internet service,” in Managing Business In-\nterfaces: Marketing, Engineering, and Manufacturing Perspectives.\nKluwer, Dordrecht, 2003, pp. 175–201.\n[6] C. Courcoubetis and R. Weber, Pricing Communication Networks.\nWiley, Chichester, 2003.\n[7] R. Srikant, The Mathematics of Internet Congestion Control.\nBirkhauser, Boston, 2004.\n[8] N. Semret and A. Lazar, “Spot and derivative markets in admission\ncontrol,” in 16th International Teletraffic Congress, Edinburgh, UK, Jun.\n1999.\n[9] N. Semret, R. Liao, A. Campbell, and A. Lazar, “Peering and provi-\nsioning of differentiated Internet services,” in Proc. INFOCOM, Mar.\n2000.\n[10] E. Anderson, F. Kelly, and R. Steinberg, “A contract and balancing\nmechanism for sharing capacity in a communication network,” Man-\nagement Science, vol. 52, no. 1, pp. 39–53, Jan. 2006.\n[11] M. Yuksel, A. Gupta, and S. Kalyanaraman, “Contract-switching\nparadigm for Internet value flows and risk management,” in Proc. IEEE\nGlobal Internet Symposium, 2008.\n[12] O. Foros, H. J. Kind, and L. Sørgard, “Strategic regulation policy in the\ninternet,” Journal of Regulatory Economics, vol. 30, no. 1, pp. 63–84,\n2006.\n[13] F. Y. Edgeworth, “The pure theory of monopoly,” in Papers Relating to\nPolitical Economy, vol. 1. Macmillan, London, 1925, pp. 111–142.\n[14] R. Levitan and M. Shubik, “Price duopoly and capacity constraints,”\nInternational Economic Review, vol. 13, no. 1, pp. 111–122, Feb. 1972.\n[15] X. Vives, “Rationing rules and Bertrand-Edgeworth equilibria in large\nmarkets,” Economics Letters, vol. 21, no. 2, pp. 113–116, Feb. 1986.\n[16] Cisco Systems, Inc., Internetworking Technologies Handbook, 4th ed.\nCisco Press, 2004, ch. 41.\n[17] J. Hwang, J. Altmann, H. Oliver, and A. Sua´rez, “Enabling dynamic\nmarket-managed QoS interconnection in the next generation internet\nby a modified BGP mechanism,” in IEEE International Conference on\nCommunications, 2002.\n[18] R. M. Mortier, “Internet traffic engineering,” Ph.D. dissertation, Univ.\nCambridge, Cambridge, UK, Oct. 2001.\n[19] A. M. Odlyzko, “The history of communications and its implications\nfor the Internet,” 2000.\n14\n[20] I. C. Paschalidis and J. Tsitsiklis, “Congestion-dependent pricing of\nnetwork services,” IEEE\/ACM Trans. Netw., vol. 8, no. 2, pp. 171–184,\nApr. 2000.\n[21] D. M. Kreps and J. A. Scheinkman, “Quantity precommitment and\nBertrand competition yield Cournot outcomes,” The Bell Journal of\nEconomics, vol. 14, no. 2, pp. 326–337, 1983.\n[22] M. Rothschild and J. E. Stiglitz, “Equilibrium in competitive insurance\nmarkets: An essay on the economics of imperfect information,” The\nQuarterly Journal of Economics, vol. 90, no. 4, pp. 629–649, Nov. 1976.\n[23] G. Kasbekar, S. Sarkar, K. Kar, P. K. Muthusamy, and A. Gupta,\n“Dynamic contract trading in spectrum markets,” in Proceedings of\n48th Annual Allerton Conference on Communication, Control, and\nComputing, 2010, pp. 791–799.\nMiklo´s Reiter received the B.A., M.Math. and\nthe Ph.D. degrees in mathematics and operations\nresearch from the University of Cambridge in 2003,\n2004 and 2007 respectively. He now works as Senior\nQuantitative Researcher at eValue FE Ltd., London.\nHis research interests include game theory and fi-\nnancial risk modelling.\nRichard Steinberg (M ’10) received the B.A. de-\ngree from Reed College, Portland, Oregon in 1976,\nthe M.Math. and Ph.D. degrees in combinatorics\nand optimization from the University of Waterloo,\nWaterloo, Ontario, Canada, in 1976 and 1979, re-\nspectively, and the M.B.A. from the University of\nChicago, Chicago, IL, in 1980.\nHe has worked at AT&T Bell Laboratories and\nhas served on the faculties of the University of\nChicago, Columbia University, and the University\nof Cambridge. He is currently Chair in Operations\nResearch and Head of the Management Science Group at the London School\nof Economics. His current research interests include Internet economics and\nauctions.\n"}