{"doi":"10.1029\/2009JD012481","coreId":"55663","oai":"oai:nora.nerc.ac.uk:11172","identifiers":["oai:nora.nerc.ac.uk:11172","10.1029\/2009JD012481"],"title":"Frost flower surface area and chemistry as a function of salinity and temperature","authors":["Obbard, Rachel W.","Roscoe, Howard K.","Wolff, Eric W.","Atkinson, Helen M."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009","abstract":"Frost flowers play a role in air-ice exchange in polar regions, contribute to tropospheric halogen chemistry, and affect ice core interpretation. Frost flowers were observed and collected on the Hudson Bay in March 2008. Their specific surface area (SSA) was measured using CH4 adsorption at 77 K. The Brunauer-Emmett-Teller analysis produced SSA values between 63 and 299 cm(2) g(-1) (mean 162 cm(2) g(-1), accuracy and reproducibility 5%). This range is very similar to that of Domine et al. (2005) but our correlation of results with growth time and chemistry reveals the factors responsible for the wide range of SSA values. Longer growth time leads to higher SSA at low temperatures, so frost flowers are more likely to affect total surface area during colder periods. Chemical analysis was performed on frost flower melt and on local seawater and brine. We examined salinity and sulfate and bromide enrichment. The relationship between growth time and salinity varied spatially because of a freshwater plume from a nearby river and of tidal effects at the coast. Enrichment of certain ions in frost flowers, which affects their contribution to atmospheric chemistry, depends heavily on location, growth time, and temperature. No significant enrichment or depletion of bromide was detected. The low surface area index of frost flowers plus their lack of destruction in wind suggest their direct effect on sea salt mobilization and halogen chemistry may be less than previously thought, but their ability to salinate wind-blown snow may increase their indirect importance","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/55663.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/11172\/1\/jgrd15789.pdf","pdfHashValue":"eb89d19ab934658f30d8762bb26c6951a7af5e3a","publisher":"American Geophysical Union","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:11172<\/identifier><datestamp>\n      2013-08-05T12:36:37Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533135<\/setSpec><setSpec>\n      7375626A656374733D5337<\/setSpec><setSpec>\n      7375626A656374733D5334<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/11172\/<\/dc:relation><dc:title>\n        Frost flower surface area and chemistry as a function of salinity and temperature<\/dc:title><dc:creator>\n        Obbard, Rachel W.<\/dc:creator><dc:creator>\n        Roscoe, Howard K.<\/dc:creator><dc:creator>\n        Wolff, Eric W.<\/dc:creator><dc:creator>\n        Atkinson, Helen M.<\/dc:creator><dc:subject>\n        Glaciology<\/dc:subject><dc:subject>\n        Chemistry<\/dc:subject><dc:subject>\n        Atmospheric Sciences<\/dc:subject><dc:description>\n        Frost flowers play a role in air-ice exchange in polar regions, contribute to tropospheric halogen chemistry, and affect ice core interpretation. Frost flowers were observed and collected on the Hudson Bay in March 2008. Their specific surface area (SSA) was measured using CH4 adsorption at 77 K. The Brunauer-Emmett-Teller analysis produced SSA values between 63 and 299 cm(2) g(-1) (mean 162 cm(2) g(-1), accuracy and reproducibility 5%). This range is very similar to that of Domine et al. (2005) but our correlation of results with growth time and chemistry reveals the factors responsible for the wide range of SSA values. Longer growth time leads to higher SSA at low temperatures, so frost flowers are more likely to affect total surface area during colder periods. Chemical analysis was performed on frost flower melt and on local seawater and brine. We examined salinity and sulfate and bromide enrichment. The relationship between growth time and salinity varied spatially because of a freshwater plume from a nearby river and of tidal effects at the coast. Enrichment of certain ions in frost flowers, which affects their contribution to atmospheric chemistry, depends heavily on location, growth time, and temperature. No significant enrichment or depletion of bromide was detected. The low surface area index of frost flowers plus their lack of destruction in wind suggest their direct effect on sea salt mobilization and halogen chemistry may be less than previously thought, but their ability to salinate wind-blown snow may increase their indirect importance.<\/dc:description><dc:publisher>\n        American Geophysical Union<\/dc:publisher><dc:date>\n        2009<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/11172\/1\/jgrd15789.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Obbard, Rachel W.; Roscoe, Howard K.; Wolff, Eric W.; Atkinson, Helen M..  2009  Frost flower surface area and chemistry as a function of salinity and temperature.   Journal of Geophysical Research, 114 (D2), D20305. 14, pp.  https:\/\/doi.org\/10.1029\/2009JD012481 <https:\/\/doi.org\/10.1029\/2009JD012481>     \n <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2009JD012481<\/dc:relation><dc:relation>\n        10.1029\/2009JD012481<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/11172\/","http:\/\/dx.doi.org\/10.1029\/2009JD012481","10.1029\/2009JD012481"],"year":2009,"topics":["Glaciology","Chemistry","Atmospheric Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Frost flower surface area and chemistry as a function\nof salinity and temperature\nRachel W. Obbard,1 Howard K. Roscoe,1 Eric W. Wolff,1 and Helen M. Atkinson1\nReceived 13 May 2009; revised 21 July 2009; accepted 29 July 2009; published 24 October 2009.\n[1] Frost flowers play a role in air-ice exchange in polar regions, contribute to\ntropospheric halogen chemistry, and affect ice core interpretation. Frost flowers were\nobserved and collected on the Hudson Bay in March 2008. Their specific surface area\n(SSA) was measured using CH4 adsorption at 77 K. The Brunauer-Emmett-Teller analysis\nproduced SSA values between 63 and 299 cm2 g\u00021 (mean 162 cm2 g\u00021, accuracy and\nreproducibility 5%). This range is very similar to that of Domine´ et al. (2005) but our\ncorrelation of results with growth time and chemistry reveals the factors responsible\nfor the wide range of SSA values. Longer growth time leads to higher SSA at low\ntemperatures, so frost flowers are more likely to affect total surface area during colder\nperiods. Chemical analysis was performed on frost flower melt and on local seawater and\nbrine. We examined salinity and sulfate and bromide enrichment. The relationship\nbetween growth time and salinity varied spatially because of a freshwater plume from a\nnearby river and of tidal effects at the coast. Enrichment of certain ions in frost flowers,\nwhich affects their contribution to atmospheric chemistry, depends heavily on location,\ngrowth time, and temperature. No significant enrichment or depletion of bromide was\ndetected. The low surface area index of frost flowers plus their lack of destruction in wind\nsuggest their direct effect on sea salt mobilization and halogen chemistry may be less than\npreviously thought, but their ability to salinate wind-blown snow may increase their\nindirect importance.\nCitation: Obbard, R. W., H. K. Roscoe, E. W. Wolff, and H. M. Atkinson (2009), Frost flower surface area and chemistry as a\nfunction of salinity and temperature, J. Geophys. Res., 114, D20305, doi:10.1029\/2009JD012481.\n1. Introduction\n[2] This study of Arctic frost flowers (FF) was part of an\nInternational Polar Year project focused on the impact of\ncombined iodine and bromine release on the Arctic atmo-\nsphere (COBRA). In both Arctic and Antarctic coastal\nregions, polar sunrise brings episodes of tropospheric ozone\ndepletion which are associated with the exchange of bro-\nmine species between the ice and the lower troposphere\n[Bottenheim et al., 1986, 2002; Roscoe et al., 2001; Spicer\net al., 2002]. Bromine compounds destroy ozone, and sea\nsalt is their source in the polar troposphere. Details of their\nmobilization have been the subject of much recent research,\nand it is hypothesized that the brine and frost flowers found\non the surface of new sea ice are responsible [e.g.,\nKaleschke et al., 2004].\n[3] Enhanced tropospheric BrO and marked ozone deple-\ntion events (ODEs) have been observed at the Hudson Bay\n[Carpenter et al., 2005], where the present study was\nconducted. The University of Laval field station (Centre\nd’E´tude Nordique de l’Universite´ Laval) in Kuujjuarapik,\nQuebec, provided a long-term record of atmospheric and\nmeteorological measurements, a base from which to con-\nduct field experiments, and a location in which to run a\nBrunauer-Emmett-Teller (BET) surface area measurement\napparatus.\n[4] ODEs are observed in air masses that have passed\nover new sea ice [Hopper et al., 1998; Richter et al., 1998;\nWagner et al., 2001], consistent with the idea that bromine\ncompounds released from frost flowers are responsible.\nThrough autocatalytic reactions, bromide ions in sea salt\nbecome bromine gas (Br2), which is photodissociated to Br\natoms that then destroy ozone in the process [Barrie et al.,\n1988; McConnell et al., 1992; Fan and Jacob, 1992; Foster\net al., 2001].\n[5] Frost flowers, which first became of interest as a\nsource of variations in the albedo and remote sensing\nsignature of sea ice [Makshtas, 1991], grow from the vapor\nand are found on the surface of newly formed ice [Perovich\nand Richter-Menge, 1994]. A thin liquid layer on the\nsurface of sea ice may be a source of salty liquid to salinate\nfrost flowers. Brine expelled from brine channels during\nfurther freezing leads to frost flowers’ high bulk salinity, at\nleast until they collect blowing snow and additional hoar-\nfrost [Perovich and Richter-Menge, 1994; Drinkwater and\nCrocker, 1988; Crocker and Lewis, 1985].\n[6] Frost flowers are also of interest because their aerosol\nmay provide an indicator of sea ice extent in ice cores in the\ninterior of Greenland and Antarctica [Wolff et al., 2003]. An\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 114, D20305, doi:10.1029\/2009JD012481, 2009\n1British Antarctic Survey, Cambridge, UK.\nCopyright 2009 by the American Geophysical Union.\n0148-0227\/09\/2009JD012481\nD20305 1 of 14\nimportant proxy for climate change is the non-sea-salt\nsulfate found in ice cores. Sulfate depletion in ice cores\nfrom inland locations has been attributed to the formation of\nnew sea ice in the area from which the wind is coming\n[Rankin et al., 2000, 2002].\n[7] In addition to providing a concentrated source of sea\nsalt, frost flowers were thought to provide a large surface\narea for chemical reactions [Rankin et al., 2002]. This\nsurface area is usually quantified as specific surface area\n(SSA), the surface area available to gases per unit mass.\n[8] In this paper, we compare chemical and physical\nvariations between frost flowers from different locations\nto provide further insights to their growth and to illustrate\nfactors that could be treated explicitly in global atmospheric\nmodels.\n1.1. Frost Flower Formation, Morphology, and Growth\n[9] Frost flowers are found often, but not exclusively, on\nthe new sea ice that forms on open water leads [Perovich\nand Richter-Menge, 1994]. Leads open in sea ice due to the\ninfluence of winds, tides, and currents. When they do, water\nnear to 0\u0002C is exposed to colder air, resulting in the rapid\ngrowth of ice and the simultaneous expulsion of salts both\nto the water below (gravity drainage) and outward to form\nbrine channels to the surface. As a result, a highly saline\nsurface skim, typically 5–10\u0002C warmer than the air tem-\nperature, forms on the new sea ice [Perovich and Richter-\nMenge, 1994]. As time passes and the sea ice becomes\nthicker, it provides a greater thermally insulating barrier\nbetween the warmer sea and colder air above, allowing the\nuppermost part of the sea ice to cool [Perovich and Richter-\nMenge, 1994]. This causes further ice formation and nar-\nrowing of the brine channels. Where brine channels become\npinched off, further expansion of the freezing ice causes\nbrine to be forced out to the surface.\n[10] The surface skim serves as a source of excess water\nvapor, resulting in supersaturation near the surface; small\ncrystals nucleate on imperfections on the surface of the sea\nice and grow by vapor deposition; they spread, eventually\nforming a dense blanket of frost flowers [Perovich and\nRichter-Menge, 1994]. Frost flowers standing on a brine-\nwetted surface will wick up brine, through the effects of\nsurface tension and concentration gradients, and increase in\nbulk salinity [Perovich and Richter-Menge, 1994; Rankin et\nal., 2000; Alvarez-Aviles et al., 2008].\n[11] In their study, Alvarez-Aviles et al. [2008] found bulk\nsalinities of frost flowers growing on the open ocean near\nBarrow, Alaska, ranging from 16 to 105%, with an average\nof 62%. The tips of mature frost flowers are less saline,\nattributed to vapor deposition as a greater source of material\nthere than wicking [Alvarez-Aviles et al., 2008]. Bulk\nsalinity decreases at night as temperatures drop and addi-\ntional hoarfrost accumulates, and frost flowers are extremely\neffective collectors of snow. These two effects reduce their\nbulk salinity over time [Perovich and Richter-Menge,\n1994].\n[12] Frost flowers increase the surface area available for\nchemical reactions. How much they do so is a function of\nmorphology, areal coverage, and height. Much has been\npublished on the growth of snow from water vapor in\nclouds, the consensus being that morphology and habit\ndepend on air temperature and supersaturation relative to\nice [Mason, 1992]. Between 0 and \u00025\u0002C, the predominant\ncrystal type is a thin hexagonal plate. Between \u00023 and\n\u00028\u0002C, needles and hollow hexagonal columns form. Hex-\nagonal plates, sector plates, and dendrites form between\n\u00028 and \u000225\u0002C, and below \u000225\u0002C, prismatic columns or\nrods and clusters of hollow columns are found [Mason,\n1992; Martin et al., 1996]. When the local air temperature\nor degree of supersaturation changes during growth, the\nshape of crystal tips changes as well [Mason, 1992; Martin\net al., 1996; Nelson, 2001]. At high supersaturation, the tip\nshape of primary branches will be round, leading to a stellar\ncrystal without side branches. At lower supersaturation, the\ntip will be faceted, and side branches will form to create a\ndendritic crystal [Gonda and Nakahara, 1997]. These\ndependencies on temperature and supersaturation appear\nto hold true for frost flowers as well [Martin et al., 1996;\nDomine´ et al., 2005; Alvarez-Aviles et al., 2008].\n[13] The relevant temperature for frost flower morphology\nis the temperature at the ice surface in the immediate\nvicinity of the frost flowers. This is a function not only of\nair and water temperatures but of ice thickness and porosity,\nsnow cover, and even the frost flower blanket itself [Martin\net al., 1996]. Seawater cannot cool below \u00021.9 to 2.0\u0002C,\ndepending on salinity. Sea ice on its surface acts as an\ninsulator between the warmer water below and colder air\nabove, permitting colder surface temperatures as it thickens.\nThe thermal conductivity of sea ice depends on its porosity\nbut is on the order of 2 W m\u00021 K\u00021, whereas that of snow is\n0.14–0.33 W m\u00021 K\u00021 [Thomas and Dieckmann, 2003].\nHence, even a few centimeters of snow on sea ice 50 cm\nthick can double its insulation. Also, the scale of lateral heat\ntransport in sea ice is on the order of 10 m, so the\ntemperature at the surface of a narrow section of new,\nuncovered sea ice is significantly affected by snow covering\nthe surrounding ice [Sturm et al., 2002]. Finally, the frost\nflowers themselves have been demonstrated to be 4–6\u0002C\nwarmer than the surrounding air and to have an insulating\neffect, causing the ice substrate where they grow to be 1–\n2\u0002C warmer than the surrounding bare ice [Martin et al.,\n1996].\n[14] Part of the interest surrounding frost flowers has\nbeen their potential to increase the available surface area\nat the sea ice surface. The amount of this increase has been a\nmatter of some conjecture. Frost flowers on sea ice were\ninitially estimated to yield total surface areas somewhere\nbetween 50 and 1000 m2 m\u00022, based on previously mea-\nsured SSA of snow, which ranged from 0.2 to 2.25 m2 g\u00021\n[Hoff et al., 1998; Hanot and Domine´, 1999], and the\nestimated mass per unit area of frost flowers of 0.025–\n0.050 g cm\u00022 [Perovich and Richter-Menge, 1994; Rankin\net al., 2002]. More recently, the SSA of frost flowers was\nmeasured directly, through methane adsorption at 77 K, with\nresults of 185 (+80 \u000250) cm2 g\u00021, suggesting a total surface\narea increase for dry frost flowers of only 1.4 m2 m\u00022\n[Domine´ et al., 2005].\n1.2. Frost Flower Chemistry\n[15] The microstructural chemistry of frost flowers is\ncomplex, relying as it does on the conditions when they\nform, air and substrate temperature, chemical concentrations\nin the water and surface skim, and relative humidity, and on\nD20305 OBBARD ET AL.: FROST FLOWER SURFACE AREA AND CHEMISTRY\n2 of 14\nD20305\nchanges in all of these conditions plus the availability of\nadditional precipitation as they grow.\n[16] An important aspect is the fractionation of sodium\nand sulfate relative to chloride as a result of the precipitation\nof their salts [Alvarez-Aviles et al., 2008]. As the tempera-\nture drops, the brine rejected from the brine channels\nbecomes progressively more concentrated. This is especially\npronounced at the surface, where the air above the ice is\nmuch colder and where the diluting effect of the larger body\nof water is not felt. At colder temperatures, salts begin to\nprecipitate, e.g., mirabilite (Na2SO4 \u0003 10H2O) at \u00028\u0002C,\nhydrohalite (NaCl \u0003 2H2O) at \u000222\u0002C, and potassium and\nmagnesium salts at \u000234\u0002C. The precipitation of these salts\nchanges the relative ion concentrations in the liquid and in\nthe frost flowers [Rankin et al., 2000, 2002]. Below \u00028\u0002C,\nloss of sodium and sulfate increases with decreasing tem-\nperature, and aerosol from frost flowers formed at these\ntemperatures would be depleted in sodium and sulfate\nrelative to other ions [Rankin et al., 2000, 2002]. Further,\nmirabilite precipitation will remove a greater proportion of\nthe sulfate than of the sodium and the resulting frost flower\naerosol will have a higher sodium to sulfate ratio than\naerosol generated from seawater [Rankin et al., 2000,\n2002]. Below \u000222\u0002C, precipitation of hydrohalite (NaCl \u0003\n2H2O) will affect the fractionation of other ions with respect\nto chloride, in particular increasing the ratio of bromide to\nchloride.\n[17] Alvarez-Aviles et al. [2008] calculated the enrichment\nfactors (Ef) of sulfate and bromide in frost flowers near\nBarrow, Alaska (air temperature \u000222\u0002C), with respect to\nchloride to compare their ion concentration ratios to those of\nstandard seawater. Ef(SO4\n2\u0002) showed enrichment at low frost\nflower salinity but approached unity as salinity increased\ntoward bulk ocean values [Alvarez-Aviles et al., 2008]. They\nfound no significant enrichment or depletion of Br\u0002, but this\ndoes not address the question of whether enough bromide\nhad been earlier released to take part in ODEs. A decrease\nof only 0.5% in bromide in frost flowers is needed to release\nenough bromine to the atmosphere to create an ODE\n[Alvarez-Aviles et al., 2008], and such a small change would\nprobably be undetectable. Simpson et al. [2005] found\napproximately 10% bromide enrichment, relative to sodium,\nin frost flowers collected from the same area near Barrow,\nAlaska, the previous year March–May 2004 (air tempera-\nture \u0004\u000225\u0002C). It is possible that hydrohalite precipitation\nled to a lower than expected Na ion concentration in the\nfrost flowers, which contributed to this finding.\n2. Methods\n2.1. Location and Sampling\n[18] River discharge affects upper ocean salinity, thermo-\nhaline circulation, and sea ice formation on both regional\nand global scales, as rivers produce a shallow buoyant\nplume in adjacent coastal waters [De´ry et al., 2005; Ingram\nand Larouche, 1987]. Background surface salinity in the\nHudson Bay is typically 29 practical salinity units (psu) in\nFebruary, when most of the bay is covered by seasonal sea\nice, but shoreline surface salinity is greatly affected by the\n42 major rivers that drain into the bay [Ingram and\nLarouche, 1987]. In the southeastern part of the bay, the\nGreat Whale River, or Grande Rivie`re de la Baleine,\nproduces a mean annual discharge of 19.77 km3 yr\u00021 at\nKuujjuarapik, Quebec [De´ry et al., 2005; Ingram and\nLarouche, 1987; Li and Ingram, 2007]. While the flow\nvaries interannually and seasonally, the velocity of the\nfreshwater discharge at the river’s mouth compared to the\ntidal current results in a freshwater plume even under\nmidwinter ice [Ingram, 1981; Ingram and Larouche,\n1987; Li and Ingram, 2007].\n[19] Great Whale River plume dynamics vary with river\ndischarge, tidal amplitude, sea ice cover and age, wind,\nwater column stability, and coastal water circulation. Plume\nareal coverage, as seen in isohalines, can extend alongshore\nor radially from the mouth of the river [Ingram and\nLarouche, 1987]. Published surface isohalines for February\nand March in previous years show the area between the\nmainland and the Bill of Portland Island within the 5 psu\nisohaline, while the area immediately west of the Bill of\nPortland Island ranges in salinity from 5 to 25 psu [Ingram\nand Larouche, 1987].\n[20] The experimental site was located 8 km north of the\nmouth of the river, where the sea ice was 60–130 cm thick\n(Figure 1). An open water lead formed 6 km west of Point\nTiriraq Ungalliq early in our campaign but then refroze, and\nthere were no open leads in the area during the study period.\nHence, frost flowers were collected from test holes 1 m\nsquare and cut in the ice 50 m from shore, from a large\ncrack (15 cm deep and 20 to 30 cm wide) that formed west\nof Bill of Portland Island and from tidal pools on the\nnorthernmost tips of the Bill of Portland and Maver Islands.\nWater depth is less than 10 m under the test holes and in the\nManitounuk Sound around the Maver Islands, and then\nincreases rapidly to 50 m west of Bill of Portland Island\n[Ingram, 1981; Ingram and Larouche, 1987]. The 1 m2 test\nhole was made by removing 1.3 m thick ice with a saw at\nFigure 1. Topographical map of Kuujjuarapik area.\nShaded areas are shallow water. Locations of frost flower\ncollection are shown: Crack (C), 55\u00022103300N, 77\u00024404900W;\nTidal pool off northwest tip of Bill of Portland Island (T),\n55\u00022203100N, 77\u00024104700W; tidal pools at Maver Islands (M),\n55\u00021903900N, 77\u00024304000W; and test hole (TH), 55\u00021808900N,\n77\u00024402000W.\nD20305 OBBARD ET AL.: FROST FLOWER SURFACE AREA AND CHEMISTRY\n3 of 14\nD20305\nthe beginning of the campaign and then kept open by\nremoving the 10–20 cm of ice that reformed twice daily\nwith an axe. Frost flowers were collected between 4 and 16 h\nafter the hole had been opened. To estimate time elapsed\nsince formation, which often began overnight, we sub-\ntracted 2 h from the time between the hole being cleared\nof ice and the time of observation.\n[21] Air temperatures during the collection period (2–\n13 March 2008) varied between \u000210\u0002C and \u000235\u0002C and the\naverage mean temperature of the days on which we collected\nfrost flowers was \u000224\u0002C. Wind ranged from 0 to 13 m s\u00021\nand was typically from the east or northwest. Relative\nhumidity was typically over 75%. While diamond dust\nwas common, only one heavy snowfall took place during\nthis period, and frost flowers were affected primarily by\nblowing snow rather than by precipitation. Other aspects of\nour environmental conditions were often very similar to\nthose present during Perovich and Richter-Menge’s obser-\nvations in 1994: air temperatures between \u000225\u0002C and\n\u000215\u0002C, light winds, high relative humidity (85–95%).\nTemperatures at the surface of the ice were warmer than\nthe air temperature recorded at 1 m above the ice, and\ntemperature difference varied with ice thickness, snow\ncover, and sunlight. For example, on 9 March, the air\ntemperature was \u000220.1\u0002C, the temperature at the surface\nof the snow was \u000218.7\u0002C, and the temperature under 3 cm\nof snow, on the ice, was \u000215.9\u0002C. An example of the\ntemperature profile with depth is shown in Figure 2.\n[22] Frost flower micrographs were taken in situ with a\nDinoscope digital microscope, which provided a range of\nmagnification of 0 to 200X but required connection to a\nlaptop. This limited its use at frost flower fields far from\nshore because of the effect of the cold weather on the\nequipment. Frost flowers were collected with a stainless\nsteel spatula, with care taken to collect samples free of snow\nor brine. All frost flower samples were dry such that they\nwere incapable of sticking to each other, and no ascertain-\nable wind-blown snow was collected with them. They were\nplaced in precleaned 15 ml polytetrafluoroethylene (PTFE)\nsample jars and stored in liquid nitrogen within 2 h.\nSamples collected at the tidal pools were immersed in liquid\nnitrogen immediately, in dewars taken to the site on snow-\nmobiles. This involved a lot of spillage, but the remaining\nliquid nitrogen bath did partially cushion the frost flowers\nfrom the jarring nature of snowmobile travel. Some samples\nthat were transported long distances across the bay by\nsnowmobile were noticeably compacted upon arrival at\nthe research station. Settling, estimated by eye on the\nsamples in the PTFE jars just before they were tipped into\nthe sample container as <10, 25, or 50%, was correlated\nwith the SSA as measured. Hence, estimated settling is\nnoted in Table 2; it should be taken into account when\nanalyzing results, although settling does not necessarily\nimply metamorphosis.\n[23] Snow, ice, and water were also sampled at most\nlocations, as well as the brine around the crack and tidal\npool frost flowers. The ice that formed in the test holes was\ndry or nearly dry on top, and no brine was collected there.\n[24] We collected seawater by plunging a container 10 cm\ndeep into the water. Water was collected from the 1 m2 test\nholes after the hole had been cleared of the ice formed\novernight and the associated chips of floating ice, and the\nexposed water was well mixed. Water collected from below\ncores was gathered after the core had been removed and the\nwater had rushed up the hole and then fallen back. We\nbelieve this water was similarly well mixed by the turbu-\nlence it experienced. A comparison of water collected from\nthe test hole and water collected from a nearby coring hole\nrevealed salinity differences of less than 0.6 psu and differ-\nences in the concentrations of major ions (Cl\u0002, SO4\n2\u0002, Na+,\nand Mg2+) of less than 8% (Table 1). It is possible that both\ncontained very small ice crystals produced during the\nremoval of the ice. The bromide concentration in the diluted\nsamples was below the detection limit in the first two tests.\nFigure 2. Schematic showing vertical temperature profile at the edge of the Bill of Portland Island tidal\npool on 11 March 2008.\nTable 1. Concentration of Major Ions and Bromide in Local Seawater Collected From Test Holes and the Coring Hole 50 m From Shorea\nTemperature\n(\u0002C)\nSalinity\n(psu)\nCl –\n(ppmm)\nSO4\n2\u0002\n(ppmm)\nBr\u0002\n(ppmm)\nNa+\n(ppmm)\nMg2+\n(ppmm)\n23 February test hole \u000214.3 5.8 2739 389 1649 218\n25 February test hole \u000220.7 5.9 2801 381 1638 230\n3 March under core \u000221.5 5.3 2903 394 8 1639 201\nStandard deviation\/average 0.3\/5.7 (6%) 83\/2814 (3%) 6\/388 (2%) 6\/1642 (0.4%) 15\/216 (7%)\naNote that bromide concentration was below detection limit in the February samples.\nD20305 OBBARD ET AL.: FROST FLOWER SURFACE AREA AND CHEMISTRY\n4 of 14\nD20305\nHence, we have used the ion concentrations from the third\nfor frost flower chemistry comparisons.\n[25] In their work, Alvarez-Aviles et al. [2008] collected\nseawater samples that were found to differ significantly\nfrom standard seawater in salinity and ion fractionation.\nThey define them as ‘‘sea-ice processed seawater’’ and\nexplain the differences as resulting from fractionation and\nthe possibility of collecting small ice crystals with their\nsample [Alvarez-Aviles et al., 2008]. Our Hudson Bay water\nsamples were entirely reasonable compared to under ice\nisohalines in the area [Ingram and Larouche, 1987] as well\nas being internally consistent. So we do not believe that sea\nice processing took place with our sampling procedure.\n2.2. Surface Area Measurement\n[26] The SSA of frost flowers was measured in Kuujjuar-\napik, Quebec, using methane adsorption at 77 K, as in the\nwork by Domine´ et al. [2005], with an apparatus built at the\nBritish Antarctic Survey. The SSA apparatus is similar to\nthat described by Legagneux et al. [2002] and Domine´ et al.\n[2005] and is essentially a manifold made of 0.5 inch and\n0.25 inch stainless steel tubing and Swagelok fittings. There\nare two gas sources: research grade helium (99.9995%\npurity) for assessing the dead volume of the sample con-\ntainer around the frost flower sample, and research grade\nmethane (99.995% purity) to measure the pressure changes\ndue to incremental gas adsorption on the sample surface.\nThe turbomolecular pump is capable of evacuating the\nsystem to 4 \u0005 10\u00025 Pa, and the pressure is measured with\na 0–1300 Pa absolute pressure transducer with resolution\nand accuracy of ±0.13 Pa. Heating tape is wrapped around\nthe sample container tubing where it exits the liquid\nnitrogen bath, in order to constrain the distance over which\nthe temperature gradient exists between the 77 K sample\ncontainer, and the room temperature of approximately 23\u0002C.\nBecause the ideal gas law is used to calculate very small\nvariations in pressure in the manifold and sample container,\ntemperature stability is key. The manometer (MKS Baratron\n627) is insulated and controls its temperature at 45\u0002C,\nthereby maintaining constant calibration. Temperatures\nalong the length of the 1 m tall manifold were measured\nto establish a baseline for system behavior. Establishing the\nvolumes of the sample container and the various parts of the\nmanifold, and the temperature gradient at the bottom, above\nthe liquid nitrogen, and at the top near the manometer, and\nrecognizing the temperature gradient in the analysis were\ncritical for obtaining sensible and reproducible results. The\nestimated volumes at their various temperatures, including\nthe volume in the heated part of the manometer, were\nreduced to the volume of the sample container by multi-\nplying by 77\/T in the usual way.\n[27] Approximately 6 g of frost flower sample (2 jars)\nwere required for each test, in order to have a large enough\nsurface area to measure the pressure difference due to\nadsorption. Our samples ranged from 5 to 8 g, and there\nwas no correlation between sample size and SSA measured.\nWorking out of doors behind the research station, the frost\nflowers were carefully transferred from the sample jars to\nthe sample container. The lid of the sample container was\nattached using a copper gasket and six bolts, and the sealed\ncontainer was lowered into a 2 L dewar of liquid nitrogen. It\nwas then carried indoors and attached to the running SSA\nmeasurement apparatus using a spring-loaded Swagelok\nfitting. The sample was allowed to equilibrate at 1 atm for\n20 min before the lowest valve on the manifold was very\nslowly opened and the sample container was pumped down.\nThis allows the vapor and frost flowers in the cooling\nsample container to come to equilibrium before being ex-\nposed to the temperature gradient in the tubing above the\nvalve. This prevents the formation of microdroplets of\namorphous ice on the sample and container walls [Legagneux\net al., 2002].\n[28] The dead volume around the sample in the sample\ncontainer was measured by introducing helium gas into the\nmanifold (Vi) to achieve a pressure of 1220–1260 Pa, then\nopening the lower valve to the expansion volume (Ve)\ncontaining the sample and recording the pressure. After this\nhad been done at least six times, or until reproducible results\nwere obtained, the helium was evacuated. To obtain SSA,\nmethane, which can be adsorbed on ice [Legagneux et al.,\n2002], was introduced in a sequence of 14 increments, from\n47 to 470 Pa. A BET analysis was used to determine surface\narea of the ice [Brunauer et al., 1940] whose principle is\ndescribed in detail by Legagneux et al. [2002]. An adsorp-\ntion isotherm is plotted, such as the one shown in Figure 3.\nIt is shape classified as a type II isotherm [Brunauer et al.,\n1940] and can be analyzed as outlined by Brunauer et al.\n[1938]. The slope and intercept of a function, Y = f (PCH4\/\nP0), of the chamber pressure, PCH4, relative to the saturating\nvapor pressure of methane at 77 K, P0 (1294 Pa) yield the\nsurface area of the sample occupied by a monolayer of\nmethane molecules, which have a cross-sectional area of\nsm = 1.918 \u0005 10\u000219 m2 [Chaix et al., 1996]. In the analysis,\nthe net heat of adsorption of methane on snow DQCH4,snow\nis also derived from the slope and intercept of the linear\nfunction Y = f (PCH4\/P0) and can be used to assess the\nreliability of the surface area measurement [Domine´ et al.,\n2000]. Acceptance of an incorrect DQCH4,snow produces\nerrors in surface area, and thus agreement on DQCH4,snow is\ncritical for comparisons of SSA from different researchers.\nExperimentally determined values of DQCH4 have ranged\nfrom 1919 ± 35 J mol\u00021 [Chaix et al., 1996], 2195 J mol\u00021\n[Hanot and Domine´, 1999], 2100 ± 150 J mol\u00021 [Domine´ et\nal., 2000], and 2240 ± 200 J mol\u00021 [Legagneux et al., 2002]\nFigure 3. Adsorption isotherm of CH4 on frost flowers\ncollected on 13 March 2008 from the tidal pool at North\nMaver Island. The number of molecules adsorbed per gram\nof snow, Nntads, is plotted as a function of reduced pressure,\nthe ratio P\/P0, where P is the pressure around the sample\nand P0 is the saturated vapor pressure of CH4 at 77 K.\nD20305 OBBARD ET AL.: FROST FLOWER SURFACE AREA AND CHEMISTRY\n5 of 14\nD20305\nto 2450 ± 200 J mol\u00021 [Domine´ et al., 2005]. This last value\nwas associated with the discovery of the influence of\nmethane adsorption on the walls of the stainless steel (ss)\nsample container, DQCH4,ss = 1300 J mol\n\u00021. Not taking this\ncontribution into account produces deceptively low values\nof DQCH4,snow, particularly for samples with low surface\narea [Domine´ et al., 2005]. Our data analysis and the results\nshown in Table 2 include this correction.\n[29] We selected experimental conditions and a PCH4\/P0\nrange on the basis of a series of reproducible experiments\nthat produce a DQCH4,snow value of 2450 ± 200 [Domine´ et\nal., 2005] and applied those conditions across all experi-\nments. With respect to the method described in detail by\nLegagneux et al. [2002], we optimized the ratio Vi\/Ve to 0.86\nby adjusting the size of the manifold (introductory volume)\nand sample containers (expansion volume) to 68.3 cm3 and\n71.5 cm3, respectively. Further, the success of this SSA\nmeasurement technique depends on selecting the linear\nrange of the function Y = f(PCH4\/P0), selected by seeking\nthe optimum correlation coefficient of the least squares fit\nfor Y = f(PCH4\/P0) [Legagneux et al., 2002], as 0.07 to 0.22.\nWe adopted this same range because it produced the best fit\nfor the BET transform and allows us to compare our SSA\nresults to theirs. Legagneux et al. [2002] also recommend\nalways using the same number of points within this range to\npermit comparisons of relative SSA. We chose 7 points\nbecause in some cases when we used 8 points, the linearity\nsuffered and it affected the DQCH4,snow value obtained.\n[30] We measured the SSA of 10 frost flower samples\n(each two PTFE jars full) from 8 separate sampling expe-\nditions. We tested each sample two or three times to\nestablish reproducibility of the SSA and DQCH4,snow values\nobtained, by evacuating the sample container after one run\nand repeating the experiment. The potential error inherent in\nthe experimental method is 5%. This was determined by\nvarying temperature and pressure values in real data sets by\ntheir instrument accuracy (0.13 Pa and of 0.1\u0002C) and\nassessing the change in the resulting SSA and DQCH4.\nWe also tested reproducibility across samples from a given\nlocation. Results are presented in section 3.\n[31] Other authors have used the term total surface area\n(TSA) to describe frost flower surface area per area of sea\nice [Domine´ et al., 2002], renamed snow area index (SAI)\nby Taillandier et al. [2006], by analogy to leaf area index:\nSAI ¼ SSA\u0005 WAFFð Þ;\nwhere WAFF is the weight of frost flowers per unit area of\nsea ice. The surface area amplification is then (SAI + 1). To\ndetermine SAI, we marked off squares of 232 cm2 (6 inches\n(1 inch = 2.54 cm) on a side) on the sea ice surface and\ncollected all of the frost flowers in each into a separate\nsample jar and weighed. We estimated areal coverage by\nopening the digital images in a graphic analysis software,\napplying a threshold and filtering out the darker ice and sea\nice surface shadowed by the frost flowers.\n2.3. Chemical Analysis\n[32] Melted frost flower samples were diluted by a factor\nof 103 with ultra high purity water (18 MW) and analyzed\nfor ion concentrations in a Dionex DX500 ion chromato-\ngraph with a 4 mm AS18 separator column for anions and a\n3 mm CS12A-5 mm separator column for cations. Simulta-\nneous injection of the samples was performed using an AS\nautosampler which is equipped with a 500 ml loop for the\nanions and a 250 ml loop for the cations. We used isocratic\nelution with 22 mM potassium hydroxide for the anions and\n20 mM methane sulphonic acid for the cations. Both runs\nTable 2. Frost Flower SSA Resultsa\nDate\nCollection\nTFormation\n(\u0002C)\nSettling\n(%)\nWeight\n(g)\nDQCH4,snow\n(J mol\u00021)\nSSA\n(cm2 g\u00021)\nStandard Deviation\nDivided by Average (%)Location\nTemperature\n(\u0002C)\n2 March 2008 test hole \u000220.3 \u000224.6 <10 6.11 2092 141 9\n2 March 2008 test hole \u000220.3 \u000224.6 <10 6.11 2593 158 9\n2 March 2008 test hole \u000220.3 \u000224.6 <10 6.11 2488 168 9\n6 March 2008 test hole \u000226.5 \u000222.6 <10 5.36 2554 63 4\n6 March 2008 test hole \u000226.5 \u000222.6 <10 5.36 2625 67 4\n6 March 2008 test hole \u000226.5 \u000222.6 <10 4.76 2614 152 4\n6 March 2008 test hole \u000226.5 \u000222.6 <10 4.76 2289 143 4\n8 March 2008 test hole \u000221.0 \u000225.5 <10 6.66 2454 299 8\n8 March 2008 test hole \u000221.0 \u000225.5 <10 6.66 2166 268 8\n5 March 2008 crack \u000217.0 \u000219.8 50 8.02 2397 103 7\n5 March 2008 crack \u000217.0 \u000219.8 50 7.50 2328 80 7\n5 March 2008 crack \u000217.0 \u000219.8 50 7.50 2538 85 7\n6 March 2008 crack \u000222.9 \u000225.5 50 6.96 2424 146 4\n6 March 2008 crack \u000222.9 \u000225.5 50 6.96 2548 154 4\n6 March 2008 crack \u000222.9 \u000225.5 50 6.96 2418 160 4\n9 March 2008 crack \u000220.1 \u000226.3 <10 4.82 2607 201 7\n9 March 2008 crack \u000220.1 \u000226.3 <10 4.82 2598 197 7\n9 March 2008 crack \u000220.1 \u000226.3 <10 4.82 2675 223 7\n12 March 2008 tidal \u000222.6 \u000223.4 <10 7.72 2694 152 7\n12 March 2008 tidal \u000222.6 \u000223.4 <10 7.72 2435 168 7\n13 March 2008 tidal \u000212.7 \u000227.0 25 8.64 2441 224 1\n13 March 2008 tidal \u000212.7 \u000227.0 25 8.64 2593 221 1\naFrost flowers were so dry that they were incapable of sticking to each other, and no ascertainable wind-blown snow was collected with them. The tidal\nfrost flowers come from the tidal pool at North Maver Island. Where weight is repeated for a given date, that sample was tested two or three times, yielding\nthe reproducibility shown in the last column. Temperature at the time of collection and at the time of formation (see text) comes from the Environment\nCanada Met Office online data. Settling refers to sample settling during transport as an estimated percentage of the original volume, but the SSA results are\nthose measured, i.e., with no compensation for estimated settling.\nD20305 OBBARD ET AL.: FROST FLOWER SURFACE AREA AND CHEMISTRY\n6 of 14\nD20305\nwere 16 min long. Flow rates were 1.0 and 0.5 ml min\u00021 for\nthe anions and cations, respectively. The accuracy of ion\nconcentration data is ±5% except in the case of very low, near-\ndetection-limit ion concentrations such as bromide, which\nmay have uncertainties of ±10%. Frost flower salinity was\ncalculated as the sum of the concentrations of major (mea-\nsured) ions: Cl\u0002, SO4\n2\u0002, NO3\n\u0002, Br\u0002, Na+, K+, Mg2+, and Ca+.\n[33] Water salinity was also measured with a Hach\nsensION5 ISFET conductivity meter with internal temper-\nature correction. This device has a resolution of 0.1 g l\u00021\nand accuracy of ±0.1 psu between \u00022.0 and 35.0\u0002C.\nSalinity values obtained this way were similar to those\ncalculated using ion chromatography: 5.3 psu for nearshore\nwater and 21.1 psu for water (taken from under a core) from\nthe bay outside of the Bill of Portland Island.\n3. Results\n3.1. Frost Flower Observations\n[34] The frost flowers on test holes began as tiny tufts on\nthe newly formed sea ice, about 2 h after the hole was\nopened. These grew to round clumps (Figure 4a), which\nthen spread until they completely covered the test hole over\na period of about 16 h. The surface of the ice where they\nFigure 4. Dendritic frost flowers: (a) test hole, 2 March 2008, \u000229\u0002C, width of largest initial\n‘‘chrysanthemum’’ shown is \u000410 cm; (b) tidal pool, 11 March 2008, \u000224\u0002C; (c–e) test hole, 2 March\n2008, \u000229\u0002C; (f) tidal pool, 13 March 2008, \u000227\u0002C (frost flowers approximately 2 cm long).\nD20305 OBBARD ET AL.: FROST FLOWER SURFACE AREA AND CHEMISTRY\n7 of 14\nD20305\ngrew was relatively dry, such that even a piece of filter\npaper laid on it would not become wet. The frost flowers\nfound in the crack and on tidal pools appeared fernlike\n(Figure 4b). They generally stood in or near water and were\nwet at the base. Those in the crack were sheltered from the\nwind by the walls of the crack, which were at least 10 cm\nhigh. Those on the tidal pools were unsheltered. The largest\ntidal pool, off the Bill of Portland Island, was approximately\n10 m wide by 60 m long. The smaller tidal pools off the\nMaver Islands were about 3 m wide by 5 m long.\n[35] Frost flower crystal shape may be described using\nterms defined for secondary snow habit by Nelson [2005].\nWhile primary habit refers simply to aspect ratio, and is,\ndepending on temperature and surface supersaturation,\neither tabular or columnar, secondary characteristics such\nas branching and tip shape are determined by the temper-\nature, supersaturation relative to ice, vapor mean free path,\nand time [Nelson, 2001]. Most frost flowers we observed\nwere dendritic, although within this classification, some\nwere fernlike, with a high density of side branches (Figures\n4c and 4e), while others were broad branch (Figure 5a),\nstellar, or resembled sector plates (Figure 5b). All of these\nhad grown at air temperatures of between \u000224 and \u000236\u0002C,\nbut near-ice temperatures would have been warmer. This is\nparticularly true at the crack and tidal pools, where regular\nflooding would have contributed to warmer temperatures\nand greater ambient supersaturation relative to ice.\n[36] These crystal habits are generally consistent with\npublished descriptions of the temperature regimes of hex-\nagonal plates, sector plates, and stellar dendrites in snow\nbetween \u00028 and \u000225\u0002C [Mason, 1992;Martin et al., 1996].\nThey illustrate the variations that are found, the develop-\nment of which is described in detail by Hallett and Mason\n[1958], Mason [1992], and Nelson [2005]. Observations of\ncrystal habit changes that occur with temperature and degree\nof supersaturation are considered evidence of step nucle-\nation as the primary growth mechanism in snow [Hallett\nand Mason, 1958; Knight, 1972; Nelson, 2001] and of the\nmacro step model of branch growth [Nelson, 2001]. Similar\narguments may also be made for frost flowers growing by\nstep nucleation, wherein growth occurs by the sequential\naddition of atoms to a structure, into positions dictated by\nminimization of interface energy. Our observations support\nthis. Note the 10–50 mm wavelength ripples, or succes-\nsive branch perimeters, in Figure 5b, the plates developing\nbetween branches in Figure 5c, and the cross ribs in\nFigure 5. (a) Broad branch and (b) sector plate-like frost flowers, from test hole, 2 March 2008,\nphotographed at \u000229\u0002C but formed at \u000225\u0002C. Note the 10 to 50 mm wavelength roughness on the sector\nplates in Figure 5b (arrow). (c and d) Test hole frost flowers, photographed 27 February 2008, at 1230 LT,\nphotographed at \u000225\u0002C but formed at air temperature of \u000229 to \u000236\u0002C. In Figure 5c note the plates\ngrowing between the original dendritic branches. In Figure 5d note the cross ribs (arrow), described for\nsnow by Nelson [2005].\nD20305 OBBARD ET AL.: FROST FLOWER SURFACE AREA AND CHEMISTRY\n8 of 14\nD20305\nFigure 5d. These surface irregularities are most likely\ncaused by variations in temperature and supersaturation of\nthe near surface environment during growth and illustrate\nthe stepwise development of frost flowers.\n[37] Warmer temperatures lead to slower growth and\nwider crystal tips [Nelson, 2005], which may have caused\nthe broad branches seen in Figures 4a and 4b and the web-\nlike structures between branch tips seen in Figure 4c.\nNeedles are formed by layer nucleation on the basal face,\nwhen critical supersaturation there is less than that on the\nprism face; they are generally found between \u00023 and \u00028\u0002C\nand at relatively low supersaturation [Nelson, 2005]. The\nneedles seen in Figure 6 were found on tidal pool ice at air\ntemperatures of \u000223\u0002C, but again, the near surface temper-\nature at this tidal location would have been warmer than the\nmeasured air temperature.\n[38] Like others, we noted the macroscopic rigidity of\nfrost flowers [Domine´ et al., 2005; Alvarez-Aviles et al.,\n2008]. No mechanical breakage of frost flowers by wind\nwas observed during our field work, even in winds of up to\n6 m s\u00021. Frost flowers fluttered in the wind but rarely broke\nand did not blow away. The morning after a snowstorm that\nsaw wind speeds of 7–13 m s\u00021, previously formed frost\nflowers that had grown on the windward side of the Bill of\nPortland Island tidal pool were found broken off at their\nbase and scattered mostly intact on the surrounding snow\n(Figure 7a). This is an important new observation, as we\nhad expected that such fragments would be widely dissi-\npated. Frost flowers toward the center and the leeward side\nof the tidal pool, however, appeared unbroken, though it is\npossible that small fragments from their tips had broken off\nand been lofted. At the same time, newer frost flowers on\nthe windward side of a tidal pool off the Maver Islands were\nfound all leaning away from the wind direction (Figure 7b).\nAgain, frost flowers on the leeward side of the pool\nappeared unbroken, with the same caveat as above.\n[39] We also noted that the threshold for mobilization of\nblowing snow is lower than that for frost flower breakage.\nDuring a period in which there was no new precipitation, we\nobserved frost flowers collecting (Figure 7c) or even be-\ncoming covered with blowing snow, and small snow banks\nforming against frost flowers (Figure 7d). Although high\nwinds could be observed at the surface of the sea ice from\nthe blowing snow, broken and snow covered frost flowers\nwere observed only on the windward side of frost flower\nfields; those on the leeward side were apparently sheltered.\n3.2. Frost Flower Surface Area\n[40] We ran 22 tests on 10 samples of frost flowers, the\nresults are shown in Table 2. SSA values ranged between\n63 and 299 cm2 g\u00021 with a mean of 162 cm2 g\u00021. These\nvalues are similar to those obtained by Domine´ et al. [2005]\non test hole frost flowers from the Arctic Ocean near\nBarrow, Alaska, of 185 (+80 \u000250) cm2 g\u00021. Our field frost\nflower SSA measurements had reproducibilities ranging\nfrom 1% to 9% and averaging 5%.\n[41] The mean DQCH4,snow obtained was 2480 J mol\n\u00021\nwith a standard deviation of 157 J mol\u00021 (6%). This low\nstandard deviation supports the P\/P0 range chosen and\nmathematical accommodation of temperature gradients. In\ntwo separate tests at the Bill of Portland and Maver Island\ntidal pools (12 and 13 March), we found coverage of 75 and\n90% and SAI of 1.76 and 2.14 m2 m\u00022 of sea ice,\nrespectively.\n3.3. Frost Flower, Brine, and Source Water Chemistry\n[42] The salinity of frost flowers samples and the local\nwater, and the enrichment (Ef) of the former relative to the\nlatter, are shown in Table 3. Test hole frost flowers had\nsignificant salinity enrichment, by a factor of 2.7 on 2 March\nand 1.7 on 8 March, despite the low water salinity at the\nnearshore location and the lack of surface skim on the ice\nthat formed on the test holes. The source of this excess frost\nflower salinity must therefore be brine channels. In contrast,\nfrost flowers found in tidal pools and cracks were in most\ncases salinity depleted compared to their source water. This\nis due to the periodic renewal of source water via the tide,\nwhich mixes with surface snow and is diluted.\n[43] Ion concentrations in frost flowers and related water\nare shown in Table 4. Note the significantly higher ion\nconcentrations in water from west of the Bill of Portland\nIsland (main bay water 063W2) than in the nearshore water.\n3.4. Frost Flower Chemistry and Enrichment as a\nFunction of Time and Temperature\n[44] Table 5 includes ion ratios and enrichment factors for\ncertain ions in frost flowers and related water. We took the\napproach used by Alvarez-Aviles et al. [2008] of using Cl\u0002\nFigure 6. Needle-like frost flowers, 12 March 2008, North Maver Island tidal pool, \u000223\u0002C.\nD20305 OBBARD ET AL.: FROST FLOWER SURFACE AREA AND CHEMISTRY\n9 of 14\nD20305\nas the basis for comparison of concentrations of other ions.\nFor our purposes, chloride makes a better basis for com-\nparison than sodium because while mirabilite (Na2SO4 \u0003\n10H2O), begins to form at \u00028\u0002C, hydrohalite (NaCl \u0003\n2H2O) does not precipitate until \u000222\u0002C. Although air\ntemperatures were often just below \u000222\u0002C, the temperature\nat the surface of the ice would not have been, as discussed\nin section 3.1. We also believe the enrichment (Ef) factors\nTable 3. Salinity for Frost Flowers and Relevant Seawatera\nSample Identification\nCollection Air\nTemperature (\u0002C)\nFormation Air\nTemperature (\u0002C)\nGrowth\nTime (h)\nSalinity\n(%)\nSalinity\nEnrichment Ef\nNearshore water, 063W1 \u000221.5 5.3\n020308 test hole FF 4 \u000228.7 \u000224.6 15 14.5 2.74\n020308 test hole FF 5 \u000228.7 \u000224.6 15 14.1 2.72\n080308 test hole FF 4 \u000221.4 \u000225.5 26 8.8 1.66\n080308 test hole FF 5 \u000221.4 \u000225.5 26 9.3 1.75\nMain bay water, 063W2 \u000221.5 21.5\n060308 crack FF L \u000221.5 \u000225.3 8 10.0 0.47\n090308 crack FF 1 \u000226.3 \u000227.2 8 18.9 0.88\n110308 tidal FF, Bill of Portland \u000225.6 \u000221.7 10.5 13.4 0.62\n110308 tidal FF, Bill of Portland \u000225.6 \u000221.7 10.5 5.9 0.27\n120308 tidal FF, Maver Islands \u000223.4 \u000223.4 2.5 19.5 0.91\n120308 tidal FF, Maver Islands \u000223.4 \u000223.4 2.5 23.4 1.09\n120308 tidal FF, Maver Islands \u000223.4 \u000223.4 2.5 21.7 1.01\n130308 tidal FF, Maver Islands \u000214.7 \u000227.0 13 5.1 0.24\n130308 tidal FF, Maver Islands \u000214.7 \u000227.0 13 11.2 0.52\n130308 tidal FF, Maver Islands \u000214.7 \u000227.0 13 7.5 0.35\n130308 tidal FF, Maver Islands \u000214.7 \u000227.0 13 7.7 0.36\naSalinity enrichment factor (Ef) is frost flower salinity relative to the salinity of the source water (nearshore or main bay). Main bay water (063W2) is\nfrom a coring hole made near the crack, west of the Bill of Portland Island.\nFigure 7. Tidal pool frost flowers showing wind’s effect: (a) broken, 11 March 2009, temperature\n\u000224\u0002C, wind 7–13 m s\u00021; (b) leaning away from the wind, 11 March 2009, temperature \u000224\u0002C, wind\n7–13 m s\u00021; (c) dusted with snow, 12 March 2008, temperature \u000223\u0002C, wind 3.6 m s\u00021; (d) catching\nwindblown snow, 11 March 2009, temperature \u000224\u0002C, wind 6 m s\u00021.\nD20305 OBBARD ET AL.: FROST FLOWER SURFACE AREA AND CHEMISTRY\n10 of 14\nD20305\nshould be calculated with respect to local seawater, the source\nof the frost flowers of interest, and define Ef as follows:\nEf Xð Þ ¼ X½ \u0006sample= Cl\u0002½ \u0006sample\n\u0002 \u0003\n= X½ \u0006refwater= Cl\u0002½ \u0006refwater\n\u0004 \u0005\n;\nwhere X is the ion of interest and refwater refers to the local\nsource water, rather than standard seawater as used by\nAlvarez-Aviles et al. [2008]. Like the work of Alvarez-Aviles\net al. [2008], we interpret the variability in Ef (SO4\n2\u0002) at\nformation air temperatures of \u000222\u0002C to \u000227\u0002C as related to\nmirabilite precipitation, and indeed our data show similar\nvariability in Ef (SO4\n2\u0002) with temperature at air temperatures\nbelow \u00029\u0002C.\n[45] Test hole frost flowers had enrichment factors slightly\ngreater than 1 for both bromide and sulfate, but salinity\nenrichment was much larger. Crack frost flowers had\nenrichment factors slightly less than 1 for both bromide\nand sulfate, and salinity was similarly slightly depleted.\nTidal pool frost flowers collected on 2 of the 3 days were\nsignificantly enriched in sulfate. On the other day they were\nneither enriched nor depleted, within the 7% accuracy\npossible when comparing two ion concentrations (5%\naccuracy each). Bromide ion concentrations were so low\nthat only 10% measurement accuracy can be expected,\nleading to 12% accuracy in Ef(Br\n\u0002) and no consistent\nenrichment or depletion in frost flowers.\n4. Discussion\n4.1. Source Water Salinity and Frost Flower Location\nand Salinity\n[46] The Great Whale River plume produced under-ice\nsalinities in our experimental area of 3 to 21 psu, much less\nthan the salinity of the greater Hudson Bay (29 psu) or\nSMOW (35 psu). The frost flowers analyzed had salinities\nof 5.1 to 23.4%, far less than reported by other researchers\nfor frost flowers growing on sea ice. Test hole frost flowers\nTable 4. Formation Air Temperature and Ion Concentrations for Frost Flowers and Relevant Seawatera\nSample Identification\nFormation Air\nTemperature (degC)\nCl\u0002\n(ppmm)\nSO4\n2\u0002\n(ppmm)\nBr\u0002\n(ppmm)\nNa+\n(ppmm)\nK+\n(ppmm)\nMg2+\n(ppmm)\nCa2+\n(ppmm)\nNearshore water, 063W1 2,903 394 8 1,639 59 201 63\n020308 test hole FF 4 \u000224.6 8,228 1,296 27 3,997 174 592 217\n020308 test hole FF 5 \u000224.6 8,047 1,261 26 3,904 164 581 146\n080308 test hole FF 4 \u000225.5 5,033 777 19 2,445 105 358 102\n080308 test hole FF 5 \u000225.5 5,375 737 15 2,576 109 391 88\nMain bay water, 063W2 11,490 1,573 37 6,695 256 1,202 257\n060308 crack FF L \u000225.3 5,878 688 18 2,793 127 402 100\n090308 crack FF 1 \u000227.2 11,181 1,165 24 5,420 215 790 143\n110308 tidal FF, Bill of Portland \u000221.7 7,777 1,000 20 3,745 164 535 149\n110308 tidal FF, Bill of Portland \u000221.7 3,448 462 9 1,643 68 237 72\n120308 tidal FF, Maver Islands \u000223.4 10,289 2,712 33 5,434 182 751 119\n120308 tidal FF, Maver Islands \u000223.4 12,912 2,591 38 6,442 230 912 269\n120308 tidal FF, Maver Islands \u000223.4 11,798 2,564 37 5,992 210 839 248\n130308 tidal FF, Maver Islands \u000227.0 2,881 475 9 1,404 56 204 61\n130308 tidal FF, Maver Islands \u000227.0 6,410 981 20 3,134 131 446 84\n130308 tidal FF, Maver Islands \u000227.0 4,332 588 13 2,074 91 298 97\n130308 tidal FF, Maver Islands \u000227.0 4,386 705 14 2,148 86 316 57\naFor comparison, standard mean ocean water (SMOW) contains the following ions concentrations (ppmm): Cl\u0002, 19,350; SO4\n2\u0002, 2712; Na+, 10,775; K+,\n399; Mg2+, 1295; and Ca+, 412 [Rankin et al., 2000].\nTable 5. Ion Ratios and Sulfate and Bromide Ion Enrichment Relative to Chloride for Frost Flowers and Relevant Seawatera\nSample Identification\nFormation Air\nTemperature (degC) Cl\u0002\/Na+ Cl\u0002\/Br\u0002 SO4\n2\u0002\/Na+ SO4\n2\u0002\/Cl\u0002 Na+\/Br\u0002 SO4\n2\u0002\/Cl\u0002 Ef Br\u0002\/Cl\u0002 Ef\nNearshore water, 063W1 1.77 357 0.24 0.14 201\n020308 test hole FF 4 \u000224.6 2.06 306 0.32 0.16 149 1.16 1.17\n020308 test hole FF 5 \u000224.6 2.06 314 0.32 0.16 152 1.15 1.13\n080308 test hole FF 4 \u000225.5 2.06 272 0.32 0.15 132 1.14 1.31\n080308 test hole FF 5 \u000225.5 2.09 356 0.29 0.14 171 1.01 1.00\nMain bay water, 063W2 1.72 311 0.23 0.14 181\n060308 crack FF \u000225.3 2.10 332 0.25 0.12 158 0.76 1.12\n090308 crack FF \u000227.2 2.06 474 0.21 0.10 230 0.67 0.79\n110308 tidal FF, Bill of Portland \u000221.7 2.08 391 0.27 0.13 188 0.94 0.79\n110308 tidal FF, Bill of Portland \u000221.7 2.10 375 0.28 0.13 179 0.98 0.83\n120308 tidal FF, Maver Islands \u000223.4 1.89 316 0.50 0.26 167 1.93 0.98\n120308 tidal FF, Maver Islands \u000223.4 2.00 341 0.40 0.20 170 1.47 0.91\n120308 tidal FF, Maver Islands \u000223.4 1.97 321 0.43 0.22 163 1.59 0.97\n130308 tidal FF, Maver Islands \u000227.0 2.05 320 0.34 0.16 156 1.20 0.97\n130308 tidal FF, Maver Islands \u000227.0 2.05 319 0.31 0.15 156 1.12 0.97\n130308 tidal FF, Maver Islands \u000227.0 2.09 328 0.28 0.14 157 0.99 0.95\n130308 tidal FF, Maver Islands \u000227.0 2.04 311 0.33 0.16 152 1.17 1.00\naSee text for explanation.\nD20305 OBBARD ET AL.: FROST FLOWER SURFACE AREA AND CHEMISTRY\n11 of 14\nD20305\nwere significantly salinity enhanced, compared to the local\nwater, consistent with generally accepted theory that frost\nflowers derive their salinity from available brine, with brine\nchannels an important source.\n4.2. Growth Time, Temperature, and Salinity of Frost\nFlowers\n[47] In general, a longer elapsed time since the start of\ngrowth leads to lower FF bulk salinity, as observed by other\nresearchers [Perovich and Richter-Menge, 1994; Alvarez-\nAviles et al., 2008]. For test hole frost flowers, this is due to\nfurther frost flower growth from the vapor. For tidal pool\nfrost flowers, this may also be due to blowing snow caught\non frost flowers or to desalination of the tidal pool through\nthe melting of accumulated snow. Frost flowers from the\ncrack and tidal pool locations, which had a renewable\nsource of 21 psu water, became less saline with time. Frost\nflowers found in narrow tidal cracks, however, became\nmore saline with time, despite further vapor deposition.\nThese frost flowers were protected from blowing snow by\nthe confines of the crack and were fed by undiluted water\nfrom the bay beneath. Hence, salinity can increase with time\nwhere a tidal source is available and not diluted.\n[48] Frost flower bulk salinity decreased with decreasing\nair temperature for test hole frost flowers and for tidal frost\nflowers formed at temperatures below \u000223\u0002C. Unless the\nseawater included melted sea ice as found by Alvarez-Aviles\net al. [2008], for which we found no other evidence, this\nfinding remains a mystery. Only in the crack frost flowers\nand in tidal frost flowers above \u000223\u0002C did bulk salinity\nincrease despite decreasing temperature, as reported by\nother researchers [Perovich and Richter-Menge, 1994].\n4.3. Ion Enrichment, Growth Time, and Temperature\n[49] There is no quantitative correlation of bromide\nconcentration with either temperature or growth time, al-\nthough this could be related to lower overall bromide\nconcentrations as a fraction of total ion concentration,\nmaking measurement error a greater proportion of the value.\n[50] Comparisons between our data and that previously\npublished may also be made. The Cl\/Na ratio for SMOW is\n1.79 [Rankin et al., 2000]. Despite the lower salinity of the\nHudson Bay, the Cl\/Na ratio found in water there is about\nthe same: 1.77 nearshore and 1.72 outside the Bill of\nPortland Island. Frost flowers, however, had enhanced\nCl\/Na ratios, ranging from 1.89 to 2.10, which is an enrich-\nment of 10% to 18%. This result was unexpected. Even if\nprecipitation of mirabilite removed all the available sulfate,\nwhich was not the case, only one eighth of the sodium\nwould be lost. Our Cl\/Na enhancement was greater than that\nof 3% found in frost flowers collected by Rankin et al.\n[2000] in the Weddell Sea and than that of the 6% in frost\nflowers collected by Simpson et al. [2005] near Barrow, and\nit remains another mystery.\n[51] Bromide was enhanced (relative to chloride) in test\nhole frost flowers. In the other locations, we found Ef (Br)\nclose to unity, similar to Alvarez-Aviles et al. [2008] results\nin Barrow frost flowers. Simpson et al. [2005] found no\nbromide enrichment in Barrow test hole frost flowers,\nhowever Rankin found slight enhancement (1.14) at the\nMertz Glacier (Antarctica), and Douglas found bromide\nenhancements of 1.30 to 1.93 in Barrow frost flowers\n(T. A. Douglas, personal correspondence, 2009). These\ndifferences may be due to differences in formation temper-\nature or other factors not consistently recorded in previous\nfrost flower field studies.\n4.4. Growth Time, Specific Surface Area,\nand Temperature\n[52] Longer growth time at cold temperatures leads to\nhigher SSA because of further dendritic growth. The corre-\nlation of SSA to growth time across all our samples was\n0.71, with correlations within a given location being even\nstronger. Frost flowers will continue to grow as long as\nsupersaturation is adequate and they are undisturbed. Even\nwith test hole frost flowers, where the surface of the ice\nappeared nearly dry, supersaturation was sufficient to lead\nto increased SSA after 26 h. The types of macroscale (e.g.,\nribs) and microscale roughness (e.g., growth striations)\nshown in Figure 4 would also contribute to higher SSA,\nas would the collection of blowing snow. When temper-\natures rise and plates or needles are formed instead of\ndendritic structures, lower SSA may result. However, be-\ncause frost flowers grow by step nucleation, and near-\nsurface temperature and supersaturation vary with time,\ntide, and wind, there is no single cutoff between these\nhabits, and a mixture can be found at any given location.\n[53] Frost flower SAI is negatively correlated (0.76) with\ntemperature, and this is consistent with the assertion by\nDomine´ et al. [2005] that brine on wet frost flowers\nsmoothes out microstructures and leads to lower SAI\nvalues. However, more would need to be done to establish\ncausality, as supersaturation is related to temperature and\nsecondary crystal growth habit is based on both of these as\nwell as on time. Further, any increase in SAI with colder\ntemperatures would be offset by the opposite effect of\ntemperature on the deposition and re-emission of sea salt\naerosol, as warmer frost flower fields support greater relative\nhumidity and air-ice exchange [Piot and von Glasow, 2008].\n[54] In general, much more could be done on a systematic\nstudy of frost flower crystallography, as to date it has been\nlargely based on a nonsystematic series of observations\ntogether with comparisons to the development of snow\ncrystals. Frost flowers differ from snow in their constant\norientation in space, their substrate, their brine and their\nchemistry, all of which may have implications for their\ngrowth and development.\n[55] Domine´ et al. [2005] calculated an SAI of 1.4 m2 m\u00022\nfor dry frost flowers by using SSA values measured on\nsamples from Barrow and coverage observed at Spitsber-\ngen. They went on to estimate TSA of less than 1 m2 m\u00022\nfor wet frost flowers. However, the frost flowers at Spits-\nbergen were described as wet and found in patches provid-\ning coverage of only 25%. We believe this low coverage\ncontributes to a somewhat low SAI value. We found\ncoverage of 75% and 90% in the tidal pools and 100% in\nthe test holes after 12 h and SAI of 1.8 to 2.1 m2 m\u00022.\n4.5. Influence of Frost Flowers on Atmospheric\nChemistry\n[56] As discussed by Alvarez-Aviles et al. [2008] an\nimmeasurably small amount of bromide depletion would\nbe sufficient to cause the ozone depletion observed. Our\nresults show bromide depletion relative to chloride in some\nD20305 OBBARD ET AL.: FROST FLOWER SURFACE AREA AND CHEMISTRY\n12 of 14\nD20305\nsamples, enrichment in others. The difference may be\nrelated to the loss of chloride due to hydrohalite (NaCl \u0003\n2H20) precipitation at \u000222\u0002C. Frost flowers do provide\nadditional surface area on which the conversion of bromide\nin sea salt to Br2 can take place [Domine´ et al., 2005], but\nthey do not increase effective surface area by as much as has\nbeen speculated [Roscoe et al., 2001].\n[57] This leaves open the question of whether they are the\nprimary source of atmospheric reactive bromine [Kaleschke\net al., 2004]. Domine´ et al. [2005] speculate that surfaces\nwhere the sea salt coming from frost flowers is deposited\nmay produce faster bromine activation, but we have ob-\nserved that the threshold for blowing snow is lower than\nthat for frost flower destruction, and our observations of\nfrost flower rigidity suggest that, if frost flowers are\ncontributing chemicals, it is more likely through scouring\n(of the frost flower surface by wind) than by fragmentation.\nModels developed by Piot and von Glasow [2008] pro-\nduced results not supported by experimental data when the\nassumption was that bromine comes directly from the frost\nflower surfaces. Adding frost flower aerosols as a source\nimproved results [Piot and von Glasow, 2008]. Further, the\nmodels suggest that to produce the best agreement with\nexperimental data showing high bromine levels in the\ntroposphere, the model of frost flower contributions must\nbe augmented with the effect of bromine recycling on snow.\n[58] We did not observe frost flowers in the act of\nbreaking, but we saw large pieces of frost flowers lying\njust downwind of frost flower fields (the first time broken\npieces have been observed) that were clearly too large to be\nlofted. We also observed that the wind speed threshold was\nmuch lower for snow mobilization than for frost flower\nbreakage. Recently, blowing snow from a sea ice surface\nhas been proposed as the source of reactive bromine\n[Simpson et al., 2005; Yang et al., 2008]. Legagneux et al.\n[2002] found SSA of snow between 100 and 1580 cm\u00022 g\u00021,\ndepending on snow type and age, and SAI of several\nthousand m2 m\u00022. Our results suggest that blowing snow\ncould be further salinated by contact with frost flowers, that\nperhaps the role of frost flowers by themselves has been\noverstated, and that it is the combination of frost flowers\nand blowing snow that forms the primary source of atmo-\nspheric reactive bromine.\n[59] Acknowledgments. This work was funded under NERC grant\nNE\/D006104\/1, ‘‘Impact of combined iodine and bromine release on the\nArctic atmosphere (COBRA): An Arctic IPY consortium.’’ The authors\nwould like to thank Florent Domine´ and Jean-Charles Gallet of the\nLaboratoire de Glaciologie et Ge´ophysique de l’Environnement (LGGE)\nin France for hosting a visit and providing training on the BET method. The\nvolumetric BET apparatus at the British Antarctic Survey was built on the\nbasis of observations made of the apparatus at LGGE and with the\nadditional advice of Michael Kerbrat of the Paul Scherrer Institute in\nSwitzerland. The authors also wish to acknowledge their partners at the\nUniversity of Leeds and the University of York for their logistical assistance\nbefore and during the field work.\nReferences\nAlvarez-Aviles, L., W. R. Simpson, T. A. Douglas, M. Sturm, D. Perovich,\nand F. Domine´ (2008), Frost flower chemical composition during growth\nand its implications for aerosol production and bromine activation,\nJ. Geophys. Res., 113, D21304, doi:10.1029\/2008JD010277.\nBarrie, L. A., J. W. Bottenheim, R. C. Schnell, P. J. Crutzen, and R. A.\nRasmussen (1988), Ozone destruction and photochemical reactions at\npolar sunrise in the lower Arctic atmosphere, Nature, 334, 138–141,\ndoi:10.1038\/334138a0.\nBottenheim, J. W., A. G. Gallant, and K. A. Brice (1986), Measurements of\nNOy species and O3 at 82\u0002N latitude, Geophys. Res. Lett., 13(2), 113–\n116, doi:10.1029\/GL013i002p00113.\nBottenheim, J. W., J. D. Fuentes, D. W. Tarasick, and K. G. Anlauf (2002),\nOzone in the Arctic lower troposphere during winter and spring 2000\n(ALERT2000), Atmos. Environ., 36(15–16), 2535–2544, doi:10.1016\/\nS1352-2310(02)00121-8.\nBrunauer, S., P. H. Emmett, and E. Teller (1938), Adsorption of gases in\nmultimolecular layers, J. Am. Chem. Soc., 60, 309–319, doi:10.1021\/\nja01269a023.\nBrunauer, S., L. S. Deming, W. E. Deming, and E. Teller (1940), On a\ntheory of the Van Der Waals adsorption of gases, J. Am. Chem. Soc., 62,\n1723–1732, doi:10.1021\/ja01864a025.\nCarpenter, L. J., J. R. Hopkins, C. E. Jones, A. C. Lewis, R. Parthipan, D. J.\nWevill, L. Poissant, M. Pilote, and P. Constant (2005), Abiotic source of\nreactive organic halogens in the sub-arctic atmosphere?, Environ. Sci.\nTechnol., 39(22), 8812–8816, doi:10.1021\/es050918w.\nChaix, L., J. Ocampo, and F. Domine´ (1996), Adsorption of CH4 on\nlaboratory-made crushed ice and on natural snow at 77 K: Atmospheric\nimplications, C. R. Acad. Sci, Ser. II, 322, 609–616.\nCrocker, G. B., and J. E. Lewis (1985), Some physical properties of snow\ncover on evolving first year sea ice, paper presented at 42nd Eastern\nSnow Conference, Montreal, Canada, 6–7 June.\nDe´ry, S. J., M. Stieglitz, E. C. McKenna, and E. F. Wood (2005), Char-\nacteristics and trends of river discharge into Hudson, James, and Ungava\nBays, 1964 – 2000, J. Clim., 18(14), 2540 – 2557, doi:10.1175\/\nJCLI3440.1.\nDomine´, F., L. Chaix, and L. Hanot (2000), Reanalysis and new measure-\nments of N2 and CH4 adsorption on ice and snow, J. Colloid Interface\nSci., 227, 104–110, doi:10.1006\/jcis.2000.6883.\nDomine´, F., A. Cabanes, and L. Legagneux (2002), Structure, microphysics\nand surface area of the Arctic snowpack near Alert during the ALERT\n2000 campaign, Atmos. Environ., 36, 2753–2765, doi:10.1016\/S1352-\n2310(02)00108-5.\nDomine´, F., A. S. Taillandier, W. R. Simpson, and K. Severin (2005),\nSpecific surface area, density and microstructure of frost flowers, Geo-\nphys. Res. Lett., 32, L13502, doi:10.1029\/2005GL023245.\nDrinkwater, M. R., and G. B. Crocker (1988), Modelling changes in the\ndialectric and scattering properties of young snow-covered sea ice at GHz\nfrequencies, J. Glaciol., 34, 274–282.\nFan, S. M., and D. J. Jacob (1992), Surface ozone depletion in Arctic spring\nsustained by bromine reactions on aerosols, Nature, 359, 522–524,\ndoi:10.1038\/359522a0.\nFoster, K. L., R. A. Plastridge, J. W. Bottenheim, P. B. Shepson, B. J.\nFinlayson-Pitts, and C. W. Spicer (2001), The role of Br-2 and BrCl in\nsurface ozone destruction at polar sunrise, Science, 291(5503), 471–474,\ndoi:10.1126\/science.291.5503.471.\nGonda, T., and S. Nakahara (1997), Dendritic ice crystals with faceted tip\ngrowing from the vapor phase, J. Cryst. Growth, 173, 189 – 193,\ndoi:10.1016\/S0022-0248(96)00804-4.\nHallett, J., and B. J. Mason (1958), The influence of temperature and\nsupersaturation grown from the vapour, Proc. R. Soc., Ser. A, 247,\n440–453.\nHanot, L., and F. Domine´ (1999), Evolution of the surface area of a snow\nlayer, Environ. Sci. Technol., 33(23), 4250 – 4255, doi:10.1021\/\nes9811288.\nHoff, J. T., D. Gregor, D. Mackay, F. Wania, and C. Q. Jia (1998), Mea-\nsurement of the specific surface area of snow with the nitrogen adsorption\ntechnique, Environ. Sci. Technol., 32(1), 58–62, doi:10.1021\/es970225i.\nHopper, J. F., L. A. Barrie, A. Silis, W. Hart, A. J. Gallant, and H. Dryfhout\n(1998), Ozone and meteorology during the 1994 Polar Sunrise Experi-\nment, J. Geophys. Res., 103, 1481–1492, doi:10.1029\/97JD02888.\nIngram, R. G. (1981), Characteristics of the Great Whale River Plume,\nJ. Geophys. Res., 86(C3), 2017–2023, doi:10.1029\/JC086iC03p02017.\nIngram, R. G., and P. Larouche (1987), Variability of an under-ice river\nplume in Hudson Bay, J. Geophys. Res., 92(C9), 9541 – 9547,\ndoi:10.1029\/JC092iC09p09541.\nKaleschke, L., et al. (2004), Frost flowers on sea ice as a source of sea salt\nand their influence on tropospheric halogen chemistry, Geophys. Res.\nLett., 31, L16114, doi:10.1029\/2004GL020655.\nKnight, C. A. (1972), Snow crystal growth habits, Trans. AGU, 53, 382.\nLegagneux, L., A. Cabanes, and F. Domine´ (2002), Measurement of the\nspecific surface area of 176 snow samples using methane adsorption at\n77 K, J. Geophys. Res., 107(D17), 4335, doi:10.1029\/2001JD001016.\nLi, S. S., and R. G. Ingram (2007), Isopycnal deepening of an under-ice\nriver plume in coastal waters: Field observations and modeling, J. Geo-\nphys. Res., 112, C07010, doi:10.1029\/2006JC003883.\nMakshtas, A. P. (1991), The Heat Budget of Arctic Ice in the Winter,\ntranslated from Russian by E. L. Andreas, 77 pp., Int. Glaciol. Soc.,\nCambridge, U. K.\nD20305 OBBARD ET AL.: FROST FLOWER SURFACE AREA AND CHEMISTRY\n13 of 14\nD20305\nMartin, S., Y. Yu, and R. Drucker (1996), The temperature dependence of\nfrost flower growth on laboratory sea ice and the effect of the flowers on\nthe infrared observations of the surface, J. Geophys. Res., 101, 12,111–\n12,125, doi:10.1029\/96JC00208.\nMason, B. J. (1992), Snow crystals, natural and man made, Contemp. Phys.,\n33(4), 227–243, doi:10.1080\/00107519208223972.\nMcConnell, J. C., G. S. Henderson, L. A. Barrie, J. Bottenheim, H. Niki,\nC. H. Langford, and E. M. J. Templeton (1992), Photochemical bromine\nproduction implicated in the Arctic boundary-layer ozone depletion,\nNature, 355, 150–152, doi:10.1038\/355150a0.\nNelson, J. (2001), Growth mechanisms to explain the primary and second-\nary habits of snow crystals, Philos. Mag. A, 81, 2337–2373.\nNelson, J. (2005), Branch growth and sidebranching in snow crystals,\nCryst. Growth Design, 5(4), 1509–1525, doi:10.1021\/cg049685v.\nPerovich, D. K., and J. A. Richter-Menge (1994), Surface characteristics of\nlead ice, J. Geophys. Res., 99(C8), 16,341 – 16,350, doi:10.1029\/\n94JC01194.\nPiot, M., and R. von Glasow (2008), The potential importance of frost\nflowers, recycling on snow, and open leads for ozone depletion events,\nAtmos. Chem. Phys., 8, 2437–2467.\nRankin, A. M., V. Auld, and E. W. Wolff (2000), Frost flowers as a source\nof fractionated sea salt aerosol in the polar regions, Geophys. Res. Lett.,\n27(21), 3469–3472, doi:10.1029\/2000GL011771.\nRankin, A. M., E. W. Wolff, and S. Martin (2002), Frost flowers: Implica-\ntions for tropospheric chemistry and ice core interpretation, J. Geophys.\nRes., 107(D23), 4683, doi:10.1029\/2002JD002492.\nRichter, A., F. Wittrock, M. Eisinger, and J. P. Burrows (1998), GOME\nobservations of tropospheric BrO in northern hemispheric spring and\nsummer 1997, Geophys. Res. Lett., 25, 2683 – 2686, doi:10.1029\/\n98GL52016.\nRoscoe, H. K., K. Kreher, and U. Friess (2001), Ozone loss episodes in the\nfree Antarctic troposphere, suggesting a possible climate feedback, Geo-\nphys. Res. Lett., 28, 2911–2914, doi:10.1029\/2000GL012583.\nSimpson, W. R., L. Alvarez-Aviles, T. A. Douglas, M. Sturm, and F. Domine´\n(2005), Halogen in the coastal snowpack near Barrow Alaska: Evidence\nfor active bromine air-snow chemistry during springtime, Geophys. Res.\nLett., 32, L04811, doi:10.1029\/2004GL021748.\nSpicer, C. W., et al. (2002), Molecular halogens before and during ozone\ndepletion events in the Arctic at polar sunrise: Concentrations and\nsources, Atmos. Environ., 36(15–16), 2721–2731, doi:10.1016\/S1352-\n2310(02)00125-5.\nSturm, M., D. K. Perovich, and J. Holmgren (2002), Thermal conductivity\nand heat transfer through snow on the ice of the Beaufort Sea, J. Geo-\nphys. Res., 107(C10), 8043, doi:10.1029\/2000JC000409.\nTaillandier, A.-S., F. Domine, W. R. Simpson, M. Sturm, T. A. Douglas,\nand K. Severin (2006), Evolution of the Snow Area Index of the subarctic\nsnowpack in Central Alaska over a whole season. Consequences for the\nair to snow transfer of pollutants, Environ. Sci. Technol., 40, 7521–7527,\ndoi:10.1021\/es060842j.\nThomas, D. N., and G. S. Dieckmann (2003), Sea Ice: An Introduction to\nits Physics, Chemistry, Biology and Geology, pp. 55–58, Blackwell Sci.,\nOxford, U. K.\nWagner, T., C. Leue, M. Wenig, K. Pfeilsticker, and U. Platt (2001), Spatial\nand temporal distribution of enhanced boundary layer BrO concentrations\nmeasured by the GOME instrument aboard ERS-2, J. Geophys. Res., 106,\n24,225–24,235, doi:10.1029\/2000JD000201.\nWolff, E. W., et al. (2003), An ice core indicator of Antarctic sea ice\nproduction?, Geophys. Res. Lett., 30(22), 2158, doi:10.1029\/\n2003GL018454.\nYang, X., J. A. Pyle, and R. A. Cox (2008), Sea salt aerosol production and\nbromine release: Role of snow on sea ice, Geophys. Res. Lett., 35,\nL16815, doi:10.1029\/2008GL034536.\n\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\nH. M. Atkinson, R. W. Obbard, H. K. Roscoe, and E. W. Wolff, British\nAntarctic Survey, Madingley Road, Cambridge CB3 0ET, UK. (hkro@bas.\nac.uk)\nD20305 OBBARD ET AL.: FROST FLOWER SURFACE AREA AND CHEMISTRY\n14 of 14\nD20305\n"}