{"doi":"10.1079\/BJN20051448","coreId":"65505","oai":"oai:dro.dur.ac.uk.OAI2:5631","identifiers":["oai:dro.dur.ac.uk.OAI2:5631","10.1079\/BJN20051448"],"title":"Comparison of methods to estimate non-milk extrinsic sugars and their application to sugars in the diet of young adolescents.","authors":["Kelly, S.A.M.","Summerbell, C.D.","Rugg-Gunn, A.J.","Adamson, A.","Fletcher, E.","Moynihan, P.J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-07-01","abstract":"Consistent information on the non-milk extrinsic sugars (NMES) content of foods and the NMES intake by the population is required in order to allow comparisons between dietary surveys. A critical appraisal of methods of NMES estimation was conducted to investigate whether the different published methods for estimating the NMES content of foods lead to significantly different values for the dietary intake of NMES by children and to consider the relative practicality of each method. NMES values of foods were calculated using three different published descriptions of methods of NMES estimation, and the values were compared within food groups. Dietary intake values for English children aged 11–12 years were calculated using each method and compared in terms of overall NMES intake and the contribution of different food groups to NMES intake. There was no significant difference in the dietary intake of NMES in children between the method used in the National Diet and Nutrition Surveys (NDNS) (81·9 g\/d; 95 % CI 79·0, 84·7) and a method developed by the Human Nutrition Research Centre (84·3 g\/d; 95 % CI 81·4, 87·2) at Newcastle University, UK, although the latter gave slightly higher values. An earlier method used by the Ministry of Agriculture, Food and Fisheries gave significantly higher values than the other two methods (102·5 g\/d; 95 % CI 99·3, 105·6; P<0·05). The method used in the NDNS surveys and the method used by the Human Nutrition Research Centre at Newcastle University are both thorough and detailed methods that give consistent results. However, the method used in the NDNS surveys was more straightforward to apply in practice and is the best method for a single uniform approach to the estimation of NMES","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65505.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5631\/1\/5631.pdf","pdfHashValue":"91fca103ab9c25a61c9c923e880d0dc013a5a395","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5631<\/identifier><datestamp>\n      2013-07-10T08:25:06Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Comparison of methods to estimate non-milk extrinsic sugars and their application to sugars in the diet of young adolescents.<\/dc:title><dc:creator>\n        Kelly, S.A.M.<\/dc:creator><dc:creator>\n        Summerbell, C.D.<\/dc:creator><dc:creator>\n        Rugg-Gunn, A.J.<\/dc:creator><dc:creator>\n        Adamson, A.<\/dc:creator><dc:creator>\n        Fletcher, E.<\/dc:creator><dc:creator>\n        Moynihan, P.J.<\/dc:creator><dc:description>\n        Consistent information on the non-milk extrinsic sugars (NMES) content of foods and the NMES intake by the population is required in order to allow comparisons between dietary surveys. A critical appraisal of methods of NMES estimation was conducted to investigate whether the different published methods for estimating the NMES content of foods lead to significantly different values for the dietary intake of NMES by children and to consider the relative practicality of each method. NMES values of foods were calculated using three different published descriptions of methods of NMES estimation, and the values were compared within food groups. Dietary intake values for English children aged 11–12 years were calculated using each method and compared in terms of overall NMES intake and the contribution of different food groups to NMES intake. There was no significant difference in the dietary intake of NMES in children between the method used in the National Diet and Nutrition Surveys (NDNS) (81·9 g\/d; 95 % CI 79·0, 84·7) and a method developed by the Human Nutrition Research Centre (84·3 g\/d; 95 % CI 81·4, 87·2) at Newcastle University, UK, although the latter gave slightly higher values. An earlier method used by the Ministry of Agriculture, Food and Fisheries gave significantly higher values than the other two methods (102·5 g\/d; 95 % CI 99·3, 105·6; P<0·05). The method used in the NDNS surveys and the method used by the Human Nutrition Research Centre at Newcastle University are both thorough and detailed methods that give consistent results. However, the method used in the NDNS surveys was more straightforward to apply in practice and is the best method for a single uniform approach to the estimation of NMES.<\/dc:description><dc:subject>\n        Sugars<\/dc:subject><dc:subject>\n         Non-milk extrinsic sugars<\/dc:subject><dc:subject>\n         Dietary intakes.<\/dc:subject><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        British journal of nutrition, 2005, Vol.94(1), pp.114-124 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-07-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5631<\/dc:identifier><dc:identifier>\n        issn:0007-1145<\/dc:identifier><dc:identifier>\n        issn: 1475-2662<\/dc:identifier><dc:identifier>\n        doi:10.1079\/BJN20051448<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5631\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1079\/BJN20051448<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5631\/1\/5631.pdf<\/dc:identifier><dc:rights>\n        Copyright © The Nutrition Society 2005. This paper has been published by Cambridge University Press in \"British journal of nutrition\" (94: 1 (2005) 114-124) http:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=920172<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1475-2662","0007-1145","issn: 1475-2662","issn:0007-1145"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Sugars","Non-milk extrinsic sugars","Dietary intakes."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n23 March 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nKelly, S. A. M. and Summerbell, C. and Rugg-Gunn, A. J. and Adamson, A. and Fletcher, E. and Moynihan,\nP. J. (2005) ’Comparison of methods to estimate non-milk extrinsic sugars and their application to sugars in\nthe diet of young adolescents.’, British journal of nutrition., 94 (1). pp. 114-124.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1079\/BJN20051448\nPublisher’s copyright statement:\nCopyright The Nutrition Society 2005. This paper has been published by Cambridge University Press in ”British\njournal of nutrition” (94: 1 (2005) 114-124)\nhttp:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=onlineaid=920172\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n23 March 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nPublished version \n \nCitation for published item: \nKelly, S. A. M. and Summerbell, C. and Rugg-Gunn, A. J. and Adamson, A. and Fletcher, E. \nand Moynihan, P. J. (2005) 'Comparison of methods to estimate non-milk extrinsic sugars \nand their application to sugars in the diet of young adolescents.', British journal of nutrition., \n94 (1). pp. 114-124. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1079\/BJN20051448 \n \nPublisher’s copyright statement: \nCopyright © The Nutrition Society 2005. This paper has been published by Cambridge \nUniversity Press in \"British journal of nutrition\" (94: 1 (2005) 114-124) \nhttp:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=920172 \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nComparison of methods to estimate non-milk extrinsic sugars and their\napplication to sugars in the diet of young adolescents\nSarah A. M. Kelly1, Carolyn Summerbell2, Andrew J. Rugg-Gunn1, Ashley Adamson3, Emma Fletcher3\nand Paula J. Moynihan1*\n1School of Dental Sciences, University of Newcastle, Framlington Place, Newcastle upon Tyne NE2 4BW, UK\n2School of Health, University of Teesside, Middlesbrough TS1 3BA, UK\n3Human Nutrition Research Centre, University of Newcastle, Wellcome Laboratories, Royal Victoria Infirmary, Newcastle upon Tyne\nNE1 4LP, UK\n(Received 18 August 2004 – Revised 31 January 2005 – Accepted 1 February 2005)\nConsistent information on the non-milk extrinsic sugars (NMES) content of foods and the NMES intake by the population is required in order to allow\ncomparisons between dietary surveys. A critical appraisal of methods of NMES estimation was conducted to investigate whether the different published\nmethods for estimating the NMES content of foods lead to significantly different values for the dietary intake of NMES by children and to consider the\nrelative practicality of each method. NMES values of foods were calculated using three different published descriptions of methods of NMES estimation,\nand the values were compared within food groups. Dietary intake values for English children aged 11–12 years were calculated using each method and\ncompared in terms of overall NMES intake and the contribution of different food groups to NMES intake. There was no significant difference in the\ndietary intake of NMES in children between the method used in the National Diet and Nutrition Surveys (NDNS) (81·9 g\/d; 95% CI 79·0, 84·7) and\na method developed by the Human Nutrition Research Centre (84·3 g\/d; 95% CI 81·4, 87·2) at Newcastle University, UK, although the latter gave slightly\nhigher values. An earlier method used by the Ministry of Agriculture, Food and Fisheries gave significantly higher values than the other two methods\n(102·5 g\/d; 95% CI 99·3, 105·6; P,0·05). The method used in the NDNS surveys and the method used by the Human Nutrition Research Centre at\nNewcastle University are both thorough and detailed methods that give consistent results. However, the method used in the NDNS surveys was more\nstraightforward to apply in practice and is the best method for a single uniform approach to the estimation of NMES.\nSugars: Non-milk extrinsic sugars: Dietary intakes\nSugars are the most important dietary cause of caries in children\nand adults (Sheiham, 2001). In the UK, £1·5 billion (direct costs)\nare spent each year on treating dental caries (Rugg-Gunn, 2001).\nBoth the frequency of consumption and the total amount of sugars\nare important in the aetiology of caries (Sheiham, 2001; World\nHealth Organization, 2003). In 1989, a Committe on Medical\nAspects of Food Policy (COMA) report classified sugars,\nmainly for health education purposes, into intrinsic and extrinsic\nsugars (Department of Health, 1989). Extrinsic sugars were classi-\nfied as those sugars which were not located within the cellular\nstructure of food, and were further divided into milk sugars and\nnon-milk extrinsic sugars (NMES). There is no evidence that\nsugars naturally incorporated into the cellular structure of foods\n(intrinsic sugars) or lactose in milk and milk products (milk\nsugars) are harmful to health. However, NMES are harmful to\nteeth (Department of Health, 1989) and may be associated with\nobesity (Ludwig et al. 2001; World Health Organization, 2003)\nand diabetes (Schulze et al. 2004).\nThe term NMES has generally only been adopted by the UK,\nalthough ‘free sugars’ is more internationally accepted as it was\nused by the WHO in the Technical Series Report Diet, Nutrition\nand the Prevention of Chronic Diseases (World Health Organiz-\nation, 1990). This WHO report recommended that the consump-\ntion of free sugars should contribute no more than 10% of\nenergy intake. There are, however, no studies in the literature in\nwhich free sugars in foods or diets have been estimated and\nreported. The term ‘free sugars’ is, however, synonymous with\nthe term NMES, and if these terms are to be adopted in research\nworldwide, a good, clear quantitative method for the estimation of\nNMES or free sugars is required.\nThe recommendation of the 1989 COMA report was that NMES\nconsumption should be reduced (Department of Health, 1989).\nThe subsequent 1991 COMA report on dietary reference values\n(Department of Health, 1991) stated that NMES should contribute\nno more than 10%, or 60 g\/d, to energy intake. Recent reports\nreiterate the importance of limiting NMES (or ‘free sugars’) to\nprevent dental caries (Sheiham, 2001; World Health Organization,\n2003; Moynihan & Peterson, 2004). To achieve and monitor this\npublic health goal, consistent information on the NMES content of\nfoods and the NMES intake of the population is required in order\nto allow comparisons between dietary surveys. However, since\nNMES are chemically indistinguishable from other sugars, they\n*Corresponding author: Dr Paula Moynihan, fax þ44 (0) 191 222 5928, email p.j.moynihan@ncl.ac.uk\nAbbreviations: COMA, Committe on Medical Aspects of Food Policy; FSA, Food Standards Agency; HNRC, Human Nutrition Research Centre; MAFF, Ministry of\nAgriculture, Food and Fisheries; NDNS, National Diet and Nutrition Survey; NMES, non-milk extrinsic sugars.\nBritish Journal of Nutrition (2005), 93, 114–124 DOI: 10.1079\/BJN20051448\nq The Authors 2005\ncannot be quantified by conventional techniques used for the anal-\nysis of sugars in foods (Johnson et al. 1996). Those surveys in\nwhich NMES intake has been reported have estimated the\nNMES of foods based on the examination of recipes or other\ndata from the available food tables. The authors have previously\npublished a comprehensive literature review of the different\nmethods of NMES estimation (Kelly et al. 2003).\nThree of the five methods of NMES estimation that were ident-\nified were chosen for the present study. These three methods\nwere:\n1. the method used by the Foods Standards Agency (FSA) in\nthe National Diet and Nutrition Surveys (NDNS; Buss et al.\n1994; Gregory et al. 1995, 2000; Finch et al. 1998);\n2. an earlier Ministry of Agriculture, Food and Fisheries (MAFF;\nnow FSA) method reported in The Dietary and Nutritional\nSurvey of British Adults – Further Analysis (Mills, 1994);\n3. a method that has been used by the Human Nutrition\nResearch Centre (HNRC) at Newcastle University, UK\n(Rugg-Gunn et al. 1993).\nThe NDNS method was selected as it is the ‘standard’ method\nused consistently in the NDNS published since 1995. The earlier\nMAFF method was chosen because it appeared to be a simple and\nrelatively easy method to apply; therefore, this method could be\nuseful to countries that do not have access to FSA food compo-\nsition databases and could aid in obtaining more comprehensive\ndata on NMES from worldwide populations. If a simple method\nalso makes little difference to dietary outcomes, it could be\nargued that the effort required to apply the other methods is not\nwarranted.\nThe HNRC method is currently used in cross-sectional studies\ninvestigating dietary trends in adolescents over the past three dec-\nades (Rugg-Gunn et al. 2005) and has developed over time from a\nmethod based on added sugars. The other two published methods,\nwhich were not selected for this analysis, appeared to be similar\nand were both based on the NDNS method (Bolton-Smith &\nWoodward, 1994; Drummond & Kirk, 1998).\nThe aims of the work were:\n1. to estimate the NMES content of all foods in the food tables\nin the fifth edition of McCance and Widdowson’s The Com-\nposition of Foods (Holland et al. 1991) and to compare the\nvalues obtained by the three methods;\n2. to compare the NMES intakes of young English adolescents\n(using a recently collected database of food-intake records)\ncalculated using the three methods, for all children and for\neach gender separately, and to calculate the contribution of\ndifferent food groups to NMES intake;\n3. to assess the advantages and disadvantages of each method\nin terms of practicality, degree of complexity and labour\nintensity.\nMethods\nPublished methods of NMES estimation\nThe three methods of NMES estimation are listed in Table 1,\nalong with published details of each method as described in the\nliterature. It should, however, be noted that in each case the\ndetails of the methods used were considerably more complex\nthan (or different from) those of the outline method described\nin the literature. It was not possible to replicate any of the\nmethods based solely on the limited descriptions given in the pub-\nlished literature, without further clarification from the authors of\nthe respective studies. These further details of the methods are\ngiven in Appendix 1.\nEven with this additional information from the authors, there\nwere a number of foods and types of food for which even the\nadditional guidelines supplied were insufficient when the NMES\nvalues were calculated, and it was not clear how to calculate\nthe NMES value. The assumptions made for such foods are\nalso listed in Appendix 1.\nCalculation of NMES values for food tables\nThe NMES values (g\/100 g) for all foods in the fifth edition of\nMcCance and Widdowson’s The Composition of Foods (Holland\net al. 1991) were estimated for each of the three methods, and\nthe calculated figures were entered into fields in the computerised\nfood tables held by the HNRC at Newcastle University in order to\ncarry out the dietary intake analysis.\nIn order to investigate between-method differences for theNMES\ncontent of different types of foods, those foods known tomake a sub-\nstantial contribution to NMES were grouped together according to\nthe classifications in the fifth edition of the food tables: biscuits,\ncakes, confectionery (chocolate and non-chocolate confectionery),\nbreakfast cereals, sugars, syrups and preserves, ice creams, yoghurts\n(including fromage frais), fruit juices, fruit, soft drinks, cereal\nproducts and milk products. The data in each food group were\nTable 1. Summary of published descriptions of methods for non-milk extrinsic sugar (NMES) estimation\nMethod Published details of NMES method Further information\nNDNS ‘Non-milk extrinsic sugars ¼ All sugars in fruit juices, table sugar, honey,\nsucrose, glucose and glucose syrups added to food plus 50 % of the\nsugars in canned, stewed, dried or preserved fruits’ (Buss et al. 1994;\nGregory et al. 1995, 2000; Finch et al. 1998)\nThis method has been used by the Food Standards Agency (formerly\nMAFF) in the NDNS published since 1995. The actual method\nused is substantially more complex than the published details\n(Appendix 1)\nMAFF ‘Non-milk extrinsic sugars intakes estimated from total sugars by deducting\nthe sugars from liquid cow’s milk’ (Mills, 1994)\nThis method precedes the above NDNS method and was used by\nMAFF in The Dietary and Nutritional Survey of British Adults –\nFurther Analysis (Mills, 1994), which was a re-analysis of data collected\nin 1990. The actual method used was different from the details of\nthe method published. Further details are given in Appendix 1\nHNRC ‘Added sugars plus sugars from fruit in fruit juices and other soft drinks . . .\nFruit sugars deriving from the fruit in jams and yoghurts classified\nas intrinsic’ (Rugg-Gunn et al. 1993)\nThis method has been used and developed over time at the HNRC.\nThe actual method used is substantially more complex than the\npublished details. Further details are given in Appendix 1\nNDNS, National Diet and Nutrition Surveys; MAFF, Ministry of Agriculture, Food and Fisheries; HNRC, Human Nutrition Research Centre, Newcastle University, UK.\nMethods to estimate non-milk extrinsic sugars 115\ncompared as MAFF v. NDNS, NDNS v. HNRC, and MAFF v.\nHNRC. Mean NMES values for each of these thirteen groups of\nfood were calculated. These mean values were compared between\nthe three methods, and the mean differences between the methods\nand 95% CI were calculated (P,0·05). The values obtained\nbetween methods within food groups were also compared by\npaired t test (two-tailed).\nApplication of calculated NMES values to dietary intake data\nThe mean daily intake of NMES by schoolchildren was calculated\nfrom existing data held in the Northumberland 2000 Microsoft\nAccess database developed at Newcastle University. The database\nincorporates dietary-intake data collected from a study of 424\n(196 boys, 228 girls) Northumbrian children aged 11–12 years\nin 2000 (Rugg-Gunn et al. 2005). Children completed two esti-\nmated 3 d food diaries, and the results are reported as 6 d\nmeans. The mean daily NMES intake of all the children, and of\nboys and girls separately, was calculated. In addition, mean\nintakes of NMES were calculated for thirteen groups of foods\nknown to make a substantial contribution to overall NMES con-\nsumption. Not all the children consumed foods from some of\nthe food groups (i.e. those who ate no foods from a food group\ncontributed 0 g\/d). The number of children who did eat foods\nfrom each food group has been reported. Food groups were classi-\nfied according to FSA classifications for foods in the food tables\n(Holland et al. 1991).\nData analysis was by SPSS (Statistical Package for Social\nScience; SPSS Inc., Chicago IL, USA) version 10. Themean dietary\nintake of NMES (g\/d) and the contribution to percentage energy\nintake were reported with 95% CI (P,0·05). The NMES intakes\nwere compared between methods using Bland–Altman plots\n(Bland & Altman, 1986).\nResults\nNMES values calculated for foods in the fifth edition of McCance\nand Widdowson\nTheMAFFmethod gave significantly higher NMES values (g\/100 g)\nthan the NDNS or HNRC methods for every food group (Table 2)\nexcept fruit juices, soft drinks and confectionery, which were\nequivalent. All three methods gave the same values for soft drinks\nand fruit juices, and the MAFF and HNRC methods gave equivalent\nvalues for chocolate confectionery, soft drinks and fruit juices.\nThere was little significant difference between the NDNS and\nHNRC methods except for the confectionery, fruit and milk\ngroups. The largest significant difference between the NDNS\nmethod and the HNRC method was for chocolate confectionery,\nfor which the HNRC method gave higher NMES values. Both\nmethods gave the same values for fruit juices, soft drinks,\nyoghurts and fromage frais.\nDietary intake of NMES\nWhen the NMES values estimated by the three methods for the\nfoods in the McCance and Widdowson food tables were used to\ncalculate the schoolchildren’s mean dietary NMES intakes\n(Table 3), the MAFF method resulted in significantly higher\nintakes compared with either the NDNS or the HNRC method.\nThere was no statistically significant difference between the T\na\nb\nle\n2\n.\nM\ne\na\nn\nd\nif\nfe\nre\nn\nc\ne\ns\nin\nn\no\nn\n-m\nilk\ne\nx\ntr\nin\ns\nic\ns\nu\ng\na\nr\nv\na\nlu\ne\nb\ne\ntw\ne\ne\nn\nth\ne\nth\nre\ne\nm\ne\nth\no\nd\ns\n,\nfo\nr\ne\na\nc\nh\no\nf\nth\nir\nte\ne\nn\nfo\no\nd\ng\nro\nu\np\ns\nin\nM\nc\nC\na\nn\nc\ne\na\nn\nd\nW\nid\nd\no\nw\ns\no\nn\n’s\nT\nh\ne\nC\no\nm\np\no\ns\nit\nio\nn\no\nf\nF\no\no\nd\ns\n(H\no\nlla\nn\nd\ne\nt\na\nl.\n1\n9\n9\n1\n)\nM\ne\na\nn\nd\nif\nfe\nre\nn\nc\ne\n(g\n\/1\n0\n0\ng\n)\nN\nD\nN\nS\n–\nH\nN\nR\nC\nM\nA\nF\nF\n–\nN\nD\nN\nS\nM\nA\nF\nF\n–\nH\nN\nR\nC\nF\no\no\nd\ng\nro\nu\np\nN\nu\nm\nb\ne\nr\no\nf\nfo\no\nd\ns\nin\ns\na\nm\np\nle\nF\no\no\nd\nc\no\nd\ne\ns\nin\nth\ne\nfi\nft\nh\ne\nd\nit\nio\nn\nM\ne\na\nn\n9\n5\n%\nC\nI\nM\ne\na\nn\n9\n5\n%\nC\nI\nM\ne\na\nn\n9\n5\n%\nC\nI\nB\nis\nc\nu\nit\ns\n1\n6\n9\n3\n–\n1\n0\n8\n2\n1\n·5\n2\n3\n·2\n,\n0\n·2\n3\n·4\n*\n0\n·2\n,\n6\n·7\n1\n·9\n*\n0\n·2\n,\n1\n·9\nC\na\nk\ne\ns\n1\n5\n1\n0\n9\n–\n1\n2\n3\n2\n0\n·4\n2\n1\n·8\n,\n1\n·0\n5\n·3\n*\n1\n·9\n,\n8\n·8\n4\n·9\n*\n1\n·5\n,\n8\n·4\nB\nre\na\nk\nfa\ns\nt\nc\ne\nre\na\nls\n2\n8\n6\n5\n–\n9\n2\n2\n0\n·2\n2\n2\n·2\n,\n1\n·8\n3\n·5\n*\n2\n·4\n,\n4\n·7\n3\n·3\n*\n1\n·1\n,\n5\n·5\nS\nu\ng\na\nrs\n,\ns\ny\nru\np\ns\na\nn\nd\np\nre\ns\ne\nrv\ne\ns\n1\n5\n9\n9\n9\n–\n1\n0\n1\n3\n5\n·6\n2\n2\n·5\n,\n1\n3\n·8\n4\n·0\n2\n0\n·1\n,\n8\n·1\n9\n·6\n*\n1\n·.\n4\n,\n1\n7\n·9\nIc\ne\nc\nre\na\nm\ns\n1\n1\n2\n6\n2\n,\n2\n6\n4\n–\n2\n7\n3\n0\n·0\n5\n2\n0\n·1\n,\n0\n·2\n4\n·9\n*\n3\n·2\n,\n6\n·5\n4\n·9\n*\n3\n·3\n,\n6\n·5\nY\no\ng\nh\nu\nrt\ns\n,\nfr\no\nm\na\ng\ne\nfr\na\nis\n1\n4\n2\n5\n1\n–\n2\n6\n1\n0\n·0\n0\n6\n·0\n*\n4\n·7\n,\n7\n·4\n6\n·0\n*\n4\n·7\n,\n7\n·4\n2\n3\n9\n–\n2\n4\n1\nF\nru\nit\nju\nic\ne\ns\n7\n1\n0\n8\n7\n–\n1\n0\n9\n3\n0\n·0\n0\n0\n·0\n0\n0\n·0\n0\nA\nll\nc\ne\nre\na\nl\np\nro\nd\nu\nc\nts\n1\n8\n0\n1\n–\n1\n8\n0\n0\n·5\n2\n0\n·1\n,\n1\n·1\n3\n·4\n*\n2\n·8\n,\n4\n·0\n3\n·9\n*\n3\n·1\n,\n4\n·7\nA\nll\nm\nilk\np\nro\nd\nu\nc\nts\n1\n0\n9\n1\n8\n1\n–\n2\n8\n9\n0\n·2\n*\n0\n·1\n,\n0\n·4\n3\n·0\n*\n1\n·7\n,\n4\n·3\n3\n·2\n*\n1\n·9\n,\n4\n·4\nA\nll\ns\no\nft\nd\nri\nn\nk\ns\n1\n4\n1\n0\n8\n0\n–\n1\n0\n9\n3\n0\n·0\n0\n0\n·0\n0\n0\n·0\n0\nA\nll\nc\no\nn\nfe\nc\nti\no\nn\ne\nry\n2\n0\n1\n0\n1\n4\n–\n1\n0\n3\n3\n2\n3\n·2\n*\n2\n4\n·9\n,\n2\n1\n·5\n3\n·2\n*\n1\n·6\n,\n4\n·9\n0\n·0\n5\n2\n0\n·0\n5\n,\n0\n·1\n5\nC\nh\no\nc\no\nla\nte\nc\no\nn\nfe\nc\nti\no\nn\ne\nry\n1\n1\n1\n0\n1\n4\n–\n1\n0\n2\n4\n2\n5\n·7\n*\n2\n7\n·8\n,\n2\n3\n·7\n5\n·7\n*\n3\n·7\n,\n7\n·8\n0\n·0\n0\nA\nll\nfr\nu\nit\n1\n2\n0\n8\n5\n2\n–\n9\n7\n1\n2\n·5\n*\n1\n·0\n,\n4\n·0\n8\n·0\n*\n6\n·5\n,\n9\n·4\n1\n0\n·4\n*\n7\n·7\n,\n1\n3\n·2\nN\nD\nN\nS\n,\nN\na\nti\no\nn\na\nl\nD\nie\nt\na\nn\nd\nN\nu\ntr\nit\nio\nn\nS\nu\nrv\ne\ny\ns\n;\nH\nN\nR\nC\n,\nH\nu\nm\na\nn\nN\nu\ntr\nit\nio\nn\nR\ne\ns\ne\na\nrc\nh\nC\ne\nn\ntr\ne\n,\nN\ne\nw\nc\na\ns\ntle\nU\nn\niv\ne\nrs\nit\ny\n,\nU\nK\n;\nM\nA\nF\nF\n,\nM\nin\nis\ntr\ny\no\nf\nA\ng\nri\nc\nu\nlt\nu\nre\n,\nF\no\no\nd\na\nn\nd\nF\nis\nh\ne\nri\ne\ns.\n*\nS\nta\nti\ns\ntic\na\nlly\ns\nig\nn\nifi\nc\na\nn\nt\nd\nif\nfe\nre\nn\nce\n(P\n,\n0\n·0\n5\n).\nS. A. M. Kelly et al.116\nmean intake calculated by the NDNS method and by the HNRC\nmethod, although the HNRC method gave a slightly higher\nvalue (a difference of 2·4 g\/d). Similar results were seen when\nthe dietary intake data were analysed separately for boys and\ngirls (Table 3). There was also no statistically significant differ-\nence between mean percentage energy from NMES between the\nNDNS and HNRC methods.\nBland–Altman plots (Bland & Altman, 1986, 1995; Figs. 1, 2\nand 3) can be used to show the relationship between the differ-\nence in the dietary NMES intake between two methods and the\nmean dietary NMES intake for the two methods. If the maximum\ndifference between the two methods is within two standard devi-\nations of the mean difference (95% limits of agreement), the\nmethods can be considered to be interchangeable as long as the\ndifferences between the methods are not of clinical significance.\nThe reference lines in Figs. 1, 2 and 3 show the 95% limits of\nagreement and the mean differences between the methods.\nIn Fig. 1, nineteen points lie outside the limits of agreement, so\nthe MAFF and NDNS methods cannot be considered to be inter-\nchangeable. In Fig. 2, twenty points fall outside the limits of\nagreement, so the MAFF and HNRC methods are also not inter-\nchangeable. For both graphs, even within the limits of agreement,\nthe differences in dietary intake for the same individual calculated\nby the two methods can be up to about 35 g\/d, which would be\nconsidered to be clinically significant, for example if reported\nin a dietary survey.\nFrom Fig. 3, the NDNS and HNRC methods also cannot be\nconsidered to be interchangeable, as twenty-two points fall out-\nside the 95% limits of agreement. Even within the limits of agree-\nment, the difference in NMES intake for an individual calculated\nby the two different methods can be up to about 9 g\/d.\nAll the graphs demonstrate a proportional bias, i.e. as the mean\nintake becomes larger, the difference in dietary intake values\nbetween the methods also tend to increase, but this effect is\nless marked in Fig. 3.\nContribution of food groups to NMES intake by children\nTable 4 shows the contribution of each food group to NMES\nintake (g\/d) for each of the three methods. As previously\ndiscussed, the MAFF method gives significantly higher values\nfor dietary intakes of NMES than the other two methods when\nthe overall intake is compared, but, within the individual food\ngroups examined, there was no statistically significant difference\nbetween the methods, except for fruit.\nThe MAFF method gives higher values for a number of food\ngroups (breakfast cereals, biscuits, cakes, buns and pastries, pud-\ndings, ice creams) but, except for fruit, the differences were not\nstatistically significant within the food groups. The biggest differ-\nences were between the MAFF and NDNS methods for breakfast\ncereals, biscuits and chocolate confectionery. However, the biggest\ndifference between any of these groups was for breakfast cereals\n(1·1 g\/d, 95% CI 0·6, 1·8) and chocolate confectionery (1·1 g\/d,\n95% CI 0·2, 1·5) between the MAFF and NDNS methods.\nA simplified description of the methods of NMES estimation\nwithin food groups and an overview of the main differences\nbetween the methods is given in Table 5.\nDiscussion\nThe mean dietary intake of a population is the measure usually\nreported in dietary surveys. Mean intakes calculated in this study\nshow little statistically significant difference between the NDNS\nand HNRC methods and much higher values for the earlier MAFF\nmethod. Bland–Altman plots have, however, demonstrated that\nthe NDNS and HNRC methods are not interchangeable and that,\nat an individual level, the limits of agreement can be wide.\nThe simple MAFF method is effectively a ‘total sugars’\nmethod. It assumes that all sugars in foods are NMES sugars,\nexcept for sugars in liquid milk. This led to an overall higher esti-\nmation of NMES content as all sugars are incorporated as NMES\neven if the food does not contain added or extrinsic sugars. For\nexample, in most types of bread, the NMES content by the\nHNRC and NDNS methods is zero as there is negligible added\nsugar, but in the MAFF method all the intrinsic sugars in flour\nand grains are included as NMES. When all foods are taken\ninto account, the MAFF method gives significantly higher\nvalues for overall intake of NMES in children than the other\ntwo methods (Table 3). However, it can be seen from Table 4\nthat there is no significant difference between the MAFF\nmethod and the other two methods in dietary intakes of NMES\nwithin those food groups commonly associated with NMES\nintake, except for fruit. There is a marked difference for ‘other’\nfood groups between the MAFF method and the NDNS and\nHNRC methods, and this is attributed to the cumulative effect\nTable 3. Mean non-milk extrinsic sugar (NMES) and energy intakes for children aged 11–12 years: comparison between the three different\nmethods of NMES estimation\nNDNS HNRC MAFF\nMean 95 % CI Mean 95 % CI Mean 95 % CI\nBoys (n 196)\nNMES (g\/d) 87·8 83·0, 92·5 90·6 (85·8, 95·5) 108·9* 103·7, 114·1\n% energy (from NMES) 16·6 16·0, 17·2 17·2 (16·5, 17·8) 20·7* 20·0, 21·3\nGirls (n 228)\nNMES (g\/d) 76·8 73·5, 80·1 78·9 (75·5, 80·2) 97·0* 93·2, 100·6\n% energy (from NMES) 16·3 15·7, 16·8 16·7 (16·2, 17·2) 20·6* 20·0, 21·1\nAll (boys and girls) (n 424)\nNMES (g\/d) 81·9 79·0, 84·7 84·3 (81·4, 87·2) 102·5* 99·3, 105·6\n% energy (from NMES) 16·4 16·0, 16·8 16·9 (16·5, 17·3) 20·6* 20·2, 21·0\nNDNS, National Diet and Nutrition Surveys; HNRC, Human Nutrition Research Centre, Newcastle University, UK; MAFF, Ministry of Agriculture, Food and Fisheries.\n* Statistically significant difference (P,0·05).\nMethods to estimate non-milk extrinsic sugars 117\nof intrinsic sugars in flour and grains being classed as NMES by\nthis method.\nFor fruit, the MAFF method gives a much higher mean NMES\nintake than the NDNS or HNRC methods, as this method includes\nall fruit sugars as NMES. There is no significant difference between\nthe NDNS and HNRC methods, but the mean NMES intake from\nfruit by each of these methods is negligible (Table 4). This finding\nsuggests that, for this population of children studied with a very\nlow fruit intake, the intricacy of estimating 50% of sugars in pro-\ncessed fruit as NMES by the NDNS method makes little difference\nto the overall NMES values estimated. For dried fruit, jams, canned\nfruit and stewed fruit, half of the fruit sugar was considered to be\nFig. 1. Bland–Altman plot of the difference in the non-milk extrinsic sugars (NMES) intake of 424 young English adolescents calculated using the Ministry of Agri-\nculture, Food and Fisheries and National Diet and Nutrition Surveys methods, by mean NMES intake for these two methods. The interrupted lines show the 95 %\nlimits of agreement.\nFig. 2. Bland–Altman plot of the difference in the non-milk extrinsic sugars (NMES) intake of 424 young English adolescents calculated using the Ministry of Agri-\nculture, Food and Fisheries and the Human Nutrition Research Centre methods, by mean NMES intake for these two methods. The interrupted lines show the\n95 % limits of agreement.\nS. A. M. Kelly et al.118\nintrinsic and half NMES in the NDNS method, whereas all fruit\nsugar was intrinsic in the HNRC method. Unless the consumption\nof fruit in a given population is extremely high, this additional\ncomplexity may not be justified by improvements in the accuracy\nof estimation.\nOther than fruit, the main contribution to the difference between\ntheMAFFmethod and the other twomethods comes from the ‘other\nfood groups’ category, i.e. those food groups which do not normally\ncontribute significantly to NMES content. This is likely to be attrib-\nuted to the cumulative effect of the intrinsic sugars in grains being\nincorporated as NMES in the MAFF method.\nThe impact of the three different methods of NME sugars esti-\nmation on frequency of intake was not calculated in the present\nanalysis. There are unlikely to be any differences in frequency\nof intake between the NDNS and HNRC methods because the\nonly between-method differences relate to the proportions of\nNMES in the food rather than to whether or not NMES is present\nin the food. As the MAFF method classifies sugars in all foods\nexcept liquid milk as NMES, it is, however, likely to considerably\noverestimate frequency of intake.\nThe MAFF method was reported in the national dietary survey\nof adults (Mills, 1994) conducted prior to 1995 and preceded the\nFig. 3. Bland–Altman plot of the difference in the non-milk extrinsic sugars (NMES) intake of 424 young English adolescents calculated using the Human Nutrition\nResearch Centre and the National Diet and Nutrition Surveys methods, by mean NMES intake for these two methods. The interrupted lines show the 95 % limits\nof agreement.\nTable 4. Contribution of food groups to non-milk extrinsic sugar (NMES) intake (g\/d) of 424 young adolescents calculated for the three NMES estimation methods\n(Lines are means with 95 % CI)\nNumber of children eating\nfoods from group\nMean NMES intake (g\/d)\nNDNS MAFF HNRC\nSelected food group Description Mean 95 % CI Mean 95 % CI Mean 95 % CI\nAI Breakfast cereals 384 6·8 6·1, 7·4 7·9 7·2, 8·6 7·6 6·9, 8·3\nAM Biscuits 395 6·8 6·2, 7·3 7·6 7·0, 8·2 7·0 6·5, 7·6\nAN Cakes 325 6·4 5·8, 7·0 6·9 6·3, 7·6 6·6 6·0, 7·2\nAP Buns and pastries 192 1·0 0·8, 1·2 1·5 1·2, 1·7 1·0 0·8, 1·2\nAS Puddings 152 1·3 1·0, 1·5 1·4 1·2, 1·7 1·1 0·9, 1·3\nSC Sugars, syrups and preserves 309 4·9 4·3, 5·4 4·9 4·3, 5·5 4·6 4·0, 5·2\nSEA Confectionery (chocolate) 372 8·9 8·1, 9·7 10·0 9·1, 10·9 10·0 9·1, 10·9\nSEC Confectionery (non-chocolate) 343 5·3 4·6, 5·9 5·3 4·6, 5·9 5·3 4·6, 5·9\nBP Ice creams 186 1·7 1·4, 2·0 2·3 1·9, 2·7 1·7 1·4, 2·0\nPE Fruit juices 402 12·7 11·6, 13·8 12·7 11·6, 13·8 12·7 11·6, 13·8\nPCA\/PCC Carbonated drinks\/cordials 401 19·6 18·2, 21·1 19·6 18·2, 21·1 19·6 18·2, 21·1\nFA Fruit (all fruit including canned,\nprocessed and dried fruit)\n298 0·3 0·2, 0·4 5·1 4·5, 5·6 0·2 0·1, 0·3\nOthers Total of other food groups 6·2 17·3 6·9\nAll Total of all food groups 424 81·9 79·0, 84·7 102·5 99·3, 105·6 84·3 81·4, 87·2\nNDNS, National Diet and Nutrition Surveys; MAFF, Ministry of Agriculture Food and Fisheries; HNRC, Human Nutrition Centre, Newcastle University, UK.\nMethods to estimate non-milk extrinsic sugars 119\nNDNS surveys (Gregory et al. 1995, 2000; Finch et al. 1998). As\nthe earlier MAFF method appears to overestimate NMES com-\npared with the method used in the NDNS surveys, a comparison\nof NMES intakes from the earlier survey with the NDNS surveys\nis unlikely to be valid.\nThere is a marked difference in how the NMES values are cal-\nculated between the NDNS and HNRC methods for chocolate\nconfectionery: the NDNS method assumes that all lactose is\nmilk sugar and intrinsic, whereas the HNRC method includes lac-\ntose in chocolate confectionery as NMES. This difference is\nreflected in the higher NMES values estimated by the HNRC\nmethod than the NDNS method for chocolate confectionery\n(Table 2). However, although this leads to higher dietary intake\nvalues for chocolate confectionery, the mean differences are not\nsignificant within the food group (Table 4) for the population of\nchildren investigated, probably because the amount of lactose in\nchocolate confectionery is small compared with the added\nsugars content. For populations or individuals with a high choco-\nlate consumption, however, the differences between the two\nmethods may be more marked. Some of the points on the\nBland–Altman plot where the differences between the two\nmethods lie outside the 95% limits of agreement (Fig. 3) are\nlikely to be for individuals with a high chocolate intake. Within\nfood groups, the biggest significant difference between the\nNDNS and HNRC methods is for confectionery, in particular cho-\ncolate confectionery (Table 2). After drinks (soft drinks and fruit\njuices), for which there is no difference between the NDNS and\nHNRC methods (Tables 2 and 4), chocolate confectionery is the\nbiggest contributor to NMES intake in the diet of this population\nof young adolescents.\nThere were no differences in the values for NMES calculated\nby each of the three methods for fruit juices and soft drinks.\nBoth the NDNS and HNRC methods effectively assume that the\ncellular structure of the fruit has broken down and that all\nsugars are extrinsic and equivalent to total sugars, so the methods\nare the same as the MAFF method.\nIt should be noted that, for recipe dishes, the NDNS method\ntakes weight loss on cooking into account, whereas the HNRC\nmethod does not. Weight loss can be up to 40% of the total\nweight of the recipe in some cases, so whereas the description\nof the methods may appear to be similar on paper, for example\nfor biscuits (Table 5), the calculated NMES values for recipe\ndishes are different because of the different treatment of\nweight loss on cooking.\nRelative ease and practicality of the methods\nThe practical application of the NDNS method required help from\nthe additional guidelines supplied by the FSA (Appendix 1). For\nfoods for which there was a published recipe, the guidelines were\nstraightforward to follow. For foods with no published recipe,\nguidelines from the FSA were provided in some instances, for\nexample biscuits (to calculate percentage flour from the fibre con-\ntent) and jams (to estimate the proportion of fruit from fibre con-\ntent). This was, however, complicated and time-consuming in\npractice. In other cases, the guidelines provided were vague,\nand it was not always clear how to estimate NMES: for example,\n‘we base our estimates on 1) estimates of the proportions of the\ningredients in the products and 2) the individual sugar profile\nand the main source of each sugar.’ In practice, it was not clear\nTable 5. Comparison of methods of estimation of non-milk extrinsic sugar (NMES) for some food groups\nFood group (1) NDNS method (2) MAFF method (3) HNRC method Comments\nBread All sugars intrinsic All NMES ¼ total sugars All sugars intrinsic Methods 1 and 3\nthe same\nBreakfast cereals (without fruit) Sucrose NMES, other sugars\nintrinsic\nAll NMES ¼ total sugars Added sugars NMES, natural\nsugar intrinsic\nMethods 1 and 3\nsimilar\nBreakfast cereals (with fruit) Dried fruit sugar half\nintrinsic, half NMES\nAll NMES ¼ total sugars Dried fruit sugar all\nintrinsic\nBiscuits, cakes Sugars from flour intrinsic,\nother sugars NMES\nAll NMES ¼ total sugars Natural sugars (e.g. from flour)\nintrinsic, added sugars NMES\nMethods 1 and 3\nsimilar\nDried fruit Half intrinsic, half NMES All NMES ¼ total sugars Intrinsic\nChocolate confectionery Lactose is intrinsic and\nmilk sugars, other sugars NMES\nAll NMES ¼ total sugars All NMES (including lactose)\nin confectionery and biscuit\ncategories but not ice cream\nJams Half fruit sugars NMES and half\nintrinsic. Added sugar NMES\nAll NMES ¼ total sugars Fruit sugars all intrinsic,\nadded sugars NMES\nIce cream Lactose is intrinsic and\nmilk sugars. Other sugars\nNMES\nAll NMES ¼ total sugars Non-dairy ice cream lactose milk and\nintrinsic sugars,\nother sugars NMES\nYoghurts (plain) All sugars intrinsic and\nmilk sugars\nAll NMES ¼ total sugars All sugars intrinsic and\nmilk sugars\nMethods 1 and 3\nthe same\nYoghurts (sweetened) Sucrose NMES, rest intrinsic\nand milk sugars\nAll NMES ¼ total sugars Added sugar NMES, rest intrinsic\nand milk sugars\nMethods 1 and 3\nthe same\nCanned fruit Sugar from syrup (or juice)\nNMES, remainder (from fruit)\nhalf NMES and half intrinsic.\nAll NMES ¼ total sugars Sugar from syrup (or juice)\nNMES, sugar from fruit\nall intrinsic\nStewed fruit (without sugar) Half NMES, half intrinsic All NMES ¼ total sugars All sugars NMES\nStewed fruit (with sugar) Added sugar NMES, fruit\nsugar half NMES, half\nintrinsic\nAll NMES ¼ total sugars Added sugar NMES, fruit\nsugar all NMES\nFruit juices All sugars NMES All NMES ¼ total sugars All sugars NMES Methods 1, 2 and\n3 the same\nNDNS, National Diet and Nutrition Surveys; MAFF, Ministry of Agriculture, Food and Fisheries; HNRC, Human Nutrition Research Centre, Newcastle University, UK.\nS. A. M. Kelly et al.120\nhow to estimate the proportions of ingredients in a product when\nthere was no recipe. One area that was particularly complex was\nprocessed fruit, for example stewed fruit, or fruit in pies and jams.\nIt was necessary to know the proportions of added sugar and fruit\nsugars in order to carry out the calculation of 50% of the fruit\nsugars as NMES. Some food composition data are available\nfrom manufacturers and food packaging, but where it is not avail-\nable, the estimates may vary widely between different investi-\ngators. In these instances, the between-investigator error may\noutweigh the necessity for the complex approach.\nOn the whole, the NDNS method was a thorough, albeit com-\nplex and time-consuming, method to apply.\nThe MAFF method was a very simple method to apply as in\nmost cases the NMES values were equivalent to the total sugars\nfigure in the food tables, except for products made up with\nliquid milk. It was, however, not clear which products contained\n‘liquid milk’, and further information supplied by the FSA did not\nresolve this issue (Appendix 1). For example, it was not clear\nwhether ‘liquid milk’ included only milk consumed on its own\nand used by consumers, or whether it included those products\nmade from liquid milk, such as yoghurts. The MAFF method is\ntherefore a practically simple method that is easy to apply but\nshould not be widely adopted as it overestimates the NMES con-\ntent of most foods, except for fruit juices and confectionery.\nA simpler method that combines the simplicity of the MAFF\nmethod but compensates for the over-estimation of this method\ncould be useful in situations where access to the UK FSA data-\nbase on the NMES contents of foods is not possible. Such a\nmethod could be based on, for example, total sugars minus\nmilk sugars (lactose, including naturally occurring lactose)\nminus all sugars in fresh fruit (all sugars in processed fruit and\nfruit juices would be classified as NMES) minus a proportion of\nsugars in grains and flour (designated by a factor, with clear\nguidelines on how to estimate the flour content of foods for\nwhich there is no recipe). Further research is required to evaluate\nthe practical feasibility and relative accuracy of such an approach.\nThe HNRC method was a thorough method that was more com-\nplex in practice to apply than the NDNSmethod. As with the NDNS\nmethod, it was relatively straightforward for foods for which a\nrecipe was available. The method was originally based on added\nand natural sugars, to which fruit juices and honey were added as\nthe method developed over the years. The further guidelines sup-\nplied were not as comprehensive or as systematic as for the\nNDNS method. As for the NDNS method, the calculation of\nvalues for processed fruit products was also complicated where\nno recipe was available, such as for tinned fruit products or fruit\npies, as it was not clear how to estimate the proportions of added\nand naturally occurring sugars and the fruit content. Food dissection\nwas sometimes used in this method in order to measure the fruit\ncontent of foods. This method gives very similar values to the\nNDNSmethod and continues to be used for repeated cross-sectional\nstudies within the HNRC at Newcastle; its wider adoption is, how-\never limited by the complexity of the method as it stands.\nConclusion\nIf the NMES contents of foods, and the intake and sources of\nNMES (and\/or free sugars) by populations worldwide, are to be\nmeasured and monitored, there needs to be an accessible and uni-\nfied approach to NMES estimation. Such an approach would\nallow comparisons between surveys and enable public health\ngoals to be monitored. Of the three methods evaluated, the\nNDNS method used in the UK is the most appropriate method\navailable for estimating dietary NMES intake, taking into account\npracticality and the dietary intake values obtained.\nAt present, the published details of the NDNS method are\nsparse and insufficient to allow accurate replication. Further\nguidelines are published here (Appendix 1), but even with\nthese, the method is complicated to apply. It is possible to\nobtain the FSA NMES food tables upon direct request, but the\nvalues are currently not published in McCance and Widdowson’s\nThe Composition of Foods and its supplements. The publication\nof NMES in food tables would improve accessibility and promote\na uniform approach to the measurement of NMES intakes in diet-\nary surveys.\nAcknowledgements\nThis research was funded by the FSA. The views expressed are\nthe authors’ own.\nReferences\nBland JM & Altman DG (1986) Statistical methods for assessing agree-\nment between two methods of clinical measurement. Lancet 1(8476),\n307–310.\nBland JM & Altman DG (1995) Comparing two methods of clinical\nmeasurement: a personal history. Int J Epidemiol 24, S7–S13.\nBolton-Smith C & Woodward M (1994) Dietary composition and fat to\nsugar ratios in relation to obesity. Int J Obes Relat Metab Disord 18,\n820–828.\nBuss DH, Lewis J & Smithers G (1994) Non-milk extrinsic sugars (letter).\nJ Hum Nutr Diet 7, 87.\nChan W, Brown J & Buss DH (1994) Miscellaneous foods. Fourth Sup-\nplement to 5th Edition of McCance and Widdowson’s The Composition\nof Foods. Cambridge: Royal Society of Chemistry.\nDepartment of Health (1989) Dietary Sugars and Human Disease. Report\non Health and Social Subjects No. 36. London: HMSO.\nDepartment of Health (1991) Dietary Reference Values for Food Energy\nand Nutrients in the United Kingdom. Report on Health and Social Sub-\njects No. 41. London: HMSO.\nDrummond S & Kirk T (1998) The effect of different types of dietary\nadvice on body composition in a group of Scottish men. J Hum Nutr\nDiet 11, 473–485.\nFinch S, Doyle W, Lowe C, Bates CJ, Prentice A & Smithers G (1998)\nNational Diet and Nutrition Survey, People Aged 65 Years and Over,\nvol. 1. London: HMSO.\nGregory JR, Collins DL, Davies PSW, Hughes JM & Clarke OC (1995)\nNational Diet and Nutrition Survey Children Aged 1.5–4.5 Years,\nvol. 1. London: HMSO.\nGregory J, Lowe C, Bates CJ, Prentice A, Jackson LV & Smithers G\n(2000) National Diet and Nutrition Survey Young People Aged 4 to\n18 Years, vol. 1. London: Stationery Office.\nHolland B, Unwin ID & Buss DH (1988) Cereals and Cereal Products.\nThird Supplement to McCance and Widdowson’s The Composition of\nFoods. Cambridge: Royal Society of Chemistry.\nHolland B, Unwin ID & Buss DH (1989) Milk Products and Eggs. Fourth\nSupplement to McCance and Widdowson’s The Composition of Foods.\nCambridge: Royal Society of Chemistry.\nHolland B, Unwin ID & Buss DH (1992) Fruit and Nuts. First Supplement\nto 5th Edition of McCance and Widdowson’s The Composition of\nFoods. Cambridge: Royal Society of Chemistry.\nMethods to estimate non-milk extrinsic sugars 121\nHolland B, Welch AA, Unwin ID, Buss DH, Paul AA & Southgate DAT\n(1991) McCance and Widdowson’s The Composition of Foods, 5th ed.\nCambridge: Royal Society of Chemistry.\nJohnson IT, Southgate DAT & Surnin JVGA (1996) Intrinsic and non-\nmilk extrinsic sugars: does the distinction have analytical or physiologi-\ncal validity? Int J Food Sci Nutr 47, 131–140.\nKelly SAM, Moynihan PJ, Rugg-Gunn AJ & Summerbell CS (2003)\nReview of methods used to estimate non-milk extrinsic sugars. J Hum\nNutr Diet 16, 27–38.\nLudwig DS, Peterson KE & Gortmaker SL (2001) Relation between con-\nsumption of sugar-sweetened drinks and childhood obesity: a prospec-\ntive observational analysis. Lancet 357, 505–508.\nMills A (1994) The Dietary and Nutritional Survey of British Adults –\nFurther Analysis. London: HMSO.\nMoynihan PJ & Peterson PE (2004) Diet, nutrition and the prevention of\ndental diseases. Public Health Nutr 7, 201–226.\nRugg-Gunn AJ (2001) Preventing the preventable – the enigma of dental\ncaries. Br Dent J 191, 478–488.\nRugg-Gunn AJ, Adamson AJ, Appleton DR, Butler TJ & Hackett AF\n(1993) Sugars consumption by 379 11–12 year-old English children\nin 1990 compared with results in 1980. J Hum Nutr Diet 6, 419–431.\nRugg-Gunn AJ, Fletcher ES, Matthews JNS, Hackett AF, Moynihan PS,\nKelly SAM, Mathers JC & Adamson AJ (2005) Changes in consump-\ntion of sugars by English adolescents over 20 years. Public Health Nutr\n(In the Press).\nSchulze MB, Manson JE, Ludwig DS, Colditz GA, Stampfer MJ, Willett\nWC & Hu FB (2004) Sugar-sweetened beverages, weight gain, and\nincidence of type 2 diabetes in young and middle-aged women.\nJAMA 292, 927–934.\nSheiham A (2001) Dietary effects on dental diseases. Public Health Nutr\n4, 569–591.\nWorld Health Organization (1990) Diet, Nutrition and the Prevention of\nChronic Diseases: Report of a WHO Study Group. Technical Report\nSeries No. 797. Geneva: WHO.\nWorld Health Organization (2003) Diet, Nutrition and the Prevention of\nChronic Diseases: Report of a Joint WHO\/FAO Expert Consultation.\nTechnical Report Series No. 916. Geneva: WHO.\nAppendix 1: Further details of the methods for NMES\nestimation\n1. Details of NDNS method for NMES estimation supplied by the\nUK Food Standards Agency\n‘The method for estimating non-milk extrinsic sugars used in the\nNDNS is that described in Buss et al. (1994) Journal of Human\nNutrition and Dietetics.\nIntrinsic and milk sugars include:\nall sugars in fresh fruit and vegetables (including cooked and\ncanned vegetables)\nall sugars in nuts and seeds\nall sugars inherent in flour and other grains\nhalf the sugars inherent in dried, canned and stewed fruit and\npreserves\nall lactose, whether in milk, milk products or other foods\n(including recipes and composite dishes)\nNon-milk extrinsic sugars include:\nall sugars in table sugar and honey\nall sugars in fruit juice\nall added sugar in manufactured products, recipes and compo-\nsite dishes\nhalf the sugars inherent in dried, canned and stewed fruit and\npreserves\nFor processed foods we estimate the proportions of naturally\noccurring sugars, added sugars and milk sugar. We base our esti-\nmates on:\ni) estimates of the proportions of ingredients in the product\nii) the individual sugar profile and the main source of each\nsugar\nTo give some examples how we estimate NMES content of differ-\nent types of processed foods:\nThe nutrient databank for the NDNS incorporates a recipe cal-\nculation program which is used to calculate the proportion of\nNMES (and other nutrients) in recipe dishes from the ingredients\nso we do not need to estimate these directly.’\nAfter receiving the above information, further clarification of\nthe method was also requested from the FSA on whether\nweight loss in recipe dishes is taken into account in the NDNS\nmethod, and weight loss is indeed taken into account when esti-\nmating the NMES content of recipe dishes.\nEven with the information supplied as above, there were in prac-\ntice, when calculating NMES values with the fifth edition food\ntables, a number of factors that were still open to individual\ninterpretation:\n1.1 In recipe dishes that incorporate eggs, the weight of an\negg was taken as 50 g (standard portion size).\n1.2 In recipe dishes in which weight was lost on cooking\/\nheating, weight loss was taken into account by calculating the\nNMES content per total weight of the recipe after adjusting the\ntotal weight of the recipe for weight loss.\n1.3 For some foods, there is a recipe in McCance and\nWiddowson’s The Composition of Foods and also alternative\nguidelines on how to calculate NMES. For some biscuits, for\nexample, there is a recipe, but the NMES content can also be esti-\nmated by following the general guidelines by estimating sugars in\nflour from the fibre content. It was not clear which route should be\nBreakfast cereals Not containing fruit – assume sucrose is extrinsic\nand other sugars intrinsic\nContaining fruit – estimate proportion of\nsugars coming from fruit and take as half\nintrinsic and half extrinsic.\nBiscuits Estimate % flour from fibre content and so\nsugars coming from flour. Take sugars from\nflour as intrinsic and rest as extrinsic.\nFruit biscuits Estimate proportion of sugars from fruit and\ntake as half intrinsic and\nhalf extrinsic, then as above.\nChocolate biscuits Take lactose as intrinsic and milk sugar,\nthen as above.\nBread All intrinsic\nChocolate Take lactose as intrinsic and milk,\nrest as extrinsic\nJam Estimate proportion of fruit (from fibre content).\nEstimate sugars from fruit – take half\nextrinsic and half intrinsic. Take rest of\nsugar as extrinsic.\nCanned fruit with syrup Estimate proportion of syrup and sugar content\nof syrup. Take sugar from syrup as\nextrinsic; remainder (from fruit) as half\nextrinsic and half intrinsic.\nIce-cream Take lactose as intrinsic and milk and rest\nas extrinsic.\nYoghurt: plain yoghurt Take as all intrinsic and milk sugars\nSweetened yoghurt Take sucrose as extrinsic and rest as intrinsic\nand milk.\nS. A. M. Kelly et al.122\nfollowed in such instances. If a recipe was available, NMES were\ndetermined from the recipe compositions.\n1.4 For foods for which no recipe was available in McCance\nand Widdowson, it was not clear where details of the food com-\nposition should be obtained from. For a product like pizza, for\nexample, different manufacturers’ products have different compo-\nsitions. In general, this information was obtained from a represen-\ntative manufacturer’s details or product packaging.\n1.5 For jams and products containing jam filling, the type of\njam, such as strawberry, is often not specified. In these cases, it\nwas assumed that the jam was strawberry jam, but slightly differ-\nent values would be obtained if another type of jam were to be\nused (because the fibre content is different and the proportion\nof fruit in jam is based on fibre content).\n1.6 The method for jam was based on an estimation of fibre\ncontent, but the method (Southgate or Englyst) was not specified.\nIn these cases, the average of the two was used. In those cases in\nwhich a value was given for only one fibre content method, that\nfigure (either Englyst or Southgate) was used.\n1.7 For soups and sauces, no guidelines were provided by the\nFSA. It was assumed that all sugars were extrinsic except for lac-\ntose in cream soups. This assumption was made because the gen-\neral guidelines from the FSA specified that ‘intrinsic and milk\nsugars include: all lactose, whether in milk, milk products or\nother foods (including recipes and composite dishes).’\n1.8 Tomatoes were treated as fruit; tomato juice, for\nexample, was treated as fruit juice. Sugars from tomatoes in\ntomato sauce and tomato pure´e were treated as half intrinsic\nand half NMES, i.e. treated the same as canned fruit. The treat-\nment of sauces and pure´es was not specified by the FSA, and\nthis case illustrates the difficulties that arise unless clear guide-\nlines are provided.\n1.9 This project only covers NMES values for foods in the\nfifth edition of McCance and Widdowson’s The Composition of\nFoods. Lactose values, where applicable, were taken from the\nsupplements to this book – cereals and cereal products (Holland\net al. 1988), milk and milk products (Holland et al. 1989), fruit\nand nuts (Holland et al. 1992) and miscellaneous foods (Chan\net al. 1994) – as the contents of individual sugars are not\nlisted in the fifth edition. In some cases, however, the value\nfor total sugars in the fifth edition is different from that in the\nsupplements. Where it seemed appropriate, the lactose value\nwas scaled up or down in proportion.\n2. Details of the MAFF method supplied by the FSA (formerly\nMAFF)\nThe original print of the report in which this method was pub-\nlished stated ‘intakes estimated from total sugars by deducting\nthe sugars from liquid cow’s milk, fruit and fruit products\n(excluding fruit juice)’, but the FSA have confirmed (personal\ncommunication) that the method was altered for later prints and\ndid not deduct the sugars in fruit and fruit products, the actual\nmethod used being as follows: ‘an estimate of NMES intake\nwas made by subtracting sugars from liquid milk from total\nsugars (NMES ¼ total sugars minus sugars from liquid,\nwhole, semi-skimmed and skimmed cows milk).’\nFurther clarification was sought from the FSA over which foods\ncontained ‘liquid milk’ and whether sugars from liquid milk\nwould include sugars from milk in recipe dishes, for example\npancakes. The response was that sugars from milk in recipe\ndishes should not be included as ‘liquid milk’.\nEven with the above further information, it was not, however,\nclear which foods contained ‘liquid milk’. For this study, the fol-\nlowing assumptions were made:\n2.1 The following products are described in the fifth edition as\nbeing made up with milk: porridge, custard (made with milk),\ninstant dessert powder, milk pudding, Bournvita powder, build-up\npowder, cocoa powder, drinking chocolate powder, Horlicks,\nmilk shake powder, bread, cheese, onion and white sauce mixes.\nIn these cases, the total sugars value for the appropriate form of\nliquidmilk (i.e. whole, semi-skimmed or skimmed) were subtracted\nfrom the total sugars value for the foodstuff (fifth edition value).\n2.2 This meant that in all other cases when this method was\napplied: NMES ¼ total sugars. Sugars from milk were not sub-\ntracted from cheese, yoghurt, cream, ice cream, chocolate,\nsoups or other recipe dishes as these were not considered to be\nin the form of ‘liquid milk’. Even yoghurt and cream do not fit\nthe description of ‘liquid milk’ because the description supplied\nby the FSA specifies ‘liquid milk’ as ‘whole, semi-skimmed\nand skimmed cows milk’ and does not include the milk in\nrecipe dishes that incorporate milk.\n2.3 Weight loss in recipe dishes did not apply to this method\nas in all recipe dishes, NMES ¼ total sugars.\n3. Details of the HNRC method.\n3.1.1 In bread, all sugars ¼ intrinsic and milk.\n3.1.2 In breakfast cereals, natural sugar ¼ intrinsic and milk.\n3.1.3 In biscuits, natural sugar ¼ intrinsic and milk.\n3.1.4 Dried fruit sugar ¼ intrinsic and milk.\n3.1.5 Baked goods with milk component – lactose and natural\nsugars ¼ intrinsic and milk.\n3.1.6 Non-dairy ice cream lactose ¼ intrinsic and milk.\n3.1.7 Use the lactose values in McCance and Widdowson’s The\nComposition of Foods Milk and Egg Products food table sup-\nplements where possible, for example for ice creams, choc ice, etc.\n3.1.8 Sugars in pizza, curry, lasagne, casserole, stews ¼\nintrinsic.\n3.1.9 Pure´ed foods ¼ NMES (except mashed potato).\n3.1.10 Pure´es and sauces unless milk based ¼ NMES. (If milk\nbased, lactose ¼ intrinsic and milk sugars).\n3.1.11 Soups – look at lactose for cream soups (lactose intrin-\nsic and milk, other sugars NMES).\n3.1.12 Baked beans, assume all sugars ¼ NMES.\n3.1.13 Chocolate (including milk chocolate) ¼ all sugars NMES.\n(In confectionery and biscuit categories but not ice cream categories.)\n3.1.14 Chocolate in cakes ¼ NMES.\n3.1.15 Apple chutney is based on values for tomato chutney. As\ntomato chutney ¼ 12.8% intrinsic and 32% NMES,\napple chutney was calculated as 12·8% intrinsic and 38·3%NMES.\n3.1.16 All stewed fruit sugars ¼ NMES.\n3.1.17 Fruit sugars in pie fillings, jams ¼ intrinsic.\n3.1.18 Sugars from nuts (including ground\/pure´ed nuts) ¼\nintrinsic.\n3.1.19 Fruit juices – all sugars ¼ NMES.\n3.1.20 Weight loss in recipe dishes is not taken into account in\nthe HNRC method. For recipe dishes, NMES content (g\/100 g)\nwas determined on the recipe as published in McCance and\nWiddowson’s The Composition of Foods without subtracting\nany losses resulting from heating or cooking.\nMethods to estimate non-milk extrinsic sugars 123\nThis method was originally based on an added sugars method\nfirst developed in 1980, and the method has developed over\ntime. The following additional information was obtained or\nassumptions were made in order to apply the method:\n3.2 Many of the NMES values calculated by this method\nwere originally calculated for the McCance and Widdowson’s\nThe Composition of Foods food table supplements rather than\nthe fifth edition of the food tables. In some cases, the total\nsugar value differs between the fifth edition and the supplements.\nIn these cases, it has been assumed that the difference in total\nsugar value is caused by differences in added extrinsic sugar;\nwith breakfast cereals, for example, the difference in sugar\ncontent often results from changes in the level of sugar added\nby the manufacturers.\n3.3 Even with the guidelines previously outlined, there were a\nnumber of areas in which assumptions had to be made. As with the\nNDNS method, this mainly applied to products where there was no\nrecipe inMcCance and Widdowson’s The Composition of Foods. If\nno recipe was available, this method was based on manufacturers’\nfood composition data or, if these were unavailable, food dissec-\ntion, for example to estimate proportion of raisins in a product.\n3.4 Natural sugars were estimated to be 0·4 g\/100 g in break-\nfast cereals (without fruit) and cakes (without fruit or jam).\n3.5 Tomato sauce was treated as a pure´ed food.\nS. A. M. Kelly et al.124\n"}