{"doi":"10.1109\/TPEL.2004.830081","coreId":"54872","oai":"oai:eprints.lincoln.ac.uk:2354","identifiers":["oai:eprints.lincoln.ac.uk:2354","10.1109\/TPEL.2004.830081"],"title":"A describing function for resonantly commutated H-bridge inverters","authors":["Sewell, H I","Stone, D A","Bingham, Chris"],"enrichments":{"references":[{"id":18444703,"title":"[9] International Rectifier, IRFPS40N50L data sheet www.irf.com,","authors":[],"date":"2003","doi":null,"raw":"[9] International Rectifier, IRFPS40N50L data sheet www.irf.com, 2003. [10] H.I.Sewell,D.A.Stone,andC.M.Bingham,“Novel,threephase,unity power factor modular induction heater,” Proc. Inst. Elect. Eng. B., vol.","cites":null},{"id":18444700,"title":"Applied Power Electronics Conf. Expo.,","authors":[],"date":"1992","doi":null,"raw":"7th Annu. Applied Power Electronics Conf. Expo., New York, 1992, pp. 411–418.","cites":null},{"id":18444715,"title":"Bingham (M’94) received the B.Eng. degree in electronicsystems and control engineering, from Sheffield City Polytechnic,","authors":[],"date":"1989","doi":null,"raw":"Chris M. Bingham (M’94) received the B.Eng. degree in electronicsystems and control engineering, from Sheffield City Polytechnic, Sheffield, U.K., in 1989, the M.Sc. degree in control systems engineering from the University of Sheffield, in 1990, and the Ph.D. degree from Cranfield University, Cranfield, U.K., in 1994. His Ph.D. research was on control systems to accommodate nonlinear dynamic effects in aerospace flight-surface actuators.","cites":null},{"id":18444702,"title":"Contribution to the AC-analysis of resonant converters; analysis of the series-parallel resonant converter including effects of parasitics and lossless snubber for optimized design,” in","authors":[],"date":"1995","doi":"10.1109\/apec.1992.228408","raw":"[3] N. Frohleke, J. Kunze, A. Fiedler, and H. Grotstollen, “Contribution to the AC-analysis of resonant converters; analysis of the series-parallel resonant converter including effects of parasitics and lossless snubber for optimized design,” in Proc. 7th Annu. Applied Power Electronics Conf. Expo. (APEC’92), 1995, pp. 219–228.","cites":null},{"id":18444717,"title":"He remained with Cranfield University as a PostDoctoral Researcher, until subsequently taking up a research position at the University of Sheffield. Since","authors":[],"date":"1998","doi":null,"raw":"He remained with Cranfield University as a PostDoctoral Researcher, until subsequently taking up a research position at the University of Sheffield. Since 1998, he has been a Lecturer in the Department of Electronic and Electrical Engineering, University of Sheffield.Hiscurrentresearchinterestsincludetractioncontrol\/antilockbraking systems for electric vehicles, electromechanical actuation of flight control surfaces, control of active magnetic bearings for high-speed machines, and sensorless control of brushless machines.","cites":null},{"id":18444704,"title":"Sewell received the M.Eng. degree in electronicandelectricalengineeringandthePh.D.degree from the","authors":[],"date":"1996","doi":null,"raw":"H. Isaac Sewell received the M.Eng. degree in electronicandelectricalengineeringandthePh.D.degree from the University of Sheffield, Sheffield, U.K., in 1996 and 2002, respectively.","cites":null},{"id":18444701,"title":"Soft switching series resonant converter for induction heating applications,” in","authors":[],"date":"1995","doi":"10.1109\/peds.1995.404986","raw":"[2] E.J.Dede,V.Esteve,E.Maset,J.M.Espi,A.E.Navarro,J.A.Varrasco, and E. Sanchis, “Soft switching series resonant converter for induction heating applications,” in Proc. Int. Conf. Power Electronics and Drive Systems, vol. 2, 1995, pp. 689–693.","cites":null},{"id":18444705,"title":"Stone received the B.Eng. degree in electronic engineering from the University of Sheffield,","authors":[],"date":"1984","doi":null,"raw":"David A. Stone received the B.Eng. degree in electronic engineering from the University of Sheffield, Sheffield, U.K., in 1984 and the Ph.D. degree from Liverpool University, Liverpool, U.K., in 1989. He then returned to the University of Sheffield as a Member of Academic Staff specializing in power electronics and machine drive systems. His current research interests are in resonant power converters, hybrid-electric vehicles, battery charging, EMC, and novel lamp ballasts for low pressure fluorescent lamps.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004","abstract":"Abstract—The paper presents the derivation of a describing function to model the dynamic behavior of a metal oxide semiconductor field effect transistor-based, capacitively commutated H-bridge, including a comprehensive explanation of the various stages in the switching cycle. Expressions to model the resulting input current, are also given. The derived model allows the inverter to be accurately modeled within a control system simulation over a number of utility input voltage cycles, without resorting to computationally\\ud\nintensive switching-cycle level, time-domain SPICE simulations. Experimental measurements from a prototype H-bridge inverter employed in an induction heating application, are used to demonstrate a high degree of prediction accuracy over a large variation of load conditions is possible using the simplified model","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/54872.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2354\/1\/sewell_describing_function_resonantly.pdf","pdfHashValue":"7b5a767a9af259900f9f1ae4dd82de7af2fb71b0","publisher":"Institution of Electronic and Electrical Engineers POWER ELECTRONICS SOCIETY","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:2354<\/identifier><datestamp>\n      2014-08-28T09:24:59Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48363130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2354\/<\/dc:relation><dc:title>\n        A describing function for resonantly commutated H-bridge inverters<\/dc:title><dc:creator>\n        Sewell, H I<\/dc:creator><dc:creator>\n        Stone, D A<\/dc:creator><dc:creator>\n        Bingham, Chris<\/dc:creator><dc:subject>\n        H610 Electronic Engineering<\/dc:subject><dc:description>\n        Abstract—The paper presents the derivation of a describing function to model the dynamic behavior of a metal oxide semiconductor field effect transistor-based, capacitively commutated H-bridge, including a comprehensive explanation of the various stages in the switching cycle. Expressions to model the resulting input current, are also given. The derived model allows the inverter to be accurately modeled within a control system simulation over a number of utility input voltage cycles, without resorting to computationally\\ud\nintensive switching-cycle level, time-domain SPICE simulations. Experimental measurements from a prototype H-bridge inverter employed in an induction heating application, are used to demonstrate a high degree of prediction accuracy over a large variation of load conditions is possible using the simplified model.<\/dc:description><dc:publisher>\n        Institution of Electronic and Electrical Engineers POWER ELECTRONICS SOCIETY<\/dc:publisher><dc:date>\n        2004<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2354\/1\/sewell_describing_function_resonantly.pdf<\/dc:identifier><dc:identifier>\n          Sewell, H I and Stone, D A and Bingham, Chris  (2004) A describing function for resonantly commutated H-bridge inverters.  IEEE TRANSACTIONS ON POWER ELECTRONICS, 19  (4).   pp. 1010-1021.  ISSN 0885-8993  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/TPEL.2004.830081<\/dc:relation><dc:relation>\n        10.1109\/TPEL.2004.830081<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2354\/","http:\/\/dx.doi.org\/10.1109\/TPEL.2004.830081","10.1109\/TPEL.2004.830081"],"year":2004,"topics":["H610 Electronic Engineering"],"subject":["Article","PeerReviewed"],"fullText":"1010 IEEE TRANSACTIONS ON POWER ELECTRONICS, VOL. 19, NO. 4, JULY 2004\nA Describing Function for Resonantly\nCommutated H-Bridge Inverters\nH. Isaac Sewell, David A. Stone, and Chris M. Bingham, Member, IEEE\nAbstract—The paper presents the derivation of a describing-\nfunction to model the dynamic behavior of a metal oxide semi-\nconductor field effect transistor-based, capacitively commutated\nH-bridge, including a comprehensive explanation of the various\nstages in the switching cycle. Expressions to model the resulting\ninput current, are also given. The derived model allows the inverter\nto be accurately modeled within a control system simulation over a\nnumber of utility input voltage cycles, without resorting to compu-\ntationally intensive switching-cycle level, time-domain SPICE sim-\nulations. Experimental measurements from a prototype H-bridge\ninverter employed in an induction heating application, are used to\ndemonstrate a high degree of prediction accuracy over a large vari-\nation of load conditions is possible using the simplified model.\nIndex Terms—Metal oxide semiconductor field effect transistor\n(MOSFET)-based capacitively commutated H-bridge, switching\ncycle.\nNOMENCLATURE\nCapacitor across top-side, load commutated\npower switch.\nCapacitor across top-side, PWM-controlled\npower switch.\nCapacitor across bottom-side, load\ncommutated power switch.\nCapacitor across bottom-side,\nPWM-controlled power switch.\nCapacitance of .\nCapacitance involved in the\ncommutation of the switch.\nEquivalent capacitance involved in the\ncommutation of the PWM leg.\nEquivalent capacitance involved in the\ncommutation of the load-commutated leg.\nParasitic capacitance across the device.\nAntiparallel diode across top-side, load\ncommutated power switch.\nAntiparallel diode across top-side,\nPWM-controlled power switch.\nAntiparallel diode across bottom-side, load\ncommutated power switch.\nAntiparallel diode across bottom-side,\nPWM-controlled power switch.\nFunction relating the charge held in the\nparasitic capacitance of the MOSFET to the\ndc-link voltage.\nManuscript received January 27, 2003; revised December 11, 2003. Recom-\nmended by Associate Editor B. Fahimi.\nThe authors are with the Department of Electronic and Electrical Engineering,\nSheffield S1 3JD, U.K. (e-mail: d.a.stone@sheffield.ac.uk).\nDigital Object Identifier 10.1109\/TPEL.2004.830081\nSwitching frequency.\n“quadrature” component of the output current\nvector.\nInput current to the H-Bridge.\nMagnitude of the equivalent sinusoidal\nrepresentation of the output current.\n“in-phase” component of the output current\nvector.”\nTime-domain representation of output current\nfrom the H-Bridge.\nCharge transferred from the dc-link to the\nH-bridge during period 1.\nCharge transferred form the dc-link to the\nH-bridge during period 2.\nCharge transferred form the dc-link to the\nH-bridge during period 3.\nCharge transferred form the dc-link to the\nH-bridge during period 4.\nCharge transferred form the dc-link to the\nH-bridge during period 5.\nCharge transferred form the dc-link to the\nH-bridge during period 6.\nCharge transferred form the dc-link to the\nH-bridge during period 7.\nCharge transferred form the dc-link to the\nH-bridge during period 8.\nOn-state resistance of the diode.\nOn-state resistance of the switch.\nTop-side, load commutated power switch.\nBottom-side, load commutated power switch.\nTop-side, PWM-controlled power switch.\nBottom-side, PWM-controlled power switch.\nOn-time of the switch.\nCharge stored in the total leg capacitance.\nAngle at which the commutation cycle\nfinishes as the opposing switch turns on.\nTime-domain representation of the generic leg\nvoltage during the time that the switches’\nantiparallel diodes are carrying the output\ncurrent.\ndc-link voltage.\nForward voltage of the diode.\nVoltage across the switch at the point of\nturn-off.\nForward voltage of switch.\nFMA equivalent representation of the leg\nvoltage.\nTime-domain representation of the generic leg\nvoltage during the time that the commutation\ncapacitors are carrying the output current.\n0885-8993\/04$20.00 © 2004 IEEE\n \nSEWELL et al.: DESCRIBING FUNCTION FOR RESONANTLY COMMUTATED H-BRIDGE INVERTERS 1011\nTime-domain representation of the generic leg\nvoltage during the time that the switches are\ncarrying the output current.\nVoltage across the drain and source terminals\nof the MOSFET switch.\nTime-domain representation of the load\ncommutated leg voltage.\nTime-domain representation of the generic leg\nvoltage.\nTime-domain representation of\nPWM-controlled leg voltage.\nTime-domain representation of output voltage\nfrom the H-Bridge.\nTime-domain representation of the generic leg\nvoltage during the time that the switches are\nturning off.\nAngle at which the switch starts to turn off.\nAngle at which the switch completes turn-off.\nAngle at which the commutation finishes.\nPhase of the equivalent sinusoidal\nrepresentation of the output current.\nAngle at which starts to turn off.\nAngle at which completes turn-off.\nAngle at which the commutation of\nfinishes.\nAngle at which starts to turn off.\nAngle at which completes turn-off.\nAngle at which the commutation of\nfinishes.\nI. INTRODUCTION\nTHE MOST common high-frequency inverter circuit em-ployed in an industrial environment consists of a capaci-\ntively commutated metal oxide semiconductor field effect tran-\nsistor (MOSFET)-based H-bridge, a dc-link smoothing filter,\nFig. 1, together with monitoring and feedback electronics. For\nhigh-frequency applications, the basic H-bridge is often aug-\nmented with capacitors in parallel with the power\nswitches, to facilitate zero-voltage commutation of the inverter\nlegs; a feature that has been shown to be advantageous in both\nIGBT and MOSFET-based bridges [1] since it allows high ef-\nficiency operation with very low switching loss. It also permits\nsome control of at the output, thereby mitigating EMC\nproblems. However, the incorporation of commutation capaci-\ntors has significant impact on the dynamic operation of the cir-\ncuit, as the bridge commutation period becomes a significant\nproportion of the switching period. This substantially increases\nthe complexity of models that can accurately predict circuit be-\nhavior, since they are required to describe the output voltage\ncharacteristics during the commutation periods, when the com-\nmutation capacitors support the output current. Although mod-\neling the operation of low-power resonant converters with\nhalf-bridge switch networks [3] has been addressed with some\nsuccess, the dynamic effects of commutation components in a\nfull H-bridge, for high power systems, remains outstanding.\nHere then, the complex commutation effects within the\nH-bridge inverter are described, along with time-domain and\nstatic performance characteristics. From this, a describing-\nfunction to model the input\/output characteristics of inverter\nFig. 1. Inverter circuit.\noperation, is derived, and subsequently employed to predict\nsystem output current against PWM duty, thereby providing\na macro-model of the H-bridge; a feature necessary to accu-\nrately, and rapidly, model an inverter within a control system\nsimulation, for instance. Indeed, the proposed model typically\nexecutes some 10 000 times faster than component-based\nsimulation packages such as Spice. Additionally, the resulting\nmodel is sufficiently detailed to provide enhanced predictions\nof efficiency throughout the circuit, and facilitate optimized\ndesign and performance sensitivity results with respect to com-\nponent values and tolerances. To provide a practical focus to the\npaper, application of the presented techniques is considered for\nmodeling a 2.5-kW inverter employed in an induction heating\nsystem.\nII. CIRCUIT OPERATION\nThe preferred use of high switching frequencies to reduce\nthe size of reactive system components (or to achieve specific\nheating patterns in the case of induction heating), means that\ndevice switching can become the most significant loss mech-\nanism within the inverter. Low-loss commutation strategies\nare therefore desirable, the most effective being zero-voltage\ncommutation [2].\nSince PWM is a requirement for control of power to the\nload, only one leg of the inverter ( and , for instance)\ncan switch at the zero-crossing times of the load current, while\nthe remaining leg must commutate appropriately to provide\nthe effective duty-cycle at the output, under zero-voltage\ncommutation. This facilitates controlled power transfer without\nadditional power preprocessing stages. To minimize switching\nlosses in the fixed, “load commutated” leg, and are\nturned off as the output current is about to pass through zero.\nAlthough this appears to utilize zero current commutation,\nthe devices are, in fact, commutated under reduced voltage by\nvirtue of the presence of the commutation capacitors and\n. This combination of low current and low voltage at the\nswitching instant significantly reduces switching losses, and\nconstitutes operation under optimal conditions described by\nDede et al. [2]. However, since the output voltage is controlled\nusing pulse width modulation (PWM), , and cannot\nbe load commutated in the same manner. Consequently, capaci-\ntors and are included to allow zero-voltage commutation\n1012 IEEE TRANSACTIONS ON POWER ELECTRONICS, VOL. 19, NO. 4, JULY 2004\nFig. 2. Inverter leg voltage and load current.\nof and , thereby reducing the switching losses and\ndecreasing the across the switches. and are larger\nthan and , as the potential instantaneous currents they\nare to handle are higher, given that the instantaneous maximum\nin the output current may occur during the commutation event.\nThe resulting inverter output voltage is then given by the\ndifference between the inverter bridge-leg voltages (1) (see\nFig. 1)\n(1)\nThe characteristics of both and may be analyzed\nindependently and subsequently combined to give the overall\ndescribing function for the inverter output voltage.\nIII. GENERIC MODEL OF LEG VOLTAGE\nTypical leg-voltage and current waveforms\nduring steady-state operation of the inverter are shown in Fig. 2,\nwhere the output of the leg is loaded by a sinusoidal current\nsink [see Fig. 3(a)] and time has been normalized based on the\nswitching period to provide waveforms as a function of angle.\nA describing function modeling the behavior of the leg of the\ninverter is obtained by considering the piecewise time-domain\noperation of the inverter between the various mode transition\nangles shown in Fig. 2.\nThe phase reference for the voltage, , coincides with the\nturn-on of the upper top-left switch, in Fig. 1, and occurs\nwhile the anti-parallel diode is conducting. The anti-parallel\ndiode ceases to conduct at , which also defines the phase-shift\nbetween the output voltage and the sinusoidal output current, de-\nscribed by\n(2)\nDuring the period is forward conducting and the\nleg voltage during this time, , is modeled as a quasisquare\nFig. 3. (a) Generic inverter leg model and (b) Spice model circuit.\nwave modified by a sinusoidal perturbation to account for con-\nduction resistance of the switching device\n(3)\nwhere the forward-conduction voltage drop of the device, , is\nincluded to allow for either reverse conduction blocking diodes\nor the use of IGBTs. Reverse blocking diodes may be used when\nseveral MOSFETs are paralleled, since the rate-of-change of\ndiode forward voltage with temperature does not encourage cur-\nrent sharing of the devices during the diode conduction phase.\nAlso given in (3) is the voltage characteristic during the phase\nperiod to when the opposite switch in the\nbridge leg is conducting ( in Fig. 1).\nDuring the period , the voltage across rises\nto , the “terminal” voltage of the switch. Extensive practical\nmeasurements show that this rise can be modeled as being essen-\ntially linear. The leg voltage, , therefore reduces accordingly\nduring this time, as described by (4), shown at the bottom of\nthe next page. The leg voltage during the complementary time,\nwhen carries current, is also given in (4).\nDuring the period when commutation occurs, , the\ncurrent from the resonant load charges the capacitance across\nthe switches. The total capacitance consists of the nonlinear par-\nasitic drain-source capacitance , Fig. 4, of both the tran-\nsistor that is turning off and its complimentary paring, and any\nSEWELL et al.: DESCRIBING FUNCTION FOR RESONANTLY COMMUTATED H-BRIDGE INVERTERS 1013\nFig. 4. Voltage dependency of MOSFET parasitic capacitances (reproduced\ncourtesy of Advanced Power Technology: APT5010LVR).\nadditional component capacitance connected across the tran-\nsistor. At low voltages, the drain-source capacitance dominates,\nwhile the commutation capacitance dominates at high voltages.\nSince can be considered to be ‘off’ during this phase, all\nload current flows into the commutation capacitors and the par-\nasitic drain-source capacitances. As the parasitic capacitors are\na nonlinear function of applied voltage, the calculation of the\ncommutation angle can be simplified by assuming turns\noff instantaneously, and the commutation capacitance is charged\nuntil it reaches the applied dc-link voltage. The stored charge is\nthe integral of the output current, (5), taken over the commuta-\ntion period, as given in\n(5)\n(6)\nwhich can be solved for\n(7)\nBy assuming a sinusoidal leg current, and noting the voltage\nis radians out of phase with the current, and of the same\nfrequency, the output voltage can be written as (8), shown at\nthe bottom of the page. Finally, between and\n, the voltage across exhibits a similar characteristic\nto the switch conduction period, differing only in the polarity\nof the offset. In particular, if the diode resistance is equal to\nthe switch on-state resistance, , and the conducting voltage\ndrop across the diode, , is equal to the switch on-state\nvoltage drop, , then . In the more general\ncase however, the output voltage is described by (9), shown at\nthe bottom of the page. Equations (2)–(9), therefore, provide\na generic piecewise description of the steady-state behavior of\nthe inverter under the rather mild assumptions that 1) diode re-\nverse recovery does not significantly influence the behavior of\nthe inverter\/load combination, 2) instantaneous output current\nremains positive during the period , and 3) the\nswitch rather than the diode carries the current in the period\n. The latter two conditions hold for a MOSFET,\nproviding the magnitude of the instantaneous device current is\nless than that required to create a body-resistance voltage-drop\nof sufficient value to forward bias the internal anti-parallel diode\ninto its conducting state.\nTo show the validity of the presented piecewise model of the\ninverter switching characteristics, a SPICE-based model of the\ninverter leg employing International Rectifier IRFPS40N50L\nMOSFET devices is used, Fig. 3(b). A sinusoidal current source\nis included to represent the effects of the resonant output load.\n(4)\n(8)\n(9)\n1014 IEEE TRANSACTIONS ON POWER ELECTRONICS, VOL. 19, NO. 4, JULY 2004\nFig. 5. (a) Switching cycle and (b) detail of diode recovery and transistor\nturn-off.\nA comparison of results from time-domain SPICE simula-\ntions, with the predicted behavior of the inverter [from (3)–(9)],\nis shown in Fig. 5(a), and indicates good correspondence is\nachievable during the majority of the cycle. Fig. 5(b) shows a\nmagnified view to indicate the typical influence of diode re-\ncovery, along with details of the transistor turn-off period. It\ncan be seen that while there is a small difference in the shape\nof the output voltage waveforms, the times at which the turn-off\nbegins and ends, and the voltages at which these occur, are pre-\ndicted accurately by the model. Note: the SPICE results show\nthe diode actually providing energy into the system during re-\ncovery. This is not an appropriate characteristic and is therefore\nnot included in the piecewise time-domain model .\nIV. DESCRIBING FUNCTION OF GENERIC INVERTER LEG\nTo derive the fundamental mode approximation (FMA) de-\nscribing-function of a generic inverter leg, and investigate the\ndomain of applicability of the proposed model, operation of the\ncircuit [Fig. 3(b)] is considered for various switch turn-off an-\ngles, , between . The describing function of the\nleg is initially obtained by taking the Real and Imaginary compo-\nnents of the fundamental from the FFT of the resulting time-do-\nFig. 6. Leg voltage components.\nmain leg voltage waveform. The resulting voltages from SPICE\nsimulations along with those from the describing function are\ncompared in Fig. 6. To preserve the phase information, results\nare analyzed by considering both the Real and Imaginary com-\nponents of the leg voltage, individually. The maximum applied\npulse-width is limited by the necessity for the commutation ca-\npacitors to fully charge to the dc-link rail voltage before the\noutput current changes polarity. This is indicated in Fig. 6 by the\n“ limit.” Values of greater than this give rise to truncated\ncommutation, whereby the capacitor is partly discharged by the\nopposing transistor turning on. The good correlation between\nresults from the derived model (line) and those from SPICE sim-\nulations, Fig. 6, indicate that the dominant characteristics of the\ninverter leg are captured by the proposed model, particularly for\nradians (60 (conduction time of switch s);\nbelow this value diode reverse recovery dominates the turn-off\ncharacteristics. It is also of note that some discrepancy between\nthe results occurs above the limit (especially the imaginary\ncomponent) due to the assumption that a device switches-on at\nthe instant that the current passes through zero (\netc). If the total switch capacitance is not fully charged at the\nend of half a switching cycle, a result of employing a piece-\nwise model is that it necessarily predicts a step change in the\nleg voltage. This cannot occur in practice since it implies a finite\namount of charge must be transferred to the commutation capac-\nitance in zero time. The domain of applicability of the model is\ntherefore bounded by the assumption that complete charging of\nthe commutation capacitance can occur during half a switching\ncycle. In reality, circuit operation outside this domain results\nin large transient current flows through the switching devices,\nleading to a significant increase in both switching device loss\nand electromagnetic noise.\nV. MODEL REDUCTION\nAlthough the proposed model incorporates the dominant\ncharacteristic of switching behavior, the complexity can\nbe reduced by considering the impact of each parameter\non the FHA equivalent output\nvoltage of the bridge leg (V ). Applying a sinusoidal current\nSEWELL et al.: DESCRIBING FUNCTION FOR RESONANTLY COMMUTATED H-BRIDGE INVERTERS 1015\nFig. 7. Thévenin equivalent source.\nsink to the output of the piecewise description of the bridge leg,\nresulting in an output voltage , allows the impact of varia-\ntions in the circuit parameters to be determined by considering\na Thévenin equivalent circuit representation (Fig. 7).\nAs the proposed model of the bridge leg is only valid for a de-\nfined range of output currents viz. those allowing correct com-\nmutation of the bridge leg, two output current levels selected\nfrom small perturbations about a nominal operating point, are\nused to find the Thévenin components, and , for each\nperturbation of either .\nEach component is selected individually for analysis, and\nits value is halved; a “new” Thévenin equivalent circuit then\nbeing obtained for each case. Sensitivity to variations in each\ncomponent is assessed by repeating the process for a range of\npulse widths , and calculating the RMS variation of the\nThévenin model components from those of the original. The re-\nsults of these analyzes are summarized in Fig. 8, from which it\ncan be seen the components that have the greatest influence on\noutput voltage are and . Consequently, the orig-\ninal piecewise time-domain model [(3)–(9)] can be simplified\nto (10) by only including the influence of these elements. In\nparticular, the output is assumed to begin at exactly the dc-link\nvoltage while the diode is forward biased ,\nand then be subject to a voltage drop due to the body resis-\ntance of the MOSFET until the end of the MOSFET turn-off\nperiod . Although the actual turn-off ramp is\nnot now directly considered, the time period of the ramp is,\nsince the commutation capacitor charging period is very sen-\nsitive to the starting time. The commutation capacitor charging\nprofile is also dependent on the starting voltage, so the portion\nof the leg-voltage due to commutation begins at an angle ,\nand voltage, . This implies a discontinuity in the char-\nacteristic of at . After the commutation event (at ),\nthe voltage is clamped to 0 V. The second half of the operation\nsequence then commences analogously as (10), shown at the\nbottom of the page.\nFig. 8. Effect of different elements of the time-domain description on the\nThévenin equivalent circuit (a) angle and (b) magnitude.\nVI. DESCRIBING FUNCTION OF INVERTER LEG\nA describing function to model the inverter leg is obtained\nfrom a FHA of (10). This is most conveniently found from\nthe first harmonic of the Fourier series of the leg voltage de-\nscribed in the “angle-domain,” Since the relative phase shift of\nthe output voltage is important, the complex form of the output\nvoltage vector is retained ,\nresulting in the describing function being comprised of both\nReal and Imaginary components (11), (12). To simplify nota-\ntion, is also divided into constituent components and\n, where is in phase with , and correspond-\n(10)\n \n1016 IEEE TRANSACTIONS ON POWER ELECTRONICS, VOL. 19, NO. 4, JULY 2004\ningly leading by radians; thus and\n(11)\n(12)\nThe switching behavior of a single inverter leg can now be gen-\neralized to model both legs of the inverter H-bridge; the output\nvoltage then being between the mid-point node of each leg.\nTo identify each set of equations with the appropriate leg,\nand are\nemployed, respectively, for describing the characteristics of the\n“PWM-commutated leg” and the “load commutated leg,” where\nthe angles replace the general angles to\nmark the various switching events in the PWM-commutated leg,\nand the angles replace the general angles\nto mark the various switching events in the load-commutated\nleg. The output voltage is found by effectively subtracting the\nvoltage of the “load-commutated leg” from that of the “PWM\nleg.” Now, since the upper switch in the PWM leg is turned\non radians out of phase with the load-commutated leg, and\nthe output current similarly reversed, the voltage at the PWM\nleg must be derived with a radians phase-shift. Therefore,\nthe output voltage is actually found by adding the voltage\ncontribution of each leg\n(13)\nIt should be noted that are “equiv-\nalent capacitances” that include the nonlinear parasitic output\ncapacitance of the switching device. A degree of verification of\nthe model can be seen from Fig. 9, where, by fixing\nand , and varying , a good correlation between SPICE\nand the derived results is evident for values of device on-time,\n, greater than the diode recovery time of 0.8 s.\nA. Output Voltage Range Versus Frequency\nAs the operating frequency is increased, the required com-\nmutation capacitor charge time leads to a relative increase in\nthe switching time of the leg with respect to the switching pe-\nriod. This acts to increase the output voltage for low values of\noutput pulse width, controlled by ( being fixed), while,\nconversely, acting to decrease the output voltage for high pulse\nwidths ( approaching radians). It is therefore apparent that\nthe commutation capacitor charging-time constrains the range\nof , hence limiting the time that the output voltage can be\nclamped to the supply.\nB. Input Current\nThe average current drawn by the inverter is the product of the\ntotal charge drawn from the source over a switching cycle, and\nthe switching frequency. From Figs. 1 and 10 (which shows one\nSEWELL et al.: DESCRIBING FUNCTION FOR RESONANTLY COMMUTATED H-BRIDGE INVERTERS 1017\nFig. 9. Total output voltage from the inverter.\nFig. 10. Definition of Periods 1 to 8.\ncycle of the inverter output voltage and current subdivided into\ntime-domain piece-wise components), an analytical function for\nthe averagedsupply input current canbe obtained by successively\nconsidering each of the eight steady-state operating periods.\n1) Period 1: : During Period 1 the load is\nconnected across the supply by and , and subsequently\nby the operation of and . The charge flowing from\nthe supply for this period can be seen to be a function of the\noutput current. Assuming the output current is sinusoidal with a\nvariable phase-shift such that the diodes do not become reverse\nbiased before their anti-parallel transistors turn on, the charge\ncan be found by integration\n(14)\nAlthough the solution is dependent on output current (amplitude\nand phase) and commutation angles, it is not explicitly depen-\ndent on supply voltage. However, implicitly, the output current\nis a function of the (complex) output voltage, which, in turn, is\na function of the supply voltage. Moreover, is a function of\nthe supply voltage and the output current.\n2) Period 2: : Here, the load current is appor-\ntioned to discharging and charging (from the supply), the\nmagnitude of each being determined by the ratio of capacitances\nSince the parasitic capacitances across the switching\ndevices vary as a function of applied voltage, the instantaneous\nsupply current varies over the commutation period. The charge\nflowing from the dc link is therefore equal to that required to\ncharge (plus the parasitic capacitance across the source-drain\nterminals of ) from 0 V to (15). The function relating\nthe charge stored in the nonlinear parasitic capacitor across the\nMOSFET, to the dc link voltage, , is found by inte-\ngrating the MOSFET output capacitance, , as a function of\n(15)\nEquation (15) is also approximately correct given the case\nof truncated commutation, since, if is not completely\ndischarged at the end of the cycle, will turn-on and charge\nfrom the dc link, while rapidly discharging . The energy\nstored in will then dissipate in , increasing switching\nloss.\n3) Period 3: : The output current circulates\nthrough and , and hence, no current is drawn from the\nsupply\n(16)\n4) Period 4: : The load current is divided into a\nportion circulating via , and the other from the load, through\nand into the supply. The current to the supply is of opposite\n1018 IEEE TRANSACTIONS ON POWER ELECTRONICS, VOL. 19, NO. 4, JULY 2004\npolarity to that discussed for Period 2: therefore energy is re-\nturned. The charge flowing from the supply to the H-Bridge is\ntherefore that required to discharge and the parasitic capac-\nitance across\n(17)\n5) Period 5: : Initially, current flows from\nthe load, via and , to the supply; on reversal it flows\nfrom the supply, through and to the load, (similar\nto Period 1)\n(18)\nThe sign change is due to the voltage across the load being re-\nversed. Considering the sign change as a phase shift of ra-\ndians, (18) simplifies to (19), which is equivalent to\n(19)\n6) Period 6: : Here, current is drawn\nfrom the supply in charging via the load. If is equal to\n, then is equal to\n(20)\n7) Periods 7 & 8: During Period 7, the load current circu-\nlates through and (similar to Period 3) and the charge\nfrom the supply will be zero\n(21)\nDuring Period 8, commutates, with some of the output cur-\nrent flowing through and , the remainder flowing through\nto the supply. Charge flowing into the supply is there-\nfore equal to the requirements to charge from 0 V to\n[see (22)]. If equals , then is equal to\n(22)\na) Average Input Current: The average input current is\ngiven by the product of the sum of , and the switching\nfrequency. It is notable that terms relating to the charge stored\nin the parasitic capacitance of the MOSFETs cancel, leaving\n(23)\nA comparison of results of from (23), with those from\nSPICE simulations, is given in Fig. 11 for a variety of and\n, where a close agreement is apparent for s\n(corresponding to the reverse recovery time of the SPICE-model\ndiodes). The high degree of correlation remains even when the\nPWM leg undergoes truncated commutation (i.e., when\nis greater than the limit), which is consistent with our\nanalysis, which does not consider the destination of the charge\nduring the commutation period.\nFig. 11. Average input current as a function of PWM gate pulse-width.\nFig. 12. Prototype induction heating system (a) application heating a bolt to\n1000 C and (b) 2.5-kW inverter circuit.\nExperimental measurements from a prototype induction\nheating system, shown in Fig. 12, (whose parameters have\nbeen accurately measured) have also been obtained to verify\nthe predictions. The equivalent circuit of the induction heating\nwork-head, which represents the load on the bridge, is shown\nin Fig. 13. The load circuit is connected to the inverter, with\nSEWELL et al.: DESCRIBING FUNCTION FOR RESONANTLY COMMUTATED H-BRIDGE INVERTERS 1019\nFig. 13. Equivalent work-head circuit parameters.\nTABLE I\nCOMPONENT VALUES USED IN THE VERIFICATION OF THE SYSTEM MODEL\nparameters shown in Table I, via a 2:1 ratio step-down trans-\nformer, and the inverter is fed from a 300-V, 9-A supply.\nAs increases, the pulse-width, and hence the output\nvoltage from the system, increases. This is reflected in an\nincrease in the output current from the inverter, shown as the\npeak output current value in Fig. 14. The input current also\nfurther increases with over the range of output current as\nthe relative time available to transfer energy from the dc link\nto the output increases with output pulse width. However, with\nsmall, the effect of the commutation period is significant,\ntherefore some excitation of the workhead circuit occurs\nleading to a minimum output current. Furthermore, due to the\neffect of the commutation capacitors, a minimum input current\nflows at . From Fig. 14, a good correlation between the\nexperimental data and the predicted results for the inverter is\napparent [4]–[9].\nVII. MODEL LIMITATIONS\nThe presented time-domain description (10) is valid only\nwhen the switch in anti-parallel with the conducting diode at the\nend of the cycle, is turned-on before the current passes through\nzero (normal operation, positive). In other cases, the output\ncurrent transfers from the diode to the commutation capacitors,\nand the modeling of an additional period is required between\nto . During this period, the voltage at the centre of the\nFig. 14. Output- and input-current as a function of \f , from the experimental\nsystem under test, a full system SPICE model, and the SIMULINK system\nmodel incorporating the proposed describing function.\nFig. 15. Terminated commutation.\nleg increases (see Fig. 15) until the switching device turns on.\nAt the instant of turn-on, the partially charged commutation\ncapacitor will be shorted, resulting in a large current spike (and\nincurring high loss). To accommodate this operating condition,\n(10) is modified to (24), shown at the bottom of the next page.\nIf the output current further advances beyond the point where\n, the leg voltage cannot reach the supply rail before\nthe output current reverses, making the reverse, as\nshown in Fig. 16. The commutation period then terminates at\nthe turn-on of the transistor, again incurring high loss and high\n. Beyond this point, the calculation of from (7)\ncan provide complex results, and is no longer valid. However,\nstill depicts the end of the commutation cycle and, for this\nmode of operation, radians. The leg voltage is therefore\n1020 IEEE TRANSACTIONS ON POWER ELECTRONICS, VOL. 19, NO. 4, JULY 2004\nFig. 16. dV =dt reversal before leg voltage reaches 0 V.\nvery similar to the case for terminated commutation (Fig. 15) as\n(25), shown at the bottom of the page.\nIf is advanced still further, the leg voltage, after initially\nreducing at device turn-off, rises to the supply voltage, where-\nupon the anti-parallel diode across the switch that has just turned\noff becomes forward biased and supports the output current.\nAt radians, the lower switch turns on, and supports\nthe output current. During turn-on, it dissipates all of the en-\nergy in the commutation capacitors and has to accommodate\nthe diode reverse recovery; thus incurring high loss. The angle\nat which the diode begins to conduct, ,\nis obtained by exploiting symmetry of the charging waveform,\nsee Fig. 17. is thus defined as the angle at which the voltage\nacross the capacitors reach . In reality, the voltage\nwill rise to , and, the exploitation of symmetry in\nthis manner introduces an error into the calculation. However,\nsince the resulting at is high, and the voltage error\nis low, the timing error introduced is small; ex-\ncept in cases when approaches or is very low.\nThis mode occurs if (does not account for\nthe effects of and as (26), shown at the very bottom\nof the page.\n(24)\n(25)\n(26)\nSEWELL et al.: DESCRIBING FUNCTION FOR RESONANTLY COMMUTATED H-BRIDGE INVERTERS 1021\nFig. 17. High loss during incorrect commutation.\nDuring normal operation, the resonant circuit is excited such\nthat it appears predominantly inductive (to reduce commutation\nlosses). However, if the unmodified describing function is cou-\npled to a transient FMA model of a high-order resonant circuit\n(such as an in-circuit averaged model), the resulting system\nmodel can exhibit instability if the current transiently assumes\na capacitive characteristic. Use of describing-functions derived\nfrom (24)–(26) address this issue. Moreover, if becomes\ngreater than (a highly inductive characteristic), the diode\nwill still be conducting when the switch turns off, implying\nthat the capacitors do not begin to support the current until\ncrosses zero (at , thereby effectively limiting to .[10]\nVIII. CONCLUSION\nThe paper presents the derivation of a novel describing func-\ntion to model the output voltage of a H-bridge inverter, and in-\ncludes a functional description of the relationship between the\noutput- and supply-currents. Accuracy of the resulting model\nis demonstrated by comparison with SPICE simulation results,\nand with practical measurements from a prototype induction\nheating system. The model facilitates system simulation over\na number of cycles of the input utility supply, ultimately al-\nlowing optimization of control systems without the significant\ncomputational overhead normally incurred by having to employ\nat switching-cycle level simulation. In particular, it is notable\nthat the proposed model executes, typically, some 10 000 times\nfaster than a H-bridge inverter modeled using Spice.\nLimitations of model applicability are discussed, with partic-\nular emphasis to operation during incorrect commutation of the\nH-bridge, along with suggested modifications to the proposed\nmodel where appropriate.\nREFERENCES\n[1] K. Chen and T. A. Stuart, “A study of IGBT turn-off behavior and\nswitching losses for zero-voltage and zero-current switching,” in Proc.\n7th Annu. Applied Power Electronics Conf. Expo., New York, 1992, pp.\n411–418.\n[2] E. J. Dede, V. Esteve, E. Maset, J. M. Espi, A. E. Navarro, J. A. Varrasco,\nand E. Sanchis, “Soft switching series resonant converter for induction\nheating applications,” in Proc. Int. Conf. Power Electronics and Drive\nSystems, vol. 2, 1995, pp. 689–693.\n[3] N. Frohleke, J. Kunze, A. Fiedler, and H. Grotstollen, “Contribution to\nthe AC-analysis of resonant converters; analysis of the series-parallel\nresonant converter including effects of parasitics and lossless snubber\nfor optimized design,” in Proc. 7th Annu. Applied Power Electronics\nConf. Expo. (APEC’92), 1995, pp. 219–228.\n[4] University of California Berkley Spice, Standard 3f3, 2003.\n[5] SIMULINK, Mathworks Inc., 2003.\n[6] SABER, Std. v5.1, 2003.\n[7] Data Sheet (2003). Standard APT5010LVR [Online]. Available:\nwww.advancedpower.com\n[8] A. D. Pathak, “MOSFET\/IGBT drivers theory and applications,” IXYS\nApplicat. Note AN0002, IXYS Corporation, Santa Clara, CA, 2003.\n[9] International Rectifier, IRFPS40N50L data sheet www.irf.com, 2003.\n[10] H. I. Sewell, D. A. Stone, and C. M. Bingham, “Novel, three phase, unity\npower factor modular induction heater,” Proc. Inst. Elect. Eng. B., vol.\n147, no. 5, pp. 371–378, Sept. 2000.\nH. Isaac Sewell received the M.Eng. degree in elec-\ntronic and electrical engineering and the Ph.D. degree\nfrom the University of Sheffield, Sheffield, U.K., in\n1996 and 2002, respectively.\nSince 2000, he has worked in industry as a Design\nEngineer at Inductelec, Ltd., Sheffield, and as a\nResearch Associate in the Department of Electronic\nand Electrical Engineering, University of Sheffield,\nwhere his research interests include induction\nheating, mains supply power factor correction, and\nanalysis of resonant power converters.\nDavid A. Stone received the B.Eng. degree in elec-\ntronic engineering from the University of Sheffield,\nSheffield, U.K., in 1984 and the Ph.D. degree from\nLiverpool University, Liverpool, U.K., in 1989.\nHe then returned to the University of Sheffield as\na Member of Academic Staff specializing in power\nelectronics and machine drive systems. His current\nresearch interests are in resonant power converters,\nhybrid-electric vehicles, battery charging, EMC,\nand novel lamp ballasts for low pressure fluorescent\nlamps.\nChris M. Bingham (M’94) received the B.Eng.\ndegree in electronic systems and control engineering,\nfrom Sheffield City Polytechnic, Sheffield, U.K.,\nin 1989, the M.Sc. degree in control systems engi-\nneering from the University of Sheffield, in 1990,\nand the Ph.D. degree from Cranfield University,\nCranfield, U.K., in 1994. His Ph.D. research was on\ncontrol systems to accommodate nonlinear dynamic\neffects in aerospace flight-surface actuators.\nHe remained with Cranfield University as a Post-\nDoctoral Researcher, until subsequently taking up a\nresearch position at the University of Sheffield. Since 1998, he has been a Lec-\nturer in the Department of Electronic and Electrical Engineering, University of\nSheffield. His current research interests include traction control\/antilock braking\nsystems for electric vehicles, electromechanical actuation of flight control sur-\nfaces, control of active magnetic bearings for high-speed machines, and sensor-\nless control of brushless machines.\n"}