{"doi":"10.1016\/0375-9601(94)91001-4","coreId":"68535","oai":"oai:eprints.lancs.ac.uk:32126","identifiers":["oai:eprints.lancs.ac.uk:32126","10.1016\/0375-9601(94)91001-4"],"title":"Noise-induced linearisation","authors":["Dykman, Mark","Luchinsky, D. G.","Mannella, R.","McClintock, Peter V. E.","Short, H. E.","Stein, N. D.","Stocks, N. G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1994-09-19","abstract":"It is found that the response of a nonlinear dynamical system can be linearised, and its frequency dispersion diminished, by the addition of external noise of sufficient intensity. Taking as an example an overdamped bistable system driven by a low-frequency periodic field, this noise-induced linearisation is investigated through analogue electronic experiments. The wider implications are considered","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68535.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/32126\/1\/NILPreprint.pdf","pdfHashValue":"c86c2af5422bd43dcc9b6dcc58f5491db34ce18a","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:32126<\/identifier><datestamp>\n      2018-01-01T04:16:43Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Noise-induced linearisation<\/dc:title><dc:creator>\n        Dykman, Mark<\/dc:creator><dc:creator>\n        Luchinsky, D. G.<\/dc:creator><dc:creator>\n        Mannella, R.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:creator>\n        Short, H. E.<\/dc:creator><dc:creator>\n        Stein, N. D.<\/dc:creator><dc:creator>\n        Stocks, N. G.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        It is found that the response of a nonlinear dynamical system can be linearised, and its frequency dispersion diminished, by the addition of external noise of sufficient intensity. Taking as an example an overdamped bistable system driven by a low-frequency periodic field, this noise-induced linearisation is investigated through analogue electronic experiments. The wider implications are considered.<\/dc:description><dc:date>\n        1994-09-19<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/32126\/1\/NILPreprint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/0375-9601(94)91001-4<\/dc:relation><dc:identifier>\n        Dykman, Mark and Luchinsky, D. G. and Mannella, R. and McClintock, Peter V. E. and Short, H. E. and Stein, N. D. and Stocks, N. G. (1994) Noise-induced linearisation. Physics Letters A, 193 (1). pp. 61-66. ISSN 0375-9601<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/32126\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1016\/0375-9601(94)91001-4","http:\/\/eprints.lancs.ac.uk\/32126\/"],"year":1994,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"Noise-Induced Linearisation\nM I Dykman\nDepartment of Physics, Stanford University,\nStanford, California 94305, USA.\nD G Luchinsky[1]\nSchool of Physics and Materials, Lancaster University,\nLancaster, LA1 4YB, UK.\nR Mannella\nDipartimento di Fisica, Universita` di Pisa,\nPiazza Torricelli 2, 56100 Pisa, Italy.\nP V E McClintock, H E Short, N D Stein and N G Stocks[2]\nSchool of Physics and Materials, Lancaster University,\nLancaster, LA1 4YB, UK.\nAbstract\nIt is found that the response of a nonlinear dynamical system can be linearised, and\nits frequency dispersion diminished, by the addition of external noise of sufficient inten-\nsity. Taking as an example an overdamped bistable system driven by a low-frequency\nperiodic field, this noise-induced linearisation is investigated through analogue electronic\nexperiments. The wider implications are considered.\n[1]Permanent address: All Russian Institute for Metrological Service, Andreevskaya nab 2, 117965\nMoscow, Russia.\n[2]Present address: Department of Engineering, University of Warwick, Coventry, CV4 7AL, UK.\n1\nPublished in Phys. Lett. A 193, 61-66 (1994)\nFig. 1. Noise-induced Iinearisation for a sine-wave passing\nthrough an electronic model of the overdamped double-well\nsystem given by Eqs.(4 )-(6). The periodic force at the input\nis shown in the upper trace. The ensemble-averaged response\n(q(t)}, measured at the output, is shown for different noise\nintensities D in the lower traces. The amplitudes of the\nlatter have been normalised so as to be comparable with\nthe amplitude of the force, for easier comparison of their\nrelative shapes.\nFig. 2. Noise-induced linearisation for a sawtooth wave pass-\ning through an electronic model of the overdamped bistable\nsystem given by Eqs. (4)-(6). The periodic force at the in-\nput is shown in the upper trace. The ensemble-averaged re-\nsponse (q(t)}, measured at the output, is shown for differ-\nent noise intensities D in the lower traces. The amplitudes\nof the latter have been normalised so as to be comparable\nwith the amplitude of the force, for easier comparison of\ntheir relative shapes.\ntrace, the output can be seen to be a faithful reproduc-\ntion of the input waveform.\nThe basic idea of linearisation by added noise will,\nof course, already be familiar through specific obser-\nvations and applications in science and engineering,\ne.g. the linearisation of periodic signals in neurophys-\niological experiments [1], or the linearisation of the\nresponse of ring-laser gyroscopes at low angular veloc-\nities [2]. Our present results suggest, however, that\nnoise-induced linearisation may exist as a more gen-\neral phenomenon than has been appreciated, thus fur-\nther illustrating the idea [3] that the role of noise in a\ndynamical system may in a certain sense be creative.\nOther examples that support this perception include:\nstochastic resonance [4] in which a weak periodic sig-\nnal in a nonlinear system can be enhanced by noise;\nnoise-induced transitions [5] where the number of ex-\ntrema in a probability density varies with noise inten-\nsity; the creation of spatial structures in liquid crys-\ntals [6]; the stabilisation of spatial structures in con-\nvecting fluids [7]; arguably, the maintenance of con-\nsciousness [8]; and the stochastic ratchets that pro-\nvide a possible basis for molecular locomotion [9]\nwithin biological cells.\nWe note that we use the word linearisation in two\nrather different senses, and that these are exemplified\nby the results of Figs. 1 and 2. The fact that a sinu-\nsoidal input can pass through the system without sig-\nnificant change of shape, as occurs for strong noise in\nthe lowest trace in Fig. 1, implies linearity in the di-\nrect sense, i.e., a proportionality between the ampli-\ntudes of output and input; this need not necessarily,\nhowever, imply that the constant of proportionality\nmust be frequency-independent. On the other hand,\nthe results of Fig. 2, for a sawtooth waveform con-\ntaining not only the fundamental frequency but also\nits higher harmonics, imply the occurrence of lineari-\nsation in the \"Hi-Fi\" sense that the system becomes\nnondispersive within a certain frequency range when\nthe noise intensity is large enough. In many cases of\nphysical interest nonlinearity of the response arises\nbecause the frequency of the driving force (or its over-\ntones) is close to some eigenfrequency of the system\n(or its overtones), or is related in a certain way to the\nrelaxation time of the system. It is to be expected for\nsuch systems that linearisation of the response in the\nsense of proportionality of output and input will not\nnecessarily imply suppression of the frequency disper-\nsion 4.\n4 Obviously, one could try to devise special circumstances\nwhich might violate this rule. One possible example would\nFigure 1: Noise-induced linearisation for a sine-wave p ssing through an electronic model\nof the overdamped double-well system given by Eqs.(4)-(6). The periodic force at the\ninput is shown in the upper trace. The ensemble-averaged response 〈q(t)〉, measured at\nthe output, is shown for different noise intensities D in the lower traces. The amplitudes\nof the latter have been normalised so as to be comparable with the amplitude of the force,\nfor easier comparison of their relative shapes.\nWhen a signal passes through a nonlinear dynamical system, it emerges distorted. The\nseverity of the effect depends on the frequency dispersion of the response and its non-\nlinearity, and on both the shape and the amplitude of the signal. We have observed,\nhowever, that this distortion can often be removed by the addition at the input of exter-\nnal white[3] noise of sufficient intensity. The scenario has been found experimentally to\nhold for many nonlinear systems, including monostable as well as bistable, underdamped\nas well as overdamped, chaotic as well as regular, and for signals of various shapes. The\nprocess might be described by the term noise-induced linearisation. The linearised output\nq(t) resulting from this procedure is inevitably noisy and so, to focus attention on what\nhappens to the signal itself, in what follows we will discuss how the ensemble average\n〈q(t)〉 of the output varies with relevant parameters, for example with the noise intensity\nat the input.\nThese ideas are illustrated by the experimental data shown in Figures 1 and 2, obtained\nfrom an analogue electronic circuit model of an overdamped bistable system driven by a\nperiodic force (see below). The input to the system in each case is the waveform shown\nat the top, whose period i large compared to the rel xation time of the system to its\nstable state(s). For small (but not very small: see below) noise in ensity D, the output\nresponse of the system is grossly distorted, as shown by the upper 〈q(t)〉 traces. As the\nnoise intensity is increased, however, the distortion steadily diminishes in each case until,\nin the lowest trace, the output can be seen to be a faithful reproduction of the inpu\nwaveform.\n[3]For convenience, we will concentrate on the effects of white or quasi-white noise. Most of the discus-\nsion, however, is applicable qualitatively, and sometimes quantitatively, to the case of non-white noise,\nprovided that its correlation time is shorter than the characteristic reciprocal frequencies of interest.\n2\nFig. 1. Noise-induced Iinearisation for a sine-wave passing\nthrough an electronic model of the overdamped double-well\nsystem given by Eqs.(4 )-(6). The periodic force at the input\nis shown in the upper trace. The ensemble-averaged response\n(q(t)}, measured at the output, is shown for different noise\nintensities D in the lower traces. The amplitudes of the\nlatter have been normalised so as to be comparable with\nthe amplitude of the force, for easier comparison of their\nrelative shapes.\nFig. 2. Noise-induced linearisation for a sawtooth wave pass-\ning through an electronic model of the overdamped bistable\nsystem given by Eqs. (4)-(6). The periodic force at the in-\nput is shown in the upper trace. The ensemble-averaged re-\nsponse (q(t)}, measured at the output, is shown for differ-\nent noise intensities D in the lower traces. The amplitudes\nof the latter have been normalised so as to be comparable\nwith the amplitude of the force, for easier comparison of\ntheir relative shapes.\ntrace, the output can be seen to be a faithful reproduc-\ntion of the input waveform.\nThe basic idea of linearisation by added noise will,\nof course, already be familiar through specific obser-\nvations and applications in science and engineering,\ne.g. the linearisation of periodic signals in neurophys-\niological experiments [1], or the linearisation of the\nresponse of ring-laser gyroscopes at low angular veloc-\nities [2]. Our present results suggest, however, that\nnoise-induced linearisation may exist as a more gen-\neral phenomenon than has been appreciated, thus fur-\nther illustrating the idea [3] that the role of noise in a\ndynamical system may in a certain sense be creative.\nOther examples that support this perception include:\nstochastic resonance [4] in which a weak periodic sig-\nnal in a nonlinear system can be enhanced by noise;\nnoise-induced transitions [5] where the number of ex-\ntrema in a probability density varies with noise inten-\nsity; the creation of spatial structures in liquid crys-\ntals [6]; the stabilisation of spatial structures in con-\nvecting fluids [7]; arguably, the maintenance of con-\nsciousness [8]; and the stochastic ratchets that pro-\nvide a possible basis for molecular locomotion [9]\nwithin biological cells.\nWe note that we use the word linearisation in two\nrather different senses, and that these are exemplified\nby the results of Figs. 1 and 2. The fact that a sinu-\nsoidal input can pass through the system without sig-\nnificant change of shape, as occurs for strong noise in\nthe lowest trace in Fig. 1, implies linearity in the di-\nrect sense, i.e., a proportionality between the ampli-\ntudes of output and input; this need not necessarily,\nhowever, imply that the constant of proportionality\nmust be frequency-independent. On the other hand,\nthe results of Fig. 2, for a sawtooth waveform con-\ntaining not only the fundamental frequency but also\nits higher harmonics, imply the occurrence of lineari-\nsation in the \"Hi-Fi\" sense that the system becomes\nnondispersive within a certain frequency range when\nthe noise intensity is large enough. In many cases of\nphysical interest nonlinearity of the response arises\nbecause the frequency of the driving force (or its over-\ntones) is close to some eigenfrequency of the system\n(or its overtones), or is related in a certain way to the\nrelaxation time of the system. It is to be expected for\nsuch systems that linearisation of the response in the\nsense of proportionality of output and input will not\nnecessarily imply suppression of the frequency disper-\nsion 4.\n4 Obviously, one could try to devise special circumstances\nwhich might violate this rule. One possible example would\nFigure 2: Noise-induced linearisatio for a sawtooth wave assing through an electronic\nmodel of the overdamped bistable system given by Eqs.(4) - (6). T e periodic force at the\ninput is shown in the upper trace. The ensemble-averaged response 〈q(t)〉, mea ured at\nthe output, is shown for different noise intensities D in the lower traces. The amplitudes\nof the latter have been normalised so as to be comparable with the amplitude of the force,\nfor easier comparison of their relative shapes.\nThe basic idea of linearisation by added noise will, of course, already be familiar\nthrough specific observations and applications in science and engineering, e.g. the lineari-\nsation of periodic signals in neurophysiological experiments [1], or the linearisation of the\nresponse of ring-laser gyroscopes at low angular velocities [2]. Our present results sug-\ngest, however, that noise-induced linearisation may exist as a more general phenomenon\nthan has been appreciated, thus further illustrating the idea [3] that the role of noise in a\ndynamical system may in a certain sense be creative. Other examples that support this\nperception include: stochastic resonance [4] in which a weak periodic signal in a nonlin-\near system can be enhanced by noise; noise-induced transitions [5] where the number of\nextrema in a probability density varies with noise intensity; the creation of spatial struc-\ntures in liquid crystals [6]; the stabilisation of spatial structures in convecting fluids [7];\narguably, the maintenance of consciousness [8]; and the stochastic ratchets that provide\na possible basis for molecular locomotion [9] within biological cells.\nWe note that we use the word linearisation in two rather different senses, and that\nthese are exemplified by the results of Figures 1 and 2. The fact that a sinusoidal input\ncan pass through the system without significant change of shape, as occurs for strong noise\nin the lowest trace in Figure 1, implies linearity in the direct sense, i.e., a proportionality\nbetween the amplitudes of output and input; this need not necessarily, however, imply\nthat the constant of proportionality must be frequency-independent. On the other hand,\nthe results of Figure 2, for a sawtooth waveform containing not only the fundamental\nfrequency but also its higher harmonics, imply the occurrence of linearisation in the “Hi-\nFi” sense that the system becomes non-dispersive within a certain frequency range when\nthe noise intensity is large enough. In many cases of physical interest nonlinearity of the\nresponse arises because the frequency of the driving force (or its overtones) is close to\n3\nsome eigenfrequency of the system (or its overtones), or is related in a certain way to the\nrelaxation time of the system. It is to be expected for such systems that linearisation of\nthe response in the sense of proportionality of output and input will not necessarily imply\nsuppression of the frequency dispersion. [4]\nThe physical origin of both forms of signal restoration can readily be understood, at\nleast qualitatively, in the following terms. Where the amplitude response of a system to\na periodic force is nonlinear, this arises because the amplitude of the vibrations induced\nby the force is comparable with, or larger than, some characteristic nonlinear length scale\nof the system. The scale in question (which may depend on frequency: see below) is\ndetermined by the structure of the region of phase space being visited by the system and\nby corresponding features in the dynamics. The effect of noise is to smear the system over\na larger region of phase space, so that a variety of different scales and frequencies then\nbecome involved in the motion, even in the absence of periodic driving, and the effective\ncharacteristic scale will usually increase as a result. For sufficiently large noise intensities,\ntherefore, the amplitude of the force-induced vibrations will become small compared to\nthe scale (eg small compared to the average size of the noise-induced fluctuations), so that\nthe nonlinearity of the response is correspondingly reduced. Because the system is then\nspending an increasing proportion of its time far away from its attractor(s), at coordinate\nvalues where the time that characterizes the motion will in general be quite different and\nsometimes shorter (or even much shorter: see below), than for small noise intensities,\nthere will be one or more ranges of frequency for which dispersion is likely to decrease\n[10]. Although the linearisation and the suppression of the dispersion arise, ultimately,\nthrough the same physical processes - the effect of noise in smearing the system over\na larger region of its phase space - there is no reason to expect that they will become\nimportant at the same noise intensity.\nThe harmonic oscillator provides an obvious example: here, the response is always\nlinear, the amplitude of the forced vibrations being proportional to the amplitude of the\nforce; at the same time, dispersion can be very strong, particularly for an underdamped\noscillator in the range of its eigenfrequency. For nonlinear systems, the narrow peaks in\nspectral densities of fluctuations are eventually [11] broadened by an increase in noise in-\ntensity; for underdamped systems, one of the basic broadening mechanisms comes about\nbecause the eigenfrequencies of vibration depend on amplitude, so that the broader the\ndistribution over amplitude becomes due to the increasing fluctuations, the broader be-\ncomes the distribution over eigenfrequencies [12].\nBistable systems display, in addition, a different and quite universal type of strong\nfrequency dispersion. It arises at low frequencies (or at frequencies close to that of the\nstrong force, if it is the latter that has created the bistability, as eg in optical bistability),\nboth in underdamped and overdamped systems. It is related to the fact that a low-\nfrequency force can modulate the distribution of a bistable system over the states. This\nmodulation has been investigated in great detail recently in the context of stochastic\nresonance [4]. It is effective when the frequency is low enough for one fluctuational\ntransition in each direction to occur between the states, with high probability, during one\nperiod of the force.\n[4]Obviously, one could try to devise special circumstances which might violate this rule. One possible\nexample would be a logarithmic amplifier. However, even though this would be dispersion-free but highly\nnonlinear for low noise intensities, it seems likely nonetheless that the response would be eventually\nlinearised by noise, just like the other cases that we consider.\n4\nQuite generally, the ensemble-averaged term in the coordinate 〈δq(t)〉 of a stationary\nsystem that arises when the system is driven by a periodic force A cos Ωt can be written\nin the form\n〈δq(t)〉 =∑\nn\na(n)[cosnΩt+ φ(n)] (1)\nIf the amplitude of the force A is small enough, the response is linear, so that only the\nn = 1 term need be retained:\n〈δq(t)〉 = a cos(Ωt+ φ) (2)\nwhere\na ≡ a(1) = A|χ(Ω)|, φ ≡ φ(1) = −arctan[Imχ(Ω)\/Reχ(Ω)] (3)\nHere, χ(Ω) is the susceptibility of the system. It completely describes the linear response\nto a sufficiently weak periodic force, and it is the frequency dependence of χ(Ω) that\ncorresponds to the frequency dispersion of the linear response of a system. For systems\nperforming Brownian motion of a quasi-thermal type, the fluctuation dissipation theorem\n[13] can be used to express the susceptibility χ(Ω) in terms of the spectral density of\nfluctuations in the absence of the periodic force.\nWhere the input amplitude A is not very small, however, the amplitudes a(n) of\nvibration at the overtones (n > 1) will no longer be small and the system will display\nnonlinearity.\nIn the present Letter we illustrate noise-induced linearization and reduction of fre-\nquency dispersion for a particular bistable system. We consider as an example the case\nof overdamped Brownian motion in a symmetrical double well potential described by the\nequation\nq˙ + U ′(q) = A cos Ωt+ f(t) (4)\nU(q) = −1\n2\nq2 +\n1\n4\nq4 (5)\nHere, A cos Ωt is the periodic input force and f(t) is quasi-white zero-mean Gaussian noise\nof intensity D,\n〈f(t)f(t′)〉 = 2Dδ(t− t′) (6)\nThe system (4)-(6) has been studied intensively in the context of stochastic resonance\n[4]; its effect in distorting rectangular signals has recently been discussed in [14]; and\nits properties are to a large extent understood. In particular, for small noise intensities,\nD \u001c ∆Un, where ∆Un (= 14 for the model of Eq (5)) is the depth of the nth potential\nwell (n = 1, 2), the susceptibility of the system is given by the sum of the contributions\nfrom the motion about the minima of the wells that arises in response to the periodic\nforce, and the contribution from the modulation of the populations of the stable states\ndue to the force [15]\nχ(Ω) =\n∑\nn\nwn(U\n′′\nn − iΩ)−1 +\nw1w2\nD\n(q1 − q2)2W (W − iΩ)−1 (7)\n5\nspectral density of fluctuations in the absence of the\nperiodic force.\nWhere the input amplitude A is not very small, how-\never, the amplitudes a (n) of vibration at the over-\ntones (n > 1) will no longer be small and the system\nwill display nonlinearity.\nIn the present Letter we illustrate noise-induced lin-\nearisation and reduction of frequency dispersion for a\nparticular bistable system. We consider as an example\nthe case of overdamped Brownian motion in a sym-\nmetrical double well potential described by the equa-\ntion\nHere, A cos (Q t) is the periodic input force and f (t)\nis quasi-white zero-mean Gaussian noise of intensity\nD,\nThe system (4)- (6) has been studied intensively in\nthe context of stochastic resonance [4]; its effect in\ndistorting rectangular signals has recently been dis-\ncussed in Ref. [14]; and its properties are to a large\nextent understood. In particular, for small noise in-\ntensities, D «6.un, where !!.Un (= ~for the model of\nEq. (5» is the depth of the nth potential well (n =\n1,2), the susceptibility of the system is given by the\nsum of the contributions from the motion about the\nminima of the wells that arises in response to the peri-\nodic force, and the contribution from the modulation\nof the populations of the stable states due to the force\n[15]\nwhere Wl,2 are the stationary populations of the wells\n(WI = W2 = ~for a symmetric potential), the U~'are\nthe curvatures of the bottoms of the wells, and W =\nW12 + W21 is the sum of the probabilities Wnm of the\ninterwell transitions n ---> m.\nThe transition probabilities Wnm ex exp (-!!.Un \/ D)\nincrease exponentially fast with increasing noise in-\ntensity D. Therefore it is immediately evident from\n10·\nN:::: 10.,r------------ ~('a)\n~ 10.2\nM:e 10.3\n('oJ§: 10.4\n10.5 \"\"\":e\n10'·\n\\----~---___,-..:c:..:.::.:.:.:'T-.=-=--=-.=-.= .........,\nN:::: 10'\n~ 10°\nM:e 10\"\n~ 10-2\n~ 10-3\n10.4\n0.00\n0.00 0.05 0.10 0.15 0.20\nn\nFig. 3. The normalised response of the system (4)- (6) to\na sinusoidal driving force, as a function of its frequency Q,\nfor three noise intensities: (a) D = 0.5; (b) D = 0.3; (c)\nD = 0.02. The full curves represent the squared ratio of the\nresponse a ( I) at the driving frequency to the amplitude A\nof the driving force (= Ix 12). The dashed curves represent\nthe squared ratio of the response a (3) at the third harmonic\nof the driving frequency to the response a ( I) at the driving\nfrequency.\nEq. (7) that, for Q « U~\/, there will be strong disper-\nsion for weak noise where W :::,Q but negligible dis-\npersion for stronger noise. Figs. 3a-3c show the vari-\nation of the response with frequency, calculated [17]\nfor three different noise intensities. The full curves\ncorrespond to the square of the response at Q (see cap-\ntion); they exhibit a strong dependence on frequency\nfor weak noise intensity (Fig. 3c), but become much\nflatter as the noise intensity is increased to a larger\nvalue (Fig. 3a). We notice that the range of strong dis-\npersion becomes exponentially narrow for very small\nnoise intensities.\nNot only may bistable systems display strong fre-\nFigure 3: The normalised response of the system (7)-(9) to a sinusoidal driving force, as\na function of its frequency Ω, for three noise intensities: (a) D = 0.5; (b) D = 0.3; (c)\nD = 0.02. The full curves represent the squared ratio of the response a(1) at the driving\nfrequency to the amplitude A of the driving force (= |χ|2). The dashed curves represent\nthe squared ratio of the r sponse a(3) at th third harmonic of the driving frequency to\nthe response a(1) at the driving frequency.\nwhere w1,2 are the stationary populations of the wells (w1 = w2 =\n1\n2\nfor a symmetric\npotential), the U ′′n are the curvatures of the bottoms of the wells, and W = W12 +W21 is\nthe sum of the probabilities Wnm of the interwell transitions n→ m.\nThe transition probabilities Wnm ∝ exp(−∆Un\/D) increase exponentially fast with\nincreasing noise intensity D Therefore it is immediately evident from Eq. (7) that, for\nΩ \u001c U ′′n , there will be strong dispersion for weak noise where W <∼ Ω but negligible\ndispersion for stronger noise. Figure 3(a)-(c) shows the variation of the response with\nfrequency, calculated [17] for three different noise intensities. The full curves correspond\nto the square of the response at Ω (see caption); they exhibit a strong dependence on\nfrequency for weak noise intensity (c), but become much flatter as the noise intensity is\nincreased to a larger value (a). We notice that the range of strong dispersion becomes\nexponentially narrow for very small noise intensities.\n6\nNot only may bistable systems display strong frequency dispersion, but they are also\nknown to display a giant nonlinearity [15, 16, 17] where, for comparatively small input\namplitudes A, the interwell transition probabilities are modulated strongly enough for the\nsystem to make on average almost exactly one pair of transitions, at nearly the same values\nof phase, on each cycle of the periodic force. Clearly, for very much lower noise intensities,\nsuch that the interwell transitions are suppressed, the response to weak periodic forcing\nabout either one of the minima of the potential wells will be at least approximately linear.\nOn the other hand, for high noise intensities many transitions will happen at random over\nthe period of the force, and they will not be synchronized. Consequently, the parameter\nrange where the system displays the giant nonlinearity in response to a small-amplitude\nperiodic force is limited to low frequencies Ω and appropriately small noise intensities.\nOne may choose as a quantitative measure of the weakness (or otherwise) of the\nnonlinearity of the response of a system the ratio of the harmonics a(n)\/a(1) in (1).\nThe dashed curves in Fig. 3 indicate the squared ratio of the third harmonic to that at\nthe fundamental, [a(3)\/a(1)]2 (by symmetry arguments, a(2) = 0 for the system (4) -\n(6)). It is clear that these nonlinear contributions decrease rapidly with increasing noise\nintensity. Noise-induced linearisation (in both the amplitude and frequency senses) is\ntherefore indeed to be anticipated for the system (4) - (6), thereby accounting for the\nphenomena observed in Figures 1 and 2 which were obtained from an analogue electronic\ncircuit of conventional [18, 19] design built to model this system.\nIt is important to note, and it is clear from the above example, that the same phys-\nical processes which give rise to noise-induced linearisation can also, under special cir-\ncumstances, give rise to the opposite effect of noise-induced delinearisation. The latter\nphenomenon is to be anticipated if the additional frequencies that become involved (as\nthe result of an increase in noise intensity) resonate with the periodic force or with one\nof its harmonics, or if the noise modifies the characteristic reciprocal relaxation time of\nthe system so that it corresponds to the frequency of the periodic force. In such cases,\njust as seen above for the system (4) - (6), it is to be expected that the promotion of\nnonlinearity by noise at intermediate intensities will be followed by the more general phe-\nnomenon of noise-induced linearisation at still higher noise intensities owing to the usual\nnoise-induced broadening of the relevant spectral peak(s). We have also observed and\ninvestigated sequential noise-induced delinearization\/linearisation phenomena in dynam-\nical systems quite different from (4) - (6), for example, in an underdamped monostable\noscillator [10].\nWe conclude that the noise-induced linearisation of the response of a nonlinear system\nto a sinusoidal force is a quite general phenomenon. Noise-induced suppression of the\nfrequency dispersion for low frequencies also appears to be of wide occurrence: we suggest\nthat it is to be anticipated for Brownian motion in all potentials that are harder (i.e. rising\nfaster) than parabolic within the relevant energy range, provided that the fundamental\nfrequency of the force and its relevant harmonics are very much smaller then the natural\nfrequency of small oscillations in underdamped systems, or than the reciprocal relaxation\ntime in the case of overdamped systems. A sufficient condition for removing low-frequency\ndispersion, in the case of simple, non-chaotic, attractors (and for non-potential motion,\ngenerally) appears to be that the time needed to come from infinity should be finite.\nThe delinearisation phenomenon is likely to arise in those cases where the frequency\nof the periodic force, or of one of its harmonics, can be tuned by the noise close to\nan eigenfrequency (or in certain cases a reciprocal characteristic relaxation time) of the\n7\nsystem.\nACKNOWLEDGEMENTS\nWe gratefully acknowledge partial support of this work by the Science and Engineering\nResearch Council (UK), by the Royal Society of London, by the European Community\nDirectorate General XII and by the Nuffield Foundation (London).\nReferences\n[1] A. S. French, A. V. Holden and R. B. Stein, Kybernetik 11 (1972) 15; see also J. P.\nSegundo, J.-F. Vibert, K. Pakdaman, M. Stiber and O. Diez Martinez, “Noise in the\nneurosciences: a long history, a recent revival and some theory”, in K. Pribram, ed.\nProceedings of the Second Appalachian Conference, in press, and references therein.\n[2] K. Vogel, H. Risken, W. Schleich, M. James, F. Moss, R. Mannella and P.V.E.\nMcClintock, J. Appl. Phys. 62 (1987) 721.\n[3] M.M. Millonas, ed., Fluctuations and Order: the new Synthesis, Springer, Berlin, in\npress.\n[4] See J. Stat. Phys. 70, nos. 1\/2 (1993), special issue on stochastic resonance, ed. F.\nMoss, A. Bulsara and M.F. Shlesinger.\n[5] W. Horsthemke and R. Lefever, Noise-Induced Transitions (Springer-Verlag, Berlin,\n1984).\n[6] S. Kai, “Electrohydrodynamic Instability of Nematic Liquid Crystals: Growth Pro-\ncess and Influence of Noise”, In Noise in Nonlinear Dynamical Systems, edited by F.\nMoss and P.V.E. McClintock, volume 3, 22-76 (Cambridge University Press, Cam-\nbridge, 1989).\n[7] R.J. Deissler, J. Stat. Phys. 54 (1989) 1459.\n[8] A.J. Mandell and K.A. Selz, J. Stat. Phys. 70 (1993) 355.\n[9] M.O. Magnasco, Phys. Rev. Lett. 72 (1994) 2656.\n[10] M.I. Dykman, D.G. Luchinsky, R. Mannella, P.V.E. McClintock, H.E. Short, N.D.\nStein and N.G. Stocks, “Noise-induced linearisation and delinearisation”, in M.M.\nMillonas, ed., Fluctuations and Order: the New Synthesis, Springer, Berlin, in press.\n[11] M.I. Dykman, R. Mannella, P.V.E. McClintock, S.M. Soskin and N.G. Stocks, Phys.\nRev. A 42 (1990) 7041.\n[12] M.I. Dykman and M.A. Krivoglaz, in Soviet Physics Reviews, ed by I.M. Khalatnikov\n(Harwood, New York 1984) vol.5, p. 265; M.I. Dykman and P.V.E. McClintock,\nPhysica D 58, 10 (1992).\n[13] L.D. Landau and E.M. Lifshitz, Statistical Physics, 3rd Edition (Pergamon, Oxford,\n1980).\n8\n[14] M. Morillo and J. Go`mez Ordo`n˜ez, “Amplification and distortion of a periodic rect-\nangular driving signal by a noisy bistable system”, to be published.\n[15] M.I. Dykman, R. Mannella, P.V.E. McClintock, and N.G. Stocks, Phys. Rev. Lett.\n65 (1990) 2606; M.I. Dykman, P.V.E. McClintock, R. Mannella, and N.G. Stocks,\nSov. Phys. J.E.T.P. Lett. 52 (1990) 141.\n[16] T. Zhou, F. Moss and P. Jung, Phys. Rev. A 42 (1990) 3161.\n[17] M.I. Dykman, R. Mannella, P.V.E. McClintock, N.D. Stein and N.G. Stocks, Phys.\nRev. E 47 (1993) 1629.\n[18] L. Fronzoni, “Analogue Simulations of Stochastic Processes by Means of Minimum\nComponent Electronic Devices.” In Noise in Nonlinear Dynamical Systems, edited\nby F. Moss and P.V.E. McClintock, volume 3, 222-242 (Cambridge University Press,\nCambridge, 1989).\n[19] P.V.E. McClintock, and F. Moss, “Analogue Techniques for the Study of Problems in\nStochastic Nonlinear Dynamics.” In Noise in Nonlinear Dynamical Systems, edited\nby F. Moss and P.V.E. McClintock, volume 3, 243-274 (Cambridge University Press,\nCambridge, 1989).\n9\nFIGURE CAPTIONS\n10\n"}