{"doi":"10.1016\/j.palaeo.2010.04.003","coreId":"57266","oai":"oai:nora.nerc.ac.uk:9993","identifiers":["oai:nora.nerc.ac.uk:9993","10.1016\/j.palaeo.2010.04.003"],"title":"Sea ice extent and seasonality for the Early Pliocene northern Weddell Sea","authors":["Williams, Mark","Nelson-Laloë, Anna E.","Smellie, John L.","Leng, Melanie J.","Johnson, Andrew L.A.","Jarram, Daniel R.","Haywood, Alan M.","Peck, Victoria L.","Zalasiewicz, Jan","Bennett, Carys","Schöne, Bernd R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"Growth increment analysis coupled with stable isotopic data (δ18O\/δ13C) from Early Pliocene (ca 4.7 Ma)\\ud\nAustrochlamys anderssoni from shallow marine sediments of the Cockburn Island Formation, northern\\ud\nAntarctic Peninsula, suggest these bivalves grew through much of the year, even during the coldest parts of\\ud\nwinter recorded in the shells. The high frequency fluctuation in growth increment width of A. anderssoni\\ud\nappears to reflect periodic, but year-round, agitation of the water column enhancing benthic food supply\\ud\nfrom organic detritus. This suggests that Austrochlamys favoured waters that were largely sea ice free. Our\\ud\ndata support interpretation of the Cockburn Island Formation as an interglacial marine deposit and the\\ud\nprevious hypothesis that Austrochlamys retreated from the Antarctic as sea ice extent expanded, this\\ud\ntransition occurring during climate cooling in the Late Pliocene","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/57266.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/9993\/1\/Williams_et_al_Antarctic_bivalves_%282%29.pdf","pdfHashValue":"f7f746b9da6294c6e10e4bb76e8cb1160a30172a","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:9993<\/identifier><datestamp>\n      2012-11-23T09:41:28Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9993\/<\/dc:relation><dc:title>\n        Sea ice extent and seasonality for the Early Pliocene northern Weddell Sea<\/dc:title><dc:creator>\n        Williams, Mark<\/dc:creator><dc:creator>\n        Nelson-Laloë, Anna E.<\/dc:creator><dc:creator>\n        Smellie, John L.<\/dc:creator><dc:creator>\n        Leng, Melanie J.<\/dc:creator><dc:creator>\n        Johnson, Andrew L.A.<\/dc:creator><dc:creator>\n        Jarram, Daniel R.<\/dc:creator><dc:creator>\n        Haywood, Alan M.<\/dc:creator><dc:creator>\n        Peck, Victoria L.<\/dc:creator><dc:creator>\n        Zalasiewicz, Jan<\/dc:creator><dc:creator>\n        Bennett, Carys<\/dc:creator><dc:creator>\n        Schöne, Bernd R.<\/dc:creator><dc:description>\n        Growth increment analysis coupled with stable isotopic data (δ18O\/δ13C) from Early Pliocene (ca 4.7 Ma)\\ud\nAustrochlamys anderssoni from shallow marine sediments of the Cockburn Island Formation, northern\\ud\nAntarctic Peninsula, suggest these bivalves grew through much of the year, even during the coldest parts of\\ud\nwinter recorded in the shells. The high frequency fluctuation in growth increment width of A. anderssoni\\ud\nappears to reflect periodic, but year-round, agitation of the water column enhancing benthic food supply\\ud\nfrom organic detritus. This suggests that Austrochlamys favoured waters that were largely sea ice free. Our\\ud\ndata support interpretation of the Cockburn Island Formation as an interglacial marine deposit and the\\ud\nprevious hypothesis that Austrochlamys retreated from the Antarctic as sea ice extent expanded, this\\ud\ntransition occurring during climate cooling in the Late Pliocene.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9993\/1\/Williams_et_al_Antarctic_bivalves_%282%29.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Williams, Mark; Nelson-Laloë, Anna E.; Smellie, John L.; Leng, Melanie J.; Johnson, Andrew L.A.; Jarram, Daniel R.; Haywood, Alan M.; Peck, Victoria L.; Zalasiewicz, Jan; Bennett, Carys; Schöne, Bernd R..  2010  Sea ice extent and seasonality for the Early Pliocene northern Weddell Sea.   Palaeogeography, Palaeoclimatology, Palaeoecology, 292 (1-2). 306-318.  https:\/\/doi.org\/10.1016\/j.palaeo.2010.04.003 <https:\/\/doi.org\/10.1016\/j.palaeo.2010.04.003>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science\/journal\/00310182<\/dc:relation><dc:relation>\n        10.1016\/j.palaeo.2010.04.003<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/9993\/","http:\/\/www.sciencedirect.com\/science\/journal\/00310182","10.1016\/j.palaeo.2010.04.003"],"year":2010,"topics":[],"subject":["Publication - Article","PeerReviewed"],"fullText":"   1 \n \nSeasonality in Pliocene Antarctic bivalves \nSea ice extent and seasonality for the Early Pliocene northern Weddell Sea  1 \nMark Williams\na,b,*\n, Anna E. Nelson\nc\n, John L. Smellie\na,c\n, Melanie J. Leng\nd\n, Andrew L.A. Johnson\ne\n, 2 \nDaniel R. Jarram\na\n, Alan M. Haywood\nf\n, Victoria L. Peck\nc\n, Jan Zalasiewicz\na\n, Carys Bennett\na\n, Bernd 3 \nR. Schöne\ng\n 4 \na\nDepartment of Geology, University of Leicester, Leicester, LE1 7RH, UK 5 \nb\nBritish Geological Survey, Keyworth, Nottingham, NG12 5GG, UK 6 \nc\nBritish Antarctic Survey, Geological Sciences Division, High Cross, Madingley Road, Cambridge, CB3 7 \n0ET, UK 8 \nd\nNERC Isotope Geosciences Laboratory, British Geological Survey, Keyworth, Nottingham, NG12 5GG, UK 9 \ne\nGeographical, Earth and Environmental Sciences, School of Science, University of Derby, Kedleston Road, 10 \nDerby, DE22 1GB, UK 11 \nf\nSchool of Earth and Environment, University of Leeds, Leeds, LS2 9JT, UK 12 \ng\nDepartment of Applied and Analytical Palaeontology, Earth System Science Research Centre, Institute of 13 \nGeosciences, University of Mainz, Johann-Joachim-Becherweg 21, 55127 Mainz, Germany 14 \n*Corresponding author. E-mail address: mri@le.ac.uk (M. Williams) 15 \n 16 \nAbstract 17 \nGrowth increment analysis coupled with stable isotopic data (δ18O\/δ13C) from Early Pliocene (ca 4.7 Ma) 18 \nAustrochlamys anderssoni from shallow marine sediments of the Cockburn Island Formation, northern 19 \nAntarctic Peninsula, suggest these bivalves grew through much of the year, even during the coldest parts of 20 \nwinter recorded in the shells. The high frequency fluctuation in growth increment width of A. anderssoni 21 \nappears to reflect periodic, but year-round, agitation of the water column enhancing benthic food supply 22 \nfrom organic detritus. This suggests that Austrochlamys favoured waters that were largely sea ice free. Our 23 \ndata support interpretation of the Cockburn Island Formation as an interglacial marine deposit and the 24 \nprevious hypothesis that Austrochlamys retreated from the Antarctic as sea ice extent expanded, this 25 \ntransition occurring during climate cooling in the Late Pliocene. Our data question climate models that show 26 \nextensive sea ice in the Weddell Sea during the Early Pliocene.  27 \nKeywords: Pliocene, Antarctic, bivalves, seasonality, sea ice, climate 28 \n   2 \n \nSeasonality in Pliocene Antarctic bivalves \n 29 \n1. Introduction 30 \nThe Pliocene Epoch (5.3 to 2.6 Ma) spans a time when the Earth experienced a transition from 31 \nrelatively warm conditions to a cooling climate that heralded the high magnitude glacial-interglacial 32 \noscillations of the Pleistocene Epoch (Haywood et al., 2009). The warm interglacial climates of the 33 \nPliocene may be plausible comparative scenarios for interpreting the path of future climate warming 34 \nduring the 21\nst\n century (Jansen et al., 2007; Haywood et al., 2009). Whilst overall global climate 35 \nmay have been 2-3°C warmer during the ‘mid Piacenzian warm interval’ (= ‘mid Pliocene warm 36 \nperiod’ of earlier papers), climate at high latitudes is modelled to have been much warmer than 37 \ntoday (Haywood et al., 2007 and references therein). Given the significance of a warming 21\nst\n 38 \ncentury global climate and its influence on high latitude sea surface temperatures and sea ice extent, 39 \nit is important to develop proxies that can ground-truth models of high latitude regions during the 40 \nPliocene (e.g. Dowsett, 2007, fig. 6).  41 \nBivalves preserve a signal of marine seasonality (e.g. water temperature, upwelling, food 42 \nsupply) in their carbonate geochemistry and skeletal morphology (e.g. Jones and Quitmyer, 1996; 43 \nA. Johnson et al., 2000, 2009; Schöne et al., 2003, 2005). These signals have been used to provide 44 \nclimate information across a range of palaeolatitudes (e.g. Williams et al., 2009a). Antarctic 45 \nPeninsula Neogene fossil bivalves have received detailed taxonomic and environmental appraisal 46 \n(e.g. Jonkers et al., 2002; Jonkers, 2003) but they have not been used to assemble a record of 47 \nseasonality. Nevertheless, Berkman et al. (2004) have presented a cogent argument, based on 48 \nmorphological and sedimentological analyses, which suggests that the retreat of Chlamys-like 49 \nbivalves from the Antarctic resulted from increasing sea ice cover during the climate cooling of the 50 \nLate Pliocene.  51 \nThe pectinid bivalve Austrochlamys anderssoni occurs commonly in rocks of Late Miocene 52 \nthrough Pliocene age on the northern Antarctic Peninsula. Austrochlamys anderssoni is ideal for 53 \ninvestigation of palaeoseasonality as specimens are large, often reaching greater than 10 cm from 54 \n   3 \n \nSeasonality in Pliocene Antarctic bivalves \numbo to margin in adults, and record a number of seasons of growth. In addition, the width of 55 \nindividual growth increments in A. anderssoni is easy to measure (mm-scale), and they are 56 \ncorrespondingly easy to sample for geochemical analysis. Here we analyze ontogenetic patterns in 57 \nA. anderssoni to test for the extent of sea ice in the northern Weddell Sea during a warm interval of 58 \nthe Early Pliocene. We test two possible marine scenarios: 1), that there was extensive winter sea 59 \nice with no planktonic food-supply, no re-suspension of detrital food and therefore limited or no 60 \nbivalve growth, an environment suggested by some climate models (see Fig. 1); and 2), no winter 61 \nsea ice with bivalve growth continuing via a supply of periodically re-suspended organic detritus 62 \nvia water column agitation. We use stable oxygen and carbon isotopes to define seasonal intervals 63 \nduring the growth of A. anderssoni and to estimate seasonal temperature variation: we then use 64 \ngrowth increment data as a proxy to interpret benthic food supply and sea ice extent. 65 \n 66 \n2. Geological setting 67 \nThe James Ross Island Volcanic Group (JRIVG) dominates the outcrop geology of James Ross 68 \nIsland, Vega Island and several small islands including Cockburn Island, in the northern Weddell 69 \nSea, east of the Antarctic Peninsula (Fig. 2). The volcanic rocks unconformably overlie relatively 70 \nunconsolidated Cretaceous marine deposits. About 10 million years of late Neogene and Quaternary 71 \nhistory is recorded in the JRIVG (Smellie et al., 2006a, b, 2007, 2008, 2009; Hambrey et al., 2008). 72 \nSedimentary rocks in the JRIVG are dominated by diamictite conglomerate and minor sandstone 73 \n(Smellie et al., 2006a; Hambrey et al., 2008; Nelson et al., 2009). Two sedimentary formations have 74 \nbeen defined, the interglacial marine Cockburn Island Formation (Jonkers, 1998a, b) and the glacial 75 \nHobbs Glacier Formation (Pirrie et al., 1997). Fossils have been recovered from both of these 76 \nformations, and in addition rare asterozoan trace fossils are preserved in marine-deposited volcanic 77 \ntuffs (Williams et al., 2006; Nelson et al., 2008). The JRIVG represents an important and largely 78 \nunexploited archive of late Neogene fossil and geochemical data for reconstructing past climate and 79 \nseasonal regimes at high southern latitude. 80 \n   4 \n \nSeasonality in Pliocene Antarctic bivalves \nThe richest Neogene fossil assemblages in the JRIVG are those of the interglacial marine 81 \nCockburn Island Formation, which contains abundant large molluscs, especially Austrochlamys 82 \n(‘Zygochlamys’ of Jonkers et al., 2002; see Jonkers, 2003 for a detailed taxonomic appraisal). The 83 \nglacimarine deposits of the Hobbs Glacier Formation contain similar macrofossil assemblages, are 84 \ndominated by molluscs (including Austrochlamys), but also contain older material reworked from 85 \nthe Cretaceous (Smellie et al., 2006a). Collectively these fossils occur in strata of Late Miocene (ca 86 \n6 Ma) through to Pleistocene age (ca 2 Ma). Detailed analysis of the JRIVG has identified three 87 \nintervals of relative warmth in the northern Peninsula region, when volcanic rocks were erupted into 88 \na marine environment (Smellie et al., 2006a, fig. 6). Radiometric (\n40\nAr\/\n39\nAr) dates from the 89 \nvolcanic rocks, together with \n87\nSr\/\n86\nSr chronology from the molluscs in the intervening glacimarine 90 \nand interglacial marine rocks have produced a well-resolved stratigraphy which constrains the 91 \nwarm intervals to 6.5 to 5.9, 5.03 to 4.22, and ca 0.88 Ma. The Austrochlamys material we study 92 \nhere, from the second of these warm intervals, is dated at 4.66 +0.17\/-0.24 Ma by McArthur et al. 93 \n(2006). 94 \n 95 \n3. Provenance of bivalve material on Cockburn Island 96 \nThe Austrochlamys bivalve material is sourced from three localities on the east side of Cockburn 97 \nIsland referred to in BAS archives as DJ.851, DJ.852 and DJ.853 (Fig. 2). This material was 98 \ncollected by H.A. Jonkers in 1996 though the island had been visited on several occasions dating 99 \nback to 1906 (Jonkers, 1998a). The Cockburn Island Formation forms small outcrops at a number 100 \nof localities on the island and Jonkers recognised a western ‘proximal’ or ‘littoral’ facies and an 101 \neastern ‘distal’ facies. Based on the gradient atop the island he estimated the latter, bivalve-bearing 102 \nfacies to represent original water depths no greater than 100 m. Fossils associated with the bivalves 103 \ninclude echinoids, gastropods, brachiopods, serpulids and rare possible penguin bones. The precise 104 \nstratigraphical relationships of the bivalve material from the three localities documented here is 105 \ndifficult to discern, but they are clearly from the same substratum.  106 \n   5 \n \nSeasonality in Pliocene Antarctic bivalves \n 107 \n4. Austrochlamys as a palaeoenvironmental index of Antarctic shelf waters in the late Neogene 108 \nAustrochlamys is an epibenthic pectinid bivalve genus comprising six species whose distribution is 109 \nrestricted to the Antarctic and sub-Antarctic region, with one extant species known from South 110 \nAmerica (Jonkers, 2003; Quilty et al., 2004). The earliest Austrochlamys occur in Oligocene 111 \ndeposits of King George Island (for a summary of fossil occurrences see Berkman et al., 2004). 112 \nSub-fossil material is also known from as far north as southern New Zealand (Auckland Islands, 113 \nDijkstra and Marshall, 2008). Fossils of Austrochlamys are prolific and widespread in strata of Late 114 \nMiocene through Pliocene age of the Hobbs Glacier and Cockburn Island formations and often are 115 \nvery well preserved (Fig. 3), with specimens articulated even when they occur in glacimarine 116 \ndeposits (Nelson et al., 2009). Jonkers et al. (2002) believed this was a function of minimal 117 \ntransport with the bivalves preserved virtually in situ. Austrochlamys of the Hobbs Glacier and 118 \nCockburn Island formations belong to the species A. anderssoni (see Jonkers, 2003), thought to be a 119 \nbyssally attached epibenthic form (Berkman et al., 2004, p. 1845). Although these bivalves are 120 \nbelieved to have occupied water depths not greater than 100 m (Jonkers, 1998a; Jonkers et al., 121 \n2002), sometimes they occur as transported fragmentary specimens in strata that may have been 122 \ndeposited at greater water depths (Jonkers et al., 2002, p. 586).  123 \nAustrochlamys is a significant indicator of palaeoenvironment for the Antarctic (Berkman et 124 \nal., 2004). Modern Austrochlamys natans occur in the high energy sub-littoral and littoral zones of 125 \nsouthern Chile and Argentina, as far south as Bahia Orange (Dijkstra and Köhler, 2008). Modern 126 \nsea surface temperatures in southernmost South America range between about 5 to 10°C (NOAA 127 \nmonthly global SST plot archive at: http:\/\/www.emc.ncep.noaa.gov\/research\/cmb\/sst_analysis\/). As 128 \nwell as living at shallow depths Austrochlamys is recovered from greater depths, and for example 129 \nthe holotype of A. natans was recovered from 125 m in the Magellan Strait (see Dijkstra and 130 \nMarshall, 2008). Seawater temperatures in southernmost South America (between 52 to 56°S) at 131 \ndepth 125 m range between about 4 to 8°C annually, and at 500 m are between 4 to 6°C (NODC 132 \n   6 \n \nSeasonality in Pliocene Antarctic bivalves \nWorld Ocean Atlas, Monthly Mean one degree sea temperatures at: 133 \nhttp:\/\/apdrc.soest.hawaii.edu\/las\/servlets\/dataset). Berkman et al. (2004) have argued that the 134 \npresence of Austrochlamys in Antarctic fossil assemblages suggests similar conditions to modern 135 \nsouthernmost South America, and in particular, much reduced sea ice extent. Jonkers (1998a) also 136 \nsuggested a sea ice free environment for the Cockburn Island Formation, based on the presence of 137 \nbarnacles in his littoral facies and the absence of ice-rafted debris. Opal depositional rates, which 138 \nare linked to biological productivity, are conspicuously enhanced in the Early Pliocene, between 5.2 139 \nand 3.1 Ma, signifying much-reduced sea ice cover (Hillenbrand and Fütterer, 2002; Pudsey, 2002). 140 \nAlthough microfossil assemblages found in the ODP Leg 178 drift sediments show no evidence of 141 \nsignificantly warmer surface water temperatures than today (Hillenbrand and Fütterer, 2002), Hepp 142 \net al. (2006) have suggested open ocean conditions in the warm Early Pliocene, even during 143 \nglacials. In addition,  diatom evidence from ODP site 1165 (in the Southern Ocean at 64.384°S) 144 \nreported by Whitehead and Bohaty (2003) gives mean annual temperatures at 4°C, and the absence 145 \nof ice-rafted debris in the Cockburn Island Formation (Jonkers, 1998a) also suggests warmer 146 \nconditions than present.  147 \nModern coastal environments of James Ross Island and other Antarctic regions, where 148 \nseasonal sea ice is prevalent, are characterised by the slow-growing, thin-shelled scallop 149 \nAdamussium colbecki (Berkman et al., 2004). This bivalve is thought to have originated in deeper 150 \nwater and to have migrated on to the shelf as conditions cooled during the Late Pliocene. 151 \nAdamussium colbecki lives below sea ice, in conditions that mimic the deep ocean. It effectively 152 \nreplaced Austrochlamys as the dominant scallop, which retreated across the Southern Ocean to 153 \nSouth America (Berkman et al., 2004). Thus, Austrochlamys may provide a proxy of reduced sea 154 \nice conditions and more agitated coastal waters around James Ross and Cockburn islands during the 155 \nPliocene, a hypothesis that we will test in this paper by examining the growth-increment pattern and 156 \ngeochemical signature of fossil shells.  157 \n 158 \n   7 \n \nSeasonality in Pliocene Antarctic bivalves \n5. Methodology: analysis of bivalve material 159 \nOur methodology to understand the growth and habitat of fossil Austrochlamys in the Cockburn 160 \nIsland Formation uses three lines of evidence: oxygen isotopes to determine seasonality and the 161 \napproximate temperature of the water in which the bivalves were living; carbon isotopes to 162 \ndetermine metabolic rates and food supply during growth; and growth increments to assess the 163 \npattern of growth. Relating these different data sources is a means of providing a detailed picture of 164 \nthe environmental setting of Austrochlamys in the late Neogene coastal waters of the Antarctic.  165 \n 166 \n5.1 Geochemical analyses  167 \nOnly well-preserved fossil material has been analysed. Neogene shells of Austrochlamys from the 168 \nAntarctic Peninsula that we interpret as being pristine show no variation in composition that is 169 \ndetectable under Scanning Electron Microscopy (with EDX analysis). With the exception of a few 170 \nspecimens, the shell lamellae have no visible cement overgrowths or recrystallisation. The calcitic 171 \nshell lamellae (confirmed by XRD analysis of 3 shell fragments) are non-luminescent to weakly 172 \nluminescent under cathodoluminescence, indicating no diagenetic cements are present. One 173 \nspecimen has a diagenetic cement overgrowth on the external surface of the valve as bladed calcite 174 \ncrystals, which are strongly luminescent (Fig. 4), and this specimen has been excluded from the 175 \nisotopic analysis. Many shells have a fine layer of carbonate-cemented clay material adhering to the 176 \nouter surface of the shell. Before drilling for geochemical analysis, this extraneous material was 177 \nremoved by gentle scrubbing and immersion of the shell in a bath of 5% HCl followed by washing 178 \nwith de-ionised water. After this treatment the shells looked pristine with the majority of the 179 \nsediment removed and the growth increments clearly showing. The growth increments of 180 \nAustrochlamys are large and easy to drill and it is possible to obtain sufficient material from each, 181 \nwhilst avoiding remaining adherent sediment. Shells representing several years of growth (e.g. 182 \nDJ.851.159, DJ.851.160 and DJ.853.1) were selected for analysis. Some 250 growth increments 183 \nfrom three shells have been sampled for calcite and analysed for stable carbon and oxygen isotopes 184 \n   8 \n \nSeasonality in Pliocene Antarctic bivalves \n(Figs 3, 6). Approximately 30-100 micrograms of carbonate have been used for each isotope 185 \nanalysis using a GV IsoPrime mass spectrometer plus Multiprep device. Isotope values (\n13\nC, \n18\nO) 186 \nare reported as per mil (‰) deviations of the isotopic ratios (13C\/12C, 18O\/16O) calculated to the 187 \nVPDB scale using a within-run laboratory standard calibrated against NBS standards. Analytical 188 \nreproducibility of the standard calcite (KCM) run with these samples was 0.02‰ for 13C and 189 \n0.04‰ for 18O. Values for oxygen isotopes have been converted to sea palaeotemperatures using 190 \nthe equation of O’Neil et al. (1969), T = 16.9 – 4.38(δ18Oc - δ\n18\nOsw) + 0.10(δ\n18\nOc - δ\n18\nOsw)\n2\n. A. 191 \nJohnson et al. (2000) have demonstrated good calibration between actual sea temperatures and 192 \nreconstructed sea temperatures using this equation applied to North Sea modern and sub-fossil 193 \nAequipecten. For comparison we have also calculated palaeotemperatures using a modified form of 194 \nthe Craig (1965) equation given in Leng and Marshall (2004), T = 16-4.14(δ18Oc - δ\n18\nOsw) + 195 \n0.13(δ18Oc - δ\n18\nOsw)\n2\n: typically this makes palaeotemperature estimates warmer by about 0.5 to 196 \n0.8°C (see Table 1).  197 \n 198 \n5.2 Assessing seawater isotopic composition  199 \nImplicit in calculations of palaeotemperature from the δ18O of Austrochlamys calcite is an 200 \nassessment of the isotopic composition of the seawater (δ18Osw) in which the bivalves were living. 201 \nSurface seawater δ18O in the Weddell Sea today is between 0 and –0.5‰ (Schmidt et al., 1999). 202 \nMackensen (2002) gives a mean value of –0.37‰ for Antarctic Surface Water in the southern 203 \nWeddell Sea. Oceanographic conditions in the Weddell Sea have been summarized by Whitehouse 204 \net al. (1996), who showed summer to winter temperature variation between +1.99 and –0.10°C, 205 \nwith salinity greater in winter time (33.87 to 34.05 psu) than in summer (33.81 to 33.86 psu). The 206 \nflux of isotopically light glacial meltwater into the northern Weddell Sea around James Ross Island 207 \nduring the summer months affects the δ18O of surface water. Although there are no detailed studies 208 \nof meltwater flux around James Ross Island, these effects are well constrained for surface water on 209 \nthe western Antarctic Peninsula region in Marguerite Bay at 68˚S (Meredith et al., 2008). The 210 \n   9 \n \nSeasonality in Pliocene Antarctic bivalves \nsetting of Marguerite Bay is different from that of the Weddell Sea in that δ18Osw values in the 211 \nwestern peninsula region are lower for surface waters (between –0.5 to –1‰; see Schmidt et al., 212 \n1999). However, the north end of Marguerite Bay is covered by winter sea ice for several months, 213 \nso that it provides a useful comparison for seasonal fluxes of sea ice and glacial meltwater into the 214 \nmodern James Ross Island area, where sea ice also forms during the winter months. In Marguerite 215 \nBay as much as 5% of the near-surface ocean is glacial meltwater: sea ice-melt accounts for a much 216 \nsmaller percentage (ca 1%). The effects of seasonal sea ice-melt on the δ18Osw are minimal 217 \n(Meredith et al., 2008, p. 314) but those of glacial ice-melt are much more significant as high 218 \nlatitude ice has very low δ18O (Mackensen, 2002; Meredith et al., 2008). In Marguerite Bay surface 219 \nwaters are isotopically lightest during the summer months, with values as low as –0.9‰ (compared 220 \nwith higher values of –0.1‰ for deeper water below 300 m). During winter months the δ18O of 221 \nsurface waters is about –0.5‰, still much lower than deeper waters and indicating that significant 222 \nquantities of meteoric water remain in the upper water column throughout the year.  223 \nOur estimates of palaeotemperature from Austrochlamys have assumed an initial surface 224 \nδ18Osw value of –0.2‰. This is a mean value sourced from a climate model study of the Early 225 \nPliocene (Lunt et al., 2008) and is similar to modern surface conditions in the Weddell Sea 226 \n(Schmidt et al., 1999; Mackensen, 2002). For calculations of δ18Osw from the model see Appendix 227 \n1. There is considerable evidence for the persistence of an Antarctic Peninsula Ice Sheet even 228 \nduring warm phases of the late Neogene (Smellie et al., 2009; J. Johnson et al., 2009; Nelson et al., 229 \n2009), though sea ice cover in this region may have been much more limited (Berkman et al., 230 \n2004). Thus, fluxes of meltwater such as those into Marguerite Bay may have characterized the 231 \nnorthern Weddell Sea region during warm interval summers, and may have kept surface waters 232 \nisotopically light throughout the year, with δ18O values lowest during the summer. For this reason, 233 \nwe have also calculated palaeotemperatures using higher and lower values of δ18Osw (0 to –0.4‰) to 234 \nreflect seasonal (winter-summer) variation (see Table 1).  235 \n 236 \n   10 \n \nSeasonality in Pliocene Antarctic bivalves \n5.3 Growth increment analysis  237 \nAustrochlamys grows by a series of increments that are visible on the shell surface (Fig. 3). These 238 \nincrements result from the advance of the mantle over the ventral margin to effect extension of 239 \nextrapallial fluid and precipitation of calcite to the shell edge. In scallops, as in other bivalves, 240 \nlarge-scale mantle advance and shell-size increase is dependent on the environmental conditions 241 \nwhich facilitate cell division and growth. However, under such conditions, shell extension is fairly 242 \nregularly interrupted for short periods through retraction of the mantle edge, resulting in an 243 \nincremental pattern of shell growth which is clearly marked by commarginal ridges on the external 244 \nsurface (Clark, 1974, 2005). The individual (microgrowth) increments may be over 1 mm in width 245 \nin Austrochlamys (Fig. 5), which is exceptionally large amongst scallops (cf. Clark, 2005; Owen et 246 \nal., 2002b; A. Johnson et al., 2009). Overall periods of growth may be succeeded by sudden and 247 \nsharp reductions in calcite precipitation, and the shell is therefore marked by a distinct band known 248 \nas a ‘growth line’. These lines may represent suspension of growth associated with seasonal 249 \ntemperature extremes, wave action, reproduction (Dame, 1996, p. 58) or disturbance (e.g. Adam, 250 \n1990). In Austrochlamys from the Cockburn Island Formation growth lines are developed on many 251 \nshells with varying degrees of prominence (Fig. 3).  252 \nTo measure growth increments precisely, scaled photographic images of Austrochlamys 253 \nwere imported into the software Panopea (© Peinl and Schöne, 2004). This enables point-to-point 254 \nmeasurements of growth increment widths and reference features, and outputs a precise width of 255 \nthese structures. The factors behind the rate of growth of Austrochlamys cannot be differentiated by 256 \ngrowth increments alone (see Jones and Quitmyer, 1996), but coupled to δ13C and δ18O profiles (see 257 \nA. Johnson et al., 2000, 2009) it is possible to make inferences about control mechanisms such as 258 \nfood supply and water temperature.  259 \n 260 \n6. Results and interpretation 261 \n6.1 Oxygen isotopes and palaeotemperature  262 \n   11 \n \nSeasonality in Pliocene Antarctic bivalves \nThe three shells we have analysed for stable isotopes collectively record about seven summer-263 \nwinter cycles of growth (Fig. 6), with an overall reconstructed temperature range from -1 to +3.5°C 264 \n(using the O’Neil et al., 1969 equation), or slightly higher minimum and lower maximum 265 \ntemperatures if higher winter and lower summer δ18Osw values are used (Table 1). We do not 266 \nsuggest that this represents the entire range of climate for the Cockburn Island Formation, but it 267 \ndoes provide the first quantifiable evidence of sea temperature seasonality for about seven years in 268 \nthis region from the late Neogene. The two shells from locality DJ.851 show similar temperature 269 \nprofiles, while that from locality DJ.853 shows the warmest summer values (Fig. 6, Table 1). These 270 \ntwo bivalve-bearing localities are separated by about 300 m along a north-south transect on the east 271 \nside of the island (Fig. 2) and while the bivalves are from the same substratum, they may represent 272 \nmolluscs living 100s of years apart.  273 \nIsotope analysis of shell DJ.851.159 shows a signal of seasonality in water temperature over 274 \nthree cycles of summer-winter growth (Fig. 6). During this interval (using an annual mean δ18Osw of 275 \n–0.2‰ and the O’Neil et al., 1969 equation), sea temperatures between –1.1 and +2.5°C are 276 \nsuggested. This range of temperature variation (ca 3.6°C) is similar to the present mean intra-annual 277 \nrange in surface waters of the Weddell Sea (see Whitehouse et al., 1996). It is also similar to the 278 \nseasonal temperature variation at the sea surface predicted by an Early Pliocene climate model, 279 \ngiving values of –1.69°C for winter (July) and +3.08°C for summer (February) at depth 0-5 m (Lunt 280 \net al., 2008). At depth (95-113 m) seasonality from the model is just –0.69 to –0.52°C. This 281 \nsupports the notion that the Austrochlamys of the Cockburn Island Formation were living at shallow 282 \ndepth, recording much of (or the entire) surface seasonality, and were well above the maximum 283 \ndepth of 100 m speculated on by Jonkers et al. (1998a, 2002).  284 \nThe use of a single mean annual value for δ18Osw in our calculations shown in Figure 6 may 285 \nbe unjustified (and lead to over- or underestimates of palaeotemperature) in that it assumes no large 286 \nchange in glacial meltwater flux to this region of the northern Weddell Sea between summer and 287 \nwinter. Calculating sea temperatures for shell DJ.851.159 using a winter value of 0‰ for δ18Osw 288 \n   12 \n \nSeasonality in Pliocene Antarctic bivalves \ngives a minimum water temperature of –0.4°C, close to that recorded today. Using a summer value 289 \nof –0.4‰ for δ18Osw gives a maximum temperature of about 2°C (Table 1). This seasonal range in 290 \nδ18Osw is justified by modern data from Marguerite Bay (see Meredith et al., 2008 and above).  291 \nForty analyses from shell DJ.851.160 produce estimated sea temperatures similar to those of 292 \nshell DJ.851.159, with a minimum just below 0°C and a maximum of 1.8°C (for δ18Osw = -0.2‰, 293 \nsee Fig. 6, see also Table 1). In contrast, shell DJ.853.1, which also records about three cycles of 294 \nsummer-winter growth (ca 100 increments drilled), provides sea temperatures between 0.5 and 295 \n3.5°C (for δ18Osw = -0.2‰, Fig. 6). Given that these shells are from two different localities, the 296 \nlatter hints that a very detailed record of changing regional climate may be stored in these fossils. 297 \nModern temperature beneath the sea ice during winter months in the Weddell Sea is close to 298 \n0˚C (Whitehouse et al., 1996; cf. with similar sea temperatures in Marguerite Bay reported by 299 \nMeredith et al., 2008, p. 312), suggesting that our estimates of winter temperature in shells from 300 \nlocality DJ.851 may be too cool for the Early Pliocene. Although the overall degree of seasonal sea 301 \ntemperature change appears similar to present (Table 1), we cannot be sure that our reconstructed 302 \ntemperatures reflect absolute values. However, given a winter temperature of –1.1°C from bivalve 303 \nDJ.851.159, they must represent near minimum values. Recalculating palaeotemperatures using the 304 \nmodified form of the ‘Craig (1965)’ equation (see Table 1) gives a slightly elevated minimum 305 \ntemperature of -0.3ºC for shell DJ.851.159, close to the modern minimum values recorded by 306 \nWhitehouse et al. (1996).  307 \nAs well as the problem of assessing initial δ18Osw some bivalves are known to exhibit vital 308 \neffects. Thus, experimental work on Pecten maximus shows deviations of shell δ18O from 309 \nequilibrium of +0.6‰, equivalent to a temperature interpretation 2-3°C colder than actual (Owen et 310 \nal., 2002a). With our available data we cannot assess whether vital effects have influenced the δ18O 311 \nof Austrochlamys calcite, but it is feasible that our minimum and maximum estimates of sea 312 \ntemperature are colder than actual, and that sea temperatures were above zero throughout the year at 313 \nthe time the Cockburn Island Formation was being deposited. This is suggested by sea temperature 314 \n   13 \n \nSeasonality in Pliocene Antarctic bivalves \nvalues from the shell at locality DJ.853 that show a minimum above 0ºC (Fig. 6, Table 1), and by 315 \nour growth increment data (see below).  316 \n 317 \n6.2 Carbon isotopes and planktonic productivity  318 \nThe δ13C signature of bivalves is influenced by the isotopic composition of the dissolved inorganic 319 \ncarbon (DIC) in seawater, its major controls being local phytoplankton productivity (removing \n12\nC), 320 \nlocal respiration (returning \n12\nC) and influxes of isotopically more negative deep ocean water or 321 \nfreshwater (Krantz et al., 1987). Thus, bivalves living close to upwelling zones can exhibit marked 322 \nchanges in δ13C (Jones and Allmon, 1996) whereas those living away from such zones may exhibit 323 \na much smaller degree of variation, less than 1‰ (A. Johnson et al., 2000, 2009). The δ13C may 324 \nalso reflect a kinetic effect. This results in a depletion of both \n18\nO and \n13\nC in carbonates 325 \n(McConnaughey et al., 1997; Owen et al., 2002a). In contrast, metabolic (respiration) effects will be 326 \nreflected in depletions in shell δ13C (McConnaughey and Gillikin, 2008) which are not 327 \naccompanied by simultaneous changes in shell δ18O. Thus, the two mechanisms can be 328 \ndifferentiated in isotopic profiles of bivalves. 329 \nThe carbon isotope signature of A. anderssoni suggests both metabolic and oceanographic 330 \ncontrols, but not kinetic effects. Carbon isotope values are lowest through the first annual cycle of 331 \ntemperature variation recorded in shell DJ.851.159 (ca 1.4‰), perhaps related to high metabolic 332 \nrate in a young specimen. The carbon signature is a little higher through the second cycle of 333 \ntemperature variation recorded in shell DJ.851.159 (ca 1.7‰), and then is variable into the third 334 \ncycle (from ca 1.2 to nearly 2‰). However, the two peaks of highest carbon values (at about 2‰) 335 \ncorrelate with summer temperature maxima determined from analysis of δ18O (Fig. 6), and suggest 336 \na phytoplankton control, influenced by a summer bloom. There are no areas of the shell DJ.851.159 337 \nprofile where oxygen and carbon show depletion in tandem, and we interpret this as being evidence 338 \nof minimal or no kinetic effects. A very similar pattern of highest δ13C (about 2‰) associated with 339 \nsummer temperature is also preserved in shell DJ.851.160 (Fig. 6). Peak highest values of δ13C also 340 \n   14 \n \nSeasonality in Pliocene Antarctic bivalves \ncoincide with warmest estimated sea temperatures in bivalve DJ.853.1. Here though, peak highest 341 \nδ13C values (of 2.4‰) are greater than in the two bivalves from locality DJ.851, suggesting that 342 \nincreased water column productivity might have been influenced by the warmer overall 343 \ntemperatures apparently experienced by bivalve DJ.853.1.  344 \nConceivably, more upwelling of deep ocean water in winter-time could produce the 345 \ncharacteristic low δ13C patterns that correlate with the highest δ18O in the three shells analysed (Fig. 346 \n6). Differences in wind strength between summer (weaker) and winter (stronger) could account for 347 \nthis, but these differences could not have had an effect if the sea was ice-covered in winter. 348 \n 349 \n6.3 Growth increments and the availability of benthic food 350 \nAll of the bivalves measured show patterns in growth involving clusters of broader and narrower 351 \nincrements (Fig. 5). The initial (umbonal) region of each shell bears increments which are too 352 \nnarrow or ill-defined to be measured (Fig. 3). This is typically over the first 2-3 cm of well-353 \npreserved shells. Thus, we have been unable to assess growth patterns for the earliest stages of 354 \ndevelopment in Austrochlamys and it should be noted that the graphs do not represent the same 355 \ngrowth increment interval between bivalves (see Fig. 3 for position of growth measured on each 356 \nshell). For those increments that can be measured, there is a wide range of variation in width both 357 \nwithin and between shells, varying from 0.09 mm (DJ.852.1) to ca 1.7 mm (DJ.851.3). Some 358 \nspecimens clearly have broader growth increments overall: thus, 5 cm of shell growth can be 359 \nachieved over 60 (e.g. DJ.851.3), 76 (DJ.851.80) or 93 increments (DJ.851.159). The number of 360 \nincrements between a peak and a trough in the growth of Austrochlamys varies from about 3 to 14, 361 \nwith no discernible increase in frequency from younger to older specimens (Fig. 5). 362 \nNotwithstanding the growth lines that represent probable growth breaks, analysis of growth 363 \ncumulatively suggests that while Austrochlamys is growing, growth rate remains similar, with no 364 \nsignificant reduction during colder periods (see Fig. 6). 365 \n   15 \n \nSeasonality in Pliocene Antarctic bivalves \nThe annual cycles in environmental variables (e.g. sea temperature and phytoplankton 366 \nproductivity) determined from stable oxygen and carbon isotope analyses correspond to growth 367 \nintervals involving from 24 to 38 increments on shell DJ.851.159, with winter troughs at increments 368 \n19, 57 and beyond 81 (and summer highs at increments 1, 39 and 75 respectively). The winter-369 \nsummer signal from the isotopes is clearly independent of the growth variation exhibited by the 370 \nincrements, which have a much higher frequency of change (Fig. 6) and were likely controlled by 371 \nother factors. In addition, the seasonal temperature signal does not appear to bear any close 372 \nrelationship to the distinctive growth lines of shell DJ.851.159, at least one of which appears to be 373 \nassociated with marginal shell damage (see Figs 3, 6) and therefore perhaps disturbance. Shell 374 \nDJ.851.160, from the same locality as DJ.851.159, confirms this pattern, with growth increment 375 \nvariation of similar degree in both summer and winter, and a growth line in the part of the shell 376 \ndrilled for stable isotopes which is synchronous with rising temperatures, probably towards the end 377 \nof a winter cycle (Fig. 6).  378 \nIn contrast shell DJ.853.1, from the northern-most pectinid-bearing locality on Cockburn 379 \nIsland (Fig. 2) shows a different pattern of growth to those shells from locality DJ.851. In this shell 380 \ntwo growth lines do equate to intervals of temperature lows (Fig. 6), though not to the final low 381 \ntemperature interval (beyond increment 90). From increment 1 to 59 there is no apparent summer-382 \nwinter variation in overall growth rate when the bivalves are growing, with peaks and troughs in 383 \nincrement width occurring with a higher frequency than the peaks and troughs in temperature 384 \nvariation (fig. 6). The first weak growth line appears to come towards the end of a winter cycle, and 385 \nis associated with a temperature low. But this growth break appears to have been of short duration 386 \nas there is a substantial interval of winter prior to this (Fig. 6). It occurs in that part of the shell 387 \nwhere the δ13C signal indicates a rapid increase in water column productivity, and therefore the 388 \ngrowth line probably formed at, or just prior to the beginning of spring-summer. The second growth 389 \nline, beginning at about increment 58, is stronger and corresponds to a temperature low. Here there 390 \nis clear evidence for a slowing of growth (from increment size measurements, Fig. 6), and this part 391 \n   16 \n \nSeasonality in Pliocene Antarctic bivalves \nof the shell is also associated with a rapid change to lower δ13C that may record the onset of winter. 392 \nThe isotope record is missing through about 5 to 6 increments as these were too narrow to drill, and 393 \nso the winter temperature minimum has not been determined. The increments immediately 394 \nfollowing the growth line show rapid temperature rise into summer (Fig. 6). Nevertheless, the 395 \ntemperature low associated with this growth line (and apparent growth cessation) was well above 396 \nzero at the time growth slowed (Fig. 6), and is in line with winter temperature values elsewhere in 397 \nthis shell where growth continued. We therefore suggest that this growth break might be associated 398 \nwith shell disturbance, rather than with growth cessation from low temperature. Shell DJ.853.1 399 \nrecords a second season of summer growth with a maximum estimated temperature of 3.5°C at 400 \nincrement 72, and a final period of presumed winter growth with temperatures about 1.5°C beyond 401 \nincrement 88 (Fig. 6). There is no distinctive growth line associated with the beginning of this last 402 \ninterval of ‘cooler’ temperatures, and increment analysis indicates that growth continued at a 403 \nsimilar pace irrespective of whether temperatures were ‘warm’ or ‘cool’ (Fig. 6). 404 \nConventional wisdom interprets the growth patterns of bivalves in terms of summer to 405 \nwinter variation, but Jones and Quitmyer (1996) have demonstrated convincingly that there may be 406 \na decoupling between growth rate and temperature in bivalves. The growth-increment patterns in 407 \nthe shells analysed for stable isotopes from the Cockburn Island Formation (Figs 3, 6) are closely 408 \ncomparable to those of Holocene Aequipecten from the North Sea (A. Johnson et al., 2009) – that is, 409 \nthere is no seasonal pattern that can be tied with the palaeotemperature profile reconstructed from 410 \nstable oxygen isotope evidence. Neither is there any correspondence to the pattern of planktonic 411 \nproductivity inferred from carbon isotope evidence. In natural populations of the scallop 412 \nAequipecten growth is probably tied with benthic food supply, particularly with the availability of 413 \ndetrital organic material. This increases during periods of water column agitation. Growth in the 414 \ninfaunal bivalve Arctica appears to be under a similar control (Schöne et al., 2003, 2005; Witbaard, 415 \n1996) and the correlation between increment size in Pliocene Flabellipecten steamsi from the Gulf 416 \nof California and tidal patterns in this area (Clark, 2005) is also accountable to re-suspension and 417 \n   17 \n \nSeasonality in Pliocene Antarctic bivalves \nadvection of detrital food by tidal currents. In the Weddell Sea, present winter sea ice-cover 418 \nsuppresses movement in the water column during the winter months. Therefore, if sea ice was 419 \nextensive during the winter months of the Early Pliocene, this would have resulted in reduced 420 \nagitation of the water column, reduced food supply, and a clear seasonality in growth for A. 421 \nanderssoni. Moreover, there should be less short-term variation in winter than in summer (when the 422 \nwater column would be more agitated), but this is not the case. The growth increment data from A. 423 \nanderssoni is consistent with the proposal of Berkman et al. (2004) that there was reduced (or no) 424 \nsea ice in Early Pliocene coastal marine settings occupied by Austrochlamys. The data also imply 425 \nthat Austrochlamys has retreated from the Antarctic as the extent of sea ice grew, probably during 426 \ncooling in the Late Pliocene to Pleistocene. These Antarctic coastal zones today are colonised by 427 \nthe slow-growing Adamussium colbecki, a bivalve that originated in deeper waters that are 428 \nmimicked by living below sea ice (see Berkman et al., 2004). 429 \n 430 \n7. Marine seasonality and environment on the Antarctic Peninsula during the Early Pliocene 431 \nOur data provide a signal of seasonality during warm interglacial phases of Antarctic climate in the 432 \nlate Neogene and allow testing of models of sea ice extent during the Early Pliocene. Growth 433 \nincrement analysis coupled with stable isotope data indicates that sea temperature was not the major 434 \ninfluence on growth for A. anderssoni. Instead, growth appears to have continued throughout much 435 \nof the year (even during the coldest parts of winter as recorded in our shells) with a high frequency 436 \nfluctuation that probably reflects periodic agitation of the water column and enhanced benthic food 437 \nsupply from organic detritus. Such an interpretation differs from the suggestion of Jonkers et al. 438 \n(2002, p. 587) that the occurrence of A. anderssoni in both the Hobbs Glacier (glacial) and 439 \nCockburn Island (glacimarine\/interglacial) formations indicates its wide environmental tolerance, 440 \nand that it should therefore not be used solely as an indicator of interglacial (= present-like 441 \nconditions). Our evidence also suggests that Austrochlamys favoured waters that were sea ice-free, 442 \nand its presence in the Hobbs Glacier Formation may reflect its incorporation into ice toward the 443 \n   18 \n \nSeasonality in Pliocene Antarctic bivalves \nend of an interglacial. Ice-proximal glaciomarine debris flows on James Ross Island incorporated 444 \nwell-preserved bivalves and bryozoans, suggesting that ice expansion occurred under warm 445 \nconditions during the Pliocene, probably towards glacial inception (Nelson et al., 2009). The 446 \npresence of bivalves in close proximity to the palaeo-coastline supports the hypothesis of a lack of 447 \nsea ice, despite the presence of advancing terrestrial-based ice on James Ross Island and the 448 \nAntarctic Peninsula.  449 \nThe range of temperatures recorded by the bivalves is similar to the mean annual sea surface 450 \ntemperature range in this region at present (see Table 1). Using the O’Neil et al. (1969) equation, 451 \nand assuming no vital effects and that our estimates of δ18Osw approximate reality, the shells that we 452 \nhave analysed show minimum and maximum temperatures to have been between about –1.1 and 453 \n+2.5°C for the bivalves of locality DJ.851, and temperatures between 0.5 and 3.5°C for locality 454 \nDJ.853: the temperature range is slightly warmer if we use the modified form of the Craig (1965) 455 \nequation (see Table 1) with values of -0.3 to 2.8ºC for DJ.851 and 1.1 to 3.7ºC for DJ.853. Our 456 \ngrowth increment data, coupled with supporting palaeotemperature information, support: the 457 \ninterpretation of the Cockburn Island Formation as an interglacial marine deposit; the notion of 458 \nreduced sea ice in the Antarctic during the Pliocene (e.g. Whitehead et al., 2005); and the 459 \nhypothesis of Berkman et al. (2004) that Austrochlamys retreated from the Antarctic as sea ice 460 \nexpanded, this transition occurring during climate cooling in the Late Pliocene. Our bivalve data 461 \nquestion climate model predictions of extensive sea ice in the Weddell Sea during the Early 462 \nPliocene.  463 \n 464 \n8. Further work 465 \nOur work has demonstrated the potential value of Austrochlamys for testing hypotheses of 466 \nseasonality and sea ice extent for pre-Quaternary time slices in the Antarctic. As both the Hobbs 467 \nGlacier and Cockburn Island formations bear rich bivalve material over a wider stratigraphical 468 \nrange than we have analysed here, there is great scope for developing a highly resolved proxy for 469 \n   19 \n \nSeasonality in Pliocene Antarctic bivalves \nmarine palaeoseasonality at these latitudes. Together with the largely unstudied cheilostome 470 \nbryozoan faunas in the JRIVG – themselves a group of fossils which are excellent proxies for mean 471 \nannual range of temperature (see Knowles et al., 2009) - a highly resolved record of palaeoclimate 472 \nthrough the Late Miocene and Pliocene of the Antarctic Peninsula region may be obtainable.  473 \n 474 \nAcknowledgments 475 \nThe growth increment analysis of Austrochlamys was undertaken by Daniel Jarram as part of his final year Masters 476 \nproject at the University of Leicester. This work contributes to the British Antarctic Survey's GEACEP Programme 477 \n(ISODYN Project - Ice House Earth: Stability or Dynamism), to the British Geological Survey’s deep time 478 \npalaeoclimate project, and to the SCAR ACE Programme (Antarctic Climate Evolution). We acknowledge support from 479 \nthe NERC Isotope Geosciences Facilities Steering Committee (grant IP\/936\/1106). We thank Captain Bob Tarrant and 480 \nthe officers and crew of HMS Endurance for their assistance during the 2006-2007 field season, Mark Laidlaw for field 481 \nassistance and Paul Brickle (Falkland Island Fisheries) for supplying sub-fossil material of Austrochlamys from the 482 \nFalkland Islands. Alistair Crame (BAS) is thanked for permission to analyse the bivalve material geochemically. Colin 483 \nCunningham and Rob Wilson (Leicester) made thin sections and helped with SEM photomicrography, respectively. The 484 \nlate Tim Brewer ran analyses of shell geochemistry for us and advised on shell preservation. Cheryl Haidon undertook 485 \nthe XRD analysis of shells. We are especially grateful to Hilary Sloane (NIGL) for assistance with the isotope analysis, 486 \nto Arne Ghys (Belgium) for supplying comparative modern Austrochlamys material from Tierra del Fuego, and to 487 \nHarry Dowsett (USGS) and Daniel Lunt (Bristol) for their constructive reviews. BRS acknowledges financial support 488 \nby a DFG (SCHO793\/4). This is Geocycles publication number X. 489 \n 490 \nReferences 491 \nAdam, M.E. 1990. Shell growth in some Nile bivalves. Journal of Molluscan Studies, 56, 301-308. 492 \nBerkman, P.A., Cattaneo-Vietti, R., Chiantore, M., Howard-Williams, C. 2004. Polar emergence 493 \nand the influence of increased sea-ice extent on the Cenozoic biogeography of pectinid molluscs 494 \nin Antarctic coastal areas. Deep Sea Research Part 2, 51, 1839-1855. 495 \nBigg, G. R., Rohling, E.J. 2000. An oxygen isotope data set for marine waters, Journal of 496 \nGeophysical Research, 105, 8527–8535 497 \nClark II, G.R. 1974. Calcification on an unstable substrate: marginal growth in the mollusk Pecen 498 \n   20 \n \nSeasonality in Pliocene Antarctic bivalves \ndiegensis. Science, 183, 968-970. 499 \nClark II, G.R. 2005.  Daily growth lines in some living Pectens (Mollusca: Bivalvia) and some 500 \napplications in a fossil relative: Time and tide will tell. Palaeogeography, Palaeoclimatology, 501 \nPalaeoecology, 228, 26-42. 502 \nCraig, H. 1965. The measurement of oxygen isotope palaeotemperatures. In: Tongiorgi, E. (Ed.), 503 \nStable Isotopes in Oceanographic Studies and Palaeotemperatures. Pisa, Consiglio Nazionale 504 \ndelle Ricerche Laboratorio di Geologia Nucleare, pp. 161–182. 505 \nDame, R.F. 1996. Ecology of marine bivalves: an ecosystem approach. CRC Press: Boca Raton, 506 \nFlorida. 254 pp. 507 \nDijkstra, H.H., Köhler, F. 2008. An annotated catalogue of Recent Pectinoidea (Mollusca, 508 \nPectinidae and Propeamussiidae) type material in the Museum of Natural History, Humboldt 509 \nUniversity, Berlin. Zoosystematics and Evolution, 84, 31-44. 510 \nDijkstra, H.H., Marshall, B.A. 2008. The Recent Pectinoidea of the New Zealand region (Mollusca: 511 \nBivalvia: Propeamussiidae, Pectinidae and Spondylidae). Molluscan Research, 28, 1-88. 512 \nDowsett, H.M. 2007. The PRISM palaeoclimate reconstruction and Pliocene sea-surface 513 \ntemperature. In: Williams, M., Haywood, A.M., Gregory, F.J., Schmidt, D.N. (eds.) Deep-514 \nTime Perspectives on Climate Change: Marrying the Signal from Computer Models and 515 \nBiological Proxies. The Micropalaeontological Society, Special Publications, The Geological 516 \nSociety, London, pp. 459-480. 517 \nEpstein, S., Buchsbaum, R., Lowenstam, H.A., Urey, H.C. 1953. Revised carbonate water isotopic 518 \ntemperature scale. Geological Society of America Bulletin, 64, 1315–1326. 519 \nHambrey, M.J., Smellie, J.L., Nelson, A.E., Johnson, J.S. 2008.  Late Cenozoic glacier-volcano 520 \ninteraction on James Ross Island and adjacent areas, Antarctic Peninsula region. Geological 521 \nSociety of America Bulletin, doi: 10.1130\/B26242.1. 522 \nHaywood, A.M., Valdes, P.J., Peck, V.L. 2007. A permanent El Nino-like state during the 523 \nPliocene?  Paleoceanography, 22 (1), doi:10.1029\/2006PA001323 524 \n   21 \n \nSeasonality in Pliocene Antarctic bivalves \n Haywood, A.M., Valdes, P.J., Hill, D.J., Williams, M. 2007. The mid-Pliocene warm period: A 525 \ntest-bed for integrating data and models. In: Williams, M., Haywood, A.M., Gregory, F.J., 526 \nSchmidt, D.N (eds) Deep time perspectives on climate change: marrying the signal from 527 \ncomputer models and biological proxies. The Micropalaeontological Society, Special 528 \nPublications. The Geological Society, London, 443-457. 529 \nHaywood, A.M., Dowsett, H.J., Valdes, P.J., Lunt, D.J., Francis, J.E., Sellwood, B. 2009. Pliocene 530 \nclimate, processes and problems. Philosophical Transactions of the Royal Society, Series A, 367, 531 \n3-17. 532 \nHepp, D.A., Mörz, T., Grűtzner, J. 2006. Pliocene glacial cyclicity in a deep-sea sediment drift 533 \n(Antarctic Peninsula Pacific Margin). Palaeogeography, Palaeoclimatology, Palaeoecology, 231, 534 \n181-198. 535 \nHillenbrand, C-D., Fütterer, D.K. 2002. Neogene to Quaternary deposition of opal on the 536 \ncontinental rise west of the Antarctic Peninsula, ODP Leg 178, Sites 1095, 1096, and 1101. In: 537 \nBarker, P.F., Camerlenghi, A., Acton, G.D., Ramsay, A.T.S. (eds) Proceedings of the Ocean 538 \nDrilling Programme, Scientific Results, 178. Texas A and M University, College Station, Texas, 539 \n1-40 (CD-ROM). 540 \nJansen, E.. Overpeck, J., Briffa, K.R., Duplessy, J.-C., Joos, F., Masson-Delmotte, V., Olago, D., 541 \nOtto-Bliesner, B., Peltier, W.R., Rahmstorf, S., Ramesh, R., Raynaud, D., Rind, D., Solomina, 542 \nO., Villalba, R., Zhang, D. 2007. Palaeoclimate. In: Climate Change 2007: The Physical 543 \nScience Basis. Contribution of Working Group I to the Fourth Assessment Report of the 544 \nIntergovernmental Panel on Climate Change, Cambridge University Press, Cambridge, United 545 \nKingdom and New York, NY, USA. 546 \nJohnson, A.L.A., Hickson, J.A., Swan, J., Brown, M.R., Heaton, T.H.E., Chenery, S., Balson, P.S. 547 \n2000. The Queen Scallop Aequipecten opercularis: a new source of information on late 548 \nCenozoic marine environments in Europe. In: Harper, E.M., Taylor, J.D., Crame, J.A. (eds) The 549 \n   22 \n \nSeasonality in Pliocene Antarctic bivalves \nEvolutionary Biology of the Bivalvia. pp. 425-439. Geological Society of London, Special 550 \nPublications 177. 551 \nJohnson, A.L.A., Hickson, J.A., Bird, A., Schoene, B.R., Balson, P.S., Heaton, T.H.E., Williams, 552 \nM. 2009. Bivalve sclerochronology and the mid-Pliocene (c. 3.5 Ma) climate of the Southern 553 \nNorth Sea Basin. Palaeogeography, Palaeoclimatology, Palaeoecology, doi: 554 \n10.1016\/j.palaeo.2009.09.022 555 \nJohnson, J.S., Smellie, J.L., Nelson, A.E., Stuart, F.M.  2009. Did the Antarctic Peninsula Ice Sheet 556 \npersist during interglacials? – evidence from cosmogenic dating of Pliocene lavas on James 557 \nRoss Island. Global and Planetary Change, doi:10.1016\/j.gloplacha.2009.09.001 558 \nJones, D.S., Allmon, W.D. 1995. Records of upwelling, seasonality and growth in stable-isotope 559 \nprofiles of Pliocene mollusk shells from Florida. Lethaia, 28, 61-74. 560 \nJones, D.S., Quitmyer, I.R. 1996. Marking time with bivalve shells: oxygen isotopes and season of 561 \nannual increment formation. Palaios, 11, 340-346. 562 \nJonkers, H.A. 1998a. Stratigraphy of Antarctic late Cenozoic pectinid-bearing deposits. Antarctic 563 \nScience, 10, 161-170. 564 \nJonkers, H.A. 1998b. The Cockburn Island Formation; Late Pliocene interglacial sedimentation in 565 \nthe James Ross Basin, northern Antarctic Peninsula. Newsletters on Stratigraphy, 36, 63-76. 566 \nJonkers, H.A. 2003. Late Cenozoic–Recent Pectinidae (Mollusca: Bivalvia) of the Southern Ocean 567 \nand neighbouring regions. Monographs of Marine Mollusca, 5, 125 pp. 568 \nJonkers, H.A., Lirio, J.M., Dell Valle, R.A., Kelley, S.P. 2002. Age and environment of Miocene-569 \nPliocene glaciomarine deposits, James Ross Island, Antarctica. Geological Magazine, 139, 577-570 \n594. 571 \nKnowles, T., Taylor, P.D., Williams, M., Haywood, A.M., Okamura, B. 2009. Pliocene seasonality 572 \nacross the North Atlantic inferred from cheilostome bryozoans. Palaeogeography, 573 \nPalaeoclimatology, Palaeoecology, 277, 226-235 574 \n   23 \n \nSeasonality in Pliocene Antarctic bivalves \nKrantz, D. E., Williams, D. F., Jones, D. S. 1987. Ecological and paleoenvironmental information 575 \nusing stable isotope profiles from living and fossil molluscs. Palaeogeography, 576 \nPalaeoclimatology, Palaeoecology, 58, 249-266. 577 \nLeng, M.J., Marshall, J.D. 2004. Palaeoclimate interpretation of stable isotope data from lake 578 \nsediment archives. Quaternary Science Reviews, 23, 811-831. 579 \nLevitus, S., Boyer, T.P. 1994. World Ocean Atlas 1994, vol. 4, Temperature, NOAA Atlas 580 \nNESDIS, vol. 4, 129 pp., NOAA, Silver Spring, Md. 581 \nLunt, D.J., Valdes, P.J., Haywood, A.M., Rutt, I. 2008. Closure of the Panama Seaway during the 582 \nPliocene – Implications for Climate and Northern Hemisphere Glaciation. Climate Dynamics, 583 \n30, 1-18. (doi:10.1007\/s00382-007-0265-6). 584 \nMcArthur, J.M., Rio, D., Massari, F., Castradori, D., Bailey, T.R., Thirlwall, M., Houghton, S. 585 \n2006. A revised Pliocene record for marine- \n87\nSr\/\n86\nSr used to date an interglacial event recorded 586 \nin the Cockburn Island Formation, Antarctic Peninsula. Palaeogeography, Palaeoclimatology, 587 \nPalaeoecology, 242, 126-136. 588 \nMcConnaughey, T.A., Gillikin, D.P. 2008. Carbon isotopes in mollusk shell carbonates. Geo-589 \nMarine Letters, doi:10.1007\/s00367-008-0116-4. 590 \nMcConnaughey, T.A., Burdett, J., Whelan, J.F., Paull, C.K. 1997. Carbon isotopes in biological 591 \ncarbonates: Respiration and photosynthesis. Geochimica et Cosmochimica Acta, 61, 611-622. 592 \nMeredith, M.P., Brandon, M.A., Wallace, M.I., Clarke, A., Leng, M.J., Renfrew, I.A., van Lipzig, 593 \nN.P.M., King, J.C. 2008. Variability in freshwater balance of northern Marguerite Bay, 594 \nAntarctic Peninsula: results from δ18O. Deep Sea Research Part 2, 55, 309-322. 595 \nNelson, A., Smellie, J., Williams, M., Zalasiewicz, J.A. 2008. Late Miocene marine trace fossils 596 \nfrom James Ross Island. Antarctic Science, 20, 591-592. 597 \nNelson, A.E., Smellie, J., Hambrey, M., Williams, M., Vautravers, M., McArthur, J., Regelous, M. 598 \n2009. Neogene glacigenic debris flows on James Ross Island, northern Antarctic Peninsula, and 599 \n   24 \n \nSeasonality in Pliocene Antarctic bivalves \ntheir implications for regional climate history. Quaternary Science Reviews, 600 \ndoi:10.1016\/j.quascirev.2009.08.016 601 \nO'Neil, J.R., Clayton, R.N., Mayeda, T.K. 1969. Oxygen isotope fractionation in divalent metal 602 \ncarbonates. Journal of Chemical Physics, 51, 5547-58 603 \nOwen, R., Kennedy, H., Richardson, C. 2002a. Experimental investigation into partitioning of 604 \nstable isotopes between scallop (Pecten maximus) shell calcite and sea water. Palaeogeography, 605 \nPalaeoclimatology, Palaeoecology, 185, 163-174.  606 \nOwen, R., Richardson, C., Kennedy, H. 2002b. The influence of shell growth rate on striae 607 \ndeposition in the scallop Pecten maximus. Journal of the Marine Biological Association of the 608 \nUnited Kingdom, 82, 621-623. 609 \nPirrie, D., Crame, J.A., Riding, J.B., Butcher, A.R., Taylor, P.D. 1997. Miocene glaciomarine 610 \nsedimentation in the northern Antarctic Peninsula region: the stratigraphy and sedimentology of 611 \nthe Hobbs Glacier Formation, James Ross Island. Geological Magazine, 134, 745-762. doi: 612 \n10.1017\/S0016756897007796. 613 \nPudsey, C.J. 2002. Neogene record of Antarctic Peninsula glaciation in continental rise sediments: 614 \nODP Leg 178, Site 1095. In: Barker, P.F., Camerlenghi, A., Acton, G.D., Ramsay, A.T.S. (eds) 615 \nProceedings of the Ocean Drilling Programme, Scientific Results, 178. Texas A and M 616 \nUniversity, College Station, Texas, 1-40 (CD-ROM). 617 \nQuilty, P.G., Murray-Wallace, C.V., Whitehead, J.M. 2004. Austrochlamys heardensis (Fleming, 618 \n1957) (Bivalvia: Pectinidae) from Central Kerguelen Plateau, Indian Ocean: palaeontology and 619 \npossible tectonic significance. Antarctic Science, 16, 329-338.  620 \nRohling, E. J. 2000. Paleosalinity: Confidence limits and future applications, Marine Geology, 163, 621 \n1–11. 622 \nRohling, E. J., Bigg, G.R. 1998. Paleo-salinity and δ18O: a critical assessment, Journal of 623 \nGeophysical Research, 103, 1307–1318 624 \n   25 \n \nSeasonality in Pliocene Antarctic bivalves \nSchöne, B.R., Oschmann, W., Rössler, J., Freyre Castro, A.D., Houk,\n \nS.D., Kröncke, I,  Dreyer, W., 625 \nJanssen, R., Rumohr, H., Dunca, E. 2003. North Atlantic Oscillation dynamics recorded in 626 \nshells of a long-lived bivalve mollusk. Geology, 31, 1037-40. 627 \nSchöne, B.R., Fiebig, J., Pfeiffer, M., Gless, R., Hickson, J., Johnson, A.L.A., Dreyer, W., 628 \nOschmann, W. 2005. Climate records from a bivalved Methuselah (Arctica islandica, Mollusca; 629 \nIceland). Palaeogeography, Palaeoclimatology, Palaeoecology, 228, 130-148. 630 \nSchmidt, G. A. 1998. Oxygen-18 variations in a global ocean model, Geophysical Research Letters, 631 \n25, 1201–1204. 632 \nSchmidt, G.A. 1999. Forward modelling of carbonate proxy data from planktonic foraminifera 633 \nusing oxygen isotope tracers in a global ocean model, Paleoceanography, 14, 482–497. 634 \nSchmidt, G.A., Bigg, G.R., Rohling, E.J. 1999. \"Global Seawater Oxygen-18 Database\". 635 \nhttp:\/\/data.giss.nasa.gov\/o18data\/  636 \nSmellie, J.L., McArthur, J.M., McIntosh, W.C., Esser, R. 2006a. Late Neogene interglacial events 637 \nin the James Ross Island region, northern Antarctic Peninsula, dated by Ar\/Ar and Sr-isotope 638 \nstratigraphy. Palaeogeography, Palaeoclimatology, Palaeoecology, 242, 169-187. 639 \nSmellie, J.L., Nelson, A.E., Williams, M. 2006b. Fire and ice: unravelling the climatic and volcanic 640 \nhistory of James Ross Island, Antarctic Peninsula. Geology Today, 22, 220-226.  641 \nSmellie, J.L., Johnson, J.S., McIntosh, W.C., Esser, R., Gudmundsson, M.G., Hambrey, M.J., de 642 \nVries, B. Van Wyk. 2008. Six million years of glacial history recorded in the James Ross Island 643 \nVolcanic Group, Antarctic Peninsula. Palaeogeography, Palaeoclimatology, Palaeoecology, 260, 644 \n122-148.  645 \nSmellie, J.L., Haywood, A.M., Hillenbrand, C-D., Lunt, D.L., Valdes, P.J. 2009. Nature of the 646 \nAntarctic Peninsula Ice Sheet during the Pliocene: geological evidence and modelling results 647 \ncompared. Earth-Science Reviews, 94, 79-94. 648 \nWhitehouse, M.J., Priddle, J., Symon, C. 1996. Seasonal and annual change in seawater temperature, 649 \nsalinity, nutrient and chlorophyll a distributions around South Georgia, South Atlantic. Deep Sea 650 \n   26 \n \nSeasonality in Pliocene Antarctic bivalves \nResearch Part 1, 43, 425-443. 651 \nWhitehead, J.M., Bohaty, S.M. 2003. Pliocene summer sea surface temperature reconstruction using 652 \nsilicoflagellates from Southern Ocean ODP Site 1165. Paleoceanography, 18, 1075, 653 \ndoi:1029\/2002PA000829.  654 \nWhitehead, J.M., Wotherspoon, S., Bohaty, S.M. 2005. Minimal Antarctic sea ice during the Pliocene. 655 \nGeology, 33, 137-140. 656 \nWitbaard, R. 1996. Growth variations in Arctica islandica L. (Mollusca): a reflection of hydrography-657 \nrelated food supply. ICES Journal of Marine Science, 53, 981-987 658 \nWilliams, M., Smellie, J., Johnson, J., Blake, D. 2006. Late Miocene Asterozoans (Echinodermata) 659 \nfrom the James Ross Island Volcanic Group. Antarctic Science, 18, 117–122. 660 \nWilliams, M., Haywood, A.M., Harper, E.M., Johnson, A., Knowles, T., Leng, M.J., Lunt, D., 661 \nOkamura, B., Taylor, P., Zalasiewicz, J.A. 2009a. Pliocene climate and seasonality in North 662 \nAtlantic shelf seas. Philosophical Transactions of the Royal Society, London, Series A, 367, 85-663 \n108 (doi:10.1098\/rsta.2008.0224) 664 \nWilliams, M., Nelson, A.E., Smellie, J.L., Leng, M.J., Jarram, D.R., Johnson, A.L.A., Haywood, 665 \nA.M., Peck, V.L., Zalasiewicz, J.A., Bennett, C.E., Schöne, B.R. 2009b. A high fidelity 666 \nmolluscan climate record for the Weddell Sea for a warm interval of the Early Pliocene. 667 \nWorkshop on Pliocene climate, Bordeaux, France, October 22\nnd\n to 25\nth\n 2009. Abstract at: 668 \nhttp:\/\/www.plioclimworkshop.com\/ 669 \n 670 \nExplanation of figures and table 671 \n   27 \n \nSeasonality in Pliocene Antarctic bivalves \n 672 \n 673 \nFig. 1. Predictions of absolute sea-ice coverage (%) for maximum (top left) and minimum sea-ice 674 \nmonths (top right) in the Southern Hemisphere for the Early Pliocene (data from Lunt et al., 675 \n2008). The model predicts sea ice coverage in the northern Weddell Sea at 57°W and 64°S as 676 \n0.012% cover for late summer rising to 0.908% for late winter. Also shown are the differences 677 \nbetween Early Pliocene and pre-industrial sea-ice cover as an average for the Southern Hemisphere 678 \nsummer (December, January and February [DJF; bottom left]) and winter seasons (June, July and 679 \nAugust [JJA; bottom right]). Predictions from the Hadley Centre for Climate Research fully 680 \ncoupled ocean-atmosphere General Circulation Model version 3 (HadCM3). 681 \n 682 \n   28 \n \nSeasonality in Pliocene Antarctic bivalves \n 683 \n 684 \nFig. 2. Geographical location of James Ross Island on the northern Antarctic Peninsula (top right) 685 \nand Cockburn Island (see main map to the left). Mollusc material for geochemical and 686 \nmorphological analysis mentioned here is sourced from three localities on the east side of Cockburn 687 \nIsland (map bottom right, localities DJ.851, DJ.852 and DJ.853 of H.A. Jonkers 1996, for which see 688 \nBAS archives). Austrochlamys material is also widespread in the glacigenic sediments of James 689 \nRoss Island, for example at northwest Forster cliffs. 690 \n 691 \n   29 \n \nSeasonality in Pliocene Antarctic bivalves \n 692 \nFig. 3. Morphology of the bivalve Austrochlamys. The images are annotated with open circles 693 \n(labelled ‘A’ or ‘B’) to show points on the shell for cross reference with Figures 4 and 6. The arrow 694 \n   30 \n \nSeasonality in Pliocene Antarctic bivalves \npoints in the direction where increments were measured. Also arrowed are major growth lines on 695 \ntwo of the shells for comparison with the growth\/isotope profiles shown in Figure 6. a, right valve, 696 \nBritish Antarctic Survey (BAS) DJ.851.8. b, e, right valve, DJ.851.1. c, unnumbered specimen in 697 \nBAS collection. d, right valve, DJ.853.1. f, left valve, DJ.852.22. g-i, right valve, DJ.851.3. j, right 698 \nvalve, DJ.851.159: bottom right part of image shows damage to the shell possibly as a response to 699 \ndisturbance by a predator. k, right valve, DJ.852.1. All specimens were collected from Cockburn 700 \nIsland by H.A. Jonkers and S.L. White in 1996 (see Fig. 2 for localities) except c, which was 701 \ncollected from surface scree by M. Williams and M. Laidlaw in 2006. Scale bars are 2 cm. 702 \n 703 \n 704 \nFig. 4. SEM images of polished thin sections of two specimens of Pliocene Austrochlamys from the 705 \nAntarctic Peninsula (a, b). Both images show the well preserved foliated structure of the bivalve 706 \nshell, but with a thin layer of sediment adhering to the outer surface that was removed prior to 707 \ngeochemical analysis. A specimen with an external diagenetic overgrowth cement of calcite 708 \ncrystals, from the same locality is shown in (c) SEM image, and (d) cathodoluminescence image. 709 \n   31 \n \nSeasonality in Pliocene Antarctic bivalves \nThe diagenetic cement is brightly luminescent, while the shell foliae are weakly luminescent. Scale 710 \nbars are 0.25 mm. 711 \n 712 \n 713 \nFig. 5. Growth increment analysis of bivalves from the Cockburn Island Formation. Graphs a-f 714 \n   32 \n \nSeasonality in Pliocene Antarctic bivalves \nshow growth increments plotted for areas of bivalve shells shown in Figure 3 (‘A’ denotes points on 715 \nthe shell for cross-reference). Graphs g1 and g2 show repeat measurements for one shell (Fig. 3c) 716 \ndemonstrating the accuracy of measurements that can be achieved with Panopea. Vertical scale is 717 \nµm, horizontal scale is growth increment measured from oldest (1) to youngest. In addition to the 718 \nshells plotted here, over 200 increments measured for shell DJ.851.1 show a similar pattern of high-719 \nfrequency growth variation. 720 \n 721 \n722 \nFig. 6. Seasonality recorded in the bivalves DJ.851.159, DJ.851.160 and DJ.853.1 from the 723 \nCockburn Island Formation. The figure plots δ13C (yellow) and δ18O (blue) as per mil variation (left 724 \nhand vertical scale). Also shown is temperature (red, left hand scale in °C) reconstructed using a 725 \nδ18Osw value of –0.2‰ and the O’Neil et al. (1969) equation [T = 16.9 – 4.38(δ\n18\nOc - δ\n18\nOsw) + 726 \n0.10(δ18Oc - δ\n18\nOsw)\n2\n]; thick red line is the 3-point running average of the temperature 727 \nreconstruction. The horizontal scale records growth increment number (oldest to left). For all 728 \nbivalves incremental growth (3-point running average, green, see left hand scale mm variation) is 729 \nalso plotted as is cumulative growth (black line, scale not shown) in bivalve DJ.851.159. ‘A’ and 730 \n‘B’ denote a point on the shell for cross-reference with Figure 3. Also marked are growth lines, with 731 \nannotation where these may relate to damage (disturbance) on shell DJ.851.159. Precise matching 732 \nof growth increment measurements with increments drilled for isotopes is not possible, but in most 733 \n   33 \n \nSeasonality in Pliocene Antarctic bivalves \ncases we have achieved a match in the data of ± 2 to 3 increments. In shell DJ.853.1 the match 734 \nbetween incremental growth and stable isotope values is less precise beyond increment 62 (as 735 \nindicated by the change to light green colour for the increments). 736 \n 737 \n 738 \nTable 1. Reconstructed sea temperatures from the Cockburn Island Formation bivalves compared 739 \nwith modern and modelled Early Pliocene sea temperature seasonality in the northern Weddell Sea. 740 \nModern temperature variation is from Whitehouse et al. (1996), modelled Early Pliocene data is 741 \nfrom Lunt et al. (2008). Both temperature maxima and minima and total temperature range are 742 \nshown. Temperature calculations for ‘Craig (1965)’ use the form of this equation given in Leng and 743 \nMarshall (2004) [T=16-4.14(δ18Oc - δ\n18\nOsw) + 0.13(δ\n18\nOc - δ\n18\nOsw)\n2\n] and a  δ18Osw value of -0.2‰. 744 \n 745 \nAppendix 1. Model calculated values for the δ18O of seawater are an attempt to capture 746 \nlongitudinal and latitudinal change as a function of climate, and are based on precipitation minus 747 \nevaporation (P − E) estimates derived from the GCM. Present-day observed δ18Osw [Bigg and 748 \nRohling, 2000; Schmidt, 1998, 1999; G. A. Schmidt et al., 1999, Global seawater oxygen-18 749 \ndatabase, available at http:\/\/data.giss.nasa.gov\/o18data\/] is calibrated against observed P − E 750 \n(ECMWF reanalysis data) for the Atlantic Ocean. The resulting formulae (see below) are used to 751 \npredict δ18Osw. 752 \n 753 \nAtlantic Calibration: 754 \n 755 \nδ18Osw = 0.24 - 0.008 (P - E) r2 = 0.7 756 \n 757 \n   34 \n \nSeasonality in Pliocene Antarctic bivalves \n P - E is given in units of cm yr−1. 758 \n 759 \nAlthough this is a useful approach, care must be taken when examining the results since they are 760 \nbased solely on the model’s predictions of P − E, where in reality the δ18Osw is also dependent upon 761 \nmixing because of ocean currents, runoff, etc. The resulting correlation for the Atlantic Ocean 762 \nδ18Osw to P − E is reasonable. In addition to P − E we calibrated δ\n18\nOsw against salinity [Levitus and 763 \nBoyer, 1994]. This increased the r2 value to 0.9 for the Atlantic but Haywood et al. (2007) 764 \ndemonstrated that this did not significantly change the diagnostic predictions of δ18Osw generated 765 \nusing P – E for the Pliocene. 766 \nNevertheless, it is important to recognise that the use of a salinity: δ18O or P − E: δ\n18\nO co-767 \nvariation from present-day observations as a diagnostic for the δ18O composition of seawater is 768 \ncomplicated by the fact that temperature gradients are steeper today than they were during the 769 \nMiocene and Pliocene (a reflection of cooler temperatures in polar regions today) which will result 770 \nin different patterns of Rayleigh distillation and hence different δ18O values in the hydrological 771 \ncycle [Rohling and Bigg, 1998; Rohling, 2000]. 772 \n 773 \n                        774 \n"}