{"doi":"10.1117\/12.546889","coreId":"69632","oai":"oai:eprints.lancs.ac.uk:25496","identifiers":["oai:eprints.lancs.ac.uk:25496","10.1117\/12.546889"],"title":"Dynamics importance sampling for the activation problem in nonequilibrium continuous systems and maps","authors":["Beri, S.","Mannella, R.","McClintock, Peter V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004","abstract":"A numerical approach based on dynamic importance sampling (DIMS) is introduced to investigate the activation problem in two-dimensional nonequilibrium systems. DIMS accelerates the simulations and allows the investigation to access noise intensities that were previously forbidden. A shift in the position of the escape path compared to a heteroclinic trajectory calculated in the limit of zero noise intensity is directly observed. A theory to account for such shifts is presented and shown to agree with the simulations for a wide range of noise intensities","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69632.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/25496\/1\/DIMS_spie_finalPostPrint.pdf","pdfHashValue":"fbb8742e829e6594d1a72156fbcb04ea135b8e84","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:25496<\/identifier><datestamp>\n      2018-01-24T05:24:13Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Dynamics importance sampling for the activation problem in nonequilibrium continuous systems and maps<\/dc:title><dc:creator>\n        Beri, S.<\/dc:creator><dc:creator>\n        Mannella, R.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        A numerical approach based on dynamic importance sampling (DIMS) is introduced to investigate the activation problem in two-dimensional nonequilibrium systems. DIMS accelerates the simulations and allows the investigation to access noise intensities that were previously forbidden. A shift in the position of the escape path compared to a heteroclinic trajectory calculated in the limit of zero noise intensity is directly observed. A theory to account for such shifts is presented and shown to agree with the simulations for a wide range of noise intensities.<\/dc:description><dc:date>\n        2004<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/25496\/1\/DIMS_spie_finalPostPrint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1117\/12.546889<\/dc:relation><dc:identifier>\n        Beri, S. and Mannella, R. and McClintock, Peter V. E. (2004) Dynamics importance sampling for the activation problem in nonequilibrium continuous systems and maps. Proceedings of SPIE, 5471. pp. 135-144. ISSN 0277-786X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/25496\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1117\/12.546889","http:\/\/eprints.lancs.ac.uk\/25496\/"],"year":2004,"topics":["QC Physics"],"subject":["Journal Article","NonPeerReviewed"],"fullText":"Dynamics importance sampling for the activation problem in\nnonequilibrium continuous systems and maps\nStefano Beria, Riccardo Mannellab, Peter V. E. McClintocka\naDepartment of Physics, Lancaster University LA1 4YB, Lancaster, United Kingdom;\nbDipartimento di Fisica, Universita` di Pisa Via Buonarroti 2, Pisa, Italy.\nABSTRACT\nA numerical approach based on dynamic importance sampling (DIMS) is introduced to investigate the acti-\nvation problem in two-dimensional nonequilibrium systems. DIMS accelerates the simulations and allows the\ninvestigation to access noise intensities that were previously forbidden. A shift in the position of the escape\npath compared to a heteroclinic trajectory calculated in the limit of zero noise intensity is directly observed. A\ntheory to account for such shifts is presented and shown to agree with the simulations for a wide range of noise\nintensities.\nKeywords: Non Linear Dynamics, Non Equilibrium Systems, Numerical Simulations\n1. INTRODUCTION\nThe study of stochastic processes in nonlinear systems is a very wide and important subject within modern\nphysics as they are one of the main ways to describe the dynamics of a real system subject to a source of “noise”.\nIf the noise intensity is small, the system is expected to spend the majority of its time in the close vicinity of\nsome stable equilibrium point. Nevertheless, very rarely, a large fluctuation may drive the system far from the\nstable state, and eventually settle it in the basin of attraction of a different stable structure. As a result of this\nactivation process, the qualitative dynamics of the system may change dramatically. Consider for example a\nvertical cavity surface emitting laser (VCSEL) operating with two stable linearly polarised modes; the random\nfluctuations due to spontaneous emission in the active medium may induce strong changes in the polarization\nresolved light intensity.1–4 In biological membranes, a current of ions passes through open ionic channels5 as\nthe result of an activation process. Moreover, activation processes lie at the heart of many other physical\nphenomena in nonequilibrium systems, such as stochastic resonance,6 directed diffusion in stochastic ratchets.7–9\nThe Kramers activation process lies within this class of problems.10–12 Despite its importance, the problem of\nactivation cannot be regarded as solved. On the theoretical side, important steps toward the solution have been\ntaken in the regime of zero noise intensity. It has been predicted that, even though the activation events become\nexponentially rare when the noise intensity approaches zero, they take place with increasing probability along\nactivation trajectories that are close to an optimal trajectory. Such a most probable escape path (MPEP) can be\nobtained solving an auxiliary Hamiltonian system.13–20 The same picture still applies even for escape at short\ntimes (i.e. before quasi-equilibrium has been established).21 The solution of the escape problem using the MPEP\nis in principle true only for the limit of zero noise intensity. However, for real systems, the intensity of noise\nfluctuations is necessarily finite. More recently it has been established22 that finite noise diffusion does more\nthan just changing the prefactor of the exponential. It causes the system to follow a path that differs from the\nzero-noise theoretical MPEP.\nDuring the last years, in particular due to the availability of fast computers, the activation problem has\nalso been extensively studied numerically, in particular using Monte Carlo simulations. However, even for\nsimple systems, the simulation time grows exponentially with decreasing noise intensity. Consequently, the\nreally interesting range of noise intensities, i.e. small enough for valid comparisons to be made with theoretical\npredictions, have in practice been inaccessible to numerical experiments. Intensive efforts are therefore being\nmade to find ways of speeding up the simulations.23–25 The probability distribution for the system can be built\nFurther author information: send correspondence to Stefano Beri: s.beri@lancaster.ac.uk or to Riccardo Mannella:\nmannella@df.unipi.it\nPublished in Noise in Complex Systems and Stochastic Dynamics II, eds. Z. Gingl, J. M. Sancho, L. \nSchimansky-Geier and J. Kertesz, Proc. of SPIE vol. 5471, Bellingham, 2004, pp 135-144.\nup iteratively23 performing the simulation in regions far away from the equilibrium states. In this way, the shift\nof singularities in the probability distribution, and oscillation of the probability at the boundary due to finite\nnoise intensity, have been observed. These features are consistent with the predicted shift of optimal paths due\nto the finiteness of the noise intensity. However, simulations able to reveal the predicted shift in the optimal\npath with increasing noise intensity are still lacking: to address this question we need numerical approaches\nwhich yield, not the probability distributions, but rather the actual paths followed by the dynamics of the\nsystem of interest. Simulation techniques based on dynamic importance sampling (DIMS) were proposed24 for\n1-dimensional dynamical systems to study dynamics in the limit of very small noise intensity. DIMS aims to\naccelerate Monte Carlo integrations by adding an appropriately chosen biasing field to the equations of motion,\nwhich remain stochastic in nature. Standard techniques are then used to relate Monte Carlo results in the\npresence of the bias to the statistical observables of the original system.\nThe investigation of real systems (such as the lasers mentioned above) requires the analysis of higher dimen-\nsional nonequilibrium systems. However, the extension of DIMS to multidimensional systems is not straightfor-\nward. An earlier biasing technique,25 introduced for both 1 and 2 dimensional systems, was found incapable of\ndetecting either the shift of the escape path22 or saddle point avoidance,26 both of which had been predicted\ntheoretically. Moreover, in the presence of singularities, a bad choice of bias might hide important physical\nfeatures of the system of interest. Note that other numerical approaches, like the umbrella sampling technique27\nare not appropriate for nonequilibrium systems.\nThe aim of this paper is the introduction of a generalized and robust version of DIMS valid, in principle for\nan arbitrary number of dimensions. Such an extended method would allow one to reveal the behaviour of the\nsystem in the vicinity of the MPEP in the finite noise regime. accelerating the simulation by exploitation of\nwell-established zero-noise-limit theoretical results.\nIn order to give some concrete examples of the application of the technique, we apply it to the investigation\nof escape in three different multidimensional nonequilibrium systems: the inverted van der Pol oscillator, the\nharmonically driven overdamped Duffing oscillator and the polarization dynamics of a vertical cavity surface\nemitting laser. The noise intensities considered lie far beyond the range of anything investigated previously. As\nwe will show, the predicted shift of the optimal path due to the finiteness of the noise is clearly resolved and\nturns out to be in excellent agreement with theory22 over more than 4 orders of magnitude in the noise intensity.\nThe extension of the algorithm to stochastic maps is discussed.\n2. THEORY\nAs mentioned in the introduction, stochastic nonlinear systems are used to describe a very large number of\ndifferent physical problems. In order to keep the discussion as general as possible, we consider a generic nonlinear\nsystem under the influence of noise described by the following Langevin equation\nx˙ = f(x) + ξ(t), (1)\n〈ξ(t)〉 = 0 〈ξ(t)ξ(s)〉 = ǫδ(t− s) (2)\nHere x represents a vector of coordinates, f(x) is a nonlinear function, and ξ(t) is a family of zero-mean uncor-\nrelated Gaussian noise processes of intensity ǫ. The drift field f(x) is chosen in order to display multiple stable\nstates (including eventually x→∞) and noise induced transitions between them are considered. For systems in\ndetailed balance (for example if f(x) is the gradient of some potential function), activation takes place according\nto paths that are time-reversed relaxational trajectories.28 In what follows, we consider the case where f(x) does\nnot satisfy the detailed balance condition, and we will focus on the important case of coexisting steady states\nwhose basins of attraction are separated by saddle cycles.\nThe time evolution of the probability density for the system (1) is regulated by the following Fokker-Planck\nequation\n∂̺\n∂t\n= −∂ (f̺)\n∂x\n+\nǫ\n2\n∂2̺\n∂x2\n(3)\nIn the limit ǫ→ 0, (3) can be solved using the WKB expansion.13, 14 The probability distribution is considered\nto have the form\n̺(x, t) = z(x, t) exp\n(\n−S(x, t)\nǫ\n)\n, ǫ→ 0, (4)\nwhere S(x, t) and z(x, t) are two functions. Inserting (4) in (3) and considering different order of expansion in ǫ,\nat leading order ǫ−1 the auxiliary function S turns out to be the solution of the Hamilton-Jacobi equation for a\nclassical action\n∂S\n∂t\n= −H\n(\nx,\n∂S\n∂x\n)\n. (5)\nThe Hamiltonian for the system,\nH(x, p) =\np2\n2\n+ p · f, (6)\nis known as the Wentzell-Freidlin Hamiltonian14 and the Hamiltonian equations for the system are\nx˙ = f(x) + p, p˙ = −p df\ndx\n. (7)\nThe evolution of the function S along the solutions of (7) is calculated starting from dS\ndt\n= ∂S\n∂t\n+ ∂S\n∂x\nx˙. Using ∂S\n∂x\ntogether with Eq.(5) and Eq.(6), the final equation for the action is\ndS\ndt\n=\n1\n2\np2. (8)\nBeing non-decreasing along trajectories and differentiable almost everywhere, the function S can be considered\nas a non-equilibrium potential for the system.29–32 It is known from the theory of dynamical systems that\nS(x, t) can be a multi-valued function of position in the coordinate space.29, 31, 33, 34 In this case, more than one\ntrajectory solution of (5) reaches the same point in coordinate space. In the limit ǫ → 0, only that of least\naction Smin is relevant, and all trajectories corresponding to higher values of S are exponentially disadvantaged.\nEscape takes place along the least action trajectory with overwhelming probability in the limit ǫ → 0. This is\nthe MPEP, and the action calculated along it is the “activation energy”. Regions of coordinate space reached\nby different families of optimal paths are separated by switching lines (SL).18, 19, 35 A trajectory ceases to be\noptimal after crossing a switching line. For this reason, the most probable escape path can touch the SL only\nasymptotically. Because the SL reaches the cycle asymptotically,18 the only possible optimal escape trajectories\nare heteroclinic paths connecting the initial state to the saddle cycle in infinite time.\nTo calculate the effect of finite, but small, ǫ 6= 0 in this picture, a calculation of the next-to-leading order in\nthe WKB expansion is performed. In this order of approximation, the prefactor z(x, t) satisfies.19\ndz\ndt\n= −∂f\ni\n∂xi\nz − 1\n2\n∂2S\n∂xi∂xi\nz (9)\nwhere summation over repeated indexes is understood. The solution of (9) calls for a knowledge of the second\nderivatives of the action calculated along the characteristics. Differentiating twice (5), the following equations\nare obtained19\nd\ndt\n(\n∂2S\n∂xi∂xj\n)\n= − ∂\n2H\n∂xi∂xj\n− ∂\n2S\n∂xi∂xk\n∂2H\n∂pk∂xj\n− ∂\n2S\n∂xj∂xl\n∂2H\n∂xi∂pl\n− ∂\n2S\n∂xj∂xl\n∂2S\n∂xi∂xk\n∂2H\n∂pk∂pl\n(10)\nThe non-constancy of the prefactor along the trajectories can be expressed in terms of a corrected non-equilibrium\npotential (dependent on ǫ)\nSǫ = S − ǫ log(z). (11)\nIt is this corrected potential that has to be used to locate the position of the switching line for finite noise regimes.\nPoints on the modified SL are defined by S1ǫ = S\n2\nǫ where the index 1, 2 refers to two different trajectories reaching\nthe same point in the coordinate space.23 The modified switching line does not touch the cycle asymptotically,\nbut hits it at a definite position which depends on the noise intensity. As a consequence, heteroclinic trajectories\nare no longer optimal and the optimal escape follows a path that differs from the MPEP.\nThe case of a non-linear stochastic map is very similar. Consider a generic map of the form\nxn+1 = f(xn) + ξn, (12)\n〈ξn〉 = 0 〈ξnξm〉 = ǫδnm (13)\nwhere the function f(x) is chosen to display multiple coexisting stable states. As (12) is a discrete system, a\nFokker-Plank equation cannot be written for the probability distribution. Nevertheless, it has been proved36\nthat the MPEP for the map (12) satisfies the extended map\nxn+1 = f(xn) + λn, (14)\nλn+1 =\n[\n∂f\n∂x\n∣∣\nxn+1\n]\n−1T\nλn. (15)\nHere the variable λn plays the role of the momentum p in (7) and the symbol T indicates the transpose matrix.\nThe “action” for the solutions of (14) and (15) can be calculated using the discrete version of (8)\nSn+1 = Sn +\n1\n2\nλ2n (16)\nIn the same way as in continuous systems, the transitions from an initial stable state to a final state take place\nalong the path that minimize (16).\n3. ALGORITHM\nIn this section we propose we propose an extension of DIMS24, 25 to the multidimensional case. It will be used to\nunravel features of the topology close to the optimal escape path in the limit of small but finite noise intensity.\nThe method is applicable to continuous systems or maps characterized by a stable attractor with a sizable basin\nof attraction, where escape takes place via a large fluctuation.\nConsider a generic dynamical system of the form (1); we will focus on the transitions from a stable attractor\nAs toward a final saddle Fs. The process takes place in three steps: in the vicinity of As the dynamics of the\nstochastic system is purely diffusive; then, when the system leaves the vicinity of As (the length scale is defined\nby\n√\nǫ), the escape becomes essentially ballistic, along the MPEP and, in the vicinity of Fs, the finite noise\ndiffusion dominates. In order to take into account the existence of these three regimes, the integration method\nis built as follow: the system is initially set close to As, the exact equations of motion (1) are integrated using\na standard SDE (stochastic differential equation) integrator: for the examples shown below, we used the Heun\nintegrator.37 This reproduce the diffusive regime in the vicinity of As. We also set a boundary at some distance\nfrom the stable attractor: this boundary has nothing to do with the boundary of the basin of attraction, but it\ndelineate where we define the diffusive regimes to change to ballistic. When the boundary is crossed, we switch\nfrom standard SDE integration to DIMS integration. Although the final result does not appear to depend on\nthe boundary choice, nevertheless the boundary ought to be chosen on some rational basis: we require that the\nboundary should be fairly easily reached by the dynamical system when using straight SDE integration, but also\nthat this event should not be too probable. In practice, a reasonable boundary could be e.g. a circle centered\non the stable attractor, with a radius of a few\n√\nǫ. This choice reproduces the diffusive dynamics in the vicinity\nof the stable state. When the system hits the boundary, we switch to the DIMS integrator: from the above\ndiscussion, we know that the SDE\nx˙ = f(x) + ξ(t)\nmaps onto the Hamiltonian equation (7), so we switch to the integration of\nx˙ = f(x) + p(x) + ξ(t) (17)\nΩ \nγ \nx \np \nA \nA* \nFigure 1. The scheme for one step of the DIMS method, where: Ω is a cross section in the extended phase space; γ (thick\nline) is the optimal path predicted by the theory; the thin lines are the stable and unstable eigenspaces (as indicated by\nthe directions of the arrows) of the optimal path. The dashed lines represent respectively the coordinate space x and the\nmomentum space p. A is a point in the coordinate space, A∗ is the corresponding point on the stable manifold of γ as\nrequired by the integration procedure.\nwhere p(x) is the momentum conjugated with x as obtained from the MPEP and ξ(t) is the DIMS stochastic\ncomponent. It is clear that in more than one dimension the probability of being exactly on the MPEP during\neach integration time step is negligible: but the idea is that we should nevertheless use in the integration of\n(17) the value of p(x) which “pulls” the escape tube toward the boundary. This is achieved by linearising the\nHamilton equations near the MPEP, and using the p(x) that keeps the system on the stable manifold of the\nMPEP. A step of the scheme is explained in Fig.1. Consider a point A in the coordinate space. The momentum\np(x) to be used in the equation (17) is calculated in the following way: the point A∗ in the extended phase\nspace which has the same x coordinate as A, and lies on the stable manifold of the MPEP, is located. The\nmomentum of the point A∗ is then used as p(x) in (17). The integration scheme is interrupted and reset if the\ntrajectory leaves a small neighborhood of the MPEP (size of a few\n√\nǫ). The generalization to stochastic maps\nis straightforward: once again it is necessary to define a boundary separating the diffusive region (in the vicinity\nof the initial stable state) and the ballistic region. Inside the diffusive region, Eq.(12) is integrated numerically\nin standard way; when the fluctuations bring the system in the ballistic region, the integration scheme switches\nto DIMS: instead of integrating directly Eq.(12), we integrate\nxn+1 = f(xn) + λn + ξn (18)\nwhere the “momentum” λn is chosen in order to “pull” the path toward the MPEP. If the trajectory leaves a\nneighborhood of the order of\n√\nǫ from the MPEP, it is rejected and the integration is restarted from scratch.\n4. EXAMPLES\nIn this section we show some explicit examples of the application of the multidimensional DIMS algorithm. First,\nwe consider the inverted van der Pol oscillator (IVDP). It is characterized by the presence of an unstable cycle\nwith a stable point at its centre. DIMS is used here to study transitions from the stable state to the limit cycle.\nThe IVDP system is described by the following pair of equations\nx˙ = y\ny˙ = −x− 2η (1− x2) y +√ǫξ(t) (19)\n−3 −1 1 3−3\n−2\n−1\n0\n1\n2\n x\n y\n−3 −1 1 3−3\n−2\n−1\n0\n1\n2\n x\n y\nFigure 2. Comparison between theory and simulations for the escape in the IVDP system (19). Here the parameter\nη = 0.5 and two different noise intensities are considered: ǫ = 10−5 (left figure) and ǫ = 10−2 (right figure). The limit\ncycle and the most probable escape path are indicated by full lines; the crosses are points on the ridge of the prehistory\nprobability density for the escape. The arrows indicate the positions where the theoretical modified optimal escape path\nhits the cycle. The theory agrees well with the experimental points for both noise intensities. A significant shift in the\nposition where the optimal path hits the boundary is evident.\nHere x and y are dynamical variables and ξ(t) is a white Gaussian processes of unit intensity. The parameter\nη determines both the friction and the pumping of energy in the system. The DIMS simulations have been\nperformed for a range of intensities running between 10−5 and 10−2. Some results are shown in figure 2 for two\ndifferent noise intensities. The agreement between the theoretical and experimental escape paths at finite noise\nintensities is seen to be excellent. The shift in the optimal path is continuous with the noise intensity and the\nchange in the point where the MPEP hits the cycle is dramatic.\nIn order to show how the modified DIMS can be applied to non-autonomous stochastic systems we consider,\nas a second example, the harmonically driven overdamped Duffing oscillator\nx˙ = x− x3 +A sin (ωt) +√ǫξ(t). (20)\nHere x is the dynamical coordinate, A and ω are the amplitude and the frequency of the external driving, and\nξ is a white Gaussian process of unit intensity. The driving term A sin (ωt) keeps the system out of equilibrium;\nthe parameters A and ω are chosen to be in the non-perturbative, non-adiabatic regime. The dynamics of this\nsystem is characterized by two stable limit cycles separated by an unstable limit cycle. In the presence of noise,\nthe system can fluctuate from one stable cycle to the other. Some simulation results are shown in Fig. 3. The\nexperimental trajectory follows closely the heteroclinic path when it is far from the stable and unstable cycles.\nAs the system approaches the unstable cycle, however, diffusion becomes important and the escape then runs\nalong the finite noise escape path calculated using finite noise corrections. An increase in the noise intensity\ndetermines an increase in the shift of the hitting position of the experimental MPEP. Once again, the shift in\nthe position is continuous with the noise intensity.\nAs a final example, we consider a noise-induced polarization switch in a VCSEL. If the linear dichroism\nof the active cavity and mirrors is small enough and the pumping is not too strong, the VCSEL emits in the\nfundamental transverse mode3, 4, 38 and the polarization switches between two orthogonally polarized modes. In\nthis regime, the polarization dynamics can be described using the polarization angle φ and the ellipticity χ. The\ndynamical model for these is3\nχ˙ = ωl sin(2φ)− γn sin(2χ) cos(2χ) + γl sin(2χ) cos(2φ) + ξχ(t) (21)\n0 5 10 15\n−1\n−0.5\n0\n0.5\n φ\n x\nFigure 3. Comparison of theory and simulations for the activation problem in the Duffing system (20). The parameters\nare A = 0.1 and ω = 1. The noise intensity is here ǫ = 4× 10−3. The dashed line indicate the steady states and the most\nprobable escape path at ǫ = 0. The solid line indicates the noise corrected optimal path. The crosses are points on the\nridge of the prehistory probability density for the escape. The position where the noise corrected optimal path hits the\nsaddle cycle is indicated by an arrow.\nφ˙ = −ωl sin(2χ)\ncos(2χ)\ncos(2φ) + γl\nsin(2φ)\ncos(2χ)\n− ωn sin(2χ) + ξφ(t) (22)\n〈ξχ(t)〉 = 〈ξφ(t)〉 = 0 ∀t (23)\n〈ξχ(t)ξχ(s)〉 = 〈ξφ(t)ξφ(s)〉 = ǫδ(t− s) 〈ξφ(t)ξχ(s)〉 = 0 ∀t, s (24)\nHere ωl and γl are the dispersive (birefringence) and absorptive (dichroism) linear anisotropies, and γn and\nωn = αγl (α is the linewidth enhancement factor) are the nonlinear anisotropies. The spontaneous emission of\nphotons in the cavity is described by the Gaussian stochastic variables ξχ and ξφ. The dynamical variable χ may\nvary between −π\n4\nand π\n4\nand the angle φ may vary between 0 and π. With a proper choice of the parameters,\ntwo linear polarization modes are stable: the xˆ-polarized mode (corresponding to χ = 0 and φ = 0) and the\nyˆ-polarized mode (corresponding to χ = 0 and φ = π\n2\n). Their basins of attractions are separated by an unstable\nlimit cycle similar to the one in IVDP system.\nThe DIMS scheme has been applied here to investigate the transitions from the yˆ-polarized mode to the limit\ncycle. In figure 4 the numerical simulations are compared with the theoretical MPEP for different values of the\nnoise intensity. As expected, when the noise intensity increases, the simulations follow the MPEP less closely\nand they leave the basin of attraction of the initial lasing mode earlier.\n5. CONCLUSIONS AND DISCUSSION\nIn conclusion, in this paper we have introduced a way to perform numerical simulations in complex nonlinear\nsystems that is efficient and robust. The main idea of the algorithm is to perform the simulation in the vicinity\nof the MPEP which can be calculated solving (7) for a continuous system or (14) and (15) for a stochastic map.\nThe simulated trajectory is kept close to the MPEP taking the momentum so as to stay on the stable manifold.\nThe method can be successfully applied to a large class of dynamical systems and maps. The technique is a very\nuseful tool for the investigation of features induced by finite noise in the neighborhood of the optimal escape\npath; and hence leads to a biasing scheme that is based on the dynamics of the system itself, thus constituting\na most natural scheme for dynamic importance sampling. The application of the method has allowed us to\nexplore regimes of low but finite noise intensity, and enabled us to observe experimentally the predicted shift23 of\nescape path; we stress that this shift is a large physical effect, even at the smallest noise intensities investigated\n−10 −5 0 5 10 15\n−0.8\n−0.4\n0\n0.4\n0.8 (a)\nε = 2E−6\n t\n χ\n−10 −5 0 5 10 15\n−0.8\n−0.4\n0\n0.4\n0.8 (b)\nε = 9E−6\n t\n \nχ\nFigure 4. Comparison between theory and simulations for the polarization switches in a VCSEL. The noise intensity\nchanges from (a) to (b); the dashed lines are the theoretical MPEP and the solid lines are the results of the simulation.\nThe full circle marks the point where half of the trajectories plus one leave the basin of attraction of the initial lasing\nmode. The shift of this point with the noise intensity is evident.\nin this paper. The technique provides a way of extending experimental studies to noise intensities that were\npreviously inaccessible, and promises to accelerate research in many fields of science, e.g. in the investigation of\nthe polarization of flip dynamics in vertical cavity surface emitting lasers or in the motion of ions in the pores\nof cellular membranes. The discrete version of the algorithm may be used as a tool to investigate problems in\nlaser dynamics.39, 40\nACKNOWLEDGMENTS\nWe are grateful for valuable discussions with Dmitri Luchinsky and Stanislav Soskin. The research has been\nsupported in part by the Engineering and Physical Sciences Research Council (UK) and by INTAS.\nREFERENCES\n1. M. B. Willemsen, M. P. van Exter, and J. Woerdman, “Anatomy of a polarization switch of a vertical-cavity\nsemiconductor laser,” Phys. Rev. Lett 84, pp. 43377–4340, 2000.\n2. M. B. Willemsen, M. P. van Exter, and J. P. Woerdman, “Correlated fluctuations in the polarization modes\nof a vertical cavity semiconductor laser,” Phys. Rev. A 60, pp. 4105–4205, 1999.\n3. M. P. van Exter, R. F. M. Hendriks, and J. P. Woerdman, “Physical insight into the polarization dynamics\nof semiconductor vertical-cavity lasers,” Phys. Rev. A 57, pp. 2080–2090, 1998.\n4. M. P. van Exter, M. B. Willemsen, and J. P. Woerdman, “Polarization fluctuations in vertical-cavity semi-\nconductor lasers,” Phys. Rev. A 58, pp. 4191–4205, 1998.\n5. R. S. Eisenberg, M. M. Klosek, and Z. Schuss, “Diffusion as a chemical-reaction - stochastic trajectories\nbetween fixed concentrations,” J. Chem. Phys. 102, pp. 1767–1780, 1995.\n6. M. I. Dykman, D. G. Luchinsky, R. Mannella, P. McClintock, N. D. Stein, and N. G. Stocks, “Stochastic\nresonance in perspective,” Nuovo Cimento D 17, pp. 661–683, 1995.\n7. F. A. F. Julicher and J. Prost, “Modeling molecular motors,” Rev. Mod. Phys. 69, pp. 1269–1281, 1997.\n8. M. O. Magnasco, “Forced thermal ratchets,” Phys. Rev. Lett. 71, pp. 1477–1481, 1993.\n9. M. I. Dykman, H. Rabitz, V. N. Smelyanskiy, and B. E. Vugmeister, “Resonant directed diffusion in nona-\ndiabatically driven systems,” Phys. Rev. Lett. 79, pp. 1178–1181, 1997.\n10. H. Kramers, “Brownian motion in a field of force and the diffusion model of chemical reactions,” Physica\n7, pp. 284–304, 1940.\n11. V. I. Mel’nikov, “The Kramers problem: fifty years of development,” Phys. Rep. 209, pp. 1–71, 1991.\n12. M. I. Dykman, “Large fluctuations and fluctuational transitions in systems driven by colored Gaussian\nnoise–a high frequency noise,” Phys. Rev. A 42, pp. 2020–2029, 1990.\n13. D. Ludwig, “Persistence of dynamical systems under random perturbations,” SIAM Rev. 17, pp. 605–640,\n1975.\n14. M. Freidlin and A. D. Wentzel, Random Perturbations in Dynamical Systems, Springer, New York, 1984.\n15. R. S. Maier and D. L. Stein, “Effect of focusing and caustics on exit phenomena in systems lacking detailed\nbalance,” Phys. Rev. Lett. 71, pp. 1783–1786, 1993.\n16. R. S. Maier and D. L. Stein, “How an anomalous cusp bifurcates in a weak-noise system,” Phys. Rev. Lett.\n85, pp. 1358–1361, 2000.\n17. M. I. Dykman, M. M. Millonas, and V. N. Smelyanskiy, “Observable and hidden features of large fluctuations\nin nonequilibrium systems,” Phys. Lett. A 195, pp. 53–58, 1994.\n18. V. N. Smelyanskiy and M. I. Dykman, “Topological features of large fluctuations to the interior of a limit\ncycle,” Phys. Rev. E 55, p. 2516, 1997.\n19. R. S. Maier and D. L. Stein, “A scaling theory of bifurcations in the symmetrical weak-noise escape problem,”\nJ. Stat. Phys. 83, pp. 291–357, 1996.\n20. J. Lehmann, P. Reimann, and P. Hanggi, “Surmounting oscillating barriers: path-integral approach for weak\nnoise,” Phys. Rev. E 62, pp. 1639–1642, 2000.\n21. S. M. Soskin, V. I. Sheka, T. L. Linnik, and R. Mannella, “Short time scales in the Kramers problem: A\nstepwise growth of the escape flux,” Phys. Rev. Lett. 86, pp. 1665–1669, 2001.\n22. A. Bandrivskyy, S. Beri, and D. G. Luchinsky, “Noise-induced shift of singularities in the pattern of optimal\npaths,” Phys. Lett. A 314, pp. 386–391, 2003.\n23. A. Bandrivskyy, S. Beri, D. G. Luchinsky, R. Mannella, and P. McClintock, “Fast Monte Carlo simulations\nin the probability distributions of nonequilibrium systems,” Phys. Rev. Lett. 90, p. 210201, 2003.\n24. D. M. Zuckermann and T. B. Woolf, “Efficient dynamic importance sampling of rare events in one dimen-\nsion,” Phys. Rev. E 63, p. 016702, 2001.\n25. T. B. Woolf, “Path corrected functionals of stochastic trajectories: towards relative free energy and reaction\ncoordinate calculations,” Chem. Phys. Lett. 289, pp. 433–441, 1998.\n26. D. G. Luchinsky, R. S. Maier, R. Mannella, P. V. E. McClintock, and D. L. Stein, “Observation of saddle-\npoint avoidance in noise-induced escape,” Phys. Rev. Lett. 82, pp. 1806–1809, 1999.\n27. C. Dellago, P. G. Bolhouis, F. S. Csajka, and D. Chandler, “Transition path sampling and the calculation\nof rate constants,” J. Chem. Phys. 108, pp. 1964–1977, 1998.\n28. D. G. Luchinsky and P. V. E. McClintock, “Irreversibility of classical fluctuations studied in analogue\nelectrical circuits,” Nature 389, pp. 463–466, 1997.\n29. R. Graham and T. Tel, “Existence of a potential for dissipative dynamical systems,” Phys. Rev. Lett. 52,\npp. 9–12, 1984.\n30. R. Graham and T. Tel, “Weak noise limit of fokker-planck models and nondifferentiable potentials for\ndissipative dynamical systems,” Phys. Rev. A 31, pp. 1109–1122, 1985.\n31. H. R. Jauslin, “Nondifferentiable potentials for nonequilibrium steady states,” Physica A 144, pp. 179–191,\n1987.\n32. R. Graham, “Macroscopic potentials, bifurcation and noise in dissipative systems,” in Noise in Nonlinear\nDynamical Systems, F. Moss and P. V. E. McClintock, eds., 1, pp. 225–278, Cambridge University Press,\n1989.\n33. V. Arnold, Mathematical Methods of Classical Mechanics, Springer-Verlag, Berlin, 1978.\n34. M. V. Day, “Recent progress on the small parameter exit problem,” Stochastics 20, pp. 121–150, 1987.\n35. M. I. Dykman, P. V. McClintock, V. N. Smelyanskiy, N. D. Stein, and N. G. Stocks, “Optimal paths and the\nprehistory problem for large fluctuations in noise driven systems,” Phys. Rev. Let. 68(18), pp. 2718–2721,\n1992.\n36. P. Grassberger, “Noise induced escape from attractors,” Phys. A 22, pp. 3283–3290, 1989.\n37. R. Mannella, “Integration of stochastic differential equations on a computer,” Int. J. Mod. Phys C 13,\npp. 1177–1194, 2002.\n38. M. P. van Exter, A. Al-Remawi, and J. P. Woerdman, “Polarization fluctuations demonstrate nonlinear\nanisotropy of a vertical-cavity semiconductor laser,” Phys. Rev. Lett. 80, pp. 4875–4878, 1998.\n39. V. A. Gaisyonok, E. V. Grigorieva, and S. A. Kashchenko, “Poincare´ mappings for targeting orbits in\nperiodically driven lasers,” Opt.Commun. 124, pp. 408–417, 1996.\n40. V. Chizhevsky, E. V. Grigorieva, and S. A. Kashchenko, “Optimal timing for targeting periodic orbits in a\nloss-driven CO2 laser,” Opt.Commun. 133, pp. 189–195, 1997.\n"}