{"doi":"10.1080\/17441690903369477","coreId":"219241","oai":"oai:eprints.lse.ac.uk:36053","identifiers":["oai:eprints.lse.ac.uk:36053","10.1080\/17441690903369477"],"title":"Book review: Health promotion: a psycho-social approach - by Christine Stephens","authors":["Campbell, Catherine"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"Stephens, Christine, \"Health promotion: A psycho-social approach,\" (Maidenhead: McGraw Hill\/Open University Press, 2008) ISBN: 978033522208","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/219241.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/36053\/1\/Campbell_Book_Review_Health_promotion_2010.pdf","pdfHashValue":"709709a9aed02fc4325be7c200eebc12b25a5d61","publisher":"Taylor & Francis","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:36053<\/identifier><datestamp>\n      2017-10-09T13:41:22Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5053<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3839<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D504253<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/36053\/<\/dc:relation><dc:title>\n        Book review: Health promotion: a psycho-social approach - by Christine Stephens<\/dc:title><dc:creator>\n        Campbell, Catherine<\/dc:creator><dc:subject>\n        RA Public aspects of medicine<\/dc:subject><dc:description>\n        Stephens, Christine, \"Health promotion: A psycho-social approach,\" (Maidenhead: McGraw Hill\/Open University Press, 2008) ISBN: 9780335222087<\/dc:description><dc:publisher>\n        Taylor & Francis<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/36053\/1\/Campbell_Book_Review_Health_promotion_2010.pdf<\/dc:identifier><dc:identifier>\n          Campbell, Catherine  (2010) Book review: Health promotion: a psycho-social approach - by Christine Stephens.  Global Public Health, 5 (2).  pp. 199-201.  ISSN 1744-1692     <\/dc:identifier><dc:relation>\n        http:\/\/www.tandf.co.uk\/journals\/titles\/17441692.asp<\/dc:relation><dc:relation>\n        10.1080\/17441690903369477<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/36053\/","http:\/\/www.tandf.co.uk\/journals\/titles\/17441692.asp","10.1080\/17441690903369477"],"year":2010,"topics":["RA Public aspects of medicine"],"subject":["Article","NonPeerReviewed"],"fullText":"  \nCatherine Campbell \nBook review: Health promotion: a psycho-\nsocial approach - by Christine Stephens \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nCampbell, Catherine (2010) Book review: Health promotion: a psycho-social approach - by \nChristine Stephens. Global Public Health: an International Journal for Research, Policy and \nPractice, 5 (2). pp. 199-201. ISSN 1744-1692 DOI: 10.1080\/17441690903369477   \n \n© 2010 Routledge \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/36053\/ \nAvailable in LSE Research Online: April 2014 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \nChristine Stephens (2008) \nHealth promotion: a psycho-social approach. \nMaidenhead: McGraw Hill\/ Open University Press. \n239 pgs. \n£22.99.  \nISBN-10: 0335222080; ISBN-13: 978-0335222087  \n \nStephens’ book provides post-graduate students and public health \npractitioners with a wonderful resource. It pulls together insights from public \nhealth psychology and community health psychology, highlighting the social \npsychological dimensions of health inequalities and health promotion. Whilst \nthis is very definitely a textbook and not a polemic, it provides a useful \nsynthesis of some of the existing and generally rather fragmented research \ninto the social psychology of health inequalities – as well as highlighting the \nvalue of a range of social theorists whose work is too often neglected within \nthe field of health promotion. \n \nThe actions of critical health activists have long been motivated by the belief \nthat struggles to improve health in marginalized communities need to be \npursued through a combination of ‘top-down’ and ‘bottom-up’ efforts to \nchange the social conditions which deprive so many people from the \nopportunities to be healthy. With a view to enabling the ‘bottom up’ dimension, \ndecades of projects in both rich and poor countries have sought to work with \nmarginalised communities to develop the skills and capacities to fight for more \nhealth-enabling social environments – social contexts that enable and support \nthe possibility of health.   \n \nMuch of this work has been driven by a series of deeply social psychological \nassumptions about the social psychological dimensions of power, \n‘empowerment’ and social change. However, much of this work has gone \nundocumented and unrecognised in the western academic literature. Health \nand community activists have been too busy or lacked the skills or interest to \nwrite up their work, or didn’t see the relevance of the academic arena to \ngrassroots political struggles. And, albeit with some notable exceptions, few \nacademic psychologists or psychology departments have been noted for their \ncontributions to developing frameworks for understanding and action for \nradical social change. Path-breaking social theorists, such as Paulo Freire, \nwhose work provides deep insights into the social psychological dimensions \nof social change within a broader social justice framework, have more often \nbeen ‘claimed’ by departments of education and communication than \ndepartments of psychology. \n \nAgainst this background’ this book is important and useful insofar as it starts \nto pull together the previously rather dispersed body of work that throws light \nboth on the contribution social psychologists can make to understanding \nsocial inequalities, and on the role of community-level action promoting \nhealth-enhancing social change, particularly amongst marginalised groups. \nStephens’ careful review and integration of work from community psychology \nand critical health promotion, as well as her inclusion of insights from critical \nwriters such as Bourdieu, Habermas and Freire, make this a valuable \nresource for more politically oriented social psychologists and health \npromoters looking for empirical evidence to inform critical research or \nactivism. \n \nThe book has 8 chapters, each of which is structured with exemplary care and \nclarity. Chapters conclude with a useful summary and a wisely chosen, \ncarefully annotated list of suggestions for further reading – both of which \nmake the book an excellent and very student-friendly teaching tool. A core \naim of the book is to highlight the links between theories, research methods \nand intervention designs – links that constitute vital conceptual scaffolding for \nhealth activists and professionals, and which students often battle to grasp. \nStudents are not only invited to be reflexive about their own values and \npractices, but are also provided with conceptual tools to inform such \nreflexivity. \n \nA brief outline of chapters gives some insight into the nature of the book. In \nChapter I Stephens outlines her commitment to shifting the focus of health \npromotion from individual behaviour and lifestyles, to a view of health as the \nsocially structured product of social relations. In Chapter 2 she uses a focus \non health policy in Africa, the United States, England, New Zealand and \nSweden as the starting point for a discussion of the ethical and value-laden \nnature of much health research and action. Chapter 3 presents a careful \nsifting through the often bewildering mass of evidence for inequalities in \nhealth, looking at research and debates on the role of poverty, social status \n(the health gradient), gender, racial and ethnic inequalities in shaping health. \nThis chapter highlights how all theoretical frameworks are value-laden in ways \nthat frame how these factors are conceptualised and understood.  \n \nChapter 4 details the bodies of theory that inform health debates and \ninterventions: neo-positivist, interpretative; indigenous (e.g. Maori \nconceptualisations of health); and social constructionist\/ post-structuralist. A \nthumbnail overview of the methods used in health research is given in \nChapter 5, ranging from more traditional survey and interview methods to \nmore critical participatory action approaches, such as Photovoice and \nNarratives. \n \nChapter 6 provides an account of dominant models of health promotion, \nincluding those framed by ecological, social determinants and cultural \napproaches, as well as looking briefly at the role of the media in health \npromotion. This is followed in Chapter 7 by a series of case studies of socially \noriented community health interventions. These include interventions targeting \nchronic illness in Finland, Canada and the US; AIDS-prevention in South \nAfrica, Cambodia and India; and community capacity building in Canada, \nAustralia and Brazil. Chapter 8 concludes with a thoughtful discussion of the \nchallenges of programme evaluation. \n \nStephens’ work constitutes a valuable contribution to documenting the \ntheoretical, empirical and policy\/intervention frameworks that constitute the \nconceptual and practical toolkit of many community health psychologists. My \nonly criticism of an otherwise excellent book is that she chose to foreground \n‘Health promotion’ in the title, particularly in the light of the individual-focused \nand conservative orientation that continues to dominate the field of health \npromotion, despite a long history of critical challenges from many quarters. \nFurthermore her labelling of her approach as ‘psycho-social’ draws attention \naway from the more radical and political way in which her work could have \nbeen interpreted by activists with a social change focus. The book’s title \nserves to depoliticise Stephens’ material, and in so doing arguably \nundermines its intellectual ‘added value’ to current debates about health and \nsocial change.  \n \nThe title does this through its tacit implication that the types of social and \nstructural problems that Stephens postulates as key drivers of health \ninequalities (social status, gender, ethnicity and so on) can be effectively \nresisted through ‘psycho-social’ projects falling under the rubric of ‘health \npromotion’.  In my view the potential of the book would have been more \nclearly flagged up by a title that associated its material with a radical break \nfrom the tired and conservative ‘health promotion’ approach – with its \nmisplaced focus on the narrowly conceived ‘psycho-social’ as an appropriate \nlevel of analysis and action for tackling social inequalities rooted in political \nand economic injustices. Although the title was probably chosen to maximise \nsales in the mainstream market, it will be a pity if this alienates the more \ncritical and intellectual slice of Stephens’ potential readers, many of whom will \nnot be attracted to a book with such a conservative and mainstream label. \n \nCatherine Campbell, Professor of Social Psychology, London School of \nEconomics. \n \n \n \n \n"}