{"doi":"10.1109\/CROWNCOM.2006.363463","coreId":"102794","oai":"oai:epubs.surrey.ac.uk:2332","identifiers":["oai:epubs.surrey.ac.uk:2332","10.1109\/CROWNCOM.2006.363463"],"title":"Credit token based rental protocol for dynamic channel allocation","authors":["Grandblaise, D","Vivier, G","Moessner, K","Tafazolli, R"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"This paper describes a distributed, cooperative and real time rental protocol for DCA operations in a multi system and mult) cell context for OFDMA systems. A credit token based rental protocol using auctioning Is proposed in support of dynamic spectrum sharing between cells. The proposed scheme can be tuned adaptively as a function of the context by specifying the credit tokens usage in the radio etiquette. The application of the rental protocol is illustrated with an ascending bid auctioning. The paper also describes two approaches for BS-BS communications in support of the rental protocol. Finally, it is described how the proposed mechanisms contribute to the current approaches followed in the IEEE 802.16h and IEEE 802.22 standards efforts addressing cognitive radio, © 2006 IEEE","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2332<\/identifier><datestamp>\n      2017-10-31T14:05:09Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:63637372<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2332\/<\/dc:relation><dc:title>\n        Credit token based rental protocol for dynamic channel allocation<\/dc:title><dc:creator>\n        Grandblaise, D<\/dc:creator><dc:creator>\n        Vivier, G<\/dc:creator><dc:creator>\n        Moessner, K<\/dc:creator><dc:creator>\n        Tafazolli, R<\/dc:creator><dc:description>\n        This paper describes a distributed, cooperative and real time rental protocol for DCA operations in a multi system and mult) cell context for OFDMA systems. A credit token based rental protocol using auctioning Is proposed in support of dynamic spectrum sharing between cells. The proposed scheme can be tuned adaptively as a function of the context by specifying the credit tokens usage in the radio etiquette. The application of the rental protocol is illustrated with an ascending bid auctioning. The paper also describes two approaches for BS-BS communications in support of the rental protocol. Finally, it is described how the proposed mechanisms contribute to the current approaches followed in the IEEE 802.16h and IEEE 802.22 standards efforts addressing cognitive radio, © 2006 IEEE.<\/dc:description><dc:date>\n        2007<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2332\/1\/SRF002324.pdf<\/dc:identifier><dc:identifier>\n          Grandblaise, D, Vivier, G, Moessner, K and Tafazolli, R  (2007) Credit token based rental protocol for dynamic channel allocation   1st International Conference on Cognitive Radio Oriented Wireless Networks and Communications 2006, CROWNCOM.       <\/dc:identifier><dc:relation>\n        http:\/\/ieeexplore.ieee.org\/search\/srchabstract.jsp?tp=&arnumber=4211143&queryText%3DCredit+Tokens+based+rental+Protocol+for+Dynamic+channel+allocation%26openedRefinements%3D*%26searchField%3DSearch+All<\/dc:relation><dc:relation>\n        10.1109\/CROWNCOM.2006.363463<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2332\/","http:\/\/ieeexplore.ieee.org\/search\/srchabstract.jsp?tp=&arnumber=4211143&queryText%3DCredit+Tokens+based+rental+Protocol+for+Dynamic+channel+allocation%26openedRefinements%3D*%26searchField%3DSearch+All","10.1109\/CROWNCOM.2006.363463"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Credit Token based Rental Protocol for\nDynamic hannel Allocation\nD. Grandblaise*, K. Moessnert, G. Vivier* and R. Tafazolli'\nMotorola Labs, Parc Les Algorithmes, Commune de Saint Aubin, 91193 Gif sur Yvette, France, Email:\n_david.grandblaise,guillaume.vivierI motorola.com\ntUniversity of Surrey, GU2 7XH Guilford, United Kingdom,\nEmail: .amoess\n.tafazollij d4surrey.ac.uk\nAbstract - This paper describes a distributed, cooperative and real achieve this is to facilitate \"real time automated negotiation\ntime rental protocol for DCA operations in a multi system and of leased use rights\" [3] for spectrum sharing between\nmulti cell context for OFDMA systems. A credit token based primary and secondary cells in a distributed and real time\nrental protocol using auctioning is proposed in support of fashion. With respect to this, in this paper, we propose the\ndynamic spectrum sharing between cells. The proposed scheme\ncan be tuned adaptively as a function of the context by specifying ngotiationtis ap d wit aratime ren poco\nthe credit tokens usage in the radio etiquette. The application of usping dlstnbuted and dynarmlc auctioning between each\nthe rental protocol is illustrated with an ascending bid auctioning. prima cell and seconda cells participating to DCA. In\nThe paper also describes two approaches for BS-BS such a local multi cell environment market place, the primary\ncommunications in support of the rental protocol. Finally, it is cell acts as the resource offeror, and the secondary cells act\ndescribed how the proposed mechanisms contribute to the current as the resource renters. The primary cell (blue cell in the\napproaches followed in the IEEE 802.16h and IEEE 802.22 middle in Figure 1) opens for renting its resources for a\nstandards efforts addressing cognitive radio. temporally use for the secondary cells belonging to different\noperators (secondary cells are dashed, and each operator has\nKeywords: Dynamic Channel Allocation (DCA), rental two neighbouring cells with the primary cell in this\nprotocol, auctioning, radio etiquette, cognitive radio, policy example).\nI. INTRODUCTION\nSpace time varying spectrum usage [1] motivates for Ofreror primary cell)\ndynamic spectrum sharing between different radio access , Renter (secondary cell)\nsystems operated by different operators. In this manner,\nspectrum can be dynamically and temporally reused for a\nsecondary usage by secondary systems when not used by the\nprimary one. Secondary spectrum usage can be achieved\nwith distributed dynamic channel allocation (DCA) in which\nspectrum is pooled [2] between cells and can be accessed by X<\nany of the systems in a geographical area where cells of the\/ -\ndifferent systems overlap or are neighbours. Spectrum\nsharing with such a DCA in multi system and multi cell\nenvironment can be reached provided frequency reuse cell#operatedbyper#i\ndistances between the primary and secondary cells is j\nappropriately managed to deal with co-channel interference. Figure 1: Primary and secondary cells in DCA\nThe force of distributed DCA is that it uses local information\nabout the current available channels in each cell offering The applicatrion of ining for resources sharing for\nmore suitable conditions to reuse frequency as often as cognitive radios has been initially proposed in the specific\npossible. With this approach, the spectrum availability case of spectrum pooling [4]. This has been further\nknowledge can be performed on peer to peer basis between elaborated in [5 and 6]. However these proposed schemes\nneighbouring or overlapping cells. consider auctioning between several users (cognitive radios\nenabled) competing to resources access and usage within aInethis mult cell and system environment enabllng secondary same cell. These papers do not address spectrum sharing\nspectrum usage With DCA, one main challenge iS to SChedule between cells.\nprimary cell's radio resources (time + frequency) between The present paper extends this by designing a distributed\nseveral secondary cells competing for the access and usage and cooperative rental protocol for DCA operations in a\nof these resources wh1le ensuring access faiess. One way to\n1-4244-0381 -2\/06\/$20.00 ©C2006 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 27,2010 at 13:34:49 UTC from IEEE Xplore.  Restrictions apply. \nThis paper is organised as follows. Section II introduces the any primary cell as a function of the rented time and the\ncredit token based rental protocol and radio etiquette for amount of rented BINs per time unit. The primary cell will\nDCA. Section III describes how this rental protocol can be be able to use these credit tokens at the time it will act as a\nimplemented for an ascending auctioning strategy. Section secondary cell.\nIV discusses two options enabling BS-BS communications in\nsupport of the rental protocol. Section V describes how the Since resources sharing between the primary cell and\nproposed mechanisms contribute to the current approaches secondary cell are agreed for a given period, the proposed\nfollowed in the IEEE 802.16h and IEEE 802.22 standards approach guarantees a minimum access time to the secondary\nefforts. Finally, Section VI concludes the paper. cell, so it is favourable to support QoS.\nB. Credit Token Based Rental Protocol and Radio Etiquette\nII. CREDIT TOKEN BASED RENTAL PROTOCOL\nAND RADIO ETIQUETTE In this paper, we propose (Figure 2) that the radio etiquette\nrules the rental protocol between cells. This radio etiquette\nA. Credit Token Ba sedRentall Protocol Between Cells specifies the policies applied to credit tokens usage during\nThis section describes the main mechanisms of the renting the negotiation transactions.\nprotocol relying on credit token usage. It is assumed that the This approach provides the flexibility to adapt, to tune the\ndifferent secondary cells are owned by different operators auctioning method to be used during the transactions as a\n(Figure 1). It should be noted that depending on the space function of the context. In particular, the choice of the\ntime traffic variations, cell can periodically act as a primary auctioning method [7] can be tuned as a function of the\nor secondary cell. following parameters for example: the number of bidders\nThe resources open for renting depends on the radio access (i.e. the number of secondary cells participating to\ntechnology under consideration. In this paper, we focus on auctioning), the number of BINs offered for renting (i.e. as a\nOFDMA based systems. OFDMA provides the required function of the space time traffic fluctuations), the renting\nflexibility to allocate dynamically in the temporal and time duration A, the auctioning period 6, etc.\nfrequency domain (continuously and fragmentally). With\nrespect to this, let a BIN (one OFDM symbol * subchannel)\nbe the smaller radio resource unit that can be offered for\nrenting by the primary cell. 0 Policies\nLet's assume that the primary cell can advertise to its CReditokensbased\nneighbouring cells that it offers for renting a given amount of Reta Protocol ____\nX BINs for a given period A. This cell proposes a reserved\nprice auction (RPA) for this renrting. RPA is expressed as apnuberauctiof cRedit tokesperenBing. RPAper timex i (s Figure 2 : Radio etiquette ruling the credit token based rentalnum of credit tokens per BIN and per time unit X iS prtoo vi poice\nnormalised to A). Based on this RPA, each secondary cell protocol viapolicies\ncan bid with a given amount of credit tokens per BIN This approach provides the means for an adaptive policy\n(. RPA) for X) BINs (X'< X) and for a period A' < A. The based dynamic resource sharing management. In particular,\nauctioning period is defined as the period during which given the dynamic and real time aspects of the negotiation,\nnegotiation occurs. This period has a time duration 6. It can software agents can be used at each BS (primary and\nbe periodical. secondary) to perform the negotiation during the auctioning\nWe introduce and define the credit token as the quantum period. Agents would supervise and apply the local rules\nunit used for the negotiation transaction (selling, purchase, specified by the radio etiquette. This approach paves the way\nawarding) in any considered auctioning schemes between towards a collaborative, dynamic, distributed and cognitiveawarding)~~ ~~~~~~~~~1inanycosdrdacinn.cee radio resource management between cells.\none primary cell and several secondary cells. Each cell is OFDMAISymbolinitially assigned with a credit token budget. Credit token\nusage and budget limitation enable both to solve contention\nissues on BINs usage between competing secondary cells. v| s\nSince a credit token charging is as a function of the required ...-....-\namount of BINs for a given period A' < A by the secondar\ncell, it provides access faimess for secondary spectrum reuse\nbetween different secondary cells. -L Rurst\nAdditionally, credit tokens usage provides the means to ----------------------------------- --------------------\nive incentive to each prima cell to share totally or Downlink Uplink\npartially their BINs if they are unused or underused. With Figure 3: Example of OFDMA MAC frame structure for the\nrespect to this, a number of credit tokens,can be awarded to radio resources (BINs) rental protocol\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 27,2010 at 13:34:49 UTC from IEEE Xplore.  Restrictions apply. \nIII. CREDIT TOKEN BASED RENTAL In sequence (3), BSN provides information about the\nPROTOCOL EXAMPLE auctioning period 6 (and other policies) to the BSks that have\nThis section illustrates the application of the previous rental expressed the interest to participate to the bidding. 6 TEEd\nprotocol for ascending bid auctioning in the case of an Bidding- Ttart Bidding\nOFDMA frame structure (Figure 3). Primary BSN Secondar BS,\nA. Rental Protocol Cycle (5) (n-i)h bidding restl\nThe overall nregotiation and transactionr process between one ,,-----_-__________--- _\nprimary BS (offeror) anrd several seconrdary BS (renter) can >, 6Epese(Z iprma BS~~~~~~~~~~~~~~~~~~~~~ ~ ~~S (6) FExpres new (nt\/) bid\nbe depicted by the credit token based scheduling cycle 5°.'t,,\n(Figure 4 and Figure 5). For the sake of simplicity, these (7 igclt\nfigures are only depicted for one secondary cell although V\nseveral secondary cells are actually considered. The primary o --------------------\nBS advertises about its auction. Provided this auction\nmethod, the interested secondary BSs can bid during a pre- . _ (8) F biddig _\ndefined period (6) of negotiation specified by the primary a resultslFinalpricing\ncell. During this period, a dynamic and iterative process is (9)Pavmenttransactio\nlaunched to handle the ascending bid auctioning. C ( t\n(10) BIN' granting\nPrimary BSN Secondary hBSk\n(1) Awareness,\nAdvertisement\n,0\nFigure 5: Credit token based scheduling cycle (sequences\n(5) to (10))\nn a (2) E.press interest\nIn sequence (4), each BSk provides the information BID(I)k\nBS CT(1)k, Xk, TStart k, TEnd k} to BSN. BS_CT('),, is the\n(3) InJbrrn about bidding amount of bidded credit tokens per BIN proposed by BSk for\nprocess the first (n = 1) iteration. Xk is the amount of BINs (Xk < X)\n(4) pressF bd for w bid bid BS CT(1)k applies for. [Tstan k, TEnd k] is the\n'a :t m>m time interval for which bid BS CT(1)k applies for. [TStart k,C-'t O _~ , nrT\ne 0 C5 :5 TEnd k] c [Tstart, TEnd].\n-,\nX g t5(5) 1 t bidding results'\nIn sequence (5), BSN performs the following actions\n_- described hereafter. Given the set of intervals {[Tstart k, TEnd\nk]} received from different bidders tid(')k}, BSN partitions\n{ [Tstart, TEOd]} into contiguous time segments {TSm}. Each\nFigure 4: Credit token based scheduling cycle - (sequences TS, corresponds to a time window in which a subset of\n(1) to (5)) intervals of {[TStart k, TEnd k] } overlap. The different bidders\nfidl )k} assigned to a given TSm are identified by {id('),1m}.\nB. Description ojfthe Rental Protocol Sequences id(1)k,m} compete on TSn. Each involved bidder id()k,rn\ncompetes with its respective BID(1)k. Then, for each TSm, the\nThis section describes a possible algorithm related to the BSN calculates the payoff P(1)k = BS_CT(1') * Xk for each\ndifferent sequences of Figure 4 and Figure 5 (case of bidder k, and searches the subset (fid(1)k-m} selected) of {id(1)kmf\nascending bid auctioning). such as sum(Xk) and sum(P(1)k) are maximal. For each TSm,\nBSN informs all {id(')kr,m about pmin (1) rm and pmax, (1) m where\nIn sequence (1), BSN advertises that X BINs are open for pmin, (1) m is the minimal payoff from {idt)k,m}selected and Pmax\nrenting for a period A (from starting time Tstart to ending time (1) m is the maximal payoff from jid(I)k,m} selected during the 1st\nTEnd). BSN proposes a reserve price auction RPA for this iteration. With this approach, each BSk is directly informed\nrenting. RPA is expressed as a number of credit tokens per whether it has been selected or not, and has some\nBIN. information on how far it is froM pmltin (1) m while still having\nIn sequence (2), each BSk informs BSN about its some information on pmax (1) m This approach enables to\nwillingness (or not) to participate to the bidding. If the BSk is keep the privacy of competing id(l)k,m} on TSm.\ninterested, it communicates its idk to BSN.\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 27,2010 at 13:34:49 UTC from IEEE Xplore.  Restrictions apply. \nIn sequence (6), if P(1)k < pmin, (1) m, this means that BS,, has either over the backhaul (i.e. wired based), or over the air\nnot been selected for being granted the resources he has communications between BSs. In both cases, the usage of\nbidded for during the first iteration n = 1. More generally local databases (located at each BS) and regional databases\nspeaking, for n>l, if p(n-1)k < pmin, (n-1) t this means that BSk (set of local databases) can be used to store the updated\nhas not been selected for being granted the resources he has information about resources usage by each BS or regional\nbided for during the (n-l)th iteration. If p(n-1)k < pmin, (n-I) m and area.\nif BSk is still interested to be allocated with the additional B. Over the Backhaul\nresources he initially requested for, it can propose a new\nBS CT(n)k for the nth iteration. Then, BSk computes the new In that case (Figure 6), the communications for the different\np(n) = BS CT(n)k * Xk where Xk is fixed z n on TSm. If P(n)k > phases (advertisement, bidding, etc) of the cycle between the\nP(n-1)1 and p(n)k > pmin, (n-1) m, BS, expresses its interest to keep primary and secondary BSs are carried out by the backhaul\non participating in the bidding with the new bid. In that case, with IP based communications with the usage of a\nit informs BSN with its new (update) value of BS_CT(')k In transaction server. The server acts as the gateway between\ncase P(n)k = p(n-I)k or P(n)k < pmin, (n-1) m, BSk leaves the bidding primary and secondary BSs. This approach is appropriate for\nphase and will not be granted with the additional resources resource sharing negotiation which is not too sensitive to the\nhe asked for. delay (due to the latency introduced by the network).\nIn sequence (7), BSN updates {lid(-1)k,m} into {lid(n)k,m}. _\nBased on the new received biddings {BS-CT kJ for each Primary\n_nInelLoa oaTSMn, BSN calculates the new payoff p(n)k = BS CTt )k * Xk Cella Data cbase\nfor each bidder k who still participates to the bidding. Then, --------- I\nfor each TSm, BSN searches the subset ({id( )km}selected) of ' Databasl\n{id )k n} such as sum(Xk) and sum(P( )k) are maximal. Next, Backhaul based IP sereuse\nBSN performs the same actions as in sequence (5): for each Communication TrasactiosTSm, BSN informs all tidk)km} about pmin, (n) and pmax, (n) m e Transactions(bids,\nwhere pmin (n) m is the minimal payoff from {id(n)k,m} selected and\np a (n)misthemaximalpayoff from {id )k,m}selected during .............................................\nthe nth iteration. As long as 6 > 0 (i.e. the auctioning period\nhas not yet elapsed), n is increased and the mechanisms of Db DatX Daacbase\nthe nth iteration of the credit tokens based Secondary\nanctioninglbidding phase\" keep on being applied. Cohl\nIn sequence (8), when 6 = 0, bidding phase is over. None Figure 6: Signalling over the backbaul\nBSk can propose a new bid. lid(n final)k,m} selected is derived. At C. Over the Air\nthis point, BSN derives the clearing price auction BS CPAk\n(expressed as a number of credit tokens per BIN) for eacI\nTSm and each k from mid(n }inal)1}. For each k and m, different phases (advertisement, bidding, etc) of the cycle\nBS_CPAk can corrispod~ ftn)the BS or canfollowlbetween the primary and secondary BSs are carried out with\nanother pce actiondm tod. - over the air signalling in a distributed fashion. This means\neach BS can broadcast, multicast and communicate in peer to\nIn sequence (9), eack BSk is requested to pay Prk - peer with its surrounding BSs depending on its state (primary\nBS_CPAk * Xk to be allowed to use the resources it won on or secondary) and the phase under consideration. By directly\nits corresponding TSrn. Provided that Prk does not exceed the considering in built self healing functions and negotiation at\ncits tokresponsdbudgeTS ProfB thetcreditokensotr nsce ti the MAC layer, this approach is closer of a cognitive radiobeditweokens andgeah BSki perfred. t based solution (can integrate jointly sensing, allocation,\nnegotiation functions). Additionally, it is less delay sensitive\nIn sequence (10), BSN grants the resource (Xk BINs) to for real time transactions.\neach BSk who has successfully performed the credit tokens This over the air signalling can be physical or logical\ntransaction operation in sequence (9), based. In case of physical based signalling, the\nIV. INTER CELL COMMUNICATIONS communications is a RF link between the BSs. In case of\nThis section discusses two options enabling BS-BS logical based signalling, the over the air communications\noomuniatinsnsppotothretalptions cobetween BSs is established by the usage of a bridge (e.g. a\nterminal) that provides the RF links between BSs. 18]\nA. Possible Approaches discusses how the credit token based rental protocol can be\nThe implementation of theren.al protocol cycle can be implemented with over the air physical signalling at theTha entatri n ofhrenalprtooice canalben MAC layer.\nenabled with the introduction oft the appropriate si1gnalling\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 27,2010 at 13:34:49 UTC from IEEE Xplore.  Restrictions apply. \ncells. Different auctioning methods using the credit tokens\ncan be designed as a function of the spectrum sharing context\nCell ~~~~~~~~~~~~~~viathe radio etiquette specifying policies. An illustration of\nthe application of this rental protocol has been provided, andLocalg Wcal '. Lo Local Local LocalTrasto rSerasactv8atabaseTrarstorDataitsrelevance to IEEE 802.16h and IEEE 802.22 standards\nhas been pointed out. The proposed mechanisms pave the1*+. * >\n~~~~~secondary reuse\nOver the Air portunities(X, A,6, way towards a collaborative, distributed and cognitive radioCommunication cognitivectins(bdsresource management between cells. The protocol can be\napplied to licensed or unlicensed systems.\nACKNOWLEDGEMENTS\necondary This work has been performed in the framework of the\nLocal Local Local Local Local Local EU funded project (E R II). The authors would like to\nTransactionl Database Tranisactionl Database Transaction Database 2\nServer Server Server acknowledge the contributions of their colleagues from E R\nII consortium.\nFigure 7: Over the air signalling between BS\nREFERENCES\nV. RENTAL PROTOCOL IN IEEE COGNITIVE\nRADIO STANDARDS [1] New York City Spectrum Occupancy Measurements September 2004,\nDecember 15, 2004, Shared Spectrum Companiy.\nThe implementation of preliminary cognitive radio features [2] D. Grandblaise et al, \"Extended DCA Paradigm for Distributed\nin the design of a wireless air interface standard has started. Licensed Open Spectrum Coordination\", PIMRC 2005, 11-14 Sept,\nIndeed, in the end of 2004, IEEE 802 has launched Berlin, Germany.\nrespectively the Project IEEE 802.16h L9] and IEEE 802.22 [3] ET Docket No. 03-108, Notice of Proposed Rule Making And Order,\n[10]-[l 1]. Purpose of 802.16h Project is to specify improved FCC, December 2003.\nMAC mechanisms in order: (i) to enable the co-existence [4] Mitola, J., III; \"Cognitive radio for flexible mobile multimedia\namong licensed exempt systems based on IEEE 802.16 communications\", Mobile Multimedia Communications, 1999.\nstandard, and (ii) to facilitate the co-existence of such (MoMuC '99), 15-17 Nov. 1999, pp.3 - 10.\nsystems with primary users. This amendment is applicable [5] F.K. Jondral, C. Kloeck, H. Jaekel, \"Auction Sequence as a New\nfor un-coordinated frequency operation in all bands in which Resource Allocation Mechanism,\" IEEE VTC Fall 05, 2005.\n802.16-2004 is applicable, including bands allowing shared [6] C. Kloeck, H. Jaekel, F.K. Jondral, \"Dynamic and local combined\nservices. Purpose of 802.22 is to allow the use of licensed pricing, allocation and billing system with cognitive radios, IEEE\nexempt devices in the spectrum that is currently allocated in DySPAN 2005 Symposium, 8-11 Nov. 2005.\nthe television service. 802.22 targets to define both the PHY [7] V. Krishna; \"Auction Theory\", Academic Press 2002.\nand MAC contrary to 802.16h which can only modify the\nMAC of existing 802.16 specifications. Requirements for [8] D. Grandblaise, K. Moessner, G. Vivier, R. Tafazolli, \"Credit tokenbased scheduling for inter BS Spectrum Sharing\", 4t Karlsruheboth 802.16h and 802.22 are to reuse spectrum for primary Workshop on Software Radios (WSR'06), Karlsruhe, Germany, 22-23\nsystems but without causing any interference to incumbents. March 2006.\nFor both systems, two co-existence cases arise: co-existence [9] IEEE 802.16 License Exempt (LE) task Group (802\/16h),\nwith primary users, and self co-existence (i.e. co-existence http:\/\/www.ieee802.org\/16\/le\/\namong 802.16 systems themselves, or co-existence among [10] IEEE 802.22 Working Group on Wireless Regional Area Networks,802.22 systems themselves). In support of the self co- http:\/\/www.ieee8O2.org\/22\/\nexistence, some proposals are being discussed in bothprojenct t su propor amic sectu dsharin betw [111] C. Cordeiros, K. Challapali, D. Birru anid S. Shankar N, \"IEEEprojects to support dLynamic spectrum sharing between 802.22: the First Worldwide Wireless standard based on Cognitive\n802.16 systems (respectively 802.22 systems). In particular, Radios\", DySPAN 2005 Conference, 8-11 November, Baltimore, MD,\nthe introduction of rental and negotiation protocols for USA.\nspectrum radio resources between BSs are under discussion [12] Contribution IEEE C802.16h-05\/020rl, \"Proposal for Credit Tokens\nin 802.16h [12]-[15] and 802.22. While in 802.16h both over Based Co-existence Resolution and Negotiation Protocol,\" D.\nthe backhaul and over the air inter system communications Grandblaise, 11 July 2005.\nare under discussion, 802.22 focuses currently only on over [13] IEEE C802.16h - 05\/036rl - \"Proposal for enhanced credit tokens\nthe air approach. based co-existence resolution and negotiation protocol\", D.\nVI. CONCLUSION\nGrandblaise, 08 November 2005.\n[14] IEEE C802.16h - 05\/037rl - \"Proposal for MAC frame mechanisms\nThis paper has described a distributed and real time rental supporting enhanced credit tokens based co-existence resolution and\nprotocol for DCA operations in a multi system and multi cell negotiation protocol\", D. Grandblaise, 08 November 2005.\ncontext for OFDMA systems. The proposed rental protocol is [15] Working Draft Document for 802.16h (2006-02-06), IEEE 802.16h-\nbased on credit token transaction ensuring a collaborative 06\/005.\nsecondary spectrum usage between primary and secondary\nAuthorized licensed use limited to: University of Surrey. Downloaded on May 27,2010 at 13:34:49 UTC from IEEE Xplore.  Restrictions apply. \n"}