{"doi":null,"coreId":"12717","oai":"oai:centaur.reading.ac.uk:4390","identifiers":["oai:centaur.reading.ac.uk:4390",null],"title":"Modelling the inorganic nitrogen behaviour in a small\\ud\nMediterranean forested catchment, Fuirosos (Catalonia)","authors":["Medici, C","Bernal, S","Butturini, A","Sabater, F","Martin, M","Wade, A. J.","Frances, F"],"enrichments":{"references":[{"id":245664,"title":"A nitrogen model for European catchments: INCA, new model structure and equations,","authors":[],"date":"2002","doi":"10.5194\/hess-6-559-2002","raw":null,"cites":null},{"id":245666,"title":"A semidistributed Nitrogen Model for Multiple Source Assessments","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":245626,"title":"A.: Regulation of nitrite oxide emissions form forest and rangeland soils of western","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":245627,"title":"An approach to understanding hydrological connectivity on the hillslope and the implications for nutrient transport,","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":245665,"title":"Assessing nitrogen dynamics in European ecosystems, integrating measurement and modelling: conclusions,","authors":[],"date":"2004","doi":"10.5194\/hess-8-846-2004","raw":null,"cites":null},{"id":245431,"title":"Calibration of the INCA model in a Mediterranean forested catchment: the effect of hydrological inter-annual variability in an intermittent stream,","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":454977,"title":"Drying and wetting of Mediterranean soils stimulates decomposition and carbon dioxide emission: the “Birch effect”,","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":454981,"title":"Ecosystem type differences in nitrogen process rates and controls in the riparian zone of a montane landscape, Forest Ecol.","authors":[],"date":"2006","doi":"10.1016\/j.foreco.2005.10.001","raw":null,"cites":null},{"id":245618,"title":"Factors controlling denitrification in a Chihuahuan desert ecosystem,","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":245433,"title":"Factors limiting denitrification in a Mediterranean riparian forest,","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":245434,"title":"Further observations on humus decomposition and nitrification,","authors":[],"date":"1959","doi":null,"raw":null,"cites":null},{"id":245622,"title":"Global Change: The nitrogen cycle and rivers,","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":245623,"title":"Hierarchy of responses to resource pulses in arid and semi-arid ecosystems,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":245663,"title":"Inter-annual, annual and seasonal variation of P and N retention ina perennial and an intermmitent stream,","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":454978,"title":"Investigation of biogechemical activities in the soil and unsaturated zone of weathered granite,","authors":[],"date":"2005","doi":"10.1007\/s10533-005-0110-0","raw":null,"cites":null},{"id":245430,"title":"Leaf litter dynamics and nitrous oxide emission in a Mediterranean riparian forest: implications for soil nitrogen dynamics,","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":194081,"title":"Metereological and riparian influences on organic matter dynamics in a forested Mediterranean stream,","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":245661,"title":"Microbial biomass responses tos oil drying and rewetting: the fate of fast- and slowgrowing microorganismo in soils from different climates,","authors":[],"date":"1993","doi":"10.1016\/0038-0717(93)90249-B","raw":null,"cites":null},{"id":454980,"title":"Modelling the non-linear hydrological behaviour of a small Mediterranean forested catchment,","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":245621,"title":"Modifying the “pulse-reserve” paradigm for deserts of North America: precipitation pulses, soil water, and plant responses,","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":454982,"title":"Nitrous oxide flux from a shrub-steppe ecosystem: sources and regulation,","authors":[],"date":"1994","doi":"10.1016\/0038-0717(94)90168-6","raw":null,"cites":null},{"id":245619,"title":"Nutrient dynamics in an agricultural watershed: observations on the role of the riparian forest,","authors":[],"date":"1984","doi":null,"raw":null,"cites":null},{"id":245662,"title":"Nutrient imbalances in Agricultural Development,","authors":[],"date":"2009","doi":"10.1126\/science.1170261","raw":null,"cites":null},{"id":454976,"title":"Patterns of nutrients loss from unpolluted, old-growth temperature forests. Evaluation of biogeochemical theory,","authors":[],"date":"1995","doi":"10.2307\/1941208","raw":null,"cites":null},{"id":194085,"title":"Phenological events and their environmental triggers in Mojave-Desert,","authors":[],"date":"1974","doi":null,"raw":null,"cites":null},{"id":454979,"title":"Rewetting and litter addition influence mineralisation and microbial communities in soils form a semi-arid intermittent stream,","authors":[],"date":"2009","doi":"10.1016\/j.soilbio.2008.09.021","raw":null,"cites":null},{"id":245432,"title":"Seasonal variation of dissolved nitrogen and DOC:DON ratios in an intermittent Mediterranean stream,","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":245625,"title":"Soil nitrogen dynamics, in: Ecological of Mediterranean evergreen oak forests, edited by:","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":194084,"title":"Soil water chemistry in a holm oak (Quercus ilex) forest: inteferences on biogeochemical processes for a montane Mediterranean area,","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":245620,"title":"The hydrology of riparian buffer zones: two case studies in an ephemeral and perennial stream,","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":245624,"title":"Thresholds, memory, and seasonality: understanding pulse dynamics in arid\/semi-arid ecosytems,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":194082,"title":"Variation of nitrogen concentration in forest streams. Influences of flow, seasonality and catchment characteristics,","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":194083,"title":"Water pulses and biogeochemical cycles in arid and semi-arid ecosystems,","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":454983,"title":"www.hydrol-earth-syst-sci.net\/14\/223\/2010\/ C. Medici et al.: Inorganic nitrogen behaviour in a Mediterranean forested catchment 237 attenuation in agricultural catchments: shifting balances between transport and reaction,","authors":[],"date":"2010","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-02-08","abstract":"The aim of this work was to couple a nitrogen (N) sub-model to already existent hydrological lumped (LU4-N) and semi-distributed (LU4-R-N and SD4-R-N) conceptual models, to improve our understanding of the factors and processes controlling nitrogen cycling and losses in Mediterranean catchments. The N model adopted provides a simplified conceptualization of the soil nitrogen cycle considering mineralization, nitrification, immobilization, denitrification, plant uptake, and ammonium adsorption\/desorption. It also includes nitrification and denitrification in the shallow perched aquifer. We included a soil moisture threshold for all the considered soil biological processes. The results suggested that all the nitrogen processes were highly influenced by the rain episodes and that soil microbial processes occurred in pulses stimulated by soil moisture increasing after rain. Our simulation highlighted the riparian zone as a possible source of nitrate, especially after the summer drought period, but it can also act as an important sink of nitrate due to denitrification, in particular during the wettest period of the year. The riparian zone was a key element to simulate the catchment nitrate behaviour. The lumped LU4-N model (which does not include the riparian zone) could not be validated, while both the semi-distributed LU4-R-N and SD4-R-N model (which include the riparian zone) gave satisfactory results for the calibration process and acceptable results for the temporal validation process.\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/12717.pdf","fullTextIdentifier":"http:\/\/centaur.reading.ac.uk\/4390\/1\/hess-14-223-2010.pdf","pdfHashValue":"17705007ce76b97af0ef8f7095f3161f549f25a0","publisher":"Copernicus","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:centaur.reading.ac.uk:4390<\/identifier><datestamp>\n      2017-12-04T02:18:19Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D315F3736303833353839:335F6630373835613363:345F6132303130613162<\/setSpec><setSpec>\n      6469766973696F6E733D315F3736303833353839:335F6630373835613363:335F7831393634613364<\/setSpec><setSpec>\n      6469766973696F6E733D315F3435356164306430:345F6D32303130613963<\/setSpec><\/header><metadata><rioxx xmlns=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/\" xmlns:ali=\"http:\/\/ali.niso.org\/2014\/ali\/1.0\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:dcterms=\"http:\/\/purl.org\/dc\/terms\/\" xmlns:rioxxterms=\"http:\/\/docs.rioxx.net\/schema\/v2.0\/rioxxterms\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/ http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/rioxx.xsd\" ><ali:free_to_read>\n    \n      <\/ali:free_to_read><dc:description>The aim of this work was to couple a nitrogen (N) sub-model to already existent hydrological lumped (LU4-N) and semi-distributed (LU4-R-N and SD4-R-N) conceptual models, to improve our understanding of the factors and processes controlling nitrogen cycling and losses in Mediterranean catchments. The N model adopted provides a simplified conceptualization of the soil nitrogen cycle considering mineralization, nitrification, immobilization, denitrification, plant uptake, and ammonium adsorption\/desorption. It also includes nitrification and denitrification in the shallow perched aquifer. We included a soil moisture threshold for all the considered soil biological processes. The results suggested that all the nitrogen processes were highly influenced by the rain episodes and that soil microbial processes occurred in pulses stimulated by soil moisture increasing after rain. Our simulation highlighted the riparian zone as a possible source of nitrate, especially after the summer drought period, but it can also act as an important sink of nitrate due to denitrification, in particular during the wettest period of the year. The riparian zone was a key element to simulate the catchment nitrate behaviour. The lumped LU4-N model (which does not include the riparian zone) could not be validated, while both the semi-distributed LU4-R-N and SD4-R-N model (which include the riparian zone) gave satisfactory results for the calibration process and acceptable results for the temporal validation process.\\ud\n<\/dc:description><dc:format>application\/pdf<\/dc:format><dc:identifier>http:\/\/centaur.reading.ac.uk\/4390\/1\/hess-14-223-2010.pdf<\/dc:identifier><dc:language>en<\/dc:language><dc:publisher>Copernicus<\/dc:publisher><dc:source>1027-5606<\/dc:source><dc:subject>550<\/dc:subject><dc:title>Modelling the inorganic nitrogen behaviour in a small\\ud\nMediterranean forested catchment, Fuirosos (Catalonia)<\/dc:title><rioxxterms:author>Medici, C<\/rioxxterms:author><rioxxterms:author>Bernal, S<\/rioxxterms:author><rioxxterms:author>Butturini, A<\/rioxxterms:author><rioxxterms:author>Sabater, F<\/rioxxterms:author><rioxxterms:author>Martin, M<\/rioxxterms:author><rioxxterms:author>Wade, A. J.<\/rioxxterms:author><rioxxterms:author>Frances, F<\/rioxxterms:author><rioxxterms:publication_date>2010-02-08<\/rioxxterms:publication_date><rioxxterms:type>Journal Article\/Review<\/rioxxterms:type><rioxxterms:version>VoR<\/rioxxterms:version><rioxxterms:version_of_record>http:\/\/dx.doi.org\/10.5194\/hess-14-223-2010<\/rioxxterms:version_of_record><\/rioxx><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["550"],"subject":["550"],"fullText":""}