{"doi":"10.1080\/0968776930010205","coreId":"14378","oai":"oai:generic.eprints.org:143\/core5","identifiers":["oai:generic.eprints.org:143\/core5","10.1080\/0968776930010205"],"title":"Design issues in the production of hyper‐books and visual‐books","authors":["Catenazzi, Nadia","Landoni, Monica","Gibb, Forbes"],"enrichments":{"references":[{"id":201767,"title":"II sistema TELNET', Convegno SMAU\/CNR, La Biblioteca Elettronica, meeting of 3 October,","authors":[],"date":"1991","doi":null,"raw":"King, S.V. (1991), 'II sistema TELNET', Convegno SMAU\/CNR, La Biblioteca Elettronica, meeting of 3 October, Milan (unpublished summary of presentation).","cites":null},{"id":201766,"title":"Il sistema interattivo di fornitura di documenti numerizzati all'INIST', Convegno SMAU\/CNR', La Biblioteca Elettronica, meeting of 3 October, Milan (unpublished summary of presentation).","authors":[],"date":"1991","doi":null,"raw":"Research Fund Report No. 46, London, BNBRF and the Publishers Association. Gourd, F. (1991), 'Il sistema interattivo di fornitura di documenti numerizzati all'INIST', Convegno SMAU\/CNR', La Biblioteca Elettronica, meeting of 3 October, Milan (unpublished summary of presentation).","cites":null},{"id":201769,"title":"SGML documents and non-linear text retrieval',","authors":[],"date":"1991","doi":null,"raw":"Macleod, I.A., Barnard, D.T., Hamilton D. and Levison M. (1991), 'SGML documents and non-linear text retrieval', in RIAO 91 (Recherche d'Information Assistie par Ordinateur) Conference Proceedings, Barcelona.","cites":null},{"id":201768,"title":"Toward the electronic book',","authors":[],"date":"1991","doi":null,"raw":"Lande, N., (1991), 'Toward the electronic book', Publishers Weekly 238, 42.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1993","abstract":"This paper describes an ongoing research project in the area of electronic books. After a brief overview of the state of the art in this field, two new forms of electronic book are presented: hyper‐books and visual‐books. A flexible environment allows them to be produced in a semi‐automatic way starting from different sources: electronic texts (as input for hyper‐books) and paper books (as input for visual‐books). The translation process is driven by the philosophy of preserving the book metaphor in order to guarantee that electronic information is presented in a familiar way. Another important feature of our research is that hyper‐books and visual‐books are conceived not as isolated objects but as entities within an electronic library, which inherits most of the features of a paper‐based library but introduces a number of new properties resulting from its non‐physical nature","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14378.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/143\/1\/ALT_J_Vol1_No2_1993_Design%20issues%20in%20the%20productio.pdf","pdfHashValue":"7511b85a2e40b1b0284c980cc64917f9b9cae3a0","publisher":"Universit of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:143<\/identifier><datestamp>\n      2011-04-04T09:27:46Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/143\/<\/dc:relation><dc:title>\n        Design issues in the production of hyper‐books and visual‐books<\/dc:title><dc:creator>\n        Catenazzi, Nadia<\/dc:creator><dc:creator>\n        Landoni, Monica<\/dc:creator><dc:creator>\n        Gibb, Forbes<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        This paper describes an ongoing research project in the area of electronic books. After a brief overview of the state of the art in this field, two new forms of electronic book are presented: hyper‐books and visual‐books. A flexible environment allows them to be produced in a semi‐automatic way starting from different sources: electronic texts (as input for hyper‐books) and paper books (as input for visual‐books). The translation process is driven by the philosophy of preserving the book metaphor in order to guarantee that electronic information is presented in a familiar way. Another important feature of our research is that hyper‐books and visual‐books are conceived not as isolated objects but as entities within an electronic library, which inherits most of the features of a paper‐based library but introduces a number of new properties resulting from its non‐physical nature.<\/dc:description><dc:publisher>\n        Universit of Wales Press<\/dc:publisher><dc:date>\n        1993<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/143\/1\/ALT_J_Vol1_No2_1993_Design%20issues%20in%20the%20productio.pdf<\/dc:identifier><dc:identifier>\n          Catenazzi, Nadia and Landoni, Monica and Gibb, Forbes  (1993) Design issues in the production of hyper‐books and visual‐books.  Association for Learning Technology Journal, 1 (2).  pp. 40-54.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776930010205<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/143\/","10.1080\/0968776930010205"],"year":1993,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Design issues in the production of hyper-books\nand visual-books\nNadia Catenazzi*. Monica Landoni* and Forbes Gibb**\n* Environmental Informatics Unit, TP.440 - CEC Joint Research Centre, 21020 Ispra\n(VA), Italy\n** Department of Information Science, University of Strathclyde, LJvingtone Tower, 26\nRichmond Street, Glasgow G1 1XH\nAbstract\nThis paper describes an ongoing research project in the area of electronic books.\nAfter a brief overview of the state of the art in this field, two new forms of electronic\nbook are presented: hyper-books and visual-books. A flexible environment allows\nthem to be produced in a semi-automatic way starting from different sources:\nelectronic texts (as input for hyper-books) and paper books (as input for\nvisual-books). The translation process is driven by the philosophy of preserving the\nbook metaphor in order to guarantee that electronic information is presented in a\nfamiliar way. Another important feature of our research is that hyper-books and\nvisual-books are conceived not as isolated objects but as entities within an\nelectronic library, which inherits most of the features of a paper-based library but\nintroduces a number of new properties resulting from its non-physical nature.\nIntroduction\nThe evolution of publishing tools from movable print to digital typesetting controlled by\ncomputer has been principally aimed at improving document quality and lowering unit costs\nrather than responding to readers' needs. And a by-product of these improvements is the\nproduction of enormous quantities of printed paper which are never read and which have\nlimited justification in being defined as information.\nAlthough the computer is largely responsible for this information glut, it can and should be\nturned to assist the reader by providing a consultation environment alongside the production\nsystem, where information can be presented in a more attractive and more functional way than\non paper. To ensure this result, it is necessary to provide some conversion tools which are\nable to translate information acquired from different sources into an electronic environment,\n40\nALT-J VOLUME 1 NUMBER 2\nand at the same time to offer a powerful and meaningful paradigm for information\nrepresentation. The result is an object called the electronic book, a generic term which is\nbecoming widely used, and which encompasses a large family of implementations where the\nfeatures of a conventional book are mapped into an electronic system to various degrees. The\nroute followed by the authors of this paper is to maintain as closely as possible the familiar\nmetaphor of the book. The result is two complementary proposals, hyper-books and\nvisual-books, both based on the same philosophy but with specific features related to the type\nof original documents they manage: electronic texts and paper books respectively.\nElectronic books\nA working definition of an electronic book has been given by Barker (1991) as 'a collection\nof pages of electronic information which can be displayed on a suitable viewing screen.'\nHowever, this definition is very general and encompasses various interpretations. Our\napproach to electronic book design is strongly related to the book metaphor. Books are the\ntraditional repositories of information. People know how to read them, how to use a Table of\nContents, how to use an index, etc. By maintaining the same model on screen, people's access\nto electronic information can be facilitated. Instead of formulating complex queries which are\nused to retrieve books based on, for instance, a document surrogate such as an inverted file, a\nrepresentation of the book itself is available which can be consulted like a physical book. This\napproach helps to overcome some of the limitations inherent in electronic support, such as the\nloss of the physical aspects of the book (for example its thickness) which can be used as an\norientation clue. Nevertheless, there is another important group of difficulties which are\nconnected to technological shortcomings, mainly the limited size and resolution of display\nscreens, that makes reading an electronic book less pleasant than a paper book.\nDesign issues\nThe communication of knowledge is a basic requirement for all types of books, and\nparticularly for electronic books where methods of information and knowledge delivery are\ndifferent from those used in conventional paper books. Essential to electronic book design is\nan understanding of user profiles and of the purpose of the book, which determine the choice\nof interaction strategies and types of interface.\nIt is also important to consider the design processes used for paper books as possible\nguidelines for electronic-book production, while recognizing that the different nature of\nelectronic books makes it necessary to develop specific procedures. At least two different\nlevels of analysis have to be considered, as suggested in Barker and Manji (1991): a basic one\nwhich deals with features related to hardware, software and interfaces; and a conceptual one\nwhich considers the user's point of view.\nAt the first level of analysis, the attention of the designer is focused on practical aspects of the\nsystem, such as the study of interface features and media involved in book representation, and\nthe need for various design templates. In conceptual design, models and paradigms for book\nrepresentation are considered in order to provide an environment where the user can interact\nwith the information in a natural way. Particular attention is given to the design of empty\ntemplates for books and pages which the author will fill in following a relatively simple\nprocess. The conceptual design phase also provides a justification for the choices made in the\n41\nNadia Catenazzi et at ' Design issues for hyper-books and visual-books\ninterface design. In this context, it is useful to distinguish between various categories of\nelectronic books, because different books have different design requirements.\nThere are different ways of classifying electronic books according to different criteria. Barker\n(1991) defines a taxonomy of electronic books based on two criteria: the nature of\ninformation, and the types of services they are able to provide. Collis (1991) classifies\nelectronic books as reference books and text books, a distinction based on different usage.\nAnother important criterion for classifying electronic books is based on the kind of\npresentation offered. Each presentation is dependent on a particular interpretation of the\nconcept of the electronic book. These categories are not necessarily exclusive.\nThere is a large group of electronic books, called portable electronic books, whose main\npurpose is to reproduce portability (Feldman 1990; Lande 1991). In fact, one of the most\nappealing features of paper books is the possibility of carrying them everywhere and reading\nthem comfortably. The electronic equivalent has many drawbacks: limited screen size, limited\nresolution, etc. At the moment, portable electronic books have made their most significant\nimpact in the area of reference publications such as dictionaries and thesauri. A further group\nof electronic books is more focussed on the logical structure rather than on the physical nature\nof the book: information is usually displayed in scrolling windows, which may overlap, and\nthe idea of the page as a static block of text is usually not considered. This is the case with\nDynatext (EBT, 1990) and SuperBook (Egan et al, 1989). Both of these provide full-text\nindexing, links, navigation and orientation through a dynamic table of contents, and a\nmulti-window text display. An interesting aspect of these two systems is the fact that they\nprovide the capability of automatically importing electronically available text\nFinally, there is a group of electronic books which emphasizes the physical aspects of the\nbook but also considers its logical aspects. This, in our opinion, is the most complete and\nsatisfactory solution because it considers logical structures together with physical clues (for\nexample, pages, book thickness), both of which are indispensable for recognizing an object as\na book. This approach becomes particularly important when a paper version exists of the same\ndocument and readers are familiar with it.\nBenest (1987; 1990) presents interesting examples of this kind of electronic book; a book is\npresented as an open document in which pages may be turned and flicked through. The\nthickness of the book is indicated by an active black band along the side and the bottom of\nthe book. The text page may be annotated and highlighted. Book markers also may be\ninserted.\nVortex (Burril, 1989) is another example of an electronic book in this category, but one which\nproposes different solutions. The most original idea here is. concerned with how to solve the\nproblem of providing orientation facilities within the book. In order to indicate the reader's\nposition in the book, the solution adopted in Vortex is the idea of closed pages. The text is\ndisplayed between two sets of vertical lines which represent the thickness of pages before and\nafter the current page. Section names are indicated between these lines and may be selected in\norder to go directly to that page.\nElectronic books in the context of electronic libraries\nThe increasing interest in electronic books and the availability of practical examples of them\nindicates that using them could become a common practice. From this perspective, an obvious\n42\nALT-J VOLUME 1 NUMBER 2\nand very useful application is in the context of an electronic library which could be seen both\nas a personal library (for organizing personal collections of electronic books), and as a public\nlibrary (for delivering the full text of documents online). The library could be accessed\nremotely from any location through a network using personal or portable computers.\nElectronic books do not suffer from the constraints of their physical counterparts, and can be\neasily replicated as many times as required. The library itself has infinite space: there is no\nlimit to the number of books it can contain. Many of the operations normally performed in\nphysical libraries do not exist in electronic libraries (binding and preservation, shelf\nmaintenance etc.), although there may be new administrative functions. The computer\ngradually replaces the librarian's role as intermediary between users and the library. Another\nplayer, the information manager, emerges in the electronic library environment; (s)he is\nresponsible for the development and the maintenance of the system, and uses expertise drawn\nboth from library and information science.\nWhen organizing electronic libraries, most of the technical operations performed in traditional\nlibraries have to be reconsidered. One of the main issues is the acquisition and processing of\nmaterial. Material can exist in different formats, and conversion tools are usually essential\nparts of the acquisition process. Another issue is concerned with the cataloguing of the\nmaterial in order to store it in the library database. Several issues are concerned with public\nservices: how to provide copies of documents; how to display them; how to inform users; how\nto assist users; how to manage search and retrieval taking into account gateways to other\nlibrary systems; how to manage loans, which can be interpreted as temporary provision of\ncopies or free-copy delivery according to the system strategy; and how to protect copyright.\nTwo new forms of electronic book.\nThe authors of this paper are currently working on a research project whose purpose is the\ndesign and development of an environment for building electronic books. Referring to the\nclassification above, our electronic books belong to the final category, as both the physical\nand logical aspects of the book are taken into account. This choice has been based on our\nview of user-needs (readers need to consult a book on the screen and read portions of it, not\njust find an entry in a dictionary) and of our selected application area (scientific publications).\nFor that reason, large screens (at least 19 inches) are an important feature in the design of our\nelectronic books. At the moment, low resolution is one of the main obstacles to acceptance of\nreading electronically displayed text, but technological developments will ensure that this\nbarrier will be removed within a short period of time.\nOur electronic books are conceived not as isolated objects but as integral parts of an\nelectronic library, and some of their properties are dependent on this feature. Users typically\nfind a book after a bibliographic search or browsing through library shelves. They then\nconsult it in order to see if it is what they are looking for and, if the book seems to be\ninteresting, they borrow it. Our electronic books are designed to allow this kind of approach:\nbrowsing, followed by personalization, and finally printing in hard copy.\nAnother important aspect of our research is that in addition to the interface-design issues, a\nflexible publishing environment is provided in order to produce electronic books in a\nsemi-automatic way. More specifically, the design of two different environments is involved:\nthe first consists of a set of tools which allow the conversion of existing electromc texts into\n43\nNadia Catenazzi et aL Design issues for hyper-books and visual-books\nelectronic books (hyper-books); the second aims to define tools for the conversion of paper\nbooks into their electronic counterparts (visual-books).\nHyper-books\nMore and more information is now available in electronic form, but it is not presented in a\nnatural and user-friendly way. The hyper-book proposes an alternative for representing\nelectronic text which overcomes the problem of limited familiarity with text representation,\nand defining an environment where electronic books are generated using electronically\nproduced text. An important feature of such electronic books is the possibility of accessing\ntext in a non-linear way, following the hypertext philosophy. It is obviously for this reason\nthey are called hyper-books. The environment where they are produced is known as a\nhyper-book builder.\nHyper-books maintain many of the features of paper books and present information in a\nformat which is as close as possible to the paper book format. In addition, other capabilities\ncan be provided such as indexing, links, and history mechanisms. A hyper-book is presented\nas an open document with the two pages side by side in view. The page contains different\ncomponents: the footer, the header, and the text itself. The text may contain notes, pictures or\nother non-textual components. A different font style is used for distinguishing active areas of\nthe text (i.e. links).\nThe hyper-book supports several book-control functions such as turn page and close book, and\na number of reader tools: orientation, personalization, searching, history, navigation and\nprinting facilities, which are described in turn below. In addition, a number of editor tools are\nprovided (see Figure 1). These are used during the building process of hyper-books, but are\nnot visible when the hyper-book is made available to the reader in its final version.\nha\nchange font\nchaste size\nncvefieH\nBender\nSereitet |\nvhen end v h e n they need them. The library\nis conceived as • service, not Just as a place\n[Mu£9]Dravarehousevherefelfl}mrian\nb only * custodian. The library services\ninclude providing infbxmatioii, cfaculaiing\nand netvoiking documents to other tibiaries\nand users.\nNowadays many HhrarJes use electronic\nsuppon. Hovever, the global automation of\nme ttnaiyi&clodmc the delivery of fan t e n\non line to stffl in an experimental phase.\nThis report illustrates the main features of an\nelectronic library, through the evolution of\nthe paper Waary awards me fun text\neiectEonic j^ Dxun^ . some projects deajin?\nvtth fan text electronic libraries vfll be\n2. library automation\nIn the past, Kbiaxfes vexe places vhere\ndocuments v e i e preserved and coSeccd\n[McG91]. The access to the material v a s\nrestricted to a small p o o p of people. The\nconcept of fte Ifbxaxy as a senrice fox a\nmmwmnjiy of 03 cts cmeiged later. T v o\nfactus v e m responsible: the invention of\nprinting movable v p e , v h i d i aDoved\nmultiple coptes of a document to be\nproduced and the fact that more people v e i e\nliterate. Therefore, the library as ttb today\nto the result of a literacy process vhfch\ncauses an increasing need t ot a service\nvhich provides i&fonnsuoiL\n|jirip^pftftx jtp^Qj o f Boraxies e x i s t ^^itTi\nFigure 1: The hyper-book template: designer and reader services\n44\nALT-J • VOLUME 1 NUMBER 2\nThe obvious method of providing orientation in a book is the Table of Contents. In addition,\npaper books use running headings and the thickness of the paper as orientation clues. Some\nelectronic books show the Table of Contents at all times (Egan et al, 1989; Catenazzi, 1991)\nwith a marker on the current position. However, this solution does not respect the book\nmetaphor. Hyper-books provide a Table of Contents only in the preliminaries, with the\npossibility of jumping there by clicking on a button from any part of the book.\nMany approaches have been adopted in electronic books for indicating the user's position\nwithin the book, such as the closed pages (Burril, 1989) and black bands (Benest, 1990)\nmentioned above. Hyper-books provide black bands as well as running heads. A black band,\nsimulating the thickness of the book, is composed of vertical and horizontal lines along the\nbottom and outer sides of the book, proportional to the number of pages currently opened. It\nis possible to make large jumps in the book by selecting the black band in a specific place.\nHyper-books provide several kinds of personalization: annotation, highlighting and book-\nmarks. These have the advantage that they may be superimposed on the page without altering\nthe original copy of the book for another user. The types of annotations provided by\nhyper-books are essentially typing and graphic annotations. In addition, it is possible to write\nnotes in an overlapped window associated with the text. A bookmark is displayed as a small\nrectangle inserted on the top side of the book, with a number indicating the page where it has\nbeen created. Bookmarks may also be removed. Another opportunity offered by hyper-books\nis the possibility of copying pieces of text and saving them in a personal clipboard.\nAs far as searching facilities are concerned, the index and Table of Contents represent the two\nmain methods of finding useful material in a physical book. Hyper-books provide both of\nthese, as well as full text indexing. The result of a search using full text indexing is visible in\nthe main body of text through highlighted search terms, as well as in the Table of Contents as\nthe numbers of search-term frequencies for each entry. This approach guarantees that\ncontextual information is always available (Egan et al, 1989).\nWhen consulting electronic books, it is useful to remember the path followed during the\nreading process. This can concern all visited pages or only those which have been marked\nwith bookmarks. Hyper-books provide history mechanisms for both cases.\nThere are essentially two ways of navigating in a book: hierarchically (from the Table of\nContents down to the units of text) and transversally (references across the text). Hyper-books\nprovide both these methods. Transversal links include internal links (reference across the\ndocument) and external links (links across the library). The third way of moving in the text is\nthe classical linear way. The hyper-book offers the possibility of going back and forward\nthrough the pages of the book, as well as flicking through pages.\nThe two pages currently in view, or selected parts of the book, may also be printed in hard\ncopy. All the typographical information of the hyper-book is preserved in the paper copy.\nNot all the facilities described above are necessarily provided to the reader. Most depend on\nthe choices made during the building phase, to which we now turn.\nHyper-book builder\nThe hyper-book builder is an environment in which hyper-books are produced. Two activities\nare basically supported: design of the hyper-book interface (designer's role) and interpretation\n45\nNadia Catenazzi et al Design issues for hyper-books and visual-books\nand presentation of electronic texts according to that interface. Hyper-book production\npresents many analogies with the production process of a paper book. Essential players in the\nproduction of paper books are author, editor, designer and publisher. The roles which are\nmostly reproduced in this context are that of the designer and that of the editor. The text is\nassumed to be in its final version, and the author is not considered, The editor and the\ndesigner collaborate to produce the definition of typographical aspects.\nMain issues related to the hyper-book builder\nAn electronic text may be available in several formats, the simplest being a flat ASCII text.\nHowever, there are many programs for writing and manipulating text, each of which stores it\nin a specific format using a markup language. Markup gives information about the logical\nstructure and\/or the physical appearance of a document. Markups can provide useful\ninformation when automatic treatment of the document is required, and it should therefore be\nexploited in the process of translating the electronic text into the electronic book. Each\nmarkup has specific features, and different translation rules have to be defined for different\nmarkup languages.\nIn order to realize our first prototype hyper-book, SGML (Standard Generalized Markup\nLanguage) was chosen as the markup language. SGML offers a number of advantages over\nother markup techniques such as ODA, Interleaf or Scribe, or specific markup languages used\nby word-processors. SGML was accepted as an international standard (ISO 8879) by the\nInternational Organization for Standardization in 1986. Macleod (1991) describes it as a\nsystem for specifying markup languages rather than as a markup language itself. It allows for\nthe definition of different types of documents, so that a Document Type Definition (DTD)\nformally defines which elements are allowed in a document and how they are organized. The\nlanguage is device- and application-independent (Feeney, 1989). Only the logical structure is\nindicated by the markup, and the same document can be presented in many different ways.\nThis represents an additional advantage of using SGML when, for instance, the same\ndocument has to be accessed on different machines.\nSGML is thus a standard and has all the advantages of an open system, which solves the\nproblem of exchanging electronic documents, something which is extremely important in the\ncontext of implementing an electronic library. Another advantage of using SGML is the\navailability of ready-developed software for handling it. There are SGML parsers, which\nverify that a document conforms with its DTD. Translators also exist from other formats into\nSGML, and the system can be easily expanded. Many initiatives and projects are promoting\nthe use of SGML in the USA and, more recently, in Europe. There are good possibilities that\nit will be more and more widely used.\nAs for design principles, considered in terms of types of interface, styles of interaction and\nfacilities and services provided to the users, these may be partially deduced from traditional\nbook design principles and from contemporary experiments with electronic books. Many\naspects of paper book design are also valid for electronic books, although some constraints on\nthe one hand, and more capabilities on the other, contribute to create a very different object.\nThe size of the book, for instance, is constrained by the screen dimensions: the font size\nshould be bigger on screen than on paper in order to be legible. The study of book design\nissues is particularly important, because the hyper-book builder has to provide a number of\nempty templates. These are pre-formatted empty book structures and pages which have to be\nfilled in by the text, as will now become clear.\n46\nALT-J VOLUME 1 NUMBER 2\nUsing the hyper-book builder\nHie purpose of the hyper-book builder is to provide an environment where the user (at this\nstage the user is the creator of the book) can build his or her hyper-book through a set of tools\ndescribed below.\nA hyper-book is generated by starting from empty templates and a text in SGML or ASCII\nform. A template is a model of a hyper-book; it represents it in terms of structure, format and\nreader services. The contents are not included. The term structure always refers to the logical\nstructure. The format is relative to the presentation of the text and to its appearance on the\nscreen. The structure of the hyper-book is determined by the DTD (Document Type\nDefinition) if the input text is in SGML; no structure is defined for ASCII texts.\nThe format specifies a number of layout features: book size; page size, margins, footer and\nheader; typefaces to be used in different parts of the book; notes; link activation process;\ndesign of specific pages (title page, contents page, index, references, etc.).\nThe reader services include a number of facilities, as described above (orientation,\npersonalization, searching, etc.) which, during the book generation phase, may be defined by\nthe book designer (editor) for the reader. In Figure 1, the editor panel contains a list of\nservices that the designer can select for the reader. Once a service has been selected,\ncorresponding buttons appear in the reader tools panel area.\nA number of predefined templates are provided, while a set of control functions enables the\nuser to modify some aspects of the book format and also some reader services, taking into\naccount the reader and the application features. In order to generate hyper-books, these empty\ntemplates are filled in by the text. The book can then be further modified.\nDifferent steps are involved in the process of generating hyper-books. The first consists of the\nautomatic translation of SGML texts into the hyper-book format. A template is chosen from\nthe set of templates valid for a specific DTD before starting the process. The translation is a\ntwo-step process: the parsing process which verifies that a document conforms with its DTD,\nand the application of rules which map the different elements of the document into a format\nspecified by the template. If the text is available in ASCII form, it will be simply inserted and\npaginated in a template.\nThe next step consists of manipulating the resulting book in order to improve its appearance.\nThe changes deal with the templates and the text itself. The resultant text is characterized by\ncontaining active areas (links). The user is provided with the ability to modify the link\nstructure: new links may be added, and existing ones may be deleted or changed. In order to\ncomplete the generation process, full text indexes may be provided. There are several reasons\nwhich justify the choice of full text indexing: firstly, people often remember exactly a word in\na text, for instance a date or a name, and they need a mechanism for finding that word;\nsecondly, the cost is relatively low compared to keyword indexing, and the indexing process\ncan be automatically implemented.\nWhen the generation process is complete, the book is ready for the end-user, all the tools used\nin the generating phase having been removed.\nOur prototype hyper-book is under development on a Macintosh IIx; the screen size is 19\ninches and the resolution is 75 dpi (dots per inch); the software platform is HyperCard 2.0.\n47\nNadia Catenazzi et al Design issues for hyper-books and visual-books\nThe SGML software currently used is XGML Translator, a tool for specifying conversion\nproduced by Exoterica Corporation.\nFigure 2 shows the conversion process. DTD x represents a given DTD. Tl , T2, T3 are\ntemplates defined for that DTD.\nText and Template\nmanipulation\nFigure 2: The process of converting electronic texts into hyper-books\nVisual-books\nThe visual-book represents a particular interpretation of the electronic book, based mainly on\nthe visual aspects of a conventional paper (real) book: its physical features, such as\ndimensions, thickness, page form and general design style. The visual-book is the result of a\nprocess of conversion of existing paper books into electronic form.\nThe visual-book project is part of a more general project called the Virtual Electronic Library,\nunder development at the Environmental Informatics Unit of JRC at Ispra, Italy; the\n48\nALT-J VOLUME 1 NUMBER 2\nvisual-book is a practical approach to real-book translation. The physical aspects of the real\nbook are the keys to the construction and representation of the visual-book. The focus is on\nthe book's appearance, interpreted as a way of conveying the cognitive background the reader\nalready has. Book functionalities are studied in relation to the book's use, so information is\npresented in a natural and familiar way, and at the same time the reader's activities are\nsupported hi a comfortable environment.\nAn important point in visual-book development is the choice of which original paper book to\ntranslate. Not every kind of publication is suitable for electronic translation. The computer has\nsome limitations when compared to paper support, such as portability and ease of reading, but\nat the same time offers advantages, related to its active role. An electronic environment allows\nchanges and updating of original information, provides different views\/reading of the same\ndocument, integrates multimedia sources of information, permits interchange of data, and\noffers software support online. All these facilities, while being useful for some types of\npublication, are not appropriate for every kind of book; different kinds of reading\nrequirements make electronic translation more or less useful for the reader. In particular,\nbooks which are commonly read in their entirety and in a linear way, such as novels, are not\nas suited to electronic translation which can generate confusion and disturb the reading.\nIndeed, the main requirement of such books is that of legibility, and different views can\ndisturb the reading flow. Furthermore, if the active environment offered by the computer is\nnot exploited, the screen is reduced to being no more than a surrogate for a role that paper can\nplay better. The relation between book and reader in this context is very close, and the\npresence of the computer is more a hindrance than a help.\nOn the other hand, publications which are consulted rather then read, such as encyclopedias,\nmanuals, scientific documents, and in general any reference books, and which suggest a\ndifferent kind of reading geared to problem solving, are more suited to electronic support. The\nreader of these types of publication is more involved in using their contents than in simply\nreading them. For this reason, every attempt to enrich and exploit the existing information is\nuseful to the reader, and electronic support plays an important role by offering more facilities\nthan the paper version.\nAnother specific and interesting application area, especially for visual-book translation, is that\nof ancient manuscripts, where page image is often more relevant than content, and the original\ndocument is too precious and fragile to be consulted and read as a normal document.\nWhen looking for a meaningful application for the visual-book, two areas have therefore been\nconsidered: scientific documentation and ancient manuscripts. Technological constraints have\nmade parameters such as the book's dimensions, printing and paper quality particularly\nrelevant when choosing an application. The area we are examining at present is that of\nscientific publication, this being the most promising common application for visual-book and\nhyper-book.\nBasic concepts of the visual-book\nThe main idea of a visual-book is to offer the reader an object as similar as possible to the\npaper book. An important principle in visual-book design is therefore to determine which\npaper book features are most useful and familiar, and to reproduce them hi an electronic\nenvironment, particular attention being paid to the functionalities a visual-book could acquire\nfrom electronic support, and to the choice of those which would be most useful and consistent\n49\nNadia Catenazzi et at Design issues for hyper-books and visual-books\nwith the specification of the book concept. One of the main advantages of electronic support\nis its dynamic nature which allows the modification and updating of data. On the other hand,\na set of functionalities already available in paper books but not currently in their electronic\ntranslation are widely used by conventional readers, functionalities such as bookmarks, notes\nin the margins or elsewhere in the text, highlighting interesting parts, easy access to pages\nfrequently consulted following different clues, information about the ratio between pages\nalready read and those remaining, control of the reading progress, browsing, and searching for\ninteresting sections.\nThe translation of the paper book into a visual-book has to take into account all these\nfunctionalities with respect to the available technology.\nVisual-book features\nThe visual-book is composed of a set of visual-pages, i.e. images of original pages connected\nby the same relations as in the original book. Page images are shown on the screen following\nthe book metaphor: a pair of images, the left and the right pages, are displayed in a graphical\nreplica of a book, maintaining as much as possible the original size and shape.\nThis kind of representation solves, in a natural way, problems such as:\nOrientation: maintaining the same aspect as in reality, so the reader has a familiar clue while\nnavigating the visual pages. The page number, the page location, the position of pictures and\ngraphics and other visual clues are consistent with the real-book version, thus overcoming\norientation problems which may be caused by the browsing facilities offered by a dynamic\nmedium.\nPersonalization: this is more a technical than a conceptual problem. In fact highlighting,\nunderlining, and adding notes are all possible and naturally interpreted (maintaining, once\nmore, the same appearance as on the paper) in the visual-book but, at this development stage,\nthe difficulty lies in managing pictorial objects overlapping written text.\nSearching: this is based on the Table of Contents and indexes already present in the original\nbook. There is no text indexing because of the pictorial nature of the visual-book. Another\nimportant strategy in visual-book searching is serendipity, the art of finding relevant or\ninteresting information which you were not specifically looking for. By maintaining the\nreal-book appearance, it is possible to reproduce in the visual-book the same effect as in\nreal-book browsing.\nHistory: this can be maintained as a visual map of the visited pages, using suitable icons to\nrepresent them.\nSimilar work\nAn interesting interpretation of the visual-book concept is the one developed by the Library of\nCongress research service (Arms, 1990). The idea is to merge the existing index file with the\ndocument image file, and at the same time provide the document image display (soft copy)\nand the document hard copy (printed version). The objective of this experiment is to evaluate\nthe impact of sophisticated electronic technologies for translating documents to optical digital\nstorage and retrieving them in order to preserve and manage library printed material. At the\nsame time, it is interesting to examine the effects of the technology on copyright, royalties\nand the publishing community. An interesting feature, when developing the visual-book, is the\n50\nALT-J VOLUME 1 NUMBER 2\nacquisition module and the connected compressor and decompressor module. The storage\nstrategy is based mainly on optical-memory technology.\nAnother possible interpretation of the visual-book, as a reconstruction of a real document in\nan electronic medium, is the work developed by INIST - the Institut de l'lnformation\nScientifique et Technique (Gourd, 1991). This organization manages a large number of written\nscientific publications, after scanning them in electronic format. The system used for\ndocument management is GEAC (the automated library cataloguing system used in some UK\nuniversities). Digitized documents are then presented in hard-copy form when a request is\nmade, thus allowing the system to by-pass presentation problems. The importance of this\napproach lies in the solution to storage problems and, in general, the addressing of the\nproblem of managing large document collections.\nAnother similar system is ELNET (King, 1991), a database in Japanese composed of 34\nnewspapers and more than 2S0 journals, all digitized on optical support, and available as hard\ncopy. It has also faced the problem of data storage, and the solution (optical storage) is close\nto the one chosen by INIST. This system is part of a family of similar work all aimed at\ninformation delivery through fax or equivalent tools, starting from a paper original, and\navoiding display problems by only providing hard copies of the original document.\nVisual-book builder\nThe chosen interpretation of the visual-book is based on the collection of page images\norganized in a way which simulates the real-book structure. The elementary model is\ncomposed of pages, interpreted as pictorial objects and the relationship between the previous\nand following pages, so as to allow them to be turned. It is possible to isolate at least three\nmain components in visual-book construction: the photo laboratory, the pictorial database, and\nthe authoring environment.\nThe module that allows page-image acquisition is the photo laboratory. Currently we realize\nthe acquisition by testing different grey levels during the scanning process. Image processing\ncan be performed using software such as PhotoShop on a Macintosh. The idea is to define the\ncommand sequence leading to a good-quality final image. This is the basic step toward\nproducing a complete automated image-processing module. Theoretical problems arise in\ndefining the concept of legibility, but this stage is mainly based on testing available\ntechnology for text image-processing, which includes scanning, compressing and filtering the\ntext image.\nAt the present status of development, we acquire pages through a DataCopy scanner, using 64\ngrey levels with a resolution of 100 dpi. The set of books used for our experiment is\ncomposed of elements made of less then 100 pages, and of pocket size. Paper quality is\naverage, in order to reproduce a realistic example, and style and typographical components .\nhave been chosen to assure a good level of legibility, i.e. the written text has to be clearly\nprinted and its dimension must allow for comfortable reading.\nThe choice of the scanner has been determined by the quality and properties of the objects to\nbe scanned (black and white text) as well as by the limitation in screen resolution (75 dpi\nagainst paper with more than 2,000 dpi). Black and white text does not require a sophisticated\ncolour scanner, which is usually more suitable for photo acquisition, but several grey levels\nare useful in order to make displayed text more legible. Different scanners, according to these\n51\nNadia Catenazzi et al. Design issues for hyper-books and visual-books\nrequirements, have been tested, and other attempts will take place as and when new products\nappear on the market. Another evolutionary area is that of monitors, where various\nexperiments are also foreseen in parallel with the development of display technology. For this\nreason, the acquisition phase has to be considered as a changeable module, guaranteeing\nstandard output as the basis for the rest of the project.\nAfter this step, images are saved as (Macintosh) PICT files in order to be opened by\nPhotoShop as well as by HyperCard. PICT is an almost standard format, and guarantees that\nresulting data is accessible by a large number of applications. At this stage, storage problems\nare not considered, so compression techniques are not applied to these picture files. At the\nsame time, observations have resulted in a set of experimental values for acquisition\nparameters such as the grey levels and the dpi in order to obtain a good, readable image. The\nresult displayed on the screen, a 21 inch colour monitor with a 75 dpi resolution, is legible\nand clear but not so much as to make the user prefer to read the electronic version instead of\nthe original paper one. The purpose of the visual-book project is first and foremost an\ninvestigative one, and results are used as a starting point for exploring other related concepts.\nAs for the pictorial database, a picture repository has been created in order to collect the\nresults of the photo laboratory. A hierarchical organization is given to pictorial objects which\nreconstructs the book's original structure. In addition, a file containing details of the logical\nstructure of the book is constructed during image-book creation. The purpose of this\ndescriptive phase is to realize a prototype as independent as possible of particular kinds of\nbook presentation and structure. Currently, the emphasis is on developing an image storage\nstrategy. A library composed of visual-books requires a large amount of memory in order to\nkeep and manage an appropriate quantity of visual-books. The most promising approach is the\none followed in the set of projects mentioned above, i.e. optical storage. At the same time,\nsoftware and hardware compression techniques can be applied to the picture files, and in\nparticular those solutions suitable for black and white images of text.\nThe authoring environment is the module that allows an image book designer to reconstruct\nthe visual-book on the screen. The basic requirement for this environment is to maintain the\noriginal pagination of the document, and perform it in a (semi-) automatic way, following jthe\ndescription defined in the pictorial database construction. This offers a natural and\nwell-known access key to the document which already exists in paper form, giving a\nconsistent way to browse and read. Some other reader services have been added around the\nsimple image book: personalizing, searching and history, developed under HyperCard. Page\npictures are inserted in the correct position within the book at run time by opening the\ncorresponding picture file and showing it on the top of the HyperCard stack whose\nbackground mimics an appropriately open book.\nThe book is presented using two templates: the first simulates the cover page, the second\nimitates two open pages. A lateral band suggests the current position while reading or\nconsulting the book. Arrows are shown on the screen for turning the visual-pages backwards\nand forwards. The Table of Contents is interpreted as text (using OCR or inserting it\nmanually) that is translated into active references for readers looking for particular subjects.\nThe index is a more complex object. Many conventions have to be exploited in order to\ntranslate in a meaningful way the classical paper index: references such as see also or\nstylistically emphasized items need particular care.\n52\nALT-J VOLUME 1 NUMBER 2\nHyper-books and visual-books in an electronic library\nThe natural evolution of our prototype is the organization of hyper-books and visual-books\ninto a library, and their distribution on line. The resulting electronic library is called the\nVirtual Electronic Library (VEL). The acquisition problem has already been solved:\nhyper-books and visual-books are the result of this process. The next step consists of\norganizing and making them accessible. Online catalogues are the main access method in the\nVEL. The cataloguing process could be automated for hyper-books by exploiting information\nprovided in their original markup.\nIn addition to the features described above (infinite copies, infinite space), the VEL presents a\nnumber of innovative features. Hyper-books are not isolated objects, and links exist between\ndocuments. Visual-books provide a limited link capability but they also offer a powerful tool\nfor the complete conversion of paper books into electronic support, thereby solving problems\nof storage and maintenance of large collections of paper books. Intelligent tools are being\ndeveloped by participants in our project in order to simulate the role of the librarian as\nconsultant: help in formulating bibliographical queries, help in understanding the result of a\nsearch, general information about the system. The concept of loan in an electronic\nenvironment is of course completely different from what one usually encounters: loan in this\ncontext is comparable to having access to the electronic library material. As documents can\nexist in as many copies as requested, books are always available. Once the book has been\naccessed, the user can put it in his or her personal library and it can then be manipulated:\nannotation and cut and paste operations can be allowed, just as if the book were the user's\nproperty. A charging system may need to be defined in order to manage the purchase of\nbooks. Once the book has been bought, the user becomes its owner.\nUsers have different interests and objectives. By observing user-behaviour, a VEL will be able\nto construct individual user profiles. Knowledge about user-needs may be used in order to\noptimize retrieval strategies and acquisition policy. Such reader profiles can be used to notify\nnew publications of interest to the user, and to rank documents, identified during search, in\norder of relevance. Reader profiles can also be used to filter library material and reduce the\nconfusion caused by an excess of information, or to create contacts among users sharing the\nsame interests.\nConclusion\nDuring the first stage of development, a number of difficulties have been experienced. Some\nof them are related to the difficulty of finding SGML documents and their paper counterparts\nto be used as test applications. Other problems are more dependent on the development\nenvironment: HyperCard. These are essentially the limited text-processing capability (for\nexample, text cannot be justified), limited graphics management (images are currently\nincluded using external functions), inefficiency in performing heavy computational operations\n(repagination, thickness redrawing) and in managing grey-level images. Future versions of\nHyperCard should improve text-formatting capabilities, and speed up executions thanks to a\ncompiled programming language.\nDisplay problems connected with limited monitor resolution will be solved by the evolution in\nthis technological field, while storage aspects will be faced in the next development phase. An\nevaluation strategy will be exploited in order to formalize the real impact of our prototypes.\n53\nNadia Catenazzi et at Design issues for hyper-books and visual-books\nFinally, the actual publishing of hyper-books and visual-books is extremely important in the\ncontext of building an electronic library, and this represents the future objective of our work.\nReferences\nArms, C. (1990). 'The context for the future', in Arms, C. (ed)), Campus Strategies for\nLibraries and Electronic Information, Bedford MA, Digital Press.\nBarker, P. (1991), 'Interactive electronic books', Interactive Multimedia, 2, 1.\nBarker, P. and Manji, K. (1991), 'Designing electronic books', Educational and Training\nTechnology International, 28, 4.\nBenest, I.D., Morgan, G. and Smithurst, MJD. (1987), 'A humanised interface to an electronic\nlibrary', in Bullinger, H.-J. and Shakel, B., Human-Computer Interaction - INTERACT' '87,\nNorth Holland, Elsevier.\nBenest, I.D. and Duric, D. (1990), 'Some design issues in the automated office metaphor',\nConference Proceedings of the European X-Window System User Group (Guildford),\nCambridge, UK European X User Group.\nBurril, V.A. and Ogden, J.A. (1989), 'VORTEXT: The hard-backed screen', Electronic\nPublishing, 2, 3.\nCatenazzi, N. and Argentesi F. (1991), 'Super-library: an environment for the conversion of\nlinear text into hypertext', RIAO 91 (Recherche d'Information Assistée par Ordinateur)\nConference Proceedings, Barcelona.\nCollis, BA. (1991), 'The evaluation of electronic books', Educational and Training\nTechnology International, 28, 4.\nEBT (Electronic Book Technologies Inc., Providence RI, USA) (1990), Dynatext: Electronic\nBook Indexer\/Brower (descriptive leaflet).\nEgan, D.E., Remde, J.R., Gomez, L.M., Landauer, T.K., Eberhardt, J. and Lochbaum, C.C.,\n(1989, 'Formative design-evaluation of SuperBook', ACM Transactions on Information\nSystems, 7, 1.\nFeeney, M. (1989) 'SGML', Library and Information Briefings, June, pp. 99-115.\nFeldman, T. (1990), 'The emergence of the electronic book', British National Bibliography\nResearch Fund Report No. 46, London, BNBRF and the Publishers Association.\nGourd, F. (1991), 'Il sistema interattivo di fornitura di documenti numerizzati all'INIST',\nConvegno SMAU\/CNR', La Biblioteca Elettronica, meeting of 3 October, Milan (unpublished\nsummary of presentation).\nKing, S.V. (1991), 'II sistema TELNET', Convegno SMAU\/CNR, La Biblioteca Elettronica,\nmeeting of 3 October, Milan (unpublished summary of presentation).\nLande, N., (1991), 'Toward the electronic book', Publishers Weekly 238, 42.\nMacleod, I.A., Barnard, D.T., Hamilton D. and Levison M. (1991), 'SGML documents and\nnon-linear text retrieval', in RIAO 91 (Recherche d'Information Assistie par Ordinateur)\nConference Proceedings, Barcelona.\n54\n"}