{"doi":"10.1007\/s00335-008-9097-x","coreId":"196298","oai":"oai:lra.le.ac.uk:2381\/8472","identifiers":["oai:lra.le.ac.uk:2381\/8472","10.1007\/s00335-008-9097-x"],"title":"QTL analyses of lineage-negative mouse bone marrow cells labeled with Sca-1 and c-Kit","authors":["Jawad, Mays","Cole, Clare","Zanker, Abigail","Giotopoulos, George","Fitch, Simon","Talbot, Christopher J.","Plumb, Mark"],"enrichments":{"references":[],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2008-03","abstract":"Differences in the number of functionally and\/or phenotypically  defined bone marrow cells in inbred mouse strains have been exploited to map quantitative trait loci (QTL) that determine the variation in cell frequency. To extend this approach to the differences in the stem\/progenitor cell compartment in CBA\/H and C57BL\/6 mice, we have exploited the resolution of flow cytometry and the power of QTL analyses in 124 F2 mice to analyse lineage negative (Lin-) bone marrow cells according to the intensity of labelling with Sca-1 and c-Kit. In the Lin- Sca-1+ c-Kit+ enriched population six quantitative trait loci (QTL) were identified – one significant and five suggestive. Whereas previous in vitro clonogenic, LTIC-IC, CAFC day 35, and flow cytometry each identified different QTL, our approach identified the same or very similar QTL at all three loci (Chromosome 1, 17 and 18) as well as QTL on chromosomes 6 and 10. In silico analyses implicate haematopoietic stem cell homing involving Cxcr4 and Cxcl12 as being the determining pathway. The mapping of the same or very similar QTLs in independent studies using different assay(s) suggests a common genetic determinant, and thus reinforces the biological and genetic significance of the QTL.  These data also suggest that mouse bone marrow cell sub-populations can be functionally, phenotypically and genetically defined.Peer-reviewedPost-prin","downloadUrl":"http:\/\/hdl.handle.net\/2381\/8472","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/8472\/1\/Stem%20cells%20paper%20%28pm%294%20with%20figures.pdf","pdfHashValue":"ccaf128078cdfede8e338f897b897a16418d203d","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/8472<\/identifier><datestamp>\n                2013-10-09T14:55:28Z<\/datestamp><setSpec>\n                com_2381_93<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_95<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nQTL analyses of lineage-negative mouse bone marrow cells labeled with Sca-1 and c-Kit<\/dc:title><dc:creator>\nJawad, Mays<\/dc:creator><dc:creator>\nCole, Clare<\/dc:creator><dc:creator>\nZanker, Abigail<\/dc:creator><dc:creator>\nGiotopoulos, George<\/dc:creator><dc:creator>\nFitch, Simon<\/dc:creator><dc:creator>\nTalbot, Christopher J.<\/dc:creator><dc:creator>\nPlumb, Mark<\/dc:creator><dc:description>\nDifferences in the number of functionally and\/or phenotypically  defined bone marrow cells in inbred mouse strains have been exploited to map quantitative trait loci (QTL) that determine the variation in cell frequency. To extend this approach to the differences in the stem\/progenitor cell compartment in CBA\/H and C57BL\/6 mice, we have exploited the resolution of flow cytometry and the power of QTL analyses in 124 F2 mice to analyse lineage negative (Lin-) bone marrow cells according to the intensity of labelling with Sca-1 and c-Kit. In the Lin- Sca-1+ c-Kit+ enriched population six quantitative trait loci (QTL) were identified – one significant and five suggestive. Whereas previous in vitro clonogenic, LTIC-IC, CAFC day 35, and flow cytometry each identified different QTL, our approach identified the same or very similar QTL at all three loci (Chromosome 1, 17 and 18) as well as QTL on chromosomes 6 and 10. In silico analyses implicate haematopoietic stem cell homing involving Cxcr4 and Cxcl12 as being the determining pathway. The mapping of the same or very similar QTLs in independent studies using different assay(s) suggests a common genetic determinant, and thus reinforces the biological and genetic significance of the QTL.  These data also suggest that mouse bone marrow cell sub-populations can be functionally, phenotypically and genetically defined.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPost-print<\/dc:description><dc:date>\n2010-09-10T11:55:26Z<\/dc:date><dc:date>\n2010-09-10T11:55:26Z<\/dc:date><dc:date>\n2008-03<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nMammalian Genome, 2008, 19 (3), pp. 190-198<\/dc:identifier><dc:identifier>\n0938-8990<\/dc:identifier><dc:identifier>\nhttp:\/\/link.springer.com\/article\/10.1007%2Fs00335-008-9097-x<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/8472<\/dc:identifier><dc:identifier>\n10.1007\/s00335-008-9097-x<\/dc:identifier><dc:identifier>\n1432-1777<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nCopyright © Springer Science+Business Media, LLC 2008. Deposited with reference to the publisher’s archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nSpringer<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0938-8990","1432-1777","issn:1432-1777","0938-8990"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article"],"fullText":" 1 \nQTL analyses of lineage negative mouse bone marrow cells labelled \nwith Sca-1 and c-kit \n \n \nMays Jawad, Clare Cole, Abigail Zanker, George Giotopoulos, Simon Fitch, \nChristopher J. Talbot and Mark Plumb \n \nDepartment of Genetics, University of Leicester, Leicester LE1 7RH, U.K. \n \n \nCorrespondence:  Chris Talbot  \nDepartment of Genetics, University of Leicester,  \nUniversity Road, Leicester LE1 7RH, U.K. \nTel: +44 (0)116 252 3433 \n Fax: +44 (0)116 252 3378  \nE.mail: cjt14@le.ac.uk \n \n \nRunning title: QTL for stem cell frequency \nKeywords:   Stem cell, quantitative trait loci, flow cytometry \n \n 2 \nAbstract \n \nDifferences in the number of functionally and\/or phenotypically  defined bone \nmarrow cells in inbred mouse strains have been exploited to map quantitative trait loci \n(QTL) that determine the variation in cell frequency. To extend this approach to the \ndifferences in the stem\/progenitor cell compartment in CBA\/H and C57BL\/6 mice, we \nhave exploited the resolution of flow cytometry and the power of QTL analyses in \n124 F2 mice to analyse lineage negative (Lin-) bone marrow cells according to the \nintensity of labelling with Sca-1 and c-Kit. In the Lin- Sca-1+ c-Kit+ enriched \npopulation six quantitative trait loci (QTL) were identified – one significant and five \nsuggestive. Whereas previous in vitro clonogenic, LTIC-IC, CAFC day 35, and flow \ncytometry each identified different QTL, our approach identified the same or very \nsimilar QTL at all three loci (Chromosome 1, 17 and 18) as well as QTL on \nchromosomes 6 and 10. In silico analyses implicate haematopoietic stem cell homing \ninvolving Cxcr4 and Cxcl12 as being the determining pathway. The mapping of the \nsame or very similar QTLs in independent studies using different assay(s) suggests a \ncommon genetic determinant, and thus reinforces the biological and genetic \nsignificance of the QTL.  These data also suggest that mouse bone marrow cell sub-\npopulations can be functionally, phenotypically and genetically defined. \n \n 3 \nIntroduction \n \nThe regulation of haemopoiesis relies on the proliferation and\/or differentiation of \nbone marrow stem and progenitor cells which have been functionally defined using \neither in vitro clonogenic assays or in vivo repopulation assays in engrafted mice. \nSignificant differences in normal haematopoiesis have been reported between inbred \nmouse strains, and these differences have enabled genetic studies to identify \nquantitative trait loci (QTL) that regulate these differences. For example, QTL  that \ndetermine stem cell numbers (Henckaerts et al. 2002, 2004; De Haan and Van Zant \n1997, 2000,2002; Muller-Sieburg and Riblet 1996; Morrison et al. 1997, 2002), the \nfrequency of progenitor cells and the relative proportion of mature blood red, T and B \ncells (Chen and Harrison 2002; Morrison et al. 2002; van Os et al. 2006;  Peters et al. \n2006; Valdar et al. 2006; Jawad et al. 2007a) have been identified. In a landmark \nstudy the gene underlying one of these QTL has recently been identified as latexin \n(Liang et al. 2007). Despite the hierarchical nature of haemopoiesis, there is little \noverlap in QTL that determine the frequencies of stem, progenitor and mature \nhaemopoietic cells, suggesting that functionally defined mouse bone marrow cells can \nalso be genetically defined. \n \nIn vitro bone marrow stem and immature progenitor cell assays are based on stroma-\ndependent long-term bone marrow cultures. The long-term culture initiating cell \n(LTC-IC) and Cobblestone Area Forming Cells (day 35 CAFC) have been shown to \nbe related to the bone marrow repopulating stem cell in BXD RI mice (Ploemacher et \nal. 1991; Muller-Sieburg and Riblet, 1996; Sutherland et al. 1990; Petzer et al. 1996; \nBreems et al. 1994). As described in Table 1, the initial study using LTC-IC identified \nQTL on chromosome 1 (Muller-Sieburg and Riblet, 1996) and although this was \nmissed in an initial CAFC Day 35 study (QTL on chromosome 18 only; de Haan and \nVan Zant, 1997), a more recent CAFC Day 35 study identified both QTL on \nchromosomes 1 and 18 (Geiger et al. 2001).  \n \nStem and progenitor cells have also been phenotypically defined according to the \nexpression of specific cell surface antigens such as Sca-1 (Ly6A\/E), Thy-1, c-Kit, \nCD34 and Flk-2 (Christensen and Weissman, 2001; Morrison et al. 1995, 1997; \nOkada et al. 1992; Spangrude and Brooks, 1992). They do not express lineage \n 4 \nmarkers found in maturing blood cells (Lin-), are Thy-1.1lo and are positive for the \nexpression of Sca-1 and c-Kit. For example, Lin- Thy-1.1lo Sca-1+ or Lin- CD34lo\/- \nSca-1+ c-Kit+ bone marrow cells provides stable, long-term multi-lineage \nhaemopoiesis in recipient mice (Uchida and Weissman, 1992; Osawa et al. 1996). The \nQTL that determine the frequencies of LTC-IC and day 35 CAFC  are also unrelated \nto the (C57BL\/Ka-Thy-1.1 X AKR\/J)F2  chromosome 17 QTL that determine the \nfrequency  of Lin- Thy-1.1low Sca-1+ c-Kit+ cells analysed directly by flow cytometry \n(Morrison et al. 2002; Table 1). This suggests that the assays may be examining \ndifferent cells within the stem\/progenitor cell compartment, or in the case of in vitro \nlong term assays, differences in their ability to produce colonies in vitro. \n \nAlthough the evidence suggests that functionally defined bone marrow stem and \nprogenitor cells can also be both phenotypically and genetically defined, the genetic \nrelationship between apparently similar phenotypes is confused. Theoretically some if \nnot all of the cells that give rise to LTC-IC and\/or day 35 CAFC colonies should be \npositive for Sca-1 and c-Kit. Similarly, functionally defined LTC-IC and day 35 \nCAFC should be genetically related to Lin- Thy-1.1low Sca-1+ c-Kit+ cells.  We have \ntherefore analysed total Lin- Sca-1+ c-Kit+ bone marrow cells in (CBA\/H x \nC57Bl\/6)F2 mice directly by Fluorescence Activated Cell Scanning (FACS) and \nmapped QTL, three of which map to the same or similar chromosomal intervals that \ndetermine the frequency of LTC-IC (chromosome 1), day 35 CAFC (chromosome 18) \nand  Lin-, Thy-1.1low, Sca-1+, c-Kit+ (chromosome 17) cells (Muller-Sieburg and \nRiblet, 1996; de Haan and Van Zant, 1997; Morrison et al. 2002). This direct analysis \nby flow cytometry together with a genome-wide screen in F2 mice provides \nsupportive evidence that functionally defined bone marrow cell sub-populations are \nalso both phenotypically and genetically defined.  \n \n \nMaterials and Methods \n \nMice \n \nCBA\/H mice were from the Harwell colony, and C57BL\/6, DBA\/2 mice were from \nHarlan UK Limited. (CBA\/H x C57BL\/6)F1 and F2 mice were bred in Leicester.  The \n 5 \nanimal studies were carried out under guidance issued by the MRC in ‘Responsibility \nin the use of animals for medical research’ (July 1993) and Home Office Project \nlicences No PPL 80\\1565 and 80\\1564.    \n \n \nFlow cytometry analysis and Isolation of Primitive Haematopoietic progenitors \n \nBone marrow was flushed from the femurs of 8-12 week old mice and depleted of \nlineage positive (Lin+) cells using streptavidin-conjugated magnetic beads (QIAGEN, \nNorthampton, U.K) and a panel of biotinylated anti CD3e, CD11b, CD45R, Ly-6G \nand Ly-6C, and TER-119 antibodies. Lin–  bone marrow cells were counted (Scharfe \nSystem Casey 1 machine) and then labelled with R-phycoerythrin- (R-PE) conjugated \nanti mouse c-Kit and fluorescein isothiocyanate-(FITC) conjugated anti Sca-1 or \nappropriate isotype controls. All antibodies were from Becton Dickinson-Pharmingen \n(Oxford, U.K.). The whole cell population acquisition and analysis was performed on \na two-laser FACScalibur (Becton Dickinson) and data analysed using Cellquest \nsoftware. Individual mice were analysed.  \n \nBackground, autofluorescence and non-specific antibody labelling was determined \nusing unlabelled bone marrow cells, or bone marrow cells labelled with appropriate \nrat IgG2 isotype controls, or single labelling with specific FITC Sca-1 or R-PE c-Kit   \nantibodies.  \n \n \nGenetic analysis \n \nLin- bone marrow cells from 124 F2 mice were analysed for Sca-1 and c-Kit \nexpression by flow cytometry. If necessary, quantitative data from the flow cytometer \nwere normalised (by square root transformation) for QTL analysis. DNA prepared \nfrom the tails of the F2 mice was genotyped using 126 polymorphic microsatellite \nmarkers as previously described (Boulton et al. 2003) in a genome-wide screen at ~20 \ncM intervals. The genotype and phenotype data for each of the 124 F2 mice were \nanalysed by composite interval mapping using QTL Cartographer (Wang et al. 2001-\n2004). Significance linkage levels were calculated by permuting the data 10,000 times \n 6 \nand interpreted as determined by Lander and Kruglyak (1995). The calculated \nthresholds showed little variation between phenotypes, for LSK they were:  \nSuggestive linkage LOD >2.5, significant linkage LOD >3.5, and highly significant \nlinkage LOD > 5.8. 95% confidence intervals are based on one LOD support intervals \n(Lynch and Walsh 1998). QTL positions and effect sizes were estimated using \nmultiple interval mapping. Megabase positions are based on genome build NCBI \nm36. \n \nThe three quantitative traits for which QTL were found are highly correlated (R1 vs \nLin-, Sca-1++ r=0.76; R1 vs Lin-, Sca-1-, c-Kit- r=-0.65; Lin-, Sca-1++ vs Lin-, Sca-1-, \nc-Kit- r=-0.78) as expected, so no adjustment of significance thresholds was used. \n \n \nIn silico analysis \n \nCandidate genes in the QTL were assessed against four criteria. Firstly, we \ninterrogated the GeneNetwork database (www.genenetwork.org) for genes showing \ncis-regulation of expression in the QTL (Liang et al. 2007, Bystrykh et al. 2005), \nusing data from the GNF haematopoietic cells on Affymetrix microarray U74Av2 for \nthe BXD cross. Secondly, we searched the GNF SymAtlas \n(http:\/\/symatlas.gnf.org\/SymAtlas\/) for genes showing bone marrow expression \ngreater than 3-fold the tissue median, which again uses data from Affymetrix U74 \narrays (Su et al. 2004). Thirdly we searched the Mouse Genome Database for genes \nwith mutants known to have haematopoietic phenotypes (Eppig et al, 2005). Fourthly \nthe strain distribution patterns of SNPs across the loci were compared for the strains \nin the cross (data from Scripps Florida Mouse Database and WTCHG (Cervino et al, \n2006; Valdar et al, 2006)) to identify chromosomal regions of divergent ancestry. \n 7 \n \n \nResults \n \nParental CBA\/H and C57BL\/6 mice \n \nTo enumerate the frequency of Lin- cells according to the intensity of Sca-1 and\/or c-\nKit labelling in the parental CBA\/H and C57BL\/6 inbred mouse strains, Lin- bone \nmarrow cells were isolated by immunomagnetic depletion of the Lin+ cells. There was \nno significant difference in the recovery of total non-erythroid bone marrow cells \n(WBMC) or Lin- cells (~3% of WBMC) from the two inbred mouse strains or the \n(CBA\/H x C57BL\/6)F1 hybrid (Jawad et al, 2007a). The Lin- cells were labelled with \nFITC anti-Sca-1 and PE anti-c-Kit antibodies and all cells visualised by flow \ncytometry.  \n \nGating strategy was selected such that >98% of unlabelled Lin-  bone marrow cells \nappeared in the 30 x 30 lower left cytogram quadrant and therefore positive \nfluorescent events were classified as events in the >30 quadrant limit (Figure 1A). \nSimilar results were obtained using FITC and R-PE conjugated isotype control \nantibodies (data not shown). The labelling of Lin- bone marrow cells with single R-PE \nc-Kit (Figure 1B) or FITC Sca-1 antibodies (Figure 1C) illustrate both the specificity \nof antibody binding and reinforce the 0-30 quadrant definition of unlabelled cells.  As \nshown in Figures 1A-C, there is some background and autofluorescence, but \naltogether, using unlabelled cells, isotype controls and single specific antibody \nlabelling of Lin- cells, background fluorescence outside the defined 0-30 limits on the \nx and y axis was estimated as <3%.  \n \nLin- cells prepared from CBA\/H (Figure 2A), C57BL\/6 (Figure 2B) and DBA\/2 \n(Figure 2C) bone marrow labelled with both c-Kit and Sca-1 antibodies further \nillustrate the specificity of the flow cytometric analyses. Compared to C57BL\/6, \nCBA\/H and DBA\/2 Lin- cells are enriched for a discrete subpopulation of Lin-Sca-\n1+c-Kit+ cells (L-S+K+; Figure 2A and C, highlighted) and this is well above the \nbackground. For convenience, cells that fluoresce with an intensity of between 30 and \n102 are arbitrarily defined as (+), whereas those that fluoresce with an intensity of \n 8 \n>102 are defined as (++). Thus, the cytograms can be quantitatively analysed \naccording to the nine areas defined by the relative fluorescence intensity (-, + or ++, \nFigure 2D)  of the Sca-1 and c-Kit  coordinates in addition to the gated (R1) discrete \npopulation of Lin- Sca-1+ c-Kit+ cells (R1; Figure 2D).  \n \nAs shown in Table 2, there is a statistically significant genotype-dependent difference \nin the frequency of the discrete subpopulation of gated L-S+K+ cells (p = 0.0054).  It is \nworthy of note that the frequency of all Sca-1 positive cells that fluoresce intensely (y \n> 102; highlighted Figure 2B) is higher in C57BL\/6 and DBA\/2 than CBA\/H. This is \nconsistent with C57BL\/6 mice that carry the Ly6b haplotype giving higher Sca-1 \nexpression than the Ly6a haplotype of the CBA\/H mice (Spangrude and Brooks, \n1993). Also, the frequency of Sca-1+ cells in F1 hybrid mice are similar to the \nC57BL\/6 mice, suggesting that the higher intensity of the Sca-1+ cells is determined \nby a dominant C57BL\/6 genetic train (data not shown). Despite the Ly-6 haplotypes, \nCBA\/H (and DBA\/2) mice have a ~4 fold higher frequency of the discrete L-S+K+ \ncells than C57BL\/6 mice. CBA\/H mice are closely related to DBA\/2 mice (Festing \n1996), and the four-fold L-S+K+ cell frequency difference is the same order of \nmagnitude as the higher frequency of stem cells in DBA\/2 and CBA mice compared \nto C57BL\/6 mice estimated using in vitro LTC-IC (Muller-Sieberg and Riblet 1996) \nand\/or day 35 CAFC (de Haan and Van Zant 1997) in vitro clonogenic assays. \n \nDespite the observed difference in the intensity\/number of Sca-1+\/++ cells between the \ntwo parental strains, there is less of a difference in the total number of Lin- Sca-1++ c-\nKit++ (Upper right quadrant in Figure 2D) cells between the two inbred strains, the \ndifference is not statistically significant and both are comparable to that observed in \nthe F1 hybrid (data not shown). This is due in part to the observed higher frequency of \nthe discrete R1 L-S+K+ gated population (Table 2) in CBA\/H mice than C57BL\/6 \nmice, indicating that reduced difference in the total number of Lin- Sca-1++ c-Kit++ \ncells is a balance between higher Sca-1 labelling in the C57BL\/6 mice and a higher \nfrequency of the gated R1 (L-S+K+) cells in CBA\/H mice. \n \n 9 \nGenetic analysis \n \nLin- bone marrow cells from each of 124 (CBA\/H X C57BL\/6)F1 intercross F2 mice \nwere analysed for Sca-1 and c-Kit labelling by flow cytometry, and genotyped in a \ngenome wide screen at ~20 cM intervals with 126 polymorphic microsatellite \nmarkers. Quantitative data for each mouse and FACS area (Figure 2D) were analysed \nusing the QTL Cartographer programme (Wang et al. 2001-2004). Areas of the flow \ncytogram that revealed genetic linkage above the threshold necessary for suggestive \nlinkage, as calculated by permuting the data (LOD= 2.5), are summarised in Table 3 \n(Lander and Kruglyak 1995). As the quantitative traits used are correlated no \ncorrection was applied for multiple testing.  \n \nComposite interval mapping found a significant QTL on chromosome 17 that \ndetermines the frequency of double negative L-S-K- cells, which maps to the HLA \nlocus (Figure 5 and Table 3). Analysis of the same L-S-K- cells identified a suggestive \nQTL on chromosome 19. No QTL were revealed for Lin- c-Kit+ cells (x > 30), but a \nsignificant QTL on chromosome 15 was revealed for the intensely labelling Lin- Sca-\n1+ cells (Lin-Sca-1++; y >102; Figures 2 & 4 and Table 3).  The mouse Sca-1 gene \nmaps to chromosome 15 so this result is consistent with the known Ly-6 haplotypes of \nthe parental mouse strains (Spangrude and Brooks 1993). \n \nFive QTL were revealed for the discrete population of L-S+K+ cells, four of which \nachieve the criteria of suggestive (LOD > 2.5; chromosomes 6 and 17, 18), and one is \nsignificant (LOD 3.5, chromosome 10) (Table 3 and Figure 3). Optimisation of final \nQTL models by Multiple Interval Mapping reveals an additional QTL on \nchromosome 1 at 62cM (an epistatic effect with the chromosome 17 QTL) and \nestimates the effect sizes of the QTL as being: chromosome 1 4.8%, chromosome 6 \n5.0% and 8.1%, chromosome 10 10.8%, chromosome 17 5.1%, chromosome 18 6.7%. \n \nTwo of the QTL map close to QTL that determine the frequency of stem cells in \n(BXD)RI mice using the LTC-IC (Scfr2, chromosome 1; ~53 cM)(Muller-Sieburg \nand Riblet 1996) and day 35 CAFC (chromosome 18; 19 cM) (de Haan and Van Zant, \n1997)  in vitro clonogenic stem cell assays (Table 1). The chromosome 17 QTL (HLA \ncomplex) was also revealed by flow cytometry of Lin- Thy-1low Sca-1+ c-Kit+ (AKR\/J \n 10 \nx C57Bl\/Ka)F2 bone marrow cells (Morrison et al. 2002). Interestingly, the \nchromosome 15 (Ly6) QTL was not revealed in the analysis of the discrete population \nof Lin- Sca-1+ c-Kit+ cells (Table 3). \n \nThere is no evidence of a sex effect in these data; none of the traits are significantly \ndifferent between males and females and introducing sex as a co-variate in the QTL \nanalysis makes little difference (data not shown). \n \n \n \n \n \nIn silico analysis \n \nEach QTL contains many genes but in silico analyses were carried out to compile a \nlist of candidate quantitative trait genes (QTG). To assess the specificity of our \ncriteria we scored all protein-coding genes on mouse chromosome 2, for which no \nQTL were detected. Of the 1913 protein-coding genes 2.0% show cis regulation of \ntranscription, 4.8% have bone marrow expression >3-fold above median and 4.1% \nhave mutants with known haematopoietic phenotypes. Only one chromosome 2 gene \n(Cd44) meets all three of these criteria, and it also meets the fourth criterion, by being \nin a genomic region with SNPs informative for this cross. Thus although these criteria \nwill miss candidate QTG e.g. those not present on the Affymetrix U74 microarrays, \nthey are fairly specific, given that the QTL intervals each contain around 300 genes. \n \nIn the chromosome 1 QTL only the Cxcr4 gene meets all four criteria, with no other \ngene meeting more than two (see methods). In the distal chromosome 6 QTL there are \ntwo candidates that meet three criteria: Cxcl2 and Cdca3. For the chromosome 10 \nQTL three genes met two of the criteria: integrin b2, thymopoietin and Spi-C. For the \nchromosome 18 QTL the candidate genes are FGF1 and desmoglein-2 (2 criteria \neach). There are no candidates that meet more than one criterion for the other QTL. \nGiven that previous QTL have been mapped to similar regions as found in this study \nusing different in vitro assays, our data thus provide genetic evidence for the presence \nof the LTC-IC and day 35 CAFC cells in the discrete population of L-S+K+ cells that \n 11 \ncan be directly visualised by flow cytometry irrespective of the Ly-6 haplotype of the \nparental mouse strains. In addition to being phenotypically defined (Lin- Sca-1+ c-\nKit+), the genetic evidence are strong supportive evidence that they are enriched for \nfunctionally defined stem cells. \n \n \nDiscussion \n \nWe have combined the power of mouse genetics with the discrimination of flow \ncytometry to map QTL that control the frequency of specific sub-populations of \nlineage negative bone marrow cells separated according to c-Kit and\/or Sca-1 \nlabelling and that can be directly visualised irrespective of the Ly-6 haplotype. The \nQTL on chromosomes 1 (62 cM) and 18 (13.1 cM) that determine the frequency of a \ndiscrete population of L-S+K+ (R1) cells are the same or very similar to the QTL that \nregulate the frequency of LTC-IC (~50 cM; p= 0.0007) (Muller-Sieburg and Riblet \n1996), and day 35 CAFC (19 cM; LOD 3.3) (de Haan and Van Zant 1997) cells in \nBXD RI mice, respectively. A third significant QTL (chromosome 17) has previously \nbeen implicated in the frequency of Thy-1low Sca-1+ c-Kit+ cells (Morrison et al. \n2002) and contains the mouse H-2 complex, including the Class I MHC alleles. It is \nunclear whether the same gene(s) within the MHC complex determine the frequency \nof Thy-1low Sca-1+ c-Kit+, L- S+ K+ and L- S- K- cells (Tables 1 and 3) (Morrison et al. \n2002). \n \nGenetic loci that confer a susceptibility to spontaneous or induced haemopoietic \nmalignancies have also been mapped in mice, and differences in the relative \nfrequency of the target cell (target size) may be one genetically determined risk factor \n(recently reviewed by Jawad et al. 2007b). For example, QTL that determine the \nsusceptibility to spontaneous pre-B and T lymphomas were both mapped to proximal \nchromosome 17 (Yamada et al. 1994a, 1994b), and thus implicates the H-2 complex \nin both the regulation of bone marrow stem and progenitor cell frequencies and a \nsusceptibility to spontaneous lymphoid lymphomas. Similarly, a susceptibility to \npristane-induced plasmacytoma QTL has been mapped to a position on chromosome \n1 (54 cM)(Mock et al. 1993) that is very similar to QTL that determine the frequency \nof L-S+K+ cells (~65 cM; Table 3), the frequency of bone marrow LTC-IC cells (~50 \n 12 \ncM)(Muller-Sieburg and Riblet 1996) and the relative proportion of B220 B \nlymphocytes in mouse peripheral blood (Pbbcp1; 62-64 cM)(Chen and Harrison \n2002). Similarly a  QTL that confers a susceptibility to radiation-induced AML was \nmapped to distal chromosome 1 (~100 cM; Boulton et al. 2003; Jawad et al. 2006), a \nposition that is very similar to the Scfr1 locus (~100 cM) that also determines the \nfrequency of LTC-IC bone marrow cells (Muller-Sieburg and Riblet 1996). However, \nthe distal chromosome 1 LTC-IC QTL was not revealed in this study, suggesting that \nthe colonies in the LTC-IC clonogenic assay are phenotypically heterogeneous.  \n \nThe largest effect L-S+K+ cell QTL detected in this study, which is on chromosome \n10, may overlap with the suggestive L-S+K+ cell QTL found in van Os et al, 2006 \n(32.4-50.4cM, as compared to van Os peak between 51 and 70cM). In addition the \ndistal chromosome 6 QTL has a similar location to the other suggestive QTL found in \nthat study (45.9-56.0cM compared with van Os peak at 51cM). \n \nIdentifying candidate genes is unreliable with the large intervals found in QTL \nstudies, but can be aided by in silico analysis (Flint et al. 2005). The only gene that \nmet all of our criteria was Cxcr4 on chromosome 1. This gene encodes a CXC \ncytokine receptor which is essential for the homing of haematopoietic stem cells to \nthe vascular stem cell niche of the bone marrow (Burger and Burkle 2007). The fact \nthat candidate genes for the other QTL include Cxcl12, which is the ligand for CXCR4 \nand Itgb2, an integrin involved in HSC homing to the periphery (Chavakis et al. \n2005), leads to the tempting hypothesis that genetic variation in a common HSC \nhoming pathway may be important in determining stem cell numbers. This hypothesis \nmust remain tentative however until confirmatory laboratory experiments have been \ncarried out. \n \nThe genetic intervals mapped in these studies are large, and the possibility that \nmultiple QTL map to the same interval cannot be excluded. The mapping of the same \nor very similar QTL in independent studies using different assay(s), biological end-\npoints and\/or different inbred mouse strains increases the biological and genetic \nsignificance of that QTL. Of all the L-S+K+ cell QTL we mapped (Table 3) on a \nCBA\/H x C57BL\/6 genetic background, the same or very similar QTL on \nchromosomes 1, 17 and 18 have been previously described in independent studies of \n 13 \nmouse stem\/progenitor cell frequency using different assays and different genetic \nbackgrounds (BXD RI, and [C57BL\/Ka-Thy-1.1 x AKR\/J]F2) (Table 1). Although \nthe L-S+K+ may not represent all the cells that have been functionally and genetically \ndefined in vitro, the L-S+K+  cells are enriched for some of those cells that give rise to \nLTC-IC and\/or day 35 CAFC cells. Furthermore, this suggests that specific cellular \nphenotypes themselves can also be genetically defined, and that definition can be \nfurther refined. A combination of functional, phenotypic and genetic definitions of \ncell sub-populations will be an invaluable resource in providing evidence as to \nwhether or not distinct phenotypic assays are in fact measuring the same cell(s), and \npotentially reveal evidence of relationships between apparently dissimilar phenotypes.  \n \n \n \n \n \nAcknowledgements \n \nThis work was supported by the Leukaemia Research Fund. CC was funded by an \nMRC Research Studentship, and GG supported by the HOPE Foundation for Cancer \nResearch. We would like to dedicate this paper to Mark Plumb, who was the principal \ninvestigator on this project and died in May 2007. \n \n \nReferences \n \nBoulton E, Cole C, Knight A, Cleary H, Snowden R, et al. (2003) Low penetrance \ngenetic susceptibility and resistance loci implicated in the relative risk of \nradiation-induced acute myeloid leukaemia in mice.  Blood 101: 2349-2354 \nBreems DA, Blokland EA, Neben S, Ploemacher RE (1994) Frequency analysis of \nhuman primitive haemtopoietic stem cell subsets using a cobblestone area forming \ncell assay. Leukemia 8: 1095-1104 \nBurger JA, Burkle A (2007) The CXCR4 chemokine receptor in acute and chronic \nleukaemia: a marrow homing receptor and potential therapeutic target. Br J \nHaematol 137:288-296  \n 14 \nBystrykh L, Weersing E, Dontje B, Sutton S, Pletcher MT, et al. (2005) Uncovering \nregulatory pathways that affect hematopoietic stem cell function using 'genetical \ngenomics'. Nature Genetics 37:225-232 \nCervino AC, Gosink M, Fallahi M, Pascal B, Mader C, et al. (2006) A comprehensive \nmouse IBD database for the efficient localization of quantitative trait loci. Mamm \nGenome 17:565-574 \nChavakis E, Aicher A, Heeschen C, Sasaki K, Kaiser R, et al. (2005) Role of beta2-\nintegrins for homing and neovascularization capacity of endothelial progenitor \ncells. J Exp Med 201:63-72 \nChen J, Harrison DE (2002) Quantitative trait loci regulating relative lymphocyte \nproportions in mouse peripheral blood. Blood 99: 561-566 \nChristensen JL, Weissman IL (2001) Flk-2 is a marker in haemopoietic stem cell \ndifferentiation: A simple method to isolate long-term stem cells. Proc Nat Acad \nSci USA  98:14541-14546 \nDe Haan G, Van Zant G (1997) Intrinsic and extrinsic control of hemopoietic stem \ncell numbers: Mapping of a stem cell gene. J Exp Med 186:529-536 \nDe Haan G, Szilvassy SJ, Meyerose TE, Dontje B, Grimes B, et al. (2000) Distinct \nfunctional properties of highly purified hematopoietic stem cells from mouse \nstrains differing in stem cell numbers.  Blood 96:1374-1379 \nDe Haan G, Bystrykh LV, Weersing E, Dontje B, Geiger H, et al. (2002) A genetic \nand genomic analysis identifies a cluster of genes associated with haemopoietic \ncell turnover. Blood 100:2056-2062 \nEppig JT, Bult CJ, Kadin JA, Richardson JE, Blake JA, et al. (2005) The Mouse \nGenome Database (MGD): from genes to mice—a community resource for mouse \nbiology. Nucleic Acids Res 33:D471-D475 \nFesting MF (1996) Origins and characteristics of inbred strains of mice.  In: Lyon, \nM.F., Rastan, S. & Brown, S.D.M., eds. Genetic Variants and strains of the \nlaboratory mouse. Vol 2. Oxford University Press, Oxford UK, pp1537-1576 \nFlint J, Valdar W, Shifman S, Mott R (2005) Strategies for mapping and cloning \nquantitative trait genes in rodents. Nat Rev Genet 6:271-86 \nGeiger H, True JM, de Haan G, Van Zant G (2001) Age- and stage-specific regulation \npatterns in the haematopoietic stem cell hierarchy. Blood  98: 2966-72  \nHenckaerts E, Geiger H, Langer JC, Rebollo P, Van Zant G, et al. (2002) Genetically \ndetermined variation in the number of phenotypically defined haemopoietic \n 15 \nprogenitor and stem cells and in their response to early-acting cytokines. Blood \n99:3947-3954  \nHenckaerts E, Langer JC, Snoeck H-W (2004) Quantitative genetic variation in the \nhematopoietic stem and progenitor cell compartment and in life span are closely \nlinked at multiple loci in BXD recombinant inbred mice. Blood 104:374-379  \nJawad M, Cole C, Zanker A, Lo P, Fitch S, Plumb, M (2006) Evidence for clustered \ntumour suppressor gene loci on mouse chromosomes 2 and 4 in radiation-induced \nAcute Myeloid Leukaemia. Int. J. Radiat. Biol.  82:383-391 \nJawad M, Giotopoulos G, Fitch S, Cole C, Plumb M, et al.  (2007a) Mouse bone \nmarrow and peripheral blood red blood cell counts are regulated by different \nautosomal genetic loci. Blood Cells Mol & Disease, 38:69-77 \nJawad M, Giotopoulos G, Cole C, Plumb M (2007b) Target cell frequency is a \ngenetically determined risk factor in radiation leukaemogenesis. Br J Radiol \n80:56-62 \nLander E, Kruglyak L (1995) Genetic dissection of complex traits: guidelines for \ninterpreting and reporting linkage results. Nature Genetics 11:241-247 \nLiang Y, Jansen M, Aronow B, Geiger H, Van Zant G (2007) The quantitative trait \ngene latexin influences the size of the hematopoietic stem cell population in mice. \nNature Genetics 39:178-188 \nLynch M, Walsh, B (1998) Genetics and analysis of quantitative traits (Sunderland, \nMA: Sinauer Associates Inc). \nMock BA, Krall MM, Dosik JK (1993) Genetic mapping of tumor susceptibility \ngenes involved in mouse plasmacytomagensis. Proc Natl Acad Sci USA 90:9499-\n9503 \nMorrison SJ, Hemmati HD, Wandycz AM, Weissman IL (1995) The purification and \ncharacterization of fetal liver hematopoietic stem cells. Proc Natl Acad Sci USA \n92:10302-6. \nMorrison SJ, Wandycz AM, Hemmati HD, Wright DE, Weissman IL (1997) \nIdentification of a lineage of multipotent hematopoietic progenitors. Development \n124:1929-1939 \nMorrison SJ, Qian D, Jerabek L, Thiel BA, Park I-K, Ford PS, Kiel MJ, Schork NJ, \nWeissman IL, Clarke MF (2002) A genetic determinant that specifically regulates \nthe frequency of hematopoietic stem cells. J Immunol  168:635-642 \n 16 \nMuller-Sieburg CE, Riblet R (1996) Genetic control of the frequency of haemopoietic \nstem cells in mice: mapping a candidate locus to chromosome 1.  J Exp Med \n183:1141-1150 \nOkada S, Nakauchi H, Nagayoshi K, Nishikawa S, Miura Y, et al. (1992) In vivo and \nin vitro stem cell function of c-Kit- and sca-1-positive murine hematopoietic cells. \nBlood 80:3044-3050 \nOsawa M, Hanada K, Hamada H, Nakauchi H (1996) Long-term \nlymphohematopoietic reconstitution by a single CD34-low\/negative hematopoietic \nstem cell. Science 273:242-245 \nPeters LL, Lambert AJ, Zhang W, Churchill GA, Brugnara C, et al. (2006) \nQuantitative trait loci for baseline erythroid traits. Mamm Genome 17:298-309 \nPetzer AL, Hogge DE, Lansdorp PM, Reid DS, Eaves CJ (1996) Self-renewal of \nprimitive human hematopoietic cells (long-term-culture-initiating cells) in vitro \nand their expansion in defined medium. Proc Natl Acad Sci USA  93:1470-1474 \nPloemacher RE, van der Sluijs JP, van Beurden CAJ, Baert MRM, Chan PL (1991) \nUse of limiting-dilution type long-term marrow cultures in frequency analysis of \nmarrow-repopulating and spleen colony-forming hematopoietic stem cells in the \nmouse. Blood 78: 2527-2533 \nSpangrude GJ, Brooks DM (1992) Phenotypic analysis of mouse haemopoietic stem \ncells shows a Thy-1-negative subset. Blood 80:1957-1964 \nSpangrude GJ, Brooks DM (1993) Mouse strain variability in the expression of the \nhematopoietic stem cell antigen Ly-6A\/E by bone marrow cells. Blood 82:3327-\n3332 \nSu AI, Wiltshire T, Batalov S, Lapp H, Ching KA, et al. (2004) A gene atlas of the \nmouse and human protein-encoding transcriptomes. Proc Natl Acad Sci USA \n101:6062-6067 \nSutherland HJ, Lansdorp PM, Henkelman DH, Eaves AC, Eaves CJ (1990) \nFunctional characterization of individual human hematopoietic stem cells cultured \nat limiting dilution on supportive marrow stromal layers. Proc Natl Acad Sci USA \n87:3584-3588 \nUchida N, Weissman IL (1992) Searching for hematopoietic stem cells: evidence that \nThy-1.1lo Lin- Sca-1+ cells are the only stem cells in C57BL\/Ka-Thy-1.1 bone \nmarrow. J Exp Med 175:175-184 \n 17 \nValdar W, Solberg LC, Gauguier D, Burnett S, Klenerman P, et al. (2006) Genome-\nwide genetic association of complex traits in heterogeneous stock mice. Nat Genet \n38:879-887   \nVan Os R, Ausema A, Noach EJK, van Pelt K, Dontje BJH, et al. (2006) \nIdentification of quantitative trait loci regulating haemopoietic parameters in \nB6AKRF2 mice. Brit J Haematol 132:80-90 \nWang S, Basten CJ, Zeng Z-B (2001-2004) Windows QTL Cartographer 2.0. \nDepartment of Statistics, North Carolina State University, Raleigh, NC. \n(http:\/\/statgen.ncsu.edu\/qtlcart\/WQTLCart.htm). \nYamada Y, Shisa H, Matsushiro H, Kamoto T, Kobayashi Y, et al. (1994a)  T \nlymphomagenesis is determined by a dominant host gene Thymic Lymphoma \nSusceptible Mouse-1 (TLSM-1) in mouse models. J Exp Med 180:2155-2162 \nYamada Y, Matsushiro H, Ogawa MS, Okamoto K, Nakakuki Y, et al. (1994b) \nGenetic predisposition to pre-B lymphomas in SL\/Kh strain mice. Cancer Res \n54:403-407 \n \nFigure legends: \nFigure 1: \nFlow cytograms of Lin- cells to illustrate the background defined by the 0-30 \nquadrant. A. Unlabelled Lin- cells. B. Lin- cells labelled with R-PE anti mouse c-Kit. \nC. Lin- cells (CBA\/H) labelled with FITC anti Sca-1 antibody. \n \n \n 18 \nFigure 2: \nDirect visualization of Lin- bone marrow cells labelled with anti Sca-1 and c-Kit \nantibodies by flow cytometry. \nA-C. Representative flow cytograms of Lin- bone marrow cells from (A.) CBA\/H, \n(B.) C57BL\/6, and (C.) DBA\/2 mice labelled for Sca-1 and c-Kit expression\/antibody \nbinding and visualised directly by flow cytemtry.  D. Areas of the cytogram analysed \nin this study are schematically represented where the relative fluorescence intensity \n(1-30) is defined as negative (-) based on unlabelled cells, intermediate (+; 301-102) or \nhigh (++; >102) as shown. The discrete population of L-S+K+ cells that distinguish \nCBA\/H and DBA\/2 mice from C57BL\/6 mice were quantitated by gating the R1 \nregion. \n 19 \n \n \nFigure 3: \nLOD plot using number of cells in R1 gated region (L-S+K+). \nPlot showing LOD scores achieved by composite interval mapping for the L-S+K+  \ncell phenotype. Axis legend: Y axis shows LOD score and X axis is genetic position \n 20 \nwith chromosomes indicated. Threshold lines are for suggestive linkage at LOD 2.5 \nand significant at 3.5. \n \n \nFigure 4: \nLOD plot using number of Sca-1++ cells \nPlot showing LOD scores achieved by composite interval mapping for the frequency \nof Lin- Sca-1++ cells (cytogram area y >102). Axis legend: Y axis shows LOD score \nand X axis is genetic position with chromosomes indicated. Threshold lines are for \nsuggestive linkage at LOD 2.5 and significant at 3.5. \n 21 \n \n \nFigure 5: \nLOD plot using number of L-S-K- cells \nPlot showing LOD scores achieved by composite interval mapping for the frequency \nof double negative L-S-K- cells (cytogram area x <30, y <30 ). Axis legend: Y axis \nshows LOD score and X axis is genetic position with chromosomes indicated. \nThreshold lines are for suggestive linkage at LOD 2.5 and significant at 3.5. \n 22 \n \n 23 \nTable legends: \nTable 1:  Studies showing relevant HSC QTL. \nMouse strains shows mapping cross: (BXD)RI is C57\/BL6 x DBA recombinant \ninbreds. \n \nMouse strains Chr (Peak) Assay Reference \n \n(BXD)RI \n1   (52.3 cM) \n1   (98.6 cM) \n \nLTC-IC \nMuller-Sieberg and Riblet, \n1996 \n \n(BXD)RI \n \n18 (19 cM) \nCAFC  \nday 35 \n \nde Haan and Van Zant, 1997 \n \n(BXD)RI \n1   (38 cM) \n1   (100 cM) \n18   (27 cM) \n \nCAFC  \nday 35 \n \nGeiger et al, 2001 \n(AKR\/J x \nC57BL\/Thy-1.1)F2 \n \n17 (19.8 cM) \nL-S+K+  \nThy1lo \n \nMorrison et a,. 2002 \n(C57BL\/6 x AKR) \nF2 \n6 (51 cM) \n10 (51-70 cM) \nL-S+K+ van Os et al, 2006 \n(C57BL\/6 x AKR) \nF2 \n1 (86.6 cM) CAFC  \nday 35 \nvan Os et al, 2006 \n \n \nTable 2: \nFrequency of discrete populations of Lin- bone marrow cells defined by Sca-1 \nand\/or c-kit labelling \nRefer to Figure 2D for quadrant description. (a): F1 are CBA\/H x C57BL\/6 hybrids. \n(b):  Statistical significance in cellular frequencies comparing CBA\/H and C57BL\/6 \nmouse bone marrow analysed by Flow cytometry (only p values <0.06 are shown; \nKruskal-Wallis Test). \n \n \n \n FACS \nCoordinates \n \nCBA\/H \n \nC57BL\/6 \n \nF1a \n \nPb \n 24 \nFigure 1D (n = 23-26) (n = 17-18) (n = 9) (CBA vsC57) \n \nLin-, Sca-1-, c-kit- \n(% Lin- ± SD) \n \nY = 1-30 \nX = 1-30 \n \n61 ± 8.3 \n \n \n82.2 ± 6.5 \n \n62.54 ± 4.3 \n \n \nLin-, Sca-1+\/++, c-kit-\/+ \n(% Lin- ± SD) \n \nY = 102-104 \nX = 1-102 \n \n1.0 ± 0.5 \n \n \n2.9 ± 1.1 \n \n \n3.68 ± 0.8 \n \n< 10-6 \n \nLin-, Sca-1++  \n(% Lin- ± SD) \n \nY = 102-104 \nX = 1-104 \n \n2.73 ± 2.0 \n \n \n5.1 ± 1.3 \n \n \n5.2 ± 1.1 \n \n \n0.0002 \n \nLin-, c-kit++ \n(% Lin- ± SD) \n \nY = 1-104 \nX = 102-104 \n \n26.3 ± 6.9 \n \n \n22.6 ± 4.8 \n \n \n19.4 ± 2.8 \n \n \n0.0525 \n \nLin-, Sca-1++, c-kit++ \n(% Lin- ± SD) \nGated  \nR1 (L-S+K+) \n \n1.9 ± 0.7 \n \n \n0.5 ± 0.1 \n \n \n1.1± 0.4 \n \n \n0.0054 \n \n \nTable 3: \nQTL found by composite interval mapping. \nIn Peak LOD column * shows suggestive QTL, ** significant QTL. CI= Confidence \nInterval. Mb positions based on genome build NCBI m36. Direction & Dominance \nshows the allele that increases the phenotype i.e. the number of cells in the FACS \narea, together with the mode of inheritance (Add = Additive, Rec = Recessive, Dom = \nDominant). Candidate loci are shown in bold, candidate genes from in silico analyses \nin normal text. \n  \n 25 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFACS \nArea \nChrom. Pea\nk \n(cM\n) \nPeak \nLOD \n95% CI \n(cM) \nPhysic\nal \ninterva\nl (Mb) \nDirection \n& Mode \nCandidate \nLocus\/gene \n \n \n \n \n17 \n19 \n \n \n18.4 \n46 \n \n4.6** \n2.7* \n \n11-22.6 \n22-Tel \n \n25 – 43 \n24-Tel \n \nCBA Add \nCBA Rec \n \n \nHLA \n \n \n \n \n \n15 \n17 \n \n37.6 \n16.5 \n \n3.7** \n3.1* \n \n23.2 – 42.9 \n10.7-22.9 \n  \n55 – 75 \n23 - 44 \n \nBL6 Dom \nCBA Add \n \nSca-1\/Ly-6 \nHLA \n \n \n \n6 \n6 \n10 \n17 \n18 \n29.9 \n48 \n41.5 \n6.4 \n13.1 \n3.0* \n2.6* \n3.5** \n3.2* \n2.8* \n25.6-31.1 \n45.9-56.0 \n32.4 – 50.4 \nTel-16.5 \n7-21 \n51 - 74 \n104 - \n127 \n66 - 91 \nTel - 29 \n18 - 45  \nCBA Dom \nBL6 Add \nCBA Dom \nCBA Add \nCBA Rec \n \nCdca3, Cxcl12 \nTmpo, Spi-C, Itgb2 \n \nDay 35 CAFC,  \nFGF1, DSG2 \n \n \n \n"}