{"doi":"10.1080\/14616660412331303857","coreId":"102563","oai":"oai:epubs.surrey.ac.uk:2045","identifiers":["oai:epubs.surrey.ac.uk:2045","10.1080\/14616660412331303857"],"title":"Reasons for undergoing cosmetic surgery: a retrospective study.","authors":["Thorpe, S J","Ahmed, B","Steer, K"],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2004-08","abstract":"Reasons for undergoing elective plastic surgery were retrospectively explored with seven female postoperative participants aged 34-55, who were interviewed using semistructured interview format. Interviews were analysed using an adapted version of interpretative phenomenological analysis (e.g. Smith, 1996; Smith, Jarman and Osborn, 1999; Jarman, Smith and Walsh, 1997). The results of the analysis showed that the participants all experienced positive physical and psychological outcomes of surgery: several master themes were identified relating to their initial reasons for embarking upon surgery including ‘age appropriateness’, ‘body integrity’, and ‘wanting to look normal’. These themes are explored in relation to ideas prevalent in feminist and evolutionary psychology","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Taylor and Francis","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2045<\/identifier><datestamp>\n      2017-10-31T14:04:03Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:50737963686F6C6F6779<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2045\/<\/dc:relation><dc:title>\n        Reasons for undergoing cosmetic surgery: a retrospective study.<\/dc:title><dc:creator>\n        Thorpe, S J<\/dc:creator><dc:creator>\n        Ahmed, B<\/dc:creator><dc:creator>\n        Steer, K<\/dc:creator><dc:description>\n        Reasons for undergoing elective plastic surgery were retrospectively explored with seven female postoperative participants aged 34-55, who were interviewed using semistructured interview format. Interviews were analysed using an adapted version of interpretative phenomenological analysis (e.g. Smith, 1996; Smith, Jarman and Osborn, 1999; Jarman, Smith and Walsh, 1997). The results of the analysis showed that the participants all experienced positive physical and psychological outcomes of surgery: several master themes were identified relating to their initial reasons for embarking upon surgery including ‘age appropriateness’, ‘body integrity’, and ‘wanting to look normal’. These themes are explored in relation to ideas prevalent in feminist and evolutionary psychology.<\/dc:description><dc:publisher>\n        Taylor and Francis<\/dc:publisher><dc:date>\n        2004-08<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2045\/1\/cosmetic_surgery_2004.pdf<\/dc:identifier><dc:identifier>\n          Thorpe, S J, Ahmed, B and Steer, K  (2004) Reasons for undergoing cosmetic surgery: a retrospective study.   Sexualities, Evolution & Gender, 6 (2 & 3).  pp. 75-96.      <\/dc:identifier><dc:relation>\n        http:\/\/www.informaworld.com\/smpp\/content~content=a714592836~db=all~jumptype=rss<\/dc:relation><dc:relation>\n        10.1080\/14616660412331303857<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2045\/","http:\/\/www.informaworld.com\/smpp\/content~content=a714592836~db=all~jumptype=rss","10.1080\/14616660412331303857"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" 1\n \n \nReasons for undergoing cosmetic surgery: a retrospective study. \n \nS J Thorpe 1, B. Ahmed 2, K.Steer1. \n \n \n \n \n \n \n \n \n \n1University of Surrey    telephone:  01483 682916 \nDepartment of Psychology    fax:       01483 689553 \nSchool of Human Sciences   email:   s.thorpe@surrey.ac.uk \nGuildford \nSurrey  \nGU2 7XH \n \n2University East London   telephone:  020 8223 4106 \nSchool of Psychology    email:   b.ahmed@uel.ac.uk \nStratford Campus  \nUniversity House  \nRomford Rd \nLondon  \nE15 4LZ \n \n \n \n \nRunning Head: reasons for cosmetic surgery. \n \nKeywords: elective surgery, cosmetic surgery, motivation, decision, plastic surgery, body \nimage. \n 2\nABSTRACT \n \nReasons for undergoing elective plastic surgery were retrospectively explored with seven \nfemale postoperative participants aged 34-55, who were interviewed using a semi-\nstructured interview format.  Interviews were analysed using an adapted version of \ninterpretative phenomenological analysis (e.g. Smith, 1996; Smith, Jarman and Osborn, \n1999; Jarman, Smith and Walsh, 1997). The results of the analysis showed that the \nparticipants all experienced positive physical and psychological outcomes of surgery: \nseveral master themes were identified relating to their initial reasons for embarking upon \nsurgery including ‘age appropriateness’, ‘body integrity’, and ‘wanting to look normal’.  \nThese themes are explored in relation to ideas prevalent in feminist and evolutionary \npsychology.   \n 3\nINTRODUCTION \n \nAccording to the British Association of Plastic Surgeons, in 1998 65,000 people in the UK \nhad cosmetic surgery.  British men and women appear to be following the trend set in \nAmerica, where the American Society of Plastic and Reconstructive Surgeons reports that \nover 1.7 million people had cosmetic surgery in 2001 out of a total of 7.4 million cosmetic \nand reconstructive surgery patients (ASPS 2001).  These included face-lifts (124,531), \nbreast augmentation (219,883) and liposuction (275,463).  In addition, a further 5.8 million \npatients underwent non-surgical procedures, with 1.3 million for example having a \nchemical peel, 796,526 a collagen injection and 855,846 a Botox® injection.  Even these \nlarge numbers are underestimations of actual procedures carried out as they do not include \nthose carried out by general surgeons and other specialists.   In a sample from the Women’s \nHealth Australia study for instance, Schofield, Hussain and Loxton, (2002) report that 7% \nof the 14,100 women surveyed had had some kind of cosmetic surgery at some point in \ntheir lives. \n \nSome possible general, global reasons for this increasing demand for surgery are that \npeople in the Western world have larger disposable incomes, and that cosmetic surgery has \nlost the stigma that was previously attached to it due to pervasive media fascination with \n(and reporting of) celebrities who have had elective surgery.  Additionally, competitive \n 4\npricing from cosmetic surgery companies has allowed surgery to become a realistic option \nfor many more people (Davies and Sadgrove 1996). \n \nResearch suggests that plastic surgery can be of both physical and psychological benefit to \npatients, leading to an increase in self-esteem and confidence (Maltz 1981). However, \nMaltz, who was both a psychologist and a plastic surgeon, also observed that some \npatients’ self-esteem remained unchanged even after their physical appearance dramatically \nimproved.  In a review by Sarwer, Wadden, Pertschuk and Whitaker (1998) of ten studies \ninvestigating the psychological outcome of surgery using clinical interviews pre and post \noperatively, six reported generally positive effects, two reported negative effects and \nanother two reported mixed results or no change.   Of four studies using standardised \nmeasurements rather than interview, one showed a favourable change, two showed no \nchange and the last showed an increase in depressive symptoms in post operative patients \nwho had undergone a facelift.   \n \nSarwer, Wadden, Pertschuk, and Whitaker (1998) suggested that hitherto most research \nlooking at reasons for embarking on plastic surgery has been carried out because of \nsurgeons’ need to assess the psychological suitability of their patients for specific cosmetic \nprocedures.  These assessments can be divided into two types: clinical interviews and \npsychometric measures, both of which are attempts to assess psychopathology and \n 5\ntherefore screen out those people who have unrealistic expectations of the outcome of their \nsurgery or who are more generally ‘psychologically inappropriate for surgery’. (Sarwer et \nal. 1998 p.2).  They concluded that overall, a majority of patients seeking cosmetic surgery \ndo not suffer from serious psychological disturbance, though certain types of \npsychopathology may be related to specific cosmetic procedures.  In terms of postoperative \ninvestigations, where again the focus is on psychopathology or the psychological effects in \nterms of satisfaction and decrease in depressive symptomatology,  Sarwer et al. (1998) \nsuggest that the findings were less definitive:  clinical interviews tended to report more \nfavourable psychological outcome whilst standardized psychometric tests reported a more \nmixed outcome.  An overall criticism from the Sarwer et al. (1998) review was that none of \nthe studies looked at the relationship between cosmetic surgery and the patients' own body \nimage.  They propose a model of this relationship which takes into account a variety of \nfactors such as the physical reality of appearance, a range of psychological influences on \nbody image (such as perceptual, developmental and sociocultural influences and self \nesteem) and \"body image valence\" which considers the importance of ones self-esteem and \nthe actual degree of satisfaction with ones body.  Sarwer, Whitaker, Pertschuk and Wadden \n(1998) also suggest that a possible reason for the reported difference in research \nconclusions was that the interviews uncovered different and more subtle kinds of \nknowledge (including for instance higher levels of psychopathology) than did the tests.   \nThis in part forms the rationale of using interviews rather than questionnaires in the present \npaper \n 6\n \nThe approach adopted here has also been stimulated by the work of Gaete-Santender (1986) \nand Davies and Sadgrove (1996).  Gaete-Santender (1986) reported that in undergoing \nplastic surgery which alters or restores the patient’s external image, the patient may also \nexpect corresponding changes in mental images and in internal or external aspects of the \nself. The degree to which the patient’s outlook is changed by surgery depends on his or her \nexpectation and attitudes.  Davies and Sadgrove (1996) found that reasons for wishing to \nhave surgery included: to please a partner; to secure a partner or a job; wanting to look like \nsomeone else; and wishing to look ‘perfect’. These motivations for surgery, defined by \nDavies and Sadgrove (1996) as ‘unrealistic’ could lead to postoperative negative feelings, \nand to a lowering of self-confidence and self-esteem while realistic requests for surgery \ninclude wanting just an improvement in looks and accepting the limitations of surgery and \nsurgeons. These latter reasons for surgery would lead to higher feelings of well-being, self \nconfidence and self-esteem, reducing the perceived discrepancy between actual and ideal \nself. \n \nSo, the present study seeks to examine ideas around elective surgery in order to better \nunderstand possible motivational factors.  This is important because, as Maltz (1980) \nsuggests, if people request surgery for a perceived physical problem, when the motivation \nis actually a mismatch between how they perceive themselves and how they feel they ought \nto be, it is unlikely that surgery will resolve the problem.  \n 7\n \nIn order to explore these issues, it was decided here to use an inductively driven exploratory \nqualitative analysis.  Primarily, it was felt that such an analysis would also be useful - as \nindicated by Sarwer et al. (1998) - in examining the intricacies of the women’s accounts, \ntheir explanations of why they chose to have cosmetic surgery, their experiences of having \nsurgery, and how it affected their daily lives.  The qualitative approach chosen for these \nends was an adapted version of Interpretative Phenomenological Analysis (IPA) (e.g. \nSmith, 1996; Smith, Jarman and Osborn, 1999; Jarman, Smith and Walsh, 1997).  IPA aims \nto explore participants’ experiences from their own perspectives, but also acknowledges \nthat the analysis produced will be the researcher’s interpretations of the participant’s \nexperiences (see Willig, 2001).   \n \nResearch concerned with the psychological impact of plastic surgery can be broadly split \ninto two categories: the effects of elective\/cosmetic surgery (e.g. Sarwer, 1997; Sarwer, \nWadden and Pertschuk, 1998; Sarwer, Wadden, Pertschuk, and Whitaker 1998; Sarwer, \nWhitaker, Pertschuk and Wadden 1998; Askegaard, Gertsen and Langer 2002) and the \neffects of breast surgery following mastectomy (e.g. Hatcher, Fallowfield and A'Hern, \n2001; Taylor, Lamdan and Siegel 2002).  These studies have reported a number of findings \nregarding the psychological effects of such surgery, particularly in terms of body image \nsatisfaction and how this affects factors such as motivations for surgery and self esteem.  \nThe present study is concerned with the former group of patients and investigates the link \n 8\nbetween the motivational factors involved in elective\/cosmetic plastic surgery and its \noutcome as indicated by consequent psychological effects and self assessments. \n \nThe aim of the study therefore is to explore the participants’ understanding of their \nmotivation for choosing to have surgery in the light of their subsequent experiences.  \n \nMETHOD  \nParticipants. \nSeven female participants were recruited from the plastic surgery clinic in which the \ninterviewer worked as a nurse. They were aged 34-55 years old. All had experienced \nelective plastic surgery within the last seven years.  Table 1 shows their age and procedure \nundergone.  \n \nINSERT TABLE 1 ABOUT HERE \n \nInterviews \nThe interview schedule began by eliciting demographic information followed by questions \non the participant’s motivation to have surgery in line with Willig (2001)  Questions were \nasked about: how participants felt about their body image and appearance before and after \nsurgery; how the body parts they wished to change made them feel before surgery; how this \n 9\naffected their daily life; what their expectations of surgery were; how they thought surgery \nwould impact on them both physically and psychologically; how they thought they would \nlike their body to look, how far they felt their actual image fitted this ideal picture; and how \nthey felt about their bodies post surgery.  All interviews took place at the surgery in a \nprivate room.  With each participant's consent, the interviews were taped using a cassette \nrecorder.  The tapes of the interviews were then transcribed verbatim. \n \nAnalysis \nThe analysis was inductively rather than theoretically driven and was an exploration of the \npersonal meaning of embarking upon cosmetic surgery to those who had undergone it.  An \nadapted version of Interpretative Phenomenological Analysis (IPA) was employed as the \nmethod of analysis (Smith, 1996; Smith, Jarman and Osborn, 1999; Jarman, Smith and \nWalsh, 1997).  Each participant's interview transcript was read and re-read and notes were \nmade to reflect initial thoughts and observations.  In the next stage of analysis, themes that \ncharacterised each section of the transcript were identified and labelled.  The function of \nthese theme labels was to capture something about the \"essential quality of what is \nrepresented by the text\" (Willig, 2001, p.55).  The next stage of the analysis involved \nlooking for similarities across these themes to see how they related to each other and \nformed clusters of concepts.  This was done for each interview transcript.  The final stage \ninvolved looking at all the transcripts together and examining all the themes and clusters \nidentified to see if any master themes emerged which were felt to reflect the participants \n 10\nshared experiences of having plastic surgery.  This process continued until no new themes \ncould be identified.  However, only those themes which offer new insights, are in line with \nthe aims of the study are reported here.   \n \nAll three investigators participated in the process.  To ensure validity, the transcripts were \ninitially read by one author who identified some possible themes.  Another author then \nreread the transcripts, identifying themes and comparing these to the initial reading.  At this \nstage some were refined, others discarded.  Finally, as a final check on the validity of the \nthematic interpretation, the transcripts were read by the final member of the team and \ninterpretations corroborated.  The investigators came from a range of theoretical \nbackgrounds and the analysis was done as far as possible without prejudice although having \nthese different theoretical backgrounds did of course inform our judgement and sensitised \nus to different aspects of the analysis \n \nResults and Discussion of Analysis: \nThe analysis of the data revealed a number of master themes which were thought to reflect \nthe participants shared understandings of their motivations for and experiences of having \nplastic surgery.  Four of these themes are presented here.  What is interesting about these \naccounts is how the participants conceptualized their feelings about their body  its \npsychological affects, their rationale for surgery and subsequent mood change.  Some of \nthese themes clearly refer to how participants felt they ought to look in comparison to how \n 11\nthey actually looked.  Often participants clearly articulated that they were aware of \ndiscrepancies between these perceptions and that this led to their initial impulse to have \nsurgery.   \n \nThemes \nAge appropriateness \nMany of the women talked about age as an issue when discussing why they wanted \ncosmetic surgery.  Some of them described how the body parts they wished to change made \nthem both appear, and feel, older than they actually were \n \n Extract 1: \n MLH: I thought I looked older than I actually was, and it sort of came to a head \nwhen I was getting offered concession with, you know, the OAP concessions and I \nsat at the bus-stop with an old lady, who obviously was an old lady, and she was \ntalking about something or other, and she said “people like us” and I thought “hell, \nshe must be at least twenty years older than I” and yet she looked at me and saw an \nold woman” . \n \nIn this first extract, MLH describes how an “old lady” assumes that she, MLH, is similarly \nold because of her appearance.  MLH is clearly bewildered by this as she feels she ought \nnot to be perceived in this way, indicating she has a strong sense of how she should look for \n 12\nher age which is apparently challenged by others’ perceptions of her, in this case by \nsomeone whom she considers  “obviously” old.  This in turn illustrates what MLH, feels \nthat she should not look like: before surgery she looked older than she should have and the \nfact that someone else also perceived this to be the case too, reinforced her perceptions of a \nmismatch.  Presumably this is a problem because she looks older than she should rather \nthan younger, and her expectations of what an ‘old lady’  looks like do not tally with her \nview of how she should look, though her ideas about this seem to be somewhat \nstereotypical.    \n \nOther women actually expressed a desire to look more like their younger selves: \nExtract 2 \nJG: …I was beginning to age, I'd always looked after myself and I sort of felt \neverything was sagging a little bit and I didn't look quite as youthful as before..  \n \nExtract 3: \nMH: …since the rhinoplasty, I have gone forward with upper and lower eyelid fat \nand bag removal and I’ve had endoscopic on the face as well, which really is only \nbecause I’m in my early fifties and now that I’ve got this joy of not having an awful \nnose on my face, I felt I deserve a few years left of looking more confident and \nyounger. So do I think that the nose led me onto the other? Not particularly, I would \nhave probably gone with it anyway, because I’ve just married a younger man and \n 13\nthat is part of my reason why I’ve gone for facial, bagging removal or whatever. \nI’ve very, very happy with the results . \n \nJG in extract 2, expresses a common concern: that she feels she was “beginning to age” \nwhich became cause for concern, an idea which suggests that people aren’t aging \ncontinuously but rather there is a certain point at which they “begin” to age, presumably \nwhen they begin to look older, indicated by changes in appearance.  It is at the “beginning” \nof this aging process that JG began to be concerned about her changing appearance.  She \nstates that she “didn’t look quite as youthful as before” demonstrating how she felt she once \nlooked younger and suggesting that she wanted to continue looking more “youthful” \ndespite no longer being young. MH, in extract 3, similarly expresses a desire to continue to \nlook more youthful: “I deserve a few years of looking more confident and younger”, \nsuggesting that a youthful appearance is coupled with a more confident personality – this \nconnection between appearance and personality type is referred to several times and is \ndiscussed again below.  This is further substantiated by her explanation that she had further \nsurgery to make herself look younger, not solely as a result of surgery she had already \nundergone, and which is the subject of this particular interview, but because she had \nmarried a younger man and this was part of her motivation for more surgery.  Both of these \nextracts also illustrate the fact that participants felt they had in some way earned the right to \nlook younger, either because they had looked after themselves, or because they had in some \nway been cheated of a carefree youth by the presence of a despised body part.  Both of \n 14\nthese opinions imply some sort of previous suffering which is balanced out by the reward \nof the surgery’s effects, or that they feel a sense of entitlement which has been thwarted.  \nAge is a punishment which they don’t yet deserve.  Combined with this is a sense that age \nhas come upon them too soon (in developmental terms) and that it has sparked a sense of \ncrisis.  Feminist theorists are well acquainted with this phenomenon – as Jane Ussher \n(1993) puts it ‘This advent of ageing is experienced as a crisis by many women: a crisis \nwhich is not experienced in the same way as men….our images of ‘ideal women’, against \nwhom all women are judged and against which we judge ourselves, are primarily of young, \nslim, able-bodied, heterosexual, attractive women’. (Ussher, 1993, 116).  This is further \nreinforced by MLH who after surgery feels that instead of this sudden descent into old age \nnow ‘there’s a sort of steady decline’. \n \nOverall, the women construct the idea of body image as if they should always look like a \nparticular age, an ideal standard not subject to the universal aging process.  Additionally,a \nsub-theme is the desire to look younger, illustrated by JG and MH in extracts 2 and 3. This \nis different from the desire to simply look the age that you actually are.  Either way, it \nillustrates a desire in these women for their looks to match a desired age – whether that is \ntheir actual age or an age younger than their present age. More particularly, an age where \nthey do not look old, or at least not any older than they feel they ought to look.   This may \nbe at least in part influenced by the fact that cultural standards for how we should look at 45 \nand 50 have changed radically in the last 20 years. Bordo (1993) for instance cites Cher as \n 15\nan exemplar of this who (at the time) looked much younger at 40 than she did at 46.  Bordo \nalso went on to claim that rather than being a liberating tool for older women, cosmetic \nsurgery has merely established a ‘new norm …in which the surface of the female body \nceases to age physically as the body grows chronologically older’ (Bordo 1993, p26) This \ndesire to attain a mythical standard of youthfulness or for the reduction a perceived \ndiscrepancy between looks and age is related to the next theme and is explicitly stated in \nsome of the extracts, particularly those of MLH.. \n \nBody integrity \nMany of the women talked about the importance of body integrity.  In particular, what \nseemed a common comment was how the particular body part they wished to changed \ndidn't ‘fit’ with the rest of their body.   \n \nExtract 4: \nMLH: I felt old, but only felt old from the neck up.  My body’s all right, in quite \ngood nick, I’m not overweight, I’m reasonably fit. I felt that my face did not belong \nto the rest of my body.  I had a 65-year-old face on a 55-year-old body.  \n \nIn this extract, MLH refers to what could be argued are cultural ideas about how bodies \nshould or ought to look in terms of weight and fitness and relates it to age, again \ndemonstrating another facet to the \"age appropriateness\" theme. However, more \n 16\nspecifically she talks about the lack of “fit” between those parts of her body she feels are \nage appropriate and those that are not, i.e. those parts of her body that are older looking – in \nthis case her face.  The discrepancy in this case is one of internal consistency: a mismatch \nbetween the subjective sense of how one looks and how one should look \n \nOften, comments about lack of body integrity by these women were verified by statements \nabout how their bodies did not 'fit together' pre surgery …’mainly my proportions…they \nwere...well; they just weren’t in proportion’ (ES) but did so post surgery. \n \nExtract 5: \nMLH: I now feel  that I'm all of a piece, that the head, that the sort of head isn't \ndivorced from the body, that I actually fit, that I've now got the face that fits the rest \nof me.  \n \nExtract 6: \nES: .. I just see the rest of my body as one single body, whereas before, I would see \nmy body, and I would see my breasts, my breasts weren't part of my body, they \ndidn’t need to be there, I didn’t need them to be like that, and I just you know, I had \nthis kind of self-loathing thing going on, they just weren’t part of me, whereas now, \nmy body is just my body and it’s got a pair of boobs on it and that’s it the same as \n 17\nanybody else’s and it’s just so matter of fact and not really an issue or anything now \n. \nExtract 7: \nJR: I can’t do anything about legs, I can’t make them six inches longer, I accepted \nthat many years ago!  It’s just wishful thinking, I feel like I’m in proportion now for \nwhat I am, quite small but with a long body and shorter legs, but having a bust takes \nthe emphasis off the legs, you see, people do notice it, not in a cartoon character sort \nof way, but men especially seem to notice, but women ask “are they your own?” and \nI always say “yes, of course” I’m so pleased with them now. \n \nThe idea of ‘fit’ and proportion is also echoed in IN’s response \n \nExtract 8: \nIN: My breasts were just too big.  I didn’t want to be any different to how I had \nbeen up to until I was 40, I was quite happy with myself, what I couldn’t cope with \nwas the fact that my breasts grew, between when I was 40 and until it was that I had \nsurgery, they grew and almost doubled in size in those 3 or 4 years. \n \nIn these extracts we can see examples of how these particular women place a great deal of \nemphasis on feeling that all parts of the body felt ‘integrated’ post surgery. ES related this \nto the idea of ‘normality’ which she constructs as looking like “anybody else’s”.  She \n 18\nsuggests that it affected her psychologically in an adverse way when she thought her body \nwasn’t integrated (“I had this kind of self-loathing”) and that now, her body has become so \nnormal its “not really an issue or anything now”  JR’s response is similar to the others, \ndespite her history being different (she had previously had a lump removed from her \nbreast). \n  \nThis idea of symmetry is one often examined in evolutionary psychology, associated as it is \nwith indicators of health and youth (Campbell, 2002).  The importance of facial asymmetry \nin particular has been studied extensively in relation to attractiveness (e.g. Thornhill and \nGangestad, 1993, 1994)..  This theme of proportion, symmetry and physical integrity is \nrelated to the next master theme: \n \nWanting to look normal \nSome of the women made reference to wanting to look \"normal\" or to somehow fit in with \nsome notional idea of normality, or how \"everybody else\" looks, again how they felt they \nshould\/ought to look. \n \nExtract 9: \nCP;:  Well I’m happy now, obviously I’m not perfect, I never expected to be, and \ndon’t think I ever will be, my breasts are normal looking, they don’t look false or \nanything like that and you can’t really tell that I’ve had implants done, because I’m \n 19\nin proportion, I haven’t gone massively big, like a, um, a glamour model or \nanything like that, they're just normal, I'm just a normal person now [post-surgery], \nwith a normal body . \n \nExtract 10: \nES: Well physically I thought it [breast surgery] would re-shape my breasts, make \nme more in proportion and make me more like everybody else.  I didn't want to be \nthe one that was different . \n \nThere is a suggestion in both extracts 9 and 10, that there is some kind of objective \nnormality in terms of body image.  In extract 9, CP constructs her idea of normality by \ncontrasting it to the idea of perfection (“I’m not perfect”) and further defines it in the case \nof her breast size as the idea of being “in proportion”.  Similarly ES also talks about being \n“more in proportions” but also so she can be “more like everybody else”.  This does not \nnecessarily mean that all the women have the same idea of what “normality” might be.  \nRather, the commonality here is that they construct their experiences of their body image as \nif there is such a thing as an objectively normal body image, and that their bodies, pre-\nsurgery, did not conform to this standard.  Once they had the surgery this discrepancy was \nsignificantly reduced. CP further constructs the idea of normality: it is not “massively big, \nlike a, um, a glamour model” but a size which makes her ‘look back in proportion again’.  \nPost surgery she now feels “they’re just normal” whereas before – as she remarked \n 20\nelsewhere in the interview- she felt as if they were ‘the breasts of an 84 year old’, a \nstatement which also relates to the theme of age appropriateness.  ES also clearly expresses \nher desire to look like “everybody else” and to not be noticeably different, goals which she \nfeels the surgery has achieved.  MH has felt so outwith normal bounds that she has been \nextremely self conscious in all situations because of this  perceived divergence from the \nnorm. \n \nExtract 11: \nMH: Even sitting in the car at the traffic lights, when there’s three lanes, if I was in \nthe middle lane when a car would be each side of me, level with me, …I was always \nconvinced in my own mind that people were looking at my nose.  I would make \nsure I was always back in queues, any queues, whether walking, um….waiting to \nget a drink in a bar, er, sitting at a table in a restaurant in close proximity to others, \nstanding in a group talking, when it came time for my say, I wouldn’t because other \npeople would look at me in profile… so it actually affected my whole attitude to \nsocially being with people and even those times just sitting in a car!  \n \nThis wish to appear to be normal is in line with the findings of Davies (2003) who found \nthat the women she talked to who were undergoing cosmetic surgery wanted to be \n‘ordinary’, and ‘just like everyone else’ (page 77), and that the bit of their body which just \ndidn’t fit in with the rest of it had to be changed.  Again, the discrepancy here can be \n 21\nconceptualised in terms of inconsistency with perceived external norms; although these \nmay be the views of the externalised self or internalised others. \n \nThese three themes: \"age appropriateness', \"body integrity” and “wanting to look normal\" \ncould be considered in terms of the women describing and making sense of how they felt \nthey ought to or should look, from the perspective of a personalised, idealised standard.  \nThe women describe their bodies in relation to how they felt they ought to look in relation \nto these three interlinking themes of age, body integrity and normality. They construct their \nbeliefs from what could be argued are culturally created norms of body image, cultural \nnorms which may have their root in adaptive processes to do with sexual selection \n(Anderson, Crawford, Nadeau and Lindberg, 1992,  Barber, 1995, Miller, 2000) .  In \nparticular, they make reference to normative understandings of body image in terms of age: \nthere were two dimensions to this.  Firstly that women should look a certain way at a \nparticular age and secondly that there was a particular quality of appearance that they \naspired to.  This was linked with an age younger that their own. It was also clear that a \nfurther motivation for plastic surgery was when their chronological age and their perception \nof how old they looked were significantly different.  All of these ideas allude to some kind \nof universal, purportedly objective idea about body image, about how it ought to or should \nlook, but also how it should look in the ideal, an ideal which isn’t necessarily ‘perfect’ but \njust ‘normal’.  However, underlying all these themes is how the women felt about \nthemselves psychologically \n 22\n \nPsychological factors \nAll of the women talked about themselves either in terms of lack of confidence, \nunhappiness or low self esteem before the surgery and the subsequent beneficial impact of \nsurgery on these afterwards.  They talked about both their image of their bodies and of their \nphysical bodies..  They often used language which was relatively sophisticated in its use of \npsychological terms, referring for example to the concepts of self esteem and mood state.   \nThree sub-themes were identified and are outlined below: self confidence and self esteem; \nmood and the discounting of it in terms of psychopathology; and the perception of a \ndiscrepancy between personality and body image.  \n \nExtract 12: \nMLH: It's [surgery] done wonders with my sort of general confidence in myself, my \nself esteem, it’s this self-esteem bit, this self image thing, it's actually done a lot for \nthat. \n \nExtract 13: \nJG: but mentally it [having surgery] was more to feel good and be more confident.  \n \nExtract 14: \n 23\nIN: I would feel really under-confident and my self esteem would be very low….I \nwas quite happy with my self image until I changed and now it’s back to how I was \nbefore.  \n \nHere they infer a direct causal link between the surgery and their improved psychological \nstate.  IN makes the connection explicit.  This is a relatively unsophisticated view as they \ndo not appear take into account the fact that their initial appraisals may have been overly \nnegative and that it is the perception of themselves which may possibly be at the root of \ntheir unhappiness with their appearance.  After surgery this seems to become clearer:  MH \nfor example articulated this….’it’s kind of my self image versus what others might \nsee….how I was myself was a direct result of how I thought others saw me’.  I \n \nSome of the women were also clear to make a distinction between how their body \ndissatisfaction led to them feeling unhappy rather than depressed.  They were anxious to \nemphasize that they were not suffering from some kind of psychological disorder: \n \nExtract 15: \nMLH: I wasn't depressed, I was just unhappy  \n \nExtract 16; \nKS: How did this [body image pre-surgery] make you feel? \n 24\nJG: A bit, not depressed at all, just a little bit sad that I was beginning to age that's \nall \n \nExtract 17 \nI felt….unhappy with the way I looked.  I’d lost confidence; I found that I was even \nwalking like an old lady. \n \nThis is a clear articulation of the feeling that their motivations for surgery did not stem from \na psychopathological view of themselves and their bodies.  Extract 17 is also linked to the \nthird sub theme, indicating that their perceived physical anomaly was pervading their \npersonality and subverting it in a way which they felt did not sit with who they were.   That \ntheir bodies did not match their personalities. \n \nSome of the women actually talked about a discrepancy between their normal personality \nand the personality they exuded while burdened by what they believe is their physical \nabnormality.  They were also aware of the kind of impression their body made on others in \nrelation to assumptions about their personality traits: both these beliefs may lead to a \nmismatch of perceptions of their psychological and physical selves. \n \n \n \n 25\nExtract 18: \nMH: So I've been a bit withdrawn, and it's not my personality to be withdrawn. I \nwas like, not leading a double life, but many times I’d want to be in the front, or \nspeaking out, but I wouldn’t, because I didn’t want people staring at me.  \n \nExtract 19: \nES: I had a size of breast that I thought would suit my overall shape and one that I \nthought would fit in with me as who I saw me as, not a big-busted person….. Some \nof the big-breasted friends I have, they used to revel in having this attention, focus \nthing that they could flaunt, and that is who they were, they liked being the centre of \nattention they liked all that, but I didn’t like that, I didn’t want that. I wanted to be \nthe same as everyone else in the road, but I wasn’t, the same as everyone else in the \nclass, but I wasn’t, because of these horrendous size boobs and that’s what was on \nmy mind all the time.  \n \nIn extract 18, MH states that due to the way her body (nose) was before surgery that this \nactually made her feel “withdrawn” and less confident as she felt others would see her and \nstare at her because of her appearance.  This would make her feel embarrassed and make \nher feel lacking in confidence in public. ES similarly talks about how her body shape \naffected her personality, however - in contrast to MH - she described her body shape as \ncausing her to be perceived as having a certain type of personality: that of a “a big-busted \n 26\nperson”.  She articulates what this personality is by describing her friends who do have \nlarge breasts and how their behaviour is indicative of a certain kind of personality where \nthey “revel in having this attention, focus thing that they could flaunt, and that is who they \nwere, they liked being the centre of attention they liked all that, but I didn’t like that, I \ndidn’t want that”. This clearly suggests that she felt this kind of behaviour was ego \ndystonic, that it did not fit with her personality and therefore that her body should change to \nbecome more in line with the rest of her personality characteristics..  So in addition to \nachieving physical integrity (see earlier theme) she also wanted to achieve a physical and \npsychological integrity through surgery.  This ties in very closely with early psychoanalytic \ntheorists and with Fisher’s (1990)  ideas of the physical body as a corporeal representation \nof the self . \n \nOverall, there was a clear expression of how most of these women experienced negative \npsychological states, whether in terms of direct psychological discomfort caused by their \nnegative body image or discomfort caused by inappropriate perceptions about their \npersonality.  Additionally, they were affected by the large discrepancy between how they \nfelt they ought to look and how they actually did look before surgery.  This appears to have \nbeen at least part of the reason they were motivated to have the surgery.  Along with this \nthere were clear indications of how these discrepancies were attenuated, and psychological \nstates improved, after surgery \n \n 27\nConclusion \nThis study has attempted to explore the experience of women undergoing cosmetic surgery, \nusing IPA as an exploratory method of analysis.  In particular, we tried not to have any \npreconceived ideas about the kinds of reasons the women might give for undergoing such a \ncostly and painful procedure, and as far as was possible let the data inductively drive the \ndirection of the analysis.   \n \nSeveral themes were identified which were common to several of the participants and \nwhich may be widespread  motivational factors for those seeking surgery.  Themes were \nbroadly concerned with reducing a perceived discrepancy between what the participants \nthought they should look like and what they felt they ought to look like for reasons to do \nwith age appropriateness, body integrity, normalisation and – more generally – \npsychological well-being.  \n \nSome of the above can be explained in terms of Self-Discrepancy theory as proposed by \nDuval and Wicklund (1972) and expanded by Higgins and colleagues (Higgins, Klein, and \nStrauman, 1985; Higgins, Strauman, and Klein 1986; Higgins, Klein, and Strauman, 1987; \nHiggins,1987).  These theories predict that when people focus their attention on themselves \nas an object, they make active comparisons between their actual self and ideal self. The \ndiscrepancy between this actual self and ideal self acts as a ‘self guide’ and increases \nmotivation and effort to bring actual in line with ideal. Duval and Wicklund (1972) for \n 28\ninstance reported that individuals become increasingly dissatisfied or disappointed with \nthemselves as they focus on their actual-self: ideal-self discrepancy and that this motivates \nthem to act to try to reduce the perceived discrepancy.   \n \nIn all cases, removing the perceived discrepancy resulted in an improvement in mood, \nwhich was generally lower before surgery than it was after.  Although these discrepancies \nwere often self-referential, we found that this was not always the case and that our \nparticipants were also concerned with the (hypothesised) perceptions of others.  \nNevertheless, there is clear evidence to support the claim that there was a tendency to be \nless concerned with how other people felt they ought to look than with how they \nthemselves measured up to their own standard.    \n \nOne of the many points of interest is the theme which emerged relating to body integrity, in \nwhich the discrepancy itself is embodied; part of the physical body was itself seen as \ndiscrepant in relation to the rest of the body, as if it didn’t somehow fit, or didn’t belong.   \nThis continued into another master theme:  a desire to look like everyone else, normal, as \nopposed to some idealised standard.  Their perception of their bodies is almost as if their \nparticular physical failing has meant that they do not belong with the rest of society, as if \nthey themselves were some sort of corporeal anomaly in the same way that their breasts, for \ninstance, did not belong with the rest of them.  Young (1990) has suggested that oppressed \ngroups (including women, homosexuals, ethnic minorities, the disabled, the obese) through \n 29\na process of the ‘aesthetic scaling of bodies’ feel ‘ugly, fearful or loathsome’ (Young 1990, \n123-124) and as a consequence of feeling under pressure to appear ‘normal’ go to great \nlengths to achieve this.  Davis (2003) suggests that in a society where feminine beauty is \nidealised, this ‘specifically structures the dynamics of gender oppression, rendering \nordinary-looking women ugly and deficient and trapping them into the hopeless race for a \nperfect body’ (Davis 2003, 5-6).  Though there is no evidence from the interviews here that \nthe search is for perfection, there is certainly a sense that, pre surgery,  some of the women \nfelt that they were outwith societal norms and in some cases really did feel ‘ugly, fearful \nand loathsome’ \n \nAll of the participants felt happier with themselves after surgery.  Many of the women felt \nthat their bodies did not previously match up to their age, making them appear older than \nthey really were, or they expressed a desire to actually look younger than they were.  They \nalso felt that there was a ’norm’ in terms of age which they wished to achieve and the loss \nof which made them unhappy.  They also expressed awareness of a mismatch between their \nperceptions of themselves in terms of personality and physicality as well as between how \nthey felt they ought to look and how they actually looked.  Great emphasis is placed on \nlooking ‘normal’ and ‘in proportion’.  However, unlike the Davies and Sadgrove (1996) \nstudy, there was little evidence to suggest that participants underwent the procedure to \nplease a partner, to get a job or to look perfect. \n \n 30\nThe present findings provide useful insights into the kinds of concerns which drive people \nto undertake such a painful and costly treatment. In the future it could be of interest to \ninclude interviews both pre and post operatively, as it is one of the limitations of this study \nthat the perspective of the participants may have changed over time and that this could not \nbe examined.  In addition, this group was unanimously positive about the effects of surgery \n– it is another limitation of this study that that is the case: it would be useful if future \nresearch could explore the psychological and emotional outcomes of surgery which is \nperceived to have failed to reduce discrepancies, or which has exacerbated them.  Future \nresearch might also be aided by a more discursive analysis of both pre and post operative \ninterview data, which may be useful in identifying discourses about body image, how these \nare socially constructed and the kinds of function that they serve.   \n \nThe sample of participants in the present study is also less that ideal in that the age range \nstraddles both late youth and early middle age.  People belonging to different age \ncategories, with those at pre, peri and post menopausal stages likely to have different \nexpectations of their physical selves, and different needs in terms of optimising the fit \nbetween their perceptions of their actual physical shape compared to the idealised.  \nAdditionally, the sample is composed of three women whose dissatisfactions lie with their \nfacial appearance, and four women whose dissatisfactions are with their breasts: this study \nhas not examined the possibly different meaning of different parts of the body to the \nparticipants. \n 31\n \nTheoretically, the themes identified here resonate with ideas from a range of psychological \napproaches.  Evolutionary psychology for example would predict that themes relating to the \nimportance of facial and body symmetry and the kinds of proportions likely to be most \ndesirable in the human form (e.g. Hughes and Gallup, 2003; Streeter and McBurney, 2003) \nalong with youthfulness, would be central in the experience of those women trying to \nchange their appearance.  Feminist psychology might predict that women would feel \nsocietal pressures to have a particular kind of look – young, compliant and nubile but not \noutlandish (Grogan, 1999) or that cosmetic surgery is a self-inflicted submission of the self \nto an imposed system of beauty (Morgan 1991), though Davis (1995) suggests that surgery \nis ‘a way to reinstate a damaged sense of self and become who they really are or should \nhave been’ (1995:169).  This is born out by the data presented here – the women want to be \n‘normal’, not beautiful.  This also resonates to some extent with Self Discrepancy theory \n(Higgins, Strauman and Klein, 1986; Higgins 1987; Snyder, 1997) which would predict \nthat if there is a gap between the way women feel they actually look and how they ideally \nought to look, then there might be a drive to reduce this discrepancy and a concomitant \nalleviation of anxiety when this was accomplished.  None of these are exclusively \nexplicative of the rise in cosmetic surgery but may help to understand motivational factors.  \nHumans have always had the desire to change their bodies- archaeological and paleological \nevidence tells us that: all that may have changed is that now we appear to have much more \nopportunity to do so, and possibly to do so more radically.  What is clear however is that \n 32\nexamining discourses around women’s perception of themselves in relation to cosmetic \nsurgery benefits from an integrated set of psychological approaches and in itself is a useful \nsubject for such integration.  \n \nReferences. \n \nAmerican Society of Plastic Surgeons (ASPS) (2001).  Plastic surgery information service.  \nURL: http:\/\/www.plasticsurgery.org \n \nAnderson, J.L., Crawford, C.B., Nadeau, J. and Lindberg, T. (1992).Was the Duchess of \nWindsor right?  A cross-cultural study of the socioecology of ideals of female body shape.  \nEthology and Sociobiology, 13,  197-227. \n \n Askegaard, S., Gertsen, M. C. and Langer, R  (2002) The body consumed: Reflexivity and \ncosmetic surgery. Psychology & Marketing, 19, 793-812 Special Issue: Scandinavian \nexperiences.   \n \nBarber, N. (1995) The evolutionary psychology of physical attractiveness: sexual selection \nand human morphology.  Ethology and Sociobiology, 16, 395-424. \n \nBritish Association of Plastic Surgeons (BAPS). (2002) URL http:\/\/www.baps.co.uk \n 33\n \nBordo, S. (1993) Unbearable Weight: Feminism, culture and the body. London:Universty \nof California Press. \n \nCampbell, A. (2002) A Mind if her Own: the evolutionary psychology of women Oxford \nUniversity Press. \n \nDavies, D. and Sadgrove, J. (1996). Safe Cosmetic Surgery, a Complete Guide. London: \nMetro Books. \n \nDavis, K (1995) Reshaping the female body: the dilemma of cosmetic surgery.  London: \nRoutledge. \n \nDavis, K. (2003).  Dubious Equalities and embodied differences: cultural studies on \ncosmetic surgery.  Oxford: Rowman and Littlefield. \n \nDuval, S. and Wicklund, R.A. (1972). A Theory of Objective Self-Awareness.  New York: \nAcademic Press \n \n 34\nFisher, S. (1990).  The Evolution of psychological concepts about the body: in T.F. Cash \nand T. Pruzinsky (Eds) Development, Deviance and Change (pp 3-20). New York: Guilford \nPress. \n \nGaete-Santander, S. (1986). Psychiatry and Plastic surgery. Revista Cilena de Neuro \nPaquiatra.  21, 105-110. \n \nGrogan, S (1999)  Body Image: Understanding body dissatisfaction in men, women and \nchildren.   London: Routledge \n \n \nHatcher, M. B, Fallowfield, L., A'Hern, R. (2001) The psychosocial impact of bilateral \nprophylactic mastectomy: Prospective study using questionnaires and semi-structured \ninterviews.  British Medical Journal,  322,  76.  \n \nHiggins, E. T. (1987) Self-Discrepancy: A Theory Relating Self and Affect.  Psychological \nReview. 1987, Vol. 94, No. 3, 319-340. \n \nHiggins, E. T. (1999) Self-discrepancy: A theory relating self and affect. In Baumeister, \nRoy F. (Ed); The self in social psychology. pp. 150-181.  \n \n 35\nHiggins, E.T., Klein, R and Strauman, T. (1985).  Self-concept discrepancy theory: A \npsychological model for distinguishing among different aspects of depression and anxiety.  \nSocial Cognition, 3, 51-76. \n \nHiggins, E.T., Klein, R. and Strauman, T. (1987).  Self-discrepancies: Distinguishing \namong self-states, self-state conflicts, and emotional vulnerabilities.  In K.M. Yardley and \nT.M.Honess (Eds.), Self and Identity: Psychosocial Perspectives (pp 173-186).  New York: \nWiley. \n \nHiggins, E.T., Strauman, T. and Klein, R. (1986).  Standards and the process of self \nevaluation: Multiple affects from multiple stages.  In R.M.Sorrentino and E.T.Higgins \n(Eds.), Handbook of motivation and cognition: Foundations of Social Behavior (pp.23-63).  \nNew York:Guilford Press. \n \nHughes, S.M.  & Gallup, G. G (2003) Sex differences in morphological predictors of sexual \nbehavior: Shoulder to hip and waist to hip ratios.  Evolution and Human Behavior, 24 ,173-\n178 \n \nJarman, M., Smith, J. A. and Walsh, S. (1997)  The psychological battle for control: A \nqualitative study of healthcare professional’s understanding of the treatment of anorexia \nnervosa.  Journal of Community and Applied Social Psychology, 7, 137-52 \n 36\nMaltz, M. (1981) Psycho-cybernetics. Harper Collins: New York. \n \nMiller, G. (2000)  The Mating Mind.  London: Heinemann. \n \nMorgan, K.P. (1991).  Women and the Knife: Cosmetic Surgery and the Colonization of \nWomen’s Bodies.  Hypatia, 6, 25-53. \n \nSarwer, D. B. (1997). The 'obsessive' cosmetic surgery patient: A consideration of body \nimage dissatisfaction and body dysmorphic disorder.  Plastic Surgical Nursing, 17, 193-\n197.  \n \nSarwer, D. B., Wadden, T. A., & Pertschuk, M. J. (1998). Body image dissatisfaction and \nbody dysmorphic disorder in 100 cosmetic surgery patients. Plastic & Reconstructive \nSurgery, 101, 1644-1649.   \n \nSarwer, D. B., Wadden, T. A., Pertschuk, M. J., & Whitaker, L. A. (1998). The psychology \nof cosmetic surgery: A review and reconceptualization. Clinical Psychology Review, 18, 1-\n22.  \n \n 37\nSarwer, D. B., Whitaker, L. A., Pertschuk, M. J., & Wadden, T. A. (1998). Body image \nconcerns of reconstructive surgery patients: An under-recognized problem.  Annals of \nPlastic Surgery, 40, 403-407.  \n \nSchofield, M., Hussain, R. and Loxton, D (2002) Psychosocial and health behavioural \ncovariates of cosmetic surgery: Women's Health Australia study. Journal of Health \nPsychology,  7, 445-457. \n \nSmith, J.A. (1996).  Beyond the divide between cognition and discourse: Using \ninterpretative phenomenonological analysis in health psychology.  Psychology and Health, \n11, 261-271 \n \nSmith, J.A., Jarman, M. and Osborn, M. (1999).  Doing interpretative phenomenonological \nanalysis.  In M. Murray and K. Chamberlain (Eds.) Qualitative Health Psychology: \nTheories and Methods, pp 218-240..  London:Sage,  \n \nSnyder,R. (1997).  Self-discrepancy theory, standards for body evaluation, and eating \ndisorder symptomatology among college women.  Women and Health, 26, 69-84. \n \n 38\nStreeter, S.A. &. McBurney, D.H. (2003) Waist–hip ratio and attractiveness: New evidence \nand a critique of \"a critical test\",  Evolution and human Behavior, 24 88-98. \n \nTaylor, K. L., Lamdan, R. M. and Siegel, J .E. (2002) Treatment regimen, sexual \nattractiveness concerns and psychological adjustment among African American breast \ncancer patients.  Psycho-Oncology, 11, 505-517.  \n \nThornhill, R. and Gangestad, S.W. (1993). Human facial beauty: Averageness, symmetry \nand parasite resistance. Human Nature 4,  237—269. \n \nThornhill, R. and Gangestad, S.W. (1994). Fluctuating asymmetry correlates with lifetime \nsex partner numbers and age at first sex in Homo sapiens. Psychological Science 5, 297—\n302. \n \nUssher, J. (1993).  The Psychology of the Female Body.  London:Routledge  \n \nWillig, C. (2001) Introducing Qualitative Research in Psychology:  Adventures in theory \nand method. Open University Press. \n \nYoung, I. M.  (1990).  Justice and the politics of difference.  Princeton: Princeton \nUniversity Press. \n 39\nTable 1.  Participant age and procedure undergone. \nParticipant1 Age Type of surgery \nMLH 55 Full face carbon dioxide laser resurfacing \nMH 52 Rhinoplasty (nose surgery) \nJG 50 Full face-lift and belpharoplasty ( removal of excess eyelid \nskin) \nES 36 Breast reduction \nIN 42 Breast reduction \nCP 34 Breast augmentation (implant surgery) \nJR 49 Breast augmentation following previous lumpectomy (removal \nof breast lump) which had resulted in misshapen breast \n1 All names have been changed to codes to assure anonymity \n \n                                                 \n \n"}