{"doi":"10.1016\/s0029-7844(01)01577-0","coreId":"17523","oai":"oai:mlpa.nottingham.ac.uk.OAI2:10","identifiers":["oai:mlpa.nottingham.ac.uk.OAI2:10","10.1016\/s0029-7844(01)01577-0"],"title":"Lights, Camera: Fiction","authors":[],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1999-01-01","abstract":"1999-01-01","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/17523.pdf","fullTextIdentifier":"http:\/\/mlpa.nottingham.ac.uk\/archive\/00000010\/","pdfHashValue":"2f0d8b27ed430720f190dc000f6cac5b8c9c27c9","publisher":null,"rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:mlpa.nottingham.ac.uk.OAI2:10<\/identifier><datestamp>\n      2003-12-02<\/datestamp><setSpec>\n      7375626A656374733D33<\/setSpec><setSpec>\n      636F6C6C656374696F6E733D4246<\/setSpec><\/header><metadata><oai_dc:dc xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Lights, Camera: Fiction<\/dc:title><dc:author>\n        Brandao, Ruth Silviano<\/dc:author><dc:subject>\n        Hispanic and Latin American Studies<\/dc:subject><dc:description>\n        <\/dc:description><dc:date>\n        \n        1999-01-01<\/dc:date><dc:type>\n        Book Chapter<\/dc:type><dc:identifier>\n        http:\/\/mlpa.nottingham.ac.uk\/archive\/00000010\/<\/dc:identifier><dc:format>\n        pdf http:\/\/mlpa.nottingham.ac.uk\/archive\/00000010\/01\/BrF_Brandao.pdf<\/dc:format><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":1999,"topics":["Hispanic and Latin American Studies"],"subject":["Book Chapter"],"fullText":"Lights, Camera: Fiction \nRuth Silviano Btandão \nInverting the aphorism ‘my life could become a novel’, where fiction would be \na copy of reality, the traditional strategy of mimesis, it may be said  today that \n‘fiction produces reality. This reproductive function of fiction manifests itself and \nbecomes  ever clearer, in  a  world where images proliferate and confound the \nprinciples of reality, the issue of reality and of an  original, which exist before \nlanguage. \nIf  the  world  of  theatre, stage, of  the  relation  to  the  public, of  the \nmanipulation of  all kinds  of fireworks has  always  created an aura around the \nactress or the actor, nowadays, the fascination of images has gained a new glow, \non television, in the  cinema and in literature, where  all the visual  games  are \nintroduced.The strategy of the visual image with all it involves in terms of a new \nperception of reality invades the world of literature,  penetrates the book, not only \nreferring to the visual world of images, but reproducing itself there. \nThis special space, which developed in industrialized societies, makes it \npossible to reproduce the simulacrum, since the exchange, or concomittance, \nbetween life\/fiction\/life or fantasy\/reality, with itself, facilitates the breakdown \nof the borders between one and the other, and therefore weakens the radical \nbreaks  between reality and  imagination. Then  the  figures  of  the  self  show \nthemselves, all  madness is permitted  in the seductive traffic  of the forms and \nformulas of fantasy. \nIf the mimesis as imitatio or  imitation sought the original, the generation \nof the simulacrum does not want to be a copy - which presupposes an original - \nbut shows itself as  a mask, a device, playing with the opposition between true \nand false in ördër to  mi^ them; to make the difference impossible, to show the \nartificial as  a  paradigm  of a  time which  knows it is  impossible to get to the \norigin, the  source, the  truth. Therefore, truth  is  the  device and  the  game of \nseduction is the gesture, the fetish-object, the sidelong glance. \nThe interest in reading the memoirs of actresses, evident by  the success \nof their books, is explained not only by the curiosity about the life of the great \nstars of the theatre, cinema or television, but also because their lives seem to be \n‘theatrical’ lives,  which  blend  with  the  theatre  itself or  television. It  is  the \ntheatrical that fascinates, it is the theatrical that distinguishes these memoirs fiom \nothers or questions them - since the  self  that  narrates itself or is  narrated \ncontinues on the stage, but becomes intimate with the public. \n155 Lights,Camera: Fiction \nIt can be said that a reader-public is created which  is moved by the  eyes, \nby the very fascination that flows from these women who, in the eighties, began \nto  describe  themselves  in  Brazil.  In  contrast  to  the  interest  raised  by  the \ntraditional books of memoirs, of known or unknown personalities, what matters \nin these texts is not so much the truth of the fact, but the possibility of undoing \neven further the border between reality and fiction. Look at what, for example, \nthe celebrated actress Tônia Carrero  states about it: \nBetter than acting  in the theatre? I don’t know. But better than almost \nanything,  much  stronger  than  giving  interviews  about  yourself, \nconcentrated,  or talk to a fkiend, with your analyst  even, is  to dive, in \nwriting, in the stili unconscious, intact cellars of memory.  It is to visit a \nfriendly  house. Your  stuff.  Loved  and unloved, eternal dwelling  while \nalive. \nBut can you not cheat? Has it got to be aii exactly just so? \nWhat about the all important fantasy? Without mentioning the natural \nwill  of the beautiful story in itself: Oh, no! Let’s sacrifice Literature, let’s \nsacrifice reality, the ideal reporting of personality, fine, but not the taste for \ninventiveness. Even the cheapest kind. Never.’ \nFor the spectator-reader, beside the voyeuristic wish to know intimacies, \nto look through  the keyhole, there is  the fascination for images, the mix of \nfiction  and  reality,  transforming  the  commonplace into  a  stage. This is  the \nrhetoric of  television, radio and theatre magazines: to blend stages, to make the \nlives  of the  actors into scenes, as  if they  continued  to act, blotting  out  the \ndifferences between daily routine and artistic life: loves, tastes, spending, homes, \nclothes, all this comes full of intrigue, rumours, stories that imitate soap operas, \nin the case of television. \nTherefore, TV magazines exhaust the device of using the name of the \nactress for that of the character she plays, still creating the interest, the curiosity \nof the déju vu. Paradoxically.Te1evision sweethearts must become real sweethearts, \n1 \nI \n156 \nTÓnia  Carrero, O monstro de olhos miris (memórias),  Porto Alegre\/ São Paulo, L&PM, 1986,9: \nMelhor que atuar em teatro? Nio sei. Mas nielhor do que quase tudo. Muito mais forte do que \ndar entrevistas sobre si, concentrada, ou conversar coni amigo, com analista até, é mergulhar, \nescrevendo,  nos porões ainda inconscientes, intactos da  memória. E visitar casa amiga. Coisa \nsua. Amada e desamada, morada eterna enquanto viva. Mas  nio se pode fraudar?  Tem que ser \ntudo tim-tini por tim-tim? E a fantasia tão importante onde fica? Sem falar na  naturai vontade \nda  bela história em si mesma. Ah, não! Sacrifique-se a Literatura, sacrifique-se a realidade, o \nrelato ideai da  personalidade,  está bem, nias não o gosto da  invencionice. Mesmo a niais barata. \nIsso nunca. the  characters should continue  to  be  characters in the living person  of their \nprotagonists. In order to do this, it is necessary not to establish differences, create \ncontinuity between life and the theatre, to strengthen seduction, the fascination \nthat hides the discontinuity of day-to-day  living. Even this discontinuity which \nis  present  in  routine,  in  the  banal  description  of  trivial  facts,  has  to  bc \nglamourised, by  phrases and sayings that make one out of the character-actor- \nperson, a triad that must remain undifferentiated. \nIf the feminine does not inscribe itself, does not act as such, one can speak \nof a special kind of acting, or better, of simulation, with endless signifiers  (since \nthe One is  missing),  masks, seduction, in an endless play of poses, clothes, make- \nup. Even when you want it very simple - we know -  the strategy is that of the \nartificial. Therefore, if  the  feminine does  not  act  itself, woman, each  in  her \nsingularity, acts herself. This is her universal: paradoxically. \nIn the eighties, many books by  actresses appeared, besides one in 1990,  by \nFernanda Montenegro. At least three of these texts are focused on here: that of \nTônia Carrero, which has  already been mentioned, that of Dina Sfat,’ and that \nof Fernanda.’  AU  three are theatre and TV actresses, ali are at the height of their \nfame, all of them voluntarily having their lives seen and admired as we see and \nadmire that which happens on a stage. \nAU  three are very  famous in Brazil. Fernanda Montenegro  and Tônia \nCarrero are considered the grandes darnes of the Brazilian stage, having acted in \nvery  important  plays. They  have,  besides, acted  in  the  cinema  and  in  many \nsuccessful T.V. soap operas, especially in the Globo T.V. series. Fernanda’s whole \nfamily  consists of  such  stars: herself, her  husband  Fernando Torres  and  her \ndaughter, Fernanda Torres. Tônia Carrero, besides her importance as an actress, \nis famous for her beauty. Dina Sfat, also a cinema, stage andTV actress, died soon \nafter the publication of her memoirs. \nTonia’s book is  the only one that was written without a co-author’s help \nvery  beginning,  there  is  the  issue  of  the  narratorísubject’s  self,  which \nimmediately disguises itself as she, acting as a third person, as if, even without \nnoticing it, the narrating self represented itself in the discourse, always acting \nbefore someone else,  as in the theatre. InTônia’s case, she renames herself, gaining \nthe status of a character, with a new name, or a variety of names, pseudonyms, \nsuch as Luzia, Luiza, Luzinha - the same name, Luiza, as  BáS, her false mother, \nmore  real  than  the  real, distant, cold, beautiful mother, on the  stage  of her \ndaughter’s fantasies. \n~~  and it is interesting to note how she represents herself. In Tônia’s book, at the \n~~ \n2 \n3 \nDina Sfat and  Mara  Caballero, P~\/JJIN  pra qire re quero, Rio de Janeiro, Nórdica, 1988. \nLúcia Rito, Fernanda Montenegro, O exerdcio da paix&, Rio de Janeiro, Rocco, 1991. \n157 Lights,Camera: Fiction \nNot only in Tônia’s book, but in those of the other actresses, the self \nliterally acts itself, revealing its condition of subject-actor, represented in a phrase, \nmoving in it, showing itself off, changing its costumes. If  the  subject always \ndivides itself up  on the oblique track of discourse, staying out, but acting itself \nout, in order to show itself as it wishes to see and let itself be  seen, actresses’ \nmemoirs or their biographies are the ideal stage so that the metaphor of their \nselves may become literal. \nThe awareness of acting, of being on stage, is clear in these texts, not only \nthrough  the  resource  used  by  TÔnia, becoming  a  character, but  also  in  the \nmemoirs of Dina or Fernanda ,  which are furnished with an alter-ego, of another \nvoice that announces or enunciates them: Lúcia Brito, in Fernanda’s case, Nara \nCabailero,  in Dina’s.  It is not possible to ignore that a lot that will be read in these \nbooks is  already known, is public knowledge, through newspapers, and, mainly, \nthrough  magazines: loves,  separations, illnesses,  relations  with  children  and \nhusbands. AU this is already partially, fragmentally known, through rumours, or \nreal news, but one not always wants to know more, but again and in a different \nway. \nIn the specific case of these actresses, it may be emphasized that not only \nare they actresses, in the theatre, with all its history on the Brazilian scene, but \nGlobo actresses on the all-powerfulTV Globo channel, which reigns supreme in \nthe Brazilian  media kingdom, through soap operas, shows, and the news, and are \nduly consumed by readers, who are assiduous television watchers . \nIn Dina’s case, her illness or talking about her illness, already known by \nthe  public,  or  the  breakdown  of  her  marriage,  her  relationship  with  her \ndaughters, her devotion to the esoteric, seer, or guru Thomas Green, all this was \npart of the success of the book, published just before her death. Dina herself \noften speaks clearly of being a character, of mixing with  characters, as in her \nrelationship with Paulo José: \nThere are stories made up by me, as there are characters of my authorship. \nPaulo José, whom I married, is an example. For 17 years, he said to me: \n‘I am not the person you say I am’. I used to say: ‘you are, although you \ndon’t know you are’. And he proved to me, year after year, that he wasn’t \nthe character I thought he was.Therefore, there is no point in discussing \nthe real Paulo JokWhat  matters is talking about the character I created \n-  extremely interesting, by the way.Therefore, when we broke up, I had \nthe sensation of failure and not of frustration: my character did not exist. \n158 (...)The character did not exist and I ended up taiking to myself. I created \na fiction and failed.‘ \nTônia,  in  another  tone,  speaks  of  herself  as  a  character, actress  or \nsimulacrum,  as she learned to simulate or dissimulate her own feelings, in order \nto defend herself on the family stage. The ‘blue-eyed monster’, as she refers  to \nherself, is  the simulation built in discourse, this other one who became familiar \nand, at the same time, a manger.This ‘monster’  produces effects in Tônia’s speech, \nrevealing an ambiguous relationship of admiration, surprise and fear before her \nown image.True or fàlse as it may be, a bridge made by this other subject which \nis beyond the stage, the borders, the margins of a silenced form, but acting itself \nout. \nIf so much is said about the subject-actor, the surface subject, the subject \nthat  glides  or  moves  metonymicaiiy, which  does  not  have  the  illusionary \nintegrity which it was believed to have, this subject, however, acts the Otlier, the \nsubject of the unconscious, outside the discourse, but sustains it. This subject \nwhich acts has  a listener that he believes has  a knowledge, a knowledge which \nhe says is  his, that is his make up. \nTônia  the  actress  speaks to  a  reader public  that  continues to  be  her \nspectator, creates the monster to look at, to show itself:  a monster, but with blue \neyes, of which she is  proud, she, the daughter of the father fascinated by  her \nbeauty. A beauty she wants to eternalize on the stage, in life, in the iconographic \nregister of the book: in the photographs that show the blue eyes in several poses, \nplaces where she seeks herself. In the photographs, in the eyes of the reader or \nin other eyes, another look beyond, in this Other that is not. \nThere is  nothing so similar to the concept of the photograph in Barthes’ \nas that of the feminine in Lacan. Without essence, without a signifier to define \nit, the photograph is produced in the instant, is defined in the contingent, in the \nspecific. If there is not The  photograph, there is not Die woman, but each woman \nplays herself at every moment, the way she glances at people ,  the clothes \n4  Sfat, 1l:Há histórias inventadas por mim, como há  personagens de minha autoria. Paulo José, \nconi quem me casei, é um exemplo. Durante 17 anos, ele me disse: não sou essa  pessoa que \nvocê diz que eu sou. Eu dizia: voce é, embora não saiba que é. E ele me provou, ano após ano, \nnão ser o personageni que eu achava que ele era. Então, não interessa discutir o Paulo José \nverdadeiro: interessa falar do personagem  que criei-interessantissimo, aliás. Por isso, coni a \nseparação, tive uma sensação de fracasso e nio de frustração: meu personagem  não existia(  ...) O \npersonagem  nio existia e acabei falando sozinha. Criei unia ficção e úacassei. \nRoland Barthes, Camara Lucida, translated by Richard Howard, London, Fontana, 1984.  5 \n159 Lights,Camera: Fiction \nshe wears, the pose she makes, manufacturing a body that metamorphoses itself \nalways. \nWhen I pose, I manufacture my body, I change, says Barthes6 But I want, \non the other hand, my  authentic picture, I want to capture or I want my  real  Z \nto be captured. It, however, escapes, it never appears: I of a thousand faces. In the \nphotograph,  the  subject  photographed  imitates  itself,  reproduces  itself. By \nposing, it wants to be natural, as if it were not watching itself, simple, authentic. \nHowever, it stiffens, becomes a statue and only manages to pose, non-authentic. \nThe photograph demands our imposture and our wish to be admired as we wish \nto be, as we wish to be seen. \nLiving under the focus of looks, monsters of many looks, it is  not by \nchance that all the books we talked about show photographs of the actresses, all \nof them in their poses, their families, the theatre scenes next to the family scenes. \nTônia the baby, the girl with the blue eyes, the parents, the brothers and sisters, \nthe grandparents, the family album with  a story, with the places  she lived in, \npeople from the past speak of an existence. This was, Barthes would say. I  am, Z \nexist. The photographs, the people mean and make meaning. \nThe wish to make oneself be seen makes the photographs multiply and \nvary. Thus, the pose of her last picture, seductive,  like a vamp, with her body bent \nin a dance, Hollywoodian, mimics in her own body the fiction of an American \nstar. We  also  have  blond, blue-eyed  stars  here  in  these  tropics: Tônia,  the \nsimulacrum  of  the  great  cinema  actress, moves  about  with  ease  before  the \ncamera-eyes of the mass-media,  at ease in her replica pose of a thousand other \nsimilar poses printed in magazines that show the blond stars of the star system. \nIn another photograph, she shows herself dressed as a tap-dancer, in long black \nsilk slacks, a carioca Ginger Rogers, that is, one that lives in Rio de Janeiro . \nTônia’s text, however, has its gaps, where the pain of the girl hurt by the \nlack of her mother’s gaze can be seen.  There are complaints, resentment, a lack \nof care, which she transformed into the thousand eyes of a voyeur public, looking \nat her beauty sung in prose and verse, a beauty considered rare in this part of the \nsouthern hemisphere, ‘a monster with blue eyes’. And in this way,  that which is \nlacking becomes excess, in excess, or making exception, the auspicious answer of \nthe feminine which if it does not represent The woman, has women fully, utterly \nrepresented. \n6  ‘Now, once I feel myself observed by  the lens, everything changes: I  constitute myself in the \nprocess of ‘posing’: I  instantaneously niake another body for myself, 1 transform myself in \nadvance into an image’ (Camera Lucida, 10). \n160 The iconographic part of the book carries on a dialogue with the written \nmemoirs, silences the  complaints of the  girl, lets  the  star shine with  aii  the \nseduction she learned to use  to  hide  the  need, to signify: make-up,  crescent \neyebrows, cinematographic gestures, seductive object ready to be seen. Nothing \nis more important for the person that covers herself with the signs of the great \nactress than the look of the one whom she believes to be the Other. It is for the \nOther - beyond the  gaze of each subject in the role  of spectator - that  the \nwoman  sparkles, that  she shines with  the  attributes of what  Lacan  calls  the \nmasquerade.  This masking is the scenic resource of the costume that covers the \nemptiness, the lack of the feminine signifier; these resources are many and on \nthem  focuses the  gaze.  It  is  not  by  chance  that  the  books  are  made  up  of \nphotographs. \nThus, there is  nothing better or more spectacular than an actress acting \nthat which  a woman is  not in herself - the clothes, the jewels, the look, the \nperfume - but makes her signify, exactly by the excess of signifiers, since the one \nis  lacking, that which would identify the feminine.That which is  not. In a way, \nthis opening brings about, in an extraordinary way, the seduction and the several \nappearances which put into motion the machine of desire. \nIf the actor is  double by  the very act of acting, the Other he addresses \nmay,  in  an  imaginary  way,  realize  this  duplicity,  mimicking  a  dialogue, an \nintersubjectivity, which  eventually reveals  itself to be  a stage, a place where a \npersonality dwells.Therefore, iff  ônia makes herselfa character for an ambiguous \nnarrator, who is and is not herself, Fernanda Montenegro and Dina Sfat represent \nthemselves through  the  writing of a journalist who interviews them, listens, \nwrites down and witnesses.To write Fernanda, to write Dina is  a writing that \ngoes through the listening of another woman, which still reveals a play of voices, \na play  of discourses which builds a figure, an image of a woman, or better, a \nsimulacrum, an object built with the resources of the world of the mass media \nand of the show. \nIt is impossible to try to find the true woman underlying these images in \nthe depth of the text. It is impossible to have an epiphanous meeting with Dina, \nTônia or Fernanda, in their ‘truth’, devoid of the veils and devices of the stage, \nsince that is  where they are to be found, in the multiplicity of names, doubles, \nclear voices and oJtlie  record. The truth is appearance itself:  Tônia is  Luzia, Luiza, \nLuzinha. Fernanda is Arlette, Fernanda Montenegro, who doubles as Torres. It \nproliferates, as Borges would  say,  in  the  photographs, the  family, the  names, \ndaughters, granddaughters.AU buy the true reality, knowing that it is not, or that \nit cannot be captured. \n161 Lights,Camera: Fiction \nIn Fernanda’s book, more than in Tônia’s (surprisingly), one admires, in a shpw, \nthe füll picture of the  Grande Darne  ,  without flaws, without  needs, without \ncracks. An actress  is  erected who coincides with  the  complete woman: wife, \nmother, professional. In the photographs, her large eyes are reproduced, which \nlook at us, which look at themselves, look at the children in the pages  of the \nbook. \nThe  books, then, are  the  stages. The characters are  really  characters, \nconstructions, as the public expects, in the sparkle of their portrayability, in the \nreality of their necessary illusion. \nTranslated by Charles Bacon \n162 "}