{"doi":"10.1016\/j.envint.2011.03.010","coreId":"52316","oai":"oai:nora.nerc.ac.uk:14168","identifiers":["oai:nora.nerc.ac.uk:14168","10.1016\/j.envint.2011.03.010"],"title":"Second generation anticoagulant rodenticides in predatory birds: probabilistic characterisation of toxic liver concentrations and implications for predatory bird populations in Canada","authors":["Thomas, Philippe J.","Mineau, Pierre","Shore, Richard F.","Champoux, Louise","Martin, Pamela A.","Wilson, Laurie K.","Fitzgerald, Guy","Elliott, John E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011","abstract":"Second-generation anticoagulant rodenticides (SGARs) are widely used to control rodent pests but exposure and poisonings occur in non-target species, such as birds of prey. Liver residues are often analysed to detect exposure in birds found dead but their use to assess toxicity of SGARs is problematic. We analysed published data on hepatic rodenticide residues and associated symptoms of anticoagulant poisoning from 270 birds of prey using logistic regression to estimate the probability of toxicosis associated with different liver SGAR residues. We also evaluated exposure to SGARs on a national level in Canada by analysing 196 livers from great horned owls (Bubo virginianus) and red-tailed hawks (Buteo jamaicensis) found dead at locations across the country. Analysis of a broader sample of raptor species from Quebec also helped define the taxonomic breadth of contamination. Calculated probability curves suggest significant species differences in sensitivity to SGARs and significant likelihood of toxicosis below previously suggested concentrations of concern (< 0.1 mg\/kg). Analysis of birds from Quebec showed that a broad range of raptor species are exposed to SGARs, indicating that generalised terrestrial food chains could be contaminated in the vicinity of the sampled areas. Of the two species for which we had samples from across Canada, great horned owls are exposed to SGARs to a greater extent than red-tailed hawks and the liver residue levels were also higher. Using our probability estimates of effect, we estimate that a minimum of 11% of the sampled great horned owl population is at risk of being directly killed by SGARs. This is the first time the potential mortality impact of SGARs on a raptor population has been estimated.\\ud\n\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/52316.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/14168\/2\/N014168PP.pdf","pdfHashValue":"2a69545184525ca925dfd6356ecf65f78dce0a20","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:14168<\/identifier><datestamp>\n      2014-11-06T13:47:57Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533236<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/14168\/<\/dc:relation><dc:title>\n        Second generation anticoagulant rodenticides in predatory birds: probabilistic characterisation of toxic liver concentrations and implications for predatory bird populations in Canada<\/dc:title><dc:creator>\n        Thomas, Philippe J.<\/dc:creator><dc:creator>\n        Mineau, Pierre<\/dc:creator><dc:creator>\n        Shore, Richard F.<\/dc:creator><dc:creator>\n        Champoux, Louise<\/dc:creator><dc:creator>\n        Martin, Pamela A.<\/dc:creator><dc:creator>\n        Wilson, Laurie K.<\/dc:creator><dc:creator>\n        Fitzgerald, Guy<\/dc:creator><dc:creator>\n        Elliott, John E.<\/dc:creator><dc:subject>\n        Zoology<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        Second-generation anticoagulant rodenticides (SGARs) are widely used to control rodent pests but exposure and poisonings occur in non-target species, such as birds of prey. Liver residues are often analysed to detect exposure in birds found dead but their use to assess toxicity of SGARs is problematic. We analysed published data on hepatic rodenticide residues and associated symptoms of anticoagulant poisoning from 270 birds of prey using logistic regression to estimate the probability of toxicosis associated with different liver SGAR residues. We also evaluated exposure to SGARs on a national level in Canada by analysing 196 livers from great horned owls (Bubo virginianus) and red-tailed hawks (Buteo jamaicensis) found dead at locations across the country. Analysis of a broader sample of raptor species from Quebec also helped define the taxonomic breadth of contamination. Calculated probability curves suggest significant species differences in sensitivity to SGARs and significant likelihood of toxicosis below previously suggested concentrations of concern (< 0.1 mg\/kg). Analysis of birds from Quebec showed that a broad range of raptor species are exposed to SGARs, indicating that generalised terrestrial food chains could be contaminated in the vicinity of the sampled areas. Of the two species for which we had samples from across Canada, great horned owls are exposed to SGARs to a greater extent than red-tailed hawks and the liver residue levels were also higher. Using our probability estimates of effect, we estimate that a minimum of 11% of the sampled great horned owl population is at risk of being directly killed by SGARs. This is the first time the potential mortality impact of SGARs on a raptor population has been estimated.\\ud\n\\ud\n<\/dc:description><dc:date>\n        2011<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/14168\/1\/N014168PP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Thomas, Philippe J.; Mineau, Pierre; Shore, Richard F.; Champoux, Louise; Martin, Pamela A.; Wilson, Laurie K.; Fitzgerald, Guy; Elliott, John E..  2011  Second generation anticoagulant rodenticides in predatory birds: probabilistic characterisation of toxic liver concentrations and implications for predatory bird populations in Canada.   Environment International, 37 (5). 914-920.  https:\/\/doi.org\/10.1016\/j.envint.2011.03.010 <https:\/\/doi.org\/10.1016\/j.envint.2011.03.010>     \n <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.envint.2011.03.010<\/dc:relation><dc:relation>\n        10.1016\/j.envint.2011.03.010<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/14168\/","http:\/\/dx.doi.org\/10.1016\/j.envint.2011.03.010","10.1016\/j.envint.2011.03.010"],"year":2011,"topics":["Zoology","Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \nCopyright © 2011 Elsevier Ltd. \n \nThis version available http:\/\/nora.nerc.ac.uk\/14168 \/  \n \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the journal \narticle prior to the peer review process. Some differences between this \nand the publisher’s version may remain. You are advised to consult the \npublisher’s version if you wish to cite from this article. \n \nwww.elsevier.com\/  \n   \n \n \nArticle (refereed) \n \n \n \nThomas, Philippe J.; Mineau, Pierre; Shore, Richard F.; Champoux, \nLouise; Martin, Pamela A.; Wilson, Laurie K.; Fitzgerald, Guy; Elliott, John \nE.. 2011 Second generation anticoagulant rodenticides in predatory birds: \nProbabilistic characterisation of toxic liver concentrations and implications \nfor predatory bird populations in Canada. Environment International, 37 \n(5). 914-920. 10.1016\/jenvint.2011.03.010 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnoraceh@ceh.ac.uk \n \n \nThe NERC and CEH  trade marks and logos (‘the Trademarks’) are registered trademarks of NERC in the UK and \nother countries, and may not be used without the prior written consent of the Trademark owner. \nSGAR – second generation anticoagulant rodenticide \nGHOW – great horned owl \nRTHA – red-tailed hawk \nBAOW – barred owl \nBNOW – barn owl \nALL – all bird species pooled \nEIIS – ecological incident information system \nEPA – environmental protection agency \nTitle:  Second generation anticoagulant rodenticides in predatory birds: probabilistic \ncharacterisation of toxic liver concentrations and implications for predatory bird \npopulations in Canada.  \n \nAuthors:  Philippe J. Thomas\n1\n, Pierre Mineau\n1\n, Richard F. Shore\n2\n, Louise Champoux\n3\n, \nPamela A. Martin\n4\n, Laurie K. Wilson\n5\n, Guy Fitzgerald\n6\n, John E. Elliott\n7\n \n \n1 \nNational Wildlife Research Centre, Science & Technology Branch, Environment Canada, \nOttawa, Ontario, K1A 0H3, Canada, philippe.thomas@ec.gc.ca (corresponding author), \npierre.mineau@ec.gc.ca, \nTel: (613) 998-0511     Fax: (613) 998-0458  \n2\n Centre for Ecology & Hydrology, Lancaster Environment Centre, Library Avenue, Bailrigg, \nLancaster LA1 4AP, UK, rfs@ceh.ac.uk  \n3 \nScience & Technology Branch, Environment Canada, Ste-Foy, QC, G1V 4H5, Canada, \nlouise.champoux@ec.gc.ca\n \n4 \nScience & Technology Branch, Environment Canada, Burlington, ON, L7R 4A6, Canada, \npamela.martin@ec.gc.ca \n5 \nCanadian Wildlife Service, Environment Canada, Delta, BC, V4K 3N2, Canada, \nlaurie.wilson@ec.gc.ca \n6 \nUniversité de Montréal, Saint-Hyacinthe, QC, J2S 7C6, Canada, guy.fitzgerald@umontreal.ca   \n7\n Science & Technology Branch, Environment Canada, Delta, BC, V4K 3N2, Canada, \njohn.elliott@ec.gc.ca \n \nAbstract:   \nSecond-generation anticoagulant rodenticides (SGARs) are widely used to control rodent pests \nbut exposure and poisonings occur in non-target species, such as birds of prey.  Liver residues are \noften analyzed to detect exposure in birds found dead but their use to assess toxicity of SGARs is \nproblematic. We analyzed published data on hepatic rodenticide residues and associated \nsymptoms of anticoagulant poisoning from 270 birds of prey using logistic regression to estimate \nthe probability of toxicosis associated with different liver SGAR residues.  We also evaluated \nexposure to SGARs on a national level in Canada by analyzing 196 livers from great horned owls \n(Bubo virginianus) and red-tailed hawks (Buteo jamaicensis) found dead at locations across the \ncountry.  Analysis of a broader sample of raptor species from Quebec also helped define the \ntaxonomic breadth of contamination. Calculated probability curves suggest significant species \ndifferences in sensitivity to SGARs and significant likelihood of toxicosis below previously \nsuggested concentrations of concern (<0.1 mg\/kg).  Analysis of birds from Quebec showed that a \nbroad range of raptor species are exposed to SGARs, indicating that generalized terrestrial food \nchains could be contaminated in the vicinity of the sampled areas. Of the two species for which \nwe had samples from across Canada, great horned owls are exposed to SGARs to a greater extent \nthan red-tailed hawks and liver residue levels were also higher. Using our probability estimates of \neffect, we estimate that a minimum of 11% of the sampled great horned owl population is at risk \nof being directly killed by SGARs.  This is the first time the potential mortality impact of SGARs \non a raptor population has been estimated. \n \nKeywords:  rodent, exposure, liver residues, toxicity threshold, anticoagulant rodenticide \n \n 2 \n1. Introduction 1 \nIntroduced in the 1970s, second-generation anticoagulant rodenticides (SGARs) were 2 \ndeveloped to combat the reported development of rodent resistance to first-generation 3 \ncompounds (Buckle et al. 1994). These newer anticoagulant poisons differ from their 4 \nfirst-generation counterparts in that they are more acutely toxic at lower doses (often 5 \nallowing a lethal dose to be obtained in a single feeding), and are more persistent in 6 \nvertebrate livers (Parmar et al. 1987, Stone et al. 1999, Newton et al. 1999, Erickson and 7 \nUrban 2004). Greater acute toxicity increases the potential for primary poisoning 8 \namongst non-target species while the longer tissue half-lives of SGARs enhance the 9 \npotential for bioaccumulation in non-target predators in particular, and so may increase 10 \nthe risk of secondary poisoning. Furthermore, rodents survive for several days after 11 \nconsuming a lethal dose of SGARs and often will continue feeding on the bait (Cox and 12 \nSmith 1992). That increases the likelihood that the body burden in poisoned rodents may 13 \nsignificantly exceed the LD50 or even LD100 dose, and poisoned animals may remain 14 \nactive and available for capture by predators for some period after ingestion of the 15 \nrodenticide. Additionally, poisoned rodents exhibit an altered state of behaviour, such as 16 \nspending more time in open areas in a lethargic state, and this may further predispose 17 \nthem to predation (Cox and Smith 1992).  18 \nSGARs bind and inhibit vitamin K epoxide reductase and persist for at least six 19 \nmonths in organs and tissues containing this enzyme such as the liver (Stone et al. 1999, 20 \nEason et al. 2002). In an attempt to monitor exposure in non-target wildlife, the presence 21 \nof detectable SGAR residues as well as the magnitude of concentrations has been 22 \nmeasured in the livers of some Canadian, American and European predatory birds and 23 \n 3 \nscavengers (Albert et al. 2010, Newton et al. 1990, Shore et al. 1999, Shore et al. 2006). 24 \nThere was a common trend among those studies for most SGARs, namely brodifacoum, 25 \nbromadiolone, difenacoum and difethialone being detected at an increasing frequency in 26 \nnumerous predators and scavengers. Species most commonly monitored in North 27 \nAmerica are great horned owls (Bubo virginianus) and red-tailed hawks (Buteo 28 \njamaicensis) (Albert et al. 2010, Erickson and Urban 2004). 29 \nIt is still uncertain what SGAR liver concentration is diagnostic of a potentially lethal 30 \ndose and, indeed Erickson and Urban (2004) have questioned whether such a cause-effect 31 \nrelationship is appropriate. A sometimes cited ―toxicity threshold‖ is given as ―greater 32 \nthan 0.1 – 0.2 mg\/kg wet weight‖ (Newton et al. 1998, Newton et al. 1999). This was, in 33 \nfact, described as a ―potentially lethal range‖ and was derived for a single species, the 34 \nbarn owl (Tyto alba); it stems from two sets of observations (Shore et al. 2001). Firstly, 35 \nbarn owls diagnosed post-mortem as having died from rodenticides had liver 36 \nconcentrations > 0.1 mg\/kg. Those owls exhibited classical toxicosis signs such as 37 \nhaemorrhaging from organs such as the heart, lungs, liver, brain and\/or subcutaneous 38 \nareas (Newton et al. 1998). Secondly, owls that were experimentally poisoned had liver 39 \nresidues in the range of 0.2 – 1.72 mg\/kg (Newton et al. 1999). However, it is uncertain 40 \nwhether these barn owl criteria would apply to other species.  Liver residues associated 41 \nwith SGAR poisonings in various species typically range over two orders of magnitude 42 \nand were reported to be as low as 0.01 mg\/kg wet wt in one great horned owl that was 43 \nexamined (Stone et al. 1999).  Thus, liver SGAR concentrations associated with toxicity 44 \nvary markedly among both individuals and species.  This suggests a probabilistic 45 \napproach; which we adopt to review the evidence pertaining to how liver residues are 46 \n 4 \nrelated to toxicity.  Our principal objectives are: i) to determine SGAR liver 47 \nconcentrations that may be associated with mortality in birds (ie- to quantify the ―toxicity 48 \nthreshold‖) and ii) using the threshold values, assess the extent and severity of exposure 49 \nin Canadian birds of prey. 50 \n 51 \n2. Methods 52 \n2.1. Toxicity Threshold 53 \n2.1.1. Literature Search 54 \nRecently published (~ last 10 years) peer-reviewed publications as well as the United 55 \nStates Environmental Protection Agency (EPA)‘s Ecological Incident Information 56 \nSystem (EIIS) were surveyed in order to locate liver residue data sets for birds of prey. 57 \nThe EIIS is the EPA‘s database managing information on incidents linked to the exposure 58 \nof non target plants and animals to pesticides. It is currently managed by the Office of 59 \nPesticide Programs (Mastrota 2007). Data were retained for our assessment if they met a 60 \nset of pre-determined conditions. These conditions included:  61 \ni) SGAR detection limits in liver were under 0.02 mg\/kg wet wt; 62 \nii) post-mortem evaluations were conducted prior to liver extraction and analysis; 63 \npathophysiological signs of rodenticide poisoning were included. 64 \niii) post-mortem evaluations were conducted by a reputable professional such as a 65 \ndoctor of veterinary medicine (DVM); and 66 \niv) adequate sample sizes were available (n>15) for any given species (in order to 67 \nhave greater statistical power). 68 \n2.1.2. Data Analysis 69 \n 5 \nRaptor necropsies with attending SGAR liver analyses were collected and compiled 70 \nin database software, and each case was given a binary code as positive (1) or negative 71 \n(0) for pathophysiological signs of poisoning. A positive coding meant that, after a 72 \ndetailed post-mortem evaluation, an anticoagulant was diagnosed as being the cause of 73 \ndeath or a significant contributory factor (ie- when necropsies showed hemorrhage or 74 \nanemia in the absence of traumatic injury or infectious or parasitic diseases and an 75 \nanticoagulant residue was detected in the liver). A negative coding represented cases 76 \nwhere the cause of death was deemed to be natural or accidental (for example incidental 77 \ntake, hunting, motor vehicle collisions, starvation). 78 \nThe binary dataset was imported into SAS\/STAT (version 9.2 TS2M0). Residue 79 \nconcentrations of all SGAR compounds were summed for the logistic regression. 80 \nConcentrations were log transformed to meet the assumption of normality and re-tested. 81 \nThe PROC LOGISTIC macro was invoked to determine how liver residues affected 82 \npresence or absence of poisoning symptoms. An effects plot was generated to illustrate 83 \nthe relationship and equations were built for every species with sufficient data (n≥15). 84 \nUsing these equations, liver residue levels (in mg\/kg wet weight (ww)) were determined 85 \nfor probabilities of 5%, 10%, 15% and 20% of exhibiting pathologies consistent with 86 \nrodenticides exposure. Species comparisons were completed using analysis of variance 87 \n(ANOVA) in conjunction with Tukey‘s Studentized Range test. Because all birds were 88 \nfound dead or moribund, there was a logical inference that those pathologies 89 \n(haemorrhaging of the heart, lungs, liver, brain and\/or subcutaneous areas) were 90 \nresponsible for, or strongly contributed to, the mortality of the individual. 91 \n2.2. Exposure extent in Canada 92 \n 6 \n2.2.1. Sample Collection 93 \nTo obtain a cross-Canada survey of residue levels, liver samples of birds were 94 \nselected, irrespective of the cause of death, from British Columbia, the prairie provinces, 95 \nOntario and Quebec. The birds were collected near agricultural and urban areas of the 96 \ncountry where SGAR use was thought to be common. They were typically submitted to 97 \nrehabilitation or veterinary centres either dead or in a moribund state. Initial diagnosis 98 \nfrequently involved car strike or other obvious ‗mishap‘. They were not chosen because 99 \nthey showed signs of anticoagulant poisoning, but rather reflect the population of 100 \nreported birds of prey dying from a multitude of causes. The subsequent liver samples 101 \nwere harvested initially as part of previous investigations of exposure to heavy metals or 102 \nother toxicants, and then rodenticides residues were determined in later years. Three main 103 \ncollections were sampled. These included an Ontario\/prairie sample of red-tailed hawks 104 \nand great-horned owls, two common species known to scavenge; a broader phylogenetic 105 \ncollection from Quebec and a collection of three owl species from British Columbia (barn 106 \nowl, barred owl [Strix varia] and great-horned owl). Those owl species are less mobile 107 \nthan most of the hawk species and were chosen to help identify geographical patterns of 108 \ncontamination and hence, potential sources of rodenticides residues. Results from the 109 \nlatter have already been reported (Albert et al. 2010). 110 \n2.2.2. Chemical Analysis 111 \nChemical analysis was conducted at the National Wildlife Research Center in Ottawa, 112 \nOntario, Canada. Methods were similar to those reported by Albert et al. (2010). 50 mg of 113 \nliver was ground in a mortar with about 5 g anhydrous sodium sulphate (Fisher no. S420-114 \n3). The resulting mixture was transferred to an amber glass septum bottle and acetonitrile 115 \n 7 \n(EMD Omnisolv, AX0142-1, HPLC grade; 1 x 7 mL and 2 x 5 mL) was used for 116 \nextraction. The extract was shaken for 2 minutes by hand and 15 minutes mechanically. 117 \nAfter centrifuging for 15 minutes at 1000 rpm, the supernatant was removed and 118 \ntransferred into a 40 mL conical tube. The supernatant of the two subsequent extractions 119 \nwere combined with the first supernatant. The total product was evaporated to 10 mL 120 \nunder a stream of nitrogen in a water bath kept at 40°C. 121 \nIn order to clean up liver extract, a 2 mL portion was transferred into a test tube and 122 \nheated to dryness. The sample was reconstituted in acetonitrile and cleaned by solid-123 \nphase extraction. After the introduction of the sample into the SPE cartridge, the tube 124 \ncontaining the sample was rinsed with acetonitrile and added to the SPE cartridge 125 \nsolution. The eluate was then evaporated to dryness and reconstituted in MeOH and 126 \nfiltered through an Acrodisk® syringe filter with a polyvinylidene fluoride (PVDF) 127 \nmembrane. A volume of 10 μL of the diluted filtered extract was analyzed by liquid 128 \nchromatography-mass spectrometry (LC-MSMS). Some of the owl samples analysed 129 \n(mainly from British Columbia) were not cleaned using an SPE cartridge. However, 130 \nlimits of detection were calculated for the procedure with and without an SPE sample 131 \ncleaning phase and were found to be identical. For this reason, both SPE-cleaned data and 132 \nnon-SPE data were pooled for our analysis. 133 \nBrodifacoum, bromadiolone and difethialone were detected with a triple quadrupole 134 \nmass Quatro-Ultima (Waters) with negative electrospray ionization (ESI) in multiple 135 \nreaction monitoring scanning mode (MRM). LC-MSMS, MRM parameters and triple 136 \nquadrupole settings were identical as the ones reported in Albert et al. 2010. 137 \n 8 \nThe method‘s detection limit was 0.005 mg\/kg for difethialone and 0.002 mg\/kg for 138 \nbrodifacoum and bromadiolone. The standards were all analytical grade (>98% purity). A 139 \ncalibration curve was built with five levels of concentrations ranging from 2.5 to 80 pg 140 \nwith an r\n2\n>0.99. Samples were diluted in order to fit within the limits of the calibration 141 \ncurve. Recoveries at low and high level were >70% for all compounds. Known amounts 142 \nof coumatetralyl (5 pg\/lL; transition 291.00>140.90) and flocoumafen (1 pg\/lL; transition 143 \n541.40>382.00) were added to each sample prior to the injection allowing ion 144 \nsuppression monitoring. Methanol was injected between each sample to monitor any 145 \npossible contamination. 146 \n2.2.3. Statistical Analysis 147 \nSince great horned owls and red-tailed hawks represented the two species consistently 148 \nfound across Canada (no red-tailed hawk samples were submitted from British Columbia, 149 \nhowever) and for which we had a large enough sample size to warrant a meaningful 150 \nanalysis, cumulative frequency distribution graphs were constructed for these species. 151 \nThe graphs were generated through a bootstrapping procedure (501 samples) using 152 \nBurrliOZ (version 1.0.14, © Commonwealth Scientific and Industrial Research 153 \nOrganisation, Australia 2000). Using the values identified in our toxicity threshold 154 \nanalysis, it was possible to identify the percentage of the sampled population exposed to 155 \nSGARs belonging to a certain risk category (5%, 10%, 15% and 20% risk of becoming 156 \nsymptomatic). 157 \n 158 \n3. Results 159 \n3.1. Toxicity Threshold 160 \n 9 \nFive sources of data matched our criteria and were used in the analysis. Data 161 \npublished by Newton et al. (1990, 1998, 2000; n=45), Albert et al. (2010; n=164) as well 162 \nas data from the Ecological Incident Information System (EIIS; n=61). All but four of the 163 \nEIIS cases were submitted by the State of New York and several of the values were 164 \npublished in Stone et al. (1999, 2003). Barn owl samples were collected from localized 165 \nareas across Canada and the United Kingdom (UK) with a few individuals from the 166 \nUnited States (USA). Barred owl samples were mostly collected in Canada with only one 167 \nfrom the USA while red-tailed hawk samples were obtained from the USA only. Great 168 \nhorned owl samples were collected from across both Canada and the USA. Samples were 169 \noften collected from relatively developed areas or areas where the public was likely to 170 \nreport and submit carcasses. 171 \nThere were significant differences between species in liver SGAR concentrations 172 \n(F(4,535) =12.68, p<0.0001). Post hoc-tests (Tukey‘s Studentized Range test, α = 0.05) 173 \nrevealed that, on average, red-tailed hawks (n=32) were the species with the highest liver 174 \nconcentrations of SGARs (Figure 1). All three owl species (great horned owl [n=86], 175 \nbarred owl [n=26] and barn owl [n=126]) had SGAR liver residues that were comparable.  176 \nLogistic regression plots were calculated to predict the probability of a bird being 177 \nsymptomatic as a function of SGAR liver residues (Figure 2). This was done for each 178 \nspecies separately and for all species combined (total of 270 individuals). Only the 179 \npredicted probability curve for the great horned owl (GHOW) was located inside the 95% 180 \nconfidence limits for the pooled data and the estimated probability of becoming 181 \nsymptomatic differed significantly between species (F(1,4) = 82.9, p<0.0001). The curve 182 \nfor the red-tailed hawk curve differed from those of the three owl species and the curves 183 \n 10 \nfor the great horned owl and the barn owl also differed from each other (Tukey‘s 184 \nStudentized Range post-hoc test, P<0.05).   185 \nUsing the probability curves, we calculated the predicted SGAR liver residue levels 186 \nfor different probability risk thresholds for different species (Table 1), although this was 187 \nnot possible for red-tailed hawks, as the data for this species could not be significantly 188 \nmodeled by a logistic regression.  The majority of the calculated values are under the 189 \n>0.1-0.2 mg\/kg threshold suggested by Newton et al. (1999) and all are below 0.2 mg\/kg. 190 \nIf the lower range of 0.1 mg\/kg and 0.2 mg\/kg from the potentially lethal range suggested 191 \nfor barn owls is applied to the barn owl probability curve, they correspond to toxicity 192 \nprobabilities of 11% and 22%, respectively. The higher 0.7 mg\/kg level proposed by the 193 \nRodenticide Registrants Task Force (Erickson and Urban 2004) corresponds to a 54% 194 \nprobability of effect in barn owls. 195 \nAlthough the differences among the species curves indicate that probabilities of 196 \ntoxicity should be considered on a species-by-species basis, that is not possible where 197 \ndata for species are lacking.  In such cases, it may be necessary to estimate toxicity 198 \nprobabilities on the basis of pooled data for other species.  The probability curve for the 199 \npooled data in our study predicts that one in 20 birds with detectable residues would 200 \nbecome symptomatic with SGAR liver residues of 0.02 mg\/kg and one in five when 201 \nresidue levels reach 0.08mg\/kg. 202 \n3.2. The extent of SGAR exposure in Canada 203 \nOf the two  species sampled over a relatively broad area of Canada (great horned owl, 204 \nred-tailed hawk), great horned owls were most consistently exposed to SGARs (Figure 205 \n3). Roughly 65% of great horned owls across Canada had detectable levels of SGARs in 206 \n 11 \ntheir liver (detection limit of 0.005 mg\/kg ww). Frequency of exposure in red-tailed 207 \nhawks seemed to increase eastward from the Prairie Provinces to Ontario and Quebec. 208 \nThe frequency of exposed birds was the lowest (~20%) in the Prairie and Northern 209 \nprovinces (and territories), increased to ~70% in Ontario and reached the highest in 210 \nQuebec (~90% of red-tailed hawks found with detectable SGAR liver residues), although 211 \nthe sample size in Quebec was smaller than in the other regions. However, as sampling 212 \nwas fortuitous and sampling effort was not uniform, these spatial comparisons must be 213 \nconsidered preliminary. 214 \nGreat horned owls and red-tailed hawks were exposed to a number of SGARs (Figure 215 \n4). The majority of great-horned owls had multiple compounds in the liver; it was the 216 \nonly species with detectable levels of all three registered compounds. Sixty percent of 217 \nred-tailed hawks had detectable liver residues of one or two compounds (Figure 4).  218 \nAlthough the proportion of great horned owls with detectable residues was greater than 219 \nfor red-tailed hawks, this difference was not significant when data were compared for 220 \nthose provinces from which carcasses of both species were collected  (Prairie Provinces, 221 \nOntario and Quebec; (paired t-test, t(2)= - 0.78, p = 0.26; Figure 4).  Brodifacoum and 222 \nbromadiolone were both detected in great horned owls and red-tailed hawks.  223 \nDifethialone was only ever detected in great horned owls (Table 2) but has only been 224 \nregistered in Canada relatively recently.   225 \nWhen the liver SGAR concentrations in great horned owls measured in the present 226 \nstudy were plotted as a cumulative frequency graph (Figure 5; birds with detectable 227 \nresidues only), it was apparent that approximately 25% had liver SGARs that exceeded 228 \nthe 20% probability level for effect (0.07mg\/kg; Table 1).  The lack of a probability curve 229 \n 12 \nfor red-tailed hawks precludes making a similar calculation for that species, but it is 230 \nevident that liver residue levels were much lower than for great-horned owls (Figure 5 231 \nand 6). For-example, 50% of great horned owls with detectable residues had liver 232 \nconcentrations greater than 0.05 mg\/kg ww compared with only 10% of red-tailed hawks.  233 \nComparison of liver concentrations in the two species in which birds were matched by 234 \nprovince confirmed that liver residues were significantly higher in the owls than in the 235 \nhawks (paired t-test; t(2)= - 4.0, p=0.03).  This finding is in contrast to the previously 236 \npublished literature (Figure 1) where liver residues were higher in red-tailed hawks than 237 \nin great-horned owls.  238 \nOf the small number of individuals from 13 other species analyzed from Quebec, 239 \neight of those had at least one individual with detectable liver SGAR residues (Figure 7).  240 \nThat indicates that a wide breadth of species is probably also exposed to these 241 \ncompounds elsewhere in Canada.   242 \n 243 \n4. Discussion 244 \n4.1. Toxicity Threshold 245 \nCritical SGAR liver concentrations associated with adverse effects and\/or mortality 246 \nhave not been defined for most raptor species (Walker et al. 2008a), and establishing liver 247 \n―toxicity thresholds‖ for SGARs is problematic (Stone et al. 2003).  This is partly 248 \nbecause there are a number of factors that contribute uncertainty. For instance, the limit 249 \nof quantification used to measure the liver SGAR residues can vary widely with the 250 \nanalytical method.  That can lead to underestimates of the extent of contamination but, 251 \nconversely, inflation of residue magnitude if residues which were detected but were 252 \n 13 \nbelow the level of quantification using older analytical methodology were assigned an 253 \ninflated limit value (Taylor et al. 2009). Species also vary markedly in their sensitivity to 254 \nSGARs.  This is known for laboratory mammals (World Health Organisation 1995) but 255 \nalmost nothing is known about the relative sensitivity of different avian species (Walker 256 \net al. 2008a).  Our risk probability curves strongly suggest significant differences exist 257 \namong raptor species.  258 \nTo date, the only residue toxicity threshold for SGARs in raptors that has been 259 \nsuggested is the >0.1-0.2 mg\/kg ―potentially lethal range‖ for barn owls (Newton et al. 260 \n1998, 1999).  At best, that provides a range of concern for potential toxicity, and gives no 261 \nindication of likelihood of effects. The approach described in the current study offers a 262 \nmajor advance in our ability to assess risk from SGAR residues in that it proposes 263 \nquantitative toxicity thresholds for different probability levels of dying from SGAR 264 \nintoxication for three species, including the barn owl.  If sufficient data were available, it 265 \nshould be possible to extend this approach to other species.  That, in turn, would help to 266 \nidentify raptor species that may be more sensitive to SGAR toxicity. Overall, on the basis 267 \nof the probability curves defined so far, it would seem that the >0.1-0.2 mg\/kg level for 268 \nbarn owls already carries considerable risk of acute intoxication (> 10-20% of barn owls 269 \nwith this residue being likely to suffer mortality).  Clearly, the probability of acute 270 \npoisoning associated with the 0.7 mg\/kg residue level proposed by the Rodenticide 271 \nRegistrants Task Force (Erickson and Urban 2004) is worse still. 272 \nThe probabilistic methods described here are, as with all predictive methods, subject 273 \nto biases and uncertainties.  Of these, perhaps two of the most important are likely to be 274 \nunderestimation of non-lethal residues, because birds characterised as ―zeros‖ in the 275 \n 14 \nprobabilistic plot may have metabolised some of their non-lethal SGAR residues before 276 \ndying [from non-SGAR related causes], and over-estimation of residues associated with 277 \nmortality because birds ingest more than a lethal dose before they die; animals typically 278 \ndie some 5-7 days after ingestion of a lethal dose (Meehan 1984).  Both biases would 279 \nhave the effect of flattening the probability curve.   280 \n4.2. Exposure extent in Canada 281 \n4.2.1. Spatial extent 282 \nStone et al. (2003) stated that, at the time, SGARs appeared to be present in the 283 \nmajority of great horned owls and in roughly half of the red-tailed hawks from the 284 \nsampled areas of the State of New York. That conclusion can be directly applied to our 285 \nsituation in Canada. Furthermore, a substantial fraction of a number of other raptors in 286 \nQuebec (from the western half of the province including areas surrounding Gatineau, 287 \nMontreal, Sherbrooke, Quebec and as far north as Obedjiwan) were also exposed to 288 \nSGARs (43% – or 13 of 30 birds tested), supporting the notion that other avian species 289 \nare also being impacted by SGAR use.  This wider exposure in Quebec suggests a broad 290 \ncontamination of terrestrial food chains as Accipiters, such as the Cooper‘s hawk, as well 291 \nas other species such as the merlin and the American kestrel, feed predominantly on small 292 \nbirds and occasionally on insects (Ehrlich et al. 1988). Small birds, if the source of 293 \nrodenticides, are most likely being exposed to SGARs from insects or other invertebrates, 294 \nand possibly through direct uptake of grain-based baits. 295 \nIn our study, great horned owls were consistently exposed to SGARs across the 296 \ncountry.  In apparent contrast, their daytime ecological counterpart, the red-tailed hawk, 297 \nshowed an increasing frequency of exposure eastward from the Prairie Provinces. This 298 \n 15 \ndifference could be explained by the lower dietary diversity of owls than hawks.  Marti 299 \nand Kochert (1995) showed that, on a finer scale, food-niche breadth became narrower 300 \nalong an eastward transect from the west coast of North America. This may reflect 301 \ngreater diversity of available prey in the west that could permit local populations of those 302 \ntwo raptors to increase their diet segregation in western regions (Marti and Kochert 303 \n1995). Houston et al. (1998) lists the main prey of great horned owls as including rabbits 304 \nand hares, coots and other waterfowl and mice.  While snowshoe hares (Lepus 305 \namericanus), black-tailed jackrabbits (Lepus californicus), and ground squirrels 306 \n(Spermophilus spp.) dominate the hawk‘s diet in western and northern parts of North 307 \nAmerica (Preston and Beane 2009). The bulk of their diet in eastern and midwestern 308 \nNorth America includes voles (Microtus), mice (Peromyscus spp., Reithrodontomys spp., 309 \nMus musculus), rats (Sigmodon hispidus, Oryzomys palustris), and cottontails (Sylvilagus 310 \nspp.) (Preston and Beane, 2009). Thus, it may be that in eastern areas that are more 311 \nagricultural and urban (and subject to a higher degree of SGAR use), red-tailed hawks are 312 \nexposed more frequently to SGARs through their increased feeding on rodents and 313 \nreduced predation on other prey. 314 \nTo obtain a more reliable estimate on actual exposure in Canada, we examined the 315 \nlivers of birds found dead from all causes. Our data indicate that, despite a smaller human 316 \npopulation and the harsher climate in Canada (albeit some south-western regions of the 317 \ncountry are characterised by milder weather), both of which should limit the need for 318 \nrodenticides, the scale of exposure reported in our study are comparable to those in 319 \nEurope. In the French Department of Loire Atlantique, 73% of a sample consisting of 320 \ncommon kestrels (Falco tinnunculus), common buzzards (Buteo buteo), barn owls and 321 \n 16 \ntawny owls (Strix aluco) had detectable SGAR liver residues (Lambert et al. 2007). In the 322 \nUK, between 40% and 74% of barn owls, kestrels, and avian scavengers such as buzzards 323 \nand red kites (Milvus milvus) found dead from various causes had detectable liver SGAR 324 \nresidues (Newton et al. 1999; Shore et al., 1999, 2006; Walker 2008b).  However, it 325 \nshould be noted that the sampled areas of Canada were those with higher population 326 \ndensities and where landscape features are not greatly dissimilar from Europe. That may 327 \nat least in part account for the apparent similarity in the frequency of contamination.   328 \nThe widespread exposure in Canada in part most likely reflects the increase in sales 329 \nand use of SGARs in the last few decades (Albert et al. 2010), and the use of persistent 330 \ncompounds that remain detectable in the liver long after the exposure event (Laas et al. 331 \n1985).  However, it is also clear from our data that multiple exposures, as detected by the 332 \npresence of multiple compounds in the liver, are common.  Although SGARs cannot be 333 \nused legally on crops or orchards in Canada and are labelled for ‗indoor uses‘ only, 334 \n‗indoor‘ is defined to include use of baits outside farms and food establishments.  This is 335 \nlikely to increase the exposure of non-target organisms.  SGARs in Canada are currently 336 \nlabelled for domestic use although this is likely to change soon.  Proposed regulatory 337 \nactions relating to exposure risks for wildlife includes (amongst others), prohibiting use 338 \nof SGAR compounds in residential settings or outdoor areas where wildlife may be 339 \nexposed. In the case of commercial applications, bait stations would be required where 340 \nwildlife could be exposed. Furthermore, labels of commercial class products would be 341 \namended to state that those products could be used only by certified operators, farmers 342 \nand persons authorized in government-approved pest control programs (Pest Management 343 \n 17 \nRegulatory Agency 2009). Those risk mitigation measures should have an overall 344 \npositive impact on reducing unnecessary exposure risks to wildlife. 345 \nRegarding the impact of SGARs, we must be cautious in extrapolating from our data 346 \nto predict likely mortality. However, if the probability of mortality is applied to each 347 \nresidue value in our dataset for great horned owls, this equates to an estimated predicted 348 \nmortality of 11% (calculated by multiplying the probability of being exposed to SGARs 349 \n[65% in GHOW] by the mean probability of exhibiting signs of intoxication [17% in 350 \nGHOW]). This is the first time that the scale of potential mortality from SGARs has been 351 \nestimated for any wild raptor population.  That estimate may well be too low, as some 352 \nproportion of poisoned birds likely die out of sight (Shore et al. 2005) and so be under-353 \nrepresented in our sample. Furthermore, our estimates of the scale of mortality do not 354 \naccount for any indirect effects that SGARs may have. Sub-lethal exposures may 355 \nindirectly increase mortality associated with natural or accidental events. For instance, 356 \nSGARs may hinder the recovery of birds from non-fatal collisions or accidents.  They 357 \nmay also impair hunting ability through behavioural changes such as lethargy, thus 358 \nincreasing the probability of starvation. Intoxication with rodenticides has been shown to 359 \nalter behaviour in rodents (Cox and Smith 1992) but there is no evidence to date of 360 \nindirect effects in free-ranging raptors (Shore et al. 2005).  361 \nThe lack of a probability plot for red-tailed hawks means that a comparable estimate 362 \nfor SGAR-induced mortality in Canada cannot be made for this species.  The available 363 \ndata suggest that red-tailed hawks may be more sensitive to SGARs than great horned 364 \nowls (Figure 2) but red-tailed hawks generally had lower liver SGAR concentrations in 365 \nCanada, and, it is notable that in New York, great horned owls are poisoned more 366 \n 18 \nfrequently than red-tailed hawks (Stone et al. 1999, 2003).  Additional studies and 367 \nmonitoring of red-tailed hawk SGAR residues would strengthen our ability to estimate 368 \nthe risk of toxicosis following exposure to SGARs. 369 \n4.2.2. Future directions 370 \nMost studies that investigate exposure of non-target species to SGARs have focused 371 \non the uptake of poisoned rodents by various predators (Newton et al.1990, 1999; Berny 372 \net al.1997; McDonald et al.1998; Howald et al. 1999; Shore et al. 1999, 2003). The 373 \nfinding that falcons and accipiters were also exposed in Quebec suggests that terrestrial 374 \nfood chains are broadly contaminated by SGARs despite their very restricted use. 375 \nInvertebrates represent another route of exposure, especially in insectivorous avian 376 \nspecies (Dowding et al. 2006). Some potential routes of exposure to aerial insectivores 377 \ninclude the consumption of invertebrates that previously fed on rodent faeces or carcasses 378 \nand even the consumption of ground-dwelling earthworms and beetles that ingested 379 \nresidues or actual rodent bait (Spurr and Drew 1999; Dunlevy et al. 2000). Clearly, given 380 \nthe fact that many ecosystems contain a larger proportion of insectivorous vertebrates 381 \nrelative to higher trophic predators, exposure could even be greater in those taxa 382 \n(Dowding et al. 2010). Developing probability curves or even metabolism studies for a 383 \nwider range of species would provide us with insight into the relative sensitivities and 384 \nrisks to other species (Watanabe et al 2010). Finally, researching further indirect effects 385 \nof SGARs on survival would refine current risk assessments of direct and indirect 386 \nmortalities in wildlife. 387 \n4.3. Conclusion 388 \n 19 \nOur results continue to support recommendations that persistent SGARs such as 389 \nbrodifacoum, bromadiolone and difethialone should be used with caution (or not at all in 390 \nsome circumstances) given that it appears difficult to eliminate the risk of exposure to 391 \nnon-target wildlife. The results presented will hopefully aid policy-makers in refining 392 \nrisk-assessments of SGARs on non-target wildlife.  393 \nOur results can also help regulatory agencies worldwide provide guidance on both 394 \ncommercial and residential use of SGARs and enforce appropriate risk mitigation as 395 \nneeded.  In this context, the extent of non-target exposure to SGARs may not always 396 \ndepend on the amount of bait used, but also on the way it is used (Shore et al. 2006).  397 \nFocusing on improving application methods, such as baiting in areas of high rat activity 398 \nonly, conducting periodic and frequent searches for dead or dying rodents, enclosing the 399 \nbait in a fashion that reduces invertebrate uptake may help reduce exposure of SGARs to 400 \npredatory birds and other non-target species. Whether or not rodenticide resistance is 401 \ncommon, an Integrated Pest Management (IPM) approach, that seeks to combine 402 \nmechanical, biological and chemical controls, should be favoured as opposed to relying 403 \non a purely chemical mode of control. 404 \n 405 \n 406 \n 407 \n 408 \n 409 \n 410 \n 411 \n 412 \n 413 \n 414 \n 415 \n 416 \n 20 \nAcknowledgements 417 \nWe wish to thank all the wildlife agencies, provincial ministries, Conservation Officers, 418 \nwildlife rehabilitation centers and shelters and the various wildlife rescue associations 419 \nwho submitted raptor carcasses for this study. National Wildlife Research Centre staff are 420 \nthanked for specimen bank archiving and rodenticide residue analysis. Thanks are 421 \nextended to Nick Mastrota for access to the US EPA EIIS,  Dr. Malcolm McAdie and Dr. 422 \nCraig Stephens and staff at the Centre for Coastal Health for conducting post mortem 423 \nexaminations and Dr. Ward Stone for his unflagging and inspirational work on 424 \ncontaminant and pesticide issues in New York State. Funding was from the Canadian 425 \nWildlife Service and the Pesticide Science Fund of Environment Canada. 426 \n 427 \nReferences:  428 \n 429 \nAlbert, C.A., Wilson, L.K., Mineau, P., Trudeau, S. and Elliott, J.E. 2010. Anticoagulant 430 \nrodenticides in three owl species from western Canada, 1998-2003. Arch. Environ. 431 \nContam. Toxicol. 163,451-459. 432 \n 433 \nBerny, P.J., Buronfosse, T., Buronfosse, F., Lamarque, F. and Lorgue, G. 1997. Field 434 \nevidence of secondary poisoning of foxes (Vulpes vulpes) and buzzards (Buteo buteo) by 435 \nbromadiolone, a 4-year survey. Chemosphere. 35,1817–1829. 436 \n 437 \nBuckle, A.P., Prescott, C.V. and Ward, K.J. 1994. Resistance to the first and second 438 \ngeneration anticoagulant rodenticides – a new perspective. In: Halverson, W.S., Marsh, 439 \nR.E. (eds) Proc. 16\nth\n Vert. Pest Conf. pp 138-144. 440 \n 441 \nCox, P. and Smith, R.H. 1992. Rodenticide ecotoxicology: pre-lethal effects of 442 \nanticoagulants on rat behaviour. In: Borreco JE, Marsh RE (eds) Proc. 15\nth\n Vert. Pest 443 \nConf. University of California, Davis, California, USA. pp 165-170. 444 \n 445 \nDowding, J.E., Lovegrove, T.G., Ritchie, J., Kast, S.N. and Puckett, M. 2006. Mortality 446 \nof northern New Zealand dotterels (Charadrius obscurus aquilonius) following an aerial 447 \npoisoning operation. Notornis. 53,235–239. 448 \n 449 \nDowding, C.V., Shore, R.F., Worgan, A., Baker, P.J. and Harris, S. 2010. Accumulation 450 \nof anticoagulant rodenticides in a non-target insectivore, the European hedgehog 451 \n(Erinaceus europaeus). Environ. Pollut. 158,161-66. 452 \n 453 \nDunlevy, P.A., Campbell, E.W. and Lindsey, G.D. 2000. Broadcast application of a 454 \nplacebo rodenticide bait in a native Hawaiian forest. Int. Biodeterior. Biodegradation. 455 \n45,199–208. 456 \n 457 \nEason, C.T., Murphy, E.C., Wright, G.R.G., Spurr, E.B. 2002. Assessment of risks of 458 \nbrodifacoum to non-target birds and mammals in New Zealand. Ecotoxicology. 11,35-48. 459 \n 460 \n 21 \nEhrlich, P.R., Dobkin, D.S. and Wheye, D. 1988. The birder‘s handbook – a field guide 461 \nto the natural history of North American birds. Simon & Schuster Inc. New York, New 462 \nYork.  463 \n 464 \nErickson, W. and Urban, D. 2004. Potential risks of nine rodenticides to birds and 465 \nnontarget mammals: a comparative approach. United States Environmental Protection 466 \nAgency, Washington, DC, USA. 467 \n 468 \nHedgal, P.L. and Colvin, B.A. 1988. Potential hazard to eastern screech-owls and other 469 \nraptors of brodifacoum bait used for vole control in orchards. Environ. Toxicol. Chem. 470 \n7,245-260. 471 \n 472 \nHouston, C.S., Dwight, G.S. and Christoph, R. 1998. Great Horned Owl (Bubo 473 \nvirginianus), The Birds of North America Online (A. Poole, Ed.). Ithaca: Cornell Lab of 474 \nOrnithology; Retrieved from the Birds of North America Online: 475 \nhttp:\/\/bna.birds.cornell.edu\/bna\/species\/372 476 \n 477 \nHowald, G.R., Mineau, P., Elliott, J.E., and Cheng, K.M. 1999. Brodifacoum poisoning 478 \nof avian scavengers during rat control on a seabird colony. Ecotoxicology 8,429-446. 479 \n 480 \nLaas, F.Y., Forss, D.A., Godfrey, M.E.R. 1985. Retention of brodifacoum in sheep 481 \ntissues and excretion in faeces. N.Z. J. Agric. Res. 28,357–359. 482 \n 483 \nLambert, O., Pouliquen, H., Larhantec, M., Thorin, C. and L‘Hostis, M. 2007. Exposure 484 \nof raptors and waterbirds to anticoagulant rodenticides (difenacoum, bromadiolone, 485 \ncoumatetralyl, coumafen, brodifacoum): epidemiological survey in Loire Atlantique 486 \n(France). Bull. Environ. Contam. Toxicol. 79,91-94. 487 \n 488 \nMcDonald, R.A., Harris, S., Turnbull, G., Brown, P. and Fletcher, M. 1998. 489 \nAnticoagulant rodenticides in stoats (Mustela erminea) and weasels (Mustela nivalis) in 490 \nEngland. Environ. Pollut. 103,17–23. 491 \n 492 \nMarti, C.D. and Kochert, M.N. 1995. Are Red-tailed Hawks and Great Horned Owls 493 \ndiurnal-nocturnal dietary counterparts? Wilson Bull. 107,615-628. 494 \n 495 \nMastrota, N.F. 2007. EIIS Version 2.0 – User Manual. EFED Information and Support 496 \nBranch, Environmental Fate and Effects Division, Office of Pesticide Programs, USA. 497 \n 498 \nMeehan, A.P. 1984. Rats and Mice: their Biology and Control. Rentokil Limited, East 499 \nGrinstead, Sussex, UK. 500 \n 501 \nNewton, I., Wyllie, I. and Freestone, P. 1990. Rodenticides in British barn owls. Environ. 502 \nPollut. 68,101-117. 503 \n 504 \nNewton, I., Dale, L., Finnie, J.K., Freestone, P., Wright, J., Wyatt, C. and Wyllie, I. 1998. 505 \nWildlife and Pollution: 1997\/98 Annual Report. JNCC Report No. 285 506 \n 22 \n 507 \nNewton, I., Shore, R.F., Wyllie, I., Birks, J.D.S., Dale, L. 1999. Empirical evidence of 508 \nside-effects of rodenticides on some predatory birds and mammals. In: Cowan DP, Feare 509 \nCJ (eds) Advances in vertebrate pest management. Filander Verlag, Furth, pp 347–367. 510 \n 511 \nNewton, I., Afsar, A., Dale, L., Finnie, J., Shore, R.F., Wright, J., Wyatt, C. and Wyllie, I. 512 \n2000. Wildlife and Pollution: 1998\/99 Annual Report. JNCC Report No.305 513 \n 514 \nParmar, G., Bratt, H., Moore, R. and Batten, P.L. 1987. Evidence for a common binding-515 \nsite in vivo for the retention of anticoagulants in rat liver. Hum. Toxicol. 6,431–432. 516 \n 517 \nPest Management Regulatory Agency. 2009. Proposed Risk Mitigation Measures for 518 \nEight Rodenticides. Re-evaluation Note REV2009-05. Health Canada. Ottawa, Ontario. 519 \n22 June 2009. 23 pages. 520 \n 521 \nPreston, C.R. and Beane, R.D. 2009. Red-tailed Hawk (Buteo jamaicensis), The Birds of 522 \nNorth America Online (A. Poole, Ed.). Ithaca: Cornell Lab of Ornithology; Retrieved 523 \nfrom the Birds of North America Online: http:\/\/bna.birds.cornell.edu\/bna\/species\/052 524 \n 525 \nShore, R.F., Birks, J.D.S. and Freestone, P. 1999. Exposure of non-target vertebrates to 526 \nsecond-generation rodenticides in Britain, with particular reference to the polecat Mustela 527 \nputorius. N.Z. J. Ecol. 23,199-206. 528 \n 529 \nShore, R.F., Malcolm, H.M., Wienburg, C.L., Turk, A., Horne, J.A., Dale, L., Wyllie, I. 530 \nand Newton, I. 2001. Wildlife and pollution: 1999\/2000 Annual report. JNCC Report No. 531 \n321 532 \n 533 \nShore, R.F., Birks, J.D.S., Afsar, A., Wienburg, C.L. and Kitchener, A.C. 2003. Spatial 534 \nand temporal analysis of second-generation anticoagulant rodenticide residues in polecats 535 \n(Mustela putorius) from throughout their range in Britain, 1992–1999. Environ. Pollut. 536 \n122,183–193. 537 \n 538 \nShore, R.F., Malcolm, H.M., Wienburg, C.L., Walker, L.A., Turk, A. and Horne, J.A. 539 \n2005. Wildlife and Pollution: 2001\/02 Annual Report. JNCC Report No. 352 540 \n 541 \nShore, R.F., Malcolm, H.M., McLennan, D., Turk, A., Walker, L.A., Wienburg, C.L. and 542 \nBurn, A.J. 2006. Did foot-and-mouth disease-control operations affect rodenticide 543 \nexposure in raptors? J. Wildl. Manage. 70,588-593. 544 \n 545 \nSpurr, E.B. and Drew, K.W. 1999. Invertebrates feeding on baits used for vertebrate pest 546 \ncontrol in New Zealand. N.Z. J. Ecol. 23,167–173. 547 \n 548 \nStone, W.B., Okoniewski, J.C. and Stedelin, J.R. 1999. Poisoning of wildlife with 549 \nanticoagulant rodenticides in New York. J. Wildl. Dis. 35,187-193. 550 \n 551 \n 23 \nStone, W.B., Okoniewski, J.C. and Stedelin, J.R. 2003. Anticoagulant rodenticides and 552 \nraptors: recent findings from New York, 1998-2001. Bull. Environ. Contam. Toxicol. 553 \n70,34-40. 554 \n 555 \nTaylor, M.J., Sharp, E.A., Melton, L.M., Giela, A. and Watson, J.E. 2009. Walk on the 556 \nwild side: an investigation into secondary poisoning of wild birds using LC-MS. British 557 \nMass Spectrometry Society. 60,12-14. 558 \n 559 \nWalker, L.A., Turk, A., Long, S.M., Wienburg, C.L., Best, J. and Shore, R.F. 2008a. 560 \nSecond generation anticoagulant rodenticides in tawny owls (Strix aluco) from Great 561 \nBritain. Sci. Total Environ. 392,93-98. 562 \n 563 \nWalker, L.A., Shore, R.F., Turk, A., Pereira, M.G., and Best, J. 2008b. The Predatory 564 \nBird Monitoring Scheme (PBMS) — identifying chemical risks to top predators in 565 \nBritain. Ambio. 37,466-471. 566 \n 567 \nWalker,  L.A., Lawlor, A.J., Llewellyn, N., Peréira, M.G., Potter, E., Townsend, J., Turk, 568 \nA., and Shore, R.F. 2010. The Predatory Bird Monitoring Scheme (PBMS) Report 2006-569 \n7. A contract report from the Centre for Ecology & Hydrology to Natural England, 65 570 \npages. Retrieved from the website at   571 \nhttp:\/\/pbms.ceh.ac.uk\/docs\/AnnualReports\/PBMSreport2006_2007_FINAL.pdf 572 \n 573 \nWatanabe, K.P., Saengtienchai, A., Tanaka, K.D., Ikenaka, Y. and Ishizuka, M. 2010. 574 \nComparison of warfarin sensitivity between rat and bird species. Comp. Biochem. Phys. 575 \nC. 152,114-119. 576 \n 577 \nWorld Health Organisation. 1995. Environmental Health Criteria 175: Anticoagulant 578 \nRodenticides. World Health Organisation (WHO), Geneva. 579 \n 580 \n 581 \n 582 \n 583 \n 584 \n 585 \n 586 \n 587 \n 588 \n 589 \n 590 \n 591 \n 592 \n 593 \n 594 \n 595 \n 596 \n 597 \n 24 \nFigure captions:  598 \n 599 \nFigure 1:  Published liver SGAR residues (combined concentrations of bromadiolone, 600 \nbrodifacoum and difethialone) in barred owl (BAOW), barn owl (BNOW), great horned 601 \nowl (GHOW) and red-tailed hawk (RTHA).  Total number of birds = 270 and do not 602 \ninclude birds with non-detected residues. Diamond in the center of the box represents 603 \naverage, line is the median, box is the upper and lower quartiles and the whiskers are the 604 \nstandard deviation. Sources of the data are:  Newton et al. 1990, 1998, 2000; Stone et al. 605 \n1999, 2003; Albert et al. 2010; EIIS 2010 download. 606 \n 607 \nFigure 2: Effect plot of the probability of becoming symptomatic (0,1) as a function of 608 \nlog10 [mg\/kg]. ALL represents pooled data (n=270), BAOW represents barred owls 609 \n(n=26), BNOW represents barn owls (n=126), GHOW represents great horned owls 610 \n(n=86) and RTHA represents red-tailed hawks (n=32). Shading represents 95% 611 \nconfidence limits for ALL birds. Curves were drawn using the formula y(probability)= 612 \n1\/(1+exp(-(int + b*x)) where int is the intercept and b is the parameter estimate for X 613 \n(concentration).  614 \n 615 \nFigure 3: Percentage of great horned owls (GHOW) and red-tailed hawks (RTHA) 616 \nacross Canada sampled in our study that had detectable (≥ 0.005 mg\/kg ww) liver SGAR 617 \nresidues. No RTHA samples were collected from PYR. PYR stands for the Pacific and 618 \nYukon region of Canada and PNR is the Prairie and Northern Region. 619 \n 620 \nFigure 4:  Percentage of great horned owls (GHOW) and red-tailed hawks (RTHA) with 621 \n0, 1, 2 and 3 different SGARs detected in the liver. Tested compounds were brodifacoum, 622 \nbromadiolone and difethialone. 623 \n 624 \nFigure 5: Cumulative frequency graph for liver SGAR residues in 79 great horned owls. 625 \nRed line represents the 20% probability level for effect (0.07 mg\/kg; Table 1).  626 \n 627 \nFigure 6: Cumulative frequency graph for liver SGAR residues in 42 red-tailed hawks.  628 \n 629 \nFigure 7: Numbers of birds of prey from Québec that contained detectable and non-630 \ndetectable liver SGAR residues (13\/30 samples tested positive or 43%). 631 \n632 \n 25 \nTable 1: Toxicity threshold values (mg\/kg ww) for 5%, 10%, 15% and 20% probability 633 \nrisk levels. For-example, in barred owls (BAOW), an owl with 0.06mg\/kg SGAR 634 \nresidues in the liver would have a 5% chance of showing signs of toxicosis. Sample sizes 635 \n(n) as well as the number of positive (1) and negative (0) cases are presented. P value 636 \nrepresenting binary logit model fit is also showed. BNOW stands for barn owl, GHOW is 637 \nthe great horned owl, RTHA the red-tailed hawk and ALL represents the pooled data for 638 \nall birds. 639 \n 640 \nProbability BAOW \nn=26 \n0=22 \n1=4 \np=0.008 \nBNOW \nn=126 \n0=114 \n1=12 \np=<0.0001 \nGHOW \nn=86 \n0=62 \n1=24 \np=<0.0001 \nRTHA \nn=32 \n0=3 \n1=29 \np=0.37 \nALL \nn=270 \n0=201 \n1=69 \np=<0.0001 \n0.05 0.06 0.05 0.02 --- 0.02 \n0.10 0.09 0.09 0.03 --- 0.04 \n0.15 0.13 0.13 0.05 --- 0.06 \n0.20 0.16 0.18 0.07 --- 0.08 \n--- - values not presented if binary logit model fit was not statistically significant 641 \n 642 \n 643 \n 644 \n 645 \n 646 \n 647 \n 648 \n 649 \n 650 \n 651 \n 652 \n 653 \n 654 \n 655 \n 656 \n 657 \n 658 \n 659 \n 660 \n 661 \n 662 \n 663 \n 664 \n 665 \n 666 \n 667 \n 668 \n 669 \n 26 \nTable 2: Geometric mean (range) liver SGAR concentrations [mg\/kg ww] for great 670 \nhorned owls (GHOW) and red-tailed hawks (RTHA) from the Pacific and Yukon region 671 \nof Canada (PYR), the prairie and northern region (PNR), Ontario and Quebec.  672 \n 673 \n PYR PNR Ontario Quebec Pooled – all \nprovinces \n GHOW RTHA GHOW RTHA GHOW RTHA GHOW RTHA GHOW RTHA \nBrodifacoum 0.04 \n(0.003-\n0.61) \nn=28 \n \nN\/A 0.008 \n(0.001-\n0.016) \nn=6 \n0.004 \n(0.001-\n0.02) \nn=3 \n0.007 \n(0.001-\n0.05) \nn=17 \n0.006 \n(0.001-\n0.17) \nn=18 \n0.013 \n(0.003-\n0.08) \nn=7 \n0.01 \n(0.008-\n0.04) \nn=5 \n0.017 \n(0.001-\n0.61) \nn=58 \n0.006 \n(0.001-\n0.17) \nn=26 \nBromadiolone 0.03 \n(0.005-\n0.57) \nn=33 \n \nN\/A 0.007 \n(0.001-\n0.07) \nn=7 \n0.004 \n(0.001-\n0.008) \nn=3 \n0.01 \n(0.001-\n0.07) \nn=15 \n0.004 \n(0.001-\n0.06) \nn=25 \n0.01 \n(0.003-\n0.14) \nn=6 \n0.003 \n(0.002-\n0.006) \nn=4 \n0.018 \n(0.001-\n0.57) \nn=61 \n0.004 \n(0.001-\n0.064) \nn=32 \nDifethialone 0.02 \n(0.013-\n0.03) \nn=3 \nN\/A ND ND 0.003 \n(0.003-\n0.003) \nn=1 \nND ND ND 0.013 \n(0.003-\n0.03) \nn=4 \n0 \nPooled - all \ncompounds \n0.03 \n(0.003-\n0.609) \nn=64 \nN\/A 0.007 \n(0.001-\n0.07) \nn=13 \n0.004 \n(0.001-\n0.017) \nn=6 \n0.008 \n(0.001-\n0.07) \nn=33 \n0.005 \n(0.001-\n0.17) \nn=43 \n0.012 \n(0.003-\n0.14) \nn=13 \n0.006 \n(0.002-\n0.04) \nn=9 \n0.016 \n(0.001 - \n0.61) \nn=123 \n0.005 \n(0.001 - \n0.064) \nn=58 \nN\/A = no samples obtained; ND = no detectable residue in any livers; n= number of birds with detectable 674 \nresidues. 675 \n 676 \n 677 \n 678 \n679 \n 27 \n 680 \n 681 \n 682 \n 683 \nFigure 1 684 \n 685 \n 686 \n 687 \n 688 \n 689 \n 690 \n 691 \n 692 \n 693 \n 694 \n 695 \n 696 \n \nn=270 \nn=26 \nn=126 \nn=86 \nn=32 \n \nLo\ng 1\n0\n (\nu\ng\/\ng \nw\nw\n) \n 28 \nLog10 [ppm]\nP\nro\nb\na\nb\nili\nty\nP\nro\nb\na\nb\nili\nty\n 697 \n 698 \nFigure 2  699 \n 700 \n 701 \n 702 \n 703 \n 704 \n 705 \n 706 \n 707 \n 708 \n 709 \n 710 \n711 \nRTHA \nGHOW \nALL \nBNOW \nBAOW \n 29 \n 712 \n 713 \n 714 \n 715 \n 716 \n 717 \n 718 \n 719 \n 720 \n 721 \n 722 \n 723 \n 724 \n 725 \n 726 \n 727 \n 728 \n 729 \n 730 \n 731 \n 732 \n 733 \n 734 \nFigure 3 735 \n 736 \n 737 \n 738 \n 739 \n 740 \n 741 \n 742 \n 743 \n 744 \n 745 \n 746 \n 747 \n 748 \n 749 \n 750 \n 751 \n 752 \n 753 \n 754 \n 755 \n 756 \n 757 \n0\n10\n20\n30\n40\n50\n60\n70\n80\n90\n100\nPYR PNR Ontario Quebec\nP\ne\nrc\ne\nn\nta\ng\ne\n (\n%\n)\nGHOW\nRTHA\nn=13\nn=20\nn=38\nn=41\nn=12\nn=10\nn=62\nn=0\n 30 \n 758 \n 759 \n 760 \n 761 \n 762 \n 763 \n 764 \n 765 \n 766 \n 767 \n 768 \n 769 \n 770 \n 771 \n 772 \n 773 \n 774 \n 775 \n 776 \n 777 \n 778 \n 779 \n 780 \n 781 \n 782 \nFigure 4 783 \n 784 \n 785 \n 786 \n 787 \n 788 \n 789 \n 790 \n 791 \n 792 \n 793 \n 794 \n 795 \n 796 \n 797 \n 798 \n 799 \n 800 \n 801 \n 802 \n 803 \n0\n5\n10\n15\n20\n25\n30\n35\n40\n45\n0 1 2 3\nNumber of different SGAR compounds detected\nP\ne\nrc\ne\nn\nta\ng\ne\n (\n%\n)\nGHOW\nRTHA\nn=35 \nn=26 \nn=31 \nn=20 \nn=42 \nn=19 \nn=3 \n 31 \n 804 \n 805 \n 806 \n 807 \n 808 \n 809 \n 810 \n 811 \n 812 \n 813 \n 814 \n 815 \n 816 \n 817 \n 818 \n 819 \n 820 \n 821 \n 822 \n 823 \n 824 \n 825 \n 826 \n 827 \nFigure 5 828 \n 829 \n 830 \n 831 \n 832 \n 833 \n 834 \n 835 \n 836 \n 837 \n 838 \n 839 \n 840 \n 841 \n 842 \n 843 \n 844 \n 845 \n 846 \n 847 \n 848 \n 849 \n0.2 0.4 0.6\n0\n20\n40\n60\n80\n100\nConcentration (ppm)\nC\nu\nm\nu\nla\nti\nv\ne\n F\nre\nq\nu\ne\nn\nc\ny\n (\n%\n)\nC\nu\nm\nu\nla\nti\nv\ne\n F\nre\nq\nu\ne\nn\nc\ny\n (\n%\n)\n 32 \n 850 \n 851 \n 852 \n 853 \n 854 \n 855 \n 856 \n 857 \n 858 \n 859 \n 860 \n 861 \n 862 \n 863 \n 864 \n 865 \n 866 \n 867 \n 868 \n 869 \n 870 \n 871 \n 872 \nFigure 6  873 \n 874 \n 875 \n 876 \n 877 \n 878 \n 879 \n 880 \n 881 \n 882 \n 883 \n 884 \n 885 \n 886 \n 887 \n 888 \n 889 \n 890 \n0.1 0.2\n0\n20\n40\n60\n80\n100\nConcentration (ppm)\nC\nu\nm\nu\nla\nti\nv\ne\n F\nre\nq\nu\ne\nn\nc\ny\n (\n%\n)\nC\nu\nm\nu\nla\nti\nv\ne\n F\nre\nq\nu\ne\nn\nc\ny\n (\n%\n)\nC\nu\nm\nu\nla\nti\nv\ne\n F\nre\nq\nu\ne\nn\nc\ny\n (\n%\n)\nC\nu\nm\nu\nla\nti\nv\ne\n F\nre\nq\nu\ne\nn\nc\ny\n (\n%\n)\n 33 \n 891 \n 892 \n 893 \n 894 \n 895 \nFigure 7 896 \n 897 \n 898 \n 899 \n 900 \n 901 \n 902 \n 903 \n 904 \n 905 \n 906 \n 907 \n 908 \n 909 \n 910 \n 911 \n 912 \n 913 \n 914 \n 915 \n0\n1\n2\n3\n4\n5\nA\nm\ner\nic\nan\n k\nes\nte\nre\nl\nC\noo\npe\nr's\n h\naw\nk\nea\nst\ner\nn \nsc\nre\nec\nh-\now\nl\ngo\nld\nen\n e\nag\nle\nm\ner\nlin\nno\nrth\ner\nn \nsa\nw\n-w\nhe\nt o\nw\nl\nba\nrr\ned\n o\nw\nl\nba\nld\n e\nag\nle\nlo\nng\n-e\nar\ned\n o\nw\nl\nno\nrth\ner\nn \ngo\nsh\naw\nk\nro\nug\nh-\nle\ngg\ned\n h\naw\nk\nsh\nor\nt-e\nar\ned\n o\nw\nl\nsh\nar\np-\nsh\nin\nne\nd \nha\nw\nk\nN\nu\nm\nb\ne\nr \no\nf \nB\nir\nd\ns\n (\n#\n)\nBirds with non-detectable liver\nresidues\nBirds with detectable liver\nresidues\n 34 \n 916 \n 917 \n 918 \n 919 \n 920 \n"}