{"doi":"10.1080\/00236560701224726","coreId":"65922","oai":"oai:dro.dur.ac.uk.OAI2:4114","identifiers":["oai:dro.dur.ac.uk.OAI2:4114","10.1080\/00236560701224726"],"title":"Between convergence and exceptionalism : Americans and the British model of labor relations, c. 1867-1920.","authors":["Harris, Howell John"],"enrichments":{"references":[],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2007-05-01","abstract":"Between the late 1860s and the aftermath of the First World War, American discourse about the 'labor problem' - relations among workers, unions, employers, and the state - was permeated by comparisons. Reformers looked especially toward Britain, the first industrial nation, for clues about how to build an industrial relations system. This article explores how three generations of American employers reflected on what Britain's experience with relatively strong, recognized, legally secure unions could teach about how to handle the challenge of American labor. Their interest was serious, sustained, if discontinuous. It was most important at key moments of decision in the early 1900s and in 1918-19 when the Open Shop was first built, and then refurbished and defended. Examination of their understanding and representations of the British model of labor relations aids our appreciation of the ideological framework within which they conceived and constructed the American Way","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65922.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4114\/1\/4114.pdf","pdfHashValue":"2e43c00a439d5ffed60bcaa62901e29c92421bf0","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4114<\/identifier><datestamp>\n      2011-09-02T08:18:32Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Between convergence and exceptionalism : Americans and the British model of labor relations, c. 1867-1920.<\/dc:title><dc:creator>\n        Harris, Howell John<\/dc:creator><dc:description>\n        Between the late 1860s and the aftermath of the First World War, American discourse about the 'labor problem' - relations among workers, unions, employers, and the state - was permeated by comparisons. Reformers looked especially toward Britain, the first industrial nation, for clues about how to build an industrial relations system. This article explores how three generations of American employers reflected on what Britain's experience with relatively strong, recognized, legally secure unions could teach about how to handle the challenge of American labor. Their interest was serious, sustained, if discontinuous. It was most important at key moments of decision in the early 1900s and in 1918-19 when the Open Shop was first built, and then refurbished and defended. Examination of their understanding and representations of the British model of labor relations aids our appreciation of the ideological framework within which they conceived and constructed the American Way.<\/dc:description><dc:publisher>\n        Routledge<\/dc:publisher><dc:source>\n        Labor history, 2007, Vol.48(2), pp.141-173 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-05-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4114<\/dc:identifier><dc:identifier>\n        issn:0023-656X<\/dc:identifier><dc:identifier>\n        issn: 1469-9702<\/dc:identifier><dc:identifier>\n        doi:10.1080\/00236560701224726<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4114\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1080\/00236560701224726<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4114\/1\/4114.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0023-656X","0023-656x","issn: 1469-9702"," 1469-9702"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n04 November 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nHarris, Howell John (2007) ’Between convergence and exceptionalism : Americans and the British model of\nlabor relations, c. 1867-1920.’, Labor history., 48 (2). pp. 141-173.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1080\/00236560701224726\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n04 November 2008\nVersion of attached file:\nAccepted\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nHarris, H. (2007) 'Between convergence and exceptionalism : Americans and the British model of labor relations,\nc. 1867-1920.', Labor history., 48 (2), pp.\u0000141-173.\nFurther information on publishers website:\nhttp:\/\/dx.doi.org\/10.1080\/00236560701224726\nBetween Convergence and Exceptionalism:  \nA 1867-1920 \n \nBetween the late 1860s and the aftermath of the First World War, American discourse about \nth\npe\nna\nthre\nre\nch\nm\nO\nun\nap\nAm\n \nTh ions, between the emergence of the ‘labor problem’ in the 1860s and its \nap er the First World War, American thinking on labor relations was \nfre uently comparative. Americans seeking to understand the origins and nature of, and \nso\nna\ntro\npolicies, \nm\nre\nth\nla  \nfound ways\n1867-69, expl\nw\nem\nle\nmericans and the British Model of Labor Relations, c. \ne ‘labor problem’ – relations among workers, unions, employers, and the state – was \nrmeated by comparisons.  Reformers looked especially toward Britain, the first industrial \ntion, for clues about how to build an industrial relations system. This article explores how \ne generations of American employers reflected on what Britain’s experience with \nlatively strong, recognized, legally secure unions could teach about how to handle the \nallenge of American labor.  Their interest was serious, sustained if discontinuous.  It was \nost important at key moments of decision in the early 1900s and in 1918-1919 when the \npen Shop was first built, and then refurbished and defended.  Examination of their \nderstanding and representations of the British model of labor relations aids our \npreciation of the ideological framework within which they conceived and constructed the \nerican Way.  \nrough three generat\nparent resolution aft\nq\nlutions to the labor problem often looked eastward toward Britain, the first industrial \ntion. U.S. perceptions of and reactions to the British model of labor relations through these \nubled years shed light on both the influence of other nations' example on U.S. social \nand the related question of the uniqueness or otherwise of the distinctive American \nodel of workers' self-organization and labor politics which emerged.1  \nThe period during which Americans were interested in Britain's developing industrial \nlations system as a model can be dated quite precisely.2  It began in the late 1860s, during \ne first post-Civil War peak in trade union activity.  As some Americans sought solutions to \nbor unrest, they discovered that Britain had been down this rocky road before and had\n to smooth it out.  A Royal Commission on Trade Unions sat in Britain from \noring the place of unions within industry and before the law.  Its findings were \nell publicized, as was the example of successful local boards of arbitration between \nployers and labor in a growing number of comparatively well-organized trades.  The \nssons of British experience were relayed to Americans through the labor press and via a \n re.  After the 1877 crisis, Congress appointed a committee, under the Democrats’ \ny leader, Abram Hewitt of New York, to look into the labor problem in the \nnited States.  A large-scale entrepreneur in the coal, iron, and steel industries, Hewitt was a \nrsonal incarnation of the transatlantic industrial revolution-- his father was a member of the \necting crew of English mechanics who arrived in 1794 with the first steam-engine in \n2\nstudy\nco\nad\nca\nar\nst\nCo\nas the a\nbo\nre\nth  their work, “the more \nharmoniou\nha\nthe\nco\ntur\nas\nre\nA\nm\nof \nin\nco\nrai\nG\nAg nal) to England to study how labor troubles were \nhandled the 5\nHouse majorit\nU\npe\ner\n-and-lecture trip in 1870 by two Liberal MPs, friends of labor and apostles of \nnciliation.  Thomas Hughes was a Christian socialist, pioneer of workers’ education, and \nvocate of the cooperative movement; Anthony Mundella a lifelong radical and self-made \nptain of industry, a progressive employer who had established the first successful board of \nbitration in England.  Both were in the forefront of the campaign to establish a secure legal \natus for British trades unions, Hughes as a member of the pro-labor minority on the Royal \nmmission.  They had name recognition and some credibility in the United States -- Brown \nuthor of Tom Brown’s Schooldays (1857), a best-seller on both sides of the Atlantic; \nth of them thanks to their ardent advocacy of the Union cause during the Civil War and the \nstoration of good Anglo-American relations thereafter.3 \nAccording to Clifton Yearley, there were two central themes in their message: first, \nat ‘the more successfully unions were organized and able to carry on\ns their relations” with employers, the less likely it became that anyone would start \nsty, violent, or unlawful action.’ British unions therefore ‘won a vote of confidence from \n nation at large and many in the governing class.’  These strong and secure unions became \nnservative, and were thus excellent models for their fledgling American brethren in the \nbulent post-Civil War years.  Second, those unions and the employers they dealt with, \nsisted by members of the local bourgeoisie, had found a route to social peace via union \ncognition and the development of voluntaristic, non-conflictual dispute settlement systems.  \nmerican unions aspiring to the same status as their British brethren and operating in a far \nore hostile environment, or middle-class Americans concerned about the resulting problem \nlabor conflict, could adopt the same techniques.  As the Chicago Daily News commented \n 1874, ‘Great Britain has proved the truth of the theory [of arbitration].  America can \nnfidently and easily adopt it.’4 \nBetween the Molly Maguires troubles in the Anthracite District, and the great national \nlroad strike of 1877, developments which made the labor problem far more urgent, \novernor Hartranft of Pennsylvania in 1876 sent Joseph Weeks, associate editor of the Iron \ne (the heavy industries' main trade jour\n 3\nAm\nhe\nte\nun\nbu\nde\nfr\nwhi\nin\nfo\nha h better in the Old Country, and that America should import Victorian Britain's \nmethods of\nun\nfoo\nY\nref\nerica, imported from their employers, Boulton & Watt of Birmingham; he stayed on to \nlp build the first American-made engines.  In 1867, while travelling in Europe, Hewitt had \nstified to the British Royal Commission, where he emphasized that ‘between the trades’ \nions of Great Britain and those in the United States there is undoubtedly a strong analogy \nt … your organizations are more perfect than ours, and have arrived at a more complete \nvelopment.’6  He supported the Hughes-Mundella tour – both of them were personal \niends of his -- the high point of which was an all-ticket public lecture at Cooper Union \nch Hewitt’s father-in-law Peter Cooper funded, and at which ‘the respectability and \ntelligence of New York’ including ‘a large audience of working men’ were present in \nrce.7   \nWeeks and Hewitt reached the same, predictable conclusions: that these matters were \nndled muc\n conciliation and arbitration in industrial disputes, together with the responsible \nionism on which they depended.8  In offering this advice, they followed closely in the \ntsteps of one of the first comprehensive studies of the labor problem, authored by Edward \noung, chair of the U.S. Bureau of Statistics, whose Labor in Europe and America (1875) \nerred to trade unions only in the sections dealing with ancient Rome and contemporary \nritain.B\nw\nre\nth\nfa\nmi superiority of their \nsy ither to give it their \nbacking or \nen\ndi\nan\nTh\npe\n9  Young, Weeks, and Hewitt thereby established a tradition in the mid-1870s which \nould last for decades, of speaking and writing as if Britain's experience was directly \nlevant to the United States, and indeed as if it was almost the only experience relevant to \ne United States as it confronted its own labor problem.  \nThe end of this period of serious interest, sometimes bordering on admiring \nscination, can be dated with only slightly less precision than its start. Before World War I, \nddle-class Americans do not seem to have been very sure about the \nstem of industrial relations, but by the early 1920s they were ready e\nto stop caring.  A few labor activists and progressive intellectuals remained \nthusiastic for the British model of industrial relations, and it even gained support from a \nfferent quarter and for different reasons in the 1930s; but these views had little resonance \nd, crucially, no longer any policy significance.10 \n* * * \ne depression of the 1870s and the aftermath of World War I thus bracket a distinctive \nriod when American discourse about labor moved beyond old assumptions that the United \n 4\nSta\nra\nw\nA\nw\nth\nex\nperce\nart\n \n1. The Day of the Saxon12: Reformers and the Labor Problem  \nIn 1913 the labor economist and historian Henry Hoagland, in an article subtitled ‘A Study in \nAm ence \nof his emerging field on British inspiration, its lack of confidence in American institutions: \ntha\nin f\nHoagland's\nindependen\ncommonpla unionism was simply British trades unionism, \nwrit late an\nacts -- namely, that American laborers have looked to the English \nunions for leadership -- is hardly justified.  Instead, American unions...have followed \nthei\ntes was like other industrializing societies and could learn from them toward a view \npidly consolidated by the early twenties, that there was a distinctive American Way to \nhich the experiences of other nations could contribute nothing useful. As my title suggests, \nmericans began by anticipating the convergence theories of the 1960s to conclude that \nhere industrial Britain had led, America should follow, down a common path determined by \ne irresistible forces of industrialism.  But Americans arrived in the 1920s with \nceptionalism fully installed as ideology and practice.  Charting and explaining changing \nptions of the British model through this half-century, and their impact, is the rest of this \nicle’s purpose.11 \nerican Trade Unionism’ (emphasis added), complained about the intellectual depend\nThe undergraduate student of economics who knows anything at all of the history of \nmodern labor organizations generally receives his knowledge from reading the epoch-\nmaking work by Sydney (sic) and Beatrice Webb....[T]he student is led to conclude \nt modern trade unions were first developed in England and were later transplanted \null bloom to American soil. \n purpose was to explain that the American labor movement had its own \nt history, with roots decades old.  But first he felt he had to fend off the \nce assumption that American trades \nd small: \nOf course it is true that the labor organizations of this country have not always kept \npace with those of England.... It is also true that at times the English unions have been \na decade or more in advance of the American.  But the conclusion which is so often \ndrawn from these f\nr own line of development.13 \n 5\nThe British share of the labor force and the migration stream fell, and the AFL \ntablished itself under a leadership increasingly convinced that American conditions \nquired a uniquely American response.\nHo\nw\nof \npa\nan\nso\nits\n‘toget\nw\nam\nra impressed by America’s \nimmense in\nEd\nwo\nas\nex\nas\npo\nea\nB\nYearley has argued quite convincingly that British influence on American unions declined by \nthe 1890s. \nes\nre\nof\nm\nan\ninnovation\nG\nem\nagland's conclusions are unexceptionable nowadays, but at the time his exceptionalism \nas still quite unusual, even among his colleagues.  American respect for the British model \nlabor relations can be explained in two ways -- institutional and intellectual.  Americans, \nrticularly those of British origin, looked to British experience as both the best-developed \nd the most comparable example for them to study and appropriate, the achievement of a \nciety and culture with which they were closely connected.  There was a natural kinship; as \n president, Henry Towne, told the American Society of Mechanical Engineers in 1889, \nher we constitute the two branches of the great Anglo-Saxon, English-speaking race, \nhich, in accomplishment, especially in the industrial world, is at present easily the leader \nong the nations in the march of civilization.’14 \nBy the end of the nineteenth century, the novice was overtaking the old hand in the \nce for economic growth. British observers became increasingly \ndustrial power and the growing productivity advantage it depended upon.  In the \nwardian period the United States enjoyed a clear lead, and British commentators began to \nrry about their relative decline. But the differences between Britain and the United States \n industrializing nations still did not seem large enough to persuade Americans that Britain's \nperience was irrelevant. Through the Progressive Era, Britain's was not generally perceived \n a failed industrial economy; even if its economic performance compared increasingly \norly with America's; it was still worthy of study and selective emulation.15 \nBritain was singularly important as a model for American labor, particularly in the \nrly decades of craft unionism.  American labor activists did not have to read about the \nritish labor movement in order to learn from it; many had direct, personal experience.16  \n17  But this did not weaken the enthusiasm of sections \n the concerned American middle class, including thoughtful employers, for the British \nodel as they understood it, which acquired a life of its own.  Joseph Weeks, Abram Hewitt, \nd others continued sermonizing about their perception of mid-Victorian Britain's \ns in the management of industrial conflict through and after American labor’s \nreat Upheaval of the mid-1880s, and found a receptive audience, if not among their \nployees, then at least among their bourgeois brethren.18 \n 6\nWhe\nAmericans\nan\nfo\nas\npa\nth\nasso\nU\ndir\nC\nop\nto\nco\nap l Civic Federation \n(NCF)'s conference in December 1900, \nThi\nhe country of its origin, England, may well \nbe \ncons\ncon\neco\nInd\nThese new\norganic, pu\nprecedent s\ndisciplined ng path toward civic \nintegration.   \nw\nn the Pullman Strike sharpened anxieties about the labor problem, middle-class \n interest in the British experience grew.  Mundella-style arbitration in the 1860s \nd 1870s used impartial intervention from local elites (who acted as 'umpires' -- the name \nr the referee in some sports acquiring popularity and formal organization at the same time \n British employers and workers were also learning the ‘rules of the game’) to assist the \nrties to resolve their disputes, or even to reach decisions where they could not agree among \nemselves.  But by the 1890s that model was often replaced by direct discussions between \nciated employers and union leaders.  The Webbs called this ‘collective bargaining.’ \nmpires might still have a role in the resulting relationships, but mutual recognition by and \nect contact between the parties was key.  Carroll Wright, Joseph Weeks, economist Henry \narter Adams, and in due course Marcus Hanna, amongst others, tried to lead informed \ninion in the 1890s toward an understanding of what was required for this voluntarist road \n social peace to work in America too: in Weeks's words, ‘you cannot have arbitration and \nnciliation unless you have on each side a strong union.’ 19 \nThis was the new lesson reformers took from the British experience and attempted to \nply to America. As Commons commented, in his report on the Nationa\ns higher form of industrial peace – negotiation -- has now reached a formal stage \nin a half dozen large industries in the United States, which, owing to its remarkable \nlikeness to parliamentary government in t\ncalled constitutional government in industry....This remarkable form of \ntitutional government is not the creation of any single intellect, nor of any \nstitutional convention.  It did not spring self-created from the theories of \nnomists or publicists.  It 'just growed,' like Topsy and the British Constitution.  \need, it has not yet finished growing.20 \n experiments had the added legitimacy of appearing native, authentic, spontaneous, \nblic-spirited, and practical.  In addition, their resemblence to successful British \nuggested they would solve the labor problem by steering trade unions under \n, responsible leadership firmly down the reassuri\n21\nThe attention middle-class and reformist Americans paid to the British experience \nas of a piece with established patterns of thought about the nature and evolution of their \n 7\nso\ned\nso\non\nby\nSa\nSa\nhist\nm\nBr\n highpoint in \neducated A\nTh\ncu\nthe\npa\nco\nop\nrig\nTw\nve\ncom\nre\nes\nhi\npr\nth\nth\nB\nlabo\nM\nPioneer advocates Weeks and Hewitt; federal agencies (the Chicago Strike Commission of \nciety. Impressed by the forces of industrialism and what we would call 'modernization,' \nucated Americans believed that these were forcing a fundamental convergence in different \ncieties.  As Joseph Weeks put it in 1895, ‘The primary problems of civilization are material \nes; their answers are writ in fire.’22  Industrialization was a process dominated, at the time, \n the three nations thought to share a common 'Teutonic' heritage in the racial Anglo-\nxonism of the mid- to late nineteenth century.  Transformations in the meaning of Ango-\nxonism, away from romantic racialism and toward an interpretation emphasizing a shared \nory, language, and political tradition, further accentuated Americans tendency to \ninimize or ignore the institutional and cultural barriers to policy borrowing from Great \nitain that an exceptionalist analysis would emphasize.23   \nThe late nineteenth and early twentieth centuries also marked the\nmericans' respectful familiarity with this Anglo-American common culture.  \nanks to the influence of American Historical Association policy on the high-school \nrriculum after 1889, more Americans studied British history in depth as the foundation for \nir own history in the early twentieth century than ever before or since.24  And that shared \nst shaped how Americans understood the British model of labor relations, and its American \nunterparts.  Commons could write about the Interstate Conference between bituminous coal \nerators and miners as being like a medieval parliament of Lords and (sic) Commons, \nhtly assuming that most of his readers could understand, indeed visualize, his simile.  \nenty years later his student William Leiserson required an even better knowledge of a \nrsion of the common past – though not his past -- when he explained that the steel \npanies' employment of unskilled workers to break skilled workers' strikes was ‘but \npetition of the Tudor Kings of England using the common people against the nobles to re-\ntablish absolute monarchy.’  One of the attractive features of this Whiggish version of \nstory to American labor reformers like Commons or Leiserson was its doctrine of inevitable \nogress toward democracy. When Commons spoke about the 'constitutionalizing' of industry \nrough the wider application of the trade agreement idea, his readers would have understood \nat he did not anticipate an American-model written constitution, but something more like \nritain's informal constitutional order, an accumulation of precedents – a common law of \nr.25 \n* * * \niddle-class Americans' understanding of the British model became fixed by the early 1900s.  \n rican labor problem, even after the failure of NCF-style voluntarism in 1901-2 and \ne launching of the Open Shop movement in 1903. Unions were stagnant at best, employers \n the offensive, conflict worsening.  Convergence was evidently not happening; instead, the \nxceptional’ American system was taking shape . Committed to trade unionism and \nllective bargaining to bring a measure of ‘democracy in industry,’ American progressives \nced hostile American employers and judges. They still looked to the British example, at \nt as they understood it, for inspiration.  The prewar British reality of growing industrial \nrest would not have been as useful, so it was ignored. \n8\n18\nCo\nnu\nhi\nm\nre\nw\nem\nco\nor\nco\nco\nm\nm\nacquire \nbe\npe\nw\nvo\nal\npe d union growth and increasing militancy.  Instead, the lessons of the mid- to late-\nVictorian compromise among unions, employers, and the state were still held to be relevant \nto the Ame\nth\non\n‘e\nco\nfa\nleas\nun\n94, the Bureau of Labor, the Industrial Commission, and the Anthracite Coal Strike \nmmission of 1902-3); the experts who had influenced them, and whose careers they \nrtured (Carroll Wright, Walter Weyl, Jeremiah Jenks, Dana Durand, and Commons \nmself); and the NCF, which Wright, Durand, and Commons used to disseminate their \nessage -- had relayed much the same story, a faithful rendering of the satisfied consensus of \nspectable opinion in Britain.26  The basic elements remained plausible.  British trade unions \nere still larger, better established, and more stable than their American counterparts; British \nployers appeared more reconciled to union recognition than their American peers; British \nllective bargaining systems looked durable and effective, and had the prestige belonging to \nganic social invention in the era of ‘evolutionary naturalism.’  A viable alternative to \nmpulsory arbitration (an alternative panacea), British voluntarism was consistent with both \nuntries' anti-statist traditions.  Britain’s comparatively peaceful strikes also contrasted ever \nore favorably with America's during the Age of Industrial Violence.27  And, finally, the \nost pressing questions of the 1900s and early 1910s for friends of labor -- How should labor \na political voice?  How could it defend itself against threats from the judiciary? – had \nen answered already in Great Britain, and in ways progressive Americans found \nrsuasive. Independent (non-socialist) labor representation in national politics, in alliance \nith the New Liberalism, and capable of freeing trade unions from judicial challenges to \nluntarism, offered an object lesson to AFL progressives and their Wisconsin School \nlies.28 \nAmericans learned little else new about British labor relations after 1900 despite the \nriod’s rapi\nThis filtering process was unsettling for contemporaries who confronted a reality \nntradicting their models.  When the young progressive intellectual Randolph Bourne co\nComment [H.J.1]:   As \nnford has explained,  \nmost instructive \nof American reform \nre is that the important \nata in reform are not so \nch the conditions of the real \nld as the pictures of the world \nch men carry in their minds.  \nAlthough these pictures may be \nshaped by...contact with problem \nsituations in the real world, they \nCharles Sa\nOne of the \nlessons \nliteratu\ndesider\nmu\nwor\nwhi\nare not one w\nand adapt th\nin the real worl\nglacial slownes\nfor Paradise, p.\nComment \nRose would \nComparisons ma\nnational boundar\nmore about the obs\nabout what is obse\nwho seem to d\ncommitted view\nthemselves into\nwhat is foreign \nnative institutions\nthe fact that when\nhave a fif\npicking u\n'America:\nInimitable?'\nith the real world \nemselves to changes \nd with almost \ns. (Sanford, Quest \n 200.) \n[H.J.2]: As Richard \nlater argue,  \nde across \nies often tell you \nerver than \nrved....Writers \nraw lessons from a \npoint often delude \n believing that \nmust be good, \nbecause what they know best they \nthink bad.  They import \nsticks...with which to beat their \n, oblivious of \n doing so they \nty-fifty chance of \np the wrong end. (Rose, \n Inevitable or \n p. 6) \n 9\n6. Like the British Institute, the American version rapidly acquired an international \ntrav\nre\nIn\nor\nBu\nin\ncr\nhopes \ntra\ndecisive, m\nca\nre\nhe\nBritish \nre\nco\n \n2. We Have Seen the Future, and It Sucks:  \nAmerican Employers and the British Model \nA  problem in histories of ideas \nabout s  matter are those of policy-\nor  business community had their \now\nun\nbe\nco\nexam gineers, an organization inspired \nby  some of Weeks's field-work for \nhim in 187\nelled to Britain in 1913, he did not find the industrial millennium his predecessors had \nported, a peaceable kingdom where capitalist lions lay down happily beside labor lambs. \nstead, ‘England is one succession of fearful strikes, and our fond theory of the triumph of \nderly trade-unionism … is daily knocked into a cocked hat.’29 \nt before Bourne and his older, less radical friends had time to adjust to this new and \nconvenient industrial Britain, the First World War struck.  The war ushered in a final \nescendo of American progressive interest in British social experimentation along with great \nthat, if it would only learn from the British example, American society would be \nnsformed in the direction of industrial democracy by the rising power of organized labor.30   \nObviously that did not occur.  Instead, there was America's second, and apparently \noment of exceptionalism.  Instead of an advance into Reconstruction (a term \nrrying none of the negative freight in Britain that it did in the United States), there was a \ntreat into Normalcy; instead of a Labour Party and industrial democracy, Republican \ngemony and the American Plan.  The rest of this article will explain why and how the \nexperience contributed to this conservative outcome almost as much as a liberal \nading of Britain’s labor relations model had inspired progressive hopes for something \nmpletely different. \n weakness of the previous section of this article -- a common\nocial policy -- is the implicit assumption that the ideas that\niented, reformist intellectuals.  But members of the American\nn sources of information about Britain, their own ideas about it and saw it as a model of an \ndesired future. And what they thought about the British model, and how it affected their \nhaviour, turned out to be far more important.   \nThe British and American employer communities had dense networks of \nmmunication, paralleling those of the transatlantic world of reform. Hewitt and Weeks, for \nple, presided over the American Institute of Mining En\n the (British) Iron and Steel Institute, whose secretary did\n 10\nme\nac\nbu\nov\nre\nA\nth\nWesti\nex\ncould look\nA\n-- \nm\nlead\npa\npr\npa\non\nA\nou\nro  arbitration: ‘a new power has \nentered into the industrial world which must be recognized.  … [T]his power can not be \ndestroyed b\nde\naf\nintervals, in strikes and lock-outs, which have no redeeming feature...  [T]he interests \nof a\nmbership; business news and reports about new technologies traveled rapidly both ways \nross the Atlantic. The American Society of Mechanical Engineers could be more insular, \nt the trade journal that was its midwife, the American Machinist, circulated widely \nerseas – so much so that it established a separate British edition – informing its far-flung \nadership of developments in labor as well as in manufacturing and managerial methods. \nmerican managers and entrepreneurs had an interest in British realities, to keep abreast of \neir most important competitors and even to acquire British manufacturing subsidiaries. \nnghouse, for example, built a factory at Trafford Park, Manchester, and gained direct \nperience of the travails of working with a British labor force in a unionized environment.31 \nThis meant that, at critical moments of labor relations crisis American businessmen \n across the Atlantic and draw distinctly different lessons than did social reformers. \nt Kim Voss's moment when exceptionalism began -- the Great Upheaval of the mid-1880s \nWeeks's boss at The Iron Age, James Bayles, was distinctly less upbeat about the British \nodel than Weeks himself.  Bayles noted the tendency of 'responsible' British labor \nership -- an essential ingredient in making union recognition and collective bargaining \nlatable to employers -- to collapse in the face of the rank-and-file militancy.  Democratic \nocesses prevented these organizations from remaining remain disciplined bargaining \nrtners. Bayles concluded that it would be better to consult with employees, but only with \ne's own employees, in house. Anticipating the preferences of a subsequent generation of \nmerican employers, he recommended the ‘shop council’ as a unilateral alternative to \ntside labor organization, and representation32 \nEven Abram Hewitt was of two minds about the wisdom or necessity of the British \nad. On the one hand, union recognition, conciliation, and\ny force and violence unless society be destroyed with it.  It must be heard.  Its just \nmands must be heeded.  This is the voice of reason as well as of religion.’33  On the other, \nter the Molly Maguires, the Hewitt also preached a gospel of pre-emption, not concession:  \nTo insure continuous operations, the best relations must exist between the corporate \nowners and the laborers in their employ… [But] throughout the coal regions these \nrelations have been of the most unsatisfactory character, resulting, at often-recurring \nll classes concur in the prevention of these destructive and demoralizing \n 11\nTen y\nbu\nim f the conditions of employment to undercut the workers’ own demand for \nunionism. \nw\nfo\nthe\nco\nal\npr\nan\nro\nco\nright \nco\nno\nob\ning the appearance of even-handedness, Hewitt’s balance of rights \nclearly fav\nth\n him in any organization, \nand when a man declines to combine it is a violation of right to refuse to work with \nhim\nto b\nA b\ndec t.  The \nclai\noperation\ncollisions, and … the owners of the property, for their own self-protection, will be \ndriven to remove the causes which have produced them.34 \nears before Bayles, Hewitt thus anticipated another of the foundation ideas of American \nsiness's exceptionalism: industrial paternalism, or welfare capitalism, the unilateral \nprovement o\nHewitt fleshed out these contradictory messages over the next fourteen years.  Unions \nere as much a product of capitalist development as were corporations themselves: ‘The \nrmation of such unions is alike a right and a duty; and so long as they confine themselves to \n assertion of the rights and the protection of the interests of their members they are to be \nmmended and encouraged.’35  But this rhetorical acceptance of trade unionism was, as \nways with American employers, wrapped around with qualifications that diminished it, in \nactice, to almost nothing.  The solution to the labor problem ‘must be based upon justice’; \nd justice must be built on a set of classic republican contractual principles, which left little \nom for actually-existing trade unionism.  Employers and workmen both had the right to \nmbine, but neither had the right to coerce the other; free-labor principles meant that ‘the \nof workmen to refrain from labor and the right of the employer to cease to employ are \nrrelative rights; but no one has the right to compel any other workman to cease from labor, \nr has the employer any right to lock out his workmen in order to compel submission to \nnoxious rules.’36 \nWhile maintain\nored capital, because it alone assumed the risks of doing business, and because \nere were some offences that only labor could commit: \nNo man has the right to compel another man to combine with\n, and to deny him the means of earning a living.  It is equally wrong for employers \nlack-list men, so that others will not give them employment. \noycott cannot be defended under any circumstances whatever.  It is in effect a \nlaration of private war...to be stamped out by prompt and severe punishmen\nm of any body of men that under any circumstances they have the right to stop the \ns of business...cannot be tolerated.37 \n d productivity, only to be tolerated if hedged around with laws, and to be undermined by \nployers' conduct within their own establishments.  Employers should hold fast to the \niple that ‘Each man should be paid wages according to the value of his labor, and not on \ne mistaken basis of a dead level of mediocrity, advocated and enforced by some trades-\nganization.  Progress is only possible where the individual is encouraged to develop his \nill and apply his labor, by a payment in proportion to the results achieved.’  Beyond this, \ney should develop novel systems of reward -- profit sharing, and, best of all, employee \n12\nTh\nac\ntra\nem\nfu\non\n‘in\nabout ultim\nla\nel\nev\ncourts and \nbe\nlabo\nth\nof \nun\nge\nthe \nind\ngrad\npro\nand\nwh\nThus, to H , \nan\nem\nprinc\nth\nor\nsk\nth\nat should be plain enough: unions were acceptable in principle, provided they did not \ntually do those things on which their power depended.  Hewitt's vision was of a future with \nde unions -- but without strikes or collectively-imposed limitations on the freedom of \nployers or employees.  Hewitt's limited commitment to arbitration and conciliation was a \nnction of his hatred of industrial conflict, for which civilized substitutes must be found; \nce the latter ‘competent tribunals’ were in place, strikes and lock-outs would be \ndefensible.’  Conciliation and arbitration were simply ‘transitional means for bringing \nthe ate relations of peace and harmony which must exist between capital and \nbor.’38  Evidently, Hewitt imported the British model very selectively, choosing only those \nements that addressed his immediate concern -- conflict-reduction -- while overlooking \nerything else, notably the general acceptance by parliament, and to a lesser extent the \nemployers, of everyday trades union practices that he found intolerable. \nIndeed, Hewitt shared many negative stereotypes about British labor relations \ncoming commonplace among his peers.  Already in 1867, alongside plaudits to British \nr, he complained about ‘strikes long continued and in all branches of business, reducing \ne workmen to beggary and destroying the profits of capital to such an extent that in a spirit \nself-preservation it takes flight where it can from the walks of industry and remains \nemployed rather than incur the risks and the anxieties of its uses in active business.’39  A \nneration later, he still accused British labor of undermining economic progress: \naction of the trade-unions has been exerted in the direction of obliterating the \nividual to such an extent that special skill is rapidly declining, and in the finer \nes of work it is almost impossible to find the experience required for the \nduction of instruments of precision.  This is a national evil of the first magnitude; \n its disastrous consequences are becoming apparent to the intelligent workman \nose opportunities to rise in life are thus abridged and destroyed.40 \newitt, trade unions were at best a necessary evil; enemies of individualism, order\n 13\npheaval in the mid-1880s, and many of the tactics they would use for decades in their anti-\nbor struggles were developed.  But the game was only just beginning.  The crucial time of \ncision for employers came later, during the short-lived Trade Agreement Era, as Jeffrey \nstoc\nin\nor hen every intelligent workman will insist upon being an \nowner, and\nin \nN\nbo\nun m of industrial relations which would do away with the necessity for \nthem altog\n[T]\nten\npro\nnew\nprin\nind\nA\nle\nIt h\nad\nHewitt \nBritish ins\npu\nm\nel\non\n* * * \nKim Voss's moment when American labor relations becam ptional is far too early.  \nAgreed, employers' anti-union predispositions were sharpened and clarified in that first Great \nU\nla\nde\nk-ownership, ‘the stimulus of being engaged in a successful business and having a direct \nterest in its results.’ The industrial millennium would not come from collective bargaining \nconciliation and arbitration, but ‘w\n every well-managed corporation will see that its workmen are directly interested \nthe results of the business.’41 \nTwo years before Homestead, four before Pullman, a dozen before the failure of the \nCF and the Anthracite Coal Strike award, Hewitt had laid down the impossibly narrow \nundaries within which trades unions could be tolerated, and made clear his preference for a \nitary-corporatist syste\nether.   \nhe concentration of force under one management, in accordance with the modern \ndency to centralization, may be made to solve, and must necessarily solve, the \nblem of harmonizing capital and labor engaged in the work of production, without \n legislation or the application of any other than familiar and well-recognized \nciples of social organization....[T]he invasion of government into the domain of \nustry must be met with uncompromising opposition.42 \ns it would be, except where the exercise of the federal government's coercive power, \ngitimized by judicial innovation, aimed at repressing labor unions and strikes.43   \nas been useful to clarify what the leading, exceptionally articulate employer \nvocate of labor-management harmony, British-style, actually meant. Not surprisingly, \nwas far more American than British in his outlook; for him, selective borrowing of \ntitutions was secondary to the pursuit of industrial relations strategies whose \nrpose was altogether different.  Union recognition, conciliation, and arbitration were \neans, not ends; they were to contain industrial conflict until the occasions for it were \niminated.  Discarding Hewitt’s equivocation, later American employers would implement \nly the latter part of his program. \ne exce\n f how much trouble and strife it would cost employers to win back a necessary \ninimum of workplace authority if they allowed unions to grow too strong in the first place? \ne rapid breakdown of the Murray Hill Agreement in 1901 backed the doubters’ arguments. \n14\nHa\nin\nR\nco\nan\nwords, ‘of t\nexperience\nst\nw\nor\nth\nan\npa\nna al systems of collective bargaining seemed, for a very short time, so \npr\nEm\nre\nem\nso\nev\nacc\nm\nex\nIn\nw\nth\nof \n British Engineers' experience?  \nInstead of demonstrating the promise of the trade agreement system, was it not instead dire \nevidence o\nm\nTh\nydu and David Brian Robertson, among others, have argued.  Between 1898 and 1903 \ndustrialists were faced with a serious challenge from dynamic AFL craft unions.  \nespectable and official opinion, represented in the NCF and through successive federal \nmmissions of the 1890s and early 1900s, still advocated the British model of conciliation \nd collective bargaining. Many American employers were, in the late Howard Gitelman's \nwo minds’ confronting labor’s challenge. Their own reading of the British \n with union power and labor conflict would help to resolve their choice.44 \nThe primary and secondary metal-processing and metal-working industries were the \norm-center during the Trade Agreement Era.  Iron and steel offered the first evidence that \nhile Hewitt's younger executive successors had little of his ambivalence toward labor \nganization, they had all of his suspicion, and sufficient power to act on their hostility. But \ne biggest failures of the NCF were in the secondary metal-working industries, the foundry \nd machine trades, whose craft union leaders and proprietary capitalists played such a large \nrt in the NCF itself, and whose experiments in union recognition and the creation of \ntional and loc\nomising. \nployers in these skill-dependent industries knew about, and were impressed by, \ncent British experience. After a huge national lock-out in 1897-98, British engineering \nployers had forced 'Terms of Settlement' on the Amalgamated Society of Engineers.  To \nme, this victory demonstrated that associated employers could impose a tolerable deal on \nen the strongest craft union, and then use that union to discipline its members into \nepting harsh terms as a condition of continuing recognition. Widely discussed among the \nembers of the National Founders' and National Metal Trades Associations (NMTA), this \nample was a model for their own struggles with the Iron Molders' Union and the \nternational Association of Machinists in 1899-1904.  The latter's Murray Hill Agreement \nith the NMTA in 1900 embodied ‘most of the terms, and even some of the phraseology, of \ne “Conditions of Management” agreed upon between the Federated Engineering Employers \nGreat Britain and the Allied Trade Unions.’ 45 \nBut was this the key message to be derived from the\n 15\nAmericans understood it, but for American employers, the criticism drowned out \nalifications.  Publisher John Murray, who reissued the articles as a book, argued that he \nld[ed] to no one in appreciation of the great work accomplished by trade unions, \nt...their policy of restriction of output and of individual effort is doing more injury to the \ndustrial trade of this country than foreign tariffs.’  The articles’ author, Edwin Pratt, could \nplain that ‘the point … was … not to attack trade unionism “as an institution,” but to deal, \nTh\nco\nen\nSh\nst\nun\nbe\nengin\nre\nan\nco\nbu\nfir\nan\nfollowing sh cousins \nac\nThe\nB\nne\nne\nof \nan\nto\nB\nag\nba\nodel, much as \nNCF-type \nthe qu\n‘yie\nbu\nin\nex\ne 1901 Machinists' strike was ‘a sharp disappointment to the advocates of association and \nnference as a means of averting labor troubles’; ‘a forecast of the more paralyzing \ncroachments of that unwise trade-unionism which has been Britain's bane.’  Browne & \narpe's superintendent emphasized that ‘we all agree here at present that the exact issue at \nake is to unionize all the shops in the United States.  That is only a prelude to the unions' \ndertaking later on the management of the machine business.  The effect of that can easily \n seen by studying the situation in Great Britain.’  Thus the message of the British \neering trades’ unhappy experience was not that an acceptable settlement could be \nached after a long and bitter strike, but that even after a supreme effort employers still faced \n intolerable union presence in their shops. As Robert Wuest, the NMTA's aggressive \nmmissioner, told his members in 1904, the real lesson of the British experience was to \nild up a strong enough organization to prevent the need to recognize organized labor in the \nst place.  ‘Let them take warning by studying the result of Great Britain's former apathy \nd indifference to questions pertaining to labor, and let us avoid the death-dealing blow by \nthat old maxim, “A Stitch in Time,” and let us not wait, as did our Engli\nross the water to “lock the stable door,” after the trade is gone.’46 \n early 1900s was perhaps the worst time for the NCF and its associates to use the \nritish case to support their project, because American employers'  by then  well-established \ngative stereotypes about British industry and its labor relations were being reinforced by \nws from Britain itself.  These were the years of the (supposed) American ‘export invasion’ \nthe British home market, and (feared) capture of Britain's export markets.  There was \nxious discussion of the reasons for this comparative failure; and many explanations pointed \nward what The Times labelled, in a series of articles in the Fall of 1901, ‘The Crisis in \nritish Industry.’  The central theme of the Times articles was that trade unions were \ngressive, restrictive, and pursuing outmoded, destructive policies, if not through formal \nrgaining then very effectively through rank-and-file action.47 \nThis message was mixed up with continuing advocacy of the British m\n 16\nrat\nem\npr\nreached Am\npe\nSc\nprinc\nTh\nso\nha\nco\nea\nth\nfou\nSo why should American employers imitate or import any part of late Victorian \nBritain's la\nFu\nun\ngo\ntra\nflo\nsa\nth\nfe\ny to acknowledge that it has any \ninfl\nchie\ndur\nWith the is\nto listen to\nher, with the abuses that had crept into an organisation which, in the opinion of many \nployers, should occupy a legitimate and even useful place in the scheme of industrial \nogress, so long as it is directed along reasonable lines.’  But the part of the message that \nerican employers was the one they were already inclined to hear.48 \nAt the very same NCF conference in December 1901 that offered up a vision of \naceful collective bargaining in the Anglo-American future, employer member Charles \nhwab, President of U.S. Steel, countered with grim skepticism.  He was, he said, \nipally interested in the labor problem from the angle of its effect on U.S. prosperity.  \ne decline of Great Britain could best be explained by the attitude of labor to capital.  ‘I am \nrry to say that every labor organization with which I have had experience in the past has \nd as its foundation the restriction of output.  It is that principle which is putting English \nmmerce and English trade in the bad position in which they are today.’  Like Hewitt \nrlier, he did not pronounce against labor unions per se, but he was certainly opposed to \nose actually existing: output-restricting, contract-breaking, etc.  And this was enough of a \nndation on which to build a rigorously anti-labor policy.49 \nbor relations system?  While Britain’s unions were crippling the old country, ‘[t]he \nture,’ as H.G. Wells would put it in 1906, was ‘in America’.  In their flight from \ncompetitiveness, it was to America that British employers and managers must look for ‘the \nspel of good tidings industrially’.50  In the late nineteenth and early twentieth centuries, the \nffic of industrial investigators across the Atlantic ran both ways, with a growing counter-\nw of self-critical British observers who wandered through America and liked what they \nw.  Weeks's collaborator Stephen Jeans, summing up the results of a British investigation of \ne iron, steel, and related industries which he organized, reached a conclusion with which \nw American businessmen would disagree: \nThe trade union is not generally recognized as a militant force in the United States \nexcept now and again.  Few employers are read\nuence worth naming.  The almost absolute freedom of labour has been been the \nf instrument whereby it has won such conquests in the field of industrial economy \ning the last quarter of a century.51 \nsues presented in this fashion, who among American employers would be inclined \n the siren voices tempting them to steer their storm-tossed Yankee clipper toward \n 17\nthe Br\nco\nA\n20\nem\n‘[\ngi\n‘[T\nB\n[I]n\nsaid\npro\nind\norg\nchange, however \nma\nadh\nNone of this demonstrates any conclusive causal conn tween American employers' \nst\nth\nStr\nhi\nin\nex\nex\nin\nal\nwh\n \nitish rocks?  Leaving nothing to chance, Schwab funded a research effort to explore the \nnnection between trade unionism and restriction of output.  American scholars focus on the \nmerican section written by Commons and Walter Weyl. But this is followed by a neglected \n0 page report on Britain, the home of ‘ca' canny,’ by their collaborator John Gray.  For \nployers, this was dismal reading.  The engineering employers' splendid settlement?  \nT]here is scarcely a single clause...which is not couched in language sufficiently vague to \nve rise to controversy over its interpretation.’ The wonderful record of industrial peace?  \n]he boards of arbitration and conciliation truly give peace by producing sleep.’  The \nritish model was slow, indecisive, and obstructed change:  \n the present state of disputes between the employer and employee, it may justly be \n that the employer has ceased to have any hope of improving the organization, \ncesses, or machinery of his industry.  It is because of this attitude...that English \nustry has reached such a degree of stagnation.  Wherever the workmen are well \nanized they insist that the phrase 'new and untried conditions of work' includes any \ntrivial.  Nothing but a complete adherence to existing organization, \nchinery, material, and methods will satisfy a strong union that employers are \nering to this clause.  The possibility of all experiments is excluded.52 \n* * * \nection be\nrategic decisions for the Open Shop rather than the Trade Agreement, on the one hand, and \ne advice and information they were receiving about British industrial realities, on the other.  \nucturalist political sociologists’ and historians’ arguments in terms of power and interest, \nstory and market context, are obviously the more persuasive. The outcome of American \ndustrialists' debates and uncertainties in the early 1900s was probably overdetermined. But \nceptionalism was built in a transatlantic context; American employers, too, studied British \nperience, not to replicate but to avoid it.53  Like their lib-lab contemporaries, their interest \n it probably declined after the early 1900s: in the case of both groups, their minds were \nready made up, and they did not need new information to confuse the stereotypical views \nich supported their established positions. \n 18\n3. 1917\nAs\ninte\nex\nof\npe\nsu\nA\nga\nen\nis\nal\nin\nm ol, man- and woman-power \nmobilization, and i 55\nown\nde\nca\nD\nta\nev\npr\neconom\nto hold the balance between contending labor and capital and to earn the good will of \nbot\nhav\nleg\nwh\nrep\nThe delega l progressives and the AFL, whose \nleader, Samuel Gompers, was in effect its host.  The war economy must be built on a \n-1918: EXCEPTIONALISM CHALLENGED  \n Daniel Rodgers has recently reminded us, the First World War saw an explosion of \nrest and enthusiasm from progressive American labor-liberals in Britain's war-induced \nperiments in collectivist control of the economy and democratization of industry.  War \nfered them the possibility of rapid social and institutional change that normal gridlocked \nacetime politics could not deliver. Britain's experiments (and, even more, the rhetoric \nrrounding them) offered hopeful direction for that change, and the strengthening of Anglo-\nmerican strategic collaboration (‘Anglophilism became an integral part of American life’54) \nve Britain's wartime corporatists a splendid opportunity to do something the British always \njoy, instructing backward folk in lesser nations about how much better the United Kingdom \n at doing things. The picture they relayed to enthusiastic American audiences was of an \nmost perfectly functioning, smoothly-running governmental machine, integrating organized \nterests into policy-making and administration, proceeding by consent and yet delivering a \niracle of munitions production, industrial peace, wage contr\nmproved working conditions.  \nThe British message was convenient for Wilsonian liberals, as well as attractive in its \n right: it told them what they wanted to hear.  Soon after the United States declared war, a \nlegation of British trade union leaders, Labour MPs, and Ministry of Munitions experts \nme to the United States, invited by the Committee on Labor of the Council of National \nefense.  According to them, ‘Labor in our country has, from the beginning of the war, been \nken into the confidence of the Government, the Government seeking its cooperation on \nery conceivable occasion, and that has been one of the greatest factors in making matters \noceed smoothly.’  The Ministry of Munitions, a huge organization at the heart of the war \ny, saw its role as being  \nh sides....[A]ny good work by which we have arranged that good will could only \ne been done by that hearty cooperation which labor leaders have given to us....No \nislative enactment dealing with labor has gone before the House of Commons \nich has not first been in conference between the minister of munitions and the \nresentatives of organized labor.56   \ntion's message was music to the ears of socia\n 19\ntripartite corporatist\nin\nde\nne\nw\nhu\nyo\nha\npr\nco\nex\nco  the United States and urge and endeavor the safeguarding \nalike the right\nmunitions a\nan\npr\nac\nFo\nm  the deputy head of the Labour \nDepartment of the Ministry of Munitions put it, \nWe \nhav\nthe\ncap\nand\ntog\nTh\nlabo\nal\nw\nth\nth\n basis, where leaders of the 'responsible' labor movement were included \n the councils of state at the highest level, on par with representatives of capital.  Policy must \nvelop and be implemented through interest-group bargaining.  And, crucially, the \ncessities of mobilization must not be exploited by reactionary employers to roll back hard-\non social protections.  ‘[O]ne of the mistakes that we made in the war was to forget the \nman side.  If you are going to have a long war nothing is more fatal than to start to exhaust \nur men and women at this stage.’  The British Health of Munitions Workers Committee \nd assembled the best and most authoritative scientific evidence in support of the \noductivity as well as welfare benefits of shorter hours and other improvements in working \nnditions. American labor and its social progressive allies must now build on that \nperience so that the war led to no backward step.  It was unanimously resolved ‘That this \nmmittee approve a like policy in\ns of labor and securing the highest efficiency and economy in the production of \nnd supplies.’57 \nAngry at the hijacking of the meeting to make propaganda for collective bargaining \nd the eight-hour day, employer delegates could do little but complain. As Charles Stillman, \nesident of the American Federation of Teachers, emphasized, ‘[W]e have grown \ncustomed to looking at England as a Mecca,’ and this was never truer than in 1917-1918. \nr, if the British present was bright, the future glowed brighter yet.  And the industrial \nillennium was heading westward across the Atlantic.  As\nare out to win this war, but we have also got a much wider task than that....[W]e \ne also, after that, to in some sense reorganize the world.  We can only do that...on \n lines on which...we have already started.  We must get labor and government and \nital together.  We must get them working together and get them at conferences, \n we must create between them a spirit of confidence by which they may work \nether loyally and without faltering in order to overcome the ravages of war.58 \nus war made the British model seem more relevant than ever for social progressives and \nr’s friends.  It was useful for American mobilization agencies to be able to draw upon an \nly's experience, avoiding mistakes and imitating success; it was inspiring to have an ally \nho demonstrated that a democracy could also be efficient.  And it was uplifting to believe \nat the sacrifice of war would not be in vain, because the British idea of ‘reconstruction’ -- \nere was already even a Ministry of that name -- promised a better world after the war.59 \n 20\ngr\nin\nan\nan\nco\nor\nsy\nre\n19 er over cracks in the collapsing truce between labor, \nemployers\nim\nof \nwas si\nlib\nde\npr\nth\nWh\nsi\nfor\nde\nre\nse\nde\nga\nC\nlab\nfavori\nha\nbe\nThe Whitley Committee, a subcommittee of the Ministry of Reconstruction, had \neatest influence on the discourse of U.S. industrial relations. The Committee was tripartite \n structure and corporatist in approach, as were its recommendations for the establishment of \n integrated system of factory, regional, and industrial councils bringing together workers \nd their employers.  In already-organized industries, these councils would build on existing \nllective bargaining structures; elsewhere, there would be government sponsorship, \nganizing employer and union interests until they could manage on their own. Above this \nstem would stand a National Industrial Council; this would also be the principal \ncommendation of the United States National Industrial Conference called in the spring \n19 in a desperate effort to pap\n, and the state. \nThe Whitley scheme is less important for its details -- few of which were ever \nplemented -- than for its impact on the parallel American debate about the vexed question \nhow to put some practical meaning into the notion of ‘industrial democracy.’  One option \nmply to import bits of the British program.  In July 1919, for example, managerial \neral Henry Dennison handed out copies of the Whitley Report to his employees' \npartmental representatives to give them ideas and models to follow. 60  But such clear, \necise, and direct borrowing was rare. Instead, many of Dennison’s fellow employers saw \ne British example as more relevant than ever before, but still as a threat, not a promise. \nen other American employers reacted both to the Whitley scheme and to \nmultaneous pressures, mediated through the National War Labor Board (NWLB), for some \nm of representation in industry, they rejected the British example except as a point of \nparture or of negative reference.  They had already constructed their own exceptional labor \nlations system after 1903 during the first phase of the Open Shop Era; their challenge in this \ncond, critical phase was to resist any pressures for British-style corporatism and industrial \nmocracy.  The evolution of the thinking of Julius Cohen, attorney for the New York \nrment trade employers through the Era of the Protocol, is instructive.  Before the war, \nohen had proposed the simple, direct importation of British corporatist schemes to solve \nor problems .  But by 1919, chastened by experience, Cohen struck a more patriotic note,  \nng ‘not a British Plan, or a French Plan, or a Russian Plan, but an American Plan, in \nrmony with our institutions, our laws, our customs and our outlook generally.’61 \nJohn D. Rockefeller, Jr, himself, explained what that might mean.  In his address \nfore the War and Reconstruction Conference of the U.S. Chamber of Commerce in 1918, \n 21\nguing with one another in print back home about what they observed, and battling to \nluence a business community that they all claimed to represent, with varying degrees of \nausibility.  The most important was sent by the National Industrial Conference Board \nICB), a new organization set up in 1916 to coordinate the work of anti-union employers’ \nciations, to undertake research, propaganda, and strategic thinking on their behalf, and to \npresent them to the public and government.  The crisis of wartime labor relations had made \nese tasks urgent; the NICB’s status had also been boosted by its role as the nominating \ndy for the employers’ delegation on the War Labor Conference Board and NWLB, and \nen providing them with support.  In September 1917, the NICB became alarmed at the \nhe \nco\nin ckefeller firms had been installing since \nbefore the \nfor recogni\nHe\nwh\nunor\nor i\na si n lude all corporations \nR\npr\nla tation to a \npubl\nRo\nth\nth\nch\nun\n \n4. 1919: FROM THE BRITISH MODEL TO THE AMERICAN WAY \nIn 19\nar\ninf\npl\n(N\nasso\nre\nth\nbo\nth\ngave respectful attention to Britain's proposals but endorsed something ‘less \nmprehensive, and which is constructed from the bottom up’: plant-based, company-\nitiated employee representation, of the kind the Ro\nwar, and that the NWLB had endorsed as a compromise between labor's demands \ntion and employers' resistance. \nre, then, would seem to be a method of providing representation which is just, \nich is effective, which is applicable to all employes (sic) whether organized or \nganized, to all employers whether in associations or not, which does not compete \nnterfere with existing organizations or associations, and which, while developed in \nngle industrial corporation as a unit, may be expanded to i c\nin the same industry and ultimately all industries.62 \nockefeller's proposal was 'American' because it built on what already existed, it relied on \nivate, local initiative, and there was no explicit place in it for either the state or organized \nbor.  Thus Rockefeller set an agenda for his class, both in policy and in presen\nic which required at least the promise of democratic reform.  \nckefeller had pointed a way that other businessmen followed only after undertaking \neir own intensive examination of the contemporary realities of British industrial relations \nat rejected the image peddled by British visitors and their American labor-liberal \neerleaders.  The British model mattered more to American employers than ever before; \nderstanding it correctly might help them decide how to meet labor’s postwar challenge.   \n19, three delegations of American employers travelled around a strike-torn Britain, \n le  the Department, not appointed by any of the business community’s representative \ndies.  None were from large firms or from the heavy metal trades; none had NWLB \nrvice.  They included a small manufacturer of adding machines and an advertising and \nblishing executive from Chicago, a Connecticut cotton-mill owner, a Massachusetts shoe \nanufacturer, a New York watch manufacturer, and a southern construction executive.  They \n either from organized industries or at least from outside the Open Shop movement.  \ney were shepherded around Britain, and to the correct conclusions, by Royal Meeker, \nommissioner of Labor Statistics, and B.M. Squires, chair of the board of arbitration of the \nion-friendly U.S. Shipping Board.  Roger Babson, the Department’s chief publicist, \nplained their purpose and their message: \n22\nim\nto\n10\nal\nem\nB\ntri\nco\ntra\nbr v lutionary mood sweeping all of America’s \nEu opean \n \nar\nLa\nmonths\nsh\nth\nth\nab\nco\nLa\ncha\n The Employers’ Industrial Commission was a propaganda ploy.  Its members were \nse cted by\nbo\nse\npu\nm\nwere\nTh\nC\nun\nex\npact of the message of those dangerous British Ministry of Munitions representatives \nuring the United States calling for the adoption of a British model of war corporatism and \n0 percent unionization.  How could they resist it?  It had all the apparent authority of an \nly’s government behind it.  A fact-finding tour of the United Kingdom by American \nployers, to develop counter-arguments, was suggested, but wartime priorities interfered. \nut, the idea was not forgotten, and with victory in sight in October 1918, planning for the \np began again – to focus now on problems of reconstruction or, to use the preferred \nnservative American term, readjustment, with its implications of restoration rather than \nnsformation.  Seven months passed before the resulting European Commission – its remit \noadened because of the apparently re o\nr allies – could depart.63 \nWhile the NICB thought and prepared, others acted.  Two investigative commissions \nrived in Britain in February 1919, one from the NCF, the other from the U.S. Department of \nbor itself.  The NCF’s was the less important, despite the fact that its members spent four \n in Europe, all but three weeks of them in Britain.  The NCF was by this time a \nadow of its former self, fanatically dedicated to a shrill anti-Communism and support for \ne AFL’s conservative leaders as bulwarks against radicalism.  The delegates were nobodies, \neir comments rarely interesting though sometimes amusingly chauvinistic, their conclusions \nout British employers’ acceptance of trade unionism entirely predictable from a \nnservative corporatist body including AFL representatives.  In contrast, the Department of \nbor’s Employers’ Industrial Commission represented a far more significant and deliberate \nllenge to the emerging anti-labor consensus among American businessmen.64 \n 23\nlike the Department of Labor’s, it was full of open-shop heavyweights, including \nilliam Van Dervoort (president and proprietor of a midwestern engineering firm) and \nyall Osborne (vice-president of Westinghouse), both fresh from fighting the employers' \nrner on the NWLB; Charles Asbury, vice-president of a mid-size, staunchly anti-union, \nily-run foundry and machine shop, Enterprise Manufacturing of Philadelphia; and \nmberton Hutchinson, president of the Westmoreland Coal Co., also of Philadelphia, who \nould be an employer delegate at the President's First Industrial Conference in October 1919 \nplicitly because of the experience he had gained on the European Commission   Its staffer \nBritis\n… i\nsom\nto a\ndis\nTh\nof\nor\nre\nw\ndi romise … of constructive cooperative relations which must result in the good \nof all.’  \n Alm\nsu\nin\nab\nor\now\nal\nwas \non\n Determined to counter this dangerous message, the NICB’s commission finally set out \nin May. Un\nW\nLo\nco\nfam\nPe\nw\nex\nh industrial experiences have for many years been along the same paths as ours; \nt may be assumed from industrial history that the United States will follow \newhat later along similar paths as Great Britain.... British employers … are now \n surprising degree united in the belief that disorganization of the employed spells \norder and all its attendant dangers.  This view is quite in line with the insistent \nmessages of the United States Department of Labor that employers and employees \nshould 'get together,' and that by 'collective bargaining' labor unrest is allayed.65 \nese conclusions were clear and convenient, and were backed by ‘facts’ and the signatures \n the Department’s hand-picked business team. The friendly relations among government, \nganized employers, and trade unions, and their shared enthusiasm for Whitleyism, was ‘a \nvelation’ to these hapless provincials – had they been at all clued up before departure, they \nould not have been remotely surprised -- and would ‘be a revelation to those at home, \nsclosing the p\n66\nost all sweetness and light, with scarcely a shadow of doubt, their report was \nrprising after a two-month visit to a country where vital public services and major \ndustries were closed by mass strikes, and the commission’s labor interlocutors were frank \nout their radical plans.  As one member later reported, ‘They would tell us about the new \nder of society that they were going to bring about.  They were going to abolish private \nnership and all that sort of thing; profit was robbery, and so on.  We were considerably \narmed.’67  But Meeker, Squires, and Babson did their work so well that the report said what \nintended, offering Americans – particularly employers -- reassurance about the future, if \nly they followed the British model. \n eneral Motors, told the first national personnel conference that May, ‘To the manufacturers \naking the world safe for democracy meant to keep what we had -- it meant to preserve the \nstem of private initiative; of voluntary association for business which has made this country \neat.’ The way to do this was by being progressive, within limits, not reactionary; there was \n24\nwas J. Laurence Laughl\nChicago, a\nru\nLa\nan\nem\nre\nm\nbrou\npe\nw\nth\nN\nth\nun\nof \n The NICB’s key recommendation was similar to that of Abram Hewitt and James \nBayles ove\n his personal duty to establish direct and cordial \nrela\nBrit\nthe \nhim\nesta\nexp\nPositive pe\nalso to me\nG\nm\nsy\ngr\nin, professor emeritus of political economy at the University of \n dedicated reactionary and a well-informed, effective polemicist.68 \nThe NICB’s aim was to add credibility to its arguments by thorough research, but it \nshed out an Interim Report in July to counter any immediate fallout from the Department of \nbor report.69  The Commission had the legitimacy that came with its representative status, \nd an advantage over the earlier visitors because of its excellent contacts with British \nployer organizations.  Its resulting understanding of British realities was much more \nalistic, balanced, and complex than the Department of Labor’s airbrushed vision.  Its \nessage, too, was clear; just 180 degrees different:  ‘The forces which … have already \nght British industries to such an impasse should not, by our careless passiveness, be \nrmitted to produce the same effects upon our own.’  Britain offered, not a model, but a \nake-up call; an awful prospect of what might happen if American employers failed, like \neir British brethren, to take the responsibilities of power seriously.  The employers the \nICB met ‘strongly advised’ their American brethren to resist union growth; they admitted \nat too many of them had been ‘sluggish, thoughtless, unobserving, and selfish’ about taking \nilateral action to improve conditions of labor; they were ‘largely responsible, by their lack \nprevision, for the existing state of discontent.’70 \nr thirty years earlier:  \neach employer should regard it as\ntions with his workers.  It will not do to drift into a policy of neglect, as have some \nish employers in the past, which has borne such bitter fruit in the dissatisfaction of \npresent day.  The employer must see to it that no charge can be brought against \n of not intelligently looking out for the interests of the rank and file in his \nblishment....The employer must take the lead; much in the way of leadership is \nected of him.  He must generally plan to prevent grievances from arising.71   \nrsonnel policies were the way to protect America’s union-free environment and \net American workers’ expectations.  As Boyd Fisher, employment manager at \n 25\nop Era; that is, the acceptance of the principle of representation, and the formation of \nompany unions’ to implement it in ways some employers could tolerate, and hoped to make \neful.  In mid-June 1919 Walter Gordon Merritt of the League for Industrial Rights \n‘a \nin\nw\nth\nha\nM\nin\nwh\npo tical co\n \nU\nth\ndif\nB\ncan be ha\nsy\nto\nin\nem\nw\nan\nA m\nma\nbe \npra\nsom\nreg\ndire\nOther well\ndistinguished non-union industrial relations in the 1920s from the first phase of the Open \nSh\n‘c\nus\nmost disquieting fight … going on’ over the American worker’s demand ‘to have a share \n determining the conditions under which he worked and make the rules under which he \norked,’ but this was an opportunity as well as a crisis: ‘when you interpret the question at \ne bottom as to what labor is after, you find it is the same thing that the managers of industry \nve been after -- a right to express in the fullest extent their industrial initiative.’  Cyrus \ncCormick, Jr, of International Harvester, agreed: ‘The most outstanding fact in modern \ndustrial relations is the desire of labor to have a voice in the control of those questions \nich touch its own interest.’ Management, he added, must respond, not only from fear of the \nli nsequences of doing nothing but because it agreed with the principle.72 \nThe NICB remained faithful to the tradition of regarding Britain as a model for the \nnited States. Its report’s ‘major emphasis’ was ‘upon conditions in Great Britain, because \ne problems there are obviously most analogous to our own.’  Its investigators simply drew \nferent lessons from those of the labor-liberals.  A key conclusion was that ‘Collective \nargaining, in the sense of group-bargaining and as contrasted with individual bargaining, \nd without the existence of unions.’  Ironically, the NICB even used the radical \nndicalism of the Shop Stewards’ Movement, which seemed to some labor-liberal observers \n be such a promising means of self-actualization for workers, to demonstrate the \nadequacy of official union structures and support its arguments for plant-based, union-free \nployee representation like that pioneered by the Rockefeller firms. Such representation \nould provide ‘an opportunity for employers and their employees to meet on matters of local \nd mutual concern.’ \neans of communication between employers and workers is a practical necessity; \ntters of mutual interest necessarily arise for common consideration.  There must … \nmachinery for discussion of the many questions sure to develop respecting shop \nctices, grievances, wages, hours, and the like.  Hence the natural development of \ne body which would represent the workers in conference with the managers \narding affairs in the shops.  This need arises even where the employer is dealing \nctly with his own men without interference from outside influences.73  \n-placed advisors to American business reached the same conclusion, which \n e Committee) developed: one which ‘assures unity of interest and co-operation on \ne part of all directly concerned’ without the ‘distinctly unAmerican’ enforcement of \nionization that he said Whitleyism required.  It would be flexible, adaptable to America’s \neat variety of industrial conditions, simple, direct, and free of government supervision.  It \nould only include ‘representatives who are employees themselves, and hence…vitally \nested in the company’s success.’  It would build on already established institutions – the \nkefeller plan and its imitators, including the employee representation schemes devised by \n26\npublished th The Iron Age\nAmerican \n[T]h\nand\nthe \ncre\ncon\nope\ncla\nblunders \nthe\nbe \nof e\nA\nde\nref\nwrit\nth\nw\nw\nan\nin\nem\nnference Plan of Industrial \nD own as the Special \nConferenc\nth\nun\ngr\nw\ninter\nRoc\ne first of a series of articles in  outlining the stark choice facing \nbusiness: \ne employers in our country are where the English employers were decades ago, \n are therefore afforded a fortunate glimpse into the future which awaits them and \nnation if they follow the same course.  Will they not profit by this and endeavor to \nate a factory solidarity more attractive than class solidarity?  Will they not \nvince the workers by actual demonstration that they can gain more through co-\nration with their individual employers than by the militant, anti-social methods of \nss conflict?  ….  The chance still remains in this country to avoid the English \nby erecting an industrial government wherein associated activities beyond \n walls of the individual factory and intercorporate adjustments affecting labor will \nlargely conducted by delegates from the factory rather than national organizations \nmployers and employees.74 \nmerican employers had found their answer to Whitleyism: their own form of industrial \nmocracy.  They would continue to cite British experience in support of this preventive \norm, but wholly negatively.  J. Laurence Laughlin put their argument most amusingly, \ning for a broad middle-class audience in August 1919 – ‘If we should be asked to follow \ne example of Great Britain in her labor experiments, it would be much as if a person filled \nith emulation at the success of a menagerie should borrow for his private use a lion which \nould be certain to eat him up.’75 Herbert Rice, Treasurer of General Motors, who had been \n employer member of the NWLB, agreed: ‘I, for one, don't want to see the English system \ntroduced in this country.  England's industrial success can hardly be held up to us for \nulation. . . . Conditions are absolutely different.’ \nRice explained how different in support of the Joint Co\nemocracy that he and unnamed associates (later to become kn\n 27\nthe NWLB\nwhere unli\n The \nthe \nlike\nbut \npie\ndoe t on a dead level classification.  In England things are certainly \ndifferent.  \nAt\n. And it would suit a country ‘where the status of the workingman is not fixed and \nmited advancement is open to him according to his ability.’ \nAmerican workman apparently doesn't care to be unionized.  If he did, anything \nmanufacturer did to try to keep him out of the unions would be of no avail.  He \ns the independence and he doesn't join readily.  He is willing to co-operate, yes, \nhe prefers to stand on his own feet.  He likes the idea of being paid by premium or \nce work and bonus systems and getting paid according to his production.  He \nsn't want to ge\n76\n every point Rice, speaking for the SCC, used the incomparability of British and American \nnditions as a way of specifying what American employers should do.  In the above address \nthe National Association of Employment Managers, he presented a program for business -- \nt simply in devising plans to deal with the labor relations crisis company by company, but \n confronting, head on, the last feeble challenge from a disintegrating Wilson Administration \nthe restoration of a union-free environment. \nco\nto \nno\nin\nto \n* * * \nIn October 1919, an Industrial Conference met in Washington, with labor, business, and \n‘p\npa\nau\nex\nle\nindust\nesta\nim\nbe\nch\nco\nan\n \nre ison, AFL \nSecretary-Treasurer, cited the ‘evidence’ of the Department of Labor’s commission to focus \nublic’ representatives (ironically including Rockefeller), called by President Wilson to \ntch together an industrial truce while the Great Steel Strike was raging – hardly an \nspicious time. The task was hopeless from the start.  American employers knew by then \nactly what they wanted, and there was no effective pressure on them to settle for anything \nss.  As their group spokesman said, they ‘came to the conference with a program of \nrial relations’ drafted by the NICB in which Merritt’s was the central principle: ‘The \nblishment as a productive unit’ was its basis.77  A voluntarist, decentralized, and \nplicitly union-free industrial relations system was all they would accept.  Cleverly, they \nnt labor’s appeal for a practical right for American workers to join a union of their own \noosing, and have it recognized by their employers, into their old spectre of state-enforced \nmpulsory unionization, choosing the grounds on which to resist confident that the judiciary \nd most of the middle-class public would join them there.   \nIn vain, labor’s spokesmen appealed to British precedent, and called for union \ncognition as the best way of managing workers’ discontent. Frank Morr\n 28\non\nre\nre\nde\nba\nre\n‘e\nch\nab\nw\n \nw\nle\nw\nmi\nFr\nA\nre\nsp\nth\npl\nto est\nin\nre\nth d when Americans of different class \nbackgr\nex\nthe\ncom\n the central issue on which the Conference would break down: should employers be \nquired to recognize their workers’ independent unions as the exclusive channel of \npresentation and communication?  ‘[E]mployers in Great Britain generally recognize the \nsirability of bargaining collectively with labor.  [They] nearly all agree that collective \nrgaining should always be undertaken between associations of employers under (sic) \ngularly established and recognized trade-unions.’  In Britain’s Whitley-style joint councils \nmployers are required to deal with men or groups of men not in their employ and not \nosen from among their employees.’  Leaving aside whether what he said was true, it cut \nsolutely no ice.  As the best metaphor in the NCF Commission’s report emphasized, there \nas no longer any reason to believe ‘that medicine good for the bull is good for the eagle.’78 \nThe Conference foundered when the employer delegation insisted on the Open Shop, \nith company unionism established alongside of independent unionism as an equally \ngitimate -- and their preferred -- means of employee representation if managers and \norkers in individual establishments wanted it.  American employers had made up their \nnds, which they expressed in a language of confident exceptionalism.  As NICB chairman \nederick Fish, former president of AT&T, put it, the ‘open’ or ‘American shop’ was ‘an \nmerican institution of the highest character,’ and was thus ‘the only institution … which we \nally can ... support, as American citizens.’ Homer Ferguson of Newport News Shipbuilding, \neaking for the Chamber of Commerce section of a united employer delegation, emphasized \nat ‘to establish a condition, whether it is established in England, in Sweden, or any other \nace, whereby a man may not work freely without coercion, without being interfered with, is \nablish an un-American condition, and is to set up a power that, in course of time, will \nvolve us in the troubles of old countries and by that power even we may lose our \npresentative system of government.’79   \nThe conference collapsed, the steel strike was fought to a brutal but victorious finish, and \ne American Plan was launched.  A fifty-year perio\nounds and political persuasions had thought they could learn from Britain’s industrial \nperience ended because American employers – who had studied it closely, and learned \nir own lessons – had constructed their own system which was so ‘exceptional’ that \nparisons were no longer either necessary, possible, or useful.   \n* * * \n 29\nTh\nth\nW\nth\nen\nre\nEx\nlab\nem\nno\nex\npe\nai\nex\nhas \nw\nis article’s conclusion must display a proper modesty.  American employers did not build \ne Open Shop order in the early 1900s, and then defend and strengthen it after the First \norld War, because of their interpretation of the British model.  They had all the resources \ney needed close to hand, more than sufficient power, and a uniquely favourable \nvironment.  Instead, the argument must be that the non-union, employer-controlled, \nlatively state-free industrial relations system – the key element in ‘American \nceptionalism’ – was a project to be worked for, not a fact to be taken for granted.  The \nor problem was bitterly contested terrain for three generations of Americans, and \nployer participants in this long debate, just as much as their labor-liberal adversaries, do \nt seem to have spoken or acted as if the outcome was foreordained, or as if other nations’ \nperience had nothing to teach them.  Americans, particularly those of a liberal-labor \nrsuasion, continued to peer into the future of their own industrial relations system with the \nd of a distorted British mirror years after America was institutionally and ideologically \nceptional that, logically, nobody else's experience could be very useful model. This article \ndemonstrated that American employers too looked across the Atlantic; but, increasingly, \nhat they found there was a future to avoid, and important lessons about what not to do.  \n 30\nREFERENCES \n‘Arbitration Instead of War.’ New York Times 19 Nov. 1870, p. 4. \n‘C . 1918): 11. \n‘C\n3-\n‘L s of the Season.’ New York Times 10 Nov. 1870, p. 2. \n‘M  [editorial \ncomment]. \n‘The Engli\n‘The Lecture Season. Discourses on Various Topics Delivered Last Evening. Mr. Mundella, \nM\n‘T\nEm\n‘T\nTimes\n‘The Scientific Treatment of Strikes.’ Chicago Daily Tribune 20 Sept. 1874, p. 8. \n‘T\nC , p. 2. \nA\nTh\nB t of Labor. New York: Brentano's, 1919. \nBa\nB Labor Movement. New York: George H. Doran & \nCo., 1923. \nBlewe\nN\nB\n18 cago: Rand McNally, 1969. \nreating an American “Bolshevikii”.’ American Industry in War Time 3:4 (Jan\nreating an Industrial “Frankenstein.”’ American Industry in War Time 5:3 (25 June 1918): \n5. \necture\nr. Mundella on Capital and Labour.’ New York Times 16 Nov. 1870, p. 4\nsh Trade Disputes Bill May Pass.’ Iron Age 75 (13 Apr. 1905): 1245. \n.P., on Labor Reform and Education in England.’ New York Times 15 Nov. 1870, p. 8. \nhe Machinists' Strike in the United States: A Symposium of the Opinions of Leading \nployers.’ Engineering Magazine 21 (1901): 586-90.  \nhe Royal Commission on Trades’ Unions: Combinations and Labour in America.’ The \n, 2 July 1867, p. 10.  \nhe United States and England: The Sentiments of a Liberal Member of Parliament.’ \nhicago Daily News 15 Nov. 1870\nkin, William E. ‘Arbitration and Labor Conflict: The Middle Class Panacea, 1886-1900.’ \ne Historian 29 (1967): 565-83. \nabson, Roger W. W.B. Wilson and the Departmen\nyles, James C. The Shop Council. New York: Society for Political Education, 1886. \nlanshard, Paul. An Outline of the British \ntt, Mary H. Constant Turmoil: The Politics of Industrial Life in Nineteenth-Century \new England. Amherst: University of Massachusetts Press, 2000. \noller, Paul F.. Jr. American Thought in Transition: the Impact of Evolutionary Naturalism, \n65-1900. Chi\n 31\nBritish Labor's War Message to America: Addresses and Discussions at a Meeting of the \nC\n19\n19\nB . 'The Genesis of American Engineering Competition.' Economic History Review 2 \n(1\nCh h Methods of Industrial Peace: A Study of Democracy in Relation to \nLabor Disputes. New York: Columbia University Press, 1936. \nCo\nCohen, Julius H. Law and Order in Industry: Five Years' Experience. New York: Macmillan, \n19\nCo\nPr  pp. 1-12. \nCo\nWis  first published 1934. \nCommons, John R., ed. Trade Union and Labor Problems. Boston: Ginn & Co., 1905. \nDe  Nisbet & Co., 1919. \nDerber, Milton. The American Idea of Industrial Democracy, 1865-1965. Urbana: University \nof\nD\nTh\nProbl\nDubofsky, Melvyn, ed. Research Collections in Labor Studies: The Wilson Administration \nan\nRe\nD  Conciliation and Arbitration in the United States.’ In National Civic \nFe\nEr\nU\nFelt, Dorr E. Radicalism in Great Britain. n.p., 24 Jan. 1920. \nommittee on Labor of the Council of National Defense Held in Washington, DC on May 15, \n17, 65th Cong., 1st. Sess., Sen. Doc. No. 84. Washington, DC: Government Printing Office, \n17. \nurn, D.L\n931): 292-311. \nang, Ducksoo. Britis\nhen, Julius H. An American Labor Policy. New York: Macmillan, 1919. \n16. \nmmons, John R. ‘Trade Agreements.’ In Commons, ed., Trade Union and Labor \noblems,\nmmons, John R. Myself: The Autobiography of John R. Commons. Madison: University of \nconsin Press, 1964 ed.;\nnning, Arthur Du Pre. Scientific Factory Management. London:\n Illinois Press, 1970. \nibblee, G. Binney. ‘The Printing Trades and the Crisis in British Industry.’ [Reprinted from \ne Economic Journal 12 (1902): 1-12]. In Commons, ed., Trade Unionism and Labor \nems, Ch. 12. \nd American Workers: U.S. Commission on Industrial Relations, 1912-1915 Unpublished \ncords. Frederick, MD: University Publications of America, 1985. \nurand, E. Dana. ‘Trade\nderation, Industrial Concliliation, pp. 141-54. \nnst, Daniel R. Lawyers Against Labor: From Individual Rights to Corporate Liberalism. \nrbana: University of Illinois Press, 1995. \n 32\nFox, Alan. History and Heritage: The Social Origins of the British Industrial Relations \nSy\nFried ance and the United States, 1876-\n19\nFu tion and the Labor Question in the \nLo\nKnowledge: The American\n19\nFu ican Tradition and the New Liberalism: Social Investigation, \nSta l Learning in the Gilded Age.’ In Michael J. Lacey and Mary O. \nFu\nC\nG\nBr 939. \nG\nAm\nGerber, Larry G. The Irony of State Intervention: American Industrial Relations Policy in \nCo\nG\nAm\nG\nYo\nG oyers Confront the Labor \nProblem, 1915-1919.' Labor History 25 (1984): 189-216. \nG\nIn d.’ Business History Review 58 (1984): 153-77. \nG\n(1\nG\nMac\nstem. London: George Allen & Unwin, 1985. \nman, Gerald. State-Making and Labor Movements: Fr\n14. Ithaca: Cornell University Press, 1998. \nrner, Mary O. ‘Knowing Capitalism: Public Investiga\nng Progressive Era.’ In Mary O. Furner and Barry Supple, eds., The State and Economic \n and British Experiences. New York: Cambridge University Press, \n90, pp. 241-86. \nrner, Mary O. ‘The Republ\nte Building, and Socia\nrner, eds., The State and Social Investigation in Britain and the United States. New York: \nambridge University Press, 1993, pp. 171-241. \nannett, Frank E. and Catherwood, B.F., eds. Industrial and Labor Relations in Great \nitain: A Symposium. New York: America's Future, Inc., 1\nerber, Larry G. ‘Corporatism in Comparative Perspective: Effects of World War I on \nerican and British Labor Relations.’ Business History Review 62 (1988): 93-127. \nmparative Perspective, 1914-1939. DeKalb: Northern Illinois University Press, 2005. \nilbert, James. Designing the Industrial State: The Intellectual Pursuit of Collectivism in \nerica, 1880-1940. Chicago: Quadrangle, 1972. \nilson, Mary B. What's Past Is Prologue: Reflections on My Industrial Experience. New \nrk: Harper, 1940. \nitelman, Howard M. ‘Being of Two Minds: American Empl\nitelman, Howard M. ‘Management’s Crisis of Confidence and the Origin of the National \ndustrial Conference Boar\noing, Charles B. ‘Labour Questions in England and America.’ Engineering Magazine 19 \n900): 165-71. \nray, Howard L. War Time Control of Industry: The Experience of England. New York: \nmillan, 1918. \n titutions in Britain, 1890-1920. Princeton: Princeton University Press, 2005. \n33\nGree Pure and Simple Politics: The American Federation of Labor and Political \nAc\nHa e United \nSt\n H\non\nIlli\nH merican Impact on Great Britain 1898-1914: A Study of the United \nStates in World History. Philadelphia: University of Pennsylvania Press, 1940. \nH\nof \nH\nH\nO\nHewitt, \nRepr\nW\nH\nCo\nH\nH\nRepo\nSe\nHoagland, Henry E. ‘The Rise of the Iron Molders' International Union: A Study in American \nTr\nH\nIII\nH\nH rial Relations \nIns\nne, Julie. \ntivism, 1881-1917. New York: Cambridge University Press, 1998. \nydu, Jeffrey. Between Craft and Class: Skilled Workers and Factory Politics in th\nates and Britain, 1890-1922. Berkeley: University of California Press, 1988. \naydu, Jeffrey. Making American Industry Safe for Democracy: Comparative Perspectives \n the State and Employee Representation in the Era of World War I. Urbana: University of \nnois Press, 1997. \neindel, Richard H. The A\newitt, Abram S. ‘A Century of Mining and Metallurgy in the United States.’ Transactions \nthe American Institute of Mining Engineers [hereafter Trans. AIME] 5 (1876): 164-96. \newitt, Abram S. ‘Iron and Labor [Presidential Address].’ Trans. AIME 19 (1890): 475-514 \newitt, Abram S. ‘Sir Henry Bessemer: Address to the British Iron and Steel Institute, \nctober 2, 1890.’ In Nevins, ed., Selected Writings, pp. 137-42. \nAbram S. ‘The American Worker under High Tariffs: Speech in the House of \nesentatives on the Morrison Tariff Bill, April 30, 1884.’ in Nevins, ed., Selected \nritings of Abram S. Hewitt, pp. 227-48. \newitt, Abram S. ‘The Mutual Relations of Capital and Labor: Speech at the Church \nngress, Cincinnati, October 18, 1878.’ in Nevins, ed., Selected Writings of Abram S. \newitt, pp. 277-91. \newitt, Abram S. ‘The Production of Iron and Steel in Its Economic and Social Relations: \nrt as United States Commissioner to the Paris Exposition, 1867.’ in Allan Nevins, ed., \nlected Writings of Abram S. Hewitt. New York: Columbia University Press, 1937. \nade Unionism.’ American Economic Review 3 (1913): 296-313 \nodgson, James G. [compiler]. A Labor Party for the United States [The Reference Shelf \n:2]. New York: H.W. Wilson Co., 1925. \nogue, Richard W., ed. British Labor Speaks. New York: Boni & Liveright, 1924. \nowell, Chris. Trade Unions and the State: The Construction of Indust\n 34\nHu Trans. AIME\nJeans, J. Stephen. American Industrial Conditions and Competition: Reports of the \nCo\nSt\nJe 5. \nK\nGe\nK mocratic Mind in the Age of \nGladstone. New York: Knopf, 1969. \nK\nCa\nK\nV\nK\nRe ference held under the \nau 8-21 March 1919. Chicago: \nFr\nK\nD\nIn of the Western Efficiency Society, Chicago, 23 \nMay 1917. \nLam\nPo\nLas M. Colliers Across the Sea: A Comparative Study of Class Formation in \nSc  American Midwest, 1830-1924. Urbana: University of Illinois Press, 2000. \nLa\nW rers, 1920, VIII [Reprinted from \nSc\nLeib\nCa\nnt, Alfred E. ‘Biographical Notice of Joseph D. Weeks.’  27 (1897): 231-8. \nmmissioners Appointed by the British Iron Trade Association to Enquire into the Iron, \neel, and Allied Trades of the United States. London: BITA, 1902. \nfferys, James B. The Story of the Engineers. London: Lawrence & Wishart, 194\naufman, Bruce. The Global Evolution of Industrial Relations: Events, Ideas and the IIRA. \nneva: International Labour Organization, 2004. \nelley, Robert. The Transatlantic Persuasion: The Liberal-De\nerr, Clark. The Future of Industrial Societies: Convergence or Continuing Diversity? \nmbridge: Harvard University Press, 1983. \nirk, Neville. Labour and Society in Britain and the USA. Aldershot: Scolar Press, 1994, \nol. II, Challenge and Accommodation: 1850-1939. \nnoeppel, Charles E. ‘Organizing Industry for Economic Production.’ In Industrial \nconstruction Problems: Complete Report of the National Con\nspices of the Society of Industrial Engineers, New York City, 1\nederick H. Jaenicken Co., 1919. \nnoeppel, Charles E. ‘The Importance of the Human Factor in Industrial Preparedness.’ \nelivered before the Opening Session of the National Conference on 'The Human Factor in \ndustrial Preparedness' under the auspices \nbert, Josiah B. ‘If the Worlers Took a Notion’: The Right to Strike and American \nlitical Development. Ithaca: ILR Press, 2005. \nlett, John H.\notland and the\nughlin, J. Laurence. ‘The British Industrial Crisis.’ In Tracts for the Times: Labor and \nages. New York: National Association of Manufactu\nribner's Magazine August 1919]. \ny, James. Carroll Wright and Labor Reform: The Origins of Labor Statistics. \nmbridge: Harvard University Press, 1960. \n 35\nLe American \nEc\niserson, William M. ‘Constitutional Government in American Industries.’ \nonomic Review 12:1 [Supp.] (1922): 56-79.  \nLo letin of the Bureau of Labor No. \n50\nLo nd Its Operation.’ \nBu\n19\nLyddon, William G. British War Missions to the United States 1914-1918. London: Oxford \nUniversity Press, 1938. \nM\nMa rious Parliamentary Reports Relating to Violence in Labor \nD eel \n7. \nM\nand y Twentieth Centuries. Princeton: Princeton University Press, 1989. \nMartellone, Anna Maria. ‘In the Name of Anglo-Saxondom, for Empire and for Democracy: \nTh\nM , \npp\nM\nM\nMe . The Introduction and Development of the Works Committee in the \nDenn facturing Company [Materials for the Study of Business: Cases and Problems \nN\nM ustment and Operation of Industry in England \nSi\nBr\nM  York: League for Industrial \nRig\nM\nU\nw, A. Maurice. ‘Labor Unions and British Industry.’ Bul\n. Washington, DC: U.S. Government Printing Office, 1904. \nw, A. Maurice. ‘The British Conspiracy and Protection of Property Act a\nlletin of the Bureau of Labor No. 33. Washington, DC: U.S. Government Printing Office, \n01. \nackenzie, F.A. The American Invaders. London: Grant Richards, 1902. \nnly, Basil M. ‘Digest of Va\nisputes, February 1914.’ In Dubofsky, ed., U.S. Commission on Industrial Relations, R\narks, Gary. Unions in Politics: Britain, Germany, and the United States in the Nineteenth \nEarl\ne Anglo-American Discourse, 1880-1920.’ In David K. Adams and Cornelis A. van \ninnen, eds., Reflections on American Exceptionalism. Keele: Keele University Press, 1994\n. 83-96. \ncCormick, Cyrus, Jr. ‘Employee Representation.’ In National Association of Employment \nanagers, Proceedings, pp. 135-9. \nine, Franklyn\nison Manu\no. 7]. Chicago: University of Chicago Press, 1924. \nerchants' Association of New York. Readj\nnce 1914: A Report of Five Conferences Between Employers and Representatives of the \nitish Ministry of Munitions November, 1917. New York: The Association, 1917. \nerritt, Walter G. Factory Solidarity or Class Solidarity. New\nhts, n.d. \nills, Frederick C. Theories of Unemployment & Unemployment Relief. Ph.D., Columbia \nniversity, 1917. \nCom\nSeym\nment [H.J.3]: Lipset, \nour M. and Marks, Gary. It \nDidn't Happen Here: Why \nSocialism Failed in the United \nStates. New York: Norton, 2000. \n 36\nMitchell\nO\n, Charlotte. ‘Hughes, Thomas. 1822-1896. Social Reformer and Children’s Writer,’ \nxford Dictionary of National Biography <http:\/\/www.oxforddnb.com\/view\/article\/14091> \niewed 20 Mar. 2006]. \nontgomery, David. Beyond E\n[v\nM quality: Labor and the Radical Republicans, 1862-1872. New \nY\nM ork: The Psychological Factors in Industry and Community. \nLo\nN eedings of the First Annual Convention \n… Held at Hotel Cleveland and Cleveland Chamber of Commerce May 21-23, 1919. Newark, \nN\nN\nBr rk: E.P. Dutton & Co., 1919. \nN\nConfere w York, 16-17 \nDece\nNat\nTh\nNational Industrial Conference Board. Interim Report of the European Commission of the \nNa\nN ry in Great Britain, \nFr\nBo\nN\nTU\nN\nan\nN\nB\nPe\nR\nork: Knopf, 1967. \nyers, Charles S. Mind and W\nndon: University of London Press, 1920. \national Association of Employment Managers. Proc\nJ: C. Wolber, 1919. \national Civic Federation Commission on Foreign Inquiry. The Labor Situation in Great \nitain and France. New Yo\national Civic Federation. Industrial Conciliation: Report of the Proceedings of the \nnce Held Under the Auspices of the National Civic Federation, Ne\nmber 1901. New York: G.P. Putnam's Sons, 1902. \nional Industrial Conference Board Executive Committee Minutes, Accession No. 1057, \ne NICB, Ser. II, Bk. 1, Hagley Library, Wilmington, DE. \ntional Industrial Conference Board. Special Report No. 3. Boston: The Board, July 1919. \national Industrial Conference Board. Problems of Labor and Indust\nance and Italy: Report of the European Commission of the National Industrial Conference \nard. Special Report No. 6. Boston: The Board, Nov. 1919. \nearing, Scott. British Labor Bids for Power: The Historic Scarborough Conference of the \nC. New York: Social Science Publishers, 1926. \nearing, Scott. The British General Strike: An Economic Interpretation of Its Background \nd Its Significance. New York: Vanguard, 1926. \nevins, Allan. Abram S. Hewitt: With some Account of Peter Cooper. New York: Harper & \nros., 1935. \nrlman, Mark. Labor Union Theories in America: Background and Development. Evanston: \now, Peterson & Co., 1958. \n 37\nPer\nPo\nCo\nPh r. Oxford, England: Clarendon \nPr\nPr d. and intro.] Trade Unionism and British Industry: A Reprint of 'The \nTimes' Ar\nRa\nUniversity of Washington Press, 1971. \nR\nM\nR\nfro D: Rowman & Littlefield, 2000. \nRo\nan\nCity, NJ, \nR\nH\nlman, Selig. ‘Outline of a Bill to Bring About an Approximate Equality in the Bargaining \nwer of Labor and Capital in Unorganized Industries. 1914.’ In Dubofsky, ed., U.S. \nmmission on Industrial Relations, Reel 1. \nelps Brown, Henry. The Origins of Trade Union Powe\ness, 1983. \natt, Edwin A. [e\nticles on 'The Crisis in British Industry'. London: John Murray, 1904. \npson, Richard L. Britons View America: Travel Commentary, 1860-1935. Seattle: \nice, Herbert H. ‘Horizontal and Vertical Lines.’ In National Association of Employment \nanagers, Proceedings, pp. 139-43.  \nobertson, David Brian. Capital, Labor, and State: The Battle for American Labor Markets \nm the Civil War to the New Deal. Lanham, M\nckefeller, John D., Jr. Representation in Industry: An Address before the War Emergency \nd Reconstruction Conference of the Chamber of Commerce of the United States, Atlantic \n5 Dec. 1918. \nodgers, Daniel T. Atlantic Crossings: Social Politics in a Progressive Age. Cambridge: \narvard University Press, 1998. \nR  and Contention: Britain and America in the Twentieth \nC\nussett, Bruce M. Community\nentury. Cambridge: MIT Press, 1963. \nSe iency: A Study in British Politics and Political \nThou\nSe ustry Today: A Study of English Trends in \nIndustrial Relations. New York: Harper & Bros., 1929. \nSh\nG  1920 ed. \nSp\nPo\narle, G.R. The Quest for National Effic\nght, 1899-1914. Oxford: Blackwell, 1971. \nlekman, Benjamin M. and Sylvia K. British Ind\nadwell, Arthur. Industrial Efficiency: A Comparative Study of Industrial Life in England, \nermany and America. London: Longmans, Green & Co.,\nain, Jonathan. ‘Mundella, Anthony John. 1825-1897. Hosiery Manufacturer and \nlitician.’ <http:\/\/www.oxforddnb.com\/view\/article\/19534> [viewed 20 Mar. 2006]. \nSt\nNew York: Ho\nead, William T. The Americanization of the World: or The Trend of the Twentieth Century. \nrace Markey, 1901. \nComment\nRichard. 'America\nInimitable?'\n [H.J.4]: Rose, \n: Inevitable or \n In Richard Rose, ed., \nLessons from America: An \nExplanation. London: Macmillan, \n1974. \nent [H.J.5]: Sanford, \nL. The Quest for Paradise: \nEurope and the American Moral \nImagination. Urbana: University \nof Illinois Press, 1961. \nComm\nCharles \n 38\nStrout The American Image of the Old World. \nTaylor, Benjamin. ‘Industrial Troubles in America.’ Bulletin of the National Metal Trades \nAs\nTo .’ Transactions of the American Society of \nM\nU ritain and Sweden. Report of the \nCo\nO\nU.S. . Regulation and Restriction of Output: Eleventh Special Report. \nW overnment Printing Office, 1904. \nU\nN nt Printing Office, 1918. \nU\nIn\nWashington, DC: Government Printing Office, 1919.  \nU\nPr\n19\nU.\nV\nV . The Making of American Exceptionalism: The Knights of Labor and Class \nFormation \nW Labor Differences and Their Settlement: A Plea for Arbitration and \nConciliation. New York: Society for Political Education, 1886. \nWeek\n94\nW\nH\nW\nth  Theory.’ Comparative Studies in Society and History 11 (1969): 1-15 \n, Cushing. New York: Harper & Row, 1963. \nsociation 2:1 (Jan. 1903): 33-7. \nwne, Henry R. ‘President's Address, 1889\nechanical Engineers 11 (1889): 50-71. \n.S. Commission on Industrial Relations in Great B\nmmission on Industrial Relations in Great Britain. Washington, DC: Government Printing \nffice, 1938. \nCommissioner of Labor\nashington, DC: G\n.S. Congress, Senate, British Industrial Experience During the War [Senate Docs. Vol. 5, \no. 114, 65th Cong., 1st Sess., 1917]. Washington, DC: Governme\n.S. Department of Labor Information and Education Service. Report of the Employers' \ndustrial Commission of the U.S. Department of Labor on British Labor Problems. \n.S. Department of Labor. Proceedings of the First Industrial Conference (called by the \nesident) October 6 to October 23 1919. Washington, DC: Government Printing Office, \n20. \nS. Industrial Commission. Reports. Washington, DC: Government Printing Office, 1902. \nol. XIX. \noss, Kim\nin the Nineteenth Century. Ithaca: Cornell University Press, 1993. \neeks, Joseph D. \ns, Joseph D. ‘Some Fuel Problems [Presidential Address].’ Trans. AIME 25 (1895): \n3-55. \neeks, Joseph D. Report on the Practical Operation of Arbitration and Conciliation. \narrisburg, PA: Lane S. Hart, 1879. \neinberg, Ian. ‘The Problem of the Convergence of Industrial Societies: A Critical Look at \ne State of a\n 39\nWells, He The Future in America: A Search after Realtities. \nH\nWitte, on Law in Great Britain. 1 Nov. 1914.’ In Dubofsky, ed., U.S. \nCo\nW bitration Abroad.’ In National Civic \nFe\nW rades Association 3:1 (1904): \n35. \nWunderlin, Clarence E. Jr. Visions of a New Industrial Order: Social Science and Labor \nTheory in America's Progressive Era. New York: Columbia University Press, 1992. \nY\nKi\nPr\nrbert G. London: Chapman & \nall, 1906. \nEdwin E. ‘Trade-Uni\nmmission on Industrial Relations, Reel 14. \nright, Carroll D. ‘Trade Boards of Conciliation and Ar\nderation, Industrial Concliliation, pp. 101-140. \nuest, Robert. ‘Do It Now.’ Bulletin of the National Metal T\nearley, Clifton K.. Jr. Britons in American Labor: A History of the Influence of the United \nngdom Immigrants on American Labor, 1820-1914. Baltimore: Johns Hopkins University \ness, 1957. \n 40\n \n                                                 \nNOTES \n1 The xample of research into the world of Euro-American reformist thought is \nR\nex\nEx\nesp. Vol. II, \nM\nes\nH\nLa\n2 K\nth glo-American understandings of the ‘labor \nproblem.’ \n3 F\nAn 1825-1897).’  For the visit, see ‘The United States and England: The \nSe ber of Parliament,’ Chicago Daily News 15 Nov. 1870, p. 2, and \n‘A\nD\nRef\non\nan\nTr\n4 Y\n16\npp\n20\n5 D\nfinest e\nodgers, Atlantic Crossings.  Relatively recent works in the vast literature of 'American \nceptionalism' include Marks, Unions in Politics; Voss, Making of American \nceptionalism; Kirk's extended comparison, Labour and Society in Britain and the USA, \nChallenge and Accommodation: 1850-1939; Friedman, State-Making and Labor \novements; Robertson, Capital, Labor, and State; and Gerber, Irony of State Intervention, \np. Ch. 1. Microsocial rather than macrosocial comparison is the distinctive feature of \naydu, Between Craft and Class and Making American Industry Safe for Democracy and \nslett, Colliers Across the Sea. \naufman, Global Evolution of Industrial Relations, esp. Ch. 1, is a useful recent guide to \ne emergence of shared and distinctive An\nor biographical detail, see Mitchell, ‘Hughes, Thomas (1822-1896) and Spain, ‘Mundella, \nthony John (\nntiments of a Liberal Mem\nrbitration Instead of War,’ New York Times 19 Nov. 1870, p. 4; ‘The Lecture Season. \niscourses on Various Topics Delivered Last Evening.  Mr. Mundella, M.P., on Labor \norm and Education in England,’ New York Times 15 Nov. 1870, p. 8; and ‘Mr. Mundella \n Capital and Labour,’ New York Times 16 Nov. 1870, p. 4 [editorial comment].  Hughes \nd Mundella were archetypal representatives of what Robert Kelley termed ‘The \nansatlantic Persuasion’ – a shared reformist outlook -- in his book of that title. \nearley, Britons in American Labor, Part 4, Sections 1 and 2, quotations from pp. 169-70, \n8.  On the Hughes-Mundella visit and 'arbitration,' see also Montgomery, Beyond Equality, \n. 154-55.  For the quote, see ‘The Scientific Treatment of Strikes,’ Chicago Daily Tribune \n Sept. 1874, p. 8. \nerber, American Idea of Industrial Democracy, 1865-1965, pp. 80-82. \n 41\n                                                                                                                                                        \n6 ‘The Royal Commission on Trades’ Unions: Combinations and Labour in America,’ The \nTim\n7 ‘Le  Nov. 1870, p. 2; ‘Mr. Mundella on Capital and \nLa\n8 D American Idea of Industrial Democracy, 1865-1965, pp. 61-3, 80-82; Yearley, \nBrit\nMe\nW\nAr\nB\nH\nco\n199-\n9 A\n10 rd, Outline of the British Labor Movement; Hogue, ed., British Labor Speaks; \nHo ample; \nNe nd \nSe\nCo\nCatherwood, eds., \n11\nSo\nce\n12 Boller, American Thought in Transition, Ch. 9 [title]. \n13 Hoagland\n14\nTowne, ‘President's Address, 1889,’ pp. 57-8 [quote]. \nes (London), 2 July 1867, p. 10.   \nctures of the Season,’ New York Times 10\nbour.’ \nerber, The \nons in American Labor, p. 181.  For Hewitt, see also his ‘Century of Mining and \ntallurgy,’ 164-96 at p. 168 (parentage), and ‘Iron and Labor,’ 475-514 at pp. 487-91; for \neeks, see. Hunt, ‘Biographical Notice,’ 231-8 and his Report on the Practical Operation of \nbitration and Conciliation.  Hewitt and Weeks both wrote during the first period when \nritish labor relations were acquiring these peaceable habits -- see Fox, History and \neritage, Ch. 4; Phelps Brown, Origins of Trade Union Power, Ch. 1.  For Hewitt's \nngressional committee, see Furner, ‘Republican Tradition and the New Liberalism,’ pp. \n200. \nccording to Perlman, Labor Union Theories in America, pp. 4-5. \n See Blansha\ndgson,  A Labor Party for the United States, esp. Paul Douglas on the British ex\naring, British Labor Bids for Power and The British General Strike; Selekman a\nlekman, British Industry Today; Chang, British Methods of Industrial Peace; U.S. \nmmission on Industrial Relations in Great Britain and Sweden, Report; Gannett and \nIndustrial and Labor Relations in Great Britain. \n For convergence theories, see Weinberg, ‘Problem of the Convergence of Industrial \ncieties,’ esp. pp. 2-3, and Kerr, Future of Industrial Societies, esp. Ch. 1, on the nineteenth-\nntury antecedents of an intellectual tendency usually associated with the 1960s. \n, ‘Rise of the Iron Molders' International Union,’ p. 296.  \n Perlman, Labor Union Theories in America, pp. 145-6, 160-2; Commons, Myself, p. 71; \n 42\n                                                                                                                                                        \n15 Searle, Quest for National Efficiency; Myers, Mind and Work, pp. 126-7.  In the sections of \nthe \nor\nco\nW\nIn\n16 -47, 184-91; Jefferys, Story of the \nEngineers, pp. 61-2, 173 esp.  Recent studies of British influence within American labor \nincl\n17 Yea\n18 Hewitt, ‘Mutual Relations of Capital and Labor’ esp. pp. 281-2, 290 -- Hewitt was so \nim  and free distribution of \n25\n240\n19\nWrigh bargaining is in \nth rber, American \nId\npr\nBetwee\nIn\nLa\nar\nB\nth\n20\nPr\nes\nFinal Report of the U.S. Industrial Commission, 1900-1902, dealing with labor \nganization and state regulation of working conditions, Great Britain was usually the explicit \nmparator or model, as well as the key U.S. competitor-- see Vol. XIX, pp. 723-946 passim.  \nunderlin, Visions of a New Industrial Order, is the most thorough treatment of the \ndustrial Commission's experts and their work. \n Yearley, Britons in American Labor, esp. pp. 61, 81, 123\nude Blewett, Constant Turmoil, esp. Chs. 3, 6-7, and Laslett, Colliers Across the Sea. \nrley, Britons in American Labor, pp. 304-11, 313. \npressed by the importance of the issue that he paid for the printing\n0,000 copies of this address – and ‘American Worker under High Tariffs’ esp. pp. 234-6, \n-42, 244-5; Weeks, Labor Differences and Their Settlement. \n Akin, ‘Arbitration and Labor Conflict’; Bayles, Shop Council, pp. 4-5; Leiby, Carroll \nt and Labor Reform, pp. 153-79 on Wright's endorsement of collective \ne Report of the U.S. Strike Commission (on the Pullman strike of 1894); De\nea of Industrial Democracy, p. 76, on its entry into American usage through Adams's \nesidential address to the American Economic Association in 1896; Weeks, 'Relation \nn Employers and Employees in Manufacturing Affairs,' National Conference on \ndustrial Conciliation and Arbitration (Chicago, 1894), quoted from Akin, ‘Arbitration and \nbor,’ p. 579.  Chris Howell’s bracingly revisionist Trade Unions and the State, Ch. 3 esp., \ngues quite convincingly that contemporary observers and subsequent students of this \nritish system overlooked the key role of the British state as midwife at the troubled birth of \nese supposedly voluntary arrangements. \n ‘Trade Agreements,’ pp. 1-12 at pp. 1, 6, in Commons, ed., Trade Union and Labor \noblems. Cf. Leiserson's ‘Constitutional Government in American Industries,’ pp. 60, 62, 66 \np., indicating the continuing appeal of this analogy.  \n 43\n                                                                                                                                                        \n21 National Civic Federation, Industrial Conciliation, esp. for Wright, ‘Trade Boards of \nCon\nC\n22\nes\n23 nd for Democracy,’ pp. 83-96.  \nSee also Strout, American Image of the Old World, Ch. 8 'The Old Sweet Anglo-Saxon Spell.'  \n24\n25 C mmons, Myself, pp. 72-3; Leiserson, ‘Constitutional Government,’ p. 66.  Leiserson, \nhow rudence’ \n(p\nag\n26\nN t their \nconclusions; Shadwell, Industrial Efficiency, pp. 522, 533, 536-8, 559-60, summarizes early \ntw\n27\nth\nIn\n28\n67\nLow, \nB rs’ practical acceptance of trade unionism and its legal immunities – \npu\nPa\nthe low l\nst\nB\n‘T\nciliation and Arbitration Abroad,’ pp. 101-140 and Durand (secretary, U.S. Industrial \nommission), ‘Trade Conciliation and Arbitration in the United States,’ pp. 141-54. \n Weeks, ‘Some Fuel Problems,’ p. 943.  See also Gilbert, Designing the Industrial State, \np. Ch. 1, and Rodgers, Atlantic Crossings, Ch. 2. \n Martellone, ‘In the Name of Anglo-Saxondom, for Empire a\n Russett, Community and Contention, p. 131.  See also Chs. 6 and 8. \no\never, looked toward a more American future, with his notion of ‘industrial jurisp\n. 65) and his analogy of the arbitrator, ‘the highest interpreting authority’ under a trade \nreement, as being like the United States Supreme Court (p. 66).   \n Derber, American Idea of Industrial Democracy, pp. 118-40, and Wunderlin, Visions of a \new Industrial Order, esp. Chs. 1-4, round up all these usual suspects and presen\nentieth-century arguments for the superiority of British labor relations. \n Wright, ‘Trade Boards of Conciliation and Arbitration Abroad,’ gives the best statement of \nis position, but should be read alongside his associate Low’s ‘Labor Unions and British \ndustry.’ \n For the debate on independent labor politics, see Greene, Pure and Simple Politics, esp. pp. \n, 85, 100, 137-8, and Marks, Unions in Politics, esp. pp. 199-204.  On law and labor, see \n‘British Conspiracy and Protection of Property Act and Its Operation,’ pp. 305-22, for \nritish employe\nblished, ironically, shortly before the Taff Vale case; Manly, ‘Digest of Various \nrliamentary Reports Relating to Violence in Labor Disputes, February 1914,’ emphasizing \nevel of violence, and the superiority (and relative impartiality) of British policing of \nrikes; Perlman, ‘Outline of a Bill to Bring About an Approximate Equality in the \nargaining Power of Labor and Capital in Unorganized Industries,’ (1914); and Witte, \nrade-Union Law in Great Britain,’ 1 Nov. 1914.  Perlman and Witte understood that \n 44\n                                                                                                                                                        \ndistinctive American realities – employers’ strength and anti-union hostility, federalism and a \npo\nlo\nw\n29\n30\n31 nd Metallurgy,’ p. \n176; Jeans, American Industrial Conditions and Competition, p. 72; Hewitt, ‘Sir Henry \nBes\nAm\n32\nA ve no place. \n33\nm\n34\n35  and Labor,’ p. 491 -- quotes; \ncf. ‘Mutual Relations of Capital and Labor,’ p. 281. \n36 Hew\n37 Ib\nlif g to his adulatory biographer \nAllan Nevins ‘hi gged’ – Abram S. Hewitt, pp. 594-6 [quote].  But \nHew patible with anti-unionism. \n38 \n39 Hew\n40\nwerful conservative judiciary – meant that the British example needed to be adapted to \ncal conditions.  America would require a firm framework of statutory rights; voluntarism \nould not suffice.  The draftsmen of the Wagner Act would agree. \n Bourne quoted from Rodgers, Atlantic Crossings, pp. 270-1. \n Rodgers, Atlantic Crossings, Ch. 7, 'War Collectivism.' \n Hewitt, ‘Iron and Labor,’ pp. 475-7; Hewitt, ‘A Century of Mining a\nsemer,’ p. 138; Heindel, American Impact on Great Britain 1898-1914, p. 24; Jeans, \nerican Industrial Conditions, pp. 59-60. \n Bayles, Shop Council. Not explicitly anti-union, Bayles just wanted, like many a reformist \nmerican employer, a system in which they would ha\n Hewitt, ‘Mutual Relations of Capital and Labor,’ p. 282 – a nice combination of the \noralistic and the prudential arguments for reform. \n Hewitt, ‘A Century of Mining and Metallurgy,’ p. 189. \n Hewitt, ‘American Worker under High Tariffs,’ p. 234, ‘Iron\nitt, ‘Iron and Labor,’ p. 490. \nid., pp. 488-9.  Hewitt’s most outspoken anti-labor comments came in the last year of his \ne, during the great Anthracite Strike of 1902, though accordin\ns liberalism never really fla\nitt’s kind of liberalism was perfectly com\nHewitt, ‘Iron and Labor,’ p. 490; ‘Mutual Relations of Capital and Labor,’ p. 282. \nitt, ‘Production of Iron and Steel,’ p. 61. \n Hewitt, ‘Iron and Labor,’ p. 494. \n 45\n                                                                                                                                                        \n41 Ibid., pp. 495-6.  ‘Mutual Relations of Capital and Labor,’ esp. pp. 285-6 – delivered to a \nchu\nm\n42\n43 matic conclusions of Lambert’s ‘If the Worlers \nTo\n44 s.’ \n45 . 34. \n46 Going, ‘Labour Questions in England and America,’ p. 166; ‘The Machinists' Strike in the \nUnit\n47\nes . 198-9. \n48\n49\n50 entific \nFactory Management, p. 8; Dibblee, ‘Printing Trades and the Crisis in British Industry,’ pp. \n29\n51\n52\nLe mittal, p. 9 , and part II, passim--quotes from pp. 787, 860-1, 799.  On \nSchwab's interest in this investigation, see Commons, Myself, pp. 92-3; for its American \nfindi\n53\nth\nun\n'g tervention -- ‘A British law \nrch congress, not a meeting of his fellow employers – is the clearest exposition of the \nillenarian vision guiding this Christian Democrat’s path toward his capitalist utopia. \n Hewitt, ‘Iron and Labor,’ p. 497. \nThis is one of the clearest and least proble\nok a Notion’, Chs. 3-4. \n Gitelman, ‘Being of Two Mind\n Taylor, ‘Industrial Troubles in America,’ p\ned States,’ pp. 589-90; Wuest, ‘Do It Now,’ 35. \n See Burn, 'Genesis of American Engineering Competition'; Mackenzie, American Invaders, \np. Ch. 20; Pratt, Trade Unionism and British Industry, esp. pp\n Pratt, Trade Unionism and British Industry, pp. 5 [Murray], 13. \n Schwab in NCF, Industrial Conciliation, pp. 33-34. \n Wells, Future in America; Stead, Americanization of the World; Denning, Sci\n1, 296. \n Jeans, American Industrial Conditions and Competition, p. 8. \n U.S. Commissioner of Labor, Regulation and Restriction of Output -- see Carroll Wright's \ntter of Trans\nngs, Furner, ‘Knowing Capitalism,’ pp. 259-61. \n Cf. The Iron Age's accurate comment in 1905 on the impending parliamentary reversal of \ne 1901 Taff Vale judgement which, by exposing unions to financial liability even for an \nauthorized strike, had unpicked the 1875 Conspiracy and Protection of Property Act's \nolden formula' protecting British labor relations from judicial in\n 46\n                                                                                                                                                        \nsuch as that proposed would be an ugly precedent to be quoted on this side of the ocean.’  \n[‘\n54 Rapson, Britons View America, p. 6. \n55 S Readjustment and Operation of Industry in \nEn\ntho\ncom\nB\n‘C\nw\nth\n56\nM\n57\n[G  to the United States \n1914-1918, pp. 163-5, covers this mission, and emphasizes [p. 165] the role of the NCF in \ntry\n58\n59 U.S. Congress, ; Gray, \nC  of the Human Factor in Industrial \nPr\nFor ‘reconstruction,’ see also Rodgers, Atlantic Crossings, pp. 296-301 esp. \n60 M\nM\n61 C\nPo\n62 \nThe English Trade Disputes Bill May Pass,’ Iron Age 75:15 (13 Apr. 1905): 1245]. \nee e.g. Merchants' Association of New York, \ngland Since 1914.  This version of a record of improvization and compromise was \nroughly critiqued in the magazine American Industry in War Time, which pointed out that \npulsion, or the real threat of it, as well as concession, had played a vital role in getting \nritish labor to cooperate -- ‘Creating an American 'Bolshevikii',’ 3:4 (Jan. 1918): 11; \nreating an Industrial 'Frankenstein,'‘ 5:3 (25 June 1918): 3-5.  The journal's editorial line, \nith which its employer readers probably agreed, was that the Wilson administration had got \ne mix of concession and compulsion badly wrong. \n Babson, W.B. Wilson and the Department of Labor, esp. pp. 222-3; British Labor's War \nessage to America, pp. 21 [Bowerman], 28-9 [Garrod]. \n Gerber, ‘Corporatism in Comparative Perspective’; British Labor's War Message, pp. 37 \nompers], 49 [Thomas], 57 [motion].  Lyddon, British War Missions\ning to get this AFL-friendly message across. \n British Labor's War Message, pp. 85 [Ullman], 70 [Patterson], 89 [Stillman], 29 [Garrod]. \n Senate, British Industrial Experience During the War War Time \nontrol of Industry, esp. pp. 303-4; Knoeppel, ‘Importance\neparedness,’ pp. 7-8; Knoeppel, ‘Organizing Industry for Economic Production,’ p. 29.    \neine, Introduction and Development of the Works Committee in the Dennison \nanufacturing Company, esp. pp. 185-6, 191. \nohen, Law and Order in Industry, esp. pp. 28-30, 202, 289-92; An American Labor \nlicy, Introduction [quote]. \nRockefeller, Representation in Industry, pp. 20, 24-5. \n 47\n                                                                                                                                                        \n63 Gitelman, ‘Management’s Crisis of Confidence’; NICB Executive Committee Minutes, 6th \nMee\n2;\nFr\n64 gn Inquiry, The Labor Situation in Great Britain and France, \nes\n65 U.S. De\n66\n67 F\n68 ittee Minutes, 28th Meeting, 26 Sept. 1919, p. 4. \n69 g, 7 June 1919, p. 3. \n70\n71\n72 t Annual \nCon 9 [quotes \nfrom\n73 \n13\n74 of Merritt’s ideas, see Ernst, Lawyers Against Labor, Ch. 11 esp. pp. 232-\n4,\n75 lin, ‘British Industrial Crisis,’ pp. 3, 5, 12. \n76 Ri orizontal and Vertical Lines,’ pp. 139-43 at pp. 141-2.  \n77 U\n78\n79 l Conference, pp. 159, 168. \nting, 11 Sept. 1917, p. 2; 7th Meeting, 20 Sept. 1917, p. 1; 8th Meeting, 17th Oct. 1917, p. \n 16th Meeting, 25 Oct. 1918, p. 2; NICB, Problems of Labor and Industry in Great Britain, \nance, and Italy, p. v. \n NCF Commission on Forei\np. pp. 210-11; U.S. Department of Labor, Report of the Employers' Industrial Commission.   \npartment of Labor, Report of the Employers' Industrial Commission, p. 4.  \n Ibid., pp. 14, 11. \nelt, Radicalism in Great Britain, p. 3. \nNICB Executive Comm\n NICB Executive Committee Minutes, 25th Meetin\n NICB, Interim Report of the European Commission, pp. 10, 16, 17. \n Ibid., pp. 33-4. \n In National Association of Employment Managers, Proceedings of the Firs\nvention, p. 61; McCormick’s address, ‘Employee Representation,’ is at pp. 135-\n p. 136]. \nNICB, Problems of Labor and Industry in Great Britain, France and Italy, pp. v, 4, 80, \n8. \n For the evolution \n 287; for the quote, Factory Solidarity or Class Solidarity, pp. 57-8. \n Laugh\nce, ‘H\n.S. Department of Labor, Proceedings of the First Industrial Conference, pp. 281, 69. \n Ibid., pp. 115, 145; NCF, Labor Situation in Great Britain and France, p. 211. \n U.S. Department of Labor, Proceedings of the First Industria\n"}