{"doi":"10.4028\/www.scientific.net","coreId":"196540","oai":"oai:lra.le.ac.uk:2381\/8728","identifiers":["oai:lra.le.ac.uk:2381\/8728","10.4028\/www.scientific.net"],"title":"In Situ Environmental Scanning Electron Microscopy (ESEM) of Semi-Solid Samples","authors":["Smith, A. J.","Atkinson, Helen V.","Hainsworth, S. V.","Dong, Hongbiao","Haghayeghi, R."],"enrichments":{"references":[{"id":44775934,"title":"Materials Science Forum,","authors":[],"date":"2004","doi":"10.4028\/www.scientific.net\/msf.467-470.1385","raw":"I.M. Fielden and J.M. Rodenburg: Materials Science Forum, Vol.467-470 (2004), p. 1385-1388.","cites":null},{"id":44775933,"title":"Mechanics of Materials Group,","authors":[],"date":null,"doi":null,"raw":"A.J. Smitha, H.V. Atkinsonb, S.V. Hainsworthc, H.B. Dongd and R. Haghayeghie Mechanics of Materials Group, Department of Engineering, University of Leicester, University Rd., Leicester, LE1 7RH, UK. aajs55@le.ac.uk, bhva2@le.ac.uk, csvh2@le.ac.uk, dhd38@le.ac.uk, erh126@le.ac.uk Keywords: Alloy 201; Environmental Scanning Electron Microscopy; ESEM; In Situ; Manipulation. Abstract. The ESEM (Environmental Scanning Electron Microscope) is an instrument that","cites":null},{"id":44775935,"title":"Thixoforming of High Performance Alloys Mainly Based on the Al-Cu System, PhD Thesis,","authors":[],"date":"2003","doi":null,"raw":"D. Liu, Thixoforming of High Performance Alloys Mainly Based on the Al-Cu System, PhD Thesis, University of Sheffield, 2003.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-10-15","abstract":"The ESEM (Environmental Scanning Electron Microscope) is an instrument that circumvents a limitation of conventional SEM, in that samples can be examined in a gaseous atmosphere rather than a vacuum. With a heating stage, dynamic processes can be observed in situ at high temperature. In this study, A201 aluminium alloy samples with globular structures have been examined in the semisolid region. In addition, a manipulator has been installed onto the heating stage to allow the probing of semi-solid surfaces. The paper shows the potential for manipulating semi-solid materials in order to better understand thixotropic phenomena","downloadUrl":"http:\/\/www.scientific.net,","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/8728\/3\/S2PSmithpaper.pdf","pdfHashValue":"344f1308da402865aee52f86c56587a7cbb6a162","publisher":"Trans Tech Publications","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/8728<\/identifier><datestamp>\n                2016-04-20T10:39:57Z<\/datestamp><setSpec>\n                com_2381_171<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_172<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nIn Situ Environmental Scanning Electron Microscopy (ESEM) of Semi-Solid Samples<\/dc:title><dc:creator>\nSmith, A. J.<\/dc:creator><dc:creator>\nAtkinson, Helen V.<\/dc:creator><dc:creator>\nHainsworth, S. V.<\/dc:creator><dc:creator>\nDong, Hongbiao<\/dc:creator><dc:creator>\nHaghayeghi, R.<\/dc:creator><dc:subject>\nAlloy 201<\/dc:subject><dc:subject>\nEnvironmental Scanning Electron Microscopy<\/dc:subject><dc:subject>\nESEM<\/dc:subject><dc:subject>\nIn Situ<\/dc:subject><dc:subject>\nManipulation<\/dc:subject><dc:description>\nThe ESEM (Environmental Scanning Electron Microscope) is an instrument that circumvents a limitation of conventional SEM, in that samples can be examined in a gaseous atmosphere rather than a vacuum. With a heating stage, dynamic processes can be observed in situ at high temperature. In this study, A201 aluminium alloy samples with globular structures have been examined in the semisolid region. In addition, a manipulator has been installed onto the heating stage to allow the probing of semi-solid surfaces. The paper shows the potential for manipulating semi-solid materials in order to better understand thixotropic phenomena.<\/dc:description><dc:date>\n2010-11-05T11:32:00Z<\/dc:date><dc:date>\n2010-11-05T11:32:00Z<\/dc:date><dc:date>\n2006-10-15<\/dc:date><dc:type>\nConference paper<\/dc:type><dc:identifier>\nSolid State Phenomena, 2006, 116-117, pp. 700-703<\/dc:identifier><dc:identifier>\n1662-9779<\/dc:identifier><dc:identifier>\nhttp:\/\/www.scientific.net\/SSP.116-117.700<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/8728<\/dc:identifier><dc:identifier>\n10.4028\/www.scientific.net\/SSP.116-117.700<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis paper was presented at the 9th International Conference on Semi-Solid Processing, Basan, South Korea, September 2006, and published as Solid State Phenomena, 2006, 116-117, pp. 700-703.  The published version is available at http:\/\/www.scientific.net, doi: 10.4028\/www.scientific.net\/SSP.116-117.700.<\/dc:rights><dc:publisher>\nTrans Tech Publications<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["1662-9779","issn:1662-9779"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Alloy 201","Environmental Scanning Electron Microscopy","ESEM","In Situ","Manipulation"],"subject":["Conference paper"],"fullText":" \n \nIn Situ Environmental Scanning Electron Microscopy (ESEM) of Semi-Solid \nSamples \nA.J. Smitha, H.V. Atkinsonb, S.V. Hainsworthc, H.B. Dongd and R. Haghayeghie  \nMechanics of Materials Group, Department of Engineering, University of Leicester, University Rd., \nLeicester, LE1 7RH, UK. \naajs55@le.ac.uk, bhva2@le.ac.uk, csvh2@le.ac.uk, dhd38@le.ac.uk, erh126@le.ac.uk \nKeywords: Alloy 201; Environmental Scanning Electron Microscopy; ESEM; In Situ; Manipulation. \n \nAbstract. The ESEM (Environmental Scanning Electron Microscope) is an instrument that \ncircumvents a limitation of conventional SEM, in that samples can be examined in a gaseous \natmosphere rather than a vacuum. With a heating stage, dynamic processes can be observed in situ at \nhigh temperature. In this study, A201 aluminium alloy samples with globular structures have been \nexamined in the semisolid region. In addition, a manipulator has been installed onto the heating stage \nto allow the probing of semi-solid surfaces. The paper shows the potential for manipulating \nsemi-solid materials in order to better understand thixotropic phenomena. \n \nIntroduction \nAn Environmental Scanning Electron Microscope (ESEM) is a modification of a traditional Scanning \nElectron Microscope (SEM) in that it allows the sample to be imaged under a low   pressure \natmosphere of the operator’s choice [1]. Atmospheres regularly used include water vapour, nitrogen \nand argon. The electron beam ionises the gas to give positive ions and these, in turn, reduce the charge \nbuild-up that occurs on the material being sampled, which charges negatively due to bombardment \nwith electrons. The ionised gas also acts to amplify the image signal when secondary electrons are \nused to image the surface. The ESEM can be used with a heating stage. The sample is placed in a \nsmall ceramic cup. Above 400˚C, a heat shield, with a small hole to allow imaging, must be placed \nabove the ceramic cup to protect the detector. The Gaseous Secondary Electron Detector (GSED) is \nplaced directly above the sample, around the pole piece, and is used to acquire images when the \nheating stage is in use; other detectors are sensitive to the light emitted by hot samples. Energy \nDispersive X-ray analysis (EDX) cannot be carried out at high temperature (and the detector must be \nretratced) because the EDX detector is also sensitive to heat. \n \nA number of researchers have used the ESEM with a heating stage to carry out in situ studies of \ndynamic processes in metallic systems at high temperatures [2-4]. One of these papers [2] represents a \npreliminary study of a metallic system in the semi-solid state. None of these studies has involved \nmicromanipulation of the sample. Here we will present results for an aluminium alloy which has been \nproduced by magneto-hydrodynamic stirring (and thus has a spheroidal microstructure) and then \nreheated into the semisolid state in the heating stage in the ESEM. In addition, we have carried out \nsome probing of the sample surface with a one-axis manipulator. The issue here is that the \nmicromanipulator is driven by a piezoelectric transducer. Such transducers are sensitive to \ntemperature and cannot be operated above about 100˚C. However, the probe tip, if we are dealing \nwith a semisolid aluminium alloy, is at around 600˚C or more. Thus, there is an engineering design \nchallenge in protecting the piezoelectric transducer from the heat. We will show here that this can be \nachieved.  \nExperimental Procedure \n \n \n \nAlloy Material. The material studied here was a silver-containing high strength casting aluminium \nalloy A201 supplied in the Magnetohydrodynamically (MHD) stirred state by SAG. The composition \nis 4.8% Cu, 0.25% Mg, 0.087% Si, 0.145% Fe, 0.29% Mn, 0.0026% Zn, 0.25% Ti, 0.564% Ag, \n0.0012% Be, 0.0001% Sr. All percentages are in wt.%. The samples were polished to a one micron \ndiamond finish before being placed in the heating stage. \nESEM.  A Philips XL-30 ESEM from FEI was used with the FEI 1000˚C heating stage. The heat \nshield above the crucible (Fig. 1) restricts how close the GSED detector can be to the sample. The \nworking distance was generally between 13 and 14 mm. Smaller working distances would improve \nimage quality but this was not physically possible. The sample was heated in a water vapour \natmosphere with a pressure of 2.0 torr. The imaging voltage was 25kV. The sample was heated at a \nrate of 20˚C\/min from room temperature to 500˚C and then at 5˚C\/min to 580˚C with a 3 min hold at \n580˚C. It was then heated at 5˚C\/min to 650˚C and then cooled. From differential scanning \ncalorimetry [5], the semisolid state is expected to initiate at around 530˚C. In the experiments with the \nmanipulator, the same heating routine was applied. The heating stage was calibrated using Omegalaq \nheat sensitive paint, showing that the temperature readings were accurate to within about 10˚C at \n600˚C. This is within the manufacturer’s specification. The crucible is 5 mm in diameter and 2 mm \ndeep and thus the sample must fit within this.  \nMicromanipulation. A one-dimensional micromanipulator from PiezoMotor was used. This gives \nmovement in one axis in steps of ~5 microns. The manipulator is mounted on a turret to one side of \nthe heating stage and a probe arm extension is fitted made of alumina, which inhibits heat conduction \nback to the piezoelectric. The extension has to fit beneath the heat shield (in a space of about 2mm) \nand has a protruding tip, angled downwards into the crucible. The probe tip was made of tungsten so \nas not to react with the sample and had a diameter of about 90 μm. In due course, finer probe tips \ncould be used.                       \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \nFig. 1 ESEM heating stage (a) Heating stage installed in the ESEM, (b) Cross-section through the \nstage showing the component parts (courtesy of FEI). \n \nAt the start of the experiment with the manipulator, the probe tip was placed onto the sample with an \ninitial downwards force applied, so that with any melting\/softening of the sample, the tip would \nremain in contact. This is a particular issue with the one-dimensional manipulator which would not \nexist with a 3-D one, where vertical movement would be possible.  The same heating routine was used \nas for the experiment without the manipulator, but at 578˚C the probe tip was moved and then again at \n622˚C. \nb.) Section A-A a.) Heating Stage Installed Inside ESEM \nA \nA \n3 2 \n4 \n7 \n5 \n6 \n8 \n9 \n1 – Stainless Steel Heat Shield  2 – Stainless Steel Cover 3 – Alumina Crucible  \n4 – Heater    5 – Upper Zircar Block  6 – Thermocouple \n7 – Aluminium Housing   8 – Lower Zircar Block  9 – Water Pipes  \n10 – Extension Arm   11 – Probe Tip \n10 \n1 \n11 \n \n \n \n \nResults \n \nWithout the Micromanipulator.   \n           \n                        (a)                                                  (b)                                                 (c)                                  \nFig. 2 (a) shows phases at the grain boundaries. These are likely to \nbe intermetallics and complex eutectics [6]. According to \ndifferential scanning calorimetry information [5], melting should \nbarely have initiated at this temperature. At 562˚C (Fig. 2 (b)), a few \npercent of liquid should be present. There is clearly some change in \nthe microstructure in comparison with Fig. 2 (a). (Note that the \nbright white specks are dust but act as markers). By 583˚C (Fig. 2 \n(c) – note the change in magnification), considerable contrast is \napparent in the microstructure. According to DSC, about 5% liquid \nshould be present now. If the pale areas correspond to liquid, then \nthe fraction appears to be higher. Alternatively, the pale areas might \ncorrespond with enhanced oxidation at regions which are enriched \nin alloying elements, given that the imaging atmosphere is water \nvapour. This requires further investigation. At 604˚C, the microstructure should contain about 10% \nliquid according to DSC, but it appears that the surface of the pale areas is puckering as though these \nare liquid (Fig. 2 (d)). At higher temperatures (620˚, 630˚C) the puckering is evident right across the \nsurface. \n \nWith Micromanipulator. \n       \n                      (a)                                                  (b)                                                  (c) \nFig. 3 ESEM images of MHD A201 aluminium alloy reheated into the semisolid state and probed \nwith a micromanipulator tip, (a) 579˚C, (b) 622˚C, (c) 623˚C with tip moved back and forth.  \n \nIn the micromanipulator experiment (Fig. 3), the probe was first moved at 579˚C (Fig. 3(a)). This \ntemperature was chosen because it was thought that some liquid would be present from the above \nresults and it would be possible to distort the sample. However, the tip would not move and it was \nonly at a higher temperature of 622˚C that significant distortion was seen (Fig. 3 (b)). At this \ntemperature, the probe tip was moved back and forth. The consequence was that a crater developed in \nthe specimen (i.e. liquid did not flow back into the crater), (Fig. 3(c)), and the spheroidal structure was \nFig. 2 ESEM images of MHD \nA201 aluminium alloy reheated \ninto the semisolid state. (a) 538˚C, \n(b) 562˚C, (c) 583˚C, (d) 604˚C. \n(d) \nProbe tip \ncrater \n \n \n \nclearly revealed. The alumina ‘skin’ on the surface of the sample is clearly being broken in Fig. 3(b); \nin effect, the probe tip is indenting the surface. \n \nThe micromanipulator experiment was repeated under very similar conditions. Fig. 4 illustrates the \nsoftness of the material at these temperatures and the classical development of circumferential cracks \nas though the probe tip were an indenter. It is not clear whether these lateral cracks are restricted to the \noxide skin. At low magnification, after the experiment, the break up of the structure under the stress is \nrevealed (Fig. 4(c)). \n       \n                     (a)                                                    (b)                                                (c) \nFig. 4 ESEM images of MHD A201 Al alloy reheated into the semisolid state and probed with \nmicromanipulator tip, (a) 581˚C, (b) 583˚C, (c) post-experiment at room temperature and low mag.. \nSummary \nESEM has been used with a heating stage and a micromanipulator to probe the behaviour of A201 \nmetallic alloy in the semi-solid state. Contrast develops at the spheroid boundaries as the temperature \nincreases, which may be liquid. The semisolid material is deformed by the probe tip and cracks \ndevelop in what is probably the oxide skin. At low magnification, the disruption of the structure is \nvisible. \nAcknowledgements \nAJS would like to acknowledge support from the Nuffield Foundation. Financial assistance was \nprovided by the Engineering and Physical Sciences Research Council under Grant No. \nGR\/S97910\/01. In addition, the advice and assistance of Mr Tim Stevenson, Mr Jon Sykes and Mr \nPiyal Samara-Ratna in the Space Research Centre at the University of Leicester is gratefully \nacknowledged. \nReferences \n[1] G.D. Danilatos: Adv. Electron Phys. Vol. 71 (1988), p. 109. \n[2]  S.M. Habesch, S.C. Hogg and H.V. Atkinson: Quantitative Microscopy of High Temperature \nMaterials (IOM Communications , London, 2001), Ed. A Strang, p. 147-159. \n[3]  I.M. Fielden and J.M. Rodenburg: Materials Science Forum, Vol.467-470 (2004), p. 1385-1388. \n[4]  S. Fischer, K. Lemster, R. Kaegi, J. Kuebler and B. Grobety, J. Electron Microscopy, Vol. 53 \n(2004), p. 393-396. \n[5] D. Liu, Thixoforming of High Performance Alloys Mainly Based on the Al-Cu System, PhD \nThesis, University of Sheffield, 2003.  \n[6]  L. Backerud, E. Krol and J. Tamminen, Solidification Characteristics of Aluminium Alloys, Vol. \n2, Foundry Alloys, SkanAluminium, Oslo, 1986.    \nCircumferential    \ncrack \n \n \n \n \n"}