{"doi":"10.1016\/j.atmosenv.2010.06.024","coreId":"57702","oai":"oai:nora.nerc.ac.uk:9627","identifiers":["oai:nora.nerc.ac.uk:9627","10.1016\/j.atmosenv.2010.06.024"],"title":"First Europe-wide correlation analysis identifying factors best explaining the total nitrogen concentration in mosses","authors":["Schröder, Winfried","Holy, Marcel","Pesch, Roland","Harmens, Harry","Fagerli, Hilde","Alber, Renate","Coşkun, Mahmut","De Temmerman, Ludwig","Frolova, Marina","González-Miqueo, Laura","Jeran, Zvonka","Kubin, Eero","Leblond, Sébastien","Liiv, Siiri","Maňkovská, Blanka","Piispanen, Juha","Santamaría, Jesus M.","Simonèiè,, Primoz","Suchara, Ivan","Yurukova, Lilyana","Thöni, Lotti","Zechmeister, Harald G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"In this study, the indicative value of mosses as biomonitors of atmospheric nitrogen (N) depositions and air concentrations on the one hand and site-specific and regional factors which explain best the total N concentration in mosses on the other hand were investigated for the first time at a European scale using correlation analyses. The analyses included data from mosses collected from 2781 sites across Europe within the framework of the European moss survey 2005\/6, which was coordinated by the International Cooperative Programme on Effects of Air Pollution on Natural Vegetation and Crops (ICP Vegetation). Modelled atmospheric N deposition and air concentration data were calculated using the Unified EMEP Model of the European Monitoring and Evaluation Programme (EMEP) of the Convention on Long-range Transboundary Air Pollution (CLRTAP). The modelled deposition and concentration data encompass various N compounds. In order to assess the correlations between moss tissue total N concentrations and the chosen predictors, Spearman rank correlation analysis and Classification and Regression Trees (CART) were applied. The Spearman rank correlation analysis showed that the total N concentration in mosses and modelled N depositions and air concentrations are significantly correlated (0.53 ≤ rs ≤ 0.68, p < 0.001). Correlations with other predictors were lower than 0.55. The CART analysis indicated that the variation in the total N concentration in mosses was best explained by the variation in NH4+ concentrations in air, followed by NO2 concentrations in air, sampled moss species and total dry N deposition. The total N concentrations in mosses mirror land use-related atmospheric concentrations and depositions of N across Europe. In addition to already proven associations to measured N deposition on a local scale the study at hand gives a scientific prove on the association of N concentration in mosses and modelled deposition at the European scale.\\ud\n\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/57702.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/9627\/1\/N009627PP.pdf","pdfHashValue":"8ada2ba0261ceea29bb6db054b2dbfcb4d408aa2","publisher":"Elsevier Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:9627<\/identifier><datestamp>\n      2014-09-24T16:06:15Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D5334<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9627\/<\/dc:relation><dc:title>\n        First Europe-wide correlation analysis identifying factors best explaining the total nitrogen concentration in mosses<\/dc:title><dc:creator>\n        Schröder, Winfried<\/dc:creator><dc:creator>\n        Holy, Marcel<\/dc:creator><dc:creator>\n        Pesch, Roland<\/dc:creator><dc:creator>\n        Harmens, Harry<\/dc:creator><dc:creator>\n        Fagerli, Hilde<\/dc:creator><dc:creator>\n        Alber, Renate<\/dc:creator><dc:creator>\n        Coşkun, Mahmut<\/dc:creator><dc:creator>\n        De Temmerman, Ludwig<\/dc:creator><dc:creator>\n        Frolova, Marina<\/dc:creator><dc:creator>\n        González-Miqueo, Laura<\/dc:creator><dc:creator>\n        Jeran, Zvonka<\/dc:creator><dc:creator>\n        Kubin, Eero<\/dc:creator><dc:creator>\n        Leblond, Sébastien<\/dc:creator><dc:creator>\n        Liiv, Siiri<\/dc:creator><dc:creator>\n        Maňkovská, Blanka<\/dc:creator><dc:creator>\n        Piispanen, Juha<\/dc:creator><dc:creator>\n        Santamaría, Jesus M.<\/dc:creator><dc:creator>\n        Simonèiè,, Primoz<\/dc:creator><dc:creator>\n        Suchara, Ivan<\/dc:creator><dc:creator>\n        Yurukova, Lilyana<\/dc:creator><dc:creator>\n        Thöni, Lotti<\/dc:creator><dc:creator>\n        Zechmeister, Harald G.<\/dc:creator><dc:subject>\n        Atmospheric Sciences<\/dc:subject><dc:description>\n        In this study, the indicative value of mosses as biomonitors of atmospheric nitrogen (N) depositions and air concentrations on the one hand and site-specific and regional factors which explain best the total N concentration in mosses on the other hand were investigated for the first time at a European scale using correlation analyses. The analyses included data from mosses collected from 2781 sites across Europe within the framework of the European moss survey 2005\/6, which was coordinated by the International Cooperative Programme on Effects of Air Pollution on Natural Vegetation and Crops (ICP Vegetation). Modelled atmospheric N deposition and air concentration data were calculated using the Unified EMEP Model of the European Monitoring and Evaluation Programme (EMEP) of the Convention on Long-range Transboundary Air Pollution (CLRTAP). The modelled deposition and concentration data encompass various N compounds. In order to assess the correlations between moss tissue total N concentrations and the chosen predictors, Spearman rank correlation analysis and Classification and Regression Trees (CART) were applied. The Spearman rank correlation analysis showed that the total N concentration in mosses and modelled N depositions and air concentrations are significantly correlated (0.53 ≤ rs ≤ 0.68, p < 0.001). Correlations with other predictors were lower than 0.55. The CART analysis indicated that the variation in the total N concentration in mosses was best explained by the variation in NH4+ concentrations in air, followed by NO2 concentrations in air, sampled moss species and total dry N deposition. The total N concentrations in mosses mirror land use-related atmospheric concentrations and depositions of N across Europe. In addition to already proven associations to measured N deposition on a local scale the study at hand gives a scientific prove on the association of N concentration in mosses and modelled deposition at the European scale.\\ud\n\\ud\n<\/dc:description><dc:publisher>\n        Elsevier Ltd<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9627\/1\/N009627PP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Schröder, Winfried; Holy, Marcel; Pesch, Roland; Harmens, Harry; Fagerli, Hilde; Alber, Renate; Coşkun, Mahmut; De Temmerman, Ludwig; Frolova, Marina; González-Miqueo, Laura; Jeran, Zvonka; Kubin, Eero; Leblond, Sébastien; Liiv, Siiri; Maňkovská, Blanka; Piispanen, Juha; Santamaría, Jesus M.; Simonèiè,, Primoz; Suchara, Ivan; Yurukova, Lilyana; Thöni, Lotti; Zechmeister, Harald G..  2010  First Europe-wide correlation analysis identifying factors best explaining the total nitrogen concentration in mosses.   Atmospheric Environment, 44. 3485-3491.  https:\/\/doi.org\/10.1016\/j.atmosenv.2010.06.024 <https:\/\/doi.org\/10.1016\/j.atmosenv.2010.06.024>     \n <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.atmosenv.2010.06.024<\/dc:relation><dc:relation>\n        10.1016\/j.atmosenv.2010.06.024<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/9627\/","http:\/\/dx.doi.org\/10.1016\/j.atmosenv.2010.06.024","10.1016\/j.atmosenv.2010.06.024"],"year":2010,"topics":["Atmospheric Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \nCopyright © 2010 Elsevier B.V. \n \nThis version available http:\/\/nora.nerc.ac.uk\/9627\/  \n \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the journal \narticle, incorporating any revisions agreed during the peer review \nprocess. Some differences between this and the publisher’s version \nremain. You are advised to consult the publisher’s version if you wish \nto cite from this article. \n \nwww.elsevier.com\/  \n \n \n \nArticle (refereed) \n \n \n \nSchröder, Winfried; Holy, Marcel; Pesch, Roland; Harmens, Harry; Fagerli, \nHilde; Alber, Renate; Coşkun, Mahmut; De Temmerman, Ludwig; Frolova, \nMarina; González-Miqueo, Laura; Jeran, Zvonka; Kubin, Eero; Leblond, \nSébastien; Liiv, Siiri; Maňkovská, Blanka; Piispanen, Juha; Santamaría, Jesus M.; \nSimonèiè,, Primoz; Suchara, Ivan; Yurukova, Lilyana; Thöni, Lotti; Zechmeister, \nHarald G.. 2010 First Europe-wide correlation analysis identifying factors best \nexplaining the total nitrogen concentration in mosses. Atmospheric Environment, \n44. 3485-3491. 10.1016\/j.atmosenv.2010.06.024 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnoraceh@ceh.ac.uk \n \n \nThe NERC and CEH  trade marks and logos (‘the Trademarks’) are registered trademarks of NERC in the UK and \nother countries, and may not be used without the prior written consent of the Trademark owner. \nFirst Europe-wide correlation analysis identifying factors best explaining the total \nnitrogen concentration in mosses \n \nWinfried Schröder1, Marcel Holy1*, Roland Pesch1, Harry Harmens2, Hilde Fagerli3, \nRenate Alber4, Mahmut Coşkun5, Ludwig De Temmerman6, Marina Frolova7, Laura \nGonzález-Miqueo8, Zvonka Jeran9, Eero Kubin10, Sébastien Leblond11, Siiri Liiv12, \nBlanka Maňkovská13, Juha Piispanen10, Jesús M. Santamaría8, Primož Simonèiè14, \nIvan Suchara15, Lilyana Yurukova16, Lotti Thöni17, Harald G. Zechmeister18 \n \n1\nChair of Landscape Ecology, University of Vechta, POB 1553, D-49356 Vechta, Germany \n2\nCentre for Ecology and Hydrology, Bangor, United Kingdom \n3\nResearch and Development Department, Norwegian Meteorological Institute, Oslo, Norway \n4\nEnvironmental Agency of Bolzano, Laives, Italy \n6\nVeterinary and Agrochemical Research Centre, Tervuren, Belgium \n5\nCanakkale Onsekiz Mart University, Faculty of Medicine Department of Medical Biology, 17100 \nÇanakkale, Turkey \n7\nLatvian Environment, Geology and Meteorology Agency, Riga, Latvia \n8\nDepartmento de Quimica y Edafologia, Universidad de Navarra, Navarra, Spain \n9\nDepartment of Environmental Sciences, Institut Jozef Stefan, Slovenia \n10\nFinnish Forest Research Institute, Muhos Research Station, Muhos, Finland \n11\nMuséum National d'Histoire Naturelle France, Paris, France \n12\nTallinn Botanic Garden, Tallinn, Estonia \n13\nInstitute of Landscape Ecology, Slovak Academy of Science, Bratislava, Slovakia \n14\nPrimož Simonèiè, Slovenian Forestry Institute \n15\nSilva Tarouca Research Institute for Landscape and Ornamental Gardening, Czech Republic \n16\nInstitute of Botany, Bulgarian Academy of Sciences, Sofia, Bulgaria \n17\nFUB - Research Group for Environmental Monitoring\n, \nRapperswil, Switzerland \n18\nFaculty of Life Sciences, University of Vienna, Vienna, Austria \n \nwschroeder@iuw.uni-vechta.de, mholy@iuw.uni-vechta.de, rpesch@iuw.uni-\nvechta.de, hh@ceh.ac.uk, h.fagerli@met.no, Renate.Alber@provinz.bz.it, \ncoskunafm@yahoo.com, ludet@var.fgov.be, marina.frolova@lvgma.gov.lv, \nlgonzale2@alumni.unav.es, zvonka.jeran@ijs.si, Eero.Kubin@metla.fi, \nsleblond@mnhn.fr, siiri@tba.ee, bmankov@stonline.sk, Juha.Piispanen@metla.fi, \nchusmi@unav.es, primoz.simoncic@gozdis.si, suchara@vukoz.cz, \nyur7lild@bio.bas.bg, lotti.thoeni@fub-ag.ch, harald.zechmeister@univie.ac.at \n \n*Corresponding author: Tel.: +49 (0)4441-15575, fax: +49 (0)4441-15583 \n \nAbstract \nIn this study, correlation analyses were applied to quantitatively characterise the \nindicative value of mosses as biomonitors of atmospheric nitrogen (N) deposition and \nto identify factors which explain best the total N concentration in mosses. \nCorrelations between the total N concentration in mosses and atmospheric N \ndepositions and air concentrations were examined for the first time at a European \nscale. In addition, predictors such as urban and agricultural land uses, population \nand livestock density were integrated in the analyses to account for emission-related \ninfluences of land use. The analyses included data from mosses collected from 2781 \nsites across Europe within the framework of the European moss survey 2005\/6, \nwhich was coordinated by the International Cooperative Programme on Effects of Air \nPollution on Natural Vegetation and Crops (ICP Vegetation). Modelled atmospheric N \ndeposition and air concentration data were calculated using the Unified EMEP Model \nof the European Monitoring and Evaluation Programme (EMEP) of the Long-range \nTransboundary Air Pollution Convention. The modelled deposition and concentration \ndata encompass various N compounds. In order to assess the correlations between \nmoss tissue total N concentrations and the chosen predictors, Spearman rank \ncorrelation analysis and Classification and Regression Trees (CART) were applied. \nThe Spearman rank correlation analysis showed that the total N concentration in \nmosses and modelled N depositions and air concentrations are significantly \ncorrelated (0.55  rs  0.68, p < 0.001). Correlations with other predictors were lower \nthan 0.55. The CART analysis indicated that the variation in the total N concentration \nin mosses was best explained by the variation in NH4\n+ concentrations in air, followed \nby NO2 concentrations in air, sampled moss species and total dry N deposition. The \ntotal N concentration in mosses appears to mirror land use-related atmospheric \nconcentrations and depositions of N across Europe to a high degree. The total N \nconcentration in mosses is a valuable tool in identifying areas with high atmospheric \nN concentration and deposition at a high spatial resolution across Europe.  \n \n Keywords: \nbiomonitoring, correlation, deposition, moss, nitrogen \n \n1 Background and goal \n \nPreindustrial atmospheric levels of nitrous oxide (N2O) measured in bubbles in \nglacier ice were around 285 ppm for many thousands of years. Human activity in the \nlast 200 years has raised the N2O level in the atmosphere which meanwhile \napproximates 310 ppm. The main anthropogenic sources for oxidised forms of N are \ntransport, industry and energy production, estimated to contribute up to 70% of \noxidised N (NOx) emissions (Bragazza et al., 2005). Additional sources include soil \nemission, particularly under high N inputs for example in agricultural areas. Emission \nsources of reduced N (NHy) compounds are primarily related to agricultural activities \nsuch as animal husbandry and the production and application of fertilizers. Forest \nfires are another important source of N emissions (Jovan and Carlberg, 2007). \nDeposition occurs when such emissions undergo complex chemical reactions in the \natmosphere and get in contact with the earth´s surface (vegetation, soils) as wet \ndeposition (rain, snow), occult deposition (cloud, fog) or dry deposition (dry particles, \ngas). There, they may accumulate in soils and plants such as mosses. Airborne \nchemicals can travel long distances from their sources and can therefore affect \necosystems over broad spatial scales and at locations far from the sources of \nemissions. Given European conditions, NHy may be transported up to 500 km and \nNOx effectively more than 1,000 to 1,500 km. Nitrate (NO3\n-) can have a transport \nrange of up to 2,000 km (Slanina and Wayne, 2008). \n \nEnhanced deposition of both NOx and NHy may be associated with acidification and \neutrophication of ecosystems as well as changes in biodiversity (Erisman and de \nVries, 2000; Galloway et al., 2008; Gundersen and Rasmussen, 1990; Pitcairn et al., \n1998). Control of reactive N emissions to air is regulated under several European \nUnion directives, such as the National Emission Ceilings Directive and Nitrates \nDirective and protocols of the Long-range Transboundary Air Pollution (LRTAP) \nConvention, such as the Gothenburg Protocol. The LRTAP Convention established a \nbroad framework for co-operative action on reducing the impact of air pollution and \nset up a process for negotiating concrete measures to control emissions of air \npollutants through legally binding protocols. In this process, the main objective of the \nEuropean Monitoring and Evaluation Programme (EMEP) is to regularly provide \ngovernments and subsidiary bodies under the LRTAP Convention with qualified \nscientific information to support the development and further evaluation of the \ninternational protocols on emission reduction negotiated within the Convention. \nEMEP focuses on four main tasks: 1) collection of emission data, 2) measurements \nof concentrations in air and precipitation, 3) modelling of atmospheric transport and \ndeposition of air pollutions and 4) integrated assessment. The storage and \ndistribution of information on emissions and emission projections on N is the task of \nthe Centre on Emission Inventories and Projections (CEIP). The Meteorological \nSynthesizing Centre West (MSC-W) is responsible for the modelling of sulphur (S), \nN, photo-oxidants and atmospheric particles.  \n \nParties to the LRTAP Convention perform wet deposition monitoring at 70 regional \nmonitoring sites across Europe within the framework of EMEP. The deposition \nmeasurement sites of the EMEP Chemical Coordinating Centre (EMEP-CCC) are \nspread over a large geographical area, so that, e.g. in the year 2000 Germany was \nrepresented by only eight measurement stations (Simpson et al., 2006b). In addition, \ndeposition measurements sites are under-represented in southern and Eastern \nEurope. Depositions associated with acidification and eutrophication, as well as \nozone are currently calculated by use of the EMEP MSC-W Unified Eulerian chemical \ntransport model with a broad grid-size of 50 × 50 km2 (Simpson et al., 2006a). \n \nThe EMEP depositions and air concentration models are each year validated against \nall the EMEP measurement data available throughout Europe. Furthermore, data \noutside the EMEP network are compared to the EMEP model in order to extend the \ndata basis for the evaluation of the EMEP models. For instance, Simpson et al. \n(2006b) supplemented the EMEP deposition data by deposition measurements from \nthe International Co-operative Programme on Assessment and Monitoring of Air \nPollution Effects on Forests (ICP Forests). The ICP-Forests Level II monitoring \nnetwork started operations in 1994 and encompasses about 860 sites. However, \napplying quality assurance criteria Simpson et al. (2006b) had to exclude data from \nmany sites and countries from the comparison with EMEP deposition data. Data from \n160 ICP-Forests monitoring sites distributed over seven European countries and 140 \nEMEP grids fulfilled the quality assurance criteria. Regarding the 89 German ICP \nLevel II-sites, 26 were in agreement with the respective quality criteria. The variability \nof the data quality from the ICP Forest sites proved to be considerable and the sites \nare not always representative for a larger area.  \n \nEven if Simpson et al. (2006b) concluded that the EMEP model performs rather well \nin reproducing patterns of N deposition in European forests, it is clear that an \nenhanced spatial resolution of the model results would be an advantage, e.g. when \nused for calculating exceedances of critical loads of acidification and eutrophication. \nAt present, the EMEP model can be run on 10 km resolution, and emission data sets \nthat can be used on this resolution are emerging. However, a dense network of \nobservations is needed in order to validate whether the model results really improve \non finer resolution. One step towards reaching this aim is to compare the calculated \ndepositions and concentrations with observations from networks monitoring a \nphenomenon closely related to deposition and operating at a high spatial resolution. \n \nCarpet-forming ectohydric mosses have successfully been used as biomonitors of \natmospheric heavy metal deposition since the late 1960s (Rühling and Tyler, 1968, \n1969, 1970). The moss technique is based on the fact that carpet-forming ectohydric \nmosses obtain most trace elements and nutrients directly from wet and dry \ndeposition with little uptake from the substrate. Heavy metals accumulate in mosses \nand their concentration in moss tissue provides a surrogate, time-integrated measure \nof element deposition from the atmosphere to terrestrial systems (Harmens et al., \n2008a). It is easier and cheaper than conventional deposition analysis as it avoids \nthe need for deploying large numbers of deposition collectors with an associated \nlong-term programme of routine sample collection and analysis. Hence, a much \nhigher sampling density can be achieved than with conventional deposition analysis.  \n \nCarpet-forming ectohydric mosses might potentially be used as biomonitors of \natmospheric N deposition as well (Pitcairn et al., 1995, 2006; Poikolainen et al. 2009; \nSalemaa et al., 2008; Solga et al., 2005; Zechmeister et al. 2008). A pilot-study in \nScandinavian countries showed a strong linear relationship between the total N \nconcentration in mosses and EMEP-modelled atmospheric N deposition rates \n(Harmens et al., 2005). Therefore, for the first time in the European heavy metals in \nmosses survey the total N concentration was also determined in naturally-growing \nmosses in about 60% of the participating countries in 2005\/6 (Harmens et al., \n2008b). The European moss survey is currently coordinated by the International \nCooperative Programme on Effects of Air Pollution on Natural Vegetation and Crops \n(ICP Vegetation) and has been conducted every five years since 1990 (Harmens et \nal., 2008a). The total N concentration in mosses was measured at almost 3,000 sites \nin 16 European countries (Harmens et al., 2008b), providing a higher spatial \nresolution than the EMEP monitoring sites.  \n \nThe aim of this study was to investigate whether ectohydric mosses can be used to \nmonitor atmospheric air concentration and \/ or deposition of N at a high spatial \nresolution. Therefore, the correlations between N concentrations in mosses and \nmodelled atmospheric concentrations and depositions of different N forms were \nexamined. In addition, the influence of other predictors on the variation of the N \nconcentration in mosses was investigated, including altitude, precipitation, distance \nto the sea, population and agricultural density, as well as urban, forested and \nagricultural land uses.  \n \n2 Materials and Methods \n \n2.1 Total N concentration in mosses \n \nMoss samples were collected during the European survey 2005\/6 in Austria, \nBelgium, Bulgaria, Czech Republic, Estonia, Finland, France, Germany, Italy \n(Bolzano region), Latvia, Slovakia, Slovenia, Spain (Navarra), Switzerland, Turkey, \nand the United Kingdom at 2781 sites, which were representative in terms of a \nmultivariate statistical ecoregionalisation of Europe (Hornsmann et al., 2008). As in \nprevious European moss surveys, field sampling was conducted according to the \nguidelines set out in the monitoring manual for the 2005\/6 survey (ICP Vegetation, \n2005). These guidelines specify the moss species to collect as well as how and \nwhere to perform the sampling. In order to document whether these criteria could be \nreached the comprehensive WebGIS MossMet was used in the German moss survey \n2005 (Pesch et al., 2007a). MossMet contains sampling site-specific information in \nterms of a check list concerning the mandatory specifications of the experimental \nprotocol, detailed topographical and ecological site descriptions, and the \nmeasurement values of up to 40 metal elements recorded in 1990, 1995, 2000, and \n2005. Furthermore, the surroundings of each sampling site are described by surface \ndata on climate, altitude and land use (Pesch et al., 2007b). This approach is \nintended to be adopted by more participants of the European moss survey in 2010. In \nthe current study, the N concentration in mosses were only related to a smaller set of \nsite-specific and regional predictors such as EMEP modelled N deposition data and \nland use parameters (see Section 2.3). \n \nPleurozium schreberi was the most frequently sampled species (43.4%), followed by \nHylocomium splendens (20.1%), Hypnum cupressiforme (18.9%), \nPseudoscleropodium purum (11.8%) and other species (5.7%). For the determination \nof N, the moss samples were dried at 40° C and concentrations were determined \naccording to either the Kjeldahl method (Kjeldahl, 1883) or via elemental analysis \nfollowing the Dumas method (Dumas, 1831). N concentrations were expressed as \npercentage N based on dry weight. A quality control exercise was conducted to \nassess the analytical performance of the participating laboratories. The moss \nreference materials M2 and M3, first prepared for the 1995\/6 European moss survey \n(Steinnes et al., 1997), were distributed amongst participating laboratories. In \naddition, some laboratories used certified reference material for quality assurance. \nFor determination of the elemental concentrations in the reference materials, \nlaboratories followed the same analytical procedure as used for the sampled mosses. \nThe results indicated good agreement between laboratories and analytical \ntechniques, and recommended values for the total N concentrations were established \nfor the reference material (Harmens et al., 2008a). The accuracy of data submitted to \nthe Programme Coordination Centre was assessed by inspecting them for extremes \nand by sending summarised data and draft maps to individual contributors for \nchecking and approval before incorporating the final data into the database for further \nprocessing. To investigate whether mosses can be used as biomonitors of \natmospheric N deposition and air concentration, the spatial variation in the N \nconcentration in mosses was statistically compared (see Section 2.4) with EMEP \nmodelled N deposition and air concentration data (see Section 2.2) and other \npotential predictors such as land use (see Section 2.3). \n 2.2 EMEP Unified model calculation of N depositions and air concentrations \nThe Unified EMEP model was developed at the Norwegian Meteorological Institute \nunder the EMEP programme. The Unified EMEP model is a development of earlier \nEMEP models (Berge and Jakobsen, 1998; Jonson et al., 1998; fully documented in \nFagerli et al., 2004; Simpson et al., 2003). The model has been extensively validated \nagainst measurements (Fagerli and Aas, 2008; Fagerli et al., 2003, 2007; Jonson et \nal., 2006; Simpson et al., 2006a,b, 2007; Tsyro et al., 2007). The EMEP Unified \nEulerian Chemical Transport Model is a multi-layer atmospheric dispersion model \ndesigned for simulating the long-range transport of air pollution over several years. \nThe EMEP model domain is centred over Europe and also includes most of the North \nAtlantic and the polar region (Fagerli et al., 2004; Simpson et al., 2003)1. The model \ncomprises 20 vertical layers and is primarily intended for use with a horizontal \nresolution of ca. 50 × 50 km2 (at 60° N) in the EMEP polar stereographic grid. The \nanthropogenic emission input data are generally based as far as possible upon \nemissions per sector and grid officially reported to the LRTAP Convention (Vestreng \net al., 2004). The chemical scheme uses about 140 reactions between 70 species. \nThe model allows for calculations of depositions to different types of land-cover within \neach grid cell.  \n \n2.3 Additional geodata \nIn addition to the modelled EMEP deposition and air concentration data, the N \nconcentration in mosses was investigated for correlations with other geodata (Table \n1). These other geodata include four site-specific characteristics and 19 regional \ncharacteristics which might influence the N concentration in mosses (Böhlmann et al., \n2005; Bytnerowicz et al., 2002; Bytnerowicz and Fenn, 1996; Fenn et al., 2007; Fenn \nand Kiefer, 1999; Fernandez and Carballeira, 2002; Fowler et al. 1998; Frati et al., \n2007; Jovan and Carlberg, 2007; Jovan and Mccune, 2006; Luo et al., 2003; \nNeirynck et al., 2007; Pesch et al., 2007b; Pitcairn et al., 2006). Together with the \nEMEP data the site-specific and regional characteristics are referred to as predictors \nin the CART-analysis (see Section 2.4). Raster information from surface maps were \nintersected with the monitoring sites and included in the correlation analysis. To \naccount for the influence of the precipitation amount on the moss N loads, long-term \n                                            \n1\n  http:\/\/www.emep.int\/OpenSource\/UniEMEPopenSource_documentation.html \nmonthly means (1961- 1990) were provided by the Global Climate Dataset (CL 2.0) \nin a resolution of 12.5 x 12.5 km². To supplement the site-specific data with regard to \ninformation on N emissions, proportions of land use were derived from the Corine \nLand Cover map 2000 (Keil et al., 2005). The area percentage of urban, forest and \nagricultural land use categories in a radius of 1, 5, 10 and 25 km (for forests), 1, 5, \n10, 25 and 50 km (for agriculture) or 1, 5, 10, 25, 50, 75 and 100 km (for urban \nareas) around each raster cell was calculated and then projected onto either the 1 x \n1 or 2 x 2 km² grid cells (Table 1). The sea spray-effect was assessed in terms of the \ndistances of the monitoring sites to the coastlines of the Atlantic Ocean and the \nBaltic, Black and Mediterranean Sea. Further data used as predictors include the \npopulation density in a resolution of 100 x 100 m2 as well as livestock density \nprovided by EUROSTAT2. The latter was only available in terms of country averages. \n \nTable 1: Predictors used for correlation analyses \n \n2.4 Statistical analysis \nPrior to the bi- and multivariate statistical analyses the moss and modelled deposition \n\/ air concentrations as well as additional land characteristics were intersected in a \nGIS environment. Regarding the EMEP modelling data the correlation analyses was \nperformed with two sets of modelled N data: (1) one data set containing only those \nvalues representing the year of sampling and (2) one data set representing the whole \nthree year accumulation period in terms of the mean deposition \/ air concentration. \nThe three year accumulation period represents the moss tissue that was selected for \ntotal N analysis, i.e. the recent three years of moss growth. \n \nBivariate correlation coefficients were computed to indicate the strength and direction \nof the statistical relationship between the total N concentrations in mosses and \nEMEP modelled N depositions and air concentrations and additional influencing \nfactors. There are several coefficients, measuring the degree of correlation, adapted \nto the levels of measurement according to Stevens (1946) or to the statistical \ndistribution of the data. In this investigation, we decided to compute the Spearman \nrank correlation coefficient rs because the total N concentration in mosses and most \nof the predicting variables proved to be not normally distributed. Such non-parametric \n                                            \n2\n  http:\/\/epp.eurostat.ec.europa.eu\/portal\/page\/portal\/eurostat\/home\/ (June 2009) \ncorrelation methods are less powerful than parametric methods if the assumptions \nunderlying the latter are met, but are less likely to give distorted results when the \nassumptions fail. The coefficient rs measures the correspondence between two \nrankings and assesses its statistical significance. An increasing rank correlation \ncoefficient implies increasing agreement between rankings. The correlation \ncoefficient rs amounts for -1 if the two rankings are completely in opposite agreement, \nrs equals 0 if the rankings are completely independent and +1 if the agreement \nbetween the two rankings is perfectly the same. Within this interval [-1, +1] the \nstrength of correlation was classified according to Hagl (2008); rs values < │0.2│ are \nvery low, between │0.2│ and │0.5│ low, from │0.5│ to │0.7│ moderate, between \n│0.7│ and │0.9│ high and > │0.9│ very high. Statistical significance refers to the \ngenerality of the relationship and the likelihood the observed relationship occurred by \nchance.  \n \nIn addition to non-parametric correlation analysis, classification and regression trees \n(CART) as introduced by Breimann et al. (1984) were applied to analyse the \nmultivariate correlations between the tissue N concentration of mosses and \ncharacteristics of the surroundings of the 2781 sampling sites such as modelled air \nconcentrations and depositions of N and land cover. CART does not make any \nassumptions regarding the distribution of the data and can use an explanatory \nvariable more than once, so it is able to work with multiple-interrelated data. CART \ncan reveal hierarchical and non-linear relationships among one dependent variable \n(tissue N concentration of mosses) and several descriptive variables (regional \ncharacteristics of the sampling sites such as N depositions and proportion of land \ncover) by sub-dividing a heterogeneous data set into more homogeneous sub-sets \n(classes, groups, nodes) by a series of nested binary ‘if-then-else’ splits. Each split \nmaximises the homogeneity of the dependent variable. Each possible binary split for \nall variables is evaluated recursively for the best class separation until homogeneous \nend points (nodes) are reached. The predictor selected is the one for which the two \nnew classes have the greatest within-group similarity for the response variable. The \ntwo new classes are then examined separately, with respect to each of the predictor \nvariables, to see if they can be split again. The resulting dendrogram can have \nmultiple branches, each of which represents a path to a particular combination of \nindependent variables defining variable sub-spaces. \n 3 Results \nThe Spearman rank correlations coefficients rs were computed to identify the \nrelations between the different N depositions (dry and wet oxidised and reduced N \ndeposition, total dry and total wet N deposition and total N deposition) and air \nconcentrations (NO2, HNO3, NO3\n-, NH3, NH4\n+) as well as site-specific and regional \nland characteristics on the one hand and the N concentration in mosses on the other \nhand. Figure 1 shows the rank correlation coefficients between the total N \nconcentration in mosses and the modelled EMEP depositions and air concentrations \nand table 2 lists the rank correlation coefficients between the total N concentration in \nmosses and site-specific or regional characteristics. The correlation coefficients are \nonly depicted with regard to the three years mean of all EMEP components since \nonly minor differences exist to those correlation coefficients calculated for depositions \n\/ air concentration representing the year of sampling. The highest correlations (rs = \n0.64 – 0.68) exist between the N concentrations in mosses and NH4\n+ concentrations \nin air, wet and dry deposition of oxidised N, the total wet N deposition and the total N \ndeposition. Regarding the regional land characteristics, the proportion of urban land \nuses in a radius of 75 - 100 km and agricultural land uses in a radius of 50 km around \nthe monitoring sites showed the highest correlations with the total N concentration in \nmosses (rs = 0.55 and rs = 0.54, respectively). Low correlations (rs < 0.5) were \nobserved for altitude, precipitation, distance to sea, forested land use and population \nand livestock density.  \n \nFigure 1: Spearman rank correlation coefficients between N concentration in mosses \nand EMEP modelled air concentration and deposition of various N forms (three year \nmean)  \n \nTable 2: Spearman rank correlation coefficients between N concentration in mosses \nand site-specific and regional characteristics  \n \nMultivariate relations between the tissue N concentrations of mosses and modelled \nEMEP N depositions \/ air concentrations and potential site-specific and regional land \ncharacteristics (Table 1) were analysed using CART. The respective results are \nshown for the first three levels of the CART dendrogram in Figure 2. According to the \nroot node of the dendrogram, the mean N concentration in mosses amounts to \n1.22% N. As can be seen, the modelled NH4\n+ concentration in air is the most \npowerful predictor for the total N concentration in mosses: at sites with NH4\n+ \nconcentrations below 0.63 mg m-3 the mean tissue N concentration of mosses equals \n0.88% (node 1) whereas at sites with NH4\n+ concentrations above 0.63 mg m-3 the \nmean is 1.41% (node 2). The sampling sites classified in node 1 are further \ndifferentiated by the NO2 concentrations in air: in mosses sampled at sites with NO2 \nconcentrations below 0.53 mg m-3 the N concentration in mosses is lower (0.65%) \n(node 3) than at locations where the concentrations exceed 0.53 mg m-3 (0.96%) \n(node 4). Node 2 is sub-divided by the sampled moss species: at sampling sites \nwhere Abietinella abietina (Aa), Hylocomium splendens (Hs), Pleurozium schreberi \n(Ps), Rhytidiadelphus squarrosus (Rs) or mosses of the genus Scleropodium (Scl. \nsp.) other than Scleropodium purum were sampled lower N concentrations in mosses \nwere measured (1.29 %) (node 5) than at sites where Brachythecium rutabulum (Br), \nHylocomium splendens (Hs), Pseudoscleropodium purum* (Pp), Scleropodium \nPurum  (Sp), Thuidium abietinum (Ta), Thuidium tamariscinum (Tt) or mosses of the \ngenus Brachythecium (Bra. sp.), Dicranum (Dic. sp.) and Homalothecium (Hom. sp.) \nwere sampled (1.52%) (node 6). Level 3 nodes 5 and 6 are furthermore split \naccording to the total dry N deposition and the air concentration of ammonium. The \nCART dendrogram depicted in Figure 2 accounts for up to 44.8% of the total \nvariance of the total N concentration in mosses measured at the 2781 sites. \n \nFigure 2: CART-dendrogram of factors associated with N concentrations in mosses, \nexplaining 44.8% of the total N concentration in mosses. \n \n4 Discussion \nThis study reveals that mosses can potentially be used as biomonitors of total \natmospheric deposition of N at a high spatial resolution. The highest, albeit \nmoderate, bivariate correlations were found between EMEP modelled air \nconcentrations and deposition of different N forms and the total N concentrations in \nmosses. Multivariate analysis identified modelled NH4\n+ concentrations in air as the \nmost powerful predictor of the total N concentration in mosses. The total N \nconcentration in mosses appears to mirror land use-related atmospheric \n                                            \n Now collectively called Pseudoscleropodium purum (Hill et al. 2006). \nconcentrations and depositions of N across Europe as moderate bivariate \ncorrelations were also observed between the proportion of urban land uses (in a \nradius of 75 - 100 km) and the proportion of agricultural land uses (in a radius of 50 \nkm). Correlations with other site-specific or regional characteristics were lower.  \n \nThe applied statistical techniques are robust against skewed distribution of the data \nand the influence of potential outliers. Autocorrelations for the N concentrations in \nmosses exist but are rather weak (nugget \/ sill ratios of above 0.7 for four sub-\nregions in Europe). The assumption of independence for the target variable was \ntherefore not violated. Furthermore, the existing co-linearities between the predicting \nvariables are not a problem since each variable was investigated separately and not \naltogether as done in multivariate approaches like cluster or regression analyses. By \napplying CART, each predicting variable is examined separately with regard to the \nimprovement of homogeneity they result in. Only the best predictor is chosen for \neach split.  \n \nThis study may be regarded as a cross validation of European moss data and EMEP \nmodel data for N, but is complicated by both potential limitations in the of mosses as \nmonitors of atmospheric N deposition (Harmens et al., 2008b; Zechmeister et al., \n2008) and the uncertainties in the modelled nitrogen deposition, including \nuncertainties in emissions (Lieven et al., 2009). The moss technique provides a tool \nfor validating the spatial pattern for modelled EMEP air concentrations and \ndepositions of nitrogen compounds at a higher spatial resolution than can be \nachieved using the EMEP measurement stations throughout Europe. Atmospheric N \ninput to terrestrial ecosystems is spatially variable due to e.g. distance to emission \nsources, variations in the aerodynamic roughness of vegetation, microclimate, \ncanopy drip or orographic effects. As a result, site-specific inputs of N vary \nconsiderably from the mean annual deposition of a region. Indeed, when the total N \nconcentration in mosses was plotted against site-specific bulk N deposition in \nSwitzerland, a strong positive linear relationship (r = 0.95) was observed (Thöni et al., \n2008). Nevertheless, previous studies in selected Scandinavian countries have also \nshown strong positive linear relationships between the total N concentration in \nmosses and EMEP modelled N deposition data (Harmens et al., 2005), which might \nbe due to the absence of significant local pollutions sources in many of these parts of \nScandinavia.  \n \nIn Germany, the N concentrations in mosses (Pleurozium schreberi) and pine \nneedles were compared with N deposition rates and N concentrations in precipitation \n(Mohr, 1999). The study covered 23 forest sites in northern Germany sampled \nbetween 1996 and 1998. The correlation (r) between the N concentration in mosses \nand pine needles was 0.87 (p < 0.001) and between the N concentration in mosses \nand N concentration in precipitation (measured in the year before the sampling) was \n0.9 (p < 0.001). In 1998, the correlation between the N concentration in mosses and \nthe annual N (NO3\n- + NH4\n+) deposition rate was 0.93 (p < 0.01). There is a need to \nmeasure atmospheric N deposition at selected moss sampling sites in other \ncountries too in order to further investigate the robustness of the relationship with \ntotal N concentration in mosses. \n \nIn the current study, bivariate correlations between N concentrations in mosses and \nair concentration and \/ or deposition of different N species were quite similar for \nsome N species, with multivariate analysis identifying NH4\n+ concentrations in air as \nthe most powerful predictor of the total N concentration in mosses. However, Pitcairn \net al. (2006) have shown that N concentration in mosses can respond differently to \nwet and dry deposited N. They concluded that N concentrations in mosses provide a \ngood indication for N deposition at sites where deposition is dominated by NH3, and \nis also valuable in identifying vegetation exposed to large concentrations of NH4\n+ and \nNO3\n-, in wet deposition dominated areas, such as hilltops and wind exposed \nwoodland edges. In line with these findings, Pearce and Van der Wal (2008) \nsuggested that tissue N concentration in mosses is more sensitive to N \nconcentrations rather than deposition dose. It is therefore vital to gain a better \nunderstanding of the role concentration and dose and the various N forms play in \nthreatening the survival of sensitive species and their habitats (Nordin et al., 2009).  \nIt should be noted that in general the EMEP model results agree better with \nmeasurements for the secondary components such as ammonium and nitrate in air. \nNH3 concentrations differ greatly within small distances, which is impossible to \nreproduce with a model with a resolution of 50*50km. Moreover, whilst wet \ndepositions are regularly validated against measurements, measurement data on dry \ndeposition of nitrogen are scarce. Furthermore, the data that exists have been used \nto develop the dry deposition parametrisations that are used in the model – thus an \nindependent validation is difficult. \n \nAs biomonitors of atmospheric N depositions, mosses can potentially be used for \nidentifying areas at risk from high N deposition (Harmens et al., submitted). Increased \ndeposition of atmospheric N is affecting biodiversity and the composition of natural \nand semi-natural vegetation in Europe (Bobbink et al., in press). The European Union \nHabitats Directive (92\/43\/EEC) promotes the maintenance of biodiversity and \nrequires member states to take measures to maintain or restore natural habitats at a \nfavourable conservation status. The Directive established the Natura 2000 network \nwith the aim to assure the long-term survival of Europe's most valuable and \nthreatened species and habitats. The provisions of the Directive require strict site \nprotection measures, avoidance of deterioration and introduce a precautionary \napproach. Mosses and lichens are already routinely sampled in Denmark to assist \nwith the assessment of Natura 2000 sites (Anderson et al., 2006). However, most \nlikely a combination of the bioindicators \/ biomonitors will best describe the state on \nNatura 2000 sites (Nordin et al., 2009). It would be very useful if bioindicators \/ \nbiomonitors could be applied throughout Europe to provide detailed information on \nthe spatial patterns of N deposition and localise spatially varying exceedance of the \ncritical N load values (Pitcairn et al., 2006). The conversion of the N concentrations in \nmosses to spatially highly resolved N deposition maps could be done by applying \nregression kriging as described by Hengl et al. (2007). \n \nRecent pilot studies in Germany and France had already shown strong positive \ncorrelations between the N concentration in mosses and the proportion of agricultural \nland use around the moss sampling sites (Holy et al., 2008; Pesch et al., 2007b; \nPesch et al., 2008). Although other factors such as urban land use, canopy drip and \nmoss species were also identified as main factors determining the spatial variation in \nN concentration in mosses, modelled air concentrations and depositions were not yet \nincluded in those studies. The outcome of those studies is in agreement with other \nstudies (Bytnerowicz et al., 2002; Frati et al., 2007; Jovan and Carlberg, 2007; Jovan \nand Mccune, 2006), which identified agriculture, especially the application of animal \nmanure, animal feedlots and mast farms, as the major source of N in the \nenvironment. Further important sources are road traffic (Jovan and Mccune, 2006; \nLuo et al., 2003), urban emissions (Bytnerowicz and Fenn, 1996) and forest fires \n(Jovan and Carlberg, 2007). \n \n5 Conclusions \nThe total N concentration in mosses mirrors land use-related atmospheric \nconcentrations and depositions of N to a considerable degree and is therefore a \nvaluable tool in identifying areas with high atmospheric N concentration and \ndeposition at a high spatial resolution across Europe. The high number of \nmeasurement sites in the moss surveys can improve the evaluation of the EMEP N \ndeposition and air concentration modelling. Studies are currently ongoing to cross-\nvalidate the N concentration in mosses with EMEP modelled air concentrations and \ndepositions of N at a higher spatial resolution, i.e. 10 x 10 and 25 x 25 km2 grids. \nCorrelations between the two datasets can help to improve the spatial resolution of \nair concentration and deposition maps of N by means of a regression kriging \napproach based on surface maps of N concentrations in mosses (Hengl et al., 2007). \nThe resulting high-resolution N deposition maps could potentially be used to assess \natmospheric N inputs into protected areas like e.g. Natura 2000 areas. In order to \nenhance the robustness of the relationship between total N deposition and total N \nconcentration in mosses, more measurements of site-specific air concentrations and \ndepositions of N and other site-specific characteristics are required. \n \nReferences \nAndersen J.M., Boutrup S., van der Bijl L., Svendsen L.M., Bøgestrand J., Grant R., \nLauridsen T.L., Ellermann T., Ærtebjerg G., Nielsen K.E., Søgaard B., Jørgensen \nL.F. & Dahlgren K., 2006. Aquatic and Terrestrial Environment 2004 State and trends \n- technical summary. NERI Technical Report, No. 579 \n \nBerge E., Jakobsen, H.A., 1998. A regional scale multi-layer model for the calculation \nof long-term transport and deposition of air pollution in Europe. Tellus 50, 205–223. \n \nBobbink, R., Hicks, K., Galloway, J.N., Spranger, T., Alkemade, R., Ashmore, M., \nBustamante, M., Cinderby, S., Davidson, E., Dentener, F., Emmett, B., Erisman, J-\nW., Fenn, M., Gilliam, F., Nordin, A., Pardo, L., de Vries, W., in press. Global \nassessment of nitrogen deposition effects on terrestrial plant diversity: a synthesis. \nEcological Applications. \n \nBöhlmann N., Meissner R., Bernsdorf S., Böhme F., Russow R., Wegener U., 2005. \nStudies of atmospheric nitrogen deposition in a mire of the German national park \nHochharz Mountains using two different methods. Water, Air and Soil Pollution 168, \n17–32. \n \nBragazza L., Limpens J., Gerdol R., Grosvernier P., Hájek M., Hájek T., Hajkova P., \nHansen I., Iacumin P., Kutnar L., Rydin H., Tahvanainen T., 2005. Nitrogen \nconcentration and δ 15N signature of ombrotrophic Sphagnum mosses at different N \ndeposition levels in Europe. Global Change Biology 11, 106-114. \n \nBreimann L., Friedmann J.A., Olshen R.A., Stone C.J., 1984. Classification and \nregression trees. Wadsworth, Belmont, CA. \n \nBytnerowicz A., Fenn M.E., 1996. Nitrogen deposition in California forests: a review. \nEnvironmental Pollution 92 (2), 127–146. \n \nBytnerowicz A., Tausz M., Alonso R., Jones D., Johnson R., Grulke, N., 2002. \nSummer-time distribution of air pollutants in Sequoia National Park, California. \nEnvironmental Pollution 118, 187–203. \n \nDumas J.B.A. 1831. Procedes de l'Analyse Organique, Ann. Chim. Phys. 247,198–\n213. \n \nErisman J. W., de Vries W. 2000. Nitrogen deposition and effects on European \nforests. Environmental Reviews 8(2), 65-93. \n \nFagerli H., Aas W, 2008. Trends of nitrogen in air and precipitation: Model results \nand observations at EMEP sites in Europe, 1980-2003. Environmental Pollution 154, \n448-461 \n \nFagerli H., Legrand M., Preunkert S., Simpson D., Vestreng V., Cerqueira, M., 2007. \nModeling historical long-term trends of sulfate, ammonium and elemental carbon \nover Europe: A comparison with ice core records in the Alps. Journal of Geophysical \nResearch 112, D23S13. \n \nFagerli H., Simpson D., Aas W., 2003. Model performance for sulphur and nitrogen \ncompounds for the period 1980 to 2000, in: Tarrasón, L. (Ed.), Transboundary \nAcidification, Eutrophication and Ground Level Ozone in Europe. EMEP Status \nReport 1\/2003, Part II Unified EMEP Model Performance, The Norwegian \nMeteorological Institute, Oslo, Norway, pp. 66. \n \nFagerli H., Simpson D., Tsyro S., 2004. Transboundary acidification, eutrophication \nand ground level ozone in Europe. EMEP Status Report 1\/2004, Unified EMEP \nmodel: Updates, pp.11-18, The Norwegian Meteorological Institute, Oslo, Norway. \n \nFenn M.E., Geiser L., Bachmann R., Blubaugh T.J., Bytnerowicz A., 2007. \nAtmospheric deposition inputs and effects on lichen chemistry and indicator species \nin the Columbia River Gorge USA. Environmental Pollution 146, 77–91.  \n \nFenn M.E., Kiefer J.W., 1999. Throughfall deposition of nitrogen and sulfur in a \nJeffrey pine forest in the San Gabriel Mountains, southern California. Environmental \nPollution 104, 179–187. \n \nFernández J.A., Carballeira A., 2002. Biomonitoring metal deposition in Galicia (NW \nSpain) with mosses: factors affecting bioconcentration. Chemosphere 46, 535–542. \n \nFowler D., Sutton M.A., Smith R., Pitcairn C.E.R., Coyle M., Campbell G., Stedman \nJ., 1998. Regional mass budgets of oxidized and reduced nitrogen and their relative \ncontribution to the nitrogen inputs of sensitive ecosystems. Environmental Pollution \n102, 337-342.  \n \nFrati l., Santoni S., Nicolardi V., Gaggi C., Brunialti G., Guttova A., Gaudino S., Pati \nA., Pirintsos S.A., Loppi S., 2007. Lichen biomonitoring of ammonia emission and \nnitrogen deposition around a pig stockfarm. Environmental Pollution 146, 311–316. \n \nGalloway J. N., Townsend A. R., Erisman J. W., Bekunda M., Cai Z., Freney J. R., \nMartinelli L.A., Seitzinger S. P., Sutton M.A., 2008. Transformation of the nitrogen \ncycle: Recent trends, questions, and potential solutions. Science 320 (5878), 889-\n892. \n \nGundersen P., Rasmussen L. 1990. Nitrification in forest soils: Effects from nitrogen \ndeposition on soil acidification and aluminium release. Rev. Environ. Contam. \nToxicol. 113, 1–45.  \n \nHagl S. 2008. Schnelleinstieg Statistik - Daten erheben, analysieren, präsentieren. \nFreiburg, Berlin, München. \n \nHarmens H., Mills G., Hayes F., Williams P. De Temmerman L and the participants of \nICP Vegetation, 2005. Air pollution and vegetation. ICP Vegetation Annual Report \n2004\/2005. UNECE ICP Vegetation Coordination Centre, Centre for Ecology and \nHydrology, Bangor, UK. http:\/\/icpvegetation.ceh.ac.uk. \n \nHarmens H., Norris D. and the participants of the moss survey, 2008a. Spatial and \ntemporal trends in heavy metal accumulation in mosses in Europe (1990-2005). \nProgramme Coordination Centre for the ICP Vegetation, Centre for Ecology and \nHydrology, Bangor, UK. http:\/\/icpvegetation.ceh.ac.uk. \n \nHarmens H., Norris D., Cooper D., Hall J. and the participants of the moss survey, \n2008b. Spatial trends in nitrogen concentrations in mosses across Europe in 2005 \/ \n2006. - Programme Coordination Centre for the ICP Vegetation, Centre for Ecology \nand Hydrology, Environment Centre Wales, Bangor, UK. \nhttp:\/\/icpvegetation.ceh.ac.uk \n \nHarmens, H., Norris, D.A., Cooper, D.M., Schröder, W., Pesch, R., Holy, M., Fagerli, \nH., Alber, R., Coşkun, M., De Temmerman, L., Frolova, M., Jeran, Z,, Kubin, E., \nLeblond, S., Liiv, S., Maňkovská, B., Santamaría, J., Suchara, I., Thöni, L., Yurukova, \nL., Zechmeister, H.G., submitted. Mosses as biomonitors of atmospheric nitrogen \ndeposition: potential application at Natura 2000 sites. In: Proceedings COST 729 \nworkshop on ‘Nitrogen Deposition and Natura 2000. Science and practice in \ndetermining environmental impacts’, 18 - 20 May, 2009, Brussels, Belgium. \n \nHengl T., Heuvelink G.B.M., Rossiter D.G., 2007. About regression-kriging: From \nequations to case studies. Computers & Geosciences 33 (10), 1301-1315.  \n \nHill M.O., Bell N., Bruggeman-Nannenga M.A., Brugués M., Cano M.J., Enroth J., \nFlatberg K.I., Frahm J.-P., Gallego M.T., Garilleti R., Guerra J., Hedenäs L., Holyoak \nD.T., Hyvönen J., Ignatov M.S., Lara F., Mazimpaka V., Muñoz J., Söderström L., \n2006. An annotated checklist of the mosses of Europe and Macaronesia. Journal of \nBryology 28, 198-267. \n \nHoly M., Leblond S., Pesch R. Schröder W. 2008. Spatial patterns of metal and \nnitrogen accumulation in French mosses. Assessment of influencing factors by \nmeans of multivariate statistics, in: Schaub M. et al. (Eds.), Air pollution and climate \nchange at contrasting altitude and latitude, 23rd IUFRO Conference for Specialists in \nAir Pollution and Climate Change Effects on Forest Ecosystems. Murten, \nSwitzerland, 7 – 12 Sept. 2008, Swiss Federal Institute WSL, Birmensdorf, 162 pp. \n \nHornsmann I., Pesch R., Schmidt G., Schröder, W., 2008. Calculation of an \nEcological Land Classification of Europe (ELCE) and its application for optimising \nenvironmental monitoring networks, in: Car, A. et al. (Eds.), Geospatial Crossroads \n@ GI_Forum '08: Proceedings of the Geoinformatics Forum Salzburg, Wichmann, \nHeidelberg, pp. 140 – 151. \n \nICP Vegetation, 2005. Heavy metals in European mosses: 2005\/2006 survey. \nMonitoring manual. ICP Vegetation Coordination Centre, Centre for Ecology and \nHydrology, Bangor, UK. http:\/\/icpvegetation.ceh.ac.uk  \n \nJonson J.E., Bartnicki J., Olendrzynski K., Jakobsen H.A., Berge E., 1998. EMEP \nEulerian model for atmospheric transport and deposition of nitrogen species over \nEurope. Environmental Pollution 102, 289–298. \n \nJonson J. E., Simpson D., Fagerli H., Solberg, S., 2006. Can we explain the trends in \nEuropean ozone levels?. Atmospheric Chemistry and Physics 6(1), 51–66. Available \nfrom http:\/\/www.atmos-chem-phys.net\/6\/51\/2006\/acp-5-51-2006.pdf. \n \nJovan S., Carlberg T., 2007: Nitrogen content of Letharia vulpina tissue from forests \nof the Sierra Nevada, California: Geographic patterns and relationships to ammonia \nestimates and climate. Environmental Monitoring and Assessment 129, 243–251. \n \nJovan S., Mccune B., 2006. Using epiphytic macrolichen communities for \nbiomonitoring ammonia in forests of the Greater Sierra Nevada, California. Water, Air \nand Soil Pollution 170, 69–93.  \n \nKjeldahl, J. 1883. A new method for the determination of nitrogen in organic matter. \nZeitschrift für Analytische Chemie 22, 366. \n \nKeil M., Kiefl R., Strunz, G., 2005. CORINE Land Cover 2000 - Germany. Final \nReport, German Aerospace Center, German Remote Sensing Data Center, \nOberpfaffenhofen.  \n \nLieven C., Clerbaux C., Dentener F., Hurtmans D., Coheur P.-F., 2009. Global \nammonia distribution derived from infrared satellite observations. Nature Geoscience \n2, 479 – 483. \n \nLuo Y., Yang X., Carley R.J., Perkins C., 2003. Effects of geographical location and \nland use on atmospheric deposition of nitrogen in the State of Connecticut. \nEnvironmental Pollution 124, 437–448.  \n \nMohr K., 1999. Passives Monitoring von Stickstoffeinträgen in Kiefenforsten mit dem \nRotstengelmoos (Pleurozium schreberi (Brid. )Mitt.). Umweltwissenschaften und \nSchadstoffforschung 11 (5), 267-274 \n \nNeirynck J., Kowalski A.S., Carrara A., Genouw G., Berghmans P., Ceulemans R., \n2007. Fluxes of oxidised and reduced nitrogen above a mixed coniferous forest \nexposed to various nitrogen emission sources. Environmental Pollution 149, 31–43. \n \nNordin A., Sheppard L., Strengbom J., Gunnarsson U., Hicks K., Sutton M. A., 2009. \nUnderstanding of nitrogen deposition impacts. Background document COST 729 \nworkshop on ‘Nitrogen Deposition and Natura 2000. Science and practice in \ndetermining environmental impacts’, 18 - 20 May, 2009, Brussels, Belgium. \n \nPearce I.S.K., Van der Wal R., 2008. Interpreting nitrogen polluion thresholds for \nsensitive habitats: The importance of concentration versus dose. Environmental \nPollution 152, 253-256. \n \nPesch R., Holy M., Schröder W., 2008. Statistical investigation of the atmospheric \naccumulation of antimony and nitrogen in mosses, in: Car A. et al. (Eds.), Geospatial \nCrossroads @ GI_Forum '08: Proceedings of the Geoinformatics Forum Salzburg, \nWichmann, Heidelberg, pp. 227 – 236. \n \nPesch, R., Schmidt, G., Schröder, W., Aden, C., Kleppin, L., Holy, M. 2007a. \nDevelopment, implementation and application of the WebGIS MossMet. In: \nTochtermann K., Scharl, A. (Eds.): The Geospatial Web. How geo-browsers, social \nsoftware and the Web 2.0 are shaping the network society. Springer London, pp. \n191-200. \n \nPesch R., Schröder W., Mohr K., Matter Y., Kleppin L., Holy M., Goeritz A., Genßler \nL., 2007b. Moos-Monitoring 2005 \/ 2006: Schwermetalle IV und Gesamtstickstoff. \nR&D Project 205 64 200, Final Report, on behalf of the Federal Environment Agency, \nDessau \n \nPitcairn C.E.R., Fowler D., Grace J., 1995. Deposition of fixed atmospheric nitrogen \nand foliar nitrogen content of bryophytes and Calluna vulgaris (L.) Hull. \nEnvironmental Pollution 99, 193-205. \n \nPitcairn C., Fowler D., Leith I., Sheppard L., Tang S., Sutton M., Famulari D., 2006. \nDiagnostic indicators of elevated nitrogen deposition. Environmental Pollution 144, \n941–950. \n \nPitcairn C., Leith I., Sheppard L., Sutton M., Fowler D., Munro R., Tang S., Wilson, \nD., 1998. The relationship between nitrogen deposition species composition and \nfoliar nitrogen concentrations in woodland flora. Environmental Pollution 102 (S1), \n41–48. \n \nPoikolainen J., Piispanen J., Karhu J., Kubin E., 2009. Long-term changes in nitrogen \ndeposition in Finland (1990-2006) monitored using the moss Hylocomium splendens. \nEnvironmental pollution 157 (11), 3091-3097. \n \nRühling A., Tyler G., 1968. An ecological approach to the lead problem. Botaniska \nNotiser 121, 321–343. \n \nRühling A., Tyler G. 1969. Ecology of heavy metals – a regional and historical study. \nBotaniska Notiser 121, 248-259. \n \nRühling A., Tyler G., 1970. Sorption and retention of heavy metals in the woodland \nmoss Hylocomium splendens (Hedw.) Br. Et Sch. Oikos 21, 248–342. \n \nSalemaa M., Mäkipää R., Oksanen J., 2008. Differences in the growth response of \nthree bryophyte species to nitrogen. Environmental Pollution 152, 82-91. \n \nSimpson D., Butterbach-Bahl K.; Fagerli H., Kesik M., Skiba U., Tang S., 2006a. \nDeposition and emissions of reactive nitrogen over European forests: A modelling \nstudy. Atmospheric Environment 40, 5712-5726. \n \nSimpson D., Fagerli H., Hellsten S., Knulst J.C., Westling O., 2006b. Comparison of \nmodelled and monitored deposition fluxes of sulphur and nitrogen to ICP-forest sites \nin Europe. Biogeosciences 3, 337-355. \n \nSimpson D, Fagerli H., Jonson J.E., Tsyro S., Wind P., Tuovinen J.-P., 2003. \nTransboundary acidification and eutrophication and ground level ozone in Europe: \nUnified EMEP Model Description, EMEP Status Report 1\/2003 Part I, EMEP\/MSC-W \nReport, The Norwegian Meteorological Institute, Oslo, Norway. \n \nSimpson D., Yttri K.E., Klimont Z., Kupiainen K., Caseiro A., Gelencsér A., Pio C., \nLegrand M., 2007. Modeling carbonaceous aerosol over Europe. Analysis of the \nCARBOSOL and EMEP EC\/OC campaigns. Journal of Geophysical Research 112, \nD23S14. \n \nSlanina, S.,  Wayne D., 2008. Air pollution emissions, in: Cleveland, C.J. (Ed.), \nEncyclopedia of Earth. First published in the Encyclopedia of Earth October 18, \n2006; Last revised August 21, 2008; Retrieved August 21, 2009. \nhttp:\/\/www.eoearth.org\/article\/Air_pollution_emissions. \n \nSolga A., Burkhardt J., Zechmeister H.G., Frahm J.-P., 2005. Nitrogen content, 15N \nnatural abundance and biomass of the two pleurocarpous mosses Pleurozium \nschreberi (Brid.) Mitt., and Scleropodium purum (Hedw.) Limpr. in relation to \natmospheric nitrogen deposition. Environmental Pollution 134, 465-473. \n \nSteinnes E., Rühling Å., Lippo H., Mäkinen A., 1997. Reference material for large-\nscale metal deposition surveys. Accreditation and Quality Assurance 2: 243-249. \n \nThöni L, Matthaei D, Seitler E, Bergamini A. 2008. Deposition von Luftschadstoffen in \nder Schweiz. Moosanalysen 1990 - 2005. Umwelt Zustand Nr. 0827, Bundesamt für \nUmwelt, Bern, Switzerland. www.umwelt-schweiz.ch\/uz-0827-d \n \nTsyro S., Simpson D., Tarrasón L.,  Klimont Z., Kupiainen K., Pio C., Yttri K. E., 2007. \nModeling of elemental carbon over Europe. Journal of Geophysical Research 112, \nD23S19. \n \nStevens, S. S., 1946. On the theory of scales of measurement. Science 103, 677–\n680. \n \nVestreng V., Adams M., Goodwin J., 2004. Inventory review 2004. Emission data \nreported to CLRTAP and under the NEC directive. EMEP\/EEA Joint Review Report, \nTech. Rep. EMEP-MSCWReport 1\/2004. The Norwegian Meteorological Institute, \nOslo, Norway. \n \nZechmeister H.G., Hohenwallner D., Smidt S., Roder I., Maringer S., Richter A., \nWanek W., 2008. Total nitrogen content and 15N signatures in moss tissue:  \nIndicative value for nitrogen deposition patterns and source allocation on a nation- \nwide scale. Environmental Science and Technology, 42, 8661- 8667. \nTable 1: Predictors used for correlation analyses. \nPredictor Resolution Data Source\nMoss species site-specific\nAltitude site-specific\nAnalytical method site-specific\nSea distance site-specific\nPrecipitation 12.5 km x 12.5 km CRU\n1\nPopulation density 100 m x 100 m EEA\n2\nAgricultural land uses (1, 5, 10, 25, 50 km radius) 1 km x 1 km EEA\n2\nForested land uses (1, 5, 10, 25 km radius) 1 km x 1 km EEA\n2\nUrban land uses (1, 5, 10, 25, 50 km radius) 1 km x 1 km EEA\n2\nUrban land uses (75, 100 km radius) 2 km x 2 km EEA\n2\nLivestock density Country-specific EUROSTAT\n3\nWet deposition of oxidised nitrogen compounds 50 km x 50 km MSC-West\n4\nDry deposition of oxidised nitrogen compounds 50 km x 50 km MSC-West\n4\nWet deposition of reduced nitrogen compounds 50 km x 50 km MSC-West\n4\nDry deposition of reduced nitrogen compounds 50 km x 50 km MSC-West\n4\nTotal wet deposition (oxidised + reduced) 50 km x 50 km MSC-West\n4\nTotal dry deposition (oxidised + reduced) 50 km x 50 km MSC-West\n4\nTotal N deposition (total dry + total wet) 50 km x 50 km MSC-West\n4\nNO2 concentration in air 50 km x 50 km MSC-West\n4\nHNO3 concentration in air 50 km x 50 km MSC-West\n4\nNO3\n-\n concentration in air 50 km x 50 km MSC-West\n4\nNH3 concentration in air 50 km x 50 km MSC-West\n4\nNH4\n+\n concentration in air 50 km x 50 km MSC-West\n4\n1\n Climatic Research Unit, www.cru.uea.ac.uk\n2\n European Environment Agency, http:\/\/www.eea.europa.eu\/\n3\n Statistical Office of the European Communities, http:\/\/epp.eurostat.ec.europa.eu\n4\n Meteorological Synthesizing Centre-West of EMEP, http:\/\/met.no  \n \nTable 2: Spearman rank correlation coefficients between N concentration in mosses \nand site-specific and regional characteristics. \n \nPredictor rs (p < 0.001)\nAltitude -0.10\nPopulation density 0.48\nPrecipitation 0.25\nLivestock density (EUROSTAT) 0.42\nDistance to the sea 0.25\nAgricultural land use (1 km radius) 0.36\nAgricultural land use (5 km radius) 0.49\nAgricultural land use (10 km radius) 0.51\nAgricultural land use (25 km radius) 0.52\nAgricultural land use (50 km radius) 0.53\nForestal land use (1 km radius) -0.11\nForestal land use (5 km radius) -0.21\nForestal land use (10 km radius) -0.23\nForestal land use (25 km radius) -0.23\nUrban land use (1 km radius) 0.15\nUrban land use (5 km radius) 0.41\nUrban land use (10 km radius) 0.49\nUrban land use (25 km radius) 0.51\nUrban land use (50 km radius) 0.54\nUrban land use (75 km radius) 0.55\nUrban land use (100 km radius) 0.55  \n \nFigure 1: Spearman rank correlation coefficients between N concentration in mosses \nand EMEP modelled air concentration and deposition of various N forms (three year \nmean). \n \n \n \n0.68\n0.53\n0.61\n0.61\n0.54\n0.64\n0.65\n0.62\n0.59\n0.64\n0.55\n0.64\n0 0.25 0.5 0.75 1\nN total dep (wet + dry)\nN total\nN oxidised\nN reduced\nN total\nN oxidised\nN reduced\nNH4+\nNH3\nNO3-\nHNO3\nNO2\nSpearman correlation coefficient\np < 0.001 \nDry \nDep \nWet \nDep \nAir \nconc. \n2 \n \nHN 3 \n \n3\n- \n \n3 \n \nNH4\n+ \n \n \n \n \n \nFigure 2: CART-dendrogram of factors associated with N concentrations in mosses, \nexplaining 44.8% of the total N concentration in mosses. \n \n \nAbietinella abietina (Aa), Brachythecium (Bra. sp.), Brachythecium rutabulum (Br), \nDicranum (Dic. sp.), Homalothecium (Hom. sp.), Hylocomium splendens (Hs), \nPleurozium schreberi (Ps), Pseudoscleropodium purum* (Pp), Rhytidiadelphus \nsquarrosus (Rs), Scleropodium (Scl. sp.), Scleropodium purum* (Sp), Thuidium \nabietinum (Ta), Thuidium tamariscinum (Tt)  \n \n*Species classification is according to the nomenclature used during the 2005\/6 \nEuropean moss survey. Scleropodium purum and Pseudoscleropodium purum are \nnow collectively called Pseudoscleropodium purum (Hill et al., 2006) \n"}