{"doi":"10.1179\/146580102225006350","coreId":"139988","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1943","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1943","10.1179\/146580102225006350"],"title":"Investigation of cure induced shrinkage in unreinforced epoxy resin.","authors":["Zarrelli, M.","Skordos, Alexandros A.","Partridge, Ivana K."],"enrichments":{"references":[{"id":37956648,"title":"350 Temperature (°C) H e a t F l o w","authors":[],"date":null,"doi":"10.1038\/098350a0","raw":"70 140 210 280 350 Temperature (°C) H e a t F l o w ( W \/ g ) Bandara Baseline Heat Flow W\/g","cites":null},{"id":37956641,"title":"An introduction to genetic algorithms’,","authors":[],"date":"1998","doi":"10.1007\/978-3-540-73190-0","raw":"M  Mitchell: ‘An introduction to genetic algorithms’, 1998, MIT Press, US","cites":null},{"id":37956640,"title":"Appl Polym Sci,","authors":[],"date":"2000","doi":"10.1002\/1097-4628(20000815)77:7<1419::aid-app3>3.0.co;2-n","raw":"P I Karkanas and I K Partridge: J Appl Polym Sci, 2000, 77, 1419-1431","cites":null},{"id":37956638,"title":"Armeniades: Polym Eng Sci ,","authors":[],"date":"1986","doi":"10.1002\/pen.760262109","raw":"E Haque and C D Armeniades: Polym Eng Sci , 1986, 26, 1524-1530","cites":null},{"id":37956644,"title":"Gillham: Adv Chem Ser,","authors":[],"date":"1983","doi":null,"raw":"J B Enns and J K Gillham: Adv Chem Ser, 1983, 203, 27 - 38","cites":null},{"id":37956645,"title":"Karkanas and I K Partridge :","authors":[],"date":"2000","doi":"10.1002\/1097-4628(20000815)77:7<1419::aid-app3>3.0.co;2-n","raw":"P I Karkanas and I K Partridge : J Appl Polym Sci, 2000, 77, 2178-2188","cites":null},{"id":37956646,"title":"Polym Eng Sci,","authors":[],"date":"1987","doi":"10.1002\/pen.v27:9","raw":"H H Winter : Polym Eng Sci, 1987, 27, 1698-1702. Plastics, Rubber and Composites Processing and Applications 31(2002). 377-384","cites":null},{"id":37956642,"title":"Revs Macromol Chem,","authors":[],"date":"1969","doi":null,"raw":"L E Nielsen: J Macromol Sci, Revs Macromol Chem, 1969, 3, 69","cites":null},{"id":37956639,"title":"Thermal Anal,","authors":[],"date":"1986","doi":null,"raw":"U Bandara:  J  Thermal Anal, 1986, 31, 1063 -1071","cites":null},{"id":37956647,"title":"Time (min) H e a t F l o w","authors":[],"date":null,"doi":"10.2307\/2074529","raw":"100 200 300 400 Time (min) H e a t F l o w ( W \/ g ) T e m p e r a t u r e ( ° C ) Heat Flow Temperature (a) (b) -0.8 -0.4","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-11-01T00:00:00Z","abstract":"Changes in volume and thermal expansion coefficient have been investigated\nduring the cure of a high temperature curing epoxy resin containing a\nthermoplastic modifier. The measurements were carried out using a combination of\nstandard and novel thermoanalytical techniques. It is shown that the chemical\nshrinkage of the curing resin is a linear function of the degree of cure,\nwhereas the coefficient of thermal expansion depends on the temperature and on\nthe degree of cure. This experimental information is translated to an\nincremental model that simulates the volumetric changes occurring as the resin\nfollows a programmed thermal profile. Such a model can serve as a density\nsubmodel in simulating heat transfer or residual stress development in\ncomposites during the manufacturing process","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139988.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1179\/146580102225006350","pdfHashValue":"8c56c52e53da9cccf48791bc8c84308f6eec5d1b","publisher":"Maney Publishing","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1943<\/identifier><datestamp>2011-06-13T15:46:00Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Investigation of cure induced shrinkage in unreinforced epoxy resin.<\/dc:title><dc:creator>Zarrelli, M.<\/dc:creator><dc:creator>Skordos, Alexandros A.<\/dc:creator><dc:creator>Partridge, Ivana K.<\/dc:creator><dc:description>Changes in volume and thermal expansion coefficient have been investigated\nduring the cure of a high temperature curing epoxy resin containing a\nthermoplastic modifier. The measurements were carried out using a combination of\nstandard and novel thermoanalytical techniques. It is shown that the chemical\nshrinkage of the curing resin is a linear function of the degree of cure,\nwhereas the coefficient of thermal expansion depends on the temperature and on\nthe degree of cure. This experimental information is translated to an\nincremental model that simulates the volumetric changes occurring as the resin\nfollows a programmed thermal profile. Such a model can serve as a density\nsubmodel in simulating heat transfer or residual stress development in\ncomposites during the manufacturing process.<\/dc:description><dc:publisher>Maney Publishing<\/dc:publisher><dc:date>2011-04-14T23:16:31Z<\/dc:date><dc:date>2011-04-14T23:16:31Z<\/dc:date><dc:date>2002-11-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Zarrelli M.; Skordos A.A.; Partridge I.K.; Investigation of cure induced shrinkage in unreinforced epoxy resin, Plastics, Plastics, Rubber and Composites, Volume 31, Number 9, November 2002, pg377-384<\/dc:identifier><dc:identifier>1465-8011<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1179\/146580102225006350<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/1943<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1465-8011","1465-8011"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2002,"topics":[],"subject":["Article"],"fullText":"Plastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \n \n \nInvestigation of cure induced shrinkage in unreinforced epoxy resin \nMauro Zarrelli*, Alexandros A Skordos and Ivana K Partridge \nAdvanced Materials Dept, Cranfield University, Cranfield, Bedford, MK43 0AL, UK \n \nABSTRACT \nChanges in volume and thermal expansion coefficient were investigated during the cure \nof a high temperature curing epoxy resin containing a thermoplastic modifier. The \nmeasurements were carried out using a combination of standard and novel \nthermoanalytical techniques. It is shown that the chemical shrinkage of the curing resin \nis a linear function of the degree of cure, whereas the coefficient of thermal expansion \ndepends on the temperature and on the degree of cure. This experimental information is \ntranslated to an incremental model that simulates the volumetric changes occurring as \nthe resin follows a programmed thermal profile. Such a model can serve as a density \nsub-model in simulating heat transfer or residual stress development in composites \nduring the manufacturing process. \n \n1. BACKGROUND \nChemical reactions taking place during the cure of a thermosetting resin determine the \nroute by which the structure of the material changes from a liquid to a cross-linked \nsolid.  At any point in the cure this structure determines the chemical, thermal and \nmechanical properties associated with the given instantaneous degree of cure 1. The \nformation of chemical crosslinks leads to a volumetric shrinkage.  This cure induced \nshrinkage in thermosetting resins and their continuous fibre reinforced composites \nremains a poorly understood and only partially quantified feature of the processing \noperation, affecting issues such as warpage and residual internal stresses in composite \nstructures.  \n \nThe residual stresses are a consequence of the significant mismatch between the thermal \nexpansion coefficient (CTE) of the resin matrix and that of the reinforcing fibre.  A \ntypical cure profile involves an early heating ramp during which the uncured resin is in \nits liquid form and expands thermally without making any significant contribution to the \ncuring process.  The typical isothermal dwell stage that follows is accompanied by \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \npolymerisation shrinkage; finally thermal contraction occurs as the now solid composite \nis cooled down to room temperature.  It is in this cooling stage that the most significant \nresidual stresses are expected to be set up. Polymerisation shrinkage has been ignored to \nan extent, the argument being that it occurs at a relatively high temperature when the \nresin is in its rubbery state2. However, it has never been shown that polymerisation \nshrinkage in the resin, which can exceed 6% by volume3 ,  is able to relax mechanically. \nIndeed there are numerous additives, such as montmorillorite clays 4 and various \nthermoplastics 5,6 , which are routinely used in an attempt to counteract thermosetting \nresin shrinkage in a variety of  fibre reinforced composites.   \n \nThe level of modelling of composites manufacturing processes has improved \nsignificantly in recent years, but further progress is likely to be limited by the lack of  \nverified data on the cure dependent properties of resins 7-9. It is therefore timely to \nproduce better quality raw data to feed into such models 10.  The present paper describes \nthe development of a methodology for thermo-analytical characterisation of an \nunreinforced thermoset, with the emphasis on  following the conversion dependent \nchanges in the volume and the coefficient of thermal expansion of the resin as it is \ncuring. The experimental methods used range from basic thermal analysis, to rheometry  \nand liquid-solid dilatometry. A proprietary thermoplastic-modified epoxy resin, \nformulated for 160°C cure, was selected for practical measurement reasons, as it \nexhibits a relatively high chemical shrinkage.  The chemical nature of the formulation is \nunimportant here and the detailed experimental and modelling methodology presented \nin this paper is seen as applicable to any epoxy based resin.  \n \n2. METHODS  \n The analytical tools that need to be built up in order to obtain a quantified description \nof the conversion dependent property profile of the resin are: (1) the kinetics of the \ncuring reaction and the development of the glass-to-rubber transition temperature, Tg;   \n(2) identification of the gelation region; (3) dependence of the thermal expansion \ncoefficient upon the state of the material, and (4) the dependence of the chemical \nshrinkage upon the degree of cure. The following subsections set out the experimental \nmethods and associated theory that are necessary to the development of these analytical \ntools.  \n  \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \nCure kinetics and glass transition temperature \nDetailed knowledge of the chemical cure kinetics of the resin is an essential pre-\nrequisite of this study, in order that the measured changes in the resin can be associated \nwith a known degree of cure at all stages of the cure. The raw data were obtained from  \na modulated differential scanning calorimeter (TA Instruments MDSC Model 2920).  \nMeasurements were made in dynamic mode between –50°C and 320°C at a range of \nheating rates between 1 and 20 K min−1  \/, and subsequently under isothermal conditions \nat a number of set temperatures (120°C-200°C). About a hundred samples were used to \nobtain the data set and examples of raw data obtained are shown in Fig. 1. The \nequilibration to the required isothermal temperature occurred without any significant \ntemperature overshoot (see Fig.1a).  Details of standard data treatment, including the \nuse of Bandara’s baseline (see Fig.1b), can be found in reference 11. \n \nThe chemical cure kinetics were modelled using a modified expression of nth order, \ncombining autocatalytic and diffusion control models, as follows: \n \n( ) ( ) mnn kk\ndt\nd αααα ⋅−⋅+−⋅= 21 11 21      Eq.1 \n \nwhere α is the degree of conversion, ki is a reaction rate coefficient and n1, n2, m are \nadjustable parameters. The diffusion controlled aspects of the process can be expressed \nby adopting the following expression for the reaction rate: \n \ndiffch kkk\n111 +=          Eq.2 \n \nin which  \n \n)exp(\nTR\nEAk chchch ⋅−⋅=         Eq.3 \n \nwhere the subscripts ch and diff  refer respectively to chemical hardening and diffusion.  \nThus Ach is the Arrhenius pre-exponential constant, and Ech is the activation energy for \nthe chemical hardening reaction and R is the universal gas constant. \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \n \nThen, diffk    describes the diffusion mechanism, by: \n⎟⎟⎠\n⎞\n⎜⎜⎝\n⎛−⋅⎟⎟⎠\n⎞\n⎜⎜⎝\n⎛\n⋅−⋅= f\nb\nTR\nE\nAk diffdiffdiff expexp        Eq.4 \n \nwhere b is a fitting parameter, and the constants Adiff and Ediff  are similar equivalent to \nthose in Eq.3 but valid for those regions of the cure where diffusion limitations \ndominate. \nFinally, f represents the free volume fraction of the total volume of the material at \ntemperature T, which is  a function of the glass transition temperature Tg and the \nconversion α: \n \n( )[ ]αgTTf −⋅= 00048.0        Eq. 5 \n \nThe activation energy Ediff  can vary over five orders of magnitude.  This makes it \ndifficult to select appropriate initial points for the fitting procedure. In a previous cure \nkinetics study in our group 12, the starting points for the numerical fitting were selected \nfrom some knowledge, albeit limited, of the chemical composition of the resin. In the \npresent study, the chemical composition of the resin was unknown. The problem was \nresolved by using a genetic algorithm to locate the region of the absolute minimum of \nthe least squares function and then using non -linear least squares fitting tools to identify \nthe optimum parameters 13. A hybrid genetic algorithm was used to fit the model \ndescribed by Eqs. 1-5 to the complete set of experimental DSC data.  A single set of \nparameters, valid for both dynamic and isothermal measurement conditions, was \nobtained. \n \nEquation 5 expresses the dependence of the factors governing diffusion rates in the \ncuring resin upon its instantaneous glass transition temperature. The existence of a \nunique relationship between the degree of conversion, α, of a thermosetting polymer \nand its glass transition temperature, Tg, has been demonstrated by previous workers14 -16.  \nIn order to link the development of gT  with the progress of the reaction, the glass \ntransition temperatures of a number of partially cured resin samples were measured \nusing DSC. The samples were prepared by curing the resin in the DSC apparatus, under \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \neither dynamic heating conditions (1 - 20 K min−1 ) or under isothermal conditions (120 \n- 180°C) for different times and subsequently quenching them rapidly in liquid nitrogen. \nIt was necessary to prepare and test fifty such specimens in order to cover the whole \naccessible range of conversions.  The fast cooling of the samples was intended to limit \nany physical aging problems due to spontaneous densification of the resin; it was found \nthat characteristic physical aging peaks were absent from the subsequent DSC \nthermograms. The Tg values were determined as the inflection points of the heat flow \nstep in the DSC signal in a thermal scan at 10 K min−1. \n \n Identifying the gelation time region  \nThe experimental identification of the cure time or conversion at which the thermoset \nmay be assumed to have formed a three-dimensional (i.e. has gelled) remains a topic for \ndiscussion. It is common to use rheometric techniques to arrive at an operational \ndefinition of gelation, tgel, by selecting either the time at which the resin reaches an \narbitrary (high) viscosity value 17 or  the point at which at which curves for the storage \nand loss components of the complex shear modulus  cross over 18. In this work, \nmeasurements were carried out using a Bohlin CV 10 rheometer, oscillating at 0.5 Hz, \nwith a parallel plate configuration at gap setting of 0.5 mm. \n \nCoefficient of thermal expansion (CTE) \nThe thermal expansion coefficients of five different, partially cured, resin plate samples \nwere measured using a thermal mechanical analyser (TMA - TA Instruments Model \n2940) fitted with a standard expansion probe. Specimens with dimensions 3×3×15 mm \nwere cut and shaped from the plates. After placing the specimen in the cell and \nequilibrating the temperature at 30°C, the linear dimension of the sample was monitored \nup to 310°C, at a heating rate of 2 K min −1 . The minimum attainable force of 2 mN \nwas applied to maintain contact between the probe and the sample. The coefficient of \nthermal expansion of the material in its glassy state is the slope of the displacement-\ntemperature curve at temperatures below the appropriate glass transition temperature.  \nAs this part of the curve was reasonably linear, the CTE values were determined from a \nsimple linear fit, starting from 30 °C.  At temperatures above the Tg of of the partially \ncured samples, this means of determination of the CTE becomes inappropriate, partly \nbecause of possible probe penetration, but also because the sample will undergo post-\nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \ncure. The coefficient of thermal expansion above the Tg was therefore determined only \nin the case of fully cured sample, by linear fitting of the displacement versus \ntemperature curve. \n \nChemical shrinkage \nMeasurements  of specific volume during isothermal cure of the resin were performed \nusing an improved version of the Pressure-Volume-Temperature (PVT) GNOMIX \nequipment, at the National Physical Laboratory 19. The equipment uses an LVDT to \nmeasure changes in the linear dimensions of a cylindrical specimen, heated by a \nsurrounding electrical coil.   A liquid resin sample weighing about 1 g, previously \ndegassed for 45 min at 100°C, was poured into the cell, heated up and held at the test \ntemperature.  \n \n3. RESULTS  \n \nData from DSC \nThe glass transition temperatures, the residual heats of reaction and the degrees of cure \nof the individual resin plate samples A to E are summarised in Table 1, together with \nthe corresponding measured values of the coefficient of thermal expansion (CTE). The \nscatter in Tg values specified in the table was determined by separate DSC \nmeasurements on two samples from each corner and from the centre of each resin plate, \nat two different depths within a plate. The spatial variation in crosslink density \ncalculated from these measurements is less than 1% within any one resin plate.  The \nCTE values quoted represent an average of three measurements. \n \nThe agreement between the predictions of the cure kinetics model and the experimental \ndata from DSC tests was very satisfactory, as shown in Fig.2a for isothermal cures at \n120, 140, 160 and 180oC and in Figure 2b for dynamic cures carried out at heating rates \nbetween 1 and 20 K min−1.  In selecting parameters fort the model, the target across this \nwide range of processing conditions was an optimum fit for the gelation and post-\ngelation stages of cure.  \n \nFigure 3 illustrates the dependence of the experimentally measured Tg on the fractional \nconversion α. The model relating these two material quantities was taken from previous \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \nwork 17,18 and is based on the application of DiBenedetto’s equation (Eq.6).  A \nsatisfactory fit of the model to experimental data is obtained. \n( ) ( )( ) αλ\nλαα ⋅−−\n⋅−−+= ∞ 11\n1)( 00 ggg TTTTg       Eq.6 \nwhere CTg °−= 100  and CTg °=∞ 185  are the glass transition temperatures of the \nuncured and of the ‘fully’ cured resin respectively. In the present study, this particular \nresin can be assumed to be ‘fully’ cured at a conversion level of 96%. The adjustable \nparameter λ is characteristic for the system, and in this case takes the value of 0.656.  \n \nRheology and thermal expansion data \nThe rheometric experiments were carried out under isothermal conditions, at \ntemperatures between 110°C and 170°C.  Figure 4 shows the determination of time to \ngelation (tgel) at 140oC from the point of the crossover between G' and G\", the storage \nand loss components of the complex shear modulus when plotted against conversion α. \nThe resin is expected to gel after about 91 minutes of cure at 140°C. The corresponding \nfractional conversion, as calculated using the cure kinetics model, is α = 0.64.  The \nequivalent values for cure at 120°C are 205 minutes and α = 0.653.  Gelation times for \nisothermal cures decrease with increasing cure temperature.  There is a linear \nrelationship between the logarithm of time to gelation and the inverse of (absolute) \ntemperature, as shown in Fig. 5. The degree of conversion corresponding to the \nformation of the 3D network is fairly constant, in the range of 0.64-0.66.  \n \nFigure 6 shows the linear displacement, from TMA measurements, as a function of \ntemperature for the different resin plate samples.  The shape of the curve obtained from \nthe fully cured sample is as expected, with a classical indication of the glass transition \ntemperature at around 190°C from these measurements (c.f. ∞gT = 185°C from DSC). \nThe shapes of the curves for the partially cured resin samples indicate the onset of \nresidual reaction; there is a shoulder immediately after the Tg, followed by the combined \neffects of reaction shrinkage and thermal expansion.  \nThe heating period in the liquid dilatometry experiments was used to determine the \ncoefficient of thermal expansion of the liquid unreacted resin, which was found to be \n248 x 10-6 K−1 .  The coefficient of thermal expansion above the Tg, for fully cured \nmaterial, was determined from the final slope of the appropriate displacement versus \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \ntemperature curve in Fig. 6, and found to be 136 ×10-6 K−1.  The CTE values for the \nmaterial in the glassy state, as reported in Table 1, exhibit a linear dependence on the \nconversion (Fig.7). \n \nChemical shrinkage \nFigure 8 illustrates the changes in specific volume occurring during cure at two \nisothermal temperatures, namely 140°C and 160°C.  The initial rapid expansion in \nvolume is dominated by the thermal expansion of the sample from 80°C to the cure \ntemperature. The volume data are presented alongside the corresponding degree of \nconversion, and the gelation region is indicated.   The difference between the final \nspecific volumes of vitrified samples cured at the two different temperatures indicates \nthat the overall volume reduction in a sample depends strongly on the exact thermal \nhistory of that sample.  Figure 9 shows that the chemical shrinkage is a linear function \nof the degree of conversion, in this particular resin, implying that the resin shrinkage \ncoefficient is constant throughout the cure.  \n \n4. SIMULATIONS FOR NON-ISOTHERMAL CURES \nThe results of the experimental part of this study establish that both the chemical \nshrinkage of the resin and its coefficient of thermal expansion in the glassy state above \nconversion levels of 0.68 depend linearly on the degree of cure. The assumption that the \nCTE is linearly dependent on the degree of cure in the liquid and rubbery states enables \nthe experimental data reported previously to be translated to a model for volume \nchanges, based on the following relationship:  \n \n⎟⎠\n⎞⎜⎝\n⎛ ⋅−⋅⋅=\ndt\nd\ndt\ndTV\ndt\nVd\nv\nαγαˆˆ         Eq.7 \n \nWhere Vˆ is the specific volume, vα  is the volumetric coefficient of thermal expansion \n(VCTE) and γ  is the (constant) resin shrinkage coefficient with respect to the degree of \ncure.  \nUse of the discrete form of Eq. 7 yields  \n \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \nαγα ∆⋅−∆⋅+=\n−\nT\nV\nV\nv\ni\ni 1\n1          Eq. 8 \n \nwhere iV  and 1−iV  denote the specific volume at times it  and 1−it  respectively; T∆  and \nα∆  denote the change in temperature and conversion respectively, from 1−it  to it .  \nThe simulation used to model volumetric changes operates incrementally as suggested \nby Eq. 8.  In each time step the change in conversion is calculated using the kinetic \nmodel described by Eqs. 1-5. Then a comparison is made between the actual \ntemperature of the material and the instantaneous glass transition temperature in order to  \ndetermine whether the resin is in the rubbery or glassy state, and the appropriate \ncoefficient of thermal expansion is input in Eq. 8. A schematic diagram of the algorithm \nused is given in Fig. 10.  \n \nThe model was used to simulate the volumetric changes expected during two typical \nnon-isothermal cure cycles; in the first cure the resin is expected to vitrify during the \nisothermal dwell, while in the second the resin is expected not to reach vitrification \nbefore being cooled down. The results are illustrated in Fig 11. \n \nDuring the heating ramp stage, resin expansion occurs as the result of two opposing \neffects: thermal expansion and the early stages of chemical shrinkage. In the isothermal \nstage chemical shrinkage is the only active phenomenon. In this stage the rate of change \nof specific volume reflects the rate of the reaction, and therefore becomes low towards \nthe end. Under the conditions represented in Fig.11a, the resin vitrified prior to cooling \nand thus the specific volume against cure time plot in that stage is a straight line \ncorresponding to simple contraction of the glassy thermoset. In Fig.11b, the passage of \nthe non-vitrified resin through its Tg, as it cooled down is indicated by the intersection \nof the dotted lines.  \n \n5 CONCLUSIONS \nThe modelling methodology outlined here appears to be an appropriate way to account \nfor the volumetric changes occurring during the cure of a thermosetting resin.  As a next \nstep, such methodology can be integrated within more complex simulation tools relating \nto the manufacture of thermosetting composites, such as heat transfer models or residual \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \nstress development simulations 20. Our future publications will provide the necessary \ncomplementary data on the development of the viscoelastic modulus in the curing resin, \nto make the connection between the state of the material and existing models for \nwarpage in composite parts. \n \nACKNOWLEDGEMENTS \nThis work was funded by the EPSRC (GR\/M 89454). Access to the TMA equipment in \nthe laboratories of the CIRA (Italy) and the practical assistance with PVT measurements \nby Dr C Hobbs at the National Physical Laboratory (UK) are gratefully acknowledged. \n \n \nREFERENCES \n \n1 S L Simon, G B McKenna and O Sindt: J  Appl Polym  Sci, 2000, 76, 495-508  \n2 H T Hahn and N J Pagano: J Compos Mater , 1975, 9, 91- 104 \n3 B Yates, B A McCalla, L N Phillips, D M Kingston-Lee and K F Rogers : J \nMater Sci, 1979, 14, 1207-1217 \n4 E Haque and C D Armeniades: Polym Eng Sci , 1986, 26, 1524-1530 \n5 M Kinkelaar and L J Lee: J Appl Polym Sci, 1992, 45, 37 - 42 \n6 C B Bucknall , I K Partridge and M J Phillips, Polymer,  1991, 32, pp. 636- 640 \n7 Y K Kim and S R White: Mechanics of Composite Materials and Structures, \n1998, 5, 2-16. \n8 T A Bogetti and J W Gillespie Jr. : J Compos Mater, 1992, 26\/5, 626-660. \n9 S R White and H T Hahn : J Compos Mater, 1993, 27\/14, 698-711. \n10 D J O`Brien, P T Mather and S R White : J Compos Mater, 2001, 35\/16, 883-\n902 \n11 U Bandara:  J  Thermal Anal, 1986, 31, 1063 -1071 \n12 P I Karkanas and I K Partridge: J Appl Polym Sci, 2000, 77, 1419-1431 \n13 M  Mitchell: ‘An introduction to genetic algorithms’, 1998, MIT Press, US \n14 L E Nielsen: J Macromol Sci, Revs Macromol Chem, 1969, 3, 69  \n15 J B Enns and J K Gillham: Adv Chem Ser, 1983, 203, 27 - 38    \n16 P Pang and J K Gillham: J Appl Polym Sci, 1990, 39, 909 -  915 \n17 P I Karkanas and I K Partridge : J Appl Polym Sci, 2000, 77, 2178-2188 \n18 H H Winter : Polym Eng Sci, 1987, 27, 1698-1702. \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \n19 C B Hobbs and C S Brown : NPL report CMMT(A) 163, February 1999 \n20 P Prasatya, G B McKenna and S L Simon : J Compos Mater, 2001, 35, 826-847. \n \n  \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \n0\n0.01\n0.02\n0.03\n0.04\n0.05\n0.06\n0.07\n0 100 200 300 400\nTime (min)\nHe\nat \nFl\now\n (W\n\/g)\n80\n90\n100\n110\n120\n130\n140\n150\nTe\nmp\ner\natu\nre\n (°\nC)Heat Flow\nTemperature\n \n(a) \n (b) \n-0.8\n-0.4\n0\n0.4\n0.8\n1.2\n0 70 140 210 280 350\nTemperature (°C)\nHe\nat\n F\nlo\nw\n (\nW\n\/g\n)\nBandara Baseline\nHeat Flow W\/g\n \nFigure 1 Raw data from DSC measurements carried out under (a) isothermal (140°C \nand (b) dynamic heating conditions (20 K min−1 ). Bandara baseline (lower \ncurve) applied 11 \n \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \nTable 1. Thermal analysis data for partially cured resin plates \n \nPlate Tg (°C) \nResidual heat of \nreaction (kJ\/mol) \nDegree of cure Glass CTE ( 10-6  K−1 ))  \nA 104 ± 5 132 ± 3 0.68 105 \nB 133 ± 3 83 ± 3 0.80 79 \nC 151 ± 3 54 ± 3 0.87 76 \nD    165 ± 3 43 ± 2 0.90 68 \nE 182± 2 18 ± 1 0.96 49 \n \n \nTable 2. Parameters for the cure kinetics model \n \nA1 \n(s-1) \nA2 \n(s-1) \nAd \n(s-1) \nE1 \n(kJ\/mol) \nE2 \n(kJ\/mol) \nEd \n(kJ\/mol)\nn1 n2 m b \n2.51E+ 5 1.72E3 2.6E23 78.99 50.25 126.0 0.813 2.361 0.581 0.302 \n \n \n0.00\n0.25\n0.50\n0.75\n1.00\n0 100 200 300 400 500 600\nTime (min)\nD\neg\nre\ne \nof\n C\non\nve\nrs\nio\nn\n Fitting 180 °C - Exp\n160 °C - Exp 140 °C - Exp\n120 °C - Exp\n \nFig. 2a. Comparison between experimental data from DSC and predictions of the cure kinetics \nmodel (solid lines) for isothermal cure conditions. \n \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \n0.00\n0.20\n0.40\n0.60\n0.80\n1.00\n50 100 150 200 250 300 350\nTemperature (°C)\nD\neg\nre\ne \nof\n C\non\nve\nrs\nio\nn\n20 °Cmin -Exp\n15 °Cmin -Exp\n10 °Cmin -Exp\n7.5 °Cmin - Exp\n5 °Cmin -Exp\n2 °Cmin - Exp\n1 °Cmin -Exp\nFittingD\neg\nre\ne \nof\n C\non\nve\nrs\nio\nn\n \nFig. 2b. Comparison between experimental data from DSC and predictions of the cure kinetics \nmodel (solid lines) for dynamic cure conditions. (○)-1 oC\/min, (■)-2 oC\/min, (U)-5 oC\/min,  (◊)-\n7.5 oC\/min, (▲)-10 oC\/min, (□)-15 oC\/min,  ( )-20 oC\/min,  (▬)-Fitting  \n-20\n60\n140\n220\n0 0.2 0.4 0.6 0.8 1\nDegree of Conversion\nG\nla\nss\n T\nra\nns\niti\non\n T\nem\npe\nra\ntu\nre\n (°\nC\n) Fitting Tg EXP\n \nFig. 3. Glass transition temperature versus conversion. Experimental data (EXP) and model fit. \n \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \n0.E+00\n1.E+04\n2.E+04\n3.E+04\n4.E+04\n0 40 80 120\nTime (min)\nE\nla\nst\nic\n a\nnd\n V\nis\nco\nus\n M\nod\nul\nus\n [P\na]\nElastic Modulus G' Viscous Modulus G''\nG\n’ a\nnd\n G\n’’ \n(P\na)\nE\nla\nst\nic\n a\nnd\n V\nis\nco\nus\n M\nod\nul\nus\n [P\na]\nE\nla\nst\nic\n a\nnd\n V\nis\nco\nus\n M\nod\nul\nus\n [P\na]\nG\n’ a\nnd\n G\n’’ \n(P\na)\n \nFig. 4 Determination of time to gelation during 140°C isothermal cure. (○)-Storage modulus, \n(◊)-Loss modulus \n \n0.0\n2.0\n4.0\n6.0\n8.0\n2.200E-03 2.350E-03 2.500E-03 2.650E-03\n1\/T (1\/K)\nln\n (g\nel\n ti\nm\ne)\n (m\nin\n)\n \nFig. 5. Plot of the natural logarithm of the gelation time vs. inverse of absolute temperature. \n \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \n \nFig. 6  Linear displacement versus temperature at various degrees of cure, determined by TMA. \n \n \n0\n40\n80\n120\n160\n0.6 0.7 0.8 0.9 1\nDegree of Conversion\nC\noe\nff.\n o\nf T\nhe\nrm\nal\n E\nxp\nan\nsi\non\n x\n 1\n0e\n-6\n (1\n\/°\nC\n)\n \n \nFig. 7 Coefficient of thermal expansion versus conversion in the glassy state \n \n \n-100\n0\n100\n200\n300\n20 70 120 170 220 270 320\nTemperature (°C)\nD\nim\nen\nsi\non\nal\n V\nar\nia\ntio\nn \n(\nm\n)\n0.68 \n0.80 \n0.87\nFully Cured\nGlassy CTE of fully \n'cured' resin\n(µ\nm\n)\nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \n0.775\n0.795\n0.815\n0.835\n0.855\n0 50 100 150 200 250 300 350 400\nTime (min)\nSp\nec\nifi\nc \nV\nol\num\ne \n(c\nm\n^3\n\/g\n)\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\nD\neg\nre\ne \nof\n C\non\nve\nrs\nio\nn\ngelation region\n(c\nm\n3 \/g\n)\n \nFig. 8  Specific volume and fractional conversion versus cure time, for 140°C and 160°C \nisothermal cures. (○) - Specific Volume at 160°C, (□) - Specific Volume at 140°C(●) - Degree \nof Conversion at 160°C, (■) – Degree of Conversion at 140°C \n \n \nFig. 9 Chemical shrinkage vs. degree of conversion for PVT test at 140°C and 160°C \n0\n1\n2\n3\n4\n5\n6\n0 0.2 0.4 0.6 0.8 1\nDegree of Conversion\n C\nhe\nm\nic\nal\n S\nhr\nin\nka\nge\n % gelation region\nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig. 10 Schematic representation of the algorithm. \nTemperature Profile:                T  = T(t) \nInitial Conversion:                    α0 \nTotal Specific Shrinkage:         Vf \nTi,  ti \nGlass Transition Model  Æ  Tg(αi) \n \nKinetic Model Æ    αi \n∆Vi = Vi – Vi-1 = 3 * CTE * (Ti – Ti-1) + Vf  * (αi - αi-1) \nVi=∆Vi  + Vi-1 \nTi+1 < Tf \n \nGlass Transition Temperature Profile:       Tg = Tg (t) \n \nSpecific Volume Profile:                            V = V(t) \n \nFractional Conversion Profile:                    α = α(t) \n \nCoef. of  Therm. Exp. (glass-rubber):           CTE=CTE(t)\n \nIf  Ti   >  Tg then    CTE = frubber  ( αi ) \n \n \n \nIf  Ti   <  Tg then    CTE = fglass  ( αi ) \n \n \n \nIf  Ti   =  Tg          then      CTE = [ frubber (αi)+ fglass (αi)] \/2 \nPlastics, Rubber and Composites Processing and Applications 31(2002). 377-384 \n \n0 100 200 300 400 500 600 700\n0\n50\n100\n150\nTe\nm\npe\nra\ntu\nre\n P\nro\nfil\ne \n(°\nC\n)\n0.77\n0.78\n0.79\n0.8\n0.81\n0.82\n0.83\n0.84\n0.85\nS\npe\nci\nfic\n V\nol\num\ne \nP\nro\nfil\ne\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\nD\neg\nre\ne \nof\n C\non\nve\nrs\nio\nn \nP\nro\nfil\ne\n-100\n0\n100\n200\nG\nla\nss\n T\nra\nns\niti\non\n T\nem\npe\nra\ntu\nre\n (°\nC\n)\nTime (min)\n o Temperature          x Glass Transition\n + Conversion            *  Specific Volume\n \n (a)  \n0 100 200 300 400 500 600\n0\n50\n100\n150\nTe\nm\npe\nra\ntu\nre\n P\nro\nfil\ne \n(°\nC\n)\n0.77\n0.78\n0.79\n0.8\n0.81\n0.82\n0.83\n0.84\n0.85\nS\npe\nci\nfic\n V\nol\num\ne \nP\nro\nfil\ne\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\nD\neg\nre\ne \nof\n C\non\nve\nrs\nio\nn \nP\nro\nfil\ne\n-100\n0\n100\n200\nG\nla\nss\n T\nra\nns\niti\non\n T\nem\npe\nra\ntu\nre\n (°\nC\n)\n \n \n(b) \nFig. 11  Predicted property changes during two simulated representative thermal profiles \n \n \no Temperature           x Glass Transition \n+ Conversion            * Specific Volume \nTime (min)\n"}