{"doi":"10.1364\/JOSAB.21.001889","coreId":"66380","oai":"oai:dro.dur.ac.uk.OAI2:1650","identifiers":["oai:dro.dur.ac.uk.OAI2:1650","10.1364\/JOSAB.21.001889"],"title":"Holographic generation of microtrap arrays for single atoms by use of a programmable phase modulator.","authors":["Bergamini, S.","Darquié, B.","Jones, M.","Jacubowiez, L.","Browaeys, A.","Grangier, P."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-11","abstract":"We have generated multiple micrometer-sized optical dipole traps for neutral atoms using holographic techniques with a programmable liquid-crystal spatial light modulator. The setup allows storing of a single atom per trap and addressing and manipulation of individual trapping sites. \\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66380.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1650\/1\/1650.pdf","pdfHashValue":"102e74d24ee0b41c0088d73ba4f1986eacb2fe2c","publisher":"Optical Society of America","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1650<\/identifier><datestamp>\n      2010-11-10T12:57:33Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Holographic generation of microtrap arrays for single atoms by use of a programmable phase modulator.<\/dc:title><dc:creator>\n        Bergamini, S.<\/dc:creator><dc:creator>\n        Darquié, B.<\/dc:creator><dc:creator>\n        Jones, M.<\/dc:creator><dc:creator>\n        Jacubowiez, L.<\/dc:creator><dc:creator>\n        Browaeys, A.<\/dc:creator><dc:creator>\n        Grangier, P.<\/dc:creator><dc:description>\n        We have generated multiple micrometer-sized optical dipole traps for neutral atoms using holographic techniques with a programmable liquid-crystal spatial light modulator. The setup allows storing of a single atom per trap and addressing and manipulation of individual trapping sites. \\ud\n<\/dc:description><dc:subject>\n        Trapping<\/dc:subject><dc:subject>\n         Computer holography.<\/dc:subject><dc:publisher>\n        Optical Society of America<\/dc:publisher><dc:source>\n        Journal of the Optical Society of America B : optical physics, 2004, Vol.21(11), pp.1889-1894 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2004-11<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1650<\/dc:identifier><dc:identifier>\n        issn:0740-3224<\/dc:identifier><dc:identifier>\n        issn: 1520-8540<\/dc:identifier><dc:identifier>\n        doi:10.1364\/JOSAB.21.001889<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1650\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1364\/JOSAB.21.001889<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1650\/1\/1650.pdf<\/dc:identifier><dc:rights>\n        © Copyright 2004 Optical Society of America.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1520-8540","issn:0740-3224"," 1520-8540","0740-3224"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["Trapping","Computer holography."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n10 November 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBergamini, S. and Darqui, B. and Jones, M. and Jacubowiez, L. and Browaeys, A. and Grangier, P. (2004)\n’Holographic generation of microtrap arrays for single atoms by use of a programmable phase modulator.’,\nJournal of the Optical Society of America B : optical physics., 21 (11). pp. 1889-1894.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1364\/JOSAB.21.001889\nPublisher’s copyright statement:\nCopyright 2004 Optical Society of America.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nHolographic generation of microtrap arrays\nfor single atoms by use\nof a programmable phase modulator\nSilvia Bergamini, Benoiˆt Darquie´, Matthew Jones, Lionel Jacubowiez, Antoine Browaeys,\nand Philippe Grangier\nLaboratoire Charles Fabry de l’Institut d’Optique, Centre Universitaire, Baˆtiment 503, F-91403 Orsay, France\nReceived February 2, 2004; revised manuscript received June 4, 2004; accepted June 29, 2004\nWe have generated multiple micrometer-sized optical dipole traps for neutral atoms using holographic tech-\nniques with a programmable liquid-crystal spatial light modulator. The setup allows storing of a single atom\nper trap and addressing and manipulation of individual trapping sites. © 2004 Optical Society of America\nOCIS codes: 020.7010, 140.7010, 090.1760, 090.2890.\n1. INTRODUCTION\nIn the search for a suitable system for quantum informa-\ntion processing, certain requirements must be met,1 such\nas scalability of the physical system, the capability of ini-\ntializing and reading out the qubits, and the possibility of\nhaving a set of universal logic gates. Neutral atoms are\none of the most promising candidates for storing and pro-\ncessing quantum information. A qubit can be encoded in\nthe internal or motional state of an atom, and several qu-\nbits can be entangled using atom–light interactions or\natom–atom interactions. Schemes for quantum gates for\nneutral atoms have been theoretically proposed that rely\non dipole–dipole interactions2–5 or controlled collisions.6–9\nSuch schemes can be implemented in optical lattices with\na controlled filling factor, as shown in Ref. 10, where mul-\ntiparticle entanglement by means of controlled collisions\nwas demonstrated.\nCurrently a major challenge is to combine controlled\ncollisions with the loading and addressing of individually\ntrapped atoms. Techniques to confine single atoms in\nmicrometer-sized11–13 or larger14 dipole traps have been\nexperimentally demonstrated. A set of qubits can be ob-\ntained by creating an array of such dipole traps, each\nstoring a single atom.15 Gate operations require the ad-\ndressability of individual trapping sites and reconfig-\nurability of the array. An array of dipole traps can be ob-\ntained by focusing a laser beam into a magneto-optic trap\n(MOT) with an array of microlenses, as demonstrated in\nRef. 16, where each trap could be addressed individually\nbut where each trapping spot still contained many atoms.\nAn alternative method to generate an array of small di-\npole traps is the use of holographic techniques. Holo-\ngraphic optical tweezers use a computer-designed diffrac-\ntive optical element to split a single collimated beam into\nseveral beams, which are then focused by a high numeri-\ncal aperture lens into an array of tweezers. Recently ho-\nlographic optical tweezers were implemented by use of\ncomputer-driven liquid-crystal spatial light modulators\n(SLMs).17 The advantage of these systems is that the ho-\nlograms that correspond to various arrays of traps can be\ndesigned, calculated, and optimized on a computer. Then\nthe traps can be controlled and reconfigured by writing\nthese holograms on a SLM in real time. For example,\neach site can be moved and switched on and off indepen-\ndently from the others.\nHere we present an experimental demonstration of the\ngeneration of multitrap arrays for single atoms. We use\na SLM to control the optical potential of each trap and the\ngeometry of the array, and our system allows each single-\natom site to be addressed. This should open an avenue\nfor qubit initialization and readout.\n2. SPATIAL LIGHT MODULATOR\nWe used a Hamamatsu programmable phase modulator,\nPPM X7550, which includes a parallel-aligned (PAL) nem-\natic liquid-crystal SLM. The SLM behaves as a mirror\nthat can be used to encode a two-dimensional phase pat-\ntern on the reflected beam, thus acting as a phase grating\nthat diffracts light. A prescribed amount of phase shift\ncan be imposed by varying the local optical path length,\nwhich can be accomplished by controlling the local orien-\ntation of molecules in a layer of PAL nematic liquid crys-\ntals.\nThe structure of the device is described in Fig. 1. The\nPAL SLM module consists of a liquid-crystal layer depos-\nited on a dielectric mirror. Behind the mirror there is an\namorphous silicon photoconductive layer. This structure\nis sandwiched between two transparent electrodes. The\norientation of the liquid-crystal molecules is determined\nby the electric field, which is controlled locally by chang-\ning the impedance of the photoconductive layer by use of a\nwrite beam, as shown in Fig. 1. The write beam is inten-\nsity modulated with a 480 \u0002 480 pixel liquid-crystal de-\nvice (LCD). We controlled each pixel individually by us-\ning a video graphics array (VGA) signal from a computer.\nThe total active area of the SLM is 20mm \u0002 20mm. We\nnote that since the readout light is completely separated\nfrom the LCD, diffraction effects that are due to the pix-\nellized structure almost vanish, and the optical quality\ncan be very high.\nBergamini et al. Vol. 21, No. 11 \/November 2004 \/J. Opt. Soc. Am. B 1889\n0740-3224\/2004\/111889-06$15.00 © 2004 Optical Society of America\nWe measured the optical properties of the PAL SLM by\nusing a Zygo phase-shift interferometer operating at 633\nnm. When the SLM is switched off, the reflectivity is\ngreater than 90%, and the wave-front distortion is 0.6\u0002\npeak to peak over the whole surface and better than 0.1\u0002\nover an active area of side of 5 mm. We determined that\nthe phase can be modulated between 0 and 2.1 \u0003. For a\ngiven optical path length the phase shift is inversely pro-\nportional to the wavelength, so at our operating wave-\nlength of 810 nm the maximum phase shift is reduced to\n1.65 \u0003.\n3. HOLOGRAM GENERATION\nWe calculated the holograms by using an iterative fast\nFourier transform algorithm, which exploits a numerical\nmethod to calculate the optimal phase modulation of the\nincident laser beam to obtain the desired intensity profile\nat the imaging plane.18,19 This algorithm works in the\ncase of phase-only holograms. We consider only regular\narrays of optical traps, but the algorithm could be ex-\ntended to more complicated structures with no lattice\nsymmetries.\nThe basic idea is to find the relation between the inten-\nsity profile at the focal plane of the focusing objective that\nwe want to obtain and the necessary phase modulation at\nthe input plane. The wave front at the focal plane can be\nwritten as\nEf\u0004\u0002\u0005 \u0003 E0\nf \u0004\u0002\u0005exp\u0006i\u0007 f\u0004\u0002\u0005\b, (1)\nand If(\u0002) \u0003 \u0002Ef(\u0002)\u00022 is the intensity profile that we want\nto obtain. The wave front at the entrance pupil of the fo-\ncusing objective is\nE in\u0004r\u0005 \u0003 E0\nin\u0004r\u0005exp\u0006i\u0007 in\u0004r\u0005\b, (2)\nwhere \u0007 in is the phase profile imposed by the hologram,\nwhich is the pattern we want to calculate. The input\nwave front can be written as the inverse Fourier trans-\nform of the wave front at the focusing plane:\nE0\nin\u0004r\u0005exp\u0006i\u0007 in\u0004r\u0005\b \u0003 F\u00041\tEf\u0004\u0002\u0005\n. (3)\nWe start by designing the array of traps we want to ob-\ntain in the focal plane as an array of Dirac delta func-\ntions, and we obtain E0\nf (\u0002) by convoluting the array with\nan Airy pattern linked to the entrance pupil of the optical\nsystem. The algorithm is initialized by a guess of the\nphase distribution, which is used to calculate a pattern\nfor the phase modulation of the input wave \u000b1\nin , as shown\nin the following diagram. Amplitude E0\nin is chosen equal\nto one, as we do not change the amplitude of the input\nbeam by modulating the phase only.\nFollowing the above diagram, we can calculate the image\non the focusing plane corresponding to this phase modu-\nlation at the input plane by Fourier transformation. The\nresult will of course differ from the desired pattern. At\nthis point we reduced the difference by multiplying the\nsolution found by the desired pattern, E0\nf (\u0002). After nor-\nmalizing this product (k being a constant to normalize the\nfield amplitude), we took the inverse Fourier transform of\nthe latter and we extracted a phase pattern for the input\nbeam that is closer to the one required. Then the cycle\nwas repeated. This kind of algorithm converges within\nthree to four iterations.18,19\nAs examples of calculated holograms, Fig. 2 (left) shows\nthe phase profile of the input wave used to obtain an ar-\nray of three dipole traps in a row separated by 5 \fm at the\nfocusing plane of the objective. Figure 2 (right) shows\nthe hologram calculated for obtaining an array of five di-\npole traps. These holograms were used to generate the\ntrap arrays that will be presented in the following sec-\ntions; see Fig. 6. These patterns are transmitted to the\nSLM by a standard VGA card. The different gray levels\ncorrespond to different phase shifts, with black and white\ngiving a phase shift of \u0004\u0003 to \u0003. We calculated the phase\nmodulation, taking into account the size of the beam that\nilluminates the PAL SLM, so the modulated area in Fig. 2\ncorresponds to the size of the beam at the SLM position.\nTherefore only a fraction of the total area of the PAL SLM\nis active for phase modulation.\nOnce the hologram is calculated, it can be modified by\nchanging several parameters: the modulation area of the\nSLM can be reduced, increased, or translated to optimize\na match with the beam’s size and position, and the modu-\nlation amplitude can be varied for optimal diffraction ef-\nficiency.\n4. DIPOLE TRAP EXPERIMENT\nOur apparatus, described in Refs. 11–13, consists of a\nstrongly focused dipole trap loaded from a MOT for ru-\nFig. 1. Scheme of the SLM module X7550. The surface of the\nPAL SLM is 20 mm \u0002 20 mm. The LCD is composed of 480\n\u0002 480 pixels and is controlled by a VGA signal.\nFig. 2. Examples of two holograms calculated to generate an ar-\nray of three dipole traps (left) and five traps in a cross configura-\ntion (right). The different gray levels correspond to different\nphase shifts, with black and white giving a phase shift of \u0004\u0003 to\n\u0005\u0003. For both holograms the separation between the traps in\nthe focal plane of the objective is 5 \fm and the pupil size is 5 mm.\n1890 J. Opt. Soc. Am. B\/Vol. 21, No. 11 \/November 2004 Bergamini et al.\nbidium atoms. The MOT is loaded from an atomic beam,\nslowed down by chirped cooling. The dipole trap beam is\nfocused by an objective placed inside the vacuum chamber\n(Fig. 3), with a numerical aperture of 0.7. This gives a\nmeasured beam waist of 0.9 \fm, which is close to the dif-\nfraction limit.12 The effective focal length is 3.55 mm.\nThis focused beam provides a tightly confined trapping\npotential at the center of the intersection region of the\nMOT beams. With a relatively small laser power of 10\nmW, very high intensities can be reached at the focusing\nposition (1000 kW cm\u00042). The dipole trap is operated in\nthe far-detuned regime, the laser wavelength being 810\nnm, to be compared with the rubidium atomic transitions\nD1 at 795 nm and D2 at 780 nm.\nWe detected the trapped atoms by using the fluores-\ncence induced by the MOT beams at 780 nm. The fluo-\nrescence is collected by the same objective that focuses\nthe dipole beam, and the detection system gives a magni-\nfied image of the trap on a charge-coupled device (CCD)\ncamera, as shown in Fig. 3. A size of 1 \fm on the focus-\ning plane of the objective is imaged on 1 pixel of the CCD\ncamera. The integration time is 200 ms.\nThe dipole trap can be operated in several loading\nregimes.11,13 The loading rate of the dipole trap is pro-\nportional to the density of the MOT, which can be varied\nover several orders of magnitude by changing the inten-\nsity of the magnetic field gradient and the intensity of the\nslowing beams. When the MOT density is small (weak-\nloading regime) the lifetime of the atoms in the dipole\ntrap is determined mainly by one-body decay that is due\nto collisions with the background gas. If the loading rate\nis increased, because of the small trapping volume, there\nis a range of loading rates for which two-body collisions\nbecome the dominant term, allowing only one atom at a\ntime to be stored in the trap. If a second atom enters the\ntrap, a collision occurs and both atoms are ejected, as\nshown in Ref. 11. This collisional blockade mechanism\noperates only for very small trapping beam waists, typi-\ncally less than 4 \fm.11 When the MOT density is high,\nthe loading rate is so high that the average number of at-\noms in the trap can reach typically 30 (strong loading re-\ngime).\nThe dipole trap beam is produced by an 810-nm laser\ndiode and brought to the experiment by use of an optical\nfiber, and the PAL SLM module is placed in the path of\nthe dipole beam, as shown in Fig. 4. The beam waist at\nthe SLM position was measured to be 2.3 mm, so that an\narea of \u000315 mm2 of the SLM was illuminated. The\npower of the incident beam varied depending on the num-\nber of traps and trap depth that we wanted to obtain.\nThe SLM can withstand laser intensities of up to 200\nmW\/cm2. To maximize the diffraction efficiency the inci-\ndent beam must be linearly polarized along the zero volt-\nage direction of the molecules, which was ensured by plac-\ning a \u0002\/2 plate in front of the SLM.\n5. EXPERIMENTAL RESULTS\nHere we show how arrays of traps with different geom-\netries were created by sending holograms to the SLM.\nFor simple geometries of the trap array, we can com-\npletely extinguish the trap corresponding to the zeroth-\norder diffraction spot. We also prove that we can control\nthe position of the traps with micrometer precision. Fi-\nnally, we used a simple array geometry to confine single\natoms at distinct trapping sites.\nA. Tests with Different Geometries\nDifferent holograms were calculated with the iterative\nfast Fourier transform algorithm described in Section 3.\nEach calculated hologram was optimized with an auxil-\niary lens, with a focal length of 160 mm, focusing the gen-\nerated pattern on a standard CCD camera (see Fig. 4).\nAs an example, the intensity profile of a three-spot ar-\nray is shown in Fig. 5. The three-dimensional plot shows\nthat the three spots have equal intensity. By adjusting\nthe hologram, as explained in Section 3, we can optimize\nthe symmetry of the intensity profile, remove higher-\norder diffraction spots, and control the zeroth order.\nFig. 3. Experimental setup (without the SLM device). The fo-\ncusing objective (inside the vacuum chamber) generates the di-\npole trap at the MOT position. An imaging system collects the\nfluorescent light from the trapped atoms and sends it to a CCD\ncamera.\nFig. 4. Experimental setup for phase modulation of the dipole\ntrap beam. The removable mirror placed in the beam path is\nused to send light to an imaging camera that records the geom-\netry and shape of the generated pattern.\nFig. 5. Two-dimensional and three-dimensional plots of the in-\ntensity profile generated by a three-spot hologram. The image\nwas captured by focusing the diffracted beams onto a CCD cam-\nera by use of an auxiliary lens with 160-mm focal length.\nBergamini et al. Vol. 21, No. 11 \/November 2004 \/J. Opt. Soc. Am. B 1891\nThe light was then sent to the atomic sample. We\nmonitored the resulting fluorescence pattern and fine\ntuned the hologram to obtain the desired trapping con-\nfiguration. The resulting fluorescence pattern from the\ntrapped atoms for four different holograms is shown in\nFig. 6. For these pictures we worked in the strong load-\ning regime, and so each trap contains a few tens of atoms.\nFigure 6 (left) shows two traps generated symmetrically\nwith respect to the zeroth order, which has been sup-\npressed completely. The second and third panels of Fig. 6\nshow arrays of three dipole traps obtained by use of the\nphase modulation pattern shown in Fig. 2 (left), rotated\nby either 0° or 90° in the SLM plane. Finally five traps\nwere generated by use of the hologram in Fig. 2 (right).\nThe limited total laser power available did not allow us to\ntest structures with a larger number of traps, but we have\nsuccessfully calculated holograms with 3 \u0002 3 symmetric\nspots and hexagonal geometries.\nWe limited our tests to two-dimensional geometries,\nbut three-dimensional configurations are also possible.\nThe focusing plane could be changed by adding a lens to\nthe beam path so that its convergence can be changed.\nThe effect of the lens can be easily reproduced by adding a\nquadratic phase modulation to the existing hologram.\nTherefore, by dynamically changing the computer signal\nsent to the SLM it is possible also to create a three-\ndimensional trap array and to change the geometry and\nthe positions of the traps.20,21\nB. Controlling the Zeroth Order\nOne of the main issues in using an essentially diffractive\noptical element is the zeroth-order diffraction spot. Al-\nthough high diffraction efficiency can be achieved, the re-\nsidual zeroth-order diffraction spot cannot always be eas-\nily controlled for the design of the pattern. Here we show\nthat it is possible either to extinguish the trapping site as-\nsociated with the zeroth-order beam completely or to ex-\nploit it to create arrays of equally intense traps.\nFigure 7 shows the images taken for two and three\ntraps. We note that the two traps are generated sym-\nmetrically with respect to the zeroth-order diffraction\nspot and that the middle trap in the three-trap array is\ngenerated with the zeroth order. We are therefore able to\ntake into account the zeroth order in our calculations and\nto control finely its intensity, so that we can generate ar-\nrays of traps at which the zeroth order is suppressed.\nActually, we exploit the experimental observation that\nthere is a trapping depth threshold, below which the at-\noms cannot be captured. Therefore, the central peak ac-\ntually disappears as soon as the intensity is below the\nthreshold required to capture atoms, even if the trap light\nintensity has not completely vanished. This method pro-\nvides good enough control that we are not limited by the\nzeroth-order diffraction spot for simple geometries.\nC. Varying the Relative Distance\nIt is also possible to control fully the relative position of\nthe trapping sites, either between experiments or dy-\nnamically, just by changing the hologram supplied to the\ndevice as a VGA signal. The lattice constant can there-\nfore be changed as well as its geometry.\nThis is illustrated in Fig. 8, where we show how to con-\ntrol the relative distance of two traps with micrometer ac-\ncuracy. Trap separation \r in one array at the imaging\nplane depends on the periodicity of the phase modulation:\n\r \u0003 \u0004\u0002f\/p \u0005, (4)\nwhere \u0002 is the laser wavelength, f is the focal distance of\nthe objective, and p is the phase modulation period. So\nin the case of simple geometries, where there is a lattice\nstructure, the separation between the traps can be\nchanged by modifying the period of the lattice. Our mea-\nsurements were limited by the magnification of the imag-\ning system for which 1 \fm on the focusing plane is im-\naged on 1 pixel.\nFrom Eq. (4) the minimum change in the trap separa-\ntion is associated with the minimum change in the phase\nmodulation period, which is given by the size of 1 pixel of\nthe SLM (\u000340 \fm). For our present (nonoptimized)\nsetup and for the case of 4-\fm separation in Fig. 8, this\ngives a precision limit of the trap position of 300 nm.\nIn more complicated geometries with many traps, the\nmoving of only one of the traps with respect to the others\ncan be achieved in real time by sending sequences of pre-\ncalculated holograms to the SLM. Dynamic control of\nFig. 6. MOT-induced fluorescence of trapped atoms in dipole\ntrap arrays. The integration time of the CCD was set to 200 ms.\nThe snapshots show the different geometries tested for a total la-\nser power of 40 mW.\nFig. 7. Fluorescent images for two-trap and three-trap arrays,\nshowing control of the zeroth order. The two traps in the top fig-\nures were generated symmetrically with respect to the zeroth-\norder diffraction spot; the middle trap in the bottom figure was\ngenerated from the zeroth order.\nFig. 8. MOT-induced fluorescence of trapped atoms in two di-\npole traps. The integration time of the CCD is 200 ms. The fig-\nures show how the distance could be varied with micrometer ac-\ncuracy by sending a modified signal to the SLM.\n1892 J. Opt. Soc. Am. B\/Vol. 21, No. 11 \/November 2004 Bergamini et al.\nthe trap position is dependent on the response time of the\nSLM itself and on the update rate of the driving VGA sig-\nnal. Currently the refresh rate of available systems with\nnematic crystals (including the Hamamatsu SLM used\nhere) is limited to a few tens of hertz. Higher speed (in\nthe kilohertz range) can be achieved, in principle, with\ncommercial ferroelectric liquid crystals,22 that have a\nlower diffraction efficiency. Therefore the current perfor-\nmance for the moving speed of the traps does not quite al-\nlow fast enough control for gate operations.\nThis limitation can be overcome by use of schemes that\nrely on the combination of an array of (slowly) reconfig-\nurable traps and of a fast moving head, which can be re-\nalized with a laser beam driven by two-dimensional\nacousto-optic modulators (beam scanners). Such a\nscheme would be a neutral atom analog of the proposal for\nion traps in Ref. 23.\nD. Single Atom Trapping\nFinally, we tested the hologram-generated three-trap con-\nfiguration for single-atom trapping. By decreasing the\ndensity of the atomic cloud it is possible to enter the re-\ngime of loading in which either one or zero atom is\ntrapped per each site. In Fig. 9 (left) a single atom is\ncaptured in one trap and its fluorescence is detected with\na 200-ms integration time. On the right-hand side, two\natoms are simultaneously loaded in two distinct traps.\nThe traps are generated with a laser power of 4 mW for\neach one, which is just above the threshold laser power to\ncapture one atom. Working close to the threshold trap\nintensity minimizes the light shift induced by the trap-\nping beam and therefore maximizes the MOT-induced\nfluorescence signal for a single atom.\nSome considerations can be made about the quality of\nthe traps generated with the hologram. For example, by\ncomparing the threshold laser power for traps generated\nby diffracted beams with the threshold laser power for\ntrapping with a nondiffracted beam and assuming that\nthe trapping threshold depends only on the depth of the\ntrap, we can give a better estimate of the maximum\nbeam-waist enlargement. The trap depth is proportional\nto the laser power and inversely proportional to the\nsquare of the beam waist, so if a change in laser power is\nnecessary to reach the trapping threshold, this can easily\nbe related to a change in beam size. From these consid-\nerations we estimate an upper limit for the waist enlarge-\nment of 15% with respect to a nondiffracted beam, which\nmeans an upper limit for the waist of the diffracted beams\nof just over 1 \fm.\nIn the collisional blockade regime, two-body collisions\nlock the average number of atoms to 0.5.11 This means\nthat in these operating conditions the theoretical prob-\nability of detecting one atom in one of the traps is 0.5.\nThe probability of detecting three atoms being simulta-\nneously stored in three distinct traps therefore drops\ndown to 0.125. Imbalance in the trap depth would fur-\nther reduce this probability. Referring to Fig. 9 (right),\nwe found that the trap that is not lit showed a probability\nof \u00060.5 of storing a single atom, which is probably due to\na shallower trap depth, linked to an asymmetry in the\ngenerated intensity pattern.\n6. CONCLUSION\nWe have demonstrated the possibility of creating multi-\ntrap arrays for single atoms by using a nematic liquid-\ncrystal spatial light modulator. The advantage of using\nsuch a device is that it is fully programmable and com-\nputer controllable: multiple traps can be generated in\ndifferent geometries and the position of the traps can be\ndesigned from the VGA signal sent to the module. Ar-\nrays of traps, each capable of storing a single atom, can be\ndynamically modified, allowing real-time motion of one or\nmore traps with respect to the array.\nThis opens up possibilities for testing the proposed\nschemes for atom–atom entanglement. For example, qu-\nbit encoding on the motional state of an atom in a dipole\ntrap was proposed in Ref. 9. In another scheme8 the qu-\nbit is encoded in the motional state of one atom, which\ncan be trapped in either of two traps with an adjustable\nseparation. Both proposals8,9 were studied for rubidium\nmicrodipole traps for which single-atom storage was ob-\ntained with our setup. According to these proposals\nsingle-qubit operations could be achieved by moving the\ntraps adiabatically and bringing them closer so that tun-\nneling between the two wells is allowed, and two-qubit op-\nerations are achieved by collisions between two atoms\nstored in distinct traps.\nAlternatively, qubits can be encoded in single atoms\ntrapped at different locations by use of the hyperfine\nstructure of the ground state, the initialization and\nsingle-qubit operations being achieved with Raman\npulses. Two-qubit operations then require either con-\ntrolled cold collisions as implemented recently10 or long-\nrange coupling as proposed in Refs. 2 and 3.\nACKNOWLEDGMENTS\nThe authors acknowledge the contribution of Arnaud Pou-\nderous and Michael Scholten to early stages of the experi-\nment. We are indebted to Se´bastien Bouilhol from\nHamamatsu for the loan of the PAL SLM. This research\nis supported by the Information Society Technologies\/\nFuture and Emerging Technologies\/Quantum Information\nProcessing project QGATES (Quantum Gates and El-\nementary Scalable Processors Using Deterministically\nAddressed Atoms) and by the European Research Train-\ning Network QUEST (quantum entangled states of\ntrapped particles).\nFig. 9. MOT-induced fluorescence of single atoms confined in\ndistinct dipole traps of a three-trap array, where the traps are\nseparated by a few micrometers. The two figures show one atom\ncaptured in one of the traps and two atoms being simultaneously\ntrapped in two traps of a three-trap array. The integration time\nof the CCD was set to 200 ms.\nBergamini et al. Vol. 21, No. 11 \/November 2004 \/J. Opt. Soc. Am. B 1893\nREFERENCES\n1. D. P. DiVincenzo, ‘‘The physical implementation of quan-\ntum computation,’’ Fortschr. Phys. 48, 771–783 (2000).\n2. I. E. Protsenko, G. Reymond, N. Schlosser, and P. Grangier,\n‘‘Operation of a quantum phase gate using neutral atoms in\nmicroscopic dipole traps,’’ Phys. Rev. A 65, 052301 (2002).\n3. D. Jaksch, J. I. Cirac, P. Zoller, S. L. Rolston, R. Coˆte`, and\nM. D. Lukin, ‘‘Fast quantum gates for neutral atoms,’’ Phys.\nRev. Lett. 85, 2208–2011 (2000).\n4. G. K. Brennen, I. H. Deutsch, and P. S. Jessen, ‘‘Entangling\ndipole–dipole interactions for quantum logic with neutral\natoms,’’ Phys. Rev. A 61, 062309 (2000).\n5. G. K. Brennen, C. M. Caves, P. S. Jessen, and I. H. Deutsch,\n‘‘Quantum logic gates in optical lattices,’’ Phys. Rev. Lett.\n82, 1060–1063 (1999).\n6. T. Calarco, E. A. Hinds, D. Jaksch, J. Schmiedmayer, J. I.\nCirac, and P. Zoller, ‘‘Quantum gates with neutral atoms:\ncontrolling collisional interactions in time-dependent\ntraps,’’ Phys. Rev. A 61, 022304 (2000).\n7. D. Jaksch, H.-J. Briegel, J. I. Cirac, C. W. Gardiner, and P.\nZoller, ‘‘Entanglement of atoms via cold controlled colli-\nsions,’’ Phys. Rev. Lett. 82, 1975–1978 (1999).\n8. J. Mompart, K. Eckert, W. Ertmer, G. Birkl, and M. Lewen-\nstein, ‘‘Quantum computing with spatially delocalized qu-\nbits,’’ Phys. Rev. Lett. 90, 147901 (2003).\n9. K. Eckert, J. Mompart, X. X. Yi, J. Schliemann, D. Bruss, G.\nBirkl, and M. Lewenstein, ‘‘Quantum computing in optical\nmicrotraps based on the motional states of neutral atoms,’’\nPhys. Rev. A 66, 042317 (2002).\n10. O. Mandel, M. Greiner, A. Widera, T. Rom, T. W. Ha¨nsch,\nand I. Bloch, ‘‘Controlled collisions for multi-particle en-\ntanglement of optically trapped atoms,’’ Nature (London)\n425, 937–940 (2003).\n11. N. Schlosser, G. Reymond, and P. Grangier, ‘‘Collisional\nblockade in microscopic optical dipole traps,’’ Phys. Rev.\nLett. 89, 23005 (2002).\n12. G. Reymond, N. Schlosser, I. Protsenko, and P. Grangier,\n‘‘Single-atom manipulations in a microscopic dipole trap,’’\nPhilos. Trans. R. Soc. London, Ser. A 361, 1527–1536\n(2003).\n13. N. Schlosser, G. Reymond, I. Protsenko, and P. Grangier,\n‘‘Sub-poissonian loading of single atoms in a microscopic di-\npole trap,’’ Nature (London) 411, 1024–1026 (2001).\n14. D. Frese, B. Ueberholz, S. Kuhr, W. Alt, D. Schrader, V. Go-\nmer, and D. Meschede, ‘‘Single atoms in an optical dipole\ntrap: towards a deterministic source of cold atoms,’’ Phys.\nRev. Lett. 85, 3777–3780 (2000).\n15. S. Kuhr, W. Alt, D. Schrader, I. Dotsenko, Y. Miroshny-\nchenko, W. Rosenfeld, M. Khudaverdyan, V. Gomer, A.\nRauschenbeutel, and D. Meschede, ‘‘Coherence properties\nand quantum state transportation in an optical conveyor\nbelt,’’ Phys. Rev. Lett. 91, 213002 (2003).\n16. R. Dumke, M. Volk, T. Mu¨ther, F. B. J. Buchkremer, G.\nBirkl, and W. Ertmer, ‘‘Micro-optical realization of arrays of\nselectively addressable dipole traps: a scalable configura-\ntion for quantum computation with atomic qubits,’’ Phys.\nRev. Lett. 89, 097903 (2002).\n17. D. G. Grier, ‘‘A revolution in optical manipulation,’’ Nature\n(London) 424, 810–816 (2003).\n18. V. A. Soifer, V. V. Kotlyar, and L. L. Doskolovich, Iterative\nMethods for Diffractive Optical Elements Computation\n(Taylor & Francis, London, 1997).\n19. E. R. Dufresne, G. C. Spalding, M. T. Dearing, S. A. Sheets,\nand D. G. Grier, ‘‘Computer-generated holographic\noptical tweezer arrays,’’ Rev. Sci. Instrum. 72, 1810–1816\n(2001).\n20. J. E. Curtis, B. A. Koss, and D. G. Grier, ‘‘Dynamic holo-\ngraphic optical tweezers,’’ Opt. Commun. 207, 169–175\n(2002).\n21. H. Melville, G. F. Milne, G. C. Spalding, W. Sibbett, K.\nDholakia, and D. McGloin, ‘‘Optical trapping of three-\ndimensional structures using dynamic holograms,’’ Opt. Ex-\npress 11, 3562–3567 (2003), http:\/\/www.opticsexpress.org.\n22. W. J. Hossack, E. Theofanidou, J. Crain, K. Heggarty, and\nM. Birch, ‘‘High-speed holographic optical tweezers using a\nferroelectric liquid crystal microdisplay,’’ Opt. Express 11,\n2053–2059 (2003), http:\/\/www.opticsexpress.org.\n23. J. I. Cirac and P. Zoller, ‘‘A scalable quantum computer with\nions in an array of microtraps,’’ Nature (London) 404, 579–\n580 (2000).\n1894 J. Opt. Soc. Am. B\/Vol. 21, No. 11 \/November 2004 Bergamini et al.\n"}