{"doi":"10.1177\/1741143208100296","coreId":"211883","oai":"oai:eprints.lse.ac.uk:23893","identifiers":["oai:eprints.lse.ac.uk:23893","10.1177\/1741143208100296"],"title":"Redistribution and financing schools in England under Labour: are resources going where needs are greatest?","authors":["West, Anne"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-03","abstract":"This article explores the policy changes made by the Labour government to the recurrent funding of school-based education in England, focusing in particular on the allocation of resources to meet the needs of disadvantaged pupils. Expenditure on education and, in particular, on schools has increased since 1997. However, while there have been two major changes to the way in which government allocates resources to local authorities (LAs) and a new requirement for LAs to include a deprivation factor in their funding formulae for schools, the evidence indicates that resources are being allocated to schools in a less redistributive manner than they are being allocated by central government to LAs. To address this issue, the government could require a minimum proportion of funding to be allocated to schools on the basis of disadvantage; however, politically this would be problematic in the absence of additional resources as it would mean cuts being made by LAs elsewhere in the education budget. And whilst there is now some information about the level of funding allocated to meet the needs of disadvantaged pupils, there is a paucity of information about how these resources are actually used within schools","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/211883.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/23893\/1\/West_Redistribution%20and%20financing%20schools%20in%20England%20under%20Labour_2009.pdf","pdfHashValue":"bd1ff39dc8fac21db141d0177d941659e1ff1431","publisher":"Sage Publications in association with British Educational Leadership, Management & Admin Society","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:23893<\/identifier><datestamp>\n      2014-06-11T15:18:27Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5341<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3132<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/23893\/<\/dc:relation><dc:title>\n        Redistribution and financing schools in England under Labour: are resources going where needs are greatest?<\/dc:title><dc:creator>\n        West, Anne<\/dc:creator><dc:subject>\n        HT Communities. Classes. Races<\/dc:subject><dc:subject>\n        LA History of education<\/dc:subject><dc:subject>\n        HJ Public Finance<\/dc:subject><dc:description>\n        This article explores the policy changes made by the Labour government to the recurrent funding of school-based education in England, focusing in particular on the allocation of resources to meet the needs of disadvantaged pupils. Expenditure on education and, in particular, on schools has increased since 1997. However, while there have been two major changes to the way in which government allocates resources to local authorities (LAs) and a new requirement for LAs to include a deprivation factor in their funding formulae for schools, the evidence indicates that resources are being allocated to schools in a less redistributive manner than they are being allocated by central government to LAs. To address this issue, the government could require a minimum proportion of funding to be allocated to schools on the basis of disadvantage; however, politically this would be problematic in the absence of additional resources as it would mean cuts being made by LAs elsewhere in the education budget. And whilst there is now some information about the level of funding allocated to meet the needs of disadvantaged pupils, there is a paucity of information about how these resources are actually used within schools.<\/dc:description><dc:publisher>\n        Sage Publications in association with British Educational Leadership, Management & Admin Society<\/dc:publisher><dc:date>\n        2009-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/23893\/1\/West_Redistribution%20and%20financing%20schools%20in%20England%20under%20Labour_2009.pdf<\/dc:identifier><dc:identifier>\n          West, Anne  (2009) Redistribution and financing schools in England under Labour: are resources going where needs are greatest?  Education Management, Administration and Leadership, 37 (2).  pp. 158-179.  ISSN 1741-1432     <\/dc:identifier><dc:relation>\n        http:\/\/ema.sagepub.com\/<\/dc:relation><dc:relation>\n        10.1177\/1741143208100296<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/23893\/","http:\/\/ema.sagepub.com\/","10.1177\/1741143208100296"],"year":2009,"topics":["HT Communities. Classes. Races","LA History of education","HJ Public Finance"],"subject":["Article","PeerReviewed"],"fullText":"  \nAnne West \nRedistribution and financing schools in \nEngland under Labour: are resources going \nwhere needs are greatest? \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nWest, Anne (2009) Redistribution and financing schools in England under Labour: are resources \ngoing where needs are greatest? Education Management, Administration and Leadership, 37 \n(2). pp. 158-179. ISSN 1741-1432 DOI: 10.1177\/1741143208100296  \n \n© 2009 SAGE Publications \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/23893\/ \nAvailable in LSE Research Online: June 2014 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \n  \n \nForthcoming 2009 \nEducational Management Administration and Leadership  \n \n \n \nRedistribution and financing schools in England under Labour: \nAre resources going where needs are greatest? \n \n \n \nAnne West \n \n \n \n \n \n \n \n \n \n \n \nAddress for correspondence: \nProfessor Anne West \nEducation Research Group  \nDepartment of Social Policy \nLondon School of Economics and Political Science \nHoughton Street \nLondon WC2A 2AE \nEmail: a.west@lse.ac.uk \nTel: 020 7955 7269 \n 2 \nAbstract \nThis paper explores the policy changes made by the Labour government to the recurrent funding of \nschool-based education in England, focusing in particular on the allocation of resources to meet the \nneeds of disadvantaged pupils.  Expenditure on education and, in particular, on schools has \nincreased since 1997.  However, whilst there have been two major changes to the way in which \ngovernment allocates resources to local authorities and a new requirement for local authorities to \ninclude a deprivation factor in their funding formulae for schools, the evidence indicates that \nresources are being allocated to schools in a less redistributive manner than they are being allocated \nby central government to local authorities.  To address this issue, the government could require a \nminimum proportion of funding to be allocated to schools on the basis of disadvantage; however, \npolitically this would be problematic in the absence of additional resources as it would mean cuts \nbeing made by local authorities elsewhere in the education budget. And whilst there is now some \ninformation about the level of funding allocated to meet the needs of disadvantaged pupils, there is \na paucity of information about how these resources are actually used within schools. \n \nKey words: schools, resources, disadvantage, poverty, expenditure  \n 3 \n \n1. Introduction \nSince it was elected into office in 1997, the Labour government in the UK has given a high priority \nto education.  The Labour Party’s 2005 Manifesto reinforced this view: ‘Education is still our \nnumber one priority’ (p. 30).  It also reaffirmed a commitment to tackling the needs of children \nfrom disadvantaged backgrounds: ‘We will continue to recognise the additional needs of \ndisadvantaged pupils’ (p. 33).  On average, children from lower socio-economic backgrounds do \nless well in terms of their educational outcomes than do children from more advantaged \nbackgrounds: in 2004, 33 per cent of young people in England and Wales with parents in ‘routine’ \noccupations gained five of more General Certificate of Secondary Education (GCSE) examination \npasses (or equivalent) at grades starred A (A*) to C in year 11 (age 16) compared with 76 per cent \nof those with parents in higher professional occupations.1  Moreover, only 57 per cent of those with \nparents in ‘routine’ occupations continued in education post-16 compared with 85 per cent of those \nwith parents in higher professional occupations (Department for Education and Skills (DfES), \n2005a).   \n \nThe effects of poverty are stark.  On average, pupils in England who are known to be eligible for \nfree school meals perform less well in national tests and public examinations than those who are not \neligible: for example, in 2005, 20 per cent of children eligible for free school meals obtained five or \nmore GCSE examination passes (or equivalent) including English and mathematics, at grades A* to \nC, compared with 48 per cent of those not eligible (DfES, 2006a).  As noted by the House of \nCommons Select Committee on Education and Skills (2003): ‘It is unarguable from the evidence \npresented to us that poverty is the biggest single indicator of low educational achievement’ (p. 20).   \n \nIn order to compensate for the deleterious effects of disadvantage, the funding of school-based \neducation in England has, for many years, been designed to be redistributive.  However, a number \nof concerns were raised in the 1990s about the rationale for distributing funds from central to local \ngovernment to meet the needs associated with disadvantage (see West et al., 2000a); these included \nthe measures of disadvantage used and the methods employed to calculate how much should be \nallocated to individual local authorities to meet these needs (see also section 3).   \n \nThe Labour government has sought to tackle some of these concerns; it has also altered the way \nfunds are allocated by local authorities to schools, in particular in relation to the targeting of funds \nto meet the needs associated with social deprivation in schools.  In addition, it has introduced a \nnumber of policy initiatives designed to target funds on schools in disadvantaged areas. \n 4 \n \nThis paper draws on a range of sources of evidence – legislation, statistical data, policy documents, \nlocal authority information and research – to review and analyse government policy from 1997 in \nrelation to the funding of schools.  The paper argues that even though there have been two major \nchanges to the way in which the government allocates resources to local authorities; a new \nrequirement for local authorities to include a deprivation factor in their funding formulae for \nschools; and a variety of government grants targeted on disadvantaged areas\/schools, there is a \nconcern that pupils from disadvantaged backgrounds are not benefiting to the extent that they could \nfrom the increased public expenditure on schools.   \n \nThe following section provides an overview of the policy context since 1997.  Section 3 discusses \nthe recent changes that have been made to the allocation of funds by central to local government, \ntogether with the changes made to the distribution of resources by local authorities to schools; it \nthus provides a historical account of the funding regimes, with particular reference to meeting the \nneeds of disadvantaged pupils.  Using information and data from local authority and central \ngovernment sources, the fourth section examines whether resources are reaching schools where the \nlevels of need are greatest.  The final section concludes and discusses possible implications for \nfuture policy. \n2. Policy context and policy change since 1997 \nThe Labour Party committed itself, prior to the election in May 1997, to giving education a high \npriority.  Table 1 shows that in the 1996-97 financial year, education expenditure as a percentage of \nGross Domestic Product (GDP) was 4.7 per cent.  There was no increase in expenditure as a \nproportion of GDP during the early part of the Labour administration on account of adhering to \nConservative spending limits (and also because of the improving economic situation and resulting \nincrease in GDP).  Whilst expenditure as a percentage of GDP fell, by 1998-99 total expenditure in \nreal terms was higher than under the previous Conservative administration.  In 2001-02, the year in \nwhich the Labour government started its second term of office, total expenditure on education \nincreased markedly as did education expenditure as a percentage of GDP, reaching 5.3 per cent in \n2003-04.  Funding per head similarly increased from £614 to £1,004 per head between 1996-97 and \n2003-04 (DfES, 2001, 2005c). \n \n \nTable 1 about here \n \n 5 \nTurning specifically to current expenditure on schools in England, there has been an increase in real \nterms.  Expenditure by central and local government was £20,910 million in 1996-97 and by 2003-\n04 this had increased to £30,630 million; this was an increase of 46 per cent (see Table 2).   \n \nTable 2 about here \n \nThe aim of the Labour government has been to invest in education with the explicit aim of raising \neducational standards.  There is a debate about whether there is an association between higher \nspending and higher test or examination results.  Until recently, much of this research had been \ncarried out in the US where the system of resourcing is very different from that in England; these \nresults were mixed (see Hanushek, 1998), with some studies suggesting a positive association \nbetween resourcing levels and outcomes and some not (see also Glennerster, 2002).  In England, \nadministrative data have been used to examine the relationship between resourcing and outcomes.  \nDifferent studies, using different data and statistical methods, suggest that there is a relationship \nbetween higher expenditure on education and higher national test and\/or public examination results \n(Jenkins et al., 2006; Levačić et al., 2005; Noden et al., 2002; West et al., 2001).  In particular, \nLevačić et al. (2005) using high quality pupil-level data, found statistically significant associations \nbetween expenditure and both mathematics and science attainment in the national tests taken at the \nend of key stage 3 (typically age 14).  Moreover, the gain appeared to be greater for pupils from \npoorer backgrounds.  And Jenkins et al. (2006), also using national pupil-level data, found that at \nGCSE level, there was an association between higher levels of expenditure and higher attainment in \nterms of the GCSE point score and GCSE science; a particularly interesting finding was that for \nGCSE mathematics, there was a statistically significant association between expenditure and \nattainment for the 40 per cent of pupils with the lowest attainment in the key stage 2 national tests \n(taken at the age of 11). \n \nEven though the evidence linking increased funding with higher test and examination results, \nhaving controlled for other factors, is relatively recent, British governments have, over the decades, \nsought policy responses to the deleterious effects of disadvantage on education outcomes.  In the \n1960s and 1970s, in England, Education Priority Areas were designated and schools with high \nproportions of disadvantaged pupils received additional funds in an effort to compensate for the \neffects of poverty (see Sammons, 1999).   \n \nAn initiative with a high political profile, launched soon after the first Labour government was \nelected, was the setting up of statutory Education Action Zones (EAZs) designed to target resources \n 6 \non disadvantaged areas (see National Audit Office (NAO), 2001); EAZs were public-private \npartnerships with the majority of funding coming from the public sector and a minority from the \nprivate sector (NAO, 2001).  However, the initiative did not last long and in 2005 all statutory \nEAZs ended (see also Halpin et al., 2004). \n \nIn 1999, another (longer lasting) policy initiative, Excellence in Cities (EiC), was set up.  This was \nfunded by the government as a separate grant under the Standards Fund, which ‘provides a number \nof funding streams direct from central government to [local education authorities] for a variety of \nclearly defined purposes, mostly linked to particular policy initiatives’ (Simkins, 2004, p. 372).2  \nEiC involved 58 of the 150 local authorities with responsibility for education in England (Kendall et \nal., 2005); these included the 50 most deprived.3  Although focused on disadvantaged areas, EiC \nwas not solely focused on either disadvantaged schools or disadvantaged pupils; of the three main \n‘strands’, one focused on ‘gifted and talented’ pupils; another, ‘learning mentors’, provided support \nto pupils with particular barriers to learning; and the third, ‘learning support units’ aimed to tackle \ndisruption in schools, so that pupils could be withdrawn from the classroom and provided with \nadditional support (Kendall et al., 2005; Simkins, 2004). 4  A further initiative that focused on \ndisadvantaged schools was the Pupil Learning Credits (PLC) pilot scheme (see Braun et al., 2005) \nwhich ran from 2001 to 2003.  This provided more resources to secondary schools, in selected EiC \nareas, with high levels of pupils entitled to free school meals; the aim was for pupils whose social \ncircumstances were particularly difficult to be offered additional learning opportunities.   \n \nInterestingly, in light of the positive relationship between higher levels of funding and higher \nachievement, the findings from the national evaluation of EiC found that the greatest impact of the \npolicy was in relation to attainment in mathematics at the end of key stage 3 (age 14), for pupils in \nthe schools that were the most disadvantaged.  Overall, pupils in schools that received EiC funding \nattained higher levels in mathematics than those in non-EiC schools, having controlled for a variety \nof school and pupil level factors including prior attainment.  ‘This was equivalent to increasing the \npercentage of pupils achieving level 5 or above by between 1.1 and 1.9 percentage points’ (Kendall \net al., 2005, p. 12); moreover, the higher value was observed in schools that became part of EiC in \nthe first year of the programme, many of which were also part of the PLC pilot scheme (see also \nMcNally, 2005).  \n \nA range of other initiatives, some targeted on disadvantaged areas and\/or schools, have been funded \ndirectly by the DfES.  The increase in funding via what was then known as the Standards Fund was \nsignificant (cf Simkins, 2004).  In 1996-97, the last year of the Conservative administration, in real \n 7 \nterms a total of £161 million was allocated by central government for schools via the Standards \nFund; by 2004-5 this had increased to an estimated £1,612 million (DfES, 2005e) – an increase of \nover 900 per cent.  Nevertheless, whilst important, these initiatives accounted for only a very small \nproportion – 5.2 per cent – of central government expenditure on schools.5  The bulk of the funding \nfor schools comes from central government to local authorities.  Local authorities then distribute \nresources to schools.   \n \nThe next section examines the changes that have taken place in the allocation of resources from \ncentral to local government and from local authorities to schools.  The focus, as before, is on the \nredistributive nature of the funding and the targeting of resources to meet pupils’ varying \neducational needs. \n3. Funding local authorities, funding schools \nSince 1997, there have been two major changes in the way central government provides funds for \nschool-based education.  Between 1997 and 2006, local authorities received funding for school-\nbased education via the local government finance system – funded through Revenue Support Grant \n(RSG) 6  from the government department responsible for local government, and locally raised \nCouncil Tax.  On average 75 per cent of the funding for local authority services came from central \ngovernment grants (Office of the Deputy Prime Minister (ODPM), 2005), with the remainder \ncoming from local taxation (council tax). The funding allocation was initially via the Education \nStandard Spending Assessment (SSA) which had been introduced in 1990.  The first major change \nto this system was the introduction of the Education Formula Spending Share (EFSS), which \nreplaced the SSA in 2003-04.   \n \nIt is important to stress that neither the Education SSA nor the EFSS was hypothecated, or \n‘earmarked’, so local authorities were not obliged to spend a specific amount on education.  They \ncould spend above or below the amount indicated by the Education SSA or EFSS.  This led to \ntensions between central and local government as central government could claim that local \nauthorities were not spending enough on education, so ‘passing the buck’ from central to local \ngovernment (or indeed vice versa).  \n \nThe second major change from 2006-07 was the introduction of a ‘ring fenced’ grant for most of \nschool-based education – the Dedicated Schools Grant – which is distributed separately as a grant to \nlocal authorities, by the DfES.  The introduction of the DSG was designed to ensure that increases \n 8 \nin education spending were passed on in full.  From 2006, the bulk of the funding for school-based \neducation was thus no longer via the Revenue Support Grant to local authorities.   \n \nThese changes in the allocation of resources from central to local government and from local \nauthorities to schools are now examined in more detail, with a particular focus on approaches used \nto target funds on disadvantage. \nAllocation of resources to local authorities \nEducation Standard Spending Assessment \nUntil 2003-04, the Revenue Support Grant was distributed via Standard Spending Assessments \n(SSA) (see Audit Commission, 1993).  In the Education SSA there was an element in the funding \nformula for ‘additional educational needs’ (AEN).  Two of the proxy indicators on which the AEN \nindex was based were derived from census data: the proportion of children aged under 18 in private \nhouseholds containing a lone parent family; and an ethnicity indicator (the proportion of children \naged under 16 in private households who were born outside the UK, Ireland, the USA or Old \nCommonwealth, or whose head of household was born outside these areas).  Concerns were raised \nabout the use of these indicators as the census is carried out at 10-yearly intervals, and so is not \nresponsive to short-term demographic change.  In addition, ethnicity per se is not necessarily an \nindicator of ‘need’ – as demonstrated by the varying levels of poverty and examination performance \nof pupils from different minority ethnic groups (see Bhattacharyya et al., 2003).  Lack of fluency in \nEnglish is important, but this was not measured in the AEN index.  The third AEN proxy indicator \n– of poverty – derived from administrative data, related to the  proportion of dependent children of \nincome support recipients.   \n \nThe weighting given to the AEN index as part of the overall Education SSA involved the use of \nmultiple regression and was based to a large extent on the relationship between values of the index \nand past expenditure (DfES, 2003a).  Although it was assumed that past expenditure was an \nindicator of the levels of need within an authority, this assumption was shown to be flawed as other \nfactors are of paramount importance – such as government funding levels; the level of council tax to \nbe levied; pressures from other services (e.g., social services); political considerations; debt \nrepayments and the balances held by the local authority (West et al., 2000b).7   \n \nEducation Formula Spending Share \nIn response to growing concerns about the indicators and methods used to distribute government \nfunds to local authorities, a major funding review took place, and from 2003-04, the system of \n 9 \nfunding local authorities for the provision of school-based education changed.  SSAs were replaced \nwith Formula Spending Shares (FSSs) for each service area for which the local authority was \nresponsible.8  The Education Formula Spending Share (EFSS) was divided into two main funding \n‘blocks’.  One of these was for schools and covered provision for pupils.  The other was to cover \nlocal authorities’ responsibilities for education.  The blocks were further divided into sub-blocks for \npupils of different ages and those with high cost special educational needs.9  All the formulae for \neach sub-block had a basic allocation per ‘client’ (the pupil in the case of school-based education) \ntogether with additional amounts or ‘top-ups’ for deprivation (AEN) (DfES, 2003).10  The approach \nwas informed by research carried out by consultants  PricewaterhouseCoopers, which involved \nestimating, on the basis of empirical research, the additional costs associated with supporting \nchildren with ‘additional educational needs’, namely: \n \n• costs that are directly associated with social deprivation; \n• the cost of supporting children with less severe special educational needs – that is, without \nstatements of special educational needs; and \n• the costs of supporting children for whom English is an additional language (DfES\/HM \nTreasury, 2005, p. 18). \n \nPricewaterhouseCoopers (2002) calculated that the average school costs for pupils with AEN, \ntotalled £1,890; this was made up of staff costs of £1,500 per pupil per year, opportunity costs of \n£320 and a cost for non-staff school resources of £70.  A composite unit cost for pupils who did not \nhave high level SEN was calculated as being £1,780. \n \nThe factors that were used in the primary AEN (which was also the same as that for under 5s) and \nthe secondary AEN index are given in Figure 1. \n \nFigure 1 about here \n \nThe formulae and indicators used changed with the move from the Education SSA to the Education \nFSS.  The measures that were introduced were higher quality than before as a result of pupil level \nadministrative data being collected by individual schools: from January 2002 data on the \ncharacteristics of individual pupils, including known eligibility for free school meals, ethnicity, \npostcode and data on national test results have been collected.  As a result of these new data, \nmeasures derived from the census were no longer used.  In addition, the measures used were all \nmore clearly associated with educational outcomes.  However, the overall amount of funding \n 10 \nallocated via the AEN was broadly similar:11 the percentage allocations under the last year of the \nSSA system and the first year of the FSS system were 19.1 per cent in 2002-03 and 18.8 per cent in \n2003-04 (DfES, 2003a).12  \n \nDedicated Schools Grant \nFurther changes to the funding of school-based education took place in 2006-07 with the \nintroduction of a grant from DfES to local authorities known as the Dedicated Schools Grant \n(DSG).  This is a ring-fenced grant and all the resources must be used for the schools budget. It \nprovides for the same items as had been funded via the Schools FSS. 13  The method used to \ndistribute the DSG for the two year period 2006-07 and 2007-08 is historically based reflecting  \neach authority’s starting position on spending. The starting position will largely reflect \nhistorical allocation of resources through the Schools FSS formula and preceding Education \nSSA formula. One of the main reasons why authorities receive different levels of funding is \ndue to different levels of deprivation: the funding system continues to reflect the fact that \nsome pupils need more support to have the same opportunities (DfES, 2006c, para 45). \nIn terms of seeking to address deprivation, the DfES estimated the funding for this for each local \nauthority by ‘using the proportion of deprivation funding delivered through each authority’s 2005-\n06 Schools FSS allocation to estimate the amount of deprivation funding delivered through DSG \nallocations’ (DfES, 2006c, para 46).  In 2006-07, 10.5 per cent of the funding was allocated on the \nbasis of deprivation (DfES, 2006e).14  The methodology used to determine the DSG is thus based \non local authority expenditure along with the historical FSS and SSA formulae, with, as mentioned, \nthe additional educational needs component being informed by the calculations made by \nPricewaterhouse Coopers (see DfES\/HM Treasury, 2005). \n \nPart of the DSG is a dedicated sum of money for ‘personalised learning’.  This is aimed at \nimproving the achievement levels of children in disadvantaged areas: ‘Personalisation is the key to \ntackling the persistent achievement gaps between different social and ethnic groups.  It means a \ntailored education for every child and young person…’ (DfES, 2005f, p. 50). \n \nPersonalisation is intended to provide intensive support for pupils who are not progressing as well \nas might be expected and is focused on local authorities with the highest numbers of underachieving \nand deprived children.  At the primary stage, personalisation is intended to include the provision of \nextended opportunities outside the school day for children from low income families.  At the \nsecondary level, the funds are aimed at supporting intervention for pupils who are not keeping up in \n 11 \nEnglish and mathematics, provision for gifted and talented pupils and to help children from \ndeprived backgrounds access after school and year round activities (DfES, 2006c).  Funding for \npersonalisation is allocated by the DfES to local authorities15 using a set formula: 15 per cent for \neach pupil of the requisite age group for primary and secondary schools: 35 per cent per pupil \nweighted for deprivation (using as the indicator children in families in receipt of the state benefit \nIncome Support); and 50 per cent per pupil weighted for the proportion of pupils not achieving \nexpected levels in national key stage English and mathematics tests (DfES, 2006c). \nSummary \nThe system used to distribute resources for education to local authorities has changed in recent \nyears.  The Education SSA and the Education FSS which replaced it, were not hypothecated \n(earmarked) so local authorities were not obliged to spend a specific amount on education – they \ncould spend above or below the amount indicated, although they were urged by government to pass \non in full increases in funding (DfES, 2007).  From 2006-07, the government provided an \nearmarked grant, the DSG.  This is a highly significant change: in effect, it guarantees that a \nminimum amount will be spent on education at a local level.  Within the DSG, there is an element \nthat is earmarked (at local authority level), to support the priorities of the DfES.  One such priority \nis the personalisation of learning which is designed to reduce the achievement gaps that exist \nbetween children from different backgrounds and has been allocated by central government using a \nformula driven predominantly by low levels of attainment and poverty. \n \nDistribution of funds to schools by local authorities  \nThe local authority has a key role in relation to financing schools as it sets the budget for education \neach year and distributes funds to schools.  The government provides the bulk of the resources, via \nthe ring-fenced DSG, but local authorities can top this up using resources raised locally via council \ntax.16 \n \nIt is important to stress that local authorities do not run schools, but ‘maintain them by providing \nfunding and have certain specific duties and powers in relation to the school system’ (Wandsworth \nBorough Council, 2005, p. 11).  Schools are ‘semi-autonomous’ (p. 11) and managed and governed \nby their headteachers and governing bodies: this has been the case since the introduction of local \nmanagement of schools following the Education Reform Act 1988.  The approach used to distribute \nfunds to schools changed in April 1999, when the Labour government replaced local management \nof schools with ‘fair funding’ – this was in essence a development of local management of schools \nwith a significant increase in the level of financial delegation to schools.  \n 12 \n \nLocal authority budgets for primary and secondary education are contained in their own ‘local \neducation authority (LEA) budget’ and ‘schools budget’.  The LEA budget provides funds to \nsupport the local authority centrally in four main areas: special educational provision, school \nimprovement, access (planning of school places, admissions, transport etc.) and strategic \nmanagement (see Office of Public Sector Information (OPSI, 2006)).  The ‘schools budget’ is \ndesigned to meet the costs of the actual educational provision for pupils; within this, local \nauthorities are allowed to retain some funding to enable certain education responsibilities to be \nprovided centrally (e.g., in relation to special educational needs, pupil referral units, and early years \nprovision in private, voluntary and independent providers).  The remaining amount is the \n‘individual schools budget’.  This is delegated to schools and managed by school governing bodies. \n \nThe individual schools budget set by the local authority is distributed to schools in the authority \nusing a formula which ‘must take into account pupil numbers’ (OPSI, 2006).  Local authorities are \npermitted to allocate the remainder using factors from a ‘menu’, set out in regulations,  including \nspecial educational needs, pupils for whom English is not their first language, pupil mobility, \ncharacteristics of the school buildings and site, use of energy by schools, salaries at a school (using \nactual or estimated costs), incidence of pupils from ethnic minority groups having below average \nlevels of academic achievement in relation to other pupils in the local authority area, prior \nattainment of pupils entering a school.  \n \nOne notable change made by the Labour government was in relation to the rule that a certain high \npercentage of funding for primary and secondary schools had to be ‘pupil-led’ – in other words \ncarry ‘the same value for all pupils of a certain age whatever school they attend’ (DfES\/Treasury, \n2005, p. 22).  Originally, the pupil-led funding was 80 per cent; this was reduced to 75 per cent in \n2002-03 (OPSI, 2002b).  And from 2006 onwards the 75 per cent ‘pupil-led rule’ was ‘abolished’ \n(DfES\/Treasury, 2005, p. 35; see also OPSI, 2006).  It is also of significance, in theory at any rate, \nthat local authorities have been obliged, since 2002-03 to include a factor in their formulae based on \nthe incidence of social deprivation in their schools (OPSI, 2002b; 2006).  However, there is no \nrequirement as to the minimum proportion or amount to be distributed by such a factor (see also \nsection 4). \n \nIt is important to bear in mind that policy decisions at the level of central government can have an \nimpact on the distribution of resources by local authorities to schools, and as we shall see, the \nminimum funding guarantee, introduced in 2004–05, is of particular significance.  This was brought \n 13 \nin following funding difficulties that were experienced by some schools in 2003–04 (House of \nCommons Hansard, 2004a).  Under the minimum funding guarantee, each school gets a per pupil \nincrease and an increase for fixed costs. \n \nIn summary, the funding of schools by local authorities has changed in recent years.  When local \nmanagement of schools was first introduced, there was a requirement that 80 per cent of the funding \nshould be ‘pupil-led’.  This was reduced to 75 per cent in 2002-03 and the ‘pupil-led’ rule was \nabolished in 2006-07.  In addition, from 2002-03, local authorities have been obliged to include a \nfactor in their formulae based on the incidence of social deprivation in their schools.    \n4. Is local government as redistributive as central government? \nWhilst the policies introduced by the Labour administrations have been designed to be \nredistributive, there are concerns as to whether there is sufficient funding reaching schools to meet \nthe needs of disadvantaged children.  For example, Lupton (2005), in a research study which \nfocused on four secondary schools in highly disadvantaged areas of England concluded that \n‘resources for individual aspects of schooling are simply too low relative to demand’ (p. 601).  She \nargues that current funding mechanisms are based on intake measures that are too crude, and that \nfunding should be based on an assessment of roles and activities needed to meet those needs \n(Lupton, 2004).  Whilst this suggests that there are issues associated with the funding of \ndisadvantaged schools, it is not possible to generalise across the country on the basis of the research.  \nIt does however, raise questions about the funding of schools, and in particular, whether the \ngovernment is allocating enough funding to meet the needs of disadvantaged schools at a local level, \nand whether local authorities are allocating sufficient funding in their funding formulae for schools. \n \nA major DfES-funded study was carried out to examine the costs associated with meeting the needs \nof children with additional educational needs (PricewaterhouseCoopers, 2002).  This was \nempirically based and involved calculating the average school costs for pupils with AEN.  Whilst \nthe government made adjustments to this calculation,17 the figure they calculated has been used as a \nbasis for determining the proportion of funding for deprivation in the DSG, which is distributed by \ncentral government to local authorities.  However, the fact that this element is included in the \ngovernment allocation to local authorities does not necessarily mean that it will be passed on to \nschools by local authorities to meet the needs associated with social deprivation.  This is because \nonce funds have been allocated by central to local government, local authorities then distribute \nfunds to schools. \n \n 14 \nThe question then arises as to whether the resources distributed from local authorities to schools are \nadequate to meet the needs of social deprivation.  Indeed, the report ‘Child Poverty: Fair Funding \nfor Schools’ (DfES\/HM Treasury, 2005) argues that the amount of resource identified in the central \nto local government distribution is not always reflected locally, with a lower proportion being \nallocated by local authorities than by central government to meet the needs associated with social \ndeprivation.  This conclusion was reached after the DfES\/Treasury had surveyed the 150 local \nauthorities in England with responsibility for education.  A total of 45 responded.   \n \nThe responses revealed a number of pertinent findings.  Amongst them were that social deprivation \nfactors often did not have an objective basis.  In addition, the amount allocated to schools frequently \nbore little relationship to the amount of funding that the local authority received from central \ngovernment for AEN.  Where such factors had been introduced relatively recently, in response to \nthe new legal requirement, the amounts were often small: one authority reported an allocation of £1 \nper school through the social deprivation factor.  Some local authorities had reviewed policy and \nsought to take a view on the level of resources needed; sometimes these were reported to be based \non different activities undertaken (an ‘activity-led’ approach) ‘as in the case of one large shire \nauthority which had sought estimates from four secondary schools of the costs associated with \ndeprivation, mostly staff time, and obtained figures of £150,000 + from the schools most affected’ \n(DfES\/HM Treasury, 2005, p. 30).  In many cases, it was reported that funding for deprivation had \nbeen allocated on an historic basis.  In addition, in a number of cases, ‘there appeared to be a lack of \nunderstanding about the intended purpose of AEN funding’ (p. 33) (provided via the former \nEducation FSS), namely that it is designed to compensate for costs associated with low-level special \neducational needs, social deprivation, and cases where English is an additional language.  Following \nthe publication of this report, the DfES asked local authorities to provide statements of how they \nallocated resources to meet the needs associated with social deprivation.  These were published in \nthe summer of 2006 and form the basis of the analysis reported in this section. \n \nStatements providing details were provided by 142 out of 150 local authorities in England (DfES, \n2006d).  A sample of these statements was analysed in order to examine the extent to which local \nauthorities, in their formulae, target resources on deprivation.  The factors used in the formulae by \nthis sample of authorities were also examined.  In addition, the factors used to allocate the resources \nfor personalised learning were explored.  Finally, reasons as to why the allocations are at the level \nthey are, were examined.   \n 15 \nMethods \nLocal authorities that provided, in their statements, indicative percentages of the individual schools \nbudget allocated to meet the needs associated with deprivation in primary and secondary schools \n(combined) were selected so as to enable comparisons with the DfES indicative allocation for social \ndeprivation as provided in the DSG.  Whilst the methods used for determining deprivation are not \nthe same, the indicative allocations provide a broad basis for comparing central and local \nallocations.   \n \nIn examining the statements, it was clear that different authorities use very different approaches.  \nSome local authority statements included expenditure relating to pupils with statements of special \neducational needs.  However, as central government does not intend funding for additional \neducational needs to meet these costs, and as the focus here is on funding relating to deprivation, \nthese local authority statements were excluded from the sample.  The final sample of local \nauthorities comprised 15 local authorities, 10 per cent of all English local authorities with \nresponsibility for education.   \n \nThe sample is not representative of English local authorities as it was determined on the basis of \ndata being available that fulfilled the selection criteria: for example, London authorities were over-\nrepresented.  Notwithstanding the nature of the sample, a range of different types of local \nauthorities with differing allocations to meet the needs associated with disadvantage were \nrepresented in the sample.  The different types of factors selected by local authorities as being \nproxies for deprivation need to be taken into account, as some included factors that other authorities \ncould have chosen to include, but chose not to.18 \nFindings \nThe percentage of funding provided by the government in the Dedicated Schools Grant (DSG) to \nmeet the needs associated with deprivation was provided by the DfES (2006e) for each local \nauthority in England for 2006-07.  At a national level there was an indicative 10.5 per cent of the \nDSG for this purpose.  The range was from 5.2 per cent for the relatively prosperous Windsor and \nMaidenhead to 22.1 per cent for the disadvantaged London Borough of Newham.   \n \nFor each local authority in the sample, the statement of social deprivation funding provided details \nof the percentage of the individual schools budget that was allocated on the basis of factors that had \nbeen selected as proxies for disadvantage.  It is not possible to make precise comparisons as the \nfigures for social deprivation used for the DSG and by individual local authorities are calculated on \n 16 \na different basis.  Also, local authorities fund other activities from the centrally retained element of \nDSG (e.g., behaviour support services in one case).  Table 3 provides details of the DSG indicative \nallocation and the local authority allocation.   \n \nTable 3 about here \n \nAs can be seen, the percentage allocation for social deprivation is virtually always lower at the local \nauthority level than at the level of the DSG.  Thus, on the basis of the sample of local authorities \nexamined as part of this study, there appears to be less redistribution of funds for additional \neducational needs from local authorities to schools than from central to local government. \n \nGiven that local authorities are required to include a deprivation factor in their formulae, the actual \nfactors used by this sample of local authorities were examined in more detail.  Table 4 provides an \noverview of the factors used and the number of local authorities using each of these. \n \nTable 4 about here \n \nAs can be seen, there is variation in terms of the factors used.  The most common amongst this \nsample was free school meals entitlement, followed by prior attainment, special educational needs \n(without a ‘statement’ which carries with it additional resources), English as an additional language \nand pupil mobility.  Eight of the 15 local authorities made specific reference to the uptake of free \nschool  meals (i.e., the cost of providing free school meals); other local authorities did not include \nthis factor (suggesting that the statements of social deprivation cannot be considered to be fully \ncomparable). \n \nThe question arises as to why local authorities allocate a lower proportion of funding to meet the \nneeds of disadvantaged children than central government deems appropriate.  There are a number of \npossible explanations.  First, there is the historical context.  One local authority in the sample noted: \n \nWhen formula funding was first introduced, the policy underpinning its development was to \ndevise a formula that caused least financial turbulence to schools, i.e. a formula that \nmatched existing priorities for funding (metropolitan borough) \n \nWhen formula funding was first introduced there was no requirement for any element to meet the \nneeds associated with deprivation to be included.  It was not until 2002-03 that there was a statutory \n 17 \nrequirement to include a factor.  The following comments were made by two different local \nauthorities in their deprivation statements to the DfES: \n \nSince the phased introduction of Local Management of Schools from April 1990, the \nCounty Council and stakeholders, in consultation about the make up of school budgets, \naccepted that there were a range of challenges posed by social deprivation across the \nCounty…Until 2006\/07 DfES has not specifically suggested that a proportion of funding \nthey allocate to Local Authorities should be used to address social deprivation…(county) \n  \nSecond, until 2006, local authorities established funding formulae in consultation with all schools in \nthe local authority; this is no longer the case, but they now have to consult with the schools forum, a \nstatutory body within the authority, comprising schools and non-schools members (DfES, 2005g).  \nThey were thus subject to a wide variety of local pressures from schools in the authority (and they \nstill are): \n \n[A]s government priorities have been articulated and pressures against school budgets have \nbeen identified, resources have been targeted to meet those needs.  All other proposals that \ninvolved switching resources between schools have invariably met with strong opposition \nfrom the losing sector.  The Authority is however, currently undertaking a fundamental \nreview of the formula and is working on a needs led model taking into account curriculum \nentitlement (county). \n \n…it has often been the case that other pressures affecting all schools, such as pay awards, \npension increases, energy price rises and job evaluation have, by consensus, taken priority \n[over more funding for social deprivation] when distributing available funds…(county). \n \nFinally, the operation of the minimum funding guarantee in 2004-05, in the words of one local \nauthority ‘has inevitably constrained authorities’ ability to direct resources based on local needs and \npriorities’.  In another local authority it was noted: \n \nConsideration was given to increasing the proportion of funding for AEN in setting the \n2005\/06 schools budget but this was not implemented due to the impact of the Minimum \nFunding Guarantee (London borough). \n \n 18 \nTurning specifically to DSG funding for the personalisation of learning, what is interesting to note \nis that the distribution from central to local government to local authorities is made highly explicit: \nin 2006-07, resources were allocated on the basis of pupil numbers; an indicator of poverty; and \nprior attainment.  It is noteworthy that the allocation of this ‘pot’ of money, which is earmarked at \nlocal authority level to meet very specific needs, was distributed by local authorities to schools in a \nsimilar way as shown in Table 5. \n \nTable 5 about here \n \nAs can be seen, the majority of local authorities were distributing personalisation funds on the basis \nof pupil numbers, disadvantage (generally known free school meals eligibility) and prior attainment. \n \nIt is important to note that little is known about the extent to which, within schools, resources \nintended to meet the needs of disadvantaged pupils are actually used in that way.  Research carried \nout in the 1990s explored how schools used money for special and additional educational needs, but \nthis did not attempt to relate the amount allocated with how resources were used (West et al., \n2000b).  It did find, however, that headteachers directed most of their resources to staffing.  Whilst \nother research has examined the use of specific funding allocated as part of particular policy \ninitiatives such as Excellence in Cities (Kendall et al., 2005) and the Pupil Learning Credits pilot \nscheme (Braun et al., 2005) there appears to be a paucity of research examining how resources \nintended to meet additional educational needs are actually used at school level.  Given that the \nfunds delegated to schools via the DSG are un-hypothecated at school level, they can be used for \npurposes other than the intended purpose and there is no legal obligation for schools to target \nresources in any prescribed way.  There is a question then, of how resources that are intended to \nmeet needs associated with disadvantage are used at school level.   \n5. Conclusions \nSince 1997, there has been an overall increase in the amount of money allocated to education in the \nUK both as a percentage of GDP and in real terms.  There have been a variety of different initiatives \ndesigned to address the needs of pupils in disadvantaged areas, such as Excellence in Cities, and in \ndisadvantaged schools, such as the Pupil Learning Credits pilot scheme.  The evidence suggests that \nthere are positive associations between higher expenditure and higher attainment.  There have also \nbeen two major changes in the way in which central government distributes resources to local \ngovernment, but there has been no proportionate increase in the overall amount provided to meet \nadditional educational needs associated with disadvantage.   \n 19 \n \nIn relation to the allocation of resources to schools by local authorities, the government now \nrequires each authority to include a factor for social deprivation.  The evidence from a sample of \nlocal authority statements suggests that notwithstanding problems with data comparability, the \nproportion of funds allocated to meet needs associated with social deprivation is, in general, lower \nat a local than at a national level.  The fact that there are differences is, perhaps, unsurprising as the \ndistribution of funds to local authorities by central government has always seen to be separate from \nthe funding of schools by local authorities; moreover, until 2002-03, there was no requirement for a \nfactor\/factors addressing social deprivation to be included in local authority funding formulae for \nschools. \n \nA variety of pressures on local authorities also appear to have contributed to the relatively low \nproportion of funding being allocated to meet needs associated with social deprivation; these \ninclude historical reasons; the requirement, until 2006-07 for all schools to be consulted about \nchanges to funding formulae; and the government requirement for a ‘minimum funding guarantee’, \nwhich limits opportunities for local authorities to target funds where needs are greatest. \n \nTo make the funding system more redistributive, local authorities could be required to allocate a \nminimum proportion of funding to schools on the basis of disadvantage, as opposed to merely \nincluding such a factor in their funding formulae.  Politically this would be problematic as in the \nabsence of additional resources it would mean cuts being made by local authorities elsewhere in the \neducation budget: there are clearly tensions between the government’s desire for greater \nredistribution and the countervailing pressures at a local authority level.   \n \nIt is, however, significant that in the case of the local authority hypothecated element of the DSG \nfor the personalisation of learning, local authorities are distributing along broadly similar lines to \nthose being used by central government to allocate funds to local authorities.  The implication of \nthis is that if government wishes funds to be spent meeting particular needs, this approach is one \nthat could be adopted (similar findings were also observed with the funding for Excellence in Cities \n– see Kendall et al., 2005).  However, such a move would also have implications for the minimum \nfunding guarantee to schools. \n \nNevertheless, even with such prescription there is no guarantee that funds will be used as intended \nat school level as funding for social deprivation, and more specifically for personalisation, is not \nhypothecated at school level and schools can choose to spend the money as they see fit.  Thus, at \n 20 \nschool level we need to know more about how schools meet needs associated with disadvantage and \nhow they take resourcing decisions in relation to meeting needs of different types.  Such \ninformation will enable a better understanding of the perceived educational needs of children from \ndisadvantaged backgrounds, how these are being met, and how they might be met most effectively. \n \nIn conclusion, if the aim of government, and indeed society, is to raise achievement to reduce social \nexclusion (see Bradshaw et al., 2004), increased efforts need to be made to ensure an adequate level \nof funding reaches schools; to ascertain how resources are being used; why they are being used in \nparticular ways; and the extent to which any interventions are associated with improved \nachievement levels of pupils from disadvantaged backgrounds. \nReferences \nAudit Commission (1993) Passing the Bucks, London: Audit Commission. \n \nBhattacharyya, G., Ison, L & Blair, M. (2003) Minority ethic attainment and participation in education \nand training: The evidence, London: Department for Education and Skills. Research Topic Paper \nRTP01-03. \n \nBradshaw, J., Kemp, P., Baldwin, S. and Rowe, A. (2004) The Drivers of Social Exclusion : A \nreview of the literature, London: Social Exclusion Unit, Office of the Deputy Prime Minister, \nLondon. \nhttp:\/\/www.socialexclusion.gov.uk\/page.asp?id=491 \n \nBraun, A., Noden, P., Hind, A., McaNally, S. and West, A. (2005) Final Report of the Evaluation of \nthe Pupil Learning Credits Pilot Scheme, Research Report 687, London: DfES.   \nwww.dfes.gov.uk\/research\/data\/uploadfiles\/RR687.pdf \n \nDepartment for Education and Skills (2001) Statistics of Education: Education and Training \nStatistics for the United Kingdom 2001, London: The Stationery Office. \n \nDepartment for Education and Skills (2002) Statistics of Education: Education and Training \nStatistics for the United Kingdom 2002, London: The Stationery Office.  \n \nDepartment for Education and Skills (2003a) Technical note on the new education funding system, \nLondon: Department for Education and Skills. \n 21 \nhttp:\/\/www.dfes.gov.uk\/efsg\/fundingreform.shtml \n \nDepartment for Education and Skills (2003b) Additional grant to support school budgets, London, \nDfES.  \nhttp:\/\/www.teachernet.gov.uk\/_doc\/3798\/LEA.0128Letter.2003.doc \n \nDepartment for Education and Skills (2004a) Statistics of Education: Education and Training \nStatistics for the United Kingdom 2004, London: The Stationery Office. \n \nDepartment for Education and Skills (2004b) Statistics of Education: Education and training \nexpenditure since 1994\/95, London: The Stationery Office. \n \nDepartment for Education and Skills (2005a) Youth Cohort Study: The Activities and Experiences \nof 16 Year Olds: England and Wales 2004, London: Department for Education and Skills. \nhttp:\/\/www.dfes.gov.uk\/rsgateway\/DB\/SFR\/s000560\/index.shtml \n \nDepartment for Education and Skills (2005c) Statistics of Education: Education and Training \nStatistics for the United Kingdom 2005, London: The Stationery Office. \n \nDepartment for Education and Skills (2005d) Education funding calculations for LEAs for 2005-06 \n– Technical note (final settlement) 27 Jan 2005, London: Department for Education and Skills. \nhttp:\/\/www.teachernet.gov.uk\/d.ocbank\/index.cfm?id=8113 \n \nDepartment for Education and Skills (2005e) Statistics of Education: Education and training \nexpenditure since 1995\/96, London: The Stationery Office. \nhttp:\/\/www.dfes.gov.uk\/rsgateway\/DB\/SBU\/b000612\/index.shtml \n \nDepartment for Education and Skills (2005f) Higher Standards, Better Schools for All, Cm 6677, \nLondon: The Stationery Office. \nhttp:\/\/www.dfes.gov.uk\/publications\/schoolswhitepaper\/ \n \nDepartment for Education and Skills (2005g) Schools forums: Operational and good practice \nguidance, London: Department for Education and Skils. \n \n 22 \nDepartment for Education and Skills (2006a) National Curriculum assessment, GCSE and \nequivalent attainment and post-16 attainment by pupil characteristics in England 2005\/06 \n(Provisional), Statistical First Release 46\/2006, London: Department for Education and Skills. \nhttp:\/\/www.dfes.gov.uk\/rsgateway\/DB\/SFR\/s000693\/index.shtml \nhttp:\/\/www.dfes.gov.uk\/publications\/schoolswhitepaper\/  \n \nDepartment for Education and Skills (2006b) Statistics of Education: Education and Training \nStatistics for the United Kingdom 2006 (Internet only), London: The Stationery Office. \nhttp:\/\/www.dfes.gov.uk\/rsgateway\/DB\/VOL\/v000696\/index.shtml \n \nDepartment for Education and Skills (2006c) DSG revised technical note (updated 28 March 06), \nLondon: Department for Education and Skills. \nhttp:\/\/www.teachernet.gov.uk\/docbank\/index.cfm?id=9405 \n \nDepartment for Education and Skills (2006d) Local Authority Deprivation Funding Statements: \nBirmingham, Cumbria, Durham, Enfield, Hampshire, Haringey, Hertfordshire, Islington, Lewisham, Luton, \nMedway, Newham, Portsmouth, Reading, Telford and Wrekin, Wandsworth, West Sussex, London: \nDepartment for Education and Skills. \nhttp:\/\/www.teachernet.gov.uk\/management\/schoolfunding\/2006-\n07_funding_arrangements\/deprivationfundingreview\/deprivationstatements\/index.cfm?mode=searc\nh&intContent=1&ShowKeyword=0&letter=all \n \nDepartment for Education and Skills (2006e) DSG guaranteed unit of funding model (Dedicated \nSchools Grant 2005-06 and 2007-08), London: Department for Education and Skills. \nhttp:\/\/www.teachernet.gov.uk\/docbank\/index.cfm?id=9405 \n \nDepartment for Education and Skills (2007) Personal communication to author. \n \nDepartment for Education and Skills\/HM Treasury (2005) Child Poverty: Fair Funding for Schools, \nLondon: Department for Education and Skills \/Treasury.  \nhttp:\/\/www.teachernet.gov.uk\/docbank\/index.cfm?id=9404 \n \nGlennerster, H. (2002) United Kingdom education 1997-2001, Oxford Review of Economic Policy, \n18, 2, 120-135. \n \n 23 \nHalpin, D., Dickson, M., Power, S., Whitty, G. and Gewirtz, S. (2004) Area-based approaches to \neducational regeneration, Policy Studies, 25, 2, 75-85. \n \nHanushek, E. A. (1998) Conclusions and controversies about effectiveness of school resources, \nFRBNY Economic Policy Review, March 1998, 11-25. \n \nHM Treasury (2005) GDP deflators at market prices and money GDP, updated 23 December 2005  \nhttp:\/\/www.hm-treasury.gov.uk\/economic_data_and_tools\/gdp_deflators\/data_gdp_fig.cfm \n \nHM Treasury (2006) Budget 2006 HC968, London: The Stationery Office. \n \nHouse of Commons Hansard (2004a) Minimum funding guarantee, 4 October 2004. \nhttp:\/\/www.publications.parliament.uk\/pa\/cm200304\/cmhansrd\/vo041004\/text\/41004w10.htm \n \nHouse of Commons Hansard (2004b) Parliamentary Answer 1 March 2004. \nhttp:\/\/www.publications.parliament.uk\/pa\/cm200304\/cmhansrd\/vo040301\/text\/40301w10.htm \n \nHouse of Commons Select Committee on Education and Skills (2003) Secondary Education: Pupil \nAchievement, London: House of Commons. \n \nJenkins, A., Levačić, R. and Vignoles, A. (2006) Estimating the relationship between school \nresources and pupil attainment at GCSE, London: Department for Education and Skills.   \nwww.dfes.gov.uk\/research\/data\/uploadfiles\/RR727.pdf \n \nKendall, L., O’Donnell, L., Golden, S., Ridley, K., Machin, S., Rutt, S., McNally, S., Schagen, I., \nMeghir, C., Stoney, S., Morris, M., West, A. and Noden, P. (2005) Excellence in Cities: The \nNational Evaluation of a Policy to Raise Standards in Urban Schools 2000-2003, Research Report \n675a, London: Department for Education and Skills. \nhttp:\/\/www.dfes.gov.uk\/research\/programmeofresearch\/index.cfm?type=5&keywordlist1=0&keyw\nordlist2=0&keywordlist3=0&andor=or&keyword=excellence+in+cities%3A+the+&x=48&y=12 \n \nLabour Party (2005) The Labour Party Manifesto 2005, London: The Labour Party. \n \n 24 \nLevačić, R., Jenkins, A., Vignoles, A., Steele, F. and Allen, R. (2005) Estimating the relationship \nbetween school resources and pupil attainment at key stage 3, London: Department for Education \nand Skills.   \nwww.dfes.gov.uk\/research\/data\/uploadfiles\/RR679.pdf \n \nLocal Government Association (2003) Education Funding – how it works, 30 May 2003, London: \nLGA. \nhttp:\/\/www.lga.gov.uk\/Documents\/Briefing\/Our_Work\/education\/education%20finance\/LGA%20e\nducation%20briefing%2030.05%20%2880%20KB%29.pdf \n \nLupton, R. (2004) Do poor neighbourhoods mean poor schools? Education and the Neighbourhood \nConference. \nwww.bristol.ac.uk\/sps\/cnrpapersword\/edu\/lupton.doc \n \nLupton, R. (2005) Social Justice and School Improvement: Improving the quality of schooling in \nthe poorest neighbourhoods, British Educational Research Journal 31, 5, 589-604.   \n \nMcNally, S. (2005) Economic evaluation of the pupil learning credits pilot scheme, London: DfES. \nwww.standards.dfes.gov.uk\/ studysupport\/816987\/817959\/econeval.pdf \n \nNational Audit Office (2001) Education Action Zones, London: The Stationery Office. \n \nNoden, P. West, A. and West, R. (2002) Mapping resources, assessing effects, London: NFER. \n \nOffice of the Deputy Prime Minister (2005) Balance of Funding Review Report. London: ODPM. \nhttp:\/\/www.local.odpm.gov.uk\/finance\/balance\/intro.htm \n \nOffice of Public Sector Information (2002a) The LEA Budget, Schools Budget and Individual \nSchools Budget (England) Regulations 2002. \nhttp:\/\/www.opsi.gov.uk\/si\/si2002\/20023199.htm \n \nOffice of Public Sector Information (2002b) The financing of maintained schools (England) \nregulations 2002. \nhttp:\/\/www.opsi.gov.uk\/si\/si2002\/20020377.htm \n \n 25 \nOffice of Public Sector Information (2004) The financing of maintained schools regulations (2004) \nhttp:\/\/www.opsi.gov.uk\/si\/si2004\/20043130.htm \n \nOffice of Public Sector Information (2006) The school finance (England) regulations 2006. \nhttp:\/\/www.opsi.gov.uk\/si\/si2006\/20060468.htm \n \nPricewaterhouseCoopers (2002) Study of Additional Educational Needs – Phase II. London: DfES. \n \nSammons, P. (1999) School Effectiveness: Coming of Age in the Twenty-First Century, London: \nLisse, Swets and Zeitlinger. \n \nSimkins, T. (2004)  School finance and equity in England, Educational Management, \nAdministration and Leadership, 32, 4, 369-386. \n \nWandsworth Borough Council (2005)  Education and Overview and Scrutiny Committee 15 \nNovember 2005.  Report of the Director of Education on the White Paper.  Paper Number 05-1022, \nWandsworth: Wandsworth Council. \n \nWest, A., Pennell, H. & West, R. (2000a) New Labour and school-based education in England: \nChanging the system of funding? British Educational Research Journal, 26, 4, 523-536. \n \nWest, A., Pennell, H., West, R. & Travers, T. (2000b) Financing school-based education in England: \nPrinciples and problems, in M. Coleman & L. Anderson (eds) Managing Finance and Resources in \nEducation, London: Paul Chapman. \n \nWest, A., West, R., Pennell, H. and Travers, T. (2001) Financing school-based education in \nEngland: Poverty, examination results and expenditure, Environment and Planning C: Government \nand Policy 19, 3, 461-471. \n \nAcknowledgements \nThe author would like to thank two anonymous referees for helpful comments, DfES officials for \ncomments on an earlier draft and for helpful information, and Philip Noden and Hazel Pennell for \nhelpful comments on an earlier version of this paper. \n 26 \n \n \n 27 \nTable 1 Public expenditure on education as a percentage of Gross Domestic Product (UK) \n  \nYear Total education \nexpenditure in real terms \n(£ million) (1) \nEducation expenditure  \nas a percentage of GDP in real terms \n(1) \n1996-97 44,060 4.7 \n1997-98 43,966 4.5 \n1998-99 44,458 4.5 \n1999-00 45,890 4.4 \n2000-01 49,338 4.6 \n2001-02 53,940 5.0 \n2002-03 55,888 5.0 \n2003-04 60,506 5.3 \n2004-05 (provisional) 63,684 5.4 \n \nSource DfES, 2006b \n(1) At 2004-05 prices  \n \n 28 \nTable 2 Education expenditure by central and local government on schools in real terms in \nEngland \n \nYear Current expenditure on schools in \nreal terms (£ million) (1) \nIndex 1996-97 =100 \n1996-97 20,910 100 \n1997-98 21,129 101 \n1998-99 21,501 103 \n1999-00 23,034 110 \n2000-01 25,088 120 \n2001-02 27,462 131 \n2002-03 28,337 136 \n2003-04 (estimated) 30,630 146 \n \nSource: DfES, 2004b \n(1) At 2003-04 prices (author’s calculations, using HM Treasury 2005) \n 29 \n Table 3 Sample of local authorities: Percentage of funding for deprivation – DfES and LA \nestimates \n \nLocal authority DSG % funding for \ndeprivation 2006-07 \nLA % ISB budget for \ndeprivation 2006-07 \nBirmingham 18.1% 12.7% \nEnfield  14.5% 5.6% \nHampshire 5.8% 5.18% \nHaringey 20.3% 5.04% \nHertfordshire 6.1% 6.1% \nIslington 17.3% 10.1% \nLewisham 14.1% 9.0% \nLuton 15.2% 8.1% \nMedway 9.0% 10.3% \nNewham 22.1% 10.7% \nPortsmouth 10.5% 1.7% \nReading 9.9% 7.2% \nTelford and Wrekin* 11.1% 9.7% \nWandsworth 13.2% 7.9% \nWest Sussex 6.3% 5.2% \n \n* Includes pupil referral and other units. \n 30 \nTable 4 Formula factors used by local authorities \n \nFormula factor Number of local authorities \n(N=15) \nFSM entitlement 13 \nPrior attainment  9 \nSEN audit data\/SEN without statements 9 \nEnglish as an additional language 9 \nMobility  9 \nFSM uptake 8 \nIndex of Multiple Deprivation 5 \nMinority ethnic group 4 \nLooked after children  2 \nOther (e.g., special facilities at certain schools, \nward deprivation indices, pupil retention) \n3 \n \n 31 \nTable 5 Factors used in the distribution of personalisation of learning funds \n  \nFactor Number of local authorities \nN=13* \nFree school meals\/index of multiple deprivation 11 \nLow prior attainment 11 \nPupil numbers 10 \nGifted and talented 2 \nFree school meals or low prior attainment 1 \nOther (e.g. lump sum, underperforming groups) 2 \n \n*N is less than 15 as not all local authorities provided details \n 32 \nFigure 1 Factors used in the Additional Educational Needs Index \n \n \nPrimary Additional Educational Needs index, comprising: \n \n• Children in families in receipt of Income Support\/Job seekers allowance.  \n• Children in families in receipt of Working Families Tax Credit (WFTC).  \n• Proportion of primary pupils with mother tongue other than English from the pupil level annual \nschool census. \n \nSecondary Additional Educational Needs index, comprising: \n \n• Children in families in receipt of Income Support\/Job seekers allowance;  \n• Children in families in receipt of Working Families Tax Credit; \n• Proportion of secondary pupils in low-achieving ethnic groups from the pupil level annual \nschool census (a). \n \n \nSource: DfES, 2005d \n(a) The low achieving groups are: Gypsy\/Roma and Travellers of Irish Heritage; White and Black \nAfrican; White and Black Caribbean; Pakistani; Bangladeshi; Black African; Black Caribbean; \nOther Black and Other. \n 33 \nEndnotes \n                                                 \n1 In England, at the age of around 16, the vast majority of pupils take public examinations known as \nthe General Certificate of Secondary Education (GCSE) in individual subjects.  The highest pass \ngrades are starred A (A*), A, B and C; five such passes are the normal minimum requirement to \nmove on to study General Certificate of Education (GCE) Advanced levels; the latter are the normal \nentry requirement for entry to higher education.    \n2  The Standards Fund has now been replaced with the School Development Grant (DfES\/HM \nTreasury, 2005). \n3 DfES expenditure on EiC (excluding specialist and beacon schools that were part of EiC) rose \nfrom about £24 million in 1999-2000 to £139 million in 2000-01 (the first full year) and to about \n£386 million in 2005-06 (House of Commons Hansard, 2004b).  Whilst representing a significant \nuse of resources, this needs to be seen in the context of overall local authority recurrent expenditure \non secondary schools of over £9,000 million in 2000-01 (Kendall et al., 2005). \n4 Interestingly, EAZs which no longer exist continued under a different guise as EiC Action Zones \n(see Kendall et al., 2005). \n5 The author’s own calculations (from DfES, 2005e). \n6 The other service areas covered by the RSG are: personal social services; police; fire; highway \nmaintenance; environmental, protective and cultural services; and capital financing.  \n7 A further issue related to the measures used in the Education SSA:  at the local education authority \nlevel, a very close and highly statistically significant negative relationship was found between the \nproportion of children dependent on income support recipients and national test and public \nexamination results, and this was found to be a better predictor of attainment than the AEN index \n(West et al., 2001). \n8 As with the SSA, this was not all grant funding as it included an assumption of funding from \ncouncil tax (Local Government Association, 2003). \n9 Within the schools block there were four main ‘sub-blocks’ covering children under 5 years of age; \nprimary; secondary; and high-cost pupils (this block was intended to cover the costs of pupils who \nare high cost, in particular, those with special educational needs).  Within the local authority block \nthere were two sub-blocks: one for youth and community provision and one for local education \nauthority central functions (DfES, 2003a). \n10 As with the Education SSA there were other adjustments for areas where it costs more to recruit \nand retain staff (area cost adjustment) and for sparsity (DfES, 2003a). \n11 The change to the system of funding to the EFSS took place at a time when funds available for \nschool-based education were increasing; in addition, to ensure that there was an effective increase \nin funding for local authorities and schools between 2002-03 and 2003-04 of no less than 3.2% per \npupil, an additional grant was paid to local authorities by the government (DfES, 2003b).  Given \nthat these changes took place at the same time, it is not possible to compare the distribution between \nlocal authorities before and after the switch to the EFSS.  \n12 The AEN total for 2002-03 included all funding allocated through the AEN index, which was \ncomposed of Income Support, Lone Parents and the country of birth ethnicity measure. The AEN \ntotal for 2003-04 included all funding allocated through Income Support, Working Families Tax \nCredit, Low Birth Weight (this was used in the high cost pupils block), English as an additional \nLanguage and low achieving ethnic groups.  \n13 The functions of local authorities with responsibility for education continue to be funded through \nthe local education authority block in the RSG. \n14 The method of calculation was different from that used to compare the AEN components of the \nEducation SSA and EFSS where high cost pupils (e.g., in special schools) were included. \n15 Some of the funding for personalisation goes directly to schools via a specific grant from the \nDfES, called the School Standards Grant (Personalisation) (HMT, 2006). \n 34 \n                                                                                                                                                                  \n16 Until the end of the 2005-06 financial year, the funding from central government was not ‘ring \nfenced’ which meant that local authorities could make their own decisions about their budget: they \ncould spend more or less than their Formula Spending Share. Analyses of 2003-04 data revealed \nthat local authorities spent more than the Schools Formula Spending Share (Local Government \nAssociation, 2003).  \n17  The government made adjustments to this calculation ‘including an assumption as to what \nproportion of unmet needs should be funded and the proportion of met costs which are funded \nthrough grant and are therefore not relevant to mainstream sources.  In total, the £1,780 figure was \nreduced to £1,460.  This figure represents a useful benchmark for the typical additional cost that a \nschool is likely to face as a result of teaching a pupil with either low-level SEN, ‘social’ needs \narising from deprivation, or EAL needs’ (DfES\/HM Treasury, 2005, p. 19) \n18 For example, the actual provision of free school meals for eligible children. \n \n"}