{"doi":"10.1108\/02656710610688185","coreId":"135289","oai":"oai:bradscholars.brad.ac.uk:10454\/4097","identifiers":["oai:bradscholars.brad.ac.uk:10454\/4097","10.1108\/02656710610688185"],"title":"Process based knowledge management systems for continuous improvement","authors":["Barber, Kevin D.","Munive-Hernandez, J. Eduardo","Keane, J."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2006","abstract":"NoThis paper presents a practical methodology for developing a process-based knowledge management system (KMS) for supporting continuous improvement (CI) and asset management. An action research methodology was used to develop a KMS to support CI in a manufacturing company. The KMS is evaluated through application in the case study company. This methodology ensures a consistent approach to carrying out all improvement initiatives. The final part of the methodology addresses the construction of an intranet-based knowledge warehouse. This contains several searchable areas such as existing information on assets, new knowledge generated from projects, details of expertise in the business and links to the key business drivers through the corporate intranet. The KMS is shown to support CI initiatives through the utilization of available data already held within the company's management databases (production, quality and maintenance) including consideration of corporate strategic plans. Process models trigger the application of improvement tools and projects in a true CI environment. This methodology acknowledges both tacit and explicit knowledge within the company, and it represents an appropriate environment to promote and develop a true learning organization. The system developed is shown to be flexible and has been implemented in a manufacturing environment. Financial benefits are presented","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/4097<\/identifier><datestamp>\n                2016-08-10T14:00:26Z<\/datestamp><setSpec>\n                com_10454_232<\/setSpec><setSpec>\n                col_10454_6344<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nProcess based knowledge management systems for continuous improvement<\/dc:title><dc:creator>\nBarber, Kevin D.<\/dc:creator><dc:creator>\nMunive-Hernandez, J. Eduardo<\/dc:creator><dc:creator>\nKeane, J.<\/dc:creator><dc:subject>\nModelling<\/dc:subject><dc:subject>\nKnowledge Management<\/dc:subject><dc:subject>\nContinuous Improvement<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nThis paper presents a practical methodology for developing a process-based knowledge management system (KMS) for supporting continuous improvement (CI) and asset management. An action research methodology was used to develop a KMS to support CI in a manufacturing company. The KMS is evaluated through application in the case study company. This methodology ensures a consistent approach to carrying out all improvement initiatives. The final part of the methodology addresses the construction of an intranet-based knowledge warehouse. This contains several searchable areas such as existing information on assets, new knowledge generated from projects, details of expertise in the business and links to the key business drivers through the corporate intranet. The KMS is shown to support CI initiatives through the utilization of available data already held within the company's management databases (production, quality and maintenance) including consideration of corporate strategic plans. Process models trigger the application of improvement tools and projects in a true CI environment. This methodology acknowledges both tacit and explicit knowledge within the company, and it represents an appropriate environment to promote and develop a true learning organization. The system developed is shown to be flexible and has been implemented in a manufacturing environment. Financial benefits are presented.<\/dc:description><dc:date>\n2009-12-15T10:55:21Z<\/dc:date><dc:date>\n2009-12-15T10:55:21Z<\/dc:date><dc:date>\n2006<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nNo full-text available in the repository<\/dc:type><dc:identifier>\nBarber, K.D., Munive-Hernandez, J.E. and Keane, J. (2006). Process based knowledge management systems for continuous improvement. International Journal of Quality & Reliability Management. Vol. 23, No. 8, pp. 1002-1018.<\/dc:identifier><dc:identifier>\n90013768<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/4097<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1108\/02656710610688185<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1108\/02656710610688185"],"year":2006,"topics":["Modelling","Knowledge Management","Continuous Improvement"],"subject":["Article","No full-text available in the repository"],"fullText":null}