{"doi":"10.1007\/978-94-007-0214-1","coreId":"219465","oai":"oai:eprints.lse.ac.uk:36428","identifiers":["oai:eprints.lse.ac.uk:36428","10.1007\/978-94-007-0214-1"],"title":"The stochastic concept of economic equilibrium: a radical alternative","authors":["Machover, Moshé"],"enrichments":{"references":[{"id":17280153,"title":"Laws of Chaos: A Probabilistic Approach to Political Economy;","authors":[],"date":"1983","doi":null,"raw":"Farjoun F and Machover M 1983: Laws of Chaos: A Probabilistic Approach to Political Economy; London: Verso\/NLB.","cites":null},{"id":17280156,"title":"Marx after Sraﬀa;","authors":[],"date":"1977","doi":"10.2307\/3501238","raw":"Steedman, I 1977: Marx after Sraﬀa; London: NLB.","cites":null},{"id":17280154,"title":"Probability, economics and the labour theory of value’,","authors":[],"date":"1985","doi":null,"raw":"1985: ‘Probability, economics and the labour theory of value’, New Left Review 152:95–108.","cites":null},{"id":17280155,"title":"Ricardo, Marx, Sraﬀa : the Langston memorial volume;","authors":[],"date":"1984","doi":null,"raw":"Langston R, Mandel E and Freeman A 1984: Ricardo, Marx, Sraﬀa : the Langston memorial volume; London: Verso\/NLB.","cites":null},{"id":17280159,"title":"The social architecture of capitalism’,","authors":[],"date":"2005","doi":"10.1016\/j.physa.2004.08.006","raw":"Wright, I 2005: ‘The social architecture of capitalism’, Physica A 346:589–622.","cites":null}],"documentType":{"type":1}},"contributors":["DeVidi, David","Hallett, Michael","Clarke, Peter"],"datePublished":"2011","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/219465.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/36428\/1\/The_stochastic_concept_of_economic_equilibrium_a_radical_alternative_%28lsero%29.pdf","pdfHashValue":"fd15cc7fe4166d09acd64775ea5290803fee0286","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:36428<\/identifier><datestamp>\n      2011-06-24T08:51:58Z<\/datestamp><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3134<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/36428\/<\/dc:relation><dc:title>\n        The stochastic concept of economic equilibrium: a radical alternative<\/dc:title><dc:creator>\n        Machover, Moshé<\/dc:creator><dc:subject>\n        HB Economic Theory<\/dc:subject><dc:subject>\n        QA Mathematics<\/dc:subject><dc:publisher>\n        Springer<\/dc:publisher><dc:contributor>\n        DeVidi, David<\/dc:contributor><dc:contributor>\n        Hallett, Michael<\/dc:contributor><dc:contributor>\n        Clarke, Peter<\/dc:contributor><dc:date>\n        2011<\/dc:date><dc:type>\n        Book Section<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/36428\/1\/The_stochastic_concept_of_economic_equilibrium_a_radical_alternative_%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Machover, Moshé  (2011) The stochastic concept of economic equilibrium: a radical alternative.   In: DeVidi, David and Hallett, Michael and Clarke, Peter, (eds.) Logic, Mathematics, Philosophy, Vintage Enthusiasms: Essays in Honour of John L. Bell.  The Western Ontario series in philosophy of science (75).  Springer, Dordrecht, pp. 413-421.  ISBN 9789400702134     <\/dc:identifier><dc:relation>\n        http:\/\/www.springer.com\/<\/dc:relation><dc:relation>\n        10.1007\/978-94-007-0214-1<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/36428\/","http:\/\/www.springer.com\/","10.1007\/978-94-007-0214-1"],"year":2011,"topics":["HB Economic Theory","QA Mathematics"],"subject":["Book Section","NonPeerReviewed"],"fullText":"  \nMoshé Machover \nThe stochastic concept of economic \nequilibrium: a radical alternative \n \nBook section \nOriginal citation: \nMachover, Moshé (2011) The stochastic concept of economic equilibrium: a radical \nalternative. In: DeVidi, David andHallett, Michael and Clarke, Peter, (eds.) Logic, mathematics, \nphilosophy, vintage enthusiasms: essays in honour of John L. Bell. The Western Ontario series \nin philosophy of science (75). Springer, Dordrecht, pp. 413-421. ISBN 9789400702134 \n© 2011 Springer Science+Business Media B.V.\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/36428\/\nAvailable in LSE Research Online: June 2011 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s submitted version of the book section. There may be differences \nbetween this version and the published version.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n \nThe Stochastic Concept of Economic Equilibrium:\nA Radical Alternative1\nMoshe´ Machover\nVoting Power and Procedures (VPP)\nLSE\nFourth Draft, July 2006\nPlease address all correspondence to:\nMoshe´ Machover\n5 Milman Road, Queen’s Park\nLondon nw6 6en, England\nPhone +44 (0)20 8969 5356\ne-mail: moshe.machover@kcl.ac.uk\n1Edited version of talk at the Seminar on Dissent in Science, CPNSS, LSE; 16\nMarch 2004\nThe Stochastic Concept\nof Economic Equilibrium:\nA Radical Alternative\n1 Introduction\nMy aim in this article is to present the gist of some ideas first proposed\nin [2]: that the main economic quantities – such as the unit price of any\ntype of commodity, and the rate of profit – at any time should be modelled\nnot as determinate numerical magnitudes but as random variables; and that\nat equilibrium these quantities have characteristic distributions rather than\ndeterminate numerical values. I add some methodological remarks about\nmathematical models and about what economics can borrow from physics.\nI am not an economist but a mathematician, whose knowledge of academic\nmainstream economics is quite patchy. I made my first acquaintance with it\nin the early 1960s, when I was assigned the task of teaching some courses of\nmathematics to students of economics. In order to find examples of applica-\ntions and problems that would be close to the interests of these students, I\ndecided to have a look at some books on mathematical economics.\nMy attention was attracted by a recent book [5], because it was by a well-\nknown mathematician, Jacob T Schwartz, co-author (with Nelson Dunford)\nof an important monograph on linear operators. I found it very interesting\nand instructive. In particular, I was fascinated by Part A of the book, entitled\n‘The Leontief Model and the Technological Basis of Production’. I realized\nimmediately that this was just the right framework for formalizing Marxian\neconomics (with which I was familiar). Of course, this was no accident, as\nLeontief’s input–output matrix formalism was a direct descendant of Marx’s\n‘schemes of reproduction’.1\nI played around with this formalism in order to analyse the so-called\ntransformation problem of Marxian economics (of which more anon), unaware\nthat I was duplicating other people’s work. I didn’t get very far, and let the\nmatter rest.\n1I found out later that before emigrating from the USSR in 1931, Wassily Leontief\nhad worked in GOSPLAN, the Soviet Economic Planning Board, which used Marxian\neconomic theory. Leontief’s work, for which he was awarded the Nobel Prize in 1973, was\none of the channels through which Marxian theory exercised its – largely unrecognized –\ninfluence on mainstream economics.\n2\nStochastic Equilibrium 3\nIn the late 1970s, my interest was rekindled by my friend Emmanuel\nFarjoun. He got involved in the controversy between Sraffians and Marxists\nthat flared up following some publications by the former (see, in particular,\nSteedman’s book [6]). The Sraffians showed that the transformation problem\n– as commonly understood – is not solvable. Hence they concluded that\nMarx’s labour theory of value is wrong and worthless. The Marxists sprang\nto the defence of this theory. (Some Marxist responses are collected in [4].)\nAt the heart of this controversy was a notion of equilibrium which was\nshared by both sides.\n1.1 The equilibrium price–profit equation\nLet me outline the simplest form of the linear equilibrium model of prices\nand profit in the Leontief formalism.\nWe consider a (closed) capitalist economy, in which n types of commodity\n(excluding labour power), say C1, . . . , Cn, are produced. In this simple model\nit is assumed that each type of commodity is produced by a unique technical\nprocess, and there are no by-products.2 More importantly, it is assumed that\neach type of commodity has a determinate equilibrium unit price;3 and that\nall types of production yield the same equilibrium rate of profit.\nIf pi is the price of one unit of Ci and ρ is the rate of profit, then\npi =\nn∑\nj=1\n(aij + ρk\ni\nj)p\nj, i = 1, . . . , n. (1)\nHere aij is the amount of Cj consumed (ie, used up) as input in the production\nof one unit of Ci; and k\ni\nj is the amount of Cj employed (ie, used but not\nnecessarily used up) in the production of one unit of Ci multiplied by the\nnumber of units of time during which it is so employed.4,5\n2These two assumptions can be, and indeed have been, challenged as unrealistic. But\nthis issue is irrelevant to the present discussion.\n3These prices are determined only up to an arbitrary factor of proportionality; thus, it\nmakes no difference if all unit prices are multiplied by the same positive number. Alterna-\ntively, we can put, arbitrarily, p1 = 1, and then all unit prices are completely determined.\n4Thus, if time is measured in years and x units of Cj are employed during a year in\nproducing a total of y units of Ci, then kij = x\/y.\n5Note that labour does not occur in (1); this is because it has been eliminated from\nthe accounting by incorporating into the aij the wage goods consumed by the workers who\nsupply the labour power used in producing Ci. This elimination is possible due to the\nfact that the price of labour power does not contain any direct profit, but is just the total\nprice of the wage goods consumed by the workers.\n4 M Machover\nThe system (1) of n equations can be written in matrix form:\np = (A+ ρK)p, (2)\nwhere p is a column n-vector and A and K are n × n matrices with non-\nnegative elements. The unknowns here are p and ρ. Since p is determined\nonly up to proportionality,6 the number of unknowns is n, the same as the\nnumber of equations. To make sense, a solution p and ρ should be positive.\nUnder very reasonable conditions,7 there is indeed such a solution, and it\nis unique.\n1.2 The uniformity assumption\nLike all mathematical models, the one just described makes various assump-\ntions that simplify reality. Here I would like to draw attention to a very\nfundamental conceptual assumption: at equilibrium, the unit prices of all\ntypes of commodity produced by the economy have (up to proportionality)\ndeterminate numerical values; and the rates of profit accrued by capitals in\nall productive units are equal.\nClearly, this assumption does not purport to describe a real-life state of\naffairs in a capitalist economy. Everyone knows that if you shop around\nyou will find that the same type of commodity is sold at the same time by\ndifferent sellers at a variety of unit prices; and rates of profit vary greatly\nboth within industries and between them. So the equilibrium that the input–\noutput model describes is an ideal one. However, it is implied that the real\neconomy is driven by market forces, the forces of competition, towards an\nideal equilibrium of this sort, and are only prevented from actually reaching\nit by various disequilibrating forces, that act as ‘noise’.\nSchwartz [5, p. 9] provides the following justification for the assumption\nregarding the rate of profit:\nWe have here taken an essential step in assuming the rate of\nprofit, ρ, to be the same for all types of production. This cor-\nresponds to the ordinary assumption, in the theory of prices, of\n“free competition”; it can be justified in the usual way by arguing\nthat a situation in which the production of different commodities\n6See footnote 3.\n7The economic meaning of these conditions is that the economy is capable of producing\na physical surplus; and that it cannot be partitioned into two or more closed sub-economies.\nFor details, see [5, Lecture 2]. The mathematical tool used here is the Frobenius theory\nof the eigenvalues and eigenvectors of non-negative matrices.\nStochastic Equilibrium 5\nyields different rates of profit cannot be stable, since investments\nwould be made only in the industry yielding the highest rate of\nprofit to the exclusion of other commodities yielding lower rates\nof profit. Long-term equilibrium, of which our simple theory is\nalone descriptive, would be reached only when all such rates of\nprofit became equal. [My emphases]\nNote that Schwartz refers to the uniformity assumption as ‘ordinary’ and\nto his justification of it as ‘the usual’ one. They are indeed both common\nand time-honoured: they go back at least to Adam Smith, and have been\naccepted and repeated (with some variations) by many authors of various\nschools, including Marx.8\nNote also that Schwartz does not bother to justify the assumption that at\nequilibrium the unit prices are determinate, although a similar justification\n(in terms of competition) might surely be offered. Apparently he (like many\nothers) regards this as more or less obvious.\n1.3 The transformation problem\nMarx had not one but two sets of ideal prices or price-like quantities. He\nstarts off, as a first approximation, with the notion of exchange value (to\nwhich I shall refer here briefly as ‘value’). The value of a given commodity\nis, roughly speaking, the total amount of labour (measured, say, in labour\nhours) necessary to produce it, including not only the labour used directly\nin its production but also the labour used in producing its material inputs,\nas well as the inputs of these inputs, etc.9\nBut values cannot serve as equilibrium prices in an (ideal!) state of affairs\nin which the rate of profit is uniform. This is because if commodities were\nto exchange at their values, then a commodity whose production process\nhas higher ‘organic composition’ (roughly speaking, smaller labour intensity)\n8See [2, pp. 14–16] for quotes from Smith and Marx, as well as from a later article by\nSchwartz.\n9In the formalism of Subsection 1.1, let vi be the value of one unit of Ci, and let li be\nthe amount of labour used directly in producing it. Further, let cij be defined like the a\ni\nj\nof (1), except that they do not incorporate the wage goods consumed by the workers who\nsupply the labour power used directly in producing Ci (cf. footnote 5). Then the vi are\nthe unique solution of the system of n linear equations:\nvi = li +\nn∑\nj=1\ncijv\nj , i = 1, . . . , n.\n6 M Machover\nwould yield a lower rate of profit than a commodity produced by a process\nwith lower organic composition (greater labour intensity).\nSince Marx – following the classical economists, especially Adam Smith\nand David Ricardo – subscribed to the uniformity assumption, he introduced\nwhat he called ‘prices of production’, which are ideal equilibrium prices cor-\nresponding quite closely to the pi of Subsection 1.1.10\nMarx’s price–profit system of equations, connecting the ideal equilibrium\nrate of profit and prices of production was very similar to the Leontief equa-\ntion (2), of which it was in fact a direct ancestor.11 However, Marx postulated\nan additional constraint: the equilibrium ideal rate of profit must, according\nto him, equal the average rate of profit that would obtain if all commodities\nwere priced at their values. Thus, if S is the total value of the surplus pro-\nduced during a unit of time,12 and K is the total value of the goods employed\n(but not necessarily used up) in production during this period, then the ideal\nrate of profit ought to be\nρM :=\nS\nK\n. (3)\nThrough this link, values are ‘transformed’ into prices of production.\nBut Marx was unable to solve [his rudimentary form of] (2) with the added\nconstraint ρ = ρM. In fact, we now know that this so-called ‘transformation\nproblem’ is in general not solvable – at least not in the sense in which it\nhas commonly been understood. As pointed out by the Sraffians, the unique\nρ solving (2) need not in general equal ρM as defined by (3): there are\nreasonable counter-examples, cases of the model outlined in Subsection 1.1,\nwhose solution fails to satisfy ρ = ρM.\nEmmanuel Farjoun, who got involved in the controversy around the trans-\nformation problem (and who contributed to [4]), eventually came up with\na radical idea: the point was not whether the Sraffians were right or wrong\nabout the Leontief model, or whether the model could be tweaked in some\nway so as to satisfy Marx’s postulate; rather, it was whether that model\n– or indeed anything like it – was a reasonable way of theorizing equilib-\nrium. An analogy with statistical mechanics suggested very strongly that it\nwas not: the uniformity assumption (which both sides in the transformation\n10Both values and prices of production must be distinguished from what Marx called\n‘market prices’: these are real-life prices, whose relationship to the prices of production is\nas described in Subsection 1.2.\n11Cf. footnote 1.\n12This is obtained from the value of the whole product by deducting from it the value\nof the non-labour inputs consumed in its production and the value of the goods consumed\nby the workers engaged in this production.\nStochastic Equilibrium 7\ncontroversy subscribed to) was all wrong. We elaborated this idea together\nin [2].\n2 Stochastic equilibrium\nThe main aim of [2] was to amend and reconstruct the Marxian labour theory\nof value, preserving what we regard as its invaluable core, while ditching\nthe concept of prices of production (which we regard as unnecessary and\nmistaken) and avoiding altogether the transformation problem as commonly\nunderstood (which we regard as a non-problem).\nBut the book’s basic methodological message – which is my present topic\nhere – is much more general. It concerns the notion of economic equilibrium\nused in several economic theories of various school. In this connection, Marx’s\ntheory and the Leontief model discussed in the Introduction serve as a mere\nillustration.\nThe methodological message is, briefly, that the concept of equilibrium in\nwhich unit prices and ‘the’ rate of profit are determinate quantities is funda-\nmentally erroneous. This is suggested by analogy with statistical mechanics,\na theory underlying thermodynamics, founded by Boltzmann and Maxwell\nin the 1870s. This analogy is explained in some detail in [2], and here I shall\nonly highlight a few points.\n2.1 Equilibrium in statistical mechanics\nIn a volume of gas enclosed in a closed container, the molecules are in constant\nmotion (the total kinetic energy of this motion is what constitutes the heat\nenergy stored in the gas). In this motion, the molecules collide with one\nanother and as a result the more energetic molecules tend to slow down\n(by imparting some energy to slower molecules with which they collide);\nconversely, the less energetic molecules tend to speed up.\nHowever, this does not mean that at equilibrium all molecules reach an\nequal level of kinetic energy.13 The point is not merely that such a state of\nuniformity does not actually occur; but that if it ever did it could not last for\na split second. If it were miraculously brought about through the mechanism\nof incessant collision, then this very same mechanism would instantly disturb\nit. Note also the use of the word ‘tend’ in the description of this mechanism:\n13This false assumption – analogous to the uniformity assumption discussed in Subsec-\ntion 1.2 – was actually made by J P Joule before the advent of statistical mechanics. This\nis discussed by us in [3].\n8 M Machover\nwhat is meant by it is that a more energetic molecule is more likely to slow\ndown than to speed up, not that it will always do so.\nAnother important feature of this physical system is the distinction be-\ntween macro-state and micro-state. A macro-state can be described by some\nglobal data, such as the total energy of the gas, its volume, as well as some\nstatistical data that will be mentioned below. A micro-state is described by\nan enormous number of data: the position of each molecule (given by its three\nspace coordinates) and its momentum (given by three independent numerical\ncomponents). The number of these data is called the number of degrees of\nfreedom of the system. And the system in question has a great many. Thus,\nto each macro-state there corresponds a very large set of micro-states.\nThe notion of equilibrium of such a system refers to the macro level. It\ndoes not imply that all the molecules are motionless – they never can be,\nfor this would happen only at 0◦K, which is unattainable – but that the\nmacro-state remains unchanged unless perturbed by external forces.\nAmong the data characterizing a macro-state are the statistical distri-\nbutions of the individual molecules’ energies, speeds and positions. In par-\nticular, an equilibrium macro-state is characterized by specific distributions,\nwhich are supposed to stay unchanged in the absence of external perturba-\ntion.14\nEven such a macro-equilibrium does not exist in actual reality, because\nno system can in practice be perfectly isolated from external interactions.\nNevertheless, fairly close approximations to it – good enough for practical\nand even for many theoretical purposes – do actually exist: this is what\ninsulation is all about.\n2.2 Economic equilibrium\nThe analogy between the kind of system just described and an economy need\nhardly be spelt out.\nThe fundamental error of the uniformity assumption is that it conceptu-\nalizes the market forces driving the economy towards an ideal equilibrium as\nendogenous, while the disequilibrating forces perturbing the system are con-\nceptualized as exogenous. But the latter surely include also market forces,\nthe forces of competition. This is an untenable logical inconsistency.\nThe trouble with the kind of ideal equilibrium assumed in Subsection 1.1\nis not that it is purely ideal but that it is prevented from occurring by the\n14Note that this is quite another matter from the micro-state staying unchanged. Sim-\nilarly, if the age distribution of a population is unchanged, it does not follow that each\nmember of it remains of constant age.\nStochastic Equilibrium 9\nvery forces that are supposed to drive the economy towards it.\nThe distinction between macro-state and micro-state is surely valid in\neconomics no less than in statistical mechanics. And if a model of a capi-\ntalist economy is to have any verisimilitude, it must possess a large number\nof degrees of freedom: a micro-description must include detailed data on\nthe simultaneous states of a great multitude of agents and the transactions\nbetween them.\nThe concept of economic equilibrium surely makes sense only as a macro\nconcept, which is compatible – indeed presupposes – great mobility at the\nmicro level. Basic economic quantities such as the rate of profit of an enter-\nprise and unit prices must be conceptualized as random variables, which at\nequilibrium have specific distributions rather than determinate values.\nSuch a representation is needed even if in the end one is only interested\nin relations between the equilibrium mean values of these quantities. These\nmean values cannot, generally speaking, be taken in advance as reasonable\napproximations for the random variables themselves. The reason for this is\nthat a given functional relation that holds between random variables does\nnot, in general, hold between their means.15\nFinally, simple observation suggests that a real economy of a country is\nmost of the time not all that far from what common sense would regard\nas macro-equilibrium. Macro quantities, such as annual GNP, the level of\nemployment, or the statistical distribution of incomes, do not change very\nrapidly except at some critical moments, when instability becomes evident.\nIt is therefore unreasonable to use a theoretical concept of equilibrium that\nis not even approached, let alone attained, by a real economy.\n3 Methodological comments\nLet me end with a couple of methodological comments.\nFirst, a mathematical model of a complex real system need not – indeed\ncannot – be realistic in every way. It is not a duplicate of reality but a\nsimplified simulacrum of it. But the vital question is what simplifications\nare acceptable.\nA model can work very well in simulating real behaviour even if it makes\nquite drastic simplifications of some aspects of reality. But it must fail if it\nsimplifies away essential aspects of the reality under investigation. Of course,\nwhat counts as an essential aspect depends on the specific phenomena being\ninvestigated and on the purpose of the investigation.\n15For example, if X,Y and Z are random variables such that XY = Z, it is not in general\ntrue that EX · EY = EZ, where ‘E’ denote the mean operator.\n10 M Machover\nThe thesis that I have argued in this paper is that a non-stochastic concept\nof equilibrium is inappropriate for modelling the behaviour of prices and\nprofits in a capitalist economy.\nOn the other hand, Ian Wright’s paper [7] illustrates how a model that\nis in many ways very simplistic can nevertheless display in a surprisingly\nrealistic way various phenomena of a capitalist economy. Wright’s model\ndoes not impose a deterministic concept of micro-equilibrium; rather, the\nmacro-equilibrium that emerges from it is stochastic.16\nSecond, it is quite fruitful for economic theory to look for concepts it can\nusefully borrow from natural science, particularly physics. Of course, by no\nmeans all physical concepts can be borrowed, or have useful analogues in\neconomics.\nSome specifically physical concepts – such as mass, force field, three-\ndimensional physical space, four-dimensional space-time, mechanical micro-\nequilibrium, and perhaps even energy (in the sense in which it features in\nthe law of preservation of energy) – need not have useful applications or\nanalogues in economic theory. On the other hand, more general concepts\nthat originated in physics and engineering – such as feedback, degrees of\nfreedom, steady state, macro-equilibrium, and perhaps entropy – seem to be\nquite usefully applicable.\n16I am grateful to Ian Wright for the following comment on a draft of the present paper:\n‘You may want to note that Econophysics is a relatively new field that has extensively used\nstatistical equilibrium concepts with some success (particularly in providing very simple,\nabstract and satisfying explanations of the detailed income distribution). Your book [2]\npresaged this development by some years.’\nWright’s work is presented and amplified in a forthcoming book by Cottrell et al. [1].\nStochastic Equilibrium 11\nReferences\n[1] Cottrell A, Cockshott P, Michaelson G and Wright I 2006: Information,\nMoney and Value draft manuscript.\n[2] Farjoun F and Machover M 1983: Laws of Chaos: A Probabilistic Ap-\nproach to Political Economy ; London: Verso\/NLB.\n[3] 1985: ‘Probability, economics and the labour theory of value’, New\nLeft Review 152:95–108.\n[4] Langston R, Mandel E and Freeman A 1984: Ricardo, Marx, Sraffa : the\nLangston memorial volume; London: Verso\/NLB.\n[5] Schwartz J T 1961: Lectures on the Mathematical Method in analytical\nEconomics ; New York: Gordon and Breach.\n[6] Steedman, I 1977: Marx after Sraffa; London: NLB.\n[7] Wright, I 2005: ‘The social architecture of capitalism’, Physica A\n346:589–622.\n"}