{"doi":"10.1080\/09687760108656776","coreId":"14093","oai":"oai:generic.eprints.org:758\/core5","identifiers":["oai:generic.eprints.org:758\/core5","10.1080\/09687760108656776"],"title":"Student ‘voices’ and course development: reading the signs on a distance course in educational technology","authors":["Slaouti, Diane"],"enrichments":{"references":[{"id":194745,"title":"A framework for evaluating the use of educational technology',","authors":[],"date":"1997","doi":null,"raw":"Oliver, M. (1997), 'A framework for evaluating the use of educational technology', BP ELT report  No.  1,  University  of  North  London,  available  online  at http: llwww, unl.ac, ukltltcleltleltl, htm, [last accessed 30.10.00].","cites":null},{"id":194738,"title":"ccounting for failure: participation and non-participation in CMC',","authors":[],"date":"1989","doi":null,"raw":"Grint, K. (1989), ~ccounting for failure: participation and non-participation in CMC', in R.  Mason  and  A.  Kaye (eds.),  Mindweave:  Communications,  Computers  and  Distance Education,  Oxford:  Pergamon  Press,  189-92,  available  online  at  http:llwwwicdl. open. ac. uk\/mindweave\/mindweave, h tml.","cites":null},{"id":1042036,"title":"Computer learning networks and student empowerment',","authors":[],"date":"1996","doi":"10.1016\/0346-251x(95)00049-p","raw":"Warschauer,  M.,  Turbee,  L.  and  Roberts,  B.  (1996),  'Computer learning networks and student empowerment', System, 24 (1), 1-14.","cites":null},{"id":1042034,"title":"Constructive Internet-based learning',","authors":[],"date":"1997","doi":null,"raw":"Tait,  B.  (1997),  'Constructive  Internet-based  learning',  Active  Learning,  7  [online http  :  l lwww. ilt. ac. uklpubliclctil  A ctive  Learninglal7. html].","cites":null},{"id":1876928,"title":"Developing learning through effective online moderation',","authors":[],"date":"1998","doi":null,"raw":"Salmon,  G.  (1998),  'Developing learning  through effective online  moderation',  Active Learning, 9, available online at http :  \/\/www. ilt. ac. uklresourceslpublicationslal_archivelissue9  l al9.htm.","cites":null},{"id":1042032,"title":"Developing learning through effective online moderation', Active Learning, 9, available online at http :\/\/www.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":194736,"title":"Education at a Distance: From Issues to Practice,","authors":[],"date":"1990","doi":null,"raw":"Garrison,  D.  and  Shale,  D.  (1990), Education  at  a  Distance:  From  Issues  to  Practice, Malabar: Krieger.","cites":null},{"id":194741,"title":"Evaluating a collaborative online learning environment',","authors":[],"date":"1998","doi":null,"raw":"Jones, C. (1998), 'Evaluating a collaborative online learning environment', Active Learning, 9, available online at http:\/\/www, ilt. ac. uk\/resources\/publications\/al_archivelissue91al9.htm.","cites":null},{"id":1042035,"title":"Evaluating Open and Distance Learning,","authors":[],"date":"1988","doi":"10.1080\/0268051042000280165","raw":"Thorpe, M. (1988), Evaluating Open and Distance Learning, Harlow: Longman.","cites":null},{"id":1042029,"title":"Evaluation as illumination: a new approach to the study of innovatory programmes',","authors":[],"date":"1987","doi":null,"raw":"Parlett, M. and Hamilton, D. (1987), 'Evaluation as illumination: a new approach to the study  of  innovatory  programmes',  in  R.  Murphy  and  H.  Torrance  (eds.),  Evaluating Education: Issues and Methods, London: Harper Row Ltd.","cites":null},{"id":194743,"title":"Experiential Learning,","authors":[],"date":"1984","doi":"10.1016\/b978-0-7506-7223-8.50017-4","raw":"Kolb, D. A. (1984), Experiential Learning, Englewood Cliffs, N J: Prentice Hall.","cites":null},{"id":1042037,"title":"Field dependent and field independent cognitive styles and their educational implications',","authors":[],"date":"1977","doi":"10.3102\/00346543047001001","raw":"Witkin, H., Moore, C. A., Goodenough, D. R. and Cox, P. W. (1977), 'Field dependent and field  independent  cognitive  styles  and  their  educational  implications',  Review  of Educational Research, 47, 1-64.","cites":null},{"id":1042031,"title":"Learning styles and instructional design',","authors":[],"date":"1996","doi":"10.1080\/1355800960330405","raw":"Sadler-Smith,  E.  (1996),  'Learning  styles  and  instructional  design',  Innovations  in Education and Training International, 33 (4), 185-93.","cites":null},{"id":1876929,"title":"Matching teaching methods to educational aims in distance education',","authors":[],"date":"1993","doi":null,"raw":"Sparkes, J. (1993),  'Matching teaching methods to educational aims in distance education', in D. Keegan (ed.), Theoretical Principles of Distance Education, London: Routledge.","cites":null},{"id":1042033,"title":"Matching teaching methods to educational ims in distance ducation',","authors":[],"date":"1993","doi":null,"raw":null,"cites":null},{"id":194739,"title":"On-line education: a new domain',","authors":[],"date":"1989","doi":null,"raw":"Harasim, L. (1989), 'On-line education: a new domain', in R. Mason and A. Kaye (eds.), Mindweave: Communications,  Computers and Distance Education, Oxford: Pergamon Press, 50-62, available online at http  :  \/  Iwww-icdl.  open. ac. uk\/mindweave\/mindweave, html.","cites":null},{"id":194740,"title":"Online Education: Perspectives on a New Environment,","authors":[],"date":"1990","doi":"10.5860\/choice.28-0430","raw":"Harasim, L. (1990), Online Education:  Perspectives on a  New Environment,  New York: Praeger Publishers.","cites":null},{"id":1876921,"title":"Slaouti Student 'voices' and course development: reading the signs on a distance course","authors":[],"date":"2000","doi":"10.1080\/09687760108656776","raw":"71 Diane Slaouti  Student 'voices' and course development: reading the signs on a distance course Jones, C., Asensio, M. and Goodyear, P. (2000),  'Networked learning in higher education: practitioners' perspectives', Alt-J, 8 (2), 18-28.","cites":null},{"id":194737,"title":"Some CMC discourse properties and their educational significance',","authors":[],"date":"1989","doi":null,"raw":"Graddol, D. (1989), 'Some CMC discourse properties and their educational significance', in R. Mason and A. Kaye (eds.),  Mindweave:  Communications,  Computers and Distance Education,  Oxford:  Pergamon  Press,  236-41,  available  online  at  http:llwwwicdl. open. ac. uk\/mindweave\/mindweave, html.","cites":null},{"id":194742,"title":"Student 'voices' and course development: reading the signs on a distance course","authors":[],"date":"2000","doi":"10.1080\/09687760108656776","raw":null,"cites":null},{"id":1042030,"title":"Styles and strategies of learning',","authors":[],"date":"1976","doi":"10.1111\/j.2044-8279.1976.tb02305.x","raw":"Pask,  G.  (1976),  'Styles  and  strategies  of  learning',  British  Journal  of  Educational Psychology, 46, 128-48.","cites":null},{"id":194744,"title":"The implications of the research literature on learning styles for the design of instructional material',","authors":[],"date":"1999","doi":null,"raw":"McLoughlin, C. (1999),  'The implications of the research literature on learning styles for the design of instructional material', Australian Journal of Educational Technology,  15 (3), 222-41, available online at http:llwww.cleo.murdoch.edu.aulajetlajetl5tmcloughlin.html [last accessed 29.10.00] Moore,  M.  (1993),  'Theory of transactional  distance',  in D.  Keegan  (ed.),  Theoretical Principles of Distance Education, London: Routledge.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001","abstract":"Learning occurs through processes of interaction with course components. A major part of the interaction will be between learner and instructional material, but tutors and co-learners will form part of the interactions that make up the whole. The nature of these interactions may be both academic and pastoral and in many distance courses are effected through Computer-Mediated Communication (CMC) tools. CMC data represents a record of short-term negotiations and progress but this paper argues that they can find an important place in course evaluation and development procedures. The paper draws on evidence gathered during the delivery and support of a distance course in educational technology for teachers of English as a second language at the University of Manchester. It illustrates how threads of communication provide illuminative evaluation data as they are mapped against events and stages in the lifetime of a course, that is interactions with instructional content, tutors, co-learners. This process of description and interpretation clearly impacts on course developmen","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14093.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/758\/1\/ALT_J%2DVol09_No1_2001_Student_%E2%80%98voices%E2%80%99_and_course_de.pdf","pdfHashValue":"57aad76add3aa4c509c8b39873f1a164637e8e94","publisher":"Taylor and Francis Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:758<\/identifier><datestamp>\n      2011-04-04T08:54:13Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/758\/<\/dc:relation><dc:title>\n        Student ‘voices’ and course development: reading the signs on a distance course in educational technology<\/dc:title><dc:creator>\n        Slaouti, Diane<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Learning occurs through processes of interaction with course components. A major part of the interaction will be between learner and instructional material, but tutors and co-learners will form part of the interactions that make up the whole. The nature of these interactions may be both academic and pastoral and in many distance courses are effected through Computer-Mediated Communication (CMC) tools. CMC data represents a record of short-term negotiations and progress but this paper argues that they can find an important place in course evaluation and development procedures. The paper draws on evidence gathered during the delivery and support of a distance course in educational technology for teachers of English as a second language at the University of Manchester. It illustrates how threads of communication provide illuminative evaluation data as they are mapped against events and stages in the lifetime of a course, that is interactions with instructional content, tutors, co-learners. This process of description and interpretation clearly impacts on course development<\/dc:description><dc:publisher>\n        Taylor and Francis Ltd<\/dc:publisher><dc:date>\n        2001<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/758\/1\/ALT_J-Vol09_No1_2001_Student_%E2%80%98voices%E2%80%99_and_course_de.pdf<\/dc:identifier><dc:identifier>\n          Slaouti, Diane  (2001) Student ‘voices’ and course development: reading the signs on a distance course in educational technology.  Association for Learning Technology Journal, 9 (1).  pp. 62-72.  ISSN 0968-7769 (print)\/1741-1629 (online)     <\/dc:identifier><dc:relation>\n        10.1080\/09687760108656776<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/758\/","10.1080\/09687760108656776"],"year":2001,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Student 'voices' and course development: \nreading the signs on a distance course in \neducational technology \nDiane Slaouti \nFaculty of Education, University of Manchester \nemail: diane,slaouti@.rnan.ac.uk \nLearning occurs through processes of interaction with course components. A major p rt \nof the interaction will be between learner and instructional material, but tutors and co- \nlearners will form part of the interactions that make up the whole. The nature of these \ninteractions may be both academic and pastoral and in many distance courses are \neffected through Computer-Mediated Communication (CMC) tools. CMC data \nrepresents a record f short-term negotiations a dprogress but this paper argues that \nthey can find an important place in course valuation and development procedures. The \npaper draws on evidence gathered during the delivery and support of a distance course in \neducational technology f r teachers of English as a second language at th  University of\nManchester. _It illustrates how threads of communication provide illuminative evaluation \ndata as they are mapped against events and stages in the lifetime of a course, that is \ninteractions with instructional content, tutors, co-learners. This process of description \nand interpretation clearly impacts on course development. \nIntroduction \nWhether in face-to-face or distance mode, courses result not-simply from informed input \nand pedagogic planning from an academic team but, as Thorpe (1988: 120) maintains from \n'a process of interaction between the learner and any materials, taff or facilities associated \nwith the achievement of [those courses]'. This synergy suggests that learners have a pivotal \nrole to play not only in revealing the short-term effectiveness of instructional design and \nteaching strategies but also in contributing to their long-term development. This is not \ndisputed, as reflected in the place that formal evaluation tools have on most courses. How- \never, many formal course evaluation procedures tend to take a snapshot from the vantage \n62 \nA\/t-] Volume 9 Number I \npoint of final impressions. A comment that suggests 'instructional materials were effective' \ndoes not tell the real story of how a learner has interacted with those materials along the \nway. This paper argues for illuminative valuation (Parlett and Hamilton, 1987) processes \nas a contributor to the development of distance learning practice in local contexts. \nThe primary concern of illuminative valuation is to look at 'what actually happens (as \nopposed to what is supposed to happen)' (Rea-Dickins and Germaine, 1992: 26). As such it \ndraws on ethnographic procedures as it is 'an intrinsically descriptive task that resists \nformalisation [whose] methods rely on the study of people and their activities in their \nnatural environment' (Jones, 1995:31). \nIn distance learning contexts, the opportunity to observe, describe and explain activities \nand interactions (Oliver, 1997) depends very much on a specific model of transaction. \nDistance courses may be described as having lesser or greater transactional distance \n(Moore, 1993: 23). If there is greater structure within course materials, there tends to be a \ngreater transactional distance between learner and tutor. The materials designer places \ngreat store on the materials themselves in guiding the learner but opportunities for tutors \nto see how learners are interacting with those materials will be dependent upon provision \nfor dialogue built into the course design. \nDialogue, as exemplified in the potential of computer-mediated communications, not only \nreduces transactional distance but brings with it greater opportunity for tutors to act as \n'participant observers' (Elliott, 1991: 27). It is not, however, simply the elements of \ndialogue (that is transcripts of computer conferencing events) that reveal the full story. \nJones (1998) suggests that analysing transcript alone ignores vital activities which impact \non and help to explain events urfaced through dialogue. In terms of course valuation the \ndescriptions of learner thought and reaction through computer-mediated dialogue can \nonly be interpreted in relation to the other components of the interaction triad: the \ninstructional materials themselves and tutor interventions. \nContext of study \nThe learners are practising teachers undertaking a distance Masters degree in Educational \nTechnology and English Language Teaching, a modular degree aiming to develop both \nskills and pedagogic understanding. The programme is supported by the use of computer- \nmediated communications (individual email between learner and tutor, course-related \ndiscussion lists, and synchronous tutorials using MOOS). The course focused on in this \npaper develops the participants' abilities to create language learning materials in Asymetrix \nToolbook. This study draws on data from a group of sixteen participants based around the \nworld. \nCourse design \nParticipants receive an in-house tutorial written in Toolbook which develops their basic \nprogramming skills whilst producing a piece of reading skills courseware. The rationale \nbehind the tutorial is to provide a familiar conceptual framework for language teachers \nand to provide experience of computer-based l arning before the learners design their own \nmaterials in response to needs in their current eaching context. This experiential learning \napproach (Kolb, 1984) is fundamental to the methodology of  the degree programme as a \nwhole. It aims to provide for 'reflective conceptualisation a d practical experience' (Tait, \n63 \nDiane Slaout~ Student 'voices' and course development: reading the signs on a distance course \n1997: 2), allowing practising teachers to draw on their current knowledge base and their \ncurrent eaching contexts and develop further their understanding of skill and process. The \nteachers' understanding of relevant theoretical concepts is guided through supplementary \nprint and Web-based reading. A discussion list encourages support and exchange within \nthe course community. The following can thus represent the interactions within the course: \nI computer-based tutorial input ~ creation ofindividual teaching materials \/ \n\\ \n\/ • reading and research into effective design of CALL I~ \nstudents \ntutor \nstudents \nFigure I: A conceptual map of interactions with course. \nMethod \nComputer-mediated communications evidently provide a source of ongoing data. The \nmessages sent to the discussion list and to individual tutors are archived and these were \nlooked at in terms of threads involving various combinations of student-tutor, \nstudent-student-tutor interactions. As argued previously, however, threads of exchange \nare not to be read in isolation from other events that go to make up the whole of a course. \nThey form a partial picture that can be described but only interpreted in relation to a larger \nscenario. A thread can, therefore, be analysed in terms of learner message, tutor \nintervention, point in course (relevant to design of instructional material or recognizant of \na stage in knowledge construction). \npoint in course map \ntutor in tervent ions~ \n% \n[-] [--1[ [~amer~s~ messages \nFigure 2: Relationship between tutor interventions, tudents and point in course map. \nFindings \nI have drawn on a number of findings from the data that illustrate the process of \nillumination. I will focus on analyses that provide insight into the design of the course and \nits materials, tutor interventions and the role and expectations of the course community. \n64 \nAlt-J Volume 9 Number I \nCrit ical  moments  in the l i fet ime of a course \nSituating learning \nThis course requires learners to transfer learning through the course materials (CBT and \nsupported reading) to their own contexts, to begin to situate it for themselves. This process \nof transfer is critical to successful learning. Garrison and Shale (1990: 37) suggest 'the \nmost important aspect of the educational transaction iswhat happens after the student has \nbeen presented with the content. In distance education this presents a special problem. \nWith the teacher and student being separated, greater effort is required to understand the \ncommunication process o vital to supporting the learning activity.' \nMany of the threads examined indicated egrees of uncertainty in that transfer. \nHi Gary \nI've been through the tutorial and think it was great. But now I am sitting in front of a \nblank Toolbook page and I just don't know where to begin. It seemed so easy as I was \nworking through the tutorial - has anyone lse said they've got similar concerns? \n[extract 1] \nHi Diane \nI find the CELSE tutorial 10 times better than the one from Toolbook itself. However, I \nhave got stuck on the button drawing stage and thus am making zero progress. I select \nthe button I want from the palette, the cross symbol appears and I position the cross \nwhere I want the button to appear and then (regardless of which mouse button I \nclick\/double click) nothing happens! I've done this numerous times. Am I never going to \nget past the starting line? \n[extract 2] \nSimilar messages were received from over half of the course participants. Figure 3 \n[escribes the pertinent components of this interpretation: \npoint in course map \ntransition from tutorial \nto creation of learning \nmaterials \ntutor interventions \n(encouragement to begin to V \nplan learners' own materials) \n% \n( individual messages learner - tutor) \nFigure 3: Example of tutor~student-situated intervention. \nThe messages were on the whole not critical of the course content. Indeed formal, \nretrospective evaluation processes also elicited very positive opinions on the whole. What \nthese messages do reveal is a critical moment in the lifetime of this course. It is interesting \nto note that most of such threads happened away from the discussion list, that is they were \n65 \nDiane Slaouti Student 'voices' and course development: reading the signs on a distance course \nnot shared moments of coming to know but declarations of uncertainty between student \nand tutor. They were, however, threads that were being replicated in several private \nexchanges. Drawing on Salmon's research into online moderation (1998) it was clear that \nwe were straddling a moment in which information-sharing, a potential support to \nmembers of the group as they began to transfer their understanding to their own contexts, \nwould benefit from clearer encouragement. The following indicates a tutor intervention \nthat became an overt strategy to help to develop information-sharing and co-operative \nworking: \nHi all \nJohn emailed me asking for help in where to start with his Toolbook project and I \nthought as I was typing, maybe my response might help others who hadn't yet got an \nidea formulated. The best place to start is with what you as teachers know about sound \nteaching approaches. \n[extract 3] \nThis message continues with a personal example of how the tutor developed her own piece \nof material for a group of teacher trainees. The fact that the reply was turned back to the \nlist drew further descriptions of what people had in mind for their projects. \nImpact of assessment \nOn the whole requests for help with problems in the early stages of the course may have \nexhibited frustration ('Am I never going to get past the starting line?') but generally implied \na sense of trust and belief that support would be eventually effective. Learners were often \napologetic about not being able to resolve a problem despite sequences of messages trying \nto guide them to a resolution ('I'm really sorry but I still can't yet see how this can work'). \nHowever, the following illustrates a different type of message: \nSince receiving your message about runtime, I spent he best part of a day trying to work \nout what to do. I agree with Ed about people who are not too skilled encountering \nproblems - I am definitely one of them. The point I am trying to make is an awful ot of \ntime is being wasted on things that seem very easy to the skilled computer \nusers\/experienced users of Toolbook. As deadlines are looming, panic takes over. \n[extract 4] \nFigure 4 represents he relevant descriptions that help to interpret this message. \ntutor interventions~ \n(instructions to help set programs up, \nsent  out in email messages to the list) \npoint in course map Kr-~\"~ \n(towards the end as \nsomelearnersare ~ ~:]1 mes~a~e.~ \nready to trial) \n(thread of exchanges (thread ends withextract 4) \ntutor + 5 learners) \nFigure 4: Interpretation ofthe message. \n66 \nAIt-J Volume 9 Number I \nThis message culminates a thread to which this particular student had until now not \ncontributed. It happened towards the end of the course, as some students were ready to \npackage their programs. The message refers to another student's eemingly similar lament \n(Ed) but this was not in fact part of this current hread. \nThis message, therefore, needs to be situated in relation to all of these factors. It is close to a \npending deadline (assignment submission); it provides ome insight into overall pacing and \nscaffolding for different course participants. Learners who were able to develop on their own \ntook best advantage of the course as it stood. They also began to dominate the discussion \nlist, driving forward a focus on relatively complex issues. This engendered a feeling of 'second \nclassness' in this respondent (explored below) and pointed to a gap in the course provision. \nHowever, this thread, whilst indicating a need for some further reflection on how we \nprovide better support for some of the operational procedures related to developing \ncourseware, engendered a further thread which provided pleasing signs of how the \ncommunity had developed. Advice on how the course might be developed for future \ngenerations of students arose out of this description of short-term need: \nA general problem with the user manuals and the online help is that they describe the \nfunctions of toolbook, but what most of us need is a 'how to achieve certain learning \ntasks' manual (I find wading through the manuals very disheartening attimes.) The most \neffective help I've received is via the email list. It might be useful to develop a \ntroubleshooter manual out of this for future generations of md319ers as they are bound \nto experience the same problems as we have. \n[extract 5] \nThis suggestion was taken further in the form of exemplar tasks and scripts in the course \nrevision. \nStrategic lessons in cognitive style and tutor intervention \nSparkes (1993: 139) discusses the implications of trying to match teaching methods to \neducational aims and refers to the work of Pask (1976) in considering the need to take \naccount of variety of cognitive approach to learning within individual earners. Pask's \nwork describes learners as 'holist' or 'serialist' in the way in which they process \ninformation; as 'verbalizers' and 'visualizers' in their representation of information in \nmemory. Sadler-Smith (1996), referring to these dimensions following the work of Witkin, \nMoore, Goodenough and Cox (1977) as 'wholist' and 'analytical' and 'verbalizer' and \n'imager,' suggests that 'one may anticipate beneficial effects on learning performance if the \nmode and structure of the presentation of information respectively compensate for, and \nare matched to, the learners' cognitive styles' (p. 189). However, the exact nature of such \nprovision will vary from course to course. In the course under study, a number of threads \nwould appear to provide some direction as to needs that might be satisfied in course \ndevelopment procedures. \nDid instructional design satisfy the wholist and analytical learner? \nThe instruction in this course is carried largely in the early stages by the computer-based \ntutorial. It was clear that whilst the tutorial was well received by many in the first-year \ngroup, there was evidence that this did not suit all. At the time students were reticent to say \n67 \nDiane Slaouti Student 'voices' and course development: reading the signs on a distance course \nit was the mode of learning itself. Perhaps they did not know exactly why they found it \ndifficult. In a revised dispatch of the course, the students were provided with print \nmaterials covering much the same ground as the computer-based tutorial. One student, \nwho had actually never finished the original course, restarted. \nDear Diane \nI'm well into my md319 and must say your Toolbook unit was really helpful. Just what I \nneeded I suppose. I not only managed to do it but actually started to be able to \nunderstand and correct mistakes I had made last time round. So, thanks to you for an \nextremely user-friendly design of the material for us. I wonder how other people got on \nwith the tutorial? Am I the only one not to have managed? \n[extract 6] \nWhen quizzed further: \nI don't know what it was - I never really got a sense of where I was going. I know the \ntutorial was actually very thorough but I suppose I couldn't see what the final thing was \nsupposed to look like - I hadn't planned what I was going to do myself and I didn't have \nan example of the finished program like you have now. I also find I work much better \nhaving a paper-based booklet o refer to as I'm constructing the program too. \n[extract 7] \nThis evidently dashed our hopes of providing a computer-based learning experience as \npart of the learning process but this aim had clearly been to the detriment of this particular \nlearner. More wholist needs evident in the further message were attended to quite easily. \nThe reading programme that was to be reconstructed was first presented in the revised \nmaterial as an evaluation task encouraging reflection on its pedagogic approach..In essence \nthis now formed an advance organizer providing a sense of global direction (McLoughlin, \n1999). \nDid the instructional materials satisfy the verbalizer and the \nimager? \nThe hands-on tutorial breaks down the process of designing a specific piece of courseware \nand guides the user through a combination of visual screenshots and text instruction. This \nwould, therefore, appear to provide for different representations of information and this \ndrew no explicit comment. As learners move on to construct their own materials, support is \nprovided via email, that is in text format. Thus tutor support was a focus of analysis for us \nas we sought to develop our own understanding of online teaching and learning. \nThere were clear examples of students responding to different ypes of support within the \nemail mode. Referring back to extract 2, this message began a thread of six messages \nduring which the learner's problem was not resolved. The drawing of navigational buttons \nwithin the authoring tool is a prerequisite of program design and the frustration evident in \nthis first message developed. The tutor then tried a different strategy. Using Lotus \nScreencam, which enables the capture of all moves on a user's computer screen in a visual \nmedia file, the process of creating and manipulating the desired buttons was recorded, \nsaved as an exe file and emailed as an attachment to the student. This is the message that \nfollowed: \n68 \nAir-] Volume 9 Number I \nThe software is excellent - I could see straight away what I had to do and it worked. \nThanks! My next problem is related to syntax but I'll have a go at solving the problem \nmyself irst. I think I may have created too many pages. \n[extract 8] \nIt is interesting that the learner clearly responded so immediately to the visual support, but \nalso the second idea suggests that, having been helped over this block, the learner shows \nsigns of being determined to tackle a new problem by himself. Similar declarations of \nincreased autonomy are evident from another student: \nWent back for another look at the Screencam and have worked out the answers to both \nmy questions that I have asked you in my last email! I'd missed 'end' off the script and \nthen realised that to reset he page you just have to go to the next page! \n[extract 9] \nThis message xamined against other interventions from the tutor provides further einforce- \nment to the evidence of different cognitive styles. The problem referred to is in fact a textual \none, that is the missing off of the word 'end' from the programming script. The relevant script \nhad been emailed in full in text form but the student had not ransferred this correctly. In the \nScreencam version, the student watches as the tutor 'types in' the script on the screen in front of \nthem. The student is therefore visually processing emerging text as it is being written dynamic- \nally. Another student, however, was less than happy with the Screencam type approach. \nI hate those demo things you get with computer software and I think that's why I didn't \nlike Toolbook's own showme type tutorial. I just can't absorb it like that. \n[extract 10] \nReviewing expectations of community \nFigure 1 makes clear that there was an expectation of computer-mediated communications \nproviding for a sense of community as well as for individual support from tutors to \nstudents. The notion of networked community in support of learning is well documented \n(e.g. Harasim, 1989; Salmon, 1998). However, two critical issues arose through analysis of \nthe data relating to this course: the shifting nature of moderator oles to enable the \nbuilding of a supportive and interactive community and the potential of that community \nto act not only as support but also threat o its members. \nBuilding community \nMessages during the running of this course bore clear evidence of the supportive nature of \nsuccessful community development but this needed working at. In the early threads the \nmessages may have been posted to the list, but the threads consist of student-tutor \nexchanges in fairly rapid succession. This was of course received very positively by students \nbut it led to a dependence on tutor response and support. On occasions when response was \nnot so immediate for whatever teas'on, messages such as the following were evidenced: \nIt appears that T is too busy marking assignments o deal with problems - even from his \n#1 fan. Is there anyone else who can help? I especially need help deleting unwanted \nbackgrounds and pages. Thanks in advance. \n[extract 12] \n69 \nDiane Slaouti Student 'voices' and course development: reading the signs on a distance course \nThis message was in fact quickly followed by a response from one of the 'quieter' group \nmembers: \nI think I may be able to help. I had exactly the same problem when I started out - I was \nclicking on New Background rather than New Page every time I want to add a page! You \ncan get rid of them quite easily by going to the edit menu and click on select page then \nagain on the edit menu click delete selection. Hope this helps. \n[extract 13] \nThis thread revealed that we had not nurtured terribly successfully the potential of the \ncommunity to provide support. Graddol (1989: 238) talks of the 'burden of social \nmaintenance' required in CMC contexts, to develop a sense of belonging and mutual \ndependence. In the second run of the course, we made explicit he advantages of belonging \nto the community of growing expertise and consciously allowed time and space for other \ncontributions in response to queries. \nCommunity as threat \nStudents reported being generally very positive about the role of the discussion list in \nsupport of their learning. Contributions to the list, however, varied over time in both \nfrequency from individual members and in moments chosen to post. \nI hope you don't mind this direct to you? I'm a bit worried about my program design. \nI 'm only using text in my business program. They do their actual work in Word. Maybe I\nshould be putting everything into Toolbook? It's not very technical really. Maybe I \nshould be using more media and getting them to do more complex tasks? \n[extract 14] \nThe opening line of this message is key to this student's ense of insecurity at this moment \nduring the course. This message followed a number of outlines of project (information- \nsharing) in response to extract 3. This is clearly prompted by a comparison between the \nstudent's own plans and those she has read about. It also points to the sense of exposure that \ncan be attributed to online contributions that once committed via the send button are not as \nephemeral as spoken interactions (Grint, 1989). This sense of exposure can be evident at \ndifferent points in a course and as tutors we are aware of the sensitivities of students who \nmay wish to contribute or may at times prefer to lurk and communicate in less public ways. \nI l luminat ive evaluation: a tutor 's  perspect ive \nThere is no doubt that the process of analysis and reflection illustrated in this paper \nbenefits from the growing experience of the tutor. In my own early days of distance \nteaching, there was a tendency to react rather quickly to isolated comment that suggested \nsomething was not quite right with the course content or delivery, that is I failed to situate \nthis within a larger picture of interaction. A problem highlighted by one learner was often \ninterpreted as a problem with the course itself rather than as an issue that might have had \nmore significant relevance to a specific point in time or in relation to a specific learner \nneed. Experience has shown how important that bigger picture is, and I would suggest that \ndistance course evaluation procedures should take cognizance of illuminative procedures \nat their design stage. \n70 \nAIt-J Volume 9 Number I \nThere is also no doubt hat the fact that there was more than one tutor involved facilitated \nthe reflection and interpretation. Again dialogue is a key factor in this process. However, \nilluminative evaluation isa tool of the reflective practitioner (Elliott, 1991). The success of \ninteractions between learners, tutors and course content is dependent on constant \nobservation and review, no matter whether this is in face-to-face or distance contexts. \nMoreover, I would suggest that this contributes, as does reflective practice generally, to the \nprofessional development of the distance tutor. This analysis demonstrates that computer- \nmediated communications ot only establish contact between the various people involved \nin a course but, equally importantly, provide the feedback that ensures the development of\nthe skills and understanding of the distance tutor. \nConclusion \nJones (1998: 32) acknowledges a potential tension between 'ethnographic stress on \ndescription and the prescriptive requirements of evaluation'. However, the purpose of \nevaluation is to 'see' how learners are interacting with the course provided and this act of \n'seeing' isa dynamic one, possible only in procedures which capture the process rather than \nthe end product. Ethnographic description becomes illuminative valuation i  the process \nof interpretation. That interpretation, as argued in this paper, relies on a triangulation of\nviews of the essential interactions within a course, in this case between learner and instruc- \ntional material, between learner(s) and tutors. It is through CMC that these interactions \nare visible and provide tangible and meaningful contributions tocourse planning. \nReferences \nElliott, J. (1991), Action Research for Educational Change, Milton Keynes: Open \nUniversity. \nGarrison, D. and Shale, D. (1990), Education at a Distance: From Issues to Practice, \nMalabar: Krieger. \nGraddol, D. (1989), 'Some CMC discourse properties and their educational significance', \nin R. Mason and A. Kaye (eds.), Mindweave: Communications, Computers and Distance \nEducation, Oxford: Pergamon Press, 236-41, available online at http:llwww- \nicdl. open. ac. uk\/mindweave\/mindweave, html. \nGrint, K. (1989), ~ccounting for failure: participation and non-participation in CMC', in \nR. Mason and A. Kaye (eds.), Mindweave: Communications, Computers and Distance \nEducation, Oxford: Pergamon Press, 189-92, available online at http:llwww- \nicdl. open. ac. uk\/mindweave\/mindweave, h tml. \nHarasim, L. (1989), 'On-line education: a new domain', in R. Mason and A. Kaye (eds.), \nMindweave: Communications, Computers and Distance Education, Oxford: Pergamon Press, \n50-62, available online at http :\/ Iwww-icdl. open. ac. uk\/mindweave\/mindweave, html. \nHarasim, L. (1990), Online Education: Perspectives on a New Environment, New York: \nPraeger Publishers. \nJones, C. (1998), 'Evaluating a collaborative online learning environment', Active Learning, \n9, available online at http:\/\/www, ilt. ac. uk\/resources\/publications\/al_archivelissue91al9.htm. \n71 \nDiane Slaouti Student 'voices' and course development: reading the signs on a distance course \nJones, C., Asensio, M. and Goodyear, P. (2000), 'Networked learning in higher education: \npractitioners' perspectives', Alt-J, 8 (2), 18-28. \nKolb, D. A. (1984), Experiential Learning, Englewood Cliffs, N J: Prentice Hall. \nMcLoughlin, C. (1999), 'The implications of the research literature on learning styles for \nthe design of instructional material', Australian Journal of Educational Technology, 15 (3), \n222-41, available online at http:llwww.cleo.murdoch.edu.aulajetlajetl5tmcloughlin.html [last \naccessed 29.10.00] \nMoore, M. (1993), 'Theory of transactional distance', in D. Keegan (ed.), Theoretical \nPrinciples of Distance Education, London: Routledge. \nOliver, M. (1997), 'A framework for evaluating the use of educational technology', BP ELT \nreport No. 1, University of North London, available online at \nhttp: llwww, unl.ac, ukltltcleltleltl, htm, [last accessed 30.10.00]. \nParlett, M. and Hamilton, D. (1987), 'Evaluation as illumination: a new approach to the \nstudy of innovatory programmes', in R. Murphy and H. Torrance (eds.), Evaluating \nEducation: Issues and Methods, London: Harper Row Ltd. \nPask, G. (1976), 'Styles and strategies of learning', British Journal of Educational \nPsychology, 46, 128-48. \nRea-Dickins, E and Germaine, K. (1992), Evaluation, Oxford: Oxford University Press. \nSadler-Smith, E. (1996), 'Learning styles and instructional design', Innovations in \nEducation and Training International, 33 (4), 185-93. \nSalmon, G. (1998), 'Developing learning through effective online moderation', Active \nLearning, 9, available online at http :\/\/www. ilt. ac. uklresourceslpublicationslal_archivelissue9 l \nal9.htm. \nSparkes, J. (1993), 'Matching teaching methods to educational ims in distance ducation', \nin D. Keegan (ed.), Theoretical Principles of Distance Education, London: Routledge. \nTait, B. (1997), 'Constructive Internet-based learning', Active Learning, 7 [online \nhttp : l lwww. ilt. ac. uklpubliclctil A ctive Learninglal7. html]. \nThorpe, M. (1988), Evaluating Open and Distance Learning, Harlow: Longman. \nWarschauer, M., Turbee, L. and Roberts, B. (1996), 'Computer learning networks and \nstudent empowerment', System, 24 (1), 1-14. \nWitkin, H., Moore, C. A., Goodenough, D. R. and Cox, P. W. (1977), 'Field dependent and \nfield independent cognitive styles and their educational implications', Review of \nEducational Research, 47, 1-64. \n72 \n"}