{"doi":"10.1088\/0305-4470","coreId":"71550","oai":"oai:eprints.lancs.ac.uk:712","identifiers":["oai:eprints.lancs.ac.uk:712","10.1088\/0305-4470"],"title":"Secular determinants of random unitary matrices.","authors":["Haake, Fritz","Kus, Marek","Sommers, Hans-Jurgen","Schomerus, Henning","Zyczkowski, Karol"],"enrichments":{"references":[{"id":16346735,"title":"A","authors":[],"date":"1994","doi":"10.1103\/physrevlett.73.142","raw":"Baranger H U and Mello P A 1994 Phys. Rev. Lett. 73 142","cites":null},{"id":16346731,"title":"A and IsmailMEH1995","authors":[],"date":null,"doi":null,"raw":"Muttalib K A and IsmailMEH1995 J. Phys. A: Math. Gen. 28 L541","cites":null},{"id":16346730,"title":"A and Pichard J-L","authors":[],"date":"1995","doi":"10.1051\/jp1:1995128","raw":"Jalabert R A and Pichard J-L 1995 J. Physique I (France) 5 287","cites":null},{"id":16346745,"title":"and Stegun I A (eds)","authors":[],"date":"1970","doi":"10.1090\/s0025-5718-1970-0415962-5","raw":"Abramowitz M and Stegun I A (eds) 1970 Handbook of Mathematical Functions (New York: Dover)","cites":null},{"id":16346743,"title":"Chaos—the interplay between stochastic and deterministic behavior","authors":[],"date":"1995","doi":"10.1007\/3-540-60188-0_84","raw":"˙ Zyczkowski K 1995 Chaos—the interplay between stochastic and deterministic behavior Proc. XXXIst Winter School of Theoretical Physics (Karpacz, 1995) ed P Garbaczewski, M Wolf and A Weron (Berlin: Springer) p 565","cites":null},{"id":16346733,"title":"H and Weidenm¨ uller H A","authors":[],"date":"1991","doi":null,"raw":"Lewenkopf C H and Weidenm¨ uller H A 1991 Ann. Phys., NY 212 53","cites":null},{"id":16346741,"title":"Introduction to Higher Algebra","authors":[],"date":"1964","doi":"10.1017\/s0013091500012888","raw":"Mostowski A and Stark M 1964 Introduction to Higher Algebra (Oxford: Pergamon)","cites":null},{"id":16346728,"title":"Quantum Signatures of Chaos","authors":[],"date":"1990","doi":"10.1007\/978-3-642-05428-0_9","raw":"Haake F 1990 Quantum Signatures of Chaos (Berlin: Springer)","cites":null},{"id":16346736,"title":"Smilanski U and Frenkel A","authors":[],"date":"1991","doi":null,"raw":"Doron E, Smilanski U and Frenkel A 1991 Physica 50D 367","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1996","abstract":"We consider the characteristic polynomials of random unitary matrices U drawn from various circular ensembles. In particular, the statistics of the coefficients of these polynomials are studied. The variances of these `secular coefficients' are given explicitly for arbitrary dimension and continued analytically to arbitrary values of the level repulsion exponent beta. The latter secular coefficients are related to the traces of powers of U by Newton's well known formulae. While the traces tend to have Gaussian distributions and to be statistically independent among one another in the limit as the matrix dimension grows large, the secular coefficients exhibit strong mutual correlations due to Newton's mixing of traces to coefficients. These results might become relevant for current efforts at combining semiclassics and random-matrix theory in quantum treatments of classically chaotic dynamics","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71550.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/712\/1\/a61322.pdf","pdfHashValue":"c24c3e7a0be61f97f5d131577e4344fe24a29b67","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:712<\/identifier><datestamp>\n      2018-01-24T03:16:36Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Secular determinants of random unitary matrices.<\/dc:title><dc:creator>\n        Haake, Fritz<\/dc:creator><dc:creator>\n        Kus, Marek<\/dc:creator><dc:creator>\n        Sommers, Hans-Jurgen<\/dc:creator><dc:creator>\n        Schomerus, Henning<\/dc:creator><dc:creator>\n        Zyczkowski, Karol<\/dc:creator><dc:description>\n        We consider the characteristic polynomials of random unitary matrices U drawn from various circular ensembles. In particular, the statistics of the coefficients of these polynomials are studied. The variances of these `secular coefficients' are given explicitly for arbitrary dimension and continued analytically to arbitrary values of the level repulsion exponent beta. The latter secular coefficients are related to the traces of powers of U by Newton's well known formulae. While the traces tend to have Gaussian distributions and to be statistically independent among one another in the limit as the matrix dimension grows large, the secular coefficients exhibit strong mutual correlations due to Newton's mixing of traces to coefficients. These results might become relevant for current efforts at combining semiclassics and random-matrix theory in quantum treatments of classically chaotic dynamics.<\/dc:description><dc:date>\n        1996<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/712\/1\/a61322.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1088\/0305-4470\/29\/13\/029<\/dc:relation><dc:identifier>\n        Haake, Fritz and Kus, Marek and Sommers, Hans-Jurgen and Schomerus, Henning and Zyczkowski, Karol (1996) Secular determinants of random unitary matrices. Journal of Physics -London- a Mathematical and General, 29. p. 3641. ISSN 1361-6447<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/712\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1088\/0305-4470\/29\/13\/029","http:\/\/eprints.lancs.ac.uk\/712\/"],"year":1996,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"J. Phys. A: Math. Gen. 29 (1996) 3641–3658. Printed in the UK\nSecular determinants of random unitary matrices\nFritz Haake†, Marek Kus´†‡, Hans-Ju¨rgen Sommers†, Henning Schomerus†\nand Karol ˙Zyczkowski†§\n† Fachbereich Physik, Universita¨t GH Essen, 45117 Essen, Germany\n‡ Center for Theoretical Physics and College of Science, Polish Academy of Sciences, PL-02-668\nWarszawa, Poland\n§ Instytut Fizyki im. Mariana Smoluchowskiego, Uniwersytet Jagiellon´ski, ul Reymonta 4,\nPL-30-059 Krako´w, Poland\nReceived 19 January 1996\nAbstract. We consider the characteristic polynomials of random unitary matrices U drawn from\nvarious circular ensembles. In particular, the statistics of the coefficients of these polynomials are\nstudied. The variances of these ‘secular coefficients’ are given explicitly for arbitrary dimension\nand continued analytically to arbitrary values of the level repulsion exponent β. The latter\nsecular coefficients are related to the traces of powers of U by Newton’s well known formulae.\nWhile the traces tend to have Gaussian distributions and to be statistically independent among\none another in the limit as the matrix dimension grows large, the secular coefficients exhibit\nstrong mutual correlations due to Newton’s mixing of traces to coefficients. These results might\nbecome relevant for current efforts at combining semiclassics and random-matrix theory in\nquantum treatments of classically chaotic dynamics.\n1. Introduction\nCircular ensembles of unitary matrices were first considered by Dyson [1] and described\nin detail by Mehta [2]. They are used to describe the quantum statistics of periodically\ndriven systems (see [3] and references therein) and of scattering processes [4]. It is the\nunitary Floquet operator in the first case and the unitary S-matrix in the second that the\nrandom unitary matrices in question attempt to mimic with respect to certain more or less\nuniversal properties. Systems with global chaos in their classical limit and with time reversal\ninvariance either present or strongly broken exhibit the greatest degree of universality in\ntheir statistical properties and tend to fall into one of the universality classes represented\nby the circular orthogonal, symplectic, or unitary ensembles (COE, CSE, CUE). The so-\ncalled Poissonian ensemble (CPE) of diagonal unitary matrices with independent unimodular\neigenvalues has also found applications for certain classically integrable systems. There has\nbeen a recent interest in the analysis of intermediate ensembles of unitary matrices which\ndescribe the crossover between different universality classes [5–7]. Direct links between\ncorresponding Gaussian and circular ensembles have been established lately [8, 9].\nUnitarity constraints imposed on a random matrix of small size N cause a significantly\nnon-Gaussian character of the distribution of matrix elements [10–12]. Moreover, various\nstatistics of unitary matrices from the different circular ensembles depend strongly on the\nmatrix size, and for small N differ a great deal from the asymptotic large N properties. This\nis in contrast to the Gaussian ensembles of Hermitian matrices [2] which tend to display\nlesser sensitivity to the matrix dimension.\n0305-4470\/96\/133641+18$19.50 c© 1996 IOP Publishing Ltd 3641\n3642 F Haake et al\nFor example, the normalized level spacing distribution P(S) suffers a cut-off at S D N ,\nand is close to the Wigner-like distributions only for N upwards of roughly 10. Moreover,\nBaranger and Mello [13] have shown that the distribution of transmission intensities P(T )\nis non-Gaussian for N D 2 and 4, whereas coming close to Gaussian for larger N .\nWe were led to study the secular polynomials of random unitary matrices in an attempt\nat constructing semiclassical quasi-energy spectra for the kicked top under conditions of\nclassical chaos. Periodic-orbit theory can be invoked only insofar as periodic orbits are\navailable. In practice, as for any system for which no simple symbolic dynamics is known,\none can hope to find all periodic orbits with periods no longer than maybe nmax \u0019 10,\ndue to the infamous exponential proliferation. These would allow one to semiclassically\nevaluate traces of powers of the Floquet operator, trFn, with n up to nmax. A Hilbert space\nof dimension N D 2nmax is then accessible since Newton’s formulae [14] (see section 2)\nallow one to express the first nmax coefficients of the secular polynomial in terms of the first\nnmax traces; the so-called self-inversiveness of the secular polynomials of unitary matrices\n[15] then yields the second half of the set of coefficients. The practical applicability of\nperiodic-orbit theory would thus seem severely limited. Inasmuch as the dimension N of\nthe Hilbert space is proportional to the effective size of quantum fluctuations (formally,\nN \/ 1\/h¯) one runs out of periodic orbits just when the semiclassical approximation begins\nto have a raison d’eˆtre.\nTo ease the dilemma just described, one might hope to increase the size of the Hilbert\nspace by throwing dice, according to random-matrix theory, for traces with exponents\nnmax < n < N − nmax. To prepare for such a ‘marriage’ of semiclassical approximations\nwith random-matrix theory we propose to study here secular polynomials of random unitary\nmatrices from various ensembles. A previous first step in this direction was taken in [16],\nwhere the means and the mean squares of the coefficients mentioned were calculated for the\nCPE and the CUE. A related study was presented by Bogomolny et al [15, 17] who gave\nthe distribution of the roots of random self-inverse polynomials.\nEven though the bulk of the work to be presented is analytical we performed extensive\ncomparisons with numerical data on ensembles of unitary matrices. To generate the data\nwe constructed COE and CUE matrices with the algorithm given in [18] and CSE matrices\nas described in [19].\n2. Coefficients of secular polynomials\n2.1. Theory\nThe secular polynomial of a unitary matrix U of size N is defined as\ndet(U − λ) D\nNX\nnD0\n(−λ)naN−n D\nY\ni\n(eiϕi − λ) (1)\nwhere the ϕi are the eigenphases of U and a0 D 1. We are interested in the statistics of the\nsecular coefficients an due to various ensembles of random matrices. We shall characterize\nthese ensembles by their joint densities of the N eigenphases ϕi ,\nd\nβ\nN(ϕ1, ϕ2, . . . , ϕN) D C(β, N)\nY\ni<j\njeiϕi − eiϕj jβ (2)\nwhere C(β, N) is a normalization constant while β, the so-called degree of level repulsion,\ndistinguishes the ensembles: β D 0 for the Poissonian ensemble for which the eigenphases\nare independently and uniformly distributed over the interval [0, 2pi); the circular orthogonal,\nSecular determinants of random unitary matrices 3643\nunitary, and symplectic ensembles are characterized by, respectively, β D 1, β D 2, and\nβ D 4. Occasionally we shall allow the parameter β to range freely among the real numbers.\nAll of the ensembles in consideration are homogeneous inasmuch they do not distinguish\nany particular value of any eigenphase. It follows immediately that the ensemble means of\nall coefficients of the secular polynomial vanish,\nan D\nZ 2pi\n0\ndϕ1 . . . dϕNaNdβN(ϕ1, ϕ2, . . . , ϕN) D 0. (3)\nNext, we are interested in the ensemble averages ana\u0003m which can be obtained from the\ngenerating function\nP\nβ\nN D det(U − λ)(U − µ)† D\nY\nk\n(eiϕk − λ)(eiϕk − µ)\u0003 (4)\nD\nZ 2pi\n0\ndϕ1 . . . dϕNdβN(ϕ1, ϕ2, . . . , ϕN)\nY\nk\n(eiϕk − λ)(eiϕk − µ)\u0003.\nFor λ D eiϕ , µ D eiχ it follows from the periodicity of the integrand that the integral\ndepends on the phases ϕ, χ only through the variable x D ei(ϕ−χ). Thus our generating\nfunction may be written as\nP\nβ\nN(x) D\nY\ni\n(eiϕi − eiϕ)(e−iϕi − e−iχ ) D\nY\ni\nf (ϕi, x) D\nNX\nnD0\nxnjanj2 (5)\nwhere we have introduced the auxiliary function\nf (ϕ, x) D (eiϕ − x)(e−iϕ − 1). (6)\nHence all correlations ana\u0003m for m 6D n vanish. Moreover, one easily shows\njanj2 D jaN−nj2 (7)\nwhich is in accord with the so-called self-inversiveness, aN−n D a\u0003naN [14]; being a\nconsequence of but slightly weaker than unitarity self-inversiveness entails each root of\na polynomial to either lie on the unit circle of the complex plane or to be accompanied by\nits inverse as another root.\nThe variances janj2 are most easily calculated in the Poissonian case β D 0,\nP 0N(x) D C(0, N)\n\u0014 Z 2pi\n0\ndϕf (ϕ, x)\n\u0015N\nD (1 C x)N . (8)\nTherefore janj2 D\n(\nN\nn\n\u0001\nfor β D 0 [16].\nNext, we turn to the case β D 2 which was already treated in [16]. Observing that\nthe function\nQ\ni f (ϕi, x) which we want to average is symmetric in the N phases ϕi and\nthat the density d2N may be written as a product of two Vandermonde determinants we have\n[2, 3]\nP 2N(x) D\nZ 2pi\n0\ndNϕ\n(2pi)N\ndet(ei(m−1)ϕm−i(n−1)ϕm)\nY\nk\nf (ϕk, x) (9)\nwith m, n D 1, 2, . . . , N labelling the rows and columns of the determinant. The integral\nover ϕm can now be pulled into the mth row of that determinant whereupon we immediately\nget\nP 2N(x) D det((1 C x)δ(m − n) − δ(m − n C 1) − xδ(m − n − 1)) D\nNX\nnD0\nxN (10)\n3644 F Haake et al\nwhere δ(m − n) denotes the Kronecker delta. The foregoing generating function entails the\nvariance janj2 D 1 for β D 2.\nA little more effort is required for the orthogonal and symplectic cases (β D 1, 4). In\nthe orthogonal case we again employ the symmetry of the integrand of the N -fold integral in\n(5) to rewrite that integral, which goes over the hypercube 0 6 ϕ1, ϕ2, . . . , ϕN 6 2pi , as N !\ntimes one over the hypertriangle 2pi > ϕ1 > ϕ2 > \u0001 \u0001 \u0001 > ϕN > 0. Within the hypertriangle\nthe product of differences takes the formY\nk<`\njeiϕk − eiϕ` j D\nY\nk<`\n2 sin\n\u0012\nϕk − ϕ`\n2\n\u0013\nD iN(N−1)\/2 det(eimϕ1 , . . . , eimϕN ). (11)\nThe second member in this chain of equated expressions is manifestly positive whereupon\nthe modulus operation can be dropped; the determinant in the last member of (11) has\nits rows labelled by the parameter m which runs in integer steps between (N − 1)\/2 and\n(N C 1)\/2; the label for the columns is the one on the N integration variables. We may\nthus write the generating function as\nP 1N(x) D N !C(1, N)\n\u0002\nZ\nϕ1>ϕ2...>ϕN\ndϕ1 . . . dϕN iN(N−1)\/2 det(eimϕ1 , . . . , eimϕN )\nY\nk\nf (ϕk, x). (12)\nFor the symplectic case we find it expedient to extend the N -fold integral in (5) to a\n(2N)-fold one,\nP 4N(x) D C(4, N)N !\nZ\nϕ1>ϕ2>...>ϕ2N\ndϕ1 . . . dϕ2N\n1...2NY\nk<`\n\u0012\n2 sin\n\u0012\nϕk − ϕ`\n2\n\u0013\u0013\n\u0002\nNY\nkD1\n\u0014\nf (ϕ2k, x)\n\u0012 −∂\n∂ϕ2k−1\n\u0013\nδ (ϕ2k−1 − ϕ2k − \u000f)\n\u0015\n(13)\nwhere \u000f is to be sent towards zero from above. To see the equivalence of the foregoing\nexpression to P 4N as given by (5) with β D 4 we simply integrate by parts with respect\nto the phases with odd labels. Only those terms survive for which the N differentiations\nhave turned precisely those N sine functions into cosines which are assigned vanishing\narguments by the delta functions; the remaining sine functions then come in quadruples as,\nsymbolically, s13s14s23s24 ! s424. We should note in passing that the delta functions in the\nforegoing representation of P 4N reflect Kramer’s degeneracy and that in our definition of the\nsecular polynomial for the symplectic ensemble each of the two-fold degenerate eigenphases\nappears only once.\nThe integral representations (12) and (13) are convenient starting points for an explicit\nevaluation of the generating functions P 1N and P 4N . We propose to start with the slightly\neasier symplectic case.\nIn order to actually evaluate the 2n-fold integral in (13) we once more employ the\nidentity (11) as extended to 2N ordered phases; we then integrate over every second phase\nto get rid of the delta functions. Upon renaming the remaining integration variables as\nϕ2k ! ϕk and letting the positive infinitesimal \u000f go to zero we arrive at\nP 4N(x) D (−1)NC(4, N)\nZ 2pi\n0\ndNϕ det(m eimϕ1 , eimϕ1 , m eimϕ2 , eimϕ2 , . . .)\nNY\nkD1\nf (ϕk, x) (14)\nwith jmj 6 (2N − 1)\/2. Note that we have returned to an integral over an N -dimensional\nhypercube, exploiting the symmetry of the integrand. The difficulty to be coped with now\nlies in the fact that each of the N integration variables appears in a pair of rows of the\nSecular determinants of random unitary matrices 3645\n2N \u0002 2N determinant. At this point it is helpful to express that determinant by a Gaussian\nintegral over complex Grassmann variables as\ndetM D\nZ \u0012 Y\nk\ndη\u0003kdηk\n\u0013\nexp\n\u0012\n−\nX\ni,j\nη\u0003kMklηl\n\u0013\n. (15)\nAccounting for the matrix M from (14) and performing the 2N integrals over the η\u0003 we\narrive at Z 2pi\n0\ndNϕ detM D\nZ \u0012 Y\nk\ndηk\n\u0013\u0014\n− 12\nX\nm,m0\nAm,m0ηmηm0\n\u0015N\nD N !\nZ \u0012 Y\nk\ndηk\n\u0013\nexp\n\u0014\n− 12\nX\nm,m0\nAm,m0ηmηm0\n\u0015\n(16)\nwith the antisymmetric 2N \u0002 2N matrix\nAmm0 D (m0 − m)\nZ 2pi\n0\ndϕ ei(mCm0)ϕf (ϕ, x)\nD 2pi(m0 − m)((1 C x)δ(m C m0) − δ(m − m0 C 1) − xδ(m C m0 − 1)). (17)\nThe labelling of the rows and columns of A is inherited from the ordered-phases form of\nthe Vandermonde determinant (11): both m and m0 run in integer steps from −(2N − 1)\/2\nto (2N − 1)\/2. The remaining Gaussian integral in (16) is easily recognized as the Pfaffianp\ndetA of the antisymmetric matrix A, such that the generating function in search takes the\nform\nP 4N(x) D C(4, N)N !\np\ndetA. (18)\nThe sign of the Pfaffian\np\ndetA must be chosen such that P 4N(x) is positive for positive\nvalues of x, according to the definition of the generating function.\nIn a first attempt at evaluating the Pfaffian one may rejoice in the ease in finding it for\nsmall values of N which latter suggest a surmise for the general variance,\njanj2 D\n\u0012\nN\nn\n\u0013\n1 \u0002 3 . . . (2n − 1)\n(2N − 1)(2N − 3) . . . (2N − 2n C 1) for β D 4. (19)\nThis conjecture will be proven in the appendix.\nWe finally turn to the orthogonal case, taking up the integral representation (12) for\nP 1N(x). For the sake of simplicity let us assume an even dimension N . We start with\nintegrating over the angles ϕi with even indices i, pulling the (2k)th such integral into the\n(2k)th row of the determinant; while that integral at first appears as going over the interval\nϕ2kC1 < ϕ2k < ϕ2k−1 we can hurry to replace the lower limit with zero, simply by adding\nthe N th column to the (N − 2)th, the resulting (N − 2)th to the (N − 4)th and so forth,\nand thus obtain\nP 1N(x) D C(1, N)N !\nZ\nϕ1>ϕ3>...>ϕN−1\ndϕ1dϕ3 . . . dϕN−1iN(N−1)\/2 det\n\u0012\neimϕ1f (ϕ1, x),\n\u0002\nZ ϕ1\n0\ndϕ eimϕf (ϕ, x), eimϕ3f (ϕ3, x),\nZ ϕ3\n0\ndϕ eimϕf (ϕ, x), . . .\n\u0013\n. (20)\nNow the integrand is symmetric in the remaining N integration variables whereupon we\nmay extend the integration range to the N -dimensional hypercube of edge length 2pi and\nmake up by dropping the factor N !, as we have previously done in (14). The analogy with\n(14) in fact goes much further: once more, every integration variable appears in two rows\n3646 F Haake et al\nof the determinant. Going through precisely the same reasoning as before we again incur a\nPfaffian form,\nP 1N(x) D C(1, N)N !\np\ndetB (21)\nwith the slightly more unpleasant antisymmetric matrix\nBmm0 D −i\nZ 2pi\n0\ndϕdϕ0f (ϕ, x)f (ϕ0, x) ei(mϕCm0ϕ0)sign(ϕ − ϕ0). (22)\nHere, the sign function ensures the antisymmetry of the matrix B with jmj 6 (N − 1)\/2.\nAgain, the Pfaffian suggests, by its easily evaluated form for small dimensions N , a guess\nfor the variances,\njanj2 D 1 C n(N − n)\nN C 1 for β D 1. (23)\nWe refer to the appendix for the proof of that surmise for N even or odd.\nUpon inspecting the variances found above for β D 0, 2 and conjectured for β D 1, 4\nwe were led to extrapolate to arbitrary non-negative β as\njanj2 D\n\u0012\nN\nn\n\u0013\n1(1 C β\/2)(1 C β) . . . (1 C (n − 1)β\/2)\n(1 C (N − 1)β\/2)(1 C (N − 2)β\/2) . . . (1 C (N − n)β\/2)\nD\n\u0012\nN\nn\n\u0013\n0(n C 2\/β)0(N − n C 2\/β)\n0(2\/β)0(N C 2\/β) . (24)\nThis expression has poles at β D −2\/(N − 1), −2\/(N − 2), . . . ,−2\/(N − n) and zeros\nat β D −2\/1, −2\/2, −2\/3, . . . ,−2\/(n − 1) for n 6 N\/2. It is thus analytic and positive\nfor all positive β, and it goes to zero for β ! 1. This looks like strong evidence for\nthe general validity claimed before. We shall actually turn the conjecture into a theorem in\nthe appendix. The proof will be based on the fact that (24) is equivalent to the differential\nequation\n∂\n∂x\n\u0012\n1 C β\n2\n\u0012\nN − x ∂\n∂x\n\u0013\u0013\nP\nβ\nN(x) D\n\u0012\nN − x ∂\n∂x\n\u0013 \u0012\n1 C β\n2\nx\n∂\n∂x\n\u0013\nP\nβ\nN(x) (25)\nfor the generating function P βN(x).\n2.2. Numerical results\nWe constructed random unitary matrices U of different sizes according to the algorithm\ndeveloped in [18] for the CUE and the COE and later generalized for the CSE [19]. For each\nsuch matrix we calculated a complete set of N secular coefficients an by first computing the\ntraces of arbitrary powers, tn D tr(Un), via either matrix multiplication or diagonalization;\nNewton’s formulae [14] (see next section) then led to the an.\nPrecise estimates of the variance of any random variable require a much larger sample\nthan estimates of the mean. We therefore present numerical results obtained for large\nsamples of relatively small random matrices (N \u0018 20), although some computations\nperformed for N \u0018 200 provide similar results.\nOur above formulae for the variance janj2 of the secular coefficients involve the index\nn of the coefficient and the matrix size N . The dependence on N saturates for large N .\nFigure 1 shows the dependence on n for a fixed matrix size. Due to the property (7) of\nself-inversiveness this curve is symmetric about n D N\/2.\nThe data of all three ensembles coincide (up to a statistical error) with the theoretical\npredictions. Note that the width of the distribution of coefficients decreases with increasing\nSecular determinants of random unitary matrices 3647\nFigure 1. Variance of the distribution of the nth coefficient\njanj2 obtained from 40 000 matrices of size N D 20 typical\nof COE (\u0003), CUE (\u000e ), and CSE (M). The lines represent\nour analytical results.\ndegrees of repulsion and is smallest for the symplectic ensemble. Additional numerical\ninvestigations confirmed the expectation that the phases of the an are distributed uniformly\nin the range [0, 2pi) for any canonical ensemble.\nEven though the formula (24) for the variance is primarily meant to cover the four\ncanonical ensembles β D 0 (CPE), 1 (COE), 2 (CUE), and 4 (CSE), we could not resist\nthe temptation to test its usefulness for intermediate cases. To this end we constructed\nan ensemble of unitary matrices interpolating between the Poisson and unitary ensembles\naccording to the method presented in [20]. This intermediate ensemble depends on one\ncontrol parameter δ, varying from 0 (CPE) to 1 (CUE). Figure 2 shows the dependence of\nthe variance of the first two coefficients on the matrix size N for δ equal to 0.0, 0.2, 0.4,\n0.7, and 1.0. For each case the value of the parameter β chosen to fit the N dependence of\nja1j2, inserted into (24), provides a fair approximation for ja2j2, and similarly for subsequent\ncoefficients. This astonishing fact reveals a certain validity of the general formula (24) with\nnon-integer values of β for ensembles in between the usual universality classes.\n3. Traces of powers of matrices from circular ensembles\nThe characteristic polynomial of a matrix U is related to the traces of its powers\ntn D tr(Un) D\nNX\niD1\neinϕi (26)\nby\ndet(U − λ) D (−λ)N exp\n\u0012\ntr ln\n\u0012\n1 − 1\nλ\nU\n\u0013\u0013\n. (27)\nExpanding both sides in powers of λ one finds the explicit relations between the an and the\ntn which were already established by Newton [14]. A compact representation is\nan D 1\nn!\n\f\f\f\f\f\f\f\f\f\nt1 1 0 0 \u0001 \u0001 \u0001 0\nt2 t1 2 0 \u0001 \u0001 \u0001 0\nt3 t2 t1 3 \u0001 \u0001 \u0001 0\n\u0001 \u0001 \u0001 \u0001 \u0001 \u0001 \u0001 \u0001 \u0001 \u0001 \u0001 \u0001 \u0001 \u0001 \u0001 \u0001 \u0001 \u0001\ntn tn−1 tn−2 tn−3 \u0001 \u0001 \u0001 t1\n\f\f\f\f\f\f\f\f\f . (28)\nWe infer from (27) that there are only N independent traces t1, . . . , tN . Moreover, for\nunitary matrices for which the eigenphases ϕi are real, the number of independent complex\nparameters is again reduced by a factor of a half. The first N\/2 traces suffice to determine\nall N coefficients an (cf (7)).\n3648 F Haake et al\nFigure 2. Variance of coefficients for crossover CPE–CUE: (a) ja1j2 and (b) ja2j2 as functions\nof the matrix size N . Control parameter δ is equal to 0.0 (Poisson, ♦), 0.2 (\u000f ), 0.4, 0.7 (\u0004), and\n1.0 (CUE, \u000e ), while the level-repulsion parameter β fitted simultaneously for both coefficients\nequals 0.0, 0.06, 0.24, 0.69, and 2.0, respectively.\nClearly, the tn all vanish in the mean for all of the circular ensembles considered here,\ndue to the uniformity of the distribution of the ϕi . For a more complete characterization of\nthe statistics of the traces we propose to calculate their marginal probability densities\nP\nβ\nN,n(t) D δ2\n\u0012\nt −\nNX\niD1\neinϕi\n\u0013\n(29)\nwhere δ2(t) is a two-dimensional delta function in the complex t plane; the ensemble average\nis to be performed with the weight (2). It turns out to be convenient to first calculate the\nFourier transform\nOP βN,n(k) D exp\n\u0012\n− 12 i\nX\ni\n(k e−inϕi C k\u0003 eCinϕi )\n\u0013\n. (30)\nDue to the periodicity of all functions of the phases ϕi involved, the characteristic functionOP βN,n(k) depends on k only through the modulus jkj while the density P βN,n(t) is only a\nfunction of jt j. Henceforth we assume k D k\u0003 D jkj and write\nOP βN,n(k) D exp\n\u0012\n− ik\nX\ni\ncos(nϕi)\n\u0013\n. (31)\nWe immediately obtain for the Poissonian ensemble\nOP 0N,n(k) D J0(k)N (32)\nJ0(k) being a Bessel function. It follows that the densities P 0N,n are the same for all values\nof the exponent n, a rather intuitive result given the statistical independence of the phases\nϕi in the Poissonian case. Equally expected for such a Poissonian random walk is the\nindependence of the mean squared ‘displacement’ of n, jtnj2 D N .\nFor the unitary ensemble, β D 2, we exploit the symmetry of the exponential to be\naveraged in the phases ϕi and employ the analogue of (9) and find the characteristic function\nto take the form of a Toeplitz determinant,\nOP 2N,n(k) D det\n\u0012 Z 2pi\n0\ndϕ\n2pi\neiϕ(`−m) e−ik cos(nϕ)\n\u0013\n`, m D 1, . . . , N. (33)\nSecular determinants of random unitary matrices 3649\nThe remaining ϕ integral again yields Bessel functions and can be written as\nOP 2N,n(k) D det\n\u0012 C1X\nsD−1\nJjsj(k)(−i)jsjδ(` − m C ns)\n\u0013\n. (34)\nClearly, the number of non-zero elements of the N \u0002N determinant here incurred decreases\nas the order n of the trace tn in consideration grows. In particular, for n > N only the\ndiagonal elements are non-zero such that\nOP 2N,n(k) D J0(k)N for n > N. (35)\nAt the other extreme, n D 1, we meet with the full Toeplitz determinant\nOP 2N,1(k) D TN D\n\f\f\f\f\f\f\f\f\nJ0 −iJ1 −J2 \u0001 \u0001 \u0001\n−iJ1 J0 −iJ1 \u0001 \u0001 \u0001\n−J2 −iJ1 J0 \u0001 \u0001 \u0001\n...\n\f\f\f\f\f\f\f\f . (36)\nIntermediate values of n lead to the subdeterminants Tm obtained by cancelling the last\nN − m rows and columns of TN ,\nOP 2N,n(k) D T N−n2 T 2n−N1 for N > n > 12N\nOP 2N,n(k) D T N−2n3 T 3n−N2 for 12N > n > 13N (37)\nand so forth. This can be seen as follows. Starting with N > n > 12N one checks that the\ndeterminant in (34) has non-vanishing elements residing only in the diagonal, J0(k)δ(`−m),\nand in two subdiagonals, −iJ1(k)δ(` − m C n). One moves the (1 C n)th row to become\nthe second, then the (1 C n)th column to become the second and thus isolates a 2 \u0002 2\nblock T2 D J0(k)2 C J1(k) in the upper left corner. One repeats this process by moving\nthe (2 C n)th rows and columns to become the fourth and so forth until one arrives at a\nblock diagonal determinant in which the 2 \u0002 2 block T2 and the 1 \u0002 1 block T1 D J0(k)\nappear N − n times and 2n − N times, respectively. The procedure for 12N > n > 13N is\nanalogous: one moves the (1C n)th and the (2C n)th row to become the second and third,\nrespectively, then does likewise to the (1 C n)th and (2 C n)th column and thus generates\nthe 3 \u0002 3 block T3 and so forth. As n decreases towards unity we meet all the\nOP 2N,n(k) D T N−mnmC1 T (mC1)n−Nm for N\/m > n > N\/(m C 1) (38)\nwith m D 1, . . . , N .\nSimplest to deal with is, of course, the case of the smallest non-trivial dimension, N D 2,\nand there we obtain\nOP 22,1(k) D J 20 (k) C J 21 (k) OP 22,2(k) D J 20 (k). (39)\nBy Fourier transforming we produce the densities of the first and second trace,\nP 22,1(t) D\np\n4 − jt j2\n2pi2jt j P\n2\n2,2(t) D\n1\npi2jt j\np\n4 − jt j2\n. (40)\nNow we propose to show that the distribution P 2N,n of the nth trace behaves like a\nGaussian with respect to its moments jtnj2m for sufficiently low orders. To this end we\ndefine the functions\nQJm(k) D (−ik)mJm(k) (41)\nwhich have the property (Abramowitz and Stegun 9.1.30 [21])\ni\nk\n∂\n∂k\nQJm(k) D QJm−1(k). (42)\n3650 F Haake et al\nThe Toeplitz determinant TN can then be rewritten as\nTN D det( QJm, QJm−1, . . .) with m D 0, . . . , N − 1. (43)\nFrom this we find with (41) and (42) for l 6 N\u0012\n1\nk\n∂\n∂k\n\u0013l\nTN jkD0 D\n\u0012−1\n2\n\u0013l\n. (44)\nTo prove the foregoing identity we proceed as follows. Applying (1\/k)(∂\/∂k) once to\nTN we get a determinant differing from TN only in the last column where, according to\n(42), QJm−NC1 ! QJm−N . Now setting k D 0 and invoking QJm(0) D 0 for positive integer n\nwhile QJm(0) D (− 12 i)m\/(−m)! for m D 0, −1, −2, . . . we face a determinant with vanishing\nelements below the diagonal and thus equalling the product of its diagonal elements; among\nthese only the last, QJ1(0) D − 12 i, differs from unity whereupon (44) is proven for ` D 1.\nIn the next step, ` D 2, TN is changed such that only the elements in the last two columns\nmay get their indices shifted; again setting k D 0 we are left with a 2 \u0002 2 determinant\nwhich yields (44) for ` D 2. In the `th step we get a sum of ` \u0002 ` determinants which is\nevidently independent of the dimension N for ` 6 N . Due to that independence we need\nnot pursue the non-trivial task of proving (44) for arbitrary ` 6 N < 1 but rather invoke\nthe much more easily proven result, to be established in the next section, that for N ! 1\nthe determinant TN is a Gaussian in k. It follows that for finite N the expansion of TN in\npowers of k2 coincides with that of exp(−k2\/4) up to the N th power. Equations (35)–(37)\nshow that P 2N,n(t) behaves like a Gaussian distribution with respect to all moments jtnj2m\nof orders m 6 N\/n. In particular, we find for the variances of the traces\njtnj2 D\n(\nn for 0 < n 6 N\nN for n > N .\n(45)\nInterestingly, these variances grow towards the Poissonian value N as n ! N from below\nand then remain stuck as n grows further.\nWe now proceed to the orthogonal and symplectic cases. Starting as in the previous\nsection with integrating over alternating variables we find for the orthogonal case with even\nN and the symplectic case\nOP 1N,n(k) \/ (detA)1\/2 for β D 1\nOP 4N,n(k) \/ (detB)1\/2 for β D 4 (46)\nwith the antisymmetric matrices\nAmm0 D\nX\nss 0\nJjsj(k)Jjs 0j(k)\n(−i)jsj(−i)js 0j\nm C ns\n\u0002δ(m C m0 C n(s C s 0)) with jmj, jm0j 6 (N − 1)\/2\nBmm0 D\nX\ns\nJjsj(2k)(−i)jsjδ(m C m0 C ns) with jmj, jm0j 6 (2N − 1)\/2. (47)\nWe have not proven the Gaussian property but have calculated the variances. In the\northogonal case (β D 1) we find\njtnj2 D\n8>>>><>>>>:\n2n − n\nnX\nmD1\n1\nm C (N − 1)\/2 for 0 < n 6 N\n2N − n\nNX\nmD1\n1\nm C n − (N C 1)\/2 for n > N\n(48)\nSecular determinants of random unitary matrices 3651\nFigure 3. Mean squared traces jtnj2 for 104 matrices of\nsize N D 20 typical of CPE (♦), COE (\u0003), CUE (\u000e ), and\nCSE (M) compared with analytical results (curves).\nwhile the symplectic case (β D 4) yields\njtnj2 D\n8><>:\n1\n2n C 14n\nnX\nmD1\n1\nN C 12 − m\nfor 0 < n 6 2N\nN for n > 2N.\n(49)\nNeedless to say, these mean squared traces could have been read off the well known\ntwo-level correlation functions of the circular ensembles the Fourier transforms of which our\nvariances in essence are [2]. Indeed, by introducing a non-normalized density of eigenphases\nas\nρ(ϕ) D 2pi\nNX\niD1\nδ(ϕ − ϕi) D\nNX\niD1\n1X\nnD−1\ne−in(ϕ−ϕi) (50)\none immediately sees that the two-point correlation function of that density reads\nρ(ϕ)ρ(ϕ0) D\n1X\nnD−1\njtnj2 e−in(ϕ−ϕ0). (51)\nFigure 3 reveals excellent agreement of the mean squared traces as computed for\nsamples of 4 \u0002 104 20 \u0002 20 matrices of the four ensembles considered with the analytical\npredictions. Note that for the Poisson circular ensemble jtnj2 equals the matrix size N ,\nwithout dependence on n. For small n the variance of traces decreases with the repulsion\nparameter β. The data for the symplectic ensemble are obtained with 2N -dimensional\nmatrices, which provide N different eigenvalues each.\nFigure 4 displays the similarly fine agreement of our analytical results for the densities\nP 2N,n with numerical data for sets of random matrices drawn from the circular unitary\nensemble. This demonstrates that for finite n and large N the distributions are Gaussians.\nWe have performed similar numerical studies for the orthogonal and symplectic ensembles,\nagain finding Gaussian marginal distributions for the traces of sufficiently large matrices.\nMoreover, in all cases studied, the distribution of the traces was isotropic, i.e. without any\nphase dependence.\nWe should add a word of intuitive explanation to the statistics of the traces for\nlarge dimensions N . The nth trace of a unitary matrix may be thought of as a random\nwalk in the complex plane, with each of the N steps of unit length and the ith step\nin a direction given as n times the ith eigenphase ϕi . These directions are mutually\nindependent and uniformly distributed for the Poissonian ensemble which fact explains\nthe independence of the characteristic function (32) of n and the ensuing first and second\nmoments, tn D 0, jtnj2 D N . In accordance with the central limit theorem the rescaled\ntraces tN\/\np\nN tend, with N ! 1, to have a Gaussian distribution of zero mean and unit\n3652 F Haake et al\nFigure 4. Distribution of the moduli of the first five\ntraces jt1j, . . . , jt5j for 105 CUE matrices of size N D 20.\nNarrower full curves correspond to Gaussian distributions\nwith appropriate variances jtnj2 D n.\nvariance. Without such rescaling, the moments jtnj2m with m \u001c N differ from those of the\nGaussian defined by the first two moments only by corrections of relative order 1\/N .\nFor the circular ensembles with β > 0 the phases ϕi display repulsion of degree β such\nthat the directions of subsequent steps in the random walk mentioned are not independent.\nThe correlations between the phases cannot prevent near-Gaussian behaviour of the traces\ntn with n \u001c N , as is intuitive in view of the local character of the spectral correlations.\nMoreover, while the phases ϕi cover the interval [0, 2pi) uniformly once, their multiples nϕi\ngo around that interval n times such that for n > 1 the phases nϕi[mod(2pi)] may exhibit\naccidental close neighbourhoods of originally distant ϕi .\n4. Joint density of traces for large CUE matrices\nWe shall employ here a powerful theorem about determinants of Toeplitz matrices, due\noriginally to Szego¨ and Kac and extended by Hartwig and Fisher [22], to find the marginal\nand joint distributions of the traces tn of CUE matrices in the limit of large dimension N . As\nour starting point we recall the identity (9) for the CUE average of a symmetric function of\nall N phases. Assuming, moreover, that symmetric function to have the form of a product\nwe can pull the integral over the mth phase ϕm into the mth row of the determinant in (9)\nand thus express the average as a Toeplitz determinant,\nNY\nmD1\nf (ϕm) D det(fm, fm−1, . . . , f−NC1) D T (ff g) m D 0, 1, . . . , N − 1 (52)\nthe elements of which are given by the Fourier transform\nfm D\nZ 2pi\n0\ndϕ\n2pi\ne−imϕf (ϕ) (53)\nof the function f (ϕ). We had incurred two examples in (9), (10) and (33), (34). The\ntheorem in question says that for large N the above determinant is given by\nln T (ff g) D Nl0 C\n1X\nnD0\nnlnl−n (54)\nwhere the ln are the Fourier coefficients of ln f (ϕ), i.e. ln f (ϕ) D\nP1\nnD−1 ln e\ninϕ\n.\nThe conditions the function f (ϕ) must meet for the above limiting form to hold are\n(i) f (ϕ) 6D 0 for 0 6 ϕ < 2pi , (ii) argf (2pi) D argf (0), (iii) P1nD−1 jfnj < 1, and\n(iv) P1nD−1 jnjjfnj2 < 1; they are fulfilled in all examples of interest here.\nSecular determinants of random unitary matrices 3653\nIn a first application we return to the Toeplitz determinant (34) which gives the density\nP 2N,n of the nth trace. The only non-vanishing Fourier coefficients of ln f (ϕ) D −ik cos nϕ\nare l\u0006n D −ik\/2 whereupon we get the Gaussian anticipated in the previous section,\nOP 2N,n(k) D e−nk\n2\/4 () P 2N,n(t) D\n1\nnpi\ne−jt j\n2\/n for N \u001d 1. (55)\nNo more difficult to obtain is the joint density of the first n traces\nP\nβ\nN(t1, . . . , tn) D\nnY\nmD1\nδ2\n\u0012\ntm −\nNX\niD1\neimϕi\n\u0013\n(56)\nsince its Fourier transform OP 2N(k1, . . . , kn) is once more of the form (52) with\nf (ϕ) D exp\n\u0012\n− 12 i\nnX\nmD1\n(km e\n−imϕ C k\u0003m eimϕ)\n\u0013\n. (57)\nThe non-vanishing Fourier coefficients of the logarithm of that latter function are lm D\n−ikm\/2, l−m D −ik\u0003m\/2 with m D 1, . . . , n. The theorem (54) thus yields, for N \u001d n,\nOP 2N(k1, . . . , kn) D exp\n\u0012\n−\nnX\nmD1\nmjkmj2\/4\n\u0013\n() P 2N(t1, . . . , tn)\nD 1\nn!pin\nexp\n\u0012\n−\nnX\nmD1\njtmj2\/m\n\u0013\n(58)\ni.e. the product of the marginal distributions of the first n traces. The result generalizes\nin an obvious way to the joint density of an arbitrary set of finite-order traces. We thus\nconclude that in the limit N ! 1 the finite-order traces are statistically independent and\nall have Gaussian distributions.\nWe can now briefly comment on the conditions of applicability of the Hartwig–Fisher\ntheorem given above. The first two of them are clearly fulfilled here since i ln f (ϕ) as given\nby (57) is real, continuous, and periodic. The third and fourth conditions are met since the\nderivative f 0(ϕ) D P1mD−1 imfm eimϕ is square integrable (trivially indeed since i ln f (ϕ)\nis a finite Fourier series); in particular, f 0(ϕ) obeys Parseval’s identity,\n1X\nmD−1\njmj2jfmj2 D\nZ 2pi\n0\njf 0(ϕ)j2 dϕ D pi\nnX\nmD1\nm2jkmj2 < 1. (59)\nSince jmjjfmj2 6 jmj2jfmj2 it follows that\nP1\nmD−1 jmjjfmj2 < 1, i.e. the validity of\ncondition (iii).\nFinally, we invoke Cauchy’s inequality in\n1X\nmD−1\njfmj D jf0j C\n1X\nm6D0\n\f\f\f\f 1m\n\f\f\f\fjmfmj 6 jf0j C \u0012 1X\nm6D0\n\f\f\f\f 1m\n\f\f\f\f2\u00131\/2\u0012 1X\nm6D0\njmfmj2\n\u00131\/2\n. (60)\nUpon using (59) and the convergence of P1m6D0 1\/jmj2 we verify condition (iv).\nFor finite dimension the independence as well as the Gaussian character of the traces\nare only approximate. For sets of traces both of these properties tend to get lost as the sum\nof the orders of the traces in a set increases. In particular, since all traces tn are uniquely\ndetermined by the N real eigenphases, only 12N traces can be independent.\nPreliminary numerical studies suggest that the finite-order traces might be similarly\nindependent and Gaussian for the COE and the CSE. For the CPE, of course, the\nindependence holds trivially.\n3654 F Haake et al\n5. Remarks on the distributions of coefficients of secular polynomials\nAs we have just seen the first few traces t1, t2, . . . of large unitary matrices drawn from any\nof the circular ensembles display no noticeable correlations. It follows that the coefficients\na1, a2, . . . must bear strong mutual correlations simply since an can be expressed in terms\nof the first n traces through Newton’s formulae (25). One must therefore expect that the\nexplicit form of the marginal and joint distributions of the an are hard to come by. An\nexception is provided by a1, the marginal distribution of which is trivially related to that of\nthe first trace since a1 D t1.\nA slightly less trivial result may be obtained for the distribution P(a2) of the second\ncoefficient. Since a2 D 12 (t21 − t2) we may invoke the CUE joint distribution (58) of the\nfirst two traces to get\nP(a2) D\nr\n2e\npi3\nZ 2\n0\ndxp\nx(2 − x) exp\n\u0012\n−1\nx\n− ja2j2x\n\u0013\n. (61)\nA saddle-point approximation to the foregoing integral immediately reveals that P(a2)\ndecays exponentially for large a2. Proceeding similarly one may combine Newton’s\nformulae with the joint distribution of the traces to get the marginal and joint distributions\nof the first few an, with decreasingly compact and enjoyable results.\nFigure 5 presents the distributions of some moduli janj as obtained numerically from\n105 CUE matrices of the size 10 \u0002 10. For n D 2 these numerical data agree well with\nthe distribution 2pi ja2jP(a2) according to (61). All of those curves grow linearly out of the\norigin with a slope increasing with the index n of the coefficient an. On the other hand, all\nof these distributions but the first are characterized by a long exponential tail. The latter\noriginates from the convolution type integrals which combine the densities of the traces to\nthose of the coefficients; it contrasts with the Gaussian tail of the distribution of the first\ncoefficient. The qualitative features just outlined for the CUE are shared by the distributions\nP(an) for the other canonical ensembles.\n6. Comparison with a dynamical system\nWe propose here to examine how far our results on distributions of the coefficients an\nand traces tn of matrices, drawn from the canonical circular ensembles, are applicable to\ndynamical systems. Choosing the familiar model of the periodically kicked top [3, 23] we\nwork with a Floquet operator of the form\nF D exp\n\u0012\n−i kx\n2j C 1J\n2\nx − ipxJx\n\u0013\nexp\n\u0012\n−i ky\n2j C 1J\n2\ny − ipyJy\n\u0013\n\u0002 exp\n\u0012\n−i kz\n2j C 1J\n2\nz − ipzJz\n\u0013\n. (62)\nThis involves the components of an angular momentum operator Jx , Jy , Jz which satisfy\nstandard commutation relations, [Jx, Jy] D iJz etc. The quantum number j fixes J2 D\nj (j C 1) and the size of the Hilbert space, N D 2j C 1.\nFor generic values of the parameters kx , ky , kz and px , py , pz the corresponding classical\ndynamics is chaotic and there is no geometric nor anti-unitary symmetry left [23]. All\npreviously studied statistical properties of the quasi-energy spectrum and the eigenvectors\nwere found to be remarkably faithful to the predictions of the CUE [3]. On the other\nhand, when the parameters ky and py (or, instead, kx and px) are set to zero, an anti-unitary\nsymmetry under time reversal appears, and in this case the spectral and eigenvector statistics\nSecular determinants of random unitary matrices 3655\nFigure 5. Distribution of the moduli of the coefficients\nja1j (short-dashed curve), ja2j (dotted), ja4j (dash-dotted\ncurve) and ja6j (long-dashed curve) for CUE matrices of\nsize N D 20. Distributions of the two first coefficients are\ncompared with theoretical predictions (narrow curves).\nFigure 6. Mean squared traces jtnj2 (circles) and coefficients\njanj2 (triangles) for orthogonal tops are compared with COE\nresults (curves). Data are averaged over 20 000 different\nFloquet matrices of the structure (6.1) as described in the\ntext.\nwere found as of the COE type. We shall refer to the two variants of the model as to the\nunitary and orthogonal top, respectively.\nBefore presenting our data for the traces tn and the secular coefficients an of various tops\na word of caution is in order. Previous statistical analyses of tops were made for spectrally\nlocal quantities such as low-order correlations of the level density, the distribution of nearest-\nneighbour spacings, or for components of eigenvectors; what distinguishes these quantities is\na certain self-averaging character. A single Floquet matrix of large dimension N provides a\nsufficient data basis to extract reliable means or even distributions from. Now, the sequence\nof the traces tn and that of the secular coefficients an are not in any way self-averaging since\nsuch a sequence with 1 6 n 6 12N stands for a whole quasi-energy spectrum and therefore\nchanges in a system specific manner when control parameters are varied. Consequently, it\nwould not make sense to compare such a sequence for an individual Floquet matrix with\nthe means calculated here for the various circular ensembles. We must rather ask whether\nan ensemble of Floquet matrices of the type (62), defined by a whole set of values for the\nvarious control parameters, is faithful to the prediction based on the circular ensemble of\nrandom matrices of the same symmetry class. It is in this sense that we have undertaken\nthe comparison to follow.\nFigure 6 shows the n dependence of the variances of the traces (circles) and of the\ncoefficients (triangles) for orthogonal tops. The order of the characteristic polynomial was\ntaken as N D 41 by choosing j D 20. Data from 20 000 matrices were gathered by\npicking ky , kz from intervals of length 3 around 10 and py , pz from [3pi\/8, 5pi\/8], all with\nindependent box distributions. These intervals were chosen so as to secure classical chaos\nand to avoid geometric symmetries. The agreement with the COE is obviously satisfactory.\nAnalogous data for unitary tops are presented in figure 7. The agreement with the\nCUE predictions is acceptable in the sense that there is no doubt about the universality\nclass. However, system specific behaviour is clearly visible for low-order traces and even\n3656 F Haake et al\nFigure 7. As in figure 6 for unitary tops. Curves\ndenote the CUE results.\nFigure 8. As in figure 6 for symplectic tops.\nAverage over 2000 matrices as described in the\ntext. Curves denote CSE results.\nin all secular coefficients. Qualitatively, such deviations from random-matrix theory are\nnot unexpected since low-order traces do contain primarily system specific information\nretrievable from short periodic orbits and since the an even for large n contain low-order\ntraces as expressed in Newton’s formulae.\nSymplectic tops can also be constructed by securing an anti-unitary symmetry T with\nT 2 D −1 and avoiding geometric symmetries [3]. The Floquet operator\nF D exp\n\u0012\n−i k1\n2j C 1J\n2\nz − i\nk2\n2(2j C 1) (JxJz C JzJx) − i\nk3\n2(2j C 1) (JxJy C JyJx)\n\u0013\n\u0002 exp\n\u0012\n−i k4\n2j C 1J\n2\nz\n\u0013\n(63)\nin a representation with half-integer j is a good example. A set of 2000 matrices with\nj D 39.5 and coupling constants ki drawn at random from a hypercube of length 0.4 near\n10 gives data shown in figure 8. The agreement with the CSE is better than could be hoped\nfor.\nAcknowledgments\nWe would like to thank Nils Lehmann for helpful cooperation and Pragya Shukla for\nfirst efforts to calculate the mean squared secular coefficients for the COE and the CSE.\nFinancial support by the Sonderforschungsbereich ‘Unordnung und große Fluktuationen’\nder Deutschen Forschungsgemeinschaft is gratefully acknowledged.\nSecular determinants of random unitary matrices 3657\nAppendix A. Differential equation for the generating function\nLet us recall the heuristic way we first approached the mean squared secular coefficients (19),\n(23), and (24). After deriving the Pfaffians (18) and (21) we applied an algebraic computer\nprogram to evaluate the janj2 for small dimensions N and then proceeded analytically\nto n D 1, 2 and arbitrary N . We thank N Lehmann for the computer work and also\nfor his intuition in proposing (23) with us. Having eventually proposed (19) as well we\nspeculatively extrapolated to the general form (24) for arbitrary positive β.\nTo prepare for the proof of (24) we observe the equivalence to the recursion relation\n(n C 1)\n\u0012\n1 C β\n2\n(N − n − 1)\n\u0013\njanC1j2 D (N − n)\n\u0012\n1 C nβ\n2\n\u0013\njanj2 (A1)\nwith ja0j2 D 1. Multiplying (A1) by xn, using (x∂\/∂x)xn D nxn, and summing from n D 0\nto n D N − 1 we obtain the differential equation (25), the polynomial solution of which\nwith P βN(x) D 1 generates the mean squared secular coefficients. A few elementary steps\nwill now yield the validity of the differential equation.\nWe start from the definition (4) of the generating function, setting λ D x, µ D 1 and\ntake the derivative with respect to x,\n∂P (x)\n∂x\nD −\n\u001c NX\niD1\n1\neiϕi − x\n\u001d\n(A2)\nwhere the angular brackets denote an average with the whole integrand of (A2) as the\nweight. On the other hand, taking the derivative with respect to µ before setting µ D 1 and\nexploiting the invariance of the N -fold phase integral under a constant shift of all phases\nwe get\nx\n∂P (x)\n∂x\nD −\n\u001c NX\niD1\n1\ne−iϕi − 1\n\u001d\n. (A3)\nNext, we differentiate (A2) once more,\n∂2P(x)\n∂x2\nD\n\u001c X\ni 6Dj\n1\n(eiϕi − x)(eiϕj − x)\n\u001d\nD\n\u001c X\ni 6Dj\n−2\n(eiϕi − x)(eiϕi − eiϕj )\n\u001d\nD −\n\u001c X\ni 6Dj\ne−iϕi\n(eiϕi − x)\n\u0012\n1 − i cot ϕi − ϕj\n2\n\u0013\u001d\n. (A4)\nRealizing that the cotangent function may be replaced by a derivative acting on the joint\ndensity of eigenvalues (2),\u0012\n∂\n∂ϕi\n− β\n2\nX\nj (6Di)\ncot\nϕi − ϕj\n2\n\u0013\nd\nβ\nN D 0 (A5)\nwe can transform the last member in (A4) by partial integration. A little algebraic\nhocuspocus then gives, with the help of (A2) and (A3),\n∂2P(x)\n∂x2\nD\n\u0012\nN − 1 C 2(2 − x)\nβ(1 − x)\n\u0013\n1\nx\n\u0012\n∂P\n∂x\nC\nX\ni\nh e−iϕi i\n\u0013\nC 2\nβ(1 − x)\n\u0012\n−\nX\ni\nh e−iϕi i − NP C x ∂P\n∂x\n\u0013\n. (A6)\n3658 F Haake et al\nFinally, the average\nP\nih e−iϕi i can be expressed in terms of the generating function P and\nits derivative ∂P\/∂x by employing the identity\nP\nkh e−iϕk i D\nP\nkhi∂ e−iϕk \/∂ϕki, integrating\nby parts, and again invoking (A2), (A3) and (A5),X\ni\nh e−iϕi i\n\u0012\n2 C β\n2\n(N − 1)\n\u0013\nD (x − 1)∂P\n∂x\n− NP. (A7)\nUpon inserting this in (A6) we obtain a differential equation for the generating function P\nwhich is easily put into the form (25).\nReferences\n[1] Dyson F J 1962 J. Math. Phys. 3 140\n[2] Mehta M L 1991 Random Matrices II (New York: Academic)\n[3] Haake F 1990 Quantum Signatures of Chaos (Berlin: Springer)\n[4] Jalabert R A and Pichard J-L 1995 J. Physique I (France) 5 287\n[5] Gaudin M 1966 Nucl. Phys. 85 545\n[6] Pandey A and Shukla P 1991 J. Phys. A: Math. Gen. 24 3907\n[7] Muttalib K A and Ismail M E H 1995 J. Phys. A: Math. Gen. 28 L541\n[8] Lewenkopf C H and Weidenmu¨ller H A 1991 Ann. Phys., NY 212 53\n[9] Brouwer P W 1995 Phys. Rev. B 51 16 878\n[10] Pereyra P and Mello P A 1983 J. Phys. A: Math. Gen. 16 237\n[11] Mello P A, Pereyra P and Seligman T H 1985 Ann. Phys., NY 161 254\n[12] Doron E, Smilanski U and Frenkel A 1991 Physica 50D 367\n[13] Baranger H U and Mello P A 1994 Phys. Rev. Lett. 73 142\n[14] Mostowski A and Stark M 1964 Introduction to Higher Algebra (Oxford: Pergamon)\n[15] Bogomolny E, Bohigas O and Leboeuf P 1992 Phys. Rev. Lett. 68 2726\n[16] Kus´ M, Haake F and Eckhardt B 1993 Z. Phys. B 92 221\n[17] Bogomolny E, Bohigas O and Leboeuf P 1995 Preprint\n[18] ˙Zyczkowski K and Kus´ M 1994 J. Phys. A: Math. Gen. 27 4235\n[19] ˙Zyczkowski K 1995 Chaos—the interplay between stochastic and deterministic behavior Proc. XXXIst Winter\nSchool of Theoretical Physics (Karpacz, 1995) ed P Garbaczewski, MWolf and A Weron (Berlin: Springer)\np 565\n[20] ˙Zyczkowski K and Kus´ M 1996 Phys. Rev. E 53 319\n[21] Abramowitz M and Stegun I A (eds) 1970 Handbook of Mathematical Functions (New York: Dover)\n[22] Hartwig R E and Fisher M E 1969 Arch. Rat. Mech. Anal. 32 190\n[23] Haake F, Kus´ M and Scharf R 1987 Z. Phys. B 65 381\n"}