{"doi":"10.1136\/bmj.323.7321.1096","coreId":"66066","oai":"oai:dro.dur.ac.uk.OAI2:3373","identifiers":["oai:dro.dur.ac.uk.OAI2:3373","10.1136\/bmj.323.7321.1096"],"title":"Impact of effective health care bulletin on treatment of persistent glue ear in children : time series analysis.","authors":["Mason, J. M.","Freemantle,  N.","Browning,  G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-11-01","abstract":"During the 1980s, surgery for chronic otitis media with effusion (glue ear) increased greatly without obvious reason.1 \"Dry taps\"absence of effusion upon incisionwere common, probably because the surgery was performed without the surgeon confirming that the condition had not already resolved.2 An Effective Health Care bulletin on the treatment of persistent glue ear in children was distributed nationally to NHS decision makers in 1992.2 Based on systematic review, the bulletin concluded that surgery should be restricted to children with an extended period of substantial hearing impairment, with persistence and severity established by watchful waiting. We evaluated surgery rates before and after distribution of the bulletin","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66066.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3373\/1\/3373.pdf","pdfHashValue":"cd04622111af21da81589ca79df262860f6ef3b9","publisher":"BMJ Publishing Group","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3373<\/identifier><datestamp>\n      2011-08-25T14:38:42Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Impact of effective health care bulletin on treatment of persistent glue ear in children : time series analysis.<\/dc:title><dc:creator>\n        Mason, J. M.<\/dc:creator><dc:creator>\n        Freemantle,  N.<\/dc:creator><dc:creator>\n        Browning,  G.<\/dc:creator><dc:description>\n        During the 1980s, surgery for chronic otitis media with effusion (glue ear) increased greatly without obvious reason.1 \"Dry taps\"absence of effusion upon incisionwere common, probably because the surgery was performed without the surgeon confirming that the condition had not already resolved.2 An Effective Health Care bulletin on the treatment of persistent glue ear in children was distributed nationally to NHS decision makers in 1992.2 Based on systematic review, the bulletin concluded that surgery should be restricted to children with an extended period of substantial hearing impairment, with persistence and severity established by watchful waiting. We evaluated surgery rates before and after distribution of the bulletin.<\/dc:description><dc:publisher>\n        BMJ Publishing Group<\/dc:publisher><dc:source>\n        British medical journal, 2001, Vol.323(7321), pp.1096-1097 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2001-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3373<\/dc:identifier><dc:identifier>\n        issn:0959-8138<\/dc:identifier><dc:identifier>\n        issn: 1468-5833<\/dc:identifier><dc:identifier>\n        doi:10.1136\/bmj.323.7321.1096<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3373\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1136\/bmj.323.7321.1096<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3373\/1\/3373.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0959-8138","issn: 1468-5833","issn:0959-8138"," 1468-5833"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2001,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n10 November 2009\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nMason, J. M. and Freemantle, N. and Browning, G. (2001) ’Impact of effective health care bulletin on\ntreatment of persistent glue ear in children : time series analysis.’, British medical journal., 323 (7321). pp.\n1096-1097.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1136\/bmj.323.7321.1096\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n11 November 2009 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status of attached file: \nPublished version \n \nCitation for published item: \nMason, J. M., Freemantle, N. and Browning, G. (2001), ‘Impact of effective health care \nbulletin on treatment of persistent glue ear in children : time series analysis.’, British medical \njournal, 323 (7321), pp. 1096-1097. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1136\/bmj.323.7321.1096 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nwhite paper.27 Future research may have the challeng›\ning task of evaluating the effectiveness of combining\nspecific clinical interventions within or without a\nprotective legal framework.\nThe UK700 Group is a collaborative study team involving four\nclinical centres. Manchester: Tom Butler, Francis Creed, Janelle\nFraser, Peter Huxley, Nicholas Tarrier, Theresa Tattan. King’s\/\nMaudsley, London: Tom Fahy, Karyna Gilvarry, Kwame McKen›\nzie, Robin Murray, Jim van Os, Elizabeth Walsh. St Mary’s\/St\nCharles’ Hospitals, London: John Green, Anna Higgitt, Elizabeth\nvan Horn, Donal Leddy, Catherine Manley, Patricia Thornton,\nPeter Tyrer. St George’s Hospital, London: Rob Bale, Tom Burns,\nMatthew Fiander, Kate Harvey, Andy Kent, Chiara Samele. York\n(health economics): Sarah Byford, David Torgerson, Ken Wright.\nLondon School of Hygiene and Tropical Medicine (statistical\ncentre): Simon Thompson, Ian White.\nFunding: EW was funded by a Wellcome Training\nFellowship. The UK700 trial was funded by grants from the\nDepartment of Health and NHS research and development\nprogramme.\nCompeting interests: None declared.\n1 Monahan J. Mental disorder and violent behaviour: perceptions and evi›\ndence. Am Psychol 1992;47:511›21.\n2 Swartz MS, Swanson JW, Hiday VA, Borum R, Wagner HR, Burns BJ. Vio›\nlence and severe mental illness. The effects of substance abuse and non›\nadherence to medication. Am J Psychiatry 1998;155:226›31.\n3 Silver E, Mulvey EP, Monahan J. Assessing violence risk among\ndischarged psychiatric patients: toward an ecological approach. Law Hum\nBehav 1999;23:237›55.\n4 Department of Health. The care programme approach for people with a mental\nillness referred to the specialist psychiatric services. London: Department of\nHealth, 1990.\n5 UK700 Group. Intensive versus standard case management for severe\npsychotic illness: a randomised trial. Lancet 1999;353:2185›9.\n6 Spitzer R, Endicott J, Robins E. Research diagnostic criteria: rationale and\nreliability. Arch Gen Psychiatry 1978;35:773›82.\n7 Burns T, Fiander M, Kent A, Ukoumunne OC, Byford S, Fahy T, et al.\nEffects of case›load size on the process of care of patients with severe psy›\nchotic illness. Br J Psychiatry 2000;177:427›33.\n8 World Health Organization. The life chart. Geneva: WHO, 1992.\n9 Asberg M, Montgomery SA, Perris C. The CPRS›development and\napplications of a psychiatric rating scale. Acta Psychiatr Scand 1978;271\n(suppl):5›27.\n10 Andreason NC. Modified scale for the assessment of negative symptoms. Iowa\nCity: University of Iowa, 1984.\n11 Phelan M, Slade M, Thornicroft G, Dunn G, Holloway F, Wykes T, et al.\nThe Camberwell assessment of need: the validity and reliability of an\ninstrument to assess the needs of people with severe mental illness. Br J\nPsychiatry 1995;167:589›95.\n12 Buchanan A. The investigation of acting on delusions as a tool for risk\nassessment in the mentally disordered. Br J Psychiatry 1997;170(suppl\n32):12›6.\n13 Swanson JW, Borum R, Swartz M, Hiday V. Violent behaviour preceding\nhospitalisation among persons with severe mental illness. Law Hum Behav\n1999;23:185›204.\n14 Hodgins S. Mental disorder, intellectual deficiency, and crime. Evidence\nfrom a birth cohort. Arch Gen Psychiatry 1992;49:476›83.\n15 Mulvey EP, Shaw E, Lidz CW. Why use multiple sources in research on\npatient violence in the community? Crim Behav Mental Health\n1994;4:253›8.\n16 Elliott D, Huizinga D, Morse B. Self›reported violent offending: a descrip›\ntive analysis of juvenile violent offenders and their offending careers. J\nInterpersonal Viol 1986;1:472›513.\n17 Steadman H, Mulvey EP, Monahan J, Robbins PC, Applebaum PS, Grisso\nT, et al. Violence by people discharged from acute psychiatric inpatient\nfacilities and by others in the same neighborhoods. Arch Gen Psychiatry\n1998;55:1›9.\n18 Monahan J. Clinical and actuarial predictions of violence. In: Faigman D,\nKaye D, Saks M, Sanders J, eds. Modern scientific evidence: the law and science\nof expert testimony. Vol 1. St Paul, MN: West Publishing Company,\n1997:300›18.\n19 Chandler D, Meisel J, McGowen M, Mintz J, Madison K. Client outcomes\nin two model capitated integrated service agencies. Psychiatr Serv\n1996;47:175›80.\n20 Bond GR, Miller LD, Krumwied RD, Ward RS. Assertive case\nmanagement in three CMHCs: a controlled study. Hosp Community\nPsychiatry 1988;39:411›8.\n21 Bond GR, Witheridge TF, Dincin J, Wasmer D, Webb J, De Graaf›Kaser R.\nAssertive community treatment for frequent users of psychiatric hospitals\nin a large city: a controlled study. Am J Community Psychol 1990;18:865›91.\n22 Lehman AF, Dixon LB, Kernan E, DeForge B. A randomised trial of\nassertive community treatment for homeless persons with severe mental\nillness. Arch Gen Psychiatry 1997;54:1038›43.\n23 Solomon P, Draine J. The efficacy of a consumer case management team:\n2›year outcomes of a randomised trial. J Mental Health Admin\n1995;22:126›34.\n24 Stein LI, Test MA. Alternative to mental hospital treatment: 1. Conceptual\nmodel, treatment program, and clinical evaluation. Arch Gen Psychiatry\n1980;37:392›7.\n25 Test MA. Training in community living. In: Liberman RP, ed. Handbook of\npsychiatric rehabilitation. New York: Macmillan, 1992.\n26 Swanson JW, Swartz MS, Borum R, Hiday VA, Wagner HR, Burns BJ.\nInvoluntary out›patient commitment and reduction of violent behaviour\nin persons with severe mental illness. Br J Psychiatry 2000;176:324›31.\n27 Secretary of State for Health. Reforming the Mental Health Act. London:\nStationery Office, 2000.\n(Accepted 23 July 2001)\nImpact of Effective Health Care bulletin on treatment of\npersistent glue ear in children: time series analysis\nJames Mason, Nick Freemantle, George Browning\nDuring the 1980s, surgery for chronic otitis media with\neffusion (glue ear) increased greatly without obvious\nreason.1 “Dry taps”—absence of effusion upon\nincision—were common, probably because the surgery\nwas performed without the surgeon confirming that\nthe condition had not already resolved.2 An Effective\nHealth Care bulletin on the treatment of persistent glue\near in children was distributed nationally to NHS deci›\nsion makers in 1992.2 Based on systematic review, the\nbulletin concluded that surgery should be restricted to\nchildren with an extended period of substantial\nhearing impairment, with persistence and severity\nestablished by watchful waiting. We evaluated surgery\nrates before and after distribution of the bulletin.\nMethods and results\nQuarterly numbers of D151 procedures—insertion of a\nventilation tube through the tympanic membrane—\nperformed in children aged under 15 in England from\n1989 to 1996 were obtained from the hospital episodes\nsystem. We calculated per capita regional and national\nrates for this procedure.3\nWe applied a generalised linear model with a\nheterogeneous first order autoregressive structure and\nrepeated measures by region. The effect of the\nintroduction of the bulletin was nested into the model\nusing ‘proc mixed’ in SAS version 8 (SAS Institute,\nCary, NC). This approach consistently identifies the\nbest autoregressive structure (the model adjusts for the\nrelatedness of sequential observations over time). We\ninvestigated regional variations in surgical rates by\ncomparing standard error terms from the model\nbefore and after distribution of the bulletin. Overall,\nthe model included data from 14 regions, each of\nwhich provided results from 28 quarters, half before\nand half after distribution of the bulletin.\nIn 1992, 77 766 grommet insertions were con›\nducted; this was equivalent to a quarterly rate of 2.1 per\nPapers\nCentre for Services\nResearch, University\nof Newcastle upon\nTyne, Newcastle\nupon Tyne\nNE2 4AA\nJames Mason\nprofessor of health\neconomics\ncontinued over\nBMJ 2001;323:1096–7\n1096 BMJ VOLUME 323 10 NOVEMBER 2001 bmj.com\n1000 children, with regional rates varying by a factor of\ntwo. A small increase in the quarterly rate of\nprocedures per 1000 children during the three years\nbefore distribution of the bulletin (0.026 (95%\nconfidence interval − 0.022 to 0.073)) became a\ndecrease in the four years after publication ( − 0.044\n( − 0.080 to − 0.011); P < 0.0001) (figure). The decrease\nin quarterly rate from 1992 onwards was seen consist›\nently across the regions.\nThe changing trend in surgery suggests that 89 800\nprocedures were avoided nationally in the four years\nafter the bulletin, providing a theoretical saving of £27m\nat 1992›3 prices.2 Regional variations in the numbers of\nsurgical procedures undertaken were 30% smaller after\ndistribution of the bulletin than before (SE 0.0169 v\n0.0242). Our findings were not substantially altered by\nanalysing procedures under the broader code D15\n(drainage of the middle ear) or by age range.\nComment\nDistributing printed recommendations to decision\nmakers may influence surgery rates, since a trend\ntowards a reduction in the number of grommet opera›\ntions was seen after distribution of the bulletin. Rates\nfor tonsillectomy—another elective procedure in the\nsame specialty—increased steadily over the same\nperiod, suggesting that the change was specific to per›\nsistent glue ear and thus was related to the bulletin.\nThe change cannot be attributed to the bulletin\nalone, which was commissioned because of pre›existing\nconcerns about appropriate use of the procedure. Its\npublication received coverage in the medical and aca›\ndemic press,4 possibly encouraging doctors to examine\ntheir own practices and bring about behavioural change.\nSurgery rates were reduced, and there was an\napparent improvement in the equality of care, but our\nresults do not provide information on quality of care\ndelivered by either general practitioners or surgeons.\nAdherence to watchful waiting principles may have\npromoted more appropriate (and reduced) patient\nselection; alternatively, primary care physicians alerted\nby media concerns may have reduced referral rates.\nEstablishing the link between health service activity\nand quality of care remains difficult.\nThe estimated savings from reduced surgery\n(£27m) are considerably greater than the approximate\nproduction cost of the bulletin (£25 000). Another bul›\nletin addressing the prescribing of selective serotonin\nreuptake inhibitors demonstrated a similar profile of\ncosts.5 Although the apparent healthcare savings are\nimpressive, the impact on health outcomes, costs of\nalternative care received by patients, and costs of other\nhealth promoting activities remain unknown.\nContributors: JM had the original idea for the study, helped with\ndata analysis, drafted the paper, and acts as guarantor. NF\ndesigned and conducted the data analysis. JM, GB, and NF par›\nticipated in interpreting the data and revising the paper.\nFunding: Academic grant from Nuffield Trust for Research\nPolicy Studies in Health Services, registered charity No 209201.\nCompeting interests: JM and NF were members of the\nresearch team that wrote the Effective Health Care Bulletin on the\ntreatment of persistent glue ear in children, and GB was a spe›\ncialist adviser to the research team. JM and NF were employees\nof the Universities of York and Leeds, respectively, which\nreceived funding for the Effective Health Care bulletin project\nfrom the Department of Health.\n1 Black NA. Surgery for children—a modern epidemic. Lancet 1984;i:835›7.\n2 The treatment of persistent glue ear in children. Effective Health Care\n1992; No 4.\n3 Department of Health. Health and personal social services statistics for Eng›\nland.London: HMSO, 1996.\n4 Sheldon TA, Freemantle N, Browning GG, Maw AR, Mason JM, Song F.\nGlue ear guidelines: time to act on the evidence. Lancet 1992;340:1324›5.\n5 Mason J, Freemantle N, Young P. The effect of the distribution of Effective\nHealth Care Bulletins on prescribing selective serotonin reuptake inhibi›\ntors in primary care. Health Trends 1998›9;30:120›2.\n(Accepted 23 April 2001)\nGeneral outbreaks of infectious intestinal diseases linked\nwith private residences in England and Wales, 1992›9:\nquestionnaire study\nIain A Gillespie, Sarah J O’Brien, Goutam K Adak\nThe inception of the Food Standards Agency in April\n2000 has given food safety issues a high public and\npolitical profile. Recently, concerns about food hygiene\nhave focused on the home and, in particular, the possi›\nble transmission of infection via household items.1 To\ndetermine the causes of gastrointestinal infection asso›\nciated with the home, we reviewed general outbreaks\n(outbreaks affecting more than one household) of\ninfectious intestinal disease in England and Wales\nreported to the Public Health Laboratory Service\n2.5\n2.0\n1.5\n1.0\n0.5\n0\n1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999\n1 2 3 4 1 2 3 4 1 2 3 4 1 2 3 4 1 2 3 4 1 2 3 4 1 2 3 4 1 2 3 4 1 2 3 4 1 2 3 42 3 4\nPr\noc\ned\nur\nes\n p\ner\n 1\n00\n0 \npo\npu\nla\ntio\nn \n<1\n5\nQuarter\nEstimated rate of\nincrease pre-bulletin (Yo)\nEstimated rate\nof decrease\npost-bulletin (Y1)\nBulletin\ndistributed\n(intercept)\nGeneralised linear model\nEffect\nIntercept\nYo\nY1\nBulletin\nNo\nYes\nEstimate\n2.095\n0.0257\n-0.0438\nError\n0.0830\n0.0242\n0.0169\ndf\n13\n376\n376\n95% CI\n1.915 to 2.274\n-0.0219 to 0.0732\n-0.0770 to -0.0106\nQuarterly rate of grommet insertions for glue ear per capita in\nEngland before and after distribution of the Effective Health Care\nbulletin on treatment of persistent glue ear\nPapers\nCorrespondence to:\nS J O’Brien\nsobrien@phls.org.uk\ncontinued over\nBMJ 2001;323:1097–8\n1097BMJ VOLUME 323 10 NOVEMBER 2001 bmj.com\n"}