{"doi":"10.1088\/1751-8113","coreId":"67954","oai":"oai:eprints.lancs.ac.uk:34369","identifiers":["oai:eprints.lancs.ac.uk:34369","10.1088\/1751-8113"],"title":"On the initial-value problem of the Maxwell-Lorentz equations.","authors":["Perlick, Volker","Carr, Anthony"],"enrichments":{"references":[{"id":830986,"title":"Adiabatic limit for the Maxwell-Lorentz equations.","authors":[],"date":"2000","doi":"10.1007\/PL00001010","raw":"M. Kunze and H. Spohn. Adiabatic limit for the Maxwell-Lorentz equations. Ann. H. Poincar´ e, 1:625–654, 2000.","cites":null},{"id":830165,"title":"Asymptotic analysis of ultra-relativistic charge.","authors":[],"date":"2007","doi":"10.1016\/j.aop.2006.05.009","raw":"D. A. Burton, J. Gratus, and R. W. Tucker. Asymptotic analysis of ultra-relativistic charge. Ann. Phys. (NY), 322:599–630, 2007.","cites":null},{"id":830404,"title":"Dynamics of charged particles and their radiation ﬁeld.","authors":[],"date":"2004","doi":null,"raw":"H. Spohn. Dynamics of charged particles and their radiation ﬁeld. Cambridge University Press, Cambridge, 2004.","cites":null},{"id":830642,"title":"Long-time asymptotics for the coupled Maxwell-Lorentz equations.","authors":[],"date":"2000","doi":"10.1080\/03605300008821524","raw":"A. Komech and H. Spohn. Long-time asymptotics for the coupled Maxwell-Lorentz equations. Commun. Partial Diﬀ. Equat., 25:559–584, 2000.","cites":null},{"id":832062,"title":"Multiple currents in charged continua.","authors":[],"date":"2007","doi":"10.1088\/1751-8113\/40\/4\/016","raw":"D. A. Burton, J. Gratus, and R. W. Tucker. Multiple currents in charged continua. J. Phys. A, 40:811–829, 2007.","cites":null},{"id":16651391,"title":"Pseudodiﬀerential operators and nonlinear PDE. Birkh¨ auser,","authors":[],"date":"1991","doi":null,"raw":"M. E. Taylor. Pseudodiﬀerential operators and nonlinear PDE. Birkh¨ auser, Boston, 1991.","cites":null},{"id":831753,"title":"Pseudodifferential operators and nonlinear PDE. Birkha¨user,","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":831495,"title":"Relativistic electrodynamics and diﬀerential geometry.","authors":[],"date":"1987","doi":"10.1002\/asna.2113090313","raw":"S. Parrott. Relativistic electrodynamics and diﬀerential geometry. Springer, New York, 1987.","cites":null},{"id":831270,"title":"The Maxwell-Lorentz system of a rigid charge.","authors":[],"date":"2001","doi":null,"raw":"G. Bauer and D. D¨ urr. The Maxwell-Lorentz system of a rigid charge. Ann. H. Poincar´ e, 2:179–196, 2001.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-11-05","abstract":"We consider the Maxwell-Lorentz equations, i.e., the equation of motion of a charged dust coupled to Maxwell's equations, on an arbitrary general-relativistic spacetime. We decompose this system of equations into evolution equations and constraints, and we demonstrate that the evolution equations are strongly hyperbolic. This result guarantees that the initial-value problem of the Maxwell- Lorentz equations is well-posed. We illustrate this general result with a discussion of spherically symmetric solutions on Minkowski spacetime","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67954.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/34369\/4\/maxlor.pdf","pdfHashValue":"c545026716b1d0d52ef55b6116975076a3454b41","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:34369<\/identifier><datestamp>\n      2018-01-24T03:03:19Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        On the initial-value problem of the Maxwell-Lorentz equations.<\/dc:title><dc:creator>\n        Perlick, Volker<\/dc:creator><dc:creator>\n        Carr, Anthony<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We consider the Maxwell-Lorentz equations, i.e., the equation of motion of a charged dust coupled to Maxwell's equations, on an arbitrary general-relativistic spacetime. We decompose this system of equations into evolution equations and constraints, and we demonstrate that the evolution equations are strongly hyperbolic. This result guarantees that the initial-value problem of the Maxwell- Lorentz equations is well-posed. We illustrate this general result with a discussion of spherically symmetric solutions on Minkowski spacetime.<\/dc:description><dc:date>\n        2010-11-05<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/34369\/4\/maxlor.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1088\/1751-8113\/43\/44\/445502<\/dc:relation><dc:identifier>\n        Perlick, Volker and Carr, Anthony (2010) On the initial-value problem of the Maxwell-Lorentz equations. Journal of Physics -London- a Mathematical and General, 43 (44). p. 445502. ISSN 0305-4470<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/34369\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1088\/1751-8113\/43\/44\/445502","http:\/\/eprints.lancs.ac.uk\/34369\/"],"year":2010,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"ar\nX\niv\n:1\n00\n7.\n09\n53\nv2\n  [\ngr\n-q\nc] \n 3 \nOc\nt 2\n01\n0\nOn the initial-value problem of the Maxwell-Lorentz equations\nVolker Perlick∗ and Anthony Carr†\nAbstract\nWe consider the Maxwell-Lorentz equations, i.e., the equation of motion of a charged dust coupled to Maxwell’s\nequations, on an arbitrary general-relativistic spacetime. We decompose this system of equations into evolution\nequations and constraints, and we demonstrate that the evolution equations are strongly hyperbolic. This\nresult guarantees that the initial-value problem of the Maxwell-Lorentz equations is well-posed. We illustrate\nthis general result with a discussion of spherically symmetric solutions on Minkowski spacetime.\n1 Introduction\nIn this article we consider the equations of motion for a charged dust coupled to an electromagnetic field on a\ngeneral-relativistic spacetime. These equations of motion are often refered to as the Maxwell-Lorentz equations,\nbecause they comprise the Maxwell equations for the electromagnetic field and the Lorentz force equation for the\ndust particles. Here, as usual, we use the word “dust” as synonymous to “pressure-less fluid”. As an alternative,\nthe name “cold fluid” is sometimes used.\nThe Maxwell-Lorentz equations have several interesting applications. E.g., they can be used for describing the\nelectron component in a plasma. Among other things, this is of relevance for astrophysics, e.g., for modeling the\nSolar corona. In spite of the high temperature of the Solar corona, it is quite reasonable to model the electron\ncomponent as a pressure-less (or “cold”) fluid, because the density is low. The Maxwell-Lorentz equations have\nalso been suggested for modeling a beam of charged particles in an accelerator, cf. Burton, Gratus and Tucker\n[1]. Special interest has been given to the Maxwell-Lorentz equations for rigid charge distributions on Minkowski\nspacetime. The idea is to use this as a model for an extended charged classical particle, with the self-interaction\ntaken into account. Interesting results have been found, e.g., by Spohn and collaborators [2, 3, 4] as well as by\nBauer and Du¨rr [5]. An important goal of this line of research is to get some new insight into the point-particle\nlimit and its notorious pathologies.\nSeveral fundamental features of the Maxwell-Lorentz equations on Minkowski spacetime are discussed in Chapter\n5 of Parrott’s text-book on electrodynamics [6]. Among other things, Parrott discusses the initial-value problem for\nthese equations. Using the Cauchy-Kowalevski theorem, he is able to demonstrate local existence and uniqueness\nof (analytic) solutions from analytic initial data. However, the assumption of analyticity is physically not quite\nsatisfactory: Knowing an analytic function on an arbitrarily small neighborhood fixes the function on the whole\ndomain of convergence of the Taylor series, whereas physical measurements in an arbitrarily small neighborhood\ncannot determine any results outside of the causal future of this neighborhood. Also, it is often convenient to\nconsider fields which are zero on an open subset U and non-zero on the complement of U ; such fields cannot be\nanalytic near the boundary of U . For these reasons it is desirable to have an existence and uniqueness theorem for\nnon-analytic data, as noted by Parrott himself. It is the main purpose of this paper to establish such a result.\nTo that end we decompose the Maxwell-Lorentz equations, on an arbitrary general-relativistic spacetime, into\nevolution equations and constraints. The evolution equations can be written as a quasi-linear system of first order\npartial differential equations. We derive the characteristic equation (dispersion relation), and we demonstrate that\nthe system of evolution equations is strongly hyperbolic, which is a necessary and sufficient condition for the initial-\nvalue problem to be well-posed. This means that a solution locally exists, that it is unique, and that it depends\ncontinuously on the data in an appropriate topology. This result is of relevance for solving the Maxwell-Lorentz\nequations numerically: If a solution does not exist it is pointless to write a numerical code that tries to approximate\nit; if the solution is not unique the code does not know which solution to approximate; and if the dependence on\nthe data is discontinuous it is impossible to estimate the error of a numerical solution.\nAfter establishing our general existence and uniqueness result, we illustrate it with a discussion of spherically\nsymmetric solutions on Minkowski spacetime.\n∗Physics Department, Lancaster University, Lancaster LA1 4YB, United Kingdom, and The Cockcroft Institute, Warrington WA4\n4AD, United Kingdom. Email: v.perlick@lancaster.ac.uk\n†Physics Department, Lancaster University, Lancaster LA1 4YB, United Kingdom. Email: carranty@gmail.com\n1\n2 The Maxwell-Lorentz equations\nWe consider the coupled equations of motion of a charged dust and an electromagnetic field on a general-relativistic\nspacetime, i.e., on a 4-dimensional manifoldM with a Lorentzian metric g. We allow for an external electric current\ndensity Je, and we assume that the dust consists of only one species of particles, with charge q and mass m. In the\nfollowing we assume that the second-rank tensor field g = gijdx\ni⊗dxj , the one-form Je = Jei dx\ni and the constants\nq and m are given. We use standard index notation with Einstein’s summation convention for latin indices taking\nvalues 0, 1, 2, 3 and for greek indices taking values 1, 2, 3. As usual, the contravariant metric components are defined\nby gkigij = δ\nk\nj . The metric has signature (−,+,+,+) and its Levi-Civita connection is denoted ∇. We use units\nmaking ε0 and µ0 (and, thus, the vacuum speed of light c) equal to 1.\nThe equations of motion consist of Maxwell’s equations for the electromagnetic field and the Lorentz force\nequation for the dust particles,\n∂iFjk + ∂jFki + ∂kFij = 0 , (1)\ngij∇iFjk = J\ne\nk − q n gkℓU\nℓ , (2)\nU i∇iU\nj =\nq\nm\ngjkFkℓU\nℓ . (3)\nWe refer to these equations as to the Maxwell-Lorentz equations. The field variables (i.e., the “unknowns” in these\nequations) are\n• the electromagnetic field strength Fijdx\ni⊗dxj which is an antisymmetric second-rank tensor field, Fij = −Fji ;\n• the four-velocity U i∂i of the dust which is a vector field, normalised to gijU\niU j = −1 .\n• the (proper) number density n of the dust which is a non-negative scalar function;\nThe electromagnetic field is to be interpreted as the field produced by the external current plus the field produced\nby the charged dust plus, possibly, an additional source-free field.\nIf n = 0 on an open subset of the spacetime, U i is physically undetermined on this subset. In this case, the\nelectromagnetic field is determined by (1) and (2), i.e., by Maxwell’s equations with a given source Jek . As the\ninitial-value problem for this system of equations is well-known, we assume in the following that n > 0 on our\nspacetime manifold. (Or, to put this another way, we restrict our spacetime to an open subset on which n > 0.)\nNote that (3) implies U i∂i\n(\ngjkU\njUk\n)\n= 0. This guarantees that, if the condition gjkU\njUk = −1 is satisfied\nat one point, then it is satisfied along the whole integral curve of U i∂i that passes through this point. A similar\nstatement is true for the condition n > 0, provided that the external current is conserved, gik∇iJ\ne\nk = 0. To prove\nthis, we read from (2) that the conservation law for the external current implies ∇k\n(\nnUk\n)\n= 0 and thus\nUk∂kn+ n∇kU\nk = 0 . (4)\nIf x(t) is an integral curve of the vector field U i∂i, integration of (4) yields\nn\n(\nx(t2)\n)\n= n\n(\nx(t1)\n)\nexp\n{\n−\n∫ t2\nt1\n(\n∇kU\nk\n)(\nx(t)\n)\ndt\n}\n(5)\nso n cannot change sign along an integral curve of U i∂i. This is an important observation in view of the initial value\nproblem. It makes sure that, for a solution of the Maxwell-Lorentz equations, it suffices to check the conditions\ngijU\niU j = −1 and n > 0 on the initial hypersurface.\nTo illustrate the physical content of the Maxwell-Lorentz equations we briefly mention two different applications.\nFirstly, we can use these equations for modeling plasma waves in the Solar corona. In this case we would choose for\n(M, g) the Schwarzschild spacetime, for Je the electric current density of the ion component which could be assumed\nstatic, and for q and m the charge and the mass of the electron. The field variables are the total electromagnetic\nfield, the four-velocity of the electrons and the number density of the electrons. Secondly, we can consider an\nelectron beam in an accelerator. Then we would choose for (M, g) an open subset of the Minkowski spacetime (to\nmodel the spacetime region inside the accelerator pipe), for Je the zero one-form (as there is no external current\ninside the accelerator pipe), and for q and m the charge and the mass of the electron. The field variables are again\nthe total electromagnetic field (i.e., the field produced by the dust and the accelerating field which has no sources\ninside the pipe), the four-velocity of the electrons and the number density of the electrons.\n2\n3 Decomposition of the Maxwell-Lorentz equations into evolution equa-\ntions and constraints\nWe fix a spacetime point P and we choose local coordinates, on an appropriate neighborhood of P , such that the\nhypersurfaces x0 =constant are spacelike and the x0−lines are perpendicular to these hypersurfaces. We want to\ndiscuss if the prescription of appropriate initial data on the hypersurface x0 =constant through P determines a\nunique solution of the Maxwell-Lorentz equations on some neighborhood of P . To that end we have to decom-\npose the Maxwell-Lorentz equations into evolution equations (i.e., equations that do contain ∂0 derivatives) and\nconstraints (i.e., equations that do not contain ∂0 derivatives).\nThere are two constraints, given by equation (1) with all three indices spatial and by equation (2) with k = 0.\nAfter expressing covariant derivatives in terms of partial derivatives, introducing the Christoffel symbols of the\nmetric tensor, these two equations take the following form.\n∂µFνσ + ∂νFσµ + ∂σFµν = 0 , (6)\ngµν\n(\n∂µFν0 − Γ\nσ\nµνFσ0 − Γ\nσ\nµ0Fνσ − Γ\n0\nµ0Fν0\n)\n= Je0 − q n g00U\n0 . (7)\nThe remaining equations are the evolution equations: Evaluating equation (1) with one of the indices equal to 0\ngives three scalar equations,\n∂0Fµν + ∂µFν0 + ∂νF0µ = 0 . (8)\nEvaluating equation (2) with a spatial index, k = σ, gives another three scalar equations. After eliminating the\nnumber density n, with the help of (7), these equations read\n∂0F0σ +\ngµν\ng00\n∂µFνσ −\nUρ\nU0\ngσρg\nµν∂µFν0 =\ngµν\ng00\n(\nΓ0µνF0σ + Γ\nρ\nµνFρσ + Γ\n0\nµσFν0 + Γ\nρ\nµσFνρ\n)\n−\nUρ\nU0\ngσρg\nµν\n(\nΓτµνFτ0 + Γ\nρ\nµ0Fνρ + Γ\n0\nµ0Fν0\n)\n+ Γ000F0σ + Γ\nµ\n00Fµσ + Γ\nµ\n0σF0µ +\nJeσ\ng00\n−\nUρ\nU0\ngσρ J\ne\n0 . (9)\nFinally, evaluating equation (3) with a spatial index, j = σ, gives us again three scalar equations. With the help\nof equation (3) with j = 0, these equations can be rewritten as\n∂0\nUσ\nU0\n+\nUρ\nU0\n∂ρ\nUσ\nU0\n= −Γσ00 − 2Γ\nσ\n0µ\nUµ\nU0\n− Γσµν\nUµUν\n(U0)2\n+\nq\nm\n1\nU0\n{\ngστ\n(\nFτ0 + Fτρ\nUρ\nU0\n)\n−\nUσU τ\n(U0)2\ng00 F0τ\n}\n. (10)\nEquation (3) with j = 0 can be ignored because it is automatically satisfied if the other equations are, owing to\nthe normalisation condition gijU\niU j = −1 . So the system of evolution equations is given by nine scalar equations,\n(8), (9) and (10). Note that the number density n is not a dynamical variable; n has been eliminated from the\nevolution equations and is algebraically determined by the other field variables via (7).\nTo write the evolution equations in a more convenient form, we decompose the electromagnetic field into its\nelectric and magnetic components, Eσ and B\nν , with respect to the chosen coordinate system,\nFσ0 = Eσ and Fτρ = ετρνB\nν . (11)\nHere εσρν is the three-dimensional covariant ε–symbol, defined by being totally antisymmetric and satisfying\nε123 = 1. Moreover, we introduce the 3-velocity v\nσ of the dust,\nU i∂i = U\n0\n(\n∂0 + v\nσ∂σ\n)\n, (12)\nNote that then U0 is determined by the normalisation condition (U0)2(g00 + v\nµvνgµν) = −1 . If we use the three-\ndimensional contravariant ε–symbol εσρν , defined by being totally antisymmetric and satisfying ε123 = 1, we can\n3\nwrite the evolution equations in the following final form. (We use the identity εµνσεµντ = 2δ\nσ\nτ .)\n∂0B\nσ + εσµν∂µEν = 0 , (13)\n∂0Eσ −\ngµν\ng00\nενστ∂µB\nτ + vρ gσρg\nµν∂µEν =\ngµν\ng00\n(\nΓ0µνEσ − Γ\nρ\nµνερσνB\nν − Γ0µσEν − Γ\nρ\nµσενρτB\nτ\n)\n+ vρ gσρg\nµν\n(\nΓτµνEτ + Γ\nρ\nµ0ενρλB\nλ + Γ0µ0Eν\n)\n−\nJeσ\ng00\n+ vρ gσρ J\ne\n0 + Γ\n0\n00Eσ − Γ\nµ\n00εµσνB\nν + Γµ0σEµ , (14)\n∂0v\nσ + vρ∂ρv\nσ = −Γσ00 − 2Γ\nσ\n0µ v\nµ − Γσµν v\nµvν\n+\nq\nm\n√\n−g00 − vµvνgµν\n{\ngστ\n(\nEτ + ετρλv\nρBλ\n)\n+ g00vσvτEτ\n}\n. (15)\nWith the same notation, the constraints (6) and (7) read\n∂µB\nµ = 0 , (16)\nq n =\n√\n−g00 − vλvρgλρ\n− g00\n(\ngµν\n(\n∂µEν − Γ\nσ\nµνEσ − Γ\nσ\nµ0 ενστB\nτ − Γ0ν0Eµ\n)\n− Je0\n)\n. (17)\nNote that (13) implies ∂0∂σB\nσ = 0. Hence a solution of the evolution equations satisfies (16) everywhere if it\nsatisfies (16) on the initial hypersurface x0 = constant. As a consequence, the solutions to the Maxwell-Lorentz\nequations can be found by solving the initial-value problem of the evolution equations, with initial values for Eσ,\nBµ and vρ that satisfy (16) and that give a non-negative number density n via (17). Recall that, by (5), it suffices\nto check the condition of n being positive on the initial hypersurface.\nIf we write\n~E =\n\nE1E2\nE3\n\n , ~B =\n\nB1B2\nB3\n\n , ~v =\n\nv1v2\nv3\n\n , (18)\nthe evolution equations (13), (14) and (15) can be written in matrix form as a differential equation for a 9-component\ncolumn vector,\n∂0\n\n ~E~B\n~v\n\n − Lρ∂ρ\n\n ~E~B\n~v\n\n =\n\n~m1~m2\n~m3\n\n . (19)\nHere, L1,L2,L3 are 9× 9 matrices and ~m1, ~m2, ~m3 are 3-component column vectors. All of them depend on the\nspacetime coordinates, via the given background fields. In addition, the Lρ depend on ~v and the ~mρ depend on\nall dynamical variables ( ~E, ~B,~v), but not on their derivatives. Hence, (19) is a quasi-linear system of first-order\ndifferential equations for ( ~E, ~B,~v).\nWe can choose our coordinates such that, at the fixed spacetime point P , we have (gµν) = diag(−1, 1, 1, 1) and\nΓσµν = 0. Then we can read from (13), (14) and (15) that, at this point,\nL\nρ =\n\n−~v ⊗ ~e ρ −Aρ 0Aρ 0 0\n0 0 −vρ 1\n\n (20)\nwhere\n~e 1 =\n\n10\n0\n\n , ~e 2 =\n\n01\n0\n\n , ~e 3 =\n\n00\n1\n\n , (21)\nA\n1 =\n\n0 0 00 0 1\n0 −1 0\n\n , A2 =\n\n0 0 −10 0 0\n1 0 0\n\n , A3 =\n\n 0 1 0−1 0 0\n0 0 0\n\n . (22)\n4\nThe ~mρ are given, at the point P , by\n~m1 = ~J\ne + Je0~v , ~m2 = ~0 , ~m3 =\nq\nm\n√\n1− vτvλδτλ\n(\n~E + εµνσv\nµBν~e σ − vρEρ~v\n)\n. (23)\nIf (M, g) is Minkowski spacetime, and if we use standard Minkowski coordinates, (20) and (23) hold not only at\none point but everywhere.\n4 Strong hyperbolicity of the Maxwell-Lorentz equations\nIn this section we will demonstrate that the initial-value problem for the evolution equations of the Maxwell-Lorentz\nsystem is well-posed. If we assume that the background fields are analytic, and that we give analytic initial data\nfor ( ~E, ~B,~v), local existence and uniqueness of a solution follows from the Cauchy-Kowalevsky theorem; this was\nthe result found by Parrott [6]. (Parrott only considered the case that (M, g) is Minkowski spacetime and that\nJe vanishes, but the result carries over immediately to our more general case.) For the reasons outlined in the\nintroduction, we want to have an existence and uniqueness statement for non-analytic data. To that end we have\nto recall some terminology and some results from the theory of partial differential equations.\nFor a quasi-linear system of first-order partial differential equations of the form (19), the left-hand side of (19)\nis called the principal part. Existence and uniqueness of solutions is completely determined by the principal part\nand hence by the matrices Lρ. (19) is called hyperbolic if for any ~p = pρ~e\nρ ∈ R3 the eigenvalues of the 9 × 9\nmatrix pρL\nρ are real. (19) is called strongly hyperbolic or symmetrisable if, in addition, for each eigenvalue the\ngeometric multiplicity equals the algebraic multiplicity, i.e., if pρL\nρ has nine linearly independent real eigenvectors.\nAn equivalent condition is that there exists a matrix H(~p) such that H(~p)pρL\nρ is symmetric.\nAccording to a fundamental theorem from the theory of partial differential equations (see, e.g. Taylor [7],\nTheorem 5.2.D), strong hyperbolicity guarantees that the initial-value problem is well-posed for Sobolev Hs data.\n(A function is of class Hs if its sth derivative exists almost everywhere and is locally square-integrable.) In general,\ns must be chosen greater than (n + 2)\/2, where n is the dimension of the initial hypersurface. If adapted to our\ncase, the theorem can be stated in the following way.\nAssume that (19) is strongly hyperbolic, with the matrices Lρ and the vectors ~mρ smoothly depending on the\nspacetime coordinates and on the dynamical variables ( ~E, ~B,~v). Choose initial data of class Hs for ( ~E, ~B,~v) on\nthe hypersurface x0 =constant through the spacetime point P , where s ≥ 3. Then\n• a solution to (19) with the prescribed initial data exists on a neighborhood of P ;\n• on this neighborhood, the solution is uniquely determined by the initial data;\n• the solution depends continuously, with respect to the Hs topology, on the initial data.\nIt is now our goal to demonstrate that the evolution equations of the Maxwell-Lorentz system are strongly\nhyperbolic. If this result has been established, we know that the initial-value problem is well-posed, provided that\nour background fields gµν and J\ne\nµ depend smoothly on the spacetime coordinates and the initial data are of class\nHs with s ≥ 3.\nAs strong hyperbolicity is an algebraic property that is to be checked pointwise, we may assume that the\nmatrices Lρ are given by (20), hence\npρL\nρ =\n\n−~v ⊗ ~p −pρAρ 0pρAρ 0 0\n0 0 −pρv\nρ\n1\n\n . (24)\nWe have to show that this matrix has nine linearly independent real eigenvectors for each ~p = pρ~e\nρ ∈ R3. We first\ndetermine the eigenvalues. p0 is an eigenvalue of pρL\nρ if the characteristic equation\ndet\n(\np01− pρL\nρ\n)\n= 0 (25)\nis satisfied. If this equation holds, pidx\ni = p0dx\n0 + pµdx\nµ is called a characteristic covector of the evolution\nequations. Upon inserting pρL\nρ from (24) into (25), the determinant can be calculated with the help of some\nelementary algebra. As a result of this calculation, the characteristic equation reads\n(p20 − δ\nµνpµpν)\n2 (p0 + pρv\nρ)4 p0 = 0 , (26)\n5\nso the eigenvalues are\n√\nδµνpµpν , −\n√\nδµνpµpν , −pρv\nρ and 0. As all eigenvalues are real, this demonstrates that\nthe evolution equations are hyperbolic.\nWe will now prove that they are even strongly hyperbolic. To that end we have to determine the corresponding\neigenvectors. As the case ~p = ~0 is trivial, we may assume that ~p 6= ~0. Owing to the homogeneity of the eigenvalue\nequation it suffices to consider the case that δµνpµpν = 1. It is then straight-forward to verify that\nE1 =\n\n\n\n ~u−pρAρ~u\n~0\n\n\n∣∣∣∣∣∣ ~u = uρ~e ρ ∈ R3 , δµνuµpν = 0\n\n (27)\nis a two-dimensional eigenspace of the eigenvalue p0 = 1,\nE2 =\n\n\n\n−pρAρ ~w~w\n~0\n\n\n∣∣∣∣∣∣ ~w = wρ~e ρ ∈ R3 , δµνwµpν = 0\n\n (28)\nis a two-dimensional eigenspace of the eigenvalue p0 = −1,\nE3 =\n\n\n\nα\n(\n~p− pρv\nρ~v\n)\n−αpρA\nρ~v\n~z\n\n\n∣∣∣∣∣∣ α ∈ R , ~z ∈ R3\n\n (29)\nis a four-dimensional eigenspace of the eigenvalue p0 = −pρv\nρ, and\nE4 =\n\n\n\n ~0β~p\n~0\n\n\n∣∣∣∣∣∣ β ∈ R\n\n (30)\nis a one-dimensional eigenspace of the eigenvalue p0 = 0. The eigenspaces E1, E2, E3 and E4 span the whole space,\neven in the case of further degeneracy (i.e., even if pρv\nρ = 0 or pρv\nρ = ±1). This demonstrates that the evolution\nequations are strongly hyperbolic.\nThis concludes the local existence-and-uniqueness proof for solutions ( ~E, ~B,~v) to the evolution equations. For\nsolving the full set of Maxwell-Lorentz equations, we have to single out those solutions to the evolution equations\nthat satisfy the constraints. As a consequence, not all eigenvectors in E1, E2, E3 and E4 are associated with solutions\nof the full set of Maxwell-Lorentz equations. The condition n > 0 does not restrict the eigenvectors. However,\nequation (16) reduces the eigenspaces according to\nEˆA =\n\n\n\n ~E0~B0\n~v0\n\n ∈ EA\n∣∣∣∣∣∣ pµBµ0 = 0\n\n , A = 1, 2, 3, 4 . (31)\nBy inspection we find that Eˆ1 = E1, Eˆ2 = E2, Eˆ3 = E3 whereas Eˆ4 consists of the zero-vector only, so p0 = 0 is\nno longer an eigenvalue if the constraints are taken into account. This reduces the characteristic equation of the\nevolution equations (26) to the characteristic equation of the full set of Maxwell-Lorentz equations,\n(p20 − δ\nµνpµpν)\n2 (p0 + v\nρpρ)\n4 = 0 . (32)\nIn physical terms, (32) gives us the three branches of the dispersion relation,\np0 =\n√\nδµνpµpν , p0 = −\n√\nδµνpµpν , p0 = −v\nρpρ . (33)\nFrom the corresponding eigenspaces we read that the first two branches are associated with the (past-oriented and\nfuture-oriented, respectively) propagation of the electromagnetic field, whereas the third branch is associated with\nthe propagation of the dust. If we calculate the group velocity (or ray velocity)\nvµgr =\n∂(−p0)\n∂pµ\n, (34)\nfor each branch of the dispersion relation we see that the electromagnetic field can propagate in any spatial direction\nwith the vacuum speed of light ( vµgrv\nν\ngrδµν = 1), whereas the dust propagates with v\nµ\ngr = v\nµ.\n6\n5 Example: Spherically symmetric solutions on Minkowski spacetime\nKnowing that the initial-value problem admits a unique solution is one thing, actually determining this solution\nis another. In most cases one can find the solution only numerically. However, in some cases of high symmetry\nit is actually possible to work out some features of the solution explicitly. Parrot [6] considers two such cases: (i)\nspherically symmetric solutions on Minkowski spacetime, and (ii) solutions on Minkowski spacetime that depend\nonly on one of the three spatial Cartesian coordinates (x, y, z). The first case is concerned with expanding or\ncollapsing shells of charge, and the second case with moving “walls” of charge. Burton, Gratus and Tucker also\nconsidered the first case [8] and the second case [1].\nHere we want to revisit spherically symmetric solutions. Using Parrott’s treatment of this case as a general\nguide, we will get some results that go beyond his findings. In particular, we will solve the differential equations\nfor the flow lines of the dust explicitly, and we will get some additional insight into the qualitative features of the\nsolutions. Although spherically symmetric fields are somewhat over-idealised, we find it instructive to study this\ncase. As we will see, it illustrates the way in which the constraints have to be built in and it demonstrates how\ncaustics are formed, thereby preventing the solution from being global.\nWe assume that the background metric is the Minkowski metric and that the external current vanishes, Jei = 0.\nIn spherical polar coordinates (x0, x1, x2, x3) = (t, r, ϑ, ϕ), the metric reads\ngijdx\nidxj = − dt2 + dr2 + r2\n(\nsin2ϑ dϕ2 + dϑ2\n)\n. (35)\nFor spherically symmetric situations, the constraints equation (16) can hold with a non-zero magnetic field only if\nthere is a magnetic monopole at r = 0. We exclude the existence of magnetic monopoles and, thus, assume that\nBσ = 0. We are then left with only two dynamical variables,\nEµdx\nµ = E(r, t)dr , (36)\nvµ∂µ = v(r, t) ∂r , (37)\nand the evolution equations (13), (14) and (15) are identically satisfied, apart from the following two scalar\nequations,\n∂E(r, t)\n∂t\n+ v(r, t)\n∂E(r, t)\n∂r\n= −\n2\nr\nv(r, t)E(r, t) , (38)\n∂v(r, t)\n∂t\n+ v(r, t)\n∂v(r, t)\n∂r\n=\nq\nm\n√\n1− v(r, t)2\n3\nE(r, t) , (39)\nThe constraints (16) and (17) reduce to a single scalar equation,\nq n(r, t) =\n√\n1− v(r, t)2\n( ∂E(r, t)\n∂r\n+\n2\nr\nE(r, t)\n)\n, (40)\nwhich gives the charge density q n(r, t) in terms of the dynamical variables E(r, t) and v(r, t). Note that the electric\nfield is to be interpreted as the field produced by the charged dust plus, possibly, a source-free field. The only\nspherically symmetric electric field that is source-free, on a spherical shell r1 < r < r2, is a Coulomb field; i.e., it\ncan be realised by a point charge at r = 0.\nTo solve the system of equations (38), (39), and (40) we would have to give initial values E(r, t0) and v(r, t0)\non a certain interval r1 < r < r2. With such initial data given, our existence and uniqueness result guarantees that\nthere is a unique local solution to (38) and (39). From all possible initial values we would then have to discard all\nthose for which (40) gives a negative number density n(r, t) on the initial hypersurface.\nThe latter constraint is a bit awkward. It would be more convenient if we could give the initial data in terms of\nn(r, t0) directly. Also, if we want to explicitly integrate (38) and (39) we have to face the problem that these two\nequations are coupled. It would be nicer to have an equation for either the electric field or the flowlines of the dust\nalone. Both goals can, indeed, be achieved if we rearrange our system of equations appropriately. To that end we\nfirst define\nQ(r, t) = 4 π r2 E(r, t) . (41)\nThis definition follows Parrott, adapted to our choice of units. (Parrott has a factor 4π in Maxwell’s equations, we\ndon’t.) Then (40) can be rewritten as\nq n(r, t) =\n√\n1− v(r, t)2\n4 π r2\n∂Q(r, t)\n∂r\n. (42)\n7\nUpon integration, this yields\nQ(r, t) = Q(r0, t) + 4 π q\n∫ r\nr0\nn(s, t) s2 ds√\n1− v(s, t)2\n(43)\nwhere r0 is any chosen radius value. As q n(r, t) is the proper charge density, q n(r, t)\/\n√\n1− v(r, t)2 is the charge\ndensity in the chosen inertial frame. Hence we read from equation (43) that Q(r, t)−Q(r0, t) is the total charge in\nthe shell between radius r0 and radius r at time t. After replacing the original pair of dynamical variables (E, v)\nby (Q, v), the evolution equations (38) and (39) read\n∂Q(r, t)\n∂t\n+ v(r, t)\n∂Q(r, t)\n∂r\n= 0 , (44)\n∂v(r, t)\n∂t\n+ v(r, t)\n∂v(r, t)\n∂r\n=\nq\nm\n√\n1− v(r, t)2\n3\n4 π r2\nQ(r, t) . (45)\nIf we evaluate these equations along a flow line\n(\nr(t), ϕ(t) = ϕ0, ϑ(t) = ϑ0\n)\nof the dust, such that v\n(\nr(t), t\n)\n=\ndr(t)\/dt, we find\ndQ\n(\nr(t), t\n)\ndt\n= 0 , (46)\ndv\n(\nr(t), t\n)\ndt\n=\nq\nm\n√\n1− v\n(\nr(t), t\n)2 3\n4 π r2\nQ\n(\nr(t), t\n)\n. (47)\nThe first equation says that Q is conserved along each flow line of the dust. With this information at hand, the\nsecond equation can be viewed as a second-order differential equation for the flow lines alone. We can, thus, solve\nour system of equations in the following way.\nFix a time t0 and a radius value r0. Prescribe, on an interval r1 < r < r2, initial values\nn(r, t0) = n0(r) , n0(r) > 0 , (48)\nv(r, t0) = v0(r) , v0(r)\n2 < 1 , (49)\nE(r0, t0) = E0 . (50)\nThe freedom of choosing a value for E0 corresponds to the freedom of adding a Coulomb field, i.e., a point charge\nat r = 0.\nThe data (48), (49) and (50) determine initial values for the function Q, namely\nQ(r, t0) = 4 π r\n2\n0 E0 + 4 π q\n∫ r\nr0\nn0(s) s\n2 ds√\n1− v0(s)2\n. (51)\nThen (47) gives us a second-order differential equation for the flow lines of the dust,\nd2r(t)\ndt2\n=\nq\nm\n{\n1 −\n(dr(t)\ndt\n)2 }3\/2 Q(r′, t0)\nr(t)2\n, (52)\nthat has to be solved with initial conditions\nr(t0) = r\n′ and\ndr\ndt\n(\nt0\n)\n= v0(r\n′) (53)\nfor all r1 < r\n′ < r2. If we have determined the flow lines, our dynamical problem is essentially solved. It is true\nthat knowing the flow lines does not allow us to write closed form expressions for the other dynamical variables.\nHowever, all the relevant information is then known: The function Q, which determines the charge in any spherical\nshell, is fixed by being constant along the flow lines; thereupon the electric field is fixed by (41). The solution exists\nand is unique until the flow lines begin crossing over and forming caustics.\nSo our problem has been reduced, in essence, to solving the differential equation (52). This can actually be\ndone explicitly. After multiplying both sides with dr(t)\/dt, (52) can be rewritten as\nd\ndt\n({\n1−\n(dr(t)\ndt\n)2}−1\/2 )\n= −\nq Q(r′, t0)\nm\nd\ndt\n( 1\nr(t)\n)\n. (54)\n8\nThis gives us a first integral, {\n1−\n(dr(t)\ndt\n)2}−1\/2\n+\nq Q(r′, t0)\nmr(t)\n= A(r′) . (55)\nThe value of the constant of motion A(r′) is determined by evaluating (55) at t = t0,\n{\n1− v0(r\n′)2\n}\n−1\/2\n+\nq Q(r′, t0)\nmr′\n= A(r′) . (56)\nEquation (55) has the interesting consequence that a dust particle can reach the origin, r(t) = 0, only if it arrives\nthere at the speed of light,\n(\ndr(t)\/dt\n)2\n= 1. The only exception are trajectories with Q(r′, t0) = 0 which, by\n(52), are straight lines. Note that trajectories with qQ(r′, t0) > 0 are accelerating outwards and trajectories with\nqQ(r′, t0) < 0 are accelerating inwards.\nThe first-order differential equation (55) can be solved by separation of variables. We find\n± t =\nq Q(r′, t0)\nmZ(r′)3\/2\nln\n(\n2\n√\nZ(r′)\n√\nZ(r′) r2 − 2\nq Q(r′, t0)\nm\nA(r′) r +\nq2Q(r′, t0)2\nm2\n(57)\n+ 2Z(r′) r − 2\nq Q(r′, t0)\nm\nA(r′)\n)\n+ B(r′)\nif Z(r′) = A(r′)2 − 1 > 0,\n± t =\nq Q(r′, t0)\nm\n(\n− Z(r′)\n)3\/2 arcsin\n\n 2Z(r\n′) r − 2\nq Q(r′, t0)\nm\nA(r′)√\n4\nA(r′)2 q2Q(r′, t0)\n2\nm2\n− 4Z(r′)\nq2Q(r′, t0)\n2\nm2\n\n + B(r′) (58)\nif Z(r′) = A(r′)2 − 1 < 0, and\n± t =\n√\n− 2\nq Q(r′, t0)\nm\nA(r′) r +\nq2Q(r′, t0)\n2\nm2\n( 2\n3A(r′)\n−\nmr\n3 q Q(r′, t0)\n)\n+ B(r′) (59)\nif Z(r′) = A(r′)2 − 1 = 0. In all three cases, the integration constant B(r′) is determined by setting t = t0 and\nr = r′, and the sign on the left-hand side must be chosen positive for outward going and negative for inward going\nparts of the trajectory.\nFor any specific choice of the initial conditions, (57), (58) and (59) give us the flow lines of the dust which\ncan then be plotted in an (r, t) spacetime diagram. For the sake of illustration, we choose the following initial\nconditions on the interval 0 < r < r0,\nn(r, t0) = a (r0 − r)\n2 , (60)\nv(r, t0) = 0 , (61)\nE(r0, t0) = E0 , (62)\nwhere a is a positive constant and E0 is a constant that may be chosen positive, negative, or zero. In this case\nour system describes a charged ball of radius r0 that is initially at rest; in addition, there is a point charge at the\norigin whose value depends on the chosen value of E0.\nFigures 1, 2 and 3 show Maple plots of the flow lines in an (r, t) spacetime diagram for three qualitatively\ndifferent cases, depending on the chosen value of E0. As discussed in the captions of the figures, this example\nnicely demonstrates the role of the point charge at the origin (and, thereby, of the fact that in general the choice\nof initial values for the Maxwell-Lorentz equations includes the choice of a source-free electromagnetic field). It\nalso illustrates how a caustic is formed (which is the main reason why, in general, existence and uniqueness of a\nsolution is guaranteed only locally near the initial hypersurface).\n9\nr0\nr\nt\nFigure 1: If qE0 is negative, qQ(r, t0) is negative on the whole interval 0 < r < r0. In this case there is a point\ncharge at the centre whose charge has the opposite sign as the charge of the dust. The Coulomb attraction of this\npoint charge is so strong that it overcomes the Coulomb repulsion of the dust particles and sucks the whole ball of\ncharge into the origin in a finite time. All dust particles arrive at the origin with the speed of light. Although the\ninitial condition for the dust’s density, n(r, t0), admits a regular extension into the origin, the density is singular at\nthe origin for all later times. If one assumes that the dust particles can pass through each other when they meet\nat the origin, the ball would re-expand after its collapse.\n10\nr0\nr\nt\nFigure 2: If 0 < qE0 < q\n2ar30\/30, there is a radius value r between 0 and r0 for which Q(r, t0) becomes zero. At\nthis radius, the ball is stationary. The outer part expands because here the Coulomb repulsion of the dust particles\nis stronger than the Coulomb attraction of the point charge towards the origin; the inner part collapses because\nhere it is vice versa. Again, any dust particle that reaches the origin arrives there at the speed of light, and the\ndensity n(r, t) is singular at r = 0 for all t > t0.\n11\nr0\nr\nt\nFigure 3: If qE0 > q\n2ar30\/30, the point charge at the centre has the same sign as the charge of the dust, so it\nenhances the tendency of the dust to expand outwards. The inner parts of the ball move faster than the outer\nparts and overtake them, thereby forming a caustic. The solution to the Maxwell-Lorentz equations breaks down\nwhen flow lines cross over. As guaranteed by our general theorem, the solution is well-defined and unique on a\nneighborhood of the initial hypersurface. In this case, the latter is a snapshot of a punctured ball.\n12\n6 Conclusion\nIn this article we have demonstrated that the initial-value problem of the Maxwell-Lorentz equations is well-posed,\nand we have illustrated some qualitative features of these equations by studying spherically symmetric solutions on\nMinkowski spacetime. In view of applications, it is desirable to generalise our result in two directions. Firstly, one\nwould like to include a pressure term into the equations, thereby allowing for situations where temperature and\ndensity are so high that the model of a “dust” (or “cold fluid”) is no longer applicable. Secondly, one would like to\nconsider mixtures of two or more fluids which are dynamically coupled together. This would allow for considering\ntwo-fluid models of plasmas, treating both the electron component and the ion component as dynamical fields. In\nparticular the first generalisation would require a considerable change in the mathematical techniques. Whereas\nfor our treatment of a dust it was crucial that the density could be eliminated from the evolution equations, this\nwould no longer be true for a fluid with pressure. One would have to use either the density or the pressure as an\nadditional dynamical variable, and to eliminate the other one with the help of an equation of state. One would also\nexpect that a pressure term would change the behaviour of a collapsing ball of charge. In particular, the somewhat\npathological behaviour near the centre, as discussed in Chapter 5, is likely to be modified by a pressure term.\nAcknowledgment\nVP wishes to thank Nico Giulini for clarifying comments on the interpretation of solutions to the Maxwell-Lorentz\nequations. VP has also profited from discussions on the subject with his Lancaster colleagues, in particular with\nDavid Burton, Jonathan Gratus and Robin Tucker.\nReferences\n[1] D. A. Burton, J. Gratus, and R. W. Tucker. Asymptotic analysis of ultra-relativistic charge. Ann. Phys. (NY),\n322:599–630, 2007.\n[2] H. Spohn. Dynamics of charged particles and their radiation field. Cambridge University Press, Cambridge,\n2004.\n[3] A. Komech and H. Spohn. Long-time asymptotics for the coupled Maxwell-Lorentz equations. Commun. Partial\nDiff. Equat., 25:559–584, 2000.\n[4] M. Kunze and H. Spohn. Adiabatic limit for the Maxwell-Lorentz equations. Ann. H. Poincare´, 1:625–654,\n2000.\n[5] G. Bauer and D. Du¨rr. The Maxwell-Lorentz system of a rigid charge. Ann. H. Poincare´, 2:179–196, 2001.\n[6] S. Parrott. Relativistic electrodynamics and differential geometry. Springer, New York, 1987.\n[7] M. E. Taylor. Pseudodifferential operators and nonlinear PDE. Birkha¨user, Boston, 1991.\n[8] D. A. Burton, J. Gratus, and R. W. Tucker. Multiple currents in charged continua. J. Phys. A, 40:811–829,\n2007.\n13\n"}