{"doi":"10.1371\/journal.pbio.1000179","coreId":"59817","oai":"oai:nora.nerc.ac.uk:7988","identifiers":["oai:nora.nerc.ac.uk:7988","10.1371\/journal.pbio.1000179"],"title":"Host Niches and Defensive Extended Phenotypes Structure Parasitoid Wasp Communities","authors":["Bailey, Richard","Schonrogge, Karsten","Cook, James M.","Melika, George","Csoka, Gyorgy","Thuroczy, Csaba","Stone, Graham N."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-08","abstract":"Oak galls are spectacular extended phenotypes of gallwasp genes in host oak tissues and have evolved complex\\ud\nmorphologies that serve, in part, to exclude parasitoid natural enemies. Parasitoids and their insect herbivore hosts have coevolved to produce diverse communities comprising about a third of all animal species. The factors structuring these communities, however, remain poorly understood. An emerging theme in community ecology is the need to consider the effects of host traits, shaped by both natural selection and phylogenetic history, on associated communities of natural enemies. Here we examine the impact of host traits and phylogenetic relatedness on 48 ecologically closed and species-rich communities of parasitoids attacking gall-inducing wasps on oaks. Gallwasps induce the development of spectacular and\\ud\nstructurally complex galls whose species- and generation-specific morphologies are the extended phenotypes of gallwasp genes. All the associated natural enemies attack their concealed hosts through gall tissues, and several structural gall traits have been shown to enhance defence against parasitoid attack. Here we explore the significance of these and other host traits in predicting variation in parasitoid community structure across gallwasp species. In particular, we test the ‘‘Enemy Hypothesis,’’ which predicts that galls with similar morphology will exclude similar sets of parasitoids and therefore have similar parasitoid communities. Having controlled for phylogenetic patterning in host traits and communities, we found\\ud\nsignificant correlations between parasitoid community structure and several gall structural traits (toughness, hairiness, stickiness), supporting the Enemy Hypothesis. Parasitoid community structure was also consistently predicted by components of the hosts’ spatiotemporal niche, particularly host oak taxonomy and gall location (e.g., leaf versus bud versus seed). The combined explanatory power of structural and spatiotemporal traits on community structure can be high, reaching 62% in one analysis. The observed patterns derive mainly from partial niche  specialisation of highly generalist parasitoids with broad host ranges (.20 hosts), rather than strict separation of enemies with narrower host ranges, and so may contribute to maintenance of the richness of generalist parasitoids in gallwasp communities. Though evolutionary escape from parasitoids might most effectively be achieved via changes in host oak taxon, extreme conservatism in this trait\\ud\nfor gallwasps suggests that selection is more likely to have acted on gall morphology and location. Any escape from\\ud\nparasitoids associated with evolutionary shifts in these traits has probably only been transient, however, due to subsequent recruitment of parasitoid species already attacking other host galls with similar trait combinations","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/59817.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/7988\/1\/Parasitoid_communities_and_the_extended_phenotype_of_gallwasps.pdf","pdfHashValue":"f13a4c1dd15ec1c9dce586d7a91af48299167a15","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:7988<\/identifier><datestamp>\n      2013-09-06T13:12:17Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533236<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/7988\/<\/dc:relation><dc:title>\n        Host Niches and Defensive Extended Phenotypes Structure Parasitoid Wasp Communities<\/dc:title><dc:creator>\n        Bailey, Richard<\/dc:creator><dc:creator>\n        Schonrogge, Karsten<\/dc:creator><dc:creator>\n        Cook, James M.<\/dc:creator><dc:creator>\n        Melika, George<\/dc:creator><dc:creator>\n        Csoka, Gyorgy<\/dc:creator><dc:creator>\n        Thuroczy, Csaba<\/dc:creator><dc:creator>\n        Stone, Graham N.<\/dc:creator><dc:subject>\n        Zoology<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        Oak galls are spectacular extended phenotypes of gallwasp genes in host oak tissues and have evolved complex\\ud\nmorphologies that serve, in part, to exclude parasitoid natural enemies. Parasitoids and their insect herbivore hosts have coevolved to produce diverse communities comprising about a third of all animal species. The factors structuring these communities, however, remain poorly understood. An emerging theme in community ecology is the need to consider the effects of host traits, shaped by both natural selection and phylogenetic history, on associated communities of natural enemies. Here we examine the impact of host traits and phylogenetic relatedness on 48 ecologically closed and species-rich communities of parasitoids attacking gall-inducing wasps on oaks. Gallwasps induce the development of spectacular and\\ud\nstructurally complex galls whose species- and generation-specific morphologies are the extended phenotypes of gallwasp genes. All the associated natural enemies attack their concealed hosts through gall tissues, and several structural gall traits have been shown to enhance defence against parasitoid attack. Here we explore the significance of these and other host traits in predicting variation in parasitoid community structure across gallwasp species. In particular, we test the ‘‘Enemy Hypothesis,’’ which predicts that galls with similar morphology will exclude similar sets of parasitoids and therefore have similar parasitoid communities. Having controlled for phylogenetic patterning in host traits and communities, we found\\ud\nsignificant correlations between parasitoid community structure and several gall structural traits (toughness, hairiness, stickiness), supporting the Enemy Hypothesis. Parasitoid community structure was also consistently predicted by components of the hosts’ spatiotemporal niche, particularly host oak taxonomy and gall location (e.g., leaf versus bud versus seed). The combined explanatory power of structural and spatiotemporal traits on community structure can be high, reaching 62% in one analysis. The observed patterns derive mainly from partial niche  specialisation of highly generalist parasitoids with broad host ranges (.20 hosts), rather than strict separation of enemies with narrower host ranges, and so may contribute to maintenance of the richness of generalist parasitoids in gallwasp communities. Though evolutionary escape from parasitoids might most effectively be achieved via changes in host oak taxon, extreme conservatism in this trait\\ud\nfor gallwasps suggests that selection is more likely to have acted on gall morphology and location. Any escape from\\ud\nparasitoids associated with evolutionary shifts in these traits has probably only been transient, however, due to subsequent recruitment of parasitoid species already attacking other host galls with similar trait combinations.<\/dc:description><dc:date>\n        2009-08<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/7988\/1\/Parasitoid_communities_and_the_extended_phenotype_of_gallwasps.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Bailey, Richard; Schonrogge, Karsten; Cook, James M.; Melika, George; Csoka, Gyorgy; Thuroczy, Csaba; Stone, Graham N..  2009  Host Niches and Defensive Extended Phenotypes Structure Parasitoid Wasp Communities.   PLoS Biology, 7 (8), e1000179. 12, pp.  https:\/\/doi.org\/10.1371\/journal.pbio.1000179 <https:\/\/doi.org\/10.1371\/journal.pbio.1000179>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.plosbiology.org\/article\/info%3Adoi%2F10.1371%2Fjournal.pbio.1000179<\/dc:relation><dc:relation>\n        10.1371\/journal.pbio.1000179<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/7988\/","http:\/\/www.plosbiology.org\/article\/info%3Adoi%2F10.1371%2Fjournal.pbio.1000179","10.1371\/journal.pbio.1000179"],"year":2009,"topics":["Zoology","Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Host Niches and Defensive Extended Phenotypes\nStructure Parasitoid Wasp Communities\nRichard Bailey1,2, Karsten Scho¨nrogge3, James M. Cook4,5,6*, George Melika7, Gyo¨rgy Cso´ka8, Csaba\nThuro´czy9, Graham N. Stone1\n1 Institute of Evolutionary Biology, School of Biology, University of Edinburgh, Edinburgh, United Kingdom, 2Department of Animal Ecology, Evolutionary Biology Centre,\nUppsala University, Uppsala, Sweden, 3Centre for Ecology and Hydrology, CEH Wallingford, Wallingford, United Kingdom, 4Division of Biology, Imperial College London,\nAscot, United Kingdom, 5Centre for Population Biology, Imperial College London, Silwood Park Campus, Ascot, United Kingdom, 6 School of Biological Sciences,\nWhiteknights, University of Reading, Reading, United Kingdom, 7 Systematic Parasitoid Laboratory, Vas County Plant Protection and Soil 15 Conservation Service, Ko¨szeg,\nHungary, 8Hungarian Forest Research Institute, Ma´trafu¨red Research Station, Ma´trafu¨red, Hungary, 9Malomarok, Ko¨szeg, Hungary\nAbstract\nOak galls are spectacular extended phenotypes of gallwasp genes in host oak tissues and have evolved complex\nmorphologies that serve, in part, to exclude parasitoid natural enemies. Parasitoids and their insect herbivore hosts have\ncoevolved to produce diverse communities comprising about a third of all animal species. The factors structuring these\ncommunities, however, remain poorly understood. An emerging theme in community ecology is the need to consider the\neffects of host traits, shaped by both natural selection and phylogenetic history, on associated communities of natural\nenemies. Here we examine the impact of host traits and phylogenetic relatedness on 48 ecologically closed and species-rich\ncommunities of parasitoids attacking gall-inducing wasps on oaks. Gallwasps induce the development of spectacular and\nstructurally complex galls whose species- and generation-specific morphologies are the extended phenotypes of gallwasp\ngenes. All the associated natural enemies attack their concealed hosts through gall tissues, and several structural gall traits\nhave been shown to enhance defence against parasitoid attack. Here we explore the significance of these and other host\ntraits in predicting variation in parasitoid community structure across gallwasp species. In particular, we test the ‘‘Enemy\nHypothesis,’’ which predicts that galls with similar morphology will exclude similar sets of parasitoids and therefore have\nsimilar parasitoid communities. Having controlled for phylogenetic patterning in host traits and communities, we found\nsignificant correlations between parasitoid community structure and several gall structural traits (toughness, hairiness,\nstickiness), supporting the Enemy Hypothesis. Parasitoid community structure was also consistently predicted by\ncomponents of the hosts’ spatiotemporal niche, particularly host oak taxonomy and gall location (e.g., leaf versus bud\nversus seed). The combined explanatory power of structural and spatiotemporal traits on community structure can be high,\nreaching 62% in one analysis. The observed patterns derive mainly from partial niche specialisation of highly generalist\nparasitoids with broad host ranges (.20 hosts), rather than strict separation of enemies with narrower host ranges, and so\nmay contribute to maintenance of the richness of generalist parasitoids in gallwasp communities. Though evolutionary\nescape from parasitoids might most effectively be achieved via changes in host oak taxon, extreme conservatism in this trait\nfor gallwasps suggests that selection is more likely to have acted on gall morphology and location. Any escape from\nparasitoids associated with evolutionary shifts in these traits has probably only been transient, however, due to subsequent\nrecruitment of parasitoid species already attacking other host galls with similar trait combinations.\nCitation: Bailey R, Scho¨nrogge K, Cook JM, Melika G, Cso´ka G, et al. (2009) Host Niches and Defensive Extended Phenotypes Structure Parasitoid Wasp\nCommunities. PLoS Biol 7(8): e1000179. doi:10.1371\/journal.pbio.1000179\nAcademic Editor: Anurag A. Agrawal, Cornell University, United States of America\nReceived September 3, 2008; Accepted July 15, 2009; Published August 25, 2009\nCopyright: \u0001 2009 Bailey et al. This is an open-access article distributed under the terms of the Creative Commons Attribution License, which permits\nunrestricted use, distribution, and reproduction in any medium, provided the original author and source are credited.\nFunding: This work was supported by grant numbers GR\/12847 and NER\/B\/504406\/1 from the UK Natural Environment Research Council to GNS, JMC, and KS,\nand by collaborative research grants to GNS, JMC, GM, and GC from the Royal Society of London and the British Council. The funders had no role in study design,\ndata collection and analysis, decision to publish, or preparation of the manuscript.\nCompeting Interests: The authors have declared that no competing interests exist.\nAbbreviations: MAM, minimal adequate model; MCA, matrix correlation analysis; MDS, multidimensional scaling; PRA, phylogenetic regression analysis.\n* E-mail: james.cook@reading.ac.uk\nIntroduction\nIdentifying the processes that structure communities remains\none of the fundamental challenges facing ecology [1–5] and\ngreatly influences our ability to predict the effects of species\ninvasions and extinctions [6–8]. However, the issues are complex,\nand recent reviews have emphasised the need for new approaches\nto understanding the ecology and evolution of communities [9–\n11]. Two important emerging themes are (i) the effects of adaptive\ntrait variation at one trophic level upon other levels [1,2,5,12,13]\nand (ii) the roles of evolutionary history and phylogenetically\nconserved traits in determining current community structure\n[4,11,14,16].\nHere we address these issues in a study that focuses on diverse,\nclearly defined communities of parasitoid wasps attacking insect\nherbivore hosts. Understanding the processes structuring host–\nparasitoid communities is important because parasitoid wasps and\ntheir insect hosts comprise about one-third of all animal species,\nand more than 50% of all terrestrial animal species [17].\nParasitoids also play a major role in regulating populations of\nPLoS Biology | www.plosbiology.org 1 August 2009 | Volume 7 | Issue 8 | e1000179\ntheir insect hosts, and the ecosystem service they provide in\nreducing losses to herbivores and stored product pests is estimated\nat billions of dollars annually [1,2,8,15,16]. Detailed studies of\nsingle insect host species have shown that variation in host traits,\nincluding feeding location, feeding mode, and host plant species\n[1,2,15,16], influences the mortality imposed by parasitoids.\nHowever, much less is known of the effects of host trait evolution\non parasitoid community composition [5,18]. Addressing this issue\nrequires examination of patterns in parasitoid communities across\nhost species, and because related host species may share both\nsimilar traits and parasitoid communities through shared common\nancestry [19,20], this in turn requires explicit consideration of host\nphylogeny.\nWe studied the parasitoid wasp communities associated with a\nmajor radiation of herbivorous insects—cynipid gallwasps (Hyme-\nnoptera, Cynipidae) on oak trees (Quercus species)—a host taxon with\nsome 1,000 herbivore species, distributed primarily in northern\ntemperate regions [24]. These communities are excellent test\nsubjects because they are diverse and well studied [21–29], and the\nvast majority of the associated parasitoids attack only oak\ngallwasps [21,22,24,30,31]. The communities are thus ecologically\n‘‘closed’’ and may meaningfully be considered in isolation.\nOak gallwasps induce the development of spectacular galls\n(Figures 1 and S2), which though comprising plant tissues represent\nthe extended phenotypes of gallwasp genes [23,32]. Parasitoids\ninflict high mortality on their gallwasp hosts [24,27,28,33], and\nselection should favour adaptive host traits that reduce parasitism\n[27,34]. Since all parasitoid attack involves oviposition through gall\ntissues, gallwasp genes that induce gall structures that reduce\nparasitoid attack rates should be favoured by selection—a view\nencapsulated in the Enemy Hypothesis [1,2,27,33]. This hypothesis\nis supported by studies of the impact of variation in gall morphology\nwithin galler species, and is also compatible with demonstrated\nconvergent evolution of several of the same traits (Table 1) in\ngallwasps [23–26]. These defensive extended phenotypes drive\nreciprocal phenotype evolution [34,35] in parasitoid traits, such as\novipositor length, which may limit access to concealed gallwasp\nhosts [31]. While previous studies have examined the role of other\nhost defences (such as warning coloration and cuticular coatings of\nhair or spines (e.g., [5]) and grooming behaviours [36]), we here\nexamine the impact of diversity in extended phenotypes in\npredicting variation in parasitoid community structure among a\nclosely related group of herbivores.\nBecause the parasitoid communities attacking oak gallwasps\ncomprise both specialists (those attacking a small subset of\navailable host gall types) and generalists (those attacking many\nhost gall types) [21,22,24,28,30,31], we can also ask which of these\ngroups drive any host-associated community structure. This is\nimportant because whereas changes in host traits influencing\nspecialist enemies are likely to influence only a small number of\nspecies in these foodwebs, those influencing vulnerability to attack\nby generalists may have both major direct and indirect (apparent\ncompetition [9]) influences on many species in the web. Further,\nAskew [22] predicted that the richness of oak gallwasp\ncommunities would be maintained by partitioning of generalist\nparasitoids among different gall phenotypes.\nWe emphasise two key phases in successful parasitoid attack—\nhost detection and host exploitation [1,2,15,16,34]. For parasitoids\nof herbivorous insects, host detection requires searching the right\npart of the right plant at the right time, while exploitation involves\novercoming any host defences and the ability to develop on the\nhost resources available [15,16,34]. We can, in turn, divide host\ntraits into three major groups (Table 1), each of which has been\ninvoked repeatedly [1,2,5,15,16,19,21,22,27,30,34] as a key\ndeterminant of parasitoid community structure: (i) Spatiotemporal\nniche traits describe the distribution of hosts in space (oak taxon\ngalled, location of the gall on the oak) and time (season and\nduration of development), and determine the likelihood of\ndetection by parasitoids. (ii) Resource traits represent the quality\nof the host resource per gall (host size, number of hosts per gall)\npotentially available to parasitoids. (iii) Gall morphology traits\ncapture variation in the structure of gall tissues parasitoids must\npenetrate to access host resources, potentially acting as direct\ndefences against particular natural enemies (the Enemy Hypoth-\nesis [27,33]). These three groups of traits influence parasitoid\nsuccess in host detection (spatiotemporal niche) and host\nexploitation (resource, morphology), respectively.\nHere we compare the parasitoid communities induced by 40\ngallwasp species (Table S1) at five replicate sites across Hungary\n(Figure S1), a known ancient centre of oak cynipid diversity\n[37,38]. Oak gallwasp lifecycles involve obligate alternation\nbetween a spring sexual generation and a summer asexual\ngeneration [24,39], each of which induces a gall with a\ncharacteristic morphology that develops on a characteristic plant\norgan (e.g., bud, leaf, flower, fruit, root) of a specific oak taxon\n[23–26]. Exemplar gall phenotypes are shown in Figure 1, and gall\nmorphologies and character states for all species and generations\nare shown in Figure S2 and Table S2. Sexual and asexual gallwasp\ngenerations have long been known to support different parasitoid\ncommunities [21,22,28,40], a feature of gallwasp ecology that here\nwe establish quantitatively in ancient refuge communities for the\nfirst time. Because the two generations of the gallwasp lifecycle also\nshow independent evolution of morphological traits, gall locations\nand host oak associations [23,25,26,41], we examine patterns in\nassociated parasitoid communities in each generation separately.\nSpecifically, we ask whether similar parasitoid communities evolve\non hosts with similar gall morphology traits (as predicted by the\nEnemy Hypothesis), on hosts occupying similar spatiotemporal\nniches, or on hosts providing similar levels of resource per gall.\nFurther, we ask whether any host-associated community structure\nis driven by the preferences of generalist natural enemies, as\npredicted by Askew [22].\nAuthor Summary\nHerbivorous insects, such as the wasps that induce trees to\nmake galls, and the parasitoids that attack (and ultimately\nkill) the wasps comprise about a third of all animal species,\nbut it remains unclear what determines the structure of\nthese complex coevolving communities. Here, we analyzed\n48 parasitoid communities attacking different cynipid\nwasps that live and feed on oak trees. These communities\nare diverse and ‘‘closed,’’ with each centered upon the\ncharacteristic gall induced by a given cynipid wasp species.\nThe often spectacular and complex galls are extended\nphenotypes of gallwasp genes and have been suggested\nto evolve as gallwasp defenses against their parasitoid\nenemies—‘‘the Enemy Hypothesis.’’ Our analysis showed\nthat similar parasitoid communities occurred on galls with\nsimilar structural traits (e.g., toughness, hairiness, sticki-\nness), supporting the Enemy Hypothesis. We also found\nsimilar communities on galls that co-occur frequently in\ntime and space; in particular, those occurring on the same\noak species and same plant organ (e.g., leaf, bud, seed).\nOur results suggest that cynipid wasps might escape\nparticular parasitoids via evolutionary shifts in the struc-\nture or location of their galls. However, escape may often\nbe transient due to recruitment of new enemies already\nattacking other host galls with similar trait combinations.\nHost Traits Structure Parasitoid Communities\nPLoS Biology | www.plosbiology.org 2 August 2009 | Volume 7 | Issue 8 | e1000179\nA key issue in analyses of patterns across species is the fact that\nhost trait values (both gall phenotypes and associated parasitoid\ncommunities) cannot be regarded as statistically independent, but\nare linked by phylogenetic patterns of shared common ancestry\n[5,18,19,23,25,36,41,42]. To assess the strength of any phyloge-\nnetic patterning in variables of interest, we generated a molecular\nphylogeny of the host gallwasp species (see Materials and\nMethods), and then used matrix correlation analyses (MCA; see\nMaterials and Methods) to test the significance of correlations\nbetween pairwise genetic distance between species, and pairwise\nsimilarity in phenotypic and community traits. We then use two\nparallel approaches that control for phylogenetic nonindepen-\ndence to examine patterns within each generation (see Materials\nand Methods). First, we included host relatedness (shown visually\nin Figure 2) as a covariate in MCA of host traits and parasitoid\ncommunities. Second, we controlled for phylogenetic noninde-\npendence using phylogenetically independent contrasts in phylo-\ngenetic regression analysis (PRA) [42]. We present results\nseparately for each of our five study sites, and for all five sites\npooled (see Materials and Methods). We predict that host traits\nwith a key role in structuring parasitoid communities should have\nconsistent significant effects across these different datasets.\nResults\nSexual and Asexual Gallwasp Generations Support\nSignificantly Different Communities\nWe reared over 40,000 cynipid galls, resulting in .31,000\nparasitoids belonging to 58 species (Table S3). Each gall type was\nattacked by between three and 30 parasitoid species, of varying host\nspecificity. For the purposes of illustration (and not for data analysis),\nwe divide parasitoid species among the following categories. There\nwere nine extreme specialist parasitoid species (recorded from only\none host gall type), 23 specialists (two to 11 hosts), 16 generalists (11–\n21 hosts), and nine extreme generalists (.20 hosts) (Table S3). Our\nplacement of parasitoid species into these categories closely matches\nprevious work on Western Palaearctic oak gall communities\n[21,22,24,43]. To allow tests of correlations between host\nphenotypic traits and parasitoid community composition, we\ncalculated the pairwise similarity in parasitoid community compo-\nsition for all gall type pairs using Bray-Curtis scores. This common\nmeasure of similarity takes account of both the presence and the\nrelative abundance of parasitoid species (see Materials and\nMethods), and for our sampled communities ranged from 0% (no\nparasitoid species in common) to 80% (great overlap of species). A\nFigure 1. Resource availability and trait variation in oak cynipid galls. (A) Gallwasp larvae. 1. A gallwasp larva (Andricus lucidus asexual\ngeneration) in its larval chamber. 2. Multiple larvae in the multilocular sexual generation gall of Biorhiza pallida. (B) One of the parasitoids in this study,\nM. stigmatizans (Torymidae) drilling through the wall of an oak cynipid gall. (C) Matrix showing some of the diversity in defensive gall morphologies\n[23] and gall locations represented by species in this study, with examples (sg, sexual generation; ag, asexual generation): 1. A. lucidus (ag). 2. A. hartigi\n(ag). 3. A. grossulariae (ag). 4. A. caputmedusae (ag). 5. A. lignicolus (ag). 6. A. gemmeus (ag). 7. A. lucidus (sg). 8. Cynips longiventris (ag). 9. Callirhytis\nglandium (ag). 10. Dryocosmus nitidus (sg). 11. Neuroterus lanuginosus. 12. A. quercustozae (ag). 13. A. grossulariae (sg). 14. A. quercuscalicis (ag). 15. A.\ncoronatus (ag). Scale bar = 5 mm in all images.\ndoi:10.1371\/journal.pbio.1000179.g001\nHost Traits Structure Parasitoid Communities\nPLoS Biology | www.plosbiology.org 3 August 2009 | Volume 7 | Issue 8 | e1000179\nstriking feature of our data is the fact that though some parasitoids\nattack both asexual and sexual generation galls, communities\nassociated with the same generation of different host species are\nsignificantly more similar than those associated with different\ngenerations of the same host species (shown visually in Figure 3;\nANOSIM of Bray-Curtis scores by generation significant for all\nsites: p,0.001 at Go¨do¨llo˜, Ma´trafu¨red, and Sopron; p,0.02 at\nVarpalota; p,0.05 at Szentkut). This replicates Askew’s findings for\nyounger and much less diverse postglacial oak gallwasp communi-\nties in the UK [21], and is consistent with a fundamental role for\nseason of development in determining parasitoid community\ncomposition (see also [16]).\nPhenotypic Traits and Parasitoid Communities Are\nStrongly Correlated with Host Phylogeny\nParasitoid community composition and all three aspects of host\nphenotypes (spatiotemporal niche, host resource availability, gall\nmorphology) are correlated with host phylogeny (Figures 2 and 3;\nTable 2). More closely related gallwasp hosts harboured more\nsimilar parasitoid communities in both sexual (p,0.05, pooled sites)\nand asexual generations (p,0.001, and significant at p,0.05 in four\nof five individual sites). Significant correlations were also always\npositive for spatiotemporal traits (plant organ galled, oak taxon, and\ngall persistence) and host resource availability (host size, Table 2). In\ncontrast, signs of significant correlations varied among morpholog-\nical traits; they were positive for toughness and gall size but negative\nfor spininess, stickiness, and presence of an internal airspace. The\nnegative correlations for the latter traits are consistent with previous\nanalyses demonstrating their convergent evolution in gallwasps\n[23,26]. A greater number of significant correlations was found in\nthe asexual generation galls (Table 2), in part reflecting the greater\ntrait diversity present in this generation (Figure S2; Table S2). These\nresults underline the need to control for phylogenetic nonindepen-\ndence in testing correlations between host traits and parasitoid\ncommunity composition, even in closely related hosts.\nGall Defences, Spatiotemporal Niche, and Resource\nAvailability Each Structure Parasitoid Communities\nSummaries of the significant variables retained in MCA and\nPRA analyses are shown in Tables 3 and 4, respectively. While\nMCAs addressed overall similarity in community composition\nusing untransformed Bray Curtis similarities, in PRAs we used\nmultidimensional scaling (MDS) to identify three statistically\nindependent axes of community variation (see Materials and\nMethods). The results of the two analytical approaches are highly\ncongruent and show parasitoid community composition to be\ninfluenced by host traits associated with each of gall morphology,\nspatiotemporal niche, and host resource (Tables 3 and 4).\nExplanatory power of these traits in combination can be high: in\nPRA, these groups of explanatory variables explained up to 62%\nof the deviance in a given MDS axis (Table 4). For some site and\ngeneration combinations, however, available host species allowed\nvery few independent contrasts, limiting the degrees of freedom\navailable for detection of patterns in the data (see legend, Table 4).\n(i) Gall morphology. We obtained significant correlations\nwith parasitoid community composition for putatively defensive\ngall structure traits (Tables 3 and 4): gall hairiness (MCA and\nPRA), gall size (MCA and PRA), gall toughness (PRA), gall\nspininess (MCA), and gall stickiness (MCA). All but one of the\nsignificant correlations were obtained for parasitoid communities\nattacking the more structurally complex and diverse asexual\ngeneration galls (see Figure 1). Significance in two or more\nindividual site datasets was revealed for gall hairiness (PRA: three\nsites), gall toughness (PRA: two sites), and gall size (MCA: two\nsites). Our results thus show that gall traits of demonstrated\ndefensive value within galler species also influence parasitoid\ncommunity structure among species, and so support the Enemy\nHypothesis for gall structural diversity.\n(ii) Spatiotemporal niche traits. Host oak section had the\nmost consistently significant impact on parasitoid community\ncomposition of any single host trait, with significant correlations\nTable 1. Summary of host characters used as explanatory variables in analyses of parasitoid community composition.\nVariable Category Type Character Variation\nGall hairiness Morphology Binary Galls either have a smooth or hairy (defensive) surface. Labile.\nGall spininess Morphology Binary Galls are either spineless or covered with spines (defensive). Labile.\nGall toughness Morphology Categorical Four levels, increasing in toughness from 1 to 4. High toughness is defensive. Labile.\nGall stickiness Morphology Binary Galls are either coated with sticky resin (defensive) or not. Labile.\nGall internal airspace Morphology Binary Galls are either solid or have an internal airspace surrounding the larval chamber (defensive). Labile.\nHost gall size Morphology Continuous The volume of each mature gall type, with gall inducer larval chamber subtracted.\nHost resource size Resource availability Continuous The volume of each fully developed host gallwasp larva.\nGall locularity Resource availability Binary Galls either contain a single host gallwasp larva, or .1. Labile.\nMean number of hosts\/gall Resource availability Continuous Mean number of parasitoids emerging from galls producing at least one parasitoid.\nOrgan galled Spatiotemporal niche Categorical Gall location on the oak host, either shoot bud, dormant bud on the trunk (lenticel), acorn, leaf, catkin,\nor shoot. Labile.\nOak section Spatiotemporal niche Binary Galls develop either on oaks in the section Cerris (Q. cerris) or in the section Quercus (Q. petraea, Q.\npubescens, and Q. robur)a. Labile.\nSeason of development Spatiotemporal niche Continuous The week, starting at April 1st, that the gall was first observed to start development.\nPersistence Spatiotemporal niche Continuous The mean duration of gall development, in weeks.\nSample size Sampling effort Continuous Total number of parasitoids emerging from galls of a given type.\nThese are categorised as describing gall morphology, host resource availability, or gall spatiotemporal niche. Character states for all gall types are given in Table S2. Gall\nmorphology character states were defined as defensive on the basis of their demonstrated efficacy in single species studies [27,34]. Categorical characters with many\nstate changes in our species set [21,23–25,41,43] provide multiple independent contrasts and are labelled as labile.\naPlease see Material and Methods for justification of classifying oak hosts at the section rather than species level.\ndoi:10.1371\/journal.pbio.1000179.t001\nHost Traits Structure Parasitoid Communities\nPLoS Biology | www.plosbiology.org 4 August 2009 | Volume 7 | Issue 8 | e1000179\nfor both generations in MCA, and for three individual site asexual\ngeneration analyses in both MCA and PRA (Tables 3 and 4). The\nlocation of the host gall within the oak (leaf, bud, acorn, etc.) was\nalso significant in both generations, and in two individual site\nasexual generation analyses in both MCA and PRA. Host gall\npersistence (MCA for sexual generation galls) and season of\ndevelopment (MCA for asexual generation galls, and for one\nindividual site asexual generation PRA) had significant but less\ngeneral impacts on community structure.\n(iii) Host resource traits. Neither analytical approach\nrevealed significant correlations between host resource size and\ncommunity composition in either generation. In contrast,\naggregation of hosts (as measured by the variables locularity and\nhosts\/gall; Tables 3 and 4) influenced community structure in both\ngenerations.\nHost Gall Traits Influence the Relative Impacts of\nGeneralist Parasitoids\nAskew [22] proposed that structuring of rich cynipid-centred\ncommunities would be mediated by variation in the ability of\ngeneralist parasitoids to exploit different host phenotypes. Our data\nshow that the relative dominance (seeMaterials andMethods) of the\nfive most generalist species attacking each gallwasp generation\nvaries with host traits (Figure 4). For example, in the sexual\ngeneration gall communities, the parasitoid Aulogymnus gallarum\n(Eulophidae; 23 recorded host gall types) was a dominant parasitoid\nof catkin galls (38.5% of all parasitoid emergence), but was rare\n(,6%) or absent in galls developing in any other location. Similarly,\nit was a dominant sexual generation parasitoid of hosts on section\nQuercus oaks (40.1%), but was much rarer in hosts on section Cerris.\nReversals in the relative importance of parasitoid species pairs\nacross sexual gall locations can also be seen for Megastigmus dorsalis\n(Torymidae) and Sycophila biguttata (Eurytomidae). A similar and\nmore pronounced pattern is seen in the asexual generation galls:\neach of the five gall locations represented in our sampling was\ndominated by a different generalist parasitoid (Figure 4), and the\nrelative ranks of these parasitoids differed across hosts in the oak\nsections Cerris and Quercus. Where sampled gall types allow similar\ndominance analyses to be made in individual sites, the observed\npatterns are concordant with those across the pooled data. These\nresults are consistent with Askew’s hypothesis.\nDiscussion\nPrevious multispecies studies of communities centred on\nherbivorous insects have shown that a range of host traits structure\nparasitoid assemblages, including food plant taxon [18,20,44–50],\nhost feeding niche (e.g., exposed versus leaf mining versus gall\ninducing; [18,48,50–54]), season of development [50,55,56],\nduration of gall development [55], and intrinsic (i.e., direct\nbehavioural and morphological) defences against parasitoid attack\n[5,57,58]. The relationships we find between host spatiotemporal\nniche traits and parasitoid community composition further\nstrengthen several of these patterns. The strong separation\nbetween communities attacking spring (sexual) and summer\n(asexual) gallwasp generations parallels similar phenology-associ-\nated community structure in other concealed hosts, including gall\nmidges [55] and leaf miners [50], as does the impact of host plant\ntaxon [18,48,50]. The significance of gall location independent of\nhost plant taxon parallels similar findings in communities attacking\ngalling sawflies on willows [18]. Our findings that host aggregation\n(multilocularity, hosts per gall) influences community structure\nwhile host resource size does not also parallels findings in other\nsystems [5]. The generality of these patterns implies that\nphenological matching commonly dictates the pool of available\nparasitoid species, whereas the location of hosts within specific\nplant taxa dictates which subset of this pool has appropriate\nsearching behaviours to detect them [1,2,15,16,44–47]. Our\nfindings suggest that species interactions, such as resource\ncompetition and multiparasitism among parasitoid species\n[15,16], as well as host–parasitoid coevolution [15,16,59,60], will\ncommonly involve hosts on the same oak taxon and plant organ.\nSignificant Impacts of Gall Extended Phenotypes Support\nthe Enemy Hypothesis\nOne initially counterintuitive finding of studies comparing\nparasitoid communities associated with different host feeding\nFigure 2. Phylogenetic relationships between host gallwasps.\nThe mitochondrial DNA sequence phylogeny of host gallwasps,\npresented as a cladogram with node support shown by posterior\nprobabilities in Bayesian analyses (see Materials and Methods).\nColoured symbols at branch tips indicate gallwasp clade membership\n(following 23,25,39), allowing recognition of phylogenetic patterns in\nFigure 3. The shape of the symbol indicates the generation included in\nour analysis (circle, asexual; square, sexual).\ndoi:10.1371\/journal.pbio.1000179.g002\nHost Traits Structure Parasitoid Communities\nPLoS Biology | www.plosbiology.org 5 August 2009 | Volume 7 | Issue 8 | e1000179\nniches was that despite being apparently well defended by gall\ntissues, gall inducers usually support richer communities and suffer\nhigher mortality than externally feeding herbivores ([48,51–53];\nbut see [54]). This may be because, as proposed by Stireman and\nSinger [5] for tachinid fly parasitoid communities, well-defended\nhosts suffer lower mortality from attack by generalist vertebrate\n(and possibly invertebrate) predators, and so represent enemy-free\nspace [61] for their specialist parasitoids. Whether the same\napplies to cynipid galls and their associated parasitoids or not, the\nEnemy Hypothesis predicts that the high host mortality imposed\nby parasitoids on most insect gall inducers should drive the\nevolution of gall phenotypes that reduce attack by, or exclude, at\nleast a subset of them [1,2,27,33,52,62]. Though there is evidence\nthat herbivore extended phenotypes do structure parasitoid\nassemblages across host species [18,63], no previous studies have\ndemonstrated an impact of the complex gall morphology traits\nthat predict vulnerability to attack within gall-inducer species\n[27,52,53]. This led to the hypothesis that observed phenotypic\ndiversity in some galler lineages represents the ‘‘ghost of parasitism\npast’’ [51], whose efficacy in influencing parasitoid attack has been\nnullified by the evolution of effective parasitoid countermeasures.\nOur results show that in the rich, sympatric communities of\ncynipid gallwasps on oaks, the gall-associated extended phenotypes\nof gallwasp genes can structure parasitoid communities, and so\nFigure 3. Cluster analyses showing similarity in parasitoid community composition and gall phenotypes. Cluster analyses showing\nsimilarities between gall types in (A) parasitoid assemblage composition, and (B) spatiotemporal niche character states (see Materials and Methods).\nColours of symbols at branch tips match those for the clades in Figure 2. Sexual generation galls are indicated by square symbols and red branches.\ndoi:10.1371\/journal.pbio.1000179.g003\nHost Traits Structure Parasitoid Communities\nPLoS Biology | www.plosbiology.org 6 August 2009 | Volume 7 | Issue 8 | e1000179\nprovide support for the Enemy Hypothesis. Further, they show\nthat traits expressed in two distinct stages of the gallwasp lifecycle\ncan influence community structure, because while gall morphol-\nogy is controlled by genes expressed in the gallwasp larva, oak\ntaxon, gall location, and the grouping of hosts within gall\nstructures are all determined by the oviposition behaviour of the\nadult female [23,25,41].\nAlthough we have demonstrated that gall morphology influ-\nences parasitoid community composition, none of the gall\nmorphologies we sampled were free of parasitoids, and so none\nrepresent true enemy-free space [61]. This suggests that any\nenemy-free space gained by novel gall morphologies is only\ntransient [1,2,27,35]. The ability of all but seven of the parasitoid\nspecies in this study to attack multiple gall morphologies implies\nthat parasitoids are able to circumvent some structural gall\ndefences through behavioural or phenological plasticity [35], and\nconsequently the coevolution of host morphological defences with\nparasitoid attack mechanisms is probably diffuse [15,35,60]. For a\ngallwasp, our results suggest that the best way to escape its current\nparasitoid community in a given generation is to shift to a new oak\ntaxon, or to a new location on its current oak host. Which of these\nroutes has been exploited in the evolution of gallwasp communities\nwill depend on the relative frequency of each kind of shift during\ngallwasp diversification. In contrast to other gall inducers [18], oak\ngallwasps shift between oak lineages extremely rarely [41], while\nchanges in gall location and morphology are more frequent\n[23,25,26]. However, when evolutionary shifts in gall location\noccur, they will often be a case of ‘‘out of the frying pan and into\nthe fire,’’ because of subsequent detection and exploitation of\nnovel hosts by parasitoid species already attacking other host galls\nresident in the same spatiotemporal niche [1,2].\nWhy then are similar impacts of gall morphology not seen in the\nparasitoid communities associated with species-rich radiations of\nhosts inducing structurally complex galls on other plants (such as\nAsphondyllia gall midges on creosote bush, Larrea tridentata; [52])?\nOne possibility is that gall phenotypes in these radiations do\nrepresent the ‘‘ghost of parasitism past.’’ An alternative is that\nrelationships between gall morphology and associated communi-\nties may only become apparent when phylogenetic patterns are\ncontrolled for. Changes in parasitoid assemblages during evolu-\ntionary diversification of a host lineage represent the sum of\nphylogenetic correlation between the assemblages attacking\nrelated hosts, and the impacts of variation in any host traits\ninfluencing parasitoid attack. If phylogenetic correlations are\nstrong (as they are in a range of host–parasitoid systems [5,18,56]),\nsignificant impacts of gall morphology traits may only be revealed\nwhen host phylogeny is controlled for, as we have done here.\nThough patterns of evolution have been examined in Asphondyllia\ngall traits [64], to our knowledge phylogenetically controlled\nanalyses of associated parasitoid assemblages have yet to be made.\nIn addition to their parasitoid natural enemies, some cynipid\ngallwasps are also attacked by opportunist vertebrate natural\nenemies, including insectivorous birds [43]. Studies on other gall-\ninducer systems [34] have shown that birds can impose directional\nselection on gall traits, and although available evidence shows that\nparasitoids inflict the vast majority of natural enemy-imposed\nmortality in cynipid galls [43], it is possible that the traits we\ndiscuss here could also influence bird predation in this system.\nTable 2. Phylogenetic patterns in host gall traits and\nparasitoid communities for sexual and asexual gallwasp\ngenerations.\nGall trait Asexual Sexual\nGall morphology\nHairiness — —\nToughness p,0.05 (+) —\nSpininess p,0.01 (2) —\nStickiness p,0.05 (2) —\nInternal airspace p,0.01 (2) —\nGall size p,0.01 (+) —\nResource availability\nHost resource size — p,0.001 (+)\nHosts\/gall — —\nLocularity — —\nSpatiotemporal niche\nPlant organ galled p,0.001 (+) —\nOak section p,0.001 (+) —\nPersistence — p,0.001 (+)\nSeason — —\nCell entries show the significance of matrix correlations (and their sign)\nbetween host phylogenetic relatedness and gall traits.\ndoi:10.1371\/journal.pbio.1000179.t002\nTable 3. Significant matrix correlations between gall traits\n(rows) and Bray-Curtis similarity in parasitoid assemblage\ncomposition.\nVariable Dataset\nAsexual Sexual\nSample size 1 —\nRelatedness (alone) ***4 *\nRelatedness in MAM 1 —\nGall morphology\nHairiness *2 —\nToughness — —\nSpininess *1 N\/A\nStickiness **\n6Internal airspace — N\/A\nGall size *2 1\nResource availability\nHost size 1 —\nLocularity — 1\nHosts\/gall *2 *1\nSpatiotemporal niche\nPlant organ galled ***2 *\nOak section **3 **1\nSeason *1 —\nPersistence — ***1\nAsterisks indicate significance for the pooled sites dataset (*, p,0.05; **,\np,0.01; ***, p,0.001), whereas numbers indicate the number out of five\nindividual sites showing a significant correlation (all p,0.05). Results are\npresented for asexual and sexual generations tested separately. Results for\nrelatedness are given when this variable alone is fitted, followed in the row\nbelow by significance in a multiple regression with all other significant variables\nin the MAM (see Material and Methods). Entries marked N\/A lack variance in the\nhost gall trait for that row.\ndoi:10.1371\/journal.pbio.1000179.t003\nHost Traits Structure Parasitoid Communities\nPLoS Biology | www.plosbiology.org 7 August 2009 | Volume 7 | Issue 8 | e1000179\nT\na\nb\nle\n4\n.\nP\nar\nam\ne\nte\nr\ne\nst\nim\nat\ne\ns,\nsi\ng\nn\nif\nic\nan\nce\n,\nan\nd\np\ne\nrc\ne\nn\nt\nd\ne\nvi\nan\nce\ne\nxp\nla\nin\ne\nd\nin\nM\nA\nM\ns\nfo\nr\nP\nR\nA\ns\no\nf\np\nar\nas\nit\no\nid\nco\nm\nm\nu\nn\nit\ny\nco\nm\np\no\nsi\nti\no\nn\n(s\ne\ne\nM\nat\ne\nri\nal\ns\nan\nd\nM\ne\nth\no\nd\ns)\n.\nD\na\nta\nse\nt\nM\nD\nS\nA\nx\nis\nS\np\na\nti\no\nte\nm\np\no\nra\nl\nN\nic\nh\ne\nR\ne\nso\nu\nrc\ne\nG\na\nll\nM\no\nrp\nh\no\nlo\ng\ny\nS\na\nm\np\nle\nS\niz\ne\nP\ne\nrc\ne\nn\nt\nD\ne\nv\nia\nn\nce\nE\nx\np\nla\nin\ne\nd\nO\na\nk\nS\ne\nct\nio\nn\nO\nrg\na\nn\nG\na\nll\ne\nd\nP\ne\nrs\nis\nte\nn\nce\nL\no\ncu\nla\nri\nty\nH\no\nst\ns\/\nG\na\nll\nH\na\nir\nin\ne\nss\nT\no\nu\ng\nh\nn\ne\nss\nG\na\nll\nS\niz\ne\nT\no\nta\nl\nE\nm\ne\nr\nP\no\no\nle\nd\nsi\nte\ns,\na\nse\nx\nu\na\nl\n3\n1\n\/1\n4\n1\n2\n0\n.7\n1a\n18\n.9\n2\n2\n0\n.6\n9\n13\n.2\n3\n0\n.2\n1\na\n0.\n81\n**\n2\n1.\n14\n*\n0\n.2\n6\n**\n62\n.1\nP\no\no\nle\nd\nsi\nte\ns,\nse\nx\nu\na\nl\no\nn\nly\n1\n7\n\/9\n1\n2\n0\n.9\n1a\n41\n.9\n2\n2\n0.\n5\n7\n54\n.7\n3\nn\ns\nM\na´\ntr\na\nfu¨\nre\nd\n,\na\nse\nx\nu\na\nl\no\nn\nly\n2\n1\n\/1\n1\n1\n2\n0\n.3\n7\n*\n0.\n2\n0*\n*\n6.\n2\n2\n2\n0\n.2\n0\n0\n.7\n7\n2\n0\n.2\n0\n54\n.7\n3\n0.\n55\n0\n.1\n6\n37\n.2\nM\na´\ntr\na\nfu¨\nre\nd\n,\nse\nx\nu\na\nl\no\nn\nly\n1\n3\n\/7\n1\nn\ns\n2\nn\ns\n3\n2\n0.\n2\n5\n61\n.4\nG\no¨\nd\no¨\nll\no¨\n,\na\nse\nx\nu\na\nl\no\nn\nly\n2\n3\n\/1\n2\n1\n0.\n34\n0\n.9\n6\nb\n**\n0\n.1\n3\n26\n.7\n2\nn\ns\n3\nn\ns\nG\no¨\nd\no¨\nll\no¨\n,\nse\nx\nu\na\nl\no\nn\nly\n1\n1\n\/6\n1\n0\n.5\n7\n38\n.3\n2\nn\ns\n3\nn\ns\nS\nze\nn\ntk\nu´\nt,\na\nse\nx\nu\na\nl\no\nn\nly\n2\n2\n\/1\n1\n1\n2\n0.\n7\n8c\n2\n0.\n00\n0\n3\n60\n.6\n2\nn\ns\n3\n2\n0\n.3\n2\n2\n0.\n68\n14\n.5\nS\no\np\nro\nn\n,\na\nse\nx\nu\na\nl\no\nn\nly\n,\n2\n7\n\/1\n3\n1\nn\ns\n2\n2\n0\n.8\n3d\n0\n.4\n8\na\n53\n.5\n3\n2\n0\n.1\n4a\n**\n0.\n55\ne\n**\n6.\n8\nO\nn\nly\nsi\ng\nn\nif\nic\nan\nt\nre\nsu\nlt\ns\nar\ne\nsh\no\nw\nn\n,s\ne\np\nar\nat\ne\nd\nb\ny\nsi\nte\nan\nd\nfo\nr\nse\nxu\nal\nan\nd\nas\ne\nxu\nal\nh\no\nst\ng\ne\nn\ne\nra\nti\no\nn\ns.\nSi\ng\nn\nif\nic\nan\nce\nle\nve\nli\ns\nin\nd\nic\nat\ne\nd\nas\nfo\nllo\nw\ns:\nn\no\n*,\np\n,\n0\n.0\n5\n;*\n,p\n,\n0\n.0\n0\n3\n(t\nh\nre\nsh\no\nld\nfo\nr\nsi\ng\nn\nif\nic\nan\nce\nw\nit\nh\nB\no\nn\nfe\nrr\no\nn\nic\no\nrr\ne\nct\nio\nn\nfo\nr\nan\nal\nys\ne\ns\nfo\nr\nin\nd\niv\nid\nu\nal\nsi\nte\ns\nan\nd\ng\ne\nn\ne\nra\nti\no\nn\ns)\n;\nan\nd\n**\n,\np\n,\n0\n.0\n0\n1\n.\nT\no\nta\nl\ne\nm\ne\nr,\nto\nta\nl\nn\nu\nm\nb\ne\nr\no\nf\ne\nm\ne\nrg\nin\ng\np\nar\nas\nit\no\nid\ns;\nH\no\nst\ns\/\ng\nal\nl,\nm\ne\nan\np\nar\nas\nit\no\nid\ns\np\ne\nr\ng\nal\nl,\ng\niv\ne\nn\nb\ny\nto\nta\nl\ne\nm\ne\nrg\ne\nn\nce\n\/t\no\nta\nl\np\nro\nd\nu\nci\nn\ng\nfr\no\nm\nT\nab\nle\nS2\n.\nT\nh\ne\nfi\ng\nu\nre\ns\nfo\nllo\nw\nin\ng\nth\ne\nn\nam\ne\no\nf\ne\nac\nh\nd\nat\nas\ne\nt\nin\nth\ne\nfi\nrs\nt\nco\nlu\nm\nn\ng\niv\ne\nth\ne\nn\nu\nm\nb\ne\nr\no\nf\nsp\ne\nci\ne\ns\/\nn\nu\nm\nb\ne\nr\no\nf\np\nh\nyl\no\ng\ne\nn\ne\nti\nca\nlly\nin\nd\ne\np\ne\nn\nd\ne\nn\nt\nco\nn\ntr\nas\nts\nin\ne\nac\nh\nan\nal\nys\nis\n.\nN\no\nsi\ng\nn\nif\nic\nan\nt\nco\nrr\ne\nla\nti\no\nn\ns\nfo\nr\nan\ny\nd\nat\nas\ne\nt\nw\ne\nre\no\nb\nta\nin\ne\nd\nfo\nr\nth\ne\nfo\nllo\nw\nin\ng\nh\no\nst\ng\nal\nl\nva\nri\nab\nle\ns:\nre\nso\nu\nrc\ne\nvo\nlu\nm\ne\n,\nsp\nin\nin\ne\nss\n,\nst\nic\nki\nn\ne\nss\n,\nan\nd\nth\ne\np\nre\nse\nn\nce\n\/a\nb\nse\nn\nce\no\nf\nan\nin\nte\nrn\nal\nai\nrs\np\nac\ne\n.\nN\no\nsi\ng\nn\nif\nic\nan\nt\nco\nrr\ne\nla\nti\no\nn\ns\nfo\nr\nan\ny\nva\nri\nab\nle\nw\ne\nre\no\nb\nta\nin\ne\nd\nfo\nr\nse\nxu\nal\ng\ne\nn\ne\nra\nti\no\nn\ng\nal\nls\nat\nSz\ne\nn\ntk\nu´\nt,\ne\nit\nh\ne\nr\nse\nxu\nal\no\nr\nas\ne\nxu\nal\ng\ne\nn\ne\nra\nti\no\nn\ng\nal\nls\nat\nV\na´r\np\nal\no\nta\n(i\nn\nsu\nff\nic\nie\nn\nt\nd\ne\ng\nre\ne\ns\no\nf\nfr\ne\ne\nd\no\nm\nw\ne\nre\nav\nai\nla\nb\nle\nfo\nr\nan\nal\nys\nis\nin\nth\ne\nse\nxu\nal\ng\ne\nn\ne\nra\nti\no\nn\n),\no\nr\nse\nxu\nal\ng\ne\nn\ne\nra\nti\no\nn\ng\nal\nls\nat\nSo\np\nro\nn\n.\nT\nh\ne\nse\nan\nal\nys\ne\ns\nh\nav\ne\nfo\nu\nr\no\nf\nth\ne\nfi\nve\nlo\nw\ne\nst\nn\nu\nm\nb\ne\nrs\no\nf\nsp\ne\nci\ne\ns\nan\nd\nin\nd\ne\np\ne\nn\nd\ne\nn\nt\nco\nn\ntr\nas\nts\n,\nw\nit\nh\n8\n\/5\n,\n4\n\/1\n,\n1\n3\n\/5\n,\nan\nd\n1\n2\n\/6\n,\nre\nsp\ne\nct\niv\ne\nly\n.\nSu\np\ne\nrs\ncr\nip\nt\nle\ntt\ne\nrs\nsh\no\nw\nsi\ng\nn\nif\nic\nan\nt\nch\nar\nac\nte\nr\nst\nat\ne\ns\nfo\nr\n‘‘o\nrg\nan\ng\nal\nle\nd\n’’\nlo\nca\nti\no\nn\ns\n(a\n–\nc)\nan\nd\ng\nal\nl\n‘‘t\no\nu\ng\nh\nn\ne\nss\n’’\n(d\nan\nd\ne\n).\na\nLe\naf\n.\nb\nSo\nft\n.\nc\nV\ne\nry\nh\nar\nd\n.\nd\nA\nco\nrn\n.\ne\nSh\no\no\nt.\nd\no\ni:1\n0\n.1\n3\n7\n1\n\/j\no\nu\nrn\nal\n.p\nb\nio\n.1\n0\n0\n0\n1\n7\n9\n.t\n0\n0\n4\nHost Traits Structure Parasitoid Communities\nPLoS Biology | www.plosbiology.org 8 August 2009 | Volume 7 | Issue 8 | e1000179\nGall Traits Structure Communities through Their Impact\non Generalist Parasitoids\nSpecies rich communities of insect herbivores often harbour\nmultiple generalist parasitoids [15,16,44,50,65], raising the\nquestion of how host species richness is maintained in the face\nof apparent competition [9,66–69]. Our results show that within\neach gallwasp generation, significant impacts of host traits on\nparasitoid community structure primarily involve generalist\nparasitoids (Figure 4). This argues against the existence of clearly\ndefined tritrophic niches in gallwasp communities, in which hosts\nin specific niches are attacked by specific sets of natural enemies\n[1,2]. However, the fact that generalist parasitoids vary in the\nmortality they inflict in different spatiotemporal niches makes\nthem less generalist than their host ranges would suggest. Though\nwe have not explicitly examined it here, one possible consequence\nof this is a weakening of indirect interactions (such as apparent\ncompetition) between hosts mediated by shared enemies\n[25,65,68], with potential contributions to food web stability\n[67,69,70]. Interaction networks can also be stabilised by switching\nof parasitoids between alternative hosts [66,67]. If such host\nswitching occurs in oak gall parasitoids, our results suggest that it\nwill be primarily among hosts in the same gall generation and\nprobably on the same oak taxon.\nFurther studies across guilds of natural enemies that exploit\npotentially coevolving hosts are needed to assess the generality of\nthe patterns of community structure found here. Influential\ngeneralist natural enemies attacking spatiotemporally linked\nmetacommunities of hosts may be a feature of many natural\ncommunities, as oak gall communities show many similarities with\nthose centred on other concealed insect herbivores (such as other\ngall inducers, leaf miners, or stem borers) [15,16,22,45–47,65,68],\nincluding many pests and potential targets for biological control.\nOur work underlines the need to incorporate host phylogeny into\nanalyses of community structure, and doing so may help to predict\nFigure 4. Host trait-associated variation in parasitism by generalist parasitoids in communities associated with sexual and asexual\ngeneration oak gallwasp communities. The dominance plot shows, for the five most generalist parasitoid species, the proportion individuals of\na given species comprise of all emerged parasitoids ( = dominance) averaged across host gall types with specific gall locations and oak associations.\nGall locations refer to the plant organ galled (the location category ‘‘wood’’ refers to galls integral to the main axis of shoots), while oak taxon\nassociations refer to gall induction on species in either Quercus section Cerris or section Quercus sensu stricto. The selected parasitoid taxa are A.\ngallarum (Eulophidae), C. fungosa (Pteromalidae), E. brunniventris (Eurytomidae), M. dorsalis (Torymidae), and S. biguttata (Eurytomidae). The data\nfrom different host gall types have been pooled at two biologically relevant spatial scales, namely galls on different plant organs (left) and on\ndifferent oak host taxa (right).\ndoi:10.1371\/journal.pbio.1000179.g004\nHost Traits Structure Parasitoid Communities\nPLoS Biology | www.plosbiology.org 9 August 2009 | Volume 7 | Issue 8 | e1000179\nboth the natural enemies awaiting invading hosts, and the\nnontarget hosts of possible biocontrol agents [65].\nMaterials and Methods\nHost Species and Their Gall Traits\nFull names of all host gallwasp species are listed in Table S1 and\ngall traits are defined in Table 1. Gall morphology traits were\nrecorded for mature galls and are listed in Table S2, and shown in\nFigure S2. Gall season refers to the date of the first recorded onset\nof development of a gall type (see Table 1). Gall persistence was\nmeasured in weeks from the onset of development until the gall\ninducer emerged, or the gall fell from the tree, or the end of\nparasitoid attack in a given year—assumed here to be the end of\nOctober on the basis of parasitoid emergence dates from our\nrearings.\nHost abundance per gall was estimated using the mean number\nof parasitoids emerging from a single gall of each phenotype. Both\nsample size and the mean number of parasitoids per gall were\nln(value +1) transformed prior to analysis.\nParasitoid Community Data\nGalls were collected between 2000 and 2003 at five field sites in\nHungary (Figure S1) and reared individually in outside insectaries.\nAt each sample site, galls were collected from.100 individual trees\ncomprising all oak species present, separated by an average of 20–\n50 m, over an area of approximately 0.25 km2 (500 m6500 m).\nEach site was searched systematically and thoroughly at fortnightly\nintervals between April and October, and where natural host\ndistributions allowed, each gall type was harvested as far as possible\nacross the full site area. Galls were harvested haphazardly with\nrespect to height and aspect, to a maximum of 8 m above ground\nlevel with a long handled pruner. Galls were always harvested in\ntheir first year of development, typically across a number of dates\nbut also before emergence of gall inhabitants and after adequate gall\ngrowth to allow inhabitants to develop to adulthood. The emerging\nwasps were identified to species level and all host and parasitoid\nspecies are listed in Tables S1 and S3. The target sample size per\ngall type per site was 150, based on our previous work on cynipid\ncommunities [24,28,29]. Because of unavoidable variation in what\nwas actually reared (Table S4), sample size was fitted as a covariate\nin all analyses. Pairwise similarities between parasitoid communities\nfor use in both MCA and Analyses Of SIMilarity (ANOSIM; [71])\nwere calculated as Bray-Curtis similarities in PRIMER 5 (Primer-E\nLtd) from standardised untransformed parasitoid abundances. We\ndid this for individual sites and for the pooled sites dataset (i) for\npooled gallwasp generations to allow us to test differences between\nsexual and asexual generation communities (ANOSIM), and (ii) for\nsexual and asexual generations separately to allow analyses of\npatterns within each generation (MCA). The ANOSIM analyses\nwere carried out as a one-way design using generation as\nexplanatory factor. The number of possible permutations was\ncapped at 999. To allow analysis of community composition using\nphylogenetically independent contrasts, the Bray-Curtis matrix was\ndecomposed into three mutually independent variables using MDS\n[72]. Three MDS dimensions were used for each dataset, which\nreduced STRESS [72] (a measure of goodness of fit) to below an\nacceptable threshold [72] of 0.15 in every case. Each MDS\ndimension was tested as a separate response variable. The parasitoid\ncommunity response variables and other descriptors (MDS axes,\nspecies richness, sampling effort) are listed in Table S4. The oaks\nattacked by gallwasp hosts were identified to oak section, either\nsection Cerris (Q. cerris) or section Q. sensu stricto (Q. petraea, Q.\npubescens, Q. robur). We did not attempt to separate species within the\nsection Quercus because extensive hybridisation makes definitive\nallocation of individuals to species using either morphological or\nmolecular markers impossible [73–78]. In this we match observed\npatterns in oak gallwasp host specificity [25,39,41] and follow\nprevious analyses of insect biodiversity on Western Palaearctic oaks\n[79,80].\nGallwasp Phylogeny\nThe gallwasp phylogeny was estimated from partial sequences\n(433 base pairs, accession numbers in Table S1) of the mitochondrial\ncytochrome b locus. Generation of the sequence data and selection\nof appropriate models of sequence evolution for this locus are\ndiscussed in detail elsewhere [39,41]. Our phylogenetic hypothesis\n(working phylogeny sensu Grafen [42]) was generated using a\nBayesian approach in MRBAYES 3.0 [81] using the general time-\nreversible (GTR) model of sequence evolution. Trees were sampled\nover 106 generations with an empirically determined burn-in period\nof 105 generations before tree sampling began. Convergence of\nparameter estimates over each run was confirmed using TRACER\n[82]. As in previous phylogenetic analyses of Western Palaearctic oak\ngallwasps [23,25,41], we used the rose gallwasp Diplolepis rosae as the\noutgroup. The topology of the phylogeny used here matches very\nclosely the results of more extensive published analyses that use a\ncombination of mitochondrial and nuclear markers [25,41].\nGenBank (http:\/\/www.ncbi.nlm.nih.gov\/Genbank) accession num-\nbers for all sequences used in our analysis are listed in Table S1.\nAnalysis of Phylogenetically Independent Contrasts\nWe used PRA [42] for multiple regression of phylogenetically\nindependent contrasts in GLIM 4.0. This approach uses a user-\ndefined working phylogeny to structure a generalised linear\nmodelling analysis in which significance of each explanatory\nvariable was tested in turn while controlling for all others. The\napproach assumes a normal distribution during model fitting, and\nwhere necessary, variables were transformed to meet this\nassumption (see ‘‘Host Species and Their Gall Traits’’ above).\nTo minimise the impact of phylogenetic uncertainty on the\nregression procedure [42], we took the conservative approach of\ncollapsing nodes with a posterior probability of ,70% into\npolytomies. Grafen’s default ‘‘figure 2 method’’ [42] was used to\ndetermine the initial distribution of branch lengths (node\nheight = (i 2 1)\/(n 2 1), where n=number of species and\ni=number of species below that node in the phylogeny). Minimal\nadequate models (MAM) were determined by stepwise removal of\nall nonsignificant (p.0.05) variables. Where the multilevel factors\n‘‘plant organ galled’’ and ‘‘gall toughness’’ were retained in\nmodels, the categories were split into a series of binary variables.\nThese were then tested in all possible combinations, controlling for\nother significant variables, to reveal significant categories. In\nanalyses for separate generations and sites, significance levels were\nadjusted for multiple tests using the Bonferroni correction\n(corrected threshold p=1 2 (1 2 alpha)1\/k where k is the number\nof tests and alpha is the desired threshold value of 5%). The\nnumbers of species and independent contrasts in each analysis are\ngiven in Table 4.\nMCA\nIn these analyses, host relatedness was incorporated as a\ncovariate and estimated as (1 – the GTR model proportional\nsequence divergence between host species pairs) for the cyto-\nchrome b data, calculated using PAUP* [83]. Pairwise divergences\nbetween species for this gene closely parallel those in a nuclear\ngene (long wavelength opsin; [41]), suggesting that this is an\nappropriate measure of phylogenetic relatedness. MCA was\nHost Traits Structure Parasitoid Communities\nPLoS Biology | www.plosbiology.org 10 August 2009 | Volume 7 | Issue 8 | e1000179\ncarried out with simple or partial Mantel permutation tests in\nFSTAT [84], using 2,000 permutations and following Manly [85].\nAs in the PRA, nonsignificant variables were removed from each\nfull model to leave the MAM. Analyses were carried out for pooled\nand single sites, for separate generations. Similarities in gall traits\nwere calculated using the Manhattan method for continuous\nvariables and the Jaccard index for binary variables [86].\nAnalyses of Parasitoid Dominance\nWe used a SIMPER analysis in PRIMER5 to reveal which\nspecies of parasitoid accounted for the majority of pairwise Bray-\nCurtis similarity in associated parasitoid communities of host gall\ntypes. Most of the variation could be attributed to five species: A.\ngallarum (Eulophidae), Cecidostiba fungosa (Pteromalidae), Eurytoma\nbrunniventris (Eurytomidae), M. dorsalis (Torymidae), and S. biguttata\n(Eurytomidae). All five species are extreme generalists and were\nrecorded from more than 20 host gall types in this study (Table\nS3). To visualise variation in the impact of these species across\ngalls with different traits, we (i) calculated the dominance of each\nspecies in each host gall type as the proportion of individuals of\nthat species of the total of emerging parasitoids, and then (ii)\naveraged the dominance values for each parasitoid species across\nhost gall types sharing each selected trait of interest.\nSupporting Information\nFigure S1 Field sampling sites. The five sites sampled\n(latitude and longitude in decimal degrees) were Ma´trafu¨red (47.83\nN, 19.97 E), Go¨do¨llo˜ (47.6 N, 19.35 E), Szentku´t (47.98 N, 19.8 E),\nVa´rpalota (47.20 N, 18.13 E), and Sopron (47.68 N, 16.57 E).\nFound at: doi:10.1371\/journal.pbio.1000179.s001 (0.12 MB TIF)\nFigure S2 The host gall phenotypes in this study. The\nfollowing images show the mature phenotypes of all 48 gall types\nin our study, numbered according to the list above. In each image\nthe scale bar is 1 cm long.\nFound at: doi:10.1371\/journal.pbio.1000179.s002 (17.64 MB\nPDF)\nTable S1 Full names and GenBank accession numbers\nof the host gallwasps. The number by each species and gall\ngeneration (A, asexual; S, sexual) identifies it in Figure S2 and\nTables S2 and S4.\nFound at: doi:10.1371\/journal.pbio.1000179.s003 (0.03 MB\nDOC)\nTable S2. Gall scores for explanatory variables. Key to\ncolumns: Gall vol., Gall cortex volume (mm3); Hair, hairiness;\nHard, toughness (1, soft; 2, semi-soft; 3, hard; 4, very hard); Loc,\nlocularity (M, multilocular; U, unilocular); N, absent; Oak, Oak\nsection (Q, Quercus section Quercus; C, Quercus section Cerris);\nOrg, host organ galled (B, bud; C, catkin; A, acorn; L, lenticel bud;\nLf, leaf; S, shoot); Phen, persistence; Res, resource volume (mm3);\nSeas, season; Space, presence\/absence of an internal airspace;\nSpine, spininess; Stick, stickiness; Y, present.\nFound at: doi:10.1371\/journal.pbio.1000179.s004 (0.11 MB\nDOC)\nTable S3 Parasitoid species list. The full names and family\naffiliations of all parasitoid species sampled are given below. All\nare members of the superfamily Chalcidoidea. The families\nrepresented are Eulophidae (Eul), Eupelmidae (Eup), Eurytomidae\n(Eury), Ormyridae (Orm), Pteromalidae (Pter), and Torymidae\n(Tor). A full list of the parasitoid composition of galls of each host\nis available from the authors by request.\nFound at: doi:10.1371\/journal.pbio.1000179.s005 (0.04 MB\nDOC)\nTable S4 Gall scores for response (community) and\nsampling variables for pooled-sites analyses in each of\n(i) sexual generation galls, and (ii) asexual generation\ngalls. Key to variables: Galls producing, total number of galls\nproducing parasitoids; No. emerged, total number of emerging\nparasitoids; Richness, species richness; MDS axes 1–3 are values\nfor three mutually independent MDS axes describing community\ncomposition.\nFound at: doi:10.1371\/journal.pbio.1000179.s006 (0.11 MB\nDOC)\nAcknowledgments\nWe thank Maria Bechtold for her help in specimen preparation and Dick\nAskew for his help with parasitoid identification. Tim Barraclough, Jackie\nBrown, Mike Hassell, Andy Purvis, and Andrew Reid all made helpful\ncomments on the manuscript.\nAuthor Contributions\nThe author(s) have made the following declarations about their\ncontributions: Conceived and designed the experiments: KS JMC GNS.\nPerformed the experiments: RB GM GC CT. Analyzed the data: RB KS\nJMC GNS. Wrote the paper: RB KS JMC GNS.\nReferences\n1. Singer MS, Stireman JO (2005) The tri-trophic niche concept and adaptive\nradiation of phytophagous insects. Ecol Lett 8: 1247–1255.\n2. AbrahamsonWG,Blair CP (2008) Sequential radiation through host-race formation:\nherbivore diversity leads to diversity in natural enemies. Tilmon K, ed. Speciali-\nzation, speciation, and radiation: the evolutionary biology of herbivorous insects.\nBerkeley (California): University of California Press. pp 188–202.\n3. Weiher E, Keddy PE (1999) Ecological assembly rules: perspectives, advances,\nretreats. Cambridge: Cambridge University Press.\n4. Losos JB, Leal M, Glor RE, de Queiroz K, Hertz PE, et al. (2003) Niche lability\nin the evolution of a Caribbean lizard community. Nature 424: 542–545.\n5. Stireman JO, Singer MS (2003) Determinants of parasitoid-host associations:\ninsights from a natural tachinid-lepidopteran community. Ecology 84: 296–310.\n6. Tylianakis JM, Tscharntke T, Lewis OT (2007) Habitat modification alters the\nstructure of tropical host-parasitoid food webs. Nature 445: 202–205.\n7. Fraser SEM, Dytham C, Mayhew PJ (2007) Determinants of parasitoid\nabundance and diversity in woodland habitats. J Appl Ecol 44: 352–361.\n8. Bruno JF, Cardinale BJ (2008) Cascading effects of predator richness. Front Ecol\nEnviron 6: 539–546.\n9. van Veen FJF, Morris RJ, Godfray HCJ (2006) Apparent competition,\nquantitative food webs, and the structure of phytophagous insect communities.\nAnnu Rev Entomol 51: 187–208.\n10. Agrawal AA, Ackerly DD, Adler F, Arnold AE, Caceres C, et al. (2007) Filling\nkey gaps in population and community ecology. Front Ecol Environ 5: 145–152.\n11. Webb C, Losos J, Agrawal A (2006) Integrating phylogenies into community\necology. Ecology 87: S1–S2.\n12. Schmitz OJ (2008) Effects of predator hunting mode on grassland ecosystem\nfunction. Science 319: 952–954.\n13. Bukovinszky T, van Veen FJF, Jongema Y, Dicke M (2008) Direct and\nindirect effects of resource quality on food web structure. Science 319:\n804–807.\n14. Gillespie R (2004) Community assembly through adaptive radiation in Hawaiian\nspiders. Science 303: 356–359.\n15. Godfray HCJ (1994) Parasitoids. Behavioural and evolutionary ecology.\nPrinceton (New Jersey): Princeton University Press. 473 p.\n16. Hawkins BA, Sheehan W (1994) Parasitoid community ecology. Oxford: Oxford\nUniversity Press.\n17. May RM (1990) How many species? Phil Trans Biol Sci 330: 293–304.\n18. Nyman T, Bokma F, Kopelke JP (2007) Reciprocal diversification in a complex\nplant-herbivore-parasitoid food web. BMC Biology 5: 49.\n19. Hawkins BA, Mills NJ (1996) Variability in parasitoid community structure.\nJ Anim Ecol 65: 501–516.\n20. Stireman JO, Nason JD, Heard SB, Seehawer JM (2006) Cascading host-\nassociated genetic differentiation in parasitoids of phytophagous insects. Proc\nBiol Sci 273: 523–530.\n21. Askew RR (1961) On the biology of the inhabitants of oak galls of Cynipidae\n(Hymenoptera) in Britain. Trans Soc Brit Entomol 14: 237–258.\nHost Traits Structure Parasitoid Communities\nPLoS Biology | www.plosbiology.org 11 August 2009 | Volume 7 | Issue 8 | e1000179\n22. Askew RR (1980) The diversity of insect communities in leaf mines and plant\ngalls. J Anim Ecol 49: 817–829.\n23. Stone GN, Cook JM (1998) The structure of cynipid oak galls: patterns in the\nevolution of an extended phenotype. Proc Biol Sci 265: 979–988.\n24. Stone GN, Scho¨nrogge K, Atkinson RJ, Bellido D, Pujade-Villar J (2002) The\npopulation biology of oak gall wasps (Hymenoptera: Cynipidae). Annu Rev\nEntomol 47: 633–668.\n25. Cook JM, Rokas A, Pagel M, Stone GN (2002) Evolutionary shifts between host\noak sections and host-plant organs in Andricus gallwasps. Evolution 56:\n1821–1830.\n26. Cook JM, Stone GN, Rowe A (1998) Patterns in the evolution of gall structure\nand life cycles in oak gallwasps (Hymenoptera: Cynipidae). Cso´ka G,\nMattson WJ, Stone GN, Price PW, eds. The biology of gall-inducing\narthropods. St. Paul (Minnesota): U.S. Department of Agriculture (USDA),\nForest Service, North Central Research Station. pp 261–279.\n27. Stone GN, Scho¨nrogge K (2003) The adaptive significance of insect gall\nmorphology. Trends Ecol Evol 18: 512–522.\n28. Scho¨nrogge K, Crawley MJ (2000) Quantitative webs as a means of assessing the\nimpact of alien insects. J Anim Ecol 69: 841–868.\n29. Scho¨nrogge K, Walker P, Crawley MJ (1998) Invaders on the move: parasitism\nin the sexual galls of four alien gall wasps in Britain (Hymenoptera: Cynipidae).\nProc Biol Sci 265: 1643–1650.\n30. Askew RR (1961) A study of the biology of species of the genus Mesopolobus\nWestwood (Hymenoptera; Pteromalidae) associated with cynipid galls on oak.\nTrans Roy Ent Soc Lond 133: 155–173.\n31. Askew RR (1965) The biology of the British species of the genus Torymus\nDalman (Hymenoptera: Torymidae) associated with galls of Cynipidae\n(Hymenoptera) on oak, with special reference to alternation of forms. Trans\nRoy Entomol Soc Lond 9: 217–32.\n32. Dawkins R (1982) The extended phenotype. Oxford: Oxford University Press.\n307 p.\n33. Price PW, Fernandes GW, Waring GL (1987) Adaptive nature of insect galls.\nEnviron Entomol 16: 15–24.\n34. Abrahamson WG, Weis AE (1997) Evolutionary ecology across three trophic\nlevels: goldenrods, gallmakers and natural enemies. Princeton Monographs in\nPopulation Biology number 29. Princeton (New Jersey): Princeton University\nPress. 456 p.\n35. Agrawal AA (2001) Ecology - phenotypic plasticity in the interactions and\nevolution of species. Science 294: 321–326.\n36. Clayton DH, Bush SE, Goates BM, Johnson KP (2003) Host defence reinforces\nhost–parasite cospeciation. Proc Natl Acad Sci USA 100: 15694–15699.\n37. Stone GN, Challis RJ, Atkinson RJ, Cso´ka G, Hayward A, et al. (2007) The\nphylogeographical clade trade: tracing the impact of human-mediated dispersal\non the colonization of northern Europe by the oak gallwasp Andricus kollari.\nMol Ecol 16: 2768–2781.\n38. Challis RJ, Mutun S, Nieves-Aldrey JL, Preuss S, Rokas A, et al. (2007)\nLongitudinal range expansion and cryptic eastern species in the western\nPalaearctic oak gallwasp, Andricus coriarius. Mol Ecol 16: 2103–2114.\n39. Stone GN, Atkinson RJ, Rokas A, Nieves-Aldrey JL, Melika G, et al. (2008)\nEvidence for widespread cryptic sexual generations in apparently purely asexual\nAndricus gallwasps. Mol Ecol 17: 652–665.\n40. Stone GN, Scho¨nrogge K, Crawley MJ, Fraser S (1995) Geographic variation in\nthe parasitoid community associated with an invading gallwasp, Andricus\nquercuscalicis (Hymenoptera: Cynipidae). Oecologia 104: 207–217.\n41. Stone GN, Hernandez-Lopez A, Nicholls JA, di Pierro E, Pujade-Villar J, et al.\n(2009) Extreme host plant conservatism during at least 20 million years of host\nplant pursuit by oak gallwasps. Evolution 63: 854–869.\n42. Grafen A (1989) The phylogenetic regression. Phil Trans Biol Sci 326: 119–157.\n43. Cso´ka G, Stone GN, Melika G (2005) The biology, ecology and evolution of gall\nwasps. Raman A, Schaeffer CW, Withers TM, eds. Biology, ecology and\nevolution of gall-inducing arthropods. Enfield (New Hampshire): Science\nPublishers Inc. pp 573–642.\n44. Lill JT, Marquis RJ, Ricklefs RE (2002) Host plants influence parasitism of forest\ncaterpillars. Nature 417: 170–173.\n45. Rott AS, Godfray HCJ (2000) The structure of a leafminer-parasitoid\ncommunity. J Anim Ecol 69: 274–289.\n46. Hawkins BA (1993) Parasitoid species richness, host mortality, and biological-\ncontrol. Am Nat 141: 634–641.\n47. Lewis OT, Memmott J, LaSalle J, Lyal CHC, Whitefoord C, et al. (2002)\nStructure of a diverse tropical forest insect-parasitoid community. J Anim Ecol\n71: 855–873.\n48. Hawkins BA, Askew RR, Shaw MR (1990) Influences of host feeding niche and\nfoodplant type on generalist and specialist parasitoids. Ecol Entomol 15:\n275–280.\n49. Gauld ID, Gaston KJ, Janzen DH (1992) Plant allelochemicals, tritrophic\ninteractions and the anomalous diversity of tropical parasitoids: the ‘nasty’ host\nhypothesis. Oikos 65: 353–357.\n50. Le Corff J, Marquis RJ, Whitfield JB (2000) Temporal and spatial variation in a\nparasitoid community associated with the herbivores that feed on Missouri\nQuercus. Environ Entomol 29: 181–194.\n51. Price PW, Pschorn-Walcher H (1988) Are galling insects better protected against\nparasitoids than exposed feeders? a test using tenthredinid sawflies. Ecol\nEntomol 13: 195–205.\n52. Waring GL, Price PW (1989) Parasitoid pressure and the radiation of a gall\nforming group (Cecidomyiidae: Asphondyllia spp.) on creosote bush (Larrea\ntridentata). Oecologia 79: 293–299.\n53. Hawkins BA, Gagne´ RJ (1989) Determinants of assemblage size for the\nparasitoids of Cecidomyiidae (Diptera). Oecologia 81: 75–88.\n54. Mills NJ (1993) Species richness and structure in the parasitoid complexes of\ntortricoid hosts. J Anim Ecol 62: 45–59.\n55. Hawkins BA, Goeden RD (1984) Organisation of a parasitoid community\nassociated with a complex of galls on Atriplex spp. in southern California. Ecol\nEntomol 9: 271–292.\n56. Sheehan W (1994) Parasitoid community structure: effects of host abundance,\nphylogeny, and ecology. Hawkins BA, Sheehan W, eds. Parasitoid community\necology. Oxford: Oxford University Press. pp 90–110.\n57. Gross P (1993) Insect behavioural and morphological defences against\nparasitoids. Annu Rev Entomol 38: 251–273.\n58. Gentry G, Dyer LA (2002) On the conditional nature of neotropical caterpillar\ndefences against their natural enemies. Ecology 83: 3108–3119.\n59. Roland J, Taylor PD (1997) Insect parasitoid species respond to forest structure\nat different spatial scales. Nature 386: 710–713.\n60. Thompson JN, Cunningham BM (2002) Geographic structure and dynamics of\ncoevolutionary selection. Nature 417: 735–738.\n61. Jeffries MJ, Lawton JH (1984) Enemy-free space and the structure of ecological\ncommunities. Biol J Linn Soc 23: 269–286.\n62. Hawkins BA (1988) Do galls protect endophytic herbivores from parasitoids? A\ncomparison of galling and non-galling Diptera. Ecol Entomol 13: 473–477.\n63. Salvo A, Valladares GR (2004) Looks are important: parasitic assemblages of\nagromyzid leaf miners (Diptera) in relation to mine shape and contrast. J Anim\nEcol 73: 494–505.\n64. Joy JB, Crespi BJ (2007) Adaptive radiation of gall inducing insects within a\nsingle host-plant species. Evolution 61: 784–795.\n65. Henneman ML, Memmott J (2001) Infiltration of a Hawaiian community by\nintroduced biological control agents. Science 293: 1314–1316.\n66. Ackland GJ, Gallagher ID (2004) Stabilization of large generalized Lotka-\nVolterra foodwebs by evolutionary feedback. Phys Rev Lett 93: 158701.\n67. Kondoh M (2003) Foraging adaptation and the relationship between food-web\ncomplexity and stability. Science 299: 1388–1391.\n68. Morris RJ, Lewis OT, Godfray HCJ (2004) Experimental evidence for apparent\ncompetition in a tropical forest food web. Nature 428: 310–313.\n69. Kondoh M (2007) Anti-predator defence and the complexity-stability relation-\nship of food webs. Proc Biol Sci 274: 1617–1624.\n70. Dell AI, Kokkoris GD, Banasek-Richter C, Bersier L-F, Dunne JA, et al. (2005)\nHow do complex food webs persist in Nature? de Ruiter PC, Wolters V,\nMoore JC, eds. Dynamic food webs. Amsterdam: Academic Press. pp 425–436.\n71. Clarke KR (1993) Non-parametric multivariate analyses of changes in\ncommunity structure. Aust J Ecol 18: 117 –143.\n72. Kruskall JB, Wish M (1978) Multidimensional Scaling. Beverly Hills (California):\nSAGE Publications Inc. 96 p.\n73. Bacilieri R, Ducousso A, Kremer A (1996) Comparison of morphological\ncharacters and molecular markers for the analysis of hybridisation in sessile and\npedunculate oak. Annal Sci Forest 53: 79–91.\n74. Bruschi P, Vendramin GG, Bussotti F, Grossoni P (2000) Morphological and\nmolecular differentiation between Quercus petraea (Matt.) Liebl. and Quercus\npubescens Willd. (Fagaceae) in northern and central Italy. Ann Bot 85: 325–333.\n75. Bussotti F, Grossoni P (1997) European and Mediterranean oaks (Quercus L.;\nFagaceae) SEM characterization of the micromorphology of the abaxial leaf\nsurface. Bot J Linn Soc 124: 183–199.\n76. Dumolin-Lape`gue S, Demesure B, Fineschi S, Le Corre V, Petit RJ (1997)\nPhylogeographic structure of white oaks throughout the European continent.\nGenetics 146: 1475–1487.\n77. Dupouey JL, Badeau V (1993) Morphological variability of oaks (Q. robur L., Q.\npetraea (Matt.) Liebl, Q. pubescens Willd.) in northeastern France: preliminary\nresults. Annal Sci Forest 50: 35s–40s.\n78. Muir G, Fleming CC, Schlo¨tterer C (2000) Species status of hybridising oaks.\nNature 405: 1016.\n79. Kelly CK, Southwood TRE (1999) Species richness and resource availability: A\nphylogenetic analysis of insects associated with trees. Proc Natl Acad Sci USA\n96: 8013–8016.\n80. Kennedy CEJ, Southwood TRE (1984) The number of species of insects\nassociated with British trees – a reanalysis. J Anim Ecol 53: 455–478.\n81. Huelsenbeck JP, Ronquist F (2001) MrBayes: Bayesian inference of phylogeny.\nBioinformatics 17: 754–755.\n82. Rambaut A, Drummond A (2003) Tracer: MCMC Trace Analysis Tool.\nOxford: University of Oxford.\n83. Swofford DL (2002) PAUP*. Phylogenetic Analysis Using Parsimony (*and\nOther Methods). Sunderland (Massachusetts): Sinauer.\n84. Goudet J (1995) Fstat version 1.2: a computer program to calculate F statistics.\nJ Hered 86: 485–486.\n85. Manly BJF (1997) Randomization, bootstrap and Monte Carlo methods in\nbiology. London: Chapman and Hall. 424 p.\n86. Krebs CJ (1999) Ecological methodology. Menlo Park (California): Addison,\nWesley, Longman. 624 p.\nHost Traits Structure Parasitoid Communities\nPLoS Biology | www.plosbiology.org 12 August 2009 | Volume 7 | Issue 8 | e1000179\n"}