{"doi":"10.1063\/1.1931059","coreId":"100822","oai":"oai:epubs.surrey.ac.uk:220","identifiers":["oai:epubs.surrey.ac.uk:220","10.1063\/1.1931059"],"title":"Dynamic Amplitude-Phase Coupling in Quantum-Dot Lasers","authors":["Gehrig, E","Hess, O"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-01-01","abstract":"<p>The well-known alpha-factor is a convenient measure to describe the magnitude of the amplitude-phase coupling of semiconductor lasers. But is the alpha-factor really a parameter? First-principle simulations of InGaAs quantum-dot lasers and amplifiers show that in spatially extended quantum-dot laser structures, the amplitude phase coupling is far from being a constant. Our computation of the alpha-factor demonstrates the same large and excitation-dependent variation and scatter as corresponding to experimentally determined values. Our results therefore provide a key to the interpretation and give a measure of applicability of the alpha-factor for the classification of quantum-dot lasers. (c) 2005 American Institute of Physics.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:220<\/identifier><datestamp>\n      2017-10-31T13:57:12Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/220\/<\/dc:relation><dc:title>\n        Dynamic Amplitude-Phase Coupling in Quantum-Dot Lasers<\/dc:title><dc:creator>\n        Gehrig, E<\/dc:creator><dc:creator>\n        Hess, O<\/dc:creator><dc:description>\n        <p>The well-known alpha-factor is a convenient measure to describe the magnitude of the amplitude-phase coupling of semiconductor lasers. But is the alpha-factor really a parameter? First-principle simulations of InGaAs quantum-dot lasers and amplifiers show that in spatially extended quantum-dot laser structures, the amplitude phase coupling is far from being a constant. Our computation of the alpha-factor demonstrates the same large and excitation-dependent variation and scatter as corresponding to experimentally determined values. Our results therefore provide a key to the interpretation and give a measure of applicability of the alpha-factor for the classification of quantum-dot lasers. (c) 2005 American Institute of Physics.<\/p><\/dc:description><dc:date>\n        2005-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/220\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Gehrig, E and Hess, O  (2005) Dynamic Amplitude-Phase Coupling in Quantum-Dot Lasers   Applied Physics Letters, 86 (20).       <\/dc:identifier><dc:relation>\n        10.1063\/1.1931059<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/220\/","10.1063\/1.1931059"],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Dynamic amplitude-phase coupling in quantum-dot lasers\nE. Gehriga! and O. Hess\nAdvanced Technology Institute, School of Electronics and Physical Sciences, University of Surrey,\nGuildford, Surrey, GU2 7XH, United Kingdom\nsReceived 9 February 2005; accepted 24 April 2005; published online 13 May 2005d\nThe well-known a-factor is a convenient measure to describe the magnitude of the amplitude-phase\ncoupling of semiconductor lasers. But is the a-factor really a parameter? First-principle simulations\nof InGaAs quantum-dot lasers and amplifiers show that in spatially extended quantum-dot laser\nstructures, the amplitude phase coupling is far from being a constant. Our computation of the\na-factor demonstrates the same large and excitation-dependent variation and scatter as\ncorresponding to experimentally determined values. Our results therefore provide a key to the\ninterpretation and give a measure of applicability of the a-factor for the classification of\nquantum-dot lasers. © 2005 American Institute of Physics. fDOI: 10.1063\/1.1931059g\nSince the early days of laser science, the linewidth en-\nhancement factor, or a-factor, has been used as an important\nparameter for the classification of laser structures. The\na-factor is defined as the ratio of the variation of the gain\nand index sor real and complex parts of the complex suscep-\ntibilityd with the carrier density N\na = −\n4p\nl\ndn\/dN\ndg\/dN\n=\nd Refxg\/dN\nd Imfxg\/dN\n, s1d\nwhere n is the sinducedd refractive index, g is the gain, and N\nis the carrier density. In the case of the semiconductor laser,\nmany fundamental properties, such as linewidth, chirp, and\nthe filamentation, are strongly influenced by the effects de-\nscribed by the a-factor. In the 1980s, first measurements re-\nvealed that the semiconductor laser linewidth was much\nbroader than the Shawlow Townes limit. Soon after, Henry1\ntheoretically explained the excess linewidth with the cou-\npling of index and gain via the carrier dynamics. Since then,\nthe role of the a-factor has been the very focus of many\ntheoretical and experimental publications.2\nGenerally, the coupling of gain and index or amplitude\nand phase strongly depends on the material and cavity design\nof the semiconductor medium. Semiconductor quantum dots\nsQDsd have discrete level energies and a rather symmetric\ngain and induced index dispersion. QD lasers sQDLsd thus\nshould, in principle, have a small a-factor. Indeed, values\nnear 1.0 have been found for InGaAs\/GaAs QDLs in\nexperiments.3 Furthermore, it has been demonstrated that the\na-factor in QDLs is much lower and shows less dispersion\nthan in quantum-well lasers of identical material and\ngeometry.4 However, the measured values of a strongly vary,\neven in the same type of QDL from device to device.5 One\nmay thus immediately ask: Is a really a factor? Is it really is\na good quantity for the description and classification of the\noptical properties of QD semiconductor lasers taking into\naccount the characteristic spatial disorder of QD ensembles\nin temporal variation and spatial-temporal average?\nTo shed light on these questions, we study the\namplitude-phase coupling dynamics in QDL and calculate\nthe a-factor based on first principles. The theoretical descrip-\ntion is based on spatially resolved QD Maxwell–Bloch equa-\ntions that describe the spatiotemporal light field and inter-\/\nintralevel carrier dynamics in each QD of a typical QD\nensemble.6 In particular, this includes spontaneous lumines-\ncence, counterpropagation of amplified spontaneous emis-\nsion, and induced recombination as well as carrier diffusion\nin the wetting layer of the laser. Intradot scattering via emis-\nsion and absorption of phonons, as well as the scattering with\nthe carriers and phonons of the surrounding wetting layer are\ndynamically included on a mesoscopic level. Spatial fluctua-\ntions in size and energy levels of the QDs and irregularities\nin the spatial distribution of the QDs in the active layer are\nsimulated via statistical methods. Although, the explicit con-\nsideration of the full dipole dynamics does not require an\nartificial inclusion of the a parameter, we can in our equa-\ntions extract the value of this parameter via the dynamically\ncalculated real and imaginary part of the polarization that are\nvia the light fields directly correlated to the susceptibility. In\nthe following, we will address the following questions: sid\nHow does the characteristic spatial disorder of QD en-\nsembles and the light-field dynamics affect a? siid How does\nthe ultrafast dynamcis feed back onto a?\nFor a QDL of 1 mm length and 50 mm stripe width Fig.\n1 shows the dynamics of the sspatially averagedd amplitude\nphase coupling after the startup of the laser si.e., switching\nadElectronic mail: e.gehrig@surrey.ac.uk\nFIG. 1. Dynamics of a in a QDL sL=1 mm,w=50 mmd: Spatial average\ndependent of time immediately after the switching on the current. Insert:\nSnapshots of the intensity sleftd and a srightd at 2.5 ns.\nAPPLIED PHYSICS LETTERS 86, 203116 s2005d\n0003-6951\/2005\/86~20!\/203116\/3\/$22.50 © 2005 American Institute of Physics86, 203116-1\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\nthe current from zero to its final valued. The insert visualizes\na snapshot staken after 2.5 nsd of the spatial distribution of\nthe intensity sleftd and the a-factor srightd. The spatial aver-\nage of a shows a relaxation behavior that orginates from the\nout-of-equilibrium dynamics of light fields and carriers\nwithin the first few nanoseconds. The snapshot shows an\nimage of dynamic mm-sized light patterns frozen in time.\nThe formation of this pattern originates from the dynamic\nlight-matter coupling characterized by light diffraction, self-\nfocusing, and complex carrier scattering. At the same time,\nthe spatially varying carrier and intradot dipole dynamics\nleads to the highly complex dynamics and the strong spatial\ndependence of the a-factor. Indeed, typical values for a may,\nin a given laser structure, spatially and temporally vary from\nvalues between −3 to 3 or even show singularities while the\naverage with respect to space and time may be considerably\nlower. Although a may be comparatively small in each indi-\nvidual dot at a particular moment in time the complex am-\nplitude and phase dynamics resulting from the characteristic\nspatially varying material properties se.g., energy levels and\ndipole matrix elements in combination with the dynamic\ncoupling to the counterpropagating light fieldsd lead to strong\nspatial and temporal changes in a. The a “factor” conse-\nquently is far from being constant: Fig. 2sad shows the de-\npendence of a stemporally and spatially averagedd on the\nwidth of the laser while Figs. 2sbd and 2scd demonstrate the\ndependence of a on carrier injection for a narrow-stripe laser\nsstripe width of 6 mmd and a broad-stripe laser stransverse\nstripe width 50 mmd, respectively. With increasing width of\nthe QDL, the transverse dimension effectively becomes more\nand more important: Physical processes, such as carrier dif-\nfusion, light diffraction, and dynamic phase changes, result\nin a notable deterioration of the beam quality7 and an in-\ncrease in a. In the narrow-stripe QDL swidth of 6 mmd a\nincreases slightly with increasing carrier density. There, the\nincrease in carrier injection induces a strong intradot carrier\ndynamics characterized by carrier capture and carrier-phonon\ninteractions coupling the various energy levels within the\ndot. As a consequence, the carrier-induced gain and index\ndispersion show complex dynamics leading to an increase in\na. In the QDL with the large stripe width, we find an addi-\ntional increase in complexity: For an ideal laser with homo-\ngeneous material properties si.e., identical dot size, matrix\nelements, and uniform dot distributiond, the amplitude phase\ncoupling may even decrease with increasing stripe with. This\neffect can be attributed to strong Coulomb interactions that\nmay shift the characteristic gain and index distributions as\nwell as the resulting a parameter.8 In the spatially inhomo-\ngeneous dot ensemble sin the example: 18 meVd, the ampli-\ntude phase coupling rises with increasing carrier injection\ndue to the increase in spatiotemporal carrier, gain, and index\ndynamics.\nFigure 3 shows a snapshot of the intensity sad and the a\nfactor sbd in the active area of a QD laser amplifier swidth\n6 mm, length 1 mmd into which a resonant picosecond light\npulse has been injected. The optical injection leads to a dy-\nnamic excitation and relaxation within the charge carrier sys-\ntem. This is directly reflected in the rise and decrease of a\nfFig. 3sbdg. Under these particular conditions, a represents\nthe material response to the optical excitation and more or\nless mirrors the pulse shape. We would like to note that the\nspecific shape and sspatial as well as temporald offset of a\nFIG. 2. Dependence of alpha on stripe width sad and on injection current\nfsbd and scdg for a stripe width of 6 mm sbd and 50 mm scd. Stars and\ndiamonds in scd represent homogeneous and inhomogeneous dots,\nrespectively.\nFIG. 3. Snapshots of intensity sad and alpha sbd during the propagation of a light pulse.\n203116-2 E. Gehrig and O. Hess Appl. Phys. Lett. 86, 203116 ~2005!\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\nstrongly depends on carrier inversion and the degree of satu-\nration. In strongly saturated amplifiers the spatial distribution\nof a may be significantly distorted while the propagating\npulse is significantly reshaped. Furthermore, in laser ampli-\nfiers with large stripe widths a may show a strong transverse\ndependence. Characteristic of the ultrashort regime, Fig. 4\nshows the spatially averaged a in dependence on time during\nthe passage of a 150 fs light pulse in a QDL amplifier sstripe\nwidth 50 mmd with sad a spatially inhomogeneous and sbd a\nhomogeneous ensemble of QD. The figures on the right vi-\nsualize the respective spatially resolved dynamics of a at the\noutput facet. In the spatially inhomogeneous dot system, the\nlight pulse induces a highly nonequilibrium situation in the\ncharge carrier system. It is the dynamic interplay of counter-\npropagating light fields and spatially dependent dipole dy-\nnamics that leads to the dynamic spatial phase pattern in the\nactive area. As a consequence, the nonequilibrium dynamics\ninduced by the light pulse may lead to a long-lived excitation\nfFig. 4sbdg. In the homogeneous dot ensemble fFig. 4sadg, the\noverall relaxation of induced gain and index is faster leading\nto a characteristic rise and descrease in a.\nIn conclusion, we have presented numerical results on\nthe spatiotemporal dynamics of the a-factor in QDLs. The\nexplicit inclusion of the spatially varying carrier distributions\nand the complex intradot dipole dynamics in the QD\nMaxwell–Bloch equations provides a fundamental descrip-\ntion of the underlying physical processes and guarantees a\nrealistic modeling of the laser-internal amplitude phase cou-\npling. In particular, the simulations allow the systematic\nvariation of the individual parameters and properties with\nrespect to their influence on a. Our spatiotemporally re-\nsolved calculations not only predict the average a factor but\nalso reveal the correlation between spatiotemporal light-field\nand carrier dynamics and the complex dynamics of the am-\nplitude phase coupling. The results obtained on this basis\nclearly demonstrate that—in spite of the small spatiotempo-\nral average—the a factor in QDLs shows a complex spatial\nand temporal dynamics. Although a measured a parameter\nsor the average of a calculationd may be appropriate for a\nfirst evaluation of the optical properties of a QDL device, one\nhas to be aware that the laser-internal amplitude phase cou-\npling is a strongly varying physical quantity affected by\ncomplex light-matter interactions and carrier dynamics.\nSupport by the European project DOTCOM sIST-2000-\n28713d is gratefully acknowledged.\n1C. H. Henry, IEEE J. Quantum Electron. 18, 259 s1982d.\n2M. Osinski and J. Buus, IEEE J. Quantum Electron. 23, 9 s1987d.\n3S. Ghosh, S. Pradhan, and P. Bhattacharya, Appl. Phys. Lett. 81, 3055\ns2002d.\n4A. A. Ukhanov, A. Stintz, P. G. Eliseev, and K. J. Malloy, Appl. Phys.\nLett. 84, 1058 s2004d.\n5S. Schneider, P. Borri, W. Langbein, U. Woggon, R. L. Sellin, D. Ouyang,\nand D. Bimberg, IEEE J. Quantum Electron. 40, 1423 s2004d.\n6E. Gehrig and O. Hess, Phys. Rev. A 65, 033804 s2002d.\n7E. Gehrig, O. Hess, C. Ribbat, R. L. Sellin, and D. Bimberg, Appl. Phys.\nLett. 84, 1650 s2004d.\n8P. M. Smowton, E. J. Pearce, H. C. Scheider, W. W. Chow, and M. Hop-\nkinson, Appl. Phys. Lett. 81, 3251 s2002d.\nFIG. 4. Dynamics of alpha during the propagation of a light pulse.\n203116-3 E. Gehrig and O. Hess Appl. Phys. Lett. 86, 203116 ~2005!\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}