{"doi":"10.1209\/epl","coreId":"100699","oai":"oai:epubs.surrey.ac.uk:94","identifiers":["oai:epubs.surrey.ac.uk:94","10.1209\/epl"],"title":"A model for the accidental catalysis of protein unfolding in vivo","authors":["Sear, RP"],"enrichments":{"references":[{"id":662935,"title":"79;","authors":[],"date":"1980","doi":"10.1103\/PhysRevLett.79.4296","raw":null,"cites":null},{"id":663520,"title":"Critical Phenomena in Natural Sciences (Springer-Verlag,","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":662286,"title":"Proteins: Structures and Molecular Properties (Freeman,","authors":[],"date":"1993","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-09-21","abstract":"<p>Activated processes such as protein unfolding are highly sensitive to heterogeneity in the environment. We study a highly simplified model of a protein in a random heterogeneous environment, a model of the in vivo environment. It is found that if the heterogeneity is sufficiently large, the total rate of the process is essentially a random variable; this may be the cause of the species-to-species variability in the rate of prion protein conversion found by Deleault et al.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:94<\/identifier><datestamp>\n      2017-10-31T13:56:44Z<\/datestamp><setSpec>\n      7374617475733D756E707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/94\/<\/dc:relation><dc:title>\n        A model for the accidental catalysis of protein unfolding in vivo<\/dc:title><dc:creator>\n        Sear, RP<\/dc:creator><dc:description>\n        <p>Activated processes such as protein unfolding are highly sensitive to heterogeneity in the environment. We study a highly simplified model of a protein in a random heterogeneous environment, a model of the in vivo environment. It is found that if the heterogeneity is sufficiently large, the total rate of the process is essentially a random variable; this may be the cause of the species-to-species variability in the rate of prion protein conversion found by Deleault et al.<\/p><\/dc:description><dc:date>\n        2004-09-21<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/94\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Sear, RP  (2004) A model for the accidental catalysis of protein unfolding in vivo   EPL (Europhysics Letters).      (Unpublished)  <\/dc:identifier><dc:relation>\n        10.1209\/epl\/i2004-10249-7<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/94\/","10.1209\/epl\/i2004-10249-7"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Europhys. Lett., 68 (4), pp. 589–595 (2004)\nDOI: 10.1209\/epl\/i2004-10249-7\nEUROPHYSICS LETTERS 15 November 2004\nA model for the accidental catalysis\nof protein unfolding in vivo\nR. P. Sear(∗)\nDepartment of Physics, University of Surrey - Guildford, Surrey GU2 7XH, UK\nreceived 13 May 2004; accepted in ﬁnal form 28 September 2004\npublished online 20 October 2004\nPACS. 87.15.Nn – Properties of solutions; aggregation and crystallization of macromolecules.\nPACS. 87.14.Ee – Proteins.\nPACS. 87.15.He – Dynamics and conformational changes.\nAbstract. – Activated processes such as protein unfolding are highly sensitive to heterogeneity\nin the environment. We study a highly simpliﬁed model of a protein in a random heterogeneous\nenvironment, a model of the in vivo environment. It is found that if the heterogeneity is\nsuﬃciently large, the total rate of the process is essentially a random variable; this may be\nthe cause of the species-to-species variability in the rate of prion protein conversion found by\nDeleault et al. (Nature, 425 (2003) 717).\nProtein unfolding is implicated in a number of diseases including prion diseases such as\nCreutzfeldt-Jakob disease [1–3]. It is an activated process, a free-energy barrier must be over-\ncome for a protein to unfold from its native state. At the top of the barrier the protein is in the\ntransition state for unfolding, and the transition state’s free energy determines the rate [4,5].\nAs the rate depends exponentially on the free energy, the rate is very sensitive to interactions\nof other molecules from the environment with the transition state. Inside living cells there is\na mixture of thousands of diﬀerent proteins, RNA, etc.; if any of them can interact with the\ntransition state of unfolding such that its free energy is only a few kBT lower, then the rate of\nprion protein conversion when interacting with this other molecule will be increased by an or-\nder of magnitude. Supattapone and coworkers [6] studied prion conversion in cell extracts and\nfound that the rate of prion protein conversion was greatly accelerated by an RNA molecule\nor molecules, and that surprisingly this acceleration was speciﬁc to the RNA of only some\nspecies. Here we look at a very simple model of unfolding in vivo, and examine how the rate\nof unfolding is aﬀected by the protein being in a complex mixture of many other molecules.\nCharacterising the interactions of thousands of diﬀerent molecules with the transition state is\na hopeless task and so we resort to a statistical approach [7,8]. We take the interactions to be\nrandom variables. This reduces the problem from characterising a huge number of interactions\nto just characterising the distribution function of these random variables. By taking all the\ninteractions to be random variables we are ignoring the fact that natural selection may be\nacting to restrict or increase the strength of some of the interactions, and so our model will be\na poor one if the RNA accelerating the rate of prion protein conversion has evolved to interact\n(∗) E-mail: r.sear@surrey.ac.uk\nc© EDP Sciences\n590 EUROPHYSICS LETTERS\nstrongly with the prion protein. Very little is deﬁnitely known about the function of the prion\nprotein [2, 3] and so we cannot rule out this possibility. We ﬁnd that if the free energies of\ninteraction with the transition state are spread over a wide range, unfolding occurs predom-\ninantly with the transition state in contact with one or a few of the other molecules present.\nThese molecules are the ones responsible for the outliers of the distribution of interactions\nwith the transition state, they are the ones that interact most strongly with the transition\nstate. If we take these outliers to be RNA molecules, then the predictions of our model are\nconsistent with the experimental ﬁndings of Supattapone and coworkers [6]. When one or a\nfew outliers dominate the rate, it may vary signiﬁcantly from species to species simply due to\nchance species-to-species variations in the nucleotide or amino-acid sequences of these outliers.\nSupattapone and coworkers [6] have shown that the conversion of a prion protein from the\nPrPC form to the PrPres form is greatly accelerated by a speciﬁc RNA molecule or by a small\nset of such molecules. The PrPC form is the normal form while the PrPres form is analogous\nto the form associated with disease. The PrPres form is so-called because it is Protease RESis-\ntant, i.e., not destroyed by the proteases that cut the chains of normal proteins. The two forms\nof the protein have the same amino-acid sequence, they diﬀer only in conformation. The inter-\nconversion is known to be accelerated by PrPres itself but Supattapone and coworkers showed\nthat a speciﬁc fraction of RNA molecules from both hamsters and mice but not the same frac-\ntion from invertebrates, also appeared to accelerate the conversion of the same protein. Of\ncourse, in terms of the prion diseases in diﬀerent species the prion protein itself will vary from\nspecies to species and this will cause variability. Here we are considering variability not in the\nprion protein itself but in a cofactor that interacts with the prion protein. There is other ex-\nperimental data on possible cofactors aﬀecting the rate of prion protein conversion. Cordeiro\net al. [9] suggest, on the basis of experimental evidence, that DNA reduces the free-energy\nbarrier to the conversion of a prion protein into the form associated with the disease. Other\nwork on prions has implicated as a cofactor not RNA but a protein-dubbed protein X [10].\nThere is considerable uncertainty surrounding the mechanism behind prion diseases [2]. See\nthe reviews of Harris [2] and of Aguzzi and Polymenidou [3] for an introduction to prions.\nWe assume the unfolding of a protein to be a simple activated process [4, 5], its rate\nhaving an exponential dependence on the barrier to unfolding, ∆F ∗: the diﬀerence in free\nenergy between the folded protein and the transition state. The transition state being, by\ndeﬁnition, the state of the protein along the unfolding pathway that has the highest free\nenergy. Our model of the transition state for unfolding is a linear polymer on a simple\ncubic lattice, nM monomers long. Inside a living cell, there are the surfaces of proteins, of\nmembranes, of DNA etc. For simplicity, we lump all these surfaces together into a large ﬂat\nsurface which we model by a plane of lattice sites. A transition state in contact with a part\nof this surface is shown in ﬁg. 1. The monomers of the transition state and of the surface are\neither hydrophilic or hydrophobic. We take B of the monomers of the transition state to be\nhydrophobic. We assume that unfolding proceeds by some part of the protein, nM monomers\nlong, unfolding, its free energy increasing as it does so until the free energy reaches a maximum\nat the transition state [11]. This transition state can contact the surface, as seen in ﬁg. 1, and\nfor each hydrophobic monomer of the transition state in contact with a hydrophobic monomer\nof the surface there is a contribution of −\u0006 to the free energy of the transition state. The only\nenergy of interaction is between hydrophobic monomers.\nThe surfaces are those of proteins, RNA, etc. and so are coded for by the genome of the\norganism. Thus they will diﬀer between one species and another. We have no means of cal-\nculating them from the genome of an organism and so resort to modelling the surface with\na purely random distribution of hydrophobic and hydrophilic monomers. Each monomer is\nhydrophobic with probability h and hydrophilic with probability 1 − h. This is in the spirit\nR. P. Sear: Accidental catalysis of unfolding 591\nFig. 1 – Schematic representation of our starting model for the transition state in contact with a\npatch of surface. The surface is assumed planar for simplicity. Hydrophobic monomers are shown\nas the dark cubes, and hydrophilic monomers are the light cubes. The transition state is the set of\nnM = 7 contiguous monomers, B = 5 of which are hydrophobic, on top of the surface.\npioneered by Wigner and others [7] in random matrix theory, see ref. [8] for an application to\nprotein mixtures. The surface provides Ns diﬀerent positions and conﬁgurations of the tran-\nsition state in which the transition state can interact with the surface, we call these unfolding\nconﬁgurations. We neglect any correlations between the interaction energy at diﬀerent un-\nfolding conﬁgurations on the surface and assume that the Ns conﬁgurations are independent.\nThen, if we denote the free energy of the transition state when it is not interacting with any\nother monomers by ∆F ∗0 , the rate of unfolding at conﬁguration i, Ri, is\nRi = ν exp [−∆F ∗0 + ni\u0006] , (1)\nwhere ni is the number of hydrophobic monomers of the transition state that are adjacent to\nhydrophobic parts of the surface. Thus, the surfaces present are speciﬁed by the set of Ns\nvalues of the random variables ni. Note that we have assumed that the attempt frequency ν\nis the same for all unfolding conﬁgurations, only the free-energy barrier varies. We use units\nsuch that the thermal energy kBT = 1.\nThe rate of unfolding averaged over all Ns possible conﬁgurations is\nR = N−1s\nNs∑\ni=1\nRi . (2)\nAlthough we have used the speciﬁc example of protein unfolding, quite generally the rates\nof activated process are given by equations with the form of eq. (1) and so our theory will\napply quite generally to activated processes in vivo. Equations similar to eqs. (1) and (2) were\nemployed by Karpov and Oxtoby [14] to study nucleation, an activated process like unfolding,\nin the presence of random static disorder. The author has also applied the approach used\nhere to nucleation [15], and this reference may be consulted for more details of the analysis\nperformed below. The analysis required for nucleation is very similar to that required for our\nmodel of unfolding.\nDiﬀerent organisms have diﬀerent genomes and so diﬀerent sets of proteins, etc., inside their\ncells. Supattapone and coworkers [6] found that RNA molecules from mammals accelerated\nthe protein conformational conversion whereas RNA from invertebrates did not. Thus, we\n592 EUROPHYSICS LETTERS\nwould like to model and try to understand species-to-species variability. To do so, we simply\nassume that the surfaces in diﬀerent species are uncorrelated, then two species are modelled\nby two uncorrelated realisations of the surface. Of course, the surfaces present in closely\nrelated species in particular will be correlated due to their similar genomes, but we will leave\nthe introduction of such correlations to future work.\nContinuing, as only hydrophobic monomers interact, ni is a sum of B independent random\nvariables that are 1 with probability h and 0 with probability 1 − h. So, the probability\ndistribution function of ni, p(ni), is\np(ni) =\nB!\nni!(B − ni)!h\nni(1− h)B−ni \u0002 exp\n[−(ni −m)2\/(2w2)]\n(2πw2)1\/2\n, (3)\nwhere we have indicated that p(ni) is approximately a Gaussian for large B and ni. m = Bh\nis the mean, and the variance w2 = Bh(1 − h). From now on we will neglect any deviations\nfrom the simple Gaussian distribution function of eq. (3) and the discrete nature of ni and\nuse this equation for p(ni).\nHaving chosen to model diﬀerent species by uncorrelated realisations, we will examine\nﬂuctuations of the rate R between diﬀerent realisations. We assume this variation between\nrealisations is a reasonable model for variations between species. Returning to eq. (2) for the\nrate, using eq. (1) we obtain\nR = N−1s ν exp [−∆F ∗0 ]\nNs∑\ni\nexp [ni\u0006] , (4)\nwhere the ni are taken to be random variables drawn from the Gaussian distribution eq. (3).\nExcept for constant factors, the rate R is equivalent to the partition function of the Random\nEnergy Model (REM) of Derrida [16, 17]. The REM is a simple and well-studied model of\nglasses and other disordered systems.\nJust as the average partition function of the REM can be obtained, we can obtain the\naverage of the rate R,\n〈R〉 = N−1s ν exp [−∆F ∗0 ]\n〈\nNs∑\ni=1\nexp [ni\u0006]\n〉\n(5)\n= ν exp [−∆F ∗0 ] exp\n[\nm\u0006+ \u00062w2\/2\n]\n. (6)\nThis is the average of R over many diﬀerent realisations of the surface, i.e., many diﬀerent\nsets of the Ns random variables ni that deﬁne a surface. As R is a sum over random variables,\nit itself is a random variable. For the large values of Ns considered here, the rate R is either\nself-averaging or non–self-averaging. It is self-averaging if for almost all realisations the rate\nof unfolding R is close to 〈R〉, i.e., if R is almost the same for almost all realisations. Then\nthe right-hand side of eq. (5) will be a good approximation to the rate R of any realisation.\nIf it is non–self-averaging, then the rate R diﬀers appreciably from one realisation to another,\nthe values of R have a large spread and eq. (5) is unlikely to provide a good approximation to\nthe value of R for a randomly selected realisation. R is non–self-averaging if and only if the\nsum of eq. (4) is dominated by one or a few terms: the variation comes from variation in the\nvalues of the largest terms in the sum. This is just as in the REM, see ref. [16] for details.\nRecall that we are assuming that a realisation corresponds to a species. Thus, if R is\nself-averaging, then our model predicts that the rate of unfolding of a particular protein is\nalmost the same in all or almost all species, whereas if it is not self-averaging then the rate of\nunfolding of a speciﬁc protein will vary signiﬁcantly from one species to another.\nR. P. Sear: Accidental catalysis of unfolding 593\nWe will now determine the boundary where the rate R crosses over from self-averaging to\nnon–self-averaging. From eq. (4) we see that the rate R is dominated by unfolding conﬁgura-\ntions with values of ni where the product of the number of conﬁgurations and exp[ni\u0006], is a\nmaximum. The number of conﬁgurations is simply proportional to the probability of eq. (3).\nThe maximum of the product p(ni) exp[ni\u0006] is at nmax = m+ \u0006w2. Now, the average number\nof conﬁgurations around this value of ni is just Nsp(nmax), and because this average is a sum\nover independent random variables (the ni) the ratio of the ﬂuctuations to the mean scales as\n[Nsp(nmax)]−1\/2. Thus the ﬂuctuations in the number of conﬁgurations that contribute the\ndominant amount to the rate, and hence the ﬂuctuations in the rate itself are small relative\nto the mean if and only if Nsp(nmax)\u0005 1. This is true whenever 2 lnNs − \u00062w2 > 0.\nThus, the boundary between self-averaging and non–self-averaging regimes is given by the\nequation\n2 lnNs − \u00062w2 = 0. (7)\nNote that \u00062w2 is the variance of the distribution of interaction energies between the transition\nstate and the surface. Thus the rate is self-averaging if and only if the logarithm of the\nnumber of possible conﬁgurations that the transition state can unfold in, is larger than half\nthe variance of the interaction energy. This is the main result of this work. It is a very general\nresult —it applies generally to activated processes in a random or near-random environment.\nOur conclusions here apply to any process with a rate given by an equation of the form of\neq. (2), not just to protein unfolding in vivo. See ref. [15] for an application to nucleation at\nﬁrst-order phase transitions.\nIn the non–self-averaging regime, a single unfolding conﬁguration can be responsible for a\nsigniﬁcant fraction of the entire rate of unfolding at the surface. This conﬁguration must of\ncourse be the conﬁguration with the largest value of ni. We denote this largest value by x. If\nwe deﬁne the probability distribution function, pev(x), of x, then the fraction of the rate R\nthat is due to this extreme value is\nfev =\nν exp [−∆F ∗0 ]\nNs〈R〉\n∫\npev(x) exp [\u0006x] dx. (8)\nWe can simplify eq. (8) by introducing the reduced variable y = (x − m)\/w. Then, from\neq. (8) and using eq. (5) for 〈R〉, we obtain\nfev = N−1s exp\n[−(\u0006w)2\/2] ∫ dy exp [\u0006wy] pev(y), (9)\nwhere pev(y) is the probability distribution function for the maximum value of a set of Ns\nvalues taken from a Gaussian of zero mean and unit standard deviation. Note that although\nthe absolute value of the rate R and of the contribution of the extreme value both depend on\nthe mean m, fev does not. It depends only on the product \u0006w, and on Ns.\nThe determination of pev(y) is a standard problem in extreme-value statistics [18]. We start\nfrom the fact that the probability that the largest of Ns values is y is the probability that 1 of\nthe Ns conﬁgurations has a value y, and all the remaining Ns − 1 conﬁgurations have smaller\nvalues, multiplied by Ns, as any one of the Ns conﬁgurations can have the largest value. Thus,\npev(y) = Nsp(y)pNs−1< (y), (10)\nwhere p(y) is a normalised Gaussian of zero mean and unit standard deviation, and p<(y)\n(p>(y)) is the probability of obtaining a number less (greater) than y from a Gaussian of zero\nmean and unit standard deviation. We are interested in the region where x is several standard\n594 EUROPHYSICS LETTERS\n1 2 3 4 5 6\nw\n0\n0.2\n0.4\n0.6\n0.8\n1\nf e\nv\nε\nFig. 2 – The mean fraction, fev, of the rate R that is due to the conﬁguration with the largest ni, as\na function of the product of the width of the Gaussian, w, and the interaction energy \u0006. The solid,\ndashed and dotted curves are for Ns = 1000, 10000 and 100000 conﬁgurations, respectively.\ndeviations above the mean, y \u0005 1. Now, p< = 1− p>, and so for y \u0005 1, p> \u0006 1, and we can\nrewrite eq. (10) as\npev(y) \u0002 Nsp(y) exp [−Nsp>(y)] . (11)\nAlso, p>(y) = (1\/2) erfc(y\/21\/2), which for y \u0005 1 simpliﬁes to p>(y) \u0002 exp[−y2]\/[(2π)1\/2y].\nIn ﬁg. 2 we have plotted the fraction of the rate due to the conﬁguration with the largest\ninteraction energy, and so the lowest barrier, fev, as a function of \u0006w. We took Ns = 1000,\n10000 and 100000. Assuming that there are a few thousand diﬀerent species inside a cell\nand that each can potentially interact with the transition state in a few ways, we end up\nwith the estimate Ns ≈ 104. The other parameter is \u0006w. The interaction strength of a pair of\nmonomers is expected to lie in the range 1 to 3 (recall that \u0006 is in units of kBT ). If the fraction\nof hydrophobic monomers h ≈ 1\/2, then for B ≈ 5 to 15 hydrophobic monomers, we have\nthat w ≈ 1 to 2. Combining these values for \u0006 and w, we have that \u0006w ≈ 0.5 to 6. Returning\nto ﬁg. 2, we see that as \u0006w increases, so does fev. For Ns = 10000, eq. (7) is satisﬁed for\n\u0006w = 4.29. For \u0006w around this value, the conﬁguration with the largest interaction energy\nalready contributes a large amount to the total rate, on average. This large contribution will\nvary signiﬁcantly from one realisation to the next, from one species to the next. So, the rate\nof unfolding of the protein will vary signiﬁcantly from one species to the next, depending\non whether the species has some part of a protein, RNA molecule, etc., that binds to the\ntransition state unusually strongly. Our estimate for the possible values of \u0006w in vivo goes\nup to around 6, so we estimate that the variation in the interaction free energies with a\ntransition state may be large enough to cause random species-to-species variation. The RNA\nmolecule or molecules found to catalyse the conversion is within our model the origin of one\nof the conﬁgurations that are outliers of the distribution, that interact most strongly with the\ntransition state. Of course, if \u0006w is small then the rate R has signiﬁcant contributions from\nmany unfolding conﬁgurations and so varies weakly from species to species, essentially due to\nvariations in the rate being averaged out in accordance with the central-limit theorem.\nIn conclusion, Supattapone and coworkers [6] have found that cell extracts of some species\nbut not others accelerate the conversion of the prion protein to a protease-resistant form. This\nconformational change must involve partial unfolding. Protein unfolding in vivo or in a cell\nextract occurs in a very complex and heterogeneous environment. There are a huge number\nof species present that potentially could interact with and stabilise the transition state of\nunfolding. A single strongly stabilising interaction could dramatically increase the rate of\nR. P. Sear: Accidental catalysis of unfolding 595\nunfolding. Here we have suggested a possible model for the species-to-species variation in the\nability of cell extracts to accelerate prion protein conversion [6]. The model is a statistical one:\ninteractions are modelled by random variables and diﬀerent species by diﬀerent uncorrelated\nrealisations of the random interactions. We suggest that the acceleration is due to a strong\ninteraction of the transition state for prion protein conversion with one or a few species of\nRNA molecules, and that this interaction is strong simply by chance. It is simply accidental\nthat they reduce the free-energy barrier to unfolding. Proving this suggestion would require\nidentifying the RNA molecule or molecules that interact with the prion protein and then\ndemonstrating that there is no functional relationship between the protein and the RNA.\nFalsifying the suggestion is perhaps more straightforward, it only requires ﬁnding a functional\nrelationship. The species-to-species variation then simply comes from the variation in the\nnucleotide sequences of RNA molecules from species to species. The RNA molecules that\nperform the same function in, say, mice and fruit ﬂies, will have similar but not identical\nnucleotide sequences and so will have diﬀerent interaction free energies with the transition\nstate. Finally, it should be noted that it is also possible that the RNA molecule or molecules\nhave evolved to interact with the prion protein, although we know of no evidence that they\nare under selection pressure to interact speciﬁcally with the transition state.\n∗ ∗ ∗\nIt is a pleasure to acknowledge that this work has beneﬁted greatly from discussions with\nJ. Cuesta. This work was supported by The Wellcome Trust (069242).\nREFERENCES\n[1] Dobson C. M., Philos. Trans. R. Soc. B, 356 (2001) 133.\n[2] Harris D. A., Clin. Micro. Rev., 12 (1999) 429.\n[3] Aguzzi A. and Polymenidou M., Cell, 116 (2004) 313.\n[4] Finkelstein A. V. and Ptitsyn O. G., Protein Physics (Academic Press, London) 2002.\n[5] Creighton T. E., Proteins: Structures and Molecular Properties (Freeman, New York) 1993.\n[6] Deleault N. R., Lucassen R. W. and Supattapone S., Nature, 425 (2003) 717.\n[7] Wigner E., SIAM Rev., 9 (1967) 1.\n[8] Sear R. P. and Cuesta J. A., Phys. Rev. Lett., 91 (2003) 245701.\n[9] Cordeiro Y., Machado F., Juliano L., Aparecida Juliano M., Brentani R. R., Foguel\nD. and Silva J. L., J. Biol. Chem., 276 (2001) 49400.\n[10] Ryou C., Prusiner S. B. and Legname G., J. Mol. Biol., 329 (2003) 323.\n[11] Even in vitro protein unfolding is in general more complex than a simple crossing of a single\nbarrier [4,12,13]. Also, it is far from clear that protein unfolding is the rate-limiting step in the\nprogression of the formation of the protein ﬁbrils in prion diseases. Here we simply assume that\nit is a simple activated process and explore the consequences.\n[12] Onuchic J. N., Luthey-Schulten Z. and Wolynes P. G., Annu. Rev. Phys. Chem., 48\n(1997) 545.\n[13] Pande V. S., Grosberg A. Yu. and Tanaka T., Rev. Mod. Phys., 72 (2000) 259.\n[14] Karpov V. G. and Oxtoby D. W., Phys. Rev. B, 54 (1996) 9734.\n[15] Sear R. P., Phys. Rev. E, 70 (2004) 021605, cond-mat\/0406019.\n[16] Derrida B., Phys. Rev. Lett., 45 (1980) 79; Phys. Rev. B, 24 (1981) 2613.\n[17] The REM is used extensively in the study of protein folding, see, for example, refs. [12, 13].\nBut our use of the REM is rather diﬀerent, the random variables here are interaction energies\nbetween the transition state and the surface, whereas in studies of protein folding they are the\nstates of an isolated protein.\n[18] Sornette D., Critical Phenomena in Natural Sciences (Springer-Verlag, Berlin) 2000.\n"}