{"doi":"10.1016\/j.earscirev.2009.02.003","coreId":"138802","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3548","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3548","10.1016\/j.earscirev.2009.02.003"],"title":"Tolerable versus actual soil erosion rates in Europe","authors":["Verheijen, Frank G. A.","Jones, Robert J. A.","Rickson, R. J.","Smith, C. J."],"enrichments":{"references":[{"id":38095281,"title":"Australia (Victoria), Zimbabwe na 0.02 1.27 Alexander (1988a) Mass balance","authors":[],"date":"1992","doi":null,"raw":"Mass balance (Si) Non-carbonate; non-arable; North America, Europe, Australia (Victoria), Zimbabwe na 0.02 1.27 Alexander (1988a) Mass balance (Al, Fe, Ca, K, Mg, Na, Si) Global 0.37 1.29 Wakatsuki and Rasyidin (1992) In situ cosmogenic 10Be and 26Al Northern California na 0.39 0.91 Heimsath et al. (1997) In situ cosmogenic 10Be Middle European rivers 10-40 Kyr 0.26 1.3 (Schaller et al. (2001) Continental scale erosion\/sedimentation Global 542 Myr 0.4 1.4 Wilkinson and McElroy (2007) Na USA na 0.3 1.1 Bennett (1939)","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-05","abstract":"Erosion is a major threat to soil resources in Europe, and may impair their ability to deliver a range of ecosystem goods and services. This is reflected by the European Commission's Thematic Strategy for Soil Protection, which recommends an indicator-based approach for monitoring soil erosion. Defined baseline and threshold values are essential for the evaluation of soil monitoring data. Therefore, accurate spatial data on both soil loss and soil genesis are required, especially in the light of predicted changes in climate patterns, notably frequency, seasonal distribution and intensity of precipitation. Rates of soil loss are reported that have been measured, modelled or inferred for most types of soil erosion in a variety of landscapes, by studies across the spectrum of the Earth sciences. Natural rates of soil formation can be used as a basis for setting tolerable soil erosion rates, with soil formation consisting of mineral weathering as well as dust deposition. This paper reviews the concept of tolerable soil erosion and summarises current knowledge on rates of soil formation, which are then compared to rates of soil erosion by known erosion types, for assessment of soil erosion monitoring at the European scale","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138802.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.earscirev.2009.02.003","pdfHashValue":"0d5dcb4261f1fb8c27ff64d08baba0ac02437a5c","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3548<\/identifier><datestamp>2017-03-22T13:05:13Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Tolerable versus actual soil erosion rates in Europe<\/dc:title><dc:creator>Verheijen, Frank G. A.<\/dc:creator><dc:creator>Jones, Robert J. A.<\/dc:creator><dc:creator>Rickson, R. J.<\/dc:creator><dc:creator>Smith, C. J.<\/dc:creator><dc:subject>erosion tolerance<\/dc:subject><dc:subject>soil formation<\/dc:subject><dc:subject>climate change<\/dc:subject><dc:subject>soil protection<\/dc:subject><dc:subject>monitoring<\/dc:subject><dc:subject>dust deposition<\/dc:subject><dc:description>Erosion is a major threat to soil resources in Europe, and may impair their ability to deliver a range of ecosystem goods and services. This is reflected by the European Commission's Thematic Strategy for Soil Protection, which recommends an indicator-based approach for monitoring soil erosion. Defined baseline and threshold values are essential for the evaluation of soil monitoring data. Therefore, accurate spatial data on both soil loss and soil genesis are required, especially in the light of predicted changes in climate patterns, notably frequency, seasonal distribution and intensity of precipitation. Rates of soil loss are reported that have been measured, modelled or inferred for most types of soil erosion in a variety of landscapes, by studies across the spectrum of the Earth sciences. Natural rates of soil formation can be used as a basis for setting tolerable soil erosion rates, with soil formation consisting of mineral weathering as well as dust deposition. This paper reviews the concept of tolerable soil erosion and summarises current knowledge on rates of soil formation, which are then compared to rates of soil erosion by known erosion types, for assessment of soil erosion monitoring at the European scale.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2009-08-06T10:47:34Z<\/dc:date><dc:date>2009-08-06T10:47:34Z<\/dc:date><dc:date>2009-05<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>F.G.A. Verheijen, R.J.A. Jones, R.J. Rickson, C.J. Smith, Tolerable versus actual soil erosion rates in Europe, Earth-Science Reviews, Volume 94, Issues 1-4, May 2009, Pages 23-38<\/dc:identifier><dc:identifier>0012-8252<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.earscirev.2009.02.003<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/3548<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0012-8252","0012-8252"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["erosion tolerance","soil formation","climate change","soil protection","monitoring","dust deposition"],"subject":["Article"],"fullText":"\u0000\u0002\u0002\u0003\u0004\u0005\u0003\u0006 \u0007\b\t\n\u000b\u0002\f\r\u0004\u0005\nTolerable versus actual soil erosion rates in Europe\nF.G.A. Verheijen, R.J.A. Jones, R.J. Rickson, C.J. Smith\nPII: S0012-8252(09)00035-X\nDOI: doi: 10.1016\/j.earscirev.2009.02.003\nReference: EARTH 1558\nTo appear in: Earth Science Reviews\nReceived date: 13 March 2008\nAccepted date: 19 February 2009\nPlease cite this article as: Verheijen, F.G.A., Jones, R.J.A., Rickson, R.J., Smith, C.J.,\nTolerable versus actual soil erosion rates in Europe, Earth Science Reviews (2009), doi:\n10.1016\/j.earscirev.2009.02.003\nThis is a PDF file of an unedited manuscript that has been accepted for publication.\nAs a service to our customers we are providing this early version of the manuscript.\nThe manuscript will undergo copyediting, typesetting, and review of the resulting proof\nbefore it is published in its final form. Please note that during the production process\nerrors may be discovered which could affect the content, and all legal disclaimers that\napply to the journal pertain.\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n1\nTolerable versus actual soil erosion rates in Europe1\n2\nF.G.A. Verheijena,b,, R.J.A. Jonesb, R.J. Ricksonb and C.J. Smithb3\n4\na European Commission, Joint Research Centre, Institute for Environment and Sustainability, Via E. 5\nFermi, 2749 (TP280), I-21027 Ispra (Va), Italy. Tel: +39-0332-785535 \/ Fax: +39-0332-786394. 6\n* Corresponding author; formerly at ‘b’; frankverheijen@gmail.com.7\nb National Soil Resources Institute, Natural Resources Department, Cranfield University, Cranfield, 8\nMK43 0AL, UK. r.jones@cranfield.ac.uk; j.rickson@cranfield.ac.uk; c.j.smith@cranfield.ac.uk.9\n10\n11\nAbstract12\nErosion is a major threat to soil resources in Europe, and may impair their ability to 13\ndeliver a range of ecosystem goods and services. This is reflected by the European 14\nCommission’s Thematic Strategy for Soil Protection, which recommends an 15\nindicator-based approach for monitoring soil erosion. Defined baseline and threshold16\nvalues are essential for the evaluation of soil monitoring data. Therefore, accurate17\nspatial data on both soil loss and soil genesis are required, especially in the light of 18\npredicted changes in climate patterns, notably frequency, seasonal distribution and19\nintensity of precipitation. Rates of soil loss are reported that have been measured,20\nmodelled or inferred for most types of soil erosion in a variety of landscapes, by 21\nstudies across the spectrum of the Earth sciences. Natural rates of soil formation can 22\nbe used as a basis for setting tolerable soil erosion rates, with soil formation consisting 23\nof mineral weathering as well as dust deposition. This paper reviews the concept of 24\n                                                \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n2\ntolerable soil erosion and summarizes current knowledge on rates of soil formation, 25\nwhich are then compared to rates of soil erosion by known erosion types, for 26\nassessment of soil erosion monitoring at the European scale.27\n28\nA modified definition of tolerable soil erosion is proposed as ‘any actual soil erosion 29\nrate at which a deterioration or loss of one or more soil functions does not occur’,30\nactual soil erosion being ‘the total amount of soil lost by all recognised erosion types’. 31\nEven when including dust deposition in soil formation rates, the upper limit of 32\ntolerable soil erosion, as equal to soil formation, is ca. 1.4 t ha-1 yr-1 while the lower 33\nlimit is ca. 0.3 t ha-1 yr-1, for conditions prevalent in Europe. Scope for spatio-34\ntemporal differentiation of tolerable soil erosion rates below this upper limit is 35\nsuggested by considering (components of) relevant soil functions. Reported rates of 36\nactual soil erosion vary much more than those for soil formation. Actual soil erosion 37\nrates for tilled, arable land in Europe are, on average, 3 to 40 times greater than the38\nupper limit of tolerable soil erosion, accepting substantial spatio-temporal variation. 39\nThis paper comprehensively reviews tolerable and actual soil erosion in Europe and 40\nhighlights the scientific areas where more research is needed for successful 41\nimplementation of an effective European soil monitoring system.42\n43\nKey words: erosion tolerance; soil formation; climate change; soil protection; 44\nmonitoring; dust deposition45\n46\n47\n1. Introduction48\n1.1 General49\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n3\nSoil loss occurs mostly through physical pathways but can also occur as a result of50\nbiochemical processes, including weathering of mineral particles in soil, which is51\nknown as chemical denudation. Removal of particles or even small aggregates from 52\nthe in situ soil system then takes place in suspension or solution, as bed load or by 53\ngaseous export. Organic soil material is lost mainly through decomposition processes, 54\nexcept in the case of peat erosion where organic particles are removed and transported 55\nby water or wind. Physical pathways of soil loss predominate and fall within the 56\ndomain of soil erosion, which is defined as “the wearing away of the land surface by 57\nphysical forces such as rainfall, flowing water, wind, ice, temperature change, gravity 58\nor other natural or anthropogenic agents that abrade, detach and remove soil or 59\ngeological material from one point on the earth's surface to be deposited elsewhere” 60\n(Soil Science Society of America, 2001; Jones et al., 2006, p.24-5). With respect to 61\nsoil degradation, most concerns about erosion are related to ‘accelerated soil erosion’, 62\nwhere the natural (or ‘normal’, or ‘geological’) rate has been increased significantly 63\nby human activity.64\n65\nThe cause and extent of accelerated soil erosion are influenced by a number of factors 66\n(Morgan, 2005) and the most significant are:67\n soil erodibility or susceptibility to erosive forces, as determined by soil 68\nphysical, chemical and biological properties (Chepil, 1950: Bryan, 1968;69\nWischmeier and Mannering, 1969; Aspiras et al., 1971; Wischmeier et al., 70\n1971; Tisdall and Oades, 1982; Rauws and Govers, 1988; Forster, 1989; 71\nChenu, 1993; Oades, 1993; Marinissen, 1994; Edgerton et al., 1995; Le 72\nBissonnais, 1996; Degens, 1997; Ketterings et al., 1997 ; Kiem and Kandeler, 73\n1997; Hallett and Young, 1999; Czarnes et al., 2000; Doerr et al., 2000; 74\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n4\nScullion and Malik, 2000; Boix-Fayos et al., 2001; Ritz and Young, 2004; 75\nAllton, 2006; Shakesby and Doerr, 2006)76\n erosivity or energy of the eroding agent, e.g. rainfall, overland flow or wind 77\n(Wischmeier and Smith, 1958; Skidmore and Woodruff, 1968; Fournier, 1972; 78\nZachar, 1982; Morgan et al., 1986; Knighton, 1998)79\n slope characteristics, gradient, length and form (Zingg, 1940; Musgrave, 1947; 80\nKirkby, 1969; Horváth and Erödi, 1962; Chepil et al., 1964; Meyer et al., 81\n1975; D’Souza and Morgan, 1976; Wischmeier and Smith, 1978)82\n land cover use and management (Wischmeier and Smith, 1978; Wiersum, 83\n1979; De Ploey, 1981; Dissmeyer and Foster, 1981; Laflen and Colvin, 1981; 84\nFoster, 1982; Temple, 1982; Lang and McCaffrey, 1984; Armstrong and85\nMitchell, 1987; Quinton et al., 1997; Lal, 2001; Gyssels et al., 2005; Zhang et 86\nal., 2007)87\n88\nThis paper reviews the dominant causes and rates of soil loss that occur in Europe via 89\nthe process of detachment (e.g. water, wind, tillage, crop harvesting and land 90\nlevelling), and subsequent transport and deposition of the detached soil material. 91\nWhilst all pathways of soil loss need to be considered and monitored carefully, once 92\ndetachment of soil particles occurs, the functionality of the remaining soil is impaired 93\nto a greater or lesser extent depending on the amount of soil lost. Thus prevention of 94\nthe detachment phase of the erosion process (Meyer and Wischmeier, 1969) is crucial 95\nif the functionality of the soil system is to be safeguarded for future generations.96\n97\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n5\nThis review focuses on erosion of mineral soils in Europe, because this is the 98\ndominant type of soil loss on the continent (Boardman and Poesen, 2006). Mineral 99\nsoils are here defined as those that consist predominantly of, and have properties 100\nmainly determined by, mineral matter, and usually contain less than 20% organic 101\ncarbon (SSSA, 2001). Relatively recent research (Holden and Burt, 2002; McHugh et 102\nal., 2002; Holden, 2005) has shown that erosion processes also account for substantial 103\nlosses from organic soils, for example by piping and gullying in peatlands. However, 104\norganic soils are far less extensive than mineral soils in Europe (Montanarella et al., 105\n2006) and constitute a different eco-system; thus consideration of their erosion is not 106\nincluded in this paper.107\n108\n1.2 Scale109\nSoil erosion research has considered various spatial and temporal scales at which the 110\ndifferent erosion processes operate. The experience and knowledge gained from these111\nstudies is generated by, and serves, a very wide audience, ranging from developers of 112\nsub-process, physically based erosion models, such as EUROSEM (Morgan et al., 113\n1998) and WEPP (Nearing et al., 1989), through to regional planners and policy 114\nmakers. Ciesiolka and Rose (1998) observe that smaller scale studies tend to focus on 115\n‘on-site’ impacts of soil erosion, whilst larger spatial-scale studies concentrate on the 116\n‘off-site’ impacts. 117\n118\nTable 1119\n120\nThe temporal scale variation in erosion processes is implicit in Table 1, with small 121\nspatial scale processes such as raindrop impact occurring in fractions of seconds, and 122\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n6\ncatchment scale processes usually being monitored over much longer time scales (i.e. 123\nseasons, years, decades or even geological timescales). Sediment delivery ratios are 124\nalso time-dependent, ranging from effectively no sediment delivered at the exact 125\nmoment of detachment to sediment delivery ratios at the catchment scale approaching 126\n100% over geological timescales (van Rompaey et al., 2005).127\n128\nThe comparison of, and connectivity between different spatial and temporal scales is a 129\nmajor challenge in erosion research currently. This complex spatio-temporal process 130\nand the lag times involved, make it intrinsically difficult to compare directly a series 131\nof plot scale measurements with data generated for the whole catchment. The results 132\nof soil loss and sediment delivery obtained at one spatial scale cannot and should not 133\nbe extrapolated to another (Walling, 1990; de Vente and Poesen, 2005).134\n135\nSimple ‘scaling up or down’ of erosion rates is not possible (Pierson et al., 1994). 136\nAccording to van Noordwijk et al. (1998), there are no ‘scaling rules’ in erosion 137\nresearch. It appears that the mean value of erosion per unit area will change at 138\ndifferent spatial scales, all other factors being equal. At small spatial scales (e.g. 139\nindividual aggregate), better control of variables, ease of replication and understanding of 140\nerosion mechanisms can be gained, but such fragmenting or deconstructing of processes 141\nmay exclude many of the factors affecting the true rates of erosion (e.g. slope topography) as 142\nobserved at a larger spatial scale in the field. On small plots, the process of rainsplash 143\ndetachment (especially) and transport will dominate erosion rates, due to the limited 144\nslope lengths over which erosive overland flow can generate. It follows that certain 145\nerosion processes such as gully erosion or mass movements cannot be simulated at 146\nsmall spatial scales, but they may dominate at larger scales. As spatial scale 147\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n7\nincreases, overland flow becomes the dominant agent of erosion, but different 148\nexperimental conditions have shown rates of erosion per unit area to both increase 149\nand decrease with increasing slope length (Zingg, 1940; Meyer et al., 1975; 150\nAbrahams et al., 1991; Smith and Quinton, 2000). Morgan (2005) states “with such a 151\ngreat range of possible conditions, a single relationship between soil loss and slope 152\nlength cannot exist”. Also, plot boundary \/ edge effects on erosion processes and 153\nrates are proportionately more significant at smaller spatial scales. 154\n155\nTo improve understanding of the effect of spatial scale on erosion processes, the links 156\nor connectivity between different scales can be studied by applying experimental 157\nmethods which encompass a range of spatial scales simultaneously. There has been 158\nsome work on converting field-scale to catchment-scale erosion data, based on the 159\nconcept of sediment delivery ratios (Osterkamp and Toy, 1997; Walling, 1983, 1990). 160\nHudson (1993) reports on the ‘nested catchments’ approach in soil erosion research, 161\nwhich was developed from biological research methods, investigating biodiversity 162\nand species richness at different scales. Turkelboom and Trebuil (1998) developed a 163\nmethodology for erosion process analysis at the field, farm and catchment scales, and 164\nways of linking these different scales. Their multiscale approach involves the 165\nphysical, economic and social aspects affecting erosion. Kirkby (2001) describes the 166\nhierarchical MEDRUSH model, which simulates erosion and runoff processes 167\noperating at a scale of 1 m2 in the first instance. These results are then ‘nested’ or 168\n‘embedded’ within representative ‘flow strips’ of up to 100 m wide, oriented up\/down 169\nthe slope. Water and sediment generated at this scale are then ‘routed’ via computed 170\nlinear transfer functions into the sub-catchment scale (1–10 km2). Output from this 171\nscale then feeds the main catchment-scale channel network, which may be up to 172\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n8\n2500 km2 in area. Kirkby (2001) argues that MEDRUSH demonstrates that ‘coarse 173\nand fine scaled models can be linked together consistently with a sound physical 174\nbasis’. 175\n176\nUntil we understand the connections between the different spatial scales, soil erosion 177\nresearch should encompass as wide a range of scales as possible. This has the multiple 178\nbenefits of linking soil erosion rates generated at varying spatial scales, supplying 179\nknowledge which will be of interest to many parties (from physically based erosion 180\nmodellers through to policy makers) and identifying if there are any rules to be 181\napplied when upscaling or downscaling the results of soil erosion research. 182\n183\nThis discussion on the effect of scale on erosion is intended for completeness, but the184\nfocus of this paper is on the plot-to-field scale, because this is the position in the 185\nlandscape at which removal of the in situ soil takes place. As a result, it is here that 186\nsoil functioning will be most adversely affected by soil erosion.187\n188\n1.3 Consequences, mitigation, costs and monitoring189\nSoil erosion rates are known to increase significantly following anthropogenic 190\nactivities such as stripping of natural vegetation, especially clearing of forests for 191\ncultivation; other changes in land cover through cultivation or urbanisation and 192\ninfrastructural development; over-grazing; wildfires or controlled burning; re-193\nsculpturing of the land surface for example terrace construction; inappropriate 194\nintensification of land use and management, for example cultivation of steep slopes 195\nbeyond their inherent ‘capability’ (Klingebiel and Montgomery, 1961) or collapse of 196\nterrace structures through poor maintenance (Temple and Rapp, 1972). The 197\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n9\nconsequences of soil erosion for society can be severe, for example annual costs have 198\nbeen estimated to be £205 million in England and Wales alone (see Table 2) and $44 199\nbillion in the U.S.A. (Pimentel et al., 1995).200\n201\nTable 2202\n203\nAs Table 2 demonstrates, the costs associated with soil erosion are often categorised 204\ninto ‘on-site’, i.e. where the soil loss takes place, and ‘off-site’ impacts, the temporary 205\nor permanent destination of the eroded sediment. Over time, attitudes have changed 206\nwith regard to the most damaging effects of soil erosion. Where crop productivity has 207\nbeen a significant driver of soil erosion, the on-site impacts of erosion are paramount 208\nthrough the. loss of rooting medium, nutrients, seeds, seedlings, agro-chemicals, 209\norganic matter, microbial communities, trace elements and water holding capacity.210\nThe production function of soil is likely to become even more important, in view of211\nthe projected increase in global human population and consequent demands for food. 212\nMore than 99% of food supplies (calories) for human consumption come from the 213\nland, whereas less than 1% comes from oceans and other aquatic ecosystems (FAO, 214\n2003).215\n216\nHowever, where food security is not an issue, or any declines in crop yield can be 217\nmasked by applications of agro-chemicals, the focus has often been on off-site 218\nimpacts. These include flooding, often due to deposition of eroded sediments 219\nrestricting the capacity of water channels to carry peak flows, and reductions in water 220\nquality, due to turbidity and preferential transport of contaminants on eroded sediment 221\nsurfaces, which, in turn, have impacts on aquatic biota (Lloyd, 1987; Lloyd et al., 222\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n10\n1987; Newcombe and Macdonald, 1991; Cooper, 1993). The value of soil in situ (i.e. 223\nnot eroded) is once again acknowledged (Vandekerckhove et al., 2004), as the concept 224\nof soil resources being able to deliver ecosystem goods and services gains acceptance225\nas advocated in the EU draft Soil Framework Directive (European Commission, 226\n2006a,b).227\n228\nTo evaluate the impact of agricultural and other land use policies in Europe, Gobin et 229\nal. (2002, 2004) proposed selecting a set of soil erosion indicators that can be 230\ncalculated objectively, validated against measurements or observations and evaluated 231\nby experts. This advice has been heeded in the design of a European soil monitoring 232\nsystem by the ENVASSO project - Environmental Assessment of Soil for Monitoring 233\n– funded under the European Commission’s 6th Framework Programme (Morvan et 234\nal., 2008). Indicators for soil erosion proposed for implementation at the first tier235\n(Eckelmann et al., 2006), are: i) estimated soil loss by water via rill, inter-rill and 236\nsheet erosion, ii) estimated soil loss by wind erosion, and iii) estimated soil loss by 237\ntillage erosion. Each of these indicators can be modelled and is accompanied by a 238\nmeasured indicator of soil loss for calibration and validation of modelled estimates. At 239\nthe present time, there is no reliable model for estimating or predicting gully erosion 240\nin the same way as models for rill and inter-rill erosion (Poesen et al. 2006, p528-30). 241\nHowever, it is likely that advances in remote sensing and data processing technology 242\nwill allow more reliable and accurate estimation of soil loss as a result of gully 243\nerosion in future (Jones et al., 2004).244\n245\nThe clear impact of erosion on society and individuals, combined with the political 246\ndrive for developing a harmonised European system for monitoring erosion as a threat 247\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n11\nto soil, has identified the need for scientifically sound and robust threshold values 248\nagainst which to appraise the monitoring data. This paper sets out to review tolerable 249\nsoil erosion, as a concept and in rates, for European conditions, and assesses actual 250\nsoil erosion rates by discussing all (known) types of erosion.251\n252\n253\n2 Tolerable soil erosion rates254\n255\n256\n2.1 Concept257\nSince soil loss includes the removal of soil material by both physical processes 258\n(erosion), and biochemical processes (solute\/gaseous export of mineral matter and 259\ndecomposition of organic matter), the term ‘tolerable soil erosion’ is preferable when 260\nreferring to soil lost by erosion in the context of soil protection. A number of (near) 261\nsynonymous terms are used in the literature: ‘soil loss tolerance’, ‘permissible soil 262\nloss’, ‘acceptable rates of erosion’, ‘allowable soil loss’, etc. (see Table 3). It is 263\nimportant to note the difference between concept and unit. ‘Tolerable soil erosion’ is a 264\nconceptual term, with judgements of affected soil functions etc., that can be quantified 265\nin ‘tolerable rates of soil erosion’ with units conventionally in t ha-1 yr-1.266\nTable 3267\n268\nReviewing the different definitions for tolerable soil erosion in the literature (Table 3), 269\ntwo themes emerge. The first interpretation is to view tolerable soil erosion as 270\nmaintaining the dynamic equilibrium of soil quantity (mass\/volume) in any location271\nunder any circumstances. The second interpretation takes a functional approach by 272\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n12\nrelating soil erosion tolerance to the biomass production function of soil. Roose 273\n(1996) highlighted difficulties with both interpretations. The first interpretation 274\nignores soil quality by focusing only on soil quantity. The second approach ignores 275\nmany soil functions by focusing only on the biomass (particularly crop) production 276\nfunction of soil (see also Table 4). In addition, it creates temporal ambiguity:. ‘a long 277\ntime’, ‘indefinitely’, ‘an extended period of time’, and ’20-25 years’. Interestingly, the 278\nSoil Quality Vocabulary of the SSSA (2001) lists both interpretations, without279\nindicating the conditions under which these should apply.280\n281\nBoth interpretations incorporate value judgements of how much soil erosion human 282\nsocieties should tolerate. The first interpretation judges that it is tolerable to ensure 283\nthat the rate of soil formation exceeds the rate of soil loss by erosion, but that it is not 284\ntolerable for the soil erosion rate to exceed the soil formation rate. The value 285\njudgement in the functional approach links the soil erosion tolerated to the 286\nperformance of one particular soil function, for example the crop production function.287\n288\nAt the end of the Second World War much of Europe was in ruins and crop289\nproduction systems were destroyed or at best seriously malfunctioning in many areas.290\nInternational aid, through the Marshall Plan in the ‘western’ world, focused on food 291\nsupplies, which were scarce and insecure. It was during this period that the concept of 292\ntolerable soil erosion was developed most actively, which may explain the focus on 293\nthe crop production function of soil. The agricultural surpluses of the 1980s lead in 294\nthe 1990s to a more comprehensive\/holistic concept of soil functions (e.g. Blum, 295\n1993; Sombroek and Sims, 1995; Brady and Weil, 2002; De Groot, 2002; Blum,296\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n13\n2005; Nikitin, 2005; and the European Commission, 2006a,b). These are generally 297\nbased on five primary soil functions (see Table 4).298\n299\nTable 4300\n301\nThe need to include the regulation function in establishing tolerable rates of soil 302\nerosion was realised by Mannering (1981) and Skidmore (1982), who included it in a303\nfunction of ‘soil loss tolerance’ (modified from Stamey and Smith, 1964), although 304\nonly as secondary to the production function. Roose (1996) stated that tolerable soil 305\nerosion should consider “respect for the environment in terms of water quality, 306\nespecially runoff sediments”. Despite these appeals, definitions for tolerable soil 307\nerosion that were published later only incorporated the crop production function (see 308\nTable 3).309\nThe remaining three soil functions (i.e. information, engineering and habitat) do not310\nappear to have been considered in ‘tolerable soil erosion’ definitions in the literature. 311\nThis can probably be explained by the relatively recent development of the holistic 312\nsoil function concept, compared to the development of the tolerable soil erosion313\nconcept. Sparovek and De Maria (2003) point out that tolerable soil erosion is the 314\nmost multidisciplinary field of soil erosion research and that only contemplation of 315\nthis multi-perspective nature may be successful. It appears, therefore, that the time has 316\ncome to integrate both concepts. Tolerable soil erosion may then be defined as ‘any 317\nmean annual cumulative (all erosion types combined) soil erosion rate at which a 318\ndeterioration or loss of one or more soil functions (Table 4) does not occur’.319\n320\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n14\nClearly, this definition still leaves the problem of value judgement and scale: at what 321\nstage is a soil function considered to have deteriorated, and at what scale is this 322\nassessed? Also, it is a rather negative approach, where action is only required when a 323\ntolerable rate of soil erosion in a specific location is reached. This approach also 324\nassumes that no technological advances may occur over time, such as the invention of 325\n‘super-fertilisers’, which could (albeit unsustainably) mask declines in crop yield due 326\nto loss of soil though erosion processes. It may be a more effective policy to provide 327\nincentives to land owners and managers to ensure that actual soil erosion rates remain 328\nmuch closer to, or preferably equal to or below, the soil formation rate. This would be 329\nan exemplary application of the precautionary principle (i.e. to preferably err on the 330\nside of caution), and ensure that soil functions were maintained for the benefit of 331\ncurrent and future generations.332\n333\nRates of soil formation provide an invaluable benchmark to use as a ‘basis’ for 334\ndetermining tolerable rates of soil erosion, that is soil functions can generally be335\njudged not to deteriorate as long as soil erosion does not exceed ‘natural’ or 336\n‘geological’ (or ‘normal’) erosion rates. At present, this assumption remains largely 337\nuntested, but applying the precautionary principle appears to be a reasonable starting 338\npoint. A second assumption is that ‘natural’ soil erosion rates equate to soil formation 339\nrates. This implies a meta-stabile situation where all soils are in dynamic equilibrium340\nin terms of quantity (mass\/volume). Clearly, young soils or any soil that could 341\naccumulate under current conditions, and thereby improve the soil regulation, 342\nproduction, and habitat functions, would not be in dynamic equilibrium. Nevertheless, 343\nsoil formation rates form the best basis upon which to establish tolerable rates of soil 344\nerosion.345\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n15\n346\n2.2 Current evidence for soil formation rates347\nThe natural process of soil accumulation at any location has been described as soil 348\nproduction, soil formation, soil genesis, pedogenesis, or soil renewal (Brady and Weil, 349\n2002). The term ‘soil formation’ is used here for reasons of general acceptance, noting350\nthat this includes both dust deposition and parent material weathering.351\n352\nIdeally, soil formation models (e.g. Hoosbeek and Bryan, 1992; Minasny and 353\nMcBratney, 2001) would have been developed and validated to such an extent that for 354\nany soil type, under any land use, soil management practice, in any region, accurate 355\nestimates of soil formation rates could be derived. Better still would be a degree of 356\nmodel development that could also estimate soil formation rates for future climate 357\nchange scenarios. It is generally acknowledged that ‘natural’ erosion rates have varied 358\nsignificantly throughout geological history as the climate changed (Wilkinson and 359\nMcElroy, 2007). However, fundamental scientific knowledge on soil formation 360\nprocesses is still insufficient at present to support the use of mechanistic soil 361\nformation models for establishing tolerable rates of soil erosion in the context of362\nenvironmental protection. Therefore, the most useful contribution that science can363\nmake to the policy process would be to arrive at a consensus on mean rates of soil 364\nformation and soil erosion.365\n366\n2.2.1 Soil formation rates by weathering367\nVery few direct measurements of soil formation rates are available. This is due in part 368\nto the extremely slow rate of soil formation in relation to the human life span, and 369\nconsequent difficulties in accurate field measurement. However, from studies using 370\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n16\ndifferent methodologies over different scales, an overall picture of the range of soil 371\nformation rates can be built up (Table 5), although differentiation of these rates by 372\ndominant factors remains elusive. Mass balance measurement studies have been 373\nperformed to investigate soil formation rates. Alexander (1988a) determined soil 374\nformation rates for 18 small, non-agricultural, non-carbonate substrate watersheds 375\n(located in North America, Europe, Australia (Victoria) and Zimbabwe) with shallow 376\nto moderately deep soils, by measuring values of silica inputs and outputs and relating 377\nthese to soil formation. The range for non-peaty soils was from 0.02 to 1.27378\n(mean=0.49) t ha-1 yr-1. If, and to what extent, these soil formation rates would 379\nincrease under agricultural land use is not known. Wakatsuki and Rasyidin (1992) 380\nused similar geochemical mass balance methodologies on seven elements (Al, Fe, Ca, 381\nK, Mg, Na and Si) to calculate soil formation at a global scale as ranging from 0.37 to 382\n1.29 (mean=0.7) t ha-1 yr-1. Much greater rates were calculated for well draining, high 383\nprecipitation watersheds in southwestern Japan, but environmental conditions there 384\nare not typical for the rest of the world. Soil formation rates by weathering in 385\nlimestone-dominated catchments, or those with a mainly igneous lithology, have been 386\nestimated at < 0.1 t ha-1 yr-1 (Alexander, 1985). Soil chronosequence studies can be 387\nused as an alternative method for deriving soil formation rates, although most appear 388\nto focus on processes that are responsible for specific soil parameters rather than 389\noverall soil formation rates. See Huggett (1998) and Yoo and Mudd (2008) for390\ndiscussions of methodological issues of classic soil chronosequence work. 391\n392\nTable 5393\n394\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n17\nLandscape scale ‘soil formation functions’ (i.e. the relationship between soil 395\nformation and soil depth) have been derived from studies in the disciplines of geology 396\nand geomorphology. Humphreys and Wilkinson (2007) describe a useful overview of 397\nthis theme and recommend that the basic idea of soil formation may be used for the 398\ndetermination of tolerable soil erosion rates. Heimsath et al. (1997) used399\nmeasurements of in situ produced cosmogenic 10Be and 26Al concentrations with 400\nmeasured soil depths to show an inverse relationship between soil formation rates and 401\nsoil depth in northern California. Soil formation rates ranged from ca. 0.39 t ha-1 yr-1402\nfor deeper soils (ca. 50 cm) to ca. 0.91 t ha-1 yr-1 for shallower soil (ca. 5 cm), 403\nassuming a bulk density of 1.3 t m-3. Shakesby and Doerr (2006) reviewed evidence in 404\nthe literature of fire weathering, that is where wildfire ‘weathers’ rocks by spalling 405\n(detachment of lensoid-shaped rock flakes) and other fracturing effects, and showed 406\nthat where fires are relatively frequent this may be an important additional weathering 407\nprocess, although erosion rates are likely to increase concomitantly.408\n409\nNatural soil erosion rates, assumed to be equivalent to soil formation rates (see section 410\n1) when studied over geological time scales, have been estimated by studying 411\ncontinental erosion and sedimentation. Wilkinson and McElroy (2007) gave an 412\nexhaustive analysis of rates of subaerial denudation in the Phanerozoic, a period of 413\n542 million years spanning the Lower Cambrian to the Tertiary Pliocene. They 414\nestimate that erosion averaged 5 Gt yr-1 during this period.. The global land area 415\nfluctuated throughout the Phanerozoic, but using a continental area of 118 million 416\nkm2, 5 Gt yr-1 equates to an average natural erosion rate of 0.4 t ha-1yr-1 (over 542 417\nmillion years. Schaller et al. (2001) measured in situ produced radionuclides (10Be) in 418\nthe bedload of middle European rivers to infer average soil erosion rates, over the last 419\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n18\n10,000-40,000 yr, at 0.26-1.3 t ha-1yr-1 (assuming a bulk density of 1.3 t m-3). Mabit et 420\nal. (2008) discusses the advantages and limitations of fallout radionuclides for 421\nassessing soil erosion. Bennett (1939) reported that soil formation rates in the USA 422\nrange from 0.3-1.1 t ha-1yr-1 (assuming a bulk density of 1.3 t m-3), although he did 423\nnot specify the methodology used. However, in areas where aeolian deposition occurs, 424\nthe picture of soil formation is more complex.425\n426\n2.2.2 Soil formation rates by dust deposition427\nSimonson (1995) reviewed the significance of air-borne dust to soils and discussed 428\nthat when dust is deposited onto a soil from a desert source area, it may be regarded as 429\n‘more valuable’ for soil functions in its new location, in a similar way that Sahelian 430\ndust boosts biomass production in Amazonian forests (e.g. Swap et al., 1992). 431\nAlthough this is a contentious view, wind erosion of fine particles in the Sahel may 432\ncontribute to not allowing local vegetation cover development. In the present paper 433\nSimonson’s suggestion is accepted as long as the amount deposited is of an order of 434\nmagnitude that enables the soil to incorporate it (i.e. not being buried by it).435\n436\nResearch into dust transport and deposition has increased substantially over the last 437\ndecade (Engelstaedter et al., 2006). Satellite imagery and isotopic composition 438\nanalyses have revealed that the Sahara is the main source of dust deposited in Europe439\n(Middleton and Goudie, 2001), although dust originating from China has also been 440\nrecorded in the French Alps (Grousset et al., 2003). Remote sensing analysis, 441\nemploying the Total Ozone Mapping Spectrometer absorbing Aerosol Index (TOMS 442\nAI), has identified dust pathways from North Africa to the Mediterranean Basin 443\n(Middleton and Goudie, 2001; Israelevich et al., 2002).444\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n19\n445\nNorth Africa is considered to be the largest source of dust on Earth with estimates of 446\nthe strength of the Saharan source to be 130 to 760 million t yr-1, compared to 1000 to 447\n3000 million t yr-1 globally (Engelstaedter et al., 2006). The greater part of Saharan448\nand peri-Saharan or Sahelian dust is delivered to the North Atlantic, but substantial 449\namounts are estimated to be deposited on the European continent. D’Almeida (1986) 450\nused sun-photometer readings taken in the early 1980s to estimate Saharan dust 451\ndelivery to Europe at 80-120 million t yr-1. Löye-Pilot et al. (1986) extrapolated their 452\nfield data from Corsica to estimate dust delivery to the western Mediterranean at 3.9 453\nmillion t yr-1.454\n455\nField measurements of dust deposition are summarised in Table 6. As Middleton and 456\nGoudie (2001) and Engelstaedter et al. (2006) observed, both the frequency of dust 457\ndeposition and the mean annual quantity of deposited dust are greater for southern 458\nthan for northern Europe. For Mediterranean Europe, up to the Pyrenean, Alpine, and 459\nCarpathian mountain ranges, dust deposition rates range from 0.05 to 0.39 t ha-1 yr-1. 460\nNorth of this mountain divide, dust deposition rates are below 0.01 t ha-1 yr-1. For the 461\npurpose of setting soil formation rates as thresholds for soil erosion (i.e. tolerable 462\nrates), it seems a reasonable generalisation to set dust deposition rates at ca. 0.2 t ha-1463\nyr-1 south of the trans-European mountain divide, and to regard dust deposition rates 464\nas negligible relative to soil erosion rates north of the divide, accepting potentially 465\nsubstantial but presently unquantifiable local variation to this.466\n467\nTable 6468\n469\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n20\nThe value of 0.2 t ha-1 yr-1 for southern Europe is of the same order of dust deposition 470\nrates found in California, where Reheis and Kihl (1995) measured dust deposition 471\nrates to range from 0.04-0.16 t ha-1 yr-1 in southern Nevada and south-eastern 472\nCalifornia, and determined an average value of 0.30 t ha-1 yr-1 in south-western 473\nCalifornia. Simonson (1995) reviewed the significance of dust deposition to soils and 474\nquoted estimates of approximately 3.0 t ha-1 yr-1 of dust deposition on average for 475\nsoils between the Rocky Mountains and the Mississippi River. This is a much greater 476\nvalue than those reported for Europe or California, and may be explained by the 477\nsource area in the semi-arid south west U.S.A. delivering most of its dust eastward.478\n479\n2.2.3 Overall soil formation rates480\nFor the purpose of deriving overall soil formation rates in the evaluation and 481\nmonitoring of soil erosion and its impacts, it appears to be reasonable to estimate dust 482\ndeposition at no more than 0.2 t ha-1 yr-1 in southern Europe and at 0.0 t ha-1 yr-1 in 483\nnorthern Europe. By contrast, estimated soil formation rates (by weathering) for 484\ncurrent conditions in Europe range on average from ca. 0.3 t ha-1 yr-1 to ca. 1.2 t ha-1485\nyr-1. Much lower rates (e.g. 0.004 t ha-1 yr-1 for basaltic parent material in semi-arid 486\nAustralia – Pillans, 1997) and greater rates (e.g. 5.7 t ha-1 yr-1 for a very well draining 487\nhigh precipitation watershed in southwestern Japan – Wakatsuki and Rasyidin, 1992) 488\nhave been reported for environmental conditions generally not found in Europe.489\nTherefore, considering soil formation rates by both weathering and dust deposition, it490\nis estimated that for the majority of soil forming factors in most European situations,491\nsoil formation rates probably range from ca. 0.3 – 1.4 t ha-1 yr-1. Although the current 492\nagreement on these values seems relatively strong, how the variation within the range 493\nis spatially distributed across Europe and how this may be affected by climate, land 494\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n21\nuse and land management change in the future remains largely unexplored. It may be 495\nexpected that dust deposition rates in the Mediterranean will increase in a climate 496\nchange scenario that brings increasing droughts to the Sahel region, but if this will 497\nalso mean that more dust will be deposited further northwards in Europe is more 498\nuncertain, as is the regional\/local scale variation in dust deposition rates. Chemical 499\nweathering can be expected to increase where precipitation increases, particularly 500\nwhere the parent material is well draining, although soil erosion rates may 501\nconcomitantly increase at the same or a greater rate (particularly when the rainfall 502\nintensity increases). Soils formed in limestone or granitic lithology are reported to 503\nhave formation rates towards the smaller part of the range, although the body of 504\nevidence is relatively small and more experimental research is urgently needed into 505\nsoil formation rates for these lithologies, since they cover a substantial area in Europe.506\nSoil formation by sedimentation in water is only significant in the floodplains of large 507\nriver systems, and is, therefore, omitted from this paper.508\n509\n2.2.4 Tolerable rates of soil erosion in Europe510\nAlthough reported rates of soil formation suggest an upper limit of approximately 1.4511\nt ha-1 yr-1 for mineral soils (see also Alexander, 1988b), it would be advisable to apply 512\nthe ‘precautionary principle’ to any policy response to counteract soil erosion,513\notherwise soils with particularly slow rates of formation will steadily disappear, even 514\nwhen subjected to low erosion rates. Therefore, future differentiation of soil formation 515\nrates for soil–landuse–climate combinations is needed, and quantitative pedogenesis 516\nmodelling (e.g. Hoosbeek and Bryan, 1992; Minasny and McBratney, 2001) may 517\nprovide an appropriate methodology.518\n519\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n22\nIn some cases, rates of soil erosion greater than those of soil formation have been 520\nregarded as tolerable only from the wider perspective of society as a whole, for 521\nexample because of a perception that certain crops (such as some vines) favour eroded 522\nsoil profiles. In Switzerland, the threshold tolerated for soil erosion is generally 1 t ha-523\n1 yr-1, though this threshold is increased to 2 t ha-1 yr-1 for some soil types (Schaub and 524\nPrasuhn, 1998). In Norway, 2 t ha-1 yr-1 is adopted as the threshold for tolerable soil 525\nloss (A. Arnoldussen, personal communication.). However, the data reviewed here526\nconfirm that a precautionary approach to environmental protection should regard soil 527\nerosion losses of more than 1 t ha-1 yr-1 in Europe as unsustainable in the long term 528\n(Jones et al., 2004). In the USA, soils have been assigned tolerable rates (so-called ‘T 529\nvalues’) by using a range of methodologies, mainly the USLE model and expert 530\njudgement, and differentiated mainly by soil depth and crop productivity. Approaches 531\nand assumptions for deriving T values have been revised (e.g. Mannering, 1981; 532\nPierce et al., 1984) and continue to be discussed (Johnson, 1987; Mirtskhulava, 2001; 533\nJohnson, 2005; Montgomery, 2007). Another way of expressing tolerable soil erosion 534\nis to calculate the ‘life span’ of soil. This is the number of years it will take, at current 535\nsoil formation\/erosion rates, for a soil to reach its finite point (i.e. the minimum soil 536\ndepth required before it becomes economically unsustainable to maintain the current 537\nland use - Stocking and Pain, 1983). For commercial farming the finite point has been 538\ndefined at which yields fall to 75% below the maximum possible (Morgan, 1987). 539\nHowever, this value is highly dependent on socio-economic conditions and available 540\ntechnology and these factors are notoriously difficult to predict accurately in the 541\nfuture. For other soil functions this approach has not been applied, possibly in part 542\nbecause of some (components of) soil functions do not allow for straightforward 543\neconomic sustainability assessments (e.g. soil biodiversity).544\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n23\n545\nSetting a limit of 1 t ha-1 yr-1 is also supported when considering the impact of soil 546\nerosion \/ sediment production rates on water quality. Eroded soil, delivered to water 547\nbodies can be a physical and chemical pollutant in terms of water turbidity and as a 548\ncarrier of contaminants which may have detrimental effects on aquatic ecosystems.549\nQualitative limits for eroded sediment in water bodies are advocated in policy drivers 550\nsuch as the EU Water Framework Directive, which states that surface waters should 551\nbe kept in ‘good ecological status’. EU Member States are currently deciding on the 552\nlevel of sediment, which will give such a status, but it is unlikely that absolute 553\nstandards for biological quality will be set across the whole community, because of 554\necological variability. It is expected that the specified controls will allow “only a 555\nslight departure from the biological community which would be expected in 556\nconditions of minimal anthropogenic impact”. Quantitative targets have also been set 557\nto control pollution from sediment (e.g. the United States Department of Agriculture558\nuses a target of 1 t ha-1 yr-1 to maintain water quality). 559\n560\n561\n3. Actual soil erosion rates562\nSection 3.1 introduces the main types of soil erosion while section 3.2 reviews the 563\nerosion rates reported in the literature.564\n565\n3.1 Soil erosion types566\nSoil loss by coastal and riparian erosion is not reviewed in this study, because this 567\nconstitutes the loss of land, which is not directly linked to human activities although it 568\nconstitutes a ‘permanent’ loss of soil. Furthermore, it is not clear that human influence 569\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n24\nthrough land management and land use practices has any significant effect on 570\nincreasing or decreasing coastal erosion, although a number of studies have shown 571\nthat attempts to mitigate by erecting engineering structures (e.g. impervious sea walls 572\nand breakwaters) can actually aggravate the problem elsewhere along the coastline 573\n(McInnes et al., 2000; Lee and Clark, 2004; Lee and Jones, 2004; Bromhead and 574\nIbsen, 2006).575\n576\n3.1.1 Soil loss by water erosion577\nWater erosion takes place through rill and\/or inter-rill (sheet) erosion, and gullies, as a 578\nresult of excess surface runoff, notably when flow shear stresses exceed the shear 579\nstrength of the soil (Kirkby et al., 2000; Jones et al., 2004; Kirkby et al., 2004). This 580\nform of erosion is generally estimated to be the most extensive form of erosion 581\noccurring in Europe. De Ploey (1989) identified different domains where these 582\nprocesses take place, as a function of soil, slope and land cover characteristics in any 583\nlocation. Sheet and rill erosion will cause surface soil to be removed from the in situ584\nsoil mass. Assuming this surface soil has not been disturbed previously (e.g. by 585\ninversion tillage or preceding erosion events), it will contain considerable amounts of 586\norganic matter and plant nutrients that are crucial to perform effective soil functions587\n(Fullen and Brandsma, 1995). This eroded soil material may not necessarily travel 588\nvery far and may remain in the same field from where it was eroded. Indeed, the area 589\nof deposition may benefit from the accumulation of highly fertile, eroded surface soil, 590\nin the same way that river flood plains receive substantial depositions of highly fertile591\nsediment. However, this accumulation of eroded soil may only be temporary, until the 592\nnext erosion event, especially as the recently deposited sediments often lack 593\naggregation and remain highly erodible.594\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n25\n595\nWhere there is little vegetative cover or root network below the surface, and slopes 596\nare steep, the eroded soil from these surface processes can move into the stream 597\nnetwork and thus cause further detrimental off-site impacts (Cerdan et al., 2006). The 598\ntransport of eroded material will be enhanced further by erosion features such as 599\ngullies which provide a conduit for the eroded surface soil (Blong et al., 1982), as 600\nwell as being a source of sediments in their own right. Long term field plots are often 601\nused for direct measurement of soil loss by rill and inter-rill erosion; as demonstrated 602\nby Boix-Fayos (2005). Models of rill erosion have been shown by some researchers to 603\nbe in disagreement with current experimental evidence (Govers et al., 2007; De Vente 604\net al., 2008), but direct measurements of soil erosion are both scarce and do not fully 605\nrepresent the soil-climatic landscapes that experience rill erosion in Europe.606\n607\nGully erosion is common in Mediterranean Europe, in particular, Spain, Italy and 608\nGreece (Vandekerckhove et al., 2000). These areas are characterised by long-term609\ngullies (i.e. that cannot be obliterated by ploughing), which have been described as610\nrelatively deep, recently formed, eroding channels that form on valley sides and on 611\nvalley floors where no well-defined channel previously existed (Schumm et al., 1984). 612\nEphemeral gullies (i.e. that can be obliterated by ploughing) commonly occur in the613\narable loess soil, as seen in the loess belt of Belgium and the sandy soils of the South 614\nand West Midlands of England. These gullies develop rapidly, are ploughed in and 615\noften reappear the following year. The occurrence of gullies, and variations in the type 616\nof gully erosion, are related to particular soil properties, climate and topography of 617\nthese areas (Nachtergaele and Poesen, 1999; Nachtergaele et al., 2001). It is 618\nnotoriously difficult to predict where and when gully erosion will occur in the 619\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n26\nlandscape by the extension of an existing gully or a new gully forming, as well as 620\nassociated rates of sediment production (Poesen et al., 2003).621\n622\n3.1.2 Soil loss by wind erosion623\nWind erosion occurs predominantly on the North European Plain (northern Germany, 624\neastern Netherlands and eastern England) and in parts of Mediterranean Europe (De 625\nPloey, 1989; Evans, 1990, 1996; Chappell, 1999; Chappell and Thomas, 2002;626\nWarren, 2002; Barring et al., 2003; Breshears et al., 2003; Riksen et al., 2003; Jones 627\net al., 2004; Quine et al., 2006). Wind erosion is caused by the simultaneous 628\noccurrence of three conditions: high wind velocity; susceptible surface of loose 629\nparticles; and insufficient surface protection. The transport of soil material (between 630\nerosion and sedimentation) can occur in three main modes: saltation, creep and 631\nsuspension. Factors that exacerbate wind erosion are similar to those for erosion by 632\nwater: namely soil erodibility, as determined by physical, chemical and biological 633\nproperties including texture, organic matter content, moisture content, land use and 634\ncover, and energy of the force causing the erosion (wind erosivity). Riksen et al. 635\n(2003) point out that wind erosion is not as significant or as widespread a problem in 636\nEurope as in drier parts of the world, which might explain the relatively limited 637\nresearch on wind erosion to date compared to water erosion studies. The present 638\nreview concludes that there are few accurate data on the extent and magnitude of the 639\nproblem, or the costs of the remediation (Owens et al., 2006a,b,c). Goossens et al. 640\n(2001) studied the dynamics of Aeolian dust emitted from agriculture in northwest 641\nGermany, over a 15 month period. The dust emission was caused by wind erosion 642\ncombined with tillage activities and the dust emitted consisted of mineral as well as 643\norganic particles.644\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n27\n645\n3.1.3 Soil loss by tillage erosion646\nThis erosion type has been recognised for several decades, but the magnitude of soil 647\nlost by this process in Europe has only been appreciated and documented during the 648\nlast 10-15 years (Lindstrom et al., 1992; Govers et al., 1993; Lobb et al., 1995; Govers 649\net al., 1996; Lobb et al., 1999; Van Muysen et al., 1999; Lindstrom et al, 2000; Van 650\nOost et al., 2000a,b; Quine and Zhang, 2004a,b; Van Oost et al., 2005a,b; Owens et 651\nal., 2006a,b; Quine et al., 2006; Van Muysen et al., 2006; Van Oost et al., 2006; Van 652\nOost et al., in press). Mech and Free (1942) concluded that soil movement by tillage 653\nwas far from insignificant and that its intensity was related to slope gradient. Soil 654\ntranslocation by tillage results in soil loss from convex slope positions, such as crests 655\nand shoulder slopes, because of an increase in-slope gradient and a consequent 656\nincrease in soil translocation. Spatial patterns of tillage erosion differ from those of 657\nwater erosion, because the principal agent is different. Soil loss by tillage can be 658\ngreatest from landscape positions where water erosion is minimal (i.e. in concavities 659\nand near upslope field boundaries), whereas soil deposition by tillage can occur in 660\nareas where water erosion is often maximal (i.e. on slope convexities). Measurements 661\non the magnitude of tillage erosion are few, but studies in Europe highlight the 662\nimportance of the magnitude of tillage erosion relative to water erosion (Govers et al., 663\n1993; Quine et al., 1994; Owens et al., 2006a). Van Oost et al. (2005a) have compared 664\nrates of soil erosion by tillage with those by water. By comparing two time periods,665\nthey found that there has been a shift from water-dominated to tillage-dominated 666\nerosion processes in agricultural areas during the past few decades. This reflects the 667\nincrease in mechanized agriculture and the authors concluded that where soil is 668\ncultivated, tillage erosion may lead to larger losses than overland flow.669\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n28\n670\n3.1.4 Soil loss by crop harvesting671\nThis erosion type refers to soil removed during crop harvesting, for example of root 672\ncrops, mainly in northern Europe. Soil can be removed from a location or field by 673\nadhering to farm machinery (e.g. wheels, tines, ploughs and discs). Much larger 674\namounts of soil can be removed by soil co-extraction with a root crop, particularly . 675\nsugar beet, potatoes, carrots and chicory) (Jaggard et al., 1997; Ruysschaert et al., 676\n2005). This mechanism of soil loss is known as ‘soil loss due to crop harvest (SLCH)’677\nin the scientific literature (Ruysschaert et al., 2004, 2005), and as ‘soil\/dirt tare’ in the 678\nagricultural industry. SLCH is a particular problem in areas growing early potatoes in 679\nnorthern Europe because harvesting normally takes place when the topsoil is moist or 680\nvery moist and soil particles readily adhere to the surface of the potatoes. However, 681\npreparation of the crop for marketing usually involves cleaning (washing) and 682\nremoving the soil but returning it to the fields from whence it came is not always 683\nadvised by the agricultural extension services, because of the possibility of spreading 684\ndisease.685\n686\n3.1.5 Soil loss by slope engineering687\nSlope engineering is the mechanical translocation of soil by bulldozers and other earth 688\nmoving equipment to adapt slope surfaces to mechanised agriculture. Some authors 689\nrefer to this practice as ‘land levelling’, which implies a reduction of slope gradient,690\nwhich in turn would actually reduce erosion risk. However, as is seen in the 691\nconstruction of bench terraces for example, whilst the bench of the terrace is levelled, 692\nthe ‘riser’ or back wall component of the terrace has to compensate for this, and is 693\nconstructed at an angle which is steeper than the original land slope. This back slope 694\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n29\nis thus highly susceptible to surface erosion and mass movement. During terrace 695\nconstruction, soil loss can be aggravated as natural vegetation is mechanically 696\nremoved from the land to enable soil to be cultivated, often in the form of modern 697\nspecialised orchards, vineyards and olive groves. Often, marginal land with poor 698\nquality soils is used, so deep ploughing to about 1 m depth is required to ensure a 699\nsufficient depth of rootable soil (Jones et al., 2004). Such soil disturbance can destroy 700\nany soil structure, and increase soil erodibility and exacerbate soil losses. This form of 701\nerosion is common in many parts of Europe, especially in Italy, where it is widespread 702\nin the Apennines and hilly pre-alpine regions. Such techniques are also practised in 703\nsouthern Spain, where intensive horticulture under polythene canopies has spread onto 704\nthe foothills of Andalusia. The climate there is arid to semi-arid. Thus, when heavy 705\nrain falls soil losses are exacerbated by steep slopes, lack of natural vegetation cover 706\nand the unstable disturbed soil (Kibblewhite et al., 2007).707\n708\n709\n3.2 Current evidence for actual soil erosion rates710\nThere have been attempts to map soil erosion rates and risk in a number of EU 711\nMember States (De Ploey, 1989; Schaub and Prasuhn, 1998; Sanchez et al., 2001; 712\nMinistry of Environment of the Slovak Republic and Slovak Environmental Agency, 713\n2002; Van der Knijff et al., 2002; Hennings, 2003; Øygarden, 2003; Kirkby et al., 714\n2004; Dostal et al., 2004; Boardman and Poesen, 2006; Kertéz and Centeri, 2006), but 715\nto establish an accepted overall baseline for erosion in Europe remains a challenging 716\ntask. Rates of soil erosion have been determined using several approaches: i) plot and 717\nfield measurements, ii) soil erosion modelling, iii) mass\/energy balance modelling, iv) 718\nradionuclide measurement, v) suspended sediment load in rivers and streams, vi) 719\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n30\nchronosequence studies, and vii) geological (sedimentological) studies. Trimble and 720\nCrosson (2000a,b) reviewed soil erosion rates in the U.S. and concluded that models 721\nshould only be used with caution, taking account of all the assumptions and potential 722\ninaccuracies of the model chosen. These authors recommended that it would be better 723\nif resources were directed more towards measurements of soil erosion.724\n725\nIn this review, the focus is placed on measured soil erosion rates where available, and 726\nvalidated modelled rates for important but relatively unexplored soil erosion types. 727\nPublications on mean soil erosion rates refer mostly to water erosion, yet baseline728\nvalues for other forms of erosion, for example by wind and tillage, are also needed.729\n730\n3.2.1 Rates of soil loss by water (sheet, rill and gully) erosion731\nPimentel et al. (1995) have reviewed erosion rates around the world and suggested an 732\naverage of 17 t ha-1 yr-1 for arable soils in Europe. This is a crude approximation since 733\nit is based on plot data, which only exist for very small areas where measuring 734\nequipment has been installed and monitored. Furthermore, data from plot experiments 735\nare known to be a poor basis for regional generalisation (Boardman, 1998). This is 736\nbecause to obtain long-term estimates of soil erosion, plot estimates must be scaled up 737\nby integrating over time and surface runoff generated locally may not reach the base 738\nof a slope to deliver sediment to a channel (Kirkby et al., 2008). Thus, some soil 739\nremoved from an experimental plot may be deposited downslope but not lost 740\ncompletely from the regional parcel or catchment. In addition, the location of soil 741\nerosion plots across Europe may not be representative, because erosion plots tend to 742\nbe selected in places where erosion is known to occur and where resources are 743\navailable to measure it. Yang et al. (2003) applied the RUSLE model on a 0.5° global 744\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n31\ngrid using a 1 km resolution DEM to estimate rates of soil erosion by water, and 745\nfound an average value of 11.1 t ha-1 yr-1 for Europe compared to 10.2 t ha-1 yr-1746\nglobally. In addition Yang et al. (2003) evaluated the human induced proportion of the 747\nsoil erosion by modelling the difference between current land cover and potential land 748\ncover without human activity. Human-induced erosion was estimated to be ca. 60% 749\nglobally, but ca. 88% for Europe.750\n751\nThe occurrence and rate of water erosion processes are influenced by regional climate, 752\nlocal soil properties, and past and present land use. A number of localised erosion 753\nrates are given for various plots around Europe, some containing only one or two 754\nforms of erosion, depending on the spatial scale of the plots (Morgan, 2005). Cerdan 755\net al. (2006) extensively reviewed the experimental data for soil loss by sheet and rill 756\nerosion in Europe, and compiled a database of 208 plots on 57 experimental sites in 757\n13 countries. The mean erosion rate was 8.8 t ha-1 yr-1, although aggregation of the 758\ndata by land use showed large variations. Geographical comparisons, (i.e. 759\nMediterranean versus the rest of Europe) showed no significant overall difference and 760\nno large differences between most land uses, except for bare soil (ca. 32 t ha-1 yr-1 for 761\nthe Mediterranean zone and ca. 17 t ha-1 yr-1 for the rest of Europe).762\n763\nPoesen et al. (2006) present a comprehensive list of published rates for gully erosion, 764\nincluding both ephemeral and permanent gullies. Ephemeral gully rates derived from 765\nstudies conducted in the loess belt of Belgium while the majority of permanent gully 766\nerosion rate estimates are from the Mediterranean region of Europe. These rates vary 767\nfrom 1.1 to 455 t ha-1 yr-1 (Poesen et al., 2006). This wide range gives an indication of 768\nthe complexities of quantifying soil loss by gully erosion owing to the episodic and 769\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n32\nhighly variable nature of soil loss within these eroded channels; variable regional 770\nclimatic effects; the haphazard nature of gully distribution in the landscape; 771\npropensity of vertically variable soil properties to exacerbate gully erosion; the stage 772\nat which the gully is in its erosion cycle (active or stable); current or previous773\ntopographic position in the landscape; and the historical and present land use 774\ninfluencing the gully (Valentin et al., 2005).775\n776\nMartinez-Casasnovas et al. (2003) highlighted the complexities of measuring gully 777\nerosion rates in a study of one gully system located in north eastern Spain. Using 778\naerial photographs and a detailed digital elevation model (DEM), they estimated the 779\nannual average sediment production rate of the gully from 1975 to 1995 to be 846 (± 780\n40) t ha-1 yr-1. The net erosion, taking account of some eroded material being 781\ndeposited, was 576 (± 58) t ha-1 yr-1, averaged over the 20-year period. During the 782\nstudy the authors measured and analysed a 1 in 100 year rainfall event when 205 mm 783\nfell over the study area in 2h 15 min leading to a net soil loss of 207 (± 21) t ha-1 with 784\na sediment production rate of 487 (± 13) t ha-1 by ephemeral gully, rill and inter-rill 785\nerosion (Martinez-Casasnovas et al., 2003). The authors see this comparison as good 786\nevidence that gully erosion accounts for 1.7 times more soil loss than the other forms 787\nof erosion in this study area. However, averaging gully erosion on an annual basis 788\nprobably gives an unrealistic rate, owing to the episodic nature of the gully forming789\nprocess (Betts and De Rose, 1999)790\nFew studies have considered erosion from gullies at a regional or catchment scale. 791\nHowever, Nachtergaele and Poesen (1999) considered ephemeral gullies at four sites 792\nin Belgium (ranging from 216 to 1095 ha), using sequential aerial photographs from 793\n1952 to 1996.  Each site contained 18 to 38 gullies on average and it was estimated 794\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n33\nthat the reasonably long-term (44 yr) average for soil loss was between 3.2 and 8.9 t 795\nha-1 yr-1. These figures are considerably different to those given by Martinez-796\nCasasnovas et al. (2003), even though the measurement methods were similar 797\n(interpretation of sequential aerial photographs), and reveal the importance of 798\ndifferentiating between type of gully erosion and regional influences (Mediterranean 799\nversus western Europe) when assessing gully erosion rates. 800\nJones et al. (2004) report a number of other soil erosion studies which provide a 801\nEuropean overview, but these are based mostly on models or expert judgement 802\n(including observation). These approaches more commonly produce assessments of 803\nerosion risk rather than estimates of actual soil loss, without reference to baseline 804\nand\/or threshold values.805\n806\n3.2.2 Rates of soil loss by wind erosion807\nRecent work in Eastern England reported mean wind erosion rates of 0.1-2.0 t ha-1 yr-1808\n(Chappell and Thomas, 2002), although severe events can move much larger 809\nquantities (>10 t ha-1 yr-1) of soil. Böhner et al. (2003) estimated average soil loss at 810\n1.6 t ha-1 yr-1, and a mean maximum of 15.5 t ha-1 yr-1 from simulation modelling. 811\nDespite research studies in these areas, Chappell and Warren (2003) report that little 812\nis known about the true extent and magnitude of wind erosion in Europe.813\n814\n815\n3.2.3 Rates of soil loss by tillage erosion816\nMean gross rates of tillage erosion have been reported to be in the order of 3 t ha-1 yr-1817\nfor Belgium, the north of France, and the east of England (Govers et al., 1996; Owens 818\net al., 2006a). Boardman and Poesen (2006) reviewed measurement data for tillage 819\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n34\nerosion rates in Europe and concluded that it often exceeds 10 t ha-1 yr-1, particularly 820\non fields with complex topography. Van Oost et al. (2005a) estimated that the average 821\nerosion and soil redistribution rate, over the last ca. 35-40 years due to tillage, is ca. 9 822\nt ha-1 yr-1. Long-term erosion rates based on soil profile truncation data demonstrated823\nthat, over the longer term, erosion has been dominantly by water by overland flow.824\n825\nHinz (2004) reported rates of soil loss between 18.6 and 29.5 kg ha-1 for harvesting 826\noperations, and between 0.8 and 1.4 kg ha-1 for normal tillage operations. The latter 827\ndata are for the production of cereals but they may give a good idea of the order of 828\nmagnitude for other adjacent crops. Funk and Reuter (2004) investigated emissions 829\nfor various tillage operations and arrived at values of between 3 and 6 kg ha-1, that is830\nabout 3 times greater than those of Hinz (2004).831\n832\nAt Dalicott Farm in Shropshire (UK), 137Cs data and a numerical erosion model were 833\nused to estimate erosion on a hillslope (Govers et al., 1993; Quine et al., 1994). The 834\nproportions of overall erosion that was caused by water or tillage erosion were 835\nestimated to be similar for the last ca. 6 centuries (57% and 43%, respectively), and 836\ngreater for water erosion over the last 40 years (76% and 24%, respectively), based on 837\n137Cs data.838\n839\n3.2.4 Rates of soil loss by crop harvesting840\nRuysschaert et al. (2004) provided an excellent review of the research on soil loss due 841\nto crop harvesting (SLCH) in Europe. They reported mean losses ranging from 1.3 to 842\n19 t ha-1yr-1 for a variety of crops. SLCH was greatest for chicory, sugar beet and 843\npotatoes. Boardman and Poesen (2006) also reviewed soil loss by crop harvesting,844\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n35\nconfirming the variation in Europe, according to crop types and climate, concluding 845\nthat average values of 2 t ha-1 yr-1 for a potato crop and 9 t ha-1 yr-1 for a sugar beet 846\ncrop can be expected. Soil moisture content at harvest is the driving factor. 847\n848\n849\n850\n3.2.5 Rates of soil loss by slope engineering851\nRecently, P. Bazzoffi (pers.com.) estimated that in Italy the area highly prone to risk 852\nof land levelling is about 10% of the area under permanent crops. After levelling, land 853\nis in a vulnerable condition and a few storms can easily cause severe soil losses. 854\nBazzoffi et al. (1989) measured 454 t ha-1 yr-1 of water erosion with the formation of a 855\ngully after six rainfall events of medium intensity in central Italy.856\n857\nIn Norway during the late 1970s, extensive land levelling was stimulated by subsidies. 858\nThis led to a two- to three-fold increase in soil erosion. The increase was especially 859\nlarge when former ravine landscapes used for pasture were levelled and turned into 860\narable land that was ploughed in autumn. The clearly visible erosion and increasing 861\nnegative offsite effects on water quality, together with overproduction, put an end to 862\nthe subsidies for land levelling, but not before 13% of the agricultural area had been 863\nlevelled with the support of these subsidies. The most visible effect was erosion 864\ncaused by concentrated flow, including severe ‘gullying’ resulting from reduced 865\ninfiltration, longer slopes and inadequate measures to handle concentrated flow (Jones 866\net al., 2004). Now, land levelling is only allowed in Norway with special permission.867\n868\n3.2.6 Overall soil erosion rates869\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n36\nBreshears et al. (2003) researched the relative importance of soil erosion by wind and 870\nby water in a Mediterranean ecosystem and found wind erosion to exceed water 871\nerosion from shrubland and forest sites, but not from a grassland site. Wind-driven 872\ntransport of soil material from horizontal flux measurements were projected to annual 873\ntimescales for shrubland (ca. 55 t ha-1 yr-1), grassland (ca. 5.5 t ha-1 yr-1) and forest (ca. 874\n0.6 t ha-1 yr-1). In a similar study, Goossens et al. (2001) found lower values (ca. 9.5 t 875\nha-1 yr-1) for arable fields in lower Saxony, Germany.876\n877\nOwens et al. (2006a) proposed a tentative comparison between the various forms of 878\nsoil loss, including water erosion processes in England and Wales. The rates quoted 879\nsuggest that the likely range of annual soil loss rates may be similar for all forms of 880\nerosion. There will be temporal and spatial variations in the relative magnitude and 881\nextent of the different processes, with arable land being susceptible to all forms of 882\nerosion, and uncultivated land only at risk of water and, to some extent (i.e. exposed 883\nsandy and peaty soils), wind erosion.884\n885\n3.2.7 Soil erosion rates for Europe886\nIn the context of soil erosion, the true baseline is the amount of soil that is lost from a 887\ndefined spatial unit under current environmental conditions. However, to determine a 888\nuniversal baseline it is not practicable to measure the actual loss of soil caused by 889\nerosion processes over the whole of Europe. It is more realistic to estimate baseline 890\ndata for Europe by modelling the factors known to cause erosion, validating estimated 891\nbaseline soil losses using actual measurements from the few experimental sites that 892\ncurrently exist, and augmenting by measurements from additional ‘benchmark’ sites. 893\nThis leaves the spatial unit over which any baseline would apply undefined.894\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n37\n895\nFor soils under arable land use, several researchers quote soil erosion rates in Europe 896\nof between 10 and 20 t ha-1yr-1 (Richter, 1983; Lal et al., 1998; Yang et al., 2003), 897\nwhereas Arden-Clarke and Evans (1993) report that water erosion rates in Britain vary 898\nfrom 1-20 t ha-1 yr-1 but that the higher rates are rare events and localised. Boardman 899\n(1998) challenged the usefulness of an average rate of soil erosion for Europe, 900\nconcluding that the rates vary too much in time and space to specify precise amounts.901\nThis variation is evident in Table 7 which shows ranges of the mean rates of soil lost 902\nby the recognised erosion types for agricultural land, and the actual soil erosion rates 903\nin tilled, arable agriculture by different combinations of erosion types (ca. 3-40 t ha-904\n1yr-1). Although soil type, slope and climate are important factors, the greater part of 905\nthe actual soil erosion rates relate to soil cover, soil management, and crop 906\nmanagement. These factors can all be influenced by policy measures.907\n908\nTable 7909\n910\n911\n912\n4.   Summary and conclusions913\n914\nFigure 1915\n916\nTolerable soil erosion is a concept that has been developed over the last 60 years. Its 917\ndefinition has been related to the production function of soil by numerous authors. 918\nInclusion of the regulation function of soil was realised, but not implemented in these 919\ndefinitions. Over the last 15 to 20 years a more holistic concept of soil functions has 920\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n38\nbeen developed, which this paper suggests should be applied to defining tolerable soil 921\nerosion: ‘any actual soil erosion rate at which a deterioration or loss of one or more 922\nsoil functions (Table 4) does not occur’, with actual soil erosion meaning ‘the 923\ncumulative amount of soil lost by all recognised erosion types’.924\n925\nSoil formation rates are proposed as a basis for establishing tolerable soil erosion. For 926\nEurope, the current state of scientific knowledge indicates that tolerable soil erosion 927\nrates range from ca. 0.3 – 1.4 t ha-1 yr-1 depending on the driving factors of weathering 928\n(e.g. parent material, climate, land use) and dust deposition (e.g. geographic position; 929\ndistance to source). Relevant local components of soil functions that are impacted by 930\nsoil erosion (e.g. surface water turbidity effects on aquatic wildlife or siltation of 931\nreservoirs) can be used to set tolerable soil erosion rates below the upper limit 932\ndetermined by soil formation rates. 933\n934\nSoil erosion research has focused traditionally on erosion by water (rill, gully etc.) 935\nand, to a lesser extent, by wind. However, over the last 10 - 15 years, the focus has 936\nbroadened to include other important types of erosion, namely tillage erosion, crop 937\nharvesting and slope engineering or land levelling. Estimates of soil erosion rates for 938\nevaluation in a soil monitoring system need to consider all types of erosion, although939\nmitigation should focus on the dominant type in any particular location. For all types 940\nof soil erosion, and particularly wind erosion and land levelling, there is a need for 941\nmore spatially differentiated evidence of current rates.942\n943\nThe range of reported erosion rates for tilled arable soils is many times greater than 944\nthe range of reported soil formation rates. This can be because soil formation is 945\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n39\naffected little by human activities, whereas today most soil erosion is 946\nanthropogenically induced. It should also be noted that soil erosion only appears to 947\nexceed tolerable rates when the soil is under cultivation or affected by other human 948\ndisturbance. Furthermore, Boardman and Poesen (2006) estimated that arable 949\nagriculture accounts for ca. 70% of soil erosion in Europe, while Yang et al. (2003) 950\ndeveloped a coarse-scaled global model from which they estimated that ca. 88% of 951\nsoil erosion in Europe to be human-induced. Figure 1 gives an overview of the 952\nconcept and rates of tolerable soil erosion and actual soil erosion (i.e. ‘the total953\namount of soil lost by all recognised erosion types’), and suggests directions for 954\ndeveloping more detailed tolerable rates by applying the soil function concept and 955\nnumerical soil formation modelling. The right side describes the components of soil 956\nerosion and the reported variation in their rates (mean and maximum). Tolerable soil 957\nerosion rates and approaches for deriving them are described on the left. At present, 958\nbest estimates for mean rates in Europe are ca. 0.3-1.4 t ha-1yr-1 for soil formation and 959\nca. 3-40 t ha-1yr-1 for actual soil erosion. These results are comparable with the 10-40 960\ntimes greater than tolerable global estimate reported by Pimentel (2006). The figure 961\nalso highlights areas for more research. Apart from the need for more detailed and 962\ndifferentiated values for soil erosion and formation rates (experimentally), it is also 963\nneeded to identify yet unknown erosion types and further develop concepts such as 964\nthe soil function system and numerical soil formation models, to implement soil 965\nerosion mitigation policies at appropriate spatial scales (differentiated by dominant 966\nfactors). In addition, soil erosion work and policies should include a wide range of 967\nspatial and temporal scales until the connections between scales are better understood. 968\nClearly, the spatial and temporal variation of tolerance-exceeding soil erosion is 969\nsubstantial and is likely to change, or possibly intensify, when climate and land use 970\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n40\nchange. Therefore, the recommendation from Trimble and Crosson (2000a,b) and 971\nBrazier (2004), that resources should focus more on monitoring soil erosion by field 972\nmeasurements than on modelling, is supported by this review. Ideally, the approaches 973\nto field measurement (e.g. considering scale and spatial heterogeneity) would be 974\ndeveloped in conjunction with process-based models.975\n976\nHowever, if these measured and estimated ranges for soil formation and erosion are 977\ncorrect, and current conditions and management persist (a ‘business as usual’ 978\nscenario), then topsoils of tilled arable land on hill slopes (i.e. not flood plains) in 979\nEurope could be ca. 2 to 30 cm thinner in 100 years time (assuming a blanket 980\ntolerable rate of 1 t ha-1 yr-1 and a bulk density of 1.3 t m-3) than today. Where in the 981\nrange an area will be, depends on physical factors (e.g. climate, drainage, soil texture 982\nand structure) and on land management factors (see Table 7). For many topsoils in 983\nEurope this would mean a substantial deterioration in their production, regulation, 984\nhabitat, and information functions (Table 4), if not a cessation of some of them. For 985\nareas where slope engineering and\/or gully erosion occurs, even more soil could be 986\nlost. Thus, the status quo is not compliant with the intergenerational equity argument, 987\ni.e. that future generations should have the same rights to natural resources as those 988\nenjoyed by the current generation. A substantial effort is required to reduce soil 989\nerosion losses closer to tolerable levels, particularly in tilled, arable agriculture. In the 990\nfuture, climate change looks likely to increase rainfall intensity, if not annual totals, 991\nthereby increasing soil erosion by water, although there is much uncertainty about the 992\nspatio-temporal structure of this change as well as the socio-economic and agronomic 993\nchanges that may accompany them (e.g. Boardman and Favis-Mortlock, 1993; 994\nPhillips et al., 1993; Nearing et al., 2004). Similarly, as a response to climate change, 995\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n41\nsoil formation rates may change and the development of ‘moving tolerable rates’ with 996\nclimate change scenarios may be required to support the policy sector with sound 997\nscientific guidelines.998\n999\nThis review of rates of soil loss by erosion, in the mineral soils of Europe, has 1000\nclarified the tolerable rate of soil erosion to which modern land use systems should 1001\naspire. Furthermore, the evidence of well-founded tolerable rates of soil erosion,1002\nevaluated against actual soil erosion rates, is vital for developing policies to ensure 1003\nthat soil receives a level of protection comparable to that accorded to water and air in 1004\nEurope.1005\n1006\n1007\n1008\nAcknowledgements1009\nThe authors acknowledge the contribution of the Consortium of the ENVASSO 1010\nProject (contract 022713) funded by the European Commission under the 6th1011\nFramework Programme of Research. We are grateful for the valuable comments made 1012\nby two anonymous reviewers.1013\n1014\n1015\nReferences1016\nAbrahams, A.D., Parsons, A.J. and Luk, S.H., 1991. The effect of spatial variability in 1017\noverland flow on the downslope pattern of soil loss on a semi-arid hillslope, 1018\nsouthern Arizona. Catena 18, 255-70.1019\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n42\nAlexander, E.B., 1985. Rates of soil formation from bedrock or consolidated 1020\nsediments. Physical Geography 6(1), 25-42.1021\nAlexander, E.B., 1988a. Rates of Soil Formation - Implications for Soil-Loss 1022\nTolerance. Soil Science 145(1), 37-45.1023\nAlexander, E.B., 1988b. Strategies for Determining Soil-Loss Tolerance. 1024\nEnvironmental Management 12(6), 791-796.1025\nAllton, K.E., 2006. Interactions between soil microbial communities, erodibility and 1026\ntillage practices, PhD thesis, Cranfield University, Cranfield, 224 pp.1027\nArden-Clarke, C. and Evans, R., 1993. Soil erosion and conservation in the United 1028\nKingdom. In: D. Pimentel (Editor), World soil erosion and conservation. 1029\nCambridge University Press, Cambridge, pp. 193-215.1030\nArmstrong, C.L. and Mitchell, J.K., 1987. Transformations of rainfall by plant 1031\ncanopy. Transactions of the Asae 30(3), 688-696.1032\nAspiras, R.B., Allen, O.N., Harris, R.F. and Chesters, G., 1971. The role of 1033\nmicroorganisms in the stabilization of soil aggregates. Soil Biology and 1034\nBiochemistry 3(4), 347-353.1035\nBarring, L., Jonsson, P., Mattsson, J.O. and Ahman, R., 2003. Wind erosion on arable 1036\nland in Scania, Sweden and the relation to the wind climate - a review. Catena 1037\n52(3-4), 173-190.1038\nBazzoffi, P., Chisci, G. and Missere, D., 1989. Influenza delle opere di livellamento e 1039\nscasso sull'erosione del suolo nella collina cesenate. Rivista di Agronomia 3,1040\n231-221.1041\nBennett, H.H., 1939. Soil Conservation. McGraw-Hill, New York and London, pp 1042\n993.1043\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n43\nBetts, H.D. and De Rose, R.C., 1999. Digital elevation models as a tool for 1044\nmonitoring and measuring gully erosion. International Journal of Applied 1045\nEarth Observation and Geoinformation 1, 91–101.1046\nBlong, R.J., Graham, O.P. and Veness, J.A., 1982. The role of sidewall processes in 1047\ngully development; some N.S.W. examples. Earth Surface rocesses and 1048\nLandforms 7, 381-385.1049\nBlum, W.E.H., 1993. Soil protection concept of the council of Europe and integrated 1050\nsoil research. In: H.A.P. Eijsackers and T. Hamers (Editors), Integrated Soil 1051\nand Sediment Research: A Basis for Proper Protection. Kluwer Academic 1052\nPublishers, pp. 37-47.1053\nBlum, W.E.H., 2005. Functions of soil for society and the environment. Reviews in 1054\nEnvironmental Science and Biotechnology 4 (3), 75-79.1055\nBoardman, J., 1998. An average soil erosion rate for Europe: Myth or reality? Journal 1056\nof Soil and Water Conservation 53(1), 46-50.1057\nBoardman, J. and Favismortlock, D.T., 1993. Climate-change and soil-erosion in 1058\nBritain. Geographical Journal 159, 179-183.1059\nBoardman, J. and Poesen, J., 2006. Soil Erosion in Europe. John Wiley & Sons, UK, 1060\n855 pp.1061\nBohner, J., Schafer, W., Conrad, O., Gross, J. and Ringeler, A., 2003. The WEELS 1062\nmodel: methods, results and limitations. Catena 52(3-4), 289-308.1063\nBoix-Fayos, C., Calvo-Cases, A., Imeson, A.C. and Soriano-Soto, M.D., 2001. 1064\nInfluence of soil properties on the aggregation of some Mediterranean soils 1065\nand the use of aggregate size and stability as land degradation indicators. 1066\nCatena 44(1), 47-67.1067\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n44\nBoix-Fayos, C., Martinez-Mena, M., Calvo-Cases, A., Castillo, V. and Albaladejo, J., 1068\n2005. Concise review of interrill erosion studies in SE Spain (Alicante and1069\nMurcia): erosion rates and progress of knowledge from the 1980s. Land 1070\nDegradation & Development 16, 517–528.1071\nBrady, N.C. and Weil, R., 2002. The Nature and Properties of Soils, 10. Prentice-Hall.1072\nBrazier, R., 2004. Quantifying soil erosion by water in the UK: a review of 1073\nmonitoring and modelling approaches. Progress in Physical Geography 28(3),1074\n340-365.1075\nBreshears, D.D., Whicker, J.J., Johansen, M.P. and Pinder, J.E., 2003. Wind and 1076\nwater erosion and transport in semi-arid shrubland, grassland and forest 1077\necosystems: Quantifying dominance of horizontal wind-driven transport. Earth 1078\nSurface Processes and Landforms 28(11), 1189-1209.1079\nBromhead, E.N. and Ibsen, M.L., 2006. A review of landsliding and coastal erosion 1080\ndamage to historic fortifications in South East England. Landslides 3(4), 341-1081\n347.1082\nBryan, R.B., 1968. The development, use and efficiency of indices of soil erodibility. 1083\nGeoderma 2(1), 5-26.1084\nCerdan O., Poesen J., Govers G., Saby N., Le Bissonnais Y., Gobin A., Vacca A., 1085\nQuinton J., Auerswald K., Klik A., Kwaad F.J.P.M., Roxo M.J., 2006. Sheet 1086\nand rill erosion. In: J. Boardman and J. Poesen (Editors), Soil Erosion in 1087\nEurope. Wiley & Sons, Chichester, pp. 501 - 518.1088\nChappell, A., 1999. The limitations of using Cs-137 for estimating soil redistribution 1089\nin semi-arid environments. Geomorphology 29(1-2), 135-152.1090\nChappell, A. and Thomas, A.D., 2002. Modelling to reconstruct recent wind erosion 1091\nhistory of fields in eastern England. In: J.A. Lee and T.M. Zobeck (Editors), 1092\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n45\nICAR5\/GCTE-SEN Joint Conference. USA Publication International Center 1093\nfor Arid and Semiarid Lands Studies, Texas Tech University, Lubbock, Texas, 1094\npp. 309.1095\nChappell, A. and Warren, A., 2003. Spatial scales of Cs-137-derived soil flux by wind 1096\nin a 25 km(2) arable area of eastern England. Catena 52(3-4), 209-234.1097\nChenu, C., 1993. Clay polysaccharide or sand polysaccharide associations as models 1098\nfor the interface between microorganisms and soil - water related properties 1099\nand microstructure. Geoderma 56(1-4), 143-156.1100\nChepil, W.S., 1950. Properties of soil which influence wind erosion. II. Dry aggregate 1101\nstructure as an index of erodibility. Soil Science 69, 403-414.1102\nChepil, W.S., Siddoway, F.H. and Armbrust, D.V., 1964. Wind erodibility of knolly 1103\nterrain. Journal of Soil and Water Conservation 19, 179-181.1104\nCiesiolka, C.A.A. and Rose, C.W., 1998. The measurement of soil erosion. In: 1105\nPenning de Vries, F.W.T., Agus, F. and Kerr, J. (eds) Soil Erosion at Multiple 1106\nScales: Principles and Methods for Assessing Causes and Impact. CAB 1107\nInternational, Wallingford, pp. 287–301.1108\nCooper, C.M., 1993. Biological effects of agriculturally derived surface-water 1109\npollutants on aquatic systems - a review. Journal of Environmental Quality 1110\n22(3), 402-408.1111\nCzarnes, S., Hallett, P.D., Bengough, A.G. and Young, I.M., 2000. Root- and 1112\nmicrobial-derived mucilages affect soil structure and water transport. 1113\nEuropean Journal of Soil Science 51(3), 435-443.1114\nDalmeida, G.A., 1986. A model for saharan dust transport. Journal of Climate and 1115\nApplied Meteorology 25(7), 903-916.1116\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n46\nDe Groot, R.S., Wilson, M.A. and Boumans, R.M.J., 2002. A typology for the 1117\nclassification, description and valuation of ecosystem functions, goods and 1118\nservices. Ecological Economics 41(3), 393-408.1119\nDe Ploey, J., 1981. The ambivalent effect of some factors of erosion. Mémoirs, 1120\nInstitute de Géologie, L’Université de Louvain 31, 171-181.1121\nDe Ploey, J., 1989. A Soil Erosion Map for Western Europe. Catena Verlag.1122\nDe Vente, J., Poesen, J., Verstraeten, G., Van Rompaey, A., and Govers, G., 2008.1123\nSpatially distributed modelling of soil erosion and sediment yield at regional 1124\nscales in Spain. Global and Planetary Change 60 (3-4), 393-415.1125\nDe Vente, J. and Poesen, J., 2005. Predicting soil erosion and sediment yield at the 1126\nbasin scale: scale issues and semi-quantitative models. Earth Science Reviews 1127\n71, 95-125.1128\nDegens, B.P., 1997. Macro-aggregation of soils by biological bonding and binding 1129\nmechanisms and the factors affecting these: A review. Australian Journal of 1130\nSoil Research 35(3), 431-459.1131\nDissmeyer, G.E. and Foster, G.R., 1981. Estimating the cover-management factor-(c) 1132\nin the universal soil loss equation for forest conditions. Journal of Soil and 1133\nWater Conservation 36(4), 235-240.1134\nDoerr, S.H., Shakesby, R.A. and Walsh, R.P.D., 2000. Soil water repellency: its 1135\ncauses, characteristics and hydro-geomorphological significance. Earth-1136\nScience Reviews 51(1-4), 33-65.1137\nDostal, T., Krasa, J., Vaska, J. and Vrana, K., 2004. Map of soil erosion risk and 1138\nsediment transport within the Czech Republic, Department of Drainage and 1139\nLandscape Engineering, Faculty of Civil Engineering, CTU Prague.1140\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n47\nD’Souza, V.P.C. and Morgan, R.P.C., 1976. Laboratory study of effect of slope 1141\nsteepness and curvature on soil erosion. Journal of agricultural engineering 1142\nresearch 21(1), 21-31.1143\nEckelmann, W., Baritz, R., Bialousz, S., Carre, F., Jones, B., Kibblewhite, M., Kozak, 1144\nJ., Le Bas, C., Tóth, G., Várallyay, G., Yli Halla, M. and Zupan, M.., 2006. 1145\nCommon Criteria for Risk Identification according to Soil Threats, European 1146\nSoil Bureau Research Report No. 20, EUR 22185 EN, Office for Official 1147\nPublications of the European Communities, Luxembourg, pp. 94.1148\nEdgerton, D.L., Harris, J.A., Birch, P. and Bullock, P., 1995. Linear relationship 1149\nbetween aggregate stability and microbial biomass in 3 restored soils. Soil 1150\nBiology & Biochemistry 27(11), 1499-1501.1151\nEngelstaedter, S., Tegen, I. and Washington, R., 2006. North African dust emissions 1152\nand transport. Earth-Science Reviews 79(1-2), 73-100.1153\nEnvironment Agency, 2002. Agriculture and natural resources: benefits, costs and 1154\npotential solutions, Bristol, U.K.1155\nEuropean Commission, 2006a. Proposal for a Directive of the European Parliament 1156\nand of the Council establishing a framework for the soil protection of soil and 1157\namending Directive 2004\/35\/EC. COM (2006)232 Brussels, 22\/09\/2006; 30 1158\npp., last accessed: 04\/04\/2007: http:\/\/ec.europa.eu\/environment\/soil\/.1159\nEuropean Commission, 2006b. Communication from the Commission to the Council, 1160\nthe European Parliament, the European Economic and Social Committee and 1161\nthe Committee of the regions: thematic strategy for soil protection. COM 1162\n(2006)231; last accessed 04\/04\/2007: http:\/\/ec.europa.eu\/environment\/soil\/.1163\nEvans, R., 1990. Soils at risk of accelerated erosion in England and Wales. Soil Use 1164\nand Management 6(3), 125-130.1165\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n48\nEvans, R., 1996. Soil Erosion and its Impacts in England and Wales, London.1166\nFAO, 2003. Food Balance Sheet. Last modified 08\/06\/2008:1167\nhttp:\/\/faostat.fao.org\/site\/502\/default.aspx.1168\nForster, S.M., 1989. The role of microorganisms in aggregate formation and soil 1169\nstabilization: types of aggregation. Arid Soil Research 4, 85-98.1170\nFoster, G.R., 1982. Modelling the erosion process. In: C.T. Haan, H.P. Johnson and 1171\nD.J. Brakensiek (Editors), Hydrologic modelling of small watersheds, pp. 297-1172\n380.1173\nFournier, F., 1972. Soil conservation nature and environment series, Council of 1174\nEurope, pp. 320.1175\nFullen, M.A. and Brandsma, R.T., 1995. Property changes by erosion of loamy sand 1176\nsoils in east Shropshire, UK. Soil Technology 8, 1 -15.1177\nFunk, R. and Reuter, H. I. 2004. Dust production from arable land caused by wind 1178\nerosion and tillage operations. In: International Symposium on Sand and Dust 1179\nStorms, Beijing, China, 12-14 September 2004, Abstracts, 64. National 1180\nSatellite Meteorological Center, Beijing, China.1181\nGobin, A., Govers, G., Jones, R.J.A., Kirkby, M.J. and Kosmas, C., 2002. Assessment 1182\nand reporting on soil erosion: Background and workshop report. EEA 1183\nTechnical Report No. 84, 131 pp. Copenhagen.1184\nGobin A., Jones R., Kirkby M., Campling P., Govers G., Kosmas C. and Gentile R.A., 1185\n2004. Pan-European assessment and monitoring of soil erosion by water. 1186\nEnvironmental Science and Policy 7, 25-38.1187\nGoossens, D., Gross, J. and Spaan, W., 2001. Aeolian dust dynamics in agricultural 1188\nland areas in lower Saxony, Germany. Earth Surface Processes and Landforms 1189\n26(7), 701-720.1190\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n49\nGoudie, A.S. and Middleton, N.J., 2001. Saharan dust storms: nature and 1191\nconsequences. Earth-Science Reviews 56(1-4), 179-204.1192\nGovers, G., Gimenez, R. and Van Oost, K., 2007. Rill erosion: Exploring the 1193\nrelationship between experiments, modelling and field observations. Earth-1194\nScience Reviews 84(3-4), 87-102.1195\nGovers, G., Quine, T.A., Desmet, P.J.J. and Walling, D.E., 1996. The relative 1196\ncontribution of soil tillage and overland flow erosion to soil redistribution on 1197\nagricultural land. Earth Surface Processes and Landforms 21, 929-946.1198\nGovers, G., Quine, T.A. and Walling, D.E., 1993. The effect of water erosion and 1199\ntillage movement on hill slope profile development: a comparison of field 1200\nobservations and model results. In: S. Wicherek (Editor), Farm Land Erosion: 1201\nIn Temperate Plains Environments and Hills. Elsevier, pp. 285-300.1202\nGrousset, F.E., Ginoux, P., Bory, A. and Biscaye, P.E., 2003. Case study of a Chinese 1203\ndust plume reaching the French Alps. Geophysical Research Letters 30(6), 10-1204\n1.1205\nGyssels, G., Poesen, J., Bochet, E. and Li, Y., 2005. Impact of plant roots on the 1206\nresistance of soils to erosion by water: a review. Progress in Physical 1207\nGeography 29(2), 189-217.1208\nHallett, P.D. and Young, I.M., 1999. Changes to water repellence of soil aggregates 1209\ncaused by substrate-induced microbial activity. European Journal of Soil 1210\nScience 50(1), 35-40.1211\nHeimsath, A.M., Dietrich, W.E., Nishiizumi, K. and Finkel, R.C., 1997. The soil 1212\nproduction function and landscape equilibrium. Nature 388(6640), 358-361.1213\nHennings, V., 2003. Erosionsgefährdung ackerbaulich genutzter Böden durch Wasser 1214\n(Karte im Maßstab 1:2,750,000), Nationalatlas Bundesrepublik Deutschland, 1215\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n50\nBd. 2: Relief, Boden und Wasser. Inst. für Länderkunde [Hrsg.]. Spektrum 1216\nAkademischer Verlag, Heidelberg-Berlin.1217\nHinz, T., 2004. Agricultural PM10 emission from plant production. Proc. PM 1218\nEmission Inventories Scientific Workshop. Lago Maggiore, Italy, 18. October 1219\n2004.1220\nHolden, J., 2005. Controls of soil pipe frequency in upland blanket peat. Journal of 1221\nGeophysical Research-Earth Surface 110(1), art. no. F01002.1222\nHolden, J. and Burt, T.P., 2002. Infiltration, runoff and sediment production in 1223\nblanket peat catchments: implications of field rainfall simulation experiments. 1224\nHydrological Processes 16(13), 2537-2557.1225\nHoosbeek, M.R. and Bryant, R.B., 1992. Towards the quantitative modeling of 1226\npedogenesis - a review. Geoderma 55(3-4), 183-210.1227\nHorváth, V. and Erödi, B., 1962. Determination of natural slope category limits by 1228\nfunctional identity of erosion intensity. International Association of Scientific 1229\nHydrology Publication 59, 131-143.1230\nHudson, N.W., 1993. Field Measurement of Soil Erosion and Runoff. FAO Soils 1231\nBulletin No. 68. FAO, Rome, pp. 139.1232\nHuggett, R.J., 1998. Soil chronosequences, soil development, and soil evolution: a 1233\ncritical review. Catena 32, 155-172.1234\nHumphreys, G.S. and Wilkinson, M.T., 2007. The soil production function: A brief 1235\nhistory and its rediscovery. Geoderma 139 (1-2), 73-78.1236\nInternational Society of Soil Science (ISSS), 1996. Terminology for Soil Erosion and 1237\nConservation, ITC-Enschede\/ISRIC-Wageningen, The Netherlands, pp 313.1238\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n51\nIsraelevich, P.L., Levin, Z., Joseph, J.H. and Ganor, E., 2002. Desert aerosol transport 1239\nin the Mediterranean region as inferred from the TOMS aerosol index. Journal 1240\nof Geophysical Research D: Atmospheres 107(21), art. no. 4572.1241\nJaggard, K.W., Clark, C.J.A., May, M.J., McCullagh, S. and Draycott, A.P., 1997. 1242\nChanges in the weight and quality of sugarbeet (Beta vulgaris) roots in storage 1243\nclamps on farms. Journal of Agricultural Science 129, 287-301.1244\nJohnson, L.C., 1987. Soil Loss Tolerance - Fact or Myth. Journal of Soil and Water 1245\nConservation 42(3), 155-160.1246\nJones, R.J.A., Le Bissonnais Y., Bazzoffi P., Sanchez Diaz J., Düwel O., Loj G., 1247\nØygarden L., Prasuhn V., Rydell B., Strauss P., Berenyi Uveges J., 1248\nVandekerckhove L. and Yordanov Y., 2004. Nature and Extent of Soil Erosion 1249\nin Europe. In: L. Van-Camp, B. Bujarrabal, A-R Gentile, R.J.A. Jones, L. 1250\nMontanarella, C. Olazabal and S-K Selvaradjou. (2004). Reports of the 1251\nTechnical Working Groups established under the Thematic Strategy for Soil 1252\nProtection. Volume II Erosion. EUR 21319 EN\/2, p.145-185. Office for 1253\nOfficial Publications of the European Communities, Luxembourg.1254\nJones, R.J.A., Le Bas, C., Kozak, J., Düwel, O. and King, D., 2006. Identifying Risk 1255\nAreas for Soil Erosion in Europe. In: W. Eckelmann et al. (Editors), Common 1256\nCriteria for Risk Identification according to Soil Threats, European Soil 1257\nBureau Research Report 20, EUR 22185 EN, 23-33, Office for Official 1258\nPublications of the European Communities, Luxembourg.1259\nKertész, A. and Centeri, C. 2006. Hungary. In: J. Boardman and J. Poesen (Editors), 1260\nSoil Erosion in Europe. Wiley & Sons, Chichester, pp.139-153.1261\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n52\nKetterings, Q.M., Blair, J.M. and Marinissen, J.C.Y., 1997. Effects of earthworms on 1262\nsoil aggregate stability and carbon and nitrogen storage in a legume cover crop 1263\nagroecosystem. Soil Biology & Biochemistry 29(3-4), 401-408.1264\nKibblewhite, M., Rubio, J-L., Kosmas, C., Jones, R., Arrouays, D., Huber, S., and 1265\nVerheijen, F., 2007. Environmental Assessment of Soil for Monitoring 1266\nDesertification in Europe. Eighth session of the Conference of the Parties 1267\n(COP 8) to the United Nations Convention to Combat Desertification 1268\n(UNCCD). Cranfield University, UK, Madrid, Spain, 3 - 14 September 2007,1269\nISBN 1-8713115-97-2, pp. 62.1270\nKiem, R. and Kandeler, E., 1997. Stabilization of aggregates by the microbial biomass 1271\nas affected by soil texture and type. Applied Soil Ecology 5(3), 221-230.1272\nKirkby, M.J., 1969. Erosion by water on hillslopes. In: R.J. Chorley (Editor), Water, 1273\nearth and man, Methuen, London, pp. 588.1274\nKirkby, M.J., Jones, R.J.A., Irvine, B., Gobin, A., Govers, G., Cerdan, O., Van 1275\nRompaey, A. J. J., Le Bissonnais, Y., Daroussin, J., King, D., Montanarella, 1276\nL., Grimm, M., Vieillefont, V., Puigdefabregas, J., Boer, M., Kosmas, C., 1277\nYassoglou, N., Tsara, M., Mantel, S., Van Lynden, G. J., Huting, J., 2004. 1278\nPan-European Soil Erosion Risk Assessment: the PESERA map. Version 1 1279\nOctober 2003. Explanation of Special Publication Ispra 2004 No.73 1280\n(S.P.I.04.73), European Soil Bureau Research Report No.16, EUR 21176. 1281\nLuxembourg: Office for Official Publications of the European Communities; 1282\n2004. 18 pp. 1283\nKirkby, M.J., Le Bissonais, Y., Coulthard, T.J., Daroussin, J. and McMahon, M.D., 1284\n2000. The development of Land Quality Indicators for Soil Degradation by 1285\nWater Erosion.  Agriculture, Ecosystems and Environment 81, 125 – 136.1286\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n53\nKirkby, M., 2001. From plot to continent: reconciling fine and coarse scale erosion 1287\nmodels. In: Stott, D.E., Mohtar, R.H. and Steinhardt, G.C. (eds) Sustaining the 1288\nGlobal Farm. Selected papers from the 10th International Soil Conservation 1289\nOrganisation meeting, held 24–29 May 1999 at Purdue University and USDA-1290\nARS National Soil Erosion Research Laboratory.1291\nKirkby, M.J., Irvine, B.J., Jones, R.J.A., Govers, G., Boer, M., Cerdan, O., Daroussin, 1292\nJ., Gobin, A., Grimm, M., Le Bissonais, Y., Kosmas, C., Mantel, S., 1293\nPuigdefabregas, J. and Van Lynden, G., 2008. The PESERA coarse scale 1294\nerosion model for Europe: I – Model rationale and implementation. European 1295\nJournal of Soil Science 59(6), 1293-1306.1296\nKlingebiel, A.A. and Montgomery, P.H., 1961. Land Capability Classification,1297\nAgricultural Handbook 210, U.S. Department of Agriculture, Washington.1298\nKnighton, D., 1998. Fluvial Forms and Processes: A new perspective. John Wiley and 1299\nSons, New York.1300\nKok, K., Clavaux, M.B.W., Heerebout, W.M. and Bronsveld, K., 1995. Land 1301\ndegradation and land cover change detection using low-resolution satellite 1302\nimages and the CORINE database - A case study in Spain. ITC Journal 3, 217-1303\n228.1304\nLaflen, J.M. and Colvin, T.S., 1981. Effect of crop residue on soil loss from 1305\ncontinuous row cropping. Transactions of the American Society of 1306\nAgricultural Engineers 24(3), 605-609.1307\nLal, R., 1998. Soil erosion impact on agronomic productivity and environment 1308\nquality. Critical Reviews in Plant Sciences 17(4), 319-464.1309\nLal, R. 2001. Soil degradation by erosion. Land Degradation & Development 12(6), 1310\n519 – 539. 1311\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n54\nLang, R.D. and McCaffrey, L.A.H., 1984. Ground cover: its effects on soil loss from 1312\ngrazed runoff plots, Gunnedah. Journal of the Soil Conservation Service NSW 1313\n40, 56-61.1314\nLeBissonnais, Y., 1996. Aggregate stability and assessment of soil crustability and 1315\nerodibility .1. Theory and methodology. European Journal of Soil Science 1316\n47(4), 425-437.1317\nLee, E.M. and Clark, A.R., 2004. Investigation and management of soft cliffs. 1318\nThomas Telford, London,.1319\nLee, E.M. and Jones, D.K.C., 2004. Landslide risk assessment. Thomas Telford, 1320\nLondon, pp. 454.1321\nLindstrom, M.J., Nelson, W.W. and Schumacher, T.E., 1992. Quantifying tillage 1322\nerosion rates due to moldboard plowing. Soil & Tillage Research 24(3), 243-1323\n255.1324\nLindstrom, M.J., Schumacher, J.A. and Schumacher, T.E., 2000. TEP: A Tillage 1325\nErosion Prediction model to calculate soil translocation rates from tillage. 1326\nJournal of Soil and Water Conservation 55(1), 105-108.1327\nLloyd, D.S., 1987. Turbidity as a Water Quality Standard for Salmonid Habitats in 1328\nAlaska. North American Journal of Fisheries Management 7(1), 34-45.1329\nLloyd, D.S., Koenings, J.P. and Laperriere, J.D., 1987. Effects of Turbidity in Fresh 1330\nWaters of Alaska. North American Journal of Fisheries Management 7(1), 18-1331\n33.1332\nLobb, D.A., Kachanoski, R.G. and Miller, M.H., 1995. Tillage translocation and 1333\ntillage erosion on shoulder slope landscape positions measured using cs-137 as 1334\na tracer. Canadian Journal of Soil Science 75(2), 211-218.1335\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n55\nLobb, D.A., Kachanoski, R.G. and Miller, M.H., 1999. Tillage translocation and 1336\ntillage erosion in the complex upland landscapes of southwestern Ontario, 1337\nCanada. Soil & Tillage Research 51(3-4), 189-209.1338\nLöye-Pilot, M.D., Martin, J.M. and Morelli, J., 1986. Influence of saharan dust on the 1339\nrain acidity and atmospheric input to the mediterranean. Nature 321(6068),1340\n427-428.1341\nMannering, J.V., 1981. The use of soil loss tolerances as a strategy for soil 1342\nconservation. In: R.P.C. Morgan (Editor), Soil conservation: problems and 1343\nprospects. John Wiley & Sons, New York, N.Y., pp. 337-349.1344\nMarinissen, J.C.Y., 1994. Earthworm populations and stability of soil-structure in a 1345\nsilt loam soil of a recently reclaimed polder in the Netherlands. Agriculture 1346\nEcosystems & Environment 51(1-2), 75-87.1347\nMartinez-Casasnovas, J.A., Anton-Fernandez, C. and Ramos, M.C., 2003. Sediment 1348\nproduction in large gullies of the Mediterranean area (NE Spain) from high-1349\nresolution digital elevation models and geographical information systems 1350\nanalysis. Earth Surface Processes and Landforms 28, 443-456.1351\nMcHugh, M., Harrod, T. and Morgan, R., 2002. The extent of soil erosion in upland 1352\nEngland and Wales. Earth Surface Processes and Landforms, 27(1): 99-107.1353\nMcInnes, R.G., Tomalin, D. and Jakeways, J. (Eds.), 2000. Coastal change, climate 1354\nand stability. European Commission LIFE project LIFE-97 ENV\/UK\/000510 1355\n(1997-2000), Isle of Wight Council, Isle of Wight, U.K.1356\nMech, S.J. and Free, G.A., 1942. Movement of soil during tillage operations. 1357\nAgricultural Engineering 23, 379-382.1358\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n56\nMeyer, L.D. and Wischmeier, W.H., 1969. Mathematical simulation of the process of 1359\nsoil erosion by water. Transactions of the American Society of Agricultural 1360\nEngineers 12, 754-762.1361\nMeyer, L.D., Foster, G.R. and Römkens, M.J.M., 1975. Source of soil eroded by 1362\nwater from upland slopes, Present and prospective technology for predicting 1363\nsediment yields and sources. USDA-ARS Publication, pp. 177-189.1364\nMiddleton, N.J. and Goudie, A.S., 2001. Saharan dust: sources and trajectories. 1365\nTransactions of the Institute of British Geographers 26(2), 165-181.1366\nMinasny, B. and McBratney, A.B., 2001. A rudimentary mechanistic model for soil 1367\nformation and landscape development II. A two-dimensional model 1368\nincorporating chemical weathering. Geoderma 103(1-2), 161-179.1369\nMinistry of Environment of the Slovak Republic and Slovak Environmental Agency, 1370\n2002. Landscape Atlas of the Slovak Republic. Bratislava and Banska 1371\nBystrica, pp. 344.1372\nMirtskhulava, T.E., 2001. On the maximum soil loss tolerance. Eurasian Soil Science 1373\n34(3), 321-325.1374\nMontanarella, L., Jones, R.J.A. and Hiederer, R. (2006). Distribution of peatland in 1375\nEurope. Mires and Peat 1, 1-10.1376\nMontgomery, D.R., 2007. Soil erosion and agricultural sustainability. Proceedings of 1377\nthe National Academy of Sciences of the United States of America 104(33),1378\n13268-13272.1379\nMorgan, R.P.C., 2005. Soil Erosion and Conservation. Blackwell Publishing, pp. 299.1380\nMorgan, R.P.C., Martin, L. and Noble, C.A., 1986. Soil erosion in the United 1381\nKingdom: a case study from mid-Bedfordshire. Silsoe College Occasional 1382\nPaper 14, Silsoe College, Cranfield University, Silsoe, uk.1383\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n57\nMorgan, R.P.C., Brandt, C.J. and Studdard, M.J., 1988. The role of plant covers in 1384\ncontrolling soil detachment by rainfall. Silsoe College pamphlet.1385\nMorgan, R.P.C., 1987. Sensitivity of European soils to ultimate physical degradation. 1386\nIn: Barth, H. and L’Hermitage, P. (eds) Scientific basis for soil protection in 1387\nthe European Community. Amsterdam, Elsevier Applied Science, 147-157.1388\nMorvan, X, Saby, N.P.A., Arrouays, D., Le Bas, C., Jones, R.J.A., Verheijen, F.G.A., 1389\nBellamy, P.H., Stephens, M., Kibblewhite, M.G., 2008. Soil monitoring in 1390\nEurope: A review of existing systems and requirements for harmonisation. 1391\nScience of The Total Environment 391(1), 1-12.1392\nMusgrave, G.W., 1947. The quantitative evaluation of factors in water erosion: a first 1393\napproximation. Journal of Soil and Water Conservation 2, 133-138.1394\nNachtergaele, J. and Poesen, J., 1999. Assessment of soil losses by ephemeral gully 1395\nerosion using high-atitude (stereo) aerial photographs. Earth Surfaces 1396\nProcesses and Landforms 24, 693-706.1397\nNachtergaele, J., Poesen, J., Steegen, A.,Takken, I., Beuselinck, L., Vandekerckhove, 1398\nL. and Govers, G., 2001. The value of a physically based model versus an 1399\nempirical approach in the prediction of ephemeral gully erosion for loess-1400\nderived soils. Geomorphology 40, 237–252.1401\nNearing, M.A., Foster, G.R., Lane, L.J. and Finkner, S.C., 1989. A process based soil 1402\nerosion model for USDA water erosion prediction project technology. 1403\nTransactions of the American Society of Agricultural Engineers 32, 1587–1404\n1593.1405\nNearing, M.A., Pruski, F.F. and O'Neal, M.R., 2004. Expected climate change1406\nimpacts on soil erosion rates: A review. Journal of Soil and Water 1407\nConservation 59(1), 43-50.1408\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n58\nNewcombe, C.P. and Macdonald, D.D., 1991. Effects of Suspended Sediments on 1409\nAquatic Ecosystems. North American Journal of Fisheries Management 11(1),1410\n72-82.1411\nNikitin, E.D., 2005. Soil Ecology and the Study of Soil Functions. Eurasian Journal of 1412\nSoil Science 38(9), 922-930.1413\nOades, J.M., 1993. The role of biology in the formation, stabilization and degradation 1414\nof soil structure. Geoderma 56(1-4), 377-400.1415\nOsterkamp, W.R. and Toy, T.J. 1997. Geomorphic considerations for erosion 1416\nprediction. Environmental Geology 29, 152–157.1417\nOwens, P.N., Rickson, R.J. and Clarke, M.A., 2006a. Review of how appropriate 1418\ncurrent mechanisms and advice on best practice for control and mitigation of 1419\nerosion is to wind, tillage co-extraction with root vegetables in England and 1420\nWales, and consideration of alternative methods and advice, Cranfield 1421\nUniversity, UK.1422\nhttp:\/\/randd.defra.gov.uk\/Default.aspx?Menu=Menu&Module=More&Locatio1423\nn=None&ProjectID=14183&FromSearch=Y&Publisher=1&SearchText=wind1424\n%20erosion&SortString=ProjectCode&SortOrder=Asc&Paging=10#Descripti1425\non;%20[last%20accessed%2014\/02\/20091426\nOwens, P.N., Rickson, R.J., Clarke, M.A., Dresser, M., Deeks, L.K., Jones, R.J.A., 1427\nWoods, G.A., Van Oost, K. and Quine, T.A., 2006b. Review of the existing 1428\nknowledge base on magnitude, extent, causes and implications of soil loss due 1429\nto wind, tillage and co-extraction with root vegetables in England and Wales, 1430\nand recommendations for research priorities, Cranfield University, UK.1431\nhttp:\/\/randd.defra.gov.uk\/Default.aspx?Menu=Menu&Module=More&Locatio1432\nn=None&ProjectID=14183&FromSearch=Y&Publisher=1&SearchText=wind1433\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n59\n%20erosion&SortString=ProjectCode&SortOrder=Asc&Paging=10#Descripti1434\non;%20[last%20accessed%2014\/02\/20091435\nOwens, P.N., Rickson, R.J., Clarke, M.A., Dresser, M., Deeks, L.K., Jones, R.J.A., 1436\nWoods, G.A., Van Oost, K. and Quine, T.A., 2006c. Scoping study of soil loss 1437\nthrough wind erosion, tillage erosion and soil co-extracted with root 1438\nvegetables, DEFRA Research Project SP08007.1439\nhttp:\/\/randd.defra.gov.uk\/Document.aspx?Document=SP08007_6584_FRA.pd1440\nf1441\nOygarden, L., 2003. Rill and gully development during an extreme winter runoff 1442\nevent in Norway. Catena 50(2-4), 217-242.1443\nPatsukevich, Z.V., Gennadiev, A.N. and Gerasimova, M.I., 1997. Soil loss tolerance 1444\nand self-rehabilitation of soils. Eurasian Soil Science 30(5), 557-5631445\nPhillips, D.L., White, D. and Johnson, B., 1993. Implications of Climate-Change 1446\nScenarios for Soil-Erosion Potential in the USA. Land Degradation and1447\nRehabilitation 4(2), 61-72.1448\nPierce, F.J., Larson, W.E. and Dowdy, R.H., 1984. Soil Loss Tolerance - Maintenance 1449\nof Long-Term Soil Productivity. Journal of Soil and Water Conservation 1450\n39(2), 136-138.1451\nPierson Jr, F.B., van Vactor, S.S., Blackburn, W.H. and Wood, J.C., 1994. 1452\nIncorporating small scale variability into predictions of hydrologic response on 1453\nsagebrush rangelands. In: Blackburn, W.H., Pierson Jr, F.B., Schuman, G.E. 1454\nand Zartman, R. (eds) Variability in Rangeland Water Erosion Processes. 1455\nProceedings of a symposium of the Soil Science Society of America, 1456\nMinneapolis, Minnesota, November, 1992. SSA Special Publication No. 38. 1457\nSSSA, Madison, WI.1458\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n60\nPillans, B., 1997. Soil development at snail's pace: Evidence from a 6 Ma soil 1459\nchronosequence on basalt in north Queensland, Australia. Geoderma 80(1-2), 1460\n117-128.1461\nPimentel, D., 2006. Soil erosion: a food and environmental threat. Environment, 1462\nDevelopment and Sustainability 8, 119-137.1463\nPimentel, D. Harvey, C. Resosudarmo, P., Sinclair, K., Kurz, D., McNair, M., Crist, 1464\nS., Shpritz, L., Fitton, L., Saffouri, R. and Blair, R., 1995. Environmental and 1465\neconomic costs of soil erosion and conservation benefits. Science 267(5201),1466\n1117-1123.1467\nPoesen, J., Nachtergaele, J., Verstraeten, G. and Valentin, C., 2003. Gully erosion and 1468\nenvironmental change: importance and research needs. Catena 50(2-4), 91-1469\n133.1470\nPoesen, J. Vanwalleghem, T., De Vente, J., Knapen, A., Verstraeten, G. and Martinez-1471\nCasasnova, J. A., 2006. Gully erosion in Europe. In: J. Boardman and J. 1472\nPoesen (Editors), Soil Erosion in Europe. Wiley & Sons, Chichester, pp. 515 -1473\n536.1474\nQuine, T.A., Desmet, P., Govers, G., Vandaele, K. and Walling, D., 1994. A 1475\ncomparison of the roles of tillage and water erosion in landform development 1476\nand sediment export on agricultural land, near Leuven, Belgium. In: L.J. 1477\nOlive, R.J. Loughran and J.A. Kesby (Editors), Variability in Stream Erosion 1478\nand Sediment Transport. IAHS Publication, 77-86.1479\nQuine, T.A., Van Oost, K., Walling, D.E. and Owens, P.N., 2006. Development and 1480\napplication of GIS-based models to estimate national rates of soil erosion by 1481\ntillage, wind and root crop harvest, University of Exeter, Exeter.1482\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n61\nQuine, T.A. and Zhang, Y., 2004a. Re-defining tillage erosion: quantifying intensity-1483\ndirection relationships for complex terrain. 1. Derivation of an adirectional soil 1484\ntransport coefficient. Soil Use and Management 20, 114-123.1485\nQuinton, J.N., Edwards, G.M. and Morgan, R.P.C., 1997. The influence of vegetation 1486\nspecies and plant properties on runoff and soil erosion: results from a rainfall 1487\nsimulation study in south east Spain. Soil Use and Management 13(3), 143-1488\n148.1489\nRauws, G. and Govers, G., 1988. Hydraulic and soil mechanical aspects of rill 1490\ngeneration on agricultural soils. Journal of Soil Science 39(1), 111-124.1491\nReheis, M.C. and Kihl, R., 1995. Dust deposition in southern Nevada and California, 1492\n1984-1989 - relations to climate, source area, and source lithology. Journal of 1493\nGeophysical Research-Atmospheres 100(D5), 8893-8918.1494\nRichter, G., 1983. Aspects and problems of soil erosion hazard in the EEC countries. 1495\nIn: A.G. Prendergast (Editor), Soil Erosion. Commission of the European 1496\nCommunities Report No. EUR 8427 EN, pp. 9-17.1497\nRiksen, M., Brouwer, F. and de Graaff, J., 2003. Soil conservation policy measures to 1498\ncontrol wind erosion in northwestern Europe. Catena 52(3-4), 309-326.1499\nRitz, K. and Young, I.M., 2004. Interactions between soil structure and fungi. 1500\nMycologist 18(2), 52-59.1501\nRoose, E., 1996. Land Husbandry: components and strategy. FAO soils Bulletin N° 1502\n70. FAO, Rome, 380 pp.1503\nRuysschaert, G., Poesen, J., Verstraeten, G. and Govers, G., 2004. Soil loss due to 1504\ncrop harvesting: significance and determining factors. Progress in Physical 1505\nGeography 28(4), 467-501.1506\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n62\nRuysschaert, G., Poesen, J., Verstraeten, G. and Govers, G., 2005. Interannual 1507\nvariation of soil losses due to sugar beet harvesting in West Europe. 1508\nAgriculture Ecosystems & Environment 107(4), 317-329.1509\nSánchez, J., Recatalá, L., Colomer, J.C. and Añó, C., 2001. Assessment of soil erosion 1510\nat national level: a comparative analysis for Spain using several existing maps. 1511\nIn: Y. Villacampa, C.A. Brevia and U. J.L. (Editors), Ecosystems and 1512\nSustainable Development III. Advances in Ecological Sciences 10. WITT 1513\nPress, Southampton, pp. 249-258.1514\nSchaller, M., von Blanckenburg, N., Hovius, N. and Kubik, P.W., 2001. Large-scale 1515\nerosion rates from insitu-produced cosmogenic nuclides in European river 1516\nsediments. Earth and Planetary Science Letters 188, 441-458.1517\nSchaub, D. and Prasuhn, V., 1998. A map on soil erosion on arable land as a planning 1518\ntool for sustainable land use in Switzerland. In: H.P. Blume et al. (Editors), 1519\nTowards Sustainable Land Use, Volumes I & II - Furthering Cooperation 1520\nbetween People and Institutions. Advances in Geoecology, pp. 161-168.1521\nSchumm, S.A., Harvey, M.D. and Watson, C.C., 1984. Incised Channels: 1522\nMorphology, dynamics and control. Water Resources Publications, Littleton, 1523\nColorado, U.S.A., pp. 200.1524\nScullion, J. and Malik, A., 2000. Earthworm activity affecting organic matter, 1525\naggregation and microbial activity in soils restored after opencast mining for 1526\ncoal. Soil Biology & Biochemistry 32(1), 119-126.1527\nShakesby, R.A. and Doerr, S.H., 2006. Wildfire as a hydrological and 1528\ngeomorphological agent. Earth-Science Reviews 74(3-4), 269-307.1529\nSimonson, R.W., 1995. Airborne Dust and Its Significance to Soils. Geoderma 65(1-1530\n2), 1-43.1531\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n63\nSkidmore, E.L., 1982. Soil loss tolerance (Chapter 8), Determinants of soil loss 1532\ntolerance. ASA, SSSA, 677 South Segoe Road, Madison, pp. 87-93.1533\nSkidmore, E.L. and Woodruff, N.P., 1968. Wind erosion forces in the United States 1534\nand their use in predicting soil loss. USDA Agricultural Research Service 1535\nHandbook, 346.1536\nSmith, R and Quinton, J.N., 2000. Dynamics and scale in simulating erosion by water. 1537\nIn: Schmidt, J. (ed.) Soil Erosion: Application of Physically Based Models. 1538\nSpringer, Berlin, pp. 282–294.1539\nSoil Science Society of America, 2001. Glossary of Soil Science Terms. Soil Science 1540\nSociety of America, Inc., Madison WI, pp. 140.1541\nSombroek, W. G. (Ed.) and D. Sims (Ed.) (1995). \"Planning for sustainable use of 1542\nland resources: towards a new approach.\" FAO Land and Water Bulletin 1024-1543\n6703 (2), ISBN 92-5-103724-8, FAO, Rome, Italy.1544\nSparovek, G. and De Maria, I.C., 2003. Multiperspective analysis of erosion 1545\ntolerance. Scientia Agricola 60, 409-416.1546\nStamey, W.L. and Smith, R.M., 1964. A conservation definition of erosion tolerance. 1547\nSoil Science 97, 183-186.1548\nStocking, J.M. and Pain, A., 1983. Soil life and the minimum soil depth for 1549\nproductive yields: developing a new concept. Discussion paper 150, School of 1550\ndevelopment studies, University of East Anglia.1551\nSwap, R., Garstang, M., Greco, S., Talbot, R. and Kallberg, P., 1992. Saharan dust in 1552\nthe Amazon basin. Tellus Series B-Chemical and Physical Meteorology 44(2),1553\n133-149.1554\nTemple, D.M., 1982. Flow retardance of submerged grass channel linings. 1555\nTransactions of the Asae 25(5), 1300-1303.1556\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n64\nTemple, P.H. and Rapp, A., 1972. Landslides in the Mgeta area, western Uluguru 1557\nMountains, Tanzania. Geografiska Annaler 54-A, 157-193.1558\nTisdall, J.M. and Oades, J.M., 1982. Organic-matter and water-stable aggregates in 1559\nsoils. Journal of Soil Science 33(2), 141-163.1560\nTrimble, S.W. and Crosson, P., 2000a. Land use - US soil erosion rates - Myth and 1561\nreality. Science 289(5477), 248-250.1562\nTrimble, S.W. and Crosson, P., 2000b. Measurements and models of soil loss rates -1563\nResponse. Science 290(5495), 1301-1301.1564\nTurkelboom, F. and Trebuil, G., 1998. A multi-scale approach for on-farm erosion 1565\nresearch: application to Northern Thailand Highlands. In: Penning de Vries, 1566\nF.W.T., Agus, F. and Kerr, J. (eds) Soil Erosion at Multiple Scales: Principles 1567\nand Methods for Assessing Causes and Impact. CAB International, 1568\nWallingford, pp. 51–72.1569\nValentin, C., Poesen, J. and Yong, L., 2005. Gully erosion: Impacts, factors and 1570\ncontrol. Catena 63, 132 - 153.1571\nVan der Knijff, J.M., Jones, R.J.A. and Montanarella, L., 2002. Soil erosion risk 1572\nassessment in Italy. In: J.L. Rubio, R.P.C. Morgan, S. Asins and V. Andreu 1573\n(Editors), the third International Congress Man and Soil at the Third 1574\nMillennium. Geoforma Ediciones, Logrono, pp. 1903-1913.1575\nVan Muysen, W., Govers, G., Bergkamp, G., Roxo, M. and Poesen, J., 1999. 1576\nMeasurement and modelling of the effects of initial soil conditions and slope 1577\ngradient on soil translocation by tillage. Soil & Tillage Research 51(3-4), 303-1578\n316.1579\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n65\nVan Muysen, W., Van Oost, K. and Govers, G., 2006. Soil translocation resulting 1580\nfrom multiple passes of tillage under normal field operating conditions. Soil 1581\nand Tillage Research 87(2), 218-230.1582\nVan Noordwijk, M., van Roode, M., McCaillie, E.L. and Lusiana, B., 1998. Erosion 1583\nand sedimentation as multi-scale, fractal processes: implications for models, 1584\nexperiment and the real world. In: Penning de Vries, F.W.T., Agus, F. and 1585\nKerr, J. (eds) Soil Erosion at Multiple Scales: Principles and Methods for 1586\nAssessing Causes and Impact. CAB International, Wallingford, pp. 223–253.1587\nVan Oost, K., Govers, G. and Desmet, P., 2000a. Evaluating the effects of changes in 1588\nlandscape structure on soil erosion by water and tillage. Landscape Ecology 1589\n15, 577-589.1590\nVan Oost, K., Govers, G., Van Muysen, W. and Quine, T.A., 2000b. Modeling 1591\ntranslocation and dispersion of soil constituents by tillage on sloping land. Soil 1592\nScience Society of America Journal 64(5), 1733-1739.1593\nVan Oost, K., Govers, G., Quine, T. A., Heckrath, G., Olesen, J. E., De Gryze, S. and 1594\nMerckx, R., 2005a. Landscape-scale modeling of carbon cycling under the 1595\nimpact of soil redistribution: The role of tillage erosion. Global 1596\nBiogeochemical Cycles 19(4), 1733-1739.1597\nVan Oost, K., Van Muysen, W., Govers, G., Deckers, J. and Quine, T.A., 2005b. 1598\nFrom water to tillage erosion dominated landform evolution. Geomorphology 1599\n72(1-4), 193-203.1600\nVan Oost, K., Govers, G., de Alba, S. and Quine, T.A., 2006. Tillage erosion: a 1601\nreview of controlling factors and implications for soil quality. Progress in 1602\nPhysical Geography 30(4), 443-466.1603\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n66\nVan Oost, K., Govers, G., de Alba, S. and Quine, T.A., 2006. Tillage erosion: a 1604\nreview of controlling factors and implications for soil quality. Progress in 1605\nPhysical Geography 30(4), 443-466.1606\nVan Rompaey, A.J.J., Bazzoffi, P., Jones, R.J.A. and Montanarella, L., 2005. 1607\nModeling sediment yields in Italian catchments. Geomorphology 65, 157–169.1608\nVandekerckhove, L., Arnoldussen, A., Bazzoffi, P., Böken, H., Castillo, V., 1609\nCrescimano, G., Düwel, O., Esteve, J.F., Imeson, A., Jarman, R., Jones, , .J.A., 1610\nKobza, J., Lane, M., Le Bissonnais, Y., Loj, G., Owens, P.N., Øygarden, L., 1611\nMollenhauer, K., Prasuln, V., Redfern, P., Sánchez Díaz, J., Strauss, P. and 1612\nÜveges Berényi, J., 2004. Monitoring Soil Erosion in Europe. In: L. Van-1613\nCamp et al. (Editors), Reports of the Technical Working Groups established 1614\nunder the Thematic Strategy for Soil Protection, volume II Erosion, EUR 1615\n21319 EN\/2, Office for Official Publications of the European Communities, 1616\nLuxembourg, pp. 295-309.1617\nVandekerckhove, L., Poesen, J., Oostwoud Wijdenes, D., Gyssels, G., Beuselinck, L. 1618\nand de Luna, E., 2000. Characteristics and controlling factors of bank gullies 1619\nin two semi-arid Mediterranean environments. Geomorphology 33, 37-58.1620\nWakatsuki, T. and Rasyidin, A., 1992. Rates of weathering and soil formation. 1621\nGeoderma 52(3-4), 251-263.1622\nWalling, D.E. 1983., The sediment delivery problem. Journal of Hydrology 65(1-3), 1623\n209-237.1624\nWalling, D.E., 1990. Linking the field to the river: sediment delivery from agricultural 1625\nland. In: J. Boardman, I.D.L. Foster and J.A. Dearing, Editors, Soil Erosion on 1626\nAgricultural Land, Wiley, Chichester, West Sussex, England (1990), pp. 129–1627\n152.1628\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n67\nWarren, A., (Ed.) 2002. Wind erosion on agricultural land in Europe. EUR 20370 EN,1629\nOffice for the Official Publications of the European Communities, 1630\nLuxembourg, pp 76..1631\nWiersum, L.K., 1979. Comparison of the behavior of some root systems under 1632\nrestricted aeration. Netherlands Journal of Agricultural Science 27(1), 92-98.1633\nWilkinson, B.H. and McElroy, B.J., 2007. The impact of humans on continental 1634\nerosion and sedimentation. Geological Society of America Bulletin 119(1-2),1635\n140-156.1636\nWischmeier, W.H. and Smith, D.D. 1958. Rainfall energy and its relationship to soil 1637\nloss. Transactions of the American Geophysical Union 39, 285-291.1638\nWischmeier, W.H., Johnson, C. and Cross, V., 1971. A soil erodibility nomograph for 1639\nfarmland and construction sites. Journal of Soil and Water Conservation 26(5),1640\n189-193.1641\nWischmeier, W.H. and Mannering, J.V., 1969. Relation of soil properties to its 1642\nerodibility. Soil Science Society America Proceedings 33(1), 131-137.1643\nWischmeier, W.H. and Smith, D.D., 1978. Predicting rainfall erosion losses –a guide 1644\nfor conservation planning. In: Agricultural Handbook 537, U.S. Department 1645\nof. Agriculture, Washington.1646\nYang, D., Kanae, S., Oki, T., Koike, T. and Musiake, K., 2003. Global potential soil 1647\nerosion with reference to land use and climate changes. Hydrological 1648\nProcesses 17, 2913-2928.1649\nYoo, K. and Mudd, S.M., 2008. Discrepancy between mineral residence time and soil 1650\nage: Implications for the interpretation of chemical weathering rates. Geology 1651\n36(1), 35-38.1652\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n68\nZachar, D., 1982. Soil erosion (Development in Soil Science 10). Elsevier, 1653\nAmsterdam, pp. 84-86..1654\nZhang, G.S., Chan, K.Y., Oates, A., Heenan, D.P. and Huang, G.B., 2007. 1655\nRelationship between soil structure and runoff\/soil loss after 24 years of 1656\nconservation tillage. Soil & Tillage Research 92(1-2), 122-128.1657\nZingg, A.W., 1940. Degree and length of land slope as it affects soil loss in runoff. 1658\nAgricultural Engineering 21, 59-64.1659\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\nTOLERABLE \nSOIL \nEROSION \nRATE\nACTUAL \nSOIL \nEROSION \nRATE\nNo deterioration \nof soil functions\nSoil formation \nrate\nPractical starting \npoint\nWeathering \nrate\nDust \ndeposition rate\n=\nR\nill\nG\nul\nly\nW\nin\nd\nRegulation\nProduction\nHabitat\nEngineering\nInformation\nt ha-1 yr-1\n≈ 0.1\n≈ 1.5\n≈ 3.0\n≈ 39\n0.1-1.3\n0.0 – 0.2\n0.02 – 1.3\n?\n?\n?\n?\n?\n≈ 8.8\n≈ 455\nT\nill\n≈ 454\nS\nE\nng\n19.0\nC\nro\np\nRill + Gully + Wind + Till + SEng + Crop=\nS\no\nil \nfo\nrm\nat\nio\nn\n m\no\nd\nel\nN\nee\nds\n d\nev\nel\nop\nm\nen\nt\nN\nee\nds\n d\nev\nel\nop\nm\nen\nt\n=\nFORMATION EROSION\nTolerable vs. actual soil erosion, concept and rates. See the text for a detailed explanation. All numbers are \nin t ha-1yr-1. Please see relevant sections of this paper for more detailed information and references. Rill=rill \nand sheet erosion; Gully=gully erosion; Wind=wind erosion; Till=tillage erosion; SEng=erosion by slope \nengineering; Crop=erosion by crop harvesting.\nFigure 1\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\nRange of spatial scales of soil erosion research (Rickson, 2006; after Wickenkamp et al., \n2000).\nErosion research \ntechnique\nArea Dimension \ndescriptors \n(Wickenkamp et al., \n2000)\nDominant processes \noperating\nSelected \nReferences\nSplash cup mm2 Nanoscale Subtope Rain splash dominant; \noverland \nflow\/deposition \nlimited. No gullies, \nstream bank erosion \nor mass movements.\nEllison \n(1944); \nKinnell \n(1974); \nMorgan et \nal. (1988); \nSalles, C. \nand Poesen, \nJ. (2000)\nLaboratory tray cm2 Nanoscale Subtope Rain splash \ndominant?; overland \nflow\/deposition \nlimited. No gullies, \nstream bank erosion \nor mass movements.\nIdowu \n(1996)\nRunoff rig m2 Microscale Tope Rain splash and \noverland flow; some \ndeposition possible. \nNo gullies, stream \nbank erosion or mass \nmovements.\nKamalu \n(1993); \nGovers \n(1989)\nField plot m2 Microscale Tope Rain splash and \noverland flow; some \ndeposition. Some \ngullying and mass \nmovements possible; \nno stream bank \nerosion.\nWischmeier \nand Smith \n(1978); \nCiesiolka \nand Rose \n(1998); \nPierson et \nal. (1994)\nField ha Mesoscale Chore Rain splash, overland \nflow and deposition. \nGullying and mass \nmovements possible. \nNo stream bank \nerosion.\nEvans and \nBoardman \n(1994); \nWalling \nand Quine \n(1991) \nSub-catchment ha –\nkm2\nMesoscale Chore Rain splash, overland \nflow and deposition. \nGullying possible. \nSome stream bank \nerosion.\nHudson \n(1981); \nRapp et al. \n(1972)\nCatchment\/landscape km2 Macroscale Region Rain splash, overland \nflow and deposition. \nSome gullying and \nmass movement \npossible. Stream bank \nerosion.\nDickinson \nand Collins \n(1998)\nTable 1\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\nEstimated annual costs of soil erosion to UK economy in £million (2000 prices)\n£ million % contribution \nfrom agriculture\nSoil organic matter loss, leading to increased emissions of \ncarbon dioxide\n74 95%\nOn-farm costs (additional fertilisers, etc.) 8 100%\nAccidents\/stream channels (i.e. off-site costs mainly related to \nclean-up operations)\n8.2 95%\nEffects of flooding 115 14%\nTOTAL ANNUAL COST (£ million) 205\nSource: Environment Agency (2002).\nTable 2\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\nInterpretations and definitions for ‘tolerable soil erosion’\nTolerable soil erosion - definition Reference\nThe maximum volume of erosion-removed topsoil that provides high, \nor economically feasible, fertility for a long time\nPatsukevich et al., 1997.\nSoil loss balanced by soil formation through weathering of rocks in Roose (1996)\nErosion that does not lead to any appreciable reduction in soil \nproductivity\nin Roose (1996)\nThe maximum rate of soil erosion that permits an optimum level of \ncrop productivity to be sustained economically and indefinitely\nISSS (1996)\nThe average annual soil loss a given soil type may experience and still \nmaintain its productivity over an extended period of time (permissible \nsoil loss)\nKok et al. (1995)\nThe maximum permissible rate of erosion at which soil fertility can be \nmaintained over 20-25 years\nMorgan (2005)\n(i) The maximum average annual soil loss that will allow continuous \ncropping and maintain soil productivity without requiring additional \nmanagement inputs. (ii) The maximum soil erosion loss that is offset \nby the theoretical maximum rate of soil development which will \nmaintain an equilibrium between soil losses and gains\nSSSA (2001)\nRate of soil erosion is not larger than the rate of soil production \n(acceptable rates of soil erosion)\nBoardman and Poesen (2006)\nTable 3\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\nHarmonised primary soil functions scheme. \nPrimary soil \nfunctions\nComponents\nHabitat Refugium function; nursery function; medicinal \nresources; gene pool; seed bank\nInformation Cultural information (archaeological and\npalaeontological); science and education; spiritual and \nhistoric; recreation; aesthetic information\nProduction Food; fodder; fibre; raw materials; renewable energy \nEngineering Technical, industrial and socio-economic structures\nRegulation Gas regulation; climate regulation; disturbance \nresistance; disturbance resilience; water supply; water \nfiltering; pH buffering; biotransformation of organic \ncarbon; soil retention; soil formation; nutrient regulation; \nbiological control; waste and pollution control\nTable 4\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\nReported soil formation rates by weathering (large scale); na=not available.\nMethodology Spatial scale Temporal \nscale\nLower limit Upper \nlimit\nReference\nMass balance (Si)\nNon-carbonate; \nnon-arable; North \nAmerica, Europe, \nAustralia \n(Victoria), \nZimbabwe\nna 0.02 1.27\nAlexander \n(1988a)\nMass balance (Al, Fe, \nCa, K, Mg, Na, Si)\nGlobal 0.37 1.29\nWakatsuki \nand \nRasyidin \n(1992)\nIn situ cosmogenic \n10Be and 26Al\nNorthern California na 0.39 0.91\nHeimsath et \nal. (1997)\nIn situ cosmogenic \n10Be\nMiddle European \nrivers\n10-40 Kyr 0.26 1.3\n(Schaller et \nal. (2001)\nContinental scale \nerosion\/sedimentation\nGlobal 542 Myr 0.4 1.4\nWilkinson \nand \nMcElroy \n(2007)\nNa USA na 0.3 1.1\nBennett \n(1939)\nTable 5\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\nSoil formation rates by dust deposition \n(adapted from Goudie and Middleton, \n2001)\nLocation Dust deposition\n(t ha-1 yr-1)\nAegean Sea 0.112 -  0.365\nSouthern Sardinia 0.06 – 0.13\nSwiss Alps 0.004\nFrench Alps 0.002\nNE Spain 0.051\nCorsica 0.12\nCorsica 0.125\nCentral France 0.01\nCrete 0.1 – 1.0\nCrete 0.195\nPyrenees 0.30 – 0.39\nTable 6\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\nActual soil erosion rates in Europe (tolerable rate < 1.0 t ha-1 yr-1). For references, please see \nrelevant sections in this paper.\nErosion type Mean rates\n(t ha-1 yr-1)\nMaximum rates \n(t ha-1 yr-1)\ncomment Main factors\nRill, sheet \nerosion\n0.1 - 8.8 23.4 Land use, soil cover, \nslope\nGullies na 455 Climate, land use\nWind erosion 0.1 - 2.0 15 Soil type, soil cover, \nclimate\nTillage erosion 3.0 - 9.0 na Soil management\nSlope \nengineering\nna 454 Soil management\nCrop harvesting 1.3 – 19.0 na For a variety \nof crops\nCrop type (Table 6); \nsoil moisture content \nat time of harvesting\nCumulative \nmean soil erosion \nrates in tilled \nagriculture\n3.0 - 10.0\n3.2 - 19.8\n4.5 – 38.8\nna Tillage only\nWater + wind + tillage\nWater + wind + tillage + crop \nharvesting\n    na = not available\nTable 7\n"}