{"doi":"10.1063\/1.2199531","coreId":"101033","oai":"oai:epubs.surrey.ac.uk:437","identifiers":["oai:epubs.surrey.ac.uk:437","10.1063\/1.2199531"],"title":"Solvation pressure in chloroform","authors":["Hubel, H","Faux, DA","Jones, RB","Dunstan, DJ"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-05-28","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:437<\/identifier><datestamp>\n      2017-10-31T13:58:13Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:7468656F7279636F6D707574696E67<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/437\/<\/dc:relation><dc:title>\n        Solvation pressure in chloroform<\/dc:title><dc:creator>\n        Hubel, H<\/dc:creator><dc:creator>\n        Faux, DA<\/dc:creator><dc:creator>\n        Jones, RB<\/dc:creator><dc:creator>\n        Dunstan, DJ<\/dc:creator><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2006-05-28<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/437\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Hubel, H, Faux, DA, Jones, RB and Dunstan, DJ  (2006) Solvation pressure in chloroform   JOURNAL OF CHEMICAL PHYSICS, 124 (20), ARTN 2.       <\/dc:identifier><dc:relation>\n        10.1063\/1.2199531<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/437\/","10.1063\/1.2199531"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"THE JOURNAL OF CHEMICAL PHYSICS 124, 204506 \u00012006\u0002Solvation pressure in chloroform\nH. Hubel\nPhysics Department, Queen Mary, University of London, London E1 4NS, United Kingdom\nD. A. Fauxa\u0001\nAdvanced Technology Institute, University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom\nR. B. Jones and D. J. Dunstan\nPhysics Department, Queen Mary, University of London, London E1 4NS, United Kingdom\n\u0001Received 10 August 2005; accepted 3 April 2006; published online 25 May 2006\u0002\nMolecular dynamics \u0001MD\u0002 simulations of chloroform vapor and liquid at normal temperature and\npressure and liquid under hydrostatic pressure are presented, giving bond lengths and vibrational\nfrequencies as functions of pressure. The change in bond lengths between vapor and liquid at normal\ntemperature and pressure is consistent with a pressure equivalent to the cohesive energy density\n\u0001CED\u0002 of the liquid, supporting the solvation pressure model which predicts that solvated molecules\nor nanoparticles experience a pressure equal to the CED of the liquid. Experimental data for certain\nRaman frequencies of chloroform in the vapor phase, in the liquid, and in the liquid under pressure\nare presented and compared to MD. Results for C–Cl vibrational modes are in general agreement\nwith the solvation pressure model whereas frequencies associated with the C–H bond are not. The\nresults demonstrate that masking interactions exist in the real liquid that can be reduced or\neliminated in simplified simulations. © 2006 American Institute of Physics.\n\u0003DOI: 10.1063\/1.2199531\u0004I. INTRODUCTION\nTwo of the oldest problems in molecular spectroscopy\nare the shift in infrared absorption bands from the vapor to\nthe liquid when a molecule is solvated1 and the concomitant\nchange in interatomic bond lengths.2 These are usually blue-\nshifts of the vibrational frequency indicating bond compres-\nsion but sometimes redshifts indicating bond stretching. The-\noretical models have focused on the properties of the solute\nmolecule and how it is affected by solvent-solute interactions\nsince the early model of Onsager3 and Bauer and Magat4\nwho proposed that the dielectric constant of the solvent af-\nfects the solute. Following Buckingham et al.,5 Schweizer\nand Chandler6 developed a statistical mechanical theory in-\nvoking competition between short-range and long-range\nsolvent-solute interactions, with a hard-sphere model for the\nshort-range interactions. This theory has been developed fur-\nther by many authors.2,7 Good agreement with experiment\nhas often been found, but with sensitive dependence on fit-\nting parameters such as the hard-sphere radius of the solvent\nand the length scales of attractive solvent-solute\ninteractions.7 These theoretical approaches neglect solvent-\nsolvent interactions except indirectly as they determine, for\nexample, the density of the solvent.\nIn this paper, we adopt a complementary approach to\nunderstanding the way vibrational frequencies associated\nwith molecular bonds change when the molecules are sol-\nvated. Instead of decomposing the often complex solvent-\nsolute interactions into bond-lengthening and bond-\nshortening contributions, it is shown that experimental\na\u0002Electronic mail: d.faux@surrey.ac.uk\n0021-9606\/2006\/124\u000220\u0001\/204506\/7\/$23.00 124, 2045\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject toresults can also be interpreted in terms of a general solvation\npressure added to atom-specific masking interactions. It is\nshown that for certain vibrational frequencies, the solvation\npressure is sufficient to describe quantitatively the change in\nvibrational frequency associated with the bond shortening of\nmolecular bonds from the vapor to the liquid without re-\ncourse to masking interactions. However, atom-specific\nmasking interactions are required to explain the behavior of\ncertain bond types, such as those affected by hydrogen bond-\ning, where the vibrational properties of a bond are especially\nsensitive to the local environment or where a liquid mixture\nexhibits nonrandom structure. The nature of the masking in-\nteractions may be elucidated by molecular dynamics simula-\ntion although it is plausible, also, that the decomposition of\nthe system interactions into solvation pressure plus masking\ninteractions could also be achieved using the statistical me-\nchanical theory of Schweizer and Chandler,6 adapted to in-\nclude solvent-solvent effects.\nThe solvation pressure is a ubiquitous pressure experi-\nenced by all nanoparticles immersed in a solvent and is equal\nto the cohesive energy density \u0001CED\u0002 of the liquid. The CED\nis defined as the heat of vaporization per unit volume:\nCED =\n\u0001Uvap\nVL\n, \u00011\u0002\nwhere \u0001Uvap is the internal energy change on vaporization\nand VL is the volume of the liquid. The CED is also the\nsquare of the Hildebrand solubility parameter, which is used\nin determining the energetics of mixing.8 The CED is well\nknown for a range of liquids, for example, 7 kbars for etha-\n9\nnol, 23 kbars for water, and 3.6 kbars for chloroform.\n© 2006 American Institute of Physics06-1\n AIP license or copyright; see http:\/\/jcp.aip.org\/jcp\/copyright.jsp\n204506-2 Hubel et al. J. Chem. Phys. 124, 204506 \u00022006\u0001The change in bond length due to the solvation pressure\ndepends on the properties of the solvent only. All solutes\nexperience the same solvation pressure and so the solute\nmolecule simply acts as a pressure gauge. In the case of pure\nliquids, each molecule can be considered to be a solute mol-\necule in a solvent of its own type. Good evidence that sol-\nvents exert a pressure on solute molecules and nanoparticles\nexists for carbon nanotubes,10 cosolvent molecules, and\nstarch grains.11\nThe effect of solvation pressure is to shorten the mean\nlength of bonds and hence to increase the Raman frequencies\nassociated with certain bond vibrations. If the solvation pres-\nsure was the only influence on a bond then, taking chloro-\nform as an example, the shift in the vibrational frequencies in\ngoing from the vapor to the liquid should equal that due to\n3.6 kbars of pressure, where 3.6 kbars is the CED for chlo-\nroform. In other words, the bonds should shorten from chlo-\nroform vapor to liquid by an amount equivalent to 3.6 kbars\nof hydrostatic pressure applied externally to the liquid. This\ninterpretation will be referred to as the solvation pressure\nmodel, or SPM for brevity. The solvation pressure effect\nmust have profound effects in wet chemistry and biochemis-\ntry because although solvents of course have specific inter-\nactions with solutes, these will be superposed on general\neffects equivalent to large external positive and negative\npressures.12\nThe SPM has been tested previously using molecular\ndynamics \u0001MD\u0002 simulations and, experimentally, using Ra-\nman spectroscopy.11,12 MD simulations allow the bond\nlengths of molecules in the liquid or vapor state to be directly\ncompared. Raman spectroscopy allows the effect of a change\nin bond length to be observed through the change in peak\nposition of certain vibrational modes. Moreover, observation\nof these changes with the application of hydrostatic pressure\nallows the magnitude of the vapor-liquid changes to be cali-\nbrated with pressure, enabling the ansatz that the solvation\npressure is equal to the CED to be tested. For example, MD\nsimulations of ethanol demonstrated that the shortening of\nmost bond lengths in the liquid compared to the vapor was\nconsistent with 7 kbars of hydrostatic pressure, approxi-\nmately equal in magnitude to the CED.11\nQuantitative agreement between experiment and the\nSPM exists for many Raman frequencies and for other ef-\nfects such as starch gelation,11 but there are also discrepan-\ncies for many other data. Differences from the simple pre-\ndictions of the SPM can be attributed to specific solvent-\nsolute interactions.11 We refer to these as “masking\ninteractions” and these interactions would, of course, be rep-\nlicated by a fully accurate MD simulation. In ethanol, for\nexample, those bonds affected by the hydrogen-bonding in-\nteractions associated with the OH group revealed the greatest\ndiscrepancy from the simple SPM and hence the most sig-\nnificant masking interactions.\nIn this paper, we present experimental and theoretical\ndata for chloroform and test the solvation pressure plus\nmasking interaction approach to the analysis of the change in\nvibrational frequencies of a solute. We report a MD study of\nchloroform vapor, liquid, and liquid under pressure and we\ncompare the results with experimental data on the vapor, on\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject tothe liquid at ambient pressure, and on the liquid under high\npressure in a diamond-anvil cell. MD simulations reproduce\nthe density, bulk modulus, and compressibility of chloro-\nform, demonstrating that the interatomic potentials are of\ngood quality, yet the MD simulations do not reproduce the\nbehavior of certain vibrational modes, suggesting that the\ngeneric intramolecular potentials are not sufficiently opti-\nmized for chloroform, especially with respect to the H atom.\nWe argue that the simplifications inherent to the MD model,\nin particular, the use of pressure-independent potentials, have\nremoved some masking interactions, leaving the ubiquitous\neffects of solvation pressure clearly revealed. The change in\nbond lengths between vapor and liquid, however, clearly\ndemonstrates the solvation pressure effect.\nThe paper is organized as follows. Details of the MD\nsimulations are presented in the following section and the\nresults are analyzed in tandem with experimental results for\nchloroform in Sec. III where we show that the MD model of\nchloroform provides good agreement with the predictions of\nthe SPM and that the experimental results produce consistent\nagreement for some bonds, but not others, particularly with\nvibrations associated with the H atom. The conclusions are\npresented in Sec. IV.\nII. MOLECULAR DYNAMICS SIMULATION\nA. Simulation of liquid chloroform\nWe used the MD package DLPOLY2,13 as this program is\nwell supported and has been used successfully for a range of\nsimple atomic and molecular systems. For liquid chloroform,\nthe simulation volume is a cube with periodic boundary con-\nditions, initialized with 100 CCl3H molecules randomly ori-\nented at random positions with each molecule at a sufficient\ndistance from neighboring molecules to ensure that the inter-\nmolecular forces are not strong enough to cause molecular\nbreakup during the initial phase of the equilibration. At this\nstage, the density is about 25% less than the experimental\nvalue for CCl3H at STP.\nThe system energy was minimized by running at zero\nKelvin for 5\u0002105 time steps of 0.2 fs. Then the temperature\nwas raised in steps of 50 K using successive runs of\n2\u0002105 time steps as an NVT ensemble \u0001constant number of\nmolecules, volume, and temperature\u0002 using the Nosé-Hoover\nthermostat and equilibrated at 298 K over a final 1\u0002105\ntime steps. This produces a system of 100 chloroform mol-\necules equilibrated at room temperature but at a density 25%\nlower than the experimental value.\nThe volume was reduced by allowing the simulation cell\nto shrink during an NPT run \u0001constant number, pressure, and\ntemperature\u0002 of 2\u0002104 shorter time steps of 0.0002 fs. The\nshort time step ensures that the rate of contraction is slow\nenough to avoid the large intermolecular forces that can lead\nto the system becoming unstable. The target pressure speci-\nfied for the NPT ensemble was 30 kbars, but this pressure is\nnot reached due to the short duration of the NPT run. In-\nstead, a contraction of the cell by about 0.01 nm is achieved.\nThe ensemble was then equilibrated at 298 K as an NVT\n5ensemble over 1\u000210 time steps of 0.2 fs.\n AIP license or copyright; see http:\/\/jcp.aip.org\/jcp\/copyright.jsp\n204506-3 Solvation pressure in chloroform J. Chem. Phys. 124, 204506 \u00022006\u0001Data were sampled in an NVE \u0001constant number, vol-\nume, and energy\u0002 run of 1\u0002105 time steps with thermody-\nnamic data acquired at every time step, while atomic posi-\ntions and velocities were acquired every 25 time steps. The\nNVE ensemble is used for the data acquisition because the\nNosé-Hoover thermostat used for an NVT ensemble scales\nthe atomic velocities and the Berendsen barostat used for an\nNPT ensemble scales the cell volume, and consequently the\nbond lengths. Both the thermostat and the barostat thus in-\nterfere with a quantity that we wish to measure.\nRepetition of the NPT-NVT-NVE cycle enables data to\nbe obtained at different volumes \u0001and hence pressures\u0002. In\neach case, the mean temperature and mean pressure were\nmonitored during the NVE runs to assess the state of equi-\nlibrium in each case. The mean temperature was close to\n298 K and no pressure drift was observed, confirming that\neach system was properly equilibrated during the NVT run.\nB. Simulation of chloroform vapor\nMD simulations of chloroform vapor at NTP are under-\ntaken so that the bond lengths and positions of the Raman\npeaks can be compared to the liquid at NTP. The solvation\npressure experienced by each liquid molecule is reflected by\na shortening of the mean bond lengths compared to the vapor\nand can be observed directly. The change in bond length can\nthen be compared to such changes due to the application of\nhydrostatic pressure to the liquid in simulations described in\nthe previous section.\nThe vapor is modeled by placing a single chloroform\nmolecule in a simulation cell and employing the NVE en-\nsemble. The cell is sufficiently large that any interaction be-\ntween the molecule and its images due to periodic boundary\nconditions is negligible. A larger number of time steps are\nrequired for a run, typically 108, in order to extract data with\ngood statistics. The temperature fluctuated by about 100 K\nduring the simulations with the mean temperatures of each\nrun lying in the range of 250–350 K.\nC. The potentials\nThe Dreiding potentials were used to describe the intra-\n14\nTABLE I. The intermolecular and intramolecular Dre\nhave units of kcal\/mol, r0 and \u0005 have units of Å, an\nSame molecule\nC Cl H\nC N\/A Morse Mors\nE0=70.0 E0=70\nk=2.236 k=2.2\nr0=1.757 r0=1.0\nCl Angle Angl\nK=100 K=10\n\u00030=109.47° \u00030=109\nH N\/Aand intermolecular forces. This is a simple set of potentials\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject towith parameters that have been optimized against a broad\nrange of properties for small molecules. We used the Morse\npotential for the intramolecular bonds, given by\nU = E0\u0003\u00011 − e−k\u0001r−r0\u0002\u00022 − 1\u0004 , \u00012\u0002\nwhere r is the separation between a pair of atoms and values\nof E0, k, and r0 are presented in Table I. Valence bond-angle\npotentials have the form\nU = 12K\u0001\u0003ijk − \u00030\u0002\n2\n, \u00013\u0002\nwhere \u0003ijk is the angle subtended at atom j by atoms i and k\nand the parameters K and \u00030 are again presented in Table I.\nThe Lennard-Jones potential was used for intermolecular in-\nteractions, with\nU = 4\u0004\u0005\u0006\u0005\nr\n\u000712 − \u0006\u0005\nr\n\u00076\b , \u00014\u0002\nwith values of \u0004 and \u0005 listed in Table I. Finally, the Coulomb\npotential was included, with Gasteiger15 charges for C of\n+0.1801e, for Cl of −0.0874e, and for H of +0.0821e.\nIII. RESULTS\nA. Bulk properties of chloroform\nIt is important to compare physical quantities for bulk\nchloroform obtained from the MD model with experimental\nvalues to assess the quality of the Dreiding potentials for\nchloroform. Results are summarized in Table II.\nThe density of chloroform at NTP is 1390 kg m−3, in\nreasonable agreement with the experimental value of\n1480 kg m−3. The difference, about 6%, is typical of a MD\nsimulation of a liquid. The CED was calculated by using the\ndifference of the configurational energy between the liquid\nand the vapor state. The configurational energy is the poten-\ntial energy due to inter- and intramolecular forces. The CED\nis found to be 3.49 kbars which is in very good agreement\nwith the experimental value of 3.61 kbars.\nPrevious MD simulations of hydrocarbons16,17 have\nshown a strong correlation between the CED and the internal\npotentials used in the MD simulations. E0, K, and \u0004\nas units of Å−1.\nOther molecules\nC Cl H\nLJ LJ LJ\n\u0005=3.473 \u0005=3.496 \u0005=3.144\n\u0004=0.095 \u0004=0.164 \u0004=0.038\nLJ LJ\n\u0005=3.519 \u0005=3.165\n\u0004=0.283 \u0004=0.066\nLJ\n\u0005=2.846\n\u0004=0.015iding\nd k h\ne\n.0\n36\n90\ne\n0\n.47°pressure \u0006i where,\n AIP license or copyright; see http:\/\/jcp.aip.org\/jcp\/copyright.jsp\n204506-4 Hubel et al. J. Chem. Phys. 124, 204506 \u00022006\u0001\u0006i = \u0006 \u0003U\u0003V \u0007T. \u00015\u0002\nFor most polymers \u0006i is used since it is impossible to mea-\nsure the heat of vaporization. For the calculation of the in-\nternal pressure \u0006i, only the configurational energy was used.\nThe kinetic energy is a function of T only and can therefore\nbe ignored. The configurational energy was plotted as a func-\ntion of volume for pressures less than 6.8 kbars and fitted\nwith a straight line. The slope, \u0006i, was found to be\n3.44 kbars, very close to the value of the CED. This comes\nas no surprise as the equivalence of CED and \u0006i is well\nknown for molecules of spherical symmetry which interact\nonly through dispersive forces.18,19\nThe bulk modulus was found at two pressures by fitting\nthe pressure and volume data to the Murnaghan equation of\nstate,\nP =\nB0\nB\u0001\n\u0006\u0006 V0V\u0001P\u0002\u0007B\u0001 − 1\u0007 , \u00016\u0002\nwhere B is the bulk modulus, the subscript 0 refers to NTP,\nand B\u0001 is the pressure coefficient of the bulk modulus.9 Once\nagain, the agreement between simulation and experiment is\nvery satisfactory.\nThe radial distribution functions \u0001RDFs\u0002 of the liquid are\nobtained at NTP and the first peak position for the Cl–Cl and\nCl–H RDFs are presented in Table II. The simulation slightly\noverestimates the Cl–H peak position. Overall, the agree-\nment is as good as can be expected using the generic Dre-\niding potentials.\nB. Bond lengths\nIn Fig. 1 the mean C–Cl and C–H bond lengths obtained\nfrom the MD simulations are plotted against the pressure for\nthe chloroform liquid. Consistent with the SPM, we have\nadopted the practice of plotting the results of the liquid simu-\nlation at NTP at 0 kbar. Thus the bond lengths in the vapor\nphase, which are also shown, are plotted at the negative pres-\nsure corresponding to the simulated CED. Strictly, in the\nSPM, the molecules are under zero total pressure in the gas\nTABLE II. Comparison of some experimental and\ncohesive energy density is 1 kbar=105 J m−3.\nDensity \u0001kg m−3\u0002\nCohesive energy density \u0001kbar\u0002\nInternal pressure \u0006i \u0001kbar\u0002\nBulk modulus at 1 bar \u0001GPa\u0002\nBulk modulus at 1 kbar \u0001GPa\u0002\nRDF Cl–Cl \u0001Å\u0002\nRFD Cl–H \u0001Å\u0002\n251 cm−1 mode \u0007 \u0001kb\n\b \u0001kb\n368 cm−1 mode \u0007 \u0001kb\n\b \u0001kbphase and under the solvation pressure in the liquid at NTP.\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject toHowever, it is convenient to place the zero of the pressure\naxis for the liquid at NTP and we do this in all the relevant\nfigures below.\nThe mean C–Cl and C–H bond lengths in the chloroform\nliquid at NTP are shorter than for the vapor, clearly demon-\nstrating the solvation pressure effect. The C–Cl bond length\nappears to respond to solvation pressure in the same manner\nas applied hydrostatic pressure, since the bond length in the\nvapor lies, within error, on the trend line of the high-pressure\ndata. The C–H bond does not agree so well, but still lies near\nthe trend line. The uncertainty in the mean C–H bond length\nis large in the vapor phase due to the larger vibrations asso-\nciated with its small mass of H. The C–H bond shortens\nslightly less under applied hydrostatic pressure then is con-\nsistent with the shortening from vapor to liquid due to sol-\nvation pressure, but later results show that it is the hydrogen\natom that is implicated in the masking interaction.\nC. Pressure dependence of the Raman frequencies\nThe vibrational spectrum is obtained as the power spec-\ntrum of the ensemble, defined as the Fourier transform of the\nvelocity autocorrelation function. The sampling period of 25\ntime steps \u00015 fs\u0002 is less than half the period of the highest\nvibrational frequency expected to be present \u00013000 cm−1\u0002, so\navoiding aliasing.\nThe vibrational spectrum of the model is compared with\nthe Raman spectrum of liquid chloroform in Fig. 2. The\npeaks obtained from the MD simulations correspond to ex-\nperimental peaks with discrepancies of up to 100 cm−1 to be\nexpected. Our simulation has four Raman peaks with dis-\nvalues for chloroform. Note that the unit for the\nExperiment MD\n1480 1390±10\n3.61 3.49±0.06\n3.69 3.44±0.14\n1 1.0±0.1\n1.87 1.77±0.14\n3.85 3.8\n3 3.3\n0.74 0.81\n−0.021 −0.025\n0.37 0.70\n−0.008 −0.018\nFIG. 1. Simulated bond lengths for the chloroform molecule in the liquid\nphase as a function of pressure \u0001\u0001\u0002. The bond lengths of an isolated mol-MD\nar−1\u0002\nar−2\u0002\nar−1\u0002\nar−2\u0002ecule \u0001\u0002\u0002 are plotted at −3.49 kbars.\n AIP license or copyright; see http:\/\/jcp.aip.org\/jcp\/copyright.jsp\n204506-5 Solvation pressure in chloroform J. Chem. Phys. 124, 204506 \u00022006\u0001crepancies less than 100 cm−1 and two \u0001C–H bending and\nC–Cl antisymmetric stretch\u0002 with larger discrepancies. This\nis adequate for our purposes. In the figures below, the simu-\nlated peaks are shifted to coincide with the experimental\npeaks at the zero of the pressure axis. Since it is only the\nshifts with pressure and solvation that matter, this is equiva-\nlent to plotting the frequency shifts \u0001\t.\nFigures 3–5 show the frequencies of the six strong peaks\nin the chloroform spectrum of Fig. 2 plotted as a function of\npressure, together with the corresponding peaks in the vibra-\ntional spectrum of the MD simulation. The frequencies in the\nvapor phase are also shown, plotted at the negative pressure\ncorresponding to the simulated CED. For the 261 cm−1 anti-\nsymmetric C–Cl bending mode \u0003Fig. 3\u0001a\u0002\u0004, agreement be-\ntween MD and experiment is excellent. Quadratic fits to the\nexperimental and MD pressure data were made \u0001the fit pa-\nrameters are in Table II\u0002 and the MD fit is plotted on the\nfigure. Note that the MD vapor point falls very close to the\nfit, extrapolated to negative pressure. This peak was not ob-\nserved in the experiment in the vapor. This result is as pre-\ndicted by the SPM.\nFor the 368 cm−1 symmetric C–Cl bending mode \u0003Fig.\n3\u0001b\u0002\u0004, the agreement between experiment and MD is reason-\nable. Agreement could be improved by using a more accurate\nvalue of K, the parameter defining the valence bond-angle\npotential. However, the important result is that both the ex-\nperimental and MD vapor points fall very close to their re-\nspective quadratic fits to the pressure data. That is, both ex-\nperiment and MD agree well with the predictions of the\nSPM.\nFigure 4 shows the Raman peak position of the 667 cm−1\nsymmetric and the 757 cm−1 antisymmetric C–Cl modes for\nthe vapor and for the liquid as a function of pressure. Once\nagain, the MD vapor points lie very close to the quadratic fits\nto the MD pressure data as predicted by the SPM. The ex-\nperimental data show that the peak position increases with\npressure but to a much lesser extent than predicted by the\nMD simulations. It is clear that the Dreiding potentials omit\nsome terms that soften these specific modes when the bond\nFIG. 2. Experimental Raman spectrum of chloroform liquid at ambient pres-\nsure \u0001solid line\u0002 and the power spectrum as obtained from the MD \u0001dotted\nline\u0002. The peaks are labeled as follows \u0001uppercase for experimental, lower-\ncase for simulated peaks\u0002: A, a: antisymmetric C–Cl bending mode; B, b:\nsymmetric C–Cl bending mode; C, c: symmetric C–Cl stretch; D, d: anti-\nsymmetric C–Cl stretch; E, e: C–H bending mode; and F, f: C–H stretch.lengths are shortened. Experimentally, these modes are soft-\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject toened in the liquid compared to the vapor, resulting in peak\npositions for the vapor that do not lie on the trend lines for\nthe liquid under pressure.\nFor the 1216 cm−1 C–H bending mode and the\n3020 cm−1 C–H stretching mode \u0001Fig. 5\u0002, all the vapor\npoints, both experimental and MD, lie off the quadratic fits.\nThe vibrations of the H atom, with its small mass, are most\nlikely to be affected by the proximity of neighboring mol-\necules in the liquid. For example, the increasing proximity\nwith pressure of three negatively charged Cl atoms to the H\natom on a neighboring molecule will affect the vibrational\nproperties of the H atom superposed on the change associ-\nated with the shortening of bonds due to the solvation pres-\nsure. This confirms the results from Sec. III B in relation to\nthe C–H bond lengths obtained from simulation. The experi-\nmental results in Fig. 5 also show no significant change of\nthe peak positions with pressure. Both sets of results confirm\nthe presence of a masking interaction in real chloroform liq-\nuid that affects bond lengths and Raman frequencies, soften-\ning its modes with pressure.\nThe experimental results for the 667 cm−1 symmetric\nmode, the 757 cm−1 antisymmetric C–Cl mode \u0001Fig. 4\u0002, the\n1216 cm−1 C–H bending mode, and the 3020 cm−1 C–H\nstretching mode \u0001Fig. 5\u0002 are almost independent of pressure,\nwhereas the MD simulations reveal an increase in frequency\nin all cases. We believe that, as molecules are pushed to-\ngether by the applied pressure in the real system, the C–H or\nH–H interatomic potentials are modified to annul the fre-\nquency changes predicted by the MD simulations in which\nthe potentials are density independent. For example, three\nFIG. 3. Frequency of the antisymmetric C–Cl bending \u0001a\u0002 and symmetric\nC–Cl bending \u0001b\u0002 modes as a function of pressure, calculated in the MD \u0001\u0003\u0002\nand measured experimentally \u0001\u0002\u0002. The solid lines represent quadratic fits to\nthe liquid data only. In \u0001b\u0002 a fit has also been performed on the experimental\ndata. MD values are shifted vertically by 54 cm−1 \u0001a\u0002 and 73 cm−1 \u0001b\u0002.\nFIG. 4. Frequency of the symmetric C–Cl stretch \u0001a\u0002 and antisymmetric\nC–Cl stretch \u0001b\u0002 modes as a function of pressure, calculated in the MD \u0001\u0003\u0002\nand measured experimentally \u0001\u0002\u0002. The solid lines represent quadratic fits to\nthe liquid data only. MD values are shifted vertically by −57 cm−1 \u0001a\u0002 and\n−1\n−222 cm \u0001b\u0002.\n AIP license or copyright; see http:\/\/jcp.aip.org\/jcp\/copyright.jsp\n204506-6 Hubel et al. J. Chem. Phys. 124, 204506 \u00022006\u0001negatively charged Cl atoms on one molecule might induce a\ndensity-dependent increased effective positive partial charge\non a H atom in a neighboring molecule.\nIV. DISCUSSION AND CONCLUSIONS\nThe generic Dreiding potential set provides a good ap-\nproximation to the interatomic potentials in chloroform with\nmost bulk properties giving satisfactory agreement with ex-\nperiment. Ab initio modeling may provide a route to im-\nproved interatomic potentials that could better replicate the\nambient-pressure vibrational frequencies. However, that is\nnot the objective of the work reported here.\nThere are several intriguing points raised by the present\nresults. First, the Dreiding potentials yield better agreement\nwith the model of solvation pressure than does the real chlo-\nroform. The difference in bond lengths between the MD\nsimulations of vapor and liquid at NTP clearly demonstrates\nthe solvation pressure effect in the liquid. Moreover, the\npressure dependence of the bond lengths and vibrational fre-\nquencies shows that the magnitude of the solvation pressure\nis equal to the CED, with the exception of C–H bond data.\nHere, the small mass of the H means that the bond length and\nvibrational behavior are vulnerable to the local orientation of\nthe molecules in the liquid. We note that a similar observa-\ntion was made with ethanol.11\nIt follows that the SPM is general, but that specific in-\nteractions occur in the real system so as to mask the solva-\ntion pressure effects. The experimental results for the anti-\nsymmetric C–Cl bending and symmetric C–Cl bending mode\nas a function of pressure are also in good agreement with the\nSPM.\nHowever, because experiment agrees less well with the\nsolvation pressure model than does the MD simulation, the\nDreiding potentials must omit an interaction or a perturba-\ntion of importance to the pressure or density dependence of\nthe vibrational spectrum and, specifically, to those peaks in it\nin which the CH group is involved. It is not a large term that\nis omitted, for the softening that it causes amounts to no\nmore than 1%–3% over the density range from \n=0 in the\nvapor to \n=2 g cm−3 at the highest pressures. The obvious\ncandidate for the missing term is a perturbation of the hydro-\ngen two- and three-body intramolecular potentials in the\npresence of other molecules. Such a perturbation need only\nsoften the potentials for the modes in which the carbon and\nhydrogen move \u0001or, equivalently, increase the reduced mass\nFIG. 5. Frequency of the C–H bending \u0001a\u0002 and C–H stretch \u0001b\u0002 modes as a\nfunction of pressure, calculated in the MD \u0001\u0003\u0002 and measured experimentally\n\u0001\u0002\u0002. The solid lines represent quadratic fits to the liquid data only. MD\nvalues are shifted vertically by −164 cm−1 \u0001a\u0002 and 37 cm−1 \u0001b\u0002.of these modes\u0002; it would have only an insignificant effect on\nDownloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject tothe CED of the liquid. Indeed, the experimental determina-\ntion of the pressure dependence of Raman modes together\nwith MD simulation may provide a tool to examine such\neffects. These effects may also be considered as solvent-\nsolute interactions, although the solute here is the same mo-\nlecular type as the solvent, and we would expect the statisti-\ncal mechanical descriptions discussed in Sec. I \u0001Refs. 2 and\n5–7\u0002 to account for these masking interactions. Indeed, the\ngeneral form of the Raman shift calculated by Meléndéz-\nPagán and Ben-Amotz using the statistical mechanical de-\nscription is a linear dependence on density plus a linear de-\npendence on pressure.2 The differences between the MD\nresults and the experimental data in Figs. 4 and 5 can be\naccurately fitted to this general form.\nFinally, it is noted that the present approach to solvation\neffects could not usefully be extended to lower fluid densi-\nties. Indeed, it would be unphysical to attribute a cohesive\nenergy density and consequent solvation pressure to a fluid at\na reduced density where phase separation into liquid and gas\ntakes place. It would be interesting, however, to consider\nlow-density fluids at high temperatures where the reduced\ndensity is stable.\nIn conclusion, comparisons of experiment and MD con-\nfirm that it is masking effects, or solvent-solute interactions,\nthat vitiate purely experimental demonstrations of the valid-\nity of the solvation pressure model. The key result here is\nthat a simplification of the true potentials can eliminate or\nreduce masking effects, thereby exhibiting more clearly the\neffect of the solvation pressure. These MD simulations of\nchloroform expose the ubiquitous nature of solvation pres-\nsure.\nACKNOWLEDGMENTS\nThe authors would like to thank Queen Mary, University\nof London and the Engineering and Physical Sciences Re-\nsearch Council \u0001EPSRC\u0002, UK for their support of this\nproject.\n1 E. Fisher and H. G. Drickamer, J. Chem. Phys. 24, 548 \u00011956\u0002 and\nreferences therein.\n2 Y. Meléndéz-Pagán and D. Ben-Amotz, J. Phys. Chem. B 104, 7858\n\u00012000\u0002.\n3 L. Onsager, J. Am. Chem. Soc. 58, 1486 \u00011936\u0002.\n4 E. Bauer and M. Magat, J. Phys. Radium 9, 319 \u00011938\u0002.\n5 A. D. Buckingham, G. B. B. Sutherland, J. A. Pople, and A. D. E. Pull-\nin,Proc. R. Soc. London, Ser. A 255, 32 \u00011960\u0002.\n6 K. S. Schweizer and D. Chandler, J. Chem. Phys. 76, 2296 \u00011982\u0002.\n7 M. R. Zakin and D. R. Herschbach, J. Chem. Phys. 89, 2380 \u00011988\u0002.\n8 E. A. Grulke, Polymer Handbook, 4th ed. \u0001Wiley, New York, 1998\u0002.\n9 CRC Handbook of Chemistry and Physics, 58th ed. \u0001CRC, Boca Raton,\nFL, 1978\u0002.\n10 J. R. Wood, M. D. Frogley, E. R. Meurs, A. D. Prins, T. Peijs, D. J.\nDunstan, and H. D. Wagner, J. Phys. Chem. B 103, 10388 \u00011999\u0002.\n11 N. W. A. van Uden, H. Hubel, D. A. Faux, A. C. Tanczos, B. Howlin, and\nD. J. Dunstan, J. Phys.: Condens. Matter 15, 1577 \u00012003\u0002.\n12 N. W. A. van Uden, H. Hubel, D. A. Faux, D. J. Dunstan, and C. Royer,\nHigh Press. Res. 23, 205 \u00012003\u0002.\n AIP license or copyright; see http:\/\/jcp.aip.org\/jcp\/copyright.jsp\n204506-7 Solvation pressure in chloroform J. Chem. Phys. 124, 204506 \u00022006\u000113 W. Smith and T. R. Forester, J. Mol. Graphics 14, 136 \u00011996\u0002.\n14 S. L. Mayo, B. D. Olafson, and W. A. Goddard III, J. Phys. Chem. 94,\n8897 \u00011990\u0002.\n15 J. Gasteiger and M. Marsili, Tetrahedron 36, 3219 \u00011980\u0002.\n16 J. K. Maranas, M. Mondello, G. S. Grest, S. K. Kumar, P. G. Debenedetti,Downloaded 31 Mar 2009 to 131.227.178.132. Redistribution subject toand W. W. Graessley, Macromolecules 31, 6991 \u00011998\u0002.\n17 A. Indrakanti, J. K. Maranas, and S. K. Kumar, Macromolecules 33,\n8865 \u00012000\u0002.\n18 J. H. Hildebrand, Phys. Rev. 34, 984 \u00011929\u0002.\n19 G. Allen, G. Gee, and G. J. Wilson, Polymer 1, 456 \u00011960\u0002. AIP license or copyright; see http:\/\/jcp.aip.org\/jcp\/copyright.jsp\n"}