{"doi":"10.1117\/12.622631","coreId":"140377","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5728","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5728","10.1117\/12.622631"],"title":"Films based on bacteriorhodopsin in sol-gel matrices","authors":["Korposh, Serhiy O.","Sichka, M. Y.","Trikur, I. I.","Sharkan, Y. P.","Yang, D. H.","Lee, Seung-Woo","Ramsden, Jeremy J."],"enrichments":{"references":[{"id":37938040,"title":"Bacteriorhodopsin thin film as a sensitive layer for an anaesthetic sensor. Thin Solid Films,","authors":[],"date":"1996","doi":"10.1016\/s0040-6090(95)08474-6","raw":"E. Maccioni, G. Radicchi, V. Erokhin, S. Paddeu, P. Facci and C. Nicoloni, Bacteriorhodopsin thin film as a sensitive layer for an anaesthetic sensor. Thin Solid Films, 1996, Vol. 284-285, pp. 898-900.","cites":null},{"id":37938043,"title":"Bacteriorhodopsin-based biochromic films for chemical sensors. Sens. Actuators B,","authors":[],"date":"2005","doi":"10.1016\/j.snb.2004.11.101","raw":"J.P. Sharkany, S.O. Korposh, Z.I. Batori-Tarci, I.I. Trikur, J.J. Ramsden, Bacteriorhodopsin-based biochromic films for chemical sensors. Sens. Actuators B, 2005, Vol. 107, pp. 77-81. Proc. of SPIE Vol. 5956  595616-7 Downloaded from SPIE Digital Library on 20 Jun 2011 to 138.250.109.230. Terms of Use:  http:\/\/spiedl.org\/terms13.  L. Zimanyi, Y. Cao, R. Needleman, M. Ottolenghi and J.K. Lanyi, Pathway of Proton Uptake in the Bacteriorhodopsin Photocycle. Biochemistry, 1993, Vol. 32, pp. 7669-7678.","cites":null},{"id":37938032,"title":"Bacteriorhodopsin: a light-driven proton pump in Halobacterium halobium.","authors":[],"date":"1975","doi":"10.1016\/s0006-3495(75)85875-9","raw":"R.H. Lozier, R.A. Bogomolni and W. Stoeckenius, Bacteriorhodopsin: a light-driven proton pump in Halobacterium halobium. Biophys. J., 1975, Vol.15, pp. 955-962.","cites":null},{"id":37938052,"title":"Biomolecular Electronics,","authors":[],"date":"1998","doi":"10.1007\/978-1-4612-2442-6_10","raw":"N.N. Vsevolodov, Biomolecular Electronics, 1998, Boston: Birkhäuser. Proc. of SPIE Vol. 5956  595616-8 Downloaded from SPIE Digital Library on 20 Jun 2011 to 138.250.109.230. Terms of Use:  http:\/\/spiedl.org\/terms","cites":null},{"id":37938038,"title":"Chemically modified bacteriorhodopsin based photosensitive material for optoelectronic application.","authors":[],"date":"2001","doi":null,"raw":"Z. Batori-Tartsi and K. Ludmann, Chemically modified bacteriorhodopsin based photosensitive material for optoelectronic application. Bioelectronic Applications of Photochromic Pigments, A. Dér and L. Keszthelyi (eds). Amsterdam: IOS Press (2001), pp. 137–148.","cites":null},{"id":37938037,"title":"Dehydration effects on D96N bacteriorhodopsin films. Thin solid Films,","authors":[],"date":"1996","doi":"10.1016\/0040-6090(95)08528-9","raw":"T.V. Dyukova and E.P. Lukashev, Dehydration effects on D96N bacteriorhodopsin films. Thin solid Films, 1996, Vol. 283, pp. 1-4.","cites":null},{"id":37938042,"title":"Dependence of M, N and O states decay kinetics of D96N bacteriorhodopsin on amine and amino compounds and its application in chemical sensing. Sensors and Actuators","authors":[],"date":"1998","doi":"10.1016\/s0925-4005(97)00328-6","raw":"P.C. Pandey, B.C. Upadhyay, C.M.D. Pandey and H.C. Pathak, Dependence of M, N and O states decay kinetics of D96N bacteriorhodopsin on amine and amino compounds and its application in chemical sensing. Sensors and Actuators B, 1998, Vol. 46, pp. 80-86.","cites":null},{"id":37938034,"title":"Effects of hydrostatic pressure on the kinetics reveal a volume increase during the bacteriorhodopsin photocycle.","authors":[],"date":"1995","doi":"10.1021\/bi00038a009","raw":"G. Váró and J.K. Lanyi, Effects of hydrostatic pressure on the kinetics reveal a volume increase during the bacteriorhodopsin photocycle. Biochemistry, 1995, Vol. 34, pp. 12161-12169.","cites":null},{"id":37938033,"title":"Electron diffraction analysis of structural changes in the photocycle of bacteriorhodopsin.","authors":[],"date":"1993","doi":null,"raw":"Subramaniam., Gerstein M., Oesterhelt D., Henderson R. Electron diffraction analysis of structural changes in the photocycle of bacteriorhodopsin. The EMBO Journal, 1993, Vol.12, pp.1-8","cites":null},{"id":37938036,"title":"Evidence for loosening of a protein mechanism.","authors":[],"date":"1998","doi":"10.1007\/s001140050515","raw":"A. Dér and J.J. Ramsden, Evidence for loosening of a protein mechanism. Naturwissenschaften, 1998, Vol. 85, pp. 353-355.","cites":null},{"id":37938046,"title":"Fluroscence spectroskopic studies to characterize the internal environment of tetraethyl-orthosilicate derived sol-gel bulk and thin films with aging. Biosensors and Bioelectronics,","authors":[],"date":"2005","doi":"10.1016\/j.bios.2004.05.007","raw":"R. Gupta, S. Mozumdar, N.K. Chaughury, Fluroscence spectroskopic studies to characterize the internal environment of tetraethyl-orthosilicate derived sol-gel bulk and thin films with aging. Biosensors and Bioelectronics, 2005, Vol. 20, pp. 1358-1365.","cites":null},{"id":37938031,"title":"Functions of a new photoreceptor membrane.","authors":[],"date":null,"doi":"10.1073\/pnas.70.10.2853","raw":"Oesterhelt D., Stoeckenius W. Functions of a new photoreceptor membrane. Proc. Natl. Acad. Sci. USA, 1973, Vol.70, pp. 2853-2857.","cites":null},{"id":37938044,"title":"Harsanyi (eds) Multichip Modules with Integrated Sensors.","authors":[],"date":"1996","doi":"10.1007\/978-94-009-0323-4_18","raw":"A. Kikineshy, Z. Bathori-Tarczy and Y. Sharkany, In: W.K. Jones, G. Harsanyi (eds) Multichip Modules with Integrated Sensors. NATO ASI Series 3, High Technology. Dordrecht: Kluwer, 1996, pp. 181-184.","cites":null},{"id":37938047,"title":"Organically modified sol–gel sensors.","authors":[],"date":"1995","doi":"10.1021\/ac00097a711","raw":"O. Lev, M. Tsionsky, L. Rabinovich, V. Glezer, S. Sampath, I. Pankratov, J. Gun, Organically modified sol–gel sensors. Anal. Chem., 1995, Vol. 67, pp. 22A–30A.","cites":null},{"id":37938039,"title":"Photocurrent of purple membrane adsorbed onto a thin polymer film: action characteristics of the local anesthetics. Colloids Surfaces B,","authors":[],"date":"2002","doi":"10.1016\/s0927-7765(01)00272-7","raw":"A. Shibata, A. Yorimitsu, H. Ikema, K. Minami, S. Ueno, E. Muneyuki, and T. Higuti, Photocurrent of purple membrane adsorbed onto a thin polymer film: action characteristics of the local anesthetics. Colloids Surfaces B, 2002, Vol. 23, pp. 375-382.","cites":null},{"id":37938048,"title":"Retention of bacteriorhodopsin activity in dried sol-gel glass.","authors":[],"date":"1996","doi":"10.1016\/0956-5663(96)88419-3","raw":"H. Weetall, Retention of bacteriorhodopsin activity in dried sol-gel glass. Biosensors & Bioelectronics, 1996, Vol. 11, pp. 325 333.","cites":null},{"id":37938041,"title":"Reversal in the kinetics of the M state decay of D96N bacteriorhodopsin: probing of enzyme catalyzed reactions. Sensors and Actuators","authors":[],"date":"1996","doi":"10.1016\/s0925-4005(97)80115-3","raw":"P.C. Pandey, Sudha Singh, Bipin Upadhyay, Howard H. Weetall and Peter K. Chen, Reversal in the kinetics of the M state decay of D96N bacteriorhodopsin: probing of enzyme catalyzed reactions. Sensors and Actuators B, 1996, Vol. 35-36, pp. 470-474.","cites":null},{"id":37938051,"title":"Role of Water in Bacteriorhodopsin’s Chromophore:","authors":[],"date":"1984","doi":"10.1021\/bi00318a025","raw":"P. Hildebrandt and M. Stockburger, Role of Water in Bacteriorhodopsin’s Chromophore: Resonance Raman Study. Biochemistry, 1984, Vol. 23, pp. 5539-5548.","cites":null},{"id":37938045,"title":"Room temperature luminescence of silicate sol-gel materials containing trisodium Tris(dipicolinato) neodymate (III).","authors":[],"date":"1996","doi":"10.1021\/ic951310z","raw":"C.L. Dorothy, D. Bruce, Jeffrey, I.Z., 1996. Room temperature luminescence of silicate sol-gel materials containing trisodium Tris(dipicolinato) neodymate (III). Inorg. Chem. 35, 2152–2154.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-09-26T00:00:00Z","abstract":"The bacteriorhodopsin film in gelatin matrixes which are used as sensitive\nelements of integrated optic and fibre-optic sensors of various vapor and gases\ncomponents will not be able to carry out the chemical control of aqueous\nsolutions. In the given paper the results of technological development of\nobtaining the bacteriorhodopsin (bR) films in a sol-gel matrix are represented.\nThe films are obtained in a broad thickness range (from 0.5 to 20 microns) with\nvarious bR concentrations and photosensitize additives. The optimal\ntechnological conditions of obtaining of uniform films with given optical\nparameters are defined. The surface morphology and cross section of the obtained\nfilms was studied using an AFM and SEM. The films have a reasonable surface\nroughness (~ 100 nm) and a uniform distribution of the purple membrane fragments\nin the nanostructured sol-gel glass matrix along the films surface and\nthickness. The transmission spectrums have the characteristic for bR the\nabsorption band, the value of which depends on bR concentration and\ntechnological features of the films deposition. The investigated photosensitive\nproperties of the obtained films and influence on them of chemical components of\naqueous solutions, allow recommending the thin bR films in sol-gel matrixes for\ncreation of planar waveguides in the role of components of the chemical sensors\nof liquid solutions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140377.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1117\/12.622631","pdfHashValue":"d870d69fddd625e4426303b137e8cdc4a96997b0","publisher":"International Society for Optical Engineering; 1999","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5728<\/identifier><datestamp>2012-06-12T10:23:01Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Films based on bacteriorhodopsin in sol-gel matrices<\/dc:title><dc:creator>Korposh, Serhiy O.<\/dc:creator><dc:creator>Sichka, M. Y.<\/dc:creator><dc:creator>Trikur, I. I.<\/dc:creator><dc:creator>Sharkan, Y. P.<\/dc:creator><dc:creator>Yang, D. H.<\/dc:creator><dc:creator>Lee, Seung-Woo<\/dc:creator><dc:creator>Ramsden, Jeremy J.<\/dc:creator><dc:description>The bacteriorhodopsin film in gelatin matrixes which are used as sensitive\nelements of integrated optic and fibre-optic sensors of various vapor and gases\ncomponents will not be able to carry out the chemical control of aqueous\nsolutions. In the given paper the results of technological development of\nobtaining the bacteriorhodopsin (bR) films in a sol-gel matrix are represented.\nThe films are obtained in a broad thickness range (from 0.5 to 20 microns) with\nvarious bR concentrations and photosensitize additives. The optimal\ntechnological conditions of obtaining of uniform films with given optical\nparameters are defined. The surface morphology and cross section of the obtained\nfilms was studied using an AFM and SEM. The films have a reasonable surface\nroughness (~ 100 nm) and a uniform distribution of the purple membrane fragments\nin the nanostructured sol-gel glass matrix along the films surface and\nthickness. The transmission spectrums have the characteristic for bR the\nabsorption band, the value of which depends on bR concentration and\ntechnological features of the films deposition. The investigated photosensitive\nproperties of the obtained films and influence on them of chemical components of\naqueous solutions, allow recommending the thin bR films in sol-gel matrixes for\ncreation of planar waveguides in the role of components of the chemical sensors\nof liquid solutions.<\/dc:description><dc:publisher>International Society for Optical Engineering; 1999<\/dc:publisher><dc:date>2011-08-01T23:07:11Z<\/dc:date><dc:date>2011-08-01T23:07:11Z<\/dc:date><dc:date>2005-09-26T00:00:00Z<\/dc:date><dc:type>Conference paper<\/dc:type><dc:identifier>S. O. Korposh, M. Y. Sichka, I. I. Trikur, Y. P. Sharkan, D. H. Yang, S. W. Lee and J. J. Ramsden, Films based on bacteriorhodopsin in sol-gel matrices, Proceedings of SPIE Volume 5956, Paper Number 595616, 2005.<\/dc:identifier><dc:identifier>9780819459633<\/dc:identifier><dc:identifier>0277-786X<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1117\/12.622631<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5728<\/dc:identifier><dc:language>en_UK<\/dc:language><dc:rights>Copyright 2005 Society of Photo-Optical Instrumentation Engineers. One print or electronic copy may be made for personal use only. Systematic electronic or print reproduction and distribution, duplication of any material in this paper for a fee or for commercial purposes, or modification of the content of the paper are prohibited.<\/dc:rights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0277-786X","0277-786x"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":[],"subject":["Conference paper"],"fullText":"K590\n2 R S\nrER570\nASms C\nFilms based on bacteriorhodopsin in sol-gel matrices \n \nS.O. Korposha,b, M.Y. Sichkab, I.I. Trikurb, Y.P. Sharkana,b, D.H. Yangc, S.W. Leec, J.J. Ramsdena,d \naСranfield University at Kitakyushu, KSRP, 2-5-4F Hibikino, Wakamatsu-ku, \nKitakyushu 808-0135, Japan; \nbInstitute of Solid-State Physics & Chemistry, Uzhgorod National University \nVoloshina St 54, Uzhgorod 88000, Ukraine; \ncGraduate School of Environmental Engineering, University of Kitakyushu, 1-1 Hibikino, \nKitakyushu 808-0135, Japan; \ndDepartment of Advanced Materials, Cranfield University, MK43 0AL, UK \n \n \nABSTRACT \n \nThe bacteriorhodopsin film in gelatin matrixes which are used as sensitive elements of integrated optic and fibre-optic \nsensors of various vapor and gases components will not be able to carry out the chemical control of aqueous solutions. In \nthe given paper the results of technological development of obtaining the bacteriorhodopsin (bR) films in a sol-gel matrix \nare represented. The films are obtained in a broad thickness range (from 0.5 to 20 microns) with various bR \nconcentrations and photosensitize additives. The optimal technological conditions of obtaining of uniform films with \ngiven optical parameters are defined. The surface morphology and cross section of the obtained films was studied using \nan AFM and SEM. The films have a reasonable surface roughness (~ 100 nm) and a uniform distribution of the purple \nmembrane fragments in the nanostructured sol-gel glass matrix along the films surface and thickness. The transmission \nspectrums have the characteristic for bR the absorption band, the value of which depends on bR concentration and \ntechnological features of the films deposition. The investigated photosensitive properties of the obtained films and \ninfluence on them of chemical components of aqueous solutions, allow recommending the thin bR films in sol-gel \nmatrixes for creation of planar waveguides in the role of components of the chemical sensors of liquid solutions. \n \nKeywords: Integrated-optic components, bacteriorhodopsin, sol-gel matrices \n \n1. INTRODUCTION \n \nIn the past few years several biological molecules have been explored for their use in electronics and photonics \napplications. Bacteriorhodopsin (bR),1 has received the most attention because of its outstanding optical properties and \nexcellent stability against chemical, thermal and photochemical degradation. bR is a retinal-protein complex; the \nabsorption of a light quantum by the retinal leads to reversible colour changes from purple to yellow due to protein \nconformational changes, the molecule finally returning to the ground state. In other words, a cycle of reactions is \ninitiated by light, during which the bR molecule passes from one intermediate state to another, the process being \ncharacterized by displacements of the optical absorption bands2. Figure 1 shows a simplified model of the bR \nphotocycle2. \n \nFigure 1: Photocycle of bR. Direct and back reactions, lifetime parameters of the photocycle intermediates, and the stages of \nprotonation and deprotonation of the Schiff base are given. \nIntegrated Optics: Theory and Applications, edited by Tadeusz Pustelny, Paul V. Lambeck, Christophe Gorecki,\nProc. of SPIE Vol. 5956, 595616, (2005) · 0277-786X\/05\/$15 · doi: 10.1117\/12.622631\nProc. of SPIE Vol. 5956  595616-1\nDownloaded from SPIE Digital Library on 20 Jun 2011 to 138.250.109.230. Terms of Use:  http:\/\/spiedl.org\/terms\n \nThe influence of the external media on bR leads to reversible changes of his optical characteristics, which allow the \ncreation of sensitive elements for optical sensor systems on this basis. For practical sensing applications, one can monitor \nthe spectral and kinetic parameters of films made from bR incorporated into a matrix. Consideration of the question of \nexternal influences (e.g. due to the presence of ambient chemical substances) on the bR photochromic processes is of \nprime importance.  By changing external conditions (temperature, hydrostatic pressure, electrical field intensity etc.) one \ncan influence the photoinduced processes of the light-sensitive retinal-protein complex3, 4. The chemical environment of \nbR also influences the photocycle parameters5. For example, humidity6, 7, solutions of local anaesthetics8, organic \nvapours9, ammonium ions and amines10, 11, and ammonia12 all have demonstrable effects on the spectral and kinetic \nparameters. The effect of pH has also been studied13. \nInclusion of halogen-, nitrogen-, and sulphur-containing substances (called chemical additives) in various combinations \ninto the film is a way to permanently modify the photosensitive and temporal characteristics of the photocycle over a \nwide range7, 8, 14, with the possibility of enhancing the chemical sensitivity and selectivity of the films. \nPolymer matrices, due to their simple and well-proven technology, are widely-used for the creation of films based on bR.  \nThey practically do not change the optical parameters and allow the preparion of bR in the form of thin films, which is \nconvenient for practical applications. \nUse of polymer matrices allows the creation of the sensitive elements based on bR for optical vapour sensors12. The \ndrawback of the polymer matrix is its solubility, which makes it impossible to use it for the monitoring of aqueous media. \nEncapsulation of bR into a transparent, water insoluble matrix may solve this disadvantage, provided a bR-compatible \nmaterial of adequate optical quality can be found. \nThe sol–gel process is a convenient and versatile method of preparing transparent optical and water insoluble matrices at \nmoderate temperatures15. Ambient processing conditions enable one to create composite optical materials with numerous \norganic, organometallic and biological molecules embedded within a porous matrix of sol–gel glass16. Most sol–gel \ntechniques use water and low molecular weight alkoxides such as tetraethoxysilane (TEOS) and tetramethoxysilane \n(TMOS) as sol–gel precursors17. \nHydrolysis and condensation of tetra-alkoxysilanes during the sol–gel process help to form a solid silicate around the \nsensing molecule, which is dissolved in the liquid phase16. \nbR retains its optical properties when entrapped in silicate glass by the sol-gel process18, 19,  and could therefore be used \nfor the envisaged biosensor application10. The preparation of dry films based on bR of high optical quality will \nconsiderably enhance the area of bR applications as sensitive elements of integrated optic and fibre-optic sensors. Here \nwe present the results from the technological development of preparing bacteriorhodopsin (bR) films in a sol-gel matrix. \nThe result demonstrated that in water solutions the films based on bR in a sol-gel matrix retained their photoactivity. \n \n2. MATERIALS AND METHODS \n \n2.1 Sample preparation \nBacteriorhodopsin was extracted as purple membrane fragments (pmf) from Halobacterium salinarum, strain S9, \ncultured in our laboratory, according to standard procedures1,14. Tetraethoxysilane (TEOS) (Fluka Company, \nSwitzerland) were used as precursors for the sol-gel glass. The sol-gel glass was prepared with slightly modified methods \ndescribed earlier18. TEOS (7 ml), 3.0 ml of distilled water and 0.1 ml of 0.04 M HC1 were mixed together and sonicated \nfor 20 min. The resulting product was diluted with an equal volume of distilled water. The resulting mixture (0.5 ml) was \nmixed with 0.25 ml sodium borate buffer solution (pH 9) and (0.1 ml, 0.2 ml) bR solution (14 mg\/ml) to create a film-\nforming solution with different bR concentrations. \nTriethanolamine (TEA) (Sigma) and dodecyltrimethylammonium bromide (DTMAB) (Sigma) were chosen as \nsensitizing additives. The concentration of chemical additives was in the range of 0.01–0.4 M. For the preparation of \nchemically modified films, bR solution was mixed with TEA and DTMAB, before mixing with the sol mixture, and \nafterwards 0.02 ml of the bR-chemical additives mixture was added to 0.12 ml of the sol mixture.  \nThe film-forming mixture (0.1 ml) was deposited onto 5 cm2 glass substrates for the creation of thick (20 µm) pure sol-\ngel films and films of bR in the sol-gel matrix. The films were kept in the refrigerator at 4 0C for 24 hours. Surface \nmeasurements and cross section morphology were carried out using AFM and SEM. \nThe thin (< 1 µm) films were prepared by spin-coating methods, by deposition of a drop, with a volume of about 5 µl, of \nthe film-forming mixture onto a rotating (2500 rpm) glass substrate. \n \n \nProc. of SPIE Vol. 5956  595616-2\nDownloaded from SPIE Digital Library on 20 Jun 2011 to 138.250.109.230. Terms of Use:  http:\/\/spiedl.org\/terms\n2.2. Film characterization \nSurface morphology of the films based on bR in the sol-gel matrix was studied with the help of a Jeol JSPM 5210 atomic \nforce microscope. Films were deposited onto 5 mm2 glass substrates. Measurement was done in non-contact mode.  \nThe morphology of the surface and cross-sections of the bR-based films was studied using a Hitachi S-5200 field \nemission scanning electron microscope (FE-SEM) at the Instrumentation Center, the University of Kitakyushu. Before \nmeasurements the films were vacuum dried for 6 hours in order to remove all water from the samples. \nThe spectral static or temporal characteristics were measured at room temperature using an HR2000 Ocean Optics fibre-\noptic spectrophotometer and a double beam Jasco V-550 UV-vis spectrophotometer. \nFor the measurements of photoinduced absorption changes an Ocean Optics LS-450 Blue LED Pulsed Light Source with \nthe LED-518 (λ =518 nm) was used for photo excitation of the bR photocycle. The light was transported by means of a \nsingle 1000 µm optical fiber (Ocean Optics, QP1000-2-UV-VIS) to the film fixed in the spectrophotometer chamber. \nThe measurement was done at the wavelength 410 and 570 nm, which correspond to the absorption maxima of the main \nintermediate M410 of the bR photocycle and the ground state bR570. The optical power density of the actinic light was \nunites of mW\/cm2. For the differential spectra, the spectrum of the illuminated sample was measured 5 min after the \nactinic light started. \nThe photoinduced absorption changes were calculated as the normalized ratio of the maximum absorbance of the \nunbleached sample (А570max - А570maxbleached)\/ А570max. \nAlso measured was the half-time of the M state decay (τ1\/2), i.e. the time to achieve a change of absorbance of 0.5 after \nturning off the actinic illumination. \n \n3. RESULTS AND DISCUSSION \n \n3.1 Sample morphology and structural characterization \nThe surface of the TEOS film prepared by layering and drying is uniform and possesses a low roughness (Fig. 2). \nIncorporation of bR into the TEOS sol-gel matrix considerably increases the film surface roughness (Fig. 3). We assume \nthat it is due to aggregation of the fragments of purple membranes and formation of big bR conglomerates. The \ndeposition of sol-gel films onto the glass substrate by spin-coating can improve the films, optical quality.  \nThe studies of film cross sections showed that films have a uniform nanostructure characterized by purple membrane \nfragments with an average diameter of 0.5 µm and width 5 nm evenly stacked practically parallel to the substrate surface \nin the matrix (Fig. 4 and 5). The films have strongly developed micro- and mesoporosity. This suggests that during the \nadsorption of vapours not only surface but the entire film volume is involved, thereby considerably enhancing the \nefficiency of sensor operation. The thickness of films deposited by layering and drying was 10-20 µm (Fig. 4 and 5), and \nof films deposited by spin-coating < 1 µm (not shown).  \n  \n                \nFigure 2: Surface morphology of a TEOS sol-gel matrix, \nprepared by layering and drying. \n \nFigure 3: Surface morphology of films based on \nbacteriorhodopsin in a TEOS sol-gel matrix, \nprepared by layering and drying.  \nProc. of SPIE Vol. 5956  595616-3\nDownloaded from SPIE Digital Library on 20 Jun 2011 to 138.250.109.230. Terms of Use:  http:\/\/spiedl.org\/terms\nS4lV4jQ                        \n                                       (a)                                                                                                              (b) \nFigure 4: Cross section of a TEOS sol-gel matrix, prepared by layering and drying; (a) scale 10µm; (b) scale 1 µm. \n \n \n                                                                             \n                                          (a)                                                                                                             (b) \nFigure 5: Cross section of films based on bR in a TEOS sol-gel matrix, prepared by layering and drying; (a) scale 10 µm; (b) scale 1 \nµm. \n \n3.2 Spectral measurements of bR film in the sol-gel matrix \nbR has a characteristic absorption maximum at 570 nm due to the retinal chromophore, which is covalently bound to the \napoprotein of bR through a protonated Schiff base linkage. The optical absorption spectra of films based on bR in a sol-\ngel matrix with bR different concentrations is shown in Figure 6. The characteristic absorption maxima proved that in the \ndry sol-gel film bR retains its optical properties and structure and is not denaturated.  \n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n200 300 400 500 600 700 800\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1.0\n2\n1\nA\nbs\nor\nba\nnc\ne\nwavelength \/ nm\n \nFigure 6: Absorption spectra of films based on bR in sol-gel matrix. 1, mass ratio bR : TEOS = 5,5 % : 94,5 %; 2, bR : TEOS = \n2,25 % : 97,75 %. \nProc. of SPIE Vol. 5956  595616-4\nDownloaded from SPIE Digital Library on 20 Jun 2011 to 138.250.109.230. Terms of Use:  http:\/\/spiedl.org\/terms\nPreparing films with the higher bR concentration increases the film sensitivity and at the same time the optical quality is \nstill good and light scattering is relatively low. \n \n3.3 Photoinduced changes of bR optical properties \nAbsorption of light quanta in the visible spectral range initiated the photochemical cycle in bR, followed by the \nphotochromic shift with absorption decreasing at 570 nm and a new absorption maximum appearing at 410 nm. The new \nmaximum at 410 nm indicates the formation of the photointermediate M410 and proved that bR retains its photoactivity in \nthe dry sol-gel film (Fig. 7). \nThe main parameters of the bR photocycle are the formation kinetics and the decay half-time of the M410 intermediate. \nThe photoinduced absorption changes of films based on bR in sol-gel matrix, monitored at 410 nm and 570 nm, which \ncorrespond to the absorption maxima of the M intermediate and the bR ground state, are shown in Figure 8. Inclusion of \nthe chemical additives into the film composition increases the lifetime of the M intermediate and of the corresponding \nphotoinduced absorption changes (Fig. 9). The main optical characteristics for the films based on bR in sol-gel matrix \nwith different chemical additives are summarized in Table 1. The highest photoinduced absorption change and longest \nlifetime is seen in films with added TEA. \n \n \nTable 1. Optical characteristics for the films based on bR in sol-gel matrix with chemical additives.  \nFilm composition λ \/ nm ∆A λmax\/A λmax \n(%) \n τ 1\/2 \/s \n(± 0.1) \nbR+TEOS 570 \n410 \n2.9  \n1.9  \n \n12  \nbR+TEOS+TEA 570 \n410 \n4.6  \n3.2  \n \n21   \nbR+TEOS+TEA+ DTMAB 570 \n410 \n4.2  \n2.7 13 \n \n \n \n \n \n  \n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n300 400 500 600 700 800\n0.75\n0.80\n0.85\n0.90\n0.95\n1.00\n2\n1\nbR in TEOS sol-gel matrix\nAb\nso\nrb\nan\nce\nwavelength \/ nm\n       \n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n300 400 500 600 700 800\n-0.025\n-0.020\n-0.015\n-0.010\n-0.005\n0.000\n0.005\n0.010\n0.015\n0.020\n3\n2\n1\nwavelength \/ nm\nab\nso\nrb\nan\nce\n c\nha\nng\ne\n \n \n \n \n \n \nFigure 7: Absorption spectra of films based on bR in a \nsol-gel matrix; 1 – bR in the ground state; 2 – in the \npresence of actinic light. \nFigure 9: Differential absorbance spectra   (light minus \ndark) of bR in sol-gel matrix with different chemical \nadditives; 1- bR+TEOS; 2 – bR+TEOS+TEA; 3- \nbR+TEOS+TEA+DTMAB. \nProc. of SPIE Vol. 5956  595616-5\nDownloaded from SPIE Digital Library on 20 Jun 2011 to 138.250.109.230. Terms of Use:  http:\/\/spiedl.org\/terms\n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n0 50 100 150 200\n0.834\n0.836\n0.838\n0.840\n0.842\n0.844\n0.846\n0.848\n0.850\n0.852\n0.854\nOFF\nON\nAb\nso\nrb\nan\nce\ntime \/ sec\n  \n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n0 50 100 150 200\n0.770\n0.775\n0.780\n0.785\n0.790\n0.795\n0.800\nOFF\nON\nAb\nso\nrb\nan\nce\ntime \/ sec\n \n                                                      (а)                                                                                              (б) \nFigure 8: Time dependence of photoinduced absorbance change of bR in sol-gel matrix monitored at 410 nm and 570 nm during and \nafter actinic illumination. (a) 410 nm; (b) 570 nm. \n \nWater plays a very important role in the bR photocycle20, 21. With decreasing relative humidity a blue shift in the \nabsorbance maximum for the bR film along with a decrease of absorption is observed6. Different matrices possess \ndifferent porosities and they will contain different amounts of water around the bR molecule, which will influence the \nproperties of bR photocycle. In order to check the effect of the matrix materials on the photoinduced bR optical \nproperties, the parameters of films based on bR in polymeric matrices and in a sol-gel glass matrix were compared. The \ndifferential absorption spectra of the films based on bR in different matrices is shown in Figure 10. \nComparing three different films types: bR in polyvinyl alcohol, in gelatin and in sol-gel glass, it is evident that the \ngelatin film contains the largest amount of available water and the polyvinyl alcohol film the least. In the polyvinyl \nalcohol water is strong bonded with the polymer chains (via numerous hydrogen bonds with the hydroxyl groups of the \npolyvinyl alcohol) and is not accessible to the bR chromophore21. \nThese results demonstrate the possibility to control and modify bR photocycle properties by choosing the matrix type. \n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n400 500 600 700 800\n-0.04\n-0.03\n-0.02\n-0.01\n0.00\n0.01\n0.02\n0.03\n3\n2\n1\nwavelength \/ nm\nab\nso\nrb\nan\nce\n c\nha\nng\ne\n \nFigure 10: Differential absorbance spectra (light minus dark) of films based on bR in different matrices; 1, bR in gelatin; 2, bR in \nTEOS; 3, bR in polyvinyl alcohol. \n \n3.4 Performance of bR film in liquid medium \nIn order to check the performance of bR films in liquid solutions the optical characteristics of films based on bR in the \nsol-gel matrix were measured in films immersed into the water. Figure 11 depict the photoinduced absorption changes of \nbR films in air and in water. The film based on bR in a sol-gel glass was not dissolved and retained its photoactivity in \nthe liquid medium. Absorption changes of the film immersed into the water can be due to decreasing of the light \nscattering in the bR film in sol-gel glass. Penetration of water into pores displaces the air in the pore, and decreases the \nmismatch between refractive indexes of sol-gel matrix and its pores, resulting on decreasing of light scattering. \n \nProc. of SPIE Vol. 5956  595616-6\nDownloaded from SPIE Digital Library on 20 Jun 2011 to 138.250.109.230. Terms of Use:  http:\/\/spiedl.org\/terms\n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n0 50 100 150 200\n0.720\n0.725\n0.730\n0.735\n0.740\n0.745\n0.750\n0.755\n0.760\n0.765\n0.770\n0.775\n2\n1\nOFF\nOFF\nON\nON\n570 nm \nbR in sol-gel\nAb\nso\nrb\nan\nce\ntime \/ sec\n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n                                                    \n0 50 100 150 200\n0.76\n0.77\n0.78\n0.79\n0.80\n0.81\n0.82\n0.83\n0.84\nOFF\nOFF\nON\nON\n2\n1\n410 nm \nbR in sol-gel\ntime \/ sec\nA\nbs\nor\nba\nnc\ne \n \n                                  (a)                                                                            (b) \nFigure 11: Time dependence of photoinduced absorbance change of bR in a sol-gel matrix monitored at 410 nm and 570 nm during \nand after actinic illumination, 1, in air; and 2, in a liquid medium (pure water). (a) 570 nm; (b) 410 nm. \n \nThe results obtained indicate possible applications of film structures based on bR in a sol-gel matrix as the sensitive \nelements of integrated optic and fibre-optic sensors. Films based on bR in sol-gel glass are not dissolved and retain their \nphotoactivity in the liquid medium, which allow the use of these structures as sensitive elements of sensors in a system \nfor monitoring the chemical composition of liquid aqueous solutions. A further technological improvement is necessary \nin order to obtain bR films in the sol-gel glass with the proper optical quality. \n \nREFERENCES \n \n1. Oesterhelt D., Stoeckenius W. Functions of a new photoreceptor membrane. Proc. Natl. Acad. Sci. USA, 1973, \nVol.70, pp. 2853-2857. \n2. R.H. Lozier, R.A. Bogomolni and W. Stoeckenius, Bacteriorhodopsin: a light-driven proton pump in \nHalobacterium halobium. Biophys. J., 1975, Vol.15, pp. 955-962. \n3. Subramaniam., Gerstein M., Oesterhelt D., Henderson R. Electron diffraction analysis of structural changes in \nthe photocycle of bacteriorhodopsin. The EMBO Journal, 1993, Vol.12, pp.1-8 \n4. G. Váró and J.K. Lanyi, Effects of hydrostatic pressure on the kinetics reveal a volume increase during the \nbacteriorhodopsin photocycle. Biochemistry, 1995, Vol. 34, pp. 12161-12169. \n5. A. Dér and J.J. Ramsden, Evidence for loosening of a protein mechanism. Naturwissenschaften, 1998, Vol. 85, pp. \n353-355. \n6. T.V. Dyukova and E.P. Lukashev, Dehydration effects on D96N bacteriorhodopsin films. Thin solid Films, 1996, \nVol. 283, pp. 1-4. \n7. Z. Batori-Tartsi and K. Ludmann, Chemically modified bacteriorhodopsin based photosensitive material for \noptoelectronic application. Bioelectronic Applications of Photochromic Pigments, A. Dér and L. Keszthelyi (eds). \nAmsterdam: IOS Press (2001), pp. 137–148. \n8. A. Shibata, A. Yorimitsu, H. Ikema, K. Minami, S. Ueno, E. Muneyuki, and T. Higuti, Photocurrent of purple \nmembrane adsorbed onto a thin polymer film: action characteristics of the local anesthetics. Colloids Surfaces B, 2002, \nVol. 23, pp. 375-382. \n9. E. Maccioni, G. Radicchi, V. Erokhin, S. Paddeu, P. Facci and C. Nicoloni, Bacteriorhodopsin thin film as a \nsensitive layer for an anaesthetic sensor. Thin Solid Films, 1996, Vol. 284-285, pp. 898-900. \n10. P.C. Pandey, Sudha Singh, Bipin Upadhyay, Howard H. Weetall and Peter K. Chen, Reversal in the kinetics of the \nM state decay of D96N bacteriorhodopsin: probing of enzyme catalyzed reactions. Sensors and Actuators B, 1996, Vol. \n35-36, pp. 470-474. \n11. P.C. Pandey, B.C. Upadhyay, C.M.D. Pandey and H.C. Pathak, Dependence of M, N and O states decay kinetics \nof D96N bacteriorhodopsin on amine and amino compounds and its application in chemical sensing. Sensors and \nActuators B, 1998, Vol. 46, pp. 80-86.  \n12. J.P. Sharkany, S.O. Korposh, Z.I. Batori-Tarci, I.I. Trikur, J.J. Ramsden, Bacteriorhodopsin-based biochromic \nfilms for chemical sensors. Sens. Actuators B, 2005, Vol. 107, pp. 77-81.  \nProc. of SPIE Vol. 5956  595616-7\nDownloaded from SPIE Digital Library on 20 Jun 2011 to 138.250.109.230. Terms of Use:  http:\/\/spiedl.org\/terms\n13. L. Zimanyi, Y. Cao, R. Needleman, M. Ottolenghi and J.K. Lanyi, Pathway of Proton Uptake in the \nBacteriorhodopsin Photocycle. Biochemistry, 1993, Vol. 32, pp. 7669-7678. \n14. A. Kikineshy, Z. Bathori-Tarczy and Y. Sharkany, In: W.K. Jones, G. Harsanyi (eds) Multichip Modules with \nIntegrated Sensors. NATO ASI Series 3, High Technology. Dordrecht: Kluwer, 1996, pp. 181-184. \n15. C.L. Dorothy, D. Bruce, Jeffrey, I.Z., 1996. Room temperature luminescence of silicate sol-gel materials \ncontaining trisodium Tris(dipicolinato) neodymate (III). Inorg. Chem. 35, 2152–2154.  \n16. R. Gupta, S. Mozumdar, N.K. Chaughury, Fluroscence spectroskopic studies to characterize the internal \nenvironment of tetraethyl-orthosilicate derived sol-gel bulk and thin films with aging. Biosensors and Bioelectronics, \n2005, Vol. 20, pp. 1358-1365. \n17. O. Lev, M. Tsionsky, L. Rabinovich, V. Glezer, S. Sampath, I. Pankratov, J. Gun, Organically modified sol–gel \nsensors. Anal. Chem., 1995, Vol. 67, pp. 22A–30A. \n18. H. Weetall, Retention of bacteriorhodopsin activity in dried sol-gel glass. Biosensors & Bioelectronics, 1996, Vol. \n11, pp. 325 333. \n19. W.U. Shuguang, L. M. Ellerby, J. S. Cohan, B. Dunn, M. A. El-Sayed, J. Selverstone Valentine, and J. I. Zink, \nBacteriorhodopsin Encapsulated in Transparent Sol-Gel Glass: A New Biomaterial. Chem. Mater., 1993, Vol. 5, pp. 115-\n120. \n20. P. Hildebrandt and M. Stockburger, Role of Water in Bacteriorhodopsin’s Chromophore: Resonance Raman Study. \nBiochemistry, 1984, Vol. 23, pp. 5539-5548. \n21. N.N. Vsevolodov, Biomolecular Electronics, 1998, Boston: Birkhäuser. \nProc. of SPIE Vol. 5956  595616-8\nDownloaded from SPIE Digital Library on 20 Jun 2011 to 138.250.109.230. Terms of Use:  http:\/\/spiedl.org\/terms\n"}