{"doi":null,"coreId":"10060","oai":"oai:www.dora.dmu.ac.uk:2086\/2091","identifiers":["oai:www.dora.dmu.ac.uk:2086\/2091",null],"title":"Alcohol Services and the needs of Black and Minority Ethnic Groups (Alcohol Insight 29)","authors":["Johnson, Mark, 1948 Mar. 16-","Menzies-Banton, P.","Dhillon, H.","Subhra, V.","Hough, J."],"enrichments":{"references":[{"id":1166658,"title":"Alcohol, tobacco and paan use and understanding of oral cancer risk among Asian males in Leicester'","authors":[],"date":"2000","doi":"10.1038\/sj.bdj.4800506","raw":"Vora AR, Yeoman CM, Hayter JP 2000 'Alcohol, tobacco and paan use and understanding of oral cancer risk among Asian males in Leicester' British Dental Journal 188,8 :444-451 Wall TL, Thomasson HR, Schuckit MA, Ehlers CL 1992 'Subjective feelings of alcohol intoxication in Asians with genetic variations of ALDH2 alleles' Alcoholism: Clinical and Experimental Research  16 :991-995 Waller S, Naidoo B, Thorn B 2002 Prevention and reduction of alcohol misuse: review of reviews London: Health Development Agency (Evidence Briefings series) Waterson, E.J., Murray-Lyon, M.D. 1989 'Alcohol, smoking and pregnancy: some observations on ethnic minorities in the United Kingdom' British Journal of Addiction 84 :323-325 Weber TR 1996 The influence of acculturation on attitudes towards alcohol and alcohol use within the Punjabi community: An exploratory analysis. Substance Use and Misuse, 3, 1715-1732 Westermeyer J, Neider J 1986 'Cultural affiliation among American Indian Alcoholics: Correlations and Change over a Ten-Year Period' in Babor TF 1986 Annals NYAS 472 :179-188 White M, Harland JOE, Bhopal RS, Unwin N, Alberti KGMM 2001 'Smoking and alcohol consumption in a UK Chinese population' Public Health 115 :62-69 Wickramsinghe SN, Corridan B, Izaguirre J, Hasan R, Marjot DH 1995 ‘Ethnic differences in the biological consequences of alcohol abuse: a comparison between south Asian and European males’ Alcohol & Alcoholism 30,5 :675-680 Williams R, Shams M 1998 'Generational continuity and change in British Asian health and health behaviour' Journal of Epidemiology and Community Health 52,9 :558-563 Winters M. & Patel K. (2003) Dept. of Health Drug Misuse Needs Assessment project report, University of Central Lancashire, Preston","cites":null},{"id":36948120,"title":"alcohol: an information booklet’ London: Drugs Alcohol Women Now DAWN 1988b ‘Black Women and dependency: a report on drug and alcohol abuse’ London: Drugs Alcohol Women Now 28 Denscombe M","authors":[],"date":"1995","doi":null,"raw":"DAWN 1988a ‘Black Women and alcohol: an information booklet’ London: Drugs Alcohol Women Now DAWN 1988b ‘Black Women and dependency: a report on drug and alcohol abuse’ London: Drugs Alcohol Women Now   28 Denscombe M 1995 ‘Ethnic group and alcohol consumption: the case of 15-16 year-olds in Leicestershire’ Public Health 109,2 :133-142 Denscombe M, Drucquer N 2000 'Diversity within ethnic groups: alcohol and tobacco consumption by young people in the East Midlands' Health Education Journal 59,4 :340-350 Dhillon HS 1994 Counselling Asian men with alcohol-related problems London: Newham Alcohol Advisory Service DiClemente CC, Prochaska JO. 1982 ‘Self-change and Therapy Change of Smoking Behaviour: A Comparison of Processes of Change in Cessation and Maintenance. Addictive Behaviours 7:133-142..","cites":null},{"id":197835,"title":"alcohol: an information booklet’ London: Drugs Alcohol Women Now DAWN 1988b ‘Black Women and dependency: a report on drug and alcohol abuse’ London: Drugs Alcohol Women Now Denscombe M","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":1166657,"title":"Drinking in Second and Subsequent Generation Black and Asian Communities in the English Midlands London: Alcohol Concern \/ Aquarius Ranganathan S","authors":[],"date":"2001","doi":null,"raw":"Purser B, Davis P, Johnson MRD, Orford J 2001 Drinking in Second and Subsequent Generation Black and Asian Communities in the English Midlands London: Alcohol Concern \/ Aquarius Ranganathan S 1994 'The Manjakkudi experience: a camp approach towards treating alcoholics' Addiction 89 :1071-1075 (not reviewed) Rawaf S, Bahl C 1998 Assessing the Health Needs of Black and Asian Communities London: Royal College of Physicians Rogers A Adamson JE, McCarthy M 1997 Variations in health behaviours among inner city 12-year olds from four ethnic groups Ethnicity & Health 2,4 :309-316 Rogers N 1997 EACH in Harrow: The first hundred clients Harrow: EACH Rooney R H, Bibus AA 1996 ‘Multiple Lenses: Ethnically sensitive practice with involuntary clients who are having difficulties with drugs or alcohol’ Journal of MultiCultural Social Work 4,2 :59-73 Sangster D, et al 2002 Delivery of drug services to black and minority ethnic communities London: DPAS Shaikh Z, Naz F 2000 A cultural cocktail - Asian women and alcohol abuse Hounslow: EACH Shaikh Z, Reading J 1999 Between two cultures: Effective counselling for Asian people with mental health and addiction problems Hounslow: EACH Sproston K, Pitson L, Whitfield G, Walker E 1999 Health and Lifestyles of the Chinese population in England London: Health Education Authority Subhra G 2002 'Drinking in Black and minority ethnic communities' in Alcohol Concern 2002 :20-23   33 Subhra G, Chauhan V 1999 ‘Developing Black Services: An Evaluation of the African, Caribbean and Asian Services funded by Alcohol Concern’s Grants Programme’ London: Alcohol Concern Sue DW, Sue D 1990 Counselling the culturally different: Theory and Practice New York: John Wiley & Sons Theodorou Z 1992 Alcohol and the invisible communities: Needs and attitudes in the Cypriot and Turkish groups London: Haringey Advisory Group on Alcohol Vellerman R, Orford J  1999  Risk & Resilience: Adults who were the Children of Problem Drinkers. London: Harwood.","cites":null},{"id":1166655,"title":"Drug and alcohol issues affecting Black and minority ethnic communities: literature review Glasgow: Centre for Drug Misuse Research","authors":[],"date":"2001","doi":null,"raw":"Hay G, Kohli H, McKeganey N 2001 Drug and alcohol issues affecting Black and minority ethnic communities: literature review Glasgow: Centre for Drug Misuse Research Hay G, Kohli H, McKegany N 2001 Drug and Alcohol Issues Affecting Black and Minority Ethnic Communities: Literature review Glasgow: Centre for Drug Misuse research, University of Glasgow HEA 1994 Sensible Drinking: messages in a multi-cultural society London: Health Education Authority Herd D 1993 ‘An analysis of alcohol related problems in Black and White women drinkers’ Addiction Research 1,3 :181-198 High E 1996 Leisure Lifestyles of Hounslow's Asian Population London Borough of Hounslow: Leisure Services Horton C 1995 Lessons Learnt by Black projects Funded under Alcohol Concern's Grants programme London: Alcohol Concern (Summary report based on  Evaluation of Alcohol Concern's Grants programme for Black projects' by Confederation of Indian Organisations 1994) Hyare I 1993 Alcohol Education in the Asian communities of Dudley (Unpublished paper, Birmingham: Aquarius) Hyare I 1995 Increasing the accessibility of Alcohol Services to the South Asian Communities of Birmingham Birmingham: Aquarius Hyare I 1996 Alcohol and the South Asian population of East Birmingham (Unpublished paper, Birmingham: Aquarius) Hyare I, Taylor W 1996 Alcohol and the South Asian population of South Birmingham Birmingham: Aquarius   30 Iber FL 1986 'Treatment and Recovery in Alcoholism: Contrast between Results in White Men and Those in Special Populations' in Babor TF 1986 Annals NYAS 472 :189-194 Johnson MRD, Carroll M 1995 Dealing with Diversity London: Home Office Drugs Prevention Initiative Johnson MRD, Powell D 1997 African-Caribbean Communities and Alcohol Advice Services in Coventry: Unpublished Report to Coventry & Warwickshire AAS Johnson MRD, Verma C 1998 It’s Our Health Too: Asian men’s health perspectives Southern Birmingham Community Health NHS Trust and NHS Executive Ethnic Health Unit, Coventry: University of Warwick CRER Research Paper 26 Joshi K 1994 First three hundred clients London: Ethnic Alcohol Counselling in Hounslow (EACH) Karenga M 1988 The African American holiday of Kwanzaa. Los Angeles: University Sankore Press.","cites":null},{"id":197830,"title":"Ethnic and Gender differences in drinking and smoking among London adolescents Ethnicity &","authors":[],"date":"2001","doi":"10.1080\/13557850123660","raw":"Best D, Rawaf S, Rowley J, Floyd K, Manning V, Strang J 2001 Ethnic and Gender differences in drinking and smoking among London adolescents Ethnicity & Health 6,1 :51-58 Bhattacharya G 1998 'Drug use among asian-Indian adolescents: identifying protective\/risk factors' Adolescence 33,129 :169-184 Bhopal R 1986 ‘Asians knowledge and behaviour on preventive health issues: smoking, alcohol, heart disease, pregnancy, rickets, malaria prophylaxis and surma’ Community Medicine 8,4 :315-321 Bhopal R, White M 1993 ‘Health promotion for ethnic minorities: past, present and future’ in Ahmad 1993 :137-166 Bhugra D, Bahl V (Eds) 1999 Ethnicity: An Agenda for Mental Health London: Gaskell Bowry V 1991 Evaluation report on an Asian Information leaflet about Sensible Drinking Leicester Health Promotion Centre Cabinet Office 2000 Minority Ethnic Issues in Social Exclusion and Neighbourhood Renewal London: Stationery Office Cabinet Office 2004 Alcohol Harm Reduction Strategy for England London: Cabinet Office Prime Minister's Strategy Unit Cherian R. 1986 Emergence of a day-care centre for alcoholics in India - its referral system and public response. British Journal of Addiction, 81, 119-122   27 Civis Trust (-) ‘A Black and Minority Ethnic Strategy for Small Dispersed Communities’. London: Alcohol Concern (unpublished report).","cites":null},{"id":197831,"title":"Ethnic differences in the consequences of alcohol misuse’ Alcohol & Alcoholism 25 :9-11 Cochrane R","authors":[],"date":"1990","doi":null,"raw":"Clarke M, Ahmed N, Romaniuks H, Marjot DH, Murray-Lyon I 1990 ‘Ethnic differences in the consequences of alcohol misuse’ Alcohol & Alcoholism 25 :9-11 Cochrane R 1999 'Ethnicity, drinking patterns and alcohol-related problems in England' in Bhugra D, Bahl V (Eds) :71-84 (Chapter 8) Cochrane R, Bal S 1990 ‘The drinking habits of Sikh, Hindu, Muslim and white men in the West Midlands: A community survey’ British Journal of Addiction 85 :759-769 Cochrane R, Howell M 1995 ‘Drinking patterns of black and white men in the West Midlands’ Social Psychiatry and Psychiatric Epidemiology 30 :139-146 Collins S, Keene J 2000 Alcohol, Social work and Community Care Birmingham; Venture Press Commander MJ, Odell SO, Williams KJ, Sashidharan SP, Surtees PG 1999 ‘Pathways to care for alcohol use disorders’ Journal of Public Health Medicine 21,1 :65-69 Commission on the Future of Alcohol Services 2003  'Executive Summary. ‘What Services are Needed, Who Needs Them, and How They Should be Provided’ London: Alcohol Concern Confederation of Indian Organisations (1994) Evaluation of Alcohol Concern’s Grants Programme, Alcohol Concern, London.","cites":null},{"id":197834,"title":"Ethnicity, patterns of substance misuse and criminality: a comparative study of White and Asian patient populations in West London'","authors":[],"date":"2002","doi":"10.1080\/14659890215695","raw":"Dar K, Chaudhry ZA, Mirza I, Alam F 2002 'Ethnicity, patterns of substance misuse and criminality: a comparative study of White and Asian patient populations in West London' Journal of Substance Abuse 7 :244-250 D'Avanzo CE. Frye B. Froman R. 1994 Culture, stress and substance use in Cambodian refugee women. Journal of Studies on Alcohol. 55(4):420-6 Davis 1997 New York State Office for Mental Health Fact Sheet; Albany New York.","cites":null},{"id":1166653,"title":"Sensible Drinking - Messages in a multi-cultural society: Report of a study for the Health Education Authority (London: HEA \/ Manuscript in King's Fund Library) Dotinga A","authors":[],"date":"1994","doi":null,"raw":"Dijkshoorn H 1994 Sensible Drinking - Messages in a multi-cultural society: Report of a study for the Health Education Authority (London: HEA \/ Manuscript in King's Fund Library) Dotinga A 2005 Drinking in a Dry Culture: Alcohol Use among second-generation Turks and Moroccans – Measurements and results Rotterdam University (Published PhD Thesis) Douds AC, Cox MA, Iqbal TH, Cooper BT 2003 'Ethnic differences in cirrhosis of the liver in a British city: alcoholic cirrhosis in South Asian men Alcohol and Alcoholism 38,2 :148-150 Drug Strategy Directorate (2003), Diversity Manual: How to embed equality issues into the delivery of the national drug strategy. A Guide for Regional Drug Action Teams.","cites":null},{"id":197832,"title":"Shades of Black: Diversity in African American Identity USA:Temple University","authors":[],"date":"1991","doi":"10.1525\/aa.1992.94.4.02a00210","raw":"Cross W 1991 Shades of Black: Diversity in African American Identity  USA:Temple University Cross W. E. Jr, et al 1991 'The stages of Black identity development: Nigressence models'   in R.L Jones (Ed), Black Psychology (3 rd ed. pp 319- 338). Los Angeles: Cobb & Henry.","cites":null},{"id":1166656,"title":"Social environment and substance misuse: a study of ethnic variations among inner London adolescents Ethnicity &","authors":[],"date":"1998","doi":"10.1080\/13557858.1998.9961869","raw":"Karlsen S, Rogers A, McCarthy M 1998 Social environment and substance misuse: a study of ethnic variations among inner London adolescents Ethnicity & Health 3,4 :265-274 Khan FA, Robinson PG, Warnakulasuriya KAAS, Newton JT, Gelbier S, Gibbons DE 2000 'Predictors of tobacco and alcohol consumption and their relevance to oral cancer control amongst people from minority ethnic communities in the South Thames health region, England' J Oral Pathol Med 29 :214-219 Kohli H 1989 ‘A comparison of smoking and drinking among Asian and white schoolchildren in Glasgow’ Public Health 103 :433-439 Kunz, J.L. & Giesbrecht, N. 1999 'Gender, perceptions of harm, and other social predictors of alcohol use in a Punjabi community in the Toronto area' Substance Use and Misuse, 34, 403-419 Lip GYH, Luscombe C, McCarry M, Malik I, Beevers G 1996 Ethnic differences in public health awareness, health perceptions and physical exercise: implications for heart disease prevention Ethnicity & Health 1,1 :47-54 Loberg T, Miller WR 1986 'Personality, Cognitive and Neuropsychological Correlates of Harmful Alcohol Consumption: A Cross-National Comparison of Clinical Samples in Babor TF 1986 Annals NYAS 472 :75-97 Luce A, Heather N, McCarthy S 2000 'National census of UK alcohol treatment agencies: 1. Characteristics of clients, treatment and treatment providers' Journal of Substance Abuse 5,2 :112-121 Makela K 1991 'Social and cultural preconditions of Alcoholics Anonymous (AA) and factors associated with the strength of AA' British Journal of Addiction 86 :1405-1413 Malseed J 1990 Alcohol in Asian and AfroCaribbean communities Lancaster: University School of Independent Studies   31 Manik GS, Cameron D, Bird RH, Sinorwala A 1997 unpublished 'Resolution of problem drinking without formal treatment: comparing ethnic minority and indigenous Caucasian populations' - (submitted paper) Mather HM, Marjot DH 1989 ‘Alcohol-related admissions to a psychiatric hospital: a comparison of Asians and Europeans’ British Journal of Addiction 84 :327-329 Mathrani S 1998 Young people, alcohol and their social world: a qualitative study London: Health Education Authority Maypole, D.E., Anderson R.B. 1983 'Minority alcoholism programs: Issues in service delivery models' The International Journal of the Addictions 18: 987-1001 McKeigue PM, Karmi G 1993 ‘Alcohol consumption and alcohol related problems in AfroCaribbeans and South Asians in the United Kingdom’ Alcohol & Alcoholism 28 :1-10 Midgley S, Petersen T 2002 'Anti-discriminatory practice in substance misuse work' in Peterson & McBride 2002 :305-315 (Chapter 26) Miller WR 1998 'Researching the spiritual dimensions of alcohol and other drug problems' Addiction 93,7 :979-990 Mills T, Parry E, Tyson S 2002 Developing a Human Resource Action Plan for the Specialist Alcohol and Drug sector in London: a preliminary assessment Cranfield School of Management (unpublished report) for Greater London Alcohol & Drugs Alliance Morjaria A 2001 Religious and spiritual elements of change for South Asian men with drink problems (unpublished PhD Thesis, University of Birmingham) Morjaria A 2003 &quot;Religious and spiritual elements of change in South Asian men with drink problems: a qualitative exploration&quot; (unpublished paper in preparation) Morjaria A, Orford J 2002 'The role of religion and spirituality in recovery from drink problems: a qualitative study of Alcoholics Anonymous members and South Asian men' Addiction Research and Theory 10,3 :225-256 National Treatment Agency 2002 Models of Care for the treatment of drug misusers, Part 2. London: Department of Health National Treatment Agency 2003 ‘National Drug Strategy: Development of Core Group of Key Performance Indicators for Treatment’ London: NTA Nayak J 1985 Drinking and Drinking problems in the Asian Communities in Coventry Coventry: Alcohol Advisory Service Nazroo J 1997a The Health of Britain’s Ethnic Minorities London: PSI Nazroo JY 1997b Ethnicity and Mental Health London: Policy Studies Institute Nolan G, Day C 1988 Alcohol and the black communities: providing an anti-racist service London: DAWN   32 O'Connell DF, Alexander CN 1994 'Introduction: Recovery from addictions using Transcendental Meditation and Maharishi Ayur-Veda Alcoholism Treatment Quarterly 11, 1\/2 :1-12 Orford J, Johnson MRD, Purser R 2004 'Drinking in Second Generation Black and Asian Communities in the English Midlands' Addiction Research and Theory 12,1 :11-30 February 2004 Oyefeso A 1994 'Socio-cultural aspects of substance use and misuse' Current Opinion in Psychiatry 7 :273-277 Oyefeso A, Ghodse H 1998 'Addictive Behaviours' (Chapter 10), in Rawaf & Bahl :141-155 Peterson T, McBride A (2002) Working with Substance Misusers - A guide to theory and practice  London: Routledge Plant M 2004 'The alcohol harm reduction strategy for England' BMJ 328 :905-906 Prochaska, J.O. & Di Clemente, C.C. 1986 'Towards a comprehensive model of change' in W.R. Miller, & N. Heather. (Eds.). Treating addictive behaviours - Processes of change (pp 3-27). Plenum Press: New York.","cites":null},{"id":197826,"title":"Steps to a perfect service' in Hyare I (Ed) Ethnic Dimensions: culture, migration and alcohol and drug issues Lausanne: ICAA Ahmad WIU (Ed)","authors":[],"date":"1994","doi":null,"raw":"Adebowale V 1994 'Steps to a perfect service' in Hyare I (Ed) Ethnic Dimensions: culture, migration and alcohol and drug issues Lausanne: ICAA Ahmad WIU (Ed) 1993 ‘Race’ and Health in Contemporary Britain Buckingham: Open University Press Ahmad WIU, Kernohan E, Baker M 1988 ‘Alcohol and cigarette consumption among white and Asian general practice patients’ Health Education Journal 47,4 :128-129 Ahmed N 1989 Service provisions for ethnic minority problem drinkers from an Asian background. in R.S. Waahberg (Ed.), 35th International Congress on alcoholism and drug dependence.  Prevention and control: Realities and aspirations (pp. 37-44). Oslo: National Directorate for the Prevention of Alcohol and Drug Problems.","cites":null},{"id":197828,"title":"The Community of Self London: Mind Production ALAAP","authors":[],"date":"1985","doi":null,"raw":"Akbar, Na’im 1985 The Community of Self London: Mind Production ALAAP 1996 A Matter of lifestyle - Study of attitudes to health and leisure in Hounslow's Asian Communities London Hounslow: Asian Arts and Leisure Planners Albar MA 1988 The problem of alcohol dependence and its solution in Islam.  Saudi Medical Journal, 9, 1-5 Alcohol Concern (Anon) 2004 'Alcohol drinking among Black and minority ethnic communities (BME) in the United Kingdom' Acquire 36 'pull-out report', :(i-vii) Alcohol Concern 1993 Alcohol Education: an introduction to working with Asian Communities London: Alcohol Concern Alcohol Concern 1995 Alcohol and the Asian, African and Caribbean Communities London: Alcohol Concern and Newham Alcohol Advisory Service Alcohol Concern 2002 100% Proof: Research for Action on Alcohol London: Alcohol Concern Alcohol Concern and Drugscope 1999 Quality Standards in Alcohol and Drug Services.","cites":null},{"id":1166654,"title":"The role of social factors and individual characteristics in promoting alcohol use among inner-city minority youths’","authors":[],"date":"1995","doi":"10.15288\/jsa.1995.56.39","raw":"Epstein JA, Botvin GJ, Diaz T, Schinke SP. 1995 ‘The role of social factors and individual characteristics in promoting alcohol use among inner-city minority youths’ Journal of Studies on Alcohol 56,1 :39-46 Erens B, Laiho J 2001 'Alcohol Consumption' (Chapter 5) in Health Survey for England -The Health of Minority Ethnic Groups '99 ( www.archive.officialdocuments.co.uk\/document\/doh\/survey99\/hse99-05.htm) (accessed May 2003) Erens B, Primatesta P, Prior G (Eds) 2001 Health Survey for England: The Health of Minority Ethnic Groups 1999 London: Department of Health (also available online www.doh.gov.uk\/public\/england.htm) Fernando S 1995 Mental Health in a Multi-ethnic Society; A Multi- disciplinary Handbook Routledge, London Fiorentine R, et al 1999 'Drug Treatment Effectiveness and client counsellor empathy: exploring the effects of gender and ethnic congruency' Journal of Drug Issues 29 (1), :59-74 Fountain J, Bashford J, Winters M, Patel K 2003 Black and minority ethnic communities in England: a review of the literature on drug use and related service provision Preston: Centre for Ethnicity & Health \/ National Treatment Agency for Substance Misuse Ghosh SK 1984 ‘Prevalence survey of drinking alcohol and alcohol dependence in the Asian population in the UK’ in Krasner et al 1984 (Chap 17) :179-190   29 Giesbrecht N 1990 Research Action and the Community: Experiences in the prevention of Alcohol and other Drug problems Maryland (USA): DHHS Gutmann MC 1999 'Ethnicity alcohol and acculturation' Social Science & Medicine 48 :173-184 Hall RL 1986 'Alcohol Treatment in American Indian Populations: An Indigenous Treatment Modality Compared with Traditional Approaches' in Babor TF 1986 Annals NYAS 472 :168-178 Harrinder Singh Dhillon 1994 Counselling Asian Men with Alcohol-Related Problems Newham Alcohol Advisory Service Harrison L, Sutton M, Gardiner E 1997 'Ethnic Differences in Substance Use and Alcohol-Use-Related Mortality among First Generation Migrants to England and Wales' Substance Use & Misuse 32,7-8 :849-876 Harrison, L (Ed.) 1996 Alcohol problems in the community. London: Routledge Harrison, L, Harrison, M. & Adebowale, V. 1996 Drinking problems among black communities. In L. Harrison (Ed.), Alcohol problems in the community. (pp.223-240). London: Routledge.","cites":null},{"id":197833,"title":"The use of acute and preventative medical services by a general population: relationship to alcohol consumption'","authors":[],"date":"1999","doi":"10.1046\/j.1360-0443.1999.941015238.x","raw":"Cryer PC, Jenkins LM, Cook AC, Ditchburn JS, Harris CK, Davis AR, Peters TJ 1999 'The use of acute and preventative medical services by a general population: relationship to alcohol consumption' Addiction 94,10 :1523-1532 D’ Ardenne P, Mahtani A 1989 Transcultural Counselling in Action  London: Sage.","cites":null},{"id":197829,"title":"Treating and preventing alcohol, nicotine, and drug abuse through Transcendental Meditation: A review and statistical meta-analysis' Alcoholism Treatment Quarterly,","authors":[],"date":"1994","doi":"10.1300\/j020v11n01_02","raw":"London: Alcohol Concern Alexander CN, Robinson P & Rainforth M. 1994 'Treating and preventing alcohol, nicotine, and drug abuse through Transcendental Meditation:  A review and statistical meta-analysis' Alcoholism Treatment Quarterly, 11, 13-87 Arora R, Khatun A 1998 'No to Nasha: drugs, alcohol and tobacco use in Bradford's Asian community' Bradford: Race Relations Research Unit Arora R, Khatun A 1998 No to Nasha: Drugs, Alcohol and Tobacco use in the Bradford's Asian Communities Bradford: Race Relations Research Unit with Bradford & District Training & Enterprise Council   26 ARP Choices 1996 Black Advisory Services on Alcohol Related Concerns: An evaluation of three years work London: Alcohol Recovery Project Atkins K, Ahmad W (Eds) 1996 Race and Community Care Buckingham: Open University Press ATP 1991 Alcohol Awareness: Towards a Transcultural Approach (Training Manual) London: Alcohol Training Project \/ Greater London Association of Alcohol Services \/ LBTC: Training for Care Babor TF (Ed) 1986 'Alcohol and Culture: comparative perspectives from Europe and America Annals of the New York Academy of Sciences 472 Babor TF 1986 'Taking Stock: Method and Theory in Cross-National research on Alcohol' in Babor TF 1986 Annals NYAS 472 :1-9 Babor TF, Mendelson JH 1986 'Ethnic\/Religious Differences in the Manifestation and Treatment of Alcoholism' in Babor TF 1986 Annals NYAS 472 :46-59 Balarajan R, Yuen P 1986 ‘British smoking and drinking habits: variations by country of birth’ Community Medicine 8,3 :237-239 Bandura A 1975 Social Learning and Personality Development New Jersey: Holt Rinehart & Winston Bashford J, Buffin J, Patel K 2003 ‘Community Engagement: Report 2: The Findings’. The Department of Health’s Black and Minority Ethnic Drug Misuse Needs Assessment Project. University of Central Lancashire.","cites":null},{"id":197827,"title":"Understanding family coping with alcohol problems in the Sikh community (unpublished PhD Thesis,","authors":[],"date":"2000","doi":null,"raw":"Ahuja A 2000 Understanding family coping with alcohol problems in the Sikh community (unpublished PhD Thesis, University of Birmingham) Ahuja A, Orford J, Copello A 2003 'Understanding How Families Cope with Alcohol Problems in the UK West Midlands Sikh Community' Contemporary Drug Problems 30, 839-873.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-10","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AERC: Alcohol Education and Research Council","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:www.dora.dmu.ac.uk:2086\/2091<\/identifier><datestamp>\n                2012-07-17T11:50:49Z<\/datestamp><setSpec>\n                com_2086_82<\/setSpec><setSpec>\n                col_2086_1216<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nAlcohol Services and the needs of Black and Minority Ethnic Groups (Alcohol Insight 29)<\/dc:title><dc:creator>\nJohnson, Mark, 1948 Mar. 16-<\/dc:creator><dc:creator>\nMenzies-Banton, P.<\/dc:creator><dc:creator>\nDhillon, H.<\/dc:creator><dc:creator>\nSubhra, V.<\/dc:creator><dc:creator>\nHough, J.<\/dc:creator><dc:date>\n2009-07-24T11:42:23Z<\/dc:date><dc:date>\n2009-07-24T11:42:23Z<\/dc:date><dc:date>\n2006-10<\/dc:date><dc:type>\nOther<\/dc:type><dc:identifier>\nJohnson, M.R.D., Menzies-Banton, P., Dhillon, H., Subhra, V. and Hough, J. (2006) Alcohol Services and the needs of Black and Minority Ethnic Groups (Alcohol Insight 29) London: AERC: Alcohol Education and Research Council<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2086\/2091<\/dc:identifier><dc:identifier>\nhttp:\/\/www.aerc.org.uk\/documents\/pdfs\/finalReports\/AERC_FinalReport_0028.pdf<\/dc:identifier><dc:language>\nen<\/dc:language><dc:publisher>\nAERC: Alcohol Education and Research Council<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":[],"subject":["Other"],"fullText":""}