{"doi":"10.1007\/s11267-006-9084-8","coreId":"63714","oai":"oai:nora.nerc.ac.uk:1783","identifiers":["oai:nora.nerc.ac.uk:1783","10.1007\/s11267-006-9084-8"],"title":"Setting Site Specific Critical Loads: An Approach using Endorsement Theory and Dempster–Shafer","authors":["Wadsworth, Richard A.","Hall, Jane R."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2007","abstract":"There is an increasing demand from conservation agencies for site-specific critical loads (CL); unfortunately, there is often very little specific information on a site to determine the important parameters needed to calculate the CL or on the spatial location of the “designated feature” in a site. Determining the most appropriate CL therefore involves using expert judegement to make decisions with incomplete and uncertain information. Endorsement Theory (Cohen, 1985) and Dempster–Shafer statistics (Dempster, 1967; Shafer, 1976) are, respectively, a decision-theoretic and a statistical technique for reasoning under those conditions (uncertainty and incompletness). A key reason for applying these techniques is that they make expert opinion explicit and available for scrutiny. Both techniques have been applied to the problem of setting an appropriate site specific CL, using heathland sites as a case study. Inital findings are encouraging; the uncertainty in expert judgement is made explict, the end results are intuitively reasonable and the methodology apparently acceptable to decision makers","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/63714.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/1783\/1\/001783Wadspp.pdf","pdfHashValue":"29f23c6cacd9b500ee87780ce15f8b1b90b5d93e","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:1783<\/identifier><datestamp>\n      2017-07-25T00:30:11Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D5339<\/setSpec><setSpec>\n      7375626A656374733D5337<\/setSpec><setSpec>\n      7375626A656374733D533231<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/1783\/<\/dc:relation><dc:title>\n        Setting Site Specific Critical Loads: An Approach using Endorsement Theory and Dempster–Shafer <\/dc:title><dc:creator>\n        Wadsworth, Richard A.<\/dc:creator><dc:creator>\n        Hall, Jane R.<\/dc:creator><dc:subject>\n        Data and Information<\/dc:subject><dc:subject>\n        Chemistry<\/dc:subject><dc:subject>\n        Mathematics<\/dc:subject><dc:description>\n        There is an increasing demand from conservation agencies for site-specific critical loads (CL); unfortunately, there is often very little specific information on a site to determine the important parameters needed to calculate the CL or on the spatial location of the “designated feature” in a site. Determining the most appropriate CL therefore involves using expert judegement to make decisions with incomplete and uncertain information. Endorsement Theory (Cohen, 1985) and Dempster–Shafer statistics (Dempster, 1967; Shafer, 1976) are, respectively, a decision-theoretic and a statistical technique for reasoning under those conditions (uncertainty and incompletness). A key reason for applying these techniques is that they make expert opinion explicit and available for scrutiny. Both techniques have been applied to the problem of setting an appropriate site specific CL, using heathland sites as a case study. Inital findings are encouraging; the uncertainty in expert judgement is made explict, the end results are intuitively reasonable and the methodology apparently acceptable to decision makers. <\/dc:description><dc:date>\n        2007<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/1783\/1\/N001783JA.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Wadsworth, Richard A.; Hall, Jane R..  2007  Setting Site Specific Critical Loads: An Approach using Endorsement Theory and Dempster–Shafer.   Water Air and Soil Pollution: Focus, 7 (1-3). 399-405.  https:\/\/doi.org\/10.1007\/s11267-006-9084-8 <https:\/\/doi.org\/10.1007\/s11267-006-9084-8>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.springerlink.com\/content\/j54368u20m06j442\/?p=0f703171cbd54206b75979b942a2830b&pi=0<\/dc:relation><dc:relation>\n        doi:10.1007\/s11267-006-9084-8<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/1783\/","http:\/\/www.springerlink.com\/content\/j54368u20m06j442\/?p=0f703171cbd54206b75979b942a2830b&pi=0","doi:10.1007\/s11267-006-9084-8"],"year":2007,"topics":["Data and Information","Chemistry","Mathematics"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \n \n \nArticle (refereed) \n \n \n \nWadsworth, Richard A.; Hall, Jane R.. 2007 Setting Site \nSpecific Critical Loads: An Approach using Endorsement \nTheory and Dempster–Shafer. Water Air and Soil \nPollution: Focus, 7 (1-3). 399-405. doi:10.1007\/s11267-\n006-9084-8 \n \n \n \nCopyright © 2007, Springer \n \nThis version available at http:\/\/nora.nerc.ac.uk\/1783\/ \n \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the \njournal article, incorporating any revisions agreed during the peer \nreview process. Some differences between this and the publisher’s \nversion remain. You are advised to consult the publisher’s version \nif you wish to cite from this article. \n \nwww.springer.com \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnora@ceh.ac.uk \nSetting site specific Critical Loads \nRunning head: Setting site specific Critical Loads \nSetting site specific Critical Loads: an approach using \nEndorsement Theory and Dempster-Shafer. \nRICHARD A WADSWORTH* & JANE R HALL \n*corresponding author. \nCEH Monks Wood, Abbots Ripton, Huntingdon, Cambridgeshire, PE28 2LS, UK.  \nE-mail rawad@ceh.ac.uk \nTel: +44(0) 1487 772433 \nFax: +44(0) 1487 773467 \n 1\nSetting site specific Critical Loads \nAbstract \nThere is an increasing demand from conservation agencies for site-specific critical \nloads (CL); unfortunately, there is often very little specific information on a site to \ndetermine the important parameters needed to calculate the CL or on the spatial \nlocation of the \"designated feature\" in a site. Determining the most appropriate CL \ntherefore involoves using expert judegement to make decisions with incomplete and \nuncertain information. Endorsement Theory (Cohen 1985) and Dempster-Shafer \nstatistics (Dempster 1967, Shafer 1976) are, respectively, a decision-theoretic and a \nstatistical technique for reasoning under those conditions (uncertainty and \nincompletness). A key reason for applying these techniques is that they make expert \nopinion explicit and available for scrutiny. Both techniques have been applied to the \nproblem of setting an appropriate site specific CL, using heathland sites as a case \nstudy. Inital findings are encouraging; the uncertainty in expert judgement is made \nexplict, the end results are intuitively reasonable and the methodology apparently \nacceptable to decision makers. \nKeywords: Endorsement Theory, Dempster-Shafer, Uncertainty, site specific critical \nloads. \n \n1. Introduction. \nA Critical Load (CL) is “a quantitative estimate of an exposure to one or more \npollutants below which significant harmful effects on specified sensitive elements of \nthe environment do not occur according to present knowledge”. The concept arose in \nthe 1980’s as a response to concerns over transboundary (international) air pollution \nand particularly “acid rain”. Because of these concerns a tool or methodology was \nrequired to help in assessing the effect of  alternative policy options to control the \n 2\nSetting site specific Critical Loads \nemission of pollutants, and their subsequent dispersal, deposition and impact; CL \nwere therefore designed to work at the broad level of international agreements and \nprotocols (see http:\/\/critloads.ceh.ac.uk for more details). They are most commonly \ncalculated for acidity (caused by sulphur and nitrogen oxides) and eutrophication \n(nitrogen); CL are calculated for soils and freshwaters. Over the last two decades a \nnumber of refinements to the methodology and data have been made, however, across \nall of Europe there are only a handful of locations where all the information required \nto calculate the soil acidity CL has been measured. Recently there has been an \nincreasing demand from conservation agencies for site-specific CL, particularly for \nsites designated for biological conservation (Special Areas of Conservation, Special \nProtection Areas, etc.). Using national data to generate site specific values can give \nmisleading results; generally the location of the boundaries of the site are unavailable \nand the site is reduced to a “point”, national data use of the dominant soil and land \ncover in a one kilometre square and these may be wrong or inappropriate for the site. \nIn a national estimate with many hundreds of sites these errors will cancel each other \nout and a robust estimate can be made (of the national situation), but for someone \nfamiliar with a particular site any discrepancies will be disconcerting. \n \nThere is usually only a limited amount of relevant site-specific information and what \ninformation that is available often requires interpretation. One piece of information \nthat is always available from the Conservation Agencies is the vegetation type, which \nis always described within well defined and detailed classification systems. We \nsought an analysis method that would allow us to exploit whatever local information \nwas available whilst making the uncertainty in expert opinion an explicit part of the \nreasoning process; Endorsement Theory (Cohen 1985) which was designed for \n 3\nSetting site specific Critical Loads \nreasoning with incomplete information meets these requirements. Confidence in the \nCL estimated from the site-specific information will be variable; the “best” CL value \nshould combine both the local and national estimates. We wished to keep the \nuncertainty in both estimates explicit and therefore combine both strands of evidence \nusing Dempster-Shafer (Dempster 1967, Shafer 1976) which in this context is \neffectively an extension of Bayesian statistics. \n \n2. Using Endorsement Theory to set site specific Critical Loads \nEndorsement Theory (ET) (Cohen 1985) is a form of reasoning with incomplete and \nuncertain evidence. The approach was developed in the AI (artificial intelligence) \ncommunity in an attempt to develop systems that could reason in a more human \nmanner and particularly the ability of human experts to “diagnose” situations with \nlimited information. The approach is particularly useful for: \n• Allowing inference to be made from partial knowledge.  \n• Making the reasoning process explicit, traceable and highly heuristic. \n• Avoiding the need to translate expert knowledge into numerical values. \nIn the case of trying to set a site specific CL we typically do not have much \ninformation on the environmental conditions in the designated site, even such crucial \ninformation as the soil series is not consistently readily available. Typically the \nlocation of the designated feature (ie, habitat or species) is unknown (or is \nunavailable), nor is there often information on the relationship between the designated \nfeature and the limited number of habitats for which CL methods are available. ET is \na way of marshalling whatever local information we may be able to obtain for a site \nand of providing a very simple indication of the expected reliability of the \ninformation. \n 4\nSetting site specific Critical Loads \nIn the UK soils have been categorised into six acidity CL classes; five for mineral and \norgano-mineral soils (Loveland 1991; Hornung et al, 1995), and a sixth class for the \npeat soils for which a different methodology is used (Calver et al 2004). For the \npurpose of using ET we consider each CL class as if it were a separate hypothesis. We \nseek to determine the extent to which the available data supports each hypothesis. The \nprocedure to produce an endorsement for a CL for a site can be summarised as;  \n• Determine what “designated features” exist on the site; these can be habitats or \nspecies and in general information on their exact location is unavailable. \n• Assume that protecting the existing vegetation will protect the designated \nfeature.  \n• Reclassify the recorded vegetation classes in terms of the National Vegetation \nClassification (NVC) (Rodwell 1991 et seq) (many sites are already described \nin terms of the NVC). \n• Using the descriptions in the Rodwell books obtain information about the \nenvironment where the relevant NVC class(es) is typically found. \n• Process the environmental information in Loveland (ibid) to produce Look-up-\nTables of the “weight of evidence” than an environmental factor gives to each \nCL class. \n• Link the environmental information from the NVC to the environmental \ninformation in Loveland (ibid) on the basis of common terms and synonyms. \n• Combine the “weights of evidence” for all the environmental factors relating \nto an NVC class to produce an “endorsement” for each CL class. \n \n2.1 Primary information sources \n 5\nSetting site specific Critical Loads \nInformation on the designated features and the vegetation cover of the designated sites \nis always obtainable from the Conservation Agencies and will not be discussed \nfurther. \n \nThe NVC (Rodwell 1991 et seq) is the de-facto standard description of natural and \nsemi-natural vegetation communities in the UK. Each class is described over several \n(~10) pages of text, but, the amount of environmental information (soils, geology, \ntopography, climate, geography, management etc.) is inconsistent; communities are \nalso very variable in their fidelity to particular conditions. Information about each \nclass has been extracted and stored in an MS Access database as text using Rodwell’s \nvocabulary; examples for two heath communities are shown in Table 1.   \nTable 1. About here. \nLoveland (ibid) uses the methodology documented in Hornung et al (1995) to allocate \n298 soil associations in England and Wales into one of the six CL acidity classes. \nInformation on the physical characteristics of the dominant soil series in each \nassociation is also provided, for example, for the Worcester association (431): \nGeology:  Permo-Trias red mudstone, \nMineralogy:  Chlorite \/ carbonates, \nTexture:  Clayey \/ fine loam, \nLand Use:  Stock rearing \/ arable, \nComment:  Slow drainage.   \nCL class: 2.0-4.0 keq ha-1 yr-1 \nAll soil associations are described in the national hierarchical soil classification \nscheme (NSRI, Soil Survey 1985); the Worcester association (431) being: \nMajor group:  Pelosols, \n 6\nSetting site specific Critical Loads \nSub-group:  Argillic pelosols, \nType:   Typical argillic pelosol. \n \nThe data in Loveland has been summarised into seven look-up-tables (LUT); “soil \nassociation”, “major group”, “sub-group”, “type” “texture”, “geology” and  \n“comment”, (that is excluding “mineralogy” and “land use”). In each LUT the cells in \nthe table record the number of soil associations that share a particular attribute and \nhave been allocated to a particular CL class. In Table 2 (an example LUT) it can be \nseen that there are a total of 130 soil associations in the major group “brown soils”, of \nwhich three have a CL of 0-0.2 keq ha-1 year-1; 27 have a CL of 0.2-05 keq ha-1 year-1; \n57 a CL of 0.5-1.0 keq ha-1 year-1 and so on.  \nTable 2 about here. \nTable 2 shows that some “major groups” have a high fidelity to a particular CL class \neg. “podzol”, others eg “brown soils” are much more variable and the “lithomorphic” \ngroup appears to be bi-modal (those  derived from chalk and limestone versus those \nderived from granite and sandstone). \n \nExpert opinion is used to decide how much “weight of evidence” should be put on \neach entry in the LUT; for example how much reliance should be put on the \nobservation that 3 out of 130 soil associations in the “brown soil” group have a low \nCL and how much weight should be given to the observation that 20 out of 29 \n“podzol” group have a high CL? We contend that most people consider that 20 out of \n29 provides stronger evidence than 3 out of 130; the question is how to express that \nbelief? In a standard knowledge engineering approach numerical scales are used eg \nchoose a number between 0 and 10. In ET the scale is expressed in words (eg weak, \n 7\nSetting site specific Critical Loads \nstrong, overwhelming) and it is the responsibility of the domain expert and not the \nknowledge engineer to define this “scale”. We used a scale with four categories; \n“strong”, “moderate”, “weak” and “very weak”. Other experts may prefer other \ncategories; in the context of land cover change Comber et al (2003) use; “conclusive”, \n“prima-facie”, “strong” and “weak”; whatever scale is chosen by the domain expert \nthey have to be explicit. Having defined their scale the expert needs to allocate each \nvalue in the LUT into one of their categories. In this case the two cells marked “s” in \nTable 2 are the only ones to provide a “strong” weight. \n \n2.2 Relating NVC soils information to soils terminology used by Loveland \nThe environmental information provided about each NVC classes needs to be related \nto the terminology used by Loveland.  Sometimes there is an exact correspondence \nbetween terms used in the NVC and in Loveland and the NSRI. More often terms are \nsimilar but different, for example, “brown soil” in Loveland and “brown earth” in the \nNVC. In some cases there is no correspondence; for example, several NVC \ncommunities are associated with the “Borrowdale Volcanics” in the Lake District, but \nLoveland does not use that term. A LUT is used to relate the NVC terms to the \nLoveland terms, in linking the terms we are conservative and when in doubt we do not \ninfer a connection. \n \n2.3 Combining the Evidence to produce an Endorsement \nThe weights of evidence for each piece of environmental information are collated and \ncombined to produce an overall endorsement for each CL class for the NVC class in \nquestion; in ET the categories are determined by the domain expert and are expressed \nin words not numbers. We use a scale with five levels of endorsement:  \n 8\nSetting site specific Critical Loads \n• “Definitive”, three pieces of “strong” evidence and no conflicting evidence. \n• “Confident”, two pieces of “strong” evidence and no “strong” conflict. \n• “Likely”, at least one piece of “strong” evidence or three “moderates” \n• “possible”, at least one “moderate” or two “weak” pieces of evidence. \n• “weak”, at least one piece of evidence. \n \nTable 1 shows the environmental data for two NVC heathland classes: H1 (Calluna \nvulgaris-Festuca ovina) and H21 (Calluna vulgaris-Vaccinium myrtillus-Sphagnum \ncapillifolium).  There are multiple entries for some attributes (for example H1 has \nthree references to geology) and each of these “statements” is treated independently \nand given equal weight. Table 3 provides all the evidence for H1 that could be \nextracted.  \nTable 3 about here. \nIn this case we cannot give a “definitive” endorsement but we are “Confident” that the \nH1 heath should have a CL class 0.2-0.5keq ha-1yr-1. It is “Likely” that the CL is \nlower but there are only “weak” or “possible” endorsements for a higher CL. \nRepeating the process with H21 reveals a problem; H21 is associated with \n“fragmentary humic ranker” soils which are in the lithomorphic group. Most (20 out \nof 25) lithomorphic soils (the rendzinas) have a high CL (as they are derived from \nchalk or limestone).  This leads to a strong endorsement for a high CL for H21, \nwhereas a lower CL is more appropriate for humic ranker soils. \n \nOf the 22 NVC Heaths none were awarded a “definitive” endorsement and only five \nhad a “confident” attribution. Twelve Heaths are associated with rankers \n(lithomorphic soils) and therefore like H21 have erroneous “Likely” endorsements for \n 9\nSetting site specific Critical Loads \na high CL. If a strict interpretation of the “precautionary principle” were adopted (ie, \nany evidence no matter how weak) all but two of the Heaths would be allocated to the \nlowest CL class. \n \n3. Combining National and Local Estimates \nET provides an estimate of the CL for a site based on knowledge about the NVC \nclasses; however, the CL can also be estimated from the national-scale data \n(http:\/\/critloads.ceh.ac.uk) based on the dominant soil in each 1km grid square. In \ncombining the local (ET approach) and the national data we assume: \n• Both strands of evidence are uncertain. \n• Both strands of evidence have value. \nTo combine both estimates we need to either convert the national estimates into words \nto be compatible with ET or convert the endorsements from words to numbers, we \nchoose the latter. Bayesian inference is concerned with the extent to which our belief \nin a hypothesis increases or decreases as a new piece of evidence becomes available. \nDempster-Shafer (DS) (Dempster 1967, Shafer 1976) can be considered an extension \nof the Bayesian approach which is useful because: \n• it provides an explicit representation of uncertainty and,  \n• weak evidence for something does not imply strong evidence for the opposite. \nIn DS belief and plausibility provide the upper and lower bounds of probability for a \nproposition; belief+uncertainty=plausibility and belief+uncertainty+disbelief=1. \n \n3.1 Estimating uncertainty \nHall et al (2004) investigated the uncertainty in national estimates using a Monte \nCarlo approach. They generated a mean CL and variance for every one km square \n 10\nSetting site specific Critical Loads \nbased on the dominant and sub-dominant soils; and showed that the assumption of a \nGaussian distribution was reasonable. Given a mean and standard deviation the \nprobability (belief) that the true value is within any particular range can be easily \ncalculated from the cumulative probabilities of the class limits, (eg using “normdist” \nin Microsoft Excel). Converting the ET endorsements into numerical values is a \nclassic knowledge engineering problem and the values in Table 4 express our expert \nopinion, the key methodological issue is that they are explicit, and therefore open to \nscrutiny and investigation into how sensitive the results are to the values selected. \nTable 4 about here. \n \n3.2 Mathematical formulation \nTo combine two strands of evidence we use the form of DS suggested by Tangestani \n& Moore (2002):  \nB12 = (B1* B2 + B1*U2 + B2*U1) \/ β     Equation 1. \nβ = 1 – B1*D2 – B2*D1     Equation 2 \nWhere: \nB = belief, D = disbelief & U = uncertainty; \nβ is a normalising factor, (to ensure that B + D + U = 1).   \n \n3.3 A worked example \nConsider a site covered in H1 heath where the national data estimate a mean CL of \n0.6 keq ha-1 year-1, a standard deviation of 0.2 and a Gaussian distribution. Table 5 \nsummarises the beliefs from the ET (local) and national estimates. \nTable 5 about here \n 11\nSetting site specific Critical Loads \nThe strongest endorsement is for the CL class 0.2-0.5 keq ha-1 year-1. From Table 5; \nB1=0.75, U1=0.2, D1=0.05 & B2=0.286, U2=0.0, D2=0.714. Applying the equations: \nβ = (1 – 0.75*0.714 – 0.286*0.05) = 0.450 \nB12 = (0.75* 0.286 + 0.75*0.0 + 0.286*0.2) \/ 0.450  = 0.604 \nIn contrast the national data give the highest probability to the hypothesis of CL class \n0.5-1.0 keq ha-1 year-1; from Table 5; B1=0.25, U1=0.3, D1=0.45 & B2=0.669, U2=0.0, \nD2=0.331 Applying the equations: \n β = (1 – 0.25*0.331 – 0.669*0.45) = 0.616 \nB12 = (0.25* 0.669 + 0.25*0.0 + 0.669*0.30) \/ 0.616 = 0.597 \nThe beliefs in the other classes are small, for example the combined belief that the CL \nclass is 1.0-2.0 keq ha-1 year-1 is 0.013. As the hypotheses are independent the Beliefs \ndo not sum to one. In this case the inclusion of knowledge about the vegetation \ncommunity at the site will lead us to revise the CL downwards from the national \nestimate. If the more traditional Bayesian statistic is used (allocating all uncertainty to \ndisbelief) the conclusion to revise the CL downwards is stronger (belief in CL class \n0.2-0.5 is 0.546 and in CL class 0.5-1.0 is 0.403). \n \n4. Conclusions \nUncertain, incomplete and contradictory information is common in all areas of \nenvironmental science. Decision makers and land managers want estimates specific to \na particular designated site but they lack resources to make the required \nmeasurements. Data collected to assess national or super-national concerns will not be \nideal for site specific concerns. Endorsement Theory allows incomplete information \nto be assessed and combined in a way that makes expert opinion explicit, traceable \nand transparent; for each piece of evidence we know where it came from, what \n 12\nSetting site specific Critical Loads \n“weight” it was given by the expert and how the evidence was combined to produce \nan endorsement. The reasons for the endorsement of any hypothesis can be clearly \nidentified and tested against other opinions. There are a number of technical issues \nconcerned with the use of Endorsement Theory that need further investigation, but \nperhaps more important is the fact that non-numeric methods like Endorsement \nTheory are not widely used, and the extent to which there will be cultural and \norganisational resistance to their use needs to be investigated. The Dempster-Shafer \nformalism allows the combination of uncertain information when the probability \nmodel can be assumed to be complete. Combining the two approaches provides a \nuseful tool for combining variable and incomplete information to provide a better \nestimate of CL for a site. \n \nAcknowledgements. \nSome of the ideas expressed in this paper were developed during a contract funded by \nthe UK Environment Agency, project manager, Dr. Rob Kinnersley. We wish to thank \nthe referees for important pointers in making this paper more readable. \n \nReferences \nCalver, L.J., Cresser, M.S. & Smart, R.P.  2004.  Tolerance of Calluna vulgaris and \npeatland plant communities to sulphuric acid deposition.  Chemistry and \nEcology, 20, 309-320. \nCohen P.R. 1985. Heuristic reasoning about uncertainty: an artificial intelligence \napproach. Boston, Pitman Advanced Publishing. \nComber A.J., Law A.N.R & Lishman J.R. 2003. A comparison of Bayes’, Dempster-\nShafer and Endorsement theories for managing knowledge uncertainty in the \n 13\nSetting site specific Critical Loads \ncontext of land cover monitoring. Computers, environment and urban systems \n28 311-327 \nDempster, A.P. 1967. Upper and lower probabilities induced by a multi-valued \nmapping. Annals Math. Star. 38, 325-339. \nHall, J., Ullyett, J., Heywood, L., Broughton, R. & Fawehinmi, J.  2004.  The \nNational Critical Loads Mapping Programme Phase IV.  Final report to Defra: \nJuly 2001 – June 2004 (Contract EPG 1\/3\/185). \nHornung M., Bull K.R., Cresser M., Hall J., Langan S.J., Loveland P. & Smith C. \n1995. An empirical map of critical loads for acidity in Great Britain. \nEnvironmental Pollution 90 301-310. \nLoveland P.J. 1991. The classification of the soils of England and Wales on the basis \nof mineralogy and weathering – the Skokloster Approach. A report to the Dept. \nof the Environment under Research Contract Reference No. PECD 7\/12\/44 \nRodwell J.S. (editor), 1991. British Plant Communities. 5 volumes. Cambridge \nUniversity Press. Cambridge. \nSoil Survey of England and Wales. 1983. Legend for the 1:250,000 Soil Map of \nEngland and Wales. Soil Survey of England and Wales. Rothamsted \nExperimental Station, Harpenden, Herts, AL5 2JQ. \nShafer, G. 1976. Mathematical Theory of Evidence. Princeton University Press, \nPrinceton, N.J. USA, \nTangestani M.H. & Moore F. 2002. The use of Dempster-Shafer model and GIS in \nintegration of geoscientific data for porphyry copper potential mapping, north of \nShahr-e-Babak, Iran. International Journal of Applied Earth Observation and \nGeoinformation, 4: 65-74.  \n \n 14\nSetting site specific Critical Loads \nTables \n \n1. Examples of Environmental Information abstracted from Rodwell (1991) \n2. Example Look-up-Table of major soil group by Critical Load Class (values in \ncells are the number of soil associations with those characteristics). \n3. Endorsement Summary for H1 Calluna vulgaris - Festuca ovina Heath \n4. Conversion of Endorsement to numerical Belief and Uncertainty \n5. Combined information for worked example \n \n 15\nSetting site specific Critical Loads \n \nTable 1 \nExamples of Environmental Information abstracted from Rodwell (1991) \n H1 Calluna vulgaris - \nFestuca ovina heath \nH21 Calluna vulgaris - \nVaccinium myrtillus - Sphagnum \ncapillifolium heath \nSoil Series Newport + \nWorlington \n \nSoil Type Brown sands + \nNon-calcareous brown sands \nFragmentary humic rankers \nSoil Texture Sandy + \nSandy-skeletal \n \nGeology Sandy glacio-fluvial drift + \nArenaceous + \nAeolian sand \n \nSoil pH Acid + \nLow surface pH \n \nSoil Nutrient \nstatus \nOligotrophic + \nImpoverished \n \nSoil Processes Signs of podzolisation  \nGeological \nprocesses \nPeriglacial sorting + \nDecalcification \n \nHydrology Free to excessively drained Free draining but always moist \nTopography Lowland + \n30m (1 to 76m) \nSteep sunless slopes + \n289m (15 to 640m) + \n34 degrees (3 to 90 degrees) \nManagement  Burning and grazing Very sensitive to burning \n \n \n \n \n \n \n \n \n \n 16\nSetting site specific Critical Loads \nTable 2 \nCount of soil associations by major soil group and critical load class. \nCritical Load Class (ranges in keq ha-1 year-1) \nMajor Group 0.0-0.2 0.2-0.5 0.5-1.0 1.0-2.0 2.0-40 peat Total\nbrown soil 3 27 57 3 40   130\nground-water gley 6 4 7 9 16  42\nLithomorphic 1 4   20 (s)  25\nman-made       5 5\nPeat       11 (s) 11\nPelosols   1 1  5  7\nPodzol 20 9     29\nraw gley    1    1\nsurface-water gley   6 9 30 3  48\n \nNotes.  \n(s) Groups that provide a strong endorsement for a CL class \n 17\nSetting site specific Critical Loads \n \n \nTable 3 \nEndorsement Summary for H1 Calluna vulgaris - Festuca ovina Heath \nCritical Load Class (ranges in keq ha-1 year-1)# LUT \n \nLoveland \nTerm \nNVC Term \n(Table 1) 0.0-0.2 0.2-0.5 0.5-1.0 1.0-2.0 2.0-4.0 \nNewport Newport  Strong     Soil name \nWorlington Worlington  Strong     \nBrown soil Brown \nsands \nV. weak Weak  Weak V. weak Weak Soil group \nBrown soil Non-\ncalcareous \nbrown sands\nV. weak Weak  Weak V. weak Weak \nSand Sandy Mod’ Weak    V. weak Soil \nTexture  \nSand Sandy-\nskeletal \nMod’ Weak    V. weak \nDrift (with \nsandstone | \npeat) \nSandy \nglacio-\nfluvial drift \nWeak  Weak  V. weak  V. weak \nSand \/ \nsandstone \nArenaceous Mod’ Weak   V. weak  \nGeology \n \n \nSand \/ \nsandstone \nAeolian \nsand \nMod’ Weak   V. weak  \nOverall Endorsements Likely Confident Possible Weak Possible \n# no evidence for the “peat” hypothesis which is omitted from this table. \n \n 18\nSetting site specific Critical Loads \n \nTable 4 \nConversion of Endorsement to numerical values of Belief , Uncertainty and Disbelief \nEndorsement Belief Uncertainty Disbelief \n“Definitive” 0.90 0.1 0.00 \n“Confident” 0.75 0.2 0.05 \n“Likely” 0.50 0.3 0.20 \n“Possible” 0.25 0.3 0.45 \n“Weak” 0.10 0.4 0.50 \n \nTable 5 \nSummary for the worked example \nCL Class# Endorsement \n(Table 3) \nEndorsement as \nnumbers  \n(Table 4) \nNational \n(with µ=0.6, σ=0.2, \nGaussian distribution) \n  Bel1 Unc1 Dis1 Bel2 Unc2 Dis2 \n0.0-0.2 Likely 0.50 0.3 0.20 0.021 0.0 0.979 \n0.2-0.5 Confident 0.75 0.2 0.05 0.286 0.0 0.714 \n0.5-1.0 Possible 0.25 0.3 0.45 0.669 0.0 0.331 \n1.0-2.0 Weak  0.1 0.4 0.50 0.023 0.0 0.977 \n2.0-4.0 Possible 0.25 0.3 0.45 0.0 0.0 1.0 \n# Class ranges in keq ha-1 year-1. \n 19\n"}