{"doi":"10.1017\/S026626710500060X","coreId":"93280","oai":"oai:eprints.lse.ac.uk:3124","identifiers":["oai:eprints.lse.ac.uk:3124","10.1017\/S026626710500060X"],"title":"Should citizens of a welfare state be transformed into “queens”? A response to Risse","authors":["Le Grand, Julian"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-10","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/93280.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/3124\/1\/SHOULD_CITIZENS_OF_A_WELFARE.pdf","pdfHashValue":"45a3c8a872ac195908e14a7714413cb32905e15d","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:3124<\/identifier><datestamp>\n      2017-10-05T13:54:25Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5341<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3839<\/setSpec><setSpec>\n      74797065733D434F4C4C53:4C53455F435F454F<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/3124\/<\/dc:relation><dc:title>\n        Should citizens of a welfare state be transformed into “queens”? A response to Risse<\/dc:title><dc:creator>\n        Le Grand, Julian<\/dc:creator><dc:subject>\n        HB Economic Theory<\/dc:subject><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:date>\n        2005-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/3124\/1\/SHOULD_CITIZENS_OF_A_WELFARE.pdf<\/dc:identifier><dc:identifier>\n          Le Grand, Julian  (2005) Should citizens of a welfare state be transformed into “queens”? A response to Risse.  Economics and Philosophy, 21 (2).  pp. 305-308.  ISSN 0266-2671     <\/dc:identifier><dc:relation>\n        http:\/\/www.journals.cambridge.org\/action\/displayJournal?jid=HEP<\/dc:relation><dc:relation>\n        10.1017\/S026626710500060X<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/3124\/","http:\/\/www.journals.cambridge.org\/action\/displayJournal?jid=HEP","10.1017\/S026626710500060X"],"year":2005,"topics":["HB Economic Theory"],"subject":["Article","PeerReviewed"],"fullText":"Economics and Philosophy, 21 (2005) 305–308 Copyright C© Cambridge University Press\ndoi:10.1017\/S026626710500060X\nSHOULD CITIZENS OF A WELFARE\nSTATE BE TRANSFORMED INTO\n“QUEENS”? A RESPONSE TO RISSE\nJULIAN LE GRAND\nLondon School of Economics\nMathias Risse has provided a thoughtful critique of my book, raising\nserious points about a major part of the argument. I am glad to have\nthe opportunity to reflect further on it.\nThe book contends that policy should be designed both to reflect\nthe fact that the people who provide public services such as education\nor health care are a combination of knaves (self-interested egoists) and\nknights (other-directed altruists), and to treat users of those services, not\nas passive victims of services (pawns), but instead as powerful consumers\n(queens). It discusses various ways in which this might be done including\nthe use of quasi-markets in service delivery (where tax funds are used to\nequalize everyone’s purchasing power for, say, education and health care,\nbut provision is left to a competitive market), and more direct ways of\nempowering citizens, such as a demogrant (a universal grant of capital to\neveryone on attaining the age of majority).\nRisse seems happy with the book’s arguments concerning the essen-\ntially empirical propositions relating to knights and knaves, and indeed\nsupports many of the policy ideas. He reserves his principal criticisms\nfor the philosophical justifications that I put forward for my normative\nposition that service users ought to be turned from pawns to queens.\nIn the book, I contend that the case for turning pawns to queens\ncan be made from any of three perspectives: liberal, welfarist, and\ncommunitarian. Risse argues that from each of these perspectives the\nargument is “weaker than [Le Grand] thinks.” First, the liberals. Risse\ndivides these into two – libertarians of a Nozickian kind and liberal\negalitarians of a Rawlsian kind – and claims that neither would support\nmyposition. This is primarily because I setmy arguments for transforming\n305\n306 JULIAN LE GRAND\nservice users from pawns into queens within the context of a universalist\nwelfare state. That is, I assume that the service whose users are to be\nempowered –whose pawns are to be transformed into queens – is financed\nfrom some form of redistributive taxation, and that the purchasing power\nfor the service concerned is equalized before the market or quasi-market\nis allowed to let rip. Risse argues a true libertarian would stop well before\nthis, on the grounds that redistributive taxation has no place in any scheme\nreally designed to promote people’s freedomof action. In contrast, a liberal\negalitarian would accept the need for redistributive taxation, but, in doing\nso, would acknowledge that the coercive element essential to such taxation\nmust imply that people are being treated to some extent as pawns. Hence\nshe too would not advocate pawns being turned completely into queens.\nAt a later stage in his review, Risse returns to this libertarian\/liberal\negalitarian divide, arguing that an American reader, likely to be more\nsubject to libertarian intuitions, would find it odd that I push for the\nempowerment of users but do not question the redistributivewelfare state,\nwhile a European one would find it peculiar that, while both she and\nI would accept the legitimacy of limiting (some) individuals’ freedoms\nthrough redistribution, I can still argue for users to be queens. Risse says\nthat “it is hard to have it both ways.”\nI would not presume to argue with a philosopher as to the way that\ndifferent schools of thought might react to my arguments, and I accept\nthe implied rebuke that my ascription of the label “liberal” to what are\nactually two very different positions was simplistic. But I will not accept\nthat my own position is in some way inconsistent. For my argument\nsimply represents a trade-off between different values, none of which\nhas lexicographic priority over another. I am not a pure libertarian, in the\nsense that I consider policies designed to promote liberty or freedom of\naction always and in every context dominate other concerns such as equity\nor social justice. Redistributive taxation and the equalization of people’s\nability to obtain health care and education is thus perfectly acceptable –\nand indeed desirable. On the other hand, I am not a pure egalitarian (or,\nperhapsmore accurately, equitarian) in the sense that I consider concerns of\nequity or social justice should always dominate every other consideration.\nSo a complete curb on everyone’s freedom of action in the name of equity\nis not acceptable. Since to achieve “full” equity and “complete” liberty\nsimultaneously is probably impossible, the aim is to find a policy solution\nthat achieves an acceptable measure of both equity and liberty, while\naccepting that neither objective is likely to be completely satisfied. And\nusing the revenue from redistributive taxation to move towards greater\nequality of capital ownership (as with the demogrant), or to equalize\npurchasing power in health care and education (as with quasi-market\nsystems of service delivery) seems to be an illustration of just such an\nacceptable balance.\nCRITICAL NOTICE 307\nOf course, the problem with that position for political philosophy is\nthat it does not really explain why this balance is acceptable but another is\nnot. Ideally therewouldbe an evenmore fundamental principle thatwould\ndetermine the point of an acceptable trade-off between liberty and equity,\nbut the search for such principle is well beyond my scope. However, I do\nhave other reasons why I believe that policy proposals that incorporate the\nbalance concerned are attractive. And this is where the welfare and what I\ncall the communitarian arguments come in (Risse points out – correctly –\nthat I only consider a welfarist interpretation of communitarianism).\nEssentially I argue that both the welfare of each individual, and the\nwelfare of others in the wider community, will be better served by these\npolicies than by alternative ways of providing services such as education\nand health care – especially those that give professionals control over\nthe allocation of children to schools or patients to hospitals, effectively\nreducing the users of these services to pawns. This is not because I believe\nthat the policies that turn pawns into queens do not have their problems\nwith respect to individual and communitywelfare; indeed, I refer to several\nof these difficulties in the book. It is just that I consider them superior in\nthese respects to the alternatives. Risse does not buy all my arguments,\nand I would accept some of his points (for instance, that we might place a\ngreater faith in the professionalsmaking decisions on behalf of users, if, as I\nadvocate elsewhere in the book,we could successfully line up knightly and\nknavish incentives). But ultimately this is more of an empirical question\nthan a philosophical one, and we probably need more evidence of the\nimpact of different systems on welfare before we can arrive at a definitive\nassessment.\nTo take up one specific point in this context. Discussing the proposal\nthat patients should have more control over their treatment, Risse argues\nthat “when it comes to resource distribution, each patient has an interest\nin her health and thus is a poor judge of how to distribute resources\nalso needed by others.” I agree with this in so far it refers to choice of\ntreatment, and indeed use similar arguments elsewhere in the book to\njustify GP fund-holding: the system where family practitioners hold the\nbudget for purchasing secondary care for their patients. But, so long as\nthere is available capacity in the relevant hospitals, it does not apply to\nchoice of hospital, once the diagnosis has been made and the appropriate\ntreatment specified; for in those circumstances one person’s choice does\nnot displace another’s. So the desirability of patient choice can depend on\nthe type of decision beingmade; and again a trade-off between patient and\nprofessional power may be necessary in certain circumstances.\nFinally, a specific point in a different context. Risse takes issuewithmy\nargument for state intervention indecisions concerning savings for old age.\nThe argument is that state intervention to encourage savings is justified\neven in a world of queens, because there is a form of market failure here:\nthat individuals have only a tenuous connection with their future selves\n308 JULIAN LE GRAND\nand hence impose external costs on those future selves by their current\nsavings (or lack of savings) decisions. Risse’s argument against this is that\neither it is rational for current individuals to neglect their future selves,\nin which case the state should similarly neglect them, or it is not rational,\nin which case the state would have no need to encourage savings over\nand above that which rational individuals are doing already. Here Risse is\nassuming that the state only has a responsibility to its current citizens. But\nI think it is reasonable to assume that it also has a responsibility to other\npeople who suffer external costs as a by-product of the actions of those\ncitizens, including those who live in other states, and, of more relevance\nto my argument, including those who live in the same state in the future.\nThe correction of external costs has always been seen as a proper role for\nthe state, and, in encouraging current individuals to save more and hence\nbenefit future individuals, the state is legitimately exercising that role.\n"}