{"doi":"10.1016\/j.agee.2008.10.019","coreId":"69499","oai":"oai:eprints.lancs.ac.uk:26414","identifiers":["oai:eprints.lancs.ac.uk:26414","10.1016\/j.agee.2008.10.019"],"title":"A cross-disciplinary toolkit to assess the risk of faecal indicator loss from grassland farm systems to surface waters.","authors":["Oliver, David M.","Fish, Rob","Hodgson, Chris J.","Heathwaite, A. Louise","Chadwick, David R.","Winter, Michael"],"enrichments":{"references":[{"id":1011214,"title":"A framework for valuing the health benefits of improved bathing water quality in the River Irvine catchment.","authors":[],"date":"2008","doi":null,"raw":"Johnson, E. K., Moran, D. and Vinten, A. J. A., 2008. A framework for valuing the health benefits of improved bathing water quality in the River Irvine catchment. J Environ. Manage. 87, 633-638.","cites":null},{"id":1016041,"title":"A survey of the production and use of animal manures in England and Wales. III. Cattle manures. Soil Use Manage.","authors":[],"date":"2001","doi":null,"raw":"Smith, K. A., Brewer, A. J., Crabb, J and Dauven, A., 2001. A survey of the production and use of animal manures in England and Wales. III. Cattle manures. Soil Use Manage. 17, 77-87.","cites":null},{"id":1012040,"title":"Catchment microbial dynamics: the emergence of a research agenda.","authors":[],"date":"2007","doi":null,"raw":"Kay, D., Edwards, A. C., Ferrier, R. C.,  Francis, C., Kay, C., Rushby, L., Watkins, J., McDonald, A. T., Wyer, M., Crowther, J. and Wilkinson, J., 2007. Catchment microbial dynamics: the emergence of a research agenda. Prog. Phys. Geog. 31, 59-76.","cites":null},{"id":1013179,"title":"Code of Good Agricultural Practice for the Protection of Water (The Water Code). Ministry of Agriculture, Fisheries and Food.","authors":[],"date":"1998","doi":null,"raw":"MAFF. 1998. Code of Good Agricultural Practice for the Protection of Water (The Water Code). Ministry of Agriculture, Fisheries and Food. London, UK.","cites":null},{"id":16691573,"title":"Council Directive 2006\/7\/EC of the European Parliament and of the council of 15 th","authors":[],"date":"2006","doi":null,"raw":"CEC, 2006. Council Directive 2006\/7\/EC of the European Parliament and of the council of 15 th February 2006 concerning the management of bathing water quality and repealing Directive 76\/160\/EEC. Off. J. European Union. L64, 37-51.","cites":null},{"id":1008048,"title":"Council Directive 2006\/7\/EC of the European Parliament and of the council of 15th","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":1007777,"title":"Council of the European Communities. Council Directive 200\/60\/EC of the European Parliament and of the council of 23","authors":[],"date":"2000","doi":null,"raw":"CEC, 2000. Council of the European Communities. Council Directive 200\/60\/EC of the European Parliament and of the council of 23 October 2000 establishing a framework for community action in the field of water policy. Official Journal of European Union L327, 1-72.","cites":null},{"id":1015204,"title":"Disproportionality as a framework for linking social and biophysical systems.","authors":[],"date":"2006","doi":null,"raw":"Nowak, P, Bowen, S., and Cabot, P. E., 2006. Disproportionality as a framework for linking social and biophysical systems. Soc. Nat. Res., 19, 153-173.","cites":null},{"id":1008602,"title":"Elicitation of expert knowledge for fuzzy evaluation of agricultural production systems.","authors":[],"date":"2003","doi":null,"raw":"Cornelissen, A.M.G., van den Berg J., Koops W.J., Kaymak, U., 2003. Elicitation of expert knowledge for fuzzy evaluation of agricultural production systems. Agric. Ecosyst. Environ. 95, 1–18.","cites":null},{"id":1014652,"title":"England Catchment Sensitive Farming Capital Grant Scheme 2008\/2009 Farmer Handbook. Available online at:","authors":[],"date":"2008","doi":null,"raw":"Natural England 2008. England Catchment Sensitive Farming Capital Grant Scheme 2008\/2009 Farmer Handbook. Available online at: http:\/\/www.defra.gov.uk\/farm\/environment\/water\/csf\/pdf\/CSF3%2008.pdf ( on 12 th October 2008). Nicholson, F. A., Groves, S. J. and Chambers, B. J., 2005. Pathogen survival during livestock manure storage and following land application. Biores. Tech., 96, 135-143.","cites":null},{"id":1013410,"title":"Enteric bacterial concentrations in reservoir feeder streams: baseflow characteristics and response to hydrograph events.","authors":[],"date":"1981","doi":null,"raw":"McDonald, A., and Kay, D. 1981. Enteric bacterial concentrations in reservoir feeder streams: baseflow characteristics and response to hydrograph events. Water Res. 15, 861-868.","cites":null},{"id":1014327,"title":"Erosion and subsequent transport state of Escherichia coli from cowpats.","authors":[],"date":"2005","doi":null,"raw":"Muirhead, R. W., Collins, R. P., and Bremer, P. J. 2005. Erosion and subsequent transport state of Escherichia coli from cowpats. Appl. Environ. Microbiol. 71, 2875-2879.","cites":null},{"id":1016315,"title":"Escherichia coli O157: burger bug or environmental pathogen?","authors":[],"date":"2006","doi":null,"raw":"Strachan, N. J. C., Dunn, G. M., Locking, M. E., Reid, T. M. S. and Ogden, I. D., 2006. Escherichia coli O157: burger bug or environmental pathogen? Int. J. Food Microbiol., 112, 129-137.","cites":null},{"id":1011693,"title":"Faecal indicator organism concentrations and catchment export coefficients in the UK.","authors":[],"date":"2008","doi":null,"raw":"Kay, D., Crowther J., Stapleton, C. M., Wyer, M. D., Fewtrell, L., Anthony, S., Bradford, M., Edwards, A., Francis, C. A., Hopkins, M., Kay, C., McDonald, A. T., Watkins, J. and Wilkinson, J., 2008b. Faecal indicator organism concentrations and catchment export coefficients in the UK. Water Res. 42, 2649-2661.","cites":null},{"id":1017378,"title":"Faecal indicator pollution from a dairy farm in Ayreshire, Scotland: source apportionment, risk assessment and potential of mitigation measures.","authors":[],"date":"2004","doi":"10.1016\/j.watres.2007.09.015","raw":"Faecal indicator pollution from a dairy farm in Ayreshire, Scotland: source apportionment, risk assessment and potential of mitigation measures. Water Res 42, 997-1012. Vinten, A. J. A., Douglas, J. T., Lewis, D. R., Aitken, M. N., and Fenlon, D. R., 2004. Relative risk of surface water pollution by E. coli derived from faeces of grazing animals compared to slurry application. Soil Use Manage. 20, 13-22.","cites":null},{"id":1009170,"title":"Farmyard point discharges and their influence on nutrient and labile carbon dynamics in a second order stream draining through a dairy unit.","authors":[],"date":"2008","doi":null,"raw":"Edwards, A. C. and Hooda, P. S., 2008. Farmyard point discharges and their influence on nutrient and labile carbon dynamics in a second order stream draining through a dairy unit. J Environ. Manage. 87, 91-99.","cites":null},{"id":1009553,"title":"Farmyards, an overlooked source for highly contaminated runoff.","authors":[],"date":"2008","doi":null,"raw":"Edwards, A. C., Kay, D., McDonald, A. T., Francis, C., Watkins, J., Wilkinson, J. R. and Wyer, M. D., 2008. Farmyards, an overlooked source for highly contaminated runoff.","cites":null},{"id":1006846,"title":"Fate of Escherichia coli originating from livestock faeces deposited directly onto pasture.","authors":[],"date":"2004","doi":null,"raw":"Avery, S. M., Moore, A., and Hutchison, M. L., 2004. Fate of Escherichia coli originating from livestock faeces deposited directly onto pasture. Lett. Appl. Microbiol. 3, 355-359.","cites":null},{"id":1012301,"title":"Fluvial forms and processes: a new perspective.","authors":[],"date":"1998","doi":null,"raw":"Knighton, D. 1998. Fluvial forms and processes: a new perspective. Arnold, London.","cites":null},{"id":1012560,"title":"Groundwater abstraction pollution risk assessment.","authors":[],"date":"2003","doi":null,"raw":"Lytton, L., Howe, S., Sage, R. and Greenaway, P., 2003. Groundwater abstraction pollution risk assessment. Water Sci. Tech. 47, 1-7.","cites":null},{"id":1017963,"title":"How to include economic analysis in TMDL allocation.","authors":[],"date":"2008","doi":"10.1061\/(ASCE)0733-9496(2008)134:3(214)","raw":"Zaidi, A. Z., deMonsabert, S. M., El-Farhan, R., 2008. How to include economic analysis in TMDL allocation. J. Wat. Res. Plan. Manage. 134, 214-223. List of Figure captions","cites":null},{"id":1009776,"title":"Improving food safety in the domestic environment: the need for a transdisciplinary approach.","authors":[],"date":"2005","doi":null,"raw":"Fischer, A. R. H., de Jong, A. E. I., de Jonge, R., Frewer, L. J., and Nauta, M. J., 2005. Improving food safety in the domestic environment: the need for a transdisciplinary approach. Risk Analysis 25, 503-514. Fish, R., Winter, M., Oliver D. M., Chadwick, D., Selfa, T., Heathwaite, L., Hodgson, C.","cites":null},{"id":1007504,"title":"Injecting social psychology theory into conceptualisations of agricultural agency: Towards a post-productivist farmer selfidentity?","authors":[],"date":"2006","doi":null,"raw":"Burton, R.J.F., and Wilson, G.A., 2006. Injecting social psychology theory into conceptualisations of agricultural agency: Towards a post-productivist farmer selfidentity? J. Rural Studies 22, 95-115.","cites":null},{"id":1007192,"title":"Integrated modelling of risk and uncertainty underlying the cost and effectiveness of water quality measures.","authors":[],"date":"2008","doi":null,"raw":"Brouwer, R. and de Blois, C., 2008. Integrated modelling of risk and uncertainty underlying the cost and effectiveness of water quality measures. Environ. Model. Software 23, 922-937.","cites":null},{"id":1012920,"title":"Integration for sustainable catchment management.","authors":[],"date":"2007","doi":null,"raw":"Macleod, C. J. A., Scholefield, D and Haygarth, P. M., 2007. Integration for sustainable catchment management. Sci. Total Environ. 373, 591-602.","cites":null},{"id":1008340,"title":"Management of livestock and their manure to reduce the risk of microbial transfers to water - the case for an interdisciplinary approach. Trends Food Sci.","authors":[],"date":"2008","doi":null,"raw":"Chadwick, D., Fish, R., Oliver, D. M., Heathwaite, L., Hodgson, C., and Winter, M., 2008. Management of livestock and their manure to reduce the risk of microbial transfers to water - the case for an interdisciplinary approach. Trends Food Sci. Tech. 19, 240-247.","cites":null},{"id":16691586,"title":"Manure management plan: a step by step guide for farmers. Viewed on 12 th","authors":[],"date":"2008","doi":null,"raw":"Defra 2003. Manure management plan: a step by step guide for farmers. Viewed on 12 th October 2008. Available online at: http:\/\/www.defra.gov.uk\/corporate\/regulat\/forms\/agri_env\/nvz\/manureplan.pdf Defra 2005. Producing a soil management plan for environmental stewardship. Viewed on th October 2008. Available online at: http:\/\/www.defra.gov.uk\/erdp\/pdfs\/es\/guidance\/es-soil-management-plan.pdf Duffy, G, Lynch, O. A. and Cagney, C., 2008. Tracking emerging zoonotic pathogens from farm to fork. Meat Science 78, 34-42.","cites":null},{"id":1008918,"title":"Manure management plan: a step by step guide for farmers. Viewed on 12th","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":1015474,"title":"Mitigation and current management attempts to limit pathogen survival and movement in farmed grasslands.","authors":[],"date":"2007","doi":null,"raw":"Oliver, D. M., Heathwaite, A. L., Hodgson, C. J. and Chadwick, D. R., 2007. Mitigation and current management attempts to limit pathogen survival and movement in farmed grasslands. Adv. Agron., 93, 95-152.","cites":null},{"id":1017668,"title":"Numbers of fecal streptococci and Escherichia coli in fresh and dry cattle, horse, and sheep manure.","authors":[],"date":"2005","doi":"10.1139\/w05-071","raw":"Weaver, R. W., Entry, J. A. and Graves, A., 2005. Numbers of fecal streptococci and Escherichia coli in fresh and dry cattle, horse, and sheep manure. Can. J. Microbiol. 51, 847-851.","cites":null},{"id":1014948,"title":"Pathogen survival during livestock manure storage and following land application.","authors":[],"date":"2005","doi":null,"raw":null,"cites":null},{"id":1013670,"title":"Prioritisation of farm scale remediation efforts for reducing losses of nutrients and faecal indicator organisms to waterways: a case study of New Zealand dairy farming.","authors":[],"date":"2008","doi":null,"raw":"Monaghan, R. M., de Klein, C. A. M., and Muirhead, R. W., 2008. Prioritisation of farm scale remediation efforts for reducing losses of nutrients and faecal indicator organisms to waterways: a case study of New Zealand dairy farming.  J Environ. Manage. 87, 609-622.","cites":null},{"id":1011392,"title":"Quantification and control of microbial pollution from agriculture: a new policy challenge?","authors":[],"date":"2008","doi":null,"raw":"Kay, D., Crowther, J., Fewtrell, L., Francis, C. A., Hopkins, M., Kay, C., McDonald, A. T., Stapleton, C. M., Watkins, J., Wyer, M. D., 2008a. Quantification and control of microbial pollution from agriculture: a new policy challenge? Environ. Sci. & Policy 11, 171-184.","cites":null},{"id":1017643,"title":"Relative risk of surface water pollution by E. coli derived from faeces of grazing animals compared to slurry application. Soil Use Manage.","authors":[],"date":"2004","doi":"10.1111\/j.1475-2743.2004.tb00332.x","raw":null,"cites":null},{"id":1017923,"title":"Spatial and time distribution of dairy cattle excreta in an intensive pasture system.","authors":[],"date":"2001","doi":"10.2134\/jeq2001.2180","raw":"White, S. L., Sheffield, R. E., Washburn, S. P., King, L. D., and Green, J. T., 2001. Spatial and time distribution of dairy cattle excreta in an intensive pasture system. J. Environ. Qual. 30, 2180-2187.","cites":null},{"id":1014018,"title":"Sub-set of UK time-series of monthly rainfall grids. NERC, Institute of Hydrology,","authors":[],"date":"1999","doi":null,"raw":"Morris, D. G. 1999. Sub-set of UK time-series of monthly rainfall grids. NERC, Institute of Hydrology, Wallingford.","cites":null},{"id":1010695,"title":"The conceptual basis for a decision support framework to assess the risk of phosphorus loss at the field scale across","authors":[],"date":"2003","doi":null,"raw":"Heathwaite, L., Sharpley, A. and Bechmann, M., 2003. The conceptual basis for a decision support framework to assess the risk of phosphorus loss at the field scale across Europe. J. Plant Nutr. Soil Sci. 166, 447-458.","cites":null},{"id":1017082,"title":"The impact of scientific information on ecosystem management: making sense of the contextual gap between information providers and decision makers.","authors":[],"date":"2008","doi":null,"raw":"vanWyk, E., Roux, D. J., Drackner, M. and McCool, S. F., 2008. The impact of scientific information on ecosystem management: making sense of the contextual gap between information providers and decision makers. Environ. Manage. 41, 779-791.","cites":null},{"id":1016800,"title":"The Met Office,","authors":[],"date":"2007","doi":null,"raw":"The Met Office, 2007. http:\/\/www.metoffice.gov.uk\/climate\/uk\/2005\/seasonal.html Accessed 12th October 2008.","cites":null},{"id":1006562,"title":"The Microbiology of Drinking Water Part 4 - A method for the isolation and enumeration of coliform bacteria and E. coli. The Environment Agency,","authors":[],"date":"2002","doi":null,"raw":"Anonymous. 2002. The Microbiology of Drinking Water Part 4 - A method for the isolation and enumeration of coliform bacteria and E. coli. The Environment Agency, UK.","cites":null},{"id":1010954,"title":"The survival of Faecal Indicator Organisms (FIOs) in soil, following dairy cattle slurry application to land by surface broadcasting and shallow injection. In; Potential for simple technology solutions in organic manure management.","authors":[],"date":"2008","doi":null,"raw":"Hodgson, C.J., Bulmer N. and Chadwick D.R. 2008 The survival of Faecal Indicator Organisms (FIOs)  in soil, following dairy cattle slurry application to land by surface broadcasting and shallow injection. In; Potential for simple technology solutions in organic manure management. Proceedings of the 13 th RAMIRAN International Conference, Albena, Bulgaria June 2008. ISBN 978-954-9057571-6-3182-187.","cites":null},{"id":1010432,"title":"Towards an integrated approach in supporting microbiological food safety decisions. Zoonoses Pub.","authors":[],"date":"2007","doi":null,"raw":"Havelaar, A. H., Braunig, J.,  Christiansen, K., Cornu, M., Hald, T., Mangen, M. J. J., Molbak, K., Pielaat, A., Snary, E., Van Pelt, W., Velthuis, A. and Wahlstrom, H. 2007. Towards an integrated approach in supporting microbiological food safety decisions. Zoonoses Pub. Health, 54, 103-117.","cites":null},{"id":1015769,"title":"Uncertainty in the environmental modelling process – a framework and guidance.","authors":[],"date":"2007","doi":null,"raw":"Refsgaard, J. C., van der Sluijs, J. P., Hoberg, A. L., and Vanrolleghem, P. A., 2007. Uncertainty in the environmental modelling process – a framework and guidance.","cites":null},{"id":1016560,"title":"Unpacking ‘participation’ in the adaptive management of social-ecological systems: a critical review.","authors":[],"date":"2006","doi":null,"raw":"Stringer, L. C., Dougill, A. J., Fraser, E., Hubacek, K., Prell, C. and Reed, M. S., 2006. Unpacking ‘participation’ in the adaptive management of social-ecological systems: a critical review. Ecol. Soc. 11, 39 (online).","cites":null},{"id":16691603,"title":"Unruly pathogens? Eliciting values for environmental risk in the context of heterogeneous expert knowledge Environmental Science","authors":[],"date":"2008","doi":null,"raw":"(submitted). Unruly pathogens? Eliciting values for environmental risk in the context of heterogeneous expert knowledge Environmental Science and Policy Goss, M and Richards, C., 2008. Development of a risk-based index for source water protection planning, which supports the reduction of pathogens from agricultural activity entering water resources. J Environ. Manage. 87, 623-632.","cites":null},{"id":1010085,"title":"Unruly pathogens? Eliciting values for environmental risk in the context of heterogeneous expert knowledge Environmental Science and","authors":[],"date":"2008","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-02","abstract":"Diffuse microbial pollution from agriculture is a key contributor to water quality impairment. Reducing the risk of microbial contamination of watercourses from agricultural sources requires both environmentally appropriate and socially acceptable mitigation and management approaches. A cross-disciplinary toolkit for on-farm microbial risk assessment is presented that can represent both social and environmental factors promoting or preventing the accumulation of faecal indicator organisms (FIOs) within the farm environment, and also their subsequent transfer to watercourses. Four key risk criteria were identified as governing FIO loss from land to water. These were ‘accumulating E. coli burden to land’, ‘landscape transfer potential’, ‘infrastructure’ and ‘social and economical obstacles to taking action’. The toolkit can be used to determine (i) the relative risk of a farm enterprise contributing to microbial watercourse pollution and (ii) appropriate and targeted mitigation to reduce the risk of FIO loss from land to water. A comparison of the toolkit output with microbiological water quality draining from three contrasting grassland farm enterprises provided a preliminary evaluation of the prototype approach. When applied to 31 grassland farm enterprises the toolkit suggested that 0% were categorised as negligible risk, 32% low, 65% medium, 3% high and 0% very high risk. Such qualitative risk-based tools can assist the policy community not only to target high risk areas, but also to develop mitigation strategies that are sensitive to the different ways in which risk is produced. Capacity for long-term cross-disciplinary research is argued to be the means by which these integrated and more sustainable solutions may emerge","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69499.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/26414\/1\/AEE_Oliver_et_al_corrected_manuscript.pdf","pdfHashValue":"0dce6246c5b0001ef0ec75925f9bcffd5611eed9","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:26414<\/identifier><datestamp>\n      2018-01-24T02:48:18Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4745<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A cross-disciplinary toolkit to assess the risk of faecal indicator loss from grassland farm systems to surface waters.<\/dc:title><dc:creator>\n        Oliver, David M.<\/dc:creator><dc:creator>\n        Fish, Rob<\/dc:creator><dc:creator>\n        Hodgson, Chris J.<\/dc:creator><dc:creator>\n        Heathwaite, A. Louise<\/dc:creator><dc:creator>\n        Chadwick, David R.<\/dc:creator><dc:creator>\n        Winter, Michael<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:description>\n        Diffuse microbial pollution from agriculture is a key contributor to water quality impairment. Reducing the risk of microbial contamination of watercourses from agricultural sources requires both environmentally appropriate and socially acceptable mitigation and management approaches. A cross-disciplinary toolkit for on-farm microbial risk assessment is presented that can represent both social and environmental factors promoting or preventing the accumulation of faecal indicator organisms (FIOs) within the farm environment, and also their subsequent transfer to watercourses. Four key risk criteria were identified as governing FIO loss from land to water. These were ‘accumulating E. coli burden to land’, ‘landscape transfer potential’, ‘infrastructure’ and ‘social and economical obstacles to taking action’. The toolkit can be used to determine (i) the relative risk of a farm enterprise contributing to microbial watercourse pollution and (ii) appropriate and targeted mitigation to reduce the risk of FIO loss from land to water. A comparison of the toolkit output with microbiological water quality draining from three contrasting grassland farm enterprises provided a preliminary evaluation of the prototype approach. When applied to 31 grassland farm enterprises the toolkit suggested that 0% were categorised as negligible risk, 32% low, 65% medium, 3% high and 0% very high risk. Such qualitative risk-based tools can assist the policy community not only to target high risk areas, but also to develop mitigation strategies that are sensitive to the different ways in which risk is produced. Capacity for long-term cross-disciplinary research is argued to be the means by which these integrated and more sustainable solutions may emerge.<\/dc:description><dc:date>\n        2009-02<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/26414\/1\/AEE_Oliver_et_al_corrected_manuscript.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.agee.2008.10.019<\/dc:relation><dc:identifier>\n        Oliver, David M. and Fish, Rob and Hodgson, Chris J. and Heathwaite, A. Louise and Chadwick, David R. and Winter, Michael (2009) A cross-disciplinary toolkit to assess the risk of faecal indicator loss from grassland farm systems to surface waters. Agriculture, Ecosystems and Environment, 129 (4). pp. 401-412. ISSN 0167-8809<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/26414\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.agee.2008.10.019","http:\/\/eprints.lancs.ac.uk\/26414\/"],"year":2009,"topics":["GE Environmental Sciences"],"subject":["Journal Article","PeerReviewed"],"fullText":" \n \nA CROSS-DISCIPLINARY TOOLKIT TO ASSESS THE RISK OF \nFAECAL INDICATOR LOSS FROM GRASSLAND FARM \nSYSTEMS TO SURFACE WATERS \n \n \nDavid M. Oliver*1, Rob D. Fish2, Chris J. Hodgson3,  \nA. Louise Heathwaite1, Dave R. Chadwick3 and Michael Winter2 \n \n \n \n1 Centre for Sustainable Water Management, Lancaster Environment Centre, Lancaster \nUniversity, Lancaster, LA1 4AP, UK. \n2 Centre for Rural Policy Research, Department of Politics, University of Exeter, Amory \nBuilding, Exeter  EX4 6RJ \n3 North Wyke Research, Okehampton, Devon EX20 2SB \n \nAbbreviations \nFIO: Faecal indicator organism \nFYM: Farmyard manure \nLU: Livestock units \nrBWD: revised Bathing Waters Directive \nWFD: Water Framework Directive \n \n \n \n*Corresponding author: David M. Oliver (d.m.oliver@lancaster.ac.uk). Tel: +44 (0)1524 \n510231, Fax: +44 (0)1524 510217.  \nAbstract \nDiffuse microbial pollution from agriculture is a key contributor to water quality impairment. \nReducing the risk of microbial contamination of watercourses from agricultural sources \nrequires both environmentally appropriate and socially acceptable mitigation and \nmanagement approaches. A cross-disciplinary toolkit for on-farm microbial risk assessment \nis presented that can represent both social and environmental factors promoting or preventing \nthe accumulation of faecal indicator organisms (FIOs) within the farm environment, and also \ntheir subsequent transfer to watercourses. Four key risk criteria were identified as governing \nFIO loss from land to water. These were ‘accumulating E. coli burden to land’, ‘landscape \ntransfer potential’, ‘infrastructure’ and ‘social and economical obstacles to taking action’. The \ntoolkit can be used to determine (i) the relative risk of a farm enterprise contributing to \nmicrobial watercourse pollution and (ii) appropriate and targeted mitigation to reduce the risk \nof FIO loss from land to water. A comparison of the toolkit output with microbiological water \nquality draining from three contrasting grassland farm enterprises provided a preliminary \nevaluation of the prototype approach. When applied to 31 grassland farm enterprises the \ntoolkit suggested that 0% were categorised as negligible risk, 32% low, 65% medium, 3% \nhigh and 0% very high risk. Such qualitative risk-based tools can assist the policy community \nnot only to target high risk areas, but also to develop mitigation strategies that are sensitive to \nthe different ways in which risk is produced. Capacity for long-term cross-disciplinary \nresearch is argued to be the means by which these integrated and more sustainable solutions \nmay emerge.  \n \nKeywords: cross-disciplinary, decision support, E. coli, faecal indicators, farm, mitigation, \nrisk \n \n \n \n1. Introduction \nDiffuse microbial pollution from agriculture is recognised as a major contributor to water \nquality impairment (Kay et al., 2007; Kay et al., 2008a; Monaghan et al., 2008). Faecally-\nderived pathogens such as Escherichia coli O157:H7 can impact not only on water quality but \nalso human health. Non-pathogenic microbial parameters, such as faecal indicator organisms \n(FIOs), can be used as surrogate measures of infection risk to humans (Kay et al., 2007) and \nare more easily monitored and studied in both laboratory and field environments. Risk \nassessment approaches addressing microbial transfers from farm environments have tended to \nfocus on the ‘farm-to-fork’ pathway of exposure (e.g. Havelaar et al., 2007; Duffy et al., \n2008), with approaches for assessing the risk of microbial impairment of watercourses at the \nfarm level remaining largely undeveloped. Yet the current trend suggests that human illness \nthrough environmental exposure to pathogens is increasing because the control of microbial \ntransmission in farm enterprises is more difficult relative to food manufacturing systems \n(Strachan et al., 2006). Furthermore, the policy and scientific context is changing. Emerging \nregulatory frameworks, such as the Water Framework Directive (WFD) (CEC, 2000) in \nEurope, and the revised Bathing Waters Directive (rBWD) (CEC, 2006) are driven, in part, by \nrecognition that microbial watercourse pollution is an important vector of disease \ntransmission, and that the ‘farm-to-field-to-water’ pathway may be significant in contributing \nFIOs and potential pathogens to receiving waters. Thus, land and farm management \napproaches designed to minimise microbial loss from land to water can be promoted to reduce \nthe agricultural contribution of FIOs to designated bathing waters.  \n \nWhile Vinten et al. (2008) suggest that there is a scarcity of quantitative information available \nto identify where FIO mitigation efforts would be most economically and technically \neffective we argue that qualitative risk assessment can often prove just as useful as \nquantitative strategies (Heathwaite et al, 2003). In fact, Goss and Richards (2008) argue that \ndevelopment of a risk-based index of the potential for pathogens from agricultural activity to \nimpact on water quality is required as an interim stage in the establishment of a fully \nquantitative microbial risk assessment approach.    \n \nThis paper outlines an approach to farm scale microbial risk assessment through which it may \nbe possible to apportion and act upon such risks in effective and measured ways. There is a \ngrowing body of empirical FIO-related science which can form the ‘evidence-base’ for good \nregulatory practice (Kay et al., 2008a) and the conceptual toolkit presented in this paper has \nbeen designed around the findings of existing research. The cross-disciplinary toolkit detailed \nin this paper is an integrated attempt to develop a more holistic account of FIO risk and its \nmanagement, as promoted by Chadwick et al. (2008) in their case for an interdisciplinary \napproach. Understanding the factors that promote or prevent the transfer of FIOs and potential \npathogens from livestock farming systems to watercourses is complex, and demands models \nof working that are explicitly cross-disciplinary in design. Not only must assessments of risk \naccount for heterogeneous physical landscapes and farm infrastructures, they must consider \nthe wider cultural and political economy of farming, particularly the processes that shape \nprevailing attitudes and influence farmers’ decisions to take action in complex ways (Burton \nand Wilson 2006). Approaches to agricultural risk assessment that fail to embrace both social \nand natural aspects of the farm environment may lead to pathways of environmental \nprotection that are disproportionate or inappropriate in conception (Nowak et al., 2006).  \n \nThe aim of this study was to (i) combine the knowledge of social and natural scientists and \nuse established natural and socio-economic indicators of risk to develop an integrated \nconceptual framework for a farm scale FIO risk assessment toolkit that allows those involved \nin land management to prioritise on-farm mitigation efforts for maximum effect; and (ii) \nprovide a preliminary on-farm evaluation of the toolkit by assessing the microbiological water \nquality of streams draining three contrasting grassland farms in the Taw catchment, North \nDevon (a predominantly surface water catchment).  \n \n2. Materials and methods \n2.1 The toolkit \nGeneric E. coli was used in the design of our toolkit because it is a relatively well researched \nFIO allowing us to draw on a body of published research in the development of our work. The \ntoolkit is a farm scale tool, consisting of four key risk criteria judged to influence FIO loss to \nwater, namely:  \n \n• accumulating E. coli burden to land;  \n• landscape transfer potential; \n• infrastructural characteristics of the farm enterprise;  \n• social and economic obstacles to taking action.  \n \nInsert Table 1 \n \nThe factors defining each of the risk criteria are listed in Table 1, along with the sources of \ndata required to populate each risk factor. The toolkit was designed to be parsimonious and to \ninclude only key risk factors whose contribution could be justified (by the existing empirical \nevidence-base) in terms of their impact on surface water receptors and whose site specific \ndata could be easily obtained by a field assessor and farm survey. The first criterion - E. coli \nburden to land - is designed to incorporate into the toolkit the FIO risks that arise from the \napplication and deposition of manures and faeces during farming activities. It represents all E. \ncoli inputs to land and is then normalised by the area of the farm with equal \napplication\/deposition to land assumed throughout the farm boundary. The second and third \ncriteria - Landscape transfer potential and Characteristics of infrastructure - encompass risks \narising from the physical characteristics and arrangement of the farmed landscape. ‘Transfer \npotential’ relates to the role of natural features (such as slope and soil type) on fostering or \npreventing FIO movement whereas ‘infrastructure’ relates to the role of technical and \nhistorical features, (such as the extent of farmyard drainage systems; or fenced-off \nwatercourses). Infrastructure also accounts for point source inputs of FIOs to agricultural \nenvironments associated with animal manure storage and hard standings and buildings used \nby livestock (Kay et al., 2008b). It is important to stress that rainfall was not built specifically \ninto the ‘transfer potential’ risk criterion. Instead, ‘transfer potential’ is more concerned with \nthe physical features of the landscape that may promote or hinder runoff generation should \nrainfall occur. However, rainfall is important in driving transfer processes. In this preliminary \nstudy, all farms assessed were linked spatially to a geographical location within the Taw \ncatchment, North Devon, but for application of the toolkit in other geographical regions of the \nUK it would be necessary to refer to a rainfall ‘look-up-table’, most notably in the form of the \nnationally available UK 30 year average rainfall records (Morris, 1999). This would allow for \nidentification of the annual rainfall (mm) associated with each farm location so to relate tool-\nkit output with associated relative rainfall levels across distinct areas of the UK. The fourth \ncriterion, social and economic obstacles to taking action addresses the structural and \nattitudinal factors that limit a farmer’s ability and inclination to manage for FIO risk. Here, \nrisk is understood to be the function of economic capacity (such as the influence of debt), \nvalues and competency (such as knowledge of diffuse pollution) and responsibility (such as \nthe underlying impact of regulation).  \n \nIn our toolkit these four components form the basis for an analytical framework by which an \nassessment of overall farm riskiness (with respect to both likelihood and magnitude of FIO \nloss from land to water) is conveyed. Microbial risk assessment involves determining the \nproduct of likelihood of microbial contamination and the magnitude of associated \nconsequences, the latter being the impact of the contaminated receiving waters draining from \nthe catchment to a designated bathing water sampling location (assumed equal for all farms in \nthis study). The framework is designed as a means of identifying factors on-farm which \nshould be targeted for mitigation and intervention. The tool conveys this information visually \non the basis of four axes, each representing one of the components of risk (see Figure 1). Each \nof the axes are made operational through recourse to quite different data sets, which have \nbeen normalised to a sliding scale of 0 (minimal risk) through 10 (worst-case risk) as a way of \ncomparing the relative influence of risk criteria in given circumstances. A concurrent plotting \nof each relative risk score allows us to produce a diagrammatic representation of: i) the farm’s \n‘overall’ riskiness, coupled with ii) an assessment of the direction of influence of key risk \ncriteria. The former is represented by the magnitude of co-ordinates plotted on each axis, the \nlatter by its shape. An example of a hypothetical farm scored using this toolkit is depicted in \nFigure 1. In this example the farm generates a large E. coli burden to land and the farmer \nfaces significant obstacles to taking action. While infrastructure is well maintained, the \nlandscape characteristics promote run off. Importantly, the framework assigns equal \nimportance to these risk criteria in order to make an assessment. This is because the approach \navoids allocating elevated importance to a particular criterion over another in making an \noverall judgment of risk. There is currently no integrated scientific and social scientific \nevidence base that has allowed us to make such a distinction and this reflects the prototypical \nnature of this work.  \n \nInsert Fig 1 \n \n2.1 Operationalising the tool kit  \nTo make the toolkit operational a series of judgements were made regarding how each axis \nfunctions. In the case of accumulating E. coli burden to land, the axis accounts for a first \napproximation of E. coli applied and deposited (via manures or faeces) to land per hectare \nover an annual period. Farm livestock numbers and manure spreading activity (obtained via \nfarmer survey) provide key information to generate an E. coli burden through time. \nImportantly, all manure spreading was conducted by the farmers rather than by contractors so \nsurvey details were considered as accurate as possible. Parameters and coefficients used to \ngenerate indicative accumulating E. coli burden to land for farms are detailed in Table 2. E. \ncoli burden can be calculated based on biological rules (exponential die-off) and empirical \ndata relating to manure generation per animal type. The dynamic load is derived using \ncalculations that relate daily additions of fresh faeces from all livestock and applied manures \nto a simultaneous exponential die-off equation (Equation 1) as governed by season and \nanimal\/manure type: \n     y = Ae-bx   (1) \n \nWhere y is the concentration on day x, A is the initial concentration, and b is the appropriate \nexponential die-off constant. Each additional day accounts for the contribution of fresh faecal \nadditions (zero die-off) plus the store of E. coli from all previous days (with accumulating \ndie-off accounted for). To constrain farmer uncertainties related to slurry and FYM volumes \nproduced per farm we back-calculated estimates of manure generated per day based on farm \nlivestock numbers and used experimentally derived manure store die-off rates to estimate the \nE. coli contributed to land for each application. A critical assumption was that any FYM \nundergoing storage (with no fresh additions) for a period exceeding three months would \ncontain negligible FIO levels as supported by literature evidence (Nicholson et al., 2005). \nAccumulating E. coli burden to land is dynamic through time and space but by using the \ntoolkit on an annual time-step and at the farm scale we were able to limit the uncertainties \nattributed to spatial distributions of livestock movements and their excretions across fields \nand instead consider the whole farm input for a given enterprise for a given year. To \nnormalise for farm area the total farm E. coli burden to land was divided by farm area using \navailable GIS data. To rank each farm in a relative manner based on E. coli burden to land we \ndefined a ‘worst case scenario’ for E. coli burden; one whereby a 1ha area is grazed by three \nbeef cattle and calves, 20 sheep and 20 lambs. This gave a stocking density of eight LU ha-1 \nand represented a realistic upper level of stocking densities in the UK. A high number of \nsheep and lambs were chosen because they shed higher numbers of E. coli relative to other \nlivestock (and also because sheep numbers are high in the Taw catchment). An example of \nthe modelled E. coli burden for a dairy farm surveyed in our study is shown in Figure 2 to \ndemonstrate the time-series input of E. coli from both grazing period and slurry applications \n(and hence combined input). In the example shown in Figure 2, dairy cattle graze between \nApril and September and the farmer spreads slurry on a weekly basis, throughout the year, \nusing a rotational spreading programme. Such high frequency spreading is typical of farms \nwith little storage capacity - 16% of dairy farms in England and Wales have less than 1 month \nstorage (Smith et al., 2001). However, the farm scale nature of the toolkit does not allow for \ndifferentiating which fields have had manure applied. The toolkit extracts the value of \nmaximum E. coli burden from each farm time-series plot and uses this as a relative indicator \nof maximum potential burden per farm, irrespective of rainfall. The maximum E. coli burden \nalways coincides with the time window of the designated bathing water season (May through \nSeptember) because of faecal inputs from grazing cattle and sheep and so represents a \nlegitimate ‘at-risk’ period too.  \n \nInsert Table 2 and Fig 2 \n \nIn the case of ‘Infrastructure’, ‘Transfer potential’ and ‘Obstacles’, all contain a series of \ndiscrete components which build an overall impression of axis significance. The toolkit \nrequired data in the form of readily accessible field data, farmer knowledge and nationally \navailable GIS databases (digital terrain models and digitised ordnance survey maps: see Table \n1). While the rationale for inclusion of the risk factors within each of the risk criteria was \nbased on current empirical research in the area of FIO-related watercourse pollution, \ndetermining their relative importance when operating at the farm scale has been beyond the \nscope of many research studies. In order for us to make some working assessments of how \nfactors embedded in these risk criteria could be assigned significance, we initiated a process \nof expert consultation: one that involved individuals with different disciplinary expertise to \npass judgement on the relative importance of possible controls on FIOs by way of a numerical \nweighting schedule. In particular, this process involved natural science experts gauging the \nrelative importance of bio-physical and management variables, and social-science experts \npassing judgement on social processes and structures. This process was not about generating \nan extensive sample of views. Rather, it was about developing indicative responses from \nrelevant disciplines that could help make our risk tool operational. A more detailed analysis \nand discussion of these expert consultation exercises is described in Fish et al. (submitted). \nBriefly, this approach made use of an electronic expert consortium comprising 28 members. \nMembers were selected based on their research history and expertise in their field. All 16 \nnatural science experts were required to have had experience within the sphere of FIO \nresearch in order to qualify for inclusion within the electronic consortium (c.f. Cornelissen et \nal., 2003). Inclusion of experts from various disciplines ensured that specific understandings \ninherent to particular disciplines were given an opportunity to contribute to the risk index and \ncompensated for conflicting points of view. The weightings reflect the current perceptual \nunderstanding of microbiologists, soil and contaminant scientists, manure management \nexperts, policy makers and geographers. For social science we solicited the views of those \nworking in rural geography, agricultural studies, agricultural economics, rural sociology and \npolitical science. The social scientists included in the process were identified via their \ninterests in rural environmental change, of which watercourse pollution was a substantive \nconcern. The foundations of the framework are the experts’ judgement, based on knowledge \nand experience gained during their professional activities. To avoid influencing opinion, the \nexperts were contacted electronically (via email) without forewarning and requested to assign \nan expert weighting to each risk factor listed in a formatted spreadsheet within a 4 week \nperiod. Importantly, the ranges of expert weightings have been retained and may be used in \nthe future for uncertainty assessment (Refsgaard et al., 2007). \n \nRisk factor weightings are shown in Table 3 together with an overview of how they were \ncharacterised and scored in relation to ‘real world’ data sets. These data sets included i) a \ndetailed farm management survey (135 structured questions – available upon request from \nauthor) of 31 farmers and ii) nationally available GIS datasets (derived from NextMap Britain \n5m DTM) and ordnance survey digital maps. Details of each farm were recorded and then \neach risk factor within each of the four risk criteria was assigned a magnitude in accordance \nwith the scoring system shown in Table 3 (whereby a score of 0 equated to lowest risk and \nscore of 1.0 equated to highest risk associated with each risk factor, given the farm \ncircumstances). This score was then multiplied by the expert weighting (relative importance) \nassociated with each risk factor. The conversion of farm survey responses into a scoring \nsystem for magnitude of risk is complex. Currently our study has presented this scoring \nsystem (Table 3) as a first approximation and is flexible so that it can be updated with \nadditional information. Specific information for FIOs is limited and often we have assumed \nlinear responses between a risk factor and its associated magnitude of risk (e.g. increase in \nslope is directly proportional to increase in risk). Linear responses are assumed in this first \napproximation because scale dependent data or evidence relating to critical ‘tipping’ points \nattributed to environmental variables are sparse for many of the risk factors. \n \nInsert Table 3 \n \nEach axis within the risk assessment toolkit was normalised so that a worst case scenario \nwould be represented as a risk index score of 10. Thus a risk index score of 10 on an axis \nrepresented a scenario indicative of both i) high likelihood of FIO loss from land to water \noccurring and ii) high magnitude of FIO loss from land to water occurring. The total risk \nscore (or co-ordinate per axis) for each risk criterion was defined by Equation 2: \n     \nRisk score per axis = 10 Σ (magnitude x weighting \/ worst-case magnitude x weighting)  (2) \n \nA farm scoring 10 on all axes (sum of 40) would equate to a polygon risk score of 100% and \nwould be at most risk of contributing to microbial watercourse impairment. All other scores \nwere normalised to this scale. The relative risk values (polygon scores) generated by the \ntoolkit were subdivided into 5 risk categories (0-20 = negligible; 21-40 = low; 41-60 = \nmedium; 61-80 = high; and > 80 = very high).  \n \n2.3 Farm description \nIn total, 31 livestock farms were assessed using the toolkit. All were predominantly grassland \nwith on average < 18% of land area used for arable\/forage crops.  However, only a selection \nof these farms could be monitored for microbiological water quality. A brief ‘storyboard’ \nlinked to three farms follows, based on information collected via farm survey, visual \nassessment, and GIS databases. Importantly, if available, farm management plans were \nrequested as part of the farm survey to help inform on-farm characteristics (e.g. Defra manure \nmanagement plan; Defra soil management plan) (Defra, 2003; Defra, 2005).   \n  \n2.3.1 Farm A \nFarm A is a 81 ha suckler beef enterprise. The farmer has sufficient labour to manage his \nenterprise effectively and although the farm carries debt this does not impact on his \nmanagement decisions. He has never received any grant aid for improving waste \nmanagement. The farmer holds an ‘entry level stewardship’ agreement, is part of the Assured \nCombinable Crops (ACC) Beef & Lamb quality assurance scheme and has attended farmer \ndiscussion groups on manure management. He is aware of his responsibilities under cross \ncompliance but is not able to explain what diffuse pollution means. He is university educated \nand has undertaken courses in land and livestock management at the local agricultural \ncollege. The farm is situated on slightly undulating land. A small stream re-emerges close to \nmain activity of the farm, having undergone subsurface flow following the route of a drainage \nditch. There are some significant areas of heavy clay soil but no soil compaction. There exists \na network of plastic pipes and drainage tiles which function well. Stock has access to streams \nfor drinking, but not for crossing. The area of the hard standing is 7488 m2 and is located \nabout 500 m from the nearest watercourse. Domestic waste is transferred to a ditch system \nand the yard drains over ground to the same ditch. Farmyard manure (of which ~ 850 t is \nproduced annually) is stored for extended periods of up to 1 year on a heap in the field. In \ntotal, 1076 m of farm tracks are situated within the farm boundary. The farm has 145 head of \ncattle which during grazing contribute approximately 6.8 x 1013 E. coli to land per annum (an \norder of magnitude less than that associated with Farm C and W). Land application of FYM is \nmade approximately 10 times a year at a rate of 4 t ha-1 but contributes negligible viable E. \ncoli because of the extensive manure storage time. \n \n2.3.2 Farm C \nFarm C is a 178 ha dairy farm. The farmer has insufficient labour to manage his enterprise \neffectively and the level of debt significantly effects business decisions. The farmer has \njoined up to ‘entry level stewardship’ but has never received any grant aid for waste \nmanagement. The farmer is aware of his responsibilities under cross compliance but he has \nnever heard of the term ‘diffuse pollution’. He left school before completing secondary school \neducation, and he has some modest formal training in land and livestock management. He has \nnot been exposed to new ideas by way of participating in professional discussion groups but \ndoes belong to the Dairy Farm Assurance Scheme. The enterprise is located in a gently \nundulating landscape and has several streams running through it, as well as a spring. The land \nis relatively free draining and there is no obvious evidence of soil compaction. The hard \nstanding is 14433 m2 and is located about 250 m from the nearest watercourse. The yard \ndrains underground to a stream. The farm disposes of its domestic waste water through a 100 \nyr old septic tank and soak-away in a field. The enterprise produces ~ 400 tonnes of solid \nmanure annually, which is either stored in the farm buildings or uncovered on a heap in the \nfield. Nearly 1.5Ml of dirty water is produced annually. This is held in an earth bank lagoon, \nwhich has ~ 1 month’s storage. Livestock drink from and regularly cross the stream.  Farm \ntracks total 680 m in length across the farm area. The farm has 400 dairy cattle and 35 calves, \ngenerating approximately 4Ml of slurry annually, which is stored in an additional earth \nbanked slurry store. The farmer makes over 40 applications of slurry to land per year \ndistributing in the region of 6.1 x 1013 E. coli to land per annum. Grazing livestock in \ncomparison contribute in the region of 2.01 x 1014 E. coli to land per annum. \n \n2.3.3 Farm W \nFarm W is a 53 ha suckler beef and sheep enterprise partially located within Dartmoor \nNational Park. The farm is a recent entrant into environmental stewardship and recently \nreceived a large grant to construct a covered dung store. While this farmer is struggling to \nremain economically viable under present market conditions he does have sufficient labour to \nmanage his farm effectively. The farm carries some debt but this does not greatly on \nmanagement decisions. The farmer did not complete secondary school and has no formal \ntraining in land and livestock management. He does not belong to any quality assurance \nscheme and has never participated in any professional discussion groups to improve the way \nhe manages his enterprise. The farmer is aware of his responsibilities under cross compliance \nbut has never heard of advisory information relating to soil and water management or heard of \nthe term diffuse pollution. The farm landscape is slightly sloping and has streams running \nthrough it. Unlike the other two case study farms the shape of the fields are typically convex. \nThe land is heavy but free from compacted soil. The landscape is supported by a network of \ndrains which were installed fairly recently and function effectively. The area of the hard \nstanding is 4754 m2 which drains either overground to a stream or into the domestic waste \nwater system. The domestic waste water is disposed of through a recently installed biofilter \nsystem. The nearest watercourse is less than 50 m from this area. The enterprise produces \nabout 440 t of solid manure annually and the covered manure storage facilities are adequate in \ntheir capacity. Grazing cattle have access to a watercourse for drinking and they cross these \nareas regularly. A total length of track of 230 m is distributed across the farm. The farmer has \n75 head of beef, and 400 sheep\/lambs. Manures are typically spread between January and \nMay, and November and December each year, accounting for an input of around 3.1 x 1013 E. \ncoli to land per year. The grazing livestock contribute approximately 4.6 x 1014 E. coli to land \nper year. \n 2.4 Microbiological sample collection \nMicrobiological water quality monitoring was undertaken on Farm A, C and W to provide a \npreliminary dataset against which to compare the resulting farm risk polygons. These three \nfarms were chosen because we were able to locate sampling points representative of farm \nlosses and free of upstream sources. Fortnightly samples were collected from each farm \nthrough the course of 2006. Stream discharge (Q) measurements were completed at each farm \nto obtain FIO flux data. Stream Q was estimated using the area-velocity method (Fetter, \n2001). Flow velocity was measured using a Valeport model 002 open channel flow meter \n(Valeport Ltd., UK). The cross sectional area of the stream as a function of water level was \ndetermined and a rating equation derived to describe the stage-discharge relationship \n(Knighton, 1998). A rating curve approach was used because the streams were too small to \nset up fixed gauging stations. Water samples were collected in pre-sterilized 500-ml, screw \ntop polypropylene bottles, stored on ice in a cool box and analyzed in the laboratory within 6 \nhr of collection. Standard methods of membrane filtration were used to determine bacterial \nconcentrations in water (Anon, 2002).  \n \n2.5 Statistical analysis \nMicrobial data were log transformed and statistical analysis was performed using these \ntransformed data. Comparison of microbial data was made using one-way ANOVA. The \nnormal distribution of the log transformed data was checked by assessment of probability \nplots and Bartlett’s test used to confirm homogeneity of variance.  \n \n3. Results \nEach farm storyboard is translated into an overall risk classification based on the four risk \ncriteria and is depicted visually to communicate where burdens of risk are greatest. Results \n(e.g. coordinates) for 31 participating farms are listed in Table 4. Example visual output from \nthe toolkit for the first 9 of the farms studied, in the form of farm risk polygons, is shown in \nFigure 3. The plotted co-ordinates of the farm risk polygon (equivalent to risk score) \ncorrespond to the risk category attributed to each farm. Of the 31 farms assessed, 0% were \ncategorised as negligible risk, 32% low, 65% medium, 3% high, and 0% very high risk.  \n \nInsert Table 4 and Fig 3 \n \nSpecifically, Farm A, C and W resulted in a low, medium and high risk classification, \nrespectively (with scores of 37, 47 and 65%, respectively). For Farm A the process of risk \nclassification suggests clearly that the issue of E. coli burden is relatively insignificant in this \ncase due to extended storage period of FYM and relatively low livestock faecal inputs. Issues \nof obstacles, transfer, and perhaps most significantly infrastructure (e.g. farmyard drainage) \nwould have warranted closer inspection with regards to mitigation had the E. coli burden \nposed a larger risk. In contrast, the overall narrative for Farm C translates into a medium risk \ncategorization. Again the process suggests that it is in the context of infrastructure that the \nburden of risk is greatest (e.g. poor manure storage facilities and dirty water contamination on \nthe farmyard), with some significant contributions to riskiness shaped by obstacles to taking \naction and issues of E. coli burden. Finally, the overall narrative for Farm W translates into a \nhigh risk categorization. Here it is issues of E. coli burden that are most problematic, \n(particularly due to the large number of sheep which are high E. coli shedding animals), but \nwith significant burdens of risk linked to all four criteria. For Farms A, C and W, the farm \nrisk polygons shown in Figure 3 can be associated with in-stream FIO data collected prior to \nexport from the farm from fixed monitoring points during the 1 year sampling period (Figure \n4). Box and whisker plots show the moments of the statistical distribution of FIO flux on \nFarm A, C and W throughout the annual sampling period. Fluctuations in FIO flux were \napparent throughout the year. For Farm A, measured flux on sampling dates ranged between \nlog100.47 and log103.13 CFU l-1s-1. On Farm C, the range in FIO loads was of a higher \nmagnitude (log103.09 to log104.98 CFU l-1s-1). Finally, Farm W had a range of FIO flux \nspanning log103.36 through to log106.33CFU l-1s-1. One-way ANOVA confirmed that there \nwas a significant difference between the loads from three farms that were monitored for \nmicrobial water quality. Further tests identified that Farm A exported significantly (P<0.0001) \nlower loads of E. coli than that associated with Farm C and W. There was no significant \ndifference (P>0.05) between Farm C and W.  \n \nInsert Fig 4 \n \n4. Discussion \nEffective and pragmatic approaches to tackling microbial pollution from agriculture at the \nfarm scale require identification and understanding of: (i) critical source areas (CSAs) of FIO \nloss; and (ii) management strategies to reduce risk. Any strategic risk assessment toolkit must \ntherefore capture the interplay and importance of different farm scale elements in order to \nidentify where mitigation might be made to constrain FIO loss from land to water to best \neffect. The cross-disciplinary toolkit is an approach that embodies a complex adaptive \nsystems way of thinking whereby research, and evidence-based policy too, shifts from a \ncommand and control mentality to dealing with unpredictable systems through integrating \ndiverse knowledge inputs into the process (Stringer et al., 2006; Macleod et al., 2007). The \ncross-disciplinary toolkit highlighted that changing farmer attitudes to manure and land \nmanagement is part of this process by which we can make our food and water safer, but that \nchanging attitudes is not always enough. Appreciation of this dynamic interplay of social and \nnatural processes at the farm scale and understanding this interaction will allow the policy \ncommunity not only to target high risk areas, but also develop mitigation strategies that are \nsensitive to the different ways in which risk is produced. Johnson et al (2008) argue that \ndecisions on how to manage water quality could be based on private, social or ecological \nconsiderations depending on specific management goals and our toolkit is one such \nmechanism by which to apportion such considerations. \n \nThe toolkit operates at the farm scale and the risk categorisation of each farm is derived with \nrespect to the likelihood of FIO contamination impacting on a receptor – in this case surface \nwaters. The approach demonstrates considerable compatibility with prevailing approaches to \nenvironmental risk management, most notably the source-pathway-receptor model (e.g. \nLytton et al, 2003). In the case of the cross-disciplinary toolkit the magnitude of the E. coli \nburden (source) is assessed in relation to factors (landscape, infrastructural and human \nmanagement related) that promote subsequent burden movement and delivery (via pathways) \nto surface waters (the receptor). This toolkit attempts to prioritise targeting of mitigation \nefforts within source, transfer, infrastructure or management related areas. Consequently, \nmitigation does not necessarily only need to take the form of physical changes in \ninfrastructure or landscape, but instead can be instigated through programmes of debt \nmanagement or accreditation in training to complement more traditional mitigation \napproaches such as those outlined in Oliver et al. (2007). Thus, the four axis approach \nsuggests that, if a given farm had a large E. coli burden but the landscape features translated \nto minimal transfer potential then minimal risk would transpire. However, the four axis \napproach allows for a source to be problematic if infrastructure is an issue irrespective of \nrunoff potential because of alternative transfer mechanisms relating to farmyard drainage and \nlinking farm tracks which may operate as rapid conduits of FIO transfer. So it follows that a \nhigh E. coli source area will be cancelled out if it is located within a landscape of low transfer \nrisk (e.g. the landscape acts as a ‘safety-net’), but infrastructural controls will also play a \nbearing and should be consulted as a third risk criterion allowing for connectivity via artificial \nroutes in the landscape (Edwards et al., 2008; Edwards and Hooda, 2008). Similarly, the \ndegree to which obstacles prevent a farmer from taking action to limit pollution are accounted \nfor within the framework.  \n \nMonaghan et al. (2008) suggest that the most effective mitigation strategies are those that \naddress the main sources of contaminants within a system such as the use of advanced pond \nsystems. Of course the human dimension must also be factored in to gain an appreciation that \nwhile infrastructure may be advantageous for limiting FIO loss from land to water, poor \nmanagement can over-ride its intended benefits. Management decisions governing \ndistribution of animal manures are critical social processes that vary in space and time and \ndisproportionality occurs when inappropriate social actions occur in vulnerable biophysical \nsettings (Nowak et al., 2006). This concept applies in reverse also; one farmer interviewed in \nour study had an astute awareness of diffuse pollution and stated: ‘diffuse pollution – that’s \ninsidious pollution coming from unidentifiable sources’. While this farmer demonstrated \nunderstanding of environmental contamination issues, the landscape and farm enterprise, \nthrough no fault of his own, conspired against him, predominantly due to the steeply sloping \nclay soils and large number of high-shedding sheep and lambs increasing the transfer and \nburden related risks, respectively. As noted by Fischer et al. (2005), the adoption of cross-\ndisciplinary research paradigms may offer the most relevant approach to developing solutions \nto real world problems.  \n \nTheoretically, we would have anticipated that each of the three monitored farms would be \nlinked to significantly different E. coli fluxes because of the contrast in risk class associated \nwith each farm. However, during 2006 annual rainfall for the south west of England was 1129 \nmm (The Met Office, 2007), 7% lower than the 1961-1990 long term average. The load \nexported from Farm A was particularly low due to the low flow characteristics of the \nsampling location given this low rainfall. Microbial data presented within this evaluation \ntherefore represented the results from a particularly dry year during which storm flow events \nwere scarce at the sampling sites. The toolkit was used to identify potential risk of farms \ncontributing FIOs to water, but for potential diffuse risk to become an actual risk, rainfall is \nneeded to act as a driving mechanism (though large volumes of wash water are used twice a \nday on dairy farms and so some point sources can be independent of rainfall). We can \nspeculate that had we obtained high flow event data, then the E. coli loads may have been \nseveral orders of magnitude higher than those reported (McDonald and Kay, 1981; Kay et al., \n2008b). Similarly, the range of flux data for both farms shown in Figure 2 would probably \nhave been much larger if wet weather had predominated.  \n \nIt is evident that farmers deal with ‘risk’ on a daily basis and that clearly they can be \ncategorised as ‘risk managers’. As such, farmers need to have access to, and accept and \nunderstand information about the microbial risks associated with farming practices. Our \nproposed toolkit is a mechanism through which we can combine risk assessment with risk \ncommunication. Therefore, not only does the toolkit integrate natural and socio-economic risk \nfactors in its assessment of risk, but it also operates as an easy-to-use tool for communicating, \nin a visual manner, the output of actual risk assessment to real end-users e.g. farmers or ‘risk \nmanagers’. As noted by van Wyk et al., (2008), decision makers are often overloaded with \ninformation and so there is an increased demand for tools that are credible yet simple. \n \nNot all risk factors within the four risk criteria can be modified via a mitigation approach. \nThus in the context of ‘E. coli burden’ it is reasonable to claim that changes could be made to \nlivestock numbers, livestock type, spreading rates and spreading times as strategies to reduce \nfarm scale risk. In the context of ‘landscape transfer potential’ it may be impossible to change \nslope, curvature or soil type but it may be possible to alter drainage and compaction to limit \nfarm scale risk. In terms of issues of ‘Infrastructure’ it is perhaps unrealistic to consider \nmitigation in the form of changing farmyard area and farm track coefficient but it is \nhypothetically possible to make interventions in farmyard drainage and roofing, storage \ncapacity and facilities, domestic wastewater treatment, gateway location and livestock access \nas a means of mitigating FIO loss from farms (e.g. via capital grant schemes for eligible farms \n[Natural England, 2008]). All risk factors linked to ‘obstacles to taking action’ could be \ntargeted for risk alleviation to some extent. In essence this sense in which it is not possible to \nalter some aspects of farm riskiness means that all farms will have a baseline level of risk \nwhich cannot be reasonably overcome, and indeed which may form the basis for a \nhypothetical ‘target’ polygon based on assessments of cost-effectiveness (e.g. Brouwer and de \nBlois, 2008; Zaidi et al., 2008). Finally, there is likely to be a degree of interdependency \nbetween risk factors used in the toolkit. Therefore, with continued evolution of this prototype \napproach it would be wise to undertake a full sensitivity analysis to determine the sensitivity \nof the toolkit output to changes in individual risk factors. \n \n5. Conclusion \nEmbracing a cross-disciplinary approach to farm FIO risk assessment allowed for an holistic \nevaluation of both landscape features and FIO sources in relation to land-owners capacities, \nknowledges and responsibilities to protect watercourses. The inclusion of both physical and \nsocio-economic risk factors extends the range of mitigation strategies available and reinforces \nthe advantages of coupling both natural and social sciences in farm-scale risk assessments. As \nour empirical evidence-base grows we can develop the toolkit so that it evolves from a \n‘device-to-aid-thinking’ into a more robust component of a quantitative risk assessment \napproach. As an example, we acknowledge that not all E. coli burden to land is of equal \nmobility and there is clear potential to accommodate ‘risk filters’ so as to account for different \nlevels of likely mobilisation and release of FIOs from the suite of faecal matrices encountered \nin the agricultural environment. This cross-disciplinary toolkit represents a first \napproximation of a combined approach to risk assessment and communication and offers a \nstraightforward mechanism of accounting for the main risk drivers of FIO loss from farm \nenterprises whilst also appreciating decision-making constraints. Further testing using a larger \nprogramme of monitored farms will provide additional qualitative and quantitative validation \nand enhance our understanding of the toolkit’s capabilities.  \n \nAcknowledgements \nThe authors would like to acknowledge the participation of the 28 anonymous experts for \ntheir valuable contributions in the risk factor weighting exercise and the farmers who allowed \naccess to their land and provided valuable cooperation during farm audits and management \ninterviews. We are also grateful to Dr Trevor Page for his help with Matlab coding and \nappreciate the valuable and constructive comments made by the Associate Editor and two \nanonymous referees. This work was funded as part of project RES-224-25-0086 by the Rural \nEconomy and Land Use (RELU) programme who receive financial support from the \nBiotechnology and Biological Sciences Research Council (BBSRC), the Natural Environment \nResearch Council (NERC), the Economic and Social Research Council (ESRC), the \nDepartment for Environment, Food and Rural Affairs (Defra) and the Scottish Office.  \n \nReferences \nAnonymous. 2002. The Microbiology of Drinking Water Part 4 - A method for the isolation \nand enumeration of coliform bacteria and E. coli. The Environment Agency, UK. \nAvery, S. M., Moore, A., and Hutchison, M. L., 2004. Fate of Escherichia coli originating \nfrom livestock faeces deposited directly onto pasture. Lett. Appl. Microbiol. 3, 355-\n359. \nBrouwer, R. and de Blois, C., 2008. Integrated modelling of risk and uncertainty underlying \nthe cost and effectiveness of water quality measures. Environ. Model. Software 23, \n922-937. \nBurton, R.J.F., and Wilson, G.A., 2006. Injecting social psychology theory into \nconceptualisations of agricultural agency: Towards a post-productivist farmer self-\nidentity? J. Rural Studies 22, 95-115. \nCEC, 2000. Council of the European Communities. Council Directive 200\/60\/EC of the \nEuropean Parliament and of the council of 23 October 2000 establishing a framework \nfor community action in the field of water policy. Official Journal of European Union \nL327, 1-72. \nCEC, 2006. Council Directive 2006\/7\/EC of the European Parliament and of the council of 15th \nFebruary 2006 concerning the management of bathing water quality and repealing \nDirective 76\/160\/EEC. Off. J. European Union. L64, 37-51. \nChadwick, D., Fish, R., Oliver, D. M., Heathwaite, L., Hodgson, C., and Winter, M., 2008. \nManagement of livestock and their manure to reduce the risk of microbial transfers to \nwater - the case for an interdisciplinary approach. Trends Food Sci. Tech. 19, 240-\n247. \nChambers B. J., Nicholson, R. J., Smith, K., Pain, B. F., Cumby, T. R., and Scotford, I. M., \n2001. Managing Livestock Manures: Booklet 2 – Making better use of livestock \nmanures on grassland. 24 pp. Defra, Noble House, Smith Square, London SW1P 3JR. \nCornelissen, A.M.G., van den Berg J., Koops W.J., Kaymak, U., 2003. Elicitation of expert \nknowledge for fuzzy evaluation of agricultural production systems. Agric. Ecosyst. \nEnviron. 95, 1–18. \nDefra 2003. Manure management plan: a step by step guide for farmers. Viewed on 12th \nOctober 2008. Available online at: \nhttp:\/\/www.defra.gov.uk\/corporate\/regulat\/forms\/agri_env\/nvz\/manureplan.pdf \nDefra 2005. Producing a soil management plan for environmental stewardship. Viewed on \n12th October 2008. Available online at: \nhttp:\/\/www.defra.gov.uk\/erdp\/pdfs\/es\/guidance\/es-soil-management-plan.pdf \nDuffy, G, Lynch, O. A. and Cagney, C., 2008. Tracking emerging zoonotic pathogens from \nfarm to fork. Meat Science 78, 34-42. \nEdwards, A. C. and Hooda, P. S., 2008. Farmyard point discharges and their influence on \nnutrient and labile carbon dynamics in a second order stream draining through a dairy \nunit. J Environ. Manage. 87, 91-99. \nEdwards, A. C., Kay, D., McDonald, A. T., Francis, C., Watkins, J., Wilkinson, J. R. and \nWyer, M. D., 2008. Farmyards, an overlooked source for highly contaminated runoff. \nJ Environ. Manage.  87, 51-59 \nFetter, C.W. 2001. Applied Hydrogeology. 4th ed. New Jersey: Prentice Hall. 598 p. \nFischer, A. R. H., de Jong, A. E. I., de Jonge, R., Frewer, L. J., and Nauta, M. J., 2005. \nImproving food safety in the domestic environment: the need for a transdisciplinary \napproach. Risk Analysis 25, 503-514. \nFish, R., Winter, M., Oliver D. M., Chadwick, D., Selfa, T., Heathwaite, L., Hodgson, C. \n(submitted). Unruly pathogens? Eliciting values for environmental risk in the context \nof heterogeneous expert knowledge Environmental Science and Policy \nGoss, M and Richards, C., 2008. Development of a risk-based index for source water \nprotection planning, which supports the reduction of pathogens from agricultural \nactivity entering water resources. J Environ. Manage. 87, 623-632. \nHavelaar, A. H., Braunig, J.,  Christiansen, K., Cornu, M., Hald, T., Mangen, M. J. J.,  \nMolbak, K., Pielaat, A., Snary, E., Van Pelt, W., Velthuis, A. and Wahlstrom, H. \n2007. Towards an integrated approach in supporting microbiological food safety \ndecisions. Zoonoses Pub. Health, 54, 103-117. \nHeathwaite, L., Sharpley, A. and Bechmann, M., 2003. The conceptual basis for a decision \nsupport framework to assess the risk of phosphorus loss at the field scale across \nEurope. J. Plant Nutr. Soil Sci. 166, 447-458. \nHodgson, C.J., Bulmer N. and Chadwick D.R. 2008 The survival of Faecal Indicator \nOrganisms (FIOs)  in soil, following dairy cattle slurry application to land by surface \nbroadcasting and shallow injection. In; Potential for simple technology solutions in \norganic manure management. Proceedings of the 13th RAMIRAN International \nConference, Albena, Bulgaria June 2008. ISBN 978-954-9057571-6-3182-187. \nJohnson, E. K., Moran, D. and Vinten, A. J. A., 2008. A framework for valuing the health \nbenefits of improved bathing water quality in the River Irvine catchment. J Environ. \nManage. 87, 633-638. \nKay, D., Crowther, J., Fewtrell, L., Francis, C. A., Hopkins, M., Kay, C., McDonald, A. T., \nStapleton, C. M., Watkins, J., Wyer, M. D., 2008a. Quantification and control of \nmicrobial pollution from agriculture: a new policy challenge? Environ. Sci. & Policy \n11, 171-184. \nKay, D., Crowther J., Stapleton, C. M., Wyer, M. D., Fewtrell, L., Anthony, S., Bradford, M., \nEdwards, A., Francis, C. A., Hopkins, M., Kay, C., McDonald, A. T., Watkins, J. and \nWilkinson, J., 2008b. Faecal indicator organism concentrations and catchment export \ncoefficients in the UK. Water Res. 42, 2649-2661. \nKay, D., Edwards, A. C., Ferrier, R. C.,  Francis, C., Kay, C., Rushby, L., Watkins, J., \nMcDonald, A. T., Wyer, M., Crowther, J. and Wilkinson, J., 2007. Catchment \nmicrobial dynamics: the emergence of a research agenda. Prog. Phys. Geog. 31, 59-\n76. \nKnighton, D. 1998. Fluvial forms and processes: a new perspective. Arnold, London. \nLytton, L., Howe, S., Sage, R. and Greenaway, P., 2003. Groundwater abstraction pollution \nrisk assessment. Water Sci. Tech. 47, 1-7. \nMacleod, C. J. A., Scholefield, D and Haygarth, P. M., 2007. Integration for sustainable \ncatchment management. Sci. Total Environ. 373, 591-602. \nMAFF. 1998. Code of Good Agricultural Practice for the Protection of Water (The Water \nCode). Ministry of Agriculture, Fisheries and Food. London, UK. \nMcDonald, A., and Kay, D. 1981. Enteric bacterial concentrations in reservoir feeder streams: \nbaseflow characteristics and response to hydrograph events. Water Res. 15, 861-868. \nMonaghan, R. M., de Klein, C. A. M., and Muirhead, R. W., 2008. Prioritisation of farm scale \nremediation efforts for reducing losses of nutrients and faecal indicator organisms to \nwaterways: a case study of New Zealand dairy farming.  J Environ. Manage. 87, 609-\n622. \nMorris, D. G. 1999. Sub-set of UK time-series of monthly rainfall grids. NERC, Institute of \nHydrology, Wallingford. \nMuirhead, R. W., Collins, R. P., and Bremer, P. J. 2005. Erosion and subsequent transport \nstate of Escherichia coli from cowpats. Appl. Environ. Microbiol. 71, 2875-2879. \nNatural England 2008. England Catchment Sensitive Farming Capital Grant Scheme \n2008\/2009 Farmer Handbook. Available online at: \nhttp:\/\/www.defra.gov.uk\/farm\/environment\/water\/csf\/pdf\/CSF3%2008.pdf ( on 12th \nOctober 2008). \nNicholson, F. A., Groves, S. J. and Chambers, B. J., 2005. Pathogen survival during livestock \nmanure storage and following land application. Biores. Tech., 96, 135-143. \nNowak, P, Bowen, S., and Cabot, P. E., 2006. Disproportionality as a framework for linking \nsocial and biophysical systems. Soc. Nat. Res., 19, 153-173. \nOliver, D. M., Heathwaite, A. L., Hodgson, C. J. and Chadwick, D. R., 2007. Mitigation and \ncurrent management attempts to limit pathogen survival and movement in farmed \ngrasslands. Adv. Agron., 93, 95-152. \nRefsgaard, J. C., van der Sluijs, J. P., Hoberg, A. L., and Vanrolleghem, P. A., 2007. \nUncertainty in the environmental modelling process – a framework and guidance. \nEnviron Model. Software 22, 1543-1556. \nSmith, K. A., Brewer, A. J., Crabb, J and Dauven, A., 2001. A survey of the production and \nuse of animal manures in England and Wales. III. Cattle manures. Soil Use Manage. \n17, 77-87. \nStrachan, N. J. C., Dunn, G. M., Locking, M. E., Reid, T. M. S. and Ogden, I. D., 2006. \nEscherichia coli O157: burger bug or environmental pathogen? Int. J. Food \nMicrobiol., 112, 129-137. \nStringer, L. C., Dougill, A. J., Fraser, E., Hubacek, K., Prell, C. and Reed, M. S., 2006. \nUnpacking ‘participation’ in the adaptive management of social-ecological systems: a \ncritical review. Ecol. Soc. 11, 39 (online). \nThe Met Office, 2007. http:\/\/www.metoffice.gov.uk\/climate\/uk\/2005\/seasonal.html Accessed \n12th October 2008. \nvanWyk, E., Roux, D. J., Drackner, M. and McCool, S. F., 2008. The impact of scientific \ninformation on ecosystem management: making sense of the contextual gap between \ninformation providers and decision makers. Environ. Manage. 41, 779-791. \nVinten, A. J. A., Sym, G., Avdic, K., Crawford, C., Duncan, A. and Merrilees, D. W., 2008. \nFaecal indicator pollution from a dairy farm in Ayreshire, Scotland: source \napportionment, risk assessment and potential of mitigation measures. Water Res 42, \n997-1012. \nVinten, A. J. A., Douglas, J. T., Lewis, D. R., Aitken, M. N., and Fenlon, D. R., 2004. \nRelative risk of surface water pollution by E. coli derived from faeces of grazing \nanimals compared to slurry application. Soil Use Manage. 20, 13-22. \nWeaver, R. W., Entry, J. A. and Graves, A., 2005. Numbers of fecal streptococci and \nEscherichia coli in fresh and dry cattle, horse, and sheep manure. Can. J. Microbiol. \n51, 847-851. \nWhite, S. L., Sheffield, R. E., Washburn, S. P., King, L. D., and Green, J. T., 2001. Spatial \nand time distribution of dairy cattle excreta in an intensive pasture system. J. Environ. \nQual. 30, 2180-2187. \nZaidi, A. Z., deMonsabert, S. M., El-Farhan, R., 2008. How to include economic analysis in \nTMDL allocation. J. Wat. Res. Plan. Manage. 134, 214-223. \n \n \nList of Figure captions \n \nFigure 1: Four-axis framework of the toolkit and visualisation of FIO loss risk on a \nhypothetical farm.  \n \nFigure 2: Example output from the E. coli burden to land assessment for a dairy farm \nsurveyed in the study. E. coli burden to land - is designed to incorporate into the toolkit the \nFIO risks that arise from the application and deposition of manures and faeces during farming \nactivities. It is not spatially explicit but represents all E. coli inputs to land within the farm \nboundary. The burden profile is derived using livestock type and number, excretion rates, die-\noff coefficients (as per seasonal differentiation), grazing duration (in this case April through \nSeptember), manure application timings and rates. Total E. coli burden is the sum of grazing \ninputs and slurry application inputs across the whole farm. In this example slurry is applied \nweekly but the scale of operation does not allow for differentiating which fields have had \nmanure applied. \n \nFigure 3: Farm risk polygons for nine of the 31 farms assessed in the Taw catchment, Devon. \nNumber in centre of polygon reflects polygon risk score. Polygon colour reflects risk \ncategorisation [green = low, orange = medium and red = high risk] \n \nFigure 4: Farm risk polygons for Farm A, C and W and associated box and whisker plots \nshowing moments of the statistical distribution of FIO flux on respective farms throughout \nannual sampling period. [Horizontal ‘dash’ = median, box represents inter-quartile range, \nwhisker represents upper and lower limits].  \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 1:  \n \n \n \n \n \n \n \n \n \n \n \n \n \nShape denotes importance of individual \nfactors and this visualises types of \nmitigation that might take place \nThe plotted coordinates \nand colour of the polygon \nrepresents the overall \nriskiness in this case ‘high’ \nObstacles  \nTransfer \npotential \nE. coli \nburden \nInfrastructure \n Figure 2: \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \nFigure 3:  \n \n \n \n \n \n \n \n \n  \nFigure 4:  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nTable 1: Risk factors associated with four over-arching risk criteria of farm-scale FIO loss \nfrom land to water (with sources of data used to populate the toolkit shown in parenthesis). \n \n \nInfrastructure \n \n \nObstacles to taking action \n \n• Farmyard drainage (FS) \n \n• Receipt of technical grants (FS) \n• Steading \/ yard area* (OS) • Influence of debt (FS) \n• Slurry storage capacity (FS) • Sufficiency of farm labour force (FS) \n• FYM storage facilities (FS) • Level of participation in training, \naccreditation and learning networks \n(FS) \n• Domestic wastewater treatment (FS) • Degree of understanding & \nawareness of microbial risk \ndiscourses (FS) \n• Gateway location as promoter \/ \npreventer of field-to-field \nconnectivity to watercourse (FS) \n• Presence of a regulatory \nenvironment (FS) \n• Farm track co-efficient (extent of \nfarm tracks across farm area) (OS) \n• Level of participation in agri-\nenvironmental schemes (FS) \n• Livestock watercourse access for \ndrinking (FS) \n• Organic status (FS) \n• Livestock watercourse access for \nfording\/crossing (FS) \n \n• Level of membership to quality \nassurance schemes (FS) \n  \n \nTransfer potential \n \n \nE. coli burden to land (ha-1) \n• Averaged farm slope (5m DTM) • Livestock type (FS) \n• Typical slope shape (convex \/ \nconcave) (5m DTM) \n• Faecal inputs (Chambers et al., \n2001) \n• Dominant Soil type (Soil map \nrecords) \n• Grazing seasons and frequency of \napplication (FS) \n• Extent of soil compaction (FS) • Die-off rates (see Table 2) \n• Artificial drainage (FS) \n \n• Farm area (OS) \n \nFS: Farmer survey \nOS: Digitised Ordnance Survey maps \n5m DTM: 5m Digital Terrain Model (NextMap Britain) \n* This includes all covered areas and buildings at the in the central farmyard area, not \nbuildings included in distant fields \n \n \n \n \n \n \nTable 2: Parameters used within the toolkit E. coli burden model axis, and associated values \n(all rates and concentrations calculated from dry rate conversions). \n \n \nE. coli burden to land parameter \n \nValue \n \nDaily load of E. coli excreted by 1 dairy cow  (cfu) 3, 5, 6 \n \n8.99 x 108   \n \nDaily load of E. coli excreted by 1 beef cow (cfu) 3, 4 \n \n2.54 x 109  \n \nDaily load of E. coli excreted by 1 calf (cfu) 3, 4 \n \n2.10 x 1010  \n \nDaily load of E. coli excreted by 1 sheep (cfu) 3, 4 \n \n7.74 x 108  \n \nDaily load of E. coli excreted by 1 lamb (cfu) 3, 7 \n \n1.01 x 1010  \n \nSummer broadcast exponential decline rate (day-1) 1 \n \n-0.5476 \n \nAutumn broadcast exponential decline rate(day-1) 1 \n \n-0.2049 \n \nSpring broadcast exponential decline rate(day-1) 1 \n \n-0.2629 \n \nNovember start date, exponential decline in bovine faeces (day-1) \n[winter & autumn] 2 \n \n-0.0606 \n \nNovember start date, exponential decline in ovine faeces (day-1) \n[winter & autumn] 2 \n \n-0.0640 \n \nExpert judged spring and summer bovine die-off (day-1) \n \n-0.0909 \n \nExpert judged spring and summer ovine die-off (day-1) \n \n-0.0920 \n \nTypical slurry decline rate over housed period (day-1) 1 \n \n-0.0362 \n \nInitial slurry concentration in spring (cfu g-1) 1 \n \n126184 \n \nInitial slurry concentration in summer (cfu g-1) 1 \n \n21849 \n \nInitial slurry concentration in autumn (cfu g-1) 1 \n \n140570 \n \nSummer slurry dry matter content (%) 1 \n \n6.0 \n \nAutumn slurry dry matter content (%) 1 \n \n9.0 \n \nSpring slurry dry matter content (%) 1 \n \n7.3 \n \nFresh FYM typical start concentration (cfu g-1) 1 17819 \n \nFYM die-off rate (generic, middle heap value) (day-1) 1 \n \n-0.100 \n \nFYM dry matter content (%) 1 \n \n~ 21%  \n \n1Taken from Hodgson et al. (2008) 2 Taken from Avery et al., (2004), 3 uses data from \nChambers et al., (2001), 4 uses data from Weaver et al., (2005), 5 uses data from White et al., \n(2001), 6 uses data from Muirhead et al. (2005), and  7 uses data from Vinten et al. (2004) \nAxis and risk \nfactor \n \nWeight Characterisation and \nScoring  \n(where 1 = Highest risk \nand 0 lowest risk except*) \nRationale for first-approximation scoring system \nInfrastructure    \nFarmyard \ndrainage \n0.72 \n \nDST = 0.1\/ DWT =0.25 \/ Slurry \nstore =0.5 \/ Underground to \nstream = 0.9\/ Overground to \nstream = 1.0 \nAn overground drain to stream represents no appropriate drainage in place and therefore offers the least resistance of FIO transfer to \nwatercourse. Underground to stream increases the retention possibility of FIOs slightly. Drainage to slurry store increases volume of \nslurry to spread to land, but it introduces a reservoir rather than direct transfer to watercourse so less risky than overground and \nunderground routes. Drainage to dirty water tank route is in similar vein to slurry store, but DW is less risky than slurry with respect to \nFIO persistence. Domestic septic tank is the least direct route, therefore least risky. \nArea of hard \nstandings (m2) \n0.55 0=0\/ <10000=0.2\/ <20000=0.4\/ \n<30000=0.6\/ <40000=0.8\/ \n>40001=1.0 \nGreater farmyard area provides increased impervious surface area and hub of livestock\/manure activity. Increased farmyard area in \nturn allows for increased potential for contaminated surface runoff from farm yard area. \nStorage capacity \n(slurry) \n0.62 not needed = 0\/ >6mo = 0\/ 5 mo = \n0.2\/ 4mo = 0.4\/ 3 mo = 0.6\/ 2 mo = \n0.8\/ 1 mo = 1.0 \nGreater than 6 months storage is the least risky response as the farmer can store slurry during wet periods of the year preventing ill-\ntimed spreading. The risk increases with decline in slurry storage capacity. [note that catastrophic failure of slurry stores are not \nincluded in this assessment] \nStorage facilities \n(FYM) \n0.45 farm building = 0.001\/ covered = \n0.25.\/ uncovered = 0.75 \/ spread \nstraight to land = 1.0 \nFarm building storage allows for the FYM to be protected from rainfall and can therefore enhance composting. FYM Spread straight to \nland represents the opposite and is regarded as highest risk option. Uncovered FYM in field is considered much more risky than \ncovered heaps on field because there is more chance for contaminated runoff following rainfall \nDomestic \nwastewater \ntreatment \n0.43 Biofilter = 0.001\/ DST = 0.25\/ \ndisconnected ditch = 0.75\/ \nconnected ditch = 1.0 \nDitch systems of considerable risk compared to DST and biofilter systems because they have no real structure other than transferring \ndomestic waste via a channel to the environment. The DST and biofilter have system in place to attempt to retain FIOs and thus \nenhance die-off over time. The biofilter is more protective than a standard septic tank due to technology improvements in design \nGateway location 0.39 Away from point of drainage = 0.1\/ \nrandom = 0.5\/ Near point of \ndrainage = 1.0 \nGateways located near a point of drainage allow for increased potential for field-to-field connectivity which may lead to watercourse. \nThe converse is true for gateways located away from point of drainage. \nFarm track density \n(farm area\/ track \nlength) \n0.42 *Farm track coefficient (lower \nnumber = worse)  \n>1 = 0 \/ 0.9-1 = 1\/ 0.8-0.9 = 2\/ 0.7-\n0.8 = 3\/ 0.6-0.7 = 4\/ 0.5-0.6 = 5\/ \n0.4-0.5 = 6\/ 0.3-0.4 = 7\/ 0.2-0.3 = \n8\/ 0.1-0.2 = 9 \/ <0.1 = 10 \nThe larger the area of farmed land per metre of farm track, the lower the risk because this implies less tracks are dissecting the farmed \nland, reducing connectivity via track conduits. Larger area of farm per metre of farm track equates to larger coefficient (less risk). \nCattle drinking \naccess \n0.82 No = 0.001 \/ Yes = 1.0 Access equates to the potential for direct defecation in streams, any access for drinking is of equal risk as all allow for defecation input \nwhether access is restricted to 1m or entire stream reach. Low risk appreciates that livestock may on occasion pass through fencing. \n \nCattle fording \n \n0.82 \n \nNo = 0.001 \/ Yes weekly = 0.14\/ \nYes daily = 1.0 \n \nDaily crossing will allow for increased potential for direct defecation into stream whereas those farms where livestock fording is \nprevented are not at risk from direct deposition…weekly fording is 1\/7th the risk of daily crossing. \nTransfer \npotential \n   \nAverage slope \nangles \n0.73 \n \n0-1degree = 1, \/ 1.1-2 = 2 \/ 2.1 - 3 \n= 3 etc etc etc \nThose farms with lower average slope angle across farm area are less likely to promote transfer via surface runoff processes \nAverage slope \nshape \n \n0.73 \n \nConcave = 0.75\/ Covex = 1.0 \/ \nMixed = 0.2 \nConvex slopes allow runoff to gain momentum with distance downslope thus increasing risk of delivery to streams at end of slope. In \ncontrast concave slopes allow runoff to lose momentum downslope and are therefore less risky (but still of some risk as ultimately \ndistance to watercourse after slope levels out will be important). Mixed slopes may allow for runoff to be trapped due to undulating \nTable 3: Relative weight of influence on FIO risk loss from land to water associated with ‘infrastructure’, ‘transfer potential’ and ‘obstacles to taking action’ alongside \ncharacterisation of (and rationale for) risk magnitude attributed to farm circumstances  \nprofile and therefore are of less risk than the concave only slopes but we cannot attribute zero risk to mixed slope \nDominant Soil \ntype \n0.73 \n \nLight (sandy) = 0.1\/ medium =0.5 \/ \nheavy(clay) = 1.0  \nHeavy soils promote runoff and soil cracking and therefore rank as higher risk, light soils allow for infiltration and cell retention in the \nsoil matrix \nSoil compaction 0.73 no =0 \/ yes =1.0  Soil deformation promotes runoff \nField drainage 0.49 no =0 \/ yes but inefficient = 0.5\/ \nyes & efficient = 1.0 \nAssumption that drainage allows unimpeded subsurface transfer. Presence of drains are designated here as rapid conduits. If drains \nare noted to be functioning inadequately these Inefficient drains as less of a subsurface transfer risk compared with efficient drainage \nsystems. \nObstacles to \ntaking action \n   \nReceipt of \ntechnical grants \nfor waste \nmanagement  0.83 \nYes = 0\/No= 1 \n \nAssumption that if farm has received external monies for the development of remedial waste measures then risk can be assumed to be \nlower. \n \nInfluence of Debt 0.48 No\/Negible = 0\/Yes but \nmanageable = 0.5\/Signifcantly \ninfluences = 1 \nWorks on the assumption that presence of debt is a control over potential investment decisions of which measures to reduce waste will \nbe indicative. Current assessment is based on a qualitative measure regarding how debt is perceived to affect effect enterprise \nmanagement. \nAdequacy of \nlabour force \nrelative to scale \nand intensity of \nenterprise \n0.45 Highly sufficient = 0\/Sufficient= \n0.25\/Barely sufficent = \n0.75\/Insufficient =1 \n \nWorks on the assumption that enterprise will be less able to deal with environmental externalities as human capital becomes more \n‘stretched’ to maintain viable production. Assessment is based on a four fold qualitative measure regarding perceived sufficiency of \nlabour force to manage enterprise effectively.  \n \nLevel of training \nand accreditation \n0.64 Yes = 0\/No= 1 Assumption that inclination to manage for environmental protection is raised by farmers’ level of formal educational attainment in land \nand livestock management. Currently no differentiation is made here between forms and extents of training\/accreditation. \nLevel of \nParticipation in \nDiscussion \nGroups \n0.61 Yes = 0\/No= 1 Assumption that inclination to manage for environmental protection is raised where farmers’ participation level in networks of \nprofessional self-learning. Currently no differentiation is made here between forms of participation \nDegree of \nunderstanding and \nawareness of \nmicrobial risk \ndiscourses \n0.49 Aware and clear understanding = \n0\/aware but understanding unclear  \n= 0.5\/Unaware = 1 \nAssumption that risks fall depending on levels of awareness of environmental risk categories (using diffuse pollution as indicator of \nthis). Distinction between awareness and understanding produces a three fold classification.  Ability to verbally articulate meaning of \n‘diffuse pollution’ results in lowest risk. Farmers who are aware of this terminology but cannot articulate meaning considered lower risk \nthan those who are completely unaware of this ‘key’ policy signal. \nPresence of a \nregulatory \nenvironment \n0.49 Yes = 0\/No= 1 Tries to build in a wider regulatory effect to an assessment of risk.  Assumption is that a farmer’s sense of responsibility will be \nenhanced, however indirectly, by cultures of compliance existing within the farming industry. In our case all farmers are awarded this \nlow risk. \nLevel of \nparticipation in \nagri-environmental \nscheme \n0.69 Yes (HLS) = 0\/YES ([0]ELS) = \n0.5\/No = 1 \n \nThis is used as a signifier of endemic attitudes toward risk mitigation rather than forms of management practice. The argument is that \nlevels of participation are index of these attitudes. HLS represents lowest risk\/ELS medium etc. \n \nOrganic Status 0.68 Yes = 0 Planned = 0.5\/No = 1 Again used as a signifier of endemic attitudes toward risk mitigation. Argument is that OFs are likely to be more predisposed to taking \naction. Distinctions are made between converts.  \nMembership of \nquality assurance \nscheme \n0.50 Yes = 0\/ No = 1 Like above is used as a signifier of endemic attitudes towards risk mitigation rather than management practices per se. The argument \nis that levels of participation are an index of these attitudes. No distinction is made between schemes. \nDST = domestic septic tank, DWT = dirty water tank, ELS \/ HLS \/ OELS = entry level scheme, higher level scheme and organic entry level scheme for environmental \nstewardship, respectively. \n 36\nTable 4: Farm risk polygon co-ordinates (relative risk scores) for the four axes of the cross-\ndisciplinary risk-tool and the overall farm risk score (resulting polygon area), for the 31 \npartaking farm enterprises (anonymised). Low E. coli burden can still equate to high overall \nrisk if combined with poor farm management and high likelihood of transfer. \n \n                 \nfarm \nname \nburden obstacles transfer infrastructure  axes \nsum \nmax \nrisk \n% score \n                 \nFarm CH 0.1 3.8 4.2 4.6  12.7 40 32 \nFarm HAT 0.0 1.8 5.2 6.2  13.3 40 33 \nFarm WY 0.0 3.8 7.2 3.3  14.3 40 36 \nFarm M 0.1 6.7 5.5 2.4  14.7 40 37 \nFarm HC 1.0 4.8 4.0 5.0  14.8 40 37 \nFarm A 0.2 4.2 5.0 5.5  14.9 40 37 \nFarm NB 0.1 6.7 4.7 3.6  15.1 40 38 \nFarm BH 0.7 5.5 4.8 4.5  15.4 40 39 \nFarm CK 0.5 4.7 6.3 4.2  15.6 40 39 \nFarm B 2.3 4.0 5.1 4.4  15.8 40 40 \nFarm WP 1.8 3.9 5.1 5.6  16.3 40 41 \nFarm Co 0.3 6.0 5.1 5.2  16.5 40 41 \nFarm Wa 1.3 6.9 2.9 5.7  16.8 40 42 \nFarm NI 0.2 5.7 4.0 7.1  16.9 40 42 \nFarm N  1.9 5.3 6.4 3.4  17.0 40 43 \nFarm Sl 0.1 4.8 4.9 7.2  17.0 40 43 \nFarm B  0.3 7.3 4.6 5.1  17.3 40 43 \nFarm LH 1.7 6.1 5.6 4.2  17.6 40 44 \nFarm P 0.1 7.2 6.6 4.3  18.2 40 46 \nFarm Wo 2.7 4.6 4.8 6.6  18.6 40 47 \nFarm C  0.9 5.4 5.0 7.6  18.9 40 47 \nFarm E 0.7 3.6 8.2 6.6  19.1 40 48 \nFarm MX 2.1 7.4 5.1 4.8  19.4 40 49 \nFarm WM 0.5 4.6 7.2 7.9  20.2 40 51 \nFarm S 6.5 5.6 3.7 4.8  20.6 40 51 \nFarm MN 4.9 6.9 4.0 4.8  20.6 40 52 \nFarm CL 0.7 6.3 8.6 5.3  20.9 40 52 \nFarm DR 1.3 5.3 7.2 7.2  21.1 40 53 \nFarm HB 2.4 6.9 7.0 4.8  21.1 40 53 \nFarm WN 7.4 5.6 4.7 4.4  22.0 40 55 \nFarm W 5.2 6.8 7.7 6.3  25.9 40 65 \n                 \n \n*Rounded to nearest % \nFarms monitored for microbiological water quality shown in bold \n"}