{"doi":"10.1029\/2009JA014183","coreId":"68504","oai":"oai:eprints.lancs.ac.uk:32224","identifiers":["oai:eprints.lancs.ac.uk:32224","10.1029\/2009JA014183"],"title":"A density-temperature description of the outer electron radiation belt during geomagnetic storms","authors":["Denton, Michael H.","Borovsky, J. E.","Cayton, T. E."],"enrichments":{"references":[{"id":896229,"title":"(2007a), Timescales for radiation belt electron acceleration and loss due to resonant wave-particle interactions: 1.","authors":[],"date":null,"doi":null,"raw":"Summers, D., N. Binbin, and N. P. Meredith (2007a), Timescales for radiation belt electron acceleration and loss due to resonant wave-particle interactions: 1. Theory, J. Geophys. Res., 112, A04206, doi:10.1029\/ 2006JA011801.","cites":null},{"id":896510,"title":"(2007b), Timescales for radiation belt electron acceleration and loss due to resonant wave-particle interactions: 2. Evaluation for VLF chorus, ELF hiss, and electromagnetic ion cyclotron waves,","authors":[],"date":null,"doi":null,"raw":"Summers, D., N. Binbin, and N. P. Meredith (2007b), Timescales for radiation belt electron acceleration and loss due to resonant wave-particle interactions: 2. Evaluation for VLF chorus, ELF hiss, and electromagnetic ion cyclotron waves, J. Geophys. Res., 112, A04207, doi:10.1029\/ 2006JA011993.","cites":null},{"id":898365,"title":"A statistical comparison of hot-ion properties at geosynchronous orbit during intense and moderate geomagnetic storms at solar maximum and minimum,","authors":[],"date":"2006","doi":"10.1029\/2005JA011559","raw":"Zhang, J., M. W. Liemohn, M. F. Thomsen, J. U. Kozyra, M. H. Denton, and J. E. Borovsky (2006), A statistical comparison of hot-ion properties at geosynchronous orbit during intense and moderate geomagnetic storms at solar maximum and minimum, J. Geophys. Res., 111, A07206, doi:10.1029\/2005JA011559.                        J. E. Borovsky and T. E. Cayton, Space Science and Applications, Los Alamos National Laboratory, Los Alamos, NM 87545, USA. M. H. Denton, Department of Communication Systems, Lancaster University, InfoLab 21, Lancaster LA1 4WA, UK. (m.denton@lancaster. ac.uk) A01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT 20 of 20 A01208","cites":null},{"id":882000,"title":"A statistical look at plasmaspheric drainage plumes,","authors":[],"date":"2008","doi":"10.1029\/2007JA012994","raw":"A01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT 18 of 20 A01208Borovsky, J. E., and M. H. Denton (2008), A statistical look at plasmaspheric drainage plumes, J. Geophys. Res., 113, A09221, doi:10.1029\/ 2007JA012994.","cites":null},{"id":894483,"title":"A study of geosynchronous magnetopause crossings,","authors":[],"date":"1989","doi":null,"raw":"Rufenach, C. L., R. F. Martin, and H. H. Sauer (1989), A study of geosynchronous magnetopause crossings, J. Geophys. Res., 94, 15,125–15,134, doi:10.1029\/JA094iA11p15125.","cites":null},{"id":893365,"title":"Acceleration and loss of relativistic electrons during geomagnetic storms,","authors":[],"date":"2003","doi":null,"raw":"Reeves, G. D., K. L. McAdams, R. H. W. Friedel, and T. P. O’Brien (2003), Acceleration and loss of relativistic electrons during geomagnetic storms, Geophys. Res. Lett., 30(10), 1529, doi:10.1029\/2002GL016513.","cites":null},{"id":890058,"title":"An unusual coronal mass ejection: First Solar Wind Electron, Proton, Alpha Monitor (SWEPAM) results from the Advanced Composition Explorer,","authors":[],"date":"1998","doi":null,"raw":"McComas, D. J., et al. (1998), An unusual coronal mass ejection: First Solar Wind Electron, Proton, Alpha Monitor (SWEPAM) results from the Advanced Composition Explorer, Geophys. Res. Lett., 25(23), 4289–4292, doi:10.1029\/1998GL900174.","cites":null},{"id":889560,"title":"Auroral Boundary Index from","authors":[],"date":"1990","doi":null,"raw":"Madden, D., and M. S. Gussenhoven (1990), Auroral Boundary Index from 1983 to 1990, Tech. Rep. GL-TR-90-0358, Air Force Geophys. Lab., Hanscom AFB, Mass., 21 Dec.","cites":null},{"id":884647,"title":"Bulk plasma properties at geosynchronous orbit,","authors":[],"date":"2005","doi":null,"raw":"Denton, M. H., M. F. Thomsen, H. Korth, S. Lynch, J. C. Zhang, and M. W. Liemohn (2005), Bulk plasma properties at geosynchronous orbit, J. Geophys. Res., 110, A07223, doi:10.1029\/2004JA010861.","cites":null},{"id":897874,"title":"Chronology of ‘killer’ electrons: Solar cycles 22 and 23,","authors":[],"date":"2009","doi":"10.1016\/j.jastp.2008.08.002","raw":"Wrenn, G. L. (2009), Chronology of ‘killer’ electrons: Solar cycles 22 and 23, J. Atmos. Sol. Terr. Phys., 71, 1210–1218.","cites":null},{"id":889185,"title":"Coronal mass ejections and stream interaction region characteristics and their potential geomagnetic consequences,","authors":[],"date":"1995","doi":null,"raw":"Lindsay, G. M., C. T. Russell, and J. G. Luhmann (1995), Coronal mass ejections and stream interaction region characteristics and their potential geomagnetic consequences, J. Geophys. Res., 100, 16,999–17,013, doi:10.1029\/95JA00525.","cites":null},{"id":897007,"title":"Corotating solar wind streams and recurrent geomagnetic activity: A review,","authors":[],"date":"2006","doi":null,"raw":"Tsurutani, B. T., et al. (2006), Corotating solar wind streams and recurrent geomagnetic activity: A review, J. Geophys. Res., 111,A 0 7 S 0 1 , doi:10.1029\/2005JA011273.","cites":null},{"id":16608008,"title":"D e n t o n ,M .H . ,J .E .B o r o v s k y","authors":[],"date":null,"doi":null,"raw":"D e n t o n ,M .H . ,J .E .B o r o v s k y ,R .B .H o r n e ,R .L .M c P h e r r o n ,S .K . Morley, and B. T. Tsurutani (2009a), Introduction to special issue on high speed solar wind streams and geospace interactions, J. Atmos. Sol.","cites":null},{"id":881521,"title":"Denton (2006a), Differences between CMEdriven storms and CIR-driven storms,","authors":[],"date":null,"doi":"10.1029\/2005JA011447","raw":"Borovsky, J. E., and M. H. Denton (2006a), Differences between CMEdriven storms and CIR-driven storms, J. Geophys. Res., 111, A07S08, doi:10.1029\/2005JA011447.","cites":null},{"id":881772,"title":"Denton (2006b), Effect of plasmaspheric drainage plumes on solar-wind\/magnetosphere coupling,","authors":[],"date":null,"doi":"10.1029\/2006GL026519","raw":"Borovsky, J. E., and M. H. Denton (2006b), Effect of plasmaspheric drainage plumes on solar-wind\/magnetosphere coupling, Geophys. Res. Lett., 33, L20101, doi:10.1029\/2006GL026519.","cites":null},{"id":882085,"title":"Denton (2009a), Relativistic-electron dropouts and recovery: A superposed epoch study of the magnetosphere and the solar wind,","authors":[],"date":null,"doi":"10.1029\/2008JA013128","raw":"Borovsky, J. E., and M. H. Denton (2009a), Relativistic-electron dropouts and recovery: A superposed epoch study of the magnetosphere and the solar wind, J. Geophys. Res., 114, A02201, doi:10.1029\/2008JA013128.","cites":null},{"id":882285,"title":"Denton (2009b), Electron loss rates from the outer radiation belt caused by filling of the outer plasmasphere: The calm before the storm,","authors":[],"date":null,"doi":"10.1029\/2009JA014063","raw":"Borovsky, J. E., and M. H. Denton (2009b), Electron loss rates from the outer radiation belt caused by filling of the outer plasmasphere: The calm before the storm, J. Geophys. Res.,114, A11203, doi:10.1029\/2009JA014063.","cites":null},{"id":898107,"title":"Effect of storm-time plasma pressure on the magnetic field in the inner magnetosphere,","authors":[],"date":"2005","doi":"10.1029\/2004GL021491","raw":"Zaharia, S., M. F. Thomsen, J. Birn, and M. H. Denton (2005), Effect of storm-time plasma pressure on the magnetic field in the inner magnetosphere, Geophys. Res. Lett., 32, L03102, doi:10.1029\/2004GL021491.","cites":null},{"id":892779,"title":"Effects of the solar wind on magnetospheric dynamics: Energetic electrons at the synchronous orbit, in Quantitative Modeling of Magnetospheric Processes,","authors":[],"date":"1979","doi":null,"raw":"Paulikas, G. A., and J. B. Blake (1979), Effects of the solar wind on magnetospheric dynamics: Energetic electrons at the synchronous orbit, in Quantitative Modeling of Magnetospheric Processes, Geophys. Monogr. Ser., vol. 21, edited by W. P. Olsen, p. 180, AGU, Washington, D. C.","cites":null},{"id":883462,"title":"Energetic electron components at geosynchronous orbit,","authors":[],"date":"1989","doi":null,"raw":"Cayton, T. E., R. D. Belian, S. P. Gary, T. A. Fritz, and D. N. Baker (1989), Energetic electron components at geosynchronous orbit, Geophys. Res. Lett., 16(2), 147–150, doi:10.1029\/GL016i002p00147.","cites":null},{"id":888650,"title":"Energetic electrons, 50 keV to 6 MeV, at geosynchronous orbit: Their responses to solar wind variations,","authors":[],"date":"2005","doi":null,"raw":"Li, X., D. N. Baker, M. Temerin, G. Reeves, R. Friedel, and C. Shen (2005), Energetic electrons, 50 keV to 6 MeV, at geosynchronous orbit: Their responses to solar wind variations, Space Weather, 3, S04001, doi:10.1029\/2004SW000105.","cites":null},{"id":897361,"title":"Energetics of magnetic storms driven by corotating interaction regions: A study of geoeffectiveness,","authors":[],"date":"2006","doi":null,"raw":"Turner, N. E., E. J. Mitchell, D. J. Knipp, and B. A. Emery (2006), Energetics of magnetic storms driven by corotating interaction regions: A study of geoeffectiveness, in Recurrent Magnetic Storms: Corotating Solar Wind Streams, Geophys. Monogr. Ser., vol. 167, edited by B. T. Tsurutani et al., pp. 113–124, AGU, Washington, D. C.","cites":null},{"id":893285,"title":"Fitting the AE-8 energy spectra with two Maxwellian functions,","authors":[],"date":"1996","doi":null,"raw":"Pierrard, V., and J. Lemaire (1996), Fitting the AE-8 energy spectra with two Maxwellian functions, Radiat. Meas., 26, 333–337, doi:10.1016\/ 1350-4487(96)00057-1.","cites":null},{"id":887820,"title":"Fully adiabatic changes in storm time relativistic electron fluxes,","authors":[],"date":"1997","doi":null,"raw":"Kim, H.-J., and A. A. Chan (1997), Fully adiabatic changes in storm time relativistic electron fluxes, J. Geophys. Res., 102, 22,107–22,116, doi:10.1029\/97JA01814.","cites":null},{"id":897633,"title":"Geoactivity in response to CIR\/CME events: A synoptic view,","authors":[],"date":"1999","doi":null,"raw":"Wilken, B., Q.-G. Zong, G. D. Reeves, T. Doke, and T. Yamamoto (1999), Geoactivity in response to CIR\/CME events: A synoptic view, Phys. Chem. Earth, 24, 113–117.","cites":null},{"id":886520,"title":"Geoeffectiveness of different solar drivers, and long-term variations of the correlation between sunspot and geomagnetic activity,","authors":[],"date":"2006","doi":null,"raw":"Georgieva, K., B. Kirov, and E. Gavruseva (2006), Geoeffectiveness of different solar drivers, and long-term variations of the correlation between sunspot and geomagnetic activity, Phys. Chem. Earth, 31, 81–87.","cites":null},{"id":884926,"title":"Geomagnetic storms driven by ICME- and CIR-dominated solar wind,","authors":[],"date":"2006","doi":null,"raw":"Denton, M. H., J. E. Borovsky, R. M. Skoug, M. F. Thomsen, B. Lavraud, M. G. Henderson, R. L. McPherron, J. C. Zhang, and M. W. Liemohn (2006), Geomagnetic storms driven by ICME- and CIR-dominated solar wind, J. Geophys. Res., 111, A07S07, doi:10.1029\/2005JA011436.","cites":null},{"id":887558,"title":"High-speed solar wind streams and geospace interactions,","authors":[],"date":"2007","doi":null,"raw":"Kavanagh, A., and M. H. Denton (2007), High-speed solar wind streams and geospace interactions, Astron. Geophys., 48, 6.24–6.26.","cites":null},{"id":881011,"title":"High-Z energetic particles at geostationary orbit during the great proton event of October","authors":[],"date":"1992","doi":"10.1029\/92JA01139","raw":"Belian, R. D., G. R. Gisler, T. Cayton, and R. Christensen (1992), High-Z energetic particles at geostationary orbit during the great proton event of October 1989, J. Geophys. Res., 97, 16,897–16,906, doi:10.1029\/ 92JA01139.","cites":null},{"id":885988,"title":"Inner edge of the electron plasma sheet: Empirical models of boundary location,","authors":[],"date":"1999","doi":null,"raw":"Elphic, R. C., M. F. Thomsen, J. E. Borovsky, and D. J. McComas (1999), Inner edge of the electron plasma sheet: Empirical models of boundary location, J. Geophys. Res., 104, 22,679–22,693, doi:10.1029\/ 1999JA900213.","cites":null},{"id":895692,"title":"Large decadal scale changes of polar ozone suggest solar influence,","authors":[],"date":"2006","doi":null,"raw":"Sinnhuber, B. M., P. von der Gathen, M. Sinnhuber, M. Rex, G. Konig-Langlo, and S. J. Oltmans (2006), Large decadal scale changes of polar ozone suggest solar influence, Atmos. Chem. Phys., 6, 1835– 1841.","cites":null},{"id":891592,"title":"Local time dependence of electron flux changes during substorms derived from multi-satellite observations at geosynchronous orbit,","authors":[],"date":"1982","doi":null,"raw":"Nagai, T. (1982), Local time dependence of electron flux changes during substorms derived from multi-satellite observations at geosynchronous orbit, J. Geophys. Res., 87, 3456–3468, doi:10.1029\/JA087iA05p03456.","cites":null},{"id":888351,"title":"Magnetosphere preconditioning under northward IMF: Evidence from the study of coronal mass ejection and corotating interaction region geoeffectiveness,","authors":[],"date":"2006","doi":null,"raw":"Lavraud, B., M. F. Thomsen, J. E. Borovsky, M. H. Denton, and T. I. Pulkkinen (2006), Magnetosphere preconditioning under northward IMF: Evidence from the study of coronal mass ejection and corotating interaction region geoeffectiveness, J. Geophys. Res., 111,A 0 9 2 0 8 , doi:10.1029\/2005JA011566.","cites":null},{"id":882808,"title":"Magnetospheric dynamics and mass flow during the","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":889750,"title":"Milling (2004), Correlations between ULF wave power, solar wind speed, and relativistic electron flux in the magnetosphere: Solar cycle dependence,","authors":[],"date":null,"doi":null,"raw":"Mann, I. R., T. P. O’Brien, and D. K. Milling (2004), Correlations between ULF wave power, solar wind speed, and relativistic electron flux in the magnetosphere: Solar cycle dependence, J. Atmos. Sol. Terr. Phys., 66, 187–198, doi:10.1016\/j.jastp.2003.10.002.","cites":null},{"id":883725,"title":"Multisatellite determination of the relativistic electron phase space density at geosynchronous orbit: Methodology and results during geomagnetically quiet times,","authors":[],"date":"2005","doi":null,"raw":"Chen, Y., R. W. Friedel, G. D. Reeves, T. G. Onsager, and M. F. Thomsen (2005), Multisatellite determination of the relativistic electron phase space density at geosynchronous orbit: Methodology and results during geomagnetically quiet times, J. Geophys. Res., 110, A10210, doi:10.1029\/2004JA010895.","cites":null},{"id":895353,"title":"NOx enhancements in the middle atmosphere during 2003–2004 polar winter: Relative significance of solar proton events and the aurora as a source,","authors":[],"date":"2007","doi":null,"raw":"Seppa ¨la ¨, A., M. A. Cliverd, and C. J. Rodger (2007), NOx enhancements in the middle atmosphere during 2003–2004 polar winter: Relative significance of solar proton events and the aurora as a source, J. Geophys. Res., 112, D23303, doi:10.1029\/2006JD008326.","cites":null},{"id":883342,"title":"Numerical modeling of the synchronous orbit particle analyser (SOPA,","authors":[],"date":"2007","doi":null,"raw":"Cayton, T. E., and R. D. Belian (2007), Numerical modeling of the synchronous orbit particle analyser (SOPA, Version 2) that flew on S\/C 1990–095, LA Rep. LA-14335, Los Alamos Natl. Lab., Los Alamos, N. M.","cites":null},{"id":884000,"title":"Observation of a decrease in mid-latitude whistler mode signal occurrence prior to geomagnetic storms,","authors":[],"date":"1993","doi":null,"raw":"Clilverd, M. A., T. D. G. Clark, A. J. Smith, and N. R. Thomson (1993), Observation of a decrease in mid-latitude whistler mode signal occurrence prior to geomagnetic storms, J. Atmos. Terr. Phys., 55, 1479–1485, doi:10.1016\/0021-9169(93)90113-D.","cites":null},{"id":895937,"title":"Observations of ionospheric heating during the passage of solar coronal hole fast streams,","authors":[],"date":"2009","doi":null,"raw":"Sojka, J. J., R. L. McPherron, A. P. van Eyken, M. Nicolls, C. Heinselman, and J. Kelly (2009), Observations of ionospheric heating during the passage of solar coronal hole fast streams, Geophys. Res. Lett., 36, L19105, doi:10.1029\/2009GL039064.","cites":null},{"id":893676,"title":"Observations of relativistic electron precipitation from the radiation belts driven by EMIC waves,","authors":[],"date":"2008","doi":null,"raw":"Rodger, C. J., T. Raita, M. A. Clilverd, A. Seppa ¨la ¨, S. Dietrich, N. R. Thomsen, and T. Ulich (2008), Observations of relativistic electron precipitation from the radiation belts driven by EMIC waves, Geophys.","cites":null},{"id":893927,"title":"On the adiabatic motion of energetic particles in a model magnetosphere,","authors":[],"date":"1967","doi":null,"raw":"Roederer, J. G. (1967), On the adiabatic motion of energetic particles in a model magnetosphere, J. Geophys. Res., 72, 981–992, doi:10.1029\/ JZ072i003p00981.","cites":null},{"id":889419,"title":"Particle precipitation during ICME-driven and CIR-driven geomagnetic storms,","authors":[],"date":"2008","doi":null,"raw":"Longden, N., M. H. Denton, and F. Honary (2008), Particle precipitation during ICME-driven and CIR-driven geomagnetic storms, J. Geophys.","cites":null},{"id":883033,"title":"Precipitating relativistic electrons: Their long-term effect on stratospheric odd nitrogen levels,","authors":[],"date":"1991","doi":null,"raw":"Callis, L. B., D. N. Baker, J. B. Blake, J. D. Lambeth, R. E. Boughner, M. Natarajan, R. W. Klebesadel, and D. J. Gorney (1991), Precipitating relativistic electrons: Their long-term effect on stratospheric odd nitrogen levels, J. Geophys. Res., 96, 2939–2976, doi:10.1029\/90JD02184.","cites":null},{"id":892066,"title":"Radiation belt electron flux dropouts: Local time, radial, and particle-energy dependence,","authors":[],"date":"2002","doi":null,"raw":"Onsager, T. G., G. Rostoker, H.-J. Kim, G. D. Reeves, T. Obara, H. J. Singer, and C. Smithtro (2002), Radiation belt electron flux dropouts: Local time, radial, and particle-energy dependence, J. Geophys. Res., 107(A11), 1382, doi:10.1029\/2001JA000187.","cites":null},{"id":887034,"title":"Relationship of the Van Allen radiation belts to solar wind drivers,","authors":[],"date":"2008","doi":null,"raw":"Hudson, M. K., B. T. Kress, H.-R. Mueller, J. A. Zastrow, and J. B. Blake (2008), Relationship of the Van Allen radiation belts to solar wind drivers, J. Atmos. Sol. Terr. Phys., 70, 708–729, doi:10.1016\/ j.jastp.2007.11.003.","cites":null},{"id":886274,"title":"Relativistic electron dynamics in the inner magnetosphere: A review,","authors":[],"date":"2002","doi":null,"raw":"Friedel, R. H. W., G. D. Reeves, and T. Obara (2002), Relativistic electron dynamics in the inner magnetosphere: A review, J. Atmos. Sol. Terr. Phys., 64, 265–282, doi:10.1016\/S1364-6826(01)00088-8.","cites":null},{"id":895112,"title":"Relativistic electron losses related to EMIC waves during","authors":[],"date":"2009","doi":null,"raw":"Sandanger, M. I. J., F. Søraas, M. Sørbø, K. Aarsnes, K. Oksavik, and D. S. Evans (2009), Relativistic electron losses related to EMIC waves during CIR and CME storms, J. Atmos. Sol. Terr. Phys., 71, 1126–1144, doi:10.1016\/j.jastp.2008.07.006.","cites":null},{"id":886741,"title":"Relativistic electrons in the outer radiation belt: Differentiating between acceleration mechanisms,","authors":[],"date":"2004","doi":null,"raw":"Green, J. C., and M. G. Kivelson (2004), Relativistic electrons in the outer radiation belt: Differentiating between acceleration mechanisms, J. Geophys. Res., 109, A03213, doi:10.1029\/2003JA010153.","cites":null},{"id":894214,"title":"Rements","authors":[],"date":"2000","doi":null,"raw":"Roldugin, V. C., M. I. Beloglazov, and G. F. Rements (2000), Total ozone decrease in the Arctic after REP events, Ann. Geophys., 18, 332–336, doi:10.1007\/s00585-000-0332-3.","cites":null},{"id":890830,"title":"Role of the Russell-McPherron effect in the acceleration of relativistic electrons,","authors":[],"date":"2009","doi":null,"raw":"McPherron, R. L., D. N. Baker, and N. U. Crooker (2009), Role of the Russell-McPherron effect in the acceleration of relativistic electrons, J. Atmos. Sol. Terr. Phys., 71, 1032–1044, doi:10.1016\/j.jastp.2008.11.002.","cites":null},{"id":894820,"title":"Semiannual variation of geomagnetic activity,","authors":[],"date":"1973","doi":null,"raw":"Russell, C. T., and R. L. McPherron (1973), Semiannual variation of geomagnetic activity, J. Geophys. Res., 78, 92–108, doi:10.1029\/ JA078i001p00092.","cites":null},{"id":887311,"title":"Skoug","authors":[],"date":"2006","doi":null,"raw":"Jian, L., C. T. Russell, J. G. Luhmann, and R. M. Skoug (2006), Properties of interplanetary coronal mass ejections at one AU during 1995–2004, Sol. Phys., 239, 393–436, doi:10.1007\/s11207-006-0133-2.","cites":null},{"id":880755,"title":"Solar cycle changes, geomagnetic variations, and energetic particle properties in the inner magnetosphere,","authors":[],"date":"2008","doi":"10.1016\/j.jastp.2007.08.031","raw":"Baker, D. N., and S. G. Kanekal (2008), Solar cycle changes, geomagnetic variations, and energetic particle properties in the inner magnetosphere, J. Atmos. Sol.Terr. Phys., 70, 195–206, doi:10.1016\/j.jastp.2007.08.031.","cites":null},{"id":892523,"title":"Solar wind and magnetospheric conditions leading to the abrupt loss of outer radiation belt electrons,","authors":[],"date":"2007","doi":null,"raw":"A01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT 19 of 20 A01208Onsager, T. G., J. C. Green, G. D. Reeves, and H. J. Singer (2007), Solar wind and magnetospheric conditions leading to the abrupt loss of outer radiation belt electrons, J. Geophys. Res., 112, A01202, doi:10.1029\/ 2006JA011708.","cites":null},{"id":888081,"title":"Solar wind spatial scales in and comparisons of hourly Wind and ACE plasma and magnetic field data,","authors":[],"date":"2005","doi":null,"raw":"King, J. H., and N. E. Papitashvili (2005), Solar wind spatial scales in and comparisons of hourly Wind and ACE plasma and magnetic field data, J. Geophys. Res., 110, A02104, doi:10.1029\/2004JA010649.","cites":null},{"id":885735,"title":"Some effects of diamagnetic ring currents on Van Allen radiation,","authors":[],"date":"1961","doi":null,"raw":"Dessler, A. J., and R. Karplus (1961), Some effects of diamagnetic ring currents on Van Allen radiation, J. Geophys. Res., 66, 2289–2295, doi:10.1029\/JZ066i008p02289.","cites":null},{"id":891104,"title":"Substorm dependence of plasmaspheric hiss,","authors":[],"date":"2004","doi":null,"raw":"Meredith, N. P., R. B. Horne, R. M. Thorne, D. Summers, and R. A. Anderson (2004), Substorm dependence of plasmaspheric hiss, J. Geophys. Res., 109, A06209, doi:10.1029\/2004JA010387.","cites":null},{"id":881274,"title":"Substorm electron injections: Geosynchronous observations and test particle simulations,","authors":[],"date":"1998","doi":"10.1029\/97JA02635","raw":"Birn,J.,M.F.Thomsen,J.E.Borovsky,G.D.Reeves,D.J.McComas,R.D. Belian, and M. Hesse (1998), Substorm electron injections: Geosynchronous observations and test particle simulations, J. Geophys. Res., 103, 9235–9248, doi:10.1029\/97JA02635.","cites":null},{"id":884274,"title":"Superposed epoch analysis of high-speed-stream effects at geosynchronous orbit: Hot plasma, cold plasma, and the solar wind,","authors":[],"date":"2008","doi":null,"raw":"Denton, M. H., and J. E. Borovsky (2008), Superposed epoch analysis of high-speed-stream effects at geosynchronous orbit: Hot plasma, cold plasma, and the solar wind, J. Geophys. Res., 113, A07216, doi:10.1029\/2007JA012998.","cites":null},{"id":887011,"title":"Testing loss mechanisms capable of rapidly depleting relativistic electron flux in the Earth’s outer radiation belt,","authors":[],"date":"2004","doi":null,"raw":"Green, J. C., T. G. Onsager, T. P. O’Brien, and D. N. Baker (2004), Testing loss mechanisms capable of rapidly depleting relativistic electron flux in the Earth’s outer radiation belt, J. Geophys. Res., 109, A12211, doi:10.1029\/2004JA010579.","cites":null},{"id":882532,"title":"The ‘‘calm before the storm’’ in CIR\/magnetosphere interactions: Occurrence statistics, solar wind statistics, and magnetospheric preconditioning,","authors":[],"date":"2006","doi":"10.1029\/2005JA011397","raw":"Borovsky, J. E., and J. T. Steinberg (2006), The ‘‘calm before the storm’’ in CIR\/magnetosphere interactions: Occurrence statistics, solar wind statistics, and magnetospheric preconditioning, J. Geophys. Res., 111, A07S10, doi:10.1029\/2005JA011397.","cites":null},{"id":886234,"title":"The morphology of the electron distribution in the outer radiation zone and near the magnetospheric boundary as observed by Explorer 12,","authors":[],"date":"1964","doi":null,"raw":"Freeman, J. W. (1964), The morphology of the electron distribution in the outer radiation zone and near the magnetospheric boundary as observed by Explorer 12, J. Geophys. Res., 69, 1691–1723, doi:10.1029\/ JZ069i009p01691.","cites":null},{"id":892355,"title":"The radial gradient of relativistic electrons at geosynchronous orbit,","authors":[],"date":"2004","doi":null,"raw":"Onsager, T. G., A. A. Chan, Y. Fei, S. R. Elkington, J. C. Green, and H. J. Singer (2004), The radial gradient of relativistic electrons at geosynchronous orbit, J. Geophys. Res., 109, A05221, doi:10.1029\/2003JA010368.","cites":null},{"id":890334,"title":"The solar wind and geomagnetic activity as a function of time relative to corotating interaction regions, in Recurrent Magnetic Storms:","authors":[],"date":"2006","doi":null,"raw":"McPherron, R. L., and J. Weygand (2006), The solar wind and geomagnetic activity as a function of time relative to corotating interaction regions, in Recurrent Magnetic Storms: Corotating Solar Wind Streams, Geophys. Monogr. Ser., vol. 167, edited by B. T. Tsurutani et al., pp. 125–137, AGU, Washington, D. C.","cites":null},{"id":884549,"title":"The superdense plasma sheet in the magnetosphere during high-speed-stream-driven storms: Plasma transport and timescales,","authors":[],"date":"2009","doi":null,"raw":"Denton, M. H., and J. E. Borovsky (2009), The superdense plasma sheet in the magnetosphere during high-speed-stream-driven storms: Plasma transport and timescales, J. Atmos. Sol. Terr. Phys., 71, 1045–1058, doi:10.1016\/j.jastp.2008.04.023.","cites":null},{"id":882568,"title":"The superdense plasma sheet: Plasmaspheric origin, solar wind origin, or ionospheric origin?,","authors":[],"date":"1997","doi":"10.1029\/96JA02469","raw":"Borovsky, J. E., M. F. Thomsen, and D. J. McComas (1997), The superdense plasma sheet: Plasmaspheric origin, solar wind origin, or ionospheric origin?, J. Geophys. Res., 102, 22,089–22,097.","cites":null},{"id":891356,"title":"Thorne (2007), Review of radiation belt relativistic electron losses,","authors":[],"date":null,"doi":null,"raw":"Millan, R. M., and R. M. Thorne (2007), Review of radiation belt relativistic electron losses, J. Atmos. Sol. Terr. Phys., 69, 362–377, doi:10.1016\/j.jastp.2006.06.019.","cites":null},{"id":885199,"title":"Tsurutani (2009a), Introduction to special issue on high speed solar wind streams and geospace interactions,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":885454,"title":"Turunen (2009b), Modification of midlatitude ionospheric parameters in the F2 layer by persistent high-speed solar wind streams,","authors":[],"date":null,"doi":null,"raw":"Denton, M. H., T. Ulich, and E. Turunen (2009b), Modification of midlatitude ionospheric parameters in the F2 layer by persistent high-speed solar wind streams, Space Weather, 7, S04006, doi:10.1029\/ 2008SW000443.","cites":null},{"id":888943,"title":"Unravelling the causes of radiation belt enhancements, Eos Trans.","authors":[],"date":"2007","doi":null,"raw":"Liemohn, M. W., and A. A. Chan (2007), Unravelling the causes of radiation belt enhancements, Eos Trans. AGU, 88(42), doi:10.1029\/ 2007EO420001.","cites":null},{"id":893017,"title":"Variation of mesospheric ozone during the highly relativistic electron event in","authors":[],"date":"2000","doi":null,"raw":"Pesnell, W. D., R. A. Goldberg, C. H. Jackman, D. L. Chenette, and E. E. Gaines (2000), Variation of mesospheric ozone during the highly relativistic electron event in May 1992 as measured by the High Resolution Doppler Imager instrument on UARS, J. Geophys. Res., 105, 22,943– 22,953, doi:10.1029\/2000JA000091.","cites":null},{"id":891843,"title":"Which magnetic storms produce relativistic electrons at geosynchronous orbit,","authors":[],"date":"2001","doi":null,"raw":"O’Brien, T. P., R. L. McPherron, D. Sornette, G. D. Reeves, R. Friedel, and H. J. Singer (2001), Which magnetic storms produce relativistic electrons at geosynchronous orbit, J. Geophys. Res., 106, 15,533–15,544, doi:10.1029\/2001JA000052.","cites":null},{"id":896765,"title":"Why Kp is such a good measure of magnetospheric convection,","authors":[],"date":"2004","doi":null,"raw":"Thomsen, M. F. (2004), Why Kp is such a good measure of magnetospheric convection, Space Weather, 2, S11004, doi:10.1029\/2004SW000089.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-01","abstract":"Bi-Maxwellian fits are made to energetic-electron flux measurements from seven satellites in geosynchronous orbit, yielding a number density (n) and temperature (T) description of the outer electron radiation belt. For 54.5 spacecraft years of measurements the median value of n is 3.7 × 10−4 cm−3, and the median value of T is 148 keV. General statistical properties of n, T, and the 1.1–1.5 MeV flux F are investigated, including local-time and solar-cycle dependencies. Using superposed-epoch analysis where the zero epoch is convection onset, the evolution of the outer electron radiation belt through high-speed-stream-driven storms is investigated. The number-density decay during the calm before the storm, relativistic-electron dropouts and recoveries, and the heating of the outer electron radiation belt during storms are analyzed. Using four different “triggers” (sudden storm commencement (SSC), southward interplanetary magnetic field (IMF) portions of coronal mass ejection (CME) sheaths, southward-IMF portions of magnetic clouds, and minimum Dst) a selection of CME-driven storms are analyzed with superposed-epoch techniques. For CME-driven storms, only a very modest density decay prior to storm onset is found. In addition, the compression of the outer electron radiation belt at the time of SSC is analyzed, the number-density increase and temperature decrease during storm main phase are characterized, and the increase in density and temperature during storm recovery phase is determined. During the different phases of storms, changes in the flux are sometimes in response to changes in the temperature, sometimes to changes in the number density, and sometimes to changes in both. Differences are found between the density-temperature and flux descriptions, and it is concluded that more information is available using the density-temperature description","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68504.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/32224\/1\/art_989.pdf","pdfHashValue":"140ef42412ca3aa4e598286e81ed5e9055a6f68c","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:32224<\/identifier><datestamp>\n      2018-01-17T00:02:51Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A density-temperature description of the outer electron radiation belt during geomagnetic storms<\/dc:title><dc:creator>\n        Denton, Michael H.<\/dc:creator><dc:creator>\n        Borovsky, J. E.<\/dc:creator><dc:creator>\n        Cayton, T. E.<\/dc:creator><dc:description>\n        Bi-Maxwellian fits are made to energetic-electron flux measurements from seven satellites in geosynchronous orbit, yielding a number density (n) and temperature (T) description of the outer electron radiation belt. For 54.5 spacecraft years of measurements the median value of n is 3.7 × 10−4 cm−3, and the median value of T is 148 keV. General statistical properties of n, T, and the 1.1–1.5 MeV flux F are investigated, including local-time and solar-cycle dependencies. Using superposed-epoch analysis where the zero epoch is convection onset, the evolution of the outer electron radiation belt through high-speed-stream-driven storms is investigated. The number-density decay during the calm before the storm, relativistic-electron dropouts and recoveries, and the heating of the outer electron radiation belt during storms are analyzed. Using four different “triggers” (sudden storm commencement (SSC), southward interplanetary magnetic field (IMF) portions of coronal mass ejection (CME) sheaths, southward-IMF portions of magnetic clouds, and minimum Dst) a selection of CME-driven storms are analyzed with superposed-epoch techniques. For CME-driven storms, only a very modest density decay prior to storm onset is found. In addition, the compression of the outer electron radiation belt at the time of SSC is analyzed, the number-density increase and temperature decrease during storm main phase are characterized, and the increase in density and temperature during storm recovery phase is determined. During the different phases of storms, changes in the flux are sometimes in response to changes in the temperature, sometimes to changes in the number density, and sometimes to changes in both. Differences are found between the density-temperature and flux descriptions, and it is concluded that more information is available using the density-temperature description.<\/dc:description><dc:date>\n        2010-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/32224\/1\/art_989.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2009JA014183<\/dc:relation><dc:identifier>\n        Denton, Michael H. and Borovsky, J. E. and Cayton, T. E. (2010) A density-temperature description of the outer electron radiation belt during geomagnetic storms. Journal of Geophysical Research, 115 (A01208). pp. 1-20. ISSN 0148-0227<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/32224\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1029\/2009JA014183","http:\/\/eprints.lancs.ac.uk\/32224\/"],"year":2010,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"A density-temperature description of the outer electron\nradiation belt during geomagnetic storms\nMichael H. Denton,1 Joseph E. Borovsky,2 and Thomas E. Cayton2\nReceived 20 February 2009; revised 9 July 2009; accepted 26 August 2009; published 21 January 2010.\n[1] Bi-Maxwellian fits are made to energetic-electron flux measurements from seven\nsatellites in geosynchronous orbit, yielding a number density (n) and temperature (T)\ndescription of the outer electron radiation belt. For 54.5 spacecraft years of measurements\nthe median value of n is 3.7 \u0002 10\u00034 cm\u00033, and the median value of T is 148 keV. General\nstatistical properties of n, T, and the 1.1–1.5 MeV flux F are investigated, including local-\ntime and solar-cycle dependencies. Using superposed-epoch analysis where the zero\nepoch is convection onset, the evolution of the outer electron radiation belt through\nhigh-speed-stream-driven storms is investigated. The number-density decay during the\ncalm before the storm, relativistic-electron dropouts and recoveries, and the heating of the\nouter electron radiation belt during storms are analyzed. Using four different ‘‘triggers’’\n(sudden storm commencement (SSC), southward interplanetary magnetic field (IMF)\nportions of coronal mass ejection (CME) sheaths, southward-IMF portions of magnetic\nclouds, and minimum Dst) a selection of CME-driven storms are analyzed with\nsuperposed-epoch techniques. For CME-driven storms, only a very modest density decay\nprior to storm onset is found. In addition, the compression of the outer electron radiation\nbelt at the time of SSC is analyzed, the number-density increase and temperature decrease\nduring storm main phase are characterized, and the increase in density and temperature\nduring storm recovery phase is determined. During the different phases of storms, changes\nin the flux are sometimes in response to changes in the temperature, sometimes to\nchanges in the number density, and sometimes to changes in both. Differences are found\nbetween the density-temperature and flux descriptions, and it is concluded that more\ninformation is available using the density-temperature description.\nCitation: Denton, M. H., J. E. Borovsky, and T. E. Cayton (2010), A density-temperature description of the outer electron radiation\nbelt during geomagnetic storms, J. Geophys. Res., 115, A01208, doi:10.1029\/2009JA014183.\n1. Introduction\n[2] A major issue in magnetospheric physics is to under-\nstand the evolution of the radiation belts. The evolution of\nthe outer electron radiation belt involves the addition and\nloss of electrons, the radial transport of electrons, and the\nheating and cooling of electrons. The density-temperature\nmeasurements presented here provide a new look at the\nbehavior of the outer electron radiation belt during two\ntypes of geomagnetic storms.\n[3] Relativistic electrons are harmful to satellite systems\nand instrumentation [e.g., Wrenn, 2009], present significant\ndangers to cosmonauts passing through the region, and have\nalso been implicated as playing a limited role in the\nmorphology of stratospheric ozone [e.g., Callis et al.,\n1991; Pesnell et al., 2000; Roldugin et al., 2000; Sinnhuber\net al., 2006; Seppa¨la¨ et al., 2007]. In general, differential\nfluxes are used to describe the properties of the electron\nradiation belt and are used in studies to determine acceler-\nation and loss mechanisms [e.g., Paulikas and Blake, 1979;\nNagai, 1982; Friedel et al., 2002; Reeves et al., 2003;Mann\net al., 2004; Li et al., 2005; Liemohn and Chan, 2007;\nOnsager et al., 2007; Millan and Thorne, 2007; Summers et\nal., 2007a, 2007b; Baker and Kanekal, 2008; Hudson et al.,\n2008; Borovsky and Denton, 2009a]. However, fluxes are\nsomewhat ambiguous in that increases in the flux can be\ncaused by increases in the number of electrons or by a\nheating of the electrons, and likewise decreases in the flux\ncan be caused by decreases in the number of electrons or by\na cooling of the electrons.\n[4] A density and temperature description of the electron\nradiation belt provides substantial advantages over the flux\ndescription: changes in the number of electrons and changes\nin the temperature of the electrons are separated in the\nmeasurements. With slight heating or cooling of the electron\npopulation the relativistic-electron fluxes can change by\norders of magnitude. A flux description leads one to look for\na particle-acceleration mechanism that can boost energies by\norders of magnitude whereas a density-temperature descrip-\ntion leads one to look for a heating mechanism that can\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 115, A01208, doi:10.1029\/2009JA014183, 2010\nClick\nHere\nfor\nFull\nArticle\n1Department of Communication Systems, Lancaster University,\nLancaster, UK.\n2Space Science and Applications, Los Alamos National Laboratory,\nLos Alamos, New Mexico, USA.\nCopyright 2010 by the American Geophysical Union.\n0148-0227\/10\/2009JA014183$09.00\nA01208 1 of 20\nmodestly heat the electrons [cf. Borovsky et al., 1998].\nHence, a density-temperature description provides a simpli-\nfied and more manageable description of the evolution of\nthe radiation belts, with the potential to reveal physical\nphenomena not readily accessible with a flux description.\n[5] The density-temperature description of the outer elec-\ntron radiation belt that is used in this study was developed\nby Cayton et al. [1989]. In Cayton et al.’s [1989] study,\nrelativistic bi-Maxwellian fits of the multisatellite CPA\n(charged particle analyzer) measurements were carried out\nto investigate the effect of magnetospheric substorms on the\nouter electron radiation belt. The study revealed that sub-\nstorms result in decreases in the number density of the outer\nelectron radiation belt at geosynchronous orbit. That study\nalso found 27-day periodicities in the number density of the\nouter electron radiation belt. Other studies have since utilized\nthis description of the electron radiation belt. Borovsky et al.\n[1998] used Cayton’s relativistic bi-Maxwellian fits to\nmultisatellite SOPA (synchronous orbit particle analyzer)\nmeasurements of the outer electron radiation belt at geo-\nsynchronous orbit in order to study the evolution of the\nouter electron radiation belt during storms. Borovsky et al.\n[1998] observed that after the outer electron radiation belt\nwas emptied of electrons at storm onset, the number density\nof electrons rapidly returned to a level that remained quasi-\nconstant during the storm itself, and that slow increases in\nthe relativistic-electron flux during the storms were associ-\nated with a slow and modest heating of the outer electron\nradiation belt at constant density. Borovsky and Steinberg\n[2006] used Cayton’s relativistic bi-Maxwellian fits to the\nmultisatellite SOPA measurements to examine the effect of\nthe outer plasmasphere on the outer electron radiation belt\nduring calm periods before storms. They found that the\nnumber density of the outer electron radiation belt at\ngeosynchronous orbit decays prior to storm onset and that\nthe decay is stronger when the outer plasmasphere is present\nin the magnetosphere than when it is absent. Borovsky and\nDenton [2009b] followed up that study to quantify the\nnumber-density decay rates of the outer electron radiation\nbelt number density during calms before storms.\n[6] The current study presents a density-temperature\noverview of the evolution of the outer electron radiation\nbelt at geosynchronous orbit during geomagnetic storms\ndriven by high-speed solar wind streams (HSSs) and geo-\nmagnetic storms driven by coronal mass ejections (CMEs).\nPrevious work has revealed that the two types of solar wind\nhave distinct physical consequences for the inner magneto-\nsphere [e.g., Lindsay et al., 1995; Wilken et al., 1999;\nDenton et al., 2006; Borovsky and Denton, 2006a; Lavraud\net al., 2006; Georgieva et al., 2006; Turner et al., 2006;\nLongden et al., 2008; Sandanger et al., 2009]. In the current\nstudy, more distinctions between the two types of solar wind\ndriver are quantified in detail in terms of the electron\ntemperature and number-density response of the outer\nradiation belt.\n[7] This manuscript is organized as follows. In section 2\nthe relativistic bi-Maxwellian fits to energetic electrons are\noverviewed and the data set that will be used are described.\nIn section 3 the evolution of the outer electron radiation belt\nat geosynchronous orbit during high-speed-stream-driven\nstorms is analyzed using superposed-epoch techniques. In\nsection 4 the evolution of the outer electron radiation belt at\ngeosynchronous orbit during coronal-mass-ejection-driven\nstorms is examined using superposed-epoch data analysis\nwith four separate ‘‘triggers’’ to discern the evolution during\ndifferent phases of the storms. The findings of this study are\nsummarized in section 5. Ideas for future work are discussed\nin section 6.\n2. Data Analysis: Relativistic Bi-Maxwellian Fits\n[8] The SOPA instruments [Belian et al., 1992; Cayton\nand Belian, 2007] measure spin-averaged energy-resolved\nfluxes of energetic electrons in the energy range \u000450 keV to\n>2 MeVat a cadence of 10 s. Cayton et al. [1989] found that\nthe energetic-electron energy distribution at geosynchronous\norbit could be well described by relativistic bi-Maxwellians.\n(Note that Pierrard and Lemaire [1996] found that electron-\nradiation belt energy spectra away from geosynchronous\norbit were also well described by relativistic bi-Maxwellians.)\nFor the present data analysis the electron measurements at\ngeosynchronous orbit measured by SOPA instruments\n[Belian et al., 1992] on seven Los Alamos National Labo-\nratory (LANL) satellites (046, 095, 080, 084, 97A, 01A, and\n02A) in the 18 years from 1990 through 2007 are fitted with\nrelativistic bi-Maxwellian distributions using a method\nrefined from the method of Cayton et al. [1989]. The current\nmethod models the counting rates for each electron energy\nchannel as linear combinations of two Maxwellian compo-\nnents plus a nonelectron ‘‘background’’ contribution. Min-\nimizing the squared deviations between the observed and\nmodel counting rates summed over 10 electron channels\nyields the best fitting two Maxwellian spectra (see also\nCayton and Belian [2007] for full details). A scatterplot of\nthe number densities and temperatures of the two components\nof the bi-Maxwellian fits appears in Figure 1. The points are\nhalf-hour median values of the fit parameters for the space-\ncraft LANL-01a for the seven years 2001–2007. The ener-\ngetic electrons at geosynchronous orbit divide into a ‘‘hard’’\ncomponent with a number density of \u00045 \u0002 10\u00034 cm\u00033 and a\ntemperature of \u0004150 keV (red points in Figure 1) and a\n‘‘soft’’ component with a number density of\u00041\u0002 10\u00032 cm\u00033\nand a temperature of \u000430 keV (green points in Figure 1).\nThe soft component is the suprathermal tail of the electron\nplasma sheet, which is associated with substorm energetic-\nelectron injections [e.g., Cayton et al., 1989; Birn et al.,\n1998]. The hard component is the outer electron radiation\nbelt. Note in Figure 1 that the temperature of the outer\nelectron radiation belt (red points) varies by factors of \u00042\nwhereas the number density varies by more than an order of\nmagnitude.\n[9] In Figure 2 the number density n, temperature T, and\npressure (energy density) P = nkBT of the outer electron\nradiation belt at geosynchronous orbit are plotted along with\nthe multisatellite average of relativistic-electron flux in the\n1.1–1.5 MeV energy band [Borovsky and Denton, 2009a].\nFor Figures 2a–2c the binning is of 955,527 half-hour\nmedians comprising 54.5 satellite years of data taken\nbetween 1990 and 2007. Figure 2a shows the occurrence\ndistribution of log10(n). The distribution of log10(n) has a\nmodest skewness (i.e., it is slightly asymmetric) and a\nmodest kurtosis (i.e., it is somewhat peaked): the distribu-\ntion of n itself has a large skewness and an extraordinarily\nlarge kurtosis. The mean value of n is 4.2 \u0002 10\u00034 cm\u00033 and\nA01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\n2 of 20\nA01208\nthe median value of n is 3.7 \u0002 10\u00034 cm\u00033. The number\ndensity of the outer electron radiation belt at geosynchro-\nnous orbit is about 10\u00033 times as small as the number\ndensity of hot plasma at geosynchronous orbit [cf. Denton et\nal., 2005]. Figure 2b shows the occurrence distribution of\nthe temperature T of the electron radiation belt. The distri-\nbution of T has a slight skewness and a slight kurtosis. The\nmean value of T is 142 keV and the median value of T is\n148 keV. Note that the relative variation of T (standard\ndeviation divided by mean value) is about 30%; the relative\nvariance of n is about 70%. In Figure 2c the occurrence\ndistribution of the pressure P = nkBT of the outer electron\nradiation belt at geosynchronous orbit is shown. The distri-\nbution of the pressure itself has a large skewness and a very\nlarge kurtosis. The mean value of P is 0.0104 nPa and the\nmedian value is 0.0083 nPa. In Figure 2d the differential\nflux F of relativistic electrons in the 1.1–1.5 MeV energy\nband are binned. The binning is of 876,391 half-hour\nmedians comprising 50.0 satellite years of data taken\nbetween 1989 and 2006. These data were originally utilized\nin the study of Borovsky and Denton [2009a]. Figure 2d\nshows the occurrence distribution of log10(F). Comparison\nbetween Figures 2a–2c and Figure 2d highlights the differ-\nence between the density\/temperature distributions and the\nflux distribution. The distribution of log10(F) has a modest\nskewness and a modest kurtosis: the distribution of F itself\nhas a large skewness and an extraordinarily large kurtosis.\nThe mean value of F is 13.0 cm\u00032 s\u00031 ster\u00031 keV\u00031 and the\nmedian value is 4.7 cm\u00032 s\u00031 ster\u00031 keV\u00031. By comparing\nFigures 2a and 2d, it is clear that the occurrence distribution\nof log10(n) has a width of about 1.5 (which is 1.5 orders of\nmagnitude of variation of n), while the occurrence distribu-\ntion of log10(F) has a width of about 2.5 (which is 2.5 orders\nof magnitude of variation of F). The relative variation of F\n(standard deviation divided by mean value) is about 180%\nwhich is much larger than the relative variation of n or T\nindicating that the flux distribution is more variable that\neither the temperature or density distribution.\nFigure 1. A scatterplot containing half-hour median values of number density and temperature for the\nspacecraft LANL-01a for the seven years 2001–2007, calculated from two-component relativistic\nMaxwellian fits. The energetic electrons at geosynchronous orbit divide into a ‘‘hard’’ component with a\nnumber density of \u00045 \u0002 10\u00034 cm\u00033 and a temperature of \u0004150 keV (red points) and a ‘‘soft’’ component\nwith a number density of \u00041 \u0002 10\u00032 cm\u00033 and a temperature of \u000430 keV (green points).\nA01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\n3 of 20\nA01208\n[10] As measured at geosynchronous orbit, there are\nlocal-time dependencies in the number density n, tempera-\nture T, and electron flux F (1.1–1.5 MeV) of the outer\nelectron radiation belt. These local-time dependencies are\nshown in Figure 3. The gray points are the half-hour\nmeasurements (with every 20th point plotted) and the red\npoints are 3000-point running logarithmic averages of the\ngray points. Note that the number density (Figure 3a) of the\nouter electron radiation belt at geosynchronous orbit has a\nweak local-time dependence with a maximum in the pre-\nnoon sector between 0900 and 1000 LT; the temperature\n(Figure 3b) has a similar but weaker local-time dependence\nwith a maximum between 1100 and 1200 LT. The relativistic-\nelectron flux F in the 1.1–1.5 MeV energy band at geosyn-\nchronous orbit is also plotted as a function of local time\n(Figure 3c). The flux also shows a similar local-time depen-\ndence as the number density n and the temperature T of the\nelectrons with a maximum between 1100 and 1200 LT. In\ngeneral, the equatorial magnetic field strength at geosyn-\nchronous orbit is weaker on the nightside than it is on the\ndayside. This can be seen in Figure 3d, where half-hour-\naveraged values of the magnetic field strength as measured\nby the GOES 10 spacecraft in geosynchronous orbit in the\nyears 1999 through 2003 are plotted (the maximum field\nstrength occurs between 1100 and 1200 LT). To ensure that\nthe GOES spacecraft was not in the magnetosheath owing to\nmagnetopause crossings, GOES magnetometer measure-\nments were only used if the magnetic field clock angle\nmeasured by GOES was within 20\u0002 of the dipole direction;\nmagnetopause crossings at geosynchronous orbit almost\nalways occur under southward IMF [e.g., Rufenach et al.,\n1989], which would put the clock angle in the magneto-\nsheath at 90\u0002 or more from the dipole direction. The red\ncurve is a 300-point running average of the gray points.\nEnergetic electrons drift in a manner preserving their adia-\nbatic invariants; to preserve their first adiabatic invariant\nthey tend to drift on orbits with constant magnetic field\nstrength at the equator. Hence, they move further out on the\ndayside (where the field is strong) and closer in on the\nnightside (where the field is weak) [e.g., Roederer, 1967].\nAt geosynchronous orbit on the nightside a spacecraft is in\nthe more outer portions of the radiation belt than is a\nspacecraft on the dayside. Since the radiation belts are of\nlower density and cooler further out, a nightside spacecraft\nsees a lower density and a lower temperature than does a\ndayside spacecraft (cf. Figures 3a and 3b). The flux (Figure 3c)\nfollows the density-temperature trend. Note that some recent\ndata-analysis efforts [e.g., Onsager et al., 2004; Green and\nKivelson, 2004; Chen et al., 2005] have used magnetic field\nmodels to transform measurements taken at geosynchronous\norbit (6.6 Re) to coordinates reflecting the noncircular orbits\nof the radiation-belt electrons in order to remove adiabatic\nFigure 2. The (a) number density, (b) temperature,\n(c) pressure, and (d) relativistic-electron flux (1.1–1.5 MeV)\nof the outer radiation belt at geosynchronous orbit, binned to\nproduce occurrence distributions (1990–2007). For the\nnumber density, temperature, and pressure the base-10\nlogarithms are binned (955,527 half-hour measurements\nfrom seven satellites), while for the flux, the half-hour\nmultisatellite averages are binned (278,471 data points).\n4 of 20\nA01208A01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\n‘‘Dst effects’’ [Dessler and Karplus, 1961] and pressure-\ninduced changes [Zaharia et al., 2005]. Suchmodel-dependent\ntechniques are not utilized in the present investigation: here,\nthe radiation environment at geosynchronous orbit itself is\nstudied.\n[11] In Figure 4 the density n (Figure 4a), temperature T\n(Figure 4b), pressure P= nkBT (Figure 4c), and 1.1–1.5MeV\nflux F (Figure 4d) of the outer electron radiation belt at\ngeosynchronous orbit are plotted as a function of time for\n18 years. The international sunspot number (ISN) is also\nplotted (Figure 4e). In Figures 4a–4c the black points are\n5000-point logarithmic averages of the 955,527 half-hour\nmeasurements. Depending on the number of geosynchro-\nnous satellites in operation at the time, the 5000-point\naveraging represents about a 1 month running average. In\nFigure 4d the black points are 1440-point logarithmic\naverages (a 30 day running average) of the 278,471 half-\nhour multisatellite averages of the fluxes, F. These fluxes\nare the multisatellite averaged fluxes calculated from SOPA\ninstruments on all available spacecraft and previously used\nin Borovsky and Denton’s [2009a] study. As can be seen,\nduring years with substantial high-speed-stream activity,\nsuch as 1993–1994, 2003, and 2005 (in declining phases\nof the solar cycle), the number density n of the outer\nelectron radiation belt at geosynchronous orbit tends to be\nhigh. Some years around solar minimum (e.g., 1995 and\n2007), the outer electron radiation belt tends to have a very\nlow density. The pressure (energy content) of the outer\nelectron radiation belt (Figure 4c) tends to reflect these\nnumber-density trends. The solar-cycle temperature varia-\ntions are less than the variations in number density, with the\ntemperature of the outer electron radiation belt tending to be\nslightly higher than average during the declining phase of\nthe solar cycle. The monthly averaged relativistic-electron\nflux F at geosynchronous orbit also tends to reflect the trend\nin the number density of the outer electron radiation belt: the\nflux is higher during the declining phase of the solar cycle\nthan it is during the other phases.\n3. Evolution of the Outer Electron Radiation Belt\nDuring High-Speed Solar Wind Streams\n[12] The arrival of high-speed solar wind streams (HSSs)\nat the Earth’s magnetosphere initiates numerous physical\nprocesses, including (1) a sudden onset of magnetospheric\nconvection (e.g., McPherron and Weygand [2006] and\nFigure 3. (a, b) For 955,527 half-hour measurements\n(1990–2007), the number density and temperature of the\nouter electron radiation belt at geosynchronous orbit are\nplotted as a function of the local time at which the\nmeasurement was made. (c) For 876,391 half-hour\nmeasurements (1999–2003), the 1.1–1.5 MeV electron\nflux is plotted as a function of the local time at which the\nmeasurement was made. (d) For 82,579 half-hour measure-\nments (1989–2006) from the GOES 10 spacecraft, the\nmagnetic field strength at geosynchronous orbit is plotted as\na function of the local time at which the measurement was\nmade. The gray points are the individual measurements, and\nthe red points are 3000-point averages of the gray points.\n5 of 20\nA01208A01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\nFigure 4\nA01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\n6 of 20\nA01208\ncompare Figure 5), (2) enhanced density, heating, and\ntransport in the plasma sheet [e.g., Borovsky et al., 1998;\nLavraud et al., 2006; Denton and Borovsky, 2008],\n(3) enhanced particle precipitation [Longden et al., 2008],\n(4) flux dropouts\/recovery of outer radiation belt electrons\n[e.g., Paulikas and Blake, 1979; O’Brien et al., 2001;\nBorovsky and Denton, 2009a], (5) the formation of long-\nlived plasmaspheric drainage plumes [Borovsky and Denton,\n2006b, 2008], and (6) an increase in ionospheric heating and\nthe occurrence of F region storms [Denton et al., 2009b;\nSojka et al., 2009]. Many of these processes are interlinked\n[e.g., Tsurutani et al., 2006; Kavanagh and Denton, 2007;\nDenton et al., 2009a]. For example, the onset of convection\n(process 1) causes plasma from the outer plasmasphere to be\nstripped away into a plasmaspheric plume (process 5),\nwhich is implicated in the loss of relativistic electrons from\nthe outer radiation belt (process 4) [Borovsky and Denton,\n2009a].\n[13] To study the behavior of the outer electron radiation\nbelt during high-speed-stream-driven storms we perform a\nsuperposed-epoch analysis of 124 HSS storms that occurred\nbetween 1993 and 2006. Previously, these events have been\nused successfully in studies of the magnetospheric response\nto HSSs [Borovsky and Denton, 2008, 2009a, 2009b;\nDenton and Borovsky, 2008, 2009; Denton et al., 2009b].\nThe list of HSSs was constructed on the basis of an initial\nlist of CIR stream interfaces for 1993–1996 provided by\nR. McPherron (private communication, 2005): the HSS is\nthe extended period of fast solar wind which follows the\nCIR. More events were added to the initial list by searching\nsolar wind data for years beyond 1996 and identifying\ntypical signatures of HSSs (e.g., east-west flow deflection\nfollowed by sustained elevated solar wind speed). The final\nlist of HSS storms between 1993 and 2006 includes an\n‘‘onset time,’’ which is the time of storm convection onset.\nConvection onsets are initially detected by a strong rise in\nthe Kp index [cf. Elphic et al., 1999; Thomsen, 2004], with\nthe final onset time calculated to \u000430 min time resolution\nusing changes in the Midnight Boundary Index (MBI)\n[Madden and Gussenhoven, 1990]. It should be noted that\nevents with no discernable increase in convection following\na HSS identification in the solar wind are not included in the\nstudy (see Denton et al. [2006] and Denton and Borovsky\n[2008] for full details). This event selection likely corre-\nsponds to events that are Russell-McPherron effective\n[Russell and McPherron, 1973; McPherron et al., 2009].\n[14] Figure 5 contains plots of a selection of superposed\nsolar wind, radiation belt, and geomagnetic parameters for\n35 days prior to storm onset (zero epoch) and 35 days after\nstorm onset; that is, it encompasses more than one solar\nrotation period before and after the arrival of each HSS at\nthe magnetosphere. In Figure 5a the superposition of the\nsolar wind speed (V-SW) is show for the 124 high-speed-\nstream-driven storms. The dark blue curve in each plot of\nFigure 5 is the mean value of the data superposition. The\nspeed is obtained from the high-resolution OMNI2 database\n[King and Papitashvili, 2005]. The solar wind speed plot\nindicates that prior to onset the speed reaches a local\nminimum before increasing sharply (see Borovsky and\nSteinberg [2006] for a discussion of the ‘‘calm before the\nstorm’’). At storm onset the speed is increasing and the\nspeed remains at an elevated level for a number of days.\nTypically storm onset occurs during the passage of the\ncorotating interaction region (CIR) upstream of the high-\nspeed wind [Denton and Borovsky, 2009]. The east-west\ncomponent of the solar wind (VY-SW) shown in Figure 5b\nindicates the rapid negative-then-positive flow deflection of\nthe CIR: the onset of the HSS-driven storm occurs within\nthe CIR [see also Denton and Borovsky, 2008, Figure 1]. The\nsuperposition of the north-south (GSM) component of the\ninterplanetary field (BZ-GSM) for the 124 high-speed-\nstream-driven storms is shown in Figure 5c. The super-\nposition of BZ indicates that on average there is a strong\nsouthward turning of the IMF close to the storm onset,\nalthough some of the events do have northward BZ at this\ntime. In Figure 5d the superposition of the solar wind\nnumber density (N-SW) is plotted for the 124 high-speed-\nstream-driven storms. As can be seen, there is a peak in the\nsuperposed solar wind density that is roughly concurrent\nwith the strong southward BZ field. The peak in density is\nthe result of the compression of the solar wind within the\nCIR and the peak in solar wind density produces a super-\ndense plasma sheet in the magnetosphere (when the solar\nwind plasma is captured and heated) [Borovsky et al., 1997;\nDenton and Borovsky, 2008, 2009]. Following this peak, the\nsolar wind density falls to a level below its prestorm\naverage. The geomagnetic reaction of the magnetosphere\nduring the high-speed-stream-driven storms can be gauged\nin Figures 5e and 5f, where superpositions of the Dst index\nand the Kp index are shown for the 124 events. At time t = 0\nthere is a sharp increase in the value of Kp (storm onset) and\nKp persists at elevated levels for several days after storm\nonset. Note in Figure 5f that prior to the increase in Kp there\nis a distinct period of lower-than-normal Kp in the data\nsuperposition: this is the ‘‘calm before the storm’’ [Clilverd\net al., 1993; Borovsky and Steinberg, 2006; Borovsky and\nDenton, 2009b]. Note also in Figure 5f the 27-day period-\nicity that is seen in the increase of Kp associated with the\n27-day recurrence of the high-speed streams. In Figure 5e\nthe superposition of the Dst index is plotted for the 124\nhigh-speed-stream-driven storms. One feature to note is the\nlimited decrease in Dst near zero epoch. On average, these\nhigh-speed-stream-driven storm events have a minimum Dst\nof around \u000330. Indeed, it is instructive to note that by\nsimply relying on Dst as a proxy for ‘‘storm strength,’’ the\nmajority of the events used in this study would likely be\nneglected [cf. Denton et al., 2006; Borovsky and Denton,\n2006a; Georgieva et al., 2006].\n[15] Figure 6 contains epoch time versus local time plots\nof the superposed relativistic-electron number density (n),\nFigure 4. Plots of the (a) density, (b) temperature, (c) pressure, and (d) flux (1.1–1.5 MeV), of the outer electron radiation\nbelt at geosynchronous orbit as a function of time for 18 years. (e) Plot of the international sunspot number (ISN). In\nFigures 4a–4c the black points are 5000-point logarithmic averages of the 955,527 half-hour measurements from seven\nsatellites (1990–2007 inclusive). In Figure 4d the black points are 1440-point logarithmic averages of 278,471 half-hour\nmultisatellite averages (1990–2006).\n7 of 20\nA01208A01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\ntemperature (T), pressure (P = nkBT), and relativistic-\nelectron flux F (1.1–1.5 MeV) for 124 HSSs between\n1993 and 2006. The zero epoch for the superposition is\nagain the storm onset of magnetospheric convection. The\nfluxes F used here are the multisatellite averaged fluxes\ncalculated from SOPA instruments on all available space-\ncraft and previously used in Borovsky and Denton’s [2009a]\nstudy. The plots extend from 35 days prior to onset to 35\ndays after onset. Figure 6 contains a broad overview of the\nrelativistic-electron behavior in the outer radiation belt at\ngeosynchronous orbit during HSSs, and several features are\nclearly apparent. First, Figure 6 shows that the density,\ntemperature, and pressure of the outer electron radiation belt\nall decrease at close to zero epoch. Second, Figure 6 shows\nthat the number density, temperature, and pressure of the\nouter radiation belt all increase after storm onset, as does the\nrelativistic-electron flux. Following the decrease in density\nand temperature around zero epoch, all three parameters are\nFigure 5. (a–f) Selected solar wind parameters as a function of epoch time for 124 HSSs between 1993\nand 2006. The upper quartiles on the measurements are shown in red, while the lower quartiles are shown\nin green. The mean value of each parameter is plotted in dark blue, while the median is plotted in light\nblue. The gray shaded regions indicate values within one standard deviation of the mean.\nA01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\n8 of 20\nA01208\nthen elevated for a period of \u00044 days duration. This is\nconsistent with the duration of the high-speed solar wind\n(Figure 5a), and associated elevated levels of convection\n(Figure 5f). Third, Figure 6 shows that there is a pronounced\nquasi-27-day periodicity in all of the outer-electron-radiation-\nbelt parameters owing to the presence of recurrent high-speed\nsolar wind structures (cf. Figure 5). The local-time depen-\ndence of the number density, temperature, pressure (energy\ndensity), and the relativistic-electron flux in Figure 6 fol-\nlows the trends described in section 2. The outer electron\nradiation belt at geosynchronous orbit is more intense on the\ndayside than on the nightside owing to the weaker magnetic\nfield on the nightside (compare Figure 3).\n[16] The detailed behavior of electrons within the outer\nradiation belt during a HSS-driven storm can better be\ngrasped by examination of Figure 7. Here, the zero epoch\nis the onset of storm levels of convection and time extends\nfrom 5 days prior to storm onset to 5 days after storm onset.\nIn Figures 7a, 7c, 7e, and 7g the superposed number density,\ntemperature, pressure, and relativistic-electron flux (1.1–\n1.5 MeV) of the outer electron radiation belt at geosyn-\nchronous orbit are plotted in local time versus epoch time.\nIn Figures 7b, 7d, 7f, and 7h, 3 h wide local-time cuts\n(2300–0100 LT, 0500–0700 LT, 1100–1300 LT, and\n1700–1900 LT) of the number density, temperature, pres-\nsure, and flux are plotted versus time. Each curve plotted in\nFigures 7b, 7d, 7f, and 7h is smoothed with a 10 h boxcar\naverage in time. Four features seen in Figure 7 are discussed\nin the following four paragraphs and are summarized in\nTable 1.\n[17] First, in the few days prior to storm onset, there is a\nslow decay in the number density of the outer electron\nradiation belt at geosynchronous orbit while the temperature\nremains constant. This is best observed in the line plots of\nnumber density and temperature shown in Figure 7: the\nnumber density decreases at all local times while the\ntemperature is approximately constant at all local times.\nThe density begins to decrease about four days prior to\nstorm onset. Owing to this density decay, the pressure also\ndecreases with time in the days prior to storm onset\n(Figures 7e and 7f) and the relativistic-electron flux also\ndecreases with time (Figures 7g and 7h). These trends are\nrecorded in Table 1. Note in Figure 7 that the logarithmic\ndecrease in the relativistic-electron flux in the days before\nstorm onset is only about half the logarithmic decrease in\nthe number density. In the days prior to the onset of HSS-\ndriven storms, a geomagnetic calm tends to occur owing to\na Russell-McPherron effect [Borovsky and Steinberg,\n2006]. The decay of the number density of the outer\nelectron radiation belt during these calms prior to storms\nis attributable to the refilling of the outer plasmasphere.\nThis refilling in turn leads to a pitch angle scattering of the\nradiation belt electrons into the atmospheric loss cone\n[e.g., Meredith et al., 2004] and eventual precipitation into\nFigure 6. Superposed outer electron radiation belt number\ndensity, temperature, pressure, and flux, calculated using a\nsuperposed-epoch analysis of 124 high-speed solar wind\nstreams between 1993 and 2006. Averaged values of these\nparameters at 1 h time resolution are displayed for ±35 days\nfrom the zero epoch of convection onset.\n9 of 20\nA01208A01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\nFigure 7\nA01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\n10 of 20\nA01208\nthe atmosphere [e.g., Rodger et al., 2008]. (Note that for\ncertain wave-particle interactions such as EMIC waves, the\nstrength of the scattering may be dependent upon the com-\nposition of the cold plasmaspheric material.) The decay rates\nof the outer electron radiation belt number density prior to\nstorm onset have been quantified by Borovsky and Denton\n[2009b].\n[18] Second, as shown in Figures 7a and 7b, around the\ntime of storm onset the number density of the outer electron\nradiation belt suddenly decreases to very low levels (essen-\ntially to instrument-background levels). This is the well-\nknown ‘‘relativistic-electron dropout’’ [e.g., Freeman, 1964;\nNagai, 1982; Onsager et al., 2002; Green et al., 2004;\nBorovsky and Denton, 2009a] usually discussed in terms of\nflux observations, but here also presented in terms of\nelectron density. Coincident with the electron density drop-\nout is an apparent decrease in the temperature of the\nelectrons. Although background contributions to the chan-\nnel counting rates were modeled explicitly in the spectral\nfitting procedure, the inferred temperature could be sensitive\nin detail to the assumed set of background rates (i.e., caution\nis advised with respect to interpretation of the low values\nof temperature). The relativistic-electron flux (Figures 7g\nand 7h) also shows relativistic-electron dropout behavior,\nbut the timing of the drop in number density differs slightly\nfrom the timing of the drop in flux. This is particularly\nnoticeable in Figure 7, where the time of minimum number\ndensity (at t \u0005 0) is almost half a day prior to the time of\nminimum flux. The occurrence (or not) of these relativistic-\nelectron dropouts has been shown to be associated with the\noccurrence (or not) of a superdense plasma sheet in the\nmagnetosphere during the storm [Denton and Borovsky,\n2008, 2009]. The superdense plasma sheet has its origin\nin the compressed (or not) solar wind in the CIR upstream\nof the high-speed stream [Denton and Borovsky, 2009].\n[19] Third, less than one day after the relativistic-electron\ndropout, the number density of the outer electron radiation\nbelt at geosynchronous orbit increases sharply. This is the\nsudden ‘‘recovery from dropout’’ [Borovsky and Denton,\n2009a], which is clearly seen in Figures 7a and 7b.\nTypically, but not always, the number density is higher\nafter the recovery than it was just prior to the dropout (of\ncourse the number density had been decreasing slowly for a\nfew days prior to the dropout proper). Also, the superposed\ntemperature of the electrons is lower just after recovery than\nit was just prior to dropout. The pressure of the outer\nelectron radiation belt reflects these density and temperature\ntrends. The relativistic-electron flux (Figures 7g and 7h)\nalso shows this recovery from dropout. However, the\nrecovery is more sudden when observed in terms of number\ndensity than when it is observed in terms of flux. Note that\nthe recovery in number density occurs earlier than does the\nrecovery in flux. By investigating the timing of changes in\nthe different plasma populations concerned, the recovery\nfrom dropout of the outer electron radiation belt has been\nassociated with the termination of the superdense-plasma\nsheet phase of the geomagnetic storm [Borovsky and Denton,\n2009a].\n[20] Fourthly, Figure 7 shows that in the first few days\nafter recovery from a relativistic-electron dropout, the\ntemperature of the outer electron radiation belt at geosyn-\nchronous orbit slowly increases with time while the number\ndensity remains approximately constant. This is best seen in\nthe line plots of temperature and density in Figures 7b and 7d.\nThe slow temperature increase occurs during the elevated Kp\nof the several-days-long geomagnetic storm (cf. Figure 5f).\nAs can be seen in Figures 7b, 7d, 7f, and 7h, after the rapid\nrecovery in the number density the relativistic-electron\nfluxes at geosynchronous increase by around an order of\nmagnitude during an extended interval of elevated Kp.\nThese trends are noted in Table 1. It is also clear from\nFigure 7 that this increase in fluxes by an order of magni-\ntude occurs while the temperature only increases by a\nmodest amount. This comparison highlights the dichotomy\nof a great particle accelerator versus a modest heater (as was\nnoted by Borovsky et al. [1998]). Commensurate with this\ndensity-temperature behavior, the pressure (thermal-energy\ndensity) of the outer electron radiation belt increases steadily\nfor days after storm onset (Figures 7e and 7f). The heating\nrates of the outer electron radiation belts at geosynchronous\nstorms (and correlated parameters) remain to be quantified.\n4. Evolution of the Outer Electron Radiation Belt\nDuring CME-Driven Storms\n[21] In contrast to recurrent high-speed-stream-driven\nevents wherein the electron radiation belt behavior is\nrepeatable and easier to categorize, there are significant\nFigure 7. Superposed outer electron radiation belt (a, b) number density, (c, d) temperature, (e, f) pressure, and (g, h) flux,\ncalculated using a superposed-epoch analysis of 124 high-speed solar wind streams between 1993 and 2006. Averaged\nvalues of these parameters at 1 h time resolution are displayed for ±5 days from the zero epoch of convection onset. Figures 7a,\n7c, 7e, and 7g contain enlarged versions of the data from Figure 6. In addition, the number density, temperature, pressure, and\nflux are averaged over 3 h local-time bins and plotted as a function of epoch time (2300–0100 LT (black curves), 0500–\n0700 LT (red curves), 1100–1300 LT (green curves), and 1700–1900 LT (blue curves)).\nTable 1. Overview of the Evolution of the Outer Electron Radiation Belt at Geosynchronous Orbit During a High-Speed-Stream-Driven\nStorm\nPhase of Storm Number Density (n) Temperature (T) Pressure (P) Relativistic Flux (F) Flux Responds to\nCalm before the storm decreases slowly constant decreases slowly decreases slowly density\nRelativistic-electron dropout\nat storm onset\ndecreases suddenly apparent decrease\n(see section 3)\ndecreases suddenly decreases suddenly density and temperature\nRecovery from\nrelativistic-electron dropout\nincreases suddenly\napparent increase\n(see section 3)\nincreases suddenly increases suddenly density\nLong-duration storm constant increases slowly increases slowly increases greatly temperature\n11 of 20\nA01208A01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\ndifferences in solar wind drivers from one magnetic-cloud\nevent to another [cf. Jian et al., 2006] making the electron\nradiation belt behavior difficult to categorize. Hence, cloud-\ndriven storms are more difficult to study via superposed-\nepoch analysis than are high-speed-stream-driven storms.\nFurthermore, complications in the interpretation of the\nevolution of the outer electron radiation belt during CME-\ndriven storms arise from competing effects acting simulta-\nneously, such as compression of the magnetosphere by solar\nwind ram pressure, the distortions of the inner magneto-\nsphere by strong ring current-plasma perturbations (the Dst\neffect), and the evolution of the radiation belts due to\ngeomagnetic activity. A typical (but not unique) temporal\nsequence for the solar wind driver is (1) interplanetary-\nshock arrival, (2) passage of the CME sheath, and (3)\npassage of the southward-IMF portion of the cloud. The\nshock may or may not be present, the sheath may or may\nnot drive the magnetosphere, and the cloud may or may not\nhave a southward-IMF portion. In addition, there may or\nmay not be a northward-IMF portion of the cloud between\nthe sheath and the southward-IMF portion of the cloud.\n[22] For cloud-driven storms, a standard ‘‘trigger’’ to take\nfor the zero epoch of the data superposition is the minimum\nvalue of the Dst index for the storm [e.g., Denton et al.,\n2005, 2006; Lavraud et al., 2006; Zhang et al., 2006]. Note,\nhowever, taking a single trigger at Dst minimum to analyze\nCME-driven storms is a method that mixes several cloud-\ndriven storm phases together owing to the storm-to-storm\ndifferences in the sequences, and to the differing temporal\ndurations of the phases. Such a single-epoch superposition\nof measurements from 78 CME-driven storms appears in\nFigure 8, with the trigger taken to be the time of minimum\nDst. The 78 storms are the CME-driven events utilized in\nthe superposed-epoch study of magnetospheric hot plasmas\nby Denton et al. [2006]. In Figure 8a the superposition of\nthe number density of the outer electron radiation belt at\ngeosynchronous orbit is plotted, in Figure 8b the superpo-\nsition of the temperature is plotted, in Figure 8c the\nsuperposition of the pressure P = nkBT is plotted, in\nFigure 8d the superposition of the 1.1–1.5 MeV electron\nflux is plotted, and in Figure 8e the superposition of the\nDst index is plotted. The Dst plot indicates the main phase\nof the storm (Dst decreasing) and the recovery phase of\nthe storm (Dst increasing back to quiet levels). As seen in\nFigure 8, the general trend for the number density of the outer\nelectron radiation belt at geosynchronous orbit is a density\ndrop during the main phase of the storm, which commences\njust prior to the time of minimum Dst, and then a density\nincrease during the recovery phase after minimum Dst. Also\nnote that unlike the case of high-speed-stream-driven storms\n(e.g., Figure 7), there is only a very modest decrease of the\nnumber density of the outer electron radiation belt at\nFigure 8. For 78 coronal-mass-ejection-driven storms,\nsuperpositions of the (a) number density, (b) temperature,\nand (c) pressure of the outer electron radiation belt at\ngeosynchronous orbit are plotted as functions of time, as are\nthe (d) 1.1–1.5 MeV electron flux and (e) Dst index. Each\ncurve in Figures 8a–8d is a local-time average of the\nquantity. Time t = 0 is taken to be the time of minimum Dst\nin the storm.\n12 of 20\nA01208A01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\ngeosynchronous orbit in the several days prior to storm\nonset due to the lack of an extended calm before the storm.\nThe general trend of the temperature of the outer electron\nradiation belt at geosynchronous orbit (Figure 8b) is a\ntemperature decrease during the main phase and a temper-\nature recovery during the recovery phase. The trend in the\npressure of the outer electron radiation belt follows the trend\nin the number density: a decrease in the pressure during the\nmain phase and an increase in the pressure during the\nrecovery phase. The trend of the relativistic-electron flux\nduring CME-driven storms (Figure 8d) is more like the\nsimple trend in the outer electron radiation belt temperature\nthan the complicated trend in the density: the flux exhibits a\ndecrease during the main phase of the storm followed by an\nincrease during the recovery phase. The temporal width of\nthe decrease in the flux (Figure 8d) is much greater than the\ntemporal width of the decrease in number density (Figure 8a).\nIn addition, the relativistic-electron flux after the CME-\ndriven storms is slightly elevated initially, and then falls over\nthe next \u00045 days to a flux roughly equal to the relativistic-\nelectron flux before the storms.\n[23] In the remainder of this section, four different zero\nepochs (triggers) for the data superpositions are used to\npiecewise analyze the evolution of cloud-driven storms. All\ninterpretation of the superposed data is restricted to the\ntemporal vicinity of the trigger. The zero epochs used below\nare (1) trigger on the arrival of the interplanetary shock,\n(2) trigger on the beginning of sheath, (3) trigger on the\nbeginning of southward-IMF portion of cloud, and (4) trigger\non the end of southward-IMF portion of cloud. The results of\nthis analysis are summarized in Table 2.\n[24] First, the reaction of the outer electron radiation belt at\ngeosynchronous orbit to the arrival of the interplanetary\nshock and compressed CME-sheath plasma is examined. In\nthe data superposition shown in Figure 9 the zero epoch is\ntaken to be the sudden storm commencement (SSC) at Earth,\nobtained from a collection of 37 very strong SSC events. The\nSSCs were selected for their strong compression of the\nmagnetosphere with both a strong positive-Dst signature\nand a sustained sudden increase in the solar wind ram\npressure (as determined from examination of the OMNI2\ndatabase). Figure 9 contains plots of the superpositions of the\nouter electron radiation belt number density n (Figure 9a),\ntemperature T (Figure 9b), pressure P (Figure 9c), and 1.1–\n1.5 MeV electron flux (Figure 9d) at geosynchronous orbit.\nThe ram pressure nv2 of the solar wind is also plotted\n(Figure 9e): note the sudden increase at T = 0 followed by a\nsustained (for several hours) high pressure. The superposition\nof the Dst index for these events is also shown (Figure 9f).\nNote the sharp positive Dst deflection associated with inter-\nplanetary-shock arrival (at t = 0). As can also be seen, the\narrival of the shock results in sudden strong decreases in the\nnumber density (Figure 9a) and the pressure (Figure 9c) of\nthe outer electron radiation belt. The temperature of the outer\nelectron radiation belt (Figure 9b) shows a slight decrease\ncommencing at the time of SSC. The relativistic-electron flux\nF (Figure 9d) also decreases. These changes are noted in\nTable 2. The fractional decrease in the flux close to zero\nepoch is less than the fractional decrease in density: compar-\ning the values at time t = +2 h with the values at t = \u00031hr the\nflux decreases to 58% of its initial value while the number\ndensity decreases to \u000442% of its initial value. The density\ndecrease at geosynchronous orbit at time t = 0 is probably\nowed to a rapid compression of the magnetosphere by the\nincrease in solar wind ram pressure (higher velocity and\nhigher density) behind the interplanetary shock, bringing\nmore tenuous outer magnetospheric regions to geosynchro-\nnous orbit. After the shock passage at time t = 0, the Earth’s\nmagnetosphere is within the compressed CME-sheath\nplasma ahead of the coronal mass ejection. Depending on\nthe orientation of the IMF in this sheath plasma, the sheath\nmay or may not drive geomagnetic activity in the Earth’s\nmagnetosphere. The steady decrease in the value of Dst after\nzero epoch indicates that on average there is some driving by\nthe sheath for these events.\n[25] In Figure 10 a set of 16 CME-driven storm events\nwherein the IMF of the sheath plasma is distinctly south-\nward is examined. Figure 10 contains plots of the super-\npositions of the outer electron radiation belt number density\nn (Figure 10a), temperature T (Figure 10b), pressure P\n(Figure 10c), and 1.1–1.5 MeV electron flux (Figure 10d)\nat geosynchronous orbit. The superposition of the Kp index\nfor these events is also shown (Figure 10e). Time t = 0 is\ntaken to be the onset of the southward IMF (GSM) at Earth\nin the sheath plasma. The sudden increase in Kp near t = 0\nindicates the onset of driving by the sheath plasmas; note\nthat the Kp index has a 3 h resolution so the increase in Kp\nbegins approximately 3 h prior to t = 0. The temporal\nprofiles of the number density, the temperature, the pres-\nsure, and the relativistic-electron flux are all very similar\nto the profiles in Figure 9 where t = 0 was the SSC (arrival\nof the interplanetary shock). This similarity may indicate\nthat the reaction of the outer electron radiation belt at\ngeosynchronous orbit is dominated by the compression of\nthe magnetosphere.\n[26] To study the reaction of the outer electron radiation\nbelt at geosynchronous orbit when the magnetosphere is\ndriven (strongly) by the southward IMF of a magnetic\ncloud, a subset of 13 well-defined magnetic clouds with\nsouthward-IMF (GSM) portions was extracted from the set\nof Dst storms that was used in the study by Denton et al.\n[2005]. These magnetic clouds were identified using\nSWEPAM plasma measurement [McComas et al., 1998]\nand MAG magnetic field measurements [Smith et al., 1998]\nTable 2. Overview of the Evolution of the Outer Electron Radiation Belt at Geosynchronous Orbit During a Coronal Mass Ejection–\nDriven Storm\nZero Epoch Phase of Storm Number Density (n) Temperature (T) Pressure (P) Relativistic Flux (F) Flux Responds Primarily to\nSudden storm\ncommencement\ncompression of\nmagnetosphere\ndecreases\ngreatly\ndecreases\nslightly\ndecreases\ngreatly\ndecreases\ngreatly\ndensity\nSouth interplanetary magnetic\nfield (IMF) sheath\nsheath driving decreases decreases decreases decreases density and temperature\nSouth IMF cloud cloud driving increases decreases increases holds steady density and temperature\nMinimum Dst recovery increases increases increases increases density and temperature\nA01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\n13 of 20\nA01208\nfrom onboard the ACE satellite upstream of the Earth. The\nclouds in the solar wind were identified by their having a\nwell-ordered magnetic field, low solar wind ion temper-\natures, and bidirectional electron heat flux. In Figure 11 a\nsuperposition of the measurements of the outer electron\nradiation belt at geosynchronous orbit is created by setting\nthe zero epoch of the analysis to be the onset of the\nsouthward-IMF portions of those 13 magnetic clouds.\nFigure 11 contains plots of the superposed averages of the\nouter electron radiation belt number density n (Figure 11a),\ntemperature T (Figure 11b), pressure P (Figure 11c), and\n1.1–1.5 MeV electron flux F (Figure 11d) at geosynchro-\nnous orbit. The superposition of the Kp index for these\nevents is also shown (Figure 11e). Note that immediately\nprior to the southward-IMF portions of clouds there can be\n(1) sheath plasma (which may or may not drive geomag-\nnetic activity) or (2) northward-IMF magnetic cloud (which\nwill not drive geomagnetic activity). As can be seen in\nFigure 11e, Kp was elevated prior to t = 0 in the superpo-\nsition, an indication that there was some driving prior to\nzero epoch in at least some of these events. As can be seen\nin Figures 11a and 11c, the number density and the pressure\nbegin to increase when the southward-IMF portion of the\ncloud arrives. This increase with time during the southward\nIMF of the cloud is associated with the strong geomagnetic\nactivity in the Earth’s magnetosphere, as shown in Figure 11e.\nFigure 9. For 37 well-defined SSC (storm sudden commencement) events, superpositions of the\n(a) number density, (b) temperature, and (c) pressure of the outer electron radiation belt at\ngeosynchronous orbit are plotted as functions of time, as are the (d) 1.1–1.5 MeV electron flux, (e) ram\npressure in the solar wind, and (f) Dst index. Each curve in Figures 9a–9d is a local-time average of the\nquantity. Time t = 0 is taken to be the time of SSC (arrival at Earth of an interplanetary shock).\nA01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\n14 of 20\nA01208\nAs can be seen in Figure 11b, the temperature of the outer\nelectron radiation belt at geosynchronous orbit, which was\ndecreasing with time before the arrival of the southward-\nIMF portion of the cloud, continues to decrease during the\nsouthward-IMF portion of the cloud. Note that, at time t = 0\nin Figure 11, the number density n of the outer electron\nradiation belt is quite low (\u00041 \u0002 10\u00034 cm\u00033) and the\ntemperature is also quite low (\u0004100 keV). The temporal\nevolution of the relativistic-electron flux (Figure 11d) differs\nfrom the behavior of the number density and temperature.\nSpecifically, the flux remains pretty much constant while the\ndensity increases and the temperature decreases slightly.\n[27] In Figure 12 the properties of the outer electron\nradiation belt at geosynchronous orbit are shown with the\nzero epoch of the analysis set as the minimum value of Dst\nfor CME-driven storms. Seventeen cloud-driven storms\nwith large, single-dip, negative-Dst perturbations were\nselected from the list of Dst storms first used by Denton\net al. [2006]. Triggering on the minimum value of Dst (by\ndefinition the end of the storm main phase and beginning of\nthe storm recovery phase) likely represents the end of strong\nsouthward-IMF driving of the cloud-driven storm. Figure 12\ncontains plots of the superposed averages of the outer\nelectron radiation belt number density n (Figure 12a),\ntemperature T (Figure 12b), pressure P (Figure 12c), and\n1.1–1.5 MeV electron flux F (Figure 12d) at geosynchro-\nnous orbit. The superposition of the Dst index for these\nevents is also shown (Figure 12e). In Figure 12a the number\ndensity of the outer electron radiation belt is seen to increase\nsteadily with time as Dst recovers. In Figure 12b the\ntemperature of the outer electron radiation belt at geosyn-\nchronous orbit shows a steady slow increase as Dst recovers.\nIn Figure 12c the pressure of the outer electron radiation belt\nat geosynchronous orbit shows a steady increase throughout\nthe recovery phase, tracking the evolution of the number\ndensity. The relativistic-electron flux (Figure 12d) shows the\nsame trend as the number density and temperature: a steady\nincrease with time as Dst recovers. These changes are noted\nin Table 2. The temporal profile of the relativistic-electron\nflux is more similar to that of the temperature than that of\nthe number density. The evolution of the temperature and\nnumber density of the outer electron radiation belt at\ngeosynchronous orbit around the minimum-Dst time may\nbe governed by a combination of the cessation of geomag-\nnetic activity and the inflation and deflation of the dipole\nmagnetic field owing to the ‘‘Dst effect’’ [e.g., Dessler and\nKarplus, 1961; Kim and Chan, 1997].\n5. Summary\n[28] Analysis of almost one million individual bi-\nMaxwellian fits to relativistic-electron flux data has been\nFigure 10. For 16 cloud-driven storm events with well-\ndefined intervals of southward IMF (GSM) in the CME\nsheaths, superpositions of the (a) number density,\n(b) temperature, and (c) pressure of the outer electron\nradiation belt at geosynchronous orbit are plotted as\nfunctions of time, as are the (d) 1.1–1.5 MeV electron flux\nand (e) Kp index. Each curve in Figures 10a–10d is a local-\ntime average of the quantity. Time t = 0 is taken to be the\nonset of the southward-IMF interval in the sheath plasma.\n15 of 20\nA01208A01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\nperformed. The findings of the study are summarized below.\nThese findings demonstrate the strength of a density-\ntemperature description of the outer electron radiation belt\nat geosynchronous orbit.\n5.1. General Properties of the Outer Electron\nRadiation Belt\n[29] Statistical analyses of the outer electron radiation belt\nat geosynchronous orbit are described in section 2. Salient\nfindings are as follows.\n[30] 1. At geosynchronous orbit, the median value of the\nnumber density is n = 3.7 \u0002 10\u00034 cm\u00033, the median value\nof the temperature is T = 142 keV, and the median value of\nthe 1.1–1.5 MeV electron flux F is 4.7 cm\u00032 s\u00031 ster\u00031\nkeV\u00031. The median value of the pressure P = nkBT is\n8.3 \u0002 10\u00033 nPa.\n[31] 2. The fractional variations of the number density n\nand the temperature T are less than the fractional variations\nin the relativistic-electron flux F.\n[32] 3. The density, temperature, and the relativistic-\nelectron flux all show similar local-time dependencies, with\npeaks in all three quantities near local noon and minima in\nthe quantities near local midnight. The local-time variation\nof the temperature is weaker than the local-time variations\nin n and F.\n[33] 4. There are systematic solar-cycle dependencies on\nn, T, and F. The number density n and temperature T are\nhigher during the declining phase than during the other\nphases of the solar cycle. The relativistic-electron flux F\nreflects the number-density and temperature trends.\n5.2. Evolution During High-Speed-Stream-Driven\nStorms\n[34] In section 3, superposed-epoch analysis was used to\nstudy the evolution of the outer electron radiation belt at\ngeosynchronous orbit during high-speed-stream-driven\nstorms. The findings of that investigation are as follows.\n[35] 1. Associated with high-speed-stream-driven storms,\nthere are clear 27 day periodicities in the number density n,\ntemperature T, and relativistic-electron flux F, of the outer\nelectron radiation belt at geosynchronous orbit.\n[36] 2. For several days prior to high-speed-stream-driven\nstorms, the number density n of the outer electron radiation\nbelt decreases slowly while the temperature T remains\napproximately constant. The relativistic-electron flux F\nalso decreases slowly during this period. The decrease in\nn is attributable to the build up of the outer plasmasphere,\nand associated pitch angle scattering during calms before\nstorms. The decrease in F is attributable to the decrease\nin n.\n[37] 3. Near the onset time of a high-speed-stream-driven\nstorm there is a sudden drop in the number density n of the\nouter electron radiation belt at geosynchronous orbit. The\nFigure 11. For 13 cloud-driven storm events with well-\ndefined southward-IMF (GSM) portions, superpositions of\nthe (a) number density, (b) temperature, and (c) pressure of\nthe outer electron radiation belt at geosynchronous orbit are\nplotted as functions of time, as are the (d) 1.1–1.5 MeV\nelectron flux and (e) Kp index. Time t = 0 is taken to be the\nonset of the southward-IMF portions of the clouds.\n16 of 20\nA01208A01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\nrelativistic-electron flux F also decreases suddenly, but the\nflux drop is later in time than the number-density drop. This\nsudden decrease is the well known ‘‘relativistic-electron\ndropout’’ of high-speed-stream-driven storms.\n[38] 4. Less than one day after its sudden drop, the\nnumber density n of the outer electron radiation belt shows\na sudden increase (the ‘‘recovery from dropout’’). The\nrelativistic-electron flux F also shows this recovery from\ndropout, but the flux recovery takes longer than the number-\ndensity recovery.\n[39] 5. After the recovery from dropout, the temperature\nT of the outer electron radiation belt at geosynchronous\norbit slowly increases with time during the several days of\nthe high-speed-stream-driven storm while the number den-\nsity is approximately constant. During this time interval the\nrelativistic-electron flux F steadily increases as the temper-\nature increases at constant density. This steady increase in\nthe relativistic-electron flux during the storm is attributable\nto a steady heating of the outer electron radiation belt.\n[40] 6. The number density n of the outer electron\nradiation belt at geosynchronous orbit tends to be higher\nafter HSS-driven storms than it was before such storms. The\ntemperature T of the outer electron radiation belt tends to be\nabout the same after a storm as before. The relativistic-\nelectron flux F tends to be higher after a storm than before\nthe storm.\n5.3. Evolution During CME-Driven Storms\n[41] In section 4, superposed-epoch analysis with multiple\nepoch selections was used to study the evolution of the outer\nelectron radiation belt at geosynchronous orbit during CME\nstorms. The findings of that investigation are the following.\n[42] 1. Unlike the case for high-speed-stream-driven\nstorms, there is only a very modest temporal decrease in\nthe number density n or relativistic-electron flux F of the\nouter electron radiation belt at geosynchronous orbit in the\ndays prior to the onset of CME-driven storms. This is likely\nassociated with the lack of a systematic calm before\nCME-driven storms.\n[43] 2. When the storm sudden commencement (SSC)\noccurs (arrival of interplanetary shock at Earth), the number\ndensity n and the relativistic-electron flux F of the outer\nelectron radiation belt at geosynchronous orbit both decrease\nsuddenly. The fractional decrease in the number density is\nlarger than the fractional decrease in the relativistic-electron\nflux. The temperature decrease at the time of SSC is very\nslight. The sudden density decrease is attributable to a\nsudden compression of the magnetosphere delivering\nhigher-L energetic electrons to geosynchronous orbit.\n[44] 3. During the southward-IMF (GSM) portions of\nmagnetic clouds (storm main phase), the number density n\nof the outer electron radiation belt at geosynchronous orbit\nFigure 12. For 17 magnetic-cloud-driven storms with\nstrong, single-dip Dst perturbations, superpositions of the\n(a) number density, (b) temperature, and (c) pressure of the\nouter electron radiation belt at geosynchronous orbit are\nplotted as functions of time, as are the (d) 1.1–1.5 MeV\nelectron flux and (e) Dst index. Each curve in Figures 12a–\n12d is a local-time average of the quantity. Time t = 0 is\ntaken to be the time of minimum Dst.\n17 of 20\nA01208A01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\nincreases with time while the temperature T decreases with\ntime. The relativistic-electron flux F remains approximately\nconstant during the southward-IMF portions of the magnetic\nclouds.\n[45] 4. During the recovery phase of CME-driven storms\n(the interval wherein Dst increases toward quiet time values\nafter the time of minimum Dst) the number density n of the\nouter electron radiation belt at geosynchronous orbit\nincreases and the temperature T increases. During the\nrecovery phase the relativistic-electron flux F also increases,\nmimicking the temporal profile of the temperature more\nthan the temporal profile of the number density.\n[46] 5. The number density n and relativistic-electron flux\nF of the outer electron radiation belt at geosynchronous\norbit have slightly elevated values after a CME-driven storm\nas they did before the storm: these decrease to prestorm\nvalues after a few days. The temperature has a very similar\nvalue after a CME-driven storm as prior to the storm.\n5.4. Differences Between a Density-Temperature\nDescription and a Flux Description\n[47] The relativistic-electron flux is a measure of the\nnumber of particles in the tail of the energy distribution of\nthe outer electron radiation belt. Here, specifically, the\nrelativistic-electron flux F is taken to be the flux of particles\nin the 1.1–1.5 MeV energy band, with the temperature\nbeing on the order of 150 keV. One could consider the\nrelativistic-electron flux F to be controlled by a combination\nof n and T, with the flux increasing as n increases or as T\nincreases. Through the different phases of geomagnetic\nstorms, the number density n, the temperature T, and the\nrelativistic-electron flux F of the outer electron radiation belt\nat geosynchronous orbit all show different evolutionary\ntrends. In general the fractional variations in the relativistic-\nelectron flux F are larger than the fractional variations in n\nor T, but during some phases of storms the fractional\nvariations in F can be smaller.\n[48] Sometimes the relativistic-electron flux F reacts more\nto changes in the temperature T of the outer electron\nradiation belt than to changes in the number density n.\nOne important example of this is the steady increase in the\nrelativistic-electron flux as the outer electron radiation belt\nis slowly heated during several-days-long high-speed-\nstream-driven storms.\n[49] Sometimes the relativistic-electron flux F reacts more\nto changes in the number density n of the outer electron\nradiation belt than to changes in the temperature T. One\nexample of this is the several-days-long slow decay of both\nn and F during calms before high-speed-stream-driven\nstorms. A second example of this is the strong drop of both\nn and F during SSC compressions of the magnetosphere\nbefore CME-driven storms.\n[50] Sometimes the relativistic-electron flux F reacts to\nchanges in both n and T. One example of this is the\nrelativistic-electron flux F remaining constant while the\nnumber density n increases and the temperature T decreases\nduring the southward-IMF portions of magnetic clouds. A\nsecond example is the relativistic-electron flux F increasing\nwhile n and T both increase during the recovery phase of\nCME-driven storms.\n[51] There are timing differences between the density and\ntemperature n and T and the relativistic-electron flux F. One\nexample of this is the relativistic-electron dropout, which\noccurs first in the number density n and then later in the\nrelativistic-electron flux F. Likewise, the recovery from\ndropout occurs first in the number density and then later\nin the relativistic-electron flux.\n6. Future Work\n[52] In this report we have statistically analyzed the\ndensities and temperatures of the outer electron radiation\nbelt at geosynchronous orbit and have described the storm-\ntime evolution of the outer electron radiation belt in terms of\ndensities and temperatures. We think that this density-\ntemperature description removes some of the uncertainties\nthat a flux-only description contains, since changes in the\nflux can be caused by changes in the number of electrons\nand\/or by changes in the temperature of the electrons. The\ndensity-temperature description also provides a simple\nmeans to calculate the specific entropy (density of adiabatic\ninvariants per unit flux) of the outer electron radiation belt,\nwhich can provide information about nature of changes to\nthe radiation belts. The density-temperature description\noffers a simple method to quantify electron-loss rates and\nto quantify number fluxes and energy fluxes into the\natmosphere [cf. Borovsky and Denton, 2009b]. The density-\ntemperature description also offers a simple method to\ncorrelate increases in the electron content of the outer electron\nradiation belt with the densities of potential source popula-\ntions in the magnetosphere and in the solar wind. In addition,\nthe density-temperature description provides a simple method\nto look at electron energization mechanisms and to quantify\nenergy budgets.\n[53] Acknowledgments. The authors would like to thank the Space\nPhysics Data Facility (SPDF) and National Space Science Data Center\n(NSSDC) for providing the OMNI2 database, the World Data Centre C1 at\nRutherford-Appleton Laboratory in the UK for provision of the geomag-\nnetic indices used in this study, and Bob McPherron for providing an\nupdated list of stream interfaces. We also thank the U.S. Air Force Research\nLaboratory, Hanscom Air Force Base, Massachusetts, for providing the\nMidnight Boundary Index. We thank Reiner Friedel for graciously running\nthe relativistic fits to the original SOPA data, and we thank Reiner Friedel\nand Michelle Thomsen for helpful conversations. This work was supported\nby the NASA Living With a Star TR&T Program and by the Los Alamos\nNational Laboratory LDRD Program. Parts of this work were carried out at\nLos Alamos National Laboratory during summer 2008, and M.H.D. wishes\nto thank ISR-1 and particularly J.E.B. for financial support and hospitality\nduring this visit.\n[54] Amitava Bhattacharjee thanks Viviane Pierrard for her assistance\nin evaluating this paper.\nReferences\nBaker, D. N., and S. G. Kanekal (2008), Solar cycle changes, geomagnetic\nvariations, and energetic particle properties in the inner magnetosphere,\nJ. Atmos. Sol. Terr. Phys., 70, 195–206, doi:10.1016\/j.jastp.2007.08.031.\nBelian, R. D., G. R. Gisler, T. Cayton, and R. Christensen (1992), High-Z\nenergetic particles at geostationary orbit during the great proton event of\nOctober 1989, J. Geophys. Res., 97, 16,897 –16,906, doi:10.1029\/\n92JA01139.\nBirn, J., M. F. Thomsen, J. E. Borovsky, G. D. Reeves, D. J. McComas, R. D.\nBelian, and M. Hesse (1998), Substorm electron injections: Geosynchro-\nnous observations and test particle simulations, J. Geophys. Res., 103,\n9235–9248, doi:10.1029\/97JA02635.\nBorovsky, J. E., and M. H. Denton (2006a), Differences between CME-\ndriven storms and CIR-driven storms, J. Geophys. Res., 111, A07S08,\ndoi:10.1029\/2005JA011447.\nBorovsky, J. E., and M. H. Denton (2006b), Effect of plasmaspheric drai-\nnage plumes on solar-wind\/magnetosphere coupling, Geophys. Res. Lett.,\n33, L20101, doi:10.1029\/2006GL026519.\nA01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\n18 of 20\nA01208\nBorovsky, J. E., and M. H. Denton (2008), A statistical look at plasma-\nspheric drainage plumes, J. Geophys. Res., 113, A09221, doi:10.1029\/\n2007JA012994.\nBorovsky, J. E., and M. H. Denton (2009a), Relativistic-electron dropouts\nand recovery: A superposed epoch study of the magnetosphere and the\nsolar wind, J. Geophys. Res., 114, A02201, doi:10.1029\/2008JA013128.\nBorovsky, J. E., and M. H. Denton (2009b), Electron loss rates from the\nouter radiation belt caused by filling of the outer plasmasphere: The calm\nbefore the storm, J. Geophys. Res., 114, A11203, doi:10.1029\/2009JA014063.\nBorovsky, J. E., and J. T. Steinberg (2006), The ‘‘calm before the storm’’ in\nCIR\/magnetosphere interactions: Occurrence statistics, solar wind statis-\ntics, and magnetospheric preconditioning, J. Geophys. Res., 111, A07S10,\ndoi:10.1029\/2005JA011397.\nBorovsky, J. E., M. F. Thomsen, and D. J. McComas (1997), The super-\ndense plasma sheet: Plasmaspheric origin, solar wind origin, or iono-\nspheric origin?, J. Geophys. Res., 102, 22,089–22,097.\nBorovsky, J. E., M. F. Thomsen, D. J. McComas, T. E. Cayton, and D. J.\nKnipp (1998), Magnetospheric dynamics and mass flow during the\nNovember 1993 storm, J. Geophys. Res., 103, 26,373 – 26,394,\ndoi:10.1029\/97JA03051.\nCallis, L. B., D. N. Baker, J. B. Blake, J. D. Lambeth, R. E. Boughner,\nM. Natarajan, R. W. Klebesadel, and D. J. Gorney (1991), Precipitating\nrelativistic electrons: Their long-term effect on stratospheric odd nitro-\ngen levels, J. Geophys. Res., 96, 2939–2976, doi:10.1029\/90JD02184.\nCayton, T. E., and R. D. Belian (2007), Numerical modeling of the syn-\nchronous orbit particle analyser (SOPA, Version 2) that flew on S\/C\n1990–095, LA Rep. LA-14335, Los Alamos Natl. Lab., Los Alamos,\nN. M.\nCayton, T. E., R. D. Belian, S. P. Gary, T. A. Fritz, and D. N. Baker (1989),\nEnergetic electron components at geosynchronous orbit, Geophys. Res.\nLett., 16(2), 147–150, doi:10.1029\/GL016i002p00147.\nChen, Y., R. W. Friedel, G. D. Reeves, T. G. Onsager, and M. F. Thomsen\n(2005), Multisatellite determination of the relativistic electron phase\nspace density at geosynchronous orbit: Methodology and results during\ngeomagnetically quiet times, J. Geophys. Res., 110, A10210,\ndoi:10.1029\/2004JA010895.\nClilverd, M. A., T. D. G. Clark, A. J. Smith, and N. R. Thomson (1993),\nObservation of a decrease in mid-latitude whistler mode signal occur-\nrence prior to geomagnetic storms, J. Atmos. Terr. Phys., 55, 1479–1485,\ndoi:10.1016\/0021-9169(93)90113-D.\nDenton, M. H., and J. E. Borovsky (2008), Superposed epoch analysis of\nhigh-speed-stream effects at geosynchronous orbit: Hot plasma, cold\nplasma, and the solar wind, J. Geophys. Res., 113, A07216,\ndoi:10.1029\/2007JA012998.\nDenton, M. H., and J. E. Borovsky (2009), The superdense plasma sheet in\nthe magnetosphere during high-speed-stream-driven storms: Plasma\ntransport and timescales, J. Atmos. Sol. Terr. Phys., 71, 1045–1058,\ndoi:10.1016\/j.jastp.2008.04.023.\nDenton, M. H., M. F. Thomsen, H. Korth, S. Lynch, J. C. Zhang, and M. W.\nLiemohn (2005), Bulk plasma properties at geosynchronous orbit,\nJ. Geophys. Res., 110, A07223, doi:10.1029\/2004JA010861.\nDenton, M. H., J. E. Borovsky, R. M. Skoug, M. F. Thomsen, B. Lavraud,\nM. G. Henderson, R. L. McPherron, J. C. Zhang, and M. W. Liemohn\n(2006), Geomagnetic storms driven by ICME- and CIR-dominated solar\nwind, J. Geophys. Res., 111, A07S07, doi:10.1029\/2005JA011436.\nDenton, M. H., J. E. Borovsky, R. B. Horne, R. L. McPherron, S. K.\nMorley, and B. T. Tsurutani (2009a), Introduction to special issue on\nhigh speed solar wind streams and geospace interactions, J. Atmos. Sol.\nTerr. Phys., 71, 1011–1013, doi.10.1016\/j.jastp.2008.09.019.\nDenton, M. H., T. Ulich, and E. Turunen (2009b), Modification of mid-\nlatitude ionospheric parameters in the F2 layer by persistent high-speed\nsolar wind streams, Space Weather, 7, S04006, doi:10.1029\/\n2008SW000443.\nDessler, A. J., and R. Karplus (1961), Some effects of diamagnetic ring\ncurrents on Van Allen radiation, J. Geophys. Res., 66, 2289–2295,\ndoi:10.1029\/JZ066i008p02289.\nElphic, R. C., M. F. Thomsen, J. E. Borovsky, and D. J. McComas (1999),\nInner edge of the electron plasma sheet: Empirical models of boundary\nlocation, J. Geophys. Res., 104, 22,679 – 22,693, doi:10.1029\/\n1999JA900213.\nFreeman, J. W. (1964), The morphology of the electron distribution in the\nouter radiation zone and near the magnetospheric boundary as observed\nby Explorer 12, J. Geophys. Res., 69, 1691 – 1723, doi:10.1029\/\nJZ069i009p01691.\nFriedel, R. H. W., G. D. Reeves, and T. Obara (2002), Relativistic electron\ndynamics in the inner magnetosphere: A review, J. Atmos. Sol. Terr.\nPhys., 64, 265–282, doi:10.1016\/S1364-6826(01)00088-8.\nGeorgieva, K., B. Kirov, and E. Gavruseva (2006), Geoeffectiveness of\ndifferent solar drivers, and long-term variations of the correlation between\nsunspot and geomagnetic activity, Phys. Chem. Earth, 31, 81–87.\nGreen, J. C., and M. G. Kivelson (2004), Relativistic electrons in the outer\nradiation belt: Differentiating between acceleration mechanisms, J. Geo-\nphys. Res., 109, A03213, doi:10.1029\/2003JA010153.\nGreen, J. C., T. G. Onsager, T. P. O’Brien, and D. N. Baker (2004), Testing\nloss mechanisms capable of rapidly depleting relativistic electron flux in\nthe Earth’s outer radiation belt, J. Geophys. Res., 109, A12211,\ndoi:10.1029\/2004JA010579.\nHudson, M. K., B. T. Kress, H.-R. Mueller, J. A. Zastrow, and J. B. Blake\n(2008), Relationship of the Van Allen radiation belts to solar wind dri-\nvers, J. Atmos. Sol. Terr. Phys. , 70 , 708 – 729, doi:10.1016\/\nj.jastp.2007.11.003.\nJian, L., C. T. Russell, J. G. Luhmann, and R. M. Skoug (2006), Properties\nof interplanetary coronal mass ejections at one AU during 1995–2004,\nSol. Phys., 239, 393–436, doi:10.1007\/s11207-006-0133-2.\nKavanagh, A., and M. H. Denton (2007), High-speed solar wind streams\nand geospace interactions, Astron. Geophys., 48, 6.24–6.26.\nKim, H.-J., and A. A. Chan (1997), Fully adiabatic changes in storm time\nrelativistic electron fluxes, J. Geophys. Res., 102, 22,107 –22,116,\ndoi:10.1029\/97JA01814.\nKing, J. H., and N. E. Papitashvili (2005), Solar wind spatial scales in and\ncomparisons of hourly Wind and ACE plasma and magnetic field data,\nJ. Geophys. Res., 110, A02104, doi:10.1029\/2004JA010649.\nLavraud, B., M. F. Thomsen, J. E. Borovsky, M. H. Denton, and T. I.\nPulkkinen (2006), Magnetosphere preconditioning under northward\nIMF: Evidence from the study of coronal mass ejection and corotating\ninteraction region geoeffectiveness, J. Geophys. Res., 111, A09208,\ndoi:10.1029\/2005JA011566.\nLi, X., D. N. Baker, M. Temerin, G. Reeves, R. Friedel, and\nC. Shen (2005), Energetic electrons, 50 keV to 6 MeV, at geosynchronous\norbit: Their responses to solar wind variations, Space Weather, 3, S04001,\ndoi:10.1029\/2004SW000105.\nLiemohn, M. W., and A. A. Chan (2007), Unravelling the causes of radia-\ntion belt enhancements, Eos Trans. AGU, 88(42), doi:10.1029\/\n2007EO420001.\nLindsay, G. M., C. T. Russell, and J. G. Luhmann (1995), Coronal mass\nejections and stream interaction region characteristics and their potential\ngeomagnetic consequences, J. Geophys. Res., 100, 16,999–17,013,\ndoi:10.1029\/95JA00525.\nLongden, N., M. H. Denton, and F. Honary (2008), Particle precipitation\nduring ICME-driven and CIR-driven geomagnetic storms, J. Geophys.\nRes., 113, A06205, doi:10.1029\/2007JA012752.\nMadden, D., and M. S. Gussenhoven (1990), Auroral Boundary Index from\n1983 to 1990, Tech. Rep. GL-TR-90-0358, Air Force Geophys. Lab.,\nHanscom AFB, Mass., 21 Dec.\nMann, I. R., T. P. O’Brien, and D. K. Milling (2004), Correlations between\nULF wave power, solar wind speed, and relativistic electron flux in the\nmagnetosphere: Solar cycle dependence, J. Atmos. Sol. Terr. Phys., 66,\n187–198, doi:10.1016\/j.jastp.2003.10.002.\nMcComas, D. J., et al. (1998), An unusual coronal mass ejection: First\nSolar Wind Electron, Proton, Alpha Monitor (SWEPAM) results from\nthe Advanced Composition Explorer, Geophys. Res. Lett., 25(23),\n4289–4292, doi:10.1029\/1998GL900174.\nMcPherron, R. L., and J. Weygand (2006), The solar wind and geomagnetic\nactivity as a function of time relative to corotating interaction regions, in\nRecurrent Magnetic Storms: Corotating Solar Wind Streams, Geophys.\nMonogr. Ser., vol. 167, edited by B. T. Tsurutani et al., pp. 125–137,\nAGU, Washington, D. C.\nMcPherron, R. L., D. N. Baker, and N. U. Crooker (2009), Role of the\nRussell-McPherron effect in the acceleration of relativistic electrons,\nJ. Atmos. Sol. Terr. Phys., 71, 1032–1044, doi:10.1016\/j.jastp.2008.11.002.\nMeredith, N. P., R. B. Horne, R. M. Thorne, D. Summers, and R. A.\nAnderson (2004), Substorm dependence of plasmaspheric hiss, J. Geo-\nphys. Res., 109, A06209, doi:10.1029\/2004JA010387.\nMillan, R. M., and R. M. Thorne (2007), Review of radiation belt relati-\nvistic electron losses, J. Atmos. Sol. Terr. Phys., 69, 362 – 377,\ndoi:10.1016\/j.jastp.2006.06.019.\nNagai, T. (1982), Local time dependence of electron flux changes during\nsubstorms derived from multi-satellite observations at geosynchronous\norbit, J. Geophys. Res., 87, 3456–3468, doi:10.1029\/JA087iA05p03456.\nO’Brien, T. P., R. L. McPherron, D. Sornette, G. D. Reeves, R. Friedel, and\nH. J. Singer (2001), Which magnetic storms produce relativistic electrons\nat geosynchronous orbit, J. Geophys. Res., 106, 15,533 – 15,544,\ndoi:10.1029\/2001JA000052.\nOnsager, T. G., G. Rostoker, H.-J. Kim, G. D. Reeves, T. Obara, H. J.\nSinger, and C. Smithtro (2002), Radiation belt electron flux dropouts:\nLocal time, radial, and particle-energy dependence, J. Geophys. Res.,\n107(A11), 1382, doi:10.1029\/2001JA000187.\nOnsager, T. G., A. A. Chan, Y. Fei, S. R. Elkington, J. C. Green, and H. J.\nSinger (2004), The radial gradient of relativistic electrons at geosynchro-\nnous orbit, J. Geophys. Res., 109, A05221, doi:10.1029\/2003JA010368.\nA01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\n19 of 20\nA01208\nOnsager, T. G., J. C. Green, G. D. Reeves, and H. J. Singer (2007), Solar\nwind and magnetospheric conditions leading to the abrupt loss of outer\nradiation belt electrons, J. Geophys. Res., 112, A01202, doi:10.1029\/\n2006JA011708.\nPaulikas, G. A., and J. B. Blake (1979), Effects of the solar wind on\nmagnetospheric dynamics: Energetic electrons at the synchronous orbit,\nin Quantitative Modeling of Magnetospheric Processes, Geophys.\nMonogr. Ser., vol. 21, edited by W. P. Olsen, p. 180, AGU, Washington,\nD. C.\nPesnell, W. D., R. A. Goldberg, C. H. Jackman, D. L. Chenette, and E. E.\nGaines (2000), Variation of mesospheric ozone during the highly relati-\nvistic electron event in May 1992 as measured by the High Resolution\nDoppler Imager instrument on UARS, J. Geophys. Res., 105, 22,943–\n22,953, doi:10.1029\/2000JA000091.\nPierrard, V., and J. Lemaire (1996), Fitting the AE-8 energy spectra with\ntwo Maxwellian functions, Radiat. Meas., 26, 333–337, doi:10.1016\/\n1350-4487(96)00057-1.\nReeves, G. D., K. L. McAdams, R. H. W. Friedel, and T. P. O’Brien (2003),\nAcceleration and loss of relativistic electrons during geomagnetic storms,\nGeophys. Res. Lett., 30(10), 1529, doi:10.1029\/2002GL016513.\nRodger, C. J., T. Raita, M. A. Clilverd, A. Seppa¨la¨, S. Dietrich,\nN. R. Thomsen, and T. Ulich (2008), Observations of relativistic electron\nprecipitation from the radiation belts driven by EMIC waves, Geophys.\nRes. Lett., 35, L16106, doi:10.1029\/2008GL034804.\nRoederer, J. G. (1967), On the adiabatic motion of energetic particles in a\nmodel magnetosphere, J. Geophys. Res., 72, 981–992, doi:10.1029\/\nJZ072i003p00981.\nRoldugin, V. C., M. I. Beloglazov, and G. F. Rements (2000), Total ozone\ndecrease in the Arctic after REP events, Ann. Geophys., 18, 332–336,\ndoi:10.1007\/s00585-000-0332-3.\nRufenach, C. L., R. F. Martin, and H. H. Sauer (1989), A study of geosyn-\nchronous magnetopause crossings, J. Geophys. Res., 94, 15,125–15,134,\ndoi:10.1029\/JA094iA11p15125.\nRussell, C. T., and R. L. McPherron (1973), Semiannual variation of geo-\nmagnetic activity, J. Geophys. Res., 78, 92 – 108, doi:10.1029\/\nJA078i001p00092.\nSandanger, M. I. J., F. Søraas, M. Sørbø, K. Aarsnes, K. Oksavik, and\nD. S. Evans (2009), Relativistic electron losses related to EMIC waves\nduring CIR and CME storms, J. Atmos. Sol. Terr. Phys., 71, 1126–1144,\ndoi:10.1016\/j.jastp.2008.07.006.\nSeppa¨la¨, A., M. A. Cliverd, and C. J. Rodger (2007), NOx enhancements in\nthe middle atmosphere during 2003–2004 polar winter: Relative signifi-\ncance of solar proton events and the aurora as a source, J. Geophys. Res.,\n112, D23303, doi:10.1029\/2006JD008326.\nSinnhuber, B. M., P. von der Gathen, M. Sinnhuber, M. Rex,\nG. Konig-Langlo, and S. J. Oltmans (2006), Large decadal scale changes\nof polar ozone suggest solar influence, Atmos. Chem. Phys., 6, 1835–\n1841.\nSmith, C. W., M. H. Acun˜a, L. F. Burlaga, J. L’Heureux, N. F. Ness, and\nJ. Scheifele (1998), The ACE Magnetic Fields Experiment, Space Sci.\nRev., 86, 613–632.\nSojka, J. J., R. L. McPherron, A. P. van Eyken, M. Nicolls, C. Heinselman,\nand J. Kelly (2009), Observations of ionospheric heating during the\npassage of solar coronal hole fast streams, Geophys. Res. Lett., 36,\nL19105, doi:10.1029\/2009GL039064.\nSummers, D., N. Binbin, and N. P. Meredith (2007a), Timescales for radia-\ntion belt electron acceleration and loss due to resonant wave-particle\ninteractions: 1. Theory, J. Geophys. Res., 112, A04206, doi:10.1029\/\n2006JA011801.\nSummers, D., N. Binbin, and N. P. Meredith (2007b), Timescales for radia-\ntion belt electron acceleration and loss due to resonant wave-particle\ninteractions: 2. Evaluation for VLF chorus, ELF hiss, and electromag-\nnetic ion cyclotron waves, J. Geophys. Res., 112, A04207, doi:10.1029\/\n2006JA011993.\nThomsen, M. F. (2004), Why Kp is such a good measure of magnetospheric\nconvection, Space Weather, 2, S11004, doi:10.1029\/2004SW000089.\nTsurutani, B. T., et al. (2006), Corotating solar wind streams and recurrent\ngeomagnetic activity: A review, J. Geophys. Res., 111, A07S01,\ndoi:10.1029\/2005JA011273.\nTurner, N. E., E. J. Mitchell, D. J. Knipp, and B. A. Emery (2006), En-\nergetics of magnetic storms driven by corotating interaction regions: A\nstudy of geoeffectiveness, in Recurrent Magnetic Storms: Corotating\nSolar Wind Streams, Geophys. Monogr. Ser., vol. 167, edited by B. T.\nTsurutani et al., pp. 113–124, AGU, Washington, D. C.\nWilken, B., Q.-G. Zong, G. D. Reeves, T. Doke, and T. Yamamoto (1999),\nGeoactivity in response to CIR\/CME events: A synoptic view, Phys.\nChem. Earth, 24, 113–117.\nWrenn, G. L. (2009), Chronology of ‘killer’ electrons: Solar cycles 22 and\n23, J. Atmos. Sol. Terr. Phys., 71, 1210–1218.\nZaharia, S., M. F. Thomsen, J. Birn, and M. H. Denton (2005), Effect of\nstorm-time plasma pressure on the magnetic field in the inner magneto-\nsphere, Geophys. Res. Lett., 32, L03102, doi:10.1029\/2004GL021491.\nZhang, J., M. W. Liemohn, M. F. Thomsen, J. U. Kozyra, M. H. Denton,\nand J. E. Borovsky (2006), A statistical comparison of hot-ion properties\nat geosynchronous orbit during intense and moderate geomagnetic storms\nat solar maximum and minimum, J. Geophys. Res., 111, A07206,\ndoi:10.1029\/2005JA011559.\n\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\u0003\nJ. E. Borovsky and T. E. Cayton, Space Science and Applications, Los\nAlamos National Laboratory, Los Alamos, NM 87545, USA.\nM. H. Denton, Department of Communication Systems, Lancaster\nUniversity, InfoLab 21, Lancaster LA1 4WA, UK. (m.denton@lancaster.\nac.uk)\nA01208 DENTON ET AL.: DENSITY-TEMPERATURE RADIATION BELT\n20 of 20\nA01208\n"}