{"doi":"10.1017\/S1049096511000722","coreId":"220153","oai":"oai:eprints.lse.ac.uk:37444","identifiers":["oai:eprints.lse.ac.uk:37444","10.1017\/S1049096511000722"],"title":"When great minds don't think alike: using mock trials in teaching political thought","authors":["Ahmadov, Anar"],"enrichments":{"references":[{"id":17279010,"title":"Brief History of Moot Court:","authors":[],"date":"2000","doi":null,"raw":"Rachid, Mohammad, and Charles Knerr. 2000. “Brief History of Moot Court: Britain and U.S.” Paper presented at the Southwestern Political Science Association Annual Meeting, Galveston, TX, March 16–20.","cites":null},{"id":17279004,"title":"Bringing the Court into the Undergraduate Classroom: Appellate Simulation in","authors":[],"date":"2001","doi":"10.1111\/j.1744-1722.2001.tb00259.x","raw":"Knerr, Charles R., and Andrew B. Sommerman. 2001. “Bringing the Court into the Undergraduate Classroom: Appellate Simulation in American College.” Laws and Courts 11: 4–8.","cites":null},{"id":17279016,"title":"Comparing Judicial Institutions: Using an Inquisitorial Trial Simulation to Facilitate Student Understanding","authors":[],"date":"2009","doi":"10.1017\/s1049096509990187","raw":"Weiden, David L. 2009. “Comparing Judicial Institutions: Using an Inquisitorial Trial Simulation to Facilitate Student Understanding of International Legal Traditions.” PS: Political Science and Politics 42: 759–63. The Teacher: When Great Minds Don’t Think Alike ............................................................................................................................................................................................................................................................. 628 PS • July 2011Reproducedwithpermissionofthecopyrightowner.Furtherreproductionprohibitedwithoutpermission.","cites":null},{"id":17279011,"title":"Designing a Moot Court:What to Do,What Not to Do, and Suggestions for How to Do It.”","authors":[],"date":"2004","doi":null,"raw":"Ringel, Lewis S. 2004. “Designing a Moot Court:What to Do,What Not to Do, and Suggestions for How to Do It.” PS: Political Science and Politics 37: 459–65.","cites":null},{"id":17279007,"title":"Experiential Learning: Experience as the Source of Learning and Development. Englewood Cliﬀs,","authors":[],"date":"1984","doi":null,"raw":"_. 1984. Experiential Learning: Experience as the Source of Learning and Development. Englewood Cliﬀs, NJ: Prentice-Hall.","cites":null},{"id":17279002,"title":"In Defense of Moot Court: A Response to","authors":[],"date":"1988","doi":null,"raw":"Hernandez, MichaelV. 1988. “In Defense of Moot Court: A Response to ‘In Praise of Moot Court—Not!’” Review of Litigation 17: 69–89.","cites":null},{"id":17278998,"title":"Learning by Trial and Error: A Case for Moot Courts.”","authors":[],"date":"2000","doi":"10.1080\/00220480009596771","raw":"Carlson, J. Lon, and Neil T. Skaggs. 2000. “Learning by Trial and Error: A Case for Moot Courts.” Journal of Economic Education 31 (2): 145–55.","cites":null},{"id":17279006,"title":"Management and the Learning Process.”","authors":[],"date":"1976","doi":"10.2307\/41164649","raw":"Kolb, David. 1976. “Management and the Learning Process.” California Management Review 18 (3): 22–31.","cites":null},{"id":17279008,"title":"May It PleaseWhose Court? How Moot Court Perpetuates Gender Bias in the","authors":[],"date":"1995","doi":null,"raw":"Morrison, Mairi N. 1995. “May It PleaseWhose Court? How Moot Court Perpetuates Gender Bias in the ‘RealWorld’ of Practice.” UCLAWomen’s Law Journal 49: 49–84.","cites":null},{"id":17279000,"title":"Moot Court: Thinking onYour Feet.” Paper presented at the Annual Meeting of the American Political Science Association,Washington,","authors":[],"date":"2000","doi":null,"raw":"Curran, Jeanne, Susan Takata, and Patricia Acone. 2000. “Moot Court: Thinking onYour Feet.” Paper presented at the Annual Meeting of the American Political Science Association,Washington, DC, August 31–September 3.","cites":null},{"id":17278997,"title":"Mooting in an Undergraduate Tax Program.”","authors":[],"date":"1996","doi":null,"raw":"Bentley, Duncan. 1996. “Mooting in an Undergraduate Tax Program.” Legal Education Review 7: 97–124.","cites":null},{"id":17279001,"title":"Playing Justice: The Role of Simulation","authors":[],"date":"2000","doi":null,"raw":"Deardorﬀ, Michelle Donaldson, and Jilda Aliotta. 2000. “Playing Justice: The Role of Simulation in Teaching and Assessing the Teaching of Public Law.” Paper presented at the Annual Meeting of the American Political Science Association,Washington, DC, August 31–September 3.","cites":null},{"id":17279003,"title":"The BosnianWar Crimes Trial Simulation:","authors":[],"date":"1999","doi":null,"raw":"Jeﬀerson, KurtW. 1999. “The BosnianWar Crimes Trial Simulation: Teaching Students about the Fuzziness ofWorld Politics and International Law.” PS: Political Science and Politics 32: 589–92.","cites":null},{"id":17278996,"title":"Trying Saddam Hussein: Teaching International Law through an","authors":[],"date":"2006","doi":"10.1111\/j.1528-3585.2006.00237.x","raw":"Ambrosio, Thomas. 2006. “Trying Saddam Hussein: Teaching International Law through an Undergraduate MockTrial.” International Studies Perspectives 7( 2 ) : 159–71.","cites":null},{"id":17279005,"title":"Undergraduate Moot Court","authors":[],"date":"2004","doi":"10.2307\/20070727","raw":"_. 2004. “Undergraduate Moot Court in American Colleges and Universities.” Paper presented at the PAD Annual Pre-Law Conference,Washington, DC, November 4–6.","cites":null},{"id":17278999,"title":"Undergraduate Moot Court: A Simulation for Undergraduate Courses in","authors":[],"date":"1979","doi":null,"raw":"Cooper, Phillip J. 1979. “Undergraduate Moot Court: A Simulation for Undergraduate Courses in Public Law.” Teaching Political Science 7: 105–18.","cites":null},{"id":17279013,"title":"Using a Mock Trial to Make a Diﬃcult Clinical Decision.”","authors":[],"date":"1992","doi":"10.1136\/bmj.305.6864.1284","raw":"Smith, Richard. 1992. “Using a Mock Trial to Make a Diﬃcult Clinical Decision.” British Medical Journal 305 (6,864): 1,284–87.","cites":null},{"id":17279015,"title":"Using Kolb’s Learning Cycle to","authors":[],"date":"1987","doi":null,"raw":"Stice, James E. 1987. “Using Kolb’s Learning Cycle to Improve Student Learning.” Engineering Education 77 (5): 291–96.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2011","abstract":"This article examines a mock trial I have developed and used in teaching the history of political thought. Mock trials have been underused but have great potential to become an effective and exciting tool for student learning in this area. In this mock trial, the plaintiff, defendant, attorneys, and witnesses are eminent political or economic thinkers or political leaders of the past. Active engagement in this mock trial helped my students immensely in gaining deeper insight into and a more nuanced understanding of the ideas of the thinker they represented, as well as enhancing their critical and analytical abilities and improving their research skills. As a teaching tool that is amenable to creative adaptation, a mock trial can be an engaging and effective exercise for delving into the history of political thought and making it more relevant","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/220153.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/37444\/1\/__libfile_REPOSITORY_Content_Ahmadov%2C%20A_When%20great%20minds%20don%27t%20think%20alike_When%20great%20minds%20don%27t%20think%20alike%20%28LSE%20RO%29.pdf","pdfHashValue":"8720a1ac1b9cccf001d12dd3ed1b19faa2255885","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:37444<\/identifier><datestamp>\n      2017-10-24T14:47:11Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4756<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/37444\/<\/dc:relation><dc:title>\n        When great minds don't think alike: using mock trials in teaching political thought<\/dc:title><dc:creator>\n        Ahmadov, Anar<\/dc:creator><dc:subject>\n        JA Political science (General)<\/dc:subject><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:description>\n        This article examines a mock trial I have developed and used in teaching the history of political thought. Mock trials have been underused but have great potential to become an effective and exciting tool for student learning in this area. In this mock trial, the plaintiff, defendant, attorneys, and witnesses are eminent political or economic thinkers or political leaders of the past. Active engagement in this mock trial helped my students immensely in gaining deeper insight into and a more nuanced understanding of the ideas of the thinker they represented, as well as enhancing their critical and analytical abilities and improving their research skills. As a teaching tool that is amenable to creative adaptation, a mock trial can be an engaging and effective exercise for delving into the history of political thought and making it more relevant.<\/dc:description><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:date>\n        2011<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/37444\/1\/__libfile_REPOSITORY_Content_Ahmadov%2C%20A_When%20great%20minds%20don%27t%20think%20alike_When%20great%20minds%20don%27t%20think%20alike%20%28LSE%20RO%29.pdf<\/dc:identifier><dc:identifier>\n          Ahmadov, Anar  (2011) When great minds don't think alike: using mock trials in teaching political thought.  PS - Political Science and Politics, 44 (03).  pp. 625-628.  ISSN 1049-0965     <\/dc:identifier><dc:relation>\n        http:\/\/journals.cambridge.org\/action\/displayJournal?jid=PSC<\/dc:relation><dc:relation>\n        10.1017\/S1049096511000722<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/37444\/","http:\/\/journals.cambridge.org\/action\/displayJournal?jid=PSC","10.1017\/S1049096511000722"],"year":2011,"topics":["JA Political science (General)","LB Theory and practice of education"],"subject":["Article","PeerReviewed"],"fullText":"  \nAnar Ahmadov \nWhen great minds don't think alike: using \nmock trials in teaching political thought \n \nArticle (Published version) \n(Refereed) \n Original citation: \nAhmadov, Anar (2011) When great minds don't think alike: using mock trials in teaching political \nthought. PS: political science & politics, 44 (03). pp. 625-628. ISSN 1049-0965  \n \nDOI: 10.1017\/S1049096511000722  \n \n© 2011 Cambridge University Press \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/37444\/ \nAvailable in LSE Research Online: September 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \nWhen Great Minds Don’t Think Alike:\nUsing Mock Trials in Teaching\nPolitical Thought\nAnarAhmadov, London School of Economics and Political Science\nABSTRACT This article examines a mock trial I have developed and used in teaching the\nhistory of political thought. Mock trials have been underused but have great potential to\nbecome an effective and exciting tool for student learning in this area. In this mock trial,\nthe plaintiff, defendant, attorneys, and witnesses are eminent political or economic think-\ners or political leaders of the past. Active engagement in this mock trial helped my stu-\ndents immensely in gaining deeper insight into and amore nuanced understanding of the\nideas of the thinker they represented, as well as enhancing their critical and analytical\nabilities and improving their research skills. As a teaching tool that is amenable to creative\nadaptation, a mock trial can be an engaging and effective exercise for delving into the\nhistory of political thought and making it more relevant.\nSince the beginning of the industrial age, social sci-ence classrooms have mostly followed a teaching for-mat in which the professor lectures and studentsabsorb; in other words, the classroom “stages” havebeen dominated by “sages.” In the last two decades,\nhowever, active learning methods have become popular supple-\nments or alternatives to the lecture format inmany law and social\nscience classrooms in Europe, Australia, and particularly North\nAmerica (Knerr and Sommerman 2001; Knerr and Sommerman\n2004; Ringel 2004; Ambrosio 2006). Problem-based learning, sim-\nulations, and role-playing in particular have come to be regarded\nas some of the most effective ways to both expose students to the\ncomplexities of real-world situations and decision-making and\ninduce them to hone skills and gain a deeper understanding of\ntheir subjectmatter through “learning by doing” (Smith andBoyer\n1996; Curran,Takata, andAcone 2000; Gillespie andGordon 2006;\nAmbrosio 2006).\nMoot courts and mock trials are among such active learning\ntools. With roots in premedieval England (Rachid and Knerr\n2000), these techniques have been successfully used in teaching\npublic law (Cooper 1979; Deardorff and Aliotta 2000), inter-\nnational law (Collins and Rogoff 1991; Ambrosio 2006; Weiden\n2009), world politics (Jefferson 1999), economics (Carlson and\nSkaggs 2000), taxation (Bentley 1996), and other disciplines (Knerr\nand Sommerman 2004). Mock trials have also been used for such\npractical purposes as predicting jury behavior (Bray and Kerr\n1979; Kassin 1984) and making decisions in difficult clinical cases\n(Smith 1992).\nIn this article, I examine a mock trial that I have developed\nand used in teaching the history of political thought. I believe\nthat mock trials have been underused but have great potential to\nbecome an effective and exciting tool for student learning in this\narea. In this mock trial, both the plaintiff and the defendant are\neminent political or economic thinkers. The plaintiff files a civil\nsuit against the defendant for inflicting undue harm to the soci-\nety or a particular social group by spreading ideas that he or she\nfinds ill-justified theoretically and\/or empirically. Both sides\npresent their cases to the judge and the jury and are represented\nby attorneys, who are also renowned thinkers whose ideas are\nclose to those of the plaintiff and the defendant, respectively.\nHistorical figures can be drawn as “witnesses.” After opening\naddresses, direct and cross-examinations, witness testimonies,\nand rebuttals, the jury reaches a general verdict.\nThis article pursues three goals. First, it contributes to the\nefforts to develop and spread the use of simulations and role-\nplays in political science classrooms. Second, it makes a case for\nusing the mock trial format for teaching the history of political\nthought. Finally, it provides practical advice for instructors who\nare interested in using a mock trial model in classes involving\npolitical philosophy.1\nThe following section briefly discusses the thriving literature\non experiential learning.More specifically, I discuss the rationale,\ndesign, benefits, and costs of moot courts and mock trials in the\nclassroom. I then describe in detail the mock trial model I have\nused in teaching political thought. Finally, I conclude with a brief\nsummary.\nAnar Ahmadov is a doctoral candidate in the department of government at the London\nSchool of Economics and Political Science. He previously served as a lecturer in politi-\ncal science at Khazar University in Baku, Azerbaijan. He can be reached at\na.ahmadov@lse.ac.uk.\nThe Teache r\n.............................................................................................................................................................................................................................................................\ndoi:10.1017\/S1049096511000722 PS • July 2011 625\nMOOT COURTS ANDMOCKTRIALS AS EXPERIENTIAL\nLEARNING\nThe increasing popularity of problem-based learning, simula-\ntions, and role-playing as effective complements or even substi-\ntutes to traditional lectures in political science classrooms draws\non several decades of research on the advantages of active and\nespecially experiential learning.Kolb (1976; 1984) argues that learn-\ning is maximized when four processes occur in a cycle: concrete\nexperience, reflective observation, abstract conceptualization, and\nactive experimentation. Drawing onKolb’s work, Stice (1987, 293)\nfinds that on average, students retain 10% of what they read, 20%\nof what they hear, 30% of what they see, 50% of what they both\nhear and see, 70% of what they say, and 90% of what they saywhile\ndoing something. Another study involving two experiments in\nhistory and political science classes has shown that “the students\nwho participated in the role-plays and collaborative exercises did\nbetter on subsequent standard evaluations than their tradition-\nally instructed peers” (McCarthy and Anderson 2000, 279).\nFor the study of political science, the key strengths of simula-\ntions and role-plays stem from their ability to “immerse” stu-\ndents into actively reconstructing and indirectly experiencing\ncomplex political phenomena, leading to a deeper understanding\nof political processes and institutions, as well as refined analytical\nabilities and enhanced communication and public speaking skills\n(Smith and Boyer 1996; Brock and Cameron 1999).\nMoot courts and mock trial exercises have become essential\nparts of many law school curricula and are also used, although\nless frequently, in political science education in Europe, Australia,\nandNorthAmerica (Collins andRogoff 1991; Jefferson 1999; Knerr\nand Sommerman 2001; Ringel 2004; Ambrosio 2006; Gillespie and\nGordon 2006).Many institutions of higher learning in these parts\nof the world are involved in national or international intercolle-\ngiate tournaments as well. Despite similarities in approach and\nlearning outcomes, moot courts and mock trials differ in both\nformat and focus.Mock trials usually simulate first instance courts;\nfeature a prosecution, a defense, and witnesses; and mainly try\nfacts before the court. Moot courts, on the other hand, simulate\nappellate courts, in which teams of lawyers dispute whether the\nprior trial court decision was the best application or interpreta-\ntion of the law (Ringel 2004; Ambrosio 2006).\nBesides being exciting and engaging teaching tools, moot\ncourts and mock trials benefit students in a number of ways.\nFirst, students gain a deeper understanding of the law, the judi-\ncial process, and the substantive area on which a given dispute is\nfocused. Second, because students are required to conduct a thor-\nough investigation of the disputed matter and prepare a robust\nargument, their research skills and critical and analytical abili-\nties are enhanced. Third, the need to present and defend an argu-\nment before a group of exacting outsiders forces students to\nsharpen their argumentation, thus contributing to the improve-\nment of presentation, debating, and public speaking skills. Moot\ncourts and mock trials can also help students improve teamwork\nskills and enhance their leadership abilities (Hernandez 1988;\nCurran, Takata, and Acone 2000; Knerr and Sommerman 2004;\nRingel 2004).\nOf course, moot courts and mock trials are not without costs.\nThey can consume a lot of time and energy for both faculty and\nthe class, suffer from free-rider problems if not properly designed,\nentail psychological costs for the “losing” side, and incur direct\nfinancial costs for faculty and students (Ringel 2004). Critics also\nnote that moot courts and mock trials can teach “wrong skills”\nbecause they are unreal (Kozinski 1997), and that they canbe inher-\nently gender-biased (Morrison 1995).Most studies, however, con-\ntest these arguments and agree that the benefits of moot courts\nandmock trials far outweigh their costs (Knerr, Sommerman, and\nRogers 2001). Overall, student reception of these exercises has\nbeen very positive (Carlson and Skaggs 2000; Ambrosio 2006;\nGillespie and Gordon 2006).\nDespite being an effective, fluid, and exciting teaching tool, in\nthe social sciences, moot courts and mock trials have been used\nalmost exclusively in areas adjacent to law and with a primary\npurpose of teaching law, the judicial process, or a related substan-\ntive area such as professional ethics or journalistic rights (Carl-\nson and Skaggs 2000; Ringel 2004). Yet, as I show in the following\nsection, a mock trial format can serve purposes other than teach-\ning law and the legal process and can do so with equal success.\nTwo articles that do address non-law-related areas are worth men-\ntioning. Brock and Cameron (1999) briefly suggest that instruc-\ntors could use moot courts in teaching political theory. Their\ntreatment of the subject, however, is understandably cursory,\nas their preoccupation is with applying Kolb’s learning prefer-\nence model to political science. Carlson and Skaggs (2000), on\nthe other hand, do offer an interesting moot court model in\nwhich student teams argue before the court on the merits and\nweaknesses of a particular economic thinker’s ideas. Despite its\ninnovation and merits, however, this model’s design and poten-\ntial learning outcomes are only slightly different from those of\ntraditional student debates, and as a result, the full potential\nthat can be reaped through a moot court or mock trial remains\nuntapped.\nTEACHINGTHEHISTORY OF POLITICALTHOUGHTWITH\nMOCKTRIALS: PLAYERS AND SET-UP\nIn this mock trial, which I designed and have used successfully\nfor several years, both the plaintiff and the defendant are emi-\nnent political and\/or economic thinkers played by students.2 As\nexplained previously, the plaintiff files a suit against the defen-\ndant for causing undue harm to the society or a particular social\ngroup by spreading ideas that the plaintiff finds ill-justified theo-\nretically and\/or empirically.3 In my class, for example, “Herbert\nMarcuse” incriminated “Milton Friedman” with “advocating a\nsubtly authoritarian capitalist system that rests on consumerism\nas a form of social control.” “Ayatollah Khomeini” sued “Mus-\ntafa Kamal Ataturk” for “sanctioning the encroachment of destruc-\ntive non-Islamic Western values into the Islamic community by\npromoting laicism.” And “Friedrich vonHayek” has accused “John\nMaynard Keynes” of “providing justification for a gradual enslave-\nment of men in the form of socialism through advocating exces-\nsive government intervention into markets.”\nBoth sides are represented by attorneys, who are also renowned\nthinkers whose ideas are close to those of the plaintiff and the\ndefendant, respectively.4 For example, “Immanuel Wallerstein”\nhas represented “Marcuse,” “Karl Popper” has represented his old\nfriend “von Hayek,” and the Artha-shastra author “Kautilya” has\nrepresented “Niccolo Machiavelli.” The sides can also draw “wit-\nnesses” to shore up their case. “President Franklin D. Roosevelt”\nhas appeared as a witness for “Keynes,” and “Ernesto ‘Che’ Gue-\nvara” for “Marcuse.”The latter’s flamboyant appearance and char-\nacteristic answers in the courtroom acted as an effective and fun\nenergizer.\nThe Teache r : When Gr e a t M ind s Don ’ t Th i nk A l i k e\n.............................................................................................................................................................................................................................................................\n626 PS • July 2011\nThe Judge and the Jury\nDuring the trial, the sides present their cases to the judge and the\njury. The judge is selected from among faculty members. Because\nthis exercise models a court based on the adversarial system, the\njudge’s role is to act as a neutral arbiter by presiding over the trial,\ngiving instructions to the jurors regarding the standard of proof,\nasking both sides questions, and calling witnesses.\nThe trial jury is composedof six to 12members,who are selected\nfrom among the faculty, community members, and alumni. Invit-\ning some high-profile community members to serve in the jury\nusually acts as an incentive for the disputing sides to do their best\nin court. Our jurors have included a Norwegian ambassador, the\nuniversity president, the former director of the Federal Constitu-\ntional Court of Germany, a presidential aide on foreign policy,\nand the dean of the law school. The students, however, are asked\nto not assume the jury’s familiarity with any given case. They are\nalso reminded that most jury verdicts depend on the direction\nand strength of the arguments, rather than the personal charac-\nteristics of jurors (Kassin 1984).\nThe jury’s task is to hear the evidence and, after deliberation,\nrender a verdict based on a two-thirds majority. The verdict must\nbe based solely on the evidence presented in the court, favoring\nthe side with themost cogent argument. I emphasize to the jurors\nthat the verdict is certainly not (and should not be) a comparative\nassessment of the thinkers’ ideas per se, but should rather reflect\nthe quality of the argument presented and contested by the\nstudents.\nTiming\nThe trial can be organized either as a graded in-class exercise or\nan extracurricular activity. If time allows, several cases may be\ntried successively in one day. For each case, the trial proceeds in\nsix stages and should not take more than 90 minutes in total.\nImposing time limits for each stage forces students to make their\npresentations as coherent as possible. First, the judge gives pre-\nliminary instructions to the jury and the contestants, who then\nmake opening addresses. The attorneys then conduct direct exam-\ninations and cross-examinations of the plaintiff and the defen-\ndant, respectively. Each side can call witnesses for direct and\ncross-examination. In the fourth stage, both the plaintiff and the\ndefendant make a rebuttal and a closing argument. The jury then\nreceives instructions from the judge and retires to deliberate.\nFinally, the jury returns to the courtroom and announces its ver-\ndict. Once the trial is over and the jury, judge, and audience have\nleft the courtroom, we conduct a debriefing to share our reflec-\ntions and link them to theory.\nCases: Selection and Preparation\nThe cases are selected jointly by the faculty and students toward\nthe middle of the semester. We first identify critical debates in\npolitical philosophy that could be interesting and useful to enact.\nOnce the cases are identified, students form teams based on their\ninterests. When conducting the mock trials as an extracurricular\nexercise, I also selected a certain number of bright students from\ntwo other local universities. Overlapping choices are resolved by\nconsensus or lottery. Because teams are composed of three or four\nmembers, each case requires six to eight participants. A small team\nsize is advisable to prevent potential free-rider problems. When\nthe instructor sees a situation in which students might benefit\nfrom “wearing others’ shoes,” he or she can encourage students to\ntake positionswithwhich they personally disagree. Students have\nfour to five weeks to prepare for the trial. This is an exciting time\nfor students to thoroughly research their case, prepare their argu-\nments, write up a brief, and rehearse their oral testimony in teams.\nFor each case, I provide a list of key readings but also encourage\nstudents to look beyond this bibliography in order to be able to\nrespond to the opposing side’s arguments in court. I set up e-mail\ngroups to share articles, data, and administrative information. Stu-\ndents are also encouraged to prepare a piece of attire that distin-\nguishes the thinker they are representing.\nThe plaintiff is required to present his or her claim to the\ninstructor and the defendant at least threeweeks before the actual\ntrial takes place.This claim should be as specific as possible, focus-\ning on a few concrete points rather than a general allegation. Two\nweeks before the trial, the sides convene to agree on a list of non-\ncontested facts and disputed issues, which are no longer subject\nto modification. Each side is asked to submit its written brief to\nthe instructor one week before the trial.\nInstructor’s Role\nThe instructor’s role varies depending on the stage of the trial and\nstudent needs. The instructor should “be part facilitator, advisor,\ndevil’s advocate, and taskmaster” (Ringel 2004, 461).Whenmock\ntrials are conducted within team-taught classes or as an extracur-\nricular exercise, other facultymembers can serve as tutors towhom\nthe students can turn for advice.During the actual trial, the instruc-\ntor becomes a member of the audience, intervening only when\nthere is a need to clarify an administrative matter. Overall, our\nexperience confirms Collins and Rogoff ’s (1991) observation that\nthe instructor’s transformation from a critic and judge to an ally\ncreates a more productive learning environment.\nStudent Assessment\nIf themock trial is conducted as a course requirement, the instruc-\ntormay consider breaking the participation grade into three com-\nponents: written brief, courtroom performance, and group work.\nInmymock trial, members of the winning side also receive bonus\npoints.When the trial is conducted as an extracurricular exercise,\nthe organizers may want to consider giving participation certifi-\ncates to all students and prizes to winners.\nPerceptions\nSince the mock trials of political thinkers are as much dramatic\nproductions as they are learning exercises, they offer more excite-\nment to students thando traditional teachingmethods.Themajor-\nity of students who have taken part in these mock trials have\nreported that they enjoyed this experience; learned a lot about\nparticular thinkers’ ideas; and polished their critical thinking, ana-\nlytical, and public speaking skills. Most have been enthusiastic\nabout enacting a critical historical debate and approached their\njob seriously. Many also liked the experience of “wearing others’\nshoes” and “connecting” with their assigned thinker or politician.\nSome reported enjoying the thrill of competition.\nBENEFITS AND COSTS\nStudents who took part in these mock trials benefited from them\nin several ways. First and foremost, the in-depth study of a par-\nticular theory and its friction with a rival set of ideas helped stu-\ndents gain adeeper insight into andamorenuancedunderstanding\nof the ideas of the thinker they represented. In addition, the need\n.............................................................................................................................................................................................................................................................\nPS • July 2011 627\nto see various aspects of that theory and develop a convincing and\nrobust argument enhanced students’ critical and analytical abili-\nties. Third, a careful examination of a set of related theories\nimproved students’ research skills. Fourth, the need to present\nand defend a case concisely and coherently both in writing and in\na debate before a group of judging outsiders helped students\ndevelop their writing, presentation, and public speaking skills, as\nwell as their ability to “think on their feet” (Curran, Takata, and\nAcone 2000). Working in teams toward a common goal, some-\ntimes with students from other universities, also contributed to\ntheir productive teamwork skills and fostered networks that per-\nsisted after the trial. Some students played their character so well\nthat members of the audience later referred to them by that\ncharacter’s name. Finally, the mock trial helped students unfold\ntheir creative potential, as well as develop greater self-confidence\nin otherwise introverted students. Students in the audience also\nlearned about various theories by watching the trials.\nThe key drawback of using a mock trial in teaching political\nthought is that students may slip into focusing on forensic ora-\ntory and courtroom “pyrotechnics.” At the same time, some stu-\ndents may be prone to read their oral arguments out of fear of\npotential embarrassment. Such problems should be tackled in\nadvance by developing a set of rules to guide students’ behavior\nbefore and during the trial.\nOur mock trials also entailed some costs, including the expen-\nditure of a lot of faculty and student time and energy outside\nclass. Initially, I also incurred direct financial costs, although later\nmock trials were sponsored by the university and an educational\nnon-governmental organization. The university’s provision of\ngowns for the judge and attorneys helped create a courtroom\natmosphere.\nCONCLUSION\nAs a teaching tool amenable to creative adaptation, a mock trial\ncan be an engaging and effective exercise in delving into the his-\ntory of political thought and making the subject more relevant.\nThrough engagement in such “learning-by-doing” exercises, my\nstudents gained a deeper understanding of some of the most\nimportant ideas and critical debates that have shaped political\ntheory to date. They were also able to critically test the validity of\ncontested ideas. Overall, the mock trials enhanced participants’\ncritical and analytical abilities, improved their research skills, built\nup their public speaking skills, and fostered a spirit of teamwork. \u0002\nNOTES\nI thank RachelTsang, Mike Seiferling, participants of the APSA 2010 Annual Meeting,\nthe PS editor and two anonymous reviewers for useful comments, and my colleagues at\nKhazar University for their input to the exercise described here. Most important, I am\nindebted to my students, who have used their bright minds to make this exercise a suc-\ncess; the list is long, but they know who they are.\n1. See Ringel (2004) for useful instructions on how to design and run moot courts\nin general and Smith and Boyer (1996) on designing simulations.\n2. The mock trial presented here should ideally involve at least sophomore stu-\ndents who have already had exposure to the fundamentals of reasoning in\nphilosophy and social sciences.\n3. The defendant might also be a policymaker, who is being sued for promoting a\nharmful policy. Carlson and Skaggs (2000) also suggest this approach.\n4. I require the attorneys to be explicit in distinguishing their ideas from those of\nthe side they are representing, however similar these views may be. This pre-\ncautionary measure helps avoid conflating different thinkers’ ideas.\nREFERENCES\nAmbrosio, Thomas. 2006. “Trying Saddam Hussein: Teaching International Law\nthrough an Undergraduate Mock Trial.” International Studies Perspectives 7 (2):\n159–71.\nBentley, Duncan. 1996. “Mooting in an Undergraduate Tax Program.” Legal Educa-\ntion Review 7: 97–124.\nBray, Robert M., and Norbert L. Kerr. 1979. “Use of the Simulation Method in the\nStudy of Jury Behavior.” Law and Human Behavior 3 (1): 107–19.\nBrock, Kathy L., and Beverly J. Cameron. 1999. “Enlivening Political Science\nCourses with Kolb’s Learning Preference Model.” PS: Political Science and Poli-\ntics 32 (2): 251–56.\nCarlson, J. Lon, and Neil T. Skaggs. 2000. “Learning by Trial and Error: A Case for\nMoot Courts.” Journal of Economic Education 31 (2): 145–55.\nCollins, Edward, Jr., and Martin A. Rogoff. 1991. “The Use of an Interscholastic\nMoot Court Competition in the Teaching of International Law.” PS: Political\nScience and Politics 24 (3): 516–20.\nCooper, Phillip J. 1979. “Undergraduate Moot Court: A Simulation for Undergrad-\nuate Courses in Public Law.” Teaching Political Science 7: 105–18.\nCurran, Jeanne, Susan Takata, and Patricia Acone. 2000. “Moot Court: Thinking\non Your Feet.” Paper presented at the Annual Meeting of the American Politi-\ncal Science Association,Washington, DC, August 31–September 3.\nDeardorff, Michelle Donaldson, and Jilda Aliotta. 2000. “Playing Justice: The Role\nof Simulation in Teaching and Assessing the Teaching of Public Law.” Paper\npresented at the Annual Meeting of the American Political Science Associa-\ntion,Washington, DC, August 31–September 3.\nGillespie,William, and Elizabeth Gordon. 2006. “Competition, Role-Playing, and\nPolitical Science Education.” Paper presented at the Annual meeting of the\nAmerican Political Science Association, Philadelphia, PA, August 31–\nSeptember 2.\nHernandez, Michael V. 1988. “In Defense of Moot Court: A Response to ‘In Praise\nof Moot Court—Not!’” Review of Litigation 17: 69–89.\nJefferson, KurtW. 1999. “The BosnianWar Crimes Trial Simulation: Teaching\nStudents about the Fuzziness ofWorld Politics and International Law.” PS:\nPolitical Science and Politics 32: 589–92.\nKassin, Saul M. 1984. “Mock Jury Trials.” Trial Diplomacy Journal 7: 26–30.\nKnerr, Charles R., and Andrew B. Sommerman. 2001. “Bringing the Court into the\nUndergraduate Classroom: Appellate Simulation in American College.” Laws\nand Courts 11: 4–8.\n_. 2004. “Undergraduate Moot Court in American Colleges and Universi-\nties.” Paper presented at the PAD Annual Pre-Law Conference,Washington,\nDC, November 4–6.\nKnerr, Charles R., Andrew B. Sommerman, and Suzy K. Rogers. 2001. “Undergrad-\nuate Appellate Simulation in American Colleges.” Journal of Legal Education\nStudies 19 (1): 27–62.\nKolb, David. 1976. “Management and the Learning Process.” California Manage-\nment Review 18 (3): 22–31.\n_.1984. Experiential Learning: Experience as the Source of Learning and Devel-\nopment. Englewood Cliffs, NJ: Prentice-Hall.\nKozinski, Alex. 1997. “In Praise of Moot Court—Not!” Columbia Law Review 97 (1):\n178–97.\nMcCarthy, J. Patrick, and Liam Anderson. 2000. “Active Learning Techniques\nversus Traditional Teaching Styles: Two Experiments from History and Politi-\ncal Science.” Innovative Higher Education 24 (4): 279–94.\nMorrison, Mairi N. 1995. “May It PleaseWhose Court? How Moot Court Perpetu-\nates Gender Bias in the ‘RealWorld’ of Practice.” UCLAWomen’s Law Journal\n49: 49–84.\nRachid, Mohammad, and Charles Knerr. 2000. “Brief History of Moot Court: Brit-\nain and U.S.” Paper presented at the Southwestern Political Science Associa-\ntion Annual Meeting, Galveston, TX, March 16–20.\nRingel, Lewis S. 2004. “Designing a Moot Court:What to Do,What Not to Do,\nand Suggestions for How to Do It.” PS: Political Science and Politics 37: 459–65.\nSmith, Elizabeth T., and Mark A. Boyer. 1996. “Designing In-Class Simulations.”\nPS: Political Science and Politics 29 (4): 690–94.\nSmith, Richard. 1992. “Using a Mock Trial to Make a Difficult Clinical Decision.”\nBritish Medical Journal 305 (6,864): 1,284–87.\nStice, James E. 1987. “Using Kolb’s Learning Cycle to Improve Student Learning.”\nEngineering Education 77 (5): 291–96.\nWeiden, David L. 2009. “Comparing Judicial Institutions: Using an Inquisitorial\nTrial Simulation to Facilitate Student Understanding of International Legal\nTraditions.” PS: Political Science and Politics 42: 759–63.\nThe Teache r : When Gr e a t M ind s Don ’ t Th i nk A l i k e\n.............................................................................................................................................................................................................................................................\n628 PS • July 2011\nReproduced with permission of the copyright owner. Further reproduction prohibited without permission.\n"}