{"doi":"10.1142\/S0219477503001178","coreId":"70856","oai":"oai:eprints.lancs.ac.uk:10088","identifiers":["oai:eprints.lancs.ac.uk:10088","10.1142\/S0219477503001178"],"title":"Coherence resonance of the noise-induced motion on the way to breakdown of synchronization in chaotic systems","authors":["Balanov, A. G.","Janson, N. B.","McClintock, P. V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-06","abstract":"We investigate the way in which noise destroys phase synchronization in chaotic systems. Two cases are considered: where the route to synchronization involves frequency locking; and where it occurs via a suppression of the natural dynamics. We show that, just as in the case of synchronization of periodic oscillations, noise induces a new motion whose coherence depends non-monotonically (resonantly) on the noise intensity","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70856.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/10088\/1\/balanovPostPrint.pdf","pdfHashValue":"859e5300188f3bd0124b2c794bc3d86e00d51a72","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:10088<\/identifier><datestamp>\n      2016-10-04T23:00:10Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Coherence resonance of the noise-induced motion on the way to breakdown of synchronization in chaotic systems<\/dc:title><dc:creator>\n        Balanov, A. G.<\/dc:creator><dc:creator>\n        Janson, N. B.<\/dc:creator><dc:creator>\n        McClintock, P. V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We investigate the way in which noise destroys phase synchronization in chaotic systems. Two cases are considered: where the route to synchronization involves frequency locking; and where it occurs via a suppression of the natural dynamics. We show that, just as in the case of synchronization of periodic oscillations, noise induces a new motion whose coherence depends non-monotonically (resonantly) on the noise intensity.<\/dc:description><dc:date>\n        2003-06<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1142\/S0219477503001178<\/dc:relation><dc:identifier>\n        Balanov, A. G. and Janson, N. B. and McClintock, P. V. E. (2003) Coherence resonance of the noise-induced motion on the way to breakdown of synchronization in chaotic systems. Fluctuation and Noise Letters, 3 (2). L113-L120. ISSN 0219-4775<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/10088\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1142\/S0219477503001178","http:\/\/eprints.lancs.ac.uk\/10088\/"],"year":2003,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"COHERENCE RESONANCE OF THE NOISE-INDUCED MOTION\nON THE WAY TO BREAKDOWN OF SYNCHRONIZATION IN\nCHAOTIC SYSTEMS\nA.G. BALANOV, N.B. JANSON, P.V.E. McCLINTOCK\nDepartment of Physics, Lancaster University, Lancaster LA1 4YB, UK\na.balanov@lancaster.ac.uk, n.janson@lancaster.ac.uk, p.v.e.mcclintock@lancaster.ac.uk\nReceived (17 January 2003)\nRevised ()\nAccepted (25 March 2003)\nWe investigate the way in which noise destroys phase synchronization in chaotic systems.\nTwo cases are considered: where the route to synchronization involves frequency locking;\nand where it occurs via a suppression of the natural dynamics. We show that, just as\nin the case of synchronization of periodic oscillations, noise induces a new motion whose\ncoherence depends non-monotonically (resonantly) on the noise intensity\nKeywords: noise, coherence resonance, synchronization, chaos.\n1. Introduction\nThere are two classical mechanisms for the synchronization of periodic oscillators\n[1–3], namely: frequency locking; and suppression of the natural dynamics. They are\neach applicable either to a pair of interacting oscillators, or to a periodically-forced\nself-sustained one. Because synchronization phenomena in forced oscillators are\neasier to describe, we will speak hereinafter about forced oscillators for simplicity.\nThe notion of synchronization was originally defined in terms of frequencies.\nAssume that the frequency of forcing does not coincide with the basic frequency of\nunforced oscillations. The occurrence of n:m synchronization means that the ratio\nof basic frequency of forced oscillations to the frequency of forcing becomes as n:m,\nwhere n and m are integers. The frequency locking scenario manifests itself in that\nthe basic frequency of the forced oscillations shifts towards the product of forcing\nfrequency and n:m as the strength of forcing is increased, to coincide with it at\nthe onset of synchronization. Suppression of natural dynamics manifests itself in a\nsimultaneous decrease in the amplitude of the basic spectral peak (corresponding to\nunforced oscillations), and an increase in the amplitude of the peak at the forcing\nfrequency multiplied by n:m. The same mechanisms were later described in terms\nof bifurcation theory.\nPublished in Fluct. Noise Lett. 3, L113-L120 (2003).\nCoherence Resonance on the Way of Chaos Synchronization Breakdown\nSynchronization phenomena can be also described in terms of the instantaneous\nphases of the forcing ϕ1(t) and the response ϕ2(t). Namely, if the phase difference\n∆ϕ(t) = nϕ1(t) − mϕ2(t) remains constant within some accuracy during a suffi-\nciently long time interval, one can speak of phase synchronization. For periodic\noscillations in the absence of noise, phase and frequency synchronizations are the\nsame phenomenon. In other situations, they may in general differ, although they\nare closely related to each other.\nIt has recently been established that the concept of frequency synchronization\ncan be extended to encompass systems with chaotic dynamics that have well-defined\npeaks in the Fourier spectra of their oscillations. Namely, in [4] chaotic motion in a\nsystem with Ro¨ssler-type spiral attractor, possessing the latter feature, was shown\nto become synchronized by a harmonic forcing, following the frequency-locking sce-\nnario. In [5] a Van der Pol oscillator was synchronized by the signal from a chaotic\nRo¨ssler system, following the frequency-suppression route to synchronization. We\nemphasize that, in both cases, the synchronized regime remained chaotic and pos-\nsessed a continuous Fourier spectrum with a well-defined peak.\nAn important issue to be considered is how noise influences a synchronized sys-\ntem. Stratonovich [6] developed an analytic treatment to describe the effect of noise\non a weakly nonlinear Van der Pol oscillator synchronized by weak harmonic forc-\ning. A 1:1 frequency-locked state was considered for which the frequency of forced\noscillations coincided with the frequency of forcing and ∆ϕ remained constant. One\neffect of noise is to make the phase difference jump occasionally by 2pi. This causes\nthe average frequency of the response signal to shift towards the frequency of the\nunforced system, thus destroying the synchronized state. No consideration was\ngiven, however, as to how the spectral shape evolves with increase of noise inten-\nsity. Neither the suppression mechanism, nor the possibility of n:m synchronization\nof arbitrary order, were addressed.\nThe way in which noise affects the general picture of n:m synchronization of a\nperiodic oscillator was considered in [7]. It was found that, because different parts\nof the synchronization region correspond to different structures of phase space in\nthe vicinity of the attractor, the effects caused by noise differ correspondingly. In\neach qualitatively distinct state, the evolution of both the phase portraits and the\nFourier spectra were followed in parallel, as the noise intensity increased. It was\nshown that, in two of the three distinct states, noise creates a new spectral peak\nnear the one at the frequency of forcing multiplied by n:m. The position and shape\nof this additional peak determines the observed shift of the average frequency of\nresponse signal, in full agreement with Stratonovich theory. However, the coherence\ncomputed for this peak depends non-monotonically (resonantly) on noise intensity,\ni.e. coherence resonance occurs.\nIn this paper we consider how noise effects the spectra of chaotic systems in\ninitially synchronized states. For two different systems, both possible synchroniza-\ntion mechanisms are considered, i.e. frequency locking and suppression. We show\nthat, in both cases, the effects of noise are similar to those seen in periodic os-\ncillators. That is, the noise creates a new spectral peak near the main one, and\nits coherence depends resonantly on noise intensity. Thus the destruction of chaos\nsynchronization by noise is associated with the phenomenon of coherence resonance.\nA.G. Balanov, N.B. Janson, P.V.E. McClintock\n2. Ro¨ssler system frequency-locked by harmonic signal\nFirst, we consider a case where chaotic oscillations are synchronized via frequency-\nlocking. As shown in [4], this type of synchronization is associated with an accumu-\nlation of saddle-node bifurcations of saddle cycles embedded in the chaotic attractor.\nAs an example, we examine the Ro¨ssler oscillator under external harmonic forcing,\ndescribed by the equations\nx˙ = −y − z + C sin(Ωt) + Dξ(t)\ny˙ = x + αy (1)\nz˙ = α + z(x− µ),\nwhere α = 0.2, µ = 6.5, ξ(t) is Gaussian white noise of zero mean and unity\nvariance , and D is the noise intensity. In the absence of noise (D = 0), for forcing\nparameters C = 0.1 and Ω = 1.061, the system is frequency-locked at order 1:1.\nThe Fourier spectrum of the oscillations is continuous, but contains one peak at the\nforcing frequency. In Fig. 1(a) the close vicinity of the main peak in the continuous\nspectrum is shown. As noise intensity increases from zero, a new peak appears in the\nvicinity of the first one. In Figs. 1(b), (c) and (d), spectra are shown for gradually\nincreasing noise intensities D. It is evident that a peak appears on the right-hand\nside of the main one, grows (Fig. 1(b)), narrows (Fig. 1(c)), and then widens and\ndecreases in amplitude again (Fig. 1(d)). Note, that according to Stratonovich’s\nSx\nSx\n0.1 0.15 0.2\n0\n1\n2\n0.1 0.15 0.2\n0\n1\n2\n0.1 0.15 0.2\n0\n1\n2\n0.1 0.15 0.2\n0\n1\n2\nω\/2pi ω\/2pi\n(a)\n(d)(c)\n(b)\nFig 1. Evolution of Fourier power spectra for Ro¨ssler oscillator in a chaotic regime that is frequency-\nlocked by harmonic forcing, as the noise intensity D is increased: the region in the vicinity of the\nmain peak is plottedon an expanded scale. (a) D = 0; (b) D = 0.15; (c) D = 0.21; (d) D = 0.45.\ntheory for weakly nonlinear periodic oscillations synchronized by a periodic forcing\nof frequency Ω in the presence of noise, the following relation is valid:\n(〈ω〉 − Ω) ∝ (ω0 − Ω)e\n−γ , (2)\nwhere ω0 is the basic frequency of the unforced oscillator and γ is some positive\nconstant depending on the system parameters and noise intensity. Therefore, to fit\nCoherence Resonance on the Way of Chaos Synchronization Breakdown\nStratonovich’s theory, the noise-induced peak should appear in between the basic\nfrequency of frequency-locked oscillations (which for 1:1 locking is just Ω) and the\nfrequency of unforced oscillations ω0. In our case ω0 ≈ 1.067, which is to the right\nof Ω = 1.061, thus, the ratio (2) is still valid when noise affects frequency-locked\nchaotic oscillations.\nIn order to characterize the regularity of the noise-induced peak, we removed the\nmain peak by means of a band-stop filter and, to avoid the resultant discontinuity in\nthe spectrum, connected the edges of the removed frequency range with a straight\nline. We then estimated the following quantities: coherence β and Shannon entropy\nEs of the resulting spectrum in the vicinity of the noise-induced peak. β is estimated\nusing:\nβ = Hωn\/∆ω, (3)\nwhere H is the height of the peak at its central frequency ωn, and ∆ω is the peak\nwidth at the height H\/2. Fig. 2(a) and (b) show the entropy Es and the coherence\nβ of the noise-induced peak as functions of noise intensity. Both variations have a\nresonant character, with β taking its maximal and Es its minimal value at an op-\ntimal noise intensity D ≈ 0.2. This resonant dependence reflects the nonmonotonic\nchange of height H and width ∆ω of the noise-induced peak (Fig. 2(c) and (d),\nrespectively). The latter could be treated as an evidence of noise-induced ordering.\nIn this context it is interesting that, at noise intensities close to zero, the position of\nthe noise-induced peak almost coincides with that of the main one. As the noise in-\ntensity increases, the new peak moves away. Fig. 2(e) plots the difference δ between\nthe frequency of the main peak and the central frequency ωn of the noise-induced\none, showing a monotonic increase of absolute value of δ with the increasing D.\nBased on these observations, we conclude that noise destroys the frequency-locked\nstate of a spiral-type chaos in a manner that is in many respects the same way as\nthat in the case of periodic oscillations. This can be accounted for empirically in\nthe following way. It is known that for spiral-type chaos, which is characterized by\nthe presence of a well-resolved peak in the spectrum, the instantaneous amplitude\nA(t) and phase Φ(t) of the oscillations can be introduced, for instance, by using the\ncoordinate transformation:\nx(t) = A(t) cosΦ(t)\ny(t) = A(t) sin Φ(t), (4)\nwhere x and y are some phase coordinates in the projection that looks like a smeared\nlimit cycle. Substituting (4) in (1) and making transformations similar to those\ngiven in [6, 8], one obtains the following representation of the Ro¨ssler equations:\nA˙ = αA +\nC\n2\nsin φ + Ψa(φ, z, A, t) + ξa (5)\nφ˙ = ∆−\nC\n2A\ncosφ + Ψφ(φ, z, A, t) +\nξφ\nA\n(6)\nz˙ = α + z(A cos(φ + Ωt) + µ) (7)\nwhere φ = Φ − Ωt is the phase difference between the forced oscillations and the\nforcing, ∆ is some effective detuning, Ψa,φ are certain nonlinear functions, and ξa,φ\nA.G. Balanov, N.B. Janson, P.V.E. McClintock\nx\n10\n−\n2\n∆ω\nx\n10\n−\n2\nδ\nE s\n0 0.1 0.2 0.3 0.4 0.5\n20\n40\n60\n80\n0 0.1 0.2 0.3 0.4 0.55.5\n5.7\n5.9\n0 0.1 0.2 0.3 0.4 0.50.0\n0.5\n1.0\n1.5\n0 0.1 0.2 0.3 0.4 0.5\n1\n2\n3\n0 0.1 0.2 0.3 0.4 0.5-0.3\n-0.2\n-0.1\n0\nH\nD\nD\nβ\n(c)\n(b)\n(a)\n(e)\n(d)\nFig 2. Various quantities for a Ro¨ssler system frequency-locked by harmonic forcing, plotted as\nfunctions of noise intensity D: (a) Shannon entropy Es; (b) coherence β of noise-induced peak;\n(c) height of noise-induced peak; (d) width of noise-induced peak; (e) distance δ between the\nnoise-induced and main peaks. For details of computation see text.\nare two independent sources of Gaussian white noise whose intensities are com-\npletely defined by the intensity of the original noise ξ (see Chapters 4 and 9 in [6]).\nWithout the loss of generality, one can treat Ψa,φ as additional limited “random”\nforces that are defined by the chaotic dynamics of the system. Then the system of\nequations (5), (6) could be considered as that describing the dynamics of a limit\ncycle oscillator under periodic external forcing in the presence of limited correlated\nrandom force Ψa,φ and external noise ξa,φ. In the absence of external noise ξa,φ,\nthe effective limit cycle will be smeared by the random forces Ψa,φ. Synchronous\nchaos in the initial system will correspond to the situation when the maximal values\nΨa,φ will be not large enough to induce a phase slip (or such that phase slips are\nextremely rare). However, as was shown earlier, the shift of average frequency [6]\nand the occurrence of coherence resonance [7, 9] are in principle associated with\noccurrence of phase slips which, both in the chaotic oscillator considered and in a\nlimit cycle oscillator, appear due to external noise ξ. Hence, the effect of noise on a\nsynchronized spiral-type chaos should be at least qualitatively similar to its effect\non periodic oscillations.\n3. Van der Pol oscillator under chaotic forcing from Ro¨ssler system\nsynchronized by suppression\nIn contrast to the frequency-locking mechanism, transition to a synchronous regime\nvia the suppression mechanism is associated with an accumulation of inverse Neimark\nbifurcations for saddle cycles embedded in a chaotic attractor [5]. As an example\nCoherence Resonance on the Way of Chaos Synchronization Breakdown\nof chaos synchronized in this way, we consider the system described in [5], where a\nVan der Pol oscillator forced by a Ro¨ssler system was studied:\nx˙ = −y − z + C sin(Ωt),\ny˙ = x + α1y, (8)\nz˙ = α2 + z(x− µ),\n(9)\nu˙ = v + γ(x− u) + Dξ(t),\nv˙ = \u000f(1− u2)v − ω2u.\nthe upper part describing the Ro¨ssler system, and the lower part describing the Van\nder Pol oscillator. Here α1 = 0.2, α2 = 0.15, µ = 6.5, \u000f = 0.1, ξ(t) is Gaussian\nwhite noise with zero mean and unity variance, and D is the noise intensity. At\nω = 1.16, γ = 0.04 the Van der Pol oscillator is synchronized by Ro¨ssler system via\nthe suppression mechanism as shown in [5]. However, the forced oscillations still\nremain chaotic, as illustrated by their continuous Fourier power spectrum, shown in\nFig. 3(a) for zero noise intensity. As noise intensity rises from zero, a peak appears\nSx\nSx\n0.1 0.2 0.3\n0\n0.1\n0.2\n0.1 0.2 0.3\n0\n0.1\n0.2\n0.1 0.2 0.3\n0\n0.1\n0.2\n0.1 0.2 0.3\n0\n0.1\n0.2\nω\/2pi ω\/2pi\n(b)(a)\n(c) (d)\nFig 3. Evolution of Fourier power spectra of chaotically forced oscillations in a Van der Pol\noscillator, synchronized by the suppression mechanism, as the noise intensity D is increased: (a)\nD = 0; (b) D = 0.15; (c) D = 0.21; (d) D = 0.45.\nto the right of the main delta-shaped peak (Figs. 3(b), (c), (d)): the peak height\ngrows monotonically with D and saturates (unlike nonmonotonic growth in the\ncase of chaos-locking discussed in Sec. 2). However, its regularity β and Shannon\nentropy Es both exhibit non-monotonic dependences on noise intensity, since, as\nin the previous case, the width of the new peak grows nonmonotonically on D.\nThus, noise-induced ordering can also occur when noise acts on a chaotic system\nsynchronized by suppression. Fig. 4 shows the same quantities as Fig. 2, but for\nthe case of suppression of natural dynamics of chaotic oscillations in Van der Pol\nsystem.\nThus, noise induces a new spectral peak in the vicinity of the main one, and its\ncoherence depends resonantly on noise intensity. Note that the new peak appears at\nA.G. Balanov, N.B. Janson, P.V.E. McClintock\nsome nonzero distance from the main one, just like the case of periodic oscillations\nsynchronized via the suppression mechanism as described in [7]. However, the\nposition of the new peak relative to the main one differs from that in periodic\noscillations: although the frequency of unforced oscillations is to the left of the\nforcing frequency, the new peak here appears to the right of the main peak.\nx\n10\n−\n2\n∆ω\nx\n10\n−\n2\nδ\nE s\n0 0.4 0.8 1.26.06\n6.09\n6.12\n0 0.4 0.8 1.20\n0.3\n0.6\nD\nβ\n0 0.4 0.8 1.20\n0.05\n0.1\n0 0.4 0.8 1.2\n2.4\n2.8\n3.2\n0 0.4 0.8 1.2-1.2\n-0.9\n-0.6\n-0.3\nH\nD\n(b)\n(a)\n(e)\n(d)\n(c)\nFig 4. Various quantities for a Van der Pol oscillator synchronized via the suppression mechanism,\nby chaotic forcing from a Ro¨ssler system, plotted as functions of noise intensity D: (a) Shannon\nentropy Es; (b) coherence β of noise-induced peak; (c) height of noise-induced peak; (d) width\nof noise-induced peak; (e) distance δ between the noise-induced and main peaks. For details of\ncomputation, see text.\n4. Discussion and Conclusions\nIn the present paper we have studied how noise influences a chaotic system synchro-\nnized by each of the two classical mechanisms: frequency-locking; and suppression\nof the natural dynamics.\nWe have shown that in a frequency-locked Ro¨ssler system noise produces an\neffect similar to that in a frequency-locked periodic oscillator. Namely, it induces a\nnew spectral peak. It appears on the same side of the main one as the frequency\nof unforced oscillations. This peak displays its maximal coherence at some optimal\nnoise intensity, and the whole phenomenon is associated with coherence resonance\n[10–13].\nIn a Van der Pol system forced by a chaotic signal and synchronized by it via the\nsuppression mechanism, noise induces a new spectral peak as well, and its coherence\nis also maximal for some optimal noise intensity. However, the position of this\nnew peak, and its evolution with noise intensity, differ from the case of similarly\nsynchronized periodic oscillations. The reasons for such behavior lie beyond the\nCoherence Resonance on the Way of Chaos Synchronization Breakdown\nframework of this paper. We note, however, that the results of the Stratonovich\ntheory were obtained with substantial restrictions on the system under study. It\nis perhaps unsurprising that they cannot be straightforwardly extended to self-\noscillations of arbitrary origin, or to arbitrary forcing.\n5. Acknowledgements\nThe authors are grateful to D. Postnov, A. Neiman and A. Pikovsky for valuable\ndiscussions, and to the Leverhulme Trust and the Engineering and Physical Sciences\nResearch Council (UK) for financial support.\nReferences\n[1] Hayashi Ch., Non-Linear Oscillations in Physical Systems, (New York, McGraw-Hill,\n1964)\n[2] V.I. Arnold, Geometrical methods in the theory of ordinary differential equations (New\nYork, Springer, 1983).\n[3] Landa P.S., Avtokolebaniya v sistemakh s konechnym chislom stepenei svobody (Self-\nOscillations in Systems with a Finite Number of Degrees of Freedom), (Moscow,\nNauka, 1980)\n[4] Anishchenko V.S., Vadivasova T.E., Postnov D.E., Safonova M.A., Synchronization\nof chaos, Int. J. Bifurcation and Chaos 2 (1992) 633-644.\n[5] D.E. Postnov, A.G.Balanov, O.V.Sosnovtseva, E.Mosekilde, Transition to Synchro-\nnized Chaos via Suppression of the Natural Dynamics, Phys. Lett. A 283 (2001)\n195-200\n[6] R.L. Stratonovich,Topics in Theory of Random Noise. Gordon and Breach, Vol. 2\n(New York, 1967).\n[7] A. G. Balanov, N. B. Janson, D. E. Postnov, and P. V. E. McClintock, Coherence\nresonance versus synchronization in a periodically forced self-sustained system, Phys.\nRev. E 65 (2002) 041105.\n[8] T.E. Vadivasova, A.G. Balanov, D.E. Postnov, E. Mosekilde, Sinchronization in\nDriven Chaotic Syatems: Diagnostics and Bifurcations, Phys. Lett. A 253 (1999)\n66-74.\n[9] Benjamin Linder, Marcus Kostur, and Lutz Schimansky-Geier, Optimal Diffusive\nTransport in a Tilted Periodic Transport, Fluct. and Noise Lett. 1 (2001) R25–R39.\n[10] Hu Gang, T. Ditzinger, C.Z. Ning, and H. Haken, Stochastic resonance without ex-\nternal periodic force, Phys. Rev. Lett. 71 (1993) 807–810 (1993)\n[11] D. Sigeti and W. Horsthemke, Pseudo-Regular Oscillations Induced by External Noise,\nJ. Stat. Phys., 54 (1989) 1217–1222.\n[12] A.S. Pikovsky and J. Kurths, Coherence Resonance in a Noise-Driven Excitable Sys-\ntem Phys. Rev. Lett., 78, (1997) 775–778.\n[13] A. Neiman, P.I. Saparin, and L. Stone, Coherence resonance at noisy precursors of\nbifurcations in nonlinear dynamical systems, Phys. Rev. E 56 (1997) 270–273.\n"}