{"doi":"10.1144\/0016-76492007-076","coreId":"62706","oai":"oai:nora.nerc.ac.uk:3638","identifiers":["oai:nora.nerc.ac.uk:3638","10.1144\/0016-76492007-076"],"title":"A fluvial origin for the Neoproterozoic Morar Group, NW Scotland; implications for Torridon-Morar Group correlation and the Grenville Orogen foreland basin","authors":["Krabbendam, Maarten","Prave, Tony","Cheer, David"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/62706.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/3638\/1\/1081_0_merged_1183623406.pdf","pdfHashValue":"bd665ada909acb71ba0f9e9391a6c0db08ea63f2","publisher":"Geological Society of London","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:3638<\/identifier><datestamp>\n      2012-11-22T11:50:14Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3638\/<\/dc:relation><dc:title>\n        A fluvial origin for the Neoproterozoic Morar Group, NW Scotland; implications for Torridon-Morar Group correlation and the Grenville Orogen foreland basin<\/dc:title><dc:creator>\n        Krabbendam, Maarten<\/dc:creator><dc:creator>\n        Prave, Tony<\/dc:creator><dc:creator>\n        Cheer, David<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:publisher>\n        Geological Society of London<\/dc:publisher><dc:date>\n        2008<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3638\/1\/1081_0_merged_1183623406.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Krabbendam, Maarten; Prave, Tony; Cheer, David.  2008  A fluvial origin for the Neoproterozoic Morar Group, NW Scotland; implications for Torridon-Morar Group correlation and the Grenville Orogen foreland basin.   Journal of the Geological Society, 165 (1). 379-394.  https:\/\/doi.org\/10.1144\/0016-76492007-076 <https:\/\/doi.org\/10.1144\/0016-76492007-076>     \n <\/dc:identifier><dc:relation>\n        http:\/\/jgs.lyellcollection.org\/<\/dc:relation><dc:relation>\n        doi:10.1144\/0016-76492007-076<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/3638\/","http:\/\/jgs.lyellcollection.org\/","doi:10.1144\/0016-76492007-076"],"year":2008,"topics":["Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Correlation of Torridon and Morar groups \nPage 1 of 32 1\n 1 \nA fluvial origin for the Neoproterozoic Morar Group, NW Scotland; implications 2 \nfor Torridon - Morar group correlation and the Grenville Orogen Foreland Basin 3 \n 4 \nMaarten Krabbendam (1), Tony Prave (2), David Cheer (2, 3), 5 \n(1) British Geological Survey, Murchison House, West Mains Road, Edinburgh EH9 6 \n3 LA, UK. Email: mkrab@bgs.ac.uk  Corresponding author.   7 \n(2) School of Geography & Geoscience, Irvine Building, University of St Andrews, 8 \nSt Andrews KY16 9AL, UK 9 \n(3) Present address: Scotland TranServ, Broxden Business Park, Perth, PH1 1RA 10 \n 11 \nRunning title:  Correlation of Torridon and Morar groups 12 \n 13 \nAbstract 14 \nPrecambrian sedimentary successions are difficult to date and correlate.  In the 15 \nScottish Highlands, potential correlations between the thick, undeformed siliciclastic 16 \n‘Torridonian’ successions in the foreland of the Caledonian Orogen and the highly 17 \ndeformed and metamorphosed siliciclastic Moine succession within the Caledonian 18 \nOrogen have long intrigued geologists. New and detailed mapping of the 19 \nNeoproterozoic A ‘Mhoine Formation (Morar Group, lowest Moine Supergroup) in 20 \nSutherland has discovered low strain zones exhibiting well-preserved sedimentary 21 \nfeatures. The formation comprises 3-5 kilometres of coarse, thick-bedded psammite 22 \nwith abundant nested trough and planar cross-bedding bedforms, defining metre-scale 23 \nchannels. Palaeocurrent directions are broadly unimodal to the NNE-ENE. We 24 \ninterpret the A ‘Mhoine Formation as high-energy, braided fluvial deposits.  The A 25 \n‘Mhoine Formation and the unmetamorphosed, Neoproterozoic Applecross-Aultbea 26 \nformations (Torridon Group), are similar in terms of lithology, stratigraphical 27 \nthickness, sedimentology, geochemistry, detrital zircon ages and stratigraphical 28 \nposition on Archaean basement.  Depositional age constraints for both successions 29 \noverlap and are coeval with late-Grenvillean orogenic activity.  Detrital zircons imply 30 \nsimilar source regions from the Grenville Orogen. The Morar and Torridon groups 31 \ncan thus be correlated across the Caledonian Moine Thrust and are best explained as 32 \nparts of a single, large-scale, orogen-parallel foreland basin to the Grenville Orogen.  33 \n 34 \nCorrelation of Torridon and Morar groups \nPage 2 of 32 2\n(end of Abstract) 35 \n 36 \nThe interpretation, correlation and age-control of Precambrian clastic sequences are 37 \nhampered by a lack of biostratigraphical control.  Post-depositional tectono-38 \nmetamorphic events may have obscured or destroyed sedimentological evidence and 39 \nsubsequent plate motions may have transported formerly adjacent source and sink 40 \nregions over long distances.  In addition, some controlling geomorphical factors such 41 \nas rates of weathering and erosion were different in the Precambrian compared to 42 \nmore modern-day processes (e.g. Eriksson et al. 2001).  Over the last decades, the 43 \napplication of detrital zircon dating has provided a means to constrain the maximum 44 \nage of deposition and the provenance of the detritus of such sequences (Froude et al. 45 \n1983; Nelson 2001; Cawood et al. 2004) and the database of such dates is growing 46 \nfast (e.g. Cawood et al. 2007).  However, correlations based solely on detrital zircon 47 \nages may be equivocal and in this study we use lithostratigraphy, sedimentology, 48 \ngeochemistry and published detrital zircon geochronology to interpret and correlate 49 \nNeoproterozoic siliclastic sequences in Northern Scotland.   50 \nThe metamorphosed Morar Group in the Northern Scottish Highlands occurs 51 \neast of the Caledonian (Silurian) Moine Thrust and is the structurally lowest part of 52 \nthe Moine Supergroup. It comprises several kilometres of siliciclastic rocks (mainly 53 \npsammite), has a large (>2000 km2) outcrop area and is generally regarded as shallow 54 \nmarine in origin (e.g. Glendinning 1988; Holdsworth et al. 1994, Strachan et al. 55 \n2002).  56 \nWest of the Moine Thrust, the unmetamorphosed Torridon Group represents a 57 \nsimilarly widespread, thick and monotonous siliciclastic sequence. It is interpreted to 58 \nbe of mostly fluvial origin (Nicholson 1993; Stewart 2002).  A number of workers 59 \nhave suggested that the ‘Torridonian’ (the informal stratigraphical parent of the 60 \nTorridon Group) and the Moine Supergroup may be equivalent (Peach et al. 1907; 61 \n1913; Peach & Horne 1930; Kennedy 1951; Sutton & Watson 1964; Johnstone et al. 62 \n1969; Nicholson 1993; Prave et al. 2001).  However, such a correlation has generally 63 \nnot been accepted and the two sequences are formally regarded as distinct (Clough in 64 \nPeach et al. 1910, p.46; Gibbons & Harris 1994; Stewart 2002; Trewin 2002; Friend 65 \net al. 2003; Cawood et al. 2004).   No thorough discussion or review of a potential 66 \ncorrelation has been published since Kennedy (1951). 67 \nCorrelation of Torridon and Morar groups \nPage 3 of 32 3\nHere, we present new sedimentological and geochemical data for the Morar 68 \nGroup in the Northern Highlands of Scotland.  These and other published data are used to 69 \ncompare and contrast the Morar and Torridon groups and to discuss possible basin 70 \ninterpretations.  It is concluded that they represent a single foreland basin to the Grenville 71 \nOrogen.   72 \n 73 \nGeological Setting  74 \nMoine Supergroup - Morar Group 75 \nThe Moine Supergroup occurs east of, and structurally above, the Caledonian 76 \nMoine Thrust and north of the Great Glen Fault (Figure 1).  After deposition, it was 77 \nsubjected to a number of tectonometamorphic events that have been the subject of some 78 \ndebate (Tanner & Bluck 1999 and references therein). The most common model involves 79 \nan extensional event at c. 870 Ma, followed by Knoydartian (820-740 Ma) and 80 \nCaledonian (470 - 460 Ma and 430 – 400 Ma) orogenic events (Strachan et al. 2002).   81 \nSedimentary structures, especially in pelitic and semipelitic lithologies, are generally 82 \ndeformed, obscured or obliterated by greenschist- to amphibolite-facies metamorphism 83 \nand deformation.  A number of ductile thrust faults disrupt the stratigraphy (Johnstone et 84 \nal. 1969; Barr et al. 1986; Holdsworth et al. 1994).  Within the outcrop of the Moine 85 \nSupergroup are several Lewisianoid basement gneiss inliers with late Archaean protolith 86 \nages that are broadly similar to Lewisian gneisses west of the Moine Thrust (Friend et al. 87 \n2007).   88 \nThe Moine Supergroup has been divided into three groups: the Morar, 89 \nGlenfinnan and Loch Eil (Johnstone et al. 1969; Holdsworth et al. 1994; Soper et al. 90 \n1998).    91 \nThe Morar Group, the lowest and westernmost group (Figure 1, 2),  is dominated by 92 \npsammite with minor pelitic, semipelitic and pebbly layers.  Estimates of 93 \nstratigraphical thickness in the literature (e.g. Holdsworth et al. 1994) are poorly 94 \nconstrained because of structural complexities. In Morar in the Western Highlands, 95 \nthe Group comprises four formations; these are in ascending order the Basal Pelite, 96 \nLower Morar Psammite, Morar Striped and Pelite and Upper Morar Psammite 97 \nformations (Johnstone et al. 1969; Holdsworth et al. 1994). Locally, the base of the 98 \nBasal Pelite Formation is marked by a thin, highly deformed basal meta-99 \nconglomerate,  showing an unconformity with the Lewisianoid basement and it is now 100 \ngenerally accepted that the Morar Group was deposited uncomformably upon 101 \nCorrelation of Torridon and Morar groups \nPage 4 of 32 4\nLewisianoid basement (Peach et al. 1910; Ramsay 1957b; Holdsworth et al. 1994; 102 \n2001).   Previously, sedimentary structures have only been studied in detail in the 103 \nUpper Morar Psammite Formation (Glendinning 1988) and include tabular and trough 104 \ncross-bedding in co-sets up to 0.5 m thick.  Coarse-grained to gravely psammite 105 \nlocally displays cross-beds > 0.5 m thick.  Most palaeocurrents are unidirectional to 106 \nthe north or north-east, but bipolar ‘herring-bone’ cross stratification and dunes and 107 \nripples with mudstone drapes are present locally.  Glendinning (1988) interpreted the 108 \nUpper Morar Psammite as a tidal, shallow-marine deposit but noted that the unit is 109 \nunusually immature (arkosic) compared to other shallow-marine shelf deposits, and 110 \nthat a fluvial origin of these sediments could not be discounted.   111 \nIn contrast, in the Northern Highlands north of Glen Oykel (Figure 1, 2), the 112 \nMorar Group stratigraphy is rather simple.  It is dominated by the psammitic A ‘Mhoine 113 \nFormation (Figure 2), outcropping over c. 1500 km2 (Figure 1, 3).  The A ‘Mhoine 114 \nFormation comprises several kilometres of psammite.  A highly deformed pelitic \/ 115 \nconglomeratic unit is intermittently present on or slightly above Lewisianoid Gneiss 116 \ninliers (Mendum 1976; Holdsworth et al. 2001).  The relationship between the A’Mhoine 117 \nFormation and the Altnaharra and Glascarnoch Formation above the Achness Thrust 118 \n(Figure 3) remains unclear.   119 \nThe Morar Group is structurally overlain by the semipelite-dominated 120 \nGlenfinnan Group, but the contact is generally marked by the ductile Sgurr Beag 121 \nThrust (Figure 1) and the original relationship between the two groups is unclear.  The 122 \nclose association of Glenfinnan Group rocks and basement inliers suggests an original 123 \nunconformable relationship (Holdsworth et al. 1994; Soper et al. 1998), and the group 124 \nmay represent a distal, lateral equivalent to the Morar Group.  However, Morar Group 125 \nrocks on the Ross of Mull appear to pass stratigraphically upward into Glenfinnan 126 \nGroup rocks; the section is, however, locally highly deformed and the field 127 \nrelationships are not unequivocal (Holdsworth et al. 1987).  The Glenfinnan Group 128 \npreserves few sedimentary structures and its depositional environment is unclear.  The 129 \nstratigraphically overlying psammite-dominated Loch Eil Group (Roberts et al. 1987) 130 \ncontains locally abundant sedimentary structures including unidirectional and bipolar 131 \n‘herring-bone’ cross-bedding and wave ripples and has been interpreted as a shallow 132 \nmarine shelf deposit (Strachan 1986).  133 \n 134 \nTorridon Group 135 \nCorrelation of Torridon and Morar groups \nPage 5 of 32 5\nThe Torridon Group occurs west of the Caledonian Moine Thrust and in thrust sheets 136 \nwithin the Moine Thrust Zone (Figure 1, 3).  The Torridon Group is generally 137 \nunmetamorphosed and undeformed, except for gentle tilting. The Torridon Group was 138 \nmostly deposited upon an exhumed land surface of Archaean Lewisian Gneiss with 139 \npalaeo-relief up to 600 m (Peach et al. 1907; Stewart 1972).  Locally, the group 140 \nunconformably overlies the Mesoproterozoic Stoer and Sleat Groups, described 141 \nelsewhere (Stewart 2002; Rainbird et al. 2001; Kinnaird et al. 2007).    Including its 142 \ninferred offshore extent, the Torridon Group currently occupies an area of c. 80 by 143 \n200 km (Stewart 2002).  However, Torridon Group rocks also occur in the highest 144 \nthrust sheets in the Moine Thrust Zone (e.g. Ben More Thrust Sheet and Kinlochewe 145 \nThrust Sheet; Peach et al. 1907; Butler 1997; Krabbendam & Leslie 2004; see also 146 \nFigure 3), so that prior to Caledonian thrusting the Torridon Group must have 147 \nextended some 50 – 100 km farther east (Elliot & Johnson, 1980, Butler & Coward 148 \n1984).  The succession is c. 5-6 km thick but the top of the sequence is not exposed 149 \n(Stewart 2002) because the group is unconformably overlain by Cambro-Ordovician 150 \nsandstone.   151 \nThe Torridon Group has been divided (base to top) into the Diabaig, 152 \nApplecross, Aultbea and Cailleach Head formations (Stewart 2002).  The Diabaig 153 \nFormation comprises breccia, conglomerate, siltstone and sandstone. Cobble breccia 154 \nor conglomerate infill palaeo valleys and are rich in vein-quartz clasts.  The siltstones 155 \nhave been interpreted as lacustrine (Stewart 1988).  The Diabaig Formation is absent 156 \nin the Cape Wrath area in the north, occurs intermittently in Assynt and thickens to c. 157 \n200 m on Skye.  The Applecross and Aultbea formations, two very similar sandstone 158 \nformations, form the bulk of the Torridon Group, totalling c. 4-5 km in thickness. The 159 \ncontact with the underlying Diabaig Formation is sharp, locally erosional and may 160 \nrepresent a disconformity (Kinnaird et al. 2007). The Applecross Formation consists 161 \npredominantly of coarse to very coarse red sandstone in beds 0.1 - 5 metres thick. 162 \nPebble conglomerate and siltstone\/mudstone beds occur locally.   The Aultbea 163 \nFormation comprises mainly fine to medium-grained sandstone and minor mudstone. 164 \nFlat bedding, planar cross-bedding and trough cross-bedding are common in both 165 \nformations (Stewart 2002; Nicholson 1993).   Soft-sediment deformation structures 166 \nare locally abundant (Selley et al. 1963; Owen 1995) and affect beds up to 5 m thick.  167 \nPalaeocurrents are broadly eastward, but vary between NE and SE (Williams, 1969a; 168 \nNicholson 1993; Williams 2001).  The pebble fraction of the Applecross Formation 169 \nCorrelation of Torridon and Morar groups \nPage 6 of 32 6\nconsists mostly of vein quartz or gneiss but also contains up to 30% of ‘exotic’ clasts 170 \n(quartz-fuchsite schist, orthoquartzite, metaquartzite, microgranite, rhyolite, chert and 171 \nred jasper) that cannot be linked to underlying rock units (Peach et al. 1907; Gracie & 172 \nStewart 1967; Williams 1969b). The formations are interpreted as alluvial braid plain 173 \ndeposits (Nicholson 1993; Stewart 2002), although Williams (2001) suggested an 174 \nalluvial ‘mega fan’ environment.    175 \n 176 \nSEDIMENTOLOGY OF THE MORAR GROUP IN THE NORTHERN 177 \nHIGHLANDS 178 \nWell-preserved sedimentary structures are only rarely present in Moine rocks but are 179 \nobserved in several low strain zones within the A ‘Mhoine Formation in the Ben Hee 180 \narea (Cheer 2006) and Glen Cassley (BGS, unpublished data) (Figure 3).  The 181 \nstructure of the Ben Hee – Glen Cassley area is dominated by kilometre-scale, west-182 \nfacing and west-verging folds, alternating with regional-scale ductile thrusts, all 183 \ndeveloped under greenschist- to lower amphibolite-facies metamorphism, presumed 184 \nto be of Scandian (Silurian) age (Cheer 2006).  The folds (Figure 3) trend roughly 185 \nnorth-south, have shallow plunging axes and are near-cylindrical over many 186 \nkilometres.  The folds have highly-sheared gently east-dipping long limbs, some of 187 \nwhich are ductile thrusts (e.g. Ben Hope and Achness thrusts; Figure 3). Inbetween 188 \nthese thrusts are low-strain zones, commonly in the steep to vertical short limbs of the 189 \nlarge-scale folds.  Such limbs are up to 500 m thick and many kilometres wide across 190 \nstrike (cross-sections on Figure 3). In these zones, strata have been rotated c. 80 - 191 \n100° to sub-vertical attitudes, but nevertheless show undeformed sedimentary 192 \nstructures (Figure 4). A modest fabric is locally present in rare semipelite or gritty 193 \nunits (Figure 4a), but most exposures of psammite show a complete lack of any 194 \ntectonic fabric.   Low strain zones with well-preserved sedimentary structures were 195 \nfound in two thrust sheets, above and below the Ben Hope Thrust (Figure 3) 196 \ncommonly on large, glacially polished outcrops.    197 \n 198 \nConstraints on stratigraphical thickness 199 \nThe stratigraphical thickness of the A ‘Mhoine Formation is well constrained 200 \nbetween River Cassley and Carn nam Bò Maola [NC 462 095] (Figure 3).  Here, a 3 201 \nkm long section exposes subvertical strata that strike NNW-ESE and consistently 202 \nCorrelation of Torridon and Morar groups \nPage 7 of 32 7\nyoung to the west; this equates to 3 km of stratigraphical thickness (Figure 3, cross-203 \nsection B-B’).  To the west in the Allt na Faile [NC 432 080], the strata are folded 204 \nover c. 500 m section distance.  West from this, another 3 km long section of steep to 205 \nmoderate dipping strata stretches west as far as Beinn an Eòin Bheag [NC 375 055], 206 \npossibly adding another 2-3 km to the total stratigraphical thickness (cross-section B-207 \nB’ on Figure 3).    Neither the stratigraphical top nor base of the A ‘Mhoine 208 \nFormation occurs in this section but it is clear the formation has a stratigraphical 209 \nthickness of at least 3 km, and possibly more than 5 km.   210 \n 211 \nLithology 212 \nThe dominant lithology of the A ‘Mhoine Formation is a fine to coarse 213 \nquartzo-feldspathic psammite (grain size varies between 0.5 – 3 mm) with rare layers 214 \nof pelite and semipelite. The psammites contain 80 – 90 % quartz, 3 – 8% alkali-215 \nfeldspar and  <4% plagioclase and biotite, with accessory opaques (derived from thin 216 \nsection study). Gritty beds (Figure 4a) are common, particularly in the lower parts of 217 \nthe sequence (e.g. east of Carn nam Bò Maola), with clasts up to 30 mm. Pebbles are 218 \nmainly well-rounded (vein?) quartz with subordinate clasts of feldspar and rarer 219 \nquartzofeldspathic gneiss and\/or granitoid.  Semipelite layers become more common 220 \n(c. 5% of section) at higher levels in the west near Beinn an Eòin Bheag, defining an 221 \noverall fining upward trend.   Overall, the formation is exceptionally uniform and no 222 \ndistinct marker beds have been found.  223 \n 224 \nSedimentary structures 225 \nObserved sedimentary structures include isolated channels, nested channels, planar 226 \nand trough cross-bedding, planar stratification and abundant soft-sediment 227 \ndeformation structures (Figures 4 and 5).  Trough cross-bed sets, typically 0.1 – 1 m 228 \ndeep, infill channels up to several metres deep and 3 – 15 m wide. The sets occur as 229 \nnested stacked units (co-sets) up to 8 m thick (Figure 4b-d). Gravel\/pebble lags occur 230 \nin the bases of larger channels whilst heavy mineral bands (up to 10 mm thick) are 231 \nlocally preserved along the bases of smaller channels. Planar cross-stratification 232 \n(Figure 4c) makes up as much as one third of exposures and occurs as sets and co-sets 233 \nthat are laterally truncated by overlying channels or display migration toward channel 234 \nthalwegs away from channel margins.  Planar cross-bedded co-sets range in thickness 235 \nfrom 0.1 m to 1 m. Both planar and trough cross-bedding locally display a fining 236 \nCorrelation of Torridon and Morar groups \nPage 8 of 32 8\nupward trend along foresets; coarser grain sizes (in places pebbly) define bottomsets 237 \nwhereas topsets are characterised by finer grain sizes (fine sand to semi pelite). Soft-238 \nsediment deformation affected c. 20-30 % of the well-preserved outcrops (Figure 4e, 239 \nf).  Features include dewatering ‘pipes’ 0.2 – 2.5 m in height, typically confined to 240 \nsingle beds, and oversteepened to overturned cross-bedding that can affect cross-241 \nstratified strata up to 5 m thick; in almost all cases, overturning is towards the east or 242 \nNE, i.e. in the sediment transport direction. Slumping is developed locally and 243 \ntypically on decimetre scales but can incorporate up to 10 m of stratigraphy, involving 244 \nsingle beds or groups of beds.  245 \n  Most bed contacts are erosional and vertical trends are difficult to ascertain. 246 \nHowever, it is apparent that the channelised, trough cross-bedded units tend to display 247 \na decrease in grain size (at least as coarse-tail fining) and scale of co-sets upward 248 \nfrom an erosive base (Figure 4d). Large outcrop surfaces reveal that the planar cross-249 \nbed sets display lateral migration directions that are typically at high angles to the 250 \nscooped-shaped bounding surfaces of the channels. Planar stratification and\/or finer-251 \ngrained facies occupy a stratigraphical position either in the topmost portions of the 252 \nflared margins of the channels or along the tops of planar cross-bed co-sets.   253 \nChannel orientations typically trend approximately east-west and the infilling 254 \ntrough cross-strata indicate overall sediment transport was generally to the east to 255 \nNNE (Figures 4b-d).  Only few channels are exposed in 3D; however, planar-cross 256 \nbedded strata at Carn Mor (Glencassley area) consistently indicate unidirectional 257 \npalaeo-currents to the east or NE (Figure 4c).   258 \n 259 \nSedimentological interpretation 260 \nThe A ‘Mhoine Formation consists of metamorphosed sandstones and pebbly 261 \nsandstones exhibiting a wide range of structures formed by bedload traction. The 262 \ngrain size distribution combined with the decimetre- to metre-scale trough and planar 263 \ncross-bed sets imply high flow velocities in channels deep enough to permit 264 \ndevelopment of metre-scale bedforms (i.e. dunes).  High flow velocities are also 265 \nindicated by (i) sigmoidal shaped foresets and the asymptotic toes of metre-scale 266 \ntrough cross-bed sets, (ii) the presence of flat stratification in coarse to pebbly grain 267 \nsizes (upper flow regime plane beds), (iii) the syn-depositional shearing that 268 \nsteepened or overturned metre-scale foresets and (iv) the overall coarse grain size of 269 \nthe psammites.  The channel-fills commonly display a sequence of sedimentary 270 \nCorrelation of Torridon and Morar groups \nPage 9 of 32 9\nstructures that decrease in scale, and fine upwards, indicating progressive channel 271 \nabandonment. The arrangement of channelised beds in nested and stacked units 272 \nseveral metres thick, which display fining upwards in both grain size and bedform 273 \nscale, is a characteristic facies of braided fluvial environments (Collinson 1996; Miall 274 \n1985, 1992). A fluvial setting is also supported by the unidirectional palaeocurrents 275 \ndisplayed by the planar and trough cross-beds which consistently show NNE-ENE 276 \ndirected sediment transport.   277 \nPlanar and trough cross-bedding orientated at high angles to the channel 278 \nmargins are interpreted as laterally accreting bars. By contrast, bedforms showing 279 \nmigration parallel to the trough and channel axes are interpreted as downstream-280 \nmigrating bars (e.g. Cant & Walker 1978; Miall 1992; Smith 1970).  These facies are 281 \narranged in 20 – 50 m thick packages in which coarser-grained, channelised and 282 \ntrough cross-bedded units dominate the lower portions, with planar stratified and 283 \nrelatively finer grained units (including thin semipelitic intervals) characterising the 284 \nupper parts. We interpret these decametre-scale patterns as recording lateral variation 285 \nbetween channelised braided fluves and bars, interfluve areas and intermittent more 286 \nwidespread sheetfloods.  287 \nThe A ‘Mhoine Formation lacks well-developed vertical grain size and 288 \nbedding thickness trends. This absence is typical for pre-land-plant braid plain 289 \nsettings (Schumm 1968; Cotter 1978). In contrast, metre to decametre-scale 290 \n‘cyclicity’ is what characterises parasequence development of shoreline and marine 291 \nshelf settings whether tide, storm or fluvial dominated (e.g. Johnson & Baldwin 1996; 292 \nReading & Collinson 1996; Walker & Plint 1992). In summary, the evidence indicates 293 \nthat the A ‘Mhoine Formation records fluvial deposition in a high-energy braided 294 \nfluvial setting. 295 \n 296 \nGeochemistry 297 \nWhole-rock and stream sediment geochemical data have been used to argue for and 298 \nagainst a correlation between the Moine and ‘Torridonian’ rocks (Kennedy 1951; 299 \nStone et al. 1999; Stewart 2002).  However, no modern whole-rock analyses are 300 \navailable for the A ‘Mhoine Formation in the study area.  A series of samples from 301 \nthe A ‘Mhoine Formation were collected for whole-rock geochemical analysis as part 302 \nof this project The samples come from a section from Glen Cassley to Carn nam Bò 303 \nMaola and represent c. 2 km of the stratigraphical succession (Figure 3, cross-section 304 \nCorrelation of Torridon and Morar groups \nPage 10 of 32 10\nB-B’); the data are presented in Table 1 and Figure 6 and discussed in more detail 305 \nbelow.  The samples plot as arkosic to sub-arkosic, with an overall trend to more sub-306 \narkosic (mature) compositions higher up in the stratigraphy (Figure 6).   The samples 307 \nindicate a mineralogical immaturity in accordance with the textural immaturity and 308 \nthe suggested fluvial depositional setting.   Overall there is remarkably little 309 \ngeochemical variation between the samples, attesting to the lithological monotony of 310 \nthe A ‘Mhoine Formation.  311 \n 312 \nDISCUSSION 313 \nCorrelating the A ‘Mhoine and Applecross-Aultbea formations  314 \nThe Torridon Group was deposited in a fluvial environment characterised by braided 315 \nrivers flowing from the west (Stewart 2002).  Since the Moine Thrust has an overall 316 \nWNW-directed transport direction, restoration of the thrust would place the Morar Group 317 \n‘downstream’ from the Torridon Group, so that a correlation between the two groups is a 318 \ndistinct possibility. We suggest a correlation between the Applecross\/Aultbea Formation 319 \n(Torridon Group) and the A ‘Mhoine Formation (Morar Group) as represented in the area 320 \nnorth of Glen Oykel (Figures 1, 3). 321 \n 322 \nGeneral position, lithology and sedimentology 323 \nThe Morar and Torridon groups both unconformably overlie Archaean – 324 \nPalaeoproterozoic basement of comparable age (Stewart 2002; Holdsworth et al. 1994; 325 \nKinny et al. 2005; Friend et al. in press).  Both sequences have a basal conglomeratic 326 \nfacies, together with siltstone\/pelite and sandstone\/psammite, which occurs intermittently 327 \nabove the unconformity.  Both sequences are several (>3 to 5 km) kilometres thick and 328 \nare typified by monotonous, coarse to very coarse (meta)sandstone with local pebble lags 329 \nand some finer grained sandstone and minor muddy\/pelitic layers becoming more 330 \nfrequent at higher stratigraphical levels. The two sequences lack marker horizons of 331 \ndifferent lithologies. 332 \nSedimentary structures in both the Applecross-Aultbea and A ‘Mhoine formations 333 \nare comparable in style, scale and frequency:  metre-thick cross-stratified beds, 334 \nunidirectional trough cross-bedding and nested channels 1-5 m deep.  Soft-sediment 335 \ndeformation structures are common and include metre-scale contorted bedding, 336 \noversteepened to overturned cross-beds, small-scale sag-structures involving heavy 337 \nmineral bands, and these structures are typically confined to single beds  (this study; 338 \nCorrelation of Torridon and Morar groups \nPage 11 of 32 11\nSelley et al. 1963; Selley 1969; Owen 1995; Nicholson, 1993; Williams, 1970, 2001; 339 \nStewart, 2002 for the Torridon Group). Both deposits are fluviatile, and were rapidly 340 \ndeposited in a high-energy, braid plain environment (this study; Williams 1969a; 341 \nNicholson 1993, Williams 2001; Stewart 2002).  342 \n 343 \nAge of deposition 344 \nThe youngest U-Pb age on detrital zircons from the A ‘Mhoine Formation, dated 345 \nat 1032 ± 32 Ma (Friend et al. 2003), is within error of the youngest detrital zircon ages 346 \nof 1060 ± 18 Ma and 1046 ± 26 in the Applecross and Aultbea formations respectively 347 \n(Rainbird et al. 2001). Rb\/Sr ages from mudstone from the Applecross Formation are 994 348 \n± 48 Ma and 977 ± 38 Ma and have been interpreted to date diagenesis (Turnbull et al. 349 \n1996).  The Glenfinnan and Loch Eil groups are intruded by the c. 870 Ma West 350 \nHighland Granite Gneiss Suite (Friend et al. 1997; Millar 1999) and this date is generally 351 \ntaken as the minimum age of Moine Supergroup.  Thus, deposition of the Torridon Group 352 \noccurred after ~1050 Ma and probably around c. 980 Ma, whilst deposition of the Morar 353 \nGroup occurred sometime between  ~1030 and ~870 Ma, so that the age constraints 354 \noverlap.  It is likely that both the Applecross\/Aultbea and the A ‘Mhoine Formations 355 \nwere deposited between c. 1000 and 950 Ma.  356 \n 357 \nDetrital zircon ages 358 \nDetrital zircon data from the Torridon, Morar and adjacent groups, obtained by Rainbird 359 \net al. (2001), Friend et al. (2003) and Cawood et al. (2004), are summarised in Figure 7. 360 \nThe detrital zircon age pattern of the A ‘Mhoine Formation (Friend et al. 2003) shows a 361 \nsharply defined dominant cluster at c. 1650 Ma, minor clusters at c. 1800 Ma and c. 1400 362 \nMa and a few analyses between 1400 and 1000 Ma. Additionally, c.8 % of analysed 363 \ngrains were Archaean in age. The detrital zircon age patterns of the Loch Eil and 364 \nGlenfinnan groups (Friend et al. 2003; Cawood et al. 2004) differ considerably from the 365 \nMorar Group pattern: most zircons are younger than c. 1500 Ma and there is no clearly 366 \ndefined 1650Ma cluster.  367 \nSimilarly, the detrital zircon age patterns of the Applecross Formation and the 368 \nAultbea Formation both show a sharply defined cluster at c. 1650 Ma and a smaller 369 \ncluster at c. 1800 Ma (Rainbird et al. 2001).  Some Archaean grains (25% and 15% 370 \nrespectively) occur, as well as a small, broad cluster between c. 1200 and 1000 Ma.  In 371 \ncontrast, the underlying Stoer Group shows a dominant Late Archaean detrital zircons 372 \nCorrelation of Torridon and Morar groups \nPage 12 of 32 12\npopulation (Figure 7f), with a peak at 2900 – 2700 Ma and the youngest zircon is c. 1740 373 \nMa (Rainbird et al. 2001).   374 \nOverall, the detrital zircon age patterns of the Morar and Torridon groups have 375 \nmore in common (including the same dominant peak at c. 1650 Ma) with each other than 376 \nwith the sequences with which they are normally associated.  377 \n  378 \nGeochemistry 379 \nStone et al. (1999) noted broad geochemical similarities between the ‘Torridonian’ and 380 \nthe Moine Supergroup, based on regional stream sediment geochemistry (Institute of 381 \nGeological Sciences, 1982).  In contrast, Stewart (2002) noted that boron concentrations 382 \nin stream sediment over the Moine are 2 – 5 times lower than in the Torridon Group, and 383 \ndiscounted a correlation on that basis.  However, boron is a highly mobile element and 384 \ncan be depleted by a factor of 2 or more during medium-grade metamorphism (Moran et 385 \nal. 1992).  Therefore, significant boron depletion can be expected in the Morar 386 \nmetasediments and boron (and other fluid-mobile elements) should not be used to 387 \ncompare and contrast unmetamorphosed and metamorphosed rocks.  Virtually all other 388 \nelements analysed for stream sediment geochemistry in Sutherland show very similar 389 \nvalues for the Torridon and Morar groups (Institute of Geological Sciences, 1982). 390 \n The analysed whole-rock geochemistry of the A ‘Mhoine Formation psammites 391 \nis compared in Table 1 with analyses from sandstones of the Applecross – Aultbea 392 \nformations (van de Kamp & Leake 1997; Stewart & Donellan 1992) and Sleat Group 393 \n(Stewart, 1991).    Generally, the arkosic Sleat Group rocks contain more Al, Fe, Ca and 394 \nNa, with concomitantly less Si; on the log (Fe2O3\/K2O) \/ log (SiO2\/Al2O3) plot (Herron, 395 \n1988) they plot close to the wacke field (Figure 6); these rocks are clearly less mature 396 \nthan the Morar and Torridon group rocks.  The A ‘Mhoine Formation and Torridon 397 \nGroup rocks are quite similar, and plot in overlapping fields (Figure 6).  The range of 398 \nSiO2, TiO2, Al2O3, Fe, MgO and K2O within the Morar samples overlaps with those from 399 \nthe Torridon, similarly so for most trace elements.    Calcium and strontium are both 400 \nhigher in the A ‘Mhoine Formation (Table 1); this would suggest a higher component of 401 \ncalcic over sodic and potassic feldspar in the detritus; alternatively albitisation may have 402 \nselectively affected the Torridon Group. The Torridon group sandstones are all arkosic, 403 \nwhilst some A ‘Mhoine Formation rocks are subarkosic.  Also, the Chemical Index of 404 \nAlteration (CIA = Al2O3 \/( Al2O3  +  CaO+ Na2O + K2O; Nesbitt & Young, 1982) is 405 \nsomewhat lower for the A ‘Mhoine Formation. Overall, the small differences between the 406 \nCorrelation of Torridon and Morar groups \nPage 13 of 32 13\nA ‘Mhoine Formation and the Applecross and Aultbea formation rocks can be well 407 \nexplained by better sorting and slightly higher maturity of the A ‘Mhoine Formation, as 408 \nthis tends to lower the CIA by removing more clay from the sand (Nesbitt et al. 1996). 409 \nBetter sorting is expected if the Morar Group was deposited farther downstream from the 410 \nTorridon Group. There are no significant differences between the geochemistry of the 411 \nApplecross, Aultbea and A ‘Mhoine formations, and geochemistry can certainly not be 412 \nused to discount a correlation (cf. Stewart 2002). Overall, we conclude that the 413 \nApplecross-Aultbea Formation and the A ‘Mhoine Formation can be correlated, without 414 \nmuch lateral variation, across the Moine Thrust.   415 \n 416 \nDetritus provenance 417 \nWilliams (2001) and Stewart (2002) suggested the Lewisian Gneiss Complex as a source 418 \narea for the Applecross Formation, whilst van de Kamp & Leake (1997) and Rainbird et 419 \nal. (2001) suggested the Grenville Orogen as the main source.   For the Moine 420 \nSupergroup as a whole, Friend et al. (2003) and Cawood et al. (2004, 2007) suggested a 421 \nmore general Laurentian provenance.  All suggested source areas lie to the west, 422 \nconsistent with the dominant palaeocurrent directions. 423 \nBroadly speaking, the Laurentia craton (and the Lewisian Gneiss) is dominated by 424 \nLate Archaean rocks with subordinate c. 2100 – 1800 Ma Palaeoproterozoic orogenic 425 \nbelts (e.g. Torngat, Trans-Hudson see Figure 8).  Only some of these belts produced 426 \njuvenile crust, others mainly reworked Archaean crust (Hoffman 1988), so that 427 \nPalaeoproterozoic felsic igneous rocks are relatively rare. A large belt of juvenile crust 428 \ndated between 1800 – 1700 Ma (Yavapai and Mazatzal Province and Ketilidian – 429 \nMakkovik belt) lies south and southwest of the Archaean craton.  In Labrador, abundant 430 \nMesoproterozoic anorogenic magmatism occurred between 1460 and 1420 Ma and 431 \nbetween 1350 and 1290 Ma (Nain Plutonic Suite).  Most of these latter plutons lie north 432 \nof the Grenville Front.   433 \nThe Grenville Orogen in North America comprises several Meso-434 \nPalaeoproterozoic terranes that were amalgamated, reworked and exhumed between 1100 435 \n– 950 Ma.  About 50% of the currently exposed rocks of the Eastern Grenville Orogen 436 \nare of igneous origin (Figure 8), but only a small proportion are syn-Grenville granitoids 437 \n(Gower et al. 1991; Rivers 1997 and Gower & Krogh 2002).  The bulk of the felsic 438 \nigneous rocks are older and include Pre-Labradorian 1780 – 1710 Ma granitic 439 \northogneisses and large volumes of Labradorian (1710 – 1600 Ma) calc-alkaline igneous 440 \nCorrelation of Torridon and Morar groups \nPage 14 of 32 14\nrocks in the northern part of the orogen.  The latter include the 600 km long, c. 1650 Ma 441 \nTrans-Labrador batholith.  In contrast, the southern part of the Grenville Orogen is 442 \ndominated by Pinwarian granitoid intrusions (1520 - 1460 Ma) and the Adirondian 443 \nanorthosite-mafic-granite suite (1200 – 1130 Ma).  In eastern Canada, the main Grenville 444 \norogenic activity spanned the period between 1080 and 970 Ma, whilst syn- to post-445 \norogenic granitic plutonism occurred between c. 1025 to 920 Ma.  Ar\/Ar cooling ages 446 \nsuggest significant uplift and erosion between 980 and 930 Ma (Haggart et al. 1993).   447 \nFrom the aerial extent of magmatic rocks, it is possible to predict in a qualitative 448 \nmanner what age ranges of detrital minerals would be expected from either the Grenville 449 \nOrogen or from Laurentia outwith the Grenville Belt, bearing in mind that high-level 450 \nparts of the orogen are missing, having already been unroofed.  Two such ‘predictive’ 451 \ndetrital mineral age patterns for the Grenville Orogen and the Laurentian cratonic interior 452 \nare shown in Figure 7g, h.   453 \nThe dominant c. 1650 Ma cluster of the Applecross, Aultbea and Morar zircons 454 \ncan be confidently linked to the Trans-Labradorian batholith (see also Rainbird et al. 455 \n2001), on the northern side within the Grenville orogen, (Figures 7, 8).  The ~1200 - 1000 456 \nMa cluster is derived from the Grenville orogen itself.  The c. 1800 Ma cluster in the 457 \nTorridon Group is most likely derived from the Ketilidian – Makkovik belt; it is highly 458 \nunlikely that they are derived from the ‘Laxfordian’ c. 1850 Ma intrusions within the 459 \nLewisian Complex since these intrusions are minor (<2 %) in aerial extent compared to 460 \nArchaean gneisses.   461 \nNoteworthy is also the scarcity (and absence in case of the Applecross Formation) 462 \nof zircons dated between 1600 and 1250 Ma.  Igneous rocks in this age bracket are 463 \ncommon in Labrador and Greenland in the foreland of the Grenville Orogen, but are rare 464 \nin the northern part of the orogen itself.  This would suggest that during deposition of the 465 \nbasins, the immediate foreland of the Grenville orogen was covered and not available as a 466 \nsource area (Figures 7,8; see also Cawood et al. 2004, 2007).  An exception is the small 467 \nc. 1450 Ma cluster in the A ‘Mhoine Formation.  If this cluster is significant it may 468 \ncorrelate with the Pinware terrane (see also Cawood et al. 2004), and relate to occasional 469 \nsouthward stream capture across a drainage divide in the Grenville orogen.    470 \nThe relatively minor, variable component of Archaean age argues against the 471 \nLewisian Gneiss or the Laurentain Craton as the main source.  Nevertheless, the 8 – 25% 472 \nArchaean grains must have come from the cratonic interior, as little or no Archaean 473 \nmaterial appears to be incorporated into the Grenville Orogen (Figures 7, 8).   In the 474 \nCorrelation of Torridon and Morar groups \nPage 15 of 32 15\nlowermost Applecross Formation, some Archaean grains may be of Lewisian origin 475 \nbecause the high (100-600m) palaeorelief means that Lewisian hills remained exposed 476 \nwhile the first few hundred metres of Applecross sandstones were being deposited.   477 \n Overall, the Grenville Orogen is likely to have provided the bulk of the detritus of 478 \nthe Torridon and Morar Group, with a small input from the Makkovikian-Ketilidian and 479 \nthe Archaean Laurentian Foreland.  A general Laurentian source outwith the Grenville 480 \nOrogen, let alone a Lewisian Gneiss source, is not compatible with the detrital zircon age 481 \npatterns (see also Cawood et al. 2004, 2007).  482 \n 483 \nBasin interpretation 484 \nIf the Morar and Torridon groups can be correlated and were deposited in the same 485 \nbasin, what was its setting? Previously, the Torridon and Morar groups have been 486 \ninterpreted as separate rift basins (Stewart 1982; Williams 2001; Stewart 2002 and 487 \nreferences therein; Soper et al. 1998) but this interpretation is problematic.   488 \n Rift sedimentation and subsidence is primarily controlled by episodic faulting 489 \nand basin subsidence. This results in alternating periods of quiescence and 490 \nprogradation of coarse clastic sediment into finer-grained and commonly lacustrine 491 \nbasinal settings. The net result is a stratigraphical framework replete with lateral and 492 \nvertical facies changes, e.g. the Tertiary extensional basins in the Death Valley region, 493 \nUSA (Wright & Troxel 1999), the Suez Rift (Jackson et al. 2006) and the Jurassic 494 \nbasins of the North Sea (Underhill 1998). In addition, volcanic, evaporitic and 495 \nlacustrine deposits are common in rift-basins. The Torridon and Morar groups exhibit 496 \nnone of these features.  In fact, few, if any rift basins (particularly half grabens) are 497 \ncharacterised by >5km vertically and >200 km horizontally similar siliciclastic 498 \nsediments (see also Nicholson, 1993; Prave 1999; Cawood et al. 2004).    499 \nThe detrital zircons show a distal, rather than proximal source.  Continental 500 \nrift-basins typically have a proximal source, with commonly a large age difference 501 \nbetween the youngest age of detritus and the onset of sedimentation (e.g. Stoer Group, 502 \nFigure 7f, Rainbird et al. 2001).   503 \nThe Minch Fault (Figure 1) has been invoked as a large-scale basin-bounding 504 \nfault to the suggested Torridon rift basin (Williams 1969b, 2001, Stewart 2002).  505 \nWilliams (1969b, 2001) argued that the Torridon Group consisted of a series of 506 \nalluvial megafans with their apexes near the Minch Fault.  Nicholson (1993), 507 \nhowever, showed that the palaeocurrents do not support such fans.  Moreover, the 508 \nCorrelation of Torridon and Morar groups \nPage 16 of 32 16\npebble content and the detrital zircon data do not match a detrital source in the Outer 509 \nHebrides (composed mainly of Archaean rocks).  Also, there is no evidence of syn-510 \ndepositional fault activity; nowhere along the basal Torridon unconformity, well 511 \nexposed over several hundred kilometres, is there evidence for syn-Applecross-512 \nFormation extensional faults.   513 \nThe abundance of soft-sedimentation deformation in the Torridon Group has 514 \nalso been used to argue for frequent seismic activity and hence rifting.  However, 515 \nconvolute bedding can be generated without seismicity by bed liquidisation during 516 \nrapid deposition of water-saturated sand - in combination with a high water table 517 \n(Selley et al. 1963; Selley 1969; Williams 1970; Nicholson 1993; Owen 1995; 518 \nWilliams 2001).  The lack of terrestrial vegetation during the Neoproterozoic would 519 \nhave exacerbated such conditions (e.g. Eriksson et al. 2001). 520 \n Nicholson (1993) and Cawood et al. (2004) suggested an intracratonic basin 521 \nsetting for the Torridon Group and Moine Supergroup, respectively. Intracratonic 522 \nbasins, however, are typically long-lived and slowly subsiding, are sensitive to 523 \nenvironmental change and hence contain significant vertical facies changes, the 524 \nNeoproterozoic to Palaeozoic Taoudeni Basin (West Africa) being a good example 525 \n(Bertrand-Sarfati et al. 1991).  A major problem, therefore, is to provide sufficient 526 \naccommodation space for rapid deposition of a 5 km of laterally and vertically 527 \nuniform siliciclastic succession.  528 \n  529 \nForeland Basin setting 530 \nIn contrast, there is a growing body of work that suggests that the Torridon Group was 531 \ndeposited as a non-marine molasse, in a foreland basin setting (Rainbird et al., 2001; 532 \nKinnaird et al., 2007). This model explains the distal provenance of the detrital 533 \nzircons analysed from the Torridon Group. Deposition in a trunk river system in an 534 \naxial, orogen-parallel foreland-basin setting, best explains the features observed in 535 \nboth the Applecross-Aultbea and A ‘Mhoine formations. The envisaged basin would 536 \nbe analogous to the modern-day Ganges basin, in that the preserved part of the basin 537 \nwould have been deposited in a braided river system flowing in front of, and generally 538 \nparallel to, the orogen.  The position of the Grenville Orogen to the south (present-day 539 \norientation), and the easterly to north-northeasterly directed palaeocurrents fit such a 540 \npalaeogeography.  An orogen-parallel foreland-basin setting is further supported by: 541 \nCorrelation of Torridon and Morar groups \nPage 17 of 32 17\n1) Age. Accepting that the age of deposition of the Applecross-Aultbea and A 542 \n‘Mhoine formations is broadly equivalent, then the constraint for their deposition 543 \nat between c. 1000 and 950 Ma overlaps with the last stages of the Grenville 544 \nOrogeny.  The intrusion of late-orogenic granites, decompression metamorphism 545 \nand metamorphic cooling in the Grenville Orogen all occurred between 1025 – 546 \n950 Ma (e.g. Gower et al. 1991; Haggart et al. 1993; Gower & Krogh 2002; Cox 547 \net al. 2002); such processes are generally accompanied by overall unroofing of 548 \nthe orogen, resulting in the formation of an approximately coeval foreland basin.   549 \n2) Sedimentology. The Applecross-Aultbea and A ‘Mhoine Formations comprise a 550 \nc. 5 km thick sequence of alluvial-fluvial siliciclastic rocks deposited in a wide 551 \nbraid plain system.  The basin was characterised by large, relatively deep rivers, 552 \nhigh peak run-off and rapid deposition.  Rapid deposition of a thick sequence 553 \nrequires rapid, sustained subsidence.  These are features typical for molasse-type 554 \nforeland basin (e.g. Pfiffner 1986).  Foreland basins typically have subsidence 555 \nrates 3 – 10 times faster than most rift basins, and can achieve 2-3 km of 556 \nsubsidence in less than 10 Ma (e.g. Homewood et al. 1986); this provides a good 557 \nexplanation for the deposition of a great thickness of high-energy clastic 558 \nsediments over a wide area. 559 \n3)  Provenance. The detrital zircon age patterns suggest that the Grenville Orogen 560 \nwas the main source of detritus; this detritus comprises both syn-orogenic and 561 \npre-orogenic material uplifted in the orogen (e.g. the c. 1650 Ma cluster).  Such a 562 \ncombination of syn-orogenic and pre-orogenic material is common in foreland 563 \nbasins, as shown by Hercynian and Alpine detrital micas in the North Alpine 564 \nForeland Basin (von Eynatten & Wijbrans 2003). Orogen-parallel foreland basins 565 \nhave a fore-bulge, so that part of the drainage and hence a minor component of 566 \nthe detritus originate from the cratonic interior.  This is consistent with the 567 \nvariable amount of c. 1800 Ma and Archaean grains present in the successions; 568 \nthis detritus most likely originated from the area north of the Grenville orogen, 569 \ne.g. Ketilidian and cratonic parts of Laurentia.    570 \n 571 \nMany foreland basins show an evolution from deep-water clastic sedimentation (‘flysch’) 572 \nduring early orogenesis, followed by shallow marine and finally non-marine (‘molasse’) 573 \nsedimentation (e.g. Pfiffner 1986; Miall 1995). The earliest sediments are commonly 574 \ncaught up in foreland-propagating thrust systems and are uplifted and eroded, thus having 575 \nCorrelation of Torridon and Morar groups \nPage 18 of 32 18\na low preservation potential.  The younger and shallower ‘molasse’ sediment onlap far 576 \nonto the foreland and parts of this ‘molasse’ system may thus escape subsequent 577 \nthrusting, uplift and erosion.  It is this part of the foreland basin system that is preserved 578 \nin the Morar and Torridon groups.  The 1080 – 1050 Ma Flinton Group in Eastern 579 \nOntario, Canada, may represent earlier, more varied and partially marine foreland basin 580 \nrocks caught up in the Grenville orogen (Moore & Thompson 1980), but similar rocks 581 \nappear not to be present in Scotland.  582 \n 583 \nDisplacement on the Moine Thrust 584 \nThe Moine Thrust separates the Torridon and Morar groups, and the displacement 585 \nalong this major structure must be taken into account for their correlation or 586 \notherwise. The total displacement of the Moine Thrust Zone as a whole is generally 587 \nassumed to be greater than 100 km (Strachan et al. 2002).  However, Torridon Group 588 \nrocks occur in the highest thrust sheets, so that the Torridon basin must have extended 589 \nconsiderably farther east with respect to the Foreland.  590 \nConsequently, it is only the Moine Thrust itself and its associated mylonites 591 \nthat truly separate the Torridon and Morar groups.  The total displacement taken up 592 \nby these structures is difficult to constrain.  It is more than 20 km, as evidenced by the 593 \ndown-faulted block of Moine Mylonites at Faraid Head (Peach et al. 1907) and must 594 \nbe sufficient to have emplaced medium-grade metamorphic rocks over 595 \nunmetamorphosed rocks.  A reasonable estimate is probably c. 100 km.  596 \nThe broadly eastward palaeocurrents in the sediments are approximately co-597 \naxial to the WNW-directed thrust transport direction and there is no evidence for 598 \nmajor (>100 km) strike slip movement along the Moine Thrust or its trace.  Therefore 599 \nthe simplest original relationship between the Torridon and Morar Group is that the 600 \nlatter was deposited some 100 – 200 km downstream from the former.  Such a 601 \ndistance is in fact very small for braided river systems in sedimentary basins, which 602 \ncan easily measure >1000 km along their axis of flow, as seen in both ancient and 603 \nmodern examples (e.g. Bridge 2003; Smith & Rogers 1999).    604 \n 605 \nRegional implications  606 \nWe have shown that the Applecross-Aultbea formations and the A ‘Mhoine 607 \nFormation are correlative parts of the same sequence, simply repeated by the Moine 608 \nThrust.  This invalidates the formal distinction between the Torridon Group and the 609 \nCorrelation of Torridon and Morar groups \nPage 19 of 32 19\nMorar Group and hence the Moine Supergroup (cf. Holdsworth et al. 1994; Trewin 610 \n2002), and implies that the Proterozoic stratigraphical framework in Scotland needs to 611 \nbe revised.  One solution is to include the Torridon Group into the Moine Supergroup, 612 \nbut abandon the term Morar Group.  Alternatively, the term ‘Moine Supergroup’ 613 \ncould be abandoned, and the A ‘Mhoine Formation included in the Torridon Group, 614 \nas the latter is better exposed.   615 \nCorrelations farther south in the Skye, Morar and Knoydart areas are also 616 \nlikely, but their details require further study, partially because the stratigraphy of both 617 \nthe ‘Torridonian’ and the Morar Group in these areas is more diverse (Ramsay & 618 \nSpring, 1962; Sutton & Watson 1964; Holdsworth et al. 1994; Stewart 2002).  Sutton 619 \n& Watson (1964) proposed the correlation Sleat Group = lower Morar Group and 620 \nTorridon Group = upper Morar Group (Figure 2); this proposal deserves renewed 621 \nattention.  Furthermore, it is unclear whether the A ‘Mhoine Formation correlates 622 \nsouthward with the Upper or the Lower Morar Psammite Formation in Morar, since 623 \nthe intervening ground has never been mapped in detail. It is prudent to await the 624 \noutcomes of further studies before erecting a revised stratigraphy in Scotland, while 625 \nnoting that the current framework is unsatisfactory.  626 \nIn addition, the ‘Hebridean Terrane’ and the ‘Northern Highlands Terrane’ 627 \n(Bluck et al. 1992) share much of their pre- and post-Caledonian evolution and should 628 \nbe regarded as parautochthonous, and not as exotic to each other (Bluck et al. 1997; 629 \nOliver 2002).  The Moine Thrust is better regarded as the Caledonian orogenic front, 630 \nrather than a significant terrane boundary.  631 \n 632 \nCONCLUSIONS 633 \n 634 \nThe A ‘Mhoine Formation (Morar Group) in the Northern Highlands is characterised 635 \nby c. 5 km of uniform psammite, devoid of marker horizons, and was deposited in a 636 \nhigh-energy fluvial environment characterised by braided rivers flowing from the 637 \nwest.  The A ‘Mhoine Formation and the Applecross-Aultbea Formation (Torridon 638 \nGroup) are similar in terms of their age of deposition, sedimentology, stratigraphical 639 \nposition, geochemistry, detrital zircon age pattern, age constraints and overall 640 \nsediment transport direction. The detrital zircon distributions in both groups show that 641 \nthey share a similar, distal source, namely parts of the Grenville Orogen, the final 642 \nstages of which overlap the age of deposition.  It is therefore concluded that the 643 \nCorrelation of Torridon and Morar groups \nPage 20 of 32 20\nApplecross-Aultbea and the A ‘Mhoine formations are direct correlatives and formed 644 \npart of an axial trunk fluvial system flowing in front of the Grenville Orogen, forming 645 \nan orogen-parallel foreland basin.  This reinterpretation implies that the currently 646 \naccepted Proterozoic stratigraphical framework for the Scottish Highlands is in need 647 \nof revision. The two groups should be regarded as parautochthonous 648 \n 649 \n 650 \nAcknowledgements 651 \nBGS-UCAC PhD funding (Project 2K02E020) for David Cheer is gratefully 652 \nacknowledged.  Martin Smith, Graham Leslie, Phil Stone, John Mendum, Kathryn 653 \nGoodenough and Chris Thomas are thanked for comments and discussions.  Clark Friend, 654 \nTony Harris and two anonymous reviewers are thanked for their detailed and incisive 655 \nreviews.  This article is published with the permission of the Executive Director of the 656 \nBritish Geological Survey. 657 \n 658 \nCorrelation of Torridon and Morar groups \nPage 21 of 32 21\nReferences 659 \n 660 \nBarr, D., Holdsworth, R. E. & Roberts, A. M. 1986. Caledonian ductile thrusting in a 661 \nPrecambrian metamorphic complex: the Moine of NW Scotland. Bulletin of 662 \nthe Geological Society of America, 97, 754-764. 663 \nBertrand-Sarfati, J., Moussine-Pouchkine, A., Affaton, P., Trompette, R. & Bellion, 664 \nY. 1991. Cover sequences of the West African craton. In: Dallmeyer, R. D. & 665 \nLecorche, J. P. (eds). The West African orogens and circum-Atlantic 666 \ncorrelatives.   Springer Verlag, Berlin, p. 65-84. 667 \nBluck, B. J., Dempster, T. J. & Rogers, G. 1997. Allochthonous metamorphic blocks 668 \non the Hebridean passive margin, Scotland. Journal of the Geological Society 669 \nof London, 154, 921-924. 670 \nBluck, B. J., Gibbons, W. & Ingham, J. K. 1992. Terranes. In: Cope, J. C. W., 671 \nIngham, J. K. & Rawson, P. F. (eds). Atlas of palaeogeography and 672 \nlithofacies. Geological Society Memoir, 13, 3-4. 673 \nBridge, J. S. 2003. Rivers and Floodplains: Forms, Processes, and Sedimentary 674 \nRecord. Blackwell, London. 504 p. 675 \nBritish Geological Survey, 1989a.  Great Glen, Sheet 57° - 06°, 1:250 000 Series, 676 \nSolid Geology. British Geological Survey, Keyworth, Nottingham. 677 \nBritish Geological Survey, 1989b.  Sutherland, Sheet 58° - 06°, 1:250 000 Series, 678 \nSolid Geology. British Geological Survey, Keyworth, Nottingham. 679 \nButler, R. W. H. & Coward, M. P. 1984. Geological constraints, structural evolution 680 \nand deep geology of the NW Scottish Caledonides. Tectonics, 3, 347-365. 681 \nButler, R. W. H. 1997. Late Proterozoic rift faults and basement-cover relationships 682 \nwithin the Ben More thrust sheet, NW Scotland. Journal of the Geological 683 \nSociety of London, 154, 761-764. 684 \nCant, D. J. & Walker, R. G. 1978. Fluvial processes and facies sequences in the sandy 685 \nbraided South Saskatchewan River, Canada. Sedimentology, 25, 625-648. 686 \nCawood, P. A., Nemchin, A. A., Strachan, R., Kinny, P. & Loewy, S. 2004. 687 \nLaurentian provenance and an intracratonic tectonic setting for the Moine 688 \nSupergroup, Scotland, constrained by detrital zircons from the Loch Eil and 689 \nGlen Urquhart successions. Journal of the Geological Society of London, 161, 690 \n861-874. 691 \nCorrelation of Torridon and Morar groups \nPage 22 of 32 22\nCawood, P. A., Nemchin, A. A., Strachan, R., Prave, A. & Krabbendam, M. 2007. 692 \nSedimentary basin and detrital zircon record along East Laurentia and Baltica 693 \nduring assembly and breakup of Rodinia. Journal of the Geological Society of 694 \nLondon. 164, 257-275 695 \nCheer, D. A. 2006. The sedimentary, structural and igneous geology of the Moine 696 \nThrust Zone and Moine Nappe in the Ben Hee area, NW Scotland.  697 \nUnpublished PhD thesis, University of St Andrews. 698 \nCollinson, J. D. 1996. Alluvial sediments. In: Reading, H. G. (eds). Sedimentary 699 \nenvironments: processes, facies and stratigraphy.   Blackwell Science, 700 \nOxford, 37-82. 701 \nCotter, E. 1978. The evolution of sedimentary style, with special reference to the 702 \ncentral Appalachian Paleozoic. In: Miall, A. D. (eds). Fluvial Sedimentology. 703 \nMemoir, Canadian Society of Petroleum Geology, 5, 361-383. 704 \nCox, R. A., Indares, A. & Dunning, G. R. 2002. Temperature-time paths in the high-P 705 \nManicouagan imbricate zone, eastern Grenville Province; evidence for two 706 \nmetamorphic events. Precambrian Research, 117, 225-250. 707 \nElliott, D. & Johnson, M. R. W. 1980. Structural evolution in the northern part of the 708 \nMoine thrust belt, NW Scotland. Transactions of the Royal Society of 709 \nEdinburgh: Earth Sciences, 71, 69-96. 710 \nEriksson, P. G., Martins-Neto, M. A., Nelson, D. R., Aspler, L. B., Chiarenzelli, J. R., 711 \nCatuneanu, O., Sarkar, S., W, A. & Rautenbach, C. J. d. W. 2001. An 712 \nintroduction to Precambrian basins; their characteristics and genesis. 713 \nSedimentary Geology, 141-142, 1-35. 714 \nFriend, C. R. L., Kinny, P. D., Rogers, G., Strachan, R. A. & Patterson, B. A. 1997. 715 \nU-Pb zircon geochronological evidence for Neoproterozoic events in the 716 \nGlenfinnan Group (Moine Supergroup): the formation of the Ardgour granite 717 \ngneiss, north-west Scotland. Contributions to Mineralogy and Petrology, 128, 718 \n101-113. 719 \nFriend, C. R. L., Strachan, R. A., Kinny, P. D. & Watt, G. R. 2003. Provenance of the 720 \nMoine Supergroup of NW Scotland; evidence from geochronology of detrital 721 \nand inherited zircons from (meta)sedimentary rocks, granites and migmatites. 722 \nJournal of the Geological Society of London, 160, 247-257. 723 \nFriend, C. R. L., Strachan, R. A. & Kinny, P. D. 2007. U-Pb SHRIMP dating of 724 \nbasement inliers within the Moine Supergroup, Scottish Caledonides: 725 \nCorrelation of Torridon and Morar groups \nPage 23 of 32 23\nimplications of Archaean protolith ages. Journal of the Geological Society of 726 \nLondon. 727 \nFroude, D. O., Ireland, T. R., Kinny, P. D., Williams, I. S., Compston, W., Williams, 728 \nI. R. & Myers, J. S. 1983. Ion microprobe identification of 4,100-4,200-Myr-729 \nold terrestrial zircons. Nature, 304, 616-618. 730 \nGibbons, W. & Harris, A. L. 1994. A revised correlation of Precambrian rocks in the 731 \nBritish Isles. The Geological Society , Special Report, 22. 732 \nGlendinning, N. R. W. 1988. Sedimentary structures and sequences within a late 733 \nProterozoic tidal shelf deposit; the upper Morar Psammite Formation of 734 \nnorthwestern Scotland. In: Winchester, J. A. (eds). Later Proterozoic 735 \nstratigraphy of the Northern Atlantic Regions.   Blackie, Glasgow and 736 \nLondon, 17-31. 737 \nGower, C. F., Heaman, L. M., Loveridge, W. D., Schaerer, U. & Tucker, R. D. 1991. 738 \nGrenvillian magmatism in the eastern Grenville Province, Canada. 739 \nPrecambrian Research, 51, 315-336. 740 \nGower, C. F. & Krogh, T. E. 2002. A U-Pb geochronological review of the 741 \nProterozoic history of the eastern Grenville Province. Canadian Journal of 742 \nEarth Sciences, 39, 795-829. 743 \nGracie, A. J. & Stewart, A. D. 1967. Torridonian sediments at Enard Bay, Ross-shire. 744 \nScottish Journal of Geology, 3, 181-194. 745 \nHaggart, M. J., Jamieson, R. A., Reynolds, P. H., Krogh, T. E., Beaumont, C. & 746 \nCulshaw, N. G. 1993. Last gasp of the Grenville Orogeny; thermochronology 747 \nof the Grenville Front tectonic zone near Killarney, Ontario. Journal of 748 \nGeology, 101, 575-589. 749 \nHerron, M. M. 1988. Geochemical classification of terrigenous sands and shales from 750 \ncore or log data. Journal of Sedimentary Petrology, 58, 820-829. 751 \nHoffman, P. F. 1988. United Plates of America, the birth of a Craton: Early 752 \nProterozoic assembly and growth of Laurentia. Annual Review of Earth and 753 \nPlanetary Science, 16, 543-603. 754 \nHoldsworth, R. E., Harris, A. L. & Roberts, A. M. 1987. The stratigraphy, structure 755 \nand regional significance of  the Moine Rocks of Mull, Argyllshire, W. 756 \nScotland. Geological Journal, 22, 83-107. 757 \nHoldsworth, R. E., Strachan, R. A. & Harris, A. L. 1994. The Moine Supergroup. In: 758 \nGibbons, W. & Harris, A. L. (eds). A Revised Correlation of Precambrian 759 \nCorrelation of Torridon and Morar groups \nPage 24 of 32 24\nrocks in the British Isles. Geological Society of London Special Report, 22, 760 \n23-32. 761 \nHoldsworth, R. E., Strachan, R. & Alsop, G. I. 2001. Solid geology of the Tongue 762 \ndistrict; Memoir for 1:50 000 Geological Sheet 114 E (Scotland), British 763 \nGeological Survey, Keyworth, Nottingham. 764 \nHomewood, P., Allen, P. A. & Williams, G. D. 1986. Dynamics of the Molasse Basin 765 \nof western Switzerland. In: Allen, P. A. & Homewood, P. (eds). Foreland 766 \nbasins. International Association of Sedimentologists Special Publication, 8, 767 \n199-217. 768 \nInstitute of Geological Sciences. 1982. Regional geochemical atlas: Sutherland, 769 \nInstitute of Geological Sciences, London. 770 \nJackson, C. A. L., Gawthorpe, R. L., Leppard, C. W. & Sharp, I. R. 2006. Rift-771 \ninitiation development of normal fault blocks; insights from the Hammam 772 \nFaraun fault block, Suez Rift, Egypt  Journal of the Geological Society of 773 \nLondon, 163, 165-183. 774 \nJohnson, H. D. & Baldwin, C. T. 1996. Shallow siliciclastic seas. In: Reading, H. G. 775 \n(eds). Sedimentary environments: Processes, facies, environments.   Blackwell 776 \nScience, Oxford, 232-280. 777 \nJohnstone, G. S., Smith, D. I. & Harris, A. L. 1969. The Moinian Assemblage of 778 \nScotland. In: Kay, M. (eds). North Atlantic Geology and Continental Drift: a 779 \nSymposium. American Association of Petroleum Geologists Memoir, 12, 159-780 \n180. 781 \nKennedy, W. Q. 1951. Sedimentary differentiation as a factor in the Moine-782 \nTorridonian correlation. Geological Magazine, 88, 257-266. 783 \nKinnaird, T. C., Prave, A. R., Kirkland, C. L., Horstwood, M., Parrish, R. R. & 784 \nBatchelor, R. A. in press. The late Mesoproterozoic - early Neoproterozoic 785 \nevolution of northwest Scotland: the Torridonian revisited. Journal of the 786 \nGeological Society of London. 164, 541-551 787 \nKinny, P. D., Friend, C. R. L. & Love, G. J. 2005. Proposal for a terrane-based 788 \nnomenclature for the Lewisian Gneiss Complex of NW Scotland. Journal of 789 \nthe Geological Society of London, 162, 175-186. 790 \nKrabbendam, M. & Leslie, A. G. 2004. Lateral ramps and thrust terminations: an 791 \nexample from the Moine Thrust Zone, NW Scotland. Journal of the 792 \nGeological Society of London, 161, 551-554. 793 \nCorrelation of Torridon and Morar groups \nPage 25 of 32 25\nMendum, J. R. 1976. A strain study of the Strathan Conglomerate, North Scotland. 794 \nScottish Journal of Geology, 12, 135-146. 795 \nMiall, A. D. 1985. Architectural-element analysis: a new method of facies analysis 796 \napplied to fluvial deposits. Earth Science Reviews, 22, 261-308. 797 \nMiall, A. D. 1992. Alluvial deposits. In: Walker, R. G. & James, N. P. (eds). Facies 798 \nModels, Response to sea level change. GeoText 1, Geological Association of 799 \nCanada, St John’s, 119-142. 800 \nMiall, A. D. 1995. Collision-related foreland basins. In: Busby, C. J. & Ingersoll, R. 801 \nV. (eds). Tectonics of sedimentary basins. Blackwells, 393-424. 802 \nMillar, I. L. 1999. Neoproterozoic extensional basic magmatism associated with the 803 \nWest Highland granite gneiss in the Moine Supergroup of NW Scotland. 804 \nJournal of the Geological Society of London, 156, 1153-1162. 805 \nMoore, J. M. J. & Thompson, P. H. 1980. The Flinton Group; a late Precambrian 806 \nmetasedimentary succession in the Grenville Province of eastern Ontario. 807 \nCanadian Journal of Earth Sciences, 17, 1685-1707. 808 \nMoran, A. E., Sisson, V. B. & Leeman, W. P. 1992. Boron depletion during 809 \nprogressive metamorphism; implications for subduction processes. Earth and 810 \nPlanetary Science Letters, 111, 331-349. 811 \nNelson, D. R. 2001. An assessment of the determination of depositional ages for 812 \nPrecambrian clastic sedimentary rocks by U-Pb dating of detrital zircons. 813 \nSedimentary Geology, 141-142, 37-60. 814 \nNesbitt, H. W. & Young, G. M. 1982. Early Proterozoic climates and plate motions 815 \ninferred from major element chemistry of lutites. Nature, 299, 715-717. 816 \nNesbitt, H. W., Young, G. M., McLennan, S. M. & Keays, R. R. 1996.  Effects of 817 \nchemical weathering and sorting on the petrogenesis of siliciclastic sediments, 818 \nwith implications for provenance studies. Journal of Geology, 104, 525-542. 819 \nNicholson, P. G. 1993. A basin reappraisal of the Proterozoic Torridon Group, 820 \nnorthwest Scotland. In: Frostick, L. E. & Steel, R. J. (eds). Tectonic controls 821 \nand signatures in sedimentary successions. International Association of 822 \nSedimentologists Special Publication, 20, 183-202. 823 \nOliver, G. J. H. 2002. Chronology and terrane assembly, new and old controversies. 824 \nIn: Trewin, N. H. (eds). The Geology of Scotland.   The Geological Society, 825 \nLondon, 201-211. 826 \nCorrelation of Torridon and Morar groups \nPage 26 of 32 26\nOwen, G. 1995. Soft-sediment deformation in upper Proterozoic Torridonian 827 \nsandstones (Applecross Formation) at Torridon, northwest Scotland. Journal 828 \nof Sedimentary Research, A65, 495-504. 829 \nPeach, B. N., Horne, J., Gunn, W., Clough, C. T., Hinxman, L. W. & Teall, J. J. H. 830 \n1907. The geological structure of the North-West Highlands of Scotland. 831 \nMemoirs of the Geological Survey of Great Britain. 832 \nPeach, B. N., Horne, J., Woodward, H. B., Clough, C. T., Harker, A. & Webb, C. B. 833 \n1910. The geology of Glenelg, Lochalsh and South East part of Skye - 834 \nExplanation of one-inch map 71. Memoir of the Geological Survey - Scotland. 835 \nPeach, B. N., Horne, J., Hinxman, L. W., Crampton, M. B., Anderson, E. M. & 836 \nCarruthers, R. G. 1913. The geology of Central Ross-shire - Explanation of 837 \nSheet 82. Memoir of the Geological Survey - Scotland. 838 \nPeach, B. N. & Horne, J. 1930. Chapters on the geology of Scotland, Oxford 839 \nUniversity Press, London. 840 \nPfiffner, O. A. 1986. Evolution of the North Alpine foreland basin in the Central 841 \nAlps. In: Allen, P. A. & Homewood, P. (eds). Foreland basins. Internationial 842 \nAssociation of Sedimentologists Special Publication, 8, 219-228. 843 \nPrave, A.R. 1999. The Neoproterozoic Dalradian Supergroup of Scotland: an 844 \nalternative hypothesis. Geological Magazine. 136. 609-617. 845 \nRainbird, R. H., Hamilton, M. A. & Young, G. M. 2001. Detrital zircon 846 \ngeochronology and provenance of the Torridonian, NW Scotland. Journal of 847 \nthe Geological Society of London, 158, 15-27. 848 \nRamsay, J. G. 1957a. Superimposed folding at Loch Monar, Inverness-shire and 849 \nRoss-shire. Quarterly Journal of the Geological Society of London, 113, 271-850 \n308. 851 \nRamsay, J. G. 1957b. Moine-Lewisian relations at Glenelg, Inverness-shire. Quarterly 852 \nJournal of the Geological Society of London, 113, 487-523. 853 \nRamsay, J. G. & Spring, J. 1962. Moine stratigraphy in the Western Highlands of 854 \nScotland. Proceedings of the Geologists' Association, 73, 295-326. 855 \nReading, H. G. & Collinson, J. D. 1996. Clastic coasts. In: Reading, H. G. (eds). 856 \nSedimentary environments: processes, facies and stratigraphy, Blackwell 857 \nScience, Oxford, 154-231. 858 \nRivers, T. 1997. Lithotectonic elements of the Grenville Province; review and tectonic 859 \nimplications. Precambrian Research, 86, 117-154. 860 \nCorrelation of Torridon and Morar groups \nPage 27 of 32 27\nRoberts, A. M., Strachan, R. A., Harris, A. L., Barr, D. & Holdsworth, R. E. 1987. 861 \nThe Sgurr Beag nappe:  a reassessment of the stratigraphy and structure of the 862 \nnorthern Highland Moine. Bulletin of the Geological Society of America, 98, 863 \n497-506. 864 \nSchumm, S. A. 1968. Speculations concerning paleohydrologic controls of terrestrial 865 \nsedimentation. Geological Society America Bulletin, 79, 1573-1588. 866 \nSelley, R. C. 1969. Torridonian alluvium and quicksands. Scottish Journal of 867 \nGeology, 5, 328-346. 868 \nSelley, R. C., Shearman, D. H., Sutton, J. & Watson, J. V. 1963. Some underwater 869 \ndisturbances in the Torridonian of Skye and Raasay. Geological Magazine, 870 \n100, 224-243. 871 \nSmith, N. D. 1970. The braided stream depositional environment: comparison of the 872 \nPlatte River with some Silurian clastic rocks, north central Appalachians. 873 \nGeological Society America Bulletin, 81, 2993-3014. 874 \nSmith, N. D. & Rogers, J. D. (eds). 1999. Fluvial Sedimentology IV. International 875 \nAssociation of Sedimentologists Special Publication 28, Blackwell, London. 876 \n488 p. 877 \nSoper, N. J., Harris, A. L. & Strachan, R. A. 1998. Tectonostratigraphy of the Moine 878 \nSupergroup; a synthesis. Journal of the Geological Society of London, 155, 879 \n13-24. 880 \nStewart, A. D. 1972. Pre-Cambrian landscapes in northwest Scotland. Geological 881 \nJournal, 8, 111-124. 882 \nStewart, A. D. 1982. Late Proterozoic rifting in NW Scotland: the genesis of the 883 \n'Torridonian'. Journal of the Geological Society of London, 139, 413-420. 884 \nStewart, A. D. 1988. The Sleat and Torridon Groups. In: Winchester, J. A. (eds). 885 \nLater Proterozoic stratigraphy of the northern Atlantic regions.   Blackie, 886 \nGlasgow, 104-112. 887 \nStewart, A. D. 1991. Geochemistry, provenance and palaeoclimate of the Sleat and 888 \nTorridon Groups in Skye. Scottish Journal of Geology, 27, 81-95. 889 \nStewart, A. D. 2002. The later Proterozoic Torridonian rocks of Scotland: their 890 \nsedimentology, geochemistry and origin. Geological Society Memoir, 24. 891 \nStewart, A. D. & Donnellan, N. C. B. 1992. Geochemistry and provenance of red 892 \nsandstones in the Upper Proterozoic Torridon Group of Scotland. Scottish 893 \nJournal of Geology, 28, 143-153. 894 \nCorrelation of Torridon and Morar groups \nPage 28 of 32 28\nStone, P., Plant, J. A., Mendum, J. R. & Green, P. M. 1999. A regional geochemical 895 \nassessment of some terrane relationships in the British Caledonides. Scottish 896 \nJournal of Geology, 35, 145-156. 897 \nStrachan, R. A. 1986. Shallow-marine sedimentation in the Proterozoic Moine 898 \nSuccession, Northern Scotland. Precambrian Research, 32, 17-33. 899 \nStrachan, R., Smith, M., Harris, A. L. & Fettes, D. J. 2002. The Northern Highland 900 \nand Grampian terranes. In: Trewin, N. H. (eds). The Geology of Scotland.   901 \nThe Geological Society, London, 81-147. 902 \nSutton, J. & Watson, J. 1964. Some aspects of Torridonian stratigraphy in Skye. 903 \nProceedings of the Geologists' Association, 75, 251-289. 904 \nTanner, P.W.G. & Bluck, B.J. 1999. Current Controversies in the Caledonides. 905 \nJournal of the Geological Society, 156, 1137-1141. 906 \nTrewin, N. H. 2002. The Geology of Scotland The Geological Society of London, 907 \nLondon. 908 \nTurnbull, M. J. M., Whitehouse, M. J. & Moorbath, S. 1996. New isotopic age 909 \ndeterminations for the Torridonian, NW Scotland. Journal of the Geological 910 \nSociety of London, 153, 955-964. 911 \nUnderhill, J. R. 1998. Jurassic. In: Glennie, K. W. (ed). Petroleum Geology of the 912 \nNorth Sea: Basic Concepts and Recent Advances. Blackwell, London, 245-913 \n293. 914 \nVan de Kamp, P. C. & Leake, B. E. 1997. Mineralogy, geochemistry, provenance and 915 \nsodium metasomatism of Torridonian rift basin clastic rocks, NW Scotland. 916 \nScottish Journal of Geology, 33, 105-124. 917 \nVon Eynatten, H. & Wijbrans, J. R. 2003. Precise tracing of exhumation and 918 \nprovenance using 40Ar\/ 39Ar geochronology of detrital white mica; the 919 \nexample of the Central Alps. In: McCann, T. & Saintot, A. (eds). Tracing 920 \ntectonic deformation using the sediment record. Geological Society Special 921 \nPublication, 208, 289-305. 922 \nWalker, R. G. & Plint, A. G. 1992. Wave- and storm-dominated shallow marine 923 \nsystems. In: Walker, R. G. & James, N. P. (eds). Facies Models, Response to 924 \nsea level change. GeoText 1, Geological Association of Canada, St John’s, 925 \n219-238. 926 \nWilliams, G. E. 1969a. Characteristics and origin of a Precambrian pediment. Journal 927 \nof Geology, 77, 183-207. 928 \nCorrelation of Torridon and Morar groups \nPage 29 of 32 29\nWilliams, G. E. 1969b. Petrography and origin of pebbles from Torridonian strata 929 \n(late Precambrian), northwest Scotland. In: Kay, M. (eds). North Atlantic 930 \nGeology and continental Drift: a Symposium.  American Association of 931 \nPetroleum Geologists Memoir, 12, 609-629. 932 \nWilliams, G. E. 1970. Origin of disturbed bedding in Torridon Group sandstones. 933 \nScottish Journal of Geology, 6, 409-411. 934 \nWilliams, G. E. 2001. Neoproterozoic (Torridonian) alluvial fan succession, 935 \nnorthwest Scotland, and its tectonic setting and provenance. Geological 936 \nMagazine, 138, 161-184. 937 \nWinchester, J. A. 1988. Later Proterozoic environments and tectonic evolution in the 938 \nnorthern Atlantic lands. In: Winchester, J. A. (eds). Later Proterozoic 939 \nstratigraphy of the Northern Atlantic Regions.   Blackie, Glasgow, 253-270. 940 \nWright, L. A. & Troxel, B. W. (eds). 1999. Cenozoic Basins of the Death Valley 941 \nregion. Geological Society of America Special Paper,  333. Boulder, 942 \nColorado. 943 \n 944 \n 945 \nCorrelation of Torridon and Morar groups \nPage 30 of 32 30\nList & Captions for Figures 946 \n 947 \nFig. 1.  Geological map of the Northern Highlands l.  Moine-undivided: includes the 948 \nEast Sutherland Moine (ESM), the Tarskavaig Moine (TM) and the Rosemarkie - 949 \nCromarty Moine Inliers (RC).  Other abbreviations: BHT = Ben Hope Thrust; CF = 950 \nCoigach Fault; OIFZ = Outer Isles Thrust Zone; MT = Moine Thrust; NTZ = Naver 951 \nThrust Zone, SBT = Sgurr Beag Thrust.  Inset shows location of Figure 3. Modified 952 \nafter British Geological Survey (1989 a, b).  953 \n 954 \nFig. 2.  Stratigraphy of the Torridonian sequence and Morar Group in Northern 955 \nScotland (all thicknesses are approximate; units higher than the Glenfinnan Group not 956 \nshown).  (a) Torridonian sequence in NW Highlands; (b) Morar Group in Northern 957 \nHighlands; (c) Torridonian sequence on Skye; (d) Morar Group in Morar.   Compiled 958 \nafter Holdsworth et al. (1994) and Stewart (2002). 959 \n 960 \nFig. 3.  (a) Geological map of the Ben Hee and Glen Cassley area.  Areas with well-961 \npreserved sedimentary structures are outlined.  (b) Schematic cross-sections through 962 \nthe Ben Hee - Cassley area.  The A’Mhoine Formation occurs west (below) the 963 \nAchness Thrust, whereas the psammite east (above) the Achness Thrust are assigned 964 \nto the Altnaharra Formation. 965 \n 966 \nFig. 4. Photographs showing sedimentary structures within the A ‘Mhoine Psammite 967 \nFormation in the Ben Hee and Glan Cassley area. 968 \n(a) Slightly deformed gritty psammite showing coarse, gritty grain sizes and feldspar 969 \nclasts.  Carn nam Bò Maolo [NC 4431 0904], BGS Photo 616530. 970 \n(b) Nested co-sets of trough cross-beds in medium psammite (scale bar is 10 cm 971 \nlong). Sediment transport was broadly NNE directed.  Eastern slopes of Beinn an 972 \nEòin [NC 4087 0941], BGS Photo 616564. 973 \n(c) Succession displaying interstratified nested trough cross-bed and plane-parallel 974 \nsets at base overlain by planar cross-stratified sets (the topmost set is thinned due to 975 \nerosion by the overlying trough cross-bed set) followed by large (metre-scale) trough 976 \ncross-bed sets forming the upper part of the outcrop (map case is 30 cm high).  977 \nSediment transport associated with trough cross-beds was NNE to ENE and the planar 978 \nCorrelation of Torridon and Morar groups \nPage 31 of 32 31\ncross-strata display east-directed lateral migration. Carn Mor north of Strath Oykel 979 \n[NC 4038 0453]. BGS Photo 616551. 980 \n(d) Nested, m-scale co-sets of stacked trough cross-beds infilling an overall channel 981 \nform. Note decrease in size of sets up to the base of next overlying channel (the 982 \nerosive base of this channel is just to right of the ~1.8m geologist) [NC 440 389]. 983 \nSoft-sediment deformation structures; note how each interval is erosionally truncated 984 \nby overlying, undeformed stratification: (e) convolute bedding and oversteepened 985 \nforesets in fine-medium psammite (compass is 9 cm wide) NW of Glencassley Castle 986 \n[NC 4358 0807] BGS Photo 618131; (f) 2.5m scale dewatering pipes in coarse 987 \npsammite, just below ~1.8m geologist [NC 4349 3899]. 988 \n 989 \nFig. 5.  Sedimentary log of a typical section of the A ‘Mhoine Formation showing 990 \ninterstratified nature of trough and planar cross-bedding and planar stratification. 991 \nMost bed geometries at outcrop scale are lens shaped and define nested channels 992 \nhaving high width:depth ratios. Note that grain size indications, particularly for the 993 \nfiner size ranges, can only be qualitative due to metamorphic recrystallisation.  994 \nEastern slopes of Beinn Direach, Ben Hee Area [NC438 393]. 995 \n 996 \nFig. 6. a)  Classification plot for sandstones and shales (Herron 1988) with samples 997 \nfrom Morar, Torridon and Sleat groups.   b)  Al2O3 – K2O – CaO+Na2O diagram (top 998 \nhalf only). Arrows indicate weathering trend from a granitic bedrock source and 999 \nsorting trend (Nesbitt et al., 1996).   1000 \n 1001 \nFig. 7.  Detrital zircon age patterns for (a) Loch Eil Group, (b) Glenfinnan Group and 1002 \n(c) Morar Group (A ‘Mhoine Formation) (Friend et al. 2002; Cawood et al. 2004), (d, 1003 \ne) Torridon Group (Rainbird et al. 2001), (f) Stoer Group, (Rainbird et al. 2001) and 1004 \n(g) predicted detrital zircon ages for detritus derived from the Grenville Orogen 1005 \n(based on data from Gower & Krogh 2002) and (h) Laurentia outwith the Grenville 1006 \nOrogen (based on data from Hoffman 1988).  Note: inherited grains refers to zircons 1007 \nfrom partial melts within the metasedimentary successions.  1008 \n 1009 \nFig. 8.  Laurentia and Baltica in a possible Early Neoproterozoic reconstruction – note 1010 \nthat the exact position of Baltica is uncertain.  Only juvenile Palaeoproterozoic belts 1011 \nare shown; belts of reworked Archaean rocks are not shown.  Position of Torridon and 1012 \nCorrelation of Torridon and Morar groups \nPage 32 of 32 32\nMorar groups is shown.  Inset shows the Grenville Orogen in Eastern Canada.  After 1013 \nHoffman (1988), Winchester (1988), Rivers (1997) and Rainbird et al. (2001).  1014 \n 1015 \nTable 1. Chemical analyses of sandstones and psammites from the Torridon Group, A 1016 \n‘Mhoine Formation and Sleat Group.  A 'Mhoine Formation samples are ordered 1017 \nstratigraphically.  1018 \n(1) BGS analyses; this study; (2) after van de Kamp & Leake (1997); (3) after Stewart 1019 \n& Donnelan (1992); (4) after Stewart (1991).  CIA = Chemical Index of Alteration 1020 \n(Nesbitt et al. 1996) 1021 \nafter British Geological Survey origina\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n6° W\n6° W\n5° W\n5° W\n4° W\n4° W\n57°N\n57° N\n58°N\n58° N\nl\nOther faults\n# Thrust\n50 km\nKey\nDalradian and post-Caledonian rocks\nCaledonian igneous rocks\nCambro-Ordovician sedimentary rocks\nNeoproterozoic intrusions\nMoine rocks - undivided\nLoch Eil and Glenfinnan groups\nMorar Group\nTorridon Group\nSleat Group\nStoer Group\nLewisian Gneiss Complex (includes \nLewisianoid Inliers within Moine rocks)\nSkye\nGR\nAM\nPI\nAN\n H\nIG\nHL\nAN\nDS\nGr\nea\nt G\nlen\n Fa\nult\nMull\nMorar\nLewis OIFZ\nMin\nch F\nault\nAssynt\nTorridon\nESM\nKnoydart\nM\nT\nNTZ\nSB\nT\nM\nT\nRC\nTM\nM\nT\nCF\nN A 'Mhoine\nSBT\nGR\nAM\nPI\nAN\n H\nIG\nHL\nAN\nDS\nSB\nT\nBHT\nCape Wrath\nTh\ne M\ninc\nh\nMoray\nFirth\nPoint of\nStoer Ben\nHee\nGlen \nCassley\nEriboll Fm\n(Cambrian)\nCailleach \nHead Fm\nAultbea Fm\nApple-\ncross Fm\nDiabaig Fm\na) Foreland \nNW Highlands\n(west of Moine \nThrust Zone)\nTo\nrr\nid\non\n G\nro\nup\nStoer \nGroup\nc) Southern \nMoine Thrust Zone\n(Kishorn Nappe)\nA 'Mhoine Fm\nConglomerate\nb) Ben Hee\n(Northern\nMoine Nappe)\nNaver Thrust\nM\norar G\nroup\nGlenfinnan \nGroup (undivided)\nApplecross Fm\nKinloch Fm\nBeinn na \nSeamraig Fm\nLoch na Dal Fm\nRubha Guail Fm\nS\nle\nat\n G\nro\nup\nd) Morar \/ Knoydart\n(southern\nMoine Nappe)\nUpper Morar \nPsammite Fm\n \nMorar Striped & \nPelitic Schist Fm\nLower Morar \nPsammite Fm\nBasal Pelite + \nconglomerate\nSgurr BeagThrust\nLewisianoid \nGneissLewisian \nGneiss\nComplex\nGlenfinnan \nGroup\n (undivided)\nM\norar G\nroup\nLewisianoid \nGneiss\nLewisian \nGneiss\nComplex\nTo\nrr\nid\non\n G\nro\nup\nRubha Ruaidh\nSemipelite Fm\nproposed\ncorrelation\n???\ncorrelation\nuncertain\ncorrelation\nuncertain\napprox\n1km\ncorrelation\ncertain\nA A'\nB'B\n#\n#\n#\n#\n#\n##\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n##\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n##\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n#\n230\n230\n240\n240\n250\n250\n910 910\n920 920\n930\n930\n940 940\n10 km\nN\nKEY\nCaledonian igneous rocks\nCambro-Ordovician \nsedimentary rocks\nMylonite with quartzite & \ngneiss protolith\nAltnaharra Fm, Morar Group\nTorridon Group\nLewisian Gneiss Complex & \nLewisianoid inliers within Moine\nlow strain zones with \nwell-preserved sedimentary \nstructures\nA 'Mhoine Fm, Morar Group\nStack of Glencoul\nBen More\nAssynt\nGLEN OYKEL\nGLEN CASSLEY\nGlencassley\nCastle\nCarn nam \nBo Maola\nCarn Mor\nOykel Bridge\nAirde of Shin\nLoch Shin\nLoch More\nLoch M\nerkland\nSàil Rac\nBen Hee\nCnoc a' Chraois\nGobernuisgach \nLodge\nBeinn \nDireach\nSail Rac Ben Hee Creag \nDhubh Mhor \nAn Stuc Beinn an Eòin\nRiver \nCassley\nCarn nam \nBo Maola Loch \nShin\nGLEN CASSLEY\nBeinn an Eòin\nAchness Thrust\nBe\nn \nH\nop\ne \nTh\nru\nst\nBen H\nope Thrust\nMoine Thrust\nBen M\nore Thrust\n Thrust\nCALEDONIAN\nFORELAND\nASSYNT \nCULMINATION\nAchness Thrust\n0 \n1 km MT\nSole Thrust\nBHT\nMT BHT\nAchness Thrust\n0 \n1 km\n= geochemistry samples\nSole\n? Achness Thrust ?\n0\n1 2km\nA'\nA\nB\nB'\n[NC 500 325][NC 310 425]\n[NC 530 116][NC 300 096] [NC 373 066]\n1\n2km\nV = H\na\nb\nNW\nE W SW NE\nW E\na b\nc\nfe\nd\n40\n30\n20\n10\n0 m\nNested co-sets of dcm-scale trough cross-beds \nbounded above and below by planar \nstratification; base of cross-bedded interval \nerosively scours into underlying unit\nMassive appearing psammite with locally \ndeveloped soft-sedimentary slump features\nChannelised interval defined by nested, m-\nscale sets of trough cross-bedding contained \nwithin an overall planar stratified interval \nInterval of interstratified trough and planar \ncross-bed sets infilling channel geometries; \nmany forest intervals display oversteepening; \nplanar stratified and soft-sediment deformation \nfeatures preserved locally\nMetre-scale, broad, shallow trough cross-bed \nsets bounding intervals consisting of \ninterstratified dm-scale trough and planar \ncross-bedding and locally developed soft-\nsediment deformation structures; larger \nbedforms generally have gravely basal lags \nand show coarse-tail fining upward; heavy \nmineral laminations common \nse\nmi\npe\nlite\nps\nam\nmi\nte\ngri\ntty\n ps\nam\nmi\nte\nlog (SiO2\/Al2O3)\nlo\ng \n(F\ne 2\nO\n3\/\nK\n2O\n)\n0.5 1 1.5\n-1\n0\n1\nShale\nW\nac\nke\nArkose Subarkose\nQ\nua\nrtz\n a\nre\nni\nte\nSublitharenite\nLit\nha\nren\nite\nFe-shale Fe-sand\nMorar Group\nTorridon Group\nSleat Group\nAl2O3\nK2OCaO + Na2O\nwe\nath\ner\nin\ng\nsorting\nA\nCN K\na)\nb)\n500 1000 1500 2000 2500 3000  Ma\n500 1000 1500 2000 2500 3000  Ma\n500 1000 1500 2000 2500 3000  Ma\n500 1000 1500 2000 2500 3000  Ma\n500 1000 1500 2000 2500 3000  Ma\n500 1000 1500 2000 2500 3000  Ma\n500 1000 1500 2000 2500 3000  Ma\n500 1000 1500 2000 2500 3000  Ma\nNeoproterozoic Mesoproterozoic Palaeoproterozoic Archaean\nTrans\nLabrador\nPinware\nGrenville\nTrans\nLabrador\nNain\n'Nain'\nLate\nElsonian\nLate\nElsonian\nAdirondian \/\nElzevirian\nMakkovik \/ \nKetilidian\/\nTrans -Hudson\nAultbea Formation \nTorridon Group\n(Rainbird et al. 2000)\nn = 40\nall detrital grains\nApplecross Formation \nTorridon Group\n(Rainbird et al. 2001)\nn = 42\nall detrital grains\nMagmatic rocks\nin Grenville Province\n(Gower & Krogh 2002)\nMagmatic rocks north \nof Grenville Front \n(eg. Hoffman 1988)\nGlenfinnan Group, \nSgurr Beag Nappe\n(Friend et al. 2003)\nn= 42\n35 inherited grains\n7 detrital grains\nA'Mhoine Formation\nMorar Group,\nMoine Nappe\n(Friend et al. 2003)\nn = 65\n4 inherited grains\n61  detrital grains\nLoch Eil Group\n(Cawood et al. 2004)\nn= 75\na\nb\nc\nd\ng\nh\ne\nTorngat\nWopmay\nThelon\nApproximate \nage range of \ndepositionBay of Stoer Formation\nStoer Group\n(Rainbird et al. 2001)\nn = 35\nall detrital grains\nf\nG\nRE\nNV\nIL\nLE\n \nBALTICA  \n(exact position \nuncertain)\nGREENLAND\nNain\nYavapai -\nMazatzal\nSvecofennian\nmainly 1900 Ma\nTr\nan\ns \nH\nud\nso\nn\nLAURENTIA\nKetilidian\nTorridon \nMorar \nFO\nRE\nLA\nND\n - m\nain\nly \npre\n-19\n00\n500 km\n~ 1650 \n?1570 - 1510\nTrans Labrador \nbatholith\n 1500 - 1470\nPinware\n1320 - 1270\nNain Suite\nKey for Grenville Orogen - inset\nKey for Laurentia - Baltica - main map\nOR\nOG\nEN\nSe\ne in\nset\nEarly Neoproterozoic clastic \nbasins\nPossible extent Grenville \nforeland basin\nMidconintental rift ~1100 Ma\n1500 - 1300 Ma anorogenic \nmagmatism\n1800 - 1600 Ma juvenile crust\n2000 - 1800 Ma juvenile crust\npre-2000 Ma crust - mainly Late \nArchaean\nGrenville s.s.: 1100 - 950 Ma;  \npeak 1090-1050 Ma\nElzeverian: 1280 - 1120 Ma \n1400 - 1300 Ma\nPinware and related: 1600 - 1400 \nMa, peak 1500 - 1470 Ma\nTrans-Labrador and related: \n1700 - 1600 Ma,  peak ~1650 Ma\n1900 - 1700 Ma (mainly outside \norogen)\nPre 1900 Ma (shown in \norogen only)\nApprox extent Grenville Orogen\nN\nN\nAultbea Fm Beinn na Seamraig \nFm\nKinloch Fm\nZY294 ZY288 ZY289 ZY290 ZY291 ZY292 ZY293 General (2) Raasay (3) Coigach (3) Coigach (3) Skye (4) Skye (4)\nmedium-coarse \npsammite (high \nin stratigraphy)\nmedium-coarse \npsammite\ncoarse \npsammite\nmedium-coarse \npsammite\ncoarse, gritty \npsammite\ncoarse, gritty \npsammite\ncoarse \npsammite (low \nin stratigraphy)\nMedian    n = 7 n = 18 n = 10 n = 59 n = 25 n = 11 n = 16\nOxides as %\nSiO2 81.8 84.71 87.93 86.16 85.66 86.71 84.12 85.91 82.82 85.27 82.9 82.55 75.43 76.65\nTiO2 0.36 0.2 0.14 0.12 0.22 0.16 0.33 0.18 0.3 0.31 0.32 0.29 0.61 0.55\nAl2O3 8.45 7.49 5.91 6.68 6.98 6.27 7.45 6.83 8.61 8.27 9.01 9.85 11.75 11.68\nFe2O3 + FeO 1.92 1.34 1.01 0.96 1.12 1.11 1.62 1.115 1.48 1.48 2.27 1.8 3.39 3.13\nMnO 0.04 0.03 0.04 0.02 0.02 0.03 0.04 0.03 0.04 0.03 0.03 0.02 0.07 0.06\nMgO 0.4 0.28 0.14 0.2 0.24 0.17 0.25 0.22 0.86 0.23 1.24 0.83 0.64 0.52\nCaO 0.87 0.4 0.49 0.48 0.32 0.32 0.47 0.435 0.17 0.26 0.08 0.01 1.74 1.07\nNa2O 1.8 1.4 1.15 1.22 1.03 1.14 1.24 1.185 1.38 1.94 1.78 1.52 2.34 2.61\nK2O 3.02 2.82 2.51 3.07 3.15 3.04 3.37 3.055 3.46 2.86 3.06 4.06 3.89 3.6\nP2O5 0.03 0.01 <0.01 0.01 0.01 0.01 0.01 0.01 0.02 0.09 0.04 0.04 0.28 0.26\nH2O 0.79\nLOI 0.56 0.62 0.35 0.31 0.62 0.42 0.56\nTotal 99.37 99.39 99.77 99.32 99.45 99.47 99.58 99.93 100.74 100.73 100.97\nTrace elements \n(ppm)\nBa 653 653 652 631 653 661 714 653 613 636 691\nCe 38 30 18 24 23 20 37 23.5 37 53\nLa 15 15 9 10 9 6 14 9.5 19 25\nNi 6 5 3 4 4 4 5 4 4 2\nRb 86 77 59 76 84 71 87 76.5 80 79 92\nSr 168 131 148 121 117 135 140 133 98 60 61\nTh 5 4 3 3 4 4 5 4 6 7\nY 14 9 6 7 7 6 9 7 8 12\nZn 17 13 6 8 8 11 12 9.5 12 10 9\nZr 212 116 79 79 101 98 172 99.5 173 172 206\nNa2O\/K2O 0.60 0.50 0.46 0.40 0.33 0.38 0.37 0.39 0.40 0.68 0.58 0.37 0.60 0.73\nSiO2\/Al2O3 9.68 11.31 14.88 12.90 12.27 13.83 11.29 12.58 9.62 10.31 9.20 8.38 6.42 6.56\nRb\/Sr 0.512 0.588 0.399 0.628 0.718 0.526 0.621 0.575 1.317 1.508\nCa2O\/Na2O 0.483 0.286 0.426 0.393 0.311 0.281 0.379 0.367 0.123 0.134 0.045 0.007 0.744 0.410\nCIA 0.60 0.62 0.59 0.58 0.61 0.58 0.59 0.60 0.63 0.62 0.65 0.64 0.60 0.62\nSleat Group\nA 'Mhoine Fm (1)\nMorar Group Torridon Group\nApplecross Fm\nTable 1.           Chemical analyses of sandstones and psammites from the Torridon group, A ' Mhoine Formation and Sleat Group. (1) BGS analyses; this study; (2) after van de \nKamp & Leake (1997); (3) after Stewart & Donnelan (1992); (4) after Stewart (1991).  \nA 'Mhoine Formation samples are ordered stratigraphically.  CIA = Chemical Index of Alteration (Nesbitt et al. 1996)\n\n\n\n"}