{"doi":"10.1080\/0968776010090203","coreId":"14246","oai":"oai:generic.eprints.org:349\/core5","identifiers":["oai:generic.eprints.org:349\/core5","10.1080\/0968776010090203"],"title":"The distributed development of quality courses for a virtual university","authors":["Oliver, Martin","Bradley, Claire","Boyle, Tom"],"enrichments":{"references":[{"id":198580,"title":"Academic development: a framework for embedding learning technology',","authors":[],"date":"2000","doi":"10.1080\/13601440050200734","raw":"Smith, J. and Oliver, M. (2000), 'Academic development: a framework for embedding learning technology', International Journal of Academic Development, 5 (2), 129-37.","cites":null},{"id":198578,"title":"Assessing and enhancing quality using toolkits',","authors":[],"date":"2000","doi":"10.1108\/09684880010312677","raw":"Oliver, M. and Conole, G. (2000), 'Assessing and enhancing quality using toolkits', Quality Assurance in Education, 8 (1), 32-7.","cites":null},{"id":198579,"title":"Learning and Teaching","authors":[],"date":"1998","doi":"10.1007\/978-94-6091-864-3_11","raw":"Peters, O. (1998), Learning and Teaching in Distance Education: Analyses and Interpretations from an International Perspective, London: Kogan Page.","cites":null},{"id":198577,"title":"Quality assurance and assessment in distance learning',","authors":[],"date":"1996","doi":null,"raw":"O'Shea, T., Bearman, S. and Downes, A. (1996), 'Quality assurance and assessment in distance learning', in R. Mills and A. Tait (eds.), Supporting the Learner in Open and Distance Learning, London: Pitman Publishing, 193-205.","cites":null},{"id":198576,"title":"What is Quality","authors":[],"date":"1994","doi":null,"raw":"Green, D. (1994), What is Quality in Higher Education?, Buckingham: Open University Press.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001","abstract":"Although virtual universities are widely touted as a way of competing globally in a post‐compulsory educational market, systems for implementing them are currently underdeveloped The central thesis in this paper is that in order to ensure the quality of the development and delivery of course materials for a virtual university, a collaborative and iterative approach to authoring is required. In this paper, the development of such a process will be discussed The paper is based on experience with a project whose aims included the provision of Masters‐level courses in supply chain management for learners in full‐time employment in small and medium‐sized enterprises (SMEs). The materials developed through the project were required to be academically rigorous, vocationally relevant, and situated in the context of the learners. The project relied on distributed development, with authors based at institutions across the UK and in Europe. This paper focuses on the creation and evolution of the development processes adopted by the project, illustrating these with examples of good and bad practice. Based on these, tensions between quality and resourcing are identified, and implications will be drawn for other teams working on the development of online courses","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14246.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/349\/1\/ALT_J_Vol9_No2_2001_The%20distributed%20development%20of.pdf","pdfHashValue":"f7e65931ffb39a628e19a82116dcb9d6ca1ecdde","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:349<\/identifier><datestamp>\n      2011-04-04T09:14:04Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/349\/<\/dc:relation><dc:title>\n        The distributed development of quality courses for a virtual university<\/dc:title><dc:creator>\n        Oliver, Martin<\/dc:creator><dc:creator>\n        Bradley, Claire<\/dc:creator><dc:creator>\n        Boyle, Tom<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Although virtual universities are widely touted as a way of competing globally in a post‐compulsory educational market, systems for implementing them are currently underdeveloped The central thesis in this paper is that in order to ensure the quality of the development and delivery of course materials for a virtual university, a collaborative and iterative approach to authoring is required. In this paper, the development of such a process will be discussed The paper is based on experience with a project whose aims included the provision of Masters‐level courses in supply chain management for learners in full‐time employment in small and medium‐sized enterprises (SMEs). The materials developed through the project were required to be academically rigorous, vocationally relevant, and situated in the context of the learners. The project relied on distributed development, with authors based at institutions across the UK and in Europe. This paper focuses on the creation and evolution of the development processes adopted by the project, illustrating these with examples of good and bad practice. Based on these, tensions between quality and resourcing are identified, and implications will be drawn for other teams working on the development of online courses.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2001<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/349\/1\/ALT_J_Vol9_No2_2001_The%20distributed%20development%20of.pdf<\/dc:identifier><dc:identifier>\n          Oliver, Martin and Bradley, Claire and Boyle, Tom  (2001) The distributed development of quality courses for a virtual university.  Association for Learning Technology Journal, 9 (2).  pp. 16-27.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776010090203<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/349\/","10.1080\/0968776010090203"],"year":2001,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"The distributed development of quality courses\nfor a virtual university\nMartin Oliver* Claire Bradley** and Tom Boyle**\n*Higher Education Research and Development Unit University College, London\n**Learning Technology Research Institute, University of North London\nemail: martin.oliver@ulc.ac.uk\nAlthough virtual universities are widely touted as a way of competing globally in a post-\ncompulsory educational market, systems for implementing them are currently\nunderdeveloped The central thesis in this paper is that in order to ensure the quality of\nthe development and delivery of course materials for a virtual university, a collaborative\nand iterative approach to authoring is required. In this paper, the development of such a\nprocess will be discussed The paper is based on experience with a project whose aims\nincluded the provision of Masters-level courses in supply chain management for learners\nin full-time employment in small and medium-sized enterprises (SMEs). The materials\ndeveloped through the project were required to be academically rigorous, vocationally\nrelevant, and situated in the context of the learners. The project relied on distributed\ndevelopment, with authors based at institutions across the UK and in Europe. This paper\nfocuses on the creation and evolution of the development processes adopted by the\nproject, illustrating these with examples of good and bad practice. Based on these,\ntensions between quality and resourcing are identified, and implications will be drawn for\nother teams working on the development of online courses.\nIntroduction\nThe perceived need for global competition in higher education has led to the proliferation\nof projects and initiatives focused on the development of online education (see, for\nexample, Smith and Oliver, 2000). Much resource and effort is being invested in this area,\nbut there has been relatively little research into effective development and quality assurance\nmodels that can support the creation of online courses. Still less has been carried out that\nconsiders the particular developmental challenges posed by distributed teams of authors.\nIn this paper, these issues will be discussed in the context of the Training for Innovation in\nSupply Chain Management (TISCAM) project. After describing the project, the development\n16\nALT-] Volume 9 Number 2\nprocess will be outlined. Examples of materials produced will be considered to illustrate the\nstrengths and weaknesses of the process, and revisions to the model will be discussed. The\npaper will conclude by highlighting a series of challenges for development work of this type.\nBackground\nThe project that provides the context for this work was an ADAPT-funded initiative that\nsought to offer Masters-level courses in supply chain management to learners in the\nworkplace. The rationale for this was to provide learners with access to high-quality\nmaterials and leading academic experts, irrespective of their geographical location.\nThis model involves the central co-ordination of the authoring and delivery of courses, as\nillustrated in Figure 1.\nRegional delivery\ncentre\nLearner IT\"Learner\nFigure I: The distributed development and delivery model for the project\nWithin this structure, the core team is sub-divided into groups with distinct areas of\nexpertise. The groups relevant to the development process are illustrated in Figure 2. As\nthese figures illustrate, development was organized around an elaborate division of labour\nthat was intended to cover each step in the educational process from course conception\nthrough to assessment and evaluation. ;•••••-.\nFigure 2: The structure of the\ncore team\nLearner support\nteam\nCentral admin &\nmanagement team\nAcademic\nreview\nTechnical\nteam J\nEvaluation team\n(impact of delivery)\nInitially, twelve modules were developed, either by individual authors or teams led by a\nnominated co-ordinator who liaised with the development teams; Each module constitutes\n100 hours of study, and is broken down into 10 units of approximately 10 hours of study\ntime each. The notional study time includes working through the materials, carrying out\n17\nMartin Oliver et al The distributed development of quality courses for a virtual university\nand completing activities and assessments, building up a portfolio, engaging in online\ndiscussion groups and reading case studies and related materials.\nLearners are supported by a range of different specialists, each with their own expertise, as\nillustrated in Figure 3.\nTutor: subject-specific\nexpertise\nCentral support: admin\n& technical support\nRegional delivery\ncentre\nFacilitator: support for\nlearning contracts,\nstudy skills, generic\nlearning issues &\nadministration\nCompany\nIn-company mentor:\nsupport for adapting\nand applying skills and\ntechniques in a real\nwork context\nFigure 3: The support structure for learners\nIt is important to note that, with this model, it is possible to have materials written at one\ninstitution, supported online by someone at a second institution and delivered to learners\nregistered at a third. Clearly, the complexity of the development and delivery processes\nraises many issues for developing, delivering and quality-assuring the learning process.\nModels of quality assurance\nThe notion of quality in higher education is a contested one; at least five interpretations\nhave been identified in the research literature (Green, 1994):\n• quality as excellence;\n• conformance to specifications or standards;\n• fitness for purpose;\n• effectiveness in achieving institutional goals;\n• meeting customers' needs.\nAs Green notes, these interpretations are neither exclusive nor exhaustive. In practice,\nseveral of these interpretations may be held alongside each other, and the contradictions\nbetween different interpretations may only become apparent as the work progresses. The\n18\nALT-J Volume 9 Number 2\noriginal model for this project was based on the notion of excellence - it focused on the\nprovision of cutting-edge knowledge, resources and materials, and on access to leading\nexperts in the field.\nO'Shea, Bearman and Downes (1996) have argued that quality is particularly important\nand unusually difficult for open and distance teaching. Because such approaches fall well\noutside traditional models of education, 'the biggest obstacle that assessors have to\novercome in assessing an open and distance teaching institution is knowing and\nrecognising the teaching to be assessed' (ibid.: 198). Consequently, they have distinguished\nbetween the quality of academic content (including learner support), the quality of tuition\nand the learning experience and finally the quality of assessment. This paper will focus on\nthe first of these three, although reference to the other two areas will also be made.\nDevelopment models for distance learning\nPeters (1998) has described distance education as the most industrialized form of learning\nand teaching. Specifically, he contrasts the 'craft' model of lecturers designing. and\ndeveloping traditional courses themselves with the division of labour common amongst\ndistance initiatives, in which authoring, design, editing, development (particularly\ntechnical development) and teaching may all be undertaken by distinct individuals.\nThis industrialized model was adopted for this project, as was reflected in its internal\nstructure. Separate contracts were issued for authors and for tutors, even where these went\nto the same individual; decisions about the courses to develop and the authors to contract\nwere taken by the central management team. In addition, central teams were established to\nwork with authors providing pedagogic and technical.support, covering the design and\ndevelopment aspects of the project respectively.\nThe project's quality system\nGiven the conceptual and organizational complexity of the project, it was inevitable that\nthe quality systems would also be complex. In keeping with the project's strategy of\norganizing itself around educational processes, quality systems were devised for each of\nthe main areas of work. The necessity of this became apparent when the division of labour,\ndescribed in Figures 1 and 2, led to confusion rather than clarity for many project partners\n- particularly those who held contracts for more than one area of work.\nGuidelines were drawn up specifying the responsibilities of authors, tutors, in-company\nmentors, regional facilitators and even of the learners. As well as providing an agreed\ndescription of each role, these specifications allowed a minimal level of quality to be assured\n(in terms of conformance to standards). A selection of these will be outlined below, with\nreference made to the definitions of quality that most closely describe their purpose, before\nsummarizing the process with an overview of the quality system for authoring materials.\nSupport and guidance for authors\nIn the initial stages of development, a series of face-to-face meetings was held for members\nof the development teams. These consisted of preliminary briefing meetings and\nworkshops on writing for online delivery. The latter drew on Laurillard's conversational\nframework (1993) and incorporated the use of the Media Adviser software (Oliver and\nConole, 2000) to improve the pedagogic quality of module plans. Written guidelines for\n19\nMartin Oliver et al The distributed development of quality courses for a virtual university\nThe context of authoring forTISCAM :\nThe submission of materials ' - . . . . : :\nThe unit template sheet - a planning document for authors to specify the unft aims,1 objectives,\n. learning outcomes and assessment methods, and a map of the content against the learning.\n. outcomes and methods of assessment. . . •\n ; . ..,-.,....•\nPreparation of text . . . ' •\n' Use o f multimedia\nActivities' ' V ' ' • • - • • • •\n:\n Discussion-with peers and support staff ' ' \"' ' - :- ' •• :\n• A s s e s s m e n t ' • • ' • • . - . • ••' • - •• •••• * • • • - • ••• • ••••• : \" ::-\nTable I: Topics covered iri the authoring guidelines • • '\" • ' : ' • ' ''• \" :\nauthors were produced arid circulated early oh in the project. The main focus of these\nguidelines was to outline the elements the materials should contain, and give guidance on\nthe organization arid, submission of drafts (see Table I). In this way, they' provided\nthreshold standards against which submissions could be judged.\nP e e r r e v i e w ' • • • •'••'•'• • • • -r • ' . ; -: : : ' • -: ''••' '• •\nIri addition to this process of review by specialists, a peer review element was incorporated\ninto the quality system. This involved providing access to draft materials, allowing authors\nto Work through each others' materials arid discuss these online. By exposing materials to\ninspection by other experts hr the field, this process ensured the accuracy and currency of\ninformation and cases. It also provided a mechariisrn for sharing examples of best practice,\npromoting quality as excellence and extending the model of conformance to standards\nrepresented by the authoring guidelines. . . . . . . <.o -. •.• : .-•. .\n ;\nr\nAcademic review ; •''•'.• ' ' ' ' ' i : ' ' '''\"'',' ' ' \" : : ' ; : \" ' ' \"' \" \"'\"\"' : \" : '\nEnsuring the academic quality of the courses was a primary cbricern for the project; One\nelerrierit of the authoring process involved mapping out the cbriterit of units in relation to\nother materials' under development. Approved develdprrients were subsequently checked by\nan academic board with responsibility for issues such as the consistency of format and of\nlevel across the materials. Once' again, this is best characterized as a process of\nconformance to standards..\n ; . :. • • r, , , .; . ,\nDelivering institutions were also asked to seek internal validation of the courses they were\noffering. However, giventhat materials were being developed throughout the project, and\nthat validation pfbcesses often required six months or more, the project partners under-\nstood that this stage of the quality process might not be completed during the tw6-year\nfunded period of the project. ' : -..:-.• • • ••• -•••••\nA model of the authoring process . •, .•:• , .:, : .: ; .\n ;\nThe division of labour within TISCAM, combined with the production of standards and\nthe use of either specialist or peer review at each stage of development, made it possible to\nspecify a clear, iterative system for ensuring the quality of materials. This is illustrated in\nF i g u r e 4 . L ; . • : : ! . ; : v • n u - ; : : - : . ; : > . , - - ; i , ; i -••.•••••'••• - ; • - . ' •••'-••••• : - : - : ' '•-••-'\n20\nALT-) Volume 9 Number 2\nAuthor Academic Pedagogic Technical Peer\n. ..\n : Review review review review\nTechnical implementation\nF i g u r e 4: The q u a l i t y s y s t e m f o r T I S C A M • < • • . • ; ; - • ; ; . • • : • • •. ; • ; • ; , < : , • ] : .::-•:•.\nIt was clear from the outset that this model could have significant implications for. the\nauthors'^  workloads as a consequence of a series of requests for revision. However, the\nexpectation was that authors would be able to create materials that, once signed off after\npedagogic review by the learner support team, would quickly progress through the other\nphases of development.\nApplying theTISCAM development model\nWhilst every effort was taken to ensure that all modules exceeded agreed minimum levels of\nquality, many of the initial drafts required considerable revision. Authors generally grasped\nthe guidelines that were provided, but - for reasons not always apparent to the. reviewers -\nneglected some aspects of this advice. Moreover, they demonstrated a wide diversity of\nstyles from one module to the next, and in some cases were even inconsistent in their\napproach between units within the same module. To illustrate the variety of materials that\nwere submitted, and the issues that arose from these, three examples will briefly be outlined.\nExample A\nIn this first example, the materials reflected a 'textbook' approach to teaching. The content\nwas academically sound and was well written, but as learning material for online delivery it\nwas poor. It was heavily text-based, requiring considerable on-screen reading, and there\nwere few opportunities for learner interaction or engagement with the materials. There were\nonly three activities, each of which required learners to read additional material from a\nrecommended textbook and then produce written reports. No feedback or model answers\nwere provided for these activities, and no self-assessment activities were included for\nlearners to check their own understanding of the materials.. Furthermore, the guidelines for\nlearner support had been ignored - there was an over-reliance on.tutor support and\nfeedback, and no use of the in-company mentor for discussion and work-based application.\n21\nMartin Oliver et al The distributed development of quality courses for a virtual university\nThis case exemplifies an approach to writing that views learning as transmission of\ninformation. In the first batch of submitted materials, this approach was all too common;\nhowever, as authors developed a more sophisticated understanding of online learning, they\nwere able to develop more engaging, activity- and discussion-based materials instead.\nThe feedback from the pedagogic review provided a number of suggestions on how this\nunit could be developed for more effective online delivery. The amount of text-based\ncontent was substantially reduced, and was divided into a larger number of shorter\nsections that would be more manageable for learners to work through. Activities were\nredesigned to minimize the amount of additional reading and report-writing, greater\nvariety was introduced to increase learner motivation, and self-assessment activities with\nonline feedback were also added. The author revised the material, taking account of many\nof these suggestions, which resulted in the production of a much more interesting and\neffective online learning unit.\nExample B\nIn this example the materials were well written and structured, with learner reviews at the\nbeginning and end of the unit, and clear introductions to the content being covered. In\nmarked contrast to the original material submitted in Example A, Example B contained\nregular and interesting activities, with a good balance of self-assessment and work-based\nexamples. However, there was little opportunity to share views or experiences with fellow\nlearners, and model answers and written feedback was scarce. Although this outline\nreflected constructivist values and approaches to learning, the lack of guidance meant that\nit was almost too open, providing no frame of reference for learners prior to the summative\nassessment.\nExamples of good practice from another module were made available to the author,\nresulting in the revised materials resembling a 'guided discovery' approach to learning.\nModel answers and tutors' comments were incorporated into the design to help students\ngain a sense of their ability and progression.\nExample C\nIn this final example, the author submitted a draft of one of his units at a very early stage\nin the development process. This draft adopted an action-based learning approach, in\nwhich learning was developed as activities were carried out and case studies were read and\nanalysed. This draft influenced the technical team in its framework for the materials\ndelivery system. However, in order to ensure that the system was navigable and that\nlearners could manage their work, the final system imposed a specific structure on\nmaterials. Because the author had already drafted several units by this stage, he was\nrequired to rework a lot of his material. As a result, his units became more rigid and less\ninteractive.\nThis particular example is important in that it highlights a tension between pedagogic\nideals and the pragmatics of the research project. Whilst there was little wrong with the\noriginal materials, the necessity of providing learners with consistency from unit to unit\nmeant that the design of materials produced by authors converged. In many, cases, this\nimproved the pedagogic approach that had been taken, but in this case, it set necessary\nlimits that restricted what could be achieved.\n22\nALT-J Volume 9 Number 2\nDiscussion\nThe pedagogic review process proved crucial in reinforcing the strengths within the\nmaterials, and identifying and providing suggestions to overcome weaknesses. Strengths\nbecame incorporated into good practice guidelines, and were shared amongst authors to\nhelp develop the quality of their materials and their authoring skills. This demonstrated\nthe importance of the team-based approach in adding value to the development process\nand in promoting shared expertise and experiences.\nCommon issues\nA range of common issues emerged from the materials submitted (Table 2). Most of the\nauthors were subject experts; they were not necessarily writers or experienced distance or\nonline courseware designers. Consequently, many required considerable help and guidance\nfrom the development teams on their early drafts. One particular problem that arose from\nauthors' differing approaches was that there were many inconsistencies from one module\nto another, which could cause confusion and a lack of cohesion for learners.\nThe need to organize material into manageable amounts for short online study sessions.\nThe adoption of a clear and informal writing style, and provision of adequate guidance for learners\nto understand the material and what was required of them. For example, the inclusion of the\nlearning objectives, unit introductions, and providing navigational cues to guide learners to relevant\nmaterial, such as an activity or a case study.\nThe lack of ongoing activities for learner engagement, learning application and reinforcement\nInterestingly, many authors found it easier to design work-based activities for learning application\nthan they did self-assessment activities.\nActivities often lacked feedback for learners, such as examples or model answers.\nThe need for authors to be aware of the potential, and also the limitations, of the online delivery\nmedium. For example, thinking about how large and complex graphics can be presented on the\nlimited size of the computer screen; the effects of including several animated or interactive graphics\nwithin one page on download times.\nRaising awareness of the uses and abuses of online peer discussion. Authors were encouraged to\nmake occasional suggestions for online discussion to help avoid learner isolation, but as learners did\nnot study in cohorts, involvement in discussions should not prohibit their progression through, and\ncompletion of, units.\nEncouragement to some authors to include related case study materials to enrich their units.\nTable 2: Common feedback from the pedagogic reviewers ' • \\_\nIt became apparent from early drafts that authors were not adequately considering an\nassessment methodology for their module as a whole, and suggesting unrealistic levels of\nsupport from tutors and in-company mentors on a unit-by-unit basis. As many authors\nsubmitted units for review out of sequence, it was difficult for reviewers to get a clear\npicture of the module assessment framework and support requirements, or indeed if\nauthors were even considering these.\nAuthors who were open to develop their skills and expertise through their involvement\nwith the project took account of the feedback given during the review process, and learnt\nfrom the emerging good practice of other authors. The quality and effectiveness of their\n23\nMartin Oliver et at The distributed development of quality courses for a virtual university\nmaterials improved dramatically over the development period, as illustrated by Examples\nA and B, above.\nImportantly, the editorial role within the development process had been underestimated. It\ntranspired that some more experienced authors, who published regularly, assumed that an\neditorial process was in place and submitted drafts without thoroughly checking them.\nThis led to additional work for the pedagogic reviewers, who took on some of the work of\nan editorial team in addition to their other duties. Moreover, some authors were simply less\nable writers than others, and the pedagogic reviewers identified a lot of problems that\ncould have been addressed by a competent editor. Later in the project, the technical team\nrecruited editorial staff to perform this function. • ' . . \" ' . .\nIn general, there was an initial underestimation of the timescale of the development and\nreview process. In fact, this turned:out to require far longer than the project actually\npermitted. This was caused by the learning curve that authors faced, and the need for more\nrevisions to drafts being required than had originally been anticipated.\nRevisions to theTISCAM model\nIn light of the examples above, the development model that emerged during TISCAM\ndiffered in several important respects from that shown in Figure 3. Firstly, the expertise of\nthe learner support team providing the pedagogic review also extended to technical matters,\nand as noted, editorial concerns were also addressed during this step. This allowed one review\nto cover several aspects of the development process, shortening the total time required.\nThe academic review, meanwhile, concentrated on the process of co-ordinating submitted\nmaterial across the project in terms of the topics covered and the potential construction of\npathways through the material. Making this distinction between the strategic (academic)\nand tactical (pedagogic and technical) elements of the review process facilitated the\ndevelopment work considerably, allowing the academic review and the pedagogic review to\ntake place in parallel.\nFinally, the idea of an online peer review suffered from a lack of dedicated time. Authors\nwere simply under too much pressure to produce their own materials to be able to spend\nlong periods critiquing those produced by others. Instead, regular authors' meetings were\nscheduled. By booking time aside, it became possible to showcase particular sets of\nmaterial that illustrated good, bad or controversial features. This provided a 'low-tech'\nforum for learning and discussion to support the development process, but importantly, it\ndepended on the pedagogic reviewers (who had an overview of submitted materials)\nidentifying examples of good practice and sharing these with authors who needed help\nwith certain aspects of their work, effectively acting as tailored examples that supported\nthe development of authors' skills. Importantly, within this aspect of the project (the only\none to focus on excellence rather than standards), it was impossible to separate the quality\nsystems from a mutual process of training and education.\nThe revised development model is illustrated in Figure 5, which illustrates how a parallel\nreview process and amalgamation of review tasks minimized the amount of author\nrevision's required. This had the effect of reducing the overall development timescale.\nFinally, it is worth noting that additional adjustments were required when the prototype\nfor the online system became available. The authors' guidelines were revised to include a\n24\nALT-J Volume 9 Number 2\nAuthor Academic\nReview\nPedagogic\nand\ntechnical\nreview\n•\nTechnical implementation\nFigure 5:, The revised development model forTISCAM\n1.\n2.\n3.\nA.\n5.\n6..\n7.\n8.\n9.\n10.\n: , Pedagogic effectiveness .\nUnit appears to contain 10- :\nhours of material .:\nTutor support time is\nadequately estimated and is\nrealistic '\nMentor support time is\nadequately estimated and is\nrealistic\nThe material is submitted in\nthe format specified for\ntechnical implementation\nLanguage is appropriate and\ncontent is well written\nAmount of text is\nappropriate for online\ndelivery\nUnit is structured to module\nand unit specifications\nUnit has appropriate number\nof sections (ideally between 4\nand 6 )\nShort headings frequently\nappear to break up and\nindicate the content following\nIntroduction adequately\nintroduces the module\/unit\ncontent\n11. The learning objectives are\nincluded and are well written\n12. Sufficient learner activities are\nincluded\n13. There is a good balance of\nlearner activities (work-\nbased, self-assessment,\ncomputer-marked, mentor\ndiscussion\/feedback, tutor\nfeedback or assessment)\n14. Completion of the unit and\nactivities will enable learners .\"\nto achieve the learning\nobjectives\n15. There is a summary which\nadequately summarizes what\nhas been covered in the unit\n16. Sufficient case study material\nis included, and is integrated\nwithin the content\n17. Sufficient related materials\nare included\n18. Opportunities for peer group\ndiscussion are included\nAcademic effectiveness\n1. The subject matter is:\nadequately covered :\n2. Content does not overlap\nwith content in other units\n3. The following\ncomplementary links with\nother modules are'suggested:\n:\n 4. The criteria of an academic\nmethodology are met\nTable 3: The final criteria for checking submitted materials\n25\nMartin Oliver et al The distributed development of quality courses for a virtual university\nspecification for the structure of the materials, to ensure they adhered to the system\nrequirements. The unit template was also revised to include more detail about the\nassessment methods and support requirements for the unit, and feedback forms for the\npedagogic and academic reviewers were circulated that set out the final review criteria\n(Table 3).\nAs before, these criteria are best viewed as a way of specifying the minimum standards\nexpected. Authors were aware of what the reviewers were looking for, and for reviewers, the\ncriteria became part of a feedback sheet, which could be used as a checklist as the review\nwas carried out. This made the review process quicker, minimizing the need for lengthy and\nrepetitive feedback.\nConclusions\nQuality systems for authoring online materials inevitably reflect the complexity of the\ndevelopment process. Moreover, whilst the project set out to provide excellence, much of\nthe system that was put in place relied on the notion of ensuring standards (although\nexcellence was encouraged through the process of peer review). In addition, the initial\nindustrial model of production was revised on pragmatic grounds. All the elements were\nretained in order to ensure that no areas were omitted from the quality framework.\nHowever, in order to speed up the development process, one team undertook the majority\nof the quality checks whilst a second, working in parallel, attended to the co-ordination of\nsubject coverage and academic standards.\nSeveral important conclusions can be drawn from this experience. Firstly, the model that\nwas developed was effective, in that it allowed marked improvements to be made in terms\nof the quality of materials. Given its success in this role, it may well prove to be a useful\npoint of reference for other initiatives that involve the development of online courses.\nNext, the implementation of a quality system is resource-intensive (particularly in terms of\nstaff time) and must be achievable within the timescale allowed for the project. It should be\nadequately costed and planned for at the outset of development projects if is to be\nachievable. In this particular case, the project did not include enough time for sufficient\niterations of review and redevelopment of materials; this limited the extent of revision that\nwas possible. The implication of this was that the project had to choose between\ncompromising on the volume or the quality of the materials produced.\nIn addition, the Learner Support Team came to realize that subject experts may not have\nany prior experience of authoring, particularly in the context of distance or online learning\nand may need training, as well as guidance and support.\nIt also became clear that there is a tension between the specialization permitted by the\ndivision of labour model and the practicalities of development. In this case, a compromise\nposition lying somewhere between Peter's (1998) 'craft' and 'industry' models emerged.\nThis involved authors creating draft materials and technical experts implementing it, but\none multi-skilled team taking on a range of roles in order to broker information and act as\na channel for communication between these groups. Whilst the authors concentrated on\nsubject expertise and the implementation team on technical expertise, the learner support\nteam was required to have expertise in instructional design, editing, multimedia design and\n26\nALT-J Volume 9 Number 2\na range of communication and management skills. This model may be relatively common\nfor those working as learning technologists in support of academics developing online\ncourses.\nSome compromises clearly need to be made. The development teams had to reconcile the\ndesire for consistency against a range of authoring styles. Although the online system has\nimposed a consistent structure on materials, the authors retained considerable autonomy\nover what they would include (subject to the quality checks outlined above). Because the\nmaterials were produced as part of a research project, such variation was actively\nsupported, since it will allow the evaluation team to monitor effectiveness of different\napproaches as materials are piloted with learners through the delivery centres.\nPerhaps the most important conclusion to draw, however, is that achieving quality in the\ndevelopment of courses for a virtual university is a demanding, costly and time-consuming\nprocess, which is easily underestimated when planning a project. This is particularly true\nwhen aiming at more abstract interpretations of quality, such as quality as excellence as\nopposed to conformance to standards. The implication of this is that managers of such a\ndevelopment process will need to take hard decisions about how much quality - and of\nwhat type - their project can afford.\nReferences\nGreen, D. (1994), What is Quality in Higher Education?, Buckingham: Open University\nPress.\nLaurillard, D. (1993), Rethinking University Teaching, London: Routledge.\nO'Shea, T., Bearman, S. and Downes, A. (1996), 'Quality assurance and assessment in\ndistance learning', in R. Mills and A. Tait (eds.), Supporting the Learner in Open and\nDistance Learning, London: Pitman Publishing, 193-205.\nOliver, M. and Conole, G. (2000), 'Assessing and enhancing quality using toolkits', Quality\nAssurance in Education, 8 (1), 32-7.\nPeters, O. (1998), Learning and Teaching in Distance Education: Analyses and\nInterpretations from an International Perspective, London: Kogan Page.\nSmith, J. and Oliver, M. (2000), 'Academic development: a framework for embedding\nlearning technology', International Journal of Academic Development, 5 (2), 129-37.\n27\n"}