{"doi":"10.1080\/0968776970050109","coreId":"14322","oai":"oai:generic.eprints.org:232\/core5","identifiers":["oai:generic.eprints.org:232\/core5","10.1080\/0968776970050109"],"title":"From cadaver to computer: Incorporating computers into the topographical anatomy laboratory","authors":["Issroff, Kim","Osmond, Mark","O'Higgins, Paul"],"enrichments":{"references":[{"id":200546,"title":"Confidence assessment in the teaching of basic science',","authors":[],"date":"1995","doi":"10.1080\/0968776950030113","raw":"Gardner-Medwin, A.R. (1995), 'Confidence assessment in the teaching of basic science', ALT-J, 3 (1), 80-5.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1997","abstract":"Traditionally, students have studied human anatomy through dissection and prosection. This requires considerable input from demonstrators, with students working mainly in large groups. Increasing student numbers, decreasing funds for staff, and a need to encourage students to develop independent learning skills that will be of value throughout their professional lives, have meant that the nature of their learning in the Topographical Anatomy Laboratory has had to change. The situation in which groups of students are guided by demonstrators has moved towards a more self‐directed learning environment. Several innovations have been introduced at University College London, including a multimedia laboratory which is the focus of this paper. The results of the evaluation and the lessons learned from the early stages of setting up a self‐directed learning environment are presented","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14322.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/232\/1\/ALT_J_Vol5_No1_1997_From%20cadaver%20to%20computer_%20Inco.pdf","pdfHashValue":"06a986e8b6d552f40adaf094fbbca4f79bbe0baf","publisher":"Universit of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:232<\/identifier><datestamp>\n      2011-04-04T09:22:06Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/232\/<\/dc:relation><dc:title>\n        From cadaver to computer: Incorporating computers into the topographical anatomy laboratory<\/dc:title><dc:creator>\n        Issroff, Kim<\/dc:creator><dc:creator>\n        Osmond, Mark<\/dc:creator><dc:creator>\n        O'Higgins, Paul<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Traditionally, students have studied human anatomy through dissection and prosection. This requires considerable input from demonstrators, with students working mainly in large groups. Increasing student numbers, decreasing funds for staff, and a need to encourage students to develop independent learning skills that will be of value throughout their professional lives, have meant that the nature of their learning in the Topographical Anatomy Laboratory has had to change. The situation in which groups of students are guided by demonstrators has moved towards a more self‐directed learning environment. Several innovations have been introduced at University College London, including a multimedia laboratory which is the focus of this paper. The results of the evaluation and the lessons learned from the early stages of setting up a self‐directed learning environment are presented.<\/dc:description><dc:publisher>\n        Universit of Wales Press<\/dc:publisher><dc:date>\n        1997<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/232\/1\/ALT_J_Vol5_No1_1997_From%20cadaver%20to%20computer_%20Inco.pdf<\/dc:identifier><dc:identifier>\n          Issroff, Kim and Osmond, Mark and O'Higgins, Paul  (1997) From cadaver to computer: Incorporating computers into the topographical anatomy laboratory.  Association for Learning Technology Journal, 5 (1).  pp. 55-59.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776970050109<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/232\/","10.1080\/0968776970050109"],"year":1997,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"From cadaver to computer:\nincorporating computers into the topographical anatomy\nlaboratory\nKim Issroff,* Mark Osmond* and Paul O'Higgins**\n*Higher Education Research and Development Unit University College, London\n**Department of Anatomy and Developmental biology, University College, London\nTraditionally, students have studied human anatomy through dissection and prosection. This requires\nconsiderable input from demonstrators, with students working mainly in large groups. Increasing\nstudent numbers, decreasing funds for staff, and a need to encourage students to develop independent\nlearning skills that will be of value throughout their professional lives, have meant that the nature of\ntheir learning in the Topographical Anatomy Laboratory has had to change. The situation in which\ngroups of students are guided by demonstrators has moved towards a more self-directed learning\nenvironment. Several innovations have been introduced at University College London, including a\nmultimedia laboratory which is the focus of this paper. The results of the evaluation and the lessons\nlearned from the early stages of setting up a self-directed learning environment are presented.\nIntroduction\nThis paper discusses the establishment of a multimedia facility in the Topographical\nAnatomy Laboratory at University College London. The aims of using computers in the\nlaboratory are to encourage self-directed learning, to provide students with a means of\nindependent study which allows instant feedback during their learning, and to allow\nstudents to progress according to their individual requirements, while achieving the\noverall objectives of the curriculum.\nThe traditional approach to the study of anatomy through the dissection of cadavers and\nthe study of prosections requires considerable input from demonstrators, ties students\ndown to working in groups (and therefore at the pace of the group), and can inhibit\nindependent learning. While the approach suits some, it is not an effective learning\nenvironment for all students. In addition, considerable changes have been brought to\nundergraduate medical education in the UK in the last five years. Not only have the\nnumber of students passing through each medical school (and therefore each dissecting\nss\nKm Issroffet al From cadaver to computer incorporating computers into the topographical anatomy laboratory\nroom) increased dramatically, with no corresponding increase in staff and availability of\ndemonstrators, but also the General Medical Council has stated that it wishes to reduce\nthe amount of factual knowledge and to encourage students to develop independent\nlearning skills that will be of value throughout their later professional lives.\nIn order to transform anatomical study from a process of dissection and learning by rote\nto one of exploration within a multi-faceted laboratory, while maintaining a core level of\nanatomical knowledge required for safe professional practice, several innovations have\nbeen introduced into the dissecting room. These are described in the next section, with\nparticular emphasis on the multimedia laboratory.\nInnovations\nLaboratory study guides or workbooks have been introduced for each term. These guide\nstudents through the dissections and present them with clinical problems in order to focus\ntheir study. Students are expected to fill these in with their own diagrams and notes. An\nextensive collection of potted museum specimens with labels are available for students to\nexplore. Teaching posters addressing specific problems or showing different imaging\ntechniques, such as X-rays, are displayed. The demonstrators who teach the students have\ndiscussed self-directed learning, and have been asked to try to avoid lecturing students\nwhile dissecting a cadaver. Finally, a computer-based learning facility has been\nintroduced. Rather than placing the computers outside of the Topographical Anatomy\nLaboratory, a policy decision was made that an area would be cleared within the existing\nfacility, to be devoted to a small cluster of networked multimedia personal computers.\nThis was intended to allow flexibility of study during any one practical session; thus\nstudents might dissect, explore prosections, posters, etc., then proceed to use the\ncomputer-based learning facilities either to clarify difficult issues or to test the knowledge\nthey believe they have gained within that session.\nA multimedia area with five networked Pentium PCs was set up for the academic year\n1995\/6. A thorough appraisal was made of existing multimedia and other computer-based\nlearning materials in the area of anatomy. Several programs were chosen based on their\nrelevance to the course, the quality and educational value of the graphical and text-based\ninformation, and the self-testing facilities. The students had access to ADAM (Animated\nDissection of Anatomy for Medicine from ADAM Software), Human Anatomy (from\nGold Standard Multimedia), Functional Anatomy of the Heart (from Andromeda\nInteractive), Interactive Skeleton and Imaging Atlas of Human Anatomy (from Primal\nPictures\/Mosby Multimedia), and BodyWorks (from SoftKey Multimedia). These six\nprograms are all quite different in their approach, but complementary. Functional\nAnatomy of the Heart is highly instructional and relies heavily on sound, with a good\nsystem for self-testing that takes students back to the relevant material if they answer\nincorrectly. ADAM, Interactive Skeleton and Imaging Atlas are all strongly based on\nvisuals and allow students to look at structures in detail and label them, but ADAM does\nnot supply any text-based information or self-test facility. Human Anatomy takes a\npractical approach, guiding students step-by-step through dissections, using both text and\nimages extensively, and offering thousands of practical examination questions.\nBodyWorks is aimed at a lower level, but provides a good basic introduction to anatomy\n56\nfia-j Volume 5 Number I\nand the main body systems. Over 3,000 anatomy and developmental biology multiple-\nchoice questions were made available to the students using LAPT (London Agreed\nProtocol for Teaching, Gardner-Medwin, 1995). Although there exists a selection of\nsoftware for gross anatomy, there was nothing for embryology, and the team are\ncurrently involved in the design and authoring of interactive tutorials for this area.\nEvaluation\nThe evaluation involved giving students two sets of questionnaires which assessed their\nexperiences and attitudes. Students and the members of staff involved were interviewed.\nIn addition, the multimedia laboratory was observed periodically over the year. The\nquestionnaires were filled in on a voluntary basis. Table 1 shows the number of students,\nand their year, who filled in the questionnaires.\nTable 1: Number ofresponses\nFirst-years\nSecond-years\nTotal\nTotal number\nof students\n230\n200\n430\nSeptember\n1995\n220\n169\n389\nApril\n1996\n143\n121\n264\nThe students were asked about their use and experience of computers in the first\nquestionnaire. Ninety-five per cent had used a computer, but only 41 per cent had used a\ncomputer for learning (largely second-years who had used LAPT during their first year),\nand only 23 per cent had used a multimedia application before.\nStudents' attitudes\nThe survey of students' attitudes showed that about 10 per cent strongly preferred\nworking on their own, while 12 per cent thought that they did not learn very much in\ngroups. This gives further support to the need to provide a self-directed learning\nlaboratory which allows students to work individually and at their own pace.\nThe students were asked whether or not they thought computers would\/did help them at\nthe beginning and the end of the academic year. The students' attitudes towards\ncomputers changed over the year, and, by the end, 30 per cent thought that computers did\nnot help them much, while at the beginning of the year, 10 per cent of the students had\nthought that computers would not help them. Thus it seems that for some of the students,\nexperience in the laboratory had led to a more negative attitude towards using computers\nfor learning.\nComputer use\nThe multimedia laboratory was usually busy with several groups of students using the\ncomputers, and some individuals working on their own. However, the results of the\nquestionnaire showed that only about a third of the students used the computers,\n57\nKim Issroffet al From cadaver to computer incorporating computers into the topographical anatomy laboratory\nalthough given that there were only five computers and up to 100 students in the\nlaboratory at one time, it is not surprising that they did not all use the computers, and\ncomplained that at times they could not get on a computer or use the appropriate CD-\nROM. Closer observations of what the students were actually doing with the software\nshowed that in groups they often experimented with the software, for example trying\ndifferent views, without really engaging with the material on the screen. Students would\noften quiz each other about labels on diagrams, but very rarely read the text. However,\nstudents who worked as individuals did read the text and appeared to be engaging with\nthe information in a different way from those working in groups.\nThe students were asked how much they used the different packages, and it was very clear\nthat the multiple-choice questions using LAPT were the most used part of the laboratory.\nThis is not surprising because the questions are part of their final assessments, and using\nthis package has direct relevance to their final results. This was confirmed by the results\nfor the first- and second-year anatomy examinations which were considerably higher than\nin the previous year.\nThe students were also asked about the usefulness of various aspects of the packages.\nThey found the diagrams and labels, and especially the questions (particularly first-years)\nuseful, but did not make use of the Help facilities or the text.\nDiscussion\nIt is clear from the results of the questionnaires that students were not making effective\nuse of the multimedia packages. There are several reasons for this. First, there was the\nproblem of having access to a computer and the CD-ROMs at the appropriate time.\nSecondly, as mentioned above, students spent much of their time, using LAPT, answering\nmultiple-choice questions which were part of a bank due to appear in their examinations.\nThirdly, the use of the multimedia packages was not sufficiently integrated into the\ncourse: students did not know which packages to use at different times, and sometimes\nwere unable to access the information that they needed from the packages. This is linked\nto the fourth reason, which is that the students did not have much experience of learning\nwith technology, and did not know how to use their time effectively when working with\ncomputers. This was exacerbated by the nature of the software, most of which takes a\nsystems approach, with the user looking at different views of the whole body rather than\nregionally, which is the way in which the course is structured.\nFor the current academic year, some changes have been made in order to ensure that the\nstudents use the computers effectively. In particular, the students' use of the computers is\nnow incorporated into the laboratory study guides, so that the multimedia laboratory is now\nfully integrated into their course. This has been done by providing an introduction to using\nthe computers and CD-ROMs within the guide, an introduction to each of the packages\ninvolved within the context of the week's subject area, and pointers throughout the\nlaboratory guides to appropriate packages for the particular area that the students are\nstudying. The aim is to scaffold the students' use of the software. Initially, the students are\nprovided with an in-depth worksheet for each application which, crucially, is concerned with\nthe topic they are currently studying. After they have used the software, there are pointers to\nappropriate places within the course at which that software is particularly relevant.\n58\nALT-} Volume 5 Number I\nAt the time of writing (five weeks into the new academic year), indications are that this\nnew approach has transformed the students' attitudes towards computer-based learning.\nUsage of the computers has increased dramatically, and the students are much more\nproactive in their approach.\nConclusions\nMultimedia computer programs are potentially very useful for self-directed learning of\nanatomy, but in order for them to be really effective, students must be guided - at least\ninitially - in how to use them and where to look for the information they require. For\nmedical students, as for most other students, 'What is on the exam?' is a question of\nprimary importance, and they therefore put an emphasis on the resources, such as\ntextbooks and examination questions, that they know will provide them with the fullest\nanswer. In this first year of using computers in the Topographical Anatomy Laboratory,\nthe machines were seen by students as an extra and not relevant for passing the\nexaminations. It is thus essential to integrate the use of computers and the multimedia\npackages directly into the course material so that they can be seen by the students to be a\nbeneficial and necessary part of the course.\nReference\nGardner-Medwin, A.R. (1995), 'Confidence assessment in the teaching of basic science',\nALT-J, 3 (1), 80-5.\n59\n"}