{"doi":"10.1109\/LCOMM.2008.081054","coreId":"102370","oai":"oai:epubs.surrey.ac.uk:1829","identifiers":["oai:epubs.surrey.ac.uk:1829","10.1109\/LCOMM.2008.081054"],"title":"Improved Preamble-Aided Timing Estimation for OFDM Systems","authors":["Awoseyila, AB","Kasparis, C","Evans, BG"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-11","abstract":"<p>An improved method for estimating the frame\/symbol timing offset in preamble-aided OFDM systems is presented. It uses a conventional preamble structure and combines autocorrelation techniques with restricted cross-correlation to achieve a near-ideal timing performance without significant increase in complexity. Computer simulations show that the method is robust in both AWGN and fading multipath channels, achieving better performance than the existing methods.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1829<\/identifier><datestamp>\n      2017-10-31T14:03:18Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:63637372<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1829\/<\/dc:relation><dc:title>\n        Improved Preamble-Aided Timing Estimation for OFDM Systems<\/dc:title><dc:creator>\n        Awoseyila, AB<\/dc:creator><dc:creator>\n        Kasparis, C<\/dc:creator><dc:creator>\n        Evans, BG<\/dc:creator><dc:description>\n        <p>An improved method for estimating the frame\/symbol timing offset in preamble-aided OFDM systems is presented. It uses a conventional preamble structure and combines autocorrelation techniques with restricted cross-correlation to achieve a near-ideal timing performance without significant increase in complexity. Computer simulations show that the method is robust in both AWGN and fading multipath channels, achieving better performance than the existing methods.<\/p><\/dc:description><dc:publisher>\n        IEEE<\/dc:publisher><dc:date>\n        2008-11<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1829\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Awoseyila, AB, Kasparis, C and Evans, BG  (2008) Improved Preamble-Aided Timing Estimation for OFDM Systems   IEEE Communications Letters, 12 (11).  pp. 825-827.      <\/dc:identifier><dc:relation>\n        10.1109\/LCOMM.2008.081054<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1829\/","10.1109\/LCOMM.2008.081054"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"IEEE COMMUNICATIONS LETTERS, VOL. 12, NO. 11, NOVEMBER 2008 825\nImproved Preamble-Aided Timing Estimation for OFDM Systems\nAdegbenga B. Awoseyila, Christos Kasparis and Barry G. Evans\nAbstract—An improved method for estimating the\nframe\/symbol timing offset in preamble-aided OFDM systems\nis presented. It uses a conventional preamble structure and\ncombines autocorrelation techniques with restricted cross-\ncorrelation to achieve a near-ideal timing performance without\nsignificant increase in complexity. Computer simulations show\nthat the method is robust in both AWGN and fading multipath\nchannels, achieving better performance than the existing\nmethods.\nIndex Terms—Autocorrelation, cross-correlation, OFDM,\npreamble, timing synchronization.\nI. INTRODUCTION\nORTHOGONAL Frequency Division Multiplexing(OFDM) is a popular scheme for fixed and wireless\nbroadband applications due to its robustness against\nfrequency-selectivity in the channel [1]. However, OFDM\nsystems are very sensitive to carrier frequency errors and\nquite sensitive to timing errors [1]. Consequently, many\ntechniques have been proposed in the past for estimation of\nthese parameters. In this letter, we focus on preamble-aided\nmethods since they give a more robust estimation performance\nin both continuous and burst applications [2].\nSchmidl [2] proposed using the autocorrelation of a train-\ning symbol with two identical parts to estimate timing and\nfractional frequency offset. An additional training symbol\nis then used along with the first to determine the integer\nfrequency offset. However, Schmidl’s timing metric has an\nuncertainty plateau and the method can yield timing estimates\nwhich are well beyond the ISI-free region, thus leading to\ndegradation in BER performance [1]. Other autocorrelation\nmethods have been proposed by Park [3], Minn [4] and\nShi [5] using different uniquely-designed preamble patterns\nto obtain sharper timing metrics and improve the timing\naccuracy. However, they are not robust in fading and strong-\nISI channels as will be shown in our simulation results.\nTherefore, a new method is presented in order to achieve near-\nideal accuracy (i.e. timing MSE approaching zero) without\nsignificant increase in complexity.\nII. OFDM SIGNAL DESCRIPTION\nThe baseband signal samples at the OFDM transmitter\noutput are given by:\nx (k) =\n1√\nN\nNuse−1∑\n0\nX (n) ej2πkn\/N ; k = 0, 1, · · · , N − 1\n(1)\nManuscript received July 6, 2008. The associate editor coordinating the\nreview of this paper and approving it for publication was S. Buzzi.\nThe authors are with the Centre for Communication Systems Re-\nsearch, University of Surrey, Guildford, GU2 7XH, UK (e-mail:\na.awoseyila@surrey.ac.uk).\nDigital Object Identifier 10.1109\/LCOMM.2008.081054\nwhere N is the total number of subcarriers of which Nuse\nare used, X (n) represents the data modulated on the nth\nsubcarrier while x (k) represents the symbol samples after\nIFFT processing. Each transmitted OFDM symbol is usually\npreceeded by a guard interval or cyclic prefix of length G in\norder to eliminate intersymbol interference (ISI) arising from\nthe wideband channel.\nAssuming sampling precision, the complex-valued samples\nof the received signal can be represented as:\nr (k) =\nL−1∑\n0\nh (m)x (k − \u0002−m) ej2πΔfk\/N + w (k) (2)\nwhere \u0002 is the integer timing offset in samples and Δf is\nthe carrier frequency offset normalized to the subcarrier spac-\ning. w (k) represents the zero-mean complex addditive white\nGaussian noise (AWGN) and h (m) is the impulse response\nof the frequency-selective (ISI) channel whose memory order\nis L-1.\nIII. PROPOSED METHOD\nThe proposed method is multi-stage, wherein a simple au-\ntocorrelation technique and a novel restricted cross-correlation\ntechnique are combined to achieve enhanced estimation per-\nformance. A preamble with two identical parts in time-domain\n(e.g. Schmidl’s training symbol SSch [2]) is chosen since\nit provides for low-complexity coarse timing, reliable ML\nfractional frequency estimation [2] and a wide range integer\nfrequency estimation [6] which is not achievable by the\npreamble structures of [3]-[5].\nSSch =\n[\nAN\/2 AN\/2\n]\n(3)\nwhere AN\/2 is a random sequence of length N \/2, generated\nas specified in [2].\nThis preamble structure also conforms to the WiFi and\nWiMAX standards, wherein only the 2 long identical patterns\nare used in the proposed method while the preceding short\npatterns are excluded via the autocorrelation stage which can\ndifferentiate between the short and long patterns.\nThe coarse timing estimate is derived as follows:\nPSch (d) =\nN\/2−1∑\nk=0\nr∗ (d + k) r (d + k + N\/2) (4)\nMc (d) =\n1\nG + 1\nG∑\nk=0\n|PSch (d− k)|2 (5)\ndˆc = argmax︸ ︷︷ ︸\nd\n{Mc (d)} (6)\n1089-7798\/08$25.00 c© 2008 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 15,2010 at 08:23:42 UTC from IEEE Xplore.  Restrictions apply. \n826 IEEE COMMUNICATIONS LETTERS, VOL. 12, NO. 11, NOVEMBER 2008\nwhere Schmidl’s autocorrelation (PSch) is integrated in (5)\nover the length of the cyclic prefix in order to eliminate its\nuncertainty plateau and achieve a coarse timing metric Mc\nwhose peak indicates the coarse timing estimate dˆc.\ndˆc is subsequently used for frequency offset estimation\n(pre-FFT and post-FFT) via existing techniques such as\nSchmidl’s or Kim’s method which are known to give reliable\nfrequency estimates even with a coarse timing [2],[6]. The\ntotal frequency offset is then corrected in the stored received\nsamples, after which cross-correlation is performed. In an\nISI channel, coherent cross-correlation between a frequency-\ncorrected received preamble and its purely random transmitted\nversion will yield a set of very sharp peaks (impulses) which\nindicate all the arriving paths from the channel [7],[8]. For\na preamble having two identical parts, the coherent cross-\ncorrelation will yield three distinct sets of impulses.\nFig. 1 shows an example cross-correlation of the preamble\nSSch under no channel distortion, wherein there is a major\npeak in the middle corresponding to a full-symbol pattern\nmatch and two minor peaks at half a symbol away correspond-\ning to a half-symbol pattern match. The minor peaks which\nare due to the symmetric structure in (4) constitute a major\nhindrance to using such preamble for cross-correlation timing\nin a fading and\/or noisy channel. This problem is solved using\na novel approach as follows:\nThe minor cross-correlation peaks occur at a half-symbol\ntiming error and the autocorrelation metric is significantly\nlow at such region [2] as illustrated in Fig. 1. Therefore,\nthe autocorrelation can be used to filter the unwanted minor\npeaks. One way to achieve this is to simply multiply both\nmetrics together. This multiplication can be restricted to a\ntiming window of one symbol length N , symmetric around\nthe coarse timing estimate dˆc as shown in (7)-(9), in order\nto reduce computational complexity. The filtering helps to\ndetermine the major peak which corresponds to the strongest\narriving path. A restricted timing adjustment window is also\nproposed for the chosen preamble in ISI channels, based on\nthe relative location of the minor and major cross-correlation\npeaks and the expected channel delay spread, in order to track\nthe cross-correlation peak that corresponds to the first arriving\nchannel path with high efficiency as shown in (10)-(11).\nThe restricted cross-correlation stage is summarized as\nfollows:\nPx (d) =\nN−1∑\nk=0\nrcorT (d + k)S∗Sch (k);\nd ∈\n{\ndˆc −N\/2, dˆc + N\/2\n}\n(7)\nMopt (d) = |Px (d)|2 ·Mc (d) ;\nd ∈\n{\ndˆc −N\/2, dˆc + N\/2\n}\n(8)\ndˆopt = argmax︸ ︷︷ ︸\nd\n{Mopt (d)};\nd ∈\n{\ndˆc −N\/2, dˆc + N\/2\n}\n(9)\n−1 −0.5 0 0.5 1\n0\n1\n2\n3\n4\n5\n6\n7\nx 10\n4\nTiming error (symbols)\nC\nor\nre\nla\ntio\nn \nm\net\nric\n v\nal\nue\n \n \ncross−corr\nautocorr\nFig. 1. Autocorrelation and cross-correlation metrics for the proposed method\nunder no channel distortion; N=256, G=16.\ndˆFFT = argfirst︸ ︷︷ ︸\nd\n{|Px (d)| > Tth};\nd ∈\n{\ndˆopt − λ, dˆopt\n}\n(10)\nTth =\n√\n− (4\/π) \u0005n (PFA) · (mean {|Px (d)|}) ;\nd ∈\n{\ndˆopt −N\/2 + λ + 1, dˆopt − λ− 1\n}\n(11)\nwhere rcorT is the total-frequency corrected signal, Px (d) is\nthe restricted cross-correlation, Mopt (d) is the filtered timing\nmetric and d is chosen in (7-9) to ensure that all relevant\ntiming points that could be the ideal timing are tracked. d is\nchosen in (10) such as to track the first arriving path (dˆFFT )\nwhich may not always be the strongest arriving path (dˆopt),\nwherein all channel paths are expected to be received within\nλ + 1 samples: (L − 1 ≤ λ ≤ G). In (11), d is chosen such\nas to exclude major and minor peaks and their multipath, in\norder to calculate a threshold Tth using the mean correlation\nof neutral timing points. The first arriving channel path (or\nany other one) is expected to have a correlation which is\ngreater than this threshold. The approach is inherited from\n[7] based on the central limit theorem and the Rayleigh CDF,\nwith PFA being the probability of false alarm. Deriving from\nextensive simulations, PFA is chosen as 10−6 similar to [7].\nThe threshold Tth is used to detect the ideal timing dˆFFT .\nIV. COMPUTER SIMULATIONS\nComputer simulations were performed to verify the perfor-\nmance of the proposed method in comparison to the existing\nmethods. QPSK sub-carrier modulation is used with a normal-\nized frequency offset Δf= 0.1. In Fig. 2, an FFT size: N=64,\ncyclic prefix length: G=16 and ISI parameter: λ=0 is used in\nan AWGN channel, whereas in Fig. 3, a WiMAX test case of\nN=256, G=16 and λ=16 is used in an ISI channel consisting\nof L=8 paths with path delays of τi = 0, 1, · · · , L−1 samples\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 15,2010 at 08:23:42 UTC from IEEE Xplore.  Restrictions apply. \nAWOSEYILA et al.: IMPROVED PREAMBLE-AIDED TIMING ESTIMATION FOR OFDM SYSTEMS 827\n0 5 10 15 20\n10\n−3\n10\n−2\n10\n−1\n10\n0\n10\n1\n10\n2\n10\n3\nT\nim\nin\ng \nM\nS\nE\nSNR (dB)\n \n \nPark\nProposed\nSchmidl\nShi\nMinn\nFig. 2. MSE of estimators in an AWGN channel; N=64, G=16.\n0 5 10 15 20\n10\n−2\n10\n0\n10\n2\n10\n4\nT\nim\nin\ng \nM\nS\nE\nSNR (dB)\nPark\nProposed\nSchmidl\nShi\nMinn\nFig. 3. MSE of estimators in a Rayleigh fading ISI channel; N=256, G=16.\nand an exponential power delay profile having average power\nof e(−τi\/L) as used in [1], wherein each path undergoes\nindependent Rayleigh fading. A training symbol with sixteen\nsegments as specified in [4] is used with Minn’s method.\nFig. 2 and Fig. 3 show that the proposed method achieves a\nsuperior performance to the existing methods in both AWGN\nand Rayleigh fading ISI channels in terms of timing mean-\nsquare-error (MSE). Although Minn and Shi use a significant\nincrease in computations to achieve an improvement over\nSchmidl’s method, their timing estimates still tend to be\nbiased towards the strongest arriving path and extrinsic timing\nadjustment is consequently required.\nV. CONCLUSIONS\nIn this letter, we have presented an improved method for\ntiming estimation in OFDM systems, based on restricted\ncross-correlation and timing adjustment. Results show that its\nperformance is significantly better than the existing methods in\nboth AWGN and fading ISI channels. Furthermore, its pream-\nble structure is compatible with current wireless networking\nstandards.\nACKNOWLEDGMENT\nThis work was supported in part by the European SatNEx\nII programme.\nREFERENCES\n[1] M. Morelli, C.-C.J. Kuo, and M.-O. Pun, “Synchronization techniques\nfor orthogonal frequency division multiple access (OFDMA): a tutorial\nreview,” Proc. IEEE, vol. 95, no. 7, pp. 1394-1427, July 2007.\n[2] T. Schmidl and D. C. Cox, “Robust frequency and timing synchronization\nfor OFDM,” IEEE Trans. Commun., vol. 45, no. 12, p. 1613-1621, Dec.\n1997.\n[3] B. Park, H. Cheon, C. Kang, and D. Hong, “A novel timing estimation\nmethod for OFDM systems,” IEEE Commun. Lett., vol. 7, no. 5, pp.\n239-241, May 2003.\n[4] H. Minn, V. K. Bhargava, and K. B. Letaief, “A robust timing and\nfrequency synchronization for OFDM systems,” IEEE Trans. Wireless\nCommun., vol. 2, no. 4, pp. 822-839, July 2003.\n[5] K. Shi and E. Serpedin, “Coarse frame and carrier synchronization of\nOFDM systems: a new metric and comparison,” IEEE Trans. Wireless\nCommun., vol. 3, no. 4, pp. 1271-1284, July 2004.\n[6] Y. H. Kim, I. Song, S. Yoon, and S. Park, “An efficient frequency offset\nestimator for OFDM systems and its performance characteristics,” IEEE\nTrans. Veh. Technol., vol. 50, no. 5, pp. 1307-1312, Sept. 2001.\n[7] C. Kasparis and B. G. Evans, “A cross-correlation approach for improved\ntiming estimation in OFDM broadcasting systems,” in Proc. 24th AIAA\nIntl. Commun. Satell. Sys. Conf. (ICSSC), pp. 1039-1048, June 2006.\n[8] A. Fort et al., “A performance and complexity comparison of auto-\ncorrelation and cross-correlation for OFDM burst synchronization,” in\nProc. IEEE Intl. Conf. Acoustics Speech Signal Process., vol. 2, pp. 341-\n344, Apr. 2003.\nAuthorized licensed use limited to: University of Surrey. Downloaded on April 15,2010 at 08:23:42 UTC from IEEE Xplore.  Restrictions apply. \n"}