{"doi":"10.1086\/513804","coreId":"69964","oai":"oai:eprints.lancs.ac.uk:19456","identifiers":["oai:eprints.lancs.ac.uk:19456","10.1086\/513804"],"title":"A randomised, double-blind trial of valaciclovir prophylaxis for cytomegalovirus disease in patients with advanced human immunodeficiency virus infection.","authors":["Feinburg, Judith E.","Hurwitz, Shelley","Cooper, David","Sattler, Fred R.","Macgregor, Rob Roy","Holland, Gary N.","Griffiths, Paul D.","Pollard, Richard","Youle, Michael","Gill, M. John","Holland, Fiona J","et al, ."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1998-01","abstract":"Cytomegalovirus (CMV) disease is a common complication of advanced human immunodeficiency virus (HIV) infection. Administration of oral valaciclovir, a valine ester of acyclovir, achieves sufficient plasma acyclovir levels to inhibit many clinical isolates. Acyclovir has been associated with enhanced survival in AIDS but not with CMV disease prevention. CMV-seropositive patients (1227) with CD4 cell counts <100\/mm3 were enrolled in a randomized, double-blind trial. Valaciclovir, 8 g\/day, was compared with acyclovir, 3.2 or 0.8 g\/day, for CMV prevention; all three arms were compared for survival. The confirmed CMV disease rate was 11.7% among valaciclovir recipients and 17.5% in the pooled acyclovir arms, a 33% reduction in risk. Time to confirmed CMV disease was significantly longer for the valaciclovir group (P = .03). A trend toward earlier mortality for valaciclovir recipients was seen (P = .06). Toxicity and earlier medication discontinuation were more common in this group. Valaciclovir significantly reduces the risk of CMV disease. Further exploration of a better-tolerated dose is warranted","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69964.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/19456\/1\/513804.pdf","pdfHashValue":"befeb2c2a7ae7d94186061c1db40b6330c37b7b7","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:19456<\/identifier><datestamp>\n      2018-01-24T00:05:20Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5141<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A randomised, double-blind trial of valaciclovir prophylaxis for cytomegalovirus disease in patients with advanced human immunodeficiency virus infection.<\/dc:title><dc:creator>\n        Feinburg, Judith E.<\/dc:creator><dc:creator>\n        Hurwitz, Shelley<\/dc:creator><dc:creator>\n        Cooper, David<\/dc:creator><dc:creator>\n        Sattler, Fred R.<\/dc:creator><dc:creator>\n        Macgregor, Rob Roy<\/dc:creator><dc:creator>\n        Holland, Gary N.<\/dc:creator><dc:creator>\n        Griffiths, Paul D.<\/dc:creator><dc:creator>\n        Pollard, Richard<\/dc:creator><dc:creator>\n        Youle, Michael<\/dc:creator><dc:creator>\n        Gill, M. John<\/dc:creator><dc:creator>\n        Holland, Fiona J<\/dc:creator><dc:creator>\n        et al, .<\/dc:creator><dc:subject>\n        QA Mathematics<\/dc:subject><dc:description>\n        Cytomegalovirus (CMV) disease is a common complication of advanced human immunodeficiency virus (HIV) infection. Administration of oral valaciclovir, a valine ester of acyclovir, achieves sufficient plasma acyclovir levels to inhibit many clinical isolates. Acyclovir has been associated with enhanced survival in AIDS but not with CMV disease prevention. CMV-seropositive patients (1227) with CD4 cell counts <100\/mm3 were enrolled in a randomized, double-blind trial. Valaciclovir, 8 g\/day, was compared with acyclovir, 3.2 or 0.8 g\/day, for CMV prevention; all three arms were compared for survival. The confirmed CMV disease rate was 11.7% among valaciclovir recipients and 17.5% in the pooled acyclovir arms, a 33% reduction in risk. Time to confirmed CMV disease was significantly longer for the valaciclovir group (P = .03). A trend toward earlier mortality for valaciclovir recipients was seen (P = .06). Toxicity and earlier medication discontinuation were more common in this group. Valaciclovir significantly reduces the risk of CMV disease. Further exploration of a better-tolerated dose is warranted.<\/dc:description><dc:date>\n        1998-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1086\/513804<\/dc:relation><dc:identifier>\n        Feinburg, Judith E. and Hurwitz, Shelley and Cooper, David and Sattler, Fred R. and Macgregor, Rob Roy and Holland, Gary N. and Griffiths, Paul D. and Pollard, Richard and Youle, Michael and Gill, M. John and Holland, Fiona J and et al, . (1998) A randomised, double-blind trial of valaciclovir prophylaxis for cytomegalovirus disease in patients with advanced human immunodeficiency virus infection. Journal of Infectious Diseases, 177 (1). pp. 48-56. ISSN 0022-1899<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/19456\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1086\/513804","http:\/\/eprints.lancs.ac.uk\/19456\/"],"year":1998,"topics":["QA Mathematics"],"subject":["Journal Article","PeerReviewed"],"fullText":"48\nA Randomized, Double-Blind Trial of Valaciclovir Prophylaxis for\nCytomegalovirus Disease in Patients with Advanced Human Immunodeficiency\nVirus Infection\nJudith E. Feinberg, Shelley Hurwitz,* David Cooper, Department of Medicine, University of Cincinnati, Cincinnati, Ohio;\nHarvard School of Public Health, Boston, Massachusetts; NationalFred R. Sattler, Rob Roy MacGregor, William Powderly,\nCentre in HIV Epidemiology and Clinical Research, Sydney, Australia;Gary N. Holland, Paul D. Griffiths, Richard B. Pollard,\nUniversity of California, Los Angeles, and University of Southern\nMichael Youle, M. John Gill, Fiona J. Holland, California, Los Angeles, and University of California, San Francisco,\nMaureen E. Power, Susan Owens, Dion Coakley,* California; University of Pennsylvania, Philadelphia; Washington\nJohn Fry,* and Mark A. Jacobson for the AIDS Clinical University, St. Louis, Missouri; Royal Free Hospital School of Medicine\nand Kobler Centre, London, United Kingdom; University of Texas,Trials Group Protocol 204\/Glaxo Wellcome 123-014\nGalveston; University of Calgary, Calgary, Canada; Division of AIDS,International CMV Prophylaxis Study Group†\nNational Institute of Allergy and Infectious Diseases, National Institutes\nof Health, Bethesda, Maryland; Glaxo Wellcome Antiviral Clinical\nResearch, Research Triangle Park, Maryland, and Beckenham,\nUnited Kingdom\nCytomegalovirus (CMV) disease is a common complication of advanced human immunodeficiency\nvirus (HIV) infection. Administration of oral valaciclovir, a valine ester of acyclovir, achieves\nsufficient plasma acyclovir levels to inhibit many clinical isolates. Acyclovir has been associated\nwith enhanced survival in AIDS but not with CMV disease prevention. CMV-seropositive patients\n(1227) with CD4 cell counts \u009b100\/mm3 were enrolled in a randomized, double-blind trial. Valaci-\nclovir, 8 g\/day, was compared with acyclovir, 3.2 or 0.8 g\/day, for CMV prevention; all three arms\nwere compared for survival. The confirmed CMV disease rate was 11.7% among valaciclovir recipi-\nents and 17.5% in the pooled acyclovir arms, a 33% reduction in risk. Time to confirmed CMV\ndisease was significantly longer for the valaciclovir group (P \u0081 .03). A trend toward earlier mortality\nfor valaciclovir recipients was seen (P \u0081 .06). Toxicity and earlier medication discontinuation were\nmore common in this group. Valaciclovir significantly reduces the risk of CMV disease. Further\nexploration of a better-tolerated dose is warranted.\nCytomegalovirus (CMV) end-organ disease, especially reti- retinitis, which accounts for \u009c80% of end-organ disease [2],\nnitis, is a common serious complication of advanced human causes retinal necrosis and may progress to blindness. Treat-\nimmunodeficiency virus (HIV) infection, affecting \u008225%– ment of established disease requires lifelong parenteral or intra-\n40% of those with very low CD4 cell counts [1–3]. CMV ocular administration of virustatic agents (ganciclovir, foscar-\nnet, and recently, cidofovir) that are toxic and expensive.\nDespite treatment, progression of retinal lesions typically oc-\nReceived 6 January 1997; revised 9 July 1997. curs [4], making prevention of CMV end-organ disease a high\nPresented in part: 35th Interscience Conference on Antimicrobial Agents\npriority.and Chemotherapy, San Francisco, September 1995 (abstract 1214); XI Interna-\nHigh-dose acyclovir has been effective in reducing CMVtional Conference on AIDS, Vancouver, July 1996 (abstract Th.B.300).\nGuidelines for human experimentation of the US Department of Health and disease in bone marrow, renal, and liver transplant recipients\nHuman Services as defined by the National Institutes of Health Office for the\n[5–7]. Valaciclovir, a valine ester of acyclovir, is rapidly andProtection of Research Risks (OPRR) were followed by all participating re-\nalmost completely converted to acyclovir after oral administra-search sites, and informed consent according to OPRR guidelines was obtained\nfrom all participants. tion, achieving 3- to 4-fold-higher total plasma acyclovir expo-\nFinancial support: NIH (AIDS Clinical Trials Group and participating AIDS\nsure than is possible with oral acyclovir [8]. Valaciclovir, 2 gClinical Trials Units), Australian National Council on AIDS, Netherlands Na-\nfour times daily, results in total acyclovir exposure similar totional AIDS Therapy Evaluation Centre, and Glaxo Wellcome. All non-US\ninvestigators received grants from Glaxo Wellcome for the conduct of the that achieved with intravenous dosing at 10 mg\/kg three times\nstudy, including authors D.C., M.Y., M.J.G.; all US ACTG investigators re-\nceived limited grant support from Glaxo Wellcome for costs incurred for\nophthalmologic monitoring and specimen shipment to the study repository in\nTexas, including authors J.E.F., F.R.S., R.R.M., W.P., R.B.P., and M.A.J. The\nReprints or correspondence: Dr. Judith E. Feinberg, University of Cincinnati,investigators in charge of the two study virology laboratories and specimen\nHolmes Hospital, Eden and Bethesda Aves., Cincinnati, OH 45267-0405repositories (R.B.P., P.D.G.) and the fundus photograph reading center\n(feinbej@email.uc.edu).(G.N.H.) received grants from Glaxo Wellcome for support of these activities.\n* Present affiliations: Harvard Medical School, Boston (S.H.); Gilead Sci-S.H. and G.N.H. received travel grants from Glaxo Wellcome to attend Interna-\nences, Foster City (D.C.); Abbott Laboratories, Maidenhead, United Kingdomtional Steering Committee meetings. Several authors have served as consultants\n(J.F.).to Glaxo Wellcome (J.E.F., P.D.G., M.A.J.). J.F. and D.C. were Glaxo Well-\n† Study group members are listed in Appendix.come employees at the time the study was designed and conducted.\nValaciclovir is the International Non-proprietary Name–approved name and The Journal of Infectious Diseases 1998;177:48–56\nis used throughout; valacyclovir hydrochloride is the US Adopted Name– q 1998 by The University of Chicago. All rights reserved.\n0022–1899\/98\/7701–0009$02.00approved name.\n\/ 9D3D$$JA03 10-31-97 15:31:45 jinfal UC: J Infect\n49JID 1998;177 (January) Valaciclovir for CMV Prophylaxis in AIDS\nof 18 pills per day. All medications considered essential for optimaldaily, which is sufficient to inhibit many clinical strains of\ncare were permitted, except anti-CMV agents and immunomodula-CMV [9].\ntors. Simultaneous enrollment in other studies of HIV disease man-Oral acyclovir prophylaxis for recurrent herpes simplex virus\nagement was encouraged.(HSV) infections is commonly used in patients with advanced\nDesign and study conduct. Comparison of the valaciclovir armHIV disease. Two prospective randomized studies of such pa-\nwith the pooled acyclovir arms for the prevention of CMV end-\ntient populations have shown a survival advantage associated\norgan disease, provided the acyclovir arms were not different, was\nwith high-dose acyclovir compared with placebo [10, 11] but specified in the protocol. The higher acyclovir dose (3.2 g\/day)\nno significant effect on the development of CMV disease, and had been shown in two previous placebo-controlled trials to be\na third study failed to demonstrate an effect on CMV cultures ineffective for preventing CMV disease in patients with advanced\n[12]. Retrospective studies have demonstrated discordant re- HIV infection [10, 11], and it was anticipated that the lower dose\nof acyclovir would also be ineffective. The 3.2 g\/day dose wassults on mortality with acyclovir use [13, 14]. It is possible\nassociated with a survival advantage in these studies, so investiga-that clinically silent herpesvirus replication may up-regulate\ntion of the effect of both lower and higher delivered doses ofHIV replication [15, 16], an effect that could be mitigated by\nacyclovir was planned to explore a possible dose-effect relation-acyclovir.\nship. This analysis would compare the survival experience of theWe conducted a randomized, double-blind, comparative\nthree arms in pairwise fashion. A target sample size of 1200 pa-study of valaciclovir, 2 g four times daily, and two doses of\ntients, with 12 months of planned follow-up after entry of the last\noral acyclovir for the prevention of CMV end-organ disease\nsubject, was selected to provide at least 82% power to detect an\nand mortality in persons with advanced HIV disease. A phar- approximate doubling of the median CMV-free time for valaci-\nmacokinetic study defined this valaciclovir dose as the maxi- clovir relative to the pooled acyclovir arms and to detect a 55%\nmum tolerated dose in AIDS patients [8]. A high dose of increase in median survival for pairwise comparison among the\nacyclovir, 800 mg four times daily, was the dose used in the three arms.\nParticipants were evaluated at baseline, week 4, and week 8 andplacebo-controlled trials that reported a survival benefit without\nevery 8 weeks thereafter. At each visit, blood was obtained foraffecting CMV disease incidence [10, 11]. A lower dose, 400\nroutine laboratory tests, serum and plasma specimens were banked,mg twice daily, was chosen to suppress HSV recurrences and\nurine was cultured for CMV according to local methods, and qual-to prevent possible unblinding that might occur with a placebo.\nity-of-life measures were assessed. CD4 cell counts and HIV p24Use of three different delivered doses of acyclovir permitted\nantigen determinations were obtained every 24 weeks.exploration of a possible dose-effect relationship on survival.\nAs this was a collaborative effort of the AIDS Clinical Trials\nGroup (ACTG) and investigators in Europe, Canada, and Australia,\nan International Steering Committee was formed with appropriateMethods\nrepresentation. The committee met semiannually and provided\noverall governance to the diverse study sites.Subjects. Eligible subjects were ⁄13 years old, with labora-\ntory evidence of HIV infection or a clinical diagnosis of AIDS, Dose modification and toxicity management. Since acyclovir\nis generally well-tolerated, even by patients with advanced HIVan absolute CD4 lymphocyte count\u009b100\/mm3, serologic evidence\nof prior CMV infection, a Karnofsky performance score ⁄60, and disease, study drug dosing was modified only for diminished renal\nfunction (estimated creatinine clearance,\u009b50 mL\/min) that wouldno evidence of CMV end-organ disease. All participants were\nevaluated for possible retinitis within 21 days before entry by an impair acyclovir elimination. When significant toxicity (grade 3 or\nhigher according to the standard ACTG toxicity grading scheme)experienced ophthalmologist who used dilated indirect fundos-\ncopy. Patients with symptoms associated with extraocular CMV occurred, a trial of interruption, dose reduction, or discontinuation\nwas advised for potentially toxic nonstudy medications. If thesyndromes were required to undergo additional medical evaluation\nas indicated to rule out preexisting CMV disease. Participants had toxicity did not resolve, study drug was then interrupted. If toxicity\nattributed to study drug did not resolve within 30 days, studyto be receiving all medications for HIV and opportunistic infec-\ntions for at least 30 days before entry; there were no restrictions medication was permanently discontinued until a protocol amend-\nment (July 1994) allowed patients to restart study drug after anon these therapies.\nPatients were ineligible if they had chronic nausea or vomiting, interruption of up to 6 months for any reason. Study drug formula-\ntion included 3.6, 10.9, and 13.4 g of lactose\/day for valaciclovir,ocular media opacities, or necrotizing retinopathy, were pregnant\nor breast-feeding, had a history of hypersensitivity to acyclovir or high-dose acyclovir, and low-dose acyclovir, respectively. Symp-\ntoms suggestive of lactose intolerance were managed with dietaryknown lactose intolerance, had received immunomodulators within\n30 days before entry, had previously received anti-CMV agents, modification or a trial of lactase (or both).\nCMV disease end-point evaluations. Study ophthalmologistsor had any of the following laboratory values: absolute neutrophil\ncount \u009b500\/mm3, estimated creatinine clearance \u009b50 mL\/min, performed dilated indirect funduscopy in all subjects every 24\nweeks and whenever new visual complaints arose. Retinal photo-total bilirubin\u009c5 mg\/dL, or serum aminotransferase\u009c5 times the\nupper limit of normal. graphs were taken to document CMV retinitis and were verified\nby an independent fundus photograph reading center that wasRandomization and treatment. Participants were randomized\nin a 3:2:2 ratio to valaciclovir, 2 g four times daily, high-dose masked to study drug assignment. Participants were evaluated at\nboth scheduled and symptom-driven visits for signs and symptomsacyclovir, 800 mg four times daily, or low-dose acyclovir, 400 mg\ntwice daily. Patients were stratified by baseline CD4 cell count: of possible extraocular CMV disease by use of a standardized\nquestionnaire. Additional medical assessment was directed by the\u009b50 and 50–100\/mm3. Double-blinding required administration\n\/ 9D3D$$JA03 10-31-97 15:31:45 jinfal UC: J Infect\n50 Feinberg et al. JID 1998;177 (January)\nsite investigator. Diagnostic criteria for confirmed extraocular dis- dose acyclovir, and low-dose acyclovir, respectively) or by\nease, as defined in the protocol, were based on a compatible clinical drug (7.1% for valaciclovir and 6.1% for acyclovir) were\nsyndrome with histologic evidence of invasive CMV disease. Data similar.\npertaining to all extraocular disease, including presentation, radio- CMV disease end points. One hundred eighty-four patients\nlogic evaluation, and results of diagnostic procedures and labora- (15% overall) had confirmed CMV end-organ disease (table\ntory testing, were reviewed by an international committee of seven\n2). Forty-eight patients (3.9%) had end points reported that\ninvestigators blinded to site and study drug assignment. Neither\ncould not be confirmed because of missing critical data, suchCMV viremia nor a positive culture from any site without clinical\nas retinal photographs or tissue histology. Eighteen end pointsand histologic evidence of invasive disease was considered an end\n(1.5%) were rejected because they failed to meet predefinedpoint.\ncriteria; all but 2 of these were cases of extraocular disease.Statistical methods and interim analyses. Primary analyses in-\ncluded all eligible participants according to their randomized treat- Most confirmed end points (77.2%) occurred in patients with\nment assignment (intent-to-treat principle). The Kruskal-Wallis \u009b50 CD4 cells at entry.\ntest was used for comparisons of ordinal data and the x2 test for The valaciclovir arm was compared with the two pooled\nnominal data. Product-limit estimates were used to summarize acyclovir arms for prevention of CMV disease, according to\ntime-to-event data [17]. The log rank test was used for comparing the protocol, because the two acyclovir arms were similar\ntime-to-event distributions [18, 19]. Cumulative incidence analysis (P \u0081 .67). The confirmed end-point rates were 11.7% and\nwas done to assess the risk of developing CMV disease in the face\n17.5% for valaciclovir and acyclovir, respectively, representing\nof competing mortality [20]. All tests of significance were two-\na 33% reduction for those randomized to valaciclovir. Timesided. All P values reported are nominal P values, unadjusted for\nto confirmed CMV disease was significantly longer for theinterim analyses or for multiple comparisons.\nvalaciclovir group than for those assigned to acyclovir (PThe study was monitored by an independent data and safety\n\u0081 .03; figure 1). The hazard ratio (HR) for valaciclovir relativemonitoring board, following an O’Brien-Fleming group sequential\napproach [21]. At the third scheduled interim analysis for efficacy, to acyclovir was 0.71 (95% confidence interval [CI], 0.52–\nwith 57% of the total end points reported, significantly earlier 0.97), consistent with a significant reduction in the risk for\nmortality was seen in the valaciclovir arm, with only a trend toward CMV disease. The estimated 12-month rates for confirmed end\na CMV preventive effect. The study was terminated at that time, points were 10% for valaciclovir and 14.6% for acyclovir.\nwith all follow-up visits completed by May 1995 and data collec- A number of secondary analyses were done. When all re-\ntion completed by August 1995. ported (confirmed plus presumptive) end points were consid-\nered, the protective effect of valaciclovir in delaying time to\nfirst CMV disease persisted (P \u0081 .009; table 2). ConsideringResults\nonly the 122 end points (66%) that occurred while participants\nwere receiving assigned study medication or within 14 daysStudy population. Enrollment of 1227 subjects at 72 sites\nbegan in December 1992 and ended in October 1994. Sixty- of its discontinuation (as-treated analysis), valaciclovir was\nsignificantly more effective than acyclovir (P \u0081 .006). In asix percent were enrolled at ACTG sites in the United States\nand 34% at sites in Canada, Australia, and Europe. Seventy cumulative incidence analysis of CMV end points that ac-\ncounted for the competing risk of death, valaciclovir signifi-participants (5.7%) had 73 eligibility exemptions, primarily for\nlaboratory values out of range or out of date. Participants were cantly reduced the risk of CMV disease relative to acyclovir\n(P \u0081 .006).primarily white, non-Hispanic (79.8%) men (93.9%) who had\nnever injected drugs (92.3%). The treatment arms were compa- Baseline positive urine cultures were predictive of future\nCMV disease. Seventy-nine CMV end points (23.9%) occurredrable with respect to selected baseline characteristics (table 1).\nFewer than half (44.6%) had urine cultures positive for CMV among those with positive cultures at entry, whereas only\n46 (11.2%) occurred among those with negative cultures (Pat entry. The median CD4 cell count was 32\/mm3, and 67.9%\nhad \u009b50 cells\/mm3. Prophylaxis for Pneumocystis carinii \u009b .001). In multivariate analyses that included baseline demo-\ngraphics, laboratory values, urine culture results, time of urinepneumonia, Mycobacterium avium complex (MAC) infection,\nand fungal infections were used by 96.5%, 26.2%, and 53.3%, culture conversion, other diagnoses, and antiretroviral use, va-\nlaciclovir was significantly protective (P \u009b .05). A greaterrespectively, and was balanced among the arms. There were\nno significant differences in the use of one or more antiretrovi- protective effect was seen in the higher CD4 cell count stratum\n(⁄50) at entry, with rates of 4% and 16%, respectively, forral agents (zidovudine, didanosine, zalcitabine, stavudine, or\nnevirapine), taken by 79.2% overall, or for prior diagnoses of valaciclovir and the pooled acyclovir arms (P \u0081 .001) com-\npared with 15% and 18%, respectively, for those with entryHSV or varicella-zoster virus infection, Kaposi’s sarcoma,\nP. carinii pneumonia, or disseminated MAC infection. The CD4 cell count \u009b50 (P \u0081 .57).\nCMV retinitis accounted for 79.3% of end points and gastro-median duration of study treatment was 29, 36, and 40 weeks\nfor valaciclovir, high-dose acyclovir, and low-dose acyclovir, intestinal disease for 15.2%; other diagnoses were relatively\ninfrequent (table 3). Despite small numbers, a proportionalrespectively; however, the median duration of follow-up was\ncomparable at 57, 56, and 60 weeks. Loss to follow-up rates reduction in all CMV diagnoses was seen for valaciclovir.\nThere were no significant differences among the arms withby study arm (7.1%, 7.9%, and 4.3% for valaciclovir, high-\n\/ 9D3D$$JA03 10-31-97 15:31:45 jinfal UC: J Infect\n51JID 1998;177 (January) Valaciclovir for CMV Prophylaxis in AIDS\nTable 1. Selected baseline characteristics of patients with advanced HIV infection participating in\nvalaciclovir CMV prophylaxis study.\nVACV HACV LACV Total\n(n \u0081 523) (n \u0081 353) (n \u0081 351) (n \u0081 1227) P*\nMale (%) 93.9 94.3 93.4 93.9 0.89\nAge, years (median) 38 37 37 37 0.42\nRace\/ethnicity (%)\nWhite, non-Hispanic 80.3 81.0 77.8 79.8 0.57\nBlack, non-Hispanic 11.7 9.9 11.4 11.1\nHispanic 5.7 7.4 9.1 7.2\nOther 2.3 1.7 1.7 2.0\nNo injection drug use (%) 92.5 92.4 91.7 92.3 0.91\nKarnofsky score (median) 90 90 90 90 0.59\nCD4 cells\/mm3 (median) 31 33 33 32 0.95\n% with \u009b50\/mm3 66.9 68.6 68.7 67.9\nHemoglobin ⁄7 g\/dL (%) 99.2 99.4 98.9 99.2 0.29\nUrine CMV culture-positive (%)† 48.9 42.5 40.1 44.6 0.10\nAny antiretroviral use 78.2 79.9 80.1 79.2 0.75\nProphylaxis (%)\nPCP 96.7 96.3 96.3 96.5 0.92\nMAC 27.2 23.5 27.6 26.2 0.38\nFungal 53.5 52.7 53.6 53.3 0.96\nPrior diagnosis (%)\nHSV or VZV 45.5 45.6 44.7 45.3 0.97\nKaposi’s sarcoma 14.0 10.2 11.7 12.2 0.23\nPCP 26.8 26.1 26.5 26.5 0.97\nMAC 5.7 7.6 5.7 6.3 0.45\nNOTE. VACV\u0081 valaciclovir; HACV\u0081 high-dose acyclovir; LACV\u0081 low-dose acyclovir. PCP\u0081 Pneumocystis\ncarinii pneumonia; MAC \u0081 Mycobacterium avium complex; HSV \u0081 herpes simplex virus; VZV \u0081 varicella zoster\nvirus.\n* All tests of significance were Pearson’s x2 test, except for age, CD4 cell count (Kruskal-Wallis test).\n† Based on total of 742 evaluable cultures: VACV, 323; HACV, 212; LACV, 207.\nregard to the development of varicella-zoster virus or HSV among the 411 patients who were culture-negative at entry\n(P\u009b .001) and decreased the duration of viral shedding amonginfections or for new diagnoses of Kaposi’s sarcoma.\nAntiviral activity. The effect of valaciclovir on recovery of the 331 who were culture-positive at entry (P \u0081 .003; figure\n2). Although viral shedding may be intermittent in the absenceCMV from urine cultures was analyzed according to whether\nthe baseline culture result was negative or positive. Valaciclovir of specific anti-CMV therapy, these results suggest that valaci-\nclovir had a greater antiviral effect than acyclovir. Antiviralboth significantly delayed the time to first positive culture\nTable 2. CMV disease end points in patients with advanced HIV\ninfection: valaciclovir versus pooled acyclovir groups.\nVACV HACV \/ LACV* Total\nEnd point (n \u0081 523) (n \u0081 704) (n \u0081 1227)\nReported 83 (16.8) 167 (23.7) 250 (20.4)†\nConfirmed‡ 61 (11.7) 123 (17.5) 184 (15.0)\nRejected 4 (0.8) 14 (2.0) 18 (1.5)\nUnevaluable 18 (3.4) 30 (4.3) 48 (3.9)\nNOTE. Data are no. (%). VACV \u0081 valaciclovir; HACV \u0081 high-dose\nacyclovir; LACV \u0081 low-dose acyclovir.\n* Planned analysis for efficacy of prophylaxis was comparison of VACV\nwith pooled ACV arms.\nFigure 1. Kaplan-Meier plot of time to first confirmed CMV end-† 29 patients had multiple end points reported, for total of 285 CMV end\norgan disease in valaciclovir CMV prophylaxis study. Valaciclovirpoints.\n(VACV) significantly delayed time to first confirmed CMV disease‡ Only patients’ first confirmed end point was considered for primary analy-\nsis. compared with pooled acyclovir (ACV) arms (P \u0081 .03, log rank test).\n\/ 9D3D$$JA03 10-31-97 15:31:45 jinfal UC: J Infect\n52 Feinberg et al. JID 1998;177 (January)\nTable 3. Distribution of CMV syndromes among participants with\nconfirmed end points in CMV prophylaxis trial.\nVACV HACV \/ LACV Total\nSyndrome (n \u0081 523) (n \u0081 704) (n \u0081 1227)\nRetinitis 51 (9.75) 95 (13.5) 146 (11.9)\nUpper GI disease* 4 (0.8) 11 (1.6) 15 (1.2)\nLower GI disease† 3 (0.6) 10 (1.4) 13 (1.1)\nCNS disease‡ 2 (0.4) 7 (1.0) 9 (0.7)\nPneumonitis 1 (0.2) 0 (0.0) 1 (0.1)\nNOTE. Data are no. (%). VACV \u0081 valaciclovir; HACV \u0081 high-dose\nacyclovir; LACV\u0081 low-dose acyclovir. GI, gastrointestinal tract; CNS, central\nnervous system.\n* Mouth ulcer, esophagitis, gastritis, duodenitis.\nFigure 3. Kaplan-Meier plot of time to death. For survival, each† Colitis, proctitis.\ntreatment arm was compared with other 2 arms. There was trend to‡ Encephalitis, radiculomyopathy.\nearlier mortality in valaciclovir (VACV) group (P \u0081 .06, log rank\ntest) compared with high- and low-dose acyclovir (HACV, LACV).\nactivity as assessed by polymerase chain reaction is described\nin the companion paper by Griffiths et al. [22]. rates of 24.1%, 19.5%, and 18.8%. Pairwise comparisons sug-\nSurvival. There were 488 deaths overall (39.8%). A trend gested that the risk of death was greater for valaciclovir than\ntoward earlier mortality was seen for patients randomized to for low-dose acyclovir (HR, 1.28; 95% CI, 1.03–1.59), with\nvalaciclovir (P \u0081 .06; figure 3). Mortality rates were 42.6%, no significant difference between valaciclovir and high-dose\n38.2%, and 37.0% for valaciclovir, high-dose acyclovir, and acyclovir (HR, 1.17; 95% CI, 0.94–1.45) or between the two\nlow-dose acyclovir, respectively, with estimated 12-month acyclovir arms (HR, 1.10; 95% CI, 0.87–1.40).\nOnly 57 deaths (11.7%) occurred in patients who were still\nreceiving assigned study medication or within 14 days of its\ndiscontinuation. In an as-treated analysis, survival was signifi-\ncantly shorter in the valaciclovir arm (P \u0081 .002). Mortality\nwas similar among those who had positive or negative urine\nCMV cultures at entry, with 137 (41.4%) and 148 (36.0%)\ndeaths, respectively (P \u0081 .13). Multivariate analyses revealed\nan increased risk of death in patients receiving valaciclovir\nwhen baseline demographics, laboratory values, diagnoses,\nantiretroviral use, and time of elevated serum creatinine were\nconsidered (P \u009b .05).\nThe most common principal cause of death, in 44 patients\n(9.0% of all deaths), was non-Hodgkin’s lymphoma, evenly\ndivided between systemic and primary central nervous system\ndisease. Other common causes of death were non–P. carinii\npneumonia (8.8%), disseminated MAC infection (8.6%), wast-\ning (7.8%), P. carinii pneumonia (7.4%), sepsis (6.8%), and\nKaposi’s sarcoma (6.6%). CMV disease was listed as the prin-\ncipal cause of death for 16 patients (3.3%). There were no\nsignificant differences in the primary causes of death among\nthe three arms.\nTolerance. Of all adverse events grade 3 or higher, only\ngastrointestinal complaints occurred significantly more often\nand earlier in the valaciclovir arm (P \u0081 .03). Grade 2 or greater\nincreases in serum creatinine (\u009c1.5 times the upper limit of\nnormal) occurred earliest in the valaciclovir group (P \u0081 .03),\nalthough there were no differences among the arms for grade\n1 or higher increases (P \u0081 .11). Sixty-five patients had an\nFigure 2. Antiviral effect of valaciclovir (VACV) on recovery of\nestimated creatinine clearance \u009b50 mL\/min while receivingCMV from urine compared with pooled acyclovir (ACV) arms ac-\nstudy medication; 58.5% were randomized to valaciclovircording to baseline culture status (A, culture-negative; B, culture-\npositive). (P \u0081 .03).\n\/ 9D3D$$JA03 10-31-97 15:31:45 jinfal UC: J Infect\n53JID 1998;177 (January) Valaciclovir for CMV Prophylaxis in AIDS\nEighteen patients developed an illness with features sugges- controlled trial using the same dose of ganciclovir failed to\nconfirm this result [25]. Secondary analyses that included pre-tive of thrombotic microangiopathy (TMA), reported as throm-\nbocytopenic purpura or hemolytic-uremic syndrome, 8 of sumptive diagnoses and end points that occurred while patients\nwere receiving treatment or within 14 days of its discontinua-whom were still receiving assigned study medication. Most\ncases failed to meet established criteria for classical thrombocy- tion, as well as evidence of an antiviral effect on recovery\nof virus from urine, support the superiority of valaciclovir intopenic purpura or hemolytic-uremic syndrome, with milder\nthrombocytopenia and anemia, rare neurologic abnormalities, delaying CMV disease compared with acyclovir.\nThis is the first randomized trial of CMV prophylaxis inpoor response to plasma therapy when administered, and pro-\nlonged survival without plasma therapy. The reported events which all end points were independently confirmed. Cases of\nretinitis were evaluated by an independent retinal photographoccurred a median of 54 weeks after enrollment (range, 8–84).\nTMA-like syndromes were reported more frequently in the reading center, and extraocular disease was assessed by a panel\nof blinded investigators. Protocol criteria for confirmed extra-valaciclovir arm (14) than in either of the acyclovir arms (high-\ndose acyclovir, 1; low-dose acyclovir, 3; P \u0081 .008). Those ocular disease were stringent, requiring a compatible clinical\nsyndrome and evidence of CMV-related tissue invasion. Forty-randomized to valaciclovir had received doses of 8 g\/day for\na median of 54 weeks (range, 8–77), and 12 had been treated eight patients who received a clinical diagnosis of CMV end-\norgan disease lacked key data for independent confirmation,for \u009c35 weeks. Patients with TMA-like syndromes received\nmultiple medications, and most had intercurrent illnesses that and 18 cases that were fully evaluated failed to meet predeter-\nmined criteria. Sixteen of these were presumptive diagnoses ofcould explain the hematologic and renal abnormalities. The\nrelative risk of a TMA-like event was increased among recipi- extraocular disease, which may reflect the difficulty in estab-\nlishing an unequivocal diagnosis in clinical practice or the strictents of a number of concomitant medications, including clofazi-\nmine, fluconazole, ciprofloxacin, ethambutol, and trimetho- case definitions used. In contrast, clinical diagnosis of CMV\nretinitis by experienced ophthalmologists appears sufficient forprim-sulfamethoxazole, as well as valaciclovir. These cases\nand associated risk factors are more fully described else- future trials.\nA trend to earlier mortality was seen in the valaciclovirwhere [23].\nTreatment discontinuation. The treatment arms differed in group compared with the acyclovir arms. Two randomized\ndouble-blind trials that compared high-dose acyclovir with pla-time to permanent discontinuation of study medication for rea-\nsons other than death or the development of CMV disease, cebo in patients with advanced HIV disease (median CD4 cell\ncount, 39 and 32\/mm3) reported annual mortality estimates ofwith those assigned to valaciclovir discontinuing earlier (P\n\u0081 .01). The overall estimated 12-month discontinuation rate 23% and 27% for the high-dose acyclovir recipients compared\nwith 39% and 46%, respectively, for the placebo groupswas 46.6%. The respective rates for valaciclovir, high-dose\nacyclovir, and low-dose acyclovir were 50.5%, 46.2%, and [10, 11]. The current study, which lacked a placebo arm, had\nsimilar annual mortality rates, with 18.8%, 19.5%, and 24.1%41.0%. Patients randomized to valaciclovir discontinued dos-\ning significantly more often for protocol-defined toxicity (P for low-dose acyclovir, high-dose acyclovir, and valaciclovir,\nrespectively. Differences that may have an impact on mortality,\u0081 .001), with a trend toward earlier discontinuation for subjec-\ntive complaints (P \u0081 .07), while those assigned to acyclovir such as baseline HIV load, are not available. Patients with less\nadvanced HIV disease (CD4 cell count, 100–300\/mm3) treateddiscontinued treatment significantly more often for the develop-\nment of CMV disease (P \u0081 .001). Participants cited pill burden with high-dose acyclovir or placebo for a median of 365 days\nhad no difference in survival, although median time to death(8.4%) and gastrointestinal complaints (7.1%) as their most\ncommon reasons for self-initiated discontinuation, with no sig- was long (945 days) [26]. Additional support for the concept\nthat inhibition of herpesvirus replication may improve survivalnificant differences among the arms.\nin AIDS has come from a recent well-designed observational\nstudy [14], although a second observational study did not find\nDiscussion\na survival advantage [13]; this discordance may result from\nmethodologic concerns [27]. Two placebo-controlled studiesThis study was designed to compare valaciclovir, 2 g four\ntimes daily, with high- and low-dose acyclovir (arms com- of oral ganciclovir prophylaxis for CMV disease demonstrated\na trend to enhanced survival for ganciclovir recipients [24, 25].bined) for the prevention of CMV disease in patients with\nadvanced HIV infection and for pairwise comparison of the The results of the study reported here may provide some\ninsight into which herpesviruses are responsible for this effect.three different delivered acyclovir doses for survival. A sig-\nnificant protective effect for valaciclovir against CMV disease As there was no significant difference between high- and low-\ndose acyclovir, improved survival may be due to suppression ofwas demonstrated, with a 33% reduction in the rate of con-\nfirmed CMV end-organ disease and significant prolongation of the most sensitive herpesviruses, such as HSV-1 or -2. Further\nsupport for this possibility comes from evidence that HSVthe time to development of CMV disease (P \u0081 .03). A 49%\nreduction in the rate of confirmed CMV end-organ disease has infection in human skin is associated with increased numbers\nof HIV virions, possibly HIV\/HSV pseudotypes, and that reac-previously been demonstrated in a placebo-controlled study of\noral ganciclovir, 1 g three times daily [24]. A second placebo- tivation of HSV-2 can increase HIV plasma RNA levels [28,\n\/ 9D3D$$JA03 10-31-97 15:31:45 jinfal UC: J Infect\n54 Feinberg et al. JID 1998;177 (January)\nAndersen (Harvard School of Public Health) with additional statis-29]. However, the possible involvement of other herpesviruses,\ntical analyses. This study is dedicated to the memory of Gareysuch as Epstein-Barr virus or human herpesvirus 8, cannot be\nLambert—friend, advisor, patient advocate, and study partici-discounted.\npant—whose counsel and wit were never-failing and whose lossThere was an association between treatment with valaci-\nis deeply mourned.clovir and moderate nephrotoxicity. Although the time to grade\n3 or greater renal impairment was not significantly different\namong the arms, there was a difference for more modest impair- References\nment (grade 2 or higher). Acyclovir is excreted renally. High 1. Jacobson MA, Mills J. Serious cytomegalovirus disease in the acquired\nserum concentrations of acyclovir can lead to precipitation in immunodeficiency syndrome (AIDS): clinical findings, diagnosis, and\ntreatment. Ann Intern Med 1988;108:585–94.renal tubules; resultant renal impairment is generally reversible\n2. Gallant JE, Moore RD, Richman DD, Keruly J, Chaisson RE. Incidencewhen treatment is withdrawn [30]. Because oral valaciclovir\nand natural history of cytomegalovirus disease in patients with advancedcan result in acyclovir concentrations previously attainable only\nhuman immunodeficiency virus disease treated with zidovudine. J Infect\nwith intravenous dosing, it is possible that prolonged use of Dis 1992;166:1223–7.\nhigh-dose valaciclovir may have contributed to renal insuffi- 3. Pertel P, Hirschtick R, Phair J, Chmiel J, Poggensee L, Murphy R. Risk\nof developing cytomegalovirus retinitis in persons infected with theciency in this patient population.\nhuman immunodeficiency virus. J Acquir Immune Defic Syndr 1992;Thrombotic microangiopathies are being recognized with in-\n5:1069–74.creasing frequency in patients with advanced HIV disease. One\n4. Studies of Ocular Complications of AIDS Research Group in Collaboration\nstudy reported 15 cases (2.9%) among 521 patients with CD4 with the AIDS Clinical Trials Group. Foscarnet-ganciclovir cytomegalo-\ncell counts \u009b100\/mm3 [31]. That study identified both CMV virus retinitis trial. IV: visual outcomes. Ophthalmology 1994;101:\n1250–61.disease and fluconazole use as risk factors. Administration of\n5. Meyers JD, Reed EC, Shepp DH, et al. Acyclovir for prevention of cyto-high doses of valaciclovir also appeared to be a risk factor\nmegalovirus infection and disease after allogeneic marrow transplanta-for TMA-like syndromes in the present study. The precise\ntion. N Engl J Med 1988;318:70–5.\nrelationship to valaciclovir is unclear, since 8 of 14 patients 6. Balfour HH, Chace BA, Stapleton JT, et al. A randomized, placebo-con-\ntreated with valaciclovir had discontinued treatment at least 1 trolled trial of oral acyclovir for the prevention of cytomegalovirus\ndisease in recipients of renal allografts. N Engl J Med 1989;320:1381–week before their first abnormal serum creatinine value. TMA\n7.and microangiopathic hemolytic anemia have also been re-\n7. Mollison LC, Richards MJ, Johnson PDR, et al. High-dose oral acyclovirported in clinical trials of high-dose valaciclovir for CMV pro-\nreduces the incidence of cytomegalovirus infection in liver transplant\nphylaxis in renal and bone marrow transplant recipients, but recipients. J Infect Dis 1993;168:721–4.\nnot at rates exceeding the baseline levels for these patient 8. Jacobson MA, Gallant J, Wang LH, et al. Phase I trial of valaciclovir, the\nL-valyl ester of acyclovir, in patients with advanced human immunode-populations, and no cases have been noted in HIV-seropositive\nficiency virus disease. Antimicrob Agents Chemother 1994;38:or -seronegative patients treated with lower doses of valaci-\n1534–40.clovir (1–3 g\/day) for herpes zoster or genital herpes for peri-\n9. Cole NL, Balfour HH Jr. In vitro susceptibility of cytomegalovirus isolates\nods up to 1 year [32]. Additional data are required for a better from immunocompromised patients to acyclovir and ganciclovir. Diagn\nunderstanding of the role of valaciclovir and other medications Microbiol Infect Dis 1987;6:255–61.\n10. Cooper DA, Pehrson PO, Pederson C, et al. The efficacy and safety offor TMA-like conditions in HIV disease.\nzidovudine alone or as cotherapy with acyclovir for the treatment ofThis study demonstrated that valaciclovir can significantly\npatients with AIDS and AIDS-related complex: a double-blind random-reduce the risk of CMV end-organ disease in patients with\nized trial. AIDS 1993;7:197–207.\nadvanced HIV disease. The fact that patients assigned to valaci- 11. Youle MS, Gazzard BG, Johnson MA, et al. Effects of high-dose oral\nclovir discontinued treatment earlier, had more adverse effects, acyclovir on herpesvirus disease and survival in patients with advanced\nHIV disease: a double-blind, placebo-controlled study. AIDS 1994;8:and exhibited a trend to earlier mortality indicates that a dose\n641–9.of 2 g four times daily was too high. Further studies are needed\n12. Drew WL, Anderson R, Lang W, et al. Failure of high-dose acyclovir toto identify a dose of valaciclovir that is better-tolerated while\nsuppress CMV viruria or induce ganciclovir-resistant CMV in HIV\nmaintaining a CMV protective effect to determine its ultimate antibody positive patients. J Acquir Immune Defic Syndr 1995;8:\nrole in the prevention of CMV disease in patients with ad- 289–91.\n13. Gallant JE, Moore RD, Keruly J, Richman DD, Chaisson RE. Lack ofvanced HIV infection.\nassociation between acyclovir use and survival in patients with advanced\nhuman immunodeficiency virus disease treated with zidovudine. J Infect\nDis 1995;172:346–52.Acknowledgments\n14. Stein DS, Graham NMH, Park LP, et al. The effect of the interaction of\nacyclovir with zidovudine on progression to AIDS and survival. AnnThe commitment of the 1227 participants and the physicians,\nIntern Med 1994;121:100–8.\nnurses, pharmacists, and data managers at the many study sites\n15. Ghazal P, Nelson JA. Interactions between cytomegalovirus immediate-\ncannot be underestimated and is gratefully acknowledged by the early proteins and the long terminal repeat of human immunodeficiency\nStudy Team and the International Steering Committee. The support virus. Med Virol 1993;3:47–55.\nof Lynn Smiley and Jeffrey Chulay (Glaxo Wellcome) and Beverly 16. Lathey JL, Spector DH, Spector SA. Human cytomegalovirus–associated\nAlston (Division of AIDS, NIAID) was critical to the success of enhancement of human immunodeficiency virus type-1 production in\nmonocyte-derived macrophages. Virology 1994;199:98–104.this complex trial. We are grateful for the assistance of Janet\n\/ 9D3D$$JA03 10-31-97 15:31:45 jinfal UC: J Infect\n55JID 1998;177 (January) Valaciclovir for CMV Prophylaxis in AIDS\n17. Kaplan EL, Meier P. Nonparametric estimation from incomplete observa- Fundus Photograph Reading Center, Jules Stein Eye Institute,\ntions. J Am Stat Assn 1958;53:457–81. UCLA. G. N. Holland (director), R. D. Levinson, A. Tufail, K. J.\n18. Mantel N. Evaluation of survival data and two new rank order statistics Wittenberg.\narising in its consideration. Cancer Chemother Rep 1966;50:163–70. Virology repositories. University of Texas: R. Pollard, P.\n19. Peto R, Peto J. Asymptotically efficient rank invariant test procedures. J\nTurk; Royal Free Hospital: P. D. Griffiths, V. Emery, D. Gor,\nR Stat Soc 1972;135:185–206.\nA. Ansari.20. Gray RJ. A class of K-sample tests for comparing the cumulative incidence\nUS ACTG sites. University of Southern California (71 enroll-of a competing risk. Ann Stat 1988;16:1140–54.\nees): J. M. Leedom, A. Rollan-Howells, L. M. Mendez; UCSF21. O’Brien PC, Fleming TR. A multiple testing procedure for clinical trials.\n(63): D. Gary, J. Carroll, R. Coleman; Johns Hopkins UniversityBiometrics 1977;35:549–56.\n22. Griffiths PD, Feinberg JE, Fry J, et al. The effect of valaciclovir on (56): R. Becker, D. Baker, M. Higgins, A. Khan; University of\ncytomegalovirus viremia and viruria detected by polymerase chain reac- Pennsylvania (56): D. Dunbar, R. Kappes, J. Jacovini, S. Haupt-\ntion in patients with advanced human immunodeficiency virus disease. mann; Washington University (49): C. J. Fichtenbaum, M.\nJ Infect Dis 1998;177:57–64. Conklin, A. Slack; University of North Carolina (48): C. van der\n23. Bell WR, Chulay JD, Feinberg JE. Manifestations resembling thrombotic Horst, L. Troiani, T. Lane, J. Horton; UCLA (48): W. D. Hardy,\nmicroangiopathy in patients with advanced HIV disease in a cytomega-\nS. Chafey, P. Miller, G. Mathieson; University of Texas, Galveston\nlovirus prophylaxis trial (ACTG 204). Medicine 1997;76:369–80.\n(42): M. Borucki, G. Casey, K. Waterman, M. Nokta; UCSD (35):24. Spector SA, McKinley GF, Lalezari JP, et al. Oral ganciclovir for the\nD. Havlir, L. Meixner; University of Washington (35): T. M. Hoo-prevention of cytomegalovirus disease in persons with AIDS. N Engl\nton, A. C. Collier, M. Paradise, D. Cummings; Mt. Sinai MedicalJ Med 1996;334:1491–7.\nCollege (31): P. Gerita, K. Sperber, D. Mildvan, P. Berge; Univer-25. Brosgart CL, Craig C, Hillman D, Louis TA, Alston B. A randomized,\nplacebo-controlled trial of the safety and efficacy of oral ganciclovir of sity of Alabama (28): M. S. Saag, K. E. Squires, D. Davis, S. R.\nprophylaxis of CMV retinal and gastrointestinal mucosal disease in Deloach; Ohio State University (28): M. F. Para, J. Russell, J.\nHIV-infected individuals with severe immunosuppression [late-breaker Stern, J. Neidig; Indiana University (28): L. J. Wheat, K. Fife,\nabstract 10]. In: Program and abstracts of the 35th Interscience Confer- J. Craft, S. Ryan; Northwestern University (26): F. Palella, R.\nence on Antimicrobial Agents and Chemotherapy (San Francisco). Hirschtick, J. Pottage, H. Kessler; Georgetown University (21):\nWashington, DC: American Society for Microbiology, 1995.\nP. Kumar, S. Swartzendruber; Stanford University (21): W. Jeffrey\n26. Collier AC, Schoenfeld DA, Bourland D, et al. Prospective comparative\nFessel, G. Van Raalte; University of Cincinnati (14): D. Daria,study of acyclovir and zidovudine versus zidovudine alone in patients\nJ. Leonard, P. Frame, R. Hutchins; Albert Einstein College ofwith AIDS. In: Program and abstracts of the Second National Confer-\nMedicine (14): R. Soeiro, D. Stein, B. Zingman, E. Jenny; Univer-ence on Human Retroviruses and Related Infections. Washington, DC:\nsity of Miami (14): M. A. Fischl, D. T. Jayaweera, A. Rodriguez,American Society for Microbiology, NIH, CDC 1995:383.\n27. Stein DS. Acyclovir in human immunodeficiency virus patients [letter]. J L. Thompson; University of Rochester (14): R. Reichman, D. Blair,\nInfect Dis 1996;173:504–5. L. Brasington, R. Hewitt; University of Minnesota (14): R. L.\n28. Heng MC, Heng SY, Allen SG. Co-infection and synergy of human immu- Schut, K. Henry, J. T. Stapleton, S. Swindells; University of Colo-\nnodeficiency virus-1 and herpes simplex virus-1. Lancet 1994;343: rado (14): B. Putnam, V. Waite, G. Ray, N. Madinger; Yale Uni-\n255–8. versity (14): E. Cooney, P. Wetherill, M. Fiellin; Harvard Univer-\n29. Mole L, Ripich S, Margolis D, Holodniy M. Plasma HIV RNA levels are\nsity (14): N. Basgoz, K. A. Freedberg, M. Samore, C. Koziel;\nincreased during active herpes simplex virus infection [abstract 239].\nCornell University (13): B. Polsky, M. J. Nealon, G. Gilbert, D.In: Program and abstracts of the 35th Interscience Conference on Anti-\nShepp; Division of AIDS, NIAID, NIH: B. Alston; ACTG Opera-microbial Agents and Chemotherapy (San Francisco). Washington, DC:\ntions Office: T. Nevin.American Society for Microbiology, 1995.\nAustralian sites. National Centre in HIV Epidemiology and30. Brigden D, Rosling AE, Woods NC. Renal function after acyclovir intrave-\nnous injection. Am J Med 1982;73:182–5. Clinical Research, University of New South Wales, Sydney: D.\n31. Peraldi MN, Maslo C, Desenclos JC, Raynal N, Rozenbaum W. Associa- Cooper, K. Clezy; St. Vincent’s Hospital, Sydney (56): J. Miller,\ntion between cytomegalovirus infection and thrombotic microangiopa- J. Druett, P. McCluskey; Prince Henry Hospital, Little Bay (20):\nthy in HIV infected patients. J Am Soc Nephrol 1995;6:473–8. P. Jones, V. Furner, S. Ryan, K. Clezy; Royal Perth Hospital,\n32. Chulay JD, Bell AR. Long-term safety of valaciclovir for suppression of Perth (14): M. French, P. Richardson, N. Scull, A. Cain; Fairfield\nherpes simplex virus infection [abstract 105]. Clin Infect Dis 1996;\nHospital, Fairfield (13): J. Hoy, M. Bryant, A. Sarr, H. Maclean;\n23:879.\nAlfred Hospital, Prahan (2): D. Spelman, J. Spicer, A. Fuller, M.\nO’Flaherty.\nCanadian sites. Southern Alberta HIV Clinic, Calgary (21):Appendix\nJ. Gill, D. Church, T. Jadavji, K. Borkenhagen; Montreal Chest\nHospital, Montreal (21): R. Lalonde, J. Mcleod, M. Chateuvert,Study team. J. Feinberg (chair), B. Alston, J. Chulay, D. Coo-\nper, L. Dix, I. Fishman, B. Gazzard, P. Griffiths, F. Holland, G. G. Smith; Montreal General Hospital, Montreal (21): J. Falutz, T.\nDiGirolamo; Toronto General Hospital, Toronto (21): I. Salit, S.Holland, S. Hurwitz, M. Jacobson, A. Murray, T. Nevin, R. Pol-\nlard, W. Rozenbaum, G. Van Raalte, F. Sattler, A. Wu. Walmsley, A. Ratchford, D. Cosani; Sunnybrook Health Science\nCentre, Toronto (21): A. Rachlis, A. Klein, K. Logue, M. Bast.International Steering Committee. J. Feinberg (chair),*† D.\nCooper (vice chair),* B. Alston, J. Chulay, D. Coakley, L. Dix,* European sites. Kobler Centre, Chelsea and Westminster Hos-\npital, London (35): B. Gazzard, T. Newell, M. Holder; HoˆpitalJ. Fry, M. J. Gill,*† P. Griffiths,* G. N. Holland,* S. Hurwitz,* M.\nJacobson,*† R. MacGregor, G. Miller, A. Murray,* S. Owens, Rothschild, Paris (28): W. Rozenbaum, N. Sandid, B. Hadacek,\nE. Chauveau; South Hospital, Stockholm (26): P. Hedman, E.R. Pollard,*† W. Powderly,*† W. Rozenbaum,* F. Sattler,*† G.\nSingh, L. Smiley,* M. Youle*† (*voting member; †member of Sandstro¨m, B. Hedqvist, K. Flisager; Ian Charleson Centre, Royal\nFree Hospital, London (22): M. Johnson, D. Stobbs, P. Wilson,extraocular end points review panel).\n\/ 9D3D$$JA03 10-31-97 15:31:45 jinfal UC: J Infect\n56 Feinberg et al. JID 1998;177 (January)\nD. Farmer; Hoˆpital St-Pierre, Brussels (15): N. Clumeck, M. Ge- Sacro Cuore, Rome (14): L. Ortona, E. Tamburrini, R. Murri;\nAcademic Hospital Groningen, Groningen, Netherlands (12): H. G.rard, P. Franchioly; Hoˆpital Bichat Claude Bernard, Paris (14):\nJ.-L. Vilde, C. Leport, U. Colasante, P. Longuet; Hoˆpital Pitie´ Sprenger, P. van der Meulen; Universitatsklinikum Rudolf Vir-\nchow, Berlin (11): B. Ruf, J. Sandfort, F. Bergmann.Salpe´trie`re, Paris (14): C. Katlama, N. Ktorza, M. Richard, F.\nBricaire; Hvidovre Hospital, Copenhagen (14): L. Mathiesen, P. Glaxo Wellcome Antiviral Research. M. L. Smiley, J. Chulay,\nG. Miller (United States); A. Webster, A. Bell (United Kingdom).Aabech, A. Dilling-Hansen, L. Skinnes; Universita Cattolica del\n\/ 9D3D$$JA03 10-31-97 15:31:45 jinfal UC: J Infect\n"}