{"doi":"10.1103\/PhysRevB.68.081302","coreId":"102308","oai":"oai:epubs.surrey.ac.uk:1767","identifiers":["oai:epubs.surrey.ac.uk:1767","10.1103\/PhysRevB.68.081302"],"title":"Spin-galvanic effect due to optical spin orientation in <i>n<\/i>-type GaAs quantum well structures","authors":["Ganichev, S. D.","Schneider, Petra","Bel'kov, V. V.","Ivchenko, E. L.","Tarasenko, S. A.","Wegscheider, W.","Weiss, D.","Schuh, D.","Murdin, B. N.","Phillips, P. J.","Pidgeon, C. R.","Clarke, D. G.","Merrick, M.","Murzyn, P.","Beregulin, E. V.","Prettl, W."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-08-29","abstract":"<p>Under oblique incidence of circularly polarized infrared radiation the spin-galvanic effect (SGE) has been unambiguously observed in (001)-grown <i>n<\/i>-type GaAs quantum well structures in the absence of any external magnetic field. Resonant intersubband transitions have been obtained making use of the tunability of the free-electron laser FELIX. A microscopic theory of the SGE for intersubband transitions has been developed, which is in good agreement with experimental findings.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1767<\/identifier><datestamp>\n      2017-10-31T14:03:02Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:70686F746F6E696373<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1767\/<\/dc:relation><dc:title>\n        Spin-galvanic effect due to optical spin orientation in <i>n<\/i>-type GaAs quantum well structures<\/dc:title><dc:creator>\n        Ganichev, S. D.<\/dc:creator><dc:creator>\n        Schneider, Petra<\/dc:creator><dc:creator>\n        Bel'kov, V. V.<\/dc:creator><dc:creator>\n        Ivchenko, E. L.<\/dc:creator><dc:creator>\n        Tarasenko, S. A.<\/dc:creator><dc:creator>\n        Wegscheider, W.<\/dc:creator><dc:creator>\n        Weiss, D.<\/dc:creator><dc:creator>\n        Schuh, D.<\/dc:creator><dc:creator>\n        Murdin, B. N.<\/dc:creator><dc:creator>\n        Phillips, P. J.<\/dc:creator><dc:creator>\n        Pidgeon, C. R.<\/dc:creator><dc:creator>\n        Clarke, D. G.<\/dc:creator><dc:creator>\n        Merrick, M.<\/dc:creator><dc:creator>\n        Murzyn, P.<\/dc:creator><dc:creator>\n        Beregulin, E. V.<\/dc:creator><dc:creator>\n        Prettl, W.<\/dc:creator><dc:description>\n        <p>Under oblique incidence of circularly polarized infrared radiation the spin-galvanic effect (SGE) has been unambiguously observed in (001)-grown <i>n<\/i>-type GaAs quantum well structures in the absence of any external magnetic field. Resonant intersubband transitions have been obtained making use of the tunability of the free-electron laser FELIX. A microscopic theory of the SGE for intersubband transitions has been developed, which is in good agreement with experimental findings.<\/p><\/dc:description><dc:date>\n        2003-08-29<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1767\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Ganichev, S. D., Schneider, Petra, Bel'kov, V. V., Ivchenko, E. L., Tarasenko, S. A., Wegscheider, W., Weiss, D., Schuh, D., Murdin, B. N., Phillips, P. J., Pidgeon, C. R., Clarke, D. G., Merrick, M., Murzyn, P., Beregulin, E. V. and Prettl, W.  (2003) Spin-galvanic effect due to optical spin orientation in n-type GaAs quantum well structures   Physical Review B, 68 (081302).       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevB.68.081302<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1767\/","10.1103\/PhysRevB.68.081302"],"year":2003,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"RAPID COMMUNICATIONS\nPHYSICAL REVIEW B 68, 081302~R! ~2003!Spin-galvanic effect due to optical spin orientation in n-type GaAs quantum well structures\nS. D. Ganichev,1,2 Petra Schneider,1 V. V. Bel’kov,2 E. L. Ivchenko,2 S. A. Tarasenko,2 W. Wegscheider,1 D. Weiss,1\nD. Schuh,3 B. N. Murdin,4 P. J. Phillips,5 C. R. Pidgeon,5 D. G. Clarke,4 M. Merrick,4 P. Murzyn,5 E. V. Beregulin,2\nand W. Prettl1\n1Fakulta¨t Physik, University of Regensburg, 93040, Regensburg, Germany\n2A. F. Ioffe Physico-Technical Institute, 194021 St. Petersburg, Russia\n3Walter Schottky Institute, TU Munich, D-85748 Garching, Germany\n4University of Surrey, Guildford, GU2 7XH, United Kingdom\n5Department of Physics, Heriot-Watt University, Edinburgh, United Kingdom\n~Received 6 March 2003; revised manuscript received 24 March 2003; published 29 August 2003!\nUnder oblique incidence of circularly polarized infrared radiation the spin-galvanic effect ~SGE! has been\nunambiguously observed in ~001!-grown n-type GaAs quantum well structures in the absence of any external\nmagnetic field. Resonant intersubband transitions have been obtained making use of the tunability of the\nfree-electron laser FELIX. A microscopic theory of the SGE for intersubband transitions has been developed,\nwhich is in good agreement with experimental findings.\nDOI: 10.1103\/PhysRevB.68.081302 PACS number~s!: 72.40.1w, 72.25.Fe, 78.67.2nThe spin of electrons and holes in solid-state systems is an\nintensively studied quantum-mechanical property showing a\nlarge variety of interesting physical phenomena. Lately there\nis much interest in the use of the spin of carriers in semicon-\nductor heterostructures together with their charge for novel\napplications such as spintronics.1 The necessary conditions\nto realize spintronic devices are high spin polarizations in\nquantum well ~QW! structures and large spinsplitting of sub-\nbands in k space. The latter is important for the ability to\ncontrol spins with an external electric field by the Rashba\neffect.2 Significant progress has been achieved recently in\ngenerating large spin polarizations, in demonstrating the\nRashba splitting, and also in using the splitting for manipu-\nlating the spins.1 At the same time, as these conditions are\nfulfilled, it has been shown that the spin polarization itself\ndrives a current if the spins are oriented in the plane of the\nQW.3 This spin-galvanic effect ~SGE! was previously dem-\nonstrated with optical excitation and the assistance of an ex-\nternal magnetic field to achieve an in-plane polarization. As a\nstep towards the long-term aim of showing its existence with\nonly electric injection we report here the demonstration of\nthe optically induced SGE in zero magnetic field. We also\npresent the microscopic theory of this effect.\nThe spin-galvanic effect has been observed at room tem-\nperature by studying transitions between size quantized sub-\nbands e1 and e2 in n-type GaAs QW’s. Samples, grown\nalong z i @001# by mulecular beam epitaxy, consisting of 30\nQW’s with a well width of 7.6 nm, 8.2 nm, and 8.8 nm, and\nfree-carrier density in a single well ne of about 2\n31012 cm22 were investigated at room temperature.\nSamples were quadratic in shape, with edges oriented along\nthe x i @11¯0# and y i @110# crystallographic directions. Two\npairs of ohmic contacts were attached in the center of oppo-\nsite sample edges ~see Fig. 1!. In order to excite resonantly\nand to obtain a measurable photocurrent it was necessary to\nhave a tunable high-power radiation source for which we\nused the free-electron laser ‘‘FELIX’’ at FOM-Rijnhuizen in\nThe Netherlands.4 The output pulses of light from FELIX0163-1829\/2003\/68~8!\/081302~4!\/$20.00 68 0813were chosen to be 3 ps long, separated by 40 ns, in a train ~or\n‘‘macropulse’’! of duration 5 ms. The macropulses had a\nrepetition rate of 5 Hz.\nOn illumination of the QW structures by circularly polar-\nized radiation at oblique incidence in the (xz) or (yz) plane\na current signal perpendicular to the plane of incidence was\nmeasured, e.g., in the y direction for the configuration de-\npicted in Fig. 1. Left-handed (s2) and right-handed (s1)\ncircularly polarized radiation was achieved making use of a\nFresnel rhomb. The photocurrent signals generated in the\nunbiased devices were measured via an amplifier with a re-\nsponse time of the order of 1 ms, i.e., averaged over the\nmacropulse.\nThe observed current is proportional to the helicity Pcirc\nof the radiation. The current was measured for incidence in\ntwo different planes with the in-plane component of propa-\ngation along the x and y directions. In Fig. 2 the observed\ncurrent for both directions is plotted as a function of photon\nenergy \\v for s1 polarized radiation together with the ab-\nsorption spectrum. It can be seen that for current along x i\n@11¯0# the shape is similar to the derivative of the absorption\nspectrum, and in particular there is a change of sign which\noccurs at the line center of the absorption. When the sample\nwas rotated by 90° about z, so that light propagates now\nalong x and the current flows along y i @110#, the sign rever-\nFIG. 1. Geometry of the experiment. At oblique incidence of\nradiation we obtained projections on the x or y directions of the unit\nvector eˆ and the averaged spin S. The current j is recorded perpen-\ndicular to the direction of light propagation.©2003 The American Physical Society02-1\nRAPID COMMUNICATIONS\nS. D. GANICHEV et al. PHYSICAL REVIEW B 68, 081302~R! ~2003!sal in the current disappears and its shape follows more\nclosely the absorption spectrum.\nIt has been shown in Refs. 3,5 that in QW’s belonging to\none of the gyrotropic crystal classes a nonequilibrium spin\npolarization of electrons uniformly distributed in space\ncauses a directed motion of electrons in the plane of the QW.\nOn a microscopic level spin photocurrents are the result of\nspin orientation in systems with k-linear terms in the electron\neffective Hamiltonian. In general, two mechanisms contrib-\nute to spin photocurrents: photoexcitation and scattering of\nphotoexcited carriers. The first effect is the circular photogal-\nvanic effect ~CPGE! which is caused by an asymmetry of the\nmomentum distribution of carriers excited in optical\ntransitions.5,6 The second effect is the spin-galvanic effect\nwhich in general does not need optical excitation but is a\nresult of an asymmetric spin relaxation.3 The current due to\nCPGE decays with the momentum-relaxation time tp of pho-\ntoexcited free carriers whereas the SGE induced current de-\ncays with the spin-relaxation time ts . Both effects are illus-\ntrated in Fig. 3.\nThe change of sign of the photocurrent with photon en-\nergy is characteristic for CPGE at resonant transitions in\nn-type QW’s and has been described previously.6 As illus-\ntrated in Fig. 3~a! for s1 radiation and at a small photon\nenergy less than the energy separation between e1 and e2 at\nkx50, excitations occur preferentially at positive kx . We\nnote that for C2v symmetry the optical transitions are spin\nconserving but spin dependent.6 This causes a stronger re-\nduction in the electron population at positive kx in the lower\nu21\/2&y-subband and therefore a spin-polarized current in\nthe positive x direction. We note that there is a corresponding\nincrease of the electron population in the e2\nu21\/2&y-subband, also asymmetrical, but in our case this\nrandomizes quickly via optical-phonon scattering and there-\nfore does not contribute significantly to the current.6 Increase\nof the photon energy shifts the dominating transition towards\nFIG. 2. Photocurrent in GaAs QW’s of 8.2 nm width normalized\nby the light power P as a function of the photon energy. Circles:\ncurrent in @110# direction in response to irradiation parallel @11¯0# .\nSquares: current in @11¯0# direction in response to irradiation par-\nallel @110#. The dotted line shows the absorption measured using a\nFourier-transform spectrometer.08130negative kx and reverses the current. In fact it has been\nshown that the CPGE at intersubband absorption in n-type\nQW’s is proportional to the derivative of the absorption\nspectrum.6 This behavior is observed for the current in the x\ni @11¯0# direction. In particular, the position of the sign in-\nversion of the current coincides with the maximum of the\nabsorption spectrum which shows that the spin-galvanic ef-\nfect for this direction is vanishingly small and the current is\ncaused by the CPGE.\nIn contrast to the CPGE the sign of the spin-galvanic cur-\nrent is independent of the wavelength.7 This can be seen\nfrom Fig. 3~b! that illustrates the origin of the spin-galvanic\neffect. All that is required is a spin orientation of the lower\nsubband, and asymmetrical spin relaxation then drives a\ncurrent.3 In our case the spin orientation is generated by reso-\nnant spin-selective optical excitation followed by spin-\nnonspecific thermalization. The magnitude of the spin polar-\nization and hence the current depends on the initial\nabsorption strength but not on the momentum k of transition.\nTherefore there is no sign change and the shape of the spec-\ntrum follows the absorption.7 The lack of a sign change for\ncurrent along y i @110# in the experiment shows that the\nspin-galvanic effect dominates for this orientation.\nIn order to understand the difference between the two\norientations we now introduce a phenomenological picture\nfor the C2v symmetry representing samples investigated\nhere. Phenomenologically the SGE and the CPGE in x and y\ndirections are given by\njSGE ,x5QxySy , jSGE ,y5QyxSx ~1!\njCPGE ,x5gxyeˆ yE02Pcirc , jCPGE ,y5gyxeˆ xE02Pcirc .\n~2!\nwhere j is the photocurrent density, Q and g are second rank\npseudotensors, S is the average spin of electrons in QW’s, E0\nand eˆ are the amplitude of the electromagnetic wave and the\nFIG. 3. Microscopic picture of the current mechanisms at inter-\nsubband excitation in C2v symmetry QW’s. In ~a! the CPGE current\nj x is caused by the imbalance of optical transition probabilities at\nkx\n2 and kx\n1 decaying with the momentum-relaxation time tp . In ~b!\nthe SGE current occurs after spin-nonspecific thermalization in e1\nwhich results in the spin orientation. This current is caused by\nasymmetric spin-flip scattering and decays with the spin-relaxation\ntime ts ~Ref. 3!.2-2\nRAPID COMMUNICATIONS\nSPIN-GALVANIC EFFECT DUE TO OPTICAL SPIN . . . PHYSICAL REVIEW B 68, 081302~R! ~2003!unit vector pointing in the direction of light propagation,\nrespectively. In the present case S is obtained by optical ori-\nentation, its sign and magnitude are proportional to Pcirc ,\nand it is oriented along the in-plane component of eˆ ~see Fig.\n1!. Because of tensor equivalence of Q and g the spin-\ngalvanic current induced by circularly polarized light always\noccurs simultaneously with the CPGE. If the in-plane com-\nponent of eˆ is oriented along @11¯0# or @110#, i.e., x or y, then\nboth currents flow normal to the light propagation direction.\nThe strength of the current is different for the radiation\npropagating along x or y. This is due to the nonequivalence\nof the crystallographic axes @11¯0# and @110# because of the\ntwofold rotation axis in C2v symmetry.\nBoth currents are caused by spin splitting of subbands in\nthe k space.3,5 This splitting is due to k-linear terms in the\nHamiltonian of the form Hˆ 85( lmb lms lkm , where b lm is a\nsecond-rank pseudotensor and s l are the Pauli matrices. The\ntensors g and Q determining the current are related to the\ntransposed pseudotensor b. They are subjected to the same\nsymmetry restrictions so that their irreducible components\ndiffer only by scalar factors. For ~001!-grown QW’s of C2v\nsymmetry there are two nonzero tensor elements bxyÞbyx\nwhich may also be different for e1 and e2 subbands. It is\nreasonable to introduce symmetric and antisymmetric tensor\ncomponents bBIA\n(n) 5(bxy(n)1byx(n))\/2 and bSIA(n) 5(bxy(n)\n2byx\n(n))\/2, where n51,2 indicates the e1 and e2 subbands,\nrespectively. Here bBIA\n(n) and bSIA\n(n) result from bulk inversion\nasymmetry ~BIA! also called the Dresselhaus term8 ~includ-\ning a possible interface inversion asymmetry9! and from\nstructural inversion asymmetry ~SIA! usually called the\nRashba term,2 respectively. In order to illustrate band struc-\ntures with a k-linear term, in Fig. 4 we plotted the energy «\nas a function of kx and ky . The nonequivalence of x and y\ndirections is clearly seen from Fig. 4~b!.\nAs discussed above and sketched in Fig. 3 both CPGE\nand SGE currents, say in the x direction, are caused by the\nband splitting in the kx direction and therefore are propor-\ntional to byx ~for current in the y direction one should inter-\nchange the indices x and y!. Then the currents in the x and y\ndirections read\nj x5ACPGE@~bBIA(1) 2bSIA(1) !2~bBIA(2) 2bSIA(2) !#Pcirceˆ y\n1ASGE~bBIA\n(1) 2bSIA\n(1) !Sy ~3!\nFIG. 4. Schematic two dimensional ~2D! band structure with\nk-linear terms for C2v symmetry and the distribution of spin orien-\ntations at the 2D Fermi energy. Arrows indicate the orientation of\nspins.08130j y5ACPGE@~bBIA(1) 1bSIA(1) !2~bBIA(2) 1bSIA(2) !#Pcirceˆ x\n1ASGE~bBIA\n(1) 1bSIA\n(1) !Sx , ~4!\nwhere ACPGE and ASGE are factors related to g and Q, re-\nspectively. The magnitude of the CPGE is determined by the\nvalue of k in the initial and final states, and hence on the spin\nsplitting (bBIA and bSIA) of both e1 and e2 subbands. In\ncontrast, the spin-galvanic effect is due to relaxation between\nthe spin states of the lowest subband e1 and hence only on\nbBIA\n(1) and bSIA\n(1)\n. Equations ~3! and ~4! show that in directions\nx and y the spin-galvanic effect and the CPGE are propor-\ntional to terms containing the difference and the sum, respec-\ntively, of BIA and SIA terms. When they add @see Eq. ~4!# it\nappears in our samples that the spin-galvanic effect domi-\nnates over the CPGE, which is proved by the lack of sign\nchange for currents along the y direction in Fig. 2. Con-\nversely when BIA and SIA terms subtract @see Eq. ~3!# the\nspin-galvanic effect is suppressed and the CPGE dominates.\nWe would like to emphasize at this point that at the fre-\nquency where CPGE is equal to zero for both directions, the\ncurrent obtained in the y direction is caused by the spin-\ngalvanic effect only.\nThe occurrence of a spin-galvanic current is due to the\nspin dependence of the electron-scattering matrix elements\nM k8k . The 232 matrix Mˆ k8k can be written as a linear com-\nbination of the unit matrix Iˆ and Pauli matrices as follows:\nMˆ k8k5Ak8kIˆ1s\u0095Bk8k , ~5!\nwhere Ak8k* 5Akk8 , Bk8k* 5Bkk8 due to Hermiticity of the in-\nteraction and A2k8,2k5Akk8 , B2k8,2k52Bkk8 due to the\nsymmetry under time inversion. The spin-dependent part of\nthe scattering amplitude in ~001!-grown QW structures is\ngiven by10\ns\u0095Bk8k5v~k2k8!@sx~ky81ky!2sy~kx81kx!# , ~6!\nwhere v(k–k8) is a function defined in Ref. 10. We note that\nEq. ~6! determines the spin-relaxation time ts8 due to the\nElliot-Yafet mechanism. Then, for instance, for the spin com-\nponent Sx assuming a Boltzmann distribution, the spin-\ngalvanic current in the y direction has the form\njSGE ,y5\n4pe\nm*\nSx(\nk˜ k˜ 8\n~k˜y82k˜y!~k˜x81k˜x!2uv~k˜2k˜822k0!u2tp\n3 f S \\2k˜22m*D dS \\2k˜822m* 2\\2k˜22m*D ~7!\nwhere e is the electron charge, tp is the momentum scatter-\ning time, f is the distribution function, d is the delta function,2-3\nRAPID COMMUNICATIONS\nS. D. GANICHEV et al. PHYSICAL REVIEW B 68, 081302~R! ~2003!m* is the electron effective mass, k˜5k1k0 , k˜85k82k0,\nand k05(m*bxy \/\\2,0,0). By using Eq. ~7! we can estimate\nthe spin-galvanic current as\njSGE ,x5QxySy;e ne\nbyx\n(1)\n\\\ntp\nts8\nSy , jSGE ,y5QyxSx\n;e ne\nbxy\n(1)\n\\\ntp\nts8\nSx . ~8!\nSince scattering is the origin of the spin-galvanic effect, the\ncurrent jSGE is determined by the Elliot-Yafet spin-relaxation\nprocess even if other spin-relaxation mechanisms dominate.\nThe Elliot-Yafet spin-relaxation time ts8 is proportional to the\nmomentum-relaxation time tp . Therefore the ratio tp \/ts8 in\nEqs. ~8! does not depend on the momentum-relaxation time.\nThe in-plane average spin, e.g., Sx , in Eqs. ~8! decays with\nthe total spin-relaxation time ts . Thus the time decay of the\nspin-galvanic current following pulsed photoexcitation is de-\ntermined by ts . This time may have contributions from any\nspin-relaxing process and in the present case of GaAs QW’s\nis determined by the D’yakonov-Perel’ mechanism.\nFor the present case, where spin relaxation is obtained as\na result of intersubband absorption of circularly polarized\nradiation, the current is given by08130jSGE ,x;e\nbyx\n(1)\n\\\ntpts\nts8\nh21I\n\\v\nPcircjeˆ y , jSGE ,y\n;e\nbxy\n(1)\n\\\ntpts\nts8\nh21I\n\\v\nPcircjeˆ x . ~9!\nh21 is the absorbance at the transitions between e1 and e2\nsubbands, I is the radiation intensity. The parameter j vary-\ning between 0 and 1 is the ratio of photoexcited electrons\nrelaxing to the e1 subband with and without spin flip. It\ndetermines the degree of spin polarization in the lowest sub-\nband @see Fig. 3~b!# and depends on the details of the relax-\nation mechanism. Optical orientation requires jÞ0.11–13\nEquations ~9! show that the SGE current is proportional to\nthe absorbance and is determined by the spin splitting in the\nfirst subband, byx\n(1) or bxy\n(1)\n.\nIn conclusion we observed the spin-galvanic effect under\nall-optical excitation and without applying external magnetic\nfields by making use of the interplay of the Rashba and\nDresselhaus splitting of the conduction band. Our results\ndemonstrate the nonequivalence of the @110# and @11¯0# di-\nrections in zinc-blende structure QW’s. The results also\nclearly show the difference between the microscopic pictures\nfor SGE and CPGE which have the same phenomenological\ndescription.\nWe thank L. E. Golub for many helpful discussions. Fi-\nnancial support from the DFG, the RFBR, INTAS, the\nEPSRC ~UK! and FOM ~NL! is gratefully acknowledged.\nThe authors are grateful to the FELIX facility team and es-\npecially for the skillful assistance of Dr. A. F. G. van der\nMeer.1 Semiconductor Spintronics and Quantum Computation, edited by\nD.D. Awschalom, D. Loss, and N. Samarth, Nanoscience and\nTechnology ~Springer, Berlin, 2002!.\n2 Y.A. Bychkov and E.I. Rashba, Pis’ma ZhETF 39, 66 ~1984!\n@JETP Lett. 39, 78 ~1984!#.\n3 S.D. Ganichev, E.L. Ivchenko, V.V. Bel’kov, S.A. Tarasenko, M.\nSollinger, D. Weiss, W. Wegscheider, and W. Prettl, Nature\n~London! 417, 153 ~2002!.\n4 G.M.H. Knippels, X. Yan, A.M. MacLeod, W.A. Gillespie, M.\nYasumoto, D. Oepts, and A.F.G. van der Meer, Phys. Rev. Lett.\n83, 1578 ~1999!.\n5 S.D. Ganichev, E.L. Ivchenko, S.N. Danilov, J. Eroms, W.\nWegscheider, D. Weiss, and W. Prettl, Phys. Rev. Lett. 86, 4358\n~2001!.\n6 S.D. Ganichev, V.V. Bel’kov, Petra Schneider, E.L. Ivchenko,S.A. Tarasenko, W. Wegscheider, D. Weiss, D. Schuh, E.V.\nBeregulin, and W. Prettl, Phys. Rev. B 68, 035319 ~2003!.\n7 S.A. Tarasenko, E.L. Ivchenko, V.V. Bel’kov, S.D. Ganichev, D.\nSchowalter, Petra Schneider, M. Sollinger, W. Prettl, V.M.\nUstinov, A.E. Zhukov, and L.E. Vorobjev, J. Supercond.: Incor-\nporating Novel Magn. 16, 419 ~2003!.\n8 M.I. D’yakonov and V.Yu. Kachorovskii, Fiz. Tekh. Poluprov. 20,\n178 ~1986! @Sov. Phys. Semicond. 20, 110 ~1986!#.\n9 O. Krebs and P. Voisin, Phys. Rev. Lett. 77, 1829 ~1996!.\n10 N.S. Averkiev, L.E. Golub, and M. Willander, J. Phys.: Condens.\nMatter 14, R271 ~2002!.\n11 R.R. Parson, Can. J. Phys. 49, 1850 ~1971!.\n12 Optical Orientation, edited by F. Meier and B.P. Zakharchenya\n~Elsevier Science, Amsterdam, 1984!.\n13 E.L. Ivchenko and S.A. Tarasenko, JETP ~to be published!.2-4\n"}