{"doi":"10.1021\/ac062446p","coreId":"19303","oai":"oai:eprints.bham.ac.uk:121","identifiers":["oai:eprints.bham.ac.uk:121","10.1021\/ac062446p"],"title":"Dynamic range and mass accuracy of wide-scan direct infusion nanoelectrospray fourier transform ion cyclotron resonance mass spectrometry-based metabolomics increased by the spectral stitching method","authors":["Southam, Andrew D","Payne, Tristan G","Cooper, Helen J.","Arvanitis, Theodoros N","Viant, Mark R"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-05-19","abstract":"Direct infusion nanoelectrospray Fourier transform ion cyclotron resonance mass spectrometry (DI nESI FT-ICR MS)offers high mass accuracy and resolution for analyzing complex metabolite mixtures. High dynamic range across a wide mass range, however, can only be achieved at the expense of mass accuracy, since the large numbers of ions entering the ICR detector induce adverse spacecharge effects. Here we report an optimized strategy for wide-scan DI nESI FT-ICR MS that increases dynamic range but maintains high mass accuracy. It comprises the collection if multiple adjacent selected ion monitoring (SIM) windows that are stitched together using novel algorithms. The final SIM-stitching method, derived from several optimization experiments, comprises 21 adjoining SIM windows each of width m\/z 30 (from m\/z 70 to 500; adjacent windows overlap by m\/z 10) with an automated gain control (AGC) target of 1 105 charges. SIMstitching and wide-scan range (WSR; Thermo Electron)were compared using a defined standard to assess mass accuracy and a liver extract to assess peak count and dynamic range. SIM-stitching decreased the maximum mass error by 1.3- and 4.3-fold, and increased the peak count by 5.3- and 1.8-fold, versus WSR (AGC targets of 1 x 105 and 5 x 105, respectively). SIM-stitching achieved an rms mass error of 0.18 ppm and detected over 3000 peaks in liver extract. This novel approach increases metabolome coverage, has very high mass accuracy, and at 5.5 min\/sample is conducive for high- throughput metabolomics","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"American Chemical Society","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.bham.ac.uk:121<\/identifier><datestamp>\n      2011-10-12T11:01:44Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5131<\/setSpec><setSpec>\n      7375626A656374733D54:5441<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Dynamic range and mass accuracy of wide-scan direct infusion nanoelectrospray fourier transform ion cyclotron resonance mass spectrometry-based metabolomics increased by the spectral stitching method<\/dc:title><dc:creator>\n        Southam, Andrew D<\/dc:creator><dc:creator>\n        Payne, Tristan G<\/dc:creator><dc:creator>\n        Cooper, Helen J.<\/dc:creator><dc:creator>\n        Arvanitis, Theodoros N<\/dc:creator><dc:creator>\n        Viant, Mark R<\/dc:creator><dc:subject>\n        Q Science (General)<\/dc:subject><dc:subject>\n        TA Engineering (General). Civil engineering (General)<\/dc:subject><dc:description>\n        Direct infusion nanoelectrospray Fourier transform ion cyclotron resonance mass spectrometry (DI nESI FT-ICR MS)offers high mass accuracy and resolution for analyzing complex metabolite mixtures. High dynamic range across a wide mass range, however, can only be achieved at the expense of mass accuracy, since the large numbers of ions entering the ICR detector induce adverse spacecharge effects. Here we report an optimized strategy for wide-scan DI nESI FT-ICR MS that increases dynamic range but maintains high mass accuracy. It comprises the collection if multiple adjacent selected ion monitoring (SIM) windows that are stitched together using novel algorithms. The final SIM-stitching method, derived from several optimization experiments, comprises 21 adjoining SIM windows each of width m\/z 30 (from m\/z 70 to 500; adjacent windows overlap by m\/z 10) with an automated gain control (AGC) target of 1 105 charges. SIMstitching and wide-scan range (WSR; Thermo Electron)were compared using a defined standard to assess mass accuracy and a liver extract to assess peak count and dynamic range. SIM-stitching decreased the maximum mass error by 1.3- and 4.3-fold, and increased the peak count by 5.3- and 1.8-fold, versus WSR (AGC targets of 1 x 105 and 5 x 105, respectively). SIM-stitching achieved an rms mass error of 0.18 ppm and detected over 3000 peaks in liver extract. This novel approach increases metabolome coverage, has very high mass accuracy, and at 5.5 min\/sample is conducive for high- throughput metabolomics.<\/dc:description><dc:publisher>\n        American Chemical Society<\/dc:publisher><dc:date>\n        2007-05-19<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.bham.ac.uk\/121\/1\/cooper_anal_chem_2007.pdf<\/dc:identifier><dc:relation>\n        public<\/dc:relation><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/121\/1.hassmallThumbnailVersion\/cooper_anal_chem_2007.pdf<\/dc:relation><dc:relation>\n        http:\/\/pubs.acs.org\/doi\/pdf\/10.1021\/ac062446p<\/dc:relation><dc:identifier>\n        Southam, Andrew D and Payne, Tristan G and Cooper, Helen J. and Arvanitis, Theodoros N and Viant, Mark R (2007) Dynamic range and mass accuracy of wide-scan direct infusion nanoelectrospray fourier transform ion cyclotron resonance mass spectrometry-based metabolomics increased by the spectral stitching method. Analytical Chemistry (including News & Features), 79 (12). ISSN 0003-2700<\/dc:identifier><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/121\/<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["public","http:\/\/eprints.bham.ac.uk\/121\/1.hassmallThumbnailVersion\/cooper_anal_chem_2007.pdf","http:\/\/pubs.acs.org\/doi\/pdf\/10.1021\/ac062446p","http:\/\/eprints.bham.ac.uk\/121\/"],"year":2007,"topics":["Q Science (General)","TA Engineering (General). Civil engineering (General)"],"subject":["Article","PeerReviewed"],"fullText":"Dynamic Range and Mass Accuracy of Wide-Scan\nDirect Infusion Nanoelectrospray Fourier\nTransform Ion Cyclotron Resonance Mass\nSpectrometry-Based Metabolomics Increased by\nthe Spectral Stitching Method\nAndrew D. Southam,† Tristan G. Payne,‡ Helen J. Cooper,† Theodoros N. Arvanitis,‡ and\nMark R. Viant*,†\nSchool of Biosciences, and Department of Electrical, Electronic and Computer Engineering, School of Engineering,\nUniversity of Birmingham, Edgbaston, Birmingham, B15 2TT, UK\nDirect infusion nanoelectrospray Fourier transform ion\ncyclotron resonance mass spectrometry (DI nESI FT-ICR\nMS) offers high mass accuracy and resolution for analyz-\ning complex metabolite mixtures. High dynamic range\nacross a wide mass range, however, can only be achieved\nat the expense of mass accuracy, since the large numbers\nof ions entering the ICR detector induce adverse space-\ncharge effects. Here we report an optimized strategy for\nwide-scan DI nESI FT-ICR MS that increases dynamic\nrange but maintains high mass accuracy. It comprises the\ncollection of multiple adjacent selected ion monitoring\n(SIM) windows that are stitched together using novel\nalgorithms. The final SIM-stitching method, derived from\nseveral optimization experiments, comprises 21 adjoining\nSIM windows each of width m\/z 30 (from m\/z 70 to 500;\nadjacent windows overlap by m\/z 10) with an automated\ngain control (AGC) target of 1 \u0002 105 charges. SIM-\nstitching and wide-scan range (WSR; Thermo Electron)\nwere compared using a defined standard to assess mass\naccuracy and a liver extract to assess peak count and\ndynamic range. SIM-stitching decreased the maximum\nmass error by 1.3- and 4.3-fold, and increased the peak\ncount by 5.3- and 1.8-fold, versus WSR (AGC targets of\n1 \u0002 105 and 5 \u0002 105, respectively). SIM-stitching achieved\nan rms mass error of 0.18 ppm and detected over 3000\npeaks in liver extract. This novel approach increases\nmetabolome coverage, has very high mass accuracy, and\nat 5.5 min\/sample is conducive for high-throughput\nmetabolomics.\nMetabolomics involves the measurement of multiple small\nmolecules within a biological sample to generate a unique\nmetabolic profile. These profiles can be compared directly between\ndifferent biological phenotypes, and as metabolites represent the\nend products of complex cellular control systems, such analyses\ncan give insight into upstream gene and protein activity.1 This\napproach has been applied to many fields, notably toxicology, drug\ndesign, disease diagnosis, and quality control of food substances.2-6\nReproducibility of the measurement system is critical, with nuclear\nmagnetic resonance (NMR)-based methods proving very robust.6,7\nHowever, due to its superior sensitivity over NMR, mass spec-\ntrometry (MS) represents an attractive detection method for\nmetabolomics.8,9 Fourier transform ion cyclotron resonance mass\nspectrometry (FT-ICR MS) is a particularly powerful tool for\ncomplex mixture analysis due to its ultrahigh mass resolution and\nmass accuracy10,11 and has been applied successfully to a small\nnumber of metabolomics studies.12-16 In principle, this analysis\nmethod enables the empirical formulas of many low molecular\nweight metabolites to be unambiguously identified based upon\n* Corresponding author. Phone: +44-(0)121-414-2219. Fax: +44-(0)121-414-\n5925. E-mail: M.Viant@bham.ac.uk.\n† School of Biosciences.\n‡ Department of Electrical, Electronic and Computer Engineering, School of\nEngineering.\n(1) Fiehn, O.; Kopka, J.; Dormann, P.; Altmann, T.; Trethewey, R. N.; Willmitzer,\nL. Nat. Biotechnol. 2000, 18, 1157-1161.\n(2) Griffin, J. L.; Shockcor, J. P. Nat. Rev. Cancer 2004, 4, 551-561.\n(3) Nicholson, J. K.; Connelly, J.; Lindon, J. C.; Holmes, E. Nat. Rev. Drug\nDiscovery 2002, 1, 153-161.\n(4) Rischer, H.; Oksman-Caldentey, K. M. Trends Biotechnol. 2006, 24, 102-\n104.\n(5) Stoughton, R. B.; Friend, S. H. Nat. Rev. Drug Discovery 2005, 4, 345-350.\n(6) Viant, M. R.; Rosenblum, E. S.; Tjeerdema, R. S. Environ. Sci. Technol. 2003,\n37, 4982-4989.\n(7) Nicholson, J. K.; Lindon, J. C.; Holmes, E. Xenobiotica 1999, 29, 1181-\n1189.\n(8) Dunn, W. B.; Ellis, D. I. Trends Anal. Chem. 2005, 24, 285-294.\n(9) Villas-Boas, S. G.; Mas, S.; Akesson, M.; Smedsgaard, J.; Nielsen, J. Mass\nSpectrom. Rev. 2005, 24, 613-646.\n(10) Hendrickson, C. L.; Emmett, M. R. Annu. Rev. Phys. Chem. 1999, 50, 517-\n536.\n(11) Marshall, A. G.; Hendrickson, C. L.; Jackson, G. S. Mass Spectrom. Rev.\n1998, 17, 1-35.\n(12) Cooper, H. J.; Marshall, A. G. J. Agric. Food Chem. 2001, 49, 5710-5718.\n(13) Fard, A. M.; Turner, A. G.; Willett, G. D. Aust. J. Chem. 2003, 56, 499-\n508.\n(14) Stentiford, G. D.; Viant, M. R.; Ward, D. G.; Johnson, P. J.; Martin, A.; Wei,\nW. B.; Cooper, H. J.; Lyons, B. P.; Feist, S. W. Omics: J. Integrative Biol.\n2005, 9, 281-299.\n(15) Aharoni, A.; Ric de Vos, C. H.; Verhoeven, H. A.; Maliepaard, C. A.; Kruppa,\nG.; Bino, R.; Goodenowe, D. B. Omics: J. Integrative Biol. 2002, 6, 217-\n234.\n(16) Brown, S. C.; Kruppa, G.; Dasseux, J. L. Mass Spectrom. Rev. 2005, 24,\n223-231.\nAnal. Chem. 2007, 79, 4595-4602\n10.1021\/ac062446p CCC: $37.00 © 2007 American Chemical Society Analytical Chemistry, Vol. 79, No. 12, June 15, 2007 4595\nPublished on Web 05\/19\/2007\nmass measurements alone. Furthermore, if isotope information\nis used in conjunction with accurate mass measurements, iden-\ntification of peaks over a wide mass range can be achieved with\neven greater certainty.17 This is of considerable importance in\nmetabolomics, as the identification of unknown metabolites\nremains one of the biggest analytical challenges.\nLiquid chromatography MS (LC-MS)18-20 and direct infusion\nelectrospray MS (DI ESI MS)21-24 are both commonly used in\nmetabolomics. One major benefit of DI ESI MS is that the\ndependent axis corresponding to the mass-to-charge ratio (m\/z)\nis substantially more reproducible than in LC-MS, where\nchromatographic retention time (RT) will change as a function of\ncolumn age and performance; e.g., a routine 1 ppm uncertainty\nin m\/z in FT-ICR MS is equivalent to a 0.0018-s uncertainty in RT\nfor a typical 30-min chromatographic separation, a value that is\ncurrently unachievable. The reproducibility of the m\/z-dependent\naxis value is important for spectral interpretation as well as for\nfacilitating comparison of data sets collected during different\nexperimental sessions. Although DI ESI MS benefits from a\nfundamentally more simple one-dimensional data set than the two-\ndimensional LC-MS data set, the availability of the time dimen-\nsion in LC-MS can provide better discrimination of metabolites\nand aid in structural identification. Considering sample through-\nput, DI ESI MS offers shorter analysis times than conventional\nLC-MS, which is clearly an advantage. Conventional DI ESI MS,\nhowever, does suffer from ionization suppression and enhance-\nment, which arises when particular analytes preferentially ionize\nover less polar metabolites in the complex mixture. The conven-\ntional method for reducing this problem is to utilize LC separation\nprior to MS analysis,25 which removes salts from the complex\nmixture and reduces the number of compounds entering the mass\nspectrometer at any given time. However, by slowing the sample\ndelivery rate to 200 nL\/min using a chip-based DI nanoelectro-\nspray source (NanoMate, Advion Biosciences), as reported here,\nionization suppression has been shown to be substantially reduced\ncompared to conventional DI electrospray ionization.26\nFor samples analyzed by direct infusion, the finite dynamic\nrange of a MS detector will limit the observation to only the most\nintense ions. To identify lower abundance ions, the dynamic range,\ni.e., the ratio of the highest to lowest concentration metabolites\ndetected, needs to be increased. High dynamic range can be\nachieved using DI ESI FT-ICR MS by increasing the number of\nions that enter the ICR detector cell. This, however, can signifi-\ncantly increase space-charge effects,27,28 which degrade the mass\naccuracy to such an extent that derivation of unique empirical\nformulas for the observed peaks is no longer possible. In this\npaper, we report a strategy for wide-scan DI nESI FT-ICR MS that\neffectively increases the overall dynamic range of the mass\nspectrum, enabling observation of both low- and high-concentra-\ntion biological metabolites with high mass accuracy. The approach\nis based upon the collection of multiple narrow, overlapping\nspectra (or “windows”), that are subsequently combined (or\n“stitched”) together using novel algorithms. A somewhat similar\nnon-data-dependent “wide-scan” acquisition strategy was reported\nby Venable et al.,29 based upon the sequential isolation and\nfragmentation of multiple m\/z 10 wide precursor windows using\nLC-MS\/MS, which increased the signal-to-noise ratio in a\nproteomics study. In our approach, each window is analyzed using\nselected ion monitoring (SIM) mode, and consequently, each\nwindow is composed of relatively few ions to minimize space-\ncharge effects. This approach produces a “SIM-stitched”, wide-\nscan mass spectrum with a significantly greater dynamic range,\nenabling many more metabolites to be detected, and with higher\nmass accuracy than is possible with existing methods. To maintain\nhigh mass resolution, relatively slow data acquisition is required\n(typically 1 s\/transient) with many transients averaged to produce\na single mass spectrum. Therefore, our method requires continu-\nous infusion of each sample for a few minutes, which is achieved\nusing a NanoMate chip-based nanoelectrospray system.30 This\nsystem has previously been used for metabolomics31 and is fully\nautomated, using a new sample delivery tip and electrospray\nnozzle for each analysis to enable high throughput with no cross-\ncontamination.\nStitching the multiple SIM windows together to produce a\nsingle contiguous, wide-scan spectrum is important for several\nreasons. First, the multivariate analysis of mass spectral finger-\nprints using widely utilized methods in metabolomics, such as\nprincipal components analysis, requires a single spectral finger-\nprint per biological sample. Second, methods that search for\ncharacteristic peak spacings across the entire spectral range (for\nexample, Breitling et al.32) also require one contiguous data set.\nThird, the stitching algorithm is used to mass calibrate SIM\nwindows that do not contain internal calibrants (see Supporting\nInformation for details). Finally, stitching multiple data sets\ntogether substantially aids data handling, storage, and visual\ninspection of the mass spectral measurements.\nThe aims of this study are therefore to develop and test a novel\nanalytical and bioinformatic approach for wide-scan, high dynamic\nrange DI nESI FT-ICR MS analysis of complex biological mixtures\nof low molecular weight metabolites, which can achieve a\nmaximum mass error of <1 ppm and a mass resolution of 100 000.\nSuch a high mass resolution and mass accuracy is currently only\noffered by FT-ICR MS and is key for the acquisition of reliable\n(17) Kind, T.; Fiehn, O. BMC Bioinformatics 2006, 7.\n(18) Idborg-Bjorkman, H.; Edlund, P. O.; Kvalheim, O. M.; Schuppe-Koistinen,\nI.; Jacobsson, S. P. Anal. Chem. 2003, 75, 4784-4792.\n(19) Plumb, R. S.; Stumpf, C. L.; Gorenstein, M. V.; Castro-Perez, J. M.; Dear, G.\nJ.; Anthony, M.; Sweatman, B. C.; Connor, S. C.; Haselden, J. N. Rapid\nCommun. Mass Spectrom. 2002, 16, 1991-1996.\n(20) von Roepenack-Lahaye, E.; Degenkolb, T.; Zerjeski, M.; Franz, M.; Roth,\nU.; Wessjohann, L.; Schmidt, J.; Scheel, D.; Clemens, S. Plant Physiol. 2004,\n134, 548-559.\n(21) Allen, J.; Davey, H. M.; Broadhurst, D.; Heald, J. K.; Rowland, J. J.; Oliver,\nS. G.; Kell, D. B. Nat. Biotechnol. 2003, 21, 692-696.\n(22) Castrillo, J. I.; Hayes, A.; Mohammed, S.; Gaskell, S. J.; Oliver, S. G.\nPhytochemistry 2003, 62, 929-937.\n(23) Dunn, W. B.; Overy, S.; Quick, W. P. Metabolomics 2005, 1, 137-148.\n(24) Goodacre, R.; York, E. V.; Heald, J. K.; Scott, I. M. Phytochemistry 2003,\n62, 859-863.\n(25) Siuzdak, G. The Expanding Role of Mass Spectrometry in Biotechnology.; MCC\nPress: San Diego, CA., 2003.\n(26) Hop, C.; Chen, Y.; Yu, L. J. Rapid Commun. Mass Spectrom. 2005, 19, 3139-\n3142.\n(27) Ledford, E. B.; Rempel, D. L.; Gross, M. L. Anal. Chem. 1984, 56, 2744-\n2748.\n(28) Zhang, L. K.; Rempel, D.; Pramanik, B. N.; Gross, M. L. Mass Spectrom.\nRev. 2005, 24, 286-309.\n(29) Venable, J. D.; Dong, M. Q.; Wohlschlegel, J.; Dillin, A.; Yates, J. R. Nat.\nMethods 2004, 1, 39-45.\n(30) Schultz, G. A.; Corso, T. N.; Prosser, S. J.; Zhang, S. Anal. Chem. 2000,\n72, 4058-4063.\n(31) Boernsen, K. O.; Gatzek, S.; Imbert, G. Anal. Chem. 2005, 77, 7255-7264.\n(32) Breitling, R.; Ritchie, S.; Goodenowe, D.; Stewart, M. L.; Barrett, M. P.\nMetabolomics 2006, 2, 155-164.\n4596 Analytical Chemistry, Vol. 79, No. 12, June 15, 2007\nand meaningful metabolomics data. During this study, we have\napplied our SIM-stitching technique to a chemically defined\nmixture of poly(ethylene glycol) and amino acids, as well as to\nreal biological samples (fish liver extracts). The chemically defined\nmixture enabled us to assess the mass accuracy of the FT-ICR\nMS as a function of the number of ions transferred into the ICR\ndetector cell and to assess the mass accuracy of our SIM-stitching\napproach. The liver extracts were used to determine the ideal\nwidth of each SIM window and to assess the improvement in\ndynamic range by comparing the total number of peaks detected\nusing our SIM-stitching approach with a leading commercial\nmethod.\nEXPERIMENTAL METHODS\nPoly(ethylene glycol) and Amino Acids (PEG&AA) Stan-\ndard. A solution of 0.0005% poly(ethylene glycol) (PEG) 200,\n0.0005% PEG 600, and 0.5 mM concentrations of 10 amino acids\n(glycine, alanine, serine, proline, cysteine, aspartic acid, glutamine,\nphenylalanine, arginine, tyrosine) (Sigma-Aldrich, Dorset, UK) was\nprepared in 50:50 methanol\/deionized water (both HPLC grade,\nJ. T. Baker) with 0.25% formic acid (Fisher Scientific, Loughbor-\nough, UK).\nPreparation of Liver Extracts. Frozen livers from a wild-\ncaught species of marine flatfish called dab (Limanda limanda)\nwere provided by the Centre for Environment, Fisheries and\nAquaculture Science (Cefas, Weymouth, UK). Tissues were kept\nat -80 °C until extraction. Each liver was homogenized in\n8 íL\/mg (wet tissue mass) methanol and 2.5 íL\/mg water using\na Precellys-24 ceramic bead-based homogenizer (Stretton Scientific\nLtd.). Next, 8 íL\/mg chloroform (pesticide analysis grade, Fisher\nScientific) and 9.5 íL\/mg water were added, the biphasic mixture\nwas centrifuged (1500g), and the upper (polar) and lower (non-\npolar) phases were isolated and frozen at -80 °C. Prior to MS\nanalysis, polar extracts were dried using a centrifugal concentrator\n(Thermo Savant, Holbrook, NY), resuspended in 3 times the\nvolume of original solvent (50:50 methanol\/water with 0.25%\nformic acid), and then centrifuged (5000g). The nonpolar extracts\nwere not used in this study.\nFT-ICR Mass Spectrometry. Samples were analyzed using\na hybrid 7-T Fourier transform ion cyclotron resonance mass\nspectrometer (LTQ FT, Thermo Electron Corp., Bremen, Ger-\nmany) equipped with a chip-based direct infusion nanoelectrospray\nionization assembly (NanoMate, Advion Biosciences, Ithaca, NY).\nNanoelectrospray conditions comprised a 200 nL\/min flow rate,\n0.5 psi backing pressure, and 1.65 kV electrospray voltage,\ncontrolled by ChipSoft software (version 6.4.3, Advion Bio-\nsciences). Various scan modes were used that we define as\nfollows: “full scan” is a conventional data acquisition mode for\nwide m\/z ranges, “SIM” is a conventional selected ion monitoring\nmode, and “wide-scan range” (WSR, Thermo Electron) is a new\nmethod designed to alleviate the loss of low mass ions when\nanalyzing wide ranges.33 WSR optimizes the transfer of ions from\nthe linear ion trap to the ICR detector for full scans by segmenting\nthe total m\/z spectral range into an optimal number of smaller\nwindows (typically 2-5 windows). This helps to minimize the loss\nof low mass ions due to time-of-flight effects. Mass resolution was\nfixed at 100 000 (defined for an ion at m\/z 400) throughout.\nAutomatic gain control (AGC, corresponding to the number of\ncharges transferred from the front-stage ion trap to the ICR\ndetector cell) targets were varied (discussed in Results), and the\nmaximum ion trap fill time was set to 1 s throughout. Data were\nobtained either as processed mass spectra with associated peak\nlists (Xcalibur, version 2.0, Thermo Electron) or as transient files\n(i.e., scans recorded in the time domain), which were processed\nusing custom-written MATLAB software, described below. The\nlatter was required for all mass spectra subjected to the SIM-\nstitching algorithm.\nProcessing of Transient Files. Transient files were processed\nusing custom-written MATLAB code (version 7, The MathWorks,\nNatick, MA) to generate a calibrated peak list (described in\nSupporting Information).\nCalibration and Calculation of Mass Errors. Spectra were\ncalibrated by one of two methods, either using RecalOffline\n(Thermo Electron) or custom-written MATLAB code (see Sup-\nporting Information). Both methods used the known accurate\nmasses of at least three peaks within the mass spectrum for\ncalibration. Calibrants used in the PEG&AA spectra are listed in\nTable S-1. For spectra of liver extracts, several known endogenous\nmetabolites that were consistently present in 18 different fish\n(Table S-2) were used for internal calibration.34 Mass errors for\nthe PEG&AA spectra were calculated using all known peaks that\nwere not used for calibration.\nSIM-Stitching Algorithm. The SIM windows, represented in\nthe frequency domain, were individually calibrated when calibrants\nwere available. The windows were aligned with peaks present in\nthe overlap region between adjacent calibrated windows. The final\nwide-scan spectrum was obtained by averaging the resultant\nwindows and removing regions of m\/z 5 from each end of each\nwindow (for reasons justified in Results). All processing was\nexecuted in MATLAB, as described in Supporting Information,\nwhich additionally includes an assessment of the stability of the\nSIM-stitching algorithm as the number of internal calibrants is\nvaried. The MATLAB SIM-stitching code is available on request\nfrom the corresponding author.\nPeak Counting and Dynamic Range Measurement. To\nvirtually eliminate the effects of residual noise, all peak counting\nwas performed using three spectra obtained from the same\nsample. A peak was only considered real if, within a sliding window\nof 1 ppm, exactly one peak appeared in each of these three spectra.\nThe “true” peak position was then taken to be the mean of the\nthree peaks. The dynamic range was calculated from peak lists\nthat had been filtered using the above algorithm, as the intensity\nratio between the strongest and weakest peaks.\nRESULTS AND DISCUSSION\nOptimization of Number of Ions Transferred to ICR Cell.\nOur first goal was to optimize the number of charges to be\ntransferred from the front-stage ion trap to the ICR detector cell\n(using the AGC) in order to minimize space-charge effects and\nconsequently maximize the mass accuracy. Since virtually all ions\nobserved were singly charged (peaks occurred at integral mass\nvalues), the AGC target value was reflective of the actual number\n(33) Muenster, H.; Sanders, M.; Warrack, B.; Lange, O.; Homing, S. In 53rd\nASMS Conference on Mass Spectrometry; San Antonio, TX, 2005.\n(34) Yanofsky, C. M.; Bell, A. W.; Lesimple, S.; Morales, F.; Lam, T. T.; Blakney,\nG. T.; Marshall, A. G.; Carrillo, B.; Lekpor, K.; Boismenu, D.; Kearney, R.\nE. Anal. Chem. 2005, 77, 7246-7254.\nAnalytical Chemistry, Vol. 79, No. 12, June 15, 2007 4597\nof ions being transferred. For all analyses, the maximum ion trap\nfill time (1 s) was never reached, thus guaranteeing each AGC\ntarget value was achieved. The PEG&AA standard was analyzed\nusing AGC target values of 1 \u0002 105, 2 \u0002 105, 3 \u0002 105, 5 \u0002 105, and\n1 \u0002 106. Each analysis comprised SIM scans (in triplicate) between\nm\/z 100-200, 300-400, and 500-600. All spectra were calibrated\nusing RecalOffline with three internal calibrants, and mass errors\nwere calculated on all remaining known peaks (18-24 peaks\/\nreplicate, including all three ranges). Increasing the AGC target\ncaused an approximately linear increase in the root-mean-squared\n(rms) mass error (Figure 1). AGC targets of 5 \u0002 105 and 1 \u0002 106\nresulted in unacceptably high maximum absolute errors (2.7 and\n3.9 ppm, respectively), which would make peak identification\ndifficult, and these settings will not be considered further. The\nthree lowest AGC targets had somewhat similar maximum\nabsolute mass errors; however, only the AGC target of 1 \u0002 105\nyielded a maximum error below 1 ppm. An AGC target of 1 \u0002 105\nalso had the lowest rms error of 0.24 ppm, compared to equivalent\nvalues of 0.36 and 0.57 ppm for AGC targets of 2 \u0002 105 and 3 \u0002\n105, respectively. Closer analysis of the spectrum with an AGC\ntarget of 1 \u0002 105 revealed 47% of all measured peaks had an\nabsolute error of <0.1 ppm, while 90% were <0.3 ppm. In\ncomparison, the AGC target of 2 \u0002 105 had only 26 and 66% of all\nmeasured peaks of <0.1 and <0.3 ppm absolute error, respec-\ntively.\nAs the AGC target is decreased, the number of ions entering\nthe ICR cell decreases; space-charge effects therefore also\ndecrease and higher mass accuracy is achieved. Unambiguous\npeak identification requires high mass accuracy. For a singly\ncharged ion of m\/z 500, there are two possible empirical formulas\nif the mass error is 0.1 ppm; however, this rises dramatically to\n21 and 64 possibilities for errors of 1 and 3 ppm, respectively,17\nwhich highlights the importance of minimizing mass error.\nFurthermore maximum mass error, rather than rms error, should\nbe used to assess mass accuracy since it better represents the\ncapability of a mass spectrometry method for automated metabo-\nlite identification.35 In theory, the AGC target would be set\nextremely low to achieve near perfect mass accuracy; however,\nlowering the AGC target reduces sensitivity and so a compromise\nmust be reached. For the SIM-stitching method, we chose the\nhighest AGC target value that produced a sub-ppm maximum\nmass error, namely, 100 000 charges (singly charged ions), which\nalso corresponds to Thermo’s recommended AGC for a SIM scan.\nOptimization of SIM Window Size. The second goal was to\noptimize the SIM window size to maximize the number of\nmetabolites detected with an AGC target of 1 \u0002 105. In the first\n“coarse” study, liver extract was analyzed using seven increasing\nwindow widths from m\/z 20 to 900, each sharing a common m\/z\n10 region (Figure 2a). Considering that our final method requires\nextensive coverage of the metabolome, the narrower the windows,\nthe more windows that would need to be acquired (and stitched\ntogether) to cover a wide mass range. Therefore, narrow windows\nreceived proportionally less signal averaging (number of transient\nscans) than wider ones in order for the total acquisition time for\nthe entire mass range to remain constant (Table 1, Figure 2a).\nAll spectra were acquired in SIM mode except for the m\/z 900\nwindow (setting was unavailable so full scan was used). The entire\nstudy was conducted at three different m\/z values centered at\nm\/z 170, 320, and 470 (each in triplicate), and for each experiment,\npeaks were then counted within the central m\/z 10 region that\nwas common to all the spectra (Table 1). The average number of\npeaks detected increased as the window size became more narrow,\nwith \u001817 times more peaks observed in the m\/z 20 versus 900\nwindow even though the wider window was signal averaged for\n\u001836 times longer (Figure 2b). A “fine” study was then conducted\nin which liver extract was analyzed using six increasing window\nwidths from m\/z 10 to 100 that shared a common m\/z 6 region.\nAs before, the acquisition time (number of transient scans) of each\nwindow was proportionally altered. This was conducted at five\ndifferent m\/z values centered at m\/z 200, 250, 300, 350, and 400,\nand peaks were counted within the central m\/z 6 region that was\ncommon to all spectra (Table 1). Decreasing the window size from\nm\/z 100 to 30 showed \u00182-fold increase in the average (of all five\nm\/z values scanned) numbers of peaks detected. Window sizes\nof m\/z 30, 20, and 10 all achieved similar high peak counts of 5.4,\n5.1, and 5.6 peaks per nominal mass unit, respectively (Figure\n2c). These results show that reducing the window size increases\nthe number of peaks detected, until a window of m\/z 30 is reached\nwhereby any further size reduction shows no improvement in peak\ncount. These findings can be rationalized by considering that (i)\n\u0018200 ions of the same metabolite are required to generate a\ndetectable signal in the ICR cell,11 (ii) a total of only 1 \u0002 105 ions\nare transferred to the ICR cell as determined by the AGC, and\n(iii) the narrower the SIM window the fewer different metabolites\nare transferred to the cell and, therefore, the greater the likelihood\nthat a low-abundance metabolite will be present in sufficient ion\nnumber to be detected. It appears, however, that the reduction in\nacquisition time for windows narrower than m\/z 30 counteracts\nany sensitivity benefit that would be gained by a further reduction\nof window size (i.e., there is insufficient signal averaging to\nincrease the signal-to-noise ratio to detect more peaks). In\nconclusion, window sizes of m\/z 10, 20, and 30 were equally\n(35) Herniman, J. M.; Langley, G. J.; Bristow, T. W. T.; O’Connor, G. J. Am. Soc.\nMass Spectrom. 2005, 16, 1100-1108.\nFigure 1. Effect of the number of charges transferred to the ICR\ndetector cell on the absolute mass accuracy of several known\nmetabolites from a poly(ethylene glycol) and amino acid standard\nmixture. Solid bars denote the rms mass error, and error bars denote\nthe maximum absolute mass error.\n4598 Analytical Chemistry, Vol. 79, No. 12, June 15, 2007\nefficient at detecting high numbers of peaks and would all be\nconsidered for our final SIM-stitching method.\nIon Intensity across the SIM Window. A phenomenon was\nobserved (that we term an “edge effect”) whereby ion intensities\nat each end of a SIM window were severely reduced. A m\/z 30\nSIM window containing two closely spaced peaks was analyzed\nmultiple times, such that the two peaks appeared at different\nlocations throughout the window. It was expected that the intensity\nratio of the two peaks would remain constant regardless of their\nlocation in the SIM window. However, we discovered that as one\nof the peaks approached the low-intensity edge region then the\nratio of the two peaks altered dramatically (Figure S-3 Supporting\nInformation). Edge effects were characterized at four mass ranges\n(near m\/z 84, 175, 350, and 700), which revealed the most\ndramatic effect at m\/z 84 (regions of m\/z 4 and 8 were lost at the\nlower and upper ends, respectively), less of an effect at m\/z 175\n(regions of m\/z 4 and 3 were lost at the lower and upper ends,\nrespectively), less effect again at m\/z 350 (region of m\/z 5 was\nlost at the upper end only), and no effect at m\/z 700 (Figure S-3).\nThe m\/z 20 SIM windows showed signal loss very similar to m\/z\n30 SIM scans (data not shown). Therefore, for the SIM-stitching\nmethod, we chose a m\/z 30 SIM window since it has the lowest\npercentage signal loss. Also, to compensate for this edge effect,\nadjacent SIM windows were overlapped by m\/z 10.\nComparison of Mass Accuracies between SIM-Stitching\nand WSR Modes. The SIM-stitching method was assessed\nagainst WSR mode to ensure that high mass accuracy was being\nachieved. The optimized SIM-stitching method comprised 21\nadjacent m\/z 30 windows between m\/z 70 and 500, each overlap-\nping by m\/z 10 to facilitate m\/z-based stitching and to remove\ndeleterious edge effects (Figure 3a). Each SIM window was\nacquired for 15 s with a single 15-s delay post electrospray\ninitiation, giving a 5.5 min total analysis time; the AGC target was\n1 \u0002 105. PEG&AA standard was analyzed between m\/z 70 and\n500 (in triplicate) by SIM-stitching and by WSR mode using AGC\ntargets of 1 \u0002 105 (comparable with SIM-stitching method) and 5\n\u0002 105 (Thermo recommendation); total acquisition times of 5.5\nmin were used for all three methods. For the SIM-stitching\nmethod, transient data for the 21 SIM windows were acquired,\nprocessed, and each internally calibrated using a single calibrant\n(16 calibrants in total, 5 used twice as they occurred in adjacent\nwindows; Tables 2 and S-1) and then stitched together along the\nm\/z and intensity axes. For WSR mode, transient data were\nacquired, processed, and internally calibrated using 10-14 of the\n16 calibrants used previously (less calibrants used due to reduced\nsensitivity of WSR; Tables 2 and S-1). Mass accuracies were\ncalculated using all known noncalibrant peaks (Table 2). Consid-\nering the three replicates for each method, SIM-stitching yielded\nthe smallest average rms error, smallest maximum absolute error,\nFigure 2. (a) Experimental design for the coarse study that\noptimized the SIM window size by counting the number of peaks\nwithin common m\/z 10 ranges for several different window sizes.\nPeaks were counted between m\/z 165-175, 315-325, and 465-\n475. Acquisition times are shown as the numbers of transient scans\nper window. (b) Effect of SIM window size (from m\/z 20 to 900) on\nthe average number of peaks detected per nominal mass unit in fish\nliver extract (coarse study). (c) As for part b except SIM window size\nwas varied from m\/z 10 to 100 (fine study).\nTable 1. Window Widths and Acquisition Times (Given\nas Number of 1-s Transient Scans) Used in the\nOptimization of SIM Window Width Studya\ncoarse study fine study\nSIM\nwindow\nwidth\nno. of\ntransient\nscans\nacquired\ncommon\nm\/z 10\nranges\nwhere\npeaks\nwere\ncounted\nSIM\nwindow\nwidth\nno. of\ntransient\nscans\nacquired\ncommon\nm\/z 6\nranges\nwhere\npeaks\nwere\ncounted\n20\n50\n100\n200\n400\n600\n900\n6\n12\n24\n48\n96\n144\n216\n165-175,\n315-325,\nand\n465-475,\nfor each\nwindow\nwidth\n10\n20\n30\n40\n50\n100\n5\n10\n15\n20\n25\n50\n197-203,\n247-253,\n297-303,\n347-353,\nand\n397-403,\nfor each\nwindow\nwidth\na Peaks were counted in the common m\/z 10 and 6 regions for the\ncoarse and fine studies, respectively.\nAnalytical Chemistry, Vol. 79, No. 12, June 15, 2007 4599\nand smallest average standard deviation. WSR (AGC target of 5\n\u0002 105) mode showed the largest errors (Table 2, Figure S-4),\nalmost certainly resulting from increased space-charge effects in\nthe ICR cell. The small increase in error in the WSR (AGC target\nof 1 \u0002 105) method versus SIM-stitching could be due to the lack\nof calibrants. However, when considering that WSR (AGC target\nof 1 \u0002 105) replicate 3 (using 10 calibrants) achieved mass errors\nsimilar to replicate 1 (using 14 calibrants), this suggests that\nincreasing the number of calibrants above 10 has little benefit.\nTherefore, it is unlikely that addition of two more calibrants (to\nequal the 16 used in SIM-stitching) would further improve the\nmass accuracy. This suggests that the algorithm used to calibrate\nSIM-stitched data could be improving the mass accuracy. Each\nwindow comprising the SIM-stitched wide scan was calibrated\nusing unique calibration parameters allowing for precise correction\nof local m\/z shifts, while in WSR mode just one set of calibration\nparameters is used for the whole spectrum, likely explaining the\nslightly higher mass errors of the WSR mode.\nComparison with the mass errors reported above in the\nOptimization of Number of Ions Transferred to ICR Cell section\nrevealed the WSR (AGC target of 1 \u0002 105) data to have errors\nsimilar to the earlier data recorded at an AGC target of 1 \u0002 105\n(demonstrating consistency), while the SIM-stitching method\nshowed improved mass accuracy (likely due to a more efficient\ncalibration method). The WSR (AGC target of 5 \u0002 105) data had\nlower errors than the earlier spectra recorded at AGC target of 5\n\u0002 105, which probably results from the use of more calibrants\n(14 compared to 3) and the exclusion of m\/z 500-600 (which\ncontains the largest mass errors). In conclusion, SIM-stitching\nshowed high mass accuracy and, in terms of maximum absolute\nerror, was \u00181.3-fold more accurate than WSR (AGC target of 1 \u0002\n105) and 4.3-fold more accurate than WSR (AGC target of 5 \u0002\n105). Reducing mass error from 1.0 to 0.1 ppm causes \u001810-fold\ndecrease in the number of potential empirical formulas for a peak\nat m\/z 500.17 Therefore, halving the maximum absolute mass error\nfrom 1 (our original target) to 0.48 ppm will prove particularly\nadvantageous for peak identification, which will be strengthened\nfurther by isotope information.\nComparison of Numbers of Peaks Detected and Dynamic\nRange between SIM-Stitching and WSR Modes. The final goal\nwas to identify whether the number of detected peaks and the\ndynamic range could be increased using SIM-stitching compared\nto WSR. Six liver extracts were analyzed using SIM-stitching\n(Figure 3a), WSR mode (AGC target of 1 \u0002 105) and WSR mode\n(AGC target of 5 \u0002 105) between m\/z 70 and 500 (in triplicate).\nIn each case, the total acquisition time was 5.5 min (including a\n15-s data acquisition delay postelectrospray initiation) to facilitate\na direct comparison between the methods. The m\/z range of 70-\n500 corresponds to the highest density of low molecular weight\nendogenous metabolites. For all methods, transient data were\ncollected and processed as described for the PEG&AA studies\nabove, except that known endogenous metabolites were used as\ncalibrants (Table S-2). Visual inspection of the spectra (normalized\nto the largest peak) with a 5-fold zoom along the y-axis revealed\nthat WSR (AGC target of 5 \u0002 105) and SIM-stitching (Figure 3c,\nd) detected a more dense spread of peaks throughout the entire\nm\/z 70-500 range than WSR (AGC target of 1 \u0002 105) (Figure 3\nb). A further 200-fold zoom within m\/z 355-360 (Figure 3b-d\nFigure 3. (a) Schematic of the optimized SIM-stitching method\ncomprising 21 adjacent 30 m\/z SIM windows, each overlapping by\nm\/z 10 and acquired for 15 s, covering a total scan range of m\/z\n70-500 and with an AGC setting of 1 \u0002 105 ions transferred to the\nICR detector. Representative wide-scan FT-ICR mass spectra of a\nfish liver extract obtained using (b) WSR with AGC target of 1 \u0002 105,\n(c) WSR mode with AGC target of 5 \u0002 105, and (d) optimized SIM-\nstitching method. All spectra were normalized to the largest peak,\nand the main figures show a 5-fold zoom along the y-axis. Insets\nshow the mass range between m\/z 355 and 360 using a 1000-fold\nzoom along the y-axis. The acquisition time for each method was\n5.5 min to facilitate a direct comparison between the approaches.\n4600 Analytical Chemistry, Vol. 79, No. 12, June 15, 2007\ninsets) revealed SIM-stitching to detect significantly more peaks\nthan WSR (AGC target of 5 \u0002 105), while WSR (AGC target of 1\n\u0002 105) failed to detect any peaks.\nFor each method, the total number of peaks was counted\n(between m\/z 70 and 500) for each of the six liver extracts (Figure\n4), and the dynamic ranges were determined. The average peak\ncounts for the six liver extracts were 3046 for SIM-stitching, 575\nfor WSR (AGC target of 1 \u0002 105), and 1719 for WSR (AGC target\nof 5 \u0002 105). SIM-stitching detected on average 5.3- and 1.8-fold\nmore peaks than both WSR methods (AGC targets of 1 \u0002 105\nand 5 \u0002 105, respectively), even though each SIM window received\n21 times less signal averaging than the full-scan WSR spectra.\nEven when compared to an experiment where five times as many\nions enter the ICR detector cell (i.e., WSR with AGC target of 5\n\u0002 105), the SIM-stitching method still detected \u001844% additional\nion species. The relative standard deviation (RSD) of the number\nof peaks detected across the six fish livers was 7% for SIM-\nstitching, 5% for WSR (AGC target of 1 \u0002 105), and 7% for WSR\n(AGC target of 5 \u0002 105). This showed that each method was able\nto generate consistent peak counts when genetically different fish\nfrom the same species were analyzed and highlights the reproduc-\nibility of all methods. RSDs of peak intensities were calculated\nfor the same 17 known internal calibrants (Table S-2) for each of\nthe three analysis methods across triplicate analyses of one fish\n(only 17 internal calibrants were common to all three analysis\nmethods due to reduced sensitivity of the WSR methods). The\nmean and maximum RSD values were 8.1 and 16.5% for the SIM-\nstitching method, 11.4 and 23.2% for WSR (AGC target of 1 \u0002\n105), and 11.3 and 17.9% for WSR (AGC target of 5 \u0002 105), which\nfurther emphasizes the reproducibility of all three methods but,\nmore importantly, highlights another advantage of the SIM-\nstitching method. Specifically, that by acquiring the metabolic data\nusing narrow SIM windows the reproducibility of the intensity\nprofiles is increased relative to wide-scan methods. The mean\ndynamic range of 16 061 for the SIM-stitched data was \u001822-fold\ngreater than for WSR with an AGC target of 1 \u0002 105 (mean\ndynamic range of 726) and \u00184.3-fold greater than for WSR with\nan AGC target of 5 \u0002 105 (mean dynamic range of 3684), which\nmirrored the results from the peak count study. This increase in\ndynamic range is clearly visible in Figure 3b-d.\nWhen acquiring data as a single large window (e.g., m\/z 70-\n500), which for a complex biological mixture will comprise a large\nnumber of different ion species, a considerable percentage of the\nAGC target value will be occupied by the most highly abundant\nions and there is less chance that low-abundance species will\nachieve the \u0018200 ion detection threshold.11 However, when\nanalyzing a m\/z 30 SIM window, only ion species within the\nspecified range are transferred to the ICR detector and all other\nions are excluded by isolation waveforms. This greatly reduces\nthe number of individual ion species, meaning that the AGC target\nvalue is no longer dominated to the same extent by highly\nabundant ions, which allows low-abundance species to reach the\ndetection threshold. In effect, SIM-stitching allows more ions per\nnominal mass unit to transfer into the ICR detector; e.g., AGC\ntarget of 1 \u0002 105 when scanning a m\/z 30 window is \u00183334 ions\nper nominal mass unit, whereas the higher AGC target of 5 \u0002\n105 when scanning m\/z 70-500 is only \u00181163 ions per nominal\nmass unit. Therefore, compared to WSR (AGC target of 5 \u0002 105),\nSIM-stitching increases the number of ions scanned per nominal\nTable 2. Summary of Mass Errors for SIM-Stitching and WSR Methods (with AGC Targets of 1 \u0002 105 and 5 \u0002 105)\nDetermined from Analysis of the PEG&AA Standarda\noverall\nscan type replicate NC NP\nrms\nerror\n(ppm)\nmax\nabsolute\nerror\n(ppm)\nSD of\nerror\n(ppm)\nav rms\nerror\n(ppm)\nmax\nabsolute\nerror\n(ppm)\nav SD\nof error\n(ppm)\nWSR (1 \u0002 105) 1 14 26 0.254 0.617 0.257 0.234 0.617 0.228\n2 14 26 0.199 0.461 0.194\n3 10 20 0.248 0.613 0.232\nWSR (5 \u0002 105) 1 14 35 0.612 2.041 0.593 0.565 2.041 0.492\n2 14 35 0.519 0.915 0.441\n3 14 35 0.564 1.408 0.443\nSIM stitched 1 16 39 0.179 0.423 0.161 0.181 0.475 0.165\n2 16 39 0.193 0.459 0.181\n3 16 39 0.171 0.475 0.154\na Each method was characterized in triplicate, and the numbers of internal calibrants (Nc) and other known peaks used to calculate mass errors\n(NP) are shown.\nFigure 4. Comparison of the total number of peaks detected\nbetween m\/z 70 and 500 for six different fish liver extracts using the\noptimized SIM-stitching method, WSR mode with AGC target of 1 \u0002\n105, and WSR mode with AGC target of 5 \u0002 105.\nAnalytical Chemistry, Vol. 79, No. 12, June 15, 2007 4601\nmass unit by \u00183-fold, yielding greater sensitivity and consequently\nincreased peak detection (1.8-fold higher) and dynamic range. The\nincrease is significantly larger when compared to WSR (AGC\ntarget of 1 \u0002 105), where SIM-stitching increases the number of\nions scanned per nominal mass unit by \u001815-fold, yielding\nsignificantly increased peak detection (5.3-fold higher). The\nreduced signal averaging that is inherent to the SIM-stitching\nmethod apparently does not offset this sensitivity increase too\nsignificantly.\nCONCLUSIONS\nThe results demonstrate that when analyzing a wide mass\nrange (m\/z 70-500) by SIM-stitched DI nESI FT-ICR MS, peak\ndetection can be increased on average 5.3- and 1.8-fold and\nmaximum mass error decreased by 1.3- and 4.3-fold compared to\ncommercial wide-scan range mode (with AGC targets of 1 \u0002 105\nand 5 \u0002 105, respectively, the latter being the recommended\nsetting). Using SIM scan mode, detection sensitivity was enhanced\nby collecting the data as a series of narrow, overlapping windows\nof width m\/z 30. The increased detection sensitivity allowed ion\ntransmission to the ICR cell to be reduced to 1 \u0002 105 ions, thus\nreducing space-charge effects and allowing high mass accuracy.\nMass accuracy was enhanced further by the calibration method\nwhereby each of the 21 overlapping SIM windows was individually,\ninternally calibrated prior to stitching, which allowed correction\nof local m\/z shifts. The maximum absolute mass error was shown\nto be 0.48 ppm. When compared to conventional DI ESI MS\nmethods, the SIM-stitching method can provide a significant\nincrease in the number of metabolites detected, thereby increasing\ncoverage of the metabolome. In addition, it maximizes the major\nstrengths of FT-ICR MS, those of high mass accuracy and\nresolution, thereby facilitating improved peak identification via the\ncalculation of empirical formulas. The coupling of a NanoMate to\nthe LTQ FT enables a fully automated analysis in \u00185.5 min\/\nsample, which is conducive for high-throughput analyses. This\nSIM-stitching approach has wide applicability to the measurement\nof any complex chemical mixture by FT-ICR MS. In particular,\nfor biological samples, this new method could benefit both\nmetabolomics and proteomics.\nACKNOWLEDGMENT\nA.D.S. thanks the BBSRC and Cefas for a Ph.D. CASE\nstudentship (under Cefas Seedcorn contract DP195), T.G.P. and\nT.N.A. thank the EPSRC for a Ph.D. studentship and DTA support,\nH.J.C. thanks the Wellcome Trust (074131), and M.R.V. thanks\nthe NERC for an Advanced Fellowship (NER\/J\/S\/2002\/00618).\nThis work was partly supported by NERC grant NE\/D002508\/1.\nThe authors gratefully acknowledge technical support from Mark\nBaumert and Mark Allen (Advion Biosciences) and Bernard\nDelanghe (Thermo Electron Corporation). We also thank Grant\nStentiford, Brett Lyons and Steve Feist (Cefas) for the fish liver\nsamples. A.D.S. and T.G.P. contributed equally as first authors to\nthis work.\nSUPPORTING INFORMATION AVAILABLE\nDescriptions of transient preprocessing, calibration, and SIM-\nstitching algorithms. This material is available free of charge via\nthe Internet at http:\/\/pubs.acs.org.\nReceived for review December 27, 2006. Accepted\nMarch 19, 2007.\nAC062446P\n4602 Analytical Chemistry, Vol. 79, No. 12, June 15, 2007\n"}