{"doi":"10.1086\/320296","coreId":"66220","oai":"oai:dro.dur.ac.uk.OAI2:2454","identifiers":["oai:dro.dur.ac.uk.OAI2:2454","10.1086\/320296"],"title":"Labor pains : change in organizational models and employee turnover in young, high-tech firms.","authors":["Baron,  J. N.","Hannan,  M. T.","Burton,  M. D."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-01","abstract":"Organizational theories, especially ecological perspectives, emphasize the disruptive effects of change. However, the mechanisms producing these effects are seldom examined explicitly. This article examines one such mechanismemployee turnover. Analyzing a sample of high-technology start-ups, we show that changes in the employment models or blueprints embraced by organizational leaders increase turnover, which in turn adversely affects subsequent organizational performance. Turnover associated with organizational change appears to be concentrated among the most senior employees, suggesting \"old guard disenchantment\" as the primary cause. The results are consistent with the claim of neoinstitutionalist scholars that founders impose cultural blueprints on nascent organizations and with the claim of organizational ecologists that altering such blueprints is disruptive and destabilizing","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66220.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2454\/1\/320296.pdf","pdfHashValue":"b3e4f09b13fa659caee76af62e3f7bfaacdb98e0","publisher":"University of Chicago Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:2454<\/identifier><datestamp>\n      2011-08-18T08:56:56Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Labor pains : change in organizational models and employee turnover in young, high-tech firms.<\/dc:title><dc:creator>\n        Baron,  J. N.<\/dc:creator><dc:creator>\n        Hannan,  M. T.<\/dc:creator><dc:creator>\n        Burton,  M. D.<\/dc:creator><dc:description>\n        Organizational theories, especially ecological perspectives, emphasize the disruptive effects of change. However, the mechanisms producing these effects are seldom examined explicitly. This article examines one such mechanismemployee turnover. Analyzing a sample of high-technology start-ups, we show that changes in the employment models or blueprints embraced by organizational leaders increase turnover, which in turn adversely affects subsequent organizational performance. Turnover associated with organizational change appears to be concentrated among the most senior employees, suggesting \"old guard disenchantment\" as the primary cause. The results are consistent with the claim of neoinstitutionalist scholars that founders impose cultural blueprints on nascent organizations and with the claim of organizational ecologists that altering such blueprints is disruptive and destabilizing.<\/dc:description><dc:publisher>\n        University of Chicago Press<\/dc:publisher><dc:source>\n        American journal of sociology, 2001, Vol.106(4), pp.960-1012 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2001-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2454<\/dc:identifier><dc:identifier>\n        issn:0002-9602<\/dc:identifier><dc:identifier>\n        doi:10.1086\/320296<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2454\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1086\/320296<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2454\/1\/320296.pdf<\/dc:identifier><dc:rights>\n        Copyright 2001 by The University of Chicago Press<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0002-9602","issn:0002-9602"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2001,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n23 June 2008\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBaron, J. N. and Hannan, M. T. and Burton, M. D. (2001) ’Labor pains : change in organizational models\nand employee turnover in young, high-tech firms.’, American journal of sociology., 106 (4). pp. 960-1012.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1086\/320296\nPublisher’s copyright statement:\nCopyright 2001 by The University of Chicago Press\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n23 June 2008\nVersion of attached file:\nPublished\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBaron, J. N. and Hannan, M. T. and Burton, M. D. (2001) 'Labor pains : change in organizational\nmodels and employee turnover in young, high-tech firms.', American journal of sociology.,\n106 (4), pp. 960-1012.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1086\/320296\nPublisher’s copyright statement:\nCopyright 2001 by The University of Chicago Press\n960 AJS Volume 106 Number 4 (January 2001): 960–1012\n\u0001 2001 by The University of Chicago. All rights reserved.\n0002-9602\/2001\/10604-0004$02.50\nLabor Pains: Change in Organizational\nModels and Employee Turnover in Young,\nHigh-Tech Firms1\nJames N. Baron and Michael T. Hannan\nStanford University\nM. Diane Burton\nMassachusetts Institute of Technology\nOrganizational theories, especially ecological perspectives, empha-\nsize the disruptive effects of change. However, the mechanisms pro-\nducing these effects are seldom examined explicitly. This article ex-\namines one such mechanism—employee turnover. Analyzing a\nsample of high-technology start-ups, we show that changes in the\nemployment models or blueprints embraced by organizational lead-\ners increase turnover, which in turn adversely affects subsequent\norganizational performance. Turnover associated with organiza-\ntional change appears to be concentrated among the most senior\nemployees, suggesting “old guard disenchantment” as the primary\ncause. The results are consistent with the claim of neoinstitutionalist\nscholars that founders impose cultural blueprints on nascent organ-\nizations and with the claim of organizational ecologists that altering\nsuch blueprints is disruptive and destabilizing.\nINTRODUCTION\nModels of the employment relationship play an important—if not always\nexplicit—role in contemporary theories of organizations. Notwithstanding\n1 This research was supported by the Alfred P. Sloan Foundation and the Stanford\nGraduate School of Business, particularly the Center for Entrepreneurial Studies.\nBaron also received generous support from a Marvin Bower Fellowship at Harvard\nBusiness School and from the Robert and Marilyn Jaedicke Faculty Fellowship at\nStanford Business School while conducting this research; Hannan was supported by\nthe Stanford Graduate School of Business Faculty Trust. We received helpful comments\nand suggestions from Bill Barnett, Peter Cappelli, Glenn Carroll, Robert Gibbons,\nCharles Holloway, David Kreps, Barbara Lubben, Craig Olson, Charles O’Reilly,\nCanice Prendergast, Toby Stuart, and seminar participants at the University of Wis-\nLabor Pains\n961\ntheir other differences, numerous perspectives affirm the idea that organ-\nizations embrace particular culturally accepted logics or blueprints for\norganizing, including a model of how employment relations should be\nstructured. These models are claimed, in turn, to guide subsequent or-\nganizational evolution and to be resistant to change. For instance, in\ndiscussing organizational inertia, population ecologists have argued that\nsurvival prospects are enhanced by organizational features that promote\nreliability and accountability, including a coherent system for managing\nemployees: “Testing for accountability is especially intense during organ-\nization building. . . . When membership involves an employment relation,\npotential members often want guarantees that careers within the organ-\nization are managed in some rational way” (Hannan and Freeman 1984,\np. 153). Among the most important factors in fostering reliability and\naccountability, according to organizational ecologists, are clearly specified\nforms of authority and well-understood bases of exchange between mem-\nbers and the organization. Hence, organizations stand to benefit by de-\nveloping and institutionalizing coherent blueprints for employment re-\nlations that can foster reliability and accountability; once such a blueprint\ngets adopted, it is risky and costly for organizations to alter it.\nNeoinstitutional perspectives also emphasize the importance of nor-\nmative or cultural blueprints in shaping organization building and or-\nganizational evolution (e.g., Guille´n 1994; Fligstein and Byrkjeflot 1996).\nAccording to these accounts, the designers of organizations draw on cul-\nturally appropriate templates and conceptions of control in crafting struc-\ntures, work roles, and employment relations because this enhances or-\nganizational legitimacy and because their own prior socialization and\nenculturation presumably preclude doing otherwise (Fligstein 1987, 1990).\nOrganizational economists have made similar arguments about the\nvalue of distinctive and coherent human-resources systems and their in-\nertial tendencies (Milgrom and Roberts 1995). Organizations benefit from\na coherent, consistent, and well-understood philosophy and set of practices\ngoverning human resource management because: (1) they benefit from\ntechnical complementarities among specific personnel practices (Milgrom\nand Roberts 1992, chap. 4)—for instance, investments in training increase\nthe value of policies that reduce turnover, and vice versa; (2) learning is\nsimplified and accelerated; and (3) the organization can more readily dif-\nferentiate itself from competitors, helping it attract workers well-suited\nto the kinds of jobs and values the firm has on offer. These benefits are\nparticularly likely to be realized when the organization’s model (e.g., an\nconsin, the University of Chicago, and the Wharton School, none of whom should be\nblamed for any remaining defects in the finished product. Direct correspondence to\nJames N. Baron, Graduate School of Business, Stanford University, Stanford, Cali-\nfornia 94305-5015. E-mail: baron_james@gsb.stanford.edu\nAmerican Journal of Sociology\n962\nironclad bureaucracy or a familial clan) resonates with behavioral scripts\nor blueprints familiar to prospective and current employees from their\nexperiences in other settings (Baron and Kreps 1999, chap. 3). Yet strong\ncomplementarities and interdependencies among various facets of an or-\nganization’s model make changes in any particular element more difficult\nand costly.\nThese various arguments suggest that organizational models regarding\nemployment relations should be resistant to change and that efforts to\nredraw blueprints should be disruptive. Indeed, according to organiza-\ntional ecologists, efforts to alter the premises governing employment re-\nlations should be among the most disruptive types of organizational\nchange. Changes in these premises can obsolesce skills and routines that\nemployees have learned, alter bases of power and status within the or-\nganization, and violate the implicit or explicit contracts specifying the\nexpectations and entitlements of employees vis-a`-vis the firm. Therefore,\nefforts by firms to implement change along these dimensions should in-\ncrease discord and employee turnover. For instance, consider recent efforts\nby health care organizations to implement performance evaluation and\nreward systems for physicians based on patient volume. These changes\nhave proved enormously contentious and sparked unionization efforts and\nrancor within the profession, precisely because they promote behaviors\nand values that conflict with most physicians’ basic premises about their\nrole (Greenhouse 1999).\nYet, the destabilizing effects of fundamental organizational changes\nhave been assumed more than tested in organizational research. Numerous\nstudies have documented that some type of organizational change (in\nstrategy, top leadership, etc.) has deleterious consequences for organiza-\ntional performance or survival (for reviews, see Barnett and Carroll [1995]\nand Carroll and Hannan [2000]), which are often attributed to the internal\ndisruption, rancor, and turnover of personnel wrought by changes in val-\nues, routines, working relationships, and requisite skills. In this article,\nwe examine empirically whether changes to the organizational model\nembraced by the founder(s) have disruptive effects, which we operation-\nalize by focusing on labor force turnover and organizational performance.\nTurnover is particularly disruptive in the setting we examine—high-tech\nstart-ups in Silicon Valley—for at least two reasons: the acute shortage\nof scientific, technical, and engineering talent facing these organizations;\nand the fact that, for many technology start-ups, employee turnover risks\nlosing the firm’s most precious asset, its human capital.\nThese analyses speak to several important issues for organizational\nscholarship. First, they explore the validity and utility of the notion that\nculturally based scripts, templates, or blueprints are imprinted on organ-\nizations at their founding. In prior research, we have documented the\nLabor Pains\n963\nexistence of distinct organizational blueprints or models—different sets\nof premises governing the employment relation—among the founders of\nhigh-technology start-ups in Silicon Valley. We have demonstrated that\nthese blueprints shaped various aspects of organizational evolution, in-\ncluding bureaucratization and administrative intensity, the development\nof the HR function, and even the odds of replacing the founder with a\nnew chief executive officer (CEO) and of going public (Baron, Burton,\nand Hannan 1996, 1999; Baron, Hannan, and Burton 1999a, 1999b; Han-\nnan, Burton, and Baron 1996; Burton 1995). If these blueprints represent\npart of the “hard wiring” of an enterprise and shape the expectations that\nemployees and firms have of one another, then changing the blueprint\nshould have demonstrable consequences, including heightened turnover.\nSecond, our analyses address the general claim that fundamental change\ndestabilizes organizations. Third, labor force turnover is, of course, an\ninherently important organizational outcome, which has received consid-\nerable attention from social scientists (for reviews, see Price [1977] and\nMobley [1982]). Whatever its relation to performance, turnover surely\naffects organizational life (Staw 1980; Pfeffer 1983). Two otherwise iden-\ntical organizations with persistent differences in turnover will evolve very\ndifferent tenure distributions, with implications for stability and change\nin organizational culture (Carroll and Harrison 1998). Finally, we believe\nthe models and methods we employ might prove useful to researchers\ninterested in depicting organizational founding conditions and assessing\ntheir enduring effects.\nWe begin by describing the sample, the organizational setting, and our\ntypology of employment models. We then formulate and test predictions\nrelating labor force turnover to changes in the employment blueprint. We\nassess whether the turnover wrought by changing the employment blue-\nprint is disruptive for organizations in two ways: (1) by specifying and\ntesting hypotheses concerning how that turnover is patterned (i.e., who\nis most likely to depart); and (2) by analyzing the effects of labor force\nturnover on organizational performance (revenue growth). We test these\npredictions with pooled cross-section time-series data describing annual\nturnover rates and various organizational change events for more than\n100 organizations between 1991 and 1995.\nTHE STANFORD PROJECT ON EMERGING COMPANIES (SPEC)\nA panel study of young, high-technology firms in California’s Silicon\nValley, SPEC examines the evolution of employment practices, organi-\nzational designs, and business strategies. The SPEC project seeks to un-\nderstand how human resource systems get established. The focus on firms\nAmerican Journal of Sociology\n964\nin a single region and sector of economic activity holds constant key labor\nmarket and environmental conditions, as well as some of the institutional\ninfluences asserted to shape labor force turnover. Within the Silicon Valley\nregion, we sought industries containing sufficient numbers of comparable\nfirms to allow quantitative comparisons; accordingly, we concentrated on\nfirms engaged in computer hardware and\/or software, telecommunications\n(including networking equipment), medical and biological technologies,\nand semiconductors. We assumed organizations must reach a minimum\nsize before needing formal systems or practices; accordingly, we required\nthat firms in our study have at least 10 employees when sampled.2 We\nalso wanted to understand how founding conditions and early decisions\naffect subsequent organizational evolution, which necessitates information\nabout the earliest days of the organization. We assumed individuals could\nonly reliably recall fairly recent information; consequently, we limited the\nsample to firms no more than 10 years old when first visited in 1994–95\n(the typical firm was six years old).3\nDATA COLLECTION\nSurvey, interview, and archival methods were used to gather information\non each firm (see Burton 1995). Trained MBA and doctoral students con-\nducted semistructured interviews with the current CEO. The CEO was\n2 In 1994, we identified 676 technology firms in Silicon Valley founded within these\nindustries during the previous ten years and having more than 10 employees, according\nto two commercial databases on Silicon Valley technology companies: Rich’s Everyday\nSales Prospecting Guide (1994); and the Technology Resource Guide to Greater Silicon\nValley (1993\/4), published by CorpTech. From that group, 250 firms were selected\naccording to a stratified sampling plan described in Baron, Burton, and Hannan (1996,\nfig. 1). Of the 250 firms to whom we wrote (some of which had gone out of business,\nleft the area, or been acquired by the time we contacted them), 109 agreed to participate.\nUtilizing the same sampling frame, we contacted 94 additional companies in 1995 (of\n168 that were added to the 1995 edition of the CorpTech directory); 42 agreed to be\nstudied. Finally, we supplemented the sample by contacting 32 very young firms (not\nlisted in CorpTech), which we identified by tracking the Silicon Valley business press;\n22 of these firms participated. We further enlarged the sample in 1997–98 by soliciting\nparticipation from very young firms, including enterprises in the newly emerging In-\nternet sector. However, we were only able to obtain turnover data for several of these\nfirms, whose responses conceivably reflect a different time period, labor market, and\nbusiness environment than the rest of the firms in our sample confronted. Consequently,\nwe did not include those several firms in the analyses reported here.\n3 About 10% of firms proved to be more than 10 years old when we first visited them.\nIn some cases, for example, our interviews revealed that the inception of the organi-\nzation occurred somewhat earlier than the date of legal incorporation used in con-\nstructing our sampling plan. Even employing the most liberal definition of “founding,”\nhowever, only three firms in the sample analyzed here had existed for more than 12\nyears when we first visited them.\nLabor Pains\n965\nasked to identify the founder (or member of the founding team) best\nequipped to provide information regarding the firm’s origins; and the best\ninformant regarding human resources (HR) practices in the organization.\nWe followed up with these informants about company history and HR\n(respectively) and asked them to return completed surveys to us prior to\nbeing interviewed. The company history survey solicited details about the\nfirm’s founding and subsequent milestones. The HR survey sought in-\nformation about workforce demographics and a variety of employment\npolicies and practices. Information from the surveys, when available, was\nused to guide interviews with informants in each company.\nFOUNDERS’ ORGANIZATIONAL MODELS\nAs noted above, recent neoinstitutional work invokes the notion of cul-\nturally based logics, blueprints, scripts, or conceptions of control. Yet\nresearchers have seldom tried to operationalize such blueprints directly,\ntending instead to infer their existence from other sources of information.\nTesting the proposition that altering founders’ initial blueprints for or-\nganizing and for structuring employment relations is disruptive demands\na method for measuring those blueprints.\nIn designing the study, we knew from the extant literature that con-\nceptions of employment relationships could vary along numerous dimen-\nsions, and we were unsure a priori which dimension(s) would be most\nrelevant in our setting. Accordingly, we used open-ended interviews to\ngather information. We asked each founder whether he or she had “an\norganizational model or blueprint in mind when (you) founded the com-\npany.” (The CEO was asked a parallel question about the period corre-\nsponding to the date of the interview.) We inductively analyzed transcripts\nof interviews with founders and CEOs. Those analyses indicated that\ninterviewee’s images regarding how work and employment should be\norganized varied along three main dimensions—attachment, coordination\/\ncontrol, and selection—each characterized by three or four fairly distinct\noptions or approaches from which organizational architects seemed to be\nselecting. (For descriptions of these different response categories and il-\nlustrative quotes from interview transcripts, see Burton [1999].) Based on\nthe interview transcripts, members of the research team coded or classified\nresponses of each founder and each CEO on these three dimensions, unless\nmissing data precluded this.4 In previous work, we have shown that these\n4 Two senior researchers on the project independently coded the three dimensions for\nall firms, based on transcripts of interviews with founders and with CEOs. Many\nrespondents indicated that more than one option for a dimension was relevant to their\nconception of the employment model; for instance, almost all regarded compensation\nAmerican Journal of Sociology\n966\nthree dimensions cohere and can be used to characterize the implicit\norganizational model or blueprint of the founder and of the CEO at the\ntime our team first visited each firm (for an overview and additional\ndetails, see Burton [1995] and Baron and Kreps [1999], chap. 19). Here\nwe briefly summarize the approach.\nAttachment.—Founders articulated three different bases of employee\nattachment, which we label love, work, and money. Some founders en-\nvisioned creating a strong family-like feeling and an intense emotional\nbond with the workforce that would inspire superior effort and increase\nretention of highly sought employees, thereby avoiding the frequent mo-\nbility of key technical personnel that plagues Silicon Valley start-ups.\nWhat binds the employee to the firm in this model is a sense of personal\nbelonging and identification with the company—in a sense, love. Many\nSPEC firms pursue cutting-edge technology, and the primary motivator\nfor their employees is the desire to work at the technological frontier.\nRecognizing this, many founders anticipated providing opportunities for\ninteresting and challenging work as the basis for attracting, motivating,\nand (perhaps) retaining employees.5 Here, employees were not expected\nto be loyal to the organization, the supervisor, or even coworkers per se,\nbut instead to a project. Finally, other founders’ responses indicated that\nthey regarded the employment relationship as a simple exchange of labor\nfor money.\nBasis of coordination and control.—A second dimension concerned the\nprincipal means of coordinating and controlling work. The most common\nconception involved extensive reliance on informal control through peers\nas relevant to retention, even if they regarded, say, exciting work as more important.\nHence, the coding task sought to select the option on each dimension that the re-\nspondent indicated as dominant in his\/her thinking about the dimension. Some re-\nspondents were unable or unwilling to give priority to one option. Therefore, it was\nimportant that we use explicit default rules for responses that did not fall neatly into\none of our categories. We used the following defaults: skills for selection, work for\nattachment, and peer-based control for coordination\/control. In effect, this makes the\nengineering model the default (see below). We interpreted the default rules as follows:\nunless the respondent clearly indicated that some other option was more important\nthan the default, we coded the response as the default category. After independently\ncoding each firm on all three dimensions for the founder and CEO responses, the two\nresearchers compared their two sets of codings. In the large majority of cases, they\nwere the same. When they were not, we scrutinized the transcripts looking for am-\nbiguities that might have led the two coders to disagree. In most cases, we decided\nthat the difference was due to some opacity in the response and therefore settled on\nthe default code.\n5 A few founders also spoke about providing unrivaled “opportunity” for prospective\nemployees. Although opportunity is potentially a conceptually distinct basis of attach-\nment, it was closely aligned with “challenging work” and there were very few such\ncases in our sample. Hence, we treated these cases as instances of attachment based\non “work.”\nLabor Pains\n967\nor organizational culture. Other founders intended to rely on professional\ncontrol, even if they did not explicitly use this terminology. They took it\nfor granted that workers were committed to excellence in their work and\ncould perform at high levels because they had been professionally so-\ncialized to do so. (Not surprisingly, this approach tends to be accompanied\nby an emphasis on hiring high-potential individuals from elite institu-\ntions.) Professional control emphasizes autonomy and independence rather\nthan enculturation. A third group of founders espoused a more traditional\nview of control as embedded in formal procedures and systems. Finally,\nsome founders indicated that they planned to control and coordinate work\npersonally, by direct oversight, reminiscent of Edwards’s (1979) descrip-\ntion of the simple-control paradigm that characterized small capitalist\nfirms in the late nineteenth and early twentieth century.\nSelection.—The third dimension concerns the primary basis for se-\nlecting employees. Some founders’ responses suggested that they con-\nceived of the firm as a bundle of tasks and sought employees to carry out\nparticular tasks effectively. Time and money tended to be the paramount\nconcerns here, so the focus was on selecting employees who could be\nbrought on board and up to speed as quickly and cheaply as possible. In\nthese cases, founders envisioned selecting employees having the skills and\nexperience needed to accomplish some immediate task(s). Other founders\nfocused less on immediate and well-defined tasks than on a series of\nprojects (often not yet even envisioned) through which employees would\nmove over time. Accordingly, they focused on long-term potential. Finally,\nsome founders focused primarily on values and cultural fit, emphasizing\nhow a prospective hire would connect with others in the organization.\nRelationships among the three dimensions. These blueprints can be\nclassified into three types of attachment and selection and four types of\ncontrol, yielding possible combinations. However, the3# 3# 4p 36\nobservations cluster into a few cells (see Burton 2001), which we will refer\nto as five basic model types for employment relations, summarized in\ntable 1.\nThe engineering model involves attachment through challenging work,\npeer group control, and selection based on specific task abilities. This\nmodel parallels standard descriptions of the default culture among high-\ntech Silicon Valley start-ups (e.g., Saxenian 1994), and it is the modal\nemployment blueprint among founders of SPEC firms. The star model\nrefers to attachment based on challenging work, reliance on autonomy\nand professional control, and selecting elite personnel based on long-term\npotential. The commitment model entails reliance on emotional-familial\nattachments of employees to the organization, selection based on cultural\nfit, and peer group control. The bureaucracy model involves attachment\nbased on challenging work and\/or opportunities for development, selecting\nAmerican Journal of Sociology\n968\nTABLE 1\nFive Basic Employment Model Types\nBasic Model Type\nDimensions\nAttachment Selection Coordination\/Control\nStar . . . . . . . . . . . . . . . . . Work Potential Professional\nEngineering . . . . . . . . Work Skills Peer\/cultural\nCommitment . . . . . . . Love Fit Peer\/cultural\nBureaucracy . . . . . . . . Work Skills Formal\nAutocracy . . . . . . . . . . Money Skills Direct\nindividuals based on their qualifications for a particular role, and for-\nmalized control (for further discussion of this model type, see Baron,\nHannan, and Burton [1999b], appendix). Finally, the autocracy model\nrefers to employment premised on monetary motivations, control and\ncoordination through close personal oversight, and selection of employees\nto perform pre-specified tasks.\nWe refer to these five blueprints as the basic model types. We do so\nnot only because they are the most prevalent combinations observed\nwithin this sample, but because they also display several other important\nproperties. First, each of these blueprints exhibits a high degree of co-\nherence or internal consistency among the three dimensions, suggesting\nthat they complement one another to form an overarching system. For\ninstance, consider a founder intending to emphasize control and coordi-\nnation through organizational norms and seeking emotional bonds to the\ncompany itself (rather than attachment based on the specific work as-\nsignment), perhaps in order to create overarching goals among differen-\ntiated subunits. Here there would be a clear technical complementarity\nwith selection mechanisms that screen for values and cultural fit, as is\nfound under the commitment model. Second, these types display cultural\nresonance and salience within this population and its setting. When we\nhave described these archetypes to Silicon Valley employers, employees,\nand other knowledgeable parties, they understand the distinctions and\nfrequently begin classifying organizations with which they have experi-\nence in these terms.\nFurthermore, the five basic types reflect different logics of organizing\nwithin other institutions that actors in this organizational field have ex-\nperienced; indeed, the labels for the types are fairly evocative of the char-\nacteristics. For instance, the star model—particularly prevalent among\nfirms developing medical technology or pursuing research6—resonates\n6 Among SPEC firms in the medical technology or research sectors (including bio-\ntechnology), 42.3% were founded along star model lines, compared to only 1.6% of\nfirms in other industry sectors.\nLabor Pains\n969\nclosely with the model that underlies academic science, from which many\nof the founders and key scientific personnel sought for these start-ups are\nrecruited. The commitment model draws instead on familial imagery and\nthe revered legend of Hewlett–Packard within Silicon Valley. The engi-\nneering model resonates with the socialization that engineers receive in\nprofessional school and suits the Valley’s highly mobile labor force. The\nbureaucratic model is readily familiar from encounters with bureaucracies\nin numerous contexts. Finally, the austere, no-nonsense autocracy model\ncommunicates a powerful and consistent message that employees certainly\nhave encountered elsewhere before: “You work [for me, the boss], you get\npaid [by me]—nothing more, nothing less.” We make no claim that these\nbasic model types are generic, or even generalizable outside this popu-\nlation of organizations. Rather, we simply claim that these basic model\ntypes capture blueprints for organizing that have a systemic quality and\ndisplay cultural resonance within this setting.\nA significant number of companies differed from one (and only one) of\nthe basic model types on only one dimension. We will refer to these as\nnear-model types. For instance, about 3% of founders envisioned basing\nattachment on love, selecting based on fit, and utilizing direct control.\nThis combination represents a near-commitment blueprint: it differs from\nthe basic commitment model firm in terms of control (only), and differs\nsubstantially (i.e., on two or more dimensions) from the other four model\ntypes. Such an organization suggests an autocratic cult variant on the\ncommitment model. Finally, we will use the terms aberrant or nontype\nto refer to all other blueprints—firms in which the blueprint either (1)\ndiffers from two or more basic model types on one dimension (and does\nnot fall into any of the basic types) or (2) differs along two or more\ndimensions from every basic model type.\nMethodological concerns.—This effort to characterize the organiza-\ntional blueprints of entrepreneurs raises a host of conceptual and meth-\nodological issues (see Baron, Hannan, and Burton 1999b). Here we touch\nbriefly on several concerns. First, our coding effort and our conceptual-\nization of organizational blueprints sought to measure the premises of\nfounders and CEOs. Blueprints might or might not bear a relationship\nto organizational reality (for some evidence that they do in this sample,\nsee Baron et al. 1996). In classifying firms on the three dimensions, we\ntook pains to rely not on what respondents claimed they were actually\ndoing, but instead on what they recounted about their underlying organ-\nizational model or conception.\nSecond, founders might have selectively reconstructed the past. Al-\nthough we cannot definitively rule out retrospection bias, some previous\nresults provide reassurance on this score. For instance, Baron et al. (1999a)\nreported that the founder’s initial organizational blueprint is strongly and\nAmerican Journal of Sociology\n970\nsystematically related to an objective, independent measure of present-\nday managerial and administrative intensity—suggesting that the bur-\neaucratization process was path dependent—whereas the current CEO’s\nblueprint was unrelated to present-day administrative intensity. If re-\nspondents were selectively tailoring their stories to match or rationalize\nreality, then the responses of present-day CEOs should do a better job of\npredicting present-day organizational arrangements than do founders’\nrecollection of their organization-building premises at the start-up phase.\nFurthermore, some founders acknowledged during interviews that their\noriginal models were naı¨ve or ill conceived. Their ability and willingness\nto be self-critical suggests that they were not simply reporting ex post a\nself-serving conception tailored to actual developments. On the other\nhand, given the retrospective nature of founders’ accounts and other lim-\nitations of the available data, our findings and inferences regarding the\neffect of changing organizational models should be treated as suggestive,\nnot definitive.\nThird, we cannot tell for sure when employment models changed (if\nthey did), and hence causality could run in the other direction: firms\nexperiencing higher turnover might change their employment models in\nan effort to stem that turnover. Though we cannot rule out this competing\naccount, several important pieces of evidence argue against it, as we\ndiscuss below.\nAs noted above, previous research on the SPEC firms has documented\nthat founders’ initial organizational blueprints shaped not only the evo-\nlution of human resource practices and the HR function, but numerous\nother facets of organizational evolution as well. The fact that founders’\nmodels predict how firms develop over time provides some evidence of\nthe validity of the typology of basic employment models. We can also\nassess whether the taxonomy captures real and meaningful distinctions\nin founders’ organization-building templates by examining whether model\nchange disrupts the enterprise, as manifested in increased turnover.\nHYPOTHESES\nEffects of Organizational Model and Model Change on Turnover\nIt is important to distinguish between two potentially competing effects\nof changing the organizational model on turnover. The first concerns what\nBarnett and Carroll (1995) call the process effects of change: the disruptive\nand destabilizing effects of altering deeply embedded organizational prem-\nises. If our basic model types in fact capture distinctive systems or recipes\nfor organizing, then efforts to change the founder’s initial employment\nmodel should be disruptive. We therefore predict\nLabor Pains\n971\nHypothesis 1.—The more that an organization’s blueprint or model\nhas changed from what the founder initially envisioned, the higher the\nrate of employee turnover.7\nBarnett and Carroll argue, however, that analysts can gain more precise\nand informative results by also taking account of a second set of effects\nassociated with organizational change—which they term content ef-\nfects—which reflect the potential improvement in consistency (and, pre-\nsumably, a concomitant decline in labor force turnover) from abandoning\nan initial model that was incoherent and relatively unfamiliar. (For re-\nviews of the evidence on these two types of effects of organizational\nchange, see Barnett and Carroll [1995] and Carroll and Hannan [2000],\nchap. 16). In our context, this implies that the potentially disruptive effects\nof model change might depend on an interaction between origins (the\nparticular blueprint initially espoused by the founder) and destinations\n(the new blueprint). Altering deeply embedded organizational premises is\nlikely to be most disruptive for firms that began with a coherent blueprint\n(i.e., one of the five basic model types). Changing the model should be\nless disruptive for firms that began with an aberrant blueprint. In par-\nticular, for moves from a nontype blueprint to one of the five basic model\ntypes, the disruptive effects of change might be more than offset by en-\nhanced consistency of premises governing employment relations, serving\nto dampen turnover. Conversely, moves from one aberrant model to an-\nother presumably engender little or no improvement in consistency to\noffset the disruptive effects of change, leading us to expect that such\ntransitions provoke particularly high turnover.\nHypothesis 1a.—Changing the employment model increases turnover\nmost in organizations that began with one of the basic employment models\nand least in organizations that began with an aberrant (nontype) blueprint.\nHypothesis 1b.—The effect of model change on turnover is larger\n(smaller) for transitions that increase (decrease) a firm’s distance from one\nof the basic employment models.\nSome transitions among basic model types are likely to be more dis-\nruptive than others. We expect that abandoning the commitment and star\nmodels is particularly destabilizing, especially when the transition is to a\nbureaucratic model. Firms founded along commitment or star lines are\nmore likely to bring in a nonfounder CEO and to do so sooner (Hannan\net al. 1996). Hannan et al. speculate that these two models most strongly\nimplicate the founders in implicit contracts with early employees: in star\nfirms, star employees are often recruited to the enterprise by a prior per-\nsonal connection to the founder(s); in commitment firms, the founder\n7 All hypotheses assume that all other relevant determinants of turnover are held\nconstant (i.e., ceteris paribus assumptions apply).\nAmerican Journal of Sociology\n972\nrepresents the central figure in the clan. In contrast, the engineering model\nseems to represent the Silicon Valley default (Saxenian 1994) and to have\nan affinity with bureaucratic culture (Shenhav 1995), suggesting that the\nengineering blueprint might be easier both to reach and to abandon (es-\npecially if it is being abandoned for bureaucracy) than other models.\nAccordingly, we predict:\nHypothesis 1c.—Abandoning the commitment or star model is more\ndisruptive than abandoning the engineering model, especially for transi-\ntions to the bureaucratic model.\nAmong companies that retained their employment blueprint over time,\nit seems reasonable to expect turnover to be particularly low in firms that\nadhered to a commitment model. Conversely, as firms age, grow, and\nbecome more complex, retaining star or autocracy models might prove\nincreasingly contentious—in the former case, due to tension between the\nearly stars and the rest of the organization, with whom they are increas-\ningly interdependent; in the latter case, because autocratic control appears\nincreasingly capricious and untenable as enterprises become larger, more\ncomplex, and more differentiated. Hence, we would expect to see higher\nturnover among firms that have retained a star or autocracy model\nthroughout their existence.\nWe do not advance predictions about the main effect of founder’s em-\nployment model on turnover. Gross differences in turnover as a function\nof founder’s employment model might reflect the fact that some blueprints\nare inherently less stable (i.e., less likely to persist over time) than others.\nAs we shall see below, turnover rates differ significantly among founders’\nemployment models, even after we control for an extensive array of or-\nganizational and environmental characteristics. However, the pattern is\nsubtle and, in some ways, counterintuitive; it reflects differences in the\npersistence of the various model types as well as their underlying turnover\npropensities. Therefore, rather than offering specific hypotheses, we un-\nravel the issue empirically below. To capture both the process and content\neffects of organizational change, we examine the effects of changing the\norganizational blueprint per se, supplemented with more fine-grained\nanalyses of how turnover varies as a function of stability and change in\nfounder’s model (i.e., taking into account both the origin and destination\nblueprint).\nTHE DISRUPTIVE NATURE OF TURNOVER\nEcological perspectives imply that the turnover occasioned by altering\nthe premises on which an organization was built should be disruptive. If\nthis disruption reflects changes in skills, values, working relationships,\nLabor Pains\n973\nand routines associated with a change in the organizational blueprint,\nthere is a clear implication for the observed pattern of turnover:\nHypothesis 2.—The turnover associated with change in an organi-\nzation’s employment model is concentrated disproportionately among\nhigh-tenure employees.\nNote that there is a plausible alternative hypothesis.8 A distinctive and\ncoherent blueprint helps organizations create and sustain a reputation in\nthe labor market (Baron and Kreps 1999, chap. 3). Employees who con-\nsider joining a firm that has a history of espousing a particular model are\nlikely to have a good sense of what they will encounter. If that model\nsubsequently changes, however, it presumably takes some time before this\nchange gets recognized widely within the labor market, especially if the\nnew model lacks consistency and distinctiveness. Hence, employees who\njoin a firm following a change in its model might be more likely to be\nmismatched to the organization and therefore to depart promptly. Ac-\ncording to this argument, changing the model prompts higher turnover\namong recently hired personnel who come to conclude that they do not\nfit the organization. If this story has merit, then we would expect that\nturnover in firms that have changed their employment models gets con-\ncentrated among a mismatched new guard, rather than among a disen-\nchanted old guard.\nAnother implication of the ecological perspective is that employee turn-\nover should adversely affect organizational performance (at least in the\nshort run), particularly in young, knowledge-intensive, technology com-\npanies. To be sure, turnover can have beneficial organizational conse-\nquences, including enhanced innovation and adaptability (Pfeffer 1983).\nAnd numerous observers of Silicon Valley (e.g., Saxenian 1994) have em-\nphasized the beneficial effects of abundant labor mobility in fostering\ninnovation and entrepreneurial opportunity. But the alleged benefits of\nturnover usually pertain to the industry or regional level, rather than to\nindividual firms. Moreover, the assertion that turnover on balance proves\nbeneficial seems somewhat at odds with the lengths to which many Silicon\nValley start-up firms go in trying to bind employees (e.g., stock options,\nnoncompete agreements, extensive benefits) and the frequency with which\nwe heard senior executives in these companies fret about turnover as “a\nproblem.” Accordingly, we also predict that:\nHypothesis 3.—Employee turnover has a negative effect on organi-\nzational performance.\n8 We are indebted to Craig Olson for stimulating our thinking on this point.\nAmerican Journal of Sociology\n974\nOTHER DETERMINANTS OF TURNOVER\nOther factors must be controlled in assessing the net effect of change in\norganizational blueprints on turnover. In particular, CEO succession\nprompts change in start-up companies. Organizational researchers have\ndemonstrated that changes in top management regimes can have powerful\neffects on employee turnover (Friedman and Saul 1991; Kesner and Dalton\n1994; Virany, Tushman, and Romanelli 1992), although past studies have\nfocused almost exclusively on turnover among top management teams\nwithin large corporations. CEO succession likely has broader effects on\nemployee turnover within the companies that we examine, in which the\nCEO (and particularly the initial founder–CEO) typically is the architect\nof strategy, the chief spokesperson of the organization’s culture, and often\nthe catalyst for recruiting key scientific, technical, marketing, and sales\npersonnel into the venture in the first place. Hence, the departure of the\norganization’s leader likely disrupts goals, values, routines, social rela-\ntionships, and implicit contracts regarding the nature of employment. Not\nsurprisingly, organizational models change more frequently among SPEC\ncompanies that have changed CEOs,9 so it is important to ensure that\nany observed effects of model change do not simply reflect CEO change.\nAlthough these relatively small, young, high-technology companies\nmight be more dependent on their founders and leaders than other types\nof organizations, there are ways in which founders can institutionalize\ntheir conception of the organization’s employment model so that it per-\nsists, even after they depart. In particular, we expect that the longer an\norganization’s initial leadership regime has been in place, the lower the\nsubsequent rate of turnover. This prediction is relatively straightforward\nfor companies still led by the initial regime: the longer the regime has\nbeen in place, the more likely it is to have institutionalized a distinctive\norganizational blueprint and screened out employees who do not fit that\nblueprint. But the duration of the initial regime might influence turnover\neven after that regime has ended. This is because longer-lived founding\nregimes will have been better able to establish and institutionalize a co-\nherent organizational model and supporting culture that enables the en-\nterprise to attract and retain employees who suit that setting.10\nOur analyses hold constant the cumulative number of CEOs a firm has\n9 Among firms in which a founder was still CEO, 64.3% were coded as not having\nchanged on any of the three dimensions of the employment blueprint; among firms\nwhose CEO in 1994–95 was not a founder, the corresponding figure was 23.6%.\n10 In supplementary analyses, we examined whether any effects of CEO succession on\nturnover depend on the tenure of the outgoing CEO and\/or characteristics of the\nincoming CEO, such as whether he\/she was promoted from within and, if so, was a\nmember of the founding team. However, we did not detect any systematic interaction\neffects.\nLabor Pains\n975\nhad at a given point in time. One might imagine that leadership changes\nhave cumulative disruptive effects, so that turnover increases with the\nnumber of CEOs an organization has had over a given interval of time,\ncontrolling for when the last succession event occurred. Alternatively,\norganizations might become habituated to executive succession, so that\nthe first regime change produces considerably more disruption than do\nsubsequent ones.11 Given these competing predictions, we do not offer a\nspecific directional hypothesis.\nWe control for two key milestone events: procuring venture capital and\nmaking an initial public offering (IPO) of stock. These events might have\nopposing effects on employee turnover, insofar as they generally involve\nan infusion of resources into the organization while also bringing about\nsignificant changes in organizational arrangements, routines, and (in many\ncases) leadership. In supplementary analyses, we also include controls for\nindustry, occupational composition, and the gender mix in the firm’s first\nyear of operations to capture variations in the mix of jobs and workers\nacross SPEC companies.\nOrganizational size, growth, and age also may influence labor force\nturnover. Turnover is likely to be higher in rapidly growing firms for\nvarious reasons: (1) rapid growth often strains an organization and its\nmembers; (2) organizations that must scale up their workforce rapidly are\nmore likely to make hiring errors, resulting in short-lived appointments\nthat are reflected in high turnover; and (3) if organizational growth is\ncorrelated with economic growth in Silicon Valley generally (e.g., semi-\nconductor firms are expanding because the cyclical semiconductor in-\ndustry has rebounded), firms might face more labor market competition\nduring periods of rapid growth.\nAs organizations mature, they systematize employment relations and\npresumably become better informed about the needs and desires of their\nemployees. Consequently, it seems reasonable to expect that turnover rates\nwill decline with organizational age. Furthermore, older firms seem less\nlikely going forward to face the need for major changes in employment\nrelationships and employment levels (of the sort that would produce high\nturnover) than firms that are still in their infancy. Nonetheless, we predict\nthat turnover actually increases with organizational age in our sample.\nFirst, growing routinization and bureaucratization as firms age might\n11 The same negative relationship between cumulative number of CEOs and turnover\ncould obtain if early generations of leaders confront more fundamental sources of\nuncertainty that could influence strategy or if the actions of early leaders constrain\nthe options of subsequent leaders. For instance, it seems easier to imagine the first\nCEO of a firm needing to completely reformulate the firm’s strategy or shrink the\nfirm’s workforce by 50% than it is to envision the fifth CEO of a firm facing those\nsame challenges.\nAmerican Journal of Sociology\n976\nimpede adaptation to rapidly changing environments (as suggested by\nstories of senescence and obsolescence—see Hannan 1998) and encourage\nemployees to migrate to firms that appear better suited to current con-\nditions. Second, the relevant technical labor force has a renowned antip-\nathy to rigid bureaucracy. Moreover, it is widely believed among Silicon\nValley’s labor force that superior financial rewards and technical chal-\nlenges come from getting in on the ground floor of a new enterprise,\nsuggesting that employees might become more likely to depart as their\nfirm ages.\nDATA, MEASURES, AND METHODS\nData\nWe sent a survey to the executive designated by the CEO as having\noversight of HR (sometimes, the CEO himself or herself). The survey\nasked the respondent to provide the firm’s annual turnover rate for 1991,\n1992, 1993, and 1994. (For firms that were visited in summer or fall of\n1994, the survey asked about turnover annualized for the first six months\nof 1994, rather than the entire year.) A few firms visited in 1995 provided\nturnover data for the first half of 1995. The survey also requested infor-\nmation on various facets of the company’s HR system and attributes of\nits workforce, including the current tenure distribution and occupational\nand gender composition at the end of the first year of operations and at\nthe time of the survey. Of the 173 firms in the study, 101 (59%) returned\nsurveys with usable turnover data. We found no evidence of bias asso-\nciated with the pattern of missing data resulting from some firms not\nreturning the HR survey (Baron et al. 1999b, appendix).\nBecause some independent variables vary over time, we constructed\nmultiple spells for each firm corresponding to the reporting periods for\nwhich it provided turnover information (calendar years, except for in-\nstances in which firms reported turnover for the first half of the year in\nwhich they were interviewed). We use pooled cross-section time-series\ntechniques to analyze the data (see below). The data set we analyze con-\ntains 327 spells for the 101 firms that provided usable turnover data on\nthe HR survey. Of the 101 companies, 8 provided usable information for\none turnover spell, 18 for two spells, 17 for three spells, and 58 for four\nspells.\nMeasures\nOur dependent variable is the square root of the firm’s annual turnover\nrate. We use the square root transformation to normalize what is otherwise\nLabor Pains\n977\na skewed distribution (for a variable that can take on zero values) and\nbecause we suspect that most factors that increase turnover (e.g., age,\nsize) do so at a diminishing rate.12\nWe measure leadership change with an indicator variable denoting\nwhether a CEO was appointed or left the firm during the spell.13 We also\ninclude a measure of the firm’s cumulative number of CEOs as of the\nstart of a spell.14 We measure the tenure of the firm’s first leadership\nregime as the tenure of the company’s first CEO in the firm, as of the\nstart of the spell.15 (This is a time-varying covariate because it increments\nin value over time for firms that have only had one CEO.) By definition,\nthis measure is missing for firms that had yet to designate a CEO as of\nthe start of a spell. (Some Silicon Valley start-ups do not designate a CEO\n12 The HR survey requested information on the “annual turnover rate” for specific\ncalendar years. (It was not feasible to gather data on turnover rates by occupation\nwithin these companies.) We were concerned that respondents might have varied in\nhow they defined this rate. We followed up by telephone with a sample of respondents,\nasking how they had defined the turnover rate in filling out the survey. Most respon-\ndents apparently defined turnover as the fraction of employees present at the beginning\nof the period who departed by the end of the period, and a number told us that this\nis how turnover is generally construed by Silicon Valley companies. Variations in how\nrespondents defined turnover should add noise to the data, reducing the likelihood of\nuncovering significant statistical relationships. Moreover, in supplementary analyses,\nwe estimated the effects of time-varying covariates on turnover in fixed-effects spec-\nifications that control for stable characteristics of each firm (including how it defined\nturnover). The results were largely unchanged, further suggesting that our findings\nare unlikely to reflect differences in how respondents defined the annual turnover rate.\n13 Data on executive succession were obtained from a variety of sources, including\ninterviews with firm informants, business press articles, annual reports, other public\ndocuments (e.g., 10K filings), and company web sites. When our data sources indicated\nthat one chief executive departed in a given month and another person began in that\nrole during the following month, we treated this as if there had been no interruption\nbetween the two. Due to imprecision in dating the exact founding date of each company,\nwe treated a CEO as having served since the inception of the firm if, according to our\ndata sources, his\/her tenure as CEO commenced within three months of the company’s\nfounding. (Otherwise, the data record for that company would indicate that it did not\nhave a CEO at the beginning of the spell in question.) In the same vein, because we\ncould not always time venture capital financings or transitions to public status precisely,\nwe treated a company as having had venture capital or being a publicly traded entity\nas of the start of a given spell if our records indicated that it had received venture\ncapital or went public by the end of the first month within that spell.\n14 The key contrast in the data was between firms being led by their first CEO vs. a\nsubsequent CEO; accordingly, we dichotomized this measure.\n15 Notice that the measure captures how long the first CEO had been in the firm, not\nhow long he or she had been CEO. This reflects our belief that it is whether the first\nCEO was part of the founding team and how much of the firm’s history he or she\nwitnessed that affects the ability to institutionalize an organizational blueprint that\nemployees will perceive as legitimate, even if the first CEO was not appointed to the\ntop job until some time after joining the company.\nAmerican Journal of Sociology\n978\nuntil this is required by investors, the exigencies of going public, and the\nlike. This was the case for about 2.5% of the firm–spells in our sample).\nConsequently, in supplementary analyses, we also created an alternative\nmeasure of the duration of the firm’s first leadership regime: first-leader\ntenure within the firm as of the start of a spell, for firms that have had\na CEO; or the organization’s age at the start of the spell, if the firm had\nnot yet appointed a CEO. We reasoned that the first leadership regime\nfor firms without a CEO involves some sort of shared power arrangement,\nin place since the firm’s inception. The findings were unchanged when\nwe utilized this alternative measure (results available upon request). To\nsimplify the exposition, we report results only from analyses of spells for\nfirms that had had one or more CEOs as of the start of the spell. This\nhas the effect of reducing slightly the number of available cases, thereby\nraising our burden in detecting significant effects.\nWe represent founders’ organizational models with binary variables\ncorresponding to the typology in table 1. Unless otherwise noted, near-\nmodel types (i.e., firms that differed along only one of the three dimensions\nfrom one and only one of the five basic types) are grouped with their\ncorresponding types. This potentially mutes some of the contrasts among\nmodel categories, but it also increases the number of cases in several\ncategories, thereby providing more statistical power for detecting system-\natic differences. We measure the magnitude of change in the organiza-\ntional model by the number of dimensions (0–3) that changed between\nthe founder’s blueprint and the blueprint coded from the responses of the\n(then-current) CEO. We also report more fine-grained analyses that allow\nthe impact of stability or change in a firm’s model to vary as a function\nof which particular model it started with and\/or migrated to.\nWe control for how long (in years) the firm had received venture capital\nfinancing and\/or been publicly traded, as of the start of each spell. We\ntransform both variables by taking the square root, because we suspect\nthat the effect of getting venture capital and\/or going public on turnover\ndeclines sharply with duration, with the major effect capturing the dif-\nference between firms that had versus had not experienced these events.\nWe capture organizational growth by controlling for employment size\n(in the square root metric) at the end of the year preceding each spell and\nat the end of the firm’s first year of operations.16 Organizational age equals\nyears since founding, as of the start of each spell. Based on information\n16 The former measure was obtained from secondary sources (corporate directories,\netc.), interpolated between intervals as necessary. Employment at the end of the first\nyear of operations was measured based on the HR survey provided by the company.\n(For firms that did not provide an HR survey, this variable was imputed statistically\nfrom the secondary-source data and other variables related to employment size.)\nLabor Pains\n979\nprovided by founders concerning the timing of various events, we defined\nthe founding date to be the earliest of three events: legal incorporation,\nhiring the first employee, and start of “normal business operations.” In\nsupplementary analyses, we also included controls for time (a linear time\ntrend or dummy variables corresponding to the calendar year to which\neach spell corresponded), but these controls were insignificant and did\nnot alter the pattern of results.\nFinally, we represent industry with two dummy variables, one denoting\nfirms engaged in manufacturing and the other denoting firms engaged in\nresearch; the omitted category represents firms in computer hardware or\nsoftware, telecommunications and networking, semiconductors, or med-\nical devices and biotechnology. (Other industry contrasts were not sig-\nnificant.) In various supplementary analyses, we also controlled for the\ndistribution of the firm’s employees in the first year across various broad\noccupational categories (e.g., scientific and engineering; administrative\nand managerial; clerical; sales) and the proportion of the work force that\nwas female. These did not alter the basic pattern of effects of change in\norganizational model on turnover; accordingly, their effects are not re-\nported here (results available on request).\nEstimation\nOur data structure is a pooled cross section and time series. The data are\nunbalanced: the number of observations varies among firms. Recent or-\nganizational research typically models such data with fixed-effect esti-\nmators, which analyze only the within-firm over-time variation. This\nchoice is unappealing in this context because some key independent var-\niables (e.g., founders’ organizational blueprints and whether the blueprint\nchanged) do not vary over time. Instead, we use robust estimators that\nanalyze both between-firm and within-firm variation. Specifically, we\nuse the method of generalized estimating equations (GEE) developed by\nLiang and Zeger (1986; also see Zeger and Liang 1986). This approach\ngeneralizes quasi-likelihood estimation to the panel context. Like quasi-\nlikelihood, GEE requires specification of only the first and second mo-\nments of the distribution of the outcome, rather than the full distribution\nas is required for maximum likelihood. Under mild regularity conditions,\nGEE estimators are consistent and asymptotically normal.\nThe setup we estimate is the following. The outcome is a firm’s turnover\nrate (square root) in a given year. For the ith firm, we have ni observations,\ny p (y , y , … , y ),i i1 i2 ini\nand the vector of outcomes can be written as\nAmerican Journal of Sociology\n980\n′( )yp y , y , … , y .l 2 m\nThe covariates vary over firms and (in some cases) over time for given\nfirms:\n′( )Xp x , x , … , x , … , x ,11 12 K1 KI\n( )x p x , x , … , x .ki ki1 ki2 kini\nIf we represent the disturbances as\n( )u p u ,u , … , u ,i i1 i2 ini\nthen we can write the structural model to be estimated as\nyp Xb\u0001 u.\nWe expect that the disturbance process will exhibit autocorrelation of\nthe usual panel type: observations for the same firm will tend to be cor-\nrelated due to permanent and gradually changing, unobserved firm prop-\nerties. However, we assume that observations are uncorrelated for dif-\nferent firms. In particular, we assume that the covariance matrix of\ndisturbances has the following form:\nA 0 . . 01 \n0 A 0 . 02\n′( )E uu pf . 0 . . . ,\n. . . . 0 \n0 . . 0 A I\nwhere fis a scale parameter,\nA p j R,i i\nand the matrix R satisfies the properties of a correlation matrix. GEE\nrequires a specification of a working correlation matrix. The implemen-\ntation we used—the XTGEE routine within version 6.0 of STATA\n(StataCorp 1999)—allows a menu of choices for the working correlation\nmatrix. We experimented with several, including the classic exchangeable\ncorrelation structure from the standard random-effects setup, as well as\nfirst- and second-order serial autocorrelation. We found that models fit\nbest when we used a completely unstructured working correlation matrix,\nin which each off-diagonal entry is unconstrained and estimated from the\ndata. That is, we used as a working correlation matrix:\nLabor Pains\n981\n1 \nr 112\nRp r r 1 ,13 23\nr r r 1 14 24 34\nr r r r 1 15 25 35 45\nwhere the rows and columns correspond to the calendar years represented\nin our data set (1991–95).\nWe conjectured that autocorrelation would decline over time and across\nwaves of panels, because the hazard of major shocks that would coun-\nteract autocorrelation in the determinants of turnover is likely to increase\nas firms grow older. Consistent with our conjecture, autocorrelation did\ndecline with the temporal distance between spells and across waves of\npanels (e.g., there was stronger autocorrelation between 1991 and 1992\nobservations than between the 1991 and 1993 panels or between the 1992\nand 1993 panels), and models permitting this error structure fit consid-\nerably better than models that impose a more constrained error structure.\nWe report robust standard errors, using the so-called sandwich estimators\ndeveloped by Huber (1967) and White (1982).\nDESCRIPTIVE STATISTICS\nTable 2 summarizes the pattern of transitions from founder to CEO mod-\nels. Among firms that we classified as having a particular model at found-\ning, the table reports the fraction that we classified as having each type\nof organizational model in 1994-95, based on our interviews with CEOs.\nRow (1) in the table reports results based on classifying the founder’s\nmodel as aberrant unless it corresponded perfectly to one of the five basic\nmodel types in table 1. Row (2) groups near-model-type firms (i.e., those\nthat differed in only one dimension from only one of the five basic types)\nwith their corresponding basic type category. The parenthesized results\nin table 2 pertain to the entire sample of SPEC firms for which we had\nthe requisite information to code the founder’s and CEO’s organizational\nmodel, whereas the results without parentheses are for the subset of firms\nproviding valid data on employee turnover (and thus used in our analyses).\nTable 2 provides descriptive background, but it is substantively infor-\nmative in several respects. The diagonal entries in table 2 reveal that the\ncommitment and bureaucratic models—which in many respects represent\npolar extremes—are the most persistent over time (i.e., have the smallest\nfraction of firms that transitioned to a different model). And, despite the\nrelatively frequent shifts in the sample toward bureaucracy, no firms\nfounded along commitment model lines made that transition. Table 2 also\nportrays the engineering model as relatively compatible with other or-\nTABLE 2\nStability and Change in Organizational Models\nFounder Model\nCEO Model\nAberrant Autocracy Commitment Star Engineering Bureaucracy N Firms\nAberrant:\n1 . . . . . . . . . . . . . . . . 60.5 (64.6) 2.6 (1.5) 2.6 (4.6) 2.6 (1.5) 13.2 (13.8) 18.4 (13.8) 38 (65)\n2 . . . . . . . . . . . . . . . . 50.0 (54.2) 3.3 (2.1) 3.3 (4.2) .0 (.0) 16.7 (18.8) 26.7 (20.8) 30 (48)\nAutocracy:\n1 . . . . . . . . . . . . . . . . 50.0 (50.0) 50.0 (50.0) .0 (.0) .0 (.0) .0 (.0) .0 (.0) 4 (6)\n2 . . . . . . . . . . . . . . . . 33.3 (40.0) 33.3 (40.0) 16.7 (10.0) .0 (.0) .0 (.0) 16.7 (10.0) 6 (10)\nCommitment:\n1 . . . . . . . . . . . . . . . . 28.6 (36.4) .0 (.0) 57.1 (54.5) .0 (.0) 14.3 (9.1) .0 (.0) 7 (11)\n2 . . . . . . . . . . . . . . . . 16.7 (9.5) 8.3 (9.5) 58.3 (71.4) 8.3 (4.8) 8.3 (4.8) .0 (.0) 12 (21)\nStar:\n1 . . . . . . . . . . . . . . . . 37.5 (38.5) .0 (.0) .0 (.0) 37.5 (46.2) 12.5 (7.7) 12.5 (7.7) 8 (13)\n2 . . . . . . . . . . . . . . . . 33.3 (33.3) .0 (.0) .0 (.0) 44.4 (53.3) 11.1 (6.7) 11.1 (6.7) 9 (15)\nEngineering:\n1 . . . . . . . . . . . . . . . . 25.0 (22.0) .0 (2.0) .0 (.0) .0 (.0) 43.8 (52.0) 31.3 (24.0) 32 (50)\n2 . . . . . . . . . . . . . . . . 25.0 (20.0) .0 (2.0) .0 (2.0) .0 (.0) 43.8 (52.0) 31.3 (24.0) 32 (50)\nBureaucracy:\n1 . . . . . . . . . . . . . . . . 20.0 (12.5) .0 (.0) .0 (.0) .0 (.0) 20.0 (25.0) 60.0 (62.5) 5 (8)\n2 . . . . . . . . . . . . . . . . .0 (.0) .0 (.0) 20.0 (11.1) .0 (.0) 20.0 (22.2) 60.0 (66.7) 5 (9)\nAll firms:\n1 . . . . . . . . . . . . . . . . 41.5 (43.1) 3.2 (3.3) 5.3 (5.9) 4.3 (4.6) 23.4 (25.5) 22.3 (17.6) 94 (153)\n2 . . . . . . . . . . . . . . . . 31.9 (30.7) 4.3 (5.2) 10.6 (13.1) 5.3 (5.9) 23.4 (25.5) 24.5 (19.6) 94 (153)\nNote.—Table shows row percentages for transition matrix from founder’s to CEO’s model. Row 1 results classify firms as “aberrant” that do not correspond\nto one of the five basic model types; row 2 results group “near-model-type” firms (see text for explanation) into the corresponding basic-type category. Results\nshown in parentheses are for all SPEC firms; other results are for the subset of firms providing valid data on employee turnover. Chi-square tests for row 1 of\neach pair: ; ; ; ; ); for row 2, ; ; ; ; ).2 2 2 2x p 113.4 dfp 25 P ! .001 (x p 195.0 dfp 25 P ! .001 x p 99.0 dfp 25 P ! .001 (x p 211.8 dfp 25 P ! .001\nLabor Pains\n983\nganizational models: a relatively high fraction of firms founded along\nengineering model lines transitioned to a bureaucratic model (and vice\nversa), and the engineering model seems to be a destination that is reached\nwith some frequency by firms irrespective of their founding model (except\nfor firms founded as autocracies). As we shall see below (table 5), the\ntransitions that occur with relatively low (high) frequency in table 2 are\ngenerally the transitions that occasion relatively more (less) employee turn-\nover. In other words, firms seem less likely to have made the most “turn-\nover-prone” transitions than to undertake the less turnover-prone ones.\nThis gives us some confidence that the model types capture distinct or-\nganizational blueprints and suggests that the architects and leaders of\nfirms are mindful of the disruptive consequences of changing organiza-\ntional blueprints.\nTable 3 reports descriptive statistics for all 327 spells containing valid\nturnover data. The annual turnover rate averages approximately 13%,\nthough there is obviously substantial variation. (Though not reported in\ntable 3, among the 93 firms with two or more turnover spells, 54.9% of\nthe variation in turnover is between firms; for the square root of turnover,\nthe corresponding figure is 62.6%.) Note that modest differences in turn-\nover, if sustained over time, can have quite dramatic implications for\norganizations. For instance, according to table 3, firms in the sample were\non average about 4.5 years old at the start of a spell.17 Consider the\ncumulative effect of being one standard deviation above the sample mean\non turnover (26% vs. 13%). If annual turnover remained constant at 13%\nfor a cohort over time, then after four years, 57% of the original cohort\nwould remain; after six years, the fraction is 43%. In a firm experiencing\n26% turnover, just under 30% of the original employees would still be\nthere after four years, and only 16% after six years. (The picture does not\nchange much if we incorporate more reasonable assumptions about turn-\nover declining with tenure.) Such differences in the representation of the\nold guard seem likely to have significant organizational implications.\nA change in top leadership occurred during 11.6% of the spells. In\nabout 2.5% of the spells, firms had not yet appointed a CEO; for nearly\n17 Note that the minimum organizational age reported in table 3 is –0.42%. For a few\ncases (just under 4% of spells), the birth of the organization (based on our criteria for\ndefining age—see text) occurred sometime during the spell. To be treated as a valid\nobservation and included in our sample, a firm must have existed for more than half\nthe year to which the turnover data corresponded, and the company had to have\nprovided turnover information for the year in question. This was done to avoid cases\nin which, for instance, a firm might have reported turnover data for 1991 but our\nmeasure of organizational age indicated that the firm came into existence in November\nor December of 1991, so the firm’s turnover report pertained to an extremely short\nperiod and thus was error-prone.\n984\nTABLE 3\nDescriptive Statistics\nVariable Mean Median SD Min Max N spells N firms\nTurnover rate:\nDuring annual spell . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 13.23 10.00 12.94 .00 100.00 327 101\nDuring annual spell (square root) . . . . . . . . . . . . . . 3.16 3.16 1.80 .00 10.00 327 101\nEmployment:\nStart of spell (FTEs, square root) . . . . . . . . . . . . . . 8.39 6.32 6.53 .00 40.74 314 95\nEnd of year 1 (FTEs, square root) . . . . . . . . . . . . 4.77 4.12 3.83 1.00 25.17 315 95\nDuration of first leadership (years) . . . . . . . . . . . . . . . 3.67 3.00 2.66 \u0002.09 12.50 314 88\nDuration of first CEO (years) . . . . . . . . . . . . . . . . . . . . . 3.77 3.00 2.64 .08 12.50 306 83\nChange in CEO during spell . . . . . . . . . . . . . . . . . . . . . . .12 .00 .00 1.00 327 101\nNo CEO at start of spell . . . . . . . . . . . . . . . . . . . . . . . . . . .02 .00 .00 1.00 327 101\n2\u0001 CEOs as of start of spell . . . . . . . . . . . . . . . . . . . . . . .25 .00 .00 1.00 327 101\nCumulative N of CEOs as of start of spell . . . . . . 1.36 1.00 .84 .00 6.00 327 101\nDuration of VC funding (years, square root) . . . . 1.15 1.22 1.04 .00 3.30 327 101\nDuration of public status (years, square root) . . . .23 .00 .56 .00 2.77 327 101\nAge at start of spell (years) . . . . . . . . . . . . . . . . . . . . . . . . 4.50 4.25 2.99 \u0002.42 13.91 327 101\nFounder’s model:*\nCommitment . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .13 .00 .00 1.00 302 93\nStar . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .11 .00 .00 1.00 302 93\nEngineering . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .34 .00 .00 1.00 302 93\nAutocracy . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .07 .00 .00 1.00 302 93\nHybrid . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .30 .00 .00 1.00 302 93\nBureaucracy . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .06 .00 .00 1.00 302 93\n985\nCEO’s vs. founder’s model:\nN dimensions changed . . . . . . . . . . . . . . . . . . . . . . . . . . .84 1.00 .87 .00 3.00 302 93\nIndustry:\nResearch . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .02 .00 .00 1.00 327 101\nManufacturing . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .04 .00 .00 1.00 327 101\nComputer hardware\/software . . . . . . . . . . . . . . . . . . .44 .00 .00 1.00 327 101\nTelecommunications\/networking . . . . . . . . . . . . . . . .20 .00 .00 1.00 327 101\nMedical devices or biotech . . . . . . . . . . . . . . . . . . . . . .18 .00 .00 1.00 327 101\nSemiconductors . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .11 .00 .00 1.00 327 101\nProportion employees, end of year 1, in:\nScience\/engineering roles . . . . . . . . . . . . . . . . . . . . . . . . .37 .42 .23 .00 .78 263 77\nSales roles . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .08 .05 .10 .00 .43 259 76\nClerical roles . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .04 .00 .06 .00 .29 259 76\nAdministrative\/senior management roles . . . . . . .40 .33 .23 .09 1.00 260 76\nProportion female, end of year 1 . . . . . . . . . . . . . . . . . .24 .22 .15 .00 .64 265 78\nNote.— SDs are not shown for binary variables.\n* “Near-type” firms grouped with corresponding “pure type” firms in each category (see text for explanation).\nAmerican Journal of Sociology\n986\na quarter of the spells, the firm had already experienced two or more\nCEOs as of the start of the spell.\nAmong founders, the engineering model was the most prevalent (34%).\nWe coded roughly 7% of the founders as having an autocratic model,\n13% as commitment, 11% as star, and just under 6% as bureaucratic.18\nThirty percent of founders gave responses that did not fit into any basic\nmodel type (or one of the near-types); we coded their blueprints as aberrant\nor nontype. The typical firm in our sample experienced change in its\norganizational model along one dimension, based on our classification of\nthe blueprints associated with CEOs at the time of our interviews versus\nthe models envisioned by founders. (For 44.1% of the firms and 42.4%\nof the spells, the founder and CEO models were identical on all three\ndimensions.) Not surprisingly, model changes were more frequent and\nextensive in firms that had also changed leadership. Among companies\nwith valid employee turnover data, 44% were still led by a founder in\n1994–95; of those, 57% were coded as not having changed the blueprint\non any dimension and only 12% had changed on two or more dimensions.\nAmong companies with a nonfounder CEO by 1994–95, only 23% had\nnot changed the model on any of the three dimensions, whereas 40%\nchanged on two or more dimensions.\nRESULTS\nEffects of Organizational Model and Change in Model on Turnover\nTable 4 reports results from multivariate analyses predicting the square\nroot of turnover for each firm-year spell. In a simple bivariate regression\n(not shown in table 4), the gross effect of blueprint change (number of\ndimensions that differed between the founder’s and CEO’s blueprints) is\n0.660 . Thus, relative to firms with stable employment(zp 5.084, P ! .001)\nblueprints, a firm in which the blueprint changed on all three dimensions\nis predicted to have a turnover rate that is points2(3# .660) p 3.92\nhigher.19 This strong positive effect persists after controlling for other\ndeterminants of turnover. Model 1 in table 4, for instance, adds dummy\nvariables depicting the founder’s blueprint (with bureaucracy as the omit-\nted category). Unexpectedly, firms founded on a bureaucracy model have\nlower turnover rates than firms founded on different blueprints, and that\n18 These percentages are based on combining “near-type” cases with their model-type\ncounterparts. For “basic model type” firms alone, autocracy is 4.3%, commitment is\n6.3%; star is 9.3%; engineering is 33.8%, and bureaucracy is 5.6%.\n19 This bivariate regression (based on 302 observations, 93 firms) has a constant of\n2.594 ; scale perameter p 2.863; Wald ( ,2(zp 14.440, P ! .001) x p 25.85 dfp 1 P !\n)..001\nLabor Pains\n987\neffect persists in model 2, which controls for a variety of organizational\ncharacteristics.\nOf course, the effects of founders’ models might reflect differences\namong the blueprints in their persistence and in the types of transitions\nthey will likely experience, which are not captured simply by the number\nof dimensions that changed. As a first means of examining that possibility,\nmodel 3 adds dummy variables depicting the CEO’s blueprint (with bu-\nreaucracy as the omitted category). The main contrast among CEO blue-\nprints is between autocracy, which exhibits the highest turnover rate net\nof other controls, and the commitment model, which displays the lowest.\nAccordingly, model 4 in table 4 presents the same specification with the\ncommitment blueprint as the reference category for founder’s and CEO’s\norganizational model.20 Model 4 reveals that firms whose CEOs’ blue-\nprints were autocracy or bureaucracy had significantly higher turnover\nthan otherwise comparable companies whose CEOs had a commitment\nmodel. According to model 3, firms whose CEO had a bureaucratic model\nalso display significantly higher turnover than firms whose CEO model\nwas classified as star.\nIt is important to acknowledge the causal ambiguity involved in relating\nCEO model and change in the model to turnover. Because we cannot\ndate when a firm’s model changed (if it did), turnover might be the cause,\nnot a consequence, of the CEO’s present-day model. We return to this\nissue below and present some results that provide reassurance against\nthis possibility.\nModels 3 and 4 of table 4 suggest that the effects of stability and change\nin organizational blueprints depend substantially on the specific blue-\nprint(s) involved. For instance, relative to a firm that retained a bureau-\ncratic model (the reference category in model 3), a stable autocracy is\npredicted to have experienced a turnover rate that is (0.365\u0001\npoints higher. Or consider two firms whose models changed21.459) p 3.33\non two dimensions: firm A changed from engineering to commitment; and\nfirm B shifted from star to bureaucracy. Relative to firms with a stable\nbureaucracy blueprint (the reference category in model 3), annual turnover\nis predicted to be only 0.90 higher in firm A, compared to 7.00 higher in\nfirm B.21 When compared to firms with a stable commitment blueprint\n20 Results for model 1 are comparable when reestimated on the same 271 cases as\nmodels 2–4 in table 4.\n21 For the star to bureaucracy transition, e.g., the predicted effect in model 3 is the\nmain effect of a star founder’s model (1.600), plus the main effect of a bureaucracy\nCEO’s model (0), plus the effect of changing the model on two dimensions (2#\n), for an overall effect of 2.646 in the square root metric or 7.00 on the turnover0.523\nrate.\n988\nTABLE 4\nTurnover Rates: GEE Estimates of Pooled Cross-Section, Time-Series Variation\nVariable\nModel 1 Model 2 Model 3 Model 4\nb z prob 1 d z d b z prob 1 d z d b z prob 1 d z d b z prob 1 d z d\nEmployment:\nStart of spell (square\nroot) . . . . . . . . . . . . . . . . . . . .027 .864 .387 .035 1.100 .271 .035 1.100 .271\nEnd of year 1 (square\nroot) . . . . . . . . . . . . . . . . . . . \u0002.051 \u00021.347 .178 \u0002.036 \u0002.984 .325 \u0002.036 \u0002.984 .325\nDuration of first CEO\n(years) . . . . . . . . . . . . . . . . . . . \u0002.131 \u00021.421 .155 \u0002.106 \u00021.381 .167 \u0002.106 \u00021.381 .167\nChange in CEO during\nspell . . . . . . . . . . . . . . . . . . . . . . .222 .970 .332 .376 1.507 .132 .376 1.507 .132\n2\u0001 CEOs as of start of\nspell . . . . . . . . . . . . . . . . . . . . . . \u0002.664 \u00021.886 .059 \u0002.410 \u00021.201 .230 \u0002.410 \u00021.201 .230\nDuration of VC funding\n(years, square root) . . . . . .289 1.965 .049 .135 .968 .333 .135 .968 .333\nDuration of public status\n(years, square root) . . . . . \u0002.544 \u00022.475 .013 \u0002.584 \u00022.829 .005 \u0002.584 \u00022.829 .005\nAge at start of spell\n(years) . . . . . . . . . . . . . . . . . . . .175 2.456 .014 .213 3.715 .000 .213 3.715 .000\nFounder’s model:\nCommitment . . . . . . . . . . . . 1.153 2.530 .011 1.190 2.440 .015 1.419 3.470 .001\nStar . . . . . . . . . . . . . . . . . . . . . . .887 1.607 .108 1.294 2.711 .007 1.600 3.094 .002 .181 .421 .674\n989\nEngineering . . . . . . . . . . . . . 1.071 2.419 .016 1.047 2.654 .008 1.007 2.888 .004 \u0002.412 \u00021.097 .272\nAutocracy . . . . . . . . . . . . . . . 1.173 1.966 .049 .905 1.333 .183 .365 .809 .418 \u00021.054 \u00022.597 .009\nAberrant . . . . . . . . . . . . . . . . .781 1.809 .070 .885 2.126 .034 .889 2.271 .023 \u0002.530 \u00021.866 .062\nBureaucracy . . . . . . . . . . . . \u00021.419 \u00023.470 .001\nCEO’s model:\nCommitment . . . . . . . . . . . . \u00021.104 \u00022.937 .003\nStar . . . . . . . . . . . . . . . . . . . . . . \u0002.969 \u00022.153 .031 .135 .282 .778\nEngineering . . . . . . . . . . . . . \u0002.641 \u00021.587 .113 .463 1.033 .302\nAutocracy . . . . . . . . . . . . . . . 1.459 3.739 .000 2.564 5.538 .000\nAberrant . . . . . . . . . . . . . . . . \u0002.646 \u00021.907 .057 .458 1.378 .168\nBureaucracy . . . . . . . . . . . . 1.104 2.937 .003\nCEO’s vs. founder’s\nmodel:\nN dimensions changed . . . .648 4.784 .000 .644 4.067 .000 .523 3.730 .000 .523 3.730 .000\nIndustry:\nManufacturing . . . . . . . . . . \u0002.686 \u00021.547 .122 \u0002.731 \u00021.773 .076 \u0002.731 \u00021.773 .076\nResearch . . . . . . . . . . . . . . . . \u00021.169 \u00023.362 .001 \u00021.105 \u00023.356 .001 \u00021.105 \u00023.356 .001\nConstant . . . . . . . . . . . . . . . . . . . 1.698 4.575 .000 1.321 2.911 .004 1.569 3.833 .000 1.569 3.833 .000\nN observations . . . . . . . . . . . . 302 271 271 271\nN firms . . . . . . . . . . . . . . . . . . . . . 93 85 85 85\nWald x2 . . . . . . . . . . . . . . . . . . . . 39.36* 214.81* 462.96* 462.96*\ndf . . . . . . . . . . . . . . . . . . . . . . . . . . . 6 16 21 21\nScale parameter . . . . . . . . . . . 2.867 2.472 2.218 2.218\n* P ! .001.\nAmerican Journal of Sociology\n990\n(the reference category in model 4), firm B is predicted to have an annual\nturnover rate that is 5.43 higher, whereas firm A’s is only 1.51 higher.\nChanging the Organizational Model: A Closer Look\nThe additive specification in table 4 potentially masks interactive effects\nof origins and destinations in determining the disruptive effects of chang-\ning the organizational blueprint. To differentiate between the process and\ncontent effects of organizational change, table 5 provides a finer-grained\nportrait of how turnover varies as a function of stability and change in\nfounders’ employment blueprints. It reports estimates of specifications\nthat incorporate the same set of covariates as in model 2 of table 4, but\nwe replace the covariates representing founders’ blueprints and the num-\nber of dimensions that changed with a vector of dummy variables rep-\nresenting specific combinations of founder and CEO blueprints. The par-\nticular combinations of origin and destination states incorporated in table\n5 capture the main contrasts that we thought interesting (how close to\none of the five basic model types; distance between origin and destination\nmodel; and so forth) and the main transitions observed in our data. (For\nseveral transitions of particular substantive interest, the number of cases\nwas very small, but we have nonetheless reported the detailed results.)\nThe coefficients in table 5 represent predicted differences in turnover\n(square-root metric) between firms that experienced a given transition and\ntwo different reference categories: stable bureaucracies (the first set of\ncoefficients in table 5); or all firms that did not change their employment\nblueprint (the second set of coefficients). Table 6 reports significance tests\non contrasts between specific coefficients (rows) in table 5, rather than\ncontrasts vis-a`-vis the reference categories.\nTable 5 suggests two basic conclusions. First, abandoning a basic model\ntype was generally associated with higher turnover, in support of hy-\npothesis 1a (but see below). Consistent with hypothesis 1c, the disruptive\neffect of abandoning a basic model type in favor of an aberrant blueprint\nseems especially large for firms founded along commitment or star lines\n(see comparison in table 6 between rows 7 and 8).22 Second, consistent\nwith hypothesis 1b, changing to a basic model type was less disruptive\nthan moving to an aberrant blueprint. For instance, among firms that\nabandoned the commitment or star model, those migrating to the engi-\nneering model had somewhat lower turnover than those adopting an\n22 Even moving to the engineering model (a model that seems robust and flexible) from\nthe commitment or star model seems slightly more disruptive than migrating to the\nengineering blueprint from any other pure model (cf. rows 12 and 13), though table 6\nreveals that the contrast is not significant ( ).Pp .15\nLabor Pains\n991\naberrant blueprint (see comparison in table 6 between rows 7 and 12;\n, two-tailed).23Pp .097\nThe bureaucracy and autocracy models do not fit this pattern, however.\nGenerally, moving to either of them increased turnover, whereas aban-\ndoning either of them reduced turnover. Moving from any other basic\nmodel to bureaucracy increased turnover considerably, though the ap-\nparent dislocation was considerably smaller among firms that migrated\nto bureaucracy from the engineering model (cf. rows 10 and 11), consistent\nwith the claimed compatibility between engineering culture and bureau-\ncratic culture. This result illustrates that origins and destinations matter:\nmovement to bureaucracy from either the engineering model or an ab-\nerrant blueprint produced significantly less turnover than did\nabandonment of another basic model (especially the star type) for bu-\nreaucracy (row 11). Similarly, in one case abandoning a basic model seems\nto have reduced turnover: movement from bureaucracy to engineering\n(row 13).\nThese findings suggest that, in at least some cases, the disruptive effects\nassociated with altering an organization’s employment model are more\nthan offset by an increase in the attractiveness of the new model. In short,\nthe content of organizational changes affects how disruptive they are.\nDismantling the commitment and star models apparently was most de-\nstabilizing, whereas any disruptive effects associated with dismantling\nbureaucracy seem to have been more than offset by favorable responses\nto the change, resulting in lower turnover. Conversely, in shifts to bu-\nreaucracy or autocracy, the virtues of a clear and consistent model as a\ndestination state were offset considerably by employees’ apparent strong\ndislike for these particular models.\nAnother result in table 5 suggests that the basic model types represent\nrelatively desirable origin and destination states, in terms of minimizing\nlabor turnover: companies that replaced one aberrant or nontype blueprint\nwith another experienced especially high turnover (row 9). Only firms that\nretained or adopted autocracy or that migrated to bureaucracy from an-\nother basic model other than engineering had higher predicted turnover\nlevels (cf. rows 14, 15, 15a, and 15b).\nIn other words, if a founder adopted an aberrant HR model, then\nchanging to another aberrant model made the organization especially\nvulnerable to turnover. The contrasts among these effects are not highly\nsignificant, however, for several reasons. First, the transition from an\n23 All firms that migrated to bureaucracy from a model type other than engineering\nwere founded along star-model lines (see row 11). This transition was characterized\nby particularly high turnover, because abandoning the star model and migrating to\nbureaucracy both seem to be destabilizing for technology companies.\n992\nTABLE 5\nEffects on Turnover of Stability and Change in Founder’s Employment Models\nReference Category\nRow (Founder’s Model) ⇒ (CEO’s Model) N spells N firms\nStable Bureaucracy All Stable Firms\nCoefficient z prob 1 d z d Coefficient z prob 1 d z d\n1 . . . . . . Stable autocracy 4 2 2.151 2.571 .010\n2 . . . . . . Stable commitment 11 4 .630 .826 .409\n3 . . . . . . Stable star 10 3 1.053 2.108 .035\n4 . . . . . . Stable engineering 36 10 .463 .826 .409\n5 . . . . . . Stable near-type model* 12 3 .232 .398 .691\n6 . . . . . . Stable aberrant (nontype) model 27 9 \u0002.202 \u0002.444 .657\n7 . . . . . . (Commitment or star) ⇒ aberrant 14 5 2.061 3.828 .000 1.196 2.903 .004\n8 . . . . . . (Basic model other than commitment or\nstar) ⇒ aberrant 33 10 .943 1.501 .133 .302 .632 .527\n9 . . . . . . (Aberrant or near-type) ⇒ (different aber-\nrant or near-type) 30 8 2.077 3.094 .002 1.198 2.114 .034\n10 . . . . (Engineering or aberrant) ⇒ bureaucracy 50 16 1.345 2.971 .003 .651 1.740 .082\n11 . . . . (Basic model other than engineering) ⇒\nbureaucracy‡ 3 1 2.551 5.260 .000 1.739 4.516 .000\n993\n12 . . . . (Commitment or star) ⇒ (different basic\nmodel other than bureaucracy)† 3 2 .464 .486 .627 \u0002.304 \u0002.354 .723\n13 . . . . (Basic model other than commitment or\nstar) ⇒ (different basic model other than\nbureaucracy)†§ 3 1 \u0002.788 \u00022.155 .031 \u00021.480 \u00025.868 .000\n14 . . . . (Aberrant or near-type) ⇒ (commitment or\nstar) 8 2 .944 1.442 .149 .286 .478 .632\n15 . . . . (Aberrant or near-type) ⇒ (basic model\nother than commitment or star) 18 6 1.550 2.460 .014 .975 1.910 .056\n15a . . . (Aberrant or near-type) ⇒ engineering 14 5 1.160 1.879 .060 .694 1.244 .214\n15b . . . (Aberrant or near-type) ⇒ autocracy 4 1 3.004 5.902 .000 2.178 5.037 .000\nNote.—Predicted effects on turnover (square root) from model controlling for same covariates as in model 2 of table 4. Results pertaining to rows 15a and 15b\nare based on a supplementary specification replacing transition in row 15 with transitions shown in rows 15a and 15b; all other results are from a specification\nincluding the contrasts in rows 1–15.\n* All cases of stable near-type models are near-commitment firms.\n‡ All transitions originated from star model\n† All transitions involve move to engineering model\n§ All transitions originated from bureaucratic model\nAmerican Journal of Sociology\n994\nTABLE 6\nAdditional Contrasts among Coefficients in Table 5\nRow Contrasts Coefficient z prob 1 d z d\n7 versus (2, 3) . . . . . . . 1.244 2.161 .031\n7 versus 8 . . . . . . . . . . . . 1.118 1.930 .054\n7 versus 12 . . . . . . . . . . 1.598 1.659 .097\n9 versus (5, 6) . . . . . . . 2.183 3.888 .000\n9 versus 8 . . . . . . . . . . . . 1.134 1.771 .077\n9 versus 14 . . . . . . . . . . 1.134 1.583 .114\n9 versus 15 . . . . . . . . . . .528 .766 .444\n9 versus 15a . . . . . . . . . .918 1.279 .201\n9 versus 15b . . . . . . . . . \u0002.925 \u00021.698 .090\n10 versus (4, 5, 6) . . . 1.114 2.577 .010\n10 versus 11 . . . . . . . . . \u00021.205 \u00022.774 .006\n10 versus 13 . . . . . . . . . 2.134 6.514 .000\n12 versus 13 . . . . . . . . . 1.252 1.433 .152\n14 versus (5, 6) . . . . . . 1.031 1.847 .065\n14 versus 15 . . . . . . . . . \u0002.606 \u0002.909 .363\n14 versus 15b . . . . . . . \u00022.073 \u00023.495 .000\n15a versus 15b . . . . . . \u00021.843 \u00022.718 .007\n15 versus (5, 6) . . . . . . 1.629 3.432 .001\naberrant blueprint to one of the five basic models compounds two op-\nposing effects—the disruptive effects of altering the employment model,\nand the (presumably) beneficial effect of adopting a consistent model.\nSecond, the benefit associated with shifting to a basic model type depends\non the underlying attractiveness of that model. For instance, relative to\nfirms that retained an aberrant blueprint, companies that shifted to one\nof the basic types generally experienced higher turnover, consistent with\nthe notion that changing the premises governing employment relations\ndisrupts an organization’s equilibrium.\nThe magnitude of the effect of change depends significantly on the\ndestination (the new blueprint). Consider several examples. For transitions\nto the commitment or star blueprint from an aberrant model (which were\nfew in number), predicted turnover was only modestly higher (1.031) than\namong firms that stayed with a particular aberrant blueprint (zp\n; ). Moving to the engineering model from a nontype blue-1.847 Pp .065\nprint occasioned somewhat higher turnover, significantly more than\namong firms that retained a particular aberrant blueprint (if row 15a in\ntable 5 is contrasted against rows 5 and 6, ; ;bp 1.300 zp 2.704 Pp\n; supplementary analyses not shown in table 6). The transition from.007\nan aberrant model to bureaucracy also produced significantly higher turn-\nover than occurred among companies that retained their founder’s ab-\nLabor Pains\n995\nerrant blueprint.24 Migrating from an aberrant form to autocracy, although\nquite rare, seems to have been even more disruptive; firms making this\ntransition experienced significantly higher turnover than companies that\nretained an aberrant blueprint ( ; ; ; supple-bp 3.193 zp 6.389 P ! .001\nmentary analyses not reported in table 6), and even somewhat higher than\nin companies that cycled from one aberrant model to another (see contrast\nbetween rows 9 and 15b in table 6).\nIn short, model consistency and cultural resonance are not virtues in-\ndependent of the model’s content. Rather, the effect of abandoning or\nmoving to one of the five basic models seems to depend quite a bit on\nthe specific model. The commitment and star models appear to be par-\nticularly risky to dismantle and less contentious to adopt. In contrast,\nmoving from bureaucracy and autocracy entails little disruption, whereas\nmoving toward these models seems especially unsettling.\nThe fine-grained analyses in tables 5 and 6 cast light on the differences\nin turnover rates as a function of founder’s employment model that were\nreported in table 4. Among firms that retained their original employment\nblueprints, the only model types with significantly higher turnover than\nbureaucracy were autocracy and star. According to table 5, autoc-\nracy—whether adopted at the firm’s inception or subsequently (cf. rows\n1 and 15b)—fosters high levels of employee turnover. This is hardly sur-\nprising, given the considerable education, experience, and professionalism\namong Silicon Valley’s labor force; the intense competition among em-\nployers for key personnel; and employees’ high expectations for autonomy\nand self-actualization at work. The star model is widely perceived in\nSilicon Valley as turnover-prone, due to perceived inequities it can foster,\nthe high mobility of scientific and technical stars to whom the model is\ntargeted, and the tendency of star-oriented firms to rely more on stock\noptions (which either stay underwater or else vest and are exercised, in\neither case making the firm vulnerable to turnover).\nOther differences in turnover rates as a function of the founder’s model\nare not significant (in table 5) after controlling for the specific transitions\nthat firms experienced. Although turnover appeared (in table 4) to be\nlower in firms founded along bureaucratic lines than in companies\nfounded on commitment, engineering, or hybrid models, tables 5 and 6\nreveal that this is simply because the latter firms were more likely to\nchange their employment models—which on its own is destabilizing—and\n24 In supplementary analyses, we subdivided row 10 into firms that transitioned to\nbureaucracy from the engineering model versus from an aberrant (nontype) blueprint.\nTurnover within the latter group was significantly higher than among firms with a\nstable near-type or nontype blueprint ( ; ; ).bp 1.735 zp 2.899 Pp .004\nAmerican Journal of Sociology\n996\nto make the kinds of changes that foster higher turnover (i.e., toward\nbureaucracy, autocracy, or an aberrant blueprint).\nYet table 5 indicates that no other employment model, retained over\ntime, displays significantly lower turnover than bureaucracy. We find this\nresult somewhat surprising in light of the apparent low regard with which\nSilicon Valley employees view bureaucracy, as evidenced by the reductions\n(increases) in turnover that seem to accompany firms’ abandoning (em-\nbracing) a bureaucratic model (see rows 10, 11 and 13 in table 5). We\nspeculate that firms founded along bureaucratic lines might have antic-\nipated long-term growth and hired employees better prepared to handle\nthe transition to a more mature organization, whereas that transition\nrequires more “churning” of personnel in firms built on other models.25\n(This is especially plausible to the extent that founders who embraced a\nbureaucratic model had prior exposure to larger, well-established tech-\nnology companies.) Some evidence consistent with this speculation comes\nfrom the summary notes provided by a member of our research team\nafter interviewing a founder of one of the firms we coded as adhering to\na stable bureaucratic model. That founder had previously worked in one\nof Silicon Valley’s largest and most prominent companies:\nDuring her tenure, Z (one of the founders) has put in place systems and\ncontrols that would be appropriate for a far larger company. Z has prepared\nfor the growth (little so far) that the company anticipates and she points\nout that some of the company’s systems have yet to be fully utilized. The\nfirm under Z seems to be employee friendly. Z has a reputation for great\nrelations with her employees—or her “people,” as she’s been known to call\nthem—a fact that is borne out in the firm’s low turnover. She mentioned\ntwo former employers (large, well-established technology companies) as in-\nfluences with regard to organizational design. . . . CEO Z says she is the\nperson most responsible for HR at the company. HR at the firm is part of\nstrategic planning. When the company reaches 50 employees . . . a full-\ntime HR specialist will be hired. Indeed, Z knew exactly where in her file\ncabinet to find the company’s employee handbook, developed in the com-\npany’s first year as Z’s first task as CEO. . . . In addition to the employee\nhandbook, she also instituted in the first year written performance evalu-\nations, nondisclosure agreements (NDAs), and instituted regular company-\nwide meetings. (ID #141)\nAnother company that we classified as a stable bureaucracy seems to\nfit a similar pattern—planning in advance for rapid growth by a founder\n25 Precisely because bureaucracies are rather atypical within Silicon Valley, it is also\npossible that firms founded along such lines transmit clearer and more accurate pre-\nemployment expectations for individuals joining the firm, relative to organizations\nbuilt on other models (particularly the commitment, star, and autocracy models), re-\nsulting in higher posthiring attrition in the latter.\nLabor Pains\n997\nwith prior work experience in large, well-established technology com-\npanies. This firm’s founder-CEO, a Ph.D. scientist who had worked pre-\nviously in several large electronics, semiconductor, and defense companies,\nanticipated the explosive growth in portable computers and in “smart\ndevices” (digital cameras, mobile phones, personal digital assistants) and\nhoped to compete against Intel and Advanced Micro Devices in producing\nflash memory storage devices. He sought to capture early mover advan-\ntage by developing technology, key supplier and customer partnerships,\nand organizational capability in advance of a market that was only just\nemerging when the company was launched:\nFounder: The catalyst for starting the company was that I believed that\nthere was going to be a need in the marketplace for the kind of products\nthat I had in mind several years after we were going to start a company.\n. . . I felt I had a solution to a problem that was not yet evident as a problem.\n. . .\nInterviewer: (Did you have) a model or a blueprint for organizing the com-\npany at the beginning, whether from your past experience or from other\ncompanies that you admired?\nFounder: Yeah, it was basically, the first five years we would be a functional\norganization, we would have VP’s for the various functions, no separate\ndivisions . . . , and have very good executive staff, hire a good CFO, a good\nVP of engineering, VP of technology, VP of operations, traditional structure.\nAnd I did not expect that (to) change in the first five years. I did not look\nbeyond the first five years. (ID #19)26\nIn sum, differences in turnover across founder models for the most part\nreflect differences in the vulnerabilities of the particular models to sub-\nsequent change and the dislocating effects of such changes. More broadly,\nthe results in tables 5 and 6 provide some indirect validation of our\ntypology of employment models. For instance, the high turnover char-\nacteristic of firms that moved between aberrant blueprints suggests that\nconsistency of the organization’s employment model does indeed reduce\nturnover. Moreover, transitions among particular origin and destination\nmodels vary in sensible and predictable ways in affecting turnover (e.g.,\nthe dislocating effects of abandoning the commitment or star model and\nof migrating toward bureaucracy or autocracy). Altering the employment\nblueprint generally destabilizes organizations, especially when the blue-\nprint is relatively coherent. However, the content of the changes can\nattenuate or exacerbate the process effect (the tendency for changing the\nemployment model to foster turnover).\n26 Interestingly, when asked whether he had any specific company in mind as an\norganizational model, the founder mentioned Intel, the largest firm in the industry.\nAmerican Journal of Sociology\n998\nOTHER DETERMINANTS OF TURNOVER RATES\nWe briefly summarize the effects of other variables on firms’ turnover\nrates in table 4. We find no net effect of change in CEO during a spell\non turnover. Interestingly, the gross effect (not shown in table 4) is sizable\nand statistically significant ( ; ; ), but it be-bp 0.687 zp 2.539 Pp 0.011\ncomes insignificant once we control for change in the founder’s organi-\nzational model.27 In other words, executive succession is associated with\nturnover primarily because it is associated with model change. The fact\nthat the (time-varying) effect of executive succession is mediated by the\n(time-invariant) effect of the number of model dimensions that changed\nis substantively important. It gives us some confidence that change in the\nblueprint operates as a cause, rather than as a consequence or correlate,\nof turnover, even though we cannot be certain that all changes in blue-\nprints preceded the turnover spells they are supposed to predict.28\nWe find only weak evidence of the hypothesized imprinting effect of\nthe organization’s first CEO. Controlling for organizational age, the more\nof the firm’s history that was “presided over” by the first CEO, the lower\nthe subsequent turnover.29 However, this effect is moderated somewhat\nand becomes statistically insignificant when other variables (specifically,\nblueprint change) are controlled for.\nAccording to model 2 of table 4, firms led by their second or subsequent\nCEO experienced slightly lower turnover.30 However, this effect tends to\nbe pronounced only in specifications that also control for model change.\n27 In a specification with CEO change (time-varying) and number of dimensions of\nmodel change (time-invariant) as regressors, the effect of CEO change is 0.280 (zp\n; ), whereas the effect of model change remains strong and significant1.494 Pp .135\n( ; ; ).bp 0.643 zp 4.931 P ! .001\n28 We also find a modest positive effect of changing the CEO on turnover in a standard\n“fixed effects” model that controls entirely for between-firm variation in turnover and\nincludes only time-varying independent variables (results available on request). How-\never, the size and significance of the effects are reduced considerably if a time-varying\nmeasure of the cumulative number of CEOs in the firm is also added to the specification,\nwhich has a significant negative effect on turnover in the fixed-effects model.\n29 In a specification with just those two covariates, first CEO duration has a strong\nnegative effect on turnover ( ; ; ).bp\u00020.186 zp\u00022.345 Pp .019\n30 In supplementary analyses that included spells for firms that had not yet designated\na CEO, we also found that companies experienced significantly lower turnover before\nappointing their first CEO (relative to the omitted category, first CEO), even controlling\nfor organizational age (results available on request). We suspect that appointing a CEO\nafter a firm has functioned for some time without one destabilizes organizations for\ntwo reasons: (1) it signals a move to a more business-like and hierarchical approach,\nwhich often conflicts with the original vision of the founders; and (2) designating one\nof the founders (or an outsider) as CEO after a period of collective control often causes\nthe remaining founders to feel disenfranchised and to depart, sometimes taking other\nemployees with them.\nLabor Pains\n999\nThis is because firms with a second or subsequent CEO are significantly\nmore likely to have experienced a model change, resulting in higher turn-\nover; net of that tendency, however, such firms actually display somewhat\nlower turnover. In other words, if we compare two firms that both altered\ntheir original blueprint dramatically, the estimates of model 2 of table 4\nimply that a firm still being run by its first CEO will have slightly higher\nturnover than one in which the initial CEO has been replaced. We spec-\nulate that this result reflects the nature of implicit contracts. Founders\ngenerally establish the implicit contracts with employees that are embed-\nded in the organizational blueprint; hence, it might be more contentious\nfor a founder-CEO to alter that blueprint and to remain at the helm, as\na continuing reminder to employees of how the enterprise has strayed\nfrom its initial model, than it is for a newcomer CEO.31\nTurnover increases with the length of time since a firm first received\nventure capital. Venture capitalists (VCs) often help young organizations\nformalize and fill key managerial and technical roles (Baron et al. 1999b),\nespecially as their relationship with the firm develops over time, because:\n(1) they often maintain an initial hands-off approach; (2) if the enterprise\nis proceeding on a path towards going public, VCs want to ensure that\nthe firm possesses the management capability and organizational routines\nto handle this transition; and (3) if the firm is doing poorly, VCs will\nfrequently insist on changes in management and\/or organizational routines\n(using their board positions to bring this about). The effect of venture\ncapital in model 2 of table 4 might capture turnover that is induced when\nVCs facilitate bureaucratization of firms and the replacement of early\nemployees.32 Turnover appears to decrease somewhat the longer a firm\nhas been public. This result is consistent with qualitative observations\nfrom our interviews about disruptive effects that accompany the initial\npublic offering (IPO). Respondents noted that going public can disrupt\norganizations in a variety of ways—for instance, requiring new sorts of\nskills (e.g., financial reporting, public and investor relations) not previously\nrepresented among employees, which might require both adding new\n31 Consistent with that conjecture, adding an interaction term between the cumulative\nnumber of CEOs and the number of dimensions that changed in the blueprint to model\n2 of table 4 produces a negative effect that approaches statistical significance (bp\n; ; , two-tailed), and the main effect for number of CEOs\u00020.169 zp\u00021.634 Pp .102\nis no longer significant. Thus, turnover associated with changing the model is greatest\nfor companies still being led by their first CEO at the beginning of a spell.\n32 Consistent with that interpretation, note that the effect of venture capital on turnover\nbecomes insignificant after controlling for the CEO’s organizational blueprint (model\n3), which VCs presumably are likely to help shift toward bureaucracy. In addition,\nsupplementary analyses reveal that firms in which the CEO championed the bureau-\ncratic model were significantly more likely to have venture capital and to have had\nit longer than all other firms.\nAmerican Journal of Sociology\n1000\nkinds of employees and replacing some individuals as well. Moreover,\nrespondents emphasized that going public often represents a financial and\nsymbolic milestone, which, once surpassed, can leave a motivational void.\nOne founder-CEO of a company engaged in biotechnology instrumen-\ntation told our research team:\nWe worried about the IPO a lot because from the earliest days that was a\nclear corporate focal point. Get to the IPO point, get the company public.\nIt’s the big payoff for people who have stock. Every person in our company\nis a stockholder. We grant them options when they join. Everyone worked\nvery hard for six years to get to that point. Our concern was, after the IPO\nand after the lockups expire (so that) people have the ability to sell stock,\nwe were concerned what the motivation levels in the company would look\nlike (and) what we could do to influence that motivation level. One thing\nwe are working very diligently on right now is identifying what the next\ncorporate milestone will be. 25%–30% growth isn’t the kind of corporate\nobjective or singularity of purpose that gets people riled up. We are looking\nfor something a little more specific, like that $100 million benchmark. We’re\nin the process of making a final decision of what that overall, superordinate\ngoal is going to be. (ID #23)\nThe negative relationship between duration as a public company and\nturnover might also reflect vesting of stock options. Among the spells\ninvolving public companies, the typical duration as a public company\nwas only about two years (with more than 85% of spells involving com-\npanies that had been public less than four years). The tendency for turn-\nover to decline with duration as a public company might reflect the in-\ncreasing sway that stock options have as employees approach the vesting\ndate when those options can be exercised (often three to five years after\nthe initial public offering).33\nAs predicted, organizational age has a strong positive effect on employee\nturnover, consistent with the notion that younger technology companies\nare perceived as offering greater technological challenges and larger pros-\n33 In “spline” specifications that restrict the effect of duration to companies that were\nalready public, the effect is still strongly negative ( ), though only marginallybp\u00020.567\nsignificant ( ). We also experimented with numerous other specifications, in-Pp .068\ncluding dummy variables denoting whether these events occurred in a given (or im-\nmediately prior) spell and specifications incorporating a time-invariant effect of having\nventure capital or being publicly traded. In some of these models, we found significant\neffects of having received venture capital or gone public in the prior spell, which\nworked in the opposite direction from the effect of duration—that is, turnover declined\nin the spell following VC funding, but increased subsequently; and turnover increased\nin the spell after companies went public, but subsequently declined the longer firms\nhad been publicly traded. However, these lagged effects do not persist if employment\nchange in the preceding spell is controlled, suggesting that the lagged effects on turnover\nof receiving VC financing or going public simply reflect the short-term impact of those\nevents on employment growth and decline.\nLabor Pains\n1001\npects for financial gain through stock option grants. In some specifications,\norganizational growth increased turnover, but the magnitude and signif-\nicance of this effect varies depending on the particular specification and\nset of observations involved. Turnover tends to be lower in research and\nmanufacturing companies (as contrasted with computer hardware and\nsoftware, medical devices and biotechnology, semiconductors, and tele-\ncommunications and networking). Finally, in supplementary analyses, we\ncontrolled for occupational and gender composition at the end of the first\nyear of operations for the subset of companies that provided this infor-\nmation. Those controls do not appreciably alter the effects associated with\nfounders’ employment blueprints or changing the blueprint (results avail-\nable on request). Hence, our findings do not appear to be artifacts of gross\ndifferences in occupational composition or gender mix.\nOverall, the effects of model change persist even after we control for\nmany other factors that could be expected to influence turnover rates,\nincluding organizational size and growth, age, industry, occupational and\ngender composition, and the duration of venture capital financing and\npublic status.\nWHO IS LEAVING: DISENCHANTED OLD GUARD OR MISMATCHED\nNEW GUARD?\nIf altering organizational blueprints changes the skills, values, working\nrelationships, and routines that have developed within an enterprise, then\nturnover associated with changing blueprints should be concentrated dis-\nproportionately among more senior employees. Our data do not permit a\ndirect test of this prediction. However, companies completing our HR\nsurvey did provide a tenure distribution for the firm (the fraction of the\nlabor force with tenure of six months or less, seven to twelve months,\netc.) at the time of the interview (1994 or 1995). To examine this issue,\nwe conducted exploratory analyses, predicting the percentage of employ-\nees in 1994–95 having six months or less tenure in the firm. These analyses\nwere limited to the last spell for which we had information within each\nfirm (1994 or 1995). We included as predictors the same covariates as in\nmodel 2 of table 4, as well as contemporaneous and lagged measures of\nturnover. For firms interviewed in 1995, there is some potential ambiguity\nregarding the time frame to which firms’ responses regarding turnover\nrates and tenure distributions pertain. We handled this ambiguity by\nperforming the analyses in various ways.34 The key results of interest are\n34 The 1995 survey form asked for the firm’s current tenure distribution but inadver-\ntently asked for turnover data pertaining to the first half of 1994 (as we had requested\nfor firms interviewed in mid-1994). Some companies interviewed in 1995 provided, on\nAmerican Journal of Sociology\n1002\nstable across specifications and subsamples analyzed and are unaffected\nby weighting, so we report (in table 7) only one set of those analyses,\nwhich are unweighted.\nTable 7 reveals that change in the employment blueprint has a strong\nand significant positive effect on the fraction of a firm’s workforce having\ntenure of six months or less. In other words, the more a firm had changed\nits organizational blueprint by 1994–95, the larger the fraction of recently\nhired employees on its payroll, even controlling for recent turnover ex-\nperience.35 Because we have controlled for turnover in the analysis, the\neffect of model change cannot be attributed simply to the higher levels\nof turnover experienced by firms that changed their employment blue-\nprint. Rather, a more plausible explanation for this effect holds that firms\nexperienced turnover disproportionately from their old guard when em-\nployment blueprints changed, consistent with hypothesis 2.\nThis interpretation is buttressed by parallel analyses in table 7, model\n2, that focus on the size of the most senior tenure cohort in the firm (five\nor more years). Companies that changed their employment blueprint most\nhave a significantly smaller proportion of old-guard employees. Effects\nof other variables in the analysis seem quite plausible—for instance, the\ntheir own initiative, turnover data for all of 1994 and the first half of 1995. In one set\nof analyses, we excluded firms that were interviewed in 1995 but that did not provide\nturnover data pertaining to the same time period as the tenure distribution. In other\nanalyses, we constructed a new lagged turnover measure for year , equal to (a)t\u0002 1\n1993 turnover for firms interviewed in 1994; (b) turnover in 1994 for firms interviewed\nin 1995 that also provided turnover data for 1995; and (c) turnover in the first half of\n1994 for firms interviewed in 1995 that did not furnish any more recent turnover data.\nIn another variant, we restricted the analysis to firms interviewed in 1994. These\nanalyses produced results comparable to those reported in table 7, which handles the\nambiguity by: (a) including a dummy variable for whether or not a given firm provided\ncontemporaneous turnover data for the same time period as the tenure distribution;\n(b) controlling for 1994 vs. 1995 interview year; and (c) permitting the effect of lagged\nturnover to vary between firms that did versus did not furnish contemporaneous\nturnover data.\n35 Turnover in the prior year generally has a negative effect on the size of the “new\nguard,” presumably because firms experiencing high turnover in the previous year\nhired replacements, who had already accumulated more than six months’ seniority\nwithin the firm. However, model 1 in table 7 reveals an exception: among firms in-\nterviewed in 1995 that did not provide contemporaneous turnover data for 1995, lagged\nturnover exhibits a positive relationship with the fraction of employees hired in the\nlast six months. One possible explanation for this result is that these firms (all studied\nin 1995) were (justifiably) confused by the different time frames to which the turnover\nand tenure questions pertained, and they unwittingly reported their tenure distribution\nfor 1994 and\/or their recent (1995) turnover experience instead of consistently providing\ninformation pertaining to 1994 or 1995 (i.e., it is because they had a relatively low\ntenure workforce in 1994 that they display higher turnover in 1995). This would\naccount for the appearance of a significant positive relationship between reported\nturnover and the size of the recently hired contingent.\nLabor Pains\n1003\nfraction of senior employees is larger in older companies, in those that\nwere larger in their first year of operations, and in those founded along\ncommitment lines.36 Recognizing that not all firms in the sample had been\nin existence for five years, we also replicated these analyses on the subset\nof companies that were five years old or more as of the start of the spell,\nand the results (available on request) were comparable to those reported\nin table 7.\nWe cannot make strong inferences on this issue, given the considerable\nlimitations of the data available to us. However, these exploratory results\nseem consistent with the view that adopting a new organizational model\nincreases turnover principally by dislocating the old guard.\nTURNOVER AND ORGANIZATIONAL PERFORMANCE\nWe have argued that the tendency for changes in organizational blueprints\nto increase turnover is interesting for numerous reasons, irrespective of\nthe relationship between turnover and firm performance. Nonetheless, we\nwish to test the prediction, derived from ecological perspectives, that the\ndisruptions occasioned by turnover destabilize organizations and ad-\nversely affect performance. We report a preliminary analysis of the re-\nlationship between turnover and one compelling indicator of performance:\nrevenue growth. Bear in mind that many young technology companies\nare incurring significant set-up costs that might dampen profitability, such\nas conducting basic research, developing distribution channels, building\ninfrastructure, and so on. Hence, the ability to accelerate the flow of\nrevenues is a reasonable indicator of early success in young technology\ncompanies, one over which the labor force has some control and one that\nis tracked closely by external constituencies and stakeholders. In addition,\nthe data we analyze on revenue growth were provided by the companies\nto independent sources—annual reports to the SEC (for public companies)\nand annual editions of the Technology Resource Guide to Greater Silicon\nValley (a commercial database distributed by CorpTech)—rather than\ndirectly to us, reducing the chance of any bias.\nWe model performance by relating revenues (in $100,000s) in year\nto: (a) revenues in year T; (b) average turnover in years andT\u0001 2 T\u0002 1\nT; and (c) other controls (described below). We calculated each firm’s\naverage turnover rate over the last two spells for which it provided data\n(for most firms, 1993 and the first half of 1994; for a few firms, 1994 and\n36 Not surprisingly, with age, size, and growth controlled, the effect of recent turnover\non the relative size of the most senior tenure cohort is modest.\n1004\nTABLE 7\nDeterminants of Tenure Distribution of Employees in 1994–95: OLS Estimates\nVariable\n% with Six Months Tenure\nor Less\n% with Five Years Tenure\nor More\nb t prob 1 d t d b t prob 1 d t d\nCEO’s vs. founder’s model: N dimensions changed . . . . . . . . . . . . . . . . . . 5.078 2.473 .016 \u00024.562 \u00022.051 .045\nFounder’s model:\nCommitment . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u00024.933 \u0002.628 .533 23.604 2.773 .007\nStar . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u00021.176 \u0002.143 .887 11.992 1.346 .183\nEngineering . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 2.029 .280 .781 7.813 .994 .324\nAutocracy . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u00029.603 \u0002.930 .356 9.037 .808 .422\nAberrant . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u00026.728 \u0002.916 .363 12.150 1.527 .132\nTurnover (square root), prior year . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 5.682 3.078 .003 \u0002.227 \u0002.113 .910\nTurnover (square root), prior year # contemporaneous turnover . . . \u00028.135 \u00023.764 .000 \u0002.239 \u0002.102 .919\nEmployment (square root), start of spell . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .302 .673 .504 .521 1.070 .289\nEmployment (square root), end of year 1 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u0002.592 \u00021.008 .317 2.422 3.807 .000\nDuration of first CEO (years) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u0002.135 \u0002.116 .908 \u00021.420 \u00021.124 .266\nChange in CEO during spell . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 3.636 .747 .458 2.497 .474 .637\n2 \u0001 CEOs as of start of spell . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 1.162 .241 .811 \u00022.171 \u0002.415 .680\nDuration of VC funding (years, square root) . . . . . . . . . . . . . . . . . . . . . . . . . . \u00022.878 \u00021.601 .115 1.171 .601 .550\nDuration of public status (years, square root) . . . . . . . . . . . . . . . . . . . . . . . . . .775 .226 .822 \u00024.628 \u00021.246 .218\nAge at start of spell (years) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u0002.792 \u0002.692 .492 4.512 3.640 .001\n1005\nIndustry:\nManufacturing . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u00024.552 \u0002.642 .523 \u000212.532 \u00021.633 .108\nResearch . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u00023.511 \u0002.351 .727 3.431 .316 .753\nFirm-provided contemporaneous turnover data . . . . . . . . . . . . . . . . . . . . . . . 9.432 1.154 .253 \u00025.098 \u0002.576 .567\nInterview year (1995 vs. 1994) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u000211.484 \u00021.382 .172 8.574 .952 .345\nConstant . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 22,922.940 1.383 .172 \u000217,123.540 \u0002.954 .344\nR2 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .494 .621\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .prob 1 F .001 .000\nAmerican Journal of Sociology\n1006\nthe first half of 1995).37 We transform revenues into the square root metric\nto deal with nonlinearities and to accommodate firms with zero revenues\nat either or both time points. The regressors include firm age at year T,\nthe time period to which turnover data pertain for the firm (1993–94 or\n1994–95), change in the organizational blueprint (number of dimensions,\n0–3), and employment growth (the ratio of employment in 1994 to 1993).\nThe last variable is included to control for the possibility that any observed\neffect of turnover on revenue growth reflects downsizing.\nTable 8 reports WLS estimates for the 54 companies with complete\ndata.38 The table reveals a significant negative effect of turnover on rev-\nenue growth, consistent with hypothesis 3. This effect of turnover is quite\nrobust across different specifications, functional forms, and measures of\nturnover.39 Thus, changes in the organizational model not only foster\nturnover, but that turnover appears to have adverse consequences for\norganizational performance, at least in the short run, consistent with the\necological perspective.\nISSUES OF CAUSALITY AND OMITTED VARIABLES\nThe available data do not permit definitive conclusions about the causal\nrelationships between model change, turnover rates, and organizational\nperformance. We cannot tell for sure when employment models changed\n(if they did), and hence causality could run in the other direction: firms\nexperiencing higher turnover might change their employment models in\nan effort to stem that turnover. Though we cannot rule out this competing\naccount, various pieces of evidence argue against it. First, recall that we\nfound that the (time-varying) effects of CEO succession on turnover tend\nto vanish once we control for model change. In other words, our time-\n37 Firms generally reported on turnover through the middle of the year in which they\nwere interviewed (1994 or 1995). Consequently, because the turnover rate reported for\nyear T pertains only to first half of that year, whereas the report for year pertainedT\u0002 1\nto an entire year, we weighted the rate for twice the rate for T in calculatingT\u0002 1\nour measure of average turnover.\n38 Not surprisingly, the revenue growth data are heteroscedastic, with larger error\nvariance among smaller firms, so we weight observations as a function of 1994 em-\nployment. Other weighting schemes, such as revenues at year T or employment av-\neraged over several years, produce comparable results, as do analyses that control for\nthe possibility of non-random missing data (detailed results available on request).\n39 In supplementary analyses, e.g., we also controlled for other potential determinants\nof organizational performance, such as changes in CEO, the fraction of the firm’s\nworkforce in sales occupations (and change in that fraction since founding), and\nwhether and for how long the firm had been public and\/or received venture capital\nfinancing. The basic results in table 8 were unchanged (detailed results available on\nrequest).\nLabor Pains\n1007\nTABLE 8\nDeterminants of Revenue Growth: WLS Regression\nVariable b b t P\nRevenues in $100,000 (square root), year T . . . . . . . . . . . . . 1.198 .939 31.426 !.001\nAverage annual turnover rate, years and T . . . . .T\u0002 1 \u0002.124 \u0002.094 \u00022.973 .005\nEmployment growth (ratio of year T to ) . . . . . . . .T\u0002 1 .989 .087 3.376 .002\nCEO’s vs. founder’s model: N dimensions changed . . . .541 .046 1.385 .173\nFirm age, year T . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u0002.210 \u0002.044 \u00021.649 .106\nIndicator for year T * . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u00021.309 \u0002.030 \u00021.087 .283\nConstant . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 2.529 1.811 .077\nNote.—Dependent variable is the square root of revenues (in $100,000s) for year . ObservationsT\u0001 2\n(Np54) weighted by 1994 employment size. Mean (SD) of dependent variable is 12.601 (11.7243), based\non weighted data. R2 p .970; adjusted R2 p .967.\n* ;1995p 1 1994p 0.\ninvariant measure of model change mediates the effects of the time-\nvarying measures of CEO succession and cumulative number of CEOs.\nThis suggests that executive succession disrupts organizations when it\nentails changes in employment blueprints. Second, study of respondent\ninterview transcripts reveals numerous mentions of changes in premises\n(“culture”) as being disruptive and divisive. But, we cannot find any men-\ntions of changes in premises in response to unacceptably high (or low)\nturnover.\nMoreover, several results in table 5 make no sense, in our view, under\nreverse causality. For instance, turnover is particularly high for changes\nfrom aberrant blueprints to autocracy (row 15b), from one nontype model\nto another (row 9), and from commitment or star to aberrant (row 7).\nFirms facing high turnover seem unlikely to have responded by under-\ntaking these particular transitions, whereas it is straightforward to un-\nderstand why these transitions might cause high turnover.\nWe also investigated whether the arrival of a new CEO, changes to\nthe organizational model, and high turnover might all arise because of\nsome unobserved crisis. We found that distinguishing spells in which a\nfirm’s employment declined by 10% or more does not alter materially the\npattern of findings we reported above, suggesting our results do not simply\ncapture large-scale downsizings.40 We also utilized qualitative information\nfrom interviews and surveys to code whether the founder reported that\nany of the following events occurred within a given firm–year spell: (1)\n40 As one might expect, there was moderate positive effect of current employment\ndecline (during the spell) on turnover (e.g., in a model only controlling for age, bp\n; ; ). However, the other covariates in our model capture many0.499 zp 2.158 Pp .031\nof the factors associated with the likelihood of decline, and controlling for those var-\niables weakens the effect ( ; ; ).bp 0.378 zp 1.451 Pp .147\nAmerican Journal of Sociology\n1008\nmajor downsizings or office closings; (2) general financial or legal turmoil,\nsuch as large losses, cash flow problems, market collapse, and law suits;\n(3) major executive changes; and (4) other executive changes (e.g., de-\nparture of a chief technical officer). All four dislocating events have pos-\nitive effects on turnover. Nonetheless, the effect of changing the organi-\nzational blueprint remains positive and highly significant even when we\ncontrol for these milestone events. Nor were the results appreciably\nchanged when we included controls for evidence of a change in business\nstrategy within the firm. These supplementary results offer some reas-\nsurance that our analyses do not overlook some major factor that produced\nthe observed associations between changes in employment blueprints,\nturnover, and organizational performance.\nCONCLUSION\nOrganizational theorists, particularly ecologists, have emphasized the dis-\nruptive effects of fundamental organizational change. Such change is\nthought to destabilize organizations primarily by altering the premises,\nvalues, and routines that organizational members have come to internalize\n(for a programmatic statement, see Hannan and Freeman [1984]). Ac-\ncordingly, we have tried to get closer to the mechanisms at the heart of\ntheories of organizational inertia, by (1) operationalizing the premises\n(employment models) on which founders built their new organizations,\n(2) measuring changes over time in those premises, (3) relating those\nchanges to employee turnover, and (4) exploring the effect of turnover on\norganizational performance. If altering organizational premises dislocates,\nthen this should be clearly manifested in turnover, especially among the\nmost senior employees within an organization. Turnover seems an espe-\ncially appropriate indicator of the disruptive effects of organizational\nchange within the setting we examined—high-technology companies in\nSilicon Valley—because retaining the key human assets in young tech-\nnology firms is often viewed by senior management, investors, and other\ninformed parties as a crucial requirement for organizational survival and\nsuccess.\nWe found considerable evidence that changing organizational blue-\nprints fuels employee turnover, which is concentrated disproportionately\namong old-guard employees. Turnover, in turn, adversely affects the\nability\nof young firms to grow their revenues (at least in the short run), a crucial\ndimension of performance for emerging technology companies. On bal-\nance, our results support the claim by neoinstitutionalists and organiza-\ntional ecologists (following Stinchcombe 1965) that cultural blueprints are\nLabor Pains\n1009\nsuperimposed by founders on nascent organizations, as well as ecologists’\nclaim that altering such blueprints is disruptive and destabilizing.\nA broad conclusion of this analysis, and of others using the SPEC data,\nis that origins matter. Future research should devote more attention to\nconceptualizing and measuring how cultural blueprints are selected and\nimprinted on organizations during their infancy; how they are sustained,\nmodified, or discarded over time. Such studies would not only sharpen\norganizational theory but also shed light on some important real-world\nissues, such as the conditions under which firms find it relatively easy or\ndifficult to merge or to transplant a particular organizational model into\na new country or line of business. Moreover, additional work along these\nlines is needed to gauge whether our two main findings—that changes in\nemployment blueprints fuel turnover in Silicon Valley high-tech start-ups,\nand that turnover in turn adversely affects organizational perform-\nance—generalize to other organization-building activities, other kinds of\nenterprises, other environments, and other stages of organizational\ndevelopment.\nHowever, pursuing this research agenda will require some adjustments\nto conventional research methodology. It obviously requires collecting\nobservations that pertain to multiple points in time, beginning at the\norigins of the enterprise. It also requires analyzing the resulting panel\ndata in non-standard ways. As we noted above, the current standard in\nanalyzing panel data on organizations is a fixed-effects approach. How-\never, each organization’s initial conditions are constant over its history.\nThus, origins are swept out of the picture in a fixed-effects analysis. What\nseems needed is to employ analytic methods, such as those used in this\narticle, that allow flexible specification of models in which both fixed and\nage-varying characteristics affect levels and changes in outcomes of in-\nterest. Further development and refinement of such approaches should\nbe high on the agenda for organizational analysis.\nOur detailed analyses of firms’ transitions suggest that the disruptive\neffects of changing organizational blueprints depend significantly on firms’\norigin and destination states. Abandoning a coherent model proved to be\nparticularly destabilizing, especially if the founder embraced the com-\nmitment or star model, but not if the firm migrated away from bureauc-\nracy or autocracy. Similarly, firms experienced markedly different turn-\nover rates in transitioning to particular destination states, such as\nbureaucracy, as a function of their initial blueprint. The engineering\nmodel, in contrast, appeared to be relatively more flexible and adaptable\n(i.e., easier to dismantle and easier to migrate to) than various other mod-\nels. Perhaps this offers some insight into its widespread prevalence in\nSilicon Valley. Not only does the engineering model seem to be a relatively\nhospitable origin and destination state, but retaining that model over time\nAmerican Journal of Sociology\n1010\nmight also expose firms to less severe forms of misalignment than, say,\nretaining the commitment or star or autocratic model. Put differently, the\nengineering model might have less upside but also less downside risk,\ncompared to more fragile and distinctive models, such as the commitment\nor star blueprint, which entail greater potential returns and risks. Organ-\nizational ecologists might profitably examine how different blueprints or\nmodels fare competitively under different environmental circumstances.\nScholars and practitioners alike extol the virtues of creating and sus-\ntaining a coherent and consistent system of practices concerning employ-\nment relations. Yet our results suggest that complementarity, consistency,\nand salience are not unqualified assets for an organizational model. Those\nvery same attributes might help explain, for instance, the high turnover\nthat firms experienced when moving to bureaucracy or autocracy: if Sil-\nicon Valley “techies” tend to dislike bureaucracy and autocracy, they dis-\nlike them most in their purest, most consistent, and most salient incar-\nnations. We still know remarkably little about the parameters and\nconsequences of consistency: what determines the degree to which a sys-\ntem of beliefs or HR practices gets perceived as consistent, and how\/when\norganizations specifically benefit from such consistency (for a notable ex-\nception, see Ichniowski, Shaw, and Prennushi [1997]).\nMoreover, achieving and sustaining consistency in employment systems\nraises complicated dynamic trade-offs. Some transition paths from foun-\nder’s to CEO’s blueprint seem to be particularly disruptive for organi-\nzations, underscoring the point that organizational design should attend\nto more than just getting the model “right.” It should also balance the\nbenefits of getting the right model against the costs associated with tran-\nsitioning to that model. As an organization and its environment change,\nthe merits of a given model are likely to change as well. However, the\neconomic, social, and psychological costs associated with dismantling the\nprevious blueprint and implementing a new one might outweigh the con-\ntent advantages offered by the new blueprint. Hence, in some ecologies\nand for some strategies, adhering faithfully to a second-best (or even third-\nbest) model might be superior to rapid oscillation among shorter-lived,\nfirst-best models. This issue of balancing stability versus change—and\nweighing the benefits of altering organizational arrangements against the\nadjustment costs involved in making those changes—has received little\nattention from organizational analysts and those interested in employment\nsystems and human resource practices. The strong complementarities\namong elements of a firm’s employment system, coupled with employees’\nstrong emotional attachments to personnel practices, might make these\ntrade-offs particularly complex in the domain of human resource man-\nagement. Future research should examine these trade-offs and how they\nLabor Pains\n1011\nvary across types of organizations, environments, and employment\npractices.\nREFERENCES\nBarnett, William P., and Glenn R. Carroll. 1995. “Modeling Internal Organizational\nChange.” Annual Review of Sociology 21:217–36.\nBaron, James N., M. Diane Burton, and Michael T. Hannan. 1996. “The Road Taken:\nThe Origins and Evolution of Employment Systems in Emerging High-Technology\nCompanies.” Industrial and Corporate Change 5:239–76.\n———. 1999. “Engineering Bureaucracy: The Genesis of Formal Policies, Positions,\nand Structures in High Technology Firms.” Journal of Law, Economics, and\nOrganization 15:1–41.\nBaron, James N., Michael T. Hannan, and M. Diane Burton. 1999a. “Building the\nIron Cage: Determinants of Managerial Intensity in the Early Years of\nOrganizations.” American Sociological Review 64:527–47.\n———. 1999b. “Determinants of Managerial Intensity in the Early Years of\nOrganizations.” Research Paper no. 1550. Stanford University, Graduate School of\nBusiness.\nBaron, James N., and David M. Kreps. 1999. Strategic Human Resources: Frameworks\nfor General Managers. New York: Wiley.\nBurton, M. Diane. 1995. The Evolution of Employment Systems in High Technology\nFirms. Ph.D. dissertation. Stanford University, Department of Sociology.\n———. 1999. “Employment Models in Entrepreneurial Companies.” Manuscript.\nHarvard University, Harvard Business School.\n———. 2001. “The Company They Keep: Founders’ Models for Organizing High-\nTechnology Firms.” In The Entrepreneurship Dynamic, edited by Claudia Bird\nSchoonhoven and Elaine Romanelli. Stanford, Calif.: Stanford University Press, in\npress.\nCarroll, Glenn R., and Michael T. Hannan. 2000. The Demography of Corporations\nand Industries. Princeton, N.J.: Princeton University Press.\nCarroll, Glenn R., and J. Richard Harrison. 1998. “Organizational Demography and\nCulture: Insights from a Formal Model and Simulation.” Administrative Science\nQuarterly 43:637–67.\nEdwards, Richard C. 1979. Contested Terrain: The Transformation of the Workplace\nin the Twentieth Century. New York: Basic Books.\nFligstein, Neil. 1987. “The Intraorganizational Power Struggle: The Rise of Finance\nPresidents in Large Corporations.” American Sociological Review 52:44–58.\n———. 1990. The Transformation of Corporate Control. Cambridge, Mass.: Harvard\nUniversity Press.\nFligstein, Neil, and Haldor Byrkjeflot. 1996. “The Logic of Employment Systems.” Pp.\n11–35 in Social Differentiation and Social Inequality, edited by James N. Baron,\nDavid B. Grusky, and Donald J. Treiman. Boulder, Colo.: Westview Press.\nFriedman, Stewart D., and Kathleen Saul. 1991. “A Leader’s Wake: Organization\nMember Reactions to CEO Succession.” Journal of Management 17:617–42.\nGreenhouse, Steven. 1999. “Angered by H.M.O.’s Treatment, More Doctors Are Joining\nUnions.” New York Times (February 4): A1, A25.\nGuille´n, Mauro F. 1994. Models of Management: Work, Authority, and Organization\nin a Comparative Perspective. Chicago: University of Chicago Press.\nHannan, Michael T. 1998. “Rethinking Age Dependence in Organizational Mortality:\nLogical Formalizations.” American Journal of Sociology 104:85–123.\nHannan, Michael T., M. Diane Burton, and James N. Baron. 1996. “Inertia and Change\nAmerican Journal of Sociology\n1012\nin the Early Years: Employment Relations in Young, High-Technology Firms.”\nIndustrial and Corporate Change 5:503–36.\nHannan, Michael T., and John Freeman. 1984. “Structural Inertia and Organizational\nChange.” American Sociological Review 49:149–64.\nHuber, Peter J. 1967. “The Behavior of Maximum Likelihood Estimates under Non-\nStandard Conditions.” Pp. 221–33 in Proceedings of the Fifth Berkeley Symposium\nin Mathematical Statistics, and Probability, edited by Lucien M. Le Cam and Jerzy\nNeyman. Berkeley and Los Angeles: University of California Press.\nIchniowski, Casey, Kathryn Shaw, and Giovanna Prennushi. 1997. “The Effects of\nHuman Resource Management Practices on Productivity: A Study of Steel Finishing\nLines.” American Economic Review 87:291–313.\nKesner, Idalene F., and Dan R. Dalton. 1994. “Top Management Turnover and CEO\nSuccession : An Investigation of the Effects of Turnover on Performance.” Journal\nof Management Studies 3:701–13.\nLiang, Kung-Yee, and Scott L. Zeger. 1986. “Longitudinal Analysis Using Generalized\nLinear Models.” Biometrika 73:13–22.\nMilgrom, Paul, and John Roberts. 1992. Economics, Organization, and Management.\nEnglewood Cliffs, N.J.: Prentice-Hall.\n———. 1995. “Complementarities and Fit: Strategy, Structure, and Organizational\nChange in Manufacturing.” Journal of Accounting and Economics 19:179–208.\nMobley, William H. 1982. Employee Turnover: Causes, Consequences, and Control.\nReading, Mass.: Addison-Wesley.\nPfeffer, Jeffrey. 1983. “Organizational Demography.” Pp. 299–357 in Research in\nOrganizational Behavior, vol. 5. Edited by L. L. Cummings and Barry M. Staw.\nGreenwich, Conn.: JAI Press.\nPrice, James L. 1977. The Study of Turnover. Ames: Iowa State University Press.\nSaxenian, AnnaLee. 1994. Regional Advantage: Culture and Competition in Silicon\nValley and Route 128. Cambridge, Mass.: Harvard University Press.\nShenhav, Yehouda. 1995. “From Chaos to Systems: The Engineering Foundations of\nOrganization Theory, 1879–1932.” Administrative Science Quarterly 40:557–85.\nStataCorp. 1999. Stata Statistical Software: Release 6.0. College Station, Tex.: Stata\nCorporation.\nStaw, Barry M. 1980. “The Consequences of Turnover.” Journal of Occupational\nBehavior 1:253–73.\nStinchcombe, Arthur L. 1965. “Social Structure and Organizations.” Pp. 142–93 in\nHandbook of Organizations, edited by James G. March. Chicago: Rand McNally.\nVirany, Beverly, Michael L. Tushman, and Elaine Romanelli. 1992. “Executive\nSuccession and Organization Outcomes in Turbulent Environments: An\nOrganization Learning Approach.” Organization Science 3:72–91.\nWhite, Halbert. 1982. “Maximum Likelihood Estimation of Misspecified Models.”\nEconometrica 50:1–25.\nZeger, Scott L., and Kung-Yee Liang. 1986. “Longitudinal Data Analysis for Discrete\nand Continuous Outcomes.” Biometrics 42:121–30.\n"}