{"doi":"10.1063\/1.2173046","coreId":"101058","oai":"oai:epubs.surrey.ac.uk:463","identifiers":["oai:epubs.surrey.ac.uk:463","10.1063\/1.2173046"],"title":"Near edge x-ray absorption fine structure study of aligned pi-bonded carbon structures in nitrogenated ta-C films","authors":["Roy, SS","McCann, R","Papakonstantinou, P","McLaughlin, JA","Kirkman, IW","Bhattacharyya, S","Silva, SRP"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-02-15","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:463<\/identifier><datestamp>\n      2017-10-31T13:58:18Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/463\/<\/dc:relation><dc:title>\n        Near edge x-ray absorption fine structure study of aligned pi-bonded carbon structures in nitrogenated ta-C films<\/dc:title><dc:creator>\n        Roy, SS<\/dc:creator><dc:creator>\n        McCann, R<\/dc:creator><dc:creator>\n        Papakonstantinou, P<\/dc:creator><dc:creator>\n        McLaughlin, JA<\/dc:creator><dc:creator>\n        Kirkman, IW<\/dc:creator><dc:creator>\n        Bhattacharyya, S<\/dc:creator><dc:creator>\n        Silva, SRP<\/dc:creator><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2006-02-15<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/463\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Roy, SS, McCann, R, Papakonstantinou, P, McLaughlin, JA, Kirkman, IW, Bhattacharyya, S and Silva, SRP  (2006) Near edge x-ray absorption fine structure study of aligned pi-bonded carbon structures in nitrogenated ta-C films   JOURNAL OF APPLIED PHYSICS, 99 (4), ARTN 0.       <\/dc:identifier><dc:relation>\n        10.1063\/1.2173046<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/463\/","10.1063\/1.2173046"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"JOURNAL OF APPLIED PHYSICS 99, 043511 \u00012006\u0002Near edge x-ray absorption fine structure study of aligned \u0001-bonded\ncarbon structures in nitrogenated ta-C films\nS. S. Roy, R. McCann, P. Papakonstantinou,a\u0001 and J. A. McLaughlin\nNRI, School of Electrical and Mechanical Engineering, University of Ulster at Jordanstown, Newtownabbey\nCounty, Antrim BT37 OQB, Northern Ireland, United Kingdom\nI. W. Kirkman\nSERC, Daresbury Laboratory, CCLRC, Warrington, Cheshire WA4 4AD, England, United Kingdom\nS. Bhattacharyya and S. R. P. Silva\nNano-Electronics Centre, Advanced Technology Institute, School of Electronics and Physical Sciences,\nUniversity of Surrey, Surrey GU2 7XH, England, United Kingdom\n\u0001Received 28 April 2005; accepted 3 January 2006; published online 22 February 2006\u0002\nPolarization dependent studies of near edge x-ray absorption fine structure \u0001NEXAFS\u0002 show\nevidence for the presence of aligned \u0001-bonded carbon structures and the formation of a nonplanar\nCN phase in tetrahedral amorphous nitrogenated carbon \u0001ta-CN\u0002 films deposited at room\ntemperature. Moreover, the analysis of NEXAFS data as a function of nitrogen concentration and\nannealing temperature leads to a comprehensive assignment of the local CN bonding configurations\nin these ta-CN films and suggests an unusual and almost thermally stable nitrogenated carbon\nstructure. © 2006 American Institute of Physics. \u0003DOI: 10.1063\/1.2173046\u0004I. INTRODUCTION\nDuring the last decade, many attempts have been made\nto synthesize the crystalline phase of carbon nitride \u0001CNx\u0002\nfilms, based on the theoretically predicted superior mechani-\ncal properties of \u0002-C3N4 in comparison with those of\ndiamond.1 On the other hand, tetrahedral amorphous carbon\nnitride \u0001ta-CN\u0002 films having excellent properties such as high\nhardness, low friction, and chemical inertness,2–4 have at-\ntracted technologically important industries, such as protec-\ntive coatings for magnetic storage devices and electron field\nemission devices.5–7 However, to date, there also exists a\nmajor difficulty in identifying the local structure of ta-CN\nfilms due to the complexity of the different hybridizations\npresent. The Raman and infrared spectroscopies have often\nbeen used to determine the structure of CNx films,8–11 but the\ninformation gathered has been qualitative and limited and\ntherefore, more detailed studies of the local bonding configu-\nrations within ta-CN films using near edge x-ray absorption\nfine structure \u0001NEXAFS\u0002 spectroscopy are needed.12–19 De-\nspite little or no evidence for a crystalline phase of \u0002-C3N4\nbeing established, the debate on the possible substitutional\nand nonsubstitutional structures of CNx films continues.20 In\nparallel, for a long time researchers have attempted to estab-\nlish aligned \u0001-bonded structures in amorphous carbon films\nby several means such as thermal annealing, ion irradiation,\nand nitrogen incorporation.20,21 In this way the development\nof local structures or aligned configurations has been at-\ntempted, in which NEXAFS played an important role on\nsupporting these claims.13,21 In nitrogenated diamondlike or\nta-CN films grown at room temperature, the evidence for\noriented graphitic or aligned \u0001-bonded carbon structures is\na\u0002Author to whom correspondence should be addressed; electronic mail:\np.papakonstantinou@ulster.ac.uk\n0021-8979\/2006\/99\u00024\u0001\/043511\/5\/$23.00 99, 04351\nDownloaded 11 May 2009 to 131.227.178.132. Redistribution subject tyet to be established. In this report, using angular depen-\ndence NEXAFS analysis we show that even though nitrogen\ndoes not form any oriented \u0001or aligned and planar\u0002 CvN\nbonding configurations, an oriented graphitic carbon struc-\nture in the films grown at room temperature is very likely. In\naddition, we propose different features of the structure of\nhard ta-CN films prepared within a range of nitrogen concen-\ntrations at room temperature and demonstrate its thermal sta-\nbility through vacuum annealing.\nII. EXPERIMENT\nThe ta-CN films containing increasing concentrations of\nnitrogen \u00010\u0003x\u000312.5\u0002 were deposited using a filtered ca-\nthodic vacuum arc \u0001FCVA\u0002 technique. An arc current of 80 A\nunder floating conditions was used to synthesize films of a\nthickness range between 75 and 100 nm. Details of the depo-\nsition technique can be found in a previous literature.10 Fol-\nlowing deposition, the highest nitrogen content films \u000112.5\nat. %\u0002 were subjected to rapid thermal annealing at tempera-\ntures ranging from 500 to 750 °C for 2 min, and then cooled\nto room temperature by flowing argon gas. NEXAFS mea-\nsurements were performed at station 1.1 of the synchrotron\nradiation source facility, at Daresbury Laboratory, UK. The\nspectra at the C K edge and N K edges were recorded in the\ntotal electron yield mode and were normalized to the signal\nfrom a gold covered grid, recorded simultaneously. The reso-\nlutions of the beam line were 0.1 and 0.2 eV at the C K and\nN K edges, respectively. The jump of the C and N K edges at\nthe ionization potential was fitted by an erf function multi-\nplied by an exponential decay function, described by the fol-\n12lowing equation:\n© 2006 American Institute of Physics1-1\no AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\n043511-2 Roy et al. J. Appl. Phys. 99, 043511 \u00022006\u0001Istep = H\u00050.5 + 0.5 erf\u0006 \u0001E − P\u0002W\/C \u0007\b\n\u0004\texp − \u0003d\u0001E − P − W\u0002\u0004\n E\u0005 P + W , \u00011\u0002\nwhere H is the height of the function immediately above the\nstep, E is the independent variable energy, P the position of\nthe inflection point of the step \u0001290 eV\u0002, W is the full width\nat half maximum \u0001FWHM\u0002 of the step, d is the exponential\ndecay coefficient, and C is a constant defined by c=2\u000bln 4.\nAlthough the ionization potential may be different for\nsamples containing very different values of nitrogen, for sim-\nplicity it was considered as a constant. After subtracting the\nrespective ionization jumps at both C K and N K edges, the\nresulting spectra were decomposed into several Gaussian\npeaks. In particular, the \u0006* areas were fitted by asymmetric\nGaussian peaks.\nIII. RESULTS AND DISCUSSION\nWe have analyzed the effect of \u0001i\u0002 nitrogen concentration\nand \u0001ii\u0002 thermal annealing on the structure of ta-CN films.\nHowever, we focus our study on the polarization dependence\nof NEXAFS for ta-CN films having \f12.5 at. % nitrogen\nconcentration. The microstructure of these samples was also\nanalyzed by Raman spectroscopy where the narrowing of the\nG linewidth and the increase of ID\/IG ratio with nitrogen\nincorporation denoted an increase in the sp2 fraction, as it is\nrelated to the bond angle disorder at sp2 sites.8–11,22\nA. Effect of nitrogen concentration\nThe normalized C K edge spectra of ta-CN films, as a\nfunction of nitrogen content, are presented in the inset of Fig.\n1. All spectra were normalized at the maximum height for\ncomparison purposes. Two main features are identified in the\nC K edge spectra: \u0001i\u0002 a sharp preedge peak \u0001285 eV\u0007E\n\u0007288 eV\u0002 known as \u0001* peak, due to the transitions from the\norbital 1s to different \u0001* levels and \u0001ii\u0002 a broader resonance\nat photon energy E\u0005293 eV corresponding to transitions\nfrom the 1s to empty \u0006* states of sp3 ,sp2, and sp sites. It is\nquite difficult to distinguish the \u0006* states as we have ob-\n*\nFIG. 1. Intensity ratio of \u0001* \/\u0006* peak at C K edge with nitrogen concentra-\ntion. Inset: Variation of C K-edge spectrum with nitrogen concentration.served \u0001Fig. 1\u0002 a broad \u0006 feature that arises from a super-\nDownloaded 11 May 2009 to 131.227.178.132. Redistribution subject tposition of the signatures of many different configurations\n\u0001C–C, CvC,CwC,CwN,CvN, and C–N\u0002 in the matrix.\nThe sharp \u0001* peak in carbon nitride films principally origi-\nnates from CvC and CvN bonds.\nThe intensity ratio of \u0001* \/\u0006* peak at the C K edge, as a\nfunction of nitrogen content, is shown in Fig. 1. The \u0001* \/\u0006*\nratio in the C K edge presents the relative contribution from\nCvC,CvN,CwC \u0001if present\u0002, and CwN \u0001if present\u0002 to\nthe all possible \u0006* states. This ratio is used to estimate the\nsp2 domain configurations in amorphous carbon network.\nThe error in the value of pi* \/ sigma* ratio arises from the\nuncertainty in the fitting of the pi* and sigma* peaks. For\nfilms having low nitrogen content the \u0001* \/\u0006* ratio did not\nchange significantly. However, for films containing high ni-\ntrogen concentration, we noticed a clear increase in the\n\u0001* \/\u0006* ratio. It appears that for lower nitrogen content\n\u0001\u00077 at. % \u0002, the concentration of CvC and CvN relative\nto C–C and C–N bonds does not vary significantly, which in\nturn keeps the \u0001* \/\u0006* ratio unaffected \u0001Fig. 1\u0002. In fact, at the\nhigher N content films, both the sp2 cluster size and distri-\nbution of sp2 domain in the sp3 matrix change due to the\nformation of CN bonds. The increase of \u0001* \/\u0006* ratio in the\nfilms having 10.6 and 12.5 at. % nitrogens is a signature of\nthe formation of a graphitelike structure. We can also ob-\nserve \u0001Fig. 1\u0002 that the \u0001* peak width increases at higher\nnitrogen content films, indicating a fall of sp3 bonding. The\nsmall peak around 289.5 eV in the films with 12.5 at. % N\nmay originate from contamination related to either 1s\n→\u0001*\u0001C–H\u0002 or 1s→\u0001*\u0001CvO\u0002 transitions.12,23\nThe normalized N K edge NEXAFS spectra of ta-CN\nfilms, as a function of nitrogen content, are shown in Fig.\n2\u0001a\u0002. From Fig. 2\u0001a\u0002 we see that with increasing nitrogen\ncontent, the intensity of the \u0001* peak becomes higher. Two\nwell-resolved peaks, denoted as N1 and N2, are observed in\nthe energy range of 399–403 eV for all films and an addi-\ntional peak denoted as N3 was clearly observed for the\nhigher N content films \u0003Fig. 2\u0001a\u0002\u0004. These three resonance\npeaks were previously observed by several authors12–17 and\nseem to be typical in a-CN films with moderate nitrogen\nconcentrations. These N1–N3 peaks in the N K edge indicate\n\u0001* bonding in three different environments. However, there\nis no unanimity in their assignment.18 The assignments, re-\nported in the literature, were mainly based on studying\nmodel compounds such as pyridines, pyrroles, and nitrogen\nmolecules. The peaks N1, N2, and N3 are suggested to be\ndue to CvN,CwN, and substitutional nitrogen in graphite,\nrespectively,13,17 however, for some cases due to the complex\nbonding environments in a-C:N films these assignments\nwere not very clear.14,18 It has also been suggested that the\npeak N1 is related to the constrained CN bonds, the peak N2\nto the pyridinelike double bonds, and the N3 to the presence\nof nitrogen atoms inside the graphite domains.16,24 Alterna-\ntively, these three peaks were considered to originate from a\npyridinelike structure due to bonding, antibonding, and split-\nting states.12 In the following section, we will discuss how\nthese peaks change with N content and try to assign the\nbonding status of each of them.\nThe intensity of each \u0001* peak \u0001N1, N2, and N3\u0002 to \u0006*\npeak, as a function of nitrogen content, is shown in Fig. 2\u0001b\u0002.\no AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\n043511-3 Roy et al. J. Appl. Phys. 99, 043511 \u00022006\u0001All ratios increase with the N at. % indicating an increase of\nCvN bonds, graphitelike N substitutional bonds and C\nwN bonds, if present. An increase of nitrogen concentration,\nhence an increase of nitrogen related features at the N K\nedges is responsible for the increase of these ratios. We as-\nsign the peak N1 to CvN bonds as reported by several\nauthors.13,17 The origin of the peak N2 is difficult to assign,\nhowever, it could well be due to pyridinelike orbital splits12\nor N bonded to C with different functionalities.18 It is well\nknown that the formation of CwN bond is not favorable in\nlower N at. % films. We ruled out the possibility of the peak\nN2 being attributed to CwN bonding as it is clear from Fig.\n2\u0001a\u0002 that the relative intensity of peak N2 to N1 decreases in\nhigher N films, which may not be acceptable if we assign the\npeak N2 to CwN bond. The peak N3 could be due to sub-\nstitutional nitrogen in graphite structures or aromatic\nrings.13,17 The peak N3 appears at higher N content films\nindicating that graphitelike N substitution is not favorable at\nlower N concentrations. The increase of the intensity ratio of\nN3\/\u0006* indicates the formation of a graphitelike structure at\nthe higher N content films. The decrease of film hardness\n\u0003see Fig. 2\u0001c\u0002\u0004 supports the formation of slightly graphitic\nFIG. 2. \u0001a\u0002 Variation of N K edge spectrum with nitrogen concentration in\nthe films. \u0001b\u0002 Intensity ratio of \u0001* \/\u0006* peak at N K edge with nitrogen\nconcentration. \u0001c\u0002 Variation of film hardness with nitrogen concentration.structure in these films at high nitrogen concentration. We\nDownloaded 11 May 2009 to 131.227.178.132. Redistribution subject tpresent more discussions on the assignment of N1–N3 peaks\non the basis of annealing experiments in Sec. III C.\nB. Angular dependence\nA variation of the dipole transition intensity C1s→\u0001* or\n\u0006* peak with the angle between the electric field polarization\nvector E and the normal to the plane of graphitic structure \u0001if\nany\u0002 in the films can determine the spatial orientation of\ncarbon structures \u0001with respect to the incident x-ray beam\u0002.\nFigure 3 presents the angular dependence of the C K edge for\nCNx films containing 12.5 at. % nitrogen and Fig. 4 illus-\ntrates three representative decomposed C K edge spectra.\nThe direction of the incident beam or the electric polarization\nvector was varied with respect to the orientation of the thin\nfilm specimen and spectra recorded for incident angles \u0001\b\u0002\nbetween 10° and 90° \u0001Fig. 3, left inset\u0002. The increase of the\nfirst peak \u0001C1\u0002, a signature of graphite \u0001* resonance, with\npolarization confirms the presence of oriented graphitic\nstructures in the film, which is aligned almost normal to the\nFIG. 3. Angular dependence of the C K edge of a ta-CN film containing\n12.5 at. % N.\nFIG. 4. Deconvoluted C K peaks for angles \u0001a\u0002 10, \u0001b\u0002 55, and \u0001c\u0002 90 deg,\nrespectively, of a ta-CN film containing 12.5 at. % N. On the left compart-\nment the solid line represents the resulting difference curve and the dotted\nline the fitted ionization step function.\no AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\n043511-4 Roy et al. J. Appl. Phys. 99, 043511 \u00022006\u0001plane of the sample. By increasing \b, the intensity of the\n\u0001\u0001CvC resonance referred as C1 in Fig. 4 increases. At nor-\nmal incidence of x ray, E is parallel to the substrate surface\nand along the axis of \u0001* orbitals. Hence the \u0001* resonance\nintensity will be the highest at normal incidence. On the\nother hand, at glancing angle, E is orthogonal to the \u0001* or-\nbitals and has only a small projection onto the \u0001* orbitals,\nyielding a minimum intensity of the \u0001* resonance peak. This\ntrend is opposite to the recently reported work for highly\noriented pyrolytic graphite \u0001HOPG\u0002,21,25 namely, an inverse\ndependence of the \u0001* intensity with increasing incidence\nangle.\nThe second resonance C2 does not correspond to\nCvC \u0001* but randomly oriented CN. As a result no signifi-\ncant change of the second peak with polarization has been\nobserved. The peak C3 attributed to a \u0006* transition of the\nCuH bonds that would originate from the absorption of\nhydrocarbon to the surface dangling bonds.26 Since \u0006* orbit-\nals are orthogonal to the \u0001* orbitals an opposite trend of the\nintensity of the peaks with polarization is observed.\nNo clear evidence of oriented pyridine structure has been\nobserved from the position and relative intensities of the N K\nedge \u0001* peaks \u0001not shown here\u0002. Also an absence of any\nsignificant polarization dependent variation of the N K edge\nsuggests that nitrogen could be present only within a ran-\ndomly oriented \u0001-bonded structure or nonplanar carbon\nstructures in these films. As the relative intensity of the\nN1–N3 peaks does not match with a pyridine molecule struc-\nture, a very distorted or nonplanar molecular structure is ex-\npected. This is ultimately a nondoping configuration.15 How-\never, it was clearly demonstrated that some amount of\ngraphitization of ta-CN films from Raman and x-ray photo-\nemission \u0001XPS\u0002 studies, which resulted in a slight decrease\nof the film hardness for high nitrogen concentrations \u0003Fig.\n2\u0001c\u0002\u0004.10\nThe presence of the third peak \u0001C3\u0002 at the C K edge was\nnot prominent at 0 at. % nitrogen films, which, however, is\nintensified with nitrogen concentration. Also an opposite an-\ngular dependence of C3 peak, which may be assigned to the\nsurface defect,26 compared with the C1 peak can be found.\nBesides, these results confirm that the C3 peak could be re-\nlated to the \u0006* transition.26 Our angular dependence result\nclearly reflects that the surface dangling bond \u0006\u0001C–H is also\nnot randomly oriented.\nC. Thermal annealing\nAn important property of ta-CN films is its thermal sta-\nbility, with several studies being carried out on the structural\nchanges taking place during annealing. Observations such as\nan increase in crystalline content and a relief of compressive\nstress within the films have been reported.8,27 NEXAFS stud-\nies on thermally annealed samples could further provide an\ninsight on the local electronic structure of the nitrogenated\nfilms.\nThe normalized NEXAFS C K- and N K edge spectra of\na ta-CN film containing 12.5 at. % N as a function of anneal-\ning temperature are illustrated in Figs. 5 and 6\u0001a\u0002, respec-\ntively. One may note that the room-temperature spectrum of\nDownloaded 11 May 2009 to 131.227.178.132. Redistribution subject tthe C K edge is not exactly the same as that presented for the\n12 at. % N ta-CN film, in Figs. 1 and 3. The surface con-\ntamination peak observed at 289.5 eV in Figs. 1 and 3 is\nabsent in Fig. 5. The reason for this inconsistency is that the\nspectra in Fig. 5 were taken on a different sample, deposited\nunder the same conditions. Plotted in the inset of Fig. 5 is the\nintensity ratio of the \u0001* \/\u0006* peak at the C K edge as a func-\nFIG. 5. Variation of C K edge spectra of a ta-CN film containing 12.5 at. %\nN with annealing temperature. Inset: \u0001* \/\u0006* peak intensity as a function of\ntemperature.\nFIG. 6. \u0001a\u0002 Variation of N K edge spectra of a ta-CN film containing 12.5\nat. % N with annealing temperature. \u0001b\u0002 Variation of relative intensity ratios\n*of \u0001 peak at N K edge with annealing temperature.\no AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\n043511-5 Roy et al. J. Appl. Phys. 99, 043511 \u00022006\u0001tion of annealing temperature. A clear trend has emerged in\nwhich the intensity ratio is enhanced as the annealing tem-\nperature is increased. This trend can be explained by a lower\ncontribution from the \u0006* states due to the decrease in the sp3\nC–C and sp3 C–N bonds as the temperature is raised. An-\nother reason is due to the increase in the graphitelike CN\nbonds which have enhanced the intensity of the \u0001* resonance\nas well as an increase in the percentage of sp2 CvC bonds\ncompared with the sp3 bonds. A shift of 0.3 eV for the \u0001*\npeak position was also observed as the temperature increased\nto 700 °C and is attributed to the formation of a graphitelike\nstructure. We can also see in Fig. 6\u0001a\u0002 that the \u0006* features\nbecome narrower as the temperature is increased, indicating\na fall in sp3 bonding percentage. The tiny peak located at\n289.3 eV originates from either 1s→\u0001*\u0001C–H\u0002 or 1s\n→\u0001*\u0001CvO\u0002 transitions.24 In a recent study we attempt to\nexplain the N1–N3 peaks at the N K edge for a batch of\nsimilar films.28 From this study N3 has been clearly assigned\nto the distorted graphitic CvN structure based on the in-\ncrease of the peak with annealing temperature.\nFigure 6\u0001a\u0002 shows the evolution of N1, N2, and N3\npeaks of the N K edge spectra as a function of temperature.\nIn the following section, we will discuss how these peaks\nchange with annealing temperature and try to find out their\norigin from the temperature behavior. Figure 6\u0001b\u0002 shows the\nrelative intensity of each peak \u0001peaks N1, N2, and N3\u0002 re-\nferred to the total intensity N1+N2+N3 as a function an-\nnealing temperature. We can see that several interesting pat-\nterns have emerged. As the temperature is increased the\nrelative intensity of the N1 peak decreases, the intensity of\nN3 peak increases, whereas the N2 peak did not show any\nwell-defined trend. The increase of the relative intensity of\nN3 peak indicates the formation of graphitelike structure\nwith annealing temperature. The decrease of N1 peak implies\nthat the CvN bond contribution is suppressed by the high\ntemperature. As the temperature is increased the N is driven\nout of the film, which causes the lowering of CvN bonds\nand the endorsement of a richer graphitelike structure. By\nthermal annealing the degree of graphitization in the films\nincreases and a small amount of nitrogen diffuses out from\nthe bonded matrix. This is also supported by the narrowing\nof the \u0006* features at the N K edge indicating a clear loss of\nC–N bonds. Interestingly, the degree of graphitization is not\nvery high up to 500 °C suggesting that these films are almost\nthermally stable at that temperature.\nIV. CONCLUSIONS\nIn this article we proposed how a modified structure of\nta-C films can be obtained by nitrogen addition through an in\ndepth analysis of NEXAFS spectra and proper assignment of\nthe peaks at N K edge for a batch of films prepared with\ndifferent nitrogen concentrations. Nitrogen addition in the\nta-C films produces almost thermally stable sp3 CN or dis-\ntorted sp2 CN structures, with some oriented sp2 C. How-\never, in the present case nitrogen atoms do not contribute to\nDownloaded 11 May 2009 to 131.227.178.132. Redistribution subject taligned CNx structures, contrary to the previous\nobservations.20,21 Therefore, present results verify the forma-\ntion of oriented CvC structure in nitrogenated ta-C films\nwithout any high energetic thermal treatment of the films.\n1A. Y. Liu and M. L. Cohen, Science 24, 841 \u00011989\u0002.\n2H. Sjöström, S. Stafström, M. Boman, and J. E. Sundgren, Phys. Rev. Lett.\n75, 1336 \u00011995\u0002.\n3N. Hellgren, M. P. Johansson, E. Broitman, L. Hultman, and J. E.\nSundgren, Phys. Rev. B 59, 5162 \u00011999\u0002.\n4H. Sjöström, L. Hultman, J. E. Sundgren, S. V. Hainsworth, T. F. Page, and\nG. S. A. M Thunissen, J. Vac. Sci. Technol. A 14, 56 \u00011996\u0002.\n5G. A. J. Amaratunga and S. R. P. Silva, Appl. Phys. Lett. 68, 2529 \u00011996\u0002.\n6W. Xu, T. Fujimoto, L. Wang, T. Ohchi, and I. Kojima, J. Vac. Sci. Tech-\nnol. A 22, 6 \u00012003\u0002.\n7V. S. Veerasamy, J. Yuan, G. A. J. Amaratunga, W. I. Milne, K. W. Gilkes,\nM. Weiler, and L. M. Brown, Phys. Rev. B 48, 17954 \u00011993\u0002.\n8A. C. Ferrari, S. E. Rodil, and J. Robertson, Phys. Rev. B 67, 155306\n\u00012003\u0002.\n9K. W. R. Gilkes, S. Prawer, K. W. Nugent, J. Robertson, H. S. Sands, Y.\nLifshitz, and X. Shi, J. Appl. Phys. 87, 7283 \u00012000\u0002.\n10S. S. Roy, P. Papakonstantinou, R. McCann, G. Abbas, J. P. Quinn, and J.\nMcLaughlin, Diamond Relat. Mater. 13, 1459 \u00012004\u0002.\n11R. McCann, S. S. Roy, P. Papakonstantinou, S. C. Ray, and J. A.\nMcLaughlin, J. Appl. Phys. 97, 073522 \u00012005\u0002.\n12D. A. Outka and J. Stohr, J. Chem. Phys. 88, 3539 \u00011988\u0002;S. Bhatta-\ncharyya, M. Lübbe, and F. Richter, J. Appl. Phys. 88, 5043 \u00012000\u0002;S.\nBhattacharyya, M. Lübbe, P. R. Bressler, D. R. T. Zhan, and F. Richter,\nDiamond Relat. Mater. 11, 8 \u00012002\u0002.\n13I. Shimoyama, G. Wu, T. Sekiguchi, and Y. Baba, Phys. Rev. B 62, R6053\n\u00012000\u0002.\n14I. Jimenez, W. M. Wong. D. K. Shuh, B. C. Holloway, M. A. Kelly, P.\nPianetta, L. J. Terminello, and F. J. Himpsel, Appl. Phys. Lett. 74, 2620\n\u00011999\u0002.\n15S. R. P. Silva, J. Robertson, G. A. J. Amaratunga, B. Rafferty, L. M.\nBrown, J. Schwan, D. F. Franceschini, and G. Mariotto, J. Appl. Phys. 81,\n2626 \u00011997\u0002;J. Robertson and C. A. Davis, Diamond Relat. Mater. 4, 441\n\u00011995\u0002.\n16M. Mubumbila, B. Bouchet-Fabre, C. Godon, C. Marhic, B. Angleraud, P.\nY. Tessier, and T. Minea, Diamond Relat. Mater. 13, 1433 \u00012004\u0002.\n17J. M. Ripalda et al., J. Chem. Phys. 118, 3748 \u00012003\u0002.\n18S. E. Rodil and S. Muhl, Diamond Relat. Mater. 13, 1521 \u00012004\u0002.\n19C. Lenardi, P. Piseri, V. Briois, C. E. Bottani, A. Li. Bassi, and P. Milani,\nJ. Appl. Phys. 88, 1521 \u00012000\u0002.\n20In Properties of Amorphous Carbon, edited by J. Robertson and S. R. P.\nSilva \u0001INSPEC, IEE, London, 2003\u0002;N. M. J. Conway, A. Ilie, J. Robert-\nson, W. I. Milne, and A. Tagliaferro, Appl. Phys. Lett. 73, 2456 \u00011998\u0002;D.\nG. McCullach, E. G. Gerstner, D. R. McKenzie, S. Prawer, and R. Kalish,\nPhys. Rev. B 52, 850 \u00011995\u0002;S. Bhattacharyya and S. V. Subramanyam,\nAppl. Phys. Lett. 71, 632 \u00011997\u0002;S. R. P. Silva and J. D. Carey, Diamond\nRelat. Mater. 12, 151 \u00012003\u0002;S. Bhattacharyya, O. Madel, S. Schulze, P.\nHäussler, M. Hietschold, and F. Richter, Phys. Rev. B 61, 3927 \u00012000\u0002.\n21E. Cappelli et al., Diamond Relat. Mater. \u0001in press\u0002.\n22J. R. Shi, J. P. Wang, A. T. S. Wee, C. B. Yeo, C. T. Cheng, M. Ueda, S.\nTomioka, and J. Ohsako, J. Appl. Phys. 92, 5966 \u00012002\u0002;J. D. Carey and\nS. R. P. Silva, Phys. Rev. B 70, 235417 \u00012004\u0002.\n23G. A. Abbas, S. S. Roy, P. Papakonstantinou, and J. A. McLaughlin,\nCarbon 43, 303 \u00012005\u0002.\n24A. J. Papworth, C. J. Kiely, A. P. Burden, S. P. R. Silva, and G. A. J.\nAmaratunga, Phys. Rev. B 62, 12628 \u00012000\u0002.\n25S. Banerjee, T. H. Benny, S. Sambasivan, D. A. Fischer, J. A. Misewich,\nand S. S. Wong, J. Phys. Chem. B \u0001in press\u0002.\n26C. S. Lee, J. K. Shin, K. Y. Eun, K. R Lee, and K. H. Yoon, J. Appl. Phys.\n95, 4829 \u00012004\u0002.\n27A. C. Ferrari, B. Kleinsorge, N. A. Morrison, A. Hart, V. Stolojan, and J.\nRobertson, J. Appl. Phys. 85, 7191 \u00011999\u0002.\n28R. McCann, S. S. Roy, P. Papakonstantinou, M. F. Bain, H. S. Gamble,\nand J. A. McLaughlin, Thin Solid Films 482, 34 \u00012005\u0002.\no AIP license or copyright; see http:\/\/jap.aip.org\/jap\/copyright.jsp\n"}