{"doi":"10.1080\/0968776980060112","coreId":"14300","oai":"oai:generic.eprints.org:264\/core5","identifiers":["oai:generic.eprints.org:264\/core5","10.1080\/0968776980060112"],"title":"Principles for the selection and integration of educational multimedia materials","authors":["Boyle, Tom"],"enrichments":{"references":[{"id":199984,"title":"A learner-centred tool for students building models',","authors":[],"date":"1996","doi":"10.1145\/227210.227224","raw":null,"cites":null},{"id":1043253,"title":"Are integrated learning systems effective learning tools?',","authors":[],"date":"1996","doi":"10.1016\/0360-1315(95)00078-x","raw":"Underwood, J., Cavendish, S., Dowling, S., Fogelman, K. and Cawson, T. (1996), 'Are integrated learning systems effective learning tools?', Computers in Education, 26 (1—3), 33-40.","cites":null},{"id":1043252,"title":"Computer-Aided Instruction: A Guide for Authors,","authors":[],"date":"1991","doi":null,"raw":"Price, R. V. (1991), Computer-Aided Instruction: A Guide for Authors, Pacific Grove, CA: Brooks\/Cole.","cites":null},{"id":199978,"title":"Design for Multimedia Learning,","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":199985,"title":"Key to the information highway',","authors":[],"date":"1996","doi":"10.1145\/227210.227219","raw":null,"cites":null},{"id":453897,"title":"Mindstorms: Children, Computers and Powerful Ideas,","authors":[],"date":"1980","doi":"10.1145\/1045071.1045074","raw":"Papert, S. (1980), Mindstorms: Children, Computers and Powerful Ideas, New York: Basic Books.","cites":null},{"id":199981,"title":"Murder One - developing interactive simulations for teaching law',","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":199983,"title":"Principles for the selection and integration of educational multimedia materials","authors":[],"date":"1995","doi":"10.1080\/0968776980060112","raw":null,"cites":null},{"id":199982,"title":"Rich environments for active learning: a definition',","authors":[],"date":"1995","doi":"10.3402\/rlt.v3i2.9606","raw":null,"cites":null},{"id":1043251,"title":"Technology meets constructivism: do they make a marriage?',","authors":[],"date":"1991","doi":null,"raw":"Perkins, D. N. (1991), 'Technology meets constructivism: do they make a marriage?', Educational Technology, 31 (5), 18-23.","cites":null},{"id":453898,"title":"The Children's Machine,","authors":[],"date":"1993","doi":null,"raw":"Papert, S. (1993), The Children's Machine, New York: Basic Books.","cites":null},{"id":199979,"title":"The promotion of health and safety training at work using virtual factories',","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":199980,"title":"The textbook of the future' in","authors":[],"date":"1993","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1998","abstract":"This paper sets out to clarify the decision framework for the selection and integration of educational multimedia material into courses. Two main areas are discussed. The first involves matching the educational principles inherent in the multimedia artefact to the aims of the course. The opposition between instructionist and constructivist approaches is particularly highlighted. The second area concerns the models used to integrate the multimedia component into the overall course. The models are classified in terms of how they distribute the balance of responsibility for explicit educational structuring between the multimedia system and the course tutor. The paper does not set out prescriptive rules; it aims rather to inform and articulate the decision space for the tutor","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14300.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/264\/1\/ALT_J_Vol6_No1_1998_Principles%20for%20the%20selection%20a.pdf","pdfHashValue":"43776b55ca2641f9fce31a60ec7b46084a06ec0f","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:264<\/identifier><datestamp>\n      2011-04-04T08:49:58Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/264\/<\/dc:relation><dc:title>\n        Principles for the selection and integration of educational multimedia materials<\/dc:title><dc:creator>\n        Boyle, Tom<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        This paper sets out to clarify the decision framework for the selection and integration of educational multimedia material into courses. Two main areas are discussed. The first involves matching the educational principles inherent in the multimedia artefact to the aims of the course. The opposition between instructionist and constructivist approaches is particularly highlighted. The second area concerns the models used to integrate the multimedia component into the overall course. The models are classified in terms of how they distribute the balance of responsibility for explicit educational structuring between the multimedia system and the course tutor. The paper does not set out prescriptive rules; it aims rather to inform and articulate the decision space for the tutor.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        1998<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/264\/1\/ALT_J_Vol6_No1_1998_Principles%20for%20the%20selection%20a.pdf<\/dc:identifier><dc:identifier>\n          Boyle, Tom  (1998) Principles for the selection and integration of educational multimedia materials.  Association for Learning Technology Journal, 6 (1).  pp. 81-86.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776980060112<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/264\/","10.1080\/0968776980060112"],"year":1998,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Principles for the selection and integration\nof educational multimedia materials\nTom Boyle\nDepartment of Computing and Mathematics, Manchester Metropolitan University\nThis paper sets out to clarify the decision framework for the selection and integration of educational\nmultimedia material into courses. Two main areas are discussed. The first involves matching the\neducational principles inherent in the multimedia artefact to the aims of the course. The opposition\nbetween instructionist and constructivist approaches is particularly highlighted. The second area\nconcerns the models used to integrate the multimedia component into the overall course. The models are\nclassified in terms of how they distribute the balance of responsibility for explicit educational\nstructuring between the multimedia system and the course tutor. The paper does not set out prescriptive\nrules; it aims rather to inform and articulate the decision space for the tutor.\nIntroduction\nA variety of educational multimedia resources, varying in both type and quality, is now\navailable. The course tutor faces the problem of how to evaluate multimedia artefacts and\nintegrate them into course delivery. This paper sets out a principled framework to guide\nand inform the choice. The task can be approached from two different directions. The first\nis technologically driven: we survey the latest developments in multimedia and telematics,\nand query how we can adapt educational practice. The second line of approach is driven by\nan educational vision: we establish educational goals and principles, and examine how the\ntechnology can help implement these goals. In the early multimedia era, developments have\noften been driven from the first direction. There has been an opportunistic rush to exploit\nthe new technology which has often led to poor-quality systems. This paper follows the\nsecond line of approach. It starts with educational aims and principles and finishes with\nthe technology. The paper develops in this way to emphasize the priority of the issues. In a\nreal decision-making context, the issues have to be considered in parallel in order to match\neducational principles and technological possibilities.\nThe paper articulates the decision space for selecting and integrating multimedia materials\nin two areas:\n• the educational principles that underpin the multimedia contribution - these may be\nviewed from weakly to strongly articulated, and in terms of the opposition between\ninstructionist and constructivist pedagogies;\n81\nTom Boyle Principles for the selection and integration of educational multimedia materials\n• a model for the integration of multimedia materials based on decisions along a cline\nfrom the maximum flexibility of resource-based learning (Hall et al, 1995) to the\nmaximum commitment of structured multimedia courseware (Laurillard, 1993).\nThe educational vision - constructivist or instructionist?\nTraditionally, CAL has been strongly influenced by the transmission model of learning.\nThe most systematic representation of this approach is Instructional Systems Design (ISD)\n(e.g. Price, 1991). It emphasizes a strong didactic approach to computer-based instruction.\nThere is a clear structuring of the content to be learned, usually based on a systematic,\nhierarchical analysis of the knowledge in the target domain. There is often an emphasis on\ndrill and practice, and individual progress is directed by the computer, based on the results\nof online tests. This approach has been strongly carried over into the multimedia domain\nby Integrated Learning Systems (ILSs), which have proved popular in many schools\n(Underwood et al, 1996). It often acts, at a weaker level, as the default model for many\ncommercial systems and systems developed through educational grants such as TLTP\n(Teaching and Learning Technology Programme).\nConstructivism proposes a radically different approach to devising computer-based\ninteractive multimedia learning environments (IMLEs). Whereas instructional design has\nits roots in behaviourism, constructivism has its roots in the cognitive developmental\ntheories of Vygotsky and Piaget. The primary theme of constructivism is that people\nconstruct their knowledge of the world through interaction. The focus switches from\nsystematic teaching to supporting learning. The primary aim of a computer-based\neducational system is to engage the user in this constructive learning process. This\nemphasis has led to the development of a number of design principles for educational\nsoftware. These include:\n• the use of 'authentic' learning tasks so that the learning is seen as meaningful by the\nstudents;\n• the use of discovery learning methods that enable the students to construct their own\nunderstanding, rather than instruction by a computer;\n• an emphasis on learning how to learn and how to solve problems rather than learning\nfacts;\n• support for collaborative learning and problem-solving.\nThe constructivist principles are well expounded in two special issues of Educational\nTechnology (May and September 1991), and in several papers, e.g. Cunningham et al (1993)\nand Grabinger and Dunlap (1995). These constructivist principles have become strong\nthemes in a variety of modern educational multimedia systems, for example the KIE\nsystem (Linn, 1996), 'Model-It' (Jackson et al, 1996), and VR-based training (Cobb and\nBrown, 1997).\nMatching multimedia systems to the educational vision\nThe first criterion for evaluating multimedia courseware is the nature of the educational\nmodel built into the IMLE. This may be strongly or weakly articulated. A weakly\n82\nALT-J Volume 6 Number I\narticulated model is most likely to reflect the older, default instructionist approach. A\nstrongly articulated learning structure may reflect an instructionist or a constructivist\napproach. Constructivist approaches are more radical, but they have a firm base in psycho-\nlogical theory, and provide a coherent base for learner-centred learning. Tutors should be\nexplicit about their educational aims and objectives. They can then make a principled\nchoice about the type of multimedia educational systems to be used.\nAn important issue is how this educational approach fits in with the evaluation models\nused in the institution. Modern constructivist approaches are often focused on skills not\neasily measured by traditional examinations. The tutor needs to think about the relation-\nship between the learning environment and the evaluation system. The implications of this\nreflection may suggest modifications to the evaluation system, for example with a greater\nemphasis on (group-based) coursework versus formal examinations.\nThis issue points to the central consideration: what is the driving educational vision? Is it to\nimprove, or make more efficient, traditional forms of teaching? An alternative, more\nambitious aim is to transform the learning experience to be more dynamic, active and learner-\ncentred (e.g. Papert, 1980,1993). The choice of IMLE will crucially be affected by, and reflect,\nthe nature of the educational ambition of the tutors and the organization. A radical, learner-\ncentred agenda would point strongly to the selection of constructivist systems.\nModels for integration and use\nThe strategic educational vision has to be realized through a model for integration and use.\nThis model links the educational goals to the concrete delivery context. The choices for the\nintegration of multimedia materials and courseware may be represented on a cline. The\nchoice points on this cline represent various trade-offs between the degree of explicit\neducational support of the multimedia component balanced against the degree of\neducational freedom left with the tutor. Three significant choice points may be identified\non this cline: resource-based learning, educational tools and 'phenomenaria', and\nstructured multimedia courseware. These represent significant alternatives for integrating\nmultimedia resources or courseware.\nResource-based learning\nResource-based learning emphasizes providing learners with access, usually through\nnetworked computers, to a rich set of basic resources for learning. These resources may be\nprovided on CD-ROMs (for example, electronic encyclopaedias and reference works), or\nincreasingly through the World Wide Web. This approach emphasizes the re-use of\nmaterials generally available (for example, on the Web) and the building of electronic\nlibraries providing access to educational source material.\nHall et al (1995) argue for the advantages of this approach. It is cost-effective because of\nthe high degree of re-usability of materials. It provides maximum flexibility for the course\ntutor who may pick and choose the resources to suit a particular course. They also argue\nthat it provides a natural transition for tutors from traditional modes of teaching.\nEducation, they argue, has always been resource-based. It is, therefore, an easy transition\nfor the tutor from using traditional resources such as books to using electronic resources\nsuch as documents and pictures on the Internet. This ease of transition, they argue, will\n83\nTom Boyle Principles for the selection and integration of educational multimedia materials\nmake it easier to scale up learning technology to the stage where it makes a significant\nimpact on the overall education system.\nThe central criticism of resource based learning is expressed most trenchantly by\nLaurillard (1993):'[...] beneath the rhetoric of 'giving students control over their learning'\nis a dereliction of duty. We never supposed students could do that with a 'real' library; why\nshould they be able to do it with an electronic one?' (Laurillard, 1993,206).\nResource-based learning seems to avoid the central educational issues of integration and\nuse. It leaves responsibility for these issues where they have always been - with the\nindividual tutor. Interlinked with this, strangely, is an emphasis on student-centred\nlearning, where students take responsibility for their own learning. This balance has to be\nhandled very carefully to avoid a form of educational dumping.\nIntermediate layers of educational support\nIntermediate levels of direct educational impact may be provided through the use of\nelectronic tools and materials explicitly designed for educational use. There are a wide\nrange of educational tools available, from general-purpose tools such as Logo (Papert,\n1980, 1993) to tools orientated to supporting particular learning tasks such as learning\nprogram design, for example 'Bratque' (Boyle and Davies, 1996). These tools have been\nexplicitly designed to support particular educational processes, such as discovery learning.\nSemi-structured levels of support are also provided by explicit educational 'phenomenaria'\n(Perkins, 1991) such as simulations and microworlds. These vary from supporting open\nexploration to specific goal-directed learning tasks. 'Dans le quartier St. Gervais', for\nexample, permits virtual visits to a district in Paris (Hodges and Sasnett, 1993). 'Murder\nOne' is at the other end of the simulation spectrum (Gibbens, 1992); here law students play\nthe role of preparing and presenting a court case.\nThe educational advantages of these systems are compelling. They provide powerful\nsources for experiential learning, either through constructing entities with a tool, or\nworking through the simulation. They have a clear, intrinsic educational focus, and they\ncan be very attractive and motivating. They provide a natural means of implementing con-\nstructivist approaches to learning. The balancing constraints are that they are more\ndemanding in terms of delivery resources and in course restructuring. They require careful\nthought about curriculum and pedagogy, and they may require a significant trans-\nformation in course delivery.\nStructured courseware\nThe highest level of direct educational impact is provided by structured, multimedia\ncourseware. Traditional ISD-based systems usually provided structured courseware. This\nhas led some critics to identify structured courseware with the older approach to learning\ntechnology. However, there is no necessary linkage. Extensive structured courseware can\nequally be developed within the constructivist tradition. The CLEM system, for example,\ncovers the first-year curriculum for learning to program in Modula-2 (Boyle and Davies,\n1996; Boyle, 1997). This provides over 50 hours of CAL. The pedagogy used, however, is\nradically constructivist. It uses a 'guided discovery' learning approach where students learn\nthrough examples, feedback, and the active construction of the rules of the language.\n84\nALT-J Volume 6 Number I\nThe advantages of structured courseware arise from the direct commitment to an explicit\ncurriculum and pedagogy. The key educational issues are directly addressed in the design\nof these systems. In terms of direct educational impact, they are at the opposite end of the\nspectrum to resource-based learning. They have, potentially, a marked impact on the\nefficiency with which education can be delivered. The tutor is freed from information\ntransmission to deal with other issues. The tutor may become more of a learning manager\nand coach than a lecturer.\nThe main disadvantage is the potential lack of flexibility. Local tutors may not wish a\nwhole course to be replaced. If it is, they usually want to tailor and modify the materials.\nStructured courseware systems do not always support this local modification, and the\nmechanisms for maintaining coherent local changes are not fully clear.\nSummary\nThe selection of appropriate multimedia materials depends on the educational vision of\ntutors and managers. This vision may vary from incremental improvement to a radical\ntransformation of teaching and learning. Constructivist educational materials provide\nsupport for the more radical transition from a teacher-centred to a learner-centred approach.\nThis transition may involve one or more delivery and integration options. Resource-based\nlearning supports re-use of widely available materials, and can easily be used to extend or\nmodify existing modes of teaching. Educational tools and simulations provide a more\ndirect impact on practice which requires greater adaptation by tutors and educational\norganizations. Structured courseware often demands a major shift from teacher-centred to\nlearner-centred educational practice. These three modes of integration and use are not\nmutually exclusive. They represent options for integrating multimedia materials which have\ndifferent impact implications. The choice for a specific situation may involve a judicious\nmix of the different options.\nReferences\nBoyle, T. (1997), Design for Multimedia Learning, London: Prentice Hall.\nBoyle, T. and Davies, M. (1996), 'Hypermedia environments for learning to program' in\nBrusilovsky, P., Kommers, P. and Streitz, N. (eds), Multimedia, Hypermedia and Virtual\nReality, LNCS 1077, Berlin: Springer.\nCobb, S. and Brown, D. (1997), \"The promotion of health and safety training at work using\nvirtual factories', VRET '97, Virtual Reality in Education and Training, Loughborough,\nJune 1997.\nCunningham, D. I , Duffy, T. M. and Knuth, R. (1993), 'The textbook of the future' in\nMcKnight, C, Dillon A. and Richardson J. (eds), Hypertext: A Psychological Perspective,\nChichester: Ellis Horwood.\nGibbons, H. (1992), 'Murder One - developing interactive simulations for teaching law',\nCTISS File, 14.\nGrabinger, R. S. and Dunlap, J. C. (1995), 'Rich environments for active learning: a\ndefinition', ALT-J 3 (2), 5-34.\n85\nTom Boyle Principles for the selection and integration of educational multimedia materials\nHall, W., Hutchings, G. and White, S. (1995), 'Breaking down the barriers: an architecture\nfor developing and delivering resource based learning materials' in Tinsley, J. D. and van\nWeert, T. J. (eds), World Conference on Computers in Education VI: WCCE '95 Liberating\nthe Learner, London: Chapman and Hall.\nHodges, M. E. and Sasnett, R. M. (1993), Multimedia Computing: Case Studies from MIT\nProject Athena, Reading MA: Addison-Wesley.\nJackson, S. L., Stratford, S. J., Krajcik, J. and Soloway, E. (1996), 'A learner-centred tool\nfor students building models', Communications of the ACM, 39 (4), 48-9.\nLaurillard, D. (1993), Rethinking University Teaching, London: Routledge.\nLinn, M. C. (1996), 'Key to the information highway', Communications of the ACM, 39\n(4), 34-5.\nPapert, S. (1980), Mindstorms: Children, Computers and Powerful Ideas, New York: Basic\nBooks.\nPapert, S. (1993), The Children's Machine, New York: Basic Books.\nPerkins, D. N. (1991), 'Technology meets constructivism: do they make a marriage?',\nEducational Technology, 31 (5), 18-23.\nPrice, R. V. (1991), Computer-Aided Instruction: A Guide for Authors, Pacific Grove, CA:\nBrooks\/Cole.\nUnderwood, J., Cavendish, S., Dowling, S., Fogelman, K. and Cawson, T. (1996), 'Are\nintegrated learning systems effective learning tools?', Computers in Education, 26 (1—3),\n33-40.\n86\n"}