{"doi":"10.5194\/angeo-20-151-2002","coreId":"67613","oai":"oai:eprints.lancs.ac.uk:35356","identifiers":["oai:eprints.lancs.ac.uk:35356","10.5194\/angeo-20-151-2002"],"title":"Case studies on the dynamics of Pi3 geomagnetic and riometer pulsations during auroral activations","authors":["Kleimenova, N.G.","Kozyreva, O.V.","Kauristie, K.","Manninen, J.","Ranta, A."],"enrichments":{"references":[{"id":796094,"title":"A statistical study on characteristics of high latitude Pi3 pulsations,","authors":[],"date":"1981","doi":"10.1029\/JA086iA03p01345","raw":"Suzuki, A., Nagano, H., Kim, J. S., and Sagiura, M.: A statistical study on characteristics of high latitude Pi3 pulsations, J. Geophys. Res., 86, 1345–1354, 1981. Syrj¨ asuo, M. T., Pulkkinen, T. I., Janhunen, P., Viljanen, A., Pellinen, R. J., Kauristie, K., Opgenoorth, H. J., Wallman, S., Eglitis, P., Karlsson, P., Amm, O., Nielsen, E., and Thomas, C.: Observations of substorm electrodynamics using the MIRACLE network, in: Substorms-4, (Eds) Kokubun, S. and Kamide, Y., Proc.","cites":null},{"id":790221,"title":"A study of concurrent magnetic field and particle precipitation pulsations 0.005 to 0.5 Hz recorded near College,","authors":[],"date":"1977","doi":null,"raw":null,"cites":null},{"id":16621098,"title":"A study of concurrent magnetic ﬁeld and particle precipitation pulsations 0.005 to 0.5Hz recorded near College,","authors":[],"date":"1977","doi":null,"raw":"Heacock, R. R. and Hunsucker, R. D.: A study of concurrent magnetic ﬁeld and particle precipitation pulsations 0.005 to 0.5Hz recorded near College, Alaska, J. Atmos. Terr. Phys., 39, 487– 501, 1977.","cites":null},{"id":788273,"title":"An imaging riometer for ionospheric studies,","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":792265,"title":"Analysis of an eastward electrojet by means of upward continuation of ground-based magnetometer data,","authors":[],"date":"1979","doi":null,"raw":"Mersmann, U., Baumjohann, W., K¨ uppers, F., and Lange, K.: Analysis of an eastward electrojet by means of upward continuation of ground-based magnetometer data, J. Geophys., 45, 281–298, 1979.","cites":null},{"id":790441,"title":"Analysis of the substorm trigger phase using multiple ground-based instrumentation,","authors":[],"date":"1995","doi":null,"raw":"Kauristie, K., Pulkkinen, T. I., Pellinen, R. J., Janhunen, P., Huuskonen, A., Viljanen, A. Opgenoorth, H. J. Heikkila, W. J., and Baker, D. N.: Analysis of the substorm trigger phase using multiple ground-based instrumentation, Geophys. Res. Lett., 22, 2065–2068, 1995. Kiselev, B. V. and Raspopov, O. M.: Excitation of Pi3 pulsations during substorms, in: Memuars of Nation. Institute of Polar Res.","cites":null},{"id":16621074,"title":"Animagingriometer for ionospheric studies,","authors":[],"date":"1995","doi":null,"raw":"Browne, S., Hargreaves, J.K., andHonary, B.: Animagingriometer for ionospheric studies, Electronics and Communications, 7 (5), 209–217, 1995.","cites":null},{"id":787350,"title":"Balloon observations on the relationship of energetic electrons to visual aurora and auroral absorption,","authors":[],"date":"1965","doi":null,"raw":"Barcus, J. R.: Balloon observations on the relationship of energetic electrons to visual aurora and auroral absorption, J. Geophys. Res., 70, 2135–2147, 1965.","cites":null},{"id":795829,"title":"Braking of high-speed ﬂows in the near-Earth tail,","authors":[],"date":"1997","doi":"10.1029\/97GL01062","raw":"Shiokawa K., Baumjohann, W., and Haerendel, G.: Braking of high-speed ﬂows in the near-Earth tail, Geophys. Res. Lett., 24, 1179–1182, 1997.","cites":null},{"id":796045,"title":"Correlations between modulations of the intensity of precipitating electrons in the auroral zone and coincident Pi2,","authors":[],"date":"1977","doi":"10.1016\/0021-9169(77)90074-5","raw":null,"cites":null},{"id":16621190,"title":"Correlations between modulations of the intensity of precipitating electrons in the auroralzoneandcoincidentPi2,","authors":[],"date":"1977","doi":null,"raw":"Stuart, W. F., Green, C. A., and Harris, T. J.: Correlations between modulations of the intensity of precipitating electrons in the auroralzoneandcoincidentPi2, J.Atmos.Terr.Phys., 39, 631–635, 1977.","cites":null},{"id":796369,"title":"Cosmic noise absorption events and magnetic pulsations activity during substorms,","authors":[],"date":"1979","doi":null,"raw":"Wedeken, U., Hillebrand, O., Krenzien, E., Ranta, A., Ranta, H., and Voelker, H.: Cosmic noise absorption events and magnetic pulsations activity during substorms, J. Geophys. Res., 46, 249– 259, 1979.","cites":null},{"id":791216,"title":"Current disruption in the Earth’s magnetosphere: Observations and models,","authors":[],"date":"1996","doi":null,"raw":"Lui, A. T. Y.: Current disruption in the Earth’s magnetosphere: Observations and models, J. Geophys. Res., 101, 13067–13088, 1996.","cites":null},{"id":794076,"title":"Development of the auroral absorption substorm: Studies of preonset phase and sharp onset using an extensive riometer network,","authors":[],"date":"1981","doi":null,"raw":"Ranta, H., Ranta, A., Collis, P. N., and Hargreaves, J. K.: Development of the auroral absorption substorm: Studies of preonset phase and sharp onset using an extensive riometer network, Planet. Space Sci., 29, 1287–1313, 1981.","cites":null},{"id":788556,"title":"Electron precipitation pulsations,","authors":[],"date":"1970","doi":null,"raw":"Coroniti, F. V. and Kennel, C. F.: Electron precipitation pulsations, J. Geophys. Res., 75, 1279–1289, 1970.","cites":null},{"id":793298,"title":"Energization of charged particles to high energies by an induced substorm electric ﬁeld within the magnetotail,","authors":[],"date":"1978","doi":null,"raw":"Pellinen, R. J. and Heikkila, W. J.: Energization of charged particles to high energies by an induced substorm electric ﬁeld within the magnetotail, J. Geophys. Res., 83, 1544–1550, 1978.","cites":null},{"id":794463,"title":"Excitation of magnetospheric hydromagnetic waves by solar-ﬂare induced change in ionospheric conductivity,","authors":[],"date":"1981","doi":null,"raw":"Rosenberg, T. J., Morris, P. B., and Lanzerotti, L. J.: Excitation of magnetospheric hydromagnetic waves by solar-ﬂare induced change in ionospheric conductivity, Phys. Rev. Lett., 47, 1343– 1346, 1981. Saito, T.: Long-period irregular magnetic pulsations Pi3, Space.","cites":null},{"id":796931,"title":"Fluctuations of the auroral zone current system and geomagnetic pulsations,","authors":[],"date":"1977","doi":"10.1029\/JA082i019p02705","raw":"Wilhelm, K., Munch, J. W., and Kremser, G.: Fluctuations of the auroral zone current system and geomagnetic pulsations, J. Geophys. Res., 82, 2705–2716, 1977.","cites":null},{"id":793464,"title":"Inductive electric ﬁelds in the magnetotail and their relation to auroral and substorm phenomena,","authors":[],"date":"1984","doi":null,"raw":"Pellinen, R. J. and Heikkila, W. J.: Inductive electric ﬁelds in the magnetotail and their relation to auroral and substorm phenomena, Space Sci. Rev., 37, 1–61, 1984. Pytte, T., Trefall, H., Kremser, G., Jalonen, L., Riedler, W.: On the morphology of energetic (>30keV) electron precipitation during the growth phase of magnetospheric substorms, J. Atmos.","cites":null},{"id":790942,"title":"Investigation of the conjugacy between auroral breakup and energetic electron injection,","authors":[],"date":"2000","doi":null,"raw":"Lazutin, L. L., Borovkov, L. P., Kozelova, T. V., Kornilov, I. A., Tagirov, V. R., Korth, A., Stadsnes, J., and Ullaland, S.: Investigation of the conjugacy between auroral breakup and energetic electron injection, J. Geophys. Res., 105, 18495–18503, 2000.","cites":null},{"id":790695,"title":"Long period (T = 8–10 min) geomagnetic pulsations at high latitudes,","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":16621108,"title":"Long period (T = 8–10min) geomagnetic pulsations at high latitudes,","authors":[],"date":"1998","doi":null,"raw":"Kleimenova, N. G., Kozyreva, O. V., Bitterly, J., and Bitterly, M.: Long period (T = 8–10min) geomagnetic pulsations at high latitudes, Geomagnetism and Aeronomy, 38, 436–445, 1998.","cites":null},{"id":787692,"title":"Neutral line model of substorms: Past results and present view,","authors":[],"date":"1996","doi":null,"raw":"Baker, D. N., Pulkkinen, T. I., Angelopoulos, V., Baumjohann, W., and McPherron, R. L.: Neutral line model of substorms: Past results and present view, J. Geophys. Res., 101, 12975–13010, 1996.","cites":null},{"id":795572,"title":"Observations of ﬁeld line resonances, auroral arcs, and auroral vortex structures,","authors":[],"date":"1996","doi":"10.1029\/96JA01086","raw":"Samson, J. C., Cogger, L. L., and Pao, Q.: Observations of ﬁeld line resonances, auroral arcs, and auroral vortex structures, J. Geophys. Res., 101, 17373–17383, 1996.","cites":null},{"id":791459,"title":"On the location of auroral arcs near substorm onsets,","authors":[],"date":"1978","doi":null,"raw":"Lui, A. T. Y. and Burrows, J. R.: On the location of auroral arcs near substorm onsets, J. Geophys. Res., 83, 3342–3348, 1978.","cites":null},{"id":792831,"title":"Pi2 pulsations and substorm onsets: A review,","authors":[],"date":"1999","doi":null,"raw":"Olson, J. V.: Pi2 pulsations and substorm onsets: A review, J. Geophys. Res., 104, 17499–17520, 1999.","cites":null},{"id":792532,"title":"Pi3 magnetic pulsations associated with substorms,","authors":[],"date":"1981","doi":null,"raw":"Nagano, H., Suzuki, A., Kim, J. S., and Sugiura, M.: Pi3 magnetic pulsations associated with substorms, Planet. Space Sci., 29, 529–553, 1981.","cites":null},{"id":794156,"title":"Polar irregular pulsations PiP,","authors":[],"date":"1973","doi":null,"raw":"Raspopov, O. M., Kiselev, B. V., Roldugin, V. K., and Ghernous, S. A.: Polar irregular pulsations PiP, IAGA Bulletin, 34, 432, 1973.","cites":null},{"id":789658,"title":"Radar auroral observations during a burst of irregular magnetic pulsations,","authors":[],"date":null,"doi":null,"raw":"Haldoupis, C.I., Nielsen, E., Holtet, J.A., Egeland, A., andChivers, H. A.: Radar auroral observations during a burst of irregular magnetic pulsations, J. Geophys. Res., 87, 1541–1550, 1982.","cites":null},{"id":789394,"title":"Riometer and magnetic Pi3 during auroral activations 159 Fukunishi, H.: Dynamic relationship between proton and electron auroral substorm,","authors":[],"date":"1975","doi":null,"raw":null,"cites":null},{"id":793802,"title":"Satellite and Ground Observations of a Pre-Substorm Phase","authors":[],"date":"1977","doi":null,"raw":"Ranta, A. and Ranta, H.: Satellite and Ground Observations of a Pre-Substorm Phase on 4 May 1977, J. Geophys. Res., 88, 4097– 4104, 1983.","cites":null},{"id":796595,"title":"Satellite measurements through the center of substorm surge,","authors":[],"date":"1994","doi":"10.1029\/94JA01976","raw":"Weimer, D. R., Craven, J. D., Frank, L. A., Hanson, W. B., Maynard, N. C., Hoffman, R. A., and Slavin, J. A.: Satellite measurements through the center of substorm surge, J. Geophys. Res., 99, 23639–23649, 1994.","cites":null},{"id":791972,"title":"Satellite studies of magnetospheric substorms on 15","authors":[],"date":"1968","doi":null,"raw":null,"cites":null},{"id":16621134,"title":"Satellite studies ofmagnetosphericsubstormson15August1968, 9.Phenomenological Model for Substorms,","authors":[],"date":"1973","doi":null,"raw":"McPherron, R. L., Russell, C. T., and Aubry, M. P.: Satellite studies ofmagnetosphericsubstormson15August1968, 9.Phenomenological Model for Substorms, J. Geophys. Res., 78, 3131–3149, 1973.","cites":null},{"id":793058,"title":"Source regions of long-period pulsation events in electron precipitation and magnetic fields at South Pole Station,","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":787057,"title":"Space-time association of auroral grow and X-rays at balloon altitude,","authors":[],"date":"1963","doi":null,"raw":"Anderson, K. A. and DeWitt, R.: Space-time association of auroral grow and X-rays at balloon altitude, J. Geophys. Res., 68, 2669– 2675, 1963.","cites":null},{"id":788025,"title":"Substorm effects in MHD and test particle simulations of magnetotail dynamics, in:","authors":[],"date":"1998","doi":null,"raw":"Birn, J. and Hesse, M.: Substorm effects in MHD and test particle simulations of magnetotail dynamics, in: Substorms-4, (Eds) Kokubun, S. and Kamide, Y., Proc. International Conference on Substorms-4, Lake Hamana, Japan, Terra Scientiﬁc Publishing Company, Tokyo, 159–164, 1998.","cites":null},{"id":792563,"title":"Substorm expansion into the polar cap,","authors":[],"date":"1988","doi":null,"raw":"Nielsen, E., Bamber, J., Chen, Z.-S., Brekke, A., Egeland, A., Murphree, J. S., Venkatesan, D., and Axford, W. I.: Substorm expansion into the polar cap, Ann. Geophysicae, 6, 559–572, 1988.","cites":null},{"id":789087,"title":"The auroral luminosity structure in the high latitude upper atmosphere: Its dynamic and relationship to the large-scale structure of the Earth’s magnetosphere,","authors":[],"date":"1975","doi":null,"raw":"Feldstein, Y. I. and Galperin, Y. I.: The auroral luminosity structure in the high latitude upper atmosphere: Its dynamic and relationship to the large-scale structure of the Earth’s magnetosphere, Rev. Geophys., 59, 83–165, 1985.N. G. Kleimenova et. al.: Riometer and magnetic Pi3 during auroral activations 159 Fukunishi, H.: Dynamic relationship between proton and electron auroral substorm, J. Geophys. Res., 80, 553–574, 1975.","cites":null},{"id":786756,"title":"The Development of the Auroral Substorm,","authors":[],"date":"1964","doi":null,"raw":"Akasofu, S.-I.: The Development of the Auroral Substorm, Planet. Space Sci., 12, 273–282, 1964.","cites":null},{"id":16621149,"title":"U.S.: Sourceregionsoflong-periodpulsationeventsin electron precipitation and magnetic ﬁelds at South Pole Station,","authors":[],"date":"1994","doi":null,"raw":"Paquette, J. A., Matthews, D. L., Rosenberg, T. J., Lanzerotti, L. J., andInan, U.S.: Sourceregionsoflong-periodpulsationeventsin electron precipitation and magnetic ﬁelds at South Pole Station, J. Geophys. Res., 99, 3869–3877, 1994.","cites":null},{"id":791683,"title":"Westward moving dynamic substorm features observed with the IMAGE magnetometer network and other ground-based instruments,","authors":[],"date":"1998","doi":null,"raw":"L¨ uhr, H., Aylward, A., Buchert, S. C., Pajunp¨ a¨ a, A., Pajunp¨ a¨ a, K., Holmboe, T., and Zalewski, S. M.: Westward moving dynamic substorm features observed with the IMAGE magnetometer network and other ground-based instruments, Ann. Geophysicae, 16, 425–440, 1998.","cites":null},{"id":788813,"title":"What is a Global substorm,","authors":[],"date":"1996","doi":null,"raw":"Elphinstone, R. D., Murphree, J. S., and Cogger, L. L.: What is a Global substorm, Rev. of Geophys., 34, 169–232, 1996.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-02","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67613.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/35356\/1\/art_283.pdf","pdfHashValue":"d75053499a474dcb4d30dccf945a708a21d3f52b","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:35356<\/identifier><datestamp>\n      2018-01-24T03:07:28Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Case studies on the dynamics of Pi3 geomagnetic and riometer pulsations during auroral activations<\/dc:title><dc:creator>\n        Kleimenova, N.G.<\/dc:creator><dc:creator>\n        Kozyreva, O.V.<\/dc:creator><dc:creator>\n        Kauristie, K.<\/dc:creator><dc:creator>\n        Manninen, J.<\/dc:creator><dc:creator>\n        Ranta, A.<\/dc:creator><dc:date>\n        2002-02<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/35356\/1\/art_283.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/angeo-20-151-2002<\/dc:relation><dc:identifier>\n        Kleimenova, N.G. and Kozyreva, O.V. and Kauristie, K. and Manninen, J. and Ranta, A. (2002) Case studies on the dynamics of Pi3 geomagnetic and riometer pulsations during auroral activations. Annales Geophysicae, 20 (2). pp. 151-159. ISSN 0992-7689<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/35356\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/angeo-20-151-2002","http:\/\/eprints.lancs.ac.uk\/35356\/"],"year":2002,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"Annales Geophysicae (2002) 20: 151–159 c© European Geophysical Society 2002\nAnnales\nGeophysicae\nCase studies on the dynamics of Pi3 geomagnetic and riometer\npulsations during auroral activations\nN. G. Kleimenova1, O. V. Kozyreva1, K. Kauristie2, J. Manninen3, and A. Ranta3\n1Institute of the Earth Physics, Moscow 123995, Russia\n2Finnish Meteorological Institute, Geophysical Research Division, P.O. Box 503, FIN-00101 Helsinki, Finland\n3Oulu University, Sodankyla¨ Geophysical Observatory, FIN-99600 Sodankyla¨, Finland\nReceived: 24 April 2001 – Revised: 12 October 2001 – Accepted: 6 November 2001\nAbstract. A sequence of three subsequent auroral activa-\ntions (at 18:10, 19:48 and 20:00 UT) on 9 February 1997 is\nanalysed. The brightenings of optical auroras were collo-\ncated with latitudinally localized bursts of pulsating riome-\nter absorption and Pi3 geomagnetic pulsations. In two of\nthe cases, the strongest westward directed electrojet currents\nand the footpoint of the upward directed field-aligned cur-\nrents related to the auroral brightening were observed in the\nsame region as the largest amplitude of the pulsations and\ntheir polarization changed. In the third case, field-aligned\ncurrent signatures were present, but not so pronounced that\ntheir accurate location could not be defined. In all cases, the\nspectra of geomagnetic and absorption pulsations were simi-\nlar. Based on ground-based observations alone, it is difficult\nto say whether the energetic particle precipitation (riometer\nabsorption) was modulated by the geomagnetic pulsations or\nwhether the geomagnetic pulsations were caused by varying\nionospheric currents controlled by the precipitating particle\nintensity. However, the localized nature of both pulsations\nof the two different phenomena and their tight coupling with\neach other seem to support the latter option.\nKey words. Ionosphere (Particle precipitation) – Magneto-\nspheric physics (auroral phenomena; MHD waves and insta-\nbilities)\n1 Introduction\nThe brightening and breakup of a preexisting stable arc, the\nabrupt negative deviation in the magnetic north (X) com-\nponent, and the magnetic Pi2 pulsations (T = 40 − 150 s)\nare typical substorm expansion phase onset signatures in the\nionosphere (Akasofu, 1964; Fukunishi, 1975). It is not yet\nexactly known which processes in the magnetosphere cause\nthe initial brightening of the auroral arc. The magnetic sig-\nnatures can be associated with the build up of the substorm\nCorrespondence to: N. Kleimenova\n(kleimen@uipe-ras.scgis.ru)\ncurrent wedge (SCW) (McPherron et al., 1973). Pi2 pulsa-\ntions are a consequence of the shear Alfve´n waves carrying\nthe field-aligned currents (FACs) in the wedge, and the iono-\nspheric part of the wedge (a strong westward current) causes\nthe negative X-bay. Pi2 pulsations have been recognized to\nbe a fundamental element in magnetospheric substorm mor-\nphology, since they can be observed in a wide range of lati-\ntudes and longitudes on the ground (Olson, 1999). However,\nduring the substorm sequence, Pi3 type geomagnetic pulsa-\ntions very often also occur with longer periods than Pi2. Ac-\ncording to Saito (1978), the substorm associated Pi3 pulsa-\ntions can be separated into two categories: the Ps6 type, with\nperiods longer than 400–600 s and dominantly observed in\nthe D-component, and the PiP type, with periods less than\n400 s and amplitudes comparable in all three components of\nthe field. The PiP periods are from 150 to 400 s, and the\naverage amplitudes from several tens of nT to hundred nT\n(Raspopov et al., 1973; Kiselev and Raspopov, 1976). The\nonset of PiPs at the higher latitudes lags behind the onset\nat auroral zone latitudes, where PiPs can be accompanied\nby auroral intensity fluctuations in the similar period range.\nNagano et al. (1981) show that high latitude Pi3s with peri-\nods longer than 400 s are more commonly observed than PiP\ntype pulsations, and that the amplitudes of Pi3s are largest\nnear the center of the westward auroral electrojet. Accord-\ning to Suzuki et al. (1981), the distributions of nightside Pi3\nare similar to those of Pi2. Kleimenova et al. (1998) showed\nthat in the auroral zone, Pi3 pulsations (f ∼ 1− 3 MHz) are\nvery localized in latitude and closely related to the substorm\nintensification.\nNumerous observations have indicated that substorm asso-\nciated energetic particle precipitation (as measured by riome-\nters) can have temporal variations with periods of 3–15 min,\ni.e. in the frequency range of Pi3 periods (Wedeken et al.,\n1979). Furthermore, it has been shown that in the auroral\nzone, the Pi2 pulsations are highly correlated with the pul-\nsating component of the riometer data (Stuart et al., 1977;\nHeacock and Hornsucker, 1977; Haldoupis et al., 1982). Si-\nmultaneous observations of optical aurora and energetic par-\n152 N. G. Kleimenova et. al.: Riometer and magnetic Pi3 during auroral activations\n60\n62\n64\n66\n68\n70\n72\n56\n58\nCorr. geomagn. longitude\nCo\nrr.\n g\neo\nm\nag\nn.\n la\ntit\nud\ne\nKEV\nIVA\nMAS\nOUJ\nOUL\nKIR\nABK\nSOD\nMUO\nKIL\n100 102 104 106 108 110 112 114\nJYV\nNUR\n*\nMagnetometer\nRiometer\n* All-sky camera\nTRO\nSOR\nIRI\nFig. 1. A map showing the CGM latitudes and longitudes of the\nmagnetometer and riometer stations.\nticle precipitation have been analysed in a few papers (An-\nderson and DeWitt, 1963; Barcus, 1965; Nielsen et al., 1988;\nLazutin et al., 2000). The new point of this study is to anal-\nyse simultaneous observations of all three different types of\nphenomena. The behavior of auroral breakups, riometer ab-\nsorption variations and Pi3 type pulsations during a sequence\nof several subsequent activations is investigated in order to\ndemonstrate how these activations are spatially and tempo-\nrally coupled with each other and with the other expansion\nphase phenomena.\n2 Instrumentation\nMIRACLE is a two-dimensional instrument network con-\nstructed for studies of mesoscale auroral activity in the Scan-\ndinavian sector (Syrja¨suo et al., 1998). The network includes\n25 magnetometer stations (the IMAGE network, Lu¨hr et al.,\n1998), eight all-sky cameras (ASC) and the STARE radar\nsystem with two coherent scatter radars. The sampling rate\nof IMAGE is 10 s. The ASCs acquire images through filters\nof 557.7 nm and 630.0 nm with the sampling rates of 20 s\nand 60 s, respectively. This study utilizes IMAGE data and\nASC images recorded at Abisko (ABK, 68.36 N, 18.82 E).\nThe field of view of the ABK ASC at the 100 km altitude\nis a circle with the radius of approximately 300 km. Spa-\ntial resolution of the ASC varies between less than a one km\ndistance per pixel (near the zenith) to a few km per pixel\n(near horizon). Unfortunately STARE data are not avail-\nable for the event analysed here. Combined with the MIR-\nACLE data, we analyse recordings of a chain of 6 riometer\nstations: Ivalo (IVA, 30 MHz), one IRIS (Ionosphere Riome-\nter Imaging System) beam (IRI, 38.2 MHz) (Browne et al.,\n1995), Sodankyla¨ (SOD, 30 MHz), Oulu (OUL, 32.4 MHz),\nand Jyva¨skyla¨ (JYV, 32.4 MHz). The riometers measure the\nvariation in the intensity of the galactic cosmic noise on the\nground. The intensity of observed signal is a function of the\nheight integrated electron density in the D- and E-regions,\nwhich, in the first instance, is a function of the energetic\n(more than 10–20 keV) electron precipitation. The sampling\nrate of the riometers is 10 s, and the beam covers at the 90 km\naltitude a circular area of 100 km diameter. Figure 1 shows\nthe locations in corrected geomagnetic (CGM) coordinates\nof the instruments used in this study.\n3 Observations\nOn 9 February 1997, the time between 12:00–24:00 UT was\nmagnetically very disturbed. The quicklook AE index (based\non the data of seven AE-observatories) shows at least four\nsubstorm-like activations, with peak AE values between 500\nand 1800 nT around the hours of 14:00, 18:00, 20:00, and\n22:00 UT. The WIND satellite was monitoring the solar wind\nat XGSM = 197RE (YGSM = 8RE , ZGSM = −16RE). At\n12:50 UT, the satellite observed a shock front with an abrupt\nincrease in the ion density and earthward directed plasma ve-\nlocity. The IMF direction was very variable until 16:20 UT,\nwhen IMF BZ suddenly changed to strongly negative val-\nues (below −5 nT) and stayed there until 21:00 UT. The de-\nlay time from WIND to the Earth’s magnetopause is ap-\nproximately 35 min, if it is simply calculated using the mea-\nsured solar wind velocity (VGSM = 560− 600 km\/s) and the\ndistance from the satellite to the Earth’s magnetopause (at\nXGSM = 10RE). Real observations seem to follow this ap-\nproximation relatively well, since IMAGE recorded the sud-\nden impulse (SI) driven by the solar wind shock at 13:21 UT.\nFigure 2 (upper panel) shows the geographical location of\nthe auroral electrojets as a function of time. The latitude\nprofile of the X-component deviations recorded at the IM-\nAGE middle meridion stations have been upward continu-\nated to the ionospheric level, using the method of Mersmann\net al. (1979). In the upward continuated latitude profiles, the\nelectrojet boundaries are more pronounced than in the ground\nobserved profiles. The latitudinal resolution of the method is\n∼ 0.8◦. The lower panel shows the estimated intensity of the\nelectrojet current densities (J = 2X\/µ0).\nThe data of Fig. 2 show growth phase activity, i.e. an in-\ntensification and equatorward shift of the auroral electrojets,\nstarting at 17:00 and 18:30 UT. The effects of the expansion\nphase SCW currents are most clearly visible at the end of the\ngrowth phases, i.e. at 18:10 and 20:00 UT. At the ionospheric\nfootpoint of the upward field-aligned currents (FACs), there\nis a counterclockwise Hall current vortex. Consequently, on\nthe poleward (equatorward) side of the footpoint, westward\n(eastward) currents intensify. The vortices are seen as pairs\nof red and blue regions in the color plot of Fig. 2. Since\nonly X-component data is used in the analysis, the plot does\nnot show the effects of the poleward and equatorward cur-\nrents that cause the deviations primarily in the magnetic east\ncomponent below a vortex structure. In the latter case (after\nN. G. Kleimenova et. al.: Riometer and magnetic Pi3 during auroral activations 153\nFig. 2. The locations (in geographic latitudes) and intensities of the auroral electrojets as a function of time during the period of this study. In\nthe top plot, the blue (red and yellow) colors show the location of the westward (eastward) electrojet (currents are close to zero in the green\nregions) and in the bottom plot, a solid (dashed) curve shows the total current intensity of the westward (eastward) electrojet.\n20:00 UT), the vortex formed in a region previously domi-\nnated by the westward electrojet and thus a part of the east-\nward current is seen as “a hole in the westward currents”.\nNote that the plot also shows FAC-related signatures around\n19:20 UT, although these signatures are not as clear at 18:10\nand 20:00 UT.\nA set of ABK ASC images is shown in Fig. 3. The\nASC at ABK started to acquire images at 18:01 UT. The\nfirst images show dim auroral arcs in the zenith and some-\nwhat brighter arcs both in the southern and northern horizons.\nThe southern-most arc broke up at 18:10 UT and the activ-\nity spread rapidly from south to the zenith and later to the\nnorthern sky. Around 19:20 UT, the auroras in the southern\nhorizon brightened again (not shown), but the activity stayed\nso close to the horizon that defining the exact dynamics was\ndifficult. Around 19:48 UT, new bright auroras appeared to\nthe zenith and a further intensification in the activity took\nplace 19:52 UT, when a westward travelling surge (WTS) in-\ntruded from the eastern horizon to the zenith of the camera.\nThe WTS related activity continued in the entire sky of ABK\nuntil 20:27 UT.\nThe auroral brightenings at 18:10 UT and from 19:48–\n19:52 UT can be associated both temporally and spatially\nwith the clear SCW signatures of Fig. 2. In the first case,\nthe breakup region was at the CGM latitude of 62.3◦ and in\nthe second case it was at latitude 65◦. According to Fig. 2,\nthe footpoints of the corresponding upward directed FACs\nwere at the CGM latitudes of 62.5◦ and 66.5◦ (the CGM lat-\nitude is roughly 3.5◦ less than the geographical latitude in\nthis region). The weaker FAC signature in Fig. 2 (19:20 UT)\nseems to be temporally related to the auroral brightening at\n19:22 UT, but the spatial connection is not so clear; the auro-\nras are clearly more south than the strongest magnetic signa-\ntures.\nFigure 4 represents the magneticX-component and riome-\nter data: raw records (panel a), their dynamic spectra in the\nfrequency range of 0.5–4.0 MHz (panel b) and 1–3 MHz fil-\ntered data (panel c), recorded at the IMAGE and riometer\nstations shown in Fig. 1. The magnetic Y -component of\nPi3 pulsations is characterized by a little spectral difference.\nHowever, the space-time variations (not shown here) are sim-\nilar to the X-component. The spatial distribution of 0.5–\n2.0 MHz geomagnetic pulsations is plotted in Fig. 5. Fig-\nure 6 demonstrates the integrated intensity of optical auroras\nin the approximate beam locations of the riometers IRI, IVA,\nand SOD.\nThe first auroral breakup caused magnetic effects primar-\nily at the southern stations of SOD and OUJ (Fig. 4, panel a,\nand Fig. 6). The breakup was accompanied by a short burst\nof riometer absorption observed at a very narrow latitudinal\narea (SOD) and in the Pi3 range pulsations both in the ri-\nometer and magnetometer data (Fig. 4). Both the riometer\nand magnetic pulsations have a maximum intensity at∼ 0.5–\n2.0 MHz, were recorded simultaneously at the same lati-\ntudes, and were aproximately in anti-phase (Fig. 4, panel c).\nIn both spectra, there is also an amplitude enhancement in\n154 N. G. Kleimenova et. al.: Riometer and magnetic Pi3 during auroral activations\nFig. 3. ASC frames recorded at the sta-\ntion ABK around the times of the auro-\nral intensifications (18:10 UT, 19:48 UT\nand 20:00 UT).\nthe PiP range (2–4 MHz). The phase of the PiP magnetic\npulsations at SOD led the wave phase at OUJ for about one-\nthird of the average wave period. The rotation of the polar-\nization vector at these stations was the opposite: clockwise\nat higher latitudes (SOD) and counterclockwise at lower lat-\nitudes (OUJ), i.e. that the source of the wave is located be-\ntween these stations. The 0.5–2.0 MHz (Pi3) pulsation shows\nthe similar morphological properties and there is no reason to\nseparate PiP and Pi3 into different types.\nThe top panel of Fig. 5 shows the map of the spatial distri-\nbution of Pi3 geomagnetic pulsation amplitude integrated for\nthe time interval of 18:00–18:20 UT. The area of the maxi-\nmum amplitude is marked with the gray shading. The map,\ntogether with Figs. 2 and 4, demonstrate that the strongest\n0.5–2.0 MHz magnetic pulsations were recorded in the same\nregion as the strongest riometer absorption, and this was the\nsame region where the footpoint resided of the SCW related\nupward FAC resided and where the auroral breakup took\nplace. More accurately, the footpoint of the FAC was be-\ntween stations SOD and OUJ, which observed the pulsations\nwith different phases. A very sharp attenuation of the Pi3\namplitude can be seen in Fig. 5 (top panel) near the CGM lat-\nitude of 65◦. This boundary cannot be the polar cap boundary\nsince auroras were also observed on its poleward side, but it\ncan correspond to the tailward edge of the substorm activity\nregion in the near-Earth magnetosphere (Baker et al., 1996).\nThe riometer absorption and Pi3 activity around 19:30 UT\n(Fig. 4) are most probably associated with the auroral and\nmagnetic activations at 19:20 UT. It is interesting to note that\nthe riometer pulsations (Fig. 4, panel b) are strongest in the\nsouthern region (SOD) where the auroras were strongest,\nwhile the magnetic signatures, pulsations and the FAC-\nsignature in Fig. 2 dominated at higher latitudes (KEV).\nThe next period of strong pulsation and riometer activ-\nity started around 19:48 UT. The magnetometers in Fig. 4\n(panel a) show that the negative deviation in X was at first\nthe strongest at OUJ. The bay was accompanied by a burst of\nthe pulsating riometer absorption and Pi3 geomagnetic pul-\nsations. The middle panel of Fig. 5 shows the spatial dis-\ntribution of Pi3 geomagnetic pulsations at 19:40–20:00 UT.\nDuring this period, the maximum of the Pi3 amplitude was\nlocated near OUJ, which is at lower latitudes than during\nthe first breakup (18:11 UT). The rotation of the polarization\nvector of geomagnetic pulsation (both Pi3 and PiP range)\nchanged between SOD and OUJ. At this time, contrary to\nthe first breakup, the rotation was counterclockwise at higher\nlatitudes (SOD) and clockwise at lower latitudes (OUJ). This\nwould suggest that the upward FAC was between SOD and\nOUJ. In this case, the electrojet boundary plot of Fig. 2 does\nnot provide further confirmation for this conclusion as it does\nfor the first breakup (clear FAC signatures are visible only af-\nter 20:00 UT).\nWhen the WTS moved above the zenith of ABK around\n20:00 UT the riometer and magnetic activity also shifted to\nhigher latitudes. The most intensive aurora was observed\nat ∼ 20:05 UT, northward of ABK, and the center of the\nwestward electrojet shifted to the CGM latitudes of 66–67◦\n(Fig. 2). The strongest riometer absorption, and riometer and\nmagnetic pulsations (both PiP and Pi3) were observed at the\nsame latitudes. The direction of the vector polarization of Pi3\npulsation was clockwise near KEV, and the Pi3 polarization\nreversal occurred between KEV (CGM latitude of∼ 66◦) and\nSOD (CGM latitude of ∼ 64◦), which is somewhat south of\nthe FAC footpoint (CGM lat 66.5◦) as suggested by the plot\nin Fig. 2. The spatial magnetic-Pi3 distribution for the period\nof 20:00–20:20 UT is shown in the bottom panel of Fig. 5.\nN. G. Kleimenova et. al.: Riometer and magnetic Pi3 during auroral activations 155\na) b)\nc)\nFig. 4. The magnetic X-component and riometer data: raw records (panel a), their dynamic spectra in the frequency range of 0.5–4.0 MHz\n(panel b) and 1–3 MHz filtered data (panel c), recorded at the IMAGE and riometer stations shown in Fig. 1.\nThe plot shows a sharp border at the CGM latitude of 65◦,\nequatorward of where the activity attenuates significantly.\n4 Discussion\nThe activity discussed in this study can be related to\nthe magnetospheric processes in the near-Earth region\n(XGSM ∼ −6 . . . − 10RE). The magnetospheric origin of\nexpansion phase onset arcs is known to be within the central\nplasma sheet (Feldstein and Galperin, 1985; Birn and Hesse,\n1998), or more accurately, at the inner border of the central\nplasma sheet near the region of dipolarization (Ranta et al.,\n1977). On the other hand magnetic reconnection, which is\nmost likely the original energy source of the expansion phase\nactivity, takes place in the mid-tail region (XGSM ∼ 20RE).\nConsequently, variations in the reconnection process cannot\ndirectly cause the modulations in the energetic precipitation\nor in the magnetic pulsations. Nevertheless, reconnection can\nindirectly control the appearance of the pulsations, since it\ncauses fast earthward directed plasma flows, FACs, and the\ndipolarization of the geomagnetic field on the earthward side\nof the reconnection region. FACs cause pulsations primarily\nin the Pi2 range, but the breaking of the earthward directed\nflows in the region of quasi-dipolar field lines (Shiokawa et\nal., 1997) may cause lower frequency hydromagnetic waves,\nwhich can modulate the intensity of energetic particle precip-\nitation. Nevertheless, such interaction processes are likely to\ncause global effects, while our observations show a poor cor-\nrelation between geomagnetic observations at stations whose\nseparations are clearly less than the Pi3 wavelengths.\nBreakup arcs have been shown to have their magneto-\nspheric origin adjacent to the energetic (30–80 keV) electron\nisotropic boundary (Lui and Burrows, 1978; Elphinstone et\nal., 1996). This means that under average conditions, ener-\ngetic electrons should be trapped equatorward of the breakup\narc. During the growth phase, however, the riometer ab-\nsorption usually increases in the breakup region (Pytte et al.,\n1976; Ranta et al., 1981). Consequently, in the corresponding\nmagnetospheric region, some non-linear processes, probably\nrelated to the stretching of field lines to a more tail-like con-\nfiguration, cause a randomisation in the motion of energetic\nelectrons. For example, the cyclotron instability of trapped\nenergetic electrons modulated by a ULF wave could cause\nsimilar oscillations in the riometer absorption, as observed in\n156 N. G. Kleimenova et. al.: Riometer and magnetic Pi3 during auroral activations\n09 FEB 1997      18:00-18:20 UT\n19:40-20:00 UT\n20:00-20:20 UT\nFig. 5. The spatial distribution of the 0.6–2.0 MHz magnetic pulsations in CGM coordinates; asterisks show the station locations.\nthis study. The magnetospheric inductive electric field has\nalso been suggested to cause variations in the energetic and\nsoft auroral precipitation (Kauristie et al., 1995). In this sce-\nnario, the inductive electric field would disturb the energiza-\ntion process of the cross-tail curvature drifting particles that\ngain energy from the convection electric field (Pellinen and\nHeikkila, 1978, 1984). However, this model predicts a single\nfading of the precipitation prior to the onset rather than a se-\nquence of pulsations.\nOptical auroral arcs are caused by soft electron precipita-\nN. G. Kleimenova et. al.: Riometer and magnetic Pi3 during auroral activations 157\nFig. 6. The integrated intensity of opti-\ncal auroras (in arbitrary units) as a func-\ntion of UT in the regions of the riometer\nbeams at IRI, IVA, and SOD.\ntion with very discrete and localized structure (Weimer et al.,\n1994). Auroral precipitation and the related FACs can os-\ncillate in the frequency range of 1–4 MHz (Samson et al.,\n1996). Moreover, numerous observations (Wedeken et al.,\n1979) have indicated that substorm associated injections of\nenergetic particle precipitation can have variations with peri-\nods of 3–15 min. The oscillations of particle precipitation as-\nsociated with fluctuating upward FACs can enhance the con-\nductivity of the ionosphere and cause periodic variations in\nionospheric currents, which are observed as ground magnetic\npulsations in the same frequency range. The fluctuations in\nthe ionospheric electrojets caused by fluctuating FACs as a\nsource of irregular geomagnetic pulsations have been dis-\ncussed, (by, e.g. Wilhelm et al., 1977; Nagano et al., 1981;\nSuzuki et al., 1981). Kleimenova et al. (1998) showed that\nduring the evening-nighttime, the high latitude Pi3 pulsations\nare typically very localized in latitude and closely associated\nwith the substorm intensification. We observed these pulsa-\ntions in the magnetic field and in the energetic precipitation,\nbut their existence in the optical aurora remains without con-\nfirmation, since the other time variations in the auroral activ-\nity efficiently shield the probable pulsation-type variations.\nPaquette et al. (1994) studied simultaneous riometer and\nmagnetic pulsation events that took place during the daytime.\nThey tested the hypothesis suggested by Coroniti and Kennel\n(1970) which associates the coupled magnetic and precip-\nitation pulsations with the ULF modulation of VLF wave-\nparticle interactions that take place at the magnetospheric\nequator. In this scenario, a ground-based observer in an ap-\npropriate location would observe significantly the onset of\nriometer pulsations before the magnetic pulsations since the\nelectron propagation time from the source region to the iono-\nsphere is much shorter than the Alfve´n transit time. Roughly\none-third of the events of Paquette et al. were consistent with\nthe theory of Coroniti and Kennel. In one-third of the cases,\nthe magnetic pulsations were observed before the precipita-\ntion pulsations, which was most likely due to the localized\nnature of the riometer observations when compared to the\nmagnetic field measurements. In the remaining third of the\nevents, the onsets of riometer and magnetic pulsations were\nsimultaneous. A natural way to explain such behaviour is to\nassume that the fluctuations in the particle precipitation mod-\nulated the ionospheric conductivity and currents, and thus\ncaused the magnetic pulsations (Heacock and Hornsucker,\n1977; Rosenberg et al., 1981; Haldoupis et al., 1982). In none\nof our events did the onset of riometer pulsations preceed the\nmagnetic pulsations. Thus, these events do not provide clear\nsupport for the theory of Coroniti and Kennel. At the auro-\nral breakup on 18:10 UT, the onsets of the two types of pul-\nsations were simultaneous, which suggests that the scenario\nof modulating ionospheric currents would be more valid, at\nleast for this specific case.\nProfound evidence of magnetic Pi3-pulsations, generated\nby modulating ionospheric currents, is presented in the study\nof Haldoupis et al. (1982), where riometer and magnetic\nrecordings are analysed together with the data of the STARE\nVHF-radar. In the radar data, pulsations with a similar fre-\nquency (T∼ 3–4 min) as in the magnetic and riometer data\ncan be seen in the backscatter intensity (which is proportional\nto the electron density), but not in the electric field. The\nauthors associate the magnetic variations with ionospheric\nHall-currents which vary due to the precipitation fluctua-\ntions. In their case, the pulsations in the riometer and mag-\nnetic X-component were in phase, while in the events anal-\nysed, here the two types of pulsations were both in phase\nand anti-phase: at 18:10 UT, the absorption pulsations were\nstrongest at SOD and they were in anti-phase with the mag-\nnetic pulsations at the same station (Fig. 4, panel c), while\n158 N. G. Kleimenova et. al.: Riometer and magnetic Pi3 during auroral activations\nafter 20:00 UT, the absorption pulsations recorded at IRI\nwere in phase with the TRO magnetic pulsations. Similar\nto the study of Haldoupis et al., the magnetic pulsations can\nbe associated with Hall-currents and especially associated\nwith the Hall-current vortices at the footpoints of the up-\nward enhancing FACs at the auroral breakups. At 18:10 UT,\nSOD (OUJ) was northward (southward) of the FAC foot-\npoint and thus the enhancements in the precipitation (cor-\nresponding positive dB-values in Fig. 4, panel c) and in\nHall-currents caused negative (positive) deviations in the X-\ncomponent and consequently, the riometer and X-pulsations\nwere in anti-phase (phase). After 20:00 UT, the magnetome-\nter stations TRO, KIR, KEV were southward of the FAC\nfootpoint and consequently, the enhancement in the Hall-\ncurrent caused positive X-deviations at these stations (Fig. 4,\npanel a). The systematics in the pulsations, however, are not\nclear, e.g. the riometer pulsations recorded at IVA are in anti-\nphase with the X-pulsations recorded at the nearby stations\nKEV. Unfortunately, STARE data are not available for this\nday and thus we cannot check whether electric field varia-\ntions could explain the non-systematic behaviour.\nThe magnetospheric mechanism which generates the pul-\nsations in the energetic precipitation still remains an open\nquestion. In the model of Coroniti and Kennel (1970) for\ndayside activity, the basic mechanism that causes particle\nprecipitation is the VLF wave-particle interaction process at\nthe magnetospheric equator. In the nightside, the particle pre-\ncipitation is also controlled by the substorm related changes\nin the magnetic field configuration. When the magnetotail\nstretches, for example, during the substorm growth phase,\nparticle trajectories become randomised near the equatorial\nplace which causes precipitation. According to the present\nunderstanding, substorms can be associated with activity in\ntwo different regions: The current disruption region in the\nnear-Earth tail and the reconnection region in the mid-tail\n(Baker et al., 1996; Lui, 1978). The observations analysed\nin this study were made in the conjugate region of the near-\nEarth magnetosphere and thus it is reasonable to assume that\nthe Pi3 pulsations were related to the current disruption pro-\ncess.\nThe mechanisms of acceleration of the breakup associated\nwith soft precipitation and energetic precipitation are differ-\nent. Acceleration region processes at an ∼ 1–2RE altitude\ncontrol the distribution of soft auroral precipitation while\nthe processes near the magnetospheric equatorial plane con-\ntrol the appearance of energetic precipitation. The exam-\nples analysed in this study, as well as the events analysed\nby Lazutin et al. (2000), demonstrate that the most intensive\nauroral brightenings and injections of energetic precipitation\nare coupled both spatially and temporally. The observations\ngive the impression as if the injections of energetic particle\nprecipitation would catalyse the build-up of field-aligned po-\ntential and create a drop in the acceleration region. Under-\nstanding of the interaction process between these two sepa-\nrate magnetospheric regions is a challenging issue for future\nstudies.\n5 Summary and conclusions\nBased on our observations, we can conclude that:\n– Substorm related bursts of Pi3 geomagnetic pulsations\nare very localized on the ground. and they coincid with\nthe bursts of riometer absorption. The spectra of riome-\nter and geomagnetic pulsations are similar;\n– Pi3 pulsations (magnetic and riometer) are spatially and\ntemporally coupled with auroral breakups and upward\ndirected field-aligned currents;\n– In one of our breakup events, the onsets of riometer and\nmagnetic pulsations were simultaneous which leans to-\nwards supporting the theory that relates magnetic pul-\nsations to ionospheric conductivity modulations rather\nthan the theory that suggests a common magnetospheric\nsource region for both riometer and magnetic pulsa-\ntions.\nAcknowledgement. The Academy of Finland supported the visits\nof N. K. and O. K. to Finland. The MIRACLE network is op-\nerated as an international collaboration under the leadership of\nthe Finnish Meteorological Institute. The IMAGE magnetometer\ndata are collected as a Finnish-German-Norwegian-Polish-Russian-\nSwedish project.\nTopical Editor G. Chanteur thanks M. Kosch and E. Nielsen for\ntheir help in evaluating this paper.\nReferences\nAkasofu, S.-I.: The Development of the Auroral Substorm, Planet.\nSpace Sci., 12, 273–282, 1964.\nAnderson, K. A. and DeWitt, R.: Space-time association of auroral\ngrow and X-rays at balloon altitude, J. Geophys. Res., 68, 2669–\n2675, 1963.\nBarcus, J. R.: Balloon observations on the relationship of energetic\nelectrons to visual aurora and auroral absorption, J. Geophys.\nRes., 70, 2135–2147, 1965.\nBaker, D. N., Pulkkinen, T. I., Angelopoulos, V., Baumjohann, W.,\nand McPherron, R. L.: Neutral line model of substorms: Past\nresults and present view, J. Geophys. Res., 101, 12 975–13 010,\n1996.\nBirn, J. and Hesse, M.: Substorm effects in MHD and test parti-\ncle simulations of magnetotail dynamics, in: Substorms-4, (Eds)\nKokubun, S. and Kamide, Y., Proc. International Conference on\nSubstorms-4, Lake Hamana, Japan, Terra Scientific Publishing\nCompany, Tokyo, 159–164, 1998.\nBrowne, S., Hargreaves, J. K., and Honary, B.: An imaging riometer\nfor ionospheric studies, Electronics and Communications, 7 (5),\n209–217, 1995.\nCoroniti, F. V. and Kennel, C. F.: Electron precipitation pulsations,\nJ. Geophys. Res., 75, 1279–1289, 1970.\nElphinstone, R. D., Murphree, J. S., and Cogger, L. L.: What is a\nGlobal substorm, Rev. of Geophys., 34, 169–232, 1996.\nFeldstein, Y. I. and Galperin, Y. I.: The auroral luminosity structure\nin the high latitude upper atmosphere: Its dynamic and relation-\nship to the large-scale structure of the Earth’s magnetosphere,\nRev. Geophys., 59, 83–165, 1985.\nN. G. Kleimenova et. al.: Riometer and magnetic Pi3 during auroral activations 159\nFukunishi, H.: Dynamic relationship between proton and electron\nauroral substorm, J. Geophys. Res., 80, 553–574, 1975.\nHaldoupis, C. I., Nielsen, E., Holtet, J. A., Egeland, A., and Chivers,\nH. A.: Radar auroral observations during a burst of irregular\nmagnetic pulsations, J. Geophys. Res., 87, 1541–1550, 1982.\nHeacock, R. R. and Hunsucker, R. D.: A study of concurrent mag-\nnetic field and particle precipitation pulsations 0.005 to 0.5 Hz\nrecorded near College, Alaska, J. Atmos. Terr. Phys., 39, 487–\n501, 1977.\nKauristie, K., Pulkkinen, T. I., Pellinen, R. J., Janhunen, P., Hu-\nuskonen, A., Viljanen, A. Opgenoorth, H. J. Heikkila, W. J.,\nand Baker, D. N.: Analysis of the substorm trigger phase using\nmultiple ground-based instrumentation, Geophys. Res. Lett., 22,\n2065–2068, 1995.\nKiselev, B. V. and Raspopov, O. M.: Excitation of Pi3 pulsations\nduring substorms, in: Memuars of Nation. Institute of Polar Res.\nNo. 6. Proc. of IAGA Meeting of, Unmanned Observations in\nAntarctica, (Ed) Nagata, T., 88–96, 1976.\nKleimenova, N. G., Kozyreva, O. V., Bitterly, J., and Bitterly, M.:\nLong period (T = 8–10 min) geomagnetic pulsations at high lati-\ntudes, Geomagnetism and Aeronomy, 38, 436–445, 1998.\nLazutin, L. L., Borovkov, L. P., Kozelova, T. V., Kornilov, I. A.,\nTagirov, V. R., Korth, A., Stadsnes, J., and Ullaland, S.: Inves-\ntigation of the conjugacy between auroral breakup and energetic\nelectron injection, J. Geophys. Res., 105, 18 495–18 503, 2000.\nLui, A. T. Y.: Current disruption in the Earth’s magnetosphere: Ob-\nservations and models, J. Geophys. Res., 101, 13 067–13 088,\n1996.\nLui, A. T. Y. and Burrows, J. R.: On the location of auroral arcs\nnear substorm onsets, J. Geophys. Res., 83, 3342–3348, 1978.\nLu¨hr, H., Aylward, A., Buchert, S. C., Pajunpa¨a¨, A., Pajunpa¨a¨, K.,\nHolmboe, T., and Zalewski, S. M.: Westward moving dynamic\nsubstorm features observed with the IMAGE magnetometer net-\nwork and other ground-based instruments, Ann. Geophysicae,\n16, 425–440, 1998.\nMcPherron, R. L., Russell, C. T., and Aubry, M. P.: Satellite studies\nof magnetospheric substorms on 15 August 1968, 9. Phenomeno-\nlogical Model for Substorms, J. Geophys. Res., 78, 3131–3149,\n1973.\nMersmann, U., Baumjohann, W., Ku¨ppers, F., and Lange, K.: Anal-\nysis of an eastward electrojet by means of upward continuation\nof ground-based magnetometer data, J. Geophys., 45, 281–298,\n1979.\nNagano, H., Suzuki, A., Kim, J. S., and Sugiura, M.: Pi3 mag-\nnetic pulsations associated with substorms, Planet. Space Sci.,\n29, 529–553, 1981.\nNielsen, E., Bamber, J., Chen, Z.-S., Brekke, A., Egeland, A., Mur-\nphree, J. S., Venkatesan, D., and Axford, W. I.: Substorm expan-\nsion into the polar cap, Ann. Geophysicae, 6, 559–572, 1988.\nOlson, J. V.: Pi2 pulsations and substorm onsets: A review, J. Geo-\nphys. Res., 104, 17 499–17 520, 1999.\nPaquette, J. A., Matthews, D. L., Rosenberg, T. J., Lanzerotti, L. J.,\nand Inan, U. S.: Source regions of long-period pulsation events in\nelectron precipitation and magnetic fields at South Pole Station,\nJ. Geophys. Res., 99, 3869–3877, 1994.\nPellinen, R. J. and Heikkila, W. J.: Energization of charged particles\nto high energies by an induced substorm electric field within the\nmagnetotail, J. Geophys. Res., 83, 1544–1550, 1978.\nPellinen, R. J. and Heikkila, W. J.: Inductive electric fields in the\nmagnetotail and their relation to auroral and substorm phenom-\nena, Space Sci. Rev., 37, 1–61, 1984.\nPytte, T., Trefall, H., Kremser, G., Jalonen, L., Riedler, W.: On the\nmorphology of energetic (> 30 keV) electron precipitation dur-\ning the growth phase of magnetospheric substorms, J. Atmos.\nTerr. Phys., 38, 739–755, 1976.\nRanta, A. and Ranta, H.: Satellite and Ground Observations of a\nPre-Substorm Phase on 4 May 1977, J. Geophys. Res., 88, 4097–\n4104, 1983.\nRanta, H., Ranta, A., Collis, P. N., and Hargreaves, J. K.: De-\nvelopment of the auroral absorption substorm: Studies of pre-\nonset phase and sharp onset using an extensive riometer network,\nPlanet. Space Sci., 29, 1287–1313, 1981.\nRaspopov, O. M., Kiselev, B. V., Roldugin, V. K., and Ghernous, S.\nA.: Polar irregular pulsations PiP, IAGA Bulletin, 34, 432, 1973.\nRosenberg, T. J., Morris, P. B., and Lanzerotti, L. J.: Excitation\nof magnetospheric hydromagnetic waves by solar-flare induced\nchange in ionospheric conductivity, Phys. Rev. Lett., 47, 1343–\n1346, 1981.\nSaito, T.: Long-period irregular magnetic pulsations Pi3, Space.\nSci. Rev., 21, 427–467, 1978.\nSamson, J. C., Cogger, L. L., and Pao, Q.: Observations of field line\nresonances, auroral arcs, and auroral vortex structures, J. Geo-\nphys. Res., 101, 17 373–17 383, 1996.\nShiokawa K., Baumjohann, W., and Haerendel, G.: Braking of\nhigh-speed flows in the near-Earth tail, Geophys. Res. Lett., 24,\n1179–1182, 1997.\nStuart, W. F., Green, C. A., and Harris, T. J.: Correlations between\nmodulations of the intensity of precipitating electrons in the au-\nroral zone and coincident Pi2, J. Atmos. Terr. Phys., 39, 631–635,\n1977.\nSuzuki, A., Nagano, H., Kim, J. S., and Sagiura, M.: A statistical\nstudy on characteristics of high latitude Pi3 pulsations, J. Geo-\nphys. Res., 86, 1345–1354, 1981.\nSyrja¨suo, M. T., Pulkkinen, T. I., Janhunen, P., Viljanen, A., Pelli-\nnen, R. J., Kauristie, K., Opgenoorth, H. J., Wallman, S., Eglitis,\nP., Karlsson, P., Amm, O., Nielsen, E., and Thomas, C.: Obser-\nvations of substorm electrodynamics using the MIRACLE net-\nwork, in: Substorms-4, (Eds) Kokubun, S. and Kamide, Y., Proc.\nInternational Conference on Substorms-4, Lake Hamana, Japan,\nTerra Scientific Publishing Company, Tokyo, 111–114, 1998.\nWedeken, U., Hillebrand, O., Krenzien, E., Ranta, A., Ranta, H.,\nand Voelker, H.: Cosmic noise absorption events and magnetic\npulsations activity during substorms, J. Geophys. Res., 46, 249–\n259, 1979.\nWeimer, D. R., Craven, J. D., Frank, L. A., Hanson, W. B., May-\nnard, N. C., Hoffman, R. A., and Slavin, J. A.: Satellite measure-\nments through the center of substorm surge, J. Geophys. Res.,\n99, 23 639–23 649, 1994.\nWilhelm, K., Munch, J. W., and Kremser, G.: Fluctuations of the\nauroral zone current system and geomagnetic pulsations, J. Geo-\nphys. Res., 82, 2705–2716, 1977.\n"}