{"doi":"10.1017\/S0028688503000080","coreId":"65559","oai":"oai:dro.dur.ac.uk.OAI2:476","identifiers":["oai:dro.dur.ac.uk.OAI2:476","10.1017\/S0028688503000080"],"title":"Altering the default setting : re-envisaging the early transmission of the Jesus tradition.","authors":["Dunn,  J. D. G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-07","abstract":"The literary mindset (‘default setting’) of modern Western culture prevents those trained in that culture from recognizing that oral cultures operate differently. The classic solution to the Synoptic problem, and the chief alternatives, have envisaged the relationships between the Gospel traditions in almost exclusively literary terms. But the earliest phase of transmission of the Jesus tradition was without doubt predominantly by word of mouth. And recent studies of oral cultures provide several characteristic features of oral tradition. Much of the Synoptic tradition, even in its present form, reflects in particular the combination of stability and flexibility so characteristic of the performances of oral tradition. Re-envisaging the early transmission of the Jesus tradition therefore requires us to recognize that the literary paradigm (including a clearly delineated Q document) is too restrictive in the range of possible explanations it offers for the diverse\/divergent character of Synoptic parallels. Variation in detail may simply attest the character of oral performance rather than constituting evidence of literary redaction","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65559.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/476\/1\/476.pdf","pdfHashValue":"19dba83a50216b47dc7e1c496638b8e54522059f","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:476<\/identifier><datestamp>\n      2011-06-03T15:41:27Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Altering the default setting : re-envisaging the early transmission of the Jesus tradition.<\/dc:title><dc:creator>\n        Dunn,  J. D. G.<\/dc:creator><dc:description>\n        The literary mindset (‘default setting’) of modern Western culture prevents those trained in that culture from recognizing that oral cultures operate differently. The classic solution to the Synoptic problem, and the chief alternatives, have envisaged the relationships between the Gospel traditions in almost exclusively literary terms. But the earliest phase of transmission of the Jesus tradition was without doubt predominantly by word of mouth. And recent studies of oral cultures provide several characteristic features of oral tradition. Much of the Synoptic tradition, even in its present form, reflects in particular the combination of stability and flexibility so characteristic of the performances of oral tradition. Re-envisaging the early transmission of the Jesus tradition therefore requires us to recognize that the literary paradigm (including a clearly delineated Q document) is too restrictive in the range of possible explanations it offers for the diverse\/divergent character of Synoptic parallels. Variation in detail may simply attest the character of oral performance rather than constituting evidence of literary redaction.<\/dc:description><dc:subject>\n        Oral culture<\/dc:subject><dc:subject>\n         Literary paradigm<\/dc:subject><dc:subject>\n         Synoptic tradition.<\/dc:subject><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        New Testament studies, 2003, Vol.49(2), pp.139-175 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:476<\/dc:identifier><dc:identifier>\n        issn:0028-6885<\/dc:identifier><dc:identifier>\n        issn: 1469-8145<\/dc:identifier><dc:identifier>\n        doi:10.1017\/S0028688503000080<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/476\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S0028688503000080<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/476\/1\/476.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0028-6885","0028-6885","issn: 1469-8145"," 1469-8145"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":["Oral culture","Literary paradigm","Synoptic tradition."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n24 August 2009\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nDunn, J. D. G. (2003) ’Altering the default setting : re-envisaging the early transmission of the Jesus\ntradition.’, New Testament studies., 49 (2). pp. 139-175.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S0028688503000080\nPublisher’s copyright statement:\nAdditional information:\nCambridge University Press 2003.\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nAltering the Default Setting: Re-envisaging\nthe Early Transmission of the Jesus\nTradition*\nJAMES D. G. DUNN\nDepartment of Theology, Abbey House, Palace Green, Durham DH1 3RS\nThe literary mindset (‘default setting’) of modern Western culture prevents those\ntrained in that culture from recognizing that oral cultures operate differently. The\nclassic solution to the Synoptic problem, and the chief alternatives, have envis-\naged the relationships between the Gospel traditions in almost exclusively liter-\nary terms. But the earliest phase of transmission of the Jesus tradition was\nwithout doubt predominantly by word of mouth. And recent studies of oral cul-\ntures provide several characteristic features of oral tradition. Much of the\nSynoptic tradition, even in its present form, reflects in particular the combination\nof stability and flexibility so characteristic of the performances of oral tradition.\nRe-envisaging the early transmission of the Jesus tradition therefore requires us\nto recognize that the literary paradigm (including a clearly delineated Q docu-\nment) is too restrictive in the range of possible explanations it offers for the\ndiverse\/divergent character of Synoptic parallels. Variation in detail may simply\nattest the character of oral performance rather than constituting evidence of lit-\nerary redaction.\n1. Defining a default setting\nFor some time now I have been reflecting on the perils of the ‘default set-\nting’. For any who may be less than familiar with the pleasures and perils of com-\nputers or of word-processing, let me explain. From my Idiot’s Guide to the\nOne-Eyed Monster I read this definition: ‘Default is a pre-set preference that is\n\n* The Presidential address at the 57th Annual Meeting of Studiorum Novi Testamenti Societas\nat the University of Durham 6–10 August 2002. I wish to acknowledge my debt to Annekie\nJoubert for advice on current research into oral culture in southern Africa, and to Werner\nKelber for several helpful comments on an earlier draft of the paper. But particularly also to\nTerence Mournet who has worked closely with me on the theme of oral tradition in the\nGospels for nearly three years. Not only has he provided invaluable advice on bibliography\nand the Powerpoint oral presentation of the ‘live’ paper, but several of the insights and\nobservations developed in the paper are the outcome of our joint deliberations over the past\ntwo years.\nNew Test. Stud. , pp. –. Printed in the United Kingdom ©  Cambridge University Press\nDOI:10.1017\/S0028688503000080\nused by a program, the “fallback” position.’ In word-processing, for example,\nthere may be a default setting for the style of type and size of font used – let us say,\nNew York type, 12 point size; also for margins of a certain width – let us say, 2\ninches.\nThe problems come when you want to change your default settings. You may\nwant a broader margin (2.5 inches), to use Palatino type and font of 10 point size.\nAnd so you set up all these different options; you format the document you are\nwriting according to your own design, and override the default settings provided\nfor you by your computer or program. All that is fine, and you produce the docu-\nment according to your preferred format. The trouble is, that when you open a\nnew document, and want to start afresh, you find that, whether you wanted it to\nor not, your format has reverted to the original default settings.\nThe default setting means that when you want to create something different,\nyou need constantly to resist the default setting, you need consciously to change\nor alter it. But when you turn your attention elsewhere, the default setting, the\npre-set preference, reasserts itself.1\nThe default setting is a useful image to remind us of our own pre-set prefer-\nences, the mindset by which we unconsciously, instinctively process and format\ninformation. The most obvious example today is the difficulty many (most) of my\ngeneration in Britain have in dealing with centimetres and litres. Inches and feet\nand pints are so deeply bred into us, we automatically think in these terms. They\nare our default settings. I think inches; I do not think centimetres. And when con-\nfronted with centimetres I must consciously revise my way of looking at the item\nin question.\nSimilarly, perhaps, with languages. Many here are fluent in several languages.\nBut the first language, the language of childhood, is likely to be the default lan-\nguage. In moments of stress or great emotion our involuntary reflex is to speak in\nour mother tongue.\nThe more serious examples are the default settings which determine our atti-\ntudes and behaviour towards others. Through the nineteenth and most of the\ntwentieth centuries, the idea of progress was a default setting. It was the way\nEuropean academics saw history and the historical role of the West. That is, we\nunderstood progress as scientific advance, as the spread of European ‘civiliza-\ntion’. The consequences are still a major factor in our relationships with Africa\nand the Far East.\nIn Britain the mistakes made in investigating the tragic murder of a black\nLondon teenager in 1993 forced us to confront the reality of what the official\n140  . . \n1 On a computer, of course, the experienced operator can easily alter the default setting. My\npoint is that it is much more difficult to alter the default setting of the ‘onboard mental com-\nputer’. The analogy is not precise!\nreport, the Macpherson Report, described as ‘institutional racism’.2 ‘Institutional\nracism’ is Macpherson’s term for a prejudicial mindset towards individuals of\nanother race which unconsciously predetermines attitudes and actions in par-\nticular instances. ‘Institutional racism’, in other words, is another example of a\ndefault setting – an involuntary reflex attitude, a ‘pre-set preference’ in attitudes\nendemic within, in the case in point, the Metropolitan Police Force. The point was\nnot to deny that such attitudes were being combatted, not to deny that when\nmembers of the Metropolitan Police concentrated on the problem they succeeded\nin avoiding racist sentiments. The point rather was that when people did not con-\ncentrate on the problem, when they relaxed their vigilance, they fell back to their\ndefault setting; their actions expressed their involuntary, pre-set preferences.\nSo too in Christian circles, and in NT scholarship, it is only relatively recently\nthat we have become aware of the default setting of centuries-old patriarchalism.\nWe simply took it for granted, as an unexamined a priori, that ‘man’ of course\ndenotes humanity, that ‘brethren\/brothers’ of course was an appropriate way to\naddress a Christian congregation. I recall the shock I experienced when working\non Rom 16 to find commentators convinced that prostavti~ in 16.2 could mean\nonly something like ‘helper’ (RSV), because, of course, a woman (Phoebe) could\nnot have been a ‘patron’, the normal meaning of the word prostavti~. Likewise,\nthe accusative ∆Iounivan must denote a man, Junias rather than Junia, because, of\ncourse, a woman could not have been ‘outstanding among the apostles’ (16.7).3\nWas such logic not indicative of a patriarchalist mindset or default setting?\nIf anything, more serious has been what might be called the ‘institutional anti-\nsemitism’, or more accurately anti-Judaism, which for so long disfigured Christian\ntheology, including NT scholarship. What was it that caused our predecessors to\npersevere with a description of Second Temple Judaism as ‘late Judaism’,\nSpätjudentum, well into the second half of the twentieth century? They must have\nbeen aware that such a description perpetuated Christian supersessionism, the\nbelief that Judaism’s only function was to prepare for Christianity, so that when\nChristianity came Judaism ceased to have a reason for existence, so that first-\ncentury Judaism was late Judaism, the last Judaism. Such a supersessionist\nattitude must have become so inbred over centuries, an involuntary reflex, a sub-\nconscious default setting, that our predecessors fell back to it without thinking.\nA default setting, then, a computer’s pre-set preferences, is a useful image of\nan established mindset, an unconscious bias or Tendenz, an instinctive reflex\nresponse. The point is that to alter a default setting, to change a habitual attitude\nAltering the Default Setting 141\n2 The Macpherson Report on The Stephen Lawrence Inquiry (1999) identifies ‘institutional\nracism’ in ‘processes, attitudes and behaviour which amount to discrimination through\nunwitting prejudice, ignorance, thoughtlessness and racist stereotyping which disadvan-\ntages minority ethnic people’ (28).\n3 For details see J. D. G. Dunn, Romans (WBC 38; Dallas: Word, 1988) 888–9, 894–5.\nor instinctive perspective, requires a conscious and sustained or repeated effort,\notherwise we revert to the default setting, to our unexamined predispositions,\nwithout realizing it.\nHowever, it is another default setting in NT scholarship that I want to speak\nabout in this paper.\n2. The literary paradigm\nWe here are all children of Gutenberg and Caxton. We belong to cultures\nshaped by the book. Our everyday currency is the learned article and monograph.\nLibraries are our natural habitat. We trace the beginnings of our modern disci-\npline to the Renaissance’s reassertion of the importance of studying classical texts\nin their original languages, to Erasmus’s first Greek NT in 1516. Our discipline\ndeveloped in the nineteenth century round the distinction between ‘lower criti-\ncism’, the attempt to reconstruct the original text of our NT writings, and ‘higher\ncriticism’, concerned with questions of sources and genre. The dominant mode of\ntreating the Synoptic Gospels during the last generation has been redaction criti-\ncism, the Gospels as the product of literary editing. A major concern for many\ntoday is summed up in the word ‘intertextuality’, where the appropriation of\nearlier texts, oral as well as written, is conceived in exclusively literary terms.\nIn a word, we naturally, habitually and instinctively work within a literary par-\nadigm. We are, therefore, in no fit state to appreciate how a non-literary culture,\nan oral culture, functions. And if we are to enter empathetically into such a cul-\nture it is essential that we become conscious of our literary paradigm and make\ndeliberate efforts to step outside it and to free ourselves from its inherited predis-\npositions. It becomes necessary to alter the default settings given by the literary-\nshaped software of our mental computers.\nThe prevalence of the literary paradigm in study of the Synoptic tradition can\nbe readily illustrated, as also the fact that it has both shaped and restricted NT\nscholarship’s way of envisaging the Jesus tradition and its early transmission.\nI need only remind you of the eighteenth- and nineteenth-century debate\nabout the origins of the Synoptic tradition.4 The early solution of Lessing and\n142  . . \n4 Of the various reviews and analyses I found the following most helpful: T. Zahn, Introduction\nto the New Testament (ET 3 vols; Edinburgh: T. & T. Clark, 1909) 2.400–27; J. Moffatt, An\nIntroduction to the Literature of the New Testament (Edinburgh: T. & T. Clark, 1911, 31918)\n179–217; W. G. Kümmel, Introduction to the New Testament (1973; ET London: SCM, 1975)\n44–80; B. Reicke, The Roots of the Synoptic Gospels (Philadelphia: Fortress, 1986) ch. 1; E. P.\nSanders and M. Davies, Studying the Synoptic Gospels (London: SCM, 1989) 51–162; U.\nSchnelle, The History and Theology of the New Testament Writings (ET London: SCM, 1998)\n162–97; J. S. Kloppenborg Verbin, Excavating Q: The History and Setting of the Sayings Gospel\n(Minneapolis: Fortress, 2000) 271–408.\nEichhorn was of an original gospel composed in Aramaic, written as early as AD\n35, and known to the three Synoptic evangelists in different recensions.5\nSchleiermacher’s ‘Fragment hypothesis’ was conceived in terms of multiple writ-\nten sources, in which various recollections, notes or reports of Jesus had been\nwritten.6 It is true that Herder and Gieseler thought more in terms of an orally for-\nmulated tradition; though Herder was evidently still thinking of a full gospel, ‘a\nhistory of Christ’;7 and Gieseler assumed that frequent repetition produced a fixed\nform of the narrative and outline of Gospel history from the Baptist onwards in\nwhich the most important events and sayings were reproduced with great unifor-\nmity, so that this Gospel survived, in spite of modifications, in its original stereo-\ntyped form.8\nSuch alternatives, however, were swamped by the dominant impression that\n‘the Synoptic problem’ could be solved only in terms of literary sources, that the\nintricate variations and coincidences in the Synoptic Gospels could be realistically\nexplained only in terms of literary dependence. As James Moffatt summed up the\nnineteenth-century debate:\nThe gospels are books made out of books; none of them is a document\nwhich simply transcribes the oral teaching of an apostle or of apostles. Their\nagreements and differences cannot be explained except on the hypothesis\nof a more or less close literary relationship, and while oral tradition is a vera\ncausa, it is only a subordinate factor in the evolution of our canonical Greek\ngospels.9\nIt should occasion no surprise, then, that the hypothesis which emerged in the\nlate nineteenth and early twentieth centuries as the most plausible resolution of\nthe Synoptic problem is still known simply as the two document hypothesis.10 And\neven when some variations are offered in explanation of some of the complexities\nAltering the Default Setting 143\n5 For Lessing see his ‘Neue Hypothese über die Evangelisten’, Werke 7: Theologiekritische\nSchriften I und II (München: Carl Hanser, 1976) 614–36; ET H. Chadwick, Lessing’s Theological\nWritings (London: A. & C. Black). W. G. Kümmel, The New Testament: The History of the\nInvestigation of its Problems (1970; ET Nashville: Abingdon, 1972) provides extensive excerpts\nfrom both Lessing and Eichhorn (76–9). See also Zahn, Introduction, 2.403–4; Schnelle,\nHistory, 162–3.\n6 Reicke, Roots, 12–13, refers to F. Schleiermacher, Über die Schriften des Lukas. Ein kritischer\nVersuch (Berlin: Reimer, 1817), 15 years before the better known ‘Über die Zeugnisse des\nPapias von unseren beiden ersten Evangelien’, Theologische Studien und Kritiken 5 (1832)\n738–58.\n7 J. G. Herder, ‘Vom Erlöser der Menschen’, Herder Werke: Theologische Schriften 9\/1\n(Frankfurt: Deutscher Klassiker, 1994) particularly 671–87 (here 679); see also Reicke, Roots,\n9–12.\n8 I echo Zahn’s description (Introduction, 2.409).\n9 Moffatt, Introduction, 180.\n10 There is no need to rehearse the usual litany of Lachmann, Weisse, etc.; for details see e.g.\nKümmel, New Testament, 146–51; Kloppenborg Verbin, Excavating Q, 295–309.\nof the data, like Urmarkus or Proto-Luke, what is envisaged are still written docu-\nments.11 The literary paradigm continues to determine the way the problem and\nits solution are conceptualised. B. H. Streeter certainly recognized the importance\nof ‘a living oral tradition’ behind the Gospels and cautioned against studying the\nSynoptic problem ‘merely as a problem of literary criticism’, but, ironically, he\nwent on to develop ‘a four document hypothesis’.12\nThe main development from and challenge to source criticism was, of course,\nform criticism, which began as a deliberate attempt to break away from the liter-\nary paradigm to conceptualise the transmission process in oral terms. The char-\nacter of the challenge was already signalled by Wellhausen’s observation that ‘Die\nletzte Quelle der Evangelien ist mündliche Überlieferung, aber diese enthält nur\nden zerstreuten Stoff’.13 In effect Wellhausen was combining the hypotheses of\nHerder and Schleiermacher – Jesus tradition as oral tradition but in small units.\nBultmann took up the challenge when he defined the purpose of form criticism\nthus: ‘to study the history of the oral tradition behind the gospels’.14 His analysis\nof The History of the Synoptic Tradition, I need hardly remind you, became the\nsingle most influential exposition of Formgeschichte.15\nUnfortunately, however, Bultmann could not escape from the literary default\nsetting; he could not conceive the process of transmission except in literary terms.\nThis becomes most evident in his conceptualization of the whole tradition about\nJesus as ‘composed of a series of layers’.16 The imagined process is one where each\nlayer is laid or builds upon another. Bultmann made such play with it because,\napart from anything else, he was confident that he could strip off later\n(Hellenistic) layers to expose the earlier (Palestinian) layers.17 The image itself,\nhowever, is drawn from the literary process of editing, where each successive\nedition (layer) is an edited version (for Bultmann, an elaborated and expanded\nversion) of the previous edition (layer). But is such a conceptualization really\nappropriate to a process of oral retellings of traditional material? Bultmann never\nreally addressed the question, despite its obvious relevance.\nSimilarly, Kümmel in his classic Introduction recognizes the importance of\noral tradition, both in ‘fixing’ the gospel material in written form and in the\n144  . . \n11 On Urmarkus see e.g. Kümmel, Introduction, 61–3; and Proto-Luke, particularly V. Taylor,\nBehind the Third Gospel (Oxford: Clarendon, 1926).\n12 B. H. Streeter, The Four Gospels: A Study of Origins (London: Macmillan, 1924) ch. 9 (quota-\ntions from 229).\n13 J. Wellhausen, Einleitung in die drei ersten Evangelien (Berlin: Georg Reimer, 1905) 43.\n14 R. Bultmann (with K. Kundsin), Form Criticism (1934; ET New York: Harper Torchbook, 1962)\n1.\n15 R. Bultmann, Die Geschichte der synoptischen Tradition (Göttingen: Vandenhoeck &\nRuprecht, 1921; ET Oxford: Blackwell, 1963).\n16 R. Bultmann, Jesus and the Word (1926; ET New York: Scribners, 1935) 12–13.\n17 Ibid.\nreworking of the earliest sources into the canonical Gospels; but his discussion\nfocuses mainly on the two-source hypothesis and his references to form-critical\nanalyses do little to carry the discussion forward or to envisage how a process of\noral transmission worked or how it might have influenced the shape of the tra-\ndition.18 It may be true, as E. P. Sanders affirms, that ‘everyone accepts oral trans-\nmission at the early stages of the gospel tradition’.19 But in reality the role of oral\ntradition is either reduced to characteristically fragmentary forms,20 or when\nunknown oral sources are postulated, the working assumption, signalled by the\nword ‘source’ itself, is usually that the source was in effect a fixed version of some\nJesus tradition used by the evangelist as one would use a written document.21\nEven more revealing are the various more recent attempts to contest the dom-\ninance of the two-document hypothesis. W. Farmer’s attempt to revive the\nGriesbach hypothesis (Luke dependent on Matthew, and Mark on both) only\nbegins to make sense if the Synoptic problem is viewed in exclusively literary\nterms, of one document dependent on and derived from another.22 Sanders’s jus-\ntified critique of Bultmann’s assumption of a uniform tendency in the develop-\nment of the original ‘pure forms’ of the Jesus tradition itself suffers from the idea\nof linear development evoked by the word ‘tendency’.23 M. E. Boismard in turn\nassumes that the complexity of the Synoptic problem can be resolved only by a\ncomplex literary solution, a multi-stage interaction among earlier and later ver-\nsions of the three Synoptic Gospels.24 M. D. Goulder demonstrates that once the\nhypothesis of literary dependence is given exclusive explanatory rights, then, with\nAltering the Default Setting 145\n18 Kümmel, Introduction, particularly 76–9; Schnelle’s acknowledgment of the role of oral tra-\ndition is cursory (History, 174).\n19 Sanders and Davies, Studying, 141. Sanders and Davies, and Reicke (Roots), are fairly excep-\ntional in the importance they have accorded to oral tradition in the development of the Jesus\ntradition.\n20 ‘. . . those fragments of tradition that bear the imprint of orality: short, provocative, memor-\nable, oft-repeated phrases, sentences and stories’ (R. W. Funk and R. W. Hoover, The Five\nGospels: The Search for the Authentic Words of Jesus [New York: Macmillan\/Polebridge, 1993]\n4).\n21 ‘Even now, when we have come to affirm that behind some or many of the literary works we\ndeal with there is an oral tradition, we still manipulate such traditions as though they too\nwere “literary” works’ (W. H. Silberman, ‘“Habent Sua Fata Libelli”: The Role of Wandering\nThemes in Some Hellenistic Jewish and Rabbinic Literature’, in W. O. Walker, ed., The\nRelationships Among the Gospels [San Antonio: Trinity University, 1978] 195–218 [here 215]).\n22 W. R. Farmer, The Synoptic Problem (New York: Macmillan, 1964) ch. 6.\n23 E. P. Sanders, The Tendencies of the Synoptic Tradition (SNTSMS 9; Cambridge: Cambridge\nUniversity, 1969).\n24 M. E. Boismard, ‘The Two-Source Theory at an Impasse’, NTS 26 (1979) 261–73; also ‘Théorie\ndes niveaux multiples’, in D. L. Dungan, ed., The Interrelations of the Gospels: A Symposium\nLed by M.-É. Boismard, W. R. Farmer, F. Neirynck, Jerusalem 1984 (BETL 95; Leuven: Leuven\nUniversity, 1990) 231–43. See also the discussion in Sanders and Davies, Studying, 105–11.\nsufficient imagination and ingenuity, Matthew can be derived entirely from Mark,\nand Luke by a combination of the prior two.25 And Mark Goodacre, despite\nacknowledging the potential importance of oral tradition, discusses individual\ncases in terms exclusively of literary dependence.26\nAt the present time the main focus of interest lies in Q. As the transition from\nnineteenth to twentieth centuries was dominated by fascination with the Gospel\nof Mark, so the transition from twentieth to twenty-first centuries has been domi-\nnated by fascination with the second of the two sources in the two-document\nhypothesis – the second source common to Matthew and Luke, the sayings source\nQ. That Q was a document, written in Greek, is one of the principal points of con-\nsensus; although overdependence on the literary paradigm again dictates, as with\nMark and Urmarkus, that divergences between Matthew and Lukan Q material\nhave to be explained by postulating different versions of Q, a QMt and a QLk.27 The\ndebate, however, now focuses on the issue whether different compositional layers\ncan be distinguished within Q, with Kloppenborg’s hypothesis that three layers\ncan be so discerned winning a substantial following.28 What is of interest here is\nthe almost tacit assumption that each layer is to be conceived as a written docu-\nment, and the process of development conceived in terms of editing and redac-\ntion. It should occasion no surprise that Kloppenborg envisages his investigation\nof Q in terms of an archaeological dig, as Excavating Q, where, as with Bultmann,\nthe process is visualized as stripping away successive layers to reach the bottom\nlayer, or as removing the redactional elements of successive editions to recover\nthe original edition.29\nFinally, we might simply note that the discussion of possible knowledge of\nJesus tradition in Paul’s letters has similarly suffered from an assumption that the\ncase depends on a quasi-literary interdependency. Since the case cannot be\nclearly made that Paul knew the form of tradition as it has been recorded in Mark\nor Q, the case cannot be made.30 That Paul, as well as James and 1 Peter, not to\nmention the Apostolic Fathers, bear testimony to different versions of the same\nsayings of Jesus has been too little considered. More to the point, that such allu-\n146  . . \n25 M. Goulder, Luke: A New Paradigm (2 vols; JSNTS 20; Sheffield: Sheffield Academic, 1989) in\nhis attempt to dispense with Q (particularly vol. 1 ch. 2).\n26 M. Goodacre, The Case Against Q (Harrisburg, PA: Trinity International, 2002) 56–9, 89–90\n(despite 64–6, 188).\n27 E.g. Schnelle, History, 187.\n28 J. S. Kloppenborg, The Formation of Q: Trajectories in Ancient Wisdom Collections\n(Philadelphia: Fortress, 1987).\n29 Kloppenborg does not explicitly address the issue of whether Q1 was also a document, but he\ndoes assume it (Excavating Q, 159, 197, 200, 208–9); see also 154–9 on the genre of Q1.\n30 Notably F. Neirynck, ‘Paul and the Sayings of Jesus’, BETL 73 (1986) 265–321, repr. in\nEvangelica II (Leuven: Peeters, 1991) 511–68. Neirynck’s many and valuable contributions on\nthe Gospels well illustrate the dominance of the literary paradigm.\nsions to what we know from the Synoptics as Jesus tradition attest a much more\ndiverse and fluid transmission process has been allowed too little say in our con-\nceptualization of the character of the Jesus tradition and the way it was initially\npassed on.31\nIn all this discussion the literary paradigm has dominated. Even when a con-\nscious effort has been made to alter the default setting, to recall that oral tradition\nwould not necessarily move along the grooves of literary composition, of reading\nand revising, the literary paradigm soon reasserts its influence and closes down\nthe historical possibilities which may be envisaged. As soon as attention shifts\nfrom the perspective itself to the data to be discussed, the default setting clicks\nback into place, and the interrelationships of the data are conceived in literary\nterms as though no other terms were relevant.\nShould this be so? Need this be so?\n3. What do we mean by an oral culture?\nWe should not underestimate the difficulty for a mindset formed within a\nlong established literary culture trying to shift to an oral mindset, the difficulty for\nsomeone bred to the literary paradigm trying to enter empathetically into an oral\nparadigm. Water Ong illustrates the problem effectively by imagining how diffi-\ncult it would be for those who knew only transport by automobile to visualize a\nhorse, a horse conceptualised as an automobile without wheels.\nImagine writing a treatise on horses (for people who have never seen a\nhorse) which starts with the concept not of horse but of ‘automobile’, built\non the readers’ direct experience of automobiles. It proceeds to discourse\non horses by always referring to them as ‘wheelless automobiles’, explaining\nto highly automobilized readers who have never seen a horse all the points\nof difference in an effort to excise all idea of ‘automobile’ out of the concept\nof ‘wheelless automobile’ so as to invest the term with a purely equine\nmeaning. Instead of wheels, the wheelless automobiles have enlarged\ntoenails called hooves; instead of headlights or perhaps rear-vision mirrors,\neyes; instead of a coat of lacquer, something called hair; instead of gasoline\nfor fuel, hay; and so on. . . . No matter how accurate and thorough such\napophatic description, automobile-driving readers who have never seen a\nhorse and who hear only of ‘wheelless automobiles’ would be sure to come\naway with a strange concept of a horse. . . . You cannot without serious and\ndisabling distortion describe a primary phenomenon by starting with a\nsubsequent secondary phenomenon and paring away the differences.\nAltering the Default Setting 147\n31 I of course except H. Koester, Synoptische Überlieferung bei den apostolischen Vätern (Berlin:\nAkademie-Verlag, 1957); also idem, Ancient Christian Gospels: Their History and Development\n(London: SCM, 1980) 49–75; though Koester has not attempted to develop a model of oral\ntransmission.\nIndeed, starting backwards in this way – putting the car before the horse –\nyou can never become aware of the real differences at all.32\nThe uncomfortable fact is that if we are to accomplish such a paradigm switch\nwe probably need to be jolted out of the one and make a conscious and sustained\neffort to train our thinking to the other. If we are to begin to appreciate what it\nmust have been like to live and function in an oral society we must shake our-\nselves free from the unconscious presuppositions which shape the very way we\nsee the Synoptic problem and envisage the early transmission or retelling of the\nJesus tradition.33\nFor a start we should recall the estimate of credible authorities that literacy in\nPalestine at the time of Jesus would probably have been less than 10 per cent.34\nGiven the importance of Torah learning in Jewish culture, that estimate can be\nquestioned. But given equally that royal officials, priests, scribes and Pharisees\nwould have made up a significant portion of the 10 per cent, the corollaries are\nprobably much the same. These corollaries include the fact that knowledge of\nTorah for most people would have been by hearing, aural, rather than by reading.\nWe have to assume, therefore, that the great majority of Jesus’ first disciples would\nhave been functionally illiterate.35 That Jesus himself was literate cannot simply\nbe assumed.36 And even allowing for the possibility that one or two of Jesus’\nimmediate disciples were able to read and write (Matthew) and may even have\nkept notes of Jesus’ teaching,37 it remains overwhelmingly probable that the\n148  . . \n32 W. J. Ong, Orality and Literacy: The Technologizing of the Word (London: Methuen, 1982;\nRoutledge, 1988) 12–13. See also M. McLuhan, The Gutenberg Galaxy: The Making of\nTypographic Man (Toronto: University of Toronto, 1962); and E. A. Havelock, The Muse\nLearns to Write: Reflections on Orality and Literacy from Antiquity to the Present (New Haven:\nYale University, 1986), where Havelock sums up a scholarly lifetime of reflection on the tran-\nsition from orality to literacy.\n33 W. H. Kelber, The Oral and the Written Gospel (Philadelphia: Fortress, 1983; republished\nIndiana University, 1996), begins with a similar protest (xv–xvi).\n34 Recent estimates are of less than 10 per cent literacy in the Roman Empire under the princi-\npate, falling to perhaps as low as 3 per cent in Roman Palestine; see particularly W. V. Harris,\nAncient Literacy (Cambridge, MA: Harvard University, 1989); M. Bar-Ilan, ‘Illiteracy in the\nLand of Israel in the First Centuries CE’, in S. Fishbane and S. Schoenfeld, Essays in the Social\nScientific Study of Judaism and Jewish Society (Hoboken, NJ: Ktav, 1992) 46–61; C. Hezser,\nJewish Literacy in Roman Palestine (Tübingen: Mohr Siebeck, 2001).\n35 Kloppenborg Verbin properly reminds us that ‘“literacy” itself admits of various levels:\nsignature-literacy; the ability to read simple contracts, invoices and receipts; full reading liter-\nacy; the ability to take dictation; and scribal literacy – the ability to compose’ (Excavating Q, 167).\n36 J. D. Crossan, The Birth of Christianity (San Francisco: Harper, 1998) has little doubt that\nJesus was illiterate (235); similarly B. Chilton, Rabbi Jesus: An Intimate Biography (New York:\nDoubleday, 2000) 99.\n37 See particularly A. Millard, Reading and Writing in the Time of Jesus (BS 69; Sheffield:\nSheffield Academic, 2000) 223–9; also E. E. Ellis, The Making of the New Testament\nDocuments (Leiden: Brill, 1999) 24, 32, 352.\nearliest transmission of the Jesus tradition was by word of mouth.38 This also\nmeans, as Herder and the early form critics appreciated, that the forms of the tra-\ndition were already becoming established in oral usage and transmission.\nSecondly, we need to recall the character of rural Galilee, where, on almost any\nreckoning, the initial impulse which resulted in the Jesus tradition is to be located.\nWe can be confident that the village and small town culture within which Jesus\npredominantly operated and where the stories and teachings of Jesus were first\nretold was a predominantly oral culture. Through recent archaeological work in\nGalilee we have a much better idea of the physical settings in which that early for-\nmulation of the Jesus tradition took place.39 Here a trite but necessary reminder is\nthat there were no newspapers, no television or radio in the first century. But have\nwe done enough to think through what that must have meant for communities?\nIn the villages and small towns of Galilee, when the day’s work was over and the\nsun had set, what else was there to do but to sit round and talk, to share the news\nof the day, to tell stories, to recall matters of importance for the community?\nKenneth Bailey suggests that the traditional evening gathering of Middle Eastern\nvillagers to listen to and recite the tradition of the community, the haflat samar, is\nthe continuation of a practice which stretches back to the time of Jesus and\nbeyond.40\nCan we say more about the character of oral tradition and about oral trans-\nmission? The problem is, as Sanders points out, ‘that we do not know how to\nimagine the oral period’.41 In an overwhelmingly literary culture our experience\nof orality is usually restricted to casual gossip and the serendipitous reminis-\ncences of college reunions. The burden of my paper, however, is that we must\nendeavour to ‘imagine the oral period’ for the sake of historical authenticity, to\nre-envisage how tradition was transmitted in an orally structured society; also\nthat we can do so, or at least are more able to do so than has generally been real-\nized. Here we are in the fortunate position of being able to call upon a wide range\nof research into oral tradition. No longer is it a matter simply of depending on the\nresearch into the Homeric and Yugoslavian sagas by Milman Parry and Albert\nAltering the Default Setting 149\n38 Pace W. Schmithals, ‘Vom Ursprung der synoptischen Tradition’, ZTK 94 (1997) 288–316, who\ncontinues to argue that the Synoptic tradition was literary from the first. E. E. Ellis, Christ and\nthe Future in New Testament History (SuppNovT 97; Leiden: Brill, 2000) also queries whether\nthere was an initial oral stage of transmission (13–14).\n39 See D. R. Edwards and C. T. McCollough, eds, Archaeology and the Galilee (University of\nSouth Florida; Atlanta: Scholars, 1997); and particularly J. L. Reed, Archaeology and the\nGalilean Jesus (Harrisburg, PA: Trinity International, 2000).\n40 K. E. Bailey, ‘Informal Controlled Oral Tradition and the Synoptic Gospels’, Asia Journal of\nTheology 5 (1991) 34–54; also ‘Middle Eastern Oral Tradition and the Synoptic Gospels’, ExpT\n106 (1995) 363–7.\n41 Sanders and Davies, Studying, 141; ironically in the same volume Sanders has demonstrated\nthat there is an equal problem, too little recognized, of ‘imagining the literary period’.\nLord.42 But I think also, in particular, of research into oral tradition in Africa43 and\nthe 30 years’ personal, albeit anecdotal, experience of Bailey in the Middle East.44\nOn the basis of such research it is possible to draw up a list of characteristic\nfeatures of oral tradition. The point, I will stress at once and will no doubt need to\nstress repeatedly, is not that an oral tradition once recorded or transcribed will\nnecessarily look any different from a literary tradition. Transcribed oral tradition\nand literary tradition, not altogether surprisingly, look very much the same. My\npoint is rather to bring home the danger of envisaging the process of tradition\ntransmission in too exclusively literary terms and to suggest that it will be necess-\nary for us deliberately to alter our print-determined default setting when we try to\nenvisage the early transmission of the Jesus tradition.\nThere are five characteristic features of oral transmission of tradition which\ndeserve attention.\nFirst, and most obvious – or it should be most obvious – an oral performance\nis not like reading a literary text.45 In reading a text it is possible to look back a few\npages to check what had been written earlier. Having read the text you can take it\nwith you and read it again later. A written text can be revised, or edited, and so on.\nBut with an oral tradition none of that is possible. An oral performance is evanes-\ncent. It is an event. It happens, and then is gone. Oral tradition is not there for the\nauditor to check back a few pages, or to take away, or to edit and revise. It is not a\nthing, an artefact like a literary text. That fact alone should be sufficient to cause\nus to question whether models of literary editing, intertextual dependence, of\narchaeological layers, are appropriate as we attempt to re-envisage the early\ntransmission of the Jesus tradition.\nNor should we forget that even written documents like Paul’s letters would not\nhave been read by more than a very few. For the great majority of recipients the\nletter would have been heard rather than read. And the public reading of the text\n150  . . \n42 The work of A. B. Lord, The Singer of Tales (Cambridge, MA: Harvard University, 1978) has\nbeen seminal (here esp. ch. 5).\n43 I refer particularly to J. Vansina, Oral Tradition as History (Madison: University of Wisconsin,\n1985), a revision of his earlier Oral Tradition: A Study in Historical Methodology (London:\nRoutledge & Kegan Paul, 1965); R. Finnegan, Oral Literature in Africa (Oxford: Clarendon,\n1970); and I. Okpewho, African Oral Literature: Backgrounds, Character and Continuity\n(Bloomington: Indiana University, 1992). Annekie Joubert notes that a paradigm shift took\nplace in folklore studies in the late 1970s and early ’80s, when a new emphasis on perform-\nance directed attention away from the study of the formal patterning and symbolic content\nof the texts to the emergence of verbal art in the social interaction between performers and\naudiences – quoting from R. Bauman and C. L. Briggs, ‘Poetics and Performance as Critical\nPerspectives on Language and Social Life’, Annual Review of Anthropology 19 (1990) 59–88\n(here 59–60).\n44 See above, n. 40.\n45 See e.g. Finnegan, Oral Literature, 2–7.\nwould require careful preparation and practice if it was to be heard meaningfully.\nThe public reading of such a letter, in other words, would itself have the character\nof a performance.46 Which also means that general knowledge of and even refer-\nence back to such texts would depend much more on recollection of what had\nbeen heard when the text was read to the congregation than on an individual\nperusal of the text itself. In technical terms, oral tradition includes the phenom-\nenon of second orality, that is, a written text known only through oral performance\nof the text.\nSecond, oral tradition is essentially communal in character. On the literary\nparadigm we envisage an author writing for a reader. We speak of the intended\nreader, the ideal reader, the implied reader. We envisage the characteristic con-\ntext of communication as the individual reader poring over the text, as the text\nthere on a shelf to be consulted by readers functioning as individuals in separate\none-to-one encounters with the text. But oral tradition continues in existence\nbecause there are communities for whom the tradition is important. The tradition\nis performed with greater or less regularity (depending on its importance) in the\ngatherings of the community, kept alive for the community by the elders, teachers\nor those acknowledged as proficient performers of the tradition.47\nThe recognition of this point has enabled J. M. Foley in recent years to merge\noral tradition theory fruitfully with receptionalist literary theory. For it is precisely\nthe communal character of oral tradition, the degree to which the elders or\nteachers retain the tradition on behalf of the community and the performers per-\nform it for the benefit of the community, which reminds us of the community’s\nrole in such performances. The performer’s awareness that some tradition is\nalready familiar to the community is a factor in the performance. The perform-\nance is heard within the community’s ‘horizons of expectation’. The perform-\nance’s ‘gaps of indeterminacy’ can be filled out from the audience’s prior\nknowledge of the tradition or of like traditions. What Foley calls the ‘metonymic\nreference’ of a performance enables the performer to use a whole sequence of\nAltering the Default Setting 151\n46 The point is well made by W. Dabourne, Purpose and Cause in Pauline Exegesis (SNTSMS 104;\nCambridge: Cambridge University, 1999) ch. 8. See further P. J. Achtemeier, ‘Omne verbum\nsonat: The New Testament and the Oral Environment of Late Western Antiquity’, JBL 109\n(1990) 3–27.\n47 The point was never adequately worked through by the early form critics. The model of ‘oral\nhistory’ drawn into the discussion by S. Byrskog, Story as History – History as Story: The\nGospel Tradition in the Context of Ancient Oral History (WUNT 123; Tübingen: Mohr Siebeck,\n2000), while valuable in other aspects, also fails at this point. Oral history envisages tradition\nas elicited from eye-witnesses by a historian some years or decades later, tradition which\nmight have been latent or only casually exchanged in the meantime. But the oral tradition\nmodel put forward here, in contrast, envisages a tradition which sustained a community\nthrough its regular performance. Byrskog, in fact, has no real conception of or indeed role for\noral transmission as itself a bridging factor between past and present.\nallusions to the community’s store of tradition and enables the community thus\nto recognize the consistency of the performance with the whole.48\nThird, as already implied, in the oral community there would be one or more\nwho were recognized as having primary responsibility for maintaining and per-\nforming the community’s tradition – the singer of tales, the bard, the elders, the\nteachers, the rabbis. An ancient oral society had no libraries or dictionaries or\nencyclopedias. It had instead to rely on individuals whose role in their com-\nmunity was to function as, in the words of Jan Vansina, ‘a walking reference\nlibrary’.49 In NT terms this certainly accords with the role of the apostle in provid-\ning what can properly be called foundation tradition for the churches he\nfounded.50 And the prominence of teachers in the earliest communities51 is best\nexplained by the communities’ reliance on them as repositories of community\ntradition.52\nThis suggests in turn that the teachers would be responsible for a body of\nteaching, presumably what Luke refers to as ‘the apostles’ teaching’ (Acts 2.42).\nThere is no reason to conceive of this teaching as entirely fragmentary, a\nsequence of individual forms preserved randomly. In his paper on ‘The Gospels\nas Oral Traditional Literature’, Albert Lord observed that ‘oral traditional com-\nposers think in terms of blocks and series of blocks of tradition’.53 The Synoptic\ntradition itself attests such groupings of parables (e.g. Mark 4.2–33) and miracle\nstories (4.35–5.43; 6.32–52), of Jesus’ teaching on exorcism (3.23–9) or discipleship\n(8.34–7), of sequences of events like a day in the life of Jesus (1.21–38), and so\n152  . . \n48 J. M. Foley, Immanent Art: From Structure to Meaning in Traditional Oral Epic (Bloomington,\nIN: Indiana University, 1991) chs. 1 and 2 (particularly 6–13 and 42–5); he is drawing on the lan-\nguage of H. R. Jauss and W. Iser. The argument is developed in idem, The Singer of Tales in\nPerformance (Bloomington, IN: Indiana University, 1995) chs. 1–3. Foley’s observation is also\ntaken up by R. A. Horsley and J. A. Draper, Whoever Hears You Hears Me: Prophets,\nPerformance, and Tradition in Q (Harrisburg, PA: Trinity International, 1999) chs. 7–8.\nAnnekie Joubert notes that ‘the use of allusion is normally an appeal to the audience to link\nthe references, and the audience will have to draw on extra-performance\/extra-textual\ninformation in order to interpret and to understand the web of allusive communication’ (pri-\nvate correspondence).\n49 Vansina, Oral Tradition as History, 37; similarly Havelock speaks of an oral ‘encyclopaedia’ of\nsocial habit and custom-law and convention (Muse, 57–8).\n50 1 Cor. 11.2, 23; 15.1–3; Phil. 4.9; Col. 2.6–7; 1 Thess. 4.1; 2 Thess. 2.15; 3.6.\n51 Acts 13.1; Rom. 12.7; 1 Cor. 12.28–9; Gal. 6.6; Eph. 4.11; Heb. 5.12; Jas 3.1; Did. 13.2; 15.1–2.\n52 From what we know of more formal teaching in the schools, we can be sure that oral instruc-\ntion was the predominant means: ‘it is the “living voice” of the teacher that has priority’ \n(L. C. A. Alexander, ‘The Living Voice: Scepticism Towards the Written Word in Early\nChristianity and in Graeco-Roman Texts’, in D. J. A. Clines et al., eds, The Bible in Three\nDimensions: Essays in Celebration of Forty Years of Biblical Studies in the University of\nSheffield [Sheffield: Sheffield Academic, 1990] 221–47 [here 244]).\n53 In Walker, ed. Relationships, 33–91 (here 59).\non.54 Our knowledge of how oral tradition ‘works’ elsewhere suggests that this\nwould have been the pattern from earliest days, as soon as the stories and say-\nings of Jesus began to be valued by the groups of his followers.\nFourth, oral tradition subverts the idea(l) of an ‘original’ version. With minds\nattuned to the literary paradigm, we envisage an original form, a first edition, from\nwhich all subsequent editions can at least in principle be traced by form and\nredaction criticism. We envisage tradition-history as an archaeological tell where\nwe can in principle dig through the layers of literary strata to uncover the original\nlayer, the ‘pure form’ of Bultmann’s conceptualization of Formgeschichte. But in\noral tradition each performance is not related to its predecessors or successors in\nthat way. In oral tradition, as Lord particularly has observed, each performance is,\nproperly speaking, an ‘original’.55\nThe point here can easily be misunderstood or misrepresented, so let me elab-\norate it a little. The point as it applies to the Jesus tradition is not that there was no\noriginating impulse which gave birth to the tradition. In at least many cases we\ncan be wholly confident that there were things which Jesus said and did which\nmade an impact, and a lasting impact, on his disciples. But properly speaking the\ntradition of the event is not the event itself. And the tradition of the saying is not\nthe saying itself. The tradition is at best the witness of the event, and as there were\npresumably several witnesses, so there may well have been several traditions, or\nversions of the tradition, from the first. Of an originating event we can speak; but\nwe should certainly hesitate before speaking of an original tradition of the event.\nThe same is true even of a saying of Jesus. The tradition of the saying attests the\nimpact made by the saying on one or more of the original audience. But it may\nwell have been heard slightly differently by others of that audience, and so told\nand retold in different versions from the first. And if, as Kelber points out, Jesus\nAltering the Default Setting 153\n54 A fuller listing of such groupings of tradition would include the beatitudes (Matt. 5.3, 4, 6, 11,\n12\/Luke 6.20b, 21b, 21a, 22, 23), the sequence of mini-parables in Mark 2.18–22\/Luke 9.57–62),\nthe cost of discipleship and danger of loss (Mark 8.34–8, again followed by Matt. 16.24–7 and\nLuke 9.23–6), the sayings about light and judgment in Mark 4.21–5 (followed by Luke 8.16–18),\nthe ‘parables of crisis’ (Matt. 24.42–25.13 pars.), Jesus and the Baptist (Matt. 11.2–19 par.),\nJesus’ teaching on his exorcisms (Matt. 12.24–45 pars.), and the sending out of the disciples\non mission (Mark 6.7–13; Matt. 9.37–10.1, 7–16; Luke 9.1–6 and 10.1–12).\n55 ‘In a sense each performance is “an” original, if not “the” original. The truth of the matter is\nthat our concept of “the original”, of “the song”, simply makes no sense in oral tradition’\n(Lord, Singer, 100–1). R. Finnegan, Oral Poetry: Its Nature, Significance and Social Context\n(Cambridge: Cambridge University, 1977) also glosses Lord – ‘There is no correct text, no idea\nthat one version is more “authentic” than another: each performance is a unique and orig-\ninal creation with its own validity’ (65) – and credits Lord with bringing this point home most\nconvincingly (79). Kelber already took up the point: ‘each oral performance is an irreducibly\nunique creation’; if Jesus said something more than once there is no ‘original’ (Oral, 29; also\n59, 62).\nhimself used his most effective parables and aphorisms on more than one\noccasion, the ideal of a single original, authentic version reduces once again more\nto the figment of a literary-moulded mindset. Yes, we can and need to envisage\nteaching that originated with Jesus, actions which characterized his mission. But\nto treat the history of the Jesus tradition as though it was a matter of recovering\nsome original version of the tradition is to conceptualize the transmission of the\nJesus tradition at best misleadingly; the Jesus Seminar completely misjudged the\ncharacter of the Jesus tradition at this point.56 In oral tradition performance vari-\nation is integral to, even definitive of, the tradition.57\nFifth and finally, oral tradition is characteristically (I do not say distinctively) a\ncombination of fixity and flexibility, of stability and diversity. The preceding\ncharacteristics could easily be taken to encourage the idea of oral tradition as\ntotally flexible and variable. That would be a mistake. In oral tradition there is\ncharacteristically a tale to be told, a teaching to be treasured, in and through and\nprecisely by means of the varied performances. Oral tradition is oral memory; its\nprimary function is to preserve and recall what is of importance from the past.\nTradition, more or less by definition, embodies the concern for continuity with\nthe past, a past drawn upon but also enlivened that it might illuminate the pres-\nent and future. In the words of E. A. Havelock, ‘Variability and stability, conser-\nvatism and creativity, evanescence and unpredictability all mark the pattern of\noral transmission’ – the ‘oral principle of “variation within the same”’.58 It is this\ncombination, reverting to our second point, which makes it possible for the com-\nmunity both to acknowledge its tradition and to delight in the freshness of the\nindividual performance.\nMy basic thesis, then, is that a proper recognition of the characteristics of \n154  . . \n56 Funk and Hoover, The Five Gospels; also R. W. Funk, The Acts of Jesus: The Search for the\nAuthentic Deeds of Jesus (San Francisco: Harper\/Polebridge, 1998). To recognize that vari-\nation is integral to orality likewise undercuts much of the critical criteria (particularly ‘con-\ntradiction with other accounts’) used by H. Reimarus, D. F. Strauss and their successors.\n57 A. Dundes, Holy Writ as Oral Lit: The Bible as Folklore (Lanham: Rowman & Littlefield, 1999)\ninsists ‘upon “multiple existence” and “variation” as the two most salient characteristics of\nfolklore’ (18–19). The problem of deriving a text from the recollections of a performance is well\nillustrated by the play ‘Pericles’ attributed to Shakespeare (S. Wells and G. Taylor, eds, The\nOxford Shakespeare [Oxford: Clarendon, 1988] 1037); see further J. Bate, The Genius of\nShakespeare (London: Picador, 1997) 75–87 (I owe the latter reference to H. D. Betz). Nor\nshould it be forgotten that NT textual criticism has to take account of the diverse ways in\nwhich the text was performed\/used, read\/heard in different churches; see particularly B. D.\nEhrman, The Orthodox Corruption of Scripture: The Effect of Early Christological Controversies\non the Text of the New Testament (Oxford: Oxford University, 1993); D. C. Parker, The Living\nText of the Gospels (Cambridge: Cambridge University, 1997); E. J. Epp, ‘The Multivalence of\nthe Term “Original Text” in New Testament Textual Criticism’, HTR 92 (1999) 245–81.\n58 Kelber, Oral, 33, 54, quoting E. A. Havelock, Preface to Plato (Cambridge, MA: Harvard\nUniversity, 1963) 92, 147, 184, passim.\noral tradition, just outlined, requires us to alter the default setting of our typically\nliterary mindset – to recognize that the early transmission of the Jesus tradition\ntook place in an oral culture and as oral tradition requires us consciously to resist\nthe involuntary predisposition to conceive that process in literary terms and con-\nsciously to re-envisage that process in oral terms.\nI have no time here to develop the theoretical model further. Suffice it to say,\nthe model takes up the best of the insights of the early form critics, while avoiding\nthe false paths which the literary paradigm led them down. That is to say, the rec-\nognition of the oral and communal character of the early Jesus tradition should be\nretrieved from the confusion caused by an unjustifiably schematic conception of\nthe development of the tradition from pure to complex form, from simple to elab-\norated form.59 Likewise the ‘oral principle of “variation within the same”’ tells\nmore heavily than has hitherto been appreciated against the assumption of\nBultmann and Käsemann60 that there was a steady inflow of fresh material from\nprophetic utterances into the Jesus tradition in the pre-70 period.61\nThe model also recognizes the strengths of Birger Gerhardsson’s response to\nBultmann while, hopefully, avoiding its weaknesses.62 That is to say, the oral tra-\ndition model recognizes that where an influential teacher was in view there was\nbound to be a concern among his disciples to remember what he had taught\nthem.63 But it sees the more fundamental trait of oral tradition in terms of \nthe combination of flexibility as well as fixity, so that the character of oral trans-\nmission is not adequately caught by the single term ‘memorization’.64 Bailey’s\nAltering the Default Setting 155\n59 ‘Das . . . Kriterium der “reinen Gattung” stellt eine Vermischung linguistischer und sprach-\nhistorischer Kategorien dar, die einer heute überholten Auffassung der Sprachentwicklung\nzuzuweisen ist’ – J. Schröter, Erinnerung an Jesu Worte (WMANT 76; Neukirchen-Vluyn:\nNeukirchener, 1997) 59; also 141–2. See also G. Strecker, ‘Schriftlichkeit oder Mündlichkeit der\nsynoptischen tradition?’, in F. van Segbroeck et al., eds, The Four Gospels 1992, Festschrift\nFrans Neirynck (Leuven: Leuven University, 1992) 159–72 (here 161–2, with other bibliography\nin n. 6).\n60 Bultmann, History, 127–8; ‘In the primitive community at Jerusalem the spirit of Jesus con-\ntinued to be active, and his ethical teaching was progressively elaborated and expressed in\nutterances which were then transmitted as the sayings of Jesus himself’ (‘The New Approach\nto the Synoptic Problem’ [1926], ET Existence and Faith [London: Collins Fontana, 1964] 42);\nE. Käsemann, ‘Is the Gospel Objective?’, Essays on New Testament Themes (London: SCM,\n1964) 48–62.\n61 See further J. D. G. Dunn, Jesus Remembered (Grand Rapids: Eerdmans, 2003) #8.2.\n62 B. Gerhardsson, Memory and Manuscript: Oral Tradition and Written Transmission in\nRabbinic Judaism and Early Christianity (Lund: Gleerup, 1961).\n63 Finnegan critiques Lord in pointing out that memorization also plays a part in oral tradition\n(Oral Poetry, 79, 86).\n64 E.g., ‘The general attitude was that words and items of knowledge must be memorized:\ntantum scimus, quantum memoria tenemus’ (Gerhardsson, Memory, 124); ‘Cicero’s saying\nwas applied to its fullest extent in Rabbinic Judaism: repetitio est mater studiorum.\nintermediate model of informal controlled tradition seems closer to the more\nbroadly recognizable oral tradition model than either Bultmann’s informal\nuncontrolled model or Gerhardsson’s formal controlled model.65\nSo then, in the light of these characteristics of oral tradition, how do we go\nabout re-envisaging the early transmission of the Jesus tradition?\n4. Re-envisaging the early transmission\nThe test of any theoretical model for the transmission of the Jesus tra-\ndition, of course, is how well it explains the data which we have, that is, how well\nit explains the character of the Jesus tradition as we know it. I believe the oral tra-\ndition model passes that test with flying colours. But before illustrating the claim\nI need to make three preliminary points.\nFirst, there is no possibility of producing a knock-down argument. I cannot\nproduce a sample from the Jesus tradition which is demonstrably oral rather than\nliterary in character.66 This, of course, is partly because the tradition as we now\nhave it is in literary form. So, naturally it is literary in character. But it is also true\nanyway, that there are no distinctive characteristics of any particular sample of\ntradition which enable us to pronounce definitively ‘Oral and not literary’.67\n156  . . \nKnowledge is gained by repetition, passed on by repetition, kept alive by repetition. A\nRabbi’s life is one continual repetition’ (ibid., 168). Sanders and Davies rightly observe that\nGerhardsson tries to allow for the flexibility of verbal tradition (citing Gerhardsson’s The\nGospel Tradition [Con BNT 15; Lund: Gleerup, 1986] 39–40), but that even so the Synoptic data\ndo not fit well with the model (Studying, 129–32). R. Riesner, Jesus als Lehrer (WUNT;\nTübingen: Mohr Siebeck, 1981) also emphasizes the role of learning by heart\n(Auswendiglernen) in Jesus’ teaching (365–7, 440–53). D. L. Balch, ‘The Canon: Adaptable and\nStable, Oral and Written. Critical Questions for Kelber and Riesner’, Forum 7.3\/4 (1991)\n183–205, criticizes Riesner for assuming ‘a print mentality’ which was not true of ‘passing on\ntradition of great philosophers’ teachings’ (196–9).\n65 I might simply add that the appeal sometimes made by Horsley in particular (Whoever Hears\nYou, 98–103; also Hearing the Whole Story: The Politics of Plot in Mark’s Gospel [Louisville, KY:\nWestminster John Knox, 2001] 157–9) to James C. Scott’s use of the distinction between the\n‘great tradition’ and the ‘little tradition’ in a community – the great tradition as expressing\nthe dominant and dominating ruling power, the little tradition as expressing the hidden but\ncontinuing values and concerns of the oppressed community – is of little relevance for us. It\nis used by Scott in reference to a colonialist situation in South-East Asia, which has little\nbearing on a Jewish Galilee ruled by a client Jewish king. And in the Jesus tradition we have\nnot so much the persistence of old tradition, but the emergence of new tradition (even if\nmuch of it can be regarded as a reconfiguration of the older tradition).\n66 I recall that my doctor-father, C. F. D. Moule, in the mid-1960s challenged his Cambridge\nSeminar to produce such a knock-down example in regard to any solution of the Synoptic\nproblem; no example went unquestioned.\n67 The conclusion of the Symposium on Jesus and the Oral Gospel Tradition (ed. H.\nWansbrough; JSNTS 64; Sheffield: Sheffield Academic, 1991) can cut both ways: ‘We have\nOn the other hand, the observation cuts both ways. That is to say, we should\nnot assume that simply because the tradition as we now have it is in literary form,\ntherefore its current form is the outcome of a process conceived in purely literary\nterms. My challenge once again is to shake ourselves out of that literary mindset\nand to attempt to revisualize that part of the process which must have been largely\nif not entirely oral in character. What I ask for is that we seriously attempt to\nreconceptualize the parameters and constraints within which we envisage the\ntransmission of the Jesus tradition taking place. It is not what we look at, so much\nas the way we look at it, which we need to reflect on.\nSecond, as just implied, we simply cannot escape from a presumption of oral-\nity for the first stage of the transmission of the Jesus tradition. In a society which\nwas so illiterate and where the great bulk of communication must have taken\nplace in oral mode, it would be ludicrous either to assume that the whole history\nof the Jesus tradition was literary in character from start to finish or to make any\nthesis regarding the process of its transmission dependent in effect on such an\nassumption. I say this in response to various recent claims either that the Jesus\ntradition took literary form from the first,68 or that all differences between parallel\ntraditions, no matter how great, can be explained in terms of literary redaction.69\nAs already indicated earlier, I do not for a moment deny that differences within\nthe Synoptic tradition can be explained in terms of the literary paradigm. My\nquestion is whether they should be so explained, and whether in so doing we do\nnot lose sight of important features of the Jesus tradition, the way it was regarded\nAltering the Default Setting 157\nbeen unable to deduce or derive any marks which distinguish clearly between an oral and a\nwritten transmission process. Each can show a similar degree of fixity and variability’ (12).\nStrecker rightly emphasizes the continuity in transmission of the tradition from oral to writ-\nten (‘Schriftlichkeit’, 164–5). Cf. Schröter, Erinnerung, 55, 60.\n68 See above, n. 38.\n69 B. W. Henaut, Oral Tradition and the Gospels: The Problem of Mark 4 (JSNTS 82; Sheffield:\nJSOT, 1993) is tendentiously concerned to argue the virtual impossibility of recovering any\noral tradition behind the Gospels: all differences, no matter how great, can be explained in\nterms of literary redaction; and oral tradition was wholly fluid and contingent on the partic-\nularities of each performance. But his conception of the oral tradition process is question-\nable – as though it was a matter of recovering a history of tradition through a set of sequential\nperformances (e.g. 118). And he gives too little thought to what the stabilities of oral remem-\nbrances of Jesus might be as distinct from those in the epics and sagas studied by Parry and\nLord. H. W. Hollander, ‘The Words of Jesus: From Oral Tradition to Written Record in Paul\nand Q’, NovT 42 (2000) 340–57, follows Henaut uncritically (351–5): he has no conception of\ntradition as reflecting\/embodying the impact of anything Jesus said or did; and he thinks of\noral tradition as essentially casual, without any conception that tradition could have a role in\nforming community identity and thus be important to such communities. Similarly Crossan\nseems to think of oral tradition principally in terms of individuals’ casual recollection (Birth\nof Christianity, 49–93).\nand handled, and what that tells us about the earliest communities which pre-\nserved it.\nThird, despite the cautionary note I am sounding, I remain convinced of the\nessential correctness of the two-document hypothesis. That is to say, the evidence\ncontinues to persuade me that Mark was the earliest of the Synoptic Gospels, and\nthat there was a further document behind Matthew and Luke on which both drew\n(Q). The primary evidence is as it has always been: the closeness of verbal paral-\nlels between two or three of the three documents. When I look at such passages as\nMark 8.34–7 pars., on the cost of discipleship, and 13.28–32 pars., the parable of the\nfig tree,70 the evidence forces me to the conclusion that these three versions of\nparticular Jesus traditions are interdependent at the literary level. The evidence\nalmost requires us to speak of sources, of sources already in Greek, of one serving\nas the source for the other, or of each drawing on a common literary source (the\nunderlining and highlighting indicate the extent of the agreement).\n158  . . \nMatt. 16.24–6\n24 Tovte oJ ∆Ihsou`~\nei\\pen toi`~ maqhtai`~ aujtou`∑ \nei[ ti~ qevlei\nojpivsw mou ejlqei`n,\najparnhsavsqw eJauto;n kai;\najravtw to;n stauro;n aujtou`\nkai;\najkolouqeivtw moi. 25 o}~\nga;r eja;n qevlhÛ th;n yuch;n\naujtou` sw`sai ajpolevsei\naujthvn∑ o}~ d∆ a]n ajpolevshÛ\nth;n yuch;n aujtou` e{neken\nejmou`\neuJrhvsei aujthvn. 26 tiv ga;r\nwjfelhqhvsetai a[nqrwpo~\neja;n to;n kovsmon o{lon\nkerdhvshÛ th;n de; yuch;n\naujtou` zhmiwqh`Û… h] tiv dwvsei\na[nqrwpo~ ajntavllagma th`~\nyuch`~ aujtou`…\nMark 8.34–7\n34 Kai; proskalesavmeno~\nto;n o[clon su;n toi`~\nmaqhtai`~ aujtou` ei\\pen\naujtoi`~∑ ei[ ti~ qevlei\nojpivsw mou ajkolouqei`n,\najparnhsavsqw eJauto;n kai;\najravtw to;n stauro;n aujtou`\nkai;\najkolouqeivtw moi. 35 o}~\nga;r eja;n qevlhÛ th;n yuch;n\naujtou` sw`sai ajpolevsei\naujth;n∑ o}~ d∆ a]n ajpolevsei\nth;n yuch;n aujtou` e[neken\nejmou` kai; tou` eujaggelivou\nswvsei aujthvn. 36 tiv ga;r\nwjfelei` a[nqrwpon\nkerdh`sai to;n kovsmon o{lon\nkai; zhmiwqh`nai th;n yuch;n\naujtou`… 37 tiv ga;r doi`\na[nqrwpo~ ajntavllagma th`~\nyuch`~ aujtou`…\nLuke 9.23–5\n23 “Elegen de; pro;~\npavnta~∑ ei[ ti~ qevlei\nojpivsw mou e[rcesqai,\najrnhsavsqw eJauto;n kai;\najravtw to;n stauro;n aujtou`\nkaq∆ hJmevran kai;\najkolouqeivtw moi. 24 o}~\nga;r a]n qevlhÛ th;n yuch;n\naujtou` sw`sai ajpolevsei\naujthvn∑ o}~ d∆ a]n ajpolevshÛ\nth;n yuch;n aujtou` e{neken\nejmou` ou|to~\nswvsei aujthvn. 25 tiv ga;r\nwjfelei`tai a[nqrwpo~\nkerdhvsa~ to;n kovsmon o{lon\neJauto;n de; ajpolevsa~ h]\nzhmiwqeiv~…\nSimilarly with Q material like the preaching of John the Baptist in Matt.\n3.7–10\/Luke 3.7–9, and the parable of the returning evil spirits in Matt.\n12.43–5\/Luke 11.24–6.71\n70 Full statistics in R. Morgenthaler, Statistische Synopse (Zürich\/Stuttgart: Gotthelf, 1971)\n239–43.\n71 Full statistics in ibid., 258–61.\nAltering the Default Setting 159\nMatt. 24.32–6\n32 ∆Apo; de\nth`~ sukh`~ mavqete th;n \nparabolhvn∑ o{tan h[dh oJ\nklavdo~ aujth`~ gevnhtai\naJpalo;~ kai; ta; fuvlla\nejkfuvhÛ, ginwvskete o{ti ejggu;~\nto; qevro~∑ 33 ou{tw~\nkai; uJmei`~, o{tan i[dhte\npavnta tau`ta, ginwvskete\no{ti ejgguv~ ejstin ejpi; quvrai~.\n34 ajmh;n levgw\nuJmi`n o{ti ouj mh; parevlqhÛ hJ\ngenea; au{th e{w~ a]n pavnta\ntau`ta gevnhtai. 35 oJ\noujrano;~ kai; hJ gh`\npareleuvsetai, oiJ de; lovgoi\nmou ouj mh; parevlqwsin. 36\nPeri; de; th`~ hJmevra~\nejkeivnh~ kai; w{ra~ ouJdei;~\noi\\den, oujde; oiJ a[ggeloi tw`n\noujranw`n oujde; oJ uiJov~, eij\nmh; oJ path;r movno~.\nMark 13.28–32\n28 ∆Apo; de;\nth`~ sukh`~ mavqete th;n\nparabolhvn∑ o{tan h[dh oJ\nklavdo~ aujth`~ aJpalo;~\ngevnhtai kai; ejkfuvhÛ ta;\nfuvlla, ginwvskete o{ti ejggu;~\nto; qevro~ ejstivn∑ 29 ou{tw~\nkai; uJmei`~, o{tan i[dhte\ntau`ta ginovmena, ginwvskete\no{ti ejgguv~ ejstin ejpi; quvrai~.\n30 ∆Amh;n levgw\nuJmi`n o{ti ouj mh; parevlqhÛ hJ\ngenea; au{th mevcri~ ou| tau`ta\npavnta gevnhtai. 31 oJ\noujrano;~ kai; hJ gh`\npareleuvsontai, oiJ de; lovgoi\nmou ouj mh; pareleuvsontai.\n32 Peri; de; th`~ hJmevra~\nejkeivnh~ h] th`~ w{ra~ oujdei;~\noi\\den, oujde; oiJ a[ggeloi ejn\noujranw`\/ oujde; oJ uiJov~, eij\nmh; oJ pathvr.\nLuke 21.29–33\n29 Kai; ei\\pen parabolh;n\naujtoi`~∑ i[dete th;n sukh`n\nkai; pavnta ta; devndra∑ 30\no{tan probavlwsin h[dh,\nblevponte~ ajf∆ eJautw`n\nginwvskete o{ti h[dh ejggu;~\nto; qevro~ ejstivn∑ 31 ou{tw~\nkai; uJmei`~, o{tan i[dhte\ntau`ta ginovmena, ginwvskete\no{ti ejgguv~ ejstin hJ basileiva\ntou` qeou`. 32 ajmh;n levgw\nuJmi`n o{ti ouj mh; parevlqhÛ hJ\ngenea; au{th e{w~ a}n\npavnta gevnhtai. 33 oJ\noujrano;~ kai; hJ gh`\npareleuvsontai, oiJ de; lovgoi\nmou ouj mh; pareleuvsontai.\nMatt. 3.7–10\n7 ijdw;n de; pollou;~ tw`n Farisaivwn kai;\nSaddoukaivwn ejrcomevnou~ ejpi; to; bavptisma\naujtou` ei\\pen aujtoi`~∑ gennhvmata ejcidnw`n,\ntiv~ uJpevdeixen uJmi`n fugei`n ajpo; th`~\nmellouvsh~ ojrgh`~… 8 poihvsate ou\\n karpo;n\na[xion th`~ metanoiva~ 9 kai; mh; dovxhte\nlevgein ejn ejautoi`~∑ patevra e[comen to;n\n∆Abraavm. levgw ga;r uJmi`n o{ti duvnatai oJ qeo;~\nejk tw`n livqwn touvtwn ejgei`rai tevkna tw`\/\n∆Abraavm. 10 h[dh de; hJ ajxivnh pro;~ th;n\nrJivzan tw`n devndrwn kei`tai∑ pa`n ou\\n\ndevndron mh; poiou`n karpo;n kalo;n\nejkkovptetai kai; eij~ pu`r bavlletai.\nLuke 3.7–9\n7 “Elegen ou\\n toi`~ ejkporeuomevnoi~ o[cloi~\nbaptisqh`nai uJp∆ aujtou`∑ gennhvmata ejcidnw`n,\ntiv~ uJpevdeixen uJmi`n fugei`n ajpo; th`~\nmellouvsh~ ojrgh`~… 8 poihvsate ou\\n karpou;~\najxivou~ th`~ metanoiva~ kai; mh; a[rxhsqe\nlevgein ejn eJautoi`~∑ patevra e[comen to;n\n∆Abraavm. levgw ga;r uJmi`n o{ti duvnatai oJ qeo;~\nejk tw`n livqwn touvtwn ejgei`rai tevkna tw`\/\n∆Abraavm. 9 h[dh de; kai; hJ ajxivnh pro;~ th;n\nrJivzan tw`n devndrwn kei`tai∑ pa`n ou\\n\ndevndron mh; poiou`n karpo;n kalo;n\nejkkovptetai kai; eij~ pu`r bavlletai.\nMatt. 12.43–45\n43 ”Otan de; to; ajkavqarton pneu`ma ejxevlqhÛ\najpo; tou` ajnqrwvpou, dievrcetai di∆ ajnuvdrwn\ntovpwn zhtou`n ajnavpausin kai; oujc euJrivskei.\n44 tovte levgei∑ eij~ to;n oi\\kovn mou\nejpistrevyw o{qen ejxh`lqon∑ kai; ejlqo;n\neuJrivskei scolavzonta sesarwmevnon kai;\nkekosmhmevnon. 45 tovte poreuvetai kai;\nparalambavnei meq∆ eJautou` eJpta; e{tera\npneuvmata ponhrovtera eJautou` kai;\neijselqovnta katoikei` ejkei`˘ kai; givnetai ta;\ne[scata tou` ajnqrwvpou ejkeivnou ceivrona tw`n\nprwvtwn. ou{tw~ e[stai kai; th`\/ genea`\/ tauvthÛ\nth`\/ ponmra`\/.\nLuke 11.24–26\n24 ”Otan to; ajkavqarton pneu`ma ejxevlqhÛ\najpo; tou` ajnqrwvpou, dievrcetai di j ajnuvdrwn\ntovpwn zhtou`n ajnavpausin kai; mh; euJrivskon∑\nlevgei∑ uJpostrevyw eij~ to;n\noi\\kovn mou o{qen ejxh`lqon∑ 25 kai; ejlqo;n\neuJrivskei sesarwmevnon kai;\nkekosmhmevnon. 26 tovte poreuvetai kai\nparalambavnei e{tera\npneuvmata ponhrovtera eJautou` eJpta; kai;\neijselqovnta katoikei` ejkei`∑ kai; givnetai ta;\ne[scata tou` ajnqrwvpou ejkeivnou ceivrona tw`n\nprwvtwn.\nSo, I have no problems in recognizing the probability of literary interdepend-\nence between the Synoptic Gospels. My question, once again, is whether the\nhypothesis of literary interdependence is sufficient to explain all the data of cor-\nrelation between the Gospel traditions. My question is whether we should take\nsuch close parallels as the norm for explaining all parallels, whether we should\nsimply extrapolate from such examples and conclude that all parallels are to be\nexplained in the same way.\nConsider the following cases. As you look at these passages I ask you to con-\nsider whether literary dependence is the only or most obvious explanation for the\ndegree of similarity between the different versions.\n(a) In the triple tradition consider first the account of the epileptic boy in\nMark 9.14–27 pars. Note the cluster of agreement at vv. 18–19, 25, evidently the core\nof the story, and the wise variation for the rest (again, the underlining and high-\nlighting indicate the extent of the agreement).\n160  . . \nMatt. 17.14–18\n14 Kai; ejlqovntwn pro;~\nto;n o[clon\nprosh`lqen\naujtw`\/\na[nqrwpo~ gonupetw`n\naujto;n 15 kai; levgwn∑ kuvrie,\nejlevhsovn\nmou to;n uiJovn,\no{ti\nselhniavzetai kai; kakw`~\npavscei∑\npollavki~ ga;r pivptei eij~ to;\npu`r kai; pollavki~ eij~ to;\nu{dwr. 16 kai; proshvnegka\naujto;n toi`~ maqhtai`~ sou,\nkai; oujk hjdunhvqhsan aujto;n\nqerapeu`sai. 17 ajpokriqei;~\nde; oJ ∆Ihsou`~ ei\\pen∑ w\\ genea;\na[pisto~ kai; diestrammevnh,\ne{w~ povte meq∆ uJme`n e[somai…\ne{w~ povte ajnevxomai uJmw`n…\nfevretev moi aujto;n w|de.\nMark 9.14–27\n14 Kai; ejlqovnte~ pro;~ tou;~\nmaqhta;~ ei\\don o[clon polu;n\nperi; aujtou;~ kai; grammatei`~\nsuzhtou`nta~ pro;~ aujtouv~.\n15 kai; eujqu;~ pa`~ oJ o[clo~\nijdovnte~ aujto;n\nejxeqambhvqhsan kai;\nprostrevconte~ hjspavzonto\naujtovn. 16 kai; ejphrwvthsen\naujtouv~∑ tiv auzhtei`te pro;~\naujtouv~… 17 kai; ajpekrivqh\naujtw`\/ ejk tou` o[clou∑\ndidavskale,\nh[negka\nto;n uiJovn mou pro;~ sev,\ne[conta\npneu`ma a[lalon∑ 18 kai; o{pou\neja;n aujto;n katalavbhÛ\nrJhvssei aujtovn, kai; ajfrivzei\nkai; trivzei tou;~ ojdovnta~ kai;\nxhraivnetai∑\nkai; ei\\pa\ntoi`~ maqhtai`~ sou i{na aujto\nejkbavlwsin, kai; oujk\ni[scusan. 19 oJ de; ajpokriqei;~\naujtoi`~ levgei∑ w\\ genea;\na[pisto~,\ne{w~ povte pro;~ uJma`~ e[somai…\ne{w~ povte ajnevxomai uJmw`n…\nfevrete aujto;n prov~ me 20 \nLuke 9.37–42\n37 ∆Egevneto de; th`\/ eJxh`~\nhJmevra\/ katelqovntwn aujtw`n\najpo; tou` o[rou~ sunhvnthsen\naujtw`\/ o[clo~ poluv~.\n38 kai; ijdou;\najnh;r ajpo; tou` o[clou ejbovhsen\nlevgwn∑ didavskale,\ndevomaiv sou ejpiblevyai ejpi;\nto;n uiJovn mou, o{ti monogenhv~\nmoiv ejstin, 39 kai; ijdou;\npneu`ma lambavnei aujto;n kai;\nejxaivfnh~ kravzei kai;\nsparavssei aujto;n meta;\najfrou` kai; movgi~ ajpocwrei`\najp∆ aujtou` suntri`bon aujtovn∑\n40 kai; ejdehvqhn\ntw`n maqhtw`n sou i[na\nejkbavlwsin aujtov, kai; oujk\nhjdunhvqhsan. 41 ajpokriqei;~\nde; oJ ∆Ihsou`~ ei\\pen∑ w\\ genea;\na[pisto~ kai; diestrammevnh,\ne{w~ povte e[somai pro;~ uJma`~\nkai; ajnevxomai uJmw`n…\nprosavgage w|de to;n uiJovn\nOr again, note the variations in the accounts of finding the empty tomb – Mark\n16.1–8 pars.\nAltering the Default Setting 161\nMatt. 17.14–18\n18 kai; ejpetivmhsen aujtw`\/\noJ ∆Ihsou`~\nkai; ejxh`lqen ajp j aujtou`\nto; daimovnion\nkai; ejqerateuvqh\noJ pai`~ ajpo; th`~ w{ra``~\nejkeivnh~.\nMark 9.14–27\nkai; h[negkan aujto;n pro;~\naujtovn. kai; ijdw;n aujto;n to;\npneu`ma eujqu;~ sunespavraxen\naujtovn, kai; pesw;n ejpi; th`~\ngh`~ ejkuliveto ajfrivzwn. 21\nkai; ejphrwvthsen to;n patevra\naujtou`∑ povso~ crovno~ ejsti;n\nwJ~ tou`to gevgonen aujtw`… oJ de;\nei\\pen∑ ejk paidiovqen∑ 22 kai;\npollavki~ kai; eij~ pu`r aujto;n\ne[balen kai; eij~ u{data i[na\najpolevshÛ aujtovn∑ ajll j ei[ ti\nduvnhÛ, bohvqhson hJmi`n\nsplagcnisqei;~ ejf j hJma`~. 23\noJ de; ∆Ihsou`~ ei\\pen aujtw`\/∑ to;\neij duvnhÛ, pavnta dunata; tw`\/\npisteuvonti. 24 eujqu;~\nkravxa~ oJ path;r tou` paidivou\ne[legen∑ pisteuvw∑ bohvqei mou\nth`\/ ajpistiva\/. 25 ijdw;n de; oJ\n∆Ihsou`~ o{ti ejpisuntrevcei\no[clo~, ejpetivmhsen tw`\/\npneuvmati tw`\/ ajkaqavrtw\/\nlevgwn aujtw`\/∑ to; a[lalon kai;\nkwfo;n pneu`ma, ejgw; ejpitavssw\nsoi, e[xelqe ejx aujtou` kai;\nmhkevti eijsevlqhÛ~ eij~ aujtovn.\n26 kai; kravxa~ kai; polla;\nsparavxa~ ejxh`lqen∑ kai;\nejgevneto wJsei; nekrov~, w{ste\ntou;~ pollou;~ levgein o{ti\najpevqanen. 27 oJ de; ∆Ihsou`~\nkrathvsa~ th`~ ceiro;~ aujtou`\nh[geiren aujtovn, kai; ajnevsth.\nLuke 9.37–42\nsou. 42 e[ti de; prosercomevnou\naujtou` e[rrhxen aujto;n to;\ndaimovnionkai; sunespavraxen∑\nejpetivmhsen de; oJ ∆Ihsou`~\ntw`\/ pneuvmati tw`\/ ajkaqavrtw\/\nkai; ijavsato\nto;n pai`da kai; ajpevdwken\naujto;n tw`\/ patri; aujtou`.\nMatt. 28.1–8\n1 jOye; de; sabbavtwn, th`\/\nejpifwskouvshÛ eij~ mivan\nsabbavtwn h\\lqen Maria;m hJ\nMagdalhnh; kai; hJ a[llh\nMariva qewrh`sai to;n tavfon.\nMark 16.1–8\n1 Kai; diagenomevnou tou`\nsabbavtou Mariva hJ\nMagdalhnh; kai; Mariva hJ\nªtou`º ∆Iakwvbou kai; Salwvmh\nhjgovrasan ajrwvmata i{na\nejlqou`sai ajleivywsin aujtovn.\n2 kai; livan prwi÷ Th`Û mia`\/\ntw`n sabbavtwn\ne[rcontai ejpi; to; mnhmei`on\najnateivlanto~ tou` hJlivou.\n3 kai; e[legon pro;~\nLuke 24.1–11\n1 ThÛ` de; mia`\/\ntw`n sabbavtwn o[rqrou\nbaqevw~ ejpi; to; mnh`ma h\\lqon\nfevrousai a} hJoivmasan\najrwvmata.\nMy question is whether such evidence is not better explained in terms of oral\ntradition – that is, as retellings of a familiar story, with variations dependent on the\nteller’s foibles and the community’s perceived interests. That may mean that\n162  . . \nMatt. 28.1–8\n2 kai; ijdou; seismo;~\nejgevneto mevga~∑ a[ggelo~ ga;r\nkurivou kataba; ejx oujranou`\nkai; proselqw;n ajpekuvlisen\nto;n livqon kai; ejkavqhto\nejpavnw aujtou`. 3 h\\n de; hJ\neijdeva aujtou` wj~ ajstraph;\nkai; to; e[nduma aujtou` leuko;n\nwJ~ ciwvn. 4 ajpo; de; tou`\nfovbou aujtou` ejseivsqhsan oiJ\nthrou`nte~ kai; ejgenhvqhsan\nwJ~ nekroiv. 5 ajpokriqei;~\nde; oJ a[ggelo~ ei\\pen tai`~\ngunaixivn∑ mh; fobei`sqe\nuJmei`~, oi\\da ga;r\no{ti ∆Ihsou`n to;n\nejstaurwmevnon zhtei`te∑ 6\noujk e[stin w|de, hjgevrqh ga;r\nkaqw;~ ei\\pen∑ deu`te i[dete\nto;n tovpon o{pou e[keito.\n7 kai;\ntacu; poreuqei`sai ei[pate\ntoi`~ maqhtai`~ aujtou` o{ti\nhjgevrqh ajpo; tw`n nekrw`n,\nkai; ijdou; proavgei uJma`~ eij~\nth;n Galilaivan, ejkei` aujto;n\no[yesqe∑ ijdou; ei\\pon uJme`n.\n8 Kai; ajpelqou`sai tacu;\najpo; tou` mnhmeivou meta;\nfovbou kai; cara`~ megavlh~\ne[dramon ajpaggei`lai toi`~\nmaqhtai`~ aujtou`.\nMark 16.1–8\neJautav~∑ tiv~ ajpokulivsei\nhJmi`n to;n livqon ejk th`~\nquvra~ tou` mnhmeivou… 4\nkai; ajnablevyasai qewrou`sin\no{ti ajpokekuvlistai oJ livqo~∑\nh|n ga;r mevga~ sfovdra.\n5 Kai; eijselqou`sai\neij~ to; mnhmei`on ei|don\nneanivskon kaqhvmenon ejn\ntoi`~ dexioi`~ peribeb-\nlhmevnon stolh;n leukhvn,\nkai; ejxeqambhvqhsan.\n6 oJ de; levgei\naujtai`~∑ mh; ejkqambei`sqe∑\n∆Ihsou`n zhtei`te to;n\nNazarhno;n to;n\nejstaurwmevnon∑ hjevrqh,\noujk e[stin w|de∑\ni[de\noJ tovpo~ o{pou e[qhkan\naujtovn.\n7 ajlla; uJpavgete ei[pate\ntoi`~ maqhtai`~ aujtou` kai; tw`\/\nPevtrw\/\no{ti proavgei uJma`~ eij~\nth;n Galilaivan∑ ejkei` aujto;n\no[yesqe, kaqw;~ ei\\pen uJmi`n.\n8 kai; ejxelqou`sai e[fugon\najpo; tou` mnhmeivou, ei\\cen\nga;r aujta;~ trovmo~ kai;\ne[kstasi~∑ kai; oujdeni; oujde;n\nei\\pan∑ ejfobou`nto gavr.\nLukr 24.1–11\n2 eu|ron de; to;n livqon\najpokekulismevnon ajpo; tou`\nmnhmeivou, 3 eijselqou`sai\nde; oujc eu|ron to; sw`ma tou`\nkurivou ∆Ihsou`. 4 kai;\nejgevneto ejn tw`\/ ajporei`sqai\naujta;~ peri; touvtou kai; ijdou;\na[ndre~ duvo ejpevsthsan\naujtai`~ ejn ejsqh`ti\najstraptouvshÛ. 5 ejmfovbwn\nde; genomevnwn aujtw`n kai;\nklinousw`n ta; provswpa eij~\nth;n gh`n ei\\pan pro;~ aujtav~∑\ntiv zhtei`te to;n zw`nta meta;\ntw`n nekrw`n∑\n6 oujk e[stin\nw|de, ajlla; hjgevrqh. mnhvsqhte\nwJ~ ejlavlhsen uJmi`n e[ti w]n ejn\nth`\/ Galilaiva\/ 7 levgwn to;n\nuiJo;n tou` ajnqrwvpou o{ti dei`\nparadoqh`nai eij~ cei`ra~\najnqrwvpwn aJmartwlw`n kai;\nstaurwqh`nai kai; th`\/ trivthÛ\nhJmevra\/ ajnasth`nai. 8 kai;\nejmnhvsqhsan tw`n rJhmavtwn\naujtou`.\n9 Kai; uJpostrevyasai\najpo; tou` mnhmeivou ajphvgg-\neilan tau`ta pavnta toi`~\ne{ndeka kai; pa`sin toi`~\nloipoi`~. 10 h\\san de; hJ\nMagdalhnh; Mariva kai;\n∆Iwavnna kai; Mariva hJ\n∆Iakwvbou tai; aiJ loipai; su;n\naujtai`~. e[legon pro;~ tou;~\najpostovlou~ tau`ta, 11 kai;\nejfavnhsan ejnwvpion aujtw`n\nwJsei; lh`ro~ ta; rJhvmata\ntau`ta, kai; hjpivstoun\naujtai`~.\nMatthew or Luke already knew versions of the stories which differed from Mark’s,\nand that they followed these different versions. Or, bearing in mind the charac-\nteristics of oral performance, perhaps we should envisage Matthew and Luke\nretelling the story known to them from Mark, that is, retelling it in oral mode – that\nis, as story tellers, rather than editors – Matthew and Luke as evidence not so\nmuch of redaction as of second orality.\n(b) Q tradition? The Q hypothesis, which I accept, is built in the first instance\non the closeness of parallel between non-Markan Matthew\/Luke pericopes. More\nthan 13 per cent of these common pericopes are more than 80 per cent in verbal\nagreement. But the fact that the verbal agreement in over a third of the common\nmaterial is less than 40 per cent72 has not been given sufficient weight. Is it to be\nexplained solely in terms of free redaction? Consider the following examples:\nturning the other cheek, in Matt. 5.39b–42\/Luke 6.29–30; dividing families, in\nMatt. 10.34–8\/Luke 12.51–3 and 14.26–7; and forgiving sins seven times, in Matt.\n18.15, 21–2\/Luke 17.3–4 (the underlining and highlighting once again indicate the\nextent of the verbal agreement).\nAltering the Default Setting 163\n72 See Kloppenborg Verbin’s summary of Morgenthaler’s data (Excavating Q, 63). Kloppenborg\nVerbin defends a literary dependence in such cases by pointing out that Matthew and Luke\nshow equal freedom in their use of Mark (64). But he does not consider the obvious alterna-\ntive noted above, that such divergences of Matthew and Luke from Mark may indicate rather\nthat Matthew and Luke knew and preferred to use other oral versions of the tradition, or to\nretell Mark’s version in oral mode.\nMatt. 5.39b–42\n39 . . . ajll∆ o{sti~ se rJapivzei eij~ th;n\ndexia;n siagovna ªsouº, strevyon aujtw`\/ kai; th;n\na[llhn∑ 40 kai; tw`\/ qevlontiv soi kriqh`nai\nkai; to;n citw`nav sou labei`n, a[fe~ aujtw\/` kai;\nto; iJmavtion∑ 41 kai; o{sti~ se ajggareuvsei\nmivlion e{n, u{page met j aujtou` duvo. 42 tw`\/\naijtou`ntiv se dov~, kai; to;n qevlonta ajpo; sou`\ndenivsasqai mh; ajpostrafhÛ`~.\nLuke 6.29–30\n29 tw`\/ tuvptontiv se ejpi; th;n\nsiagovna pavrece kai; th;n\na[llhn, kai; ajpo; tou` ai[rontov~ sou to; iJmavtion\nkai; to;n citw`na mh; kwluvshÛ~.\n30 panti\naijtou`ntiv se divdou, kai; ajpo; tou` ai[ronto~ ta;\nsa; mh; ajpaivtei.\nMatt. 10.34–8\n34 Mh; nomivshte o{ti h\\lqon balei`n eijrhvnhn\nejpi; th;n gh`n∑ oujk h\\lqon balei`n eijrhvnhn\najlla; mavcairan.\n35\nh\\lqon ga;r dicavsai a[nqrwpon kata; tou`\npatro;~ auktou` kai\nqugatevra kata; th`~ mhtro;~ aujth`~ kai;\nnuvmfhn kata; th`~ penqera`~ aujth`~, 36 kai;\nejcqroi; tou` ajnqrwvpou oiJ oijkiakoi; aujtou`.\nLuke 12.51–3; 14.26–7\n12.51 dokei`te o{ti eijrhvnhn paregenovmhn\ndou`nai ejn th`Û ghÛ`… oujciv, levgw uJmi`n, ajll∆ h]\ndiamerismovn. 52 e[sontai ga;r ajpo; tou` nu`n\npevnte ejn eJni; oi[kw\/ diamemerismevnoi, trei`~\nejpi; dusi;n kai; duvo ejpi; trisivn, 53\ndiamerisqhvsontai path;r ejpi; uiJw`\/ kai; uiJo;~\nejpi; patriv, mhvthr ejpi; th;n qugatevra kai;\nqugavthr ejpi; th;n mhtevra, penqera; ejpi; th;n\nnuvmfhn aujth`~ kai; nuvmfh ejpi; th;n penqeravn.\nMy question is again simple: is there anything in these passages which compels\nthe conclusion that one has drawn the sayings from the other or that both have\ndrawn from a common literary source?73 Is the assumption that only literary\ndependence need or should be invoked not a consequence of our literary\ndefault setting, a consequence of our reading such passages through the specta-\ncles or with the blinkers of a mindset formed by our print-dominated heritage?\nOught we not to make the effort to hear these traditions as they were shaped\nand passed down in an oral culture? Ought we not to give more consideration to\nthe likelihood, not to say the probability, that such variation in what is\nobviously the same essential tradition is the result of the flexibility of oral\nperformance?74\n(c) Liturgical tradition. The two most obvious examples of liturgical tradition\nare the Lord’s prayer and the words of the Last Supper. By liturgical tradition I\nmean, of course, traditions which were regularly used in worship in\nthe early churches. That these two traditions were so used is not merely a\ndeduction from the Gospel texts but is confirmed by Did. 8.2 and 1 Cor. 11.23–6.\nHow then should we explain the variations in the traditions of the Lord’s\nPrayer?\n164  . . \n73 My distinguished predecessor C. K. Barrett was asking the same question 60 years ago in his\n‘Q: A Re-examination’, ExpT 54 (1942–3) 320–3.\n74 As Streeter recognized (Four Gospels, 184–6, 229).\nMatt. 10.34–8\n37 ÔO filw`n patevra h] mhtevra uJpe;r ejme; oujk\ne[stin mou a[xio~, kai; oJ filw`n uiJo;n h}\nqugatevra uJpe;r ejme; oujk e[stin mou a[xio~∑\n38\nkai; o}~ ouj lambavnei to;n stauro;n aujtou` kai;\najkolouqei` ojpivsw mou, oujk e[stin mou a[xio~.\nLuke 12.51–3; 14.26–7\n14.26 ei[ ti~ e[rcetai prov~ me kai; ouj misei`\nto;n patevra eJautou` kai; th;n mhtevra kai; th;n\ngunai`ka kai; ta; tevkna kai; tou;~ ajdelfou;~\nkai; ta;~ ajdelfa;~ e[ti te kai; th;n yuch;n\neJautou` ouj duvnatai ei\\naiv mou maqhth;~. 27\no{sti~ ouj bastavzei to;n stauro;n eJautou` kai;\ne[rcetai ojpivsw mou, ouj duvnatai ei\\naiv mou\nmaqhthv~.\nMatt. 18.15, 21–2\n15 Ea;n de; aJmarthvshÛ oJ\najdelfov~ sou, u{page e[legxon aujto;n metaxu;\nsou` kai; aujtou` movnou. ejavn sou ajkouvshÛ,\nejkevrdhsa~ to;n ajdelfovn sou∑\n21 Tovte proselqw;n oJ Pevtro~ ei\\pen aujtw`\/∑\nkuvrie, posavki~ aJmarthvsei eij~ ejme; oJ ajdelfov~\nmou kai; ajfhvsw aujtw`\/… e{w~ eJptavki~… 22\nlevgei aujtw`\/ oJ ∆Ihsou`~∑ ouj levgw soi e{w~\neJptavki~ ajlla; e{w~ eJbdomhkontavki~ eJptav.\nLuke 17.3–4\n3 prosevcete eJautoi`~. ∆Ea;n aJmavrthÛ oJ\najdelfov~ sou ejpitivmhson aujtw`\/,\nkai; eja;n metanohvshÛ\na[fe~ aujtw`\/.\n4 kai; eja;n eJptavki~ th`~ hJmevra~ aJmarthvshÛ\neij~ se; kai; eJptavki~ ejpistrevyhÛ pro;~ se;\nlevgwn∑ metanow`, ajfhvsei~ aujtw`\/.\nSo too, how should we explain the variations in the traditions of the Last Supper,\nas between the Matthew\/Mark version on the one hand and the Luke\/Paul ver-\nsion on the other?\nAltering the Default Setting 165\nMatt. 26.26–9\n26 ∆Esqiovntwn de; aujtw`n labw;n oJ ∆Ihsou`~\na[rton kai; eujloghvsa~ e[klasen kai; dou;~ toi`~\nmaqhtai`~ ei\\pen∑ lavbete favgete, tou`tov ejstin\nto; sw`mav mou. 27 kai; labw;n pothvrion kai;\neujcaristhva~ e[dwken aujtoi`~ levgwn∑ pivete\nejx aujtou` pavnte~, 28\ntou`to gavr ejstin to; ai|mav mou th`~ diaqhvkh~\nto; peri; pollw`n ejkcunnovmenon eij~ a[fesin\naJmartiw`n. 29 levgw de; uJmi`n, ouj mh; pivw ajp j\na[rti ejk touvtou tou` genhvmato~ th`~ ajmpevlou\ne{w~ th`~ hJmevra~ ejkeivnh~ o{tan aujto; pivnw\nmeq∆ uJmw`n kaino;n ejn th`\/ basileiva\/ tou`\npatrov~ mou.\nMark 14.22–5\n22 Kai; ejsqiovntwn aujtw`n labw;n\na[rton eujloghvsa~ e[klasen kai; e[dwken\naujtoi`~ kai; ei\\pen∑ lavbete, tou`tov ejstin\nto; sw`mav mou. 23 kai; labw;n pothvrion\neujcaristhvsa~ e[dwken aujtoi`~, kai; e[pion\nejx aujtou` pavnte~. 24 kai; ei\\pen aujtoi`~∑\ntou`tov ejstin to; ai|mav mou th`~ diaqhvkh~\nto; ejkcunnovmenon uJpe;r pollw`n.\n25 ajmh;n levgw uJmi`n o{ti oujkevti ouj\nmh; tivw ejk tou` genhvmato~ th`~ ajmpevlou\ne{w~ th`~ hJmevra~ ejkeivnh~ o{tan aujto; pivnw\nkaino;n ejn th`\/ basileiva\/ tou\nqeou`.\nLuke 22.17–20\n17 kai; dexavmeno~ pothvrion eujcaristhvsa~\nei\\pen∑ lavbete tou`to kai; diamerivsate eij~\neJautouv~∑ 18 levgw ga;r uJmi`n, ªo{tiº ouj mh; pivw\najpo; tou` nu`n ajpo; tou` genhvmato~ th`~ \n1 Cor. 11.23–6\n23 ∆Egw; ga;r parevlabon ajpo;\ntou` kurivou, o} kai; parevdwka uJmi`n, o{ti oJ\nMatt. 6.7–15\n7 Proseucovmenoi de; mh; battaloghvshte\nw{sper oiJ ejqnikoiv, dokou`sin ga;r o{ti ejn thÛ`\npoluloyiva\/ aujtw`n eijsakousqhvsontai. 8 mh;\nou\\n oJmoiwqh`te aujtoi`~∑ oi\\den ga;r oJ path;r\nuJmw`n w|n creivan e[cete pro; tou` ujma`~ aijth`sai\naujtovn.\n9 ou{tw~ ou\\n proseuvcesqe uJmei`~∑\nPavter hJmw`n oJ ejn toi`~ oujranoi`~∑ aJgiasqhvtw\nto; o[nomav sou∑ 10 ejlqevtw hJ basileiva sou∑\ngenhqhvtw to; qevlhmav sou, wJ~ ejn oujranw`\/ kai;\nejpi; gh`~∑ 11 to;n a[rton hJmw`n to;n ejpiouvsion\ndo;~ hJmi`n shvmeron∑ 12 kai; a[fe~ hJme`n\nta; ojfeilhvmata hJmw`n, wJ~ kai; hJmei`~ ajfhvkamen\ntoi`~ ojfeilevtai~ hJmw`n∑ 13 kai; mh;\neijsenevgkhÛ~ hJma`~ eij~ peirasmovn, ajlla; rJu`sai\nhJma`~ ajpo; tou` ponhrou`. 14 ∆Ea;n ga;r ajfh`te\ntoi`~ ajnqrwvpoi~ ta; paraptwvmata aujtw`n,\najfhvsei kai; uJmi`n oJ path;r uJmw`n oJ oujravnoi~∑\n15 eja;n de; mh; ajfh`te toi`~ ajnqrwvpoi~, oujde; oJ\npath;r oJmw`n ajfhvsei ta; paraptwvmata uJmw`n.\nLuke 11.1–4\n1 Kai; ejgevneto ejn tw`\/ ei\\nai aujto;n ejn tovpw\/\ntini; proseucovmenon, wJ~ ejpauvsato, ei\\pevn ti~\ntw`n maqhtw`n aujtou` pro;~ aujtovn∑ kuvrie,\ndivdaxon hJma`~ proseuvcesqai, kaqw;~ kai;\n∆Iwavnnh~ ejdivdaxen tou;~ maqhta;~ aujtou`. 2\nei\\pen de; aujtoi`~∑ o{tan proseuvchsqe levgete∑\nPavter, aJgiasqhvtw\nto; o[nomav sou∑ ejlqevtw hJ basileiza sou∑\n3 to;n a[rton hJmw`n to;n ejpiouvsion\ndivdou hJmi`n to; kaq j hJmevran∑ 4 kai; a[fe~ hJmi`n\nta;~ aJmartiva~ hJmw`n, kai; ga;r aujtoi; ajfivomen\npanti; ojfeivlonti hJmi`n∑ kai; mh;\neijsenevgkhÛ~ hJma`~ eij~ peirasmovn.\nWhat failure in historical imagination is it that could even suggest to us that\nMatthew, say, only knew the Lord’s prayer because he read it in Q?75 Or that Luke\nonly knew the words of the Last Supper because he found them in Mark? The\nalternative explanation positively cries out for consideration: that these were\nliving traditions, living because used in regular church assemblies; that even\nthough liturgical tradition tends to be more stable than other oral tradition, never-\ntheless, as is common with oral tradition, it adapted in wording to the usage of dif-\nferent churches – as the Lord’s Prayer still adapts in different traditions today.\nSuch liturgical traditions are special examples of oral tradition and oral transmis-\nsion, but they reflect the character of oral communities far more closely than do\nexplanations dependent solely on the literary paradigm.\n(d) There are several stylistic features characteristic of oral tradition – for\n166  . . \n75 Contrast D. E. Oakman, ‘The Lord’s Prayer in Social Perspective’, in B. Chilton and C. A.\nEvans, eds, Authenticating of the Words of Jesus (Leiden: Brill, 1999) 137–86: ‘the differences in\nform are best accounted for by differing scribal traditions and interests’ (151–2), with the\nsounder judgement of H. D. Betz, The Sermon on the Mount (Hermeneia: Minneapolis:\nFortress, 1995) 370–1: ‘It is characteristic of liturgical material in general that textual fixation\noccurs at a later stage in the transmission of these texts, while in the oral stage variability\nwithin limits is the rule. These characteristics also apply to the Lord’s Prayer. The three\nrecensions, therefore, represent variations of the prayer in the oral tradition. . . . (T)here was\nnever only one original written Lord’s Prayer. . . . (T)he oral tradition continued to exert an\ninfluence on the written text of the New Testament well into later times’ (370). M. Goulder,\n‘The Composition of the Lord’s Prayer’, JTS 14 (1963) 32–45, argues that the prayer was writ-\nten up by Matthew from hints found in Mark, and that Luke was dependent on Matthew’s\nversion.\nLuke 22.17–20\najmpevlou e{w~ ou| hJ basileiva tou` qeou` e[lqhÛ.\n19 kai; labw;n a[rton eujcaristhvsa~\ne[klasen kai; e[dwken aujtoi`~ levgwn∑ tou`tov\nejstin to; sw`mav mou to; uJpe;r uJmw`n didovmenon∑\ntou`to poiei`te eij~ th;n ejmh;n ajnavmnhsin. 20\nkai; to; pothvrion wJsauvtw~ meta; to;\ndeipnh`sai, levgwn∑ pou`to to; pothvrion hJ\nkainh; diaqhvkh ejn tw`\/ ai{mativ mou to;\nuJpe;r uJmw`n ejkcunnovmenon.\n1 Cor. 11.23–6\nkuvrio~ ∆Ihsou`~ ejn th`Û nukti; h|Û paredivdeto\ne[laben a[rton 24 kai; eujcaristhvsa~\ne[klasen kai; ei\\pen∑ tou`tov\nmouv ejstin to; sw`ma to; uJpe;r uJmw`n∑\ntou`to poiei`te eij~ th;n ejmh;n ajnavmnhsin. 25\nwJsauvtw~ kai; to; pothvrion meta; to;\ndeipnh`sai levgwn∑ tou`to to; pothvrion hJ\nkainh; diaqhvkh ejsti;n ejn tw`\/ ejmw`\/ ai{mati∑\ntou`to poiei`te, oJsavki~ eja;n pivnhte, eij~ th;n\nejmh;n ajnavmnhsin. 26 oJsavki~ ga;r eja;n\nejsqivhte to;n a[rton tou`ton kai; to; pothvrion\npivnhte, to;n qavnaton tou` kurivou\nkataggevllete a[cri ou| e[lqhÛ.\nexample, parataxis,76 rhythmic speech,77 repetition,78 multiple existence and vari-\nation.79 This is not to say, I repeat, that such features are distinctive of oral tra-\ndition: the written document Mark provides one of the best examples of parataxis.\nHowever, the question arises once again whether the tradition retold by Mark is\nretold in oral mode, rather than as a distinctively literary exercise80 – a question\nonce again of how we envisage the character of the tradition used by Mark, as also\nhow we envisage Mark’s use of it.\nOne of the best attested characteristics of oral tradition is the pattern of threes\n– stories built on three episodes or illustrations. Such patterning positively invites\nthe oral performer to vary the examples or episodes at his own whim, often quite\nspontaneously within the performance itself. There are some good examples of\nthis feature within the Jesus tradition. I cite two, focusing only on the section\nwhere the pattern of threes is followed. First, Matt. 22.5–6\/Luke 14.18–20, the\nexcuses made by those invited to the great supper or royal wedding banquet; note\nagain how little verbal agreement there is between them.81\nAltering the Default Setting 167\n76 ‘One law of narrative in oral poetry, noted by specialists, takes the form of parataxis: the lan-\nguage is additive, as image is connected to image by “and” rather than subordinated in some\nthoughtful relationship’ (Havelock, Muse, 76).\n77 Ibid., 70–1. Here the examples from the Jesus tradition produced by J. Jeremias, New\nTestament Theology. Part One: The Proclamation of Jesus (London: SCM, 1971) are very much\nto the point (20–7).\n78 Achtemeier, ‘Omne verbum sonat’, 23–4.\n79 See above, n. 57.\n80 See particularly J. Dewey, ‘Oral Methods of Structuring Narrative in Mark’, Interpretation 43\n(1989) 32–44; also ‘The Gospel of Mark as an Oral–Aural Event: Implications for\nInterpretation’, in E. S. Malbon and E. V. McKnight, eds, The New Literary Criticism and the\nNew Testament (JNSTS 109; Sheffield: Sheffield Academic, 1994) 145–63; Horsley, Hearing the\nWhole Story, ch. 3.\n81 Note that in Gospel of Thomas 64, the performance variation runs to four different excuses.\nMatt. 22.1–10\n1 Kai; ajpokriqei;~ oJ ∆Ihsou`~ pavlin ei\\pen ejn\nparabolai`~ aujtoi`~ levgwn∑ 2 wJmoiwvqh hJ\nbasileiva tw`n oujranw`n ajnqrwvpw\/ basilei`,\no{sti~ ejpoivhsen gavmou~ tw`\/ uiJw`\/ aujtou`. 3\nkai; ajpevsteilen tou;~ douvlou~ aujtou` kalevsai\ntou;~ keklhmevnou~ eij~ tou;~ gavmou~, kai; oujk\nh[qelon ejlqei`n. 4 pavlin ajpevsteilen a[llou~\ndouvlou~ levgwn∑ ei[pate toi`~ keklhmevnoi~∑\nijdou; to; a[ristovn mou hJtoivmaka, oiJ tau`roiv\nmou kai; ta; sitista; tequmevna kai; pavnta\ne[toima∑ deu`te eij~ tou;~ gavmou~. 5 oiJ de;\najmelhvsante~ ajph`lqon,\nLuke 14.16–24\n16 O de; ei\\pen aujtw`\/˘ a[nqrwpov~ ti~ ejpoivei\ndei`pnon mevga, kai; ejkavlesen pollou;~ 17\nkai; ajpevsteilen to;n dou`lon aujtou` th`Û w{ra\/\ntou` deivpnou eijpei`n toi`~ keklhmevnoi~∑\ne[rcesqe, o{ti h[dh e{toimav ejstin.\n18 kai; h[rxanto ajpo; mia`~ pavnte~\nparaitei`sqai.\nSecond, the account of Peter’s threefold denial, in Mark 14.66–71 pars.\n168  . . \nMatt. 22.1–10\no}~ me;n eij~ to;n i[dion ajgrovn,\no}~ de; ejpi; th;n ejmporivan aujtou`∑\n6 oiJ de; loipoi; krathvsante~ tou;~ douvlou~\naujtou` u{brisan kai; ajpevkteinan.\n7 oJ de; basileu;~ wjrgivsqh kai; pevmya~ ta;\nstrateuvmata aujtou` ajpwvlesen tou;~ fonei`~\nejkeivnou~ kai; th;n povlin aujtw`n ejnevprhsen. 8\ntovte levgei toi`~ douvloi~ aujtou`∑ oJ me;n gavmo~\ne[toimov~ ejstin, oiJ de; keklhmevnoi oujk h\\san\na[xioi∑ 9 poreuvesqe ou\\n ejpi; ta;~ diexovdou~\ntw`n oJdw`n kai; o{sou~ eja;n eu{rhte kalevsate\neij~ tou;~ gavmou~.\n10 kai; ejxelqovnte~ oiJ dou`loi ejkei`noi eij~\nta;~ oJdou;~ sunhvgagon pavnta~ ou}~ eu|ron,\nponhrouv~ te kai; ajgaqouv~∑ kai; ejplhvsqh oJ\ngavmo~ ajnakeimevnwn.\nLuke 14.16–24\nJoJ prw`to~ ei\\pen aujtw`\/∑ ajgro;n hjgovrasa kai;\ne[cw ajnavgkhn ejxelqw;n ijdei`n aujtovn∑ ejrwtw`\nse, e[ce me parhÛthmevnon.\n19 kai; e{tero~ ei\\pen∑ zeuvgh bow`n hjgovrasa\npevnte kai; poreuvomai dokimavsai aujtav∑ ejrwtw`\nse, e[ce me parhÛthmevnon.\n20 kai; e{tero~ ei\\pen, gunai`ka e[ghma kai;\ndia; tou`to ouj duvnamai ejlqei`n.\n21 kai; paragenovmeno~ oJ dou`lo~ ajphvggeilen\ntw`\/ kurivw\/ aujtou` tau`ta. tovte ojrgisqei;~ oJ\noijkodespovth~\nei\\pen tw`\/ douvlw\/ aujtou`˘ e[xelqe tacevw~ eij~\nta;~ plateiva~ kai; rJuvma~ th`~ povlew~ kai;\ntou;~ ptwcou;~ kai; ajnapeivrou~ kai; tuflou;~\nkai; cwlou;~ eijsavgage w|de. 22 kai; ei\\pen oJ\ndou`lo~∑ kuvrie, gevgonen o} ejpevtaxa~, kai; e[ti\ntovpo~ ejstivn. 23 kai; ei\\pen oJ kuvrio~ pro;~\nto;n dou`lon∑ e[xelqe eij~ ta;~ oJdou;~ kai;\nfragmou;~ kai; ajnavgkason eijselqei`n, i[na\ngemisqh`Û mou oJ oi\\ko~∑ 24 levgw ga;r uJmi`n\no{ti oujdei;~ tw`n ajndrw`n ejkeivnwn tw`n\nkeklhmevnwn geuvsetaiv mou tou` deivpnou.\nMatt. 26.69–75\n69 ÔO de; Pevtro~ ejkavqhto\ne[xw ejn th`Û aujlh`Û∑ kai;\nprosh`lqen aujtw`\/ miva\npaidivskh\nlevgousa∑ kai;\nsu; h\\sqa meta; ∆Ihsou` tou`\nGalilaivou. 70 oJ de;\nhjrnhvsato e[mprosqen\npavntwn levgwn∑ oujk oi\\da tiv\nlevgei~. 71\nejxelqovnta de; eij~ to;n\npulw`na ei\\den aujto;n a[llh\nkai; levgei toi``~ ejkei`∑\nou|to~ h\\n meta; ∆Ihsou`\ntou` Nazwraivou. 72 kai;\npavlin hjrnhvsato meta; o{rkou\no{ti oujk oi\\da to;n a[nqrwpon.\n73 meta; mikro;n de pros-\nMark 14.66–72\n66 Kai; o[not~ tou` Pevtrou\nkavtw ejn th`Û aujlh`Û e[rcetai\nmiva\ntw`n paidiskw`n tou`\najrcierevw~ 67 kai; idou`sa\nto;n Pevtron qermainovmenon\nejmblevyasa aujtw`\/ levgei∑ kai;\nsu; meta; tou` Nazarhnou`\nh\\sqa tou` ∆Ihsou`. 68 oJ de;\nhjrnhvsato\nlevgwn∑ ou[te oi\\da ou[te\nejpivstamai su; tiv levgei~. kai;\nejxh`lqen e[xw eij~ to;\nproauvlion. 69 kai; hJ\npaidivskh ijdou`sa aujto;n\nh[rxato pavlin levgein toi`~\nparestw`sin o{ti ou|to~ ejx\naujtw`n ejstin. 70 oJ de;\npavlin hjrnei`to.\nkai; meta; mikro;n pavlin oiJ\nLuke 22.56–62\n56 ijdou`sa de; aujto;n\npaidivskh ti~ kaqhvmenon\npro;~ to; fw`~ kai; ajtenivsasa\naujtw`\/ ei\\pen∑ kai; ou|to~ su;n\naujtw`\/ h\\n. 57 oJ de;\nhjrnhvsato\nlevgwn∑ oujk oi\\da aujtovn,\nguvnai.\n58 kai; meta;\nbracu; e{tero~ ijdw;n aujto;n\ne[fh∑\nkai; su; ejx aujtw`n ei\\. oJ de;\nPevtro~ e[fh∑ a[nqrwpe, oujk\neijmiv.\n59 kai; diastavsh wJsei;\nw{ra~ mia`~ a[llo~ ti~\nIn all these cases we see what is characteristic of oral tradition’s combination\nof fixity and flexibility, stability and variation. Of course, I repeat yet again, such\ncharacteristics are not exclusive to oral tradition. The difference comes in the way\nwe envisage the traditioning process. In oral transmission we do not look for an\nexplanation for the diversity in terms (only) of editorial redaction, but in terms of\nperformance variation. The explanation lies as much or more in the character \nof the tradition as in the interpretative goals of the performer. And we do not look\nbehind the variations for some original (and therefore more authentic) version or\nsource. Rather, we recognize the character of the Jesus tradition as oral tradition,\nwhere appropriateness of performance to context is not a departure from authen-\nticity but integral to the tradition’s living character.\nHad I time I would extend the exploration to the knowledge of Jesus tradition\noutside the Gospels. In my judgement, discussion of possible allusions to and use\nof the Jesus tradition, both within the NT epistles (Paul, James, 1 Peter), within the\nApostolic Fathers, and now also within the Nag Hammadi texts, has been\nseriously flawed by overdependence on the literary paradigm. For if we are indeed\ntalking about largely illiterate communities, dependent on oral tradition and aural\nknowledge of written documents, then we have to expect as the rule that knowl-\nedge of the Jesus tradition will have shared the characteristics of oral tradition.\nThat is to say, the historical imagination, liberated from the literary default \nsetting and tutored in regard to oral culture, can readily envisage communities\nfamiliar with their oral tradition, able to recognize allusions to Jesus tradition in\nAltering the Default Setting 169\nMatt. 26.69–75\nelqovnte~ oij ejstw`te~ ei\\pon\ntw`\/ Pevtrw\/∑ ajlhqw`~ kai; su;\nejx aujtw`n ei\\, kai; ga;r\nhJ laliav sou dh`lovn se\npoiei`. 74 tovte h[rxato\nkataqemativzein kai; ojmnuvein\no{ti oujk oi\\da to;n a[nqrwpon.\nkai;\neujqevw~ ajlevktwr\nejfwvnhsen. .\n75 kai; ejmnhvsqh oJ\nPevtro~ tou` rJhvmato~ ∆Ihsou` \neijrhkovto~ o{ti\npri;n ajlevktora fwnh`sai\ntri;~ ajparnhvshÛ me∑\nkai; ejxelqw;n e[xw\ne[klausen pikrw`~.\nMark 14.66–72\nparestw`te~ e[legon\ntw`\/ Pevtrw\/∑ ajlhqw`~\nejx aujtw`n ei\\, kai; ga;r\nGalilai`o~ ei\\.\n71 oJ de; h[rxato\najnaqemativzein kai; ojmnuvnai\no{ti oujk oi\\da to;n a[nqrwpon\ntou`ton o}n levgete. 72 kai;\neujqu;~ ejk deutevrou ajlevktwr\nejfwvnhsen.\nkai; ajnemnhvsqh oJ\nPevtro~ to; rJh`ma wJ~ ei\\pen\naujtw`\/ oJ ∆Ihsou`~ o{ti\npri;n ajlevktora fwnh`sai di;~\ntriv~ me ajparnhvshÛ∑\nkai; ejpibalw;n e[klaien.\nLuke 22.56–62\ndii>scurivzeto levgwn∑ ejp∆\najlhqeiva~ kai; ou|to~ met∆\naujtou` h\\n, kai; ga;r\nGalilai`ov~ ejstin. 60 ei\\pen\nde; oJ Pevtro~˘\na[nqrwpe,\noujk oi\\da o} levgei~.\nkai; paracrh`ma e[ti\nlalou`not~ aujtou` ejfwvnhsen\najlevktwr. 61 kai; strafei;~\noJ kuvrio~ ejnevbleyen tw`\/\nPevtrw\/, kai; uJpemnhvsqh oJ\nPevtro~ tou` rJhvmato~ tou`\nkurivou wJ~ ei\\pen aujtw`\/ o{ti\npri;n ajlevktora fwnh`sai\nshvmeron ajparnhvshÛ me triv~.\n62 kai; ejxelqw;n e[xw\ne[klausen pikrw`~.\nperformances of an apostolic letter written to them, and to fill in ‘the gaps of inde-\nterminacy’ in other performances of that tradition.82\nThe suggestion of a living oral tradition, still continuing after so much of it was\nwritten down in various Gospels, carries with it, of course, the possibility that the\ntradition was significantly modified in its central thrust – that the flexibility over-\nwhelmed the stability, the diversity the continuity. Here we would have to enter\nthe debate about the ‘authenticity’ of the Jesus tradition in the forms which it\ncame to take in documents like the Gospel of Thomas and the Dialogue of the\nSaviour, not to mention the Gospel of John! That is a debate for another day – in\nparticular, on the criteria by which a form of the tradition was recognized as true\nto its originating impulse, and on the role of the community in checking the per-\nformances of that tradition.83 Here it must suffice simply to note again that any\nattempt to resolve the issue purely in terms of literary dependence, or of the liter-\nary concept of the ‘original’ form of the tradition, is hardly likely to prove satisfac-\ntory in the long run. Unless we take seriously the oral character of the early\ntransmission of the Jesus tradition we are always going to be in the position of one\nwho attempts to describe a horse as a wheelless automobile, with the mispercep-\ntion of what we are trying to describe as the unavoidable outcome.\n5. Conclusions and corollaries\nI believe we are confronted with a stark alternative: either we continue to\noperate within the literary paradigm and allow it to determine the way we envis-\nage the earliest churches, their knowledge of the Jesus tradition and their use of it;\nor we deliberately alter that default setting and attempt consciously to envisage a\nworld strange to us, a world of rampant illiteracy, a world where information was\ncommunicated orally, a world where knowledge in the vast majority of cases came\nfrom hearing rather than from reading. There is room for compromise on this\nalternative, but not so much as we have simply assumed. For if we allow that the\nJesus tradition as it has come down to us consists to any extent of various per-\nformances, frozen in writing to be sure, but no less in the first instance perform-\nances, rather than edited versions of some ‘original’, then our basic\nmethodologies of source and form and redaction criticism become increasingly\nspeculative in their application and uncertain in their outcome.\nConsider what corollaries we are loaded with when we opt for an exclusive or\n170  . . \n82 I may refer here simply to my earlier attempts to develop this theme – ‘Jesus Tradition in\nPaul’, in B. Chilton and C. A. Evans, Studying the Historical Jesus: Evaluations of the State of\nCurrent Research (Leiden: Brill, 1994) 155–78 (particularly 176–8); also The Theology of Paul the\nApostle (Grand Rapids: Eerdmans\/Edinburgh: T. & T. Clark, 1998) 651–3.\n83 At this point I would wish to take issue with a central thrust of Koester’s magisterial contri-\nbution, Ancient Christian Gospels.\noverdependency on the literary paradigm. For no hypothesis is more vulnerable\nto reductio ad absurdum than the hypothesis of an exclusively literary explanation\nfor the Synoptic tradition. Was there no Jesus tradition known and used and cir-\nculated until Mark gave it life by writing it down? Of course not. Did Mark have to\nseek out ageing apostles or rummage for scraps in boxes hidden away in various\nelders’ houses in order to gather unknown, unused tradition and set it out in\nwriting? Of course not. Was the tradition gathered by Mark known only to Mark’s\nchurch or circle of congregations? Surely not. And once Mark had gathered the\ntradition into his Gospel, did that mean that the tradition ceased to be oral? Of\ncourse not. Or again, when Matthew received Mark’s Gospel, are we to assume\nthat this was the first time Matthew or his church(es) had come across this tra-\ndition? Of course not.\nWhat is the alternative? The alternative is to recognize that in an oral culture,\ntradition, oral tradition, is communal memory. A group’s tradition is the means by\nwhich the group affirms and celebrates what is important about its origins, and\nabout its past. So the alternative is to envisage little groups of disciples and sym-\npathizers, their identity as a group given by their shared response to Jesus himself\nor to one of his disciples\/apostles – little groups who met regularly to share the\nmemories and the traditions which bound them together, for elders or teachers to\ntell again stories of Jesus and to expound afresh and elaborate his teachings.\nOf course Good Friday and Easter made a difference: they brought illumi-\nnation to many features of the earlier tradition; they became integral to the tra-\ndition and were often more important than the earlier tradition; Easter faith\nbecame the context in which the tradition was performed. I do not question that\nfor a moment. But the fact remains that much if not most of the pre-Easter tra-\ndition retained its pre-Easter content and perspective, and various clear indi-\ncations of its Galilean provenance.84 The very features which Q specialists read as\nevidence of a post-Easter Galilean community which knew nothing of the passion\nnarrative are much more naturally read as evidence of Jesus’ own pre-passion\nGalilean mission. That character was already impressed in and on the Jesus tra-\ndition as it was orally circulated already during the mission of Jesus.\nAnd of course the transition from village to city, and from Aramaic to Greek,\nintroduced still further factors influencing the preaching, telling and performance\nof the Jesus tradition. But here again the preservation of that Galilean, pre-passion\ncharacter of so much of the tradition, now in Greek, and as it was circulated in\never widening circles as new churches were established, indicates that it was the\nAltering the Default Setting 171\n84 See particularly H. Schürmann, ‘Die vorösterlichen Anfänge der Logientradition: Versuch\neines formgeschichtlichen Zugangs zum Leben Jesu’, in H. Ristow and K. Matthiae, eds, Der\nhistorische Jesus und der kerygmatische Christus (Berlin: Evangelische, 1961) 342–70; also\nJesus: Gestalt und Geheimnis (Paderborn: Bonifatiuis, 1994) 85–104, 380–97.\nsame tradition which was being thus circulated and used. The essential character\nof that tradition was being maintained in and through the diversity of its per-\nformances.\nOn this model which I ask you to envisage, we need not assume that Mark\nwrote down all the tradition known to him; we can envisage quite readily that the\ntradition he drew upon continued to circulate in oral communication and was\nknown more widely than the Gospel itself; and we can allow that Mark’s Gospel\nitself functioned for many as itself a kind of oral performance,85 known only by\nhearing, and recalled on the basis of that hearing. We can assume that Matthew\nknew at least many of the traditions written down by Mark, and knew the tradition\nalmost certainly in different versions, in accordance with the nature of oral tra-\ndition. Also that in various instances Matthew probably preferred the version of\nthe tradition which he already knew, rather than Mark’s. The same with Luke.\nThe corollaries regarding Q are of greater consequence, particularly in the\nlight of the latest attempt to recover the text of Q.86 For if much of the shared\nMatthew\/Luke material attests oral dependency rather than literary dependency,\nthen the attempt to define the complete scope and limits of Q is doomed to failure.\nIt is not simply that by definition of ‘Q’ (material common to Matthew and Luke)\nwe cannot know its scope and limits, since wherever Matthew or Luke decided not\nto use ‘Q’ we do not have ‘Q’!87 It is rather that the material common to Matthew\nand Luke itself attests the pervasiveness of oral Jesus tradition precisely in its vari-\nability, as well as whatever of that material had already become more fixed in\nwriting (Q).88\nI fully appreciate that the consequences of altering the default setting so\nabruptly are extensive. To abandon the hypothesis of exclusive literary depend-\nence means that we will simply be unable to trace the tradition-history of various\nsayings and accounts so confidently. The unknown factors and variations so char-\nacteristic of oral tradition put the tradition-history – or better, performance-his-\ntory – beyond reach. The model of linear development, layer upon layer, edition\nfollowing edition, is no longer appropriate.\nTo press the point more strongly. In recognizing the oral character of the early\nJesus tradition we have to give up the idea of a single original form, from which all\n172  . . \n85 See again n. 80 above.\n86 J. M. Robinson et al., eds, The Critical Edition of Q (Minneapolis: Fortress\/Leuven: Peeters,\n2000).\n87 The spate of recent work on Q has provoked several vigorous responses, particularly C. S.\nRodd, ‘The End of the Theology of Q?’, ExpT 113 (2001–2) 5–12, and Goodacre, Case Against Q.\nThe case against Q is only as strong as it is because the case for Q has been overstated.\n88 Cf. F. G. Downing, ‘Word-Processing in the Ancient World; The Social Production and\nPerformance of Q’, JSNT 64 (1996) 29–48, reprinted in his Doing Things with Words in the First\nChristian Century (JSNTS 200; Sheffield: Sheffield Academic, 2000) 75–94 (esp. 92–3).\nother versions of the tradition are to be derived, as though the ‘authenticity’ of a\nversion depended on our ability to trace it back to that original. In so saying,\nagain, I do not mean that it is impossible to envisage or speak of the originating\nimpact of Jesus himself. Quite the contrary. What I mean is that the original\nimpact was itself diverse in character from the first. What I mean is that the form\nof the tradition itself was from the first multiform. That also means that variation\nin tradition does not of itself either indicate contradiction or denote editorial\nmanipulation. Variation is simply the hallmark of oral tradition, how the Jesus tra-\ndition functioned.\nIn consequence also, the suggestion that we can define the character of a com-\nmunity from the character of the documents they held in their possession is\nshown to be unrealistic. And the suggestion that the character of a community can\nbe restricted to the character of a single document (for example, the Q com-\nmunity) becomes little short of ludicrous. For if the Jesus tradition was relatively\nwidespread among churches in oral form, if indeed the Jesus tradition formed a\nkind of network linking the churches, as apostles, prophets and others moved\namong them, then there is no good reason to limit the Jesus tradition known to\nindividual churches to a certain kind of tradition or a particular written version of\nsome of that tradition.\nConfronted by the greater uncertainty thereby implied, some may be tempted\nto invoke Occam’s razor: why multiply unknown factors when a simple two-doc-\nument hypothesis with redaction can cover every eventuality?89 The answer is that\nthe simplicity envisaged is far from simple, since it has to postulate editorial inge-\nnuity of tremendous complexity and sophistication. Much more simple in fact is\nthe inference that the variations within the Synoptic tradition reflect more closely\nthe kind of variations which were common in the performance traditions of the\nearly churches. Again I stress that it need not be an either–or. I am not arguing for\none against the other; I am arguing for both.90\nThere is much more to be said about the way the Jesus tradition was used in\nperformance by apostles and teachers. For example, I have already noted how\nLord’s observation that ‘oral traditional composers think in terms of blocks and\nseries of blocks of tradition’ correlates well with the various groupings or clusters\nof pericopes evident in the Synoptic tradition.91 We need not assume, as the early\nform critics did, that in the pre-written-down stage the tradition was used only in\nAltering the Default Setting 173\n89 But it is a double-edged razor, since both Farmer (Synoptic Problem, 203) and Goodacre\n(Case Against Q, 18, 77) can use it to excise one of ‘the two documents’ (Q). It is a fallacy to\nassume that elegance of solution can be achieved simply by restricting the range of options\nwhich the character of the evidence invites.\n90 Streeter had already noted the danger of imposing an oversimplified solution on more com-\nplex data (Four Gospels, 229).\n91 Above, nn. 53 and 54.\nsmall, individual units.92 And the old suggestion of C. H. Dodd, that already in the\npre-written Gospel stage we can detect what we might call a narrative- or\nkerygma-sequencing of tradition,93 should be re-examined.94 For the connected-\nness of the passion narrative still attests some such concern; as does the fact that\nMark and Q both reflect a common intuition (practice?) of beginning their\nrehearsal of the Jesus tradition with John the Baptist;95 just as elsewhere it seems\nto be ‘taken-for-granted familiar’ that a period of Jesus’ mission in Capernaum\npreceded his return to Nazareth (Luke 4.23), and that the mission of the twelve\nwas a consequence of time spent with Jesus (made explicit in Mark 3.14), and so\non. Thus the sequencing of the centurion’s servant after the collection of Jesus’\nteaching (Sermon on Mount\/Plain), which provides a decisive argument for the\ninclusion of the centurion’s servant in Q (Matt. 7.28; 8.5–13\/Luke 7.1–10), may after\nall be better explained as a recurring feature of the various performances of the\nJesus tradition in more than one community.96\nA fuller study of the Jesus tradition as oral tradition would also need to exam-\nine more closely what balance between stability and variation, between fixity and\nflexibility, was actually maintained, what it means to speak of the same tradition\nbeing maintained through the diversity of oral performance, how Jesus was actu-\nally remembered in and by those earliest disciple groups. I have attempted to\npress further in this direction in my study of Jesus Remembered.97 In the present\npaper it has been a sufficient challenge to attempt to persuade you of the need to\nalter our inherited literary default setting which (in my judgement) has contorted\nthe way we envisage the early transmission of the Jesus tradition.\nPerhaps the point most to be emphasized in conclusion is that to recognize\nthe character of the Jesus tradition as oral tradition is to recognize its character\nalso as living tradition. The Jesus tradition was not at first a written text, to be read\nby individuals in the solitude of their studies, capable of fine literary analysis and\nredaction. It was not carried around like a sacred relic fixed in written form. It was\nliving tradition; that is, lived-in-and-through tradition. It was not so much kept as\nused, not so much preserved as performed, not so much read as heard. To treat it\nas a lifeless artefact, suitable for clinical dissection, is to lose it. Its variability, the\n174  . . \n92 Pace Funk and Hoover, The Five Gospels (n. 20 above) who would regard their observation as\nform-critical orthodoxy.\n93 C. H. Dodd, ‘The Framework of the Gospel Narrative’, New Testament Studies (Manchester:\nManchester University, 1953) 1–11.\n94 See further also Reicke, Roots; S. Hultgren, Narrative Elements in the Double Tradition: A\nStudy of Their Place within the Framework of the Gospel Narrative (BZNW 113; Berlin: de\nGruyter, 2002).\n95 See also N. T. Wright, The New Testament and the People of God (London: SPCK, 1992) 442;\nSchröter, Erinnerung, 439–51.\n96 This is in response to Goodacre, Case Against Q, 172 n. 6.\n97 See below, n. 61.\noral principle of ‘variation within the same’, is not a sign of degeneration or cor-\nruption. Rather, it puts us directly in touch with the tradition in its living charac-\nter, as it was heard in the earliest Christian groups and churches, and can still be\nheard and responded to today.\nIn short, to alter the default setting is to refuse to treat the Jesus tradition first\nand only as a written text, and to insist on the importance of hearing it, of hearing\nit as it was heard in the beginning, but of hearing it also as a tradition which still\nlives and still demands response from its hearers as it did from the beginning.\nAltering the Default Setting 175\n"}