{"doi":"10.1103\/PhysRevB.61.3546","coreId":"102898","oai":"oai:epubs.surrey.ac.uk:2489","identifiers":["oai:epubs.surrey.ac.uk:2489","10.1103\/PhysRevB.61.3546"],"title":"EPR Linewidth Variation, Spin Relaxation Times, and Exchange\\ud\nin Amorphous Hydrogenated Carbon","authors":["Barklie, R. C.","Collins, M","Silva, S R P"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2000-02","abstract":"Electron paramagnetic resonance ~EPR! measurements have been made of amorphous hydrogenated carbon ~a-C:H! films grown by plasma enhanced chemical vapor deposition ~PECVD! with negative self-bias voltages Vb in the approximate range 10–540 V. For Vb,100 V, as the film changes from polymerlike to diamondlike, the changes in linewidth and shape are interpreted in terms of changes to two contributions—one due to dipolar interactions between the unpaired spins and one due to unresolved lines arising from hyperfine interactions with H1. The former yields a Lorentzian line, the latter a Gaussian, and the resultant spectrum has the Voigt shape. The empirical relation DBpp\\ud\nG ~in Gauss!5~0.1860.05!3~at.%H) between the peak-to-peak Gaussian contribution ~in Gauss! DBpp G and the hydrogen content in atomic percentage is obtained. For Vb.100 V the\\ud\nlinewidth is shown to be dominated by the dipolar interactions and exchange and it decreases as Vb increases;\\ud\nthe change is shown to arise primarily from a change in the exchange interaction. Evidence for this comes from measurements which show that the spin-lattice relaxation time appreciably shortens and the spin-spin relaxation\\ud\ntime lengthens as the bias voltage is increased. The magnitude and variation with bias of the linewidth are\\ud\nconsistent with the EPR signal originating from the p-type radicals","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2489<\/identifier><datestamp>\n      2017-10-31T14:05:43Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2489\/<\/dc:relation><dc:title>\n        EPR Linewidth Variation, Spin Relaxation Times, and Exchange\\ud\nin Amorphous Hydrogenated Carbon<\/dc:title><dc:creator>\n        Barklie, R. C.<\/dc:creator><dc:creator>\n        Collins, M<\/dc:creator><dc:creator>\n        Silva, S R P<\/dc:creator><dc:description>\n        Electron paramagnetic resonance ~EPR! measurements have been made of amorphous hydrogenated carbon ~a-C:H! films grown by plasma enhanced chemical vapor deposition ~PECVD! with negative self-bias voltages Vb in the approximate range 10–540 V. For Vb,100 V, as the film changes from polymerlike to diamondlike, the changes in linewidth and shape are interpreted in terms of changes to two contributions—one due to dipolar interactions between the unpaired spins and one due to unresolved lines arising from hyperfine interactions with H1. The former yields a Lorentzian line, the latter a Gaussian, and the resultant spectrum has the Voigt shape. The empirical relation DBpp\\ud\nG ~in Gauss!5~0.1860.05!3~at.%H) between the peak-to-peak Gaussian contribution ~in Gauss! DBpp G and the hydrogen content in atomic percentage is obtained. For Vb.100 V the\\ud\nlinewidth is shown to be dominated by the dipolar interactions and exchange and it decreases as Vb increases;\\ud\nthe change is shown to arise primarily from a change in the exchange interaction. Evidence for this comes from measurements which show that the spin-lattice relaxation time appreciably shortens and the spin-spin relaxation\\ud\ntime lengthens as the bias voltage is increased. The magnitude and variation with bias of the linewidth are\\ud\nconsistent with the EPR signal originating from the p-type radicals.<\/dc:description><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:date>\n        2000-02<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2489\/1\/EPR_linewidth_SILVA_00.pdf<\/dc:identifier><dc:identifier>\n          Barklie, R. C., Collins, M and Silva, S R P  (2000) EPR Linewidth Variation, Spin Relaxation Times, and Exchange in Amorphous Hydrogenated Carbon   Physical Review B (PRB), 61 (5).  pp. 3546-3554.      <\/dc:identifier><dc:relation>\n        http:\/\/link.aps.org\/doi\/10.1103\/PhysRevB.61.3546<\/dc:relation><dc:relation>\n        10.1103\/PhysRevB.61.3546<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2489\/","http:\/\/link.aps.org\/doi\/10.1103\/PhysRevB.61.3546","10.1103\/PhysRevB.61.3546"],"year":2000,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"PHYSICAL REVIEW B 1 FEBRUARY 2000-IVOLUME 61, NUMBER 5EPR linewidth variation, spin relaxation times, and exchange\nin amorphous hydrogenated carbon\nR. C. Barklie and M. Collins\nDepartment of Physics, Trinity College, Dublin 2, Ireland\nS. R. P. Silva\nSchool of Electronic Engineering, Information Technology and Mathematics,\nUniversity of Surrey, Guilford, Surrey GU2 5XH, United Kingdom\n~Received 12 August 1999!\nElectron paramagnetic resonance ~EPR! measurements have been made of amorphous hydrogenated carbon\n~a-C:H! films grown by plasma enhanced chemical vapor deposition ~PECVD! with negative self-bias voltages\nVb in the approximate range 10–540 V. For Vb,100 V, as the film changes from polymerlike to diamondlike,\nthe changes in linewidth and shape are interpreted in terms of changes to two contributions—one due to dipolar\ninteractions between the unpaired spins and one due to unresolved lines arising from hyperfine interactions\nwith H1. The former yields a Lorentzian line, the latter a Gaussian, and the resultant spectrum has the Voigt\nshape. The empirical relation DBpp\nG ~in Gauss!5~0.1860.05!3~at. % H) between the peak-to-peak Gaussian\ncontribution ~in Gauss! DBpp\nG and the hydrogen content in atomic percentage is obtained. For Vb.100 V the\nlinewidth is shown to be dominated by the dipolar interactions and exchange and it decreases as Vb increases;\nthe change is shown to arise primarily from a change in the exchange interaction. Evidence for this comes from\nmeasurements which show that the spin-lattice relaxation time appreciably shortens and the spin-spin relax-\nation time lengthens as the bias voltage is increased. The magnitude and variation with bias of the linewidth are\nconsistent with the EPR signal originating from the p-type radicals.I. INTRODUCTION\nHydrogenated amorphous carbon, a-C:H, is a fascinating\nmaterial because the possibility of varying the bonding con-\nfigurations of the carbon atoms and also the hydrogen con-\ntent allows it to be prepared with a wide range of\ncharacteristics.1,2 One method of preparing a-C:H is plasma-\nenhanced chemical vapor deposition. The film properties are\nstrongly affected by the incident ion energy which in turn is\ndetermined by the gas pressure and the negative self-bias\nvoltage Vb which develops between the live electrode and\nthe glow space.3 At low bias voltages the films are ‘‘poly-\nmerlike’’ ~PLC!, soft, with wide optical gaps, a high photo-\nluminescence efficiency and a high ~’50%! hydrogen\ncontent.4 As the self-bias is increased the film initially be-\ncomes ‘‘diamondlike’’ ~DLC!, harder, with a smaller gap\nand a lower hydrogen content; with further increases in the\nbias the sp2 content increases4 until eventually they become\ngraphitelike ~GLC!. a-C:H with a particularly high ~’80%!\nproportion of tetrahedrally bonded sp3 carbon sites is often\nreferred to as ta-C:H.\nAll the above forms of a-C:H contain defects which are\nbelieved to affect the photoluminescence efficiency5 and the\nability to dope the material. It is, therefore, of interest to\nknow about these defects. One technique which has often\nbeen used to characterize those defects which are paramag-\nnetic is electron paramagnetic resonance ~EPR!. In most\ncases a single resonance is reported which has a g value of\nabout 2.0028.6–8 However, it is still uncertain what these\ndefects are and they could, for example, be either sp2 clus-\nters with an odd number of sites or single dangling bonds.PRB 610163-1829\/2000\/61~5!\/3546~9!\/$15.00Changing the incident ion energy has little effect on the g\nvalue but it does alter the linewidth.8–13 Several authors8–10\nhave reported that when the ion energy is increased from\nvery low values there is an initial increase in the linewidth.\nOne explanation proposed for this is that the spins are less\nable to tunnel to neighboring graphitic clusters as the energy\nis initially increased.8 At higher ion energies the linewidth\ndecreases as the ion energy is further increased.8–13 In this\nlatter region the line is usually reported8–10,12,13 as having a\nLorentzian shape although it has also been assumed to be\nGaussian.11 In the latter case the change in width was attrib-\nuted to a change in unresolved hydrogen hyperfine lines\nbrought about by a change in the local H\/C ratio11 and it has\nbeen shown14 that changing the hydrogen content can affect\nthe linewidth. On the other hand many authors8,12,13 have\nproposed that, on the basis that other mechanisms are inap-\npropriate and that the line shape is Lorentzian, the narrowing\nis produced by exchange.\nThis work has two main aims—first, to find more evi-\ndence for the exchange narrowing process and second, to\nprovide a comprehensive interpretation of the variation in\nlinewidth as the a-C:H is changed from polymerlike to dia-\nmondlike to graphitelike material. To try to achieve these\naims we have made EPR measurements on a set of samples\nprepared by the plasma enhanced chemical vapor deposition\n~PECVD! method with a wide range of bias voltages from\nabout 10 up to 540 V. To look for evidence of the exchange\ninteraction between the unpaired spins we have measured the\nspin-lattice, T1 , and spin-spin, T2 , relaxation times because\nit is known, for example, from the case of solid solutions of\na-a-diphenyl b-picryl hydrazyl ~DPPH! in polystyrene,15\nthat increasing the strength of the exchange interaction has3546 ©2000 The American Physical Society\nPRB 61 3547EPR LINEWIDTH VARIATION, SPIN RELAXATION . . .the effect of shortening T1 and lengthening T2 . There have\nbeen a few measurements16 of T1 and T2 for different types\nof a-C:H but this paper presents a systematic study of the\neffect on T1 and T2 of changing the bias voltage.\nIn Sec. II we briefly outline the sample preparation and\nEPR measurement procedures. Measurements of the line-\nwidth, shape, g value, and spin concentration are presented\nin Sec. III A. In Sec. III B we consider the analysis of the\nlinewidth for samples grown with Vb.100 V, present the\nmeasurements of T1 and T2 , and consider the evidence for\nexchange. The dependence of linewidth and shape on Vb for\nVb,100 V is analyzed in Sec. III C; in this region the trans-\nformation from PLC to DLC occurs.\nII. EXPERIMENTAL DETAILS\nThe a-C:H samples were deposited using a 13.56 MHz rf\npowered, capacitively coupled, PECVD system. All but one\nof the samples were deposited on silicon substrates placed on\nthe rf driven electrode with feed gases of CH4 ~10%! and Ar\n~90%! at a constant pressure of 300 mTorr and with the rf\npower varied such that the dc self-bias voltage Vb took val-\nues between 250 and 2540 V ~from now on the minus sign\nwill be omitted!. The driven electrode was kept at room tem-\nperature by a closed-loop cooling system but the surface of\nthe samples during deposition was at a slightly higher tem-\nperature. The atomic hydrogen content measured using elas-\ntic recoil detection analysis ~ERDA! is 25 at. % at Vb\n550 V, 13 at. % at 100 V and thereafter probably decreases\nonly slightly as Vb is raised to 540 V. The percentage sp2\ncontent was estimated to be 63, 54, 66, 78, 72, 80, 76, 90,\nand close to 100 ~610%! for Vb values of 50, 100, 150, 180,\n265, 320, 380, 460, and 540 V, respectively. The sp2 content\nwas obtained by the method proposed by Berger et al.17 us-\ning a CM30 Philips microscope equipped with a dedicated\nGatan model 666 electron energy-loss spectrometer and op-\nerated at 100 keV. Strictly speaking, the value obtained is for\nthe p content and, therefore, it gives the sp2 percentage only\nif there is little or no sp1 bonding within the a-C:H matrix.\nThis trend towards higher sp2 content ~p hybridized bond-\ning! at higher ion energies is typical for such films.4,11 One\nsample was deposited on a silicon substrate placed on the\nearthed electrode at room temperature. The feed gases were\nCH4 ~30 sccm! and He ~75 sccm! ~sccm denotes cubic cen-\ntimeter per minute at STP!, the total pressure 200 mtorr and\nthe rf power 200 W. For this arrangement the accelerating\nself-bias voltage is only about 10 V. The hydrogen content\nwas measured using ERDA to be about 50 at. %, the sp2\ncontent 60610%, and the Tauc and E04 gaps are 2.6 and 3.4\neV, respectively.18 This film was removed from the substrate\nbefore the EPR measurements were made.\nEPR measurements were made at room temperature using\n100 kHz field modulation, a microwave frequency of about\n9.9 GHz, and a TM011 mode cavity. To avoid distortion of\nthe spectrum the modulation amplitude was kept less than or\nequal to one third of the peak-to-peak linewidth. Each g\nvalue was calculated by comparing the field position of the\nresonance with that of a resonance with known g value—for\nexample that of F1 centers in MgO with g52.0023. The\nfield range was calibrated with a proton NMR probe which\nalso gave absolute field values. Spin populations were foundby comparing the integrated area of the signal with that of a\nstandard Varian sample of pitch in KCl; the absolute spin\npopulations ~and average spin densities! are estimated to be\ncorrect to within a factor of 2, but their relative values are\ncorrect to within approximately 620%.\nIII. RESULTS, ANALYSIS, AND DISCUSSION\nA. Line shape, width, and spin concentration—the results\nFigure 1 shows that one effect of increasing the negative\nself-bias voltage Vb from 50 to 540 V is to narrow the EPR\nline. However, when Vb is reduced from 50 to about 10 V\n~substrate on earthed electrode! the peak-to-peak linewidth,\nDBpp , is decreased to 11.360.8 G. Figure 1 also shows that\nanother effect of increasing Vb is to change the line shape\nfrom one which is intermediate between a Gaussian and\nLorentzian to a Lorentzian. One parameter which is indica-\ntive of the line shape is the ratio of the full width at half\nheight, DB1\/2 , of the integrated spectrum to DBpp ;\nDB1\/2 \/DBpp is 1.1776 for a Gaussian and 1.7321 for a\nLorentzian.19 The values for the spectra are 1.4260.15,\n1.4860.09, 1.5760.12, 1.6360.11, 1.6960.11, 1.72\n60.16, and 1.8060.19 of samples deposited at Vb510, 50,\n100, 190, 265, 500, and 540 V respectively. These values\nand the fits in Fig. 1 show that at Vb5100 V the line shape is\nclose to Lorentzian and that at Vb>190 V they are all\nLorentzian within experimental error. Figure 1 shows that at\nVb550 V the spectrum can be well fitted by a Voigt line20\nwhich is a convolution of a Gaussian and a Lorentzian and is\nappropriate when these two contributions are independent.\nFrom the fit we obtain DBpp\nL 511.160.5 G and\nDBpp\nG 58.270.5 G for the above two components, respec-\ntively. The total linewidth of this fit is 15.5 G, which is the\nsame as the experimentally determined width and, since the\ncomponents are not both Lorentzian, is different from their\nsum. The spectrum at Vb5100 V, which is nearly but not\nFIG. 1. EPR spectra showing the effect of changing the negative\nself-bias voltage from 50 to 540 V. The smooth lines are computed\nfits. Only Lorentzian line fits are shown for Vb5100, 190, and 540\nV. For Vb550 V, Lorentzian ~L! and Gaussian ~G! fits are shown\nbut the best fit has a Voigt ~V! line shape with parameters given in\nthe text. Peak-to-peak heights have been normalized.\n3548 PRB 61R. C. BARKLIE, M. COLLINS, AND S. R. P. SILVAquite a Lorentzian, can be better fitted to a Voigt shape with\nDBpp\nL 511.760.5 G and DBppG 55.170.5 G. We have also\ntried fitting the spectra for Vb550 and 100 V to superposi-\ntions of a single Gaussian and single Lorentzian line with the\nsame g value. These fits are as good as those with the Voigt\nshape; the parameters of the fits for the Vb550 and 100 V\nspectra, respectively, are DBpp\nL 515.3 G, DBppG 53 G,\nhpp\nL \/hpp\nG 51.3 and DBpp\nL 513.2 G, DBpp\nG 515.8 G, hppL \/hppG\n52.9, where hpp is the peak-to-peak height of the spectrum.\nAlthough the nature of the fit is uncertain there is no doubt\nthat as Vb is reduced from 100 to 50 V the line shape be-\ncomes less Lorentzian and more Gaussian in character. Be-\ncause of the poor signal\/noise ratio of the weak spectrum for\nVb510 V we have not attempted to fit the spectrum but, as\nthe ratio DB1\/2 \/DBpp51.4260.15 makes clear, it too is in-\ntermediate between a Gaussian and Lorentzian shape.\nNo dependence on bias voltage was observed in the g\nvalue, which remains within 60.0002 of 2.0025 as Vb is\nincreased from 10 to 540 V, but Fig. 2 shows that the spin\nconcentration Ns , as well as the linewidth, does depend on\nVb . Several other authors8–11,21 have reported the large in-\ncrease in Ns from ’1017 cm23 up to ’1020 cm23 as the bias\nis increased from close to zero up to ’100 V. The increase\nhas been attributed to an increase in disorder,1 a loss of\nhydrogen,1,11 an increase in strain,8 and an increase in the\ncorrelation energy U.9 Above Vb’100 V the spin concentra-\ntion is less sensitive to changes in Vb as noted, too, by\nothers,8,9 although in the case of ta-C:H a drop from\n231020 cm23 to 731019 cm23 was found13 as the energy per\nC atom increased from 100 to 270 eV and Arcon et al.22\nfound 2.531019 g21 in a-C:H deposited at Vb5400 V. The\nreason for the scatter in Ns values in our samples for Vb\n>300 V is not clear.\nAlong with the change in behavior of Ns versus Vb there\nis a change in the bias dependence of the linewidth. Several\nother authors8–10 also report that DBpp initially increases in\na-C:H as the bias increases from zero and many report that in\na-C:H ~Refs. 8–11! as well as ta-C:H ~Ref. 13! and ta-C\n~Ref. 12! DBpp then decreases as the bias continues to in-\nFIG. 2. The dependence on bias voltage of the peak-to-peak\nlinewidth and spin concentration.crease. For a-C:H the value of Vb at which the maximum\nDBpp occurs depends slightly on the deposition system and\nconditions: Ristein et al.9 find the maximum at Vb590 V\nand, using a magnetically confined plasma, Silva et al.10 find\nit at Vb534 V. It is well known that many of the other char-\nacteristics of a-C:H change as the bias is increased. As has\nbeen pointed out4 three regions can be identified—a low bias\nregion with a high sp3 and hydrogen content giving soft\n‘‘polymeric’’ films, a medium bias region with a lower hy-\ndrogen content but still quite a high sp3 content giving\nharder ‘‘diamondlike’’ films, and a high bias region which\ngives more graphitelike films with a high sp2 content. The\ntransition from PLC to DLC is estimated to be essentially\ncomplete at Vb’100 V.9,23 It is clear, therefore, that the\nrapid increase in Ns and increase in DBpp as Vb increases\nmark the change from PLC to DLC, and that the next stage\nof little change in Ns and a decrease in DBpp corresponds to\nthe transition from DLC to GLC. It is convenient, therefore,\nto consider what determines the linewidth and its depen-\ndence on bias in two stages—first for Vb>100 V ~DLC to\nGLC! and second for Vb,100 V ~PLC to DLC!.\nB. Analysis of linewidth variation for Vb—100 V:\nRelaxation times and exchange\nSeveral authors6,8,12,13 have attributed the narrowing of\nthe line, as bias voltage increases in the above range, to the\nexchange interaction between the spins. This attribution has\nbeen arrived at largely by excluding, at least as dominant\ncontributions, other factors which might contribute to the\nlinewidth. The width cannot be determined by a spread in g\nvalues because DBpp was found to be independent of the\nfield at which the resonance was recorded, i.e., of microwave\nfrequency,14 and also the line shape would not then be\nLorentzian. Nor can the decrease in linewidth be determined\nsolely by a change in the dipolar interaction between the\nspins since, as Fig. 2 shows, the decrease is not always ac-\ncompanied by a decrease in spin concentration and is some-\ntimes accompanied by an increase in Ns .10,11 Nor, in this\nbias region, can the linewidth be determined by unresolved\nhydrogen hyperfine interactions since, first, these lead to a\nline shape which is close to Gaussian24 rather than Lorentz-\nian; second, as noted elsewhere,12 the linewidth of the reso-\nnance in ta-C varies with sp2 fraction in a way very similar\nto that observed for ta-C:H; and third, the hydrogen content\ndoes not greatly decrease as the bias is increased. For ex-\nample, Kleber et al.11 found that for a-C:H, increasing the\nion energy from 30 to 170 eV @corresponding approximately\nto a bias increase of 75 to 425 V ~Ref. 4!# caused DBpp to\ndecrease from 18 to 3 G although the hydrogen content only\ndropped from 45 to 32 at. %, and in ta-C:H ~Ref. 13! a drop\nin DBpp from 3.8 to 1.8 G was only accompanied by a re-\nduction of hydrogen content from 27 to 22 at. %. This leaves\nexchange narrowing as a possible mechanism which is plau-\nsible for the following reasons. Whether the film is a-C:H,\nta-C:H, or ta-C, the decrease in DBpp , in this higher bias\nregion, is always accompanied by a decrease in the optical\ngap and an increase in the sp2 fraction;8–13 a correlation of\nlinewidth and gap has already been noted.25 Regarding the\ngap, Robertson and O’Reilly2 showed that the most stable\narrangement of sp2 sites is in compact clusters of fused six-\nPRB 61 3549EPR LINEWIDTH VARIATION, SPIN RELAXATION . . .fold rings and that the gap varies inversely as the cluster size.\nThis model was later modified26 to account for the reduction\nin clustering produced by disorder and the presence of ole-\nfinic chains as well as aromatic rings. Olefinic chains could\nalso of course delocalize the p electrons and therefore act as\na pseudocluster. Nevertheless increasing the sp2 content is\nstill expected to increase the cluster size and decrease the\ngap. As noted earlier, many authors6,8,12,13,25 have put for-\nward the hypothesis that the Lorentzian line shape arises\nfrom exchange narrowing and that the reduction in the line-\nwidth as the sp2 content increases is associated with the\ngreater delocalization of the unpaired electrons as the cluster\nsize increases. It should be noted, however, that it is the\nincreased overlap of the wave functions brought about by the\ngreater delocalization rather than the greater delocalization\nitself which increases the strength of the exchange interac-\ntion. Because the spin-lattice, T1 , and spin-spin, T2 , relax-\nation times are sensitive to the existence of fluctuating fields\nproduced by the motion of the spins which arises, in effect,\nfrom exchange or other causes, we have sought to test this\nhypothesis by measuring them as a function of bias voltage.\nHomogeneously broadened lines have a Lorentzian shape\nand for them it is appropriate to use the Bloch equations\nwhich yield for DBpp and the peak-to-peak height hpp of the\nsignal the expressions27\nDBpp5@DBpp\n0 #S21\/25@2\/~31\/2gT2!#S21\/2 ~1!\nand\nhpp \/B15@ lim\nB1→0\n~hpp \/B1!#S3\/2, ~2!\nwhere the saturation parameter S5(11g2B12T1T2)21 and\nB1 is the amplitude of the rotating component of the micro-\nwave field at the sample; g is the gyromagnetic ratio.\nWe determined T2 from DBpp\n0\n, the linewidth in the limit\nS51, and T1T2 from a fit of Eq. ~2! to the plot of hpp versus\nB1 . The relevant value of B1 is that at the sample. Since the\nintroduction of the sample, in particular the Si substrate, can\nalter the cavity Q and hence also B1 , it is necessary to cali-\nbrate B1 versus the incident microwave power with the\nsample in place; this we did for each sample by also intro-\nducing a small piece of DPPH for which T1 and T2 are\nknown.15\nThe values found for T1 and T2 are shown in Fig. 3. For\ncompleteness we have included values of T1 , T2 for Vb\n510 and 50 V. The spectra of these two samples are not\nLorentzian and the Bloch equations do not apply but, never-\ntheless, following Abragam and Bleaney28 we loosely define\na time T2 by Eq. ~1!, and T1T2 is estimated as described\nabove; although the actual values are uncertain it is clear that\nT1 for the polymerlike sample (Vb510 V) is much longer\nthan for the other samples. Since the spectrum for Vb\n5100 V is much closer to a Lorentzian, there is less uncer-\ntainty about the T1T2 value for this sample.\nFigure 3 shows that as the bias is increased, T1 decreases\nand T2 increases. A similar trend is observed for the T1 ,T2\nvalues of DPPH in polystyrene as the exchange interaction is\nincreased by increasing the DPPH spin concentration.15 It is\ninteresting to compare pairs of values of T1 ,T2 for a-C:H\nwith those of DPPH measured at 300 K. Three of these pairsfor DPPH are shown in Fig. 3; the pairs correspond to DPPH\nspin concentrations of 131020 cm23, 331020 cm23, and 5\n31020 cm23. They have been plotted such that the T2 value\nfor DPPH most closely matches its value for a-C:H. Given\nthe uncertainties in T1 it is remarkable how well the pairs\nmatch up. Furthermore the values for the earthed electrode\nsample are similar to the DPPH values of T151.331025 s,\nT250.531028 s at the spin concentration of 1018 cm23 be-\nlow which both T1 and T2 become approximately indepen-\ndent of the spin concentration in DPPH. Our values for\n(T1 , T2) at 300 K agree reasonably well with the pairs of\nvalues (,1027s, 1.831028 s), (231027s, 2.531028 s),\nand (231024s, 0.431028 s) for what was labeled ta-C, dia-\nmondlike and polymerlike carbon, respectively;16 we have\nevaluated T2 from the values of DBpp at 300 K. There is not,\nhowever, a single pair of values of (T1 , T2) for a given type\nof a-C:H as both the sp2 content and energy gap can vary\nwithin any type. It is interesting to note that the T1 values of\ncarbon radicals in dextrose were found to decrease as the\npyrolytic temperature was raised from 250 to 450 °C.29 We\nsuggest that this occurs for the same reason that T1 decreases\nwith increasing Vb for a-C:H, namely, that there is an in-\ncrease in the sp2 content leading to greater spin delocaliza-\ntion and a stronger exchange interaction.\nTo further analyze our results we make use of the density-\nmatrix method of Redfield which is described by Slichter.30\nIt is supposed that the spins experience a fluctuating field\nwith components Bx , By , and Bz , in addition to the static\nfield B0(\/\/z). Such fluctuations may arise from variations in\nthe dipolar or hyperfine field produced by the motion of the\nspins arising, in effect, from exchange or, for example, from\nhopping. Bz will affect T2 but not T1 . However, contribu-\ntions to Bx and By at the Larmor frequency v0 will affect T1\nand T2 . Assuming a simple exponential correlation function\ngives30\nFIG. 3. The dependence on bias voltage of the spin-lattice, T1 ,\n~h! and spin-spin, T2(s) relaxation times of a-C:H. Also plotted\nare three pairs of T1 T2(j ,d) values for DPPH in polystyrene,15\nwhich in order of decreasing T1 correspond to spin concentrations\nof 131020, 331020, and 531020 cm23; they have been plotted\nsuch that the T2 values match up with those of a-C:H.\n3550 PRB 61R. C. BARKLIE, M. COLLINS, AND S. R. P. SILVA1\nT1\n5g2~Bx\n21By\n2!\ntc\n11v0\n2tc\n2 ,\n1\nT2\n5g2Bz\n2tc1\n1\n2T1\n, ~3!\nwhere tc is the correlation time of the fluctuation; the bar\nindicates the average value. Assuming further that Bx\n25By\n2\n5Bz\n25B2 then\n1\nT1\n5\n2g2B2tc\n11v0\n2tc\n2 , and\n1\nT2\n5g2B2tc1\ng2B2tc\n11v0\n2tc\n2 . ~4!\nEquation ~4! implies that as tc is decreased T1 will de-\ncrease, will reach a minimum value of v0 \/vp\n2 at tc\n21[vc\n5v0 and then increase again and that T2 will continuously\nincrease and become equal to T1 for v0tc!1; we define\nvp\n25g2B2. In the region vp,vc,v0 Eq. ~4! gives\n1\nT1\n’\n2vcvp\n2\nv0\n2 and\n1\nT2\n’\nvp\n2\nv0\n, ~5!\nso that\nvc’v0~T2\/2T1!1\/2. ~6!\nSince, for a Lorentzian line, the half-width at half height\n1\n2 DB1\/251\/gT2 , then Eq. ~5! implies that\n1\n2 gDB1\/25vp\n2\/vc . ~7!\nThis is the expression given by Anderson and Weiss31 for an\nexchange narrowed line where vc represents the exchange\nfrequency ve .\nIn the slow motion limit when tc>T2 the model breaks\ndown and the linewidth is given by the static field distribu-\ntion over the spin sites together with any contribution from\nthe spread in g values. In the case of dipolar broadening in\nmagnetically diluted substances, which is appropriate in\na-C:H with typically less than one unpaired spin per 100 C\natoms, the statistical theory32 predicts that the line shape is\nLorentzian with\n1\n2 DB1\/25\n2p2\n3)\ngmBNs , ~8!\nwhere Ns is the spin concentration in cm23 and the field units\nare Gauss. Taking g52.0025 and taking DBpp5DB1\/2 \/)\nfor a Lorentzian gives\nDBPP58.12310220Ns . ~9!\nWe now consider how the observed linewidths can be\nunderstood in terms of the above ideas. We will first consider\nthe situation for Vb>100 V. At Vb5100 V the line shape is\nclose to Lorentzian and the measured values are DBpp\n512.260.6 G and Ns51.531020 cm23. Equation ~9! pre-\ndicts that under these conditions the dipolar interaction alone\nwould yield a Lorentzian line with DBpp512.2 G. The\nagreement is fortuitously good but clearly no other factor is\nrequired to explain the width and shape. This is analogous to\nthe situation in DPPH for Ns<131020 cm23 when DBpp is\nno longer influenced by exchange. At Vb5190 V the shape is\nLorentzian within error, Ns is unchanged but DBpp has\ndropped to 6.2 G. The T1 ,T2 values have changed to onesclose to those for a DPPH spin concentration of\n331020 cm23. The changes for DPPH are attributed to an\nincrease in ve as the greater proximity of the spins at the\nhigher concentration leads to increased wave function\noverlap.15 For a-C:H we also attribute the changes to an\nincrease in exchange interaction but in this case due to the\nincreased delocalization of the spin wave functions associ-\nated with the large increase in the sp2 content from 54% to\nnearly 80%. It is tempting to use Eq. ~6! and the ratio of\nT2 \/T1 to evaluate vc and hence also (B2)1\/2; for Vb\n5190 V we get vc573109 rad s21 and (B2)1\/2546 G\n~which satisfies vp,vc,v0). However, these values\nshould be treated with caution. When we apply the same\nprocedure to DPPH with Ns5331020 cm23 we get ve\n57.83109 rad s21 and (B2)1\/2550 G. As has been pointed\nout31 the half-width at half height, 12 DB1\/2 , should be\nabout equal to (B2)1\/2 in the absence of exchange. Equation\n~8! implies that at Ns53320 cm23 12 DB1\/2\n521 G so that the agreement is not very good.\nAs Vb is increased further the width continues to decrease\nuntil at 540 V the width is close to that for DPPH at\nNs5531020 cm23. Here we get for DPPH ve\n52.731010 rad s21 and (B2)1\/2550 G; the latter does agree\nbetter with the value of 12 DB1\/2535 G evaluated from Eq.\n~8!. At Vb5540 V the values are vc51.231010 rad s21 and\n(B2)1\/2542 G. The latter value so exceeds the 12 DB1\/2\n52.5 G expected for N53.531019 cm23 that it suggests that,\nat least for Vb>400 V, the spins have clustered. A local\nconcentration of about 631020 cm23 is required to give\n(B2)1\/2542 G. Assuming that for a-C:H vc also represents\nve and that ve’J\/q, where J is the exchange constant, then\nthe value of ve51.231010 rad s21 gives J\/k’0.1 K. Inter-\nestingly, evidence of clustering of spins in samples prepared\nunder similar conditions has already been reported.22\nWe have seen that the changes in (T1 , T2) for Vb\n>100 V can be accounted for by motional effects and we\nhave assumed that, as in DPPH, these arise from exchange. It\nis known, however, that below about 300 K conduction in\nion-beam sputtered a-C arises from variable range\nhopping33–35 and probably in ta-C:H also,35 so what justifi-\ncation is there for assuming that the ‘‘motion’’ is effectively\nproduced by exchange rather than by hopping? Typically the\nconductivity falls by more than three orders of\nmagnitude,33–35 reflecting the change in probability of an\nenergy-upward hop, as the temperature drops from 300 to 40\nK. If linewidth narrowing is associated with hopping, a sig-\nnificant dependence of linewidth on temperature would be\nexpected, but over the above temperature range the linewidth\nhas been found to change by <20% in ta-C, diamondlike,\ngraphitelike, and polymerlike carbon.16 On the other hand,\nthis is consistent with exchange narrowing since ve should\ndepend primarily on wave function overlap and hence be\nrelatively insensitive to changes in temperature.\nIn summary, we explain the magnitude of the linewidth\nand its dependence on bias voltage in the range Vb>100 V in\nterms of a combination of dipolar broadening and exchange\nnarrowing. At Vb’100 V the exchange is too slow to affect\nthe linewidth which primarily is determined by dipolar inter-\nactions between the spins; the exchange may however be\nstrong enough to shorten T1 , as is the case for DPPH.15 As\nPRB 61 3551EPR LINEWIDTH VARIATION, SPIN RELAXATION . . .TABLE I. EPR parameters, bias voltage, hydrogen content, and optical gap of a-C:H films deposited at\nlow ion energies. DBpp\nT is the measured peak-to-peak linewidth, DBpp\nL is calculated using the Ns value and Eq.\n~9!, and DBppG is calculated using the above values of DBppT , DBppL , and Eq. ~12!.\nPeak to Peak widths ~G!\nMax\/Min DBpp\nT DBpp\nL DBpp\nG Ns~cm23! Vb~V! H~at %! Gap~eV! Ref.\nMax? 20.3(C)a 16.2 9.1 231020 2.0(E03) 8\nMax 17.2(A)a 5.7 14.0 731019 1.88(E03)\nMin 8.7(A)a 0.3 8.5 431018 2.22(E03)\nMax 14.6 10.5 7.7 1.331020 90 2.45(E04) 9\nMin 8.2 0.06 8.2 7.331017 0 4.00(E04)\nMax 1261 16.2 0 231020 34 24 3.05(E04) 10\nMin 3.261 0.5 3.0 631018 12 24 3.55(E04)\nMax? 18 1.3 17 1.631019 75b 45 1.9(ETauc) 11\nMin? 8 0.01 8.0 1.531017 45–50 3.3(E04) 38\nMax 15.460.6 4.0 13.2 4.931019 50 25 Current\nMin 11.360.8 0.02 11.3 331017 10 50 3.4(E04) Work\naThe films are grown on the cathode ~C! or the anode ~A!.\nbThe Vb value is taken to be 75 V on the assumption ~Ref. 4!, that the ion energy of 30 eV is 40% of Vb .Vb is raised above 100 V the increase in sp2 content leads to\nan increasing delocalization of the spin wave function, and\nhence to an exchange interaction sufficiently large to pro-\nduce an increasingly strong exchange narrowing. In this re-\ngion the linewidth is correlated to the optical gap. We now\nconsider the factors which determine the linewidth and its\ndependence on Vb for Vb,100 V.\nC. Analysis of linewidth variation for Vb¸100 V:\nDipolar and hyperfine interactions\nWhen Vb is decreased below about 100 V the linewidth\nreaches a maximum and then decreases and the spin concen-\ntration falls rapidly; this is shown in Fig. 2 and has been\nobserved by others.8,10 In addition we find that, as noted in\nSec. III A, the line shape deviates from Lorentzian and be-\ncomes a mixture of Lorentzian and Gaussian. Table I sum-\nmarizes the values of DBpp , Ns , and other parameters at\nboth the maximum DBpp and lowest DBpp ~at the lowest ion\nenergy used!. The lowest ion energy used by Kleber et al.11\nwas 30 eV @which corresponds to about 40% of Vb ~Ref. 4!#\nat which DBpp was probably close to its maximum value but\nhad not begun to decrease. Similarly, for the cathode-type\nfilms of Schu¨tte et al.,8 the value of DBpp520.3 G is the\nlargest observed but these films were not deposited at lower\nion energies; on the other hand a turning point in DBpp was\nfound for their anodelike films.\nTable I shows the values of the dipolar contribution to the\nlinewidth expected on the basis of the measured Ns values\nand Eq. ~9!. It will be recalled that this fully accounted for\nthe linewidth at Vb5100 V but the values in the table indi-\ncate that the minimum values DBpp , at the lowest ion ener-\ngies, greatly exceed the expected dipolar contributions. The\nquestion, therefore, is not why does the linewidth decrease,\nbut why does it not decrease much more? We suggest that\nthe answer is that the unresolved hydrogen hyperfine inter-\nactions make an increasingly large contribution as the ion\nenergy is reduced. a-C:H deposited by the usual PECVD\nprocess has a hydrogen content which increases as the bias\nvoltage is decreased11,36 and the increase is most rapid forVb,100 V.36 For our samples it is estimated to increase\nfrom 13 at. % at 100 V to about 50%, typical of polymerlike\na-C:H, at about 10 V. Unresolved hyperfine lines are ex-\npected to give rise to a Gaussian line shape with an overall\nfull width at half height given by24\n~DB1\/2!25~8 ln 2\/g2mB2!(\ni ,i\nN ij iAi ,i\n2 @I i ,i~I i ,i11 !#\/3,\n~10!\nwhere N i is the number of nuclei in the ith shell, j i is the\nrelative abundance of the ith isotope, and Ai ,i is the hyper-\nfine interaction with the nuclei i in the ith shell. For the case\nof H1, using DB1\/25(2 ln 2)1\/2DBpp for a Gaussian, this be-\ncomes\n~DBPP!25(\ni\nN iA i\n2\n, ~11!\nwhere A i is here expressed in units of magnetic field. We\ntherefore propose that the overall line shape and width for\nVb,100 V are determined by a combination of dipolar inter-\naction and unresolved H1 hyperfine lines and, since these\ncontributions should be independent, then the overall spec-\ntrum should have a Voigt profile with a total peak-to-peak\nwidth, DBpp\nT given by37\nDBPP\nT 5\nDBPP\nG 10.9085DBPPG DBPPL 10.4621~DBPPL !2\nDBPP\nG 10.4621DBPP\nL ,\n~12!\nwhere DBpp\nG\n, DBpp\nL are the peak-to-peak widths of the\nGaussian and Lorentzian contributions which here are given\nby Eqs. ~11! and ~9!, respectively. Using Eq. ~12! and each\nvalue of DBpp\nL\n, given in Table I, we can calculate the value\nrequired for DBpp\nG so that DBpp\nT is equal to that of the re-\ncorded spectrum; these DBpp\nG values are also listed in Table I.\nWe now need to consider the evidence for and against this\nproposed explanation of the linewidth and shape.\n3552 PRB 61R. C. BARKLIE, M. COLLINS, AND S. R. P. SILVAFirstly, the model implies that as Vb falls below about 100\nV, such that Ns falls and H at. % rises more rapidly, the line\nshape should change from Lorentzian to a Voigt profile. The\nchange in shape we observe is consistent with this proposal\nand Sadki et al.38 also find that the line shape of a polymer-\nlike sample, with 45–50 at. % H, E0453.3 eV, Ns51.5\n31017 cm23, and DBpp58 G, has both a Lorentzian and\nGaussian component; by contrast their diamondlike sample\nwith 25 at. % H, E0451.3 eV, Ns54.531020 cm23, DBpp\n54 G has a Lorentzian shape ~and, we suggest, is exchange\nnarrowed!. Unfortunately, as noted previously, we cannot\ndetermine from the goodness of fit whether the line shape at\nVb550 V is a Voigt profile or a superposition of one Lorent-\nzian and one Gaussian line. Ristein et al.9 state, however,\nthat for Vb>50 V the shape is Lorentzian but did not deter-\nmine the shape at Vb,50 V. Silva et al.10 and Schu¨tte et al.8\nclaim that the line shape for their samples at all bias values is\nLorentzian. Therefore, although there is general agreement\nthat the line shape is Lorentzian at the higher bias values the\nevidence is contradictory for the lower bias values and there\nis a need for further careful measurements.\nSecond, the model implies that for Ns,1019 cm23 the di-\npolar contribution to DBpp drops below 1 G and therefore the\nlinewidth is dominated by the unresolved H1 hyperfine lines.\nConsidering, first, the minimum DBpp values ~Table I! we\nsee that, with one exception, the estimated DBpp\nG values lie in\nthe approximate range 8–11 G. The exception is the value\nDBpp\nG 53 G obtained by Silva et al.;10 this is interesting be-\ncause the H at. % is exceptionally low in this case—only\n24%—and Eq. ~11! implies that DBpp\nG would also be ex-\npected to be low. We now consider whether DBpp\nG\n58 – 11 G is plausible for a C:H ratio of about 1:1. One\ncomparison to make is with the EPR spectrum of cis-rich\npolyacetylene (CH)n which is a single line, near g52, which\nis nearly Gaussian with DBpp58.5 G at 295 K and 11 G at\n82 K.39 Unlike the trans-(CH)n which has a Lorentzian, mo-\ntionally narrowed line, the cis spectrum is well fitted to an\nimmobile, delocalized soliton which is computed to have a\nspectrum of Gaussian shape with DBpp512 G due to the\nunresolved H1 hyperfine lines.39 Another comparison to\nmake is with the DBpp values computed using Eq. ~11! and\nthe isotropic hydrogen hyperfine splittings for the benzene,\nnaphthalene, and anthracene anions40 which we calculate are\n9.2, 10.5, and 10.1 G, respectively. Of course this ignores\ncontributions from the anisotropic terms but inclusion of\nthese, even if known, would probably not much alter the\nvalues. The above values are reasonable being all about half\nthe ‘‘extent,’’ that is the spacing of the outermost lines, of\nthe above spectra which is 22.5, 27.3, and 27.6 G,\nrespectively.40 It is worth noting that in these cases the\nchange in the degree of localization has little effect on the\n‘‘extent’’ of the spectrum because the anions are isolated\nfrom each other in solution and so there is no wave function\noverlap.\nUnlike the p-type organic radicals described above, the\ns-type radicals have larger hyperfine interactions. Calculat-\ning DBpp as above yields about 70 G for the alkyl radical\n– CH2–CH–CH2– and 50 G for the mixed p\/s allyl radical\n– CH2–CH–CH5CH–CH2–. We conclude, therefore, that\nDBpp\nG 58 – 11 G is compatible with what would be expectedfrom unresolved H1 hyperfine interactions for p-type conju-\ngated radicals with 50 at. % H; it is incompatible with that\nexpected for s-type radicals such as the alkyl radical.\nAs shown earlier, for the PLC samples, it is possible to\nestimate DBpp\nG if the spin concentration is known and the\nspectrum has a Voigt line shape. It would be useful to have a\nrelation between DBpp\nG and the hydrogen content from which\nthe latter could then be evaluated. Equation ~11! suggests\nthat DBpp\nG might be proportional to ~at. % H!1\/2 but changing\nthe hydrogen content is also likely to change the hyperfine\nterms A i . There is also likely to be a distribution of\nconfigurations—that is, of N i and A i values. We therefore\nput forward an empirical relationship\nDBPP\nG ~G!5~0.1860.05!3~at. % H!. ~13!\nThe value of 0.1860.05 is just the mean of the values\nDBpp\nG \/~at. %H!, given in Table I, of 3.2 G at 24%, 8 G at\n45–50 %, and 11.3 G at 50%. For the other minimum line-\nwidth values of 8.7 and 8.2 G with DBpp\nG estimated to be 8.5\nand 8.2 G, the empirical relation implies an atomic H% of\njust under 50% which is reasonable considering the method\nand conditions used in preparing the samples.\nTable I shows, however, that for the maximum linewidths\nthe values estimated for DBpp\nG are rather high—higher in\nsome cases than for samples with the minimum linewidths\nwhich, being deposited at lower biases, should have a higher\nhydrogen content. Also, in the case of our sample deposited\nat Vb550 V, the values of DBppL and DBppG evaluated using\nEqs. ~9! and ~12! are less than and greater than, respectively,\nthe values obtained from the Voigt fit. The values found for\nDBpp\nG will be too high if those calculated for DBpp\nL @using Eq.\n~9!# are too low as will happen if the Ns values given in\nTable I are too low. In the case of those samples with Ns\n.1020 cm23 the increase required to give plausible DBpp\nG val-\nues ~<5 G! is quite small—only about 20%—and this is well\nwithin the uncertainty of the Ns values. However, for Ns\nvalues around 1019 cm23 an approximate doubling is re-\nquired. Of course the values of Ns given in Table I are av-\nerage values for the film whereas the dipolar broadening is\ndetermined by the local values. It may be that as the transi-\ntion from DLC to PLC occurs with the rise in hydrogen\ncontent that the spin concentration is not uniformly reduced\nso that some local values would exceed the average value.\nThis is plausible since we have seen that the unpaired spins\nare likely to be associated with p-type radicals but when the\nbias voltage is reduced below about 100 V, the protonated,\nfourfold coordinated, C bonding configurations increase\nmore rapidly that the protonated, threefold coordinated\nones.36 However, for Ns<1018 cm23, the Ns value will have\nlittle effect on the overall linewidth and DBpp\nG values since\nthe dipolar contribution is already so small.\nIn summary, we propose that for Vb,100 V the linewidth\nand shape are dominated by two contributions—the dipolar\ninteraction which gives a line shape close to Lorentzian and\na Gaussian contribution arising from unresolved H1 hyper-\nfine lines. As Vb is decreased and the hydrogen content in-\ncreases while Ns decreases, then the former contribution de-\ncreases and the latter increases. Exchange plays no part and\nthis is confirmed by the fact that, as Table I shows, as Vb is\nPRB 61 3553EPR LINEWIDTH VARIATION, SPIN RELAXATION . . .decreased below 100 V the optical gap continues to increase\neven though now the linewidth passes through a maximum\nand starts to decrease.\nBefore concluding we discuss two final matters. First, is it\na good approximation to ignore the unresolved H1 hyperfine\ncontribution to the linewidth and shape for Vb>100 V. At\nVb5100 V, Ns is typically .1020 cm23 and the hydrogen\ncontent typically ,40 at. % so Eqs. ~9! and ~13! imply that\nthe dipolar contribution exceeds, maybe considerably in\nsome cases, the hyperfine contribution. As Vb is increased\nfurther, Ns does not change much initially but the hydrogen\ncontent continues to decrease. Therefore the approximation\nis reasonably good.\nFinally, we comment on the results of Hoinkis et al.,14\nwho measured the effect of changing the hydrogen content\non the EPR linewidth from a-C:H. They found that at about\n24 at. % H DBpp ~measured in vacuum! reached a minimum\nof 2.8 G with Ns54.531020 cm23. As the hydrogen content\nwas increased the linewidth started to increase again whereas\nNs continued to fall and the approximate values are DBpp\n58 G, Ns51.531020 cm23 at 36 at. % H and DBpp510 G,\nNs50.531020 cm23 at 39 at. % H. They interpreted this in-\ncrease in DBpp , for .24 at. % H, as due to an increase in the\nunresolved hydrogen hyperfine contribution. Our interpreta-\ntion is different. First, at 24 at. % H, Eqs. ~9! and ~13! imply\nthat the dipolar contribution DBpp\nL 537 G and hyperfine con-\ntribution DBpp\nG 54.561.2 G, and Eq. ~12! then gives DBppT\n537.2 G, we suggest that the measured DBpp\nT 52.8 G is\nmuch less than this because the sp2 content is high enough\nfor there to be exchange narrowing. At 36 at. % H the same\ncalculations give DBpp\nL 512.2 G, DBpp\nG 56.561.8 G, DBppT\n515 G, which is closer to but still exceeds the measured\nvalue DBpp\nT 58 G. We suggest that there is still some ex-\nchange narrowing but much less than before because increas-\ning the hydrogen content will tend to decrease the sp2 con-\ntent and hence decrease wave function overlap. At 39 at. %\nH we calculate DBpp\nL 54 G, DBpp\nG 5762 G, DBpp\nT 59\n62 G, which agrees with the measured value of 10 G. Thus\nwe suggest that in the range 25–36 at. % H the dominant\ncontributions to the width and shape are the dipolar and ex-\nchange interactions which will give a Lorentzian-like line as\nobserved; these contributions change in this range because of\nchanges to the sp2 content and Ns . Only at 39 at. % H ~and\nabove! does the hyperfine interaction make the dominant\ncontribution and it together with the dipolar contribution\nthen fully account for the linewidth; however, we predict that\nthis spectrum has a Voigt shape. The effects they observe14\non decreasing from 39 to 24 at. % H are therefore very simi-\nlar to that of increasing Vb , in our case, from about 50 to\n540 V.\nHoinkis et al.14 also find that decreasing the hydrogen\ncontent below 24 at. % H leads to an increase in width and,\nat 6 at. % H, DBpp has increased to about 88 G. At the same\ntime the resistivity has fallen to just below 10 V cm and they\nreasonably suggest that this increase in width is due to a\nreduction in the spin relaxation times due to the interaction\nof the unpaired spins with the conduction electrons. This isnot a situation which arose in our samples, although it is\nlikely to account for the increase in linewidth which has been\nreported6,7,41,42 for a-C:H annealed to sufficiently high tem-\nperatures.\nIV. CONCLUSIONS\nWe have provided a comprehensive interpretation of the\nway in which the EPR linewidth and shape change as the\nstructure of the a-C:H is changed from polymerlike to dia-\nmondlike to graphitelike by increasing the negative self-bias\nvoltage from about 10 up to 540 V. The change from PLC to\nDLC in the range 10 to about 50–100 V is accompanied by\nan increase in linewidth, a line shape change, and a large\nincrease in unpaired spin concentration. The linewidth in-\ncreases because the increase in the dipolar contribution more\nthan compensates for the decrease in the contribution from\nunresolved hydrogen hyperfine splittings. The former contri-\nbution is close to Lorentzian and the latter Gaussian, and the\noverall line shape should have a Voigt profile, as we observe\nat Vb550 V, but gradually becomes Lorentzian as Vb is in-\ncreased. At Vb5100 V the linewidth has reduced, probably\nbecause the hyperfine contribution has fallen to negligible\nproportions, and can be accounted for solely in terms of the\ndipolar interaction. Thus for Vb<100 V the exchange inter-\naction, if present, has a negligible effect on the linewidth and\nthis is borne out by the fact that, as Vb is decreased below 50\nV, the optical gap continues to increase whereas the line-\nwidth decreases. The hydrogen content is related empirically\nto the Gaussian, hydrogen hyperfine, contribution by\nDBpp\nG ~G!5(0.1860.05)3~at. %H).\nAs Vb is increased above 100 V the linewidth decreases\nbelow that expected from the dipolar contribution alone, and\nthis is attributed to exchange narrowing which becomes\nmore pronounced as Vb is increased. The increase in ex-\nchange interaction is attributed to the increased wave func-\ntion overlap arising from greater unpaired spin delocalization\nwhich in turn arises from the increased sp2 content. In this\nregime the line shape is Lorentzian and the optical gap is\ncorrelated with the linewidth. At the maximum Vb of 540 V\nthe exchange frequency, ve , is estimated to be\n1.231010 rad s21 and there is also some evidence for spin\nclustering.\nEvidence for the existence of exchange is that the spin-\nlattice relaxation time decreases and the spin-spin relaxation\ntime increases as Vb is increased in a way similar to that\nobserved for DPPH as its concentration is increased. For all\nsamples investigated the characteristics of the EPR signal are\nconsistent with it being associated with p-type rather than\ns-type radicals.\nACKNOWLEDGMENTS\nThis work was supported by a Basic Research Grant ~No.\nSC\/1998\/704! from Enterprise Ireland. The authors thank Dr.\nD. Carey for the preparation of the PLC sample at Vb\n510 V.\n3554 PRB 61R. C. BARKLIE, M. COLLINS, AND S. R. P. SILVA1 J. Robertson, Adv. Phys. 35, 317 ~1986!; Philos. Mag. B 76, 335\n~1997!.\n2 P. Koidl, Ch. Wild, B. Dischler, J. Wagner, and M. Ramsteiner,\nMater. Sci. Forum 52, 41 ~1989!; J. Robertson and E. P.\nO’Reilly, Phys. Rev. B 35, 2946 ~1987!.\n3 A. Bubenzer, B. Dischler, G. Brandt, and P. Koidl, J. Appl. Phys.\n54, 4590 ~1983!.\n4 J. Robertson, in Amorphous Carbon: State of the Art, edited by S.\nR. P. Silva, J. Robertson, W. I. Milne, and G. A. J. Amaratunga\n~World Scientific, Singapore, 1998! p. 32.\n5 J. Robertson, Phys. Rev. B 53, 16 302 ~1996!.\n6 D. J. Miller and D. R. McKenzie, Thin Solid Films 108, 257\n~1983!.\n7 J. Gonza´lez-Herna´ndez, R. Asomoza, and A. Reyes-Mena, Solid\nState Commun. 67, 1085 ~1988!.\n8 S. Schu¨tte, S. Will, H. Mell, and W. Fuhs, Diamond Relat. Mater.\n2, 1360 ~1993!.\n9 J. Ristein, J. Scha¨fer, and L. Ley, Diamond Relat. Mater. 4, 508\n~1995!.\n10 S. R. P. Silva, J. Robertson, G. Rusli, and G. A. J. Amaratunga,\nPhilos. Mag. B 74, 369 ~1996!.\n11 R. Kleber, K. Jung, H. Ehrhardt, I. Mu¨hling, K. Breuer, H. Metz,\nand F. Engelke, Thin Solid Films 205, 274 ~1991!.\n12 M. Chhowalla, J. Robertson, C. W. Chen, S. R. P. Silva, C. A.\nDavis, and G. A. J. Amaratunga, J. Appl. Phys. 81, 139 ~1997!.\n13 M. Weiler, S. Sattel, T. Giessen, K. Jung, H. Ehrhardt, V. S.\nVeerasamy, and J. Robertson, Phys. Rev. B 53, 1594 ~1996!.\n14 M. Hoinkis, E. D. Tober, R. L. White, and M. S. Crowder, Appl.\nPhys. Lett. 61, 2653 ~1992!.\n15 J. P. Goldsborough, M. Mandel, and G. E. Pake, Phys. Rev. Lett.\n4, 13 ~1960!.\n16 F. Giorgis, A. Tagliaferro, and M. Fanciulli, in Amorphous Car-\nbon: State of the Art, edited by S. R. P. Silva, J. Robertson, W.\nJ. Milne, and G. A. J. Amaratunga ~World Scientific, Singapore,\n1998! p. 143.\n17 S. D. Berger, D. R. McKenzie, and P. J. Martin, Philos. Mag.\nLett. 57, 285 ~1988!.\n18 S. R. P. Silva, R. U. A. Khan, A. P. Burden, J. V. Anguita, J. M.\nShannon, B. J. Sealy, A. J. Papworth, C. J. Kiely, and G. A. J.\nAmaratunga, Thin Solid Films 332, 118 ~1998!.\n19 C. P. Poole, Electron Spin Resonance ~Wiley, New York, 1983!\np. 476.20 See Ref. 19, p. 489.\n21 G. Rusli, G. A. J. Amaratunga, and S. R. P. Silva, Opt. Mater. 6,\n93 ~1996!.\n22 D. Arcon, P. Cevc, R. Blinc, I. Pocsik, M. Koos, Z. Trontelj, and\nZ. Jaglicic, in Molecular Nanostructures, edited by J. Fink, M.\nMehring, and S. Roth ~World Scientific, Singapore, 1998!,\np. 533.\n23 Q. Zhang, S. F. Yoon, Rusli, J. Ahn, H. Yang, and D. Bahr, J.\nAppl. Phys. 84, 5538 ~1998!.\n24 H. Seidel and H. C. Wolf, in Physics of Color Centers, edited by\nW. Fowler ~Academic Press, New York, 1968!, p. 557.\n25 S. Sattel, J. Robertson, H. Ehrhardt, J. Appl. Phys. 82, 4566\n~1997!.\n26 J. Robertson, J. Non-Cryst. Solids 198-200, 615 ~1996!.\n27 See Ref. 19, p. 590.\n28 A. Abragam and B. Bleaney, Electron Paramagnetic Resonance\nof Transition Ions ~Clarendon Press, Oxford, 1970! p. 110.\n29 R. C. Pastor and R. H. Hoskins, J. Chem. Phys. 32, 264 ~1960!.\n30 C. P. Slichter, Principles of Magnetic Resonance ~Springer-\nVerlag, Berlin, 1992!.\n31 P. W. Anderson and P. R. Weiss, Rev. Mod. Phys. 25, 269\n~1953!.\n32 A. Abragam, Principles of Nuclear Magnetism ~Clarendon Press,\nOxford, 1996! p. 126.\n33 J. C. Dawson and C. J. Adkins, J. Phys.: Condens. Matter 7, 6297\n~1995!.\n34 J. P. Sullivan and T. A. Friedmann, Amorphous Carbon: State of\nthe Art ~World Scientific, Singapore, 1998!, p. 281.\n35 A. Ilie, N. M. J. Conway, B. Kleinsorge, J. Robertson, and W. I.\nMilne, J. Appl. Phys. 84, 5575 ~1998!.\n36 M. A. Tamor, W. C. Vassell, and K. R. Carduner, Appl. Phys.\nLett. 58, 592 ~1991!.\n37 A. M. Stoneham, J. Phys. D 5, 670 ~1972!.\n38 A. Sadki, Y. Bounouh, M. L. Theye, J. von Bardeleben, J. Cer-\nnogora, and J. L. Fave, Diamond Relat. Mater. 5, 439 ~1996!.\n39 B. R. Weinberger, E. Ehrefreund, A. Pron, A. J. Heeger, and A.\nG. MacDiarmid, J. Chem. Phys. 72, 4749 ~1980!.\n40 A. Carrington and A. D. McLachlan, Introduction to Magnetic\nResonance ~Harper and Row, New York, 1967!, pp. 77, 83, 90.\n41 S. Orzeszko, W. Bala, K. Fabisiak, and F. Rozploch, Phys. Status\nSolidi A 81, 579 ~1984!.\n42 R. C. Barklie, M. Collins, J. Cunniffe, and S. R. P. Silva, Dia-\nmond Relat. Mater. 7, 864 ~1998!.\n"}