{"doi":"10.1007\/s00367-009-0163-5","coreId":"57916","oai":"oai:nora.nerc.ac.uk:9492","identifiers":["oai:nora.nerc.ac.uk:9492","10.1007\/s00367-009-0163-5"],"title":"Evidence for current-controlled morphology along the western slope of Hatton Bank (Rockall Plateau, NE Atlantic Ocean)","authors":["Sayago-Gil, Miriam","Long, David","Hitchen, Kenneth","Diaz-del-Rio, Victor","Fernandez-Salas, Miguel","Duran-Munoz, Pablo"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"A multibeam bathymetric and high- (airgun and sparker) to very high-resolution (Topas) seismic study of the western slope of Hatton Bank (NE Atlantic), located between 600 m and 2,000 m water depth, has revealed a highly variable range of current-controlled morphological features. Two major seabed areas can be distinguished: (1) a non-depositional area corresponding to the top of the bank and (2) a depositional area in which the Hatton Drift has developed. Both areas are characterised by distinct morphologies associated either with rock outcrops and rocky ridges or with smooth surfaces, slides and bedforms controlled mainly by bottom currents interacting with the topography of the bank. The water depth separating the morphological areas probably coincides with the boundary of the Labrador Sea Water and the Lower Deep Water. Morphological features identified in the study area include contourite channels (moats, furrows and scours), fields of sediment waves, edges of contourite deposits, ponded deposits, scarps, gullies, ridges, depressions, slides and slide scars. These morphological features do not necessarily reflect present-day conditions but may have been associated with past current events, consistent with earlier interpretations","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/57916.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/9492\/1\/Sayago-Gil_et_al_v1.pdf","pdfHashValue":"118a0143929d68fbed5fe7ef4bd3e3d81cff8486","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:9492<\/identifier><datestamp>\n      2012-11-22T12:08:57Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9492\/<\/dc:relation><dc:title>\n        Evidence for current-controlled morphology along the western slope of Hatton Bank (Rockall Plateau, NE Atlantic Ocean)<\/dc:title><dc:creator>\n        Sayago-Gil, Miriam<\/dc:creator><dc:creator>\n        Long, David<\/dc:creator><dc:creator>\n        Hitchen, Kenneth<\/dc:creator><dc:creator>\n        Diaz-del-Rio, Victor<\/dc:creator><dc:creator>\n        Fernandez-Salas, Miguel<\/dc:creator><dc:creator>\n        Duran-Munoz, Pablo<\/dc:creator><dc:description>\n        A multibeam bathymetric and high- (airgun and sparker) to very high-resolution (Topas) seismic study of the western slope of Hatton Bank (NE Atlantic), located between 600 m and 2,000 m water depth, has revealed a highly variable range of current-controlled morphological features. Two major seabed areas can be distinguished: (1) a non-depositional area corresponding to the top of the bank and (2) a depositional area in which the Hatton Drift has developed. Both areas are characterised by distinct morphologies associated either with rock outcrops and rocky ridges or with smooth surfaces, slides and bedforms controlled mainly by bottom currents interacting with the topography of the bank. The water depth separating the morphological areas probably coincides with the boundary of the Labrador Sea Water and the Lower Deep Water. Morphological features identified in the study area include contourite channels (moats, furrows and scours), fields of sediment waves, edges of contourite deposits, ponded deposits, scarps, gullies, ridges, depressions, slides and slide scars. These morphological features do not necessarily reflect present-day conditions but may have been associated with past current events, consistent with earlier interpretations. <\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9492\/1\/Sayago-Gil_et_al_v1.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Sayago-Gil, Miriam; Long, David; Hitchen, Kenneth; Diaz-del-Rio, Victor; Fernandez-Salas, Miguel; Duran-Munoz, Pablo.  2010  Evidence for current-controlled morphology along the western slope of Hatton Bank (Rockall Plateau, NE Atlantic Ocean).   Geo-marine Letters, 30. 99-111.  https:\/\/doi.org\/10.1007\/s00367-009-0163-5 <https:\/\/doi.org\/10.1007\/s00367-009-0163-5>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.springerlink.com\/content\/100418\/<\/dc:relation><dc:relation>\n        10.1007\/s00367-009-0163-5<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/9492\/","http:\/\/www.springerlink.com\/content\/100418\/","10.1007\/s00367-009-0163-5"],"year":2010,"topics":[],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1\n 1 \n<articletype>Original 2 \n 3 \n<title>Geomorphology of the western slope of Hatton Bank (Rockall Plateau, NE Atlantic 4 \nOcean) revealed by multibeam bathymetry and high-resolution seismic data: control by 5 \nbottom current regime> 6 \n 7 \n<author>M. Sayago-Gil, D. Long, K. Hitchen, V. Díaz-del-Río, L.M. Fernández-Salas, P. 8 \nDurán-Muñoz 9 \n 10 \nM. Sayago-Gil (corresponding author) (e-mail: miriam.sayago@ma.ieo.es, Tel.: +34-952-11 \n478148, Fax: +34-952-463808), V. Díaz-del-Río, L.M. Fernández-Salas 12 \nInstituto Español de Oceanografía, Centro Oceanográfico de Málaga, Puerto Pesquero, s\/n, 13 \nApdo. 285, 29640 Fuengirola, Spain 14 \nD. Long, K. Hitchen 15 \nBritish Geological Survey, West Mains Road, Edinburgh EH9 3LA, UK 16 \nP. Durán-Muñoz 17 \nInstituto Español de Oceanografía, Centro Oceanográfico de Vigo, Cabo Estay-Canido, Apdo. 18 \n1552, 36200 Vigo, Spain 19 \n 20 \nReceived: 20 March 2009 Accepted: X XXXX 2009 21 \n 22 \nAbstract 23 \nA geomorphologic study, using multibeam data as well as high- (airgun and sparker) and very 24 \nhigh-resolution (topas) seismic profiles from the western slope of the Hatton Bank (NE 25 \nAtlantic), in 600 to 2000 m water depth, has identified a range of geomorphologic features in 26 \nan oceanographic setting. Two principal sea-bed domains have been recognised: (1) a non-27 \ndepositional area (corresponding to the top of the bank) and (2) a depositional area in which 28 \nthe Hatton Drift has developed. Five morphological areas have been identified associated to 29 \nboth domains: in (1) outcrop and ridges areas and in (2) smooth surface, slides and bedforms 30 \nareas controlled mainly by bottom currents interacting with the topography of the bank that 31 \ndescribing the boundaries between two water masses (probably the Labrador Sea Water and 32 \nthe upper limit of the Lower Deep Water). Individual features as: contourite channels (moats, 33 \nfurrows and scours), wave fields, contourite-packages boundary, ponded deposits, scarps, 34 \n 2\ngullies, ridges, depressions and slides, were identified on these areas. These morphologies can 35 \nbe due to past events and does not necessarily reflect the present-day current conditions. 36 \n 37 \n<heading1>Introduction 38 \nThe effect of the bottom currents in shaping the sea bed over both depositional (drift) and 39 \nerosional characteristics is well known (Hollister and Heezen 1972; McCave and Tucholke 40 \n1986; Masson et al. 2004). The sea floor is sculpted into a wide variety of bedforms (flow can 41 \nerode, mould, transport and redistribute sediments) that gain an insight into bottom currents 42 \nfeatures (Stow et al. 2008). Recent studies by Kuijpers et al. (2002); Masson et al. (2004) and 43 \nMacLachlan et al. (2008) have used bedforms and related erosional features to map the 44 \ndistribution of bottom currents in NE Atlantic Ocean. As recently reviewed by MacLachlan et 45 \nal. (2008) in Hatton Bank margin, the interaction between bottom currents and slope 46 \nconfiguration, control the morphology of the deposits. 47 \nIn this paper we present a geomorphologic study of the western slope of Hatton Bank using 48 \nmultibeam data and high-resolution seismic profiles in order to identify possible depositional, 49 \nerosional and gravitational features. We then attempt to interpret these in terms of existing 50 \nknowledge of the regional bottom current regime. 51 \n 52 \n<heading1>Physical setting 53 \n<heading2>Physiography 54 \nThe Rockall Plateau comprises the shallow-water banks of Rockall Bank, Hatton Bank 55 \n(object of this work) and George Bligh Bank. Hatton Bank is separated from Rockall Bank by 56 \nthe Hatton-Rockall Basin (Roberts et al. 1970; Fig. 1) and has a sinuous bathymetric 57 \nplanform. South of 59ºN, it is aligned approximately SW–NE and further north the alignment 58 \nis more W–E (Hitchen 2004). The study area is located between 600 and 2,000 m water depth 59 \non the western upper and middle slope of Hatton Bank (Fig. 1) which is a slope remote from 60 \nany major terrigenous sediment supply; at present, it lies over 360 km from the closest 61 \nonshore sediment source (MacLachlan et al. 2008). The area is dominated by contourite drifts 62 \nthat are the primary deposits of bottom currents (Weaver et al. 2000). Contourites are deep-63 \nsea sediments that accumulate under the influence of strong thermohaline bottom currents. 64 \n 65 \n<heading2>Oceanography  66 \nIn the mid-latitude NE Atlantic Ocean, Van Aken (2000) categorised the Northeast Atlantic 67 \nDeep Water in terms of four local source water types: the Iceland-Scotland Overflow Water, 68 \n 3\nLower Deep Water, Labrador Sea Water and Mediterranean Sea Water. The western slope of 69 \nHatton Bank is influenced by a branch of the Labrador Sea Water which meets with the 70 \nIceland-Scotland Overflow Water, forming the Deep Northern Boundary Current (McCartney 71 \n1992; Fig. 1), and possibly by the Lower Deep Water (Bianchi and McCave 2000) which 72 \ntravels toward NE from the southern part of Hatton Bank until 58–59ºN before turning 73 \nwestwards into the Iceland Basin circulating anticlockwise (Van Aken 1995). Hunter et al. 74 \n(2007) propose that the upper and lower limits of the Labrador Sea Water are at about 700 75 \nand 1,500 m water depth respectively in the Iceland and Irminger Basins, consistent with the 76 \noverall water depth of 1,000 m described by McCartney (1992). In addition, Due et al. (2006) 77 \nreported northward currents in the permanent thermocline above a water depth of approx. 78 \n1,500 m. McCave et al. (1980) also documented a strong NE-flowing bottom current along 79 \nthe foot of Hatton Bank, comprising North Atlantic Deep Water with some admixture of 80 \nAntarctic Bottom Water. Measured current velocities in this area reach a maximum of 23 cm 81 \ns–1 (Stow and Holbrook 1984). 82 \n 83 \n<heading2>Geology 84 \nThe Rockall Plateau is a broad, topographically elevated region in the NE Atlantic Ocean, 85 \nunderlain by continental crust which, before the opening of the North Atlantic Ocean in the 86 \nMesozoic to early Cenozoic (Stoker et al. 1998), was juxtaposed between Greenland and 87 \nEurope. The present-day configuration of the Rockall Plateau is the result of a complex 88 \ngeological evolution involving continental plate movements, tectonics, massive volcanism, 89 \nand differential subsidence and inversion (Hitchen 2004). The Rockall Plateau comprises a 90 \nvolcanic continental margin with the continental-ocean transition located beneath the lower 91 \nwestern slope of Hatton Bank (Kimbell et al. 2005; Smith et al. 2005). The south part of 92 \nHatton Bank, (at least part of the underlying geological structure) comprises an inverted 93 \nCretaceous (and older) to Paleocene basin (McInroy and Hitchen 2008). Further north the 94 \nstructure comprises a large anticline with minor thrusts climbing up its southern limb 95 \n(Hitchen 2004). Widespread early Palaeogene flood basalts sub-crop (and occasionally crop 96 \nout) over most of the Rockall Plateau. Although not definitely proven, the tectonism within 97 \nthe Hatton Bank appears to become more intense, and younger, northwards (Hitchen 2004).  98 \nAlthough commonly described as ‘passive’, the NE Atlantic Margin adjacent to the British 99 \nIsles, of which the Rockall Plateau is a component, has undergone significant tectonic activity 100 \nthroughout the Cenozoic. This includes basin margin tilting, differential subsidence and the 101 \n 4\nformation of large scale structural domes and ridges due to episodic compression (Stoker et al 102 \n2005, Johnson et al. 2005, Tuitt 2009). 103 \nThe Hatton Drift (Ruddiman 1972; Fig. 1) was classified by McCave and Tucholke (1986) as 104 \na plastered-contourite drift which lies at the foot of the NW side of the Rockall Plateau and is 105 \ncomposed mainly of mud (McCave et al. 1980). Sediment transport along the Hatton Drift to 106 \nthe northeast is both by suspended transport of fines in locally generated nepheloid layers and 107 \nby bedload transport of cohesionless sand (McCave et al. 1980). Linear erosive features were 108 \ndescribed by Hernández-Molina et al. (2008) including large contourite channels and smaller 109 \nelongate furrows, as well as channels related to slope drifts (contourite moats). Sediment 110 \ndrifts in the NE Atlantic have maintained their basic characteristics at least since the mid-111 \nPleistocene (Huizhong and McCave 1990). 112 \n 113 \n<heading1>Materials and methods 114 \n<heading2>Multibeam data 115 \nWithin the framework of the Ecovul-Arpa project (http:\/\/www.ieo.es\/proyectos\/pesquerias\/ 116 \necovularpa.htm); Kongsberg-Simrad EM300 multibeam echosounder data were collected 117 \nbetween 2005 and 2007, providing 100% coverage of the whole study area (18,760 km2) from 118 \n600 to 2,000 m water depth (Fig. 2). The data were processed with the CARAIBES software© 119 \n(http:\/\/www.ifremer.fr\/fleet\/equipements_sc\/logiciels_embarques\/caraibes\/index.html), and a 120 \n50×50 m resolution grid produced. In addition, backscatter mosaic was extracted from the 121 \nmultibeam data. Morphologic analysis was done using ArcGIS Desktop. 122 \n 123 \n<heading2>Seismic data 124 \nHigh-resolution airgun and sparker seismic data were acquired in 1992, 1998 and 2002 along 125 \n2,840 km with line spacing varying between 5 and 20 km (Fig. 2). The airgun system 126 \nconsisted of an array of four 40-inch3 Bolt guns connected to a 30-m Geomechanique 127 \nhydrophone cable. All channels were summed for optimum output. Sparker data were 128 \ncollected at up to 3-kJ maximum power via a 10-m Teledyne hydrophone cable. In both cases, 129 \nthe power and firing rate varied according to water depth. All data were stored onto a CODA 130 \nDA200 recording system and navigation was by DGPS. 131 \nFrom 2005 to 2007, a network of approx. 1,120 km of very high-resolution seismic profiles 132 \nwas collected with a parametric Topas PS 018 echosounder (Fig. 2b), at 16–20 kHz. The data 133 \nwere processed by means of Kingdom Suite software (http:\/\/www.seismicmicro.com\/). 134 \n 135 \n 5\n<heading1>Results 136 \nFigure 3 presents a general overview of dominant seabed morphology and the slope gradients 137 \nrecorded in the study area. The study area can be subdivided in two main domains (Fig. 3a): 138 \n(1) an area where little or no deposition occurs (outcrop) and (2) a depositional area (drift). (1) 139 \nThe outcrop shows at the most only thin (<20 ms) sediment deposits, mainly shallower than 140 \n1,100 m water depth (Fig. 3a) and it is characterized by an uneven surface. Seabed gradients 141 \n(Fig. 3b) reaching 40º occur locally and high backscatter values (>-20 dB) are typical. A 142 \nspecial morphological area, named “ridges area” (Fig. 3c), can be described associated to the 143 \noutcrop forming a series of parallel barriers extended up to 1,600 m water depth. 144 \n(2) Downslope, a surface recognised as the top of the Hatton Drift (Fig. 3a) has been 145 \nidentified. It follows the general trend of the slope of the bank and overall has gradients of 0–146 \n3º (Fig. 3b), reaching 30° in places (e.g. moats). It exhibits moderate–low backscatter values 147 \n(generally <-20 dB). Based on the seismic data, this surface belongs to a deposit characterized 148 \nby variable sediment thickness (>400 ms downslope), generally increasing basinward and 149 \nonlapping upslope as a wedge with well-stratified layers (Fig. 2b). In places, this deposit can 150 \nbe seen covering the outcrop. There are three main morphological areas associated to the drift: 151 \nsmooth surface area, bedforms area and slides (Fig. 3c). The sediment drift exhibits 152 \ndifferences in seabed morphology at water depths shallower and deeper than 1,400–1,500 m. 153 \nUpslope, the sea bed has smooth relief whereas downslope the uneven surface contains 154 \nfurrows, scours and slides.  The “smooth surface” (Fig. 3c) is located in the southern part 155 \n(Fig. 3a) of the study area between ~1,100 and ~1,400 water depths (except attached to the 156 \n“ridges area” where the “smooth surface” is reduced). In the “bedforms area” (Fig. 3c) the 157 \ndrift shows an irregular surface and it is located contouring the outcrop in the northern part of 158 \nthe study area with a minimum of ~1,100 m water depth, whereas in the southern part the 159 \n“bedforms area” is deeper than ~1400 m water depths. “Slides” (Fig. 3c) are located in the 160 \nsouthern part and the headwalls of the slides are at ~1400 m water depths. 161 \n 162 \nIndividual features– contourite channels (moats, furrows and scours), wave fields, contourite-163 \npackages boundary, ponded deposits, scarps, gullies, ridges, depressions and slides– are 164 \ndescribed in more detail (Fig. 4-7): 165 \n 166 \n<heading2>Contourite channels  167 \nWe distinguished three types of contourite channels, occurring mostly in groups. 168 \n 169 \n 6\n1. Moats (Fig. 4a) typically occur at the boundary between the areas of outcrop and drift 170 \nformation, at 1,000–1,300 m water depth and are characterised by a main axis parallel to the 171 \nbathymetric contours. Mean moat length is 23 km (range of 14–38 km), and mean width 1.3 172 \nkm (maximum of 3.5 km). In cross section, the upslope bedrock surface of the moat is steeper 173 \nthan the downslope drift surface, below which the internal reflectors of the drift illustrate 174 \ndecreased sedimentation into the moat. The gradient recorded on such drift flanks has a mean 175 \nvalue of 2º, but reaches maximum values of 30º at some locations. In the northern part of the 176 \nstudy area, two wave fields have been identified associated with moats drift-flanks (c.f. 177 \nbelow) and the crest of waves are oblique to the moats axis.  178 \n 179 \n2. Furrows (Fig. 4b) trend parallel to the bathymetric contours and possess different plan 180 \ngeometries each other. On the whole, they are characterised by a single axis, (although some 181 \nshow an axis bifurcation). The furrows usually have flat bottoms (although occasionally small 182 \nridges are observed inside) and steep sedimentary sides (Fig. 4b). The furrows are located 183 \nbetween 1400 and 1800 m water depth and have a mean length of 9 km (range of 3-34 km). 184 \nThe mean gradient of the furrow walls varies: those on the northern slope of Hatton Bank 185 \n(axis with W–E trend) have typical gradients of 6–7º on the northern wall and 16–17º on the 186 \nsouthern wall (upslope); and furrows further south, where the slope of the bank faces west, 187 \nhave shallower gradients, typically 2–3º on the western wall and 5–6º on the eastern wall. On 188 \nseismic data, furrows exhibit a complex history of excavation, erosion on the flanks and 189 \npartial infilling by drift sequences. 190 \n 191 \n3. Scours (Fig. 4c) can be detected on the multibeam bathymetry data as U-shaped scars at 192 \nonly shallow depths (5–15 m) and vary in length between 1 and 29 km. Scours can not be 193 \ndetected clearly on seismic data owing to the fact that the scale of the profiles and in places, 194 \ncan be observed on the backscatter mosaic with higher values (~22 dB) than the surrounding 195 \nareas. They are orientated parallel to the main trend of the bathymetric contours and are 196 \nadjacent to others morphologies such as furrows.  197 \n 198 \n<heading2>Wave fields 199 \nTwo wave fields occur in the north of the study area, on the flanks of moats. 200 \n1. The western wave field (Fig. 5a) covers an area of 10.2 km2 (6 by 1.7 km), between 201 \n1,180 and 1,270 m water depth. Mean wave heights are 15–20 m, mean wavelength 0.9 km, 202 \nand the waves are symmetric. 203 \n 7\n 204 \n2. The eastern wave field covers an area of 18.3 km2 (7.8 by 2.7 km) in water depths 205 \nbetween 1,390 and 1,500 m. The waves are symmetric, with amplitude of 5–7 m and 206 \nwavelengths varying between 0.4 and 1.2 km. Crest orientation changes from overall SE–NW 207 \non the flank to E–W towards the axis of the moat. 208 \n 209 \n<heading2> Contourite-packages boundary  210 \nThe multibeam imagery provides evidence of a concave boundary in the form of a marked 211 \nchange in the overall slope gradient of the Hatton Bank at the limit between two contourite 212 \npackages (Fig. 5b), occurring between 1,000 and 1,300 m water depth and has a length of 40 213 \nkm. The gradient is 2–3º upslope and 0.3–1º downslope. On seismic data, the boundary marks 214 \nthe upslope limit of an accreting drift wedging out against a lower drift deposit. 215 \n 216 \n<heading2>Ponded deposits 217 \nSediments which fill irregular hollows in the bedrock surface (or located in surrounding 218 \nareas) are here termed ponded deposits (Fig. 5c). On multibeam bathymetry theses deposits 219 \nappear as flat surfaces between crests of outcropping bedrock. On seismic profiles, they can 220 \nbe recognised by well-stratified layers onlapping against the outcrops. In places surrounding 221 \noutcrops, the sediments are forming wedge-shaped deposits with a downslope progradational 222 \ninternal structure. Sediment thickness (up to 50 ms) and area (40 km2) vary depending on the 223 \nsurrounding outcrop geometry. Ponded deposits show low backscatter, in contrast to the 224 \nadjacent outcrop. 225 \n 226 \n<heading2>Scarps 227 \nScarps are shown as abrupt gradient changes which divide two areas with different level and 228 \nsofter gradient, and the majority of which face downslope (Fig. 6a). The strike of the scarps 229 \nusually parallels that of the regional slope. The scarps are located in both the outcrop and 230 \nsediment drift areas. The gradients vary between 3 and 10º, although they can reach 20–30º 231 \nlocally. The height is up to 55 m and generally, the areas around the scarps show a high 232 \nbackscatter (~20dB). 233 \n 234 \n<heading2>Gullies 235 \nIn the south of the study area two gullies are recognized between 1100 and 1300 m water 236 \ndepth showing sinuous shapes, in plan view, crossing the main trend of the bathymetric 237 \n 8\ncontours with an overall WSW–ENE orientation (Fig. 6b). Usually the southern side of the 238 \ngullies is steeper than the north side with gradients of 7–8°, reaching 15° at some locations. 239 \nThe side-wall scarp varies in height but reaches a maximum value of 70 m in the easternmost  240 \npart of one of the gullies. Both gullies are approximately 4 km in length although the southern 241 \none may previously have been up to 8 km (Fig. 6b). There is strong evidence for infilling of 242 \nother gullies (or lateral migration of the same gully) in the immediate vicinity leaving only a 243 \nshallow present-day depression of up to 10 m. This is corroborated by the seismic profile 244 \nwhich illustrates a deep erosive gully and now partially infilled by sediments prograding 245 \ndownslope leaving a highly asymmetric present-day profile (Fig. 6b). 246 \n 247 \n<heading2>Ridges 248 \nIn the outcrop area there is a series of parallel and elongated ridges 5 km apart above 1600 m 249 \nwater depth. Ridges are long narrow raised land formations with sloping sides which show 250 \ncommon segmentation (Fig. 6c) with sections of 2–7 km length, with four main orientations: 251 \nN90ºE, N78ºE, N67ºE and N53ºW. The heights of the ridges vary between 5 and 45 m and 252 \ngenerally have steeper gradients downslope (up to 17º). There maybe a thin veneer of 253 \nsediment on these features. Ridges are associated to ponded-deposits explain above (Fig. 5c). 254 \nSuperimposed on the ridges are conical mounds (Fig. 6c); some of them symmetrically 255 \nshaped single features whereas others are asymmetrically-shaped features formed by 256 \ncoalescing former individual mounds. These mounds stand 10 to 25 m above the ridges and 257 \nare a few hundred metres in width. 258 \n 259 \n<heading2>Depressions 260 \nThe depressions appear on the multibeam bathymetry as near-circular with areas of 0.2–0.9 261 \nkm2, variations in depth between 20 and 30 m (Fig. 6d) and have steeper upslope sides (7–262 \n10º) compared to the downslope sides (2–4º). Some of them show a backscatter change 263 \nbetween the bottom of the depressions (up to -17dB) and the surrounding areas (~ -35db).  264 \n 265 \n<heading2>Slides 266 \nThe data have revealed two slides. 267 \n 268 \n1. The Talismán Slide (Sayago-Gil et al. 2009) (Fig. 7), at the southern western edge of the 269 \nstudy area (Fig. 3c), covers a minimum of 194 km2 and extends at least 15 km downslope. It 270 \nis a very conspicuous feature with only the thinnest post-slide veneer of sediments. The slide 271 \n 9\nis orientated E-W from its headwall scar at 1358 m water depth and to, at least, 1900 m water 272 \ndepth. The 7.7-km headwall scar shows a SW–NE trend with an irregular zigzag form. The 273 \nscarp varies in height between 50 and 76 m and has a slope angle of 34º. The northern 274 \nsidewall has a linear NW-SE trend with a scarp height of up to 100 m. The southern sidewall 275 \nhas an irregular form, comparable to the headwall, with a scarp height of 50 m decreasing 276 \ndownslope to 30 m and with slope angles of 25–30º. The remnant surface of the slide mass 277 \nshows discontinuous morphologies (Fig. 7). There are depressions in the surface and 278 \nupstanding blocks (with a relief up to 20 m), both of which have a step-like appearance. 279 \nSeismic data show the remnant slide mass is 10–20 m thick above the slide plane. The slide 280 \nplane cuts into a sequence of contourite deposits. 281 \n 282 \n2. About 160 km north of the Talismán Slide (Fig. 3c), a partially buried slide, informally 283 \nnamed the Granadero Slide (Sayago-Gil et al. 2009), has been reported by MacLachlan et al. 284 \n(2008) using independent dataset. Here, we expand the earlier findings with new information 285 \nforming part of the results of the present study. The multibeam data show it covers an area of 286 \n230 km2 and extends at least 11 km downslope in an E–W orientation. Its headwall scarp is at 287 \n1385 m water depth and the slide extends to at least 1980 m water depth. The 18 km headwall 288 \nscar has a NE–SW trend. The maximum height of the headwall scar is 68 m but the sidewalls 289 \nmay locally reach 120 m. The slope angles of the sidewalls are on mean 6° but may locally 290 \nreach 24° on the northern sidewall. The slide mass shows a slope angle <3°. The seabed 291 \nwithin the slide area exhibits a smooth relief with some gentle waves mainly parallel to the 292 \nheadwall. However, a single mounded deposit, attached to the southern sidewall, is more than 293 \n60 m high. These sediments are contourite deposits accumulated in the lee of sidewall since 294 \nthe slide event. 295 \n 296 \nA new morphological sketch of the part studied of Hatton Bank is presented in figure 8, 297 \nshowing the bedform details of the two main domains describe in this work (outcrop and 298 \ndrift) in the northern and southern parts of the bank. The outcrop area is characterized by an 299 \nuneven surface with crest and scarps and the ridges area can be seen with ponded deposits 300 \nassociated.  Three main morphological areas have been associated to the drift: smooth surface 301 \narea, bedforms area and slides. The smooth surface is nearly a flat surface located in the 302 \nsouthern part of the bank. Bedforms area are describe as a surface with different morphologies 303 \nas furrows,  scours and scarps located in the northern part as well as in the southern part of the 304 \nbank. Slides can be seen in the southern part close to bedforms areas.  305 \n 10\n 306 \n<heading1>Discussion 307 \nIn a general overview, the study area can be divided in two main domains: (1) outcrop and (2) 308 \ndrift, where the limit is about 1,100 m water depth.  309 \n(1) Outcrop is characterized by an irregular surface (due to tectonic activity  and erosion) with 310 \ncrests and escarpments trending predominantly W-E and lag deposits of coarse sands and 311 \npebbles-boulders that give the high backscatter with only small areas of true outcrop (C. 312 \nJacobs, Pers. Comm.). Smith et al. (2005) described this area as a bedrock surface composed 313 \nby flood basalts which were dated by McInroy et al. (2006) as late Palaeocene although in 314 \nsome areas may be Palaeogene and younger rocks. In places flood basalts are absent and the 315 \nunderlying Mesozoic sediments are imaged on seismic data (Hitchen 2004). Within the 316 \noutcrop area many ridges (constructional basalt scarps originated probably by faults in depth) 317 \nmay owe their origin to compressional tectonics (Tuitt 2009) and conical mounds (individual 318 \nor clustered) superimposed (10-25 m high) have been observed in this study. The mounds of 319 \nHatton Bank bear a strong resemblance, albeit smaller in size, to features reported in the 320 \nPorcupine Seabight (Bailey et al. 2003) and at the southern end of the Rockall Bank (Van 321 \nWeering et al. 2003) and proven to be bioclastic accumulations sustained by the growth of 322 \ncold water corals. Small mounds on the crest of Hatton Bank are principally comprised of 323 \nLophelia pertusa (Roberts et al. 2008). The bare rock surface provided by the ridges has been 324 \nopportunistically exploited by the corals leading to the development of the mounds. Ridges 325 \nhave been linked with cold-water corals in this area as a suitable substratum to their growth. 326 \nMany samples of cold-water corals have been collected on the ridges under the Ecovul-Arpa 327 \nproject and they demonstrate the presence of alive and dead corals. The mounds bulk 328 \nprobably comprises dead cold-water corals that provide the platform for further growth of 329 \ncorals. Ridges act as barriers forming ponded deposits infilling and surrounding the uneven 330 \nsurface. These deposits result from the alongslope and downslope movement of sediment 331 \nwhich becomes trapped in the irregular surface. The deposits consist of drift sediment and 332 \ncoral rubble derived from the adjacent ridges and mounds. At these locations, there is the 333 \npotential to preserve the oceanographic record that is absent from the rest of the outcrop area. 334 \n(2) The depositional area is dominated by the Hatton Drift which is located on the lower and 335 \nmiddle-western slope of Hatton Bank. It is a contouritic deposit composed mainly of mud and 336 \nsand (Stow and Lovell 1979) and was classified by McCave and Tucholke (1986) and 337 \nFaugères et al. (1993; 1999) as a \"plastered drift\" which is deposited on the slope of Hatton 338 \nBank. The structural, textural and compositional attributes of the drift sediments were 339 \n 11\ndescribed, by Stow and Holbrook (1984), in two parts: (a) those deposited prior to the onset of 340 \nnorthern hemisphere glaciation, and (b) those deposited during the glacial-interglacial cycles. 341 \nThe overall morphology of the Hatton Drift and the differential rates and thickness of 342 \nsediment accumulation have been influenced by bottom currents since early Eocene times 343 \n(Stow and Holbrook, 1984). However, strong bottom currents at first prevented any 344 \nsignificant deposition and it was only after mid-Miocene time that drift accumulation began. 345 \nIn the NE Atlantic Ocean, sediment drifts have contrasting styles which most probably reflect 346 \nthe interaction between a variable bottom-current regime and the complex bathymetry of the 347 \ncontinental margin (Stoker et al. 1998). The drift can be observed in the study area with 348 \ndifferent seabed morphologies which have the main origin in the activity of bottom currents. 349 \nSo, there are areas with smooth surface in contrast with other areas with several kinds of 350 \nbedforms due to the interaction between the bottom current contouring the topography of the 351 \nbank which cause change of direction in the main current flow. The upslope walls of the 352 \nfurrows show usually higher gradient than downslope walls which have the origin in the 353 \ninteraction between the flow and the slope configuration that prompt greater erosion on 354 \nupslope walls. Besides, the drift sediments moving up-and-down slope covering, in some 355 \nplaces, the outcrop and forming ponded sediments which are trapping by the ridges.  356 \n 357 \nA variety of current-induced bedform types provide further information on the bottom-current 358 \nregime (e.g. Kuijpers et al. 2002). So, in the southernmost part of the bank, the sediment drift 359 \nexhibits differences in seabed morphology (smooth area\/ bedforms area and slides) at water 360 \ndepths shallower and deeper than 1,400–1,500 m which link with the lower limit to the 361 \nLabrador Sea Water proposed by Hunter et al. (2007) to the Iceland Basin and the permanent 362 \nthermocline described by Due et al. (2006) in the western flank of Hatton Bank. Labrador Sea 363 \nWater transports sediments north-eastwards along the western slope of Hatton Bank 364 \n(McCartney 1992; Due et al. 2006; MacLachlan et al. 2008). In addition, according to Bianchi 365 \nand McCave (2000), the Lower Deep Water travels towards the north, from the south part of 366 \nHatton Bank until approx. 58–59ºN where it turns to the west as shown by the orientation of 367 \nthe furrows and other seabed features (Fig. 8). The bedform area (south 59ºN), rich in furrows 368 \nand scours, may reflect an intensification of the Lower Deep Water as it turns westward 369 \nowing to a topographic bulge in the slope of Hatton Bank at ~58.5ºN. However, the presence 370 \nof another bedform area and another slide northward (59–59.5ºN) on the slope of Hatton Bank 371 \nsuggests that, at least, some of the Lower Deep Water could return to the slope of the bank 372 \nnorth of the bulge.  373 \n 12\nThe contourite-packages boundary and the moats are found along the length of Hatton Bank 374 \n(Fig. 8)  having been mapped in water depths ranging from 1,000 to 1300 m, which match 375 \nwith the fact of McCartney (1992) found some of Labrador Sea Water ~ 1,000 m water depth. 376 \nIn this work, we propose the upper limit of the Labrador Sea Water at 1,000-1,300 m water 377 \ndepth depending of the topography of the slope. The upper boundary of the Labrador Sea 378 \nWater could provide a limit to the upslope migration of the drift on the western slope of 379 \nHatton Bank. 380 \nDifferent morphologies of the contourite deposits indicate erosion which has excavated the 381 \noriginal furrows and truncated the reflectors within the exposed bedrock side of the moats that 382 \nsuggest periods of strong bottom-current erosion followed by reduced-strength currents which 383 \nare responsible for the present-day infilling of the furrows and the constructive drift 384 \nboundaries seen in the contourite-packages boundary and moats. Within this context it should 385 \nbe noted that various bedforms might result from extreme current events in the past and thus 386 \ndo not necessarily reflect present-day current conditions (Due et al. 2006). 387 \n 388 \nIn the northern part of Hatton Bank, where the bank is orientated W–E, the morphological 389 \nfeatures are typically shallower than in the southern part. This could reflect a shallowing of 390 \nthe oceanographic currents northwards or a change in the current regime. Likewise, 391 \nMacLachlan et al. (2008) show an area in the northern part of Hatton Bank which has a wide 392 \nvariety of bedforms (sediment waves, furrows and moats), reflecting a complex bottom 393 \ncurrent flow from the east (occasional overflow events of Iceland-Scotland Overflow Water 394 \ntravelling toward south from the Faeroe Bank Channel) in contrast to the Deep Northern 395 \nBoundary Current. This current activity is occurring at a shallower level than in the 396 \nsouthernmost part of the bank with the resultant bedforms developed higher up the outer 397 \nslope. Furthermore, wave fields could be originated by an opposite flow (referenced to the 398 \nmain direction current) occur on the drift-flank of the moats close by the area where the 399 \nadjacent outcrop change the direction creating a reversed flow. 400 \n 401 \nIn addition, gravitational processes have been identified in the study area. Most notable are 402 \nthe Talismán Slide (Sayago-Gil et al.2009) clearly seen on the sea bed at the southern part of 403 \nHatton Bank (Fig. 8) and the buried slide previously noted by MacLachlan et al. (2008), both 404 \noccurring within the acoustically well-layered drift sequences. Talismán Slide shows only the 405 \nthinnest post-slide veneer of sediments on top which could imply a recent age, although this is 406 \nhighly dependent on sedimentation rate. The original dimensions of the buried slide may have 407 \n 13\nbeen greater but have been reduced due to partial infilling of the feature. Failures of slopes 408 \ndetached of the emerged land are rarely reported. A range of trigger mechanism is plausible 409 \nand could include a combination of several causative factors. Changes in current regime may 410 \nerode the base of the drifts thereby removing support at the base of slope (Sayago-Gil et al. 411 \n2009). Alternatively increases in sedimentation at the top of the slope may overload the upper 412 \npart of the drift. Fluids, including gas, may facilitate movement in response to ground 413 \nacceleration (due to earthquakes) although there is no clear evidence for shallow gas on the 414 \nwestern side of Hatton Bank. Despite difficulties in detecting low seismic activity in Hatton 415 \nBank area from land based seismometers, earthquakes have been recorded. Two events have 416 \nbeen detected in recent years (1998 on Hatton Bank and 1999 on Lousy Bank) to show that 417 \nalthough this is a passive margin, it is not aseismic (Simpson and Ford 1999; Simpson et al. 418 \n2000) corroborating intra-plate seismic activity. The presence of two similar-sized slides on 419 \nthe outer slope of Hatton Bank suggests episodic repetition of conditions required to trigger 420 \nslope failure. 421 \n 422 \nThe depressions  on the seabed south of the Talismán Slide could be related to fluid escape 423 \n(including gas) but they are larger (1 km diameter by 20 m depth) than pockmarks commonly 424 \nreported for other continental margins along NE Atlantic Ocean (Paull et al. 2008; Fernández-425 \nPuga et al. 2007). However, Hammer et al. (2009), describe an upstream convergence of flow 426 \nlines followed by upwelling over the pockmark which could explain the 427 \npresence\/maintenance of these depressions in the absence of fluid or gas seepage. 428 \n 429 \nAt the southern end of the study area, rock outcrops (Fig. 8) differ from the rest of the margin. 430 \nThis may reflect strong currents or lack of sediment supply. Higher up the bank, the seabed 431 \nimage shows several, partially infilled downslope gullies. These may have been cut during 432 \nperiods of lower sea level, at glacial maxima, when alongslope currents were reduced. The 433 \npartial infill appears to be derived from the northwest, which is contrary to the present 434 \nregional current regime, but which may reflect the scarcity of geophysical profiles in the area.  435 \n 436 \nHowever, there is uncertainty concerning some of the features and further seismic profiling 437 \nand ground-truthing by shallow coring as well as other oceanographic data (as for example 438 \nCTDs and current-meters) are required to elucidate the sedimentary history and current 439 \nregime. 440 \n 441 \n 14\n<heading1>Conclusions 442 \n1. Interpretation of the multibeam and shallow seismic data has identified morphological 443 \nfeatures that can be attributed to the Labrador Sea Water and Lower Deep Water 444 \nboundaries between them suggestive of a complex oceanographic regime. This limit could 445 \nbe located at 1,400-1,500 m water depth which would be the lower limit of the Labrador 446 \nSea Water and the upper limit of the Lower Deep Water. In addition, the upper boundary 447 \nof the Labrador Sea Water could be at 1,000-1,300 m water depth and provide a limit to 448 \nthe upslope migration of the Hatton Drift. More oceanographic data are necessary to 449 \nconfirm the exact water masses affecting to the western slope of Hatton Bank. 450 \n2. The Lower Deep Water was described travelling toward north until ~58.5ºN where the 451 \nbulge of the bank is. This work proposes that the Lower Deep Water could return to the 452 \nslope north of the bulge ~59–59.5ºN. 453 \n3. The erosion features and present-day infilling deposits suggest periods of strong bottom-454 \ncurrent erosion followed by reduced-strength currents. So, the present morphology of the 455 \nwestern slope of Hatton Bank can be due to past events and does not necessarily reflect 456 \nthe present-day current conditions. 457 \n4. This work extends the geographical extent where cold corals have been mapped on Hatton 458 \nBank in the ridges area until ~ 1,500 m water depth. 459 \n 460 \nAcknowledgements 461 \nThis work was supported by the Ecovul\/Arpa project, Instituto Español de Oceanografía IEO 462 \nand Secretaría General del Mar, Spain. Thanks are due to IEO for multibeam bathymetry and 463 \nTopas seismic profiles and to the British Geological Survey for airgun and sparker seismic 464 \nprofiles. DL and KH publish with the permission of the Executive Director of the British 465 \nGeological Survey (NERC). We are grateful for the comments and suggestions of C.L. 466 \nJacobs, G.M. Elliot and M.T. Delafontaine who reviewed the manuscript. 467 \n 468 \nReferences 469 \nBailey W, Shannon PM, Walsh JJ, Unnithan V (2003) The spatial distribution of faults and 470 \ndeep sea carbonate mounds in the Porcupine Basin, offshore Ireland. Mar Petrol Geol 471 \n20:509–522 472 \nBianchi GG, McCave IN (2000) Hydrography and sedimentation under the deep western 473 \nboundary current on Björn and Gardar Drifts, Iceland Basin. Mar Geol 165:137–169 474 \n 15\nDue L, Van Aken HM, Boldreel LO, Kuijpers A (2006) Seismic and oceanographic evidence 475 \nof the present-day bottom-water dynamics in the Lousy Bank-Hatton Bank area, NE 476 \nAtlantic. Deep Sea Res I 53:1729–1741 477 \nFaugères JC, Mézerais ML, Stow DAV (1993) Contourite drift types and their distribution in 478 \nthe North and South Atlantic Ocean Basins. Sed Geol 82:189–203 479 \nFaugères JC, Stow DAV, Imbert P, Viana AR (1999) Seismic features diagnostic of 480 \ncontourite drifts. Mar Geol 162:1–38 481 \nFernández-Puga MC, Vázquez JT, Somoza L, Díaz-del-Río V, Medialdea T, Mata MP, León 482 \nR (2007) Gas-related morphologies and diapirism in the Gula of Cádiz. Geo-Mar Lett 483 \n27:213–221 484 \nHammer O, Webb KE, Depreiter D (2009) Numerical simulation of upwelling currents in 485 \npockmarks, and data from the Inner Oslofjord, Norway. Geo-Mar Lett 29:269–275 486 \nHernández-Molina FJ, Maldonado A, Stow DAV (2008) Abyssal plain contourites. In: 487 \nRebesco M, Camerlenghi A (eds) Contourites. Developments in Sedimentology, 60, pp. 488 \n345–378 489 \nHitchen K (2004) The geology of the UK Hatton-Rockall margin. Mar Petrol Geol 21:993–490 \n1012 491 \nHollister CD, Heezen BC (1972) Geological effects of the ocean bottom currents: Western 492 \nNorth Atlantic. In: Gordon AL (eds) Studies in Physical Oceanography. Gordon and 493 \nBreach, New York, Vol. 2, pp. 37-66 494 \nHuizhong W, McCave IN (1990) Distinguishing climatic and current effects in mid-495 \nPleistocene sediments of Hatton and Gardar Drifts, NE Atlantic. J Geol Soc Lond 496 \n147:373–383 497 \nHunter S, Wilkinson D, Louarn E, McCave N, Rohling E, Stow DAV, Bacon S (2007) Deep 498 \nwestern boundary current dynamics and associated sedimentation on the Eirik Drift, 499 \nSouthern Greenland Margin. Deep Sea Res I 54:2036–2066 500 \nJohnson H, Ritchie JD, Hitchen K, McInroy DB, Kimbell GS (2005) Aspects of the Cenozoic 501 \ndeformational history of the Northeast Faroe-Shetland Basin, Wyville-Thomson Ridge 502 \nand Hatton Bank areas. In: Doré AG, Vining BA (eds) Petroleum geology: north-west 503 \nEurope and global perspectives. Proc of the 6th Petroleum Geology Conf., 6–9 October 504 \n2003, Geol Soc Lond,  pp 993–1007 505 \nKimbell GS, Ritchie JD, Johnson H, Gatliff RW (2005) Controls on the structure and 506 \nevolution of the NE Atlantic margin revealed by regional potential field imaging and 3D 507 \nmodelling. In: Doré AG, Vining BA (eds) Petroleum geology: north-west Europe and 508 \n 16\nglobal perspectives. Proc 6th Petroleum Geology Conf., 6–9 October 2003, Geol Soc 509 \nLond,  pp 933–945 510 \nKuijpers A, Hansen B, Hühnerbach V, Larsen B, Nielsen T, Werner F (2002) Norweian Sea 511 \noverflow through the Faeroe-Shetland gateway as documented by its bedforms. Mar 512 \nGeol 188: 147–164 513 \nMacLachlan SE, Elliot GM, Parson LM (2008) Investigations of the bottom current sculpted 514 \nmargin of Hatton bank, NE Atlantic. Mar Geol 253:170–184 515 \nMasson DG, Wynn RB, Bett BJ (2004) Sedimentary environment of the Faeroe-Shetland 516 \nChannel and Faeroe Bank channels, NE Atlantic, and the use of bedforms as indicators 517 \nof bottom current velocity in the deep ocean. Sedimentology 51: 1-35 518 \nMcCartney MS (1992) Recirculating components to the deep boundary current of the northern 519 \nNorth Atlantic. Progr Oceanogr 29:283–383 520 \nMcCave IN, Tucholke BE (1986) Deep-current controlled sedimentation in the Western North 521 \nAtlantic. In: Vogt PR, Tucholke BE (eds) The geology of North America, The Western 522 \nNorth Atlantic Region, Decade of North American Geology. Geol Soc Am, Boulder, 523 \nVol M. pp 451–467 524 \nMcCave IN, Lonsdale PF, Hollister CD, Gardner WD (1980) Sediment transport over the 525 \nHatton and Gardar contourite drifts. J Sed Petrol 50(4):1049–1062 526 \nMcInroy DM, Hitchen K, Stoker MS (2006) Potencial Eocene and Oligocene stratigraphic 527 \ntraps of the Rockall Plateau, NE Atlantic Margin. In: Allen MR, Goffey GP, Morgan 528 \nRK, Walker IM (eds). The Deliberate Search for the Stratigraphic Trap. Geol Soc Lond, 529 \nSpecial Publications, 254: 247–266 530 \nMcInroy DM, Hitchen K (2008) Geological evolution and hydrocarbon potential of the 531 \nHatton Basin (UK sector), north-east Atlantic Ocean. In: Brown DE (eds) Ext Abstr Vol 532 \n38. Central Atlantic Conjugate Margins Conf, 13–15 August 2008, Halifax, Canada. 533 \nDalhousie University, Halifax, Nova Scotia. ISBN: 0-9810595-2 534 \n Paull CK, Ussler III W, Holbrook WS, Hill TM, Keaten R, Mienert J, Haflidason H, Johnson 535 \nJE, Winters WJ, Lorenson TD (2008) Origin of pockmarks and chimney structures on 536 \nthe flanks of the Storegga Slide, offshore Norway. Geo-Mar Lett 28:43–51 537 \nRoberts D, Bishop DG, Laughton AS, Ziolkowski AM, Scrutton RA, Matthews DH (1970) 538 \nNew sedimentary basin on Rockall Plateau. Nature 225:170–172 539 \nRoberts JM, Henry LA, Long D, Hartley JP (2008) Cold-water coral reef frameworks, 540 \nmegafauna communities and evidence for coral carbonate mounds on the Hatton Bank, 541 \nnorth east Atlantic. Facies 54:297–316 542 \n 17\nRuddiman WF (1972) Sediment redistribution on the Reykjanes Ridge: seismic evidence. 543 \nGeol Soc Am Bull 83:2039–2062 544 \nSayago-Gil M, Long D, Fernández-Salas LM, Hitchen K, López-González N, Díaz-del-Río 545 \nV, Durán-Muñoz P (2009, In Press) Geomorphology of the Talismán Slide (Western 546 \nslope of Hatton Bank, NE Atlantic Ocean). In: Mosher et al. (eds), Subamrine Mass 547 \nMovements and Their Consequences, Advances in Natural and Technological Hazards 548 \nResearch, 28:277–288 549 \nSimpson BA, Ford GD (1999) NW Scotland Offshore Seismicity: Third Annual report to 31 550 \nMarch. Br Geol Surv Tech Rep no WL\/99\/24C 551 \nSimpson BA, Ford GD, Walker AB (2000) NW Scotland Offshore Seismicity: Fourth Annual 552 \nreport to 31 March. Br Geol Surv Tech Rep no CR\/00\/24 553 \nSmith LK, White RS, Kusznir NJ (2005) Structure of the Hatton Basin and adjacent 554 \ncontinental margin. In: Doré AG, Vining BS (eds) Petroleum geology: north-west 555 \nEurope and global perspectives. Proc 6th Petroleum Geology Conf., 6–9 October 2003, 556 \nGeol Soc Lond, pp 947–956 557 \nStoker MS, Akhurst MC, Howe JA, Stow DAV (1998) Sediment drifts and contourites on the 558 \ncontinental margin off northwest Britain. Sed Geol 115:33–51 559 \nStoker MS, Praeg D, Shannon PM, Hjelstuen BO, Laberg JS, Nielsen T, van Weering TCE, 560 \nSejrup HP, Evans D (2005) Neogene evolution of the Atlantic continental margin of 561 \nNW Europe (Lofoten Islands to SW Ireland): anything but passive. In: Doré AG, Vining 562 \nBA (eds) Petroleum geology: north-west Europe and global perspectives. Proc of 6th 563 \nPetroleum Geology Conf, 6–9 October 2003, Geol Soc Lond, pp 1057–1076  564 \nStow DAV, Holbrook JA (1984) Hatton Drift contourites, northeast Atlantic, Deep Sea 565 \nDrilling project LEG 81. In: University of Edinburgh Report no 25, pp 695–699 566 \nStow DAV, Hunter S, Wilkinson D, Hernández-Molina FJ (2008) Te nature of contourite 567 \ndeposition. In: Rebesco M, Camerlenghi A (eds) Contourites. Developments in 568 \nSedimentology, 60, pp. 143–156 569 \nStow DAV, Lovell JPB (1979) Contourites: their recognition in modern and ancient 570 \nsediments. Earth Sci Rev 14:251–291 571 \nTuitt A (2009) Timing and controls of structural inversion in the NE Atlantic Margin. 572 \nUnpublished PhD thesis. University of Edinburgh, UK 573 \nVan Aken HM (1995) Mean currents and current variability in the Iceland Basin. J Sea Res 574 \n33(2):135–145 575 \n 18\nVan Aken HM (2000) The hydrography of the mid-latitude northeast Atlantic Ocean I: the 576 \ndeep water masses. Deep Sea Res I 47:757–788 577 \nVan Weering TCE, de Haas H, de Stigter HC, Lykke-Andersen H, Kouvaev I (2003) 578 \nStructure and development of giant carbonate mounds at the SW and SE Rockall 579 \nTrough margins, NE Atlantic Ocean. Mar Geol 198:67–81 580 \nWeaver PPE, Wynn RB, Kenyon NH, Evans J (2000) Continental margin sedimentation, with 581 \nspecial reference to the north-east Atlantic margin. Sedimentology 47(1):239–256 582 \n 19\n 20\nCaptions \nFig. 1 Locality map showing the study area along the north-western margin of the Rockall \nPlateau, as well as the regional bathymetry and present-day bottom current circulation \n(arrows). HB Hatton Bank, RB Rockall Bank, HRB Hatton-Rockall Basin, GBB George Bligh \nBank, FBC Faeroe Bank Channel, IB Iceland Basin. ISOW Iceland-Scotland Overflow Water, \nAABW Antarctic Bottom Water, LDW Lower Deep Water, LSW Labrador Sea Water, DNBC \nDeep Northern Boundary Current (based on McCave et al. 1980; McCartney 1992; Stoker et \nal. 1998; Bianchi and McCave 2000; Hassold et al. 2006; McLachlan et al. 2008; regional \nbathymetry from GEBCO-General Bathymetry Chart of the Oceans) \n \nFig. 2 a Locations of data collection for hill-shade bathymetric imagery and seismic profiling. \nPurple lines Sparker\/airgun seismic profiles, red lines Topas seismic profiles. b Topas \nseismic section in the southern part of the study area, showing the sedimentary set increasing \nbasinwards, and onlaping upslope as a wedge with well-stratified layers \n \nFig. 3 a Map showing the two main domains identified in the study area: outcrop and drift. \nBlack line marks the limit between northern (W-E orientation) and southern (SW-NE \norientation) part of the bank based on the change of the main trend of the slope. b Map \nshowing the variations in slope recorded in the study area, based on multibeam bathymetry \ndata. c Large-scale sketch illustrating the main morphologic areas identified on this work. \nAlso indicated are the locations of selected datasets shown in more detail in Fig. 4, 5, 6 and 7 \n \nFig. 4 Selected datasets showing examples of hill-shade bathymetry and vertical depth \nprofiles (location on bathymetry image) used to identify the main morphological features of \nthe study area: a moat (arrow indicates moat axis), b furrow, c scours (arrows indicate scours \naxis) \n \nFig. 5 Selected datasets showing examples of hill-shade bathymetry and vertical depth \nprofiles (location on bathymetry image) used to identify the main morphological features of \nthe study area: a wave field, b contourite-packages boundary (arrow indicates the seabed \naffected by the limit between two different contourite deposits), c ponded deposits (arrows \nindicating the deposits against ridges) \n \n 21\nFig. 6 Selected datasets showing examples of hill-shade bathymetry and vertical depth \nprofiles (location on bathymetry image) used to identify the main morphological features of \nthe study area: a scarps (arrows indicate the gradient changes), b gullies, c ridges (arrows \nindicate barriers axis with mounds on top), d depressions (arrows indicate hollows) \n \nFig. 7 Hill-shade bathymetry, 3D image and topas seismic section (location on bathymetry \nimage) of the Talismán Slide identified in southern part of the study area \n \nFig. 8 a Large-scale sketch presented in figure 3 illustrating the seabed morphologic details in \nthe northern (b) and southern (c, d) parts of the Hatton Bank. Morphological features of the \nmain areas describe in this work can be observed in detail in b, c, d. The outcrop area (a) is \ncharacterized by an uneven surface with crest and scarps (b, c, d) and the ridges area can be \nseen with ponded deposits associated (b).  The smooth surface (a) is nearly a flat surface \nlocated in the southern part of the bank (b, c, d). Bedforms area (a) are describe as a surface \nwith different morphologies as furrows,  scours and scarps (b, c, d) located in the northern \npart as well as in the southern part of the bank. Slides (a) can be seen in the southern part (c, \nd) close to bedforms areas. The slide located in d is the Talismán Slide describe in this work. \n 22\n \nFig.1 \n \nFig.2 \n 23\n \nFig.3 \n 24\n \nFig.4 \n 25\n \nFig.5 \n 26\n \nFig.6 \n 27\n \nFig.7 \n 28\n \nFig.8 \n"}