{"doi":"10.1007\/s00345-009-0496-8","coreId":"177227","oai":"oai:aura.abdn.ac.uk:2164\/1043","identifiers":["oai:aura.abdn.ac.uk:2164\/1043","10.1007\/s00345-009-0496-8"],"title":"The clinical effectiveness of transurethral incision of the prostate : a systematic review of randomised controlled trials","authors":["Lourenco, Tania","Shaw, Matthew","Fraser, Cynthia Mary","MacLennan, Graeme Stewart","N'Dow, James Michael Olu","Pickard, Robert"],"enrichments":{"references":[{"id":188024,"title":"A criteria list for quality assessment of randomized clinical trials for conducting systematic reviews developed by Delphi Consensus.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":426937,"title":"Bladder neck incision or transurethral electroresection for the treatment of urinary obstruction caused by a small benign prostate? A randomized urodynamic study.","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":426944,"title":"Bladder neck resection and transurethral resection of the prostate: a randomized prospective trial.","authors":[],"date":"1987","doi":null,"raw":null,"cites":null},{"id":188018,"title":"Concomitant longitudinal changes in frequency of and bother from lower urinary tract symptoms in community dwelling men.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":188019,"title":"Ek A","authors":[],"date":"1985","doi":null,"raw":null,"cites":null},{"id":188022,"title":"Grant A","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":426945,"title":"Lasers as an alternative to the endoscopic surgery in BPH.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":426941,"title":"Objective and subjective comparison of transurethral resection, transurethral incision and balloon dilatation of the prostate. A prospective study.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":426943,"title":"Prajsner A","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":188023,"title":"Systematic Reviews (2008). CRD’s guidance for undertaking reviews in health care. Centre for Reviews and Dissemination,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":188020,"title":"The effect of prostatectomy on symptom severity and quality of life.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":188025,"title":"The feasibility of creating a checklist for the assessment of the methodological quality both of randomised and non-randomised studies of health care interventions.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":188017,"title":"The prevalence of lower urinary tract symptoms in men and women in four centres. The UrEpik study.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":188021,"title":"The results of prostatectomy: a symptomatic and urodynamic analysis of 152 patients.","authors":[],"date":"1979","doi":null,"raw":null,"cites":null},{"id":426938,"title":"Transurethral incision versus resection of the prostate for small to medium benign prostatic hyperplasia.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":426942,"title":"Transurethral incision versus transurethral resection of the prostate. A subjective and objective analysis.","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":426936,"title":"Transurethral prostatectomy compared with incision of the prostate in the treatment of prostatism caused by small benign prostate glands.","authors":[],"date":"1992","doi":null,"raw":null,"cites":null},{"id":426939,"title":"Transurethral prostatotomy versus transurethral prostatectomy in benign prostatic hypertrophy. A prospective randomised study.","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":426940,"title":"Transurethral resection versus incision of the prostate: a randomized, prospective study.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":188026,"title":"Transurethral resection versus transurethral incision of the prostate. A prospective randomized study.","authors":[],"date":"1990","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":["University of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Applied Health Sciences","University of Aberdeen, Academic Urology Unit","University of Aberdeen, Institute of Applied Health Sciences"],"datePublished":"01-02-20","abstract":"The original publication is available at www.springerlink.com.Peer reviewedPostprin","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:aura.abdn.ac.uk:2164\/1043<\/identifier><datestamp>\n                2018-01-19T18:23:05Z<\/datestamp><setSpec>\n                com_2164_320<\/setSpec><setSpec>\n                com_2164_319<\/setSpec><setSpec>\n                com_2164_318<\/setSpec><setSpec>\n                com_2164_632<\/setSpec><setSpec>\n                com_2164_364<\/setSpec><setSpec>\n                com_2164_330<\/setSpec><setSpec>\n                com_2164_705<\/setSpec><setSpec>\n                col_2164_321<\/setSpec><setSpec>\n                col_2164_633<\/setSpec><setSpec>\n                col_2164_706<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nThe clinical effectiveness of transurethral incision of the prostate : a systematic review of randomised controlled trials<\/dc:title><dc:creator>\nLourenco, Tania<\/dc:creator><dc:creator>\nShaw, Matthew<\/dc:creator><dc:creator>\nFraser, Cynthia Mary<\/dc:creator><dc:creator>\nMacLennan, Graeme Stewart<\/dc:creator><dc:creator>\nN'Dow, James Michael Olu<\/dc:creator><dc:creator>\nPickard, Robert<\/dc:creator><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Applied Health Sciences<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Academic Urology Unit<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Institute of Applied Health Sciences<\/dc:contributor><dc:subject>\nBenign prostate enlargement<\/dc:subject><dc:subject>\nTransurethral incision of prostate<\/dc:subject><dc:subject>\nTransurethral resection of prostate<\/dc:subject><dc:subject>\nMeta-analysis<\/dc:subject><dc:subject>\nSystematic review<\/dc:subject><dc:subject>\nURINARY-TRACT SYMPTOMS<\/dc:subject><dc:subject>\nBLADDER NECK INCISION<\/dc:subject><dc:subject>\nSMALL BENIGN PROSTATE<\/dc:subject><dc:subject>\nRESECTION<\/dc:subject><dc:subject>\nQUALITY<\/dc:subject><dc:subject>\nHYPERTROPHY<\/dc:subject><dc:subject>\nHYPERPLASIA<\/dc:subject><dc:subject>\nOBSTRUCTION<\/dc:subject><dc:subject>\nMEN<\/dc:subject><dc:subject>\nRD Surgery<\/dc:subject><dc:subject>\nRD<\/dc:subject><dc:description>\nThe original publication is available at www.springerlink.com.<\/dc:description><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPostprint<\/dc:description><dc:date>\n2011-02-02T08:50:32Z<\/dc:date><dc:date>\n2011-02-02T08:50:32Z<\/dc:date><dc:date>\n2010-02<\/dc:date><dc:date>\n01-02-20<\/dc:date><dc:type>\nJournal article<\/dc:type><dc:identifier>\nLourenco , T , Shaw , M , Fraser , C M , MacLennan , G S , N'Dow , J M O & Pickard , R 2010 , ' The clinical effectiveness of transurethral incision of the prostate : a systematic review of randomised controlled trials ' World Journal of Urology , vol 28 , no. 1 , pp. 23-32 . DOI: 10.1007\/s00345-009-0496-8<\/dc:identifier><dc:identifier>\n0724-4983<\/dc:identifier><dc:identifier>\nPURE: 1157208<\/dc:identifier><dc:identifier>\nPURE UUID: d89be0e3-0d3d-4efb-bb34-d4d0dfa642a7<\/dc:identifier><dc:identifier>\nWOS: 000273813100005<\/dc:identifier><dc:identifier>\nScopus: 75849123865<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2164\/1043<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1007\/s00345-009-0496-8<\/dc:identifier><dc:language>\neng<\/dc:language><dc:relation>\nWorld Journal of Urology<\/dc:relation><dc:format>\n10<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0724-4983","0724-4983"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["World Journal of Urology"],"year":1,"topics":["Benign prostate enlargement","Transurethral incision of prostate","Transurethral resection of prostate","Meta-analysis","Systematic review","URINARY-TRACT SYMPTOMS","BLADDER NECK INCISION","SMALL BENIGN PROSTATE","RESECTION","QUALITY","HYPERTROPHY","HYPERPLASIA","OBSTRUCTION","MEN","RD Surgery","RD"],"subject":["Journal article"],"fullText":" 1 \nThis is the author version of an article originally published in  \nWorld Journal of Urology 2010;28(1):23-32. \nhttp:\/\/www.springerlink.com\/content\/l5042x96550407m5\/?p=aa95561773704ad99add75\n87e77e7450&pi=4 \nThe original publication is available at springerlink.com. \n \n \nThe clinical effectiveness of transurethral incision of the prostate – a systematic review of \nrandomised controlled trials \n \nTania Lourenco†*, Matthew Shaw‡*, Cynthia Fraser†, Graeme MacLennan†, James N’Dow§, Robert \nPickard‡ \n \n†Health Services Research Unit, Institute of Applied Health Sciences, University of Aberdeen, AB25 \n2ZD, United Kingdom \n‡Urology Research Group, Institute of Cellular Medicine, Newcastle University, NE2 4HH, United \nKingdom  \n§Urology Academic Unit, Institute of Applied Health Sciences, University of Aberdeen, AB25 2ZD, \nUnited Kingdom \n \nCorresponding author: \nEmail: tania.lourenco@abdn.ac.uk \nTelephone: +44 1224 559265 \nFax: +44 1224 554580 \n \n*Tania Lourenco and Matthew Shaw lead the writing of the final manuscript \nKey words: Benign prostate enlargement, transurethral incision of prostate, transurethral resection of \nprostate, meta-analysis, systematic review \n 2 \nABSTRACT \n \nPurpose: Transurethral incision of the prostate gland (TUIP) is perceived as a less morbid surgical \nalternative to standard transurethral resection of the prostate gland (TURP) for treatment of \nsymptomatic mild to moderate benign prostate enlargement (BPE). We aimed to evaluate comparative \nclinical effectiveness of the two procedures. \nMethods: Systematic review and meta-analysis of short and long-term data from randomised \ncontrolled trials comparing TUIP with TURP. \nResults: This review considered data from 795 randomised participants across 10 RCTs of moderate to \npoor quality eight of which stated an upper limit for prostate size. No difference in the degree of \nsymptomatic improvement was seen between the two procedures. Improvement in peak urine flow rate \nwas lower for TUIP compared to TURP whilst the rate of blood transfusion and TUR syndrome was \nhigher after TURP. Urinary retention, urinary tract infection, strictures and incontinence did not differ \nbetween the two approaches, although clinically important differences could not be ruled out. TUIP \nwas associated with a shorter duration of operation and length of hospital stay but a higher re-operation \nrate. \nConclusion: TUIP and TURP appear to offer equivalent symptomatic improvement for men with mild \nto moderate BPE.  Choosing TUIP involves a trade-off between the lower risk of peri-operative \nmorbidity and the higher risk of subsequent re-operation. \n 3 \nINTRODUCTION \nLower urinary tract symptoms (LUTS) presumed due to clinical benign prostate enlargement (BPE) are \ncommon, affecting up to 40% of men over 70 years of age [1]. Long-term studies show the progressive \nnature of clinical BPE related to hyperplasia of the stromal and urothelial components of the gland with \nboth International Prostate Symptom Score (IPSS) and prostate volume increasing with age [2].  \n \nThe aim of treating BPE is to improve bothersome LUTS and associated quality of life, and to prevent \nor lessen complications such as urinary retention, infection and deteriorating renal function. Treatment \noptions range from self-monitoring of mild symptoms to drugs and on to surgical intervention. \n \nSurgical treatment of clinical BPE has evolved since the work of Guthrie in the 19th century [3] with \nthe development of various endoscopic techniques each with specific advantages and disadvantages; \ntwo such techniques are transurethral resection of prostate (TURP) involving diathermy resection of the \ninner component of the prostate gland, and transurethral incision of prostate (TUIP) involving \nlongitudinal incision of the prostate gland, allowing widening of the bladder neck and prostatic urethra \nwithout removal of prostate tissue.  Adverse effects associated with TURP such as bleeding, \ncardiovascular imbalance and sexual dysfunction have driven the search for less invasive alternatives \n[4].  TUIP has been trialled as a less morbid alternative for men with prostate glands < 30 ml in size, \nwith the suggested advantage of less bleeding and sexual dysfunction [5].  As part of a wide ranging \nreview of surgical treatments for BPE commissioned by the United Kingdom National Institute for \nHealth Research [6], we aimed to evaluate the comparative clinical effectiveness of TUIP against \nTURP by means of a systematic review of available randomised controlled trials (RCTs). \n 4 \nMETHODS \nSearching for the evidence  \nHighly sensitive electronic searches, using a combination of database-specific subject headings and text \nterms, were developed to identify published and unpublished reports of relevant RCTs evaluating the \neffectiveness of TUIP and TURP for BPE. Bibliographic databases searched including Medline, \nEmbase, Biosis, Science Citation Index, The Cochrane Library, and trials registers. All searches were \ncarried out during March 2006.  Recent conference proceedings (European Association of Urology, \nAmerican Urological Association and the British Association of Urological Surgeons) for the years \n2002-5 were also screened. Searches were not restricted by publication year or language. Reference \nlists of all included studies were scanned to identify additional potentially relevant studies.  Full details \nof the search strategies used have been published [6] or are available from the authors. The titles and \nabstracts of all papers identified by the search strategy were screened and full-text copies of all \npotentially relevant studies obtained. \n \nSelection and study characteristics \nIndividual RCTs of TUIP compared to TURP for BPE were included. Trials reporting men without a \nclinical diagnosis of BPE were excluded as well as comparisons against conservative management. The \npre-specified outcomes are listed in Table 1. Symptom scores measured by the IPSS, the American \nUrological Association Symptom Index (AUA), or Madsen-Iversen score were eligible. IPSS and AUA \nscores were considered equivalent and therefore trials using these instruments were combined. The \nIPSS\/AUA symptom questionnaire asks men to rate four voiding symptoms (poor stream, intermittent \nflow, straining, incomplete emptying) and three storage symptoms (frequency, nocturia, urgency) on a \nscale from 0 (not present) to 5 (severe) to give a total score ranging from 0 to 35, with symptom \nseverity defined as: mild (0-7), moderate (8-19) or severe (20-35). With Madsen-Iversen scores, \npatients are rated in terms of the quality of their urinary stream, straining to void, hesitancy, \nintermittency, bladder emptying, stress incontinence or post void dribbling, urgency, frequency, and \nnocturia on a scale from 0 to 4 to give a total score ranging from 0 to 27, with symptom severity \ndefined as: mild (<10), moderate (10-20) or severe (>20). All reports of pre-specified complications \nwere considered regardless of their timing. Bladder neck stenosis and urethral stricture were combined \nsince separate reporting of these complications was inconsistent. \n 5 \nQuality assessment strategy \nTwo reviewers, working independently, assessed the methodological quality of included studies using \nan assessment tool drawing on the schema suggested by the NHS Centre for Reviews and \nDissemination [7-9]. \n \nData extraction strategy \nThe titles and abstracts of all papers identified by the search strategy were screened. Two reviewers \nindependently assessed full-text copies of all potentially relevant studies and extracted data from the \nincluded studies. The two reviewers recorded details of methodology, interventions, participants’ \ncharacteristics and outcomes on a data extraction form. Those differences that could not be resolved \nthrough discussion were decided by an arbiter. Reviewers were not blinded to the names of the studies’ \nauthors, institutions or sources of the reports. \n \nData synthesis \nFor trials with multiple publications, only the most complete report for each outcome was included \n(Appendix). Meta-analysis was performed by combining dichotomous outcome data using the Mantel-\nHaenszel relative risk (RR) method and for continuous outcome data using the inverse variance \nweighted mean difference (WMD) method and 95% confidence intervals. Fixed effects models were \nused for all analyses except peak flow and symptom score where random effects were used due to \nvariability in reporting and statistical heterogeneity (assessed using I- and Chi-squared tests). Other \npossible reasons for heterogeneity were explored using sensitivity analyses. The meta-analyses were \nconducted using the standard Cochrane software RevMan 4.2.8. \n \nDue to the lack of uniformity of the data presented by many studies, a qualitative review looking for \nconsistency between studies was also performed. This was supplemented, where appropriate by \nconsidering the consistency in the direction of effects using the sign-test. \n 6 \nRESULTS \nWe assessed full-text copies of 621 published articles concerning TURP and TUIP to yield 10 RCTs \nmeeting inclusion criteria for the review which were published in 14 reports and described outcome in \n795 men recruited between 1985 and 1991, 392 of whom underwent TUIP and 403 TURP [10-22]. An \nupper limit of prostate size was explicitly stated as an entry criterion for eight studies with five < 30 ml \nand three < 60 ml.  \n \nQuality and characteristics of available evidence \nAll RCTs were of similar poor to moderate quality, with the majority failing to provide details about \nrandomisation, treatment allocation concealment and whether the analyses included an intention to treat \nanalysis (Table 2). The included data allowed comparison of 10 relevant outcomes involving 795 \nparticipants. Included studies varied in relation to settings and baseline characteristics of the patients, \nsuch as severity of the disease and prostate size (Table 3).   \n \nAssessment of effectiveness \nSymptom scores \nFive [11,13,15,16] studies provided information on symptom scores for patients at 12 months after \ntreatment. Four of these reported change in Madsen-Iversen scores, one reported IPSS scores [18]. \nLosses to follow-up were high in nearly all studies reporting 12 months follow-up. No clear pattern \nemerged (sign test, p < 0.375): three favoured TURP, one TUIP, and one showed no difference. Only \ntwo studies presented data in a form suitable to allow meta-analysis, which showed that the direction of \neffect was not consistent across the studies (IPSS: mean difference (MD) -1.00, 95% CI -1.73 to -0.27, \np = 0.007; Madsen-Iversen: MD 0.34, 95% CI -1.55 to 2.23). \n \nPeak Urine Flow rate \nAll five studies [11,13,14,16,17] that provided information on the mean or median peak urine flow rate \nfor patients 12 months after surgery reported lower (worse) mean or median peak urine flow rate \nfollowing TUIP (sign test p < 0.03). Synthesis of suitable data [16] showed that peak urine flow rate \nwas lower but this did not reach statistical significance (MD -2.71, 95% CI -5.77 to 0.35, p = 0.08). \n \n 7 \nMorbidity  \nSeven RCTs [11-14,17,19,20] provided information on need for blood transfusion. There were fewer \nblood transfusions following TUIP in all except one trial [12] reporting no transfusions in either group \n(Figure 1: 3\/266 (11%) versus 77\/272 (28%) RR = 0.06, 95% CI 0.03 to 0.16, p < 0.001). \n \nTUR syndrome information was reported in two studies [17,19]. No cases of a TUR syndrome were \nrecorded in patients undergoing TUIP. Conversely, 6.4% of the patients (all in one trial) allocated to \nTURP had TUR syndrome [17] (Figure 1: 0\/139 versus 7\/140, RR = 0.07, 95% CI 0.00 to 1.15, p = \n0.06). \n \nMeta-analysis of studies reporting data on urinary retention [13,14,15,19], urinary tract infection [17], \nstricture [11,12,14,15,17,19], and incontinence [14,17,19] showed that there were no statistically \nsignificant differences between TUIP and TURP (Figure 1). Clinically important differences could not \nbe ruled-out as the size and direction of effect varied across studies and the confidence intervals were \nwide. Also, definitions of strictures, incontinence and length of follow-up varied across studies. \n \nSeven studies [11,12,15-17,21] reported sexual dysfunction information. The risk of retrograde \nejaculation was lower for men following TUIP than after TURP (Figure 2: 46\/195 (23.5%) versus \n88\/189 (46.5%) RR 0.51, 95% CI 0.38 to 0.68, p < 0.001), whereas, there was no statistically \nsignificant difference in terms of erectile dysfunction between the two groups (Figure 2: 4\/119 (3.4% \nversus 6\/103 (5.8%), RR 0.61, 95% CI 0.17 to 2.20, p = 0.45). \n \nDescriptors of care \nSeven studies [11-15,17,19]  provided information on duration of operation and another seven studies \n[11,12,14,15,17,19,20] detailed length of hospital stay. In all studies duration of operation was shorter \nin the TUIP group (sign test p < 0.01). Two studies [12, 19] reported data suitable for synthesis and the \naverage duration of TUIP was 18.9 minutes shorter than TURP (Figure 3: 95% CI -24.13 to -13.67, p < \n0.001). Meta-analysis of two studies [12, 19] showed that the average length of hospital stay was also \nsignificantly shorter following TUIP (Figure 3: WMD -2.26, 95% CI -3.81 to -0.71, p = 0.004). Meta-\nanalysis of six trials showed that the need for re-operation was more common after TUIP than after \n 8 \nTURP [10,11,13-16] (Figure 3: 36\/196 (18.4% versus 14\/195 (7.2%), RR 2.40, 95% CI 1.37 to 4.21, p \n< 0.01). It should be noted that differences between studies in timing and completeness of follow-up \nmay have introduced bias and we have therefore tabulated data used for this analysis (Table 4).   \n \nDISCUSSION \nOur search strategy identified 621 articles concerning TURP and TUIP of which 14 reported data from \n10 RCTs.  The included subjects had mainly mild to moderate BPE. No clear evidence of superiority \nemerged on meta-analysis regarding our primary outcome of improvement in symptom score at 12 \nmonths but analysis was hampered by high drop-out rates and by only two trials reporting data in \nsuitable format.  Consideration of a further four trials was supportive of this finding with no consistent \npattern of relative effectiveness.  A single report found that equivalence of symptomatic benefit \npersisted for up to five years [13].  In contrast, TURP was clearly superior in terms of urodynamic \nimprovement with a consistent and statistically significant greater increase in peak urinary flow rate \n[10-17]. The equivalence of patient-reported outcome suggests that men with mild to moderate of BPE \nwould be content with the symptom improvement gained with TUIP.  Clinicians however are likely to \nhave some concerns regarding the inferior efficacy of the procedure in correcting bladder outlet \nobstruction. \n \nTo balance this concern, TUIP does demonstrate further advantages in terms of reduced co-morbidity \nand hospitalisation.  Blood transfusion rates are used as a proxy measure of blood loss and were \nsignificantly lower with TUIP.  It should be noted that subjects recruited for the included trials were all \ntreated prior to 1991.  Equipment, peri-operative care and standards of training for urologists \nperforming TURP have all improved over the past 20 years reflected in current transfusion rates of < \n2.5% [23].  Avoidance of TUR syndrome appears to be an advantage of TUIP since although a rare \ncomplication, it can be life-threatening [17,19]; it should be noted however that prostate size was not \nexplicitly reported by these studies. TUIP did not show advantage in terms of reducing the risk of \nlonger term adverse effects such as urinary incontinence, erectile dysfunction or stricture formation \nalthough reporting of these events was inconsistent and important differences could have been missed.  \nMeta-analysis did however confirm lower rates of ejaculatory dysfunction following TUIP with a 50% \nrisk reduction. This is likely to be an important issue for sexually active men with isolated bladder neck \n 9 \nhypertrophy, but this adverse effect does not seem to be bothersome for most men undergoing surgery \nfor BPE [24].   \n \nIn terms of treatment cost, TUIP shows benefit in terms of reducing operating time and hospital stay \nbut this must be balanced by increased expenditure due to the higher rate of re-operation in the longer \nterm.  Ideally these variables would need inclusion with effectiveness data in a formal analysis of cost-\neffectiveness to determine any overall advantage for TUIP.   \n \nIn broad terms, results from our systematic review and meta-analysis are in agreement with those \npublished in a previous study by Yang and colleagues [25]. Our review identified two additional \nstudies [18,20] and we were unable to include unpublished data that Yang and colleagues obtained \nfrom trial report Authors, but these differences in included data did not affect key findings such as \nequivalence of symptomatic improvement and superior urodynamic outcome for TURP.  In contrast to \nYang et al. [25], we found a significantly higher risk of re-operation following TUIP which, if truly \nreflective of outcome, would have an important bearing on cost-effectiveness.  Our decision to exclude \ndata from two trials [12,19] on pre-stated methodological criteria together with differences in statistical \nmethodology used for data synthesis may have contributed to this differing finding, and illustrate that \nassumptions made during systematic review can change conclusions. Increased re-operation rate \nfollowing TUIP is a factor that men deciding between the two techniques will have to trade off against \ndecreased risk of adverse effects.  For these reasons we feel that the present systematic review does \nprovide a value to the urological community by reinforcing the key findings of Yang and colleagues \nusing a different methodology and by clarifying potentially important differences such as re-operation \nrates.  This will be helpful for those charged with guideline development and makers of health policy.  \n \nWe used current recommended methodology for this review which included quality assessment of \nincluded trials.  As has been previously noted [25] trial quality in this area is variable although we do \nacknowledge the procedural difficulties in conducting and reporting comparative trials of surgical \ntreatments.  The majority of studies were conducted and reported prior to the formulation of \nCONSORT guidelines which may partly explain the wide variation in reporting practice and in \nparticular the fact that results concerning primary outcomes were generally reported in a format \n 10 \nunsuited to meta-analysis. A common failing with such trials is loss to follow-up which compromises \nthe certainty of comparative analysis of long-term outcome, a key measure in the study of treatment of \nchronic and recurring health problems such as BPE.  \n \nConclusion \nThis systematic review of available RCTs comparing TUIP and TURP for treatment of mild-moderate \nBPE has shown TUIP to give equivalent symptomatic improvement accompanied by a reduction in risk \nof adverse effects. Approximately 2,500 such procedures are carried out annually in England compared \nto about 25,000 TURP suggesting that it continues to be under-utilised [26]. Ideally an adequately \npowered, multi-centre RCT comparing TUIP and TURP should be performed but this is unlikely to be \nfunded due to the advancement of other technologies such as laser energy to more safely ablate the \nprostate together with the long follow-up required to assess reoperation rate.  It is possible however that \nthe procedure could be included in long-term ‘tracker’ trials linked to patient or clinician preference to \nbetter determine longer term clinical effectiveness and cost-effectiveness. \n 11 \nACKNOWLEDGEMENTS \nThe authors are grateful to Bronwyn Davidson for secretarial support.  \nWork on the review was funded by the United Kingdom National Institute for Health Research Health \nTechnology Assessment Programme (project number 04\/38\/03). The Health Services Research Unit is \ncore funded by the Chief Scientist Office of the Scottish Government Health Directorates. The views \nexpressed in this paper are those of the authors not the institutions providing funding. An extensive \nmonograph describing the whole project of which this analysis is a part is available for open access \n(Lourenco T, Armstrong N, N’Dow J, Nabi G, Deverill M, Pickard R, Vale L, Maclennan G, Fraser C, \nMcClinton S, Wong S, Coutts A, Mowatt G, Grant A. Systematic review and economic modelling of \neffectiveness and cost utility of surgical treatments for men with benign prostatic enlargement. Health \nTechnology Assessment 2008; 12: 1-516). \n \n \nCONFLICT OF INTEREST STATEMENT \nNone. \n     \n 12 \nREFERENCES \n \n1. Boyle P, Robertson C, Mazzetta C et al (2003) The prevalence of lower urinary tract \nsymptoms in men and women in four centres. The UrEpik study. BJU Int 92:409-414 \n2. Sarma AV, Jacobsen SJ, Girman CJ et al (2002) Concomitant longitudinal changes in \nfrequency of and bother from lower urinary tract symptoms in community dwelling men. U \nUrol 168:1446-1452 \n3. Hedlund H, Ek A (1985) Ejaculation and sexual function after endoscopic bladder neck \nincision. Br J Urol 57:164-167 \n4. Emberton M, Neal DE, Black N, Fordham M, Harrison M, McBrien MP, Williams RE, \nMcPherson K, Develin HB (1996) The effect of prostatectomy on symptom severity and \nquality of life. Br J Urol 77:233-237 \n5. Abrams PH, Farrar DJ, Turner-Warwick RT, Whiteside CG, Feneley RC (1979) The results of \nprostatectomy: a symptomatic and urodynamic analysis of 152 patients. J Urol 121:640-642 \n6. Lourenco T, Armstrong N, N’Dow J, Nabi G, Deverill M, Pickard R, Vale L, Maclennan G, \nFraser C, McClinton S, Wong S, Coutts A, Mowatt G, Grant A (2008) Systematic review and \neconomic modelling of effectiveness and cost utility of surgical treatments for men with \nbenign prostatic enlargement. Health Technology Assessment 12 (35).. \n7. Systematic Reviews (2008). CRD’s guidance for undertaking reviews in health care. Centre \nfor Reviews and Dissemination, University of York. ISBN-978-1-900640-47-3 \n8. Verhagen AP, de Vet HCW, de Bie RA, Kessels AGH, Boers M, Bouter LM, et al (1998) A \ncriteria list for quality assessment of randomized clinical trials for conducting systematic \nreviews developed by Delphi Consensus. J Clin Epidemiol 51:1235-41 \n9. Downs S, Black N (1998) The feasibility of creating a checklist for the assessment of the \nmethodological quality both of randomised and non-randomised studies of health care \ninterventions. Journal of Epidemiology & Community Health 52:377-84 \n10. Christensen MM, Aagaard J, Madsen PO (1990) Transurethral resection versus transurethral \nincision of the prostate. A prospective randomized study. Urol Clin North Am 17:621-30 \n 13 \n11. Dorflinger T, Jensen FS, Krarup T, Walter S (1992) Transurethral prostatectomy compared \nwith incision of the prostate in the treatment of prostatism caused by small benign prostate \nglands. Scand J Urol Nephrol 26:333-8 \n12. Hellstrom P, Lukkarinen O, Kontturi M (1986) Bladder neck incision or transurethral \nelectroresection for the treatment of urinary obstruction caused by a small benign prostate? A \nrandomized urodynamic study. Scand J Urol Nephrol 20:187-92 \n13. Jahnson S, Dalen M, Gustavsson G, Pedersen J (1998) Transurethral incision versus resection \nof the prostate for small to medium benign prostatic hyperplasia. Br J Urol 81:276-81 \n14. Nielsen HO (1988) Transurethral prostatotomy versus transurethral prostatectomy in benign \nprostatic hypertrophy. A prospective randomised study. Br J Urol 61:435-8 \n15. Riehmann M, Knes JM, Heisey D, Madsen PO, Bruskewitz RC (1995) Transurethral resection \nversus incision of the prostate: a randomized, prospective study. Urology 45:768-75 \n16. Saporta L, Aridogan IA, Erlich N, Yachia D (1996) Objective and subjective comparison of \ntransurethral resection, transurethral incision and balloon dilatation of the prostate. A \nprospective study. Eur Urol 29:439-45 \n17. Soonawalla PF, Pardanani DS (1992) Transurethral incision versus transurethral resection of \nthe prostate. A subjective and objective analysis. Br J Urol 70:174-7 \n18. Tkocz M, Prajsner A (2002) Comparison of long-term results of transurethral incision of the \nprostate with transurethral resection of the prostate, in patients with benign prostatic \nhypertrophy. Neurourol Urodyn 21:112-6 \n19. Li MK, Ng AS (1987) Bladder neck resection and transurethral resection of the prostate: a \nrandomized prospective trial. J Urol 138:807-9 \n20. Rodrigo Aliaga M, Valls Blasco F, Jimenez Cruz JF (1998) Lasers as an alternative to the \nendoscopic surgery in BPH. Actas Urol Esp 22:17-22 \n21. Talic RF, El Tiraifi A, El Faqih SR, Abdel-Halim RE (2000) A prospective randomized study \nof the thick loop and standard wire-loop in transurethral prostatectomy: One year follow-up. \nJournal of Endourology 14:A36  \n22. Zorn BH, Bauer JJ, Ruiz HE, Thrasher JB (1999) Randomised trial of safety and efficacy of \ntransurethral resection of the prostate using contact laser versus electrocautery. Tech Urol \n5:198-201 \n 14 \n23. Furuya S, Furuya R, Ogura H, Araki T, Arita T (2006) A study of 4,031 patients of \ntransurethral resection of the prostate performed by one surgeon: learning curve, surgical \nresults and postoperative complications Hinyokika Kiyo 52:609-14 \n24. Watson V, Ryan M, Brown CT, Barnett G, Ellis BW, Emberton M (2004) Eliciting \npreferences for drug treatment of lower urinary tract symptoms associated with benign \nprostatic hyperplasia. J Urol 172:2321-25 \n25. Yang Q, Peters TJ, Donovan JL, Wilt TJ, Abrams P (2001) Transurethral incision compared \nwith transurethral resection of the prostate for bladder outlet obstruction: a systematic review \nand meta-analysis of randomised controlled trials. J Urol 165:1526-1532. \n26. NHS Health and Social Care Information Centre (2009).  Hospital episode statistics. Main \nprocedures and interventions: 4 character 2007-2008.[database on the Internet].   \n        Available from URL: http:\/\/www.hesonline.nhs.uk\/.  Accessed  August  2009. \n \n \n"}