{"doi":"10.1017\/S1472669605000770","coreId":"214805","oai":"oai:eprints.lse.ac.uk:28030","identifiers":["oai:eprints.lse.ac.uk:28030","10.1017\/S1472669605000770"],"title":"International law and treaties: BIALL pre-conference seminar 2005","authors":["Bell, Maria"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-09","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/214805.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/28030\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Bell%2C%20M_International%20law%20treaties_Bell_International%20law%20treaties_2014.pdf","pdfHashValue":"4cbbc21466a473ce0f97155dc34d6e616943e96c","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:28030<\/identifier><datestamp>\n      2014-03-18T14:58:36Z<\/datestamp><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3432<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/28030\/<\/dc:relation><dc:title>\n        International law and treaties: BIALL pre-conference seminar 2005<\/dc:title><dc:creator>\n        Bell, Maria<\/dc:creator><dc:subject>\n        Z665 Library Science. Information Science<\/dc:subject><dc:subject>\n        ZA Information resources<\/dc:subject><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:date>\n        2005-09<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/28030\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Bell%2C%20M_International%20law%20treaties_Bell_International%20law%20treaties_2014.pdf<\/dc:identifier><dc:identifier>\n          Bell, Maria  (2005) International law and treaties: BIALL pre-conference seminar 2005.  Legal Information Management, 5 (3).  pp. 172-175.  ISSN 1472-6696     <\/dc:identifier><dc:relation>\n        http:\/\/journals.cambridge.org\/action\/displayJournal?jid=LIM<\/dc:relation><dc:relation>\n        10.1017\/S1472669605000770<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/28030\/","http:\/\/journals.cambridge.org\/action\/displayJournal?jid=LIM","10.1017\/S1472669605000770"],"year":2005,"topics":["Z665 Library Science. Information Science","ZA Information resources"],"subject":["Article","NonPeerReviewed"],"fullText":"  \nMaria Bell \nInternational law and treaties: BIALL pre-\nconference seminar 2005 \n \nArticle (Published version) \n(Refereed) \n \n \n \n \nOriginal citation: \nBell, Maria (2005) International law and treaties: BIALL pre-conference seminar 2005. Legal \nInformation Management, 5 (3). pp. 172-175. ISSN 1472-6696  \n \nDOI: 10.1017\/S1472669605000770  \n \n© 2005 British & Irish Association of Law Librarians \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/28030\/ \n \nAvailable in LSE Research Online: March 2014 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \nLegal Information Management\nhttp:\/\/journals.cambridge.org\/LIM\nAdditional services for Legal Information Management:\nEmail alerts: Click here\nSubscriptions: Click here\nCommercial reprints: Click here\nTerms of use : Click here\nInternational Law and Treaties: BIALL Pre-Conference Seminar 2005\nMaria Bell\nLegal Information Management \/ Volume 5 \/ Issue 03 \/ September 2005, pp 172 - 175\nDOI: 10.1017\/S1472669605000770, Published online: 12 September 2005\nLink to this article: http:\/\/journals.cambridge.org\/abstract_S1472669605000770\nHow to cite this article:\nMaria Bell (2005). International Law and Treaties: BIALL Pre-Conference Seminar 2005. Legal Information Management, 5,\npp 172-175 doi:10.1017\/S1472669605000770\nRequest Permissions : Click here\nDownloaded from http:\/\/journals.cambridge.org\/LIM, IP address: 158.143.197.40 on 18 Mar 2014\nInternational Law and Treaties:\nBIALL Pre-Conference Seminar\n2005\nInternational law and treaties was this year’s theme at the seminar in Harrogate.\nMaria Bell reports on two of the papers. Professor Anthony Aust gave the opening\npaper on the basics of international law and the treaty framework. Paul Barnett and\nNevil Hagon of the Foreign and Commonwealth Office Treaty Section presented an\noverview of their work in maintaining treaty records and in advising on treaty\nprocedures and processes.\nIntroduction\nThis year’s BIALL Pre-Conference seminar organised by\nthe Professional Standards and Development Committee\nwas devoted to international law and, judging by the large\nattendance, it is a subject of importance to legal\ninformation professionals.\nSpeakers were Professor Anthony Aust, formerly\nDeputy Legal Adviser to the Foreign and Commonwealth\nOffice and currently teaching international law at LSE,\nUCL and SOAS. He is the author of the highly regarded\nModern Treaty Law and Practice, published by Cambridge\nUniversity Press. Turning to the practicalities of\nresearching treaties, Paul Barnett, Head of Treaty\nSection and Nevil Hagon, Head of Treaty Information\nat the Foreign and Commonwealth Office, discussed\nmethods and sources and provided guidance on issues\nsuch as the difference between signatories, parties,\nratification and reservations. The seminar was completed\nby Amy Osborne, Foreign and International Law\nSpecialist at the Kentucky College of Law Library, who\ntalked about the EISIL Database. This article will attempt\nto highlight the key points of Professor Aust’s, Paul\nBarnett’s and Nevil Hagon’s papers. Amy Osborne’s\npaper is included later in this issue.\nFramework within which\ntreaties operate\nProfessor Aust set the context explaining the basics of\ninternational law and the framework within which\ntreaties operate, outlining issues such as the co-existence\nof customary law and treaties.\nFirst some terminology was explained, as misunder-\nstandings exist. Private international law is a very\nconfusing term as it is not international law! Private\ninternational law is more accurately described as ‘‘conflict\nof laws’’ and is the body of domestic law of a state which\napplies when a legal issue contains a foreign element and\nit has to be decided whether the domestic court should\napply foreign law. The term ‘‘transnational law’’ is used to\ndescribe the study of aspects of law that are concerned\nwith more than one state – conflict of laws, comparative\nlaw, supranational law, public international law. ‘‘Public\ninternational law’’ is used to differentiate it from private\ninternational law and it is distinguished by the fact that it\nis a product of all the states of the world, not one\nnational legal system. It has been developing over\ncenturies though the Peace of Westphalia in 1648 is\noften cited as the beginning of international law as it is\nknown today. Public international law is all around us\nwith airline flights being just one example of international\nlaw in action, as they cannot operate without treaties.\nOther examples are in issues of human rights, war\ncrimes, land issues such as Antarctica, and copyright.\nIn some areas, such as jurisdiction, issues both of public\ninternational law and conflict of laws may be involved.\nProfessor Aust asked ‘‘Is international law really law?’’\nThis question does not arise with a body of binding\ndomestic law, but with international law it could be\nviewed as a set of principles that can be ignored when it\nsuits a state. There is no international police force or\narmy that immediately steps in when a breach occurs so\nthe perception arises that international law is not really\nlaw. Professor Aust said that the ‘‘raison d’etre of\ninternational law is that relations between states should\nbe governed by common principles and rules’’. Early\ndevelopments in international law in the seventeenth\nLegal Information Management, 5 (2005), pp. 172–175\n\u0001 BIALL Printed in the United Kingdom doi:10.1017\/S1472669605000770\n172\ncentury revolved around matters which assisted in\nincreasing international trade, such as freedom of the\nhigh seas and immunity of diplomats. Thus Aust argued\nthat the binding force of international law is based on the\n‘‘consent (express or implied) of states, and national self\ninterest’’. States have an interest in maintaining a sense of\norder therefore they develop bonds in the form of\ninternational law and treaties to achieve this.\nSources of international law\nHow do we know what international law is on a particular\nmatter? This is often difficult as unlike domestic law it is\nnot invariably to be found in legislation and judgments.\nThere is no hierarchy of courts in international law. There\nare a series of different international courts and no one\ncourt takes precedence over another. International law is\nderived from various sources, which are listed authorita-\ntively in Article 38(1) of the Statute of the International\nCourt of Justice and which include international conven-\ntions, international custom; general principles of law\nrecognised by civilised nations, and judicial decisions.\n‘‘International conventions’’ refer to bilateral and\nmultilateral treaties, which now play a key role in\ninternational law. Treaties have to be signed and ratified\nbefore entering in to force and, when a treaty does come\ninto force, it is only binding on those parties who ratified it.\nProfessor Aust went on to explain about ‘‘custom’’ or\ncustomary international law which plays an important\nrole in international legal matters. A rule of custom\nevolves from the practice of states over a period of time.\nThere must be evidence before a practice can be\naccepted as law between a number of states. ‘‘There\nmust be a general recognition by states that the practice\nis settled enough to amount to an obligation binding on\nstates in international law’’. This is known as opinio juris\nand establishing it can be difficult, though this is some-\ntimes done via court judgments.\nA questioner from the floor asked how we can know\nif an issue has been established as ‘‘custom’’? Are there\nany sources that we can use or is it so commonly\nrecognised that there is no written evidence? Professor\nAust suggested that textbooks will give an initial\nindication of the international law of a topic. Key texts\nto begin research in include: Oppenheim, International\nLaw, Brownlie, Principles of Public International Law and\nShaw, International law, which will direct researchers to\nany treaties of relevance or explain whether the topic is\nrecognised as customary alone. Customary international\nlaw is complex and by its nature is not documented. In\nrecent years much of customary international law has\nbeen codified in treaties, charters or conventions, with\nessential work being carried out under the auspices of\nthe International Law Commission.\nProfessor Aust referred in closing to ‘‘international\nlawyers’’ and stated that this term is used widely,\nparticularly in the media, but in his view incorrectly.\nStudents study international law in large number but do not\nnecessarily find opportunities to practice it. Large law firms\nmay have international law departments but much of the\nwork is commercial arbitration. Opportunities for inter-\nnational lawyers exist in the British Diplomatic Service or in\nthe United Nations and other intergovernmental organisa-\ntions. Recognised and distinguished practitioners of inter-\nnational law appearing before international courts or\ntribunals are often professors of international law.\nOf the questions following the presentation one of\ninterest was about the importance of the difficult to locate,\n‘‘travaux preparatoires’’ - the preparatory work\/materials\npreceding a treaty or other agreement. It is common for\nresearchers to want to see how the final document was\nnegotiated as an aid to interpreting it. The problem is that\nmany treaties etc are negotiated behind closed doors with\nno documentary record. It varies from country to country\nas to how important travaux preparatoires are.\nPractical issues in researching\ntreaties\nOur attention was then turned to the practicalities of\nworking with treaties. Paul Barnett, Head of Treaty\nSection and Nevil Hagon, Head of Treaty Information at\nthe Foreign and Commonwealth Office (FCO) gave an\ninsight in to the Treaties Section, how it works and what\nessential tools exist for treaty research.\nThe term ‘‘treaty’’ is used as a generic term for\nconvention, agreement, protocol and charter. The\ndefinition of a treaty is given in Article (1) of the\nVienna Convention on the Law of Treaties as:-\n‘‘a generic term for an agreement concluded\nbetween States (or other entities such as interna-\ntional organisations having international personality)\nin written form and intended by them to be binding\nin international law, whether embodied in a single\ninstrument or in two or more related instruments\nand whatever its particular designation’’.\nForeign and Commonwealth\nOffice Treaty Record Section\nThe FCO Treaty Section has two parts, Treaty Procedures\nand Treaty Information.\nTreaty Procedures manage the production of a treaty\nfor signing in the UK, and advise on procedures to be\nfollowed when a treaty is signed overseas. They organise\npublication and laying before Parliament and also advise on\nthe form of draft treaties and the production of Full Powers\n(required for signing) and Instruments of Ratification. All\ntreaties entered into force in the UK must be registered\nwith the United Nations and Procedures do this.\nTreaty Information maintains and updates the UK\ntreaty database (an in-house system). This contains details\nof all treaties to which the UK is a party. It provides a\nTreaty Enquiry Service (see website and email address at\nInternational law and treaties\n173\nthe end) and also co-ordinates the UK’s responsibilities as\ndepository for multilateral treaties and arranges for the\ntransfer of treaties to the National Archive at Kew.\nSources of treaty information\nAll treaties signed by the UK and subject to ratification or\naccession are laid before both Houses of Parliament and\ntreaties are published as Command Papers. The treaty\nmust lie before Parliament for at least 21 days before any\nactions can be effected. This practice is known as the\n‘‘Ponsonby Rule’’ and any treaties laid in this way are\naccompanied by an Explanatory Memorandum (EM).\nCommand Papers are published in one of the following\nseries: the Country Series for bilateral treaties; the\nMiscellaneous Series for multilateral treaties and the EC\nSeries for treaties between EU member states or\nbetween one of the Communities and the Member\nStates and non member states.\nWhen a treaty enters into force it is published again in\nthe Treaty Series. Treaties deposited in the National Archive\nare bound and held in a series of Classes – the current\nclasses for treaty material being FCO 85. The FCOwebsite\nprovides a link to the National Archives giving access to the\ncatalogue and shelf lists to aid research.\nAn Annual Treaty Index is published in the Treaty\nSeries and there is a quarterly publication produced by\nTreaty Information called the Supplementary List of\nRatifications, Accessions, Withdrawals, etc, which includes\nreferences to actions by the state and any declarations or\nobjections that have been made. The Supplementary List\ncan be purchased at the Stationery Office.\nFor research on older treaties, the FCO uses the\nfollowing resources:\nN An Index to British Treaties 1100 – 1968 compiled by\nClive Parry and Charity Hopkins\nN Multilateral Treaties Index and Current Status, by MJ\nBowman and DJ Harris\nN Multilateral Treaty Calendar 1648 – 1995, compiled by\nChristian L Wiktor\nN British State Papers - a series of early 19th century\ntreaties.\nSome rarer series include Hertslet’s Commercial\nTreaties and A collection of Treaties Engagements and\nSanads by CU Aitchison covering the Middle and Near East,\nand A General Collection of Treatys, Etc. London 1710 – 32.\nResearching current\ninformation at the FCO\nThe key is the FCO Treaty Database, an in-house system\nbegun in the 1980s to record all treaty records which up\nuntil then had been maintained in manual registers. The\nFCO has a responsibility to record and maintain accurate\ncurrent data for the FCO and other government\ndepartments as well as external enquirers. Since 2003,\nthe data has been transferred to a specially designed\ndatabase scheduled to be fully implemented in Summer\n2005. This currently remains an in-house system but the\nFCO Treaty Section aim to develop applications in the\nfuture including internet access.\nStatistics give an idea of the size of the database with\n2,900 multilateral treaty records and 10,000 bilateral\nrecords from 1835 onwards. It includes all treaties that\nthe UK is directly involved in plus those that the UK is\nlikely to be party to. Coverage includes details of\nterminated treaties (the FCO does not delete records)\nand any Exchanges of Notes and additional protocols.\nThe database is an index and not full text.\nThe Treaty Section maintains Treaty webpages via the\nFCO website – www.fco.gov.uk\/treaty. They contain\nmuch useful material for legal information professionals.\nSections include lists of treaties for which the UK is\nDepository; texts of Explanatory Memoranda (EM); all\nnew Treaty Command Papers since 2002; a glossary of\nrelevant terms; information on the Ponsonby Rule;\nguidance on treaty and MOU (Memorandum of\nUnderstanding) practice and procedure.\nTreaty making process\nKey elements and processes for treaties involve prepara-\ntion, negotiation, drafting and eventually signing and we\nwere given a taste of some of the details that the Treaty\nSection are responsible for in these processes. To sign a\ntreaty, a person must have what is known as ‘‘Full Powers’’\nauthority. Only three people in the UK can sign a treaty in\ntheir own right: the Head of State, the Head of\nGovernment and the Foreign Secretary and only these\nthree can assign Full Powers to a person to sign a treaty on\nbehalf of the State. Treaty Procedures advise on the\nassignment of Full Powers and are responsible for\nsignatory ceremonies for the UK. It seems that signatory\nceremonies do not go smoothly every time. Problems\narise from parties having different versions of the treaty, or\nqueries about translations. Signing is preceded by a section\nby section comparison with both parties present to ensure\naccuracy and agreement. These can be carried out against\ntight timescales. Once a treaty is signed and sealed in wax,\nofficials must ensure each party leaves with the correct\nversion. It was noted that the British State Papers include a\ndescription of an eventful signatory ceremony which\ninvolved British gunboats in action! Present day ceremo-\nnies do not usually require a gunboat’s presence.\nAs mentioned before, treaties are subject to ratification\nbefore entering into force. Some treaties provide that they\nwill come into force on signature, others make specific\nprovision, so it is necessary to check the treaty itself.\nA complex area of treaty procedures relates to the\napplication of UK treaties to Overseas Territories and\nthe Treaty Section website provides guidelines. Treaty\nprovisions can be extended to include Overseas\nTerritories or an explanatory note can be issued laying\nout its application to them.\nMaria Bell\n174\nFinally, there was an explanation of the origin of the\nstrangely termed ‘‘Ponsonby Rule’’ which has been in place\nsince 1924. The Foreign Secretary and not Parliament signs\ntreaties and before the First World War suspicion had\narisen about secret treaties being signed. To stem this\nsuspicion, in 1924 Mr Arthur Ponsonby, then Under\nSecretary for Foreign Affairs, made a statement in the\nHouse of Commons that the government would lay all\ntreaties before Parliament for viewing for 21 days.\nParliament can ask for a debate on a treaty or an extension\nof viewing time. This practice has continued ever since and\nalthough it is not law, it is parliamentary practice that the\nPonsonby Rule is applied. Further information on the\nPonsonby Rule is available from the Treaty Section website.\nConclusion\nThe seminar closed with a presentation on the EISIL\n(Electronic Information System for International Law)\ndatabase (www.eisil.org) by Amy Osborne from the\nUniversity of Kentucky College of Law Library, giving us\nan overview of a useful research tool for international\nlaw. Amy’s paper is published separately in this issue. The\nseminar was informative and entertaining, providing\ndelegates with a wealth of information about the nature\nof international law and how treaty procedures and\nprocesses work in practice.\nAcknowledgement\nPre-conference seminar handout containing:\nExtract of Chapter 1 of Handbook of international law by\nProfessor Anthony Aust, to be published in October\n2005 by Cambridge University Press.\nPaul Barnett and Nevil Hagon, Practical issues in\nresearching treaties prepared for the seminar on 9 June\n2005.\nReferences\nAust, A. Modern Treaty Law and Practice, 2000. Cambridge University Press.\nForeign and Commonwealth Office Treaty website – www.fco.gov.uk\/treaty\nTreaty Enquiry Service: E-Mail: treaty.fco@gtnet.gov.uk\nBiography\nMaria Bell is the librarian responsible for the law and EU collections at the British Library of Political and Economic\nScience at the London School of Economics.\nAccess to Legal Literature: the\nItalian DOGI Database\nGinevra Peruginelli of the Institute of Legal Infomation Theory & Techniques of the\nItalian National Research Council. Ginevra was a colleague of Gillians whilst she\nstudied at IALS and Gillian originally asked Ginevra to submit this article.\nIntroduction – legal literature\nLegal information has specific features due to its nature, its\ndifferent purposes and the intrinsic need for integration of\nits components, represented by legislation, cases and\ndoctrine. Access to legal literature in particular is a primary\nrequirement; it responds to the demand for understanding\nand interpretation of statutes and cases, an objective that\nlaw scholars and professionals greatly contribute to.\nLegal Information Management, 5 (2005), pp. 175–180\n\u0001 BIALL Printed in the United Kingdom doi:10.1017\/S1472669605000782\nThe Italian DOGI Database\n175\n"}