{"doi":"10.1080\/0968776030110203","coreId":"14209","oai":"oai:generic.eprints.org:403\/core5","identifiers":["oai:generic.eprints.org:403\/core5","10.1080\/0968776030110203"],"title":"From videocassette to video stream: Issues involved in re‐purposing an existing educational video","authors":["Shephard, Kerry","Ottewill, Roger","Phillips, Peter","Collier, Richard"],"enrichments":{"references":[{"id":1880106,"title":"21Kerry Shephard et al Issues involved in re-purposing an existing educational video","authors":[],"date":"2001","doi":"10.1080\/0968776030110203","raw":"21Kerry Shephard et al Issues involved in re-purposing an existing educational video Shephard, K. (2001), 'Submission of student assignments on compact discs: exploring the use of audio, images, and video in assessment and student learning', British Journal of Educational Technology, 32 (2), 161-70.","cites":null},{"id":450972,"title":"A Bibliography of the Use of Video-Cassettes as a Teaching Medium in Higher Education,","authors":[],"date":"1998","doi":null,"raw":"Tompkins, K. (1998), A Bibliography of the Use of Video-Cassettes as a Teaching Medium in Higher Education, Bletchley: Institute of Educational Technology, Open University.","cites":null},{"id":197515,"title":"Buying and Clearing Rights,","authors":[],"date":"1995","doi":null,"raw":"McCracken, R. and Gilbart, M. (1995), Buying and Clearing Rights, London: Blueprint.","cites":null},{"id":197512,"title":"Developing the DNER for learning and teaching',","authors":[],"date":"1999","doi":null,"raw":"JISC (1999), 'Developing the DNER for learning and teaching', JISC Circular 5\/99, http:\/\/www.jisc.ac.uk\/index.cfm?name=programme_learning_teaching, last accessed 3 April 2003.","cites":null},{"id":450970,"title":"et al Issues involved in re-purposing an existing educational video","authors":[],"date":"2001","doi":"10.1080\/0968776030110203","raw":null,"cites":null},{"id":197513,"title":"Exchange for learning programme (X4L)',","authors":[],"date":"2002","doi":null,"raw":"JISC (2002), 'Exchange for learning programme (X4L)', JISC Circular 2\/02, http:\/\/www.jisc.ac.uk\/index.cfm?name=circular_2_02, last accessed 3 April 2003.","cites":null},{"id":197509,"title":"Home page', www.cetis.ac.uk, last accessed 2","authors":[],"date":"2001","doi":null,"raw":"CETIS (2001), 'Home page', www.cetis.ac.uk, last accessed 2 April 2003.","cites":null},{"id":197510,"title":"Image learning', http:\/\/www.mit.edu:8001\/people\/davis\/ImageLearn.html, last accessed 1","authors":[],"date":"1991","doi":null,"raw":"Davis, B. (1991), 'Image learning', http:\/\/www.mit.edu:8001\/people\/davis\/ImageLearn.html, last accessed 1 April 2003.","cites":null},{"id":197511,"title":"JISC\/TLTP Copyright Guidelines', http:\/\/www.ukoln.ac.uk\/services\/elib\/ papers\/other\/jisc-tltp\/jisc.pdf, last accessed 3","authors":[],"date":"1998","doi":null,"raw":"JISC (1998), 'JISC\/TLTP Copyright Guidelines', http:\/\/www.ukoln.ac.uk\/services\/elib\/ papers\/other\/jisc-tltp\/jisc.pdf, last accessed 3 April 2003.","cites":null},{"id":450967,"title":"last accessed 3","authors":[],"date":"2003","doi":null,"raw":"ac.uk\/metadata\/education\/, last accessed 3 April 2003. Microsoft (2002), 'Windows media applications development', http:\/\/www.microsoft.","cites":null},{"id":450969,"title":"Making the most of video',","authors":[],"date":"1995","doi":null,"raw":"Race, P. (1995), 'Making the most of video', SEDA paper 90, 73-90.","cites":null},{"id":450971,"title":"Questioning, promoting and evaluating the use of streaming video to support student learning',","authors":[],"date":"2003","doi":"10.1111\/1467-8535.00328","raw":"Shephard, K. (2003), 'Questioning, promoting and evaluating the use of streaming video to support student learning', British Journal of Educational Technology, 34 (3), (in press).","cites":null},{"id":197514,"title":"Rethinking University Teaching, 2nd edn,","authors":[],"date":"2002","doi":"10.4324\/9780203304846","raw":"Laurillard, D. (2002), Rethinking University Teaching, 2nd edn, London: Routledge. LIFESIGN (2002), 'Networked moving images for the life sciences', www.Lifesign.ac.uk, last accessed 3 April 2003.","cites":null},{"id":197508,"title":"Streaming media in UK higher and further education', http:\/\/www.techlearn.ac.uk\/NewDocs\/Streaming111002.doc, last accessed 1","authors":[],"date":"2002","doi":null,"raw":"Brown, S. (2002), 'Streaming media in UK higher and further education', http:\/\/www.techlearn.ac.uk\/NewDocs\/Streaming111002.doc, last accessed 1 April 2003.","cites":null},{"id":450874,"title":"The UK's Metadata for Education Group: home page,","authors":[],"date":"2002","doi":null,"raw":"MEG (2002), 'The UK's Metadata for Education Group: home page, http:\/\/www.ukoln.","cites":null},{"id":197506,"title":"The use of video as a teaching resource in a new University',","authors":[],"date":"1997","doi":"10.1111\/1467-8535.00005","raw":"Barford, J. and Weston, C. (1997), 'The use of video as a teaching resource in a new University', British Journal of Educational Technology, 28 (1), 40-50.","cites":null},{"id":450973,"title":"The use of video streaming in higher education: a report on the evaluation of Click and Go Video case studies and the educational benefits for learners', http:\/\/www.clickandgovideo.ac.uk\/evaluation_casestudies.htm, last accessed 3","authors":[],"date":"2002","doi":null,"raw":"Zenios, M. (2002), 'The use of video streaming in higher education: a report on the evaluation of Click and Go Video case studies and the educational benefits for learners', http:\/\/www.clickandgovideo.ac.uk\/evaluation_casestudies.htm, last accessed 3 April 2003.","cites":null},{"id":197507,"title":"Using Video","authors":[],"date":"1985","doi":null,"raw":"Bates, A. (1985), Using Video in Higher Education, Institute of Educational Technology Paper on Broadcasting No. 243.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003","abstract":"Conventional video recordings can be converted into video streams but the process can be complex and problematic. The authors’ experience of re‐purposing an existing video, Back Care for Health Professionals, for streaming is used to illustrate what was involved and to highlight the important issues. Financial, legal, technical and pedagogic issues are examined","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14209.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/403\/1\/ALT_J_Vol11_No2_2003_From%20videocassette%20to%20video%20st.pdf","pdfHashValue":"6b75c4e5553da6a62c9e3c8100c929e8001c5cba","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:403<\/identifier><datestamp>\n      2011-04-04T09:10:16Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/403\/<\/dc:relation><dc:title>\n        From videocassette to video stream: Issues involved in re‐purposing an existing educational video<\/dc:title><dc:creator>\n        Shephard, Kerry<\/dc:creator><dc:creator>\n        Ottewill, Roger<\/dc:creator><dc:creator>\n        Phillips, Peter<\/dc:creator><dc:creator>\n        Collier, Richard<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Conventional video recordings can be converted into video streams but the process can be complex and problematic. The authors’ experience of re‐purposing an existing video, Back Care for Health Professionals, for streaming is used to illustrate what was involved and to highlight the important issues. Financial, legal, technical and pedagogic issues are examined.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2003<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/403\/1\/ALT_J_Vol11_No2_2003_From%20videocassette%20to%20video%20st.pdf<\/dc:identifier><dc:identifier>\n          Shephard, Kerry and Ottewill, Roger and Phillips, Peter and Collier, Richard  (2003) From videocassette to video stream: Issues involved in re‐purposing an existing educational video.  Association for Learning Technology Journal, 11 (2).  pp. 14-22.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776030110203<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/403\/","10.1080\/0968776030110203"],"year":2003,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"From videocassette to video stream: issues\ninvolved in re-purposing an existing\neducational video\nKerry Shephard, Roger Ottewill, Peter Phillips and Richard Collier\nUniversity of Southampton\nemail: k.shephard@soton.ac.uk\nConventional video recordings can be converted into video streams but the process can be\ncomplex and problematic. The authors' experience of re-purposing an existing video,\nBack Care for Health Professionals, for streaming is used to illustrate what was involved\nand to highlight the important issues. Financial, legal, technical and pedagogic issues are\nexamined.\nIntroduction\nThis paper draws upon our experience of converting an existing educational videocassette\ninto a video stream and presents a case study of the important issues that arose. The\nprocess was undertaken to apply some potential benefits of a new technology to support\nlearners in higher education (HE). It was, however, by no means unproblematic and the\nissues that arose need to receive serious consideration if the potential of streaming\ntechnology is to be harnessed for more effective learning opportunities for students.\n'Streaming' is a way of transmitting video (or other media files) across the Internet (or by\nsimilar means). It is an alternative to downloaded delivery of these media and viewers do\nnot have lengthy 'download waits'. A more comprehensive definition is provided elsewhere\n(Brown, 2002). The term used here to describe the processes involved in enabling a video\nrecording, made for delivery via videocassette recorder (VCR), to be transmitted across the\nInternet is 're-purposing'. One process within this broad remit is that of making specific\nchanges to the content of the video recording. This is referred to as 're-engineering'.\nThe authors all have a strong commitment to the use of video in HE and have actively\nparticipated in the re-purposing reported here. They feel that since the Joint Information\n14\nALT-J Volume I I Number 2\nSystems Committee (JISC) and other bodies are investing considerable resources in\npromoting and evaluating the effectiveness of streamed video to support learning (JISC,\n1999), and in re-purposing existing learning materials (JISC, 2002) there is a need to\nhighlight the issues involved.\nIn this paper attention is given to the context within which the re-purposing of one\nparticular video was undertaken, the processes involved and questions for those\nconsidering re-purposing. It does not include evaluation data on how well the resulting\nlearning resource supported student learning as evaluation of the video streaming is still\nongoing.\nSetting the scene for re-purposing video\nWide range of available video\nIn recent decades considerable use has been made of video for educational as well as for\nentertainment purposes. Most institutions of HE have extensive collections of videos,\nsome of which have been made specifically for educational\/training purposes while others\nare mainstream TV programmes recorded under licence by audio-visual technicians.\nCollections are usually catalogued and issued by librarians in the same way as paper-based\nmedia, with various methods being adopted to build up collections and keep tutors abreast\nof what is available (Tompkins, 1998).\nValue of video to support learning\nTutors have used videos to enhance the quality of student learning in various ways.\nResearch undertaken at a post-1992 UK university in the mid-1990s showed that, although\nonly about a quarter of teaching staff took advantage of videos, those who did so were\nmotivated by various considerations. These included 'bringing the outside world into the\nlearning space . . .; visual representation of ideas and concepts . . .; (and) drama\/\npersonification of real-life situations' (Barford and Weston, 1997: 44). Others have stressed\nthe power of video to facilitate 'dynamic modelling' or 'simulation' and 'narrative\nvisualization' (Bates, 1985; Davis, 1991). Video can be used to redress some of the over-\nsimplification that occurs when information from 'real life' is abstracted for conversion\ninto text. It may lead to a better description by tutors and better visualization, recognition\nand identification by students. Video facilitates story telling, conveys emotions and\nprovides 'real life' examples with which learners can identify.\nAdvice on the most successful ways to use video is readily available (Race, 1995; Maier and\nWarren, 2000). Most educational experts agree that video is best shown in short segments\nso as to maximize learners' concentration and that learners should be encouraged to learn\nactively from the video by 'interacting' with it. This might involve identifying in advance\nwhat they should do while viewing the video and anticipating post-viewing activities.\nTechnological advances\nTraditionally learners have accessed video via VCR and television or projector and screen.\nMore recently, video has become available in a digital form on compact disc and this has\nincreased the range of situations in which learners can engage with video to support their\nlearning (Shephard, 2001). With advances in digital technology it is now possible for video\nto be transmitted in a 'stream' rather than as a discrete file. In this way it can be delivered\nvia the Internet with users able to request and view it 'on-demand'. This clearly increases\nis\nKerry Shephard et al Issues involved in re-purposing an existing educational video\nits flexibility and offers tutors, and learners, further opportunities for integrating the\nmedium with other forms of learning resource (particularly electronic) and for embedding\nit in the student learning environment. Lack of user-control was a limitation of video in its\ntraditional form. This is likely to be reduced when it is accessed via a computer. Moreover,\n'in this mode it inherits expectations of interactivity' (Laurillard, 2002: 105). It should also\nenable learning to be supported in a more 'distributed' fashion. Although users require\naccess to a computer with 'broadband' Internet connection, they no longer need their own\ncopy of the videocassette (for examples of how video streaming is being used to support\nlearning in HE see Shephard, 2003).\nAnticipating the issues\nIn preparing for the re-purposing, a wide range of non-technical or pedagogical issues and\nproblems were anticipated. Early communication from the UK's Managing Agent and\nAdvisory Service for Moving Pictures and Sound suggested that it was necessary to contact\nall actors or their agents and possibly pay an additional fee (Gilbart, 2001). Consideration\nwas also given to the rights of 'real people' included in the video, to material that is owned\nby third parties, to the 'moral rights' of the original producers and to the financial\nconcerns of the video's copyright holder.\nRe-purposing processes\nThe video selected for re-purposing was Back Care for Health Professionals, which the\nUniversity of Southampton, in conjunction with the National Back Pain Association, had\nproduced in 1998. There are in effect, two videos. The first deals with 24-hour back care\nand the second shows moving and handling in a hospital environment. Each video is\ndivided into a number of parts. To supplement the videos there is a written guide (adapted\nfrom one produced jointly by the National Back Pain Association and Royal College of\nNursing in 1998). This explains their purpose, suggests a possible format for running\ncourses with them and includes text suitable for learner-support.\nSince its production Back Care for Health Professionals has been used at the University of\nSouthampton to support learning on a variety of undergraduate and postgraduate courses,\nincluding degrees in physiotherapy, occupational therapy, nursing and midwifery, and the\nPost-Registration Foundation Programme in Basic Moving and Handling. Data gathered\nfrom undergraduates indicated that it had played a useful role in enhancing their learning\nand helping them prepare for their practical examination. However, in order to take\nadvantage of it, they had to borrow copies from the library or from tutors. This made\naccess somewhat problematic. To facilitate distributed access and enhance further its\ncontribution to student learning, the video was felt to be a suitable candidate for re-\npurposing. In addition, with back care being a very important component of the\ncurriculum for nurses and 'professions allied to medicine', having a flexible, readily\naccessible video-based learning resource was potentially of considerable value. That said,\nre-purposing is by no means a 'cheap' option and in securing the necessary resources the\ncontribution of LIFESIGN was crucial.\nTheroleofUFESIGN\nThe JlSC-funded LIFESIGN project was charged with the task of developing, cataloguing\nand evaluating the use of streaming media in learning and teaching in the broad life\n16\nALT-J Volume 11 Number 2\nsciences (Lifesign, 2002). In early 2001, discussions were held between a LIFESIGN\nresource-developer, a University of Southampton media producer and academic staff in\nthe University's School of Health Professions and Rehabilitation Sciences on the feasibility\nof re-purposing the Back Care for Health Professionals video. A project plan was prepared\nand presented to LIFESIGN. This anticipated the costs likely to be incurred in the re-\npurposing and by the media producer in addressing various legal matters. LIFESIGN\naccepted the plan on the understanding that it would lead to opportunities to evaluate both\nthe re-purposing and the use of the resulting video stream to support student learning. The\nre-purposing was therefore comprehensively documented as part of this remit. Moreover,\nbecause LIFESIGN is a multi-partner project the resources of several partners, technical\nas well as financial, were available.\nThe role of the producer\nSouthampton's media producer played a pivotal role in the re-purposing of the video. He\nacted as the University's representative on rights issues and was deemed to be in the best\nposition to determine the need to negotiate with actors, their agents and other people,\nincluding patients 'captured' on the original video. The media producer also determined\nthe need for 'Restricted Access' to the streamed video. LIFESIGN's project-plan included\nthe stipulation that LIFESIGN would only make the video available to groups of users\nwho had already purchased the videocassette. In the longer term it was hoped that\nLIFESIGN would be able to promote the streamed video more widely.\nDiscussion with academic staff\nAcademic staff from the School of Health Professions and Rehabilitation Sciences\ndiscussed the design of the learning resources and arrangements for evaluation with\nLIFESIGN resource-developers. Ethical clearance from the School's internal Ethics\nCommittee had to be secured to enable LIFESIGN's evaluation requirement to be met.\nAcademic staff were also actively involved in the re-engineering process.\nRe-engineering\nThe original analogue videotapes were re-engineered within the University of\nSouthampton's e-Media Group, with the participation of those who were involved in the\noriginal commissioning and design of the video. Since the original video was four years\nold, some techniques for handling patients had changed and a few (which had been best\npractice in 1998) were no longer recommended. This needed to be addressed, because,\nwhen tutors show a conventional video during a teaching session, it is easy to introduce the\nclip (or interrupt it) by telling the class that a specific part of a technique is no longer\ncarried out. With a video stream, however, this is more difficult and ideally everything\nshown should be correct. The academic staff and the producer decided which of the scenes\nhad dated and should either be cut out or re-filmed.\nAnother difference between conventional and streamed video relates to how long students\nwill sit in front of moving pictures and learn from them. To fit into a video stream,\nanalogue video is typically compressed by a factor of 100 and some of the information\nwithin it is lost. The picture is made much smaller and is usually one fifth of the original\nsize. Fine detail is lost and the number of colours reduced. Although the human eye can\n'find the content' even in such a compressed form, it is much less comfortable to watch\nthan conventional video and viewers may not put up with long sequences of poor quality,\n17\nKerry Sbephord et al Issues involved in re-purposing an existing educational video\n'jerky' pictures. The media producer also considered that five-minute sequences, which had\nbeen effective on conventional video, would be too long for students to watch, online, with\nno interaction. Thus, re-engineering focused on reducing the length of scenes and\nfacilitating the interaction of learners with the video by ensuring that the scenes related to\nsupport materials (for example, guidance notes; reflective and practical questions). While\nthis degree of re-engineering is more likely to be required in a rapidly changing discipline\nlike health care, it seems likely that many other videos would need some re-engineering in\norder to make them suitable for streaming.\nLIFESIGN resource-developers also helped academic staff 'embed' the video stream into\nthe learning resources for identified cohorts of students. Initially this involved writing a\nWeb page that incorporated learning activities along with hyperlinks. These hyperlinks\nwere to ASX redirector files (Microsoft, 2002) that linked learning activities to specified\nclips from the video. In this way, the potential for combining video streams with the\ninteractive possibilities offered by the computer was beginning to be realized.\nDigitization and streaming\nThe re-engineered videotapes were digitized by LIFESIGN's media producer and moved to\nLIFESIGN servers for streaming to the Internet. As 'Restricted Availability' was\nimportant to the video's rights holder, the video was streamed from servers where access to\nthe stream could, if necessary, be restricted to individual institutions on the basis of\nidentified IP addresses.\nDiscussion\nAs anticipated, re-purposing gave rise to a range of issues. These are discussed here,\ntogether with questions that need to be considered in deciding whether or not to stream a\nconventional video.\nFinancial issues\nFor any re-purposing project the costs are likely to be considerable, with the amounts\ninvolved depending on the professional expertise required and the complexity of the video.\nIn the case reported here funding and support was secured from LIFESIGN. Clearly this\nwould not be generally available. For potential 're-purposers' a key question concerns the\nextent to which benefits outweigh the costs. In assessing costs, account may have to be\ntaken of the loss of income from sales of the existing videocassette. If the video footage\neffectively becomes available 'free of charge' over the Internet, then the market for the\nvideo will be reduced. Either the availability of the video online must be adequately\nrestricted or the rights holders must be compensated for any loss of income. For the Back\nCare for Health Professionals video this was an important consideration and access had to\nbe restricted to protect the financial interests of the rights holders.\nLegal issues\nSeveral legal issues arose and in each case the decision reached was based on the best\nadvice available. Occasionally there was a strong feeling that the legal position was not\nentirely clear. Here the 'least risky' approach was adopted. Most professionally produced\nvideos employ actors. Contracts with these actors generally specify the broad use of the\nvideo and do not permit its subsequent use for a purpose, for which it was not initially\nintended, without further discussion with actors or their agents. In the case reported here\n18\nALT-] Volume 11 Number 2\nthe situation was that of taking a video, produced for a classroom situation, and\n'streaming' it. A point at issue was whether or not 'streaming over the Internet', to\nidentified and restricted users, was broadcasting. The advice that was acted upon was that\n'streaming' was 'broadcasting'. Since the Copyright Designs and Patents (CDP) Act 1988\nhas sections which apply to 'broadcasting material by cable', it is arguable that streamed\nvideo is covered by these sections. The Act, however, was passed at a time when the concept\nof 'streaming' had not arisen and it was not designed to cover this. The legal situation has\nnot yet been tested but it is unlikely that any academic institution would be prepared to do\nso.\nWhere video includes other, unpaid, individuals (in this case, 'real' patients) it is normal\nprocedure to obtain permission from them for recording. Here various questions arise. Did\nthe permission anticipate the technological advances that would allow the video to be\nstreamed? Is the streamed distribution so much greater that permission needs to be re-\nsought? Would it be possible to contact these people who almost certainly do not have\nagents? It is easier, certainly more straightforward, to cut footage that includes these\npeople. In the case considered here, such footage was cut.\nAnother area relates to the rights of members of academic staff who have appeared in\nvideos, which are subsequently streamed. The CDP Act (1988) gives rights to the\nperformer and to their institution\/employer. Performance rights did not arise in the current\ncase but would in many other situations.\nSome professionally produced videos include material that is owned by third parties (for\nexample, archival film or still pictures, background music). The contracts that give\npermission for producers to use such material normally impose strict limits on its use - by\nterritory, by time (typically five years from the date of the agreement) and by type of usage\n(many producers of educational programmes with limited budgets opt for the cheapest\ntype of clearance, which is 'non-broadcast, non-theatrical'). While videos made in the last\nfew years may have had third party material cleared for Internet use, there are many that\nrequire these materials to be cleared with payment of additional fees. The introductory\nsection of the Back Care for Health Professionals video, which contained archival shots\nfrom the 1996 Olympics, was removed to avoid the cost of re-clearing the material with its\nrights holder.\nWhile one rights holder might hold the copyright to a video, the original producers have\nthe right to be identified as the originators and\/or creators of the work and they have\ncertain 'moral' rights over the integrity of the work (McCracken and Gilbart, 1995; JISC,\n1998). Where producers claim this moral right, it would be inappropriate to either re-\nengineer or re-purpose the video without their permission and, possibly, involvement (for a\ndescription of the situation as it applies to the broad electronic environment, see JISC,\n1998). It is an infringement of producers' rights for users of copyrighted material to\nmodify\/adapt the work in a way that could be interpreted as 'derogatory'. The range of\npossible legal problems inherent in this area is great; particularly where the copyright\nholder is an institution (in this case a university) and generally represented by the original\nmedia producer, or his\/her department. The view taken on this occasion was that the\noriginal media producer did have the right to be involved with many aspects of the re-\npurposing, indeed, that the project benefited from such involvement. There was, however, a\n19\nKerry Shephard et al Issues involved in re-purposing an existing educational video\nneed to fund this involvement. For most re-purposing projects this situation would need to\nbe incorporated in the cost-benefit analysis.\nTechnical issues\nThe digitization of an extended videotape to enable it to be streamed effectively to users is\ntechnically very demanding. The expertise and resources of the LIFESIGN project\npartners were crucial in this respect. There are also technical issues that relate to streaming\nthat extend far beyond the capability or experience of many individual users. The resources\nof institutions with demonstrable commitment to ICT to support learning are probably\nnecessary. This should remain a central question in deciding about potential re-purposing\nprojects.\nStreaming offers tutors and learners opportunities that are not so readily available to users\nof videocassettes. These include enhanced flexibility by dividing the stream into segments\nand the ability of users to move with ease from one part of the video to another and to and\nfrom other learning resources. The extent to which these opportunities are realized relates\nto some degree to early decisions in the re-purposing process.\nTwo further technical issues that will become more important for future projects are those\nof metadata and 'Learning Technology Interoperability Standards'. Metadata, in par-\nticular, relates to the extent to which access to sections of online video will be possible via,\nfor example, catalogues and search engines (MEG, 2002). Closely connected to this are\nLearning Technology Interoperability Standards, which are being addressed in the UK by\nthe Centre for Educational Technology Interoperability Standards (CETIS, 2001). JISC\npays for CETIS to be involved in the development and adoption of these standards\nworldwide and, in so doing, represents the interests of HE and further education. On a\npractical level it is important to ensure that digital learning resources can interact with the\nrange of learning resources and learning tools that have not yet been discovered or\ninvented!\nPedagogic issues\nA significant element of any cost-benefit analysis must relate to the learning advantages of\nthe streamed video over conventional resources. It should not be automatically assumed\nthat the new resource will be better (Zenios, 2001; Shephard, 2003). Depending on how it is\ndesigned and embedded in the learning programme it may turn out to be a good deal\nworse. As explained, LIFESIGN's involvement in the re-purposing of the Back Care for\nHealth Professionals video stemmed from an interest in evaluating how well it would\nsupport learning, what more it had to offer learners and how it could be effectively\nembedded in learning programmes. Arguably, such considerations should apply to similar\nprojects, regardless of educational setting. A related issue is the extent to which re-\npurposing results in wider and more effective distribution of the learning resource.\nAlthough 'technical' considerations, such as bandwidth and the availability and\nfunctioning of equipment and software, are often to the fore, the consequences of limited\nand inflexible distribution are essentially pedagogic. If streaming does not result in easier\naccess to learning resources, its role in supporting learning and teaching has to be\nquestioned.\n20\nALT-} Volume 11 Number 2\nConclusion\nThis paper raises a variety of questions that need to be considered when deciding whether\nor not conventional videos should be re-purposed. It leads to the conclusion that streaming\nexisting videos is not for the faint-hearted; a wide range of issues will be encountered that\nmust either be overcome or circumvented. Deciding which of these two responses best fits\neach problem is probably the toughest task and in every situation a rigorous cost-benefit\nanalysis will be necessary.\nReferences\nBarford, J. and Weston, C. (1997), 'The use of video as a teaching resource in a new\nUniversity', British Journal of Educational Technology, 28 (1), 40-50.\nBates, A. (1985), Using Video in Higher Education, Institute of Educational Technology\nPaper on Broadcasting No. 243.\nBrown, S. (2002), 'Streaming media in UK higher and further education',\nhttp:\/\/www.techlearn.ac.uk\/NewDocs\/Streaming111002.doc, last accessed 1 April 2003.\nCETIS (2001), 'Home page', www.cetis.ac.uk, last accessed 2 April 2003.\nDavis, B. (1991), 'Image learning', http:\/\/www.mit.edu:8001\/people\/davis\/ImageLearn.html,\nlast accessed 1 April 2003.\nGilbart, M. (2001), personal communication.\nJISC (1998), 'JISC\/TLTP Copyright Guidelines', http:\/\/www.ukoln.ac.uk\/services\/elib\/\npapers\/other\/jisc-tltp\/jisc.pdf, last accessed 3 April 2003.\nJISC (1999), 'Developing the DNER for learning and teaching', J ISC Circular 5\/99,\nhttp:\/\/www.jisc.ac.uk\/index.cfm?name=programme_learning_teaching, last accessed 3 April\n2003.\nJISC (2002), 'Exchange for learning programme (X4L)', JISC Circular 2\/02,\nhttp:\/\/www.jisc.ac.uk\/index.cfm?name=circular_2_02, last accessed 3 April 2003.\nLaurillard, D. (2002), Rethinking University Teaching, 2nd edn, London: Routledge.\nLIFESIGN (2002), 'Networked moving images for the life sciences', www.Lifesign.ac.uk,\nlast accessed 3 April 2003.\nMaier, P. and Warren, A. (2000), Integr@ting Technology in Learning and Teaching,\nLondon: Kogan Page.\nMcCracken, R. and Gilbart, M. (1995), Buying and Clearing Rights, London: Blueprint.\nMEG (2002), 'The UK's Metadata for Education Group: home page, http:\/\/www.ukoln.\nac.uk\/metadata\/education\/, last accessed 3 April 2003.\nMicrosoft (2002), 'Windows media applications development', http:\/\/www.microsoft.\ncom\/windows\/windowsmedia\/create\/develop.asp, last accessed 3 April 2003.\nRace, P. (1995), 'Making the most of video', SEDA paper 90, 73-90.\n21\nKerry Shephard et al Issues involved in re-purposing an existing educational video\nShephard, K. (2001), 'Submission of student assignments on compact discs: exploring the\nuse of audio, images, and video in assessment and student learning', British Journal of\nEducational Technology, 32 (2), 161-70.\nShephard, K. (2003), 'Questioning, promoting and evaluating the use of streaming video\nto support student learning', British Journal of Educational Technology, 34 (3), (in press).\nTompkins, K. (1998), A Bibliography of the Use of Video-Cassettes as a Teaching Medium\nin Higher Education, Bletchley: Institute of Educational Technology, Open University.\nZenios, M. (2002), 'The use of video streaming in higher education: a report on the\nevaluation of Click and Go Video case studies and the educational benefits for learners',\nhttp:\/\/www.clickandgovideo.ac.uk\/evaluation_casestudies.htm, last accessed 3 April 2003.\n22\n"}