{"doi":"10.1103\/PhysRevB.70.235328","coreId":"15340","oai":"oai:dro.dur.ac.uk.OAI2:7628","identifiers":["oai:dro.dur.ac.uk.OAI2:7628","10.1103\/PhysRevB.70.235328"],"title":"Ab initio calculations of the structural and electronic properties of HgmTen clusters.","authors":["Wang, X.Q.","Clark, S.J.","Abram, R.A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-12-01","abstract":"The structural and electronic properties of HgmTen (mnot equaln=13, 16,\\ud\n 19, and 28) clusters are calculated using density functional formalism\\ud\n and the pseudopotential method within the generalized gradient\\ud\n approximation. The initial structures of all the clusters are chosen to\\ud\n be fragments of bulk phase HgTe with T-d symmetry. It is found that the\\ud\n relaxed structures of Hg13Te16 and Hg16Te19 retain their initial\\ud\n symmetry, whereas those of Hg16Te13, Hg19Te16,\\ud\n Hg19Te28(=Hg16Te19+12Te), and Hg28Te19(=Hg16Te19+12Hg), due to the\\ud\n Jahn-Teller distortions except for the last one, change to lower\\ud\n symmetries. However, it is apparent that the 12 additional Te atoms in\\ud\n the Hg19Te28 cluster act to stabilize the Hg19Te16 core, while the 12\\ud\n additional Hg atoms in the Hg28Te19 cluster do not do so. It is also\\ud\n found that all the clusters studied here are initially semimetals with\\ud\n zero or very small highest occupied molecular orbital (HOMO) - lowest\\ud\n unoccupied molecular orbital (LUMO) gaps. However, after structural\\ud\n relaxation, Hg16Te13, Hg19Te16, Hg19Te28, and Hg28Te19 are\\ud\n semiconductors, while the other two clusters with unchanged symmetry\\ud\n are still semimetallic in nature. Therefore, as well as the size\\ud\n quantization, the symmetry of a cluster would seem to be another\\ud\n significant factor to determine its HOMO-LUMO gaps","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15340.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7628\/1\/7628.pdf","pdfHashValue":"160aa77fc43516f315c32c02509f51666ebb96fc","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7628<\/identifier><datestamp>\n      2010-12-08T10:28:46Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Ab initio calculations of the structural and electronic properties of HgmTen clusters.<\/dc:title><dc:creator>\n        Wang, X.Q.<\/dc:creator><dc:creator>\n        Clark, S.J.<\/dc:creator><dc:creator>\n        Abram, R.A.<\/dc:creator><dc:description>\n        The structural and electronic properties of HgmTen (mnot equaln=13, 16,\\ud\n 19, and 28) clusters are calculated using density functional formalism\\ud\n and the pseudopotential method within the generalized gradient\\ud\n approximation. The initial structures of all the clusters are chosen to\\ud\n be fragments of bulk phase HgTe with T-d symmetry. It is found that the\\ud\n relaxed structures of Hg13Te16 and Hg16Te19 retain their initial\\ud\n symmetry, whereas those of Hg16Te13, Hg19Te16,\\ud\n Hg19Te28(=Hg16Te19+12Te), and Hg28Te19(=Hg16Te19+12Hg), due to the\\ud\n Jahn-Teller distortions except for the last one, change to lower\\ud\n symmetries. However, it is apparent that the 12 additional Te atoms in\\ud\n the Hg19Te28 cluster act to stabilize the Hg19Te16 core, while the 12\\ud\n additional Hg atoms in the Hg28Te19 cluster do not do so. It is also\\ud\n found that all the clusters studied here are initially semimetals with\\ud\n zero or very small highest occupied molecular orbital (HOMO) - lowest\\ud\n unoccupied molecular orbital (LUMO) gaps. However, after structural\\ud\n relaxation, Hg16Te13, Hg19Te16, Hg19Te28, and Hg28Te19 are\\ud\n semiconductors, while the other two clusters with unchanged symmetry\\ud\n are still semimetallic in nature. Therefore, as well as the size\\ud\n quantization, the symmetry of a cluster would seem to be another\\ud\n significant factor to determine its HOMO-LUMO gaps.<\/dc:description><dc:subject>\n        Small semiconductor crystallites<\/dc:subject><dc:subject>\n         Quantum dots<\/dc:subject><dc:subject>\n         CDSE nanocrystals<\/dc:subject><dc:subject>\n         Surface relaxation<\/dc:subject><dc:subject>\n         CDTE nanocrystals<\/dc:subject><dc:subject>\n         Room temperature<\/dc:subject><dc:subject>\n         Size<\/dc:subject><dc:subject>\n         Energy<\/dc:subject><dc:subject>\n         Nanoclusters<\/dc:subject><dc:subject>\n         Chemistry.<\/dc:subject><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review B, 2004, Vol.70(23), pp.235328 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2004-12-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7628<\/dc:identifier><dc:identifier>\n        issn:1098-0121<\/dc:identifier><dc:identifier>\n        issn: 1550-235X<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevB.70.235328<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7628\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevB.70.235328<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7628\/1\/7628.pdf<\/dc:identifier><dc:rights>\n        © 2004 by The American Physical Society. All rights reserved.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1098-0121"," 1550-235x","1098-0121","issn: 1550-235X"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["Small semiconductor crystallites","Quantum dots","CDSE nanocrystals","Surface relaxation","CDTE nanocrystals","Room temperature","Size","Energy","Nanoclusters","Chemistry."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n08 December 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWang, X.Q. and Clark, S.J. and Abram, R.A. (2004) ’Ab initio calculations of the structural and electronic\nproperties of HgmTen clusters.’, Physical review B., 70 (23). p. 235328.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevB.70.235328\nPublisher’s copyright statement:\n2004 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nAb initio calculations of the structural and electronic properties of HgmTen clusters\nX. Q. Wang,1,* S. J. Clark,2 and R. A. Abram2\n1Department of Physics, College of Science, Chongqing University, Chongqing 400044, People’s Republic of China\n2Department of Physics, University of Durham, South Road, Durham DH1 3LE, United Kingdom\n(Received 17 November 2003; revised manuscript received 2 August 2004; published 21 December 2004)\nThe structural and electronic properties of HgmTen (mÞn=13, 16, 19, and 28) clusters are calculated using\ndensity functional formalism and the pseudopotential method within the generalized gradient approximation.\nThe initial structures of all the clusters are chosen to be fragments of bulk phase HgTe with Td symmetry. It is\nfound that the relaxed structures of Hg13Te16 and Hg16Te19 retain their initial symmetry, whereas those of\nHg16Te13, Hg19Te16, Hg19Te28s=Hg16Te19+12Ted, and Hg28Te19s=Hg16Te19+12Hgd, due to the Jahn-Teller\ndistortions except for the last one, change to lower symmetries. However, it is apparent that the 12 additional\nTe atoms in the Hg19Te28 cluster act to stabilize the Hg19Te16 core, while the 12 additional Hg atoms in the\nHg28Te19 cluster do not do so. It is also found that all the clusters studied here are initially semimetals with\nzero or very small highest occupied molecular orbital (HOMO) - lowest unoccupied molecular orbital (LUMO)\ngaps. However, after structural relaxation, Hg16Te13, Hg19Te16, Hg19Te28, and Hg28Te19 are semiconductors,\nwhile the other two clusters with unchanged symmetry are still semimetallic in nature. Therefore, as well as the\nsize quantization, the symmetry of a cluster would seem to be another significant factor to determine its\nHOMO-LUMO gaps.\nDOI: 10.1103\/PhysRevB.70.235328 PACS number(s): 68.65.Hb, 61.46.1w, 71.15.Mb, 73.22.2f\nI. INTRODUCTION\nSemiconductor nanoparticles or quantum dots (QDs) have\nattracted much attention over the last decade due to their\nunique physical properties and potential use in a wide range\nof applications.1,2 For example, high-quality II-VI semicon-\nductor (CdS, CdSe, CdTe, and HgTe) quantum dots, which\nare promising candidates for use in light emitting devices\n(LEDs) with tuneable emission, have recently been synthe-\nsized by colloidal chemistry.3–9 Meanwhile, there have been\na number of theoretical studies devoted to the structural,\nelectronic, and optical properties of these QDs and the\nsmaller bare clusters.10–24\nIn much previous theoretical work, the effective mass\nmethod has been applied to investigate the size-dependent\nelectronic properties of the larger QDs, in which the under-\nlying structure is less important.25–29 Alternatively, semi-\nempirical tight-binding methods have been used to get more\ndetailed structural and electronic information of QDs up to\n31 Å diameter.15,18–22 Also the atomistic pseudopotential ap-\nproach has been applied to study the quasiparticle gap23 and\nthe excitonic transitions24 of QDs. However, there have been\nmuch fewer first principles studies due to the computational\ndemands. Gurin13,16,30 used a Hartree-Fock based method to\ninvestigate the electronic and atomic structures of CdS and\nZnS clusters of about 10 atoms, and found that the micro-\nscopic structure and bonding have more of an influence on\nthe electronic properties than the quantum confinement of\nelectrons. Eichkorn and Ahlrichs14 have computed the struc-\ntural and electronic characteristics of small ligand-stabilized\nCdSe clusters using a density functional theory (DFT) ap-\nproach, and proposed some structural principles for clusters\nof this kind. Applying a simplified linear combination of\natomic orbitals scheme based on the local density approxi-\nmation (LDA), Joswig et al.12 have studied the properties of\nCdS clusters with up to 200 atoms and found that the relative\nstability of zincblende and wurzite structures is strongly de-\npendent on the size of the system, and also that there is a\nclose connection between the stability of the dot and the size\nof the band gap. In a more recent ab initio study, Tro-\nparevsky and Chelikowsky10 calculated the ground state\nstructural and electronic properties of CdS and CdSe clusters\nwith up to 16 atoms using the finite-difference pseudopoten-\ntial method within the LDA and found a strong correlation\nbetween the binding energy and the highest occupied mo-\nlecular orbital (HOMO) and lowest unoccupied molecular\norbital (LUMO) gap.\nAmong the II-VI QDs mentioned above, HgTe dots are of\nparticular interest. This is because bulk HgTe is a semimetal\nwith a small negative band gap of around −0.14 eV at 300\nK,31 and a semimetal-to-semiconductor transition can thus be\nproduced by size quantization. As a result, HgTe QDs of an\nappropriate size have been proposed as the active component\nof optical amplifiers operating at 1.3 and 1.5 µm wavelengths\nfor use in telecommunication systems.8,32,33 Obviously, HgTe\ndots are of significant interest both from the fundamental\npoint of view and for their potential applications, and it is\nimportant to get a better understanding of their properties.\nUnfortunately, there are only a few experimental investiga-\ntions of HgTe dots,8,32 and almost all previous theoretical\nstudies of II-VI semiconductor QDs have been devoted to\nCdSe and (or) CdS QDs. To our knowledge, no first-\nprinciples study of HgTe QDs or clusters have been reported\nso far.\nAs a first stage in working towards the study of the HgTe\nQDs containing more than 100 atoms, which can be readily\nproduced experimentally, we shall focus on some smaller\nbare clusters in this paper. In fact, the theoretical study of\nsmall clusters is also challenging due to their many degrees\nof freedom, the possibility of low symmetry structures, and\nthe lack of good structural information from experiment. In\nab initio calculations, the predicted structure of a cluster may\nPHYSICAL REVIEW B 70, 235328 (2004)\n1098-0121\/2004\/70(23)\/235328(6)\/$22.50 ©2004 The American Physical Society235328-1\ndepend sensitively on the initial structure used since to opti-\nmize the structure completely to seek its ground state is ex-\ntremely computationally expensive. Such geometrical opti-\nmization has only been carried out for very small CdS and\nCdSe clusters using Langevin molecular dynamics (LMD)\ncoupled with the simulated annealing procedure.10 However,\nonce the cluster size exceeds about 15 atoms, this method\nmay not be reliable owing to the long simulation times re-\nquired. Therefore, in the present work, we concentrate on the\nstructural relaxations of a group of nonstoichiometric\nHgmTensmÞnd clusters starting from initial states with high\nsymmetry. By analyzing the relaxed clusters, we not only can\nget some information about the size effects on the binding\nenergy and an estimate of the HOMO-LUMO gap, but also\nwe aim to investigate the relation between the initial and the\nrelaxed structures and the influence of the relative ratio of the\nnumbers of component atoms within the nonstoichiometric\nclusters on their physical properties.\nFinally, the DFT calculations carried out so far for II-VI\nsemiconductor clusters10–12,14 are within the framework of\nLDA, which is believed to substantially overestimate the\nbinding energies of small systems such as molecules and\nclusters. In this paper, we shall instead use the generalized\ngradient approximation (GGA), which can be expected to\nproduce more reliable predictions of the structures and\nslightly better band gaps. Before carrying out the calcula-\ntions reported here, we applied the same method (both within\nLDA and GGA) to small sCdSedn clusters as a test. The LDA\nbinding energies and energy gaps obtained were in good\nagreement with those of Troparevsky et al.11 and the GGA\nbinding energies were a little lower as expected.\nII. DETAILS OF THE CALCULATIONS\nBecause there is no direct experimental information about\nthe structure of HgTe clusters, we chose the initial clusters as\nparts of the bulk phase HgTe. Although the structures, sym-\nmetries, and coordination numbers of small clusters could be\nvery different from those of the bulk material, we believe\nthat the clusters of medium size sN=30–50d chosen in this\nway are a reasonably representative sample. In this paper, we\nfocused on six nonstoichiometric HgmTen (mÞn=13, 16, 19,\nand 28) clusters, which were initially constructed as the frag-\nments of bulk HgTe in the zincblende structure and have the\nsame Td symmetry as a unit cell of the crystal [shown in\nFigs. 1(a), 2(a), and 3(a)]. Note that we can easily get the\ninitial Hg19Te16 and Hg19Te28 structures from the initial\nHg13Te16 structure by adding the Hg and Te atoms to it sym-\nmetrically. Also the initial Hg16Te13, Hg16Te19, and Hg28Te19\nclusters with the same symmetry can be obtained by just\nsimply exchanging the positions of Hg and Te atoms in the\nabove three clusters. These choices are convenient for us to\ncompare the roles of the two types of atoms within the clus-\nters.\nThe CASTEP code34 has been used for our ab initio\ndensity-functional calculations based on the pseudopotential\nmethod in the GGA. For the Hg atoms, the d electrons were\nnot frozen in the ionic core, but were instead treated as va-\nlence electrons, which is necessary to obtain reliable predic-\ntion of the structural and electronic properties of the clusters.\nThe electron-ion interaction was described using Vanderbilt’s\nultrasoft pseudopotentials35 and the exchange and correlation\nFIG. 1. (Color online) The initial and the relaxed structures of\nHg13Te16 and Hg16Te13 clusters. Hg: dark ball; and Te: light ball. FIG. 2. (Color online) The initial and the relaxed structures ofHg16Te19 and Hg16Te19 clusters. Hg: dark ball; and Te: light ball.\nWANG, CLARK, AND ABRAM PHYSICAL REVIEW B 70, 235328 (2004)\n235328-2\nfunctional for the GGA was taken to have the form devel-\noped by Perdew, Burke, and Ernzerhof (PBE).36 The relativ-\nistic effects, which are important for the electronic properties\nof a heavy element such as Hg, are also taken into account in\nCASTEP code.\nSince the valence electronic wave functions are expanded\nin a plane wave basis set in CASTEP, periodic boundary\nconditions must be used. To apply these conditions, we have\nto construct a periodic array of clusters and then consider a\nsupercell of the system. In our calculations, the cutoff energy\nof the plane wave basis set was 400 eV, which converges the\ntotal energy of the supercell to about 0.005 eV\/atom. Mean-\nwhile, the size of the supercell is set to be 19.9 Å, which is\nsufficiently large that the interactions between the clusters\nare negligible even for the largest cluster in the present study.\nA preconditioned conjugate gradients routine37 was used to\nminimize the total energy of the electronic system, and for\ngeometry optimization, we utilized the Broyden-Fletcher-\nGoldfarb-Shanno (BFGS)38–41 algorithm, which is more ef-\nficient for a complex system than the commonly used conju-\ngate gradients approach.\nIII. RESULTS AND DISCUSSIONS\nThe initial and the relaxed structures of HgmTen clusters\n(mÞn=13, 16, 19, and 28) are shown and compared in Figs.\n1–3. First, we examine the changes of the symmetry of each\ncluster after structural relaxation. Although the initial sym-\nmetries of all the clusters are Td, the relaxed clusters do have\ndifferent symmetries (as listed in Table I). We noticed that,\nfor the Te-rich clusters Hg13Te16 and Hg16Te19, with the\nlarger binding energies, the structural relaxations were not\nlarge enough to break their initial Td symmetry, and thus\ntheir structures more closely resemble those of the HgTe\nbulk phase fragments, but for the Hg-rich clusters with the\nweaker binding, the structural relaxations broke their initial\nsymmetry and the lower C3v and Cs symmetries become fa-\nvorable for Hg16Te13 and Hg19Te16, respectively. Among\nthese clusters, the relaxed structure of Hg19Te16 is especially\nnoticeable since it has almost lost all its initial symmetric\nproperties. During its relaxation, the Hg atom at the center of\nthe cluster has pushed the nearest four Te atoms away from\nit, so that the average length of the corresponding four bonds\n(4.37 Å) is much greater than the average taken over the\nwhole cluster (3.01 Å). Meanwhile, there are two Hg atoms\non the surface that have moved outwards [see Fig. 2(c)]. The\noverall result is that the symmetry of the cluster is changed\nfrom Td to Cs. Indeed, the symmetry breakings of Hg16Te13\nand Hg19Te16 (also Hg28Te19 below) can be attributed to the\nJahn-Teller distortion, and this will be discussed later.\nFIG. 3. (Color online) The initial and the relaxed structures of\nHg19Te28 and Hg19Te28 clusters. Hg: dark ball; and Te: light ball.\nFIG. 4. (Color online) Isosurfaces of total electron density of the\nrelaxed Hg19Te28 clusters (view along the c axis of the supercell).\nThe value of the electron density on the surfaces shown is\n0.15 electrons\/Å3.\nTABLE I. The symmetries, average Hg–Te bond lengths, bind-\ning energies, and HOMO-LUMO gaps of the relaxed HgmTen (m\nÞn=13, 16, 19, and 28) clusters.\nCluster Symmetry\nAverage bond\nlength (Å)\nBinding energy\nseV\/atomd\nGap\n(eV)\nHg13Te16 Td 2.79 1.70 0.01\nHg16Te13 C3v 2.86 1.49 1.16\nHg16Te19 Td 2.80 1.70 0.00\nHg19Te16 Cs 3.01 1.56 1.63\nHg19Te28 C3v 2.90 1.94 0.34\nHg28Te19 C1 2.99 1.36 0.77\nAB INITIO CALCULATIONS OF THE STRUCTURAL\u0085 PHYSICAL REVIEW B 70, 235328 (2004)\n235328-3\nThe situation for the Hg19Te28 and Hg28Te19 is a little\ndifferent from that for the other four clusters. Their initial\nconfigurations were constructed by symmetrically adding 12\nsingly bonded Te atoms to Hg19Te16 sHg19Te16+12Ted and\n12 singly bonded Hg atoms to Hg16Te19 sHg16Te19+12Hgd,\nrespectively. The role of these 12 extra atoms should be\nsomewhat similar to that of ligand molecules, and can be\nexpected to make the original cluster more stable. Therefore\nit is no surprise that the Hg19Te28 cluster relaxed to a state\nwith higher symmetry sC3vd and larger binding energy\ns1.94 eV\/atomd than for the Hg19Te16 (Cs and\n1.56 eV\/atom). Because of the 12 extra Te atoms, the\nHg19Te16 core did not relax like the bare Hg19Te16 cluster,\nbut in the manner similar to Hg16Te19, keeping the initial Td\nsymmetry. The overall symmetry of the relaxed Hg19Te28\nwas reduced to C3v only because the 12 extra Te atoms\nformed Te–Te bonds in two different ways. The Te atoms go\ninto four groups of three atoms. In one group, the atoms form\nthree bonds with an equal length of 2.73 Å, and in the other\nthree groups, only two bonds are formed with a length of\n2.69 Å. The Te–Te bonds are clearly shown in Fig. 4, where\nan isosurface of the total electron density of the relaxed\nHg19Te28 cluster is presented. In the case of ligand mol-\necules, there would be no bond formed between them be-\ncause of the absence of dangling bonds. However, the struc-\nture of the Hg28Te19 cluster relaxed in a less regular way. As\nFIG. 5. The density of states of the initial (a)\nand the relaxed (b) Hg19Te16 cluster. The curves\nare plotted by applying Gaussian broadening with\na width of 0.2 eV to the CASTEP eigenvalues. The\nFermi energy is set to be the zero point of the\nenergy for each case.\nFIG. 6. The density of states of the initial (a)\nand the relaxed (b) Hg19Te28 cluster. The curves\nare plotted in the same way as in Fig. 5.\nWANG, CLARK, AND ABRAM PHYSICAL REVIEW B 70, 235328 (2004)\n235328-4\na result, the symmetry of this cluster is changed from Td to\nC1. This means that the 12 extra Hg atoms in the Hg28Te19\ncluster do not act like the 12 extra Te atoms in the Hg19Te28\ncluster. We note that it may not be a very good approxima-\ntion to use Hg or Te as surfactants, but in this work we\ninitially wish to study only the “pure” material. Using other\nsurfactants such as small organic molecules is of interest and\nwill be a future study of ours.\nBy comparing the initial and the relaxed structures of the\nsix clusters discussed above, we also found that the outer-\nmost Hg atoms have the tendency to move inwards whereas\nthe Te atoms have the tendency to move outwards in almost\nall the cases except for Hg19Te16, in which the motion of the\natoms is rather more complicated. This phenomenon is simi-\nlar to that found in the surface relaxations of CdS and CdSe\nclusters,12,22,42,43 where the outermost Cd atoms move in-\nwards while the S or Se atoms move outwards.\nThe calculated binding energies and HOMO-LUMO gaps\nof the relaxed clusters are listed in Table I. The results show\nthat the Hg-rich clusters, with lower symmetries and smaller\nbinding energies, have larger energy gaps s.1 eVd, and the\nTe-rich clusters, with higher symmetries and larger binding\nenergies, possess smaller energy gaps s,0.4 eVd. All three\nHg-rich clusters become semiconductors, whereas only one\nof the Te-rich clusters (Hg19Te28 in Cv symmetry) becomes a\nsemiconductor with a energy gap of 0.34 eV. The other two\nclusters (Hg13Te16 and Hg16Te19, both in Td symmetry) are\nstill semimetals, as for the bulk phase HgTe. It is interesting\nto consider why the size-effect does not lead to a semimetal-\nsemiconductor transition in the two Te-rich clusters. To an-\nswer this question, we compared the initial and the relaxed\nenergy level structures and HOMO-LUMO gaps of the clus-\nters. It was found that for the initial configurations with Td\nsymmetry the HOMOs and LUMOs of the clusters are de-\ngenerate (for Hg16Te13, Hg19Te16, and Hg19Te16+12Te) or\nare very close to each other (for Hg13Te16, Hg16Te19,\nand Hg16Te19+12Hg). After relaxation, Hg16Te13,\nHg19Te16, Hg19Te16+12Te, and Hg16Te19+12Hg reached fi-\nnal states with lower symmetries and the degeneracy of their\nHOMOs and LUMOs is eliminated, resulting in the appear-\nance of energy gaps of more than 0.3 eV. This is just the\nresult of the so-called Jahn-Teller distortions. But for\nHg13Te16 and Hg16Te19, because their HOMOs and LUMOs\nare not degenerate (though very close to each other), the\nJahn-Teller distortions did not occur. So, the relaxed\nHg13Te16 and Hg16Te19 clusters keep initial Td symmetry,\nand the basic characteristics of their energy level structure\nare also unchanged, the HOMO-LUMO gaps being still al-\nmost zero. In Figs. 5 and 6, the densities of states of\nHg19Te16 and Hg19Te28 clusters before and after relaxation\nare shown. In Fig. 5(b), the formation of the energy gap of\nthe relaxed Hg19Te16 cluster is very clear. It appears that, at\nleast for the small clusters, the symmetry is another impor-\ntant factor to determine the energy gap besides the size quan-\ntization.\nIn the previous theoretical studies for the stoichiometric\nCdS and CdSe clusters,10–12 it had been found that the cal-\nculated HOMO-LUMO gaps correlate strongly with the cal-\nculated binding energies. In the present study, if we compare\nthe Te-rich and Hg-rich clusters, or compare each pair of\nclusters with the same total number of atoms, a similar cor-\nrelation can be found in both cases although the number of\nthe clusters studied here is not large enough to reach a defi-\nnite conclusion. However, it is clear that the energy gaps are\nclosely related to the symmetries of the clusters, and some of\nthe studied clusters have larger gaps due to the Jahn-Teller\ndistortions.\nIV. CONCLUSION\nIn summary, the structural and electronic properties\nof HgmTen (mÞn=13, 16, 19, and 28) clusters have\nbeen calculated by density functional techniques. In what\nwe believe is the first ab initio study of HgmTen clusters,\nour results show that the relaxed structures of Hg13Te16\nand Hg16Te19 clusters keep the Td symmetry of the\ninitial state used in the calculations, whereas those\nof Hg16Te13, Hg19Te16, Hg19Te28s=Hg16Te19+12Ted, and\nHg28Te19s=Hg16Te19+12Hgd change to lower symmetries\ndue to the Jahn-Teller distortions except for the last one. The\n12 singly bonded Te atoms added to the Hg19Te16 cluster\nbehave rather like ligand molecules and act to stabilize the\ninitial structures of the core. But the 12 single bonded Hg\natoms added to Hg16Te19 cluster seem not to act in the same\nway. It is also found that, as well as the size quantization, the\nsymmetry of a cluster is another significant factor in deter-\nmining the HOMO-LUMO gaps. In the initial state, all the\nclusters studied here are semimetals with zero or very small\nHOMO-LUMO gaps. After relaxation, due to the change of\nthe symmetry, Hg16Te13, Hg19Te16, Hg19Te28, and Hg28Te19\nbecome semiconductors, while the other two clusters with\nunchanged symmetry are still semimetals.\n*Email address: xqwang@cqu.edu.cn\n1 A. D. Yoffe, Adv. Phys. 42, 173 (1993).\n2 A. P. Alivisatos, J. Phys. Chem. 100, 13226 (1996).\n3 T. Vossmeyer, L. Katsikas, M. Giersig, I. G. Popovoc, K. Diesner,\nA. Chemseddine, A. Eychmüller, and H. Weller, J. Phys. Chem.\n98, 7665 (1994).\n4 A. L. Rogach, A. Kornowski, M. Gao, A. Eychmüller, and H.\nWeller, J. Phys. Chem. 103, 3065 (1999).\n5 A. L. Rogach, L. Katsikas, A. Kornowski, D. Su, A. Eychmüller,\nand H. Weller, Ber. Bunsenges. Phys. Chem. 100, 1772 (1996).\n6 A. L. Rogach, L. Katsikas, A. Kornowski, D. Su, A. Eychmüller,\nand H. Weller, Ber. Bunsenges. Phys. Chem. 101, 1668 (1997).\n7 M. Gao, S. Kirstein, H. Möhwald, A. L. Rogach, A. Kornowski,\nA. Eychmüller, and H. Weller, J. Phys. Chem. B 102, 8360\n(1998).\n8 A. L. Rogach, S. V. Kershaw, M. Burt, M. Harrison, A. Kor-\nnowski, A. Eychmüller, and H. Weller, Adv. Mater. (Weinheim,\nGer.) 11, 552 (1999).\nAB INITIO CALCULATIONS OF THE STRUCTURAL\u0085 PHYSICAL REVIEW B 70, 235328 (2004)\n235328-5\n9 S. V. Kershaw, M. Burt, M. Harrison, A. L. Rogach, H. Weller,\nand A. Eychmüller, Appl. Phys. Lett. 75, 1694 (1999).\n10 M. C. Troparevsky and J. R. Chelikowsky, J. Chem. Phys. 114,\n943 (2001).\n11 M. C. Troparevsky, L. Kronik, and J. R. Chelikowsky, Phys. Rev.\nB 65, 033311 (2001).\n12 J-O. Joswig, M. Springborg, and G. Seifert, J. Phys. Chem. B\n104, 2617 (2000).\n13 V. S. Gurin, Int. J. Quantum Chem. 71, 337 (1999).\n14 K. Eichkorn and R. Ahlrichs, Chem. Phys. Lett. 288, 235 (1998).\n15 K. Leung and K. B. Whaley, J. Chem. Phys. 110, 11012 (1999).\n16 V. S. Gurin, Solid State Commun. 108, 389 (1998).\n17 K. Leung, S. Pokrant, and K. B. Whaley, Phys. Rev. B 57, 12 291\n(1998).\n18 N. A. Hill and K. B. Whaley, J. Chem. Phys. 100, 2831 (1994).\n19 N. A. Hill and K. B. Whaley, J. Chem. Phys. 99, 3707 1993).\n20 P. E. Lippens and M. Lannoo, Phys. Rev. B 41, 6079 (1990).\n21 P. E. Lippens and M. Lannoo, Phys. Rev. B 39, 10 935 (1989).\n22 Y. R. Wang and C. B. Duke, Phys. Rev. B 37, 6417 (1988).\n23 A. Franceschetti and A. Zunger, Appl. Phys. Lett. 76, 1731\n(2000).\n24 L. W. Wang and A. Zunger, J. Phys. Chem. 102, 6449 (1998).\n25 L. E. Brus, J. Chem. Phys. 79, 5566 (1983).\n26 L. E. Brus, J. Chem. Phys. 80, 4403 (1984).\n27 H. M. Schmidt and H. Weller, Chem. Phys. Lett. 129, 615\n(1986).\n28 G. T. Einevoll, Phys. Rev. B 45, 3410 (1992).\n29 Y. Masumoto and K. Sonobe, Phys. Rev. B 56, 9734 (1997).\n30 V. S. Gurin, Z. Phys. D: At., Mol. Clusters 42, 65 (1997).\n31 Semiconductors: Basic Data, 2nd revised ed., edited by O. Made-\nlung (Springer, Berlin, 1996), p. 187.\n32 M. T. Harrison, S. V. Kershaw, M. G. Murt, A. L. Rogach, A.\nKornowski, A. Eychmüller, and H. Weller, Pure Appl. Chem.\n72, 295 (2000).\n33 A. Eychmüller and A. L. Rogach, Pure Appl. Chem. 72, 179\n(2000).\n34 M. D. Segall, P. L. D. Lindan, M. J. Probert, C. J. Pickard, P. J.\nHasnip, S. J. Clark, and M. C. Payne, J. Phys.: Condens. Matter\n14, 2717 (2002).\n35 D. Vanderbilt, Phys. Rev. B 41, 7892 (1990).\n36 J. P. Perdew, K. Burke, and M. Ernzerhof, Phys. Rev. Lett. 77,\n3865 (1996).\n37 M. C. Payne, M. P. Teter, and J. D. Joannopolous, Rev. Mod.\nPhys. 64, 1045 (1992).\n38 C. G. Broyden, J. Inst. Math. Appl. 6, 76 (1970).\n39 R. Fletcher, Comput. J. 13, 317 (1970).\n40 D. Goldfarb, Math. Comput. 24, 23 (1970).\n41 D. F. Shanno, Math. Comput. 24, 674 (1970).\n42 T. N. Horsky, G. R. Brandes, K. F. Canter, C. B. Duke, A. Paton,\nD. L. Lessor, A. Kahn, S. F. Horng, K. Stevens, K. Stiles, and A.\nP. Mills, Jr., Phys. Rev. B 46, 7011 (1992).\n43 P. Schröer, P. Krüger, and J. Pollmann, Phys. Rev. B 49, 17 092\n(1994).\nWANG, CLARK, AND ABRAM PHYSICAL REVIEW B 70, 235328 (2004)\n235328-6\n"}