{"doi":"10.1002\/sat.777","coreId":"135448","oai":"oai:bradscholars.brad.ac.uk:10454\/2635","identifiers":["oai:bradscholars.brad.ac.uk:10454\/2635","10.1002\/sat.777"],"title":"Advances of Aeronautical Communications in the EU Framework","authors":["Hu, Yim-Fun","Holzbock, Matthias","Jahn, Axel","Werner, Markus"],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2009-05-12T15:56:49Z","abstract":"NoThis paper reports on the advancement in the research and development of aeronautical satellite communications within the EU framework. Starting from key aspects such as spectrum regulatory and marketing issues which affect the development of aeronautical communication systems, discussion on the motivation behind the two EU projects, ABATE and WirelessCabin and their interconnection then follows. ABATE concentrated on the development of an aeronautical communications system for flight routes in the European and Northern Atlantic regions. The enabling technology considered in ABATE is discussed. Major achievements and results obtained in the project are reported in this paper. These include the development of a powerful software tool based on a logical design methodology for aeronautical satellite communication systems as well as the characterization of the aeronautical channel through a series of channel measurement campaign and a demonstration of in-flight multimedia satellite communication. The evolvement from ABATE to WirelessCabin is then highlighted. The main objective and current development of WirelessCabin since the start of the project are presented. In particular, issues on electromagnetic compatibility between different electronic equipments on board the aircraft cabin are discussed. Networking aspects for mobility, QoS and VPN support are studied. Specifically, different scenarios for the location management and address assignment schemes for mobility and VPN support are discussed in detail","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/2635<\/identifier><datestamp>\n                2016-07-25T16:37:54Z<\/datestamp><setSpec>\n                com_10454_413<\/setSpec><setSpec>\n                col_10454_6345<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nAdvances of Aeronautical Communications in the EU Framework<\/dc:title><dc:creator>\nHu, Yim-Fun<\/dc:creator><dc:creator>\nHolzbock, Matthias<\/dc:creator><dc:creator>\nJahn, Axel<\/dc:creator><dc:creator>\nWerner, Markus<\/dc:creator><dc:subject>\nAeronautical<\/dc:subject><dc:subject>\nBroadband<\/dc:subject><dc:subject>\nCommunications<\/dc:subject><dc:subject>\nAeronautical channel characterizations<\/dc:subject><dc:subject>\nSatellites<\/dc:subject><dc:subject>\nABATE<\/dc:subject><dc:subject>\nWirelessCabin<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nThis paper reports on the advancement in the research and development of aeronautical satellite communications within the EU framework. Starting from key aspects such as spectrum regulatory and marketing issues which affect the development of aeronautical communication systems, discussion on the motivation behind the two EU projects, ABATE and WirelessCabin and their interconnection then follows. ABATE concentrated on the development of an aeronautical communications system for flight routes in the European and Northern Atlantic regions. The enabling technology considered in ABATE is discussed. Major achievements and results obtained in the project are reported in this paper. These include the development of a powerful software tool based on a logical design methodology for aeronautical satellite communication systems as well as the characterization of the aeronautical channel through a series of channel measurement campaign and a demonstration of in-flight multimedia satellite communication. The evolvement from ABATE to WirelessCabin is then highlighted. The main objective and current development of WirelessCabin since the start of the project are presented. In particular, issues on electromagnetic compatibility between different electronic equipments on board the aircraft cabin are discussed. Networking aspects for mobility, QoS and VPN support are studied. Specifically, different scenarios for the location management and address assignment schemes for mobility and VPN support are discussed in detail.<\/dc:description><dc:date>\n2009-05-12T15:56:49Z<\/dc:date><dc:date>\n2009-05-12T15:56:49Z<\/dc:date><dc:date>\n2009-05-12T15:56:49Z<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nNo full-text available in the repository<\/dc:type><dc:identifier>\nHu, Yim- Fun, Holzbock, M., Jahn, A., Werner, M., (2004) Advances of Aeronautical Communications in the EU Framework. International Journal of Satellite Communications and Networking, Vol. 22 no. 1, pp. 113 - 137.<\/dc:identifier><dc:identifier>\n90006265<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/2635<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\n10.1002\/sat.777<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["10.1002\/sat.777"],"year":2009,"topics":["Aeronautical","Broadband","Communications","Aeronautical channel characterizations","Satellites","ABATE","WirelessCabin"],"subject":["Article","No full-text available in the repository"],"fullText":null}