{"doi":"10.1161\/CIRCULATIONAHA.105.555474","coreId":"195271","oai":"oai:lra.le.ac.uk:2381\/7342","identifiers":["oai:lra.le.ac.uk:2381\/7342","10.1161\/CIRCULATIONAHA.105.555474"],"title":"Association of WNK1 Gene Polymorphisms and Haplotypes With Ambulatory Blood Pressure in the General Population","authors":["Tobin, Martin D.","Raleigh, Stuart M.","Newhouse, Stephen J.","Braund, Peter S.","Bodycote, Clare","Ogleby, Jenny","Cross, Deborah","Gracey, Jay","Hayes, Saija","Smith, Terry","Ridge, Cathy","Caulfield, Mark J.","Sheehan, Nuala A.","Munroe, Patricia B.","Burton, Paul R.","Samani, Nilesh J."],"enrichments":{"references":[{"id":44685411,"title":"Adjusting for treatment effects in studies of quantitative traits: antihypertensive therapy and systolic blood pressure. Stat Med.","authors":[],"date":"2005","doi":"10.1002\/sim.2165","raw":"Tobin MD, Sheehan NA, Scurrah KJ, Burton PR. Adjusting for treatment effects in studies of quantitative traits: antihypertensive therapy and systolic blood pressure. Stat Med. 2005;24:2911–2935.","cites":null},{"id":44685428,"title":"Age-specific relevance of usual blood pressure to vascular mortality: a meta-analysis of individual data for one million adults in 61 prospective studies.","authors":[],"date":null,"doi":"10.1016\/s0140-6736(02)11911-8","raw":"Lewington S, Clarke R, Qizilbash N, Peto R, Collins R. Age-specific relevance of usual blood pressure to vascular mortality: a meta-analysis of individual data for one million adults in 61 prospective studies. Lancet. 2002;360:1903–1913.","cites":null},{"id":44685406,"title":"Choosing haplotype-tagging SNPS based on unphased genotype data using a preliminary sample of unrelated subjects with an example from the Multiethnic Cohort Study. Hum Hered.","authors":[],"date":"2003","doi":"10.1159\/000071807","raw":"Stram DO, Haiman CA, Hirschhorn JN, Altshuler D, Kolonel LN, Henderson BE, Pike MC. Choosing haplotype-tagging SNPS based on unphased genotype data using a preliminary sample of unrelated subjects with an example from the Multiethnic Cohort Study. Hum Hered. 2003;55:27–36.","cites":null},{"id":44685413,"title":"Clinical significance not statistical significance: a simple Bayesian alternative to p values.","authors":[],"date":"1998","doi":"10.1136\/jech.52.5.318","raw":"Burton PR, Gurrin LC, Campbell MJ. Clinical significance not statistical significance: a simple Bayesian alternative to p values. J Epidemiol Community Health. 1998;52:318–323.","cites":null},{"id":44685426,"title":"Correcting for non-random ascertainment in generalized linear mixed models (GLMMs) fitted using Gibbs sampling. Genet Epidemiol.","authors":[],"date":"2003","doi":"10.1002\/gepi.10206","raw":"Burton PR. Correcting for non-random ascertainment in generalized linear mixed models (GLMMs) fitted using Gibbs sampling. Genet Epidemiol. 2003;24:24–35.","cites":null},{"id":44685341,"title":"Effectiveness and costs of interventions to lower systolic blood pressure and cholesterol: a global and regional analysis on reduction of cardiovascular-disease risk.","authors":[],"date":null,"doi":"10.1016\/s0140-6736(03)12655-4","raw":"Murray CJ, Lauer JA, Hutubessy RC, Niessen L, Tomijima N, Rodgers A, Lawes CM, Evans DB. Effectiveness and costs of interventions to lower systolic blood pressure and cholesterol: a global and regional analysis on reduction of cardiovascular-disease risk. Lancet. 2003;361: 717–725.","cites":null},{"id":44685430,"title":"Effects on blood pressure of reduced dietary sodium and the Dietary Approaches to Stop Hypertension (DASH) diet; DASH-Sodium Collaborative Research Group.","authors":[],"date":"2001","doi":"10.1056\/nejm200101043440101","raw":"Sacks FM, Svetkey LP, Vollmer WM, Appel LJ, Bray GA, Harsha D, Obarzanek E, Conlin PR, Miller ER 3rd, Simons-Morton DG, Karanja N, Lin PH, Group DA-SCR. Effects on blood pressure of reduced dietary sodium and the Dietary Approaches to Stop Hypertension (DASH) diet; DASH-Sodium Collaborative Research Group. N Engl J Med. 2001; 344:3–10. Tobin et al PRKWNK1 Gene Variants and Blood Pressure 3429 at University of Leicester (lei) \/ England on December 9, 2009 circ.ahajournals.orgDownloaded from","cites":null},{"id":44685343,"title":"Evidence for a gene influencing blood pressure on chromosome 17: genome scan linkage results for longitudinal blood pressure phenotypes in subjects from the Framingham Heart Study.","authors":[],"date":null,"doi":"10.1161\/01.hyp.36.4.477","raw":"Levy D, DeStefano AL, Larson MG, O’Donnell CJ, Lifton RP, Gavras H, Cupples LA, Myers RH. Evidence for a gene influencing blood pressure on chromosome 17: genome scan linkage results for longitudinal blood pressure phenotypes in subjects from the Framingham Heart Study. Hypertension. 2000;36:477–483.","cites":null},{"id":44685416,"title":"Family-based tests for associating haplotypes with general phenotype data: application to asthma genetics. Genet Epidemiol.","authors":[],"date":"2004","doi":"10.1002\/gepi.10295","raw":"Horvath S, Xu X, Lake SL, Silverman EK, Weiss ST, Laird NM. Family-based tests for associating haplotypes with general phenotype data: application to asthma genetics. Genet Epidemiol. 2004;26:61–69.","cites":null},{"id":44685342,"title":"Genetic determinants of hypertension: identification of candidate phenotypes.","authors":[],"date":null,"doi":"10.1161\/01.hyp.36.1.7","raw":"Kotchen TA, Kotchen JM, Grim CE, George V, Kaldunski ML, Cowley AW, Hamet P, Chelius TH. Genetic determinants of hypertension: identification of candidate phenotypes. Hypertension. 2000;36:7–13.","cites":null},{"id":44685409,"title":"Genetic variance components analysis for binary phenotypes using generalized linear mixed models (GLMMs) and Gibbs sampling. Genet Epidemiol.","authors":[],"date":"1999","doi":"10.1002\/(sici)1098-2272(1999)17:2<118::aid-gepi3>3.0.co;2-v","raw":"Burton PR, Tiller KJ, Gurrin LC, Cookson WO, Musk AW, Palmer LJ. Genetic variance components analysis for binary phenotypes using generalized linear mixed models (GLMMs) and Gibbs sampling. Genet Epidemiol. 1999;17:118–140.","cites":null},{"id":44685403,"title":"Haplotypes of the WNK1 gene associate with blood pressure variation in a severely hypertensive population from the British Genetics of Hypertension (BRIGHT) study. Hum Mol Genet.","authors":[],"date":"2005","doi":"10.1097\/00004872-200406002-00740","raw":"Newhouse SJ, Wallace C, Dobson R, Mein C, Pembroke J, Farrall M, Clayton D, Brown M, Samani N, Dominiczak A, Connell JM, Webster J, Lathrop GM, Caulfield M, Munroe PB. Haplotypes of the WNK1 gene associate with blood pressure variation in a severely hypertensive population from the British Genetics of Hypertension (BRIGHT) study. Hum Mol Genet. 2005;14:1805–1814.","cites":null},{"id":44685348,"title":"Human hypertension caused by mutations in WNK kinases.","authors":[],"date":null,"doi":null,"raw":"Wilson FH, Disse-Nicodeme S, Choate KA, Ishikawa K, NelsonWilliams C, Desitter I, Gunel M, Milford DV, Lipkin GW, Achard JM, Feely MP, Dussol B, Berland Y, Unwin RJ, Mayan H, Simon DB, Farfel Z, Jeunemaitre X, Lifton RP. Human hypertension caused by mutations in WNK kinases. Science. 2001;293:1107–1112.","cites":null},{"id":44685400,"title":"Identification of 108 SNPs in TSC, WNK1, and WNK4 and their association with hypertension in a Japanese general population.","authors":[],"date":null,"doi":"10.1007\/s10038-004-0181-0","raw":"Kokubo Y, Kamide K, Inamoto N, Tanaka C, Banno M, Takiuchi S, Kawano Y, Tomoike H, Miyata T. Identification of 108 SNPs in TSC, WNK1, and WNK4 and their association with hypertension in a Japanese general population. J Hum Genet. 2004;49:507–515.","cites":null},{"id":44685422,"title":"Improved hypertension management and control: results from the health survey for England","authors":[],"date":"1998","doi":"10.1097\/01.hjh.0000226210.95936.bc","raw":"Primatesta P, Brookes M, Poulter NR. Improved hypertension management and control: results from the health survey for England 1998. Hypertension. 2001;38:827–932.","cites":null},{"id":44685408,"title":"LINkage disequilibrium plotter. Available at http:\/\/ www.genepi.com.au\/jlin; last accessed","authors":[],"date":"2005","doi":null,"raw":"JLIN: Java LINkage disequilibrium plotter. Available at http:\/\/ www.genepi.com.au\/jlin; last accessed February 11, 2005.","cites":null},{"id":44685420,"title":"Mendelian randomisation’: can genetic epidemiology contribute to understanding environmental determinants of disease?","authors":[],"date":null,"doi":"10.1093\/ije\/dyg070","raw":"Davey Smith G, Ebrahim S. ‘Mendelian randomisation’: can genetic epidemiology contribute to understanding environmental determinants of disease? Int J Epidemiol. 2003;32:1–22.","cites":null},{"id":44685346,"title":"Molecular mechanisms of human hypertension.","authors":[],"date":null,"doi":"10.1016\/s0092-8674(01)00241-0","raw":"Lifton RP, Gharavi AG, Geller DS. Molecular mechanisms of human hypertension. Cell. 2001;104:545–556.","cites":null},{"id":44685393,"title":"Molecular pathogenesis of inherited hypertension with hyperkalemia: the Na-Cl cotransporter is inhibited by wild-type but not mutant WNK4.","authors":[],"date":null,"doi":"10.1073\/pnas.242735399","raw":"Wilson FH, Kahle KT, Sabath E, Lalioti MD, Rapson AK, Hoover RS, Hebert SC, Gamba G, Lifton RP. Molecular pathogenesis of inherited hypertension with hyperkalemia: the Na-Cl cotransporter is inhibited by wild-type but not mutant WNK4. Proc Natl Acad Sci U S A. 2003;100: 680–684.","cites":null},{"id":44685407,"title":"PedCheck: a program for identification of genotype incompatibilities in linkage analysis.","authors":[],"date":"1998","doi":"10.1086\/301904","raw":"O’Connell JR, Weeks DE. PedCheck: a program for identification of genotype incompatibilities in linkage analysis. Am J Hum Genet. 1998; 63:259–266.","cites":null},{"id":44685398,"title":"Pseudohypoaldosteronism type II: marked sensitivity to thiazides, hypercalciuria, normomagnesemia, and low bone mineral density.","authors":[],"date":null,"doi":"10.1210\/jcem.87.7.8449","raw":"Mayan H, Vered I, Mouallem M, Tzadok-Witkon M, Pauzner R, Farfel Z. Pseudohypoaldosteronism type II: marked sensitivity to thiazides, hypercalciuria, normomagnesemia, and low bone mineral density. J Clin Endocrinol Metab. 2002;87:3248–54.","cites":null},{"id":44685418,"title":"Sibling-based tests of linkage and association for quantitative traits.","authors":[],"date":null,"doi":"10.1086\/302404","raw":"Allison DB, Heo M, Kaplan N, Martin ER. Sibling-based tests of linkage and association for quantitative traits. Am J Hum Genet. 1999;64: 1754–1763.","cites":null},{"id":44685424,"title":"Surveys Unit. Health Survey for England 2003. Volume 2: Risk Factors for Cardiovascular Disease. London: The Stationery Office;","authors":[],"date":null,"doi":null,"raw":"Joint Health Surveys Unit. Health Survey for England 2003. Volume 2: Risk Factors for Cardiovascular Disease. London: The Stationery Office;","cites":null},{"id":44685396,"title":"WNK kinases regulate thiazide-sensitive Na-Cl cotransport.","authors":[],"date":null,"doi":"10.1172\/jci17443","raw":"Yang CL, Angell J, Mitchell R, Ellison DH. WNK kinases regulate thiazide-sensitive Na-Cl cotransport. J Clin Invest. 2003;111:1039–1045.","cites":null},{"id":44685402,"title":"WNK4 intron 10 polymorphism is not associated with hypertension.","authors":[],"date":null,"doi":"10.1161\/01.hyp.0000120121.43524.cd","raw":"Speirs HJ, Morris BJ. WNK4 intron 10 polymorphism is not associated with hypertension. Hypertension. 2004;43:766–768.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-11-29","abstract":"Background— Blood pressure (BP) is a heritable trait of major public health concern. The WNK1 and WNK4 genes, which encode proteins in the WNK family of serine-threonine kinases, are involved in renal electrolyte homeostasis. Mutations in the WNK1 and WNK4 genes cause a rare monogenic hypertensive syndrome, pseudohypoaldosteronism type II. We investigated whether polymorphisms in these WNK genes influence BP in the general population. \\ud\n\\ud\nMethods and Results— Associations between 9 single-nucleotide polymorphisms (SNPs) in WNK1 and 1 in WNK4 with ambulatory BP were studied in a population-based sample of 996 subjects from 250 white European families. The heritability estimates of mean 24-hour systolic BP (SBP) and diastolic BP (DBP) were 63.4% and 67.9%, respectively. We found statistically significant (P<0.05) associations of several common SNPs and haplotypes in WNK1 with mean 24-hour SBP and\/or DBP. The minor allele (C) of rs880054, with a frequency of 44%, reduced mean 24-hour SBP and DBP by 1.37 (95% confidence interval, –2.45 to –0.23) and 1.14 (95% confidence interval, –1.93 to –0.38) mm Hg, respectively, per copy of the allele. \\ud\n\\ud\nConclusions— Common variants in WNK1 contribute to BP variation in the general population. This study shows that a gene causing a rare monogenic form of hypertension also plays a significant role in BP regulation in the general population. The findings provide a basis to identify functional variants of WNK1, elucidate any interactions of these variants with dietary intake or with response to antihypertensive drugs, and determine their impact on cardiovascular morbidity and mortality.Peer reviewedPublisher versio","downloadUrl":"http:\/\/circ.ahajournals.org\/cgi\/content\/abstract\/112\/22\/3423.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7342\/1\/3423.pdf","pdfHashValue":"fd605aa94e43f31752af27592fcbe2c1cc6e3a01","publisher":"American Heart Association","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7342<\/identifier><datestamp>\n                2016-04-14T08:40:21Z<\/datestamp><setSpec>\n                com_2381_57<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_58<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nAssociation of WNK1 Gene Polymorphisms and Haplotypes With Ambulatory Blood Pressure in the General Population<\/dc:title><dc:creator>\nTobin, Martin D.<\/dc:creator><dc:creator>\nRaleigh, Stuart M.<\/dc:creator><dc:creator>\nNewhouse, Stephen J.<\/dc:creator><dc:creator>\nBraund, Peter S.<\/dc:creator><dc:creator>\nBodycote, Clare<\/dc:creator><dc:creator>\nOgleby, Jenny<\/dc:creator><dc:creator>\nCross, Deborah<\/dc:creator><dc:creator>\nGracey, Jay<\/dc:creator><dc:creator>\nHayes, Saija<\/dc:creator><dc:creator>\nSmith, Terry<\/dc:creator><dc:creator>\nRidge, Cathy<\/dc:creator><dc:creator>\nCaulfield, Mark J.<\/dc:creator><dc:creator>\nSheehan, Nuala A.<\/dc:creator><dc:creator>\nMunroe, Patricia B.<\/dc:creator><dc:creator>\nBurton, Paul R.<\/dc:creator><dc:creator>\nSamani, Nilesh J.<\/dc:creator><dc:description>\nBackground— Blood pressure (BP) is a heritable trait of major public health concern. The WNK1 and WNK4 genes, which encode proteins in the WNK family of serine-threonine kinases, are involved in renal electrolyte homeostasis. Mutations in the WNK1 and WNK4 genes cause a rare monogenic hypertensive syndrome, pseudohypoaldosteronism type II. We investigated whether polymorphisms in these WNK genes influence BP in the general population. \\ud\n\\ud\nMethods and Results— Associations between 9 single-nucleotide polymorphisms (SNPs) in WNK1 and 1 in WNK4 with ambulatory BP were studied in a population-based sample of 996 subjects from 250 white European families. The heritability estimates of mean 24-hour systolic BP (SBP) and diastolic BP (DBP) were 63.4% and 67.9%, respectively. We found statistically significant (P<0.05) associations of several common SNPs and haplotypes in WNK1 with mean 24-hour SBP and\/or DBP. The minor allele (C) of rs880054, with a frequency of 44%, reduced mean 24-hour SBP and DBP by 1.37 (95% confidence interval, –2.45 to –0.23) and 1.14 (95% confidence interval, –1.93 to –0.38) mm Hg, respectively, per copy of the allele. \\ud\n\\ud\nConclusions— Common variants in WNK1 contribute to BP variation in the general population. This study shows that a gene causing a rare monogenic form of hypertension also plays a significant role in BP regulation in the general population. The findings provide a basis to identify functional variants of WNK1, elucidate any interactions of these variants with dietary intake or with response to antihypertensive drugs, and determine their impact on cardiovascular morbidity and mortality.<\/dc:description><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPublisher version<\/dc:description><dc:date>\n2009-12-09T16:16:21Z<\/dc:date><dc:date>\n2009-12-09T16:16:21Z<\/dc:date><dc:date>\n2005-11-29<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nCirculation, 2005, 112 (22), pp. 3423-3429.<\/dc:identifier><dc:identifier>\n0194-911X<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7342<\/dc:identifier><dc:identifier>\nhttp:\/\/circ.ahajournals.org\/content\/112\/22\/3423<\/dc:identifier><dc:identifier>\n10.1161\/CIRCULATIONAHA.105.555474<\/dc:identifier><dc:identifier>\n1524-4539<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:rights>\n© 2005 American Heart Association, Inc.  Deposited with reference to the publisher's archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:rights>\nThis paper was published as Circulation, 2005, 112 (22), pp. 3423-3429.  It is available from http:\/\/circ.ahajournals.org\/cgi\/content\/abstract\/112\/22\/3423.  Doi: 10.1161\/CIRCULATIONAHA.105.555474<\/dc:rights><dc:publisher>\nAmerican Heart Association<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0194-911X","0194-911x","1524-4539","issn:1524-4539"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007"],"year":2005,"topics":[],"subject":["Article"],"fullText":"ISSN: 1524-4539 \nCopyright © 2005 American Heart Association. All rights reserved. Print ISSN: 0009-7322. Online\n72514\nCirculation is published by the American Heart Association. 7272 Greenville Avenue, Dallas, TX\nDOI: 10.1161\/CIRCULATIONAHA.105.555474 \n 2005;112;3423-3429; originally published online Nov 21, 2005; Circulation\nand Nilesh J. Samani \nCathy Ridge, Mark Caulfield, Nuala A. Sheehan, Patricia B. Munroe, Paul R. Burton\nBodycote, Jenny Ogleby, Deborah Cross, Jay Gracey, Saija Hayes, Terry Smith, \nMartin D. Tobin, Stuart M. Raleigh, Stephen Newhouse, Peter Braund, Clare\n Blood Pressure in the General Population\n Gene Polymorphisms and Haplotypes With AmbulatoryWNK1Association of \n http:\/\/circ.ahajournals.org\/cgi\/content\/full\/CIRCULATIONAHA.105.555474\/DC1\nData Supplement (unedited) at: \n \n http:\/\/circ.ahajournals.org\/cgi\/content\/full\/112\/22\/3423\nlocated on the World Wide Web at: \nThe online version of this article, along with updated information and services, is\n http:\/\/www.lww.com\/reprints\nReprints: Information about reprints can be found online at \n  \n journalpermissions@lww.com\n410-528-8550. E-mail: \nFax:Kluwer Health, 351 West Camden Street, Baltimore, MD 21202-2436. Phone: 410-528-4050. \nPermissions: Permissions & Rights Desk, Lippincott Williams & Wilkins, a division of Wolters\n  \n http:\/\/circ.ahajournals.org\/subscriptions\/\nSubscriptions: Information about subscribing to Circulation is online at \n at University of Leicester (lei) \/ England on December 9, 2009 circ.ahajournals.orgDownloaded from \nAssociation of WNK1 Gene Polymorphisms and Haplotypes\nWith Ambulatory Blood Pressure in the General Population\nMartin D. Tobin, PhD; Stuart M. Raleigh, PhD; Stephen Newhouse, MSc; Peter Braund, MSc;\nClare Bodycote, BSc; Jenny Ogleby, BSc; Deborah Cross, PhD; Jay Gracey, BA; Saija Hayes, BSc;\nTerry Smith, RGN; Cathy Ridge, BA; Mark Caulfield, FRCP; Nuala A. Sheehan, PhD;\nPatricia B. Munroe, PhD; Paul R. Burton, MD; Nilesh J. Samani, MD\nBackground—Blood pressure (BP) is a heritable trait of major public health concern. The WNK1 and WNK4 genes, which\nencode proteins in the WNK family of serine-threonine kinases, are involved in renal electrolyte homeostasis. Mutations\nin the WNK1 and WNK4 genes cause a rare monogenic hypertensive syndrome, pseudohypoaldosteronism type II. We\ninvestigated whether polymorphisms in these WNK genes influence BP in the general population.\nMethods and Results—Associations between 9 single-nucleotide polymorphisms (SNPs) in WNK1 and 1 in WNK4 with\nambulatory BP were studied in a population-based sample of 996 subjects from 250 white European families. The\nheritability estimates of mean 24-hour systolic BP (SBP) and diastolic BP (DBP) were 63.4% and 67.9%, respectively.\nWe found statistically significant (P\u00010.05) associations of several common SNPs and haplotypes in WNK1 with mean\n24-hour SBP and\/or DBP. The minor allele (C) of rs880054, with a frequency of 44%, reduced mean 24-hour SBP and\nDBP by 1.37 (95% confidence interval, \u00022.45 to \u00020.23) and 1.14 (95% confidence interval, \u00021.93 to \u00020.38) mm Hg,\nrespectively, per copy of the allele.\nConclusions—Common variants in WNK1 contribute to BP variation in the general population. This study shows that a\ngene causing a rare monogenic form of hypertension also plays a significant role in BP regulation in the general\npopulation. The findings provide a basis to identify functional variants of WNK1, elucidate any interactions of these\nvariants with dietary intake or with response to antihypertensive drugs, and determine their impact on cardiovascular\nmorbidity and mortality. (Circulation. 2005;112:3423-3429.)\nKey Words: blood pressure \u0001 genetics \u0001 hypertension \u0001 kidney \u0001 risk factors\nBlood pressure (BP) is a key determinant of cardiovascu-lar health.1,2 Familial aggregation of BP has long been\nrecognized, and estimates of the heritability of systolic (SBP)\nand diastolic (DBP) BP have exceeded 50%.3,4 The identifi-\ncation of genes involved in BP regulation, by improving\nknowledge of the relevant biology, should facilitate advances\nin treatment and control of BP. However, BP is a complex\ntrait, and genetic studies into its etiology are constrained by\nthe small effect sizes of the individual genetic variants,\nimprecise measures of the phenotype, and low-power ap-\nproaches to study design and analysis.\nEditorial p 3371\nStudies of monogenic syndromes have provided important\ninsights into a number of mechanisms underlying BP regu-\nlation.5 Although these provide evidence for a causal relation\nbetween gene and disease, none of these genes have yet been\nshown to directly affect BP in the general population.5\nRecently, mutations in the WNK1 and WNK4 genes, which\nencode proteins in the WNK (“with no lysine” [K]) family of\nserine-threonine kinases, have been shown to cause\npseudohypoaldosteronism type II (PHAII, or Gordon’s syn-\ndrome), an autosomal-dominant condition characterized by\nhypertension and hyperkalaemia.6 The WNK1 and WNK4\nproteins localize to distal nephrons, WNK1 normally inhib-\niting WNK4 and WNK4 normally inhibiting the Na-Cl\ncotransporter in the apical membrane of epithelial cells lining\nthe distal convoluted tubule.7,8 Thus, “gain-in-function” mu-\ntations in WNK1 or “loss-of-function” mutations in WNK4\nresult in PHAII that involves Na-Cl cotransporter overactiv-\nity.7,8 The Na-Cl cotransporter is sensitive to thiazide diuret-\nics, and patients with PHAII exhibit an unusually large BP\nfall in response to thiazides.9\nReceived April 12, 2005; revision received July 26, 2005; accepted August 22, 2005.\nFrom the Department of Health Sciences (M.D.T., N.A.S., P.R.B.), University of Leicester; the Department of Cardiovascular Sciences (S.M.R., P.B.,\nC.B., J.O., D.C., J.G., S.H., T.S., C.R., N.J.S.), University of Leicester, Glenfield Hospital; and the Department of Genetics (M.D.T., N.A.S., P.R.B.),\nUniversity of Leicester, Leicester; and the Department of Clinical Pharmacology and Barts and the London Genome Centre (S.N., M.C., P.B.M.), Barts\nand the London School of Medicine, London, England.\nThe online-only Data Supplement can be found at http:\/\/circ.ahajournals.org\/cgi\/content\/full\/CIRCULATIONAHA.105.555474\/DC1.\nCorrespondence to Prof Nilesh J. Samani, Department of Cardiovascular Sciences, University of Leicester, Clinical Sciences Wing, Glenfield Hospital,\nGroby Road, Leicester LE3 9QP, UK. E-mail njs@le.ac.uk\n© 2005 American Heart Association, Inc.\nCirculation is available at http:\/\/www.circulationaha.org DOI: 10.1161\/CIRCULATIONAHA.105.555474\n3423\nHypertension\n at University of Leicester (lei) \/ England on December 9, 2009 circ.ahajournals.orgDownloaded from \nWNK1 spans 156 kb of genomic DNA, with at least 28\nexons producing multiple transcripts owing to alternative\nsplicing, and is highly polymorphic, with \u0003100 validated\nsingle-nucleotide polymorphisms (SNPs) (dbSNP, build 124;\navailable at http:\/\/www.ncbi.nlm.nih.gov\/projects\/SNP\/; last\naccessed February 11, 2005). WNK4 spans 16 kb of genomic\nDNA and 19 exons and, in white European subjects, is much\nless polymorphic, with only 1 common SNP reported\n(1156666G3A).10\nA few studies have examined the association of poly-\nmorphisms in WNK1 and\/or WNK4 with the risk of hyper-\ntension.10–13 A study in Japanese subjects found a nominal\nassociation with hypertension and 1 WNK4 SNP\n(C14717T).11 Although an association between another\nWNK4 SNP (1156666G3A) and hypertension has been\nreported in white American subjects,10 this finding was not\nreplicated in a study of white Australian subjects,12 but both\nstudies were small. Recently, the BRIGHT study provided\nevidence supporting a possible association between a WNK1\nSNP (rs1468326) and the severity of hypertension in a family\nstudy of extremely hypertensive white European subjects.13\nHowever, no study has yet examined whether common\nvariants in WNK1 or WNK4 are associated with BP regulation\nin a population-based sample that has not been selected for\nthe presence or absence of hypertension.\nThe main objective of our study was to investigate the\nassociation between common SNPs in WNK1 with BP in a\npopulation-based sample. Because BP measured at a single\ntime is subject to transient variation and because BP exhibits\ncircadian variations, we measured ambulatory BP for 24\nhours to characterize it more precisely and to maximize the\npower to detect genetic determinants with a modest effect on\nBP. For completeness, we also included in our investigation\nthe single WNK4 SNP observed in white European\npopulations.10\nMethods\nSubjects and Phenotyping\nWe studied 1005 white European subjects from 252 nuclear families\nrecruited from the general population in the ongoing GRAPHIC\n(Genetic Regulation of Arterial Pressure of Humans in the Commu-\nnity) study.\nFamilies were included if both parents aged 40 to 60 years and 2\noffspring \u000118 years wished to participate. Families were recruited\nby writing to women aged 40 to 59 years who had registered with\nparticipating family practitioners in Leicestershire, England, inviting\nthem and their families to take part. Subjects were excluded if they\nhad renal disease or a comorbidity that affected accurate BP\nmeasurement. There was no preferential selection based on history of\nhypertension. Interviews by research nurses consisted of a detailed\nhistory and examination, including clinic BP and collection of blood\nsamples. The Leicestershire Research Ethics Committee approved\nthe study, and all subjects provided written, informed consent.\nAmbulatory BP was measured with a Spacelabs 90207 monitor\n(Spacelabs) for 26 hours. The first 2 hours of each record were\ndiscarded to avoid any alerting response. The ambulatory monitor\nrecorded BP at 30-minute intervals between 8 AM and 9:59 PM\n(“daytime”) and at 1-hour intervals between 10 PM and 7:59 AM\n(“nighttime”). If ambulatory BP profiles were \u000180% complete, they\nwere repeated. We summarized the ambulatory BP data, weighting\neach time period proportional to its length. The 6 phenotypic\noutcomes on which our analyses focused were the time-weighted-\nmeans of SBP and DBP for 24 hours, during the daytime, and during\nthe nighttime.\nFurther details of recruitment and phenotyping, including response\nrates and measurement of clinic BP, are included in the online-only\nData Supplement.\nGenotyping and Quality Assurance\nWe genotyped 9 WNK1 SNPs (the Figure). The choice of SNP was\ninformed by the results of a prior analysis of WNK1 described\nelsewhere.13 In brief, 19 SNPs spanning WNK1 at \u000410 kb and\nincluding all nonsynonymous coding SNPs and the SNPs immedi-\nately 5\u0005 and 3\u0005 of the gene were typed in a separate population of 100\nfamilies.13 The 9 SNPs were chosen in an initial tag SNP (tSNP)\nselection by eye. In a more detailed analysis with established\ncriteria,14 8 of these SNPs (excluding rs2301880) were found to be\nsufficient to predict common WNK1 haplotypes (minimum\nRh2\u0006100%, Rs2\u000694%) with \u000390% power.13 However, we present\ndata on all typed SNPs, including rs2301880. The WNK4\n(1156666G3A) SNP10 was also typed. Genotyping for the SNPs\nwas done by fluorescent allelic discrimination with the ABI Prism\n7900HT sequence detector system (Applera). Details are given in the\nData Supplement.\nTo assist in the identification of misspecified family relationships,\nwe also genotyped 3 highly polymorphic microsatellite markers,\nd19s220, d3s1267, and d4s412, from the ABI Prism linkage mapping\nset v2.5-MD10 (PE, Applied Biosystems). Details are given in the\nData Supplement. We checked for misspecified family relationships\nwith the PedCheck program.15 Simulation analysis in 1000 families\nshowed that the 3 microsatellites provided \u000399.3% power to detect\nany mendelian inconsistency. Two complete families and 1 individ-\nual (total of 9 subjects) were excluded after showing mendelian\ninconsistencies. In the remaining 996 subjects from 250 families,\nusing PedCheck we then searched for mendelian inconsistencies in\nthe SNP data attributable to genotyping error. The SNP data that\nwere inconsistent with mendelian inheritance (13 observations) were\ncoded as missing.\nStatistical Analysis\nDeparture from Hardy-Weinberg equilibrium was tested with a \u00022\ntest on parental SNP data. We estimated |D’| and R2 measures of\nlinkange disequilibrium between pairs of SNPs with the JLIN\nprogram.16\nEstimates of variance components, heritability, and the effects of\nindividual SNPs were obtained by fitting generalized linear mixed\nmodels (GLMMs) using Gibbs sampling in WinBUGS.17,18 These\nmodels deal appropriately with the correlation of traits, genotypes,\nand environmental exposures within families.17,18 A censored normal\napproach19 was used to adjust for the effect of antihypertensive\ntherapy. A GLMM was fitted to estimate narrow-sense heritability\nfor each ambulatory BP phenotype, including age and sex (but no\ngenes) as covariates. The SNP covariates were then included in the\nmodel, 1 at a time, and the effect of each SNP was estimated under\nan additive genetic model. Although the GLMMs were fitted with a\nBayesian approach, flat prior distributions were used throughout, and\ninferences are reported as probability values and 95% confidence\nintervals (CIs).20\nUsing the 8 tSNPs, we also undertook a test of association of\nWNK1 haplotypes with BP phenotypes in the presence of linkage by\nStructure of the human WNK1 gene and location of the SNPs\nanalyzed. Exons are shown as vertical lines. Alternatively spliced\nexons are unfilled. The locations of the SNPs typed are indi-\ncated by arrows and are as follows: (1) rs1468326, (2)\nrs2369402, (3) rs765250, (4) rs2286007, (5) rs880054, (6)\nrs956868, (7) rs953361, (8) rs2301880, and (9) rs2286028.\n3424 Circulation November 29, 2005\n at University of Leicester (lei) \/ England on December 9, 2009 circ.ahajournals.orgDownloaded from \nusing HBAT.21 The input values for HBAT were the residuals from\na normal linear regression correcting for age and sex as covariates\nand adjusting for treatment effects using a nonparametric algorithm.4\nProbability values were inferred by a permutation method described\nby Horvath et al,21 using up to 100 000 Monte Carlo samples.\nFurther details of the statistical analyses and adjustment methods\nfor antihypertensive treatment are available in the Data Supplement.\nResults\nGRAPHIC Study Families\nTable 1 shows the characteristics of the 996 subjects (from\n250 families) included in the analyses. Mean 24-hour ambu-\nlatory SBP (SD) was 119.2 (10.8), and mean ambulatory DBP\nwas 72.0 (7.7). There were significant correlations between\nthe different ambulatory BP phenotypes and also between\nthese phenotypes and clinic BP (Data Supplement Table I). A\nhistory of hypertension was reported by 136 (13.7%) sub-\njects, of whom 63 (6.3%) were currently receiving antihyper-\ntensive treatment.\nAllele Frequencies and LD\nTable 2 summarizes the genomic location, allele frequency,\nand Hardy-Weinberg tests for the 9 WNK1 SNPs analyzed.\nNone of the SNPs showed statistically significant deviation\nfrom Hardy-Weinberg equilibrium. Strong, pairwise LD was\nobserved between the intragenic SNPs from intron 1 to intron\n26 (Data Supplement Figure I). The WNK4 SNP\n(1156666G3A) had a minor allele frequency of 11.1% and\ndid not deviate from Hardy-Weinberg equilibrium (P\u00060.62).\nHeritability\nThe estimated proportion of the BP variance attributable to\nadditive polygenic effects (ie, the narrow-sense heritability,\nor h2N) was 63.4% (95% CI, 52.3% to 73.3%) for mean\n24-hour SBP and 67.9% (95% CI, 57.5% to 77.2%) for mean\n24-hour DBP.\nPrimary Association Analyses\nOf the 9 WNK1 SNPs, 4 exhibited a significant association\n(P\u00010.05) with mean 24-hour SBP and 5 with mean 24-hour\nDBP (Table 3). Furthermore, 2 of these SNPs (rs880054 in\nintron 10 and rs2301880 in intron 23) showed highly signif-\nicant associations (P\u00010.005) with mean 24-hour SBP and\nDBP, respectively. In addition, rs765250 in intron 1 exhibited\na highly significant association (P\u00010.005) with mean night-\ntime SBP. Under an additive genetic model, the coefficient\nfor each SNP (Table 3) may be interpreted as the mean\nincrease in BP (in mm Hg) associated with each additional\ncopy of the minor allele. For example, the most common SNP\nrs880054 was associated with a mean reduction in 24-hour\nSBP of 1.37 mm Hg per copy of the C (minor) allele (95% CI,\nTABLE 1. Characteristics of the Study Participants\nVariable\nParents\n(n\u0006499)\nOffspring\n(n\u0006497)\nAll Subjects\n(N\u0006996)\nGeneral characteristics\nMale\/female, n\/n 250\/249 250\/247 500\/496\nAge, median (range), y 53.0 (40–60) 24.0 (18–41) 41.5 (18–60)\nHistory of hypertension, n (%) 117 (23.4) 19 (3.8) 136 (13.7)\nCurrent antihypertensive treatment, n (%) 62 (12.4) 1 (0.2) 63 (6.3)\nCurrent smoker, n (%) 64 (12.8) 141 (28.4) 205 (20.6)\nWeekly alcohol intake \u000121 units (women) and\n\u000128 units (men),† n (%)\n95 (19.2) 65 (13.1) 160 (16.2)\nBody mass index, mean (SD), kg\/m2 27.5 (4.2) 24.8 (4.9) 26.1 (4.8)\nHistory of high cholesterol 38 (7.6) 5 (1.0) 43 (4.3)\nDiabetes, n (%) 8 (1.6) 1 (0.2) 9 (0.9)\nAngina, n (%) 5 (1.0) 0 5 (0.5)\nHigher education or degree-level qualifications,\nn (% of respondents)*\n160 (32.7) 196 (41) 356 (36.8)\nClinic BP phenotypes, mm Hg\nClinic SBP, mean (SD) 132.8 (19.2) 120.1 (15.1) 126.5 (18.4)\nClinic DBP, mean (SD) 82.9 (11.2) 73.5 (8.9) 78.2 (11.2)\nClinic BP \u0001140\/90, n (%) 191 (38.3) 61 (12.3) 252 (25.3)\nAmbulatory BP phenotypes, mm Hg\n24-Hour mean SBP, mean (SD) 121.1 (12.3) 117.4 (8.8) 119.2 (10.8)\n24-Hour mean DBP, mean (SD) 75.0 (8.3) 69.1 (5.8) 72.0 (7.7)\nMean daytime SBP, mean (SD) 127.4 (13.4) 122.6 (9.4) 125.0 (11.8)\nMean daytime DBP, mm Hg, mean (SD) 80.2 (9.0) 74.0 (6.6) 77.1 (8.4)\nMean nighttime SBP, mm Hg, mean (SD) 112.8 (12.0) 110.7 (9.3) 111.7 (10.8)\nMean nighttime DBP, mm Hg, mean (SD) 68.2 (8.4) 62.6 (6.2) 65.4 (7.9)\n*Educational level data available for 968 of the 996 subjects.\n†Alcohol intake data available for 991 subjects.\nTobin et al PRKWNK1 Gene Variants and Blood Pressure 3425\n at University of Leicester (lei) \/ England on December 9, 2009 circ.ahajournals.orgDownloaded from \n2.45-mm Hg reduction to a 0.23-mm Hg reduction). We\nfound no evidence of modification of the effect of any of the\nWNK1 SNPs on mean 24-hour SBP or DBP by sex. The\nWNK4 SNP (1156666G3A) was not associated with any of\nthe BP phenotypes.\nSecondary Association Analyses\nSecondary analyses were carried out to examine (1) the\nassociation between WNK1 variants and clinic BP; (2) the\neffect of different genetic models, and (3) the impact of\nadjustments for additional covariates. Three WNK1 SNPs\nwere associated (P\u00010.05) with clinic SBP and 5 with clinic\nDBP (P\u00060.00087 for association between rs880054 and\nclinic DBP; Data Supplement Table II). Significant associa-\ntions were observed between WNK1 SNPs and mean 24-hour\nSBP and DBP under different genetic models (Data Supple-\nment Tables III to V). The data are consistent with a\ncodominant effect for the majority of SNPs, but a dominant\neffect cannot be ruled out. Significant associations between\nthe WNK1 SNPs and mean 24-hour SBP and DBP were also\nevident after correcting for body mass index in addition to\nage and sex (Data Supplement Table VI) and also after\nincluding a range of other covariates, such as smoking,\nalcohol intake, history of hypercholesterolemia, and educa-\ntional level (Data Supplement Table VII).\nHaplotype Analyses of WNK1: Joint Linkage\nand Association\nFifteen haplotypes with a frequency of 1% or greater were\nidentified, and 4 of these showed significant evidence\n(P\u00010.05) of an association in the presence of linkage with\nmean 24-hour SBP and\/or mean 24 hour DBP (Table 4). Of\nthese, 2 haplotypes were common: h2 ‘CGTCTCTC’ and h4\n‘CACCCCCG’ (frequencies of 0.158 and 0.126, respec-\ntively). Haplotype h2 was associated with a significant rise in\nmean 24-hour DBP, whereas h4 was associated with a fall in\nboth mean 24-hour SBP and mean 24-hour DBP. Another\nhaplotype, h7 ‘CGCCTCCG’ (frequency, 0.040), was asso-\nciated with a rise in BP across all BP phenotypes, with\nsignificant associations with 5 of the 6 ambulatory BP\nTABLE 2. Description of the WNK1 SNPs Genotyped in the GRAPHIC Study\nHardy-Weinberg Test\u0001\nWNK1 SNP*\nChromosome\n12 Position†\nWNK1\nPosition Alleles‡ n§\nMinor-Allele\nFrequency\n(Parents)\u0001\nPearson’s \u00022\n(1 df ) P\nrs1468326 727762 5\u0005 region C\/A 987 11.3% 0.023 0.88\nrs2369402 748925 Intron 1 G\/A 990 22.1% 0.046 0.83\nrs765250 778544 Intron 1 T\/C 990 31.1% 0.19 0.66\nrs2286007 841552 Exon 8 C\/T 995 8.5% 1.87 0.18\nrs880054 858819 Intron 10 T\/C 993 43.8% 1.37 0.24\nrs956868 861173 Exon 13 C\/A 992 14.2% 3.39 0.065\nrs953361 872068 Intron 22 C\/T 987 39.0% 1.40 0.24\nrs2301880 874098 Intron 23 C\/T 991 26.1% 0.55 0.46\nrs2286028 885730 Intron 26 G\/C 987 17.6% 0.32 0.57\n*dbSNP accession number.\n†Chromosome 12 position in base-pairs (source: HapMap Web site, http:\/\/www.hapmap.org\/).\n‡Major\/minor alleles shown.\n§Number of subjects with genotype data available for analysis.\n\u0001Minor allele frequency and Hardy-Weinberg tests relate to the parents (parental generation).\nTABLE 3. Estimates of the Effects of the WNK1 SNPs and WNK4 SNP on Ambulatory SBP and DBP Phenotypes\nMean 24-Hour SBP Mean Daytime SBP Mean Nighttime SBP Mean 24-Hour DBP Mean Daytime DBP Mean Nighttime DBP\nSNP Coefficient (95% CI) P Coefficient (95% CI) P Coefficient (95% CI) P Coefficient (95% CI) P Coefficient (95% CI) P Coefficient (95% CI) P\nWNK1\nrs1468326 \u00020.94 (\u00022.65 to 0.75) 0.27 \u00020.95 (\u00022.85 to 0.89) 0.32 \u00021.08 (\u00022.84 to 0.64) 0.22 \u00020.87 (\u00022.02 to 0.33) 0.15 \u00021.02 (\u00022.30 to 0.26) 0.12 \u00020.73 (\u00021.84 to 0.44) 0.21\nrs2369402 \u00011.42 (\u00012.75 to\u00010.06) 0.037 \u00021.42 (\u00022.87 to\u00020.01) 0.053 \u00011.45 (\u00012.77 to\u00010.09) 0.031 \u00010.98 (\u00011.87 to\u00010.04) 0.036 \u00011.01 (\u00012.0 to\u00010.00) 0.044 \u00010.90 (\u00011.77 to\u00010.01) 0.046\nrs765250 \u00011.50 (\u00012.69 to\u00010.24) 0.016 \u00021.16 (\u00022.52 to 0.16) 0.085 \u00011.81 (\u00012.91 to\u00010.69) 0.0015 \u00020.84 (\u00021.70 to 0.07) 0.060 \u00020.77 (\u00021.68 to 0.14) 0.098 \u00010.91 (\u00011.71 to\u00010.09) 0.030\nrs2286007 \u00020.80 (\u00022.71 to 1.16) 0.42 \u00020.42 (\u00022.51 to 1.62) 0.70 \u00021.16 (\u00023.04 to 0.68) 0.23 \u00021.05 (\u00022.34 to 0.23) 0.11 \u00020.99 (\u00022.37 to 0.36) 0.16 \u00020.97 (\u00022.26 to 0.35) 0.14\nrs880054 \u00011.37 (\u00012.45 to\u00010.23) 0.015 \u00011.48 (\u00012.60 to\u00010.31) 0.012 \u00011.30 (\u00012.44 to\u00010.27) 0.019 \u00011.14 (\u00011.93 to\u00010.38) 0.0041 \u00011.18 (\u00012.02 to\u00010.33) 0.0060 \u00011.00 (\u00011.78 to\u00010.20) 0.012\nrs956868 1.46 (\u00020.15 to 3.14) 0.081 1.59 (\u00020.16 to 3.24) 0.067 1.40 (\u00020.23 to 3.03) 0.092 0.67 (\u00020.43 to 1.79) 0.23 0.89 (\u00020.29 to 2.07) 0.14 0.51 (\u00020.57 to 1.60) 0.36\nrs953361 1.01 (\u00020.11 to 2.07) 0.072 0.88 (\u00020.29 to 2.05) 0.14 1.12 (\u00020.03 to 2.28) 0.059 0.89 (0.10 to 1.67) 0.026 0.86 (\u00010.02 to 1.69) 0.049 0.91 (0.18 to 1.70) 0.017\nrs2301880 \u00011.78 (\u00013.00 to\u00010.55) 0.0045 \u00011.62 (\u00013.0 to\u00010.34) 0.017 \u00012.0 (\u00013.24 to\u00010.81) 0.0012 \u00011.07 (\u00011.85 to\u00010.24) 0.0099 \u00011.05 (\u00012.01 to\u00010.13) 0.029 \u00011.06 (\u00011.95 to\u00010.21) 0.018\nrs2286028 0.99 (\u00020.45 to 2.38) 0.17 1.12 (\u00020.45 to 2.66) 0.16 0.93 (\u00020.53 to 2.39) 0.19 1.00 (0.04 to 1.99) 0.039 1.08 (0.05 to 2.14) 0.041 0.98 (0 to 2.00) 0.050\nWNK4\n(1156666G\u0003A) 0.09 (\u00021.67 to 1.77) 0.92 0.12 (\u00021.74 to 1.93) 0.90 \u00020.04 (\u00021.70 to 1.67) 0.96 0.10 (\u00021.12 to 1.29) 0.87 0.16 (\u00021.15 to 1.40) 0.81 \u00020.01 (\u00021.22 to 1.23) 0.98\nAll analyses took full account of familial relationships and were adjusted for age, age2, and sex as covariates. The coefficients are shown under an additive genetic\nmodel and may be interpreted as a per-allele effect. Significant results (P\u00010.05) are shown in boldface type.\n3426 Circulation November 29, 2005\n at University of Leicester (lei) \/ England on December 9, 2009 circ.ahajournals.orgDownloaded from \nphenotypes (P\u00060.0053 for mean 24-hour DBP). In addition,\nh9 ‘CGCCCCCG’ (frequency, 0.023) was associated with a\nfall in BP across all phenotypes, with significant findings for\n3 BP phenotypes. A multihaplotype (global) test of linkage\nand association was statistically significant for mean 24-hour\nDBP (P\u00060.011) but of only borderline significance for mean\n24-hour SBP (P\u00060.058). Of interest, the 2 haplotypes with\nthe most discordant estimated effects were h4 and h7. These\nhaplotypes differed in the alleles of rs2369402 and rs880054,\nwhich themselves showed significant associations with BP\n(Table 3).\nDiscussion\nWe report statistically significant associations of common\nSNPs spanning introns 1 to 26 of the WNK1 gene with\nambulatory SBP and DBP in the general population. All\nSNPs that had a minor-allele frequency of \u00030.15 showed\nsignificant association with at least 1 ambulatory BP\nphenotype.\nAny reported genetic association should be interpreted\nwith caution until it is replicated. However, the following\nevidence supports a genuine rather than a chance or artifac-\ntual association between WNK1 variants and BP. First, there\nis a priori evidence of involvement of the gene in a mono-\ngenic form of hypertension.6 Second, power calculations\na priori and post hoc suggest that this study was adequately\npowered (see Data Supplement). Third, the haplotype analy-\nses support the results of those based on the individual SNPs.\nAlthough the GLMM-based approach is robust to stratifica-\ntion and admixture,22 the haplotype analyses provide further\nreassurance that these findings were not solely attributable to\npopulation substructure.21 Fourth, although genetic associa-\ntion studies should not be subject to confounding by lifestyle\nfactors,23 significant associations were still noted between\nWNK1 SNPs and mean 24-hour SBP and DBP after correc-\ntion for a range of covariates.\nAlthough we did not apply a Bonferroni correction, our\nfindings cannot simply be explained by multiple testing. We\ntested a limited number of WNK1 SNPs in strong LD and\nfound at least 1 significant association for each common SNP.\nFurthermore, 2 associations with mean 24-hour BP pheno-\ntypes and 2 associations with nighttime BP phenotypes were\nhighly significant (P\u00010.005), and even the low-power global\ntest supported significant linkage and association of the\nWNK1 haplotypes with mean 24-hour DBP (P\u00060.011).\nThe GRAPHIC study adopted a design and analytic strat-\negy that optimized the ability to detect genetic determinants\nof BP. First, we studied BP as a continuous trait. This is a\npowerful approach, particularly when measurement error is\nminimized. We therefore used ambulatory BP monitoring, the\nmost precise noninvasive measure of usual BP that is avail-\nable. Second, through participating family practices, we\ngenerated a study population that was representative of the\nEnglish population in terms of BP and age-appropriate\nprevalence and treatment of hypertension.24,25 This sampling\nstrategy not only allows generalizability of the findings but\nalso avoids loss of power with adjustment for ascertainment\nbias.26 Third, we used censored normal19 and nonparametric4\nTABLE 4. Joint Linkage and Association Analysis of Haplotypes in WNK1 With Ambulatory SBP and DBP Phenotypes*\nHaplotype\nMean 24-Hour\nSBP\nMean Daytime\nSBP\nMean Nighttime\nSBP\nMean 24-Hour\nDBP\nMean Daytime\nDBP\nMean Nighttime\nDBP\nAlleles Name Frequency n† Z‡ P Z P Z P Z P Z P Z P\nCGTCTCTG h1 0.175 120 0.361 0.73 0.240 0.81 0.494 0.62 0.726 0.47 0.911 0.35 0.333 0.73\nCGTCTCTC h2 0.158 106 \u00020.512 0.61 \u00020.473 0.64 \u00020.498 0.62 2.291 0.021 1.966 0.052 1.962 0.048\nCGTCCCCG h3 0.139 98 0.206 0.84 0.233 0.81 0.049 0.96 \u00021.403 0.16 \u00021.207 0.23 \u00021.555 0.12\nCACCCCCG h4 0.126 84 \u00012.264 0.025 \u00012.230 0.023 \u00021.854 0.064 \u00012.159 0.032 \u00012.142 0.032 \u00021.512 0.14\nCGTCTACG h5 0.126 80 \u00020.663 0.51 \u00020.843 0.40 \u00020.271 0.78 \u00021.287 0.20 \u00021.146 0.26 \u00021.103 0.27\nCACTCCCG h6 0.074 58 1.847 0.059 1.980 0.047 1.391 0.17 1.210 0.22 1.030 0.30 1.245 0.21\nCGCCTCCG h7 0.040 32 2.248 0.022 2.450 0.014 1.616 0.11 2.707 0.0053 2.576 0.0082 2.357 0.014\nAGTCCCCG h8 0.024 21 \u00021.592 0.11 \u00021.010 0.32 \u00021.646 0.095 \u00020.471 0.64 \u00020.086 0.94 \u00020.437 0.66\nCGCCCCCG h9 0.023 23 \u00021.749 0.083 \u00021.161 0.25 \u00012.099 0.038 \u00012.117 0.032 \u00021.683 0.091 \u00011.961 0.047\nAGCCTCCG h10 0.016 15 0.352 0.73 0.450 0.65 0.089 0.91 \u00020.148 0.89 \u00020.037 0.97 \u00020.246 0.82\nCGTCCCTG h11 0.016 16 0.432 0.67 0.422 0.68 0.488 0.63 \u00021.381 0.17 \u00021.408 0.16 \u00020.876 0.39\nAGTCTCTC h12 0.016 16 0.055 0.95 \u00020.402 0.70 0.615 0.55 \u00021.213 0.23 \u00021.46 0.15 \u00020.283 0.78\nAGTCTCTG h13 0.014 14 0.438 0.68 0.393 0.70 0.386 0.69 \u00020.470 0.66 \u00020.720 0.48 \u00020.079 0.94\nAGCCCCCG h14 0.012 10 1.701 0.077 2.038 0.034 0.712 0.51 0.675 0.53 1.286 0.22 \u00020.235 0.81\nAACCCCCG h15 0.010 10 0.535 0.60 \u00020.143 0.89 0.978 0.34 0.695 0.50 0.332 0.76 0.602 0.54\nGlobal (multihaplotype) test (P)§ 0.058 0.14 0.12 0.011 0.064 0.086\n*Family-based association tests for haplotypes were used for the analysis, implemented with the HBAT extension of the FBAT toolkit.21 Significant results (P\u00010.05)\nare shown in boldface type.\n†n Indicates number of informative families.\n‡A negative Z score indicates a haplotype that reduces BP, and a positive Z score, a haplotype that increases BP.\n§In addition to the haplotype-specific test, a more conservative global test of joint linkage and association across all haplotypes with at least 10 informative families\nis shown.\nTobin et al PRKWNK1 Gene Variants and Blood Pressure 3427\n at University of Leicester (lei) \/ England on December 9, 2009 circ.ahajournals.orgDownloaded from \napproaches to adjust for the effects of antihypertensive\ntherapy. These methods avoid the bias and loss in power that\narise from inappropriate correction for treatment effects.19\nFourth, the nuclear family–based design of the GRAPHIC\nstudy permitted the study of variance components and heri-\ntability and is robust to population stratification. Our esti-\nmates of heritability are consistent with other studies that\nhave minimized the measurement error for BP.3,4\nThe effects of the WNK1 variants on BP may seem modest.\nFor example, the proportion of the additive polygenic vari-\nance in mean 24-hour SBP explained by SNP rs2301880 is\n\u00041.4% (ie, 0.9% of the total variance). However, the esti-\nmated magnitude of these effects is entirely consistent with\nwhat might be expected for a complex genetic trait. Impor-\ntantly, even a 2-mm Hg-lower usual SBP is associated with\nan \u000410% fall in stroke mortality and a 7% reduction in\nmortality from ischemic heart disease or other vascular\ncauses in middle age.27 SNP rs2301880 exhibited a minor-al-\nlele frequency of 26% and a per-allele reduction in SBP of\n1.78 mm Hg, a difference of \u00033.5 mm Hg between TT and\nCC homozygotes. The magnitude of the estimated effect is\ncomparable to that seen with a modest reduction in dietary\nsodium.28 These observations highlight the potential public\nhealth importance of our findings.\nNo other study to date has reported an association between\nWNK1 variants and BP in a population-based sample.\nKokubo et al11 found no association between WNK1 SNPs\nand clinic SBP or DBP in a population of 771 hypertensives\nand 1047 controls selected from within the Suita cohort in\nJapan. Recently, the BRIGHT study showed nominal evi-\ndence of an association between WNK1 SNP rs1468326 and\nSBP and DBP in a family study of extremely hypertensive\nsubjects.13\nOnly 1 common SNP has been reported in WNK4 in white\nEuropean subjects.10 This is in intron 10 (1156666G\u0003A), and\nthere are conflicting reports of its association with hyperten-\nsion.10,12 We observed allele frequencies of this SNP similar\nto those in previous studies10,12 but found no association with\neither ambulatory or clinic BP in our population. We have\nalso confirmed that several other SNPs reported in WNK4 in\ndbSNP are not polymorphic in white Europeans and have also\nundertaken an SNP screening project of the promoter and\nfunctional domains of WNK4 by direct sequencing of 20\nindividuals with divergent WNK1 haplotypes (S.N. and\nP.B.M., unpublished data). No novel SNPs were found. Our\nresults are consistent with those of Erlich et al10 and suggest\nthat WNK4 does not contain common polymorphisms in\nwhite Europeans.\nOur study shows the potential importance of WNK1 in BP\nregulation in humans. This is the first study to show that a\ngene causing a monogenic form of hypertension plays a\nsignificant role in BP regulation in the general population.\nGiven the function of WNK1 in renal sodium and potassium\nhomeostasis, it will be important to investigate whether there\nare interactions between WNK1 variants with modifiable\nenvironmental exposures, such as dietary salt intake. If such\ninteractions are found, then the modification of such expo-\nsures may lead to a disproportionate effect in certain popu-\nlation subgroups with important health consequences. Even\ngreater public health benefits might be realized if a more\nrobust understanding of the biological pathways through\nwhich WNK1 exerts its effects leads to identification of an\nintermediate phenotype that might be amenable to modifica-\ntion in whole populations.23 In addition, if knowledge of the\nrole of WNK1 in BP regulation were to lead to the develop-\nment of antihypertensive drugs with improved efficacy or\nacceptability, then substantial improvements in BP control in\nthe treated hypertensive population may be achieved. Given\nthat thiazide diuretics cause a particularly large fall in BP in\nPHAII patients,9 pharmacogenetic studies to establish\nwhether or not the efficacy, side effects, and acceptability of\ndifferent classes of antihypertensive agents vary with poly-\nmorphisms in the WNK1 gene may become relevant if our\nfindings are confirmed in other studies.\nLimitations\nWe studied a relatively healthy, young to middle-aged white\nEuropean population. Although BP values were broadly\nrepresentative of the English general population,25 the gener-\nalizability of our findings to older age groups, less healthy\nindividuals, and different ethnic groups needs to be estab-\nlished. Furthermore, we have not identified the causal vari-\nants in WNK1 that are responsible for the effect on BP. WNK1\nis a relatively large gene, and although we assumed that the 8\ntSNPs lie in a single block, it is also possible that the tSNPs\ncould span \u00031 haplotype block. The SNPs showing a\nsignificant association spanned almost the whole WNK1 gene\n(from intron 1 to intron 26), and all were intronic and unlikely\nto be functional. Therefore, further investigations are required\nto pinpoint specific regions of the WNK1 gene that harbor\nfunctional genetic variants. Finally, the mechanisms by which\nany causal variants in WNK1 affect BP need to be elucidated.\nIn summary, common variants in the WNK1 gene contrib-\nute to BP variation in the general population. The findings\nprovide a basis to identify functional variants of WNK1,\nelucidate any interactions of these variants with dietary intake\nor the response to antihypertensive drugs, and determine their\nimpact on cardiovascular morbidity and mortality.\nAcknowledgments\nThe GRAPHIC study is funded through a British Heart Foundation\nprogram grant. This work was also supported by the Wellcome Trust\nFunctional Genomics Initiative in Cardiovascular Genetics; an MRC\ncooperative grant on variability, instability, and pathology of the\nhuman genome; and an MRC clinical training fellowship (to Dr\nTobin). Professor Samani holds a British Heart Foundation Chair of\nCardiology. We gratefully acknowledge the support of the partici-\npating families and the general practitioners and staff at the Melton,\nOakham, Broughton Astley, Wigston, Kibworth, and Market Har-\nborough practices for their assistance with the recruitment of\nfamilies. Finally, we thank Kim Mason, Jean Hudson, and Louise\nGoddard for their clerical support; Leighton Crosbee, Annette\nBrindle, Danny Kirby, and Rebecca Quinn for computing support\nand database development; and Chris Wallace for helpful\ndiscussions.\nReferences\n1. National Institutes of Health. JNC 7 Express: the Seventh Report of the\nJoint National Committee on Prevention, Detection, Evaluation and\nTreatment of High Blood Pressure. Bethesda, Md: National Institutes of\nHealth; 2003.\n3428 Circulation November 29, 2005\n at University of Leicester (lei) \/ England on December 9, 2009 circ.ahajournals.orgDownloaded from \n2. Murray CJ, Lauer JA, Hutubessy RC, Niessen L, Tomijima N, Rodgers\nA, Lawes CM, Evans DB. Effectiveness and costs of interventions to\nlower systolic blood pressure and cholesterol: a global and regional\nanalysis on reduction of cardiovascular-disease risk. Lancet. 2003;361:\n717–725.\n3. Kotchen TA, Kotchen JM, Grim CE, George V, Kaldunski ML, Cowley\nAW, Hamet P, Chelius TH. Genetic determinants of hypertension: iden-\ntification of candidate phenotypes. Hypertension. 2000;36:7–13.\n4. Levy D, DeStefano AL, Larson MG, O’Donnell CJ, Lifton RP, Gavras H,\nCupples LA, Myers RH. Evidence for a gene influencing blood pressure\non chromosome 17: genome scan linkage results for longitudinal blood\npressure phenotypes in subjects from the Framingham Heart Study.\nHypertension. 2000;36:477–483.\n5. Lifton RP, Gharavi AG, Geller DS. Molecular mechanisms of human\nhypertension. Cell. 2001;104:545–556.\n6. Wilson FH, Disse-Nicodeme S, Choate KA, Ishikawa K, Nelson-\nWilliams C, Desitter I, Gunel M, Milford DV, Lipkin GW, Achard JM,\nFeely MP, Dussol B, Berland Y, Unwin RJ, Mayan H, Simon DB, Farfel\nZ, Jeunemaitre X, Lifton RP. Human hypertension caused by mutations in\nWNK kinases. Science. 2001;293:1107–1112.\n7. Wilson FH, Kahle KT, Sabath E, Lalioti MD, Rapson AK, Hoover RS,\nHebert SC, Gamba G, Lifton RP. Molecular pathogenesis of inherited\nhypertension with hyperkalemia: the Na-Cl cotransporter is inhibited by\nwild-type but not mutant WNK4. Proc Natl Acad Sci U S A. 2003;100:\n680–684.\n8. Yang CL, Angell J, Mitchell R, Ellison DH. WNK kinases regulate\nthiazide-sensitive Na-Cl cotransport. J Clin Invest. 2003;111:1039–1045.\n9. Mayan H, Vered I, Mouallem M, Tzadok-Witkon M, Pauzner R, Farfel Z.\nPseudohypoaldosteronism type II: marked sensitivity to thiazides, hyper-\ncalciuria, normomagnesemia, and low bone mineral density. J Clin Endo-\ncrinol Metab. 2002;87:3248–54.\n10. Erlich PM, Cui J, Chazaro I, Farrer LA, Baldwin CT, Gavras H,\nDeStefano AL. Genetic variants of WNK4 in whites and African\nAmericans with hypertension. Hypertension. 2003;41:1191–1195.\n11. Kokubo Y, Kamide K, Inamoto N, Tanaka C, Banno M, Takiuchi S,\nKawano Y, Tomoike H, Miyata T. Identification of 108 SNPs in TSC,\nWNK1, and WNK4 and their association with hypertension in a Japanese\ngeneral population. J Hum Genet. 2004;49:507–515.\n12. Speirs HJ, Morris BJ. WNK4 intron 10 polymorphism is not associated\nwith hypertension. Hypertension. 2004;43:766–768.\n13. Newhouse SJ, Wallace C, Dobson R, Mein C, Pembroke J, Farrall M,\nClayton D, Brown M, Samani N, Dominiczak A, Connell JM, Webster J,\nLathrop GM, Caulfield M, Munroe PB. Haplotypes of the WNK1 gene\nassociate with blood pressure variation in a severely hypertensive popu-\nlation from the British Genetics of Hypertension (BRIGHT) study. Hum\nMol Genet. 2005;14:1805–1814.\n14. Stram DO, Haiman CA, Hirschhorn JN, Altshuler D, Kolonel LN, Henderson\nBE, Pike MC. Choosing haplotype-tagging SNPS based on unphased genotype\ndata using a preliminary sample of unrelated subjects with an example from the\nMultiethnic Cohort Study. Hum Hered. 2003;55:27–36.\n15. O’Connell JR, Weeks DE. PedCheck: a program for identification of\ngenotype incompatibilities in linkage analysis. Am J Hum Genet. 1998;\n63:259–266.\n16. JLIN: Java LINkage disequilibrium plotter. Available at http:\/\/\nwww.genepi.com.au\/jlin; last accessed February 11, 2005.\n17. Burton PR, Tiller KJ, Gurrin LC, Cookson WO, Musk AW, Palmer\nLJ. Genetic variance components analysis for binary phenotypes using\ngeneralized linear mixed models (GLMMs) and Gibbs sampling. Genet\nEpidemiol. 1999;17:118–140.\n18. Spiegelhalter D, Thomas A, Best N. WinBUGS Version 1.4 User Manual.\nCambridge, England: MRC Biostatistics Unit; 2003.\n19. Tobin MD, Sheehan NA, Scurrah KJ, Burton PR. Adjusting for treatment\neffects in studies of quantitative traits: antihypertensive therapy and\nsystolic blood pressure. Stat Med. 2005;24:2911–2935.\n20. Burton PR, Gurrin LC, Campbell MJ. Clinical significance not statistical\nsignificance: a simple Bayesian alternative to p values. J Epidemiol\nCommunity Health. 1998;52:318–323.\n21. Horvath S, Xu X, Lake SL, Silverman EK, Weiss ST, Laird NM.\nFamily-based tests for associating haplotypes with general phenotype\ndata: application to asthma genetics. Genet Epidemiol. 2004;26:61–69.\n22. Allison DB, Heo M, Kaplan N, Martin ER. Sibling-based tests of linkage\nand association for quantitative traits. Am J Hum Genet. 1999;64:\n1754–1763.\n23. Davey Smith G, Ebrahim S. ‘Mendelian randomisation’: can genetic\nepidemiology contribute to understanding environmental determinants of\ndisease? Int J Epidemiol. 2003;32:1–22.\n24. Primatesta P, Brookes M, Poulter NR. Improved hypertension man-\nagement and control: results from the health survey for England 1998.\nHypertension. 2001;38:827–932.\n25. Joint Health Surveys Unit. Health Survey for England 2003. Volume 2:\nRisk Factors for Cardiovascular Disease. London: The Stationery Office;\n2004.\n26. Burton PR. Correcting for non-random ascertainment in generalized\nlinear mixed models (GLMMs) fitted using Gibbs sampling. Genet Epi-\ndemiol. 2003;24:24–35.\n27. Lewington S, Clarke R, Qizilbash N, Peto R, Collins R. Age-specific\nrelevance of usual blood pressure to vascular mortality: a meta-analysis of\nindividual data for one million adults in 61 prospective studies. Lancet.\n2002;360:1903–1913.\n28. Sacks FM, Svetkey LP, Vollmer WM, Appel LJ, Bray GA, Harsha D,\nObarzanek E, Conlin PR, Miller ER 3rd, Simons-Morton DG, Karanja N,\nLin PH, Group DA-SCR. Effects on blood pressure of reduced dietary\nsodium and the Dietary Approaches to Stop Hypertension (DASH) diet;\nDASH-Sodium Collaborative Research Group. N Engl J Med. 2001;\n344:3–10.\nTobin et al PRKWNK1 Gene Variants and Blood Pressure 3429\n at University of Leicester (lei) \/ England on December 9, 2009 circ.ahajournals.orgDownloaded from \n"}