{"doi":"10.1080\/0968776042000216246","coreId":"6070","oai":"oai:generic.eprints.org:605\/core5","identifiers":["oai:generic.eprints.org:605\/core5","10.1080\/0968776042000216246"],"title":"DISCUSSION","authors":["Jones, Chris"],"enrichments":{"references":[{"id":1884519,"title":"(2002a) Linked: the new science of networks","authors":[],"date":null,"doi":"10.2307\/20033300","raw":"Barabasi, A-L. (2002a) Linked: the new science of networks (Cambridge, MA, Perseus).","cites":null},{"id":1884520,"title":"(2002b) Linked: the new science of networks: visual companion . Available online at: http:\/\/www.nd.edu\/ ∼","authors":[],"date":null,"doi":null,"raw":"Barabasi, A-L. (2002b) Linked: the new science of networks: visual companion . Available online at: http:\/\/www.nd.edu\/ ∼","cites":null},{"id":1884524,"title":"Communities of practice: learning, meaning, and identity (Cambridge,","authors":[],"date":"1998","doi":"10.1017\/cbo9780511803932","raw":"Wenger, E. (1998) Communities of practice: learning, meaning, and identity (Cambridge, Cambridge University Press).","cites":null},{"id":1884521,"title":"Knowledge and organisation: a social-practice perspective,","authors":[],"date":"2001","doi":"10.1287\/orsc.12.2.198.10116","raw":"Brown, J. S. & Duguid, P. (2001) Knowledge and organisation: a social-practice perspective, Organization Science, 12(2), 198–213.","cites":null},{"id":190793,"title":"Knowledge and organisation: a social-practice perspective, tion","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":190791,"title":"Linked: the new science of networks","authors":[],"date":null,"doi":"10.1109\/mspec.2002.1049263","raw":null,"cites":null},{"id":190792,"title":"Linked: the new science of networks: visual companion. Available online at: w.nd.edu\/∼networks\/linked\/photo.html (accessed 28","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":1884522,"title":"Mathematics: a very short introduction (Oxford,","authors":[],"date":"2002","doi":"10.1093\/actrade\/9780192853615.001.0001","raw":"Gowers, T. (2002) Mathematics: a very short introduction (Oxford, Oxford University Press).","cites":null},{"id":190794,"title":"Rhizome (Paris, Les Editions de Minuit).","authors":[],"date":"1976","doi":"10.7202\/027380ar","raw":null,"cites":null},{"id":1884523,"title":"The digital revolution and the coming of the postmodern university","authors":[],"date":"2003","doi":"10.4324\/9780203451243","raw":"Raschke, C. A. (2003) The digital revolution and the coming of the postmodern university (London, RoutledgeFalmer).","cites":null},{"id":190795,"title":"The digital revolution and the coming of the postmodern university (London, eFalmer).1998) Communities of practice: learning, meaning, and identity (Cambridge,","authors":[],"date":"2003","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/6070.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/605\/1\/ALT_J_Vol12_No2_2004_DISCUSSION.pdf","pdfHashValue":"0c8a0e5a9322f9cbf2d234bba89e9ee3b93ba3f2","publisher":"Taylor and Francis Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:605<\/identifier><datestamp>\n      2011-04-04T09:05:56Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/605\/<\/dc:relation><dc:title>\n        DISCUSSION<\/dc:title><dc:creator>\n        Jones, Chris<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:publisher>\n        Taylor and Francis Ltd<\/dc:publisher><dc:date>\n        2004<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/605\/1\/ALT_J_Vol12_No2_2004_DISCUSSION.pdf<\/dc:identifier><dc:identifier>\n          Jones, Chris  (2004) DISCUSSION.  Association for Learning Technology Journal, 12 (2).  pp. 195-198.  ISSN 0968-7769 (print)\/1741-1629 (online)     <\/dc:identifier><dc:relation>\n        10.1080\/0968776042000216246<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/605\/","10.1080\/0968776042000216246"],"year":2004,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":" ALT-J, Research in Learning Technology\nVol. 12, No. 2, June 2004\n          DISCUSSION\nNetworks and learning: communities, \npractices and the metaphor of \nnetworks—a response\nChris Jones*\nUniversity of Lancaster, UK\nTaylor and Francis LtdCALT12208.sgm10.1080\/0968776042000216246ALT-T Research in Learing Technology0968 7769 (p i t)\/1741-1629 (online)Original Article2 042 000 4hrisJonesDepartm nt of Educational ResearchCartmel CollegeLancaster UniversityLancasterLA1 4YLUKc. jo es@lancaster. c.uk\nI am pleased to have the opportunity to react to Bruce Ingraham’s response to my\narticle ‘Networks and learning: communities, practices and the metaphor of\nnetworks’ (Jones, 2004). It is rare to have a dialogue with someone who has taken the\ntime and trouble to consider what you have written for a journal. All too often review-\ning is a one-way process with the reviewer remaining anonymous. It is all the more\npleasant to have a response to what you have written that gets to grips with some of\nthe issues that the author also finds troubling. It is in that spirit that I write this reac-\ntion to Ingraham; it is an opportunity for me to develop some of the points he has\nidentified as problematic in the original article. I want to concentrate on two main\nissues, firstly the network metaphor itself and secondly the usefulness of abstraction\nand representations of various types.\nThe network metaphor\nA fundamental question about the use of the network metaphor is whether we are\ndealing with networks as a kind of reified structure or topology or with networks as a\nprocess, a dynamic series of relationships. If we take a simple network structure, two\nnodes related by a single link, we might ask what that represents. The link may be\nsustained by heavy traffic, a more or less constant flow. On the other hand the link\n*Department of Educational Research, Cartmel College, Lancaster University, Lancaster LA1\n4YL, UK. Email: c.r.jones@lancaster.ac.ukISSN 0968–7769 (print)\/ISSN 1741–1629 (online)\/04\/020195–04\n© 2004 Association for Learning Technology\nDOI: 10.1080\/0968776042000216246\n 196\n \nC. Jones\n   could represent a latent relationship, or a weak link, that could be activated but was\nonly used for occasional communication. Mapping can include some minimal repre-\nsentation of such features, for example by colour coding links to represent types or\nlevels of flow between nodes. There is nonetheless a fundamental difference between\nviewing networks as processes and reifying the process such that representations of\nprocess in topologies are taken to be the network itself. I am interested in topologies\nof networks and I am interested in mathematical ‘laws’ but I think of these as simpli-\nfied and abstracted representations of process, indexes of activity, rather than as the\nphenomena itself.\nIngraham noted that: \nnetworks understood as a collection of nodes and links can be, and too often are, under-\nstood to be planer structures.\nThis has been a problem in the past but one of the attractions of the type of work\nbeing referenced in the article, for example by Barabasi (2002a), is precisely that it\nmoves away from this two-dimensional view of networks that has been associated with\nrandom networks. I would recommend readers to examine some of the structures that\nemerge as representations of networks from the scale-free approach taken by Barabasi\nand his colleagues (see Barabasi, 2002a,b). For example, scale-free networks suggest\nan historical process of development in which scale-free networks develop in an\nordered way over time in ways that are highly structured. In particular they form clus-\nters, small numbers of nodes forming many links whereas a majority of nodes have\nfew links, the development of such clusters implies the development of power rela-\ntions. In short, scale-free networks are not two dimensional or even three dimensional\nas they incorporate at least a fourth dimension with the inclusion of time and social\ndimensions beyond that by introducing aspects of power relations.\nIngraham raises the question of what counts as a node in a network and points to\nmy own use of node to represent individuals in a networked learning setting. Whilst\nI want to defend this usage I would also wish to point out that node can be applied at\nvarious levels in what may be described, like the Internet itself, as a network of\nnetworks. I would also want to point out that node in English derives from a biological\nreference to growth points in plants. In French the word used is ‘nœud ‘and derives\nfrom knot, suggesting a less particular interpretation of what a node might be. In\nEnglish, node might imply a specific atomistic point, in French it implies a complex\ninterweaving of links. Nodes can be collectives, organizations, sub-groups, regions etc.\nAt a more microscopic level we might view individuals as networks of relations or even\ndescribe their physical constitution in network terms. This is one reason why the idea\nof a network topology is so appealing to me. Networks try to describe at a high level\nof abstraction the interrelationships between different forms. Scale-free networks are\nfound to be good descriptions of a wide variety of phenomena at various granularities\nof description. As a central strength this can also be seen as a weakness. Indeed, Ingra-\nham asks me to be more precise about what thoughts the network metaphor produced\nin me. This is a very reasonable request as the level of abstraction could easily hide a\nlimit to any grounded application to learning with networked technology.\n Networks and learning—a response\n \n197\n   The ideas of community and in particular communities of practice are a common\nmetaphor applied to networked learning. A problem with this view is that community\nimplies close relationships between participants and a certain unity in relation to the\ncommunity itself. Indeed, Wenger addresses this problem by introducing the notion\na constellation of practice, consisting of a number of communities of practice and less\nintense interaction between members of a constellation than within a community\n(Wenger, 1998). My own view is that networks may provide a better way of conceiv-\ning of many of the relationships found in learning. Brown and Duguid have intro-\nduced the idea of a network of practice to describe some types of relationship (Brown\n& Duguid, 2001). For Brown and Duguid, extended epistemic groups are held\ntogether by a common substrate of practice and networks identify a significantly\nlooser set of relationships than those within a community of practice. A specific\ngrounded piece of research flowing from the network metaphor would be to explore\nempirically the relations found in technologically assisted learning. The aim of such\nan exploration would be not to impose either the network or community metaphor,\nbut to provide descriptive accounts of the kinds of relationships that are found in such\nsettings and see in what ways if any either metaphor illuminated such descriptions.\nThe usefulness of abstraction and representation\nIngraham comments that the notion of developing mathematical laws alarms him but\ntowards the close of his commentary he refers to fractals and complex and chaotic\nsystems. I think this reference helps me to understand what kind of relationship\nbetween mathematical laws and descriptions I am trying to indicate. Fractal geometry\nuses a set of general principles or laws in order to describe a wide variety of phenom-\nena and I think this approach provides a valuable additional resource for describing\nnetworks not an alternative as Ingraham suggests. At its simplest fractal geometry\nrelies on abstract reasoning to generate fractional dimensions (Gowers, 2002, p. 82).\nFractal geometry provides mathematical rules that define the conditions for the\ngeneration of particular shapes that have a self-nesting property such that shapes can\nbe built up of smaller copies or approximations of the original shape. Fractal geome-\ntry is highly evocative of social and natural organization and can be used to generate\ncomputer graphics simulating natural phenomena such as plant growth and cloud\nformations. Unlike Ingraham, I do not see fractal geometry as an alternative metaphor\nto networks I see it as complementary and a reinforcement of the idea that mathemat-\nics, including mathematical laws, can be used as indexes to social processes. Fractal\ngeometry is an example of why, just as with scale-free networks, we may wish to inves-\ntigate mathematics not simply as metaphor but also in terms of ‘laws’ and a method\nresting on abstraction (see Gowers, 2002).\nIngraham offers the metaphor of a rhizome following Deleuze and Guattari (1976)\nas a further alternative to networks and notes that: \nif one focuses attention on the activity, on the ‘social process’, we may find that the topol-\nogy of cyber relations is rhizoid rather than racinated.\n 198\n \nC. Jones\n                       Rhizome as used by Deleuze and Guattari is indeed a metaphor that emphasizes\nnetwork like features: \nTo these central systems, the authors counter-propose a-centric systems, networks of finite\nautomata in which communication flows from one neighbour to the other, in which all\nindividuals are interchangeable and are defined only by a state in a particular moment, in\nsuch a way that local operations can be coordinated and the final result can be synchro-\nnized independently of a central body. (Deleuze & Guattari, 1976, p. 50)\nIn some ways the rhizome metaphor by focusing on automata suggests a fusion of\nthe kind made in actor network theories between human and non-human actants. It\nis also a metaphor that is currently applied to networked learning in higher education\n(Raschke, 2003, p. 8). On the other hand, despite its careful use by both the original\nauthors and recent advocates, rhizome remains, like racine, a root based metaphor\nand inevitably carries with it biological notions and an image of transport in and out\nof a system. Roots, however fine and interwoven, are transactional systems sustaining\na living organism and the transactions are largely one way and only partially interac-\ntive. I think Ingrahams’ preference for rhizoid over racinated relates to his planer view\nof networks. He identifies the bifurcating pattern of racination with a network,\nwhereas I do not and I think of networks as multi-dimensional phenomena that can\nbe abstractly represented in three or four dimensions only by significant reduction\nand abstraction.\nConclusions\nThe network metaphor is not new and clearly carries with it a certain baggage from\nprevious uses. However, I think the recent advances in understanding complex\nnetworks provides learning technology with an opportunity to draw together a variety\nof theoretical sources in a productive way. I agree with Ingraham that the actual activ-\nity of what he calls internetworking is the core of our mutual interests but I think our\ndifference lies in how much we believe the use of a network metaphor and mathemat-\nical approaches to networks can be productive in exploring this activity.\nReferences\nBarabasi, A-L. (2002a) Linked: the new science of networks (Cambridge, MA, Perseus).\nBarabasi, A-L. (2002b) Linked: the new science of networks: visual companion. Available online at:\nhttp:\/\/www.nd.edu\/∼networks\/linked\/photo.html (accessed 28 February 2004).\nBrown, J. S. & Duguid, P. (2001) Knowledge and organisation: a social-practice perspective,\nOrganization Science, 12(2), 198–213.\nDeleuze, G. & Guattari, F. (1976) Rhizome (Paris, Les Editions de Minuit).\nGowers, T. (2002) Mathematics: a very short introduction (Oxford, Oxford University Press).\nRaschke, C. A. (2003) The digital revolution and the coming of the postmodern university (London,\nRoutledgeFalmer).\nWenger, E. (1998) Communities of practice: learning, meaning, and identity (Cambridge, Cambridge\nUniversity Press).\n"}