{"doi":"10.1016\/j.ijfoodmicro.2010.01.019","coreId":"139475","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/4329","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/4329","10.1016\/j.ijfoodmicro.2010.01.019"],"title":"The influence of environmental factors on growth and interactions between Embellisia allii and Fusarium oxysporum f. sp. cepae isolated from garlic","authors":["Lee, Hyang Burm","Magan, Naresh"],"enrichments":{"references":[{"id":37978961,"title":"Bulb canker of garlic caused by Embellisia allii, newly found in Japan.","authors":[],"date":"1994","doi":"10.1007\/bf02268517","raw":"Taniguchi,  N.,  Kishi,  T.,  Tohyama,  A.,  Tsuda,  M.,  1994.  Bulb  canker  of  garlic  caused  by Embellisia allii, newly found in Japan. Mycoscience 35, 421-424.","cites":null},{"id":37978958,"title":"Chemical control of associated fungi of garlic cloves.","authors":[],"date":"1998","doi":null,"raw":"Soares, R.M, Kurozawa, C., 1998. Chemical control of associated fungi of garlic cloves. Summa Phytopathologica 24, 279-283.","cites":null},{"id":37978947,"title":"Effect of aw and CO2 level on Aspergillus flavus growth and aflatoxin production in high moisture maize post-harvest.","authors":[],"date":"2008","doi":"10.1016\/j.ijfoodmicro.2007.11.051","raw":"Giorni, P., Battilani, P., Pietri, A., Magan, N., 2008. Effect of aw and CO2 level on Aspergillus flavus  growth  and  aflatoxin  production  in  high  moisture  maize  post-harvest.  International Journal Food Microbiology 122, 109-113.","cites":null},{"id":37978954,"title":"Effect of water activity, temperature and substrate on interactions between field fungi and storage fungi.","authors":[],"date":"1984","doi":"10.1016\/s0007-1536(84)80214-4","raw":"Magan, N., Lacey, J., 1984. Effect of water activity, temperature and substrate on interactions between field fungi and storage fungi. Transactions of the British Mycological Society 82, 83-93.","cites":null},{"id":37978960,"title":"Effects of Embellisia allii and Fusarium oxysporum f.","authors":[],"date":"1994","doi":null,"raw":"Stadnik, M.J., Aguiar, M., Castro, C., 1994. Effects of Embellisia allii and Fusarium oxysporum f. ACCEPTED MANUSCRIPT ACCEPTED MANUSCRIPT sp. cepae on stored garlic gloves. Fitopatologia Brasileira 19, 294 (Abstract).","cites":null},{"id":37978946,"title":"Effects of maggots and wounding on occurrence of Fusarium basal rot of onions in Colorado.","authors":[],"date":"1985","doi":"10.1094\/pd-69-878","raw":"Everts,  K.L.,  Schwartz,  H.F.,  Epsky,  N.D.,  Capinera  J.L.,  1985.  Effects  of  maggots  and wounding on occurrence of Fusarium basal rot of onions in Colorado. Plant Disease 69, 878-882.","cites":null},{"id":37978945,"title":"Embellisia allii.","authors":[],"date":"1996","doi":"10.1080\/07060669609500610","raw":"Corlett, M., 1996. Embellisia allii. Canadian Journal of Plant Pathology 18, 486-487. Crowe,  F.J.,  Scardaci,  S.C.,  Greathead,  A.S.,  Hall,  D.H.,  Somerville  P.A.,  Kurtz,  E.,  1986. Fusarium basal rot of garlic. Proceedings of American Phytopathological Society, Abstract #293.","cites":null},{"id":37978949,"title":"Environmental factors and nutritional utilization patterns affect niche overlap indices between Aspergillus ochraceus and other spoilage fungi.","authors":[],"date":"1999","doi":"10.1046\/j.1365-2672.1999.00521.x","raw":"Lee,  H.B.,  Magan,  N.,  1999.  Environmental  factors  and  nutritional  utilization  patterns  affect niche  overlap  indices  between  Aspergillus  ochraceus  and  other  spoilage  fungi.  Letters  in Applied Microbiology 28, 300-304.","cites":null},{"id":37978948,"title":"First report of bulb canker of garlic caused by Embellisia allii in Korea.","authors":[],"date":"2002","doi":"10.4489\/myco.2002.30.4.240","raw":"Lee,  H.B.,  Kim,  -C.-J.,  and  Yu,  S.H.,  2002.  First  report  of  bulb  canker  of  garlic  caused  by Embellisia allii in Korea. Mycobiology 30(4), 240-243.","cites":null},{"id":37978955,"title":"Fusarium oxysporum f. sp. garlic n.f.sp. causing basal rot of garlic.","authors":[],"date":"1986","doi":"10.3186\/jjphytopath.52.860","raw":"Matuo, T., Miyagawa, M., Saito, H., 1986. Fusarium oxysporum f. sp. garlic n.f.sp. causing basal rot of garlic. Annual Phytopathology Society Japan 52, 860-864.","cites":null},{"id":37978957,"title":"Helminthosporium allii as type of new genus.","authors":[],"date":"1971","doi":"10.2307\/3757767","raw":"Simmons, E.G., 1971. Helminthosporium allii as type of new genus. Mycologia 63, 380-386.","cites":null},{"id":37978950,"title":"Impact of environment and interspecific interactions between spoilage fungi and Aspergillus ochraceus on growth and ochratoxin production in maize grain.","authors":[],"date":"2000","doi":"10.1016\/s0168-1605(00)00385-8","raw":"Lee,  H.B.,  Magan,  N.,  2000.  Impact  of  environment  and  interspecific  interactions  between spoilage fungi and Aspergillus ochraceus on growth and ochratoxin production in maize grain.","cites":null},{"id":37978959,"title":"Incidence and severity of fungi associated with garlic cloves.","authors":[],"date":"1999","doi":null,"raw":"Soares, R.M., Kurozawa, C., 1999. Incidence and severity of fungi associated with garlic cloves. Summa Phytopathologica 25, 271-274.","cites":null},{"id":37978956,"title":"Influence of sulphur dioxide, controlled atmospheres and water availability on in vitro germination, growth and ochratoxin A production by strains of Aspergillus carbonarius isolated from grapes.","authors":[],"date":"2007","doi":"10.1016\/j.postharvbio.2006.11.016","raw":"Pateraki,  M.,  Dekanea,  A.,  Mitchell,  D.,  Lydakis,  D.,  Magan,  N.,  2007.  Influence  of  sulphur dioxide,  controlled  atmospheres  and  water  availability  on  in  vitro  germination,  growth  and ochratoxin A production by strains of Aspergillus carbonarius isolated from grapes. Postharvest Biology and Technology 44, 141-149.","cites":null},{"id":37978963,"title":"Onion and Garlic Basal Rot, Pathogen: Fusarium oxysporum f. sp. cepae 2004; www.ipm.ucdavis.edu\/PMG\/r584100611.html.","authors":[],"date":null,"doi":null,"raw":"UC IPM Online. Onion and Garlic Basal Rot, Pathogen: Fusarium oxysporum f. sp. cepae 2004; www.ipm.ucdavis.edu\/PMG\/r584100611.html. ACCEPTED MANUSCRIPT ACCEPTED MANUSCRIPT","cites":null},{"id":37978952,"title":"Paraphaeosphaeria recurvifoliae, a new species causing leaf spots and necrosis on Yucca recurvifolia.","authors":[],"date":"2005","doi":null,"raw":"Lee,  H.B.,  Kim,  K.M.,  Jung,  H.S.,  2005.  Paraphaeosphaeria  recurvifoliae,  a  new  species causing leaf spots and necrosis on Yucca recurvifolia. Fungal Diversity 20, 71-81.","cites":null},{"id":37978951,"title":"Phaeomoniella zymoides and Phaeomoniella pinifoliorum spp. nov., new acid-tolerant epiphytic fungi isolated from pine needles in Korea.","authors":[],"date":"2006","doi":"10.3852\/mycologia.98.4.598","raw":"International Journal Food Microbiology 61, 11-16.   ACCEPTED MANUSCRIPT ACCEPTED MANUSCRIPT Lee,  H.B.,  Park,  J.Y.,  Jung,  H.S.,  Summerbell,  R.C.,  2006.  Phaeomoniella  zymoides  and Phaeomoniella  pinifoliorum  spp.  nov.,  new  acid-tolerant  epiphytic  fungi  isolated  from  pine needles in Korea. Mycologia 98, 598-611.","cites":null},{"id":37978953,"title":"Post-harvest control strategies: minimising mycotoxins in the food chain.","authors":[],"date":"2007","doi":"10.1016\/j.ijfoodmicro.2007.07.034","raw":"Magan, N., Aldred, D.C.N., 2007. Post-harvest control strategies: minimising mycotoxins in the food chain. International Journal of Food Microbiology 119, 131-139.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-04","abstract":"Embellisia allii results in the formation of a bulb canker and black soot on the surface of different alliums and it has been frequently detected on garlic bulbs together with the spoilage fungus, Fusarium oxysporum f. sp. cepae, which causes bulb basal plate rot. In this study, the influence of water activity (aw) and temperature on mycelial growth of E. allii and F. oxysporum f. sp. cepae, conidial size and sporulation of E. allii, interactions between E. allii and F. oxysporum f. sp. cepae, Index of Dominance (ID), and in situ virulence on garlic were examined. Mycelial growth of E. allii was optimal (5.97 mm\/day) at 0.995 aw and 25 °C, slower at 30 °C. However, almost no growth occurred at 0.937 aw\/30 °C. F. oxysporum f. sp. cepae grew faster than E. allii, (6.3–7.4 mm\/day) at 30 °C. Interactions between E. allii and F. oxysporum f. sp. cepae were influenced by aw and temperature. Sporulation of E. allii was more abundant on PDA than on MEA, especially at high aw (0.995) and low temperature (20 °C), but almost no sporulation occurred at 30 °C regardless of nutritional medium or aw level. The spore length of E. allii was longer on PDA than MEA, and was significantly influenced by water availability. F. oxysporum f. sp. cepae was competitive against E. allii and had a higher ID value in comparison with E. allii especially at a higher temperature (30 °C). In situ virulence tests showed that E. allii was weakly virulent on the garlic bulb cloves while that of F. oxysporum f. sp. cepae was highly dependent on aw","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139475.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.ijfoodmicro.2010.01.019","pdfHashValue":"aaa810a823498d44b874c8e8911d8bd6ef73faa1","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/4329<\/identifier><datestamp>2010-03-26T09:49:39Z<\/datestamp><setSpec>hdl_1826_2005<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>The influence of environmental factors on growth and interactions between Embellisia allii and Fusarium oxysporum f. sp. cepae isolated from garlic<\/dc:title><dc:creator>Lee, Hyang Burm<\/dc:creator><dc:creator>Magan, Naresh<\/dc:creator><dc:subject>Embellisia allii<\/dc:subject><dc:subject>Fusarium oxysporum f. sp. cepae<\/dc:subject><dc:subject>Water activity (aw)<\/dc:subject><dc:subject>Temperature<\/dc:subject><dc:subject>Interactions<\/dc:subject><dc:description>Embellisia allii results in the formation of a bulb canker and black soot on the surface of different alliums and it has been frequently detected on garlic bulbs together with the spoilage fungus, Fusarium oxysporum f. sp. cepae, which causes bulb basal plate rot. In this study, the influence of water activity (aw) and temperature on mycelial growth of E. allii and F. oxysporum f. sp. cepae, conidial size and sporulation of E. allii, interactions between E. allii and F. oxysporum f. sp. cepae, Index of Dominance (ID), and in situ virulence on garlic were examined. Mycelial growth of E. allii was optimal (5.97 mm\/day) at 0.995 aw and 25 °C, slower at 30 °C. However, almost no growth occurred at 0.937 aw\/30 °C. F. oxysporum f. sp. cepae grew faster than E. allii, (6.3–7.4 mm\/day) at 30 °C. Interactions between E. allii and F. oxysporum f. sp. cepae were influenced by aw and temperature. Sporulation of E. allii was more abundant on PDA than on MEA, especially at high aw (0.995) and low temperature (20 °C), but almost no sporulation occurred at 30 °C regardless of nutritional medium or aw level. The spore length of E. allii was longer on PDA than MEA, and was significantly influenced by water availability. F. oxysporum f. sp. cepae was competitive against E. allii and had a higher ID value in comparison with E. allii especially at a higher temperature (30 °C). In situ virulence tests showed that E. allii was weakly virulent on the garlic bulb cloves while that of F. oxysporum f. sp. cepae was highly dependent on aw.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2010-03-26T09:49:39Z<\/dc:date><dc:date>2010-03-26T09:49:39Z<\/dc:date><dc:date>2010-04<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Hyang Burm Lee, Naresh Magan, The influence of environmental factors on growth and interactions between Embellisia allii and Fusarium oxysporum f. sp. cepae isolated from garlic, International Journal of Food Microbiology, Volume 138, Issue 3, 15 April 2010, Pages 238-242<\/dc:identifier><dc:identifier>0168-1605<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.ijfoodmicro.2010.01.019<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/4329<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0168-1605","0168-1605"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Embellisia allii","Fusarium oxysporum f. sp. cepae","Water activity (aw)","Temperature","Interactions"],"subject":["Article"],"fullText":"\u0000\u0002\u0002\u0003\u0004\u0005\u0003\u0006 \u0007\b\t\n\u000b\u0002\f\r\u0004\u0005\nThe influence of environmental factors on growth and interactions between\nEmbellisia allii and Fusarium oxysporum f. sp. cepae isolated from garlic\nHyang Burm Lee, Naresh Magan\nPII: S0168-1605(10)00036-X\nDOI: doi: 10.1016\/j.ijfoodmicro.2010.01.019\nReference: FOOD 5007\nTo appear in: International Journal of Food Microbiology\nReceived date: 26 May 2009\nRevised date: 5 January 2010\nAccepted date: 17 January 2010\nPlease cite this article as: Lee, Hyang Burm, Magan, Naresh, The influence of environ-\nmental factors on growth and interactions between Embellisia allii and Fusarium oxysporum\nf. sp. cepae isolated from garlic, International Journal of Food Microbiology (2010), doi:\n10.1016\/j.ijfoodmicro.2010.01.019\nThis is a PDF file of an unedited manuscript that has been accepted for publication.\nAs a service to our customers we are providing this early version of the manuscript.\nThe manuscript will undergo copyediting, typesetting, and review of the resulting proof\nbefore it is published in its final form. Please note that during the production process\nerrors may be discovered which could affect the content, and all legal disclaimers that\napply to the journal pertain.\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 1\nThe influence of environmental factors on growth and interactions between Embellisia \nallii and Fusarium oxysporum f. sp. cepae isolated from garlic  \n \nHyang Burm Lee a,* and Naresh Maganb \n \na\n Division of Applied Bioscience & Biotechnology, College of Agriculture & Life Sciences, \nChonnam National University, Gwangju 500-757, Republic of Korea \nb\n Applied Mycology Group, Cranfield Health, Cranfield University, Bedford, MK43 0AL, U.K. \n \nCorresponding author: Hyang Burm Lee \nE-mail address: hblee@jnu.ac.kr \nTel: +82-62-530-2136, Fax: +82-62-530-2139 \n \nAbstract \nEmbellisia allii results in the formation of a bulb canker and black sooty on the surface of \ndifferent alliums and it has been frequently detected on garlic bulbs together with the spoilage \nfungus, Fusarium oxysporum f. sp. cepae, which causes bulb basal plate rot. In this study, the \ninfluence of water activity (aw) and temperature on mycelial growth of E. allii and F. oxysporum f. \nsp. cepae, conidial size and sporulation of E. allii, interactions between E. allii and F. oxysporum \nf. sp. cepae, Index of Dominance (ID), and in situ virulence on garlic were examined. Mycelial \ngrowth of E. allii was optimal (5.97 mm\/day) at 0.995 aw and 25°C, slower at 30°C. However, \nalmost no growth occurred at 0.937 aw\/30°C. F. oxysporum f. sp. cepae grew faster than E. allii, \n(6.3-7.4 mm\/day) at 30°C. Interactions between E. allii and F. oxysporum f. sp. cepae were \ninfluenced by aw and temperature. Sporulation of E. allii was more abundant on PDA than on \nMEA, especially at high aw (0.995) and low temperature (20°C), but almost no s porulation \noccurred at 30°C regardless of nutritional medium o r aw level. The spore length of E. allii was \nlonger on PDA than MEA, and was significantly influenced by water availability. F. oxysporum f. \nsp. cepae was competitive against E. allii and had a higher ID value in comparison with E. allii \nespecially at a higher temperature (30°C). In situ virulence tests showed that E. allii was weakly \nvirulent on the garlic bulb cloves while that of F. oxysporum f. sp. cepae was highly dependent \non aw.  \n \nKeywords: Embellisia allii, Fusarium oxysporum f. sp. cepae, Water activity (aw), Temperature, \nInteractions \n \n \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 2\n1. Introduction \n \nGarlic (Allium sativum L.), an important bulbous plant, is used mainly as a seasoning for foods, \nand increasingly as an herbal medicine and pesticide in organic farming (Pitman and Burt, \n2001). Garlic can be damaged by a number of soil inhabiting species and\/or storage fungi \n(Stadnik et al., 1994). When Soares and Kurozawa (1998, 1999) examined samples of garlic \nbulbs from Brazil, the most prevalent genera were Fusarium (88.6%), Penicillium (77.1%) and \nAspergillus (9.3%), and the most dominant species was Embellisia allii (Campan.) Simm. (2.5%).  \n \nF. oxysporum f. sp. cepae (Hanz.) Snyder & Hansen can cause basal plate rot, which is \ncharacterized by a firm pinkish brown rot covered with whitish mycelium, and less frequently \nfoliar disease (Schwartz and Mohan, 2006). This occurs wherever alliums such as onion, garlic, \nshallot, chive and leek are cultivated; however it has also been frequently observed on garlic \nbulbs (Crowe et al., 1986; Everts et al., 1985; Matuo et al., 1986). Garlic bulb canker caused by \nE. allii has been reported in many countries including the USA (Simmons, 1971; David, 1991; \nFarr & Rossman, 2009), Canada (Corlett, 1996), Japan (Taniguchi et al., 1994) and Korea (Lee \net al., 2002). E. allii attacks the outer scales of the garlic bulb, producing a black soot that \ncovers the surface during cultivation as well as after storage. In mature bulbs, this disease \naffects their appearance and hence their market value.  \n \nA previous survey conducted in Korea revealed that bulb canker and basal rot disease existed \nnot only on newly harvested bulbs from different cultivation areas but also on polyfilm-wrapped \ncloves sold in the markets (Lee et al., 2002). Previously, Taniguchi et al. (1994) reported that \nthe garlic bulb canker caused by E. allii is a minor disease. However, we have observed that \nlosses due to decay of garlic were occasionally severe. There have been no reports on the \ngrowth and sporulation of E. allii under different environmental conditions. In addition, little \ninformation is available about the co-occurrence of E. allii and F. oxysporum f. sp. cepae on \ngarlic bulbs and the interactions that may occur between those two species during storage. \nDominance and colonization on different substrates may be considerably influenced by \nenvironmental or biological factors such as water activity, niche temperature, and inter-specific \ninteractions (Magan and Lacey, 1984; Lee and Magan, 1999; Lee and Magan, 2000; Magan \nand Aldred, 2007; Giorni et al., 2008). Such information may be critical in understanding the \nconditions that enable individual fungi to become dominant in the garlic niche, especially post-\nharvest.  \n \nThe objectives of this study were to determine (a) the effect of water activity (0.937, 0.971, and \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 3\n0.995 aw) and temperature (20, 25, and 30°C) on in vitro mycelial growth, sporulation and spore \nsize of E. allii, and F. oxysporum f. sp. cepae, (b) the relative competitiveness of these fungi and \n(c) in situ pathogenicity on garlic.  \n \n2. Materials and methods \n \n2.1. Fungal species \n \nDiseased garlic bulbs were collected directly from cultivation areas or storehouses of Seosan \nand markets of Cheongyang, Suwon, and Daejeon, Korea. Spoilage fungi were isolated from \nbulb cankers and basal rot lesions of stored garlic. Based on morphology and sequence \nanalyses of the internal transcribed spacer (ITS) region of 18S ribosomal DNA, the fungi were \nconfirmed to be E. allii, and F. oxysporum f. sp. cepae, respectively. The molecular \ncharacterization of the strains was performed using previous methods (Lee et al., 2005; Lee et \nal., 2006). When the sequence of the isolates was compared with related species retrieved from \nGenBank, the intra-specific DNA homologies were between 99-100% identical (data not shown). \nAll strains have been deposited in the EML herbarium (Chonnam National University, Gwangju, \nRepublic of Korea) as E. allii HBL-EA01 to HBL-EA03, F. oxysporum f. sp. cepae FO-HBL05 \nand FO-HBL06), respectively.  \n \n2.2. Media \n \nThe basal media were (a) 2% malt extract agar (MEA, Difco) at pH 5.5 and (b) 4% potato \ndextrose agar (PDA, Difco). The water activity (aw) of the basal MEA medium was 0.995, which \nwas modified to 0.937 and 0.971 by using glycerol+ water solutions. MEA + 2% ground garlic \nextract (MEGA) was also used as a semi-natural medium in this study. The aw of media was \nmeasured using a Novasina ICII (Novasina AG, Zurich, Switzerland). \n \n2.3. Effects of water activity and temperature on mycelial growth, sporulation and spore size \n \nStock cultures of test species were grown on MEA at 25°C and used as inocula. Growth rates of \nE. allii and F. oxysporum f. sp. cepae were determined by transferring mycelial plugs (5 mm in \ndiameter) from the growing margin of stock cultures in Petri dishes (90 x 15 mm in diameter) \ncontaining MEA, PDA and MEGA. After inoculation, plates with the same aw were sealed in \npolyethylene bags and incubated at 20, 25, and 30°C  in darkness for up to 10 days. Mycelial \ngrowth was recorded periodically by measuring the diameter of the colony in two directions at \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 4\nright angles to each other.  \n \nSpore production was determined after 14 days incubation by placing entire colonies grown on \nmedia into flasks with a measured volume of distilled water. All the experiments were carried out \nwith at least three separate plates per treatment. Five ml of distilled water was added to each \nplate and spores were dislodged from the plates using a soft brush. Using a haemocytometer, \nthe spore length, width, and septation was determined of 30-50 spores for each treatment and \nreplicate (n=3).  \n \n2.4. Interactions between E. allii and F. oxysporum f. sp. cepae \n \nDual culture tests were carried out under different aw and temperature regimes by inoculation of \nthe species (10 mm diameter agar plugs) 4 cm apart. The diameter of the growing colonies was \nmeasured daily as described previously (Magan and Lacey, 1984; Lee and Magan, 1999; Lee \nand Magan, 2000). The macroscopic interactions between mycelia in dual cultures were \nexamined and each species given a score based on mutual intermingling (1-1), mutual \nantagonism (2-2), mutual antagonism at a distance (3-3), dominance of one species upon \ncontact (4-0) and dominance at a distance (5-0) according to Magan and Lacey (1984). An \nIndex of Dominance (ID) was used to measure the ability of a species to dominate under a \nparticular set of treatment conditions. The scores for each species were added to obtain the \noverall ID.  \n \n2.5. In situ virulence test on garlic \n \nThe ability (= in situ virulence) of E. allii and F. oxysporum f.sp. cepae to infect garlic bulbs was \nevaluated under different relative humidities in plastic boxes adjusted to different aw levels. The \nRH in the boxes was adjusted to 0.999 aw (= 99.9% RH), 0.971 (= 97% RH) and 0.937 (= 93.7% \nRH). For inoculation, spores (105\/ml in E. allii and 106\/ml in F. oxysporum f. sp. cepae) were \nprepared and hand sprayed on the garlic bulb cloves (either surface wounded with a sterile \nneedle, or non-wounded). The aw conditions and experimental conditions were as detailed in \nBeecher et al. (2001). Their virulence was determined by the symptom level (+++, very virulent; \n+, slightly virulent, -, not virulent) on garlic at 25°C after 12 days.  \n \n3. Results \n \n3.1. Effects of water activity and temperature on mycelial growth, sporulation and conidial size \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 5\nFigure 1 shows the effect of aw on growth of E. allii on both a characterized artificial medium and \non that containing garlic. This was faster at 0.995 aw on the control substrate (MEGA without \nglycerol. There was no significant difference in growth of E. allii between the two media. Figure \n2 shows the effect of aw and temperature on growth of two strains of F. oxysporum f. sp. cepae. \nAt 0.995 and 0.971 aw, isolates FO-HBL05 and FO-HBL06 grew faster at 30°C than at lower \ntemperatures. Regardless of temperatures, the FO-HBL06 isolate was more tolerant of water \nstress (0.937 aw) than FO-HBL05.  \n \nSporulation of E. allii was better on PDA than MEA, especially at a high aw level (0.995 aw) and \nat the lowest temperature tested (20°C, Fig. 3). Ho wever, almost no sporulation occurred at \n30°C regardless of media and a w used. Practically no sporulation occurred at 30°C r egardless of \nmedia used. However, the conidial size E. allii conidia was affected by medium, aw, and \ntemperature (Table 1).  \n \n3.2. Interactions between E. allii and F. oxysporum f. sp. cepae \n \nThere was mutual inhibition between E. allii and F. oxysporum f. sp. cepae strains depending on \nthe environmental conditions and medium. At 0.995 aw, E. allii was inhibited more by strain FO-\nHBL06 than by FO-HBL05 at 25-30°C in comparison wit h the control. Interaction patterns and \nthe ID values among E. allii and the mean scores of two F. oxysporum f. sp. cepae strains are \nshown in Figure 4. Generally, the two isolates of F. oxysporum f. sp. cepae were more \ncompetitive against E. allii and had a higher ID value.  \n \n3.3. In situ pathogenicity of spoilage pathogens \nTable 2 shows that the relative ability of E. allii and F. oxysporum f. sp. cepae to infect garlic \nbulbs was affected by water activity (=% relative humidity). In situ pathogencity of both \ndecreased when the water availability was reduced (0.937 aw), but F. oxysporum f. sp. cepae \nwas more tolerant than E. allii to water stress. E. allii was unable to infect garlic bulbs when the \nwater availability was 0.937 and 0.971 aw.  \n \n4. Discussion \n \nThe present study has shown that besides Penicillium and Botrytis, decay fungi including E. allii \nand Fusarium species are also associated with the spoilage of garlic bulbs. Both these latter \nspecies have been frequently found with basal rot and clove rot fungus and in garlic bulbs \npacked in bags or stored for long periods at low temperatures. Before and after harvest, the \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 6\ngarlic bulbs carry a wide range of fungi as spores or mycelia. These fungi will interact with each \nother and some will become more dominant than others. These interactions between species \nare influenced by many parameters; however, substrate (nutrient), water availability (aw) and \ntemperature are known to be the most important abiotic parameters that determine growth \n(Magan and Aldred, 2007; Pateraki et al., 2007). Interestingly, the ecophysiological \ncharacteristics of E. allii in a garlic bulb niche is important in understanding which spoilage \nfungus can be the dominant invader or how certain other spoilage species can be dominated by \nother interacting fungi. The present results showed that the preferential establishment of F. \noxysporum f. sp. cepae might prevent E. allii or other important spoilage fungi such as \nAspergillus and Penicillium from colonizing the same bulb of garlic. Among the isolates of F. \noxysporum, there were differences in their ability to compete against E. allii. This was supported \nby the overall higher l ID value. \n  \nBased on the virulence test, E. allii was weakly pathogenic in wounded garlic. This is in ore \nagreement with a previous study by Taniguchi et al. (1994). E. allii did not infect garlic bulbs \nunder lowered aw (0.937, 0.971 aw), but only when water was freely available and under cooler \nconditions during longer term storage. Often wrapping and packaging with polyfilms barriers \nallow a buildup of water due to respiration and can promote discoloration and spoilage. F. \noxysporum f. sp. cepae grew fast under warmer conditions. The optimum storage temperature \nfor seed garlic is 10°C with a humidity of 65-70%. Garlic cloves sprout most rapidly between \n4.5-10°C and thus prolonged storage at this tempera ture range should be avoided. E. allii was \nmore sensitive to water and temperature stress than the isolates of F. oxysporum f. sp. cepae. \nUntil recently, there have been little statistical data on the economic repercussions of the \ndamage caused to garlic by F. oxysporum f. sp. cepae in Korea, but damage due to unfavorable \nstorage has been reported to be severe (data not shown). F. oxysporum survives indefinitely in \nsoil. Infection occurs through wounds or in the vicinity of old root scars at the base of the bulb. \nThe disease favors soil temperatures in the range of approx. 13 to 32°C, with optimum \ntemperatures ranging from approx. 26-27°C. Basal ro t is more prevalent in transplanted onions \nthan in direct-seeded onions (UC IPM Online, 2004). The roots of plants infected early in the \ngrowing season can decay and die or turn yellow and wilt. The bulbs of plants infected later in \nthe season may appear normal, but the inner neck tissue may feel soft and portions or all of the \nbasal plate develop a firm dry rot, turn brown, and die. Under moist conditions, the diseased \nscales can develop white mold (UC IPM Online, 2004).  \n \nThe present study has identified that these two fungi have different ecologically niches in which \nthey are able to cause spoilage in garlic. This basic understanding of the post-harvest biology of \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 7\nthese two spoilage fungi will be beneficial to design control strategies based on the weaker \npoints in their life cycle.  \n \nAcknowledgements \nThis work was supported in part by the grant (20070301034004) from BioGreen21 program, \nRural Development Administration, and the NRF grant (R01-2007-000-21120-0), Ministry of \nEducation, Science and Technology, Republic of Korea. \n \nReferences \n \nCorlett, M., 1996. Embellisia allii. Canadian Journal of Plant Pathology 18, 486-487. \n \nCrowe, F.J., Scardaci, S.C., Greathead, A.S., Hall, D.H., Somerville P.A., Kurtz, E., 1986. \nFusarium basal rot of garlic. Proceedings of American Phytopathological Society, Abstract #293. \n \nDavid, J.C., 1991. Embellisia allii (IMI Descriptions of Fungi and Bacteria No. 1078). \nMycopathologia 116, 59-60.  \n \nEverts, K.L., Schwartz, H.F., Epsky, N.D., Capinera J.L., 1985. Effects of maggots and \nwounding on occurrence of Fusarium basal rot of onions in Colorado. Plant Disease 69, 878-\n882. \n \nGiorni, P., Battilani, P., Pietri, A., Magan, N., 2008. Effect of aw and CO2 level on Aspergillus \nflavus growth and aflatoxin production in high moisture maize post-harvest. International \nJournal Food Microbiology 122, 109-113. \n \nLee, H.B., Kim, -C.-J., and Yu, S.H., 2002. First report of bulb canker of garlic caused by \nEmbellisia allii in Korea. Mycobiology 30(4), 240-243. \n \nLee, H.B., Magan, N., 1999. Environmental factors and nutritional utilization patterns affect \nniche overlap indices between Aspergillus ochraceus and other spoilage fungi. Letters in \nApplied Microbiology 28, 300-304. \n \nLee, H.B., Magan, N., 2000. Impact of environment and interspecific interactions between \nspoilage fungi and Aspergillus ochraceus on growth and ochratoxin production in maize grain. \nInternational Journal Food Microbiology 61, 11-16.  \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 8\nLee, H.B., Park, J.Y., Jung, H.S., Summerbell, R.C., 2006. Phaeomoniella zymoides and \nPhaeomoniella pinifoliorum spp. nov., new acid-tolerant epiphytic fungi isolated from pine \nneedles in Korea. Mycologia 98, 598-611. \n \nLee, H.B., Kim, K.M., Jung, H.S., 2005. Paraphaeosphaeria recurvifoliae, a new species \ncausing leaf spots and necrosis on Yucca recurvifolia. Fungal Diversity 20, 71-81. \n \nLee, J.T., 1998. List of Plant Diseases in Korea. Kor (3rd ed.). p. 116. Kor. Society of Plant \nPathology. World Science. \n \nMagan, N., Aldred, D.C.N., 2007. Post-harvest control strategies: minimising mycotoxins in the \nfood chain. International Journal of Food Microbiology 119, 131-139. \n \nMagan, N., Lacey, J., 1984. Effect of water activity, temperature and substrate on interactions \nbetween field fungi and storage fungi. Transactions of the British Mycological Society 82, 83-93. \n \nMatuo, T., Miyagawa, M., Saito, H., 1986. Fusarium oxysporum f. sp. garlic n.f.sp. causing basal \nrot of garlic. Annual Phytopathology Society Japan 52, 860-864. \n \nPateraki, M., Dekanea, A., Mitchell, D., Lydakis, D., Magan, N., 2007. Influence of sulphur \ndioxide, controlled atmospheres and water availability on in vitro germination, growth and \nochratoxin A production by strains of Aspergillus carbonarius isolated from grapes. Postharvest \nBiology and Technology 44, 141-149. \n \nSchwartz, H.F., Mohan, S.K., 2006. Compendium of onion and garlic diseases and pests (2nd \ned.). p. 127. APS Press, Minnesota, USA. \n \nSimmons, E.G., 1971. Helminthosporium allii as type of new genus. Mycologia 63, 380-386. \n \nSoares, R.M, Kurozawa, C., 1998. Chemical control of associated fungi of garlic cloves. Summa \nPhytopathologica 24, 279-283. \n \nSoares, R.M., Kurozawa, C., 1999. Incidence and severity of fungi associated with garlic cloves. \nSumma Phytopathologica 25, 271-274. \n \nStadnik, M.J., Aguiar, M., Castro, C., 1994. Effects of Embellisia allii and Fusarium oxysporum f. \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 9\nsp. cepae on stored garlic gloves. Fitopatologia Brasileira 19, 294 (Abstract). \n \n \nTaniguchi, N., Kishi, T., Tohyama, A., Tsuda, M., 1994. Bulb canker of garlic caused by \nEmbellisia allii, newly found in Japan. Mycoscience 35, 421-424. \n \nUC IPM Online. Onion and Garlic Basal Rot, Pathogen: Fusarium oxysporum f. sp. cepae 2004; \nwww.ipm.ucdavis.edu\/PMG\/r584100611.html. \n \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 10\n \nTable 1. Effect of water activity (aw), temperature and medium on conidial dimensions \n(morphology) of Embellisia allii HBL-EA01 \nCondition Conidial dimension \nNo. of septa           Spore width (µm)        Spore length (µm) \n20°C \nPDA \/ basic \nMEA \/ 0.995 aw \nMEA \/ 0.971 aw \n \n3.2±0.17a \n2.9±0.09 \n1.9±0.15 \n \n13.4±0.35 \n11.7±0.30 \n12.5±0.36 \n \n30.4±0.79 \n25.2±0.56 \n21.2±1.09 \n25°C \nPDA \/ basic \nMEA \/ 0.995 aw \nMEA \/ 0.971 aw \n \n2.2±0.21 \n2.1±0.18 \n2.0±0.20 \n \n13.0±0.39 \n12.0±0.32 \n11.5±0.45 \n \n22.0±1.02 \n21.6±0.91 \n20.6±1.02 \naMean ±SD value. At 30°C, no examination because of poor conidiation. \n \n \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 11 \n \nTable 2. In situ pathogenicity of strains of E. allii and F. oxysporum f. sp. cepae strains on \ngarlic under different water activity conditions \nIsolate Water activity level \nControl* 0.995  0.971  0.937  \nE. allii HBL-EA01 \nE. allii HBL-EA03 \n+** \n+ \n+ \n+ \n- \n- \n- \n- \nF. oxysporum f. sp. \ncepae HBL05 \nF. oxysporum f. sp. \ncepae HBL06 \n++ \n \n++ \n++ \n \n++ \n+ \n \n+- \n- \n \n- \n*Control: water saturated condition (without glycerol added), +**: slightly virulent, ++: highly \nvirulent, +-: very slightly virulent, -: not virulent. The virulence on garlic was determined at 25°C  \nafter 12 days. \n \n \n \n \n \n \n \n \n \n \n \n \n \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 12\n \nFigures captions \n \nFigure 1. Mycelial growth of Embellisia allii HBL-EA01 on malt extract agar (MEA) and malt \nextract galic agar (MEGA) under different water activity conditions (▨–▨, 0.995; ▨–▨, 0.971; \n▨–▨, 0.937) at 25°C. The radii of all colonies were me asured after 6 days inoculation. \n \nFig. 2. Mycelial growth of F. oxysporum f. sp. cepae (strains FO-HBL05, FO-HBL06) on malt \nextract agar (MEA) under different water activity conditions (▨–▨, 0.995; □–□, 0.971; ▨–▨, \n0.937) at 20 (A), 25 (B) and 30°C (C). \n \nFig. 3. Sporulation of E. allii HBL-EA01 on malt extract agar (MEA) and potato dextrose agar \n(PDA) at different water activity conditions (▨–▨, 0.995; ▨–▨, 0.971; ▨–▨, 0.937) and at 20 (A), \n25 (B), and 30°C (C). Bars represent standard error s of estimated parameters. \n \nFig. 4. Mean Index of Dominance (ID) of E. allii HBL-EA01 when paired with two strains of F. \noxysporum f. sp. cepae (FO-HBL05, FO-HBL06) on malt extract agar (MEA) under different \nwater activities (A, 0.971; B, 0.995 aw) at 20, 25, and 30°C  . \nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 13\n \n \n \nFigure 1. Lee and Magan \n \n \n \n \n \n0\n10\n20\n30\n40\n50\nMEA MEGA\n0.995 aw\n0.971 aw\n0.937 aw\nControl (without glycerol)\nMedia\nM\nea\nn\n \nC\no\nlo\nn\ny \nR\na\ndi\nu\ns(m\nm\n)\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 14\n \n \n \n \n \n \nFigure 2. Lee and Magan \ny = 6.3125x + 2\ny = 3.0125x + 1.875\ny = 0.488x + 1.53\n0\n10\n20\n30\n40\n50\n60\n1 2 3 4 5 6 7 8\ny = 6.125x + 0.9333\ny = 2.4x + 1.875\ny = 0.3645x + 1.665\n0\n10\n20\n30\n40\n50\n60\ny = 4.325x + 0.5\ny = 1.793x + 1.755\ny = 0.53x - 0.4\n0\n10\n20\n30\n40\n50\n60\nTime (days)\nM\nea\nn\n \nC\no\nlo\nn\ny \nR\na\ndi\nu\ns \n(m\nm\n)\ny = 7.25x + 2\ny = 2.7805x + 3.255\ny = 1.075x + 2.19\n0\n10\n20\n30\n40\n50\n60\ny = 7.375x + 2.75\ny = 3.0555x + 3.005\ny = 1.1755x + 1.62\n0\n10\n20\n30\n40\n50\n60\n1 2 3 4 5 6 7 8\ny = 5.5x + 1.5\ny = 2.2395x + 3.07\ny = 0.68x + 1.375\n0\n10\n20\n30\n40\n50\n60\nA\nCC\nBB\nA\nFO-HBL05 FO-HBL06\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 15\n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 3.  Lee and Magan \n \n \n \n \n \nTemperature (oC)\nN\nu\nm\nbe\nr \no\nf S\npo\nre\ns \n(x \n10\n \n4\npe\nr \npl\na\nte\n)\n0\n20\n40\n60\n80\n100\n120\n20 25 30\nPDA 0.995 aw\nMEA 0.995 aw\nMEA 0.971 aw\nAC\nCE\nPT\nED\n M\nAN\nUS\nCR\nIP\nT\nACCEPTED MANUSCRIPT\n 16\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFigure 4. Lee and Magan \n0\n1\n2\n3\n4\n5\n6\n7\n8\n20 25 30 20 25 30 20 25 30\nE. allii\nF. oxysporum\nIn\nde\nx\n \no\nf D\no\nm\nin\na\nn\nce\n (I\nD\n)\nTemperature(oC)\nIn\nde\nx\n \no\nf D\no\nm\nin\na\nn\nce\n (I\nD\n)\n0.937 aw 0.971 aw 0.995 aw\n"}