{"doi":"10.1080\/01431160701736414","coreId":"63279","oai":"oai:nora.nerc.ac.uk:2579","identifiers":["oai:nora.nerc.ac.uk:2579","10.1080\/01431160701736414"],"title":"Integrating remote sensing datasets into ecological\\ud\nmodelling: a Bayesian approach","authors":["Patenaude, G","Milne, R.","Van Oijen, M.","Rowland, C. S.","Hill, R. A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-03","abstract":"Process-based models have been used to simulate 3-dimensional complexities of\\ud\nforest ecosystems and their temporal changes, but their extensive data\\ud\nrequirement and complex parameterisation have often limited their use for\\ud\npractical management applications. Increasingly, information retrieved using\\ud\nremote sensing techniques can help in model parameterisation and data\\ud\ncollection by providing spatially and temporally resolved forest information. In\\ud\nthis paper, we illustrate the potential of Bayesian calibration for integrating such\\ud\ndata sources to simulate forest production. As an example, we use the 3-PG\\ud\nmodel combined with hyperspectral, LiDAR, SAR and field-based data to\\ud\nsimulate the growth of UK Corsican pine stands. Hyperspectral, LiDAR and\\ud\nSAR data are used to estimate LAI dynamics, tree height and above ground\\ud\nbiomass, respectively, while the Bayesian calibration provides estimates of\\ud\nuncertainties to model parameters and outputs. The Bayesian calibration\\ud\ncontrasts with goodness-of-fit approaches, which do not provide uncertainties\\ud\nto parameters and model outputs. Parameters and the data used in the\\ud\ncalibration process are presented in the form of probability distributions,\\ud\nreflecting our degree of certainty about them. After the calibration, the\\ud\ndistributions are updated. To approximate posterior distributions (of outputs\\ud\nand parameters), a Markov Chain Monte Carlo sampling approach is used (25\\ud\n000 steps). A sensitivity analysis is also conducted between parameters and\\ud\noutputs. Overall, the results illustrate the potential of a Bayesian framework for\\ud\ntruly integrative work, both in the consideration of field-based and remotely\\ud\nsensed datasets available and in estimating parameter and model output uncertainties","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/63279.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/2579\/1\/Patenaude-etal2006_Submitted_IntJRS.pdf","pdfHashValue":"cc994fc10cfcf869fc075952c991fdebb8838784","publisher":"Taylor and Francis","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:2579<\/identifier><datestamp>\n      2012-11-22T11:48:35Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      7375626A656374733D5339<\/setSpec><setSpec>\n      7375626A656374733D5334<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/2579\/<\/dc:relation><dc:title>\n        Integrating remote sensing datasets into ecological\\ud\nmodelling: a Bayesian approach<\/dc:title><dc:creator>\n        Patenaude, G<\/dc:creator><dc:creator>\n        Milne, R.<\/dc:creator><dc:creator>\n        Van Oijen, M.<\/dc:creator><dc:creator>\n        Rowland, C. S.<\/dc:creator><dc:creator>\n        Hill, R. A.<\/dc:creator><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:subject>\n        Data and Information<\/dc:subject><dc:subject>\n        Atmospheric Sciences<\/dc:subject><dc:description>\n        Process-based models have been used to simulate 3-dimensional complexities of\\ud\nforest ecosystems and their temporal changes, but their extensive data\\ud\nrequirement and complex parameterisation have often limited their use for\\ud\npractical management applications. Increasingly, information retrieved using\\ud\nremote sensing techniques can help in model parameterisation and data\\ud\ncollection by providing spatially and temporally resolved forest information. In\\ud\nthis paper, we illustrate the potential of Bayesian calibration for integrating such\\ud\ndata sources to simulate forest production. As an example, we use the 3-PG\\ud\nmodel combined with hyperspectral, LiDAR, SAR and field-based data to\\ud\nsimulate the growth of UK Corsican pine stands. Hyperspectral, LiDAR and\\ud\nSAR data are used to estimate LAI dynamics, tree height and above ground\\ud\nbiomass, respectively, while the Bayesian calibration provides estimates of\\ud\nuncertainties to model parameters and outputs. The Bayesian calibration\\ud\ncontrasts with goodness-of-fit approaches, which do not provide uncertainties\\ud\nto parameters and model outputs. Parameters and the data used in the\\ud\ncalibration process are presented in the form of probability distributions,\\ud\nreflecting our degree of certainty about them. After the calibration, the\\ud\ndistributions are updated. To approximate posterior distributions (of outputs\\ud\nand parameters), a Markov Chain Monte Carlo sampling approach is used (25\\ud\n000 steps). A sensitivity analysis is also conducted between parameters and\\ud\noutputs. Overall, the results illustrate the potential of a Bayesian framework for\\ud\ntruly integrative work, both in the consideration of field-based and remotely\\ud\nsensed datasets available and in estimating parameter and model output uncertainties.<\/dc:description><dc:publisher>\n        Taylor and Francis<\/dc:publisher><dc:date>\n        2008-03<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/2579\/1\/Patenaude-etal2006_Submitted_IntJRS.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Patenaude, G; Milne, R.; Van Oijen, M.; Rowland, C. S.; Hill, R. A..  2008  Integrating remote sensing datasets into ecological modelling: a Bayesian approach.   International Journal of Remote Sensing, 29 (5). 1295-1315.  https:\/\/doi.org\/10.1080\/01431160701736414 <https:\/\/doi.org\/10.1080\/01431160701736414>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.informaworld.com\/smpp\/content~content=a790896521~db=all~order=page<\/dc:relation><dc:relation>\n        doi:10.1080\/01431160701736414<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/2579\/","http:\/\/www.informaworld.com\/smpp\/content~content=a790896521~db=all~order=page","doi:10.1080\/01431160701736414"],"year":2008,"topics":["Ecology and Environment","Data and Information","Atmospheric Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"For Peer Review Only\nIntegrating remote sensing into forest ecosystem modeling through \nBayesian calibration \nJournal: International Journal of Remote Sensing \nManuscript ID: TRES-SIP-2006-0033 \nManuscript Type: Special Issue Paper \nDate Submitted by the \nAuthor:\n09-Oct-2006 \nComplete List of Authors: Patenaude, Genevieve; University of Edinburgh, School of \nGeosciences \nMilne, Ronald; Centre for Ecology and Hydrology, Edinburgh \nVan Oijen, Marcel; Centre for Ecology and Hydrology, Edinburgh \nRowland, Clare; Centre for Ecology and Hydrology, Section for \nEarth Observation \nHill, Ross; Centre for Ecology and Hydrology, Section for Earth \nObservation \nKeywords: FORESTRY, HYPERSPECTRAL DATA, LIDAR, SAR \nKeywords (user defined): Bayesian, Uncertainty, Ecological modelling \nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\nFor Peer Review Only\n1\nAbstract 1\nProcess-based models have been used to simulate 3 dimensional complexities of 2\nforest ecosystems and their temporal changes but their extensive data requirement and 3\ncomplex parameterisation has often limited their use for practical management 4\napplications. Increasingly, information retrieved with remote sensing techniques can 5\nhelp in model parameterisation and data collection by providing spatially and 6\ntemporally res lved forest information. In this paper, we illustrate the potential of 7\nBayesian calibration for integrating such data sources to simulate forest production. 8\nAs an example, we use the 3-PG model combined with hyperspectral, LiDAR, SAR 9\nand field-based data to simulate the growth of UK Corsican pine stands. 10 \nHyperspectral, LiDAR and SAR data are used to estimate LAI dynamics, tree height 11 \nand above ground biomass respectively, while the Bayesian calibration provides 12 \nestimates of uncertainties to model parameters and outputs. The Bayesian calibration 13 \ncontrasts with goodness-of-fit approaches which do not provide uncertainties to 14 \nparameters and model outputs. Parameters and the data used in the calibration process 15 \nare presented in the form of probability distributions, reflecting our degree of certainty 16 \nabout them. After the calibration, the distributions are updated. To approximate 17 \nposterior distributions (of outputs and parameters), a Markov Chain Monte Carlo 18 \nsampling approach is used (25000 steps). A sensitivity analysis is also conducted 19 \nbetween parameters and outputs.  Overall, the results illustrate the potential of a 20 \nBayesian framework for truly integrative work, both in the consideration of field-21 \nbased and remotely sensed datasets available and in estimating parameter and model 22 \noutput uncertainties. 23 \n 24 \nPage 1 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n2\n1 Introduction 25 \nProcess-based models are widely used in the fields of forest physiology and forest 26 \necology as they enable deeper insights into the drivers of forest production and growth 27 \nand offer higher flexibility than conventional production tables (Landsberg & Waring 28 \n1997). This flexibility enables the quantification and prediction of forest 2 and 3-D 29 \nstructural variables owing to deterministic, mechanistic and\/or stochastic algorithms 30 \nsimulating the processes affecting growth. However, their practical value has often 31 \nbeen limited owing to (a) their extensive data requirement and (b) their complexity 32 \nand the difficulty in quantifying parameters and model output uncertainty (e.g. 33 \nGertner et al. 1999).  34 \n 35 \nRemote sensing technology is increasingly exploited for forest inventorying and 36 \nmonitoring (e.g. Baulies and Pons 1995, Hyyppä et al. 2000) as it can provide insights 37 \ninto the spatial and temporal variability of forests, information which is seldom 38 \navailable from ground surveys alone. While it is a generally accepted premise that 39 \nfield data provide the closest representation of reality, spatially resolved ground based 40 \ndata can be time consuming, expensive and logistically difficult to acquire where 41 \naccess to forested land is limited. Comparatively, highly resolved remote sensing data 42 \ncan be obtained at relatively low costs. Additionally, novel approaches now supply 43 \nestimates of forest structural variables of accuracy equivalent if not superior to 44 \ntraditional measurements techniques (e.g. Magnussen and Boudewyn 1998, Hyyppä et 45 \nal. 2001).  Remote sensing may therefore help meet forest ecophysiologists and 46 \nmodellers’ data requirements.  47 \n 48 \nPage 2 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n3\nIn this context, we present Bayesian calibration (BC) as a means to integrate remotely 49 \nacquired datasets into ecological models. This approach offers a number of 50 \nadvantages in comparison with goodness-of-fit and optimisation approaches. In 51 \naddition to facilitating the integration of data of varying degree of uncertainty, BC 52 \nenables the quantification of uncertainty associated with parameters and model 53 \noutputs, an important requirement for practical applications of models (Green et al. 54 \n2000).  Parameters and data used in the calibration process are presented in the form 55 \nof probability distributions, reflecting our degree of certainty about them (Jansen 56 \n1999).  Bayesian calibration enables the updating of distributions as further 57 \ninformation is gained. The framework thereby targets the much-needed platform for 58 \n(i) integrating datasets of varying degree of certainty and (ii) expressing parameter 59 \nand output uncertainty in forest-growth modelling (Green et al. 2000, Ghazoul & 60 \nMcAllister 2003, Van Oijen et al. 2005).   61 \n 62 \nIn this paper, we demonstrate the usefulness of the approach by calibrating the 3-PG 63 \nmodel (Physiological Processes Predicting Growth, Landsberg & Waring 1997, Sands 64 \n& Landsberg 2002) for UK Corsican pine stands (Pinus nigra car. maritima (AIT.) 65 \nMelv.). 3-PG is built on a combination of process-based calculations, several key 66 \nsimplifying assumptions and few empirical relationships. The model predicts gross 67 \nand net primary production as well as biomass allocation to different pools. Over the 68 \nyears, it has been increasingly and successfully been applied to new species 69 \nworldwide (Landsberg & Waring 1997, Law et al. 2000, Waring 2000, Coops & 70 \nWaring 2001, Coops et al. 2001, Sands & Landsberg 2002, Almeida et al. 2004, Stape 71 \net al. 2004). However, the parameterisation of the model for new species remains a 72 \nchallenge. As stated by Sands (2004, p.3): “In only a few cases have parameters 73 \nPage 3 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n4\ncharacterising a species been rigorously determined, and even then this has been 74 \nlargely by a process of trial and error”. In this context, the aim of this paper is to 75 \nillustrate the potential of BC as a means to (i) calibrate models for novel species (ii) 76 \nintegrate multi-source datasets and (iii) quantify model parameters and outputs along 77 \nwith uncertainty.  78 \n 79 \nOur paper is structured as follow. In section two, we present an overview of the 3-PG 80 \nprincipal submodels. Section three provides a description of the field site, available 81 \nremote sensing and field based datasets for model initialisation, parameterisation and 82 \ncalibration. The processing of the databases is also briefly summarised. Section four 83 \ncontains the description of the Bayesian calibration and finally, results and 84 \ndiscussions are presented in section five and six, respectively. 85 \n 86 \n2 Structure of the 3-PG model 87 \nThe 3-PG model has monthly or annual time steps and entails five state variables –88 \nfoliage, stem and root biomass, stocking density and available soil water – in 89 \nconjunction with five submodels –biomass production; biomass allocation; soil water 90 \navailability and evapotranspiration; mortality; and inventory variables. The required 91 \nclimatic data are monthly average values of solar radiation (MJ m-2 d-1), atmospheric 92 \nwater pressure deficit (mbar), mean air temperature (°C), rainfall (mm month-1) and 93 \nfrost days. Other input variables include site latitude, an estimate of soil fertility, 94 \nmaximum available soil water (mm per depth of rooting zone, in meters) and a 95 \ngeneral description of soil texture. 3-PG outputs considered in this study were leaf 96 \narea index (LAI, projected), above ground biomass (ABG biomass, t ha-1), stem 97 \nbiomass (t ha-1), foliage biomass (t ha-1), root biomass (t ha-1) and stem height (m).  98 \nPage 4 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n5\n2.1 Biomass production 99 \nThe biomass submodel converts solar radiation into dry matter. The interception of 100 \nradiation is defined by Beer’s law and canopy LAI. The amount of photosynthetically 101 \nactive radiation intercepted by a stand (øpa, mol MJ-1) is then converted into 102 \ncarbohydrates by means of a canopy quantum efficiency coefficient (\u0010cx, mol mol-1)103 \nand a conversion factor converting carbohydrates into dry matter. Further constraints 104 \non assimilation are then applied by dimensionless environmental factors varying 105 \nbetween 0 and 1 (1 indicates optimal conditions). These factors, also referred to as 106 \nmodifiers, are multiplicative and represent the influence of vapour pressure deficit (D)107 \nor soil moisture, which ever is most limiting, mean air temperature (T), frost, and soil 108 \nnutrition on photosynthetic assimilation (Sands 2004). Gross primary productivity 109 \n(Pg, t ha-1 d-1) is then converted to net primary productivity (Pn, t ha-1 d-1) using a 110 \nsimple Pn \/ Pg ratio (Y).111 \n 2.2 Biomass allocation and mortality 112 \nPn is then allocated to the different plant components (roots, foliage and stems 113 \nincluding branches) at each time step. Allocation to roots is proportional to the 114 \nharshness of the environment. It is influenced by site fertility, stand age and the most 115 \nlimiting between D or soil water, but does not fall below or exceed set values of 116 \nminimum and maximum allocation to roots. The remaining Pn is shared between 117 \nstems and foliage through a foliage-to-stem allocation ratio, given by an allometric 118 \nrelationship with mean diameter at breast height (Sands & Landsberg 2002, Sands 119 \n2004). DBH is itself obtained from an allometric relationship with stem biomass. 120 \nWhereas Pn partitioning parameters must generally be estimated from fitting methods, 121 \nthose pertaining to the allometric relationship between stem biomass and diameter can 122 \nbe derived from forest mensuration (Sands & Landsberg 2002). Mortality is applied 123 \nPage 5 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n6\nthrough the self thinning 3\/2 law, which sets an upper limit to the mean single-tree 124 \nstem mass at a given stocking level. 125 \n 2.3 Soil water balance  126 \nAvailable soil water \u0016 (mm month-1) is governed by rainfall interception by the 127 \ncanopy (iR), rainfall (RP, mm month-1) and evapotranspiration (ET, mm month-1). If the 128 \nmaximum available water at saturation is exceeded, the excess of water is lost as 129 \nrunoff.  130 \n TPR ERi \u0001\u0001= )1(\u0003 [1] 131 \nRainfall interception increases with canopy LAI and is taken as a fraction of rainfall. 132 \nET is calculated using the Penman Monteith equation controlled by the canopy 133 \nconductance, solar radiation and D. Canopy conductance (gC, m s-1) increases with 134 \nLAI but is bounded by the LAI value at which conductance is at a maximum (gCx, m s-135 \n1). The relationship between gC and LAI is further controlled by age and the most 136 \nlimiting factor controlling stomatal aperture, either vapor pressure deficit or soil 137 \nmoisture.  Further details on 3-PG can be found in Landsberg and Waring (1997) and 138 \nSands and Landsberg (2002). 139 \n 140 \n3 Materials and methods 141 \n3.1 Study site and available datasets 142 \nThe calibration of the 3-PG model was conducted for Corsican Pine stands of yield 143 \nclass 14 using existing data from a 20,000 ha forest plantation, East Anglia, UK 144 \n(Thetford forest, 52°30´ N, 0°30´ E). The stands in Thetford are assumed under an 145 \nintermediate spacing, intermediate thinning and 80 years rotation regime (Edwards & 146 \nChristie 1981). 147 \nPage 6 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n7\n3.2 Field based datasets 148 \nThe following datasets were used in the calibration: (i) the UK Forestry Commission 149 \nGIS database, a spatially exhaustive catalogue comprising of approximate stand level 150 \ninformation on species, yield class, planting year, planting density and stemwood 151 \nvolume (ii) the Maestro-1 1989 campaign and the 2000 SHAC campaign datasets 152 \n(Baker 1992, Baker et al. 1994, Skinner and Luckman, 2000) which consist of ground 153 \ndata collected n stand level information  (each sampled stand was allocated a 154 \nForestry Commission code maintaining consistency with the GIS database) and (iii) 155 \ndatasets collected in Thetford over the years (e.g. Ovington 1957, Corbett 1973, 156 \nRoberts 1976, Beadle et al. 1982, Beadle et al. 1985a, Beadle et al. 1985b, Beadle et 157 \nal. 1985c, Stewart 1988, Mencuccini & Grace 1996).  158 \n 159 \nThe model was initialised for a stand aged 15 years using chronosequenced biomass 160 \ndata obtained from the Maestro dataset (Baker 1992, Baker et al. 1994). Initialising 161 \nthe model at this age removes the need for extra parameterisation required by early 162 \ngrowth processes while still enabling the calibration of key parameters. Root, stem 163 \nand foliage biomass were 7.1 t\/ha, 22 t\/ha and 9.8 t\/ha respectively. Initial stocking of 164 \n3955 trees per hectare was obtained from the production tables (Edwards and Christie 165 \n1981). 166 \n 167 \nThe required climatic data were derived from the Climate Research Unit datasets and 168 \nthe Cambridge botanical garden meteorological station (New et al. 2000, 169 \nhttp:\/\/badc.nerc.ac.uk\/home\/index.html). The area is characterised by a relatively flat 170 \ntopography and insignificant climatic variations within the site were assumed 171 \n(Ovington 1957). Long term average climatic conditions are summarized in Table 1. 172 \nPage 7 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n8\nTable 1 173 \n 174 \nOther input variables include site latitude, an estimate of soil fertility and texture, as 175 \nwell as available soil water (mm per depth of rooting zone, in meters). The soils of the 176 \nplantation are of poor quality, predominantly sandy with deep alkaline chalky bedrock 177 \nand drain freely throughout the forest (Corbett 1973, Mencuccini & Grace 1996). 178 \nMinimum available water was estimated based on field measurements taken during 179 \nthe drought year of 1976. During the drought, measurements have shown that at least 180 \n170mm soil water was available (Roberts et al. 1982). The maximum available water 181 \nwas assumed as 250mm based on: (a) the assumption that storage capacity for sandy 182 \nsoils is approximately 150mm per metre of soil with a permanent wilting point of 50 183 \nmm and (b) field measurements taken in Thetford, showing that 95% of roots are 184 \nlocated in the first meter of soil (Roberts 1976). Given the documented deep bedrock 185 \n(Corbett 1973), we assumed a 2 meters soil layer.  186 \n 187 \nAll runs were made with 3-PGpjs, a Visual Basic implementation of 3-PG in Excel 188 \navailable at http:\/\/www.ffp.csiro.au\/fap\/3pg\/download_details.htm.189 \n 190 \n 3.3. Remote sensing datasets and processing 191 \nSAR, Hyperspectral, and LiDAR datasets acquired in 2000 were included in the 192 \ncalibration. These datasets were used instead of alternative empirical, approximate 193 \nyield based tables given their site specific nature and our ability to quantify variability 194 \nin the estimates of biophysical variables. 195 \n 3.3.1 SAR 196 \nA multi-frequency, Synthetic Aperture Radar instrument (E-SAR) was flown on the 197 \n31st May 2000 in wide swath mode, with data collected at L-HH, L-HV, L-VV, X-198 \nPage 8 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n9\nVV, plus repeat-pass L-band fully polarimetric data.  The mean stand backscatter 199 \ncoefficient, Q0 (dB), and the mean stand interferometric coherence were calculated for 200 \nthe L-HH, L-VV and L-HV polarisations from the geocoded E-SAR data. Although 201 \nInSAR data were available, only the interferometric coherence and backscatter were 202 \nused for the work described here. A neural network was trained to estimate stand top 203 \nheight in Corsican Pine stands from the E-SAR backscatter and coherence data. The 204 \ndata were divided in half, with half used as a training data set to train the neural 205 \nnetwork and the other half used as a testing data set, to assess the ability of the 206 \nproposed relationships against unseen data. The inputs to the network were the three 207 \nmean stand values for coherence (L-HH, L-HV, L-VV) plus the three mean stand 208 \nvalues for backscatter (L-HH, L-HV, L-VV). The neural network was a 1-hidden 209 \nlayer network trained with a Levenberg-Marquardt based learning algorithm. Two 210 \nnetwork structures were investigated, with 2 and 11 nodes in the hidden layer, 211 \nrespectively. To ensure that the best network was selected, 50 trained networks were 212 \ngenerated, with the best network selected based on minimum RMSE against the test 213 \ndata set. The lowest error was produced by a network with two nodes in the hidden 214 \nlayer resulting in a R2 of 0.90 and a RMSE of 2.51m when tested against the test data 215 \nset (Rowland et al. 2003). 216 \n3.3.2 Hyperspectral  217 \nHyperspectral data was acquired using the SHAC HyMAP imaging spectrometer in 218 \nJune 2000 (126 contiguous bands, 436-2486 nm at 15 nm spectral resolution, 4m 219 \nspatial resolution). Atmospheric correction was applied by DLR and the overlapping 220 \nscenes were georectified, mosaicked and normalised to minimise the effect of sensor 221 \nlook angle. Signal to noise ratio analysis was conducted to remove noisy atmospheric 222 \nwater absorption bands from the original dataset.  223 \nPage 9 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n10\n3.3.3 LiDAR 224 \nE-SAR and hyperspectral datasets were complemented in June 2000 with first and last 225 \nreturn data acquired by means of a small footprint Airborne Laser Terrain Mapper 226 \n(Optech ALTM 1210). The ALTM emits laser pulses at a wavelength of 1047nm 227 \n(NIR) where vegetation is highly reflective. The data was collected at footprint size of 228 \n0.05m2. A ±10º scanning orientation perpendicular to the flight path was selected 229 \nwhich generated irregular ground measurements ranging between 2.80m2 to 6.50m2.230 \nThe precision of the instrument was estimated at 0.60m in the x and y position and 231 \n0.15 m in z (www.optech.on.ca). 232 \nA digital canopy height model (DCHM) was obtained by subtraction of a digital 233 \nterrain model (DTM) from a digital surface  model (DSM). The DSM and the DTM 234 \nwere derived from the first and last significant LiDAR returns respectively 235 \n(methodology described in Gaveau and Hill 2003, Patenaude et al. 2004 and Rowland 236 \net al. 2003). Both the first and last return were converted from a point to a gridded 237 \nformat. The DTM was then produced by applying a minimum value filter to identify 238 \nlocal height minima in the gridded LiDAR last return product. Top height per stand 239 \nwas extracted from the DCHM based on the maximum canopy height per stand 240 \n(R2=0.94, RMSE 1.68m, bias 0.48m). The use of percentiles was also tested (90th,241 \n95th, 97.5th and 99th). However, whilst they may be appropriate for mean stand height, 242 \nthey were found to underestimate canopy top height for the Thetford stands (Rowland 243 \net al. 2003).  244 \n 245 \n4 Bayesian calibration 246 \nIn Bayesian statistics, probability is interpreted as the degree of certainty for some 247 \nquantity, conditional to available data and knowledge. As model parameter values are 248 \nPage 10 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n11\nnot precisely known, this uncertainty can be represented as a probability distribution 249 \nover the parameters. Thus, if we define U as a parameter vector for 3-PG, then P(U)250 \nrepresents its probability distribution and P(f(U)) the uncertainty in model outputs 251 \n(f(U)) generated by the uncertainty in the parameters. In this context, Bayesian 252 \ncalibration is a method enabling P(U) to be updated as new data come in (e.g. Figure 253 \n1).  254 \nFigure 1  255 \n 256 \nGiven a dataset D, we can derive P(U|D) from P(U) by applying Bayes Theorem: 257 \nP(U|D) = P(U) P(D|U) \/ P(D)        [2] 258 \nIn Bayesian terminology and as illustrated in Figure 1, P(U|D) is the updated or 259 \nposterior parameter distribution; P(U) is the original distribution, referred to as the 260 \nprior; P(D|U) is the conditional probability of the data for a given parameterisation, 261 \ncalled the likelihood; and P(D) is a normalization constant that may be referred to as 262 \nthe evidence. 263 \n 264 \n 4.1 The prior  265 \nThe prior distribution is built from marginal distributions, which reflect our current 266 \nknowledge of parameters and outputs. The distribution that best describes the 267 \navailable information about parameters must be used. When limited information is 268 \navailable, Van Oijen et al. (2005) suggest the use of uniform distributions, bounded 269 \nby a biophysically or biologically reasonable maximum and minimum value for each 270 \nparameter. Table 2 presents values to 3-PG parameters and the prior distribution 271 \nselected for calibration.   272 \nTable 2 273 \nPage 11 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n12\nThe prior distributions were set uniform, bounded by a maximum and minimum value 274 \nfor each parameter. Boundaries to the prior were obtained from direct observation on 275 \nCorsican pine stands in Thetford (CP-T), from literature on Corsican or other pine 276 \nspecies (P-L), from surrogate species or 3-PG set default values (D) or finally as best 277 \nguess estimates or fitting approaches (F) (Table 2).  Key parameters difficult to 278 \nmeasure in the field and for which little information was available were included in 279 \nthe calibration. The remaining parameters were prescribed constant values (Table 2), 280 \nincluding the parameters pertaining to the allometric relationship between stem mass 281 \nand diameter at breast height (aS and nS).  282 \n 283 \n 4.2 The likelihood 284 \nA total of 28 data points were used in the calibration exercise: LiDAR derived heights 285 \n(4); E-SAR and field based estimates of total above-ground biomass (4 and 1 286 \nrespectively); field based estimates of stem, foliage and root biomass (3, 3 and 5 287 \nrespectively); and Hyperspectral and ground based LAI estimates (7 and 1 288 \nrespectively). 289 \n4.2.1 LiDAR heights 290 \nLiDAR heights were taken as surrogates of top heights (section 3.3.3). These were 291 \naggregated and averaged per 15 years age classes (Figure 2). Uncertainty was 292 \nestimated as standard deviations to height averages per class.  An additional ±0.5 m 293 \nerror was added to small samples (n<9).  294 \n4.2.2 E-SAR and field based above-ground biomass 295 \nAbove-ground biomass data were derived from E-SAR top height estimates. 296 \nConversion of top height to above ground biomass involved two stages of calculations 297 \n(Rowland et al. 2003, summarised here): (i) conversion of top height to stemwood 298 \nPage 12 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n13\nvolume using an empirical relationship derived from Edwards & Christie (1981) (ii) 299 \nconversion of stemwood volume to biomass using a biomass expansion factor and a 300 \ngeneric basic density coefficient (1.5 for temperate pine species, Milne 1992, IPCC 301 \n2004; 0.43 t m-3, Hamilton 1975, respectively).  E-SAR biomass estimates were 302 \nplotted against yield table estimates (log transformed, Figure 2). Untransformed 303 \nstandard deviations of biomass (aggregated and averaged per 15 years age classes) 304 \nwere used as error estimates. An additional ±10 t ha-1 uncertainty was added to small 305 \nsamples (n<9).306 \nFigure 2 307 \n4.2.3 Stem, foliage and root biomass 308 \nStem and foliage biomass data points were derived from Baker (1992) and Baker et al. 309 \n(1994). For root biomass, a root to shoot ratio was derived from destructive 310 \nmeasurements made in 6 mature Scot pine stands (Ovington, 1957). The ratio below 311 \nto above-ground across ages (0.3, Std 0.05) was assumed representative to that of 312 \nCorsican pine. This value is also consistent with that given by the IPCC (2003) for 313 \ntemperate coniferous forests. Five root biomass points were derived. A ±10% relative 314 \nerror was assumed.  315 \n4.2.4 LAI 316 \nGiven the absence of ground based or alternative sources, LAI data points were 317 \nderived from hyperspectral data. LAI in pine plantations generally exhibit a growth 318 \npattern expressed as (e.g. Mencuccini and Grace 1996): 319 \n( ) 20ln5.0 \u0006\u0007\n\b\t\n\n\u000b\u0001= b\nxx\naeLAI  [3] 320 \nWhere a represents the maximum LAI reached by a stand, x0 the age at which this 321 \nmaximum is reached and b, a parameter controlling the tailing off of the LAI curve. 322 \nEquation 3 was solved in a three way procedure: (i) Corsican pine stands in the GIS 323 \nPage 13 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n14\ndatabase were co-registered to the image allowing the chronosequencing of leaf area 324 \nindex (LAI) throughout the rotation (ii) based on the results by Lee et al. (2004) and 325 \nPu and Gong (2004) where close proportionality was found between LAI and the 326 \nprimary axis of a principal component analysis (PCA) for the different wavelengths, 327 \nPCA was used to estimate LAI growth patterns in Thetford CP stands. Averaged 328 \nvalues per stand were plotted against stand age using the GIS attribute database. The 329 \nx0 and b parameters, which pertain to the shape of the curve only, not the magnitude 330 \nof LAI were solved by minimising the distance between chronological PCA points 331 \nand the Equation 3 (Figure 3). (iii) Conversion of PCA values to LAI, was completed 332 \nusing the available projected LAI datum (Ovington, 1957). Large relative 333 \nuncertainties (30%) were assumed.  334 \nFigure 3 335 \n4.2.4 Estimating the likelihood 336 \nTo calculate the likelihood, i.e. the probability of the data given a model 337 \nparameterisation P(D|U), information about measurement error must be available. 338 \nAssuming that the errors associated with our data are independent and Gaussian, 339 \nP(D|U) then follows from the comparison of each data point Di with the corresponding 340 \nmodel output fi(U) as: 341 \nP(D|\u0016) = ),0;)(f( i i\nn\ni\ni SDD \u0003\f \u0001\r [4] 342 \nwhere, \f symbolizes a Gaussian function with 0 and SDi as mean and standard 343 \ndeviation of errors, and n=28, the number of points in the data sample. 344 \n 345 \n 4.3 The posterior: a Monte Carlo estimation of the posterior distribution 346 \nThe application of Bayes Theorem to process-based models has traditionally been 347 \nhampered by two problems: (i) the models cannot be solved analytically, so a 348 \nPage 14 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n15\nsampling method to explore the parameter space is required (we define parameter 349 \nspace as the space entailing all combinations of possible parameter vectors defined by 350 \nthe prior) (ii) the models need to be run at every sampled point in parameter space (to 351 \ncalculate the probability), a highly time consuming and computer intensive process. In 352 \nrecent years, Markov Chain Monte Carlo (MCMC) methods have been found useful 353 \nto resolve this type of problem (Van Oijen et al. 2005). Here, we used the MCMC 354 \nMetropolis Hastings Random Walk, which has the two following steps: 355 \n 356 \n1. After randomly choosing a first parameter vector, propose a new candidate for the 357 \nnext parameter vector in the chain from the parameter space as: 358 \n \u0016'=\u0016t + 6 [5] 359 \nWhere \u0016' is the proposed candidate, \u0016t is the current parameter vector and 6 is a 360 \nrandom vector enabling the exploration of the parameter space. 6 is selected from a 361 \nGaussian distribution with mean 0. Its standard deviation should be chosen to enable a 362 \nwide exploration of the parameter space and to yield acceptance rates (of the rule 363 \ndescribed below) between 20 and 50%. We found that a standard deviation of 0.05 364 \ngave good results.  365 \n2. Run the model with the proposed candidate. The rule for accepting or rejecting the 366 \ncandidate has two components, namely: 367 \n(i). Calculate the ratio of probabilities 7, which cancels out the need for estimating 368 \np(D): 369 \n)()|(\n)'()'|(\n)|(\n)|'(\nttt pDp\npDp\nDp\nDp\n\u0003\u0003\n\u0003\u0003\n\u0003\n\u0003\u000e == [6] 370 \n(ii). Generate a uniform random variable u (09u91). The new candidate \u0016' is accepted 371 \nand becomes \u0016t+1 if  u 9 7. If 7 :1, the proposal is always accepted.  372 \nPage 15 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n16\nThe acceptance criterion, based on the selection of a random variable, thus enables the 373 \nacceptance of marginal \u0016i with probability lower than their predecessor in the chain. 374 \nThis procedure contrasts with many optimisation approaches by allowing downhill 375 \nsteps. The ratio of probabilities, 7, also implies that the number of data points used in 376 \nthe calibration has no weight on the selection of a parameter vector (the use of 5 LAI 377 \ndata points instead of 100 has no influence). The weight is given by the data and 378 \nparameters’ uncertainty. 379 \n 380 \nBecause the posterior distribution cannot be described analytically, the results are 381 \npresented in the form of marginal distributions using descriptive statistics. As 382 \nsuggested by Van Oijen et al. (2005), in addition to means and standard deviations, 383 \nwe present the maximum a posteriori (MAP) estimate of U, considered as the single 384 \n“best” parameter value estimated from the MCMC sample.  385 \n)|(maxarg DpMAPx \u0003\u0003 \u0003= [7] 386 \nAlthough this should not be interpreted as an optimised parameter vector, this 387 \nnevertheless provides information as to what vector has the highest probability density 388 \ngiven the available data. 389 \n 390 \n 4.4 Sensitivity analysis 391 \nThe sensitivity of a given model output with respect to a parameter (and vice versa) 392 \nhas also been estimated from partial correlations calculated between the 25 000 393 \nparameter and output vectors. This resulted in a 14x28 partial correlation matrix.  394 \n 395 \n5 Results and discussion 396 \n 397 \nPage 16 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n17\nA 25 000 vectors sample was generated from the posterior distribution using the 398 \nMCMC sampling approach. Figure 4 shows an example of MCMC trace plot and the 399 \nresulting marginal posterior distribution for the fertility rating (FR) parameter.  400 \nFigure 4 401 \nSummary statistics to the marginal distributions of parameters are presented in Table 402 \n3, which include the mean and standard deviation and the vector of highest a403 \nposteriori probability density (\u0016MAP). Figure 5 shows the mean model outputs from the 404 \n25,000 estimates, the 3-PG outputs from \u0016MAP (best fit) and the datasets used in the 405 \nlikelihood. 406 \nTable 3 407 \nFigure 5 408 \n 409 \nPartial correlations between parameters and outputs are presented in Figure 6. These 410 \nare illustrated under the form of a colour fingerprint between the 14 calibrated 411 \nparameters and the 28 model outputs. High negative correlations are shown as dark 412 \nblue and high positive correlations, as dark red. Light regions indicate weak or no 413 \ncorrelation.   414 \nFigure 6 415 \n 416 \n 417 \nIn Table 3, one can observe the close similarity between the \u0016MAP vector and the 418 \nposterior mean )(i\u0003 , suggesting that both vectors converge towards a single solution 419 \n(a local maximum within the full posterior distribution).  Corresponding model 420 \noutputs are shown in Figure 5. Outputs from \u0016MAP  (best fit) and )(i\u0003 (posterior mean) 421 \nalso lie closely to data error bounds. Note the smaller error bounds to the posterior in 422 \ncomparison with the data. While above ground, stem and foliage biomass model 423 \ndynamics closely match those observed on the ground, allocation to roots appears to 424 \nPage 17 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n18\nlevel towards 25 years into the rotation and decrease thereafter.  This appears to be an 425 \nartefact of the model structure, rather than parameterisation. Additional MCMC 426 \nanalysis was conducted (results not shown here) to explore the influence of the model 427 \nstructure on the model outputs. The data used in the calibration were given here 428 \nextremely high standard deviations, such that the distributions tended towards 429 \nuniform. Likewise, large but realistic ranges of parameter values (with uniform 430 \ndistributions) were given.  In doing so, the data became uninformative and the 431 \nobserved dynamics in the model outputs resulted predominantly from the model 432 \nstructure therefore representing “a typical behaviour” and dynamic of the model.  In 433 \naverage, the model will tend to produce certain results, unless specific 434 \nparameterisation is provided.  The results showed that in average, 3-PG simulates 435 \nabove-ground growth in an increasing, near linear fashion; LAI follows an 436 \nexponential increase along the rotation without tail off; and root allocation increases 437 \nearly in the rotation but decreases thereafter (in a similar dynamic as that observed in 438 \nFigure 5). This suggests that comparatively to above ground biomass and LAI, whose 439 \ndynamics are sensitive to parameterisation, root biomass is predominantly determined 440 \nby the model structure. In the Bayesian calibration conducted here, even when data 441 \nwith small uncertainties are used, the underlying influence of the model structure is 442 \nevident. 443 \n 444 \nCareful examination of Figure 6 also provides strong insights into the multivariate 445 \ninteractions imbedded in the model.  For instance, one can observe consistent 446 \ncorrelation throughout the rotation between parameters and specific outputs. The 447 \noptimum temperature for growth, Topt is consistently negatively correlated with all 448 \nmodel outputs considered. As Topt increases, productivity is reduced. Most probable 449 \nPage 18 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n19\nTopt values (\u0016MAP and )(i\u0003 Y 20° C) are reasonable. The species is endemic to elevated 450 \naltitude Mediterranean regions where hot days are four times more frequent than in 451 \nLowland Britain (Brown 1960, Kerr 2000). However, the stands in Thetford seldom 452 \ngrow under optimal temperature where annually, the average temperature is 453 \napproximately 10° C.  Similarly, as the maximum canopy quantum efficiency 454 \nincreases (\u000fCx), a consistent increase in all biomass outputs is observed. An expected 455 \nresult, as the net primary production is proportional to the product of the maximum 456 \ncanopy quantum efficiency (\u000fCx), the Pn \/ Pg ratio (Y), light interception and 457 \nenvironmental constraints. Other consistent correlations are found between specific 458 \nleaf area (\u00101), litterfall rate (\u0012F1), the ratio of foliage to stem partitioning at maturity 459 \n(p20) and LAI;  between the fertility rating (FR) and above ground components 460 \n(biomass and LAI); or root turnover (\u0012R) and root biomass. As for decreasing or 461 \nincreasing correlations with outputs throughout the rotation, these can provide 462 \nindications as to where the influence of a parameter is most significant. With 463 \nBayesian calibration, the inverse is also true: data collected at specific moments 464 \nduring the rotation may be particularly useful in calibrating and reducing the 465 \nuncertainty for a given parameter. For instance, maximum stand age (tx) plays an 466 \nimportant role late in the rotation, as it controls productivity reduction as stand ages.  467 \n 468 \nThe results presented above serve three purposes. Firstly, they present a first attempt 469 \nto parameterise 3-PG for Corsican pine stands. While occupying more than 30 470 \nthousand hectares of the UK territory (Forestry Commission, 2001), relatively limited 471 \ninformation is available on Corsican pines, comparatively to more economically 472 \nviable species such as Sitka spruce and Scots pine.  Thetford forest, one of the largest 473 \nUK plantations, served as a case study. Model outputs from parameterisation with (i) 474 \nPage 19 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n20\n\u0016MAP (parameter vector with highest probability density given available data), and (ii) 475 \nthe mean from the marginal distributions were presented.  Secondly, we illustrated the 476 \nability of Bayesian calibration as a framework to integrate remote sensing datasets, 477 \noften the only source of data available at the spatial and temporal scales required, into 478 \necological modelling. This approach enables uncertainty analysis despite the fact that 479 \nlimited data (and often of poor quality), is available.  With Bayesian calibration, given 480 \nrelatively diffuse priors (e.g. uniform distributions), the posteriors will be at first 481 \nstrongly influenced by the data. This influence however decreases as new data come 482 \nin and as the uncertainty in the prior decreases. Thirdly, despite the fact that the 483 \nprobability density of a scalar model output or parameter is nearly nil, process based 484 \nmodels used in forestry are commonly parameterised by adjusting the value of 485 \nselected parameters for the model output to fit the data time series, without any 486 \nindication of parameter and output uncertainties. The parameterisation of 3-PG for 487 \nnovel species is unfortunately no exception (e.g. White et al. 2000, Sands and 488 \nLandsberg 2002, Sands 2004, Stape et al. 2004 and Almeida et al. 2004). The results 489 \npresented here have shown that given ever increasing computing power and speed, 490 \nuncertainty quantification and model parameterisation can be achieved with relative 491 \nease using Bayesian calibration.   492 \n 493 \n6 Conclusion 494 \nWhile both optimisation and Bayesian approaches address the need to test whether a 495 \nmodel can predict available data or not, in optimisation, parameter values are adjusted 496 \nsuch that the model yields outputs closest to the data. This precludes the integration of 497 \nuncertain datasets, ancillary or remotely sensed, which can provide information on 498 \nvariables not currently or commonly compiled. Additionally, approaches such as the 499 \nPage 20 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n21\nmaximum-likelihood do not enable the full exploration of the parameter landscape. 500 \nThe resulting parameter vector may therefore only be from a local maximum. 501 \nConversely, Bayesian calibration advocates the quantification of uncertainties to 502 \nparameters, thereby yielding uncertainties in model outputs, over the derivation of an 503 \noptimised set of parameter based on a goodness-of-fit approach (e.g. the maximum-504 \nlikelihood approach).  By doing so, Bayesian calibration provides a means to conduct 505 \ntruly integrative work for quantifying model output and parameter uncertainty, while 506 \nconsidering all the existing information, including that enclosed in the model itself. 507 \n 508 \nAcknowledgements 509 \nThe authors would like to thank Maurizio Mencuccini (University of Edinburgh), 510 \nDavid Cameron (CEH Edinburgh), Richard Waring (Oregon State University), and 511 \nPeter Savill (University of Oxford) for sharing data and advices. Thanks are due to the 512 \nBritish Atmospheric Data Centre and the Forestry Commission for providing access to 513 \ndatabases, to the Environment Agency for making available the LiDAR data, and to 514 \nall those involved in the Thetford fieldwork campaigns in 1989 and 2000. The E-SAR 515 \ndata were acquired during the SHAC 2000 campaign by Natural Environmental 516 \nResearch Council and the British National Space Centre.  517 \n 518 \nReferences 519 \n 520 \nAlmeida A.C., Landsberg J.J., Sands P.J. (2004) Parameterisation of 3-PG model for 521 \nfast-growing Eucalyptus grandis plantations. Forest Ecology and Management 522 \n193:179-195 523 \n 524 \nPage 21 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n22\nBaker J.R. (1992) The UK element of the Maestro-1 SAR campaign. International 525 \nJournal of Remote Sensing 13:1593-1608 526 \n 527 \nBattaglia M., Sands P.J. (1998) Process-based forest productivity models and their 528 \napplication in forest management. Forest Ecology and Management 102:13-32 529 \n 530 \nBaulies, X. and Pons, X. (1995). Approach to forestry inventory and mapping by 531 \nmeans of multispectral airborne data. International Journal of Remote Sensing, 532 \n16:61-80. 533 \n 534 \nBeadle C.L., Jarvis P.G., Talbot H., Neilson R.E. (1985a) Stomatal Conductance and 535 \nPhotosynthesis in a Mature Scots Pine Forest .2. Dependence on 536 \nEnvironmental Variables of Single Shoots. Journal of Applied Ecology 537 \n22:573-586 538 \n 539 \nBeadle C.L., Neilson R.E., Talbot H., Jarvis P.G. (1985b) Stomatal Conductance and 540 \nPhotosynthesis in a Mature Scots Pine Forest .1. Diurnal, Seasonal and Spatial 541 \nVariation in Shoots. Journal of Applied Ecology 22:557-571 542 \n 543 \nBeadle C.L., Talbot H., Jarvis P.G. (1982) Canopy Structure and Leaf-Area Index in a 544 \nMature Scots Pine Forest. Forestry 55:105-123 545 \n 546 \nBeadle C.L., Talbot H., Neilson R.E., Jarvis PG (1985c) Stomatal Conductance and 547 \nPhotosynthesis in a Mature Scots Pine Forest .3. Variation in Canopy 548 \nPage 22 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n23\nConductance and Canopy Photosynthesis. Journal of Applied Ecology 22:587-549 \n595 550 \nBrown, J.M.B. (1960). The Corsican pine in its native island, Part 2. Empire Forestry 551 \nReview 39: 422-436. 552 \nCoops N.C., Waring R.H. (2001) The use of multiscale remote sensing imagery to 553 \nderive regional estimates of forest growth capacity using 3-PGS. Remote 554 \nSensing of Environment 75 (3): 324-334 555 \n 556 \nCoops N.C., Waring R.H., Landsberg J.J. (2001) Estimation of potential forest 557 \nproductivity across the Oregon transect using satellite data and monthly 558 \nweather records. International Journal of Remote Sensing 22:3797-3812 559 \n 560 \nCorbett W.M. (1973) Breckland forest soils: special survey no.7, Rothamsted 561 \nExperimental Station, Harpenden, Herts 562 \n 563 \nCousens J.E. (1988) Report of a 12-Year Study of Litter Fall and Productivity in a 564 \nStand of Mature Scots Pine. Forestry 61:255-266 565 \n 566 \nCramer W., Field C.B. (eds) (1999) The Potsdam NPP model intercomparison, Global 567 \nChange Biology Vol 5. Blackwell Science, Oxford. 568 \n 569 \nEdwards P.N., Christie J.M .(1981) Yield models for forest management, Forestry 570 \nCommission booklet ; no. 48 HMSO, London, 274 p. 571 \n 572 \nPage 23 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n24\nEsprey L.J., Sands P.J., Smith C.W. (2004) Understanding 3-PG using a sensitivity 573 \nanalysis. Forest Ecology and Management 193:235-250 574 \n 575 \nEwel K.C., Gholz H.L. (1991) A Simulation-Model of the Role of Belowground 576 \nDynamics in a Florida Pine Plantation. Forest Science 37:397-438 577 \n 578 \nFlower-Ellis J.G.K., Olsson L. (1993) Estimation of volume, total and projected area 579 \nof Scots pine needles from their regression on lenght. Studia Forestalia 580 \nSuecica 190:1-19 581 \n 582 \nForestry Commission (2001) National inventory of woodlands and trees. Report No. 583 \nhttp:\/\/www.forestry.gov.uk\/forestry\/HCOU-54PG9U, Forest Research, 584 \nForestry Commission, Edinburgh 585 \n 586 \nGash J.H.C., Shuttleworth W.J., Lloyd C.R., Andre J.C., Goutorbe J.P., Gelpe J. 587 \n(1989) Micrometeorological Measurements in Les-Landes Forest During 588 \nHapex-Mobilhy. Agricultural and Forest Meteorology 46:131-147 589 \n 590 \nGertner G.Z., Fang S.F., Skovsgaard J.P. (1999) A Bayesian approach for estimating 591 \nthe parameters of a forest process model based on long-term growth data. 592 \nEcological Modelling 119:249-265 593 \n 594 \nGhazoul J., McAllister M. (2003) Communicating complexity and uncertainty in 595 \ndecision making contexts: Bayesian approaches to forest research. 596 \nInternational Forestry Review 5:9-19 597 \nPage 24 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n25\n 598 \nGill R.A., Jackson R.B. (2000) Global patterns of root turnover for terrestrial 599 \necosystems. New Phytologist 147:13-31 600 \n 601 \nGranier A., Biron P., Breda N., Pontailler J.Y., Saugier B. (1996) Transpiration of 602 \ntrees and forest stands: Short and longterm monitoring using sapflow methods. 603 \nGlobal Change Biology 2:265-274 604 \n 605 \nGreen E.J., MacFarlane D.W., Valentine H.T. (2000) Bayesian synthesis for 606 \nquantifying uncertainty in predictions from process models. Tree Physiology 607 \n20:415-419 608 \n 609 \nGreen E.J., MacFarlane D.W., Valentine H.T., Strawderman W.E. (1999) Assessing 610 \nuncertainty in a stand growth model by Bayesian synthesis. Forest Science 611 \n45:528-538 612 \n 613 \nHamilton G.J. (1975) Forest mensuration handbook, Forestry Commission booklet no. 614 \n39 HMSO, London, 274 p. 615 \n 616 \nHyyppä J., Hyyppä H., Inkinen M., Schardt M., Ziegler M. (2000). Forest inventory 617 \nbased on laser scanning and aerial photography. Laser Radar Technology and 618 \nApplications, V:106-118. 619 \n 620 \nHyyppä, J., Kelle, O., Lehikoinen, M., Inkinen, M. A (2001). segmentation-based 621 \nmethod to retrieve stem volume estimates from 3-D tree height models 622 \nPage 25 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n26\nproduced by laser scanners. IEEE Transactions on Geoscience and Remote 623 \nSensing, 39 (5): 969-975. 624 \n 625 \nJansen M.J.W. (1999) Data use and Bayesian statistics for model calibration. In: Stein 626 \nA., Penning de Vries F.W.T. (eds) Data and models in action. Kluwer, 627 \nDordrecht, p 69-80 628 \n 629 \nKelliher F.M., Leuning R., Raupach M.R., Schulze E.D. (1995) Maximum 630 \nConductances for Evaporation from Global Vegetation Types. Agricultural 631 \nand Forest Meteorology 73:1-16 632 \n 633 \nKelliher F.M., Leuning R., Schulze E.D. (1993) Evaporation and Canopy  634 \nCharacteristics of Coniferous Forests and Grasslands. Oecologia 95:153-163 635 \n 636 \nKerr, G. (2000). Natural regeneration of Corsican pine (Pinus nigra subsp laricio) in 637 \nGreat Britain. Forestry 73(5): 479-488. 638 \n 639 \nLandsberg J.J., Waring R.H. (1997) A generalised model of forest productivity using 640 \nsimplified concepts of radiation-use efficiency, carbon balance and 641 \npartitioning. Forest Ecology and Management 95:209-228 642 \n 643 \nLaw B.E., Waring R.H., Anthoni P.M., Aber J.D. (2000) Measurements of gross and 644 \nnet ecosystem productivity and water vapour exchange of a Pinus ponderosa 645 \necosystem, and an evaluation of two generalized models. Global Change 646 \nBiology 6:155-168 647 \nPage 26 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n27\n 648 \nLevy P.E., Hale S.E., Nicoll B.C. (2004) Biomass expansion factors and root : shoot 649 \nratios for coniferous tree species in Great Britain. Forestry 77:421-430 650 \n 651 \nLuckman A., Baker J., Kuplich T.M., Yanasse C.D.F., Frery A.C. (1997) A study of 652 \nthe relationship between radar backscatter and regenerating tropical forest 653 \nbiomass for spaceborne SAR instruments. Remote Sensing of Environment 654 \n60:1-13 655 \n 656 \nMencuccini M., Grace J. (1996) Hydraulic conductance, light interception and needle 657 \nnutrient concentration in Scots pine stands and their relations with net primary 658 \nproductivity. Tree Physiology 16:459-468 659 \n 660 \nNew M., Hulme M. and Jones P. (2000) Representing twentieth-centurey space-time 661 \nclimate variability. Part II: Development of 1901-96 monthly grids of 662 \nterrestrial surface climate. Journal of Climate 13(13):2217-2238 663 \nhttp:\/\/www.cru.uea.ac.uk\/~markn\/cru05\/cru05_intro.html664 \n 665 \nOvington J.D. (1957) Dry-matter production by Pinus sylvestris L. Annals of Botany 666 \nXXI:288-314 667 \n 668 \nRoberts J.M. (1976) A study of root distribution and growth in a Pinus sylvestris L. 669 \n(scots pine) plantation in East Anglia. Plant and Soil 44:607-621 670 \n 671 \nPage 27 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n28\nRunning S.W., Coughlan J.C. (1988) A general model of forest ecosystem processes 672 \nfor regional applications I. Hydrological balance canopy gas exchange and 673 \nprimary production processes. Ecological Modelling 42:125-154 674 \n 675 \nRowland C.S,  Patenaude G., Balzter H., Dawson T.P., Hill R.A., Luckman A., Milne 676 \nR., Skinner L. (2003)  Forest carbon estimation: a comparison of techniques, 677 \nannual meeting of the Remote Sensing and Photogrammetry Society. 678 \n 679 \nSands P.J. (2004) Adaptation of 3-PG to novel species : guidelines for data collection 680 \nand parameter assignment. Technical Report. No. 141, CSIRO, CRC 681 \nSustainable Production Forestry, Hobart 682 \n 683 \nSands P.J., Landsberg J.J. (2002) Parameterisation of 3-PG for plantation grown 684 \nEucalyptus globulus. Forest Ecology and Management 163:273-292 685 \n 686 \nSkinner L., Luckman A. (2000) Thetford forest ground data collection campaign in 687 \nsupport of the SHAC SAR aquisition, June 2000, University of Wales 688 \nSwansea, Swansea, Unpublished report 34p. 689 \n 690 \nStape J.L., Ryan M.G., Binkley D. (2004) Testing the utility of the 3-PG model for 691 \ngrowth of Eucalyptus grandis X urophylla with natural and manipulated 692 \nsupplies of water and nutrients. Forest Ecology and Management 193:219-234 693 \n 694 \nPage 28 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n29\nStenberg P., Kuuluvainen T., Kellomaki S., Grace J.C., Jokela E.C., Gholz H.L. 695 \n(1994) Crown structure, light interception and productivity of pine trees and 696 \nstands. Ecological Bulletins 43:20-34 697 \n 698 \nStewart J.B. (1988) Modeling Surface Conductance of Pine Forest. Agricultural and 699 \nForest Meteorology 43:19-35 700 \n 701 \nVanclay J.K. (1989) A growth model for North Queensland rainforests. Forest 702 \nEcology and Management 27:245-271 703 \n 704 \nvan Hees A.F.M., Bartelink H.H. (1993) Needle Area Relationships of Scots Pine in 705 \nthe Netherlands. Forest Ecology and Management 58:19-31 706 \n 707 \nVan Oijen M., Rougier J., Smith R. (2005) Bayesian calibration of process-based 708 \nmodels: bridging the gap between models and data. Tree Physiology 25 (7): 709 \n915-927 710 \n 711 \nWang K.Y., Kellomaki S., Zha T.S., Peltola H. (2004) Component carbon fluxes and 712 \ntheir contribution to ecosystem carbon exchange in a pine forest: an 713 \nassessment based on eddy covariance measurements and an integrated model. .714 \n24:19-34 715 \n 716 \nWang Y.P., Jarvis P.G. (1990) Description and Validation of an Array Model - 717 \nMaestro. Agricultural and Forest Meteorology 51:257-280 718 \n 719 \nPage 29 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n30\nWaring R.H. (2000) A process model analysis of environmental limitations on the 720 \ngrowth of Sitka spruce plantations in Great Britain. Forestry 73:65-79 721 \n 722 \nWaring R.H., Running S.W. (1998) Forest ecosystems : analysis at multiple scales,723 \n2nd Ed. Academic Press, London 270 p. 724 \n 725 \nWhite J.D., Coops N.C., Scott N.A. (2000) Estimates of New Zeland forest and scrub 726 \nbiomass from the 3-PG model. Ecological Modelling 131:175-190 727 \n 728 \nPage 30 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\nFigure 1  \n \nPrior\nLikelihood\nPosterior\n \nPage 31 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\nFigure 2 \n \nPage 32 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\nFigure 3\n4\n4.5\n5\n5.5\n6\n6.5\n0 10 20 30 40 50 60\nStand age (years)\nLA\nI\nLAI from PCA\nBest fit model\nMeasured LAI\nPage 33 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\nFigure 4 \nPage 34 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\nFigure 5 \nPage 35 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\nFigure 6:  \n \nHeight ABGmass Stmmass Folmass LAI Rootmass\nChronosequence\nPa\nra\nm\net\ner\ns\nModel outputs\nPa\nra\nm\net\ner\ns\n \nGREY VERSION (if colour printer unavailable) \nPage 36 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\nTable 1:\nMonthly\nClimate\ndata\nMean\nTmaxa.\n(°C)\nMean\nTmin a.\n(°C)\nRain b.\n(mm)\nSolar\nrad b.\n(MJ m-2d-1)\nFrost\ndays a.\n(days)\nJanuary 6.47 1.08 55.0 2.52 10.7\nFeb 7.29 0.97 42.4 4.53 11.2\nMarch 10.18 2.13 51.9 8.26 7.9\nApril 13.13 3.95 48.0 13.10 3.3\nmay 16.86 6.70 55.0 16.58 0.8\nJune 20.08 9.73 55.0 18.43 0.0\nJuly 22.31 11.83 54.0 16.64 0.0\nAug 22.15 11.58 58.0 14.42 0.0\nSep 19.17 9.64 61.1 10.00 0.0\nOct 14.99 6.66 61.1 5.80 1.5\nNov 10.07 3.51 69.0 2.86 5.7\nDec 12.61 2.04 61.1 1.96 9.1\nTable 2\nPage 37 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\n3-PG symbol: Description (units) S\nClassa\nPrescribed\nParameter\nValues\nCalibrated\nParameters:\nranges of values\nin the prior\nData\nClassb\nSource\/Comment\n. \u0001min \u0001max\naS: Constant in stem mass v diam. relationship M 0.02 - - CP-T Baker 1992, Baker et al. 1994, Edwards and\nChristie 1981.\nc\u0001: Moisture ratio deficit which gives f\u0001 = 0.5 H 0.7 - - D Default for sandy soils\nfN0: Value of fN when FR = 0 M 0.6 - - D\nFR: Fertility rating ? - 0.2 0.6 CP-T Soil Fertility (Corbett 1973, Roberts et al. 1982)\ngB: Canopy boundary layer conductance (m s-1) L 0.2 - - D\ngCx: Maximum canopy conductance (m s-1) H - 0.015 0.03 P-L Kelliher et al. 1995\niRx: Maximum fraction of rainfall intercepted by canopy M 0.15 - - D\nk: Extinction coefficient for PAR absorption by canopy M - 0.4 0.7 P-L Stenberg et al. 1994, Mencuccini and Grace 1996\nkF: Number of days production lost for each frost day L 1 - - D\nLCx: Canopy LAI for maximum canopy conductance\n(m2 m-2)\nL 3.33 - - P-L Kelliher et al. 1995, Mencuccini and Grace, 1996\nLix: LAI for maximum rainfall interception (m2 m-2) L 0 - - D\nm0: Value of m when FR = 0 ? 0 - - D\nmF: Fraction of mean foliage biomass per dying tree L 0 - - D\nmR: Fraction of mean root biomass per dying tree L 0.2 - - P-L Empirical data (Edwards and Christie\n1981,Ovington 1957)\nmS: Fractions of mean stem biomass per dying tree L 0.2 - - CP-L Empirical data (Edwards and Christie 1981)\nnage: Power of relative age in fage L 4 - - D\nnN : Power in self thinning law L 1.5 - - P-L Theoretical scaling laws & observation\nnfN: Power of (1-FR) in fN L 1 - - D\nnS: Power in stem mass v diam. Relationship H 2.88 - - CP-T Baker 1992, Baker et al. (1994), Edwards and\nChristie 1981\nPage 38 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\nn\u0001: Power of moisture ratio deficit in f\u0001 L 9 - - D Default for sandy soils\np2: Ratio of foliage:stem partitioning at B = 2 (cm) H - 0.5 1 P-L Gower et al. 1994\np20: Ratio of foliage:stem partitioning at B = 20 (cm) H - 0.1 0.5 P-L Gower et al. 1994\np\u0003\u00030: Branch and bark fraction at stand age 0 L 0.5 - - P-L Default 3-PG values for P.radiata\np\u0003\u00031: Branch and bark fraction for mature aged stands L 0.1 - - P-L Default 3-PG values for P.radiata\nrage: Relative age to give fage = 0.5 L 0.95 - - D\nt\u0003\u0003 : Age at which pBB = ½(p\u0003\u00030+ p\u0003\u00031) L 5 - - P-L Default 3-PG values for P.radiata\ntc: Age at full canopy cover (yr) M 0 - - P-L\nTmax: Maximum temperature for growth (ºC) L 35 - - P-L\nTmin: Minimum temperature for growth (ºC) L 0 - - D\nTopt: Optimum temperature for growth (ºC) M - 18 22 P-L Waring and Running, 1998\ntx: Maximum stand age used to compute relative age\n(year)\nL - 60 100 D 10% of age at maximum height (Waring, pers.Comm.)\nt\u0007F: Age at which litterfall rate has median value\n(month)\nL 36 - - D\nt\b : Age at which specific leaf area = ½(\b0+\b1) (yr) L 2.5 - - D\nWSx1000: Maximum stem mass per tree at 1000 trees\/ha - 160 400 CP-L live stem numbers time-series: Edwards andChristie (1981)\nY: Ratio NPP\/GPP H 0.47 - - P-L Waring & Running (1998)\n\tCx: Maximum canopy quantum efficiency (mol mol-1) H - 0.045 0.065 P-L Range for temperate species in 3-PG (e.g.\nStenberg et al. 1994, Law et al. 2000, Waring\n2000, Waring et al. 2002, Wang et al. 2004)\n\u0007F0: Litterfall rate at t = 0 (month-1) L 0.001 - - D\n\u0007F1: Litterfall rate for mature stands (month-1) H - 0.025 0.035 P-T Beadle et al. 1982, Cousens (1988)\n\u0007R: Average monthly root turnover rate (month-1) L - 0.006 0.015 P-L Gill & Jackson (2000)\n\nRn: Minimum fraction of NPP to roots M - 0.20 0.50 P-T Ovington (1957), Levy et al. (2004)\n\nRx: Maximum fraction of NPP to roots M - 0.50 0.80 P-T Ovington 1957, Levy et al. (2004)\n\b0 : Specific leaf area at stand age 0 (m2 kg-1) L 5 P-L VanHees & Bartelink (1993)\n\b1: Specific leaf area for mature aged stands (m2 kg-1) H - 4 8 P-L VanHees & Bartelink (1993)\n\u000b1: Basic density H 0.43 - - CP-L Hamilton (1975)\nPage 39 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\nTable 3: \n \n)(i\u0001 )(i\u0001 SD MAPx\u0001\nFR 0.380 0.090 0.391\ngCx 0.023 0.004 0.023 \nK 0.539 0.087 0.439 \np2 0.694  0.133 0.502 \np20 0.441  0.045 0.497 \nTopt 20.893 0.911 20.42 \ntx 90.656 6.978 95.86 \nwSx1000 182.826 17.504 165.0 \n\tCx 0.047 0.002 0.046 \n\u0007F1 0.028 0.003 0.026 \n\u0007R 0.013 0.002 0.013 \n\nRn 0.237 0.028 0.221 \n\nRx 0.580  0.067 0.557 \n\b1 5.711 1.029 4.539 \nPage 40 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\nFor Peer Review Only\nPage 41 of 41\nhttp:\/\/mc.manuscriptcentral.com\/tres   Email: IJRS-Administrator@Dundee.ac.uk\nInternational Journal of Remote Sensing\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n"}