{"doi":"10.1111\/1467-9493.00163","coreId":"66550","oai":"oai:dro.dur.ac.uk.OAI2:1218","identifiers":["oai:dro.dur.ac.uk.OAI2:1218","10.1111\/1467-9493.00163"],"title":"Material geographies and postcolonialism.","authors":["McEwan,  C."],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2003-11","abstract":"While postcolonial studies have inspired new ideas, a new language and a new theoretical inflection for a wide range of teaching and research in human geography, there have been few sustained discussions about what might constitute a postcolonial geography. This paper attempts to deal with this absence by exploring the possibilities of material geographies of postcolonialism. It suggests that geographers are particularly well placed to respond to criticisms of postcolonialism as remaining overwhelmingly textual, cultural and\/or historical in focus by contributing towards a productive engagement between postcolonialism and the material realities of global inequalities, and towards a revivified political and ethical project. It explores how particular tactics might inform postcolonial methodologies within geography and makes some tentative suggestions on what a postcolonial political praxis might look like","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66550.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1218\/1\/1218.pdf","pdfHashValue":"8837b39e387e7087d1bf9a619f93ae29d098cab6","publisher":"Blackwell","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1218<\/identifier><datestamp>\n      2011-08-03T11:05:23Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Material geographies and postcolonialism.<\/dc:title><dc:creator>\n        McEwan,  C.<\/dc:creator><dc:description>\n        While postcolonial studies have inspired new ideas, a new language and a new theoretical inflection for a wide range of teaching and research in human geography, there have been few sustained discussions about what might constitute a postcolonial geography. This paper attempts to deal with this absence by exploring the possibilities of material geographies of postcolonialism. It suggests that geographers are particularly well placed to respond to criticisms of postcolonialism as remaining overwhelmingly textual, cultural and\/or historical in focus by contributing towards a productive engagement between postcolonialism and the material realities of global inequalities, and towards a revivified political and ethical project. It explores how particular tactics might inform postcolonial methodologies within geography and makes some tentative suggestions on what a postcolonial political praxis might look like.<\/dc:description><dc:subject>\n        Discourse<\/dc:subject><dc:subject>\n         Materiality<\/dc:subject><dc:subject>\n         Global economy<\/dc:subject><dc:subject>\n         Politics<\/dc:subject><dc:subject>\n         Ethics.<\/dc:subject><dc:publisher>\n        Blackwell<\/dc:publisher><dc:source>\n        Singapore journal of tropical geography, 2003, Vol.24(3), pp.340-355 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-11<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1218<\/dc:identifier><dc:identifier>\n        issn:0129-7619<\/dc:identifier><dc:identifier>\n        issn: 1467-9493<\/dc:identifier><dc:identifier>\n        doi:10.1111\/1467-9493.00163<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1218\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1111\/1467-9493.00163<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1218\/1\/1218.pdf<\/dc:identifier><dc:rights>\n        The definitive version is available at www.blackwell-synergy.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0129-7619","0129-7619","issn: 1467-9493"," 1467-9493"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":["Discourse","Materiality","Global economy","Politics","Ethics."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n02 April 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nMcEwan, C. (2003) ’Material geographies and postcolonialism.’, Singapore journal of tropical geography., 24\n(3). pp. 340-355.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1111\/1467-9493.00163\nPublisher’s copyright statement:\nThe definitive version is available at www.blackwell-synergy.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n 01 April 2008 \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n \nMcEwan, C. (2003) 'Material geographies and postcolonialism.' , Singapore journal of \ntropical geography., 24 (3), pp. 340-355. \n \nThe attached paper is the final author-created version of the above publication, and \nincorporates referee comments.  \n \nThe definitive version is available at: \n \nhttp:\/\/dx.doi.org\/10.1111\/1467-9493.00163 \n 1\n \nMATERIAL GEOGRAPHIES AND POSTCOLONIALISM \n \n \n \nCheryl McEwan \nSchool of Geography and Environmental Science \nUniversity of Birmingham \nEdgbaston \nBirmingham B15 2TT \nFax: 0121 4145528  \nEmail: c.mcewan@bham.ac.uk \n \n \n \n \n \n \n \n \n 2\nABSTRACT \nWhile postcolonial studies have inspired new ideas, a new language, and a new theoretical \ninflection for a wide range of teaching and research in human geography, there have been few \nsustained discussions about what might constitute a postcolonial geography. This paper \nattempts to deal with this absence by exploring the possibilities of material geographies of \npostcolonialism. It suggests that geographers are particularly well placed to respond to \ncriticisms of postcolonialism as remaining overwhelmingly textual, cultural and\/or historical \nin focus by contributing towards a productive engagement between postcolonialism and the \nmaterial realities of global inequalities and towards a revivified political and ethical project. It \nexplores how particular tactics might inform postcolonial methodologies within geography \nand makes some tentative suggestions on what a postcolonial political praxis might look like.  \n \nKEY WORDS \nPostcolonialism, discourse, materiality, global economy, politics, ethics \n \n \n \n 3\nMATERIAL GEOGRAPHIES AND POSTCOLONIALISM \n \nINTRODUCTION \nPostcolonial studies are intrinsically geographical and an increasing range of geographical \nteaching and research is located within a broadly postcolonial framework. Intersections \nbetween geography and postcolonialism provide challenging opportunities to explore the \nspatiality of colonial and neo-colonial discourse and the spatial politics of representation. \nGeography is one of the dominant discourses of imperial Europe that postcolonialism seeks to \ndestabilise, to problematise the ways in which the world is known and to challenge the \nunacknowledged and unexamined assumptions at its heart that may be profoundly insensitive \nto the meanings, values and practices of other cultures (Spivak, 1990). Postcolonial \napproaches invoke an explicit critique of the spatial metaphors and temporality often \nemployed in geography, insisting that the ‘other’ world is ‘in here’, rather than ‘out there’ and \n‘back there’ (Chambers 1996: 209), and integral to what in the west is referred to as \n‘modernity’ and ‘progress’. Postcolonial theory reveals the situatedness of knowledge, and \nparticularly the universalising knowledge produced in imperial Europe (Said, 1993, 1999), \nwhilst simultaneously being conditioned by its places of formation (Clayton, 2000; Lester, \nforthcoming).  \nPostcolonialism, then, is a geographically dispersed contestation of colonial and neo-\nimperial power and knowledge and geography should lie at the heart of postcolonial critiques \n(McClintock, 1995; Jacobs, 1996; Loomba, 1998). Perhaps not surprisingly, some of the most \npowerful critiques of Anglo\/Eurocentric geographies are being produced in Asia, stimulated \nby the growing intellectual traffic based around new centres and journals devoted to this \npurpose.i It is only in recent years, however, that geographers have begun to develop a critical \nengagement with the theoretical and substantive challenges of postcolonialism.  \n 4\n Despite a recent burgeoning of geographical research positioned within postcolonial \nframeworks there have been relatively few sustained discussions about what might constitute \na postcolonial geography (Blunt and McEwan, 2002; Blunt and Wills, 2000; Clayton, \nforthcoming; Nash, 2002). At the same time, there have been a number of recent criticisms of \npostcolonialism, including its alleged failure to connect critiques of discourse and \nrepresentation to the lived experiences of postcoloniality and its apparent inability to define a \nspecific political and ethical project to deal with material problems that demand urgent and \nclear solutions. I wish to argue here that geographers are particularly well placed to respond \nto these criticisms by contributing towards a productive engagement between postcolonialism \nand the material realities of global inequalities and towards a revivified political and ethical \nproject. \nIn attempting to initiate thinking around these issues, the paper outlines briefly the \nmajor criticisms of postcolonialism – namely, that it is too focused on historical, theoretical \nand cultural concerns that preclude political and ethical responsibilities. I suggest that while \nthese criticisms are perhaps overstated, geographies are well placed to respond to specific \ncalls for a ‘rematerialised’ postcolonialism and to explore critically the lived experiences of \npostcoloniality. I also explore how particular tactics might inform postcolonial methodologies, \nwith the potential to connect the discursive\/textual strategies and insights of postcolonialism \nto macro-issues (globalisation, transnationalism and poverty) that have allegedly been absent \nin postcolonial theory. Finally, I reflect on what postcolonial geographies might contribute to \nthe ethical and political considerations raised by criticisms of postcolonialism more broadly \nand offer some tentative suggestions on what a postcolonial political praxis might look like.  \n \n 5\nTHE POVERTY OF POSTCOLONIALISM? \nCriticisms of postcolonial theory are now well rehearsed but they are useful in speculating \nabout what geographies can bring to postcolonial analysis and what future directions \npostcolonial geographies might productively take. Cultural and textual approaches, including \npostcolonialism, have been accused of a tendency to overplay the cultural as a separate \ncategory of analysis (Marcus, 2000). Philo’s (2000) reflection on the ‘cultural turn’ elaborates \non how lived experience has effectively been neglected in favour of an over-zealous focus on \nidentity politics, discourse, texts, signs, symbols and imaginings. Philo’s concerns resonate \nwith a growing unease within geography with what might be considered the proliferation of \n‘desocialised’, ‘dematerialised’ and ‘depoliticised’ geographies through an over-privileging of \nthe cultural (Barnett 1998a, Castree 1999, Gregson 1993, Sayer 2001, Storper 2001). \nSimilarly, postcolonial geographies are being criticised for focusing on historical, cultural, \ntheoretical and discursive concerns at the expense of the materialities and everyday \nexperiences of postcoloniality. \n \nPrivileging the past and the cultural? \nIntersections between postcolonialism and geography have largely been historical in focus. \nThis is understandable given that the interconnections between geography and empire shape \nthe ways in which questions of postcolonialism have been interrogated within geography, but \nthe critical return to the past has a tendency to re-focus attention primarily in western contexts \nand on areas formerly colonised by European powers. Much of this work has been extremely \nimportant, particularly in elucidating the relationship between power and knowledge and in \nrevealing the historical agency of people oppressed by imperialism and neo-imperialism. \nHowever, this focus adds weight to the criticism that, like postcolonialism, postcolonial \n 6\ngeographies tend to be preoccupied with history and have failed to say much about \npostcolonial futures.  \nThis criticism can be countered to some extent by recent work that uses the colonial \npast to cast the present in a new light, connecting radical revisionist histories with \ncontemporary political claims for reparation and recognition (see, for example, Clayton, 2000; \nHarris, 2002; Jacobs, 1996). As Gandhi (1998) argues, postcolonialism ‘necessarily returns’ to \nthe past in an ameliorative and therapeutic attempt to deal with the ‘gaps and fissures’ in the \npostcolonial condition (see also Chatterjee, 1997). I am not arguing here that postcolonial \ngeographies should sideline the past – far from it given that relations between the past and \npresent have not been fully disclosed. Rather, the impetus of postcolonial geographies ought \nto be in shedding critical light on how the past informs and shapes the present and in a broader \nrange of contexts that do not necessarily begin and end western metropolitan space. \nApart from geographical work investigating postcolonial approaches to globalization \nand development (Corbridge, 1993; Crush, 1995; see McEwan, 2002, for an overview), \nintersections between postcolonialism and geography have also tended to revolve around \ncultural concerns. Although spatial images such as location, mobility, borderlands and exile \nabound, more material geographies of both past and present have often been overlooked. \nPostcolonial geographies are thus exposed to the same criticisms that have been levelled at \npostcolonial approaches more broadly. Realists accuse postcolonialism of ignoring issues of \nthe human rights and freedoms of marginalised people. Concerns with representation, text and \nimagery are perceived as too far removed from the exigencies of the lived experiences of \nmillions of impoverished people (Jackson, 1997). In dismissing the universalist assumptions \nof political economy, postcolonial approaches have also been accused of ignoring the material \nways in which colonial power relations persist (Ahmad, 1992; Dirlik, 1994). As Jacobs (1996: \n158) notes, the theoretical abstractions of postcolonial theory do not always adequately \n 7\nconnect to the specific, concrete and local conditions of everyday life and are not easily \ntranslated into direct politics. This apparent neglect of material concerns and political \nstrategies has generated the fiercest criticism of postcolonialism, accusing it of ignoring \nurgent life-or-death questions (San Juan, 1998) and of solidifying the fundamental schism \nbetween western theorising and the practical needs of impoverished people globally.ii  \nThe argument that postcolonialism is too rooted in discourse might have some \ncredence but, of course, it also ignores the fact that discourse itself is intensely material. \nIndeed, geographers have demonstrated this with examples ranging from the ordering of \nimperial and postcolonial urban spaces, to the materialities of travel and emigration, to \nconcerns with embodiment, identities, cultural politics and reconciliation (see Blunt and \nMcEwan, 2002). Similarly, intersections between postcolonialism and feminism have had \nsome influence in geography and have demonstrated the ways in which discourse informs \nlived experience in ways that are relevant to women everywhere, whether they are striving for \neconomic empowerment whilst having simultaneously to renounce ‘normality’ or facing the \nconundrum of attaining citizenship whilst becoming alienated subjects (Quayson, 2000). This \nis also compounded for those women most marginalised by global inequalities. For example, \nSpivak (1985, 1999) draws out the connections between the silencing of ‘Other’ women, who \nare often spoken for, about and against, and their marginalised position within global \neconomies. Postcolonial feminisms have made important contributions in exploring the links \nbetween the discursive and the material in creating possibilities for effecting change (Rose, \n1987; Rajan, 1993). Clearly, it is not sufficient to confine analysis to texts alone but there are \nconnections between the relations of power that order the world and the words and images \nthat represent the world. The challenge for postcolonial geographies is to respond to the \npotential of ‘mixing up conceptual elaboration with substantive detail’ (Philo, 2000: 27) and \nof dealing simultaneously with the material and immaterial, the cultural and the political. \n 8\n \nGlobal capitalism and class? \nPostcolonial theory necessarily positions itself in critical opposition to global inequalities. \nIt is perhaps ironic, therefore, that its most persistent criticism is that it has failed to consider \nthe relationships and tensions between postcolonialism and global capitalism (Dirlik, 1994; \nEagleton, 1994; Hall, 1996). According to Parry (2002: 78): \nThe sanctioned occlusions in postcolonial criticism are a debilitating loss to thinking \nabout colonialism and late imperialism. This dismissal of politics and economics \nwhich these omissions reflect is a scandal.  \nWith respect to the more cultural issues of the politics of recognition postcolonial approaches \nmight appear radical and progressive, but from the perspective of political economy and the \npolitics of distribution they look less progressive, ‘for they offer no means for challenging the \neconomic system’ (Sayer, 2001: 688).  \nThe relative neglect of class in favour of identity politics in postcolonial analyses has \nalso been criticised as a potentially serious omission, both in terms of the conflicting class \ninterests within post-independence political formations and the international alliances forged \nby the new indigenous ruling classes. Yet without Marxism, some of the best ideas that \npostcolonialism has produced, from Fanon to Spivak, would be much poorer. As Parry (2002) \nargues, what Marxist critics such as Ahmad, Dirlik and San Juan actually achieve is a much \nmore rigorous engagement of postcolonialism with the legacy of Marxism. Indeed, \npostcolonial theorists such as Said and Chakrabarty have consistently argued for a \npostcolonial criticism that is worldly and attuned to both discursive and material concerns. \nThe two should not necessarily be seen as antagonistic as some critics of postcolonialism \nwould suggest.  \n 9\nDespite this, with some exceptions (for example, the writings on post-development by \nEsteva (1987) and Escobar (1992, 1995)), postcolonialism has not easily been translated into \naction on the ground and its oppositional stance has not had much impact on global power \nimbalances or inequities. However, as Rattansi (1997: 497)) argues,  \n[I]t is simply untrue to say that global capitalism has been ignored in postcolonial \nresearch, although… what postcolonial studies has been about is finding non-\nreductionist ways of relating global capitalism to the cultural politics of colonialism.  \nMuch postcolonial research has been engaged with exploring the constitutive relation between \nimperialism, colonialism and global capitalism (see, for example, Chatterjee, 1986; Miyoshi, \n1997; Said, 1993; Spivak 1987). While class relations are not often explicit, in many studies \nthey are implied. Much of Spivak’s work, for example, has been concerned with exploring \nconnections between the micro-spaces of academe and the macro-spaces of the global \neconomy\/international division of labour, and between the discursive construction of gender \nand the doubly subaltern position of women in the former colonies.  \nAs the absence of class relations is perhaps exaggerated, the failure of discursive \napproaches to engage with critiques of capitalism is also to some extent overplayed. As \nAshcroft (2001) argues, despite the centrality of representation, the significance of \npostcolonial analysis is its insistence on the importance of the material realities or lived \nexperiences of postcolonial life that are directly related to economic issues. He uses the \nexample of the consequences of the rise to prominence of tropical sugar for Caribbean \nsocieties and cultures as a resonant demonstration of the link between the material and the \ndiscursive in the process of postcolonial transformation, and how political economy and \ncultural approaches might work in tandem to critique the dominant order (Perrons, 1999). \nSimilarly, Young (2001: 428) makes a powerful case that while postcolonial critique \nchallenges established, eurocentric knowledge in the cultural sphere, it also continues to work \n 10\nin the spirit of anti-colonial movements by further developing its radical political edge to \nreinforce global social justice; its ‘politics of power-knowledge asserts the will to change’ \ninjustice, inequality, landlessness, exploitation, poverty, disease and famine that remain the \ndaily experience of much of the world’s population. As Yeoh (2001: 462-3; see also Hall, \n1996; Slater, 1998) suggests, the task of interrogating the relationship between \npostcolonialism and global capitalism is a crucial one that ‘requires a more critical and \nsimultaneous engagement with both registers’. \n \nCelebrating postcoloniality and transnationalism? \nCulturalist approaches have been accused of precipitating premature and inappropriate \ncelebrations of postcoloniality. Parry (2002: 74) argues that a dismissal of political economy \nmeans that the imperial project is detached from its beginnings and inseparability from \ntrajectories of capitalism. Thus ‘globalisation is divorced from capitalism, married to \npostcolonialism, and despite egregious inequality between and within centre and periphery, \nthe promotion of transnational cultural flows is applauded’. As Loomba and Kaul (1994: 4, \n13-14) argue, ‘diaspora’ has swelled ‘to demarcate the entire experience of postcoloniality’ \nand ‘the subject-position of the ‘hybrid’ is routinely expanded as the only political-conceptual \nspace for revisionist enunciation’.  \nThe privileging of migrancy, in particular, in postcolonial discourses can be \nconsidered deeply problematic. As Sharma (1996: 29) argues: \nThe logic of contemporary global racialized capitalism is to (re)produce new forms of \nexploitative social relations, at the local, national and transnational level. The recent \nturn, in the avant-garde sectors of the Western academy, to the study of marginal \nculture, has failed to engage adequately with the oppressive dynamics of this mode of \nreorganised capitalism… Devoid of any progressive political agendas, the project of \n 11\ncelebrating hybrid ‘ethnic’ cultures obscures the epistemic violence of Western \nintellectual knowledge…, reduces ‘Other’ cultures to essentialist and ‘traditional’ \nfixities – as ‘victims’ of progress, as objects of tourism, as the labour of migration and \nthe colours of multiculturalism – and then valorizes hybridity as their encounter with \nthe emancipated West. \nThis encounter of ‘Other’ cultures with the west becomes the framework through which ‘non-\nwestern’ cultures are interpreted. Hybrid ethnic cultures are celebrated, but this further \nmarginalises ‘traditional cultures’, the colonial encounter remains privileged and the global \ndomain of cultural capital remains unchallenged. As Parry (2002: 72) argues: \nPerhaps the time has come for postcolonial studies to promote empirical investigations \nof these unsettled diasporas, and undertake the dissemination of the experiences \nspoken by scattered, impoverished, and despised populations stranded in temporary \nand exploited employment as contract workers, casual labourers, or domestic servants \nin Europe, North America and the Gulf States. \nStudies of transnationalism that explore the success of overseas business communities, the \nvibrancy of ‘ethnic’ industries, and the success of some migrant groups in securing space for \nthemselves within popular cultures need to be balanced with an understanding of the harsh \nrealities facing immigrants all over the world (Lipsitz, 1997) and the fact that many multi-\nethnic economies around the world are still characterised by low wages, poor working \nconditions and racism. In what follows, I explore how geographers are already beginning to \nrespond to criticisms of postcolonialism to undertake precisely this kind of work. I also \npropose a number of tactics that might enable a more critical engagement between material \ngeographies and postcolonialism. \n \n‘REMATERIALISED’ AND ‘REPOLITICISED’ POSTCOLONIALISMS \n 12\nGeography and geographers have a central role to play in what Chakrabarty (1992, 2000) has \nreferred to as provincialising Europe, relocating western narratives of progress in their wider \ncolonial histories and rethinking the ‘centre’ by exploring the complex webs of \ninterconnections between ‘metropole’ and ‘periphery’ (Hall, 1996). However, I want to \nsuggest that postcolonialism can also play a part in the necessary but difficult project of \ndisrupting entrenched Cold War narratives that pervade area studies, in particular. As recent \ncritiques demonstrate (Miyoshi and Harootunian, 2002), area studies have failed to come to \nterms with the epistemological challenges posed by postcolonialism. Contributions from \ncorporations and foreign governments, especially in East Asia, put pressure on scholars to rein \nin critical approaches lest they lose funding. The possibilities of postcolonial approaches, \ntherefore, are not only to provincialise Europe but to disrupt Cold War narratives and \nEurocentric understandings of the world that have a global presence. Focusing on Japan, \nMiyoshi and Harootunian (ibid.) explore how a dramatically reconfigured area studies can \nhelp further an understanding of a rapidly changing world characterized by fluid interchange \nbetween cultures. Geographers are also beginning to engage with this project. \n Postcolonial geographies are responding to the need to connect discursive and material \nrealities and to intersect with critiques of global inequality, which has implications for a \nrevivified political and ethical project. Some of the most exciting current work in economic \ngeography, for example, is exploring attempts by workers disempowered by the conditions of \npostcoloniality - emigrant status, lack of citizenship rights, seasonality and informality of \nemployment and fragmentation in terms of language and nationality - to empower themselves \nthrough organisation. These forms of subaltern resistance to the marginalising effects of \nglobal capitalism lend themselves to postcolonial analysis.iii Some feminist geographers, \nworking within broadly postcolonial theoretical frameworks, are producing work on translocal \nand transnational geographies and the experiences of diasporic groups of women (Pratt, 1999; \n 13\nYeoh and Willis, 1999; Blunt, forthcoming), contributing to the exploration of the ‘messiness \nof… race politics’ (Jackson and Jacobs, 1996, 3) and their material geographies. Drawing on \nthese developments, I now wish to consider the possibilities of postcolonial practice, politics \nand ethics. \n \nPostcolonial practice: hearing, speaking and writing tactics \nAs Nash (2002: 222) suggests in her discussion of postcolonialism, the ‘critical attention to \ngeographical difference, interconnection and the spatial imaginaries of ‘progress’, \n‘civilization’ and ‘development’, at best, also foregrounds the material geographies of \ncolonialism and their legacies’. Geographers are particularly able to link discursive and \ntextual strategies to material concerns because of their understanding of local scale analysis \nthat can reveal localised resistances and re-appropriations. They can employ tactics through \nwhich to ‘hear’ voices of resistance, such as reading archives against the grain to reveal \nhistorical agency (Barnett, 1998b; McEwan, 1998), or analysing different forms of resistance \nwriting that reveal the lived experiences of people otherwise silenced by hegemonic \nrelationships of power. These include autobiography and testimonio by people marginalized \nby poverty, which provide a rich site for postcolonial analysis because they demonstrate the \nway in which individual lives are affected by a global system of capital initiated as the \neconomy of the empire of modernity (see Barrios de Chungara, 1978). Postcolonial reading \nstrategies can work for and with poor people so ‘that the law of genre will no longer dominate \nthe representation and expression’ of people from different parts of the world (Kaplan 1998: \n215). They allow for the appropriation of the dominant language ‘for the purpose of re-\ninscribing place to produce a regional, or localised, worldview, and thus disrupt one of \nmodernity’s most pervasive effects – the emptying out of local space by colonialism and neo-\nimperialism’ (Ashcroft 2001: 30-1).  \n 14\nThe role that academics can play in creating spaces for the articulation of voices of \nresistance through textual production is important, since very few marginalized people are \nable to make their voices heard within the global economy of publishing. Artist and academic \nShelley Sacks’s work on social sculpture is particularly inspiring in this regard. The \nsignificance of her exhibition Exchange Values (an installation of stitched dried banana skins, \neach corresponding with an oral testimony by the Windward Islands farmer who grew them) \nhas been explored by cultural geographers (Cook et al., 2000). It attempts to use art to connect \nthe largely voiceless people at one end of the commodity chain (in this case the Caribbean), \nwhose labour remains invisible, to consumers at the other end, using the product itself \n(bananas) to make this connection. This is a radical critique of the effects of ‘free trade’ with \nthe potential to empower people at both ends of the commodity chain: producers by giving \nthem a voice through which to engage with consumers and facilitating connections that the \nfunctioning of the global economy often mitigates against; and consumers, who may not \nrealise that the choices they make can have a direct bearing of the lives of people elsewhere. \nThis project blends art, discourse and materiality to connect different places and the peoples \nwithin them, breaking down the boundaries between core and periphery, former imperial \nmetropole and former colonial hinterland. It suggests ways in which postcolonialism might be \ntranslated from a sometimes dense and obfuscating theory into a methodology, breaking down \nboundaries, creating connections and alternatives, facilitating participation and empowerment \nand giving voice to the previously voiceless.  \n These examples suggest ways in which geographers might respond to the challenges \nof postcolonialism, employing a number of methodological procedures for producing a \npostcolonializing discourse. As Quayson (2000: 21) argues, postcolonialising is meant to \n‘suggest creative ways of viewing a variety of cultural, political and social realities both in the \nWest and elsewhere via a postcolonial prism of interpretation’. Sometimes this involves a \n 15\nrigorous analysis of existing theories; a careful analysis of conditions governing particular \nsubject positions in the modern world; an interdisciplinary reading of the cultural and the \npolitical; or finding creative ways beyond the dominant modalities of analysing particular \nsocial issues. In this way, procedures censured as ‘facile textualist thought’ that contrive to \nblock ‘the appeal to any kind of real-world knowledge and experience’ (Norris, 1993: 182) \ncan be avoided, and the ‘politics of the symbolic order’ do not displace the theory and practice \nof politics (Parry 2002: 67). \n \nThe politics and ethics of postcolonial geographies?  \nBroadly speaking postcolonial perspectives can be said to be anti-colonial (Ashcroft et al., \n1995; Radcliffe, 1999). The politics of postcolonialism, however, often diverge sharply from \nother perspectives and its radicalism rejects established agendas and accustomed ways of \nseeing. Postcolonial critical agendas in different places are shaped by the different nature, \nform and timing of colonialism and anticolonial resistance, different levels of social division, \nand new forms of neo-colonial domination and transnational connections. As Nash (2000: \n227) argues, these differences ‘work against postcolonialism becoming a set of impressive \ntheoretical tools that are never challenged by the particular, complex, messy material of social \nrelations in different places’. They also work against the positing of a singular postcolonial \npolitics or set of political strategies. Therefore, in raising questions about the ‘politics’ of \npostcolonialism, I also want to signal that these are always positioned within different and \ninterconnected colonial contexts and legacies. \n Connecting the discursive to the material inevitably involves thinking about what the \npolitical might mean for postcolonial analysis in geography. It could be argued that political \nimperatives have driven postcolonialism from its beginnings because of its anti-colonial \nstance. However, as Quayson (2000) argues, there are also tensions between an activist \n 16\nengagement with the real world and a more distanced participation through analyses of texts, \nimages and discourses. The pretext for postcolonial criticism – the desire to speak to western \nparadigms of knowledge in the voice of otherness, to show how the constitution of western \nsubjectivity depended on interactions with subjected others, to destabilise centres and \nperipheries (Stoler, 1995; Bhabha, 1994; Ong, 1999) – is that it is an ethical enterprise, \npressing its claims in ways that other theories such as those of postmodernism and \npoststructuralism do not. Paradoxically, however, the idea of a postcolonial politics is also \nproblematised by a constant reluctance to take radical ethical standpoints. Thus postcolonial \ntheory and criticism is riven by a contradiction that has attracted much criticism:  \n…social referents in the postcolonial world call for urgent and clear solutions, but \nbecause speaking positions in a postmodernist world are thought to be always already \nimmanently contaminated by being part of a compromised world, postcolonial critics \noften resort to a sophisticated form of rhetoric whose main aim seems to be to rivet \nattention permanently on the warps and loops of discourse. (Quayson, 2000: 8) \nAs Quayson and Goldberg (2002) suggest, however, it is difficult if not impossible to separate \npostcolonial discourse from an ethical project, even though the means by which its ethical \nends are to be achieved remains a highly contentious issue. Of course, it is still possible to \nspeak and to indicate an existential tentativeness in whatever has been spoken (Katz, 1995; \nStorper, 2001) but questions remain over what the ultimate objectives of a responsible \npostcolonialism should be. What, for instance, is the use of a discursive analysis of the \nlanguage of development when this does not address the economic and social disjunctures \nproduced in developing countries by the imposition of structural adjustment policies? What is \nthe use of undermining discourses of power when ‘we never encounter any specific scenario \nof injustice, domination, or actual resistance from which we may gather intimations of the \npassage through the postcolonial ordeal’ (San Juan, 1998, 2)? To return to a question raised \n 17\nearlier, what do academic postcolonial studies contribute to the experience of postcolonialism \nin the contemporary world? \nAlthough these questions remain somewhat rhetorical, Spivak’s (1993) interrogation \nof the role of academics in a global context and her model of a continuing politico-intellectual \nglobal activism is useful. Throughout her work, Spivak alludes to the significance of the \nunlearning of privilege as loss. In terms of educational opportunity, citizenship and location \nwithin the international division of labour most academics are privileged. Privileges, whatever \nthey might be in terms of race, class, nationality, gender, and so on, may have prevented us \nfrom gaining access to Other knowledges, not simply information we have not yet received \nbut the knowledge that we are not equipped to understand by reason of our social positions.  \nSpivak’s ‘unlearning’ of privilege involves working hard to gain knowledge of others who \noccupy those spaces most closed to our privileged view and attempting to speak to those \nothers in a way that they might take us seriously and be able to answer back. This is especially \nimportant in provincialising geography and postcolonialising praxis. \nSpivak also outlines a formulation of ethics in which she posits the ethical relation as \nan embrace between parties who learn from each other, which has implications for thinking \nabout hearing and writing tactics. This embrace is not the same thing as wanting to speak for \nan oppressed constituency. When Spivak (1985) argues that the subaltern (those formerly \ncolonised peoples oppressed by the international division of labour and especially by the \nsuper-exploitation of female labour in ‘developing’ countries) cannot speak, she means that \ns\/he cannot be heard by the privileged in both ‘developed’ and ‘developing’ countries. Or as \nJacobs (2001: 731) puts it, ‘It is very common nowadays for the postcolonial politics of not \nspeaking for the other to override an alternative postcolonial politics of listening to the other’. \nThe latter only cease being subaltern when, to use Gramsci’s terms, they become organic \nintellectuals or spokespeople for their communities. Such a change will not be brought about \n 18\nby intellectuals attempting to represent oppressed peoples or by merely pretending to let them \nspeak. However, interactions between academic and non-academic researchers in disparate \nlocations can generate new languages and social representations that can become ‘constituents \nof alternative social visions and practices’, as well as ‘enabling new political identities and \ninitiatives’ (Gibson-Graham, 2002: 108). Despite the problems of the inevitable partiality of \nthe privileged academic view, recognising the effectiveness of knowledge ‘creates an \nimportant role for research as an activity of producing and transforming discourses, creating \nnew subject positions and imaginative possibilities that can animate political projects and \ndesires’ (ibid. 2002: 105;1994). \nA further dilemma for a postcolonial politics is the fact that postcolonial theory seems \nto locate itself everywhere and nowhere. As Quayson and Goldberg point out, it borrows from \na wide range of social theorists (for example, Lacan, Derrida, Foucault, Adorno, Deleuze and \nGuattari) and can seemingly be deployed in any historical period (for example, Cohen’s The \nPostcolonial Middle Ages). For geography, however, this can be both theoretically and \npolitically productive. Various theories, seemingly with no connection with postcolonial \nissues, have generated new discourses of postcolonialism. The tensions and dilemmas in new \nways of conceiving cross-cultural feminist politics, for example, have produced postcolonial \nfeminisms with the potential to contribute to the critical exploration of relationships between \ncultural power and global economic power and towards a radical reclaiming of the political. \nThe conceptual alliances between postcolonialism and feminist, gay\/lesbian, ethnic and \ndisability studies, drawing on similar theories to address issues of representation, hegemony \nand othering, have been particularly productive within and beyond geography, even though it \nis not always clear that this has effected unified political agendas within universities and \noutside. \n 19\nDespite these developments, debates persist about what precisely postcolonialism is in \ngeography and what it is meant to do. In considering how postcolonial geographies might \ndevelop, it is perhaps helpful to think of postcolonialism as an ‘ethico-politics’ of becoming \n(Ferguson, 1998), a ‘process of postcolonializing’ (Quayson 2000: 9) or an ‘anticipatory \ndiscourse’ (Childs and Williams, 1997: 7), recognising a condition that does not yet exist, but \nworking nevertheless to bring that about. Postcolonial geographies have the potential to \nprovide a careful grounding of the specificities of the local and to embed phenomena in a \nvariety of social, cultural, historical and political contexts through which ‘a transfigured and \nbetter future might be brought into view’ (Quayson and Goldberg, 2002: xiii). Postcolonialism \nis a viable way not just of interpreting events and phenomena that pertain directly to \npostcolonial contexts, but as a means by which to understand a world thoroughly shaped at \nvarious interconnecting levels by ‘the inheritance of the colonial aftermath’ (Gandhi, 1998: x). \nThus the ‘process of postcolonializing’ should refer to the critical process by which to relate \nmodern-day phenomena to their explicit and implicit relations to this heritage. \n Drawing on these insights, we might more carefully consider what the ‘political’ might \nmean for a meaningfully postcolonial geographical knowledge. Ashcroft (2001: 19) argues \nthat ‘a theory which may more faithfully engage the actual practice of post-colonial \nsubjects… is a poetics and politics of transformation’. On the one hand, a poetics of \ntransformation is concerned with the ways in which writers and readers contribute \nconstitutively to meaning, the ways in which formerly colonised societies appropriate \ndominant discourses, and how they interpolate their voices and their concerns into dominant \nsystems of textual production and distribution. Transformation recognises that power is \ncentral to cultural life and resists by adapting and redirecting discursive power, creating new \nforms of cultural production. On the other hand, a politics of transformation works constantly \nwithin existing discursive and institutional formations to change them. Through taking hold of \n 20\nwriting itself, in political discourse or political structures, in educational discourse and \ninstitutions, conceptions of places, peoples and even economics are transformed; ‘ultimately, \na poetics and politics of transformation effects a transformation of the disciplinary field’ (ibid: \n19).  \n Postcolonial geographies might also provide a more reflexive understanding of the \ncomplexities of postcoloniality. Rather than ‘sort out postcolonialism once and for all’ (Nash \n2002: 228) and devise theoretical or political frameworks that are all-encompassing, settled \nand complete, it might be more productive to keep the notion of a postcolonial politics within \ngeography as provisional and constantly under review, able to respond to different spatialities \nof the postcolonial but constantly in question. What is apparent in this is the continuing \ncentrality of culture to a transformative postcolonial geography and the recognition that \nunderlying all economic, political and social resistance is the struggle over representation, \nwhich occurs in language, writing and other forms of cultural production. The potential of \npostcolonial geographies is to discriminate between the continuing reality of imperial power \nand subject peoples and to resist the submergence of the neo-colonial subject within global \npower relations. Whereas globalism erases differences between people on the basis that they \nare all consumers, postcolonialism works to reveal the gaps between peoples that still remain, \nrevealing that people belong to a society as well as an economy, and that society is still \ncontrolled by a cultural hegemony established by imperialism (Ashcroft 2001). \nTransformation of representation is crucial because such practices are situated in a material \nworld often with critical material implications.  \n Central to this is an understanding of the importance of place-based and local\/global \nmachinations of postcoloniality. Critical reflections on the geographical dynamics of \npostcoloniality also need to herald a clear and coherent ethical and political position on the \npresent. Whilst postcolonialism is an eclectic and provisional field of critical enquiry an \n 21\nethical and political imperative ought to underpin a properly geographical understanding of \npostcoloniality and postcolonialism as a disciplinary project. With this in mind, we might \ndraw on the philosophical and historical referents to the importance of place, the local, the \ngrounded and the performative in colonialism and postcoloniality. Chakrabarty’s (2002) \nelevation of the notion of ‘dwelling’ in modernity and with the colonial past to an ethico-\npolitical principle is instructive, as are the more recent writings of Derrida (2000, 2001) and \nSpivak (2002) on dilemmas of hospitality and cosmopolitanism as they relate to \ntransnationalism and the lived experiences of migrants and asylum seekers. These issues are \nimportant globally and not least in countries of the South and in Southeast Asia, where \ntransnational flows of people are increasingly significant. We might also consider empire’s \nunethical neglect and destruction of the colonial other’s locational attachments (see, for \nexample, Mehta, 1999) and how this informs contemporary geopolitics and geoeconomics. \nExploring the ways in which native sovereignty is expressed, lived and performed in specific \nlocales can also foreground the agency of native peoples in contrast to the erasures of \ndominant western cultures and romantic representations of victimry, tragedy and nostalgia \n(Vizenor, 2001).  \nConcerns such as these are beginning to inform critical postcolonial geographies, \ncasting light on what a politically and ethically informed understanding of postcoloniality \nmight look like. The tactics for the political project of postcolonialising geography posited by \nRobinson (this volume) are also interwoven in these concerns since they demand an \nengagement with debates and practices from ‘the margins’ and, in so doing, work against a \ndivisive geopolitics of knowledge. \n \n 22\nCONCLUSIONS  \nThis paper has attempted to outline the major debates over and criticisms of postcolonialism \nand to suggest ways in which geography might respond and add to their potentially radical \ninsights and effects. It has argued that this might be achieved by, first, exploring the \npossibilities of a more productive engagement between material and discursive concerns; \nsecond, related to this, by developing the intersections between postcolonial approaches and \nissues of global inequality and the diverse lived experiences of postcoloniality; and third, by \ndeveloping the political and ethical possibilities of postcolonialising geographies. Despite the \ncaution surrounding progress narratives within geography, particularly about avoiding \nuniversalising statements of progress, any kind of politics needs some notion of what progress \nis (Rorty, 1998). As with anti-sexism and anti-racism, for example, we need to be able to ask, \nand keep asking, what a meaningfully postcolonial geography might look like.  \nPostcolonial approaches demonstrate how the production of western knowledge forms \nis inseparable from the exercise of western power (Said, 1978; Spivak, 1990; Young, 1991, \n2001) and reassert the value of alternative experiences and ways of knowing (Fanon, 1986; \nThiong’o, 1986; Spivak, 1987; Bhabha, 1994). They articulate some difficult questions about \nimperialist representations and discourses surrounding lands and peoples ‘beyond the west’ \nand about the institutional practice of western disciplines. They share a social optimism with \nother critiques, such as feminism, which have helped generate substantial changes in political \npractice (Darby, 1997, 30). While transforming unequal global relations by politics of \ndifference and agency alone is seemingly impossible, postcolonialism is a much-needed \ncorrective to the Eurocentrism and conservatism of much of western geographical thought. \nHowever, postcolonial geographies perhaps need to engage with more material considerations \nsince, as Dirlik (1994, 356) states: \n 23\n…neglect of these renders impossible the cognitive mapping that must be the point of \ndeparture for any practice of resistance and leaves such mapping as there is in the \ndomain of those who manage the capitalist world economy. \nIf the neglect of global economic inequalities and the lived experiences of postcoloniality \nundermines the political imperatives of anti-colonialism, the potential of postcolonial \ngeographies lies in their abilities to interrogate the interconnections, and complex spatialities \nof postcoloniality and to give proper attentiveness to dialogue and difference.  \nThe latter is particularly important given that one of the central paradoxes of \npostcolonialism is the charge that it has become institutionalised, representing the interests of \na western-based intellectual élite who speak the language of the contemporary western \nacademy while perpetuating the exclusion of the formerly colonised and continually \noppressed (Ahmad, 1992; Loomba, 1998; McClintock, 1992; Watts, 1995). There is, of \ncourse, an inherent possibility that postcolonialism might become a new colonising discourse \nand yet another subjection to foreign formations and epistemologies from the English-\nspeaking centres of global power. This is certainly how many critics in Latin America, for \nexample, have viewed postcolonialism (Klor de Alva, 1992; see also Ashcroft, 2000). As \nAshcroft (2000, 24) argues, however, rather than a new hegemonic field, we might see the \npostcolonial as a way of talking about the political and discursive strategies of formerly \ncolonised societies and peoples. Again geographers are ideally placed in this regard and in \nmore carefully viewing the various forms of anti-systemic operations of global capitalism. As \nSpivak (1990) argues, however, there is still a need for greater sensitivity to the relationship \nbetween power, authority, positionality and knowledge. The paradox for many scholars \nwriting within a postcolonial framework about people outside their own cultural milieu is that \nthey are inevitably located in the global hegemony of western scholarship; in other words, \n 24\nwestern domination of the global economy of the production, publication, distribution and \nconsumption of information and ideas.  \n \nACKNOWLEDGEMENTS \n \nI would like to thank the organisers of and participants at the Geography and Postcolonialism \nInternational Workshop for creating a friendly and stimulating environment in which to \ndiscuss the ideas in this paper. I am grateful to participants at the Postcolonialising Geography \nworkshop at the Open University (November 2002), where these ideas were first presented, \nfor raising a number of thought-provoking issues. Finally, I would like to thank Ian Cook and \nJane Pollard and two anonymous referees for their generous and constructive suggestions. The \nusual disclaimers apply. \n \nREFERENCES \nAhmad, A. (1992) In Theory: Classes, Nations, Literatures, London: Verso. \nAshcroft, B. (2001) On Postcolonial Futures. Transformations of Colonial Culture, London: \nContinuum. \nAshcroft, B, Griffiths, G. and Tiffin, H. (eds.) (1995) The Post-Colonial Studies Reader. \nLondon: Routledge. \nAshcroft, B., Griffiths, G. and Tiffin, H. (eds.) (1998) Key Concepts in Post-Colonial Studies, \nLondon: Routledge. \nBarnett, C. (1998a) ‘The cultural turn: fashion or progress in human geography’, Antipode 30, \n379-94. \nBarnett, C. (1998b) ‘Impure and worldly geography. The Africanist discourse of the Royal \nGeographical Society’, Transactions of the Institute of British Geographers 23(2), 239-\n52. \n 25\nBarrios de Chungara, D. (1978) Let Me Speak! trans. V. Ortiz, Mexico City: Siglo 21. \nBhabha, H. (1994) The Location of Culture, London: Routledge. \nBishop, R., Phillips, J. and Wei, Y.W. (2003) Postcolonial Urbanism, London: Routledge. \nBlunt, A (forthcoming), Domicile and Diaspora: Anglo-Indian Women and the Spatial \nPolitics of Home, Oxford: Blackwell. \nBlunt, A. and Wills, J. (2000) Dissident Geographies: An Introduction to Radical Ideas and \nPractice, Harlow: Prentice Hall. \nBlunt, A. and McEwan, C. (2002) (eds.) Postcolonial Geographies, London: Continuum. \nBlunt, A. and McEwan, C. (2002) ‘Introduction’, Postcolonial Geographies, London: \nContinuum, 1-6. \nCastree, N. (1999) ‘‘Out there’? ‘In here’? Domesticating critical geography’, Area 31(3), 81-\n6. \nChakrabarty, D. (1992) ‘Postcoloniality and the artifice of history: Who speaks for Indian \npasts?’ Representations, 37, 1-24. \nChakrabarty, D. (2000) Provincialising Europe: Postcolonial Thought and Historical \nDifference, Oxford: Princeton University Press. \nChakrabarty, D. (2002) Essays in the Wake of Subaltern Studies, Chicago: University of \nChicago Press. \nChambers, I. (1996) ‘Waiting on the end of the world?’ in D. Morley and K-H. Chen (eds.), \nStuart Hall. Critical Dialogues in Cultural Studies. London: Routledge, 201-211. \nChatterjee, P. (1996) Nationalist Thought and the Colonial World, London: Zed. \nChatterjee, P. (1998) A Possible India, Delhi: Oxford India Paperbacks. \nChilds, P. and Williams, P. (1997) An Introductory Guide to Postcolonial Theory, New York: \nPrentice Hall. \n 26\nClayton, D. (2000) Islands of Truth: The Imperial Fashioning of Vancouver Island, \nVancouver: UBC Press. \nClayton, D. (2002) ‘Critical imperial and colonial geographies’, in K. Anderson et al. (eds.) \nHandbook of Cultural Geography, London: Sage, 354-368.  \nCook, I. et al. (2000) ‘Social sculpture and connective aesthetics: Shelley Sacks’s ‘Exchange \nValues’, Ecumene, 7(3), 337-43. \nCorbridge, S. (1993) ‘Colonialism, postcolonialism and the political geography of the Third \nWorld’, in P.J. Taylor (ed.) Political Geography of the Twentieth Century, London: \nBelhaven Press. \nCrush, J. (1994) ‘Post-colonialism, decolonization and geography’, in A. Godlewska and N. \nSmith (eds.), Geography and Empire, Oxford: Blackwell, 333-50.  \nCrush, J. (ed.) (1995) Power of Development, London: Routledge.  \nDarby, P. (ed.) (1997) At the Edge of International Relations. Postcolonialism, Gender and \nDependency, London: Pinter. \nDerrida, J. (2000) Of Hospitality, Stanford: Stanford University Press. \nDerrida, J. (2001) On Cosmopolitanism and Forgiveness, London: Routledge. \nDirlik, A. (1994) ‘The postcolonial aura: Third World criticism in the age of global \ncapitalism,’ Critical Inquiry winter, 329-356. \nDriver, F. and Yeoh, B. (eds.) (2000) ‘Constructing the Tropics’, Singapore Journal of \nTropical Geography 21, 1-98. \nEagleton, T. (1994) ‘Goodbye to the Enlightenment’, The Guardian 5 May. \nEscobar, A. (1992) ‘Imagining a post-development era? Critical thought, development and \nsocial movements,’ Social Text, 31\/32, 20-56. \nEscobar, A. (1995) ‘Imagining a Post-Development Era’, in J. Crush (ed.), Power of \nDevelopment, London: Routledge, 211-227. \n 27\nEsteva, G. (1987) Regenerating people’s space. Alternatives 12(1), 125-52. \nFanon, F. (1986) Black Skin White Masks, London: Pluto. \nFerguson, A. (1998) “Resisting the veil of privilege: building bridge identities as an ethico-\npolitics of global feminisms”, Hypatia, Special Issue: Border Crossings: Multicultural \nand Postcolonial Feminist Challenges to Philosophy, Part 2, 13(3), 95-114. \nGandhi, L. (1998) Postcolonial Theory: A Critical Introduction, Edinburgh: Edinburgh \nUniversity Press. \nGibson-Graham, J.K. (1994) ‘‘Stuffed if I know!’ Reflections on post-modern feminist social \nresearch’, Gender, Place and Culture, 1, 205-24. \nGibson-Graham, J.K. (2002) ‘Poststructural interventions’, in E. Sheppard and T. Barnes \n(eds.), A Companion to Economic Geography, Oxford: Blackwell, 95-110. \nGregson, N. (1993) ‘‘The initiative’ – delimiting or deconstructing social geography?’ \nProgress in Human Geography, 17(4), 525. \nHall, S. (1996) ‘What was ‘the post-colonial’? Thinking at the limit’, in I. Chambers and L. \nCurti (eds.), The Postcolonial Question: Common Skies, Divided Horizons, London: \nRoutledge, 242-60. \nHarris, C. (2002) Making Native Space, Vancouver: UBC Press. \nJackson, C. (1997) “Post-poverty, gender and development?” Institute of Development Studies \n(IDS) Bulletin, 28(3), 145-53. \nJackson, P. and Jacobs, J. (1996) ‘Postcolonialism and the politics of race’, Environment and \nPlanning D: Society and Space, 14, 1-3. \nJacobs, J.M. (1996) Edge of Empire: Postcolonialism and the City, London: Routledge.  \nJacobs, J.M. (2001) ‘Touching pasts’, Antipode 33, 730-34. \n 28\nKaplan, C. (1998) Resisting Autobiography: Out-Law Genres and Transnational Feminist \nSubjects. In S. Smith and J. Watson (eds.) Women, Autobiography, Theory. A Reader. \nLondon and Madison: University of Wisconsin Press, 208-216. \nKatz, C. (1995) ‘Major\/minor: theory, nature, politics,’ Annals of the Association of American \nGeographers 85, 164-8. \nKlor de Alva, J. (1992) ‘Colonialism and postcolonialism as (Latin) American mirages’ \nColonial Latin American Review, 1(1-2), 3-23. \nKusno, A. (2000) Behind the Postcolonial, London: Routledge. \nLester, A. (forthcoming) ‘Colonial and postcolonial geographies’, Journal of Historical \nGeography. \nLipsitz, G. (1997) Dangerous Crossroads: Popular Music, Postmodernism and the Poetics of \nPlace, London: Verso. \nLoomba, A. (1998) Colonialism\/Postcolonialism, London: Routledge. \nLoomba, A. and Kaul, S. (1994) ‘Location, culture, postcoloniality’, Oxford Literary Review, \n16, 3-30. \nMarcus, G.E. (1999), Critical Anthropology Now: Unexpected Contexts, Shifting \nConstituencies, Santa Fe: School of American Research Press. \nMcClintock, A. (1992), ‘The angel of progress: pitfalls of the term ‘postcolonialism’’, Social \nText, 31\/32, 84-98. \nMcClintock, A. (1995) Imperial Leather: Race, Gender and Sexuality in the Colonial Contest, \nNew York: Routledge. \nMcEwan, C. (1998) ‘Cutting power lines within the palace? Countering paternity and \neurocentrism in the ‘geographical tradition’’, Transactions of the Institute of British \nGeographers 23(3), 371-84. \n 29\nMcEwan, C. (2002) ‘Postcolonialism’, in V. Desai and R. Potter (eds.) The Companion to \nDevelopment Studies, London: Arnold 127-131. \nMehta, U.S. (1999) Liberalism and Empire, Chicago: University of Chicago Press. \nMiyoshi, M. (1997) ‘Sites of resistance in the global economy’, in K. Ansell-Pearson, B. \nParry and J. Squires (eds.) Cultural Readings of Imperialism: Edward Said and the \nGravity of History, London: Lawrence and Wishart. \nMiyoshi, M. and Harootunian, H. (eds.) (2002) Learning Places. The Afterlives of Area \nStudies, Durham, NC: Duke University Press. \nNash, C. (2002) ‘Cultural geography: postcolonial cultural geographies’, Progress in Human \nGeography 26(2), 219-30. \nNorris, C. (1993) The Truth about Postmodernism, Oxford: Blackwell. \nOng, A. (1999) Flexible Citizenship: The Cultural Logics of Transnationality, Durham, N.C: \nDuke University Press. \nParry, B. (2002) ‘Directions and Dead Ends in Postcolonial Studies’ in D.T. Goldberg and A. \nQuayson (eds.), Relocating Postcolonialism, Oxford: Blackwell, 66-81. \nPerrons, D. (1999) ‘Reintegrating Production and Consumption, or Why Political Economy \nStill Matters’, in R. Munck and D. O’Hearn (eds.), Critical Development Theory, \nLondon: Zed, 91-112. \nPhilo, C. (2000) ‘More words, more worlds: reflections on the ‘cultural turn’ and human \ngeography’, in I. Cook, D. Crouch, S. Naylor and J. Ryan (eds.), Cultural \nTurns\/Geographical Turns: Perspectives on Cultural Geography, Harlow: Longman, \n26-53. \nPratt, G. (1999) “From registered nurse to registered nanny: discursive geographies of Filipina \ndomestic workers in Vancouver, B.C.”, Economic Geography, 75(3), 215-236. \nQuayson, A. (2000) Postcolonialism: Theory, Practice or Process? Cambridge: Polity. \n 30\nQuayson, A. and Goldberg, D.T. (2002) ‘Introduction: Scale and Sensibility’, in D.T. \nGoldberg and Quayson, A. (eds.), Relocating Postcolonialism, Oxford: Blackwell, xi-\nxxii \nRadcliffe, S. (1999) ‘Re-thinking development’, in P. Cloke, P. Crang and M. Goodwin (eds.) \nIntroducing Human Geographies, London: Arnold, 84-91. \nRajan, R. S. (1993) Real and Imagined Women. Gender, Culture and Postcolonialism, \nLondon: Routledge. \nRattansi, A. (1997) ‘Postcolonialism and its discontents’, Economy and Society 26(4), 480-\n500. \nRorty, R. (1998) Achieving our Country: Leftist Thought in Twentieth Century America, \nCambridge, MA: Harvard University Press. \nRose, J. (1987) ‘The state of the subject (II): the institution of feminism’, Critical Inquiry, \n29(4), 9-15. \nRothman, H. and Davis, M. (1999) The Grit Beneath the Glitter: Tales from the Real Las \nVegas, Berkeley: University of California Press. \nSaid, E. (1978) Orientalism, London: Routledge. \nSaid, E. (1993) Culture and Imperialism, London: Chatto and Windus. \nSaid, E. (1999) Out of Place, London: Granta. \nSan Juan, E. (1998) Beyond Postcolonial Theory, London: Palgrave. \nSayer, A. (2001) ‘For a critical cultural political economy’, Antipode 33, 687-708. \nSharma, A. (1996) ‘Sounds Oriental: The (im)possibility of theorizing Asian musical \ncultures’, in S. Sharma, J. Hutnyk and A. Sharma (eds.) Dis-Orienting Rhythms: The \nPolitics of the New Asian Dance Music, London: Zed, 10-28. \n 31\nSherman, R. and Voss, K. (2000) ‘Immigration and unionization in the San Francisco hotel \nindustry’, in R. Milkman (ed.), Organizing Immigrants: The Challenge for Unions in \nContemporary California, Ithaca: Cornell University Press. \nSidaway, J. (2000) ‘Postcolonial geographies: an exploratory essay’, Progress in Human \nGeography 24, 591-612. \nSlater, D. (1998) ‘Post-colonial questions for global times’ Review of International Political \nEconomy 5, 647-78. \nSpivak, G.C. (1985) ‘Subaltern Studies: Deconstructing Historiography’ in Guha, R. (ed.), \nSubaltern Studies IV, New Delhi: Oxford University Press, 330-63. \nSpivak, G.C. (1987) In Other Worlds: Essays in Cultural Politics. London: Methuen. \nSpivak, G.C. (1990) The Postcolonial Critic: Interviews, Strategies, Dialogue. London: \nRoutledge. \nSpivak, G.C. (1993) Outside in the Teaching Machine, London: Routledge. \nSpivak, G.C. (1999) A Critique of Postcolonial Reason, Cambridge (Mass): Harvard \nUniversity Press. \nSpivak, G.C. (2002) ‘Resident Alien’, in D.T. Goldberg and A. Quayson (eds.), Relocating \nPostcolonialism, Oxford: Blackwell, 47-65. \nStoler, A. (1995), Race and the Education of Desire: Foucault’s History of Sexuality and the \nColonial Order of Things, Durham, NC: Duke University Press. \nStorper, M. (2001) ‘The poverty of radical theory today: from the false promises of Marxism \nto the mirage of the Cultural Turn’ International Journal of Urban and Regional \nResearch 25(1), 155-179. \nThiong’o, N. (1986) Decolonising the Mind, London: James Curry. \nVizenor, G. (2001) Fugitive Poses, Lincoln: University of Nebraska Press. \n 32\n                                                          \nWatts, M. (1995) ‘‘A New Deal in Emotions’. Theory and practice and the crisis of \ndevelopment’, in J. Crush (ed.) Power of Development, London: Routledge, 44-62. \nYeoh, B.S.A. (1991) ‘Postcolonial Cities’, Progress in Human Geography 25(3), 456-68. \nYeoh, B.S.A. and Willis, K. (1999) ‘‘Heart’ and ‘wing’, nation and diaspora: gendered \ndiscourses in Singapore’s regionalisation process’, Gender, Place and Culture, 6(4), \n355-72. \nYoung, R. (2001) Postcolonialism: An Historical Introduction, Oxford: Blackwell. \nYoung, R. (1991) White Mythologies: Writing History and the West, London: Routledge. \n \nNOTES \ni   Indeed this journal has been at the forefront of many of these debates (see Driver and Yeoh \n(2000). Several innovative projects are also in progress in Asian universities; teams at the \nDepartment of Geography (NUS), for example, are researching how cultural and social \ngeographies are taught and practiced in the region, how the region has been produced through \nCold War area studies and development discourses and imagining new theoretical frameworks \nfor understanding Southeast Asian geographies (Bunnell, pers. comm. 2002). Explicitly \npostcolonial geographies are also being written from Southeast Asia (see, for example, Bishop \net al. (2003); Kusno (2000)). \nii  This raises questions about where postcolonial geography (which has its origins in an \nengagement with the representational) ends and critical ‘development geography’ (alert to \nglobal inequalities) begins. This is worthy of further debate, but I argue for now that a concern \nfor material practices and spaces need not be disconnected from discourses, texts, imaginings \nand counter-imaginings since there are fundamental entanglements between the two. \niii Research on the Hotel Employees and Restaurant Employees (HERE) union in Las Vegas is \nparticularly instructive (Rothman and Davis, 1999); see also Sherman and Voss (2000) on \nimmigrant unionisation in the San Francisco hotel industry. There are also new forms of \norganisation emerging in many post-independence countries to ensure that the interests of \npreviously marginalized workers are placed on national agendas.  \n"}