{"doi":"10.1111\/j.1551-2916.2006.01373.x","coreId":"138124","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/1391","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/1391","10.1111\/j.1551-2916.2006.01373.x"],"title":"Porous, Functionally Gradient Pyroelectric Materials.","authors":["Shaw, Christopher P.","Whatmore, Roger W.","Alcock, Jeffrey R."],"enrichments":{"references":[{"id":38105978,"title":"Calculating Different Physical Constants of Heterogeneous Substances”,","authors":[],"date":"1935","doi":null,"raw":"14D. A. G. Bruggeman, “Calculating Different Physical Constants of Heterogeneous Substances”, Annln. Phys-Leipzig, 24 636 (1935). (“Berechnung Verschiedener Physikalischer Konstanten von Heterogenen Substanzen”, Annalen Der Physik).","cites":null},{"id":38105970,"title":"Ceramic Fabrication Processes”;","authors":[],"date":"1976","doi":null,"raw":"5J. C. Williams, “Ceramic Fabrication Processes”; pp. 173-98 in Treatise on Material Science and Technology, Vol. 9. Edited by F.F.Y Wang, Academic Press, New York, 1976.","cites":null},{"id":38105971,"title":"Charge Pumping and Pseudopyroelectric Effect in Active Ferroelectric Relaxor-Type Films”,","authors":[],"date":"1992","doi":"10.1103\/physrevlett.68.1778","raw":"6N. W. Schubring, J. V. Mantese, A. L. Micheli, A. B. Catalan and R. J. Lopez, ”Charge Pumping and Pseudopyroelectric Effect in Active Ferroelectric Relaxor-Type Films”, Phys. Rev. Let., 68 [11] 1778 (1992).","cites":null},{"id":38105976,"title":"Correlation of Sintered Microstructure with Green Density","authors":[],"date":"2004","doi":"10.4028\/www.scientific.net\/kem.264-268.309","raw":"12L. Mortara, A. Navarro, R. W. Whatmore and J. R. Alcock, “Correlation of Sintered Microstructure with Green Density in Thick-Film PZT”, pp. 309-12 in Key Engineering Materials,Vol. 264-268, Euro Ceramics VIII Parts 1-3. Edited by H. Mandal and L. Ovecoglu, 2004.  Proceedings of the 8 th Conference and Exhibition of the European Ceramic Society, Istanbul, Turkey, 2003. Trans Tech Publications Inc., Zurich.","cites":null},{"id":38105977,"title":"Dielectric, Elastic and Piezoelectric Properties of Porous","authors":[],"date":"1986","doi":"10.1080\/00150198608238739","raw":"13W. Wersing, K. Lubitz and J. Mohaupt, ”Dielectric, Elastic and Piezoelectric Properties of Porous PZT Ceramics”, Ferroelectrics, 68 [1-4] 77-97 (1986).","cites":null},{"id":38105973,"title":"Edited by R.K Willardson and A.C","authors":[],"date":"1970","doi":"10.1016\/s0080-8784(08)62629-0","raw":"5, Ch. 6. Edited by R.K Willardson and A.C Beer, Academic Press, New York, 1970.","cites":null},{"id":38105974,"title":"Electrical Conductivity Control in Uranium-Doped PbZrO3–PbTiO3–Pb(Mg1\/3Nb2\/3)O3 Pyroelectric Ceramics ”,","authors":[],"date":"2002","doi":"10.1016\/s0955-2219(01)00316-8","raw":"9S. B. Stringfellow, S. Gupta, C. P. Shaw, J. R. Alcock and R. W. Whatmore, ”Electrical Conductivity Control in Uranium-Doped PbZrO3–PbTiO3–Pb(Mg1\/3Nb2\/3)O3 Pyroelectric Ceramics ”, J. European Ceramic Society, 22 [4] 573-578 (2002).   17 10A. Kristoffersson and E. Carlstrom, ”Tape Casting of Alumina in Water with an Acrylic Latex Binder”, J. European Ceramic Society, 17 [2-3] 289-297 (1997).","cites":null},{"id":38105979,"title":"Equivalent Pyroelectric Coefficient of a Pyroelectric Bimorph Structure”,","authors":[],"date":"2000","doi":"10.1063\/1.1327284","raw":"15L. Pintille, I. Pintille and I. Matei, ”Equivalent Pyroelectric Coefficient of a Pyroelectric Bimorph Structure”, J. Appl. Phys.,88 [12] 7264-7271 (2000).  18","cites":null},{"id":38105968,"title":"High-Performance, Conducting Pyroelectric Ceramics”,","authors":[],"date":"1983","doi":"10.1080\/00150198308244687","raw":"2R. W. Whatmore, ”High-Performance, Conducting Pyroelectric Ceramics”, Ferroelectrics, 49 [1-4] 201-210 (1983).","cites":null},{"id":38105967,"title":"Piezoelectric Ceramic Compositional Development”,","authors":[],"date":"1992","doi":"10.1121\/1.402938","raw":"1D, J. Berlincourt, ”Piezoelectric Ceramic Compositional Development”, Acoust. Soc. Am., 91 3034-3040 (1992).","cites":null},{"id":38105969,"title":"Pyroelectric Ceramics and Devices for Thermal Infrared Detection and Imaging”,","authors":[],"date":"1991","doi":"10.1080\/00150199108014764","raw":"4R. W. Whatmore, ”Pyroelectric Ceramics and Devices for Thermal Infrared Detection and Imaging”, Ferroelectrics,118 241-259 (1991).","cites":null},{"id":38105975,"title":"Pyroelectric Coefficient Direct Measurement Technique and Application to a Nsec Response Time Detector”,","authors":[],"date":"1972","doi":"10.1080\/00150197208235326","raw":"11R. L. Byer and C. B. Roundy, ”Pyroelectric Coefficient Direct Measurement Technique and Application to a Nsec Response Time Detector”, Ferroelectrics, 3 [2-3] 333 (1972).","cites":null},{"id":38105972,"title":"Pyroelectricity of PZT-based Thick-films”, Sensors and Actuators,","authors":[],"date":"1999","doi":"10.1016\/s0924-4247(99)00056-4","raw":"7G. De Cicco, B. Morten, D. Dalmonego and M. Prudenziati, “Pyroelectricity of PZT-based Thick-films”, Sensors and Actuators, 76 [1-3] 409-415 (1999). 8E. H. Putley, “The Pyroelectric Detector”; pp. 259-285 in Semiconductors and Semimetals, Vol.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2007-01","abstract":"Properties of a new type of pyroelectric ceramic structure containing a layer of known porosity laminated between two dense layers, to form a functionally gradient material (FGM), are reported. The combination of theoretical models for pyroelectric, dielectric, and thermal properties gave a model for the pyroelectric voltage figure of merit (FV) in good agreement with experiment, which had shown a 20% improvement for an introduced central layer porosity of 27%. Preliminary pyroelectric responsivity measurements on FGM infrared detectors indicated an even better improvement. It is postulated that this is due to the porous layer acting as a thermal barrier in the structure","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138124.pdf","fullTextIdentifier":"http:\/\/hdl.handle.net\/1826\/1391","pdfHashValue":"fd064e035942a4d7baa6800644a91e3b936456b6","publisher":"Blackwell Publishing","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/1391<\/identifier><datestamp>2008-02-22T16:24:07Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Porous, Functionally Gradient Pyroelectric Materials.<\/dc:title><dc:creator>Shaw, Christopher P.<\/dc:creator><dc:creator>Whatmore, Roger W.<\/dc:creator><dc:creator>Alcock, Jeffrey R.<\/dc:creator><dc:description>Properties of a new type of pyroelectric ceramic structure containing a layer of known porosity laminated between two dense layers, to form a functionally gradient material (FGM), are reported. The combination of theoretical models for pyroelectric, dielectric, and thermal properties gave a model for the pyroelectric voltage figure of merit (FV) in good agreement with experiment, which had shown a 20% improvement for an introduced central layer porosity of 27%. Preliminary pyroelectric responsivity measurements on FGM infrared detectors indicated an even better improvement. It is postulated that this is due to the porous layer acting as a thermal barrier in the structure.<\/dc:description><dc:publisher>Blackwell Publishing<\/dc:publisher><dc:date>2007-01-23T16:18:02Z<\/dc:date><dc:date>2007-01-23T16:18:02Z<\/dc:date><dc:date>2007-01<\/dc:date><dc:type>Postprint<\/dc:type><dc:format>1478568 bytes<\/dc:format><dc:format>application\/pdf<\/dc:format><dc:identifier>Christopher P. Shaw, Roger W. Whatmore, Jeffrey R. Alcock (2007) Porous, Functionally Gradient Pyroelectric Materials, Journal of the American Ceramic Society, 90 (1), 137–142.<\/dc:identifier><dc:identifier>0002-7820<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/1391<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1111\/j.1551-2916.2006.01373.x<\/dc:identifier><dc:language>en<\/dc:language><dc:rights>The definitive version is available at www.blackwell-synergy.com<\/dc:rights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0002-7820","0002-7820"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":[],"subject":["Postprint"],"fullText":" 1 \nPorous, Functionally-Gradient Pyroelectric Materials \n \nChristopher P Shaw*, Roger W Whatmore†‡, Jeffrey R Alcock \nSchool of Industrial and Manufacturing Science, \nCranfield University, Cranfield, Bedfordshire MK43 0AL, UK.  \n \nAbstract \n \nProperties of a new type of pyroelectric ceramic structure containing a layer of known porosity \nlaminated between two dense layers, to form a functionally-gradient material (FGM) are \nreported. Combination of theoretical models for pyroelectric, dielectric and thermal properties \ngave a model for the pyroelectric voltage figure of merit (FV) in good agreement with \nexperiment, which had shown a 20% improvement for an introduced central layer porosity of \n27%. Preliminary pyroelectric responsivity measurements on FGM infra-red detectors indicated \neven better improvement. It is postulated that this is due to the porous layer acting as a thermal \nbarrier in the structure. \n \nIntroduction \n \nThe piezoelectric and pyroelectric properties of ceramic materials such as those based on lead \nzirconate titanate (PZT) modified with lead iron niobate (PFN), lead magnesium niobate (PMN) \n                                                           \n*\n E-mail: c.p.shaw@cranfield.ac.uk \n†\n Present address: Tyndall National Institute, Lee Maltings, Cork, Ireland. \n‡\n Funding from EPSRC under project number GR\/R43303\/01 and from IRISYS Ltd (Towcester, UK). \n 2 \nand various other dopants1,2, have proved to be useful in many applications to-date. These \ninclude such devices as actuators, sensors, sound generators and motors 3, and thermal imaging \narrays4. In pyroelectric, and many piezoelectric applications, the active material is required in the \nform of thin (50-300µm) ceramic sheets. In principle, tape casting5 offers a route to producing \nsuch material, either as individual layers which are sintered, or multiple layers which are \nlaminated and sintered to yield the required thicknesses. Recently, large pyroelectric properties \nwithin functionally graded materials (FGM) have been reported6. The basic idea is to incorporate \ndifferent layers with differing properties so that the complete structure is optimised for a \nparticular application. In this respect, the lamination of tape cast material offers an ideal route to \nconstruct such structures. \n \nWithin the present study the aim has been to produce a FGM structure as schematically shown in \nfigure 1, and which consists of a porous layer of pyroelectric material sandwiched between two \ndense layers of the same material. There has been evidence from the literature that uniformly \nporous films of PZT have higher pyroelectric responsivities than the dense ones7. In addition, the \neffect on other material properties such as relative permittivity, thermal conductivity and thermal \ncapacitance should have beneficial consequences for a pyroelectric application as long as the \npyroelectric coefficient itself is not reduced significantly. \n \nThe significance of optimising these properties is highlighted when the figure of merit (Fv)8 is \nconsidered: \n \n 3 \n0'εεc\npFv =       (1) \n \nwhere εo is the permittivity of free space, p is the pyroelectric coefficient, c’ is the volume \nspecific heat, and ε is the relative permittivity of the pyroelectric material.  Obviously, as Fv has \nbeen shown to be proportional to the voltage response for pyroelectric detectors it can act as a \nuseful parameter for comparing pyroelectric materials. \n \nExperimental \n \nFGMs with a porous central layer were produced via a tape casting process, details of which are \ngiven below, followed by the stacking and lamination of several tapes to form the FGM structure.  \nThe porosity in the central layer of the FGM was formed by the addition of a sacrificial pore \nforming agent, corn starch (Sigma-Aldrich, Dorset, UK) to the green tape which would be burnt \nout during debinding and sintering.  The average particle size of the corn starch used was 15 µm.   \n \nFGM samples were prepared by sandwiching either one or two layers of the starch contained tape \nbetween a top and bottom layer of starch-free tape.  Consequently, two different dense-porous-\ndense 'architectures' were produced, which were referred to as, a 1:1:1 layer structure, formed \nfrom a tri-layer structure and a 1:2:1 structure formed from a quad-layer.  Only thinner crack-free \ntapes could be produced for creating the porous central layer, a problem which was thought to \nhave originated from increased drying stresses in the starch-contained tapes compared with the \nstarch-free tapes.  The actual thickness of the  porous layer in these two architectures translated \n 4 \nto approximately 25% and 40% respectively of the total green tape thickness[see Figures 3a and \n4a]. In the sintered tapes no microstructural evidence of a boundary between the two original \nporous layers of the 1:2:1 architecture could be discerned [see Figure 4a]. \n \nFor the tape casting process, calcined powders, of a doped lead zirconium titanate \n(Pb[{Mg1\/3Nb2\/3)0.025(Zr0.825Ti0.175)0.975}0.9927U0.0063]O3) (PMNZTU) were prepared by a mixed \noxide route, as reported previously 9. Typical primary particle size was 500nm. \n \nAqueous slips of PMNZTU were produced comprising the powder, a latex binder (Mowilith \nLDM7651S, Celanese Emulsions, Norden AB, Denmark), a dispersant (Dispex A40, Allied \nColloids, Bradford, UK.), and a wetting agent (Surfynol SE-F, Air Products and Chemicals \nUtrecht, Netherland).  The standard composition of a dry, starch free tape is given in Table I. To \nproduce the central layer(s) of the FGMs, green tapes were produced with corn starch contents of \n5, 10, 20 and 30 vol% with respect to the powder.  In these tapes, the dispersant quantity was \nkept constant hence the dispersant to powder ratio of the slips increased as the starch content \nincreased. \n \nA combination of stirring and ultrasonic mixing was initially used to combine the PMNZTU, \nbinder, dispersant and water, before ball milling for 4 hours.  The starch and surfactants were \nthen added and gently mixed for another hour. Casting was then carried out at a carrier speed of \n4.5cm\/s, a blade width of 200mm and  blade heights of 175µm (starch-free slip) and 100µm \n(starch-containing slip), onto a  Mylar (Richard E. Mistler Inc., Morrisville, PA.)  carrier film. \n 5 \nTapes were allowed to dry at ambient temperatures and humidity, resulting in crack free tapes of \ndry thickness 116±4µm and 76±7µm for the starch-free and starch contained tapes respectively. \n \n \nA uniaxial warm press (G.E Moore, Birmingham, UK.) was used to laminate the tape layers into \nthe desired architectures.  Three or four layers of 30mm x 30mm squares of tape were stacked \nbetween two pieces of silicone coated Mylar, with the silicone coated surfaces presented towards \nthe tape to aid release of the warm pressed structure. The stack was then pressed between two \npolished steel plates, with a parallel plate configuration, at 50°C for 15mins, at an optimised \npressure of 170MPa.  The lamination process produced a mean reduction in sample thickness of \n20.8% and 22.0% for the 1:1:1 and 1:2:1 sample sets respectively, in comparison to the total \nthicknesses of the component green tapes. \n \nDebinding and sintering of the samples was carried out using a muffle furnace (PyroTherm, \nLeicestershire, UK.).  Alumina substrates and crucibles which had previously been conditioned \nwith lead (II) oxide (99.9+%, Sigma-Aldrich, Dorset, UK.) were used to help reduce lead loss.  \nFor debinding, the samples were placed, uncovered, on flat alumina substrates in the furnace.  A \ndebinding profile based on studies by Kristofferson et al.10 was used: 3°C min-1 to 210°C, hold \n15 mins; 1°C min-1 to 320°, hold 15 mins; 1°C min-1 to 500°C, hold 60 mins. \n \nTo reduce lead loss from the samples during the sintering stage, small alumina pots containing \ncalcined PMNZTU powder were placed on the alumina substrate around the debound samples.  \nA tightly fitting crucible was used to cover samples and pots.  Samples were sintered at 1170°C \n 6 \nfor 30 mins.  A ramp rate of 3°C min-1 was used on heating and cooling.  A reduction in \nthickness of between 19.3 and 22.2% was observed on sintering, with the small amount of \nvariation appearing to have no relationship with layer architecture or total starch content of the \ngreen tape.  This indicated that the starch induced porosity was not being significantly reduced \nduring the sintering process. \n \nBulk densities (ρA) of the sintered samples were determined by using an image analysis system \n(Q500MC, Leica, Cambridge, UK.) to measure the area of the samples, optical microscopy to \ndetermine the FGM thickness and a balance (AT460, Mettler-Toledo Ltd., Leicester, UK.) to \nrecord mass. The values of density so-determined were used to calculate the average porosities \n(PA) for the samples (PA=1-ρA). These are presented in Table II. Sintered sample thicknesses \nvaried between the two architectures with mean values of 200µm for 1:1:1 and 234µm for 1:2:1.   \n \nSEM images of the cross-sectional fracture surfaces of pieces of the samples were taken to \ndetermine grain and porosity data.  \n \nFor electrical characterisation, Cr\/Au electrodes were evaporated onto both sides of the samples.  \nSamples were poled under an electric field of 3kV mm-1 using a high voltage source (Alpha II, \nBrandenburg, Thornton Heath, UK.)  for 10mins in mineral oil at temperatures between 100 -\n120°C.  The field was maintained until the oil had been cooled to less than 50°C.  The samples \nwere then placed in an oven at 60 °C for 8 hrs with their electrodes shorted, to remove any space \ncharge introduced by the poling process.   \n \n 7 \nDielectric measurements were made using an impedance bridge (1689M RLC Digibridge, \nGenRad Inc., Concord, MA.) at 33Hz  with a voltage amplitude of 0.5V. The pyroelectric current \nresponse was measured using the Byer-Roundy method11 on a custom-built computer controlled \nrig.  This used a thermoelectric heater\/cooler to apply a thermal saw-tooth profile centred around \n25°C, under reduced pressure, whilst reading current data from an electrometer (6517, Keithley \nInstruments, Cleveland, Ohio). Pyroelectric coefficients were then determined and used to \ninvestigate the pyroelectric figure of merit Fv. \n \n \nResults \n \nFigures 2a-b show examples of a fracture surface cross section of a sintered starch-free tri-layer \nFGM.  Only small amounts of porosity were observable (corresponding to the experimentally-\ndetermined value of 4.2%).  No discontinuities corresponding to inter-layer boundaries of the \ngreen tape could be distinguished.  The average grain size was 5 µm.  Figures 3 and 4 show \nexamples of microstructures for the 1:1:1 and 1:2:1 architectures produced from 30% starch \ntapes in the central layer.  The dense regions, figures 3c and 4c, of the FGMs showed an \napproximate grain size of 5 - 7µm, with grains in the porous regions, figures  3b and 4b, tending \nto show a smaller value than this, particularly for the grains surrounding individual pores.  \n \nFigures 5-8 present the basic electrical properties for both architectures.  Data are plotted against \nthe average porosities of the samples.  A maximum of 13.2% average porosity was achieved for a \n1:2:1 architecture produced from a quad-layer structure with 30% starch content tape as the \n 8 \ncentral layers.  The minimum porosity content for the layered structures was 4.2% average \nporosity, corresponding to a FGM produced with no added starch.  \n \nFigure 5 shows the variation in relative permittivity with average porosity for the poled FGM \nsamples. Poling of the samples had produced about a 17% reduction in relative permittivity down \nto the values given in figure 5. Relative permittivity was found to decrease with increasing \nporosity at a mean rate of 1.54% per average porosity%. Figure 6 plots the dielectric loss (tanδ) \nagainst average porosity.  Dielectric loss showed little variation with the porosity at the \nfrequencies measured.  \n \nFigure 7 shows the variation of the average pyroelectric coefficient (determined from heating and \ncooling measurement cycles) against the porosity of the samples.  As with relative permittivity, \npyroelectric coefficient decreased with increasing porosity, but at a mean rate of 1.3%\/porosity%. \n \nThe ratio of pyroelectric coefficient to relative permittivity (measured at 33Hz) is plotted against \nporosity in figure 8.  This shows an increase with increasing porosity at a mean rate of \n0.5%\/porosity% and an improvement in the ratio by a maximum of 5.4% within the 4.2 to 13 \npercentage porosity range investigated. \n \nDiscussion \n \nIn terms of the desired sintered structure for the porous layers of the FGM samples, it is evident \n(from figures 3 and 4) that large pores are distributed evenly throughout the central region. The \n 9 \nchoice of 15µm as the original starch particle diameter was an important consideration, as a \nsmaller sized starch particle may have resulted in initial pore sizes which may have been \nconsumed during the sintering stage, as neighbouring grains enlarged. The evidence is that the \npore size observed after sintering is between 10-20µm, suggesting that they have originated from \nisolated starch particles. It is worth pointing out that there is still a level of porosity within the \ndense layers of the FGM architectures as indicated by the 4.2% level of porosity observed for the \nstarch free trilayer. The visible evidence of this porosity can be seen in figure 2b, for the sintered \nstarch free FGM tape. Here the porosity is situated at the triple points of the grains, an \nobservation reported in previous work12 for sintered PMNZTU. \n \nAs expected, the effect of increasing the porosity has produced a reduction in the values of both ε \nand p.  There is a good deal more scatter in the results from the electrical measurements for the \n1:1:1 relative to the 1:2:1 architectures.  This may be a consequence of the greater difficulty of \n“fixing” the porosity in the thinner porous layer during processing, and of being certain about the \nvalue of the porosity in these thinner layers.  The 1:2:1 materials showed much better \nconsistency.   \n \nThe proportional reduction in ε has been shown to be greater than p so the p\/ε value shows an \nincrease for the porosity range investigated. \nIn terms of the uniformity of poling across the different layers of the FGM structure, the poling \nfields dropped across the individual layers should be proportional to the resistivity, and in turn \nshould be proportional to the volume fraction.  However, as the poling field was applied for a \nlong time, and was about three times the size of the coercive field for the PMNZTU ferroelectric \n 10 \nmaterial (which is ~10KV\/cm), then the small differences in the resistivity should make no \ndifference to the degree of poling in each layer. \nThe observed effects on the electrical properties can easily be modelled, but first we have to \ncalculate the porosity of the porous layer, from the average porosity and the observed ratio of \nporous layer thickness tL to the total ceramic thickness (T=2tC+tL) – see figure 1.  We can put the \nfractional thickness of the porous layer as fL=tL\/T (fL=0.25 for the 1:1:1 and 0.4 for the 1:2:1 \narchitectures – see above).  Then it is easy to show that the porosity of the porous layer is: \n \n)(1 CA\nL\nCL PPfPP −+=       (2) \nHere, PC is the porosity of the “dense” ceramic (0.042), and PA is the measured porosity of the \nFGM structure as a whole. Similarly, we can calculate the relative permittivity of the porous \nlayer (εL) as: \n)1( LAC\nLAC\nL f\nf\n−−\n=\nεε\nεε\nε        (3) \nHere, εA is the measured dielectric permittivity of the FGM structure as a whole. \nThe 33Hz relative permittivity data presented in Figure 5 can now be manipulated to give the \nrelative permittivity of the porous layer and then plotted as a function of porous layer relative \npermittivity.  The results are presented in Figure 9, and it can be seen that the PL values range up \nto ~0.28.  Wersing et al13 have analysed in some detail the effects of porosity on the relative \npermittivity of PZT-type ceramics, and have concluded that, of the many different models \ndeveloped by other workers, the formula presented by Bruggeman14 gives the best description of \nthe relative permittivity behaviour.  For values of PL up to 0.6, this can be approximated by: \n 11 \n)\n2\n31( LDL P−= εε         (4) \nAnd similarly: \n)\n2\n31( CDC P−= εε         (4a) \nWhere εD is the relative permittivity of a fully-dense ceramic. \n \nThe line predicted by the Bruggeman formula is presented in Figure 9 and can be seen to be in \nexcellent agreement with the observations.  Using equations (4) and (4a) to replace εL and εC in \nequation (3) results in equation (5), which predicts the average relative permittivity of a FGM of \nthis type. \n \n)]1([\n2\n31\n)\n2\n31)(\n2\n31(\nLLCL\nLCD\nA\nfPPf\nPP\n−+−\n−−\n=\nε\nε       (5) \n \nA full theoretical treatment of the pyroelectric coefficient of a functionally graded bimorph \n(rather than a trimorph) structure consisting of two layers of pyroelectric ceramic with different \ndielectric and pyroelectric properties has been presented by Pintille et al15.  However, this makes \nseveral assumptions which are not applicable to the ceramics used here.  In particular, their \nmodel assumes that there are no mobile charges in the ceramic.  In the materials used in this \nwork, the inclusion of the uranium dopant is specifically added to generate low levels of mobile \ncarriers, to reduce the electrical conductivity2,9.  In this work, the value of the average \npyroelectric coefficient (pA) for the functionally-gradient material can be approximated by simply \n 12 \nplacing pA as being proportional to the volume of pyroelectric material between the electrodes \n(pA=pD(1-PA) where pD is the pyroelectric coefficient of a fully dense ceramic).  The resulting \nprediction for the variation of pA is shown as the dashed line in Figure 7.  Again, over the range \nof porosities explored, there is excellent agreement between this simple model and the \nexperimental results.  This line is within experimental error of the trend-line obtained by fitting a \nstraight line to all the pA vs. PA data. \n \nWe now have theoretical models for the relative permittivity and pyroelectric coefficients of the \nFGM.  To get the pyroelectric voltage figure-of-merit, we can model the average volume specific \nheat as simply being determined by the amount of ceramic in the structure, so that: \n \n)1(' ADPA Pcc −= ρ        (6) \n \nWhere, cP is the mass specific heat of the ceramic and ρD the theoretical density.  \n \nA theoretical model can now be presented for the FV of a FGM pyroelectric ceramic as: \n \n)\n2\n31)(\n2\n31(\n)]}1([\n2\n31{\n0 LCDDP\nLLCLD\nA\nV\nPPc\nfPPfp\nF\n−−\n−+−\n=\nεερ\n     (7) \n \nFigure 10 shows the values of FV calculated for the FGM using the measured dielectric and \npyroelectric properties, and assuming c’A is determined by equation 6 and using a value of 0.375 \n 13 \nJg-1K for cP as previously-determined for bulk PMNZTU.  Also plotted on this figure is a dashed \nline representing the theoretical prediction from equation 7.  There is good agreement between \nthe two.  Note that the theoretical prediction line is not a fit of a straight line to the experimental \ndata, but is a first-principles prediction based on the knowledge of the electrical properties of the \nsintered materials and the experimentally-determined structural properties of the material. \n \nIt can be seen that the FGM has a considerably-improved pyroelectric figure-of-merit relative to \nthe uniformly-dense ceramic – a factor of about 20% for the experimentally most-porous FGM \nrelative to a uniform one with 4.2% porosity.  Equation 7 can now be used to predict the \nproperties of other structures.  It would predict that the most porous structure measured should \nhave had a 31% improvement relative to a fully-dense ceramic of the same composition, while \nfor example, increasing the fractional thickness of the porous layer (fL) to 0.60, while \nmaintaining its porosity at the highest level (27%) should increase the fractional improvement in \nFV relative to the dense material by 41%.  These would be very useful increases if translated \ndirectly into pyroelectric infra-red detector performance. \n \nThis work is not the only work to consider the use of porous pyroelectric materials, but it is quite \ndifferent from previous work.  In the earlier work by De Cicco et al7, a completely different \ngeometry of pyroelectric material was investigated involving buried interdigitated electrodes \nsurrounded by uniformly porous PZT layers, which yielded improvements in figure of merit \nvalues when compared with dense bulk PZT. For our FGM’s, the dense-porous-dense \narchitecture was advantageous in that dense ceramic skins were needed to facilitate the \n 14 \nconventional surface-electroding used in pyroelectric infra-red detectors. This also conferred \nstrength to the structure.  \n \nA further advantage of the structure presented here, in terms of pyroelectric device operation, is \nthat the porous layer should present a thermal barrier to the heat signal entering at the “front” of \nthe device structure, and it is proposed that the use of the dense layers on the outside of the \nstructure should maximise the charge response where the thermal change is at a maximum. \nPrototype IR sensors were fabricated using examples of FGM ceramics with 1:2:1 architectures \nand 5% and 30% porosities.  The former showed a 1Hz responsivity of 2.5x105 VW-1, which is \nvery similar to the average value from the response from a standard device using a conventional \nceramic.  The device made with higher porosity showed a responsivity of 3.2 x105 VW-1, which \nis a useful increase, and at 28 % is rather better than the simple theoretical ratio of figures-of-\nmerit (20%) would have suggested.  This could be because the porous layer is forming an \nintrinsic thermal barrier in the structure and warrants further investigation.   It is to be expected, \nif that were the case, that the improvement would be more-marked at higher modulation \nfrequencies, where the penetration of the thermal wave into the structure would be more-impeded \nby the porous layer.  This represents work in-progress. \n \nConclusions \n \nIt has been shown that functionally-graded pyroelectric materials which have a controlled porous \nlayer sandwiched between two dense layers can be made using tape-casting processes employing \nstarch particles as porosity-inducing agents.  The dielectric and pyroelectric properties of these \n 15 \nmaterials have been characterised and it has been shown that the inclusion of the porous layer has \nthe effect of reducing average relative permittivity and pyroelectric coefficient, and increasing the \np\/ε ratio.  Taking the reduction in average volume specific heat into consideration, it has been \ndemonstrated that at least a 20% improvement in the pyroelectric voltage figure of merit can be \nobtained by inclusion of the thermal layer.  Theoretical analysis of the dielectric data has shown \nthat the relative permittivity of the porous layer is very well described by the Bruggeman model \nand it has been demonstrated that the dependence of the pyroelectric coefficient on the average \nporosity is well-described by assuming that it is proportional to the volume fraction of \npyroelectric material between the electrodes.  The models for the pyroelectric, dielectric and heat \ncapacity have been combined to give a model for the voltage figure of merit in terms of the bulk \nproperties and the porosity and thickness of the porous layer.  The resulting model shows good \nagreement with the experimental data and has been used to predict that it should be possible to \nmake FGM pyroelectric ceramics of this type with a 40% improvement in FV.  Preliminary \nexperimental measurements on infra-red detectors made using the FGM pyroelectrics have \nshown an increase in voltage responsivity which is slightly better than that predicted by the \nsimple theory.  This could be due to the porous layer acting as a thermal barrier in the structure. \n \nAcknowledgements \n \nThe technical contribution of Mr. Paul Osbond and Dr. Chris Carter in making and measuring the \nIR sensors using the FGM samples is very gratefully acknowledged. \n \n \n 16 \nReferences \n \n1D, J. Berlincourt, ”Piezoelectric Ceramic Compositional Development”, Acoust. Soc. Am., 91 \n3034-3040 (1992). \n2R. W. Whatmore, ”High-Performance, Conducting Pyroelectric Ceramics”, Ferroelectrics, 49 \n[1-4] 201-210 (1983). \n3R. W. Whatmore, ”Ferroelectrics, Microsystems and Nanotechnology”, Ferroelectrics, 225 [1-4] \n985-998 (1999). \n4R. W. Whatmore, ”Pyroelectric Ceramics and Devices for Thermal Infrared Detection and \nImaging”, Ferroelectrics,118 241-259 (1991). \n5J. C. Williams, “Ceramic Fabrication Processes”; pp. 173-98 in Treatise on Material Science \nand Technology, Vol. 9. Edited by F.F.Y Wang, Academic Press, New York, 1976. \n6N. W. Schubring, J. V. Mantese, A. L. Micheli, A. B. Catalan and R. J. Lopez, ”Charge \nPumping and Pseudopyroelectric Effect in Active Ferroelectric Relaxor-Type Films”, Phys. Rev. \nLet., 68 [11] 1778 (1992). \n7G. De Cicco, B. Morten, D. Dalmonego and M. Prudenziati, “Pyroelectricity of PZT-based \nThick-films”, Sensors and Actuators, 76 [1-3] 409-415 (1999).  \n8E. H. Putley, “The Pyroelectric Detector”; pp. 259-285 in Semiconductors and Semimetals, Vol. \n5, Ch. 6. Edited by R.K Willardson and A.C Beer, Academic Press, New York, 1970. \n9S. B. Stringfellow, S. Gupta, C. P. Shaw, J. R. Alcock and R. W. Whatmore, ”Electrical \nConductivity Control in Uranium-Doped PbZrO3–PbTiO3–Pb(Mg1\/3Nb2\/3)O3 Pyroelectric \nCeramics ”, J. European Ceramic Society, 22 [4] 573-578 (2002). \n 17 \n10A. Kristoffersson and E. Carlstrom, ”Tape Casting of Alumina in Water with an Acrylic Latex \nBinder”, J. European Ceramic Society, 17 [2-3] 289-297 (1997). \n11R. L. Byer and C. B. Roundy, ”Pyroelectric Coefficient Direct Measurement Technique and \nApplication to a Nsec Response Time Detector”, Ferroelectrics, 3 [2-3] 333 (1972). \n12L. Mortara, A. Navarro, R. W. Whatmore and J. R. Alcock, “Correlation of Sintered \nMicrostructure with Green Density in Thick-Film PZT”, pp. 309-12 in Key Engineering \nMaterials,Vol. 264-268, Euro Ceramics VIII Parts 1-3. Edited by H. Mandal and L. Ovecoglu, \n2004.  Proceedings of the 8th Conference and Exhibition of the European Ceramic Society, \nIstanbul, Turkey, 2003. Trans Tech Publications Inc., Zurich. \n \n13W. Wersing, K. Lubitz and J. Mohaupt, ”Dielectric, Elastic and Piezoelectric Properties of \nPorous PZT Ceramics”, Ferroelectrics, 68 [1-4] 77-97 (1986). \n14D. A. G. Bruggeman, “Calculating Different Physical Constants of Heterogeneous Substances”, \nAnnln. Phys-Leipzig, 24 636 (1935). (“Berechnung Verschiedener Physikalischer Konstanten \nvon Heterogenen Substanzen”, Annalen Der Physik). \n15L. Pintille, I. Pintille and I. Matei, ”Equivalent Pyroelectric Coefficient of a Pyroelectric \nBimorph Structure”, J. Appl. Phys.,88 [12] 7264-7271 (2000).\n 18 \n \n \nTable I.  Composition of the Dried Starch Free \nSamples \nSolid Component Volume (%) \nPMNZTUa            60.1 \nDispex A40b            12.2 \nLatexc            26.1 \nSurfynol SE-Fd              1.6 \naDoped lead zirconium titanate, Cranfield University, \nUK. bAllied Colloids, Bradford, UK. cMowilith \nLDM7651S, Celanese Emulsions, Norden AB, \nDenmark. dAir Products and Chemicals, Utrecht, \nNetherland. \n \n 19 \n \nTable II.  Density and porosity of sintered FGM samples \nCodea Bulk Density (gcm-3) Relative Density (%) Porosity (%)b \nFGMA0 7.83 95.8         4.2 \nFGMA5 7.67 93.9         6.1 \nFGMA10 7.76 94.9         5.1 \nFGMA20 7.32 89.6       10.4 \nFGMA30 7.50 91.8         8.2 \n    \nFGMB5 7.71 94.4         5.6 \nFGMB10 7.46 91.3         8.7 \nFGMB20 7.33 89.7       10.3 \nFGMB30 7.09 86.8       13.2 \naCode Format:FGMA and FGMB samples have 1:1:1 and 1:2:1 architectures respectively. The number  \nindicates the starch vol.% in the dried green tape used for the middle layer. \nbPorosity=(100-Relative Density) \n 20 \n \nFig. 1.  Schematic cross-section of functionally graded \npyroelectric ceramic material showing the relative \nthicknesses(t) of dense and porous layers and their \nporosities(P) and permittivities(ε).\nDense Ceramic Porous Ceramic\ntC\ntC\ntLT\nPC\nPC\nPL\nεC\nεL\nεC\n 21 \n \nFig. 2. SEM images of a fracture surface of a trilayer\nsintered PMNZTU material where the center layer had \nzero added starch (sample FGMAO). \n100µm\n20µm\n 22 \n \nFig. 3.  SEM images of fracture surface for sample \nFGMA30 (a 1:1:1 structure) showing: a) Full cross-\nsection, b) Porous region, and c) Dense region.\na\nb\nc\n100µm\n20µm\n5µm\n 23 \n  \nFig. 4.  SEM images of fracture surface for sample \nFGMB30 (a 1:2:1 structure) showing: a) Full cross-\nsection, b) Porous region, and c) Dense region.\na\nb\nc\n100µm\n20µm\n5µm\n 24 \n \n180\n200\n220\n240\n260\n0 5 10 15\n(1:1:1) (1:2:1)\nFig. 5. Plot of relative permittivity versus average \nporosity.\nAverage Porosity(%)\nεε\n 25 \n \n0.000\n0.005\n0.010\n0.015\n0.020\n0.025\n0 5 10 15\n(1:1:1) (1:2:1)\nAverage Porosity(%)\nT\na\nn\n \nδ\nFig. 6. Plot of dielectric loss (Tan δ) versus average \nporosity. \nT\na\nn\n \nδ\nT\na\nn\n \nδ\n 26 \n \n2.5\n2.6\n2.7\n2.8\n2.9\n3.0\n3.1\n3.2\n0 5 10 15\nFig. 7. Plot of average pyroelectric coefficient versus \naverage porosity for the 1:1:1(♦) and 1:2:1(■) samples.  \nThe dashed line gives the predicted value of the \npyroelectric coefficient assuming that it is simply \nproportional to the amount of pyroelectric material \nbetween the electrodes. \nAverage Porosity(%)\nA\nv\ner\nag\ne \nPy\nro\nel\nec\ntr\nic\nCo\nef\nfic\nie\nn\nt(1\n0-\n4\nCm\n-\n2K\n-\n1)\nA\nv\ner\nag\ne \nPy\nro\nel\nec\ntr\nic\nCo\nef\nfic\nie\nn\nt(1\n0-\n4\nCm\n-\n2K\n-\n1)\n 27 \n \n1.20\n1.25\n1.30\n1.35\n1.40\n0 5 10 15\nFig. 8. Plot of ρ\/ε versus average porosity for the \n1:1:1 (♦) and 1:2:1 (■) samples.\np\/\nε\n(10\n-\n6\nCm\n-\n2 K\n-\n1 )\nAverage Porosity(%)\np\/\nε\n(10\n-\n6\nCm\n-\n2 K\n-\n1 )\n 28 \n \n100\n150\n200\n250\n300\n0 10 20 30\nPorosity of Layer(%)\nPe\nrm\nitt\niv\nity\nFig. 9. Showing the variation of porous layer relative \npermittivity with porous layer porosity for the 1:1:1 (♦) \nand 1:2:1 (■) samples.  The dashed line gives the \npredicted value of relative permittivity with layer \nporosity according to the Bruggeman formula. \nPe\nrm\nitt\niv\nity\n 29 \n \n0.040\n0.045\n0.050\n0.055\n0.060\n0 5 10 15\nAverage Porosity(%)\nF v\n(V\nm\n2 J\n-\n1 )\nFig. 10. Values of Fv(Voltage Figure of Merit) at \n33Hz versus Average Porosity calculated from the \ndata obtained from the 1:1:1 (♦) and 1:2:1 (■) \nsamples.  The dashed line represents the prediction \nfrom the theoretical model presented in the paper \n(equation 7).\nF v\n(V\nm\n2 J\n-\n1 )\n"}