{"doi":"10.1017\/S0022046900011349","coreId":"69837","oai":"oai:eprints.lancs.ac.uk:20981","identifiers":["oai:eprints.lancs.ac.uk:20981","10.1017\/S0022046900011349"],"title":"Gerard of Nazareth, John Bale and the origins of the Carmelite Order.","authors":["Jotischky, Andrew"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1995-04","abstract":"Describing the general condition of the Latin Church in Outremer in the 1220s, Jacques de Vitry enumerated, as examples of those who had chosen the religious life, the hermits of Mt Carmel: Others, following the example and imitation of the holy solitary Elijah the Prophet, live on Mt Carmel, especially on the part which overlooks the city of Porphyria, which today is called Cayphas [Haifa], near the spring which is called the spring of Elijah, and not far from the monastery of the Blessed Virgin Margaret. They lead a solitary life in small cells as in a hive; like the bees of the Lord they gather the honey of spiritual sweetness","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69837.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/20981\/1\/download.pdf","pdfHashValue":"4a367fd974ab0acb6d1323cd912fce998d7e55ed","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:20981<\/identifier><datestamp>\n      2018-01-01T03:45:22Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D44:4431<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Gerard of Nazareth, John Bale and the origins of the Carmelite Order.<\/dc:title><dc:creator>\n        Jotischky, Andrew<\/dc:creator><dc:subject>\n        D History (General)<\/dc:subject><dc:description>\n        Describing the general condition of the Latin Church in Outremer in the 1220s, Jacques de Vitry enumerated, as examples of those who had chosen the religious life, the hermits of Mt Carmel: Others, following the example and imitation of the holy solitary Elijah the Prophet, live on Mt Carmel, especially on the part which overlooks the city of Porphyria, which today is called Cayphas [Haifa], near the spring which is called the spring of Elijah, and not far from the monastery of the Blessed Virgin Margaret. They lead a solitary life in small cells as in a hive; like the bees of the Lord they gather the honey of spiritual sweetness.<\/dc:description><dc:date>\n        1995-04<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/20981\/1\/download.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0022046900011349<\/dc:relation><dc:identifier>\n        Jotischky, Andrew (1995) Gerard of Nazareth, John Bale and the origins of the Carmelite Order. The Journal of Ecclesiastical History, 46 (2). pp. 214-236. ISSN 0022-0469<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/20981\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0022046900011349","http:\/\/eprints.lancs.ac.uk\/20981\/"],"year":1995,"topics":["D History (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Journal of Ecclesiastical History, Vol. 46, No. 2, April 7995\nCopyright © 1995 Cambridge University Press\nGerard of Nazareth, John Bale and\nthe Origins of the Carmelite Order\nby ANDREW JOTISCHKY\nD escribing the general condition of the Latin Church in Outremerin the 1220s, Jacques de Vitry enumerated, as examples of thosewho had chosen the religious life, the hermits of Mt Carmel:\nOthers, following the example and imitation of the holy solitary Elijah the\nProphet, live on Mt Carmel, especially on the part which overlooks the city of\nPorphyria, which today is called Cayphas [Haifa], near the spring which is\ncalled the spring of Elijah, and not far from the monastery of the Blessed Virgin\nMargaret. They lead a solitary life in small cells as in a hive; like the bees of the\nLord they gather the honey of spiritual sweetness.1\nThe phenomenon of eremitical monasticism in western Europe in the\neleventh and twelfth centuries has been studied extensively,2 but little\nmaterial has been found that might shed light on the foundation of\neremitical communities by Franks in the Latin East. In 1983, however,\nBenjamin Kedar rescued from obscurity the surviving fragments of the De\nconversatione servorum Dei, a compilation of biographies of contemporary\nhermits and monks by the twelfth-century bishop of Laodicea, Gerard of\nNazareth, who had himself been a hermit and a Benedictine monk.\nGerard's work had been known earlier only in selected abbreviated\nportions in the compendium of church history published by the\nCenturiators of Magdeburg in Basle between 1562 and 1574.3\n1\n Jacques de Vitry, 'Historia Hierosolymitana', LII, in J. Bongars (ed.), Gesta Dei per\nFrancos, Hanau 1611, i. 1075.\n2\n See for example Jean Leclercq, 'La crise du monachisme aux xie et xiie siecles',\nBullettino deWInstitute storico Italiano per il media evo lxx (1958), 19-41, Derek Baker,\n'Crossroads and crises in the religious life of the later eleventh century', in idem (ed.), The\nChurch in the town and countryside (Studies in Church History xvi, 1979), 137-48, and\nespecially Henrietta Leyser, Hermits and the new monasticism, New York 1984.\n3\n B. Z. Kedar, 'Gerard of Nazareth, a neglected twelfth-century writer of the Latin\nEast: a contribution to the intellectual history of the Crusader States', Dumbarton Oaks\nPapers xxxvii (1983), 55-77; Matthias Flacius Illyricus and others, Duodecimo centuria (vol.\nvi of Ecclesiasticae historiae, integram Ecclesiae Christi ideam... secundam singulas centurias perspicuo\nordine complectens, 7 vols, Basle 1562-74).\n214\nORIGINS OF THE CARMELITE ORDER\nDespite its fragmentary survival, Gerard's De conversatione is, as Kedar\nhas shown, important evidence both for the intellectual activity of a Latin\nbishop in twelfth-century Syria and for the character of Latin monastic\nfoundations in Outremer. Besides the De conversatione, Gerard is also\nknown to have written a separate life of Elias of Narbonne, abbot of\nPalmaria in Galilee, a sermon to the nuns of St Lazarus in Bethany, a\ntreatise on the identity of Mary Magdalene contra Graecos, and a defence\nof his views on this subject against a priest called Sala, fragments of which\nwere also preserved by the Centuriators.4 This output suggests that\nWilliam of Tyre was not unique among Latin bishops of Outremer for his\nintellectual endeavours. The De conversatione and Vita abbatis Eliae are\nparticularly valuable. Although some cartularies from the great Latin\nmonasteries of the Crusader States survive,5 there is very little extant\nnarrative material relating to the general condition of monasteries or the\nnature of the monastic settlement in the Holy Land. The biographies in\nthe De conversatione are, in most cases, no more than character sketches of\nmonks and hermits Gerard knew personally or by reputation between\nc. 1120 and c. 1160, but they provide engrossing details about the types of\nmonasteries being founded in the second and third generations of the\nFrankish conquest, and about the individual enterprises of men drawn to\nthe monastic life in the Holy Land. The religious life of the Crusader\nStates can thus be fitted into the context of the monastic reform movement\nof the late eleventh and twelfth centuries in the west.6\nThe fragments of the De conversatione preserved by the Centuriators do\nnot quite represent the total extent of our knowledge of Gerard. Kedar\nfound a further passage of the De conversatione cited in three fourteenth-\ncentury treatises by Carmelite monks: Philip Ribot's De institutione et\npeculiaribus gestis religiosorum Carmelitarum (c. 1370), the Informatio circa\noriginem, institutionem et confirmationem Ordinis Fratrum Beatae Virginis Mariae\nde Monte Carmelo of Bernard Ollerius (fl. 1375—83) and the Dyalogus inter\ndirector em et detractorem de ordine Carmelitarum of John of Hildesheim (d.\n1375).' The use of Gerard's work by Carmelite apologists raises important\nquestions about the self-perception of the order. By introducing further\nevidence of the use of Gerard of Nazareth by a Carmelite with proven\nconnections with the Centuriators of Magdeburg, the sixteenth-century\n* Ibid. 923, 1230-3, 1380, 1603; edited by Kedar, 'Gerard of Nazareth', 75-7.\n5\n For example Le cartulaire du Saint-Sepulchre, ed. G. Bresc-Bautier, Paris 1984; Charles de\nTerre-Sainte provenant de I'abbaye de Motre-Dame de Josapkat, ed. H.-F. Delaborde, Paris 1880;\nChartes de I'abbaye de Mont-Sion, ed. E.-G. Rey (Mdmoires de la Socie'te Nationale des\nAntiquaires de France 5th ser. viii, 1899).\n8\n See A. T. Jotischky, 'The breath of the dove: hermits and eremitical monasticism in\nthe Holy Land 1095-1291', unpubl. PhD diss. Yale 1991, 16-63.\n7\n These works are most accessible in the editions of Daniel a Virgine Maria, in his\ncollection Speculum Carmelitanum, 4 pts, Antwerp 1680, pt 1, 1-128, pt 11, 145-56, 166-71.\nThe treatise Contra Salam presbyterum is corroborated by a mention in an independent\nsource, the Defensorium of the Carmelite John Hornby against the Dominican John Stokes:\nOxford, Bodleian Library, MS e Musaeo 86, fo. 202r.\n215\nANDREW JOTISCHKY\nEnglish antiquarian and polemicist John Bale, I hope in this article to\nclarify some of the problems in Carmelite historiography, and to show\nhow apparently untrustworthy material can be used to further our\nknowledge of eremitical monasticism in the Latin East.\nThe historical accounts presented by Carmelite authors were informed\nby a specific agenda. Primarily, they wanted to establish credible evidence\nfor the foundation of the order by Elijah and the unbroken continuity of\nan eremitical settlement on Mt Carmel from the 'minor prophets' and\ntheir chosen successors until their conversion to Christianity by the\napostles and the influx of new hermits in the fourth century. Occupation\nof Mt Carmel by hermits following the same tradition was held to have\ncontinued until the fall of the Crusader Kingdom in 1291, by which time\nthe hermits had expanded beyond their original site to settle all over\nEurope.8 There is no contemporary evidence for such a coherent\nsettlement for any period before the beginning of the thirteenth century.\nThe Carmelite Order was recognised by Pope Honorius in in 1226, with\nthe confirmation of the Rule that had been written for a group of hermits\non Mt Carmel by Albert of Vercelli, patriarch of Jerusalem (1205-14).\nThe reform of the Rule of St Albert in 1248, endorsed by Pope Innocent\niv, allowed the Carmelites to practise a mendicant rather than eremitical\nprofession.9 The apologies of Carmelite historians, especially Ribot, were\nwritten to counter the hostility encountered by Carmelites from the 1240s\nonward (the period of expansion into Europe) at the hands of the\nepiscopal hierarchy and the rival mendicant orders. The most significant\naspect of the Carmelite historical claims was thus the attempt to prove\nthat the original 'Carmelites' of the Old Testament and early Christian\nperiods had followed a way of life inspired by the career of Elijah, who was\nboth a solitary hermit and a preacher, and that the modifications to the\nRule represented the profession of the original Carmelites more closely\nthan the simple rule of St Albert.10\nThe twelfth-century origins of the Carmelite Order are still entangled\nin the web woven by Ribot, and other Carmelite historians from the\nfourteenth century to the present day. Modern scholars have been\ndeterred by the historiographical problems implicit in a study of the\nCarmelite foundation. The earliest surviving accounts from within the\norder were written 150 years after the papal confirmation of the order in\n1226, and must be understood in the context of the course of Carmelite\nsettlements in Europe. In 1374, at roughly the time that Ribot, Bernard\nand John of Hildesheim were writing, a debate was held between a\n8\n No scholarly study has yet been written on the transformation of the hermits of Mt\nCarmel into an international order of friars. For an introduction to the topic, see Jotischky,\n'Breath of the dove', 214-97. The origins of the foundation on Mt Carmel have been\nstudied by Elias Friedman, The Latin hermits of Mount Carmel, Rome 1979. For the Carmelite\nsettlement in England, see K. J. Egan, 'An essay toward the historiography of the origin\nof the Carmelite Province in England', Carmelus xix (1972), 67-100.\n9\n Les registres ilnnocent IV, ed. E. Berger, Paris 1884-1921, i, nos 3287-8.\n10\n Ribot, De institulione, passim.\n2 l 6\nORIGINS OF THE CARMELITE ORDER\nCarmelite and a Dominican doctor of theology at the University of\nCambridge on the antiquity of the Carmelite Order: the Dominican\nderided the Carmelites as newcomers, while the Carmelite maintained the\nElianic foundation of the order and the continuous presence on Mt\nCarmel until 1291. The chancellor of the university awarded the debate\nto the Carmelite.11 That such a matter was a fit subject for academic\ndebate reveals something of the suspicions of rival orders about the\nCarmelites' own account of their origins. St Francis and St Dominic were\nwell-documented figures about whom contemporary or near-contem-\nporary accounts survived, but the Carmelites were still, more than a\nhundred years after their appearance in England, an unknown quantity.\nThey had no charismatic founder for whom miracles could be claimed,\nand they came from a land long since lost to Christendom. Their claims\nto possess a Rule composed in the fifth century and updated in the twelfth,\nand thus to be an older order than the pre-eminent mendicants, the\nFranciscans and Dominicans, seemed highly contentious. Ribot and his\nfollowers were writing to counter such suspicions. A parallel to the\nCambridge debate, the Dyalogus of John of Hildesheim, shows a Carmelite\nfriar turning the objections of a detractor (who appears to be a friar of\nanother order) into an opportunity to expound the Carmelite view of Old\nTestament and early Christian history.\nA more direct connection can now be established between the work of\nCarmelite apologists and the Centuriators who preserved Gerard of\nNazareth's De conversatione through the person of John Bale, and by\nextension also between Gerard of Nazareth and his hermits and the\norigins of the Carmelite Order. A manuscript at Oxford in the hand of\nJohn Bale, who was prior of the Carmelite house at Norwich before going\nover to the Reformation in 1533, includes a treatise on the chronology of\nthe Carmelite Order which also mentions Gerard of Nazareth and lists the\nhermits who formed the subjects of the De conversatione servorum Dei}2 The\ntreatise, entitled Cronica seufascicula temporum ordinis Carmelitarum, is part of\na collection of miscellaneous Carmelite material, mostly historical or\napologetical, either copied or edited by Bale out of other sources. Bale's\nbiographer, L. P. Fairfield, called it 'a systematic collection of notes, the\nspadework for a full-scale history of the Carmelite Order'.13 Bale himself\ndisclaims the originality of the Cronica, supplying as sources the names of\nthe Carmelite authors Giles Faber, Laurence Burellus, John Paleony-\ndorous, Arnold Bostius, Nicholas Harlemensis and Julian Basart. The\nCronica thus reflects existing Carmelite traditions about the order's origins\n11\n Cambridge UL, MS Ff 6, n , fo. 27v-r, summarised in Arnold Bostius's De illustribus\nviris ordinis fratrum bealissime virginis Marie de monte Carmelo, ed. C. Jackson-Holzberg, ^wei\nLiteraturgeschichten des Karmelitenordens, Erlangen 1981, 154-5. The defence of the Carmelite,\nJohn Hornby, was later copied into the collection known as Fasciculi £izianorum, Oxford,\nBodl. Lib., MS e Musaeo 86, fos 176V-21 ir.\n12\n Bodl. Lib., MS Selden Supra 41, fos iO7r-g6r.\n13\n L. P. Fairfield, John Bale: mythmakerfor the English Reformation, West Lafayette 1976,\n28.\n217\nANDREW JOTISCHKY\nrather than creating them. It was written between c. 1527 and 1533, but\nBale returned to the Cronica after his conversion to write a further two\npages that are distinctly Protestant in tone.14 In any case, the material\nrelating to Gerard of Nazareth was compiled about thirty years before the\npublication of the first volume of the Centuriators' Ecclesiasticae historiae.\nBale's Cronica follows the tradition of Carmelite history-writing, of\nwhich Philip Ribot was the most sophisticated exponent, by attempting\nto establish, on the basis of existing sources, a 'Carmelite genealogy',\nbeginning with Elijah and ending with the priors-general of his own day.\nThe Cronica is less a history than a catalogue of individual Carmelite\n'Fathers'. Each such figure Bale placed in a red circle, accompanied by\na few words, a date and sometimes a longer supplementary passage of\nhistorical notes. The 'genealogy' is thus an ecclesiastical counterpart to\nthe genealogical rolls of kings, but in book rather than roll form. Lesser\nfigures, or events with only an incidental connection to the development\nof the order, are placed on the bottom half of each page. Gerard of\nNazareth and the list of his hermits merit almost a page of these notes for\nthe mid twelfth century. He is not claimed specifically by Bale as a\nCarmelite 'father', but as someone associated with the growth of the\norder, at a time when, as we shall see, independent evidence for eremitical\nsettlement on Mt Carmel is just beginning.\nNo manuscripts of Gerard's De conversatione are known to survive; it is\ntherefore impossible to know for certain the source of either Bale's or the\nCenturiators' knowledge of his material. Bale's works, however, have been\nstudied so comprehensively by scholars of the Reformation that it is\npossible to reconstruct his archival research in the years before 1533 from\nfour of his own manuscript notebooks. John Bale was born in Suffolk in\n1495 and had entered the Carmelite convent at Norwich by 1507.\nBetween 1514 and 1523 he was a student at Cambridge, during which\nperiod he was ordained to the diaconate; in the 1520s he was ordained\npriest and continued his studies, spending in addition a good deal of time\nresearching Carmelite history in the libraries of various houses of the order\nin England, France and the Low Countries.15 The earliest manuscripts in\nhis hand reflect this conventional pattern; Cambridge UL, MS Ff. 6. 28 is\na collection of saints' lives and Carmelite offices made while Bale was a\nstudent, between 1514 and 1523, and Oxford, Bodleian Library, MS\nSelden Supra 72 is a set of scribal exercises set by Bale for younger students,\nprobably while he was himself an advanced student in the Carmelite\nhouse at Cambridge.16 Neither manuscript contains material relating to\n14\n Ibid. 160-1. The full discussion on the dating of Bale's manuscripts is on pp. 157-64.\nSee also the chronological list of Bale's works compiled by W. T. Davies: 'A bibliography\nof John Bale' (Oxford Bibliographical Society Proceedings and Papers v, 1936-9), 203-79\nat pp. 240-3. 16 Fairfield, John Bale, 1-15.\n16\n Ibid. 8, for Bale as the instructor of younger students. Selden Supra 72 includes a list\nof Carmelite priors-general and extracts copied from the works of two earlier Norfolk\nCarmelites, John Baconthorpe and Robert Bale.\n218\nORIGINS OF THE CARMELITE ORDER\nGerard of Nazareth. The next two manuscripts in Bale's hand consist of\nnotebooks compiled during his research trips in the years between 1522—3\nand 1528: Oxford, Bodl. Lib., MS Bodley 73 was made primarily in\nEngland and the Low Countries, and BL, MS Harley 1819 in England and\nFrance.17 The material in both is a miscellany of notes on Carmelite\nhistory, extracts from treatises, some of which were presumably\nunavailable in English Carmelite libraries, and catalogues of notable\nCarmelite friars, such as a list of those Carmelites who had taken a higher\ndegree in theology in Paris. There is little internal coherence to these\nnotebooks, and no attempt to organise the material according to archival\nprinciples, but marginal entries are used to indicate the house where Bale\nread and noted specific works, making it possible to retrace his research\nitinerary. In neither of these notebooks, however, does he record his\nreading of Gerard of Nazareth's De conversations or any work mentioning\nor paraphrasing it. There is thus no trace of Gerard in any of Bale's\nreading before his appearance in the Cronica in Selden Supra 41 between\n1527 and 1533. It may be assumed either that he had heard or read of\nGerard as a boy in the Norwich convent, and that Gerard had become so\ndeeply ingrained in his historical memory that he did not need to make\nnotes when he revisited the Norwich Carmelite library in 1527-8, or that\nhis knowledge of Gerard represents an oral tradition, perhaps learned\nabroad, the source of which he did not note down.\nThe failure to record the circumstances of his reading, or hearing about\nGerard of Nazareth is disappointing because it renders a putative\nconnection between Bale and the Centuriators speculative. A comparison\nof the list of hermits in the De conversatione servorum Dei from Bale's\nmanuscript with those in the Duodecimo centuria reveals certain disparities:\nMatthias Flacius Illyricus, Duodecimo, centuria, 1603—10:18\nA Jerusalem: Ralph, Alberic, Cosmas, John\nB Mt Tabor: Walter, Rainald of Galilee\nC Nazareth: Dominic, Bernard\nD Black Mountain: Bartholomew, Henry\nE Machanath: Bernard of Blois, Porphyry, William, Hugo, Walter, Hugo\nF Jubin: Ursus, Valerius\nG Carraria: John, Ralph, Sigerius\nH Palmaria: Elias\nJohn Bale, Cronica, MS Selden Supra 41, fo. 148V:\nHelias abbas (H) Bernardus Blesensis (E)\nGalfridus abbas Robertus Hierosolos. (E)\nDominicus de Nazareth (C) Bernardus patriarcha Hier.\nBernardus heremita (C) Porphirus monachus (E)\nCosmas ungarus (A) Ursus eremita (F)\n17\n Fairfield, John Bale, 158-9.\n18\n Kedar, 'Gerard of Nazareth', 71-5, gives the full entry for each hermit, which will\nnot be reproduced here. The groupings of hermits are as arranged in the Duodecimo centuria\nand Bale's Cronica, but the capital letters are mine.\n219\nANDREW JOTISCHKY\nRadulphus monachus (A) Guilelmus monachus (E)\nAlbericus monachus (A) Hugo monachus (E)\nBartholos. [sic] montane nigre (D) Walterus monachus (E)\nSegerius abbas (G) Valerius Burgundus (F)\nNicholas monachus Johannes solitarius (A) or (G)\nHenricus monachus (D) Johannes alius monachus (A) or (G)\nRainaldus Jordanis (B)\nBale's list has twenty-three names to Matthias's twenty-two, but\nincludes only one Ralph to Matthias's two, while Bale's Robertus\nHierosolos., Galfridus and Nicholas have no counterpart in Matthias.\nSince Bale does not divide his names according to region or monastery as\ndoes Matthias, it is hard to tell which John and Ralph he meant to\ninclude. The groupings of hermits, however, do seem to be significant.19\nBale's right-hand column contains eight successive hermits associated by\nGerard (through the Centuriators, at least) with the houses of Machanath\nand Jubin.20 As Gerard's entries for Bernard of Blois (which are scattered\nthroughout three chapters of the Duodecimo centuria but formed part of chs\nxvii, xviii, xix, xx of Gerard's work) make clear, the histories of the two\nhouses were closely linked.21 Bernard and Robert founded the priory of\nJubin, but a schism in the community forced them into exile in Jerusalem,\nwhere they obtained permission from the patriarch to enter Machanath.\nBy grouping all the monks from these two houses together, Bale may be\nrepresenting Gerard's original account of the Jubin\/Machanath affair,\nwhich was lost by Matthias's reorganisation. If this is so, we may assume\nthat the two Jubin monks, Ursus and Valerius, should in fact be taken\nwith the Machanath monks, and that all these should be identified as\nthose who took Bernard of Blois's side in the schism and left Jubin for\nMachanath. If such a reconstruction is valid, further identifications may\nbe made for those monks not mentioned by Matthias. Patriarch Bernard\n(whose presence is something of a mystery) may have been assumed by\nBale to have been a monk at Jubin and later Machanath.\nGerard included both members of communities and anchorites in his\nwork, though he refers to them indiscriminately as monks. Bale's left-hand\ncolumn appears to be made up largely of those of Gerard's hermits who\nlived a solitary life, with the apparently illogical additions of the abbots\nElias of Palmaria, Galfridus and Segerius. All the others were genuine\nsolitaries: Dominic and Bernard in Nazareth, Cosmas, Radulphus and\nAlbericus in Jerusalem, Henry and Bartholomew on the Black Mountain\nand Rainaldus on Mt Quadragesima. Nicholas, unknown to Matthias,\nmay also be surmised to have been a solitary, probably (to go with Henry)\non the Black Mountain. Johannes solitarius, near the bottom of the right-\n19\n I am grateful to Giles Constable for suggesting ways of studying the groups (in\nprivate correspondence).\n20\n R o b e r t u s Hiersolos. does no t a p p e a r on his own in the Duodecimo centuria, bu t mus t\nbe the same 'Robertus de Ierosolymis' given by Gerard as a companion of Bernard of\nBlois: Duodecima centuria, 1605.\n21\n Matthias, Duodecima centuria, 1605-6, 979, 1230; Kedar, 'Gerard of Nazareth', 72-3.\n220\nORIGINS OF THE CARMELITE ORDER\nhand column, refers to the John placed by Matthias at Jerusalem, who left\nhis monastery to live in a deserted abbey on the Black Mountain but was\nforced by hunger to return to Jerusalem.22 Bale's other John must\ntherefore be John of Carraria, who was presumably not listed with\nSegerius because much of his career was spent in solitude on the wooded\nslopes of Mt Tabor.23\nBale's cursory list, frustrating in its brevity, is followed by these notes\non five hermits:\nfo. 148V:\nDominicus de Nazareth, religiosus vir, cuius eius [sic] vestitus, talaris tunica de\ncandido vellere cum capucio, et altera brevior interius, cum caligulis.\nPorphirius monachus, cum tunica cilicina, et cuculla sine manicis, colore Candida,\nscil. vilis materia [sic].\n'Bartholomeus in montana nigra religionis habitum sumpsit'.\nfo.\nUrsus heremita devotus maria vigine [sic] sepius orare consuerit, non modico\nfervore.\nBernardus monachus patriarcha hierosolymitanus, vir plurime virtutis et decorus.\nOf Dominic, Gerard says that he was illiterate, but much admired for\nhis austerity. He lived in the atrium of a church on a bare floor, and was\nalways barefoot; he never laughed or spoke. Gerard himself offered to\nteach him elementary letters and how to read the Psalms, but he refused\nit as a waste of time. There is no mention of his habit.24 Porphyry, the\nsuccessor of Bernard of Blois at the convent of Machanath on the Black\nMountain, was perpetually barefoot and his feet unwashed. The\nvocabulary used by Gerard to describe his clothing is virtually identical\nto Bale's: 'Tunica usus est cilicina, et cucullo candido sine manticis'.25\nBale's note on Ursus's devotion to the Virgin Mary is extended in the\nCenturiators' extract from Gerard, who reported that Ursus had a habit\nof leaving his abbey (Jubin, also on the Black Mountain) and climbing to\nthe top of the mountain whenever troubled, shouting for the Lord and the\nBlessed Virgin to guide him.26 Bartholomew, according to Gerard, put\naside his wife and native land to go on pilgrimage to Jerusalem, where he\nbecame a Templar. He worked with another of Gerard's hermits, Alberic,\nin a lazar-house in Jerusalem before leaving for the Black Mountain,\nwhere he died.27\nBale's list adds three new names to the list of hermits already known\nfrom the Duodecima centuria: Galfridus abbas, Nicholas monachus and\nBernard, patriarch of Jerusalem. Galfridus and Nicholas may have been\ngenuine hermits known to Bale, but Bernard must surely be a mistake,\nsince nobody by that name is known to have become patriarch of\n22\n Matthias, Duodecima centuria, 1603. 23 Ibid. 1607-8. 24 Ibid. 1604.\n86\n Ibid. 1606. 26 Ibid. 1607. \" Ibid. 1605.\n221\nANDREW JOTISCHKY\nJerusalem. It is possible that Bale had in mind Bernard de Valence,\npatriarch of Antioch from uoo to 1135, though it is hard to see what\nconnection Bernard might have had to the eremitical life.28 Bale may have\nknown of a Carmelite tradition linking Bernard to the Black Mountain or\nto an eremitical foundation, but if so his source has yet to be discovered.\nIt is hard to believe that Gerard, a contemporary of Bernard's, could have\nmade such a mistake.\nThe similarity between the lists in the Cronica and the Duodecima centuria\nextends to the figure of Gerard of Nazareth himself. As Kedar has pointed\nout, Gerard was an important suffragan bishop of Aimery, patriarch of\nAntioch, and active in ecclesiastical affairs both in Antioch and Jerusalem.\nHe was present at the council deposing Ralph de Domfront, patriarch of\nAntioch, in 1140, and later at the submission of Reynaud de Chatillon to\nthe Emperor Manuel Comnenus at Easter 1159.29 Gerard's career is\nmentioned cursorily in the Duodecima centuria, but in remarkably similar\nterms to the words used by Bale in his introduction to the list of Gerard's\nhermits:\nMatthias Flacius Illyricus, Duodecima centuria, 1379-80:\nGerardus a Nazareth, patria Galileus, ordinis S. Benedicti monachus primum\nprope Nazareth, deinde apud Antiochiam Carmelitanae sectae eremitae, claruit\nanno 1140. ut ipse testatur cap 2. de conversatione servorum Dei. Tandem\nLaodicensis fit episcopus. In sacris literis eruditum fuit, philosophus et rhetor\ninsignis, Graece et Latine doctus. scripsit De conversatione servorum Dei lib. 1,\nAd ancillas Dei apud Bethaniam lib. 1, Vitam abbatis Eliae lib. 1, De una\nMagdalena contra Graecos lib. 1, Contra Salam presbyterum lib. 1, atque alia\nnonulla.\nJohn Bale, Cronica, MS Selden Supra 41, fo. 148V:\nGerardus a Nazareth, Galileus genere (quern Benedictum esse ferunt) de\nmonasterio montane nigre prope Antiocham, episcopus Laodicensis, hermita\nsanctissimus, rhetor, et theologus. Scripsit ad Guillelmum presbiterum, de\nconversatione servorum Dei, vitam abbatis Helie, de Maria Magdalena, ad\nancillas Dei in Bethania, contra Salam presbiterum, et alia, floruit 1140.30\n28\n Willelmi Tyrensis Archiepiscopi Chronicon xiv. 10, ed. R. B. C. Huygens, Corpus\nChristianum Continuatio Medievalis lxiiiA, 641.\n28\n Kedar, 'Gerard of Nazareth', 62-3; R. Rohricht, Regesta Regni Hierosolymitani\niogy-i2gi, Innsbruck 1893-1904, nos338, 359, 366; Willelmi Tyrensis Archiepiscopi Chronicon\nxv. 16, and xviii. 23, pp. 696, 845.\n30\n Josiah Simler's edition of C. Gesner's Bibliotheca universalis, Zurich 1574, 237, has a\nsimilar entry for Gerard: 'Gerardus a Nazareth, patria Galilaeus, apud Nazareth\nprimum, deinde in Montana Nigra prope Antiocham eremita, episcopus tandem\nLaodicensis, Graece et Latine doctus, scripsit ad Guilhelmum presbyterum, De\nconversatione servorum Dei, lib 1. Vitam abbatis Heliae, lib 1. De una Magdalena contra\nGraecos lib 1. Ad ancillas Dei in Bethania lib 1. Contra Salam templarium lib 1. Atque\nalia. Claruit anno Domini 1140'. Kedar, 'Gerard of Nazareth', 60, suggests that Simler\nmay have had access to another manuscript of Gerard, or may have read the Duodecima\ncenturia and chosen not to copy the Centuriators' mistake in calling him a Carmelite. It is\nunlikely that his knowledge of Gerard came only from Bale, since he knew that ' De una\nMagdalena' was written 'contra Graecos', while Bale apparently did not know.\n222\nORIGINS OF THE CARMELITE ORDER\nThe similarities between Bale's and Matthias's entries for Gerard, taken\ntogether with the lists of hermits, suggest a common source. As Kedar has\nalready shown, the only other passage from Gerard's work known to us is\nthat quoted by the Carmelite historians of the fourteenth century.31 Bale\nwas certainly familiar with Ribot's work: the copy of Ribot's De institutione\nel peculiaribus gestis religiosorum Carmelitarum in Lambeth Palace Library, MS\n192, has notes in Bale's hand and may have been owned by him.32 Another\nof Bale's manuscript notebooks, BL, MS Cotton Titus D x, dating from\nbetween 1548 and 1560, contains extracts from the De institutione (fos\nii2v-26r). This manuscript, as scholars of Bale have known for some\ntime, makes explicit the connection between Bale and the Centuriators.\nLike Selden Supra 41, the manuscript is a compilation of catalogues and\nmiscellanea dealing with Carmelite history and apologetics, some, like the\nextracts from Ribot, incomplete. Towards the end of the manuscript are\nexamples of Bale's correspondence, including a letter to Bale from\nMatthias Flacius, dated 1554. The letter asks for the ex-Carmelite's help\nin the Centuriator's project of compiling a Protestant history of the\nChurch.33 Bale had first fled to Germany in 1540, expecting a Catholic\nreaction after Cromwell's downfall, and there published anti-Catholic\npolemical works. He was consecrated bishop of Ossory in 1552 to bring\nthe Reformation to Ireland, but met with intransigence, and fled first to\nHolland and then Basle in 1553.34 Matthias's letter was written when Bale\nwas already in Basle - where the Centuriators' Ecclesiasticae historiae was\nto be published eight years later.\nBecause of the nature of the Centuriators' compilation, it is impossible\nto know whether they had more information at their disposal than did\nBale. Bale, too, was highly selective. The paucity of his notes is frustrating\nfor the historian, but fits in with the general tenor of the Cronica. There are\nlacunae in some of the entries, particularly in the period from the seventh\ncentury to the eleventh, and several pages in the manuscript have been\nleft blank, or the red circles have been drawn but not filled in, suggesting\nthat this may have been the author's rough copy.35 Bale may have had\nmore information at his disposal which is simply not included in Selden\nSupra 41. Without an original manuscript against which to compare the\nlists in the Cronica and the Duodecima centuria, it is impossible to know how\nfar the Centuriators might have relied for their information on Bale. That\nthey did so in other parts of the Duodecima centuria is indisputable. Another\nhermit, the problematic 'Cyrillus Carmelitus', appears in the same\n31\n Kedar, 'Gerard of Nazareth', 56-7.\n32\n Lambeth Palace Library, MS 192, fo. 44V, contains a list of Carmelite bishops in Bale's\nhand. M. R . J ames , A descriptive catalogue of the manuscripts in the Lambeth Palace Library,\nCambridge 1930, 300, suggests that Bale owned the manuscript.\n33\n BL, MS Cotton Titus D x, fo. 18 iv. The correspondence between Bale and the\nCenturiators is printed in H. McCusker, John Bale: dramatist and antiquary, Bryn Mawr\n1942, 67-70. 34 A full account of Bale's movements can be found ibid.\n35\n The red circles have been left empty on fos 1 IOV-I lr, and the blank pages are fos\ni2iv, i22r, I24r, 125V, I38r-4ov, I4ir, 142V, i44v-r and I46r.\n223\nANDREW JOTISCHKY\nchapter as Gerard's hermits. Cyril was of great importance in Carmelite\nhistoriography: he is one of the contemporary ' sources' on which Ribot\nclaimed to base his account of the Carmelites in the thirteenth century.36\nThe Centuriator's entry for Cyril quotes several lines of a poem on Cyril\nby the Carmelite author Baptista Mantuanus (fl. 1513-16), for which\nBale's Scriptorum Maioris Britanniae... catalogus (1544-7), was acknow-\nledged as the direct source.37 Another important figure in Carmelite\nhistoriography, Brocardus, revered as the second prior-general of the\norder, appears in the Duodecima centuria as the original author of the Rule\nfor which Albert, as ultimate ecclesiastical superior of the province in\nwhich the Carmelite foundation was located, took the credit; again, Bale\nis quoted as the source.38 A more important contribution from Bale,\nhowever, was a general entry on the Carmelite Order, in which the\nCenturiators seem to accept Carmelite traditions establishing the\ncontinuity of Carmelite existence from the 'Byzantine period' into the\ntwelfth century.39 The Centuriators wrote to Bale in 1553 and 1554, some\nyears after the Catalogus had made him famous in continental Protestant\ncircles. There is, thus, no way of linking the Centuriators' use of Bale's\nCarmelite material directly to their correspondence of 1553 and 1554.40\nThe Centuriators either had at their disposal a different copy of Gerard\nfrom that known by Bale, or at any rate enough information from\nunknown sources to reject from the canon of Gerard's hermits Nicholas,\nGalfridus and Patriarch Bernard, adding instead another Ralph, Hugo\nand Walter. The case of Bernard may be instructive here. It seems that he\nwas added by Bale - or an earlier Carmelite tradition - simply to bolster\nthe prestige of the order. If the Centuriators suspected this, it would\nexplain his omission from their text. Indeed, as Kedar has pointed out,41\nmore than a third of the chapters of the De conversatione were not used at\nall by the Centuriators, perhaps because they suspected Carmelite\nadditions to Gerard's original. It cannot be said with any degree of\ncertainty that Gerard's De conversatione was made known to the\nCenturiators by Bale alone, as a consequence of the correspondence of\n1553-4: Bale and the Centuriators may have relied on different versions\nof Gerard. Because of the fragmentary nature of their presentation of\n36\n Cyril appeared in Bale's Cronica in a red circle as the third prior-general of the\nCarmelite Order: Bodl. Lib., MS Selden Supra 41, fo. I5or.\n37\n Matthias, Duodecima centuria, 1610: 'de quo Baleus hosce scribit versiculos ex\nMantuano lib 5 Fastorum'.\n38\n Ibid. 1370. The information is ascribed to Bale's Catalogus, the appendix to ch. xli of\nCenturia 133.\n39\n Matthias, Duodecima centuria, 944-5. The Centuriators' acceptance of Carmelite\nchronology is indicated by the entry for Gerard himself, which includes the phrase ' apud\nAntiochiam Carmelitanae sectae eremita', 1379.\n40\n Bale explained in a letter to Archbishop Parker in 1560 that the bulk of his\nconsiderable library had been left behind in Ireland and impounded by his enemies; he\nwas thus hardly in a position to send manuscripts or books to the Centuriators in 1554,\nafter his flight. For the Parker-Bale correspondence see McCusker, John Bale, 67-8.\n41\n In private correspondence with the author.\n224\nORIGINS OF THE CARMELITE ORDER\nGerard's material, however, the suspicion must remain that the\nCenturiators' knowledge of the De conversatione - and thus, our own\nknowledge of the text - derived ultimately from the Carmelite historical\ntradition. What does seem clear is that the version of the De conversatione\nknown by Bale, almost certainly from Carmelite sources, included\nadditional material linking Gerard and his hermits to the alleged twelfth-\ncentury development of the Carmelite Order. However much of such\nexcesses the Centuriators were able to prune, they were reliant enough on\nBale to believe, from a reading of his Catalogus, that Gerard himself had\nbeen a Carmelite.\nPhilip Ribot cites Gerard of Nazareth's prologue to the De conversatione\nin the context of a discussion of the virtues of eremitical life:\nGerardus episcopus Laodicensis in libro de conuersatione uirorum Dei in Terra\nSancta morantium, ad Guilelmum presbyterum: Aliud est genus religiosorum\nqui sigillatim habitant a saeculi rebus alieni, quod laudabile semper fuit. Hi sunt\nqui ad exemplum Eliae silentium solitudinis praeferunt tumultibus civitatis.\nAmant enim secretam contemplationem Deitatis. Unde David a saeculi molestiis\nin solitudinem fugiens se elongabat. In terra, inquit, deserta, invia et inequosa\n[sic]: sic in sancto [sic] apparui tibi, ut viderem virtutem tuam, et gloriam tuam.\nHanc quippe gloriam Moyses in deserto, hanc tandem Elias in solitudine\nquaesierunt videre. Hinc et Salvator in monte, seorsum a turbis, inter Moysem\net Eliam gloriosus effulsit.42\nRibot thus uses Gerard to expound the Carmelite argument that Elijah\nwas the true exemplar for the eremitical life. He also makes use of other\nfigures active in the twelfth-century Church in Outremer in the same way.\nPatriarch Aimery of Antioch (1140-93) plays an important role in Ribot's\nDe institutione in the development of a regulated community of hermits on\nMt Carmel. Learning that recent Frankish recruits to Mt Carmel were\nnot observing traditional Carmelite practice, he had their original Rule,\nwhich Ribot attributes to John, a fifth-century bishop of Jerusalem,\ntranslated from Greek into Latin:\nIntelligens autem quosdam eorum qui ex Occidente supervenerunt, spretis\nseniorum monitis, non recte ambulare ad [sic] veritatem religiosae vitae eremitae,\nin praedicto Joannis libro descriptae, et perpendens hoc ideo maxime contigere,\nquia Graecas litteras ignorantes, nesciebant codicem ilium legere, fecit librum\nilium de Graeco in Latinum transferri.43\nThere is no evidence from Aimery's long patriarchate of any connection\nwith Mt Carmel. The idea of his intervention in the affairs of an eremitical\nfoundation on Mt Carmel must have been inspired by a passage in\n42\n Ph i l ip R i b o t , De institutione et peculiaribus gestis religiosorum Carmelitarum iii. 8, from the\nedition of Daniel a Virgine Maria, Speculum Carmelitarum, i. 36. Kedar, 'Gerard of\nNazareth', 56, edits this extract from three manuscripts (Rome, Archivio Generale dei\nCarmelitani, Collegio Sant' Alberto MS II C O . II 35; Trier, Stadtbibliothek MS\nI55(8o)\/i237; and Munich, Staatsbibliothek MS Clm 471).\n43\n R i b o t , De institutione viii. 2, p . 75 .\n225\nANDREW JOTISCHKY\nGerard's De conversatione, where Aimery is described as regulating against\nsolitary anchorites on the Black Mountain outside Antioch: ' Is [Aimery]\nsedulus vitae monasticae promotor fuit, ut Gerardus a Nazareth testatur.\nLegem tulit, ne quis in monte Nigro sine maiore inspectore solitarius'.44\nThe point of Ribot's 'poaching' of Aimery is to demonstrate the alleged\ncontinuity of Carmelite settlement from the 'Byzantine' to the 'Frankish'\nperiod, which is untenable from contemporary sources.45 Despite his\ninterest in hermits, however, Aimery was a singularly unlikely figure to\nchoose for the role assigned to him. His troubled relations with the\nOrthodox Church in his province make it improbable that he should have\nhad a Greek Rule for hermits translated into Latin, especially when there\nwere plenty of Latin ones available. Partly as a result of the submission of\nReynaud, prince of Antioch, to Manuel Comnenus in 1159, Aimery was\nforced into exile and a Greek patriarch installed in his place in 1165. On\nhis return to office, he cultivated the friendship of the anti-Greek Jacobite\nPatriarch Michael, whom he eventually invited to attend the Third\nLateran Council in Rome.46 His correspondence with the Pisan theologian\nat the court of Manuel Comnenus, Hugo Etherianus, shows his interest\nin using theology in polemical debate; Hugo sent him a copy of his\nbook De haeresibus quos Graeci in Latinos devolvunt, and Aimery asked for\nothers, including an account of the Council of Nicaea and a history of\nConstantinople.47 This exchange of letters occurred in 1176, after\nAimery's restoration to office in Antioch.48 His choice of books is revealing\nin the light of Hugo's understanding of his own work. The preface to the\nDe haeresibus makes it clear that Hugo was writing a defence against the\nattacks of Greek theologians.49 A Latin bishop who had been ousted from\n44\n M a t t h i a s , Duodecimo centuria, 1373. A i m e r y ' s t r e a t m e n t of t h e h e r m i t s of t h e Black\nMountain is further complicated by a passage in Otto of Freising's Chronicon. In 1143\nHugh, bishop ofJabala, while organising the defence of the city of Antioch had, according\nto Otto, depopulated the countryside around the city of its hermits. 'Ille [Hugh] autem,\neo quod a principe delusus esset, civitati quidem pepercit, sed totam ferro flammaque\ndepascens provinciam heremitas quoque, quorum grandis ibi copia est, de cellulis suis\neductos, non kalo, id est boni, Iohannis [Comnenus] officium agens, crudelissime\ntractavit': Chronicon, sive de duabus civilalibus vii, 28, ed. A. Schmidt and W. Lammers,\nDarmstadt 1961, 548. It is possible that Aimery's legislation against solitary anchoresis was\nalso inspired by concern for the hermits' safety.\n45\n For the same reason Ribot quotes from Gerard not, as did Bale, the names of hermits\nthemselves, but rather a more general definition of the practices of hermits. The passage,\ncited alongside similar ones from John Cassian and Isidore of Seville, implies that the\nhermits who followed the example of Elijah in the twelfth century were following early\nChristian practice.\n46\n Michael the Syrian, Chronique, ed. and trans. J.-B. Chabot, new edn Brussels 1963,\n377-8. Aimery also secured the union of the Maronite Church with Rome in 1182.\n47\n PL ccii. 229-32. For Hugo's career see A. Dondaine, 'Hugues Ethe'rien et Ldon\nT o s c a n ' , Archives d'histoire doctrinale et litte'raire du Mqyen Age xxvii (1952) , 6 7 - 1 3 4 .\n48\n The carrier of the letters was Reynaud de Chatillon, who had just been released from\nprison in Aleppo: B. Hamilton 'Manuel 1 Comnenus and Baldwin iv', in J. Chysostomides\n(ed.) Kathegetria, Camberley 1988, 360. I am grateful to Professor Hamilton for pointing\nthis out to me. 49 PL ccii. 232-3.\n226\nORIGINS OF THE CARMELITE ORDER\noffice as a result of disputes between the prince of Antioch and his\nByzantine overlord, and who was on friendly terms with a Latin\ntheologian writing polemics against Greek views of the Trinity was hardly\nlikely to translate a Greek monastic rule for the use of Frankish hermits:\na far more likely interpretation of his legislation for hermits was that he\ndid not want solitary Franks falling under the influence of Orthodox\nmonks on the Black Mountain.\nAimery was established by Ribot as one of the most important figures\nin the regulation of the Carmelites. Embellishing Gerard's evidence about\nAimery's action against unsupervised hermits, Ribot argued that Aimery\nhad actually established a community of hermits in caves on the Black\nMountain.50 The Black Mountain, just outside Antioch, was a more likely\nfield of activity for Aimery than Mt Carmel, which lay outside his\necclesiastical jurisdiction. It was well known as a centre for monastic and\neremitic life by the twelfth century among both Latins and Orthodox.\nRibot extended the connections between the Black Mountain and the\nCarmelites by introducing the figure of Eusebius, ' prior of the Black\nMountain'. Eusebius features in the De institutione only as the recipient of\nthe 'letter of Cyril of Constantinople'. This 'letter' -which has become\na vital source for subsequent Carmelite historiography51 - was, with the\n'Rule of John of Jerusalem' and the 'Chronicle of William of Sandwich',\none of the sources on which Ribot claimed his work was based. None of\nthese works, however, can be found before the De institutione, and modern\nscholars view them as literary devices invented by Ribot to give greater\nauthenticity to his work.52 Eusebius, therefore, looks very like a creation\nof Ribot's, designed both to enhance the connection between the Black\nMountain and Mt Carmel and, once again, to emphasise the continuity\nof the Carmelite profession. By the sixteenth century, however, he was\nfirmly established in Carmelite history: Bale lists him in the Cronica as\n'Eusebius heremita montis Carmeli, Cirilli discipulus'.53\nRibot also connected the two eremitical sites directly through the\nperson of Aimery. In a later chapter he went on to say that the way of life\nestablished for the hermits by Aimery on the Black Mountain was actually\nthat of the Carmelites:\nNonullos quoque eorum duxit Aymericus patriarcha Antiochenus in solitudinem\nmontis Neroi, qui alio nomine montana nigra apellatur, ubi in antris absconsam\nvitam Domino servabant. Qui omnes quamvis essent locis sejuncti, eandem\ntamen vitam solitariam servare satagebant, quam servabant eremitae montis\nCarmeli.54\nThis found its way, probably through a confusion of the two sites by\nBale, to the Duodecimo centuria:\n60\n R i b o t , De institutione ix. i , p . 96 .\n61\n See especially G. Wessels, 'Epistola S. Cyrilli Generalis et historia antiqua Ordinis\nnostrae', Analecta Ordinis Carmelitana iii (1914), 267-86.\n62\n On William of Sandwich, for example, see Egan, 'An essay', 80-2.\n53\n Bodl. Lib., MS Selden Supra 41, fo. 151V. 64 Ribot, De institutione ix. 1, p. 96.\n227\nANDREW JOTISCHKY\nAlmericus Antiochenus patriarcha, sedis Romanae in illas partas legatus, anno\n1121 eremitas in Carmelo dispersos collegit in unum, et redegit in ordinem, qui\na loco dicti sunt Carmelitae...Baleus Cent 2 ca 66 in appendice Scriptorum\nBritahniae.56\nThe Centuriators were thus, wittingly or not, colluding in Carmelite\nattempts to create a spurious past for their order. While Ribot retained\nthe Black Mountain to emphasise the plausibility of his account of the\nCarmelite Order in the twelfth century, Bale simply ' annexed' Aimery to\nhis Carmelite genealogy. But he went further still by including in his\ngenealogy Peter the Hermit, Gerard the 'founder of the Hospital of St\nJohn' and 'Sibylla', daughter of King Fulk and Queen Melisende and\nabbess of Bethany.56 Gerard's De conversatione could be used to supply\nothers. Of the twenty-six hermits known from Matthias and Bale, two,\nHenry and Bartholomew, settled either alone or in unspecified com-\nmunities on the Black Mountain, and eight others - Bernard of Blois,\nPorphyry, William, Walter, the two Hugos, Ursus and Valerius — were\nmonks in the new foundations of Machanath or Jubin on the Black\nMountain. Ribot does not make use of Gerard's hermits to bolster his\naccount of the Carmelite foundation, but he does list the Black Mountain\nas one of the sites to which the Carmelites expanded in the thirteenth\ncentury, along with Mt Quarantenus, another celebrated hermits' site,\nTyre, Sidon, Tripoli, 'Mt Lebanon', Antioch, Jerusalem and the\nGalilee.57 Bale's inclusion of Gerard's hermits shows that he considered\nthem to be inside a wider Carmelite sphere, even if he was unsure of their\nexact relationship to Mt Carmel.\nThis poaching of any individuals who had suitable connections to the\nmonastic or eremitical life appears clumsy and transparent in the case of\npeople whose careers are well documented, such as Peter the Hermit,\nPatriarch Aimery or Gerard, putative founder of the Hospital of St John\nin Jerusalem. A brief examination of the established facts of the eremitical\nfoundation on Mt Carmel, however, will show that the connections made\nby Ribot and later Carmelite apologists between different monastic\nsettlements, and specifically between the hermits of Gerard of Nazareth\nand the Carmelites are not, perhaps, so far-fetched.\nThe keystone of the Carmelite historians' account of the 'Frankish\nperiod' of the order is the figure of Berthold. Ribot, the first to mention\nhim, says that he was established in the office of prior-general of the\n65\n M a t t h i a s , Duodecimo centuria, 1374; Bale , Scriptorum illustrium maioris\nBritanniae...catalogus, Basel 1559, 182. Bale's Cronica mentions Aimery's regulation of the\nCarmelites under the entry for Berthold, Bodl. Lib., MS Selden Supra 41, fo. i48r. The\nCenturiators, by including Bale's evidence as well as Gerard's, preserved two different, but\nnot mutually exclusive, traditions about Aimery.\n66\n Bodl. Lib., MS Selden Supra 41, fo. 147V, I48r. Gerard of Nazareth had written a\nsermon 'ad ancillas Dei in Bethania'. The real abbess of Bethany was named Yveta.\nSibylla, who became countess of Flanders, was the daughter of Fulk, but not of Melisende.\n57\n Ribot, De institutione ix. 2, p. 97. The list of Carmelite foundations in the Latin East\ngiven by Bale also includes Acre, Bethel and ' Calgala': BL, MS Cotton Titus D x, fo. 125v.\n228\nORIGINS OF THE CARMELITE ORDER\nCarmelite Order by Aimery of Antioch in 1121.58 He ruled for forty-five\nyears, was called by Bale 'sacre pagine doctor' and, according to him,\nperformed 115 miracles, including the healing of two paralytics.89 The\nfigure of Berthold, despite later embellishments, may have been based on\na real hermit. Twelfth-century pilgrims knew Mt Carmel as the place\nsanctified by Elijah's triumph over the priests of Baal, but the first\nevidence of a settlement there occurs in the report of the Jewish pilgrim\nBenjamin of Tudela in the late 1160s that Christians were living by the\ncave of Elijah, where they had built a church dedicated to the prophet.60\nThe cave - venerated still today by Jews, Christians and Muslims - lies\nat the foot of the north-western slope of Mt Carmel. Directly above, on the\nsummit, the present Stella Maris Carmelite monastery occupies the site of\nthe medieval Greek monastery of St Margaret.61 In the sixth century\nthere had been a monastery on Mt Carmel dedicated to Elisha;62 the\nchurch reported by Benjamin may have been associated with a monastery,\nby then abandoned, in which hermits, either Orthodox or Frankish, were\nliving. Further evidence for the re-use of this site comes from the account\nof the pilgrim John Phocas, a Cypriot monk who visited the Holy Land\nin 1185. Describing the ruins of St Elisha, John says that not many years\nbefore his pilgrimage a white-haired monk from Calabria had been called\nto the site in a vision by Elijah, had built a tower from the ruins of the\nabbey and settled there with about ten brothers.63 The fact that he figures\nat all in Phocas's account, and his place of origin, suggests that he was\nGreek Orthodox.\nThe anonymous Calabrian became Ribot's model for Berthold, the first\n'crusader' Carmelite.64 By smoothing over the complex topography of Mt\nCarmel, Ribot was able to claim any monastic or eremitical foundation on\n68\n Ribot , De institutione viii. 2, p . 75. T h e da t ing gives Ribo t away; Aimery did not\nbecome patriarch until 1140.\n69\n Bodl. Lib., MS Selden Supra 41, fo. 1471\". Bale adds to the legend by making Berthold\na crusader who took part in the capture of Jerusalem in 1099 and afterwards became a\nfollower of Peter the Hermit.\n60\n Benjamin of Tudela, Itinerary, ed. M. N. Adler, London 1907, 19. For the Jewish\ncemetery near the cave of Elijah, see J. Prawer, The history of the Jews in the Latin Kingdom\nof Jerusalem, Oxford 1988, 83. Earlier twelfth-century pilgrims who mention Elijah include\nthe Russian abbot Daniel (1105-6), The pilgrimage of the Russian Abbot Daniel (Palestine\nPilgrims Text Society iv, 1895), 55, and Rorgo Fretellus (1137), Rorgo Fretellus de Nazareth\net sa description de la terre sainte, ed. P. C. Boeren, Amsterdam 1980, 19.\n61\n Friedman, 'The medieval Abbey of St Margaret of Mt Carmel', Ephemerides\nCarmeliticae xxii (1971), 295-348.\n62\n Antonini Placentini itinerarium iii, ed. P. Geyer, CC clxxv. 130: ' A Ptolemaida per mare\nincontra in civitatem Sucemina Iudeorum est miliario semis per directo, littore maris milia\nsex. Castra Samaritanorum a Sucemina miliario subtus monte Carmelo. Super ista castra\nmiliario semis monasterium sancti Helisaei, ubi ei occurrit mulier, cuius filium suscitavit'.\n63\n J o h n P h o c a s , Descriptio Terrae Sanctae, P G cxxxii i . 9 6 1 - 2 .\n64\n Ribot, De institutione viii. 2, p. 75. The Calabrian soon became indistinguishable from\nBerthold, the first prior-general, and even in modern Carmelite scholarship Phocas's\naccount is taken as evidence for the settlement of Mt Carmel in the twelfth century:\nMonumenta historica Carmelitana, ed. B. Zimmermann, Lirinae 1907, i. 269.\n229\nANDREW JOTISCHKY\nthe mountain as 'Carmelite'. An examination of the sixth-century\ndescription of the monastery of St Elisha, however, suggests that the\nCalabrian's settlement cannot have been on the promontory of the\nmountain, by the cave of Elijah, but instead farther to the south. Elias\nFriedman locates St Elisha in Nahal siah, the site of the eremitical\nsettlement described by Jacques de Vitry, and by numerous thirteenth-\ncentury pilgrims, and confirmed by papal bull in 1226.65 If Friedman is\ncorrect, the settlement described by Benjamin, which he locates precisely\nat the cave of Elijah, and that described by Phocas, were not the same.\nThe ruins of St Elisha were some seven kilometres to the south of the cave,\nby the spring of Elijah. This location is confirmed in the prologue to St\nAlbert's Rule, written between 1205 and 1214 and addressed to 'B. et\ncaeteris eremitis qui sub eius obedientia iuxta fontem in Monte Carmeli\nmorantur'.66\nAlbert's Rule is the earliest independent evidence for the existence of\nthe hermits who were to become the Carmelite Order. Somewhat\ndisingenuously, Ribot merged two different eremitical settlements into\none to prove that the Carmelite Order was older than St Albert's Rule.\nFrom there it was easy enough to extend the net to include other figures\nwho can have had no relation to the hermits addressed by St Albert.\nAlbert's Rule is succinct and brief, but it includes important details\nabout the settlement of 1205-14 in Nahal siah. Significantly, Albert\nacknowledges that the settlement is already in existence; his Rule is\nsupplied at the request of the hermits themselves.67 Albert organised the\nhermits according to a traditional plan that owes much to eremitical\ncommunities in western Europe from the 1050s onwards. Peter Damian,\nStephen of Obazine or Bruno the Carthusian would have recognised\nelements of their own ideas in the Carmelite hermitage. There were\ntwelve hermits, one of whom was elected prior by the others. They lived\nin individual cells grouped around an oratory, ate in a common refectory\nand kept the canonical hours according to the usage of the Church of the\nHoly Sepulchre. They owned nothing, but held pack-animals in common;\nthey met in chapter every week; their work was divided between physical\nlabour and meditation. They were to live in the place assigned them by\nthe prior, and keep to it unless instructed otherwise. They were not\npermitted to leave the hermitage without the prior's permission.68\nThe hermitage in Nahal siah cannot be dated, for lack of evidence,\nearlier than the Rule of St Albert. Its way of life, however, recalls similar\nhermitages or proto-monastic foundations described by Gerard of\nNazareth two generations or more earlier, particularly those on the Black\nMountain. The example of Bernard of Blois provides a parallel. At some\npoint before 1123 Bernard and a few companions, amongst them Robert\nof Jerusalem, founded a house at Jubin, on the Black Mountain. Gerard\n66\n Friedman, 'Abbey of St Margaret', 314.\n66\n The Rule of St Albert, ed . a n d t r a n s . Bede E d w a r d s , Aylesford 1973, 78.\n67\n Ibid. 68 Ibid. 80-8.\n230\nORIGINS OF THE CARMELITE ORDER\nmentions a rule devised by the community, but of its content we know\nonly the prohibition of all personal wealth and all donations over the\nvalue of three bezants.69 Whether this was one of a number of strictures\nin a new rule, or merely a strict interpretation of part of the Benedictine\nRule, is not clear. The sense of the passage in the De conversatione is that\nBernard left deliberately to found a new house rather than join an existing\none, implying that he had in mind a community not yet bound to\nadherence to a rule. This is not to suggest that Bernard disapproved of\nmonastic rules, but rather that, like many monks in western Europe, he\nsaw a fresh start as the surest way of effecting reform. The same must have\nbeen true of the hermits of Nahal siah; by the first decade of the thirteenth\ncentury, indeed, there was a much greater choice of monasteries for the\nprospective monk in the Latin East than there had been for Bernard,\nincluding the Cistercian abbeys founded after 1157. Another example of\nthe same type of foundation comes from Gerard's life of Elias of\nNarbonne, who joined a 'monasterium eremitarum' while on pilgrimage\nin the Holy Land, became a priest and later founded his own eremitical\ncommunity in a cave near Jerusalem (probably in the 'vicus eremitarum'\nin the Kidron Valley) before being persuaded to join the abbey of St\nMary de Josaphat, and subsequently becoming abbot of a house in\nGalilee that had begun as an eremitical foundation.70 Bernard's\nfoundation at Jubin split apart on the principle of absolute poverty. The\nprior (not Bernard himself) relaxed so far as to accept gifts of money, food\nand wine, incurring the wrath of Bernard and a few others and causing\na schism in the community. Bernard left Jubin in anger and returned to\nJerusalem, but eventually received permission to enter the cloister at\nMachanath, another new foundation on the Black Mountain, which\nencouraged a stricter adherence to the Benedictine Rule.71 Later, under\ncircumstances not mentioned in the De conversatione, Bernard returned to\nJubin, which had become severely depleted as a result of the schism.\nThis episode, reminiscent of the schism at Molesme from which Citeaux\nwas eventually born, serves as a reminder of the uncertainties of monastic\nfoundations. Not all were successful, and most of those that were not have\nleft little trace. This is particularly the case in Latin Syria, where the\ncountryside was often hostile or at least alien, and the danger of enemy\nincursions constant. After the battle of Hattin and the fall of the kingdom\nof Jerusalem in 1187 many monasteries ceased to exist, particularly\ndaughter-houses and those without estates elsewhere. Later Carmelite\n69\n M a t t h i a s , Duodecimo centuria, 1605.\n70\n Ibid. 1603. For the abbey of Palmaria, see Kedar, 'Palmaree, abbaye clunisienne du\nXlle siecle en GalileV, Revue Benedictine xciii (1983), 260-9.\n\" Matthias, Duodecimo centuria, 1230. Other monks of Machanath mentioned by Gerard\nwere William and Hugo, both Frankish knights, Porphyry, Walter and another Hugo.\nThe passages in the De conversatione dealing with Bernard are scattered across three\nchapters of the Duodecimo centuria; the part describing the schism is hostile in tone and quite\nunlike the rest of Gerard's work, and may therefore be the work of another author.\n231\nANDREW JOTISCHKY\nhistorians saw 1187 as a watershed in the history of their order. Bale's\nAnglorum Heliades cites a passage from the treatise De adventu Carmelitarum\nad Angliam, attributed to an English Carmelite writing in about 1360,\nClaudius Conversus (or William of Coventry), to the effect that, at the\ntime of Saladin's conquest, many Carmelites were scattered throughout\nthe Holy Land on preaching missions, as was customary before the\nadoption of St Albert's Rule. These fled to Cyprus and were restored to\nMt Carmel by Richard 1 after the capture of Acre in 1190.72 Like Ribot,\nWalter was trying to confirm the existence of the order before St Albert's\nRule. Doubtless many hermits and monks did flee the 1187 invasion (as\nthe Carmelites would flee Mt Carmel temporarily in 1238) and return\nwith the peace established by the Third Crusade, but to call them all\nCarmelites is anachronistic. Amongst the furtive hermits returning to\nNahal siah may have been some who had lived alone elsewhere, perhaps\nin parts of the Galilee. One such earlier example from the De conversatione,\nJohn, had lived in the dense woods of Mt Tabor since 1098, and saw so\nlittle of human society that he did not know whether Antioch was still part\nof the Crusader States.73 Such hermits may have decided that a\n'monasterium eremitarum' would give them greater safety after the fall\nof the kingdom of Jerusalem. There may have been amongst them,\nhermits from the Black Mountain, which was threatened by Saladin's\ninvasion of the principality of Antioch in 1188. Given the frailty of\neremitical foundations, moreover, it is quite possible that Frankish\ncommunities had settled on Mt Carmel before Albert's Rule, and that the\nhermits of Nahal siah were using a pre-existing site. Mt Carmel covers\nsome twelve-and-a-half miles from north to south, and at least five\ndifferent foundations are known from the sixth century onward: the\nOrthodox convents of St Elisha and St Margaret, the Calabrian eremitical\nsettlement of the 1170s by the cave of Elijah, the Frankish hermits of Nahal\nsiah and another Orthodox monastery, St John of Tyre, still farther to the\nsouth (in the wadi al-'ain). Pilgrimage accounts from the thirteenth\ncentury make the relationships and distances between these foundations\nclearer,74 but before c. 1230 it is impossible to tell what kind of overlap\n72\n BL, MS Harley 3838, fo. gv. In the summary edition of his Catalogus, Basel 1559, 461,\nBale attributed the treatise De adventu Carmelitarum ad Angliam, which he had copied into\nhis own notebook, Bodl. Lib., MS Bodley 73, between 1520 and 1527, to the Carmelite\nWilliam of Coventry, also known as Claudius Conversus. Here he has William flourishing\nc. 1360, but in the Cronica, Selden Supra 41, fo. i67r, he had specified the 1340s. In a later\nnotebook, BL, MS Cotton Titus D x, fo. I27r, he attributed the work to a more recent\nCarmelite author, Richard of Ely (d. i486). Zimmermann opted for Richard of Ely as the\nauthor: Monumenta, i. 364. Another Carmelite author, Robert Bale, thought that Cyril of\nConstantinople fled to Mt Carmel as a result of Saladin's conquest in 1187: Bodl. Lib., MS\nSelden Supra 72, fo. gr. 73 Matthias, Duodecimo centuria, 1607.\n74\n In particular three anonymous French accounts, ' Les chemins et les pelerinages de\nla Terre Sainte', 'Les sains pelerinages que Ten doit requerre en la Terre Sainte' and 'Les\npelerinages por aler en Iherusalem', which are collected in Itineraires a Jerusalem et\ndescriptions de la Terre-Sainte re'diges enfrangais aux Xle, XHe et XIHe siecles, ed. H. Michelant\nand G. Raynaud, Geneva 1882.\n232\nORIGINS OF THE CARMELITE ORDER\nthere might have been between eremitical and more permanent\nsettlements. Eremitical settlements of Orthodox monks one might expect\nto have been absorbed by St Margaret's, just as the Latin hermits\ngathered under the unifying Rule of St Albert. Even in the thirteenth\ncentury, however, one cannot be sure that all hermits on Mt Carmel were\nliving under a Rule.\nIf Ribot did not explicitly claim Gerard of Nazareth's hermits as\nexamples of Carmelites before St Albert's Rule, the intent in his quotation\nfrom Gerard's De conversatione cannot be disputed. Gerard seems not to\nhave written about Mt Carmel (at any rate, if he did, the relevant\npassages have been lost), but Ribot assumed that a hermit following the\nexample of Elijah must have lived on the site of Elijah's most celebrated\nacts. Ribot's contemporaries Bernard Ollerius and John of Hildesheim,\nwho quote exactly the same passage of the De conversatione, suggest the\nsame. Ollerius takes Gerard's words to refer to hermits living on Mt\nCarmel before the Rule: 'Quod autem oporteat haec verba intelligi de\npraedecessoribus praedictorum fratrum videtur patere ex eorum regula'.75\nJohn comes to the same conclusion: 'Cum igitur ex regula Carmelitae\nobligentur ad silentium, et ad vitam eremiticam... patet evidenter, quod\nfuerint successores praedictorum, se conformiter habentes ad ipso [sic] \\76\nKedar contrasted these accounts by contemporaries of Ribot with\nThomas Scrope's more bald statement a hundred years later: 'Quod\nautem ista intelligenda sint de Carmelitis patet ex eorum regula per quam\nobligantur ad silentium, et ad sigillattim habitandum per cellas\nseparatas', arguing that Bernard and John were referring to 'Palestinian\nanchorites who preceded the Carmelites' rather than to the Carmelites\nthemselves, whereas Scrope simply labelled any hermits on the mountain\nCarmelites.77 Given that both John and Bernard, like Ribot, accepted the\nElianic succession, the Rule of John of Jerusalem and the continuity of the\norder from the prophets to the Frankish period, this distinction seems one\nof semantics. All three thought that the Rule of St Albert was merely\nconfirming a way of life that could be traced back not just to Aimery's\nreform of the twelfth century, but to the original 'Rule' of John of\nJerusalem, and beyond that to Elijah and the minor prophets. Albert's\nonly contribution, in their accounts, was to acquire papal confirmation\nfor the order, and thus to bring it into the mainstream of canonical\nlegislation.\nThe evidence of Gerard of Nazareth for the same general type of\ncommunity described by the Rule of St Albert on the Black Mountain, in\nJudaea and Galilee from the 1120s onward strengthens the assumptions of\nlater Carmelites that their order predated Albert's Rule. But, if hermits\n76\n 'Informatio circa originem': Speculum Carmelitanum, i. 168.\n76\n John of Hildesheim, 'Dyalogus': Speculum Carmelitanum, i. 152.\n\" Thomas Scrope, 'Chronicon': Speculum Carmelitanum, i. 175; Kedar, 'Gerard of\nNazareth', 57-8.\n233\nANDREW JOTISCHKY\nwere living on Mt Carmel at the time Gerard was writing, why did he not\nmention Mt Carmel at all? Gerard's hermits were all active in those\nregions with which he was familiar from his own career or upbringing:\nGalilee, Antioch and Jerusalem. It is possible, though unlikely, given his\nfamiliarity with the ecclesiastical affairs of his day, that he may not have\nknown of similar eremitical settlements on Mt Carmel contemporary with\nhis work, c. 1120-60. It is also possible that Gerard did not write about\nhermits on Mt Carmel because they were Greek Orthodox rather than\nFrankish monks. As we have seen, the northern summit and slopes of the\nmountain, around the cave of Elijah, and the spring of Elijah, where the\nruins of St Elisha were to be found, seem until the settlement of 'B. and\nthe other hermits' to have been the preserve of the Greeks. This made it\neasy for Ribot to claim the continuous occupation of Mt Carmel, and, by\nskipping lightly over the topography, to annex the Orthodox communities\nto the later Frankish foundation.\nDespite the implausibility of Ribot's use of Aimery of Antioch to bring\ntogether Orthodox and Latin hermits into a single order, Greek influence\non the early Carmelites cannot be ruled out. Ribot's impression of an\norder in which Franks joined an existing Greek tradition is exemplified by\nthe figure of Cyril of Constantinople, the putative author of the letter of\nEusebius of the Black Mountain. The Cyril used by Ribot to transmit\ninformation about the 'Byzantine period' of the order was, by the\nfourteenth century, honoured as the third prior-general of the Carmelites.\nJohn Bale, relying on Ribot and others, says that Cyril was born in\nConstantinople and began his career in Asia Minor, where he converted\nthe 'king of Iconium' to Christianity. He was Manuel Comnenus's legate\nto Pope Alexander in, then in 1165 was summoned in a vision to Armenia,\nwhere he preached for a further ten years, baptising the king. He then\nseems to have joined the community of Mt Carmel, and ruled as prior\nfrom 1208 until his death in 1234.78 This biography is repeated in slightly\ndifferent form by Ribot's editor Daniel, according to whom Cyril was\nsummoned to Mt Carmel by the Blessed Virgin after becoming convinced\nof the truth of the Latin theological position on the Holy Spirit and\ndisputing with the patriarch of Constantinople.79 The Centuriators'\naccount of Cyril concentrates on the conversion of the Armenian king\n78\n Bodl. Lib., MS Selden Supra 41, fo. i5or. Bale also mentions a Greek follower of Cyril,\nTheolophorus, who was apparently sent by the order to Joachim of Fiore.\n79\n Speculum Carmelitanum, i. 4 . S o m e e x p l a n a t i o n was obvious ly n e e d e d by the C a r m e l i t e s\nfor the presence of a Greek as prior-general. The procession of the Holy Spirit had, by the\nmid-twelfth century, become the major theological issue dividing Greeks and Latins, and\nthe story of the dispute with the patriarch may be based on the historical figure of Hugo\nEtherianus, who participated in the Council of Constantinople in 1166. The Armenian\ninterlude must refer to the attempts by Manuel Comnenus to reunite the Greek and\nArmenian Churches, and to the partial conversion of Armenia to papal obedience in the\nthirteenth century. Zimmermann accepted Cyril's existence as genuine but not his\nByzantine origins: Monumenta, i. 295.\n234\nORIGINS OF THE CARMELITE ORDER\n(giving the year 1181), and supplies verses by the fifteenth-century\nCarmelite humanist Baptista Mantuanus about Cyril's later career in\nSicily.80\nIt is unlikely that Ribot simply invented the character of Cyril. The\nother 'primary sources' for the De institutione, John, bishop of Jerusalem\nand William of Sandwich, were real figures, even if they left no writings.81\nCyril may have been a Greek monk sufficiently prominent - or obscure\n- in his day to inspire later legends. He is unlikely to have been active over\nthe whole period from the 1160s to 1234, and it would be useful to know\nin which half of this period to place him: was he associated with a pre-\nCarmelite Orthodox community on Mt Carmel, or with the development\nof the order after the regulation of St Albert and the papal confirmation\nof 1226? If the latter, then he provides evidence of a Greek monk\nbecoming a member of a Latin Order, or possibly even of a joint\nLatin-Orthodox foundation. The Rule itself gives no clues: it is terse and\nuncontroversial, betraying no Orthodox influence at all, though St Basil\ncould have been a model as easily as St Benedict. The Carmelite Order,\nindeed, was to acknowledge Basil as the inspiration of St Albert's Rule.82\nProperly, Albert's canons are not a Rule by a typikon, because they applied\nat the time of writing to a single community rather than an order, but this\nwas as common for foundations in eleventh- and twelfth-century France or\nItaly (such as Fonte Avellana or Obazine) as in the east. The question of\npossible Orthodox influences on the early history of the Carmelite Order\ndemands fuller attention from historians, particularly in the light of the\nrevival of Orthodox monasticism in Palestine reported by pilgrims such as\nJohn Phocas.83\nRibot was writing an apologetic rather than a historical chronicle. His\nuse of history, however, influenced later Carmelites like Bale, and,\nthrough Bale, the Protestant Centuriators. His skilful blend of historical\nfigures like Gerard of Nazareth and Patriarch Aimery with obscurer\nmonks who could form the material for hagiography, like Berthold,\nBrocardus his successor and Cyril of Constantinople, assured for the order\na history that could be linked to the central Christian experiences of\ncrusading and pilgrimage and form part of general Christian aspirations\nfor the Holy Land. Yet there is an irony in the Centuriators' scouring of\nBale's Catalogus for information on the Carmelites, for by this time Bale's\noriginal purpose in collecting historical material had changed. In the\n80\n M a t t h i a s , Duodecimo centuria, 1610.\n81\n F o r J o h n , see Le synaxaire e'thiopien, ed . a n d t r a n s R . Basset a n d o the rs (Pa t ro log ia\nOrientalis i. 1907), 603. He was bishop of Jerusalem 386-417: G.Graf, Geschichte der\nchristlichen arabischen Literatur, i, Vatican 1944, 337. William of Sandwich was prior-\nprovincial for the Holy Land at the fall of Acre, and is mentioned by name in a bull of\nHonorius iv: Bullarium Carmelitarum, i, Rome 1715, 35-6.\n88\n Constitutions des Freres de Notre Dame du Mont Carmel faites I'anne'e 1357, ed. Antoine-\nMarie de la Presentation, Marche 1915, 12.\n83\n Phocas, Descriptio, PG cxxxiii. 949-56. In general see Jotischky, 'Breath of the dove',\n165-80.\n235\nANDREW JOTISCHKY\nCatalogus he still used the same historical methodology, looking beyond the\nmedieval period to establish a line of succession from the very early\nChurch to his own day, but now, rather than proving the venerable\nantiquity of the Carmelite Order, he was arguing passionately for the\nfaithfulness of the Reformation to the origins of Christianity.\n236\n"}