{"doi":"10.1111\/j.1468-4446.2004.00020.x","coreId":"205187","oai":"oai:eprints.lse.ac.uk:11973","identifiers":["oai:eprints.lse.ac.uk:11973","10.1111\/j.1468-4446.2004.00020.x"],"title":"Book review: virtual society?: technology, cyberbole, reality edited by Steve Woolgar","authors":["Whitley, Edgar A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-06","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/205187.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/11973\/1\/Book%20review%20virtual%20society%28lsero%29.pdf","pdfHashValue":"a66904dce809c12a1006d85e74435b7e7ff7b313","publisher":"Wiley-Blackwell Publishing Ltd.","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:11973<\/identifier><datestamp>\n      2017-03-20T16:43:04Z<\/datestamp><setSpec>\n      74797065733D43454E54524553:4C53455F52435F496E666F5F537973<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D4D414E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/11973\/<\/dc:relation><dc:title>\n        Book review: virtual society?: technology, cyberbole, reality edited by Steve Woolgar<\/dc:title><dc:creator>\n        Whitley, Edgar A.<\/dc:creator><dc:subject>\n        HM Sociology<\/dc:subject><dc:publisher>\n        Wiley-Blackwell Publishing Ltd.<\/dc:publisher><dc:date>\n        2004-06<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/11973\/1\/Book%20review%20virtual%20society%28lsero%29.pdf<\/dc:identifier><dc:identifier>\n          Whitley, Edgar A.  (2004) Book review: virtual society?: technology, cyberbole, reality edited by Steve Woolgar.  British Journal of Sociology, 55 (2).  pp. 311-312.  ISSN 0007-1315     <\/dc:identifier><dc:relation>\n        http:\/\/www3.interscience.wiley.com\/journal\/118492688\/home<\/dc:relation><dc:relation>\n        10.1111\/j.1468-4446.2004.00020.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/11973\/","http:\/\/www3.interscience.wiley.com\/journal\/118492688\/home","10.1111\/j.1468-4446.2004.00020.x"],"year":2004,"topics":["HM Sociology"],"subject":["Article","NonPeerReviewed"],"fullText":"  \nEdgar A. Whitley \nBook review: virtual society?: technology, \ncyberbole, reality edited by Steve Woolgar \n \nArticle (Accepted version) \n(Unrefereed) \n \nOriginal citation: \nWhitley, Edgar A. (2004) Book review: virtual society?: technology, cyberbole, reality edited by \nSteve Woolgar. British journal of sociology, 55 (2). pp. 311-312. ISSN 0007-1315 \n DOI: 10.1111\/j.1468-4446.2004.00020.x \n \n© 2004 Wiley-Blackwell Publishing \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/11973\/ \nAvailable in LSE Research Online: August 2012 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \nWoolgar Steve (2002) Virtual society? Technology, cyberbole, reality. Oxford \nUniversity Press, Oxford. (ISBN 0-19-924875-3) \n \nThis book presents (some of the) research undertaken as part of a £3 million \nESRC funded programme: Virtual society? The social science of electronic technologies \n(http:\/\/virtualsociety.sbs.ox.ac.uk).  The programme took an avowedly sceptical \nview of the internet and other electronic technologies and drew on key ideas and \ninsights from the social sciences with the aim of moving beyond the hyperbole \nthat is often found in this area. \n \nIn many cases, a “book of a programme” runs the risk that there is limited \ncoherence between the chapters.  To address this, in the opening chapter, \nWoolgar proposes five ‘rules’ of virtuality that arise from the many “counter-\nintuitive” results reported by the programme: \n• The uptake and use of the new technologies depend crucially on local \nsocial context; \n• The fears and risks associated with new technologies are unevenly socially \ndistributed; \n• Virtual technologies supplement rather than substitute for real activities; \n• The more virtual the more real; \n• The more global the more local. \n \nThe remaining chapters of the book present summaries of the research \nundertaken by various projects and it is in this area that the book, as opposed to \nthe underlying programme, is at its weakest. \n \nAs a researcher interested in the social study of information technology, I failed \nto see that the many results were as “counter-intuitive” as claimed; indeed, they \ntypically provided further empirical support for fairly straightforward academic \nclaims (I find it a useful test to try negating such claims to see if they are realistic \npropositions: for example, is any social scientist likely to hypothesise that uptake \nand use of new technologies doesn’t depend crucially on local factors?). \n \nAmongst the most interesting chapters for me were those that overlapped areas \nof concern in my own discipline (information systems), particularly the chapters \nby Knights et al., McGrail, Mason et al., Brown and Lightfoot and Hughes et al on \norganisational transformation , surveillance, e–mail and standardisation.  It was \nalso very apparent from these chapters, however, that they were generally very \nmuch stuck in their own literatures on technology, society and organisations, \nrather than drawing on the many other perspectives that exist in these areas.  \nAgreed, the worst of this broader literature is uncritical management hype, but \nthere is also much well written material there.  To illustrate the extent of this \nproblem, I found fewer than 30 references, amongst the 26 pages of references, to \njournals in information systems and management that could have provided \nuseful insights onto the issues these projects were researching. \n \nThe programme was funded by a UK social science funding body and as a result, \nmost of the research is (understandably) UK based; nevertheless given the topic \nand the social science focus I was struck by a number of important missing \ntopics.  Thus whilst there is some discussion of globalisation, there is little talk of \ngender (one reference in the index) of race or of identity (not listed at all in the \nindex), despite these being topics that are widely acknowledged by social \nscientists as being affected by electronic technologies. \n  \nAnother conspicuous absence from the book is any consistent consideration of \ntheorising; what the reader is given is empirical data and countless reminders \nthat the data illustrate several of Woolgar’s rules of virtuality.  There are few \nattempts to step up from the data to draw broader conclusions.  When theorising \ndoes occur, as in the superb chapter by Agar et al. and, to a lesser extent, in \nStrathern’s closing piece, the difference in quality is immediately apparent. \n \nOverall, therefore, the book is quite useful for those looking into the social \nscience of electronic technologies, but for true insights and theoretical \ncontributions, unfortunately, it is best to look elsewhere. \n \n \nDr. Edgar A. Whitley \nReader in Information Systems \nLondon School of Economics and Political Science \nhttp:\/\/is.lse.ac.uk\/staff\/whitley \n \n"}