{"doi":"10.1103\/PhysRevB.78.085202","coreId":"100842","oai":"oai:epubs.surrey.ac.uk:240","identifiers":["oai:epubs.surrey.ac.uk:240","10.1103\/PhysRevB.78.085202"],"title":"Evolution of vacancy-related defects upon annealing of ion-implanted germanium","authors":["Slotte, J","Rummukainen, M","Tuomisto, F","Markevich, VP","Peaker, AR","Jeynes, Christopher","Gwilliam, Russell"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-08-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER PHYSICAL SOC","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:240<\/identifier><datestamp>\n      2017-10-31T13:57:16Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:696F6E5F6265616D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/240\/<\/dc:relation><dc:title>\n        Evolution of vacancy-related defects upon annealing of ion-implanted germanium<\/dc:title><dc:creator>\n        Slotte, J<\/dc:creator><dc:creator>\n        Rummukainen, M<\/dc:creator><dc:creator>\n        Tuomisto, F<\/dc:creator><dc:creator>\n        Markevich, VP<\/dc:creator><dc:creator>\n        Peaker, AR<\/dc:creator><dc:creator>\n        Jeynes, Christopher<\/dc:creator><dc:creator>\n        Gwilliam, Russell<\/dc:creator><dc:publisher>\n        AMER PHYSICAL SOC<\/dc:publisher><dc:date>\n        2008-08-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/240\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Slotte, J, Rummukainen, M, Tuomisto, F, Markevich, VP, Peaker, AR, Jeynes, Christopher and Gwilliam, Russell  (2008) Evolution of vacancy-related defects upon annealing of ion-implanted germanium   PHYSICAL REVIEW B, 78 (8), ARTN 0.       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevB.78.085202<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/240\/","10.1103\/PhysRevB.78.085202"],"year":2008,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Evolution of vacancy-related defects upon annealing of ion-implanted germanium\nJ. Slotte, M. Rummukainen, and F. Tuomisto\nDepartment of Engineering Physics, Helsinki University of Technology, P.O. Box 1100, FI-02015 HUT, Finland\nV. P. Markevich and A. R. Peaker\nCentre for Electronic Materials, Devices and Nanostructures, University of Manchester, Sackville Street, P.O. Box 88,\nManchester M60 1QD, United Kingdom\nC. Jeynes and R. M. Gwilliam\nUniversity of Surrey Ion Beam Centre, Guildford GU2 7XH, United Kingdom\n\u0001Received 2 April 2008; revised manuscript received 23 June 2008; published 1 August 2008\u0002\nPositron annihilation spectroscopy was used to study defects created during the ion implantation and an-\nnealing of Ge. Ge and Si ions with energies from 600 keV to 2 MeV were implanted at fluences between 1\n\u00011012 cm−2 and 4\u00011014 cm−2. Ion channeling measurements on as-implanted samples show considerable\nlattice damage at a fluence of 1\u00011013 cm−2 and a fluence of 1\u00011014 cm−2 was enough to amorphize the\nsamples. Positron experiments reveal that the average free volume in as-irradiated samples is of divacancy size.\nLarger vacancy clusters are formed during regrowth of the damaged layers when the samples are annealed in\nthe temperature range 200–400 °C. Evolution of the vacancy-related defects upon annealing depends notice-\nably on fluence of ion implantation and for the highest fluences also on ion species.\nDOI: 10.1103\/PhysRevB.78.085202 PACS number\u0001s\u0002: 61.72.J\u0002, 71.55.Cn, 78.70.Bj\nI. INTRODUCTION\nIn recent years we have witnessed a growing interest of\ngermanium as an active element in semiconductor technol-\nogy. The ever increasing performance demands, with de-\ncreasing feature sizes as a consequence, may be better met\nusing germanium. Germanium has higher bulk carrier mo-\nbilities than Si or SiGe and in consequence holds the possi-\nbility of higher channel mobility in metal-oxide–\nsemiconductor field-effect transistor \u0001MOSFET\u0002 devices\nparticularly in the presence of strain.1 Due to the dominance\nof silicon in semiconductor industry, very little research has\nbeen conducted on the properties of ion-implanted germa-\nnium until recently. Some of this work and an extensive\ncomparison of the material properties of silicon and germa-\nnium have been compiled by Vanhellemont and Simoen.2\nRecently Hickey et al. reported on defect formation and\nevolution during regrowth of amorphized ion-implanted Ge.3\nThey observed regrowth related defects in annealed 1 MeV\nSi implanted Ge. End of range defects were minimal and\nannealed out between 450 and 550 °C while regrowth de-\nfects were more stable. In addition their implant conditions\nwere such that a crystalline region remained at the surface\nresulting in solid phase regrowth occurring from two parallel\nseed planes resulting in clamshell defects being formed\n\u0001sometimes called a zipper band\u0002 where the two parallel re-\ngrowth planes meet. In contrast to Si4 these defects are more\nstable than end of range defects.\nPositron annihilation spectroscopy \u0001PAS\u0002 has been estab-\nlished as a versatile tool for studying open volume defects in\nsemiconductors.5 However, as with other techniques, very\nlittle work has been published on germanium. Positron life-\ntime studies have been performed on bulk crystals, with de-\nfects of monovacancy size reported by Moser et al.6 Vacancy\nclustering and the annealing of these clusters has been stud-\nied by Krause-Rehberg et al.7\nIn this work we present results obtained by PAS and sup-\nported by Rutherford backscattering spectrometry\/\nchanneling \u0001RBS-c\u0002 on lattice damage and defects created in\nion-implanted highly damaged or amorphized Ge. For all\nfluences annealing caused the formation of large vacancy\nclusters. However, after the highest fluence implantations\nwhich result in clamshell \u0001or zipper\u0002 defect formation, a dis-\ntinct difference between Si and Ge implanted samples is ob-\nserved in the annealings.\nII. SAMPLES AND EXPERIMENT\nThe samples were Si and Ge implanted Sb-doped n-type\nGe. The first wafer \u0001samples 1x−x\u0002 was in the \u0003100\u0004 direc-\ntion and the resistivity was measured to be \u0003\n=1.6–1.9 \u0004cm. The orientation of the second wafer\n\u0001samples 2x−x\u0002 was \u0003100\u0004 tilted 9° toward \u0003111\u0004 with a re-\nsistivity \u0003=0.15–0.17 \u0004cm. Six sets of samples were im-\nplanted with Si and Ge at fluences 1\u00011012–4\u00011014 cm−2.\nThe ion energies were 600 keV and 950 keV for Si, and 2\nMeV for Ge. The Ge and Si fluences were chosen to yield\nsimilar damage, as calculated by TRIM.8 The implantation\ndepth corresponding to the 950 keV Si ions and 2 MeV Ge\nions is approximately 1 \u0005m. The samples were subsequently\nannealed for 30 min at temperatures 200, 300, 400, and\n500 °C in a N2 atmosphere. For the RBS-c measurements9\nwe chose a representative set from the samples used in the\nPAS study. The samples used in the study are summarized in\nTable I.\nWe used a monoenergetic positron beam and the PAS\nDoppler broadening technique to study defects created by the\nion implantation. In Doppler broadening spectroscopy the\nmomentum of the annihilating electron-positron pair is de-\ntected as broadening of the 511 keV annihilation peak. We\nused two Ge detectors with an energy resolution 1.2 keV at\nPHYSICAL REVIEW B 78, 085202 \u00012008\u0002\n1098-0121\/2008\/78\u00018\u0002\/085202\u00015\u0002 ©2008 The American Physical Society085202-1\n511 keV for measuring the annihilation spectra. The annihi-\nlation spectra were described using the conventional S and W\nshape parameters.5 The S parameter energy window was p\u0006\n\u00073.2\u000110−3 m0c, where p\u0006 is the momentum of the\nelectron-positron pair. The W parameter windows were se-\nlected as 12\u000110−3 m0c\u0007p\u0006\u000730\u000110−3 m0c. The shape\nparameters reflect the environment of the annihilation site.\nTypically vacancies are detected as an increase \u0001decrease\u0002 of\nthe S \u0001W\u0002 parameter from the bulk value. For clusters of a\nfew missing atoms the S parameter increases almost linearly\nwith the vacancy size in Si.10 The W parameter decreases at\nthe same time but the decrease becomes smaller for every\nmissing atom. For large vacancy clusters, however, both pa-\nrameters saturate. The measured S and W parameters are su-\nperpositions of S and W parameters corresponding to differ-\nent positron annihilation states in the lattice. Hence, the\nmeasured parameters are given by\nS = \bBSB +\u0005 \bDiSDi, \u00011\u0002\nW = \bBWB +\u0005 \bDiWDi, \u00012\u0002\nwhere \bB is the fraction of positrons annihilating in the bulk\nstate and \bDi is the fraction of positrons annihilating in the\ndefect state i. SB \u0001WB\u0002 and SDi \u0001WDi\u0002 are the bulk and defect\ni S \u0001W\u0002 parameters, respectively. If a sample contains only\ntwo annihilation states, the W\u0001S\u0002 plot of the measurement\nshould form the segment of a line between these states, e.g.,\nbulk and defect state.\nFor the RBS-c analysis we used a 4He+ 1.554 MeV ion\nbeam at scattering angles 148.2° and 172.8°. Channeling\nmeasurements were done with the beam aligned along the\n\u0003100\u0004 channel and with a beam current of approximately 10\nnA.\nIII. RESULTS AND DISCUSSION\nA. RBS-c\nFigure 1 shows a representative set of the samples studied\nwith RBS-c. As can be observed, the spectrum from the as-\nimplanted sample \u0001Ge fluence 1\u00011014 cm−2\u0002 coincides with\nthe random spectrum, indicating that the sample was com-\npletely amorphous in the studied depth interval. Reducing\nthe implantation fluence by an order of magnitude resulted in\napproximately 65%–75% of the atoms being displaced. After\nannealing at 300 °C a 50 nm-thin crystalline layer is ob-\nserved at the surface. An increase in annealing temperature to\n400 °C essentially regrows the crystalline structure of the\nmaterial. However a large number of dislocations is left in\nthe sample. Furthermore the line defects observed are con-\nsistent with clamshell defects. The dislocations indicating\nclamshell defects can be seen as a characteristic change in\nslope of the RBS yield at a depth of approximately 500 nm.\nThe clamshell defects are also present in the sample annealed\nat 500 °C, which seems to yield slightly more dechanneled\nions than the sample annealed at 400 °C.\nThe appearance of the clamshell defects at 500 nm, to-\ngether with a thin crystalline layer observed after the 300 °C\nanneal, indicate that the ion implantation leaves a crystal\nseed at the surface. This results in regrowth both from the\nsurface and from the bulk during the annealings.\nB. PAS\nA representative set of the S parameter as a function of\npositron implantation energy for as-implanted \u0001fluence\n\u00071014 cm−2\u0002 and annealed samples is shown in Fig. 2. The\nresult for all the as-implanted samples, both Ge and Si im-\nplanted, was similar. The S parameter strongly decreased at\nenergies below 5 keV due to positron diffusion and annihi-\nlations at the sample surface. As the positron implantation\nenergy was increased, the S parameter reached a value of\nS \/SB=1.047 in the most damaged region. At positron im-\nplantation energies above 20 keV, the S parameter started to\ndecrease as positrons penetrate deeper than the implanted\nions, thus probing the defect free Ge bulk. The level of the S\nparameter, thus, does not depend on the fluence or on the ion\nused. This shows that the same types of defects are present\nand the concentration of positron trapping defects is high\nenough to produce saturated trapping into open volume de-\nfects. Similar saturation of the annihilation parameters after\nion implantation has been found earlier in Si.11\nFor annealed Ge implanted \u0001fluence 1\u00011013 cm−3\u0002\nsamples, at energies 5–20 keV, there is a large peak in the S\nparameter that corresponds to defects in the implanted layer.\nTABLE I. Properties of the studied sample sets. Every set con-\ntains an as-implanted sample and samples annealed at 200, 300, 400\nand 500 °C for 30 min.\nSample Template Ion Energy Fluence\n11−x Ge-1 Si 950 keV 4\u00011013 cm−2\n12−x Ge-1 Ge 2 MeV 1\u00011013 cm−2\n13−x Ge-1 Si 950 keV 4\u00011014 cm−2\n14−x Ge-1 Ge 2 MeV 1\u00011014 cm−2\n21−x Ge-2 Si 600 keV 1\u00011012 cm−2\n22−x Ge-2 Ge 2 MeV 1\u00011013 cm−2\n100\n80\n60\n40\n20\n0\nA\nto\nm\nic\n%\n120010008006004002000\nDepth [nm]\nVirgin crystal\n14-x Ge:Ge, as implanted\n14-x Ge:Ge, 300\no\nC\n14-x Ge:Ge, 400\no\nC\n14-x Ge:Ge, 500\no\nC\nFIG. 1. \u0001Color online\u0002 A representative set of the samples stud-\nied with RBS-channeling. Also included in the figure is the spec-\ntrum from a Ge virgin sample. The clamshell defects can be seen in\nthe samples annealed at 400 °C and 500 °C as a change in slope in\nthe RBS yield at a depth of approximately 500 nm.\nSLOTTE et al. PHYSICAL REVIEW B 78, 085202 \u00012008\u0002\n085202-2\nThe height of this peak increases for annealing temperatures\nup to 400 °C. After annealing at 500 °C the measured S\nparameter is close to that observed in bulk Ge for positron\nimplantation energies above 20 keV; closer to the surface at\nlower implantation energies the S parameter is above the\nparameter for the positron trap free Ge bulk crystal, indicat-\ning that there are still open volume defects left after anneal-\ning.\nVacancy-donor pairs and divacancies have been found to\nbe mobile in Ge already at the lowest annealing temperature\nof 200 °C.12–14 After annealing at 200 °C the S parameter\nforms a peak at S \/SB\u00061.09, i.e., the difference to the bulk\nvalue is doubled from the one recorded in the as-implanted\nsamples. At the same time there is a corresponding decrease\nin the W parameter. The S parameter is closely related to the\nopen volume of the defects. There are very few quantitative\nPAS studies done in germanium and to make a more exact\nestimate of the cluster size is therefore difficult. However, a\nqualitative estimate can be made by using the present results\nin conjunction with the recent result for the Ge divacancy15\nand by comparing with similar studies in silicon.10 Hakala et\nal. found an approximately linear relation between the nor-\nmalized S parameter and the cluster size. With this approxi-\nmation and taking into account that the ratio \tV2 \/\tB between\nthe positron lifetime in a divacancy \tV2 and in a defect free\nlattice \tB is similar for Si and Ge, one gets approximately\nfive missing atoms in the samples annealed at 200 °C.\nThe maximum S and minimum W parameter values as a\nfunction of annealing temperature from the most damaged\nregion are shown as a function of annealing temperature in\nFig. 3. Annealing the samples at 300 °C and at 400 °C in-\ncreases the S parameter to S\u00061.11. The further increase in\nthe S parameter suggests that the size of the vacancy clusters\nincreases slightly to six to seven missing atoms. Finally, the\nS parameter drops to approximately the level observed in the\nbulk after an anneal at 500 °C. This shows that most defects\nanneal out of the sample at 500 °C. This is consistent with\nearlier studies on annealing of ion implantation damage and\nrecrystallization of amorphous Ge where it has been found\nthat the defects are removed at temperatures\n300–500 °C.16–18 The annealing temperature of the ob-\nserved vacancy clusters is similar to what Krause-Rehberg et\nal.7 found in high-stress and low-temperature deformed high-\npurity germanium.\nIt should be noted that the estimates for the cluster sizes\nare lower limits, since it is assumed that the positron trapping\nto the clusters is in saturation, i.e., all positrons annihilate in\nthe clusters. The very sharp triangle shaped W\u0001S\u0002-curve\nshown in Fig. 4 \u000112−x, 400 °C\u0002 is a clear indication that the\npositron diffusion length at the depth of the maximum S\nparameter is very short, i.e., the positron trapping is in satu-\nration or very close to saturation. Similar sharp triangle\nshaped curves were obtained for all annealed samples with\nvarying cluster sizes. We therefore estimate that the cluster\n1.10\n1.05\n1.00\n0.95\n0.90\nS\/\nS B\n3020100\nPositron implantation energy [keV]\nGe reference\n11-1 Ge:Si\n12-1 Ge:Ge\n12-x Ge:Ge, 200\no\nC\n12-x Ge:Ge, 400\no\nC\n12-x Ge:Ge, 500\no\nC\nFIG. 2. The low-momentum parameter S as a function of posi-\ntron implantation energy for a representative set of as-implanted\n\u0001fluence \u00071014 cm−2\u0002 and annealed samples. The data has been\nscaled to a positron trap free Ge bulk crystal.\n1.0\n0.8\n0.6\nW\n\/W\nG\ne\n5004003002001000\nAnneal temperature (\no\nC)\n1.12\n1.08\n1.04\n1.00\nS\n\/S\nG\ne\n11-x\n12-x\n21-x\n22-x\nFIG. 3. \u0001Color online\u0002 The S and W parameter values corre-\nsponding to the top of the peak \u0001bottom of the valley\u0002 of the S \u0001W\u0002\nparameter curve as a function of annealing temperature. The data\nhas been scaled to the parameters measured in bulk Ge with SGe\n=0.517 and WGe=0.036.\n1.0\n0.9\n0.8\n0.7\n0.6\nW\n\/W\nG\ne\n1.121.081.041.00\nS\/SGe\nRT\n12-x Ge:Ge, 400\no\nC\n11-x Ge:Si\n12-x Ge:Ge\n22-x Ge:Ge\n200\no\nC\n300\no\nC 400\no\nC\n500\no\nC\nFIG. 4. \u0001Color online\u0002 W\u0001S\u0002-plot for the 12−x sample annealed\nat 400 °C. Also indicated in the figure are the cluster points for\nsome of the annealed samples. The dashed line indicates the super-\nposition between the bulk and cluster annihilation states.\nEVOLUTION OF VACANCY-RELATED DEFECTS UPON… PHYSICAL REVIEW B 78, 085202 \u00012008\u0002\n085202-3\nconcentration is in the 1017–1018 cm−3 range. Indicated in\nFig. 4 is also the turning point from the surface-cluster line\nto the cluster-bulk line, i.e., the tip of the triangle where the\nS parameter is at maximum, for some of the annealings. As\ncan be seen the slope of the cluster-bulk line, indicated for\nthe samples annealed at 400 °C as a dashed line, changes\nwith annealing temperature. This is a clear indication that the\ndefect species changes, i.e., the cluster size changes, with\nannealing temperature.\nVacancy clustering was observed also in the sample set\nwith the lowest Si fluence 1\u00011012 cm−3. Figure 3 shows\nthat in this case the S parameter increases after the anneal at\n200 °C but remains below that observed in the other sample\nsets. The lower S parameter can be due to a smaller cluster\nsize or a lower cluster concentration. This is expected when\nthe clusters form through conglomeration of smaller mobile\ndefects and the original defect concentration is lower. After\nannealing at 300 °C the S parameter is slightly below the\nlevel observed after the 200 °C anneal. In the sample an-\nnealed at 400 °C the S parameter drops to a level S=1.007,\nindicating that nearly all the defects were removed in the\nanneal. The S parameter decreases further after an anneal at\n500 °C and no defects are detected. As can be seen from Fig.\n3, no difference in defect evolution is observed between Si\nand Ge implantation when the estimated implantation dam-\nage was equal. In these samples the S parameter increases\nwith annealing temperatures 200–400 °C while the W pa-\nrameter is almost constant. The nonlinear behavior of the S\nand the W parameters shows that the defect type changes in\nthe annealing.\nFigure 5 shows the annealing behavior of the samples\nwith the highest implantation fluences for the Si and Ge im-\nplantations. The behavior differs significantly from the lower\nfluences, even though no differences are observed with PAS\nin the as-implanted samples, i.e., the average open volume\ndoes not differ as a result of the ion species or ion fluence.\nHowever as can be observed the behavior after annealing is\nquite different depending on the ion used in the implantation.\nRBS-c measurements of the Ge implanted sample showed\ncomplete amorphization \u0001Fig. 1\u0002; this is also expected for the\nSi implanted case. Already at 200 °C a peak in the S param-\neter starts to develop at a depth of approximately 1 \u0005m.\nWhen the annealing temperature is increased to 300 °C a\nsecond peak near the surface appears in the silicon implanted\nsample. This peak continues to grow and reaches approxi-\nmately the same S parameter value as the single peak ob-\nserved in the samples implanted with a lower fluence. The\npeak at 1 \u0005m grows with increasing annealing temperature\nfor both the silicon and germanium implantation and shows a\nslight shift toward the surface. The height of the deeper peak\nis approximately 1.08\u0001SB, i.e., lower than in the samples\nimplanted with lower fluences. The behavior of the open\nvolume defects at depths around 1 \u0005m for both the Ge and\nSi implanted case can be explained by the appearance of the\nclamshell defects at 500 nm, which prevent the formation of\nlarger vacancy clusters beyond the clamshell defects, i.e.,\nvacancy-vacancy defect interaction is suppressed. A probable\nexplanation for the distinct difference in behavior above the\nclamshell defects, with apparently smaller open volume de-\nfects in the Ge implanted case and with large vacancy clus-\nters forming during annealings at 200–400 °C, is the differ-\nence in deposited energy in this region during ion\nimplantation. For the heavier and more energetic Ge ion the\ndeposited energy in the track region of the ions will be much\nlarger than for the lighter and less energetic Si ion, even\nthough the calculated damage in the end of range is similar\nfor the two cases. Even though both implantations result in\nan amorphous layer, differences can occur in the seed for\nregrowth at the surface, or there could be more ordered struc-\ntures left in the Si implanted case. Also noteworthy is that\nthe open volume defects are found in both samples and in\nboth regions, above and beyond the clamshell defects, even\nafter annealing at 500 °C.\nIV. CONCLUSIONS\nIn summary, we have studied implantation damage in Si\nand Ge implanted Ge, with the ion fluence varying between\n1\u00011012 cm−2 and 4\u00011014 cm−2. Positron annihilation\nspectroscopy and Rutherford backscattering\/channeling have\nbeen used for characterization of lattice damage, extended\nand point defects. In the as-implanted samples, channeling\nmeasurements show considerable lattice damage at a fluence\nof 1\u00011013 cm−2 and a fluence of 1\u00011014 cm−2 was enough\nto amorphize the crystal structure. Positron annihilation\nspectroscopy in the Doppler broadening mode gives the an-\nnihilation parameters S=1.047 and W=0.79 independently of\nion and fluence for the as-implanted samples. The annihila-\ntion parameters indicate an average free volume approxi-\nmately of divacancy size. In annealed layers channeling mea-\nsurements show recovery of the damaged region beginning\nfrom the surface and vacancy clustering is detected by\npositrons. The cluster size depends on the fluence. Annealing\nat 500 °C was enough to remove all the defects when the ion\nfluence was below 4\u00011013 cm−2. For samples implanted\nwith fluences above 1014 cm−2, channeling measurements\nrevealed clamshell defects at a depth of approximately 500\n1.10\n1.08\n1.06\n1.04\n1.02\n1.00\n0.98\nS\/\nS B\n3020100\nPositron implantation energy [keV]\n13-x Ge:Si, 300\no\nC\n13-x Ge:Si, 400\no\nC\n13-x Ge:Si, 500\no\nC\n14-x Ge:Ge, 200\no\nC\n14-x Ge:Ge, 400\no\nC\n14-x Ge:Ge , 500\no\nC\nFIG. 5. The low-momentum S parameter measured at room tem-\nperature after 30 min anneal for the set 13−x with Si fluence 4\n\u00011014 cm−2 and the set 14−x with Ge fluence 1\u00011014 cm−2. The\ndata has been scaled to the parameters measured in bulk Ge with\nSGe=0.517.\nSLOTTE et al. PHYSICAL REVIEW B 78, 085202 \u00012008\u0002\n085202-4\nnm. These clamshell \u0001or zipper\u0002 defects strongly influence\nthe annealing behavior of open volume defects. Also a dif-\nference between Si and Ge implants in the near surface re-\ngion is observed. This difference is explained by differences\nin the deposited energy during implantation in this region of\nthe samples.\nACKNOWLEDGMENTS\nWe would like to thank Umicore for providing the germa-\nnium wafers. The authors wish to acknowledge the contribu-\ntion of the late Professor Kimmo Saarinen.\n1 M. L. Lee, E. A. Fitzgerald, M. T. Bulsara, M. T. Currie, and A.\nLochtefeld, J. Appl. Phys. 97, 011101 \u00012005\u0002.\n2 J. Vanhellemont and E. Simoen, J. Electrochem. Soc. 154, H572\n\u00012007\u0002.\n3 D. P. Hickey, Z. L. Bryan, K. S. Jones, R. G. Elliman, and E. E.\nHaller, Appl. Phys. Lett. 90, 132114 \u00012007\u0002.\n4 K. S. Jones, S. Prussin, and E. R. Weber, Appl. Phys. A: Solids\nSurf. 45, 1 \u00011988\u0002.\n5 K. Saarinen, P. Hautojärvi, and C. Corbel, in Identification of\nDefects in Semiconductors, edited by M. Stavola \u0001Academic,\nNew York, 1998\u0002, p. 209.\n6 P. Moser, J. L. Pautrat, C. Corbel, and P. Hautojärvi, in Positron\nAnnihilation, edited by P. C. Jain, M. Singru, and K. P. Gopi-\nnathan \u0001World Scientific, Singapore, 1985\u0002, p. 733.\n7 R. Krause-Rehberg, M. Brohl, H. S. Leipner, Th. Drost, A. Pol-\nity, U. Beyer, and H. Alexander, Phys. Rev. B 47, 13266 \u00011993\u0002.\n8 J. F. Ziegler, J. P. Biersack, and U. Littmark, The Stopping and\nRange of Ions in Solids \u0001Pergamon, New York, 1985\u0002.\n9 A. Simon, C. Jeynes, R. P. Webb, R. Finnis, Z. Tabatabaian, P. J.\nSellin, M. B. H. Breese, D. F. Fellows, R. van de Broek, and R.\nM. Gwilliam, Nucl. Instrum. Methods Phys. Res. B 219-220,\n405 \u00012004\u0002.\n10 M. Hakala, M. J. Puska, and R. M. Nieminen, Phys. Rev. B 57,\n7621 \u00011998\u0002.\n11 B. Nielsen, O. W. Holland, T. C. Leung, and K. G. Lynn, J. Appl.\nPhys. 74, 1636 \u00011993\u0002.\n12 V. P. Markevich, I. D. Hawkins, A. R. Peaker, K. V. Emtsev, V.\nV. Emtsev, V. V. Litvinov, L. I. Murin, and L. Dobaczewski,\nPhys. Rev. B 70, 235213 \u00012004\u0002.\n13 P. Ehrhart and H. Zillgen, J. Appl. Phys. 85, 3503 \u00011999\u0002.\n14 A. R. Peaker, V. P. Markevich, L. I. Murin, N. V. Abrosimov, and\nV. V. Litvinov, Mater. Sci. Eng., B 124-125, 166 \u00012005\u0002.\n15 K. Kuitunen, F. Tuomisto, J. Slotte, and I. Capan, Phys. Rev. B\n78, 033202 \u00012008\u0002.\n16 L. Csepregi, R. P. Küllen, J. W. Mayer, and T. W. Sigmon, Solid\nState Commun. 21, 1019 \u00011977\u0002.\n17 A. Satta, E. Simoen, T. Clarysse, T. Janssens, A. Benedetti, and\nB. de Jaeger, Appl. Phys. Lett. 87, 172109 \u00012005\u0002.\n18 I. Suni, G. Göltz, M.-A. Nicolet, and S. S. Lau, Thin Solid Films\n93, 171 \u00011982\u0002.\nEVOLUTION OF VACANCY-RELATED DEFECTS UPON… PHYSICAL REVIEW B 78, 085202 \u00012008\u0002\n085202-5\n"}