{"doi":"10.1111\/j.1467-8543.2005.00345.x","coreId":"92550","oai":"oai:eprints.lse.ac.uk:360","identifiers":["oai:eprints.lse.ac.uk:360","10.1111\/j.1467-8543.2005.00345.x"],"title":"Why have workers stopped joining unions? Accounting for the rise in never-membership in Britain","authors":["Bryson, Alex","Gomez, Rafael"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-03","abstract":"This paper tracks the rise in the percentage of employees who have never become union members (‘never-members’) since the early 1980s and shows that it is the reduced likelihood of ever becoming a member rather than the haemorrhaging of existing members which is behind the decline in overall union membership in Britain. We estimate the determinants of ‘never-membership’ and consider how much of the rise can be explained by structural change in the labour market and how much by change in preferences among employees. We find a similar trend in the unionised sector, indicating that the rise in never membership for the economy as a whole is not linked solely to a decline in the number of recognised workplaces","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/92550.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/360\/1\/whystopbjirfin.pdf","pdfHashValue":"94c6c19966fb0e59de4db6ddf403354fddc82318","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:360<\/identifier><datestamp>\n      2012-06-06T17:54:07Z<\/datestamp><setSpec>\n      74797065733D43454E54524553:4C53455F52435F4D616E5F45636F6E<\/setSpec><setSpec>\n      74797065733D434F4C4C53:4C53455F435F454F<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/360\/<\/dc:relation><dc:title>\n        Why have workers stopped joining unions? Accounting for the rise in never-membership in Britain<\/dc:title><dc:creator>\n        Bryson, Alex<\/dc:creator><dc:creator>\n        Gomez, Rafael<\/dc:creator><dc:subject>\n        HD Industries. Land use. Labor<\/dc:subject><dc:description>\n        This paper tracks the rise in the percentage of employees who have never become union members (‘never-members’) since the early 1980s and shows that it is the reduced likelihood of ever becoming a member rather than the haemorrhaging of existing members which is behind the decline in overall union membership in Britain. We estimate the determinants of ‘never-membership’ and consider how much of the rise can be explained by structural change in the labour market and how much by change in preferences among employees. We find a similar trend in the unionised sector, indicating that the rise in never membership for the economy as a whole is not linked solely to a decline in the number of recognised workplaces.<\/dc:description><dc:date>\n        2005-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/360\/1\/whystopbjirfin.pdf<\/dc:identifier><dc:identifier>\n          Bryson, Alex and Gomez, Rafael  (2005) Why have workers stopped joining unions? Accounting for the rise in never-membership in Britain.  British Journal of Industrial Relations, 43 (1).  pp. 67-92.  ISSN 1467-8543     <\/dc:identifier><dc:relation>\n        http:\/\/www.blackwellpublishing.com\/journals\/BJIR<\/dc:relation><dc:relation>\n        10.1111\/j.1467-8543.2005.00345.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/360\/","http:\/\/www.blackwellpublishing.com\/journals\/BJIR","10.1111\/j.1467-8543.2005.00345.x"],"year":2005,"topics":["HD Industries. Land use. Labor"],"subject":["Article","PeerReviewed"],"fullText":" \n \n \nLSE Research \nArticles Online  \n \n \n \n \nWhy have workers stopped joining \nunions? Accounting for the rise in \nnever-membership in Britain \n \nAlex Bryson and Rafael Gomez \n \n \n \nArticles available via LSE Research Articles Online are protected under \nintellectual property law, including copyright law. Any use made of the \ncontents should comply with the relevant law \n \nCite this version:  \nBryson, A. and Gomez, R. (2005). Why have workers stopped joining \nunions? Accounting for the rise in never-membership in Britain. \nLondon: LSE Research Articles Online.  \nAvailable at: http:\/\/eprints.lse.ac.uk\/archive\/00000360\/\n \n \nThis is an electronic version of an Article published in the British \nJournal of Industrial Relations 43 (1) pp. 67-92 © 2005 Blackwell \nPublishing. http:\/\/dx.doi.org\/10.1111\/j.1467-8543.2005.00345.x \n \n \n \n \nhttp:\/\/eprints.lse.ac.uk  \nContact LSE Research Articles Online at: Library.Researchonline@lse.ac.uk\n  \nWhy Have Workers Stopped Joining Unions?:  \nAccounting for the Rise in Never-membership in Britain \n \nAlex Bryson†  Rafael Gomez‡\nAbstract  \nThis paper tracks the rise in the percentage of employees who have never become \nunion members (‘never-members’) since the early 1980s and shows that it is the \nreduced likelihood of ever becoming a member rather than the haemorrhaging of \nexisting members which is behind the decline in overall union membership in \nBritain.  We estimate the determinants of ‘never-membership’ and consider how \nmuch of the rise can be explained by structural change in the labour market and \nhow much by change in preferences among employees.  We find a similar trend in \nthe unionised sector, indicating that the rise in never membership for the economy \nas a whole is not linked solely to a decline in the number of recognised workplaces.  \n \n \nJEL Classification: J31, J50, J51 \n \nKeywords: Union membership. \n                                                 \n† Policy Studies Institute, 100 Park Village East, London NW1 3SR and Research Associate at the Centre for \nEconomic Performance, London School of Economics; e-mail: a.bryson@psi.org.uk  \n‡ London School of Economics, Interdisciplinary Institute of Management, Houghton Street, WC2A 2AE; \ne-mail: r.Gomez@lse.ac.uk\n 1\n1.Overview \nThe decline in union membership in Britain since the early 1980s is well-documented \n(Millward et al., 2000; Machin, 2000; Sneade, 2001).  Less well-known is the fact that \nthis decline is attributable to a rise in the percentage of employees who have never \nbecome members (‘never-members’).  This is illustrated in Figure 1 with data for the \nperiod 1983-2001 taken from the British Social Attitudes Surveys described in detail in \nSection 3. \n[Figure 1] \nBetween 1983 and 2001, the percentage of employees who had never been a \nmember of a union or staff association rose by over two-thirds from 28% to 48%.  Over \nthe same period, membership fell by a third from 49% to 31%.1  These figures are \nstriking when we compare never membership to other life experiences that mark the \ntransition of persons from young to mature workers (Table 1). Degree attainment and \nmarital status are reported for male and female workers aged 24 to 34 using the BSAS \ndata for 1983-85 and 1999-01 periods. These are cross-tabulated by whether a worker is \nemployed in the union or non-union sector. \n[Table 1] \nThe probability of each life event varies over time, with a growth in degree \nattainment and, for the most part, a decline in marriage rates. The rise in never \nexperiencing union membership, however, overshadows these other changes. Among the \nmale population of this age, workers in the non-unionised sector were twice as likely to \nhave experienced union membership in 1983 than in 2001. A dramatic difference is even \n                                                 \n1 Throughout union membership refers to membership of a union or staff association. \n \n 2\nseen in the unionised sector. This suggests that by 2001, having never joined a union had \nbecome a common life event for the cohort of workers born after the mid 1960s, sharply \ndistinguishing their transition to maturity from cohorts born only a decade or so earlier. \nSince 1994 never-members have been more numerous than union members.  By \nthe end of the century, never-membership was nearly as common as ever having \nexperienced membership (i.e., current and ex-members combined).  Between one-fifth \nand one-quarter of employees say they have been members in the past, a proportion that \nhas not differed much since the early 1980s.  So union membership is not haemorrhaging. \nThis suggests that those who become members are no less happy with membership than \nin earlier years. Support for this conjecture can be found in BSAS data for the period \n1983-2001, which shows no trend in perceptions of union effectiveness as measured by \nwhether union members think the union is doing its job well or not (Bryson and Gomez, \n2002:58-59).  \nThere are three possible explanations for the rise in never-membership.  First, it \ncould be that the types of workers who never became members in the past are increasing \nas a proportion of the workforce. Second, certain types of worker who became members \nin the past are less inclined to do so now. This paper focuses on these two possibilities by \nlooking at the determinants of never-membership over time.  The third possibility is that \neven if workers are similarly inclined to purchase membership, they are facing greater \nconstraints in doing so, thereby creating greater levels of frustrated demand for \nmembership. Other research shows frustrated demand for unionisation is quantitatively \nsignificant in explaining cross-sectional differences in unionisation in the late 1990s \n(Bryson and Gomez, 2003).  Unfortunately, we do not have data on employees’ desire for \n 3\nunionisation over time to assess directly whether this factor has become more important \ntoday than in the past.  However, by focusing on the propensity for never-membership \nwhere individuals have the opportunity to join (that is, where there is a union on-site \nwhich is recognised by the employer for pay bargaining) we can gain in-sight into the \nreasons for declining density in the unionised sector where obstacles to joining are \npresumably less onerous.  It is the density decline within unionised workplaces, rather \nthan the advent of new, non-unionised workplaces, which accounts for most of the \ndecline in unionisation during the 1990s (Millward et al, 2000: 90-94). \nThe remainder of the paper is set out as follows.  Section 2 provides an analytical \nframework linking the contribution of rising never-membership to declining union \ndensity.  Section 3 introduces the data.  Section 4 presents empirical methods. Section 5 \npresents the results in five subsections. First, we establish whether there is an \nindependent time-trend in the rise of never-membership having controlled for \ndemographic, job, workplace and business cycle effects.  Second, we use shift-share \nanalysis to describe the extent to which the rise in never-membership across segments of \nthe workforce can be attributed to changes in workforce composition, on the one hand, \nand within-group never-membership density changes on the other.  Third, we estimate the \nproportion of the aggregate rise in never-membership attributable to compositional \nchange in the workforce, and the proportion attributable to changes in the preferences of \nemployees for never-membership. Fourth, we consider changes over time in the \nsignificance and quantitative importance of demographic, job and workplace \ncharacteristics in understanding changing employee preferences for never-membership, \nholding other factors constant. Fifth, we consider propensities for never-membership \n 4\nwithin the unionised sector, and how these have changed over time.  Section 6 discusses \nthe implications of the results for trade union recruitment and future unionisation rates. \nSection 7 concludes. \n \n2. The Contribution of Rising Never-membership to Union Density Decline\nBefore introducing our data and exploring change in never-membership further, it is \nworth outlining an analytical framework that links changes in never-membership to \nchanges in union density. At any given time, union density is the probability of being a \nunion member , which is equal to 1 minus the probability of being a non-member ; \nwhich itself is the sum of the never-membership and ex-membership rates \nrespectively: \ntu tnu\ntn\ntx\n[1]  . 43421\ntnu\nttt xnu )(1 +−=\nChanges in union density can therefore be attributed to changes in never-membership or \nex-membership rates. Let  denote union density in the period 1983-85 and let \ndenote union density in 1999-2001. The change in the probability of being a union \nmember D over the period is  \n835u\n9901u\n[2]  . 43421\n)1()1(\n8359901\n8359901 nunu\nuuD\n−−−\n−=\nThus, union density is inversely related to changes in the non-membership rate .  A \nrise in the non-membership rate occurs through a decline in either the proportion of \nworkers ever sampling union membership (increasing numbers of never-members) and\/or \nan increase in the proportion of those exiting membership (increasing numbers of ex-\ntnu\n 5\nmembers).2 Equation [3] allows us to capture the relative importance of each effect. Let \n9901835u denote the counterfactual union density rate that would have occurred if the 1983-\n85 non-membership rate incorporated the 1999-2001 never-membership rate. The change \nin union density, D, can therefore be decomposed as: \n[3] [ ] [ ]\n[ ] [ ].)(1)(1\nand\n,)(1)(1\nwhere\n)(\n835835\n)(\n83599012\n)(\n8359901\n)(\n990199011\n21\n8359901835\n99018359901\n444 3444 21444 3444 21\n444 3444 21444 3444 21\nUU\nUU\nxnxnD\nxnxnD\nDDD\n+−−+−=\n+−−+−=\n+=\n \n1D  is the difference between actual union density in 1999-01 and the counterfactual \nunion density in 1983-85 (incorporating the 1999-2001 fraction of never members).   \nis the difference between the counterfactual union density in 1983-85 and actual union \ndensity in 1983-85. The first component is therefore a measure of the effect of ex-\nmembership change (union membership haemorrhaging), while the second component \ncaptures the effect of never-membership change (workers increasingly becoming less \nlikely to join a union). \n2D\n                                                 \n2 Alternatively one could categorise workers as ‘never’, ‘always’ and ‘sometimes’ members. An increase in \nthe rate of exit from membership would manifest itself in an increasing percentage of ‘sometimes’ \nmembers resulting from a reduction in the duration of membership spells.  One could only observe this \ndirectly with panel data tracking individuals over time.  However, unless one makes the assumption that \nswitches in membership status are ‘bunched’ at certain times of year, a reduction in the duration of \nmembership spells would be apparent in our repeat cross-section data as a rise in the ex-membership rate.  \nAs shown in Figure 1, we do not observe this. Research using retrospective work histories for the period \n1975-1993 shows an increase in ‘non-union to non-union’ and a decline in ‘non-union to union’ job \ntransitions over that period, but no trend in ‘union to non-union’ transitions (Disney et al., 1998).  Evidence \nfrom the British Household Panel Survey for 1995-1999 indicates the rate of exit from union membership \ndeclined a little for men and remained stable for women (Machin, 2001).  These studies provide further \nevidence that increasing ‘sometimes’ membership is not the key factor in declining union density. \n \n \n 6\n The results of this decomposition are found in Table 2. Using BSAS data we see \nthat between 1983-85 and 1999-2001 the probability of being a union member (the union \ndensity rate) fell from 48 to 32 percent (a fall of 16 percentage points). Of this 16 \npercentage point drop, fifteen percentage points were attributable to an increase in the \nproportion of workers who stopped sampling union membership for the first time (rising \nnever-membership). Only a single percentage point was due to increases in the proportion \nof workers losing their membership status (rising ex-membership). In other words, rising \nnever-membership accounts for roughly 96 percent of the decrease in union density \nbetween 1983 and 2001. These figures clearly necessitate a closer examination of the \nfactors underling the rise in never-membership over the past two decades.  \n[Table 2] \n3. Data  \nOur analyses use data from the British Social Attitudes Survey Series (BSAS) for the \nperiod 1983-2001. BSAS yields a representative sample of adults aged 18 or over living \nin private households in Great Britain. The survey has been conducted annually since \n1983, with the exceptions of 1988 and 1992, and usually achieves a response rate of 60% \nor more.  Analysis is restricted to employees working at least ten hours per week, a cut-\noff used to filter respondents on questions relevant to employees.  All analyses are \nweighted to account for complex survey design so that survey results can be generalised \nwith confidence to the population of employees in Britain working at least 10 hours per \nweek.  Most of the data are collected through face-to-face interview, supplemented by a \nself-completion questionnaire. (For further details of the survey see Park et al., 2002). \nDescriptions and means of the control variables are presented in Appendix A1. \n 7\n3.1 Measures of unionisation \nThe BSAS series contains information on workplace-level unionisation and individual \nunion membership for every year of the survey, making it one of the longest running \nseries on unionisation in Britain.  The questions are independent of one another in the \nsurvey so that for all employees we can establish individual membership and workplace \nunion status. \nOur measure of workplace unionisation is based on employees’ responses to the \nquestion: ‘At your place of work are there unions, staff associations or groups of unions \nrecognised by the management for negotiating pay and conditions of employment?’3  \nRespondents and interviewers are not provided with a definition of ‘place of work’, but it \nis distinct from ‘employer’ which is used in other employment related questions. Current \nindividual membership status is derived from two questions.  First, employees are asked: \n‘Are you now a member of a trade union or staff association?’4  If they are not currently a \nmember they are asked: ‘Have you ever been a member of a trade union or a staff \nassociation?’  This second question was not asked in 1994 or 1997 so data for these two \nyears are omitted from the analysis. \n \n                                                 \n3 Evidence from linked employer-employee data indicates that lack of awareness about union presence is \nwidespread among employees (Bryson, 2001: 20 and Appendix Table A5).  One may also be concerned \nthat respondents may not fully understand the meaning of the phrase ‘recognised by the management for \nnegotiating pay and conditions’.  This prompted the BSAS team designing the survey to ask those who said \nthere was a recognised union or staff association ‘Can I just check, does management recognise these \nunions or staff associations for the purposes of negotiating pay and conditions of employment?’  This \nquestion has been added since 1998.  In 2001, of the 775 unweighted cases saying ‘yes’ at the first \nquestion, 27 said ‘no’ to the check question and 17 said ‘don’t know’.  Using weighted data, this \nadjustment reduces the percentage of employees saying they worked in a workplace recognising unions by \n3.1 percentage points (from 46.9% to 43.8%). \n4 The union membership figures from 1989 onwards correspond closely to those obtained using the Labour \nForce Survey (Sneade, 2001), although there is a small increase in membership between 1990 and 1991 in \nthe BSAS data which is not apparent in the LFS (Bryson and Gomez, 2002). \n \n 8\n4. Empirical Methods \n4.1 Shift-Share analysis \nTo decompose the overtime change in never membership we employ shift-share analysis. \nFollowing Green (1992), the change in the rate of ‘never-membership’ between the early \nyears in our series (1983-85) and the later years (1999-01) can be written as \n[4]   8385838599019901 gggggg pnpnN ∑−∑=∆\nwhere is ‘never-member’ density within group g, is the proportion of all employees \nin group g, superscripts delineate the grouped years, and the sum is over all groups. Shift-\nshare analysis splits the rise in never-membership into three components so equation [4] \nmay be rewritten as: \ngn gp\n[5] \n))(()()( 8385990183859901838583859901838583859901 gggggggggg ppnnnpppnnN −−∑+−∑+−∑=∆\n \nThe first term on the right-hand side of the expression is the rise in never-member density \nthat would have occurred if the employee composition had stayed the same in 1999-01 as \nin 1983-85 but within-group densities had risen.   The second term is the rise that would \nhave occurred due to change in employee composition if within-group density had stayed \nat its 1983-85 level.  The third term is the interaction of the above two effects and is \ngenerally small by comparison. \n4.2 Linear probability estimation of never-membership \nAll the multivariate estimates of never-membership are based on linear probability \nmodels.  Linear probability models are a multivariate extension of the shift-share \ntechnique for assessing changing determinants of never-membership.  Let the probability \nof never having been a union member be represented by the following equation \n 9\n [6]  iii XY εβ +=  \n \nwhere  is a 0\/1 dummy variable denoting whether individual i is a never-member, is \na vector of variables representing the groups or workforce dimensions mentioned above, \niY iX\nβ is a vector of coefficients and iε is an error term.  The estimated predictions iXβ are \ninterpreted as the probabilities that individual i will never have joined a union.  There are \ntwo drawbacks to the technique.  First, the value of iXβ may be outside the range 0-1, so \nthat it can not be interpreted as a predicted probability.  In fact, the linear probability \nmodel gives results close to the logit model which transforms the probability to avoid this \nproblem.  We ran all our models as logits, confirming that results were indeed very \nsimilar.  Following Green (1992) we chose to use the linear probability model because it \nis the closest multivariate analogue to the shift-share analysis.  The second drawback is \nthat the model is prone to heteroskedasticity (Kennedy, 1998: 243). We employ the \nHuber-White robust variance estimator that produces consistent standard errors in the \npresence of heteroscedasticity. \n5. Results \n5.1 Time-trends in never-membership \nFigure 1 showed a steady rise in never-membership over the period 1983-2001.  This is \nreflected in Table 3 column 1 which shows a gradual rise in the probability that \nemployees will be never-members relative to the base year, 1983.  The trend is only \nsignificantly different from zero from 1987 onwards, with the size of the coefficients \nrising markedly in the second half of the 1990s.  Without controlling for other factors, the \n 10\nprobability of being a never-member rose by 19 percentage points between 1983 and \n2001. If we group years into the periods 1983-85, 1986-89, 1990-93, 1995-98 and 1999-\n01 we see more clearly that there was a significant rise in never-membership in the 1990s \nrelative to the 1980s and that this trend has been accelerating (Table 3, column 2).  This \ntrend is unaffected by the business cycle (Table 3, column 3, where the business cycle is \nproxied with the unemployment-vacancy ratio).5  The time-trend coefficients become \nsmaller with the introduction of basic controls for demographic, job and workplace \ncharacteristics but they remain sizeable and statistically significant (Table 3, column 4).  \nAs noted in Appendix A1, some controls (establishment size, sector, qualifications, and \nthe left-right ideological scale) are not available for all years.  Inclusion of these variables \ntruncates the time-series through the loss of earlier years.  However, the pattern of results \nremains largely unchanged, with the significant rise in never-membership in the second \nhalf of the 1990s apparent in all specifications (results are available from the authors). \n[Table 3] \n5.2 Rising never-membership across and within segments of the workforce \nIn this section, we quantify how much of the rise in never-membership is attributable to \nchanges in the composition of the workforce, and how much is due to changes in the \npropensity for never-membership within different segments of the workforce.   \nIn Table 4 we characterise British workers along thirteen dimensions.  In a recent \npaper we illustrated how demand and supply of unionisation differed across categories \nwithin these worker ‘segments’ (Bryson and Gomez, 2003).  It is clear from columns 3 \n                                                 \n5 We have a relatively short time-series and are only controlling for short-run shifts in the demand for \nlabour.  Hidden to us are macroeconomic cyclical fluctuations over the longer-term which influence \nunionisation. \n \n 11\nand 4 of Table 4 that some types of worker are more likely than others to be never-\nmembers. For instance, ever since the early 1980s, young workers have been more likely \nto be never-members than older workers, as have low earners relative to higher earners, \nand those working in the private sector compared to those working in the public sector.  \nColumns 1 and 2 of Table 4 track changes in workforce composition between the early \npart of our time-series (1983-85) and the latest period (1999-01). They show that women, \nolder workers, part-timers, those with qualifications, non-manual workers, those in \nservices, and those in the private sector all increased their shares in employment by 5 \npercentage points or more.  With the exception of older workers, the workforce segments \nthat have increased their employment share are those where never-membership is \ntraditionally higher. The drift to the political right has also contributed to rising never-\nmembership. There has also been an increase in the share of employment taken by \nqualified workers. However, this has not substantially affected the rate of never-\nmembership because the growth in medium-qualified workers, where never-membership \nwas traditionally highest, is offset by the growth in the highly-qualified who have the \nlowest rates of never-membership.  \n[Table 4] \nThe last row of Table 4 reveals the extent to which the percentage of employees \nin unionised workplaces has declined – from around two-thirds in the early 1980s to \nunder a half at the turn of the century.  Since workplace-level unionisation is associated \nwith rates of never-membership which are around one-quarter to one-third of those in \nnon-unionised workplaces this compositional shift has also contributed to the rise in \nnever-membership. \n 12\nAlthough compositional change in the workforce has contributed to the rise in \nnever-membership, columns 3 and 4 of Table 4 also show considerable within-group \nchange in the percentage of employees who are never-members.  Indeed, what is striking \nis that the rate of never-membership rose for every segment of the workforce over the \nperiod.  The increase was particularly pronounced among young workers even though \nthey had the highest rate of never-membership (with the exception of employees in non-\nunion workplaces) at the beginning of the period. \nBoth compositional change in the workforce and within-group preferences for \nnever-membership have therefore contributed to the rise in never-membership.  We \nquantify their relative contributions to the growth in never-membership in columns 5 and \n6 of Table 4.  We use ‘shift-share’ analysis, described in Section 4.1, which has been \nused on a number of occasions to analyse changes in union membership density.6 The \ntechnique separates out the rise in never-membership that would have occurred through \nwithin-group density change with employee composition fixed at its 1983-85 level, and \nthe rise that would have occurred through change in employee composition if within-\ngroup density had stayed at its 1983-85 level.  Comparing columns 5 and 6 in Table 4, we \nfind that within-group increases account for most of the rise in never-membership in all \n                                                 \n6 There are no studies analysing the rise of never-membership in Britain.  Studies using shift-share analysis \nto quantify the impact of workforce compositional change on the decline in union membership density have \nproduced disparate results. Booth (1989) attributes 42% of the density decline from 1979 to 1987 to \ncompositional change, while Green (1992) found compositional change accounted for just under one-third \nof the density decline between 1983 and 1989.  Others show relatively little impact from compositional \nchange for the first half of the 1980s (Carruth and Disney, 1988; Freeman and Pelletier, 1990).  Bryson and \nGomez (2002) find that, over the period 1983-2001, roughly one-third of the decline in membership density \nwas accounted for by compositional change.  It is difficult comparing across studies due to differences in \nmodel specification and time periods. We are constrained by our data in choosing 1983 as our starting \npoint.  It is difficult to speculate what contribution compositional change would have made if we had been \nable to choose an earlier start date.  It is conceivable that the shake-out of manufacturing employment in \n1980-82 may have increased the contribution made by compositional change. Carruth and Disney (1988:3), \nhowever, find no effect of compositional change in 1978-1982 on union membership. \n   \n 13\nbut one segment.  The exception is union recognition: around half of the rise in never-\nmembership along the dimension of workplace-level unionisation is accounted for by an \nincrease in the rate of never-membership within the ‘no union recognised’ and \n‘recognised union’ categories, while the other half is due to the declining incidence of \nunionised workplaces where never-membership rates are lower. The other compositional \nchange that has a notable impact on the incidence of never-membership is the shift in \nemployment away from the public to the private sector.  There is only one workforce \ndimension where compositional change had a sizeable impact in slowing the rate of \nnever-membership growth, namely the ageing of the workforce.  \n5.3. The impact of compositional and preference change on the  total rise in never-\nmembership \nIt is not possible to ‘read off’ the total contributions of compositional and within-group \nchanges in never-membership to aggregate change in never-membership from the shift-\nshare analysis because the workforce dimensions are not independent of one another.  \nThis requires multivariate analyses.  We run linear probability models, discussed in \nSection 4.2, to estimate the probability that an individual will be a never-member for each \nyear in our BSAS series. We compare two sets of estimates to identify the separate \ncontributions of workforce compositional change and changes in preferences for never-\nmembership.   \nThe first set of analyses run models estimating never-membership for each year, \nor group of years, generating a mean predicted rate of membership based on employees’ \ncharacteristics and preferences for that year or group of years.  We call these our \n‘unrestricted predictions’.  The second set of analyses are run for a base year, or base \n 14\ngroup of years, to predict rates of never-membership in later years, effectively holding \npreferences constant.  The difference between predicted never-membership rates under \nthe unrestricted models versus the restricted models indicates the contribution of \ncompositional change to the increase in never-membership. The contribution of a change \nin preferences to the rise in never-membership is simply the difference between the actual \nnever-membership rate for a year, relative to the baseline period, minus that amount of \nthe change arising from employment shares. \n[Table 5] \nTable 5 shows the contribution of change in workforce composition and changes \nin preferences for never-membership in explaining the rise of never-membership over the \nperiod 1983-2001.  Column (1) tracks the rise in the actual rate of never-membership \nfrom 28% in 1983 to 48% in 2001. Column (2) shows the predicted rates of never-\nmembership for each year based on estimates using data for that year.  It turns out these \nare identical to the figures in column (1).  Column (3) shows a second set of predicted \nrates of never-membership which are generated by estimating individuals’ probability of \nbeing a never-member for each year while holding preferences constant at 1983 values.  \nColumn (4) shows the contribution to the percentage point change in never-membership \nrates relative to 1983 that are accounted for by compositional change arising from growth \nand shrinkage in the segments making up the workforce.  Finally, column (5) shows the \ncontribution of changes in preferences while holding compositional change constant.  We \ncan see that, over the whole period 1983-2001, there was a 20 percentage point rise in \nnever-membership: around sixty percent of the change (12 percentage points) arises from \nchanging employment shares across segments of the workforce, while the remainder (8 \n 15\npercentage points) comes from changes in preferences for never-membership. Figure 2 \npresents the information in graphical form. \n[Figure 2] \nTable 6 presents similar analyses, this time grouping years into five periods: \n1983-85, 1986-89, 1990-93, 1995-98 and 1999-2001.  This helps overcome some of the \nsampling variance arising from estimates based on the single year samples.  Comparing \n1999-2001 with 1983-85, roughly half the rise in never-membership is accounted for by \ncompositional change, and half by changes in preferences. \n[Table 6] \nAs noted earlier, the BSAS series contains a number of variables that are \ncorrelated with never-membership but are not available in all years.  We tested the \nsensitivity of results to the inclusion of these variables. First we added sector and \nworkplace size.  The absence of sector from the survey in 1983 and 1995 means these \nyears are excluded from the analysis.  Workplace size was not significantly associated \nwith never-membership.  However, the probability of being a never-member was 7-13% \n(depending on the period) lower among public sector employees than private sector \nemployees, controlling for other factors.  With these additional variables in the model, \nand with the consequential truncation of the time-series, 7 percentage points of the 14 \npercentage point rise in never-membership between 1984-85 and 1999-2001 can be \naccounted for by compositional change in the workforce. The remaining 7 percentage \npoints is due to a change in preferences. \nNext we added workplace size and qualifications to the estimates presented in \nTable 6.  We regroup the years due to the absence of qualifications data for 1983 and \n 16\n1984.  Neither qualifications nor workplace size have an independent effect on never-\nmembership in our models.  This time, compositional change accounts for 7 of the 12 \npercentage point rise in never-membership between 1985-89 and 1999-2001. \nIn our final sensitivity test, we incorporate workplace size, qualifications and \nattitudes towards distributive justice.  The absence of the attitude data before 1986 means \nthis analysis is confined to the period 1986-2001.  Other research has established a strong \nassociation between more liberal attitudes on this scale and an increased likelihood of \nunion membership (Bryson and Gomez, 2003).  We found being on the ‘right’ of this \nscale (that is, scoring 2.8 or more on a scale of 1 to 5) increased the probability of never-\nmembership by 6-12% relative to being on the ‘left’ of the scale (scoring less than 2.20).  \nWith these variables included, compositional effects account for 7 of the 12 percentage \npoints rise in never-membership between 1986-89 and 1999-2001. \nThese analyses indicate that compositional change and a change in preferences \nboth contribute substantially to the rise in never-membership between the early 1980s and \nlate 1990s.  Although the precise contribution of both varies a little with model \nspecification and the years included in the analyses, compositional change explains a \nlittle over half the change, with a change in preferences accounting for the rest. \n5.4 Changes over time in the significance and quantitative importance of demographic, \njob and workplace characteristics \nLet us turn to changes over time in the significance and quantitative importance of \ndemographic, job and workplace characteristics in understanding changing employee \npreferences for never-membership, holding other factors constant. Earlier we showed that \nnever-membership has risen across all types of worker.  This analysis takes each worker \n 17\nsegment (for instance, gender) and identifies whether differential rates of never-\nmembership increase across worker types within that segment (men and women in the \ncase of gender) were significantly different from one another, holding other factors \nconstant.  \nTable 7 presents estimates of never-membership by grouped year.  They are linear \nprobability models so the coefficients can be interpreted as the percentage change in the \nprobability of never-membership associated with a characteristic, holding other factors \nconstant.  We control for workplace-level union recognition, thus netting out the \nconstraints and opportunities for membership associated with the availability of a union \non-site.  Thus, it is arguable that changing associations with never-membership identified \nin the models tell us about changes in preferences for membership.7  We return to this in \nSection 5.5. \n[Table 7] \nThe association between the three demographic characteristics in the model and \nnever-membership probabilities change markedly over the period.  Gender is not \nassociated with never-membership in the 1980s.  In the 1990s, women’s probability of \nnever-membership is about 6% higher than men’s, but the differential closes by the end \nof the century and is no longer statistically significant.  Until the mid-1990s, non-whites \nhad a higher probability of never-membership than whites, but the difference is not \napparent after the mid-1990s.  Young workers have had a higher probability of never-\n                                                 \n7 There are two reasons why we can not claim that our analysis fully accounts for the relationship between \nunion availability and preferences for unionisation.  First, other variables may not be independent of \nworkplace-level unionisation because different types of worker may sort themselves into unionised and \nnon-unionised workplaces according to the gains they may obtain by being unionised.  Employers may also \nbe able to select from among those desirous of union membership. Secondly, if differential sorting has gone \non over the period of our analysis, this may affect the interpretation of the independent effects of other \nvariables in our models. \n 18\nmembership since the beginning of the BSAS, but the size of the effect has grown.  In the \nearly 1980s, workers aged under-25 had a probability of never-membership that was 18% \nhigher than older workers.  This had risen to 29% by 1999-2001.  A formal test of \nwhether the coefficients altered significantly between 1983-85 and 1999-2001 indicates \nthat the shift in preferences of non-whites relative to whites and the young versus the old \nare statistically significant.8  Where employees live also matters, with those in the South \nsignificantly more likely to be never-members than those living elsewhere: variation in \nregional effects over time is not statistically significant. \nTurning to job characteristics, the negative association between never-\nmembership and full-time working apparent in the 1980s had disappeared by the 1990s.  \nThroughout the period non-manual workers had higher probabilities of never-\nmembership than manual workers, but the size of the effect did not differ much over \ntime.  Similarly, low-paid workers were more likely to be never-members throughout but \nthe size of the effect did not differ significantly.   \nPerhaps most interesting of all is the effect of workplace-level union recognition.  \nEmployees in unionised workplaces had around a 40% lower probability of never-\nmembership than similar employees in non-unionised workplaces.  The size of this effect \nhas not changed significantly over the period.  Recall that the shift-share analysis \npresented in Table 4 indicated that changes in preferences accounted for roughly half of \n                                                 \n8 The formula for this test is  \n2\n2\n2\n1\n21\nsese +\n− ββ  where beta1 signifies the coefficient in the first period, \nbeta2 signifies the coefficient in the second period, se12 is the square of the standard error for the \ncoefficient in the first period and se22 is the square of the standard error for the coefficient in the second \nperiod. The changes in the coefficients between the beginning and the end of the period on ethnicity and \nage are both statistically significant at a 99% level of confidence. \n \n \n 19\nthe rise in never-membership along this dimension.  The analysis in Table 7 shows that, \ncontrolling for other factors, the rate at which the preference for never-membership rose \ndid not differ significantly across employees in unionised and non-unionised workplaces. \nWe also estimated the impact of workplace size, sector, qualifications and \nattitudes to distributive justice over time for the years that these variables were available.  \nWorkplace size and qualifications were never statistically significant.  Being in the public \nsector lowered the probability of never-membership by 7-13% relative to private sector \nemployment, but there was no trend over time.  Similarly, being on the ‘right’ of the left-\nright scale raised the probability of never-membership by between 6-12% depending on \nthe period relative to being on the ‘left’, but there was no time-trend. \nIn general, then, coefficients attached to workplace and job characteristics did not \nshift a great deal over the period.  The exception was full-time employment, which was \nno longer associated with lower never-membership by the 1990s.  However, there was \nsubstantial change in preferences attached to demographic characteristics.  \n5.5 Determinants of never-membership in the unionised sector \nAbove we showed that one of the reasons for the rise in never-membership was the \ndecline in the presence of a union at the workplace.  Others have highlighted the growth \nin non-union workplaces as contributing to the decline in union membership in Britain \n(Millward et al., 2000; Machin, 2000).  The absence of workplace-level unionisation may \naffect individual employees’ decisions to join a union because the cost of organising in \norder to become a union member is higher than the cost of becoming a member in an \nalready unionised workplace (Farber, 2001; Green, 1990; Bryson and Gomez, 2002). An \nalternative perspective would be to consider individuals’ propensity to join a union, on \n 20\nthe one hand, and their opportunities for doing so, on the other, as important determinants \nof the union joining decision (Bain and Elshekh, 1976; Disney, 1990).9  Those \nopportunities are greatest where there is already a union in place.  In keeping with \nworkplace-level analyses (Millward et al, 2000), we find the propensity to be a member \nhas declined since the early 1980s even among those with the best opportunities to join \n(those facing the lowest costs) – that is, those in unionised workplaces (Table 8).  Three-\nquarters of the 12 percentage point drop in membership in unionised workplaces since the \nearly 1980s is accounted for by the rise in never-membership.10\n[Table 8] \nIn light of the discussion above, an analysis of employees’ decisions never to join \na union, even when they have a recognised union on-site, provides an opportunity to \nunderstand possible reasons for the decline in union membership density within the \nunionised sector. \nTable 9 presents results from linear probability models estimating never-\nmembership for grouped years among employees working in unionised workplaces.  \nBetween 1983-85 and 1999-2001 never-membership in the unionised sector rose 9 \npercentage points.  Under the models presented in Table 9, this change was due \nexclusively to compositional effects. It is possible that preferences are less important in \nexplaining changes in the never-membership rate in the unionised sector than in the \n                                                 \n9 In fact, these two perspectives are not that dissimilar because the extent to which individuals perceive an \n‘opportunity’ to unionise depends to a large degree on perceived costs and benefits of organising. \n10 The Workplace Industrial Relations Survey Series indicates that aggregate union density in recognised \nworkplaces fell from 75% in 1984 to 56% in 1998, a drop of 19 percentage points (authors’ calculations).  \nOver the same period, BSAS indicates a decline from 71% to 60%, a drop of 11 percentage points.  The \ndiscrepancies in density levels and rates of decline may be accounted for by differences in sample \ncoverage.  WIRS is confined to workplaces with 25+ employees but includes employees regardless of \nhours worked.  BSAS has no employment size threshold but is confined to employees working at least 10 \nhours per week. \n 21\neconomy as a whole because of self-sorting, which plays an important role in determining \nwhether individuals are employed in a unionised or non-unionised workplace in the first \nplace. Different types of workers may choose to apply for jobs in unionised and non-\nunionised workplaces according to the gains they may obtain by being unionised. \nEqually, employers may also select from among those most (or least) desirous of union \nmembership (Abowd and Farber, 1982). If so, employees’ characteristics dictate whether \nthey choose (or are chosen by employers) to enter unionised workplaces, and thus have \nthe opportunity to join a union without incurring the large costs of organising a non-\nunionised workplace.  \nAnother possible explanation for the lack of an overall propensity effect may \nsimply be mechanical or a function of the data. Propensity shifts across segments may \nhave offset each other. This would mean that preferences for never-membership within \nthe unionised sector are clearly of some consequence. Table 9 does show that there were \nsignificant and opposing shifts in preferences within particular dimensions of the \nworkforce.   \n[Table 9] \nFor instance, the probability of never-membership rose dramatically for young workers \nrelative to older workers in the unionised sector over the period (the relative probability \nrising from 13% in 1983-85 to 28% in 1999-2001).  The probability of never-membership \nalso rose significantly among low and mid-earner employees relative to high earners.  On \nother dimensions, however, there was a convergence in never-membership rates – for \ninstance, between men and women, full-timers and part-timers and manual and non-\nmanual workers.   \n 22\n6. Implications for Unions \nThese findings have a number of practical implications for the future of unions and union \norganising. Compositional changes in the workforce have conspired against unions \nbecause they have resulted in an increasing proportion of employment shifting to workers \nwho have traditionally been less inclined to unionise.  If these trends continue, we can \nexpect further declines in union membership far into the future.   \nOf course, it is by no means certain that these compositional changes will \ncontinue. For instance, in view of the growing public concern over the quality of public \nservices and poorly managed privatisation schemes, one might anticipate some relative \ngrowth in the public sector, where unions have been traditionally strong and where never-\nmembership rates are low.  \nPerhaps more unsettling for union organisers, however, is the finding that the rate \nof never-membership rose across all segments of the workforce during the 1980s and \n1990s.  This universal move away from unionism makes it difficult for unions to know \nwhere to focus their new recruitment and organising energies. Nevertheless, union \norganisers can take some comfort from the fact that changing preferences for unionisation \naccounted for nearly half the rise in never-membership. This is because there is relatively \nlittle unions can do to alter the nature of workforce compositional change, but they may \nbe able to persuade employees to alter their preferences for union membership - provided \nthey correctly diagnose why it is that employees have stopped joining unions. \nThis last point is extremely important.  Unions’ ability to offer ‘value’ to \nemployees is severely limited where they are unable to establish bargaining rights with \nemployers.  Getting onto a better footing with employers – one that brings the prize of \n 23\nrecognition – may be the best way to make substantial membership gains in the longer-\nterm.  But with never-membership rates within the unionised sector rising by 64% since \nthe early 1980s, this is not enough on its own.  Unions are faced with the challenge of \nproving their relevance and effectiveness to the 23% of employees in the unionised sector \nwho have never joined a union and have not yet experienced the benefits of membership.  \nAchieving this is probably less costly to the labour movement than seeking to organise \nunorganised workplaces and, at least in the short-term, it may present the best \nopportunity for making substantial membership gains. \n \n7. Conclusion \nUsing repeat cross-sectional data from the British Social Attitudes Surveys we have \nshown that the decline in union membership in Britain is accounted for by the rising \npercentage of employees who have never been union members. There was a significant \nrise in never-membership in the 1990s relative to the 1980s and this trend accelerated in \nthe second half of the 1990s.  \nIn the economy as a whole, a little over half the rise in never-membership is due \nto compositional change in the workforce, in that segments with traditionally high rates \nof never-membership increased their share of employment.  The remainder is accounted \nfor by within-group changes in never-membership density.  These within-group changes \nmay be indicative of changing preferences for union membership. The rise in young \npeople’s probability of never-membership relative to older workers over the period is \nparticularly marked, and is apparent in the whole economy and the unionised sector.  The \nestimated probability of never-membership over time did not vary much with workplace \nand job characteristics.  The exception was full-time employment status which, by the \n 24\n1990s, was no longer associated with a lower never-membership rate than part-time \nemployment. \nThe biggest single factor determining the probability of never-membership is \nwhether or not an individual is employed in a workplace with a recognised union.  \nEmployees in unionised workplaces had a 40% lower probability of never-membership \nthan similar employees in non-unionised workplaces.  The size of this effect has not \nchanged very much since the early 1980s. However, the decline in workplace \nunionisation has contributed very significantly to the rise in never-membership in the \neconomy.  Intriguingly, three-quarters of the decline in union density within unionised \nworkplaces is accounted for by a rise in never-membership, indicating that the rise in \nnever-membership is not simply a function of overt employer opposition or the increasing \norganising costs of becoming a member implied by the rise in non-unionised workplaces. \nThese findings, as we have shown, have significant implications for the future of trade \nunions and the potential strategies unions can employ for recruitment and reversing union \ndensity declines. \n 25\nAcknowledgements\nWe would like to thank Richard Freeman, Morley Gunderson, Stephen Machin, David \nMetcalf, and Konstantinos Tzioumis for their helpful comments as the paper was being \ndrafted. We would also like to thank the Leverhulme Trust and the Regent Street \nPolytechnic Trust for financial support, Katarina Thomson and the National Centre for \nSocial Research for access to and advice on the BSAS data, and Carola Frege and two \nanonymous referees for very helpful comments on an earlier draft. \n \n 26\nReferences \n \nAbowd, J. M. and Farber, H. S. (1982) ‘Job Queues and the Union Status of \nWorkers’, Industrial and Labor Relations Review, Vol. 35, No. 3, 354-367 \n \nBain, G. S. and Elsheikh, F. (1976) Union Growth and the Business Cycle, \nOxford: Basil Blackwell \n \nBooth, A. (1989) What Do Unions Do Now?, Discussion Papers in Economics, \nNo. 8903, Brunel University \n \nBryson, A. (2001) Union effects on Workplace Governance 1983-1998, PSI \nDiscussion Paper No. 8 \n \nBryson, A. (1999) “Are unions good for industrial relations?” in R. Jowell, J. \nCurtice, A. Park, and K. Thomson (eds.) British Social Attitudes: the 16th Report \n– Who shares New Labour values?, Aldershot, Ashgate \n \nBryson, A. and Gomez, R. (2003) ‘Segmentation, Switching Costs and the \nDemand for Unionization in Britain’, Centre for Economic Performance \nDiscussion Paper No. 568, London School of Economics \n \n \n 27\nBryson, A. and Gomez, R. (2002) ‘Marching On Together? Reasons for the \nRecent Decline in Union Membership’, in Park, A., Curtice, J., Thomson, K., \nJarvis, L. and Bromley, C. (eds.) British Social Attitudes: the 19th Report, \nAldershot \n \nCarruth, A. and Disney, R. (1988) ‘Where have two million trade union members \ngone?’, Economica, 55: 1-19 \n \nDisney, R. (1990) ‘Explanations of the Decline in Trade Union Density in Britain: \nan Appraisal’, British Journal of Industrial Relations, 28:2, 165-177 \n \nDisney, R., Gosling, A., Machin, S. and McRae, J. (1998) The Dynamics of Union \nMembership in Britain – A Study Using the Family and Working Lives Survey, \nEmployment Relations Research Series Number 3, Department for Trade and \nIndustry, London \n \nFarber, H. (2001). ‘Notes on the Economics of Labor Unions’. Working Paper \n#452. Princeton University, Industrial Relations Section. \n \nFreeman, R. and Pelletier, J. (1990) ‘The impact of industrial relations legislation \non British union density’, British Journal of Industrial Relations, 28: 141-64 \n \n \n 28\nGreen, F. (1992) ‘Recent Trends in British Trade Union Density: How Much of a \nCompositional Effect?’, British Journal of Industrial Relations, 30: 3, 445-458 \n \nGreen, F. (1990) ‘Trade Union Availability and Trade Union Membership In \nBritain’, The Manchester School, Vol. LV111, No. 4, 378-394 \n \nHicks, S. (2000)  ‘Trade union membership 1998-99: an analysis of data from the \nCertification Officer and Labour Force Survey’, Labour Market Trends, July, \n329-327 \n \nJowell, R., Curtice, J., Park, A., and Thomson, K. (1999) British Social Attitudes: \nthe 16th Report.  Who Shares New Labour Values?, Ashgate, Dartmouth \n \nKennedy, P. (1998) A Guide to Econometrics, Fourth Edition, Blackwells, Oxford \n \nMachin, S. (2000) ‘Union Decline in Britain’, British Journal of Industrial \nRelations, 38:4, 631-645. \n \nMachin, S. (2001) ‘Does It Still Pay To Be In Or To Join A Union’, UCL\/LSE \nmimeo \n \nMillward, N., Bryson, A. and Forth, J.  (2000) All Change at Work?, Routledge, \nLondon. \n 29\n Park, A., Curtice, J., Thomson, K., Jarvis, L. and Bromley, C. (eds.) (2002) \nBritish Social Attitudes: the 19th Report, Aldershot \n \nSneade, A. (2001) ‘Trade union membership 1999-2000: an analysis of data from \nthe Certification Officer and the Labour Force Survey, Labour Market Trends, \n433-444. \n 30\nFigure 1: Trends in Union Membership, 1983-2001 \n20\n25\n30\n35\n40\n45\n50\n1983 1985 1987 1989 1991 1993 1995 1997 1999 2001\nE x-m em b ers\nN ever-m em bers\nM em b ers\n%\n \nNote: Mid-point rates have been interpolated for years in which the survey was not conducted (1988 and \n1992) and years in which the question on ex-membership was not asked (1994 and 1997). \n \n \n \n 31\nFigure 2: Rising never-membership in Britain: The contribution of ‘compositional’ and \n‘propensity’ change, 1983-2001. \n \n25\n30\n35\n40\n45\n50\n1983 1985 1987 1989 1991 1993 1995 1997 1999 2001\nActual\nComposition only\nPropensity only\n%\n \n \n \n 32\nTable 1: Union membership compared to other life events for those aged 25-34. \n \n \n \n \n \nTotal  \n \nUnionised Sector \n \nNon-Union Sector \n \n \nLife Event\n \n1983-85\n \n1999-01\n \n1983-85\n \n1999-01\n \n1983-85\n \n1999-01\n       \nMales       \n Never membership 26 57 8 34 52 75 \n Ever membership 74 43 92 66 48 25 \n Bachelor’s degree 17 28 19 32 13 24 \n Marriage 78 68 80 65 76 71 \n       \nFemales       \n Never membership 37 59 14 31 68 83 \n Ever membership 63 41 86 69 32 17 \n Bachelor’s degree 24 27 32 27 15 27 \n Marriage 70 68 72 70 66 66 \n       \nNotes: Ever membership includes both current members and non-members who have been \nmembers in the past. Married includes living as married. Life events in 1983-85 are for \nbirth cohort born between 1949 (aged 34 in 1983) and 1960 (aged 25 in 1985) and for 1999-\n01 the birth cohort is born between 1965 (aged 34 years in 1999) and 1976 (aged 25 in \n2001). \n 33\nTable 2: Estimates of the Contribution of Changing Never-Membership to the \nChange in Union Density in Britain, 1983 to 2001 \n \n \n1999-2001\n \nProportion\nProbability of being a union member ( u ) 0.32 \nProbability of being a non-union member( nu ) 0.68 \n(100) \nProportion of non-membership rate made up ex-members ( x ) 0.23 \n(33.8) \nProportion of non-membership rate made up never-members ( n ) 0.45 \n(66.2) \n \n1983-1985\n \n \nProbability of being a union member ( u ) \n \n0.48 \n \nProbability of being a non-union member( nu ) \n0.52 \n(100) \n \nProportion of non-membership rate made up ex-members ( x ) \n0.22 \n(42.3) \n \nProportion of non-membership rate made up never-members ( n ) \n0.30 \n(57.7) \n \nCounterfactual probability of being a union member (u835¦9901) \n \n0.33 \n \nDecomposing the Density Change between 1999-2001 and 1983-1985  \nChange in Union Density Rate (D) -0.16 \n(100) \nShare of D due to Change in Ex-membership Rate (D1) \n-0.01 \n(0.06) \nShare of D due to Change in Never-membership Rate (D2) \n-0.15 \n(0.94) \n \n 34\nTable 3: Time-trends and Rising never-membership \n (1) (2) (3) (4) \n1. Year (ref: 1983)     \n  1984 0.020    \n (0.83)    \n  1985 0.036    \n (1.56)    \n  1986 0.031    \n (1.50)    \n  1987 *0.054    \n (2.53)    \n  1989 *0.046    \n (2.19)    \n  1990 **0.080    \n (3.75)    \n  1991 **0.060    \n (2.67)    \n  1993 **0.073    \n (3.26)    \n  1995 **0.132    \n (6.05)    \n  1996 **0.131    \n (6.12)    \n  1998 **0.139    \n (6.42)    \n  1999 **0.168    \n (7.67)    \n  2000 **0.150    \n (7.01)    \n  2001 **0.191    \n (8.90)    \n2. Year, grouped (ref: 1983-85)     \n  1986-89  0.024 0.012 0.006 \n  (1.96) (0.85) (0.48) \n  1990-94  **0.052 **0.048 *0.029 \n  (4.02) (3.54) (2.38) \n  1995-98  **0.115 **0.099 **0.063 \n  (9.06) (5.92) (4.40) \n  1999-01  **0.151 **0.126 **0.085 \n  (11.88) (5.93) (4.66) \n3. Unemployment-vacancy ratio   -0.002 -0.001 \n   (1.46) (0.81) \n4. Aged 18-24    **0.250 \n    (23.08) \n5. Gross earnings (ref: high)     \n  Low    **0.079 \n    (7.57) \n  Mid-level    0.011 \n    (1.21) \n  Missing    **0.093 \n    (6.11) \n6. Non-white (ref: white)    *0.036 \n    (2.26) \n7. Female (ref: male)    **0.033 \n    (4.08) \n8. Full-timer (ref: part-timer)    -0.016 \n    (1.46) \n9. Manual (ref: non-manual)    **-0.085 \n    (11.28) \n10. Manufacturing (ref: Non-\nmanufacturing) \n   0.012 \n    (1.43) \n11. Region (ref: South)     \n  Midlands\/North    **-0.077 \n    (10.53) \n  Scotland\/Wales    **-0.089 \n    (8.92) \n12.Union recognised (ref: Non-union)    **-0.411 \n    (56.63) \n 35\n13. Constant **0.285 **0.303 **0.336 **0.577 \n (17.34) (31.09) (13.93) (23.57) \nObservations 19350 19350 19350 18601 \nR-squared 0.01 0.01 0.01 0.28 \nJoint significance of time variables F(14,19336\n)=16.72 \nP>F=0.0000 \nF(4,19346)\n=55.92 \nP>F=0.0000 \nF(4,19346)\n=21.40 \nP>F=0.0000 \nF(4,18597)\n=12.66 \nP>F=0.0000 \nNote: * denotes significance at a 95% confidence level, ** denotes significance at a 99% confidence level.\n 36\nTable 4: Decomposing the Rise of Never Membership by Workforce Groupings \n \n  \nShare of employees \nShare who have \nnever been members \nShift share analysis \n(Percentage Change Due to:) \n  \n \n \n1983-85\n \n \n \n1999-01\n \n \n \n1983-85\n \n \n \n1999-01\n \nWithin-group \ndensity \nchange\n \n \nCompositional \nchange\n1. By Gender \n  Male \n  Female \n \n56 \n44 \n \n49 \n51 \n \n25 \n37 \n \n44 \n47 \n \n \n91 \n \n \n9 \n2. By Age \n  18-24 \n  25+ \n \n17 \n83 \n \n12 \n88 \n \n50 \n26 \n \n78 \n41 \n \n \n111 \n \n \n-11 \n3. By Ethnicity \n  White \n  Non-white \n \n97 \n3 \n \n94 \n6 \n \n30 \n41 \n \n45 \n48 \n \n \n96 \n \n \n4 \n4. By Left-Right \nscale \n  High \n  Medium \n  Low \n \n \n37 \n29 \n35 \n \n \n41 \n31 \n27 \n \n \n42 \n30 \n25 \n \n \n50 \n43 \n38 \n \n \n \n \n97 \n \n \n \n \n3 \n5. By Hours \n  Full-time \n  Part-time \n \n83 \n17 \n \n76 \n24 \n \n27 \n46 \n \n44 \n49 \n \n \n94 \n \n \n6 \n6. By Occupation \n  Manual \n  Non-manual \n \n46 \n54 \n \n37 \n63 \n \n25 \n35 \n \n45 \n45 \n \n \n96 \n \n \n4 \n7. By Earnings \n  High \n  Medium \n  Low \n \n37 \n23 \n40 \n \n50 \n22 \n28 \n \n22 \n23 \n42 \n \n39 \n46 \n57 \n \n \n \n102 \n \n \n \n-2 \n8. By \nQualification \n  High \n  Medium \n  Low \n \n \n25 \n32 \n42 \n \n \n36 \n39 \n25 \n \n \n27 \n36 \n32 \n \n \n42 \n50 \n44 \n \n \n \n \n100 \n \n \n \n \n0 \n9. By Workplace \nsize \n  <25 employees \n  25+ employees \n \n \n32 \n68 \n \n \n32 \n68 \n \n \n46 \n24 \n \n \n57 \n40 \n \n \n \n100 \n \n \n \n0 \n10. By Sector \n  Public \n  Private \n  Other  \n \n36 \n61 \n3 \n \n29 \n68 \n3 \n \n13 \n42 \n42 \n \n22 \n55 \n50 \n \n \n \n83 \n \n \n \n17 \n11. By Industry \n  Manufacturing \n  Non-manufact. \n \n28 \n72 \n \n19 \n81 \n \n27 \n32 \n \n42 \n46 \n \n \n96 \n \n \n4 \n12. By Region \n  Scotland\/Wales \n  Midlands\/North \n  South \n \n13 \n43 \n45 \n \n14 \n41 \n45 \n \n25 \n24 \n38 \n \n35 \n42 \n52 \n \n \n \n102 \n \n \n \n-2 \n13. By \nUnionisation \n  Recognition \n  No Recognition \n \n \n64 \n36 \n \n \n47 \n53 \n \n \n14 \n60 \n \n \n23 \n66 \n \n \n \n50 \n \n \n \n50 \nNotes: \na. A description of the shift-share methodology is given in Section 3.1. \nb. Left-right scale is not available before 1986 so base period is 1986-89. \nc. Workplace size is not available in 1983 so base period is 1984-85. \nd. Qualifications are not available in 1983 or 1984 so base period is 1985. \ne. Sector figures are not available for 1983 so base period is 1984-85. \n \n 37\nTable 5: Contribution of change in composition and change in propensities to \nthe never-membership rate, 1983-01 \nProportion of Total Change Due to   \nActual \nrate \n \n[1] \n \nUnrestricted \nprediction \n \n[2] \n \n1983 Model \nprediction \n \n[3] \nChange in \nComposition \n \n[4] \nChange in \nPropensity \n \n[5] \nYear      \n1983 0.28 0.28 0.28 0.00 \n(0) \n0.00 \n(0) \n \n1984 0.30 0.30 0.28 0.02 \n(100) \n0.00 \n(0) \n \n1985 0.32 0.32 0.29 0.03 \n(75) \n0.01 \n(25) \n \n1986 0.32 0.32 0.31 0.01 \n(25) \n0.03 \n(75) \n \n1987 0.34 0.34 0.30 0.04 \n(67) \n0.02 \n(33) \n \n1989 0.33 0.33 0.31 0.02 \n(40) \n0.03 \n(60) \n \n1990 0.37 0.37 0.32 0.05 \n(55) \n0.04 \n(45) \n \n1991 0.34 0.34 0.31 0.03 \n(50) \n0.03 \n(50) \n \n1993 0.36 0.36 0.32 0.04 \n(50) \n0.04 \n(50) \n \n1995 0.42 0.42 0.32 0.10 \n(71) \n0.04 \n(28) \n \n1996 0.42 0.42 0.34 0.08 \n(57) \n0.06 \n(42) \n \n1998 0.42 0.42 0.35 0.07 \n(50) \n0.07 \n(50) \n \n1999 0.45 0.45 0.35 0.10 \n(58) \n0.07 \n(42) \n \n2000 0.44 0.44 0.35 0.09 \n(56) \n0.07 \n(44) \n \n2001 0.48 0.48 0.36 0.12 \n(60) \n0.08 \n(40) \nNotes: \na. Meaning of columns is as follows: [1] actual rate of never-membership [2] \nPredicted rate of never-membership by year based on model for that year [3] \nPredicted rate of never-membership by year based on model for 1983 [4] Difference \nbetween [2] and [3], numbers in brackets express share of total change in \npercentage terms [5] Difference in actual rate relative to 1983 minus \ncompositional change, numbers in brackets express share of total change in \npercentage terms. \nb. No surveys were conducted in 1988 and 1992.  Data on never-membership are \nunavailable for 1994 and 1997. Analysis for 1991 excludes ethnicity dummy due to \nlarge number of missing cases. \nc. Predictions are probabilities based on linear probability estimation accounting \nfor survey design. \nd. Models incorporate gender, ethnicity, age, if full-timer, if manufacturing, if \nmanual, banded earnings, region, union recognition. \n \n \n 38\nTable 6: Contribution of change in composition and change in propensities to \nthe never-membership rate by time period, 1983-01 \n \n     \nProportion of Total Change Due to \n \n \n \n \nPeriod\n \nActual \nrate \n \n[1] \n \nUnrestricted \nprediction \n \n[2] \n \n1983-85 model \nprediction \n \n[3] \n \nCompositional \nchange \n \n[4] \n \nPropensity \nchange \n \n[5] \n \n1983-85 .30 .30 .30 0 \n(0) \n0 \n(0) \n \n1986-89 .33 .33 .32 0.01 \n(33) \n0.02 \n(67) \n \n1990-93 .36 .36 .34 0.02 \n(33) \n0.04 \n(67) \n \n1995-98 .42 .42 .36 0.06 \n(50) \n0.06 \n(50) \n \n1999-01 .46 .46 .37 0.09 \n(56) \n0.07 \n(44) \nNotes:  \na. Meaning of columns is as follows: [1] actual rate of never-membership [2] Predicted \nrate of never-membership by year based on model for that year [3] Predicted rate of \nnever-membership by year based on model for 1983-85 [4] Difference between [2] and \n[3], numbers in brackets express share of total change in percentage terms [5] \nDifference in actual rate relative to 1983-85 minus compositional change, numbers in \nbrackets express share of total change in percentage terms \nb. No surveys were conducted in 1988 and 1992.  Data on never-membership are unavailable \nfor 1994 and 1997. \nc. Predictions are probabilities based on linear probability estimation accounting for \nsurvey design. \nd. Models incorporate gender, ethnicity, age, if full-timer, if manufacturing, if manual, \nbanded earnings, region, union recognition. \n \n \n 39\nTable 7: Linear probability models estimating never-membership by worker \ngroupings, for 5 periods. \n \n  \nDependent Variable: Probability of Never Being a Union Member \n \n    \nPeriod \n \n  \n \nIndependent Variables: \n \n1983-85\n \n1986-89\n \n1990-93\n \n1995-98\n \n1999-2001 \n \n1. Female 0.003 0.011 **0.061 **0.062 0.019 \n (0.13) (0.66) (3.07) (3.77) (1.13) \n2. Non-white **0.140 *0.078 **0.110 0.011 -0.020 \n (3.23) (2.10) (2.79) (0.36) (0.69) \n3. Age 18-24 **0.179 **0.226 **0.270 **0.288 **0.288 \n (7.10) (11.86) (9.27) (11.66) (12.37) \n4. Full-timer **-0.108 **-0.067 -0.030 0.031 0.030 \n (3.44) (3.11) (1.14) (1.37) (1.36) \n5. Manufacturing *0.039 0.006 0.013 0.029 -0.013 \n (2.08) (0.40) (0.64) (1.56) (0.67) \n6. Manual worker **-0.104 **-0.092 **-0.099 **-0.083 **-0.066 \n (5.55) (6.28) (5.48) (5.17) (4.03) \n7. Gross earnings  \n(ref: High) \n     \n Mid-level -0.004 -0.029 0.010 0.019 *0.043 \n (0.19) (1.58) (0.45) (1.02) (2.18) \n Low **0.079 **0.050 0.044 **0.114 **0.098 \n (3.19) (2.58) (1.76) (5.13) (4.09) \n Missing *0.079 **0.087 **0.110 **0.113 *0.077 \n (2.22) (2.94) (3.27) (3.27) (2.25) \n8. Region (ref: South)      \n  \n Scotland\/Wales \n \n**-0.070 \n \n**-0.084 \n \n**-0.069 \n \n**-0.080 \n \n**-0.118 \n (2.73) (4.51) (2.67) (3.80) (5.65) \n Midlands\/North **-0.101 **-0.067 **-0.083 **-0.062 **-0.081 \n (5.63) (4.65) (4.67) (4.01) (5.21) \n9. Union recognition **-0.412 **-0.419 **-0.396 **-0.416 **-0.404 \n (20.26) (28.44) (21.94) (28.05) (26.90) \n10. Constant **0.675 **0.650 **0.593 **0.554 **0.619 \n (17.72) (23.82) (16.94) (19.46) (21.97) \nObservations 2434 4344 3066 4366 4391 \nR-squared 0.29 0.28 0.27 0.27 0.25 \nNote: * denotes significance at a 95% confidence level, ** denotes significance at a 99% confidence level.\n 40\nTable 8: The Rise of Never Membership in the Unionised Sector, 1983-2001 \n \n  \nPeriod \n \n \nMembership Status\n \n1983-85\n \n1986-89\n \n1990-94\n \n1995-98\n \n1999-01\n \n1. Current Members \n \n72 \n \n71 \n \n68 \n \n63 \n \n60 \n \n2. Non-members \n \n28 \n(100) \n \n29 \n(100) \n \n32 \n(100) \n \n37 \n(100) \n \n40 \n(100) \n  a. Ex-members 14 \n(50) \n14 \n(48) \n15 \n(46) \n17 \n(45) \n17 \n(42) \n  b. Never-Members 14 \n(50) \n15 \n(52) \n17 \n(54) \n20 \n(55) \n23 \n(58) \n \nNo. Observations 1574 2671 2090 2274 2094 \n \nNotes: Numbers represent percentages. Numbers in brackets represent share of total non-\nunion membership rate attributable to ex and never members.  \n \n \n \n \n \n 41\nTable 9: Linear probability models estimating never-membership in the Unionised \nSector by worker groupings, for 5 periods. \n \n  \nDependent Variable: Probability of Never Being a Union \nMember  \n  \nPeriod \n \n \nIndependent Variables\n \n1983-85\n \n1986-89\n \n1990-93\n \n1995-98\n \n1999-2001\n      \n1. Female **-0.063 -0.018 0.026 0.028 -0.023 \n (2.97) (0.95) (1.06) (1.28) (0.92) \n2. Non-white *0.111 0.053 0.059 -0.071 -0.063 \n (2.14) (1.22) (1.03) (1.83) (1.54) \n3. Age 18-24 **0.127 **0.128 **0.248 **0.271 **0.284 \n (4.36) (4.97) (5.19) (5.65) (5.87) \n4. Full-timer **-0.208 **-0.084 -0.014 -0.008 0.031 \n (5.46) (3.16) (0.43) (0.26) (0.96) \n5. Manufacturing **0.074 **0.052 *0.061 **0.088 0.045 \n (3.77) (3.01) (2.41) (3.44) (1.67) \n6. Manual worker **-0.147 **-0.117 **-0.136 **-0.100 **-0.098 \n (7.39) (7.05) (6.24) (4.54) (4.10) \n7. Gross earnings (ref:High)      \n Mid-level -0.003 -0.018 -0.000 **0.060 **0.095 \n (0.18) (1.05) (0.02) (2.64) (3.55) \n Low **0.100 **0.086 **0.112 **0.145 **0.181 \n (4.06) (4.13) (3.53) (4.59) (5.09) \n Missing **0.075 *0.067 *0.102 0.056 **0.135 \n (1.96) (2.01) (2.48) (1.32) (2.67) \n8. Region (ref:South)      \n Scotland\/Wales **-0.080 **-0.097 *-0.065 **-0.092 **-0.142 \n (3.14) (4.84) (2.11) (3.65) (5.38) \n Midlands\/North **-0.092 **-0.078 **-0.061 -0.062 **-0.101 \n (4.89) (4.79) (2.86) (3.00)** (4.60) \n10. Constant **0.385 **0.265 **0.182 **0.172 **0.221 \n (8.62) (8.48) (4.19) (4.76) (5.48) \nObservations 1563 2652 1745 2253 2080 \nR-squared 0.12 0.07 0.11 0.09 0.09 \n \n 42\nAppendix A1: Description of control variables and their mean values \n \n \nVariable \n \nMean \n \nFemale .49 \nNon-white .05 \nAged 18-24 years .14 \nFull-time employee .79 \nManual occupation .40 \nGross earnings \n  High \n  Medium \n  Low \n  Missing \n \n.39 \n.21 \n.34 \n.06 \nQualifications \n  High \n  Medium \n  Low\/none \n \n.32 \n.37 \n.32 \nRegion \n  Scotland\/Wales \n  Midlands\/North \n  South \n \n.13 \n.42 \n.44 \nManufacturing .22 \nUnion recognition .55 \nUnemployment\/vacancy ratio 14.8 \nNumber of employees at workplace \n  <10 \n  10-24 \n  25-99 \n  100-499 \n  500+   \n \n.16 \n.16 \n.26 \n.24 \n.18 \nSector \n  Public \n  Private \n  Voluntary\/other \n \n.32 \n.65 \n.04 \nLeft-right scale \n  High \n  Medium \n  Low \n \n.36 \n.31 \n.32 \nNotes: \na. For those data available since 1983, N = 19,350 employees. \nb. Number of employees at workplace not available in 1983, N = 18,533 \nc. Sector unavailable in 1983 and 1995, N = 18,533 \nd. Qualifications unavailable in 1983 and 1984, N = 17,555 \ne. Left-right scale unavailable before 1986, N = 16,898  \n \n 43\nData derivation \n \nHere we describe the derivation of variables where what we have done it is not self-\nevident. \n \nEarnings \nRespondents are asked to identify which of a number of gross earnings bands covers their \nown earnings.  During the series the number of bands has increased reflecting the rise in \nearnings over the period.  We recoded the gross earnings bands into an ordinal variable \nwith five categories ranging from ‘much below average’ to ‘much above average’.  ‘Low’ \nincludes ‘much below’ and ‘below’ average’; ‘Medium’ is ‘average’ and ‘High’ is ‘above \naverage’ or ‘much above average’. \n \nQualifications \nThese relate to individuals’ highest qualification.  ‘High’ means degree or higher \neducation below degree.  ‘Medium’ means ‘A-level’ or ‘O-level’ or equivalent.  Low \nmeans ‘CSE’ or ‘none’. \n \nUnemployment\/vacancy ratio \nThe unemployment\/vacancy ratio was constructed by the authors and is a consistent \nseasonally adjusted time-series for Great Britain derived from series provided by the \nOffice of National Statistics.  The unemployment measure is the number of unemployed \nin the Spring of each year using the ILO definition, and the vacancy data are the official \nfigures for the same period. \n \nLeft-right scale \nThe left-right scale is an additive index drawing on responses to five statements to which \nthe respondent is invited to ‘agree strongly’, ‘agree’, ‘neither agree nor disagree’, \n‘disagree’ or ‘disagree strongly’.  These are: ‘Government should redistribute income \nfrom the better-off to those who are less well off’; ‘Big business benefits owners at the \n 44\nexpense of workers’; ‘Ordinary working people do not get their fair share of the nation’s \nwealth’; ‘There is one law for the rich and one for the poor’; ‘Management will always \ntry to get the better of employees if it gets the chance’.  This well tried and tested index \nmeasures an underlying (‘latent’) attitudinal dimension relating to employees’ \nperceptions of distributive justice.  Those with lower scores on the continuous scale \nrunning from 1 to 5 are more likely to favour government economic intervention and the \nreduction of inequality than are those with higher scores. We distinguish between ‘low’, \n‘medium’ and ‘high’ scorers on the index.  ‘Low’ scorers are those scoring below 2.2 on \nthe scale, ‘medium’ scorers are those scoring 2.2 – 2.75 and ‘high’ scorers are those with \nabove 2.75.  Previous research shows union members are significantly more likely to be \n‘left-wing’ (have a lower score) on the index than non-members (Bryson, 1999). \n \n \n 45\n"}