{"doi":"10.1016\/j.mcn.2009.09.001","coreId":"195607","oai":"oai:lra.le.ac.uk:2381\/7708","identifiers":["oai:lra.le.ac.uk:2381\/7708","10.1016\/j.mcn.2009.09.001"],"title":"Voltage-gated sodium channel expression in rat spiral ganglion neurons","authors":["Fryatt, A. G.","Vial, C.","Mulheran, M.","Gunthorpe, M. J.","Grubb, B. D."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-11","abstract":"The spiral ganglion neurons (SGN) provide the afferent innervation of the hair cells in the organ of Corti and relay auditory information from the inner ear to the brain. Voltage-gated sodium channels (NaV) initiate and propagate action potentials that encode this sensory information but little is known regarding the subtypes expressed in these cells. We have used RT-PCR and immunohistochemistry to study the compliment and anatomical distribution of NaV channels in rodent SGN. NaV1.1, NaV1.6 and NaV1.7 were all detected at the mRNA level. Fluorescence or streptavidin–horseradish peroxidase immunohistochemistry extended these findings, demonstrating predominant localisation of NaV1.6 and NaV1.7 on SGN cell bodies and NaV1.1 on axonal processes. Dual labelling with peripherin demonstrated higher NaV1.6 and NaV1.7 expression on Type I rather than Type II neurons. These results provide evidence for selective expression and variations in the distribution of VGSC in the rodent SGN, which may guide further studies into afferent function in the auditory pathway and therapeutic approaches for diseases such as hearing loss and tinnitus","downloadUrl":"http:\/\/www.sciencedirect.com\/science\/journal\/10447431.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7708\/3\/AGF%20MCNmanuscript%2003%2004%2009_agf.pdf","pdfHashValue":"2e1100f8dfdb67615693828593f6938f3c6b155d","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7708<\/identifier><datestamp>\n                2015-12-11T15:45:24Z<\/datestamp><setSpec>\n                com_2381_112<\/setSpec><setSpec>\n                com_2381_9550<\/setSpec><setSpec>\n                col_2381_113<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nVoltage-gated sodium channel expression in rat spiral ganglion neurons<\/dc:title><dc:creator>\nFryatt, A. G.<\/dc:creator><dc:creator>\nVial, C.<\/dc:creator><dc:creator>\nMulheran, M.<\/dc:creator><dc:creator>\nGunthorpe, M. J.<\/dc:creator><dc:creator>\nGrubb, B. D.<\/dc:creator><dc:description>\nThe spiral ganglion neurons (SGN) provide the afferent innervation of the hair cells in the organ of Corti and relay auditory information from the inner ear to the brain. Voltage-gated sodium channels (NaV) initiate and propagate action potentials that encode this sensory information but little is known regarding the subtypes expressed in these cells. We have used RT-PCR and immunohistochemistry to study the compliment and anatomical distribution of NaV channels in rodent SGN. NaV1.1, NaV1.6 and NaV1.7 were all detected at the mRNA level. Fluorescence or streptavidin–horseradish peroxidase immunohistochemistry extended these findings, demonstrating predominant localisation of NaV1.6 and NaV1.7 on SGN cell bodies and NaV1.1 on axonal processes. Dual labelling with peripherin demonstrated higher NaV1.6 and NaV1.7 expression on Type I rather than Type II neurons. These results provide evidence for selective expression and variations in the distribution of VGSC in the rodent SGN, which may guide further studies into afferent function in the auditory pathway and therapeutic approaches for diseases such as hearing loss and tinnitus.<\/dc:description><dc:date>\n2010-03-23T13:47:50Z<\/dc:date><dc:date>\n2010-03-23T13:47:50Z<\/dc:date><dc:date>\n2009-11<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nMolecular and Cellular Neuroscience, 2009, 42 (4), pp. 399-407.<\/dc:identifier><dc:identifier>\n1044-7431<\/dc:identifier><dc:identifier>\nhttp:\/\/www.sciencedirect.com\/science\/article\/pii\/S1044743109002061<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7708<\/dc:identifier><dc:identifier>\n10.1016\/j.mcn.2009.09.001<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis is the author's final draft of the paper published as   Molecular and Cellular Neuroscience, 2009, 42 (4), pp. 399-407.  The final version is available from http:\/\/www.sciencedirect.com\/science\/journal\/10447431.  Doi: 10.1016\/j.mcn.2009.09.001<\/dc:rights><dc:publisher>\nElsevier<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1044-7431","1044-7431"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article"],"fullText":"1 \n \n  \n   \n \nVoltage-Gated Sodium Channel Expression in Rat Spiral \nGanglion Neurons \n \nFryatt A.G\n1\n, Vial C\n1\n, Mulheran M\n1\n, Gunthorpe M.J.\n2\n, Grubb B.D\n1\n \n \n1\nDepartment of Cell Physiology and Pharmacology, University of Leicester, University Road, \nLeicester, United Kingdom LE1 9HN \n \n2\nNeurosciences Centre of Excellence for Drug Discovery, GlaxoSmithKline Research & \nDevelopment, New Frontiers Science Park, Harlow, Essex, United Kingdom. CM19 5AW \n \nCorrespondence: agf4@le.ac.uk, AG Fryatt, address as above \n \n \n  \n2 \n \n  \nAbstract \nThe spiral ganglion neurons (SGN) provide the afferent innervation of the hair cells in the \norgan or Corti and relay auditory information from the inner ear to the brain. Voltage-gated \nsodium channels (NaV) initiate and propagate action potentials that encode this sensory \ninformation but little is known regarding the subtypes expressed in these cells. We have used \nRT-PCR and immunohistochemistry to study the compliment and anatomical distribution of \nNaV channels in rodent SGN. NaV1.1, NaV1.6 and NaV1.7 were all detected at the mRNA \nlevel. Fluorescence or streptavidin-horseradish peroxidase immunohistochemistry extended \nthese findings, demonstrating predominant localisation of NaV1.6 and NaV1.7 on SGN cell \nbodies and NaV1.1 on axonal processes. Dual labelling with peripherin demonstrated higher \nNaV1.6 and NaV1.7 expression on Type I, rather than Type II neurons. These results provide \nevidence for selective expression and variations in the distribution of VGSC in the rodent \nSGN, which may guide further studies into afferent function in the auditory pathway and \ntherapeutic approaches for diseases such as hearing loss and tinnitus. \n \nKeywords: Cochlea; immunohistochemistry; peripherin; RT-PCR; spiral ganglion neurons; \nvoltage-gated sodium channels \n \n3 \n \n  \nIntroduction \nThere are nine recognised members of the voltage-gated sodium channel family (VGSC; \nNaV1.1-1.9). Of these NaV1.1, 1.2, 1.3, and 1.6 are highly (but not exclusively) expressed in \nthe central nervous system (Westenbroek, Merrick and Catterall, 1989, Beckh et al., 1989, \nWhitaker et al., 2000, Whitaker et al., 2001, Tzoumaka et al., 2000) whereas NaV1.7, 1.8 and \n1.9 demonstrate a more restricted expression pattern, in autonomic and sensory neurons in the \nperipheral nervous system (Sangameswaran et al., 1997, Toledo-Aral et al., 1997, \nSangameswaran et al., 1996, Dib-Hajj et al., 1998a), and NaV1.4 and NaV1.5 represent the \npredominant skeletal muscle and cardiac sodium channels, respectively (Trimmer et al., \n1990, Rogart et al., 1989). The NaV1.6 sub-type is also highly expressed in the peripheral \nnervous system where it is enriched at the nodes of Ranvier of myelinated axons and \ncontributes to saltatory conduction (Caldwell et al., 2000, Krzemien et al., 2000). \n \nThe spontaneously active spiral ganglion neurons (SGN) form the afferent conduction \npathway in the auditory periphery. There are two types of SGN, Type I neurons that innervate \nthe inner hair cells and Type II neurons that innervate the outer hair cells (Dallos, 1992). The \nconduction of nerve impulses along these afferents is controlled by a number of ion channels \nincluding the voltage-gated sodium channels. Clearly, establishing the expression and \ndistribution of the sodium channels expressed in the auditory periphery could impact our \nunderstanding of action potential dynamics and coding of auditory stimuli as well as normal \nand abnormal phenotypes (Patuzzi et al., 2004, Hossain et al., 2005). This knowledge would \nalso contribute to the development of putative therapeutics for disorders such as tinnitus, \nenabling more precise targeting of channels involved in tinnitogenesis and, potentially \nprovide opportunities for the rational development of sub-type selective ligands to address \nthis area of unmet need (Vio and Holme, 2005). To date, only one study has been reported \n4 \n \n  \nthat has examined VGSC expression and distribution in SGN (Hossain et al., 2005) but this \nwas limited to NaV1.2, and NaV1.6. The aim of this study, therefore, was to fully characterise \nthe expression and distribution pattern of relevant VGSCs using RT-PCR and NaV subtype \nselective antibodies in rat SGN.  \n  \n5 \n \n  \nResults \nNaV alpha subunit expression using RT-PCR \nValidation of primer specificity in Rat cerebral cortex and DRG: To confirm the specificity \nof the primers used, tissue with previously documented NaV α subunit expression were \nutilised. Distinct bands at the correct predicted sizes were observed for NaV1.1, NaV1.2, \nNaV1.3 and NaV1.6 in the cerebral cortex, with weak bands present for NaV1.7 and NaV1.9 \n(Fig. 1A). With the mRNA isolated from the rat DRG, distinct bands were seen for NaV1.1, \nNaV1.7, NaV1.8 and NaV1.9 while a weak band was observed for NaV1.6 (Fig. 1B). \n \nRat spiral ganglion: The RT-PCR primers specific for the NaV α subunits and β-actin were \nused to probe the cDNA created from mRNA isolated from rat modioli homogenates. Distinct \nbands at the correct predicted molecular weight were observed for NaV1.7, NaV1.6 and \nNaV1.1, as well as the control gene β-actin (Fig. 1C). No bands were seen in the lane without \nreverse transcription, showing that there was no genomic DNA contamination.  \n \nImmunocytochemical localization of NaV alpha subunits in spiral ganglion neurons \nNaV1.7: The NaV1.7 antibody strongly labelled the cell bodies of rat SGN using fluorescently \ntagged secondary antibodies (Fig.2A and B). Labelling was found throughout the cytoplasm \nof the cell body, with no clear differentiation between membrane and cytoplasmic labelling. \nVariation was observed in the intensity of labelling, with some neurons strongly labelled and \nothers only faintly labelled (Fig. 2B).  \n \nIn sections of rat cochlea incubated without the primary antibody, the labelling was reduced \nto background levels although pale yellow puncta were noted throughout the cytoplasm (Fig. \n2C).  \n6 \n \n  \n \nTo demonstrate that this punctate labelling was due to non-specific fluorescence, experiments \nwere repeated using the same NaV1.7 antibody but with streptavidin\/horseradish peroxidase \n(HRP) and DAB to non-fluorescently visualise the primary antibody binding. Using this \nmethod, the SGN were positively labelled with brown reaction product as seen in Figs 2D \nand E. The positively labelled SGN cell bodies showed variation in staining intensity, similar \nin appearance to that observed in the fluorescence imaging technique. Additionally, the \nsections of rat cochlea incubated without the primary antibody did not show neurons labelled \nwith the brown reaction product, nor the punctate labelling observed in the previous controls \nusing fluorescently tagged antibodies (Fig. 2F). This confirmed that the puncta could be \nconsidered as tissue autofluorescence.  \n \nNaV1.6: The NaV1.6 antibody strongly labelled the cell bodies of rat SGN (Fig. 3A and B). \nThe pattern of distribution was similar to that seen with the NaV1.7 antibody. Labelling was \nfound throughout the cytoplasm of the cell body, with no clear differentiation between \nmembrane and cytoplasmic labelling. Additionally, there was again considerable variation \nobserved in the intensity of neuronal labelling as seen in Fig. 3B. In contrast to the labelling \nseen with NaV1.7, peripheral and central processes were also strongly labelled for NaV1.6 α-\nsubunits \nAs performed previously, sections of rat cochlea incubated without the primary antibody the \nlabelling was reduced to background levels, although pale yellow autofluorescent puncta \nwere observed throughout the cytoplasm as were also seen for NaV1.7 (Fig. 3C). As for \nNaV1.7, this punctate labelling was demonstrated as non specific by using the HRP\/DAB \nmethod to visualise non-fluorescently primary antibody binding. The SGN were positively \nstained for NaV1.6 with the brown reaction product using this method as seen in Figs 3D and \n7 \n \n  \nE. Again, positively labelled SGN cell bodies showed variation in staining intensity similar in \nappearance to that seen with fluorescence imaging. The distinct staining of the neuronal \nprocesses was replicated and, in addition, staining of the cell body membranes was observed \n(Fig. 3E). Sections of rat cochlea incubated without the primary antibody did not show \nneurons labelled with the brown reaction product nor the punctate labelling observed in the \nprevious fluorescence controls (Fig. 3F). \n \nNaV1.1: The NaV1.1 antibody weakly stained the SG neurons and was only detectable using \nthe non-fluorescent HRP\/DAB method as seen in Figure 4. Weak staining was observed in \nthe SGN cell bodies while darker staining was seen in the neuronal processes, specifically in \nthe axons (Fig 4A and B). The sections of rat cochlea incubated without the primary antibody \ndid not show labelled neurons (Fig. 4C). \n \nPeripherin labelling of spiral ganglion neurons \nIt has been previously reported that antibodies generated against the intermediate filament \nprotein, peripherin, preferentially label Type II SGN in sections of cochlea (Hafidi, 1998, \nMou, Adamson and Davis, 1998, Reid, Flores-Otero and Davis, 2004). A small proportion \n(33\/242 or  14%) of SGN were labelled by this antibody. Most noticeably, all the labelled \nneurons appeared to be smaller compared to the unlabelled neurons (Fig. 5A).  \n \nPeripherin labelling status and NaV1.7: The relationship between cell body area and \nperipherin labelling status was investigated further by dual labelling sections of cochlea with \nperipherin and NaV1.7 antibodies. This was performed using sections from four cochleae (Fig \n5A and B). The frequency histogram of cell body area in Fig. 5C shows that distribution in \nperipherin positive neurons was distinctly separate from that of peripherin negative neurons. \n8 \n \n  \nThe mean difference in peripherin negative and positive cell body areas was significantly \ndifferent, from 165.3 µm\n2\n ±1.8 (n=209) vs 82.2 µm\n2\n ±2.6 (n=33) respectively, p< 0.0001. \nThis represents about a two-fold difference in cell body area.  \n \nOn visual inspection of the sections it appeared that the peripherin positive neurons were \nlabelled less intensely by the NaV1.7 antibody than the peripherin negative neurons. To \ninvestigate the relationship between peripherin and density of NaV1.7 labelling further, the \naverage fluorescence intensity of the neurons labelled with the NaV1.7 antibody and \nperipherin negative and positive neurons was measured in four cochleae.  \n  \nThe mean NaV1.7 fluorescence was significantly different between the peripherin negative \nand positive neurons, from 120.1±1.4 vs 100.2±3.7 respectively at p<0.01. This confirmed \nthe impression of differences in staining intensity between the two groups. Combination of \nthese two parameters in a scatter plot of cell body area versus average fluorescence in Fig 5E, \nfurther illustrates that peripherin negative neurons possess larger cell body areas and label \nmore strongly with NaV1.7 antibody.  \n \nPeripherin labelling status and NaV1.6: An identical set of dual labelling experiments to \nthose with NaV1.7 were performed, using peripherin and NaV1.6 antibodies and sections from \nthe same rat cochleae that were used previously. Similar initial observations and results with \nregards to antibody staining, cell body area and fluorescence intensity were obtained as \nshown in Figs 6 A-E. With NaV1.6 the difference in distribution and means of cell body area \nbetween peripherin negative and positive was more marked than for NaV1.7. The differences \nin mean cell body area were significantly different with means of 185.7±2.2µm\n2\n (n=203) vs \n74.8±3.2µm\n2\n (n=34) respectively, p <0.001, or about a 2.5 fold difference in cell body area.  \n9 \n \n  \n \nDifferences in mean NaV1.6 fluorescence between the negative and positive stained \nperipherin neurons were also significantly different, with mean difference of about 40 units; \n142.6±1.7 (n=203) vs 101.6±3.2 (n=34) respectively, p <0.001.  \n \nCombination of the two parameters in a scatter plot of cell body area versus average \nfluorescence in Fig 5E, further illustrates that peripherin negative neurons label more \nintensely than with NaV1.6 antibody.  \n \nComparison of NaV1.6 and NaV1.7 SGN labelling: Direct comparison of NaV1.6 and NaV1.7 \nimmunofluorescence values was not justified as the relative antibody binding affinities were \nnot known. However, SGN cell body area could be compared directly. The Type I means of \n185.7±2.2µm\n2\n vs 165.3 µm\n2\n ±1.8µm\n2\n for NaV1.6 and NaV1.7 respectively, were highly \nsignificantly different at p <0.001. The respective difference in Type II means, 74.8±3.2µm\n2\n \nvs 82.2 µm\n2\n ±2.6, for NaV1.6 and NaV1.7 was not significant at p>0.05.  \n  \nPeripherin labelling status and NaV1.1: Dual labelling experiments with peripherin and \nNaV1.1 antibodies could not be performed because of the weak labelling of the SGN cell \nbodies using NaV1.1 antibodies.  \n \n  \n10 \n \n  \nDiscussion \nRat SGN exhibits a unique pattern of NaV subunit expression: The results presented here \nprovide for the first time strong evidence that the α-subunits, NaV1.7, NaV1.6 and NaV1.1, are \nselectively expressed in adult rat SGNs. There are a number of unusual features in this pattern \nof NaV subunit expression, as they suggest that expression in the SGN does not follow that \nobserved in either the central or peripheral nervous system. Instead, the results presented here \nshow NaV isoforms normally considered to be specific to the peripheral and central nervous \nsystem are both expressed in the SGN. The explanation for this may be related to the \nindependent embryological origins of the SGN (Fekete and Wu, 2002). The peripheral and \ncentral nervous systems are known to arise from different progenitor cells in the developing \nembryo. The CNS forms from the dorsal ectoderm through envagination and formation of the \nneural tube. DRG neurons arise from neural crest cells that migrate laterally to form the \nperipheral ganglia (Kuan et al., 2004, Li, Say and Zhou, 2007). In contrast, the SGN develops \nfrom a distinct region of neural ectoderm known as the otic placode, which is separate from \nboth the neural tube and neural crest cells (Holley, 2005, Fekete and Wu, 2002). The results \nfrom this study suggest that the otic placode displays an intermediate phenotype with regard \nto NaV channel expression between the CNS and PNS. \n \nNaV1.1 subunit expression: NaV1.1 has been previously been shown to be strongly expressed \nby neurons in the central nervous system (Westenbroek, Merrick and Catterall, 1989). The \npreliminary results from this study appear to show that NaV1.1 is weakly expressed in the \nSGN with strong axonal localisation. As dual labelling experiments could not be performed \nusing the NaV1.1 antibody, we cannot report if NaV1.1 expression is restricted to the Type I \nor Type II neurons. \n \n11 \n \n  \nNaV1.7 subunit expression: NaV1.7 is considered to be exclusively expressed by neurons in \nthe PNS, especially in the cell bodies (Sangameswaran et al., 1997) and peripheral terminals \nor growth cones (Toledo-Aral et al., 1997) of DRG neurons. The results presented here also \nshow that the NaV1.7 subtype is expressed in the cell bodies of the rat SGN. In contrast to this \nrodent model, NaV1.7 was not reported to be present in the murine model of Hossain et al., \n(2005). This may reflect a species difference in expression of the NaV1.7 subunit.  \n \nNaV1.6 subunit expression: It has been previously reported that the NaV1.6 subtype is \nexpressed in murine SGN (Hossain et al., 2005) with NaV1.6 localised at the initial segment \nand nodes of Ranvier and not in the cell bodies. The results here in the rat SGN are also \npartly in line with this earlier study. NaV1.6 labelling was found in the cell body cytoplasm as \nwell as the processes of the rat SGN. The presence of cytoplasmic labelling in the cell body \nseen here is in agreement with previous reports of NaV1.6 labelling in other sensory ganglia \n(Tzoumaka et al., 2000, Krzemien et al., 2000, Black et al., 1999). In addition, cytoplasmic \nlabelling has also been reported for potassium channels in the cell bodies of murine SGN \n(Adamson et al., 2002) and rat DRG neurons (Rasband et al., 2001). This type of labelling is \nmost likely due to the pooling of subunit proteins in the Golgi apparatus, prior to their \ntransport and insertion into the membrane. \n \nDifferential expression of NaV1.6 and NaV1.7 in SGN Type 1 and Type II: The measurement \nof SGN cell body area along with semi-quantitative fluorescence and non-fluorescence \nimaging techniques enabled the evident variation in labelling intensity to be explored in more \ndetail. Resolution of differential expression was further enhanced by the use of dual labelling \nwith peripherin antibody (Hafidi, 1998, Mou, Adamson and Davis, 1998, Reid, Flores-Otero \n12 \n \n  \nand Davis, 2004). The differences in SGN Type 1 and II cell body area have been reported \npreviously and are confirmed by this study (Berglund and Ryugo, 1987).   \n \nWhilst reduced fluorescence for both NaV1.6 and 1.7 was apparent in Type II neurons, the \nintensity of labelling observed was above background levels, indicating that Type II SGN \nexpress these subunits. This would support their possessing some functional capacity. \nCurrently, little electrophysiological evidence exists to identify the specific role of Type II \nfibres or that they actually exhibit any acoustically driven activity (Brown, 1994, Robertson, \nSellick and Patuzzi, 1999), although it has been proposed they may signal static displacement \nof the basilar membrane (Robertson, Sellick and Patuzzi, 1999).  \n \nThe difference in cell area between NaV1.6 and 1.7 expressing Type I neurons may be \nexplained in at least two ways. One hypothesis is that the difference may correlate with \nsignalling function as spontaneous activity in mammalian Type I afferents is known to range \nbetween 0-120 spikes sec\n-1\n, which correlates with axon diameter (Liberman, 1982). It would \nbe reasonable to assume that axon diameter also correlates with cell body area and that the \nexpression of NaV1.6 and 1.7 in Type I SGN may then be related to the spontaneous and\/or \ndriven activity of Type I fibres. Alternatively, the differences may simply reflect more \nintense membranous staining by NaV1.6 over 1.7. NaV1.6 has a role in action potential \ninitiation and propagation in many neurons due to its localisation at the axon hillock and \nnodes of Ranvier, respectively. By contrast NaV1.7, a channel that shows slow inactivation \nand stays open in response to slow ramp depolarisations, may have a role in initiating action \npotential initiation at the hair cell-afferent fibre synapse.  \n \n13 \n \n  \nExpression of other NaV isoforms in the SGN: The expression of other voltage-gated sodium \nchannel isoforms was also investigated in this study. RT-PCR failed to show the expression \nof mRNA for NaV1.2, NaV1.3, NaV1.8 and NaV1.9, indicating that these isoforms are not \nexpressed in the rat SGN.  \n \nInterestingly, in the murine study by Hossain et al., (2005), NaV1.2 expression in the in the \nOrgan of Corti was observed, but only in the efferent innervation to inner and outer hair cells \n(Hossain et al., 2005). The absence of evidence for expression of NaV1.8 and NaV1.9 \nisoforms in this study is in line with earlier observations that TTX completely abolished \ninward sodium current in isolated SGN (Santos-Sacchi, 1993). NaV1.4 and NaV1.5 expression \nin the SGN was not studied, as these isoforms are believed to be selectively expressed in \nskeletal and cardiac muscle respectively (Catterall, Goldin and Waxman, 2005). \n  \nControl results: The extensive analysis and comprehensive documentation of the expression \nof NaV subunits in the CNS and PNS neurons provided positive controls for RT-PCR primers \nused in the current study. CNS neurons have been shown to express NaV1.1, NaV1.2 \n(Westenbroek, Merrick and Catterall, 1989), NaV1.3 (Beckh et al., 1989) and NaV1.6 \n(Tzoumaka et al., 2000), and mRNA isolated from the cerebral cortex was used to test the \nspecificity of the RT-PCR primers designed for these NaV subunits. NaV1.7 and NaV1.9 were \nalso weakly identified by the RT-PCR primers. While these proteins have not been identified \nin the cerebral cortex, the mRNA has been detected in this tissue previously (Dib-Hajj et al., \n1998a, Belcher et al., 1995). The mRNA isolated from the DRG was used as a positive \ncontrol to validate the specificity of the RT-PCR primers designed to detect NaV1.7, NaV1.8 \nand NaV1.9, as the DRG has been previously reported to express these subunits \n(Sangameswaran et al., 1997, Dib-Hajj et al., 1998a, Dib-Hajj et al., 1998b). The RT-PCR \n14 \n \n  \nprimers also identified NaV1.1 mRNA in the DRG tissues. This result has been reported \npreviously (Beckh, 1990), but whilst the mRNA for NaV1.1 has been identified in the DRG, \nthe protein has not been detected in the peripheral nervous system (Gordon et al., 1987). Both \nthese control tissues yielded results that confirmed that the designed primers were specific for \ntheir respective NaV isoforms. \n \nAntibody specificity is necessary for the reliable interpretation of immunohistochemical data. \nSections of rat cochlea without primary antibodies did not display fluorescence specific to the \nbinding of the secondary antibodies to their antigens. However, non-specific cytoplasmic \nyellow puncta were observed in the SG cell bodies. These results indicate that in the adult rat \nSGN there are other sources of endogenous fluorescence, possibly lipofuscin. This has also \nbeen reported in other adult neural ganglia, including the retina, vestibular and dorsal root \nganglion and cerebellar Purkinje cells (Sans, Bartolami and Fraysse, 1996, Samorajski, Ordy \nand Rady-Reimer, 1968). Furthermore, we are confident that these puncta were due to non-\nspecific fluorescence, since we used non-fluorescence DAB\/HRP visualisation methods to \nvalidate the original results. \n \nCharacterising NaV Isoforms in the Auditory pathway- Therapeutic Applications: The \ncharacterisation of NaV isoforms in the periphery of the normal auditory pathway contribute \nto the development of therapeutics for treating conditions such as tinnitus. The clinical \nevidence that voltage-gated sodium blockers may have a role in ameliorating certain types of \ntinnitus is well documented because lignocaine, a use-dependent sodium channel blocker and \nlocal anaesthetic, is the gold standard tinnitolytic agent and is effective in around 50% of \npatients (Baguley et al., 2005). Following ototrauma, it is apparent that marked plastic \nchanges occur in the auditory pathway some of which have parallels with sensory nerve \n15 \n \n  \ntrauma (Moller, 1997, Kaltenbach et al., 1998). In models of neuropathic pain this is \naccompanied by changes in pattern and expression of NaV subtype and profound changes in \nneuronal excitability (Devor, 2006, Novakovic et al., 1998, Black et al., 2004, Cummins and \nWaxman, 1997). Several NaV channel subtypes including NaV1.7 and NaV1.8 have been \nimplied to regulate spontaneous firing in damaged nociceptive afferents although there is \nmuch debate from studies using antisense knock-down methodologies and transgenic animals \nas to which are the most important (for reviews see Krafte and Bannon, 2008, Momin and \nWood, 2008).  \n \nThe use of appropriate models of ototrauma would establish whether similar or other changes \nin NaV isoforms may underlie tinnitus. This would provide the basis for optimal matching of \ntinnitolytic therapeutics to their tinnitogenic target.  \n  \n16 \n \n  \nExperimental Methods \nRT-PCR \nTissue extraction: Male Wistar rats (250-400g) were sacrificed using Euthanal® (IP) in \naccordance with UK Home Office Animals Act 1986 (schedule 1). The dorsal root ganglia \n(DRG) and cerebral cortex were rapidly excised and frozen over dry ice in a sterile \nRNase\/DNase free tube. The temporal bones were removed and excess bone was removed to \nleave the bony inner ear segment that contained the cochlea. The otic capsule of the cochlea \nwas removed to reveal the modiolus, which was then carefully removed from the remaining \nbone and frozen over dry ice as above.  \nmRNA isolation and cDNA synthesis: Two modioli- from the left and right ear of one animal- \nsix DRGs and 35 mg of cerebral cortex were used per analysis. The tissues were \nhomogenised separately in lysis buffer, by pestle and mortar, and centrifuged in a \nQIAshredder (QIAGEN, Crawley, UK). The total RNA was isolated from the homogenates \nusing the RNeasy mini kit (QIAGEN). The RNA was eluted in RNase free water and the \nremaining DNA was removed by using DNase I (Invitrogen, Paisley, UK). The total RNA \nwas reverse transcribed to complementary (c)DNA using SuperScript\nTM\n III Reverse \nTranscriptase (Invitrogen) The cDNA was stored at -80\no\nC until use. \n \nPCR reaction: The PCR reaction was performed using BIOTAQ DNA polymerase (Bioline, \nLondon, UK), custom designed sense and antisense primers at 0.5μM final concentration \n(Sigma Genosys, Cambridge, UK) and 1μl of cDNA using a T-Gradient Biometra \nthermocycler (Biotron, Göttingen, Germany). Thirty-five PCR cycles were performed using \nannealing temperatures between 54 and 59\no\nC. The PCR products were separated by \nelectrophoresis on a 1% agarose gel with ethidium bromide and a 100 base pair DNA ladder \n(Promega, Southampton, UK) at 110V. The gel was photographed under ultraviolet \n17 \n \n  \nillumination using a digital camera and Kodak digital science 1D software (Kodak). The \nmRNA isolation, cDNA synthesis and PCR reaction was repeated four times, using modioli \nfrom a fresh rat each time. \n \nPrimer design: Primer pairs specific to the NaV alpha subunits and β-actin used are \nsummarised in table 1. The primer pairs were designed to cross intron-exon boundaries as \ndetermined from the rat sequences. This would show any genomic DNA contamination of the \nPCR products as a higher base pair size band than the calculated band. The identity of PCR \nproducts was confirmed by sequencing. \n \nTissue preparation for immunohistochemistry \nDorsal root ganglion extraction: Male Wistar rats (250-300g) were sacrificed by stunning \nand cervical dislocation, in accordance with UK Home Office Animals Act 1986 (Schedule \n1). The DRG were rapidly excised, embedded in Tissue-Tek OCT (Sakura Finetek, Bayer \nplc, Newbury, UK), frozen over dry ice\/hexane and stored at –20 C. Frozen sections were cut \n(10 m) from tissue blocks, mounted on Polysine\nTM\n slides (VWR International, Lutterworth, \nUK) and air-dried. Tissue sections were fixed in freshly prepared 2% paraformaldehyde \nsolution for 10 minutes at room temperature and washed (1x15 mins) in phosphate buffered \nsaline (PBS, pH 7.4). \nCochlea extraction: Male Wistar rats (250-300g) were sacrificed using Euthanal\n®\n (IP) in \naccordance with UK Home Office Animals Act 1986 (schedule 1). The circulatory system of \nthe animal was flushed transcardially with warm PBS supplemented with heparin. For \nfixation the animal was perfused transcardially with warm 2% paraformaldehyde solution. \nThe temporal bones were dissected and excess bone was removed to leave the bony inner ear \nsegment that contained the cochlea. The cochleae were placed in 2% paraformaldehyde \n18 \n \n  \nsolution for 30 minutes and demineralised in 8% EDTA until soft (4 to 10 days at 4\no\nC). They \nwere then placed in PBS with 30% sucrose overnight at 4\no\nC and then were infiltrated with \nTissue Tek OCT overnight at 4\no\nC (Cho et al., 2004). The fixed cochleae were quickly frozen \nin Tissue Tek over dry ice\/hexane and stored at -20\no\nC. Frozen 10 m sections were cut from \ntissue blocks, mounted on Polysine\nTM\n slides and air dried. Tissue sections were washed (1x15 \nmins) in PBS. \n \nImmunohistochemistry on frozen sections  \nAntibody information: Information about the primary and secondary antibodies used in this \nstudy is presented in table 2. \n \nFluorescent probe staining: For detection of sodium channel subtypes, the slides were \nincubated in the following: (1) Blocking solution of PBS containing 10% goat serum, \nsupplemented with 0.5% Triton X-100 for 30 min at room temperature; (2) Sodium channel \nsubtype specific primary polyclonal antibodies raised in rabbit (see table 2 for details) diluted \nin blocking solution and incubated overnight at 4\no\nC; (3) Goat anti-rabbit IgG conjugated with \nfluorescein isothiocyanate (FITC) for 2 hours at room temperature. Between each incubation \nstep, the sections were thoroughly washed with PBS. Sections were mounted with Citifluor \nAF1 mountant (UKC Chem. Lab, Kent, UK).  \n \nControl experiments were carried out to determine the amount of non-specific binding by \nomitting the primary antiserum from the incubation media. Pre-incubation of primary \nantibody with the blocking peptide overnight reduced the labelling to background levels.  \n \n19 \n \n  \nFor identification of Type II SG neurons, experiments were carried out using an anti-\nperipherin monoclonal antibody MAB 1527 raised in mouse (Millipore, Watford, UK) as this \nprotein is known to be selectively expressed in Type II SG neurons (Hafidi, 1998, Mou, \nAdamson and Davis, 1998, Reid, Flores-Otero and Davis, 2004). Immunostaining was \nvisualised with goat anti-mouse secondary antibodies conjugated with Texas Red (Jackson \nImmunoResearch). \n \nThe sections were viewed using a Nikon Labophot 2A microscope equipped for \nepifluorescense imaging and photography, with a monochromatic CCD camera, frame \ngrabber card and software (Scion Image\nTM\n). Photography of tissue sections was carried out \nwith the appropriate filters for FITC or Texas Red. \n \nScion Image\nTM\n (Scion Corporation, Frederick, Maryland USA) was used to measure the cell \nbody area and average fluorescence of the neurons from the epifluorescent images. Only \nneurons that showed an unlabelled nucleus and an intact cell body were measured. The \nfluorescence scale ranged from: 0= black; 255= white. Unless otherwise stated, this scale is \nused throughout the results and discussion sections. \n \nNon-fluorescence DAB\/HRP staining: For non-fluorescence detection of sodium channel \nsubtypes, the tissue sections were incubated sequentially in the following solutions: (1) 0.2% \nHydrogen peroxide in methanol for 15 minutes; (2) 10% swine serum and 0.5% Triton X-100 \nin PBS for 30 minutes at room temperature; (3) Anti-rabbit polyclonal antibodies as \ndescribed above, overnight at 4\no\nC; (5) Swine anti-rabbit biotin conjugated IgG, diluted with \n10% swine serum in PBS for 35 minutes at room temperature (DAKO, Ely, UK); (6) \nStreptavidin-Horseradish peroxidase (HRP) conjugate prediluted for 30 minutes at room \n20 \n \n  \ntemperature (DAKO); (7) 3, 3'-diaminobenzidine solution (DAB substrate kit, DAKO) for 4 \nminutes at room temperature; (8) 70% IMS for 5 minutes followed by 100% IMS for 5 \nminutes and 100% xylene twice for 5 minutes. Between steps 1 and 8 the tissue sections were \nthoroughly washed with PBS. Sections were mounted using DPX (RA Lamb, Eastbourne, \nUK). \n \nThe slides were examined using a light microscope equipped with a digital camera (Moticam \n2300, GT Vision, Haverhill, Suffolk, UK) and images were captured using Motic Images \nPlus 2.0 \n \nStatistical Analysis  \nStatistical analysis was carried out with data entered into a Microsoft Office Excel 2007 \nspreadsheet. Comparison of different data groups was performed using the two-tailed \nStudents t-test. Results are expressed as means ± se and a p=0.05 significance level was \nadopted throughout.  \n21 \n \n  \nAcknowledgements \nAF was in receipt of BBSRC CASE studentship in association with GlaxoSmithKline and a \ngrant from the Ménière's Society. The authors would like to thank Mrs Susan. Giblett for \nproviding valuable help in the HRP\/DAB staining and Dr Amit Prasai for conducting the \npreliminary experiments in this study. \n \n  \n22 \n \n  \nSubunit Forward primer Reverse primer \nPredicted \nband \n(bp) \nAnnealing \ntemperature \n(oC) \nNaV1.1 GCGTGCTGCCGGGAAAACATAC ACGTCCTTCGCTCGCCCTCTGA 576 59 \nNaV1.2 CGTCCGCAGAATCCAGAGA CTTGAAGGGTCTTCCAACAAGTC 705 58 \nNaV1.3 AGGGAAGGATTGACTTGCC TGGACCTCTCCTTAGAGTCCA 295 58 \nNaV1.6 AAGTGGACAGCCTACGGC TTGTTGACAATATCGATTTCGAACCG 364 58 \nNaV1.7 GACGACAGCGGCACGACTAAT AGCTGCGAAGATCCCTGTAAAGA 402 54 \nNaV1.8 GATCCGTGGAACTGGCTGGA GAGGAATGCCCACGCAAAGGAATC 482 58 \nNaV1.9 CCCTGCTGCGCTCGGTGAAGAA GACAAAGTAGATCCCAGAGG 395 58 \nβ-actin TACAACCTCCTTGCAGCTCC GGATCTTCATGAGGTAGTCTGTC 630 59 \n \nTable 1. PCR Primers. Primers were either designed or modified from others previously \npublished. NaV1.2, NaV1.3, NaV1.6 (Wooltorton et al., 2007); NaV1.8 (Dib-Hajj et al., \n1998b); NaV1.9 (Dib-Hajj et al., 1998a); β- actin (Raff et al., 1997).  \n \n \nAntibody Host Dilution Supplier Product code \nAnti NaV1.1 Rabbit 1:200 Alomone Labs ASC-001 \nAnti-NaV1.6 Rabbit 1:200 Alomone Labs ASC-009 \nAnti-NaV1.7 Rabbit 1:200 Alomone Labs ASC-008 \nAnti-Peripherin Mouse 1:100 Millipore MAB1527 \nAnti-rabbit\/FITC Goat 1:400 Jackson ImmunoResearch 111-095-144 \nAnti-mouse\/Texas red Goat 1:400 Jackson ImmunoResearch 115-075-146 \nAnti-rabbit\/biotin Swine 1:350 DAKO E0353 \nTable 2. Immunohistochemistry antibodies. Details of the antibodies used in the study. \nEntries with \/ indicates a conjugation, i.e. anti-rabbit\/biotin means anti-rabbit conjugated with \nbiotin. \n  \n23 \n \n  \nReferences \nAdamson, C. L., Reid, M.A., Mo, Z., Bowne-English, J. & Davis, R.L. (2002) Firing features \nand potassium channel content of murine spiral ganglion neurons vary with cochlear location. \nThe Journal of Comparative Neurology, 447, 331-350.  \nBaguley, D. M., Jones, S., Wilkins, I., Axon, P.R. & Moffat, D.A. (2005) The inhibitory \neffect of intravenous lidocaine infusion on tinnitus after translabyrinthine removal of \nvestibular schwannoma: A double-blind, placebo-controlled, crossover study. Otology & \nNeurotology, 26, 169-176.  \nBeckh, S. (1990) Differential expression of sodium channel mRNAs in rat peripheral nervous \nsystem and innervated tissues. FEBS Lett., 262, 317-322.  \nBeckh, S., Noda, M., Lubbert, H. & Numa, S. (1989) Differential regulation of three sodium \nchannel messenger RNAs in the rat central nervous system during development. EMBO J., 8, \n3611-3616.  \nBelcher, S. M., Zerillo, C.A., Levenson, R., Ritchie, J.M. & Howe, J.R. (1995) Cloning of a \nsodium channel alpha subunit from rabbit schwann cells. Proc. Natl. Acad. Sci. U. S. A., 92, \n11034-11038.  \nBerglund, A. M. & Ryugo, D.K. (1987) Hair cell innervation by spiral ganglion neurons in \nthe mouse. J. Comp. Neurol., 255, 560-570.  \nBlack, J. A., Liu, S., Tanaka, M., Cummins, T.R. & Waxman, S.G. (2004) Changes in the \nexpression of tetrodotoxin-sensitive sodium channels within dorsal root ganglia neurons in \ninflammatory pain. Pain, 108, 237-247.  \nBlack, J. A., Cummins, T.R., Plumpton, C., Chen, Y.H., Hormuzdiar, W., Clare, J.J. & \nWaxman, S.G. (1999) Upregulation of a silent sodium channel after peripheral, but not \ncentral, nerve injury in DRG neurons. J. Neurophysiol., 82, 2776-2785.  \nBrown, M. C. (1994) Antidromic responses of single units from the spiral ganglion. J. \nNeurophysiol., 71, 1835-1847.  \nCaldwell, J. H., Schaller, K.L., Lasher, R.S., Peles, E. & Levinson, S.R. (2000) Sodium \nchannel NaV1.6 is localized at nodes of ranvier, dendrites, and synapses. PNAS, 97, 5616-\n5620.  \nCatterall, W. A., Goldin, A.L. & Waxman, S.G. (2005) International union of pharmacology. \nXLVII. nomenclature and structure-function relationships of voltage-gated sodium channels. \nPharmacol. Rev., 57, 397-409.  \nCho, Y., Gong, T.L., Kanicki, A., Altschuler, R.A. & Lomax, M.I. (2004) Noise \noverstimulation induces immediate early genes in the rat cochlea. Molecular Brain Research, \n130, 134-148.  \n24 \n \n  \nCummins, T. R. & Waxman, S.G. (1997) Downregulation of tetrodotoxin-resistant sodium \ncurrents and upregulation of a rapidly repriming tetrodotoxin-sensitive sodium current in \nsmall spinal sensory neurons after nerve injury. Journal of Neuroscience, 17, 3503-3514.  \nDallos, P. (1992) The active cochlea. The journal of neuroscience, 12, 4575-4585.  \nDevor, M. (2006) Sodium channels and mechanisms of neuropathic pain. Journal of Pain, 7, \nS3-S12.  \nDib-Hajj, S. D., Black, J.A., Cummins, T.R., Kenney, A.M., Kocsis, J.D. & Waxman, S.G. \n(1998a) Rescue of alpha-SNS sodium channel expression in small dorsal root ganglion \nneurons after axotomy by nerve growth factor in vivo. J. Neurophysiol., 79, 2668-2676.  \nDib-Hajj, S. D., Tyrrell, L., Black, J.A. & Waxman, S.G. (1998b) NaN, a novel voltage-gated \nna channel, is expressed preferentially in peripheral sensory neurons and down-regulated \nafter axotomy. Proc. Natl. Acad. Sci. U. S. A., 95, 8963-8968.  \nFekete, D. M. & Wu, D.K. (2002) Revisiting cell fate specification in the inner ear. Curr. \nOpin. Neurobiol., 12, 35-42.  \nGordon, D., Merrick, D., Auld, V., Dunn, R., Goldin, A.L., Davidson, N. & Catterall, W.A. \n(1987) Tissue-specific expression of the RI and RII sodium channel subtypes. Proc. Natl. \nAcad. Sci. U. S. A., 84, 8682-8686.  \nHafidi, A. (1998) Peripherin-like immunoreactivity in type II spiral ganglion cell body and \nprojections. Brain Res., 805, 181-190.  \nHolley, M. C. (2005) Keynote review: The auditory system, hearing loss and potential targets \nfor drug development. Drug Discov. Today, 10, 1269-1282.  \nHossain, W. A., Antic, S.D., Yang, Y., Rasband, M.N. & Morest, D.K. (2005) Where is the \nspike generator of the cochlear nerve? voltage-gated sodium channels in the mouse cochlea. \nJournal of Neuroscience, 25, 6857-6868.  \nKaltenbach, J. A., Godfrey, D.A., Neumann, J.B., McCaslin, D.L., Afman, C.E. & Zhang, J. \n(1998) Changes in spontaneous neural activity in the dorsal cochlear nucleus following \nexposure to intense sound: Relation to threshold shift. Hear. Res., 124, 78-84.  \nKrzemien, D. M., Schaller, K.L., Levinson, S.R. & Caldwell, J.H. (2000) Immunolocalization \nof sodium channel isoform NaCh6 in the nervous system. J. Comp. Neurol., 420, 70-83.  \nKuan, C. Y., Tannahill, D., Cook, G.M. & Keynes, R.J. (2004) Somite polarity and segmental \npatterning of the peripheral nervous system. Mech. Dev., 121, 1055-1068.  \nLi, H. Y., Say, E.H. & Zhou, X.F. (2007) Isolation and characterization of neural crest \nprogenitors from adult dorsal root ganglia. Stem Cells, 25, 2053-2065.  \nLiberman, M. C. (1982) Single-neuron labeling in the cat auditory nerve. Science, 216, 1239-\n1241.  \n25 \n \n  \nMoller, A. R. (1997) Similarities between chronic pain and tinnitus. The American Journal of \nOtology, 18, 577-585.  \nMou, K., Adamson, C.L. & Davis, R.L. (1998) Time-dependence and cell-type specificity of \nsynergistic neurotrophin actions on spiral ganglion neurons. J. Comp. Neurol., 402, 129-139.  \nNovakovic, S. D., Tzoumaka, E., McGivern, J.G., Haraguchi, M., Sangameswaran, L., \nGogas, K.R., Eglen, R.M. & Hunter, J.C. (1998) Distribution of the tetrodotoxin-resistant \nsodium channel PN3 in rat sensory neurons in normal and neuropathic conditions. Journal of \nNeuroscience, 18, 2174-2187.  \nPatuzzi, R. B., Brown, D.J., McMahon, C.M. & Halliday, A.F. (2004) Determinants of the \nspectrum of the neural electrical activity at the round window: Transmitter release and neural \ndepolarisation. Hear. Res., 190, 87-108.  \nRaff, T., van der Giet, M., Endemann, D., Wiederholt, T. & Paul, M. (1997) Design and \ntesting of beta-actin primers for RT-PCR that do not co-amplify processed pseudogenes. \nBiotechniques, 23, 456-460.  \nRasband, M. N., Park, E.W., Vanderah, T.W., Lai, J., Porreca, F. & Trimmer, J.S. (2001) \nDistinct potassium channels on pain-sensing neurons. Proc. Natl. Acad. Sci. U. S. A., 98, \n13373-13378.  \nReid, M. A., Flores-Otero, J. & Davis, R.L. (2004) Firing patterns of type II spiral ganglion \nneurons in vitro. Journal of Neuroscience, 24, 733-742.  \nRobertson, D., Sellick, P.M. & Patuzzi, R. (1999) The continuing search for outer hair cell \nafferents in the guinea pig spiral ganglion. Hear. Res., 136, 151-158.  \nRogart, R. B., Cribbs, L.L., Muglia, L.K., Kephart, D.D. & Kaiser, M.W. (1989) Molecular \ncloning of a putative tetrodotoxin-resistant rat heart na+ channel isoform. Proc. Natl. Acad. \nSci. U. S. A. ; Proceedings of the National Academy of Sciences of the United States of \nAmerica, 86, 8170-8174.  \nSamorajski, T., Ordy, J.M. & Rady-Reimer, P. (1968) Lipofuscin pigment accumulation in \nthe nervous system of aging mice. Anat. Rec., 160, 555-573.  \nSangameswaran, L., Fish, L.M., Koch, B.D., Rabert, D.K., Delgado, S.G., Ilnicka, M., \nJakeman, L.B., Novakovic, S., Wong, K., Sze, P., Tzoumaka, E., Stewart, G.R., Herman, \nR.C., Chan, H., Eglen, R.M. & Hunter, J.C. (1997) A novel tetrodotoxin-sensitive, voltage-\ngated sodium channel expressed in rat and human dorsal root ganglia. J. Biol. Chem., 272, \n14805-14809.  \nSangameswaran, L., Delgado, S.G., Fish, L.M., Koch, B.D., Jakeman, L.B., Stewart, G.R., \nSze, P., Hunter, J.C., Eglen, R.M. & Herman, R.C. (1996) Structure and function of a novel \nvoltage-gated, tetrodotoxin-resistant sodium channel specific to sensory neurons. J. Biol. \nChem., 271, 5953-5956.  \nSans, A., Bartolami, S. & Fraysse, B. (1996) Histopathology of the peripheral vestibular \nsystem in small vestibular schwannomas. Am. J. Otol., 17, 326-324.  \n26 \n \n  \nSantos-Sacchi, J. (1993) Voltage-dependent ionic conductances of type I spiral ganglion cells \nfrom the guinea pig inner ear. Journal of Neuroscience, 13, 3599-3611.  \nToledo-Aral, J. J., Moss, B.L., He, Z.J., Koszowski, A.G., Whisenand, T., Levinson, S.R., \nWolf, J.J., Silos-Santiago, I., Halegoua, S. & Mandel, G. (1997) Identification of PN1, a \npredominant voltage-dependent sodium channel expressed principally in peripheral neurons. \nProc. Natl. Acad. Sci. U. S. A., 94, 1527-1532.  \nTrimmer, J. S., Cooperman, S.S., Agnew, W.S. & Mandel, G. (1990) Regulation of muscle \nsodium channel transcripts during development and in response to denervation. Dev. Biol., \n142, 360-367.  \nTzoumaka, E., Tischler, A.C., Sangameswaran, L., Eglen, R.M., Hunter, J.C. & Novakovic, \nS.D. (2000) Differential distribution of the tetrodotoxin-sensitive rPN4\/NaCh6\/Scn8a sodium \nchannel in the nervous system. J. Neurosci. Res., 60, 37-44.  \nVio, M. M. & Holme, R.H. (2005) Hearing loss and tinnitus: 250 million people and a US$10 \nbillion potential market. Drug Discov. Today, 10, 1263-1265.  \nWestenbroek, R. E., Merrick, D.K. & Catterall, W.A. (1989) Differential subcellular \nlocalization of the RI and RII na+ channel subtypes in central neurons. Neuron, 3, 695-704.  \nWhitaker, W. R., Clare, J.J., Powell, A.J., Chen, Y.H., Faull, R.L. & Emson, P.C. (2000) \nDistribution of voltage-gated sodium channel alpha-subunit and beta-subunit mRNAs in \nhuman hippocampal formation, cortex, and cerebellum. J. Comp. Neurol., 422, 123-139.  \nWhitaker, W. R. J., Faull, R.L.M., Waldvogel, H.J., Plumpton, C.J., Emson, P.C. & Clare, \nJ.J. (2001) Comparative distribution of voltage-gated sodium channel proteins in human \nbrain. Mol. Brain Res., 88, 37-53.  \nWooltorton, J. R., Gaboyard, S., Hurley, K.M., Price, S.D., Garcia, J.L., Zhong, M., \nLysakowski, A. & Eatock, R.A. (2007) Developmental changes in two voltage-dependent \nsodium currents in utricular hair cells. J. Neurophysiol., 97, 1684-1704.  \nAdamson CL, Reid MA, Mo Z, Bowne-English J, Davis RL (2002) Firing features and \npotassium channel content of murine spiral ganglion neurons vary with cochlear location. \nThe Journal of Comparative Neurology 447:331-350.  \nBaguley DM, Jones S, Wilkins I, Axon PR, Moffat DA (2005) The inhibitory effect of \nintravenous lidocaine infusion on tinnitus after translabyrinthine removal of vestibular \nschwannoma: A double-blind, placebo-controlled, crossover study. Otology & Neurotology \n26:169-176.  \n27 \n \n  \nBeckh S, Noda M, Lubbert H, Numa S (1989) Differential regulation of three sodium channel \nmessenger RNAs in the rat central nervous system during development. EMBO J 8:3611-\n3616.  \nBeckh S (1990) Differential expression of sodium channel mRNAs in rat peripheral nervous \nsystem and innervated tissues. FEBS Lett 262:317-322.  \nBelcher SM, Zerillo CA, Levenson R, Ritchie JM, Howe JR (1995) Cloning of a sodium \nchannel alpha subunit from rabbit schwann cells. Proc Natl Acad Sci U S A 92:11034-11038.  \nBerglund AM, Ryugo DK (1987) Hair cell innervation by spiral ganglion neurons in the \nmouse. J Comp Neurol 255:560-570.  \nBlack JA, Cummins TR, Plumpton C, Chen YH, Hormuzdiar W, Clare JJ, Waxman SG \n(1999) Upregulation of a silent sodium channel after peripheral, but not central, nerve injury \nin DRG neurons. J Neurophysiol 82:2776-2785.  \nBlack JA, Liu S, Tanaka M, Cummins TR, Waxman SG (2004) Changes in the expression of \ntetrodotoxin-sensitive sodium channels within dorsal root ganglia neurons in inflammatory \npain. Pain 108:237-247.  \nBrown MC (1994) Antidromic responses of single units from the spiral ganglion. J \nNeurophysiol 71:1835-1847.  \nCaldwell JH, Schaller KL, Lasher RS, Peles E, Levinson SR (2000) Sodium channel NaV1.6 \nis localized at nodes of ranvier, dendrites, and synapses. PNAS 97:5616-5620.  \n28 \n \n  \nCatterall WA, Goldin AL, Waxman SG (2005) International union of pharmacology. XLVII. \nnomenclature and structure-function relationships of voltage-gated sodium channels. \nPharmacol Rev 57:397-409.  \nCho Y, Gong TL, Kanicki A, Altschuler RA, Lomax MI (2004) Noise overstimulation \ninduces immediate early genes in the rat cochlea. Molecular Brain Research 130:134-148.  \nCummins TR, Waxman SG (1997) Downregulation of tetrodotoxin-resistant sodium currents \nand upregulation of a rapidly repriming tetrodotoxin-sensitive sodium current in small spinal \nsensory neurons after nerve injury. Journal of Neuroscience 17:3503-3514.  \nDallos P (1992) The active cochlea. The Journal of Neuroscience 12:4575-4585.  \nDevor M (2006) Sodium channels and mechanisms of neuropathic pain. Journal of Pain 7:S3-\nS12.  \nDib-Hajj SD, Tyrrell L, Black JA, Waxman SG (1998a) NaN, a novel voltage-gated na \nchannel, is expressed preferentially in peripheral sensory neurons and down-regulated after \naxotomy. Proc Natl Acad Sci U S A 95:8963-8968.  \nDib-Hajj SD, Black JA, Cummins TR, Kenney AM, Kocsis JD, Waxman SG (1998b) Rescue \nof alpha-SNS sodium channel expression in small dorsal root ganglion neurons after axotomy \nby nerve growth factor in vivo. J Neurophysiol 79:2668-2676.  \nFekete DM, Wu DK (2002) Revisiting cell fate specification in the inner ear. Curr Opin \nNeurobiol 12:35-42.  \n29 \n \n  \nGordon D, Merrick D, Auld V, Dunn R, Goldin AL, Davidson N, Catterall WA (1987) \nTissue-specific expression of the RI and RII sodium channel subtypes. Proc Natl Acad Sci U \nS A 84:8682-8686.  \nHafidi A (1998) Peripherin-like immunoreactivity in type II spiral ganglion cell body and \nprojections. Brain Res 805:181-190.  \nHolley MC (2005) Keynote review: The auditory system, hearing loss and potential targets \nfor drug development. Drug Discov Today 10:1269-1282.  \nHossain WA, Antic SD, Yang Y, Rasband MN, Morest DK (2005) Where is the spike \ngenerator of the cochlear nerve? voltage-gated sodium channels in the mouse cochlea. \nJournal of Neuroscience 25:6857-6868.  \nKaltenbach JA, Godfrey DA, Neumann JB, McCaslin DL, Afman CE, Zhang J (1998) \nChanges in spontaneous neural activity in the dorsal cochlear nucleus following exposure to \nintense sound: Relation to threshold shift. Hear Res 124:78-84.  \nKrafte DS, Bannon AW (2008) Sodium channels and nociception: Recent concepts and \ntherapeutic opportunities. Current Opinion in Pharmacology 8:50-56.  \nKrzemien DM, Schaller KL, Levinson SR, Caldwell JH (2000) Immunolocalization of \nsodium channel isoform NaCh6 in the nervous system. J Comp Neurol 420:70-83.  \nKuan CY, Tannahill D, Cook GM, Keynes RJ (2004) Somite polarity and segmental \npatterning of the peripheral nervous system. Mech Dev 121:1055-1068.  \nLi HY, Say EH, Zhou XF (2007) Isolation and characterization of neural crest progenitors \nfrom adult dorsal root ganglia. Stem Cells 25:2053-2065.  \n30 \n \n  \nLiberman MC (1982) Single-neuron labeling in the cat auditory nerve. Science 216:1239-\n1241.  \nMoller AR (1997) Similarities between chronic pain and tinnitus. The American Journal of \nOtology 18:577-585.  \nMomin A, Wood JN (2008) Sensory neuron voltage-gated sodium channels as analgesic drug \ntargets. Curr Opin Neurobiol 18:383-388.  \nMou K, Adamson CL, Davis RL (1998) Time-dependence and cell-type specificity of \nsynergistic neurotrophin actions on spiral ganglion neurons. J Comp Neurol 402:129-139.  \nNovakovic SD, Tzoumaka E, McGivern JG, Haraguchi M, Sangameswaran L, Gogas KR, \nEglen RM, Hunter JC (1998) Distribution of the tetrodotoxin-resistant sodium channel PN3 \nin rat sensory neurons in normal and neuropathic conditions. Journal of Neuroscience \n18:2174-2187.  \nPatuzzi RB, Brown DJ, McMahon CM, Halliday AF (2004) Determinants of the spectrum of \nthe neural electrical activity at the round window: Transmitter release and neural \ndepolarisation. Hear Res 190:87-108.  \nRaff T, van der Giet M, Endemann D, Wiederholt T, Paul M (1997) Design and testing of \nbeta-actin primers for RT-PCR that do not co-amplify processed pseudogenes. Biotechniques \n23:456-460.  \nRasband MN, Park EW, Vanderah TW, Lai J, Porreca F, Trimmer JS (2001) Distinct \npotassium channels on pain-sensing neurons. Proc Natl Acad Sci U S A 98:13373-13378.  \n31 \n \n  \nReid MA, Flores-Otero J, Davis RL (2004) Firing patterns of type II spiral ganglion neurons \nin vitro. Journal of Neuroscience 24:733-742.  \nRobertson D, Sellick PM, Patuzzi R (1999) The continuing search for outer hair cell afferents \nin the guinea pig spiral ganglion. Hear Res 136:151-158.  \nRogart RB, Cribbs LL, Muglia LK, Kephart DD, Kaiser MW (1989) Molecular cloning of a \nputative tetrodotoxin-resistant rat heart na+ channel isoform. Proc Natl Acad Sci U S A ; \nProceedings of the National Academy of Sciences of the United States of America 86:8170-\n8174.  \nSamorajski T, Ordy JM, Rady-Reimer P (1968) Lipofuscin pigment accumulation in the \nnervous system of aging mice. Anat Rec 160:555-573.  \nSangameswaran L, Delgado SG, Fish LM, Koch BD, Jakeman LB, Stewart GR, Sze P, \nHunter JC, Eglen RM, Herman RC (1996) Structure and function of a novel voltage-gated, \ntetrodotoxin-resistant sodium channel specific to sensory neurons. J Biol Chem 271:5953-\n5956.  \nSangameswaran L, Fish LM, Koch BD, Rabert DK, Delgado SG, Ilnicka M, Jakeman LB, \nNovakovic S, Wong K, Sze P, Tzoumaka E, Stewart GR, Herman RC, Chan H, Eglen RM, \nHunter JC (1997) A novel tetrodotoxin-sensitive, voltage-gated sodium channel expressed in \nrat and human dorsal root ganglia. J Biol Chem 272:14805-14809.  \nSans A, Bartolami S, Fraysse B (1996) Histopathology of the peripheral vestibular system in \nsmall vestibular schwannomas. Am J Otol 17:326-324.  \nSantos-Sacchi J (1993) Voltage-dependent ionic conductances of type I spiral ganglion cells \nfrom the guinea pig inner ear. Journal of Neuroscience 13:3599-3611.  \n32 \n \n  \nToledo-Aral JJ, Moss BL, He ZJ, Koszowski AG, Whisenand T, Levinson SR, Wolf JJ, \nSilos-Santiago I, Halegoua S, Mandel G (1997) Identification of PN1, a predominant voltage-\ndependent sodium channel expressed principally in peripheral neurons. Proc Natl Acad Sci U \nS A 94:1527-1532.  \nTrimmer JS, Cooperman SS, Agnew WS, Mandel G (1990) Regulation of muscle sodium \nchannel transcripts during development and in response to denervation. Dev Biol 142:360-\n367.  \nTzoumaka E, Tischler AC, Sangameswaran L, Eglen RM, Hunter JC, Novakovic SD (2000) \nDifferential distribution of the tetrodotoxin-sensitive rPN4\/NaCh6\/Scn8a sodium channel in \nthe nervous system. J Neurosci Res 60:37-44.  \nVio MM, Holme RH (2005) Hearing loss and tinnitus: 250 million people and a US$10 \nbillion potential market. Drug Discov Today 10:1263-1265.  \nWestenbroek RE, Merrick DK, Catterall WA (1989) Differential subcellular localization of \nthe RI and RII na+ channel subtypes in central neurons. Neuron 3:695-704.  \nWhitaker WR, Clare JJ, Powell AJ, Chen YH, Faull RL, Emson PC (2000) Distribution of \nvoltage-gated sodium channel alpha-subunit and beta-subunit mRNAs in human hippocampal \nformation, cortex, and cerebellum. J Comp Neurol 422:123-139.  \nWhitaker WRJ, Faull RLM, Waldvogel HJ, Plumpton CJ, Emson PC, Clare JJ (2001) \nComparative distribution of voltage-gated sodium channel proteins in human brain. Mol \nBrain Res 88:37-53.  \n33 \n \n  \nWooltorton JR, Gaboyard S, Hurley KM, Price SD, Garcia JL, Zhong M, Lysakowski A, \nEatock RA (2007) Developmental changes in two voltage-dependent sodium currents in \nutricular hair cells. J Neurophysiol 97:1684-1704.  \n \n Cerebral\nCortex\nβ-actin Nav1.1\nSpiral \nGanglion \nNeurons\nDorsal \nRoot \nGanglion\nA\nB\nC\n+ - + -\nNav1.2 Nav1.3 Nav1.6 Nav1.7 Nav1.8 Nav1.9\n+ - + - + - + - + - + -MM\nFigure 1. NaV mRNA channel expression in adult rat nervous tissues. PCR products were separated by\nelectrophoresis on a 1% agarose gel stained with ethidium bromide. (A) PCR products were detected for Nav1.1,\n1.2, 1.3 and 1.6 in the rat cerebral cortex, with weak bands for NaV1.7 and NaV1.9. (B) PCR products were detected\nfor Nav1.1, 1.6, 1.7, 1.8 and 1.9 in the rat DRG. (C) PCR products were detected for Nav1.1, 1.6 and 1.7 in the rat\nSGN. All tissues were positive for β-actin. M lane, 100bp ladder with brightest band representing 500bp. Expected\nproduct sizes are given in methods section. PCR was performed either in the presence (+) or absence (-) of reverse\ntranscription.\n Figure 2. Distribution of NaV1.7 in rat SGN. Micrographs showing NaV1.7 labelling in the rat SGN using fluorescent \n(A,B) and non-fluorescent (D,E). Both techniques show positive labelling of the neurons although some appear to be \nless intensely stained (arrow) than others (arrowhead). (C) Micrograph showing rat SGN incubated without the \nprimary antibody. (F) Phase contrast micrograph of HRP-DAB labelled SGN incubated without the primary antibody.\nScale bars= 30µm for all images.\nA B C\nFED\n Figure 3. Distribution of NaV1.6 in rat SGN. Micrographs showing NaV1.6 labelling in the rat SGN using fluorescent \n(A,B) and non-fluorescent (D,E) immunocytochemistry. Both techniques show positive labelling of the neurons \nalthough some appear to be less intensely stained (arrow) than others (arrowhead). (C) Micrograph showing rat SGN \nincubated without the primary antibody. (F) Phase contrast micrograph of HRP-DAB labelled SGN incubated without \nthe primary antibody. \nScale bars= 30µm for all images.\nBA C\nFED\n C\nFigure 4. Distribution of NaV1.1 in rat SGN. Micrographs showing NaV1.1 labelling in the rat SGN using non-fluorescent \n(A,B) immunocytochemistry. (A,B) Faint labelling of the SGN cell bodies was observed (arrowhead) while the axons \nwere more intensely labelled (arrow). (C) Phase contrast micrograph showing rat SGN incubated without the primary \nantibody. \nScale bars= 30µm for all images.\nBA\n 0\n5\n10\n15\n20\n25\n30\n35\n40\n4\n0\n6\n0\n8\n0\n1\n0\n0\n1\n2\n0\n1\n4\n0\n1\n6\n0\n1\n8\n0\n2\n0\n0\n2\n2\n0\n2\n4\n0\n2\n6\n0\n2\n8\n0\n3\n0\n0\nCell body area (µm\n2\n)\nF\nre\nq\nu\ne\nn\nc\ny\nFigure 5. Dual labelling of rat SGN with NaV1.7 and \nPeripherin. Micrographs showing peripherin (A) and \nNaV1.7 (B) labelling in the rat SGN. The neurons that are \nlabelled for peripherin appear to have stained weakly \nfor NaV1.7 (arrows point to the position of peripherin \npositive neurons). Frequency histograms showing the \ndistribution of spiral ganglion cell body areas (C) and \nnormalised average fluorescent labelling for NaV1.7 (D), \nwith a scatter plot of neuronal cell body area versus \nfluorescent labelling for NaV1.7 (E), showing that the \nperipherin positive neurons (clear bars\/symbols) have \nsmaller cell body area and label less intensely for NaV1.7 \nthan the peripherin negative neurons (filled \nbars\/symbols). \nScale bars=30μm. Graduated bar on graphs indicates \nfluorescence scale (0=black, 255=white).\nC D\nA B\nE\n0\n50\n100\n150\n200\n250\n0 50 100 150 200 250 300\nCell body area (µm\n2\n)\nA\nv\ne\nra\ng\ne\n f\nlu\no\nre\ns\nc\ne\nn\nc\ne\n (\nu\nn\nit\ns\n)\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\n20\n4\n0\n5\n5\n7\n0\n8\n5\n1\n0\n0\n1\n1\n5\n1\n3\n0\n1\n4\n5\n1\n6\n0\n1\n7\n5\n1\n9\n0\n2\n0\n5\n2\n2\n0\nAverage fluorescence (units)\nF\nre\nq\nu\ne\nn\nc\ny\n (\n%\n)\n 0\n2\n4\n6\n8\n10\n12\n14\n16\n18\n20\n4\n0\n5\n5\n7\n0\n8\n5\n1\n0\n0\n1\n1\n5\n1\n3\n0\n1\n4\n5\n1\n6\n0\n1\n7\n5\n1\n9\n0\n2\n0\n5\n2\n2\n0\nAverage fluorescence (units)\nF\nre\nq\nu\ne\nn\nc\ny\n (\n%\n)\n0\n5\n10\n15\n20\n25\n30\n35\n40\n4\n0\n6\n0\n8\n0\n1\n0\n0\n1\n2\n0\n1\n4\n0\n1\n6\n0\n1\n8\n0\n2\n0\n0\n2\n2\n0\n2\n4\n0\n2\n6\n0\n2\n8\n0\n3\n0\n0\nCell body area (µm\n2\n)\nF\nre\nq\nu\ne\nn\nc\ny\nC\nE\nFigure 6. Dual distribution of NaV1.6 and Peripherin in \nthe rat SGN. Micrographs showing  peripherin (A) and \nNaV1.6 (B) labelling in the rat SGN. The neurons that \nare labelled for peripherin appear to have stained \nweakly for NaV1.6 (arrows point to the position of \nperipherin positive neurons). Frequency histograms \nshowing the distribution of spiral ganglion cell body \nareas (C) and normalised average fluorescent labelling \nfor NaV1.6 (D), with a scatter plot of neuronal cell body \narea versus fluorescent labelling for NaV1.6 (E), \nshowing that the peripherin positive neurons (clear \nbars\/symbols) have smaller cell body area and label \nless intensely for NaV1.6 than the peripherin negative \nneurons (filled bars\/symbols). \nScale bars=30μm. Graduated bar on graphs indicates \nfluorescence scale (0=black, 255=white).\nA B\nD\n0\n50\n100\n150\n200\n250\n0 50 100 150 200 250 300\nCell body area (µm\n2\n)\nA\nv\ne\nra\ng\ne\n f\nlu\no\nre\ns\nc\ne\nn\nc\ne\n (\nu\nn\nit\ns\n)\n"}