{"doi":"10.1016\/j.jastp.2008.06.013","coreId":"69556","oai":"oai:eprints.lancs.ac.uk:26203","identifiers":["oai:eprints.lancs.ac.uk:26203","10.1016\/j.jastp.2008.06.013"],"title":"Probing the high latitude ionosphere from ground-based observations: The state of current knowledge and capabilities during IPY (2007-2009)","authors":["Alfonsi, L.","Kavanagh, A.J.","Amata, E.","Cilliers, P.","Correia, E.","Freeman, M.P.","Kauristie, K.","Liu, R.","Luntama, J-P.","Mitchell, C.N.","Zherebtsov, G.A."],"enrichments":{"references":[{"id":16685839,"title":"2293–2308 2306view of the dynamics of high-latitude convection.","authors":[],"date":"1995","doi":null,"raw":"Greenwald, R.A., Baker, K.B., Dudeney, J.R., Pinnock, M., Jones, T.B., Thomas, E.C., Villain, J.P., Cerisier, J.-C., Senior, C., Hanuise, C., Hunsucker, R.D., Sofko, G., Koehler, J., Nielsen, E., Pellinen, R., Walker, A.D.M., Sato, N., Yamagishi, H., 1995. DARN\/SUPERDARN: a global ARTICLE IN PRESS L. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–2308 2306view of the dynamics of high-latitude convection. Space Science Review 71, 761–796.","cites":null},{"id":1016909,"title":"2293–2308 2307view of the dynamics of high-latitude convection.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":16686277,"title":"A comparative study of imaging and broad-beam riometer measurements: The effect of spatial structure on the frequency dependence of auroral absorption.","authors":[],"date":"1991","doi":null,"raw":"Rosenberg, T.J., Detrick, D.L., Venkatesan, D., van Bavel, G., 1991. A comparative study of imaging and broad-beam riometer measurements: The effect of spatial structure on the frequency dependence of auroral absorption. Journal of Geophysical Research 96, 17793–17803.","cites":null},{"id":1014730,"title":"A decade of the Super Dual Auroral Radar Network (SuperDARN): scientiﬁc achievements, new techniques and future directions.","authors":[],"date":"2007","doi":"10.1007\/s10712-007-9017-8","raw":"Chisham, G., Lester, M., Milan, S.E., Freeman, M.P., Bristow, W.A., Grocott, A., MacWilliams, K.A., Ruohoniemi, J.M., Yeoman, T.K., Dyson, P., Greenwald, R.A., Kikuchi, T., Pinnock, M., Rash, J., Sato, N., Sofko, G., Villain, J.-P., Walker, A.D.M., 2007. A decade of the Super Dual Auroral Radar Network (SuperDARN): scientiﬁc achievements, new techniques and future directions. Surveys in Geophysics 28, 33–109.","cites":null},{"id":1016397,"title":"A phased-array radiowave imager for studies of cosmic noise absorption.","authors":[],"date":"1990","doi":null,"raw":"Detrick, D.L., Rosenberg, T.J., 1990. A phased-array radiowave imager for studies of cosmic noise absorption. Radio Science 25 (4), 325.","cites":null},{"id":1025800,"title":"A three-dimensional time-dependent algorithm for ionospheric imaging using GPS.","authors":[],"date":"2003","doi":null,"raw":"Mitchell, C.N., Spencer, P.S.J., 2003. A three-dimensional time-dependent algorithm for ionospheric imaging using GPS. Annals of Geophysics 46 (4), 687–696.","cites":null},{"id":16686329,"title":"Absorption of cosmic noise in the E-region during electron heating events. A new class of riometer absorption events.","authors":[],"date":"1984","doi":null,"raw":"Stauning, P., 1984. Absorption of cosmic noise in the E-region during electron heating events. A new class of riometer absorption events.","cites":null},{"id":1020529,"title":"Antarctica’s role in understanding long term change in the upper atmosphere.","authors":[],"date":"2001","doi":null,"raw":"Jarvis, M.J., 2001. Antarctica’s role in understanding long term change in the upper atmosphere. Surveys in Geophysics 22, 155–174.","cites":null},{"id":1017477,"title":"Auroral Absorption of HF radio waves in the ionosphere: a review of results from the ﬁrst decade of riometry.","authors":[],"date":"1969","doi":null,"raw":"Hargreaves, J.K., 1969. Auroral Absorption of HF radio waves in the ionosphere: a review of results from the ﬁrst decade of riometry.","cites":null},{"id":16686404,"title":"Calculations of riometer absorption associated with F region plasma structures based on Sondre Stromfjord incoherent scatter radar observations.","authors":[],"date":"1994","doi":null,"raw":"Wang, Z., Rosenberg, T., Stauning, P., Basu, S., Crowley, G., 1994. Calculations of riometer absorption associated with F region plasma structures based on Sondre Stromfjord incoherent scatter radar observations. Radio Science 29 (1), 209–215.","cites":null},{"id":1023173,"title":"Calibration of the TEC derived from GPS measurements and from ionospheric models using the EISCAT data.","authors":[],"date":"2003","doi":null,"raw":"Lilensten, J., Cander, Lj.R., 2003. Calibration of the TEC derived from GPS measurements and from ionospheric models using the EISCAT data. Journal of Atmospheric and Solar-Terrestrial Physics 65, 833–842.","cites":null},{"id":1024414,"title":"Canadian Advanced Digital Ionosonde Users Manual.","authors":[],"date":"1997","doi":null,"raw":"MacDougall, J.W., 1997. Canadian Advanced Digital Ionosonde Users Manual. University of Western Ontario, Scientiﬁc Instrumentation Ltd.","cites":null},{"id":16686316,"title":"Canadian GPS NETWORK for ionosphere monitoring (CANGIM).","authors":[],"date":"2005","doi":null,"raw":"Skone, S., Hoyle, V., 2005. Canadian GPS NETWORK for ionosphere monitoring (CANGIM). GPS Solutions 9, 59–62.","cites":null},{"id":1013280,"title":"Characteristics of night-time absorption spike events.","authors":[],"date":null,"doi":"10.5194\/angeo-24-1887-2006","raw":"Characteristics of night-time absorption spike events. Annales Geophysicae 24, 1887–1904.","cites":null},{"id":1015011,"title":"Characterization of the ionosphere over the South Atlantic Ocean by means of ionospheric tomography using dual frequency GPS signals received on board a research ship. In:","authors":[],"date":"2006","doi":null,"raw":"Cilliers, P.J., Mitchell, C.N., Opperman, B.D.L., 2006. Characterization of the ionosphere over the South Atlantic Ocean by means of ionospheric tomography using dual frequency GPS signals received on board a research ship. In: Proceedings of Specialists’ Meeting RTOMP-IST-056 on ‘‘Characterising the Ionosphere,’’ Organised by the NATO Information Systems Technology (IST) Panel in Conjunction with U.R.S.I., University of Alaska Fairbanks, Alaska, USA, 12–16 June 2006.","cites":null},{"id":16686376,"title":"Comparison of high latitude electron density proﬁles obtained with the GPS radio occultation technique and EISCAT measurements.","authors":[],"date":"2004","doi":null,"raw":"Stolle, C., Jakowski, N., Schlegel, K., Rietveld, M., 2004. Comparison of high latitude electron density proﬁles obtained with the GPS radio occultation technique and EISCAT measurements. Annales Geophysicae 22, 2015–2022.","cites":null},{"id":1017752,"title":"Conjugate and closely-spaced observations of auroral radio absorption—IV. The movement of simple features.","authors":[],"date":"1970","doi":null,"raw":"Hargreaves, J.K., 1970. Conjugate and closely-spaced observations of auroral radio absorption—IV. The movement of simple features.","cites":null},{"id":16686333,"title":"Coupling of IMF BY variations into the polar ionospheres through interplanetary ﬁeld-aligned currents,","authors":[],"date":"1994","doi":null,"raw":"Stauning, P., 1994. Coupling of IMF BY variations into the polar ionospheres through interplanetary ﬁeld-aligned currents, J. Geophysical Research Letters 99, 17,309–17,322.","cites":null},{"id":1019981,"title":"DEMETER satellite observations of lightning-induced electron precipitation. Geophysical Research Letters.","authors":[],"date":"2007","doi":null,"raw":"Inan, U.S., Piddyachiy, D., Peter, W.B., Sauvaud, J.A., Parrot, M., 2007. DEMETER satellite observations of lightning-induced electron precipitation. Geophysical Research Letters.","cites":null},{"id":1028333,"title":"Density gradients at evening ionospheric troughs in the East sector.","authors":[],"date":"2007","doi":null,"raw":"Pirog, O.M., Polekh, N.M., Tashchilin, A.V., Romanova, E.B., 2007. Density gradients at evening ionospheric troughs in the East sector. Proceedings of SPIE V 6936, 346–356 http:\/\/spiedl.org.","cites":null},{"id":16686297,"title":"Dependencies of high-latitude plasma convection: consideration of interplanetary magnetic ﬁeld, seasonal, and universal time factors in statistical patterns.","authors":[],"date":"2005","doi":null,"raw":"Ruohoniemi, J.M., Greenwald, R.A., 2005. Dependencies of high-latitude plasma convection: consideration of interplanetary magnetic ﬁeld, seasonal, and universal time factors in statistical patterns. Journal of Geophysical Research 110, A09204.","cites":null},{"id":16686386,"title":"Determination of the altitudinal peak of Cosmic Noise Absorption using a vertical parallax technique.","authors":[],"date":"2004","doi":null,"raw":"Terkildsen, M.B., Fraser, B.J., Yamagishi, H., 2004. Determination of the altitudinal peak of Cosmic Noise Absorption using a vertical parallax technique. Geophysical Research Letters 31, L07802.","cites":null},{"id":1022397,"title":"Drift of auroral absorption due to the magnetospheric convection observed with the scanning narrow beam riometer during SUNDIAL-86.","authors":[],"date":"1990","doi":null,"raw":"Kikuchi, T., Yamagishi, H., Lester, M.,1990. Drift of auroral absorption due to the magnetospheric convection observed with the scanning narrow beam riometer during SUNDIAL-86. Annales Geophysicae 8 (6), 431–440.","cites":null},{"id":1029344,"title":"Dynamic geomagnetic rigidity cutoff variations during a solar proton event.","authors":[],"date":"2006","doi":"10.1029\/2005JA011395","raw":"Rodger, C.J., Clilverd, M.A., Verronen, P.T., Ulich, T., Jarvis, M.J., Turunen, E., 2006. Dynamic geomagnetic rigidity cutoff variations during a solar proton event. Journal of Geophysical Research 111, A04222.","cites":null},{"id":1016121,"title":"Dynamics of high latitude patches and associated small scale irregularities.","authors":[],"date":"2008","doi":null,"raw":"De Franceschi, G., Alfonsi, L., Romano, V., Aquino, M., Dodson, A., Mitchell, C.N., Wernik, A.W., 2008. Dynamics of high latitude patches and associated small scale irregularities. Journal of Atmospheric and Solar-Terrestrial Physics 70, 879–888.","cites":null},{"id":1027762,"title":"Dynamics of ionospheric disturbances at high latitudes.","authors":[],"date":"1987","doi":null,"raw":"Pirog, O.M., Zherebtsov, G.A., Dolgoarshinnikh, B.G., 1987. Dynamics of ionospheric disturbances at high latitudes. Acta Geodetica et Geophysica Hungarica 22, 87–95.","cites":null},{"id":1026804,"title":"Electric-potential patterns in the northern and southern polar-regions paramaterized by the interplanetary magnetic ﬁeld.","authors":[],"date":"1994","doi":null,"raw":"Papitashvili, V.O., Belov, B.A., Faermark, D.S., Feldstein, Y.I., Golyshev, S.A., Gromova, L.I., Levitin, A.E., 1994. Electric-potential patterns in the northern and southern polar-regions paramaterized by the interplanetary magnetic ﬁeld. Journal of Geophysical Research 99, 13251–13262.","cites":null},{"id":1018606,"title":"Empirical high-latitude electric ﬁeld models.","authors":[],"date":"1987","doi":null,"raw":"Heppner, J.P., Maynard, N.C., 1987. Empirical high-latitude electric ﬁeld models. Journal of Geophysical Research 92, 4467–4489.","cites":null},{"id":1021800,"title":"Energetic electron precipitation during sawtooth injections.","authors":[],"date":"2007","doi":null,"raw":"Kavanagh, A.J., Lu, G., Donovan, E.F., Reeves, G.D., Honary, F., Manninen, J., Immel, T.J., 2007. Energetic electron precipitation during sawtooth injections. Annales Geophysicae 25, 1199–1214.","cites":null},{"id":1019772,"title":"Energy spectra and pitch angle distribution of lightning-induced electron precipitation: analysis of an event observed on the S81-1 (SEEP) satellite.","authors":[],"date":"1989","doi":null,"raw":"Inan, U.S., Walt, M., Voss, H., Imholt, W., 1989. Energy spectra and pitch angle distribution of lightning-induced electron precipitation: analysis of an event observed on the S81-1 (SEEP) satellite. Journal of Geophysical Research 94, 1379–1401.","cites":null},{"id":16686390,"title":"Evidence for long-term cooling of the upper atmosphere in ionosonde data.","authors":[],"date":"1997","doi":null,"raw":"Ulich, Th., Turunen, E., 1997. Evidence for long-term cooling of the upper atmosphere in ionosonde data. Geophysical Research Letters 24, 1103–1106.","cites":null},{"id":1024936,"title":"Extended SuperDARN and IMAGE observations for northward IMF: evidence for dual lobe reconnection,","authors":[],"date":"2008","doi":null,"raw":"Marcucci, M.F., Coco, I., Ambrosino, D., Amata, E., Milan, S.E., Bavassano Cattaneo, M.B., Retino `, A., 2008. Extended SuperDARN and IMAGE observations for northward IMF: evidence for dual lobe reconnection, Journal of Geophysical Research, in press.","cites":null},{"id":16686320,"title":"GPS scintillation in the high arctic associated with an auroral arc.","authors":[],"date":"2008","doi":null,"raw":"Smith, A.M., Mitchell, C.A., Watson, R.J., Meggs, R.W., Kintner, P.M., Kauristie, K., Honary, F., 2008. GPS scintillation in the high arctic associated with an auroral arc. Space Weather 6, S03D01.","cites":null},{"id":1026154,"title":"GPS TEC and scintillation measurements from the polar ionosphere during the October","authors":[],"date":"2005","doi":null,"raw":"Mitchell, C.N., Alfonsi, L., De Franceschi, G., Lester, M., Romano, V., Wernik, A.W., 2005. GPS TEC and scintillation measurements from the polar ionosphere during the October 2003 storm. Geophysical Research Letters 32 (12), L12S03.","cites":null},{"id":16686325,"title":"Ground based identiﬁcation of dispersionless electron injections.","authors":[],"date":"2007","doi":null,"raw":"Spanswick, E., Donovan, E., Friedel, R., Korth, A., 2007. Ground based identiﬁcation of dispersionless electron injections. Geophysical Research Letters 34, L03101.","cites":null},{"id":1020776,"title":"Groundbased studies of ionospheric convection associated with substorm expansion.","authors":[],"date":"1994","doi":null,"raw":"Kamide, Y., Richmond, A.D., Emery, B.A., Hutchins, C.F., Ahn, B.H., de la Beaujardiere, O., Foster, J.C., Heelis, R.A., Kroehl, H.W., Rich, F.J., Slavin, J.A., 1994. Groundbased studies of ionospheric convection associated with substorm expansion. Journal of Geophysical Research 99, 19451–19466.","cites":null},{"id":16686282,"title":"Imaging riometer and HF radar measurements of drifting F region electron density structures in the polar cap.","authors":[],"date":"1993","doi":null,"raw":"Rosenberg, T.J., Wang, Z., Rodger, A.S., Dudeney, J.R., Baker, K.B., 1993. Imaging riometer and HF radar measurements of drifting F region electron density structures in the polar cap. Journal of Geophysical Research 98, 7757–7764.","cites":null},{"id":1024668,"title":"Imaging riometer observations of drifting absorption patches in the morning sector.","authors":[],"date":"2004","doi":null,"raw":"Makarevitch, R.A., Honary, F., McCrea, I.W., Howells, V.S.C., 2004. Imaging riometer observations of drifting absorption patches in the morning sector. Annales Geophysicae 22 (10), 3461–3478.","cites":null},{"id":16686468,"title":"Imaging riometer observations on energetic electron precipitation at SANAE IV,","authors":[],"date":"2002","doi":null,"raw":"Wilson, A., Stoker, P.H., 2002. Imaging riometer observations on energetic electron precipitation at SANAE IV, Antarctica. Journal of Geophysical Research 107 (A10) SMP 2-1–2-10.","cites":null},{"id":1015284,"title":"Improved dynamic geomagnetic rigidity cutoff modeling: testing predictive accuracy.","authors":[],"date":"2007","doi":"10.1029\/2007JA012410","raw":"Clilverd, M.A., Rodger, C.J., Moffat-Grifﬁn, T., Verronen, P.T., 2007. Improved dynamic geomagnetic rigidity cutoff modeling: testing predictive accuracy. Journal of Geophysical Research 112, A08302.","cites":null},{"id":16686311,"title":"Incoherent scatter Faraday rotation measurements on a radar with single linear polarization.","authors":[],"date":"2003","doi":null,"raw":"Shpynev, B.G., 2003. Incoherent scatter Faraday rotation measurements on a radar with single linear polarization. Radio Science 39, RS3001.","cites":null},{"id":1016658,"title":"Interplanetary magnetic ﬁeld and the auroral zones.","authors":[],"date":"1961","doi":null,"raw":"Dungey, J.W., 1961. Interplanetary magnetic ﬁeld and the auroral zones. Physical Review Letters 6, 47.","cites":null},{"id":1013565,"title":"Ionospheric constraints on UHF\/VHF communications links during solar maximum and minimum periods.","authors":[],"date":"1988","doi":"10.1029\/RS023i003p00363","raw":"Basu, S., MacKenzie, E., Basu, S., 1988. Ionospheric constraints on UHF\/VHF communications links during solar maximum and minimum periods. Radio Science 23, 363–378.","cites":null},{"id":1024019,"title":"Ionospheric drift properties and its response the IMF conditions at Zhongshan Station, Antarctica.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":16686460,"title":"Ionospheric irregularities and scintillation.","authors":[],"date":"2003","doi":null,"raw":"Wernik, A.W., Secan, J.A., Fremouw, E.J., 2003. Ionospheric irregularities and scintillation. Advances in Space Research 31 (4), 971–981.","cites":null},{"id":1029540,"title":"Ionospheric observatory development at Mario Zucchelli station.","authors":[],"date":"2004","doi":null,"raw":"Romano, V., Zuccheretti, E., De Franceschi, G., Pezzopane, M., Alfonsi, L., Tutone, G., Doumaz, F., 2004. Ionospheric observatory development at Mario Zucchelli station. INAG Bulletin 65.","cites":null},{"id":16686395,"title":"Ionospheric scintillation monitoring using commercial single frequency C\/A code receivers. In:","authors":[],"date":"1993","doi":null,"raw":"Van Dierendonck, A.J., Klobuchar, J., Hua, Q., 1993. Ionospheric scintillation monitoring using commercial single frequency C\/A code receivers. In: ION GPS-93 Proceedings: Sixth International Technical Meeting of the Satellite Division of the Institute of Navigation, Institute of Navigation, Salt Lake City, UT, pp. 1333–1342.","cites":null},{"id":1014075,"title":"Ionospheric trends in mid-latitudes as a possible indicator of the atmospheric greenhouse effect.","authors":[],"date":null,"doi":"10.1016\/0021-9169(92)90157-G","raw":"Bremer, J.,1992. Ionospheric trends in mid-latitudes as a possible indicator of the atmospheric greenhouse effect. Journal of Atmospheric and Terrestrial Physics 54, 1505–1511.","cites":null},{"id":16686480,"title":"Irkutsk incoherent scatter radar.","authors":[],"date":"2002","doi":null,"raw":"Zherebtsov, G., Zavorin, V., Medvedev, V., Nosov, V., Potekhin, P., Shpynev, B.G., 2002. Irkutsk incoherent scatter radar. Journal of Communications Technology and Electronics 47 (11), 1222–1228.","cites":null},{"id":1015848,"title":"ISACCO: an Italian project to monitor the high latitudes ionosphere by means of GPS receivers, ‘‘Eye on ionosphere’’.","authors":[],"date":"2006","doi":null,"raw":"De Franceschi, G., Alfonsi, L., Romano, V., 2006. ISACCO: an Italian project to monitor the high latitudes ionosphere by means of GPS receivers, ‘‘Eye on ionosphere’’. GPS Solutions, doi:10.1007\/s10291-006-0036-6.","cites":null},{"id":16686287,"title":"Large-scale imaging of high-latitude convection with Super Dual Auroral Radar Network HF radar observations.","authors":[],"date":"1998","doi":null,"raw":"Ruohoniemi, J.M., Baker, K.B., 1998. Large-scale imaging of high-latitude convection with Super Dual Auroral Radar Network HF radar observations. Journal of Geophysical Research 103, 20797–20811.","cites":null},{"id":1012948,"title":"Long term trend in the high latitude ionosphere.","authors":[],"date":"2001","doi":"10.1016\/S1464-1917(01)00003-4","raw":"Alfonsi, L., De Franceschi, G., Perrone, L., 2001. Long term trend in the high latitude ionosphere. Physics and Chemistry of the Earth 26 (5), 303–307.","cites":null},{"id":1013055,"title":"Long term trends of the critical frequency of the F2 layer at northern and southern high latitude regions.","authors":[],"date":"2002","doi":"10.1016\/S1474-7065(02)00043-8","raw":"Alfonsi, L., De Franceschi, G., Perrone, L., Materassi, M., 2002. Long term trends of the critical frequency of the F2 layer at northern and southern high latitude regions. Physics and Chemistry of the Earth 27 (6–8), 607–612.","cites":null},{"id":1022929,"title":"Long-term trends in foF2: a comparison of various methods.","authors":[],"date":"2006","doi":null,"raw":"Lastovicka, J., Mikhailov, A.V., Ulich, Th., Bremer, J., Elias, A.G., Ortiz de Adler, N., Jara, V., Abarca del Rio, R., Foppiano, A.J., Ovalle, E., Danilov, A.D., 2006. Long-term trends in foF2: a comparison of various methods. Journal of Atmospheric and Solar-Terrestrial Physics 68 (17), 1854–1870.","cites":null},{"id":1024307,"title":"Mesoscale ionospheric tomography over Finland.","authors":[],"date":"2007","doi":null,"raw":"Luntama, J.-P., Mitchell, C.N., Spencer, P., 2007. Mesoscale ionospheric tomography over Finland. Fourth European Space Weather Week, 5–9 November 2007, Brussels, Belgium. Available at \/http:\/\/ sidc.oma.be\/esww4\/S.","cites":null},{"id":1015564,"title":"Mesospheric observations with the EISCAT UHF radar during polar cap absorption events: 1. Electron densities and negative ions.","authors":[],"date":"1990","doi":null,"raw":"Collis, P.N., Rietveld, M.T., 1990. Mesospheric observations with the EISCAT UHF radar during polar cap absorption events: 1. Electron densities and negative ions. Annales Geophysicae 8, 809–824.","cites":null},{"id":1029950,"title":"Modeling of the seasonal effects of geomagnetic storms in the Eastern Asia ionosphere.","authors":[],"date":"2006","doi":"10.1029\/2005GI000119","raw":"Romanova, E.B., Tashchilin, A.V., Zherebtsov, G.A., et al., 2006. Modeling of the seasonal effects of geomagnetic storms in the Eastern Asia ionosphere. International Journal of Geomagnetism and Aeronomy 6, GI3003.","cites":null},{"id":16686411,"title":"Models of high-latitude electric potentials derived with a least error ﬁt of spherical harmonic coefﬁcients.","authors":[],"date":"1995","doi":null,"raw":"Weimer, D.R., 1995. Models of high-latitude electric potentials derived with a least error ﬁt of spherical harmonic coefﬁcients. Journal of Geophysical Research 100, 19595–19608.","cites":null},{"id":1018329,"title":"Morning Sector electron precipitation events observed by incoherent scatter radar.","authors":[],"date":"1990","doi":null,"raw":"Hargreaves, J.K., Devlin, T., 1990. Morning Sector electron precipitation events observed by incoherent scatter radar. Journal of Atmospheric and Terrestrial Physics 52, 193–203.","cites":null},{"id":16686307,"title":"NOx enhancements in the middle atmosphere during 2003–2004 polar winter: relative signiﬁcance of solar proton events and the aurora as a source.","authors":[],"date":"2007","doi":null,"raw":"Seppa ¨la ¨, A., Clilverd, M.A., Rodger, C.J., 2007. NOx enhancements in the middle atmosphere during 2003–2004 polar winter: relative signiﬁcance of solar proton events and the aurora as a source. Journal of Geophysical Research 112, D23303.","cites":null},{"id":16686381,"title":"Numerical modeling the highlatitude ionosphere.","authors":[],"date":"2002","doi":null,"raw":"Tashchilin, A.V., Romanova, E.B., 2002. Numerical modeling the highlatitude ionosphere. Proceeding of COSPAR Colloquia Series 14, 315–325.","cites":null},{"id":1019192,"title":"Observations of significant flux closure by dual lobe reconnection.","authors":[],"date":"2007","doi":null,"raw":null,"cites":null},{"id":16685883,"title":"Observations of signiﬁcant ﬂux closure by dual lobe reconnection. Annales Geophysicae 25,1617–1627.","authors":[],"date":"2007","doi":null,"raw":"Imber, S.M., Milan, S.E., Hubert, B., 2007. Observations of signiﬁcant ﬂux closure by dual lobe reconnection. Annales Geophysicae 25,1617–1627.","cites":null},{"id":16686339,"title":"Observations of the unstable plasma in the disturbed polar E-region.","authors":[],"date":"1989","doi":null,"raw":"Stauning, P., Olsen, J.K., 1989. Observations of the unstable plasma in the disturbed polar E-region. Physica Scripta 40, 325–332.","cites":null},{"id":1021537,"title":"On solar protons and polar cap absorption: constraints on an empirical relationship.","authors":[],"date":"2004","doi":null,"raw":"Kavanagh, A.J., Marple, S.R., Honary, F., McCrea, I.W., Senior, A., 2004b. On solar protons and polar cap absorption: constraints on an empirical relationship. Annales Geophysicae 22 (4), 1133–1147.","cites":null},{"id":1028771,"title":"On the detectability of solar X-ray ﬂares using very low frequency sudden phase anomalies.","authors":[],"date":"2006","doi":"10.1016\/j.jastp.2005.11.004","raw":"Raulin, J.-P., Abe Pacini, A., Kaufmann, P., Correia, E., Aparecida, G., Martinez, M., 2006. On the detectability of solar X-ray ﬂares using very low frequency sudden phase anomalies. Journal of Atmospheric and Terrestrial Physics 68, 1029–1035.","cites":null},{"id":1027124,"title":"On the occurrence and spatial extent of electron precipitation induced by oblique nonducted whistler waves.","authors":[],"date":"2004","doi":null,"raw":"Peter, W.B., Inan, U.S., 2004. On the occurrence and spatial extent of electron precipitation induced by oblique nonducted whistler waves. Journal of Geophysical Research 109, A12215.","cites":null},{"id":1022661,"title":"On the role of solar and geomagnetic activity in longterm trends in the atmosphere-ionosphere system.","authors":[],"date":"2005","doi":null,"raw":"Las ˇtovicka, J., 2005. On the role of solar and geomagnetic activity in longterm trends in the atmosphere-ionosphere system. Journal of Atmospheric and Solar-Terrestrial Physics 67, 83–92.","cites":null},{"id":1019485,"title":"Particle precipitation induced by short-duration VLF waves in the magnetosphere.","authors":[],"date":"1982","doi":null,"raw":"Inan, U.S., Bell, T.F., Chang, H.C., 1982. Particle precipitation induced by short-duration VLF waves in the magnetosphere. Journal of Geophysical Research 87, 6243–6264.","cites":null},{"id":1017226,"title":"Performance comparison of cross correlation and ﬁlled aperture imaging riometers.","authors":[],"date":"2003","doi":null,"raw":"Hagfors, T., Grill, M., Honary, F., 2003. Performance comparison of cross correlation and ﬁlled aperture imaging riometers. Radio Science 38 (6), 1109.","cites":null},{"id":1029078,"title":"Polar-cap absorption—observation and theory.","authors":[],"date":"2008","doi":null,"raw":"ARTICLE IN PRESS L. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–2308 2307Reid, G.C., 1974. Polar-cap absorption—observation and theory. Fundamentals of Cosmic Physics 1, 167–202.","cites":null},{"id":1022110,"title":"Preliminary Instructions for Turning on, Setting up, and Initial Testing of IPS-42 Ionosonde.","authors":[],"date":"1981","doi":null,"raw":"Kelly, T., 1981. Preliminary Instructions for Turning on, Setting up, and Initial Testing of IPS-42 Ionosonde. KEL Aerospace Pty. Ltd., Australia.","cites":null},{"id":1023743,"title":"Present and future research program in solar–terrestrial physics at Zhongshan Station,","authors":[],"date":"1998","doi":null,"raw":"Liu, R., 1998. Present and future research program in solar–terrestrial physics at Zhongshan Station, Antarctica. In: Xu, R.L., Lui, A.T.Y. (Eds.), Magnetospheric Research with Advanced Techniques. Elsevier Science, Amsterdam.","cites":null},{"id":1020260,"title":"Relationships between GPS-signal propagation errors and EISCAT observations.","authors":[],"date":null,"doi":null,"raw":"Relationships between GPS-signal propagation errors and EISCAT observations. Annales Geophysicae 14, 1429–1436.","cites":null},{"id":16686464,"title":"Scintillation modelling using in-situ data.","authors":[],"date":"2007","doi":null,"raw":"Wernik, A.W., Alfonsi, L., Materassi, M., 2007. Scintillation modelling using in-situ data. Radio Science 42, RS1002.","cites":null},{"id":1028053,"title":"Seasonal variations of the ionospheric effects of geomagnetic storms at different latitudes of East Asia.","authors":[],"date":"2006","doi":null,"raw":"Pirog, O.M., Polekh, N.M., Zherebtsov, G.A., et al., 2006. Seasonal variations of the ionospheric effects of geomagnetic storms at different latitudes of East Asia. Advances in Space Research 37 (5), 1075–1080.","cites":null},{"id":1022366,"title":"Small scale ionospheric irregularities near regions of soft particle precipitation—scintillation and EISCAT observations.","authors":[],"date":"1988","doi":null,"raw":"Kersley, L., Pryse, S.E., Wheadon, N.S., 1988. Small scale ionospheric irregularities near regions of soft particle precipitation—scintillation and EISCAT observations. Journal of Atmospheric and Terrestrial Physics 50, 1047–1055.","cites":null},{"id":1025241,"title":"Solar ﬂare induced ionospheric Dregion enhancements from VLF phase and amplitude observations.","authors":[],"date":"2004","doi":null,"raw":"McRae, W.M., Thomson, N.R., 2004. Solar ﬂare induced ionospheric Dregion enhancements from VLF phase and amplitude observations. Journal of Atmospheric and Terrestrial Physics 66, 77–87.","cites":null},{"id":1026775,"title":"Solar X-ray ﬂares and ionospheric sudden phase anomalies relationship: a solar cycle phase dependence.","authors":[],"date":"2006","doi":null,"raw":"Pacini, A.A., Raulin, J.-P., 2006. Solar X-ray ﬂares and ionospheric sudden phase anomalies relationship: a solar cycle phase dependence. Journal of Geophysical Research 111, A09301.","cites":null},{"id":16686292,"title":"Statistical patterns of highlatitude convection obtained from Goose Bay HF radar observations.","authors":[],"date":"1996","doi":null,"raw":"Ruohoniemi, J.M., Greenwald, R.A., 1996. Statistical patterns of highlatitude convection obtained from Goose Bay HF radar observations. Journal of Geophysical Research 101, 21743–21763.","cites":null},{"id":16686301,"title":"Statistical relationships between cosmic radio noise absorption and ionospheric electrical conductances in the auroral zone.","authors":[],"date":"2007","doi":null,"raw":"Senior, A., Kavanagh, A.J., Kosch, M.J., Honary, F., 2007. Statistical relationships between cosmic radio noise absorption and ionospheric electrical conductances in the auroral zone. Journal of Geophysical Research 112, A11301.","cites":null},{"id":16686477,"title":"Studies of longitudinal variations of the ionosphere in the Russian Sector.","authors":[],"date":"2001","doi":null,"raw":"Zherebtsov, G.A., Pirog, O.M., 2001. Studies of longitudinal variations of the ionosphere in the Russian Sector. Advances in Space Research 27, 1391–1394.","cites":null},{"id":1021033,"title":"Substorm related changes in precipitation in the dayside auroral zone-a multi instrument case study.","authors":[],"date":"2002","doi":null,"raw":"Kavanagh, A.J., Honary, F., McCrea, I.W., Donovan, E., Woodﬁeld, E.E., Manninen, J., Anderson, P.C., 2002. Substorm related changes in precipitation in the dayside auroral zone-a multi instrument case study. Annales Geophysicae 20, 1321–1334.","cites":null},{"id":1013851,"title":"Temporal signatures of radiation belt electron precipitation induced by lightning-generated MR whistler waves: 1.","authors":[],"date":"2006","doi":"10.1029\/2005JA011398","raw":"Bortnik, J., Inan, U.S., Bell, T.F., 2006. Temporal signatures of radiation belt electron precipitation induced by lightning-generated MR whistler waves: 1. Methodology. Journal of Geophysical Research 111, A02204.","cites":null},{"id":16686398,"title":"The AE-8 Trapped Electron Model Environment.","authors":[],"date":null,"doi":null,"raw":"Vette, J.,1991. The AE-8 Trapped Electron Model Environment. Report 91-24. Natl., Space Sci., Data Cent., Greenbelt, MD.","cites":null},{"id":1018846,"title":"The auroral and ionospheric ﬂow signatures of dual lobe reconnection.","authors":[],"date":"2006","doi":null,"raw":"Imber, S.M., Milan, S.E., Hubert, B., 2006. The auroral and ionospheric ﬂow signatures of dual lobe reconnection. Annales Geophysicae 24, 3115–3129.","cites":null},{"id":1018059,"title":"The eastward movement of the structure of auroral radio absorption events in the morning sector.","authors":[],"date":"1976","doi":null,"raw":"Hargreaves, J.K., Berry, M.G., 1976. The eastward movement of the structure of auroral radio absorption events in the morning sector. Annales Geophysicae 32, 401–406.","cites":null},{"id":1029726,"title":"The electronic Space Weather upper atmosphere (eSWua) project at INGV: advancements and state of the art.","authors":[],"date":"2008","doi":"10.5194\/angeo-26-345-2008","raw":"Romano, V., Pau, S., Pezzopane, M., Zuccheretti, E., Zolesi, B., De Franceschi, G., Locatelli, S., 2008. The electronic Space Weather upper atmosphere (eSWua) project at INGV: advancements and state of the art. Annales Geophysicae 26, 345–351.","cites":null},{"id":1028461,"title":"The empirical connection of riometer absorption to solar protons during PCA events.","authors":[],"date":"1972","doi":"10.1029\/RS007i005p00571","raw":"Potemra, T.A., 1972. The empirical connection of riometer absorption to solar protons during PCA events. Radio Science 7, 571–577.","cites":null},{"id":1026492,"title":"The formation of the D region of the ionosphere.","authors":[],"date":"1960","doi":null,"raw":"Nicolet, M., Aikin, A., 1960. The formation of the D region of the ionosphere. Journal of Geophysical Research 65, 1469–1483.","cites":null},{"id":1014378,"title":"The history, current state and future directions of ionospheric imaging.","authors":[],"date":"2008","doi":"10.1029\/2006RG000212","raw":"Bust, G.S., Mitchell, C.N., 2008. The history, current state and future directions of ionospheric imaging. Reviews of Geophysics 46, RG1003.","cites":null},{"id":16686486,"title":"The ionospheric situation in the Eastern Asian longitudinal sector during the geoactive period October–November","authors":[],"date":"2005","doi":null,"raw":"Zherebtsov, G.A., Pirog, O.M., Polekh, N.M., Ratovskii, K.G., Smirnov, V.F., Stepanov, A.E., Shi, J.K., Wang, X., 2005. The ionospheric situation in the Eastern Asian longitudinal sector during the geoactive period October–November 2003. Geomagnetizm and Aeronomy 45, 101–108.","cites":null},{"id":1023425,"title":"The riometer: a device for the continuous measurements of ionospheric absorption.","authors":[],"date":"1959","doi":null,"raw":"Little, C.G., Leinbach, H., 1959. The riometer: a device for the continuous measurements of ionospheric absorption. Proceedings of IRE 37, 315–320.","cites":null},{"id":1021326,"title":"The statistical dependence of auroral absorption on geomagnetic and solar wind parameters.","authors":[],"date":"2004","doi":null,"raw":"Kavanagh, A.J., Kosch, M., Honary, F., Senior, A., Marple, S.R., Woodﬁeld, E.E., McCrea, I.W., 2004a. The statistical dependence of auroral absorption on geomagnetic and solar wind parameters. Annales Geophysicae 22, 877–887.","cites":null},{"id":1025522,"title":"Total electron content: synthesis of past storm studies and needed future work.","authors":[],"date":"2006","doi":null,"raw":"Mendillo, M., Klobuchar, A., 2006. Total electron content: synthesis of past storm studies and needed future work. Radio Science 41, RS5S02.","cites":null},{"id":1027476,"title":"U.R.S.I. Handbook of Ionogram Interpretation and Reduction, World Data Center A for Solar-Terrestrial Physics.","authors":[],"date":"1972","doi":null,"raw":"Piggott, W.R., Rawer, K., 1972. U.R.S.I. Handbook of Ionogram Interpretation and Reduction, World Data Center A for Solar-Terrestrial Physics. NOAA, Boulder, CO.","cites":null},{"id":16686472,"title":"Variations of the ionosphere F2 layer critical frequency at Zhongshan Station, Antarctica.","authors":[],"date":"2006","doi":null,"raw":"Xu, Z.H., Liu, R.Y., Liu, S.L., et al., 2006. Variations of the ionosphere F2 layer critical frequency at Zhongshan Station, Antarctica. Chinese Journal of Geophysics 49 (1), 1–8.","cites":null},{"id":1018564,"title":"Whistler-induced amplitude perturbation in VLF propagation.","authors":[],"date":"1973","doi":null,"raw":"Helliwell, R.A., Katsufrakis, J.P., Trimpi, M.L., 1973. Whistler-induced amplitude perturbation in VLF propagation. Journal of Geophysical Research 78, 4679–4688.","cites":null},{"id":16686044,"title":"Y.,1999. Ionospheric drift properties and its response the IMF conditions at Zhongshan Station, Antarctica.","authors":[],"date":null,"doi":null,"raw":"Liu, R., Zhu, Y.,1999. Ionospheric drift properties and its response the IMF conditions at Zhongshan Station, Antarctica. Chinese Journal of Geophysics 42 (1), 13–24.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69556.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/26203\/1\/art_935.pdf","pdfHashValue":"71969ef4a866d0acc8ef040e1c78969dd1c5d531","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:26203<\/identifier><datestamp>\n      2018-01-24T02:47:40Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Probing the high latitude ionosphere from ground-based observations: The state of current knowledge and capabilities during IPY (2007-2009)<\/dc:title><dc:creator>\n        Alfonsi, L.<\/dc:creator><dc:creator>\n        Kavanagh, A.J.<\/dc:creator><dc:creator>\n        Amata, E.<\/dc:creator><dc:creator>\n        Cilliers, P.<\/dc:creator><dc:creator>\n        Correia, E.<\/dc:creator><dc:creator>\n        Freeman, M.P.<\/dc:creator><dc:creator>\n        Kauristie, K.<\/dc:creator><dc:creator>\n        Liu, R.<\/dc:creator><dc:creator>\n        Luntama, J-P.<\/dc:creator><dc:creator>\n        Mitchell, C.N.<\/dc:creator><dc:creator>\n        Zherebtsov, G.A.<\/dc:creator><dc:date>\n        2008<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/26203\/1\/art_935.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.jastp.2008.06.013<\/dc:relation><dc:identifier>\n        Alfonsi, L. and Kavanagh, A.J. and Amata, E. and Cilliers, P. and Correia, E. and Freeman, M.P. and Kauristie, K. and Liu, R. and Luntama, J-P. and Mitchell, C.N. and Zherebtsov, G.A. (2008) Probing the high latitude ionosphere from ground-based observations: The state of current knowledge and capabilities during IPY (2007-2009). Journal of Atmospheric and Solar-Terrestrial Physics, 70 (18). pp. 2293-2308. ISSN 1364-6826<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/26203\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.jastp.2008.06.013","http:\/\/eprints.lancs.ac.uk\/26203\/"],"year":2008,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"ARTICLE IN PRESSContents lists available at ScienceDirectJournal of\nAtmospheric and Solar-Terrestrial Physics\nJournal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–23081364-68\ndoi:10.1\n\u0002 Cor\nE-mjournal homepage: www.elsevier.com\/locate\/jastpProbing the high latitude ionosphere from ground-based observations:\nThe state of current knowledge and capabilities during IPY\n(2007–2009)Lucilla Alfonsi a,\u0002, Andrew J. Kavanagh b, Ermanno Amata c, Pierre Cilliers d, Emilia Correia e,f,\nMervyn Freeman g, Kirsti Kauristie h, Ruiyuan Liu i, Juha-Pekka Luntama h,\nCathryn N. Mitchell j, G.A. Zherebtsov k\na Istituto Nazionale di Geofisica e Vulcanologia (INGV), Via di Vigna Murata 605, Rome, Italy\nb Space Plasma Environment and Radio Science Group, Department of Communication Systems, InfoLab 21, Lancaster University, Lancaster LA1 4WA, UK\nc Istituto di Fisica dello Spazio Interplanetario I.N.A.F., Via del fosso del cavaliere 100, 00133 Rome, Italy\nd Hermanus Magnetic Observatory (HMO), P.O. Box 32, Hermanus, South Africa\ne Instituto Nacional de Pesquisas Espaciais (INPE), Sa˜o Jose´ dos Campos, Brazil\nf Centro de Ra´dio Astronomia e Astrofı´sica Mackenzie (CRAAM), Universidade Presbiteriana Mackenzie, Rua da Consolac- a˜o 930, CEP: 01302-907 Sa˜o Paulo, Brazil\ng British Antarctic Survey, High Cross Madingley Road, Cambridge, UK\nh Finnish Meteorological Institute, Erik Palme´nin aukio 1, Helsinki, Finland\ni Polar Research Institute of China, Shanghai 200136, China\nj Department of Electrical Engineering, University of Bath, Bath BA2 7AY, UK\nk Institute of Solar-Terrestrial Physics, Siberian Branch, Russian Academy of Science, Irkutsk, Russiaa r t i c l e i n f o\nArticle history:Accepted 15 June 2008\nDuring the International Polar Year (IPY), one area of great interest is co-coordinated,\nmulti-instrument probing of the ionosphere at high latitudes. This region is important\nAvailable online 2 July 2008\nKeywords:\nPolar ionosphere\nInternational polar year\nConjugacy\nInterhemispheric studies26\/$ - see front matter & 2008 Elsevier Ltd. A\n016\/j.jastp.2008.06.013\nresponding author. Tel.: +3906 51860524; fax\nail address: lucilla.alfonsi@ingv.it (L. Alfonsi).a b s t r a c t\nnot only for the applications that rely upon our understanding of it, but also because it\ncontains the footprints of processes that have their origin in the interplanetary space.\nMany different techniques are now available for probing the ionosphere, from radar\nmeasurements to the analysis of very low frequency (VLF) wave paths. Combining\nthese methods provides the ability to study the ionosphere from high in the F-region to\nthe bottom of the D-layer. Thus, coupling processes from the magnetosphere and to the\nneutral atmosphere can be considered. An additional dimension is through comparisons\nof the response of the two polar ionospheres to similar (or the same) geomagnetic\nactivity. With more instruments available at the South Pole inter-hemispheric, studies\nhave become easier to accomplish such that a fuller picture of the global response to\nSun–Earth coupling can be painted.\nThis paper presents a review of the current state of knowledge in ionospheric\nprobing. It cannot provide a comprehensive guide of the work to date due to the scale of\nthe topic. Rather it is intended to give an overview of the techniques and recent results\nfrom some of the instruments and facilities that are a part of the IPY cluster\n63—Heliosphere Impact on Geospace. In this way it is hoped that the reader will gain a\nflavor of the recent research performed in this area and the potential for continuing\ncollaboration and capabilities during the IPY (2007–2009).\n& 2008 Elsevier Ltd. All rights reserved.ll rights reserved.\n: +39 06 51860397.1. Introduction\nThe International Polar Year (IPY) is a large scientific\nprogramme that unites many disciplines in the study of\nARTICLE IN PRESS\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–23082294the Arctic and Antarctic. Running from March 2007 to\n2009 one of the principal goals is to perform coordinated,\ncontinuous and systematic monitoring of the polar\nregions as a means to understand the natural mechanisms\nthat govern our planet. The IPY is the successor to similar\ninitiatives held in 1882–1883, 1932–1933 and 1957–1958\nwith ambitious numbers: over 200 projects with thou-\nsands of scientists from more than 60 nations dealing\nwith physical, biological and social research proposals.\nThis is facilitated by taking advantage of the development\nof internet technology, which enables the sharing of\nexpertise, data and facilities. Whereas the International\nGeophysical Year (IGY, 1957–1958) focused on monitoring\ngeophysical processes the IPY enlarges the concept to all\nscientific and social disciplines related to the polar\nregions, highlighting the spirit of collaboration and the\nimportant heritage left by the IGY.\nDuring the IGY ionospheric science assumed a promi-\nnent role, leading to the inauguration of several permanent\nobservatories and actively contributing to the collection of\nmeasurements at the World Data Centers (WDCs). Since\nthen ionospheric science has continued to provide inter-\nesting results and applications, and the polar ionosphere\noffers a unique environment for research. At latitudes\npoleward of the auroral oval the geomagnetic field lines\nthat thread the ionosphere connect directly with inter-\nplanetary space (Dungey, 1961). This offers a unique\nlaboratory for studying large-scale plasma processes\nat close quarters. Natural perturbations in the solar–\nterrestrial environment can propagate from high to middle\nlatitudes and may seriously degrade or affect technological\nsystems relying on ionospheric and trans-ionospheric\nradio propagation. The reliability of some of these systems\nis vital for safety-of-life applications. Consequently, upper\natmosphere monitoring from ground-based stations is\nrequired to investigate and model ionospheric variability\nand to subsequently optimise forecasting techniques.\nOne of the core projects of the IPY is ‘‘Heliosphere\nImpact on Geospace’’. This consists of 29 individual\nprogrammes that have been brought together and defined\nas cluster 63 by the IPY Project Office. Interhemispheric\nConjugacy Effects in Solar-Terrestrial and Aeronomy\nResearch (ICESTAR, endorsed and funded by the Scientific\nCommittee on Antarctic Research, SCAR) and International\nHeliophysical Year (IHY) are the two principal pro-\ngrammes that have been identified to lead the cluster\nproviding management responsibilities and serving as the\ncontact point with the central IPY coordination. The\ncountries involved in the project are: Australia, Brazil,\nCanada, China, Finland, Italy, Japan, Malaysia, Norway,\nPoland, Russia, South Africa, Sweden, UK, Ukraine and\nUSA. The cluster has three main themes that reflect the\ndiverse research aims of the individual contributors:\u0002 Coupling processes between the different atmospheric\nlayers and their connection with solar activity.\u0002 Energy and mass exchange between the ionosphere\nand the magnetosphere.\u0002 Inter-hemispheric similarities and asymmetries in\ngeospace phenomena.Each project in the cluster has a set of project-specific\nscientific objectives, but the interrelationships between\nthe studied processes mean there is significant synergy\nbetween the projects. The result is that the cluster is able\nto address topics with far-reaching scientific impact and\nwhich are of import to society at large. For example, a\npractical benefit will be improved prediction of space\nweather phenomena, which adversely affect spacecraft\noperations, humans in space, and satellite-based position-\ning systems; on the scientific side, global-scale coordina-\ntion of observing networks allows us to study conjugate\nand multi-scale geospace phenomena in fundamentally\nnew ways.\nWith the start of the IPY a description of the state of\nknowledge of the polar ionosphere is timely. Here we\nprovide a brief discussion on recent advances in high-\nlatitude ionospheric science and describe the current\ncapabilities for probing the ionosphere present in the\nIPY cluster 63. This covers observing, monitoring, andmodel-\nling the high latitude ionosphere, primarily using ground-\nbased techniques limited to radio wave methods. The list\nof authors reflects those involved in such endeavours\nand does not comprehensively cover all aspects of the\ncontributions to IPY cluster 63 science, which is beyond\nthe scope of this article.\n2. Observations\nThe ionised atmosphere over the auroral and polar\nregions is complex and dynamic. Consequently it takes a\nsynergistic interpretation of a variety of observations and\nexperimental techniques to properly characterise the\nionospheric plasma conditions. The first goal of every\nIPY activity is to enhance the exchange of expertise to\nneighbouring fields. In this section, we provide an over-\nview of the instruments and techniques that are already\ncontributing to a coordinated probing of the ionosphere.\n2.1. Global Navigation Satellite System (GNSS) receivers\nTotal electron content (TEC) is defined as the line\nintegral of the electron concentration along a path from a\nsatellite to a receiver. TEC can be measured using Faraday\nrotation or differential Doppler techniques. Since the\navailability of Global Navigation Satellite System (GNSS)\nsatellites, starting from the early 1990s, phase delay and\npseudo-range measurements from a significant number of\nground stations became available for research. These\nmeasurements furnish TEC evaluation along large num-\nbers of ray-paths. Dual frequency radio signals (L1:\n1.6GHz and L2: 1.2GHz) that propagate through the\nionosphere are subject to a differential phase change due\nto the dispersive nature of the plasma. As a first-order\napproximation the differential phase shift is directly\nproportional to the TEC between the transmitter and\nreceiver.\nThe scientific community can access the data compiled\nby the International GNSS Service (IGS), formerly the\nInternational GPS Service, through the IGS web page\n(http:\/\/igscb.jpl.nasa.gov\/). This is a voluntary consortium\nARTICLE IN PRESS\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–2308 2295of more than 200 worldwide agencies that pool resources\nand data from permanent GPS & GLONASS (Russia’s Global\nNavigation Satellite System) receiver stations. Dense\nnetworks of ground-based GNSS receivers offer the\npotential to retrieve ionospheric electron density and\nTEC maps with unprecedented resolution. The high-\nresolution TEC map over Scandinavia presented in Fig. 1\nshows for the first time mesoscale features of the\nionospheric plasma during a magnetic storm in the\nauroral region. This map was produced by the Finnish\nMeteorological Institute (FMI) and the University of Bath\nwith data from the 86 fiducial GNSS stations in Finland\n(operated by Geotrim Ltd.) using the Multi-Instrument\nData Analysis System (MIDAS, Mitchell and Spencer, 2003)\nalgorithm.\nScintillation of satellite radio signals is caused by\nelectron density irregularities, which distort the wave-\nfront of a signal giving rise to a random amplitude and\nphase modulation of a wave (see Wernik et al., 2003). In\norder to study scintillation, which is highly transient, high\nrate receivers are required to detect and recognize the\nrapid phase and amplitude fluctuations on the GNSS\nsignals. Scintillation measurements can be derived by\nmeans of receivers with a sampling rate up to 50Hz. Such\nsystems have been adopted by several groups for both\nscientific purposes and space weather applications (De\nFranceschi et al., 2006). This twofold utilization arises\nfrom their capacity of providing amplitude and phase\nscintillation indices (S4, sF) in real time, TEC and TEC\nphase (each logged every 15 s) and in providing phase and\namplitude data, either in raw form or detrended, at 50Hz\n(Van Dierendonck et al., 1993). Examples of these\nmeasurements can be found by visiting the electronicFig. 1. High resolution TEC map on 15 December 2007 at 02:00 retrieved with\nin the retrieval are from the 86 station GNSS network in Finland opera\n(1 TECU ¼ 1016 electrons\/m2).space weather upper atmosphere (ESWUA) database:\nwww.eswua.ingv.it (Romano et al., 2008). Such measure-\nments are of crucial interest for testing irregularity and\nscintillation models, such as the one recently developed\nby Wernik et al. (2007).\nScintillation and\/or TEC measurements are currently\nperformed at auroral and polar latitudes of the Northern\nHemisphere at: Ny A˚lesund, Hornsund, Longyearbyen,\nSodankyla¨, Oulu, Tromsø and at different sites over\nCanada (CANGIM network, Skone and Hoyle, 2005); and\nin Antarctica at: Zhongshan Station (China), MZS (Mario\nZucchelli Station, Italy), Sanae IV Station (South Africa),\nAntarctic Research Station ‘‘Comandante Ferraz’’ (Estac- a˜o\nAnta´rtica Comandante Ferraz—EACF, Brazil). Information\non the type of the receivers, on the starting time of\nobservation, on the locations of the stations and on the\nmanaging institutions is reported in Table 1.\nThe Polar Research Institute of China (PRIC) manages\ntwo magnetically conjugate stations: Ny-Alesund (north)\nand Zhongshan (south) (Liu, 1998). They are located under\nthe ionospheric projection of the magnetospheric cusp\nregions at noon and the polar cap regions at midnight, an\nideal conjugate pair for monitoring solar wind–magneto-\nsphere–ionosphere coupling processes.\nTerrestrial dual-frequency GPS observations from the\nSouth African polar research vessel, the SA Agulhas,\nprovides data on ionospheric variability in the South\nAtlantic and near the South Atlantic anomaly during its\nexpeditions from South Africa to Antarctica, Marion Island\nand Gough Island (Cilliers et al., 2006). Data have been\ncollected during all expeditions of the SA Agulhas since\nDecember 2005, and is used in the MIDAS algorithm for\nionospheric tomography.the MIDAS algorithm (Luntama et al., 2007). The GPS observations used\nted by Geotrim Ltd. The color bar shows the TEC values in TECU\nARTICLE IN PRESS\nTable 1\nHigh sampling rate time GNSS receivers at high latitudes\nLocations Coordinates Managing institutions Scintillations\n(S) or TEC\nStarting\ntime–ending time\nReceiver type\nLongyearbyen 78.21N, 15.61E INGV, romano@ingv.it S+TEC 2006– GISTM (Novatel)\nNy A˚lesund 78.11N, 11.91E INGV, romano@ingv.it S+TEC 2003– GISTM (Novatel)\nNy A˚lesund 78.11N, 11.91E Un.Wuhan, ryliu@pric.gov.cn TEC 2004– Leica\nHornsund 77.01N, 15.51E SRC-PAS, aww@cbk.waw.pl S+TEC 2007– GISTM (Novatel)\nHammerfest 70.61N, 23.81E Un. Nottingham,\nMarcio.Aquino@nottingham.ac.uk\nS+TEC 2003–2004 GISTM (Novatel)\nTromsø 69.71N, 19.01E CRIRP, crirp_zwm@163.com S 2004– CJW-1\nTromsø 69.71N, 19.01E Un. Bath, c.n.mitchell@bath.ac.uk S+TEC 2004–2006 GISTM (Novatel)\nKiruna 67.51N, 20.11E Un. Bath, c.n.mitchell@bath.ac.uk S+TEC 2004–2006 Novatel\nSodankyla¨ 67.41N, 26.61E CRIRP, crirp_zwm@163.com S 2004– CJW-1\nSodankyla¨ 67.41N, 26.61E Un. Bath, c.n.mitchell@bath.ac.uk S+TEC 2004–2006 GISTM (Novatel)\nBronnoysund 65.51N, 12.11E Un. Nottingham,\nMarcio.Aquino@nottingham.ac.uk\nS+TEC 2003–2004 GISTM (Novatel)\nOulu 63.91N, 24.51E CRIRP, crirp_zwm@163.com S 2004– CJW-1\nCanada 62.5–51.11N,\n2461E\nUn. Calgary,\nsskone@geomatics.ucalgary.ca\nS+TEC 2003– GISTM (Novatel)\nBergen 60.31N, 5.31E Un. Nottingham,\nMarcio.Aquino@nottingham.ac.uk\nS+TEC 2003–2004 GISTM (Novatel)\nMarion Island 46.91S, 37.91E HMO, pjcilliers@hmo.ac.za S+TEC 2007– GISTM (Novatel)\nEACF 62.11S, 3021E IBGE, ecorreia@craam.mackenzie.br TEC 2004– Trimble+Javad\nGreat Wall 62.21S, 301.01E Un. Wuhan, ryliu@pric.gov.cn TEC 1995– Leica\nZhongshan 69.41S, 76.41E CRIRP S+TEC 2000– CJW-1\nZhongshan 69.41S, 76.41E Un. Wuhan, ryliu@pric.gov.cn TEC 1997– Trimble+Leica\nSANAE IV 71.71S, 357.2.01E HMO, pjcilliers@hmo.ac.za S+TEC 2006– GISTM (Novatel)\nMZS 74.71S, 164.11E INGV, romano@ingv.it S+TEC 2006– GISTM (Novatel)\nDome C 75.01S, 123.01E INGV, romano@ingv.it S+TEC 2008– GISTM (Novatel)\nAcronymns: CRIRP: China Research Institute of Radiowave Propagation, IBGE: Brazilian Institute of Geography and Statistics, HMO: Hermanus Magnetic\nObservatory, INGV: Istituto Nazionale di Geofisica e Vulcanologia, SRC-PAS: Space Research Center—Polish Academy of Science.\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–230822962.2. Vertical and oblique sounding\nVertical sounding with ionosondes (1–20MHz) plays a\ncrucial role in understanding the temporal and spatial\nevolution of the high-latitude ionosphere. The established\nnature of this technique allows the investigation of long-\nterm trends (on decadal scales) that aid in study of the\ncoupling between atmospheric layers. Studies such as this\nwill shed light on the natural and anthropogenic-driven\nvariations of the atmosphere and near-Earth space\n(Lasˇtovicka, 2005). The echoes of the signal reflected by\nthe ionosphere provide a profile of reflection frequency\nversus virtual height (the ionogram), which need to be\ninverted to give the electron density (directly related to\nthe reflection frequency) profile as a function of actual\nheight (Piggott and Rawer, 1972). Correct scaling of the\nreturned data is difficult due to the lack of reliable models\nof the high-latitude ionosphere; several studies have\ncompared different types of ionosonde (Romano et al.,\n2004; Morris et al, 2003), in an effort to improve scaling.\nSeveral different types of ionosondes are in use by various\nscientific communities such as the Digital Portable\nSounder, DPS-4 (Haines and Reinisch, 1995), the KEL42\n(Kelly, 1981), and the CADI (MacDougall, 1997) and a\nnumber of other ionosondes are in operation for IPY in\nboth hemispheres.\nIn 2004, a new digital ionosonde, the AIS-INGV, was\ndesigned by Istituto Nazionale di Geofisica e Vulcanologia\n(INGV, Italy) (Zuccheretti et al., 2003) and deployed in\nAntarctica at MZS, giving encouraging results in terms ofquality of data. A good quality ionogram is obtained by\nusing the phase coherent integration, which improves\nthe signal to noise ratio so that only well-defined echos\nare sketched (Fig. 2). This is of crucial importance when\nthe information derived from the ionograms has to be\nprovided for space weather purposes.\nA DPS-4 was installed at Zhongshan Station during the\naustral summer 1994\/1995. The DPS-4 has been in\noperation since February 1995, taking both ionograms\nand ionospheric drift measurements 8 times per hour.\nIonospheric Prediction Service (IPS) acts as the Australian\nSpace Weather Agency and manages several ionosondes\nlocated in Antarctica at Casey, Scott Base, Davis\nMawson.\nIn the more accessible Arctic, the coverage of iono-\nsondes is, obviously, richer, spanning from Canada, across\nNorthern Europe, to Northern Asia. Institute of Solar-\nTerrestrial Physics, Russian Academy of Science (ISTP RAS)\nmanages a multi-position oblique sounder, with a receiver\nat v.Tory (51.71N, 103.11E) and three transmitters located\nnear Irkutsk (52.91N, 103.31E), Norilsk (691N, 881E) and\nMagadan (601N, 150.71E). ISTP RAS in cooperation with\nInstitute of Cosmophysical Research and Aeronomy (ICRA)\nand Institute of Cosmophysical Research and Radiowave\nPropagation (ICRRP) also manages a network of vertical\nionosondes, which includes 8 sounders located at Norilsk\n(691N, 881E), Tiksi (71.581N, 129.01E), Zhigansk (67.01N,\n123.41E), Yakutsk (62.01N, 129.61E), Irkutsk (52.41N,\n104.31E), Magadan (60 1N, 150.7 1E), Petropavlovlovsk\n(53 1N, 158 1E) and Khabarovsk (48.51N, 135.11E).\nARTICLE IN PRESS\nFig. 2. Example of ionogram from AIS-INGV ionosonde at Mario Zucchelli Station (Antarctica).\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–2308 22972.3. Riometers\nThe relative ionospheric opacity meter (riometer) was\ndevised in the late 1950s by Little and Leinbach (1959) and\nis essentially a sensitive, calibrated radio receiver. The\nriometer monitors the background cosmic radio noise at\nhigh frequencies (usually 20–50MHz) received on the\nground; by comparing the received signal with that for a\ngeomagnetically undisturbed day it is possible to determine\nthe attenuation of the radio waves and hence the cosmic\nradio noise absorption (CNA) at the monitored frequency.\nMost of this absorption occurs in the D-layer of the\nionosphere where the electron-neutral collision frequency\nis high; in the auroral zone CNA is usually caused by the\nprecipitation of electrons with energy in excess of 30keV.\nCNA can also come from higher in the ionosphere from\nother effects such as increases in the E-region temperature,\nwhich raises collision frequency and so absorption (Stauning,\n1984; Stauning and Olsen, 1989). In the polar ionosphere\nwhen convection is strong, heating events may be common\nleading to prolonged enhancements of CNA, possibly related\nto variations in the IMF BY (Stauning, 1994) in the open polar\ncap. Patches of high F-layer electron density such as in the\npolar winter (Rosenberg et al., 1993; Wang et al., 1994) can\nproduce measurable CNA during polar winter (low tem-\nperatures) and at low to mild geomagnetic activity. One\nof the most significant increases in radio absorption is\nproduced by solar proton events that lead to polar cap\nabsorption (Reid, 1974).\nThe first incarnation of the riometer consisted of\na simple dipole antenna that received cosmic radio noise\nin a broad beam (4601); although small spatial-scale\ndetails are lost (Rosenberg et al., 1991) this technique hasproven to be a powerful method for probing the lower\nionosphere. Initial discoveries utilizing this technique\nwere documented by Hargreaves (1969). Narrow beam\nriometers have been used to probe small-scale features\nand the development of the imaging riometer (Detrick and\nRosenberg, 1990) has allowed 2-D spatial maps of the\nlower ionosphere to be produced. The imaging riometer is\na set of receivers that use a phased array of antennas to\nform a number of regularly spaced narrow beams, which\nmeasure CNA in various directions. Depending on the\nantennas and phasing, traditional imaging riometers exist\nwith beam numbers from 16 to 256 though recent\ndevelopment have provided the capability for 716 pencil\nbeams (Hagfors et al., 2003).\nThe Global Riometer Array (GLORIA) is an international\ncollaborative programme involving 14 countries (at the\nlast count) that currently operate over 50 riometers\nincluding 22 imaging systems, spread across both hemi-\nspheres. At the First International Riometer Workshop in\nAmbleside, England (23–27 August 2004), participants in\nGLORIA envisaged that ground-based and other remote-\nsensing techniques will provide the ability to track the\nevolution of the high-energy electron population through\nthe substorm cycle in both space and time. This is of\nparticular importance during IPY\/IHY 2007, since infor-\nmation about the energy of the precipitating electrons\ngenerated during substorms, how these electrons are\naccelerated and the source region of these electrons\nis severely limited. These electrons deposit energy in\nthe D-layer and alter both the chemical reactions and the\ncurrent systems in the ionosphere. Calculations of particle\nenergies based on riometer absorption, and exploiting\nthe high time resolution of the intended global monitoring\nARTICLE IN PRESS\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–23082298of electron precipitation with the GLORIA network will\nprovide important information on coupling processes\nwith the atmosphere.2.4. Incoherent scatter radars\nThe EISCAT incoherent scatter radar (ISR) system\nincludes four antennas in the Fennoscandian mainland\nand two antennas in the Svalbard Archipelago. The\nmainland system includes transmitters both in VHF\n(224MHz) and UHF (930MHz) regimes, while both the\nSvalbard antennas operate in the VHF regime (500MHz).\nISR measurements utilize weak backscatter from iono-\nspheric electrons whose dynamics are controlled by ion\nacoustic waves. Comprehensive analysis of the spectrum\nof the backscattered signal yields estimates for the\naltitude profiles of ionospheric electron density, electron\nand ion temperatures and ion velocity along the antenna\nbeam direction. With the tri-static UHF-system all three\ncomponents of ion velocity can be measured, which\nmakes EISCAT unique compared to the other existing ISR\nsystems.\nAs EISCAT measures the ionospheric conditions in a\nwide altitude range (typically 80–500km) the system can\nsupport both geospace research and atmospheric coupling\nstudies. In polar regions, auroral activity often obscures\nthe signs of forcing that the ionosphere experiences from\nbelow due to tropospheric and mesospheric processes.\nComparison studies of space-based radio wave trans-\nmitter systems and EISCAT have now been conducted at\nleast for 20 years. The role of EISCAT in these investiga-\ntions has typically been to provide auxiliary data for\nvalidating the results of spaced-based observations.\nAmong the first papers addressing this issue was the\nstudy by Kersley et al. (1988) who compared scintillation\nobservations from the Navy Navigation Satellite System\nwith EISCAT observations. They demonstrated a link\nbetween local electron density enhancements and scin-\ntillation events and associated the enhanced densities\nwith ion temperature increases and plasma velocity\nshears. Soft electron precipitation was found to be a\ndriver of the ionospheric conditions favoring scintillation.\nJakowski et al. (1996) made one of the pioneering\nstudies on relationships between GPS-signal propagation\nerrors and features within EISCAT observations. This\nstudy discussed the opportunities to use EISCAT data to\nevaluate the transformation between slant and vertical\nTEC values.\nAt lower latitudes (52.91N, 103.31E) the Irkutsk ISR is a\nmonostatic, pulsed, frequency scan radar unit (Zherebtsov\net al., 2002). The ISR consists of a double-section antenna\nsystem with antenna switch; transmitters; multichannel\nreceiving system; radar control and signal-recording\ndevices. The Irkutsk IS radar differs from similar systems\ndue to its ability to emit and to receive only one linear\nfield polarization. The returned signal fades in accordance\nwith Faraday rotation of the electromagnetic wave\npolarization plane, thus makes it possible to define the\nprofile of electron densities without the need for external\ncalibration (e.g. using ionosondes) (Shpynev, 2003).2.5. SuperDARN network\nThe SuperDARN network comprises of 12 HF radars in\nthe Northern Hemisphere (NH) and 7 radars in the\nSouthern Hemisphere (SH), each consisting of a primary\narray of 16 antennae and an interferometer array of\n4 antennae (Fig. 3; http:\/\/superdarn.jhuapl.edu).\nEach radar is electronically steered into one of\n16 different beam directions covering a fan of 521. The\nradars transmit a short sequence of pulses, referred to as a\nmulti-pulse sequence, and samples the returning echoes.\nThree parameters can then be determined: the back-\nscattered power, spectral width and Doppler velocity of\nthe plasma density irregularities in the ionosphere. In the\nstandard operating mode, for each 3.251 beam 75 spatial\nranges are resolved with a 45km separation (Greenwald\net al., 1995; Chisham et al., 2007). The reconstruction\nof convection patterns using SuperDARN data is based on\nfinding a functional form for the distribution of electro-\nstatic potential in the ionosphere that best fits all the line-\nof-sight velocity measurements available at the time of\ninterest (Ruohoniemi and Baker, 1998).\nAn example of such a reconstruction for the northern\nhemisphere is shown in Fig. 4, where the contours of\nconstant electrostatic potential (solid and dashed lines)\nalso represent flow streamlines and the black segments\nrepresent individual velocity vectors at MLT-MLAT cells\nwhere real SuperDARN measurements are present. Fig. 4\neffectively images the global convection electric field,\nobtaining a result that is analogous to space-based images\nof the global distribution of auroral luminosity. To ensure\nthat the solution is realistic over areas of sparse radar\ncoverage, the velocity data are supplemented with data\nfrom the statistical model by Ruohoniemi and Greenwald\n(1996). The model data are selected according to the IMF\norientation and magnitude at the magnetopause at the\ntime of interest, which in turn are obtained through\nsuitably time-lagged data from spacecraft situated in the\nsolar wind. The model data are weighted in the fitting so\nthat their impact on the solution is minimized. Improve-\nments in the statistical model aspect of the convection\nmapping technique are continually under development\nand the continued expansion of the SuperDARN network\nreduces the reliance of the maps on the model data.\nThe coverage provided by the radars is sometimes\nsufficient to effectively determine the entire global\nconvection pattern, i.e. the solution becomes independent\nof the selection of statistical model data. Global convec-\ntion maps can be generated at the 1- or 2-min resolution\nof the radar scans, which is suitable for observing the\nresponse of ionospheric convection to changes in the solar\nwind and the IMF. Using internet links to many of the\nradars, a near-real-time mapping of the ionospheric\nconvection pattern is now possible for the Northern\nHemisphere and is displayed at the SuperDARN JHU\/APL\nweb site (http:\/\/superdarn.jhuapl.edu\/). With the planned\nextension of the internet links to all of the Southern\nHemisphere SuperDARN network, global convection map-\nping in both hemispheres is likely to become a routine\nSuperDARN data product. Limitations in the ability of the\nsystem to produce reliable convection maps exist due to a\nARTICLE IN PRESS\nFig. 4. Two SuperDARN MLT-MLAT polar plots showing northern hemisphere convection patterns for northward (left panel) and southward (right panel)\nIMF on 2 January 2003, both with By4 0. Magnetic latitude goes from 651 to 901 MLAT, the two inner circles indicating 701 and 801 MLAT.\nFig. 3. Field of view plots of SuperDARN radars: northern hemisphere on the left, southern hemisphere on the right.\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–2308 2299gap in the azimuthal coverage of the Northern Hemi-\nsphere high-latitude ionosphere over Siberia and to two\nsimilar gaps in the Southern Hemisphere coverage.\nHowever, from the end of 2008 the Southern Hemisphere\ngaps should be filled thanks to the installation of two\nradars at Dome C, while preparatory work has begun to fill\nthe Northern Hemisphere gap through the installation of\nfour Russian radars at three different locations in Siberia.\nFinally, three mid-latitude radars (having the larger fields\nof views in the left panel of Fig. 3) have been added to theoriginal radars in the northern hemisphere. Such radars\nare mainly designed to extend the SuperDARN coverage to\nlower latitudes to follow the expansion of the auroral oval\nduring storms and substorms.2.6. Very low frequency (VLF) sounding\nVLF radio waves can be used to study the variations in\nthe lower ionosphere (D-layer). This region is maintained\nARTICLE IN PRESS\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–23082300by the solar Lyman-alpha emission, but is highly disturbed\nby enhancements of X-ray emission during solar flares\n(McRae and Thomson, 2004; Raulin et al., 2006), and also\nby electron precipitation events from the radiation belts\n(Helliwell et al., 1973; Inan et al., 1982; Peter and Inan,\n2004). These disturbances produce changes in the ioniza-\ntion rates, and consequently in the D-region parameters,\nconductivity gradient (b-km\u00031) and reference height\n(H0—km), which govern the refractive index (Wait and\nSpies, 1964). Thus VLF amplitude and phase are sensitive to\nchanges in the electrical conductivity of the lower iono-\nsphere, and can be used to probe ionospheric changes. Long\ndata series are necessary to investigate the long-term trends\nof the ionosphere as a function of the solar cycle (McRae\nand Thomson, 2004; Pacini and Raulin, 2006; Raulin et al.,\n2006) and of its variations, which will complement the\nvertical and oblique sounding performed with HF radars.\nVLF sounding is performed with signals at frequencies\nbetween 1 and 50kHz, propagating over long distances inside\nthe Earth–ionosphere waveguide. The most powerful trans-\nmitter stations are the US Navy communication Stations\nat Cutler\/Maine (NAA at 24kHz, 44.651N, 67.31W), Jim\nCreek\/Washington (NLK at 24.8kHz, 48.21N, 121.921W),\nLualualei\/Hawaii (NPM at 21.4kHz, 20.41N, 158.21W),\nLaMoure\/North Dakota (NLM at 25.2kHz, 46.351N,\n98.331W) and Aquada\/Puerto Rico (NAU at 40.75kHz,\n18.41N, 67.181W).\nThe South America VLF Network (SAVNET) has receivers\nlocated at: Piura\/Peru (5.21S, 80.51W), Punta Lobos\/Peru\n(12.51S, 76.81W), Palmas\/Brazil (10.171S, 49.341W), Santa\nMaria\/Brazil (29.721S, 53.721W), CASLEO\/Argentina (31.51S,\n68.51W), Sa˜o Paulo\/Brazil (23.21S, 46.51W) and at the\nBrazilian Antarctic Station, Comandante Ferraz (62.11S,\n58.41W). Other participating Southern hemisphere VLF\nreceivers, administered by the Hermanus Magnetic Obser-\nvatory in cooperation with the University of Kwa-Zulu-Natal\nin South Africa are located on Marion Island (46.881S,\n37.861E) and at SANAE-IV (71.671S, 2.841W) in Antarctica.\n2.7. Multi-instrument studies\nThe above-described instruments are typically used as\ncombined assets in geospace research. Recent satellite\nmissions, e.g. ESA’s Cluster and NASA’s Themis, count on\nsubstantial support from ground-based instrumentation-\nmonitoring ionospheric phenomena simultaneously as the\nspacecraft probe different regions in the magnetotail. This\ncombined diagnostic approach can provide a more power-\nful technique for analysing ionospheric phenomena.\n3. State of current knowledge and capabilities during IPY\n(2007–2009)\n3.1. High-latitude convection patterns\nThe large-scale morphology of ionospheric convection\nin the auroral and polar regions has been studied for many\nyears using low-altitude spacecraft (Heppner and Maynard,\n1987; Weimer, 1995) and ground magnetometers (Kamide\net al., 1994; Papitashvili et al., 1994). More recently,\nSuperDARN convection measurements (Chisham et al., 2007,and references therein) have been used by Ruohoniemi and\nGreenwald (1996, 2005) to provide a complete picture\nof the statistical dependence of high-latitude convection\non the IMF.\nFor a purely southward IMF, two high-latitude convec-\ntion cells are set up in both hemispheres with anti-\nsunward flow in the polar cap and return flow from the\nnight to the dayside at lower latitudes at dusk and dawn.\nThe relative dimensions and orientations of the two cells\ndepends on the magnetic clock angle y, defined as arctang\n(By\/Bz). For y\u00041801 two symmetric cells are observed,\nwhile for y\u0004901 the dusk and dawn cells dominate in the\nnorthern and in the southern hemisphere, respectively,\nand the opposite situation occurs when y\u0004\u0003901. As an\nexample, the right-hand side of Fig. 4 (22.22–22.24UT on\n2 January 2003) shows a dayside northern convection\ndominated by a large and distorted clockwise cell\nextending from dusk over noon MLT to part of the dawn\nquadrant (for Bzo0 and BybjBzj). For strongly northward\nIMF (i.e. for y0E01), reconnection occurs tailward of the\ncusps (lobe reconnection), thus generating two reverse\ncells, typically totally contained in the polar cap, often\naccompanied by two lower-latitude ‘‘viscous’’ cells at dusk\n(clockwise) and at dawn (counter-clockwise) to form a\nfour cell pattern. The reverse cells display a high-latitude\nsunward flow and stir the open field lines within the polar\ncap itself (see the left panel of Fig. 4, where Bz4 0, at\n22.02–22.04UT on 2 January 2003), while a lobe-merging\ngap is located poleward with respect to the open closed\nfield line boundary (OCB). If the IMF keeps pointing\nnorthward, the OCB may move poleward as magnetic flux\nis convected back to the day side.\nThe recent review by Chisham et al. (2007) provides an\noverview of the main scientific achievements obtained by\nthe SuperDARN project (e.g. studies on FTE’s, on gravity\nand planetary waves, on FAC’s, etc.). Here, we will briefly\ndiscuss some very recent findings on dual-lobe reconnec-\ntion, which was not included in that review.\nDual-lobe reconnection consists of the simultaneous\nreconnection of an IMF field line tailward of both the\nnorthern and the southern cusp, forming a newly closed\nfield line on the day side, so that the reverse cells are no\nlonger confined within the polar cap and the merging gap\nlies along the OCB. In such cases, the OCB is forced to\nmove poleward very quickly in both hemispheres. Imber\net al. (2006) first presented substantial evidence for the\noccurrence of dual-lobe reconnection during a period of\nstrongly northward IMF; they identified two bursts of\nsunward plasma flow across the noon portion of the OCB,\nindicating magnetic flux closure at the dayside. They also\nestimated that, in order for dual reconnection to occur, the\ninterplanetary magnetic field clock angle must be within\n101 of the z-GSM-axis and that 2.5\u00051030 solar wind\nprotons were captured by the flux closure process,\nsufficient to populate the cold, dense plasma sheet\nobserved following the dual-lobe reconnection interval.\nThe same authors further pursued this topic in a second\npaper (Imber et al., 2007), while Marcucci et al. (2008)\npresented a detailed case study of SuperDARN, Cluster,\nDMSP and IMAGE FUV data for a period when the IMF\nwas predominately northward with the By component\nARTICLE IN PRESS\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–2308 2301changing from positive to slightly negative and showed\nthat, during 2h, four poleward movements of the OCB\n(associated with enhanced sunward\/westward flows\ncrossing the OCB itself) should be interpreted as the\nresult of lobe flux re-closure occurring sporadically in the\ndusk sector. Moreover, for at least one such poleward\nmovement, they noticed its coincidence with Cluster in\nsitu observation of dual-lobe reconnection.\nIt is reasonable to assume that work on these topics\nwill proceed during the IHY, taking advantage of the\nsteadily increasing availability of SuperDARN data from\nboth hemispheres. SuperDARN data provides two impor-\ntant space weather products: the high-latitude iono-\nspheric convection pattern and the associated cross\npolar cap electric potential (CPCP) both in the northern\nand in the southern hemispheres. The study of interhemi-\nspheric effects regarding such products is a typical\nIPY task.\nIonospheric imaging can be used to obtain information\non the temporal and spatial evolution of the electron\ndensity into the ionosphere (Bust and Mitchell, 2008). The\nunderstanding of the dynamics of the ionospheric plasma\nunder perturbed conditions is crucial to comprehend the\nphysical processes ruling the upper atmosphere when a\nstorm occurs. Maps of the large-scale distribution of\nelectron density can provide important information about\nionospheric storm activity and progression. In the case of\nthe famous Halloween storm on 30 October 2003, for\ninstance, this type of reconstruction has shown the\ntransportation of the plasma from North America towards\nNorthern Europe in anti-sunward direction under the\ninfluence of convection flows in the high latitudes and,\nlater, even towards mid latitudes in Europe (De Franceschi\net al., 2008). A multi-instrument approach has allowed\nthe identification of the convection of the plasma from the\ndayside ionosphere over the USA towards the nightside in\nEurope within polar-cap patches associated with GPS\nphase and amplitude scintillation at mid and high\nlatitudes in Europe (Mitchell et al., 2005). A detailed\nstudy of the October and November 2003 storms, carried\nout with the synergistic adoption of ionospheric imaging\n(MIDAS technique), measurements from scintillations and\nTEC GPS receivers and model of electric potential in the\npolar cap (Weimer, 1995), has indicated a ‘‘stagnation’’ of\nplasma in the late UT time of 30 October (De Franceschi\net al., 2008). Another example of the effectiveness of\nthe multi-instrument approach is given in the paper by\nCoco et al. (2007), which demonstrates the potential of\nusing scintillation and TEC observations to determine the\ninformation on the dynamics of the ionospheric irregula-\nrities during the storms derived from the SuperDARN\nreconstructions.\nModern ionosondes complement measurements from\nHF and IS radars by performing observations of the\nionospheric drift, as in the case of the DPS-4 at Zhongshan\nStation. A statistical analysis on the observations made\nsince 1995 has shown that ionospheric motion at cusp\nlatitudes are mainly horizontal, in an average diurnal\nvariation in good agreement with patterns from convec-\ntion. Data analysis shows that the convection pattern is\nlargely controlled by the azimuthal component of IMFByo0, the horizontal velocities at 00MLT incline to the\nwest and the entrance points towards the south are\nlocated between 7 and 8MLT. When By40, the horizontal\nvelocities at 00MLT incline to the east and the entrance\npoints are located between 9 and 10MLT. The convection\npatterns in the southern hemisphere mirror those in the\nnorthern hemisphere (Liu and Zhu, 1999).3.2. Electron density changes\nDuring the IGY (1957–1958) a number of permanent\nionospheric observatories were set up across theWorld. At\nthat time their role was crucial for planning HF radio links,\nespecially for military use; but the increased capability in\nionospheric sounding led to new discoveries in the nature\nof the plasma environment at high latitudes. Since then\nmore than five solar cycles worth of data have been\ncollected providing a valuable historical data set. This has\nproved useful in studies of atmospheric changes; for\nexample, Ulich and Turunen (1997) used data from the\nSodankyla¨ ionosonde that suggested that the peak height\nof the local F2 layer decreased over a 39-year period. This\nwould be consistent with model predictions (Bremer,\n1992) of cooling of the lower thermosphere. More recently\nlong series of historical data were analysed to investigate\neventual trends in the long-term behaviour of the iono-\nspheric electron density (Lastovicka et al., 2006) showing\nthe sensitivity on the correction for solar activity. Since\nthe auroral and polar ionosphere display complex varia-\ntions the task of determining trends is particularly\ndifficult at high latitudes. Studies in the southern hemi-\nsphere have also demonstrated a negative trend possibly\nindicative of thermospheric cooling (Alfonsi et al., 2001,\n2002; Jarvis, 2001).\nA statistical analysis of the monthly medians from\n1995 to 2004 of the DPS-4 ionospheric sounder at\nZhongshan Station (Antarctica) has revealed obvious\ndiurnal and annual variations (Xu et al., 2006 and\nreferences therein; Fig. 5). There is a ‘‘magnetic noon\nanomaly’’ that fades at winter time and a semi-annual\nanomaly during solar maximum years. During the sum-\nmer months, close to solar maximum vibrationally excited\nmolecular nitrogen (N2*) has a significant effect on the\nionosphere. It increases the loss rate of the dominant ion\nO+, thereby reducing the electron concentration in the\nF region. At solar minimum the role played by by N2* is\nmuch more limited.\nAn important feature in the ionosphere is the main\nionospheric trough (MIT), which is the natural boundary\nbetween the mid-latitude and auroral ionosphere. Analysis\nof data from a meridian chain of ionosondes (901E) taken\nover the winter of 1982–1983 revealed important features\nof the dynamics of the MIT. Pirog et al. (1987) and\nZherebtsov and Pirog (2001) performed a statistical analysis\nof anomalous and regular phenomena characteristic of\nsubauroral and auroral latitudes. These investigations\ncharted the development of ionospheric storms in a local\ntime (LT)—Kp coordinate system and showed that the type\nof ionospheric disturbance poleward of the MIT depended\non the station latitude, LT and level of geomagnetic activity.\nARTICLE IN PRESS\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–23082302Comparing these results with more recent data suggests\nthat the large-scale structure of the ionosphere, including\nthe MIT moves towards mid-latitudes (Pirog et al., 2006;\nZherebtsov et al., 2005).\nDuring the afternoon, abrupt decreases of ionization in\nthe F2-layer, known as the daytime trough, occur\n(Mendillo and Klobuchar, 2006). Studies using data from\nstations in Siberia and China have revealed that the\nafternoon trough is mainly observed at equinox and at\nmid-high-latitudes (L43) during the recovery phase of\nstorms (Pirog et al., 2007). Recent calculations of electron\ndensity variations during afternoon troughs have been\ncarried out to define a preliminary model. The model is\nbased upon the numerical solution of a system of non-\nstationary equations that describe the balance of particles\nand thermal plasma energy within magnetic field tubes\nwith base at 100km altitude (Tashchilin and Romanova,\n2002; Romanova, et al., 2006). Model calculations of\nelectron density variations with evening observations of\ngradients in ionization support the assumption that the\nnarrow and deep trough in the afternoon sector is formed by\nthe belt of westward ionospheric drift with high velocities.\nCombining techniques can provide greater insight into\nthe ionospheric processes that occur in the Polar Regions.\nLilensten and Cander (2003) have calibrated GPS-based\nTEC estimates with EISCAT observations and statisticalFig. 5. Mean properties of high-latitude ionosphionosphere models and Stolle et al. (2004) used EISCAT\ndata to evaluate electron density profiles as deduced with\nGPS radio occultation technique.\nIonospheric irregularities are usually confined into\nregions of enhanced electron concentration and their\nmorphology can be effectively reconstructed with the use\nof observations from ionosondes, SuperDARN, EISCAT\nsupported by models and imaging techniques. Since\nscintillation is directly related to the formation and\ntransport of irregularities in the ionosphere, they can\nprovide information on the variation of electron density.\nTypical scales of such irregularities are, at L band\nfrequencies, of the order of hundreds of meters to\nkilometres and are common in the polar, auroral and\nequatorial ionosphere (see Wernik et al., 2003). At high-\nlatitude the peak of scintillation often coincidence with\nsevere TEC gradients as produced by the gradient drift\ninstability, as recently demonstrated by high sample\nfrequency receivers in the Arctic (Mitchell et al., 2005).\nElectron precipitation can also be responsible for scintilla-\ntion on the satellite signals received at the ground (Smith\net al., 2008). In this frame, the simultaneous measurement\nof TEC and scintillation contribute to the general monitor-\ning of electron density changes in the F-region.\nIn the absence of daylight, the D-layer (o90km\naltitude) disappears during geomagnetically quiet periods.ere variation of foF2 at Zhongshan Station.\nARTICLE IN PRESS\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–2308 2303During substorm events energetic electrons are injected\ninto the inner magnetosphere, these then drift eastward\nunder gradient-curvature drift and are precipitated by\npitch angle scattering. This increased ionization is fre-\nquently seen in a longitudinal belt between 601 and 701\ngeomagnetic latitude at any time, with a maximum\noccurrence between 8 and 10MLT (Kavanagh et al.,\n2004a and references therein). Statistical studies of the\noccurrence of CNA show that it relies on IMF and solar\nwind conditions.\nOn the nightside electron density enhancements in the\nlower ionosphere are directly linked to substorm activity\nand certain features can be used as a footprint of the\nregion of the electron injection region (Spanswick et al.,\n2007). Routine monitoring of this process will aid in\ndiagnosing the underlying processes of the substorm. The\nrelationship between CNA and auroral displays has been\nlong established (Hargreaves, 1970) and work continues to\ntry and understand the strong absorption spikes that\noccur at substorm onset (Aminaei et al., 2006). Typically,\nsubstorm expansions comprise multiple intensifications\nof aurora, producing westward traveling surges (WTS),\nwhich in fact are successive surges that form progressively\nfurther to the west. These events have been observed at\nSANAE IV (Wilson and Stoker, 2002), and more detailed\nstudies of the morphology and altitude dependence of\nthese events are planned for the next several years.\nAlthough imaging riometers only provide 2-D maps of\nCNA, when riometers overlap it is possible to extract\nheight information (Terkildsen et al., 2004). A number of\npairs of stations exist that are capable of this and it is\nintended to determine height profiles for absorption\nfeatures over the IPY period.\nElectron density enhancements in the lower iono-\nsphere are also affected by the prevailing local convection\npattern. The apparent motion of absorption is not wholly\nconsistent with gradient-curvature drift (Hargreaves and\nBerry, 1976; Hargreaves and Devlin, 1990). Kikuchi et al.\n(1990) linked the motion to the interaction of the hot\ndrifting electrons with a cold plasma cloud moving with\nthe convection speed, the latter acting as the trigger for\nprecipitation. Later observations by Kavanagh et al. (2002)\nand Makarevitch et al. (2004) confirmed that at times the\nCNA moves with the local ionospheric convection as\ndetermined by HF and VHF radars. Thus, local changes in\nD-region density are highly variable and dependent on\nprevailing magnetospheric conditions, which have impli-\ncations for the coupling to the neutral atmosphere. The\noccurrence of absorption can also be used as an indicator\nof changes in conductance in the ionosphere (Senior et al.,\n2007). Thus GLORIA, in connection with other instru-\nments, can be used to study current systems both on a\nglobal and very local scale.\nThe analysis of sudden phase anomalies (SPAs) de-\ntected at VLF signals, which are produced by X-ray\nemission during solar flares, have shown that the low\nD-region does depend on the solar cycle phase. Recent\nresults (McRae and Thomson, 2004; Pacini and Raulin,\n2006, p. 546; Raulin et al., 2006) have shown that the\nD-region is more sensitive during periods of low solar\nactivity, when the ionospheric reference height is about1km higher. This can be seen in Fig. 6, which shows the\nrelation between ionospheric reference height lowering,\nobtained from VLF phase advance, and corresponding\nX-ray flux of the chosen events during maximum and\nminimum periods of solar cycle.\nLong-term VLF soundings can also be used to probe\nLyman-alpha solar emission, especially during quiet solar\nperiods when the D-region below 80km is basically\nformed by this radiation, which ionizes the nitric oxide\n(NO) molecules (Nicolet and Aikin, 1960).\nHigh-energy solar protons driven by large CMEs and\/or\nsolar flares can produce dramatic absorption in the\npolar and auroral zones (Reid, 1974). Termed polar cap\nabsorption (PCA), the MeV energy protons penetrate\nto very low altitudes disrupting HF radar and sounder\ndata and with potential for changing the ion chemistry\nthrough excess production of NOx (Seppa¨la¨ et al., 2007).\nPCA is most intense in daylight where photo-dissociation\nkeeps the electron density high. In darkness, the CNA\ndecreases as electrons attach to neutrals to form negative\nions, thus affecting the chemistry in that region of the\nionosphere. Observations using EISCAT have been useful\nin determining the important chemical species (Collis and\nRietveld, 1990), which seems to be NO3\n\u0003. Another im-\nportant aspect of these events is the blanket coverage.\nAbsorption tends to be uniform over the polar caps and\nwell into the auroral zones. At the edges of the PCA there\nis a drop off in absorption that is linked to the ability\nof energetic protons to penetrate through closed geomag-\nnetic field lines. Although this can be monitored by\npolar-orbiting satellites, they are incapable of looking at\nrapid changes in the cut-off boundary. Chains of riometers\nand imaging riometers provide a method for doing this\non local scales. Potemra (1972) demonstrated that the\nriometer absorption is related to the flux of protons\n410MeV and Kavanagh et al. (2004b) applied this to\nan imaging riometer and demonstrated that solar\nradio emission, though a problem at these times, is not\nsignificant enough to disrupt the reliability of the\nrelationship. Clilverd et al. (2007) and Rodger et al.\n(2006) have used an imaging riometer close to the cut-\noff boundary to test cut-off models and found\ngood agreement. The implementation of an ion\nchemistry model allowed the authors to estimate the\nrelationship between PCA and proton flux during night-\ntime conditions.3.3. Magnetospheric particle transport\nFeatures in the ionosphere are often intrinsically linked\nto processes occurring in the magnetosphere and this is\ntrue of energetic electron precipitation during substorm\nevents. Just as measuring flows in the ionosphere gives\nus insight into magnetospheric convection, measuring\nelectron density changes in the lower ionosphere (e.g.\nD-region) allows us to remote-sense magnetospheric\nparticle dynamics. Using ground-based techniques in\nconjunction with in-situ measurements provide a powerful\nmethod for diagnosing space weather events. Riometers\nand particle flux instruments onboard geostationary\nARTICLE IN PRESS\nFig. 6. Relation between ionospheric reference height lowering (VLF phase advance) and the X-ray events flux for solar maximum (squares) and solar\nminimum (Pacini and Raulin, 2006).\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–23082304satellites form such a pair for monitoring near-Earth\nparticle injections at substorm onsets (Spanswick et al.,\n2007). The study of Kavanagh et al. (2007) uses efficiently\nunified riometer and geostationary particle observations\nto investigate the development of energetic electron\nprecipitation during so-called sawtooth events. Chains\nof riometers in Canada and Northern Europe provided\nobservations of energetic electron precipitation whilst six\nLos Alamos National Laboratory (LANL) satellites provided\nmeasurements, distributed in longitude, of the in-situ\nparticle fluxes at geostationary orbit. Two GOES satellites\nprovided additional information regarding the orientation\nof the magnetic field throughout the sawtooth event;\ndipolarizations of the magnetic field acting as proxies\nfor the signature of particle injections. For several of the\n‘teeth’ the riometers provided simultaneous measurements\nof electron precipitation in the nightside (within the\nfootprint of the injection region) and the dawn–noon\nsector (where gradient-curvature drifting electrons reach\npeak precipitation). This allowed the large-scale morphol-\nogy of the precipitation (both azimuthal and latitudinalmotions) to be compared and contrasted with the well-\nestablished patterns for substorm injections. With this\nwealth of space and ground-based diagnostics Kavanagh\net al. (2007) determined that, although periodic in nature\nand with dispersionless electron injections that covered\nlarge regions of local time, each of the ‘teeth’ in a sawtooth\nevent had precipitation characteristics of ‘standard’ sub-\nstorm injections. Another key finding emerged from the\ncloser spacing of the riometers on the ground than\nthe satellites in orbit. Estimates of the apparent motion\nof absorption in the D-layer (corresponding to motion\nof the precipitating electrons in the magnetosphere)\nshowed an increase in azimuthal drift speed inferred\nfrom the riometer chains, suggestive of energization of\nthe injected particles as they gradient-curvature drift\neastward. Conclusions about the energization of injected\nparticles and about the differences and similarities be-\ntween sawtooth events and standard subtorm injections\nrely heavily on the improved longitudinal coverage that\nthe ground-based and space-based platforms provide\ntogether.\nARTICLE IN PRESS\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–2308 23053.4. Auroral influence on scintillation\nGPS-signal fading events due to ionospheric scintilla-\ntion have tendency to occur at auroral and equatorial\nregions. The occurrence rates at equatorial latitudes show\nclear dependency on the solar cycle being more frequent\naround the solar maximum years (Basu et al., 1988).\nAuroral fading events have been observed especially\nduring geomagnetic storms as well (Mitchell et al.,\n2005). Such periods are typically accompanied by highly\nvariable auroral displays, which complicates the search of\nany correspondence between individual auroral structures\nand scintillation events. Around the time of the scintilla-\ntion event analysed by Smith et al (2008) the local\nAE-index values varied in the range of 1000–3000nT and\nriometer data showed signal absorption at D-layer\naltitudes implying significant amounts of energetic parti-\ncle precipitation. The short but very intensive fading event\nwas observed by three closely located high-frequency\nGPS-receivers. The appearance of the fading in the GPS-\ndata gives the impression of a moving ionospheric\nstructure causing the disturbances. Simultaneous all-sky\ncamera data show an eastward moving auroral structure\nin the GPS signal path area. The velocity estimates from\nGPS and ASC data have best consistency with each other if\nthe altitude of the moving structure is assumed to be\naround 110km. Green auroras typically appear at this\naltitude range, which gives some evidence for a direct link\nbetween the visual auroral structures and GPS fading\nevents. The event of Smith et al. was not detectable in the\nstandard 1-min scintillation index as it lasted only for\nabout 10 s. Due to its high intensity this event was anyhow\nable to cause the GPS receivers to loose lock while trying\nto catch transmission from a low elevation satellite. This\nfinding leads the authors to suggest systematic monitor-\ning of short duration scintillation events with fast-\nsampled receivers at auroral regions. Although missing\none satellite does not harm the GPS navigation perfor-\nmance in nominal conditions the possibly high occurrence\nrates of short duration fadings can be a significant\nnuisance in limited sky-view situations.3.5. Atmosphere–magnetosphere coupling via lightening\nLightning activity during strong thunderstorms is\nknown to launch electromagnetic waves that propagate\nboth in the wave guide between the Earth surface and\nionosphere (spherics) and along geomagnetic field lines\n(whistlers). The waves propagating along the field-aligned\nducts can interact with radiation belt electrons and under\ncertain conditions cause their precipitation into the\natmosphere. The coupling between lightnings, spherics,\nwhistlers and energetic electron precipitation has been\naddressed with models (Inan et al., 1989) but clear\nobservational evidence covering the whole chain from\nthe troposphere to the near-Earth space has been missing\nso far. The study of Inan et al. (2007) uses combined\nobservations from VLF-antennas, a lightning detection\nsystem, and the DEMETER satellite to inspect lightning-\ninduced electron precipitation (LEP). DEMETER carriesadvanced instrumentation (with high sensitivity and time\nresolution) for detecting both electromagnetic waves and\nweak fluxes of energetic electrons simultaneously. Inan\net al. conducted a survey of the DEMETER burst mode data\nfrom the summer 2005, which resulted in a data set of\n\u000420 LEP events. The clearest events together with\nsimultaneous ground-based observations were used to\ntest theoretical models connecting the intensity of\nelectromagnetic waves with the corresponding precipita-\ntion fluxes. The data set contains also first in-situ\nobservations of large and relatively persistent regions of\nenhanced background precipitation, which were gener-\nated and maintained by intensive lightning activity within\na localized thunderstorm region. The model tested by Inan\net al. (Bortnik et al., 2006) uses as inputs the location, time\nand peak current intensity of a lightning and yields as\noutputs the energy and number fluxes of the expected\nelectron precipitation. The characteristics of the trapped\nelectron population in the radiation belt are estimated\nwith the model by Vette (1991). The model predicts the\nLEP burst location to be slightly poleward of the lightning\nlocation, which is consistent with the DEMETER observa-\ntions and with previous observations. Also the time delay\nbetween the onsets of the lightning and the electron burst\n(o1 s) is similar in the model and in the observations. In\nenergy and number fluxes, the model yields some\ndifferences from the observations, but in general, how-\never, both model and measurements show that electrons\nin the range of \u0004100–300keV are the most important\ncontributors in the LEP fluxes. The authors conclude that\nfor future studies to improve the modeled flux estimates\nbetter knowledge about the magnetospheric electron\npopulations would be necessary.4. Expectations for the IPY\nThe IPY encourages a closer contact between different\ncommunities and associated facilities; this provides new\nopportunities to study ionospheric processes at auroral\nand polar latitudes. ICSU and WMO, who are hosting the\nIPY campaign, encourage participants to pay special\nattention to the legacy of their activites. Data during IPY\nmust be carefully collected, freely accessible and ade-\nquately preserved; comprehensive metadata must accom-\npany the data and stored in a reliable archive. Thus, the\nbenefits of the IPY can be shared amongst the commu-\nnities for years to come.\nThe instrument networks that operate in the northern\npolar region have traditionally wider user communities\nthan Antarctic instrumentation. During the IPY the\nICESTAR programme has shifted the focus towards an\ninterhemispheric approach. Differences in underlying\nneutral atmospheres as well as internal magnetic field\ntopology and strength are just some examples of issues\nthat ICESTAR addresses and that are important in geo-\nspace studies. With increasing amounts of versatile\nAntarctic observations it has become clear to the research\ncommunity that complete understanding of the Sun–\nEarth link can be achieved only by inspecting interhemi-\nspheric polar data sets. The Sun–Earth Interactions\nARTICLE IN PRESS\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–23082306segment in the Antarctic Master Directory maintained by\nNASA serves as an important contact point for Antarctic\nobservations and their metadata. When building data\narchives ICESTAR is active over different fronts and\ncollaborates also with other scientific communities. This\nis the case of the cooperation with the IPY POLENET\nproject (www.POLENET.org) in which the huge network of\nGPS receivers managed by POLENET can become of great\ninterest for testing ionospheric imaging over Antarctica.\nAccording to its mission statement the IHY programme\n(http:\/\/ihy2007.org\/) incorporates the drivers of geophy-\nsical change with large-scale heliospherical processes. The\nSTEREO mission is one example of an IHY project that\ndemonstrates the goals of attempting to understand the\nprocesses in our solar system on a system-wide, inter-\nconnected scale. The two satellites of STEREO will, for the\nfirst time, be able to image on global scales the interaction\nof the Earth’s magnetosphere with different solar wind\nstructures, like coronal mass ejections and shock fronts.\nOther IHY activities include the Whole Heliosphere\nInterval campaigns; these last over the whole Carrington\nrotation period and address the 3D structure of the\nheliosphere combining modelling with multiple space-\nbased and ground-based observations including harmo-\nnized data sets from several ionospheric stations.\nBesides the scientific heritage, the ionospheric com-\nmunity can also contribute to the assessment of a series of\napplications addressed to GPS, GLONASS and (in the near\nfuture) GALILEO signal corruption, not only in terms of\nscientific consultancy, but also as an active part of ad hoc\ntask groups working in synergy with private companies\nand industry. The concept of Virtual Observatories, which\nIPY recommends for seamless dissemination of scientific\ndata could be useful also in commercial projects once\nappropriate agreements securing adequate profit for the\ndata providers have been negotiated. Internet-based\nservices distributing near-real-time alerts and other\nrefined data products become gradually more important\nas we approach more active times within the solar cycle.\nInterhemispheric relationships and bi-directional\nthermosphere–ionosphere linkages present new frontiers\nof solar–terrestrial science at high latitudes. This paper\nonly partially and briefly describes the activities and\nbackground of the ICESTAR\/IHY-led Cluster 63 of the IPY,\nthe potential exists to achieve results in terms of special\ncampaigns, interpretation of new results and discussions\namong the different members. The IPY is an opportunity\nto bring many scientific communities together. Much of\nthe work on the ionosphere and related topics, requires a\nmulti-instrument approach that is facilitated by the IPY\nstructure and it has relevance to other areas within the IPY\nportfolio such that multi-disciplinary studies will become\nimportant in this period.Acknowledgements\nL.A. thanks Italian National Program for Antarctic\nResearch (PNRA) and National Research Council (CNR)\nfor supporting the Italian activities at polar latitudes.\nE.C. thanks Brazilian Antarctic Program (PROANTAR\/MMA)and CNPq (Brazilian National Council for Scientific Devel-\nopment and Technology) for supporting the Brazilian\nactivities at polar regions.\nP.C. acknowledges the support of South African\nNational Antarctic Programme (SANAP) for South African\nparticipation in IPY activities in Antarctica and Marion\nIsland and the contributions of Dr. Andrew Collier and\nProf. Pieter Stoker on VLF and riometer observations,\nrespectively.\nC.N.M. thanks the UK EPSRC and STFC.\nReferences\nAlfonsi, L., De Franceschi, G., Perrone, L., 2001. Long term trend in the\nhigh latitude ionosphere. Physics and Chemistry of the Earth 26 (5),\n303–307.\nAlfonsi, L., De Franceschi, G., Perrone, L., Materassi, M., 2002. Long term\ntrends of the critical frequency of the F2 layer at northern and\nsouthern high latitude regions. Physics and Chemistry of the Earth 27\n(6–8), 607–612.\nAminaei, A., Honary, F., Kavanagh, A.J., Spanswick, E., Viljanen, A., 2006.\nCharacteristics of night-time absorption spike events. Annales\nGeophysicae 24, 1887–1904.\nBasu, S., MacKenzie, E., Basu, S., 1988. Ionospheric constraints on\nUHF\/VHF communications links during solar maximum and mini-\nmum periods. Radio Science 23, 363–378.\nBortnik, J., Inan, U.S., Bell, T.F., 2006. Temporal signatures of radiation belt\nelectron precipitation induced by lightning-generated MR whistler\nwaves: 1. Methodology. Journal of Geophysical Research 111, A02204.\nBremer, J., 1992. Ionospheric trends in mid-latitudes as a possible indicator\nof the atmospheric greenhouse effect. Journal of Atmospheric and\nTerrestrial Physics 54, 1505–1511.\nBust, G.S., Mitchell, C.N., 2008. The history, current state and future\ndirections of ionospheric imaging. Reviews of Geophysics 46,\nRG1003.\nChisham, G., Lester, M., Milan, S.E., Freeman, M.P., Bristow, W.A., Grocott,\nA., MacWilliams, K.A., Ruohoniemi, J.M., Yeoman, T.K., Dyson, P.,\nGreenwald, R.A., Kikuchi, T., Pinnock, M., Rash, J., Sato, N., Sofko, G.,\nVillain, J.-P., Walker, A.D.M., 2007. A decade of the Super Dual Auroral\nRadar Network (SuperDARN): scientific achievements, new techni-\nques and future directions. Surveys in Geophysics 28, 33–109.\nCilliers, P.J., Mitchell, C.N., Opperman, B.D.L., 2006. Characterization of\nthe ionosphere over the South Atlantic Ocean by means of iono-\nspheric tomography using dual frequency GPS signals received on\nboard a research ship. In: Proceedings of Specialists’ Meeting RTO-\nMP-IST-056 on ‘‘Characterising the Ionosphere,’’ Organised by the\nNATO Information Systems Technology (IST) Panel in Conjunction\nwith U.R.S.I., University of Alaska Fairbanks, Alaska, USA, 12–16 June\n2006.\nClilverd, M.A., Rodger, C.J., Moffat-Griffin, T., Verronen, P.T.,\n2007. Improved dynamic geomagnetic rigidity cutoff modeling:\ntesting predictive accuracy. Journal of Geophysical Research 112,\nA08302.\nCoco, I., Amata, E., Alfonsi, L., De Franceschi, G., Marcucci, M.F., Romano,\nV., Lester, M., Dyson, P., 2007. Statistical correlations between GPS\nscintillations and SuperDARN HF backscatter. IUGG XXIV General\nAssembly, 2–13 July 2007.\nCollis, P.N., Rietveld, M.T., 1990. Mesospheric observations with the\nEISCAT UHF radar during polar cap absorption events: 1. Electron\ndensities and negative ions. Annales Geophysicae 8, 809–824.\nDe Franceschi, G., Alfonsi, L., Romano, V., 2006. ISACCO: an Italian project\nto monitor the high latitudes ionosphere by means of GPS receivers,\n‘‘Eye on ionosphere’’. GPS Solutions, doi:10.1007\/s10291-006-0036-6.\nDe Franceschi, G., Alfonsi, L., Romano, V., Aquino, M., Dodson, A.,\nMitchell, C.N., Wernik, A.W., 2008. Dynamics of high latitude patches\nand associated small scale irregularities. Journal of Atmospheric and\nSolar-Terrestrial Physics 70, 879–888.\nDetrick, D.L., Rosenberg, T.J., 1990. A phased-array radiowave imager for\nstudies of cosmic noise absorption. Radio Science 25 (4), 325.\nDungey, J.W., 1961. Interplanetary magnetic field and the auroral zones.\nPhysical Review Letters 6, 47.\nGreenwald, R.A., Baker, K.B., Dudeney, J.R., Pinnock, M., Jones, T.B.,\nThomas, E.C., Villain, J.P., Cerisier, J.-C., Senior, C., Hanuise, C.,\nHunsucker, R.D., Sofko, G., Koehler, J., Nielsen, E., Pellinen, R., Walker,\nA.D.M., Sato, N., Yamagishi, H., 1995. DARN\/SUPERDARN: a global\nARTICLE IN PRESS\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–2308 2307view of the dynamics of high-latitude convection. Space Science\nReview 71, 761–796.\nHagfors, T., Grill, M., Honary, F., 2003. Performance comparison of cross\ncorrelation and filled aperture imaging riometers. Radio Science 38\n(6), 1109.\nHaines, D.M., Reinisch, B.W., 1995. Digisonde Portable Sounder System\nManual. University of Massachusetts Lowell Center for Atmospheric\nResearch.\nHargreaves, J.K., 1969. Auroral Absorption of HF radio waves in the\nionosphere: a review of results from the first decade of riometry.\nProceedings of the IEEE 57, 1348–1373.\nHargreaves, J.K., 1970. Conjugate and closely-spaced observations of\nauroral radio absorption—IV. The movement of simple features.\nPlanetary Space Science 18, 1691–1705.\nHargreaves, J.K., Berry, M.G., 1976. The eastward movement of the\nstructure of auroral radio absorption events in the morning sector.\nAnnales Geophysicae 32, 401–406.\nHargreaves, J.K., Devlin, T., 1990. Morning Sector electron precipitation\nevents observed by incoherent scatter radar. Journal of Atmospheric\nand Terrestrial Physics 52, 193–203.\nHelliwell, R.A., Katsufrakis, J.P., Trimpi, M.L., 1973. Whistler-induced\namplitude perturbation in VLF propagation. Journal of Geophysical\nResearch 78, 4679–4688.\nHeppner, J.P., Maynard, N.C., 1987. Empirical high-latitude electric field\nmodels. Journal of Geophysical Research 92, 4467–4489.\nImber, S.M., Milan, S.E., Hubert, B., 2006. The auroral and ionospheric\nflow signatures of dual lobe reconnection. Annales Geophysicae 24,\n3115–3129.\nImber, S.M., Milan, S.E., Hubert, B., 2007. Observations of significant flux\nclosure by dual lobe reconnection. Annales Geophysicae 25, 1617–1627.\nInan, U.S., Bell, T.F., Chang, H.C., 1982. Particle precipitation induced by\nshort-duration VLF waves in the magnetosphere. Journal of Geophy-\nsical Research 87, 6243–6264.\nInan, U.S., Walt, M., Voss, H., Imholt, W., 1989. Energy spectra and pitch\nangle distribution of lightning-induced electron precipitation:\nanalysis of an event observed on the S81-1 (SEEP) satellite. Journal\nof Geophysical Research 94, 1379–1401.\nInan, U.S., Piddyachiy, D., Peter, W.B., Sauvaud, J.A., Parrot, M., 2007.\nDEMETER satellite observations of lightning-induced electron pre-\ncipitation. Geophysical Research Letters.\nJakowski, N., Sardon, E., Engler, E., Jungstand, A., Kla¨hn, D., 1996.\nRelationships between GPS-signal propagation errors and EISCAT\nobservations. Annales Geophysicae 14, 1429–1436.\nJarvis, M.J., 2001. Antarctica’s role in understanding long term change in\nthe upper atmosphere. Surveys in Geophysics 22, 155–174.\nKamide, Y., Richmond, A.D., Emery, B.A., Hutchins, C.F., Ahn, B.H., de la\nBeaujardiere, O., Foster, J.C., Heelis, R.A., Kroehl, H.W., Rich, F.J.,\nSlavin, J.A., 1994. Groundbased studies of ionospheric convection\nassociated with substorm expansion. Journal of Geophysical\nResearch 99, 19451–19466.\nKavanagh, A.J., Honary, F., McCrea, I.W., Donovan, E., Woodfield, E.E.,\nManninen, J., Anderson, P.C., 2002. Substorm related changes in\nprecipitation in the dayside auroral zone-a multi instrument case\nstudy. Annales Geophysicae 20, 1321–1334.\nKavanagh, A.J., Kosch, M., Honary, F., Senior, A., Marple, S.R., Woodfield,\nE.E., McCrea, I.W., 2004a. The statistical dependence of auroral\nabsorption on geomagnetic and solar wind parameters. Annales\nGeophysicae 22, 877–887.\nKavanagh, A.J., Marple, S.R., Honary, F., McCrea, I.W., Senior, A., 2004b. On\nsolar protons and polar cap absorption: constraints on an empirical\nrelationship. Annales Geophysicae 22 (4), 1133–1147.\nKavanagh, A.J., Lu, G., Donovan, E.F., Reeves, G.D., Honary, F., Manninen, J.,\nImmel, T.J., 2007. Energetic electron precipitation during sawtooth\ninjections. Annales Geophysicae 25, 1199–1214.\nKelly, T., 1981. Preliminary Instructions for Turning on, Setting up, and\nInitial Testing of IPS-42 Ionosonde. KEL Aerospace Pty. Ltd., Australia.\nKersley, L., Pryse, S.E., Wheadon, N.S., 1988. Small scale ionospheric\nirregularities near regions of soft particle precipitation—scintillation\nand EISCAT observations. Journal of Atmospheric and Terrestrial\nPhysics 50, 1047–1055.\nKikuchi, T., Yamagishi, H., Lester, M., 1990. Drift of auroral absorption due\nto the magnetospheric convection observed with the scanning\nnarrow beam riometer during SUNDIAL-86. Annales Geophysicae\n8 (6), 431–440.\nLasˇtovicka, J., 2005. On the role of solar and geomagnetic activity in long-\nterm trends in the atmosphere-ionosphere system. Journal of\nAtmospheric and Solar-Terrestrial Physics 67, 83–92.\nLastovicka, J., Mikhailov, A.V., Ulich, Th., Bremer, J., Elias, A.G., Ortiz de\nAdler, N., Jara, V., Abarca del Rio, R., Foppiano, A.J., Ovalle, E., Danilov,A.D., 2006. Long-term trends in foF2: a comparison of various\nmethods. Journal of Atmospheric and Solar-Terrestrial Physics 68\n(17), 1854–1870.\nLilensten, J., Cander, Lj.R., 2003. Calibration of the TEC derived from GPS\nmeasurements and from ionospheric models using the EISCAT data.\nJournal of Atmospheric and Solar-Terrestrial Physics 65, 833–842.\nLittle, C.G., Leinbach, H., 1959. The riometer: a device for the continuous\nmeasurements of ionospheric absorption. Proceedings of IRE 37,\n315–320.\nLiu, R., 1998. Present and future research program in solar–terrestrial\nphysics at Zhongshan Station, Antarctica. In: Xu, R.L., Lui, A.T.Y. (Eds.),\nMagnetospheric Research with Advanced Techniques. Elsevier\nScience, Amsterdam.\nLiu, R., Zhu, Y., 1999. Ionospheric drift properties and its response the IMF\nconditions at Zhongshan Station, Antarctica. Chinese Journal of\nGeophysics 42 (1), 13–24.\nLuntama, J.-P., Mitchell, C.N., Spencer, P., 2007. Mesoscale ionospheric\ntomography over Finland. Fourth European Space Weather Week,\n5–9 November 2007, Brussels, Belgium. Available at \/http:\/\/\nsidc.oma.be\/esww4\/S.\nMacDougall, J.W., 1997. Canadian Advanced Digital Ionosonde Users\nManual. University of Western Ontario, Scientific Instrumentation\nLtd.\nMakarevitch, R.A., Honary, F., McCrea, I.W., Howells, V.S.C., 2004. Imaging\nriometer observations of drifting absorption patches in the morning\nsector. Annales Geophysicae 22 (10), 3461–3478.\nMarcucci, M.F., Coco, I., Ambrosino, D., Amata, E., Milan, S.E., Bavassano\nCattaneo, M.B., Retino`, A., 2008. Extended SuperDARN and IMAGE\nobservations for northward IMF: evidence for dual lobe reconnec-\ntion, Journal of Geophysical Research, in press.\nMcRae, W.M., Thomson, N.R., 2004. Solar flare induced ionospheric D-\nregion enhancements from VLF phase and amplitude observations.\nJournal of Atmospheric and Terrestrial Physics 66, 77–87.\nMendillo, M., Klobuchar, A., 2006. Total electron content: synthesis of\npast storm studies and needed future work. Radio Science 41,\nRS5S02.\nMitchell, C.N., Spencer, P.S.J., 2003. A three-dimensional time-dependent\nalgorithm for ionospheric imaging using GPS. Annals of Geophysics\n46 (4), 687–696.\nMitchell, C.N., Alfonsi, L., De Franceschi, G., Lester, M., Romano, V.,\nWernik, A.W., 2005. GPS TEC and scintillation measurements from\nthe polar ionosphere during the October 2003 storm. Geophysical\nResearch Letters 32 (12), L12S03.\nMorris, R.J., Monselesan, D.P., Hyde, M.R., Breed, A.M., Wilkinson, P.J.,\nParkinson, M.L., 2003. Southern polar cap DPS and CADI ionosonde\nmeasurements: 1. Ionogram comparison. Advances in Space Re-\nsearch 33 (6), 923–929.\nNicolet, M., Aikin, A., 1960. The formation of the D region of the\nionosphere. Journal of Geophysical Research 65, 1469–1483.\nPacini, A.A., Raulin, J.-P., 2006. Solar X-ray flares and ionospheric sudden\nphase anomalies relationship: a solar cycle phase dependence.\nJournal of Geophysical Research 111, A09301.\nPapitashvili, V.O., Belov, B.A., Faermark, D.S., Feldstein, Y.I., Golyshev, S.A.,\nGromova, L.I., Levitin, A.E., 1994. Electric-potential patterns in the\nnorthern and southern polar-regions paramaterized by the inter-\nplanetary magnetic field. Journal of Geophysical Research 99,\n13251–13262.\nPeter, W.B., Inan, U.S., 2004. On the occurrence and spatial extent of\nelectron precipitation induced by oblique nonducted whistler waves.\nJournal of Geophysical Research 109, A12215.\nPiggott, W.R., Rawer, K., 1972. U.R.S.I. Handbook of Ionogram Interpreta-\ntion and Reduction, World Data Center A for Solar-Terrestrial Physics.\nNOAA, Boulder, CO.\nPirog, O.M., Zherebtsov, G.A., Dolgoarshinnikh, B.G., 1987. Dynamics\nof ionospheric disturbances at high latitudes. Acta Geodetica et\nGeophysica Hungarica 22, 87–95.\nPirog, O.M., Polekh, N.M., Zherebtsov, G.A., et al., 2006. Seasonal\nvariations of the ionospheric effects of geomagnetic storms at\ndifferent latitudes of East Asia. Advances in Space Research 37 (5),\n1075–1080.\nPirog, O.M., Polekh, N.M., Tashchilin, A.V., Romanova, E.B., 2007. Density\ngradients at evening ionospheric troughs in the East sector.\nProceedings of SPIE V 6936, 346–356 http:\/\/spiedl.org.\nPotemra, T.A., 1972. The empirical connection of riometer absorption to\nsolar protons during PCA events. Radio Science 7, 571–577.\nRaulin, J.-P., Abe Pacini, A., Kaufmann, P., Correia, E., Aparecida, G.,\nMartinez, M., 2006. On the detectability of solar X-ray flares using\nvery low frequency sudden phase anomalies. Journal of Atmospheric\nand Terrestrial Physics 68, 1029–1035.\nARTICLE IN PRESS\nL. Alfonsi et al. \/ Journal of Atmospheric and Solar-Terrestrial Physics 70 (2008) 2293–23082308Reid, G.C., 1974. Polar-cap absorption—observation and theory. Funda-\nmentals of Cosmic Physics 1, 167–202.\nRodger, C.J., Clilverd, M.A., Verronen, P.T., Ulich, T., Jarvis, M.J., Turunen, E.,\n2006. Dynamic geomagnetic rigidity cutoff variations during a solar\nproton event. Journal of Geophysical Research 111, A04222.\nRomano, V., Zuccheretti, E., De Franceschi, G., Pezzopane, M., Alfonsi, L.,\nTutone, G., Doumaz, F., 2004. Ionospheric observatory development\nat Mario Zucchelli station. INAG Bulletin 65.\nRomano, V., Pau, S., Pezzopane, M., Zuccheretti, E., Zolesi, B., De\nFranceschi, G., Locatelli, S., 2008. The electronic Space Weather\nupper atmosphere (eSWua) project at INGV: advancements and state\nof the art. Annales Geophysicae 26, 345–351.\nRomanova, E.B., Tashchilin, A.V., Zherebtsov, G.A., et al., 2006. Modeling\nof the seasonal effects of geomagnetic storms in the Eastern Asia\nionosphere. International Journal of Geomagnetism and Aeronomy 6,\nGI3003.\nRosenberg, T.J., Detrick, D.L., Venkatesan, D., van Bavel, G., 1991. A\ncomparative study of imaging and broad-beam riometer measure-\nments: The effect of spatial structure on the frequency dependence\nof auroral absorption. Journal of Geophysical Research 96,\n17793–17803.\nRosenberg, T.J., Wang, Z., Rodger, A.S., Dudeney, J.R., Baker, K.B., 1993.\nImaging riometer and HF radar measurements of drifting F region\nelectron density structures in the polar cap. Journal of Geophysical\nResearch 98, 7757–7764.\nRuohoniemi, J.M., Baker, K.B., 1998. Large-scale imaging of high-latitude\nconvection with Super Dual Auroral Radar Network HF radar\nobservations. Journal of Geophysical Research 103, 20797–20811.\nRuohoniemi, J.M., Greenwald, R.A., 1996. Statistical patterns of high-\nlatitude convection obtained from Goose Bay HF radar observations.\nJournal of Geophysical Research 101, 21743–21763.\nRuohoniemi, J.M., Greenwald, R.A., 2005. Dependencies of high-latitude\nplasma convection: consideration of interplanetary magnetic field,\nseasonal, and universal time factors in statistical patterns. Journal of\nGeophysical Research 110, A09204.\nSenior, A., Kavanagh, A.J., Kosch, M.J., Honary, F., 2007. Statistical\nrelationships between cosmic radio noise absorption and iono-\nspheric electrical conductances in the auroral zone. Journal of\nGeophysical Research 112, A11301.\nSeppa¨la¨, A., Clilverd, M.A., Rodger, C.J., 2007. NOx enhancements in the\nmiddle atmosphere during 2003–2004 polar winter: relative\nsignificance of solar proton events and the aurora as a source.\nJournal of Geophysical Research 112, D23303.\nShpynev, B.G., 2003. Incoherent scatter Faraday rotation measurements\non a radar with single linear polarization. Radio Science 39, RS3001.\nSkone, S., Hoyle, V., 2005. Canadian GPS NETWORK for ionosphere\nmonitoring (CANGIM). GPS Solutions 9, 59–62.\nSmith, A.M., Mitchell, C.A., Watson, R.J., Meggs, R.W., Kintner, P.M.,\nKauristie, K., Honary, F., 2008. GPS scintillation in the high arctic\nassociated with an auroral arc. Space Weather 6, S03D01.\nSpanswick, E., Donovan, E., Friedel, R., Korth, A., 2007. Ground based\nidentification of dispersionless electron injections. Geophysical\nResearch Letters 34, L03101.\nStauning, P., 1984. Absorption of cosmic noise in the E-region during\nelectron heating events. A new class of riometer absorption events.\nGeophysical Research Letters 11, 1184–1187.Stauning, P., 1994. Coupling of IMF BY variations into the polar\nionospheres through interplanetary field-aligned currents, J. Geo-\nphysical Research Letters 99, 17,309–17,322.\nStauning, P., Olsen, J.K., 1989. Observations of the unstable plasma in the\ndisturbed polar E-region. Physica Scripta 40, 325–332.\nStolle, C., Jakowski, N., Schlegel, K., Rietveld, M., 2004. Comparison of\nhigh latitude electron density profiles obtained with the GPS radio\noccultation technique and EISCAT measurements. Annales Geophy-\nsicae 22, 2015–2022.\nTashchilin, A.V., Romanova, E.B., 2002. Numerical modeling the high-\nlatitude ionosphere. Proceeding of COSPAR Colloquia Series 14,\n315–325.\nTerkildsen, M.B., Fraser, B.J., Yamagishi, H., 2004. Determination of the\naltitudinal peak of Cosmic Noise Absorption using a vertical parallax\ntechnique. Geophysical Research Letters 31, L07802.\nUlich, Th., Turunen, E., 1997. Evidence for long-term cooling of the upper\natmosphere in ionosonde data. Geophysical Research Letters 24,\n1103–1106.\nVan Dierendonck, A.J., Klobuchar, J., Hua, Q., 1993. Ionospheric scintilla-\ntion monitoring using commercial single frequency C\/A code\nreceivers. In: ION GPS-93 Proceedings: Sixth International Technical\nMeeting of the Satellite Division of the Institute of Navigation,\nInstitute of Navigation, Salt Lake City, UT, pp. 1333–1342.\nVette, J., 1991. The AE-8 Trapped Electron Model Environment. Report 91-\n24. Natl., Space Sci., Data Cent., Greenbelt, MD.\nWait, J.R., Spies, K., 1964. NBS Technical Note, 300.\nWang, Z., Rosenberg, T., Stauning, P., Basu, S., Crowley, G., 1994.\nCalculations of riometer absorption associated with F region plasma\nstructures based on Sondre Stromfjord incoherent scatter radar\nobservations. Radio Science 29 (1), 209–215.\nWeimer, D.R., 1995. Models of high-latitude electric potentials derived\nwith a least error fit of spherical harmonic coefficients. Journal of\nGeophysical Research 100, 19595–19608.\nWernik, A.W., Secan, J.A., Fremouw, E.J., 2003. Ionospheric irregularities\nand scintillation. Advances in Space Research 31 (4), 971–981.\nWernik, A.W., Alfonsi, L., Materassi, M., 2007. Scintillation modelling\nusing in-situ data. Radio Science 42, RS1002.\nWilson, A., Stoker, P.H., 2002. Imaging riometer observations on energetic\nelectron precipitation at SANAE IV, Antarctica. Journal of Geophysical\nResearch 107 (A10) SMP 2-1–2-10.\nXu, Z.H., Liu, R.Y., Liu, S.L., et al., 2006. Variations of the ionosphere F2\nlayer critical frequency at Zhongshan Station, Antarctica. Chinese\nJournal of Geophysics 49 (1), 1–8.\nZherebtsov, G.A., Pirog, O.M., 2001. Studies of longitudinal variations of\nthe ionosphere in the Russian Sector. Advances in Space Research 27,\n1391–1394.\nZherebtsov, G., Zavorin, V., Medvedev, V., Nosov, V., Potekhin, P., Shpynev,\nB.G., 2002. Irkutsk incoherent scatter radar. Journal of Communica-\ntions Technology and Electronics 47 (11), 1222–1228.\nZherebtsov, G.A., Pirog, O.M., Polekh, N.M., Ratovskii, K.G., Smirnov, V.F.,\nStepanov, A.E., Shi, J.K., Wang, X., 2005. The ionospheric situation in the\nEastern Asian longitudinal sector during the geoactive period Octo-\nber–November 2003. Geomagnetizm and Aeronomy 45, 101–108.\nZuccheretti, E., Tutone, G., Sciacca, U., Bianchi, C., Arokiasamy, B.J., 2003.\nThe new AISINGV digital ionosonde. Annals of Geophysics 46 (4),\n647–659.\n"}