{"doi":"10.1080\/09658410508668832","coreId":"195014","oai":"oai:lra.le.ac.uk:2381\/1059","identifiers":["oai:lra.le.ac.uk:2381\/1059","10.1080\/09658410508668832"],"title":"Consciousness Raising Activities in some Lebanese English Language Classrooms: Teacher Perceptions and Learner Engagement","authors":["Svalberg, Agneta Marie-Louise"],"enrichments":{"references":[{"id":44683035,"title":"Action research : principles and practice. (2nd ed) London: Routledge Falmer.","authors":[],"date":"2002","doi":"10.4324\/9780203199961","raw":"McNiff, J. & J. Whitehead, (2002) Action research : principles and practice. (2nd ed) London: Routledge Falmer.","cites":null},{"id":44683024,"title":"An earlier version of this paper was presented at the 7th International Conference of the Association for Language Awareness at the University of Lleida,","authors":[],"date":"2004","doi":null,"raw":"1. An earlier version of this paper was presented at the 7th International Conference of the Association for Language Awareness at the University of Lleida, Spain, 19-21 July, 2004. 2. I am grateful to the University of Leicester for granting me study leave without which the timely completion of this paper would not have been possible. 3. I am indebted to the Lycée National for giving me access to its teachers and students; to the teachers and students for their enthusiastic participation and, especially, to the English Language coordinator, Ms Juheina Yakzan for her very competent and well informed supervision of the implementation face.","cites":null},{"id":44683036,"title":"Consciousness-raising tasks: a learner perspective.","authors":[],"date":"2004","doi":"10.1093\/elt\/58.3.228","raw":"Mohamed, N. (2004) Consciousness-raising tasks: a learner perspective. ELT Journal 58 (3), 228-237.","cites":null},{"id":44683026,"title":"Cultural Mirrors; materials and methods in the EFL classroom.","authors":[],"date":"1999","doi":null,"raw":"Cortazzi, M. & L. Jin, (1999) Cultural Mirrors; materials and methods in the EFL classroom. In Hinkel, E. (ed) (1999) Culture in Second Language Teaching and Learning. Cambridge: Cambridge University Press.","cites":null},{"id":44683033,"title":"Cultures of teaching: voices from Vietnam.","authors":[],"date":"2002","doi":"10.1093\/elt\/56.2.146","raw":"Lewis, M. & F. McCook, (2002) Cultures of teaching: voices from Vietnam. ELT Journal 56 (2), 146-153.","cites":null},{"id":44683025,"title":"Factors in the implementation of task-based teaching in primary schools.","authors":[],"date":"2003","doi":"10.1016\/j.system.2003.03.002","raw":"Carless, D. R. (2003) Factors in the implementation of task-based teaching in primary schools. System 31 (4), 485-500.","cites":null},{"id":44683027,"title":"Integrating Grammar Instruction and Communicative Language Use through Grammar Consciousness-Raising Tasks. TESOL-Quarterly 28\/2:","authors":[],"date":"1994","doi":"10.2307\/3587436","raw":"Fotos, S. (1994) Integrating Grammar Instruction and Communicative Language Use through Grammar Consciousness-Raising Tasks. TESOL-Quarterly 28\/2: 323-49 Gupta, D. (2004) CLT in India: context and methodology come together. ELT Journal 58 (3), 266-269.","cites":null},{"id":44683030,"title":"Output, input enhancement and the noticing hypothesis. Studies in Second Language Acquisition.","authors":[],"date":"2002","doi":"10.1017\/s0272263102004023","raw":"Izumi, S. 2002. Output, input enhancement and the noticing hypothesis. Studies in Second Language Acquisition.","cites":null},{"id":44683039,"title":"Processing Instruction: Prior Awareness and the Nature of Second Language Acquisition: A (Partial) Response to Batstone.","authors":[],"date":"2004","doi":"10.1080\/09658410208667059","raw":"Van Patten, B. (2004) Processing Instruction: Prior Awareness and the Nature of Second Language Acquisition: A (Partial) Response to Batstone. Language Awareness 11 (4), 240-258.","cites":null},{"id":44683037,"title":"Research Methods in Language Teaching. Cambridge:","authors":[],"date":"1992","doi":"10.1017\/s0272263100012924","raw":"Nunan, D. (1992) Research Methods in Language Teaching. Cambridge: Cambridge University Press.","cites":null},{"id":44683029,"title":"Small Cultures.","authors":[],"date":"1999","doi":"10.1093\/applin\/20.2.237","raw":"Holliday, A. (1999) Small Cultures. Applied Linguistics 20 (2), 237-264.","cites":null},{"id":44683031,"title":"Standards, codification and sociolinguistic realism: the English Language in the Outer Circle. In","authors":[],"date":"1985","doi":null,"raw":"Kachru, B. (1985) Standards, codification and sociolinguistic realism: the English Language in the Outer Circle. In Quirk, R. & H. G. Widdowson, (eds) English in the World. Cambridge: Cambridge University Press Karavas-Doukas, E. (1995) Teacher identified factors affecting the implementation of an EFL innovation in Greek public sector schools. Language, Culture and Curriculum 8 (1), 53-68.","cites":null},{"id":44683028,"title":"Teaching and Learning in the Language Classroom.","authors":[],"date":"2000","doi":"10.1093\/elt\/56.3.337","raw":"Hedge, T. (2000) Teaching and Learning in the Language Classroom. Oxford: Oxford University Press.","cites":null},{"id":44683032,"title":"The Effects of Mode, Pausing, and Topic Familiarity on L2 Learners' Comprehension and Input Processing. Unpublished PhD Thesis,","authors":[],"date":"2003","doi":null,"raw":"Leeser, M. J. (2003) The Effects of Mode, Pausing, and Topic Familiarity on L2 Learners' Comprehension and Input Processing. Unpublished PhD Thesis, University of Illinois at Urbana-Champaign.","cites":null},{"id":44683034,"title":"The need for Communicative Language Teaching in China.","authors":[],"date":"2004","doi":"10.1093\/elt\/58.3.270","raw":"Liao, X. (2004) The need for Communicative Language Teaching in China. ELT Journal 58 (3), 270-272.","cites":null},{"id":44683038,"title":"The role of consciousness in second language learning.","authors":[],"date":"1990","doi":"10.1093\/applin\/11.2.129","raw":"Schmidt, R. W. (1990) The role of consciousness in second language learning. Applied Linguistics 11 (2), 129-158.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005","abstract":"This is an Author's Accepted Manuscript of an article published in Language Awareness, 14 (2-3), pp.170-190, 2005 © Taylor & Francis, available online at: http:\/\/www.tandfonline.com\/10.1080\/09658410508668832.The article starts from the premise that approaches to the teaching of English can only be assessed in the particular settings where they may be used. Cultures of learning, teachers’ and students’ beliefs and prevailing material conditions will all have a bearing on how a particular approach is received. In the case study reported on here, four teachers implemented a consciousness-raising (CR) approach to grammar instruction with nearly 200 students in years 7, 8 and 9 of a Lebanese secondary school. The teachers’ and students’ reactions to the particular set of activities trialled were recorded in teacher diaries and reports and through interviews with the teachers and their coordinator, and discussions with the participating students. Both teachers and students felt generally positive towards the approach. The prevailing culture of learning, which encourages learner autonomy and an analytical approach to language, seems to have contributed. It was found, however, that in order to avoid discrepancies in the use of metalanguage and classifications and to allow insights from CR to be used in language production-for-practice, CR would need to be an integral part of the regular integrated skills syllabus.Peer-reviewedPost-prin","downloadUrl":"http:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/09658410508668832#.UaygOZztunw","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/1059\/1\/CR%20in%20Lebanon_Revised%20for%20LA.pdf","pdfHashValue":"418c804909b80b001d9694f9a742179550273acc","publisher":"Taylor & Francis (Routledge)","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/1059<\/identifier><datestamp>\n                2013-06-04T01:01:56Z<\/datestamp><setSpec>\n                com_2381_428<\/setSpec><setSpec>\n                com_2381_9551<\/setSpec><setSpec>\n                col_2381_4676<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nConsciousness Raising Activities in some Lebanese English Language Classrooms: Teacher Perceptions and Learner Engagement<\/dc:title><dc:creator>\nSvalberg, Agneta Marie-Louise<\/dc:creator><dc:subject>\nculture of learning<\/dc:subject><dc:subject>\ngrammar<\/dc:subject><dc:subject>\nconsciousness-raising<\/dc:subject><dc:subject>\nlanguage awareness<\/dc:subject><dc:description>\nThis is an Author's Accepted Manuscript of an article published in Language Awareness, 14 (2-3), pp.170-190, 2005 © Taylor & Francis, available online at: http:\/\/www.tandfonline.com\/10.1080\/09658410508668832.<\/dc:description><dc:description>\nThe article starts from the premise that approaches to the teaching of English can only be assessed in the particular settings where they may be used. Cultures of learning, teachers’ and students’ beliefs and prevailing material conditions will all have a bearing on how a particular approach is received. In the case study reported on here, four teachers implemented a consciousness-raising (CR) approach to grammar instruction with nearly 200 students in years 7, 8 and 9 of a Lebanese secondary school. The teachers’ and students’ reactions to the particular set of activities trialled were recorded in teacher diaries and reports and through interviews with the teachers and their coordinator, and discussions with the participating students. Both teachers and students felt generally positive towards the approach. The prevailing culture of learning, which encourages learner autonomy and an analytical approach to language, seems to have contributed. It was found, however, that in order to avoid discrepancies in the use of metalanguage and classifications and to allow insights from CR to be used in language production-for-practice, CR would need to be an integral part of the regular integrated skills syllabus.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPost-print<\/dc:description><dc:date>\n2009-12-08T16:26:47Z<\/dc:date><dc:date>\n2009-12-08T16:26:47Z<\/dc:date><dc:date>\n2005<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nLanguage Awareness, 2005, 14 (2-3), pp.170-190<\/dc:identifier><dc:identifier>\n0965-8416<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/1059<\/dc:identifier><dc:identifier>\nhttp:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/09658410508668832#.UaygOZztunw<\/dc:identifier><dc:identifier>\n10.1080\/09658410508668832<\/dc:identifier><dc:identifier>\n1747-7565<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:rights>\n© 2005, Taylor & Francis. Deposited with reference to the publisher’s archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nTaylor & Francis (Routledge)<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0965-8416","issn:1747-7565","0965-8416","1747-7565"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007"],"year":2005,"topics":["culture of learning","grammar","consciousness-raising","language awareness"],"subject":["Article"],"fullText":" 1 \n \nConsciousness Raising Activities in some \nLebanese  English Language Classrooms: Teacher \nPerceptions and Learner Engagement1, 2 \n \nAgneta M-L Svalberg \nCELTEAL-School of Education, University of Leicester, 21 University Rd., Leicester LE1 \n7RF, UK \n    \nThe paper starts from the premise that approaches to the teaching of English can only be assessed in \nthe particular settings where they may be used. Cultures of learning, teachers' and students' beliefs and \nprevailing material conditions will all have a bearing on how a particular approach is received. In the \ncase study reported on here, four teachers implemented a Consciousness Raising (CR) approach to \ngrammar instruction with nearly 200 students in years 7, 8 and 9 of a Lebanese Secondary School. The \nteachers' and students' reactions to the particular set of activities trialled were recorded in teacher \ndiaries and reports and through interviews with the teachers and their coordinator, and discussions with \nthe participating students. Both teachers and students were overall positive to the approach. The \nprevailing culture of learning, which encourages learner autonomy and an analytical approach to \nlanguage seems to have contributed. It was found, however, that in order to avoid discrepancies in the \nuse of metalanguage and classifications and to allow insights from CR to be used in language \nproduction-for-practice, CR would need to be an integral part of the regular integrated skills syllabus.   \n \nKeywords: grammar, consciousness raising, language awareness, culture of \nlearning \n  \nIntroduction \nThe topic of this paper is an evaluation of the appropriacy of a Consciousness-\nRaising (CR) approach to grammar learning\/teaching in a Secondary School in \nLebanon, and a discussion of its implications. The research was carried out in a case \nstudy project called the 'Grammar Awareness in Lebanon (GAL) Project', supported \nby a grant from the Council for British Research in the Levant.  \nThe setting for the study was Lycée National in Bchamoun3, in the greater Beirut \narea, Lebanon. The learners were Secondary School Pupils in year 7, 8 and 9.  Their \nEnglish teachers implemented a set of CR exercises in their language classes over a \nperiod of four weeks and reported to the researcher on both their own views and the \nreactions of their students.  \nLebanon is home to a range of ethnic, religious and language communities. Its long \nhistory as a sea faring, trading nation and its colonial past are evident in the present, \nsociolinguistically and educationally. Multilingualism and bilingual education are the \nrule rather than the exception. The school referred to has a French and an English \nMedium stream and the first language of the children is Arabic. From Primary Grade \nOne, Maths and Science subjects and Computer Skills are taught in either English or \nFrench while Social Science subjects are taught in Arabic. The research was carried \nout in English Medium classes. The children appear to be highly communicative in \ntheir first foreign language.  The main concern of the teachers is thus not fluency but \naccuracy. \nSome of the characteristics of a CR approach are apparent in the materials used in \nthe present study (see sample in Appendix 1) and in the discussion below. The \nterminology may be less obvious. James (1992) made a distinction between the \nraising of 'awareness' and 'consciousness'. According to this, a person can be made \n 2 \naware of what they already know while raising consciousness, in contrast, involves \nthe creation of new knowledge. The awareness\/consciousness distinction can, \nhowever, be difficult to maintain in relation to learners as the exact state of their \nknowledge is  not usually known. I will use the term CR to mean making learners \naware of how language is used, whether or not they had some unconscious knowledge \nof it before. In those terms, CR aims to create heightened language awareness. The \nawareness can relate to grammar rules, or to other patterns such as the appropriate use \nof language in specific contexts for particular purposes. According to Ellis (1994: \n643): \n \n...in consciousness raising activities the learners are not expected to produce the \ntarget structure, only to understand it by formulating some kind of cognitive \nrepresentation of how it works. \n \nThis means that the learners will gain an understanding of how, for example, the \ngrammar rule works but that production-for-practice exercises are not part of CR. As \nwe shall see, this had consequences for the design of this study.  \nWhile CR activities can, in principle, be inductive or deductive, I would argue that \nthe approach has come to be associated with a learner centered classroom and that CR \nactivities are therefore more likely to be inductive. The activities used in this study \nhave elements of both but are mainly inductive. Perhaps due to its usually inductive \nnature, Hedge (2000) considers a CR approach compatible with \"the culture of the \ncommunicative classroom\". Another common feature of CR activities which would \njustify this assessment is that they involve learners in talking about language, thus \nproviding a communicative dimension.  \n Below, I will first address the issue of appropriacy of CR as an approach. This is \nfollowed by a brief description of the research method and a longer presentation and \ndiscussion of findings. The paper ends with some reflections on possible implications \nand suggestions for further research.  \n \nAppropriacy of CR in Different Contexts \nThe study was prompted by the realization that recommendations by English \nLanguage Teaching (ELT) experts from 'Inner Circle' countries (the US, UK, Canada, \nAustralia, New Zealand; Kachru 1985) are not always either welcome or appropriate \nin other countries (Ellis 1996). The purpose of the GAL Project was to explore the \nviability of inductive CR, a relatively recent approach to the learning\/teaching of \ngrammar, in a particular classroom context outside the 'Inner Circle'. Little research \nhas been done in this area. Mohammed (2004) found that adult learners in New \nZealand liked both a deductive and an inductive CR exercise, but did not explore their \nperceptions further. \nFrom an SLA perspective, our increased understanding of  the role of noticing and \nawareness (Schmidt 1990; Fotos 1994; Izumi 2002) makes CR seem an attractive \npedagogic option in principle. However, the case of CLT indicates that one should not \ntake a positive response to any new approach for granted. Gupta (2004) relates how \nCLT was imposed from above but in effect rejected by teachers and students in \nPanjab University in India until, more than ten years down the line, the social and \nlinguistic context has changed and CLT is becoming accepted and appreciated as \nfulfilling a genuine need for communicative competence. This and other studies, e.g. \nLiao (2004) and Lewis & McCook (2002),  suggest that attitudes to teaching \n 3 \napproaches are based on a variety of factors among which SLA research evidence \nmay play a very minor role.  \nHence the assumption of the present study that a CR approach might be more or \nless appropriate and effective in different cultural contexts. Informal discussion with \nLebanese teachers prior to this study had indicated that teacher fronted explanations \nfollowed by structured grammar exercises were common in Lebanese schools. At the \nsame time, my impression was that Lebanon was far too multifaceted for \ngeneralizations about Lebanese teachers and students to be useful. In this study,  \n'culture' thus means the 'small culture' of a particular school or a particular classroom \n(Holliday 1999). It is assumed that one school can differ from another, even in the \nsame region or country, in terms of its 'culture of learning'. This concept was \ndiscussed in some depth by Cortazzi & Jin (1999) in the context of a national \n(Chinese) culture. By culture of learning Cortazzi and Jin (1999:169) mean that: \n \nbehaviour in the classroom is set within taken-for-granted \nframeworks of expectations, attitudes, values and beliefs about what \nconstitutes good learning, about how to teach and learn, whether and \nhow to ask questions, what textbooks are for, and how language \nteaching relates to broader issues of the nature and purpose of \neducation. \n \nA culture of learning is part of the ‘hidden curriculum’. As Cortazzi and Jin (1999) \npoint out, in many language classrooms more than one culture of learning  is \nrepresented. Choice of texts, lay-out, exercise and activity types and so on, all \nencapsulate expectations and ambitions which are part of particular cultures of \nlearning. CR activities are no exception and so their compatibility with the prevalent \nculture needed to be investigated. In the present study the teachers and students are all \nLebanese with Arabic L1. It was assumed that whatever small cultures of learning \nthey represented would be fairly similar and that there would also be a particular \n'school culture'.  \n \nAlthough some locally produced books are used in the school, a different cultural \ninfluence could be exerted by the majority of the textbooks which originate in the \nInner Circle countries. These contain occasional CR activities in the form of 'guided \ndiscovery' exercises. The English Language Coordinator, however, indicated that CR \nwas a new approach to the teachers and students, and this was also borne out by the \nresearch data. \n \nThe study discussed set out to answer the following questions in regard to the \nparticular research context:  \n \nQu.1: How do the teachers perceive CR activities? \nQu.2: How do the students perceive CR activities? \n  \nMethodology \nIn the case study, four English Language teachers implemented a series of five or \nsix CR activities, each lasting 15-30 minutes, over a four week period in Secondary \nlevels 7, 8 and 9 of the English Medium stream. Nearly 200 students carried out the \nactivities.   \n 4 \nThe sample depended on the availability of classes, including the willingness of \nteachers to participate. Hence there was not an equal number of students in each level \nand there were more boys than girls. \n \n Table 1  The students and their teachers \n \nLevel Boys Girls Total Teachers \nYear 7 56 51 107 T1, T4 \nYear 8 32 14   46 T3 \nYear 9 22 22   44 T2 \n 110 87 197  \n            \nAccording to the English Language Coordinator (ELC), the classes are mixed ability \nas regards English Language.   The students  do not generally use English out of \nschool: “All the English they know is from the textbook” [ELC Interview]. \n \nAll the English Language teachers in the school are university graduates and   \nreceive some in-service training at the school. In the interview, the ELC said:  \n \nThe office is always a workshop.  I meet [the teachers] almost \nevery Saturday.  Usually on Saturday. I introduce the technique that \nwe’ll be doing in class over a period of time.  We see what new \nthings we are going to be doing in the lesson.  It is a practical \nclassroom – they do the activities that they will be doing in their \nclasses with their students [ELC I]. \n \nThis description coincided well with the ethos and activities I had observed on my \nvisits to the school.  \n \nThe teachers’ involvement in the research took the form of an Action Research (AR) \nproject in which they were asked to implement the CR activities, keep a diary as they \nwere doing so, and write a brief report at the end of it. The embedding of the AR is \nillustrated in fig.3, below. The questions included in the smaller box are ones the \nteachers themselves tried to answer during the implementation phase. They are not the \nmain concern of this paper. Nor will the third research question in the large box be \ndiscussed here. The research questions that will be discussed in this paper are Qu.1 \nand Qu.2, in bold, at the top of the larger box in the figure. \n \n 5 \n \n \n \nThe Grammar Awareness in Lebanon Project \n                                          (a case study) \nQu.1: How do the teachers perceive the CR activities? \nQu.2: How do the students perceive the CR activities? \nQu.3: To what extent do the students benefit from the CR \nactivities? \n \n        The Action Research Project \nTo what extent \nqu.i: can the learners recognize verbs? \nqu.ii. can the learners identify tensed  v  non-tensed   \nverbs? \nqu.iii. can the learners identify clauses? \nqu.iv. do the learners' abilities improve with the use  \nof CR activities? \n \n \n \nFigure 1 The 'nested' design of the GAL project. \n \nOnce the form of cooperation with the school had been established the study \nproceeded as follows: \n \n1. Training of teachers in the use of the CR activities and in Action \nResearch \n2. Pre-test of students  (not discussed here) \n3. Teachers implement CR activities over a four week period, keep a \ndiary and write a final report.  \n4. Post-test of students (not discussed here) \n5. Individual teacher interviews, and interview with English Language \ncoordinator. \n6. English Language coordinator conducts class discussions to collect \nstudent impressions.  \n \nThe project rested on the teachers’ involvement in the study. All were interested \nand supportive, and the proactive and very competent interventions by the ELC were \nparticularly helpful. As all the participants were to some degree researchers,  I will \nrefer to myself as ‘the principal researcher’. Being based in the UK, I made four visits \nto the school in Lebanon to set up, monitor and eventually wrap up the project. On the \nfirst visit, I was given samples of students’ writing and the English teachers \nnominated the main learning\/teaching problems in Secondary levels 7-9. The \nfeedback suggested that both students and teachers would perceive CR activities on \nthe use of clauses and sentences as relevant to their needs. Run-on sentences and poor \npunctuation were major problems in all three levels, and one of the teachers’ main \nconcerns.  \nThe second visit involved training the teachers in Action Research and in the use \nof the CR activities, in two three-hour workshops.  What I have called Action \nResearch here did not fulfil all the criteria for such research (Kemmis & McTaggart \n1988, Nunan 1992, McNiff & Whitehead 2002). Crucially, it was not initiated by the \n 6 \npractitioners, nor did they have much control over its design. Nevertheless, the \nimplementation part of the research was carried out by the practitioners in their own \nclassrooms and the activities trialled responded to a grammar problem identified by \nthem.     \nFollowing the Action Research, there were semi-structured interviews with the \nteachers. These lasted 10-15 minutes. They were conducted by the principal \nresearcher and took place in a small, general purpose room next to the ELC’s office. \nThere was a fair amount of background noise and occasionally teachers would wander \nin to fetch something.   \nThere were 14 questions (Appendix 2). As the principal researcher had not been \npresent when the activities were administered, the first three questions tried to \nestablish how this was handled. The remaining 11 questions aimed to give the \nteachers opportunity to relate their impressions of students’ attitudes and engagement \nwith the material and to give their own views on the type of activity.   \nThe interview with the ELC was unstructured. It dealt first with the administration \nprocess and she was then asked to give a brief background sketch of the teachers and \nthe students.  \nThe interviews were transcribed ignoring elements deemed not to have a major \nbearing on the intended message, such as most pauses, hesitations, and interjections in \nArabic (e.g. discourse fillers). Some portions of the interviews, marked {...} in the \ntranscripts, are unintelligible. Unbracketed ... (three dots) indicate that a transcribed \nportion has been left out.  \n The research design had a number of limitations, the most important being the \nnear absence of learners' voices. It had originally included interviews with a number \nof students from each level. However, a clash with Ramadhan, exam dates and the \nprincipal researcher’s other commitments meant that the interviews could not be \nconducted within a reasonable time after the end of the trial. The ELC instead visited \neach of the classes involved in the trial and held a 15 minute discussion with them \nabout their impressions. The students’ views were collated into a one page report and \nsent to the principal researcher. Information about the students' views could also be \ngleaned, indirectly, from the teachers' verbal and written reports of the students' \nengagement with the activities. It would be important for any similar, future study to \ninclude the voices of the students.  \n \nThe role played by the teachers who implemented and reported back on the CR \nactivities was both a strength and a limitation. The teachers volunteered to participate \nwhich means that they may not have been representative of the teaching staff as a \nwhole. A number of variables could not be controlled for, e.g. individual teaching \nstyles and preferences, and the pressures of the regular syllabus, which influenced the \nyear groups differentially (see below). On the other hand, an account of the teachers' \nfirst hand experiences of implementing CR was the very basis of the study. The fact \nthat they kept diaries helped avoid the presence of an outside observer in the \nclassroom. \n \nThe data thus consisted of teacher interviews, interviews with the coordinator, the \nteachers’ diaries and teachers’ reports, plus the ELC’s report on the students’ views.  \nThe discussion of findings below will be illustrated with excerpts. The coding of their \nprovenance is given in square brackets immediately after each excerpt and consists of \nthe teacher code and data type, e.g. [T3 I] = Interview with Teacher 3. 'Report' and \n'Diary' are coded R and D respectively. \n 7 \n \nThe CR activities \nThere was one text with one set of exercises for each year group. The year 7 \nmaterials can be seen in Appendix 1. The reason for not varying the text was to save \ntime. A comprehension check was only needed in the first session. After that, the \nlearners could go straight into the new exercise each time.  \nThe students were induced to notice certain grammatical features in a text by \nhaving to mark them in some way, e.g. underlining all the verbs or putting slashes \nbetween clauses. They then compared and discussed their answers, typically in pairs \nfirst and finally with the whole class.  \nThe activities aimed to make available to conscious reflection an understanding of \nthe clause as a concept, and how clauses function to form sentences. It was thought \nthat this might eventually help the learners acquire an improved command of \npunctuation, including a decrease in run-on sentences. (The pre and post-tests, not \ndiscussed in this paper, were administered to see whether there was any such effect in \nthe immediate term.) As the core of the clause is the verb group, the CR started with a \nverb recognition exercise. The last exercise had  students picking out and counting \nclauses in sentences. In between, there were activities highlighting the difference \nbetween tensed and untensed verbs and establishing the concept of ‘verb group’ \n(Appendix). The most salient features of the CR activities as a type were that there \nwas 'induced noticing' and a 'talking-about' grammar element, but no production-for-\npractice of clauses and sentences. \n \n \nFindings \nThe findings from the different types of data will be discussed together, starting \nwith some background about the classroom administration of the CR, continuing with \nthe students’ perceptions and their engagement with the activities, mainly as reported \nby the teachers, and finishing with the teachers’ own perspective on the CR activities.   \n \nClassroom implementation \n How the teachers handled the administration of the activities in their classrooms \ngives some insight into how CR was situated relative to the particular culture of \nlearning and the existing curriculum.    \nLanguage use: In accordance with school policy, all the work was carried out in \nEnglish. This was not a problem as the students are used to discussing a range of \ntopics in English.   \nWork Mode:  All of the teachers reported doing the exercises according to a similar \npattern: the students did the exercises first individually, and then usually shared their \nsolutions in pairs as they were seated. This was followed by a class discussion which  \ntook slightly different forms depending on the teacher. The year 9 teacher (T2) first \nnominated a student to suggest an answer. Students who disagreed would raise their \nhands and the alternatives would be discussed. She reported that as time went by and \nmore exercises were done, disagreements became more rare despite the greater \ncomplexity of the later exercises. T3, in year 8, had a different approach in that \nfollowing the class discussion she read the correct answers to the students. This might \nhave happened  because the students were still unsure of the answers. The teacher was \nalso either puzzled by or did not agree with some of the answers, as will be discussed \nbelow.  \n 8 \nStudent autonomy: T3 described her interventions as ‘interfering’ which seems to \nindicate a belief that it is good to let students find their own answers if possible. This \nimpression is supported by comments from other teachers as well.   \n \n[The year 7 students] gave back correct answers – I didn’t give \nthem correct answers.  But, we discussed: is it correct or isn’t it \ncorrect?  And we all agreed what is the correct answer. We came up \nwith it. I won’t give them the answer, the right answer. [T1 I] \n \nIn an exercise which some students in year 9 found puzzling, the teacher gave the first \nfew answers and then: “they started figuring out the mistakes by themselves and \ncorrecting before we even come to it.” [T2 I]    \nTiming: The teachers reported supplying extra examples and occasional \nexplanations when needed. OHTs of the keys were available but were not used, \nprobably because projectors are not a permanent feature of the classrooms.  Some of \nthe year 7 students felt they could have gone through the exercises more quickly but \ngenerally time was perceived as being too short. In the words of T4, “timing was \nreally an obstacle”. This is supported by T3, who wrote:  \n \n“To me I felt that these concepts are easy but not to teach so quickly \nsince I needed more time to introduce the idea of clauses – tensed \nuntensed\/verb groups.”  \n \nand also: \n \n “I think that if I had enough time to complete this activity as a  \n“lesson” on it’s own, it would have been worked out more properly \nby the students and the teacher as well”.   \n \nRelationship to the curriculum: The above extracts imply that the CR \nactivities did not fit in with the other activities of the class at that time. T3’s \nstudents in year 8 were, in fact, working on reading and writing poetry. In \ncontrast, the year 9 students were learning to use ‘Adjective Clauses’ and  \n‘Noun Clauses’ (clauses with an adjectival or nominal function). The year 9 \nteacher said the following about teaching her students pseudo-cleft \nsentences: “noun clauses were something new to them this year.  The [CR] \nactivity itself – knowing that this is a clause - facilitated the explanation \ndefinitely” [T2 I].  The teachers were experienced practitioners and probably \nattempted in one way or another to make links between the CR activities and \nthe rest of the classwork. This would have proved the hardest for the year 8 \nteacher and easiest in year 9.  \nThe use of terminology and concepts in the CR activities differed to some \nextent from that of the regular syllabus. This will be discussed below.  \n \nStudents’ attitudes and engagement \nThe overall mood: The teachers were asked about the general mood while the \nstudents were doing the CR activities. The response was mostly positive. Words used \nwere ‘nice’, ‘really good’, ‘motivated’, ‘interested in the analysis’, ‘very cooperative’. \nT3 said that “the students like grammar a lot” and T4 that the students “liked the \nexercises...they were working.” \n 9 \nThere were also, however, some aspects of the activities which were less popular.   \nFor example, both according to the teachers, and to the students themselves (ELC R), \nall the groups were disappointed and bored to find they had to work on the same text \nfor all five exercises. (This was a time saving measure, see above.) But, at least in \nT3’s classes, “when they started, they forgot about it – they forgot it was the same \ntext” [T3 I]. \nMetalanguage & Concept: The activities were a novelty in two ways. One was the \nCR approach itself and the particular format of the activities, the other was use of \nmetalanguage and concepts. T3 wrote with reference to year 8: \n \n...all this material\/activity\/ies were brand new to the students \nbecause they take these concepts in the upper intermediate classes. \n[T3 R] \n  \nIn all the levels, unfamiliarity caused students to feel confused [T2 I, T4 I] and upset \n[T2 I]. T3’s report explained:  \n \n[Some students] worked feeling so enthusiastic about things they \nwere doing.  But one of the classes felt so confused where I had then \nto keep on explaining the concepts given especially the one about \n“tensed” and untensed [T3 R].   \n \nThe main sticking points were the distinction between tensed and untensed verbs \nand the concept of a verb group. Neither is included in the regular curriculum. \nAccording to one teacher, “[verb group] really goes against everything we teach” [T1 \nI]. T1 explained in her report that the students are taught that, for example, ‘was \ntaking’ or ‘had been going’ is ‘the verb’. This is obviously difficult to reconcile with a \ntensed\/untensed distinction and re-labelling these units as ‘verb group’ can be \npuzzling. Some year-7 students “ felt {..} upset about the verbs – the tensed\/untensed.  \nThey asked, ‘Miss {..}, why are we taking these, what for?’[T4 I].” The teacher \ncommented that  “it’s good to know them but they didn’t know how they should deal \nwith them in future”. The students seemed to have been unsure if this distinction \nwould be required knowledge beyond the trial of these exercises, and thus if it was \nworth their while getting to grips with.  \nThere was not complete agreement on this, however, as T3’s comment indicates: \n \nAnd when they had the progressive - ‘was eating’ - they didn’t \nknow that it was a verb group – they thought that ‘was’ was \nseparated and ‘eating’ was separated – they were taught but they \nforgot about it – this exercise was really important to them to learn \nthat this is a verb group. [T3 I] \n \nFor the teachers, the new terms and concepts could to some degree have been \nunsettling as they had to deal with the students’ questions and provide extra \nexplanations and examples. They may not have been convinced themselves that they \nwere useful. In her report,  T1 stated  “I don’t agree on tensed and non tensed verbs.” \nWhen the students were not satisfied with her explanation she reportedly told them  \n“Just do it – don’t discuss it”! (laughter) [T1 I]. This raises questions about the nature \nof linguistic analysis in a CR approach, to which we will return in the conclusion.  \n 10 \nT1 did not seem to think the ‘confusion’ and ‘upset’ feelings had been a major \nproblem. She summed up her impressions from year 7 by saying “Everyone felt that \nhe could do it – this was very positive. This gave the pleasant environment in the class \nthat I was talking about” [T1 I]. The other year-7 teacher was similarly unperturbed \nand she and her students seemed to enjoy discussing grammar [T4 I].  \n T4’s detailed diary  notes show that her students were able to justify some of their \nchoices. Below is a compilation of the reasons they  gave for classifying some words \nas verbs: \n1. translated to Arabic \n2. using ‘to’ \n3. it shows an action\/ something that happened \n4. –ing shows this is a verb \n5. verb in the past (-ed shows it is a verb) \n6. it is preceded by a subject  \n7. it is followed by an object  \n8. I know it before\/ because it is a verb (background knowledge) \n[T4 D] \nCollectively, the students were able to use a range of criteria for the determination \nof word class and in six of the eight justifications display a knowledge of formal or \ninformal metalanguage to talk about it.  \nThe new and different terminology and concepts did not put the students off the \ntasks as such. T4 made the assessment that “the chart ...the clauses were really \nefficient - the linker and the chart, and the ones that explained {...} verb groups.  This \n- they liked it a lot.” [T4 I]    \n  \nLevel of concentration: One of the interview questions dealt with the students’ \nlevel of concentration. The teachers all agreed that the students had been \nconcentrating on solving the exercises. This is how T2 explained it: \nYes, definitely because you know it requires analysis, where to \nput the slash, what to circle, then they have to do the counting, then \ncompare the counting,  they were interested now, “Did you circle \nthis, did you slash?”  Yes, the task itself calls for concentration. [T2 \nI] \n \nIn the year 9 classes there was silence or quiet talking in English, sharing and \njustifying solutions (T2 I). About year 7 doing the first exercise, T1 wrote that they \nfocused on the task and didn’t speak much” [T1 D]. T3  uses the terms ‘active’ and \n‘focused’ to describe students’ engagement [T3 D]. \nSilence could be a sign of boredom or lack of engagement, but the teachers \nreported that the students were talking to each other, “but not noisily” [T2 I]. There \nwas an “acceptable” level of noise [T1 I]. The students of T3 “talked about the \nexercise. Not about {..}something nonsense not related to the thing we’re doing” [T3 \nI]. Even T4, who said that one “could hear the silence” in the classroom, reported that \n“they discussed but very silently and they were trying to find things {...} together” \n[T4 I]. \nTraining effect: There seems to have been some training effect over the four \nweeks. The further on they got with the exercises, the more interested the students \nbecame. T1 said: “Later on they were more engaged in the exercises” [T1 I], and T4 \nconcurred:  \n 11 \nThe first activities, one to four, they were not so motivated as in \nfive and six, the clauses ones. This is the change I noticed -  I \nnoticed their attitude was really different.  They were more excited \nat the end than the beginning. [T4 I] \n \n The increased interest may have been partly due to the greater cognitive challenge \nof the later exercises but familiarity also played a role. T3 made a comment pointing \nout the facilitating effect of each exercise building on the previous ones: “It was easier \nto them – the following exercises. They remembered every past exercise” [T3 I].  \nSeveral factors thus seem to have contributed: accumulated grammatical \nconsciousness, increased level of difficulty and familiarity with the exercise type: \nWhen they took the 3rd paper – the 3rd activity,  they read it alone \nand they knew what to do. Then they asked the questions: ‘What’s \nthe meaning of this?’ ’I don’t understand.’ In the beginning, no, they \nwere confused, but later they got accustomed. [T3 I]  \nIn the teacher’s view, the year-8 students’ questions were a sign of student \nengagement. Prior to the third activity, they had been too puzzled to formulate any \nqueries.  \nA learning process?: In their normal day-to-day practice teachers will continuously \ntry to assess, however impressionistically, whether learning is going on. The teachers \nwere therefore asked whether they perceived this to be the case when the students \nwere doing the exercises. T1 and T2 were the most positive in their replies. In the \ninterviews, T1 said that when sharing their answers and explaining, the students were \ndefinitely learning. T2 also mentioned as indicators of learning the increasing speed \nwith which students were working and correcting their work. T3 was more reserved in \nher assessment and stated that the exercises were “just reinforcement”.  An \ninterpretation is that, in her eyes, stand-alone grammar activities such as these are \ninsufficient to cause learning. T4 mentioned the figure 60% - whether this referred to \nthe amount of intake or to the proportion of students who were learning is not clear. \nHowever, she made an interesting assessment to do with culture of learning: \nthey don’t interpret it as a concept - this is the difference - the way \nthey studied it... [T4 I] \nT4  added that the students could benefit from the adoption of a conceptual approach \nto grammar. There were also appreciative comments from the teachers about the \nmental activity and discovery process triggered by the activities: \nI think that it got them thinking, “Ah, this is this, we always read \nthese kind of sentences, but I didn’t use to slash it to see this is a \nclause.”  Now they know the ‘why’, there are more clauses in one \nsentence, sometimes {...}. So the analysis itself was a challenge to \nthem.  I like activities which involve them mentally, and they like it \n– yeah we like it more than, like drills {...} [T2] \nT3 found the sharing aspect of the CR activities interesting and added that “Some \nstudents notice important things ... I was amazed that they noticed such things” [T3 I]. \nWhile noticing (Schmidt 1990) does not guarantee intake (Leeser 2003, cited in \nVanPatten 2004), CR assumes it to be a first step. T3’s comment seem to relate to \nstudents’ independent, non-induced noticing, showing that the students were mentally \nalert during the activities.  \n \n 12 \nThe teachers’ own views of the CR \n Absence of a production element versus integration of skills: In the interview, the \nteachers were asked their view on the lack of a production-for-practice element in the \nactivities (see above). Production exercises had been excluded from the activity \npackage in order to obtain teachers' and students' views on CR as such, and not on \nwhat might follow. To some extent this created an artificial situation. The question \nhad to be rephrased  as the teachers saw the pre and post test (not discussed in this \npaper) as part of the activity package. When the point of the question was eventually \nput across, the response was mixed. T1 was non-committal but described the situation \nas follows:  \nThe activities were different. We teach the students to apply what \nthey learned not only to be aware of it. In our activities we stress the \nusage.  It’s important to know how to apply, e.g. to write a sentence \nor make a question using a certain grammar concept or rule. [T1 R] \n T3, who was the most critical of the teachers, was clearly sceptical about the value \nof exercises which do not contain a production element: “We have to write sentences, \nand text - write paragraphs. Every time, we give them a writing task“ [T3 I]. About \nexercises without a production element, T3 said:  \nI think it’s not so effective. You know, they forget.  Its important to \nwrite – to implement such tasks and such exercises and such \nactivities in their writing. It will be more reinforced. I don’t think \nthat when they took the activities and the post-test they learned from \nsome of the activities a lot - they still have their own ideas – they \nstill have their own background – I don’t think it affected them a lot. \n[T3 I] \nLater on in the interview, T3 emphasized her belief in the integration of skills, an \napproach adopted by the school. T2 also pointed out that she always tries to integrate \nskills and ask for either written or spoken production and expressed her conviction \nthat if you ask students to use a linguistic feature they have been taught, whether \nvocabulary or grammar, “one time, two times, three times - at last they will be able to \npick it up, they’ll know how to” [T2 I].  In all, three of the four teachers made explicit \nstatements in favour of an integration of skills approach, which is already practiced in \nthe school.  \nChallenges: Any activity which invites discussion of language form or usage \npresents a special challenge to the teacher. Student questions are likely to be \nunpredictable; terms and concepts may need to be explained;  illustrative examples \nmay be needed; seemingly contradictory evidence may have to be dealt with. In the \npresent study, the teachers encountered all of these situations. The year 9 teacher, for \nexample, had to explain the nesting of one dependent clause in another (“It seems \n[that [if you want to live a long time,] you should...]”). There were teacher’s notes to \nhelp with this. In some cases, however, the teachers were not in agreement with the \nanalysis presented in the CR activities but, feeling constrained by the research \ncontext, could not deviate from the programme. One such instance, has already been \nmentioned above. Another occurred in year 9, where the text included a present \nparticiple. The sentence was: “....you stand a good chance of living a long and healthy \nlife.” It appears that the teacher and the students were used to considering -ing forms \n‘gerunds’ and, though deverbal, basically non-verbs4. In the CR materials, the form \nwas classified as an untensed verb. The teacher commented: “I didn’t focus that it is a \n 13 \nverb – they couldn’t see it was a verb.  It is taken out of  a verb – it functions as a – so \nI didn’t impose it” [T2 I] Rather than reinforcing the tensed\/untensed distinction, the \nclassification of ‘living’ in this context thus remained unresolved. In year 8, the \nteacher’s diary states that “During verb identification, students were confused about \nunderlining the verb 'to be' alone without underlining the active verb“ [T3 D]. The \nsentence referred to is “I was shocked when I heard ...”. It is not clear from the diary \nwhether the teacher was of the view that ‘shocked’ functions as a verb in this context, \ndespite it being classified as an adjective in the teachers’ notes. In any case, such \nstudent queries demand a high level of language awareness on the part of the teacher \nwho may need to resolve them adequately on the spot.  \nPersonal interests and preferences: The personal experiences, beliefs and \npreferences of the participating teachers will have played a part in the degree of \nacceptance of the CR activities by both teachers and students. All the teachers said \nthat they had approached the trials in a positive frame of mind. In one report, the \nteacher commented: “I’m interested in any action research.” [T4 R]  T1 was keen to \nsee how effective the exercises would be: “ I was interested from the beginning. I \nwanted to know the result of the whole thing” [T1 I]. T2 found the approach \nintrinsically interesting because: “I like analysis.  That’s why I like the last parts, four \nand five and six.” [T2 I]  At the end of the trial, T4 expressed her strong support for \nan inductive approach.  \nif we teach grammar this way it will be much better. This is how we \nshould teach – the only way. We explain {...} then we go onto the \nexercises, the drills, whatever, but this is much better because they \ndiscovered the content – like the clause part – they really discovered \n- because to put clauses on the board and keep on talking about it \n[voice trails off] [T4 I] \nT4’s body language and tone of voice indicated that the traditional, deductive \napproach had not hitherto been effective.  \n  \nDiscussion \n It was important in this study not to prejudge perceptions and attitudes but to allow \nparticipants to express their views as freely as possible. Hence a qualitative approach \nwas appropriate. Teachers' and students' eagerness to be helpful might have had a \nbiasing effect, but both positive views and criticism were expressed.   \nA misunderstanding which led to the completed exercises being collected in by the \nteachers was unfortunate. It may have meant that the students did the exercises more \nconscientiously than would otherwise have been the case. There is no reason to \nassume, however, that the exercises were confused with tests as solutions  were \ndiscussed and checked, and students encouraged to correct their mistakes. Both \nteachers and students were aware that they were participating in research (or ‘trying \nsomething out’) and it appears that the collection of the papers was seen as part of this \nprocess. \nThe expectations and beliefs of individual teacher can have an effect on how \nstudent perceive of and interact with approaches and materials (Carless 2003, and \nKaravas-Douka 1995 cited in Carless 2003). The teacher who was most critical of the \nCR activities was T3. This coincided with her students (level 8) being the most \ncritical, according to the ELC’s report. As these classes had some difficulty fitting the \nCR into their regular syllabus (which included reading and writing poetry) a \ncombination of contextual factors and the teachers’ beliefs can have affected their \n 14 \nperceptions.  In contrast, a couple of the teachers stated that they personally liked \nanalysis of language. This might have prompted not only them but also their students \nto take a positive stance towards the CR activities.   \n  \nHow do the students perceive the CR activities?  It was unfortunate that student \ninterviews were not able to be carried out. The data indicates, however, an overall \npositive student response. Despite being somewhat bored with the same text and \noccasionally anxious or confused by some of the terminology and classifications, the \nstudents seemed to enjoy sharing and discussing responses and reacted well to the \nanalytical nature of the tasks, engaging actively and  focusing on the task. A \nperception of relevance (particularly of the clause concept) contributed to the positive \nreception while apparent irrelevance (e.g. of terminology) may have detracted.  \nSome reasons for the generally positive student response to the CR activities in this \nparticular setting emerged from the data: \n \nthe students were used to explicit grammar instruction \nthe students already had some formal and informal metalanguage \nthe students were used to discussing (grammar  and other topics) in   \n    English \nmany of the students liked analytical tasks \n \nHow did  the teachers perceive the CR activities?   The overall positive teacher \nresponse to CR may in part have been due to a self-selection effect. Those who \nvolunteered to participate in the study, may have been more open to change than some \nof those who did not. Nevertheless, the teachers were critical of the lack of integration \nof skills and had some difficulty with the terminology\/classifications used in the \nmaterial. The  latter was partly due to the stand-alone nature of the exercises but also, \narguably, to the demands of a more in-depth language analysis than is usual in text \nbooks. A consequence was that some student questions were left unresolved. On the \nother hand, the teachers appreciated the analytical, inductive nature of the tasks and \nthe active student engagement and enthusiasm they observed. The teachers positive \nreactions seemed to outweigh the negative comments.  \nSeveral factors may have predisposed the teachers in this particular context to react \npositively to CR activities: \n  \nthe teachers were open to change \nthe teachers were well able to deal with student questions \nthere was a culture of encouraging student autonomy      \n the teachers liked analytical tasks \n \nIn addition, the  CR activities focused on an area of genuine, recognized need. \n \n \nConclusions \nThere is a good chance that a CR approach could be useful and effective in the school \nif the teachers were able to integrate it into their regular syllabus. At least three of the \nfour teachers appeared to find the analytical nature of the CR activities enjoyable and \nuseful. They did not seem put off by unexpected student questions but dealt with them \nand any lack of clarity by supplying their own examples and explanations. Finally, \n 15 \nthere seems to be a general culture of encouraging student autonomy, which allowed \nfor lively and productive pair and class discussions. \nIt is clear from the data that to make the best use of CR it should  fulfil certain \ncriteria. It should be part of the prevailing integrated skills approach, rather than in the \nform of stand-alone activities. A mix of analytical CR tasks and creative \nwriting\/speaking might be well received. Metalanguage and classifications would \nneed to conform to what the students and teachers are used to, though one can \nimagine over time that insights from CR would lead to gradual changes in the \nsyllabus. One of the reasons for the relative success of the GAL materials was that it \nfocused on an area of the grammar which was considered especially relevant. Ideally, \nthe teachers themselves should be in charge of  identifying other areas where CR \nmight be useful. The study indicates that while ‘easy’ activities have a place, \ncognitively challenging material may in fact be perceived as more stimulating and \nfun. Finally, an integration of CR into the regular curriculum, along the lines \nsuggested, is likely to result in greater efficiency in terms of time (a problem \nmentioned by the teachers).  \nFurther case studies of teacher and student perceptions of CR would be useful as \nthe particular setting for the GAL project had characteristics not necessarily shared  \nby other contexts5. For example, the Lycée National students were in the English \nMedium stream and well able to discuss grammar issues in the target language. This \nwill obviously not be the case everywhere, and could have a major effect on the \nconduct and reception of CR. As was pointed out above, CR can take many different \nforms and so there is also the question of how different types of CR activities are \nperceived.  \nThe research design of the GAL study also deserves a concluding remark. The \nlocal teachers’ active involvement was invaluable in permitting the principal \nresearcher to carry out a study in a learning\/teaching contexts of which she had little \nknowledge. This kind of collaboration has the potential to benefit all concerned. Local \nteachers and the school can gain from an outsider’s perspective and the research \nexperience and initial training in the basics of Action Research might help teachers set \nup their own Action Research.  \nSince the conclusion of GAL, the ELC has trialled a modified version of her own \ndesign of the CR activities, incorporating a production element plus CR tasks and \nclass discussions on the students' own writing. This integrates CR into the regular \nsyllabus and introduces a 'noticing the gap' component (Thornbury 1997) which, due \nto the research purpose, was not present in the GAL materials. Further contacts with \nthe school will show to what extent the teachers' experiences with CR has affected \nclassroom practice.  \n     \n  \n \nNOTES \n1. An earlier version of this paper was presented at the 7th International Conference of \nthe Association for Language Awareness at the University of Lleida, Spain, 19-21 \nJuly, 2004. \n2. I am grateful to the University of Leicester for granting me study leave without which \nthe timely completion of this paper would not have been possible. \n3. I am indebted to the Lycée National for giving me access to its teachers and students; \nto the teachers and students for their enthusiastic participation and, especially, to the \nEnglish Language coordinator, Ms Juheina Yakzan for her very competent and well \ninformed supervision of the implementation face.  \n 16 \n4. Since, in their regular syllabus, year 9 were studying ‘noun-clauses’ (clauses with \nnominal functions), this could have been an opportunity to reinforce that concept by \npointing out the nominal function after preposition of the untensed clause of which \n‘living’ is the verb . Identifying the unstated subject of ‘living’ should help \ndistinguish its verb function from the use of –ing participles as nouns or adjectives.  \n5. The author will be happy to make the CR activity packages used in this study \navailable to researchers wishing to conduct parallel or similar studies.  \n \nReferences  \nCarless, D. R. (2003) Factors in the implementation of task-based teaching in primary \nschools. System 31 (4), 485-500. \nCortazzi, M. & L. Jin, (1999) Cultural Mirrors; materials and methods in the EFL \nclassroom. In Hinkel, E. (ed) (1999) Culture in Second Language Teaching and \nLearning. Cambridge: Cambridge University Press. \nFotos, S. (1994) Integrating Grammar Instruction and Communicative Language Use \nthrough Grammar Consciousness-Raising Tasks. TESOL-Quarterly 28\/2: 323-49 \nGupta, D. (2004) CLT in India: context and methodology come together. ELT Journal \n58 (3), 266-269. \nHedge, T. (2000) Teaching and Learning in the Language Classroom. Oxford: \nOxford University Press. \nHolliday, A. (1999) Small Cultures. Applied Linguistics 20 (2), 237-264. \nIzumi, S. 2002. Output, input enhancement and the noticing hypothesis. Studies in \nSecond Language Acquisition.  \nKachru, B. (1985) Standards, codification and sociolinguistic realism: the English \nLanguage in the Outer Circle. In Quirk, R. & H. G. Widdowson, (eds) English in \nthe World. Cambridge: Cambridge University Press \nKaravas-Doukas, E. (1995) Teacher identified factors affecting the implementation of \nan EFL innovation in Greek public sector schools. Language, Culture and \nCurriculum 8 (1), 53-68. \nKemmis, S. & R. McTaggart, (eds) (1988) The Action Research Planner. (3rd ed.)  \nGeelong: Deakin University. \nLeeser, M. J. (2003) The Effects of Mode, Pausing, and Topic Familiarity on L2 \nLearners' Comprehension and Input Processing. Unpublished PhD Thesis, \nUniversity of Illinois at Urbana-Champaign. \nLewis, M. & F. McCook, (2002) Cultures of teaching: voices from Vietnam. ELT \nJournal 56 (2), 146-153. \nLiao, X. (2004) The need for Communicative Language Teaching in China. ELT \nJournal 58 (3), 270-272. \nMcNiff, J. & J. Whitehead, (2002) Action research : principles and practice. (2nd ed) \nLondon: Routledge Falmer. \nMohamed, N. (2004) Consciousness-raising tasks: a learner perspective. ELT Journal \n58 (3), 228-237. \nNunan, D. (1992) Research Methods in Language Teaching.  Cambridge: Cambridge \nUniversity Press. \nSchmidt, R. W. (1990) The role of consciousness in second language learning. \nApplied Linguistics 11 (2), 129-158. \nVan Patten, B. (2004) Processing Instruction: Prior Awareness and the Nature of \nSecond Language Acquisition: A (Partial) Response to Batstone. Language \nAwareness 11 (4), 240-258. \n  \n 17 \n  \n  \n \n \n \n"}