{"doi":"10.1086\/338603","coreId":"194793","oai":"oai:lra.le.ac.uk:2381\/761","identifiers":["oai:lra.le.ac.uk:2381\/761","10.1086\/338603"],"title":"First Clear Signature of an Extended Dark Matter Halo in the Draco Dwarf Spheroidal","authors":["Kleyna, J. T.","Wilkinson, M. I.","Evans, N. W.","Gilmore, G. F."],"enrichments":{"references":[{"id":44682218,"title":"Galactic Dynamics,","authors":[],"date":"1981","doi":"10.1063\/1.43925","raw":"Binney, J. J. 1981, MNRAS, 196, 455 Binney, J. J., & Evans, N. W. 2001, MNRAS, 327, L27 Binney, J. J., & Tremaine, S. 1987, Galactic Dynamics, (Princeton: Princeton Univ. Press) Dirsch, B., & Richtler, T. 1995, A&A, 303, 742 Feltzing, S., Gilmore, G., & Wyse, R. F. G. 1999, ApJ, 516, L17 Gerhard, O. E. 1994, in Proc. of the ESO\/OHP Workshop, Dwarf Galaxies, ed. G. Meylan & P. Prugniel (Garching: ESP), 335 Hargreaves, J. C., Gilmore, G., Irwin, M. J., & Carter, D. X. 1996, MNRAS, 282, 305 Irwin, M. J., & Hatzidimitriou, D. 1995, MNRAS, 277, 1354 King, I. 1962, AJ, 67, 471 Kleyna, J. T., Wilkinson, M. I., Evans, N. W., & Gilmore, G. 2002, MNRAS, submitted (astro-ph\/0109450) Klessen, R. S., & Zhao, H. 2002 ApJ, 566, 1 Kroupa, P. 1997, NewA, 2, 139 Lokas, E. 2001, preprint (astro-ph\/0107479) Mateo, M. 1998, ARA&A, 36, 435 Milgrom, M. 1983, ApJ, 270, 365 ———. 1995, ApJ, 455, 439 Odenkirchen, M., et al. 2001, AJ, 122, 2538(astro-ph\/0108100) Oh, K. S., & Lin, D. N. C. 1992, ApJ, 386, 519 Oh, K. S., Lin, D. N. C., & Aarseth, S. J. 1995, ApJ, 442, 142 Olszewski, E. W., Pryor, C., & Armandroff, T. E. 1996, AJ, 111, 750 Parmentier, G., & Gilmore, G. 2001, A&A, 378, 97 Pryor, C., & Kormendy, J. 1990, AJ, 100, 127 Sanders, R. H., & Verheijen, M. A. W. 1998, ApJ, 503, 97 Scholz, R.-D., & Irwin, M. J. 1994, in IAU Symp. 161, Astronomy from WideField Imaging, ed. H. T. MacGillivray et al. (Dordrecht: Kluwer), 535 Wilkinson, M. I., & Evans, N. W. 1999, MNRAS, 310, 645 Wilkinson, M. I., Kleyna, J. T., Evans, N. W., & Gilmore, G. 2002, MNRAS, submitted (astro-ph\/0109451)","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-12-07","abstract":"We present the first clear evidence for an extended dark matter halo in the Draco dwarf spheroidal galaxy based on a sample of new radial velocities for 159 giant stars out to large projected radii. Using a two-parameter family of halo models spanning a range of density profiles and velocity anisotropies, we are able to rule out (at about the 2.5 σ confidence level) halos in which mass follows light. The data strongly favor models in which the dark matter is significantly more extended than the visible dwarf. However, halos with harmonic cores larger than the light distribution are also excluded. When combined with existing measurements of the proper motion of Draco, our data strongly suggest that Draco has not been tidally truncated within ~1 kpc. We also show that the rising velocity dispersion at large radii represents a serious problem for modified gravity (MOND)","downloadUrl":"http:\/\/iopscience.iop.org\/article\/10.1086\/338603\/meta","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/761\/1\/APJ-10.1086-338603.pdf","pdfHashValue":"fc24467c4c7a7092e704e31d0bbd7cc93b6c01cf","publisher":"American Astronomical Society, IOP Publishing","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/761<\/identifier><datestamp>\n                2015-12-02T17:07:49Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nFirst Clear Signature of an Extended Dark Matter Halo in the Draco Dwarf Spheroidal<\/dc:title><dc:creator>\nKleyna, J. T.<\/dc:creator><dc:creator>\nWilkinson, M. I.<\/dc:creator><dc:creator>\nEvans, N. W.<\/dc:creator><dc:creator>\nGilmore, G. F.<\/dc:creator><dc:description>\nWe present the first clear evidence for an extended dark matter halo in the Draco dwarf spheroidal galaxy based on a sample of new radial velocities for 159 giant stars out to large projected radii. Using a two-parameter family of halo models spanning a range of density profiles and velocity anisotropies, we are able to rule out (at about the 2.5 σ confidence level) halos in which mass follows light. The data strongly favor models in which the dark matter is significantly more extended than the visible dwarf. However, halos with harmonic cores larger than the light distribution are also excluded. When combined with existing measurements of the proper motion of Draco, our data strongly suggest that Draco has not been tidally truncated within ~1 kpc. We also show that the rising velocity dispersion at large radii represents a serious problem for modified gravity (MOND).<\/dc:description><dc:date>\n2009-12-08T16:24:38Z<\/dc:date><dc:date>\n2009-12-08T16:24:38Z<\/dc:date><dc:date>\n2001-12-07<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAstrophysical Journal Letters, 2001, 563 (2), pp.115-118<\/dc:identifier><dc:identifier>\n0004-6388<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/761<\/dc:identifier><dc:identifier>\nhttp:\/\/iopscience.iop.org\/article\/10.1086\/338603\/meta<\/dc:identifier><dc:identifier>\n10.1086\/338603<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:relation>\nTheoretical Astrophysics<\/dc:relation><dc:rights>\nArchived with reference to SHERPA\/RoMEO and publisher website. © 2001. The American Astronomical Society. All rights reserved.<\/dc:rights><dc:publisher>\nAmerican Astronomical Society, IOP Publishing<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0004-6388","0004-6388"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007","Theoretical Astrophysics"],"year":2001,"topics":[],"subject":["Article"],"fullText":"L115\nThe Astrophysical Journal, 563:L115–L118, 2001 December 20\n\u0001 2001. The American Astronomical Society. All rights reserved. Printed in U.S.A.\nFIRST CLEAR SIGNATURE OF AN EXTENDED DARK MATTER HALO IN THE DRACO DWARF SPHEROIDAL\nJan T. Kleyna,1 Mark I. Wilkinson,1 N. Wyn Evans,2 and Gerard Gilmore1\nReceived 2001 September 19; accepted 2001 November 9; published 2001 December 7\nABSTRACT\nWe present the first clear evidence for an extended dark matter halo in the Draco dwarf spheroidal galaxy\nbased on a sample of new radial velocities for 159 giant stars out to large projected radii. Using a two-parameter\nfamily of halo models spanning a range of density profiles and velocity anisotropies, we are able to rule out (at\nabout the 2.5 j confidence level) halos in which mass follows light. The data strongly favor models in which\nthe dark matter is significantly more extended than the visible dwarf. However, halos with harmonic cores larger\nthan the light distribution are also excluded. When combined with existing measurements of the proper motion\nof Draco, our data strongly suggest that Draco has not been tidally truncated within ∼1 kpc. We also show that\nthe rising velocity dispersion at large radii represents a serious problem for modified gravity (MOND).\nSubject headings: celestial mechanics — dark matter — galaxies: individual (Draco) —\ngalaxies: kinematics and dynamics — Local Group — stellar dynamics\n1. INTRODUCTION\nThe central velocity dispersions of many Local Group dwarf\nspheroidal (dSph) galaxies are significantly larger than expected\nfor self-gravitating systems (e.g., Mateo 1998). Assuming virial\nequilibrium, the implied mass-to-light ( ) ratios reach as highM\/L\nas ∼250, making the dSph galaxies among the most dark mat-\nter–dominated systems in the universe. Given the apparent ab-\nsence of dark matter in globular clusters (e.g., Dirsch & Richtler\n1995), dSph galaxies are also the smallest dark matter–dominated\nstellar systems in the universe. As such, they have emerged as\ncrucial testing grounds for competing theories of dark matter.\nDespite their importance, dynamical models of dSph galaxies\nto date have been very simple. Most analyses have relied on\nthe use of single-mass isotropic King models, with their as-\nsociated assumptions that mass follows light and that the stellar\nvelocity distribution is isotropic (although see Pryor & Kor-\nmendy 1991 and Lokas 2001 for more general models). Hith-\nerto, the validity of such assumptions has remained unchallen-\nged because of the small size of the data sets. When only small\nnumbers of radial velocities are available, there is a well-known\ndegeneracy between mass and velocity anisotropy (e.g., Binney\n& Tremaine 1987). An increase in the line-of-sight velocity\ndispersion at large radii may by due to either (1) the presence\nof large amounts of mass at large radii or (2) tangential an-\nisotropy in the velocity distribution. The primary motivation\nof this Letter is to break this degeneracy for Draco by means\nof improved modeling and a larger data set with many more\nstars in the outer parts.\n2. DATA\nObservations were conducted from 2000 June 23 to 26 at the\n4 m William Herschel Telescope using the AF2\/WYFFOS multi-\nfiber positioner and spectrograph. A total of 284 stars were ob-\nserved, spanning the magnitude range of –19.8.V ≈ 17.0\nOf these, 159 were Draco members (extending to 25\u0001) with spec-\ntra of sufficient quality to be included in our dynamical ana-\nlyses. The median velocity uncertainty for these 159 stars was\n1.9 km s\u00011. Of our stars, 62 were previously observed by Ol-\n1 Institute of Astronomy, University of Cambridge, Madingley Road, Cam-\nbridge, CB3 OHA, UK.\n2 Theoretical Physics, University of Oxford, 1 Keble Road, Oxford, OX1\n3NP, UK.\nszewski, Pryor, & Armandroff (1996); the agreement between\nour data and the previous data is consistent with a binary fraction\nof ∼40%. Full details of the data are presented in Kleyna et al.\n(2002).\nPrevious studies (e.g., Hargreaves et al. 1996) have reported\nweak evidence of net rotational motion in Draco. N-body sim-\nulations show that tidal disruption of dSph galaxies leads to\nan apparent rotation of the remnant (Oh, Lin, & Aarseth 1995;\nKroupa 1997; Klessen & Zhao 2002). In the case of Draco,\nwhich is currently at or near pericenter (see § 3.3), the expected\naxis of rotation is perpendicular to the projection of the orbit\non the sky. In our data set, we find that Draco appears to rotate\nat 6 km s\u00011 at a radius of 30\u0001, with a rotation axis position\nangle (P.A.) of 62\u0002. However, a Monte Carlo analysis shows\nthat this rotation signal is not statistically significant (Kleyna\net al. 2002). Furthermore, the solar rest-frame proper motion\nof Draco (Scholz & Irwin 1994) implies that the axis for tidally\ninduced apparent rotation should have a P.A. of .138\u0002 \u0003 23\u0002\nThe 3 j disagreement with the observed rotation axis argues\nagainst Draco having been significantly influenced by tides, a\nconclusion supported by the lack of alignment between the\nP.A. of Draco’s major axis ( ; Odenkirchen et al. 2001,88\u0002 \u0003 3\u0002\nhereafter OD01) and its orbit.\nFrom our data set it is possible to measure the line-of-sight\nvelocity dispersion profile for a strongly dark matter–dominated\ndSph galaxy for the first time. We divide the data into radial\nbins and use Bayes’ theorem to obtain the probability distri-\nbution and uncertainties of the velocity dispersion in each2 1\/2Av S\nradial bin (see Kleyna et al. 2002 for details). The top panel\nof Figure 1 shows a plot of the radial variation of . The2 1\/2Av S\nvelocity dispersion is clearly flat or gently rising with increasing\nradius. This plot already rules out the best-fit mass-follows-\nlight King model (OD01), for which the dispersion falls to zero\nat and should have fallen to ∼0.59 times the centralr p 49\u0001.4tidal\ndispersion (or ∼5 km s\u00011) by 22\u0001.\n3. MODELING\n3.1. Jeans Equations\nThe Jeans equations for a spherical stellar system lead di-\nrectly to a model-independent mass estimator (see eqs. [4-55] and\n[4-56] of Binney & Tremaine 1987) requiring only knowledge\nof the velocity anisotropy and the true radial velocity dispersion\nL116 DRACO DARK MATTER HALO Vol. 563\nFig. 1.—Top panel: Line-of-sight velocity dispersion as a function of pro-\njected radius R. Tick marks show the 1 and 2 j error bars assuming a binary\nfraction of 40%. Bottom panel: Three-dimensional mass profiles for Draco,\nobtained using the Jeans equations.\nFig. 2.—Likelihood contours of the fit of our Draco data to the two-parameter\na, n models of Wilkinson et al. (2002). The contours are at enclosed two-\ndimensional probabilities of 0.68, 0.90, 0.95, and 0.997. The most likely value2x\nis indicated by a plus sign. The top and right panels represent the probability\ndistributions of a and n, respectively; the median of each distribution is re-\npresented by a square, and the triangles show the 1, 2, and 3 j limits. The 3 j\nlimits are omitted from the projection of a as the upper limit is strongly deter-\nmined by the cutoff at . A 40% binary fraction is assumed.ap 1\n. Assuming spherical symmetry, it is straightforward to obtain2Av Sr\nfrom the line-of-sight velocity dispersion using Abel2 2Av S Av Sr\nintegrals. We consider two dispersion profiles that bracket the\ntrue situation: (1) a flat profile with an amplitude of 9.3 km s\u00011\nand (2) a profile rising linearly from 8.5 km s\u00011 in the center to\n11.25 km s\u00011 at 22\u0001. The light is assumed to follow a Plummer\nlaw with a core radius of , as this is an excellent fit tor p 9\u0001.70\nthe star count data (Kleyna et al. 2002). The solid and dotted\ncurves in the lower panel of Figure 1 show the mass profiles\nobtained based on these two dispersion profiles, assuming ve-\nlocity isotropy. The mass enclosed within three core radii ranges\nfrom to , implying ratios of7 76.3# 10 18.0# 10 M M\/L,\n350–1000, where the V-band luminosity of Draco is 1.8#\n(Irwin & Hatzidimitriou 1995, hereafter IH95).510 L,,V\n3.2. Halo Models and Distribution Functions\nWe now use a two-parameter family of models that spans a\nrange of possibilities for Draco’s halo. The halo potential,\n, is given byw(r)\n2 2 \u0001a\/2w (1\u0002 r \/r ) if a( 0,0 0w(r)p (1)2 2 2{(v \/2) log (1\u0002 r \/r ) if ap 0.00\nThe parameter a determines the mass distribution of Draco’s\nhalo. If , the dark matter has the same density distributionap 1\nas the light. In models with , the halo has an asymp-ap 0\ntotically flat rotation curve. Finally, when , the visibleap \u00012\ndwarf lies in the approximately harmonic core of a much larger\nhalo. The distribution functions for dSph galaxy density profiles\nin potential (1) are derived in Wilkinson et al. (2002). They\ncontain a second parameter n that measures the velocity an-\nisotropy. Isotropic models have , and models with radialnp 0\n(tangential) anisotropy have ( ). We generate linen 1 0 n ! 0\nprofiles from our models by numerically integrating the dis-\ntribution functions over all transverse velocities. The line pro-\nfile is then convolved with a binary distribution and Gaussian\nvelocity measurement uncertainty profile of width j to give\n. The probability of observing an ensemble of˜L(v, R, j; a, n)\npoints with velocity and velocity uncertainty is thenR v ji ii\ngiven by the product of the -values.˜L(v , R , j ; a, n)i ii\nFigure 2 shows the likelihood contours for the model pa-\nrameters a, n assuming a 40% binary fraction. The most likely\nvalues are and , indicating a model withap \u00010.34 np \u00010.18\nsignificant dark matter at large radii and a tangentially aniso-\ntropic velocity distribution. We rule out both a mass-follows-\nlight model ( ) and a harmonic core ( ) model atap 1 ap \u00012\nthe ∼2.5 j confidence level. Our best-fit model implies a mass\ninside three core radii of . The implied V-band\u00023 78 # 10 M\u00012 ,\nratio of Draco (within three core radii, or 29\u0001) isM\/L\n∼ . This mass profile lies between the two curves in440\u0003 240\nFigure 1.\nAll our halo models (eq. [1]) have cores. Cosmological sim-\nulations favor cusped halos, such as the Navarro-Frenk-White\nprofile. The present data are insufficient to discriminate strongly\nbetween cored and cusped profiles for Draco’s dark halo—\nunlike the case of the Milky Way galaxy (Binney & Evans\n2001). Cosmological implications of data sets of dSph galaxy\nradial velocities are discussed elsewhere (Wilkinson et al. 2002,\nin preparation).\n3.3. Perigalacticon and Tidal Cutoff\nA dSph galaxy in orbit about the Milky Way is truncated\nby the Galactic tidal field during perigalacticon passages (Oh\n& Lin 1992). Based on Sloan Digital Sky Survey images of\nDraco, OD01 find no evidence for a tidal tail of Draco beyond\n50\u0001 and no break in its luminosity profile. Thus, it seems likely\nthat the actual tidal truncation radius of Draco is \u00021\u0002.\nWe use the radial velocity and proper motions to generate\npossible Draco orbits. The proper motions are given by Scholz\n& Irwin (1994) as follows: century\u00011,m cos dp 0\u0003.09\u0003 0\u0003.05a\ncentury\u00011. The line-of-sight velocity (correctedm p 0\u0003.1\u0003 0\u0003.05d\nNo. 2, 2001 KLEYNA ET AL. L117\nFig. 3.—Perigalacticon of Draco’s orbit vs. orbital eccentricity. Contours\nare 1, 2, and 3 j confidence levels. Overplotted solid curves show the rela-\ntionship between perigalacticon and eccentricity assuming the labeled values\nof the tidal radii and our best-fit model for Draco’s halo. The dotted curve\nshows the earlier King model fit to Draco. The solid curves in the top and\nright panels are the probabilities of e and , respectively, and the dashedDp\ncurve in the right panel shows the distribution of assuming no proper motionDp\ninformation.\nfor the solar motion) is km s\u00011, while the distance\u000198\u0003 1\nof Draco is kpc (Mateo 1998). We represent the Ga-82\u0003 7\nlactic potential by (e.g.,2 2 2 1\/2w(r)p v log {[(a \u0002 r ) \u0002 a] \/r}0\nWilkinson & Evans 1999), where the scale length is a ∼\n170 kpc and the normalization is obtained by taking thev0\ncircular speed to be 220 km s\u00011 at the solar radius. We assume\nlognormal errors on a with a 3 j range from 44 to 489 kpc;\nthese limits correspond to masses within 100 kpc of 4.6#\nand , respectively. Assuming Gaussian11 1210 M 1.1# 10 M, ,\nerrors on all other observed quantities, we generate sets of\ninitial conditions consisting of a position and velocity for Draco\nand a scale length for the Milky Way. Each set is integrated\nin the Galactic potential for a few orbital periods, and the\nperigalacticon and eccentricity e of the orbit are determined.Dp\nDynamical friction is unimportant on such short timescales.\nThe contours in Figure 3 show the 1, 2, and 3 j limits on the\nperigalacticon and eccentricity of Draco’s orbit. While the dis-\ntribution of eccentricities is roughly flat in the range [0.3, 0.95],\nthe distribution of perigalacticons is strongly peaked at ∼75 kpc.\nThis suggests that Draco is currently at or close to peri-\ngalacticon.\nThe tidal radius for a dSph galaxy moving in the above\nGalactic potential is given by (see King 1962)\n3 2 2 2 \u00011M (r )D (1\u0002 e) a(a \u0002 2D )D t p p3r p (w \u0001 w )\u0002 , (2)t p a2[ ]2 2 3\/2M (1\u0001 e) 2ev (a \u0002 D )G p0\nwhere is the mass of Draco within radius , is theM (r ) r MD t t G\ntotal mass of the Galaxy, and and are the values of thew wp a\npotential at perigalacticon and apogalacticon. The solid curves\nin Figure 3 show the variation of with e assuming a rangeDp\nof values for . Only models with fall within the 1 jr r 1 3\u0002t t\ncontour of Draco’s perigalacticon and eccentricity derived from\nits space velocity.\nIf Draco had recently been subject to strong tidal forces, we\nwould expect significant elongation of the stellar distribution, in\nconflict with the roundish ( ) appearance of Draco on theep 0.3\nsky and the absence of tidal tails (OD01). Chance alignment\neffects (e.g., Kroupa 1997) are unlikely to be responsible for\nDraco’s regular appearance. Since any tidal extension of Draco\nshould be aligned with its orbit, elongation approximately along\nthe line of sight would require Draco’s orbit to be similarly\naligned. However, Monte Carlo sampling of the orbital velocities\nusing the observational error bars rules out alignment within 45\u0002\nwith 98% confidence, assuming that the prior probability (with\nno proper motion information) of the line-of-sight angle is uni-\nform. The absence of statistically significant apparent rotation\nargues further against line-of-sight elongation.\n4. MODIFIED NEWTON DYNAMICS AND DRACO\nAs an alternative to dark matter, Milgrom (1983) proposed\na modification to Newton’s law of gravity (MOdified Newto-\nnian Dynamics, or MOND) at low accelerations. A number of\nattempts have been made to apply MOND to the dSph galaxies\nof the Milky Way (Gerhard 1994; Milgrom 1995). These used\nonly the global velocity dispersion to obtain a MOND M\/L\nratio and were unable to construct an unambiguous case for or\nagainst MOND. Lokas (2001), using published velocities, ob-\ntained MOND fits to the dispersion profiles of several dSph\ngalaxies, treating the global MOND acceleration scale as a free\nparameter.\nWe model the luminosity density of Draco using a Plum-I(r)\nmer sphere with core radius . The velocity anisotropy param-r0\neter b (Binney 1981) is assumed to vary with radius as\n, yielding a velocity distribution that2 2 2b(r)p (g\/2)r \/(r \u0002 r )0\napproaches isotropy in the center and becomes increasingly\nradial (tangential) if g is positive (negative). With these as-\nsumptions, the Jeans equations can be integrated to obtain the\nradial velocity dispersion as2j (r)r\n\u0003\n12 2 2 g\/2j (r)p \u0001 (r \u0002 r ) I(r)g (r)dr, (3)r \u0001 0 M2 2 g\/2I(r)(r \u0002 r )0 r\nwhere is the MOND acceleration due to the mass interiorg (r)M\nto radius r. The central projected V-band luminosity density\nis kpc\u00012 (IH95). Since all of the mass in the6I 2.2# 10 L0 ,\nMOND picture is provided by the stars, the Newtonian accel-\neration is given simply by , where2g (r) g (r)p \u0001GM (r)\/rN N ∗\nthe stellar mass is obtained from and depends onM (r) I(r)∗\nthe ratio of the stars. The MOND acceleration is thenM\/L\nobtained via , where cm s\u00012\u00018g p g \/m(g \/a ) a p 2# 10M N M 0 0\nis the MOND acceleration scale, for , andm(x) r 1 x k 1\nfor . Our assumed is an upper limit to them(x) r x x r 0 a 0\nlikely value (Sanders & Verheijen 1998) and favors models\nwith lower stellar ratios.M\/L\nOur analysis assumes that Draco is an isolated MOND stellar\nsystem. This is justified by noting that for stars between ∼1\u0001.7\nand ∼20\u0001, the acceleration due to the baryonic mass of the\nMilky Way disk (∼ ) at the distance of Draco is106# 10 M,\nsmaller than the internal accelerations. Since only ∼10% of our\nsample lies outside 20\u0001, the assumption of isolation is reason-\nable. Representing a slightly flattened light distribution by a\nspherical model has greater impact when applying MOND since\nall the mass is in the stars. However, in the case of Draco this\neffect is not significant as our spherical model underestimates\nL118 DRACO DARK MATTER HALO Vol. 563\nthe mass interior to radius r by \u000420%, resulting in ratiosM\/L\nthat are at most 20% overestimated.\nUsing equation (3) and the expression for the velocity an-\nisotropy, we calculate the projected velocity dispersions, from\nwhich we obtain the MOND line profiles (assumed Gaussian).\nThese are convolved with the binary velocity distribution and\nthe error distribution to obtain the observable line profiles.\nUsing these profiles, we analyze the velocity data set as in\n§ 3.2, except that the model parameters are now the stellar\nratio and the velocity anisotropy. Again we find that someM\/L\ntangential anisotropy is required to reproduce the flat projected\nvelocity dispersion profile. More interestingly, the most likely\nratio is 19, with a 3 j lower limit of 8.6. The assumedM\/L\nvalue of implies a total luminosity of out to5I 3.2# 10 L0 ,\n, approximately the 2 j upper limit of the V-band luminosity3r0\n(IH95). Our lower bound is therefore a true lower limit on the\nMOND ratio of Draco.M\/L\nEstimates of the ratio of Draco’s stellar populationM\/L\nbased on comparison with globular clusters have a 3 j range\nof 1–4.3 (Parmentier & Gilmore 2001; Feltzing, Gilmore, &\nWyse 1999). Even our 3 j lower limit on the MOND ratioM\/L\nof Draco is at variance with these values. Thus, even by mod-\nifying the law of gravity as prescribed by MOND, we are unable\nto explain the observed motions of Draco’s stars without the\npresence of significant quantities of dark matter.\n5. DISCUSSION AND CONCLUSIONS\nThis Letter has presented a new set of radial velocities for\n159 stars in the Draco dSph galaxy. Our data extend to ∼25\u0001\nand are the first observations to probe the outermost regions\nof a strongly dark matter–dominated dSph galaxy. The velocity\ndispersion profile is flat or slowly rising at large radii, which\nprovides the first clear signature of an extended dark matter\nhalo in any dSph galaxy. We analyze these data using both the\nJeans equation and halo models with distribution functions.\nOur best-fit model has a total mass within of′3r ≈ 290\nand a slightly tangentially anisotropic velocity\u00023 78 # 10 M\u00012 ,\ndistribution. We are able to rule out the traditional mass-\nfollows-light models and extended harmonic core models at\nabout the 2.5 j significance level.\nFrom orbit integrations in a Galactic potential, we argue that\nDraco is currently close to perigalacticon, and its actual tidal\nradius is greater than 1\u0002, several times the characteristic length\nscale of the luminous matter. Draco’s lack of significant ap-\nparent rotation and the significant misalignment of its major\naxis with its orbit argue against tidal forces having played a\nmajor role in its evolution. Our results also have consequences\nfor the modified Newton dynamics (MOND): a Bayesian ana-\nlysis of the observational data, incorporating radially varying\nvelocity anisotropy, yields a 3 j lower limit of 8.6 on the\nMOND ratio, still requiring the presence of a significantM\/L\namount of dark matter in Draco.\nN. W. E. is supported by the Royal Society, while M. I. W.\nand J. K. acknowledge help from PPARC. The authors grate-\nfully thank Colin Frayn for help during the observations and\nMike Irwin, Hong Sheng Zhao, and the referee Slawomir Piatek\nfor valuable discussions.\nREFERENCES\nBinney, J. J. 1981, MNRAS, 196, 455\nBinney, J. J., & Evans, N. W. 2001, MNRAS, 327, L27\nBinney, J. J., & Tremaine, S. 1987, Galactic Dynamics, (Princeton: Princeton\nUniv. Press)\nDirsch, B., & Richtler, T. 1995, A&A, 303, 742\nFeltzing, S., Gilmore, G., & Wyse, R. F. G. 1999, ApJ, 516, L17\nGerhard, O. E. 1994, in Proc. of the ESO\/OHP Workshop, Dwarf Galaxies,\ned. G. Meylan & P. Prugniel (Garching: ESP), 335\nHargreaves, J. C., Gilmore, G., Irwin, M. J., & Carter, D. X. 1996, MNRAS,\n282, 305\nIrwin, M. J., & Hatzidimitriou, D. 1995, MNRAS, 277, 1354\nKing, I. 1962, AJ, 67, 471\nKleyna, J. T., Wilkinson, M. I., Evans, N. W., & Gilmore, G. 2002, MNRAS,\nsubmitted (astro-ph\/0109450)\nKlessen, R. S., & Zhao, H. 2002 ApJ, 566, 1\nKroupa, P. 1997, NewA, 2, 139\nLokas, E. 2001, preprint (astro-ph\/0107479)\nMateo, M. 1998, ARA&A, 36, 435\nMilgrom, M. 1983, ApJ, 270, 365\n———. 1995, ApJ, 455, 439\nOdenkirchen, M., et al. 2001, AJ, 122, 2538(astro-ph\/0108100)\nOh, K. S., & Lin, D. N. C. 1992, ApJ, 386, 519\nOh, K. S., Lin, D. N. C., & Aarseth, S. J. 1995, ApJ, 442, 142\nOlszewski, E. W., Pryor, C., & Armandroff, T. E. 1996, AJ, 111, 750\nParmentier, G., & Gilmore, G. 2001, A&A, 378, 97\nPryor, C., & Kormendy, J. 1990, AJ, 100, 127\nSanders, R. H., & Verheijen, M. A. W. 1998, ApJ, 503, 97\nScholz, R.-D., & Irwin, M. J. 1994, in IAU Symp. 161, Astronomy from Wide-\nField Imaging, ed. H. T. MacGillivray et al. (Dordrecht: Kluwer), 535\nWilkinson, M. I., & Evans, N. W. 1999, MNRAS, 310, 645\nWilkinson, M. I., Kleyna, J. T., Evans, N. W., & Gilmore, G. 2002, MNRAS,\nsubmitted (astro-ph\/0109451)\n"}