{"doi":"10.1007\/BF02681655","coreId":"65368","oai":"oai:dro.dur.ac.uk.OAI2:6089","identifiers":["oai:dro.dur.ac.uk.OAI2:6089","10.1007\/BF02681655"],"title":"McTaggart and the unreality of time.","authors":["Ingthorsson,  R. D."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1998-12-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65368.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6089\/1\/6089.pdf","pdfHashValue":"d1414873feb68f600e437f3375478b9f803d91a0","publisher":"Kluwer","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6089<\/identifier><datestamp>\n      2011-11-25T09:56:28Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        McTaggart and the unreality of time.<\/dc:title><dc:creator>\n        Ingthorsson,  R. D.<\/dc:creator><dc:subject>\n        McTaggart<\/dc:subject><dc:subject>\n         Time<\/dc:subject><dc:subject>\n         Metaphysics.<\/dc:subject><dc:publisher>\n        Kluwer<\/dc:publisher><dc:source>\n        Axiomathes, 1998, Vol.9(3), pp.287-306 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        1998-12-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6089<\/dc:identifier><dc:identifier>\n        issn:1122-1151<\/dc:identifier><dc:identifier>\n        issn: 1572-8390<\/dc:identifier><dc:identifier>\n        doi:10.1007\/BF02681655<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6089\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1007\/BF02681655<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6089\/1\/6089.pdf<\/dc:identifier><dc:rights>\n        The original publication is available at www.springerlink.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1572-8390","issn:1122-1151"," 1572-8390","1122-1151"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":1998,"topics":["McTaggart","Time","Metaphysics."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n07 October 2009\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nIngthorsson, R. D. (1998) ’McTaggart and the unreality of time.’, Axiomathes., 9 (3). pp. 287-306.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1007\/BF02681655\nPublisher’s copyright statement:\nThe original publication is available at www.springerlink.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \nDurham Research Online \n \nDeposited in DRO: \n07 October 2009 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status of attached file: \nAccepted for publication \n \nCitation for published item: \nIngthorsson, R. D. (1998) 'McTaggart and the unreality of time.', Axiomathes., 9 (3). pp. 287-\n306. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1007\/BF02681655 \n \nPublishers copyright statement: \nThe original publication is available at www.springerlink.com \n \n \n \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nMCTAGGART AND THE UNREALITY OF TIME \nRögnvaldur Ingthorsson \nJohn M.E. McTaggart’s (1866-1925) famous argument for the unreality of \ntime really is a peculiar artefact in the history of philosophy. Despite that \nMcTaggart’s conclusion has been generally rejected, his views on tense has \nbeen widely accepted, e.g. in modern tense-logic.1 His terms for the different \nways events appear to be positioned in time, the A- and B-series, have even \ncome to be used to characterise the two dominating views in the philosophy \nof time today: the A- and B-view of time, or as is often said, the tensed and \ntenseless view of time.  \nMcTaggart distinguished between two ways that events appear to be \npositioned in time and claimed that they implied quite different ontological \nconceptions of time. On the one hand events are earlier than and later than \neach other, and on the other hand events are either future, present or past. \nMcTaggart claimed that events hold permanent positions in terms of being \nearlier than and later than each other, but were continuously changing their \npositions in terms of being first future, then present, and finally past. Taken \nseparately, both ways imply a conception of time as being constituted by a \nseries of positions. McTaggart chose to call that series whose positions are \ndetermined only as earlier and later than each other the B-series, but the \nseries whose positions are determined as future, present and past the A-\nseries.  \nThe so called A- and B-views correspond crudely to McTaggart’s A- and \nB-series in the way that the B-view denies that the distinction of time into \nfuture, present and past are objective features and holds that the relations of \nearlier than and later than are the fundamental characteristics of time. The B-\nview claims that the experience of now and the transitory relation of events \nto now is a mere subjective creation. The A-view, on the other hand, holds \nthat the apparent transition from future to past through the present is the \nfundamental characteristic of time and an objective feature of reality in some \nway or another. \n                                                \n1 Needham (1975, p. 1). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nA second more controversial part of McTaggart’s argument is his claim \nthat because the relations of the B-series are permanent it cannot on its own \naccount for change and, assuming change to be an essential characteristic of \ntime, that the B-series could therefore not be properly characterised as \ntemporal. According to McTaggart the positions of the B-series were \ndependent on the reality of the A-series for being in time at all. \nA third equally controversial part is the claim that the change of positions \nin A-series fashion involves a contradiction and that time must therefore be \nunreal. It is the ontological nature of this alleged contradiction that is the \nsubject of this paper. A naive form of the contradiction can initially be stated \nlike this: \n1. Future, present and past are incompatible properties, but  \n2. in time every event appears to possess them all, and  \n3. these two propositions entail the contradiction that events have \nincompatible properties. \nThe proponents of the B-view tend to accept McTaggart’s claim that the A-\nseries entails a contradiction but reject that the B-series does not contain \nchange.2 The proponents of the A-view have on the other hand rejected \nMcTaggarts claim that the A-series entails a contradiction and claim that \nthey cannot see that he, or the proponents of the B-view, gives any \nsatisfactory justification for this claim.  \n2. The A- and B-views on the notion of succession \nNathan Oaklander has suggested that the disagreement between the A- and \nB-view on McTaggart’s claim that the A-series entails a contradiction \nrevolves around the ontological status of succession.3 Oaklander, himself a \nproponent of the B-view, refers to the debate between himself and Quentin \nSmith, a proponent of the A-view, as being representative for this \ndisagreement. Oaklander argues that Smith cannot account for the \nsuccessive possession of incompatible temporal properties: “Smith simply \n                                                \n2 Whether or not the B-series does contain change is a controversial issue that cannot \nbe addressed properly here. I will be content with simply stating McTaggart’s claims on \nthis issue.  \n3 Oaklander (1996)  \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nclaims that an appeal to succession avoids the contradiction that McTaggart \nfinds in temporal attributions, but he does not offer an argument.”4 And \nSmith rebuts: “But Oaklander gives no justification for this assumption. Like \nMcTaggart he simply asserts that whatever possesses the three temporal \nproperties must possess them simultaneously.”5  \nBoth Smith and Oaklander recognise that the arguments of both sides are \nin some sense incommensurable to the view of the other on this matter: \nIndeed, a reader of the literature on McTaggart’s paradox might well come \naway with an impression of futility, a sense that the debate repeatedly ends in \nthe same impasse, with the tensers predictably making a certain move and the \ndetensers predictably responding with a certain countermove.6 \nThe situation can be summarised like this. The B-view demands that the A-\nview gives a plausible account of the successive possession of temporal \nproperties while the A-view demands that the B-view justifies that there is a \nproblem with this kind of succession at all. This is a curious stalemate \nsituation and I think it might be interesting to consider again the reasons why \nMcTaggart claimed that the A-series entails a contradiction and \nconsequently rejected both views.  \nI will attempt to show that McTaggart’s claim that the A-series entails a \ncontradiction is neither wholly unfounded nor obscure, by showing how his \nidealistic ontology of the general nature of the existent and real guides his \nreasoning in every step of the argument for the unreality of time. This has to \nthe best of my knowledge never been done. The argument for the unreality \nof time in The Nature of Existence (NE)7 has always been treated by \ncommentators as a self-contained argument independent of the rest of \nMcTaggart’s ontological system.8 I will try to show that this is a mistake, \nand that it is because of this that McTaggart’s reasons for claiming that the \nA-series entails a contradiction have been considered to be obscure. \nMcTaggart himself clearly intended the argument and its conclusion, which \n                                                \n4 Oaklander (1994, p. 195). \n5 Smith, (1993, p. 174). \n6 Smith (1994a, p. 202). \n7 McTaggart (1988) \n8 This is the case even with C.D. Broad in his admirable Examination of McTaggart’s \nPhilosophy (1938, vol. 1, p. 9). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nis in vol.2 [of NE], to be treated as dependent on the ontology that he had \npresented in vol.1. I have no ambitions, nor hope, in proving him right, but I \nhope that my account may provide some kind of clarification that may be \nuseful in making the debate between the proponents of the A- and B-views \nregarding the alleged contradiction of the A-series less incommensurable. \nBut I am afraid it is not going to be an easy reading. McTaggart’s argument \nhas been muddling the brains of philosophers for some 90 years now, which \nindicates that it is indeed no easy matter.9  \n3. The structure of McTaggart’s reasoning in The Nature of Existence \nThe argument for the unreality of time is to be found in the beginning of the \nsecond volume of NE.10 In the first volume of that work McTaggart \n‘determines’ the nature of the existent in general without, as he claims, \ntaking anything specifically existing into consideration.11 McTaggart \nhimself characterizes his ontology as an idealistic ontology in the spirit of \nBerkeley, Leibniz and Hegel.12 In the second volume, however, he looks at \ncertain empirical features of existing entities, e.g. that they all appear to be \ntemporal and some of them material. Both features are such, he concludes, \nthat they can impossibly belong to anything really existing, according to the \ngeneral nature of the existent and real that he determined in the first volume \nof NE:  \nIt will be possible to show that, having regard to the general nature of the \nexistent as previously determined, certain characteristics, that we consider \nhere for the first time, cannot be true of the existent[...]13  \nThis structure of NE is made exquisitely clear by McTaggart but is \napparently overlooked by most readers of the argument for the unreality of \ntime. I believe that this is the main reason why the outlook of McTaggart’s \nargument is still a subject of controversy.  \n                                                \n9 McTaggart first presented his thoughts on this matter in an article in Mind in 1908 \n(1934). I will however only discuss the mature version of it contained in (1988). \n10 McTaggart (1988, vol.2, Ch. 33)  \n11 McTaggart (1988, vol.1, Ch. 3). \n12 McTaggart (1988, vol.1, sect. 52). \n13 [italics are mine, RI], McTaggart (1988, vol.2, sect. 298). McTaggart makes an \nalmost identical statement in vol.1, sect. 54. \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nThe purpose of this paper is to provide the reader with a short account of \nthe fundamentals in McTaggart’s ontology and to show how it affects the \nargument for the unreality of time, especially how it relates to the alleged \ncontradiction of the A-series. I hope that this will contribute to a deeper \nunderstanding of McTaggart’s argument. But first we must get better \naquainted with the argument and its baffling conclusion. \n4. A short reconstruction of the argument \nAs mentioned earlier McTaggart distinguished between two ways that events \nare believed to be positioned in time and claimed that they implied two quite \ndifferent ontological conceptions of time. The way events are perceived to \nbe simultaneous with certain events, earlier than some other events and later \nthan the rest, gives us a conception of a series of positions that runs like \nbeads on a string from earlier to later or conversely, i.e. the B-series. Events \nare also perceived to be either future, present or past and this gives us a \nconception of a series of positions that runs from the far future to the \npresent, and from the present to the distant past, or conversely, i.e. the A-\nseries. It might seem strange to describe the A-series to run from future to \npast or conversely, and it must therefore be noted that it is not the positions \nthat change positions, but the events. The fundamental difference between \nthe two series are that while events appear to change their positions in \nrespect of A-series positions, from future, to present and to past, then their \npositions in terms of B-series positions are permanent and do not change; no \nevent is at one time earlier than some other event and at another time later \nthan that same event.14 McTaggart assumed that time is universally believed \nto involve change, and because he could not detect any change in the B-\nseries he concluded that it could not properly be called temporal.15 The A-\nseries however at least appears to involve change; the transition of events \nfrom the future to the present and into the past.16  \nMcTaggart claimed that future, present, and past are clearly relations and \nnot qualities, although, like all relations, they generate relational qualities in \n                                                \n14 McTaggart (1988, vol.2, sect. 305-306). \n15 McTaggart (1988, vol.2, sect. 309-310). \n16 For an account of other possible kinds of changes and how McTaggart rules them \nout see (McTaggart 1988, vol.2, sect. 309-315). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nthe entities they relate.17 But he could not determine as to what entity \nexactly the events stood in these relations and consequently to what they \nchanged their relations to. McTaggart began to look for this change in the \nrelations that hold between the events in the series but concluded that it is \nnot to be found there. Every event in the A-series is changing its positions \nuniformly in the same direction, which can be seen by the permanence of \ntheir B-series relations; no event is first future, then present and finally past \nin relation to another event. McTaggart claimed that the same problem arises \nwhen saying that it is relations to moments of time or positions of time that \nchange, if these are taken as separate entities, because these are entities that \nthemselves must aquire their temporal properties through a relation.18  \nMcTaggart came to the conclusion that the A-series is dependent on some \nthing or other outside the series to which the entities in the series, whatever \nthey may be, events or moments of time, change their relation to, but which \nitself does not change.19 McTaggart did not himself introduce the notion of \n‘now’ as this something outside the series. He rested content in saying that it \nwould not be easy to find such a term, but there must exist one if the A-\nseries is to be real. But even if the existence of such an entity was granted, \nand thereby the reality of the relational properties of future, present and past, \nthere remains a contradiction he claimed.20  \nFuture, present and past are then taken as relational properties that events \npossess by holding a relation to something unknown, whether this is some \nsort of container-time, a now or whatever, is left unsaid. They are however \nincompatible temporal positions because nothing can be future, present and \npast in relation to the same thing all at once. And yet in time as a whole \nevery event has them all, and this, McTaggart claims, involves a \n                                                \n17 McTaggart (1988, vol.2, sect. 326-328. \n18 McTaggart (1988, vol.2, sect. 327).  \n19 McTaggart (1988, vol.2, sect. 327). \n20 McTaggart (1988, vol.2, sect. 328). Broad believed that McTaggart considered the \nnecessary existence of an unknown entity to be a convincing but not conclusive reason to \naccept the other parts of his argument, Broad calls this the Subsidiary Argument (Broad \n1938, vol.2, pp. 317-318). Nevertheless, McTaggart proceeds, for the sake of argument, \nassuming the existence of such an entity in relation to which the members of the series \nhold the simple relational properties of futurity, presentness and pastness (see also \n(McTaggart 1988, vol. 2, footnote 1, p. 22).  \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \ncontradiction. It is at this point readers usually begin to be baffled and even \nresentful. Events, it is objected, are never future, present and past \nsimultaneously, but well enough successively, and in that there is no \ncontradiction. This is indeed Broad’s main reason for rejecting McTaggart’s \nconclusion: \nI cannot myself see that there is any contradiction to be avoided. When it is \nsaid that pastness, presentness and futurity are incompatible predicates, this is \ntrue only in the sense that no one term could have two of them simultaneously \nor timelessly. Now no term ever appears to have any of them timelessly, and \nno term ever appears to have any of them simultaneously. What appears to be \nthe case is that certain terms have them successively. Thus there is nothing in \nthe temporal appearances to suggest that there is a contradiction to be \navoided.21  \nWell, it is at least clear from the text in NE that McTaggart was perfectly \naware of the fact that events do not appear to be nor are believed to be \nfuture, present and past simultaneously but well enough successively:  \nIt may seem that this can be easily explained. Indeed, it has been impossible \nto state the difficulty without almost giving the explanation, since our \nlanguage has verb-forms for the past, present, and future, but no form that is \ncommon to all three. It is never true, the answer will run, that M is present, \npast, and future. It is present, will be past, and has been future. [...] The \ncharacteristics are only incompatible when they are simultaneous, and there is \nno contradiction to this in the fact that each term has all of them \nsuccessively.22  \nIt seems then that his reasons stem from some other source than a simple \nmistake in analysing the experience of time or the proper rules of temporal \npredication. He is aware that events never appear to hold the temporal \npositions simultaneously but well enough successively, he is aware that \nlanguage does not imply that an event has all three tenses simultaneously, \nand yet he claims that a proposition about any event e that it ‘has been \nfuture, is present and will be past,’ implies that e has them all and that this \ninvolves a contradiction. Why does Broad, Smith and other A-view \nproponents see succession as a simple solution to the contradiction while \nMcTaggart and B-view proponents like Oaklander do not, even when the \nappearance of succession is an admitted empirical phenomenon by all?  \n                                                \n21 Broad (1938, vol.2, p. 313). \n22 McTaggart (1988, vol. 2, sect. 330). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nThe B-view is in fact committed to accept one sense of successive \npossession of properties; the possession of different properties at different \ntimes. Hugh Mellor even goes so far as saying: “A change, then, is a thing \nhaving incompatible real properties at different times.”23 But if the \nproponents of the B-view can admit that a thing can change in the sense of \nfirst being red at t and then not red but, lets say blue, at t’, thus having in \nsuccession, or at different times, properties that are clearly incompatible, \nwhy can they not accept that an event can first be future and then present? \nWell the answer is that the B-view accepts the possession of incompatible \nproperties as long as they are possessed one at a time. The contradiction \ninvolved in having A-series temporal properties, according to the B-view, is \nthat events never possess any simple A-series temporal characteristic at any \nsingle time t, but always a combination of the three incompatible properties \nfuture, present and past, at any time. This could be made clear by \nMcTaggart’s views on beliefs that “[...]assert that the presence of one \ncharacteristic implies the presence of another”.24 On his view anything \npossessing the characteristic of being a unilateral triangle implies that it has \nan angle sum of 180°, which entails no contradiction. Now, being blue does \nnever imply the possession of being red, or any other incompatible property, \nbut being either future, present or past always implies the possession of the \nother two; an event that is future is in a sense determined to possess the \nproperty of being present and past. Future events are bound to become \npresent, which in a sense implies that presentness inheres in the event at the \nsame time that it is future, and so does pastness.25 Succession is of course no \n                                                \n23 [italics are mine, R.I.] Mellor (1981, p. 110). Mellor’s account of change is in line \nwith how Russell once defined change: “Change is the difference, in respect of truth or \nfalsehood, between a proposition concerning an entity and a time T and a proposition \nconcerning the same entity and another time T’, provided that the two propositions differ \nonly by the fact that T occurs in the one where T’ occurs in the other.” (1972, p. 469). \nMellor however claims that it:“[...] will not do to define change as variation through time, \nif time itself can only be defined as the dimension of change.” Mellor therefore proposes \nthat change must be explained in terms of causation, but without accepting the reality of \ntenses (Mellor 1981, p. 7-8). \n24 McTaggart (1988, vol.1, sect. 26-31). \n25 Smith proposes a tensed theory of such inherences, admits that there is an infinite \nregress of inherence relations, but claims that it is not vicious. A full account of Smith’s \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nsolution to the contradiction of having at every moment different \ncombinations of incompatible characteristics but there is controversy \nregarding the claim that this kind of implication is equal to actually \npossessing the implied characteristic.  \nIt seems then that the B-view of time is dependent on showing that \nsuccessive possession of temporal properties is not possible because they, as \nopposed to other properties, can never be had one at a time. The B-view \nmust show that if anything has one of them it has them all. The \ndisagreement, then, between the A-and B-view is not about succession in \ngeneral but whether or not temporal properties can be possessed in the usual \nsense of succession. This provides us with an interesting contrast to \nMcTaggart. To him it is equally contradictory that a substance has \nincompatible colour properties in succession as having temporal properties \nin succession. He would claim that the incompatible properties really \nbelonged to numerically distinct substances that were parts of a compound \nsubstance, united by some common property, other than colour, and that this \ncompound substance was misperceived as changing although in reality its \nparts have always possessed these properties and always will possess them. \nSo to me it seems that in relation to McTaggart the B-view will have to \nprovide an account of the possibility of change that allows the possession of \nincompatible properties other than tenses. Mellor, for one, argues that \ncausation will do the job.26 \n5. The infinite regress of temporal properties \nIn sect. 332 of NE vol.2, McTaggart claims that if it was objected that \ntemporal properties were not had simultaneously but successively it would \nunavoidably result in a vicious infinite regress of ever more complex \ncombinations of incompatible tenses. This section, and adjoining sections, is \napparently believed to be the key sections of the whole argument. Modern \nwriters like Mellor and Michael Dummett have provided defences of the \nsoundness of McTaggart’s infinite regress argument, but I will attempt to \n                                                                                                                                            \ntheory is found in (1993). For a comprised account of his views on the infinite regress see \nSmith (1994b, 180-194).  \n26 Mellor (1981, p. 8). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nexplain the contradiction without invoking this line of reasoning.27 I believe \nthat my account is logically independent of it. My explanation only assumes, \nas I believe McTaggart does, that the notion of successive possession of A-\nseries temporal properties presupposes that at some point t1 in time an event \ne actually is future, at some point t2 in time e actually is present, and at some \npoint t3 in time e actually is past. I assume that all can accept this to be \nnecessary truth conditions for speaking truly about the successivity of \nfuturity, presentness and pastness; if an event e never ‘is future’ it can never \nbe ‘has been future’ either, and if e never ‘is present’ it can never be ‘will be \npast’, and if e never ‘is past’ it will always be false that e ‘will be past’. I \nwill attempt to show how the presupposition of just these three necessary \nfacts entails a contradiction, if McTaggart’s ontology is presupposed.  \nThe proposed explanation is consequently not open to objections that \ntenses are possessed successively, or to objections that sentences like ‘has \nbeen future’ only appear to imply simultaneous possession of incompatible \ntenses (e.g. being future now) when failing to recognise the proper nature of \ntemporal predication. Expressions like ‘will be past’ do for instance not refer \nto the present, but to some other time when e possesses a different property \nthan it does at the time the expression is uttered. E.J. Lowe and Evan Fales, \namong others, have claimed that McTaggart’s problem is based on a \nconfusion concerning the indexical nature of predicates like ‘present’ and \n‘now’. They claim that the indexical nature of these predicates enables us to \npick out successive moments in time.28 But McTaggart is in fact assuming \nthat the reality of time is dependent on the truth of what they are claiming, \ni.e. that it is necessary that events possess temporal predicates successively, \nand that language does appear to pick out the times when events possess this \nand that temporal property. It is the existence of the reality thus described by \nlanguage that he is rejecting because it is in conflict with the ontology that \nhe has previously determined. My explanation will focus on how the notion \nof time, as involving the successive possession of temporal properties by \nevents, clash with what McTaggart thinks is the necessary characteristics of \nanything existing and real. At this point let it suffice to say that McTaggart’s \n                                                \n27 Mellor (1981, pp. 92-102) & Dummett (1960). \n28 Lowe (1987) & Fales (1990, p. 265). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nontology requires that time, as well as every other really real entity, must be \nshown to be an existing whole, a substance, or compound substance \nconstituted by coexisting parts, if it is to be real at all. If every event is then \nsupposed to have at least three incompatible positions in such a coexisting \nwhole, i.e. positions they cannot coexist in, how can the positions be \ncoexistent constituents of time? Well, they cannot! It would require that \nevery event had three coexistent incompatible temporal properties and that \ninvolves a contradiction. \nUsually we need an answer to a problem, but in this case we need to \nexplain what the problem is in order to understand the answer. In order to \nfully understand this explanation we must first become familiar with the \nfundamental principles in McTaggarts ontology and use it to clarify the \nontological status of the notions of event, position, series of positions, \nmoments of time, and their mutual relations in McTaggart’s philosophy.  \n6. McTaggart’s ontology: Criteria of reality for time as a ‘series’29 \nTo acquire proper understanding of McTaggart’s train of thought it is \nnecessary to become familiar with his ontology of the nature of the existent. \nThere is no room for a thorough exposition of his argumentation on this \nmatter. I will only present relevant conclusions about the nature of such \nnotions as existence, reality, substance, property and relation in the form of \npostulates and only provide a short clarification when needed. I will also \npresent his views on how our beliefs relate to the real facts they are about. \nThis involves notions like belief, assumption, fact, truth and falsity. When \nthis is done I will try to show how McTaggart’s views on these matters \ndetermines his conclusion about the nature of time. McTaggart himself \nbelieved these notions to be indefinable, i.e. only ideally determinable, and \nmuch of what he proposes to adopt about them to be widely accepted.30 \nReality admits of no degrees; either something is real or it is not.31 We \noften say that something can be real for someone without really admitting \nthat this something exists. We might grant someone to have had an \nexperience of seeing a ghost even if we do not believe that ghosts really \n                                                \n29 For a critique of McTaggart’s ontology see, Broad (1938) & Airaksinen (1975) \n30 McTaggart (1988, vol.1, sect. 2, 60, 67 & 78).  \n31 McTaggart (1988, vol.1, sect. 2, Ch. 1 & 2). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nexists. The ghost is therefore only real for someone in the sense that the \nexperience of seeing a ghost exists as a mental state in a consciousness while \nthe subject of that experience does not correspond to anything objectively \nreal in the world. \nExistence is coextensive with the real; everything that exists is real, and \nthere can be nothing real that does not exist. Even if this was false, i.e. that \nsomething was real that did not exist, it would be of no practical \nconsequence to us.32 There is therefore no sphere of possible existents that \nhave not yet been realised; existence does not admit of degrees either.33 \nPossibilities, other than those simply informing about our ignorance of what \nactually does obtain, are always assertions about the implication of one \ncharacteristic by another and then correspond to existing facts.34  \nThat which exists must have some other nature than existence, viz. it \nmust have properties.35 The existence of properties presupposes the \nexistence of substances that holds the properties; there can never exist a \nproperty without substance and there can not be any substances without \nproperties: \nSomething must exist, then, and have qualities, without being itself either a \nquality or a relation. And this is Substance[...] This is the traditional \ndefinition of substance, and it is the one I propose to adopt.36 \nSubstances can form groups by force of a common property and every such \ngroup is a compound substance.37 Every human individual is e.g. a \nsubstance, but they also stand in a special relation to all other human \nindividuals through their common property of being human and thus form \nthe compound substance ‘humankind’. Events are a class of substances \nhaving properties and holding relations.38  \nAll substances stand in relation to every other substance in one way or \nthe other, and only between them, or their properties, can there be \n                                                \n32 McTaggart (1988, vol.1, sect. 6 & Ch. 2).  \n33 McTaggart (1988, vol.1, sect. 35 & 40).  \n34 McTaggart (1988, vol.1, sect. 35). \n35 McTaggart (1988, vol.1, sect. 59). \n36 McTaggart (1988, vol.1, sect. 67). \n37 McTaggart (1988, vol.1, Ch. 14, 15 & 16). \n38 McTaggart (1988, vol.1, sect. 5 & vol. 2, sect. 306).  \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nrelations.39 All substances in the whole Universe thus make up a single \ncompound substance and all determine one another.40 Reality is in this sense \nthe totality of all existing substances, the properties they hold and the \nrelations they stand in. This is the sense in which McTaggart means that all \n‘changes’, however minor, determines the nature of all substances in the \nUniverse.41 The fall of a sand-castle on the English coast determines the \nnature of the Great Pyramid because their mutual relation is part of their \nnature. According to McTaggart substances possess negative properties and \ncan determine other substances and be related by them no less than through \npositive properties.42  \nOne should notice that the formation of compound substances, in \nMcTaggart’s sense, is by no means restricted to substances co-present in \ntime and space and one should therefore not associate them with ‘things’ in \nthe usual sense.43  \nI must also stress the point that even though properties and relations are \nin a sense universal, in McTaggart’s account, they cannot have independent \nexistence, i.e. there cannot exist a real relation ‘larger than’ per se, if nothing \nreally is larger than something else. We might however be able to have an \nidea of such a relation even if it did not really exist but then it would be an \nidea of something unreal. From this follows that there cannot be any real \nrelations to non-existing entities.44 There can e.g. not exist any real relations \nto mythical creatures like the Phoenix, but we can imagine them and then the \nidea of the Phoenix, as well as the idea of the relation we imagine it to have \nto us and other things, exists as a mental state in our consciousness. It might \nbe objected that we seem to be able to have a relation in time to not yet \nexisting or not any more existing things, i.e. to the conference we will attend \nnext week or to deceased relatives. It will however become clear that on \nMcTaggart’s account it is a mistake to treat not-present things as not \n                                                \n39 McTaggart (1988, vol.1, sect.78-79). \n40 McTaggart (1988, vol.1, sect. 135, 137, 138). \n41 Of course meaning apparent changes, (McTaggart 1988, vol. 2, footnote 1, p. \n347).  \n42 McTaggart (1988, vol.1, sect. 61) \n43 McTaggart (1988, vol.1, sect. 59 & 130). \n44 McTaggart (1988, vol.1, Ch. 8). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nexisting: “Now tomorrow’s weather is existent, for existence is as much a \npredicate of the future and past as of the present.”45 On McTaggart’s view \nrelations presuppose something existing as having a relation and if \ntemporality is a relation then it requires the existence of what it relates.  \nNow we have the foundation of the structure that McTaggart applies to \nwhat he calls ‘Absolute Reality’.46 It is a world constituted by substances, \ntheir properties and the relations that hold between them. The Universe is \none single compound substance. The parts of this compound substance are \nnot only the things or matter in the Universe as obtain at each moment of \ntime but every qualitatively distinguishable entities of any kind in the entire \nhistory of the Universe, not forgetting the qualitative states of our \nconsciousnesses. Each and all are substantially existing entities joined by \nrelations. This is indeed the view from eternity. But something must be said \nof the relation between Absolute Reality and our beliefs about it. \nBeliefs are mental states that assert that something is true of reality, they \nmust therefore always be either true or false.47 Mental states are real \nqualitative states of a consciousness and consciousnesses are substances.48 \nTruth is a relation of correspondence between beliefs about reality and \nfacts.49 Facts are:“[...]either the possession by anything of a property, or the \nconnection of anything with anything by a relation.”50 That is to say, facts \nconsist of independently existing substances having properties and which \nhold real relations to other independently existing substances. It is important \nto realise that McTaggart here uses fact as a universal term for any existing \nstate of affairs, regardless if they appear to be, or are believed to be, events, \nthings, thoughts or whatever, as long as they consist in independently \nexisting substances having properties and holding relations. This is a use that \nmay be confusing. Especially if one is used to treating facts as true \npropositions that can be true about states of affairs, and even such as do not \n                                                \n45 McTaggart (1988, vol.1, footnote 1, p. 7). \n46 McTaggart (1988, vol.2, sect. 296). \n47 McTaggart (1988, vol.1, sect. 8). \n48 McTaggart (1988, vol.2, sect. 433). \n49 McTaggart (1988, vol.1, sect. 10). \n50 McTaggart (1988, vol.1, sect. 10). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nobtain or exist.51 In McTaggart’s terminology facts are not in any way \ndistinct from the state of affairs that exist and beliefs can never be true about \nnon-existent states of affairs (see above about truth).52  \nMcTaggart’s view of facts bears close resemblance to the view of ‘states \nof affairs’ held by later Cambridge philosophers, but, contrary to e.g. the \nearly Wittgenstein, McTaggart does not allow for the reality of possible, or \nnon-existent, states of affairs.53 There exists no negative facts in \nMcTaggart’s ontology although substances possess negative properties.54 \nFalsity is instead the absence of a relation of correspondence between a \nbelief and any real fact.55 Truth, in McTaggart’s sense, is purely \nmetaphysical, not epistemological, it holds whether or not you know there is \na relation of correspondence or not. \n                                                \n51 McTaggart goes to great length in showing that the truth and falsity of beliefs do \nnot presuppose the reality of true and false propositions, but only a direct relation \nbetween belief and existing facts (McTaggart 1988, vol.1, ch.2). \n52 At times McTaggart speaks as if facts are something that are ‘about’ states affairs \nand thus implying that they are distinct from them, but it should be clear that this is only \na manner of speaking that he allows himself to indulge in, for the sake of convenience, \nwhen he has already given the meaning of the term. \n53 McTaggart’s account of facts is very similar to that of the logical atomists: “The \nmost general account given by the atomists of an atomic fact was that it was a fact \nconsisting either in the possession by a particular of a characteristic or in a relation \nholding between two or more particulars”, (Urmson 1960, p. 17). Wittgenstein however, \nin his Tractatus, saw a fact as always consisting of at least two things forming a state of \naffairs: “2. What is the case -a fact- is the existence of states of affairs. \/ 2.01 A state of \naffairs (a state of things) is a combination of objects (things)”, (Wittgenstein 1961, p. 7). \nIn a translation of Tractatus from 1922 by C.K. Ogden and F.P. Ramsey Wittgenstein’s \nSachverhalten is translated with ‘atomic facts’(Wittgenstein 1922), whereas in the \ntranslation cited above of D.F.Pears & B.F. McGuinness in 1961, it is translated with \n‘states of affairs’. The change of terminology from fact to state of affairs is motivated, I \nassume, because a Sachverhalt, a state of affairs, is something that can be real without \nactually existing, while a Tatsache, a fact, is a Sachverhalt or Sachlage that exists in \nactuality. A state of affairs in Wittgenstein is therefore something that can be real as a \npossibility without actually existing, while a fact is a state of affairs that exists. This is a \ndistinction not allowed by McTaggart, and I therefore use ‘state of affairs' as synonymous \nwith fact.  \n54 McTaggart (1988, vol.1, sect. 62). \n55 McTaggart (1988, vol.1, sect. 19). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \n7. The Universe is a compound substance, but can it be temporal? \nMcTaggart believed that everything we know empirically appeared to be in \ntime, and he wished to inquire whether the appearance of the changing \nrelations of events in time is compatible with the general nature of relations \nthat he so carefully determined. Can the substances in McTaggart’s \n‘Absolute Reality’ form a compound substance that is in time? The question \nis misleading, but it is usually posed in this form so it might be enlightening \nto consider it in contrast to a more ‘McTaggartian’ formulation: can the \nsubstances in ‘Absolute Reality’ form a compound substance characterised \nby changing relations thereby constituting time? The former question depicts \nreality as something in time, like a rabbit in a hat, but according to \nMcTaggart´s ontology any real entity, even time itself, must be either an \nexisting substance, a property of an existing substance, a relation holding \nbetween existing substances or a compound substance constituted by \nsubstances who are the parts of reality: \nHaving, as it seems to me, succeeded in proving that there can be no time \nwithout an A series, it remains to prove that an A series cannot exist, and that \ntherefore time cannot exist. This would involve that time is not real at all, \nsince it is admitted that the only way in which time can be real is by \nexisting.56 \nThe second question implies just this: reality itself, or that part of it we are \nfamiliar with, must be temporal if time is to be real. Let us then not be \nconfused by the choice between time being a compound substance or a \nrelation because relations cannot exist independently of the substances that \nhold the relation. There can therefore not exist a relation that successively \nholds between different substances, but perhaps there can exist substances \nthat hold different relations.  \nAccording to McTaggart then, if there exist a temporal relation it must \nhold between two coexistent substances and thereby unite the substances it \nrelates into a compound substance, i.e. an existing state of affairs. Given \nthen that existence and reality are coextensive and neither allow of any \ndegrees, how can anything existing have properties successively and hold a \nrelation between the ‘times’ when it has these different properties without \nactually existing simultaneously in these different states? And how can time \n                                                \n56 [italics are mine, RI] McTaggart (1988, vol. 2, sect. 325). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nexist if the positions in time are positions that are held successively and \ntherefore do not coexist? Broad indeed notices that McTaggart’s argument \n“[...]seems to presuppose that all events ‘co-exist’, and stand to each other \ntimelessly or sempiternally in determinate relations of temporal \nprecedence”.57 Broad gives a very well stated, and to my mind correct, \naccount of McTaggart’s thoughts on this matter, but does not relate it to \nMcTaggart’s argument on the ontological nature of relations in general. He \npresents it as a “[...]‘muddle’[... ]at the back of McTaggart’s mind”.58 But as \nwe have seen McTaggart made it quite clear that the argument is entirely \ndependent on his ontology and there the dependence of relations on the \ncoexistence of related terms is perfectly clear. Well, before we answer that \nquestion we need to be clear on the nature of the notions of positions, series \nof positions and moments of time involved in the ‘time-series.’ \n8. The sense of positions, series of positions, and moments of time \nIn order to understand the notion of ‘series of positions’ we must first \nunderstand the ontological status of position. Positions are determined in \nterms of relations: being to the left to someone, being east of Eden, being \nfifth in line, earlier than e, etc. But relations cannot have independent \nexistence in McTaggart’s ontology; they presuppose the existence of \nsubstances. Positions must therefore consist in the existence of a particular \nsubstance in a particular relation to other substances. I propose that for \nMcTaggart a position should always be understood as a state of affairs. We \nare here considering temporal positions and they involve the position of \nevents in a series of positions. Events are not by themselves temporal states \nof affairs, or temporal facts, according to McTaggart’s characterisation, \nbecause he believed that future, present and past are relations, and that \nevents are therefore dependent for their temporality on having a relation to \nsome other substance. It is evident that McTaggart believed that the \nsubstantiality of positions is provided by the events themselves and that \npositions can therefore not be existent apart from the existence of an event \nholding certain relations: \n                                                \n57 Broad (1938, vol.2, p. 307).  \n58 Broad (1938, vol.2, p. 299). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nThe contents of any position in time form an event. The varied simultaneous \ncontents of a single position are, of course, a plurality of events. But, like any \nother substance, they form a group, and this group is a compound \nsubstance.59  \nRemember now that the relations of future, present and past do not hold \nmutually between the events but to something unknown. The positions of the \nA-series can therefore not consist solely of the simultaneous event-content, \nbut also of an unknown entity outside the series of events and the relation \nholding between them; together they form a state of affairs. The place of that \nposition in the series of positions must however be determined as the \nrelation holding between the positions, or rather, between the successive \nstates of affairs constituted by the different relations that the event-content \nholds to the unknown entity. Considering then what I granted as necessary \nconditions of successive possession of temporal properties, i.e. that the facts \ne is future, e is present and e is past, must obtain singularly at some time or \nother. These facts should be considered as different states of affairs \nconstituted by e, an unknown entity and the relation that holds between \nthem; these different states of affairs are the proper constitutive parts of the \nseries of positions.  \nThe A-series is then a series of states of affairs, or a series of \nconfigurations of existing substances, that consist of the different relations \nthat events hold to an unknown entity outside the series. It must now be clear \nthat it was in a sense misleading to claim that events change positions, \nimplying that they do this in a way analogous to how passengers change \nseats on the bus, because it is the events themselves that constitute the \npositions. Rather we should say that change in the A-series consists in the \nevent successively constituting different positions when its relation to the \nunknown entity changes. The temporal characteristic of the series is \nprovided by the events successively partaking in different states of affairs or \nconfigurations, and consequently being constituent parts of the states of \naffairs it partakes in. Each state of affairs or configuration has in its turn a \nposition in the series of configurations and it is this series of configurations \nthat McTaggart identifies with time.  \n                                                \n59 McTaggart (1988, vol.2, sect. 306). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nWe have now got an entity, time, that divides into parts of parts. First \nthere is time as a totality, whose constituent parts are positions, i.e. states of \naffairs holding a relation to other states of affairs. The constituent parts of \nthe positions are the events holding a certain relation to an unknown entity. \nEvery event can be further divided into parts but we need not go further for \nour present purposes. If we now apply McTaggart’s ontology it will be clear \nthat the reality of time, as a compound substance constituted by positions, is \ndependent on the coexistence of the positions; a compound substance is a \ncompound of related substances and as we have seen relations require the \ncoexistence of what is related. The existence and reality of the positions per \nse depend in their turn on that their constituent parts coexist in the relations \nrequired for being that position. This is however incompatible with events \npossessing temporal properties in succession, which in McTaggart’s view is \nequal to participating in different states of affairs. Being future is holding a \ncertain relation to an unknown entity, being present is holding another \nrelation to that same entity. Holding incompatible temporal relations in \nsuccession means that events must be constitutive parts of many, and \nmutually exclusive positions, or states of affairs; states of affairs they cannot \ncoexist in.60  \nGoing from the bottom up: Events are required to be constitutive parts of \nmany positions, if events cannot coexist in all these positions, then the \npositions fail to coexist in the required sense for constituting a series of \npositions, and time falls short of existence. It is thus demanded on the one \nhand that positions must coexist in time, which means that events must \ncoexist in all the positions they are constituent parts of; but on the other hand \nit is also demanded that events be in different positions successively, which \nmeans that they cannot coexist in all the positions they are constituent parts \nof because succession excludes coexistence. I myself see no way to satisfy \nboth these demands at the same time and have to conclude that they \ncontradict each other. One of them will have to be rejected. If succession is \nrejected, we reject change and time, but if the other is rejected the reality of \n                                                \n60 I have here characterised the contradiction in McTaggart’s sense as involving \nrelations but it makes no difference if we would substitute the relations with properties, \nbecause properties are only real when held by an existing substance just as relations are \nonly real when holding between existing substances.  \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \ntime must be defined in some other terms than coexistence of constituent \nparts. \nRegarding the relationship of all this to moments of time, if they be taken \nas separate entities as they are in theories of ‘Absolute Time’, where \nmoments of time are considered to be homogeneous entities of time \n‘containing’ the concrete event content. I will let it suffice to say that \naccording to McTaggart’s ontology they must be substantial enough to hold \nthe properties of future, present and past, properties they must aquire by \nholding a relation to something that is outside of time. And, because all \nsubstances hold relations to all other substances, they must be parts of the \ntemporal states of affairs that constitute and determine positions in time. So, \nif we originally had a problem with the coexistence of singular events in \nthree different positions, we are not going to get a smaller problem with the \ncoexistence of different positions involving moments of time and the \ndifferent relations they hold to events in addition to their relations to the \nunknown entity outside time. McTaggart grants, for the sake of argument, \nthe possibility of moments of time being real entities distinct from events, \nbut claims that this does not solve any problems because whatever holds \nregarding the temporality of events, holds regarding the temporality of \nmoments of time.61 So whether the parts of time involve events, moments \nof time or positions do not really affect the conclusion, but granting the \npossibility of them all as separate entities and then trying to sort out the \nrelations between them can maybe complicate the problem beyond \nrecognizability. \nLet me summarize: According to McTaggart’s phenomenological \nanalysis, time depends for its nature upon being constituted of successive \nparts, i.e. parts that do not coexist, but according to McTaggart’s ontology, \ntime depends for its existence upon being constituted of coexistent parts.  \n9. Time as a substance \nI hope I have made it quite clear that the argument for the unreality of time \nmust be understood as a demonstration that time cannot be a substance, or \nalternatively, that substance cannot be temporal, given McTaggart’s \n                                                \n61 McTaggart (1988, vol.2, sect. 327).  \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nconception of what substances are like and how they relate to each other in \n‘Absolute Reality’. It is clear that all preconceived ideas about time as a \n‘dimension’ of change, or as some kind of objective relation independent of \nthe events that are or come to be related by it, obscure proper understanding \nof McTaggart, and it is necessary to rid oneself of such prejudiced ideas of \nwhat is being dealt with before delving into the argument. Ideas of time as \nsomething apart from the substance in the universe are ruled out already in \nMcTaggart’s ontology by the fundamental postulates that:  \n(a) nothing can exist and thereby be real that is not a substance, \nor for its existence dependent upon substances,  \n(b) every substance is in relation to all other substances,  \n(c) relations can only hold between existing substances.  \nTime must consequently be shown to be an existing whole if it is to be real \nat all: “By objectively real time, I mean a common time in which all existent \nthings exist, so that they stand in temporal relations to each other.”62 The \nsense of ‘temporal’ is here quite simply ‘changing’. \n10. Conclusion \nIn my opinion McTaggart did prove what he intended to prove in the \nargument for the unreality of time, i.e. that our conception of time is \nincompatible with a certain internally consistent systematisation of certain \nwidely accepted notions regarding the nature of the constituents that \nsupposedly are in time. This does not of course amount to proving that time \nactually is unreal, nor that tensed change is contradictory, although \nMcTaggart himself came to this conclusion believing as he did in the truth of \nhis ontology. I hope therefore that my account of McTaggart’s argument has \nshown that it does not provide a conclusive proof against either the A-view \nor the B-view, unless it can be shown that the proponents of these views \nhold the same ontology as McTaggart. I hope this detailed explanation may \nhelp the proponents of the A- and B-views to sort out their positions \nregarding the ontological status of the notions treated by McTaggart. I see no \nother way out of the presently stalemate situation. \n                                                \n62 McTaggart (1988, vol.2, sect. 343). \nReference: Axiomathes 9(3): 287-306, 1998 (this is authors copy of original) \nI hope also to have succeeded in showing that McTaggart was not \nconfused or mistaken concerning the proper use of temporal expressions, nor \nconcerning the temporal characteristics of our experience. His understanding \nof these matters was not inadequate or mistaken in any way, but in fact \nexquisitely clear. He just rejected the belief that reality is as it appears to be. \nHe claimed that there is another more fundamental reality beyond our \nexperience, whose ontology he claimed to have determined. In his view this \nontology was a measure of the truth of our beliefs about reality, beliefs that \nare derived from the merely apparently real.  \nMcTaggart did not in any way reject the experience of time, as a matter \nof fact the justification of the experience of time was absolutely necessary \nfor the completeness of any theory about reality in McTaggart’s opinion. \nMcTaggart believed that his  account of what he called the C-series, did \nexplain how the experience of time and change could emerge in a timeless, \nchangeless reality and thus establish time as a phenomenon bene fundatum; a \nwell founded phenomenon.63 The terms of the C-series, which he claims to \nbe a non-temporal series, stand in the transitive and asymmetric relations of \nincluded in and inclusive of, but this is not the place for an account of the C-\nseries.64  \nMcTaggart’s quest for a consistent ontology of the real and existing led \nhim into an idealistic philosophical system that clashed with certain \nempirically grounded notions. Philosophical systems aiming to include \neverything often tend to clash with some of our well entrenched everyday \nnotions. In McTaggart’s case, it proved to be, among other things, time. \n \n                                                \n63 McTaggart (1988, vol.1, sect. 53, 613 & 619). \n64 McTaggart (1988, vol.2, Ch. 47-50). \n"}