{"doi":"10.1063\/1.119975","coreId":"102831","oai":"oai:epubs.surrey.ac.uk:2377","identifiers":["oai:epubs.surrey.ac.uk:2377","10.1063\/1.119975"],"title":"Self-texturing of nitrogenated amorphous carbon thin films for electron field emission","authors":["Silva, SRP","Amaratunga, GAJ","Barnes, JR"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1997-09-15","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2377<\/identifier><datestamp>\n      2017-10-31T14:05:22Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2377\/<\/dc:relation><dc:title>\n        Self-texturing of nitrogenated amorphous carbon thin films for electron field emission<\/dc:title><dc:creator>\n        Silva, SRP<\/dc:creator><dc:creator>\n        Amaratunga, GAJ<\/dc:creator><dc:creator>\n        Barnes, JR<\/dc:creator><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        1997-09-15<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2377\/1\/self-texturing_SILVA_97.pdf<\/dc:identifier><dc:identifier>\n          Silva, SRP, Amaratunga, GAJ and Barnes, JR  (1997) Self-texturing of nitrogenated amorphous carbon thin films for electron field emission   APPLIED PHYSICS LETTERS, 71 (11).  pp. 1477-1479.      <\/dc:identifier><dc:relation>\n        http:\/\/apl.aip.org\/resource\/1\/applab\/v71\/i11\/p1477_s1<\/dc:relation><dc:relation>\n        10.1063\/1.119975<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2377\/","http:\/\/apl.aip.org\/resource\/1\/applab\/v71\/i11\/p1477_s1","10.1063\/1.119975"],"year":1997,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"DownSelf-texturing of nitrogenated amorphous carbon thin films for electron\nfield emission\nS. R. P. Silvaa)\nDepartment of Electronic and Electrical Engineering, University of Surrey, Guildford, Surrey GU2 5XH,\nUnited Kingdom\nGehan A. J. Amaratunga\nDepartment of Electrical Engineering and Electronics, University of Liverpool, Liverpool L69 3BX,\nUnited Kingdom\nJ. R. Barnes\nDepartment of Engineering, University of Cambridge, Trumpington Street, Cambridge CB2 1PZ,\nUnited Kingdom\n~Received 6 June 1997; accepted for publication 14 July 1997!\nThe electron field-emission process for nitrogenated amorphous carbon ~a-C:H:N! thin films\ndeposited using a magnetically confined hydrocarbon plasma is examined. The morphology of the\nfilms obtained using an atomic force microscope is compared to the field-emission properties.\nBeyond a chemical composition of 14 at. % nitrogen, the mirror smooth a-C:H:N films become\nself-texturing, and multiple ‘‘domelike’’ cathodes of nanometer scale are observed. The dimensions\nof these ‘‘domelike’’ cathodes varies with time, and after a 15 min deposition have dimensions of\napproximately 50 nm base diameter and 20 nm in height. When the electronic field emission of these\ntextured films ~N content 15 at. %! are measured, there is an enhancement in the emitted current\ndensity of ;2 orders of magnitude at an electric field of 20 V\/mm, in comparison to the untextured\nfilms with a nitrogen content of 11 at. %. © 1997 American Institute of Physics.\n@S0003-6951~97!03337-8#There is much interest in carbon based electron field\nemitters for display applications.1,2 Electron field emission\nfrom diamond,3,4 nitrogenated diamond,5 ceasiated\ndiamond,6 and amorphous carbon,7,8 have been reported at\nmoderately low electric fields. One of the major factors that\nhave contributed to electron field emission at low fields is\nattributed to the low electron affinity of carbon films.9–11\nRecent analysis of results have shown that space-charge-\ninduced band bending of the carbon films could be important\nin both amorphous carbon8,12,13 and diamond films6,14 con-\ntributing to enhanced field emission.\nIn this letter, we report the self-texturing a-C:H:N films\nthat by virtue of their composition and texturing give rise to\nenhanced field emission with current densities\n.1024 A cm22 at low electric fields (,7 V\/mm). The sur-\nfaces of the amorphous films have been examined using an\natomic force microscope ~AFM!.\nThe nitrogenated amorphous carbon ~a-C:H:N! films\nwere deposited using a magnetically enhanced parallel plate\ncapacitively coupled plasma-enhanced chemical-vapor depo-\nsition ~PECVD! system described in detail elsewhere.15,16 A\nhydrocarbon containing gas mixture of CH4 \/He\/N2 was dis-\nsociated at a rf power of 30 W to deposit a-C:H:N films on\nhighly doped ~0.01–0.001 V cm! n-Si substrates. The films\nwere deposited on substrates held at room temperature, and\nthe properties of the films can be found in the literature.16\nNitrogen in amorphous carbon films is shown to act at a\nweak donor and alters the joint density of states in the films.\nField-emission measurements were carried out using a paral-\nlel plate configuration with the film being the cathode and an\na!Electronic mail: S.Silva@ee.surrey.ac.ukAppl. Phys. Lett. 71 (11), 15 September 1997 0003-6951\/97\/71(11\nloaded 24 Sep 2010 to 131.227.178.158. Redistribution subject to AIP lITO coated glass the anode placed 50 mm from the cathode\nusing glass fiber spacers.8,12 Measurements assume the films\nemit uniformly over the 1 cm2 substrates and were performed\nat a pressure better than 131026 Torr. The current density\nelectric field (J – E) characteristics are repeatable over peri-\nods of weeks and the films do not degrade with exposure to\natmospheric conditions over this time period. Microscopy\nwas performed in air using Si3N4 cantilevers in a custom\nbuilt optical deflection-type AFM.\nThe change in surface morphology that occurs when\nthere is more than 14 at. % nitrogen in the a-C:H:N films is\nillustrated in Fig. 1. All the films analyzed with nitrogen\ncontents of less than 14 at. % had smooth surfaces with\nminimum-to-maximum surface undulations of less than 3\nnm, for which a representative film is shown in Fig. 1~a!. At\nand above a N content of 14 at. %, the surface texturing that\ntakes place is shown in Fig. 1~b!. This was deposited with a\nN content of 15 at. %. The nodulelike structures grow radi-\nally with time and coalesce with each other at a vertical\ngrowth rate of ;0.25 nm\/s. Reasons as to the abrupt change\nin structure from smooth amorphous to nodulelike amor-\nphous films is unclear at present. When these films are ex-\namined under a scanning transmission electron microscope\nor transmission electron microscope, both the amorphous na-\nture of the films and the textured nature of the films with the\napparent boundaries between nodules is clearly visible.\nLifshitz et al.17 found that the surface morphology of\ntheir ion-beam-deposited a-C films was controlled by the ion\nenergy of the C1, which in turn controlled the sp2 fraction in\ntheir films. The nominally smooth, high sp3 content films\nbecame more and more textured as the graphitic, i.e., sp2,\ncontent increased. In the a-C:H:N films grown in this study,1477)\/1477\/3\/$10.00 © 1997 American Institute of Physics\nicense or copyright; see http:\/\/apl.aip.org\/about\/rights_and_permissions\nDowna C sp2 content of 62% and 75% and a N sp2 content of\n30% and 90% was measured for the films with 11 and 15\nat. % N, respectively.16 All the films in this study were de-\nposited under very similar conditions ~i.e., the same dc self-\nbias voltage and pressure in the rf PECVD process! on sub-\nstrates held at room temperature. Therefore, the change in\ntexture cannot be attributed to either the ion energy of the\nCH ion species or the substrate temperature. The change in\nstructure of the films is, therefore, related to the bonded N\ncontent. As the films with the higher concentration of N have\na larger percentage of C p bonds, this could lead to an in-\ncrease in the C sp2 content. It may also suggests that nitro-\ngenation leads to triple bonded C5N sites.\nThe J – E characteristics shown in Fig. 2 are for films\ndeposited with a N contents of 11 and 15 at. %. It is clear\nFIG. 1. The variation in the surface morphology for an a-C:H:N thin film\nusing atomic force microscopy from a film with ~a! 11 at. %, and ~b! 15\nat. % nitrogen. Both figures show a scan area of 1 mm31 mm.1478 Appl. Phys. Lett., Vol. 71, No. 11, 15 September 1997\nloaded 24 Sep 2010 to 131.227.178.158. Redistribution subject to AIP lfrom Fig. 2~a! that the film with the higher N content shows\na marked improvement in the current-density versus electric-\nfield characteristics, with a lower threshold electric field for\ncurrent emission in the region of 5 V\/mm. The current den-\nsity, J , in the emission has a close E2 dependence, which\nmay indicate that space-charge-limited current conduction\ntakes place within the a-C:H:N films. For the current to be\nspace-charge limited in the vacuum, it should follow a\nLangmuir–Child’s law, which would give a current density,\nJ , dependence of E1.5 For the current to be space-charge\nlimited in vacuum, very high current densities are required,\nwhereas space-charge-limited current in insulators\/semi-\ninsulators and defective insulators at low current densities is\nquite common.18 Undoped a-C:H films have shown space-\ncharge-limited current in previous studies.19\nThe Fowler–Nordheim ~F–N! plots that are applicable\nwhen electron emission into vacuum takes place are shown\nin Fig. 2~b!. Although, on initial inspection, it appears that\nthe plotted data follow a Fowler–Nordheim-like characteris-\ntic, it is possible that the J – E characteristics for these films\nare a mixture of space-charge-limited current within the bulk\nfilm accompanied by F–N-type emission from the film sur-\nface. It has been shown that N incorporated into a-C:H films\nacts as a weak donor state that moves the activation energy\nFIG. 2. The variation of the ~a! current density ~J! versus electric field ~E!,\nand ~b! the corresponding Fowler–Nordheim plot for the a-C:H:N thin\nfilms.Silva, Amaratunga, and Barnes\nicense or copyright; see http:\/\/apl.aip.org\/about\/rights_and_permissions\nDownfrom ;0.8 to ;0.5 eV from the conduction-band edge for\nthe 1.8–2.0 eV band-gap films analyzed in this study.16 The\nconductivity of the a-C:H:N films is, therefore, still very low\n(;1025 V21 cm21) at room temperature and cannot sustain\na high conduction current through the film at low electric\nfields. However, since there is a weak doping effect, with the\nincreased atomic N content in the films, it is more likely for\nthere to be space-charge-induced band bending in the fully\ndepleted a-C:H:N film due to an increased ionized donor\nconcentration in the films due to the presence of the\nn11-Si\/a-C:H:N heterojunction, as discussed previously.8\nThe fully depleted a-C:H:N thin films may cause the current\nto be space-charge limited, giving rise to the JaE2 relation-\nship, when electron emission into the vacuum from the film\nsurface is readily achieved.\nA simplified Fowler–Nordheim equation1,20\nJ5S\n1.543102~bV !2\nf\nexpS 26.833103f3\/2bV D ~1!\nand b5R\/@kr(R2r)# , where S is the fraction of area emit-\nting electrons, E5bV is the field in V\/mm, b is the field\nenhancement factor, f is the effective work function in eV,\nR is the tip-to-anode spacing, r is the tip radius, and k is a\nconstant; and 1,k,5. k;5 for a distant anode.1 This gives\nan enhancement factor b of ;10 for the 50 mm anode–\ncathode spacing and r derived from the AFM measurements\n~Fig. 1!.\nThere is an increase in the current density at fixed elec-\ntric fields of over two orders of magnitude throughout the\nrange measured. The Fowler–Nordheim plots, from both the\n11% and 15% N in a-C:H:N films could at first sight be\ninterpreted as field emission from the surface with different\nbarriers, as indicated by the two different gradients of the\ntwo sets of data. The electric field used in plotting the data\nfor Fig. 2~b! assumes an ideal thin film with an uncorrected\nb factor of 1. Using this data, an electron barrier for emission\nof ;0.04 and ;0.01 eV is calculated for the two films with\nN contents of 11 and 15 at. %, respectively. When the b\nfactor shown in Eq. ~2! is taken into consideration in the\nFowler–Nordheim plot for the film with the higher N con-\ntent, a barrier for emission of 0.5 eV is obtained ~the barrier\nfor the other ‘‘smooth’’ film remains unchanged!. The b fac-\ntor obtained may account for an order of magnitude increase\nin the current density for the film with the higher N content,\ndue to the affect of the field enhancement factor on the pre-\nexponential term in Eq. ~1!, but cannot account for the ob-\nserved increase of over two orders in the current density.\nAdditional increases in current density are likely to be re-\nlated to the doping effect in the a-C:H:N films.\nAccording to the work by Robertson et al.11 the electron\naffinity of the a-C:H:N films examined in this study should\nhave a value close to ;2 eV. This is clearly not the case\naccording to the Fowler–Nordheim analysis of the electron\nbarrier heights. Reasons as to the reduction in barrier height\nhave been related to the fact that the electron emission ob-\nserved is not purely due to classical Fowler–Nordheim-type\nemission, but to Fowler–Nordheim emission of hot electrons\nin the higher energy states of the conduction band induced\nby space-charge band bending.8 However, the ultralow emis-Appl. Phys. Lett., Vol. 71, No. 11, 15 September 1997\nloaded 24 Sep 2010 to 131.227.178.158. Redistribution subject to AIP lsion barrier of 0.04 eV derived for the ‘‘smooth’’ film,\na-C:H ~Ref. 12! and a-C:H:N ~Ref. 8! compared to 0.5 eV\nfor the textured film, show that the hot electron emission\nmodel alone cannot account for the low barriers predicted by\nthe F–N curves.\nIt is interesting to note that both Fowler–Nordheim\ncurves shown in Fig. 2~b! and those analyzed in Ref. 8 all\nintercepted the J\/V2 axis at a single point despite six differ-\nent sets of samples being examined. This would correspond\nto an emission area of the order of 10228– 10229 m2 if we\nassume the b factor to be one and f to be 0.04 eV for all the\nfilms analyzed. The actual a-C:H:N cathode area over which\nthe emission was observed was 1024 m2, at low electric\nfields. If we were to use the barrier height as 2 eV, then an\nemission area of 331027 m2 will result. This would mean\nan effective area of emission of 0.3% of the nominally flat\ncathode is emitting on average at all times.\nIn conclusion, it has been shown that a marked improve-\nment in the emission properties of a-C:H:N films can be\nobtained by using self-textured films with N contents larger\nthan 14% acting as large area cathodes. Emission is obtained\nat very low threshold fields comparable with the best results\npublished to date using amorphous films. The self-texturing\nobserved in the a-C:H:N films deposited with high N content\nis considered to be one possible route in producing cheap\nlarge area cathodes for flat panel displays.\nThe authors thank Dr. M. E. Welland of Cambridge Uni-\nversity for providing the AFM facilities.\n1 I. Brodie, Proc. IEEE 82, 1006 ~1994!, and references therein.\n2 J. E. Jaskie, MRS Bull. 21, 59 ~1996!.\n3 M. W. Geis, J. A. Gregory, and B. B. Pate, IEEE Trans. Electron Devices\n38, 619 ~1991!; M. W. Geis, J. C. Twichell, J. Macaulay, and K. Okano,\nAppl. Phys. Lett. 67, 1328 ~1995!.\n4 N. S. Xu, R. V. Latham, and Y. Tzeng, Electron. Lett. 29, 1596 ~1993!.\n5 K. Okano, S. Koizumi, S. R. P. Silva, and G. A. J. Amaratunga, Nature\n~London! 381, 140 ~1996!.\n6 M. W. Geis, J. C. Twichell, N. N. Efremow, K. Krohn, and T. M. Lyszc-\nzarz, Appl. Phys. Lett. 68, 2294 ~1996!.\n7 N. Kumar, H. R. Schmidit, M. H. Clark, A. Ross, B. Lin, L. Fredin, C.\nXie, C. Hilbert, R. L. Fink, C. N. Potter, A. Krishannan, and D. Elchman,\nSID 94 Digest 43 ~1994!.\n8 G. A. J. Amaratunga and S. R. P. Silva, Appl. Phys. Lett. 68, 2529 ~1996!.\n9 F. J. Himpsel, J. A. Knapp, J. A. Van Vechten, and D. E. Eastman, Phys.\nRev. B 20, 624 ~1979!.\n10 B. B. Pate, Surf. Sci. 165, 83 ~1986!.\n11 J. Robertson, S. R. P. Silva, G. A. J. Amaratunga, and W. I. Milne, Mater.\nRes. Soc. Symp. Proc. 423, 777 ~1996!.\n12 G. A. J. Amaratunga and S. R. P. Silva, J. Non-Cryst. Solids 198-200, 611\n~1996!.\n13 S. R. P. Silva, G. A. J. Amaratunga, and B. J. Sealy, presented at the\nInternational Conference on Metallurgical Coatings and Thin Films, San\nDiego, April 1996.\n14 E. I. Givargizov, V. V. Zhirnov, A. V. Kuznetsov, and P. S. Plekhanov, J.\nVac. Sci. Technol. B 14, 2030 ~1996!.\n15 S. R. P. Silva, J. Robertson, Rusli, G. A. J. Amaratunga, and J. Schwan,\nPhilos. Mag. B 74, 369 ~1996!.\n16 S. R. P. Silva, J. Robertson, G. A. J. Amaratunga, B. Rafferty, L. M.\nBrown, J. Schwan, D. F. Franceschini, and G. Mariotto, J. Appl. Phys. 81,\n2626 ~1997!.\n17 Y. Lifshitz, G. D. Lempert, and E. Grossman, Phys. Rev. Lett. 72, 2753\n~1994!.\n18 M. A. Lampert and P. Mark, Current Injection in Solids ~Academic, New\nYork, 1970!.\n19 S. R. P. Silva and G. A. J. Amaratunga, Thin Solid Films 253, 146\n~1994!.\n20 A. Van der Ziel, Solid State Physical Electronics ~Prentice-Hall, Eagle-\nwood Cliffs, NJ, 1966!, p. 144.1479Silva, Amaratunga, and Barnes\nicense or copyright; see http:\/\/apl.aip.org\/about\/rights_and_permissions\n"}