{"doi":"10.1177\/0146167205281009","coreId":"65934","oai":"oai:dro.dur.ac.uk.OAI2:4021","identifiers":["oai:dro.dur.ac.uk.OAI2:4021","10.1177\/0146167205281009"],"title":"Reducing stereotype threat by blurring intergroup boundaries.","authors":["Rosenthal, H.E.S.","Crisp, R.J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-04-01","abstract":"The authors aimed to establish whether interventions designed to reduce intergroup bias could be applied to the stereotype threat domain. In three experiments, the hypothesis was tested that blurring intergroup boundaries would reduce stereotype threat. In the first study, it was found that female participants who thought about characteristics shared between the genders tended to show less preference for stereotypical female careers than did participants in the baseline condition. In. Experiment 2, participants who thought. about overlapping characteristics answered more math questions correctly compared to a baseline group and Participants who thought, about differences between the genders. In experiment 3, a. specific threat manipulation was included. Participants who completed the overlapping characteristics task before receiving the threat completed significantly more math questions correctly than did participants in the baseline and threat conditions. The findings support the idea that interventions designed to reduce intergroup bias can be applied successfully in the reduction of stereotype threat","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65934.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4021\/1\/4012.pdf","pdfHashValue":"d31a4b082d4b4831f3f2d3d5237c118ec2e0e473","publisher":"Sage","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4021<\/identifier><datestamp>\n      2017-09-07T13:38:17Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Reducing stereotype threat by blurring intergroup boundaries.<\/dc:title><dc:creator>\n         Rosenthal, H.E.S.<\/dc:creator><dc:creator>\n        Crisp, R.J.<\/dc:creator><dc:description>\n        The authors aimed to establish whether interventions designed to reduce intergroup bias could be applied to the stereotype threat domain. In three experiments, the hypothesis was tested that blurring intergroup boundaries would reduce stereotype threat. In the first study, it was found that female participants who thought about characteristics shared between the genders tended to show less preference for stereotypical female careers than did participants in the baseline condition. In. Experiment 2, participants who thought. about overlapping characteristics answered more math questions correctly compared to a baseline group and Participants who thought, about differences between the genders. In experiment 3, a. specific threat manipulation was included. Participants who completed the overlapping characteristics task before receiving the threat completed significantly more math questions correctly than did participants in the baseline and threat conditions. The findings support the idea that interventions designed to reduce intergroup bias can be applied successfully in the reduction of stereotype threat.<\/dc:description><dc:subject>\n        Stereotype threat<\/dc:subject><dc:subject>\n         Social categorization<\/dc:subject><dc:subject>\n         Math performance<\/dc:subject><dc:subject>\n         Career preference<\/dc:subject><dc:subject>\n         Gender differences.<\/dc:subject><dc:publisher>\n        Sage<\/dc:publisher><dc:source>\n        Personality and social psychology bulletin, 2006, Vol.32(4), pp.501-511 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4021<\/dc:identifier><dc:identifier>\n        issn:0146-1672<\/dc:identifier><dc:identifier>\n        issn: 1552-7433<\/dc:identifier><dc:identifier>\n        doi:10.1177\/0146167205281009<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4021\/<\/dc:identifier><dc:identifier>\n        https:\/\/doi.org\/10.1177\/0146167205281009<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4021\/1\/4012.pdf<\/dc:identifier><dc:rights>\n        The final definitive version of this article has been published in the Personality and social psychology bulletin, 32\/4, 2006 © by the Society for Personality and Social Psychology, Inc. at the Personality and Social Psychology Bulletin page: http:\/\/journals.sagepub.com\/doi\/10.1177\/0146167205281009\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0146-1672","issn:0146-1672","issn: 1552-7433"," 1552-7433"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Stereotype threat","Social categorization","Math performance","Career preference","Gender differences."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n28 January 2009\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nRosenthal, H.E.S. and Crisp, R.J. (2006) ’Reducing stereotype threat by blurring intergroup boundaries.’,\nPersonality and social psychology bulletin., 32 (4). pp. 501-511.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1177\/0146167205281009\nPublisher’s copyright statement:\nThe final definitive version of this article has been published in the Personality and social psychology bulletin, 32\/4,\n2006 by the Society for Personality and Social Psychology, Inc. at the Personality and social psychology bulletin page:\nhttp:\/\/psp.sagepub.com\/ on SAGE Journals Online: http:\/\/online.sagepub.com\/\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nReducing stereotype threat 1 \n \nRunning head: REDUCING STEREOTYPE THREAT  \n \n \n \n \n \nReducing stereotype threat by blurring intergroup boundaries \nHarriet E. S. Rosenthal and Richard J. Crisp \nUniversity of Birmingham \n \n \nWord Count: 9,131 \n \n \n \nReducing stereotype threat 2 \nAbstract \nWe aimed to establish whether interventions designed to reduce intergroup bias could be applied \nto the stereotype threat domain. In three experiments we tested the hypothesis that blurring intergroup \nboundaries would reduce stereotype threat. In the first study we found that female participants who \nthought about characteristics shared between the genders tended to show less preference for \nstereotypical female careers than participants in the baseline condition. In Experiment 2 participants who \nthought about overlapping characteristics answered more math questions correctly compared to a \nbaseline group and participants who though about differences between the genders. In Experiment 3 we \nincluded a specific threat manipulation. Participants who completed the overlapping characteristics task \nbefore receiving the threat completed significantly more math questions correctly than participants in the \nbaseline and threat conditions. The findings support the idea that interventions designed to reduce \nintergroup bias can be applied successfully in the reduction of stereotype threat. \n \n \nKeywords: STEREOTYPE THREAT, SOCIAL CATEGORIZATION \n \nReducing stereotype threat 3 \nNo woman in my time will be prime minister or chancellor or foreign secretary - not the top jobs. Anyway, I wouldn't want \nto be prime minister; you have to give yourself 100 percent. \nMargaret Thatcher (British Prime Minister 1979-1990) \nSunday Telegraph, 26th October 1969 \nMargaret Thatcher in 1969 could not perceive herself, or another woman, in the role of British \nprime minister. Her declaration of disinterest can be seen as a reaction to the perception that the prime \nministerial role is typically regarded as a male preserve. Thatcher was elected as prime minister from 1979 \nto 1990, but she remains the only woman to have held that office.  \nThe role of women in society has diversified rapidly over the last thirty years, yet men and \nwomen in Britain continue to follow career paths stereotypical of their gender. Two-thirds of managers \nand senior officials are male, while four out of five people in administrative and secretarial roles are \nfemale. Likewise, 92% of people in skilled trades are male and 84% of personal service roles (e.g. \nhealthcare; childcare; hairdressers) are filled by females (Equal Opportunities Commission [EOC], 2004). \nThis precedent for stereotypical roles is reflected in the academic subjects chosen by 16 year olds at \nschool, for GCSE qualifications. In the United Kingdom (with the exception of Scotland) young people \nare required to study certain subjects (English, math, science and a modern language), however the \ngenders diversify in subject areas they choose; for instance, 67% of physical education students are male, \nwhile 95% of home economics students are female (Department for Education and Skills [DfES], 2004).  \nThis choice of gender stereotypical subjects extends beyond GSCE level into further \nqualifications. For students who do not go on to study for A-levels (qualifications typically studied aged \n16-18), young people have a number of choices in terms of qualifications and employment. One route is \nto take on a modern apprenticeship, which are government supported positions offering on-the-job \ntraining. The stereotypical nature of the apprenticeships chosen are very pronounced, with women only \nforming one percent of apprenticeships in the construction industry and men forming three percent in \nthe childcare sector (EOC, 2004). For students who do go on to study for A-levels (which do not require \nthe study of core subjects, as at GCSE level), these again reflect a stereotypical bias; with 63% of math \nReducing stereotype threat 4 \nstudents and 77% of physics students consisting of males, and 70% of English and 67% of French \nlanguage students consisting of females (DfES, 2004). Such differences in the number of women and \nmen in certain academic subjects continue into universities. Recent debate has been sparked by the \ncomments of Harvard President Lawrence Summer, who suggested that women‟s under-representation \nin science and engineering is due to innate differences in abilities. The research presented here dismisses \na focus on biological factors, and instead examines an alternative contributor to these stereotypic trends \nin career and academic subject choices, that of stereotype threat. \nStereotype Threat \nStereotype threat is defined as the predicament felt by people in situations where they could \nconform to negative stereotypes associated with their own group membership (Steele, 1997). The result \nof this threat is that individuals may underperform on a task associated with the threatened domain, so \nwomen may underperform on a math test or African Americans may underperform on an intelligence \ntest. Ultimately the threat could lead to people removing themselves from the domain altogether, so \nwomen may no longer consider math as important to their self-perceptions, or African Americans may \nleave school, and therefore no longer identify with the domain in which they are stereotyped as inferior \nto White Americans. Steele and Aronson (1995) examined the stereotype of African Americans and \nintelligence in the first research which highlighted the consequences of stereotype threat. Not only did \nthey find that African Americans underperformed on a test when they were told it was indicative of \nintelligence, but they also found that simply asking African Americans to state their race before taking a \ntest reduced the students‟ subsequent performance. \nSince this first study, stereotype threat has become an expansive area, with research conducted in \nan ever increasing number of domains. Stereotype threat is an interesting phenomenon because of its \ncontinued ability to present itself in different settings; crossing race, ethnicity, gender and culture. As well \nas African Americans and intelligence (Steele & Aronson, 1995; Aronson, Fried, & Good, 2002) and \nwomen and math (Spencer, Steele, & Quinn, 1999; Marx & Roman, 2002; Nosek, Banaji, & Greenwald, \n2002; Schmader, 2002), the threat has been examined with regard to women and career choices (Davies, \nReducing stereotype threat 5 \nSpencer, Quinn, & Gerhardstein, 2002), White men vs. Asian men and math (Aronson, Lustina, Good, \nKeough, Steele, & Brown, 1999; Smith & White, 2002), White men and sport (Stone, Lynch, Sjomeling, \n& Darley, 1999; Stone, 2002), homosexual men and childcare (Bosson, Haymovitz, & Pinel, 2004) as well \nas social class (Croizet & Claire, 1998). The research has shown that all that is really needed to produce \nstereotype threat is to be placed in a situation where the stereotype is salient. Indeed it is defined as a \nsituational threat or a “threat in the air” (Steele, 1997, p. 613). To come under stereotype threat people \nmust find themselves in a situation that readily leads itself to the stereotype, so for instance, women must \nbe given a math test, or White men must be placed in a sporting environment.  \nPrevious research has examined possible mediating processes underlying stereotype threat, \nalthough no one factor has been shown to be exclusive. One potential explanation for the effect that has \nbeen extensively investigated is anxiety (Blascovich, Spencer, Quinn, & Steele, 2001; Osborne, 2001; \nSpencer et al., 1999; Steele, 1997). However, a lack of overwhelming support for anxiety‟s mediating role \nhas led to the exploration of other potential candidates such as performance expectancy (Cadinu, Maass, \nFrigerio, Impagliazza, & Latinotti, 2003; Stangor, Carr, & Kiang, 1998; Sekaquaptewa & Thompson, \n2002), dejection (Keller & Dauenheimer, 2003), working memory capacity (Schmader & Johns, 2003) \nand self-handicapping (Keller, 2002; Stone, 2002). All of which appear to contribute, in part, to the \nexplanation for the effect. \nThe moderation of stereotype threat \nAs well as the mediators of stereotype threat, focus has been placed on examining the moderators \nof stereotype threat. That is, aspects of the stereotype threat process that affect the level of performance \ndecrement that is experienced. The literature appears to fall into three different areas. The first area \nincludes studies which moderate stereotype threat by moderating the emotional responses to the \nstereotype. For example, Aronson et al. (2002) and Good, Aronson, and Inzlicht (2003) found that \ntargeting the negative stereotype associated with task performance could reduce stereotype threat. \nAronson et al. (2002) focused on the stereotype concerning African Americans in education, and \ninformed participants (over a substantial period of time) that intelligence was malleable and not fixed. By \nReducing stereotype threat 6 \nmoderating the emotional response to the stereotype surrounding intelligence the stereotype threat effect \nappeared to abate. Similarly, Marx and Roman (2002) found that positive role models in the relevant \ndomains could also moderate stereotype threat. \nA second line of work has tried to moderate stereotype threat by changing perceptions of the \nsituation. One approach is to inform participants that the stereotype does not apply in the current \ncontext (Spencer et al., 1999; Ouwerkerk, de Gilder, & de Vries, 2000). The composition of the group in \nrelation to ingroup and outgroup members has also been shown to affect stereotype threat (Inzlicht & \nBen-Zeev, 2000), as has whether the participant is solo in status (Roberson, Deitch, Brief, & Block, 2003; \nSekaquaptewa & Thompson, 2002). \nThe third set of studies have examined the moderating role of individual differences. The level of \nidentification that the individual has with the domain concerned has been found to affect stereotype \nthreat (Aronson et al., 1999; Leyens, Désert, Croizet, & Darcis, 2000; Pronin, Steele, & Ross, 2004) as \nhas identification with the group (Nosek et al., 2002; Schmader, 2002), levels of stigma-consciousness \n(Brown & Pinel, 2003) and even testosterone levels (Josephs, Newman, Brown, & Beer, 2003). \nIn our research we aimed to build on these previous findings and test a potential intervention \nstrategy for reducing stereotype threat effects derived from work on reducing intergroup bias. In \nparticular, we hypothesized that the positive effects of blurring intergroup boundaries on prejudicial \nattitudes and behavior could be extended to the stereotype threat domain. \nCategorization models of reducing intergroup bias \nThe extent to which ingroups and outgroups are differentiated and distinct is a key determinant \nof how such groups are evaluated (Brewer, 1991; Tajfel & Turner, 1979; Turner, Hogg, Oakes, Reicher, \n& Wetherell, 1987). Indeed, merely distinguishing between people on the basis of their group affiliations \nis sufficient to observe ingroup favoritism (Tajfel, Billig, Bundy, & Flament, 1971). All other things being \nequal, the knowledge that they are different from us translates into evaluative differentiation (see Brewer, \n1979; Mullen, Brown, & Smith, 1992). Models have been proposed to explain this impact of \ncategorization on intergroup attitudes such as Doise‟s (1978) category differentiation model (CDM) and in the \nReducing stereotype threat 7 \nform of the meta-contrast process (Oakes, Haslam, & Turner, 1994) outlined by self-categorization theory \n(SCT; Turner et al., 1987). While the emphasis of these accounts varies, what is common to all is the \nnotion that categorization provides a psychological basis for understanding them to be different from us, \nand it is the emergence of this distinction between ingroups and outgroups that provides the pre-\nrequisite for intergroup discrimination. \nIt is the notion that differentiation is positively related to intergroup bias that has formed the \nbasis for multiple models of bias-reduction. Models of contact (Brewer & Miller, 1984; Hewstone & \nBrown, 1986; Miller, Brewer, & Edwards, 1985; Pettigrew, 1998), the formation of a common ingroup \nidentity (Gaertner & Dovidio, 2000; Gaertner, Mann, Dovidio, Murrell, & Pomare, 1990; Gaertner, Mann, \nMurrell, & Dovidio, 1989), and crossed categorization (Crisp, Ensari, Hewstone, & Miller, 2002; Deschamps \n& Doise, 1978) all incorporate the idea that as differentiation is reduced, and groups are perceived to \npossess overlapping characteristics, intergroup evaluations will also become less differentiated (and bias \nwill be reduced). This contention is well supported using a variety of paradigms all of which essentially \npromote the perception of intergroup overlap (e.g., Crisp, Hewstone, & Rubin, 2001; Marcus-Newhall, \nMiller, Holtz, & Brewer, 1993; Vanbeselaere, 1987; for recent reviews see Crisp & Hewstone, 1999; \nGaertner & Dovidio, 2000; Mullen, Migdal, and Hewstone, 2001).   \nA categorization model of reducing stereotype threat \nThe differentiation-reducing models outlined above have been highly successful in helping to \nreduce the extent to which evaluations of groups are ingroup favoring. Our aim was to test whether such \ninterventions that promote intergroup overlap might also be successful at reducing stereotype threat. \nThere are some good theoretical reasons why this might be the case. One can assume that awareness of \nrelevant ingroup\/outgroup differences are a precondition for observing stereotype threat effects (one \ncan not assimilate to one‟s perceived ingroup inferiorities if one does not have a perception of the \ningroup being a distinct entity from an outgroup comparison group). For instance, when taking an \nintelligence test stereotype threat effects will be observed when participants are aware of their ethnicity \nor class status, and when taking a math test the effects will be observed when participants are aware of \nReducing stereotype threat 8 \nbeing female. Correspondingly, African Americans may compare themselves to White Americans and \nwomen may compare themselves to men. Categorization models of bias-reduction do so by encouraging \na weakening of the us versus them prerequisite distinction. One cannot positively favor us over them if we \nare not perceived as psychologically different from them. Similarly, here we predict that a task that \nencourages the weakening of the us versus them distinction will reduce stereotype threat: One cannot \nconform to a stereotype based on expected performance differences between us and them if we are not \nperceived as psychologically different from them. \nWe focus on the well-studied stereotype threat area of women and math (Spencer et al., 1999; \nMarx & Roman, 2002; Nosek et al., 2002; Schmader, 2002) and women and career choices (Davies et al., \n2002). Based on the model outlined above, to reduce stereotype threat in these domains we must \nencourage the perceived weakening of the intergroup boundary. As the salience of the gender categorical \ndistinction is weakened, so too should be the salience of the associated stereotypes, and as a result the \nstereotype threat effect should be attenuated. \nExperiment 1 \nExperiment 1 was designed to test of the potential positive effects of encouraging intergroup \noverlap within the stereotype threat domain of women and career choices. Previous work by Davies et al. \n(2002) investigated the career choices made by women after seeing either stereotypical television \ncommercials or non-stereotypical commercials. They found that women were more likely to show an \ninterest in stereotypically female careers after seeing commercials where women were portrayed in \nstereotypical roles (a stereotype threat effect), compared to women viewing neutral commercials and men \nin both conditions. Davies et al. found this assimilation effect only for females, not for males, ruling out \nthe possibility that it was a simple ideomotor effect, rather than specifically threat. Here, we hypothesized \nthat a similar orientation to female stereotypic careers for females in a baseline condition would be \nattenuated if participants first carried out a task designed to blur the intergroup boundary. Specifically, \nwe predicted that encouraging intergroup overlap would lead our female participants, relative to baseline, \nmaking less stereotypically female career choices. We also hypothesized that the strength of the \nReducing stereotype threat 9 \nstereotypicality of the career may also have an effect, More specifically, we thought it plausible that \nstronger stereotypic representations might be more resistant to change following our overlapping \ncharacteristics task. We expected careers that were highly stereotypical of females or males to be less \nopen to moderation than those that were less stereotypically associated with gender. As such, we carried \nout a pre-test (described below) to identify careers of varying stereotypicality, and entered this factor into \nthe analysis in our main experiment. \nMethod \nParticipants and design \n Thirty female students at the University of Birmingham (mean age = 21, SD = 2.95) were \nrandomly allocated to one of two conditions (task: baseline vs. overlap). Participants received £1 ($1.60) \nfor their participation.  \nPre-test \nThe careers survey consisted of a list of eight careers, four of which had been established as \nstereotypically female (primary school teacher, i.e., who teach children up to the age of 11; physical \ntherapist; registered nurse; social worker), and four as stereotypically male (dentist; accountant; military \nofficer; mechanical engineer). The stereotypicality of these careers had been established in a pre-test \nwhich had asked 60 participants (30 male, 30 female) to judge 55 professional careers as to their typical \nassociation with males and females. Each career was judged on an eleven point scale from -5 (very \natypical) to +5 (very typical), with 0 indicating neither typical nor atypical. The gender order of the \ncareers was counterbalanced with participants either presented with a career label and asked to rate \nfemale typicality followed by male typicality, or male typicality followed by female typicality. Each of the \n55 occupations were then analyzed using a 2 (participant gender: female vs. male) x 2 (order: female first \nvs. male first) x 2 (career rating: female vs. male) mixed ANOVA with repeated measures on the third \nfactor. This analysis extracted careers that were perceived as stereotypically male or female, regardless of \nthe order the careers were presented (i.e. female\/male first) and regardless of the participant‟s own \ngender (all career rating main effects, p < .0005).  \nReducing stereotype threat 10 \nThe eight careers chosen were also either strongly or weakly stereotypical on the basis of one-\nsample t-tests, test value = 0. Careers strongly associated with males were defined as those which were \nsignificantly stereotypical of males (p < .05), and at the same time significantly counter-stereotypical of \nfemales (p < .05) (mechanical engineer; military officer). Careers assigned a weak label were significantly \nstereotypical of males (p < .05), but not significantly counter-stereotypical of females (e.g., dentist; \naccountant). Using the same criteria we selected two strong female careers (registered nurse; primary \nschool teacher) and two weak female careers (physical therapist; social worker). \nProcedure \nIn order to encourage the perception of intergroup overlap (reduced differentiation) we used a \ntask previously used successfully in the bias-reduction literature. Categorization models of bias-reduction \nare linked by the general notion that they reduce ingroup\/outgroup differentiation and increase the \nperceived overlap between the ingroup and outgroup‟s characteristics. Crisp and Beck (2005) developed \na task influenced by this basic idea. They found that simply asking participants to list characteristics \nshared between the ingroup and outgroup could reduce intergroup bias. This task also has effects on \nintergroup differentiation consistent with the above mentioned categorization models of bias-reduction \n(Cocker, 2004) Here we used this method of creating category overlap.  \nThe overlap condition consisted of a task which asked participants, “to think of five things that \nmen and women can have in common (i.e. characteristics that men and women share)”. Below this were \nfive numbered spaces for participants to write the five characteristics. This task can also be seen as \nconceptually similar to Mussweiler (2001) who primed similarity\/dissimilarity through the use of two \npictures. Mussweiler asked participants to list as many similarities or differences as they could between \nthe two scenes. Completion of the task was found to prime an orientation to look for similarities or \ndifferences. Our task asks participants to generate shared characteristics and is therefore similar to \nMussweiler‟s manipulation insofar as it also leads participants to focus on similarities or differences \nbetween, in our case, gender categories After completing the task, participants moved on to the careers \nsurvey. Participants in the baseline condition did not receive the overlapping characteristics task, instead \nReducing stereotype threat 11 \nmoving straight on to the careers survey. On completion of the careers survey participants in both \nconditions were asked to complete a feedback form, before being thanked and debriefed.  \nDependent Measures \nIn the careers survey the eight careers developed in the pre-test were presented to the \nparticipants. Participants read the instructions:  \nWe would like you to think about the career path that you would be most interested in if \nyou had not embarked on your chosen path. That is, please imagine that you have not yet \nentered university, and you have many different options available to you. Which of the \nfollowing, using the scales below, would you find appealing? \nParticipants then rated the eight careers in a random order on a nine point scale, 1 = not at all \ninterested to 9 = very interested.  \nResults and discussion \nCareer choices \nCareer preference was calculated as the mean rating for each of the career types (strength: weak \nmale, weak female, strong male, strong female). A 2 (task: baseline vs. overlap) x 2 (career type: male vs. \nfemale) x 2 (career strength: weak vs. strong) ANOVA with repeated measures on the last two factors \nrevealed a significant main effect of career type, F (1, 28) = 65.07, p < .001, p\n2 = .70. Overall female \ncareers were preferred (M = 4.61) over male careers (M = 2.49). There was no main effect of task, F (1, \n28) = .292, p = .593, and no interaction effects between task and strength, F (1, 28) = 1.27, p = .269, nor \ncareer type x strength, F (1, 28) = .073, p = .739.  The career type x task interaction was, however, \nsignificant, F (1, 28) = 7.59, p = .010, p\n2 = .21, and not qualified by strength (the three-way interaction \nwas not significant, F(1,28) = .044, p = .836), see Table 1.  \nPlanned t-tests revealed that in the baseline condition the female participants rated stereotypically \nfemale careers as more preferable (M = 5.13) compared to male careers (M = 42.29), t (12) = 8.11, p < \n.001. This difference remained significant for participants in the overlap condition; t (16) = 3.74, p = .002 \n(Ms = 4.09 and 2.69 respectively), although the extent to which the female careers were preferred over \nReducing stereotype threat 12 \nmale careers was attenuated (MBaseline\n = 2.85, Moverlap = 1.40). There was a trend towards there being lower \npreference for female careers after the overlapping task (M = 4.09) compared to baseline (M = 5.13), t \n(28) = 1.49, p = .148, but little evidence for moderation of preference for stereotypically male careers, t \n(28) = -.678, p = .503.  \nThe results offer some initial support for the idea that encouraging a focus away from intergroup \ndifferences can alleviate stereotype threat. Although tentative, the findings suggest that female \nparticipants who carry out a task designed to reduce the salience of gender categorization subsequently \nshow a lower preference for female stereotypical careers relative to male stereotypical careers. Notably, \nwe did not find an effect of career strength. This suggests that the shared characteristics task is effective \non preference for both weak and strong careers. This is an important finding in terms of applicability, \nbecause it suggests that if this characteristics task can be used as a basis for a real stereotype threat \nintervention (for example, within education), then the intervention would be effective in reducing the \nprevalence of threat irrespective of the level of perceived stereotypicality.  \nThe results of Experiment 1 were encouraging. However, there are some important issues that \nwere not addressed. The aim of the experiment was simply to ascertain whether there was any support \nfor the basic hypothesis that thinking about shared characteristics could reduce stereotype threat. As \nsuch, the baseline condition used was simply the absence of any task. There is therefore the possibility \nthat rather than thinking about overlapping characteristics it could be that it was the cognitive activity of \nsimply doing any task that reduced the stereotype threat effect in this experiment. Therefore in \nExperiment 2 we included a third condition to address this issue. In this third condition participants were \nrequired to list differences between the genders (instead of similarities). While this offers the equivalent \ncognitive load as thinking about similarities, the task itself should not blur intergroup boundaries. \nExperiment 2 also looked to expand the generality of the task by attempting to replicate the findings in \nthe domain of stereotype threat relating to women and math performance. \nExperiment 2 \nReducing stereotype threat 13 \nIn Experiment 1 participants in the overlap condition tended to show less preference for \nstereotypical female careers than participants in the baseline condition. In Experiment 2 we expected to \nfind similar results with respect to women and math performance. It was hypothesized that participants \nin the overlap condition would answer more questions correctly than those in the baseline condition, \nfollowing the same pattern as Experiment 1. In order to test the hypothesis that it was specifically \nthinking about intergroup overlap, and not simply thinking about anything that would have the positive \neffects, we included a third condition. Here we asked participants to list five differences between men and \nwomen. We expected thinking about differences to have no beneficial effects with respect to reducing \nstereotype threat. In fact, it was possible that the introduction of a task emphasizing differences between \nthe genders could accentuate any threat inherent to the situation, resulting in these participants coming \nunder more threat than those in the baseline condition (i.e., the math performance detriment becoming \neven more pronounced). However, we only tentatively make this hypothesis for the following reason. \nFrom Experiment 1 it is clear that even with no explicit threat manipulation, a bias in favor of female \nstereotypic careers was observed. It may therefore be that there is a ceiling effect in that when a threat is \nalready present (as it appears to be in the baseline condition of Experiment 1), it is less likely that further \ndemands (i.e. thinking about differences between the groups) can make that threat worse.  \n Previous studies (Spencer et al., 1999; Quinn & Spencer, 2001) have argued that the difficulty of \nmath tasks is an essential element in stereotype threat effects (and that stereotype threat only occurs \nwhen math questions are of a difficult level). Therefore in Experiment 2 we presented math questions \nwhich were aimed at the ability of the participants (psychology undergraduates), while still offering a \nchallenge. This reasoning was in line with Spencer et al. (1999, exp.3) who adjusted the difficulty of the \nmath presented when testing psychology students, who tend to be of lower mathematical ability than \nstudents taking more math oriented degree majors.  \nMethod \nParticipant and design \nReducing stereotype threat 14 \nThirty-six female psychology students (mean age = 21, SD = 5.25) were randomly assigned to \none of the three conditions (task: baseline vs. overlap vs. difference). Participants received £3 ($4.70) or \ncourse credit for their participation. \nProcedure \nThe participants were tested on an individual basis and were shown to a lab by a female \nexperimenter where they were informed that the study consisted of a selection of pre-tests. The first task \nconsisted of either the overlapping characteristics or the different characteristics task. The overlapping \ncharacteristics task was the same as in Experiment 1, while the different characteristics task asked \nparticipants, “to think of five things that can distinguish men from women (i.e. characteristics that men \nand women do not share)”. Numbered spaces then followed. Participants in the baseline condition did \nnot receive such a task, moving straight on to the second task, which consisted of ten math questions. \nFor the math test participants were given a plain piece of paper for calculating the answers, and were not \nallowed to use a calculator. The participants were informed that they had five minutes to complete as \nmany of the questions as they could, but to let the experimenter know if they completed them sooner. \nAfter completing the math questions, participants were asked to provide feedback before being thanked \nand debriefed. \nDependent Measures \n The math questions were designed to be straightforward, and constituted tests of mental \narithmetic, e.g. “In hall accommodation, 23 out of 25 rooms were occupied. What was the number of \noccupied rooms as a percentage?”. There were ten questions in total, and the participants were given five \nminutes to complete the task.  \nResults and discussion \nMath task \nOnly one participant, who was in the overlap condition, attempted all ten math items. A one-way \nANOVA was computed on the number of correct math scores, revealing significant variation as a \nfunction of condition, F (2, 33) = 3.79, p = .033, p\n2 = .19, see Table 2. Planned contrasts revealed no \nReducing stereotype threat 15 \nsignificant difference between the baseline and difference conditions (baseline -1, overlap 0, difference \n+1), t (33) = .844, p = .405. Math performance was, however, better in the overlap condition (M = 6.83) \ncompared to either the baseline (M = 4.80) or difference (M = 5.43) conditions (baseline -1, overlap +2, \ndifference -1), t (33) = 2.69, p = .011. \nContent analysis \n In order to examine whether the exact nature of the shared and non-shared characteristics had \nany impact on the effects observed, two independent coders were employed to rate each of the \nresponses given by the participants during the generation task. The coders were asked to rate each \ncharacteristic generated as being either academic (i.e. relating to education), non-academic and physical (i.e. \nactual physical similarities\/differences between the two genders) or other (characteristics that were neither \nacademic or physical). The raters‟ responses correlated well for all threes types of characteristic: r (26) = \n.953, ; r = .880; r = .840 respectively, all p‟s < .0005. We examined whether the extent to which each of \nthe different types of characteristics were generated had any impact on the threat effects. We found no \ncorrelation between the number of academic, non-academic [physical], non-academic [non-physical] or \nnon-academic [physical and non-physical combined] with math performance. This finding occurred \nwhen the correlations were carried out within the similar and different conditions respectively, and \ncombined. Notably, most participants generated non-academic [non-physical] characteristics. Few \nphysical or academic characteristics were generated. \nExperiment 2 replicated the findings of Experiment 1, within the stereotype threat setting of \nwomen and math performance. The inclusion of the differences condition supports the notion that it is \nspecifically emphasizing overlapping characteristics that results in the reduction of stereotype threat, \nruling out an alternative explanation in terms of cognitive load. No significant difference was observed \nbetween the baseline and the difference condition. This suggest that there may be a ceiling effect, in that \nwhen a threat is already present (as it appears to be in our baseline condition) it is less likely that further \ndemands that should instigate threat (i.e. thinking about differences) make the threat worse.  \nReducing stereotype threat 16 \nAlthough we may regard the difference condition used here as a kind of threat manipulation, we \nhave nevertheless not tested the effect an explicit threat manipulation (i.e., stating that men and women \nwill be compared on the test) will have on math performance, when combined with our characteristics \ntask. While some studies (Smith & White, 2002; Spencer et al., 1999; McIntyre, Paulson, & Lord, 2003) \nhave established that simply being in a relevant situation, i.e. being given a math test, is sufficient to elicit \nstereotype threat, other studies (Aronson et al., 1999; Brown & Pinel, 2003) have reminded participants \nof the stereotype threat associated with the situation they are in before completing the task. To expand \nthe generality of our findings we therefore included a specific threat manipulation in Experiment 3. If \nblurring intergroup boundaries can reduce stereotype threat when an intergroup comparison is explicit, \nthis will strengthen support for the potential benefits of this as an intervention strategy. \nExperiment 3 \nExperiment 3 draws on the previous literature which explicitly induces stereotype threat. To \nexamine the effects of overlapping characteristics in relation to explicit threat, the experiment included \nfour separate conditions. The first condition was the same baseline condition as in Experiments 1 and 2. \nIn the second condition participants were told that their results would be compared to men (specific \nthreat condition). It was predicted that there would be no significant difference between the baseline and \nthreat condition, as from previous work we know that simply placing participants in a math test situation \ncan induce stereotype threat. However, as discussed above, it is also possible that some conditions, such \nas explicitly making the distinction between groups salient, could lead to a greater experience of threat. \nWe therefore tentatively hypothesized a decrease in performance in the threat condition compared to the \nbaseline condition. The third condition introduced the overlap task followed by the threat manipulation. \nIn the fourth condition the threat manipulation was followed by the overlap task. The reversed ordering of \nthe tasks in the third and fourth conditions was included to test the hypothesis that the overlapping \ncharacteristics task would work best to alleviate stereotype threat if it was presented before the threat \nmanipulation.  \nReducing stereotype threat 17 \nWe can explain our rationale for this prediction by conceiving a model of stereotype threat that \ninvolves three stages: categorization at stage one is a pre-requisite for instigating processes at stage two \nthat lead to behavioral effects (e.g., detriments on math performance) at the final stage. Intervention at \nstage one (categorization) should prevent movement into stage two (the processes that lead to \ndetrimental math performance). Therefore, carrying out the overlap task before the threat (i.e. \nintervention at stage one) should reduce the observation of stereotype threat effects. However, if threat \nis induced before the characteristics task (i.e. intervention at stage two), then the processes leading to \ndetrimental math performance will already have been reached. Therefore, when the overlap task comes \nafter the threat (albeit before the math test) we still expect to observe stereotype threat effects. We \ntherefore tested the hypothesis that the overlapping characteristics task will work most effectively if it is \nused prior to the instigation of threat. If this is the case, then it would suggest that the overlapping task \nworks effectively not by alleviating the stereotype threat, but by preventing the stereotype threat from \nemerging at all. \nMethod \nParticipant and design \nSixty-two white female psychology students (mean age = 19, SD = 1.37) were randomly allocated \nto one of four conditions (baseline vs. threat vs. overlap-threat vs. threat-overlap). Participants received \ncourse credit for their participation. \nProcedure \nThe participants were shown to a lab where they were tested individually by a female \nexperimenter. Like Experiment 2, all participants were informed that they would be pretesting a selection \nof tasks, even though participants in the baseline and threat conditions only received one task. \nParticipants in the baseline condition were given the same instructions as in Experiment 2. The threat \ncondition consisted of the same task and procedure as the baseline condition with one crucial difference: \nbefore receiving the math test participants were given the threat manipulation, i.e. they were informed \nthat the test was being administered because the experimenter was “interested in comparing the math \nReducing stereotype threat 18 \nperformance of men and women, to see if there is a difference between the two genders”. In the overlap-\nthreat condition, participants were asked to complete the overlapping characteristics task, after which \nthey were given the threat manipulation, followed by the math test. In the threat-overlap condition, the \nparticipants were informed that the second task they would be receiving was a selection of math \nquestions and they were given the threat manipulation. Before receiving the math questions they were \ngiven the overlapping characteristics task. They were not reminded of the threat immediately before being \ngiven the math task. On completion of the math test all participants completed a feedback questionnaire \nbefore being thanked and debriefed. \nDependent Measures \nThe same math questions were used as in Experiment 2. However, a question was added to the \nfeedback form to indicate whether the participant could recall the reason for the math test.  \nResults and discussion \nMath task \nBecause the addition of the threat manipulation was the only difference between the baseline and \nthreat conditions, we included a manipulation check to assess whether participants in the threat \ncondition could remember the reason for the math test (i.e. to examine if there was a difference in \nperformance between men and women).  In order for the conditions to be perceived as distinct, seven \nparticipants who could not recall the reason were omitted from the analysis.   \nA one-way ANOVA was carried out on the number of math questions answered correctly, \nrevealing a significant effect of task, F (3, 51) = 3.07, p = .036, p\n2 = .15, see Table 3. We used a set of \nHelmert contrasts to incrementally test whether there was support for our hypotheses. First, we tested \nwhether there was any difference between the baseline and threat conditions (baseline -1, threat +1, \noverlap-threat 0, threat-overlap, 0), this analysis revealed no significant difference, t (51) = 1.32, p = .192. \nGiven no difference between these two conditions, we then compared their aggregate with the threat-\noverlap condition (baseline -1, threat -1, overlap-threat 0, threat-overlap +2). This analysis also revealed \nno differences, t (51) = -.448, p = .656, Finally, given no differences between the baseline, threat and \nReducing stereotype threat 19 \nthreat-overlap conditions, we compared all three conditions with the overlap-threat condition baseline -1, \nthreat -1, overlap-threat +3, threat-overlap -1). This analysis revealed that math performance was \nsignificantly better when the overlap task preceded the threat compared to all other conditions, t (51) = \n2.71, p = .009. These findings support the idea that compared to the baseline and threat conditions (Ms \n= 5.21 and 6.20), completing a task that blurs gender boundaries reduces stereotype threat and improves \nmath performance (M = 7.58), although this is not the case if the overlap task is completed after the \nthreat has been induced (M = 6.00). \nAs in Experiment 2, two independent coders rated the characteristics generated as academic, \nphysical (and non-academic) or other (non-academic and non-physical). The raters‟ responses correlated \nwell for all threes types of characteristic: r (26) = .923, ; r = .858; r = .845 respectively, all p‟s < .0005. As \nin Experiment 2, however, there was no correlation between the number of different characteristics \ngenerated and math performance, across or within categorization conditions. \n Experiment 3 furthered supported the notion that emphasizing overlapping characteristics can be \nbeneficial for reducing stereotype threat by including a specific threat manipulation. There was no \nsignificant difference between the baseline and threat condition suggesting that the threat was implicitly \nactivated in Experiments 1 and 2. As expected, when participants received the threat manipulation after \nfirst having completed the overlapping characteristics task, math performance improved. However, \nparticipants who received the threat manipulation before the overlapping characteristics measure did not \nimprove their performance on the math test. This finding has important implications for the \neffectiveness of the overlapping characteristics task as an intervention technique. As the overlapping task \nwas most effective in reducing stereotype threat when it was presented before the threat manipulation, \nthis suggests that the task may prevent the stereotype threat from emerging at all, as apposed to it simply \nalleviating the threat. It is in line with our predictions that the task is more effective before the instigation \nof threat rather than after. If categorization instigates processes that lead to detriments on math \nperformance, intervention at this stage should prevent such processes occurring (and so prevent them \nleading to stereotype threat effects). If it is the case, however, that the threat has already been perceived, \nReducing stereotype threat 20 \nand the processes set in motion that lead to performance detriments, then encouraging the perception of \nblurred boundaries will have little effect. It is the processes behind stereotype threat that lead to \nperformance detriment, not the stereotypes themselves. Therefore, so working against the stereotype (i.e. \nemphasizing similarities between females and males) after it has set these processes in motion will have \nlittle positive effect. \nGeneral discussion \nThe experiments presented here tested whether the application of an overlapping characteristics \ntask derived from bias-reduction literature would have beneficial effects on stereotype threat. \nExperiment 1 established the usefulness of the task for reducing bias in career choices. Female \nparticipants who generated overlapping characteristics between males and females subsequently showed \na lower preference for stereotypically female careers relative to stereotypically male careers, compared to \na baseline condition. The benefit of emphasizing overlapping characteristics was reinforced in \nExperiment 2 within a second domain, the highly examined stereotype threat arena of women and math \nperformance. Participants who completed the overlapping characteristics task completed more questions \ncorrectly than participants in both the baseline and difference conditions. Finally, in Experiment 3 we \nexplicitly activated threat, by informing the participants that their results would be compared to men, yet \nthose who received the overlapping characteristics task, before receiving the threat, still completed \nsignificantly more questions correctly than either a threat alone or baseline condition. We discuss the \ntheoretical and practical implications of these findings below. \nTheoretical Implications \nWe observed a reduction of stereotypical career preference and greater performance on math \ntests for participants who carried out the overlapping characteristics task. The task appeared to be most \nsuccessful when it was presented before an explicit threat, which suggests that the task‟s use may lie in \npreventing stereotype threat from emerging in the first place, rather than alleviating threat once it is \ninstigated. To our knowledge, this is the first intervention in the stereotype threat literature that focuses \non changing the perceived distinction between relevant social categories. \nReducing stereotype threat 21 \nThe overlapping characteristics task is derived from models developed to encourage reductions \nin prejudice, discrimination, and bias between groups. This indicates that the benefits of such \ninterventions used to reduce prejudicial attitude, which focus on reducing the salience of intergroup \nboundaries, can be generalized to the domain of stereotype threat. In turn, this suggests that \ncategorization, and specifically the salience of the categories involved, is central to the emergence of \nstereotype threat. This finding supports previous stereotype threat research which has noted the \nimportance of the salience of the stereotype (Keller, 2002). As such, the findings help support the meta-\ntheoretical centrality of category salience as a key predictor of attitudes and behavior. Importantly, as in \nthe bias-reduction domain, this does not rule out other potential explanations. Rather, the categorization \nmodel outlines a pre-requisite role for observing biased attitudinal (prejudice) or behavioral (stereotype \nthreat) effects. Quite simply biases resulting from thinking categorically depend upon category salience. \nThe findings here support the notion that anything that weakens the salience of distinctive social \ncategorization can correspondingly weaken category-related effects. Stereotype threat will be less likely to \noccur if the categories that embody the stereotype become less salient. From a wider perspective, these \nfindings help to integrate work in the stereotype threat domain with work on prejudice and \ndiscrimination, providing a theoretical link between attitudinal and behavioral assimilation literature. \nWith respect to future work, while the overlapping characteristics task used here appears to have \nbeen successful, it would be useful to test whether other similar models for reducing categorical \ndifferentiation (and bias) can also be applied to the stereotype threat domain. These might include using \nthe crossed categorization approach (where a single overlapping category is made salient) or the common \ningroup identity model (where a single overlapping superordinate category is made salient). Until then, the \ncurrent findings lend strong support for the basic idea that blurring intergroup boundaries may be a \nbeneficial tool for reducing stereotype threat. \nPractical Implications \nExperiment 3 established that participants in our baseline conditions experienced threat effects \nto the same level as when we explicitly induced threat. This supports previous studies which have \nReducing stereotype threat 22 \nconcluded that stereotype threat is inherent in relevant situations, i.e. simply being in a situation \nassociated with a negative stereotype can result in stereotype threat. This, of course, reinforces the \nimportance of developing interventions designed to alleviate such negative behavioral tendencies. Also, it \nhas previously been stated that math tasks need to be difficult to induce stereotype threat, however, in \ncomparison to questions on the Scholastic Aptitude Test (SAT) and Graduate Record Examination \n(GRE), which many stereotype threat studies use, the questions the participants received here were \nrelatively easy. However, the participants had a limited amount of time to complete the questions, which \nmay have added urgency and pressure to the task, thus making it more difficult. Likewise, there were no \nmultiple choice responses which should have added a level of difficulty, by reducing the possibility of \ncorrectly guessing. As such, the questions used appear to be of sufficient difficulty for the participants, \nwhich is illustrated by the absence of any notable ceiling effects. However, even if one could argue that \nthe questions were of a relatively easy level, if such biases can occur at such a level this again reinforces \nthe need to develop means to attenuate stereotype threat effects. The overlapping characteristics task \nemployed here, and by extension other existing models for reducing categorical differentiation, offer \nsuch a means for reducing a stereotype threat. The reported studies are a first step, and future work will \nneed to refine such methods and extent them beyond the laboratory to test their applicability to policy \nand practice. \nConclusion \n In this research we aimed to examine the applicability of categorization models for reducing \nprejudice in the stereotype threat domain. The results of the three experiments presented here offer \nsupport for the notion that interventions used for reducing bias can be applied to stereotype threat \nresearch with success. The experiments found that participants who focused on characteristics which \noverlapped between the genders, compared to those who did not, completed more math questions \ncorrectly and preferred significantly less stereotypical careers. These findings support the notion that \nsuch categorization models can be generalized to the stereotype threat domain and that blurring \nintergroup boundaries can offer the potential for reducing stereotype threat.   \nReducing stereotype threat 23 \nReferences \nAronson, J., Fried, C.B., & Good, C. (2002). Reducing the effects of stereotype threat on African \nAmerican college students by shaping theories of intelligence. Journal of Experimental Social Psychology, 38, \n113-125. \nAronson, J., Lustina, M.J., Good, C., Keough, K., Steele, C.M., & Brown, J. (1999). When white \nmen can't do math: Necessary and sufficient factors in stereotype threat. Journal of Experimental Social \nPsychology, 35, 29-46. \nBlascovich, J., Spencer, S.J., Quinn, D., & Steele, C. (2001). African Americans and high blood \npressure: The role of stereotype threat. Psychological Science, 12, 225-229. \nBosson, J.K., Haymovitz, E.L., & Pinel, E.C. (2004) When saying and doing diverge: The effects \nof stereotype threat on self-reported versus non-verbal anxiety. Journal of Experimental Social Psychology, 40, \n247-255. \nBrewer, M.B. (1979). Ingroup bias in the minimal intergroup situation: A cognitive-motivational \nanalysis. Psychological Bulletin, 86, 307-324. \nBrewer, M.B. (1991). The social self – on being the same and different at the same time. \nPersonality and Social Psychology Bulletin, 17, 475-482. \nBrewer, M.B., & Miller, N. (1984). Beyond the contact hypothesis: Theoretical perspectives on \ndesegregation. In N. Miller & M.B. Brewer (Eds.), Groups in contact: The psychology of depression (pp. 281-\n302). Orlando, FL: Academic Press.  \nBrown, R.P., & Pinel, E.C. (2003). Stigma on my mind: Individual differences in the experience \nof stereotype threat. Journal of Experimental Social Psychology, 39, 626-633. \nCadinu, M., Maass, A., Frigerio, S., Impagliazzo, L., & Latinotti, S. (2003). Stereotype threat: The  \neffect of expectancy on performance. European Journal of Social Psychology, 33, 267-285. \nCocker, R.M. (2004). Social identification and shared characteristics: Routes to bias-reduction. \nUnpublished MPhil dissertation. \nCrisp, R., & Beck, S. (2005). Reducing intergroup bias: The moderating role of ingroup \nReducing stereotype threat 24 \nidentification. Group Processes & Intergroup Relations, 8, 173-186. \nCrisp, R.J., Ensari, N., Hewstone, M., & Miller, N. (2002). A dual-route model of crossed \ncategorisation effects. In W. Strobe & M. Hewstone (Eds.), European Review of Social Psychology (Vol. 13, \npp. 35-73). Hove, UK & Philadelphia, PA: Psychology Press. \nCrisp, R.J., & Hewstone M. (1999). Differential evaluation of crossed category groups: Patterns, \nprocesses and reducing intergroup bias. Group Processes & Intergroup Relations, 2, 307-333. \nCrisp, R.J., Hewstone M., & Rubin, M. (2001). Does multiple categorization reduce intergroup \nbias? Personality and Social Psychology Bulletin, 27, 76-89. \nCroizet, J.-C., & Claire, T. (1998). Extending the concept of stereotype threat to social class: The \nintellectual underperformance of students from low socioeconomic backgrounds. Personality and Social \nPsychology Bulletin, 24, 588-594. \nDavies, P.G., Spencer, S.J., Quinn, D.M., & Gerhardstein, R. (2002). Consuming images: How \ntelevision commercials that elicit stereotype threat can restrain women academically and professionally. \nPersonality and Social Psychology Bulletin, 28, 1615-1628. \nDepartment for Education and Skills (2004). GCSE\/GNVQ and Key Stage 3 to GCSE\/GNVQ \nvalue added measures for young people in England, 2002\/03 (final) (SFR 24\/2004). London, UK: Department \nfor Education and Skills. \nDepartment for Education and Skills (2004). GCE\/VCE A\/AS examination results for young people \nin England, 2002\/03 (final) (SFR 24\/2004). London, UK: Department for Education and Skills. \nDeschamps, J.-C., & Doise, W. (1978). Cross category memberships in intergroup relations. In \nH. Tajfel (Ed.), Differentiation between social groups: Studies in the social psychology of intergroup relations (pp. 141-\n158). London: Academic Press. \nDoise, W. (1978). Groups and individuals: Explanations in social psychology. Cambridge: Cambridge \nUniversity Press. \nEqual Opportunities Commission (2004). Facts about women and men in Great Britain. Manchester, \nUK: Equal Opportunities Commission. \nReducing stereotype threat 25 \nGaertner, S.L., & Dovidio, J.F. (2000). Reducing intergroup bias: The common ingroup identity model. \nPhiladelphia, PA: The Psychological Press\/ Taylor & Francis. \nGaertner,.S.L., Mann, J.A., Dovidio, J.F., Murrell, A.J., & Pomare, M. (1990). How does \ncooperation reduce intergroup bias? Journal of Personality and Social Psychology, 59, 692-704. \nGaertner, S.L., Mann, J., Murrell, A., & Dovidio, J.F. (1989). Reducing intergroup bias: The \nbenefits of recategorization. Journal of Personality and Social Psychology, 57, 239-249. \nGood, C., Aronson, J., & Inzlicht, M. (2003). Improving adolescents' standardized test \nperformance: An intervention to reduce the effects of stereotype threat. Journal of Applied Developmental \nPsychology, 24, 645-662. \nHewstone, M., & Brown, R. (1986). Contact is not enough: An intergroup perspective on the \n„contact hypothesis‟. In M. Hewstone & R. Brown (Eds.), Contact and conflict in intergroup encounters (pp. 1-\n44). Oxford: Blackwell. \nInzlicht, M., & Ben-Zeev, T. (2000). A threatening intellectual environment: Why females are \nsusceptible to experiencing problem-solving deficits in the presence of males. Psychological Science, 11, 365-\n371. \nJosephs, R.A., Newman, M.L., Brown, R.P., & Beer, J.M. (2003). Status, testosterone, and human \nintellectual performance: Stereotype threat as status concern. Psychological Science, 14, 158-163. \nKeller, J. (2002). Blatant stereotype threat and women‟s math performance: Self-handicapping as \na strategic means to cope with obtrusive negative performance expectations. Sex Roles, 47, 193-198. \nKeller, J., & Dauenheimer, D. (2003). Stereotype threat in the classroom: Dejection mediates the \ndisrupting threat effect on women‟s math performance. Personality and Social Psychology Bulletin, 29, 371-\n381. \nLeyens, J-P., Désert, M., Croizet, J-C., & Darcis, C. (2000). Stereotype threat: Are lower status \nand history of stigmatization preconditions of stereotype threat? Personality and Social Psychology Bulletin, 26, \n1189-1199. \nMarcus-Newhall, A., Miller, N., Holtz, R., & Brewer, M.B. (1993) Cross-cutting category \nReducing stereotype threat 26 \nmembership with role assignment: A means of reducing intergroup bias. British Journal of Social Psychology, \n32, 125-146. \nMarx, D.M., & Roman, J.S. (2002). Female role models: Protecting women‟s math test \nperformance. Personality and Social Psychology Bulletin, 28, 1183-1193. \nMcIntyre, R.B., Paulson, R.M., & Lord, C.G. (2003) Alleviating women‟s mathematics stereotype \nthreat through salience of group achievements. Journal of Experimental Social Psychology, 39, 83-90. \nMiller, N., Brewer, M.B., & Edwards, K. (1985). Cooperation interaction in desegregated settings: \nA laboratory analog. Journal of Social Issues, 41, 63-79. \nMullen, B., Brown, R., & Smith, C. (1992). Ingroup bias as a function of salience, relevance, and \nstatus: An interaction. European Journal of Social Psychology, 22, 103-122. \nMullen, B., Migdal, M.J., & Hewstone, M. (2001). Crossed categorization vs. simple \ncategorization and intergroup evaluations: A meta-analysis. European Journal of Social Psychology, 31, 721-\n736. \nMussweiler, T. (2001). „Seek and ye shall find‟: Antecedents of assimilation and contrast in social \ncomparison. European Journal of Social Psychology, 31, 499-509. \nNosek, B.A., Banaji, M.R., & Greenwald, A.G. (2002). Math = male, me = female, therefore \nmath  me. Journal of Personality and Social Psychology, 83, 44-59. \nOakes, P.J., Haslam, S.A., & Turner, J.C. (1994) Stereotyping and social reality. Oxford: Blackwell. \nOsborne, J.W. (2001). Testing stereotype threat: Does anxiety explain race and sex differences in \nachievement? Contemporary Educational Psychology, 26, 291-310. \nOuwerkerk, J.W., de Gilder, D., & de Vries, N.K. (2000). When the going gets tough, the tough \nget going: Social identification and individual effort in intergroup competition. Personality and Social \nPsychology Bulletin, 26, 1550-1559. \nPettigrew, T.F. (1998). Intergroup contact theory. Annual Review of psychology, 49, 65-85. \nPronin, E., Steele, C.M., & Ross, L. (2004). Identity bifurcation in response to stereotype threat: \nWomen and mathematics. Journal of Experimental Social Psychology, 40, 152-168. \nReducing stereotype threat 27 \nQuinn, D.M., & Spencer, S.J. (2001). The interference of stereotype threat with women‟s \ngeneration of mathematical problem-solving strategies. Journal of Social Issues, 57, 55-71. \nRoberson, L., Deitch, E.A., Brief, A.P., & Block, C.J. (2003). Stereotype threat and feedback \nseeking in the workplace. Journal of Vocational Behavior, 62, 176-188. \nSchmader, T. (2002). Gender identification moderates stereotype threat effects on women‟s math \nperformance. Journal of Experimental Social Psychology, 38, 194-201. \nSchmader, T., & Johns, M. (2003) Converging evidence that stereotype threat reduces working \nmemory capacity. Journal of Personality and Social Psychology, 85, 440-452. \nSekaquaptewa, D., & Thompson, M. (2002). Solo status, stereotype threat, and performance \nexpectancies: Their effects on women‟s performance. Journal of Experimental Social Psychology, 39, 68-74. \nSmith, J.L., & White, P.H. (2002) An examination of implicitly activated, explicitly activated, and \nnullified stereotypes on mathematical performance: It‟s not just a woman‟s issue. Sex Roles,47, 179-191. \nSpencer, S.J., Steele, C.M., & Quinn, D.M. (1999). Stereotype threat and women‟s math \nperformance. Journal of Experimental Social Psychology, 35, 4-28. \nStangor, C., Carr, C., & Kiang, L. (1998). Activating stereotypes undermines task performance \nexpectations. Journal of Personality and Social Psychology, 75, 1191-1197. \nSteele, C.M. (1997). A threat in the air: How stereotypes shape intellectual identity and \nperformance,. American Psychologist, 52, 613-629. \nSteele, C.M., & Aronson, J. (1995). Stereotype threat and the intellectual test performance of \nAfrican Americans. Journal of Personality and Social Psychology, 69, 797-811. \nStone, J. (2002). Battling doubt by avoiding practice: The effects of stereotype threat on self-\nhandicapping in white athletes. Personality and Social Psychology Bulletin, 28, 1667-1678. \nStone, J., Lynch, C.I., Sjomeling, M., & Darley, J.M. (1999). Stereotype threat effects on black and \nwhite athletic performance. Journal of Personality and Social Psychology, 77, 1213-1227. \nTajfel, H., Billig, M.G., Bundy, R.P., & Flament, C. (1971). Social categorization and intergroup \nbehavior. European Journal of Social Psychology, 1, 149-178. \nReducing stereotype threat 28 \nTajfel, H., & Turner, J.C. (1979). An integrative theory of intergroup conflict. In W.G. Austin & \nS. Worchel (Eds.), The social psychology of intergroup relations (pp. 33-47). Monterey, CA: Brooks\/Cole. \nTurner, J.C., Hogg, M.A., Oakes, P.J., Reicher, S.D., & Wetherell, M.S. (1987). Re-discovering the \nsocial groups: A self-categorization theory. Oxford: Blackwell. \nVanbeselaere, N. (1987). The effects of dichotomous and crossed social categorizations upon \nintergroup discrimination. European Journal of Social Psychology, 17, 143-156. \n \nReducing stereotype threat 29 \nAuthor note \nHarriet E.S. Rosenthal, Richard J. Crisp, University of Birmingham, UK. \nCorrespondence concerning this article should be addressed to H.E.S. Rosenthal or R. J. Crisp at \nthe School of Psychology, University of Birmingham, Edgbaston, Birmingham, B15 2TT, UK. Tel: +44 \n(0)121 414 2942\/(0)121 414 3335. Fax +44 (0)121 414 4897. E-mail: her288@bham.ac.uk or \nr.crisp@bham.ac.uk. Thanks to Kip Williams, Joshua Aronson and one anonymous reviewer for their \nhelpful comments on an earlier version of this manuscript. The authors would also like to thank \neverybody who attended the EAESP small group meeting „Understanding the academic \nunderachievement of low status group members‟, Paris, June 2004, for their interest and instructive \ncomments. Thanks to Emma Haycraft and Laura Bache for help with coding. \n \n \n \n \nReducing stereotype threat 30 \n Table 1.Career preference as a function of task, Experiment 1. \n  Female stereotypical \ncareers \nMale stereotypical \ncareers \nRelative preference for \nfemale stereotypical \ncareers  \n  M SD M SD M SD \nBaseline   5.13 1.34 2.29 1.24 2.85 1.26 \nOverlap  4.09 2.24 2.69 1.84 1.40 1.54 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nReducing stereotype threat 31 \nTable 2.Number of math questions answered correctly, as a function of task, Experiment 2. \n Number of correct math questions \n M SD \nBaseline  4.80 1.55 \nOverlap  6.83 1.80 \nDifference  5.43 1.95 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nReducing stereotype threat 32 \nTable 3.Number of math questions answered correctly, as a function of task, Experiment 3. \n \n Number of correct math questions  \n M SD \nBaseline 5.21 2.22 \nThreat  6.20 1.90 \nOverlap-threat  7.58 1.78 \nThreat-overlap  6.00 2.08 \n \n"}