{"doi":"10.1017\/S0954102008001703","coreId":"61057","oai":"oai:nora.nerc.ac.uk:6976","identifiers":["oai:nora.nerc.ac.uk:6976","10.1017\/S0954102008001703"],"title":"Compilation of a new bathymetric dataset of South Georgia","authors":["Fretwell, P.T.","Tate, Alex","Deen, Tara","Belchier, Mark"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009","abstract":"We introduce a new bathymetric compilation of the area around South Georgia in the Southern\\ud\nOcean. Using a variety of data sources including multi and single-beam swath bathymetry we have\\ud\nconstructed a gridded bathymetric dataset of the shelf and near-shelf sea-floor areas. The grid has been\\ud\nconstructed using a layered hierarchy dependent upon accuracy of each dataset. The spikes and errors have\\ud\nbeen checked both manually and with a novel semi-automated process. We discuss the resulting\\ud\nbathymetry and the potential uses of the new datase","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/61057.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/6976\/1\/Fretwell170.pdf","pdfHashValue":"176396b803c14da00ccdcdcf796dafc3cf50c5f7","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:6976<\/identifier><datestamp>\n      2012-11-22T11:59:35Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533230<\/setSpec><setSpec>\n      7375626A656374733D533137<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/6976\/<\/dc:relation><dc:title>\n        Compilation of a new bathymetric dataset of South Georgia<\/dc:title><dc:creator>\n        Fretwell, P.T.<\/dc:creator><dc:creator>\n        Tate, Alex<\/dc:creator><dc:creator>\n        Deen, Tara<\/dc:creator><dc:creator>\n        Belchier, Mark<\/dc:creator><dc:subject>\n        Marine Sciences<\/dc:subject><dc:subject>\n        Hydrology<\/dc:subject><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        We introduce a new bathymetric compilation of the area around South Georgia in the Southern\\ud\nOcean. Using a variety of data sources including multi and single-beam swath bathymetry we have\\ud\nconstructed a gridded bathymetric dataset of the shelf and near-shelf sea-floor areas. The grid has been\\ud\nconstructed using a layered hierarchy dependent upon accuracy of each dataset. The spikes and errors have\\ud\nbeen checked both manually and with a novel semi-automated process. We discuss the resulting\\ud\nbathymetry and the potential uses of the new dataset<\/dc:description><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:date>\n        2009<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/6976\/1\/Fretwell170.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Fretwell, P.T.; Tate, Alex; Deen, Tara; Belchier, Mark.  2009  Compilation of a new bathymetric dataset of South Georgia.   Antarctic Science, 21 (2). 171-174.  https:\/\/doi.org\/10.1017\/S0954102008001703 <https:\/\/doi.org\/10.1017\/S0954102008001703>     \n <\/dc:identifier><dc:relation>\n        doi:10.1017\/S0954102008001703<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/6976\/","doi:10.1017\/S0954102008001703"],"year":2009,"topics":["Marine Sciences","Hydrology","Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Compilation of a new bathymetric dataset of South Georgia\nP.T. FRETWELL*, A.J. TATE, T.J. DEEN and M. BELCHIER\nBritish Antarctic Survey, NERC, High Cross, Madingley Road, Cambridge CB3 0ET, UK\n*ptf@bas.ac.uk\nAbstract: We introduce a new bathymetric compilation of the area around South Georgia in the Southern\nOcean. Using a variety of data sources including multi and single-beam swath bathymetry we have\nconstructed a gridded bathymetric dataset of the shelf and near-shelf sea-floor areas. The grid has been\nconstructed using a layered hierarchy dependent upon accuracy of each dataset. The spikes and errors have\nbeen checked both manually and with a novel semi-automated process. We discuss the resulting\nbathymetry and the potential uses of the new dataset.\nReceived 5 June 2008, accepted 17 October 2008\nKey words: grid, oceanography, Scotia Sea, Southern Ocean\nIntroduction\nThe island of South Georgia lies to the south of the Polar Front\nin the South Atlantic Ocean. The island is narrow, c. 190 km\nlong but never more than 35 km wide, characterized by steep\nmountainous terrain rising to 2934 m. Offshore a wide\ncontinental shelf extends 30–100 km from the coast. The\nisland constitutes part of the Scotia Ridge, a mainly\nsubmarine arc that divides the Scotia Sea Plate from the\nAmerican Plate. This ridge continues to the north-west of\nSouth Georgia to another block of continental shelf around\nthe small islands of Shag and Black rocks some 240 km\naway. Beyond the continental shelf the continental slope\ndrops to the abyssal plain, which has a maximum depth in\nthis region of 4750 m. The island lies in the eastward\nflowing Antarctic Circumpolar Current (ACC), with the\nsouthern edge of the continental shelf bounding the Southern\nAntarctic Circumpolar Current Front. The main flow of the\nACC is deflected sharply northwards by the continental shelf\nwest of Shag Rocks, although some of the flow is directed\nthrough the channel between Shag Rocks and South Georgia.\nA requirement for high-resolution bathymetric data in the\narea has been identified across a range of scientific\ndisciplines. These include the development of high resolution\noceanographic models for the South Georgia region,\nassessing the extent of Quaternary ice (Graham et al. 2008),\nand investigations of the structural geology of the island.\nDetailed bathymetric information of South Georgia is also\nrequired to assist with the identification of seabed habitats\nthat are threatened by fishing, and for marine habitat\nidentification and fisheries management. Previous estimates\nof seabed depths have been conducted from nautical charts\n(Everson & Campbell 1991), which for many areas of the\nSouth Georgia maritime region are known to be unreliable as\nthey rely on limited soundings data.\nAlthough bathymetric data have been collected in the area\nfor many years, no high-resolution grid of the whole area has\npreviously been compiled.\nPrevious gridded datasets of the area have been at\nresolutions too low to be useful in an area as small as\nSouth Georgia. The General Bathymetric Chart of the\nOceans (IOC et al. 2003) has, until now, been the best\npublicly available dataset of the whole region. GEBCO is a\nglobal dataset, so is necessarily generalized; it is sampled\nat one minute of arc (1.35 km by 2.2 km at this latitude). It\nshows little of the detail of the new 150 m resolution grid.\nThe new South Georgia Bathymetric Dataset (SGBD)\nintroduced in this paper is a high-resolution gridded raster\nsampled at 150 m resolution. Its geographical extent\nstretches between 34–448W and 53–568S. Figure 1 shows\nareas of interest within the grid. The grid includes the area\ncontained within the Commission for the Conservation of\nAntarctic Marine Living Resources sub-area 48.3.\nMethodology\nThe data\nSeveral bathymetric data sources were used to compile the\nnew grid. Figure 1 identifies the coverage of relevant data\nsources and Table I shows the relative amounts of data\nused. We used a nested hierarchy for the data with more\naccurate datasets given priority over poorer quality data.\nMultibeam\nMultibeam swath bathymetry data have been collected by\nRRS James Clark Ross (JCR) since 2000 when a\nKongsberg EM120 system was fitted to the vessel. The\nEM120 is primarily a deep-water echo sounder operating at\n12 KHz and returns 191 beams per ping. Multibeam\nacquisition occurs on both scientific cruises and\nopportunistically during passage legs. There are 16 JCR\ncruise legs that have contributed to the South Georgia\nbathymetric compilation and these have been post-\nprocessed in a variety of ways. Earlier data have been\n1\nAntarctic Science page 1 of 4 (2008) & Antarctic Science Ltd 2008 doi:10.1017\/S0954102008001703\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n61\n62\n63\n64\n65\n66\n67\n68\n69\n70\n71\n72\n73\n74\n75\n76\n77\n78\n79\n80\n81\n82\n83\n84\n85\n86\n87\n88\n89\n90\n91\n92\n93\n94\n95\n96\n97\n98\n99\n100\n101\n102\n103\n104\n105\n106\n107\n108\n109\n110\nprocessed using Kongsberg’s Neptune software while more\nrecent cruises have been processed using MB-System\n(Caress & Chayes 2006, http:\/\/www.ldeo.columbia.edu\/res\/\npi\/MB-System). Hour files processed by Neptune typically\nhave a min\/max filter applied, determined by the local\nconditions to get rid of outliers. An average surface is then\ncalculated using Neptune’s BinStat program and points\nmore than 3 standard deviations away from this surface are\nremoved. The remaining edits are done manually using a\ngraphical interface. Hour files processed by MB-System\nalso have a min\/max filter applied but the remainder of the\nedits are manual. The ratio between manual and automated\ncleaning is approximately 70\/30 for Neptune processing\nand 90\/10 for MB-System processing.\nIn addition to the JCR data there is a limited amount of\nmultibeam data collected by HMS Endurance. A shallow-\nwater (,1000 m) Kongsberg EM710 echo sounder was\nfitted to the vessel in 2005. Cleaned xyz data from a\ncircumnavigation around the South Georgia shelf has been\nprovided by the UK Hydrographic Office (UKHO) and\nincorporated into the grid. The UKHO data comply with\nthe International Hydrographic Office S44 standard for\nhydrographic surveys (Wells & Monahan 2002).\nSinglebeam\nThe bathymetric chart includes singlebeam data collected by the\nJCR, theHMSEndurance, and several fishery vessels including\nthe Fishery Patrol Vessel Dorada. JCR data are acquired by a\nKongsberg EA600 echo sounder and have been post-\nprocessed using Geosoft Oasis Montaj software. Within\nGeosoft, the singlebeam data are edited manually. Data from\nother vessels have been provided as post-processed xyz files.\nHydrographic charts and other datasets\nTertiary data came from soundings and coastlines digitized\nfrom Hydrographic Charts (HO charts nos 3596 and 3597)\nalong with a detailed coastline from the BAS (Misc) 12a\n1:200 000 map of South Georgia (2004). These were used\nwhere no multibeam or single beam swath was available.\nFinally, in some areas GEBCO data have been used to\nsupplement the dataset. These data have only been used in\nthe north-east of the region where the single beam\ncoverage is poor and the GEBCO data matches well with\nthe other inputs.\nFig. 1. Datasets used and respective coverage and places named in the text.\nTable I. Comparative coverage of the datasets used\nDataset area (km2) % area\nMultibeam 73 630 34.59\nSinglebeam 40 863 19.20\nGEBCO 6662 3.13\nHO soundings na na\nCoastline na na\nNo data 91 670 43.08\nna ¼ not available\nP.T. FRETWELL et al.2\n111\n112\n113\n114\n115\n116\n117\n118\n119\n120\n121\n122\n123\n124\n125\n126\n127\n128\n129\n130\n131\n132\n133\n134\n135\n136\n137\n138\n139\n140\n141\n142\n143\n144\n145\n146\n147\n148\n149\n150\n151\n152\n153\n154\n155\n156\n157\n158\n159\n160\n161\n162\n163\n164\n165\n166\n167\n168\n169\n170\n171\n172\n173\n174\n175\n176\n177\n178\n179\n180\n181\n182\n183\n184\n185\n186\n187\n188\n189\n190\n191\n192\n193\n194\n195\n196\n197\n198\n199\n200\n201\n202\n203\n204\n205\n206\n207\n208\n209\n210\n211\n212\n213\n214\n215\n216\n217\n218\n219\n220\nAnalysis\nThe various datasets were brought into a GIS and re-\nprojected into Lambert Conformal Conic (LCC) projection\nto give a more realistic representation of the shape of\nfeatures. All swath data were then re-sampled to 150 m\n(approximately 1\/8 of a degree) and converted to points to\nensure equal weighting of datasets. The TOPOGRID\nfunction based on ANUDEM (Hutchinson 1988) in ESRI’s\nArcGIS was used to convert the final input data to one\ncontinuous grid with a cell size of 150 m. The resulting\ngrid contained a number of data spikes, pits and areas of\nanomalous results. To remove these two processes were\nemployed. The first was an automated analysis based on\nslope analysis (Burrough 1986): the greatest angle of the\ncontinental shelf slope was calculated from reliable\nmultibeam swath on the shelf slope. Any angle of slope\ngreater than this was classed as unreliable and\nautomatically removed from the underlying dataset. This\nmethod proved a useful tool in identifying anomalous data\nand to help in smoothing between datasets. The second\nmethod was an iterative process to manually identify and\nremove disparate measurements, deep holes and edge\neffects resulting from the outer beams of multibeam swath.\nThis second process is similar to that used in the recently\ncompiled Amundsen Sea grid (Nitsche et al. 2007).\nThe resulting grid (Fig. 2) is available as an ArcGIS\nshapefile in LCC projection, or as an xyz ASCI file with\nlat\/long co-ordinates Both grids are available to download\nfrom http:\/\/www.antarctica.ac.uk\/bas_research\/data\/online_\nresources\/sgbd\/\nConclusion\nThe new SGDB shows a variety of new and interesting\nfeatures including detail of drowned glacial valleys and\ntrenches on the shelf north of the island. These give\nevidence of a large palaeo-ice cap (Graham et al. 2008). Its\nvolume may have been more than 40–60 000 km3,\nequivalent to ~12–19 cm of global sea level. Other shelf-\nedge features such as possible slump scars to the north-\nwest can be observed as well as geological faulting and sea\nmounts to the south-west of the area. It has also enabled a\nmuch more detailed assessment to be made of sea-bed\nareas (Belchier & Fretwell 2008) in order to refine the\nmanagement of commercially important demersal fish\nspecies at South Georgia.\nAcknowledgements\nWe thank Pete Morris for compiling the collection of single\nbeam data; Phil Leat for overseeing the BAS multibeam\nacquisition; the officers and crew of the RRS James Clarke\nRoss, HMS Endurance and Falkland Islands Fisheries\nvessels who collected the swath data.\nFig. 2. The South Georgia bathymetric dataset.\nNEW BATHYMETRIC DATASET OF SOUTH GEORGIA 3\n221\n222\n223\n224\n225\n226\n227\n228\n229\n230\n231\n232\n233\n234\n235\n236\n237\n238\n239\n240\n241\n242\n243\n244\n245\n246\n247\n248\n249\n250\n251\n252\n253\n254\n255\n256\n257\n258\n259\n260\n261\n262\n263\n264\n265\n266\n267\n268\n269\n270\n271\n272\n273\n274\n275\n276\n277\n278\n279\n280\n281\n282\n283\n284\n285\n286\n287\n288\n289\n290\n291\n292\n293\n294\n295\n296\n297\n298\n299\n300\n301\n302\n303\n304\n305\n306\n307\n308\n309\n310\n311\n312\n313\n314\n315\n316\n317\n318\n319\n320\n321\n322\n323\n324\n325\n326\n327\n328\n329\n330\nReferences\nBELCHIER, M. & FRETWELL, P. 2008. Revised estimates of the area of the\nSouth Georgia and Shag Rocks shelf (CCAMLR Subarea 48.3).\nCCAMLR-WG-SAM-08\/10. Hobart: CCAMLR.\nBURROUGH, P.A. 1986. Principles of Geographical Information Systems\nfor land resources assessment. New York: Oxford University Press,\n50 pp.\nEVERSON, I. & CAMPBELL, S. 1991. Area of seabed within selected depth\nranges in CCAMLR subarea 48.3, South Georgia. SC-CCAMLR-SSP\/7,\n1990, WG-FAS-90-8, 459–466.\nIOC, IHO & BODC. 2003. Centenary Edition of the GEBCO Digital Atlas.\nPublished on CD-ROM on behalf of the Intergovernmental\nOceanographic Commission and the International Hydrographic\nOrganization as part of the General Bathymetric Chart of the Oceans,\nLiverpool: British Oceanographic Data Centre.\nGRAHAM, A.G.D., FRETWELL, P.T., LARTER, R.D., HODGSON, D.A., WILSON,\nC.K., TATE, A.J. & MORRIS, P. 2008. New bathymetric compilation\nhighlights extensive paleo-ice sheet drainage on continental shelf,\nSouth Georgia, sub-Antarctica. Geochemistry, Geophysics, Geosystems,\n9, 1–21.\nHUTCHINSON, M.F. 1988. Calculation of hydrologically sound digital\nelevation models. Third International Symposium on Spatial Data\nHandling, Sydney. Columbus, OH: International Geographical Union,\n117–133.\nNITSCHE, F.O., JACOBS, S.S., LARTER, R.D. & GOHL, K. 2007. Bathymetry\nof the Amundsen Sea continental shelf: implications for geology,\noceanography, and glaciology. Geochemistry, Geophysics, Geosystems,\n8, 10.1029\/2007GC001694.\nWELLS, D. & MONAHAN, D. 2002. IHO S44 Standards for Hydrographic\nSurveys and the variety of requirements for bathymetric data. The\nHydrographic Journal, 104, 9–16.\nP.T. FRETWELL et al.4\n331\n332\n333\n334\n335\n336\n337\n338\n339\n340\n341\n342\n343\n344\n345\n346\n347\n348\n349\n350\n351\n352\n353\n354\n355\n356\n357\n358\n359\n360\n361\n362\n363\n364\n365\n366\n367\n368\n369\n370\n371\n372\n373\n374\n375\n376\n377\n378\n379\n380\n381\n382\n383\n384\n385\n386\n387\n388\n389\n390\n391\n392\n393\n394\n395\n396\n397\n398\n399\n400\n401\n402\n403\n404\n405\n406\n407\n408\n409\n410\n411\n412\n413\n414\n415\n416\n417\n418\n419\n420\n421\n422\n423\n424\n425\n426\n427\n428\n429\n430\n431\n432\n433\n434\n435\n436\n437\n438\n439\n440\n"}