{"doi":"10.1016\/j.soilbio.2009.03.022","coreId":"61964","oai":"oai:nora.nerc.ac.uk:5457","identifiers":["oai:nora.nerc.ac.uk:5457","10.1016\/j.soilbio.2009.03.022"],"title":"Spatial and temporal variability in CH4 and N2O fluxes from a Scottish ombrotrophic peatland: implications for modeling and upscaling","authors":["Dinsmore, Kerry J.","Skiba, Ute M.","Billett, Michael F.","Rees, Robert M.","Drewer, Julia"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-06","abstract":"Peatlands typically exhibit significant spatial heterogeneity which can lead to large uncertainties when catchment scale greenhouse gas fluxes are extrapolated from chamber measurements (generally <1 m2). Here we examined the underlying environmental and vegetation characteristics which led to within-site variability in both CH4 and N2O emissions and the importance of such variability in up-scaling. We also consider within-site variation in the controls of temporal dynamics. Net annual emissions (and coefficients of variation) for CH4 and N2O were 1.06 kg ha−1 y−1 (300%) and 0.02 kg ha−1 y−1 (410%), respectively. The riparian zone was a significant CH4 hotspot contributing 12% of the total catchment emissions whilst covering only 0.5% of the catchment area. In contrast to many other studies we found smaller CH4 emissions and greater uptake in chambers containing either sedges or rushes. We also found clear differences in the drivers of temporal CH4 dynamics across the site, e.g. water table was important only in chambers which did not contain aerenchymous plants. We suggest that depending on the heterogeneity of the site, flux models could be improved by incorporating a number of spatially distinct sub-models, rather than a single model parameterized using whole-catchment averages","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/61964.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/5457\/3\/DinsmoreN005457PP.pdf","pdfHashValue":"099a4a03b54889fa5c3cbf9d9ab7758f55682ee0","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:5457<\/identifier><datestamp>\n      2017-03-08T16:43:33Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/5457\/<\/dc:relation><dc:title>\n        Spatial and temporal variability in CH4 and N2O fluxes from a Scottish ombrotrophic peatland: implications for modeling and upscaling<\/dc:title><dc:creator>\n        Dinsmore, Kerry J.<\/dc:creator><dc:creator>\n        Skiba, Ute M.<\/dc:creator><dc:creator>\n        Billett, Michael F.<\/dc:creator><dc:creator>\n        Rees, Robert M.<\/dc:creator><dc:creator>\n        Drewer, Julia<\/dc:creator><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        Peatlands typically exhibit significant spatial heterogeneity which can lead to large uncertainties when catchment scale greenhouse gas fluxes are extrapolated from chamber measurements (generally <1 m2). Here we examined the underlying environmental and vegetation characteristics which led to within-site variability in both CH4 and N2O emissions and the importance of such variability in up-scaling. We also consider within-site variation in the controls of temporal dynamics. Net annual emissions (and coefficients of variation) for CH4 and N2O were 1.06 kg ha−1 y−1 (300%) and 0.02 kg ha−1 y−1 (410%), respectively. The riparian zone was a significant CH4 hotspot contributing 12% of the total catchment emissions whilst covering only 0.5% of the catchment area. In contrast to many other studies we found smaller CH4 emissions and greater uptake in chambers containing either sedges or rushes. We also found clear differences in the drivers of temporal CH4 dynamics across the site, e.g. water table was important only in chambers which did not contain aerenchymous plants. We suggest that depending on the heterogeneity of the site, flux models could be improved by incorporating a number of spatially distinct sub-models, rather than a single model parameterized using whole-catchment averages.<\/dc:description><dc:date>\n        2009-06<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/5457\/3\/DinsmoreN005457PP.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Dinsmore, Kerry J.; Skiba, Ute M.; Billett, Michael F.; Rees, Robert M.; Drewer, Julia.  2009  Spatial and temporal variability in CH4 and N2O fluxes from a Scottish ombrotrophic peatland: implications for modeling and upscaling.   Soil Biology and Biochemistry, 41 (6). 1315-1323.  https:\/\/doi.org\/10.1016\/j.soilbio.2009.03.022 <https:\/\/doi.org\/10.1016\/j.soilbio.2009.03.022>     \n <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/j.soilbio.2009.03.022<\/dc:relation><dc:relation>\n        10.1016\/j.soilbio.2009.03.022<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/5457\/","http:\/\/dx.doi.org\/10.1016\/j.soilbio.2009.03.022","10.1016\/j.soilbio.2009.03.022"],"year":2009,"topics":["Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":" \n \n \nArticle (refereed) \n \n \n \nDinsmore, Kerry J.; Skiba, Ute M.; Billett, Michael F.; \nRees, Robert M.; Drewer, Julia. 2009 Spatial and temporal \nvariability in CH4 and N2O fluxes from a Scottish \nombrotrophic peatland: implications for modeling and \nupscaling. Soil Biology and Biochemistry, 41 (6). 1315-\n1323. 10.1016\/j.soilbio.2009.03.022 \n \n \n \n \n© 2009 Elsevier Ltd \n \nThis version available at http:\/\/nora.nerc.ac.uk\/5457\/ \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the \njournal article, incorporating any revisions agreed during the peer \nreview process. Some differences between this and the publisher’s \nversion remain. You are advised to consult the publisher’s version \nif you wish to cite from this article. \n \nwww.elsevier.com \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnora@ceh.ac.uk \n 1 \n2 \n3 \n4 \n5 \n6 \n7 \n8 \n9 \n10 \n11 \n12 \n13 \n14 \n15 \n16 \n17 \n18 \n19 \n20 \n21 \n                                                \nSpatial and temporal variability in CH4 and N2O fluxes from a \nScottish ombrotrophic peatland; implications for modelling and \nupscaling \nKerry J. Dinsmore*, Ute M. Skiba*, Michael F. Billett*, Robert M Rees†, Julia \nDrewer* \n16 September 2008 \n \n* Centre for Ecology and Hydrology, Bush Estate, Penicuik, EH26 0QB \n† Scottish Agricultural College, The Kings Buildings, West Mains Road, Edinburgh \nEH9 3JG \n \nSubmission of ‘Research Paper’ for publication in Soil Biology and Biochemistry \nInformation on submitted article: \nText pages:  30 \nTables:  4 \nFigures:  3 \nCorresponding Author \nKerry J. Dinsmore \nTel:0131 445 8583 \nkjdi@ceh.ac.uk \n \n* Centre for Ecology and Hydrology, Bush Estate, Penicuik, UK, EH26 0QB \n 1\nAbstract 22 \n23 \n24 \n25 \n26 \n27 \n28 \n29 \n30 \n31 \n32 \n33 \n34 \n35 \n36 \n37 \n38 \n39 \nPeatlands typically exhibit significant spatial heterogeneity which can lead to \nlarge uncertainties when catchment scale greenhouse gas fluxes are extrapolated from \nchamber measurements (generally <1 m2). Here we examined the underlying \nenvironmental and vegetation characteristics which led to within-site variability in \nboth CH4 and N2O emissions and the importance of such variability in up-scaling. We \nalso consider within-site variation in the controls of temporal dynamics. Net annual \nemissions (and coefficients of variation) for CH4 and N2O were 1.06 kg ha-1 y-1 \n(300%) and 0.02 kg ha-1 y-1 (410%), respectively. The riparian zone was a significant \nCH4 hotspot contributing ~12% of the total catchment emissions whilst covering only \n~0.5% of the catchment area. In contrast to many other studies we found smaller CH4 \nemissions and greater uptake in chambers containing either sedges or rushes. We also \nfound clear differences in the drivers of temporal CH4 dynamics across the site, e.g. \nwater table was important only in chambers which did not contain aerenchymous \nplants. We suggest that depending on the heterogeneity of the site, flux models could \nbe improved by incorporating a number of spatially distinct sub-models, rather than a \nsingle model parameterized using whole-catchment averages.  \nGreenhouse Gases, Variability, Peatlands, Microtopography, Vegetation\n 2\n1. Introduction 40 \n41 \n42 \n43 \n44 \n45 \n46 \n47 \n48 \n49 \n50 \n51 \n52 \n53 \n54 \n55 \n56 \n57 \n58 \n59 \n60 \n61 \n62 \n63 \nNorthern peatlands are currently thought to act as net sinks of CO2 (Gorham, \n1991). However, due to the prevalence of waterlogged conditions, they represent a \nsignificant net source of CH4 (Bartlett and Harriss, 1993; Huttunen et al., 2003) and in \nsome cases a net source of N2O (Regina et al., 1996; Huttunen et al., 2002). In order \nto calculate a realistic global warming potential for peatland systems, all three of the \naforementioned gases need to be accurately quantified and upscaled. It is also \nbecoming increasingly important to understand what drives variability in the \nsink\/source strength of the various greenhouse gases (GHG), in order to predict the \nbiospheric feedback of peatlands in response to changes in peatland management and \nglobal climate.  \nThe availability of micrometeorological techniques has greatly improved our \nunderstanding of the temporal variability in CO2 emissions, revealing significant \npatterns in annual and inter-annual emissions (Lafleur et al., 2003; Lund et al., 2007). \nFurthermore, the availability of near-continuous datasets has led to a much greater \nunderstanding of the drivers of CO2 emission and uptake, allowing emission \npredictions to be made under different climate change scenarios (Griffis and Rouse, \n2001). Similar micrometeorological techniques for the measurement of CH4 and N2O \nare not widely used, with most current flux estimates from peatlands based on a series \nof enclosed chamber measurements (e.g. MacDonald et al., 1998; Whalen and \nReeburgh, 2000; Laine et al., 2007; Roulet et al., 2007). However, with many studies \nrepeatedly reporting high variability in fluxes both within and between sites (Bartlett \nand Harriss, 1993; Bubier et al., 1993; Waddington and Roulet, 1996), the uncertainty \nassociated with up-scaling chamber measurements to annual catchment budget \n 3\n64 \n65 \n66 \n67 \n68 \n69 \n70 \n71 \n72 \n73 \n74 \n75 \n76 \n77 \n78 \n79 \n80 \n81 \n82 \n83 \n84 \n85 \n86 \n87 \nestimates is often extremely large. Furthermore, such high uncertainty leads to \ndifficulties in identifying the primary drivers of temporal variability and hence \npredicting future emissions under different climate change scenarios or management \nregimes.    \nThe hummock\/hollow microtopography typical of many peatlands can cause \nsignificant variation in soil environmental conditions at scales not picked up by single \nchamber measurements (Nungesser, 2003). The preferential colonisation of \nhummocks or hollows by distinct plant communities reinforces differences due to \ntopography alone by influencing the quantity and quality of soil organic substrate, and \naltering the aerobic capacity of the peat by transporting O2 to the rhizosphere. Plants \ncontaining aerenchymous tissue can also provide a direct pathway for many GHGs to \nthe atmosphere, bypassing the aerobic peat horizon, and greatly increasing soil-\natmosphere fluxes (Whiting and Chanton, 1996; Ström et al., 2003; Minkkinen and \nLaine, 2006). A clear understanding of the major sources of variation within a site is \nessential both during the set-up of a study, when choosing where to place individual \nchambers, and during the up-scaling process so that individual chamber fluxes can be \ncorrectly weighted in the final estimate. Knowledge of expected variability is also \nrequired when deciding how many chambers are needed to achieve a specific level of \nconfidence in the results; however this statistically ideal number is often not met due \nto time constraints on both field sampling and analysis.  \nAlthough both temperature and water table have repeatedly been shown to be \nstrong drivers of temporal variability in surface CH4 and N2O fluxes, studies often \ndisagree as to their relative importance (Daulat and Clymo, 1998; Hargreaves and \nFowler, 1998; Updegraff et al., 2001). It is likely, given the degree of within-site \n 4\n88 \n89 \n90 \n91 \n92 \n93 \n94 \n95 \n96 \n97 \n98 \n99 \n100 \n101 \n102 \n103 \n104 \n105 \n106 \n107 \n108 \n109 \n110 \nvariability often observed, that the primary drivers of temporal variability are not \nconsistent across typical peatland sites. By examining how these drivers vary spatially \nthis study aims to improve our understanding of the underlying processes that control \nsurface emissions, and aid the design of future chamber studies to achieve the best \npossible up-scaled emission estimates.   \n2. Materials and Methods \n2.1. Site description \nAuchencorth Moss is a relatively flat, low lying, acid peatland, located \napproximately 17 km south of Edinburgh, Scotland (55º47’34 N; 3º14’35 W). The site \nis designated as a ‘supersite’ under the ‘European Monitoring and Evaluation \nProgramme’ (EMEP) and a ‘level-3’ site under the ‘NitroEurope’ project. Total \nnitrogen and sulphur deposition rates at the site are16.5 kg N ha-1 y-1 and 6.9 kg S ha-1 \ny-1, respectively (Smith, personal communication, 2008). The land-use is primarily \nlow-intensity sheep grazing with an area of peat extraction at the western edge of the \ncatchment. Histosols (peats) cover approximately 85% of the catchment with areas of \nGleysol (9%), Humic Gleysol (3%) and Cambisol (3%) occurring at the catchment \nmargins; peat depth ranges from <0.5 m to >5 m (Billett et al., 2004). Mean annual \nrainfall (1995-2006) at the site is 1016 mm (Coyle, unpublished data, 2008); \nmaximum and minimum monthly mean temperatures (1971-2000) are 19ºC in July \nand 0.7ºC in January, respectively (www.metoffice.gov.uk). The vegetation consists \nof a patchy mix of grasses, sedges and soft rush covering a base layer of moss on a \ntypical peatland hummock\/hollow microtopography. The dominant vascular species \ninclude Deschampsia flexuosa, Molinia caerulea, Festuca ovina, Eriophorum \n 5\nangustifolium, Eriophorum vaginatum, Juncus effusus, Juncus squarrosus and \nCalluna vulgaris; bryophytes are dominated by Sphagnum and Polytrichum species. \n111 \n112 \n113 \n114 \n115 \n116 \n117 \n118 \n119 \n120 \n121 \n122 \n123 \n124 \n125 \n126 \n127 \n128 \n129 \n130 \n131 \n132 \n133 \n2.2. Experimental design \nThe full study area was separated into 3 sites approximately 0.6 km apart to \ncover the full range of soil-plant conditions; site 1 was located in the west of the \ncatchment where drainage was better and patches of Calluna vulgaris were present; \nsite 2 was located roughly in the middle of the catchment with an even mix of \nhummocks dominated by grasses and sedges, hummocks dominated by J. effusus and \nhollows; site 3 was located in the riparian zone dominated by J. effusus. Site 3 is often \nreferred to as the ‘riparian zone’ throughout the text. In total, measurements were \nmade from 21 chambers; 9 within site 1, 9 within site 2, and 3 within site 3.  \nThe full study area was also separated into distinct \nmicrotopographic\/vegetative classes: plots dominated by C. vulgaris (Calluna), \nhummocks dominated by sedges and grasses (Sedge\/Hummock), hummocks \ndominated by J. effusus (Juncus\/Hummock), and hollows dominated by mosses \n(Hollow). Within site 1, 3 chambers were positioned on each of Calluna, \nSedge\/Hummock, and Juncus\/Hummock; within site 2, 3 chambers were positioned \non each of Sedge\/Hummock, Juncus\/Hummock and Hollow; the 3 chambers within \nsite 3 were all placed upon Juncus\/Hummocks. \nFlux measurements were made on all 21 chambers monthly from April 2006 \nuntil October 2007. An additional monthly measurement was made from each of the 9 \nchambers within site 2 from August 2006 until October 2007, leading to a fortnightly \nsampling frequency on 9 of the total 21 chambers, thus providing a better resolution \n 6\n134 \n135 \n136 \n137 \n138 \n139 \n140 \n141 \n142 \n143 \n144 \n145 \n146 \n147 \n148 \n149 \n150 \n151 \n152 \n153 \n154 \n155 \n156 \n157 \nfor examining temporal variability. Alongside flux measurements, soil temperature, \nmoisture, water table depth and soil respiration were recorded and samples of soil \natmosphere and soil water collected. Soil samples were collected monthly, though not \non the same day as flux measurements.  \n2.3. Flux measurements \nFlux measurements were made using the static chamber method described in \nLivingston and Hutchinson (1995). Polypropylene chamber bases were inserted into \nthe soil to a depth of approximately 5 cm; the chamber bases remained in situ for the \nduration of the study. Lids consisted of a flexible, transparent, dome of polyethylene \naffixed to a polypropylene flange which could be securely attached to the chamber \nbase during measurements (Clayton et al., 1994; MacDonald et al., 1996). The total \nenclosed volume was approximately 30 litres for chambers containing J. effusus and \napproximately 17 litres for all other chambers. Enclosure time generally ranged \nbetween 1-2 hours. As fluxes tended to be low, and direct sunlight or high \ntemperatures rarely a problem at the site, up to 2 hours were required to collect gas at \na sufficiently high concentration for accurate analysis. No significant levelling off of \nemissions was observed in the chambers with the highest recorded fluxes. Ambient air \nsamples were collected at time zero with a further two samples of chamber air \ncollected at the mid-point and end of the enclosure period. Air samples were stored in \ntedlar bags for up to one week prior to analysis using an HP5890 Series II gas \nchromatograph (detection limits: CO2 < 199 μl l-1 (ppmv), CH4 < 1.26 μl l-1, N2O < \n0.2 μl l-1) with electron capture (ECD) and flame ionisation detectors (FID) for N2O \nand CH4, respectively. Fluxes were calculated as the observed rate of concentration \nchange times the enclosure volume to ground surface area ratio.  \n 7\n2.4. Auxiliary measurements 158 \n159 \n160 \n161 \n162 \n163 \n164 \n165 \n166 \n167 \n168 \n169 \n170 \n171 \n172 \n173 \n174 \n175 \n176 \n177 \n178 \n179 \n180 \n181 \nSoil temperature and moisture (mean of three theta probe readings) were \nrecorded adjacent to each chamber during flux measurements. Soil respiration \nmeasurements were also made adjacent to each flux chamber using a PP-systems \nSCR-1 respiration chamber attached to an EGM-4 infra-red gas analyser. The \nchamber was attached to a plastic collar inserted ~5 cm into the soil to achieve an \nairtight seal and allow repeated measurements to be made in the same place. Soil \natmosphere wells were created by inserting Accurel© water tight, gas permeable \ntubing (Gut et al., 1998) into the soil from 10 to 40 cm depth adjacent to each \nindividual chamber before the study began. Air samples were then drawn from the \nAccurel each time chamber measurements were made and analysed for CO2, CH4 and \nN2O; CO2 was measured on the same gas chromatograph as CH4 and N2O using the \nFID with attached methanizer. Water table depth was measured and water samples \ncollected from dip wells consisting of perforated pipes (4 cm diameter) inserted \nadjacent to each chamber. Water samples were analysed for DOC and DIC on a \nRosemount-Dohrmann DC-80 total organic carbon analyser (detection range 0.1 to \n4000 mg l-1), using ultraviolet oxidation and sparging with N2 to remove acidified \ninorganic carbon; NO3 and NH4 were analysed on a dual channel CHEMLAB \ncontinuous flow colorimetric analyser (detection range NH4-N: 0.25 to 3.0 mg l-1; \nNO3-N: 0.25 to 5.0 mg l-1).  \nSoil was collected from approximately 5 to 30 cm depth using a soil auger; 3 \nsamples from within 0.5 m of each chamber were combined. A sub-sample of soil was \nanalysed for pH and the remainder frozen within 24 hours of collection for later \nextraction with KCl and water for NO3, NH4 and DOC. Extracts were analysed \n 8\n182 \n183 \n184 \n185 \n186 \n187 \n188 \n189 \n190 \n191 \n192 \n193 \n194 \n195 \n196 \n197 \n198 \n199 \n200 \n201 \n202 \n203 \n204 \nalongside the soil solution samples. Percent moss, grass, sedge and rush were visually \nestimated for each individual chamber at the end of the study period.  \nIn addition to the above manual measurements, continuous measurements of \nair temperature, soil temperature at 5, 10, 20 and 40 cm depth, air pressure (mb), \nphotosynthetically active radiation (PAR, µmol m-2 s-1) and net radiation (W m-2), \nwere measured in the catchment at the EMEP flux tower site (Coyle, unpublished \ndata, 2008) and utilised in temporal regression models.  \n2.5. Statistical analysis \nMonthly measurements of all 21 chambers (plus auxiliary data) were used in \nthe analyses of spatial variability. The data was separated prior to analysis into 3 \nperiods: growing season 2006, winter period 2006-2007 and growing season 2007 \n(Figure 1). The growing season was from April until October. Mean daily CH4 and \nN2O fluxes were calculated by integration over each season. The seasonal arithmetic \nmean was used to describe temperature, soil respiration, pH, water table depth, soil \nmoisture and soil extractable NO3, NH4 and DOC. However, due to the skewed \ndistribution of the data, the geometric mean was used to describe soil solution NO3, \nNH4, DOC and DIC, and soil atmosphere CO2, CH4 and N2O concentrations. Where \nmean values are quoted, ± refers to the standard error of the mean unless otherwise \nstated.  \nAs the CH4 fluxes from Juncus\/Hummock chambers in the riparian zone (site \n3) were highly and significantly different from the Juncus\/Hummock chambers in \nboth site 1 and site 2 (F = 18.6, P < 0.01), they were separated into a distinct class \n(Riparian). Chamber types (Calluna, Hollow, Sedge\/Hummock, Juncus\/Hummock \n 9\n205 \n206 \n207 \n208 \n209 \n210 \n211 \n212 \n213 \n214 \n215 \n216 \n217 \n218 \n219 \n220 \n221 \n222 \n223 \n224 \n225 \n226 \n227 \nand Riparian) were then compared using ANOVA tests after transformation to fit the \nnormal distribution. Quoted test results refer to Pillai’s test statistic (Townend, 2002) \nunless otherwise stated. Correlations were tested using Spearman’s rank correlation. \nA combination of best subsets and backward selection stepwise regression was used \nto model CH4 and N2O fluxes using the full list of auxiliary data. Log transformations \nwere performed to normalise positively skewed data; an arcsine transformation was \napplied to soil moisture values. Variables with P > 0.05 were allowed to remain in the \nfinal model if their exclusion resulted in a significant rise in the full-model P-value.  \nFortnightly measurements of the 9 chambers within site 2 (plus auxiliary data) \nwere used for the analysis of temporal variability. The data were separated, prior to \nanalysis, by chamber type (Hollow, Sedge\/Hummock, Juncus\/Hummock). As before, \nbest-fit models for both CH4 and N2O emissions were created using a combination of \nbest-subsets and backward selection stepwise regression.  \n3. Results \nOver the full study period the mean of the integrated CH4 fluxes within the \ngroups Calluna, Hollow, Sedge\/Hummock, Juncus\/Hummock and Riparian were 8.12, \n20.61, 2.30, 4.73 and 586 µg m-2 h-1, respectively (Table 1). Mean N2O fluxes across \nthe same groups were 1.52, -1.18, 2.02, -0.68 and 3.87 µg m-2 h-1, respectively (Table \n1). Overall group was not a significant factor explaining either CH4 or N2O flux \nvariability, however significant differences between specific groups are considered in \nmore detail below. \n3.1. Spatial variability \nInfluence of microtopographic\/vegetative group \n 10\nThe mean CH4 flux from all chambers was 89.8 µg m-2 h-1; the median, \nmaximum and minimum were 0.72, 990 and -25.6 µg m-2 h-1, respectively. The \ncoefficient of variation in integrated means across the 21 individual chambers was \n300%. However, the distribution of the CH4 flux data was heavily skewed towards 2 \nchambers in the riparian zone with means an order of magnitude higher than the rest \nof the chambers. As well as containing the 2 highest integrated means, the 3 chambers \nsituated within the riparian zone also contained the minimum integrated mean value. \nExcluding the 3 chambers in the riparian zone (site 3), the new mean, median, \nmaximum and minimum were 7.13, -0.98, 69.2 and -12.7 µg m-2 h-1, respectively. \nHowever, by excluding the riparian zone chambers, the coefficient of variation was \nonly reduced to 284%. The N2O fluxes were much smaller and more variable than the \nCH4 fluxes, and followed a more normal distribution. The mean, median, maximum \nand minimum N2O fluxes across all chambers were 0.99, -0.36, 9.91 and -4.25 µg m-2 \nh-1, respectively. The coefficient of variation in integrated means was 410%.  \n228 \n229 \n230 \n231 \n232 \n233 \n234 \n235 \n236 \n237 \n238 \n239 \n240 \n241 \n242 \n243 \n244 \n245 \n246 \n247 \n248 \n249 \n250 \n251 \nVariables which showed significant (P < 0.05) or near-significant (P < 0.10) \ndifferences across microtopographic\/vegetative groups included pH, water table \ndepth, soil extractable NH4 and DOC, soil solution DOC, NO3 and NH4 and soil \natmosphere CH4, CO2 and N2O concentrations (Table 1). The Riparian chambers in \nparticular showed characteristics distinct from the other groups (Table 2), of which \nthe greatest difference was in pH; the mean pH across Riparian chambers was 5.83 \ncompared to a mean of 4.18 for all other groups combined.  \nOver the full study period, only the Riparian chambers, when compared to \neach alternative group separately, showed significantly different CH4 fluxes (P < \n0.01). CH4 fluxes from the riparian zone were consistently higher, with a mean more \n 11\n252 \n253 \n254 \n255 \n256 \n257 \n258 \n259 \n260 \n261 \n262 \n263 \n264 \n265 \n266 \n267 \n268 \n269 \n270 \n271 \n272 \n273 \n274 \n275 \nthan an order of magnitude greater than the other groups (Table 1). A similar pattern \nwas observed in below ground CH4 concentrations, with concentrations increasing in \nthe order Sedge\/Hummock < Juncus\/Hummock < Hollow < Calluna < Riparian \n(Table 1). When the full dataset was considered collectively, the Spearman’s rank \ncorrelation between emissions and below-ground concentrations was not significant at \nthe 95% confidence limit (t = 2.54, P = 0.08). However, when separated by season the \nresults were significant in all cases (growing season 2006: t = 3.29, P < 0.01; winter \nseason: t = 2.20, P < 0.05; growing season 2007: t = 2.45, P < 0.05). During growing \nseason 2006, only the Riparian group had a net CH4 emission; however, due to high \nwithin group variability the difference from the other groups was not statistically \nsignificant. Net uptake was greatest in the Juncus\/Hummock group followed by the \nSedge\/Hummock, Hollow and finally the Calluna chambers (Figure 2a). During the \nwinter season, both the Hollow and Riparian chambers were statistically similar, \nshowing much greater fluxes than the other groups (Figure 2b). In contrast to growing \nseason 2006, when all but the Riparian chambers displayed a net uptake, net \nemissions were measured from all chambers during growing season 2007; again \nRiparian fluxes were significantly higher than fluxes from the other chamber types.  \nA series of ANOVA tests were carried out comparing the conditions in the \nRiparian group (site 3) with all other chambers combined into a single group (Table \n2). Apart from high CH4 concentrations and emissions, the riparian zone was \ncharacterized by high soil respiration, pH and soil solution DIC concentrations \nrelative to the rest of the sites. With the exception of the Juncus\/Hummock group, the \nRiparian soil also contained significantly less extractable DOC than the other chamber \ntypes (Table 1).  \n 12\n276 \n277 \n278 \n279 \n280 \n281 \n282 \n283 \n284 \n285 \n286 \n287 \n288 \n289 \n290 \n291 \n292 \n293 \n294 \n295 \n296 \n297 \n298 \n299 \nThe N2O fluxes were more variable and approximately one order of magnitude \nlower than CH4 fluxes. No significant differences were observed between groups \nwhen the full dataset was used. Again, no significant group effect was evident during \nthe 2006 growing season (Figure 3a), with standard error bars crossing the x-axis in \nall but the Hollow and Juncus\/Hummock groups, which both showed net N2O uptake. \nDuring the winter season (Figure 3b) a net uptake was measured in the Hollow \nchambers, in contrast to the net emissions measured in both the Sedge\/Hummock and \nJuncus\/Hummock groups. All groups displayed a net emission during growing season \n2007 (Figure 3c) with emissions from the Riparian chambers significantly greater than \nany other group.  \nModelling spatial variability \nUsing best subset multiple regression on the full dataset (n = 21), spatial \nvariability in CH4 fluxes could be modelled with an r2 of 0.81 (P < 0.01) using the \nvariables soil moisture and soil CH4 concentration. When separated by season, soil \nCH4 concentration was the major variable evident in all models (data not shown). \nHowever, the model was highly influenced by the chambers situated in the riparian \nzone and therefore not applicable to the rest of the catchment. Model fitting was \nrepeated after excluding the 3 chambers in the riparian zone (Table 3). Over the full \nstudy period an r2 of 0.46 was achieved using the variables percent sedge cover, pH, \nwater extractable DOC, soil solution DIC and soil moisture. The variability in CH4 \nflux during growing season 2006 was well modelled (r2 = 0.80), with emissions \nincreasing in response to a lower proportion of rushes, a decrease in the depth of the \nwater table and concentration of soil NO3, and an increase in soil moisture, soil \nsolution DOC and below-ground CH4 concentration (Table 3b). Variability in CH4 \n 13\nemissions during the winter season was modeled (r2 = 0.36, P = 0.05), with negative \ncorrelations between CH4 emission and soil respiration and soil solution DIC, and \npositive correlations with percent moss cover and below-ground CH4 concentration \n(Table 3c). Lastly, the best model for emissions during growing season 2007 (r2 = \n0.45, P = 0.02) included percent sedge cover (negative) and soil pH (positive) (Table \n3d). \n300 \n301 \n302 \n303 \n304 \n305 \n306 \n307 \n308 \n309 \n310 \n311 \n312 \n313 \n314 \n315 \n316 \n317 \n318 \n319 \n320 \n321 \n322 \n323 \nAlthough water table position appeared only in the 2006 growing season \nmodel (Table 3b), the maximum CH4 emissions recorded on each sampling occasion \noften occurred where the water table was closest to the surface. Within all 21 \nchambers 3 chambers repeatedly ranked in the top 3 CH4 emitters, the same 3 \nchambers repeatedly ranked among the 3 highest water tables and 3 highest soil \nmoisture contents. For example, one of the chambers within the riparian zone ranked \nwithin the top 3 CH4 emitters on 94% of sampling occasions, the same chamber \nranked among the top 3 highest water tables on 89% of sampling occasions.  \nSpatial variability in N2O emissions amongst all chambers over the full study \nperiod, was best modeled using only soil respiration (r2 = 0.28, P < 0.01). Excluding \nthe riparian chambers from the analysis, soil respiration was no longer significant and \nthe best model (r2 = 0.25, P = 0.05) was achieved by including a negative correlation \nwith pH and a positive correlation with below-ground N2O concentration (Table 3a); \nhowever neither pH nor below-ground N2O concentration was individually significant \nat the 95% confidence limit. Other variables which appeared in the seasonal models \nincluded soil CO2 concentration (winter season: t = -3.66, P < 0.01) and soil solution \nDOC (growing season 2007: t = 2.27, P < 0.05). \n3.2. Temporal variability (Site 2) \n 14\n324 \n325 \n326 \n327 \n328 \n329 \n330 \n331 \n332 \n333 \n334 \n335 \n336 \n337 \n338 \n339 \n340 \n341 \n342 \n343 \n344 \n345 \n346 \n347 \nTemporal variability in CH4 emissions from all 9 chambers at site 2 was best \nmodeled (r2 = 0.55, P < 0.01) using the variables soil moisture and soil temperature at \n40 cm depth (Table 4a). The mean (± SE) Q10 across all 9 chambers was 4.16 ± 0.96. \nHaving separated the chambers by group, both the Hollows (r2 = 0.68, P < 0.01) and \nJuncus\/Hummocks (r2 = 0.41, P < 0.01) responded negatively to soil respiration \n(Table 4b and d). However, in the Hollow group water table depth and soil \ntemperature were also important. The primary drivers of emissions in the \nSedge\/Hummock plots appeared to be soil moisture and again soil temperature (Table \n4c). Neither the Sedge\/Hummock nor the Juncus\/Hummock plots appeared to be \naffected by changes in water table depth.  \nTemporal variability in N2O emissions across all plots (Table 4a) was poorly \ncaptured; the best achievable model gave r2= 0.18 (P < 0.05). Again both soil \nrespiration, to which emissions were negatively correlated, and soil temperature at 40 \ncm depth appeared as primary variables using both the full 9 chambers and the \nJuncus\/Hummock group alone. The mean (± SE) Q10 across the 9 chambers was 7.12 \n± 1.25. Variability in emissions was best captured in the Hollow chambers where \nwater table depth and soil moisture, in addition to soil respiration, were significant \nfactors (Table 4b); N2O emissions increased in response to near-surface water tables \nand increasing soil moisture contents. Soil moisture was again significant in the \nSedge\/Hummock plots (Table 4c). Although soil temperature alone was not \nsignificant, its exclusion from the model increased the overall model P-value above \n0.05 and was therefore included.  \n4. Discussion \n4.1. Importance of emission hotspots and spatial variability to up-scaling \n 15\n348 \n349 \n350 \n351 \n352 \n353 \n354 \n355 \n356 \n357 \n358 \n359 \n360 \n361 \n362 \n363 \n364 \n365 \n366 \n367 \n368 \n369 \n370 \n371 \n372 \nUsing an unsupervised, ground-truthed, classification of a Quickbird satellite \nimage taken in May 2006 (Dinsmore, data not shown, 2008), and assuming a riparian \nzone spanning approximately 3 m either side of the Black Burn stream, the percent \ncover within the catchment of Calluna, Hollow, Sedge\/Hummock, Juncus\/Hummock \nand Riparian zone were estimated as 10%, 29%, 29%, 28% and 0.6%, respectively. \nWeighting the above means accordingly, and assuming values are representative of \nthe mean daily emission, the mean catchment fluxes of CH4 and N2O from April 2006 \nuntil October 2007 were 291 and 5.12 µg m-2 d-1, or 1.06 and 0.019 kg ha-1 y-1, \nrespectively. Ignoring the different groups and treating the chambers as replicates \ngave mean fluxes for CH4 and N2O of 2156 and 23.6 µg m-2 d-1, respectively, or 171 \nand 12.1 µg m-2 d-1 if the riparian chambers were excluded. With the riparian \nchambers included, treating the chambers as replicates significantly overestimated \nCH4 emissions, whilst excluding them led to an underestimation of emissions. N2O \nemissions were overestimated with or without the riparian chambers included. Both \nCH4 and N2O fluxes calculated in this study are at the low end of literature values for \npeatland systems (Regina et al., 1996; MacDonald et al., 1997; Hargreaves and \nFowler, 1998; Laine et al., 2007; McNamara et al., 2008). This is most likely due to \nthe relatively shallow peat layer underlying the chambers limiting CH4 production and \nlow nitrate availability restricting denitrification. \nThe riparian zone alone contributed ~12% of the total catchment CH4 \nemission, highlighting the importance of identifying and including emission hotspots \nin catchment budgets even if they cover only a small proportion of the overall area, a \nresult also found by McNamara et al. (2008). Even after separating the chambers into \ngroups to minimize spatial variability, the uncertainty within each group was still \nlarge. Furthermore, the exact weight given to each group in the final catchment \n 16\n373 \n374 \n375 \n376 \n377 \n378 \n379 \n380 \n381 \n382 \n383 \n384 \n385 \n386 \n387 \n388 \n389 \n390 \n391 \n392 \n393 \n394 \n395 \n396 \ncalculation has significant uncertainties. By sequentially changing the percent cover \nestimates by plus or minus 10% and evenly distributing the difference among the \nremaining groups, the total catchment CH4 and N2O means varied by up to 36% and \nup to 38% respectively. Despite the large measured fluxes, due to the relatively small \narea of the riparian zone, a 10% error in its relative size altered the final catchment \nmean by the least amount (CH4 2.86%, N2O 0.97%). \n4.2. Controls on spatial variation  \nClear differences in CH4 emissions were observed both between the growing \nseasons and the winter season, and between the growing seasons in 2006 and 2007, \nrespectively (Figure 2). The differences were less pronounced for N2O fluxes, \nprimarily due to the very large variation seen across all chamber types within seasons \n(Figure 3). The most striking difference between groups was the consistently large \nCH4 emissions and below-ground CH4 concentrations measured in the riparian \nchambers. Although DOC, often quoted as the primary substrate for methanogenic \nbacteria (Segers, 1998), was low in the riparian zone (247 µg C g-1) compared to the \nrest of the catchment (386 µg C g-1), the pH was significantly higher (Riparian 5.83, \nCatchment 4.81), hence closer to the methanogenic optima of ~7 (Segers, 1998). \nStudies have repeatedly reported an increase in potential CH4 production in response \nto increased pH (Yavitt et al., 1987; Dunfield et al., 1993; Valentine et al., 1994). The \ndepth of the water table at the riparian site was not significantly higher than the rest of \nthe catchment due to extremely high variability among the 3 riparian chambers. \nHowever, in 2 of the 3 riparian chambers water table was repeatedly in the top 3 \nhighest. In particular, one of the chambers, which was also in the top 3 highest CH4 \nemitters on 94% of sampling occasions, had the highest water table on 89% of \n 17\n397 \n398 \n399 \n400 \n401 \n402 \n403 \n404 \n405 \n406 \n407 \n408 \n409 \n410 \n411 \n412 \n413 \n414 \n415 \n416 \n417 \n418 \n419 \n420 \noccasions. Even during the relatively dry summer of 2006 when catchment water \ntables were drawn down to an average of almost 50 cm below the soil surface, the \nwater table at this chamber remained within 18 cm of the surface. \nAmong the variables included in the CH4 flux spatial variation models (Table \n3) were pH, DOC, water table depth  and soil moisture. The correlation with water \ntable depth has been well documented in previous studies (Moore and Dalva, 1993; \nAerts and Ludwig, 1997; Hargreaves and Fowler, 1998; MacDonald et al., 1998; \nDinsmore et al., in press). Soil moisture is strongly linked to water table depth and \nmay act as an indication of not only current but also antecedent water levels. \nTherefore in some cases soil moisture represents a better indicator of CH4 emission \nthan an instantaneous water table measurement. The effect of water table depth on \nCH4 emissions was only significant during growing season 2006, when it ranged from \napproximately 5 to 50 cm below the peat surface. Similarly Shannon and White \n(1994) found that water table was only important in one of 3 annual cycles, \ncorresponding to the year with the greatest range of water table depths (15cm – 50 \ncm). Soil respiration represents a measure of aerobic microbial activity and thus is \nlikely to correlate strongly with rates of CH4 oxidation, hence the negative correlation \nwith emissions during the winter season.  \nDuring the growing seasons CH4 emissions were negatively correlated to the \nfrequency of either rushes or sedges inside the chambers (Table 3b and d). Although \ncontrary to much of the current literature which suggests the presence of aerenchyma \ncontaining vegetation (i.e. rushes and sedges) increases emissions (Shannon et al., \n1996; Yu et al., 1997; Greenup et al., 2000), a similar result to that observed here was \nfound in an earlier study with mesocosms collected from Auchencorth Moss \n 18\n421 \n422 \n423 \n424 \n425 \n426 \n427 \n428 \n429 \n430 \n431 \n432 \n433 \n434 \n435 \n436 \n437 \n438 \n439 \n440 \n441 \n442 \n443 \n444 \n445 \n(Dinsmore et al., in press). As well as providing a source of readily available organic \nsubstrate, plants containing aerenchymous tissue can provide a direct pathway for \nmany greenhouse gases to the atmosphere, bypassing the aerobic surface horizon and \ntherefore reducing the potential for oxidation (Bartlett and Harriss, 1993; Minkkinen \nand Laine, 2006). However, studies have also shown that aerenchyma can transport \nO2 into the rhizosphere and can significantly alter the redox state of the surrounding \npeat (Visser et al., 2000; Wiebner et al., 2002). Similarly, Arah and Stephen (1998) \nfound that increasing root-mediated transport in a CH4 flux model led to a decrease in \nsimulated CH4 emissions, due to the increase in oxidation outweighing the positive \ninfluence of increased CH4 transport.  \nFor emissions to increase via plant-mediated transport, roots must penetrate \nareas of high CH4 production, thought to occur ~15-20 cm below the water table \n(Daulat and Clymo, 1998; Kettunen et al., 1999), and bypass the surface oxidizing \npeat layer. As the water table was drawn down to almost 50 cm during much of the \n2006 growing season, and repeatedly to similar low levels during 2007, it is likely that \nno significant reservoir of CH4 was present in the shallow peat for plant roots to tap \ninto. Roura-Carol and Freeman (1999) suggest that the radial loss of O2 from plant \nroots is likely to be dependent on photosynthetic activity. Rhizospheric oxidation is \ntherefore likely to be minimal during the winter when plants are relatively inactive, \nand this may explain the lack of an aerenchymous vegetation variable in our winter \nseason model (Table 3c). In the riparian zone where water table levels remained high \nthroughout the growing season and high below-ground CH4 concentrations were \nevident, the effect of plant-mediated transport may outweigh rhizospheric oxidation. \nHowever, this could not be tested in this study as all our riparian chambers included J. \neffusus.  \n 19\nN2O emissions were negatively correlated (P < 0.1) with soil pH in both the \nfull study period and the growing season 2006 models (Table 3a and b).The optimum \npH from denitrifiers is often thought to be between approximately 6.5-8.0 (Knowles, \n1981; Šimek and Cooper, 2002), therefore any increase above the mean catchment pH \nof 4.18 should theoretically increase N2O production. However the partitioning of \nN2O and N2 is also influenced by pH with a higher proportion of N2O in more acid \nconditions (Šimek et al., 2002).  Soil pH was also strongly negatively correlated with \nboth soil extractable NO3 (r = -0.61, P < 0.001) and soil extractable NH4 (r = -0.75, P \n< 0.01) concentrations over the same period. Therefore the reduction of N2O \nemissions at higher pH values could also have occurred as an indirect response to low \nsoil nitrogen availability.   \n446 \n447 \n448 \n449 \n450 \n451 \n452 \n453 \n454 \n455 \n456 \n457 \n458 \n459 \n460 \n461 \n462 \n463 \n464 \n465 \n466 \n467 \n468 \n469 \n4.3. Drivers of temporal variation (site 2) \nConsidering all 9 plots within site 2 where measurements were made \nfortnightly, the main drivers of temporal variability in CH4 emissions appeared to be \nsoil moisture and soil temperature (Table 4a). The temporal response in CH4 \nemissions to variations in temperature is consistent with previous studies (Frolking \nand Crill, 1994; Shannon and White, 1994; Laine et al., 2007) and the mean Q10 of \n4.16 is similar to values previously reported for a different Scottish peatland \n(MacDonald et al., 1998). Soil temperature was also an important driver of temporal \nN2O dynamics with a very high Q10 of 7.12, and an apparent switch from \nconsumption to production at approximately 8ºC (data not shown). A very similar \nresult was observed by Dinsmore et al. (in press) in mesocosms collected from \nAuchencorth Moss, where a switch from consumption to production was recorded \nbetween approximately 7.5 and 8.5ºC. However, as was also the case in Dinsmore et \n 20\n470 \n471 \n472 \n473 \n474 \n475 \n476 \n477 \n478 \n479 \n480 \n481 \n482 \n483 \n484 \n485 \n486 \n487 \n488 \n489 \n490 \n491 \n492 \n493 \nal. (in press), N2O fluxes are low and variability high, so further work is required to \nassess the significance of this switch. \nNet CH4 flux is dependent on the balance between oxidation and production \nprocesses. As the temperature response in methanogens is generally greater than that \nof methanotrophs (Segers, 1998), the overall effect on net emissions is positive. \nWhere temperature is a significant driver of variability, as in both Hollow and \nSedge\/Hummock chambers, it suggests that variability is due primarily to changes in \nmethanogen activity rather than oxidation. However the primary correlate with net \nemissions in the Juncus\/Hummock plots was soil respiration, itself likely to be an \nindicator of aerobic microbial activity, and as such linked to potential oxidation. The \ndominance of oxidation in controlling emission variability in the Juncus\/Hummock \nplots may be due to potential methanogenesis being limited by lower substrate \navailability, possibly reflected in the lower concentrations of extractable DOC in the \nJuncus\/Hummock chambers (Table 1). Hence the controls on temporal changes in \nCH4 emissions appear to be variable across the site. \nAlthough significant changes in water table depth (e.g. drainage or drain \nblocking) have repeatedly been shown to strongly influence CH4 emissions (Alm et \nal., 1999; Strack et al., 2004), a much weaker relationship is often observed with \ntemporal water table variability in the field (Frolking and Crill, 1994; Shannon and \nWhite, 1994). In our study water table was a significant correlate only in the Hollow \nchambers, although soil moisture, which may provide a better measure of both current \nand antecedent soil water conditions, was also included in the Sedge\/Hummock \nmodel. The presence of aerenchyma containing vegetation in the Sedge\/Hummock \nand Juncus\/Hummock chambers might have partially off-set any increase in CH4 \n 21\n494 \n495 \n496 \n497 \n498 \n499 \n500 \n501 \n502 \n503 \n504 \n505 \n506 \n507 \n508 \n509 \n510 \n511 \n512 \n513 \n514 \n515 \n516 \nemissions associated with a rise in water table by increasing oxidation in the \nrhizosphere. Again the drivers of temporal variability do not appear consistent across \nthe site; hence differences between studies in the importance of water table as a driver \nof variability may be caused in part by differences in site-specific vegetation cover.  \n4.4. Conclusions  \nCH4 emissions varied considerably across the catchment, with the riparian \nzone representing a significant hotspot. High emissions also appeared to be linked to \nareas with consistently near-surface water tables. Contrary to many previous studies, \nthe presence of either sedges or rushes containing aerenchymous tissue decreased net \nCH4 emissions during the 2 growing seasons. Upscaling the calculated fluxes using \nvegetation cover estimates from a satellite image, gave mean catchment CH4 and N2O \nemissions of 291 µg CH4 m-2 d-1 and 5.12 µg N2O m-2 d-1, although these values are \nextremely sensitive to error in the cover estimates. Hence it is important when \nplanning future studies to identify the presence of significant emission hotspots, such \nas the riparian zone or areas with a consistently near-surface water table, prior to \nexperimental set-up. \nThe drivers of temporal variability were not consistent across the study site. \nThe within-site differences in drivers found at Auchencorth Moss, possibly linked in \nthis case to vegetation and substrate availability, may partially explain the \ndiscrepancies between previous studies. Depending on the heterogeneity of the site, \ncreating a number of spatially distinct integrated models which are parameterized \nindependently, may be more accurate than using a single model based on averaged \ncatchment values.  \n 22\nAcknowledgements 517 \n518 \n519 \n520 \n521 \n522 \n523 \n524 \n525 \n526 \n527 \n528 \n529 \n530 \n531 \n532 \n533 \n534 \n535 \nThe work was funded by the UK Natural Environment Research Council (NERC) \nthrough an algorithm PhD studentship grant. \nReferences \nAerts, R., Ludwig, F., 1997. Water-table changes and nutritional status affect trace gas \nemissions from laboratory columns of peatland soils. Soil Biology & Biochemistry \n29, 1691-1698. \nAlm, J., Saarnio, S., Nykänen, H., Silvola, J., Martikainen, P. J., 1999. Winter CO2, \nCH4 and N2O fluxes on some natural and drained boreal peatlands, Biogeochemistry \n44, 163-186. \nArah, J. R. M., Stephen, K. D., 1998. A model of the processes leading to methane \nemissions from peatland. Atmospheric Environment 32, 3257-3264. \nBartlett, K. B., Harriss R. C., 1993. Review and assessment of methane emissions \nfrom wetlands, Chemosphere 26, 261-320. \nBillett, M. F., Palmer, S. M., Hope, D., Deacon, C., Storeton-West, R., Hargreaves, K. \nJ., Flechard, C., Fowler D., 2004. Linking land-atmosphere-stream carbon fluxes in a \nlowland peatland system. Global Biogeochemical Cycles 18, GB1024. \nBubier, J. L., Moore, T. R., Roulet, N. T., 1993. Methane emissions from wetlands in \nthe midboreal region of northern Ontario, Canada. Ecology 74, 2240-2254. \n 23\n536 \n537 \n538 \n539 \n540 \n541 \n542 \n543 \n544 \n545 \n546 \n547 \n548 \n549 \n550 \n551 \n552 \n553 \n554 \n555 \n556 \nClayton, H., Arah, J.R.M., Smith, K.A., 1994. Measurement of nitrous oxide \nemissions from fertilised grassland using closed chambers. Journal of Geophysical \nResearch 99, 16599-16607. \nDaulat, W. E., Clymo, R. S., 1998. Effects of temperature and watertable on the efflux \nof methane from peatland surface cores. Atmospheric Environment 32, 3207-3218. \nDinsmore, K. J., Skiba, U. M., Billett, M. F., Rees, R. M., in press. Effect of water \ntable on greenhouse gas emissions from peatland mesocosms. Plant and Soil doi: \n10.1007\/s11104-008-9832-9. \nDunfield, P., Knowles, R., Dumont, R., Moore, T. R., 1993. Methane production and \nconsumption in temperate and subarctic peat soils: Response to temperature and pH. \nSoil Biology & Biochemistry 25, 321-326. \nFrolking, S., Crill, P., 1994. Climate controls on temporal variability of methane flux \nfrom a poor fen in southeastern New-Hampshire - measurement and modeling. Global \nBiogeochemical Cycles 8, 385-397. \nGorham, E., 1991. Northern peatlands: role in the carbon-cycle and probable \nresponses to climatic warming. Ecological Applications 1, 182-195. \nGreenup, A. L., Bradford, M., McNamara, N., Ineson, P., Lee, J., 2000. The role of \nEriophorum vaginatum in CH4 flux from an ombrotrophic peatland. Plant and Soil \n227, 265-272. \nGriffis, T. J., Rouse, W. R., 2001. Modelling the interannual variability of net \necosystem CO2 exchange at a subarctic sedge fen. Global Change Biology 7, 511-530. \n 24\n557 \n558 \n559 \n560 \n561 \n562 \n563 \n564 \n565 \n566 \n567 \n568 \n569 \n570 \n571 \n572 \n573 \n574 \n575 \n576 \n577 \nGut, A., Blatter, A., Fahrni, M., Lehmann, B. E., Neftel, A., Staffelbach, T., 1998. A \nnew membrane tube technique (METT) for continuous gas measurements in soils. \nPlant and Soil 198, 79-88. \nHargreaves, K. J., Fowler, D., 1998. Quantifying the effects of water table and soil \ntemperature on the emission of methane from peat wetland at the field scale. \nAtmospheric Environment 32, 3275-3282. \nHuttunen, J. T., Nykänen, H., Turunen, J., Nenonen, O., Martikainen, P. J., 2002. \nFluxes of nitrous oxide on natural peatlands in Vuotos, an area projected for a \nhydroelectric reservoir in northern Finland. Suo (Helsinki), 53, 87-96. \nHuttunen, J. T., Nykänen, H., Turunen, J., Martikainen, P. J., 2003. Methane \nemissions from natural peatlands in the northern boreal zone in Finland, \nFennoscandia. Atmospheric Environment 37, 147-151. \nKettunen, A., Kaitala, V., Lehtinen, A., Lohila, A., Alm, J.,  Silvola, J., Martikainen, \nP. J., 1999. Methane production and oxidation potentials in relation to water table \nfluctuations in two boreal mires. Soil Biology & Biochemistry 31, 1741-1749. \nKnowles, R., 1981. Denitrification. Marcel Dekker, New York, pp. 323-369. \nLafleur, P. M.,. Roulet, N. T, Bubier, J. L., Frolking, S., Moore, T. R., 2003. \nInterannual variability in the peatland-atmosphere carbon dioxide exchange at an \nombrotrophic bog. Global Biogeochemical Cycles 17, 1036. \nLaine, A., Wilson, D., Kiely, G., Byrne, K. A., 2007. Methane flux dynamics in an \nIrish lowland blanket bog. Plant and Soil 299, 181-193. \n 25\n578 \n579 \n580 \n581 \n582 \n583 \n584 \n585 \n586 \n587 \n588 \n589 \n590 \n591 \n592 \n593 \n594 \n595 \n596 \n597 \nLivingston, G. P., Hutchinson, G. L., 1995. Enclosure-based measurement of trace gas \nexchange: applications and sources of error. In: Matson, P. A., Harriss, R. C. (Eds.), \nBiogenic Trace Gases: Measuring Emissions from Soil and Water. Marston Lindsey \nRoss International Ltd., Oxford. \nLund, M., Lindroth, A., Christensen, T. R., Ström, L., 2007. Annual CO2 balance of a \ntemperate bog. Tellus Series B 59, 804-811. \nMacDonald, J. A., Skiba, U., Sheppard, L. J., Hargreaves, K. J., Smith, K. A., Fowler, \nD., 1996. Soil environmental variables affecting the flux of methane from a range of \nforest, moorland and agricultural soils. Biogeochemistry 34, 113-132. \nMacDonald, J. A., Skiba, U., Sheppard, L. J., Ball, B., Roberts, J. D., Smith, K. A., \nFowler, D., 1997. The effect of nitrogen deposition and seasonal variability on \nmethane oxidation and nitrous oxide emission rates in an upland spruce plantation and \nmoorland. Atmospheric Environment 31, 3693-3706. \nMacDonald, J. A., Fowler, D., Hargreaves, K. J., Skiba, U., Leith, I. D., Murray, M. \nB., 1998. Methane emission rates from a northern wetland; response to temperature, \nwater table and transport. Atmospheric Environment 32, 3219-3227. \nMcNamara, N. P., Plant, T., Oakley, S., Ward, S., Wood, C., Ostle, N., 2008. Gully \nhotspot contribution to landscape methane (CH4) and carbon dioxide (CO2) fluxes in a \nnorthern peatland. Science of the Total Environment doi: \n10.1016\/j.scitotenv.2008.03.015. \n 26\n598 \n599 \n600 \n601 \n602 \n603 \n604 \n605 \n606 \n607 \n608 \n609 \n610 \n611 \n612 \n613 \n614 \n615 \n616 \n617 \nMinkkinen, K., Laine, J., 2006. Vegetation heterogeneity and ditches create spatial \nvariability in methane fluxes from peatlands drained for forestry. Plant and Soil 285, \n289-304. \nMoore, T., Roulet, N., Knowles, R., 1990. Spatial and temporal variations of methane \nflux from subarctic\/northern boreal fens. Global Biogeochemical Cycles 4, 29-46. \nMoore, T. R., Dalva, M., 1993. The influence of temperature and water table on \ncarbon dioxide and methane emissions from laboratory columns of peatland soils. \nEuropean Journal of Soil Science 44, 651-664. \nNungesser, M. K., 2003. Modelling microtopography in boreal peatlands: hummocks \nand hollows. Ecological Modelling 165, 175-207. \nRegina, K., Nykänen, H., Silvola, J., Martikainen, P. J., 1996. Fluxes of nitrous oxide \nfrom boreal peatlands as affected by peatland type, water table level and nitrification \ncapacity. Biogeochemistry 35, 401-418. \nRoulet, N., Lafleur, P. M., Richard, P. J. H., Moore, T. R., Humphreys, E. R., Bubier, \nJ., 2007. Contemporary carbon balance and late Holocene carbon accumulation in a \nnorthern peatland. Global Change Biology 13, 397-411. \nRoura-Carol, M., Freeman, C., 1999. Methane release from peat soils: effects of \nSphagnum and Juncus. Soil Biology & Biochemistry 31, 323-325. \nSegers, R., 1998. Methane production and methane consumption: a review of \nprocesses underlying wetland methane fluxes. Biogeochemistry 41, 23-51. \n 27\n618 \n619 \n620 \n621 \n622 \n623 \n624 \n625 \n626 \n627 \n628 \n629 \n630 \n631 \n632 \n633 \n634 \n635 \n636 \n637 \nShannon, R. D., White, J. R., 1994. A three-year study of controls on methane \nemissions from 2 Michigan peatlands. Biogeochemistry 27, 35-60. \nShannon, R. D., White, J. R., Lawson, J. E., Gilmour, B. S., 1996. Methane efflux \nfrom emergent vegetation in peatlands. Journal of  Ecology 84, 239-246. \nShurpali, N., Verma, S. B., Clement, R. J., Billesbach, D. P., 1993. Seasonal \ndistribution of methane flux in a Minnesota peatland measured by eddy correlation. \nJournal of Geophysical Research 98, 20649-20655.  \nŠimek, M., Cooper, J. E., 2002. The influence off soil pH on denitrification: progress \ntowards the understanding of this interaction over the last 50 years. European Journal \nof Soil Science 53, 345-354. \nŠimek, M., Jisova, L., Hopkins, D. W., 2002. What is the so-called optimum pH for \ndenitrification in soil? Soil Biology & Biochemistry 34, 1227-1234. \nStrack, M., Waddington, J. M., Tuittila, E. -S., 2004. Effect of water table drawdown \non northern peatland methane dynamics: implications for climate change. Global \nBiogeochemical. Cycles 18, GB4003. \nStröm, L., Ekberg, A., Mastepanov, M., Christensen, T. R., 2003. The effect of \nvascular plants on carbon turnover and methane emissions from a tundra wetland. \nGlobal Change Biology 9, 1185-1192. \nTownend, J., 2002. Practical Statistics for Environmental and Biological Scientists. \nJohn Wiley & Sons Ltd, Chichester. \n 28\n638 \n639 \n640 \n641 \n642 \n643 \n644 \n645 \n646 \n647 \n648 \n649 \n650 \n651 \n652 \n653 \n654 \n655 \n656 \n657 \nUpdegraff, K., Bridgham, S. D., Pastor, J., Weishampel, P., Harth, C., 2001. Response \nof CO2 and CH4 emissions from peatlands to warming and water table manipulation. \nEcological Applications 11, 311-326. \nValentine, D. W., Holland, E. A., Schimel, D. S., 1994. Ecosystem and physiological \ncontrols over methane production in northern wetlands. Journal of Geophysical \nResearch 99, 1563-1571. \nVisser, E. J., Colmer, T. D., Blom, C. W. P. M., Voesenek L. A. C. J., 2000. Changes \nin growth, porosity, and radial oxygen loss from adventitious roots of selected mono- \nand dicotyledonous wetland species with contrasting types of aerenchyma. Plant, Cell \nand Environment 23, 1237-1245. \nWaddington, J. M., Roulet, N. T., 1996. Atmosphere-wetland carbon exchange: Scale \ndependency of CO2 and CH4 exchange on the developmental topography of a \npeatland. Global Biogeochemical Cycles 10, 233-245. \nWhalen, S. C., Reeburgh, W. S., 2000. Methane oxidation, production, and emission \nat contrasting sites in a boreal bog. Geomicrobiology Journal 17, 237-251. \nWhiting, G. J., Chanton, J. P., 1996. Control of diurnal pattern of methane emission \nfrom aquatic macrophytes by gas transport mechanisms. Aquatic Botany 54, 237-253. \nWiebner, A., Kuschk, P., Stottmeister, U., 2002. Oxygen release by roots of Typha \nlatifolia and Juncus effusus in laboratory hydroponic systems. Acta Biotechnologica \n22, 209-216. \n 29\n658 \n659 \n660 \n661 \n662 \n663 \n664 \nYavitt, J. B., Lang, G. E., Wieder, R. K., 1987. Control of carbon mineralization to \nCH4 and CO2 in anaerobic, Sphagnum derived peat from Big run Bog, West Virginia. \nBiogeochemistry 4, 141-157. \nYu, K. W., Wang, Z. P., Chen, G. X., 1997. Nitrous oxide and methane transport \nthrough rice plants. Biology and Fertility of Soils 24, 341-343. \n \n \n 30\n Table 1 Mean ± SE of data from full study period, separated by chamber type. P-\nvalues from ANOVA’s testing for significant between group differences are indicated \nby asterisks where * and ** refer to P < 0.05 and P < 0.01, respectively; † indicates that \nthe result was not significant but had P < 0.10. \n665 \n666 \n667 \n668 \n  Calluna Hollow Sedge\/Hummock Juncus\/Hummock Riparian \n      \nCH4 (µg m-2 h-1) 8.12 ± 5.77 20.6 ± 24.3 2.30 ± 6.47 4.73 ± 6.52 586 ± 311 \nN2O (µg m-2 h-1) 1.52 ± 3.34 -1.18 ± 1.49 2.02 ± 1.97 -0.68 ± 1.36 3.87 ± 1.35 \nSoil respiration (g m-2 h-1) 0.29 ± 0.04 0.24 ± 0.01 0.28 ± 0.02 0.37 ± 0.11 0.45 ± 0.06 \n      \nSoil pH ** 3.74 ± 0.01 4.54 ± 0.09 4.03 ± 0.12 4.41 ± 0.07 5.83 ± 0.28 \nWater table depth (cm) † -20.7 ± 0.89 -18.5 ± 2.65 -27.2 ± 2.25 -27.8 ± 2.88 -23.4 ± 8.1 \nSoil moisture (m3 m-3) 0.85 ± 0.04 0.88 ± 0.02 0.85 ± 0.02 0.85 ± 0.02 0.88 ± 0.04 \n      \nSoil extractable NO3 (µg N g-1)  5.08 ± 0.90 3.14 ± 1.05 4.38 ± 0.91 3.61 ± 0.45 4.57 ± 2.41 \nSoil extractable NH4 (µg N g-1) \n** 42.9 ± 0.95  18.0 ± 3.31 21.7 ± 2.76 18.9 ± 0.73 24.8 ± 10.5 \nSoil extractable DOC(µg C g-1) * 595 ± 56 301 ± 57 410 ± 59 239 ± 11 247 ± 154 \n      \nSoil solution NO3 (mg N l-1)\n † 0.17± 0.02 0.12 ± 0.02 0.12 ± 0.01 0.14 ± 0.01 0.15 ± 0.04 \nSoil solution NH4 (mg N l-1)\n ** 0.58 ± 0.17 0.08 ± 0.01 0.23 ± 0.03 0.17 ± 0.03 0.14 ± 0.04 \nSoil solution DOC (mg C l-1) * 33.0 ± 5.67 17.0 ± 0.92 23.8 ± 2.09 22.6 ± 2.84 17.3 ± 1.38 \nSoil solution DIC (mg C l-1) 2.24 ± 0.20 2.59 ± 0.51 2.76 ± 0.28 2.70 ± 0.31 3.88 ± 1.06 \n      \nSoil CH4 concentration (μl l-1)\n ** 9.35 ± 5.27 5.52 ± 1.13 2.73 ± 0.29 3.13 ± 0.41 48.2 ± 31.7 \nSoil CO2 concentration (μl l-1) \n* 4490 ± 894 3850 ± 802 2680 ± 411 3150 ± 535 2890 ± 538 \nSoil N2O concentration (μl l-1) 0.35 ± 0.01 0.36 ± 0.02 0.44 ± 0.05 0.44 ± 0.03 0.37 ± 0.04 \n669  \n 31\nTable 2 Results from ANOVA tests describing variables which make Riparian \nchambers distinct from all other groups combined. Arrows indicate whether variable \nis higher or lower in Riparian chambers.  \n670 \n671 \n672 \nVariable   F P-value \nCH4 flux ↑ 18.55 < 0.01 \nSoil respiration ↑ 3.94 < 0.01 \npH ↑ 52 < 0.01 \nSoil extracted DOC ↓ 3.51 0.08 \nSoil solution DIC ↑ 5.33 0.03 \nSoil CH4 concentration ↑ 13.30 < 0.01 \n 32\nTable 3 Results from best subset multiple regression model describing the spatial \nvariation in CH4 and N2O fluxes with the riparian chambers excluded across a) the \nfull dataset, b) growing season 2006, c) the winter season 2006-07 and d) growing \nseason 2007. \n673 \n674 \n675 \n676 \nCH4 flux  N2O flux \nVariable t P   Variable t P \n       \na) Full study period       \n       \n(r2 = 0.46; P = 0.03)  (r2 = 0.25; P = 0.05) \nIntercept --- ---  Intercept --- --- \nSedges (%) -1.37 0.10  pH -1.94 0.07 \npH 2.39 0.03  Soil N2O concentration 1.81 0.09 \nExtractable DOC 2.22 0.05     \nSoil solution DIC -2.50 0.03     \nSoil moisture 1.92 0.08     \n       \nb) Growing season 2006       \n       \n(r2 = 0.80; P < 0.01)    (r2 = 0.14; P = 0.07)   \nIntercept --- ---  Intercept --- --- \nRushes (%) -4.04 < 0.01  pH -1.93 0.07 \nWater table depth -2.52 0.03     \nSoil moisture 6.04 < 0.01     \nExtractable NO3 -3.54 < 0.01     \nSoil solution DOC 2.65 0.02     \nSoil CH4 concentration 2.48 0.03     \n       \nc) Winter season 2006-07       \n       \n(r2 = 0.36; P = 0.05)    (r2 = 0.44; P < 0.01)   \nIntercept --- ---  Intercept --- --- \nSoil respiration -2.28 0.04  Soil CO2 concentration -3.66 < 0.01 \nSoil solution DIC -2.65 0.02     \nSoil CH4 concentration 2.70 0.02     \nMosses (%) 2.36 0.04     \n       \nd) Growing season 2007       \n       \n(r2 = 0.45; P = 0.02)    (r2 = 0.65; P < 0.01)   \nIntercept --- ---  Intercept --- --- \nSedges (%) -2.07 0.06  pH 2.58 0.02 \npH 2.07 0.02  Soil solution DOC 2.27 0.04 \n    Soil N2O concentration 1.69 0.12 \n 33\nTable 4 Results from best subset multiple regression model describing the temporal \nvariation in CH4 and N2O fluxes across a) all chambers within site 2 (n = 9), b) \nHollow chambers within site 2 (n = 3), c) Sedge\/Hummock chambers within site 2 (n \n= 3) and d) Juncus\/Hummock chambers within site 2 (n = 3) \n677 \n678 \n679 \n680 \nCH4 flux  N2O flux \nVariable t P   Variable t P \n       \na) All chambers       \n       \n(r2 = 0.55; P < 0.01)    (r2 = 0.18; P = 0.03)   \nIntercept --- ---  Intercept --- --- \nSoil moisture 5.85 < 0.01  Soil respiration -2.67 0.01 \nSoil temperature (40 cm) 3.45 < 0.01  Soil temperature (40 cm) 1.76 0.09 \n       \nb) Hollow       \n       \n(r2 = 0.68; P < 0.01)    (r2 = 0.45; P < 0.01)   \nIntercept --- ---  Intercept --- --- \nSoil respiration -2.09 0.05  Soil respiration -1.98 0.06 \nWater table depth -6.13 < 0.01  Soil moisture 2.00 0.06 \nSoil temperature (5 cm) 4.59 < 0.01  Water table depth -4.43 < 0.01 \n       \nc) Sedge\/Hummock       \n       \n(r2 = 0.50; P < 0.01)    (r2 = 0.25; P = 0.01)   \nIntercept --- ---  Intercept --- --- \nSoil moisture 5.13 < 0.01  Soil moisture 3.28 < 0.01 \nSoil temperature (40 cm) 3.85 < 0.01  Soil temperature (40 cm) 1.55 0.13 \n       \nd) Juncus\/Hummock       \n       \n(r2 = 0.41; P < 0.01)    (r2 = 0.16; P = 0.04)   \nIntercept --- ---  Intercept --- --- \nSoil respiration -4.40 < 0.01  Soil respiration -2.24 0.03 \n    Soil temperature (40 cm) 2.07 0.05 \n       \n 34\nFigure Legends 681 \n682 \n683 \n684 \n685 \n686 \n687 \n688 \n689 \n690 \n691 \n692 \n693 \nFigure 1 Time series of a) median CH4 and N2O fluxes from 9 chambers at site 2, b) \nwater table depth and soil moisture and c) soil temperature and respiration over the \nstudy period. The dashed lines separate the study into growing season 2006, winter \nperiod 2006-07 and growing season 2007, respectively \nFigure 2 Mean integrated CH4 flux during a) growing season 2006, b) the winter \nperiod and c) growing season 2007, separated by microtopographic\/vegetative group. \nError bars represent the standard error of the mean. Common letters indicate \nstatistically similar fluxes (P < 0.05) \nFigure 3 Mean integrated N2O flux during a) growing season 2006, b) winter period \n2006-07 and c) growing season 2007, separated by microtopographic\/vegetative \ngroup. Error bars represent the standard error of the mean. Common letters indicate \nstatistically similar fluxes (P < 0.10) \n 35\n694 Figure 1 \n-150\n-100\n-50\n0\n50\n100\n150\n1\/5\/06 1\/7\/06 1\/9\/06 1\/11\/06 1\/1\/07 1\/3\/07 1\/5\/07 1\/7\/07 1\/9\/07 1\/11\/07\nC\nH\n4 (\nμg\n m\n -2\n h\nr -\n1 )\n-30\n-20\n-10\n0\n10\n20\n30\nN\n2O\n (μ\ng \nm\n -2\n h\nr -\n1 )\nCH4\nN2O2\n-50\n-40\n-30\n-20\n-10\n0\n1\/5\/06 1\/7\/06 1\/9\/06 1\/11\/06 1\/1\/07 1\/3\/07 1\/5\/07 1\/7\/07 1\/9\/07 1\/11\/07\nW\nat\ner\n ta\nbl\ne \nde\npt\nh \n(c\nm\n)  \n \n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\nSo\nil \nm\noi\nst\nur\ne \n(m\n  3 m\n -3\n) \nWater table\nSoil moisture\n0\n2\n4\n6\n8\n10\n12\n14\n16\n1\/5\/06 1\/7\/06 1\/9\/06 1\/11\/06 1\/1\/07 1\/3\/07 1\/5\/07 1\/7\/07 1\/9\/07 1\/11\/07\nSo\nil \nte\nm\npe\nra\ntu\nre\n (º\nC\n)  \n   \n .\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\nSo\nil \nR\nes\npi\nra\ntio\nn \n(g\n m\n -2  \nhr\n -1\n)\nTemperature\nRespiration\n                 Growing season 2006                 Winter                Growing season 2007\n 695 \n 36\n696 \n697 \nFigure 2 \n \n-40\n-20\n0\n20\n40 a) Growing season 2006\n  252 ± 252\na a a b\na, b\n-20\n10\n40\n70\n100\n130\n160\n190\nb) Winter Season\na\na, c\na a\n  c\n0\n20\n40\n60\n80\n100\n120\n140\n160\nCalluna Hollow Hummock Juncus Riparian\n c) Growing season 2007 1452 ± 830\nb\na\na\na\na\nC\nH\n4 f\nlu\nx \n(μ\ng \nm-\n2  h\nr-1\n)\n698 \n 37\n 38\n699 Figure 3 \n-12\n-8\n-4\n0\n4\n8\n12\na) Growing season 2006\na\na\na\na\na\n-3\n-2\n-1\n0\n1\n2\n3\n4\nb) Winter Season\na\na, b a, b     b\n     b\n-2\n2\n6\n10\n14\n18\nCalluna Hollow Hummock Juncus Riparian\nc) Growing season 2007    b\n a\na\n a a\nN\n2O\n fl\nux\n (μ\ng \nm-\n2  h\nr-1\n)\n 700 \n"}