{"doi":"10.1017\/S0031819109000047","coreId":"69328","oai":"oai:eprints.lancs.ac.uk:27201","identifiers":["oai:eprints.lancs.ac.uk:27201","10.1017\/S0031819109000047"],"title":"No abiding city : Hume, naturalism, & toleration.","authors":["Clark, Samuel"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-01","abstract":"This paper rereads David Hume's Dialogues Concerning Natural Religion as dramatising a distinctive, naturalistic account of toleration. I have two purposes in mind: first, to complete and ground Hume's fragmentary explicit discussion of toleration; second, to unearth a potentially attractive alternative to more recent, Rawlsian approaches to toleration. To make my case, I connect Dialogues and the problem of toleration to the wider themes of naturalism, scepticism and their relation in Hume's thought, before developing a new interpretation of Dialogues part 12 as political drama. Finally, I develop the Humean theory of toleration I have discovered by comparison between Rawls's and Hume's strategies for justification of a tolerant political regime","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69328.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/27201\/1\/No_Abiding_City.pdf","pdfHashValue":"d89e46a7c7f5ca340fcf2ec71a01e8b8b651db1d","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:27201<\/identifier><datestamp>\n      2018-01-24T02:50:29Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D42:4231<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        No abiding city : Hume, naturalism, & toleration.<\/dc:title><dc:creator>\n        Clark, Samuel<\/dc:creator><dc:subject>\n        B Philosophy (General)<\/dc:subject><dc:description>\n        This paper rereads David Hume's Dialogues Concerning Natural Religion as dramatising a distinctive, naturalistic account of toleration. I have two purposes in mind: first, to complete and ground Hume's fragmentary explicit discussion of toleration; second, to unearth a potentially attractive alternative to more recent, Rawlsian approaches to toleration. To make my case, I connect Dialogues and the problem of toleration to the wider themes of naturalism, scepticism and their relation in Hume's thought, before developing a new interpretation of Dialogues part 12 as political drama. Finally, I develop the Humean theory of toleration I have discovered by comparison between Rawls's and Hume's strategies for justification of a tolerant political regime.<\/dc:description><dc:date>\n        2009-01<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/27201\/1\/No_Abiding_City.pdf<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/27201\/2\/displayFulltext.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0031819109000047<\/dc:relation><dc:identifier>\n        Clark, Samuel (2009) No abiding city : Hume, naturalism, & toleration. Philosophy, 84 (1). pp. 75-94. ISSN 1469-817X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/27201\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0031819109000047","http:\/\/eprints.lancs.ac.uk\/27201\/"],"year":2009,"topics":["B Philosophy (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"http:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nNo Abiding City: Hume, Naturalism,\nand Toleration1\nSAMUEL CLARK\nAbstract\nThis paper rereads David Hume’s Dialogues Concerning Natural Religion as drama-\ntising a distinctive, naturalistic account of toleration. I have two purposes in mind:\nfirst, to complete and ground Hume’s fragmentary explicit discussion of toleration;\nsecond, to unearth a potentially attractive alternative to more recent, Rawlsian\napproaches to toleration. To make my case, I connect Dialogues and the problem\nof toleration to the wider themes of naturalism, scepticism and their relation in\nHume’s thought, before developing a new interpretation of Dialogues part 12 as pol-\nitical drama. Finally, I develop the Humean theory of toleration I have discovered by\ncomparison between Rawls’s and Hume’s strategies for justification of a tolerant pol-\nitical regime.\nThis paper rereads David Hume’s Dialogues Concerning Natural\nReligion as dramatising a distinctive naturalist account of political tol-\neration. I have a double purpose in mind: first, to complete and\nground Hume’s fragmentary explicit justification of toleration;\nsecond, to unearth a potentially attractive alternative to more\nrecent, and especially Rawlsian, approaches to toleration. My\nproject is therefore both interpretative – an attempt to understand\nHume’s thought – and archaeological – an attempt to bring some\nneglected riches to light. To make my case, I first sketch in two\npieces of background: the problem of toleration (section 1), and the\nintertwined influences of naturalism and scepticism in Hume’s\nthought (section 2). I then address Dialogues directly and develop a\nnew interpretation of Dialogues part 12 as political drama (section 3),\nbefore considering some comparisons between a Humean and a\nRawlsian justification of toleration (section 4).\n1 I have given versions of this paper at POLIS, University of Leeds; at\nthe Department of Politics and Philosophy, Manchester Metropolitan\nUniversity; and at the Philosophy Department, Lancaster University. I\nwant to thank my audiences for their kind attention and helpful questions.\n75\ndoi:10.1017\/S0031819109000047 &2009 The Royal Institute of Philosophy\nPhilosophy 84 2009\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\n1. Toleration\nThe problem and theory of toleration is rooted in the early modern\nrecognition that pluralism is not temporary. In modern societies,\npeople will have deep differences over the most important moral, pol-\nitical, social, and especially religious questions and values. Attempts\nto suppress these differences are disastrous: if they temporarily\nsucceed, the result is tyranny, conspiracy, and the Inquisition;\nwhen they fail, the result is religious war. The idea of toleration,\nthen, is the idea of leaving a space of accepted difference, for instance\nbetween Protestants and Catholics, while maintaining a shared core\nof belief or of moral and political practice. That is, toleration is the\non-its-face paradoxical idea of choosing not to enforce some of\nwhat we think most important.\nWithin that broad idea, there aremany particular theories of tolera-\ntion, andmany taxonomies have been developed to handle that range.\nPreston King, for instance, divides theories of toleration by their\nobjects, and distinguishes between ideational, organisational and\nidentity toleration.2 Catriona McKinnon divides by justification,\nand distinguishes between theories grounded in scepticism, in\nvalue pluralism, and in the ideal of reasonableness.3 Rainer Forst\ndivides by the relation between tolerator and tolerated, and dis-\ntinguishes between permission, coexistence, respect, and esteem con-\nceptions of toleration.4 For my own purposes, I shall make use of\nthree taxonomic questions to distinguish theories of toleration:\n1. What justifies the shared core of belief or practice in the face of\ndifference?\n2. What must we refrain from enforcing or remain neutral about?\n3. Who gets in?\nQuestion 3 is the mirror-image of question 2: it asks what we must\nnot refrain from enforcing or remain neutral about – what are the\nlimits of toleration? (A question often pressed by asking,Must we tol-\nerate the intolerant?)\n2 Preston King, Toleration (New York: St Martin’s Press, 1976).\n3 Catriona McKinnon, Toleration: A Critical Introduction (London:\nRoutledge, 2006).\n4 Rainer Forst, ‘Toleration’ in Edward N. Zalta ed., The Stanford\nEncyclopedia of Philosophy (Spring 2007 edition), http:\/\/plato.stanford.\nedu\/archives\/spr2007\/entries\/toleration\/.\n76\nSamuel Clark\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nTwo examples will make the point of these questions clearer, as\nwell as providing useful materials for my later argument. First, con-\nsider John Rawls’s theory of toleration:\n1. A shared core of belief and practice is justified by reasonable\nagreement between free and equal citizens, dramatised by a\nthought experiment – the original position – which asks\neach of us what political regime she would choose to live\nunder if she knew neither which of its roles she filled, nor\nher own answers to the deepestmoral, political, social, and reli-\ngious questions. The shared core is what it is fair to require of\none another despite our deep differences – that is, what would\nbe chosen under these conditions of fair choice.\n2. We must remain neutral, in the public or political sphere,\nabout our comprehensive conceptions of the good: we must\nchoose not to enforce our answers to the deepest questions.\nHowever, Rawls does not intend to imply scepticism about\nthose answers. We are fully to hold and assert the truth of\nwhat we believe in private.\n3. Anyone who can limit their public discourse, and their argu-\nments about the use of state power, according to the ideal of\nreasonableness, gets in. In Rawls’s own U.S. context, for\ninstance, premillenial dispensationalist Christians get in, just\nso long as they make no appeal to The Revelation of St. John\nthe Divine when trying to direct public power – because they\ncannot reasonably expect other citizens to accept such\narguments.5\nSecond: toleration is a central issue for Hume, both in his moral\nand political philosophy, and in his history; but his explicit discus-\nsion of toleration is fragmentary and incomplete, and one of my\ntwo purposes here is to offer a completion for it. For the moment,\nthen, consider Hume’s explicit account of toleration:\n1. A shared core of belief and practice is justified in two ways.\nFirst, by a sceptical argument derived from Pierre Bayle:\nno-one can be sure enough of the truth of her own beliefs to\nhave rational warrant to enforce them. Second, and more\n5 I draw here especially on John Rawls, Political Liberalism (New York:\nColumbia University Press, 1993) and ‘The Idea of Public Reason\nRevisited’ in The Law of Peoples (Cambridge Massachusetts: Harvard\nUniversity Press, 1999), 129–80.\n77\nNo Abiding City: Hume, Naturalism, and Toleration\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nprominently, by a historically-informed pragmatism. Hume\nrepeatedly argues in his History of England that attempts to\nend pluralism of religious belief, for instance by Mary,\nElizabeth I, or Philip II, are disastrous in practice. They\nresult in tyranny and war; so, toleration is ‘a compromise\nborn out of long-lasting suffering’.6\n2. Wemust remain neutral between Christian confessions. Hume\nargues for specifically religious toleration, on, again, pragmatic\ngrounds: religious difference is the central problem for peace in\nhis own time.\n3. Who gets in? Hume is frustratingly unclear: Protestants,\nCatholics, and perhaps deists do; but the exact limits of the\nspace of toleration are not well-drawn.\nThis is an unsatisfying theory of toleration, for at least three reasons.\nIt fails to answer my question 3. It focuses only on religious toleration,\nwhich, although an important question now as for Hume, is not the\nonly problem of difference. And, most importantly, the justifications\nHume gives for toleration are weak. The sceptical argument does too\nmuch: if no-one can be sure enough of her own beliefs to have rational\nwarrant to enforce them, thenno-one canbe sure enoughof herbelief in\ntoleration tohave rationalwarrant to enforce that.7Either there are cases\nwhere we must enforce despite a lack of warrant to do so, and the pro-\nposed justification of toleration fails to show that our deepest moral,\nsocial and religious claims are not among those cases; or enforcement\nalways requireswarrant, and toleration is nomorewarranted, nor there-\nfore enforceable, than any other social and political practice. Either\nway, sceptical toleration is self-defeating. The pragmatic justification\nof toleration, on the other hand, doesn’t do enough. It offers at best a\nmodus vivendi justification, that mutual toleration is the least worst\noption in current circumstances. In different circumstances – a less\nequal balance of power between competing confessions; better technol-\nogies of surveillance and control – intolerance might be the better bet.\nWewant more out of a justification of toleration than the mere thought\nthat, right now, no-one can safely get awaywith intolerance. I conclude\nthat Hume’s explicit justification of toleration needs, at least, to be\nsupplemented.\n6 Richard Dees, ‘ “The Paradoxical Principle and Salutary Practice”:\nHume on toleration’, Hume Studies 31 (2005), 145–64, 159. I am indebted\nto this article in setting out Hume’s explicit account.\n7 As Robert Frost didn’t quite say, ‘A sceptical tolerator is someone too\nbroadminded to take her own side in directing public power’.\n78\nSamuel Clark\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nSo far, I have sketched the problem of toleration; offered three\ntaxonomic questions for distinguishing theories of toleration; and\ngiven the examples of Rawls and of Hume’s disappointing explicit\ntheory, which I hope to complete by offering a political interpretation\nof Dialogues. Others have interpreted Dialogues politically,8 but have\ngonewrong, inmy view, in not seeing the politics in thewider context\nof Hume’s thought, and especially in relation to his naturalism and\nscepticism. I therefore now continue to my second piece of\nbackground.\n2. Naturalism and Scepticism\nHumewas interpreted by his contemporaries, and up to the end of the\nNineteenth Century, as a playful sceptic who takes the empiricism of\nLocke and Berkeley to its logical conclusion, gleefully destabilises our\nbeliefs, but has no positive doctrine of his own to put in their place.\nNorman Kemp Smith’s classic 1905 article ‘The Naturalism of\nHume’9 argued that, on the contrary, Hume is a rigorous naturalist\nwho subordinates reason to inescapable instinct and feeling, and\ntherefore rejects scepticism on the grounds that, although it is ration-\nally irrefutable, it is impossible for creatures like us to believe it. We\nhave natural beliefs, not subject to reason, in both metaphysical and\nmoral arenas. More recent interpretation, for instance by David Fate\nNorton,10 has tended to accept that ‘naturalist or sceptic’ is a false\ndichotomy. Hume is both; the hard question is, How are his natural-\nism and his scepticism related?\nI shall approach that question bymaking a distinction between two\ndifferent kinds of scepticism. The first is the familiar, Cartesian kind,\nabout which the first thing to say is that Descartes is not a sceptic. He\nis a radical anti-sceptic who makes use of sceptical moves and tropes\n8 For instance: John O. Nelson, ‘The Role of Part XII in Hume’s\nDialogues Concerning Natural Religion’, Hume Studies 14 (1988), 347–72;\nRichard Dees, ‘Morality Above Metaphysics: friendship and Philo’s\nstance in Dialogues XII’, Hume Studies 28 (2002), 131–47; John\nW. Danford, ‘ “The Surest Foundation of Morality”: the political teaching\nof Hume’s Dialogues Concerning Natural Religion’, The Western Political\nQuarterly 35 (1982), 137–60.\n9 Norman Kemp Smith, ‘The Naturalism of Hume’, Mind 14 (1905),\n149–73 and 335–47.\n10 David Fate Norton,David Hume: Common-Sense Moralist, Sceptical\nMetaphysician (Princeton: Princeton University Press, 1982). I draw on\nNorton for the account of the reception of Hume just given.\n79\nNo Abiding City: Hume, Naturalism, and Toleration\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nfor his own purposes, and ‘the sceptic’ is a rhetorical character in his\nproject of reconstructing all knowledge on firm foundations.\nDescartes’s favourite metaphor is architectural: current knowledge\nis a condemned house which we must demolish in order to rebuild.\nDescartes’s character ‘the sceptic’ has two roles in this drama. She\nis the demolition firm Descartes brings in to knock down the old\nhouse, and she is the opponent to beat for Descartes’s new methods\nfor gathering and defending knowledge. If those methods can\ndefeat the sceptical monster Descartes has raised, they can certainly\ndefeat the less extreme problems of ordinary scientific practice. The\nmain point to draw from these obvious remarks is that to be a\nCartesian sceptic is not a possible way of life for us, and is not\nintended to be. This character, ‘the sceptic’, plays two particular\nroles in Descartes’s project of reconstruction, but is not presented\nas a real human possibility. No-one can adopt this form of scepticism\nas a way of life.\nMy second kind of scepticism is Pyrrhonism, and the first thing\nto say about it is that it does offer a way of life which we might\nadopt (or, more cautiously, it is intended to offer such a way of life).\nPyrrhonism is a spiritual and therapeutic discipline aimed at ataraxia\n– tranquility – via epoche – suspension of judgement about opposing\nknowledge claims. The sceptical adept frees herself from disturbance\nby reminding herself of the equally compelling alternatives to each\nparticular claim of knowledge that she encounters. Her mantra is\nneither one nor the other. The Pyrrhonian’s focus, then, is on how to\nlive without disturbance, not on how to know with certainty. Sextus\nEmpiricus characterises the Pyrrhonian life as follows:\nThus, attending to what is apparent, we live in accordance with\neveryday observances, without holding opinions – for we are\nnot able to be utterly inactive. These everyday observances\nseem to be fourfold, and consist in guidance by nature, necessita-\ntion by feelings, handing down of laws and customs, and teaching\nof kinds of expertise.11\nIn what follows, I shall emphasise the contrast Sextus draws here\nbetween holding opinions and being subject to guidance and necessitation\nby nature and feeling.\nHow is this relevant to Dialogues? The character Philo can be\nunderstood as a Pyrrhonist. In Dialogues part 1 he initially appears\nto be a Cartesian sceptic, denying that there is any rational warrant\n11 Sextus Empiricus, Outlines of Scepticism trans. Julia Annas &\nJonathan Barnes (Cambridge: Cambridge University Press, 1994), 9.\n80\nSamuel Clark\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nfor any belief whatsoever (actually being introduced to such a person\nwould be rather like being introduced to Hamlet). Cleanthes makes\nthe obvious objection to this position as a way of life:\nWhether your skepticism be as absolute and sincere as you\npretend, we shall learn by and by, when the company breaks up;\nwe shall then see whether you go out at the door or the window,\nand whether you really doubt if your body has gravity or can be\ninjured by its fall, according to popular opinion derived from\nour fallacious senses and more fallacious experience.12\nPhilo immediately retreats:\nTo whatever length anyone may push his speculative principles of\nskepticism, he must act, I own, and live, and converse like other\nmen; and for this conduct he is not obliged to give any other\nreason than the absolute necessity he lies under of so doing.13\nOneway of reading this retreat is that Philo is advocatingHume’s own\nmitigated or Academic scepticism.14 But I want to focus, instead, on\nthe echo of Sextus: we must live, and act, and converse; we are not\nable to be utterly inactive. On this reading, Philo is drawing the\nreader’s attention to the immediate and inescapable demands of\nhuman life – the guidance and necessitation of nature and feeling.\nPyrrhonists, according to Sextus, ‘are disturbed by things which\nare forced upon them; for we agree that at times they shiver and are\nthirsty and have other feelings of this kind.’15\nThe Pyrrhonist does not hold opinions;16 she is merely subject to\ncertain demands. The answer to Cleanthes’s common-sense argument\nagainst Cartesian scepticism is that belief is not the only thing which\nshapes life; it is not even the most important thing. Life is shaped by\nthe necessary demands of nature, even in the absence of opinions or\nbeliefs. There is no rational warrant for acting as if one really is a vul-\nnerable human in a recalcitrant world, but no such warrant is\nrequired. The answer to the Cartesian sceptic’s question is to recog-\nnise the inescapable demands of hunger, thirst, action and sociability.\n12 David Hume, Dialogues Concerning Natural Religion ed. Richard\nH. Popkin (2nd edn, Indianapolis: Hackett, 1998), 5.\n13 Op. cit. note 12, 6–7.\n14 I want to thank Martin Bell for pressing me on this point.\n15 Op. cit. note 11, 11.\n16 Perhaps in some technical sense of ‘opinion’: see Myles Burnyeat &\nMichael Frede eds, The Original Sceptics: A Controversy (Indianapolis:\nHackett, 1997).\n81\nNo Abiding City: Hume, Naturalism, and Toleration\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nThe relationship between naturalism and scepticism, then – at\nleast here, if not in all of Hume’s work – is the Pyrrhonian one: scep-\nticism insists on the inescapability of nature, rather than insanely\ntrying to ignore it, or irrelevantly insisting on rational warrant. If\nthis is right, then the irony of Kemp Smith’s interpretation is that,\nby arguing against a sceptical reading of Hume, he turns Hume\ninto a Pyrrhonian sceptic.\nIn summary: Pyrrhonism, unlike Cartesian scepticism, is a way of\nlife. The lessonHume dramatises with Philo’s Pyrrhonian arguments\ninDialogues 1 is that belief is not the only thing which shapes life: we\nare inescapably subject to the demands of the world and of being\nhuman. I now have my two pieces of background, and can go on to\nmy reading of Dialogues.\n3. Dialogues as Political Drama\nDialogues Concerning Natural Religion (first published posthumously\nin 1779) is a dialogue – a play script – closely modelled on classical\nphilosophical dialogues, and especially on Cicero’s On the Nature of\nthe Gods.17 It is divided into twelve parts plus a prologue: part 1\nI have already discussed; parts 2–8 consider design arguments for\nthe existence of God; part 9, a priori arguments; parts 10–11, the\nproblem of evil. Part 12 is ambiguous, and my main focus here.\nThe piece has four characters, two of whom I have already men-\ntioned: Philo the jesting sceptic; Cleanthes the natural theologian\nand advocate of the design argument; Demea the orthodox, authori-\ntarian Christian, often the butt of Philo’s jokes; and Pamphilus,\nCleanthes’s ward and the narrator of the piece. Pamphilus takes\nlittle direct part in the Dialogues, offering only a framing narrative\nat the beginning and a partisan summation at the end.\nDialogues has typically provoked two interpretative questions,\napart from the details of its arguments. First, Who is Hume?\nWhich character argues for Hume’s own position? Every character\nexcept Demea has been identified as Hume’s distinct representa-\ntive.18 John Nelson has argued that Dialogues is a philosophical\n17 See Christine Battersby, ‘TheDialogues as Original Imitation: Cicero\nand the nature of Hume’s skepticism’ in David Fate Norton et al. eds,\nMcGill Hume Studies (San Diego: Austin Hill Press, 1979), 239–52.\n18 Philo: Norman Kemp Smith, Introduction to David Hume,\nDialogues Concerning Natural Religion (Indianapolis: Bobbs-Merrill,\n1963), 1–75. Cleanthes: B. M. Laing, ‘Hume’s Dialogues Concerning\n82\nSamuel Clark\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nautobiography, with each character representing a different stage in\nthe development of Hume’s thought19 (and Demea, perhaps, repre-\nsenting the priggish teenage Hume who made up lists of virtues to\nquantify his own and his classmates’ moral worthiness). However,\nthe majority view is that Hume’s representative is Philo: he gets the\nlion’s share of the lines and he wins most of the arguments. This\nidentification raises the second interpretative question: If Hume is\nPhilo, how are we to explain Philo’s startling U-turn in Dialogues\n12? In the main body of Dialogues, Philo has destroyed every argu-\nment for the existence of God put to him. The conclusion the\nreader expects is that, at best, we have no compelling reason for\nbelief in God or for adopting religious practices. But in part 12,\nPhilo suddenly announces:\n[N]otwithstanding the freedom of my conversation and my love\nof singular arguments, no one has a deeper sense of religion\nimpressed on his mind, or pays more profound adoration to the\ndivine being . . . To be a philosophical skeptic is, in a man of\nletters, the first and most essential step towards being a sound,\nbelieving Christian.20\nThis reversal has provoked a huge range of interpretations. Hume,\nmasked as Philo, has been claimed to be an atheist, a deist, an agnos-\ntic, even a Spinozan pantheist.21 It has been suggested that Hume\nthinks that belief in God is an inescapable natural belief like belief\nin causation or in a continuing self;22 or that he is a sceptical fideist\nwho strongly distinguishes faith from reason and ‘seeks to\nNatural Religion’, Philosophy 12 (1937), 175–90. Pamphilus (!): Charles\nW. Hendel, Studies in the Philosophy of David Hume (new edn,\nIndianapolis: Bobbs-Merrill, 1963), chapters X–XII.\n19 Nelson, op. cit. note 8.\n20 Op. cit. note 12, 77.\n21 Atheism: perhaps the most obvious interpretation of the Dialogues.\nDeism: Laing, op. cit. note 18. Agnosticism: James Noxon, ‘Hume’s\nAgnosticism’, Philosophical Review 73 (1964), 248–61. Spinozism: George\nJ. Nathan, ‘Hume’s Immanent God’ in V. C. Chappell ed., Hume\n(London: Macmillan, 1968), 396–423.\n22 Stanley Tweyman, Scepticism and Belief in Hume’s Dialogues\nConcerning Natural Religion (Dordrecht\/Boston: M. Nijhoff, 1986).\nFor counter-argument, see J. C. A. Gaskin, Hume’s Philosophy of Religion\n(2nd edn, London: Macmillan, 1988).\n83\nNo Abiding City: Hume, Naturalism, and Toleration\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\ncommend faith to us by emphasising the impotence of reason’.23\nPart 12 has been read as just an ironic reemphasis of Philo’s victory\nover religious belief, intended to be read in a heavily sarcastic tone\nof voice.24 It might be tempting to read it as advocating the view\nput into the mouth of Epicurus in section 11 of the first Enquiry:\npublic religious performance for the sake of civil peace, regardless\nof private unbelief.25\nLuckily for me, I don’t need to resolve this second question,\nbecause I think that the first question – who is Hume? – is the\nwrong question. Dialogues is a play. Hume was a master at writing\ntreatises and essays in a single voice – not always, or perhaps ever,\nhis own voice – and had a deep concern for literary form and rhetori-\ncal strategy. The dialogue form he chose for this piece is not acciden-\ntal: the message is in the whole, in the interactions of all the\ncharacters, not in any one character. Shakespeare does not appear in\nhis own person in Hamlet; there is no need to ask whether\nRosencrantz or Guildenstern is Tom Stoppard; and it is similarly a\nmistake to expect Hume to be behind just one of the masks he\nadopts in Dialogues.26\n23 Terrence Penelhum, ‘Natural Belief and Religious Belief in Hume’s\nPhilosophy’ in Themes in Hume: The Self, the Will, Religion (Oxford:\nClarendon Press, 2000), 204–221, 205.\n24 John Valdimir Price, The Ironic Hume (Austin: University of Texas\nPress, 1965).\n25 David Hume, Enquiry Concerning Human Understanding ed. Tom\nL. Beauchamp (Oxford: Oxford University Press, 1999). This last sugges-\ntion gains plausibility from some of Hume’s private remarks about his\nown lack of religious practice. In a letter to James Edmonstoune, for\ninstance, Hume drily regrets that he isn’t able to bring himself to the harm-\nless hypocrisy of playing along with religious observance: ‘I wish it were still\nin my power to be a hypocrite in this particular. The common duties of\nsociety require it; and the ecclesiastical profession only adds a little more\nto an innocent dissimulation, or rather simulation, without which it is\nimpossible to pass through the world. Am I a liar, because I order my\nservant to say, I am not at home, when I do not desire to see company?’\n(letter from Paris, April 1764, in J. Y. T. Greig ed., The Letters of David\nHume (2 vols, Oxford: Clarendon Press, 1932), vol. 1, 439–440. I owe this\nreference to Dees, op. cit. note 8.\n26 I agree, then, with John Bricke, who argues that ‘it is a fundamental\nmistake to assume that one of the characters in the Dialogues serves as the\nauthor’s primary spokesman’ (‘On the Interpretation of Hume’s\nDialogues’, Religious Studies 11 (1975), 1–18, 3). Bricke argues for this con-\nclusion on quite different grounds: ‘[N]either Philo nor Cleanthes could\nspeak for Hume, for each is less of a philosopher than Hume is, each at\n84\nSamuel Clark\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nI suggest, further, thatDialogues is not only a drama: it is a political\ndrama. There are two initial clues of political intent. First, questions\nof education for public life run all throughDialogues. Pamphilus, the\nnarrator, is Cleanthes’s student. Demea starts the conversation in\nPart 1 by stating a theory of education: his purpose in teaching his\nchildren is to tame their minds ‘to a proper submission and self-\ndiffidence’27 so that they will be ready to receive the religion he will\neventually impart to them without the self-confidence for, or tools\nof, rational defence. In general, the other characters are very aware\nof Pamphilus’s presence and their educative effect on him. Second,\nDialogues adopts the political vocabulary of Hume’s explicitly politi-\ncal History of England, Natural History of Religion, and many of his\nessays on politics and religion: the vocabulary of superstition and\nenthusiasm, which Hume regards as pathologies both of belief and\nof social action.28 The main argument for a political reading,\nhowever, is that it organises and makes sense of what was previously\ndifficult to understand.\nI therefore offer the following way of accounting for Philo’s\nU-turn, understanding the Dialogues as a whole, and articulating\nHume’s implicit theory of toleration: Dialogues dramatises a theory\nof toleration grounded in political Pyrrhonism. It is a picture of tol-\nerant politics in microcosm which displays Philo and Cleanthes, who\nare friends, but who apparently disagree about almost everything,\nand especially over religious questions and values. They disagree\nabout almost everything, but there are two exceptions.\nFirst, both accept a ‘true religion’29 defined by exclusion. It excludes\nsuperstition, which for Hume is grounded in fear and weakness, and\nleads to tyranny; it excludes enthusiasm – fanaticism – which is\ngrounded in passionate over-confidence, and leads to violence.\nPerhaps most importantly, it excludes the authority of priests and\nreligious institutions:\ntimes expresses distinctly un-Humean views, and neither develops a reason-\nably clear, well-argued, and consistent position’ (13). Although Bricke\nargues for the same hermeneutic as I do, he does not apply it to draw any\nconclusions about the message of the Dialogues.\n27 Op. cit. note 12, 4.\n28 David Hume, History of England (8 vols, London: Talboys and\nWheeler\/W. Pickering, 1826); The Natural History of Religion ed. James\nFieser (London: Macmillan 1992); ‘Of Superstition and Enthusiasm’ in\nSelected Essays ed. Stephen Copley & Andrew Elgar (Oxford: Oxford\nUniversity Press, 1993), 38–43.\n29 Op. cit. note 12, 85.\n85\nNo Abiding City: Hume, Naturalism, and Toleration\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nIs there any maxim in politics more certain and infallible than\nthat both the number and authority of priests should be confined\nwithin very narrow limits, and that the civil magistrate ought, for\never, to keep his fasces and axes from such dangerous hands?30\nTrue religion claims no authority over civil life. The main point of\nDialogues 2-11 is that no claims about the character or commands\nof God (or the gods) have rational warrant. Hume’s further point\nin part 12 is that thosewho claim to know anything about God’s char-\nacter and commands should be excluded from civil power. Demea is\nnot to be allowed to impose his ‘established doctrines and opinions’.31\nTrue religion, then, is in practice indistinguishable from no religion.\nIf it has any religious features, they are forms of words or public\nrituals, with which Philo is willing to play along for politeness’s\nsake, but which are to have no influence on the communal use of\npower. There is an echo here of the Epicurean position described\nabove: public performance is distinguished from private belief, and\nthe latter is to have no influence on the former. But in this version,\nit is Demea’s belief in a God who makes knowable commands\nwhich is excluded, rather than Epicurus’s disbelief.\nThe second point that Philo and Cleanthes agree on is the source of\nmorality. For Demea, the source of morality is the authoritative\ncommand of God, as heard and interpreted, of course, by Demea.\nFor Cleanthes and Philo, the source of morality is the demands\nwe are subject to as humans. The source is nature, not command:\nwe must live, act, and converse; we must suffer thirst and feel cold; we\nmust make our way as vulnerable bodies who need each other; we\ncannot help but react to selfishness and benevolence, or to politeness\nand contempt, as we do; we can be educated to react to justice and\ninjustice similarly. Cleanthes and Philo, that is, share Hume’s own\nnaturalistic ethics as set out in the second Enquiry.32 Cleanthes\nbriefly defends religion in its ‘proper office’, when it makes no\nclaims about supernatural authority and merely, silently ‘enforces\nthe motives of morality and justice’.33 But Philo rapidly dismisses\neven this last half-hearted defence, and both come to agree that, at\nbest, religion has no effect on morals: the effect of popular religion\nis ‘factions, civil wars, persecutions, subversions of government,\n30 Op. cit. note 12, 85.\n31 Op. cit. note 12, 4.\n32 David Hume, Enquiry Concerning the Principles of Morals ed. Tom\nL. Beauchamp (Oxford: Oxford University Press, 1998).\n33 Op. cit. note 12, 82.\n86\nSamuel Clark\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\noppression, slavery’,34 and ‘the smallest grain of natural honesty and\nbenevolence has more effect on men’s conduct than the most\npompous views suggested by theological theories and systems’.35\nWhen religion interferes with morals, as Demea wants, the result is\npathological violence and tyranny.\nThis microcosm of friendship dramatises a macrocosmic politics:\nHume is aiming, as a political Pyrrhonist, at social as well as personal\ntranquility. His therapeutic project is directed at politics as well as at\npersonal life. I now return to my three, taxonomic questions about\ntoleration, in order to set out the implicit theory I have uncovered\nin Dialogues.\n1. What justifies the shared core of belief or practice in the face of\ndifference?What’s inescapable for us: necessity, not belief. We\ncannot avoid the necessities of conversation, hunger, thirst,\nand living together. That core must resist certain centrifugal\nforces: the pathologies of belief and social action which are\nsuperstition and enthusiasm, and the authority-claims of\npriests and other interpreters of supernatural command.\n2. What must we refrain from enforcing or remain neutral about?\nThe deliverances of priestly speculation and assertion. There\nare to be no divine commands in social life.\n3. Who gets in? Not Demea: he left in a huff at the end of part 11.\nAnd not, therefore, the orthodox authoritarians – in particu-\nlar, the traditionalist members of the Kirk who had prevented\nHume from getting university positions in Glasgow and\nEdinburgh – whom he represents. But both Philo the\nsceptic and Cleanthes the theist do get in, because they agree\nthat distinctively religious claims are to have no effect on\ncommon life. They agree that the ground of politics and\nethics is the demands of nature, not belief.\nWe can further articulate this theory by comparison with the other\nexample I gave in section 1, Rawls. BothHume andRawlsmake a dis-\ntinction between public and private: what we say and do in public,\nand especially in relation to public power, must be limited for the\nsake of civil peace. But there are two important differences between\nthem. They differ, first, over the location of real life. For Rawls,\nour real lives are in our local, rich conceptions of the good and in\nthe private communities – churches, for instance – held together\n34 Op. cit. note 12, 82.\n35 Op. cit. note 12, 83.\n87\nNo Abiding City: Hume, Naturalism, and Toleration\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nby commonalities of belief. Politics, in contrast, is thin and con-\nstrained because we cannot reasonably expect others to share those\nrich conceptions of the good, those beliefs. This is one way in\nwhich Rawls opens himself to well-known communitarian cri-\ntiques.36 For Hume, the contrast is the other way around: real life\nis human social life, the life in public. The speculative use of\nreason to support supernatural commands – reliance on belief\nrather than necessitation by nature – is strained, artificial, and\ndangerous. Giving in to the immediate demands of humanity is\nnatural and easy. Second, as that implies, the regimes of toleration\nimplied by Rawls and by Hume are differently justified. For Rawls,\nthe justification appeals to shared belief in the ideals of the free and\nequal citizen and of reasonableness. For Hume, it appeals to shared\nnecessity: the shared demands of being human in a recalcitrant world.\n4. Nature as Justification\nI said at the start of this paper that I aimed both at interpretation and\nat archaeology. I now move to the second of those aims, and try to\nshow that the theory of toleration I have discovered in Hume is an\nattractive alternative to contemporary Rawlsian theory. Of my three\ntaxonomic questions about the justification, the inclusions and the\nexclusions of a regime of toleration, the first is fundamental, and I\nconcentrate on it here. I shall set out Rawls’s strategy for justification,\ncontrast it with Hume’s naturalistic alternative, and consider some\nadvantages and possible disadvantages of the latter. I intend only to\nmake the contrast between Hume and Rawls clearer, and to offer\nsome considerations which might tend to make us choose Hume of\nthe two, not to refute Rawls.\nA justification of some proposition or action is a decisive reason for\nbelieving that proposition or performing that action. The practice of\njustification, then, is concerned with discovering and conveying\nreasons, and showing that they outweigh or trump conflicting\nreasons. The distinction between Hume’s and Rawls’s accounts of\nthe justification of toleration is a distinction between the kinds of\nreasons they take to be decisive for what we ought to believe and\/or\ndo about toleration.\n36 See for instance Michael Sandel, Liberalism and the Limits of Justice\n(2nd edn, Cambridge: Cambridge University Press, 1998), and more gener-\nally StephenMulhall & Adam Swift, Liberals and Communitarians (Oxford:\nBlackwell, 1996).\n88\nSamuel Clark\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nRawls’s account of the justification of a moral or political regime\nchanged over his career, in ways too complex to describe here.\nWhat became increasingly clear over the course of those changes,\nhowever, was that Rawls saw justification as an activity internal to a\nsystem of beliefs. Rawls’s decisive reason for endorsing beliefs\nabout toleration is consistency: denying those beliefs is inconsistent\nwith beliefs about the freedom and equality of citizens; these\nbeliefs about citizens are so central to our political culture that we\ncannot or will not give them up. The immediate practical task of pol-\nitical philosophy is to discover in our culture a basis for public agree-\nment on first principles of justice, and those principles will embody\ntoleration by being neutral between competing religious and secular\nconceptions of the good. We justify toleration by showing that our\nshared core of belief in the free and equal citizen requires us to\nleave space for difference over our answers to deep questions about\nvalue, and to refrain from enforcing our own answers to those\nquestions.\nRawls’s constructivist approach to the justificatory task is to give\naccounts of (1) the liberal-democratic concept of the citizen as free,\nequal, and possessing moral powers; (2) the well-ordered society;\nand (3) the original position. Rawls then moves from (1) to (2) –\nfrom an ideal of the citizen to a social ideal – via a process of construc-\ntion involving (3). The original position dramatises commitments\nalready implicit in our most firmly-held political beliefs, by\nshowing us what treating citizens as free and equal requires – that\nis, by showing us how (1) the ideal of the person and (2) the social\nideal fit together. The result of this process – justice as fairness – is\nnot true by correspondence to any pre-existing moral order, but is\nobjective in the special sense that it derives from a suitably con-\nstructed point of view, represented by the original position. The\nreason Rawls discovers for defending a tolerant regime, then, is that\nwe are already committed to beliefs which we are unwilling to give\nup, and which are inconsistent with intolerance. Crudely: if Rawls\nis asked, Why should I believe in toleration?, he will respond,\nBecause not to do so would render your political belief-system inco-\nherent. His justification is consistency.37\n37 This paragraph draws particularly on John Rawls, ‘Kantian\nConstructivism in Moral Theory’ in Samuel Freeman ed., Collected\nPapers (Cambridge Massachusetts: Harvard University Press, 1999),\n303–58 and on Rawls, Political Liberalism, op. cit note 5, Lecture III. It\nignores a range of interpretative and historical questions about the develop-\nment of Rawls’s views, but is, I believe, accurate to the spirit of his eventual\n89\nNo Abiding City: Hume, Naturalism, and Toleration\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nHume’s justification of toleration, as I have discovered it in\nDialogues, appeals not to consistency but to nature: we are vulnerable\nhumans in a world which makes unignorable demands on us. I take it\nthat these demands, unlike beliefs, are non-cognitive and non-\nreferential. There is a difference in direction of fit: beliefs aim from\nus at the world; demands are the world taking aim at us. Demands\nare also reason-giving: if I am subject to a demand, I have reason to\ndo certain things and not to do certain others. In some ways, all I\ncan do is to resign myself to what is going to happen regardless of\nmy beliefs and desires – I will eventually die, for instance. In other\nways, I can respond intelligently to the various demands of nature\nby, for instance, doing what I can to maintain my health. In\ngeneral, nature’s demandingness makes it such that there are necess-\nary conditions of achieving or maintaining one’s good, and that these\nconditions are not liable to be annulled by what one believes about\nthem. Demands, then, are causal rather than (merely) evidential,\nand the Humean concern is with what the world’s demands are and\nwhat they do to us. The requirements we are subject to as humans\nare centering forces: they pull us toward a certain form of life\nwhich resists the centrifugal distortions of belief-motivated supersi-\ntion, enthusiasm, and authoritarianism.\nSo far, my appeals to nature’s demands have been impressionistic;\nit’s time to do some clarifying and generalising work. The demands of\nnaturewhich are important for political justification fall into two con-\nnected classes, needs and vulnerabilities. A need is a necessary con-\ndition of achieving some X, and a vital or basic need is a necessary\ncondition of achieving X, where X ¼ not suffering some serious\nharm.38 Humans need food and shelter in the sense that we will\nsuffer the serious harms of starvation and exposure without them.\nHumans also need the company and conversation of other humans\nin this sense: without them, we suffer serious developmental and\npsychological harms. Vulnerabilities are those characteristics of\nhumans which entail that we have needs. They are the specific ways\nin which we can suffer harm, including the various ways in which\nour bodies can be damaged, our personalities deranged, and our\nrelationships with others rendered intolerable. We are vulnerable to\nposition. It further ignores Rawls’s suggestion that ‘political liberalism\napplies the principle of toleration to philosophy itself’ (Political\nLiberalism, 10) simply because I don’t understand what that means.\n38 David Wiggins, ‘Claims of Need’ in Needs, Values, Truth: Essays in\nthe Philosophy of Value (3rd edn, Oxford: Clarendon Press, 1998), 1–58.\n90\nSamuel Clark\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nbeing cut, broken, maddened, and enslaved. As the last possibility\nsuggests, some of our most important vulnerabilities are to one\nanother: some of the worst kinds of suffering, such as slavery, are\ninflicted by other humans. Further, as Thomas Hobbes argues, our\nequal vulnerability to one another is one of the central facts for politi-\ncal justification:\nFor as to the strength of body, theweakest has strength enough to\nkill to strongest, either by secret machination, or by confederacy\nwith others that are in the same danger with himself.39\nNo matter what small advantages you enjoy over other humans, they\ncan always gang up on you, and they know where you sleep. These\nremarks about human needs and vulnerabilities are, in a sense,\nbanal; they have to be insisted on only in the context of a contempor-\nary Rawlsian paradigm which understands justification as an appeal\nto the internal consistency of political belief-systems.\nWe are now in a position to compare the Humean with the\nRawlsian account of the justification of toleration. I want to empha-\nsise two advantages of Hume, before considering one possible disad-\nvantage. Hume’s first advantage is that the Humean strategy for\njustifying toleration has far wider scope than the Rawlsian. Rawls’s\naccount of justification is particularistic or anti-universalist: we\nstart from where we are, embedded in a particular political culture,\nand do not attempt to extend its values to all times and places. In\nRawls’s later work it became increasingly clear that ‘we’ are the\nheirs of a liberal-democratic constitutional tradition – perhaps,\neven, just that tradition in the United States – and no-one else:\nWe look to ourselves and to our future, and reflect upon our dis-\nputes since, let’s say, the Declaration of Independence. How far\nthe conclusions we reach are of interest in awider context is a sep-\narate question.40\nHume’s naturalistic justifications, in contrast, offer reasons to all\nhumans: those who do not share the inheritance of the Declaration\n39 Thomas Hobbes, Leviathan ed. Edwin Curley (Indianapolis:\nHackett, 1994), 74.\n40 Rawls, ‘Kantian Constructivism in Moral Theory’, op. cit. note 37,\n306. This increasing particularism is, I believe, partly a consequence of\nRawls’s encounter withMichael Walzer. I have argued against Walzer’s dis-\ntinctive version of particularism in Samuel Clark, ‘Society Against\nSocieties: the possiblity of transcultural criticism’, Res Publica 13 (2007),\n107–125.\n91\nNo Abiding City: Hume, Naturalism, and Toleration\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nof Independence do share human needs and vulnerabilities. This is\nattractive, at least, for the practical reason that many of our most\npressing disputes about toleration, and about political justice in\ngeneral, are not internal to the United States and its penumbral\nculture.\nThe Humean’s second advantage is her ability to weigh or rank\ndifferent reasons against one another. Reasons of consistency can\npull either way: if I have two beliefs which are inconsistent – say,\nbelief in the liberal ideal of the citizen and belief in an intolerant theo-\ncratic regime – I can make my belief-system coherent by dropping or\nmodifying either belief. The Rawlsian has no obvious basis for claim-\ning that I must drop my second, intolerant belief and become a fully\nconsistent liberal, instead of dropping my belief in the citizen and\nbecoming a fully consistent theocrat.41 The Humean, in contrast,\ncan distinguish reasons derived from human needs and vulnerabil-\nities from reasons derived from beliefs, and insist that the former\nare trumps (i.e. lexically prior), or at least that they have considerably\nmore weight. This has the advantage of avoiding the ugly conclusion\nthat, for instance, a consistent theocratic regime is as well-justified as a\nconsistent liberal regime. It is not, to the extent that the theocratic\nregime harms people.42\nAs already noted, the Humean emphasises the centering force of\nnature’s demands. On the Rawlsian picture, there are multiple\nislands of stability and coherence in the webs of people’s beliefs,\nincluding islands which do significant harm. On the Humean\npicture, there is one centre which is focussed by the gravity of need\nand vulnerability and threatened by centrifugal forces.\nOne possible disadvantage of the Humean account is that the pol-\nitical proposals we can make on the basis of needs and vulnerabilities\nare far less specific and detailed than those the Rawlsian can make on\nthe basis of consistency with the ideal of the citizen. The original pos-\nition is designed to articulate this liberal conception of politics, and is\n41 David Brink has argued that Rawls attempts, illegitimately in his own\nterms, to make the ideal of the citizen exempt from this process of modifi-\ncation towards consistent reflective equilibrium: ‘Rawlsian Constructivism\nin Moral Theory’, Canadian Journal of Philosophy 17 (1987), 71–90.\n42 A stable and successful theocratic regime might not physically harm\nanyone (although this seems unlikely on the historical record of such\nregimes). Even if so: first, there are long-standing and plausible enlighten-\nment arguments that such regimes do psychological and developmental\nharm; second, there are arguments I have already canvassed in discussing\nHume, above, that theocratic regimes are inherently unstable and must\nexpect to face internal opposition which will eventually lead to violence.\n92\nSamuel Clark\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nsupposed to result in Rawls’s precise principles of justice. In contrast,\nthe Humean seems to be left with the rather less precise suggestion\nthat we refrain from hurting people. The demands of nature do not\napparently justify any policy proposal as specific as, for instance,\nthat the basic structure of society should satisfy the difference prin-\nciple in its distribution of goods.43 However, I am not certain that\nthis is a big difference, nor therefore much of a disadvantage. If the\noriginal position allowed Rawls to show that commitment to the\nliberal ideal of the citizen entails commitment to toleration, then to\ncompete, the Humean would have to offer some similar derivation,\nand that looks unlikely. But Rawls is explicit that he cannot show\nsuch an entailment: the original position allows us to make a reason-\nable choice between some major alternatives in the history of moral\nand political thought, not to derive the principles of justice from\nthe ideal of the citizen.44 So, the Humean is not in a worse position:\nshe also can appeal to history, and especially to the history of tolerant\nand intolerant regimes, to argue for the superiority of the former in\nrelation to human needs and vulnerabilities. She does not need to\nderive an account of a particular regime solely from those needs\nand vulnerabilities.\nA great deal more could be said in defence of Rawls and the\nRawlsian strategy. I have not tried to refute Rawls, but only intend,\nas noted above, to offer some considerations which might incline us\nto the Humean naturalistic rather than the Rawlsian mode of\njustification.\n5. Conclusion\nOn my reading, Dialogues dramatises a tolerant political practice\ngrounded in shared human necessity, not in belief, and especially\nnot in belief in God. On this Humean account, toleration is justified\nnot by the discovery of esoteric truths about the character and com-\nmands of God, nor by the working out of our commitments as\nliberal citizens, but by the immediate demands of human life. Not\nbelief but the world, because belief is not the only or even the most\nimportant thing which shapes human life: needs and vulnerabilities\nare prior. As I have read him, Hume is dramatising the requirements\n43 I want to thank Derek Edyvane for pressing me on this point in\nseveral conversations.\n44 John Rawls, A Theory of Justice (revised edn, Oxford: Oxford\nUniversity Press, 1999), section 21.\n93\nNo Abiding City: Hume, Naturalism, and Toleration\nhttp:\/\/journals.cambridge.org Downloaded: 16 Oct 2009 IP address: 194.80.32.10\nof a shared life which is neither a theocracy nor a war, and which\nallows its members to live, and act, and converse as they need.\nI end by explaining my title, ‘No Abiding City’. This is a near-\nquote from Philo, describing the advantages of the sceptic in debate:\nHow complete must be his victory who remains always, with all\nmankind, on the offensive, and has himself no fixed station or\nabiding city which he is ever, on any occasion, obliged to\ndefend?45\nI have reread Dialogues as dramatising an attractive way of defending\nan abiding city, grounded in human necessity, not in belief.\nLancaster University\n45 Op. cit. note 12, 53.\n94\nSamuel Clark\n"}