{"doi":"10.5194\/acp-8-5353-2008","coreId":"69207","oai":"oai:eprints.lancs.ac.uk:27965","identifiers":["oai:eprints.lancs.ac.uk:27965","10.5194\/acp-8-5353-2008"],"title":"A multi-model assessment of pollution transport to the Arctic.","authors":["Shindell, D. T.","Chin, M.","Dentener, F.","Doherty, R. M.","Faluvegi, G.","Fiore, A. M.","Hess, P.","Koch, D. M.","MacKenzie, I. A.","Sanderson, M. G.","Schultz, M. G.","Schulz, M.","Stevenson, D. S.","Teich, H.","Textor, C.","Wild, Oliver","Bergmann, D. J.","Bey, I.","Bian, H.","Cuvelier, C.","Duncan, B. N.","Folberth, G.","Horowitz, L. W.","Jonson, J.","Kaminski, J. W.","Marmer, E.","Park, R.","Pringle, K. J.","Schroeder, S.","Szopa, S.","Takemura, T.","Zeng, G.","Keating, T. J.","Zuber, A."],"enrichments":{"references":[{"id":975736,"title":"5372 Multi-model assessment of pollution transport to the Arctic:","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":977302,"title":"A climatologically signiﬁcant aerosol longwave indirect effect in the arctic,","authors":[],"date":"2006","doi":"10.1038\/nature04449","raw":"Lubin, D. and Vogelmann, A. M.: A climatologically signiﬁcant aerosol longwave indirect effect in the arctic, Nature, 439, 453– 456, 2006.","cites":null},{"id":981222,"title":"A model for the spectral albedo of snow. II: Snow containing atmospheric aerosols,","authors":[],"date":"1980","doi":"10.1175\/1520-0469(1980)037<2734:AMFTSA>2.0.CO;2","raw":"Warren, S. G. and Wiscombe, W. J.: A model for the spectral albedo of snow. II: Snow containing atmospheric aerosols, J. Atmos. Sci., 37, 2734–2745, 1980.","cites":null},{"id":974246,"title":"A modeling study of the export pathways of pollution from Europe: Seasonal and interannual variations (1987–1997),","authors":[],"date":"2004","doi":null,"raw":"Duncan, B. N. and Bey, I.: A modeling study of the export pathways of pollution from Europe: Seasonal and interannual variations (1987–1997), J. Geophys. Res., 109, D08301, doi:10.1029\/2003JD004079, 2004.","cites":null},{"id":974027,"title":"Aerosol absorption measurements at Barrow, Mauna Loa and the South Pole,","authors":[],"date":"1995","doi":null,"raw":"Bodhaine, B. A.: Aerosol absorption measurements at Barrow, Mauna Loa and the South Pole, J. Geophys. Res., 100, 8967– 8976, 1995.","cites":null},{"id":980310,"title":"Analysis and quantiﬁcation of the diversities of aerosol life cycles within Aerocom,","authors":[],"date":"2006","doi":null,"raw":"Textor, C., Schulz, M., Guibert, S., Kinne, S., Balkanski, Y., Bauer, S., Berntsen, T., Berglen, T., Boucher, O., Chin, M., Dentener, F., Diehl, T., Easter, R., Feichter, H., Fillmore, D., Ghan, S., Ginoux, P., Gong, S., Grini, A., Hendricks, J., Horowitz, L., Huang, P., Isaksen, I. S. A., Iversen, T., Kloster, S., Koch, D., Kirkev˚ ag, A., Kristjansson, J. E., Krol, M., Lauer, A., Lamarque, J. F., Liu, X., Montanaro, V., Myhre, G., Penner, J. E., Pitari, G., Reddy, M. S., Seland, Ø., Stier, P., Takemura, T., and Tie, X.: Analysis and quantiﬁcation of the diversities of aerosol life cycles within Aerocom, Atmos. Chem. Phys., 6, 1777–1813, 2006, http:\/\/www.atmos-chem-phys.net\/6\/1777\/2006\/.","cites":null},{"id":976833,"title":"Arctic air pollution: Origins and impacts,","authors":[],"date":"2007","doi":"10.1126\/science.1137695","raw":"Law, K. S. and Stohl, A.: Arctic air pollution: Origins and impacts, Science, 315, 1537–1540, 2007.","cites":null},{"id":979796,"title":"Arctic lower tropospheric aerosol trends and composition at Alert,","authors":[],"date":"1980","doi":"10.1029\/1999JD900077","raw":"Sirois, A. and Barrie, L. A.: Arctic lower tropospheric aerosol trends and composition at Alert, Canada: 1980–1995, J. Geophys. Res., 104, 11599–11618, 1999.","cites":null},{"id":980059,"title":"Characteristics of atmospheric transport into the Arctic troposphere,","authors":[],"date":"2006","doi":"10.1029\/2005JD006888","raw":"Stohl, A.: Characteristics of atmospheric transport into the Arctic troposphere, J. Geophys. Res., 111, D11306, doi:10.1029\/2005JD006888, 2006.","cites":null},{"id":975969,"title":"Climate response of fossil fuel and biofuel soot, accounting for soot’s feedback to snow and sea ice albedo and emissivity","authors":[],"date":"2004","doi":null,"raw":"Jacobson, M. Z.: Climate response of fossil fuel and biofuel soot, accounting for soot’s feedback to snow and sea ice albedo and emissivity J. Geophys. Res., 109, D21201, doi:10.1029\/2004JD004945, 2004.","cites":null},{"id":975444,"title":"Data report 2005 acidifying and eutrophying compounds, and particulate matter, EMEP\/CCC-Report 1\/2007,","authors":[],"date":"2007","doi":null,"raw":"Hjellbrekke, A.-G. and Fjæraa, A. M.: Data report 2005 acidifying and eutrophying compounds, and particulate matter, EMEP\/CCC-Report 1\/2007, 2007.","cites":null},{"id":976520,"title":"Distant origins of arctic black carbon: A Goddard Institute for Space Studies modelE experiment,","authors":[],"date":"2005","doi":"10.1029\/2004JD005296","raw":"Koch, D., and Hansen, J.: Distant origins of arctic black carbon: A Goddard Institute for Space Studies modelE experiment, J. Geophys. Res., 110, D04204, doi:10.1029\/2004JD005296, 2005.","cites":null},{"id":977608,"title":"Distributions and recent changes in carbon monoxide in the lower troposphere,","authors":[],"date":"2006","doi":"10.1029\/98JD01366","raw":"Res., 111, D18101, doi:10.1029\/2005JD006323, 2006. Novelli, P. C., Masarie, K. A., and Lang, P. M.: Distributions and recent changes in carbon monoxide in the lower troposphere, J.","cites":null},{"id":980943,"title":"Effects of dirty snow in nuclear winter simulations,","authors":[],"date":"1988","doi":"10.1029\/JD093iD05p05319","raw":"Vogelmann, A. M., Robock, A., and Ellingson, R. G.: Effects of dirty snow in nuclear winter simulations, J. Geophys. Res., 93, 5319–5332, 1988.","cites":null},{"id":981515,"title":"Identiﬁcation of source nature and seasonal variations of Arctic aerosol by positive matrix factorization,","authors":[],"date":"1999","doi":"10.1175\/1520-0469(1999)056<0249:IOSNAS>2.0.CO;2","raw":"Xie, Y.-L., Hopke, P. K., Paatero, P., Barrie, L. A., and Li, S.-M.: Identiﬁcation of source nature and seasonal variations of Arctic aerosol by positive matrix factorization, J. Atmos. Sci., 56, 249– 260, 1999.","cites":null},{"id":975005,"title":"Increased Arctic cloud longwave emissivity associated with pollution from mid-latitudes,","authors":[],"date":"2006","doi":null,"raw":"Garrett, T. J. and Zhao, C.: Increased Arctic cloud longwave emissivity associated with pollution from mid-latitudes, Nature, 440, 787–789, 2006.","cites":null},{"id":977476,"title":"industrial black carbon emissions altered arctic climate forcing,","authors":[],"date":null,"doi":"10.1126\/science.1144856","raw":"McConnell, J., Edwards, R., Kok, G., Flanner, M., Zender, C., Saltzman, E., Banta, J., Pasteris, D., Carter, M., and Kahl, J.: 20th-century industrial black carbon emissions altered arctic climate forcing, Science, 317, 1381–1384, 2007. Miller, R. L., Schmidt, G. A., and Shindell, D. T.: Forced variations of annular modes in the 20th century intergovernmental panel on climate change fourth assessment report models, J. Geophys.","cites":null},{"id":978980,"title":"Local and remote contributions to Arctic warming,","authors":[],"date":"2007","doi":"10.1029\/2007GL030221","raw":"Shindell, D.: Local and remote contributions to Arctic warming, Geophys. Res. Lett., 34, L14704, doi:10.1029\/2007GL030221, 2007.","cites":null},{"id":16672828,"title":"Multi-model assessment of pollution transport to the Arctic:","authors":[],"date":"2008","doi":null,"raw":"www.atmos-chem-phys.net\/8\/5353\/2008\/ Atmos. Chem. Phys., 8, 5353–5372, 20085372 Multi-model assessment of pollution transport to the Arctic: D. T. Shindell et al.","cites":null},{"id":979471,"title":"Multi-model simulations of carbon monoxide: Comparison with observations and projected near-future changes,","authors":[],"date":"2006","doi":"10.1029\/2006JD007100","raw":"Shindell, D. T., Faluvegi, G., Stevenson, D. S., Krol, M. C., Emmons, L. K., Lamarque, J.-F., Petron, G., Dentener, F. J., Ellingsen, K., Schultz, M. G., Wild, O., Amann, M., Atherton, C. S., Bergmann, D. J., Bey, I., Butler, T., Cofala, J., Collins, W. J., Derwent, R. G., Doherty, R. M., Drevet, J., Eskes, H. J., Fiore, A. M., Gauss, M., Hauglustaine, D. A., Horowitz, L. W., Isaksen, I. S. A., Lawrence, M. G., Montanaro, V., Muller, J. F., Pitari, G., Prather, M. J., Pyle, J. A., Rast, S., Rodriguez, J. M., Sanderson, M. G., Savage, N. H., Strahan, S. E., Sudo, K., Szopa, S., Unger, N., van Noije, T. P. C., and Zeng, G.: Multi-model simulations of carbon monoxide: Comparison with observations and projected near-future changes, J. Geophys. Res., 111, D19306, doi:10.1029\/2006JD007100, 2006.","cites":null},{"id":979214,"title":"Northern hemisphere winter climate response to greenhouse gas, volcanic, ozone and solar forcing,","authors":[],"date":"2001","doi":"10.1029\/2000JD900547","raw":"Shindell, D. T., Schmidt, G. A., Miller, R. L., and Rind, D.: Northern hemisphere winter climate response to greenhouse gas, volcanic, ozone and solar forcing, J. Geophys. Res., 106, 7193– 7210, 2001.","cites":null},{"id":978072,"title":"Numerical advection by conservation of secondorder moments,","authors":[],"date":"1986","doi":"10.1029\/JD091iD06p06671","raw":"Prather, M. J.: Numerical advection by conservation of secondorder moments, J. Geophys. Res., 91, 6671–6681, 1986.","cites":null},{"id":974752,"title":"Present-day climate forcing and response from black carbon in snow,","authors":[],"date":"2007","doi":null,"raw":"Flanner, M. G., Zender, C. S., Randerson, J. T., and Rasch, P. J.: Present-day climate forcing and response from black carbon in snow, J. Geophys. Res., 112, D11202, doi:10.1029\/2006JD008003, 2007.","cites":null},{"id":976225,"title":"Seasonal changes in the transport of pollutants into the arctic troposphere-model study,","authors":[],"date":"2003","doi":null,"raw":"Klonecki, A., Hess, P., Emmons, L., Smith, L., Orlando, J., and Blake, D.: Seasonal changes in the transport of pollutants into the arctic troposphere-model study, J. Geophys. Res., 108, 8367, doi:10.1029\/2002JD002199, 2003.","cites":null},{"id":978147,"title":"Short-lived pollutants in the arctic: Their climate impact and possible mitigation strategies,","authors":[],"date":"2007","doi":"10.5194\/acpd-7-15669-2007","raw":"Quinn, P. K., Bates, T. S., Baum, E., Doubleday, N., Fiore, A. M., Flanner, M., Fridlind, A., Garrett, T. J., Koch, D., Menon, S., Shindell, D., Stohl, A., and Warren, S. G.: Short-lived pollutants in the arctic: Their climate impact and possible mitigation strategies, Atmos. Chem. Phys., 8, 1723–1735, 2007, http:\/\/www.atmos-chem-phys.net\/8\/1723\/2007\/.","cites":null},{"id":975261,"title":"Soot climate forcing via snow and ice albedos,","authors":[],"date":"2004","doi":null,"raw":"Hansen, J. and Nazarenko, L.: Soot climate forcing via snow and ice albedos, Proc. Natl. Acad. Sci., 101, 423–428, doi:410.1073\/pnas.2237157100, 2004.","cites":null},{"id":977876,"title":"Surface ozone measurements from a global network,","authors":[],"date":"1994","doi":"10.1016\/1352-2310(94)90019-1","raw":"Oltmans, S. J. and Levy, H.: Surface ozone measurements from a global network, Atmos. Env., 28, 9–24, 1994. Park, R. J., Jacob, D. J., Palmer, P. I., Clarke, A. D., Weber, R. J., Zondlo, M. A., Eisele, F. L., Bandy, A. R., Thornton, D. C., Sachse, G.W., andBond, T.C.: Exportefﬁciencyofblackcarbon aerosol in continental outﬂow: Global implications, J. Geophys.","cites":null},{"id":980581,"title":"The effect of harmonized emissions on aerosol properties in global models – an Aerocom experiment,","authors":[],"date":"2007","doi":null,"raw":"A., Iversen, T., Kloster, S., Koch, D., Kirkev˚ ag, A., Kristjansson, J. E., Krol, M., Lauer, A., Lamarque, J. F., Liu, X., Montanaro, V., Myhre, G., Penner, J. E., Pitari, G., Reddy, M. S., Seland, Ø., Stier, P., Takemura, T., and Tie, X.: The effect of harmonized emissions on aerosol properties in global models – an Aerocom experiment, Atmos. Chem. Phys., 7, 4489–4501, 2007, http:\/\/www.atmos-chem-phys.net\/7\/4489\/2007\/.","cites":null},{"id":974530,"title":"The North Atlantic Oscillation controls air pollution transport to the arctic,","authors":[],"date":"2003","doi":null,"raw":"G.: The North Atlantic Oscillation controls air pollution transport to the arctic, Atmos. Chem. Phys., 3, 1769–1778, 2003, http:\/\/www.atmos-chem-phys.net\/3\/1769\/2003\/.","cites":null},{"id":977060,"title":"Uncertainties in global aerosol simulations: Assessment using three meteorological datasets,","authors":[],"date":"2007","doi":"10.1029\/2006JD008216","raw":"Liu, X., Penner, J. E., Das, B., Bergmann, D., Rodriguez, J. M., Strahan, S., Wang, M., and Feng, Y.: Uncertainties in global aerosol simulations: Assessment using three meteorological datasets, J. Geophys. Res., 112, D11212, doi:10.1029\/2006JD008216, 2007.","cites":null},{"id":978403,"title":"Variations and sources of the equivalent black carbon in the high Arctic revealed by long-term observations at Alert and Barrow: 1989–2003,","authors":[],"date":"2006","doi":null,"raw":"Sharma, S., Andrews, E., Barrie, L. A., Ogren, J. A., and Lavou´ e, D.: Variations and sources of the equivalent black carbon in the high Arctic revealed by long-term observations at Alert and Barrow: 1989–2003, J. Geophys. Res., 111, D14208, doi:10.1029\/2005JD006581, 2006.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-09-10","abstract":"We examine the response of Arctic gas and aerosol concentrations to perturbations in pollutant emissions from Europe, East and South Asia, and North America using results from a coordinated model intercomparison. These sensitivities to regional emissions (mixing ratio change per unit emission) vary widely across models and species. Intermodel differences are systematic, however, so that the relative importance of different regions is robust. North America contributes the most to Arctic ozone pollution. For aerosols and CO, European emissions dominate at the Arctic surface but East Asian emissions become progressively more important with altitude, and are dominant in the upper troposphere. Sensitivities show strong seasonality: surface sensitivities typically maximize during boreal winter for European and during spring for East Asian and North American emissions. Mid-tropospheric sensitivities, however, nearly always maximize during spring or summer for all regions. Deposition of black carbon (BC) onto Greenland is most sensitive to North American emissions. North America and Europe each contribute ~40% of total BC deposition to Greenland, with ~20% from East Asia. Elsewhere in the Arctic, both sensitivity and total BC deposition are dominated by European emissions. Model diversity for aerosols is especially large, resulting primarily from differences in aerosol physical and chemical processing (including removal). Comparison of modeled aerosol concentrations with observations indicates problems in the models, and perhaps, interpretation of the measurements. For gas phase pollutants such as CO and O3, which are relatively well-simulated, the processes contributing most to uncertainties depend on the source region and altitude examined. Uncertainties in the Arctic surface CO response to emissions perturbations are dominated by emissions for East Asian sources, while uncertainties in transport, emissions, and oxidation are comparable for European and North American sources. At higher levels, model-to-model variations in transport and oxidation are most important. Differences in photochemistry appear to play the largest role in the intermodel variations in Arctic ozone sensitivity, though transport also contributes substantially in the mid-troposphere","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69207.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/27965\/1\/acp%2D8%2D5353%2D2008.pdf","pdfHashValue":"ac73e2c564fe626433bf1af8ba1450de74696160","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:27965<\/identifier><datestamp>\n      2018-01-24T02:51:33Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4745<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A multi-model assessment of pollution transport to the Arctic.<\/dc:title><dc:creator>\n        Shindell, D. T.<\/dc:creator><dc:creator>\n        Chin, M.<\/dc:creator><dc:creator>\n        Dentener, F.<\/dc:creator><dc:creator>\n        Doherty, R. M.<\/dc:creator><dc:creator>\n        Faluvegi, G.<\/dc:creator><dc:creator>\n        Fiore, A. M.<\/dc:creator><dc:creator>\n        Hess, P.<\/dc:creator><dc:creator>\n        Koch, D. M.<\/dc:creator><dc:creator>\n        MacKenzie, I. A.<\/dc:creator><dc:creator>\n        Sanderson, M. G.<\/dc:creator><dc:creator>\n        Schultz, M. G.<\/dc:creator><dc:creator>\n        Schulz, M.<\/dc:creator><dc:creator>\n        Stevenson, D. S.<\/dc:creator><dc:creator>\n        Teich, H.<\/dc:creator><dc:creator>\n        Textor, C.<\/dc:creator><dc:creator>\n        Wild, Oliver<\/dc:creator><dc:creator>\n        Bergmann, D. J.<\/dc:creator><dc:creator>\n        Bey, I.<\/dc:creator><dc:creator>\n        Bian, H.<\/dc:creator><dc:creator>\n        Cuvelier, C.<\/dc:creator><dc:creator>\n        Duncan, B. N.<\/dc:creator><dc:creator>\n        Folberth, G.<\/dc:creator><dc:creator>\n        Horowitz, L. W.<\/dc:creator><dc:creator>\n        Jonson, J.<\/dc:creator><dc:creator>\n        Kaminski, J. W.<\/dc:creator><dc:creator>\n        Marmer, E.<\/dc:creator><dc:creator>\n        Park, R.<\/dc:creator><dc:creator>\n        Pringle, K. J.<\/dc:creator><dc:creator>\n        Schroeder, S.<\/dc:creator><dc:creator>\n        Szopa, S.<\/dc:creator><dc:creator>\n        Takemura, T.<\/dc:creator><dc:creator>\n        Zeng, G.<\/dc:creator><dc:creator>\n        Keating, T. J.<\/dc:creator><dc:creator>\n        Zuber, A.<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:description>\n        We examine the response of Arctic gas and aerosol concentrations to perturbations in pollutant emissions from Europe, East and South Asia, and North America using results from a coordinated model intercomparison. These sensitivities to regional emissions (mixing ratio change per unit emission) vary widely across models and species. Intermodel differences are systematic, however, so that the relative importance of different regions is robust. North America contributes the most to Arctic ozone pollution. For aerosols and CO, European emissions dominate at the Arctic surface but East Asian emissions become progressively more important with altitude, and are dominant in the upper troposphere. Sensitivities show strong seasonality: surface sensitivities typically maximize during boreal winter for European and during spring for East Asian and North American emissions. Mid-tropospheric sensitivities, however, nearly always maximize during spring or summer for all regions. Deposition of black carbon (BC) onto Greenland is most sensitive to North American emissions. North America and Europe each contribute ~40% of total BC deposition to Greenland, with ~20% from East Asia. Elsewhere in the Arctic, both sensitivity and total BC deposition are dominated by European emissions. Model diversity for aerosols is especially large, resulting primarily from differences in aerosol physical and chemical processing (including removal). Comparison of modeled aerosol concentrations with observations indicates problems in the models, and perhaps, interpretation of the measurements. For gas phase pollutants such as CO and O3, which are relatively well-simulated, the processes contributing most to uncertainties depend on the source region and altitude examined. Uncertainties in the Arctic surface CO response to emissions perturbations are dominated by emissions for East Asian sources, while uncertainties in transport, emissions, and oxidation are comparable for European and North American sources. At higher levels, model-to-model variations in transport and oxidation are most important. Differences in photochemistry appear to play the largest role in the intermodel variations in Arctic ozone sensitivity, though transport also contributes substantially in the mid-troposphere.<\/dc:description><dc:date>\n        2008-09-10<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/27965\/1\/acp%2D8%2D5353%2D2008.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.5194\/acp-8-5353-2008<\/dc:relation><dc:identifier>\n        Shindell, D. T. and Chin, M. and Dentener, F. and Doherty, R. M. and Faluvegi, G. and Fiore, A. M. and Hess, P. and Koch, D. M. and MacKenzie, I. A. and Sanderson, M. G. and Schultz, M. G. and Schulz, M. and Stevenson, D. S. and Teich, H. and Textor, C. and Wild, Oliver and Bergmann, D. J. and Bey, I. and Bian, H. and Cuvelier, C. and Duncan, B. N. and Folberth, G. and Horowitz, L. W. and Jonson, J. and Kaminski, J. W. and Marmer, E. and Park, R. and Pringle, K. J. and Schroeder, S. and Szopa, S. and Takemura, T. and Zeng, G. and Keating, T. J. and Zuber, A. (2008) A multi-model assessment of pollution transport to the Arctic. Atmospheric Chemistry and Physics, 8 (17). pp. 5353-5372. ISSN 1680-7316<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/27965\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.5194\/acp-8-5353-2008","http:\/\/eprints.lancs.ac.uk\/27965\/"],"year":2008,"topics":["GE Environmental Sciences"],"subject":["Journal Article","PeerReviewed"],"fullText":"Atmos. Chem. Phys., 8, 5353–5372, 2008\nwww.atmos-chem-phys.net\/8\/5353\/2008\/\n© Author(s) 2008. This work is distributed under\nthe Creative Commons Attribution 3.0 License.\nAtmospheric\nChemistry\nand Physics\nA multi-model assessment of pollution transport to the Arctic\nD. T. Shindell1, M. Chin2, F. Dentener3, R. M. Doherty4, G. Faluvegi1, A. M. Fiore5, P. Hess6, D. M. Koch1,\nI. A. MacKenzie4, M. G. Sanderson7, M. G. Schultz8, M. Schulz9, D. S. Stevenson4, H. Teich1, C. Textor9, O. Wild10,\nD. J. Bergmann11, I. Bey12, H. Bian13, C. Cuvelier3, B. N. Duncan13, G. Folberth12, L. W. Horowitz5, J. Jonson14,\nJ. W. Kaminski15, E. Marmer3, R. Park16, K. J. Pringle7,*, S. Schroeder8, S. Szopa9, T. Takemura17, G. Zeng18,\nT. J. Keating19, and A. Zuber20\n1NASA Goddard Institute for Space Studies and Columbia University, New York, NY, USA\n2NASA Goddard Space Flight Center, Greenbelt, MD, USA\n3European Commission, Institute for Environment and Sustainability, Joint Research Centre, Ispra, Italy\n4School of GeoSciences, University of Edinburgh, UK\n5NOAA Geophysical Fluid Dynamics Laboratory, Princeton, NJ, USA\n6National Center for Atmospheric Research, Boulder, CO, USA\n7Met Office Hadley Centre, Exeter, UK\n*now at: Max Planck Institute for Chemistry, Mainz, Germany\n8ICG-2, Forschungszentrum-Ju¨lich, Germany\n9Laboratoire des Science du Climat et de l’Environnement, Gif-sur-Yvette, France\n10Department of Environmental Science, Lancaster University, UK\n11Atmospheric Science Division, Lawrence Livermore National Laboratory, CA, USA\n12Laboratoire de Mode´lisation de la Chimie Atmosphe´rique, Ecole Polytechnique Fe´de´rale de Lausanne, Lausanne,\nSwitzerland\n13Goddard Earth Science & Technology Center, U. Maryland Baltimore County, MD, USA\n14Norwegian Meteorological Institute, Oslo, Norway\n15Center for Research in Earth and Space Science, York University, Canada\n16Atmospheric Chemistry Modeling Group, Harvard University, Cambridge, MA, USA and School of Earth and\nEnvironmental Sciences, Seoul National University, Seoul, Korea\n17Research Institute for Applied Mechanics, Kyushu University, Japan\n18National Centre for Atmospheric Science, Department of Chemistry, University of Cambridge, Cambridge, UK\n19Office of Policy Analysis and Review, Environmental Protection Agency, Washington DC, USA\n20Environment Directorate General, European Commission, Brussels, Belgium\nReceived: 28 March 2008 – Published in Atmos. Chem. Phys. Discuss.: 6 May 2008\nRevised: 5 August 2008 – Accepted: 15 August 2008 – Published: 10 September 2008\nAbstract. We examine the response of Arctic gas and aerosol\nconcentrations to perturbations in pollutant emissions from\nEurope, East and South Asia, and North America using re-\nsults from a coordinated model intercomparison. These sen-\nsitivities to regional emissions (mixing ratio change per unit\nemission) vary widely across models and species. Intermodel\ndifferences are systematic, however, so that the relative im-\nportance of different regions is robust. North America con-\ntributes the most to Arctic ozone pollution. For aerosols\nCorrespondence to: D. T. Shindell\n(dshindell@giss.nasa.gov)\nand CO, European emissions dominate at the Arctic surface\nbut East Asian emissions become progressively more im-\nportant with altitude, and are dominant in the upper tropo-\nsphere. Sensitivities show strong seasonality: surface sensi-\ntivities typically maximize during boreal winter for European\nand during spring for East Asian and North American emis-\nsions. Mid-tropospheric sensitivities, however, nearly always\nmaximize during spring or summer for all regions. Deposi-\ntion of black carbon (BC) onto Greenland is most sensitive\nto North American emissions. North America and Europe\neach contribute ∼40% of total BC deposition to Greenland,\nwith ∼20% from East Asia. Elsewhere in the Arctic, both\nsensitivity and total BC deposition are dominated by Euro-\nPublished by Copernicus Publications on behalf of the European Geosciences Union.\n5354 Multi-model assessment of pollution transport to the Arctic: D. T. Shindell et al.\npean emissions. Model diversity for aerosols is especially\nlarge, resulting primarily from differences in aerosol physi-\ncal and chemical processing (including removal). Compari-\nson of modeled aerosol concentrations with observations in-\ndicates problems in the models, and perhaps, interpretation\nof the measurements. For gas phase pollutants such as CO\nand O3, which are relatively well-simulated, the processes\ncontributing most to uncertainties depend on the source re-\ngion and altitude examined. Uncertainties in the Arctic sur-\nface CO response to emissions perturbations are dominated\nby emissions for East Asian sources, while uncertainties in\ntransport, emissions, and oxidation are comparable for Euro-\npean and North American sources. At higher levels, model-\nto-model variations in transport and oxidation are most im-\nportant. Differences in photochemistry appear to play the\nlargest role in the intermodel variations in Arctic ozone sen-\nsitivity, though transport also contributes substantially in the\nmid-troposphere.\n1 Introduction\nTransport of pollution to the Arctic affects both air quality\nand climate change. While levels of pollutants such as tro-\npospheric ozone and aerosols are generally lower in the Arc-\ntic than in industrialized areas, they can have substantial im-\npacts on climate. For example, aerosols can greatly perturb\nthe Arctic radiation balance (Garrett and Zhao, 2006; Lubin\nand Vogelmann, 2006). Though pollutant levels outside the\nArctic may in fact have a larger influence than local pollutant\nlevels on Arctic climate (Shindell, 2007), at least for histor-\nical changes, it is important to understand the sources of the\npollution that reaches the Arctic. This pollution alters local\nradiative fluxes, temperature profiles and cloud properties.\nPollutant levels within the Arctic are especially important\nfor climate in the case of black carbon (BC), which clearly\nhas a strong local climate impact when it is deposited onto\nsnow and ice surfaces, reducing their albedo (Hansen and\nNazarenko, 2004; Jacobson, 2004; Warren and Wiscombe,\n1980; Vogelmann et al., 1988).\nWhile air pollution in most heavily populated areas of the\nworld comes predominantly from local and regional emis-\nsions, pollution in the remote Arctic is primarily a result of\nlong-range transport from source regions outside the Arc-\ntic. Pollution can be transported to the Arctic along a va-\nriety of pathways, with transport at low levels followed by\nuplift or diabatic cooling and tranport at high altitudes fol-\nlowing uplift near the emission source regions seen in a Lan-\ngrangian model (Stohl, 2006). While there is general support\nfor large contributions to Arctic pollution from both Eurasian\nand North American emissions (Xie et al., 1999; Sharma et\nal., 2006), it is crucial to quantify the relative importance of\nemissions from various source regions in determining local\npollutant levels (Stohl, 2006). This will enable us to better\nunderstand the influence of past emission changes, such as\nthe apparent maximum in North American BC emissions in\nthe early 20th century (McConnell et al., 2007), and future\nchanges such as the expected continuing decrease in emis-\nsions from mid\/high latitude developed nations while emis-\nsions from lower latitude developing nations increase. Ad-\nditionally, it will help to inform potential strategies to miti-\ngate Arctic warming via short-lived pollutants (Quinn et al.,\n2007).\nIn this paper, we examine model simulations performed\nwithin the Task Force on Hemispheric Transport of Air Pol-\nlution (HTAP), a project to develop a fuller understanding\nof long-range transport of air pollution in support of the 51-\nnation Convention on Long-Range Transboundary Air Pol-\nlution. Using these simulations, we can analyze transport of\na variety of idealized and actual pollutants to the Arctic in\na large suite of models, allowing us to characterize the rel-\native importance of emissions from different source regions\nas well as uncertainties in current understanding. As it is dif-\nficult to determine the source regions for Arctic pollutants\ndirectly from observations, and there have been some appar-\nent inconsistencies in previous modeling studies (Law and\nStohl, 2007), we believe that examining results from a large\nsuite of models is a useful endeavor.\n2 Description of simulations and analyses\nA series of simulations were designed to explore source-\nreceptor relationships (i.e. the contribution of emissions from\none region, the source, to concentrations or deposition in\na receptor region). The source regions were chosen to en-\ncompass the bulk of Northern Hemisphere emissions: Eu-\nrope (EU: 10 W–50 E, 25 N–65 N, which also includes North\nAfrica), North America (NA: 125 W–60 W, 15 N–55 N), East\nAsia (EA: 95 E–160 E, 15 N–50 N) and South Asia (SA:\n50 E–95 E, 5 N–35 N) (Fig. 1). Northern Asia (Russia) was\nnot included as a source region as its total emissions of most\npollutants are comparatively small (at least for anthropogenic\nsources). However, given their proximity to the Arctic, emis-\nsions from this area can contribute substantially to Arctic\npollution and so we caution that our analyses are not exhaus-\ntive. We define the Arctic poleward of 68 N as our recep-\ntor region. A base case simulation was initially performed\nusing each model’s own present-day emissions. Additional\nsimulations then explored the response to a 20% reduction\nof anthropogenic emissions of nitrogen oxides (NOx) alone,\ncarbon monoxide (CO) alone, or all anthropogenic ozone\nand aerosol precursors except methane from each of the four\nsource regions. Participating models are listed in Table 1. We\nanalyze the response of Arctic concentrations of trace gases\nand aerosols and deposition of BC in both Greenland and\nelsewhere in the Arctic.\nAtmos. Chem. Phys., 8, 5353–5372, 2008 www.atmos-chem-phys.net\/8\/5353\/2008\/\nMulti-model assessment of pollution transport to the Arctic: D. T. Shindell et al. 5355\nTable 1. Models simulations used in the analyses.\nModel Gas-phase Aerosols Prescribed Horizontal\nlifetime Resolution\n1. CAMCHEM NOx, CO SO2, BC Y 1.9\n2. ECHAM5-HAMMOZ SO2, BC 2.8\n3. EMEP NOx, CO SO2 1.0\n4. FRSGC\/UCI NOx, CO Y 2.8\n5. GEOSChem NOx SO2, BC 2.0\n6. GISS-PUCCINI NOx, CO SO2, BC Y 4.0\n7. GMI NOx, CO SO2, BC Y 2.0\n8. GOCART-2 SO2, BC 2.0\n9. LMDz4-INCA SO2, BC 2.5\n10. LLNL-IMPACT NOx, CO SO2, BC 2.0\n11. MOZARTGFDL NOx, CO SO2, BC Y 1.9\n12. MOZECH NOx, CO Y 2.8\n13. SPRINTARS SO2, BC 1.1\n14. STOCHEM-HadGEM1 NOx, CO 3.8\n15. STOCHEM-HadAM3 NOx, CO SO2 Y 5.0\n16. TM5-JRC NOx SO2, BC 1.0\n17. UM-CAM NOx, CO Y 2.5\nThe response to perturbations in emissions of the indicated species\nwere simulated by the models listing those species. Prescribed\nlifetime indicates that an additional simulation with idealized pre-\nscribed lifetime tracers was also performed. Note that a few models\ndid not perform all the regional perturbation experiments. Horizon-\ntal resolution is in degrees latitude.\nAs models used different base case anthropogenic emis-\nsions, the 20% perturbations differed in absolute amounts.\nHence we generally analyze changes in Arctic abundances\nnormalized by the regional emissions change between the\ncontrol and the perturbation using direct emissions (CO, BC)\nor the dominant precursor (sulfur dioxide (SO2) for sulfate\n(SO4), NOx for ozone (O3)). Hereafter we refer to this quan-\ntity, in mixing ratio per Tg emission per season or year, as the\nArctic sensitivity to source region emissions. With the excep-\ntion of non-linearities in the response, this separates out the\neffect of intermodel differences in emissions. Uncertainties\nin emissions are of a different character than the physical un-\ncertainties that we also explore, as the former depend on the\ninventories used to drive models while the latter are intrinsic\nto the models themselves.\nThe response to emissions changes in all four HTAP\nsource regions were analyzed. All these simulations included\na minimum of 6 months integration prior to analysis to allow\nfor stabilization, followed by a year of integration with 2001\nmeteorology (2001 was chosen to facilitate planned compar-\nisons with campaign data for that year). Differences in me-\nteorology were present, however, as models were driven by\ndata from several reanalysis centers, or in some cases mete-\norology was internally-generated based on prescribed 2001\nocean surface conditions. Additionally, some models directly\nprescribed meteorology while others used linear relaxation\ntowards meteorological fields. Note that the North Atlantic\nOscillation index was weakly negative during 2001, while\nthe broader Arctic Oscillation index showed a stronger nega-\ntive value during winter, with weak positive values for most\nArctic\nNorth\nAmerica\nEurope\nEast\nAsia\nSouth\nAsia\nFig. 1. The Arctic and the four source regions (shaded) used in this\nstudy.\nof the remainder of the year. These indicies are reflective\nof the strength of the Northern Hemisphere westerly winds,\nwith weaker winds associated with reduced transport to the\nArctic (Eckhardt et al., 2003; Duncan and Bey, 2004; Sharma\net al., 2006).\nIdealized tracer simulations were also performed to iso-\nlate the effects of intermodel differences in transport from\nother factors affecting trace species distributions. For these\nsimulations, all models used identical emissions of a CO-\nlike tracer with a prescribed globally uniform lifetime of 50\ndays. A second tracer (“soluble CO”) used the same emis-\nsions and lifetime, but was subjected to wet deposition as\napplied to sulfate. Three additional tracers used identical\nanthropogenic volatile organic compound (VOC) emissions\nand had prescribed lifetimes of 5.6, 13 and 64 days. The\nrange of model results in these simulations (other than the\nsoluble tracer) thus reflects only the variation in the trans-\nport algorithms used and in the meteorology used to drive the\ntransport (which differed among models as discussed above).\nEmissions from different source regions were tagged for the\nCO-like and soluble CO tracers (but not for the VOC-like\ntracers). We examine the Arctic concentration of the re-\ngionally tagged tracer divided by the source region emission,\nanalogous to the Arctic sensitivity described above (though\nthese are absolute concentrations in a single run rather than a\ndifference between a control and a perturbation run).\nAll results for the Arctic are based on area-weighted av-\nerages. Results for Greenland are averaged over the entire\nGreenland land area, including the area south of that defined\nhere as Arctic, neglecting model grid boxes near the coast\nthat contain more ocean than land area. Surface values are\nwww.atmos-chem-phys.net\/8\/5353\/2008\/ Atmos. Chem. Phys., 8, 5353–5372, 2008\n5356 Multi-model assessment of pollution transport to the Arctic: D. T. Shindell et al.\nTable 2. Mean (max, min) of total emissions in each region in Tg\/yr\nacross all models in their base run.\nS in SO2 BC CO N in NOx\nEast Asia 17 (21, 16) 1.8 (2.1, 1.5) 156 (220, 128) 7.0 (10.8, 5.2)\nEurope 18 (25, 15) 0.9 (2.1, 0.7) 90 (130, 70) 8.4 (9.7, 7.2)\nNorth America 11 (15, 10) 0.7 (0.9, 0.5) 129 (154, 107) 8.7 (9.4, 7.7)\nSouth Asia 4 (5, 4) 0.9 (1.4, 0.6) 98 (145, 74) 3.3 (4.2, 2.6)\nNOx=NO+NO2\nthose in the lowest model layer. The global mean pressure of\nthis layer varies from 939 to 998 hPa across models (though\ndifferent representations of topography could lead to larger\nvariations at some points), suggesting that for most locations\ndifferences in definition of the surfacew layer will contribute\nonly minimally to intermodel variations. Values at 500 and\n250 hPa levels are interpolated from model output. All sea-\nsons refer to their boreal timing.\n3 Modeled sensitivities, concentrations and deposition\nIn this section, we first consider Arctic sensitivities and con-\ncentrations in the idealized simulations using the passive\ntracer with a prescribed 50 day lifetime for which regional\nemissions were tagged (Sect. 3.1). We then analyze similar\nquantities for both gases and aerosols in the simulations us-\ning realistic chemistry and physics (Sect. 3.2). Finally, we\ninvestigate model results for the deposition of black carbon\nto the Arctic (Sect. 3.3).\n3.1 Prescribed lifetime tracer\nTransport of European emissions to the Arctic surface is\nclearly largest in winter (Fig. 2) based on results for the CO-\nlike 50-day lifetime tracer from 8 models (Table 1). During\nall seasons, the Arctic surface level is most sensitive to Eu-\nropean emissions (Fig. 2). In the middle troposphere, the\nsensitivities to emissions from Europe and North America\nare usually comparable, sensitivities to East Asian emissions\nare somewhat less, and sensitivities to South Asian emissions\nare quite small outside of summer (probably because of the\ngreater distance to the Arctic from this region, Fig. 1). These\nresults are consistent with the “polar dome” or “polar front”\nthat impedes low-level transport from relatively warm and\nhumid areas such as North America and East Asia into the\nArctic during the cold months while allowing such transport\nat higher altitudes from those regions and at low-levels from\nEurasia, which often lies within the polar dome (Law and\nStohl, 2007; Klonecki et al., 2003; Stohl, 2006). During\nsummer, when the polar front is at its furthest north, emis-\nsions from all four source regions have a comparable influ-\nence on the Arctic surface (per unit emission), with a slightly\nlarger contribution from Europe.\nIn the upper troposphere, the models tend to show compa-\nrable sensitivities for all four regions. The spread of model\nresults is typically similar to that seen at lower levels. Sensi-\ntivities in the upper troposphere are greatest in summer for all\nregions, consistent with the surface for Asian emissions but\nopposite to the surface seasonality seen for European emis-\nsions. The largest sensitivities in the upper troposphere are\nto summertime Asian emissions.\n3.2 Active gas and aerosol species\nWe now investigate the more realistic, but more complex, full\ngas and aerosol chemistry simulations. We sample only the\nmodels that performed the perturbation runs for a particular\nspecies (Table 1). The divergence in model results in the con-\ntrol run is extremely large in the Arctic. For example, annual\nmean CO varies by roughly a factor of 2–3 at all levels ex-\namined. Arctic sulfate varies across models by factors of 8\nat the surface, 600 in the mid-troposphere, and 3000 in the\nupper troposphere. Though some models clearly must have\nunrealistic simulations, we purposefully do not exclude any\nmodels at this stage as our analysis attempts to identify the\nsources of this enormous divergence among models. We note\nthat the diversity of model results in the Arctic is not terribly\ndifferent from that seen elsewhere. Examining annual means\nusing equally sized areas over the US and the tropical Pa-\ncific, polluted and remote regions, respectively, we find CO\nvariations of roughly a factor of 2 across models, and stan-\ndard deviations at various altitudes are 14–22% of the mean\nin those regions, only slightly less than the 22–29% in the\nArctic. For sulfate, the range and standard deviation across\nmodels are smaller at the surface for the US, where they are\na factor of 6 and 36% (versus Arctic values of a factor of 8\nand 52%), but greater for the remote Pacific, where they are\na factor of 40 and 62%. At higher levels, the range is only\nslightly less than that seen in the Arctic, and standard devi-\nations are 86–124% of the mean in the other regions, also\nsimilar to the 98–99% seen in the Arctic.\nWe first examine the total contribution from each source\nregion to the annual average gas or aerosol amount in the\nArctic. This includes the influence of variations in emission\ninventories among the models (Table 2). These variations\nare quite large, often as great as a factor of two between min-\nimum and maximum. The range of SO2 and BC emissions\nused in the models is especially large for Europe compared to\nother regions, probably because of rapid changes with time\nand the many estimates that have been made for European\nemissions. For the multimodel mean, we find that at the\nsurface, European emissions dominate the Arctic abundance\nof sulfate and BC, and to a lesser extent CO (Table 3 and\nFig. 3). Arctic surface ozone responds most strongly to NOx\nemissions from North America, with substantial responses to\nemissions from Europe and East Asia as well. In the mid-\ntroposphere, sulfate abundances are again dominated by Eu-\nropean emissions, but the contribution from East Asia is al-\nAtmos. Chem. Phys., 8, 5353–5372, 2008 www.atmos-chem-phys.net\/8\/5353\/2008\/\nMulti-model assessment of pollution transport to the Arctic: D. T. Shindell et al. 5357\n   \npp\nbv\n\/T\ng \npe\nr s\nea\nso\nn\nDJF MAM JJA SON\nSurface 500 hPa 250 hPa\nDJF MAM JJA SON DJF MAM JJA SON\n0\n.2\n.4\n.6\n.8\n0\n.1\n.2\n.3\n.4\n0\n.1\n.2\n.25\n.15\n.05\nEast Asia\nEurope\nNorth America\nSouth Asia\nFig. 2. Arctic sensitivity at three levels for the seasonal average CO-like tracer in terms of mixing ratio per unit emission from the given\nsource region in the prescribed 50-day lifetime tracer simulations (8 models). Boxes show the central 50% of results with the median\nindicated by the horizontal line within the box, while the bars indicate the full range of model sensitivities.\nTable 3. Annual average Arctic absolute mixing ratio decreases due to 20% reductions in anthropogenic emissions in each region.\nEA EU NA SA\nSurface\nSulfate (pptm) 2.16±1.92 (13%)1.87 (13%) 12.4±9.8 (73%) 10.0 (71%) 2.27±1.97 (13%) 2.03 (15%) 0.20±0.23 (1%) 0.09 (1%)\nBC (pptm) 0.18±0.22 (17%) 0.10 (16%) 0.77±0.75 (72%) 0.47 (74%) 0.11±0.11 (10%) 0.05 (8%) 0.01±0.02 (1%) 0.01 (2%)\nCO (ppbv) 2.23±1.07 (26%) 1.8 (24%) 3.35±1.12 (39%) 2.84 (37%) 2.42±0.75 (29%) 2.42 (32%) 0.51±0.15 (6%) 0.51 (7%)\nOzone (ppbv) 0.12±0.04 (27%) 0.11 (24%) 0.11±0.07 (24%) 0.13 (28%) 0.19±0.07 (42%) 0.20 (43%) 0.02±0.01 (7%) 0.02 (4%)\n500 hPa\nSulfate (pptm) 11.4±10.4 (25%) 10.6 (25%) 23.3±20.3 (51%) 22.9 (53%) 9.83±9.09 (21%) 9.16 (21%) 1.32±1.78 (3%) 0.53 (1%)\nBC (pptm) 0.91±0.95 (38%) 0.75 (43%) 0.97±0.99 (41%) 0.68 (39%) 0.41±0.41 (17%) 0.26 (15%) 0.10±0.13 (4%) 0.05 (3%)\nCO (ppbv) 2.38±1.01 (31%) 1.88 (26%) 2.20±0.54 (28%) 2.11 (30%) 2.52±0.71 (33%) 2.43 (34%) 0.61±0.17 (8%) 0.68 (10%)\nOzone (ppbv) 0.26±0.09 (23%) 0.24 (22%) 0.35±0.11 (31%) 0.39 (36%) 0.44±0.15 (40%) 0.40 (37%) 0.07±0.05 (6%) 0.05 (5%)\n250 hPa\nSulfate (pptm) 17.4±16.4 (36%) 15.6 (41%) 14.6±14.1 (30%) 11.8 (31%) 11.3±11.6 (24%) 7.93 (21%) 4.68±5.38 (10%) 2.42 (7%)\nBC (pptm) 1.16±1.08 (48%) 0.75 (47%) 0.45±0.40 (18%) 0.34 (21%) 0.36±0.33 (15%) 0.23 (15%) 0.47±0.50 (19%) 0.27 (17%)\nCO (ppbv) 1.35±0.48 (36%) 1.28 (35%) 0.77±0.21 (20%) 0.70 (19%) 1.11±0.28 (29%) 1.14 (31%) 0.58±0.23 (16%) 0.57 (15%)\nOzone (ppbv) 0.22±0.01 (25%) 0.21 (25%) 0.22±0.17 (25%) 0.18 (22%) 0.35±0.19 (39%) 0.35 (42%) 0.10±0.07 (11%) 0.09 (11%)\nFor each species, values are multi-model means and standard deviations, followed by medians. The percentage of the total from these four\nsource regions for each individual region is given in parentheses for both mean and median values. Ozone and sulfate changes are in response\nto NOx and SO2 emissions changes, respectively.\nmost as large as that from Europe for BC. By the upper tro-\nposphere, both total sulfate and BC show the largest impact\nfrom East Asian emissions, especially for BC (Fig. 3). The\namount of CO from each region also undergoes a shift with\naltitude, as European emissions become steadily less impor-\ntant relative to East Asian and North American emissions.\nThe relative importance of regional NOx emission changes to\nArctic ozone is less dependent upon altitude, with the largest\ncontribution from North America at all levels. The results\nare consistent looking at either the multi-model mean or me-\ndian values. These are generally quite similar for CO and\nozone, while the median is typically lower than the mean for\nthe aerosols, but the relative importance of different regions\nis almost unchanged between these two statistics (Table 3).\nWe next turn to Arctic sensitivities (Arctic concentration\nchange per unit source region emission change, hence re-\nmoving the influence of emission inventory variations across\nmodels) rather than total Arctic concentrations, first examin-\ning seasonal sensitivities for CO, SO4, and BC (Fig. 4). The\nmedian Arctic surface sensitivities for all three species are\ngreatest for European emissions, by roughly a factor of ∼3–\n6 compared with the sensitivities to emissions from other re-\ngions. Median sensitivities in the mid-troposphere are again\nlargest for European emissions in nearly all cases, by a few\npercent to a factor of two. In the upper troposphere, me-\ndian sensitivities are comparable for East Asian, European\nand North American emissions. In many cases, sensitivities\nto South Asian emissions are substantially less than those for\nother regions. This is not the case for aerosols during winter\nand spring though, when sensitivities to South Asian emis-\nsions are large and sometimes greater than those for any other\nregion. However, the range of sensitivities among models is\nquite large, especially for the aerosols.\nwww.atmos-chem-phys.net\/8\/5353\/2008\/ Atmos. Chem. Phys., 8, 5353–5372, 2008\n5358 Multi-model assessment of pollution transport to the Arctic: D. T. Shindell et al.\nBC Sulfate\nCO Ozone\nSurface\n250 hPa\nFig. 3. Relative importance of different regions to annual mean Arctic concentration at the surface and in the upper troposphere (250 hPa)\nfor the indicated species. Values are calculated from simulations of the response to 20% reduction in anthropogenic emissions of precursors\nfrom each region (using NOx for ozone). Arrow width is proportional to the multimodel mean percentage contribution from each region to\nthe total from these four source regions (as in Table 3).\nExamining the CO sensitivity to the emissions with the\ngreatest impact (EU, NA and EA), the range of annual aver-\nage values is roughly a factor of 2–3 among the 11 models.\nThe standard deviation is much smaller (∼20–30%), indi-\ncating that most models are relatively consistent. The sea-\nsonality of the Arctic CO sensitivity depends on the source\nregion. At the surface, the multimodel mean sensitivity to\nEuropean emissions clearly maximizes in winter, while for\nNorth American and especially East Asian emissions the\nmaximum sensitivity is in spring. These two regions also\ndiffer in their seasonality, however, with the minimum sen-\nsitivity in fall for East Asian emissions but in summer for\nNorth American emissions.\nFor surface sulfate, Arctic sensitivities in individual mod-\nels vary greatly. For the annual average, the range spans 2.8\nto 17.4 pptm\/(Tg S)\/season. (Note that the annual average\nvalues are in units of pptm\/Tg\/season for comparison with\nseasonal sensitivities. Values in pptm\/Tg\/year are 1\/4 of these\nseason numbers).\nInterestingly, the models separate into two groups: of\nthe 13 models, 6 have annual average sensitivities below\n4 pptm\/(Tg S)\/season, while the other 7 have sensitivities of\n7.2–17.4 pptm\/(Tg S)\/season. Seasonal surface sensitivities\nshow an even larger spread (Fig. 4). Median sensitivities to\nEuropean emissions are comparable in all seasons though the\nspread in the central 50% of models is greatest in winter and\nspring. Sulfate sensitivities to East Asian and North Amer-\nican emissions maximize in spring, as for CO. In the mid-\ntroposphere, sensitivities are generally largest for European\nemissions, while in the upper troposphere they are greatest\nfor South Asian emissions in spring and East Asian emis-\nsions during other seasons.\nBC sensitivities show spring maxima for surface responses\nto East Asian and North American emissions, as for sul-\nfate and CO. For European emissions, however, BC sensi-\ntivity shows a strong winter maximum and a fall sensitiv-\nity that is also enhanced over the spring and summer val-\nues. The mean winter sensitivity to European emissions of\n30 pptm\/(Tg C)\/season is much larger than the sensitivities\nAtmos. Chem. Phys., 8, 5353–5372, 2008 www.atmos-chem-phys.net\/8\/5353\/2008\/\nMulti-model assessment of pollution transport to the Arctic: D. T. Shindell et al. 5359\npp\nbv\n\/T\ng\/\nse\nas\non\nSurface CO 500 hPa CO 250 hPa CO\nSurface BC 500 hPa BC 250 hPa BC\npp\ntm\n\/T\ng\/\nse\nas\non\nSurface SO4 500 hPa SO4 250 hPa SO4\npp\nbv\n\/T\ng\/\nse\nas\non\nSurface O3\/NOx 500 hPa O3\/NOx 250 hPa O3\/NOx\n.05\n.10\n.15\n.20\n.25\n.30\n.35\n.2\n.4\n.6\n.8\n1.\n0\n0.5\n1.0\n1.6\n2.0\nDJF MAM JJA SON\n0\n10\n20\n30\n40\n50\n60\n0\n20\n40\n60\n0\n5\n10\n15\n20\n25\n0.5\n1.0\n1.5\n2.0\n2.5\n0.0\n0.5\n1.0\n1.5\n2.0\n-0.5\n0.0\n0.5\n1.0\nDJF MAM JJA SON DJF MAM JJA SON\nDJF MAM JJA SON DJF MAM JJA SON DJF MAM JJA SON\nDJF MAM JJA SON DJF MAM JJA SON DJF MAM JJA SON\nDJF MAM JJA SON DJF MAM JJA SON DJF MAM JJA SON\nEast Asia\nEurope\nNorth America\nSouth Asia\n0\n20\n40\n60\n80\n0\n20\n40\n60\npp\ntm\n\/T\ng\/\nse\nas\non\n0\n20\n40\n60\n80\n100\nFig. 4. Arctic sensitivity to emissions from the given region for seasonal averages of CO, sulfate, BC and ozone mixing ratios at the indicated\nheights. Sensitivities are the difference between the simulation perturbing a given emission and the control, normalized by the emissions\nchange in the species (CO, BC) or its primary precursor (S in SO2 for SO4, N in NOx for O3) in the indicated source region. Symbols as in\nFig. 2. Note change in vertical scale between columns.\nto European emissions during the other seasons (means of\n9–17 pptm\/(Tg C)\/season). The enhanced winter sensitivity\nresults from both faster transport during winter and slower\nremoval at this time as the Arctic is stable and dry (Law\nand Stohl, 2007). During spring, summer and fall, the mid-\ntroposphere, like the surface, is most sensitive to European\nBC emissions. During winter, however, sensitivity to North\nAmerican and European emissions is almost identical. Inter-\nestingly, the seasonality of sensitivity can vary with altitude:\nthe sensitivity of surface BC to European emissions is great-\nest in winter, while the sensitivity of mid-tropospheric BC to\nEuropean emissions maximizes in summer (sulfate sensitivi-\nties show fairly similar behavior). The sensitivity to North\nAmerican and East Asian emissions maximizes in spring.\nSensitivities in the upper troposphere maximize in summer\nfor East Asia, Europe and North America. Though the mul-\ntimodel mean surface and mid-tropospheric sensitivities are\nclearly greatest for European emissions, the annual average\nBC sensitivity to European emissions varies greatly among\nmodels: from 0.6 to 12.8 pptm\/(Tg C)\/year for the surface\nand from 0.1 to 14.9 pptm\/(Tg C)\/year at 500 hPa.\nwww.atmos-chem-phys.net\/8\/5353\/2008\/ Atmos. Chem. Phys., 8, 5353–5372, 2008\n5360 Multi-model assessment of pollution transport to the Arctic: D. T. Shindell et al.\nGreenlandArctic \n(except\nGreenland)\nDJF MAM JJA SON\nEast Asia\nEurope\nNorth America\nSouth Asia\nDJF MAM JJA SON\nm\n-\n2  \nx \n10\n-\n17\nm\n-\n2  \nx \n10\n-\n17\n0\n50\n100\n150\n0\n20\n40\n60\n80\n100\n120\nFig. 5. Sensitivity of Arctic-wide (left, excluding Greenland) and Greenland (right) BC deposition to regional emissions (Tg deposition per\nTg emission per unit area per season). Values are calculated from the 20% anthropogenic emissions perturbation simulations.\nThe sensitivity of Arctic surface ozone to source region\nNOx emissions is quite different than that for the other\nspecies examined here (Fig. 4). Note that MOZECH and\nUM-CAM were excluded from the O3\/NOx analysis due to\nimbalances in their nitrogen budget diagnostics. Sensitivity\nto winter European emissions is negative for most models\n(i.e. reduced NOx emissions leads to more Arctic ozone).\nThis results from direct reaction of NOx with ozone in the\nrelatively dark conditions that much of the high-latitude Eu-\nropean emissions encounter. The cancellation of negative\nwinter and positive non-winter ozone sensitivities leads to\na lower annual average European influence on Arctic sur-\nface ozone than for other species (Table 3). Spring surface\nozone concentrations show comparable sensitivities to East\nAsian, European and North American emissions, while sum-\nmer concentrations are most sensitive to European and fall\nto European and North American emissions. During winter,\nsensitivities to South Asian emissions are nearly as large as\nthose for East Asian and North American emissions. Sensi-\ntivities in the mid-troposphere show a similar pattern to those\nseen at the surface (Fig. 4). The upper troposphere shows\ncomparable sensitivities for all four of the source regions,\nwith greatest sensitivity to South Asian emissions in win-\nter and spring, though North American emissions have the\nlargest annual average influence (Fig. 3).\nThe magnitude of the sensitivity increases with altitude for\nSO4 and O3, stays roughly constant for BC, and decreases for\nCO. This may reflect the greater removal of soluble aerosols\nand ozone precursors at low levels relative to insoluble CO.\nIn addition, both SO4 and O3 are produced photochemically\nat higher altitudes, while CO is photochemically removed\naloft.\nA critical result of the analysis is that for both sensitivities\nand totals, discrepancies between models are systematic, so\nthat the relative importance of different regions is robust de-\nspite the large differences among models in the magnitude of\nthe contribution from a particular region. For example, ev-\nery participating model finds the largest total contribution to\nannual average surface SO4, BC, and CO to be from Europe.\nSimilarly, all models find that in the upper troposphere, East\nAsia is the largest annually-averaged source for BC, with all\nbut 3 giving first rank to East Asia for sulfate and CO as well.\nLooking at annual totals, 9 out of 11 models have a larger\ncontribution to 500 hPa Arctic ozone from North America\nthan from Europe even though the standard deviations over-\nlap substantially (Table 3). Every model finds that the Arctic\nsensitivity during winter, fall and spring for surface SO4, BC\nand CO is largest for European emissions. This holds even\nduring summer for sulfate and BC, while for CO all but 1\nmodel have the greatest sensitivity to European emissions.\n3.3 Arctic deposition of black carbon\nIn addition to atmospheric concentrations, deposition of BC\nto the Arctic is of particular interest due to its climate im-\npact, as discussed previously. We now explore the relative\nimportance of the various source regions to BC deposition to\nGreenland and to the rest of the Arctic, and use the multi-\nmodel results to characterize the robustness of these results.\nWe examine both the total BC deposited and also the BC de-\nposition sensitivity by calculating the Tg deposited per unit\narea per Tg source region emission. Deposition is calculated\non all surfaces, including open ocean, though albedo will be\naffected by the flux to snow and ice surfaces.\nDeposition of BC to the Arctic (excluding Greenland) is\nmost sensitive to emissions from Europe in every season\n(Fig. 5), and is generally quite similar to the BC surface mix-\ning ratio sensitivity (Sect. 3.2). That sensitivity to European\nemissions is greatest is clear even though the spread in model\nsensitivities is very large, a factor of 3 to 5 for European\nemissions, for example. The large range often results from\njust one or two models. For example, the deposition sensi-\ntivities for the Arctic (except Greenland) during summer for\nEuropean emissions are within 39 to 66 m−2 10−17 in 9 mod-\nels, while the remaining model has a value of 154 m−2 10−17\n(ECHAM5-HAMMOZ is excluded from the BC deposition\nanalyses owing to apparent problems in their deposition di-\nAtmos. Chem. Phys., 8, 5353–5372, 2008 www.atmos-chem-phys.net\/8\/5353\/2008\/\nMulti-model assessment of pollution transport to the Arctic: D. T. Shindell et al. 5361\nGreenlandArctic\n(except\nGreen-\nland)\nDJF MAM JJA SON\nEast Asia\nEurope\nNorth America\nSouth Asia\nDJF MAM JJA SON\n0\n2\n4\n6\n8\n10\n12\n14\nTg\n m\n-\n2  \nx \n10\n-\n17\n0\n1\n2\n3\n4\n5\n6\nTg\n m\n-\n2  \nx \n10\n-\n17\nFig. 6. Total Arctic-wide (left, excluding Greenland) and Greenland (right) BC deposition (Tg deposition per unit area per season) in response\nto 20% anthropogenic emission change from each source region.\nagnostics). However, even the range within the central 50%\nof models is substantial in other seasons (Fig. 5). Median\nsensitivities are largest in fall and winter for European emis-\nsions, but in spring, summer and fall for North American\nemissions and in spring for East Asian emissions. Examin-\ning the BC deposited per unit BC emitted (i.e. multiplying\nthe values in Fig. 5 by area), the multi-model mean percent-\nage of emissions that are deposited in the entire Arctic (in-\ncluding Greenland) is 0.02% for South Asian, 0.10% for East\nAsian, 0.19% for North American and 0.70% for European\nemissions.\nDeposition of BC to Greenland shows different sensitivi-\nties compared with the rest of the Arctic, with the largest re-\nsponse to North American emissions in non-winter seasons\n(Fig. 5). This results from the high topography of Green-\nland, which allows the inflow of air from the relatively warm\nand moist North American, and to a lesser extent East Asian,\nsource areas to occur more easily there than in the rest of the\nArctic (Stohl, 2006).\nExamining the total BC deposition response to 20% re-\ngional emissions changes, we find similar results for the\nArctic excluding Greenland as for the sensitivity (compare\nFigs. 5 and 6). Most significantly, total deposition is greatest\nfrom Europe in every season. Again the spread of results is\nlarge, but the central 50% of models are distinctly separated\nfor Europe from other regions in all seasons but spring. In\nthat season, East Asian emissions take on greater importance\nas they are large and the sensitivity to East Asian emissions\nmaximizes in spring (Fig. 5). For the annual average, total\ndeposition to the Arctic outside of Greenland is clearly dom-\ninated by European emissions (Table 4). We reiterate that\nemissions from Northern Asia (Russia) were not studied in\nthese analyses.\nThe change in total deposition to Greenland in response\nto 20% regional emissions changes is roughly evenly split\nbetween the impact of European and North American emis-\nsions (Fig. 6). Deposition of BC from East Asia is as large\nor nearly as large as that from these regions in spring and\nTable 4. Annual average BC deposition to Greenland and Arctic\nexcluding Greenland (Tg\/m2×10−17) due to 20% of anthropogenic\nemissions from each region.\nEA EU NA SA\nGreenland\nAll models 0.5±0.3 0.9±0.8 1.0±0.8 0.06±0.04\nExcluding largest 0.4±0.3 0.6±0.3 0.8±0.6 0.05±0.02\nExcluding smallest 0.5±0.3 0.9±0.8 1.1±0.9 0.07±0.03\nArctic (excluding Greenland)\nAll models 0.9±0.5 3.3±2.8 0.5±0.4 0.07±0.05\nExcluding largest 0.8±0.5 2.5±1.2 0.5±0.3 0.06±0.03\nExcluding smallest 0.9±0.5 3.6±2.8 0.6±0.4 0.08±0.05\nValues are multi-model means and standard deviations.\nsummer, though not in other seasons or in the annual aver-\nage. The spread of results for total deposition to Greenland\nis substantially larger for totals than for sensitivities for East\nAsia and Europe, reflecting the large variation between mod-\nels in emissions from or within these regions. Looking at the\nannual average total deposition to Greenland, it appears at\nfirst that the uncertainties are too large to allow determina-\ntion of the relative importance of emissions from the various\nsource regions (Table 4). However, the distribution of results\nis neither normally distributed nor random. To test the im-\npact of “outlier” models, we calculated deposition statistics\nleaving out the models with the lowest and highest deposi-\ntion rates (Table 4). The model with the largest deposition\noften contributes a large fraction of the standard deviation.\nThe lowest does not, however, as the distribution of results is\nhighly skewed towards values considerably above the mean.\nTo test for systematic effects across regions, we also exam-\nined the relative importance of each region across models.\nWhile one standard deviation of the deposition values for a\ngiven region nearly always encompasses the values for the\nother regions, in fact the model-to-model differences are sys-\ntematic. All 10 models have the identical order: greatest de-\nposition to Greenland from North American emissions, fol-\nlowed by European, East Asian and lastly South Asian emis-\nwww.atmos-chem-phys.net\/8\/5353\/2008\/ Atmos. Chem. Phys., 8, 5353–5372, 2008\n5362 Multi-model assessment of pollution transport to the Arctic: D. T. Shindell et al.\nAlert (83 N, 63 W)\nJ F M A M J J A S  O  N  D\nRMS < 40 ppbv:\n1-CAMCHEM\n3-EMEP\n4-FRSGC\/UCI\n6-GISS-PUCCINI\n7-GMI\n11-MOZARTGFDL\n12-MOZECH\n14-STOCHEM-HadGEM1\n17-UM-CAM\nRMS >=50 ppbv\n10-LLNL-IMPACT\n15-STOCHEM-HadAM3\nBarrow (71 N, 157 W)\nJ F M A M J J A S  O  N  D\n0\n50\n100\n150\n200\nCO\n (p\npb\nv)\nSummit (73 N, 39 W)\nJ F M A M J J A S  O  N  D\nBarrow (71 N, 157 W)\nJ F M A M J J A S  O  N  D0\n10\n20\n30\n40\n50\n60\nO\nzo\nne\n (p\npb\nv)\nSpitsbergen (79 N, 12 E )\nJ F M A M J J A S O N D0\n200\n400\n600\n800\n11\n8\n8\n15\n1\nRMS < 190 pptm\n5-GEOSCHEM\n6-GISS-PUCCINI\n7-GMI\n8-GOCART-2\n10-LLNL-IMPACT\nRMS >= 250 pptm\n1-CAMCHEM\n2-ECHAM5-HAMMOZ\n3-EMEP\n9-LMDz4-INCA\n11-MOZART-GFDL\n13-SPRINTARS\n15-STOCHEM-HadAM3\n16-TM5-JRCJ F M A M J J A S O N D\n0\n200\n400\n600\n800\nSu\nlfa\nte\n (p\nptm\n)\nAlert (83 N, 63 W)\nJ F M A M J J A S  O  N  D\n0\n20\n40\n60\n80\n100\nBarrow (71 N, 157 W)\nJ F M A M J J A S  O N  D\n0\n20\n40\n60\n80\nBC\n (p\nptm\n)\n2\n0\n50\n100\n150\n200\n2, 13, 16\n5\n8\n11\n6\n10\n15\n3\n3\n10\n15\n6\n4\n7\n11\n1\n14\n15\n16\n47\n14\n0\n10\n20\n30\n40\n50\n60\nAlert (83N, 63W)\n10\n6\n8\n1 15\n66\n8 \n6\n8 \n6\nFig. 7. Observed and modeled seasonal cycles of trace species surface concentrations at the indicated Arctic sites. Model results in all panels\nare in grey. Plots for CO (top row) and ozone (second row) show observations from the NOAA Global Monitoring Division, with 1992-\n2006 means and standard deviations in red (except for Summit O3, which is 2000–2006) and 2001 in blue. Sulfate plots (third row) show\nobservations from Alert during 1980-1995 (left) and from the EMEP site in Spitsbergen during 1999-2005 in red, with 2001 Spitsbergen\ndata in blue. BC data (bottom row) are from the IMPROVE site at Barrow during 1996-1998 (red), and from Sharma et al. (2006) for both\nBarrow and Alert using equivalent BC over 1989-2003 (purple). Models are listed by RMS error scores to the right of each row using the\ngroupings discussed in the text. Models that are separated from others are labeled with the numbers as in the text at right (or Table 1).\nsions. Deposition to the Arctic (exclusive of Greenland) is\nsimilarly skewed (Table 4) and robust in the regional rank-\nings across models. Hence as for atmospheric mixing ratios\nand concentration sensitivities (Sect. 3.2), the relative contri-\nbution of emissions from the various source regions to BC\ndeposition can be determined with much higher confidence\nthan the magnitude for any particular region.\n4 Comparison with Arctic observations\nObservational datasets are quite limited in the Arctic, mak-\ning it challenging to reliably evaluate models in this region.\nNevertheless, it is worth investigating how well the models\nperform and how our results are influenced by any models\nwhich appear to be clearly unrealistic in their Arctic simula-\ntions. In this section, we compare the modeled and measured\nseasonal cycles of surface CO, ozone, sulfate and BC for se-\nlected stations in the Arctic. Root-mean-square (RMS) errors\nbetween the monthly mean modeled and observed values are\nused to evaluate the models, though this is clearly only one\npossible measure of model\/observation agreement. We then\nevaluate the influence of screening out less realistic models\nin Sect. 5.\nThe models exhibit a large spread for CO at Barrow and\nAlert (Fig. 7), though most have a fairly reasonable seasonal\ncycle based on comparisons with observations (Novelli et al.,\n1998). Many of the models do a good job of reproducing\nsummer and fall CO amounts, but nearly all underestimate\nthe late winter-early spring maximum (as in previous stud-\nies, e.g. Shindell et al., 2006). All models have average RMS\nAtmos. Chem. Phys., 8, 5353–5372, 2008 www.atmos-chem-phys.net\/8\/5353\/2008\/\nMulti-model assessment of pollution transport to the Arctic: D. T. Shindell et al. 5363\nerrors for the two sites of between 17 and 40 ppbv, with the\nexception of two that have RMS values of 54 and 83 ppbv.\nWe note that no model stands out as substantially better than\nthe others (the model with the second lowest RMS error has\na value only 3 ppbv greater than the lowest score). While the\nEMEP model stands out from the others with clearly larger\nvalues during fall (Fig. 7), it is not obviously better or worse\nin comparison with observations over the full annual cycle.\nNote also that none of the outlying models (those labeled in\nFig. 7) has CO emissions distinctly different from the other\nmodels. For example, the two models with greatest RMS\nerrors have global CO emissions of 1115 Tg\/yr and Euro-\npean emissions of 74 and 111 Tg\/yr, both well within the\nrange across all models of 1018–1225 Tg\/yr for global and\n70-130 Tg\/yr for European emissions. Hence excluding the\ntwo models with highest RMS error provides a reasonable\nsubset for repeating the CO analyses.\nComparison of ozone observations (based on updates from\nOltmans and Levy, 1994) with the models shows that the sim-\nulations again have a fairly wide spread. Modeled values\nare generally reasonable during summer and fall at Barrow,\nthough some models have underestimates, but agreement is\npoor during winter and spring. Nearly all models underpre-\ndict ozone at Summit. Those that overestimate ozone at Bar-\nrow during spring often do a better job at Summit, as they\nfail to capture the large observed springtime contrast between\nthese two sites. This leads to comparable error scores to other\nmodels. All models have average RMS errors of 7–12 ppbv\nexcept for STOCHEM-HadGEM1 with a value of 21 ppbv.\nWe find that exclusion of a single model, however, does not\nappreciably change the results presented previously.\nFor sulfate observations, we use data from the EMEP\nnetwork’s station on Spitsbergen (Hjellbrekke and Fjæraa,\n2007) and data from Alert (Sirois and Barrie, 1999), though\nthe Alert data covers earlier years. The sea-salt compo-\nnent has been removed from these data. The models gen-\nerally perform poorly in simulating Arctic sulfate (Fig. 7).\nMost substantially underestimate Arctic concentrations, by\nmore than an order of magnitude in several models. Many\nthat show annual mean sulfate concentrations of about the\nright magnitude have seasonal cycles that peak in summer or\nfall, while the observations show a spring maximum. This\nleads to RMS error values that are fairly large for all mod-\nels, with multi-model means of 201 (Alert) and 272 (Spits-\nbergen) pptm. However, models cluster in two groups, with\nnone having average values for the two sites between 190 and\n250. Hence we can test if the subset of models with RMS\nvalues below 190 pptm yields a different result than the full\nsuite of models.\nNote that comparison with measurements taken from\n1996–1999 at Denali National Park (from the Interagency\nMonitoring of Protected Visual Environments: IMPROVE,\nhttp:\/\/vista.cira.colostate.edu\/improve) at 64◦ N (just outside\nthe Arctic region we use here) show similar discrepancies\nbetween models and observations. The multi-model mean\nRMS error at Denali is 249 pptm. Hence although the com-\nparison at Alert may be influenced by differing emissions\nduring the 1980s, the overall results suggest that discrepan-\ncies between models and observations occur throughout the\nhigh latitudes. As for CO, there is no clear relationship be-\ntween the emissions used by the models and their Arctic sim-\nulations. For example, SO2 emissions from Europe, which\nhave the largest influence on the Arctic, are 15–20 Tg S\/yr\n(mean 18 Tg S\/yr) in the group of models with lower RMS\nvalues, and 8–25 Tg S\/yr (mean 16 Tg S\/yr) in the high RMS\ngroup, of which half the models have emissions within the\nrange seen in the lower RMS group. Given that models also\nshow large diversities over the US, where emissions are more\nconsistent, and since the model-to-model sulfate concentra-\ntions vary much more than the model-to-model emissions,\nwe believe the cause of the model\/measurement discrepan-\ncies is largely different representations of aerosol chemical\nand physical processing and removal rather than emissions\n(see Sect. 5.2).\nWe also attempted to evaluate the simulation of BC in\nthe models. Comparison with observations from Sharma et\nal. (2006) suggests that models greatly underpredict BC in\nthe Arctic (Fig. 7). However, the available measurements\nare in fact equivalent BC (EBC), which is obtained by con-\nverting light absorbed by particles accumulated on a filter\nin a ground-based instrument to BC concentrations. Uncer-\ntainties in the optical properties of BC make this conversion\nquite challenging. Additionally, other light absorbing species\nsuch as OC and especially dust influence the measurements,\nso the EBC would tend to be high relative to actual BC. This\nis consistent with the sign of the model\/observations differ-\nence (Fig. 7), though the other species are expected to have\nfairly small contributions in the Arctic, and hence a substan-\ntial underestimate of BC in the models is likely. Models\nalso appear to substantially underestimate BC in comparison\nwith IMPROVE data from Barrow (updated from Bodhaine,\n1995), which itself differs significantly from the Sharma et\nal. (2006) data. The Barrow data is also derived from opti-\ncal absorption measurements. Given the large apparent dis-\ncrepancies for BC for all models, we conclude that it is not\nfeasible to determine the relative realism of the models using\ncurrently available data, though it appears that models with\na greater transport of BC to the Arctic are in general more\nrealistic.\n5 Causes of intermodel variations\nIn this section, we investigate the role of model-to-model\ndifferences in transport, photochemistry and deposition, and\nemissions in creating the diversity of results seen in the Arc-\ntic. This is accomplished by comparison of the prescribed\nlifetime simulations with the full chemistry and physics sim-\nulations and by examining the correlation between Arctic\nconcentrations and diagnostics such as residence times.\nwww.atmos-chem-phys.net\/8\/5353\/2008\/ Atmos. Chem. Phys., 8, 5353–5372, 2008\n5364 Multi-model assessment of pollution transport to the Arctic: D. T. Shindell et al.\npp\nbv\n\/T\ng\nTransport\n13\n8\n10\n8\n9\n1111\n14\n9\n7 515\nSurface 500 hPa 250 hPa\npp\nbv\n\/T\ng\n26\n19\n14\n14\n25\n30\n16\n24\n16\n24\n2550\nTransport+CO loss\n.10\n.20\n.30\nSurface 500 hPa 250 hPa\npp\nbv\n24\n41\n24\n23\n46\n37\n27\n27\n26\n44\nTransport+CO loss+Emissions\n1\n2\n3\n4\n5\n6\nSurface 500 hPa 250 hPa\n0 0\n24 24\n.04\n.08\n.12\n0\nEast Asia\nEurope\nNorth America\nSouth Asia\nFig. 8. Annual Arctic average carbon monoxide response to source region emissions as a function of processes included in the models. The\ninfluence of transport is shown via the Arctic sensitivity in the prescribed 50 day lifetime CO-like tracer runs (left). The influence of transport\nplus CO oxidation is given by the sensitivity in the full chemistry run (center). The influence of transport plus oxidation plus emissions is\nalso given by the full chemistry run, this time without normalization by the source region emissions change (right). Numerical values over\neach bar give the fractional variation (standard deviation as a percentage of the mean). Symbols as in Fig. 2.\n5.1 Isolating processes governing variations in CO and\nozone\nWe first compare the intermodel variability in Arctic sensitiv-\nities in the run with the prescribed lifetime “CO-like” tracer\nto that with realistic CO. As the two sets of experiments do\nnot use directly comparable CO, we analyze the standard de-\nviation as a percentage of the mean response (the fractional\nvariation) among models. All models in the analysis per-\nformed both the prescribed lifetime and full chemistry runs.\nThe fractional variation of sensitivity is always larger in\nthe full chemistry analyses than in the prescribed 50 day life-\ntime case (numerical values in Fig. 8). The relative size of the\nfractional variations in the prescribed lifetime and full chem-\nistry runs depends on the altitude analyzed and the source\nregion. At the Arctic surface, the intermodel fractional vari-\nation in the prescribed lifetime runs is 9–14%, roughly two-\nthirds that seen in the full chemistry runs (16–26%) for all\nregions (Fig. 8). This indicates that differences in modeled\ntransport to the Arctic play an important role in CO near the\nsurface. In the middle troposphere, transport and chemical\noxidation by OH contribute a comparable amount to inter-\nmodel differences in Arctic CO, while in the upper tropo-\nsphere transport plays a much smaller role. At the surface\nand in the mid-troposphere, adding in the intermodel varia-\ntion in emissions (i.e. no longer normalizing by emissions)\nleads to larger fractional variances across the models. This is\nespecially so for East Asia, where including the intermodel\nvariation in emissions nearly triples the fractional variance\nof the Arctic response at the surface and middle troposphere\nacross models. The effects are smaller for emissions from\nEurope or North America at these levels, where emissions\nvariations add ∼5–13% to the fractional variance, a com-\nparable range to that from transport (8–14%) and oxidation\n(6–11%) variations among models. Emissions uncertainties\nfrom South Asia have an even smaller impact than those\nfrom Europe or North America, barely changing the frac-\ntional variance.\nThus the intermodel variation in the influence of source\nregion CO emissions on the Arctic surface and mid-\ntroposphere is dominated by emissions for East Asia, by\ntransport and oxidation for South Asia, and all three terms\n(transport, oxidation and emissions) play comparable roles\nfor Europe and North America. In the upper troposphere,\nthe intermodel fractional variations are dominated by oxida-\ntion differences, whose importance gradually increases with\naltitude. We note, however, that while the 250 hPa inter-\nmodel differences are important, the variation across the cen-\ntral 50% of models in CO sensitivity in the upper troposphere\nis only ∼40%, among the smallest range for any species at\nany level (Fig. 4).\nWe now investigate the dependence of the results on the\nquality of the model’s Arctic CO simulation. Including all\nmodels, the fractional variation is 20–26% for surface and\nmid-troposphere sensitivities to European, East Asian and\nNorth American emissions, and is 31–35% for South Asian\nemissions. Using only the subset of models showing better\nagreement with observations (9 of 11 models), it decreases to\n11–13% for surface and mid-troposphere sensitivities to East\nAsian and North American CO emissions, 16% and 22% for\nsurface and mid-troposphere sensitivities to European emis-\nsion, respectively, and 23–25% for South Asian emissions.\nThere is no appreciable difference between using all models\nor restricting the analysis to the subset when calculating the\nstandard deviations in the upper troposphere. In either case\nthese are 24–29% for European, East Asian and North Amer-\nican emissions. The sensitivity to South Asian CO emissions\nin the upper troposphere shows a very large standard devi-\nation across models (45–47%), perhaps related to variations\nin model simulations of tropical convective transport. How-\never, its contribution per unit emission is relatively small.\nHence screening models by their ability to match observa-\ntions can substantially reduce the intermodel variations even\nthough in this case only 2 models were removed. We con-\nclude that the Arctic-wide response to source region emis-\nsions perturbations can be simulated relatively reliably for\nAtmos. Chem. Phys., 8, 5353–5372, 2008 www.atmos-chem-phys.net\/8\/5353\/2008\/\nMulti-model assessment of pollution transport to the Arctic: D. T. Shindell et al. 5365\na long-lived species such as CO. This is especially true for\nquality-screened models, in which case fractional variations\nin the mid and lower troposphere are 22% or less for CO\nsensitivity to emissions from Europe, and 13% or less for\nemissions from East Asia or North America.\nThough model results are relatively consistent for CO, it\nis interesting to examine the relationship across models be-\ntween the Arctic sensitivities and the global mean chemical\nlifetime (lifetimes for portions of the globe could not be cal-\nculated using the available diagnostics). A high correlation\nwould indicate that the removal rates of CO (by oxidation)\nplay an important role in intermodel variations in sensitivity.\nWe find that either using all models or the quality-screened\nsubset there is little correlation between CO sensitivity and\nglobal mean lifetime for the surface and mid-troposphere, ex-\ncept for South Asian emissions (Table 5). There is some cor-\nrelation for all regions in the upper troposphere (R2 0.4–0.7).\nHence it appears that the CO chemical lifetime, a measure of\nthe CO oxidation rate, does not play a large role in determin-\ning the sensitivity of the Arctic to NA, EU and EA emissions\nperturbations below the upper troposphere. These results are\nconsistent with the increasing importance with height of oxi-\ndation seen in the comparison between the prescribed life-\ntime and full chemistry simulations. For emissions from\nSouth Asia, which have to travel further to the Arctic, the\nchemical lifetime does appear to play an important role, es-\npecially in the mid and upper troposphere.\nOzone’s response to NOx emissions perturbations can be\nof either sign, indicating non-linearities in chemistry that pre-\nclude explanation via linear correlation analysis between the\nresponse and ozone’s lifetime. We can, however examine\ncorrelations between Arctic ozone sensitivity and intermodel\nvariations in ozone dry deposition or transport (using the pas-\nsive tracer simulations for the latter). We find that model-to-\nmodel variations in dry deposition account for little of the\nspread in Arctic ozone sensitivity to NOx perturbations, even\nat the surface (R2<0.3 at all levels, <0.1 at surface). Cor-\nrelations between Arctic ozone sensitivity and transport (us-\ning the prescribed lifetime tracer values. as in the left panel\nof Fig. 8, for each model) are similarly weak at the surface\nand 250 hPa (R2<0.25). In the mid-troposphere (500 hPa),\nhowever, correlations are R2=0.4 to 0.5 for NA, EA and SA,\nindicating that at those levels transport variations account for\nroughly half the intermodel variation in Arctic ozone sen-\nsitivity. At other levels, however, it appears that model-to-\nmodel differences in the non-linear ozone photochemistry\nmust play the dominant role in the intermodel spread of sen-\nsitivities. Consistent with this, annual mean ozone sensitiv-\nity to NOx perturbations shows a variation across models of\n35–80% of the mean across regions and altitudes, which is\nsubstantially larger than the 8–15% in the prescribed 50 day\nlifetime tracer experiments\nTable 5. Lifetime or residence time (days) and correlation coef-\nficients (R2) between those times and Arctic sensitivity across the\nmodels.\nEA EU NA SA\nCO subset Surface correlation .0 .3 .1 .8\n(Global mean 500 hPa correlation .0 .0 .0 .8\nlifetime 62±12) 250 hPa correlation .3 .3 .4 .6\nCO all Surface correlation .3 .0 .3 .9\n(Global mean 500 hPa correlation .4 .2 .3 .9\nlifetime 57±15) 250 hPa correlation .4 .4 .5 .5\nBC all Mean residence time 4.9±2.0 5.8±1.4 5.1±1.5 6.6±1.5\nSurface correlation .8 .8 .8 .2\n500 hPa correlation .8 .7 .8 .3\n250 hPa correlation .9 .6 .8 .4\nSO4 subset Mean residence time 4.8±0.9 7.0±1.9 4.7±0.9 5.6±1.2\nSurface correlation .2 .0 .5 .8\n500 hPa correlation .0 .0 .1 .5\n250 hPa correlation .2 .0 .3 .1\nSO4 all Mean residence time 4.3±1.9 6.1±2.2 4.7±2.1 5.3±2.5\nSurface correlation .2 .1 .1 .1\n500 hPa correlation .5 .4 .5 .5\n250 hPa correlation .6 .3 7 .4\nGlobal mean multimodel means and standard deviations of resi-\ndence times for regional emissions for aerosols and global mean\nchemical lifetime from the control run for CO are given. R2 values\nare linear correlations between those times and the Arctic sensitivi-\nties at the given pressure levels. “All” and “subset” refer to the mod-\nels used in the analysis (see text for subsets). The EMEP model was\nexcluded since it includes the NH only and hence its global lifetime\nis not precisely equivalent to the others. In the CO analysis, GMI\nand MOZECH were not included due to problematic diagnostics.\n5.2 Isolating processes governing variations in aerosols\nWe examine the relationship between the Arctic concentra-\ntions and the aerosol lifetimes, as for CO. For aerosols, how-\never, we are able to calculate the global residence time for\nregional emissions perturbations. These are determined from\nthe change in burden over the change in removal rates in the\nregional perturbation experiments. Note that this calculation\nimplicitly assumes that the residence time is the same in the\ntwo experiments, which given the relatively small emissions\nperturbations imposed in our experiments should be a good\napproximation.\nWe also compare with the prescribed lifetime tracer results\nto estimate the relative importance of transport variations\namong models to the total range in results. The prescribed\n5.6 and 13 day lifetime anthropogenic VOC-like tracers have\nlifetimes most comparable to those of aerosols. Comparison\nof the different lifetime VOC tracers shows that the spread\nof model results is inversely related to lifetime (Table 6), as\nmight be expected. The relationship is not linear, however,\nand depends on altitude as well as lifetime. Additionally, the\nsolubility of some aerosols links them to the hydrologic cy-\ncle much more closely than for these tracers, so the compari-\nson with the prescribed lifetime VOC or insoluble CO tracer\nresults isolates the influence of dry transport (i.e. excluding\nwww.atmos-chem-phys.net\/8\/5353\/2008\/ Atmos. Chem. Phys., 8, 5353–5372, 2008\n5366 Multi-model assessment of pollution transport to the Arctic: D. T. Shindell et al.\nTable 6. Standard deviations of annual mean Arctic values of pre-\nscribed lifetime tracers across models (%).\nsurface 500 hPa 250 hPa\n5.6 day VOC 19.7 6.4 14.0\n13 day VOC 18.2 5.6 7.9\n64 day VOC 9.7 3.9 6.0\n50 day CO 7.5 6.9 7.8\n50 day soluble CO 62.6 65.7 76.7\nThe three VOC-like tracers used identical VOC emissions, while the\ntwo CO-like tracers used CO emissions. Hence comparison within\nthe VOC subset shows the effect of lifetime changes, comparison\nof the two CO tracers shows the effect of solubility, and differences\nbetween the 64 day VOC and 50 day CO are mostly due to differing\nemissions locations.\ntransport of species in the aqueous phase). The role of trans-\nport that can be identified from the prescribed lifetime tracer\nsimulations also does not include linkages between transport\nand wet removal that result from removal rates varying with\nlocation, such as for wet removal processes that depend on\nlocal precipitation. Hence transport has a specific, limited\nmeaning in our analysis.\nThe range of intermodel variations in Arctic sensitivity is\nmuch larger for BC than for CO (Fig. 4). The intermodel\nvariation in residence time for BC among models is roughly\na factor of 2 and accounts for most of the spread (Table 5).\nThis variation is much greater than the variation in efficiency\nof dry transport to the Arctic at most levels from any region\nas seen in the prescribed lifetime simulations (e.g. Fig. 8),\neven accounting for the intermodel transport variations be-\ning roughly twice as large for a tracer with BC’s lifetime\nthan with CO’s (Table 6). Hence the other factors affecting\nresidence time, including aerosol aging from hydrophobic to\nhydrophilic and rainout\/washout of the aerosols, appear to\nplay important roles in governing the Arctic sensitivity to re-\ngional BC emissions from middle to higher Northern lati-\ntudes (EU, NA, and EA). In other words, the large variations\nin how long BC remains in the global atmosphere seems to be\nmore important in determining how much reaches the Arctic\nthan are dry transport differences or local Arctic removal pro-\ncesses (which contribute only a minor fraction of the global\nremoval). This result is consistent with the strong sensitivity\nin the export efficiency of Asian BC to the conversion life-\ntime from hydrophobic to hydrophilic seen in a study based\non 2001 aircraft data (Park et al., 2005). For emissions from\nSouth Asia, the global annual mean residence time of BC\nis less closely correlated with the Arctic sensitivity. Hence\nfor emissions from this region, both intermodel variations in\nBC residence times and in transport appear to be important\nfactors in creating model diversity.\nFor sulfate, the fractional variation in annual average sen-\nsitivity to regional emissions across models is ∼68–112%,\nmuch greater than that seen in the prescribed 50 day lifetime\nruns where fractional variations were only ∼8–15% (Fig. 8),\nor the 6–20% variations in the response to global emissions\nfor the 5.6 day lifetime tracer (Table 6) (note that the inter-\nmodel variations in reponse to global emissions are 0–50%\nless than those for regional emissions in the 50 day lifetime\nexperiments). This suggests that for sulfate, variations in\nlarge-scale physical and chemical processing of aerosol (re-\nmoval of sulfate and\/or SO2, oxidation of SO2, etc.) account\nfor a major portion of the divergence between models. This\nis consistent with the order of magnitude increase in model-\nto-model variations going from insoluble to soluble passive\ntracers that are otherwise identical (Table 6). When inter-\nmodel emissions variations are not removed from the sul-\nfate response calculations, the annual average fractional vari-\nance increases only modestly (∼10%), to 79–120% across\nthe models. Thus emissions differences appear to play a mi-\nnor role in the model-to-model variations.\nSulfate’s global mean residence time in the models ranges\nfrom 2.7 to 11.2 days. Aside from the two models with these\nvalues, the other 12 all have lifetimes between 3.2 and 7.4\ndays. Hence the spread in global residence times is small\ncompared with the spread in Arctic sensitivities (Fig. 4). Cor-\nrelations between these two quantities are fairly weak at the\nsurface, but more significant aloft when examining all mod-\nels (Table 5). Using only those in the subset with lower RMS\nerror scores against observations (which screens out the mod-\nels with 2.7 and 11.2 day lifetimes, among others), the cor-\nrelations increase at the surface in some cases, but decrease\nat 500 and 250 hPa. Even with the quality-screened subset\nof models, the residence time for regional emissions pertur-\nbations typically accounts for at most 20–50% of the vari-\nance in lower tropospheric Arctic sensitivities, and often 0–\n10%. Hence while variations in residence time account for a\nsubstantial fraction of the intermodel variance in Arctic sen-\nsitivities across all models, they can explain only a modest\nportion of the variance in the subset. In the latter models,\nthe variation in residence time is relatively small, so that pro-\ncesses such as wet removal of sulfate or in-cloud oxidation\nfarther from the source region may be important in control-\nling how much sulfate reaches the Arctic even though they\nmay not greatly affect the global residence time for regional\nemissions perturbations. Transport variations between mod-\nels also play an important role for very short-lived species,\nespecially near the surface and in the upper troposphere (Ta-\nble 6). Note that residence times are somewhat longer for Eu-\nropean emissions, consistent with their larger impact on the\nArctic. We also point out that sulfate changes are a function\nof both aerosol and oxidant precursor changes in these exper-\niments, as precursors to both were changed simultaneously\nin the HTAP runs. This may at least partially explain why\nsulfate residence times are not as well correlated with Arc-\ntic sensitivities as are BC’s. Hence diagnosing the physical\nprocesses responsible for the large spread in sulfate sensitiv-\nities will require much deeper investigation into model pro-\nAtmos. Chem. Phys., 8, 5353–5372, 2008 www.atmos-chem-phys.net\/8\/5353\/2008\/\nMulti-model assessment of pollution transport to the Arctic: D. T. Shindell et al. 5367\nEast AsiaEuropeNorth AmericaSouth Asia\n10\n20\n30\n40\n50\n60\n70\n80\n90\n10\n20\n30\n40\n50\n60\n70\n80\n90\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\nFig. 9. Relative contribution of regional emissions to winter Arctic surface BC. Values are the relative contribution (%) to the total response\nto emissions from the four source regions (top row), the relative contribution (%) per unit source region emission (middle row), and the\nstandard deviation of the latter across the HTAP models (bottom row). Results are based on 8 models (three models with small-spatial scale\nstructure were excluded from these calculations for clarity).\ncesses using additional diagnostics not available in the HTAP\narchive, and would benefit from additional simulations per-\nturbing only aerosol precursors.\nOverall, the comparison between the prescribed lifetime\ntracer and full chemistry simulations and the analyses of the\ncorrelation between residence times and Arctic concentra-\ntions both support the conclusion that dry transport differ-\nences among the models play a major role in the intermodel\nvariations of insoluble, relatively long-lived CO. They are\nsimilarly important contributors to the model-to-model dif-\nferences in mid-tropospheric ozone. However, these appear\nto be less important contributors to the intermodel variations\nin the Arctic sensitivity to aerosol emissions, for which un-\ncertainties in aerosol physical and chemical processing, in-\ncluding wet removal, play the largest roles. Variations among\nmodels’ Arctic cloud phase (ice versus liquid) and uncer-\ntainty about removal of aerosol by ice clouds may contribute\nto the large spread of aerosol results.\nWe also examined the relationship between horizontal res-\nolution in the models and their representations of transport\nand of trace species in general. Horizontal resolution, using\nlatitude, ranges from 1 to 5 degrees. We find R2 correla-\ntions with resolution (using latitude) to be extremely low for\nlifetimes and sensitivities. Hence there is no straightforward\ncorrelation with resolution.\n6 Discussion and conclusions\nThe spread in model results for Arctic pollutants is very large\nfor both gaseous species and aerosols. Differences in mod-\neled transport, chemistry, removal and emissions all con-\ntribute to this spread, which makes climate and composition\nprojections for the Arctic extremely challenging.\nThis study has identified the largest contributing factors to\nthe diversity of model results. We have shown that for sul-\nfate and BC (including deposition of the latter), uncertain-\nties in modeling of aerosol physical and chemical process-\ning are extremely important, with lesser roles for emissions\nand for dry transport. Further studies to determine precisely\nwhich physical processes play the largest role, such as those\nsuggested by (Textor et al., 2006), would help prioritize re-\nsearch. In contrast, for CO, transport and emissions are im-\nportant drivers of uncertainty in simulating surface responses\nto source region emissions, while transport, emissions and\noxidation rates all play comparable roles at higher altitudes.\nFor ozone, our analysis suggests that transport plays a sub-\nstantial role in the intermodel variations in sensitivity, but\nthat photochemical differences among the models appear to\nbe the dominant contributor.\nOur results for aerosols are consistent with earlier inter-\ncomparisons. These showed that the diversities in aerosol\nmass depend largely on differences in transport and the pa-\nrameterizations of internal aerosol processes, and only to a\nwww.atmos-chem-phys.net\/8\/5353\/2008\/ Atmos. Chem. Phys., 8, 5353–5372, 2008\n5368 Multi-model assessment of pollution transport to the Arctic: D. T. Shindell et al.\nEast AsiaEuropeNorth AmericaSouth Asia\n10\n20\n30\n40\n50\n60\n70\n80\n90\n10\n20\n30\n40\n50\n60\n70\n80\n90\n0\n2\n4\n6\n8\n10\n12\n14\n16\n18\nFig. 10. As Figure 9 but for summer.\nlesser extent on their (precursor) emissions (Textor et al.,\n2007). These results held true for both the global aerosol\nload and the polar (>80◦ in both hemispheres) fraction. Our\nresults also suggest that the contribution of intermodel dry\ntransport differences to disparities in Arctic aerosol loading\nis relatively small, reinforcing the conclusion that aerosol\nand cloud physical and chemical processing (e.g. removal,\noxidation and microphysics) is the principle source of uncer-\ntainty in modeling the distributions of these species in the\nArctic. For realistic species whose lifetimes vary with loca-\ntion, transport and physical processes are inherently coupled,\nhowever, and hence for the soluble aerosols these cannot be\neasily separated as sources of uncertainty.\nFor cases in which transport plays a substantial role in in-\ntermodel variability, such as CO or mid-tropospheric ozone,\nintercomparison among different models driven by the same\nmeteorological fields would help determine the underlying\nreason for the range of results (complimenting studies of a\nsingle model driven by multiple meteorological fields, such\nas (Liu et al., 2007)). Differences in convection certainly\ncontribute to transport variations among models. Model nu-\nmerical schemes could also play a role, though algorithms\nsuch as conservation of second-order moments have been\nshown to generally transport trace species quite well, pre-\nserving gradients and not being too diffusive (Prather, 1986).\nHowever, this merits further study as many models may use\nless capable transport schemes. Additionally, the degree of\nagreement between chemical-transport models driven by of-\nfline meteorological fields and general circulation models\nthat are relaxed towards offline meteorological fields remains\nto be characterized. Our comparison shows no clear effect of\nhorizontal resolution.\nAlthough the intermodel variations in transport to the Arc-\ntic are large, many of them are systematic across models so\nthat differences between sensitivities to emissions from var-\nious regions are robust across models. In particular, we find\nthat Arctic surface concentrations of BC, sulfate, and CO are\nsubstantially more sensitive to European emissions than to\nthose from other regions. Similar results are obtained for\nthe mid-troposphere (500 hPa), though the difference in sen-\nsitivities between Europe and other regions is not as large\nas for the surface. Hence per unit Tg emission change, Eu-\nropean emissions are the most important for these species.\nWe expect that Arctic sensitivities to emissions from North-\nern Asia would be generally similar to their European coun-\nterparts given the similarity in proximity and meteorological\nconditions.\nThe sensitivity of Arctic surface concentrations to Euro-\npean emissions maximizes during winter for CO, sulfate and\nBC. In the middle troposphere, sensitivity to European emis-\nsions is greatest in summer for aerosols. Sensitivity to East\nAsian emissions peaks during spring for BC, sulfate, and CO\nat both the surface and 500 hPa. Hence the relative impor-\ntance of emissions from different regions varies seasonally.\nFor surface ozone, Arctic concentrations during summer are\nmost sensitive to European emissions of NOx, but sensitivi-\nties are comparable in fall for European and North American\nemissions, and in spring for East Asian, European and North\nAtmos. Chem. Phys., 8, 5353–5372, 2008 www.atmos-chem-phys.net\/8\/5353\/2008\/\nMulti-model assessment of pollution transport to the Arctic: D. T. Shindell et al. 5369\nTable A1. Arctic average absolute mixing ratio decreases due to 20% reductions in anthropogenic emissions in each region for the four\nseasons.\nDec–Jan\nEA EU NA SA\nSurface\nSulfate (pptm) 1.33±1.38 (8%) 14.1±12.4 (80%) 1.90±2.07 (10%) 0.31±0.41 (2%)\nBC (pptm) 0.12±0.19 (7%) 1.44±1.55 (86%) 0.10±0.12 (6%) 0.02±0.04 (1%)\nCO (ppbv) 2.22±1.01 (21%) 4.97±2.07 (47%) 2.90±0.75 (27%) 0.56±0.12 (5%)\nOzone (ppbv) 0.13±0.05 (26%) 0.14±0.22 (28%) 0.18±0.07 (36%) 0.05±0.02 (10%)\n500 hPa\nSulfate (pptm) 5.45±5.47 (25%) 9.6±10.3 (43%) 5.89±6.10 (27%) 1.20±1.40 (5%)\nBC (pptm) 0.57±0.71 (35%) 0.59±0.63 (37%) 0.32±0.35 (20%) 0.13±0.15 (8%)\nCO (ppbv) 2.61±1.09 (29%) 2.61±0.70 (29%) 3.07±0.67 (34%) 0.68±0.15 (8%)\nOzone (ppbv) 0.21±0.06 (30%) 0.12±0.07 (17%) 0.29±0.09 (42%) 0.08±0.03 (11%)\n250 hPa\nSulfate (pptm) 10.2±10.5 (38%) 5.23±6.25 (19%) 7.39±9.34 (27%) 4.25±5.62 (16%)\nBC (pptm) 0.70±0.73 (47%) 0.17±0.18 (11%) 0.24±0.26 (16%) 0.39±0.38 (26%)\nCO (ppbv) 1.32±0.43 (34%) 0.74±0.25 (19%) 1.19±0.29 (31%) 0.58±0.25 (15%)\nOzone (ppbv) 0.16±.10 (26%) 0.12±0.12 (19%) 0.25±0.18 (40%) 0.09±0.06 (15%)\nMar–May\nEA EU NA SA\nSurface\nSulfate (pptm) 3.84±3.79 (19%) 13.4±13.2 (65%) 3.04±3.25 (15%) 0.22±0.30 (1%)\nBC (pptm) 0.30±0.38 (31%) 0.52±0.51 (54%) 0.13±0.14 (13%) 0.02±0.03 (2%)\nCO (ppbv) 3.17±1.54 (29%) 4.04±1.44 (36%) 3.11±0.93 (28%) 0.76±0.30 (7%)\nOzone (ppbv) 0.17±0.06 (28%) 0.18±0.07 (30%) 0.21±0.07 (35%) 0.04±0.01 (7%)\n500 hPa\nSulfate (pptm) 18.3±16.7 (30%) 29.2±27.0 (48%) 11.6±10.9 (19%) 1.92±2.28 (3%)\nBC (pptm) 1.48±1.49 (47%) 1.10±1.14 (35%) 0.44±0.46 (14%) 0.15±0.17 (4%)\nCO (ppbv) 3.20±1.42 (32%) 2.85±0.83 (29%) 3.02±0.83 (30%) 0.90±0.31 (9%)\nOzone (ppbv) 0.30±0.08 (24%) 0.42±0.13 (34%) 0.45±0.14 (36%) 0.07±0.03 (6%)\n250 hPa\nSulfate (pptm) 14.8±12.3 (35%) 12.9±15.0 (30%) 9.20±9.09 (22%) 5.49±5.50 (13%)\nBC (pptm) 0.94±0.82 (46%) 0.37±0.38 (18%) 0.29±0.31 (14%) 0.46±0.42 (22%)\nCO (ppbv) 1.39±0.49 (35%) 0.77±0.28 (19%) 1.09±0.31 (27%) 0.73±0.32 (18%)\nOzone (ppbv) 0.18±0.13 (23%) 0.20±0.19 (26%) 0.30±0.21 (38%) 0.10±0.06 (13%)\nJun–Aug\nEA EU NA SA\nSurface\nSulfate (pptm) 2.17±1.99 (14%) 10.5±7.3 (70%) 2.30±1.77 (15%) 0.12±0.17 (1%)\nBC (pptm) 0.17±0.17 (25%) 0.40±0.26 (60%) 0.09±0.08 (13%) 0.01±0.01 (2%)\nCO (ppbv) 1.96±1.21 (34%) 1.70±0.78 (29%) 1.73±0.93 (30%) 0.43±0.21 (7%)\nOzone (ppbv) 0.07±0.03 (18%) 0.19±0.08 (49%) 0.13±0.09 (33%) 0.00±0.01 (0%)\n500 hPa\nSulfate (pptm) 12.6±14.1 (22%) 31.8±28.8 (56%) 11.3±10.9 (20%) 1.14±2.00 (2%)\nBC (pptm) 0.75±0.78 (31%) 1.21±1.23 (50%) 0.40±0.36 (17%) 0.06±0.08 (2%)\nCO (ppbv) 1.82±1.02 (33%) 1.56±0.57 (28%) 1.75±0.90 (31%) 0.46±0.23 (8%)\nOzone (ppbv) 0.21±0.09 (17%) 0.50±0.19 (42%) 0.47±0.22 (39%) 0.02±0.02 (2%)\n250 hPa\nSulfate (pptm) 24.1±22.4 (37%) 23.8±22.7 (36%) 14.1±12.4 (22%) 3.56±3.71 (5%)\nBC (pptm) 1.51±1.42 (48%) 0.79±0.65 (25%) 0.46±0.40 (15%) 0.39±0.49 (12%)\nCO (ppbv) 1.39±0.65 (36%) 0.88±0.28 (23%) 1.08±0.38 (28%) 0.51±0.28 (13%)\nOzone (ppbv) 0.26±0.15 (24%) 0.35±0.22 (32%) 0.42±0.24 (38%) 0.07±0.05 (6%)\nSep–Nov\nEA EU NA SA\nSurface\nSulfate (pptm) 1.27±1.14 (9%) 11.6±10.5 (78%) 1.84±1.55 (12%) 0.14±0.17 (1%)\nBC (pptm) 0.11±0.16 (12%) 0.75±0.78 (77%) 0.10±0.12 (10%) 0.01±0.01 (1%)\nCO (ppbv) 1.54±0.93 (24%) 2.65±0.92 (41%) 1.93±0.95 (30%) 0.30±0.16 (5%)\nOzone (ppbv) 0.10±0.04 (18%) 0.21±0.08 (38%) 0.23±0.10 (42%) 0.01±0.01 (2%)\n500 hPa\nSulfate (pptm) 8.95±8.86 (21%) 22.3±21.9 (52%) 10.5±10.9 (25%) 1.00±1.59 (2%)\nBC (pptm) 0.81±0.85 (35%) 0.94±1.04 (41%) 0.46±0.50 (20%) 0.08±0.10 (4%)\nCO (ppbv) 1.88±0.92 (30%) 1.85±0.47 (29%) 2.25±0.90 (35%) 0.39±0.19 (6%)\nOzone (ppbv) 0.24±0.07 (21%) 0.36±0.12 (32%) 0.48±0.18 (43%) 0.05±0.03 (4%)\n250 hPa\nSulfate (pptm) 20.2±22.5 (36%) 16.1±16.6 (28%) 14.5±16.5 (26%) 5.42±7.22 (10%)\nBC (pptm) 1.49±1.62 (49%) 0.48±0.43 (16%) 0.46±0.44 (15%) 0.63±0.80 (20%)\nCO (ppbv) 1.30±0.52 (37%) 0.67±0.21 (19%) 1.06±0.32 (30%) 0.51±0.24 (14%)\nOzone (ppbv) 0.26±0.14 (25%) 0.25±0.17 (25%) 0.41±0.21 (40%) 0.10±0.07 (10%)\nFor each species, values are multi-model means and standard deviations. The percentage of the total from these four source regions for each\nindividual region is given in parentheses. Ozone and sulfate changes are in response to NOx and SO2 emissions changes, respectively.\nwww.atmos-chem-phys.net\/8\/5353\/2008\/ Atmos. Chem. Phys., 8, 5353–5372, 2008\n5370 Multi-model assessment of pollution transport to the Arctic: D. T. Shindell et al.\nAmerican emissions. In the upper troposphere, concentra-\ntions for all species typically show comparable sensitivity to\nemissions from all four source regions, though there is a gen-\neral tendency for a lower sensitivity to South Asian emissions\n(especially for CO).\nThe deposition of BC to the Arctic outside of Greenland\nis most sensitive to emissions from Europe in all seasons. In\ncontrast, deposition of BC to Greenland is most sensitive to\nNorth American emissions, except during winter when sensi-\ntivity to European emissions becomes comparable. Total de-\nposition of BC, rather than per unit emission, is again greater\nfrom Europe than the other regions for the Arctic exclusive\nof Greenland. Annual mean total BC deposition onto Green-\nland is greatest from North America and Europe, which are\nnearly equal, with a substantial but lesser contribution from\nEast Asia. These conclusions are robust across the models\nexamined here. Total deposition to Greenland is primarily\ndue to emissions from North America and East Asia during\nspring, when Greenland is less affected by European emis-\nsions than in other seasons. As springtime deposition appears\nto be especially effective in inducing large snow-albedo feed-\nbacks (Flanner et al., 2007), this suggests an enhanced role in\nGreenland climatic forcing for East Asian and North Amer-\nican emissions relative to their annual mean contribution to\ndeposition.\nThe recent recovery of ice core records from Greenland\ncontaining BC (McConnell et al., 2007) may allow better\nestimates of historical BC emissions. The results presented\nhere indicate that even without including Russian emissions,\nNorth America is responsible for less than half the BC depo-\nsition onto Greenland (Table 4). Hence the ice core record\nmay indeed reflect very large emissions during the early\n20th century from Eastern North America (McConnell et al.,\n2007), but it could also include the effects of changing emis-\nsions from other regions during that time. Analysis of vari-\nations in deposition across Greenland might help clarify this\nissue, as could further analysis of historical emission trends\nby matching the onset and duration of the early 20th century\nBC deposition maximum seen in the ice core record.\nPrevious work has discussed apparently conflicting results\non transport of BC to the Arctic (Law and Stohl, 2007). The\nresults of (Koch and Hansen, 2005) indicated that Arctic BC\noptical thickness results mostly from Asian emissions (ex-\ncluding Russia, so roughly corresponding to our SA+EA).\nImpacts from European and North American emissions were\nroughly half to one-third of the Asian ones, and Asian emis-\nsions also played a major role in the low altitude springtime\nArctic Haze. In contrast, (Stohl, 2006) found that transport\nfrom Europe to the Arctic surface was much more effective\nthan from South and East Asia. The mean BC emissions in\nHTAP are: SA 0.87, EA 1.80, NA 0.66, EU 0.93 Tg yr−1.\nIn (Koch and Hansen, 2005), they are: SA+EA 2.08, EU\n0.47, NA 0.39 Tg yr−1. Using either set of emissions and\nthe mean or median sensitivities found here, BC in the upper\ntroposphere is indeed dominated by Asian emissions (as in\nTable 3). In the mid-troposphere, Asian emissions dominate\nduring spring, have comparable impact to European emis-\nsions in winter and fall, and are less important in summer us-\ning HTAP emissions (seasonal results are given in Table A1).\nUsing those of (Koch and Hansen, 2005), Asian emissions\nwould be most important in all seasons. Examining spring-\ntime low altitude BC pollution (contributing to Arctic Haze),\nAsian sources contribute 57% as much as European sources\nin the HTAP models to BC at the surface, and 134% as much\nat 500 hPa (multi-model means). Again, using the HTAP sen-\nsitivities and the Koch and Hansen (2005) emissions, Asian\nsources would contribute more strongly to Arctic BC. Hence\nalthough the GISS model used by (Koch and Hansen, 2005)\ntransports BC to the Arctic more efficiently than other mod-\nels (though apparently in better agreement with observations,\nFig. 7), their results for the relative importance of emissions\nfrom different regions are generally similar to the mean BC\nmodel simulations analyzed here, with differences largely\narising from the differing emission inventories used. The\nlarge contribution of Asian BC emissions contrasts with the\nresults of Stohl (2006), who found Asian contributions to\nspringtime Arctic surface BC to be only about 10% of Eu-\nropean contributions (using the same emissions inventory as\nKoch and Hansen, 2005). We find no contradiction, however,\nbetween the large impacts of Asian BC aloft in the Arctic and\nthe dominant role of European emissions on surface BC.\nThe differences between the results of Stohl (2006) and the\nHTAP models may relate to the Langrangian setup of the for-\nmer, while the latter models are Eulerian. This could lead to\ndifferent representations of transport pathways in the models.\nTo examine this, we have calculated the mean and standard\ndeviation of the relative contribution of emissions from each\nregion to the total BC response to perturbations (Figs. 9 and\n10). The HTAP models show the largest contribution from\nEuropean emissions to the European and Russian portion of\nthe Arctic while East Asian emissions have their largest rel-\native contribution in the Siberian and North American por-\ntions. Standard deviations across models are typically largest\naround the boundaries of the regions with greatest relative\ncontribution. This suggests that much of the variability re-\nsults from the differing residence times of BC, which allows\ntransport over a longer or shorter distance (consistent with\nthe high correlations between Arctic BC and residence time\ndiscussed in Sect. 5.2). Hence these standard deviations are\noften fairly uniform, such as those around the edges of the ar-\neas of maximum European contribution in winter or of max-\nimum North American contribution in summer. However,\nthere are also distinct areas of larger standard deviation that\ndo suggest intermodel variations in transport along particu-\nlar paths. These include summer transport from Asia across\nthe pole to Greenland, from North America to Siberia, and\nto some extent cross-polar transport from Europe to North\nAmerica, and during winter, westward transport from North\nAmerica across Siberia. At upper levels, standard deviations\nare typically smoother. Overall, the Eulerian models do not\nAtmos. Chem. Phys., 8, 5353–5372, 2008 www.atmos-chem-phys.net\/8\/5353\/2008\/\nMulti-model assessment of pollution transport to the Arctic: D. T. Shindell et al. 5371\nappear to show transport pathways to the Arctic that are re-\nmarkably different from one another, however. We believe\nthat the discrepancy between the HTAP models and the re-\nsults of Stohl (2006) is therefore most likely due to a funda-\nmental difference between the Eulerian and the Langrangian\nsetup, such as differences in diffusion, or to the lack of re-\nmoval processes in the Langrangian parcel model study.\nThe results presented here help to characterize the rela-\ntive importance of emissions from various source regions to\nseasonal and annual Arctic pollution. It remains an open\nquestion how these sensitivities may change in the future.\nAs climate continues to change, Arctic temperatures are pro-\njected to increase faster than those at lower latitudes. This\nwould reduce the temperature difference between the Arctic\nand pollution source regions, enhancing low-altitude trans-\nport of pollution into the Arctic. This might lead to in-\ncreased pollutant concentrations and, if these were primarily\nclimate warming agents, a further increase in surface tem-\nperatures. Additionally, large-scale circulation patterns are\nalso projected to respond to climate change. These may re-\nspond to the projected increase in the temperature gradient\nin the vicinity of the tropopause rather than the decreased\ngradient near the surface (Shindell et al., 2001). The Arctic\nmay be strongly affected by changes in the Northern Hemi-\nsphere westerlies associated with the North Atlantic Oscilla-\ntion\/Northern Annular Mode (Eckhardt et al., 2003; Duncan\nand Bey, 2004), which are projected to accelerate in the fu-\nture (Miller et al., 2006). These westerlies have been shown\nto substantially enhance pollutant transport to the Arctic, at\nleast from some regions (Sharma et al., 2006). Hence trans-\nport from highly polluted source regions may become more\nfrequent in the future.\nAt the same time, emissions will also be changing. Pro-\njected increases from East Asia would be especially effective\nin causing more springtime ozone, sulfate, BC and CO both\nat the Arctic surface and in the mid-troposphere. Reduc-\ntions in emissions from developed nations in North Amer-\nica and Europe would cause decreases in surface level CO\nand BC that would be especially pronounced in winter. This\nwould also substantially reduce BC deposition onto Green-\nland, though the reduction might be largely offset, especially\nduring spring and summer, by Asian emission increases. Sur-\nface sulfate would be reduced year-round with decreased\nemissions from industrialized countries, while ozone concen-\ntrations would decrease most in non-winter seasons. Hence\nchanges in the seasonal cycle of surface CO and BC, for ex-\nample, with an altered winter-to-spring gradient, could result\nfrom a shift in emissions from the developed to the develop-\ning world. Emissions might also increase within the Arctic\nitself, with large potential impacts on local pollutant concen-\ntrations.\nUnderstanding of future Arctic pollution levels will re-\nquire simulations incorporating both changing climate and\nemissions. Our confidence in the results of such simulations\ncould be greatly improved by resolving some of the apparent\ndiscrepancies between model results and observations, espe-\ncially for aerosols. Additional measurements of Arctic sul-\nfate and BC aerosols would be helpful to provide additional\nmodel constraints. For example, the BC data from Alert and\nBarrow, both in the Western Hemisphere, can clearly not be\nexpected to be representative of the Arctic as a whole given\nthe different impact of regional emissions on the Eastern and\nWestern Hemisphere portions of the Arctic (Figs. 9 and 10).\nBetter understanding of the mass absorption efficiency of BC\nand other absorbing species would also be useful. Hope-\nfully the activities of the International Polar Year 2007-2009\nwill substantially increase our knowledge of the Arctic, and\na hightened focus on the Arctic by the scientific community\nwill lead to at least some of these measurements being main-\ntained over the long-term. Nevertheless, the current results\nare robust across models in many respects, allowing better\nunderstanding of how various types of pollutants arrive in\nthe Arctic and influence climate and air quality.\nAcknowledgements. We thank the NASA Atmospheric Chemistry\nModeling and Analysis Program for support, and D. Henze for\ncomments. MGS and KJP were funded by the UK Defra under\ncontract AQ0409, and were also supported by the Joint Defra and\nMoD Programme, (Defra) GA01101 (MoD) CBC\/2B\/0417 Annex\nC5. This work was performed under the umbrella of the Task Force\n– Hemispheric Transport of Air Pollution (www.htap.org).\nEdited by: A. Stohl\nReferences\nBodhaine, B. A.: Aerosol absorption measurements at Barrow,\nMauna Loa and the South Pole, J. Geophys. Res., 100, 8967–\n8976, 1995.\nDuncan, B. N. and Bey, I.: A modeling study of the export\npathways of pollution from Europe: Seasonal and interan-\nnual variations (1987–1997), J. Geophys. Res., 109, D08301,\ndoi:10.1029\/2003JD004079, 2004.\nEckhardt, S., Stohl, A., Beirle, S., Spichtinger, N., James, P.,\nForster, C., Junker, C., Wagner, T., Platt, U., and Jennings, S.\nG.: The North Atlantic Oscillation controls air pollution trans-\nport to the arctic, Atmos. Chem. Phys., 3, 1769–1778, 2003,\nhttp:\/\/www.atmos-chem-phys.net\/3\/1769\/2003\/.\nFlanner, M. G., Zender, C. S., Randerson, J. T., and\nRasch, P. J.: Present-day climate forcing and response from\nblack carbon in snow, J. Geophys. Res., 112, D11202,\ndoi:10.1029\/2006JD008003, 2007.\nGarrett, T. J. and Zhao, C.: Increased Arctic cloud longwave emis-\nsivity associated with pollution from mid-latitudes, Nature, 440,\n787–789, 2006.\nHansen, J. and Nazarenko, L.: Soot climate forcing via snow\nand ice albedos, Proc. Natl. Acad. Sci., 101, 423–428,\ndoi:410.1073\/pnas.2237157100, 2004.\nHjellbrekke, A.-G. and Fjæraa, A. M.: Data report 2005 acid-\nifying and eutrophying compounds, and particulate matter,\nEMEP\/CCC-Report 1\/2007, 2007.\nwww.atmos-chem-phys.net\/8\/5353\/2008\/ Atmos. Chem. Phys., 8, 5353–5372, 2008\n5372 Multi-model assessment of pollution transport to the Arctic: D. T. Shindell et al.\nJacobson, M. Z.: Climate response of fossil fuel and bio-\nfuel soot, accounting for soot’s feedback to snow and sea\nice albedo and emissivity J. Geophys. Res., 109, D21201,\ndoi:10.1029\/2004JD004945, 2004.\nKlonecki, A., Hess, P., Emmons, L., Smith, L., Orlando, J., and\nBlake, D.: Seasonal changes in the transport of pollutants into\nthe arctic troposphere-model study, J. Geophys. Res., 108, 8367,\ndoi:10.1029\/2002JD002199, 2003.\nKoch, D., and Hansen, J.: Distant origins of arctic black carbon: A\nGoddard Institute for Space Studies modelE experiment, J. Geo-\nphys. Res., 110, D04204, doi:10.1029\/2004JD005296, 2005.\nLaw, K. S. and Stohl, A.: Arctic air pollution: Origins and impacts,\nScience, 315, 1537–1540, 2007.\nLiu, X., Penner, J. E., Das, B., Bergmann, D., Rodriguez,\nJ. M., Strahan, S., Wang, M., and Feng, Y.: Uncertain-\nties in global aerosol simulations: Assessment using three\nmeteorological datasets, J. Geophys. Res., 112, D11212,\ndoi:10.1029\/2006JD008216, 2007.\nLubin, D. and Vogelmann, A. M.: A climatologically significant\naerosol longwave indirect effect in the arctic, Nature, 439, 453–\n456, 2006.\nMcConnell, J., Edwards, R., Kok, G., Flanner, M., Zender, C.,\nSaltzman, E., Banta, J., Pasteris, D., Carter, M., and Kahl, J.:\n20th-century industrial black carbon emissions altered arctic cli-\nmate forcing, Science, 317, 1381–1384, 2007.\nMiller, R. L., Schmidt, G. A., and Shindell, D. T.: Forced variations\nof annular modes in the 20th century intergovernmental panel\non climate change fourth assessment report models, J. Geophys.\nRes., 111, D18101, doi:10.1029\/2005JD006323, 2006.\nNovelli, P. C., Masarie, K. A., and Lang, P. M.: Distributions and\nrecent changes in carbon monoxide in the lower troposphere, J.\nGeophys. Res., 103, 19 015–19 033, 1998.\nOltmans, S. J. and Levy, H.: Surface ozone measurements from a\nglobal network, Atmos. Env., 28, 9–24, 1994.\nPark, R. J., Jacob, D. J., Palmer, P. I., Clarke, A. D., Weber, R.\nJ., Zondlo, M. A., Eisele, F. L., Bandy, A. R., Thornton, D. C.,\nSachse, G. W., and Bond, T. C.: Export efficiency of black carbon\naerosol in continental outflow: Global implications, J. Geophys.\nRes., 110, D11205, doi:10.1029\/2004JD005432, 2005.\nPrather, M. J.: Numerical advection by conservation of second-\norder moments, J. Geophys. Res., 91, 6671–6681, 1986.\nQuinn, P. K., Bates, T. S., Baum, E., Doubleday, N., Fiore, A. M.,\nFlanner, M., Fridlind, A., Garrett, T. J., Koch, D., Menon, S.,\nShindell, D., Stohl, A., and Warren, S. G.: Short-lived pollutants\nin the arctic: Their climate impact and possible mitigation strate-\ngies, Atmos. Chem. Phys., 8, 1723–1735, 2007,\nhttp:\/\/www.atmos-chem-phys.net\/8\/1723\/2007\/.\nSharma, S., Andrews, E., Barrie, L. A., Ogren, J. A., and Lavoue´,\nD.: Variations and sources of the equivalent black carbon in\nthe high Arctic revealed by long-term observations at Alert\nand Barrow: 1989–2003, J. Geophys. Res., 111, D14208,\ndoi:10.1029\/2005JD006581, 2006.\nShindell, D.: Local and remote contributions to Arctic warming,\nGeophys. Res. Lett., 34, L14704, doi:10.1029\/2007GL030221,\n2007.\nShindell, D. T., Schmidt, G. A., Miller, R. L., and Rind, D.: North-\nern hemisphere winter climate response to greenhouse gas, vol-\ncanic, ozone and solar forcing, J. Geophys. Res., 106, 7193–\n7210, 2001.\nShindell, D. T., Faluvegi, G., Stevenson, D. S., Krol, M. C.,\nEmmons, L. K., Lamarque, J.-F., Petron, G., Dentener, F. J.,\nEllingsen, K., Schultz, M. G., Wild, O., Amann, M., Atherton,\nC. S., Bergmann, D. J., Bey, I., Butler, T., Cofala, J., Collins, W.\nJ., Derwent, R. G., Doherty, R. M., Drevet, J., Eskes, H. J., Fiore,\nA. M., Gauss, M., Hauglustaine, D. A., Horowitz, L. W., Isaksen,\nI. S. A., Lawrence, M. G., Montanaro, V., Muller, J. F., Pitari, G.,\nPrather, M. J., Pyle, J. A., Rast, S., Rodriguez, J. M., Sander-\nson, M. G., Savage, N. H., Strahan, S. E., Sudo, K., Szopa, S.,\nUnger, N., van Noije, T. P. C., and Zeng, G.: Multi-model simu-\nlations of carbon monoxide: Comparison with observations and\nprojected near-future changes, J. Geophys. Res., 111, D19306,\ndoi:10.1029\/2006JD007100, 2006.\nSirois, A. and Barrie, L. A.: Arctic lower tropospheric aerosol\ntrends and composition at Alert, Canada: 1980–1995, J. Geo-\nphys. Res., 104, 11 599–11 618, 1999.\nStohl, A.: Characteristics of atmospheric transport into\nthe Arctic troposphere, J. Geophys. Res., 111, D11306,\ndoi:10.1029\/2005JD006888, 2006.\nTextor, C., Schulz, M., Guibert, S., Kinne, S., Balkanski, Y., Bauer,\nS., Berntsen, T., Berglen, T., Boucher, O., Chin, M., Dentener, F.,\nDiehl, T., Easter, R., Feichter, H., Fillmore, D., Ghan, S., Ginoux,\nP., Gong, S., Grini, A., Hendricks, J., Horowitz, L., Huang, P.,\nIsaksen, I. S. A., Iversen, T., Kloster, S., Koch, D., Kirkeva˚g,\nA., Kristjansson, J. E., Krol, M., Lauer, A., Lamarque, J. F., Liu,\nX., Montanaro, V., Myhre, G., Penner, J. E., Pitari, G., Reddy,\nM. S., Seland, Ø., Stier, P., Takemura, T., and Tie, X.: Analysis\nand quantification of the diversities of aerosol life cycles within\nAerocom, Atmos. Chem. Phys., 6, 1777–1813, 2006,\nhttp:\/\/www.atmos-chem-phys.net\/6\/1777\/2006\/.\nTextor, C., Schulz, M., Guibert, S., Kinne, S., Balkanski, Y., Bauer,\nS., Berntsen, T., Berglen, T., Boucher, O., Chin, M., Dentener,\nF., Diehl, T., Feichter, H., Fillmore, D., Ginoux, P., Gong, S.,\nGrini, A., Hendricks, J., Horowitz, L., Huang, P., Isaksen, I. S.\nA., Iversen, T., Kloster, S., Koch, D., Kirkeva˚g, A., Kristjansson,\nJ. E., Krol, M., Lauer, A., Lamarque, J. F., Liu, X., Montanaro,\nV., Myhre, G., Penner, J. E., Pitari, G., Reddy, M. S., Seland, Ø.,\nStier, P., Takemura, T., and Tie, X.: The effect of harmonized\nemissions on aerosol properties in global models – an Aerocom\nexperiment, Atmos. Chem. Phys., 7, 4489–4501, 2007,\nhttp:\/\/www.atmos-chem-phys.net\/7\/4489\/2007\/.\nVogelmann, A. M., Robock, A., and Ellingson, R. G.: Effects of\ndirty snow in nuclear winter simulations, J. Geophys. Res., 93,\n5319–5332, 1988.\nWarren, S. G. and Wiscombe, W. J.: A model for the spectral albedo\nof snow. II: Snow containing atmospheric aerosols, J. Atmos.\nSci., 37, 2734–2745, 1980.\nXie, Y.-L., Hopke, P. K., Paatero, P., Barrie, L. A., and Li, S.-M.:\nIdentification of source nature and seasonal variations of Arctic\naerosol by positive matrix factorization, J. Atmos. Sci., 56, 249–\n260, 1999.\nAtmos. Chem. Phys., 8, 5353–5372, 2008 www.atmos-chem-phys.net\/8\/5353\/2008\/\n"}