{"doi":"10.1007\/s002850050135","coreId":"96877","oai":"oai:generic.eprints.org:455\/core69","identifiers":["oai:generic.eprints.org:455\/core69","10.1007\/s002850050135"],"title":"Unravelling the Turing bifurcation using spatially varying diffusion coefficients","authors":["Benson, D. L.","Maini, P. K.","Sherratt, J. A."],"enrichments":{"references":[{"id":791760,"title":"Bifurcating spatially heterogeneous solutions in a chemotaxis model for biological pattern generation.","authors":[],"date":"1991","doi":"10.1016\/S0092-8240(05)80229-0","raw":null,"cites":null},{"id":792189,"title":"Dissipative structure: an explanation and an ecological example.","authors":[],"date":"1972","doi":"10.1016\/0022-5193(72)90090-2","raw":null,"cites":null},{"id":791283,"title":"Multiple eigenvalues lead to secondary bifurcation.","authors":[],"date":"1975","doi":"10.1137\/1017006","raw":null,"cites":null},{"id":791973,"title":"Parameter space for Turing instability in reaction diffusion mechanisms: A comparison of models.","authors":[],"date":"1982","doi":"10.1016\/0022-5193(82)90063-7","raw":null,"cites":null},{"id":791501,"title":"Subcritical transitions to Turing structures.","authors":[],"date":"1993","doi":"10.1016\/0375-9601(93)90655-J","raw":null,"cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1998","abstract":"The Turing bifurcation is the basic bifurcation generating spatial pattern, and lies at the heart of almost all mathematical models for patterning in biology and chemistry. In this paper the authors determine the structure of this bifurcation for two coupled reaction diffusion equations on a two-dimensional square spatial domain when the diffusion coefficients have a small explicit variation in space across the domain. In the case of homogeneous diffusivities, the Turing bifurcation is highly degenerate. Using a two variable perturbation method, the authors show that the small explicit spatial inhomogeneity splits the bifurcation into two separate primary and two separate secondary bifurcations, with all solution branches distinct. This splitting of the bifurcation is more effective than that given by making the domain slightly rectangular, and shows clearly the structure of the Turing bifurcation and the way in which the! var ious solution branches collapse together as the spatial variation is reduced. The authors determine the stability of the solution branches, which indicates that several new phenomena are introduced by the spatial variation, including stable subcritical striped patterns, and the possibility that stable stripes lose stability supercritically to give stable spotted patterns","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/96877.pdf","fullTextIdentifier":"http:\/\/eprints.maths.ox.ac.uk\/455\/1\/81.pdf","pdfHashValue":"204a50270ccadcbc8da2687e85858b1f87297c03","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:455<\/identifier><datestamp>\n      2015-05-29T18:22:31Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4143:4D3932<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.maths.ox.ac.uk\/455\/<\/dc:relation><dc:title>\n        Unravelling the Turing bifurcation using spatially varying diffusion coefficients<\/dc:title><dc:creator>\n        Benson, D. L.<\/dc:creator><dc:creator>\n        Maini, P. K.<\/dc:creator><dc:creator>\n        Sherratt, J. A.<\/dc:creator><dc:subject>\n        Biology and other natural sciences<\/dc:subject><dc:description>\n        The Turing bifurcation is the basic bifurcation generating spatial pattern, and lies at the heart of almost all mathematical models for patterning in biology and chemistry. In this paper the authors determine the structure of this bifurcation for two coupled reaction diffusion equations on a two-dimensional square spatial domain when the diffusion coefficients have a small explicit variation in space across the domain. In the case of homogeneous diffusivities, the Turing bifurcation is highly degenerate. Using a two variable perturbation method, the authors show that the small explicit spatial inhomogeneity splits the bifurcation into two separate primary and two separate secondary bifurcations, with all solution branches distinct. This splitting of the bifurcation is more effective than that given by making the domain slightly rectangular, and shows clearly the structure of the Turing bifurcation and the way in which the! var ious solution branches collapse together as the spatial variation is reduced. The authors determine the stability of the solution branches, which indicates that several new phenomena are introduced by the spatial variation, including stable subcritical striped patterns, and the possibility that stable stripes lose stability supercritically to give stable spotted patterns.<\/dc:description><dc:date>\n        1998<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.maths.ox.ac.uk\/455\/1\/81.pdf<\/dc:identifier><dc:identifier>\n          Benson, D. L. and Maini, P. K. and Sherratt, J. A.  (1998) Unravelling the Turing bifurcation using spatially varying diffusion coefficients.  Journal of Mathematical Biology, 37  (5).   pp. 381-417.      <\/dc:identifier><dc:relation>\n        10.1007\/s002850050135<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.maths.ox.ac.uk\/455\/","10.1007\/s002850050135"],"year":1998,"topics":["Biology and other natural sciences"],"subject":["Article","NonPeerReviewed"],"fullText":"J. Math. Biol. (1998) 37: 381—417\nUnravelling the Turing bifurcation using spatially\nvarying diffusion coefficients\nDebbie L. Benson1,2, Philip K. Maini1,w, Jonathan A. Sherratt3\n1Centre for Mathematical Biology, Mathematical Institute, 24-29 St Giles’, Oxford\nOX1 3LB, UK. e-mail: maini@maths.ox.ac.uk\n2Magdalen College, Oxford, OX1 4AU, UK\n3Department of Mathematics, Heriot-Watt University, Edinburgh EH14 4AS, UK.\ne-mail: J.A. Sherratt@ma.hw.ac.uk\nReceived: 10 January 1996\/Revised version: 3 July 1996\nAbstract. The Turing bifurcation is the basic bifurcation generating\nspatial pattern, and lies at the heart of almost all mathematical models\nfor patterning in biology and chemistry. In this paper the authors\ndetermine the structure of this bifurcation for two coupled reaction\ndiffusion equations on a two-dimensional square spatial domain when\nthe diffusion coefficients have a small explicit variation in space across\nthe domain. In the case of homogeneous diffusivities, the Turing\nbifurcation is highly degenerate. Using a two variable perturbation\nmethod, the authors show that the small explicit spatial inhomogeneity\nsplits the bifurcation into two separate primary and two separate\nsecondary bifurcations, with all solution branches distinct. This split-\nting of the bifurcation is more effective than that given by making the\ndomain slightly rectangular, and shows clearly the structure of the\nTuring bifurcation and the way in which the various solution branches\ncollapse together as the spatial variation is reduced. The authors\ndetermine the stability of the solution branches, which indicates that\nseveral new phenomena are introduced by the spatial variation, includ-\ning stable subcritical striped patterns, and the possibility that stable\nstripes lose stability supercritically to give stable spotted patterns.\nKey words: Turing bifurcation — Reaction diffusion — Weakly non-\nlinear — Pattern formation\nw Author for correspondence\n1 Introduction\nThe Turing bifurcation (Turing, 1952) is the basic bifurcation generat-\ning spatial pattern, and lies at the heart of almost all mathematical\nmodels for patterning in embryology, ecology and elsewhere in biology\nand chemistry (see Murray, 1989, for review). The key idea underlying\nthe Turing mechanism is that a homogeneous equilibrium can be\nstable to homogeneous perturbations, but unstable to certain spatially\nvarying perturbations, leading to a spatially varying steady state, that\nis, a spatial pattern. The simplest system to consider mathematically is\nthat originally treated by Turing (1952), namely two coupled reaction-\ndiffusion equations in which the interacting chemicals have different\ndiffusion coefficients. For suitable reaction kinetics, as the ratio of\ndiffusion coefficients increases from unity, for example, there is a criti-\ncal value at which the uniform steady state becomes unstable to\na particular spatial mode; this is a Turing bifurcation.\nEarly work on the Turing mechanism focussed on using linear\nanalysis to predict the form of spatial patterns and their implications in\na range of applications (Murray, 1981, 1982; Gierer and Meinhardt,\n1972; Segel and Jackson, 1972). More recently, in parallel with con-\ntinued work on applications (Meinhardt, 1993; Nagorcka, 1995a,b;\nSherratt, 1995), there has been considerable interest in the mathemat-\nical nature of the Turing bifurcation. Following the majority of\nworkers, we will consider this in the context of a square domain with\nzero flux (Neumann) boundary conditions. In this case, the uniform\nsteady state may bifurcate to either a striped or a spotted type spatial\npattern. In particular, when the primary bifurcation point is degener-\nate, there exist three distinct solution branches bifurcating from the\nuniform steady state, each of which represents two solutions that are\nidentical except for having the opposite polarity. One represents\nstriped solutions parallel to the x-axis, another striped solutions\nparallel to the y-axis and the final one represents spotted solutions\nwith pattern in both the x and the y directions. When interpreted as\npatterns using a threshold level for pigmentation, for example, these\nsolution branches correspond to stripes parallel to one pair of edges of\nthe domain, stripes in the perpendicular direction, and a spotted\npattern.\nAn important question concerning these multiple solution\nbranches is their stability as reaction-diffusion solutions. Standard\nnon-linear bifurcation analysis (Sattinger, 1972) shows that the selec-\ntion of stripes versus spots is dependent on the non-linear terms in the\nreaction kinetics and therefore may not be predicted from the lin-\nearised model equations (Ermentrout 1991; Lyons and Harrison, 1991,\n382 D. L. Benson et al.\n1992). In particular, it can be shown that stable spotted and stable\nstriped solutions cannot coexist (Ermentrout, 1991).\nThe degeneracy of the Turing bifurcation makes it difficult to study\nmathematically. One obvious approach to removing this degeneracy is\nto consider a rectangular rather than a square domain (see, for\nexample, Maini et al., 1991, where this is done for a chemotactic\npattern generator), which splits the bifurcation in a manner that we will\ndiscuss in detail later in the paper. However, our main focus is an\nalternative and rather less obvious method of splitting the bifurcation,\nnamely to consider the case in which the diffusion coefficients are\nexplicitly dependent on space, and vary slowly across the domain,\nparallel to one pair of edges. The explicit dependence of diffusion rates\non space is important in some applications, including in particular the\ndevelopment of cartilage pattern in the embryonic chick limb (Maini\net al., 1992; Benson et al., 1993), but in the present paper we will be\nconcerned with the mathematical implications for the structure of the\nTuring bifurcation. We will show that the introduction of spatial\nvariation in diffusivities provides a highly effective way of splitting the\nbifurcation, more effective than the use of a rectangular domain. We\nwill use this technique to derive bifurcation diagrams in which the\nvarious solution branches are clearly separated, leading to a clear\npicture of the structure of the Turing bifurcation. In addition, we will\nshow that a number of new phenomena are introduced by the spatial\nvariation, including stable subcritical Turing patterns.\n2 Mathematical framework\nWe investigate the effects of slow spatial variations in the diffusion\ncoefficients of two interacting morphogens, with concentrations\nu(x, y, t) and v(x, y, t). We consider, in particular, spatially heterogen-\neous steady state solutions of the non-dimensionalised reaction diffu-\nsion system\n+ · (D(x, g) +u)#F(u, v)\"Lu\/Lt (2.1a)\nk+ · (D(x, g)+v)#G (u, v)\"Lv\/Lt , (2.1b)\ndefined on the unit square 0(x , y(1 with zero flux boundary\nconditions. We consider the case in which D(x, g) is a function of the\nperturbation parameter g and the spatial variable x, and to be specific\nwe consider the case\nD (x, g)\"D#gx2 (2.1c)\nUnravelling the Turing bifurcation 383\nwhere D is a positive constant. Crucially, LD\/LxP0 as gP0; other-\nwise there is no special significance in the form (2.1c), and we focus on\na particular spatial dependence to enable explicit calculation of the\nvarious terms in the expansions near bifurcation points. In (2.1),\n+\"(L\/LxL\/Ly ). We take k, the ratio of diffusion coefficients, to be the\nbifurcation parameter. Standard linear analysis shows that, for par-\nticular kinetics F and G and with g\"0, there is a critical value k\nc\nof\nk at which the uniform steady state loses linear stability. When the\nuniform steady state is linearly unstable to a single mode, with unique\nwavenumber, standard bifurcation theory (Sattinger, 1972) shows that\nclose to the bifurcation point there exists a family of analytic solutions\nof the form\nA\nu (x)\nv (x)B\"A\nu\n0\nv\n0\nB#eA\nu\n1\n(x)\nv\n1\n(x)B#e2A\nu\n2\n(x)\nv\n2\n(x)B#O(e3) (2.2a)\nk\"k\nc\n#eq\n1\n#e2q\n2\n#O(e3) , (2.2b)\nwhere x\"(x, y) , (u\n0\n, v\n0\n) is the uniform steady state, and DeD@1. Substi-\ntuting (2.2) into the full nonlinear system (2.1) and equating powers of\ne determines the functions u\ni\n, v\ni\nand the values of q\ni\n. This leads to an\napproximate solution of the weakly nonlinear problem (Iooss and\nJoseph, 1980).\nOur work in this paper deals entirely with the particular spatial\ndependence (2.1c) for the diffusion coefficients. An important related\nproblem is to consider the effects of small, irregular variations in\ndiffusivity or domain geometry, such as would occur in any real\nbiological system to which one might apply the Turing theory. Al-\nthough the results we will describe have no formal implications for this\ncase, they do suggest the intuitive possibility that such variations might\nhave a significant effect on the bifurcation structure.\nFor small non-zero g, we will show that the bifurcation structure of\nthe non-linear system may be found using a two parameter perturba-\ntion technique (Bauer et al., 1975), wherein primary (and certain\nsecondary) solution branches are expressed as asymptotic expansions\nin the two small parameters, g and e.\nIn this case,\nA\nu(x)\nv(x)B\"A\nu\n0\nv\n0\nB#e A\nu\n1\n(x, g)\nv\n1\n(x, g)B#e2A\nu\n2\n(x, g)\nv\n2\n(x, g)B#O(e3) (2.3a)\nk\"k\nB\n(g)#eq\n1\n(g)#e2q\n2\n(g)#O(e3) (2.3b)\n384 D. L. Benson et al.\nwhere for each i\"1, 2, 2\nA\nu\ni\n(x, g)\nv\ni\n(x, g)B\"A\nu0\ni\n(x)\nv0\ni\n(x)B#gA\nu1\ni\n(x)\nv1\ni\n(x)B#g2A\nu2\ni\n(x)\nv2\ni\n(x)B#O (g3)\nq\ni\n(g)\"q0\ni\n#gq1\ni\n#g2q2\ni\n#O (g3)\nand k\nB\n(g) is the primary bifurcation point. For small non-zero g, we\nassume that k\nB\n(g) lies close to k\nc\nand may be expressed as a power\nseries in g,\nk\nB\n(g)\"k\nc\n#gw\n1\n#g2w\n2\n#O (g3) . (2.4)\nFollowing standard techniques (Iooss and Joseph, 1980) we scale\ne such that\nDD (u\n1\n, v\n1\n) DD\"1, S(u\n1\n, v\n1\n), (u\n2\n, v\n2\n)T\"0 , (2.5a)\nDD (u1\n1\n, v1\n1\n) DD\"1, S(u0\n1\n, v0\n1\n), (u1\n1\n, v1\n1\n)T\"0 , (2.5b)\nto obtain a unique expression for each solution branch; here the inner\nproduct is taken as the integral over the unit square domain of the\nscalar product of the two vectors.\nWe will show that substituting these expansions into (2.1) and\nsolving the resulting equations to leading order indicates a splitting of\nthe degenerate bifurcation point k\nc\nwhen g90, giving two simple\nprimary bifurcation points and a secondary bifurcation point, which\nlies on one of the primary solution branches. When g is small the\nsecondary bifurcation point, k\nS\n(g), lies close to the primary bifurcation\npoint and steady state solutions of the model equations (2.1) may be\nwritten in terms of their displacement from the primary solution\nbranch. In particular, following Mahar and Matkowsky (1977), we\nwrite the solutions on the secondary branch (denoted uN , vN ) as\nAuN (x, d, g)vN (x, d, g)B\"AuP(x, g)v\nP\n(x, g)B#d AuN 1(x, g)vN\n1\n(x, g)B#d2AuN 2 (x, g)vN\n2\n(x, g)B#O(d3) (2.6a)\nk\"k\nS\n(g)#dl\n1\n(g)#d2l\n2\n(g)#O(d3) (2.6b)\nwhere for each i\"1, 2, 2\nAuN i(x, g)vN\ni\n(x, g)B\"g1@2AuN 1i (x)vN 1\ni\n(x)B#gAuN 2i (x)vN 2\ni\n(x)B#O(g3@2) ,\nl\ni\n(g)\"l0\ni\n#g1@2l1\ni\n#gl2\ni\n#O(g3@2) .\nHere u\nP\n(x, g) denotes the solution vector on the primary bifurcation\nbranch at the point k\"k\nS\n(g) at which the secondary bifurcation\nUnravelling the Turing bifurcation 385\noccurs. We assume that this secondary bifurcation point corresponds\nto a value e\nB\n(g) of the parameter e, which depends on g according to the\nrelation\ne\nB\n\"g1@2e\n1\n#g1e\n2\n#O(g3@2) , (2.7)\nFig. 1. A schematic representation of the bifurcation diagram for pattern formation in\nthe system (2.1) when there is a small spatial variation in the diffusion coefficient,\nparameterised by g;1. The form of this bifurcation diagram is derived in Sects. 3 and\n4; stability, which is not shown in this figure, is discussed in Sect. 5. In the spatially\nhomogeneous case (g\"0) the Turing bifurcation is highly degenerate; this figure\nillustrates how the various solution branches separate when spatial inhomogeneity is\nintroduced. The bifurcation point splits into two separate primary bifurcation points,\nk\"kx\nB\nand k\"ky\nB\n, and a secondary bifurcation point k\nS\n. Moreover, the pairs of\nsolution branches, which are coincident when g\"0, separate for non-zero g. As\nillustrated schematically, the primary solution branches correspond to striped pat-\nterns, and the secondary solution branches correspond to spotted patterns. In these\nschematic illustrations of pattern type, the x-axis of the square domain runs across the\npage, and the y-axis runs up the page. On the figure, the dependence of the various\nbranch separations on g are indicated. These are all calculated in the text, although it\nshould be noted that the separation of the two primary solution branches emerging\nfrom ky\nB\nhas not be determined beyond showing that there is no term that is <g2 . All\nthe other separations have been determined so that the indicated separations are strict\norder of magnitude dependencies on g\n386 D. L. Benson et al.\nwhere e\n1\n, e\n2\n, 2 are real and e190. Here, without loss of generality,\ng is assumed positive. In this case, the solutions (2.6) become power\nseries expansions in the perturbation parameter g and the small para-\nmeter d, which is a measure of the distance from the secondary\nbifurcation point. The unknowns, uN j\ni\n, l j\ni\nand e\ni\nmay therefore be\ndetermined by substituting the power series expansions into the model\nequations and collecting terms of equal power in g and d. The method\nof analysis is completely analogous to the determination of the primary\nsolution branches.\nFigure 1 shows a schematic representation of the bifurcation struc-\nture when g90. The stability of the various solutions in this structure\ncan be determined in a standard way, and we will discuss the results of\nthis study in Sect. 5.\nTo be specific, in the numerical simulations illustrated in this paper\nwe will use the standard non-dimensionalised Schnakenberg kinetics\n(Schnakenberg, 1979)\nF(u, v)\"! (A!u#vu2) and G (u, v)\"!(B!vu2) , (2.8)\nwhere !, A and B are positive parameters. However, the analytical\nresults are quite general.\n3 Primary solution branches\nSubstituting the power series expansions (2.3) into the model equations\n(2.1) we first collect terms of O(e) and equate them to zero. For g\"0,\nthis leads to the linearised system for spatially homogeneous diffusion\ncoefficients. We assume that this system admits a single unstable\nwavenumber, denoted by k\nc\n. The general solution for (u1\n1\n, v1\n1\n) (recalling\nthe zero flux boundary conditions) may therefore be written in the form\n+\niÈ`jÈ\/k#È\n(Cu\ni, j\n, Cv\ni, j\n) cos(inx) cos ( jny) for some suitably defined con-\nstants Cu\ni, j\nand Cv\ni, j\n. However, since the domain may be rescaled such\nthat k2\nc\n\"1 (Ermentrout, 1991) we assume that the first unstable\nwavenumbers are (i\"1, j\"0) and (i\"0, j\"1). Together with the\nnormalisation condition, D (u0\n1\n, v0\n1\n) D2\"1, this implies that\nAu01v0\n1\nB\"A1mBCx cos(nx)#Cy cos(ny) , (3.1)\nwhere\nm\"Dn2!Fu\nF\nv\n, (3.2)\nand\nC2\nx\n#C2\ny\n\"C2, 2\n1#m2 . (3.3)\nUnravelling the Turing bifurcation 387\nHere F\nu\ndenotes LF\/LuD\n(uÒ,vÒ)\nand we extend this notation in the obvious\nway, so that for example G\nuv\ndenotes L2G\/LuLvD\n(uÒ,vÒ)\n.\nEquating terms to O(g) and using the Fredholm Alternative yields\nthe solvability conditions\nw\n1\nDmpn2\n2\nC\nx\n#(1#k\nc\nmp)A\nn2\n6\n!1\n4BCx\"0 ,\nand\nw\n1\nDmpn2\n2\nC\ny\n#(1#k\nc\nmp)\nn2\n6\nC\ny\n\"0 ,\nwhere p\"(Dn2!F\nu\n)\/G\nu\n. Recall that the constant w\n1\nappears in the\nexpansion of k\nB\n(g), defined in equation (2.4). Thus, for a solution to\nexist, the unknowns C\nx\n, C\ny\nand w\n1\nmust satisfy either\nC2\nx\n\"C2, C\ny\n\"0, w\n1\n\"wx\n1\n,!2(1#kcmp)\nDmpn2 A\nn2\n6\n!1\n4B (3.4a)\nor\nC\nx\n\"0, C2\ny\n\"C2, w\n1\n\"wy\n1\n,!2(1#kcmp)\nDmpn2 A\nn2\n6 B . (3.4b)\nThis implies that the degenerate bifurcation point for g\"0, at k\"k\nc\n,\nhas split into two simple primary bifurcation points given by\nkx\nB\n\"k\nc\n#gwx\n1\n#O (g2) (3.5a)\nky\nB\n\"k\nc\n#gwy\n1\n#O (g2) . (3.5b)\nNote that the splitting of multiple primary bifurcation points in the\npresence of small non-zero parameters has been observed for a number\nof other systems (see, for example, Bauer et al. (1975) and Reiss (1983)).\nHunding and Br+ns (1990) also reported this phenomenon in their\nstudy of the effects of spatial variation in a three-dimensional reaction\ndiffusion model of cell division during early embryonic development.\n3.1 The branch bifurcating at kx\nB\nWe now proceed to determine leading order power series approxima-\ntions to the primary solution branches bifurcating from each of kx\nB\nand ky\nB\n. First we consider the family of solutions M(u(x, e, g), v (x, e, g)),\nk(e, g)N bifurcating from the primary bifurcation point kx\nB\n, defined in\n(3.5a). From equations (3.1) and (3.4a) it follows that\nA\nu0\n1\n(x)\nv0\n1\n(x)B\"A\n1\nmBC cos(nx)\n388 D. L. Benson et al.\nwhere m and C are defined by equations (3.2) and (3.3) respectively. We\ncan then determine (u1\n1\n, v1\n1\n) (see Appendix 1) and hence approximate the\nprimary solution branch by\nA\nu\nvB\"A\nu\n0\nv\n0\nB#eCAA\n1\nmBcos(nx)#g+\ni\nA\nau\ni\nav\ni\nB cos(inx)D#\nhigher\norder\nterms\n(3.6a)\nk\"kx\nB\n(g)#egq1\n1\n#e2q0\n2\n#higher order terms , (3.6b)\nwhere au\ni\nand av\ni\n(i\"1, 2, 2) are constants. Here our notation is as\ndescribed in Sect. 2, with qj\ni\ndenoting the coefficient of eigj in the\nexpansion of k. In fact the parameter q0\n2\nplays a key role in the\nbifurcation structure, and we will denote it henceforth as qx\n2\n, to\ndistinguish it from the coefficient of e2 in another expansion, to be\nintroduced later.\nTo leading order, the above approximation depends only on the\nspatial variable x. It may be shown by induction that the whole power\nseries expansion is independent of the spatial variable y, and thus that\nthe primary solution branch is quasi-one-dimensional. In particular,\nthis implies that (3.6) are power series expansions for steady state\nsolutions of the one-dimensional reaction diffusion system\nL\nLx\nD (x, g)\nLu\nLx\n#f (u, v)\"Lu\nLt\n(3.7a)\nk\nL\nLx\nD(x, g)\nLv\nLx\n#g(u, v)\"Lv\nLt\n. (3.7b)\nThe solutions of (3.7) have spatially varying wavelengths of oscillation,\nand the asymmetry in wavelength increases with the spatial variation\ninD (Benson et al., 1993). Figure 2 compares the analytical approxima-\ntions (3.6) for u with numerical solutions of (3.7) for Schnakenberg\nkinetics (2.8).\nThere is good qualitative agreement between the solutions for all\nD g D, D e D(1, but good quantitative agreement holds only when the\nsystem is close to the bifurcation point and D g D;1. As expected, for\nvalues of D g D;1, the variations in pattern wavelength and amplitude\nare small and are thus hard to detect in numerical simulation, but the\nspatial asymmetry becomes clearly visible as g is increased.\nFigure 2c compares the approximation for u in two spatial dimen-\nsions. Since the primary solutions depend only on the spatial variable\nx, they predict spatial patterns which represent stripes perpendicular to\nUnravelling the Turing bifurcation 389\nFig. 2. A comparison of the truncated form of the power series approximations (3.6)\nwith numerical solutions of (3.7) for Schnakenberg kinetics (2.8). The parameter values\nused were (a) g\"0.01, A\"0.2, B\"0.8, C\"30, k\"15, D\"1 and (b) g\"\n0.75 A\"0.1, B\"0.9, C\"464, k\"464, D\"1. For these values (a) kx\nB\n\"14.9252,\nk\nc\n\"1 (as in the text) and (b) kx\nB\n\"8.5556, k\nc\n\"4. The analytical solutions are plotted\nas functions of x at an arbitrary value of y. The numerical solutions were found by\nsolving (3.7) with the NAG routine D03PGF, which converts the equations to a system\nof coupled odes using the method of lines, and then solves these using Gear’s method\nthe x axis. Moreover, since pattern wavelength is asymmetric in the\nx direction, the width of the stripes may vary within the domain; of\ncourse, this only applies when k\nc\n’1, so that there is more than one\nstripe. The spatial variation in the width of the stripes is barely visible\nfor D gD;1 but becomes significant as D gD increases.\nUsing the truncated power series solutions, it is possible to con-\nstruct a bifurcation diagram of the primary solution branch bifurcating\nfrom kx\nB\nfor a given set of parameter values. The theoretical diagram is\nconstructed by calculating the possible values e from the equation\n(3.6b) and substituting these values into the expression (3.6a). At each\nvalue of k, the real parameter e may assume one of the two values\ne` and e~, given by\neB\"!gq11$M(gq11)2#4qx2 (k!kxB)N1@2\n2qx\n2\n(3.8)\n390 D. L. Benson et al.\nFig. 3. A comparison of bifurcation diagrams constructed from the truncated power\nseries approximations (left) from (3.6) with those produced by AUTO (right). The\nparameter values used are as in Fig. 2(a) with the exception that in (a) g\"0.05 and\n(b) g\"0.5. In this case, our analysis predicts that (a) k\nB\n+k\nL\nwith value 15.0028, and\nin (b) k\nB\n\"15.878, k\nL\n\"15.875. In turn AUTO predicts that in (a) k\nB\n+k\nL\nwith value\n15.006 and in (b) k\nB\n\"16.194, k\nL\n\"16.1649\nThus the power series expansion (3.6) represents two solutions\nu(x, e`, g) and u (x, e~, g) of different magnitude, and on the bifurcation\ndiagram (Fig. 3), where we plot k against the maximum value of\nDDu(x, e, g) DD, there will appear two distinct arms of the primary solution\nbranch. This separation of the branches when g90 represents an\nadditional splitting of the Turing bifurcation in comparison to the case\ng\"0, when the two branches are coincident, representing identical\npatterns but with opposite polarity. In practice, the difference between\nDDu(x, e~, g) DD and DDu(x, e`, g) DD is barely visible at very small values of g,\nbut as the magnitude of g increases, the two arms of the primary\nsolution branch may be distinguished in numerical simulations.\nUnravelling the Turing bifurcation 391\nWhen qx\n2\n’0, one arm is supercritical but the other has a small\nsubcritical region. On this second arm, the point k\"k\nL\n, e\"e\nL\n, where\nk\nL\n\"k\nB\n!(gq1\n1\n)2\/(4qx\n2\n) and e\nL\n\"!gq1\n1\n\/(2qx\n2\n), represents a simple limit\npoint at which the branch changes direction. This implies that for each\nk 3 [k\nL\n, kx\nB\n] there exist two subcritical solutions lying on the same arm\nof the primary solution branch, whilst for each k’kx\nB\nthere exist two\nsupercritical solutions lying on different arms. A similar result holds\nwhen qx\n2\n(0. Thus, for g90, the uniform steady state undergoes\na transcritical bifurcation at the point kx\nB\n. This contrasts to the case\ng\"0, where the uniform steady state undergoes a pitchfork bifurca-\ntion, and primary solution branches represent stripes perpendicular to\nthe x axis which are supercritical when qx\n2\n’0 and subcritical when\nqx\n2\n(0 (see later).\nSince the primary solution branch bifurcating from kx\nB\nis quasi-one-\ndimensional we may compare our theoretical bifurcation diagram with\none produced by the numerical package AUTO (Doedel, 1986), which\nlocates the bifurcation and limit points of a partial differential equation\nsystem defined in one spatial dimension and constructs the associated\nsolution branches by a pseudo arc length continuation method. A com-\nparison of the bifurcation diagrams is illustrated in Fig. 3, where the\nbifurcation parameter k is plotted against the maximum amplitude of\nDDu(x, y) DD. Again, there is good qualitative agreement for all 0(DgD(1\nand 06DeD(1, but only good quantitative agreement when the system\nis close to the bifurcation point (i.e. e;1 and DgD;1). In particular,\nthese numerical results confirm that in contrast to the case g\"0, there\nare stable subcritical striped solutions (Fig. 4). This is discussed in\nmore detail in Sect. 5, when we consider the stability of the solution\nbranches.\n3.2 The branch bifurcating at ky\nB\nSimilar analysis can to used to calculate the power series expansions\nfor the primary solution branch bifurcating from ky\nB\n(see Appendix 1 for\ndetails) and we find that\nA\nu\nvB\"A\nu\n0\nv\n0\nB#eCAA\n1\nmBcos(ny)\n#g +\ni\nAbuibv\ni\nB cos (inx)cos(ny)D#\nhigher\norder\nterms\n(3.9a)\nk\"ky\nB\n(g)#e2qx\n2\n#higher order terms , (3.9b)\n392 D. L. Benson et al.\nFig. 4. An example of a subcritical stable steady solution of (2.1) represented in one\nand two spatial dimensions. The solution on the right was obtained by numerical\nsolution of (3.7), on the interval [0, 1], with the NAG routine D03PGF. The solution\non the left was found by solving the full non-linear reaction diffusion system (2.1) on the\nunit square using a finite difference scheme to obtain a system of algebraic equations\nwhich were solved by an alternating direction implicit (ADI) method. The analysis\npresented in Appendix 2 predicts that this pattern is stable. In this example,\nSchnakenberg kinetics were used with parameter values as in Fig. 1(a) except that\ng\"1.2 and k\"19.06. AUTO predicts k\nB\n\"19.2443 and k\nL\n\"18.9987. Since the\nuniform steady state is also stable in this parameter range, initial conditions close to\nthe theoretically predicted pattern were used to generate the solution\nwhere bu\ni\n, bv\ni\n(i\"1, 2, 2) are constants. Again we replace the coeffic-\nient q0\n2\nof e2 by qx\n2\n, since detailed calculation (see Appendix 1) shows\nthat the coefficient of e2 here is the same as that in the expansion (3.6b)\nat kx\nB\n, namely qx\n2\n, whose value is given in (A.5) in Appendix 1. For g90\nit is seen that the power series expansion is dependent on both spatial\nvariables and, in general, has no planes of symmetry. However, the\nx-dependence lies in a O(eg) term, that is of a lower order of magnitude\nthan the x-independent O (e) term as gP0. Therefore, the truncated\nform of the power series approximation predicts stripes perpendicular\nto the y axis whose spatial variation is O(g) as gP0. Typical examples\nare illustrated in Fig. 5.\nAs before, there is good qualitative agreement between the solu-\ntions for all 0(D g D(1 and 06D e D(1, but the quantitative agree-\nment is best close to the bifurcation point (e;1), when D g D;1. In this\ncase, the asymmetries introduced into the wavelength and amplitude\nare small and barely visible in simulations. As the magnitude of\ng increases, however, significant spatial asymmetry may be observed in\nthe spatial patterns. Again, the pattern variation is captured by the\ntruncated solutions in this case, since the terms egu1\n1\nand eu0\n1\nare\ncomparable.\nUsing (3.9), the bifurcation diagram for the primary solution\nbranch bifurcating from ky\nB\nmay also be constructed. For each value of\nUnravelling the Turing bifurcation 393\nFig. 5. Typical spatial patterns predicted by the truncated power series approxima-\ntions when the threshold concentration is chosen to be u(x, y)\"u\n0\n. The parameter\nvalues used were (a) A\"0.2, B\"0.8, C\"30, k\"15, D\"1, g\"0.05 and\n(b) A\"0.1, B\"0.9, C\"464, k\"9, D\"1, g\"0.5. For these values\n(a) ky\nB\n\"14.9286, k\nc\n\"1 and (b) ky\nB\n\"8.5558, k\nc\n\"4 (see text for details)\nFig. 6. Bifurcation diagram constructed from the truncated power series approxima-\ntions (3.9). The parameter values used are as in Fig. 5(a). Our analysis predicts that\nky\nB\n\"14.9286. The infinite series in i was calculated by summing the first 20 terms, on\nthe basis that the next 20 terms make a negligible additional contribution\nk, e takes one of the two values eB\"$J(k!ky\nB\n)\/qx\n2\n, and thus the\npower series approximations represent two distinct solutions,\nu(x, e`, g) and u(x, e~, g). However, these two solutions differ only by\na phase difference to first order, and thus on the bifurcation diagram\n(Figure 6) where we plot k against the maximum of DDu (x, e, g) DD, the two\nbranches are represented by a single curve. Note the contrast between\nthis present case, where the two primary branches differ only at O(e2),\nand the bifurcation at kx\nB\n, where the two bifurcating branches differ at\nO(e). For qx\n2\n’0 the solution branches are supercritical and for qx\n2\n(0\nthey are subcritical (cf. the primary solution branch bifurcating\nfrom kx\nB\n). Figure 6 illustrates our theoretical bifurcation diagram for\na given set of parameters.\n394 D. L. Benson et al.\n3.3 Primary bifurcations when g\"0\nTo compare the primary bifurcation structure when g90 with\nthat when g\"0, that is, the case of spatially homogeneous coefficients,\nwe have used the above technique to show that when g\"0 there are\nthree distinct primary solution branches bifurcating from k\nc\nof the\nform:\nA\nu\nvB\"A\nu\n0\nv\n0\nB#eA\n1\nmBC cos(nx)\n#e2GAaua\nv\nB\niC2cos(2nx)\n2\n#Abub\nv\nB\niC2\n2 H#O (e3)\nk\"k\nc\n#e2qx\n2\n#O(e3) , (3.10)\nwhich represents stripes perpendicular to the x axis,\nAuvB\"Au0v\n0\nB#eA1mBC cos(ny)\n#e2GA\na\nu\na\nv\nB\niC2cos(2ny)\n2\n#A\nb\nu\nb\nv\nB\niC2\n2 H#O (e3)\nk\"k\nc\n#e2qx\n2\n#O(e3) , (3.10b)\nwhich represents stripes perpendicular to the y axis, and\nA\nu\nvB\"A\nu\n0\nv\n0\nB#eA\n1\nmBCxcos(nx)#Cycos(ny))\n#e2GAaua\nv\nB\ni(C2\nx\ncos(2nx)#C2\ny\ncos(2ny))\n2\n#A\nb\nu\nb\nv\nB\ni (C2\nx\n#C2\ny\n)\n2\n#A\nc\nu\nc\nv\nBCxCycos(nx)cos(ny)H#O(e3)\nk\"k\nc\n#e2qxy\n2\n#O(e3) (3.10c)\n(C2\ny\n#C2\nx\n\"C2) which represents spotted solutions. Here i\"\n1\n2\nF\nuu\n#F\nuv\n, and the constants a\nu\n, a\nv\n, b\nu\n, b\nv\n, c\nu\nand c\nv\nare defined in\nAppendix 1. Recall that, without loss of generality, we assume that\nk\nc\n\"1. Strictly speaking the last power series expansion represents two\nUnravelling the Turing bifurcation 395\ndistinct solution branches, one for which C\nx\n\"C\ny\nand the other for\nwhich C\nx\n\"!C\ny\n. The parameter qxy\n2\n, which is in general non-zero, is\ndefined by the equation\nDmpn2qxy\n2\n2\n#(!1#p) iC2\n2\n(F\nuu\n#mF\nuv\n)A\na\nu\n8\n#bu\n2\n#cu\n2B\n#(!1#p)iC2\n2\nF\nuv A\na\nv\n8\n#bv\n2\n#cv\n2B#(!1#p)Fuuv\n9C2\n16\n\"0 (3.11)\nThe power series expansions above are in agreement with the well\nknown fact that, in the case of constant diffusion coefficients and\nzero flux boundary conditions, the uniform steady state undergoes\na pitchfork bifurcation. In particular, striped solution branches are\nsupercritical when qx\n2\n’0 and subcritical when qx\n2\n(0, whilst the spot-\nted solution branches are supercritical when qxy\n2\n’0 and subcritical\nwhen qxy\n2\n(0. Thus, in contrast to the case g90, there are no tran-\nscritical bifurcations.\nComparing equations (3.6) and (3.10a), it is clear that the solution\nbranch bifurcating from kx\nB\nwhen g90 represents a perturbation from\nthe striped solution branch perpendicular to the x axis when g\"0.\nSimilarly, the solution branch (3.9) bifurcating from ky\nB\nwhen g90\nrepresents a perturbation from the striped solution branch (3.10b)\nperpendicular to the y axis when g\"0. Moreover, our analysis shows\nin detail how the different bifurcation points and branches collapse as\ngP0 to give the degenerate structure described above (see Fig. 1).\nHowever, when g90, there is no primary solution branch analogous\nto the spotted solution branch (3.10c) when g\"0. In the following\nsection we show that this is due to a further splitting of the primary\nbifurcation point so that spots arise as secondary bifurcations from\nprimary striped solution branches.\n4 Secondary bifurcations\nIn this section we determine secondary bifurcations of the model\nsystem (2.1) which occur close to the primary bifurcation points kx\nB\nand\nky\nB\nusing the method outlined in Sect. 2. We recall from (2.6) our\nnotation that u\nP\n(x, g) represents the solution on the primary solution\nbranch at the point at which a secondary bifurcation occurs, namely\nk\"k\nS\n(g) or equivalently e\"e\nB\n(g). When the secondary bifurcation\npoint lies on the primary solution branch bifurcating from kx\nB\n, the\n396 D. L. Benson et al.\nsolution is\nA\nux\nP\n(g)\nvx\nP\n(g)B\"A\nu\n0\nv\n0\nB#g1@2A\n1\nmBC e1cos(nx)\n#gAaua\nv\nB\niC2e2\n1\ncos(2nx)\n2\n#gAcuc\nv\nB\niC2e2\n1\n2\n#g A1mBCe2cos(nx)#O (g3@2) (4.1a)\nwith\nkx\nS\n(g)\"k\nc\n#g (wx\n1\n#qx\n2\ne2\n1\n)#O(g3@2) , (4.1b)\nand when it lies on the solution branch bifurcating from ky\nB\n, it is\nAu\ny\nP\n(g)\nvy\nP\n(g)B\"Au0v\n0\nB#g1@2A1mBCe1cos(ny)#gAaua\nv\nB\niC2e2\n1\ncos(2ny)\n2\n#gAcuc\nv\nB\niC2e2\n1\n2\n#g A1mBCe2cos(ny)#O (g3@2) (4.2a)\nwith\nk\nS\n(g)\"k\nc\n#g (wy\n1\n#qx\n2\ne2\n1\n)#O (g3@2) . (4.2b)\nHere the constants e\n1\nand e\n2\nare coefficients of powers of g1@2 in the\nexpansion (2.7) of e\nB\n(g); these constants remain to be determined. The\nvarious other constants were defined during the determination of the\nprimary solution branch (Sect. 3 and Appendix 1).\nIn the power series expansion (2.6) of the secondary solution\nbranch, the variable d is analogous to the parameter e along the\nprimary solution branches. In particular, d provides a measure of the\ndistance from k\nS\nand is scaled such that\nDD (uN 1\n1\n, vN 1\n1\n) DD\"1, S(uN 1\n1\n, vN 1\n1\n), (uN 1\n2\n, vN 1\n1\n)T\"0 . (4.3)\nWith this choice of scaling, however, d is singular at g\"0. Thus, in\ncontrast to the power series expansions for the primary solution\nbranches, analytical approximations of the form (2.6) only exist for\nnon-zero g. This reflects the fact that for g\"0, secondary bifurcations\ndo not generally occur close to the primary bifurcation point, so that\nsecondary solution branches may not be written in terms of their\ndisplacement from a small amplitude primary solution, as in the power\nseries expansions (2.6). There may be other choices for the para-\nmeterisation of the secondary solution branches which are non-singu-\nlar as gP0, but for g90, the d and g expansion (2.6) is the most\nnatural parameterisation of the secondary solution branch, and is thus\nthe one we use.\nUnravelling the Turing bifurcation 397\nFirst we consider the secondary bifurcation points which lie along\none of the primary solution branches bifurcating from kx\nB\n. At O(dg1@2),\nwe have\nAuN 11vN 1\n1\nB\"A1mB (Cx cos(nx)#Cy cos(ny)) ,\nwhere (C2\nx\n#C2\ny\n)\"C2\"2\/(1#m2).\nTo O (g), the Fredholm Alternative forces l1\n1\n\"0. In this case\nA\nuN 2\n1\nvN 2\n1\nB\"A\na\nu\na\nv\nB\n2iCe\n1\nC\nx\ncos(2nx)\n2\n#A\nb\nu\nb\nv\nB\n2iCe\n1\nC\nx\n2\n#A\nc\nu\nc\nv\nB2iCe1Cycos(nx)cos(ny) . (34)\nThe value of e\n1\nmay now be determined by collecting the terms at\nO(g3@2). The solvability conditions become (after much tedious algebra)\nC\nx\nDmpn2(wx\n1\n#qx\n2\ne2\n1\n)\n2\n#C\nx\n(1#k\nc\nmp)A\nn2\n6\n!1\n4B\n#C\nx\n(!1#p)iC2e2\n1\nF\nuvA\n3a\nv\n8\n#3bv\n4 B\n#C\nx\n(!1#p)iAC2e21(Fuu#Fuvm)A\n3a\nu\n8\n#3bu\n4 BB\n#C\nx\n(!1#p) 9FuuvmC2e21\n16\n#C\nx\nDmpn2l2\n1\nCe\n1\n\"0 ,\nand\nC\ny\nDmpn2(wx\n1\n#qx\n2\ne2\n1\n)\n2\n#C\ny\n(1#k\nc\nmp)n2\n6\n#C\ny\n(!1#p) iC2e2\n1\nF\nuvA\nb\nv\n4\n#cv\n2B\n#C\ny\n(!1#p)iC2e2\n1\n(F\nuu\n#F\nuv\nm)A\nb\nu\n4\n#cu\n2B\n#C\ny\n(!1#p) 3FuuvmC2e21\n8\n\"0 .\nFrom these equations we deduce that either\nC2\nx\n\"C2, C\ny\n\"0, l2\n1\n\"2e\n1\nqx\n2\n, (4.5)\n398 D. L. Benson et al.\nor\nC\nx\n\"0, C2\ny\n\"C2, l2\n1\n\"0 (4.6a)\nand\ne2\n1G(!1#p) [C2(Fuu#Fuvm) A\nb\nu\n4\n#cu\n2B#C2FuvA\nb\nv\n4\n#cv\n2BD\n#3C2Fuuv\n8\n#Dmpn2 qx2\n2 H#\nDmpn2wx\n1\n2\n#(1#kcmp)n2\n6\n\"0 . (4.6b)\nIn the former case (4.5), the value of e\n1\nis undetermined. This is a trivial\ncase, in which the corresponding power series expansion (2.6) repres-\nents the continuation of the primary solution branch beyond the\nsecondary bifurcation point, and may be obtained by replacing e by\ne\n1\n#dg1@2 in our original analytical approximation of the primary\nsolution branch.\nTo determine the secondary bifurcations, we must therefore consider\n(4.6). In this case there exists a secondary bifurcation point of the form\n(2.7) whenever equation (4.6) admits a real, non-zero solution for e\n1\n.\nThis requires (wxÇ~wyÇ)\n2(qxyÈ ~qxÈ)\n’0, where qxy\n2\nis defined by the equation (3.11).\nWhen this condition is satisfied\ne\n1\n\"e\nx\n\"$S\n(wx\n1\n!wy\n1\n)\n2(qxy\n2\n!qx\n2\n)\n, (4.7)\nand equation (2.7) defines two distinct secondary bifurcation points.\nMoreover, since the corresponding values of e have opposite signs,\nthese points lie on separate arms of the primary solution branch, but at\nthe same value of k (at least to this order), namely\nk\"kx\nS\n(g),k\nc\n#gAwx1#\nqx\n2\n(wx\n1\n!wy\n1\n)\n2(qxy\n2\n!qx\n2\n) B (4.8)\nBy a similar analysis, we find that two secondary bifurcation points of\nthe form (2.7) can occur on the primary solution branch bifurcating\nfrom ky\nB\n. In this case, however, we require (wxÇ~wyÇ)2(qxyÈ ~qxÈ)\n(0. Again both\nsecondary bifurcations occur on separate primary solution branches at\nthe same value of k to leading order, which is\nky\nS\n(g)\"k\nc\n#gAwy1#\nqx\n2\n(wy\n1\n!wx\n1\n)\n2(qxy\n2\n!qx\n2\n) B . (4.9)\nThus a secondary bifurcation of the form (2.7) occurs on exactly one of\nthe primary solution branches. Specifically, the secondary bifurcation\npoints lie on the primary solution branch bifurcating from kx\nB\nwhen\nUnravelling the Turing bifurcation 399\n(wxÇ~wyÇ)\n2(qxyÈ ~qxÈ)\n’0 and on the primary solution branch bifurcating from\nky\nB\nwhen (wxÇ~wyÇ)2(qxyÈ ~qxÈ)\n(0. Each of these cases are therefore considered\nseparately.\n4.1 Solutions on the secondary branches\nWe can determine the leading order approximations to the secondary\nsolution branches bifurcating from kx\nS\nand ky\nS\n. We find, after a great\ndeal of tedious algebra, that the power series expansion for the second-\nary solution branch bifurcating from kx\nS\nis given by\nAuvB\"Au0v\n0\nB#g1@2A1mBCexcos(nx)\n#gAaua\nv\nB\niC2e2\nx\ncos(2nx)\n2\n#gAbub\nv\nB\niC2e2\nx\n2\n#O (g3@2)\n#dGg1@2A\n1\nmBCcos(ny)#gA\nc\nu\nc\nv\nBi2C2excos(nx)cos(ny)#O(g3@2)H\n#d2Gg1@2A1mB\nCcos(nx)\n2e\nx\n#gAaua\nv\nBiC2\ncos(2nx)#cos(2ny)\n2\n.\n#gA\nb\nu\nb\nv\nBiC2e2x#O(g3@2) H#O (d3) (4.10a)\nk\"k\nc\n#(wx\n1\n#qx\n2\ne2\nx\n)g#d2g2qxy\n2\n#O(d3) . (4.10b)\nBy a similar analysis we may determine the secondary solution\nbranches bifurcating from ky\nS\n. In this case the power series expansions\nhave the form\nA\nu\nvB\"A\nu\n0\nv\n0\nB#g1@2A\n1\nmBCeycos(ny)\n#gGAaua\nv\nBi\nC2e2\ny\ncos(2ny)\n2\n#Abub\nv\nBi\nC2e2\ny\n2 H#O(g3@2)\n#dGg1@2A\n1\nmBCcos(nx)#gA\nc\nu\nc\nv\nB2iC2eycos(nx)cos(ny)#O(g3@2)H\n#d2Gg1@2A1mB\nCcos(ny)\n2e\ny\n#gAaua\nv\nBiC2\ncos(2nx)#cos(2ny)\n2\n#gA\nb\nu\nb\nv\nBiC2#O (g3@2)H#O (d3)\n400 D. L. Benson et al.\nFig. 7. A comparison of (a) the truncated form of the power series approximations\n(4.11) with (b) numerical solutions of the Schnackenberg model with g\"0.35. The\nparameter values used were A\"0.2, B\"0.8, C\"120, k\"15.74 and D\"1. In this\ncase, ks\nB\n\"14.9323 and k\nc\n\"2\nk\"k\nc\n#(wy\n1\n#qx\n2\ne2\ny\n)g#d2g2qxy\n2\n#O(d3g) (4.11a)\nwhere\ne\ny\n\"$S\n(wy\n1\n!wx\n1\n)\n2(qxy\n2\n!qx\n2\n)\n. (4.11b)\nIn both cases the power series expansions show clearly the expected\ntwo-dimensional nature of the steady state solutions which lie on the\nsecondary solution branches. To compare these analytical expansions\nwith numerically computed solutions of the full non-linear system, we\nuse the power series truncated at O (g1@2d).\nFigure 7 compares these truncated expansions for the concentration\nprofile of u with numerical solutions of the full non-linear system (2.1).\nAs expected, we find that, for the parameter values considered, there\nis reasonable qualitative agreement between the solutions for all\n0(DgD(1 and 06DdD(1, but good quantitative agreement only\nwhen the system is close to the secondary bifurcation point and g;1.\nIn this case, the spatial patterns are dependent almost exclusively on\na single spatial variable. As the magnitudes of DdD , gP1, however,\npattern becomes discernible in both directions. Figure 8 illustrates\ntypical two-dimensional spatial patterns predicted by our analytical\napproximations. These patterns are the analogue of the spotted solu-\ntions generated by reaction diffusion systems with spatially homogene-\nous diffusion coefficients. In this case, however, the spotted solutions\nare asymmetric; the asymmetry being more clearly visible as g in-\ncreases. Using the truncated power series solutions, it is possible to\nconstruct a bifurcation diagram of the secondary solution branches\nUnravelling the Turing bifurcation 401\nFig. 8. Spatial patterns predicted by the truncated power series approximations (4.11)\nwhen the threshold concentration is chosen to be u(x, y)\"u\n0\n. The parameter values\nused were (a) A\"0.2, B\"0.8, C\"30, k\"17.1, D\"1, g\"0.75, and (b) A\"0.1,\nB\"0.9, C\"30, k\"8.57, D\"1, g\"0.05. In (a) k\nc\n\"1, k\nS\n\"kx\nS\n\"16.6461 and in\n(b) k\nc\n\"2, k\nS\n\"kx\nS\n\"8.5677\nTable 1. A comparison of the truncated power series approxima-\ntion for the secondary bifurcation point kx\nS\nwith the values of the\nprimary bifurcation points predicted by our analysis. The trun-\ncated analytic approximations kx\nS\n\"k\nc\n#g(wx\n1\n#e\nx\nqx\n2\n),kx\nB\n\"k\nc\n#gwx\n1\nand kx\nS\n\"k\nc\n#gwy\n1\nare used, with parameter values as in Fig. 9a\ng kx\nS\nkx\nB\nky\nB\n0.0 — 14.9056 14.9056\n0.01 14.9323 14.9251 14.9286\n0.05 15.0391 15.0029 15.0203\n0.1 15.1725 15.10011 15.1349\n0.5 16.2402 15.8669 16.0521\n1.0 17.5746 16.8500 17.1985\nbifurcating from kx\nS\nand ky\nS\n. Table 1 lists typical values of kx\nS\n, kx\nB\nand\nky\nB\npredicted by our analysis.\nOn the bifurcation diagram (Fig. 9), where we plot k against the\nmaximum value of DDu(x) DD, the pairs of both primary and secondary\nsolutions are represented by a single branch, because the value of g is\nsufficiently small that the difference between solution arms are not\nvisible. These diagrams should be compared with the schematic repres-\nentation in Fig. 1. Note that the truncated power series approxima-\ntions predict a pitchfork bifurcation from either kx\nS\nor ky\nS\n. For qxy\n2\n’0\nthe secondary solution branches are supercritical and for qxy\n2\n(0 they\nare subcritical.\n402 D. L. Benson et al.\nFig. 9. Bifurcation diagram constructed from the\ntruncated power series approximations showing\nprimary and secondary solution branches. (For\nclarity only one primary solution branch is\nillustrated.) The parameter values used are as in\nFig. 9(a) with the exception that g\"0.01. In this\ncase the secondary bifurcation points lie on the\nprimary solution branches bifurcating from kx\nB\n,\nand has value kx\nS\n\"14.9323. Our analysis predicts\nthat kx\nB\n\"14.9252, ky\nB\n\"14.9286\n5 Stability\nIt is straightforward, although algebraically complex, to determine the\nstability of the various solution branches. Details of the calculations\nare given in Appendix 2; here we summarise the results and discuss\ntheir implications. The key parameters controlling stability are qx\n2\nand\nqxy\n2\n, and the various stability regions in the qx\n2\n— qxy\n2\nplane are shown in\nFig. 10. These results have some important implications for the pos-\nsible range of observable (stable) patterns:\n(i) The subcritical striped patterns, which are a novel feature intro-\nduced by spatially varying diffusion, can be stable. Specifically,\nthis occurs for stripes perpendicular to the x-axis (on a primary\nbranch bifurcating from kB\nx\n) when k\nL\n(kx\nB\nand qx\n2\n’0.\n(ii) Since qx\n2\n’0 is exactly the criterion for the primary branches\nbifurcating at ky\nB\nto be supercritical, only supercritical striped\npatterns perpendicular to the y-axis are stable.\n(iii) The primary solution branch on which the secondary bifurcation\nto spots occurs can change stability at this secondary bifurcation\npoint; this occurs when qxy\n2\n’qx\n2\n’0, on whichever primary\nbranch the secondary bifurcation to spots occurs.\n(iv) The secondary solution branch (corresponding to spots) is never\nstable when it is subcritical, so that stable spots can only appear\nsupercritically.\nThese observations together mean that stable stripes can appear either\nsubcritically or supercritically, and then bifurcate supercritically to\nstable spots. Moreover, stable striped and spotted patterns never\nco-exist. This last observation has a direct analogy in the spatially\nhomogeneous case g\"0, in which either a striped or spotted solution\n(but never both) is selected at the (primary) Turing bifurcation point\n(Ermentrout, 1991; Lyons and Harrison, 1991).\nFor the small values of e, g and d for which our weakly nonlinear\nanalysis is valid, the range of subcritical values of the bifurcation\nUnravelling the Turing bifurcation 403\nFig. 10. A schematic representation of the stability of the various primary and second-\nary solution branches, as predicted by the analysis in Appendix 2. The four bifurcation\ndiagrams all have the basic structure shown in Fig. 1; stable solutions are denoted by\nsolid lines, and unstable solutions by dashed lines. This representation applies when\nthe secondary bifurcation occurs on the primary solution branches emerging from\nk\"kx\nB\n. In the alternative case in which the secondary bifurcation occurs on the\nprimary branch emerging from k\"ky\nB\n, the only difference is that the stability of the\nthese two sets of primary branches is reversed. There are four stability regions in the\nqx\n2\n—qxy\n2\nplane: (i) qx\n2\n(0 in which all patterns are unstable; (ii) qx\n2\n’0, qxy\n2\n(0 in which\ncase the only stable patterns are on the primary branch between the primary and\nsecondary bifurcations; (iii) qxy\n2\n’qx\n2\n’0 in which case the primary solution branches\nare stable and the secondary branches are unstable; (iv) qx\n2\n’qxy\n2\n’0 in which case the\nprimary branches emerging from k\"ky\nB\nare stable, while those emerging from k\"kx\nB\nare initially unstable, and then lose stability at the secondary bifurcation, giving stable\nspotted solutions. Note that qx\n2\n(0 is exactly the condition for (both) solution branches\nemerging from k\"ky\nB\nto be subcritical, these solution branches change stability and\ncriticality simultaneously, as illustrated\n404 D. L. Benson et al.\nFig. 11. Steady state solutions of the full non-linear system (2.1) for parameter values\nC\"30, g\"1.2, A\"0.2, B\"0.8, (a) k\"19.06 and (b) k\"21.06. In this case, our\nanalysis predicts that the secondary bifurcation point, kx\nS\n, lies on the primary solution\nbranch bifurcating from kx\nB\n. From AUTO, kx\nB\n\"19.244 and k\nL\n\"18.988. The para-\nmeter values used satisfy the stability conditions qx\n2\n’qxy\n2\n’0. Note that the striped\nsolution is subcritical, and for other initial conditions from those used (perturbations\nabout the spatially heterogeneous steady state in each case) the system relaxed to the\nuniform steady state\nparameter for which stable stripes exist is numerically very small.\nSimilarly, the secondary bifurcation points lie in very close proximity\nto the primary bifurcation point. It is therefore difficult to investigate\nquantitatively our stability predictions by numerical simulation, be-\ncause of the long relaxation time of solutions close to the bifurcation\npoints. For larger values of g, the subcritical part of the primary\nsolution branch is wider, and intuitively we would expect the position\nof the secondary bifurcation point to move further from the primary\nbifurcation point. In this case, therefore, it may be possible to observe\na transition from stable striped to stable spotted solutions as the value\nof the bifurcation parameter is increased. Preliminary simulations\nsuggest that this is true, but we have not done a detailed numerical\nstudy.\nFigure 11 illustrates solutions of the full time dependent non-linear\nmodel equations solved numerically for g90 with parameter values\nsatisfying qx\n2\n’qxy\n2\n’0. In this example we use a relatively large value\nof g (’1), but nevertheless we find stable striped solutions close to the\nprimary bifurcation point (predicted numerically from the correspond-\ning one-dimensional system using AUTO) and stable spotted solutions\nfor larger values of the bifurcation parameter. In this case, however, the\ntruncated power series approximation cannot make an accurate pre-\ndiction of the secondary bifurcation point. A higher order approxima-\ntion may provide a better prediction for large values of g, although it\nmust be remembered that the assumptions underlying the power series\napproximation are not valid.\nUnravelling the Turing bifurcation 405\nWe complete this section by comparing the stability of striped and\nspotted solutions of the reaction diffusion system (2.1) for g90 with\nthe stability of similar solutions in the spatially homogeneous case\ng\"0. When the diffusion coefficients are constant, a similar analysis to\nthat in Appendix 2 may be used to determine the stability of the\nprimary solution branches bifurcating from k\nc\n, via power series expan-\nsions (2.2). In this case we find that primary striped solutions are stable\nif and only if qxy\n2\n’qx\n2\n’0, and that primary spotted solutions are\nstable if and only if qx\n2\n’qxy\n2\n’0. These conditions are a statement of\nthe well known fact that for constant diffusion the primary solution\nbranches are stable only when the pitchfork bifurcation from the\nuniform steady is supercritical. Moreover, they agree with recent ana-\nlyses which show that simultaneously stable striped and spotted solu-\ntions cannot exist (Ermentrout, 1991; Lyons and Harrison, 1991). It\nmay also be shown that, when the model equations are written in terms\nof displacement from the uniform steady state, the absence of quadratic\nterms forces (qxy\n2\n!qx\n2\n)(0. Our stability conditions are therefore in\nagreement with the fact that certain kinetics exclude stable spotted\nsolutions.\nMoreover, the conditions for stable spotted solutions are the same\nfor both g\"0 and g90. The conditions for the stability of striped\nsolutions when g90, however, are the same as for constant diffusion\nonly beyond the secondary bifurcation point. In this case, the spatial\npattern selected for either g\"0 or g90 is determined by the competi-\ntion between cubic and quadratic terms in the kinetics. For values of\nthe bifurcation parameter less than the secondary bifurcation value,\nhowever, a striped solution is always selected. Thus, a reaction diffu-\nsion system, which for a given set of parameter values and constant\ndiffusion coefficients admits only stable spotted solutions, can be\nforced to generate stable striped solutions by spatially heterogeneous\ndiffusion coefficients. Numerical simulations demonstrate that this\nmay also occur when reaction kinetics are spatially heterogeneous or\nwhen the shape of the domain is rectangular (Lyons and Harrison,\n1992).\n6 Discussion\nIn this paper we have considered only square shaped domains. For\nconstant diffusion coefficients this ensures that no predescribed asym-\nmetry is imposed on the reaction diffusion system which might influ-\nence pattern selection. Analytically we have shown, however, that\na small spatial asymmetry in diffusion coefficients is sufficient to\n406 D. L. Benson et al.\nexclude the formation of spotted solutions close to a primary bifurca-\ntion point. This results from the splitting of the primary bifurcation\npoint, which for constant diffusion is highly degenerate, into two\nsimple primary bifurcation points and a secondary bifurcation point.\nIn this respect the bifurcation structure of reaction diffusion systems\ndefined on square domains with spatially heterogeneous diffusion\ncoefficients is similar to that of systems defined on rectangular domains\nwith constant diffusion coefficients. In the latter case, striped steady\nstate solutions parallel to the x and y axes generally bifurcate from\ndistinct primary bifurcation points. On an almost square domain we\nhave found that the two primary bifurcation points lie close together\nand spotted solutions appear as secondary bifurcations from one of the\nprimary solution branches. In contrast to the case of spatially hetero-\ngeneous diffusion coefficients, however, there are no transcritical bifur-\ncations from the uniform steady state and hence no stable striped\nsolutions for subcritical values of the bifurcation parameter. This\nimplies that the two systems are not isomorphic. Moreover, the four\nprimary bifurcation branches only separate into two identical pairs on\nan almost square domain, whereas with spatially varying diffusion\ncoefficients, all four primary branches become distinct. Thus the\nintroduction of a small spatial variation in the diffusion co-\nefficients is a more effective way of splitting the degeneracies in the\nTuring bifurcation.\nReaction diffusion systems with constant diffusion coefficients de-\nfined on infinite domains do not in general have stable subcritical\nstriped solutions. In this case, there are three basic patterns which\ntessellate the plane and appear as steady state solutions of reaction\ndiffusion systems. These are stripes, rhombs (which correspond to our\nspotted solutions) and hexagons (which are not possible on a rectangu-\nlar or square domain). According to stability analysis (see, for example,\nMalomed and Tribel’skii, 1987), hexagonal patterns should appear first\nvia a subcritical bifurcation. These patterns are stable but become\nunstable at a supercritical value of the bifurcation parameter. From the\nsame primary bifurcation point, stripes bifurcate supercritically. These\nare unstable close to the bifurcation point, but become stable at large\nvalues of the bifurcation parameter. There is a region of bistability\nwhere both stripes and hexagons are stable. As on the finite domain,\nstable spots can form in place of stable stripes.\nThese theoretical predictions have been confirmed numerically for\nthe Schnakenberg and Brussellator models (Dufiet and Boissonade,\n1992a,b; De Wit et al., 1992). Our analysis suggests, however, that\nspatially heterogeneous diffusion coefficients could enable striped solu-\ntions to appear subcritically on an infinite domain. Although both\nUnravelling the Turing bifurcation 407\nnumerical (Borcksman et al., 1992) and theoretical analyses (Walgraef\nand Schiller, 1987) have been carried out on systems with spatially\ninhomogeneous model parameters defined on infinite domains, to our\nknowledge, subcritical striped solutions have not been reported. Re-\ncently, however, such solutions were observed (Jensen et al., 1993) in\nnumerical solutions of a reaction diffusion system, defined on a spa-\ntially homogeneous domain, in which the instability interval of a time\nperiodic, spatially oscillating solution overlapped with that of a Turing\npattern. The same system also produced spatial patterns which could\nbe localised within the domain. In both cases, the spatial patterns were\nconstant in time for a wide range of parameter values. In general,\nhowever, when a Turing instability and a time oscillatory instability\noccur simultaneously, the solutions are complex, spatially in-\nhomogeneous, non-stationary structures (Perraud et al., 1993), which\nmay be observed experimentally. This has led to the suggestion that by\ncontinuously varying the value of a single parameter, one might move\nfrom stationary Turing patterns, through spatio-temporal structures,\nto travelling excitable waves (Boissonade, 1994). In particular, this\nhighlights the fact that reaction diffusion mechanisms have a far\ngreater capacity for pattern formation than is suggested by the linear\nanalysis of standard Turing systems.\nAppendix 1\nIn this Appendix, we summarise the analytical determination of the\nprimary solution branches, supplying various details that were omitted\nin Sect. 3.\nA1.1 The branch bifurcating at kx\nB\nSubstituting the expansion (2.3b) for k into the governing reaction\ndiffusion equations (2.1) and equating powers of eg, we find that (u1\n1\n, v1\n1\n)\nis a solution of the equation\n‚A\nu1\n1\n(x\n1\n)\nv1\n1\n(x\n1\n)B\"x2A\n1\nk\nc\nmBCn2 cos (nx)#2xA\n1\nk\nc\nmBCn sin(nx)\n#Dwx\n1A\n0\nmBCn2 cos(nx), (A.1)\nwhere ‚ is the linearised operator for the nonlinear system (2.1). Recall\nthat the parameters m, C and wx\n1\nare defined in (3.2), (3.3) and (3.4)\n408 D. L. Benson et al.\nrespectively; k\nc\nis the value of k at which a Turing bifurcation occurs\nwhen g\"0.\nTo determine the solution we express (u1\n1\n, v1\n1\n) as the Fourier cosine\nexpansion\nA\nu1\n1\n(x\n1\n)\nv1\n1\n(x\n1\n)B\" +\nk, j|N\na\n1 k, j\ncos(knx) cos( jny).\nSubstituting this expression into equation (A.1), multiplying both sides\nby cos(knx)cos( jny) and integrating over [0, 1]][0, 1] gives, for each\nk, j3N\nM\nk, j A\na1\nk, j\na2\nk, j\nB\"2(J1 1#J1 2#J1 3 )\nwhere J\n1 1\n, J\n1 2\n, J\n1 3\nare given by\nJ\n1\n\"PCn2A\n1\nk\nc\nmBx2 cos (nx) cos (knx) cos ( jny) dx dy\n\"CA\n1\nk\nc\nmB G\n2(1#k2)\/(1!k2)2\n!2(1#k2)\/(1!k2)2\nn2[1\/6#1\/4n2]\n0\nk91, k odd, j\"0\nk91, k even, j\"0\nk\"1, j\"0\nk\"0, j90\nJ\n2\n\"P2CnA\n1\nk\nc\nmBx sin(nx) cos(knx) cos( jny) dx dy\n\"CA\n1\nk\nc\nmB G\n!2\/(1!k2)\n2\/(1!k2)\n!1\/2\n0\nk91, k odd, j\"0\nk91, k even, j\"0\nk\"1, j\"0\nk\"0, j90\nJ\n3\n\"PDw1Cn2A\n0\nmB cos(nx) cos(knx) cos( jny) dx dy\n\"CA\n0\nmB G\nDw\n1\nn2\/2\n0\n0\nk\"1 , j\"0\nk91, j\"0\nk\"0 , j90\nHere M\nk, j\nfor k, j\"1, 2, 2 are the matrices associated with the\naction of ‚ on an arbitrary vector of the form (u, v)Jcos(knx)\nUnravelling the Turing bifurcation 409\n]cos ( jny), and are defined by\nM\nk,j\n\"A\n!D(k2#j2)n2#F\nu\nF\nv\nG\nu\n!k\nc\nD(k2#j2) n2#G\nv\nB . (A.2)\nFor (k, j )9(1, 0) or (0, 1), a\nk, j\n\"2M~1\nk, j\n(J\n1\n#J\n2\n#J\n3\n), since the ma-\ntrices M\nk,j\nare invertible. In this case, a\n0,j\n\"0 and in general, a\nk,0\n90.\nFor (k, j)\"(1, 0) or (0, 1), M\nk, j\nis singular. In this case a\nk, j\ncan be\nwritten in the form\na\nk,j\n\"A\nk, jA\n1\nmB#Bk, jA\n1\n!1\/mB .\nFor (k, j )\"(1, 0), A\nk, j\nmust have the value 0 to satisfy the ortho-\ngonality condition (2.5b) and B\nk,j\nmay be calculated from\nB\nk,j\nM\nk, j\n(1, !1\/m)\"2(J\n1\n#J\n2\n#J\n3\n). For (k, j)\"(0, 1), it is easily\nseen that B\nk,j\n\"0 and that A\nk,j\nis undetermined. Considering higher\norder expansions, however, it may be shown that A\n0,1\n\"0. Thus we\nfind\nA\nu1\n1\n(x)\nv1\n1\n(x)B\"+\nk\na\nk\ncos(knx)\nwhere a\nk\n\"a\nk,0\n. Note that this leading order power series approxima-\ntion is completely independent of the spatial variable y.\nTo determine the leading order approximation for k we must con-\nsider higher order terms in the expansions. Equating coefficients of\nO(e2g0) and using the Fredholm Alternative, we find that q0\n1\n\"0 and\nA\nu0\n2\nv0\n2\nB\"A\na\nu\na\nv\nB\n1\n2\niC2 cos(2nx)#A\nb\nu\nb\nv\nB\n1\n2\niC2#A\n1\nmBP cos(nx)\n#A\n1\nmBQcos(ny) .\nHere P\"0, in order to satisfy the orthogonality condition (2.5b), and\nQ is still to be determined; as stated in the main text, i\"1\n2\nF\nuu\n#F\nuv\n.\nThe constants a\nu\n, a\nv\n, b\nu\nand b\nv\nare defined by the equations\nM\n2,0A\na\nu\na\nv\nB\"A\n!1\n1 B , M0,0A\nb\nu\nb\nv\nB\"A\n!1\n1 B . (A.3)\nIn a similar way, the constants c\nu\nand c\nv\nthat are used in the main text\nare defined by\nM\n1,1A\nc\nu\nc\nv\nB\"A\n!1\n1 B .\n410 D. L. Benson et al.\nSubstituting this expression into the O (e2g) equations yields the\nsolvability conditions Q\"0 and K\n1\n#K\n2\n#K\n3\n#K\n4\n\"0, where\nK\n1\n\"PC(Fuua12#Fuv(a22#ma12))A\n!1\n1 B · A\n1\npB cos(2nx) cos2(nx) dx\n#PC (Fuua12#Fuv(a20#ma10))A\n!1\n1 B ·A\n1\npB cos2(nx) dx\n\"C[(F\nuu\na1\n2\n#F\nuv\n(a2\n2\n#ma1\n2\n))#2(F\nuu\na1\n0\n#F\nuv\n(a2\n0\n#ma1\n0\n))] (1#p)\/4\nK\n2\n\"P 4A2in2A\na\nu\nk\nc\na\nv\nB · A\n1\npBx2 cos(nx) cos(nx) dx\n\"!4C2i(a\nu\n#k\nc\na\nv\np)C\n1\n4\n#n2\n6 D\nK\n3\n\"P 2C2inA\na\nu\nk\nc\na\nv\nB ·A\n1\npB 2x sin(nx) cos(nx) dx\n\"C2i(a\nu\n#k\nc\na\nv\np)\nK\n4\n\"P Dq11Cn2A\n0\nmB ·A\n1\npB cos2(nx) dx\n\"CDn2pmq1\n1\n\/2,\nand a\n2\n\"(a1\n2\n, a2\n2\n). Therefore we require that\nq1\n1\n\"!2(K1#K2#K3)\nCDmpn2\n. (A.4)\nExcept in special cases, q1\n1\n90, so that egq1\n1\nis a leading order term\nin the expansion of k. Since q0\n1\n\"0, the other leading order term will be\ne2q0\n2\n, provided q0\n2\n90. To determine q0\n2\n, we consider the O (e3) expan-\nsion of the model equations. Considering terms of O(e3g0), the solvabil-\nity condition is\nDmpn2q0\n2\n2\n#(!1#p)iC2(F\nuu\n#F\nuv\nm) A\na\nu\n8\n#bu\n4 B\n#(!1#p)iC2F\nuvA\na\nv\n8\n#bv\n4 B#(!1#p)Fuuv\n3C2\n16\n\"0 . (A.5)\nAgain except in special cases, q0\n2\n90, and so to leading order\nk\"kx\nB\n#egq1\n1\n#e2q0\n2\n.\nUnravelling the Turing bifurcation 411\nA1.2 The branch bifurcating at ky\nB\nTo approximate the solution near ky\nB\n, we observe, from equations (3.1)\nand (3.4), that\nA\nu0\n1\nv0\n1\nB\"A\n1\nmBCcos(ny)\nand (u1\n1\n, v1\n1\n) is a solution of the system\n‚A\nu1\n1\nu1\n1\nB\"x2A\n1\nk\nc\nmBCn2 cos(ny)#Dwy1A\n0\nmBCn2 cos(ny) . (A.6)\nHere the definition of wy\n1\ngiven in (3.4b) guarantees the existence of\na solution to equation (A.6). Again, to determine this solution we\nexpress (u1\n1\n, v1\n1\n) as the Fourier cosine expansion\nA\nu1\n1\nv1\n1\nB\" +\nk,j|N\nA\nb1\nk, j\nb2\nk, j\nB cos(knx) cos( jny)\nand substitute this expression into equation (2.1). This gives rise to\na series of linear equations for the b\nj,k\nof the form\nM\nk, jA\nb1\nk,j\nb2\nk,j\nB cos(knx) cos( jny)\"Dwy1A\n0\nmBCn2 cos(ny)\n#x2A\n1\nk\nc\nmBCn2cos(ny) , (A.7)\nwhere the matrices M\nk,j\nare defined by (A.2). For (k, j)9(0, 1) and\n(k, j)9(1, 0), the matrices M\nk, j\nare invertible. In this case, (A.7) may be\nsolved for each b\nk, j\nby multiplying each side of the equation by\ncos(knx)cos( jny) and integrating over the unit square. When j\"1 and\nk90, we find that M\nk, j\n(b1\nk, j\n, b2\nk, j\n)\"(2C\/k2)cos(kn) (1, k\nc\nm), and when\nj90 or 1 and k90, we find b\nj,k\n\"0. When (k, j)\"(0, 1) or\n(k, j)\"(1, 0), M\nk, j\nis singular and we look for a solution of the form\nA\nb1\nk, j\nb2\nk, j\nB\"A\n1\nmBA#A\n1\n!1\/mBB .\nIn the first case, A\"0 by orthogonality but in general B is non-zero\nand may be found by substitution. When (k, j)\"(1, 0), it is obvious\nthat A\"B\"0. Thus we find\nA\nu1\n1\n(x)\nv1\n1\n(x)B\"+\nk\nb\nk,1\ncos(knx)cos(ny) .\n412 D. L. Benson et al.\nIn particular this implies that the truncated power series approxima-\ntion (3.9) is dependent on both spatial variables, as discussed in Sect. 3.\nFor D g D;1, however, the dependence on x is very small, so that the\nsolutions are approximately one-dimensional.\nDetermining the leading order approximation for k in a manner\nanalogous to the above, we find that the solvability condition forces\nq1\n1\n\"0. From consideration of higher order expansions in g, it is found\nthat qj\n1\n\"0 for all j\"2, 3, 2 . Thus the truncated approximation for\nk reduces to k\"k\nc\n#e2q0\n2\n.\nThe value of q0\n2\nis determined by the O (e2) expansion of the model\nequations and is given by\nDmpn2q0\n2\n2\n#(!1#p)iC2(F\nuu\n#F\nuv\nm)A\na\nu\n8\n#bu\n4 B\n#(!1#p)iC2F\nuvA\na\nv\n8\n#bv\n4 B#(!1#p)Fuuv\n3C2\n16\n\"0 , (A.8)\nBy comparison with equation (A.5), it is seen that this value of q0\n2\nis the\nsame as that for the primary solution branch bifurcating from kx\nB\n, and\nas explained in the main text, we denote this common value by qx\n2\n.\nAppendix 2\nHere, we summarise the analysis involved in determining the stability\nof the various solution branches that we have described for (2.1). The\nanalytical techniques are standard (see, for example, Sattinger, 1972);\nwe consider only linear stability. For the primary branches, linear\nstability u (x, e, g) is determined by considering the eigenvalue problem\n+ · (D (x, g)+uL )#F\nu\n(u(x, e, g)) uL #F\nv\n(u(x, e, g))vL\"juL , (B.9a)\nk+ · (D (x, g)+vL )#G\nu\n(u, e, g)) uL #G\nv\n(u (x, e, g))vL\"jvL , (B.9b)\nuL\nx\n\"vL\nx\n\"0 on x\"0, 1, uL\ny\n\"vL\ny\n\"0 on y\"0,1 , (B.9c)\nand the linear stability of the secondary solution branches uN (x, d, g) is\ndetermined by considering the eigenvalue problem\n+ · (D(x, g)+uL )#F\nu\n(uN (x, d, g)) uL #F\nv\n(uN (x, d, g))vL\"juL , (B.10a)\nk+ · (D(x, g)+vL )#G\nu\n(uN , d, g)) uL #G\nv\n(uN (x, d, g)) vL\"jvL , (B.10b)\nuL\nx\n\"vL\nx\n\"0 on x\"0,1, uL\ny\n\"vL\ny\n\"0 on y\"0, 1. (B.10c)\nUnravelling the Turing bifurcation 413\nIn both cases j represents the rate of linear growth of perturbations\nuL (x) about the steady state solutions. In particular, the solution branch\nis stable if and only if j(0 for all perturbation solutions.\nTo solve the eigenvalue problem for j, we substitute the power\nseries expansions for the primary and secondary solution branches into\nequation (B.9) or (B.10) as appropriate, and assume that both j and\nuL (x) may be expressed as power series expansions in the same small\nparameters. Thus on the primary solution branches, we look for\nsolutions of the eigenvalue problem of the form\nuL (x, e, g)\"euL\n1\n(x, g)#e2uL\n2\n(x, g)#O(e3) (B.11a)\nj(e, g)\"j\n0\n(g)#ej\n1\n(g)#e2j\n2\n(g)#O(e3) , (B.11b)\nsatisfying DDuL\n1\nDD\"1, where for i\"1, 2, 2 and j\"0, 1, 2, 2\nuL\ni\n(x, g)\"uL 0\ni\n#guL 1\ni\n#g2uL 2\ni\n#O (g3)\nj\nj\n(g)\"j0\nj\n#gj1\nj\n#g2j2\nj\n#O (g3) .\nOn the secondary solution branches, the appropriate power series\nexpansions are\nuL (x, d, g)\"duL\n1\n(x, g)#d2uL\n2\n(x, g)#O(d3) (B.12a)\nj(d, g)\"j\n0\n(g)#dj\n1\n(g)#d2j\n2\n(g)#O (e3) , (B.12b)\nsatisfying DDuL\n1\nDD\"1, where for i\"1, 2, 2 and j\"0, 1, 2, 2\nuL\ni\n(g)\"g1@2uL 1\ni\n#guL 2\ni\n#O(g3@2)\nj\nj\n(g)\"g1@2j1\nj\n#gj2\nj\n#O(g3@2) .\nSubstituting these expressions into the eigenvalue equations, the two-\nvariable perturbation technique may then be used to determine the\nleading order approximation for j. Specifically, we approximate j on\nthe primary solution branches by\nj\"gj1\n0\n#egj1\n1\n#e2j0\n2\n,\nand on the secondary solution branches by\nj\"gj2\n0\n#d2gj2\n2\n.\nFrom these approximations we are able to derive the conditions for the\nstability of the primary and secondary solution branches when g90\nand compare these with the conditions for the stability of primary\nstriped and spotted solutions when g\"0 (see Sect. 5).\nAs this analysis is standard, we summarise the results for our\nsystem. Considering first the primary solution branch bifurcating from\nkx\nB\n, we find that its stability for a given value of k, or equivalently for\n414 D. L. Benson et al.\na given value of the parameter e, is determined by the signs of j\nx\nand j\ny\n,\nwhere\nj\nx\n\"Dn2mp\n1#mpGegq11#e22qx2H (B.13)\nj\ny\n\"Dn2mp\n1#mpG!g (wx1!wy1)#2e2(qxy2 !qx2)H . (B.14)\nWhen both j\nx\n(0 and j\ny\n(0 the spatially inhomogeneous steady state\nsolution is stable; otherwise it is unstable. Equation (B.13) implies that\nj\nx\n(08qx\n2\n’0 and eN[e\nL\n, 0] , (B.15)\nwhere e\nL\n\"!gq1\n1\n\/(2qx\n2\n) is the position of the limit point denoted by\nk\"k\nL\n; for qx\n2\n’0, the parameter interval [e\nL\n, 0] corresponds to the\nlower part of the subcritical region of the primary solution branch (see\nFig. 1). Here we have used the fact that mp3(!1, 0) for all reaction\nkinetics which exhibit diffusion driven instability; this follows from\nsimple algebraic manipulation of the equation (3.2) defining m and the\ncorresponding expression for p (given immediately before (3.4)). Sim-\nilarly, we can deduce that\nj\ny\n(08(qxy2 !qx2)(0 and e2(e2x ,\n(qxy\n2\n!qx\n2\n)’0 and e2’e2\nx\n,H if e2x’0\nj\ny\n(08(qxy\n2\n!qx\n2\n)’0 ∀e if e2\nx\n(0,\nwhere\ne\nx\n\"C\ng (wx\n1\n!wy\n1\n)\n2(qxy\n2\n!qx\n2\n)D\n1@2\ndefines the position of the secondary bifurcation point kx\nS\nwhen\nwx\n1\n!wy\n1\nqxy\n2\n!qx\n2\n’0 .\nThus, when kx\nS\nexists, the primary solution branch is stable for\nk\nL\n(k(kx\nS\nif and only if qx\n2\n’0, qx\n2\n’qxy\n2\n, and for k’kx\nS\nif and only if\nqxy\n2\n’qx\n2\n’0. When kx\nS\ndoes not exist, the solution branch is stable for\nall k’kx\nB\nwhenever qxy\n2\n’qx\n2\n’0. In particular, it follows that a neces-\nsary condition for stability is qx\n2\n’0.\nBy a similar analysis, we may determine the stability conditions for\nthe primary solution branch bifurcating from ky\nB\n; the results are out-\nlined in Sect. 5.\nUsing the above ideas we can also analyse the stability of the\nsolutions on the secondary branches. First we determine the stability of\nthe secondary solution branch bifurcating from kx\nS\n, which has power\nUnravelling the Turing bifurcation 415\nseries expansion (2.6). We find that the stability of the secondary\nsolution branch is determined by the signs of j\nx\nand j\ny\n, where\nj\nx\n(d, g)\"g2Dn2mpqx2\n1#mp !d2g\n8Dmpn2qxy\n2\n(qxy\n2\n!qx\n2\n)\n(1#mp)qx\n2\n(B.16)\nj\ny\n(dg)\"!d2g 8Dmpn2qxy2 (qxy2 !qx2)\n(1#mp)qx\n2\n. (B.17)\nThe solutions are stable if both j\nx\n(0 and j\ny\n(0, and are unstable\notherwise. It follows that for sufficiently small d, j\nx\n(08qx\n2\n’0. As\nbefore, we have used the fact that, for all parameter values lying in\nthe generalised Turing space, mp3(!1, 0). Similarly, j\ny\n(08\nqxy\n2\n(qxy\n2\n!qx\n2\n)\/qx\n2\n(0. Thus close to the secondary bifurcation point,\nwhere d;1, there exist stable spotted solutions for k’kx\nS\nif and only if\nqx\n2\n’qxy\n2\n’0.\nAcknowledgements. DLB was supported in part by a Wellcome Trust Prize Student-\nship. Part of this work was carried out while PKM was visiting the Department of\nMathematics, Williams College, Massachusettes. This work was supported in part by\na grant from the London Mathematical Society.\nReferences\nBauer, L., Keller, H. B. and Reiss, E. L., 1975, Multiple eigenvalues lead to secondary\nbifurcation. SIAM Review, 17, 101—122\nBenson, D. L., Sherratt, J. A. and Maini, P. K., 1993, Diffusion driven instability in an\ninhomogeneous domain. Bull. Math. Biol., 55, 365—384\nBoissonade, J., 1994, Long-range inhibition. Nature, 369, 188—189\nBorckmans, P., De Wit, A. and Dewel, G., 1992, Competition in ramped Turing\nstructures. Physica A, 188, 137—157\nDe Wit, A., Dewel, G., Borckmans, P. and Walgraef, D., 1992, 3-Dimensional dissi-\npative structures in reaction diffusion-systems. Physica D, 61, 289—296\nDoedel, E., 1976, AUTO: software for continuation and bifurcation problems in\nordinary differential equations. Technical report, California Institute of Technology\nDufiet, V., and Boissonade, J., 1992a, Conventional and unconventional Turing\npatterns. J. Chem. Phys., 96, 664—673\nDufiet, V. and Boissonade, J., 1992b, Numerical studies of Turing pattern selection in\na two-dimensional system. Physica A, 118, 158—171\nErmentrout, B., 1991, Stripes or spots? Nonlinear effects of bifurcation of reaction\ndiffusion equations on the square. Proc. R. Soc. Lond., A434, 413—417\nGierer, A. and Meinhardt, H., 1972, A theory of biological pattern formation.\nKybernetik, 12, 30—39\nHunding, A. and Br+ns, M., 1990, Bifurcation in a spherical reaction diffusion system\nwith imposed gradient. Physica D, 44, 285—302\nIooss, G. and Joseph, D. D., 1980, Elementary stability and bifurcation theory, New\nYork: Springer-Verlag\n416 D. L. Benson et al.\nJenson, O., Pannbacker, V. O., Dewel, G. and Borckmans, P., 1993, Subcritical\ntransitions to Turing structures. Phys. Lett. A, 179, 91—96\nLyons, M. J. and Harrison, L. G., 1991, A class of reaction diffusion models which\npreferentially select striped patterns. Chem. Phys. Lett., 183, 159—164\nLyons, M. J. and Harrison, L. G., 1992, Stripe selection: An intrinsic property of some\npattern-forming models with non-linear dynamics. Devel. Dyn., 195, 201—215\nMahar, T. J. and Matkowsky, B. J., 1977, A model biochemical reaction exhibiting\nsecondary bifurcation. SIAM Review, 32, 394—404\nMalomed, B. A. and Tribel’skii, M. I., 1987, Stability of stationary periodic structures\nfor weakly supercritical convection and in related problems. Sov. Phys. JETP, 65,\n305—310\nMaini, P. K., Benson, D. L. and Sherratt, J. A., 1992, Pattern formation in reaction-\ndiffusion models with spatially inhomogeneous diffusion coefficients. IMA J. Math.\nAppl. Med. Biol., 9, 197—213\nMaini, P. K., Myerscough, M. R., Winters, K. H. and Murray, J. D., 1991, Bifurcating\nspatially heterogeneous solutions in a chemotaxis model for biological pattern\ngeneration. Bull. Math. Biol., 53, 701—719\nMeinhardt, H., 1993, A model for pattern formation of hypostome, tentacles, and\nfoot in hydra — how to form structures close to each other, how to form them at\na distance. Dev. Biol., 157, 321—333\nMurray, J. D., 1981, A pre-pattern formation mechanism for animal coat markings.\nJ. theor. Biol., 88, 161—199\nMurray, J. D., 1982, Parameter space for Turing instability in reaction diffusion\nmechanisms: A comparison of models. J. theor. Biol., 98, 143—163\nMurray, J. D., 1989, Mathematical Biology. Heidelberg: Springer-Verlag\nNagorcka, B. N., 1995a, The reaction-diffusion theory of wool (hair) follicle initiation\nand development. 1. primary follicles. Austr. J. Agric. Res., 46, 333—355\nNagorcka, B. N., 1995b, The reaction-diffusion theory of wool (hair) follicle initiation\nand development. 2. original secondary follicles. Austr. J. Agric. Res., 46, 357—378\nPerraud, J. J., De Wit, A., De Kepper, P., Dewel G. and Borckmans, P., 1993, One-\ndimensional spirals; Novel asynchronous chemical waves sources. Phys. Rev. Lett.,\n71, 1272—1275\nReiss, E. L., 1983, Cascading bifurcations. SIAM J. Appl. Math., 43, 57—65\nSattinger, D. H., 1972, Six lectures on the transition to instability. In Lecture Notes in\nMathematics, 322, Berlin: Springer—Verlag\nSchnakenberg, J., 1979, Simple chemical reaction systems with limit cycle behaviour.\nJ. Theor. Biol., 81, 389—400\nSegel, L. A. and Jackson, J. L., 1972, Dissipative structure: an explanation and an\necological example. J. Theor. Biol., 37, 545—559\nSherratt, J. A., 1995, Turing bifurcations with a temporally varying diffusion coeffic-\nient. J. Math. Biol., 33, 295—308\nTuring, A. M., 1952, The chemical basis of morphogenesis. Phil. Trans. R. Soc. Lond.,\nB237, 37—72\nUnravelling the Turing bifurcation 417\n"}