{"doi":"10.1007\/s00542-009-0923-1","coreId":"139908","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/4332","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/4332","10.1007\/s00542-009-0923-1"],"title":"An evaluation of process-parameter and part-geometry effects on the quality of\nfilling in micro-injection moulding","authors":["Attia, Usama M.","Alcock, Jeffrey R."],"enrichments":{"references":[{"id":37961004,"title":"De Mello A","authors":[],"date":"2005","doi":"10.1016\/s0169-7439(98)00014-8","raw":"ANTEC: Proc Annual Technical Conf (Boston, MA, 1-5 May 2005):36-40 De Mello A (2002) Plastic fantastic? Lab Chip 2:31N-36N Eriksson L, Johansson N, Kettaneh-Wold N, Wikstrom C and Wold S (2008) Design of experiments: principles and applications, 3rd edn. Umetrics, Umeå Griffiths CA, Dimov S, Brousseau EB, Chouquet C, Gavillet J and Bigot S (2008) Micro-injection moulding: surface treatment effects on part demoulding. Proc 4M2008 (Cardiff, UK, 9th - 11th September 2008) Griffiths C, Dimov S, Brousseau EB and Hoyle RT (2007) The effects of tool surface quality in micro-injection moulding. J Mater Process Tech 189:418-27 Jung W-C, Heo Y-M, Shin K-H, Yoon G-S and Chang S-H (2007) An experimatal study on micro injection paramaters. ANTEC: Proc Annual Technical Conf (Cincinnati, OH, 6-11 May 2007): 638-642 Lahey JP and Launsby RG (1998) Experimental design for injection molding. Launsby Consulting, Colorado Springs, CO 17 Lee B-K, Hwang CJ, Kim DS and Kwon TH (2008) Replication quality of flow-through microfilters in microfluidic lab-on-a-chip for blood typing by microinjection molding. J Manuf Sci E-T ASME 130:0210101-0210108 Marson S, Attia UM, Allen DM, Tipler P, Jin T, Hedge J and Alcock JR (2009) Reconfigurable micromould for the manufacture of truly 3D polymer microfluidic devices. Proc CIRP Design Conf (Cranfield, UK, 30-31 March 2009):343-346 Minitab Inc. Available at: www.minitab.com. Accessed 2009 Mönkkönen K, Hietala J, Pääkkönen P, Pääkkönen EJ, Kaikuranta T, Pakkanen TT and Jääskeläinen T (2002) Replication of sub-micron features using amorphous thermoplastics. Polym Eng Sci 42: 1600-1608 Montgomery DC (2005). Design and analysis of experiments, 6th edn. Wiley, Hoboken, Great Britain Osswald T, Turng L and Gramann P (Editors) (2001) Injection molding handbook. Hanser\/Gardner Publications, Cincinnti, OH Pirskanen J, Immonen J, Kalima V, Pietarinen J, Siitonen S, Kuittinen M, Mönkkönen K, Pakkanen T, Suvanto M and Pääkkönen EJ (2005) Replication of sub-micrometre features using microsystems technology. Plast Rubber Compos 34:222-226 Sha B, Dimov S, Griffiths C and Packianather MS (2007a) Investigation of micro-injection moulding: factors affecting the replication quality. J Mater Process Technol 183:284-296 Sha B, Dimov S, Griffiths C and Packianather MS (2007b) Micro-injection moulding: factors affecting the achievable aspect ratios. Int J Adv Manuf Technol 33:147-156 Shen YK, Yeh SL and Chen SH (2002) Three-dimensional non-Newtonian computations of microinjection molding with the finite element method. Int Commun Heat Mass 29:643-652 Tosello G, Gava A, Hansen HN and Lucchetta G (2007) Influence of process parameters on the weld lines of a micro injection molded component. ANTEC: Proc Annual Technical Conf (Cincinnati, OH, 6-11 May 2007):2002-2006 Wimberger-Friedl R (2000) Injection molding of sub-μm grating optical elements. J Inject Molding Technol 4:78-83 Yao D and Kim B (2004) Scaling issues in miniaturization of injection molded parts&quot;, J Manuf Sci Eng Trans ASME, vol. 126, no. 4, pp. 733-739.","cites":null},{"id":37961005,"title":"Injection molding high aspect ratio microfeatures.","authors":[],"date":"2002","doi":"10.1007\/978-94-010-1015-3_182","raw":"Yao D and Kim B (2002) Injection molding high aspect ratio microfeatures. J Manuf Sci E-T ASME 126:11-17 Zhao J, Mayes R, Chen G, Xie H and Chan P (2003a) Effects of process parameters on the micro molding process. Polym Eng Sci 43:1542-1554 Zhao J, Mayes R, Chen G, Chan PS and Xiong ZJ (2003b) Polymer micromould design and micromoulding process. Plast Rubber Compos 32:240-247","cites":null},{"id":37961000,"title":"Micro-injection moulding of polymer microfluidic devices.","authors":[],"date":"2009","doi":"10.1007\/s10404-009-0421-x","raw":"Attia UM, Marson S and Alcock JR (2009) Micro-injection moulding of polymer microfluidic devices. Microfluid Nanofluid 7:1-28 Aufiero R (2005) The effect of process conditions on part quality in microinjection molding.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-12-01T00:00:00Z","abstract":"This paper addresses the use of micro-injection moulding for the fabrication of\npolymeric parts with microfeatures. Five separate parts with different micro-\nfeature designs are moulded of Polymethylmethacrylate. The design-of-experiments\napproach is applied to correlate the quality of the parts to the processing\nparameters. Five processing parameters are investigated using a screening half-\nfactorial experimentation plan to determine their possible effect on the filling\nquality of the moulded parts. The part mass is used as an output parameter to\nreflect the filling of the parts. The experiments showed that the holding\npressure is the most significant processing parameter for all the different\nshapes. In addition, the experiments showed that the geometry of the parts plays\na role in determining the significant processing parameters. For a more complex\npart, injection speed and mould temperature became statistically significant. A\ndesirability function approach was successfully used to improve the filling\nquality of each part","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139908.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1007\/s00542-009-0923-1","pdfHashValue":"e218cf4cb93a4233265a826dba86f235bcb9e077","publisher":"Springer Science   Business Media","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/4332<\/identifier><datestamp>2011-05-05T11:45:56Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>An evaluation of process-parameter and part-geometry effects on the quality of\nfilling in micro-injection moulding<\/dc:title><dc:creator>Attia, Usama M.<\/dc:creator><dc:creator>Alcock, Jeffrey R.<\/dc:creator><dc:subject>Micro-injection moulding<\/dc:subject><dc:subject>Design of experiments<\/dc:subject><dc:subject>Geometry<\/dc:subject><dc:subject>Processing parameters<\/dc:subject><dc:subject>Quality control<\/dc:subject><dc:description>This paper addresses the use of micro-injection moulding for the fabrication of\npolymeric parts with microfeatures. Five separate parts with different micro-\nfeature designs are moulded of Polymethylmethacrylate. The design-of-experiments\napproach is applied to correlate the quality of the parts to the processing\nparameters. Five processing parameters are investigated using a screening half-\nfactorial experimentation plan to determine their possible effect on the filling\nquality of the moulded parts. The part mass is used as an output parameter to\nreflect the filling of the parts. The experiments showed that the holding\npressure is the most significant processing parameter for all the different\nshapes. In addition, the experiments showed that the geometry of the parts plays\na role in determining the significant processing parameters. For a more complex\npart, injection speed and mould temperature became statistically significant. A\ndesirability function approach was successfully used to improve the filling\nquality of each part.<\/dc:description><dc:publisher>Springer Science   Business Media<\/dc:publisher><dc:date>2011-03-17T23:02:15Z<\/dc:date><dc:date>2011-03-17T23:02:15Z<\/dc:date><dc:date>2009-12-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Usama M. Attia and Jeffrey R. Alcock, An evaluation of process-parameter and part-geometry effects on the quality of filling in micro-injection moulding, Journal Microsystem Technologies, Volume 15, Number 12, December 2009, Pages 1861-1872<\/dc:identifier><dc:identifier>0946-7076<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1007\/s00542-009-0923-1<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/4332<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0946-7076","0946-7076"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["Micro-injection moulding","Design of experiments","Geometry","Processing parameters","Quality control"],"subject":["Article"],"fullText":"1 \nAn evaluation of process-parameter and part-\ngeometry effects on the quality of filling in micro-\ninjection moulding \nU M Attia*1 and J R Alcock2 \n*1 Building 56, Cranfield University, Wharley End, Cranfield, Bedfordshire, MK43 0AL, UK. \nE-mail: u.attia@cranfield.ac.uk. Tel: +44 (0)1234 750111 ext: 2408 \n2 Building 61, Cranfield University, Wharley End, Cranfield, Bedfordshire, MK43 0AL, UK \n This paper addresses the use of micro-injection moulding for the fabrication of \npolymeric parts with microfeatures. Five separate parts with different micro-feature designs are \nmoulded of Polymethylmethacrylate. The design-of-experiments approach is applied to correlate \nthe quality of the parts to the processing parameters. Five processing parameters are \ninvestigated using a screening half-factorial experimentation plan to determine their possible \neffect on the filling quality of the moulded parts. The part mass is used as an output parameter to \nreflect the filling of the parts. The experiments showed that the holding pressure is the most \nsignificant processing parameter for all the different shapes. In addition, the experiments showed \nthat the geometry of the parts plays a role in determining the significant processing parameters. \nFor a more complex part, injection speed and mould temperature became statistically significant. \nA desirability function approach was successfully used to improve the filling quality of each part. \nKeywords: micro-injection moulding, design-of-experiments, geometry, processing \nparameters, quality control. \n1. Introduction \n Micro-injection moulding (μIM) is a polymer replication process of high potential for the \nmass-production of polymeric parts with microfeatures. Mass-production capabilities, high \nreplication fidelity and the ability to process polymers of a wide range of properties are some of \nthe advantages associated with μIM. \n For some time the main approach to identify influential processing parameters in μIM \nwas by changing one parameter at a time while keeping the others constant and then observing the \neffect of this parameter (Wimberger-Friedl 2000; Yao and Kim 2002; De Mello 2002). This \napproach was inherited from conventional injection moulding, as it was useful in drawing basic \nconclusions about how each parameter affects the filling quality of the moulded part. \n This approach, however, has two main limitations (Eriksson et al. 2008): the first \nlimitation is that it is relatively time consuming when many parameters are being investigated. The \nsecond drawback is that it does not take into consideration the effect of the interaction between \ntwo or more parameters, which is a relevant consideration in complex processes such as \nmicromoulding.  \n The design-of-experiments (DOE) approach was introduced into this research domain as a \nuseful alternative to this conventional method. A number of research groups have used a variety of \nDOE experimentation plans to investigate the relation between processing parameters and part-\n2 \nfilling quality. A summary of the main DOE experiments is available in the literature (Attia et al., \n2009).  \n The responses chosen for the experiments have included, filling quality of micro-sized \nchannels (Mönkkönen et al., 2002), part dimensions (Zhao et al. 2003a; Aufiero 2005; Sha et al. \n2007b; Pirskanen et al. 2005; Sha et al. 2007a), flow length (Griffiths et al. 2007; Jung et al. 2007), \nweld-line formation (Tosello et al. 2007), demoulding forces (Griffiths et al. 2008) and filled \nvolume fraction (Lee et al. 2008). This is a reflection of the main research challenge in micro-\nmoulding, which is the filling of small cavities. The choice of response is informed by such \nconsiderations as: is a specific dimension (or dimensions) critical for the part functionality, e.g. the \ndepth of a channel or the diameter of a hole?, or is the order of magnitude of the part mass suitable \nfor measurement?, e.g. variations in the part mass may be too small to be separated from \nexperimental noise. DOE has also been used to minimise injection time, pressure and temperature \ndistribution using a three-dimensional simulation package (Shen et al. 2002).  \n Results presented in the literature show that different DOE designs yield different outputs. \nFor example, there is disagreement about the importance of holding pressure and injection speed. \nFurthermore, certain experiments have highlighted interactions between processing parameters \nwhich have not been seen in other work. These differences in experimental results may be due to \nthe different geometrical shapes, polymers and experimental set-ups used in each experiment. It \nwould, therefore, seem reasonable to claim that, at present, significant processing parameters in \nμIM are indentified on case-by-case basis and cannot be generalized for all situations. \n This paper addresses the effect of processing parameters on the filling quality of μIM \nthrough a design-of-experiments (DOE) approach. In order to focus on the issue of general \napplicability highlighted above, the most influential processing parameters of five differently \nmicro-structured parts were each investigated. The parts were of high enough mass to allow part \nmass to be used as the response. The polymer type (Polymethylmethacrylate (PMMA)) and grade \nwere kept constant over the five micro-parts. Optimized processing conditions were calculated and \ntested for each of the five parts. They were then compared, so that the effect of the part geometry \non the filling behaviour of the polymer could be discussed. \n It is worth noting in more detail the prior work which is closest to that of this present \nstudy. Whilst some DoE-based experimental data are available, in which part geometries have \nbeen deliberately varied within a single moulding (Sha et al. 2007b), no prior work exists which \nassesses geometrically-different whole micro-moulded parts produced using a particular polymer. \nIn the literature (Zhao et al. 2003a; Zhao et al. 2003b), part mass was used as the response for two \ndifferent micro-parts, but the moulding polymer was also varied: a polyoxymethylene (POM) \nmicro-gear and a polycarbonate (PC) lens array. The micro-gear consisted of a gear-and-shaft \narrangement, where the gear diameter was 2.5 mm and the shaft length was 5 mm. It was produced \nwith a three-plate mould with a gate diameter of 0.6 mm. The lens component had overall \ndimensions of 12 x 3 x 2 mm carrying lens surfaces of radii 0.35 and 0.5 mm with a gate diameter \nof 0.3 mm. Five processing parameters were evaluated, namely mould temperature, melt \ntemperature, injection speed, metering size, hold pressure time and cooling time. For the gear \nstructure, the holding pressure time and metering size were highlighted as significant parameters. \nFor the lens array, metering size, injection speed and mould temperature were identified as most \nsignificant parameters. \n3 \n2. Experiment \n2.1. Methodology and equipment \n In this experiment, five parts (a to e) with micro-scaled features were investigated. The \nparts, which were components of a microfluidic device, were designed to have the same external \ndimensions but different sets of features, both on the surface of, and through the component. \nDifferent definitions of micromoulding are in the literature (Attia et al. 2009), so the scope of \nmicromoulding in this experiment was “macro” components with micro-structured regions. \n The polymer chosen for this study was Polymethylmethacrylate (PMMA) (VS-UVT, \nAltuglas®). The grade was selected for its ease of flow (MFI = 24 g\/10 min) and its optical \ntransparency (light transmittance 92%). The micro-injection moulding machine was a Battenfeld \nMicrosystems 50.  \n Five processing parameters were investigated as input factors: polymer-melt temperature \n(Tp), mould temperature (Tm), injection speed (Vi), holding pressure (Ph) and cooling time (tc). The \nresponse (quality parameter) in all experiments was the part mass (W). \n The experimental programme was conducted in three stages following the protocol laid \nout in Eriksson et al.: familiarization, screening, and optimization (Eriksson et al., 2008). These \nare detailed in Section 2.4. Weighing of the moulded parts was done using a sensitive scale with a \nreadability of 0.01 mg. Experimental data were processed and analysed using Minitab® 15 \n(Minitab Inc. 2009). \n2.2. Part Geometry \n The five moulded parts used in this study were all disc-shaped with a diameter of 10 mm \nand a thickness of 1 mm. The parts were designed to be building elements in a microfluidic device \nfor a medical application. Each of the five components has a different set of micro-features, the \nmajority of which are in place in order to form through-hole features in the final device. Figure 1 \npresents a schematic half-cross-section diagram of the five part designs (denoted by letters from a \nto e) with some of their critical dimensions: \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nφ400 μm \nφ1800 μm \nPART a \nPART b \nΦ100 - 150 μm \n50 μm \n4 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig 1 Half-cross-section diagrams of the five parts a to e with some of the main dimensions \nhighlighted \n2.3. Mould manufacturing \n Each part was moulded by an individual aluminium mould that was housed within a main \nsteel micro-mould body. A detailed description of the mould design and machining process for the \nmould inserts can be found elsewhere (Marson et al. 2009). Figure 2 shows SEM images of two of \nthe mould-inserts. \n \n \n \n \n \n \n \n \n \n \nFig 2 SEM micrographs of the micro-features of mould inserts \na \n500 μm \nb \n100 μm \nPART c \n50 μm \nφ400 μm \n200 μm \nφ1800 μm \nΦ400 μm \nPART e \nΦ400 μm 200 μm PART d \n5 \n2.4. Experimentation stages \n2.4.1. Familiarization stage \nIn the familiarization stage, a set of experiments were conducted in which the selected input \nparameters were assessed in order to determine the most extreme levels at which the experiment \nsuccessfully yielded a response. This process window of parameters was then translated to become \nthe high and low levels of the input parameters used in the screening experiments. The metering \nvolumes of the parts were determined experimentally. The volume of each part was selected such \nthat the polymer amount is enough to fill the cavity space without applying any holding pressure. \nThe metering volumes are then kept constant throughout the experiments. \n The sampling range was also determined, i.e. the number of moulding cycles after which \nthe process is considered to become stable. Stability was defined as having been achieved when \neach of the moulded parts possess the same mass within a given tolerance. \n The sampling range of the moulding process was determined using statistical control \ncharts. The average mass of the produced parts become stable within the upper and lower limits of \nthe chart after 30 to 40 continuous cycles depending on the mould insert used. As a standard \npractice, for each set of experimental conditions, samples were randomly collected after 50 cycles. \n Table 1 shows the criteria used for selecting the upper and lower values for each \nparameter. \nFactor Selection criteria \nLower level Higher level \nTp [°C] The minimum value for this level was the \nrecommendation of the material supplier \n(around 200°C). Based on experimentation, \nrelatively higher temperatures were selected, \nsuch that the injection process ran \ncontinuously. \nThis was selected by experimentation as a \nsafe high limit, above which signs of \ndegradation appeared. \nTm [°C] The minimum temperature was selected as \nthe temperature recommended by the material \nsupplier. \nThe high level was selected close to, but \nbelow, the Tg of the polymer (approx. 86°C). \nPh [bar] The minimum holding pressure value was \nobtained from the literature (Osswald 2001). \nThe higher holding pressure value was \nselected not to cause the material to flash. \nVi [mm\/s] This value was selected based on \nexperimentation. \nThis value was selected based on \nexperimentation. \ntc [s] The minimum value was calculated as the no-\nflow time, which is the time by which the \ngate was actually frozen. \nThe maximum was selected as approximately \ntwice the minimum. \nTable 1. Criteria for selecting the upper and lower levels of the experiment. \n Table 2 shows the upper and lower parameter levels selected for each of the five parts in \naddition to the metering volume selected for each part (including the runner system): \nP\nart \nMetering \nVolume \n[mm3] \nTp [°C] Tm [°C] Vi [mm\/s] Ph [bar] tc [s] \nLow \nlevel \n(-) \nHigh \nlevel \n(+) \nLow \nlevel \n(-) \nHigh \nlevel \n(+) \nLow \nlevel \n(-) \nHigh \nlevel \n(+) \nLow \nlevel \n(-) \nHigh \nlevel \n(+) \nLow \nlevel \n(-) \nHigh \nlevel \n(+) \na 179 240 255 70 81 200 300 250 500 4 7 \nb 178 230 250 72 80 200 300 100 300 4 7 \nc 177 230 250 72 84 200 300 100 300 3 6 \nd 177 230 250 72 84 200 300 100 300 3 6 \ne 177 230 250 70 84 150 300 100 300 3 6 \nTable 2. Higher and lower levels for the five tested parameters for the five parts. \n6 \n2.4.2. Screening stage \n The screening stage consisted of the execution of the set of designed experiments. The \nnumber of samples and the levels of the input variables were obtained from the familiarization \nstage. Statistical software and regression models were used to analyse the data. Significant \nprocessing parameters and interactions were determined.  \n The data obtained from the familiarization stage were used in the selected \nexperimentation design. The DOE scheme used was a two-level, half-factorial 16-run (2\n5-1\n) design.  \n This design was selected because it is a resolution-V design, which offers two advantages. \nFirstly, the number of experimental runs required is half that of a full factorial design. Secondly, \nthis reduction in runs does not affect the results significantly.  This is because the main effects are \nnot confounded with other main effects or with second-order interactions and the second-order \ninteractions are not confounded with each other.  \n The levels of the experimental runs are tabulated in table 3. For each set of experiments, \nthe order in which the experimental runs were conducted was randomized using a built-in \nrandomization function in Minitab. \nStandard \nOrder \nTp [°C] Tm [°C] Ph [bar] Vi [mm\/s] tc [s] \n1 - - - - + \n2 + - - - - \n3 - + - - - \n4 + + - - + \n5 - - + - - \n6 + - + - + \n7 - + + - + \n8 + + + - - \n9 - - - + - \n10 + - - + + \n11 - + - + + \n12 + + - + - \n13 - - + + + \n14 + - + + - \n15 - + + + - \n16 + + + + + \nTable 3. A half-factorial, two level 16-run (2\n5-1\n) experimentation design. \n After stabilisation, ten samples were randomly collected for each run.  The average mass \nof the samples was recorded as the experiment response. The experimental data collected was \nprocessed with Minitab® 15 and main-effects plots and Pareto charts were plotted.  \n One technique for correlating the factors to the response is by regression models. Similar \nto conventional regression models used to correlate two variables, a regression model can be used \nto fit the obtained responses to the input factors. The model can be linear, interaction, quadratic or \neven cubic, depending on the number of experiments conducted (Eriksson et al. 2008). In this \nparticular screening design, an interaction model was selected since it takes into consideration the \neffect of possible interactions on the response value. The selected regression model takes the \nfollowing format: \n...4114311321125544332211  xxxxxxxxxxxcy   (1) \nIn equation (1): y is the response, c is a constant, β values are the model-term coefficients and x1 to \nx5 are factors. The values and signs of the regression coefficients, β, represent the magnitude and \nthe relation of each model term, respectively. Once the coefficients of equation (1) are determined, \nthe response y of any set of given factors can be calculated. \n7 \n The accuracy of the fit was evaluated by comparing the values of responses calculated \nfrom the model, based on the obtained coefficients, to the corresponding actual experimental \nvalues. \n2.4.3. Determining optimum processing conditions \n One approach to optimize the data obtained from the screening stage is to run another \nround of full factorial designs involving the influential parameters obtained during the screening \nstage. This approach is usually used when there are a number of influential factors with relatively \nclose effects. A full factorial design would be implemented in this case to optimize the factors with \na design that has no confounding factors. In this set of experiments, however, only one or two \nsignificant parameters are already identified from the screening stage, so optimization will \nbasically focus on obtaining a suggested set of processing parameters that gives a required value of \nthe response within specified limits. \n Optimization was carried out using the desirability function approach to calculate \noptimum values of the input parameters (Lahey and Launsby 1998; Montgomery  2005). This \napproach searches for a combination of values for input factors to satisfy a requirement for an \noutput response (or multiple responses). The pre-set requirement of the function would be either to \nhit a target value within an upper and lower limit, to minimize the response value or to maximize \nthe response value. Another pre-set value of the function is the weight r, which specifies the \nfunction shape and emphasises (or deemphasises) the target value relative to the limit values. \n In case of one response being optimized, the individual desirability can be represented by \nthe equation (Minitab Inc. 2009): \ndi = fi(y)\nWi                                              (2) \nwhere Wi is the weight of the response, in this case equal to 1, and the function fi(y) depends on \nwhether the purpose of the optimisation is to hit a target, minimize or maximize. In this case, the \nfunction is desired to hit a target value T within upper and lower limits, so it can be represented by \nthe following equation, where U and L are the upper and lower limits, respectively (Montgomery \n2005): \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUy\nUyT\nTU\nyU\nTyL\nLT\nLy\nLy\nyfi\n\n\n0\n0\n)(\n                      (3) \n The function in equation (3) is linear because the weight r is set to 1. Otherwise, the \nbracket terms would have been raised to the power r1 and r2 that define the weights of the lower \nand upper limits, respectively. \n For each of the five parts investigated in this set of experiments, the target, upper and \nlower values were selected based on the filling quality of the produced samples. This was \nundertaken as follows. For each part, after each set of experiments, samples of the 16 runs were \ninspected under the microscope to check their filling quality. Although each run had a different \naverage mass, one or more runs (i.e. one or more combinations of factors) could have produced \ncompletely-filled samples. All the completely filled samples were weighed and an average mass \nwas calculated. The filled samples that had the smallest and the largest masses were also \n8 \nidentified. The average mass calculated from all of the filled samples was set as the target weight \nfor the desirability function. The masses of the filled samples with smallest and largest mass \nvalues were used as the pre-set lower and upper limits of the desirability function, respectively. \n3. Results \n3.1. Responses from the screening experiments \n Table 4 shows the average masses in milligrams of the 10 samples collected for each of \nthe five parts: \nStandard \nOrder \nTp Tm Ph Vi tc \nMass [mg] averaged from 10 samples \na b c d e \n1 - - - - + 91.0 86.4 84.8 88.3 86.9 \n2 + - - - - 91.2 87.3 85.2 88.5 88.0 \n3 - + - - - 91.9 87.8 84.9 88.6 87.5 \n4 + + - - + 91.2 87.4 85.3 88.8 89.6 \n5 - - + - - 92.5 88.4 87.0 90.0 91.6 \n6 + - + - + 93.4 87.9 86.7 89.8 91.6 \n7 - + + - + 93.6 88.3 87.2 89.9 91.6 \n8 + + + - - 93.8 88.7 87.2 90.5 92.1 \n9 - - - + - 90.6 86.6 84.8 87.4 89.3 \n10 + - - + + 90.4 86.7 85.0 87.7 88.1 \n11 - + - + + 90.7 86.5 85.2 87.8 88.1 \n12 + + - + - 91.3 87.3 85.8 88.4 90.7 \n13 - - + + + 92.8 88.2 86.5 89.4 90.6 \n14 + - + + - 93.2 88.2 87.1 89.6 92.2 \n15 - + + + - 93.2 88.0 87.1 89.8 91.0 \n16 + + + + + 93.0 88.3 87.3 89.8 92.5 \nTable 4. Average masses in mg for each of the five parts. \nFigure 3 shows a number of SEM micrographs of the replicated plastic parts. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig 3 SEM images of some of the replicated plastic parts \n Figures 4 to 8 show the Main-effects plots and Pareto charts of standardized effects \nplotted for the five moulded parts. A main-effect plot for a particular factor is a plot of the average \nof the data points at the low factor setting and the average of the data points at the high factor \nsetting. The larger the slope of the line that connects the two averages, the more important the \n500 μm \n \n500 μm \n \n500 μm \n \n500 μm \n \n9 \neffect is. A Pareto chart is a bar chart where bars are ordered in decreasing magnitude. The greater \nthe bar magnitude, the more effect its corresponding factor (or interaction) has on the response. In \nthe Pareto chart the following symbol set is used: polymer-melt temperature (A), mould \ntemperature (B), holding pressure (C), injection speed (D) and cooling time (E). \n In figure 4a main effect are plotted for each of the input parameters, with mass as the \noutput parameter.  Hence, for example, the first graph of figure 4a is a plot of mass against melt \ntemperature (A). \n In figure 4b factor effects are plotted as a bar chart, which are related to the averages of \nthe main-effect plots. Briefly, if Δ is the difference between the two averages of the response \npoints for a particular factor, i.e. the difference between the two points connected by the sloped \nline, then the effect bar corresponding to that particular factor is the absolute value of half the \neffect, i.e. |Δ\/2| (Lahey and Launsby 1998). \n Figure 4b plots both the main input parameters, for example, C the holding pressure, and \nthe interactions between input parameters, for example, BE, the interaction between the mould \ntemperature and the cooling time.  The vertical line on the figure corresponds to the threshold \nbeyond which factors become statistically significant at the significance level determined by the \nvalue of alpha. This value is determined from the t-distribution, where t is the 1-(alpha\/2) quantile \nof the distribution (Minitab Inc. 2009).  The significance of the effect can be found by the \nrelationship of the histogram value to this line. The alpha value, also referred to as the level of \nsignificance, is a measurement of risk in detecting effects, and is expressed as a probability \nbetween 0 and 1. An alpha value of 0.05 indicates that the chance of finding an effect that does not \nexist is only 5% (a confidence limit of 95%). \n Figures 5 to 8, representing the screening experiment data for parts b to e, are plotted \nusing the same approach. \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig 4 Screening results for part a: [a] Main effects plot, and [b] Pareto chart \n \n \n \n \n \n \n255240\n93.0\n92.5\n92.0\n91.5\n91.0\n8170 500250\n300200\n93.0\n92.5\n92.0\n91.5\n91.0\n74\nMelt T\nM\ne\na\nn\nMould Hold P\nInj v Cooling t\nMain Effects Plot for WT-R1\nData Means\n[a] \nBC\nAD\nCD\nBD\nAC\nDE\nAE\nA\nAB\nE\nCE\nBE\nD\nB\nC\n2.01.51.00.50.0\nT\ne\nrm\nEffect\n0.695\nA Melt T\nB Mould\nC Hold P\nD Inj v\nE C ooling t\nF actor Name\nPareto Chart of the Effects (Part A)\n(response is WT-R1, Alpha = 0.05)\n[b] \n10 \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig 5 Screening results for part b: [a] Main effects plot, and [b] Pareto chart \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig 6 Screening results for part c: [a] Main effects plot, and [b] Pareto chart \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig 7 Screening results for part d: [a] Main effects plot, and [b] Pareto chart \n \n \n \n \n \nAB\nBC\nDE\nCE\nD\nCD\nBE\nAE\nBD\nE\nAD\nAC\nA\nB\nC\n2.01.51.00.50.0\nT\ne\nrm\nEffect\n0.442\nA Melt T\nB Mould T\nC Hold P\nD Inj. V\nE C ool t\nF actor Name\nPareto Chart of the Effects for Part c\n(response is part mass, Alpha = 0.05)\n[b] \nDE\nAD\nBD\nBC\nAE\nCE\nAC\nAB\nBE\nCD\nE\nA\nB\nD\nC\n1.81.61.41.21.00.80.60.40.20.0\nT\ne\nrm\nEffect\n0.282\nA Melt T.\nB Mould T.\nC Hold P.\nD Inj. v .\nE C ool t.\nF actor Name\nPareto Chart of the Effects for Part d\n(response is WT-R1, Alpha = 0.05)\n[b] \n250230\n90.0\n89.5\n89.0\n88.5\n88.0\n8472 300100\n300200\n90.0\n89.5\n89.0\n88.5\n88.0\n63\nMelt T.\nM\ne\na\nn\nMould T. Hold P.\nInj. v. Cool t.\nMain Effects Plot for WT-R1 (Part d)\nData Means\n[a] \n250230\n87.0\n86.5\n86.0\n85.5\n85.0\n8472 300100\n300200\n87.0\n86.5\n86.0\n85.5\n85.0\n63\nMelt T\nM\ne\na\nn\nMould T Hold P\nInj. V Cool t\nMain Effects Plot for Part c\nData Means\n[a] \n250230\n88.2\n87.9\n87.6\n87.3\n87.0\n8072 300100\n300200\n88.2\n87.9\n87.6\n87.3\n87.0\n74\nMelt T\nM\ne\na\nn\nMould T Hold P\nInj. V. Cooling t.\nMain Effects Plot for Part B\nData Means\n[a] \nAE\nBE\nAB\nAD\nCD\nAC\nBC\nCE\nBD\nA\nDE\nD\nE\nB\nC\n1.41.21.00.80.60.40.20.0\nT\ne\nrm\nEffect\n0.686\nA Melt T\nB Mould T\nC Hold P\nD Inj. V .\nE C ooling t.\nF actor Name\nPareto Chart of the Effects for Part B\n(response is part mass, Alpha = 0.05)\n[b] \n11 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig 8 Screening results for part e: [a] Main effects plot, and [b] Pareto chart \n3.2. Desirability function processing conditions \n Table 5 tabulates desired part mass, the calculated optimum values of the process \nparameters to achieve these mass values and actual part mass obtained experimentally at these \nprocessing conditions. \n The desired part masses were derived from the screening experiments. The moulded \nsamples are inspected, and the completely filled samples are identified and weighed. The average \nmass of the complete samples is used as the “target” mass for the desirability function. The \nminimum and maximum masses of the completely filled samples are input as the lower and upper \nlimits for the target mass, respectively. They are tabulated in table 5 as the target mass and a \nminimum and maximum acceptable mass value. \n The experimental conditions, i.e. the levels of the input parameters, predicted to achieve \nthose masses are outputs of the desirability function.  These are tabulated in table 5 for each of the \nfive input variables (denoted as “required levels”). \n In table 5, the “experimental mass” is the average mass of ten samples collected randomly \nafter the moulding machine had reached stability. The minimum and maximum values are the \nmass of the samples with lowest and highest mass magnitude within the ten samples, respectively. \nP\nart \nDesired mass [mg] Required levels of process parameters \nExperimental mass \n[mg] \nTarget Min. Max. \nTp \n[°C] \nTm \n[°C] \nVi \n[mm\/s] \nPh \n[bar] \ntc [sec] Avg. Min. Max. \na 93.1 92.6 93.6 250 81 200 416 4 93.1 92.9 93.3 \nb 88.6 88.2 89.0 250 80 200 300 4 88.7 88.4 88.9 \nc 86.5 86.0 87.0 250 81 300 170 3 86.7 86.2 86.9 \nd 90.0 89.6 90.4 250 84 200 300 3 90.1 89.9 90.3 \ne 92.5 92.0 93.0 243 84 300 300 3 92.0 91.8 92.2 \nTable 5. Required masses and limits, calculated optimum parameters and corresponding \nexperimental results. \nBD\nAD\nAE\nAC\nCE\nBC\nE\nD\nBE\nDE\nCD\nB\nAB\nA\nC\n3.53.02.52.01.51.00.50.0\nT\ne\nrm\nEffect\n1.703\nA Melt T\nB Mold T\nC Hold P\nD Inj v\nE C ool t\nF actor Name\nPareto Chart of the Effects (Part E)\n(response is Wt2 (3), Alpha = 0.05)\n[b] \n250230\n92.5\n92.0\n91.5\n91.0\n90.5\n8470 300100\n300150\n92.5\n92.0\n91.5\n91.0\n90.5\n63\nMelt T\nM\ne\na\nn\nMold T Hold P\nInj v Cool t\nMain Effects Plot for Part E\nData Means\n[a] \n12 \n4. Discussion \n4.1. Screening stage \n Figures 4 to 8 show a significant effect of holding pressure for all the five parts, with four \nparts, a, b, c and e, showing it as the only significant effect. This substantial effect was also visible \nduring the experiments, as all samples that were produced at a lower level of holding pressure \nexhibited evidence of incomplete filling, regardless of the levels of the other four parameters. In \ncontrast, cooling time had no effect for any of the parts. \n For Part d, three significant effects were observed: holding pressure, injection velocity \nand mould temperature. However, aside from Part d, mould temperature and injection velocity had \nno apparent effect on the mass of other parts.  \n The importance of holding pressure lies in the fact that it overcomes the tendency of the \npolymer melt to prematurely freeze before the injection process is complete. Premature freezing is \nlikely to be exacerbated by the relatively high rate of heat transfer between the polymer and the \nmould walls for parts with micro-scaled dimensions. In prior work (Zhao et al. 2003a; Zhao et al. \n2003b), metering volume and holding pressure time were used as factors. In this work, metering \nsize was kept constant, as it was determined from the familiarization stage (Section 2.4.1), and the \nholding pressure value was used rather than the holding pressure time. It is possible that both the \nholding pressure magnitude and time (or their interaction) would be significant if they are used \ntogether as factors in a more extended DOE plan. \n The lack of significance of cooling time is consistent with previous work (Zhao et al. \n2003a; Zhao et al. 2003b). This is because the effect of cooling in injection moulding is usually \nassociated with changes in the component geometry (e.g. shrinkage, warpage) (Osswald 2001), but \nthe cooling scheme does not have the same effect on the part weight as its effect takes place after \nthe cavity is already filled. \n The lack of significance of mould temperature may lie in the selection of the two levels at \nvalues below the Tg of the polymer. This is consistent with the data presented in (Shen et al. 2002) \nwhere increasing the mould temperature improved the filling quality, although all the experiments \nwere performed while the mould temperature was below the Tg of the PMMA. It is less consistent \nwith the numerical simulation data of (Zhao et al. 2003a) which predicted short shots unless the \nmould temperature was raised above the Tg of the PMMA. \n The general tendency found here of the lack of significance of melt temperature was also \nfound in prior work.  For small part volumes, like those found in micro-moulding, the melt \ntemperature decreases at a very high rate once the polymer contacts the cavity walls, as long as the \nmould temperature is kept below the melt temperature of the polymer (Yao and Kim 2004). In the \nwork presented here, both the high and low levels of the mould temperature were kept below Tg. \nHence, by the time the polymer filled the part cavity it would have seen a significant reduction in \nits temperature. \n The lack of significance of the injection velocity as a parameter may lie in the relatively \nsmall change of shear rate associated with changing between the two levels of injection velocity. \nThe relation between shear rate and injection velocity can be approximated by (Osswald 2001): \n3\n4\nr\nQ\n\n\n\n                                        (4) \n13 \nwhere \nQ\nis the volume flow rate, and r is the radius of the flow path cross section (in this case the \npart gate). The flow rate is a function of the injection speed Vi, so equation (4) can be rewritten as: \n3\n24\nr\nRVi                                   (5) \nwhere R is the radius of the injection plunger.  \n Since the gates have a rectangular cross section (1 x 0.5 mm), the equivalent hydraulic \ndiameter may be used in equation (5) to estimate the value of r. The calculated shear rates based \non low-level and high-level value for injection velocity both have an order of magnitude of 10\n5\n s\n-1\n. \nShear rate vs. viscosity data for the PMMA grade used indicates that these shear rates correspond \nto viscosities in the order of 10\n1\n Pa.s at 230°C at which no significant shear-thinning behaviour \nwould be observed. \n4.2. Desirability function processing conditions \n Table 5 presented the suggested processing parameters for improved filling, which are \nobtained by meeting the conditions listed in equation (3). It should be noted that the desirability \nfunction cannot recommend parameter values outside the lower and high levels of the factors. \nWhilst certain parameter values in table 5 lie between the high and low levels, the majority lie \neither at the high level or the low level. This is indicates that the desirability function might have \nrecommended an even higher or lower level of the parameter, had the original levels been more \nwidely spread. \n Table 5 shows also that the average masses of the parts produced under the conditions \npredicted by the desirability function lie within 0.5% of the specified target values. All the \nproduced parts were within the mass upper limit pre-set in the function, but for Parts b and e, some \nof the produced samples were under the lower limit by approximately 0.2 mg. \n Figure 9 shows an example of how the desirability function improved the filling quality \nof the parts. Figure 9 (a) shows a view of a sample of Part d from the screening stage (run 5) where \nsome areas of the edges that are close to the last filled point are incomplete. Voids can also be seen \non the surface around the cylindrical hole. Figure 9 (b) shows the same part after application of the \ndesirability function, where the edges are completely filled and voids are no longer apparent on the \npart surface. \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig 9 SEM micrograph of samples of Part d. 4(a) an example before applying the desirability \nfunction (Tp = 230°C, Tm =72°C, Vi = 300 mm\/s, Ph = 100 bar and tc = 3 s); 4(b) after applying the \ndesirability function (Tp = 250°C, Tm =84°C, Vi = 200 mm\/s, Ph = 300 bar and tc = 3) \n500 μm \nIncomplete edge (a) (b) \n14 \n Table 5 shows the data from applying the desirability function independently to each part. \nHowever, an individual-part desirability function approach is difficult to extend to a prediction of \nany compromise parameters which would be result in relatively high filling quality for all the five \nparts if they were produced by a single mould in one shot. \n One method to achieve such a compromise might be to discern if there were general \ntrends that could be observed when comparing the desirability function to the screening \nparameters, and then apply these trends in required process parameters to establish compromise \nconditions. In effect, this means comparing the required levels of process parameters in table 5 \nwith the envelope of parameter high and low levels of table 2. Such a comparison does show that \ngeneral trends are present, independent of the part shape.  The desirability function predicts that \nsetting the melt temperature, mould temperature and holding pressure to their high levels would \ngenerally result in better filling, as does, with a few exceptions, setting the injection velocity and \ncooling temperature to their low levels. \nTable 6 shows a set of compromise processing conditions constructed following these general \ntrends in desirable process parameters.  To test this prediction, the micro-mould was reconfigured \nsuch that all the five parts are injected through a common runner system, and parts processed using \nthe conditions of table 6: \nParameter Tp [°C] Tm [°C] Vi [mm\/s] Ph [bar] tc [s] \nValue 250 84 200 300 3 \nTable 6. Processing parameters for a five-part micro-moulded component. \n The produced part is shown in figure 10, where all the parts were checked under the \nmicroscope to be completely filled. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nFig 10 A photograph of a completely filled, five-part plastic component produced under \ncompromise conditions \n4.3. Effect of part geometry \n The results shown in figures 4 to 8 provide some information on the effect of the mould \ngeometry on the filling quality of the part.  \n As noted in section 4.1, for Part d, other effects, in addition to the holding pressure, were \nof significance in filling quality. It seems likely that this is owing to the relatively high geometrical \ncomplexity of this part in comparison to the other parts. This complexity is generated from the \n10 mm \n15 \nfour micro-scaled flow paths that exist in Part d, which represent a rapid change in part thickness \nthat imposes „extra resistance‟ on the flow of the material to completely fill the cavity. Figure 11 \npresents photographs of mouldings of Parts a and d, as being at the two extremes of geometrical \ncomplexity amongst the five moulded parts. The mouldings are „short shots‟ produced to visualise \nthe difference in filling sequence between the two parts. \n \n \n \n \n \n \n \n \n \n \n \n \nFig 11 (a) Short shot of Part a. (b) Short shot of Part d \n In Part a the last filled point is located at the far end of the flow path, whereas in Part d \nthe last filled point is located close to the centre. Such differences are expected as a consequence \nof the „hesitation effect‟ commonly seen in polymer flow, where, in cavities with varying \nthickness values, polymer melts tend to fill areas with larger thickness before they flow into \nsmaller thicknesses. In Part a, where the part thickness is uniform, the polymer fills the cavity \ngradually as the flow path is divided at the central “pin” of the mould and then rejoins afterwards \nforming a weld line. In Part d, the rapid change in thickness causes the polymer flow to experience \nhesitation during the filling process, and a higher injection pressure will be required for the \npolymer to flow through these features. Larger flow-path cross-sections, for example the perimeter \nof the shape in Part d, are filled before the polymer starts to pass through the four “openings” at \nthe centre area of the part (see figure 1 Part d). \n Owing to the relatively small dimensions of each of the four openings (500 x 600 μm) a \nhigh possibility of premature freezing would be expected at these locations. Similarly to \nconventional injection moulding, the cooling time of the polymer during micromoulding is \ndependent, among other factors, on the part thickness squared (Yao and Kim 2004). This indicates \nthat the cooling process in Part d, where, in the four opening areas, the minimum thickness is 500 \nμm, is much faster than, for example, Parts a and b, where the minimum thickness is 950 μm to 1 \nmm. \n The rapid decrease in thickness does not only affect the freezing process, but it also \ninfluences other parameters. As suggested in the literature (Yao and Kim 2004), as the part \nthickness decreases to fractions of a millimetre, a drastic increase is observed in the injection \npressure required to fill the cavity, and a higher possibility of incomplete filling is expected. This \nis particularly observed for cold-mould filling, i.e. when mould temperature is lower than the melt \ntemperature, as is the case in this work. This explains why mould temperature becomes significant \nat such rapid changes in thickness as seen in Part d. Part thickness also affects the role of injection \nspeed on the required filling pressure. As the thickness decreases, the variation in injection speed \nbecomes more significant in affecting the injection pressure required to fill the mould cavity (Yao \nand Kim 2004).  \n[b] \nGate location \nLast filled point [a] \nGate location \nLast filled point \n16 \n5. Conclusions \n In order to investigate the effect of part geometry on moulding parameters, this paper \ninvestigated the moulding parameters of five different micro-parts using mass as an experiment \nresponse. Parts differed in the through-hole and surface geometries, but had a constant outer radius \nand similar thicknesses. The same polymer, a PMMA grade, was used throughout the experiments. \n A three-stage design of experiments approach consisting of feasibility, screening and \ndesirability function, was undertaken to evaluate the filling quality in micro-injection moulding \nand correlate it to the processing parameters. It was shown that holding pressure was the main \ninfluential processing parameter for all of the part geometries.  \n A comparison of desirable moulding parameters for different part geometries, showed the \ninfluence of geometry on processing conditions. Sharp changes in thickness within a part \ncorrelated with an increase in the number of significant moulding parameters. For a complex part, \ninjection speed and mould temperature became statistically significant. \n For each part, a desirability function was used to specify a combination of processing \nconditions that would improve filling quality. The produced parts had average masses that were \nwithin 0.5% of the target values.  \n Comparing the desirability function predictions with the high and low parameter values of \nthe screening stage showed, with some exceptions, that regardless of part geometry, desirability \nfunction predictions for a particular process parameter exhibited clustering behaviour. These \ntrends in clustering behaviour were used to produce a set of compromise moulding conditions to \nmicromould a multi-part component. Multi-part components moulded using these parameters \nexhibited complete filling in each of the five parts. \nReferences \nAttia UM, Marson S and Alcock JR (2009) Micro-injection moulding of polymer microfluidic \ndevices. Microfluid Nanofluid 7:1-28 \nAufiero R (2005) The effect of process conditions on part quality in microinjection molding. \nANTEC: Proc Annual Technical Conf (Boston, MA, 1-5 May 2005):36-40 \nDe Mello A (2002) Plastic fantastic? Lab Chip 2:31N-36N \nEriksson L, Johansson N, Kettaneh-Wold N, Wikstrom C and Wold S (2008) Design of experiments: \nprinciples and applications, 3rd edn. Umetrics, Umeå \nGriffiths CA, Dimov S, Brousseau EB, Chouquet C, Gavillet J and Bigot S (2008) Micro-injection \nmoulding: surface treatment effects on part demoulding. Proc 4M2008 (Cardiff, UK, 9th - 11th \nSeptember 2008) \nGriffiths C, Dimov S, Brousseau EB and Hoyle RT (2007) The effects of tool surface quality in \nmicro-injection moulding. J Mater Process Tech 189:418-27 \nJung W-C, Heo Y-M, Shin K-H, Yoon G-S and Chang S-H (2007) An experimatal study on micro \ninjection paramaters. ANTEC: Proc Annual Technical Conf (Cincinnati, OH, 6-11 May 2007): 638-\n642 \nLahey JP and Launsby RG (1998) Experimental design for injection molding. Launsby Consulting, \nColorado Springs, CO \n17 \nLee B-K, Hwang CJ, Kim DS and Kwon TH (2008) Replication quality of flow-through microfilters in \nmicrofluidic lab-on-a-chip for blood typing by microinjection molding. J Manuf Sci E-T ASME \n130:0210101-0210108 \nMarson S, Attia UM, Allen DM, Tipler P, Jin T, Hedge J and Alcock JR (2009) Reconfigurable micro-\nmould for the manufacture of truly 3D polymer microfluidic devices. Proc CIRP Design Conf \n(Cranfield, UK, 30-31 March 2009):343-346 \nMinitab Inc. Available at: www.minitab.com. Accessed 2009 \nMönkkönen K, Hietala J, Pääkkönen P, Pääkkönen EJ, Kaikuranta T, Pakkanen TT and Jääskeläinen \nT (2002) Replication of sub-micron features using amorphous thermoplastics. Polym Eng Sci 42: \n1600-1608 \nMontgomery DC (2005). Design and analysis of experiments, 6th edn. Wiley, Hoboken, Great \nBritain \nOsswald T, Turng L and Gramann P (Editors) (2001) Injection molding handbook. Hanser\/Gardner \nPublications, Cincinnti, OH \nPirskanen J, Immonen J, Kalima V, Pietarinen J, Siitonen S, Kuittinen M, Mönkkönen K, Pakkanen \nT, Suvanto M and Pääkkönen EJ (2005) Replication of sub-micrometre features using \nmicrosystems technology. Plast Rubber Compos 34:222-226 \nSha B, Dimov S, Griffiths C and Packianather MS (2007a) Investigation of micro-injection \nmoulding: factors affecting the replication quality. J Mater Process Technol 183:284-296 \nSha B, Dimov S, Griffiths C and Packianather MS (2007b) Micro-injection moulding: factors \naffecting the achievable aspect ratios. Int J Adv Manuf Technol 33:147-156 \nShen YK, Yeh SL and Chen SH (2002) Three-dimensional non-Newtonian computations of micro-\ninjection molding with the finite element method. Int Commun Heat Mass 29:643-652 \nTosello G, Gava A, Hansen HN and Lucchetta G (2007) Influence of process parameters on the \nweld lines of a micro injection molded component. ANTEC: Proc Annual Technical Conf \n(Cincinnati, OH, 6-11 May 2007):2002-2006 \nWimberger-Friedl R (2000) Injection molding of sub-μm grating optical elements. J Inject Molding \nTechnol 4:78-83 \nYao D and Kim B (2004) Scaling issues in miniaturization of injection molded parts\", J Manuf Sci \nEng Trans ASME, vol. 126, no. 4, pp. 733-739. \nYao D and Kim B (2002) Injection molding high aspect ratio microfeatures. J Manuf Sci E-T ASME \n126:11-17 \nZhao J, Mayes R, Chen G, Xie H and Chan P (2003a) Effects of process parameters on the micro \nmolding process. Polym Eng Sci 43:1542-1554 \nZhao J, Mayes R, Chen G, Chan PS and Xiong ZJ (2003b) Polymer micromould design and \nmicromoulding process. Plast Rubber Compos 32:240-247 \n"}