{"doi":"10.1016\/j.trf.2009.11.004","coreId":"140985","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/5240","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/5240","10.1016\/j.trf.2009.11.004"],"title":"The effect of social desirability on self reported and recorded road traffic\naccidents","authors":["af Wahlberg, Anders E.","Dorn, Lisa","Kline, T."],"enrichments":{"references":[{"id":37923421,"title":"A challenge to the assumed generalizability of prediction and countermeasure for risky driving: Different factors predict different risky driving behaviors.","authors":[],"date":"2007","doi":"10.1016\/j.jsr.2006.09.003","raw":"Fernandes,  R.,  Job,  R.  F.,  &  Hatfield,  J.  (2007).  A  challenge  to  the  assumed generalizability of prediction and countermeasure for risky driving: Different factors predict different risky driving behaviors. Journal of Safety Research, 38, 59-70.","cites":null},{"id":37923433,"title":"A meta-analytic review and empirical test of the potential confounding effects of social desirability response sets in organizational behaviour research.","authors":[],"date":"1992","doi":"10.1111\/j.2044-8325.1992.tb00490.x","raw":"Moorman, R. H., & Podsakoff, P. M. (1992). A meta-analytic review and empirical test of the potential confounding effects of social desirability response sets in organizational behaviour research. Journal of Occupational and Organizational Psychology, 65, 131-149.","cites":null},{"id":37923404,"title":"A new scale of social desirability independent of psychopathology.","authors":[],"date":"1960","doi":"10.1037\/h0047358","raw":"Crowne, D. P., & Marlowe, D. (1960). A new scale of social desirability independent of psychopathology. Journal of Consulting Psychology, 24, 349-354.","cites":null},{"id":37923441,"title":"Aberrant driving behaviours amongst New Zealand truck drivers.","authors":[],"date":"2002","doi":"10.1016\/s1369-8478(02)00019-0","raw":"Sullman, M. J., Meadows, M. L., & Pajo, K. B. (2002). Aberrant driving behaviours amongst New Zealand truck drivers. Transportation Research Part F, 5, 217-232.","cites":null},{"id":37923447,"title":"An epidemiological study of serious traffic offenders.","authors":[],"date":"1974","doi":"10.1007\/bf00589175","raw":"Williams, C. L., Henderson, A. S., & Mills, J. M. (1974). An epidemiological study of serious traffic offenders. Social Psychiatry, 9, 99-109. af Wåhlberg, A. E. (in press). Driver Behaviour and Accident Research Methodology; Unresolved Problems. Aldershot: Ashgate. af Wåhlberg, A. E. (submitted, a). Re-education of young driving offenders; effects on self-reports of driver behaviour. af Wåhlberg, A. E. (submitted, b). Social desirability effects in driver behaviour inventories.","cites":null},{"id":37923427,"title":"Are aggressive people aggressive drivers? A study of the relationship between self-reported general aggressiveness, driver anger and aggressive driving. Accident Analysis and Prevention,","authors":[],"date":"2001","doi":"10.1016\/s0001-4575(00)00039-7","raw":"Lajunen, T., & Parker, D. (2001). Are aggressive people aggressive drivers? A study of  the  relationship  between  self-reported  general  aggressiveness,  driver  anger  and aggressive driving. Accident Analysis and Prevention, 33, 243-255.","cites":null},{"id":37923449,"title":"Bus driver accident record; the return of accident proneness.","authors":[],"date":"2009","doi":"10.1080\/14639220801912597","raw":"af Wåhlberg, A. E., & Dorn, L. (2009). Bus driver accident record; the return of accident proneness. Theoretical Issues in Ergonomics Science, 10, 77-91. af Wåhlberg, A. E., Dorn, L., & Kline, T. (in press). The Manchester Driver Behaviour Questionnaire as predictor of road traffic accidents. Theoretical Issues in Ergonomics Science,   12","cites":null},{"id":37923428,"title":"Can we trust self-reports of driving? Effects of impression management on driver behaviour questionnaire responses.","authors":[],"date":"2003","doi":"10.1016\/s1369-8478(03)00008-1","raw":"Lajunen, T., & Summala, H. (2003). Can we trust self-reports of driving? Effects of impression management on driver behaviour questionnaire responses. Transportation Research Part F, 6, 97-107.","cites":null},{"id":37923445,"title":"Cognitive failures as predictors of driving errors, lapses, and violations. Accident Analysis and Prevention,","authors":[],"date":"2008","doi":"10.1016\/j.aap.2008.01.006","raw":"Wickens, C. M., Toplak, M. E., & Wiesenthal, D. L. (2008). Cognitive failures as predictors of driving errors, lapses, and violations. Accident Analysis and Prevention, 40, 1223-1233.","cites":null},{"id":37923402,"title":"Convergent and discriminant validation by the multitrait-multimethod matrix.","authors":[],"date":"1959","doi":"10.1037\/h0046016","raw":"Campbell, D.T., & Fiske, D.W. (1959). Convergent and discriminant validation by the multitrait-multimethod matrix. Psychological Bulletin, 56, 81-105.","cites":null},{"id":37923426,"title":"Cross-cultural differences in drivers‟ self-assessments of their perceptual-motor and safety skills: Australians and Finns. Personality and Individual Differences,","authors":[],"date":"1998","doi":"10.1016\/s0191-8869(97)00202-x","raw":"Lajunen, T., Corry, A., Summala, H., & Hartley, L. (1998). Cross-cultural differences in drivers‟ self-assessments of their perceptual-motor and safety skills: Australians and Finns. Personality and Individual Differences, 24, 539-550.","cites":null},{"id":37923448,"title":"Culpable versus non-culpable traffic accidents; what is wrong with this picture?","authors":[],"date":"2007","doi":"10.1016\/j.jsr.2007.01.013","raw":"af Wåhlberg, A. E., & Dorn, L. (2007). Culpable versus non-culpable traffic accidents; what is wrong with this picture? Journal of Safety Research, 38, 453-459.","cites":null},{"id":37923418,"title":"Designing a Psychometrically-Based Self Assessment to Address Fleet Driver Risk.","authors":[],"date":"2008","doi":null,"raw":"Dorn, L, & Gandolfi, J. (2008) Designing a Psychometrically-Based Self Assessment to Address Fleet Driver Risk. In Dorn L (Ed) Driver Behaviour and Training Vol III. Human Factors in Road and Rail Safety. Ashgate: Aldershot.","cites":null},{"id":37923417,"title":"Development and evaluation of a measure of dangerous, aggressive, negative emotional, and risky driving.","authors":[],"date":"2003","doi":"10.1111\/j.1559-1816.2003.tb01896.x","raw":"Dula, C. S., & Ballard, M. E. (2003). Development and evaluation of a measure of dangerous, aggressive, negative emotional, and risky driving. Journal of Applied Social Psychology, 33, 263-282.","cites":null},{"id":37923419,"title":"Development of a psychometric measure of bus driver behaviour.","authors":[],"date":"2005","doi":null,"raw":"Dorn, L, & Garwood, L. (2005). Development of a psychometric measure of bus driver behaviour.  Behavioural Research in Road Safety: 14th Seminar. Department for Transport: London.","cites":null},{"id":37923440,"title":"Factors influencing the use of cellular (mobile) phone during driving and hazards while using it. Accident Analysis and Prevention,","authors":[],"date":"2005","doi":"10.1016\/j.aap.2004.06.003","raw":"Pöysti, L., Rajalin, S., & Summala, H. (2005). Factors influencing the use of cellular (mobile) phone during driving and hazards while using it. Accident Analysis and Prevention, 37, 47-51.","cites":null},{"id":37923425,"title":"Impression management and self-deception in traffic behaviour inventories.","authors":[],"date":"1997","doi":"10.1016\/s0191-8869(96)00221-8","raw":"Lajunen, T., Corry, A., Summala, H., & Hartley, L. (1997). Impression management and self-deception in traffic behaviour inventories. Personality and Individual Differences, 22, 341-353.","cites":null},{"id":37923444,"title":"Individual differences in accident risk: a review of findings and an examination of methods.","authors":[],"date":"1995","doi":null,"raw":"West, R. J. (1995). Individual differences in accident risk: a review of findings and an examination of methods. In Proceedings of Behavioural Research in Road Safety VI.","cites":null},{"id":37923405,"title":"Intoxicated and bad drivers: Subgroups within the same population of high-risk drivers.","authors":[],"date":"1985","doi":"10.15288\/jsa.1985.46.375","raw":"Donovan,  D.  M.,  Queisser,  H.  R.,  Salzberg,  P.  M.,  &  Umlauf,  R.  L.  (1985). Intoxicated  and  bad  drivers:  Subgroups  within  the  same  population  of  high-risk drivers. Journal of Studies on Alcohol, 46, 375-382.","cites":null},{"id":37923430,"title":"Predicting road traffic accidents: The role of social deviance and violations.","authors":[],"date":"1997","doi":"10.1111\/j.2044-8295.1997.tb02633.x","raw":"Lawton, R., Parker, D., Stradling, S. G., & Manstead, A. S. (1997). Predicting road traffic  accidents:  The  role  of  social  deviance  and  violations.  British  Journal  of Psychology, 88, 249-262.","cites":null},{"id":37923401,"title":"Risk-mitigating beliefs, risk estimates, and selfreported speeding in a sample of Australian drivers.","authors":[],"date":"2003","doi":"10.1016\/s0022-4375(03)00006-9","raw":"Brown, S. L., & Cotton, A. (2003). Risk-mitigating beliefs, risk estimates, and selfreported speeding in a sample of Australian drivers. Journal of Safety Research, 34, 183-188.","cites":null},{"id":37923442,"title":"Self-assessment of driving skill - A review from a measurement perspective.","authors":[],"date":"2008","doi":"10.1016\/j.trf.2007.05.002","raw":"Sundström, A. (2008). Self-assessment of driving skill - A review from a measurement perspective. Transportation Research Part F, 11, 1-9.","cites":null},{"id":37923423,"title":"Self-reported driving habits are valid predictors of violations and accidents.","authors":[],"date":"1997","doi":"10.1016\/s0001-4575(00)00090-7","raw":"Hatakka, M., Keskinen, E., Katila, A., & Laapotti, S. (1997). Self-reported driving habits are valid predictors of violations and accidents. In T. Rothengatter & E. C. Vaya,  Traffic  and  Transport  Psychology,  Theory  and  Application,  pp.  295-303. Amsterdam: Pergamon.","cites":null},{"id":37923424,"title":"Socially desirable responding in personality assessment: Still more substance than style.","authors":[],"date":"2008","doi":"10.1016\/j.paid.2008.02.012","raw":"Kurtz, J. E., Tarquini, S. J., & Iobst, E. A. (2008). Socially desirable responding in personality assessment: Still more substance than style. Personality and Individual Differences, 45, 22-27.","cites":null},{"id":37923435,"title":"Substance and bias in social desirability responding.","authors":[],"date":"2003","doi":"10.1016\/s0191-8869(02)00187-3","raw":"Pauls, C. A., & Stemmler, G. (2003). Substance and bias in social desirability responding. Personality and Individual Differences, 35, 263-275.","cites":null},{"id":37923446,"title":"The Dula Dangerous Driving Index: An investigation of reliability and validity across cultures. Accident Analysis and Prevention,","authors":[],"date":"2008","doi":"10.1016\/j.aap.2007.09.019","raw":"Willemsen, J., Dula, C. S., Declerq, F., & Verhaeghe, P. (2008). The Dula Dangerous Driving Index: An investigation of reliability and validity across cultures. Accident Analysis and Prevention, 40, 798-806.","cites":null},{"id":37923443,"title":"The effects of social desirability bias on applied measures of goal orientation.","authors":[],"date":"2005","doi":"10.1016\/j.paid.2004.11.015","raw":"Tan, J. A., & Hall, R. J. (2005). The effects of social desirability bias on applied measures of goal orientation. Personality and Individual Differences, 38, 1891-1902.","cites":null},{"id":37923400,"title":"The Five-factor model, conscientiousness, and driving accident involvement.","authors":[],"date":"1996","doi":"10.1111\/j.1467-6494.1996.tb00523.x","raw":"Arthur, W., Jr., & Graziano, W. G. (1996). The Five-factor model, conscientiousness, and driving accident involvement. Journal of Personality, 64, 593-618.","cites":null},{"id":37923422,"title":"The impact of social desirability bias on the EPQ-R item scores: An item response theory analysis.","authors":[],"date":"2008","doi":"10.1016\/j.paid.2008.02.005","raw":"Ferrando,  P.  J.  (2008).  The  impact  of  social  desirability  bias  on  the  EPQ-R  item scores: An item response theory analysis. Personality and Individual Differences, 44, 1784-1794.","cites":null},{"id":37923403,"title":"The relationships between organizational and individual variables to on-the-job driver accidents and accident-free kilometres.","authors":[],"date":"2004","doi":"10.1080\/00140130412331293355","raw":"Caird,  J.  K.,  &  Kline, T.  J.  (2004).  The  relationships  between  organizational  and individual  variables  to  on-the-job  driver  accidents  and  accident-free  kilometres. Ergonomics, 47, 1598-1613.   9 Clarke,  S.,  &  Robertson,  I.  T.  (2005).  A  meta-analytic  review  of  the  Big  Five personality factors and accident involvement in occupational and non-occupational settings. Journal of Occupational and Organizational Psychology, 78, 355–376.","cites":null},{"id":37923420,"title":"The Social Desirability Variable in Personality Assessment and Research.","authors":[],"date":"1957","doi":"10.1177\/001316445901900321","raw":"Edwards, A. L. (1957). The Social Desirability Variable in Personality Assessment and Research. New York: Dryden.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-03-31T00:00:00Z","abstract":"The use of lie scales has a fairly long history in psychometrics, with the\nintention of identifying and correcting for socially desirable answers. This\nrepresents one type of common method variance (bias introduced when both\npredictors and predicted variables are gathered from the same source), which may\nlead to spurious associations in self-reports. Within traffic safety research,\nwhere self-report methods are used abundantly, it is uncommon to control for\nsocial desirability artifacts, or reporting associations between lie scales,\ncrashes and driver behaviour scales. In the present study, it was shown that\nself-reports of traffic accidents were negatively associated with a lie scale\nfor driving, while recorded ones were not, as could be expected if the scale was\nvalid and a self-report bias existed. We conclude that whenever self-reported\ncrashes are used as an outcome variable and predicted by other self-report\nmeasures, a lie scale should be included and used for correcting the\nassociations. However, the only existing lie scale for traffic safety is not\nlikely to catch all socially desirable responding, because traffic safety may\nnot be desirable for all demographic groups. New lie scales should be developed\nspecifically for driver behaviour questionnaires, to counter potential bias and\nartifactual results. Alternatively, the use of a single source of data should be\ndiscontinued. (C) 2009 Elsevier Ltd. All rights reserved","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140985.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.trf.2009.11.004","pdfHashValue":"9547f8d26dae3ea2a6a33e301133da2c89842452","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/5240<\/identifier><datestamp>2012-01-31T16:15:48Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>The effect of social desirability on self reported and recorded road traffic\naccidents<\/dc:title><dc:creator>af Wahlberg, Anders E.<\/dc:creator><dc:creator>Dorn, Lisa<\/dc:creator><dc:creator>Kline, T.<\/dc:creator><dc:subject>Common method variance Social desirability DSDS Methodology Self-report Accident drivers behavior bias involvement violations substance scale<\/dc:subject><dc:description>The use of lie scales has a fairly long history in psychometrics, with the\nintention of identifying and correcting for socially desirable answers. This\nrepresents one type of common method variance (bias introduced when both\npredictors and predicted variables are gathered from the same source), which may\nlead to spurious associations in self-reports. Within traffic safety research,\nwhere self-report methods are used abundantly, it is uncommon to control for\nsocial desirability artifacts, or reporting associations between lie scales,\ncrashes and driver behaviour scales. In the present study, it was shown that\nself-reports of traffic accidents were negatively associated with a lie scale\nfor driving, while recorded ones were not, as could be expected if the scale was\nvalid and a self-report bias existed. We conclude that whenever self-reported\ncrashes are used as an outcome variable and predicted by other self-report\nmeasures, a lie scale should be included and used for correcting the\nassociations. However, the only existing lie scale for traffic safety is not\nlikely to catch all socially desirable responding, because traffic safety may\nnot be desirable for all demographic groups. New lie scales should be developed\nspecifically for driver behaviour questionnaires, to counter potential bias and\nartifactual results. Alternatively, the use of a single source of data should be\ndiscontinued. (C) 2009 Elsevier Ltd. All rights reserved.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-11-13T23:24:50Z<\/dc:date><dc:date>2011-11-13T23:24:50Z<\/dc:date><dc:date>2010-03-31T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>1369-8478<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.trf.2009.11.004<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/5240<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1369-8478","1369-8478"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Common method variance Social desirability DSDS Methodology Self-report Accident drivers behavior bias involvement violations substance scale"],"subject":["Article"],"fullText":" 1 \nThe effect of social desirability on self reported and recorded \nroad traffic accidents \n \n \n \nA.E. af Wåhlberg* (a) \nL. Dorn (b) \nand \nT. Kline (c) \n \n a. Department of Psychology \nUppsala University  \nUppsala, Sweden \n \nb. Department of Systems Engineering and Human Factors,  \nCranfield University  \nCranfield, United Kingdom \n \nc. University of Calgary \nCalgary, Canada \n \n* Corresponding author \n \nAbstract \nThe use of lie scales has a fairly long history in psychometrics, with the intention of identifying and \ncorrecting for socially desirable answers. This is one type of common method variance (when both \npredictors and predicted variables are gathered from the same source), which may lead to spurious \nassociations in self-reports. Within traffic safety research, where self-report methods are used \nabundantly, it is uncommon to control for social desirability artifacts, or reporting associations between \nlie scales, crashes and driver behaviour scales. In the present study, it was shown that self-reports of \ntraffic accidents were negatively associated with a lie scale for driving, while recorded ones were not, \nas could be expected if the scale was valid and a self-report bias existed. We conclude that whenever \nself-reported crashes are used as an outcome variable and predicted by other self-reports, a lie scale \nshould be included and used for correcting the associations. However, the only lie scale now in \nexistence for traffic safety is not likely to catch all socially desirable responding, because traffic safety \nmay not be desirable for all demographic groups. New lie scales should be developed specifically for \ndriver questionnaires, to counter this suspected bias and artifactual results. \n \nKey words: common method variance, social desirability, DSDS, methodology, self-report, accident \n \n 2 \n1. Introduction \nMethodology using self-report data in psychology has been popular for a long time in \nmost sub-areas of the discipline. The advantages of such an approach include the \nability to ask any type of question, economy, and (apparent) simplicity of use. \nHowever, it has also been recognized that self-reports may be susceptible to what is \ncalled common method variance, i.e. biases of the (single) data source which \ninfluence several variables and create, increase or decrease associations between \nvariables. If such biases exist, artefactual effects will result.  \nSocial desirability (i.e. a tendency to report in a way that make the respondent look \ngood) (Edwards, 1957; Nunnally & Bernstein, 1994) is one instance of a group of \nsocial\/cognitive biases which can create common method variance in self-reports \n(Campbell & Fiske, 1959). To counter this tendency, so-called lie scales were \ndeveloped and introduced into psychometric tests (e.g. Crowne & Marlow, 1960). \nThese were thought to be able to detect faked replies. This was accomplished by \nmeasuring replies to items with a fairly obvious socially desirable content, like „I have \nnever stolen a thing in my life, not even a hairpin‟. People who endorsed such items \ncould be suspected of not really telling the truth, with or without their own \nknowledge. Using this basic logic, several different scales for socially desirable \nresponding have been developed and validated. However, the standard type of \nvalidation is to test whether differences are found between so-called „Fake good‟ and \n„Standard‟ conditions (e.g. Blake, Valdiserri, Neuendorf & Nemeth, 2006). Such a test \ndoes not yield any information about whether there are individual differences in lying, \nand whether this influences other reports. Despite this shortcoming of the validity \ntesting, when the influence of a socially desirable responding on other individual \ndifferences variables is tested, the validity of the lie scale would often be taken for \ngranted (e.g. Ferrando, 2008). \nEffects of socially desirable responding have been found in several research areas, e.g. \norganizational research (Moorman & Podsakoff, 1992), goal orientation (Tan & Hall, \n2005) and personality (Ferrando, 2008). However, it should be noted that the main \nproblem is not socially desirable responding as such, but the use of a common method \nand source for gathering both dependent and independent variables. If data sources \ndiffer between these variables, the problem would seem to be small (Pauls & \nStemmler, 2003; Kurtz, Tarquini & Iobst, 2008). \nWithin traffic psychology, the use of self-reports (for both independent and dependent \nvariables) has also been popular, and would seem to become ever more so. Here, the \nrisk of common method variance due to social desirability would seem to be great. Lie \nscales, however, have rarely been a part of this research (the exceptions include \nWilliams, Henderson & Mills, 1974; Donovan, Queisser, Salzberg & Umlauf, 1985; \nLajunen, Corry, Summala & Hartley, 1998; Dula & Ballard, 2003; Fernandes, Job & \nHatfield, 2007; Dorn & Gandolfi, 2008; Wickens, Toplak & Wiesenthal 2008), even \nthough many of the attitudes and behaviours studied in traffic safety research have \nvery clear social implications. However, although several authors have acknowledged \nthe possible influence of social desirability on self-reports of behaviours and attitudes, \nfew would seem to have thought that it would affect reports of crashes and other \ndependent variables (for a review and discussion, see af Wåhlberg, in press), which is \nnecessary.for CMV effects. \nThe only lie scale developed especially for driver behavior would seem to be the \nDriver Social Desirability Scale (DSDS), which was constructed by Lajunen, Corry, \nSummala and Hartley (1997), and contains two sub-scales, Driver Impression \nManagement (DIM) and Driver Self-Deception (DSD). The first focuses upon faking, \n 3 \nthe other on overly positive beliefs about oneself. The items are similar in content to \nthose used in other lie scales, with rather improbable descriptions of behaviour, or \nlack thereof (see the items in the Appendix). However, although it is, of course, a \npositive development that some recognition of the social desirable responding \nphenomenon has belatedly come to traffic psychology, the DSDS has received little \nattention (the exceptions include Lajunen & Summala, 2003; Caird & Kline, 2004; \nSundström, 2008; Dorn & Gandolfi, 2008). Given the prodigious number of studies \npublished within traffic safety each year based solely on self-reported data, a validated \nlie scale for this type of reporting would seem to be needed.  \nHowever, validating a lie scale is not simple, especially if the standard method of \n„fake good‟ is not accepted as valid. If the behaviour of interest is not expected to \ncorrelate with social desirability, but does have some sort of social implication, a lie \nscale can be tested against self-reports of this behaviour, and any association would \nconstitute evidence in favour of the validity of the scale. \nHowever, for the DSDS, the situation is somewhat more complicated, because the \nitems used in it are actually desirable from a safety point of view (see Apppendix). \nDrivers who claim to behave in these ways may therefore be responding honestly, and \nthe low numbers of crashes they also report are a logical consequence of these safe \nbehaviours. In the end, a negative correlation between the DSDS and self-reported \ncrashes does not constitute evidence in favour of its validity and\/or a bias in accident \nreporting. \nLajunen et al. (1997) reported correlations of about .20 between the DSDS scales and \nself-reported accidents where the driver was to blame. For not responsible accidents, \nthe effects were much weaker. In another study by the same authors (1998), the effect \nof the DIM scale in a hierarchical multiple regression was not significant. This might \nbe seen as an indication of a bias in reporting, but need further corroboration. \nThe method suggested is to test recorded as well as self-reported crashes against the \nDSDS scale. If self-reported accidents correlates negatively with the DSDS scale, but \nrecorded ones do not (or positively), the hypothesis that social desirability \ncontaminates self-reported collision data would be supported, and the DSDS scale \nvalidated, because such a result would rule out the competing hypothesis that drivers \nwho respond on the socially desirable end of the scale are in reality better drivers.  \nIn summary, this study was intended to investigate the association of socially \ndesirable responding, as measured by the DSDS, with self-reported and recorded \nnumber of traffic accidents, with the aim of validating the driver lie scale and \ninvestigating whether there exist a systematic bias in self-reports of road traffic \naccidents. If corroborated, this hypothesis would mean that CMV effects might exist \nin all studies that have used self-reports to predict self-reported crashes. \n \n \n2. Method \n2.1 General \nThree sources of data were available for the present study, covering many different \ndriver groups and two countries. DriverMetrics at Cranfield University (UK) has \ndeveloped several online driver risk assessment instruments for driver education \npurposes (Dorn & Gandolfi, 2008; Dorn & Garwood, 2005) and all assessments \ninclude the DSDS scale. Also from the UK, and gathered online, was one sample of \nyoung offending drivers and one random sample. Both these were part of an \nevaluation of a Driver improvement course for young traffic offenders, developed by \nthe e-training company a2om and delivered by the driver trainers DriveTech. Finally, \n 4 \ndata from Canada, used in a previous study (Caird & Kline, 2004) was included. \nThese samples are demographically described in Table 1. \n \n2.2 Samples \n2.2.1 DriverMetrics samples \nThe DriverMetrics data covered four bus-driver samples from a major company, \nwhich had been gathered for the development of a bus driver profiling system and a \nbus driving simulator study.  All participants were operational bus drivers with at least \n3 months experience. Participants were asked to complete the questionnaire online \nprior to taking part in the bus driving simulator study. There were four samples of \nfleet drivers, and two police driver groups. All these samples were gathered in the UK \nThe sample called Bus drivers 3 consisted of newly recruited chauffeurs, and they \nreported upon all their driving mishaps. \n \nFor the police drivers, the items were somewhat modified to exclude emergency \nconditions. \n \n \n2.2.2 Young and Private driver samples \nThe evaluation of the UK driver improvement program, utilizing on-line teaching, \nincluded a questionnaire as part of the evaluation process. The first sample were \nyoung traffic offenders (mainly speeding offences), and were offered the training as \nan alternative to a fine and\/or losing their license. The second sample was a random \ncontrol group who were recruited using an e-marketing scheme. Both these samples \nwere approached a second time, and so two measurements were available for a sub-\ngroup of each. The young drivers were all active drivers, as they had been caught \noffending in traffic. In the random sample, half of the drivers reported the lowest \ncategory (200 miles\/month), which in principle mean that they could be non-drivers.  \nThe young drivers were asked to respond to the first wave of the questionnaire before \nstarting the course, and could not log in to their first online teaching module without \nhaving done this. After having finished the last module, they were automatically \nlinked to the second wave of the questionnaire, but this version did not contain the \nDIM scale or an item about accidents, and so these data were not used here. For the \nthird wave responses, an e-mail was sent six months after the course, asking the \ndrivers to respond again. About twenty percent of drivers did so (the numbers in the \npresent tables are not indicative of the real response rate, as there is a time lag of \nabout seven months between the waves, and the project was still running at the time \nof the present paper being written). All respondents were informed that their \nresponses would only be used for research. Further information about this project and \nsamples can be found in af Wåhlberg (submitted, a). \n \n2.2.3 Truck driver sample \nFinally, one sample of Canadian truck drivers was included.  \nThese drivers were all active drivers for the truck company that supplied the recorded \ninformation.  \n \nTable 1 about here \n \n \n2.3 Measures \n 5 \nThe original DSDS had twelve items (see Appendix). In the present data, not all of \nthese were used in all samples. Instead, there was a range from four to twelve items \nused, and in one instance the data did not include item-level information, but only \ntotal values for the DIM scale (see Table 2). \n \n \n2.4 Accident data \nAll self-reported crash data was for all kinds of collisions, regardless of culpability, \ntype of vehicle and private or professional driving. The time periods reported for are \nstated in Table 1. Within the bus and truck companies, their own definitions of \nmishaps and fault were used. \n \nTable 2 about here \n \n \n2.5 Statistical methods \nAs the DIM and DSD scales were fairly normally distributed (see Table 2), while the \ncrash variables ranged from dichotomized with very skewed distributions to half-way \nnormal (for the bus drivers), three different methods were used for all samples; \ncorrelations, t-tests and effect size (d) calculations. For the latter two, the grouping \nwas by the mean of the lie scale. Correlations and t-tests are fairly common within the \naccident prediction literature, and the effects reported here are, therefore, comparable \nto older studies. Reports from the last decade, on the other hand, tend to use advanced \nstatistical modelling, without reporting zero-order effects, and are therefore not \nquantatively comparable to anything. Also, different statistical methods tend to yield \ndifferent results, and are preferred by different researchers, wherefore it was deemed \nnecessary to do a more comprehensive analysis than is usually the case. \nPearson correlations are often deemed not fitting for skewed data. However, in \nprevious work, no distortions of the size of effects have been found, even when the \ndistributions have been extremely skewed. Instead, the size of correlations mostly \nconform to a linear function derived from a hypothesis which is unrelated to the \nstatistical assumptions and characteristics of the Pearson correlation (af Wåhlberg & \nDorn, 2007; 2009; af Wåhlberg, in press). \n \n \n3. Results \nFor each sample with item data, the item values were summed to form the DSD, DIM \nand DSDS scales. Cronbach‟s alpha values were computed for all of these (see Table \n2), and most were found to be acceptable. For one sample of bus drivers, the item-\nlevel data was not available, but only the overall DIM score. \nThe associations between age, experience and the DSDS scale were computed, as well \nas the correlations between the DIM and DSD sub-scales (Table 2). It can be seen that \nthe sub-scales were moderately associated in all samples, while the results for \nage\/experience were mixed with some samples showing positive and others negative \nrelationships. Thus, we have no evidence of a consistent pattern of responding to the \nsocial desirability scales for these particular demographic variables. \nNext, the associations between social desirability and accidents (recorded and self-\nreport) were calculated, using Pearson correlation, t-tests and effect sizes (after \ndichotomization of the crash variable). The results can be seen in Tables 3-4. Finally, \nthe mean effects over all samples for all tests were computed, separately for recorded \n 6 \nand self-reported data, excluding the crash-free kms variable. It can be seen that the \nassociation for recorded data was very close to zero, but on the positive side, while the \nself-reports yielded a negative effect across all samples.  \nA similar conclusion can be reached if only significant values are studied. All these \nwere in the expected directions. \n \nTables 3-4 about here \n \n \n4. Discussion \nThe results of the present study support the notion that a reporting bias for self-reports \nof accidents may exist, which can be identified by the DSDS. Perhaps the most telling \neffect is that of mainly negative correlations for the self-reported accidents, while \nthose with the recorded crash variables tended to be positive, although very close to \nzero. Differences in effects between recorded and self-reported accident data are \nusually claimed to be due to the lesser variance of the first. Such an explanation is not \nviable here, as there is a difference in direction for the effects. Therefore, if the \nvariance in recorded data was larger, the difference would increase. \nThese findings add to the small, but important literature on social desirability in traffic \naccident research. Donovan, Queisser, Salzberg and Umlauf (1985) did not find any \ndifferences in social desirability between groups contrasted by accidents from state \nrecords, and Williams, Henderson and Mills (1974) also reported no effect for traffic \noffenders (data from records). This lack of effect could be expected from the present \nhypothesis. The results reported here are therefore not entirely new, but the present \nstudy would seem to be the first to test for differences between recorded and self-\nreported data. \nIt could, of course, be argued that the associations found are weak, and thus not very \nimportant. However, most correlations with accidents that have been reported in the \nliterature are also weak, and would, if not be totally eradicated, at least be \nsignificantly attenuated if social desirability effects were held constant. For example, \nin the meta-analysis of the associations between the Big Five personality constructs \nand accidents by Clarke and Robertson (2005), almost half the studies used self-\nreported accidents as the outcome variable. The raw mean correlations ranged from \n.098 to .182, and a correction for social desirability might therefore have very \nsignificant effects upon this association. Also, in a separate paper utlizing the Young \nand Private drivers samples used here, it has been shown that the DIM scale explain \nhalf of the variance shared between self-reported crashes and several well-known \ndriver inventories (af Wåhlberg, submitted, b). Similar results were reported for the \nCrowne-Marlowe lie scale by Willemsen, Dula, Declerq and Verhaege (2008). \nIn many accident prediction studies utilizing questionnaires, the authors state that \nsocial desirability or similar concepts might have influenced the independent variables \n(e.g. Brown & Cotton, 2003), although no direct assessment of this effect was \nincluded. However, acknowledgement of this source of possible bias has seldom been \nextended to the dependent variable (exceptions include Pöysti, Rajalin & Summala, \n2005), and when it has, it has usually been claimed that socially desirable responding \nshould lead to under-estimations of the real associations between accidents and \npredictors (West, 1995; Hatakka, Keskinen, Katila & Laapotti, 1997; Lawton, Parker, \nStradling & Manstead, 1997; Sullman, Meadows & Pajo, 2002), due to limited \nvariation. That shared variance is created by this type of bias in reporting does not \nseem to have been understood, as few attempts to include some sort of lie scale and \n 7 \nholding the effect constant has been found (among the few are Arthur & Graziano, \n1996). In some studies, it is argued that social desirability should not have been a \nproblem, due to the anonymity of the respondents (Lajunen & Parker, 2001). \nHowever, whether this method really has the desired effect would currently seem to \nbe uncertain, and research on this needed. \nIt is very common within traffic safety research not to use accidents as the outcome \nvariable, ostensibly due to its problematic statistical properties (infrequent \noccurrence). Instead, various „risky driving‟ measures are used as outcome measures, \nbecause it is assumed that these risky behaviours are directly related to accidents (an \nassumption which is unproven, at best, af Wåhlberg, in press). This approach \nhowever, does not erase the social desirability effects described. If anything the \nproblem is likely to be even worse using such measures. While accidents are \nuncommon and easily counted (although not necessarily remembered or truthfully \nreported upon), speeding and tailgating, for example, are rather difficult to recall \nprecisely, because they appear in much more nebulous categories such as „often‟, \n„seldom‟ etc. It is easy for a respondent to change his\/her reply a bit without feeling \ndishonest, because the discrepancy is not as evident to oneself as if a remembered \ncrash was not reported (or an extra one added). It should also be remembered that \nmany „risky driving behaviour‟ scales that are used as outcome variables started out as \ncrash predictors (notably the DBQ), and that these are very prone to social desirability \neffects, which that their intercorrelations to a large degree are due to reporting bias (af \nWåhlberg, submitted, b). \nThe present study did find that the DSDS does work as expected. However, despite \nthis outcome, the problem of the item content remain to some degree. As can be seen \nin the Appendix, most DSDS items (especially the DIM scale) are socially desirable \nbehaviours from the traffic safety specialist‟s point of view. That such behaviours are \nseen as the social norm by researchers can be exemplified by Lajunen and Summala \n(2003), who said about the Manchester Driver Behaviour Questionnaire; “...driving \nbehaviours listed in the DBQ are all socially non-desirable behaviours...” (p. 104). \nThis view is very much in line with the traditional way of constructing lie scales, \nwhere the overall social norm is used as the foundation for the construct. However, it \ncan be questioned whether this norm is accepted by all drivers, or if there are \nsubgroups that will not endorse such behaviours as desirable. However, this line of \nreasoning does not mean that the self-reports of such non-normative drivers are free \nfrom bias, only that it cannot be detected by using a traditionally constructed lie scale. \nWhat is suspected is that there could exist over-reporting of crashes and behaviours by \nsub-groups of drivers with very different attitudes towards driving than what is \nusually assumed to be the standard. \nThere could also exist another problem with the DSDS, due to its item content. It \ncould actually be the case that there exist a small sub-group who honestly can say that \nthey have never done the behaviours described in the items, and who also have rather \nfew accidents. \nFurthermore, the DSDS does not necessarily capture social norms within all driver \ngroups, and effects should not be expected in all populations. It could be expected that \nwithin driver groups where crashes are seen as an inevitable part of driving, socially \ndesirable responding as measured by the DSDS would not exist. \nGiven these suspected biases, the construction of different types of driver social \ndesirability scales is recommended, as well as other validity control methods.  \n 8 \nNo consistent differences in effects were found between the subscales, or the full \nversion versus a subset of the items. From these results, there does not seem to be an \nindication that both scales or all items are needed. \nSome researchers would argue that records of accidents are so unreliable (and often \nhard to access) as to be useless, and that self-reports are therefore a better option. \nHowever, such an argument rests upon the errenous conclusion that the proven under-\nreporting into, and known biases of, (state) records somehow make self-reports more \nvalid. In fact, there exist very few comparative studies on this subject, and what little \nevidence there is indicates that the correlations between sources are suspiciously low, \nand that they yield different results when used as outcomes (af Wåhlberg, in press; af \nWåhlberg, Dorn & Kline, in press).  \nGiven the large number studies that have used only self-reported data in traffic \npsychology, the effects of socially desirable responding could be dramatic on the \noverall interpretation of results. Until further research has established more firmly \nhow strong the effects described are, it is recommended that  \na) self-reported accidents are not used for research, unless the predictors are gathered \nfrom another source, \nb) if the use of self-reported collisions cannot be avoided, it is recommended that \nresearchers include a lie scale, and partial out this effect, and \nc) proxy dependent variables, like speeding, should also be controlled for social \ndesirability effects. \nFinally, it should be remembered that social desirability is just one of a group of \ncommon method variance effects that can create artifactual associations in self-\nreported traffic safety data. There is an urgent need to develop and implement \nmethods to detect and counteract such threats to validity in the majority of traffic \nsafety studies published. The alternative is that traffic safety research is built on a \nfoundation of knowledge stemming from potentially biased and distorted data.  . \n \nAcknowledgement \nThe data on young offending drivers was gathered as part of the Thames Valley Police Young Driver \nScheme evaluation, and the analyses undertaken here was part of the general research plan. \n \n \n5. References \nArthur, W., Jr., & Graziano, W. G. (1996). The Five-factor model, conscientiousness, \nand driving accident involvement. Journal of Personality, 64, 593-618. \n \nBlake, B. F., Valdiserri, J., Neuendorf, K. A., & Nemeth, J. (2006). Validity of the \nSDS-17 measure of social desirability in the American context. Personality and \nIndividual Differences, 40, 1625-1636. \n \nBrown, S. L., & Cotton, A. (2003). Risk-mitigating beliefs, risk estimates, and self-\nreported speeding in a sample of Australian drivers. Journal of Safety Research, 34, \n183-188. \n \nCampbell, D.T., & Fiske, D.W. (1959). Convergent and discriminant validation by  \nthe multitrait-multimethod matrix. Psychological Bulletin, 56, 81-105. \n \nCaird, J. K., & Kline, T. J. (2004). The relationships between organizational and \nindividual variables to on-the-job driver accidents and accident-free kilometres. \nErgonomics, 47, 1598-1613. \n 9 \n \nClarke, S., & Robertson, I. T. (2005). A meta-analytic review of the Big Five \npersonality factors and accident involvement in occupational and non-occupational \nsettings. Journal of Occupational and Organizational Psychology, 78, 355–376. \n \nCrowne, D. P., & Marlowe, D. (1960). A new scale of social desirability independent \nof psychopathology. Journal of Consulting Psychology, 24, 349-354. \n \nDonovan, D. M., Queisser, H. R., Salzberg, P. M., & Umlauf, R. L. (1985). \nIntoxicated and bad drivers: Subgroups within the same population of high-risk \ndrivers. Journal of Studies on Alcohol, 46, 375-382. \n \nDula, C. S., & Ballard, M. E. (2003). Development and evaluation of a measure of \ndangerous, aggressive, negative emotional, and risky driving. Journal of Applied \nSocial Psychology, 33, 263-282. \n \nDorn, L, & Gandolfi, J. (2008) Designing a Psychometrically-Based Self Assessment \nto Address Fleet Driver Risk. In Dorn L (Ed) Driver Behaviour and Training Vol III.  \nHuman Factors in Road and Rail Safety. Ashgate: Aldershot. \n \nDorn, L, & Garwood, L. (2005). Development of a psychometric measure of bus \ndriver behaviour.  Behavioural Research in Road Safety: 14th Seminar. Department for \nTransport: London. \n \nEdwards, A. L. (1957). The Social Desirability Variable in Personality Assessment \nand Research. New York: Dryden. \n \nFernandes, R., Job, R. F., & Hatfield, J. (2007). A challenge to the assumed \ngeneralizability of prediction and countermeasure for risky driving: Different factors \npredict different risky driving behaviors. Journal of Safety Research, 38, 59-70. \n \nFerrando, P. J. (2008). The impact of social desirability bias on the EPQ-R item \nscores: An item response theory analysis. Personality and Individual Differences, 44, \n1784-1794. \n \nHatakka, M., Keskinen, E., Katila, A., & Laapotti, S. (1997). Self-reported driving \nhabits are valid predictors of violations and accidents. In T. Rothengatter & E. C. \nVaya, Traffic and Transport Psychology, Theory and Application, pp. 295-303. \nAmsterdam: Pergamon. \n \nKurtz, J. E., Tarquini, S. J., & Iobst, E. A. (2008). Socially desirable responding in \npersonality assessment: Still more substance than style. Personality and Individual \nDifferences, 45, 22-27. \n \nLajunen, T., Corry, A., Summala, H., & Hartley, L. (1997). Impression management \nand self-deception in traffic behaviour inventories. Personality and Individual \nDifferences, 22, 341-353. \n \n 10 \nLajunen, T., Corry, A., Summala, H., & Hartley, L. (1998). Cross-cultural differences \nin drivers‟ self-assessments of their perceptual-motor and safety skills: Australians \nand Finns. Personality and Individual Differences, 24, 539-550.   \n \nLajunen, T., & Parker, D. (2001). Are aggressive people aggressive drivers? A study \nof the relationship between self-reported general aggressiveness, driver anger and \naggressive driving. Accident Analysis and Prevention, 33, 243-255.  \n \nLajunen, T., & Summala, H. (2003). Can we trust self-reports of driving? Effects of \nimpression management on driver behaviour questionnaire responses. Transportation \nResearch Part F, 6, 97-107. \n \nLawton, R., Parker, D., Stradling, S. G., & Manstead, A. S. (1997). Predicting road \ntraffic accidents: The role of social deviance and violations. British Journal of \nPsychology, 88, 249-262. \n \nMoorman, R. H., & Podsakoff, P. M. (1992). A meta-analytic review and empirical \ntest of the potential confounding effects of social desirability response sets in \norganizational behaviour research. Journal of Occupational and Organizational \nPsychology, 65, 131-149. \n \nNunnally, J. C., & Bernstein, I. H. (1994). Psychometric Theory (3\nrd\n ed.). New York: \nMcGraw-Hill. \n \nPauls, C. A., & Stemmler, G. (2003). Substance and bias in social desirability \nresponding. Personality and Individual Differences, 35, 263-275. \n \nPöysti, L., Rajalin, S., & Summala, H. (2005). Factors influencing the use of cellular \n(mobile) phone during driving and hazards while using it. Accident Analysis and \nPrevention, 37, 47-51. \n \nSullman, M. J., Meadows, M. L., & Pajo, K. B. (2002). Aberrant driving behaviours \namongst New Zealand truck drivers. Transportation Research Part F, 5, 217-232. \n \nSundström, A. (2008). Self-assessment of driving skill - A review from a \nmeasurement perspective. Transportation Research Part F, 11, 1-9. \n \nTan, J. A., & Hall, R. J. (2005). The effects of social desirability bias on applied \nmeasures of goal orientation. Personality and Individual Differences, 38, 1891-1902. \n \nWest, R. J. (1995). Individual differences in accident risk: a review of findings and an \nexamination of methods. In Proceedings of Behavioural Research in Road Safety VI. \nLondon, England, 4–5 September 1995. \n \nWickens, C. M., Toplak, M. E., & Wiesenthal, D. L. (2008). Cognitive failures as \npredictors of driving errors, lapses, and violations. Accident Analysis and Prevention, \n40, 1223-1233. \n \n 11 \nWillemsen, J., Dula, C. S., Declerq, F., & Verhaeghe, P. (2008). The Dula Dangerous \nDriving Index: An investigation of reliability and validity across cultures. Accident \nAnalysis and Prevention, 40, 798-806. \n \nWilliams, C. L., Henderson, A. S., & Mills, J. M. (1974). An epidemiological study of \nserious traffic offenders. Social Psychiatry, 9, 99-109. \n \naf Wåhlberg, A. E. (in press). Driver Behaviour and Accident Research Methodology; \nUnresolved Problems. Aldershot: Ashgate. \n \naf Wåhlberg, A. E. (submitted, a). Re-education of young driving offenders; effects on \nself-reports of driver behaviour. \n \naf Wåhlberg, A. E. (submitted, b). Social desirability effects in driver behaviour \ninventories. \n \naf Wåhlberg, A. E., & Dorn, L. (2007). Culpable versus non-culpable traffic \naccidents; what is wrong with this picture? Journal of Safety Research, 38, 453-459.   \n \naf Wåhlberg, A. E., & Dorn, L. (2009). Bus driver accident record; the return of \naccident proneness. Theoretical Issues in Ergonomics Science, 10, 77-91. \n \naf Wåhlberg, A. E., Dorn, L., & Kline, T. (in press). The Manchester Driver \nBehaviour Questionnaire as predictor of road traffic accidents. Theoretical Issues in \nErgonomics Science, \n 12 \n \nAppendix: The Driver Social Desirability Scale (Lajunen, Corry, Summala & \nHartley, 1997) \nOriginally seven point scale, from 1: Not true, to 7: Very true \n \nDriver Impression Management scale \n1. I have never exceeded the speed limit \n2. I have never wanted to drive very fast \n3. I have never driven through a traffic light when it has just been turning red \n4. I always obey traffic rules, even if I am unlikely to get caught \n5. I always keep sufficient distance from the car in front of my car \n6. If there were no police controls, I would still obey speed limits \n7. I have never exceeded speed limits or crossed a solid white line in the centre of the \nroad when overtaking \n \nDriver Self-Deception Scale \n8. I always know what to do in traffic situations \n9. I never regret my decisions in traffic \n10. I don‟t care what other drivers think of me \n11. I always am sure how to act in traffic situations \n12. I always remain calm and rational in traffic\n 13 \nTable 1: Descriptive data for the samples included in the study (mean\/std and percent). Country of origin, number of subjects, mean\/std of age, experience, number of \naccidents (differing time periods), and percent women in the sample. \nSubjects N Age Experience (years) Mean number of accidents \n(all) \nTime period for \naccidents \nMean number of accident per \nyear (all) \nAccident \nsource \nSex \nNew bus \ndrivers \n142 37.9\/10.0 16.4\/9.5 # 1.40\/1.62 9 months 1.87\/2.16 Record 12% \nBus drivers 1 95 48.7\/10.0 12.9\/11.8 (years of \nemployment) \n3.14\/2.76 Variable 0.80\/1.13 (N=91) Record 6% \nBus drivers 2 293 46.1\/10.4 12.6\/10.9 (PCV license) 2.96\/2.73 Variable 0.84\/1.26 Record 7% \nBus drivers 3 51 - 13.5\/11.1 # 0.10\/0.30 XXX3 years XXX Self-report 22% \nPolice drivers \n1 \n313 36.3\/8.7 20.3\/8.7 (N=306) 0.46\/0.63 (dichotomized \nscale) \n3 years 0.15\/0.21 Self-report 16% \nPolice drivers \n2 \n381 a b 0.23\/0.56 3 years 0.08\/0.19 Self-report 16% \nFleet drivers 1 1795 40.7\/9.5 18.2\/9.0 # 0.34\/0.70 3 years 0.11\/0.23 Self-report 18% \nFleet drivers 2 523 40.9\/10.2 17.0\/9.9 0.27\/0.60 3 years 0.09\/0.20 Self-report 22% \nFleet drivers 3 803 42.6\/9.7 19.7\/8.9 # 0.25\/0.56 3 years 0.08\/0.19 Self-report 20% \nFleet drivers 4 168 37.9\/9.2 18.9\/9.0 (N=158) c 0.57\/0.95 3 years 0.19\/0.31 Self-report 55% \nYoung drivers \nSecond wave \n4453 21.7\/2.2 3.2\/2.1 0.58\/0.87 Variable \nSix months \n0.27\/0.71 Self-report 40% \nPrivate drivers \nSecond wave \n1231 33.2\/14.1 12.7\/13.0 # 0.84\/1.36 Variable \nSix months \n0.12\/0.86 Self-report 44% \nTruck drivers 111 42.6\/6.7 26.8\/6.9 (XXX) 0.08\/0.33 \n0.57\/0.71 \nTwo years \nVariable \n0.04\/0.17 \n0.02\/0.03 \nSelf-report \nRecord \n4% \na Age data was only available in four broad categories (20-35, 36-41, 42-47, 48+ years). Fairly similar numbers of the sample belonged to each (28, 25, 24, 23 percent) \nb As with age for this sample, experience was recorded in broad categories; <15, 16-25, 26-30, 30+ years. Thirty-nine percent were in the second category. \nPCV=Personal Commercial Vehicle \nc This variable had several missing values. One was deleted, as it was equal to the driver‟s age. \n# years of driver‟s license \n \n 14 \nTable 2: The means, standard deviations, kurtosis and alpha values of the scales in all samples. Also, the correlations between age, experience and the DSDS scale, and the \nintercorrelations between the subscales. In samples Young drivers and Private drivers, the second row are for re-testing of those in the first wave. \nSubjects N DSDS scale Steps of \nscale \nMean\/std Kurtosis Skewness Alpha Correlation \nwith age \nN for \nexperience \nCorrelation with \nexperience \nCorrelation \nDIM\/DSD \nNew bus drivers 142 DIM 1-7 (28.6\/9.82) -0.15 -0.01 - .016 142 - - \nBus drivers 1 95 DSDS \nDIM (7 items) \nDSD (5 items) \n1-7 4.17\/1.00 \n3.92\/1.25 \n4.52\/1.05 \n0.29 \n-0.50 \n0.76 \n-0.19 \n-0.15 \n-0.46 \n.83 \n.82 \n.71 \n.113 93 .051 (years of \nemployment) \n.444*** \nBus drivers 2 293 DSDS \nDIM (7 items) \nDSD (5 items) \n0-1 0.50\/0.24 \n0.44\/0.26 \n0.59\/0.31 \n-0.59 \n-0.54 \n-0.85 \n-0.12 \n0.15 \n-0.46 \n.75 \n.68 \n.64 \n.057 \n.071 \n.022 \n287 .027 \n-.015 \n.068 (years of PCV \nlicense) \n.412*** \nBus drivers 3 51 DSDS \nDIM (7 items) \nDSD (5 items) \n1-6 3.67\/1.07 \n3.52\/1.25 \n3.87\/1.37 \n-0.05 \n-0.61 \n0.56 \n-0.62 \n-0.41 \n-0.81 \n.82 \n.79 \n.81 \n- 51 # -.240 \n-.21 \n-.18 \n.346* \nPolice drivers 1 316 DIM (7 items) 5-1 \n(reversed) \n3.61\/0.98 1.19 0.92 .81 -.056 306 # .070 - \nPolice drivers 2 381 DSDS (8 items) 1-5 2.23\/0.55 -0.06 0.30 .68 -.150 - - - \nFleet drivers 1 1795 DSDS \nDIM (6 items) \nDSD (4 items) \n0-6 3.23\/1.09 \n2.71\/1.35 \n4.00\/1.18 \n-0.33 \n-0.58 \n0.18 \n0.08 \n0.19 \n-0.54 \n.83 \n.81 \n.82 \n.009 1795 # -.020 .407*** \nFleet drivers 2 523 DSDS \nDIM (6 items) \nDSD (4 items) \n0-6 3.07\/1.10 \n2.64\/1.36 \n3.71\/1.18 \n-0.16 \n-0.45 \n0.18 \n0.20 \n0.26 \n-0.43 \n.84 \n.83 \n.81 \n-.042 \n-.069 \n.021 \n523 # -.016 \n-.083 \n.105* \n.425*** \nFleet drivers 3 803 DSDS \nDIM (6 items) \nDSD (4 items) \n0-6 3.35\/1.06 \n2.94\/1.30 \n3.96\/0.33 \n-0.22 \n-0.48 \n0.33 \n-0.17 \n-0.03 \n-0.59 \n.81 \n.77 \n.82 \n.094** \n.063 \n.111** \n803 # .088* \n.042 \n.132*** \n.425*** \nFleet drivers 4 168 DSDS \nDIM (7 items) \nDSD (5 items) \n1-0 \n(reversed) \n0.67\/0.20 \n0.73\/0.20 \n0.59\/0.30 \n-0.58 \n-0.44 \n-1.36 \n-0.18 \n-0.47 \n-0.05 \n.68 \n.51 \n.67 \n-.009 \n-.101 \n.079 \n158 # -.030 \n-.092 \n.038 \n.324*** \nYoung drivers 4453 \n \nDIM (7 items) 1-5 3.14\/0.91 -0.73 -0.07 0.82 -.059 4453 # -.123***  - \nPrivate drivers 1461 \n239 \nDIM (7 items) 1-5 2.95\/1.03 \n2.87\/1.00 \n-0.89 \n-0.79 \n0.22 \n0.42 \n.87 \n.86 \n-.090*** \n(N=1449) \n-.124 \n1232 # \n203 \n-.080 \n-.123 \n- \n 15 \n(N=233) \nTruck drivers 111 DSD (4 items) 1-5 2.87\/0.54 -0.67 0.13 .52 -.359*** 111 -.353***  - \n* p<.05, p<.01, *** p<.001 \n# years of driver‟s license \nPCV=Personal Commercial Vehicle \n 16 \n \nTable 3: Results for samples where accident data was recorded by an organisation. Shown are type of drivers, DSDS scale(s) used and alpha values of these (if available), \ntype of accidents, and N of sample. Thereafter, association between social desirability and accidents, calculated as Pearson correlation, independent t-test and Cohen‟s d. t-\nvalues and d computed for groups dichotomized by the mean on the DSDS variable. Positive values mean a negative association for these tests, apart from the crash free \nkilometers variable. Effect sizes (d) calculated with the low-DSDS group standard deviation as the denominator. \nSubjects N DSDS variables Accident type Correlation t d \nNew bus drivers (9 months of driving) 142 DIM At fault \nAll \n.138 \n.009 \n-0.06 \n1.24 \n-0.01 \n0.20 \nBus drivers 1 95 \n \n \n91 \nDSDS \nDIM (7 items) \nDSD (5 items) \nDSDS \nDIM (7 items) \nDSD (5 items) \nAt fault \n \n \nAt fault\/year \n-.045 \n-.048 \n-.023 \n.095 \n.077 \n.088 \n-0.28 \n-0.21 \n-1.43 \n-1.18 \n-0.96 \n-1.58 \n-0.05 \n-0.04 \n-0.30 \n-0.39 \n-0.31 \n-0.54 \nBus drivers 1 95 \n \n \n91 \nDSDS \nDIM (7 items) \nDSD (5 items) \nDSDS \nDIM (7 items) \nDSD (5 items) \nAll \n \n \nAll\/year \n-.130 \n-.137 \n-.068 \n.060 \n.073 \n.034 \n0.28 \n0.22 \n-0.54 \n-0.96 \n-0.90 \n-1.38 \n0.05 \n0.04 \n-0.11 \n-0.26 \n-0.25 \n-0.39 \nBus drivers 2 293 DSDS \nDIM (7 items) \nDSD (5 items) \nDSDS \nDIM (7 items) \nDSD (5 items) \nAt fault \n \n \nAt fault\/year \n.012 \n.006 \n.016 \n-.010 \n.024 \n-.046 \n-2.19* \n-1.55 \n-0.85 \n-1.48 \n-1.16 \n0.54 \n-0.34 \n-0.23 \n-0.12 \n-0.21 \n-0.16 \n0.06 \nBus drivers 2 293 DSDS \nDIM (7 items) \nDSD (5 items) \nDSDS \nDIM (7 items) \nDSD (5 items) \nAll \n \n \nAll\/year \n-.067 \n-.085 \n-.023 \n-.080 \n-.059 \n-.077 \n-0.79 \n-0.40 \n-0.36 \n-0.75 \n-0.42 \n0.85 \n-0.09 \n-0.05 \n-0.04 \n-0.09 \n-0.05 \n0.09 \nTruck drivers 111 DSD (4 items) All \nAll\/year \nCrash free kms (all) \n.082 \n.137 \n-.085 \n-1.21 \n-1.72 \n0.49 \n-0.26 \n-0.47 \n0.09 \n 17 \nMean (except crash free kms)    .010 -0.69 -0.15 \n* p<.05, ** p<.01, *** p<.001 \n 18 \n \nTable 4: Results for samples where accident data was self-reported. Shown are type of drivers, DSDS scale(s) used and alpha values of these (if available), type of accidents, \nand N of sample. Thereafter, association between social desirability and accidents, calculated as Pearson correlation, independent t-test and Cohen‟s d. t-values and d \ncomputed for groups dichotomized by the mean on the DSDS variable. Positive values mean a negative association for these tests, apart from the crash free kilometers \nvariable. Effect sizes (d) calculated with the low-DSDS group standard deviation as the denominator. The scales of samples Police drivers 1 and Fleet driver 4 were reversed \nto the same type of scaling as the other samples‟ (high SD=high value). \nSubjects N DSDS variables Accident type Correlation t d \nBus drivers 3 51 DSDS \nDIM (7 items) \nDSD (5 items) \nAll -.218 \n-.108 \n-.270 \n2.50* \n0.51 \n1.46 \n0.49 \n0.13 \n0.32 \nPolice drivers 1 316 DIM (7 items) All -.021 1.52 0.16 \nPolice drivers 2 384 DSDS (8 items) All .005 1.05 0.12 \nFleet drivers 1 1795 DSDS \nDIM (6 items) \nDSD (4 items) \nAll -.048* \n-.039 \n-.043 \n0.55 \n0.96 \n1.90 \n0.03 \n0.04 \n0.08 \nFleet drivers 2 523 DSDS \nDIM (6 items) \nDSD (4 items) \nAll -.050 \n-.016 \n-.089* \n-0.39 \n0.64 \n1.23 \n0.04 \n-0.06 \n0.10 \nFleet drivers 3 803 DSDS \nDIM (6 items) \nDSD (4 items) \nAll -.091* \n-.093** \n-.053 \n1.84 \n1.46 \n0.33 \n0.13 \n0.10 \n0.02 \nFleet drivers 4 167 DSDS \nDIM (7 items) \nDSD (5 items) \nAll -.078 \n-.097 \n-.033 \n3.29** \n1.75 \n0.60 \n0.45 \n0.23 \n0.10 \nYoung drivers 4444 \n \n \n342# \nDIM (7 items) All \nAll\/year \nAll\/mile \nAll\/year \n-.129*** \n-.053*** \n-.009 \n-.017 \n6.66*** \n3.57*** \n1.07 \n0.61 \n0.19 \n0.09 \n0.02 \n0.07 \nPrivate drivers 1230## \n \n \n239# \nDIM (7 items) All \nAll\/year \nAll\/mile \nAll \nAll\/mile \n-.177*** \n-.075** \n-.056 \n-.112 \n-.115 \n5.85*** \n1.49 \n1.29 \n1.77 \n1.89 \n0.33 \n0.10 \n0.09 \n0.18 \n0.18 \nTruck drivers 111 DSD (4 items) All \nCrash free kms (all) \n.021 \n.192* \n-0.44 \n-1.16 \n-0.08 \n-0.22 \n 19 \nMean    -.100 1.67 0.14 \n* p<.05, ** p<.01, *** p<.001 \n# repeated measurement of the larger sample. \n## One outlier on the collision per year variable deleted. \n \n"}