{"doi":"10.1063\/1.370657","coreId":"15346","oai":"oai:dro.dur.ac.uk.OAI2:7622","identifiers":["oai:dro.dur.ac.uk.OAI2:7622","10.1063\/1.370657"],"title":"Impact ionization rate calculations in wide band gap semiconductors.","authors":["Harrison, D.","Abram, R.A.","Brand, S."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"1999-01-01","abstract":"An algorithm for calculating impact ionization rates in the semiclassical Fermi’s Golden Rule approximation which is efficient close to threshold is presented. Electron and hole initiated rates are calculated for three semiconductors with particular band structure characteristics, as are the distributions of the generated carriers. Simple analytic expressions of the form R = A(E−E0)P are fitted to the calculated rates. The role of the matrix elements in influencing the distribution of final states is investigated. In the direct gap materials, they act to significantly enhance the low-q transitions, while in the indirect gap case they have a lesser effect on the distribution. Results for GaAs obtained here and by several other workers are compared and possible causes of the discrepancies examined, including differences in band structure and approximations made in evaluation of the matrix element. It is found that these differences do not influence the rate sufficiently to account for the wider variation between authors, and so it is concluded that differences in the implementation of the rate integration algorithm are the main cause","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15346.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7622\/1\/7622.pdf","pdfHashValue":"c7f622a8686633108b3a21ab533513aa39b4e723","publisher":"American Institute of Physics","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7622<\/identifier><datestamp>\n      2010-12-07T12:24:26Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Impact ionization rate calculations in wide band gap semiconductors.<\/dc:title><dc:creator>\n        Harrison, D.<\/dc:creator><dc:creator>\n        Abram, R.A.<\/dc:creator><dc:creator>\n        Brand, S.<\/dc:creator><dc:description>\n        An algorithm for calculating impact ionization rates in the semiclassical Fermi’s Golden Rule approximation which is efficient close to threshold is presented. Electron and hole initiated rates are calculated for three semiconductors with particular band structure characteristics, as are the distributions of the generated carriers. Simple analytic expressions of the form R = A(E−E0)P are fitted to the calculated rates. The role of the matrix elements in influencing the distribution of final states is investigated. In the direct gap materials, they act to significantly enhance the low-q transitions, while in the indirect gap case they have a lesser effect on the distribution. Results for GaAs obtained here and by several other workers are compared and possible causes of the discrepancies examined, including differences in band structure and approximations made in evaluation of the matrix element. It is found that these differences do not influence the rate sufficiently to account for the wider variation between authors, and so it is concluded that differences in the implementation of the rate integration algorithm are the main cause.<\/dc:description><dc:publisher>\n        American Institute of Physics<\/dc:publisher><dc:source>\n        Journal of applied physics, 1999, Vol.85(12), pp.8178-8185 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        1999-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7622<\/dc:identifier><dc:identifier>\n        issn:0021-8979<\/dc:identifier><dc:identifier>\n        issn: 1089-7550<\/dc:identifier><dc:identifier>\n        doi:10.1063\/1.370657<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7622\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1063\/1.370657<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7622\/1\/7622.pdf<\/dc:identifier><dc:rights>\n        Copyright (1999) American Institute of Physics. This article may be downloaded for personal use only. Any other use requires prior permission of the author and the American Institute of Physics. The following article appeared in Harrison, D. and Abram, R.A. and Brand, S. (1999) 'Impact ionization rate calculations in wide band gap semiconductors.', Journal of applied physics., 85 (12). pp. 8178-8185 and may be found at http:\/\/dx.doi.org\/10.1063\/1.370657<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1089-7550","0021-8979","issn:0021-8979","issn: 1089-7550"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":1999,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n07 December 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nHarrison, D. and Abram, R.A. and Brand, S. (1999) ’Impact ionization rate calculations in wide band gap\nsemiconductors.’, Journal of applied physics., 85 (12). pp. 8178-8185.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1063\/1.370657\nPublisher’s copyright statement:\nCopyright (1999) American Institute of Physics. This article may be downloaded for personal use only. Any other use\nrequires prior permission of the author and the American Institute of Physics. The following article appeared in\nHarrison, D. and Abram, R.A. and Brand, S. (1999) ’Impact ionization rate calculations in wide band gap\nsemiconductors.’, Journal of applied physics., 85 (12). pp. 8178-8185 and may be found at\nhttp:\/\/dx.doi.org\/10.1063\/1.370657\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nImpact ionization rate calculations in wide band gap semiconductors\nD. Harrison, R. A. Abram,a) and S. Brand\nDepartment of Physics, University of Durham, South Road, Durham DH1 3LE, United Kingdom\n~Received 6 November 1998; accepted for publication 22 February 1999!\nAn algorithm for calculating impact ionization rates in the semiclassical Fermi’s Golden Rule\napproximation which is efficient close to threshold is presented. Electron and hole initiated rates are\ncalculated for three semiconductors with particular band structure characteristics, as are the\ndistributions of the generated carriers. Simple analytic expressions of the form R5A(E2E0)P are\nfitted to the calculated rates. The role of the matrix elements in influencing the distribution of final\nstates is investigated. In the direct gap materials, they act to significantly enhance the low-q\ntransitions, while in the indirect gap case they have a lesser effect on the distribution. Results for\nGaAs obtained here and by several other workers are compared and possible causes of the\ndiscrepancies examined, including differences in band structure and approximations made in\nevaluation of the matrix element. It is found that these differences do not influence the rate\nsufficiently to account for the wider variation between authors, and so it is concluded that\ndifferences in the implementation of the rate integration algorithm are the main cause. © 1999\nAmerican Institute of Physics. @S0021-8979~99!06311-2#\nI. INTRODUCTION\nImpact ionization is a process occurring in semiconduc-\ntors in which a high energy carrier excites a valence band\nelectron across the band gap, thus creating an electron–hole\npair. Since the initiating carrier must supply energy at least\nequal to the band gap, it must have a sufficiently high kinetic\nenergy typically as a result of excitation by a large electric\nfield. Such large fields exist in small high-speed devices such\nas field effect transistors, in which case impact ionization is\nusually detrimental to performance,1–3 or in devices such as\nIMPATT diodes4 and avalanche photodiodes,5,6 whose opera-\ntion relies on charge multiplication caused by the ionization.\nTheoretical investigations into the role of impact ionization\nin carrier transport have been carried out by Wolff,7\nShockley,8 Baraff9 and Ridley,10 among others. These ana-\nlytical theories are based on simple carrier transport models,\nand are concerned mainly with the process by which carriers\ngain sufficient energy to initiate ionization, assuming that it\noccurs rapidly once they have done so. To perform more\ndetailed transport modeling, Monte Carlo simulation is com-\nmonly used.11–14 However, the high energy nature of the\nprocess requires the use of realistic band structure, and the\nresulting numerical complexity requires intensive computa-\ntional effort.\nA prerequisite to performing a Monte Carlo transport\nsimulation is to obtain scattering rates due to impact ioniza-\ntion for carriers in the crystal. Keldysh15 obtained an analyti-\ncal expression for the rate at which a carrier of given energy\ninitiates ionization, which has been applied in several Monte\nCarlo simulations.11,16 However the derivation of his expres-\nsion is based on the assumption that the valence and conduc-\ntion bands are spherical and parabolic, the band gap is direct\nand the matrix elements can be taken to be constant. In semi-\nconductors whose band gap is sufficiently wide that the im-\npact ionization threshold ~the minimum kinetic energy a car-\nrier must have in order to initiate ionization! lies at energies\nwell above the band edge, these conditions do not apply.\nKane17 performed a more thorough calculation for Si in\nwhich he numerically integrated the rate obtained through\nFermi’s Golden Rule over all energy and momentum con-\nserving transitions, obtaining a significantly different rate to\nthat of Keldysh. Several other workers12,14,18–22 have applied\nmethods similar to Kane’s to obtain impact ionization rates\nincluding the effect of realistic band structure for several\nsemiconductors.\nThe numerical rate integration is highly computationally\nintensive, particularly near threshold where accurate results\ncannot be achieved in a reasonable amount of cpu time. An\nintegration method is presented here which is similar to\nKane’s algorithm, but which can efficiently obtain rates near\nthreshold in the Fermi’s Golden Rule approximation, and is\napplied to several semiconductors to determine impact ion-\nization rates and distributions of generated carriers.\nII. METHOD\nThe rate of transition due to impact ionization for two\nelectrons initially in states at k1 ~the impacting electron! and\nk2 ~the impacted electron! to final states at k18 and k28 ,\ngiven by Fermi’s Golden Rule is23\nRII~k1 ,k2 ,k18 ,k28!5\n2p\n\\\nuM i f u2d~E181E282E12E2!,\n~1!\nwhere E1 , E2 , E18 and E28 are the energies of the electrons\nat k1 , k2 , k18 and k28 respectively ~and where, for notational\nconvenience, the k vector will be assumed also to denote a\nband index!. The matrix element M i f is given by24,23\nM i f5M d2M e , ~2!a!Electronic mail: R.A.Abram@durham.ac.uk\nJOURNAL OF APPLIED PHYSICS VOLUME 85, NUMBER 12 15 JUNE 1999\n81780021-8979\/99\/85(12)\/8178\/8\/$15.00 © 1999 American Institute of Physics\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\nwhere the so called direct matrix element M d is given by\nM d5E c18* ~r1!c28* ~r2!Vc1~r1!c2~r2!d3r1 d3r2 , ~3!\nV~r1 ,r2!5\ne2\n~2p!3e0\nE eiq\u0095(r22r1)e~q,v!uqu2 d3q, ~4!\nq5k182k1 , \\v5E12E18 , ~5!\nand the so called exchange matrix element M e is obtained by\nexchanging the indices 18 and 28 in Eqs. ~3! and ~5!. In Eq.\n~4!, e~q,v! is the wave vector- and frequency-dependent di-\nelectric function of the semiconductor, calculated here using\nthe method of Walter and Cohen,25 and q and \\v are the\nwave vector and energy transfer in the transition. The\npseudowave functions, obtained using the nonlocal pseudo-\npotential method of Chelikowski and Cohen,26 are not pure\nspin-up or spin-down but a linear combination\nca5\n1\nAV\n@uau\"&1dau#&]eik\u0096r, ~6!\nwhere a51, 2, 18 or 28, and the term in square brackets is\nthe Bloch periodic part of the wave function consisting of\nspin-up and -down parts ua and da , which are each stored in\nthe computer as expansions of plane waves. Using Eq. ~6!\nthe direct matrix element of Eq. ~3! becomes27,28\nM d5\ne2\ne0V\ndGu ,k181k282k12k2\n3(\nG\n1\ne~qd ,vd!uqdu2\n$U18,1\n(2G)U28,2\n(G1Gu)\n1U18,1\n(2G)D28,2\n(G1Gu)1D18,1\n(2G)U28,2\n(G1Gu)\n1D18,1\n(2G)D28,2\n(G1Gu)%, ~7!\nwhere V is the crystal volume and U and D are the overlap\nintegrals\nUa ,b\n(G8)5\n1\nV E ua*eiG8\u0095rub d3r, ~8!\nDa ,b\n(G8)5\n1\nV E da*eiG8\u0095rdb d3r, ~9!\nand where qd5G1k12k18 , \\vd5E12E18 , and the Kro-\nnecker delta function ensures crystal momentum is con-\nserved to within a reciprocal lattice vector Gu . The exchange\nmatrix element M e is obtained by swapping the indices 18\nand 28 in Eq. ~7!\nTo obtain the total rate associated with an impacting\ncarrier in state k1 , Eq. ~1! must be summed over all possible\ntransitions from that state, i.e., a nine-dimensional integral\nover the variables k18 , k28 and k2 if they are treated as\ncontinuous. The Kronecker delta function of Eq. ~7! ensures\nthat k25k181k282k12Gu and so the nine-dimensional in-\ntegral is reduced to a six-dimensional one over k18 and k28 :\nRII~k1!5\nV2\n~2p!2 E 2p\\ uM i f u2d~DE !d3k18 d3k28 , ~10!\nwhere\nDE5E~k18!1E~k28!2E~k1!2E~k181k282k1!. ~11!\nThe Dirac delta function requires that only energy conserv-\ning transitions contribute to the rate, and defines a surface\nwithin the six-dimensional volume over which the integra-\ntion is performed.\nIn order to perform the integral of Eq. ~10!, the energies\nand wave functions of single electron states must be obtain-\nable at k points throughout the Brillouin zone. Here, they are\nobtained using the empirical pseudopotential method.26 The\noverlap integrals @Eqs. ~8! and ~9!# are calculated using the\npseudowave functions, expanded as plane waves. Because of\nthe complicated nature of the band structure, the integration\nof Eq. ~10! must be performed numerically. Following the\nmethod of Kane,17 the Dirac delta function d(DE) is ap-\nproximated by a top-hat function of finite width 2de . The\nsix-dimensional volume integral can then be performed by\nthe Monte Carlo method in which final state pairs k18 ,k28\nare chosen randomly throughout the Brillouin zone and the\nintegrand evaluated only for those which satisfy the approxi-\nmate energy conservation condition imposed by the top-hat\nfunction, i.e., uDEu<de . However, the integral is typically\nslow to converge due to the fact that only a very small frac-\ntion of randomly sampled final state pairs satisfy the approxi-\nmate energy conservation condition, especially when the im-\npacting vector k1 lies near threshold. The rate of\nconvergence can be increased by increasing the energy width\nde of the top-hat function, but this then leads to errors due to\nthe poor approximation of the Dirac delta function. Below,\nan integration method is described which avoids this prob-\nlem.\nA. Numerical rate integration\nDefining the total volume of final state phase space to be\nsampled as V0 and the volume in which the top-hat function\nis nonzero as Vde , the problem to be overcome concerns the\nfact that V0@Vde . Here, the problem is solved by restrict-\ning the sampling points to some volume VB which is much\nsmaller than V0 , but nevertheless completely encloses Vde .\nThe method of reducing V0 to VB is an iterative procedure,\nwhere the volume over which the integration is to be per-\nformed is divided into subvolumes, and then those which do\nnot contain Vde are discarded. The algorithm is represented\nschematically in Fig. 1. In diagram A of the figure, the total\nvolume of final state phase space V0 is represented as the\nsquare, with the volume selected by the top-hat function Vde\nlying between the ellipses. The space enclosed by the el-\nlipses is small in comparison to the space contained in the\nsquare, and so random sampling within the square will lead\nto few ‘‘hits’’ lying within the ellipses. In diagrams B–D the\nsampling volume is iteratively refined so as to remove re-\ngions not containing the volume of interest between the el-\nlipses. In diagram B, the original volume of phase space has\nbeen bisected in each direction to form a number of subvol-\numes. In the two-dimensional representation, four subvol-\numes are formed, whereas in the actual six-dimensional\nphase space, 64 subvolumes are created. Diagrams C and D\nshow the situation after two and four iterations, respectively,\n8179J. Appl. Phys., Vol. 85, No. 12, 15 June 1999 Harrison, Abram, and Brand\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\nwith regions not containing Vde having been removed. It can\nbe seen that after four iterations, the volume VB remaining\nundiscarded ~shaded gray! is considerably reduced from the\noriginal V0 , but nevertheless completely encloses Vde .\n1. Retaining or discarding subvolumes\nTo implement this algorithm, a method for rapidly deter-\nmining whether or not a subvolume contains any of the vol-\nume of Vde is required. Beattie29 and Wilson30 have noted\nthat for an impacting carrier at a given point in k space, k1 ,\nthe energy difference function DE of Eq. ~11! will have\nminimum and maximum values with respect to k18 and k28 .\nIf\nDEmin~k1!<0<DEmax~k1!, ~12!\nthen there must be a point in k18 ,k28 space at which DE\n50, satisfying the requirement for energy conservation.\nCrystal momentum conservation has already been satisfied\nby writing E(k181k282k1) in place of E(k2) in Eq. ~11!,\nand so it follows that there exists a surface of allowed tran-\nsitions from k1 and a carrier in this state can initiate impact\nionization. The values of DEmin(k1) and DEmax(k1) for final\nstates lying within a subvolume can be determined. ~Note\nthat the minima and maxima within a subvolume will not in\ngeneral correspond to stationary points.! If\nDEmin<1de\nand ~13!\nDEmax>2de ,\nthen it follows that somewhere in the subvolume uDEu\n<de , therefore Vde lies within it and it should not be dis-\ncarded.\nIn fact, searching subvolumes for maxima and minima in\nDE is very cpu time consuming. Instead the following ener-\ngies are defined:\nEmin5E18\nmin\n1E28\nmin\n2E12E2\nmin\n, ~14!\nEmax5E18\nmax\n1E28\nmax\n2E12E2\nmax\n, ~15!\nwhere Ea\nmin\n...Ea\nmax is the range of energies for all states ka\n~a518, 28 or 2! associated with the subvolume in question.\nSince it is always the case that Emin<DEmin,DEmax<Emax,\nthe condition for retaining a subvolume given by Eq. ~13!\ncan be replaced with\nEmin<1de\nand ~16!\nEmax>2de\nand all subvolumes containing Vde will be retained as re-\nquired. In fact, Eq. ~16! is less efficient at reducing the vol-\nume to be sampled than Eq. ~13!, as it will retain some sub-\nvolumes that could have been discarded using Eq. ~13!.\nHowever, as each iteration makes the subvolumes smaller,\nthe efficiency of Eqs. ~13! and ~16! converges. The advan-\ntage of using Eq. ~16! is that three independent three-\ndimensional functions: E18(k18), E28(k28) and E2(k2), must\nbe searched for minima and maxima instead of one six-\ndimensional function DE(k18 ,k28). Searching a three-\ndimensional function for maxima and minima is not signifi-\ncantly easier than searching a six-dimensional one, and in\nthat sense little is gained by using Eq. ~16! in place of Eq.\n~13!. However, the advantage of the three-dimensional rule\nis that all the necessary maxima and minima can be precal-\nculated and stored. It only remains to retrieve their values\nduring the rate integration, which can be done very rapidly.\nThe three-dimensional minima and maxima are stored as\nfollows. Each six-dimensional hypercubic subvolume within\nk18 ,k28 space is the ‘‘product’’ of two cubic volumes in\nthree-dimensional k space, one containing states k18 and the\nother containing states k28 . Although it may be impractical\nto obtain values of DEmin and DEmax for each of N six-\ndimensional subvolumes, it is feasible to obtain and store\nvalues of Ea\nmin and Ea\nmax (a518,28) for each of the AN\nthree-dimensional cubes from which the subvolumes are\nformed. Furthermore, by requiring that impacting vectors be\nlocated at the intersections of the stored three-dimensional\nfinal state cubes, the corresponding impacted states also lie\nwithin these cubes, and values of E2\nmin and E2\nmax can be\nstored for these also. During execution of the integration\nalgorithm, values of Emin and Emax can be rapidly obtained\nfrom the stored values of Ea\nmin and Ea\nmax through Eqs. ~14!\nand ~15!. Thus by adopting Eq. ~16! in favor of Eq. ~13! as\nthe rule for determining whether subvolumes should be re-\ntained or discarded, it is possible to precalculate and store all\nthe necessary minima and maxima for rapid retrieval during\nintegration.\nNote that the use of the iterative procedure represented\nin Fig. 1 and its use to locate the region of phase space\ncontaining Vde is essential to avoid the need to consider the\nvery large number of subvolumes that would be created if\nthe algorithm were to begin simply by dividing up the whole\nof V0 to the final required level of discretization. Note also\nthat the requirement that impacting vectors lie at the nodes of\nthe mesh of three-dimensional cubic volumes is not highly\nrestrictive as the side length of these cubes is typically 1\/64th\nor 1\/128th of the length G – X in the Brillouin zone. Using\nthis algorithm, the width de of the top-hat function can be set\nmuch lower ~e.g., 1 meV! and the Brillouin zone discretized\nmuch more finely ~e.g., into 128 cells from G to X) than\nFIG. 1. Schematic representation of the method of reducing the volume of\nphase space to be sampled.\n8180 J. Appl. Phys., Vol. 85, No. 12, 15 June 1999 Harrison, Abram, and Brand\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\ncould be achieved using the more direct Monte Carlo ap-\nproach without placing unreasonable demands on computa-\ntional resources.\nIII. RESULTS\nThe rate integration algorithm has been applied to the\nbulk unstrained semiconductors GaAs, In0.53Ga0.47As and\nSi0.5Ge0.5 ~henceforth referred to as InGaAs and SiGe!, all at\n300 K. GaAs, an important semiconductor in the fabrication\nof high-speed devices, is a wide band gap material, in the\nsense that its impact ionization threshold lies at a sufficiently\nhigh energy to invalidate simple analytic band structure ap-\nproximations. InGaAs and SiGe have applications in the de-\nsign of devices for optical communications. They have nar-\nrower band gaps ~direct in InGaAs, indirect in SiGe! than\nGaAs, but nevertheless are wide gap in the sense that ioniza-\ntion thresholds lie at energies above the applicability of\nsimple analytic band approximations.\nBand structure for each material was obtained using a\nnonlocal pseudopotential method26 which includes the spin-\norbit interaction. Form factors for each material are given in\nRef. 31. Pseudowavefunctions were expanded in terms of 65\nplane waves ~130 expansion terms in all, with spin included!.\nEnergy and wave function data were stored on a grid and\nrapidly retrieved by an interpolation scheme during execu-\ntion of the rate integration.\nA. Ionization rates\nAs is generally observed when calculating impact ion-\nization rates for semiconductors with real band structure, the\ncalculated rates for both electrons and holes in all the mate-\nrials are found to depend strongly on the k vector of the\ninitiating carrier, and carriers at the same energy but different\npositions in k space can have widely varying\nrates.3,14,20,21,32,33 The mean rate at a particular impacting\ncarrier energy is obtained by averaging the rate due to carri-\ners at all k vectors at that energy:\nRav~Ei!5\n*R~k!d@E~k!2Ei#d3k\n*d@E~k!2Ei#d3k\n. ~17!\nMean rates calculated in this way are presented for each\nmaterial in Fig. 2. Note that in the indirect gap material\nstudied, the electron initiated threshold lies at lower energy\nthan the hole initiated one, with the opposite applying to the\ndirect gap materials. At high carrier energies, rates for both\ncarrier types in all three materials tend towards the same\norder of magnitude around 1014 s21, as has been noted\nelsewhere.33,34 Allam,35 however, suggests that this may be\ncoincidental as, although the fundamental band gaps of these\nmaterials vary, they all have similar values of ^E ind&, defined\nas\n^E ind&5\n1\n8~EG13EX14EL!, ~18!\nwhere EV is the energy gap between the top of the valence\nband and the bottom of the conduction band valley at V ,\nleading to similar high energy behavior in the rate. In InP,\nfor example, which has a greater value of ^E ind& , we should\nnot expect such behavior.\nThe mean rates can be fitted by the expression\nR~E !5A~E2E0!P, ~19!\nwhere A , P and E0 are the fitted parameters. For a fixed\nvalue of E0 , A and P are adjusted to give the best straight\nline fit by least squares analysis to log(R) vs log(E2E0). This\nfit has an associated rms value, which is itself minimized by\nadjusting the threshold energy E0 . The results of the fits\napplied to electron and hole rates in each material are given\nin Table I. Note that the fitted threshold energy is obtained\nwithout reference to the actual threshold energy calculated\ndirectly from the energy band structure, and so the discrep-\nancy between the fitted and calculated values is an indication\nof the reliability of the fit.\nFigure 3 compares electronic rates for GaAs obtained\nhere with the results of other workers.12,14,19,34 Values for the\nrate obtained by different authors range over more than an\norder of magnitude at any given energy. Possible sources of\nthese discrepancies include numerical approximations made\nin the evaluation of the matrix elements, the use of different\nFIG. 2. Mean impact ionization rates of electrons and holes in GaAs,\nInGaAs, and SiGe.\nTABLE I. Fitting parameters for rates shown in Fig. 2. Fit formula is:\nR(E)5A(E2E0)P ~with R in units of s21 and E in eV!.\nA P E0 ~fit! E0 ~calc!\nGaAs e2 1.431011 5.2 1.89 1.85\nGaAs h1 8.231010 5.1 1.43 1.51\nInGaAs e2 1.631010 5.6 0.75 0.87\nInGaAs h1 1.531011 4.2 0.73 0.78\nSiGe e2 4.631010 4.9 0.84 0.91\nSiGe h1 7.831010 4.7 1.23 1.27\n8181J. Appl. Phys., Vol. 85, No. 12, 15 June 1999 Harrison, Abram, and Brand\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\nband structure, and different implementations of the rate in-\ntegration algorithm. The magnitude of the effect of these is\ninvestigated here.\nThe matrix elements are evaluated using the pseudowave\nfunctions expanded as plane waves. In Fig. 4, the conver-\ngence of the impact ionization matrix elements with respect\nto the number of plane waves used in the expansion of the\nwave function is plotted for InGaAs and SiGe. Convergence\nfor InGaAs is very good when using 65 plane waves or\nmore. In SiGe, the rate of convergence is poorer, with 307\nplane waves being insufficient to ensure well converged re-\nsults. Using 65 plane waves, the matrix elements are within\n;30% of those obtained using 307. Unfortunately, using\nmore plane waves requires considerably greater numerical\neffort. As will be examined in Sec. III B, q transfer is gen-\nerally higher for transitions in SiGe than in InGaAs, and this\nis the likely cause of the slower convergence of the matrix\nelement. In GaAs, mean q transfer is similar to that in\nInGaAs and so it is expected that the rate of convergence of\nthe matrix element will be similar. All the results presented\nin Fig. 3 were obtained using 65 or more plane waves in the\nexpansion of the pseudowave functions ~except Ref. 34\nwhich used a constant matrix element approximation!, and so\npoor convergence of the matrix elements is not the cause of\nthe discrepancies between the calculated rates.\nOf the results compared in Fig. 3, those from Ref. 19\nused a q-dependent expression for the dielectric function\nwhile those from Refs. 12 and 14 used q- and v-dependent\nexpressions. ~The dielectric function does not enter into the\nconstant matrix element approximation of Ref. 34.! Figure 5\ncompares rates obtained in InGaAs using q-dependent and q-\nand v-dependent expressions for the dielectric function. As\nmight be expected, the disagreement between the two calcu-\nlations is greatest at high energy, but the magnitude of the\ndiscrepancy is small in comparison to the range of rate val-\nues seen in Fig. 3. Thus, the sensitivity of the rate to varia-\ntions in the dielectric function is not sufficiently great to\naccount for the disagreement between different authors, par-\nticularly at low impacting carrier energies.\nThe sensitivity of the calculated rates to the details of the\nband structure was tested by comparing rates calculated for\nGaAs using two different band structure calculations. One\nwas the nonlocal pseudopotential calculation of Chelikowski\nand Cohen26 which includes the effect of the spin-orbit in-\nteraction, as used elsewhere in this work, and the other was\nthe local pseudopotential of Cohen and Bergstresser,36 which\nneglects spin. The results plotted in Fig. 3 were all obtained\nfrom local pseudopotential band structure calculations, ex-\ncept for those calculated here. Rates calculated using each\nmethod are plotted in Fig. 6. The difference is greatest at low\nimpacting energy where the rates are most sensitive to the\ndetails of the energy band structure, but generally the dis-\ncrepancy is small in comparison to differences seen between\nthe results of different workers in Fig. 3. Stobbe et al.19 have\nalso examined the sensitivity of the impact ionization rate to\nthe choice of band structure method, finding a similar degree\nof sensitivity as here.\nThe three factors examined above: convergence of the\nmatrix element with respect to the number of plane waves\nused to expand the wave function, the use of different ex-\npressions for the dielectric function, and the use of different\nFIG. 3. Comparison of electronic rates in GaAs calculated here and by other\nworkers—JTH ~Ref. 14!, BH ~Ref. 12!, SY ~Ref. 34!, SRS ~Ref. 19!.\nFIG. 4. Convergence of the impact ionization matrix elements with respect\nto the number of plane waves used in the expansion of the pseudowave\nfunctions.\nFIG. 5. Comparison of electron initiated rates in InGaAs calculated using a\nq- and v-dependent expression for the dielectric function ~as elsewhere in\nthis work! and using a q-dependent expression.\n8182 J. Appl. Phys., Vol. 85, No. 12, 15 June 1999 Harrison, Abram, and Brand\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\nmethods of obtaining the crystal band structure, do not have\na sufficiently great influence on the calculated rate, either\nindividually or in combination, to account for the magnitude\nof the disagreement between the various results of Fig. 3. It\ntherefore seems likely that the most significant factor in ac-\ncounting for the discrepancies is the differences in the imple-\nmentation of the rate integration scheme, particularly with\nregard to the degree of discretization of the Brillouin zone\nand the width of the function used to approximate the energy\nconserving Dirac delta function. The numerical reliability of\nthe algorithm developed here was tested by comparing re-\nsults obtained by it with those obtained by a different nu-\nmerical algorithm developed by Beattie.22 In Beattie’s ap-\nproach, the energy conserving Dirac delta function of Eq.\n~10! is treated exactly ~as opposed to the top-hat approxima-\ntion made here! and the integration is carried out as a surface\nrather than volume integral. The application of Beattie’s al-\ngorithm to real band structures has been described\nelsewhere.37 Here, the two algorithms are used to calculate\nrates in the first conduction band of GaAs along the line k1\n5(t ,0.0551t\/2,0). The results are compared in Fig. 7. The\ntwo algorithms approach the problem of integrating over al-\nlowed transitions in quite different ways, and the similarity\nin their final results can be taken as a good indication that\nthey are both numerically reliable.\nB. Final state distributions\nInvestigation of the distributions of states of the final and\nimpacted particles is of interest, both in the implementation\nof transport simulations and in gaining a better understand-\ning of factors influencing the impact ionization rate. Figure 8\npresents the mean energy of the final and impacted particles\nfor electron and hole initiated transitions in each material. In\nall three materials there is an approximately linear depen-\ndence of the mean energy of each of the generated carriers\non the impacting carrier energy. The scattering of points is\ndue to the dependence of final state energies on the actual k\nvector of the initiating particle rather than just its energy,\nparticularly at lower impacting energies. This is similar to\nthe situation with the rates themselves, which are also explic-\nitly k- rather than just energy-dependent, especially at low\nenergy. The direct gap materials show similar behavior with\neach generated electron generally taking a slightly greater\nshare than the generated hole of the available energy in both\nelectron and hole initiated cases, while in the indirect gap\nmaterial, the distribution of the available energy between the\ngenerated carriers is roughly equal on average. Naturally, a\ngiven impacting carrier does not generate secondary carriers\nFIG. 6. Comparison of electron initiated rates in GaAs, calculated using\nlocal pseudopotential method @Cohen and Bergstresser ~Ref. 36!# and non-\nlocal method with spin @Chelikowski and Cohen ~Ref. 26!#.\nFIG. 7. Comparison of rates in GaAs initiated by electrons in the first\nconduction band along the line k5(t ,0.0551t\/2,0), calculated using the\nvolume integration algorithm developed here and the surface integration\nalgorithm of Beattie ~Refs. 22 and 37!.\nFIG. 8. Mean energies ~in eV! of final and impacted states for electron and\nhole initiated transitions in each material.\n8183J. Appl. Phys., Vol. 85, No. 12, 15 June 1999 Harrison, Abram, and Brand\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\nat a specific energy but rather with a distribution of energies.\nFigure 9 shows the distribution of generated electrons for\ntransitions initiated by electrons in the second conduction\nband of InGaAs. The influence of the conduction band den-\nsity of states is clear at low energy, with the two peaks in the\ndistribution corresponding to generated electrons lying in the\nG and X valleys, while at higher impacting energies the final\nstate distribution is smoothed out into a single flat peak. The\ninfluence of the density of states is not generally as marked\nas in Fig. 9. Distributions of generated holes or electrons\ngenerated by hole initiated ionization, for example, are more\nfeatureless single peaks.\nExamination of the mean momentum transfer during\ntransitions highlights some interesting differences between\nthe direct and indirect gap materials studied here. Figure 10\ncompares the mean q transfer for transitions initiated by\nelectrons located along the line G – K in the second conduc-\ntion band of InGaAs and SiGe. For each material, the line\nwith solid circles indicates the mean value of q calculated by\nweighting all transitions by the squared magnitude of the\ncorresponding matrix element, and the line with empty\ncircles represents the unweighted mean. Two things about\nthe plot are worthy of note. First, the weighted mean q trans-\nfer is considerably lower in InGaAs ~and in GaAs, which\nshows similar behavior to InGaAs! than in SiGe. It is likely\nthat the higher values of q in SiGe are the cause of the\nslower convergence of the matrix element plotted in Fig. 4.\nSecond, in InGaAs, the weighted line lies at significantly\nlower q values than the unweighted line, indicating that the\nmatrix elements act to favor low q transitions in InGaAs\n~and GaAs!. In SiGe however, the weighted and unweighted\nlines lie close together, indicating that the matrix elements in\nSiGe do not act in favor of transitions with any particular q\nvalue. The favoring of low q transitions can increase thresh-\nold softness in the direct gap materials.31\nFIG. 9. Energy distribution of gener-\nated electrons for transitions initiated\nby electrons in the second conduction\nband of InGaAs.\nFIG. 10. Mean q transfer for transitions initiated by electrons in the second\nconduction band of InGaAs and SiGe.\n8184 J. Appl. Phys., Vol. 85, No. 12, 15 June 1999 Harrison, Abram, and Brand\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\nIV. CONCLUSIONS\nA numerical algorithm for calculating the impact ioniza-\ntion rate in the semiclassical Fermi’s Golden Rule approxi-\nmation, which does not suffer from the instability near\nthreshold of algorithms similar to that of Kane,17 has been\npresented. The reliability of this integration method has been\ndemonstrated by comparison with another quite different al-\ngorithm ~that of Beattie22,37!. Possible causes of the disagree-\nment between different authors12,14,19,34 in calculated electron\ninitiated rates in GaAs have been investigated, including the\nsensitivity of the calculated rate on the choice of method for\nobtaining the band structure, the number of plane waves used\nin the expansion of the pseudowave functions and the form\nof the expression used for the dielectric constant. While\nvariation in each of these was found to lead to changes in the\ncalculated rates, they alone could not account for the larger\ndiscrepancies seen between the results of the different au-\nthors, and it must be concluded that differences in the imple-\nmentation of the rate integration algorithms account for\nmuch of the discrepancy.\nThe algorithm developed here was used to obtain impact\nionization rates and distributions of generated carriers in the\nsemiconductors GaAs, In0.53Ga0.47As and Si0.5Ge0.5 . Rates\nfor electron and hole initiated transitions have been pre-\nsented, and approximated by analytical fit formulas. The\nmean energies of the generated carriers were found to have\nan approximately linear dependence on the impacting carrier\nenergy, with generated electrons generally taking a greater\nshare of the available energy than the generated holes in the\ndirect gap materials, for both electron and hole initiated ion-\nization. In the indirect gap material, the generated carriers\nshared the available energy approximately equally. Mean\nmomentum transfer during transitions was found to differ\nsignificantly between the direct and indirect gap materials\nstudied. In the direct gap materials, the mean q transfer was\nlower than in the indirect gap material. The higher q values\nin SiGe are assumed to be the cause of the slower rate of\nconvergence of the impact ionization matrix elements with\nrespect to the number of plane waves used to expand the\npseudowave functions that were observed in this material. It\nwas also found that in GaAs and InGaAs, the matrix ele-\nments act to favor the low q transitions, while in SiGe, this is\nnot the case.\nACKNOWLEDGMENTS\nThe authors would like to thank A. R. Beattie for several\nhelpful discussions. One of the authors ~D.H.! is grateful to\nthe EPSRC~U.K.! for funding this work.\n1 S. M. Sze, Semiconductor Devices, Physics and Technology ~Wiley, New\nYork, 1985!, Chap. 3.\n2 M. H. Somerville, J. A. del Alamo, and W. Hoke, IEEE Electron Device\nLett. 17, 473 ~1996!.\n3 H. Mizuno, M. Morifuji, K. Taniguchi, and C. Hamaguchi, J. Appl. Phys.\n74, 1100 ~1993!.\n4 S. M. Sze, Physics of Semiconductor Devices, 2nd ed. ~Wiley, New York,\n1981!.\n5 G. E. Stillman and C. M. Wolf, Infrared Detectors II, Semiconductors and\nSemimetals, Vol. 12 ~Academic, New York, 1977!, Chap. 5.\n6 F. Capasso, Lightwave Communications Technology, Semiconductors and\nSemimetals, Vol. 22 ~Academic, New York, 1985!, Chap. 1.\n7 P. A. Wolff, Phys. Rev. 95, 1415 ~1954!.\n8 W. Shockley, Solid-State Electron. 2, 35 ~1961!.\n9 G. A. Baraff, Phys. Rev. 128, 2507 ~1962!.\n10 B. K. Ridley, J. Phys. C 16, 3373 ~1983!.\n11 H. Shichijo and K. Hess, Phys. Rev. B 23, 4197 ~1981!.\n12 J. Bude and K. Hess, J. Appl. Phys. 72, 3554 ~1992!.\n13 I. H. Og˘uzman, Y. Wang, J. Kolnı´k, and K. F. Brennan, J. Appl. Phys. 77,\n225 ~1995!.\n14 H. K. Jung, K. Taniguchi, and C. Hamaguchi, J. Appl. Phys. 79, 2473\n~1996!.\n15 L. V. Keldysh, Sov. Phys. JETP 10, 509 ~1960!.\n16 J. Kolnı´k, Y. Wang, I. H. Og˘uzman, and K. F. Brennan, J. Appl. Phys. 76,\n3542 ~1994!.\n17 E. O. Kane, Phys. Rev. 159, 624 ~1967!.\n18 Y. Wang and K. F. Brennan, J. Appl. Phys. 76, 974 ~1994!.\n19 M. Stobbe, R. Redmer, and W. Shattke, Phys. Rev. B 49, 4494 ~1994!.\n20 Y. Kamakura, H. Mizuno, M. Yamaji, M. Morifuji, K. Taniguchi, C.\nHamaguchi, T. Kunikiyo, and M. Takenaka, J. Appl. Phys. 75, 3500\n~1994!.\n21 T. Kunikiyo, M. Takenaka, Y. Kamakura, M. Yamaji, H. Mizuno, M.\nMorifuji, and C. Hamaguchi, J. Appl. Phys. 75, 297 ~1994!.\n22 A. R. Beattie, J. Phys. C 18, 6501 ~1985!.\n23 P. T. Landsberg, Recombination in Semiconductors ~Cambridge Univer-\nsity Press, Cambridge, 1991!.\n24 A. R. Beattie and P. T. Landsberg, Proc. R. Soc. London, Ser. A 249, 16\n~1959!.\n25 J. P. Walter and M. L. Cohen, Phys. Rev. B 5, 3101 ~1972!.\n26 J. R. Chelikowski and M. L. Cohen, Phys. Rev. B 14, 556 ~1976!.\n27 N. Sano and A. Yoshii, Phys. Rev. B 45, 4147 ~1992!.\n28 M. Stobbe, A. Ko¨nies, R. Redmer, J. Henk, and W. Schattke, Phys. Rev.\nB 44, 11105 ~1991!.\n29 A. R. Beattie, Semicond. Sci. Technol. 7, 401 ~1992!.\n30 S. P. Wilson, S. Brand, A. R. Beattie, and R. A. Abram, Semicond. Sci.\nTechnol. 8, 1546 ~1993!.\n31 D. Harrison, R. A. Abram, and S. Brand, J. Appl. Phys. 85, 8186 ~1999!,\nfollowing paper.\n32 N. Sano, M. Tomizawa, and A. Yoshii, Jpn. J. Appl. Phys., Part 1 30,\n3662 ~1991!.\n33 T. Kunikiyo, M. Takenaka, M. Morifuji, K. Taniguchi, and C. Hamaguchi,\nJ. Appl. Phys. 79, 7718 ~1996!.\n34 N. Sano and A. Yoshii, J. Appl. Phys. 77, 2020 ~1995!.\n35 J. Allam, Jpn. J. Appl. Phys., Part 1 36, 1529 ~1997!.\n36 M. L. Cohen and T. K. Bergstresser, Phys. Rev. 141, 789 ~1966!.\n37 S. P. Wilson, S. Brand, A. R. Beattie, and R. A. Abram, Semicond. Sci.\nTechnol. 8, 1944 ~1993!.\n8185J. Appl. Phys., Vol. 85, No. 12, 15 June 1999 Harrison, Abram, and Brand\nDownloaded 07 Dec 2010 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/jap.aip.org\/about\/rights_and_permissions\n"}