{"doi":"10.1016\/j.asr.2009.03.007","coreId":"195343","oai":"oai:lra.le.ac.uk:2381\/7419","identifiers":["oai:lra.le.ac.uk:2381\/7419","10.1016\/j.asr.2009.03.007"],"title":"Time of flight measurements over a radio link from Uppsala to Bruntingthorpe and their application to testing predictions methods that approximate the ray tracing technique","authors":["Pietrella, M.","Warrington, E. Michael","Stocker, A.J.","Bianchi, C."],"enrichments":{"references":[{"id":44690074,"title":"A ray-tracing formulation and its application to some problems in over-the-horizon radar,","authors":[],"date":"1998","doi":"10.1029\/98rs01523","raw":"Coleman, C.J., A ray-tracing formulation and its application to some problems in over-the-horizon radar, Radio Science, Vol 33, No. 4, 1187-1197, 1998.","cites":null},{"id":44690069,"title":"A simple model of the vertical distribution of electron concentration in the ionosphere.","authors":[],"date":"1973","doi":"10.1016\/0021-9169(73)90132-3","raw":"Bradley, P.A. and J.R. Dudeney, A simple model of the vertical distribution of electron concentration in the ionosphere. Journal of atmospheric and Terrestrial Physics, Vol 35, 2131-2146, 1973.","cites":null},{"id":44690081,"title":"A two-dimensional analytic ray tracing technique accommodating horizontal gradients,","authors":[],"date":"1997","doi":"10.1029\/96rs03200","raw":"Norman, R. J., and P.S. Cannon, A two-dimensional analytic ray tracing technique accommodating horizontal gradients, Radio Science Vol 32, No. 2, 387-396, 1997 Norman, R. J., and P.S. Cannon, An evaluation of a new two-dimensional analytic ionospheric raytracing technique: Segmented method for analytic ray tracing (SMART). Radio Science, Vol 34, No. 2, 489-499, 1999. Norman, R. J and P.L. Dyson, HF radar backscatter inversion technique. Radio Science, Vol 41.","cites":null},{"id":44690071,"title":"CCIR Atlas of ionospheric characteristics,","authors":[],"date":"1966","doi":null,"raw":"CCIR Atlas of ionospheric characteristics, Rept. 340-1, Oslo, ITU, Geneva, Switzerland, 1966.","cites":null},{"id":44690082,"title":"HF detecting radar and communication frequency selection system.","authors":[],"date":"2006","doi":null,"raw":"RS4010, doi:10.1029\/2005RS003355, 2006 Shi. Z., Xu. D. Liu. H. HF detecting radar and communication frequency selection system. Wuhan University Journal of Natural Science. Vol. 5 No.1, 67-69, 2000 Siddle D.R., A.J. Stocker, and E.M. Warrington, Time-of-flight and direction of arrival of HF radio signals received over a path along the mid-latitude trough: observations, Radio Science, Vol 39, RS4008, doi:10.1029\/2004RS003049, 2004a.","cites":null},{"id":44690079,"title":"HIRT: homing-in ray tracing program, research report,","authors":[],"date":"1994","doi":null,"raw":"Norman, R. J., J.A. Bennett, P.L. Dyson, and J.A. Nguyen, HIRT: homing-in ray tracing program, research report, School of Phys., La Trobe Univ., Bundoora, Victoria, 1994.","cites":null},{"id":44690077,"title":"ICEPAC (Ionospheric Communications Enhanced Profile Analysis and Circuit) Stewart F.G, undated. ICEPAC-Technical Manual, available for download at http:\/\/www.greghand.com\/manuals\/icepac_tech_manual.pdf","authors":[],"date":"1975","doi":null,"raw":"ICEPAC (Ionospheric Communications Enhanced Profile Analysis and Circuit) Stewart F.G, undated. ICEPAC-Technical Manual, available for download at http:\/\/www.greghand.com\/manuals\/icepac_tech_manual.pdf Jones, R. M., and J.J. Stephenson, A versatile three-dimensional ray tracing computer program, Office of Telecommunications Report 75-76, US Government Printing Office, Washington DC 20402, USA, 1975.","cites":null},{"id":44690067,"title":"International Reference Ionosphere","authors":[],"date":"2000","doi":"10.1029\/2000rs002432","raw":"Bilitza, D. International Reference Ionosphere 2000, Radio Science, Vol 36, No. 2, pp. 261–275, 2001.","cites":null},{"id":44690076,"title":"Ionospheric Radio, Peter Peregrinus Ltd. London,","authors":[],"date":"1990","doi":null,"raw":"Davies K. Ionospheric Radio, Peter Peregrinus Ltd. London, 1990 Haydon, G. W., and D.L. Lucas, Predicting ionosphere electron density profiles, Radio Science, Vol. 3, No. 13, 111-119, 1968.","cites":null},{"id":44690087,"title":"Simplified ionospheric regional model for telecommunication application,","authors":[],"date":"1993","doi":"10.1029\/93rs00276","raw":"Zolesi, B., L.R. Cander, G. De Franceschi, Simplified ionospheric regional model for telecommunication application, Radio Science, Vol. 28, No. 4, 603-612, 1993. Zolesi, B., L.R. Cander, G. De Franceschi, On the potential applicability of the simplified","cites":null},{"id":44690064,"title":"The International Reference ionosphere, NSSDC 90-2, World Data Center A, Rockets and Satellites,","authors":[],"date":"1990","doi":null,"raw":"Bilitza, D. (Ed): The International Reference ionosphere, NSSDC 90-2, World Data Center A, Rockets and Satellites, Greenbelt, USA, 1990.","cites":null},{"id":44690084,"title":"Time of flight and direction of arrival of HF radio signals received over a path along the mid-latitude trough: Theoretical considerations,","authors":[],"date":null,"doi":"10.1029\/2004rs003052","raw":"Siddle D.R., N.Y. Zaalov, A.J. Stocker and E.M. Warrington. Time of flight and direction of arrival of HF radio signals received over a path along the mid-latitude trough: Theoretical considerations, Radio Science, Vol 39, RS4009, doi:10.1029\/2004RS003052, 2004b.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-07-01","abstract":"Time of flight measurements (TOF) over the radio link between Uppsala (Tx: 59.9°N, 17.6°E) and Bruntingthorpe (Rx: 52.5°N, 1.1°W) have been performed every 2 min at six frequencies (4.637, 6.954, 8.008, 10.391, 11.118, and 14.364 MHz) during the period November 2006–January 2008. Such measurements have been compared with the TOF provided by three prediction methods that approximate the ray tracing technique: IRI-95, SIRM&BR_D, and ICEPAC. The root mean square deviation (rms) between TOF monthly median measurements and TOF monthly median predictions and the differences (DP) between the length of the median and predicted ray path have been calculated. The results, which are presented in terms of rms and DP for different seasons and different time periods, have indicated that the approximate methods are inadequate and that for more accurate predictions ray tracing techniques should be applied","downloadUrl":"http:\/\/www.sciencedirect.com\/science\/journal\/02731177.","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7419\/3\/Time%20of%20flight%20measurements%20over%20a%20radio-link%20from%20Uppsala%20....pdf","pdfHashValue":"92fd67b4dc68628a381e3789d702675172940ef0","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7419<\/identifier><datestamp>\n                2015-12-10T16:10:05Z<\/datestamp><setSpec>\n                com_2381_171<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_835<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nTime of flight measurements over a radio link from Uppsala to Bruntingthorpe and their application to testing predictions methods that approximate the ray tracing technique<\/dc:title><dc:creator>\nPietrella, M.<\/dc:creator><dc:creator>\nWarrington, E. Michael<\/dc:creator><dc:creator>\nStocker, A.J.<\/dc:creator><dc:creator>\nBianchi, C.<\/dc:creator><dc:description>\nTime of flight measurements (TOF) over the radio link between Uppsala (Tx: 59.9°N, 17.6°E) and Bruntingthorpe (Rx: 52.5°N, 1.1°W) have been performed every 2 min at six frequencies (4.637, 6.954, 8.008, 10.391, 11.118, and 14.364 MHz) during the period November 2006–January 2008. Such measurements have been compared with the TOF provided by three prediction methods that approximate the ray tracing technique: IRI-95, SIRM&BR_D, and ICEPAC. The root mean square deviation (rms) between TOF monthly median measurements and TOF monthly median predictions and the differences (DP) between the length of the median and predicted ray path have been calculated. The results, which are presented in terms of rms and DP for different seasons and different time periods, have indicated that the approximate methods are inadequate and that for more accurate predictions ray tracing techniques should be applied.<\/dc:description><dc:date>\n2010-01-19T15:31:14Z<\/dc:date><dc:date>\n2010-01-19T15:31:14Z<\/dc:date><dc:date>\n2009-07-01<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAdvances in Space Research, 2009, 44 (1), pp. 64-71.<\/dc:identifier><dc:identifier>\n0273-1177<\/dc:identifier><dc:identifier>\nhttp:\/\/www.sciencedirect.com\/science\/article\/pii\/S0273117709001811<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7419<\/dc:identifier><dc:identifier>\n10.1016\/j.asr.2009.03.007<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis is the author's final draft of the paper published as Advances in Space Research, 2009, 44 (1), pp. 64-71.  The final version is available from http:\/\/www.sciencedirect.com\/science\/journal\/02731177.  Doi: 10.1016\/j.asr.2009.03.007<\/dc:rights><dc:publisher>\nElsevier<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0273-1177","issn:0273-1177"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article"],"fullText":" Time of flight measurements over a radio-link from Uppsala to Bruntingthorpe and their \napplication to testing predictions methods that approximate the ray tracing technique. \n \nM. Pietrella \n1\n, E.M. Warrington \n2\n, A.J. Stocker \n2\n and  C. Bianchi \n1\n  \n \n(1) Istituto Nazionale di Geofisica e Vulcanologia, Italy. \n(2) Department of Engineering, University of Leicester, LE1 7RH, U.K. \n \nAbstract \n \nTime of flight measurements (TOF) over the radio link between Uppsala (Tx: 59°.9 N, 17.6° E) and \nBruntingthorpe (Rx: 52.5° N, 1.1° W) have been performed every 2 minutes at 6 frequencies (4.637 \nMHz, 6.954 MHz, 8.008 MHz, 10.391 MHz, 11.118 MHz, and 14.364 MHz) during the period \nNovember 2006 - January 2008. Such measurements have been compared with the TOF provided \nby three prediction methods that approximate the ray tracing technique: IRI-95, SIRM&BR_D, and \nICEPAC. The root mean square deviation (r.m.s.) between TOF monthly median measurements and \nTOF monthly median predictions and the differences (DP) between the length of the median and \npredicted ray path have been calculated. The results, which are presented in terms of r.m.s. and DP \nfor different seasons and different time periods, have indicated that the approximate methods are \ninadequate and that for more accurate predictions ray tracing techniques should be applied. \n \n \n1 Introduction \n \nAccurate predictions of the main parameters characterizing the HF ionospheric channel require a \ndetailed knowledge of the ionospheric conditions that only numerical or analytic ray-tracing \ntechniques can provide. Numerical ray-tracing models (such as Jones and Stephenson, 1975 and \nNorman et al., 1994) are very accurate but they have a high computational time. Analytic ray-\ntracing techniques able to ray trace through horizontal gradients along and in the direction of the ray \npath, (Norman and Cannon, 1997, 1999), are computationally less intensive than numerical ray \ntracing, and for this reason their use is particularly advantageous in HF applications as for example \nin the real-time frequency management of OTH (over-the-horizon) radar systems (Coleman, 1998).  \nIn this work three different predictions methods that approximate ray-tracing techniques were \ntested. The two methods IRI-95 and SIRM&BR_D are so called because they are based on the \nmonthly median electron density profiles provided by the models IRI-95 (Bilitza, 1990; Bilitza, \n2001) and SIRM (Zolesi et al., 1993; Zolesi et al., 1996) in conjunction with the Bradley-Dudeney \nmodel (Bradley and Dudeney, 1973), respectively. The third method is called ICEPAC because it is \nbased on the monthly median electron density profiles provided by the software package named \nICEPAC (Stewart F.G, undated). A description of these methods will be given in Section 2.  \nTime of flight measurements (TOF) as well as azimuthal angle of arrival measurements (AOA), on \nthe Uppsala - Bruntingthorpe radio link, have been performed during the period November 2006 – \nJanuary 2008. A description of the analysis conducted to validate the TOF measurements and obtain \nfrom these the hourly TOF median measurements associated with on great circle 1E and 1F \npropagation modes will be given in Section 3.  \nIn order to test the validity of the methods approximating the ray-tracing technique under “quiet” \nionospheric conditions, comparisons between the predictions provided by IRI-95, SIRM&BR_D, \nICEPAC and the TOF median measurements for the one hop propagation modes 1E and 1F were \ncarried out for different frequencies and seasons. Some results concerning such comparisons and the \ndiscussion of the same are presented in Sections 4 and 5 respectively. \n \n2 Description of methods that approximate ray tracing and data analysis \n \nThe International Reference Ionosphere (IRI) (Bilitza, 1990; Bilitza, 2001) is a global empirical \nmodel which provides monthly median electron density profiles. Over the years, testing and \nmodifications of IRI has continued in order to improve the model and several versions were \nproduced. In this work the IRI-95 prediction method uses the hourly monthly median electron \ndensity profiles predicted by IRI - 95 version. The SIRM&BR_D prediction method utilizes the \nmonthly median predictions of the ionospheric characteristics, foF2 and M(3000)F2, provided by \nSIRM (Zolesi et al., 1993; Zolesi et al., 1996) applied in conjunction with the Bradley - Dudeney \nmodel (Bradley and Dudeney, 1973) to calculate hourly monthly median electron density profiles. \nFor developing IRI-95 and SIRM&BR_D prediction methods, the monthly median electron density \nprofiles N = N(h) provided by IRI-95, and SIRM&BR_D have been used to calculate the vertical \nplasma frequency profiles fv = fv(h) at the mid-point of the Uppsala (Tx) - Bruntingthorpe (Rx) \nradio link. As the effect of Earth curvature is important for ground ranges greater than 500 km, the \ncurvature of the Earth and the known ground range (D = 1411 km) of the radio link, have been \ntaken into account for calculating the secant of the angle of incidence  of the ray at the base of the \nionosphere as a function of R, D, and h (R being the radius of the Earth) (Davies, 1990). The values \nof sec = f(R, D, h), have been calculated assuming a very simple geometry based on ionospheric \nreflections taking place from a simple horizontal mirror at the appropriate height h (figure 1). \nSubsequently, the secant law was applied to calculate the oblique transmission frequencies fob = \nfvsec. The length of the oblique ray path P = f(R, D, sec), its corresponding TOF, and take off \nangle  = f(R, sec) have been calculated from simple mathematical relationships deduced from the \ngeometry sketched in figure 1. It should be noted that the parameters  fob , P, TOF, h, and  (median \nvalues) calculated following the procedure described above are strictly related to each other. This \nmeans that, if TOF predictions come out reliable after comparing them with TOF median \nmeasurements, the other radio propagation path parameters such as fob , P,  h, and  should be also \nconsidered reliable. In other words, a comparison between TOF median prediction and TOF median \nmeasured can be considered suitable for testing indirectly the 'goodness' of prediction of all the \nother parameters.  \nThe software package ICEPAC (Ionospheric Communications Enhanced Profile Analysis and \nCircuit) is a full system performance model for HF radio communications circuits (Stewart F.G, \nundated). Depending on input data it appears in four versions. The version used in this study utilizes \nthe monthly median electron density profiles (Haydon and Lucas., 1968) at the mid-point of the \nradio link derived from CCIR foF2 and M(3000)F2 coefficients (CCIR, 1966) and, from these, \nprovides for a given oblique transmission frequency and hour, predictions of the main propagation \nparameters characterizing a given radio link such as elevation angle, TOF, virtual height, etc.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n3 Data analysis \n \nSystematic observations of parameters TOF and AOA (azimuthal angle of arrival) were performed \nfrom November 2006 to January 2008 over the radio link between Uppsala (Tx: 59.9° N, 17.6° E) \nand Bruntingthorpe (Rx: 52.5° N, 1.1° W) every 2 minutes at 6 frequencies (4.637 MHz, 6.954 \nMHz, 8.008 MHz, 10.391 MHz, 11.118 MHz, and 14.364 MHz). The individual observations of \nTOF have a resolution of 0.1 ms. although the transmitted pulse itself is actually wider than this \n(80% of the power is contained within ~0.5ms). Since we are looking for the peak, an individual \ndetermination has an error of approx. ± 0.05ms since even after propagation the modes are fairly \nsymmetric. The TOF is calibrated by determining the median TOF of sporadic-E modes over a one \nyear period of measurements and comparing this to the value returned by VOACAP (a free \nprofessional HF propagation prediction program, available for download from: \nhttp:\/\/www.voacap.com\/). Some example observations are presented in figures 2-3. \nA preliminary analysis was carried out in order to detect the TOF values associated with off great \ncircle propagation. The AOA measurements were used as a filter to determine whether the signal \nhas travelled via a conventional propagation modes, i.e. along the great circle path, or by another \nmechanism (e.g. deviations due to scattering from irregularities in the auroral oval, Siddle et al. \n2004a,b) that results in the signal being displaced significantly from the great circle direction. With \nthis in mind, as the azimuth angle between Uppsala and Bruntingthorpe is approximately 47°, all \nTOF measurements corresponding to AOA measurements which values differed significantly from \n47°, ( i.e. from 47° ± 1.5°), were disregarded. In such a way, TOF measurements associated with off \ngreat circle propagation modes, interfering signals, or with an array side lobe have been excluded \nfrom the analysis and only TOF measurements related to conventional propagation modes selected. \nMoreover such measurements were “cleaned up” from the calibration offset (2.7±0.1 ms) due to the \ntime it takes for the signal to pass through the filters in the transmitter and receiver. Subsequently \nTOF measurements associated with conventional one hop propagation modes around each hour (hr) \nwere taken into account to extract TOF measurements for 1E (TOF1E, hr) and 1F (TOF1F, hr) \npropagation modes at a given hour. From TOF1E, hr and TOF1F, hr  data, TOF median measurements \nfor 1E (TOF1E, hr, med) and 1F (TOF1F, hr, med) propagation modes were calculated for each hour, \nmonth and frequency. \n \n4 Results   \n \nA few comparisons between TOF monthly median measurements and TOF monthly median \npredictions provided by IRI-95, SIRM&BR_D and ICEPAC are shown in figures 4-6 for different \nseasons and frequencies for the one hop propagation modes 1E and 1F. \n \nTables 1-2 summarize the performances of the three different methods that approximate ray tracing \nin terms of r.m.s. difference between TOF monthly median measurements and TOF monthly median \npredictions over the whole day. \nTo put better in evidence how important are the TOF prediction errors, the lengths of the median \nand predicted ray paths, and their differences (DP),  have been calculated for all the hours and for \nall the frequencies. The minimum and maximum DP values are shown for 1E and 1F propagation \nmodes in tables 3-4 respectively. \n \n \n \n \n \n \n \n5 Discussion of the results  \n \nTaking into account all the signals at frequencies that arrive at the receiver via 1E on great circle \npropagation modes, in winter months (November 2006 to February 2007), equinoctial months \n(March 2007 and April 2007) and summer months (May 2007 to August 2007) the comparisons \nbetween IRI-95 and SIRM&BR_D do not show significant differences in terms of r.m.s. deviation \nAs expected, both the models are able to predict the TOF of 1E on great circle propagation modes \nduring daylight hours. The behaviour of ICEPAC is different because it is also able to predict TOF \nof 1Es propagation modes both during the night time and day time. ICEPAC’s performance in \ngeneral is better than that provided by the IRI-95 and SIRM&BR_D models as shown in figure 4, \nbut some exceptions are present. In particular the performance of ICEPAC shows a remarkable \nimprovement compared with the performance provided by IRI-95 and SIRM&BR_D when the \nsporadic E layer is present as shown in figures 5-6. As can be noted from the results presented in \ntables 1-4 and figures 4-6,  IRI-95, SIRM&BR_D, and ICEPAC give better predictions when 1E \npropagation modes are considered.  \nFor 1E propagation modes,  the comparisons among the three predictions methods in table 3 show \nthat the best performance is provided by ICEPAC (DPmax < 20 km), especially during winter \nmonths. IRI-95 and SIRM&BR_D provide the best performance during summer months while \ndoes not emerge a significant seasonal difference during winter and equinoctial months (DPmax > 20 \nkm). Therefore, under these circumstances the prediction methods are not able to approximate \naccurately the median ray path for 1E propagation modes given that DP values up to around  30 km \nare possible (table 3). \nTherefore IRI-95, SIRM&BR_D, and ICEPAC could be used under ionospheric “quiet” \nconditions, only to provide a rough estimate of the radio propagation path parameters during \ndaylight hours. \n \nTaking into account all the signals at frequencies that arrive at the receiver via 1F on great circle \npropagation modes the results provided by the three methods are not satisfactory as can be seen in \ntable 2 and 4. A visual review of all the results, reveals that the best performances are given by \nICEPAC in January 2007 but only in a few cases  (r.m.s. = 0.034 ms for frequency = 10.391 MHz; \nr.m.s. = 0.025 ms for frequency = 11.118 MHz; r.m.s. = 0.038 ms for frequency = 14.360 MHz).  \nFor 1F propagation modes, the comparisons in table 4 show that the performance is very bad for \neach prediction method and season. In fact, except for a very few cases DPmin > 20 km and  DPmax > \n50 km. DP values of some tens of kilometres (table 4), point out that the predicted ray path is very \ndifferent from the median ray path. This means that the methods IRI-95, SIRM&BR_D, and \nICEPAC, applied to approximate ray tracing technique, fail completely in providing reliable TOF,  \nfob , P,  h, and   predictions under “quiet” ionospheric conditions when 1F propagation modes are \nconsidered. \n \n6 Conclusions \n \nWhen a radio signal reflects from the E region, the oblique ray path is affected by the ionosphere \nfor a relatively short time, consequently the model assuming that ionospheric reflection takes place \nfrom a simple horizontal mirror is a good approximation. This probably explains why IRI-95 and \nSIRM&BR_D can provide under “quiet” ionospheric conditions only a rough estimate of the radio \npropagation path parameters concerning the 1E on great circle propagation modes. When the \npropagation is via the F region, the ionospheric plasma affects the oblique ray path for a longer \ntime, and consequently the model adopted is not a good approximation. In this case the prediction \nmethods investigated here fail and a precise estimate of the time delay and of all the other radio \npropagation path parameters related to it cannot be provided also in the case of “quiet” ionosphere.  \nThis happens because we have tried to characterize the HF ionospheric channel in a very simple \nway, assuming a geometry based on ionospheric reflections taking place from an horizontal mirror, \nand using a modelled electron density profile N = N(h) only in the middle point of the radio link, \nwhile accurate electron density profiles at all points along the whole path between the transmitter \nand receiver should be considered for describing with a good accuracy the HF communication link. \n \nAt least for the particular radio-link analysed, the results obtained in this work show that, in spite of \nthe relative speed of application of the three prediction methods (no ray tracing is required), it is \nnecessary to adopt a different procedure that is able to include a more appropriate knowledge of the \nionospheric conditions. Therefore only a ray tracing technique, either analytical or numerical, could \nbe expected to provide better predictions. The future developments that could improve the \npredictions are the following: \n \n1. A ray tracing technique with magnetic field, coupled with modelled monthly median electron \ndensity profiles in a 2D - 3D ionosphere, could provide large improvements. \n \n2. Elevation angle measurements (EA) collected during the same period (November 2006 to \nAugust 2007) and over the same radio link, could be used in conjunction with AOA \nmeasurements to conduct a preliminary analysis deeper than the one described in Section 2. \n \nStudies concerning the observed spread in elevation angle versus the observed spread in azimuth \nangle could be very useful to determine the on great circle propagation modes and to better \ndistinguish both the different propagation modes and the oblique ray paths affected by the presence \nof tilts.  \n \n \nHowever, it must be pointed out that these results can not be considered definitive, but only \npreliminary because they have been obtained just from one particular radio-path. In fact, a \nsystematic study should be carried out taking into account EA, AOA, and TOF measurements over \nmany other radio links located at lower latitudes to draw the final conclusions.  \n  \nFinally, as regards real time HF applications, as for example in the real-time frequency management \nof OTH (over-the-horizon) radar systems, new studies could be carried out to develop a 3D monthly \nmedian ionospheric model updated, as much as possible, by real-time measurements coming from a \nnetwork of appropriately located ionosondes. In such a way, a 3D real time ionospheric model, \ntaking into account day-to-day ionospheric variability, coupled with a ray tracing technique could \nconstitute a software package able to provide reliable real time predictions of radio propagation \nparameters. In such case, real time TOF measurements could be directly compared with TOF \npredicted to test the “goodness” of the predictions. Obviously, these studies constitute a very \ndifferent work from that described in this paper. They could be a very interesting work to carry out \nin future.   \n \n \nAcknowledgements \n \nThe authors would like to thank  the unknown referees for their useful comments and suggestions \nthat contributed to improving the paper. \n \n \n \n \n  \n \n \n \n \n \n \n7 References \n \n \nBilitza, D. (Ed): The International Reference ionosphere, NSSDC 90-2, World Data Center A, \nRockets and Satellites, Greenbelt, USA, 1990. \n \nBilitza, D. International Reference Ionosphere 2000, Radio Science, Vol 36, No. 2, pp. 261–275, \n2001. \n \nBradley, P.A. and J.R. Dudeney, A simple model of the vertical distribution of electron \nconcentration in the ionosphere. Journal of atmospheric and Terrestrial Physics, Vol 35, 2131-2146, \n1973. \n \nCCIR Atlas of ionospheric characteristics, Rept. 340-1, Oslo, ITU, Geneva, Switzerland, 1966. \n \nColeman, C.J., A ray-tracing formulation and its application to some problems in over-the-horizon \nradar, Radio Science, Vol 33, No. 4, 1187-1197, 1998. \n \nDavies K. Ionospheric Radio, Peter Peregrinus Ltd. London, 1990  \n \nHaydon, G. W., and D.L. Lucas, Predicting ionosphere electron density profiles, Radio Science, \nVol. 3, No. 13, 111-119, 1968. \n \nICEPAC (Ionospheric Communications Enhanced Profile Analysis and Circuit) Stewart F.G, \nundated. ICEPAC-Technical Manual, available for download at http:\/\/www.greg-\nhand.com\/manuals\/icepac_tech_manual.pdf \n \nJones, R. M., and J.J. Stephenson, A versatile three-dimensional ray tracing computer program, \nOffice of Telecommunications Report 75-76, US Government Printing Office, Washington DC \n20402, USA, 1975. \n \nNorman, R. J., J.A. Bennett, P.L. Dyson, and J.A. Nguyen, HIRT: homing-in ray tracing program, \nresearch report, School of Phys., La Trobe Univ., Bundoora, Victoria, 1994. \n \nNorman, R. J., and P.S. Cannon, A two-dimensional analytic ray tracing technique accommodating \nhorizontal gradients, Radio Science Vol 32, No. 2, 387-396, 1997 \n \nNorman, R. J., and P.S. Cannon, An evaluation of a new two-dimensional analytic ionospheric ray-\ntracing technique: Segmented method for analytic ray tracing (SMART). Radio Science, Vol 34, \nNo. 2, 489-499, 1999. \n \nNorman, R. J  and P.L. Dyson, HF radar backscatter inversion technique. Radio Science, Vol 41. \nRS4010, doi:10.1029\/2005RS003355,  2006 \n Shi. Z., Xu. D. Liu. H. HF detecting radar and communication frequency selection system. Wuhan \nUniversity Journal of Natural Science. Vol. 5 No.1, 67-69, 2000 \n \nSiddle D.R., A.J. Stocker, and E.M. Warrington, Time-of-flight and direction of arrival of HF radio \nsignals received over a path along the mid-latitude trough: observations, Radio Science, Vol 39, \nRS4008, doi:10.1029\/2004RS003049, 2004a. \n \nSiddle D.R., N.Y. Zaalov, A.J. Stocker and E.M. Warrington. Time of flight and direction of arrival \nof HF radio signals received over a path along the mid-latitude trough: Theoretical considerations, \nRadio Science, Vol 39, RS4009, doi:10.1029\/2004RS003052, 2004b. \n \nZolesi, B., L.R. Cander, G. De Franceschi, Simplified ionospheric regional model for \ntelecommunication application, Radio Science, Vol. 28, No. 4, 603-612, 1993. \n \nZolesi, B., L.R. Cander, G. De Franceschi, On the potential applicability of the simplified \nionospheric regional model to different mid-latitude areas, Radio Science, Vol. 31, No. 3, 547-552, \n1996. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \nFigure Captions \nFigure 1. Geometry of reflection from a simple horizontal mirror.  \nFigure 2. Observations of TOF (on the left) and AOA (on the right) at Uppsala on 27 December \n2006 for the transmitting frequencies 4.637 MHz, 6.954 MHz, 8.008 MHz, 10.391 MHz, 11.118 \nMHz, and 14.364 MHz; in particular, note the small variations in TOF at around 14.00 U.T. at the \nfrequencies 10.391 and 11.118 MHz indicating a change from 1F to 1E propagation mode. \n \nFigure 3: As for figure 2 but for the day 21 May 2007; in particular, note the change of the signal \nAOA by several tens of degrees to the north and the corresponding increase in the TOF occurring \ntowards the end of the day at the frequencies 10.391 and 11.118 MHz. These AOA and TOF \nvariations show the presence of non -conventional (i.e. off great circle) propagation modes in the \nionosphere. \n \nFigure 4. The squares show the TOF provided by IRI-95 prediction method; the circles show the \nTOF provided by SIRM&BR_D prediction method; the triangles show the TOF predictions \nobtained by ICEPAC. The horizontal line marks the 0 ms level (no difference observed). For 1E \npropagation mode, ICEPAC’s performance is slightly better (r.m.s. = 0.038 ms) than that provided \nby IRI-95 (r.m.s. = 0.045 ms) and by SIRM&BR_D (r.m.s. = 0.045 ms). For 1F propagation mode, \nthe performances provided by IRI-95, SIRM&BR_D and ICEPAC in terms of r.m.s. are equal to \n0.325 ms,  0.139 ms,  and 0.232 ms,  respectively.  \n \nFigure 5. As for figure 4. For 1E propagation mode, ICEPAC’s performance shows a remarkable \nimprovement (r.m.s. = 0.026 ms) compared to that provided by IRI-95 (r.m.s. = 0.055 ms) and by \nSIRM&BR_D (r.m.s. = 0.043 ms). For 1F propagation mode, the performances provided by IRI-\n95, SIRM&BR_D and ICEPAC in terms of r.m.s. are equal to 0.393 ms,  0.292 ms,  and 0.396 ms,  \nrespectively. \n \nFigure 6. As for figure 4. For 1E propagation mode, ICEPAC’s performance shows a remarkable \nimprovement (r.m.s. = 0.023 ms) compared to that provided by IRI-95 (r.m.s. = 0.046 ms) and by \nSIRM&BR_D (r.m.s. = 0.043 ms). For 1F propagation mode, the performances provided by IRI-\n95, SIRM&BR_D and ICEPAC in terms of r.m.s. are equal to  0.177 ms,  0.161 ms,  and 0.234 ms,  \nrespectively. \n \n \n \nFigure 1 \n \n \nFigure 2 \n \n \nFigure 3 \n \n \nFigure 4 \n \n \nFigure 5 \n \n \nFigure 6 \n1E propagation mode \n \nWinter months \nr.m.s min – r.m.s. max \n(ms) \nEquinoctial months \nr.m.s min – r.m.s. max \n(ms) \nSummer months \nr.m.s min – r.m.s. max \n(ms) \nIRI-95 0.038 – 0.099 0.044 – 0.085   0.013 – 0.093   \nSIRM&BR_D 0.045 – 0.099 0.043 – 0.084 0.008 – 0.072   \nICEPAC 0.002 – 0.048 0.022 – 0.062 0.002 –  0.082 \n \nTable 1: The minimum and maximum value of the r.m.s. error are shown taking into account all the \nfrequencies which arrive at the receiver following the 1E on great circle propagation modes. \n \n1F propagation mode \n \nWinter months \nr.m.s min – r.m.s. max \n(ms) \nEquinoctial months \nr.m.s min – r.m.s. max \n(ms) \nSummer months \nr.m.s min – r.m.s. max \n(ms) \nIRI-95 0.071- 0.325 0.072 – 0.393 0.111 – 0.572 \nSIRM&BR_D 0.097– 0.139 0.070 – 0.254   0.108 – 0.340 \nICEPAC 0.025 – 0.325 0.093 -0.396 0.095 – 0.432 \n \nTable 2: The minimum and maximum value of the r.m.s. error are shown taking into account all the \nfrequencies which arrive at the receiver following the 1F on great circle propagation modes. \n \n Winter months \nDPmin – DPmax  \n(km) \nEquinoctial months \nDPmin – DPmax  \n(km) \nSummer months \nDPmin – DPmax  \n(km) \nIRI-95 4.3 - 28.0 10.5 - 24.9 3.8 - 23.1 \nSIRM&BR_D 8.1 - 27.9   9.6 - 24.6 2.4 - 19.6 \nICEPAC     0.1 - 5.27    0.5 - 15.6  0.6 - 16.6 \n \nTable 3: minimum and maximum DP values for different seasons and prediction methods for 1E \npropagation mode  \n \n \n Winter months \n  DPmin – DPmax \n(km) \nEquinoctial months \n      DPmin – DPmax \n (km) \n Summer months \n   DPmin – DPmax \n (km) \nIRI-95 20.1 - 68.9  16.4 - 85.5     32.1 - 171.0  \nSIRM&BR_D 27.7 - 38.5        24.6 - 63.6 32.2 - 88.6   \nICEPAC 2.3 -  49.5        22.9 - 85.2     4.6 - 127.9 \n \nTable 4: minimum and maximum DP values for different seasons and prediction methods for 1F \npropagation mode  \n \n"}