{"doi":"10.1080\/17450140802648413","coreId":"196777","oai":"oai:lra.le.ac.uk:2381\/8979","identifiers":["oai:lra.le.ac.uk:2381\/8979","10.1080\/17450140802648413"],"title":"Developing greater dialogue: knowledge transfer, public engagement and learned societies in the social sciences","authors":["Benyon, John"],"enrichments":{"references":[{"id":43667424,"title":"American Sociological Association presidential address: for public sociology,","authors":[],"date":"2005","doi":"10.1111\/j.1468-4446.2005.00059.x","raw":"Burawoy, M. (2005) 2004 American Sociological Association presidential address: for public sociology, British Journal of Sociology, 56 (2) 259–294.","cites":null},{"id":43667421,"title":"Bridging the gap between higher education and the public (Bristol: National Co-ordinating Centre).","authors":[],"date":"2008","doi":null,"raw":"Beacons for Public Engagement (2008) Bridging the gap between higher education and the public (Bristol: National Co-ordinating Centre).","cites":null},{"id":43667432,"title":"Curiosity’s priceless, argue trailblazers, Times Higher Education Supplement.","authors":[],"date":"2007","doi":null,"raw":"Newman, M. (2007) Curiosity’s priceless, argue trailblazers, Times Higher Education Supplement.","cites":null},{"id":43667422,"title":"Developing dialogue (London: Academy of Social Sciences).","authors":[],"date":"2008","doi":"10.1080\/17450140802598097","raw":"Benyon, J. and David, M. (2008) Developing dialogue (London: Academy of Social Sciences).","cites":null},{"id":43667436,"title":"Increasing the economic impact of the research councils (London:","authors":[],"date":"2006","doi":null,"raw":"Warry, P. (2006) Increasing the economic impact of the research councils (London: DTI). Society for Research in Higher Education SRHE Society for Studies in Organising for Healthcare SHOC Socio-Legal Studies Association SLSA University Association for Contemporary European Studies UACES","cites":null},{"id":43667426,"title":"Innovation, Universities and Skills (DIUS) (2008a) The importance of science to Britain’s future","authors":[],"date":null,"doi":null,"raw":"Department for Innovation, Universities and Skills (DIUS) (2008a) The importance of science to Britain’s future (London: DIUS).","cites":null},{"id":43667427,"title":"Innovation, Universities and Skills (DIUS) (2008b) A vision for science and society","authors":[],"date":null,"doi":null,"raw":"Department for Innovation, Universities and Skills (DIUS) (2008b) A vision for science and society (London: DIUS).","cites":null},{"id":43667434,"title":"Knowledge transfer categorisation and harmonisation project, final report","authors":[],"date":"2007","doi":null,"raw":"Research Councils UK (2007) Knowledge transfer categorisation and harmonisation project, final report (Swindon: RCUK).","cites":null},{"id":43667431,"title":"Lambert Review of Business–University Collaboration,","authors":[],"date":"2003","doi":null,"raw":"Lambert, R. (2003) Lambert Review of Business–University Collaboration, Norwich: HMSO.","cites":null},{"id":43667430,"title":"Misunderstanding science: the public reconstruction of science and technology (Cambridge:","authors":[],"date":"1996","doi":"10.1017\/cbo9780511563737","raw":"Irwin, A. and Wynne, B. (1996) Misunderstanding science: the public reconstruction of science and technology (Cambridge: Cambridge University Press).","cites":null},{"id":43667428,"title":"Modernity and self-identity: self and society in the late modern age (Cambridge:","authors":[],"date":"1991","doi":"10.1177\/144078339302900111","raw":"Giddens, A. (1991) Modernity and self-identity: self and society in the late modern age (Cambridge: Polity Press).","cites":null},{"id":43667423,"title":"Punching our weight (London: British Academy).","authors":[],"date":"2008","doi":"10.1111\/j.1468-0270.2009.01878.x","raw":"British Academy (2008) Punching our weight (London: British Academy).","cites":null},{"id":43667425,"title":"Science and its public: the need for a ‘third way’,","authors":[],"date":"2000","doi":"10.1177\/030631200030006004","raw":"Dickson, D. (2000) Science and its public: the need for a ‘third way’, Social Studies of Science, 30 (6) 917–923.","cites":null},{"id":43667433,"title":"Science and the Public: A Review","authors":[],"date":"2000","doi":"10.1177\/109114210002800605","raw":"Office of Science and Technology\/Wellcome Trust (2000) Science and the Public: A Review of Science Communication and Public Attitudes to Science in Britain (London: OST).","cites":null},{"id":43667435,"title":"The public understanding of science (London:","authors":[],"date":"1985","doi":"10.1038\/317104b0","raw":"Royal Society (1985) The public understanding of science (London: Royal Society).","cites":null},{"id":43667429,"title":"Third Report, Science and society (London: HMSO,","authors":[],"date":"2000","doi":null,"raw":"House of Lords Select Committee on Science and Technology (2000) Third Report, Science and society (London: HMSO, HL Paper 38).","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-02","abstract":"In recent years the British government has repeated its calls for improved transfer of research knowledge and for greater engagement of researchers with practitioners and the public. This echoes calls from Burawoy and others, in the USA and elsewhere, for greater engagement by social sciences. In the UK the national research councils have raised their investment in knowledge transfer activities, six 'beacons for public engagement' have been set up, and the Economic and Social Research Council (ESRC) has enhanced its work in this field. In this context, the UK Academy of Social Sciences (AcSS), which includes 35 learned societies and some 550 academicians, resolved in 2007 to undertake a study of the role of learned societies in membership of the AcSS in promoting knowledge transfer and public engagement. This article outlines how the study was undertaken, the discussions around key terms, and the principal findings which were published in 2008 in a volume entitled Developing Dialogue. The article reports on the activities, capabilities, contributions and weaknesses and strengths of the learned societies that were studied. The Research Assessment Exercise, conducted in the UK in 2007-08, was found to have acted as a significant impediment to such work. The paper outlines six key points arising from the research, noting the variety of learned societies and their activities, the need for greater investment and training, and the leadership role that the Academy itself could play with increased resources. The study found that there is a long way to go before many practitioners, policy makers and members of the public are aware and engaged with much of the work and research in the social sciences in Britain","downloadUrl":"http:\/\/www.informaworld.com\/smpp\/title~db=all~content=g908604593,","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/8979\/3\/benyon%20article.pdf","pdfHashValue":"9301ecc1c54dae329e36d95809118eaa8ecbe784","publisher":"Taylor & Francis (Routledge)","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/8979<\/identifier><datestamp>\n                2016-01-11T11:56:11Z<\/datestamp><setSpec>\n                com_2381_960<\/setSpec><setSpec>\n                com_2381_9551<\/setSpec><setSpec>\n                col_2381_3717<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nDeveloping greater dialogue: knowledge transfer, public engagement and learned societies in the social sciences<\/dc:title><dc:creator>\nBenyon, John<\/dc:creator><dc:description>\nIn recent years the British government has repeated its calls for improved transfer of research knowledge and for greater engagement of researchers with practitioners and the public. This echoes calls from Burawoy and others, in the USA and elsewhere, for greater engagement by social sciences. In the UK the national research councils have raised their investment in knowledge transfer activities, six 'beacons for public engagement' have been set up, and the Economic and Social Research Council (ESRC) has enhanced its work in this field. In this context, the UK Academy of Social Sciences (AcSS), which includes 35 learned societies and some 550 academicians, resolved in 2007 to undertake a study of the role of learned societies in membership of the AcSS in promoting knowledge transfer and public engagement. This article outlines how the study was undertaken, the discussions around key terms, and the principal findings which were published in 2008 in a volume entitled Developing Dialogue. The article reports on the activities, capabilities, contributions and weaknesses and strengths of the learned societies that were studied. The Research Assessment Exercise, conducted in the UK in 2007-08, was found to have acted as a significant impediment to such work. The paper outlines six key points arising from the research, noting the variety of learned societies and their activities, the need for greater investment and training, and the leadership role that the Academy itself could play with increased resources. The study found that there is a long way to go before many practitioners, policy makers and members of the public are aware and engaged with much of the work and research in the social sciences in Britain.<\/dc:description><dc:date>\n2011-01-18T13:43:54Z<\/dc:date><dc:date>\n2011-01-18T13:43:54Z<\/dc:date><dc:date>\n2009-02<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nContemporary Social Science, 2009, 4 (1), pp. 97-113<\/dc:identifier><dc:identifier>\n2158-2041<\/dc:identifier><dc:identifier>\nhttp:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/17450140802648413<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/8979<\/dc:identifier><dc:identifier>\n10.1080\/17450140802648413<\/dc:identifier><dc:language>\nen<\/dc:language><dc:rights>\nThis is the author’s final draft of the paper published as Contemporary Social Science, 2009, 4 (1), pp. 97-113.  The final published version is available at http:\/\/www.informaworld.com\/smpp\/title~db=all~content=g908604593, Doi: 10.1080\/17450140802648413.<\/dc:rights><dc:publisher>\nTaylor & Francis (Routledge)<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["2158-2041","issn:2158-2041"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article"],"fullText":"John Benyon – Developing Greater Dialogue \n \nAbstract \n \nIn recent years the British government has repeated its calls for improved transfer of research \nknowledge and for greater engagement of researchers with practitioners and the public. This echoes \ncalls from Burawoy and others, in the USA and elsewhere, for greater engagement by social \nsciences. In the UK the national research councils have raised their investment in knowledge transfer \nactivities, six ‘beacons for public engagement’ have been set up, and the Economic and Social \nResearch Council (ESRC) has enhanced its work in this field. In this context, the UK Academy of Social \nSciences (AcSS), which includes 35 learned societies and some 550 academicians, resolved in 2007 to \nundertake a study of the role of learned societies in membership of the AcSS in promoting \nknowledge transfer and public engagement. This article outlines how the study was undertaken, the \ndiscussions around key terms, and the principal findings which were published in 2008 in a volume \nentitled Developing Dialogue. The article reports on the activities, capabilities, contributions and \nweaknesses and strengths of the learned societies that were studied. The Research Assessment \nExercise, conducted in the UK in 2007–08, was found to have acted as a significant impediment to \nsuch work. The paper outlines six key points arising from the research, noting the variety of learned \nsocieties and their activities, the need for greater investment and training, and the leadership role \nthat the Academy itself could play with increased resources. The study found that there is a long way \nto go before many practitioners, policy makers and members of the public are aware and engaged \nwith much of the work and research in the social sciences in Britain.     \n1 \n \n \n \nDeveloping Greater Dialogue \nKnowledge Transfer, Public Engagement and Learned Societies in the \nSocial Sciences \n \nJohn Benyon \nInstitute of Lifelong Learning, University of Leicester and Chair of the College of \nLearned Societies, Academy of Social Sciences  \n \n \n \nThe call for engagement \n \nOn 16 January 2008 John Denham, the Secretary of State for Innovation, \nUniversities and Skills, delivered a speech on ‘Science and Society’ (DIUS, 2008a). \nIn this speech, Mr Denham reflected on the ‘Two Cultures’ lecture of C.P. Snow \ngiven in 1959, nearly 50 years’ earlier. He said that today ‘the importance of \nscientific understanding, of engagement across society – and not just among the \nwell-educated – has never been greater’.  \n \nFrom a rather different perspective, social scientists such as Michael Burawoy \n(2005) have advocated greater engagement between the social sciences and the \npublic. He calls for increased status and support for ‘public sociology’, which he \ncontrasts with three other types of sociology – policy, professional, and critical \nsociology. Buroway believes that the social sciences should engage different publics \nin different ways seeking to change the world and ‘making public issues out of \nprivate troubles’ (Burawoy 2005, p. 261).       \n \nOn various occasions in recent years the United Kingdom government has pledged \nits commitment to make greater use of research findings in the development of \n‘evidence-based’ public policy, although it has not always been apparent that this \nhas been the case. The government has also called for greater transfer of research \nknowledge and placed an increasing priority on the engagement of researchers with \n2 \n \nemployers (Lambert 2003) and with the wider public. These calls have come from \nministers and in statements and policies from, for example, the Treasury as well as \nthe Department for Innovation, Universities and Skills (DIUS), and from government \nbodies in Northern Ireland, Scotland and Wales. \n \nIn 2006, the Warry Report, entitled Increasing the Economic Impact of the Research \nCouncils, called for improved knowledge transfer and challenged the research \ncouncils to foster more interaction between researchers and users of their research. \nSince then they have reviewed and harmonised their support schemes, sought new \npartnerships with other organisations, and increased their resources and staff for \nknowledge transfer activities (Research Councils UK, 2007). \n \nOn public engagement, Dr Ian Pearson, who was then Science Minister, initiated \nwork to develop a ‘refreshed approach’ to government science and society policy. In \nNovember 2007 the minister proposed the following as a vision (DIUS, 2008a, p. 5): \nA society that is excited about science, values its importance to economic and social \nwell-being, feels confident in its use, and supports a representative, well-qualified \nscientific workforce. \n \nIn January 2008 funding was announced for six university-based ‘Beacons for \nPublic Engagement’ as collaborative centres ‘to help support, recognise, reward and \nbuild capacity for public engagement work across the UK.’ The Beacons’ prospectus \n(Beacons for Public Engagement 2008) included a statement by Professor David \nEastwood, Chief Executive of the Higher Education Funding Council, which said \n‘Listening to and involving the public is fundamentally important to the work of \nhigher education and society.’   \n \nIn keeping with these calls, the Economic and Social Research Council (ESRC) has \ncommitted itself to an enhancement of both its knowledge transfer and its public \nengagement work. The key elements of its 2007 Knowledge Transfer and Economic \nImpact Strategy are threefold: to create and support impact through knowledge \nexchange, people transfer and infrastructure; to play a leadership role within the \nsocial science community; and to communicate the impact of the social sciences. \nRegarding public engagement, its Delivery Plan 2008–2011 states that it will extend \nits science in society activities with a continuing emphasis on promoting research \n3 \n \ncareers; strengthening the evidence base on engaging with the public; and widening \nthe range of activities for the general public, especially young people. \n \n[BOX 1 about here] \n \nDeveloping the research proposal \n \nIt was in this context that the Academy of Social Sciences resolved to study the \nissues in greater detail and to investigate the role of learned societies in the social \nsciences in promoting knowledge transfer and public engagement. In 2007 the \nAcademy had 32 learned societies in membership. Many of them were already \ninvolved in this sort of work but there seemed to be considerable variation between \nthem in what they did. Little was known of a systematic nature and there did not \nappear to be good communication between the societies, or with the Academy itself \nor the ESRC. There seemed to be a lot of scope for more collaboration and greater \nsharing of ideas and good practice.  \n \nThese matters were discussed in the College of Learned Societies and elsewhere \nwithin the Academy and it was agreed that it would be desirable to have more \ninformation. The proposal that took shape was quite an ambitious project to collect \ninformation on a raft of different aspects of learned societies in the social sciences \nin the United Kingdom.  \n \nThe original idea was for a 30-month project that would collect comparative data \nfrom the different learned societies, including the Academy itself, on their \ndevelopment, aims and objectives, membership, finance and resources, research, \noutreach and promotional activities, work with postgraduates, international \nactivities and other links. It was also intended to identify the need for particular \nadvice and training on different dimensions of knowledge transfer and public \nengagement and to explore other ways that the Academy of Social Sciences and the \nESRC could usefully work with the learned societies. \n \nThe proposal was discussed further within the Academy and then with Professor \nIan Diamond, Chief Executive of the ESRC, and Dr Astrid Wissenburg, Director of \nCommunications and Information at the ESRC. Both the Academy and the ESRC \n4 \n \nagreed that it would be valuable to explore how best they could work together, and \nwith the learned societies, to enable people to engage more closely with the social \nsciences. \n    \nAs a result of these discussions, the aims and objectives were honed resulting in a \nmore modest proposal for a one-year study of knowledge transfer, public \nengagement and the learned societies in the social sciences.  \n \nOne of the priorities would be to explore the potential for greater engagement \nbetween the learned societies in the social sciences and policy makers, practitioners \nand the wider public. The objectives included identifying current activities, flagging \nup opportunities for more knowledge transfer and public engagement work, \nhighlighting barriers and obstacles, and increasing awareness of the issues and \nopportunities amongst the learned societies. It was also intended to identify ways \nthat the Academy, ESRC and the learned societies could work together to promote \nknowledge transfer activities and stimulate informed public debate in areas relevant \nto social science. \n \nIt was agreed at the outset that the study should be collaborative with both the \nAcademy and the ESRC contributing resources. The two organisations wanted a \nclear partnership approach. Both the Academy and the ESRC have an established \nand growing commitment to promoting dissemination of research findings to a \nwider audience and to enabling greater public engagement. Both bodies have a \npositive approach to collaborative working involving researchers in the social \nsciences, the learned societies, practitioners and policy makers, and other groups, \nand so it seemed appropriate to work closely together on a study of how to develop \nand enhance this work. \n \nDeveloping definitions \n \nA steering group was established at an early stage in the project and this played an \nimportant role in the study. Early meetings of the steering group spent some time \nconsidering different conceptions of ‘knowledge transfer’ and ‘public engagement’. It \nwas clear that the meaning of some aspects of these terms was contested but it was \naccepted that both activities involve dialogue of various kinds. Such dialogue needs \n5 \n \nto be open and proactive and wherever possible should involve an exchange of \nknowledge and ideas.  \n \nThis accords with the views of the House of Lords Select Committee on Science and \nTechnology outlined in its report on Science and Society, published in 2000. The \ninquiry, chaired by Lord Jenkin, said that the dialogue they advocated entailed \nopen exchange and sharing of knowledge, ideas, values and beliefs between \nscientists, the public(s), stakeholders and decision makers.  \n \nThe importance of this sort of dialogue was underlined by the Secretary of State for \nInnovation, Universities and Skills in the speech he made at the RSA on 16 January \n2008 (DIUS, 2008a). Mr Denham called for a ‘mature relationship between the \nmedia, the public, scientists and government’, with improved ‘talking but, more \nimportantly, listening’:   \nEncouraging two-way communication with the public in the development of science \npolicy must be a priority.   \n \nThe ‘public’ is usually taken, in simple terms, to refer to ‘ordinary people’ or ‘the \ncommunity in general’. Burawoy (2005, p.265) uses the terms ‘academic’ and ‘extra-\nacademic’ to discuss the two sides of social sciences dialogue and notes the great \nvarieties of publics that may be involved. It is clear there are many possible ‘publics’ \ndepending on the particular context, so public engagement activities need to take \nthis into account. Effective dialogue about social science issues with groups of \nschool children in a market town might need to be quite different from, say, groups \nof older people in an inner-city community centre.      \n \nDifferent groups of the public can be identified according to a variety of criteria. For \nexample, the OST and Wellcome Trust report (2000), on Science and the Public, \nidentified six different groups of the public, based on their attitudes towards \nscience. At one end were the ‘technophiles’ (20%) who were positive and well-\ninformed but sceptical of the regulatory system, ‘confident believers’ (17%) who were \npositive about benefits from science and the way it was regulated, and ‘supporters’ \n(17%) who were positive about rapid technological change and government control. \nThe less positive groups of the public were the ‘not sure’ (17%) who were not \ninterested in science and had few opinions, the ‘not for me’ (15%) who were \n6 \n \nuninterested themselves but could see the potential benefits, and the ‘concerned’ \n(13%) who are interested in science but uncertain about its negative effects and \nsceptical about its control and regulation. \n \nThere was also discussion in the project steering group about the meaning of the \nterm ‘practitioners’. After consideration it was agreed to use the term to mean non-\nacademic non-research people from institutions and organisations which would \nbenefit from social science knowledge, understanding and expertise. These might \ninclude politicians, civil servants and other public officials, at different levels of \ngovernment from local, national, European and beyond, professionals from a wide \nvariety of backgrounds, the media, business people and commercial bodies, and \nothers from the public, private and voluntary sectors. \n \nIn light of these discussions the project steering group decided to adopt the \ndefinitions of knowledge transfer and public engagement used at that time by the \nEconomic and Social Research Council: \n \n• Knowledge transfer is taken to be ‘a set of processes aimed at transferring \nknowledge from researchers to users. Although presented as a linear concept, it is \nwidely understood to be more complex. Within the ESRC, knowledge transfer \nrelates specifically to those processes and initiatives to support the direct use of \nfindings by specific users in the public, private and third sectors.’ \n \n• Public engagement is ‘the involvement of specialists listening to, developing \ntheir understanding of, and interacting with, non-specialists. It is a participatory \nmodel of consultation to inform policy development and promoting the flow of \nauthoritative information and exchange of views between scientists, members of the \npublic and policy-makers. For the ESRC this includes providing opportunities for \npublic engagement; supporting social scientists to develop the skills to \ncommunicate with different publics; and helping young people to understand the \nrole of social science to their lives.’  \n \nThese definitions, while not necessarily agreed in every detail by all the AcSS \nmembers and learned societies involved in the project, were for practical purposes \nadopted for use in the study. \n7 \n \n \nUndertaking the Study \n \nThe scope of the revised one-year project and its funding arrangements were agreed \nby the beginning of July 2007. Invitations to tender for the project were then issued \nand William Solesbury Associates were appointed as consultants to undertake the \nresearch. \n \nWork began in August 2007. The objectives were discussed with the consultants \nand agreed to be: improving the knowledge and understanding of learned societies’ \ncurrent activities in knowledge transfer and public engagement; identifying \nopportunities to expand this work; increasing awareness of the aims of the ESRC \nand funding opportunities; and highlighting how such work might be resourced, \norganised and promoted. The final objective was identify ways that the Academy, \nESRC and the learned societies could work together beneficially to promote \nknowledge transfer activities and stimulate informed public debate in areas relevant \nto the social sciences. \n \nThe steering group held its first meeting in September 2007 and met regularly \nthroughout the project. Its membership included four nominees from the ESRC, \nincluding one from DIUS and another from the Scottish Funding Council, and nine \nmembers of learned societies, including the Academy itself. The project consultants \nattended and contributed to the meetings. The steering group not only assisted in \nmanaging and directing the study but its comments and deliberations constituted a \nsignificant part of the research process. A great deal of useful information emerged \nfrom the steering group, and its members facilitated the research process in a \nvariety of significant ways. \n \nThe study employed a variety of methods including: analysis of documents, annual \ntrustees’ reports and web pages of learned societies; interviews with society \nrepresentatives and non-academic practitioners; a workshop with representatives of \nlearned societies, the AcSS and the ESRC; examination of materials, newsletters \nand pamphlets prepared by various learned societies; face-to-face interviews with \nother key informants in policy and practice roles; preparation of ten case studies; \ndiscussions in meetings of the College of Learned Societies and elsewhere within the \n8 \n \nAcademy. Indeed, in addition to meetings of the project steering group, the the \nstudy was discussed on no less than 14 occasions within the Academy, including \nmeetings of the Executive, Council, and College of Learned Societies.   \n \nThe work of the project was divided into three phases – fact-finding, exploring \ndemand, and drawing conclusions and making recommendations. The fact-finding \nphase began in August 2007 with a detailed analysis of the work of the learned \nsocieties. This entailed collecting and examining copies of annual reports and other \nappropriate documents, including reports, publications and leaflets. Web sites were \nvisited and information was collected and recorded.  \n \nA profile of each learned society was compiled using a common template that was \ndiscussed and agreed by the steering group. The idea was to obtain data on similar \ndimensions from each of the 32 learned societies, including the Academy itself, to \nassist in making comparisons and analysing differences. The profile for each society \nprovides basic contact information including name, address and website. It then \nlists status, mission and objectives, membership, governance, annual income, staff \nnumbers, subject and regional groups, international associations, KT\/PE \nresponsibilities, and partnerships and associations. The final section of the profile \nconcerns the activities undertaken by the learned society, including journals, other \npublications, conferences, other events, awards and prizes, school support, displays \nand DVDs, expert speakers, submissions and responses, and press releases.  \n \nThe societies were then invited to examine their profiles and make any necessary \nrevisions, which most of them did. Telephone interviews were then conducted with \nrepresentatives from each learned society, with a response rate of 78 per cent. The \ninterviews covered three broad topics – (1) the rationale for and influences on the \nsociety’s approach to knowledge transfer and public engagement; (2) the success or \notherwise of the society’s various activities; (3) how such work might be enhanced \nin the future. The topics were notified to the interviewees in advance to enable them \nto consult other colleagues in the society and in some cases the interviews involved \nmore than one society representative.   \n \nAn important event in the fact-finding phase was a conference held in London on 2 \nOctober 2007. This was well-attended by members of the learned societies with 27 \n9 \n \npresent, including representatives from the Foundation for Science and Technology \nand the Wellcome Trust. They heard a number of presentations which introduced \nthe project and outlined different approaches to knowledge transfer and \nengagement with the public and particular groups. The conference also included six \npresentations outlining case studies of knowledge transfer and public engagement \nactivities. This was a valuable occasion in terms of data collection and facilitating \nthe overall study. \n \nA report was prepared on the first phase and considered by the steering group. This \nincluded discussion of the typology of learned societies activities and the analysis of \ndifferent societies’ capabilities. In the second phase of exploring demand the project \ninvestigated the demand outside the academic and research world for the \nknowledge and expertise that learned societies and the Academy have to offer, and \nhow it might best be met.  \n \nInterviews were conducted with a selection of individuals from the worlds of \ngovernment policy-making, parliamentary scrutiny, public and independent \nresearch funders and a commercial research organisation. They offered views as \npeople from organisations which might be expected to want and need to use social \nscience knowledge and expertise. The interviews focused on three questions: (1) \nwhat does social science knowledge and expertise contribute to your work? (2) \namong the sources you draw upon, what do you believe is the particular \ncontribution of the social sciences? (3) how could knowledge and expertise in these \ndisciplines be more accessible and useful? \n \n[BOX 2 about here] \n  \nDuring this phase work also commenced on ten case studies of knowledge transfer \nand public engagement activities undertaken by learned societies which are \nincluded in the final project report. A report on the exploring demand phase was \nconsidered by the steering group in February 2008. This meeting also approved the \nproposed outline of the final report. The third phase on conclusions and \nrecommendation was completed by May 2008 when the consultants sent their final \nreport to the Academy.  \n \n10 \n \nThe report was then sent to all societies in membership of the Academy for their \ncomments and suggestions. A large number of views were received and these were \ncollated and incorporated into the revised final report.  \n \nFindings I – Activities \n \nThe final report on the project was published under the title Developing Dialogue \n(Benyon and David, 2008). After outlining the background, context and objectives of \nthe study, the report highlights some of what the Academy and the member learned \nsocieties currently do in terms of knowledge transfer and public engagement work. \nThis is followed by an assessment of their capabilities for such work and what \ninfluences these capabilities. Next Developing Dialogue explores what the learned \nsocieties can contribute to policy, practice and public debates and summarises \ntheir strengths and weaknesses. It then analyses what resources and organisation \nare needed for effective knowledge transfer and public engagement work. Finally, \nthe report draws some conclusions, and makes some recommendations about the \nway forward.  \n \nBOX 3 about here \n \nAs indicated in Box 3, taken together the learned societies which are in membership \nof the Academy of Social Sciences are involved in a wide variety of knowledge \ntransfer and public engagement work. However, while most of them produce \njournals and other sorts of publications, and hold annual conferences, there is \nconsiderable variation in their involvement in other activities. Developing Dialogue \nalso notes that there are various other things that may be worth consideration by \nlearned societies in the social sciences and by the Academy itself, such as inquiry \nand advice services, campaigns, and arts projects. \n \nThe range of knowledge transfer and public engagement activities reported in \nDeveloping Dialogue cover most if not all of those noted in recent national, science-\nwide surveys that are appropriate to organisations like the AcSS and the other \nbodies surveyed (Research Councils UK, 2007). However, it became clear that not \nall of the societies studied placed the same priority on knowledge transfer and \npublic engagement work.  \n11 \n \n \nThe study found that all learned societies saw supporting the academic work and \nprofessional interests of their members as an important goal but the study found \nthat about one third of the societies saw this as their principal or exclusive role. \nAnother third aspired to complement this role by engaging with organisations or \nindividuals outside the academy or profession, but largely lacked the capacities and \nskills to do so. The final third of the societies were already active in knowledge \ntransfer and public engagement work but, in some cases, were keen to be more \nsuccessful and to expand their activities. \n \nFindings II – Capabilities \n \nThe study found that there seem to be three influential factors which affect learned \nsocieties’ capabilities in this work: purpose, capacities and relationships.  \n \nPurpose concerns whether learned societies see knowledge transfer and public \nengagement work as core aims. Those that do may express this in their mission \nstatements. For example, the Royal Statistical Society’s stated purposes include: ‘To \npromote the discipline of statistics by disseminating and encouraging statistical \nknowledge and good practice with both producers and consumers of statistics, and \nin society at large.’ The Social Research Association states that its objective is ‘to \nadvance for the public benefit the conduct, development, knowledge, professional \npractice, education, promotion and dissemination of social research.’  \n \nCapacities are the resources that learned societies possess and choose to allocate to \nknowledge transfer and public engagement work, including the time and efforts of \nsociety members and staff, through special interest groups, as authors and editors, \nas speakers and spokespersons. Capacities also include societies’ paid staff, \nwhether full or part-time employees, or freelance workers engaged by the society to \nundertake specific tasks. Some of the larger learned societies employ professional \nstaff to undertake, for example, media relations and external affairs work. The \nstudy found there was considerable scope for beneficial exchanges of experience \nand training to develop skills and methods among the Academy’s member societies.   \n  \n12 \n \nRelationships with other bodies and individuals can assist societies to undertake \nknowledge transfer and public engagement. These might include professional \nassociations, publishing companies, service providers, campaigning organisations, \nthink tanks or interest groups. Such relationships can enhance the standing of a \nsociety, create further opportunities to communicate and be heard, and may well \nattract more resources including financial support. As an example, the Social \nServices Research Group has a partnership with the Social Care Institute for \nExcellence, which shares the society’s interests in social care research but has \nmore resources than the society. Such relationships can considerably assist in \npromoting better dialogue. \n \nThe study found that a note of caution needed to be entered about societies’ \ncapabilities. It became clear from comments made during the project that many \nacademics believed that the Research Assessment Exercise (RAE) had led to adverse \neffects on knowledge transfer and public engagement activities. Writing on behalf of \na learned society, one senior academic stated: \nThe Research Assessment Exercise has created a major discouragement to university-\nbased academics in undertaking such work since it secures no benefit in the RAE and \nis positively discouraged or even prevented as an activity by some heads and vice-\nchancellors who do not wish to see their staff preparing publications or undertaking \nother activities that have no benefit to RAE status. \n \nThe study found that the RAE has worked against capacities, in that it has become \nmore difficult to persuade academics to become involved in knowledge transfer or \npublic engagement work, and has also adversely affected relationships and \npurpose. Similar disincentives were reported in the Wellcome Trust\/MORI (2000) \nstudy The Role of Scientists in Public Debate. The study found that there were real \nimpediments to persuading scientists to get involved in knowledge transfer and \npublic engagement. \n \nMany academics did not see these activities, and even lifelong learning work, as \nbeing mainstream as they were not encouraged and, for example, did not count \ntowards promotion. Wellcome and MORI called for greater rewards from employers \nsuch as universities and other institutions for staff who engage with the public and \nbusiness. However, the RAE has continued to work against this. It is positive to see \n13 \n \nthat John Denham, the Secretary of State for DIUS, has recognised the problem of \n‘disincentives in the system’ and has said that the encouragement of public and \npolicy engagement activities needs to be central to the RAE review (DIUS 2008a, p. \n13): \nI feel we need to have a discussion on whether there is more we can do to ensure that \nthis essential work in not undervalued.    \n \nFindings III – Contributions  \n \nIn addition to exploring the knowledge transfer and public engagement work of the \nlearned societies, and their capabilities and limitations, the research also examined \nthe distinctive contributions that learned societies can make. The study concluded \nthat these might usefully be grouped under three characteristics: knowledge, \nperspective, and methods and skills. Of course, many of the learned societies can \ncontribute in each of these three ways. \n \nFirst, the learned society’s discipline may offer substantive knowledge about a field \nof policy or practice or a matter of public interest – looking, for instance, at \ncomparisons with other countries, patterns and trends, the potential impact of \ndevelopments or the likely effects of new policies. This would seem to be a big \npotential contribution of learned societies in fields such as housing, health, \neducation, the environment, social policy, the media, and crime, policing and \npunishment.  \n \nSecondly, the discipline may offer a particular perspective for understanding \ndifferent aspects of society, the economy, politics or international issues – matters \nlike human behaviour, relationships, learning, communication, and organisational \ndynamics can be explored, for example, in terms of psychology, politics, \nmanagement, economics, linguistics, sociology, and history.  \n \nThirdly, the discipline may bring certain methods and skills to bear on aspects of \nsociety – including those exercised by particular professions, like social workers or \ntown planners, or those more widely applicable, like statistics or evaluation. \n \n14 \n \nWhen the practitioners from various organisations were asked their views about the \ncontributions that research in the social sciences could make, and how knowledge \ntransfer and public engagement might be improved, the results showed that there \nwas little awareness of social science learned societies or how to go about accessing \ndisciplinary-based knowledge and understanding. Some respondents expressed \nfrustration that relatively few learned societies make their members’ research or \nexpertise readily available to those with a professional interest. It was said that \nresearchers were not sufficiently proactive in communicating the findings from their \nstudies. A common view was summarised by one respondent: \nSocial science academics have failed to support us. Their research is not ready and \nthey are not prepared to talk sooner. They are not taking initiatives to disseminate \ntheir ideas. \n \nSome of those who were interviewed contrasted the more visible stance of research \norganisations in the private and voluntary sectors with the less proactive approach \nof the learned societies: \nThink tanks and NGOs do send us stuff. Some is interesting, but it is not as good as \nacademics would do. But they know how to market and embargo – the tricks – and \ntherefore they get coverage even if what they say is not so good. \n \nIn contrast, respondents regarded learned societies as more reliable and \nindependent. Their independence, their broad membership, and their association \nwith rigorous standards of research, were seen as giving learned societies a different \nand enhanced status. However, it was clear that academics and researchers aiming \nto engage in knowledge transfer and public engagement need to accept ‘the rules of \nthe game’ in order to be effective.  \n \nIn particular, relevance to and awareness of changing agendas and political \ncontexts, timeliness in addressing issues, sensitivity to the practical limits on \naction, and clarity and brevity in communication are needed. As one person put it: \n‘The language and style of academic reports are often off-putting’. It was felt that \nlearned societies should be able to assist researchers in getting these things right \nand acting as intermediaries between researchers and practitioners: \nHaving an interpreter is very useful, because peer-reviewed material needs \ninterpretation. \n15 \n \n \nAnother view from practitioners was that contemporary issues and problems often \ncross disciplinary boundaries and learned societies, and particularly the Academy \nitself, might be able to assist in combining different disciplinary approaches. It was \nsaid that bringing people with different types of expertise together to address an \nissue can be creative. A related point was that different disciplinary perspectives \ncan sometimes help to reframe issues. As one respondent put it: \nSocial scientists are good at unpicking issues and recasting them to expose self-\nreinforcing myths and getting space for critical purchase. \n   \nFinally, a number of those interviewed reiterated the difficulties of finding sources \nof independent social sciences expertise and felt that the learned societies and the \nAcademy should be doing more to promote such sources. More frequent updates on \ncurrent thinking from academics and researchers and an up-to-date directory of \nexperts would be welcome. As one respondent put it:  \nThe frustration is that there is no single directory of social science experts. \n \nFindings IV – Weaknesses and strengths \n \nBased on the evidence that was collected from practitioners, case studies, \nresearchers and the learned societies themselves, it is possible to identify a number \nof weaknesses and strengths that the learned societies have in terms of knowledge \ntransfer and public engagement. Of course, these vary between the learned societies \nand not all of them are equally affected. \n \nThe weaknesses appear to include their generally low profile; their frequent focus \non a relatively narrow, discipline-based area of knowledge; their apparent lack of \nawareness of opportunities to contribute academic thinking to public affairs; their \ncommon lack of commitment, resources and skills to be effective in knowledge \ntransfer and public engagement. In addition, as previously discussed, the Research \nAssessment Exercise has acted as a significant impediment as it appears to have \ndowngraded the value of such work in the eyes of many academics. A final \nweakness may be lack of sufficient staff and financial resources for such work. \n \n[BOX 4 about here] \n16 \n \n \nThe strengths of the learned societies and the Academy include their independence, \ncompared to business or government; high levels of trust in their work and \ncontributions to public affairs; their commitment to rigorous standards, giving them \na competitive advantage over other sources of information and advice; their access \nto the breadth of knowledge and expertise both within the membership of individual \nsocieties, especially in their specialist groups, and through multi-disciplinary work \nby collaborating societies, and within the Academy; in some cases, their closeness – \nthrough their membership or through active relationships – with particular \npractitioner communities. \n \nWork on knowledge transfer and public engagement requires appropriate resources \nand organisation. The study found that learned societies which are active and \nsuccessful in these activities have both the necessary resources and an effective \norganisation. The financial resources may come from a variety of sources, including \nincome from members’ subscriptions, savings and investments, fees and charges, \npublication of journals, sponsorship, individual project funding and contributions \nin kind from society members or partner organisations.  \n \nIn terms of organisation, evidence from the research indicates that there are at least \nfour requirements: a member of the society’s executive committee (or subcommittee) \nwith responsibility for encouraging and organising knowledge transfer and public \nengagement activities; skilled staff support, either directly employed or outsourced, \nto undertake detailed organisation; a small group of members to advise and support \nthe knowledge transfer and public engagement; and a cadre of society members \nwith the knowledge, skills and enthusiasm for undertaking such activities. \n \nFindings V – Six key points \n \nAs reported in more detail in Developing Dialogue, the study raised a number of \ncentral issues around knowledge transfer and public engagement in the social \nsciences. It seems worth highlighting six key points. First, learned societies in the \nsocial sciences vary a great deal in their involvement in knowledge transfer and \npublic engagement activities. This reflects the variations between them in size, scale \nand scope. Some are relatively well-resourced but others do not have the means to \n17 \n \norganise many, if any, activities to engage with the public. Taken together, though, \nthe learned societies and the Academy organise a good number of different outreach \nactivities and have acquired a lot of experience and this could usefully be shared \nbetween them. \n \nSecondly, there is considerable variation between learned societies in their attitudes \ntowards knowledge transfer and public. Some do not have a strong inclination to \nbecome involved in outreach activities, or are unaware of the possibilities of funding \nor working with others. On the other hand, in those societies that are active positive \nattitudes are highly evident among their staff and leading trustees. This, then, \nincreases their motivation and confidence in pursuing further activities. \n \nA third key point arising from the study is that there is a need for investment in \ndevelopmental work to strengthen societies’ knowledge transfer and public \nengagement capabilities. This requires clarity of purpose, suitable skills and \nsufficient resources. The Academy and the ESRC could work together to undertake \nthe training and other investment necessary to assist those societies that want it in \ndeveloping work in this field. It might be worth reminding learned societies that \noutreach activities can help to show the public benefit work necessary for charitable \nstatus. \n \n[BOX 5 about here] \n \nFourthly, the Academy and the learned societies have distinctive and important \ncontributions to make in knowledge transfer and public engagement work which \nare separate from others, such as universities and research councils. A fifth point is \nthat multi-disciplinary approaches are often needed to respond effectively to many \npolicy, practice and public issues. This may require different societies to work \ntogether or for the Academy to take the lead and draw in relevant expertise from \nelsewhere. \n \nFinally, partnerships with non-academic organisations can in some cases increase \nthe impact of learned societies’ knowledge transfer and public engagement work. \nDialogue between researchers and those who may use their knowledge and \nexpertise is likely to be a major factor in identifying opportunities for contributing to \n18 \n \npolicy, practice and public affairs, in finding effective ways of making that \ncontribution and, not least, in promoting the wider influence of and support for \nsocial science research. \n \nRealising the potential \n \nThe information gathered during the study indicates that there is considerable \npotential for the Academy of Social Sciences and many, if not all, of the learned \nsocieties to do a good deal more to promote the knowledge transfer and public \nengagement agenda, much of it in partnership with the ESRC. However, this \nincreased activity will require the provision of the necessary resources. It is also \nclear that there is still a long way to go before many practitioners and policy \nmakers, let alone members of the wider public, are aware of the work and activities \nof many of the learned societies in the social sciences, or of the Academy, and of the \nresearch of their members. \n \nThe Academy and the learned societies offer a means to assist in changing the \nculture, thinking, approach, and capacities, in the social sciences, to foster \nincreased knowledge transfer and public engagement work. This can be done in \nvarious different ways – for example, through enhanced training, finding ways to \nenable societies to work together, holding conferences and workshops, and joint \napplications for resources and projects. The Academy of Social Sciences provides a \ndistinctive and effective conduit to reach many researchers and is seeking resources \nto enable it to develop this dimension of its work. \n \nA major conclusion of the study is that the Academy, ESRC and learned societies \nshould work together to develop a clear and practical agenda in the areas of \nknowledge transfer and public engagement to support and inform their closer \ncollaboration and partnership. Various ideas are included in Developing Dialogue \nand a meeting of the steering group took place on 25 September 2008 to consider \nhow matters might be taken forward.  \n \nThe study found that the Academy of Social Sciences offers an effective channel to \nwork with learned societies and academicians to develop activities in this field, in \npartnership with the ESRC wherever appropriate. The report mentions a variety of \n19 \n \npossibilities and the Academy, working with the ESRC, is well-placed to take a lead \nin identifying what works and to help in promoting best practice. The Academy is \nalso ideally positioned to work with learned societies and the ESRC in \nexperimenting with new approaches and promoting collaboration between different \nsocieties and disciplines. \n \nOne thing that emerges from the project is that improved communication with \npractitioners, policy makers and the wider public should be based on a positive \nmodel of engagement. This underlines the belief in the Academy of Social Sciences \nand the Economic and Social Research Council that a two-way dialogue should be \npromoted wherever possible, involving academics and researchers and different \ngroups of the public. This is why the final report was entitled Developing Dialogue. \n \nSocial science dialogue with the public and practitioners should clearly be a \ncontinuing one, with a range of events and activities to enable knowledge transfer, \nprovision of information and opportunities to raise questions. Such dialogue can \npromote change in organisations and institutional cultures (Giddens, 1991). Ideally, \nwhenever possible engagement on particular policy or research developments or \nissues should take place early in the process – what has been called ‘upstream’. \nThis enables people to engage more fully and is likely to decrease cynicism about \nmany ‘consultations’ and increase confidence and trust. It may well also lead to \nbetter research and better decisions. \n \nIt seems clear that the potential that has been identified will only be realised if \nsufficient resources are made available to the Academy of Social Sciences and the \nlearned societies from bodies such as the ESRC and DIUS to enable it to happen. \n \nResearch in the social sciences makes a big contribution to the United Kingdom’s \neconomy, society and politics and to improving people’s well-being. Knowledge \ntransfer and public engagement offer ways to increase and develop this contribution \nand make it more effective. Much has been done but there is much yet to do.  \n \n \nAcknowledgements \n \n20 \n \nThe author and the Academy of Social Sciences would like to thank all the \nmembers of the project steering group for their efforts, and everyone else who took \ntime to participate in the research. Particular thanks are due to William Solesbury \nand Ruth Levitt, from William Solesbury Associates, who undertook the data \ncollection and put together the first draft report. The Academy would also like to \nthank the staff at the ESRC who were involved in the project, particularly Ian \nDiamond, David Guy, Melanie Knetsch, and Astrid Wissenburg.  \n \n \nReferences \n \nBeacons for Public Engagement (2008) Bridging the gap between higher education \nand the public (Bristol: National Co-ordinating Centre). \n \nBenyon, J. and David, M. (2008) Developing dialogue (London: Academy of Social \nSciences). \n \nBritish Academy (2008) Punching our weight (London: British Academy). \n \nBurawoy, M. (2005) 2004 American Sociological Association presidential address: \nfor public sociology, British Journal of Sociology, 56 (2) 259–294. \n \nDickson, D. (2000) Science and its public: the need for a ‘third way’, Social Studies \nof Science, 30 (6) 917–923. \n \nDepartment for Innovation, Universities and Skills (DIUS) (2008a) The importance of \nscience to Britain’s future (London: DIUS). \n \nDepartment for Innovation, Universities and Skills (DIUS) (2008b) A vision for \nscience and society (London: DIUS). \n \nGiddens, A. (1991) Modernity and self-identity: self and society in the late modern \nage (Cambridge: Polity Press). \n \n21 \n \nHouse of Lords Select Committee on Science and Technology (2000) Third Report, \nScience and society (London: HMSO, HL Paper 38). \n \nIrwin, A. and Wynne, B. (1996) Misunderstanding science: the public reconstruction \nof science and technology (Cambridge: Cambridge University Press). \n \nLambert, R. (2003) Lambert Review of Business–University Collaboration, Norwich: \nHMSO. \n \nNewman, M. (2007) Curiosity’s priceless, argue trailblazers, Times Higher Education \nSupplement. \n \nOffice of Science and Technology\/Wellcome Trust (2000) Science and the Public: A \nReview of Science Communication and Public Attitudes to Science in Britain (London: \nOST). \n \nResearch Councils UK (2007) Knowledge transfer categorisation and harmonisation \nproject, final report (Swindon: RCUK). \n \nRoyal Society (1985) The public understanding of science (London: Royal Society). \n \nWarry, P. (2006) Increasing the economic impact of the research councils (London: \nDTI). \n \nWellcome Trust\/MORI (2000) The role of scientists in public debate (London: \nWellcome Trust). \n \n \n \n \n \n \n \nBOXES for inclusion with article by John Benyon \n \n \nBOX 1 Learned societies in membership of the Academy of \nSocial Sciences in June 2008  \n \n \nAssociation for Tourism in Higher Education  ATHE \nAssociation of Family Therapy  AFT \nAssociation of Social Anthropologists  ASA \nBritish Academy of Management BAM \nBritish Association for American Studies BAAS \nBritish Association of International & Comparative Education  BAICE \nBritish Association for Slavonic & East European Studies BASEES \nBritish Association of Applied Linguistics  BAAL \nBritish Educational Research Association  BERA \nBritish Psychological Society  BPS \nBritish Society of Criminology BSC \nBritish Society of Gerontology  BSG \nBritish Sociological Association  BSA \nEconomic History Society  EHS \nFeminist & Women’s Studies Association  FWSA \nGender and Education Association  GEA \nHousing Studies Association   HSA \nJoint University Council  JUC \nLeisure Studies Association  LSA \nMedia, Communications & Cultural Studies Assoc.  MECCSA \nPolitical Studies Association PSA  \nRegional Studies Association RSA \nRoyal Geographical Society – Institute of British Geographers  RGS-IBG \nRoyal Statistical Society  RSS \nRoyal Town Planning Institute  RTPI \nSociety of Legal Scholars  SLS \nSocial Policy Association  SPA \nSocial Research Association  SRA \nSocial Services Research Group  SSRG \nSociety for Research in Higher Education  SRHE \nSociety for Studies in Organising for Healthcare SHOC \nSocio-Legal Studies Association  SLSA \nUniversity Association for Contemporary European Studies UACES \nUK Evaluation Society  UKES \nBOX 2  Case Studies of Learned Societies’ Activities \n \nThe following ten case studies were chosen to exemplify the range of knowledge \nexchange and public engagement activities currently undertaken by learned \nsocieties in the social sciences.  \n \nJournals \nRoyal Statistical Society \n \nProfessional user reviews \nBritish Education Research Association  \n \nAnnual conference \nUnited Kingdom Evaluation Society \n \nPublic events \nAcademy of Social Sciences \n \nAnnual awards ceremony  \nPolitical Studies Association of the United Kingdom  \n \nResources for schools \nEconomic History Society \n \nWorld of sociology DVD \nBritish Sociological Association \n \nDirectory of experts \nUniversity Association for Contemporary European Studies  \n \nConsultations on public policy \nBritish Psychological Society  \n \nMedia relations \nRoyal Geographical Society – Institute of British Geographers \n \n \n \nBOX 3 – Knowledge transfer or public engagement activities undertaken \nby one or more of the learned societies \n \nJournals – often published in partnership with an academic publisher. Some societies \npublish separate journals for practitioners – for example, the Royal Statistical \nSociety’s Applied Statistics. \n \nOther publications – some societies publish material designed for policy, practice or \npublic audiences. For example the Political Studies Association produces a well-\nillustrated publication called Political Studies UK, subtitled ‘Studying, Teaching and \nResearching Politics in the United Kingdom’. It is aimed at a diverse public audience. \n \nAnnual conferences – most learned societies hold an annual conference and some \nencourage involvement by practitioners. For example, the British Educational \nResearch Association has an additional day on which research is presented to, and \ndiscussed by, practitioners. \n \nOther events – seminars, workshops, lectures and other conferences that bring \nresearchers and practitioners together are organised by some societies. Examples \ninclude the public lecture series of the Royal Geographical Society–Institute of British \nGeographers, seminars organised by the Regional Studies Association, and events run \nby the AcSS. \n \nAwards and prizes – some societies make annual awards to academics and \nsometimes to practitioners. Examples include the annual awards ceremony of the \nPolitical Studies Association and the annual awards to journalists introduced by the \nUniversity Association for Contemporary European Studies (UACES) and Reuters. \n \nSchool teaching resources – some societies have produced material for use in \nschools: for example, the Economic History Society published a REFRESH series of \npublications that is now going online as E-REFRESH.  \n \nDisplays and DVDS – some societies produce visual material – the British Sociological \nAssociation has a DVD entitled the World of Sociology and a number of societies offer \npodcasts of conference or seminar presentations. \n \nExpert speakers – most societies will respond to requests for experts who can offer \nadvice or views. A few societies have published directories of their members’ expertise: \nan example is ExpertOnEurope.com run by UACES.  \n \nSubmissions and responses to government on policy and practice matters – some \nsocieties are active in making submissions to inquiries or policy reviews or responding \nto consultations. Examples include the British Psychological Society, the Royal \nGeographical Society-Institute of British Geographers and the Royal Statistical \nSociety. \n \nPress releases – a number of societies issue press releases on papers presented at \ntheir annual conferences and other events and some – notably the British \nPsychological Society – get good press coverage. Fewer societies seek to engage with \nthe media on matters on the policy, practice or public agendas and it seems clear that \nmore could be done in this respect. \n \nTraining – some societies provide training for their members. Both the Social \nResearch Association and the British Academy of Management offer training events \nand the AcSS is planning to do so as resources permit. \n \n \n \nBOX 4 – Weaknesses and strengths of the learned societies and the \nAcademy in knowledge transfer and public engagement activities \n \n \nWeaknesses Strengths \n \nGenerally low profile Independent of government and business \nSingle disciplinary focus Trust in work and contributions   \nLack of awareness of opportunities Commitment to rigorous standards \nLack of commitment to these activities Access to breadth of expertise \nRAE undermining of this work Links with practitioner communities \nInsufficient staff and resources New ways of looking at problems \n \n \n  \n \nBOX 5 – Six key findings on increasing knowledge transfer and public \nengagement activities of learned societies and the Academy  \n \n \n• The size and scope of learned societies, and their involvement in knowledge \ntransfer and public engagement work, is highly variable, but taken together there is \na great deal and variety of practical experience. \n \n• Attitudes towards knowledge transfer and public engagement within learned \nsocieties is an important factor in explaining the variation between societies. \n \n• Strengthening societies’ commitment to such work is a developmental task \nrequiring clarity of purpose, suitable skills and sufficient resources. \n \n• The Academy of Social Sciences and the learned societies need to promote a \ndistinctive contribution to knowledge transfer and public engagement to \ndifferentiate their work from that of others in the field, but they have much to offer. \n \n• Cross-disciplinary approaches are often needed to respond effectively to many \npolicy, practice and public agendas.  \n \n \n• Partnerships with non-academic practitioners may increase the impact of \nlearned societies’ knowledge transfer and public engagement work. \n  \n \n \n  \n  \n \n \n \n \n"}