{"doi":"10.1117\/12.468016","coreId":"53500","oai":"oai:eprints.lincoln.ac.uk:3069","identifiers":["oai:eprints.lincoln.ac.uk:3069","10.1117\/12.468016"],"title":"Edge detection using fuzzy switch","authors":["Ling, Wing-Kuen","Tam, Peter Kwong-Shun"],"enrichments":{"references":[{"id":809752,"title":"A Geometric Approach to Edge Detection,","authors":[],"date":"1998","doi":null,"raw":"1.  J. C. Bezdek, R. Chandraskhar and Y. Attikiouzel, A Geometric Approach to Edge Detection, IEEE Transactions  on Fuzzy Systems, 6 (1), pp. 52-75, February, 1998. Wing-kuen Ling and Kwong-Shun Tam Department of Electronic and Information Engineering, The Hong Kong Polytechnic University. T1  Fuzzifier Fuzzy engine  Defuzzifier T2  Fuzzifier TN  Fuzzifier","cites":null}],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2002-01","abstract":"This paper is to switch various edge filters via a fuzzy approach","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/53500.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/3069\/1\/letter_multimedia_edge_detection.pdf","pdfHashValue":"cca1f4ed90674c4477df3681f3bd5c52559e8172","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:3069<\/identifier><datestamp>\n      2013-03-13T08:43:26Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48363130<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/3069\/<\/dc:relation><dc:title>\n        Edge detection using fuzzy switch<\/dc:title><dc:creator>\n        Ling, Wing-Kuen<\/dc:creator><dc:creator>\n        Tam, Peter Kwong-Shun<\/dc:creator><dc:subject>\n        H610 Electronic Engineering<\/dc:subject><dc:description>\n        This paper is to switch various edge filters via a fuzzy approach.<\/dc:description><dc:date>\n        2002-01<\/dc:date><dc:type>\n        Conference or Workshop contribution<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/3069\/1\/letter_multimedia_edge_detection.pdf<\/dc:identifier><dc:identifier>\n          Ling, Wing-Kuen and Tam, Peter Kwong-Shun  (2002) Edge detection using fuzzy switch.  In: Image Processing: Algorithms and Systems, 21-23 January 2002, San Jose, California USA.  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1117\/12.468016<\/dc:relation><dc:relation>\n        10.1117\/12.468016<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/3069\/","http:\/\/dx.doi.org\/10.1117\/12.468016","10.1117\/12.468016"],"year":2002,"topics":["H610 Electronic Engineering"],"subject":["Conference or Workshop contribution","PeerReviewed"],"fullText":" 1 \nEdge detection via fuzzy switch \n \nEdge detection is the first step for some boundary extraction and boundary \nrepresentation algorithms. It has been playing an important role in image recognition \nand data retrieval problems. For example, in the processing of cancer cell images, \nonce the edges of the cancer cells are detected, the shapes of the cancer cells can be \nseen more clearly. As the shapes of the cancer cells provide useful information for the \nmedical professionals to decide the types of the cancer cells, thus, the technique helps \nto reduce the time and improves the accuracy for the diagnosis procedure. \nSome traditional methods, such as, Sobel filter, Prewitt filter, Roberts filter, \nIsotropic filter and Canny filter, were proposed. These methods were based on \nconvoluting an image with the impulse response of a linear spatial-invariant filter, \nwhich approximates either the first or the second order derivatives. However, when \nthe image is suffered from noise, there is a tradeoff between the detection error \n(signal-to-noise ratio) and the localization (the reciprocal of the root-mean-squared \ndistance of the marked edge from the center of the true edge), and the optimal filter is \nthe derivative of a Gaussian filter. \nIn order to work on this problem, a composition of conditioning, feature \nextraction, blending and scaling is proposed in Reference 1. Conditioning is to \nenhance the raw sensor data for further processing. Some examples of conditioning \nare contrast enhancement and histogram equalization. Feature extraction is to extract \nfeature vectors that represent an edge information. The most common features are the \nSobel features, the Prewitt features and the range and standard deviation features. \nBlending is to aggregate components of feature vectors. The inner product or \n 2 \nMinkowski norms, the generalized logistic functions, such as waterfall functions, and \ncomputational learning models, such as neural-like network models and Takagi-\nSugeno fuzzy reasoning models, are used in the Reference. Finally, scaling is to scale \na raw edge image to get gray levels or crisp points. Dynamic scaling is employed in \nthe Reference. \nHowever, different feature vectors have different properties at the edge points. For \nexample, Sobel features approximate a first order derivative, and hence give a \nmaximum value at an edge point. On the other hand, Laplace features approximate a \nsecond order derivative, which is zero at an edge point. As a result, we should \nconsider these properties when designing some blending functions to aggregate \ndifferent components of the feature vectors together. Moreover, if a blending function \ngives a weighted sum of each element in the feature vectors, then the edge will be \nblurred because a weighted approach will introduce a lowpass effect at the output. \nInstead, we model an edge detector as a fuzzy switch shown in figure 1. The \nexpert systems are the edge detectors that capture the knowledge from different \nexperts. The outputs of the expert systems form a feature vector that provides useful \nedge information. The fuzzifiers are to normalize the values of the elements in the \nfeature vector. The fuzzy engine (fuzzy switch) is to aggregate the components of the \nfeature vectors and the defuzzifier is to map the output of a fuzzy engine to a crisp \npoint that represents an edge point. \nFor the expert systems, we have selected the common gradient operators and \ncompass operators, such as the Sobel filter, Prewitt filter, Roberts filter, Isotopic \nfilter, Canny filter and Kirsch filter. For the blending function, we have selected the \nmaximum value in the feature vector. \n \n 3 \nResults \n \nWe have tested a 512x512 image ‘Cancer’, using the well-known gradient \noperators: the Sobel filter, Prewitt filter, Roberts filter, Isotropic filter and Canny \nfilter, as well as our proposed algorithm. The simulation results show that the Canny \nedge detector produces too many details that the skeletons of the images are lost, and \ngives noisy outputs in some regions. On the other hand, the Prewitt filter and Roberts \nfilter produce too little information on the outputs, so the edges are mainly \ndiscontinuous. In comparison, our proposed algorithm captures the advantages of the \ndifferent expert systems, and so it produces the best results. \n \nReferences \n \n1. J. C. Bezdek, R. Chandraskhar and Y. Attikiouzel, A Geometric Approach to Edge \nDetection, IEEE Transactions on Fuzzy Systems, 6 (1), pp. 52-75, February, \n1998. \n \nWing-kuen Ling and Kwong-Shun Tam \nDepartment of Electronic and Information Engineering, \nThe Hong Kong Polytechnic University. \n \n \n \n \n \n \n \n \nT1 Fuzzifier \nFuzzy engine Defuzzifier \nT2 Fuzzifier \nTN Fuzzifier \nFigure 1. Fuzzy edge detector \n… … \nFuzzy switch Expert systems \n 4 \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n(a) (b) (c) (d) \n(e) (f) (g) \nFigure 2. Results of different edge detectors on the image “Cancer”. (a) original image \n(b) output of Sobel filter (c) output of Prewitt filter (d) output of Roberts filter (e) output \nof Isotropic filter (f) output of Canny filter (g) output of our proposed fuzzy switch \n"}