{"doi":"10.1016\/j.yjmcc.2006.09.014","coreId":"89961","oai":"oai:eprints.gla.ac.uk:4899","identifiers":["oai:eprints.gla.ac.uk:4899","10.1016\/j.yjmcc.2006.09.014"],"title":"Electrophysiological and arrhythmogenic effects of 5-hydroxytryptamine on human atrial cells are reduced in atrial fibrillation","authors":["Pau, D.","Workman, A.J.","Kane, K.A.","Rankin, A.C."],"enrichments":{"references":[{"id":18085002,"title":"5-hydroxytryptamine and atrial fibrillation: how significant is this piece in the puzzle?","authors":[],"date":null,"doi":"10.1046\/j.1540-8167.2003.02381.x","raw":"Yusuf S, Al Saady N, Camm AJ. 5-hydroxytryptamine and atrial fibrillation: how significant is this piece in the puzzle? J Cardiovasc Electrophysiol 2003;14:209-214.","cites":null},{"id":18085012,"title":"5-Hydroxytryptamine causes rate-dependent arrhythmias through 5-HT4 receptors in human atrium: facilitation by chronic β-adrenoceptor blockade. Naunyn Schmiedebergs Arch Pharmacol","authors":[],"date":"1994","doi":"10.1007\/bf00170877","raw":"Kaumann AJ, Sanders L. 5-Hydroxytryptamine causes rate-dependent arrhythmias through 5-HT4 receptors in human atrium: facilitation by chronic β-adrenoceptor blockade. Naunyn Schmiedebergs Arch Pharmacol 1994;349:331-337.","cites":null},{"id":18085006,"title":"A 5-HT4-like receptor in human right atrium. Naunyn Schmiedebergs Arch Pharmacol","authors":[],"date":"1991","doi":"10.1007\/bf00167212","raw":"Kaumann AJ, Sanders L, Brown AM, Murray KJ, Brown MJ. A 5-HT4-like receptor in human right atrium. Naunyn Schmiedebergs Arch Pharmacol 1991;344:150-159.","cites":null},{"id":18085005,"title":"A 5-hydroxytryptamine receptor in human atrium.","authors":[],"date":"1990","doi":"10.1111\/j.1476-5381.1990.tb14108.x","raw":"Kaumann AJ, Sanders L, Brown AM, Murray KJ, Brown MJ. A 5-hydroxytryptamine receptor in human atrium. Br J Pharmacol 1990;100:879-885.","cites":null},{"id":18085037,"title":"Anti-adrenergic effects of endothelin on human atrial action potentials are potentially anti-arrhythmic.","authors":[],"date":null,"doi":"10.1016\/j.yjmcc.2006.01.012","raw":"Redpath CJ, Rankin AC, Kane KA, Workman AJ. Anti-adrenergic effects of endothelin on human atrial action potentials are potentially anti-arrhythmic. J Mol Cell Cardiol 2006;40:717-724.","cites":null},{"id":18085015,"title":"Association. World Medical Association Declaration of Helsinki. Recommendations guiding physicians in biomedical research involving human subjects. Cardiovasc Res","authors":[],"date":"1997","doi":"10.1001\/jama.277.11.925","raw":"World Medical Association. World Medical Association Declaration of Helsinki. Recommendations guiding physicians in biomedical research involving human subjects. Cardiovasc Res 1997;35:2-3.","cites":null},{"id":18085013,"title":"Atrial L-type Ca 2+-channel, β-adrenoreceptor, and 5-hydroxytryptamine type 4 receptor mRNAs in human atrial fibrillation.","authors":[],"date":null,"doi":"10.1007\/s003950170081","raw":"Grammer JB, Zeng X, Bosch RF, Kuhlkamp V. Atrial L-type Ca 2+-channel, β-adrenoreceptor, and 5-hydroxytryptamine type 4 receptor mRNAs in human atrial fibrillation. Basic Res Cardiol 2001;96:82-90.","cites":null},{"id":18085036,"title":"Beta-blockers as antiarrhythmic agents. Handb Exp Pharmacol","authors":[],"date":"2006","doi":null,"raw":"Zicha S, Tsuji Y, Shiroshita-Takeshita A, Nattel S. Beta-blockers as antiarrhythmic agents. Handb Exp Pharmacol 2006;235-266.","cites":null},{"id":18085017,"title":"Cardiovascular effects of intravenous infusions of 5-hydroxytryptamine in man.","authors":[],"date":null,"doi":"10.1111\/j.1476-5381.1959.tb01393.x","raw":"LeMessurier DH, Schwartz CJ, Whelan RF. Cardiovascular effects of intravenous infusions of 5-hydroxytryptamine in man. Br J Pharmacol 1959;14:246-250.","cites":null},{"id":18085035,"title":"Cellular mechanisms of depressed atrial contractility in patients with chronic atrial fibrillation.","authors":[],"date":null,"doi":"10.1161\/01.cir.103.5.691","raw":"Schotten U, Ausma J, Stellbrink C, Sabatschus I, Vogel M, Frechen D, Schoendube F, Hanrath P, Allessie MA. Cellular mechanisms of depressed atrial contractility in patients with chronic atrial fibrillation. Circulation 2001;103:691-698.","cites":null},{"id":18085004,"title":"Central 5-HT4 receptors. Trends Pharmacol Sci","authors":[],"date":"1995","doi":null,"raw":"Eglen RM, Wong EH, Dumuis A, Bockaert J. Central 5-HT4 receptors. Trends Pharmacol Sci 1995;16:391-398.","cites":null},{"id":18085049,"title":"Chronic beta-adrenoceptor blockade and human atrial cell electrophysiology: evidence of pharmacological remodelling. Cardiovasc Res 2003;58:518-525. Legends for Figures and Tables","authors":[],"date":null,"doi":null,"raw":"Workman AJ, Kane KA, Russell J.A., Norrie J., Rankin AC. Chronic beta-adrenoceptor blockade and human atrial cell electrophysiology: evidence of pharmacological remodelling. Cardiovasc Res 2003;58:518-525. Legends for Figures and Tables","cites":null},{"id":18085024,"title":"Comparison of the positive inotropic effects of serotonin, histamine, angiotensin II, endothelin and isoprenaline in the isolated human right atrium. Naunyn Schmiedebergs Arch Pharmacol","authors":[],"date":"1993","doi":"10.1007\/bf00165383","raw":"Zerkowski HR, Broede A, Kunde K, Hillemann S, Schafer E, Vogelsang M, Michel MC, Brodde OE. Comparison of the positive inotropic effects of serotonin, histamine, angiotensin II, endothelin and isoprenaline in the isolated human right atrium. Naunyn Schmiedebergs Arch Pharmacol 1993;347:347-352.","cites":null},{"id":18085048,"title":"Crijns HJGM. Molecular mechanisms of remodeling in human atrial fibrillation.","authors":[],"date":null,"doi":"10.1007\/978-1-4615-1005-5_17","raw":"Brundel BJJM, Henning RH, Kampinga HH, Van Gelder IC, Crijns HJGM. Molecular mechanisms of remodeling in human atrial fibrillation. Cardiovasc Res 2002;54:315-324.","cites":null},{"id":18085020,"title":"currents and human atrial fibrillation. Circ Res","authors":[],"date":"1999","doi":"10.1161\/01.res.85.5.428","raw":"Van Wagoner DR, Pond AL, Lamorgese M, Rossie SS, McCarthy PM, Nerbonne JM. Atrial L-type Ca 2+ currents and human atrial fibrillation. Circ Res 1999;85:428-436.","cites":null},{"id":18085031,"title":"Differences in signal transduction of two 5-HT4 receptor splice variants: compound specificity and dual coupling with Gαs- and Gαi\/o-proteins.","authors":[],"date":null,"doi":"10.1124\/mol.61.1.85","raw":"Pindon A, Van Hecke G, Van Gompel P, Lesage AS, Leysen JE, Jurzak M. Differences in signal transduction of two 5-HT4 receptor splice variants: compound specificity and dual coupling with Gαs- and Gαi\/o-proteins. Mol Pharmacol 2002;61:85-96.","cites":null},{"id":18085030,"title":"Differential functional effects of two 5-HT4 receptor isoforms in adult cardiomyocytes.","authors":[],"date":null,"doi":"10.1016\/j.yjmcc.2005.04.009","raw":"Castro L, Mialet-Perez J, Guillemeau A, Stillitano F, Zolk O, Eschenhagen T, Lezoualc'h F, Bochet P, Fischmeister R. Differential functional effects of two 5-HT4 receptor isoforms in adult cardiomyocytes. J Mol Cell Cardiol 2005;39:335-344.","cites":null},{"id":18084999,"title":"Do human atrial 5-HT4 receptors mediate arrhythmias? Trends Pharmacol Sci","authors":[],"date":"1994","doi":"10.1016\/0165-6147(94)90058-2","raw":"Kaumann AJ. Do human atrial 5-HT4 receptors mediate arrhythmias? Trends Pharmacol Sci 1994;15:451-455.","cites":null},{"id":18085042,"title":"Electrical remodeling in atrial fibrillation.","authors":[],"date":null,"doi":"10.1007\/s00059-006-2787-9","raw":"Dobrev D. Electrical remodeling in atrial fibrillation. Herz 2006;31:108-112.","cites":null},{"id":18085008,"title":"Electrophysiological effects of 5-hydroxytryptamine on isolated human atrial myocytes, and the influence of chronic β-adrenoceptor blockade.","authors":[],"date":null,"doi":"10.1038\/sj.bjp.0705553","raw":"Pau D, Workman AJ, Kane KA, Rankin AC. Electrophysiological effects of 5-hydroxytryptamine on isolated human atrial myocytes, and the influence of chronic β-adrenoceptor blockade. Br J Pharmacol 2003;140:1434-1441.","cites":null},{"id":18085039,"title":"Electrophysiological effects of prucalopride, a novel enterokinetic agent, on isolated atrial myocytes from patients treated with β-adrenoceptor antagonists.","authors":[],"date":null,"doi":"10.1124\/jpet.104.076869","raw":"Pau D, Workman AJ, Kane KA, Rankin AC. Electrophysiological effects of prucalopride, a novel enterokinetic agent, on isolated atrial myocytes from patients treated with β-adrenoceptor antagonists. J Pharmacol Exp Ther 2005;313:146-153.","cites":null},{"id":18085033,"title":"Electrophysiological remodeling in human atrial fibrillation.","authors":[],"date":null,"doi":"10.1007\/978-1-59745-163-5_5","raw":"Van Wagoner DR. Electrophysiological remodeling in human atrial fibrillation. Pacing Clin Electrophysiol 2003;26:1572-1575.","cites":null},{"id":18085019,"title":"Evidence for reentry as a mechanism of cardiac arrhythmias.","authors":[],"date":null,"doi":"10.1007\/bfb0031546","raw":"Moe GK. Evidence for reentry as a mechanism of cardiac arrhythmias. Rev Physiol Biochem Pharmacol 1975;72:55-81.:55-81.","cites":null},{"id":18085023,"title":"High efficiency activation of L-type Ca 2+ current by 5-HT in human atrial myocytes. Receptors Channels","authors":[],"date":"2004","doi":null,"raw":"Di Scala E, Findlay I, Rose S, Aupart M, Argibay J, Cosnay P, Bozon V. High efficiency activation of L-type Ca 2+ current by 5-HT in human atrial myocytes. Receptors Channels 2004;10:159-165.","cites":null},{"id":18085040,"title":"Ionic mechanisms of electrical remodeling in human atrial fibrillation. Cardiovasc Res","authors":[],"date":"1999","doi":null,"raw":"Bosch RF, Zeng X, Grammer JB, Popovic K, Mewis C, Kuhlkamp V. Ionic mechanisms of electrical remodeling in human atrial fibrillation. Cardiovasc Res 1999;44:121-131.","cites":null},{"id":18085022,"title":"L-type Ca 2+ current downregulation in chronic human atrial fibrillation is associated with increased activity of protein phosphatases.","authors":[],"date":null,"doi":null,"raw":"Christ T, Boknik P, Wohrl S, Wettwer E, Graf EM, Bosch RF, Knaut M, Schmitz W, Ravens U, Dobrev D. L-type Ca 2+ current downregulation in chronic human atrial fibrillation is associated with increased activity of protein phosphatases. Circulation 2004;110:2651-2657.","cites":null},{"id":18085021,"title":"L-type calcium currents in atrial myocytes from patients with persistent and non-persistent atrial fibrillation.","authors":[],"date":null,"doi":"10.1007\/s003950170065","raw":"Skasa M, Jungling E, Picht E, Schondube F, Luckhoff A. L-type calcium currents in atrial myocytes from patients with persistent and non-persistent atrial fibrillation. Basic Res Cardiol 2001;96:151-159.","cites":null},{"id":18085041,"title":"Mechanisms of inactivation of L-type calcium channels in human atrial myocytes.","authors":[],"date":"1997","doi":null,"raw":"Sun H, Leblanc N, Nattel S. Mechanisms of inactivation of L-type calcium channels in human atrial myocytes. Am J Physiol 1997;272:H1625-H1635.","cites":null},{"id":18085045,"title":"Molecular basis of downregulation of G-protein-coupled inward rectifying K + current (IK,ACh) in chronic human atrial fibrillation: decrease in GIRK4 mRNA correlates with reduced IK,ACh and muscarinic receptor-mediated shortening of action potentials.","authors":[],"date":null,"doi":"10.1161\/hc4601.099466","raw":"Dobrev D, Graf E, Wettwer E, Himmel HM, Hala O, Doerfel C, Christ T, Schuler S, Ravens U. Molecular basis of downregulation of G-protein-coupled inward rectifying K + current (IK,ACh) in chronic human atrial fibrillation: decrease in GIRK4 mRNA correlates with reduced IK,ACh and muscarinic receptor-mediated shortening of action potentials. Circulation 2001;104:2551-2557.","cites":null},{"id":18085047,"title":"Molecular basis of electrical remodeling in atrial fibrillation.","authors":[],"date":null,"doi":"10.1007\/978-1-59745-163-5_5","raw":"Van Wagoner DR, Nerbonne JM. Molecular basis of electrical remodeling in atrial fibrillation. J Mol Cell Cardiol 2000;32:1101-1117.","cites":null},{"id":18085003,"title":"Peripheral 5-HT4 receptors.","authors":[],"date":"1996","doi":null,"raw":"Hegde SS, Eglen RM. Peripheral 5-HT4 receptors. FASEB J 1996;10:1398-1407.","cites":null},{"id":18085032,"title":"pharmacological characterisation and tissue distribution of a novel 5-HT4 receptor splice variant,","authors":[],"date":null,"doi":"10.1007\/s00210-004-0919-4","raw":"Brattelid T, Kvingedal AM, Krobert KA, Andressen KW, Bach T, Hystad ME, Kaumann AJ, Levy FO. Cloning, pharmacological characterisation and tissue distribution of a novel 5-HT4 receptor splice variant, 5-HT4i. Naunyn Schmiedebergs Arch Pharmacol 2004;369:616-628.","cites":null},{"id":18085028,"title":"Pharmacological modulation of the hyperpolarization-activated current If in human atrial myocytes: focus on G protein-coupled receptors.","authors":[],"date":null,"doi":"10.1016\/j.yjmcc.2004.12.010","raw":"Lonardo G, Cerbai E, Casini S, Giunti G, Bonacchi M, Battaglia F, Fiorani B, Stefano PL, Sani G, Mugelli A. Pharmacological modulation of the hyperpolarization-activated current If in human atrial myocytes: focus on G protein-coupled receptors. J Mol Cell Cardiol 2005;38:453-460.","cites":null},{"id":18085025,"title":"Positive inotropic response to 5-HT in human atrial but not in ventricular heart muscle. Naunyn Schmiedebergs Arch Pharmacol","authors":[],"date":"1992","doi":"10.1007\/bf00169000","raw":"Jahnel U, Rupp J, Ertl R, Nawrath H. Positive inotropic response to 5-HT in human atrial but not in ventricular heart muscle. Naunyn Schmiedebergs Arch Pharmacol 1992;346:482-485.","cites":null},{"id":18085038,"title":"Role of calcium in arrhythmogenesis. Circulation","authors":[],"date":"1989","doi":null,"raw":"Levy MN. Role of calcium in arrhythmogenesis. Circulation 1989;80:IV23-IV30.","cites":null},{"id":18085044,"title":"Role of IKur in controlling action potential shape and contractility in the human atrium: influence of chronic atrial fibrillation.","authors":[],"date":null,"doi":"10.1161\/01.cir.0000145155.60288.71","raw":"Wettwer E, Hala O, Christ T, Heubach JF, Dobrev D, Knaut M, Varro A, Ravens U. Role of IKur in controlling action potential shape and contractility in the human atrium: influence of chronic atrial fibrillation. Circulation 2004;110:2299-2306.","cites":null},{"id":18085010,"title":"Sensitization of human atrial 5-HT4 receptors by chronic β-blocker treatment. Circulation","authors":[],"date":"1995","doi":"10.1161\/01.cir.92.9.2526","raw":"Sanders L, Lynham JA, Bond B, del Monte F, Harding SE, Kaumann AJ. Sensitization of human atrial 5-HT4 receptors by chronic β-blocker treatment. Circulation 1995;92:2526-2539.","cites":null},{"id":18085007,"title":"Serotonin increases calcium current in human atrial myocytes via the newly described 5-hydroxytryptamine4 receptors. Mol Pharmacol","authors":[],"date":"1992","doi":null,"raw":"Ouadid H, Seguin J, Dumuis A, Bockaert J, Nargeot J. Serotonin increases calcium current in human atrial myocytes via the newly described 5-hydroxytryptamine4 receptors. Mol Pharmacol 1992;41:346-351.","cites":null},{"id":18085046,"title":"The contribution of ionic currents to changes in refractoriness of human atrial myocytes associated with chronic atrial fibrillation.","authors":[],"date":null,"doi":"10.1016\/s0008-6363(01)00380-7","raw":"Workman AJ, Kane KA, Rankin AC. The contribution of ionic currents to changes in refractoriness of human atrial myocytes associated with chronic atrial fibrillation. Cardiovasc Res 2001;52:226-235.","cites":null},{"id":18085043,"title":"The indirect negative inotropic effect of carbachol in β1-adrenoceptor antagonist-treated human right atria.","authors":[],"date":null,"doi":"10.1016\/s0014-2999(02)02763-2","raw":"Wangemann T, Giessler C, Willmy-Matthes P, Silber RE, Brodde OE. The indirect negative inotropic effect of carbachol in β1-adrenoceptor antagonist-treated human right atria. Eur J Pharmacol 2003;458:163-170.","cites":null},{"id":18084998,"title":"Working Group on Atrial Fibrillation. Atrial fibrillation: current understandings and research imperatives. The National Heart, Lung, and Blood Institute Working Group on Atrial Fibrillation.","authors":[],"date":"1993","doi":"10.1016\/0735-1097(93)90765-s","raw":"Working Group on Atrial Fibrillation. Atrial fibrillation: current understandings and research imperatives. The National Heart, Lung, and Blood Institute Working Group on Atrial Fibrillation. J Am Coll Cardiol 1993;22:1830-1834.","cites":null},{"id":18085026,"title":"β-adrenergic and several other G protein-coupled receptors in human atrial membranes activate both Gs and Gi. Circ Res","authors":[],"date":"2000","doi":"10.1161\/01.res.87.8.705","raw":"Kilts JD, Gerhardt MA, Richardson MD, Sreeram G, Mackensen GB, Grocott HP, White WD, Davis RD, Newman MF, Reves JG, Schwinn DA, Kwatra MM. β-adrenergic and several other G protein-coupled receptors in human atrial membranes activate both Gs and Gi. Circ Res 2000;87:705-709.","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2007-01","abstract":"5-Hydroxytryptamine (5-HT) is proarrhythmic in atrial cells from patients in sinus rhythm (SR) via activation of 5-HT<sub>4<\/sub> receptors, but its effects in atrial cells from patients with atrial fibrillation (AF) are unknown. The whole-cell perforated patch-clamp technique was used to record L-type Ca<sup>2+<\/sup> current (<i>I<\/i><sub>CaL<\/sub>), action potential duration (APD) and arrhythmic activity at 37 °C in enzymatically isolated atrial cells obtained from patients undergoing cardiac surgery, in SR or with chronic AF. In the AF group, 5-HT (10 μM) produced an increase in <i>I<\/i><sub>CaL<\/sub> of 115 ± 21% above control (<i>n<\/i> = 10 cells, 6 patients) that was significantly smaller than that in the SR group (232 ± 33%; <i>p<\/i>  0.05; <i>n<\/i> = 27 cells, 12 patients). Subsequent co-application of isoproterenol (1 μM) caused a further increase in <i>I<\/i><sub>CaL<\/sub> in the AF group (by 256 ± 94%) that was greater than that in the SR group (22 ± 6%; p &#60; 0.05). The APD at 50% repolarisation (APD<sub>50<\/sub>) was prolonged by 14 ± 3 ms by 5-HT in the AF group (<i>n<\/i> = 37 cells, 14 patients). This was less than that in the SR group (27 ± 4 ms; <i>p<\/i> &#60; 0.05; <i>n<\/i> = 58 cells, 24 patients). Arrhythmic activity in response to 5-HT was observed in 22% of cells in the SR group, but none was observed in the AF group (p &#60; 0.05). Atrial fibrillation was associated with reduced effects of 5-HT, but not of isoproterenol, on <i>I<\/i><sub>CaL<\/sub> in human atrial cells. This reduced effect on <i>I<\/i><sub>CaL<\/sub> was associated with a reduced APD<sub>50<\/sub> and arrhythmic activity with 5-HT. Thus, the potentially arrhythmogenic influence of 5-HT may be suppressed in AF-remodelled human atrium","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.gla.ac.uk:4899<\/identifier><datestamp>\n      2016-08-25T11:00:13Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D52:5243<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><rioxx xmlns=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/\" xmlns:ali=\"http:\/\/ali.niso.org\/2014\/ali\/1.0\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:dcterms=\"http:\/\/purl.org\/dc\/terms\/\" xmlns:rioxxterms=\"http:\/\/docs.rioxx.net\/schema\/v2.0\/rioxxterms\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/ http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/rioxx.xsd\" ><ali:free_to_read>\n    \n      <\/ali:free_to_read><dc:description>5-Hydroxytryptamine (5-HT) is proarrhythmic in atrial cells from patients in sinus rhythm (SR) via activation of 5-HT<sub>4<\/sub> receptors, but its effects in atrial cells from patients with atrial fibrillation (AF) are unknown. The whole-cell perforated patch-clamp technique was used to record L-type Ca<sup>2+<\/sup> current (<i>I<\/i><sub>CaL<\/sub>), action potential duration (APD) and arrhythmic activity at 37 °C in enzymatically isolated atrial cells obtained from patients undergoing cardiac surgery, in SR or with chronic AF. In the AF group, 5-HT (10 μM) produced an increase in <i>I<\/i><sub>CaL<\/sub> of 115 ± 21% above control (<i>n<\/i> = 10 cells, 6 patients) that was significantly smaller than that in the SR group (232 ± 33%; <i>p<\/i>  0.05; <i>n<\/i> = 27 cells, 12 patients). Subsequent co-application of isoproterenol (1 μM) caused a further increase in <i>I<\/i><sub>CaL<\/sub> in the AF group (by 256 ± 94%) that was greater than that in the SR group (22 ± 6%; p &#60; 0.05). The APD at 50% repolarisation (APD<sub>50<\/sub>) was prolonged by 14 ± 3 ms by 5-HT in the AF group (<i>n<\/i> = 37 cells, 14 patients). This was less than that in the SR group (27 ± 4 ms; <i>p<\/i> &#60; 0.05; <i>n<\/i> = 58 cells, 24 patients). Arrhythmic activity in response to 5-HT was observed in 22% of cells in the SR group, but none was observed in the AF group (p &#60; 0.05). Atrial fibrillation was associated with reduced effects of 5-HT, but not of isoproterenol, on <i>I<\/i><sub>CaL<\/sub> in human atrial cells. This reduced effect on <i>I<\/i><sub>CaL<\/sub> was associated with a reduced APD<sub>50<\/sub> and arrhythmic activity with 5-HT. Thus, the potentially arrhythmogenic influence of 5-HT may be suppressed in AF-remodelled human atrium.<\/dc:description><dc:format>application\/pdf<\/dc:format><dc:identifier>http:\/\/eprints.gla.ac.uk\/4899\/1\/4899.pdf<\/dc:identifier><dc:language>en<\/dc:language><dc:publisher>Elsevier<\/dc:publisher><dc:relation>http:\/\/dx.doi.org\/10.1016\/j.yjmcc.2006.09.014<\/dc:relation><dc:source>0022-2828<\/dc:source><dc:subject>RC<\/dc:subject><dc:title>Electrophysiological and arrhythmogenic effects of 5-hydroxytryptamine on human atrial cells are reduced in atrial fibrillation<\/dc:title><rioxxterms:author>Pau, D.<\/rioxxterms:author><rioxxterms:author>Workman, A.J.<\/rioxxterms:author><rioxxterms:author>Kane, K.A.<\/rioxxterms:author><rioxxterms:author>Rankin, A.C.<\/rioxxterms:author><rioxxterms:publication_date>2007-01<\/rioxxterms:publication_date><rioxxterms:type>Journal Article\/Review<\/rioxxterms:type><rioxxterms:version>NA<\/rioxxterms:version><rioxxterms:version_of_record>http:\/\/dx.doi.org\/10.1016\/j.yjmcc.2006.08.007<\/rioxxterms:version_of_record><\/rioxx><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/j.yjmcc.2006.09.014"],"year":2007,"topics":["RC"],"subject":["RC"],"fullText":"  \n \n \n \n \n \nPau, D. and Workman, A.J. and Kane, K.A. and Rankin, A.C. (2007) \nElectrophysiological and arrhythmogenic effects of 5-hydroxytryptamine \non human atrial cells are reduced in atrial fibrillation. Journal of \nMolecular and Cellular Cardiology, 42 (1). pp. 54-62. ISSN 0022-2828 \n \n \n \nhttp:\/\/eprints.gla.ac.uk\/4899\/ \n \nDeposited on: 3 February 2009  \n \n \nEnlighten – Research publications by members of the University of Glasgow \nhttp:\/\/eprints.gla.ac.uk \n  \n1 \n \nElectrophysiological and arrhythmogenic effects of 5-\nhydroxytryptamine on human atrial cells are reduced in atrial \nfibrillation  \n \n \nDavide Pau, Antony J Workman, Kathleen A Kane\n1\n and Andrew C Rankin \nBHF Glasgow Cardiovascular Research Centre, University of Glasgow; \n1\nDepartment of \nPhysiology & Pharmacology, University of Strathclyde, Glasgow, UK. \n \n \nRunning Head: Electrical effects of 5-HT in atrial fibrillation \n \n \nCorresponding author: \nDr Davide Pau, BHF Glasgow Cardiovascular Research Centre, University of Glasgow, 126 \nUniversity Place, Glasgow G12 8TA, UK. \nTel: +44 (0)141 3302723. Fax: +44 (0)141 3308106. \nEmail: d.pau@clinmed.gla.ac.uk \n \n \n \nWord count: 4703 \n \n  \n2 \n \nAbstract: \n5-hydroxytryptamine (5-HT) is pro-arrhythmic in atrial cells from patients in sinus rhythm (SR) \nvia activation of 5-HT4 receptors, but its effects in atrial cells from patients with atrial \nfibrillation (AF) are unknown. The whole-cell perforated patch-clamp technique was used to \nrecord L-type Ca\n2+\n current (ICaL), action potential duration (APD) and arrhythmic activity at \n37ºC in enzymatically-isolated atrial cells obtained from patients undergoing cardiac surgery, in \nSR or with chronic AF. In the AF group, 5-HT (10 µΜ) produced an increase in ICaL of \n115±21% above control (n=10 cells, 6 patients) that was significantly smaller than that in the \nSR group (232±33%; p<0.05; n=27 cells, 12 patients). Subsequent co-application of \nisoproterenol (1 µΜ) caused a further increase in ICaL in the AF group (by 256±94%) that was \ngreater than that in the SR group (22±6%; p<0.05). The APD at 50% repolarisation (APD50) \nwas prolonged by 14±3 ms by 5-HT in the AF group (n=37 cells, 14 patients). This was less \nthan that in the SR group (27±4 ms; p<0.05; n=58 cells, 24 patients). Arrhythmic activity in \nresponse to 5-HT was observed in 22% of cells in the SR group, but none was observed in the \nAF group (p<0.05). Atrial fibrillation was associated with reduced effects of 5-HT, but not of \nisoproterenol, on ICaL in human atrial cells. This reduced effect on ICaL was associated with a \nreduced APD50 and arrhythmic activity with 5-HT. Thus, the potentially arrhythmogenic \ninfluence of 5-HT may be suppressed in AF-remodelled human atrium. \n \n \nKeywords: patch-clamp; myocytes; atrial fibrillation; L-type calcium current; action potentials; \n5-HT; isoproterenol. \n  \n3 \n \nIntroduction \nAtrial fibrillation (AF) is the most common sustained arrhythmia in the developed word and its \nprevalence will increase with the ageing of the population [1]. The occurrence of AF may be \nrelated to structural heart disease, but in many cases there is not a clear aetiology. One of the \nfactors that has been postulated to be responsible for the origin and maintenance of AF is the \nrelease of 5-hydroxytryptamine (5-HT, serotonin) from aggregating platelets in human atria \n[2,3]. 5-HT is a naturally occurring monoamine, widely distributed in the animal kingdom, \nwhich exerts complex effects throughout the body, including the gastrointestinal and \ncardiovascular systems [4,5]. 5-HT has been shown to act, via 5-HT4 receptors [6], as a positive \ninotropic, chronotropic and lusitropic agent in the human atrium [7]. 5-HT increases the L-type \nCa\n2+ \ncurrent, ICaL, using the same biochemical pathway as isoproterenol (ISO), a β-adrenoceptor \nagonist, through activation of cyclic AMP [8]. The 5-HT-induced increase in peak ICaL density \nhas been associated with a prolongation of the early plateau phase of the action potential \nduration (APD50) and with arrhythmic activity in atrial myocytes from patients in sinus rhythm \n(SR) [9]. However, it is not known if the ability of 5-HT to increase ICaL, APD50 and induce \narrhythmic activity is preserved in atrial myocytes from patients with chronic AF. Another \nfactor that may influence the arrhythmogenic potential of 5-HT is chronic β-adrenoceptor \nantagonist treatment of patients in SR prior to surgery [9-11]. The ability of 5-HT to increase \nICaL, APD50 and to cause arrhythmic activity in human atrial myocytes is increased by chronic β-\nblockade in myocytes from patients in SR [9], but the influence of chronic β-blockade on the \nelectrophysiological effects of 5-HT in myocytes from patients with AF is unknown. There has \nbeen only one previous study of 5-HT and AF, which showed a reduction of mRNA expression \nof 5-HT4 receptors, but not of β-adrenoceptors, in the fibrillating human atrium [12]. \nThe aims of this study were to investigate the effects of 5-HT with and without ISO on ICaL, \naction potential duration (APD), cellular effective refractory period (cERP) and cellular \n  \n4 \n \narrhythmic depolarisations (cADs) in atrial myocytes from patients with chronic AF, and to \ncompare these with the effects in atrial myocytes from patients in SR. We also assessed the \ninfluence of chronic treatment of patients with a β-adrenoceptor antagonist on the \nelectrophysiological actions of 5-HT in atrial myocytes from patients with and without AF. \n \n  \n5 \n \nMethods \n \n \nTissue and cell isolation \nProcedures for obtaining human tissue were approved by the local ethical committee and \nconform to the institutional guidelines. This investigation conforms to the principles outlined in \nthe Declaration of Helsinki [13]. Samples of the right atrial appendage were obtained from 81 \nconsenting patients undergoing cardiac surgery; 66 in SR and 15 in chronic AF. Cardiac rhythm \nwas determined from the pre-operative electrocardiogram, and duration of AF was confirmed \nfrom the patients’ medical records. Atrial myocytes were isolated enzymatically as described \npreviously [9].  \n \n \nElectrical recording techniques \nThe whole-cell perforated patch-clamp technique was used to record ICaL, APD, cERP and cADs \nas described before [9]. Cells were superfused at 37\no\nC with a physiological solution containing \n(mM): NaCl (130), KCl (4), CaCl2 (2), MgCl2 (1), glucose (10), HEPES (10), pH 7.4. To record \nICaL, a pipette solution containing (mM): CsCl (30), HEPES (5), MgCl2 (1), Cs methanesulfonic \nacid (100), NaCl (5), nystatin (0.18) was used. To record action potentials, a pipette solution \ncontaining (mM): KCl (30), HEPES (5), MgCl2 (1), K methanesulfonic acid (100), NaCl (5), \nnystatin (0.18) was used. Using these solutions, a liquid junction potential of +5.0±0.2 mV \n(n=6) was measured (bath relative to pipette) and was compensated for prior to seal formation. \nThe series resistance in cells from patients with and without AF was 9.5±0.3 MΩ (n=99 cells) \nand 10.4±0.2 MΩ (n=352 cells), with a mean cell capacity of 92±2 pF and 78±1 pF (p<0.05), \nrespectively. Capacitative transients were compensated electronically from the recordings, and \n  \n6 \n \nthe voltage drop across the series resistance was also compensated (68-80%). The software \nprogram WinWCP (J. Dempster, University of Strathclyde, UK) was used to stimulate and \nrecord electrical activity.  \n \n \nExperimental protocols \nThe voltage-dependency of ICaL was measured from a holding potential of -40 mV, with pulses \nof 250 ms duration at 0.33 Hz increasing in steps of 10 mV, up to +40 mV. The time-dependent \neffect of drugs was measured on peak ICaL with depolarising pulses from -40 to +10 mV (0.2 \nHz). Actions potentials were stimulated at the physiological rate of 75 beats\/min (bpm) using 5 \nms current pulses of 1.2x threshold strength, after current clamping resting cells at -80 mV, and \nkeeping the holding current (<150 pA) constant thereafter throughout all recording protocols in \neach cell. The holding current density (pA\/pF) was found not to be significantly different \nbetween cells from patients in SR and AF, with or without prior treatment with a β-adrenoceptor \nantagonist. The cellular ERP was measured using a standard S1-S2 stimulation protocol, with an \n8-pulse conditioning train delivered at 75 bpm, and with S1 and S2 pulses of equal magnitude. \nThe S1-S2 interval was shortened in 10 ms steps, and the cERP was defined as the longest S1-S2 \ninterval which failed to elicit an S2 action potential of amplitude >80% of the preceding S1 \naction potential. The APD was calculated as the interval between the action potential upstroke \nand repolarisation to the level of 50% (APD50) and 90% (APD90) of the upstroke amplitude. ICaL \nand\/or action potentials and the cERP were recorded before, and 90 s after, drug additions and \nagain 180 s after removal of drugs. The spontaneous development of cellular arrhythmic \ndepolarisations was recorded during the measurement of the cERP protocol. Cellular ADs were \ndefined as any transient depolarisation during phase 3 or a transient depolarisation of >3mV \nduring phase 4. \n  \n7 \n \nData analysis and statistics \nCells were excluded from analysis if either the APD50 or peak ICaL decreased irreversibly during \nthe protocol. Concentration-response data for the effect of 5-HT on peak ICaL were fitted \niteratively (Graphpad Prism) using a variable slope sigmoidal concentration-response curve. \nTime-dependent inactivation of peak ICaL was fitted by a bioexponential function [21]. All data \nhave been analysed using cell means, except when stated that patient means were used. Mean \n±standard error of the mean (SEM) values were compared using paired or unpaired Student’s t-\ntest, with p<0.05 regarded as statistically significant. A Fisher’s exact test was used to assess the \nincidences of arrhythmic activity between groups of cells. To permit sub-analysis within the SR \ngroup, data have been used from 27 patients in SR who were included in a previous publication \n[9]. \n \n \nDrugs \n5-HT and ISO (Sigma) were prepared as 10 mM stock solution in distilled water. Nifedipine \n(Sigma) and GR-113808 (a gift from Johnson & Johnson Pharmaceutical Research & \nDevelopment) were dissolved in dimethyl sulfoxide at 10 mM and subsequently diluted in \nphysiological solutions. \n  \n8 \n \nResults \n \n \nPatients’ clinical characteristics  \nClinical characteristics of patients in SR or with chronic AF (>6 months) are shown in Table 1. \nThose patients with prior treatment with β-adrenoceptor antagonists were treated for at least 1 \nweek. In the SR group, the majority received a cardiac selective β1-adrenoceptor antagonist, \nnamely atenolol (77% of patients), bisoprolol (17%), metoprolol (4%); 1 patient received the \ncardiac non-selective β-adrenoceptor antagonist, propranolol (2%). Those patients with AF were \ntreated with atenolol (57%), bisoprolol (29%) or with the cardiac non-selective β-adrenoceptor \nantagonist, carvedilol (14%). Patients received their routine drugs on the day of surgery. Mean \nventricular rate was 66±2 bpm in 66 patients in SR versus 69±5 bpm in 15 patients with AF \n(p>0.05). The ventricular rate was reduced in β-blocked (60±2 bpm, n=47) compared to non-β-\nblocked patients (76±3 bpm, p<0.05; n=19) from the SR group of patients. In patients with AF, \nthe ventricular rate was similar in β-blocked (72±7 bpm, n=8) compared to non-β-blocked \npatients (66±7 bpm, p>0.05; n=7).  \n \nEffects of 5-HT on ICaL and influence of chronic AF \nThe density of basal peak ICaL was smaller in cells from patients with AF (-3.0±0.2 pA\/pF; n=50 \ncells, 14 patients) than in cells from those in SR (-5.4±0.3 pA\/pF, p<0.05; 178 cells, 58 \npatients). Within the AF group of patients, no significant difference was found in basal ICaL \nbetween patients who had (-2.9±0.2 pA\/pF; n=9) and who had not (-3.2±0.3 pa\/pF; n=5) \nundergone mitral valve replacement (MVR) surgery. Examples of original ICaL recordings from \na cell from a patient in SR or with AF are shown in Figure 1 in the absence (upper panel) or in \nthe presence (lower panel) of 5-HT (10 µM). The 5-HT-induced increase in the mean magnitude \n  \n9 \n \nof ICaL in cells from patients with and without AF is shown in Figure 1 (inset). This increase in \nICaL occurred without any change in its voltage dependency, and was reversible on washout of 5-\nHT. \nThe concentration-response curves of the effect of 5-HT on peak ICaL density (pA\/pF) obtained \nin cells from patients with and without AF, are shown in Figure 2A. 5-HT (0.001-10 µM) \nelicited a concentration-dependent increase in the amplitude of peak ICaL, with a maximum \nresponse (Emax) equal to an increase of 187±2% above control in cells from patients with AF. \nThis was significantly less than that produced by 5-HT in cells from patients in SR \n(Emax=260±7%; p<0.05; Figure 2B). In addition, the concentration of 5-HT producing half-\nmaximal response (expressed as logEC50) was significantly higher in cells from patients with \nAF (-6.35±0.02) than in cells from those in SR (-6.84±0.17; p<0.05), indicating a reduced \npotency of 5-HT (Figure 2C). The Hill coefficient, a measure of cooperativity of the agonist \nwith the receptor, was 0.68±0.02 in cells from patients with AF, not significantly different than \nin cells from those in SR (0.66±0.14). A higher concentration of 5-HT (100 µM) caused a \nsignificantly smaller ICaL response in comparison to the 10 µM 5-HT in all cells studied, with \nand without AF (not shown). The 5-HT4 antagonist GR-113808 at 1 µM blocked the 5-HT-\ninduced increase of peak ICaL in cells from patients in SR (n=4 cells, 2 patients) or with AF (n=4 \ncells, 2 patients). Basal peak ICaL was abolished by the Ca\n2+\n channel blocker nifedipine at 10 µM \nin cells from patients in SR (3 cells, 2 patients) or with AF (3 cells, 2 patients).  \n \n \n  \n10 \n \nEffects of 5-HT on ICaL and influence of chronic β-blockade \nChronic β-blockade did not significantly affect basal peak ICaL in cells from patients in SR (-\n5.5±0.3 vs -5.0±0.5 pA\/pF; n=137 cells from 41 β-blocked patients and n=41 cells from 17 non \nβ-blocked patients, respectively) or with AF (-3.2±0.3 vs -2.9±0.3 pA\/pF; n=24 cells from 7 β-\nblocked patients and n=26 cells from 7 non β-blocked patients). The influence of chronic \ntreatment of patients with a β-adrenoceptor antagonist on the concentration-response curves of \nthe effect of 5-HT on peak ICaL obtained in cells from patients with and without AF is shown in \nFigure 3A. The Emax of the increase in ICaL by 5-HT was greater in cells from β-blocked patients \ncompared with non β-blocked patients in the AF group (205±4% vs 158±1%; p<0.05) and SR \ngroups (282±14% vs 216±4%; p<0.05; Figure 3B), respectively. Neither the potency (Figure \n3C) nor the nH of the 5-HT concentration-response curve were affected by chronic treatment of \npatients with a β-adrenoceptor antagonist with and without AF. Similar increases in Emax by 5-\nHT were obtained when the comparisons were made of patient means, from β-blocked and non \nβ-blocked patients in AF (234±5% vs 171±2%; p<0.05) or SR (316±17% vs 231±4%; p<0.05), \nrespectively. \n \n \nEffects of 5-HT, with and without ISO, on ICaL, and influence of chronic AF \nIn subsets of cells from patients with or without AF, the application of a maximal concentration \nof 5-HT (10 µM) was followed by the co-application of a maximal concentration of ISO (1 \nµM), in order to assess the ability of β-adrenoceptors to increase peak ICaL after saturation of 5-\nHT4 receptors. Figures 4A and 4B show examples of this protocol, from a cell from a patient in \nSR or with AF, respectively. 5-HT produced an increase in peak ICaL that was significantly \ngreater in cells from patients in SR than that in cells from patients with AF (232±33 vs \n115±21% above control; p<0.05; Figure 4C). Subsequent co-application of ISO further \n  \n11 \n \nincreased peak ICaL in both groups, but by a relatively greater increase in cells from patients \nwith AF (256±94% greater than with 5-HT alone) than in cells from patients in SR (22±6% \ngreater than with 5-HT; p<0.05). Although the absolute ICaL density in the presence of 5-HT \nwith or without ISO was significantly less in cells from patients with AF than that in cells from \npatients in SR (Figure 4C), the relative increase with ISO (to 273±38% above control, p<0.05, \nwith SR; and to 324±56% above control, p<0.05, with AF) was not significantly different \nbetween the groups (p>0.05). Following washout of 5-HT and ISO, the subsequent application \nof ISO alone increased ICaL, in a similar manner to the co-application of ISO with 5-HT, in both \ngroups (Figure 4C). \nIn the same set of cells, we analysed the kinetics properties of the time-dependent inactivation \nof basal and stimulated peak ICaL (Table 2). The fast (τ1) and the slow (τ2) inactivation time \nconstants were increased in cells from patients with AF compared to cells from patients in SR. \n5-HT had no significant effect on τ1 and τ2 in cells from patients with and without AF. \nHowever, their respective fractions A1 and A2 were altered by shifting the ICaL inactivation from \nthe fast to the slow phase. Co-application of 5-HT with ISO decreased τ1, but not τ2, in both \ngroup of cells, and this was associated with a reduced A1 and an increased A2. \n \n \nEffects of 5-HT on APD characteristics and influence of chronic AF  \nThe basal APD50 was longer in cells from patients with AF (40±3 ms; n=37 cells, 14 patients) \ncompared to cells from patients in SR (17±2 ms, p<0.05; n=58 cells, 24 patients). By contrast, \nthe APD90 was significantly shortened in cells from patients with AF (203±8 ms) compared to \ncells from patients in SR (239±11 ms; p<0.05). Within the AF group of patients, no significant \ndifferences were found in basal APD characteristics between patients who had (n=5) and who \nhad not (n=9) undergone MVR surgery. Figure 5A shows original traces of action potential \n  \n12 \n \nrecordings illustrating the effects of 5-HT in a cell from a patient in SR (left panel) or with \nAF (right panel), both treated with a β-adrenoceptor antagonist. In these examples, 5-HT (10 \nµM) caused a prolongation of the APD50, without affecting the late repolarisation and the cERP. \nMean data demonstrated that the 5-HT-induced prolongation of the APD50 in the AF group was \nsignificantly smaller than that in the SR group (Figure 5B; p<0.05). This effect was fully \nreversible after 3 min washout. There was no significant effect of 5-HT on other action potential \nmeasurements including APD75, APD90, cERP, overshoot, amplitude and maximum upstroke \nvelocity in either the cells from patients in SR or with AF. \n \n \nEffects of 5-HT on APD characteristics and influence of chronic β-blockade \nIn cells from patients in SR, 5-HT produced a significantly greater prolongation of APD50 in \ncells from β-blocked (36±6 ms; n=37 cells, 15 patients) than non β-blocked patients (10±3 ms, \np<0.05; n=21 cells, 9 patients). By contrast, in cells from patients with AF, there was no \nsignificant difference in the 5-HT-induced prolongation of the APD50 between cells from the β-\nblocked (18±5 ms; n=25 cells, 8 patients) and non β-blocked patients (9±3 ms, p>0.05; n=12 \ncells, 7 patients). These findings were confirmed by using patient means for both β-blocked \npatients and non β-blocked patients in SR (33±6 vs 9±3 ms; p<0.05) or AF (16±4 vs 9±4 ms; \np>0.05), respectively.  \n \n \nEffects of 5-HT, with and without ISO, on APD characteristics, and influence of chronic \nAF \nIn a subset of cells, we investigated effects on action potentials of the co-application of ISO (1 \nµM) and 5-HT (10 µM), following 5-HT alone, i.e. using the same protocol described earlier for \n  \n13 \n \nICaL. Figure 6A shows examples of such effects in a cell from a patient in SR (left panel) or \nwith AF (right panel). Mean data from 10 cells (3 patients) indicated that ISO may further \nprolong APD50 in cells from patients with AF (from 60±7 to 74±9 ms; p<0.05; n= 10 cells, 3 \npatients), but not in cells from patients in SR (from 63±9 to 69±9 ms; p>0.05; n=16 cells, 5 \npatients), with no significant effects on APD75, APD90 and the cERP. GR-113808 (1 µM) \nprevented the increase induced by 5-HT (10 µM) of APD50 in cells from patients in SR (n=8 \ncells, 3 patients) or with AF (n=3 cells, 1 patient), but not that of ISO (1 µM) in cells from \npatients in SR (7 cells, 3 patients) or with AF (2 cells, 1 patients).  \n \n \nEffects of 5-HT, with and without ISO, on cADs, and influence of chronic β-blockade \nCellular arrhythmic depolarisations were not observed in any of the 37 cells from 14 patients \nwith AF to which 10 µM 5-HT was applied. In contrast, when 10 µM 5-HT was applied in 58 \ncells from 24 patients in SR, cADs, consistent with early and delayed afterdepolarisations, \noccurred in 13 of the cells studied (22%) from 9 patients (38%) (p<0.05; Fisher’s exact test). \nThese cADs in response to 5-HT were observed only in cells obtained from β-blocked patients \n(13 of 37 cells), while none were observed in cells from the non β-blocked patients (0 of 21 \ncells; p<0.05). This difference remained significant when the comparison was made by patient \nmeans (p<0.05). In a subset of cells from patients with and without AF (Figure 6B), when ISO \n(1 µM) was co-applied with 5-HT (10 µM), we observed the appearance of cADs in 15 out of \n16 cells (94%) studied from 5 patients in SR and in 3 out of 11 cells (27%) from 3 patients with \nAF. Both nifedipine and GR-113808 prevented the 5-HT-induced cADs in cells from patients in \nSR (4 cells from 2 patients and 8 cells from 3 patients, respectively). However, while GR-\n113808 did not prevent the ISO-induced cADs in cells from patients in SR (7 cells, 3 patients) \n  \n14 \n \nor with AF (2 cells, 1 patients), nifedipine did in cells from patients in SR (2 cells, 1 patient) \nor with AF (3 cells, 2 patients). \n  \n15 \n \nDiscussion  \nThis study is the first, to our knowledge, to report that AF is associated with a reduction of the \neffects of 5-HT on ICaL and APD50 in human atrial cells. This was associated with a loss of \narrhythmic activity in cells from patients previously treated with a β-adrenoceptor antagonist. \nThe pro-arrhythmic actions of 5-HT in humans have been known for a long time [14] and \nsupport for its pro-arrhythmic effects has been reported in several studies from patients in SR \n[2,9,10], but there are no reports from patients with AF. Our study supports the hypothesis that \n5-HT may play a role in initiating AF by promoting ectopic activity in patients in SR, that is \nenhanced by chronic treatment of patients with a β-adrenoceptor antagonist. However, once the \narrhythmia is maintained and the remodelling process has occurred, 5-HT has a reduced efficacy \nand potency in activating the L-type Ca\n2+\n channels. Therefore, despite the possible release of 5-\nHT in the fibrillating atria by platelets [2], its arrhythmic influence may be attenuated. This \nsuggests that the remodelling processes induced by chronic AF may involve an adaptive \nresponse including protection from these effects of 5-HT. In addition, since late repolarisation \nand cERP were unaffected by application of 5-HT in cells from patients with and without AF, it \nis unlikely that 5-HT plays a role in maintaining the arrhythmia by affecting the minimum path \nlength required for re-entry [15]. The absence of arrhythmic activity by 5-HT in cells from \npatients with AF, and the low incidence of arrhythmic activity found in cells from patients in \nSR, are in line with a lack of clinical evidence to support 5-HT as a major factor involved in \ninitiating and maintaining AF in humans [3]. Indeed, even in 5-HT-secreting tumour diseases \nlike the carcinoid syndrome, in which high plasma levels of 5-HT have been detected, the \nincidence of AF is low [2,3].  \nThe mechanisms involved in the reduction of the electrophysiological actions of 5-HT in cells \nfrom patients with AF are not clear. The involvement of the 5-HT4 receptors and the L-type \nCa\n2+\n channels in the actions of 5-HT in these cells has been established by the prevention of the \n  \n16 \n \neffects by the 5-HT4 receptor antagonist, GR-113808, or the Ca\n2+\n channel blocker, nifedipine. \nIn our study, ISO, with or without 5-HT, induced a relatively greater ICaL increase in cells from \npatients with AF compared to cells from patients in SR, suggesting that the L-type Ca\n2+\n channel \nwas not the limiting factor for the 5-HT response. The enhanced ICaL response to ISO in cells \nfrom patients with AF has been reported by others [16-18], but the effects of 5-HT have not \nbeen studied previously. A reduction of mRNA expression of 5-HT4 receptors in chronic AF has \nbeen reported [12], but other mechanisms may also contribute to the reduced effects of 5-HT in \nAF. For example, increased activity of protein phosphatases in chronic AF has been shown to be \nassociated with reduced basal and ISO-activated ICaL currents [18], and changes in protein \nphosphatases and\/or kinases with AF could contribute to the reduced efficacy of 5-HT on ICaL \ncurrent density. The ability of 5-HT to increase cyclic AMP and cyclic AMP-dependent protein \nkinase activity has been shown to be significantly less than that of ISO [6,19,20], although \nsimilar increases in ICaL were induced by 5-HT and ISO in atrial cells from patients in SR \n[8,19,21]. In addition, changes in the coupling of the stimulatory or inhibitory G-proteins with \n5-HT or ISO receptors may differently affect adenylate cyclase activity leading to the \nphosphorylation\/dephosphorylation of the L-type Ca\n2+\n channel [22,23]. These and other factors, \nsuch as the expression of different 5-HT4 receptor subtypes in human atrial cells that couple to \ndifferent Gs\/i proteins [24-26], may possibly reflect a physiological adaptation to limit the Ca\n2+\n \noverload associated with AF [27]. The reduced potency of 5-HT on the ICaL response with AF \nmay support altered receptor\/channel coupling, in line with the observation of a reduced potency \nof ISO on contractile responses in atrial tissue from patients with AF [28]. \nThe proarrhythmic activity induced by β-adrenoceptor agonists (e.g. isoproterenol) has been \nknown for a long time [29] and their ability to increase ICaL via activation of the cyclic AMP \ncascade has been highlighted as the main trigger to induce afterdepolarisations in human atrial \ncells [29,30]. Similarly, 5-HT, which activates the same biochemical pathway, has been \n  \n17 \n \ndemonstrated to induce pro-arrhythmic activity in atrial cells from patients in SR, particularly \nin those previously treated with β-adrenoceptor antagonists [9,10]. The reduced efficacy and \npotency of 5-HT to increase ICaL in cells from patients with AF in the present study was \nassociated with a loss of pro-arrhythmic activity by 5-HT, which may be directly linked to the \nreduced Ca\n2+\n entry [31]. ISO caused a greater increase in ICaL when compared to 5-HT in both \nthe SR and AF groups, and this was associated with a greater incidence in the occurrence of \narrhythmic activity. Similarly, it has been shown previously that the partial 5-HT4 agonist \nprucalopride, in cells from patients in SR, caused reduced Ca\n2+\n entry when compared to 5-HT, \nand did not induce arrhythmic activity, while 5-HT, in the same cells, did [32]. In addition, the \nL-type Ca\n2+\n channel blocker nifedipine prevented the appearance of 5-HT\/ISO-induced cADs, \nsuggesting that increased ICaL and cellular Ca\n2+\n overload may play a major role in inducing \ncADs in human atrial cells [9,31,32]. Further studies, for example using a combination of \nelectrophysiology and Ca\n2+\n imaging techniques, are needed to elucidate the mechanisms of the \nobserved arrhythmic activity. \nThe slowing of the time-dependent ICaL inactivation in AF is consistent with other studies in \nwhich τ1 and\/or τ2, were increased in AF [17,33], possibly reflecting an adaptation to an altered \nactivity of the SR Ca\n2+\n release channels and\/or a reduced Ca\n2+\n influx through L-type Ca\n2+\n \nchannels [34,35]. By contrast, 5-HT and ISO decreased the fast time constant (τ1) of ICaL \ninactivation in both the SR and AF groups, and shifted the fast phase to the slow phase, \nsuggesting an enhanced Ca\n2+\n-dependent inactivation probably due the increased release of Ca\n2+\n \nby ryanodine receptors during stimulation [34].  \nOne important factor that may affect 5-HT response in human atrium is prior treatment with β-\nadrenoceptor antagonists [2,9,10,36]. The present study indicated that chronic β-blockade \nincreased the effects of 5-HT on ICaL in cells from patients with and without AF. However, \nwhile chronic β-blockade potentiated the effects of 5-HT on the APD50 and arrhythmic activity \n  \n18 \n \nin cells from patients in SR, it did not in cells from patients with AF. In our study we report a \nprolonged basal APD50, together with a reduced basal APD90, in cells from patients with AF, \nconsistent with other studies [37,38], but in contrast to other reports of no change in the APD50 \n[39] or reduced APD50 with AF [33,40]. Since a maximal concentration of ISO was capable of \nfurther prolonging the APD50 during perfusion with 5-HT, the prolonged basal APD50 found \nwith AF in our study was not preventing a further increase with 5-HT. While it has been \nreported that the levels of mRNA of human atrial 5-HT4-, β1- and β2-adreno-receptors were \nunaffected by chronic β-blockade in cells from patients with and without AF [12], the \ninteraction of complex “electrophysiological” [41] and “pharmacological” [42] remodelling \nprocesses may alter the balance of outward and inward currents which determine the APD50 and \nattenuate the effect of chronic β-blockade on the ICaL responses to 5-HT.  \nIn conclusion, AF is associated with a reduced efficacy and potency of 5-HT to increase ICaL in \nhuman atrial cells. The reduced Ca\n2+\n current is associated with a reduced duration of the early \nplateau phase of the action potential and an absence of arrhythmic activity with 5-HT. The \nability of ISO to cause a relatively greater increase in ICaL than 5-HT in cells from patients with \nAF, compared with those in SR, suggests that the reduced efficacy of 5-HT observed with AF \nwas not due to reduction in L-type Ca\n2+\n channels but may involve other factors, such as reduced \ndensity of the 5-HT4 receptors or alterations of coupling mechanisms. Thus, the potentially \narrhythmogenic influence of 5-HT may be suppressed in human atrium that has been \nremodelled by AF. \n \nAcknowledgements \nWe wish to thank the cardiac surgical staff of Glasgow Royal Infirmary for providing the \nhuman tissues, and Julie Russell for technical support and for maintaining the patient database. \nThis work was supported by British Heart Foundation (Research Project: PG\/04\/084\/17400). \n  \n19 \n \nReferences \n \n[1] Working Group on Atrial Fibrillation. Atrial fibrillation: current understandings and \nresearch imperatives. The National Heart, Lung, and Blood Institute Working Group on \nAtrial Fibrillation. J Am Coll Cardiol 1993;22:1830-1834. \n[2] Kaumann AJ. Do human atrial 5-HT4 receptors mediate arrhythmias? Trends Pharmacol Sci \n1994;15:451-455. \n[3] Yusuf S, Al Saady N, Camm AJ. 5-hydroxytryptamine and atrial fibrillation: how \nsignificant is this piece in the puzzle? J Cardiovasc Electrophysiol 2003;14:209-214. \n[4] Hegde SS, Eglen RM. Peripheral 5-HT4 receptors. FASEB J 1996;10:1398-1407. \n[5] Eglen RM, Wong EH, Dumuis A, Bockaert J. Central 5-HT4 receptors. Trends Pharmacol \nSci 1995;16:391-398. \n[6] Kaumann AJ, Sanders L, Brown AM, Murray KJ, Brown MJ. A 5-hydroxytryptamine \nreceptor in human atrium. Br J Pharmacol 1990;100:879-885. \n  \n20 \n \n[7] Kaumann AJ, Sanders L, Brown AM, Murray KJ, Brown MJ. A 5-HT4-like receptor in \nhuman right atrium. Naunyn Schmiedebergs Arch Pharmacol 1991;344:150-159. \n[8] Ouadid H, Seguin J, Dumuis A, Bockaert J, Nargeot J. Serotonin increases calcium current \nin human atrial myocytes via the newly described 5-hydroxytryptamine4 receptors. Mol \nPharmacol 1992;41:346-351. \n[9] Pau D, Workman AJ, Kane KA, Rankin AC. Electrophysiological effects of 5-\nhydroxytryptamine on isolated human atrial myocytes, and the influence of chronic β-\nadrenoceptor blockade. Br J Pharmacol 2003;140:1434-1441. \n[10] Sanders L, Lynham JA, Bond B, del Monte F, Harding SE, Kaumann AJ. Sensitization \nof human atrial 5-HT4 receptors by chronic β-blocker treatment. Circulation 1995;92:2526-\n2539. \n[11] Kaumann AJ, Sanders L. 5-Hydroxytryptamine causes rate-dependent arrhythmias \nthrough 5-HT4 receptors in human atrium: facilitation by chronic β-adrenoceptor blockade. \nNaunyn Schmiedebergs Arch Pharmacol 1994;349:331-337. \n  \n21 \n \n[12] Grammer JB, Zeng X, Bosch RF, Kuhlkamp V. Atrial L-type Ca\n2+\n-channel, β-\nadrenoreceptor, and 5-hydroxytryptamine type 4 receptor mRNAs in human atrial \nfibrillation. Basic Res Cardiol 2001;96:82-90. \n[13] World Medical Association. World Medical Association Declaration of Helsinki. \nRecommendations guiding physicians in biomedical research involving human subjects. \nCardiovasc Res 1997;35:2-3. \n[14] LeMessurier DH, Schwartz CJ, Whelan RF. Cardiovascular effects of intravenous \ninfusions of 5-hydroxytryptamine in man. Br J Pharmacol 1959;14:246-250. \n[15] Moe GK. Evidence for reentry as a mechanism of cardiac arrhythmias. Rev Physiol \nBiochem Pharmacol 1975;72:55-81.:55-81. \n[16] Van Wagoner DR, Pond AL, Lamorgese M, Rossie SS, McCarthy PM, Nerbonne JM. \nAtrial L-type Ca\n2+\n currents and human atrial fibrillation. Circ Res 1999;85:428-436. \n[17] Skasa M, Jungling E, Picht E, Schondube F, Luckhoff A. L-type calcium currents in \natrial myocytes from patients with persistent and non-persistent atrial fibrillation. Basic Res \nCardiol 2001;96:151-159. \n  \n22 \n \n[18] Christ T, Boknik P, Wohrl S, Wettwer E, Graf EM, Bosch RF, Knaut M, Schmitz W, \nRavens U, Dobrev D. L-type Ca\n2+\n current downregulation in chronic human atrial \nfibrillation is associated with increased activity of protein phosphatases. Circulation \n2004;110:2651-2657. \n[19] Di Scala E, Findlay I, Rose S, Aupart M, Argibay J, Cosnay P, Bozon V. High \nefficiency activation of L-type Ca\n2+\n current by 5-HT in human atrial myocytes. Receptors \nChannels 2004;10:159-165. \n[20] Zerkowski HR, Broede A, Kunde K, Hillemann S, Schafer E, Vogelsang M, Michel \nMC, Brodde OE. Comparison of the positive inotropic effects of serotonin, histamine, \nangiotensin II, endothelin and isoprenaline in the isolated human right atrium. Naunyn \nSchmiedebergs Arch Pharmacol 1993;347:347-352. \n[21] Jahnel U, Rupp J, Ertl R, Nawrath H. Positive inotropic response to 5-HT in human \natrial but not in ventricular heart muscle. Naunyn Schmiedebergs Arch Pharmacol \n1992;346:482-485. \n[22] Kilts JD, Gerhardt MA, Richardson MD, Sreeram G, Mackensen GB, Grocott HP, \nWhite WD, Davis RD, Newman MF, Reves JG, Schwinn DA, Kwatra MM. β-adrenergic \n  \n23 \n \nand several other G protein-coupled receptors in human atrial membranes activate both \nGs and Gi. Circ Res 2000;87:705-709. \n[23] Lonardo G, Cerbai E, Casini S, Giunti G, Bonacchi M, Battaglia F, Fiorani B, Stefano \nPL, Sani G, Mugelli A. Pharmacological modulation of the hyperpolarization-activated \ncurrent If in human atrial myocytes: focus on G protein-coupled receptors. J Mol Cell \nCardiol 2005;38:453-460. \n[24] Castro L, Mialet-Perez J, Guillemeau A, Stillitano F, Zolk O, Eschenhagen T, \nLezoualc'h F, Bochet P, Fischmeister R. Differential functional effects of two 5-HT4 \nreceptor isoforms in adult cardiomyocytes. J Mol Cell Cardiol 2005;39:335-344. \n[25] Pindon A, Van Hecke G, Van Gompel P, Lesage AS, Leysen JE, Jurzak M. Differences \nin signal transduction of two 5-HT4 receptor splice variants: compound specificity and dual \ncoupling with Gαs- and Gαi\/o-proteins. Mol Pharmacol 2002;61:85-96. \n[26] Brattelid T, Kvingedal AM, Krobert KA, Andressen KW, Bach T, Hystad ME, \nKaumann AJ, Levy FO. Cloning, pharmacological characterisation and tissue distribution of \na novel 5-HT4 receptor splice variant, 5-HT4i. Naunyn Schmiedebergs Arch Pharmacol \n2004;369:616-628. \n  \n24 \n \n[27] Van Wagoner DR. Electrophysiological remodeling in human atrial fibrillation. \nPacing Clin Electrophysiol 2003;26:1572-1575. \n[28] Schotten U, Ausma J, Stellbrink C, Sabatschus I, Vogel M, Frechen D, Schoendube F, \nHanrath P, Allessie MA. Cellular mechanisms of depressed atrial contractility in patients \nwith chronic atrial fibrillation. Circulation 2001;103:691-698. \n[29] Zicha S, Tsuji Y, Shiroshita-Takeshita A, Nattel S. Beta-blockers as antiarrhythmic \nagents. Handb Exp Pharmacol 2006;235-266. \n[30] Redpath CJ, Rankin AC, Kane KA, Workman AJ. Anti-adrenergic effects of endothelin \non human atrial action potentials are potentially anti-arrhythmic. J Mol Cell Cardiol \n2006;40:717-724. \n[31] Levy MN. Role of calcium in arrhythmogenesis. Circulation 1989;80:IV23-IV30. \n[32] Pau D, Workman AJ, Kane KA, Rankin AC. Electrophysiological effects of \nprucalopride, a novel enterokinetic agent, on isolated atrial myocytes from patients treated \nwith β-adrenoceptor antagonists. J Pharmacol Exp Ther 2005;313:146-153. \n  \n25 \n \n[33] Bosch RF, Zeng X, Grammer JB, Popovic K, Mewis C, Kuhlkamp V. Ionic \nmechanisms of electrical remodeling in human atrial fibrillation. Cardiovasc Res \n1999;44:121-131. \n[34] Sun H, Leblanc N, Nattel S. Mechanisms of inactivation of L-type calcium channels in \nhuman atrial myocytes. Am J Physiol 1997;272:H1625-H1635. \n[35] Dobrev D. Electrical remodeling in atrial fibrillation. Herz 2006;31:108-112. \n[36] Wangemann T, Giessler C, Willmy-Matthes P, Silber RE, Brodde OE. The indirect \nnegative inotropic effect of carbachol in β1-adrenoceptor antagonist-treated human right \natria. Eur J Pharmacol 2003;458:163-170. \n[37] Wettwer E, Hala O, Christ T, Heubach JF, Dobrev D, Knaut M, Varro A, Ravens U. \nRole of IKur in controlling action potential shape and contractility in the human atrium: \ninfluence of chronic atrial fibrillation. Circulation 2004;110:2299-2306. \n[38] Dobrev D, Graf E, Wettwer E, Himmel HM, Hala O, Doerfel C, Christ T, Schuler S, \nRavens U. Molecular basis of downregulation of G-protein-coupled inward rectifying K\n+\n \ncurrent (IK,ACh) in chronic human atrial fibrillation: decrease in GIRK4 mRNA correlates \n  \n26 \n \nwith reduced IK,ACh and muscarinic receptor-mediated shortening of action potentials. \nCirculation 2001;104:2551-2557. \n[39] Workman AJ, Kane KA, Rankin AC. The contribution of ionic currents to changes in \nrefractoriness of human atrial myocytes associated with chronic atrial fibrillation. \nCardiovasc Res 2001;52:226-235. \n[40] Van Wagoner DR, Nerbonne JM. Molecular basis of electrical remodeling in atrial \nfibrillation. J Mol Cell Cardiol 2000;32:1101-1117. \n[41] Brundel BJJM, Henning RH, Kampinga HH, Van Gelder IC, Crijns HJGM. Molecular \nmechanisms of remodeling in human atrial fibrillation. Cardiovasc Res 2002;54:315-324. \n[42] Workman AJ, Kane KA, Russell J.A., Norrie J., Rankin AC. Chronic beta-adrenoceptor \nblockade and human atrial cell electrophysiology: evidence of pharmacological \nremodelling. Cardiovasc Res 2003;58:518-525. \n \n  \n  \n27 \n \nLegends for Figures and Tables \n \n \nTable 1.  \nPatients’ pre-operative clinical characteristics \nValues are numbers of patients (n and % of total, respectively) with selected clinical \ncharacteristics, who were in SR or with AF on the day of surgery. Age is expressed as \nmean±SEM. CABG=coronary artery bypass graft surgery, AVR=aortic valve replacement, \nMVR=mitral valve replacement, RAA=replacement ascending aorta, ACE=angiotensin \nconverting enzyme, MI=myocardial infarction, LVD=left ventricular dysfunction. \n \n \nTable 2.  \nKinetic properties of the time-dependent inactivation of ICaL \nTime-dependent inactivation of ICaL was fitted by a bioexponential function and was defined by \nthe following equation: ICaL(t)=A1.exp(-t\/τ1)+A2.exp(-t\/τ2)+C, where A1, A2 and τ1, τ2 are the \namplitudes and decay time constants of the respective exponential components, and C is the \nsteady state amplitude. Data are expressed as mean±SEM in cells from patients in SR or with \nAF, in the absence or in the presence of 5-HT (10 µM), or co-applied with ISO (1 µM). The \nasterisks indicates p<0.05 vs SR control (*) or vs AF control (**), using paired or unpaired \nStudent’s t-tests, as appropriate. \n \n \n  \n28 \n \nFigure 1. \nEffects of 5-HT on ICaL current-voltage relationship \nAn example of original ICaL traces obtained from a cell from a patient in SR (left panel) or with \nAF (right panel), during depolarising voltage clamp pulses (250 ms) from -40 mV to +40 mV, \nin 10 mV incremental steps, from a holding potential of -40 mV, under control conditions (open \nsymbols) and in the presence of 5-HT at 10 µM (closed symbols) is shown. As an inset, current-\nvoltage relationships of ICaL expressed in terms of current density, pA\/pF, in cells from patients \nin SR (n=28 cells, 16 patients) or with AF (n=21 cells, 11 patients) are shown. Values are \nexpressed as means± SEM. \n \n \nFigure 2. \nConcentration-dependent effects of 5-HT on peak ICaL  \nComparison of the concentration-response relationship for 5-HT-induced increase in peak ICaL \ndensity (pA\/pF) in cells from patients in SR (0.001-10 µM; solid squares; n=23-52 cells, 11-31 \npatients) or with AF (0.001-10 µM; solid circles; n=26-31 cells, 12-14 patients) is shown in \nFigure 2A. Values are means ±SEM. The increase in ICaL is expressed as absolute value of \nchange compared to before the addition of 5-HT. Comparison of the calculated best-fit values \nfor the Emax (Figure 2B) and EC50 (Figure 2C) are shown between cells from patients in SR or \nwith AF. The asterisk indicates p<0.05 (unpaired Student’s t-test). \n \n \n  \n29 \n \nFigure 3. \nInfluence of chronic β-blockade on concentration-dependent effects of 5-HT on peak ICaL \nFigure 3A shows a comparison of concentration-response curves for 5-HT-induced increase of \npeak ICaL density (pA\/pF) between cells from patients in SR treated (BByes; n=15-37 cells, 7-22 \npatients) and not treated (BBno; n=8-17 cells, 4-9 patients) with a β-adrenoceptor antagonist \n(open symbols), and those from patients with AF treated (BByes; n=11-18 cells, 5-7 patients) \nand not treated (BBno; n=13-16 cells, 5-6 patients) with a β-adrenoceptor antagonist (closed \nsymbols). Comparison of the calculated best-fit values for the Emax (Figure 3B) and EC50 (Figure \n3C) are shown between groups of patients. Asterisk denotes p<0.05 (paired or unpaired \nStudent’s t-test), with NS equal to p>0.05 (not statistically significant).  \n \n \nFigure 4. \nEffects of 5-HT, with and without ISO, on peak ICaL \nAn example of the time course of change in peak ICaL density (pA\/pF) plotted at 5 s resolution, \nin response to 10 µM 5-HT, followed by the co-application of ISO at 1 µM, and the subsequent \nwashout of drugs in a cell from a patient in SR or with AF are shown in Figure 4A and 4B, \nrespectively. Inset traces (a-d) show original currents recorded at the time points labelled. \nFigure 4C shows mean (±SEM) ICaL data, in the absence (open bars), in the presence of 10 µM \n5-HT (closed bars) or co-applied with 1 µM ISO (crossed bars), measured in cells from patients \nin SR (n=27 cells, 12 patients; open circles) or with AF (n=10 cells, 6 patients; closed circles). \nSubsequent re-application of ISO alone following the washout of 5-HT+ISO is also shown for \nboth SR (n=7 cells from 5 patients) and AF (4 cells from 2 patients) groups. Asterisk denotes \np<0.05 (paired or unpaired Student’s t-test). \n \n  \n30 \n \nFigure 5. \nEffects of 5-HT on action potentials characteristics \nRepresentative examples of original action potential recordings before (open circles), in the \npresence of 10 µM 5-HT (closed circles), and then following 3 min wash (open squares), from \ncells from patients in SR (left panel) or with AF (right panel), both treated with a β-\nadrenoceptors antagonist, are shown in Figure 5A. Cells were paced at 75 bpm. Dotted lines in \nbold show the level of 50% of the action potential amplitude. The cellular ERP is indicated by \nsolid bars and was defined as described in the Methods section. Figure 5B shows the increase in \nAPD50 (ms) by 5-HT (10 µM), measured in cells from patients in SR (n= 58 cells, 24 patients) \nor with AF (n=37 cells, 14 patients). Asterisk denotes p<0.05 (unpaired Student’s t-test). \n \n \nFigure 6. \nEffects of 5-HT, with and without ISO, on arrhythmic activity \nFigure 6A shows an example of original recordings of action potentials obtained from a cell \nfrom a patient in SR (left panel) or with AF (right panel), before (open circle), in the presence of \n10 µM 5-HT (solid circle), 10 µM 5-HT+1 µM ISO (striped circle) and then following 3 min \nwashout (open square) or attenuation of ISO-induced cADs by 10 µM nifedipine (solid square). \nFigure 6B shows the incidence of cADs (%) in cells from patients with and without AF, which \noccurred during the application of 5-HT at 10 µM (closed bars) or co-applied with ISO at 1µM \n(crossed bars). Asterisks denotes p<0.05 (Fisher’s exact test). \n  \n31 \n \n Table 1. Patient’s preoperative clinical characteristics \n SR AF \n n (%) n (%) \nPatients 66  15  \nMale\/female 46\/20 70\/30 9\/6 60\/40 \nAge 65±1   69±2  \nSurgery     \nCABG 55 (83) 1 (7) \nAVR 2 (3) 3 (20) \nMVR 1 (2) 7 (47) \nAVR+MVR 0 (0) 1 (7) \nCABG+AVR 7 (11) 1 (7) \nCABG+MVR 1 (2) 1 (7) \nMVR+RAA 0 (0) 1 (7) \nDrugs     \nCa\n2+\n channel blocker 31 (47) 3 (20) \nBeta blocker 47 (71) 8 (53) \nACE inhibitor 38 (58) 7 (47) \nNitrate 42 (64) 3 (20) \nDiuretic 22 (33) 9 (60) \nLipid lowering 56 (85) 7 (47) \nDigoxin 0 (0) 9 (60) \nWarfarin 1 (2) 12 (80) \nSymptoms     \nAngina 61 (92) 8 (53) \nPalpitations 12 (18) 6 (40) \nHypertension 40 (61) 8 (53) \nHyperlipidaemia 52 (79) 5 (33) \nPrevious history     \nMI 29 (44) 1 (7) \nDiabetes 12 (18) 2 (13) \nLV function     \n -normal 48 (73) 9 (60) \n-mild-moderate LVD 17 (26) 5 (33) \n-severe LVD 1 (2) 1 (7) \n  \n32 \n \n \n \nTable 2. Kinetic properties of the time-dependent inactivation of ICaL \n \n \n τ1 (ms) τ2 (ms) A1 (%) A2 (%) \nSR Control 6.2±0.5 41±4 72±2 28±2 \nSR 5-HT 5.7±0.5 40±2 66±2* 34±2* \nSR 5-HT+ISO 5.5±0.4* 41±2 60±3* 40±3* \nSR Wash 7.8±0.9 52±3 71±2 29±2 \nAF Control 14.7±1.7* 69±11* 80±4 20±4 \nAF 5-HT 12.4±2.6 71±14 74±3** 26±3** \nAF 5-HT+ISO 9.9±1.8** 65±12 62±7** 38±7** \nAF Wash 16.9±3.3 85±12 77±3 23±3 \n  \n33 \n \n \n \nFigure 1. \nSR \n200 pA \n20 ms \nAF \n \n-40 -30 -20 -10 0 10 20 30 40\n-15\n-10\n-5\n0\npA\/pF\nmV\nControl SR\n5-HT SR\nControl AF\n5-HT AF\n- 40 mV \n+ 40 mV \n  \n34 \n \n \n \n \n \n \nFigure 2. \nB. C. \nA. \n-12\n-10\n-8\n-6\n-4\n-2\n0\n*\nSR AF\nE\nm\na\nx\n(p\nA\n\/p\nF\n)\nSR AF\n-8\n-7\n-6\nE\nC\n5\n0\n (\nlo\ng\n [\n5\n-H\nT\n] \nM\n)\n*\n-9 -8 -7 -6 -5\n-12\n-10\n-8\n-6\n-4\n-2\n0\nAF\nSR\nlog[5-HT] (M)\nIn\nc\nre\na\ns\ne\n i\nn\n I\nC\na\nL\n (\np\nA\n\/p\nF\n)\n  \n35 \n \nFigure 3. \nB. C. \nA. \n-12\n-10\n-8\n-6\n-4\n-2\n0\n*\n*\n*\nSR BBno SR BByes AF BBno AF BByes\n*\nE\nm\na\nx\n(p\nA\n\/p\nF\n)\nSR BBno SR BByes AF BBno AF BByes\n-8\n-7\n-6\nNS\nNS\n*\n*\nE\nC\n5\n0\n (\nlo\ng\n [\n5\n-H\nT\n] \nM\n)\n-9 -8 -7 -6 -5\n-12\n-10\n-8\n-6\n-4\n-2\n0\nAF BByes\nAF BBno\nSR BByes\nSR BBno\nlog[5-HT] (M)\nIn\nc\nre\na\ns\ne\n i\nn\n I\nC\na\nL\n (\np\nA\n\/p\nF\n)\n  \n36 \n \nFigure 4. \nA. \nC. \nB. \n0 1 2 3 4 5 6 7 8\n-30\n-25\n-20\n-15\n-10\n-5\n0\n5-HT\nISO\nSR\nTime (min)\nI C\na\nL\n a\nm\np\nli\ntu\nd\ne\n(p\nA\n\/p\nF\n)\n500 nA \n50 ms \na \nCh.1 \nb c d \na \nb \nc \nd \n0 1 2 3 4 5 6 7 8\n-30\n-25\n-20\n-15\n-10\n-5\n0\n5-HT\nISO\nAF\nTime (min)\nI C\na\nL\n a\nm\np\nli\ntu\nd\ne\n(p\nA\n\/p\nF\n)\na \nb \nc \nd \n500 nA \n50 ms \na b c d \nCh.1 Ch.1 Ch.1  \n-30\n-25\n-20\n-15\n-10\n-5\n0\nSR AF\nControl\n5-HT\n5-HT+ISO\nISO\nWash\n* * *\n*\n*\n*\n*\n*\n*\nI C\na\nL\n a\nm\np\nli\ntu\nd\ne\n (\np\nA\n\/p\nF\n)\n  \n37 \n \n \nFigure 5. \nA. \nB. \nSR AF\n0\n10\n20\n30\n40\n*\nIn\nc\nre\na\ns\ne\n i\nn\n A\nP\nD\n5\n0\nb\ny\n 5\n-H\nT\n (\nm\ns\n)\nC h.0  \nCh.0 \n200 ms \n20 mV \nSR \n0 mV \n0 mV \n0 mV \nCh.0  \nC h.0  \nC h.0  \n200 ms \n20 mV \nAF \n0 mV \n0 mV \n0 mV \n  \n38 \n \n \n \n \nFigure 6. \nA. \nB. \n \nAF \nCh.0 \nCh.0 \nCh.0 \nCh.0 \n100 ms \n20 mV \n0 mV \n0 mV \n0 mV \n0 mV Ch.0 \nCh.0 \nCh.0 \nCh.0 \nSR \n0 mV \n0 mV \n0 mV \n0 mV \n100 ms \n20 mV \n \n0\n25\n50\n75\n100 *\n5-HT+ISO\n5-HT\nSR AF\n*\n*\n*\nIn\nc\nid\ne\nn\nc\ne\n o\nf\nc\nA\nD\ns\n (\n%\n)\n"}