{"doi":"10.1109\/TSP.2006.880338","coreId":"54132","oai":"oai:eprints.lincoln.ac.uk:2711","identifiers":["oai:eprints.lincoln.ac.uk:2711","10.1109\/TSP.2006.880338"],"title":"Design of interpolative sigma delta modulators via semi-infinite programming","authors":["Ho, Charlotte Yuk-Fan","Ling, Bingo Wing-Kuen","Reiss, Joshua D.","Liu, Yan-Qun","Teo, Kok-Lay"],"enrichments":{"references":[{"id":914067,"title":"A 16-bit 250-kHz delta-sigma demodulator and decimation filter,”","authors":[],"date":"2000","doi":"10.1109\/4.839906","raw":"Prabir C. Maulik, Mandeep S. Chadha, Wai L. Lee and Philip J. Crawley, “A 16-bit 250-kHz delta-sigma demodulator and decimation filter,” IEEE Journal of Solid-State Circuits, vol. 35, no. 4, pp. 458-467, 2000.","cites":null},{"id":917760,"title":"A dual parametrization method for convex semi-infinite programming,”","authors":[],"date":"2000","doi":null,"raw":"S. Ito, Y. Liu and K. L. Teo, “A dual parametrization method for convex semi-infinite programming,” Annals of Operations Research, vol. 98, pp. 189-213, 2000.","cites":null},{"id":913207,"title":"A fully integrated two-channel A\/D interface for the acquisition of cardiac signals in implantable pacemakers,”","authors":[],"date":"2004","doi":"10.1109\/jssc.2004.829921","raw":"Andrea Gerosa, Andrea Maniero and Andrea Neviani, “A fully integrated two-channel A\/D interface for the acquisition of cardiac signals in implantable pacemakers,” IEEE Journal of Solid-State Circuits, vol. 39, no. 7, pp. 1083-1093, 2004.","cites":null},{"id":915151,"title":"A high-level simulation and synthesis environment for ΔΣ modulators,”","authors":[],"date":"2003","doi":"10.1109\/tcad.2003.814954","raw":"Kenneth Francken and Georges G. E. Gielen, “A high-level simulation and synthesis environment for ΔΣ modulators,” IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems, vol. 22, no. 8, pp. 1049-1061, 2003.","cites":null},{"id":912940,"title":"A multiplier-free digital sinusoid generator based on sigma-delta modulation,”","authors":[],"date":"1996","doi":"10.1109\/82.494389","raw":"Clemens M. Zierhofer, “A multiplier-free digital sinusoid generator based on sigma-delta modulation,” IEEE Transactions on Circuits and Systems⎯II: Analog and Digital Signal Processing, vol. 43, no. 5, pp. 387-396, 1996.","cites":null},{"id":913395,"title":"A use of limit cycle oscillations to obtain robust analog-to-digital converters,”","authors":[],"date":"1974","doi":"10.1109\/tcom.1974.1092194","raw":"James C. Candy, “A use of limit cycle oscillations to obtain robust analog-to-digital converters,” IEEE Transactions on Communications, vol. COM-22, no. 3, pp. 298-305, 1974.","cites":null},{"id":917413,"title":"An algorithm for computing convex positively invariant sets for delta-sigma modulators,”","authors":[],"date":"1997","doi":"10.1109\/81.558440","raw":"Richard Schreier, Montgomery V. Goodson and Bo Zhang, “An algorithm for computing convex positively invariant sets for delta-sigma modulators,”  IEEE Transactions on Circuits and Systems⎯I: Fundamental Theory and Applications, vol. 44, no. 1, pp. 38-44, 1997.","cites":null},{"id":913640,"title":"An optimization approach to designing OTAs for low-voltage sigma-delta modulators,”","authors":[],"date":"2001","doi":"10.1109\/19.982965","raw":"Harri Lampinen and Olli Vainio, “An optimization approach to designing OTAs for low-voltage sigma-delta modulators,” IEEE Transactions on Instrumentation and Measurement, vol. 50, no. 6, pp. 1665-1671, 2001.","cites":null},{"id":916405,"title":"Automatic coefficients design for high-order sigma-delta modulators,”","authors":[],"date":"1999","doi":"10.1109\/82.749075","raw":"Tai-Haur Kuo and Kuan-Dar Chen and Jhy-Rong Chen, “Automatic coefficients design for high-order sigma-delta modulators,” IEEE Transactions on Circuits and Systems⎯II: Analog and Digital Signal Processing, vol. 46, no. 1, pp. 6-15, 1999.","cites":null},{"id":918261,"title":"Bingo Wing-Kuen Ling, Yan-Qun Liu, Peter Kwong-Shun Tam and Kok-Lay Teo, “Design of nonuniform near allpass complementary FIR filters via a semi-infinite programming technique,”","authors":[],"date":"2005","doi":"10.1109\/tsp.2005.849209","raw":"Charlotte Yuk-Fan Ho, Bingo Wing-Kuen Ling, Yan-Qun Liu, Peter Kwong-Shun Tam and Kok-Lay Teo, “Design of nonuniform near allpass complementary FIR filters via a semi-infinite programming technique,” IEEE Transactions on Signal Processing, vol. 53, no. 1, pp. 376-380, 2005.","cites":null},{"id":917993,"title":"Bingo Wing-Kuen Ling, Yan-Qun Liu, Peter Kwong-Shun Tam and Kok-Lay Teo, “Optimal design of nonuniform FIR transmultiplexer using semi-infinite programming,”","authors":[],"date":"2005","doi":"10.1109\/tsp.2005.849209","raw":"Charlotte Yuk-Fan Ho, Bingo Wing-Kuen Ling, Yan-Qun Liu, Peter Kwong-Shun Tam and Kok-Lay Teo, “Optimal design of nonuniform FIR transmultiplexer using semi-infinite programming,” IEEE Transactions on Signal Processing, vol. 53, no. 7, pp. 2598-2603, 2005.","cites":null},{"id":918548,"title":"Deltasigma data converters: theory, design, and simulation,","authors":[],"date":"1997","doi":"10.1109\/9780470544358","raw":"Steven R. Norsworthy, Richard Schreier and Gabor C. Temes, Deltasigma data converters: theory, design, and simulation, IEEE Press, 1997. + + -Input signal H(ω) Q Output signal Loop Filter","cites":null},{"id":916658,"title":"Design of stable IIR digital filters with equiripple passbands and peak-constrained least squares stopbands,”","authors":[],"date":"1999","doi":"10.1109\/82.803482","raw":"W. S. Lu, “Design of stable IIR digital filters with equiripple passbands and peak-constrained least squares stopbands,” IEEE Transactions on Circuits and Systems⎯II: Analog and Digital Signal Processing, vol. 46, no. 11, pp. 1421-1426, 1999.","cites":null},{"id":917161,"title":"Deterministic analysis of sigma-delta modulation for linear and non-linear signal reconstruction,”","authors":[],"date":"1997","doi":"10.1002\/(sici)1097-007x(199709\/10)25:5<369::aid-cta979>3.0.co;2-g","raw":"Nguyen T. Thao, “Deterministic analysis of sigma-delta modulation for linear and non-linear signal reconstruction,” International Journal of Circuit Theory and Applications, vol. 25, pp. 369-391, 1997.","cites":null},{"id":914812,"title":"Multistep optimal analogto-digital conversion,”","authors":[],"date":"2005","doi":null,"raw":"Daniel E. Quevedo and Graham C. Goodwin, “Multistep optimal analogto-digital conversion,” IEEE Transactions on Circuits and Systems⎯I: Regular Papers, vol. 52, no. 3, pp. 503-515, 2005.","cites":null},{"id":915574,"title":"Optimal parameters for ΔΣ modulator topologies,”","authors":[],"date":"1998","doi":"10.1109\/82.718590","raw":"Augusto Marques, Vincenzo Peluso, Michel S. Steyaert and Willy M. Sansen, “Optimal parameters for ΔΣ modulator topologies,” IEEE Transactions on Circuits and Systems⎯II: Analog and Digital Signal Processing, vol. 45, no. 9, pp. 1232-1241, 1998.","cites":null},{"id":912740,"title":"Signal processing for direct stream digital: a tutorial for digital sigma delta modulation and 1-bit digital audio processing,” Philips Research,","authors":[],"date":"2002","doi":null,"raw":"D. Reefman and E. Janssen, “Signal processing for direct stream digital: a tutorial for digital sigma delta modulation and 1-bit digital audio processing,” Philips Research, Eindhoven, White Paper, 2002.","cites":null},{"id":917661,"title":"Some remarks on the stability and performance of the noise shaper or sigma-delta modulator,”","authors":[],"date":"1988","doi":"10.1109\/26.7533","raw":"Eduard F. Stikvoort, “Some remarks on the stability and performance of the noise shaper or sigma-delta modulator,” IEEE Transactions on Communications, vol. 36, no. 10, pp. 1157-1162, 1988.","cites":null},{"id":916930,"title":"Soo-Chang Pei and Chien-Cheng Tseng, “A weighted least-squares method for the design of stable 1-D and 2-D IIR digital filters,”","authors":[],"date":"1998","doi":"10.1109\/78.651159","raw":"Wu-Sheng Lu, Soo-Chang Pei and Chien-Cheng Tseng, “A weighted least-squares method for the design of stable 1-D and 2-D IIR digital filters,” IEEE Transactions on Signal Processing, vol. 46, no. 1, pp. 1-10, 1998.","cites":null},{"id":912508,"title":"Super-audio CD: an introduction,”","authors":[],"date":"2003","doi":"10.1109\/msp.2003.1226728","raw":"Erwin Janssen and Derk Reefman, “Super-audio CD: an introduction,” IEEE Signal Processing Magazine, vol. 20, no. 4, pp. 83-90, 2003.","cites":null},{"id":913796,"title":"Systematic design exploration of delta-sigma ADCs,”","authors":[],"date":"2004","doi":"10.1145\/514028.514031","raw":"Ovidiu Bajdechi, Georges E. Gielen and Johan H. Huijsing, “Systematic design exploration of delta-sigma ADCs,” IEEE Transactions on Circuits and Systems⎯I: Regular Papers, vol. 51, no. 1, pp. 86-95, 2004.","cites":null},{"id":915940,"title":"Systematic design of doublesampling ΣΔ A\/D converters with a modified noise transfer function,”","authors":[],"date":"2004","doi":null,"raw":"Pieter Rombouts and Ludo Weyten, “Systematic design of doublesampling ΣΔ A\/D converters with a modified noise transfer function,” IEEE Transactions on Circuits and Systems⎯II: Express Briefs, vol. 51, no. 12, pp. 675-679, 2004.","cites":null},{"id":918479,"title":"The delta-sigma modulators toolbox version 6.0,","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":18452789,"title":"The delta-sigma modulators toolbox version 6.0, Analog Devices Inc.,","authors":[],"date":"2003","doi":null,"raw":"Richard Schreier, The delta-sigma modulators toolbox version 6.0, Analog Devices Inc., 1P st P Jan 2003.","cites":null},{"id":913771,"title":"Theory and applications of incremental ΔΣ converters,”","authors":[],"date":"2004","doi":"10.1109\/cicc.2006.320960","raw":"János Márkus, José Silva and Gabor C. Temes, “Theory and applications of incremental ΔΣ converters,” IEEE Transactions on Circuits and Systems⎯I: Regular Papers, vol. 51, no. 4, pp. 678-690, 2004.","cites":null},{"id":914300,"title":"Yao Xue and Charayaphan Charoensak, “Design of optimal and narrow-band Laguerre filters for sigma-delta demodulators,”","authors":[],"date":"2003","doi":"10.1109\/tcsii.2003.813588","raw":"Saman S. Abeysekera, Yao Xue and Charayaphan Charoensak, “Design of optimal and narrow-band Laguerre filters for sigma-delta demodulators,” IEEE Transactions on Circuits and Systems⎯II: Analog and Digital Signal Processing, vol. 50, no. 7, pp. 368-375, 2003.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006","abstract":"This paper considers optimized design of\\ud\ninterpolative sigma delta modulators (SDMs). The first\\ud\noptimization problem is to determine the denominator\\ud\ncoefficients. The objective of the optimization problem is to\\ud\nminimize the passband energy of the denominator of the loop\\ud\nfilter transfer function (excluding the DC poles) subject to the\\ud\ncontinuous constraint of this function defined in the frequency\\ud\ndomain. The second optimization problem is to determine the\\ud\nnumerator coefficients in which the cost function is to minimize\\ud\nthe stopband ripple energy of the loop filter subject to the\\ud\nstability condition of the noise transfer function (NTF) and signal\\ud\ntransfer function (STF). These two optimization problems are\\ud\nactually quadratic semi-infinite programming (SIP) problems.\\ud\nBy employing the dual parameterization method, global optimal\\ud\nsolutions that satisfy the corresponding continuous constraints\\ud\nare guaranteed if the filter length is long enough. The advantages\\ud\nof this formulation are the guarantee of the stability of the\\ud\ntransfer functions, applicability to design of rational IIR filters\\ud\nwithout imposing specific filter structures, and the avoidance of\\ud\niterative design of numerator and denominator coefficients. Our\\ud\nsimulation results show that this design yields a significant\\ud\nimprovement in the signal-to-noise ratio (SNR) and have a larger\\ud\nstability range, compared to the existing designs","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/54132.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2711\/1\/Design_of_Interpolative.pdf","pdfHashValue":"894000ddda021e4f1a6995fc01b462d5d315f59a","publisher":"IEEE","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:2711<\/identifier><datestamp>\n      2013-03-13T08:39:59Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48363030<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2711\/<\/dc:relation><dc:title>\n        Design of interpolative sigma delta modulators via semi-infinite programming<\/dc:title><dc:creator>\n        Ho, Charlotte Yuk-Fan<\/dc:creator><dc:creator>\n        Ling, Bingo Wing-Kuen<\/dc:creator><dc:creator>\n        Reiss, Joshua D.<\/dc:creator><dc:creator>\n        Liu, Yan-Qun<\/dc:creator><dc:creator>\n        Teo, Kok-Lay<\/dc:creator><dc:subject>\n        H600 Electronic and Electrical Engineering<\/dc:subject><dc:description>\n        This paper considers optimized design of\\ud\ninterpolative sigma delta modulators (SDMs). The first\\ud\noptimization problem is to determine the denominator\\ud\ncoefficients. The objective of the optimization problem is to\\ud\nminimize the passband energy of the denominator of the loop\\ud\nfilter transfer function (excluding the DC poles) subject to the\\ud\ncontinuous constraint of this function defined in the frequency\\ud\ndomain. The second optimization problem is to determine the\\ud\nnumerator coefficients in which the cost function is to minimize\\ud\nthe stopband ripple energy of the loop filter subject to the\\ud\nstability condition of the noise transfer function (NTF) and signal\\ud\ntransfer function (STF). These two optimization problems are\\ud\nactually quadratic semi-infinite programming (SIP) problems.\\ud\nBy employing the dual parameterization method, global optimal\\ud\nsolutions that satisfy the corresponding continuous constraints\\ud\nare guaranteed if the filter length is long enough. The advantages\\ud\nof this formulation are the guarantee of the stability of the\\ud\ntransfer functions, applicability to design of rational IIR filters\\ud\nwithout imposing specific filter structures, and the avoidance of\\ud\niterative design of numerator and denominator coefficients. Our\\ud\nsimulation results show that this design yields a significant\\ud\nimprovement in the signal-to-noise ratio (SNR) and have a larger\\ud\nstability range, compared to the existing designs.<\/dc:description><dc:publisher>\n        IEEE<\/dc:publisher><dc:date>\n        2006<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2711\/1\/Design_of_Interpolative.pdf<\/dc:identifier><dc:identifier>\n          Ho, Charlotte Yuk-Fan and Ling, Bingo Wing-Kuen and Reiss, Joshua D. and Liu, Yan-Qun and Teo, Kok-Lay  (2006) Design of interpolative sigma delta modulators via semi-infinite programming.  IEEE Transactions on Signal Processing, 54  (10).   pp. 4047-4051.  ISSN 1053-587x  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/TSP.2006.880338<\/dc:relation><dc:relation>\n        10.1109\/TSP.2006.880338<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2711\/","http:\/\/dx.doi.org\/10.1109\/TSP.2006.880338","10.1109\/TSP.2006.880338"],"year":2006,"topics":["H600 Electronic and Electrical Engineering"],"subject":["Article","PeerReviewed"],"fullText":"T-SP-03343-2005.R1 \n \nAbstract—This paper considers optimized design of \ninterpolative sigma delta modulators (SDMs). The first \noptimization problem is to determine the denominator \ncoefficients. The objective of the optimization problem is to \nminimize the passband energy of the denominator of the loop \nfilter transfer function (excluding the DC poles) subject to the \ncontinuous constraint of this function defined in the frequency \ndomain. The second optimization problem is to determine the \nnumerator coefficients in which the cost function is to minimize \nthe stopband ripple energy of the loop filter subject to the \nstability condition of the noise transfer function (NTF) and signal \ntransfer function (STF). These two optimization problems are \nactually quadratic semi-infinite programming (SIP) problems. \nBy employing the dual parameterization method, global optimal \nsolutions that satisfy the corresponding continuous constraints \nare guaranteed if the filter length is long enough. The advantages \nof this formulation are the guarantee of the stability of the \ntransfer functions, applicability to design of rational IIR filters \nwithout imposing specific filter structures, and the avoidance of \niterative design of numerator and denominator coefficients. Our \nsimulation results show that this design yields a significant \nimprovement in the signal-to-noise ratio (SNR) and have a larger \nstability range, compared to the existing designs. \n \nIndex Terms—Interpolative sigma delta modulators, noise \nshaping, stability, semi-infinite programming, dual \nparameterization. \nI. INTRODUCTION \nIGMA delta modulation is a popular form of analog-to-\ndigital (A\/D) and digital-to-analog (D\/A) conversion, and \nis applied in most commercial A\/D and D\/A systems [1]-[4]. \nThe popularity of SDMs is mainly due to their simple, \ninexpensive and robust circuit implementation, as well as \nachieving very high SNR because of their ability to perform \nnoise shaping [5]. \nThe basic operation of SDMs is to sample the input signal \nat much higher rate than the Nyquist frequency, filter the \nsignal and perform noise shaping and then quantize the output \n[5]. The block diagram of an interpolative (or feedforward) \nSDM is depicted in Figure 1. It consists of a loop filter, a low \nbit quantizer, and a negative feedback path. Oversampling of \nthe input signal and noise shaping in the loop filter is used in \norder to remove the quantization noise out of the passband, \ntypically the lowpass band [5]. \nOptimal designs have been performed based on optimizing \noperational transconductance amplifier structures [6], speed, \nresolution and A\/D complexity [7] and the ratio of peak SNR \nplus distortion ratio versus power consumption [8], etc. \nAlthough these designs have considered many practical issues, \nthe solutions obtained are not global optimal because the \noptimization problems involved are not convex. SDMs are \ntypically designed using Butterworth filter design rules [2], \nand optimal SDM designs based on comb filter [9] and \nLaguerre filter [10] structures were recently proposed. \nHowever, since some structures (such as all the poles of the \nLaguerre filters are constrained to be the same, that of the \nButterworth filters are constrained on the same circle and \nmany zeros are in the impulse response of the comb filter) are \nassumed on these filters, a better solution may be obtained if \nthese structural assumptions are relaxed. Design based on the \nfinite horizon method [11] was also proposed. However, this \nmethod is only an approximation of an infinite horizon \nmethod. Although the approximation is improved as the \nlength of window increases, the computational complexity \nincreases. Genetic algorithms have also been applied to \nperform the optimization [12]. However, the convergence of \nthe genetic algorithms is not guaranteed and the computational \ncomplexity of this method is very high. Other existing optimal \ndesigns, such as reported in [13]-[15], are obtained mainly \nbased on the simulation framework and lack of the theoretical \nsupport. \nSince computational complexity of rational IIR filters is \nusually lower than that of the FIR filters, many SDMs employ \nrational IIR filters [1]-[3]. However, since rational IIR filters \nconsist of both numerator and denominator coefficients, there \nare some challenges for designing rational IIR filters. One \nway to design rational IIR filters is first initialize a set of the \ndenominator coefficients, and then design the numerator \ncoefficients based on this set of initialized denominator \ncoefficients by using ripple energy as the cost function and \nmagnitude specification as the constraints. Then update the \ndenominator coefficients based on the obtained numerator \ncoefficients and iterate this procedure until the algorithm \nconverges. However, it is not guaranteed that the iterative \nprocedure will converge [16]. Moreover, the obtained solution \ndepends on the initialization of the denominator coefficients, \nhence only a local optimal solution is obtained. Although the \ndivergence problem can be solved via weighting the filter \ncoefficients in each iteration, the frequency characteristics of \nthe filter will depend on the weights and the result obtained \nmay be degraded [17]. Furthermore, these design methods \nDesign of Interpolative Sigma Delta Modulators \nvia a Semi-infinite Programming \nCharlotte Yuk-Fan Ho P1 P, Student Member, IEEE, Bingo Wing-Kuen LingP2 P, Joshua D. ReissP1 P, Yan-Qun \nLiu P3 P, and Kok-Lay Teo P4 P, Senior Member, IEEE \nS \nT-SP-03343-2005.R1 \n[16]-[17] assume that both the desired magnitude and phase \nresponses of the filter are known. However, sometimes it may \nbe difficult to characterize the desired phase response. This \napplies to Butterworth and Laguerre filter cases because these \nare nonlinear phase filters. Under this circumstance, the cost \nfunction based on the error energy or the absolute error \nbetween the desired and designed energy responses will \nbecome a fourth order function ( 222 )()( ωω dHH − ) or a \nnonsmooth function ( 22 )()( ωω dHH − ), ( )(ωH  and )(ωdH  \ndenotes the designed and desired frequency response, \nrespectively). Nevertheless, these problems are not convex. \nThe major issues of designing SDMs are to achieve high \nSNR with the guarantee of the boundedness of state variables \n[2], [10]. Since the SDMs consist of a quantizer, which is a \nnonlinear component, there is no simple relationship among \nthe SNR [18], maximum bound of the input signal [19] and \nthe filter parameters, particular when the filter order is high. \nHence, it is typical to achieve high SNR by achieving good \nresponses of both STF and NTF [10], and to achieve the \nboundedness of the state variables by achieving the stability \nconditions of STF and NTF [20]. The objective of this paper \nis to formulate an SDM design problem as optimization \nproblems based on the characteristics of the STF and NTF, the \nstopband characteristics of loop filters and the stability \nconditions of the STF and NTF. In order to achieve the \nstability conditions, the sum of the numerator and \ndenominator polynomials of the loop filter transfer function \nhas to be on the right hand side of the complex plane for all \nfrequencies [16]-[17]. \nSince the noise shaping characteristics, as well as the filter \ncharacteristics, are defined in the frequency domain, all the \nconstraints are continuous. Hence, the optimization problems \nare actually quadratic SIP problems. Since the solution is \nrequired to satisfy the constraint for all frequencies, simple \nmethods for solving finite number of discrete constraint \nproblems do not apply. The most common methods for \nsolving SIP problems are discretization methods, local \nreduction methods, dual exchange methods, nondifferentiable \noptimization approaches and interior point methods [21]. For \nthe discretization methods, it is not guaranteed that the \ncontinuous constraints are satisfied among the discretized \npoints. Although the difference between the exact upper \nbound of discretized constraints and that of the corresponding \ncontinuous constraints vanishes as the number of grid points \nincreases, the computational complexity increases. For the \nlocal reduction methods, they require a good initial guess of a \nsolution sufficiently close to the optimal solution in order to \nensure its local convergence. For the dual exchange methods, \nthey may have numerical instabilities. For the \nnondifferentiable optimization approaches, they are not \nefficient to solve smooth problems. For the interior point \nmethods, they are not applicable if the number of constraints \ntends to infinity. To solve SIP problems, the dual \nparameterization method [21] is applied. It is found that this \nmethod is very efficient and effective for designing FIR filters \n[22]-[23]. However, the problems formulated in [22]-[23] \nonly involve linear continuous constraints and the filters are \nFIR. In this paper, an IIR filter is designed and the constraint \nis a quadratic continuous function. \nThe dual parameterization method is to parameterize the \nmeasure in the dual problems so that it transforms the SIP \nproblems into equivalent finite dimensional nonlinear \nprogramming problems via sequences of regular convex \nprograms. The basic working principle of the dual \nparameterization method is as follows: Since the constraint \nfunctions are continuous with respect to their index \nparameters and the index set is compact Hausdorff [21], the \nconstraint functions can be redefined as an operator whose \nrange is the Banach space consisting of continuous functions \ndefined on the index set and equipped with the uniform norm. \nThe order in the range space is given by a cone consisting of \nall nonnegative functions on the index set. The assumption of \nthe dual parameterization method is the existence of a solution \nthat strictly satisfies the continuous constraints. This condition \nis also known as the Slater’s condition. It is worth noting that \nthe Slater’s condition can be satisfied if the filter length is \nlong enough. Once the Slater’s condition is satisfied, the \nKarush-Kuhn-Tucker (KKT) conditions [21] would be \nsatisfied, which guarantees a necessary optimality condition \nfor such a cone-constrained nonlinear programming problem, \nwhere the Lagrange multiplier is defined as a regular Borel \nmeasure [21] on the index set. As a result, the set of \nmultipliers satisfying the KKT condition necessarily includes \na measure with finite support unless it is empty. Hence, any \nconstraint qualification ensures the existence of such a \ndiscrete measure, which is also called the Haar measure. On \nthe other hand, strong duality holds for convex programming \nunder Slater’s constraint qualification. Hence, the \ncorresponding dual problem for SIP can then be formulated in \nthe space of finite signed regular Borel measures on the index \nset. The local KKT theory and the global duality theory are \nnaturally related through the fact that the set of multipliers \nsatisfying the KKT condition coincides with the set of \nsolutions to the dual problem, which leads to the consequence \nthat the set of dual solutions always includes a measure with \nfinite support under the Slater condition. Hence, the dual \nparameterization method is guaranteed to obtain a global \noptimal solution that satisfies the continuous constraint if the \nfilter length is long enough. \nFor the implementation of the dual parameterization \nmethod, first initialize a sequence of index set, then compute a \nlocal optimal solution by solving a finite dimensional \nnonlinear programming problem. Finally, compute the global \noptimal solution via a local search for the finite dual problem. \nFor the details of the theory and the implementation of the \ndual parameterization method, it can be found in [21]. \nAccording to the simulations, the SDM produces a higher \nSNR and have a higher stability range compared to the \nexisting designs. The outline of this paper is as follows. The \nproblem formulation is presented in Section II. The simulation \nT-SP-03343-2005.R1 \nresults are shown in Section III. Finally, a conclusion is \nsummarized in Section IV. \nII. PROBLEM FORMULATION \nFor practical reasons, it is easier to realize the SDMs if all \nthe filter coefficients are real and the transfer function of loop \nfilters is rational, causal, and with a unit sample delay in the \nnumerator [1]. Moreover, since we only consider the lowpass \nSDMs [1], there is usually at least one DC poles in the transfer \nfunction of the loop filters. The frequency response of the \nloop filters is assumed to be as follows: \n( ) ⎟⎠⎞⎜⎝⎛ +−\n=\n∑\n∑\n=\n−−\n=\n−−\nN\nn\njn\nn\nrj\nM\nm\njm\nm\nj\neae\nebe\nH\n1\n0\n11\n)(\nωω\nωω\nω , (1) \nwhere M  and N  are the numbers of roots of the polynomial \nof ωje−  in the numerator and denominator of the transfer \nfunction of the loop filter (excluding the DC poles and pure \ndelay elements), respectively, r  is the number of DC poles, \nmn ba ,  for Nn ,,2,1 L=  and Mm ,,1,0 L=  are the filter \ncoefficients. In our consideration, ℜ∈mn ba , , 1≥r  and \n1+≥+ MrN . The design problem is equivalent to finding an \nappropriate set of filter coefficients na  and mb . However, our \ndesign method can still be applied to the cases when the IIR \nfilter is not causal or there is no DC pole in the transfer \nfunction. \nBy grouping the filter coefficients in the numerator and \ndenominator as \n[ ]TMb bb ,,0 L≡x  and [ ]TNa aa ,,1 L≡x , (2) \nrespectively, where the superscript T  denotes the transpose, \nand defining [ ]TjMjM ee ωωω −−≡ ,,,1)( Lη  (3) \nand [ ]TjNjjN eee ωωωω −−−≡ ,,,)( 2 Lη , (4) \nthen \n( )( ) ( )( )aTNrj b\nT\nM\nj\ne\neH\nxη\nxη\n)(11\n)()( ω\nωω ω\nω\n+−= −\n−\n. (5) \nThe STF and NTF of the SDM can be expressed as \n( ) ( )( )ω\nωω\nH\nHSTF += 1\n and ( ) ( )ωω HNTF += 1\n1 , (6) \nrespectively. \nA. Determination of denominator coefficients \nDenote the passband of the loop filter as PB , which is also \nthe band of interest. For SDMs having a good SNR, the \nmagnitude of the STF should be approximately equal to 1 and \nthat of the NTF should be approximately equal to 0 for all \nfrequencies in the passband of the loop filter. This holds if \n( ) 0)(1 →+ aTN xη ω  PB∈∀ω . Hence, we can define the cost \nfunction as follows: \n( ) ( )∫ +≡\nPB\na\nT\nNaa dJ ωω 2)(1 xηx . (7) \nSince \n( ) ( ) ( ) ( )( )\n( )( ) aTNNTa a\nT\nNN\nT\nNN\nT\na\nxηηx\nxηηηηx\n)()(\n)(Im)(Im)(Re)(Re\nωω\nωωωω\n∗=\n+ , (8) \nequation (7) may be expressed as \n( ) aaTaaaTaaa pJ ++= xbxQxx 2\n1 , (9) \nwhere \n( ) ( ) ( ) ( )( ) ωωωωω d\nPB\nT\nNN\nT\nNNa ∫ +≡ )(Im)(Im)(Re)(Re2 ηηηηQ ,(10) \n( ) ωω d\nPB\nDa ∫≡ )(Re2 ηb , (11) \n∫≡\nPB\na dp ω , (12) \nand aQ  is a positive definite matrix. \nAlthough the cost function minimizes the energy of the \nfunction ( ) aTN xη )(1 ω+  over the passband of the loop filter, \nwhich reflects the error energy of the NTF and the ripple \nenergy of the STF over the passband, there may be a serious \novershoot. If this is the case, then the SNR of the SDM will be \ndegraded. To avoid this, a further constraint should be \nimposed, which bounds the function in the passband. This is \ngiven by \n( ) δω ≤+ 2)(1 aTN xη  PB∈∀ω , (13) \nwhere δ  denotes the bound. Equation (13) can further be \nrepresented as \n( ) 0)()(\n2\n1 ≤++ aaTaaaTa qxcxAx ωω  PB∈∀ω , (14) \nwhere \n( ) ( ) ( ) ( )( )TNNTNNa )(Im)(Im)(Re)(Re2)( ωωωωω ηηηηA +≡  PB∈∀ω ,(15) ( ))(Re2)( ωω Na ηc ≡  PB∈∀ω , (16) \nand \nδ−≡1aq  PB∈∀ω . (17) \nSince )(ωaA  is a positive definite matrix PB∈∀ω  and the \nconstraint is continuous, the design of the denominator \ncoefficients can be formulated as the following SIP problem: \nProblem (P B1B) \nax\nmin  ( ) aaTaaaTaaa pJ ++= xbxQxx 2\n1 , (18a) \nsubject to ( ) 0)()(\n2\n1 ≤++ aaTaaaTa qxcxAx ωω  PB∈∀ω . (18b) \nSince the constraint function is convex in ax  and continuously \ndifferentiable with respect to both ax  and ω , the SIP problem \ncan be solved by the dual parameterization method [21], \nwhich guarantees the global optimal solution and satisfies the \ncontinuous quadratic constraint if the filter length is long \nenough. \nB. Determination of numerator coefficients \n Though the characteristics of the NTF and STF are captured \nin the design, the stability of these two transfer functions and \nthe frequency characteristics of the loop filter should also be \nconsidered. Our objective is to minimize the ripple energy of \nthe loop filter in the stopband subject to the stability condition \nof the transfer functions. Let the desired magnitude response \nof the loop filter be ( )ωH~ . In order to have good frequency \nT-SP-03343-2005.R1 \ncharacteristics of the loop filter, we want to achieve \n( ) ( )ωω HH ~≈ , which implies that \n( ) ( ) ( ) ( ) 222 )(1~1)( aTNj rjbTM e He xηxη ωωω ω\nω\n+−≈ −\n−\n. (19) \nSince ax  is obtained from solving the problem P B1B, r  is known \nfrom the design specifications, and ( )ωH~  is zero in the \nstopband, the cost function can be formulated as \n( ) ( ) ωω dJ\nSB\nb\nT\nMbb ∫≡ 2)( xηx . (20) \nThe stability condition of the NTF and STF is [16]-[17] \n( ) ( ) ( )( )( ) 0)(11)(Re ≥+−+ −− aTNrjbTMj ee xηxη ωω ωω  [ ]ππω ,−∈∀ ,(21) \nwhich is equivalent to \n( ) ( ) ( )( )( ) 0)(11Re)( ≥+−+′ − aTNrjbTM e xηxη ωω ω  [ ]ππω ,−∈∀ ,(22) \nwhere \n( )[ ]TM M ωωωω 1cos,,2cos,cos)( +≡′ Lη . (23) \nHence, the optimization problem can be represented as the \nfollowing SIP problem: \nProblem (P B2B) \nbx\nmin  ( ) bbTbbbJ xQxx 2\n1= , (24a) \nsubject to 0)()( ≤+ ωω bbb cxA  [ ]ππω ,−∈∀ , (24b) \nwhere \n( ) ( ) ( ) ( )( ) ωωωωω d\nSB\nT\nMM\nT\nMMb ∫ +≡ )(Im)(Im)(Re)(Re2 ηηηηQ ,(25) \n( )TMb )()( ωω ηA ′−≡  [ ]ππω ,−∈∀ , (26) \nand ( ) ( )( )( )aTNrjb e xηc )(11Re)( ωω ω +−−≡ −  [ ]ππω ,−∈∀ . (27) \nProblem P B1 B does not depend on the numerator coefficients, so \nthe global optimal solution of problem P B1B can be obtained via \nthe dual parameterization method [21]. Since the denominator \ncoefficients are obtained from solving problem P B1B, the global \noptimal solution of problem P B2B can then be obtained similarly. \nIn this formulation, iterative design of the numerator and \ndenominator coefficients is avoided. This is advantageous \nbecause convergence of the iterative design is not guaranteed \n[16]. \nIII. SIMULATION RESULTS \nTo compare our design with the existing optimal designs, \nsimilar cost function and constraints should be used. However, \nfew of them have exactly the same cost function and \nconstraints. The most related existing design approach is the \none based on the Butterworth filter structure [10] and the one \nvia the Matlab sigma-delta toolbox [24]-[25] because these \ntwo design methods employ SNR as criterion. \nConsider a fifth order SDM with a DC pole, a pure delay in \nthe numerator of the loop filter transfer function and an \noversampling ratio of 64 , that is, 5=M  4=N , 1=r , \n⎥⎦\n⎤⎢⎣\n⎡−=\n64\n,\n64\nππ\nPB  and [ ] ⎥⎦\n⎤⎢⎣\n⎡−−=\n64\n,\n64\n\\, ππππSB . We choose this \nconfiguration because the order of SDM and its oversampling \nratio is typical of many audio applications [1]-[2]. It can be \nseen from Figure 2 that the maximum bound on \n( ) aTN xη )(1 ω+  for the design using the Matlab sigma-delta \ntoolbox [24]-[25] is 12109101.1 −× , while that of based on the \nButterworth structure [10] is 12105203.1 −× . Hence, we would \nexpect that our result should achieve the error bounded by \n1210−  for PB∈∀ω . By selecting 1210−=δ , the optimal SDM \ndesign problem can now be formulated as SIP problems as \ndiscussed in Section II and these problems can be solved via \nthe dual parameterization method [21]. According to the \nsimulation, it is found that our design can achieve the error \nbounded by 13106658.9 −× , as shown in Figure 2. It is worth \nnoting that the designs based on the Matlab sigma-delta \ntoolbox or the Butterworth filter structure have larger \nresponse values on the first lobe, while our design has larger \nvalue on the second lobe. This implies that our design has a \nhigher ability to push the noise to the higher frequency band \ncompared to previous design. \nFigure 3 shows the SNRs of our design as well as the \noptimal design via the Butterworth filter structure [10] and \nMatlab sigma-delta toolbox [24]-[25] based on the sinusoidal \ninput with input frequency equal to \n3\n2  of the passband \nbandwidth [24]-[25]. It can be seen from Figure 3 that our \ndesign achieves an average 3.7483dB improvement compared \nto that of [24]-[25] and 3.0380dB improvement compared to \nthat of [10] when these SDMs operate normally. Also, it is \nworth noting that the design via the Matlab sigma-delta \ntoolbox [24]-[25] diverges when the input sinusoidal \nmagnitude is at 67.0 , and the design via the Butterworth \nstructure diverges at 61.0 , while our design operates normally \nbefore 69.0 . Hence, our design provides a high SNR and has \na higher stability range. It is found that the magnitude of the \npoles of STF and NTF of our design are 9928.0 , 9928.0 , \n8556.0 , 8556.0  and 6143.0 , respectively, in which all are \nstrictly inside the unit circle. Hence, the transfer functions are \nstrictly stable. \nFigure 4 shows NTFs of our proposed design, as well as the \ndesign via the Matlab sigma-delta toolbox [24]-[25] and \nButterworth filter structure [10] based on oversampling ratio \nat 64  and Nyquist rate at Hz1.44 k , which is widely adopted in \nthe audio applications [1]-[2]. According to the simulation \nresults, our design produces at least 9.4750dB improvement \non the passband of the loop filter compared to the design in \n[24]-[25] and 5.1113dB improvement compared to the design \nin [10], which is a significant improvement on the suppression \nof the noise on the frequency band we are interested. \nIV. CONCLUSION \nIn this paper, we have formulated SDM design problems as \nSIP problems and solved the problems via the dual \nparameterization method. The advantages of this formulation \nare the guarantee of the stability of NTF and STF if the filter \nlength is long enough, applicability to design of rational IIR \nfilters without imposing specific filter structures such as \nLaguerre filter and Butterworth filter structures, and the \navoidance of the nonconvergent iterative design of numerator \nT-SP-03343-2005.R1 \nand the denominator coefficients. Our simulation results show \nthat the proposed design yields a significant improvement in \nthe SNR and achieving a higher stability range compared to \nthe existing designs. \nACKNOWLEDGEMENT \nThe work obtained in this paper was supported by a \nresearch grant from Queen Mary, University of London and a \nresearch grant from Australian Research Council. \nREFERENCES \n[1] Erwin Janssen and Derk Reefman, “Super-audio CD: an introduction,” \nIEEE Signal Processing Magazine, vol. 20, no. 4, pp. 83-90, 2003. \n[2] D. Reefman and E. Janssen, “Signal processing for direct stream digital: \na tutorial for digital sigma delta modulation and 1-bit digital audio \nprocessing,” Philips Research, Eindhoven, White Paper, 2002. \n[3] Clemens M. Zierhofer, “A multiplier-free digital sinusoid generator \nbased on sigma-delta modulation,” IEEE Transactions on Circuits and \nSystems⎯II: Analog and Digital Signal Processing, vol. 43, no. 5, pp. \n387-396, 1996. \n[4] Andrea Gerosa, Andrea Maniero and Andrea Neviani, “A fully \nintegrated two-channel A\/D interface for the acquisition of cardiac \nsignals in implantable pacemakers,” IEEE Journal of Solid-State \nCircuits, vol. 39, no. 7, pp. 1083-1093, 2004. \n[5] James C. Candy, “A use of limit cycle oscillations to obtain robust \nanalog-to-digital converters,” IEEE Transactions on Communications, \nvol. COM-22, no. 3, pp. 298-305, 1974. \n[6] Harri Lampinen and Olli Vainio, “An optimization approach to \ndesigning OTAs for low-voltage sigma-delta modulators,” IEEE \nTransactions on Instrumentation and Measurement, vol. 50, no. 6, pp. \n1665-1671, 2001. \n[7] János Márkus, José Silva and Gabor C. Temes, “Theory and applications \nof incremental ΔΣ converters,” IEEE Transactions on Circuits and \nSystems⎯I: Regular Papers, vol. 51, no. 4, pp. 678-690, 2004. \n[8] Ovidiu Bajdechi, Georges E. Gielen and Johan H. Huijsing, \n“Systematic design exploration of delta-sigma ADCs,” IEEE \nTransactions on Circuits and Systems⎯I: Regular Papers, vol. 51, no. \n1, pp. 86-95, 2004. \n[9] Prabir C. Maulik, Mandeep S. Chadha, Wai L. Lee and Philip J. \nCrawley, “A 16-bit 250-kHz delta-sigma demodulator and decimation \nfilter,” IEEE Journal of Solid-State Circuits, vol. 35, no. 4, pp. 458-467, \n2000. \n[10] Saman S. Abeysekera, Yao Xue and Charayaphan Charoensak, “Design \nof optimal and narrow-band Laguerre filters for sigma-delta \ndemodulators,” IEEE Transactions on Circuits and Systems⎯II: Analog \nand Digital Signal Processing, vol. 50, no. 7, pp. 368-375, 2003. \n[11] Daniel E. Quevedo and Graham C. Goodwin, “Multistep optimal analog-\nto-digital conversion,” IEEE Transactions on Circuits and Systems⎯I: \nRegular Papers, vol. 52, no. 3, pp. 503-515, 2005. \n[12] Kenneth Francken and Georges G. E. Gielen, “A high-level simulation \nand synthesis environment for ΔΣ modulators,” IEEE Transactions on \nComputer-Aided Design of Integrated Circuits and Systems, vol. 22, no. \n8, pp. 1049-1061, 2003. \n[13] Augusto Marques, Vincenzo Peluso, Michel S. Steyaert and Willy M. \nSansen, “Optimal parameters for ΔΣ modulator topologies,” IEEE \nTransactions on Circuits and Systems⎯II: Analog and Digital Signal \nProcessing, vol. 45, no. 9, pp. 1232-1241, 1998. \n[14] Pieter Rombouts and Ludo Weyten, “Systematic design of double-\nsampling ΣΔ A\/D converters with a modified noise transfer function,” \nIEEE Transactions on Circuits and Systems⎯II: Express Briefs, vol. 51, \nno. 12, pp. 675-679, 2004. \n[15] Tai-Haur Kuo and Kuan-Dar Chen and Jhy-Rong Chen, “Automatic \ncoefficients design for high-order sigma-delta modulators,” IEEE \nTransactions on Circuits and Systems⎯II: Analog and Digital Signal \nProcessing, vol. 46, no. 1, pp. 6-15, 1999. \n[16] W. S. Lu, “Design of stable IIR digital filters with equiripple passbands \nand peak-constrained least squares stopbands,” IEEE Transactions on \nCircuits and Systems⎯II: Analog and Digital Signal Processing, vol. \n46, no. 11, pp. 1421-1426, 1999. \n[17] Wu-Sheng Lu, Soo-Chang Pei and Chien-Cheng Tseng, “A weighted \nleast-squares method for the design of stable 1-D and 2-D IIR digital \nfilters,” IEEE Transactions on Signal Processing, vol. 46, no. 1, pp. 1-\n10, 1998. \n[18] Nguyen T. Thao, “Deterministic analysis of sigma-delta modulation for \nlinear and non-linear signal reconstruction,” International Journal of \nCircuit Theory and Applications, vol. 25, pp. 369-391, 1997. \n[19] Richard Schreier, Montgomery V. Goodson and Bo Zhang, “An \nalgorithm for computing convex positively invariant sets for delta-sigma \nmodulators,” IEEE Transactions on Circuits and Systems⎯I: \nFundamental Theory and Applications, vol. 44, no. 1, pp. 38-44, 1997. \n[20] Eduard F. Stikvoort, “Some remarks on the stability and performance of \nthe noise shaper or sigma-delta modulator,” IEEE Transactions on \nCommunications, vol. 36, no. 10, pp. 1157-1162, 1988. \n[21] S. Ito, Y. Liu and K. L. Teo, “A dual parametrization method for convex \nsemi-infinite programming,” Annals of Operations Research, vol. 98, pp. \n189-213, 2000. \n[22] Charlotte Yuk-Fan Ho, Bingo Wing-Kuen Ling, Yan-Qun Liu, Peter \nKwong-Shun Tam and Kok-Lay Teo, “Optimal design of nonuniform \nFIR transmultiplexer using semi-infinite programming,” IEEE \nTransactions on Signal Processing, vol. 53, no. 7, pp. 2598-2603, 2005. \n[23] Charlotte Yuk-Fan Ho, Bingo Wing-Kuen Ling, Yan-Qun Liu, Peter \nKwong-Shun Tam and Kok-Lay Teo, “Design of nonuniform near \nallpass complementary FIR filters via a semi-infinite programming \ntechnique,” IEEE Transactions on Signal Processing, vol. 53, no. 1, pp. \n376-380, 2005. \n[24] Richard Schreier, The delta-sigma modulators toolbox version 6.0, \nAnalog Devices Inc., 1 PstP Jan 2003. \n[25] Steven R. Norsworthy, Richard Schreier and Gabor C. Temes, Delta-\nsigma data converters: theory, design, and simulation, IEEE Press, 1997. \n+\n+\n-\nInput signal\nH(ω) Q Output signal\nLoop Filter\n Figure 1. Block diagram of an interpolative SDM as used for \nA\/D conversion. \n \n \nFigure 2. Magnitude responses of ( ) 2)(1 aTN xη ω+ . \n( ) 2)(1 aTN xη ω+\nT-SP-03343-2005.R1 \n \nFigure 3. SNRs. \n \nFigure 4. NTF. \n"}