{"doi":"10.1002\/fuce.200400045","coreId":"102242","oai":"oai:epubs.surrey.ac.uk:1696","identifiers":["oai:epubs.surrey.ac.uk:1696","10.1002\/fuce.200400045"],"title":"Prospects for alkaline anion-exchange membranes in low temperature fuel cells","authors":["Varcoe, John","Slade, Robert"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-04","abstract":"<p>This article introduces the radical approach of applying alkaline anion-exchange membranes (AAEMs) to meet the current challenges with regards to direct methanol fuel cells (DMFCs). A review of the literature is presented with regards to the testing of fuel cells with alkaline membranes (fuelled with hydrogen or methanol) and also to candidate alkaline anion-exchange membranes for such an application. A brief review of the directly related patent literature is also included. Current and future research challenges are identified along with potential strategies to overcome them. Finally, the advantages and challenges with the direct electrochemical oxidation of alternative fuels are discussed, along with how the application of alkaline membranes in such fuel cells may assist in improving performance and fuel efficiency.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"WILEY-V C H VERLAG GMBH","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1696<\/identifier><datestamp>\n      2017-07-28T15:34:23Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:6368656D6963616C<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1696\/<\/dc:relation><dc:title>\n        Prospects for alkaline anion-exchange membranes in low temperature fuel cells<\/dc:title><dc:creator>\n        Varcoe, John<\/dc:creator><dc:creator>\n        Slade, Robert<\/dc:creator><dc:description>\n        <p>This article introduces the radical approach of applying alkaline anion-exchange membranes (AAEMs) to meet the current challenges with regards to direct methanol fuel cells (DMFCs). A review of the literature is presented with regards to the testing of fuel cells with alkaline membranes (fuelled with hydrogen or methanol) and also to candidate alkaline anion-exchange membranes for such an application. A brief review of the directly related patent literature is also included. Current and future research challenges are identified along with potential strategies to overcome them. Finally, the advantages and challenges with the direct electrochemical oxidation of alternative fuels are discussed, along with how the application of alkaline membranes in such fuel cells may assist in improving performance and fuel efficiency.<\/p><\/dc:description><dc:publisher>\n        WILEY-V C H VERLAG GMBH<\/dc:publisher><dc:date>\n        2005-04<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1696\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Varcoe, John and Slade, Robert  (2005) Prospects for alkaline anion-exchange membranes in low temperature fuel cells   FUEL CELLS, 5 (2).  pp. 187-200.      <\/dc:identifier><dc:relation>\n        10.1002\/fuce.200400045<\/dc:relation><dc:language>\n        EN<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1696\/","10.1002\/fuce.200400045"],"year":2005,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"* Author for correspondence (j.varcoe@surrey.ac.uk)\nProspects for Alkaline Anion-Exchange Membranes in Low Temperature\nFuel Cells\nJohn R. Varcoe* and Robert C. T. Slade\nChemistry, The University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom.\nTel: +44 (1483) 682616 Fax: +44 (1483) 686851\nAbstract\nThis article introduces the radical approach of applying alkaline anion-exchange membranes\n(AAEMs) to meet the current challenges with regards to direct methanol fuel cells (DMFCs).\nA review of the literature is presented with regards to the testing of fuel cells with alkaline\nmembranes (fuelled with hydrogen or methanol) and also to candidate alkaline anion-\nexchange membranes for such an application. A brief review of the directly related patent\nliterature is also included. Current and future research challenges are identified along with\npotential strategies to overcome them. Finally, the advantages and challenges with the direct\nelectrochemical oxidation of alternative fuels are discussed, along with how the application\nof alkaline membranes in such fuel cells may assist in improving performance and fuel\nefficiency.\nKeywords\nLow temperature, Alkaline anion-exchange membrane, Direct methanol fuel cell, Polymer\nelectrolyte fuel cell.\n2Research Challenges for Direct Methanol Fuel Cells (DMFCs)\nThe hydrogen-fuelled proton-exchange membrane (PEM) fuel cell (PEMFC) is highly\ndeveloped, with good performances and power densities obtainable with low catalyst\nloadings (< 0.2 mg Pt \/ cm2 electrode area, with the platinum particles usually supported on a\ncarbon substrate) [1,2]. For example, Qi and Kaufmann achieved a high fuel cell power\ndensity of 720 mW cm-2 (current density of over 1.4 A cm-1 at a cell voltage of ~ 0.5 V) at\n75°C with Nafion®-112 membrane, and catalyst loadings of 0.12 mg cm-2 (20%wt Pt\/C) [3].\nA further example with a reduced anode catalyst loading was recently reported in the\nliterature by Gamburzev and Appleby [4]; current densities of 600 mA cm-2 were obtained at\na cell potential of 0.7 V (420 mW cm-2) with Nafion®-111 membrane (DuPont, Scheme 1), a\ncathode platinum loading of 0.2 mg cm-2 and an ultra-low anode platinum loading of 0.05 mg\ncm-2. Ultra-low catalyst loadings of 0.014 mg cm-2 have also been reported using a novel\nsputtering method [5,6]. A recent comprehensive review of PEMFC electrodes published by\nLister and McLean is recommended for further details on catalyst structures \/ preparation [7].\nHowever, PEMFCs have a low CO tolerance and so performances are more limited when the\nhydrogen is supplied from the reformation of organic fuels [8].\nThe fuel cell reactions for a PEMFC are described below (Figure 1a):\nAnode: H2 \u0001 2H+ + 2e- (Ea = 0 V vs. SHE at 1 bar, 298.15 K)\nCathode: 1\/2O2 + 2e- + 2H+ \u0001 H2O (Ec= 1.23 V vs. SHE at 1 bar, 298.15 K)\nOverall: H2 + 1\/2O2 \u0001 H2O (Ecell = 1.23 V at 1 bar, 298.15 K)\nInterest in solid polymer membrane direct methanol fuel cells (DMFCs) stems mainly from\nthe higher volumetric energy density and reversible efficiencies of methanol (CH3OH, often\n3denoted MeOH) compared with liquid hydrogen (see Table 1 [9,10]), and the relative ease of\nconversion of the current petroleum distribution networks to methanol compared with the\ncostly whole new distribution structure required for hydrogen. The relative advantages, and\ncomparisons of the costs (both fiscal and environmental) of DMFCs compared with PEMFCs\n(fuelled directly with hydrogen or indirectly fuelled via on-board reformation) are currently a\nhot source of debate in the transportation sector and have been comprehensively and recently\nreviewed [11-13].\nThe fuel cell reactions for a DMFC with proton-transport through an acid membrane are\nshown below (Figure 1a):\nAnode: CH3OH + H2O \u0001 6H+ + 6e- + CO2 (Ea = - 0.02 V vs. SHE at 1 bar, 298.15 K)\nCathode: 3\/2O2 + 6e- + 6H+ \u0001 3H2O (Ec= 1.23 V vs. SHE at 1 bar, 298.15 K)\nOverall: CH3OH + 3\/2O2 \u0001 2H2O + CO2 (Ecell = 1.21 V at 1 bar, 298.15 K)\nDMFCs producing < 500 W power and operating in the temperature range of -20 – 50°C are\nideally positioned and urgently required to act as a “disruptive technology” to replace\nbatteries in portable devices (laptops, cellular phones, PDAs, human (e.g. soldier) portable\npower packs, digital cameras, and power tools) [14,15]; the driver is the ever increasing\npower demands which, in the immediate future, will surpass levels projected to be achievable\nwith secondary battery technology (e.g. lithium ion batteries). Inconvenient power saving\nfeatures have already been introduced on some laptops, (e.g. dimming LCD screens when in\nbattery mode, which leads to visibility problems in bright light, i.e. when outdoors etc). It is\nincreasingly believed that portable DMFCs will be the first fuel cells commercially available\nto the general public; there has been a recent increase in the number of pre-commercial\nportable devices (e.g. PDAs, laptops) powered by DMFCs that have been demonstrated in the\n4press and at conferences (e.g. DMFC powered laptops announced by NEC in 2003). DMFCs\nare amenable to such applications due to the good energy density (theoretically up to 5 - 10\ntimes that of batteries) of liquid methanol [16,17]. Another benefit of using DMFCs instead\nof batteries is “instant” refuelling (also referred to as “hot-refuelling”) when utilising a plug-\nin methanol cartridge.\nThe performance obtained with the direct oxidation of methanol at the anode in a solid\npolymer DMFC is inferior compared with a PEMFC supplied with pure hydrogen. There are\nthree main reasons for this: (1) With PEMFCs the electrokinetic overpotenial is effectively\ndue solely to the oxygen reduction at the cathode (hydrogen oxidation occurring near\nreversibly). In contrast, with DMFCs the anode electrokinetics are also sluggish (as it takes 6\nelectrons to fully oxidise methanol to carbon dioxide and water). (2) The proton transport\nthrough the PEM leads to methanol molecules being transported (via electro-osmosis and\/or\ndiffusion) from the anode to the cathode. This methanol crossover leads to a mixed (reduced)\npotential at the cathode and a lowering of the overall fuel cell voltage, with a consequential\nlowering of cell efficiencies (directly proportional to the cell voltage). (3) Severe electro-\nosmosis of water from the anode to the cathode (of up to 19 H2O molecules per proton) also\noccurs with the supply of diluted methanol at the anode of a DMFC (stoichiometrically 1\nH2O molecule to 1 CH3OH is required, see Figure 1); this creates very severe flooding at the\ncathode, introducing large overpotentials due to mass transport effects.\nTraditional methods of overcoming the electrokinetic shortfalls include high, usually\nunsupported, catalyst loadings (prohibitively expensive loads of around 4 mg cm-2 are\ncommon cf. < 0.2 mg cm-2 for PEMFCs) at the anode to maximise methanol oxidation; the\nanode catalysts also commonly involve binary platinum\/ruthenium alloys because carbon\n5monoxide is a reaction intermediate which will poison platinum-only catalysts (leading to a\nsignificant lowering of cell performance over time). Another approach is to raise the DMFC\noperating temperature to > 150°C where the electrokinetics are more facile; this approach is\nfeasible with acid-doped polybenzimidazole membranes (PBI, Scheme 2) which have been\nreported to retain high proton-conductivity at high temperatures and lower membrane\nhumidification [18-20]; long term stability of these membranes is, however, still a concern,\nespecially when considering that in most reports the acid species is not attached to the\npolymer backbones. These PBI-based acid electrolytes are being commercially developed by\nCelanese Ventures GmbH (an example patent is given in reference [21])\nTo alleviate the effects of methanol crossover, thick (high resistance) PEMs (typically\nNafion(R)-117 at 7 mil {178 µm} thickness), dilute solutions of methanol (< 2 mol dm-3 in\nwater), and high loadings of unsupported platinum black (again at prohibitively expensive\nlevels of the order of 4 mg cm-2) at the cathode are used. Despite this, power performances of\n200 mW cm-2 can be obtained at cell potentials of 0.5 V with a DMFC when operated at\n120°C, a methanol concentration of 0.5 mol dm-3, catalysts loadings of > 2 mg cm-2, and back\npressures of 2 atm at the cathode [22]. Peak power performances have attained around 300\nmW cm-2 [23]. A detailed review of the current status of DMFC research and development is\ngiven by Aricò et al. [24], while a discussion of the aging mechanisms and lifetimes of\nDMFCs (and PEMFCs) has been given by Knights et al. [25].\nAs already mentioned, these DMFC power densities are well below those obtained with\nPEMFCs. There is still much research being undertaken to maximise DMFC performance by\noptimising the structure and loading (especially lowering) of platinum-based electrocatalysts\n[26]. There is also some research into alternative methanol-resistant cathode catalysts, an\n6example of which is carbon supported Pt-Fe alloys [27,28]. However, the authors of this\nreview (along with others [29,30]) firmly believe that for more substantial increases in\nDMFC performances, a more radical approach is required.\nOne innovative approach being investigated by Scott et al. (Newcastle, U.K.) is the mixed-\nreactants solid polymer DMFC [30]; this approach seeks to simplify fuel cell design by\nrelying on selective catalysts to separate the electrochemical oxidation of methanol and\nreduction of oxidant without physical separation of the fuel and oxidant; initial operation with\nunoptimised conditions has yielded performances of 50 mW cm-2 and 20 mW cm-2 at 90°C\nwith methanol\/oxygen and methanol\/air respectively. Another approach, which is the main\nsubject of this article, involves the use of alkaline anion-exchange membranes (AAEMs); this\napproach combines the advantages of PEMFCs (simple all solid-state construction), AFCs\n(facile electrokinetics) and DMFCs (high energy density of the fuel), while also minimising\ndisadvantages of each type.\nPotential Benefits and Disadvantages of the Use of Alkaline Anion-Exchange\nMembranes (AAEMs) in a DMFC.\nAlkaline fuel cells (AFCs, which in this review are considered to mean hydrogen-fuelled cells\nwith a liquid electrolyte such at KOH(aq)) are the best performing of all known fuel cells\n(AFCs, PEMFCs, and DMFCs) operable below 200°C. This is mainly due to the facile\nkinetics at the cathode as well as at the anode; cheaper non-noble metal catalysts can be used\n(such as nickel and silver [31-33]), reducing cost. McLean et al. give a recent comprehensive\nreview of alkaline fuel cell technology [34].\n7The fuel cell reactions for a traditional AFC and a hydrogen-fuelled alkaline membrane fuel\ncell (Figure 1b) are described below:\nAnode: 2H2 +4OH- \u0001 4H2O + 4e- (Ea = 0.83 V vs. SHE at 1 bar, 298.15 K)\nCathode: O2 + 2H2O +4e- \u0001 4OH- (Ec = 0.40 V vs. SHE at 1 bar, 298.15 K)\nOverall: 2H2 + 1\/O2 \u0001 2H2O (Ecell = 1.23 V at 1 bar, 298.15 K)\nOne of the main issues with traditional AFCs is that of electrolyte and electrode degradation\ncaused by the formation of carbonate\/bicarbonate (CO32-\/HCO3-) in the liquid alkaline\nelectrolyte on reaction of OH- ions with CO2 contamination in the oxidant gas stream\n[34,35,36]. This has limited the application of such fuel cell systems in which pure oxygen\ncan be supplied e.g. the fuel cells currently used on NASA’s space shuttle orbiter (there are\nplans to replace the AFCs with PEMFCs). Nevertheless, Kordesch operated an AFC-powered\ncar daily, with partial scrubbing of the air using soda lime and with replacement of the liquid\nelectrolyte every few hundred operational hours. The major cause of the degrading\nperformance on CO32-\/HCO3- formation is the precipitation of large solid metal carbonate\ncrystals (most commonly Na2CO3 or K2CO3, depending on the alkaline electrolyte used) in\nthe electrolyte-filled pores of the electrodes; these crystals not only block the pores but also\nmechanically disrupt and destroy the active layers.\nThe formation of carbonate \/ hydrogen carbonate are as below:\nCO2 +2OH- \u0001 CO32- + H2O\nCO2 + OH- \u0001 HCO3-\nMethanol produces CO2 on electro-oxidation and so CO32-\/HCO3- formation can be even\nmore of a problem when a methanol fuel cell is operated with a liquid alkaline electrolyte.\n8Methanol has been operated in alkaline fuel cells in the past. An example is a methanol fuel\ncell operating with aqueous KOH (6 mol dm-3) by Murray and Grimes [37]. Performances at\n0.3 V decreased steadily over 70 h at 60°C and 94 h at 30°C, mainly due to anode\ndegradation. A 40-cell module, with a total electrode area of 480 cm2 and operated at 49°C\nand gas pressures of up to 5 psi, produced 440 W (917 mW cm-2) at 0.4 V and a maximum\npower output of 730 W at 0.25 V with pure oxygen as oxidant. A recent short review by\nKoscher and Kordesch details past and present work involving alkaline methanol-air systems\nwith liquid caustic electrolytes and emphasises the design of effective electrode structures\n[38].\nThe fuel cell equations for the direct use of methanol with an alkaline electrolyte are (Figure\n1b):\nAnode: CH3OH +6OH- \u0001 CO2 + 5H2O + 6e- (Ea = 0.81 V vs. SHE at 1 bar, 298.15 K)\nCathode: 3\/2O2 + 3H2O +6e- \u0001 6OH- (Ec = 0.40 V vs. SHE at 1 bar, 298.15 K)\nOverall: CH3OH + 3\/2O2 \u0001 2H2O + CO2 (Ecell = 1.21 V at 1 bar, 298.15 K)\nIt is well known that methanol oxidation is more facile in alkaline media [10,39,40]. Even if\nPtRu is required due to catalyst poisoning by intermediate CO (absorbed CO has been\ndetected using FT-IR techniques on pure Pt in alkaline media [41]), CO stripping occurs to a\ngreater extent at lower potentials with PtRu catalysts in alkali (compared to acid) and so\nallows the use of lower loadings of PtRu (compared with traditional DMFCs) [42].\nEncouragingly, the oxidation methanol of carbon-supported nickel has been reported in\nalkaline media [43]. The use of an AAEM in both AFCs and in alkaline-membrane DMFCs\n(AMDMFCs) may solve the problems with the use of alkali, while still allowing the\nelectrokinetic advantages of AFCs. Firstly orientation limitations are overcome; the\n9conducting species is now in a fixed solid polymer membrane. Secondly, even though there\nwill be some CO32-\/HCO3- formation at the anode, there are no mobile cations (Na+ or K+) to\nprecipitate solid crystals of metal carbonate to block or destroy the electrode layers; with\nalkaline membranes the cations are already immobilised on the polymer (often polymer\nbound benzyltrimethylammonium ~C6H4CH2NMe3+ cation sites, Scheme 3). Finally, as there\nis no liquid caustic electrolyte present, electrode weeping and component corrosion will also\nbe minimised [35].\nThe use of AAEMs in DMFCs may allow other advantages. The ion transport within the\nmembrane in an operating AMDMFC will be from the cathode to the anode, opposing the\ndirection of, and hence reducing the level of, methanol crossover from anode to cathode;\nwater will actually be electro-osmotically transported from the cathode to the anode, which is\nthe reverse of the situation found with PEM-based DMFCs. As the water is now produced at\nthe anode and consumed at the cathode, the water management regime is altered and\npotentially simplified. The two factors above avert the problem of catastrophic flooding at the\ncathode (from electro-osmosis of water from the anode to the cathode in PEM-based\nDMFCs) mentioned previously, reducing mass-transport-derived voltage losses.\nThe larger repertoire of effective electrocatalysts in an alkaline environment would facilitate\nthe search for a methanol-tolerant catalyst for the cathode to reduce the effects of any residual\nmethanol crossover even further; this reduced methanol crossover enables the use of thinner,\nhence lower resistance, membranes. Another potential consequence of this large number of\ncatalyst options with substitution of the PEM with an AAEM is an extended choice of\nselective catalysts for application in mixed reactant-oxidant fuel cells as evaluated by Scott et\nal. [30]. A CO-tolerant anode catalyst with lower metal loadings in alkaline media would also\n10\nallow the use of reformed hydrogen with improved performances. Finally, major cost,\nphysical size, and machinability concerns with traditional graphite-based bipolar plates have\nstimulated research into thinner, cheaper, and more easily machined metal bipolar plates\n(such as stainless steels) [44-46]. There are, however, significant corrosion problems\nassociated with such metal plates and acidic PEMs. The replacement of the acidic membranes\nwith alkaline membranes will potentially reduce such corrosion problems and allow cheaper\nmetals to be used (nickel current collectors are already used in traditional AFCs [47]).\nA widely quoted concern with anion-exchange membranes (AEMs) is membrane stability in\nthe alkaline forms, especially at elevated temperatures [48,49]. Instability is mainly due to the\ndisplacement of the ammonium group by the OH- anions (an excellent nucleophile) via (a) a\ndirect nucleophillic displacement and\/or (b) a Hofmann elimination reaction when \u0003-\nhydrogens are present (Scheme 3); methyl (CH3) groups may also be displaced by OH- ions\nforming tertiary amines and methanol [48,49]. However, as mentioned above, a major\napplication of DMFCs is as power sources for portable devices; such fuel cells must be\noperated at low temperatures, ideally below 60°C, which means such degradation can be\nminimal. A commercially available (but undisclosed) AAEM containing\nbenzyltrimethylammonium moieties radiation-grafted onto PTFE membranes was stable at up\nto 60°C in aqueous sodium hydroxide (6 mol dm-3) [50]; this stability in such a caustic\nenvironment demonstrates stability can be adequate for the above proposed application.\nReview of the Application of AAEMs in Fuel Cells\nAs mentioned above, acid-doped PBI membranes (Scheme 2) allow higher temperature\noperation of DMFCs and lessen electrokinetic performance losses. PBI can also be doped\n11\nwith alkaline salts and such membranes have been applied to hydrogen fuel cells by Xing and\nSavadogo [51]. PBI doped with various alkali metal hydroxides exhibited conductivities in\nthe range 5 x 10-5 – 10-1 S cm-1. Conductivities approaching 10-1 S cm-1 were obtained with\nPBI treated with KOH (aq, 6 mol dm-3) at 70 – 90°C. The conductivities dropped when\nincreasing amounts of metal carbonates were added to the alkaline doping solution; the\nmechanism of conductivity was suspected of changing on addition of metal carbonates, and it\nwas reported that this was to be further investigated by those authors.\nA H2\/O2 fuel cell was constructed (6.25 cm2 electrode area) and tested with a KOH-doped\nPBI membrane of thickness 40 µm at 50°C with an anode and cathode catalyst loading of\n0.35 mg cm-2 (from 20%wt Pt supported on C). Neither gas was humidified and the H2\/O2\npressure ratio was 3\/5, while O2 and H2 flow rates were 800 cm3 min-1 and 1200 cm3 min-1 \nrespectively. At 0.60 V cell voltage, a current of 620 mA cm-2 was achieved, which\ncorresponds to a power density of 370 mW cm-2. This performance was similar to that of the\nsame apparatus with a Nafion®-117 membrane and also, remarkably, with a KOH- and\nK2CO3-doped PBI membrane; this last result is encouraging with respect to application of\nsuch AAEMs in fuel cells. As a further comparison, current density at 0.60 V cell voltage for\na PEMFC constructed with sulfuric-acid-doped PBI and testing on the same apparatus was\n810 mA cm-2, corresponding to a power density of 490 mW cm-2.\nFauvarque et al. have evaluated two alkaline AEMs in a H2\/O2 AFC [52,53]. Membrane 1\nwas a polymer denoted H55 (epichlorhydrine polymer) that was quaternised with 1,4-\ndiazabicyclo[2,2,2]octane (DABCO) and membrane 2 was the same polymer quaternised\nwith a 1:1 ratio of DABCO and triethylamine. The membranes were observed to deteriorate\nwhen immersed in KOH(aq) at concentrations > 1 mol dm-3. The ion-exchange capacity\n12\n(IEC) was reported to be in the range 0.5 – 0.6 meq g-1, which is lower than the IEC of a\ncommercial membrane (Solvay Type ADP). The intrinsic conductivity of membrane 2 in\nwater was 5 x 10-5 – 10-4 S cm-1; these conductivities increased to around 10-2 S cm-1 when\nthe membrane absorbed further KOH(aq). Anion transport numbers were determined to be\nbetween 0.95 and 0.99.\nThe performances of H2\/O2 AFCs with the above membranes are as follows. Electrodes were\nprepared with Pt loadings of 0.13 mg cm-2 supported on carbon, and the fuel cell was\noperated at 25°C with gases supplied at atmospheric pressure, which are the conditions of\ninterest for application in portable devices. A maximum power density of 20 mW cm-2 was\nobtained with membrane 2. The performance of membrane 1 was inferior. For membrane 2,\nthe testing was repeated, but this time an interfacial solution was added between the\nelectrodes and the AAEM; the maximum power density increased to 43 mW cm-2. Fauvarque\net al. also reported extended work on the electrode-AAEM interface [54]. The interface\nmaterials studied were: (1) aqueous alkaline solutions absorbed onto a polyamide film, (2) a\nsolution of the prepared film, (3) an alkaline-gel based on a mixture of polyacrylic acid and\npotash, and (4) other unspecified interfaces; no results were, however, described in the\npublished extended abstract of that presentation.\nOgumi et al. have studied direct alcohol fuel cells (methanol and ethylene glycol) constructed\nwith a commercial membrane (AHA of ammonium type, Tokuyama Co, Japan; thickness \u0004\n240 µm when in the Cl- form) [55]. The IEC of this membrane was 1.15 – 1.25 meq g-1 in the\nOH- form. A membrane electrode assembly (MEA) with the AHA membrane was\nconstructed with carbon-supported platinum at loadings of 1 mg cm-2 and 5 mg cm-2 for the\ncathode and anode respectively. The MEA was pressed at room temperature at 140 kg cm-2 \n13\nfor 3 min. Solutions of ethylene glycol and methanol were made to a concentration of 1 mol\ndm-3 dissolved in KOH (aq, 1 mol dm-3). Fuel cell testing was conducted at 50°C with oxygen\nat unspecified pressures and stoichiometries. Despite using pure Pt for the anode (not Pt\/Ru),\nanode potentials were reported as 0.41 V and 0.33 V at a current density of 20 mA cm-2 \nrespectively for methanol and ethylene glycol. Cell voltages were around 100 mV higher for\nethylene glycol compared to methanol. Maximum power densities were 9.2 and 5.5 mW cm-2 \nrespectively for ethylene glycol and methanol; the power densities with methanol are inferior\nto those recorded at lower temperatures by Agel et al. above. This fuel cell is not quite an\nalkaline analogue of a PEMFC, as the authors added alkaline solution into the system.\nEthylene glycol is an interesting candidate fuel (see Table 1); no indication was given\nconcerning completeness of oxidation of the ethylene glycol to CO2 and H2O in this study.\nThe possibilities when operating fuel cells with AAEMs and organic fuels other than\nmethanol are discussed further below.\nYu and Scott reported the operation of a direct methanol alkaline fuel cell with platinised\ntitanium mesh anodes (1.5 mg cm-2 Pt\/Ti) and a commercial alkaline anion-exchange\nmembrane (Morgane ADP membrane from Solvay S. A.) [56]. The electrochemistry of the\nmesh electrodes in alkali was explored in a previous publication [57]. The cathode consisted\nof platinum on carbon (loading of 2 mg cm-2, 60 %wt. Pt\/C) painted onto a teflonised Ketjen\nblack gas diffusion layer and Toray carbon paper backing layer. The cell (4.9 cm2 active area)\nwas operated at 60°C; the methanol solution was made to a concentration of 2 mol dm-3 in\naqueous sodium hydroxide (1 mol dm-3) and supplied at 1 bar pressure and with a flow rate of\n60 ml min-1. This setup produced a peak power density of 7.8 mW cm-2 and a maximum\ncurrent density of 65 mA cm-2 at short circuit; the same cell operated with an anode\nconsisting of Pt\/C (1.5 mg cm-2) on non-teflonised Toray produced a peak power density of\n14\n7.0 mW cm-2 and a maximum current density of 59 mA cm-2 at short circuit. While the\nperformance of both setups were comparable at open circuit and at high current densities, at\nlow current densities (< 10 mA cm-2) the platinised titanium mesh was superior indicating\nlower activation losses at the anode. No deterioration in fuel cell performance over a period\nof 48 h was observed with the platinised titanium mesh anodes. The addition of alkaline\nspecies to the aqueous methanol anode stream may well assist in the prevention of CO32-\n\/HCO3- formation in the alkaline membrane.\nZhuang et al. recently conducted a feasibility analysis of the use of AAEMs in DMFCs [58];\nthis important study concentrated on the thermodynamic disadvantages versus kinetic\nadvantages of such AMDMFCs by studying the reactions taking place in aqueous solutions.\nThe authors, on examining the reaction mechanism, showed a large pH difference would be\ncreated in the AAEM between the anode, (where CO22-\/HCO3- is formed from reaction of the\nAAEM with the CO2 produced from oxidation of methanol) and the cathode (where very\nlittle CO22-\/HCO3- is found due to continuous production of OH- ions). It was calculated that\nat 20°C, a pH difference of 6.1 would exist corresponding to a thermodynamic voltage loss of\nca. 360 mV; at 80°C the pH difference drops to 4.1 resulting in a reduced voltage loss of ca.\n290 mV. The authors also demonstrated that, with operation of an AMDMFC at 80°C at a\ncurrent density of 100 – 200 mA cm-2, a voltage gain of 100 mV due to improved electrode\nkinetics would be obtained at the anode, and a further gain of 100 mV would be obtained at\nthe cathode. If methanol crossover were suppressed, as is hoped with an AMDMFC system,\nanother voltage gain will arise. The authors concluded that the thermodynamic voltage losses\nfound for an AMDMFC, due to the pH difference across the AAEM, would be roughly\ncancelled out by the kinetic voltage gains and that operation at elevated temperatures would\nreduce thermodynamic voltage losses (this may be challenging with respect to AAEM\n15\nstability). Finally, from infrared studies of the reactions in solution reported in the same\narticle, it was shown that methanol could be completely oxidised to CO2 and water in the\npresence of CO22-\/HCO3-, which is an important and encouraging finding.\nReview of Other Relevant AAEM Systems\nThe recent fuel cell studies with AAEMs (reviewed above) show promising initial results on\nwhat are unoptimised membranes, MEAs, and\/or fuel cell operating conditions. This section\ndescribes work on other AAEMs that may be applicable to H2\/O2 and methanol fuel cells,\nincluding recent work in our laboratory.\nThere is extensive worldwide research being conducted on replacement proton exchange\nmembranes (PEMs) [59,60]; the main problems with current generation PEMs (such as\nNafion®) are high methanol permeabilities and fiscal cost. A significant proportion of recent\nfuel cell membrane research involves the radiation-grafting of styrene onto low and high\ndensity polyethylene films (LDPE, HDPE), partially fluorinated films such as\npoly(vinylidene fluoride) (PVDF) and poly(ethylene-co-tetrafluoroethylene) (ETFE), and\nfully fluorinated poly(tetrafluoroethylene-co-hexafluoropropylene) (FEP) films; subsequent\nsulfonation yields cation-exchange sites (sulfonic acid groups) [61-64]. The properties and\ncompositions of the final materials are easily controlled via alteration of the grafting and\nsulfonation conditions [61,62]. Reviews by Hill et al. describes the radiation chemistry of\nfluoropolymers [65] and the high energy radiation-grafting of monomers onto fluoropolymers\n[66]. A very comprehensive review on the preparation of ion-exchange membranes using\nradiation-grafting of polar monomers onto non-polar films has been recently published by\nNasef et al. [67]. Radiation-grafted PEMs have been tested in DMFCs by Scott et al. [68].\n16\nRadiation-grafted PVDF-based cation-exchange membranes (CEMs) and AEMs produced at\nSurrey have also been applied to salt-splitting technologies in joint studies with Newcastle\nUniversity [69-71]. Radiation grafting methodology produces ionomer membranes cheaply\nand has major advantages in that preformed commercial polymer films are modified,\nalleviating the need for film formation steps, with the wealth of adjustable experimental\nparameters (e.g. radiation dose, temperature, film thickness) allowing a large degree of\ntailorability.\nAnion-exchange membranes, formed using the radiation-grafting synthetic route, have in the\npast been developed for electrodialysis [72,73] and ion-exchange applications [74]. Svarfar et\nal. have studied radiation-grafted PVDF AEMs for medical applications [75]. Recent studies\nin our materials chemistry laboratories at Surrey have concentrated on producing and\noptmising stable and conductive AAEMs in the same way (Scheme 4). Extensive solid-state\nNMR and vibrational spectroscopic studies showed that PVDF was an unsuitable base\npolymer for producing AAEMs due to lack of backbone stability when converted to the OH-\nforms [76,77]; therefore, caution is advised with the use of the PVDF-based AEMs\nmentioned above if any trace of alkali is present. FEP was the base material of choice and\nwas grafted with vinylbenzyl chloride (VBC); subsequent amination and alkali anion-\nexchange yielded the desired AAEMs. Using Raman-microscopy, it was shown that the\ngrafting of VBC progressed throughout the thickness of the FEP (referred to as graft\npenetration, see Figure 2). AAEMs were obtained with IECs of up to 0.96 meq g-1 in the Cl-\nforms and these AAEMs show good conductivities of the order of magnitude of 10-2 S cm-1 in\nthe exchanged OH- forms. Monitoring the IEC of an example membrane with time while\nheating in water (open to air and therefore traces of CO2) at 60°C demonstrated good ex situ\n17\nmembrane stability over a period of 2500 h (Figure 3); this temperature is effectively an\nupper limit for operating fuel cells in portable devices.\nThe diffusion coefficient of OH- ions is less than that of protons [52] in nearly all media, so it\nis essential to maximise IECs to get conductivities as high as possible with AAEMs. It is also\nessential that the effect of the reaction conditions on the membranes produced is explored in\ndetail for each parent polymer film \/ monomer combination [62]. Further studies were\nundertaken at Surrey with these two aims in mind [78]: FEP can be grafted with VBC with\ndegrees of grafting (DOG) of at least 29% (by mass), with the graft penetration improving on\nincreasing DOG; membranes with improved IECs (Cl- forms) of up to 1.1 meq g-1 (cf.\nNafion® 11x-series of membrane have IECs of 0.91 meq g-1) were produced, which exhibited\nconductivities (OH- forms) of ~ 10-2 S cm-1 (initial 2-probe impedance spectroscopy\nmeasurements); however, further improvements in grafting levels (and hence IECs) are\nrequired to get conductivities at levels equivalent to current PEMs. Fuel cell measurements of\nthese radiation-grafted AAEMs (RG-AAEMs) are now commencing alongside in situ\nimpedance spectroscopy measurements to confirm membrane conductivities and electrode\noverpotentials.\nThere are many reports of work on different anion-exchange materials in the literature, the\nmajority of which concentrate on applications other than in fuel cells. Childs et al. have\nstudied highly crosslinked AEMs synthesised from poly(vinylbenzyl chloride) quaternised\nusing the diamines DABCO and piperazine [79,80] for various applications, including water\nsoftening; the crosslinked anion-exchange polymer phase was supported in the pores of\nmicroporous polypropylene and further crosslinking was enabled by subsequent reaction with\n\u0005,\u0005’-dibromo-p-xylene. A detailed study was conducted by Tomoi et al. concerning the\n18\nsynthesis of thermally stable alkaline anion-exchange resins [81]; incorporating a “hexyloxy\nspacer group” (OC6H12 ether linkage) between the benzyl CH2 carbon and the quaternary\nammonium anion-exchange site (Scheme 5) yielded resins which retained > 80% of their\nIECs after treatment at 120°C for 30 days, and retained 98% at 100°C for the same period of\ntime. If membranes, as opposed to resins, could be made with such functionalities and\nthermal stabilities, these would be excellent candidates for alkaline membrane fuel cells; at\nsuch elevated temperatures, the thermodynamic voltage losses previously mentioned in the\nfeasibility study of Zhuang et al. [58] would be minimised.\nYang et al. produced alkaline poly(vinyl alcohol) \/ poly(epichlorohydrin) copolymers for\napplication in Zn-air batteries [82]. Arof et al. produced poly(vinyl alcohol)-KOH blend\nalkaline electrolytes with conductivities < 10-5 S cm-1 for a nickel-zinc cells [83]. Vargas et\nal. also studied PVA-KOH electrolytes and obtained conductivities up to 2.3 x 10-3 S cm-1 for\napplication in humidity sensors and alkaline batteries [84]. Sun et al. studied highly\nconductive poly(sodium acrylate) \/ tetramethylammonium hydroxide blends and mentioned\nAFCs as a potential application [85]. AEMs produced from a simultaneous amination and\ncrosslinking process were reported by Tongwen et al. for desalination processes, with IECs\nof the order of 10-3 S cm-1 [86,87]. Bowman et al. [88] and Moon et al. [89] have looked at\nfunctionalised poly(vinylbenzyl chloride) and LDPE\/polyvinylbenzyltrimethylammonium\nsalt copolymer AEMs respectively, for ion-exchange applications. Sanchez et al. reported the\nsynthesis and characterisation of amorphous anion conducting polyether networks with\nconductivities between 10-9 and 10-5 S cm-1 [90]. A study of the thermal membrane potentials\nof poly(styrene-co-divinylbenzene) based AEMs containing various trialkylammonium\ngroups was reported by Tasaka et al. [91]. A commercial anion-exchange resin (in alkali\nform), from Amberlite IRA-900, has been applied in catalysts for the aldol condensation of\n19\nacetone [92]. Polymer-supported onium salts based around vinylbenzyl chloride, and\nproduced using an emulsion polymerisation methodology, have been applied as phase\ntransfer catalysts in the alkylation of isopropylidene malonate [93]. All of these AEMs and\nresins, however, exhibited conductivities well below levels required for application in fuel\ncells.\nSata et al. conducted an extensive study on the stability of commercial AEMs from various\ncommercial manufacturers (Tokuyama, Ashai Glass, Pall-RAI etc.) [50]; most of these\nmembranes contained either trimethylammonium or N-methyl pyridinium groups. AEMs\nwere also prepared in this study based on both chloromethylated polysulfone (Scheme 6) and\npolymerised vinylbenzyl chloride. It was concluded that AAEMs based on\ntrimethylammonium groups were the most stable to treatment in hot alkaline solutions; this\nconclusion directed the choice of functional group chemistry selected at Surrey for\napplication in alkaline membrane fuel cells. Ohya et al. [94,95] and Hao et al. [96] have also\nstudied AEMs based on chloromethylated polysulfones (Scheme 6) for electrodialysis\napplications; there is, however, no evidence in the literature that such polysulfone-based\nAEMs have been applied to fuel cells.\nA Brief Survey of the Patent Literature\nThis is not intended to be an exhaustive survey of patent applications; there are, however, a\nsmall number of patents of interest in relation to alkaline membrane fuel cells. Related\npatents and patent applications from J. Divisek describe the invention of a methanol fuel cell\nutilising an anion-exchange membrane [97-99]. J.-F. Fauvarque was granted a patent on\naqueous alkaline solid electrolyte based around polyether polymer matrices [100]. W. Yao, T.\n20\nTsai, Y.-M. Chang, and M. Chen were granted related patents on alkaline polymers\ncontaining alkyl quaternary ammonium salts, nitrogen containing heterocyclic quaternary\nammonium salts, and metal hydroxide salt for potential applications in alkaline batteries and\nfuel cells [101-103]. A patent was issued to F. Jaouen concerning a novel cathode structure\nfor a solid polymer fuel cell [104]; that cathode structure consisted of a solid polymer anion-\nexchange membrane surrounding the catalysts particles (entirely within the cathode\nstructure), which was in contact (surrounded) with a cation-conducting polymer membrane. J.\nLu and L. Zhuang were granted a patent on alkaline-resin-containing fuel cells with direct\nfuelling with liquid organic fuels [105].\nPatents relating to the application of radiation-grafted ion-exchange membranes in fuel cells\nhave been granted to G. G. Scherer, F. N. Büchi, and B. Gupta [106] and to C. Stone and A.\nSteck [107,108]. All these patents mention the functionalisation of base polymers with\nquaternary ammonium groups to yield alkaline polymers. The use of fluoro-substituted\nstyrenic monomers is also claimed to improve membrane chemical stability when utilised in\nfuel cells (removal of undesired and reactive C-H bonds).\nFuture Research Challenges\nIt is evident from all of the above studies that there are a number of research challenges that\nmust be overcome before AAEMs can be successfully applied to pre-commercial fuel cells:\n(1) As a priority and to compliment ex situ stability measurements [77] (Figure 3),\nAAEMs must be evaluated in H2\/O2, H2\/air, and methanol\/air fuel cells for several\nthousand hours to ensure adequate in situ membrane stability and assess the effect of\n21\nand level of CO22-\/HCO3- formation. The effect of adding alkali to the methanol\nsolution [56] must also be thoroughly investigated over long timescales.\n(2) AAEMs must be created with higher conductivities, to ensure good fuel cell\nperformances at high current densities. It should be noted, however, that with\napplication of an AMDMFC as a power source for portable devices an overriding\npriority is maximising the energy density of the fuel and fuel efficiency (cell voltage).\nThese DMFCs will be operated at low-to-medium current densities (higher\nefficiencies), where electrode overpotentials are the dominant cause of voltage losses.\n(3) It is also essential that a solublised form of an alkaline anion-exchange polymer be\ndeveloped to improve the interface between the electrodes and the AAEM electrolyte.\nSuccess in this effort will further decrease MEA resistances; the soluble material will\nbe analogous to the commercially available Nafion(R) solutions in water\/alcohol\nmixtures used to optimise MEA interfaces in acid form PEMFCs and DMFCS\n[109,110]. A water-based soluble form which can be rendered water insoluble when\ncast would be preferred, as there are safety concerns (primarily with industrial scale\nproduction) about using organic solvents near finely dispersed (pyrophoric) metal\ncatalysts (unsupported or supported on carbon).\n(4) If AAEMs are to be applied to fuel cells for other applications (such as automotive\npower etc.), more temperature stable AEMs must be developed. Operation of alkaline-\nmembrane-based fuel cells at elevated temperature would reduce thermodynamic\nvoltage losses due to pH differences across the AAEM [58] and would also improve\nthe electrokinetics. Successful, stable over the long term, operation at elevated\ntemperatures would allow application in fuel cells for the automotive mass-market.\n22\nThe article on thermally stable alkaline anion-exchange resins by Tomoi et al. [81]\nhints at chemistry required in targeting this outcome.\n(5) If AAEMs are proven to be stable in fuel cells over 1000’s of hours, an in-depth\ninvestigation into effective and cheaper non-noble metal catalysts (e.g. Ni, Ag etc.) is\nindicated. There would also be a greater chance of finding methanol-tolerant catalysts\nfor use in the cathodes than in related PEM-based DMFCs.\n(6) Another, more technical, challenge will be to measure anode performances and\nelectrokinetics in the fuel cell. Whereas hydrogen can be fed to the cathode with\nPEM-based DMFCs, to act as a dynamic hydrogen reference electrode (when testing a\nfuel cell [111] and conducting impedance spectroscopy measurements [112,113]) to\nassist evaluation of anode performances, this cannot be done using an AAEM; that is\nbecause oxygen must be present at the cathode to generate the OH- ions. Therefore, a\nseparate reference electrode must be present, adding to the complexity of the test\nsystem; this has, however, been carried out with an AAEM in a recent study [55].\n(7) Finally, removal of fluorine from the polymer systems would be of interest to enhance\nthe environmental credentials (facilitate easier disposal) and reduce costs. The\nsubstitution of fully fluorinated FEP with non-fluorinated LDPE is feasible. While\noxidative radical degradation is a problem at the cathode and anode (via oxygen\ndiffusion through the membrane) with non-fluorinated PEMs [114-116] (e.g. the\npoly(styrene sulfonic acid) PEMs used in the fuel cells for NASA’s Gemini space\nprogram in the 1960’s and other polymers containing benzyl C-H\u0005 bonds, see Scheme\n7), it has been shown using electron paramagnetic resonance (EPR) studies that such\ndegradation is prevented in highly alkaline (pH > 11.7) conditions intrinsic to AAEMs\n[114].\n23\nFeasibility of Alternative Fuels Coupled with the Application of AAEMs in Fuel Cells\nThere is considerable interest in evaluating organic fuels other than methanol in fuel cells,\nespecially if full and facile electro-oxidation can be achieved. Methanol is toxic, while\nalcohols such as ethanol are less so. The direct use of “higher” alcohols is of interest due to\npotentially higher energy densities and higher maximum thermodynamic efficiencies [9,10]\n(Table 1). The use of ethanol would be especially attractive due to its availability from\nrenewable sources such as the fermentation of sugar-containing raw materials (Brazil already\ndistributes ethanol through the gas station network to fuel internal combustion powered cars);\nconcentrated ethanol solutions up to 40% by weight in open containers have already been\ncleared by the various aviation authorities for use in aircraft cabins (relevant for lap-top\ncomputer \/ PDA power supplies). Incredibly, there has recently been a US$400,000\ninvestment by seed-capital company BioGenerator jointly with a US$250,000 investment by\nSt. Louis University into a project to develop biofuel cells fuelled with vodka, beer and other\nethanol-based substances [117].\nThere have been many recent reports concerning the operation of PEM-based direct alcohol\nfuel cells (DAFCs) with “higher” alcohols such as propanol and ethanol. It has been reported\n[9,10,118] that ethanol gives similar performances to methanol at high operating\ntemperatures with acidic membranes. A further point of interest is that Pt\/Sn anode catalysts\nare more active than Pt\/Ru in the case of direct fuelling with ethanol [119-121] in cells with\nacidic membranes. CuNi-modified Pt\/Ru have shown superior ethanol oxidation in alkaline\nmedia [122]. However, complete electrooxidation of ethanol has still not been achieved.\n24\nIn contrast, complete oxidation (C-C bond cleavage) of ethylene glycol in a proton-exchange\nmembrane fuel cell has been claimed [123]. It has also been reported that the electroactivity\nof ethylene glycol (EG) in alkaline media is high [124]. Ethylene glycol has an existing\nproduction and distribution infrastructure in place (as anti-freeze) and could be a promising\nfuel for portable devices. As reported above, Ogumi et al. have conducted preliminary studies\non the use of a commercially available AAEM in direct alcohol fuel cells [55]; superior\nperformance and power densities were reported when ethylene glycol was used, compared\nwith methanol, but no investigation into the degree of oxidation of EG or into the oxidation\nproducts was conducted. Vielstich et al. have studied the electrocatalysis of EG with Pt\/Ru\ncatalysts showing good activity [125]; by-products such as oxalic acid and glycolic acid from\nincomplete oxidation of EG were detected. Fuel cell measurements at 70°C using Nafion(R)\nand Pt\/Ru catalysts at the anode also showed that crossover of EG to the cathode and\/or\noxidation products leads to a substantial decrease in the cathode potential; a conclusion of the\nreport was that new alternative membranes are required to effectively use EG in direct\nalcohol fuel cells.\nUmeda et al. concluded [126] that the use at ambient temperature of 2-propanol (aq, 0.5 mol\ndm-3) produced better performances than methanol at low current densities, while more\nconcentrated 2-propanol (aq, 5 mol dm-3) produced superior performance to methanol at all\ncurrent densities; performances were, however, poor compared with state-of-the-art DMFCs,\nand 2-propanol produced acetone as the only product (incomplete oxidation), which tended to\naccumulate around the anode, reducing performance. Qi and Kaufman reported [127] high\nperformance at temperatures below 80°C, particularly at low current densities, with the use of\nundiluted 2-propanol and an S-PEEK (sulfonanted polyetheretherketone) PEM; an example\nperformance at 80°C (pure 2-propanol at the anode) with an air flow rate at the cathode of\n25\n870 cm3 min-1 gave a cell voltage of 0.485 V at a current density of 200 mA cm-2 \n(corresponding to 97 mW cm-2). Superior performance and low fuel-crossover with 2-\npropanol, compared to methanol, was also reported when a Nafion® PEM was used [128].\nThese performances at low current densities and temperatures, located in the operating\nregime for portable devices, suggests the direct use of this fuel could be applicable to such\napplications, but poisoning of the anode by intermediate oxidation products reduces\nperformance at high current densities and reduces the intrinsic fuel energy density (the cell\nself-refreshed, however, on being shutdown).\nThe challenge for AAEMs in this arena is to enable catalysts to be found that, in conjunction\nwith the alkaline environment, allow complete oxidation to maximise the energy extracted\nfrom these alcohols; if ethanol is to be used as feed, it is important to get good performance at\nlower temperatures if the benefits of using this fuel (infrastructure and renewability) are to be\nconferred onto fuel cells for portable devices.\nThree alternative (non-alcoholic) fuel vectors are of interest with respect to alkaline\nmembrane fuel cells. Firstly, Yasuda et al. have studied the application of AEMs in a\nhydrazine fuel cell [129]; hydrazine (H2NNH2, theoretical mass energy density of 2.6 kW h kg-1 \n[121]), once used as rocket fuel with associated interesting safety considerations and corrosive\nproperties) is alkaline in aqueous solution and is expected to be highly compatible with an\nAAEM. A now commercially unavailable AEM (Tosflex® SF-17, Tosoh, 175 µm thick) was\nattached to Pt electrodes by electroplating to a Pt loading of 1 mg cm-2. A 10 cm2 single cell\nheated to 70°C was constructed, an aqueous solution of hydrazine (2 mol dm-3) was supplied\nto the anode at 2 cm3 min-1 and humidified oxygen was supplied to the cathode at 400 cm3\nmin-1. A current density of around 20 mA cm-2 was obtained at a cell potential of 0.4 V,\n26\ncorresponding to a power density of 8 mW cm-2; this performance was vastly superior to\ncomparable use of a PEM in a direct hydrazine fuel cell.\nSecondly, there is the direct borohydride (BH4-) fuel cell. Binder et al. reported a sodium\nborohydride \/ air fuel cell utilising an AAEM (2259-60 Pall RAI) [130]. The maximum cell\nvoltage obtainable with the sodium borohydride \/ oxygen couple (BH4- + 2O2 \u0001 BO2- +\n2H2O) is 1.64 V and the theoretical maximum energy density is 9.3 kW h kg-1. A commercial\ngas diffusion electrode (Johnson Matthey) was used at the cathode, while carbon silks\ndeposited with gold and gold\/platinum particles were used as anode materials. Maximum\npower densities were obtained with a 3%Pt\/97%Au mix dispersed on the carbon silk (at 0.4 V\ncell voltage 20 mW cm-2 was obtained at room temperature and 63 mW cm-2 at 70 °C).\nHowever, maximum energy density was obtained with an Au-only-dispersed carbon silk\nanode (184 W h kg-1, undisclosed borohydride concentration). Further experiments with the\nAu-only anode with a 5% NaBH4 \/ 25% NaOH solution demonstrated that ~ 6.9 electrons\nwere released per BH4- unit out of a maximum of 8; this excellent faradaic efficiency\ndemonstrated low amounts of competing borohydride hydrolysis reactions (BH4- + 2H2O \u0001\nBO2- + 4H2, especially facile at pH < 7). It was noted that selective anion-exchange\nmembranes would be an advantage to minimise BH4- crossover.\nFinally, it has been proposed that ammonia would make a good energy vector \/ carrier [35]\nand an indirect fuel for a hydrogen fuel cell; ammonia is environmentally benign (it is already\nused as a fertiliser and neutralises acid rain), already available cheaply ($1.2 \/ kW h\ncompared with $3.8 for methanol and $25 for hydrogen), contains 50% more H per dm3 than\nliquid hydrogen, and is a liquid at much lower pressures (8 – 9 bar); it also has the advantage\nof a strong smell, allowing the easier location of leaks. However, cracking ammonia to form\n27\nhydrogen for traditional PEMFCs requires temperatures of above 900°C to remove all traces\nof NH3; PEMFCs cannot tolerate any such contamination. The advantage of AFCs is that\nthey can tolerate low levels of NH3 contamination, and so cracking can be undertaken at\nlower temperatures if hydrogen is to be supplied to such an AFC; this is a final potential\nbenefit of using an alkaline membrane as opposed to an acid form membrane.\nAcknowledgements\nWe thank the Engineering and Physical Sciences Research Council (EPSRC) for a grant in\nthe field of development of alkaline membrane technology for energy generation (Grant\nGR\/S60709\/01).\n[1] T. R. Ralph, M. P. Hogarth, Platinum Metals Rev., 2002, 46, 3 – 14.\n[2] T. R. Ralph, M. P. Hogarth, Platinum Metals Rev., 2002, 46, 117 – 135.\n[3] Z. Qi, A. Kaufmann, J. Power Sources, 2003, 113, 37 – 43.\n[4] S. Gamburzev, A. J. Appleby, J. Power Sources, 2002, 107, 5 – 12.\n[5] S. Y. Cha, W. M. Lee, J. Electrochem. Soc., 1999, 146, 4055 – 4060.\n[6] R. O’Hayre, S. J. Lee, S. W. Cha, F. B. Prinz, J. Power Sources, 2002, 109, 483 – 493.\n[7] S. Lister, G. McLean, J. Power Sources, 2004, 130, 61 – 76.\n[8] C. A. Schiller, F. Richter, E. Gülzow, N. Wagner, Phys. Chem. Chem. Phys., 2001, 3,\n2113 – 2116.\n[9] C. Lamy, A. Lima, V. LeRhun, F. Delime, C. Coutanceau, J.- M. Leger, J. Power\nSources, 2002, 105, 283 – 296.\n[10] C. Lamy, E. M. Belgsir, J.- M. Leger, J. Appl. Electrochem., 2001, 31, 799 – 809.\n28\n[11] S. Dunn, Int. J. Hydrogen Energy, 2002, 27, 235 – 264.\n[12] S. Dunn, Int. J. Hydrogen Energy, 2003, 28, 131 – 133.\n[13] C. Stone, A. E. Morrison, Solid State Ionics, 2003, 152 – 153, 1 – 13.\n[14] D. Cohen, New Scientist, 19th October 2002, 176 issue 2365, 40.\n[15] X. Ren, P. Zelenay, S. Thomas, J. Davey, S. Gottesfeld, J. Power Sources, 2000, 86, 111\n– 116.\n[16] C. K. Dyer, J. Power Sources, 2002, 106, 31 – 34.\n[17] C. Hebling, A. Heinzel, Fuel Cell Bull., July 2002, 8 –12.\n[18] P. Jannasch, Curr. Opin. Colloid. Interf. Sci., 2003, 8, 96 – 102.\n[19] A. Heinzel, V. M. Barragàn, J. Power Sources, 1999, 84, 70 – 74\n[20] Y.-L. Ma, J. S. Wainright, M. H. Litt, R. F. Savinell, J. Electrochem. Soc., 2004, 151,\nA8 – A16.\n[21] US Patent: 6,632,847, 2003, Celanese Ventures GmbH, Germany.\n[22] S. C. Thomas, X. Ren, S. Gottesfeld, P. Zelenay, Electrochim. Acta, 2002, 47, 3741 –\n3748.\n[23] K. Scott, W. M Taama, J. Cruikshank, J. Power Sources, 1997, 65, 159 –171.\n[24] R. Dillon, S. Srinivasan, A. S. Aricò. V. Antonucci, J. Power Sources, 2004, 127, 112 –\n116.\n[25] S. D. Knights, K. M. Colbow, J. St-Pierre, D. P. Wilkinson, J. Power Sources, 2004,\n127, 127 – 134.\n[26] T. R. Ralph, M. P. Hogarth, Platinum Metals Rev., 2002, 46, 146 – 164.\n[27] A. K. Shukla, R. K. Raman, N. A. Choudhury, K. R. Priolkar, P. R. Sarode, S. Emura, R.\nKumashiro, J. Electroanal. Chem., 2004, 563, 181 – 190.\n29\n[28] W. Li, W. Zhou, H. Li, Z. Zhou, B. Zhou, G. Sun, Q. Xin, Electrochim. Acta, 2004, 49,\n1045 – 1055.\n[29] G.J.K. Acres, J. Power Sources, 2001, 100, 60 – 66.\n[30] K. Scott, A. K. Shukla, C. L. Jackson, W. R. A. Meuleman, J. Power Sources, 2004,\n126, 67 – 75.\n[31] S. Gamburzev, K. Petrov, A. J. Appleby, J. Appl. Electrochem. , 2002, 32, 805 – 809.\n[32] N. Wagner, M. Schulze, E. Gülzow, J. Power Sources, 2004, 127, 264 – 272.\n[33] M. Schulze, E. Gülzow, J. Power Sources, 2004, 127, 252 – 263.\n[34] G. F. McLean, T. Niet, S. Prince-Richard, N. Djilali, Int. J. Hydrogen Energy, 2002, 27,\n507 – 526.\n[35] M. Cifrain, K. V. Kordesch, J. Power Sources, 2004, 127, 234 – 242.\n[36] E. Gülzow, M. Schulze, J. Power Sources, 2004, 127, 243 – 251.\n[37] E. Chen in Fuel Cell Technology Handbook, (Ed. G. Hoogers), CRC-PRESS, Boca\nRaton, 2003, p.2-24 – p.2-25.\n[38] G. A. Koscher, K. Kordesch, J. Solid State Electrochem., 2003, 7, 632 – 636.\n[39] A. V. Tripkovi\u0001, K. D. Popovi\u0001, B. N. Grgur, B. Blizanac, P. N. Ross, N. M. Markovi\u0001,\nElectrochim. Acta, 2002, 3707 – 3714.\n[40] E. H. Yu, K. Scott, R. W. Reeve, J. Electroanal. Chem., 2003, 547, 17 – 24.\n[41] A. V. Tripkovi\u0001, N. M. Mannkovi\u0001, K. D. Popovi\u0001, R. R. Adzic, Russ. J. Electrochem.,\n1995, 31, 993 – 1003.\n[42] J. S. Spendelow, G. Q. Lu, P. J. A. Kenis, A. Wieckowski, J. Electroanal. Chem., 2004,\n568, 215 – 224.\n[43] M. A. Abdel Rahim, R. M. Abdel Hameed, M. W. Khalil, J. Power Sources, 2004 in\npress.\n30\n[44] J. Wind, R. Späh, W. Kaiser, G. Böhm, J. Power Sources, 2002, 105, 256 – 260.\n[45] K. Scott, P. Argyropoulos, P. Yiannopoulos, W. M. Taama, J. Appl. Electrochem., 2001,\n31, 823 – 832.\n[46] D. P. Davies, P. L. Adcock, M. Turpin, S. J. Rowen, J. Appl. Electrochem., 2000, 30,\n101 – 105.\n[47] P. Gouérec, L. Poletto, J. Denizot, E. Sanchez-Cortezon, J. H. Miners, J. Power Sources,\n2004, 129, 193 – 204.\n[48] A. A. Zagorodni, D. L. Kotova, V. F. Selemenev, React. Funct. Polym., 2002, 53, 157 –\n171.\n[49] V. Neagu, I. Bunia, I. Plesca, Polym. Degrad. Stab., 2000, 70, 463 – 468.\n[50] T. Sata, M. Tsujimoto, T. Yamaguchi, K. Matsusaki, J. Membr. Sci., 1996, 112, 161 –\n170.\n[51] B. Xing, O. Savadogo, Electrochem. Commun., 2000, 2, 697 – 702.\n[52] E. Agel, J. Bouet, J. F. Fauvarque, J. Power Sources, 2001, 101, 267 – 274.\n[53]E. Agel, J. Bouet, J. F. Fauvarque, H. Yassir, Ann. Chim. Sci. Mater., 2001, 26, 59 – 68.\n[54] E. Agel, J. Bouet, J. F. Fauvarque, Extended Abstracts of the 4th International\nSymposium on New Materials for Electrochemical Systems, (Eds. O. Savadogo), Montréal,\nJuly 9th – 13th 2001, p.284.\n[55] Z. Ogumi, K. Matsuoka, S. Chiba, M. Matsuoka, Y. Iriyama, T. Abe, M. Inaba,\nElectrochemistry, 2002, 70, 980 – 983.\n[56] E. H. Yu, K. Scott, Electrochem. Commun., 2004, 6, 361 – 365.\n[57] E. H. Yu , K. Scott , R. W. Reeve , L. Yang, R. G. Allen, Electrochim. Acta, 2004, 49,\n2443 – 2452.\n31\n[58] Y. Wang, L. Li, L. Hu, L. Zhuang, J. Lu, B. Xu, Electrochem. Commun., 2003, 5, 662 –\n666.\n[59] J. A. Kerres, J. Membr. Sci., 2001, 185, 3 – 27.\n[60] P. Jannash, Curr. Opin. Colloid Interf. Sci., 2003, 8, 96 – 102.\n[61] K. V. Lovell, J. A. Horsfall, Eur. Polym. J., 2002, 38, 1671 – 1682.\n[62] P. Brack, H. G. Buhrer, L. Bonorand, G. G. Scherer, J. Mater. Chem., 2001, 10, 1795 –\n1803.\n[63] B. Gupta, F. N. Büchi, G. G. Scherer, J. Poly. Sci.: Part A: Polym. Chem., 1994, 32,\n1931 – 1938.\n[64] J. A. Horsfall, K. V. Lovell, Fuel Cells, 2001, 1, 186 – 191.\n[65] J. S. Forsythe, D. J. T. Hill, Prog. Polym. Sci., 2000, 25, 101 – 136.\n[66] T. R. Dargaville, G. A. George, D. T. Hill, A. K. Whittaker, Prog. Polym. Sci., 2003, 28,\n1355 – 1376.\n[67] M. M. Nasef, E.-S. A. Hegazy, Prog. Polym. Sci., 2004, 29, 499 – 561.\n[68] K. Scott, W. M. Taama, P. Argyropoulos, J. Membr. Sci., 2000, 171, 119 – 130.\n[69] N. Tzanetakis, W. M. Taama, K. Scott, J. R. Varcoe, R. C. T. Slade, Desalination, 2003\n151, 275 – 282.\n[70] N. Tzanetakis, W. M. Taama, K. Scott, R. J. J. Jachuck, R. C. T. Slade, J. R. Varcoe,\nSep. Puri. Tech., 2003, 30, 113 – 127.\n[71] N. Tzanetakis, J. R. Varcoe, R. C. T. Slade, K. Scott, Electrochem. Commun., 2003, 5,\n115 – 119.\n[72] T. Cohen, P. Dagard, J. Molénat, B. Brun, C. Gavach, J. Electroanal. Chem., 1986, 210,\n329 – 336.\n32\n[73] W. Lee, K. Saito, S. Furusaki, T. Sugo, K. Makuuchi, J. Membr. Sci., 1993, 81, 295 –\n305.\n[74] J. Sandeaux, R. Sandeaux, G. Pourcelly, J. Molénat, J. Membr. Sci., 1993, 84, 213 – 227.\n[75] B. L. Svarfvar, K. B. Ekman, M. J. Sundell, J. H. Näsman, Polym. Adv. Tech., 1996, 7,\n839 – 846.\n[76] T. N. Danks, R. C. T. Slade, J. R. Varcoe, J. Mater. Chem., 2002, 12, 3371 – 3373.\n[77] T. N. Danks, R. C. T. Slade, J. R. Varcoe, J. Mater. Chem., 2003, 13, 712 – 721.\n[78] H. Herman, R. C. T. Slade, J. R. Varcoe, J. Membr. Sci., 2003, 218, 147 – 163.\n[79] A. K. Pandey, A. Goswami, D. Sen, S. Mazumder, R. F. Childs, J. Membr. Sci., 2003,\n217, 117 – 130.\n[80] A. K. Pandey, R. F. Childs, M. West, J. N. A. Lott, B. E. McCarry, J. M. Dickson, J.\nAppl. Polym. Sci.:Part A: Polym. Chem., 2001, 39, 807 – 820.\n[81] M. Tomoi, K. Yamaguchi, R. Ando, Y. Kantake, Y. Aosaki, H, Kubota, J. Appl. Polym.\nSci., 1997, 64, 1161 – 1167.\n[82] C.- C. Yang, S.- J. Lin, S.- T. Hsu, J. Power Sources, 2003, 122, 210 – 218.\n[83] A. A. Mohamad, N. S. Mohamed, M. Z. A. Yahya, R. Othman, S. Ramesh, Y. Alias, A.\nK. Arof, Solid State Ionics, 2003, 156, 171 – 177.\n[84] I. Palacios, R. Castillo, R. A. Vargas, Electrochim. Acta, 2003, 48, 2195 – 2199.\n[85] J. Sun, D. R. MacFarlane, M. Forsyth, Electrochim. Acta, 2003, 1971 – 1976.\n[86] X. Tongwen, F. F. Zha, J. Membr. Sci., 2002, 199, 203 – 210.\n[87] X. Tongwen, Y. Weihua, J. Membr. Sci., 2001, 190, 159 – 166.\n[88] K. L. Thunhorst, R. D. Noble, C. N. Bowman, J. Membr. Sci., 1997, 128, 183 – 193.\n[89] Y.- J. Choi, M.- S. Kang, J. Cho, S.- H. Moon, J. Membr. Sci., 2003, 221, 219 – 231.\n33\n[90] O. Brylev, F. Alloin, M. Duclot, J.-L. Souquet, J.-Y. Sanchez, Electrochim. Acta, 2003,\n48, 1953 – 1959.\n[91] M. S. Huda, R. Kiyono, M. Tasaka, T. Yamaguchi, T. Sata, Sep. Puri. Tech., 1998, 14,\n95 – 106.\n[92] G. G. Podrebarac, F. T. T. Ng, G. L. Rempel, Chem. Eng. Sci., 1997, 52, 2991 – 3002.\n[93] L. Hong, E. Ruckenstein, Polymer, 1992, 33, 1968 – 1975.\n[94] G.- J. Hwang, H. Ohya, J. Membr. Sci., 1998, 149, 163 – 169.\n[95]G.- J. Hwang, H. Ohya, J. Membr. Sci., 1998, 140, 195 – 203.\n[96] J. H. Hao, C. Chen, L. Li, L. Yu, W. Jiang, Desalination, 2000, 129, 15 – 22.\n[97] PCT Patent: 01\/61776, 2001, Forschungszentrum Jülich GmbH, Germany.\n[98] US Patent Application: 2003\/0049509, 2003.\n[99] EP Patent: 1,256,142, 2001, Forschungszentrum Jülich GmbH, Germany.\n[100] US Patent: 5,569,559, 1996, CNAM Paris and Electricitie de France, France.\n[101] US Patent: 6,183,914, 2001, Reveo Inc., USA.\n[102] PCT Patent: 00\/16422, 2000, Reveo Inc., USA.\n[103] EP Patent: 1,116,291, 2000, Reveo Inc., USA.\n[104] PCT Patent: 02\/35633, 2002, ABB AB and Volvo, Sweden.\n[105] CN Patent: 1,402,370, 2003, University Wuhan, China.\n[106] US Patent: 5,656,386, 1997, Paul Scherrer Institut, Switzerland.\n[107] US Patent: 6,359,019, 2002, Ballard Power Systems Inc., Canada.\n[108] PCT Patent: 01\/58576, 2000, Ballard Power Systems Inc., Canada.\n[109] S. J. Lee, S. Mukerjee, J. McBreen, Y. W. Who, Y. T. Kho, T. H. Lee, Electrochim.\nActa, 1998, 24, 3693 – 3701.\n34\n[110] S. E. Iyuke, A. B. Mohammas, A. A. H. Kadhum, W. R. W. Daud, C. Rachid, J. Power\nSources, 2003, 114, 195 – 202.\n[111] S. C. Thomas, X. Ren, S. Gottesfeld, P. Zelenay, Electrochim. Acta, 2002, 47, 3741 –\n3748.\n[112] J. T. Mueller, P. M. Urban, J. Power Sources, 1998, 75, 139 – 143.\n[113] J. T. Müller, P. M. Urban, W. F. Hölderich, J. Power Sources, 1999, 84, 157 – 160.\n[114] J. Yu, B. Yi, D. Xing, F. Liu, Z. Shao, Y. Fu, H. Zhang, Phys. Chem. Chem. Phys.,\n2003, 5, 611 – 615.\n[115] G. Hübner, E. Roduner, J. Mater. Chem., 1999, 9, 409 – 418.\n[116] A. Panchenko, H. Dilger, E. Möller, T. Sixt, E. Roduner, J. Power Sources, 2004, 127,\n325 – 330.\n[117] S. Dalihn, “Student wants vodka to power your cell phone”,\nhttp:\/\/www.fuelcelltoday.com\/FuelCellToday\/IndustryInformation\/IndustryInformationextern\nal\/NewsDisplayArticle\/0,1602,4212,00.html (30th March 2004), Fuel Cell Today Website,\nprovided by St. Louis Post-Dispatch.\n[118] A. S. Aricò, P. Cretì, P. L. Antonucci, V. Antonucci, Electrochem. Solid State Lett.,\n1998, 1, 66 – 68.\n[119] W. Zhou, Z. Zhou, S. Song, W. Li, G. Sun, P. Tsiakaras, Q. Xin, Appl. Catal. B:\nEnviron., 2003, 46, 273 – 285.\n[120] W. J. Zhou, B. Zhou, W. Z. Li, Z. H. Zhou, S. Q. Song, G. Q. Song, Q. Xin, S.\nDouvartzides, M. Goula, P. Tsiakaras, J. Power Sources, 2004, 126, 16 – 22.\n[121] F. Vigier, C. Coutanceau, A. Perrard, E. M. Belgsir, C. Lamy, J. Appl. Electrochem.,\n2004, 34, 439 – 446.\n[122] S. S. Gupta, S. S. Mahapatra, J. Datta, J. Power Sources, 2004, 131, 169 – 174x.\n35\n[123] E. Peled, T. Duvdevani, A. Aharon, A. Melman, Electrochem. Solid State Lett., 2001,\n4, A38 – A41.\n[124] W. Hauffe, J. Heitbaum, Electrochim. Acta, 1978, 23, 299 - 303.\n[125] R. B. de Lima, V. Paganin, T. Iwasita, W. Vielstich, Electrochim. Acta, 2003, 49, 85 –\n91.\n[126] M. Umeda, H. Sugii, M. Mohamedi, I. Uchida, Electrochemistry, 2002, 70, 961 – 963.\n[127] Z. Qi, A. Kaufman, J. Power Sources, 2003, 118, 54 – 60.\n[128] Z. Qi, A. Kaufman, J. Power Sources, 2002, 112, 121 –129.\n[129] K. Yamada, K. Yasuda, N. Fujiwara, Z. Siroma, H. Tanaka, Y. Miyazaki, T.\nKobayashi, Electrochem. Commun., 2003, 5, 892 – 896.\n[130] S. C. Amendola, P. Onnerud, M. T. Kelly, P. J. Petillo, S. L. Sharp-Goldman, M.\nBinder, J. Power Sources, 1999, 84, 130 – 133.\n36\nTable 1: The standard thermodynamic voltages (Eo), energy densities (We), and maximum\nreversible efficiencies (\u0006rev) of hydrogen and selected pure alcohols when electrochemically\noxidised [9,10] under standard conditions. †2-propanol\nFigure 1: A schematic of (a) a proton-exchange membrane and (b) an alkaline membrane\nfuel cell both fuelled either with H2 gas or directly with methanol. The stoichiometric ratio of\nreactants and products are shown in each case.\nFigure 2: The graft penetration Raman-microscopy profile reproduced from reference [77],\nobtained with the radiation-grafting of vinylbenzyl chloride onto FEP fluoropolymer with a\ndegree of grafting of 25.6% (ratio of mass gain \/ initial mass). The graph shows the variation\nin the ratio of intensities of the poly(vinylbenzyl chloride) band at 1002 cm-1 and the FEP\nband at 387 cm-1, which indicates the level of grafting at each point (spaced at 1 µm)\nthroughout the thickness of the membrane.\nFigure 3: The long-term ex situ thermal stability profile of a prototype RG-AAEM (of initial\nIEC = 0.71 meq g-1) produced by monitoring the IEC of membrane samples over time when\nheated in deionised water at temperatures of 60°C (O) and 100°C (\u0002); reproduced from\nreference [77]. The initial sharp drops in IEC are due to un-grafted residual quaternised\npoly(vinylbenzyl trimethylammonium hydroxide) formed as a by-product, which has leached\nout the during heat treatment in water.\nScheme 1: The generic structure of per-fluorinated polymers such as Nafion®.\nScheme 2: The structure of polybenzimidazole (PBI)\n37\nScheme 3: The two alternative (and sometimes simultaneous) mechanisms of displacement\nof the trimethylammonium groups by hydroxide anions in AAEMs at elevated temperatures.\nScheme 4: The radiation-grafting of vinylbenzyl chloride onto FEP and subsequent\namination and alkali-exchange, yielding alkaline anion-exchange membranes (RG-AAEMs).\nScheme 5: A thermally stable alkaline anion-exchange resin based on those reported by\nTomoi et al. [81].\nScheme 6: Formation of AAEMs from polysulfone via a direct chloromethylation step.\nScheme 7: The benzyl CH\u0005 sites susceptible to peroxy-radical attack in poly(styrene sulfonic\nacid) (PSSA) and FEP-grafted poly(styrene sulfonic acid) (FEP-g-PSSA) at low pH.\n38\nFuel E° \/ V We \/ kW h kg-1 [kW h dm-3] \u0006rev\nHydrogen (H2) 1.23 39.0 [2.6 (liquid H2)] 0.83\nMethanol (CH3OH) 1.21 6.1 [4.8] 0.97\nEthanol (C2H5OH) 1.15 8.0 [6.3] 0.97\nPropanol (C3H7OH) 1.07 8.6 [6.8†] 0.93\nEthylene glycol (HOC2H4OH) 1.22 5.3 [5.9] 0.99\nTable 1\nFigure 1\n39\nFigure 2\nFigure 3\nScheme 1\n40\nScheme 2\nScheme 3\nScheme 4\n41\nScheme 5\nScheme 6\n42\nScheme 7\n"}