{"doi":"10.1080\/00207720802085138","coreId":"140988","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3094","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3094","10.1080\/00207720802085138"],"title":"Networked control systems and wireless sensor networks: theories and\napplications.","authors":["Yang, Shuang-Hua","Cao, Yi"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-11-01T00:00:00Z","abstract":"Abstract This special issue aims to provide innovative research work that has\nrecently been carried out in networked control and wireless sensor networks,\nincluding both theoretical developments, experimental and\/or application\nresearch. Wired and wireless networks have been used as a platform in the remote\nmonitoring and control. The applications cover a wide range from natural\nmonitoring to ambient awareness, from military to surveillance, and from\nindustrial plants to domestic home environments. This preface first introduces\nthe basic concepts of networked control and wireless sensor networks, then\npresents the challenges in these areas, and finally summarises the five papers\nincluded in the special issue","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140988.pdf","fullTextIdentifier":"https:\/\/dspace.lib.cranfield.ac.uk\/bitstream\/1826\/3094\/1\/Networked%20Control%20Systems-2008.pdf","pdfHashValue":"5bd7a6646b5d56fc1772c354d3b63884af6ce6c5","publisher":"Taylor &amp; Francis","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3094<\/identifier><datestamp>2011-11-13T23:25:32Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Networked control systems and wireless sensor networks: theories and\napplications.<\/dc:title><dc:creator>Yang, Shuang-Hua<\/dc:creator><dc:creator>Cao, Yi<\/dc:creator><dc:description>Abstract This special issue aims to provide innovative research work that has\nrecently been carried out in networked control and wireless sensor networks,\nincluding both theoretical developments, experimental and\/or application\nresearch. Wired and wireless networks have been used as a platform in the remote\nmonitoring and control. The applications cover a wide range from natural\nmonitoring to ambient awareness, from military to surveillance, and from\nindustrial plants to domestic home environments. This preface first introduces\nthe basic concepts of networked control and wireless sensor networks, then\npresents the challenges in these areas, and finally summarises the five papers\nincluded in the special issue.<\/dc:description><dc:publisher>Taylor &amp; Francis<\/dc:publisher><dc:date>2011-11-13T23:25:32Z<\/dc:date><dc:date>2011-11-13T23:25:32Z<\/dc:date><dc:date>2008-11-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Shuang-Hua Yang; Yi Cao; Networked control systems and wireless sensor networks:\ntheories and applications. International Journal of Systems Science, Volume 39,\nIssue 11, November 2008, pages 1041-1044<\/dc:identifier><dc:identifier>0020-7721<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1080\/00207720802085138<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/3094<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0020-7721","0020-7721"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article"],"fullText":"Guest Editorial \nNetworked Control Systems: Theories and Applications \n \nNetworked Control Systems (NCS) \nComputer communication network, particularly the Internet, is playing a role of ever-increasing importance in science, \ntechnology and our daily life. Communication network technologies are not only offering people a new way of living \nand working, but also bringing control engineers a ‘revolutionary control world’. It is because communication network \ntechnologies offer an unprecedented interconnection capability and ways of distributed collaborative work, and have a \ngreat potential to bring these advantages to the high-level control of plants. Introducing a communication network into \na control system is not a new concept in automation. Tele-operation might be the first control system involved with \ncomputer communication and has many applications in space and hazardous environment handling. Tele-operation is \nthe performance of remote work. The local site and remote site are geographically separated and linked through a \ncommunication channel. The modern communication channel is a computer communication network. Introducing a \ncommunication network as a component into a control loop, i.e. closing control loops over a communication network, \nhas generated a new type of control systems namely networked control system (NCS). Formally, a control system \ncommunicating with sensors and actuators over a communication network is called a NCS. Commercial distributed \ncontrol systems such as Honeywell TDC-3000 series belong to this category with a local communication network \ninvolved.  \n \nIn the traditional control system an operator gives a desired input to the controller. The controller outputs the control \nsignal to the actuator based on the difference between the desired input and the measured output. The actuator passes \nthe control action and influence on the plant. The measured output is fed back to the controller through the sensor. \nThere are three ways to introduce a communication network into the traditional control system. The straightforward \nway is to allow the operator located in the remote site to send control commands (desired input) to the controller \nlocated in the local site with the plant through the communication network. In order to monitor both the performance \nof the controller and the situation of the plant the measured output and\/or some visual information are required to \nfeedback to the operator at the remote site. Because the communication network is excluded from the closed loop and \nthe controller is located at the same location with the plant the network transmission delay will not affect the \nperformance of the control system. In some cases such as virtual control laboratory and remotely design of controller, \nit is necessary to locate the controller in the remote site, which is connected with the actuator and the sensor through \nthe communication network. The communication network has become part of the control system in this case. The \nnetwork transmission delay is introduced in both the actuator and sensor communication channels. The most practical \nNCS adopt a bilateral control structure, i.e. one controller located in the plant site, another in the operator site, and \nlinked through the communication network. For example, based on this control structure, robotic tele-operation uses \nthe controller in the plant site to control the slave device, and uses the one in the operator site to control the master \ndevice. Another example is the advance control for manufacturing processes. Usually the controller in the plant site is \nresponsible for the regulation of the normal situation. Once the performance of the controller is degraded due to the \ndisturbance from the environment or the change of the production situation, the controller in the operator site is put in \nuse for tuning the parameters and\/or changing the desired input for the controller in the plant site. \n \nInternet-based Control Systems (ICS) \nIn the last decade, the most successful network developed has been the Internet. It has made a significant impact on \nsociety through its use as a communication and data transfer mechanism. Many systems are being created all over the \nworld to implement Internet applications. Most of them are being focused on tele-robotic systems. The creation of \nvirtual laboratories over the Internet for education purpose is also one of the areas that are being currently developed. \nNormally we call the NCS involved with the Internet as Internet-based Control Systems (ICS). Research on ICS is \nfocusing on guiding the design process, dealing with Internet latency, and assuring the safety and security. ICS creates \na new window of opportunity for control engineers, allowing them to \n \n\u0083 Monitor the condition of machinery through the Internet; \n\u0083 Remotely control machine; \n\u0083 Collaborate with skilled operators situated in geographically diverse location; \n\u0083 Integrate client needs in production lines; \n\u0083 Manufacture on demand through the Internet; \n\u0083 Provide students in distance learning with experimental environments through real and virtual laboratories. \n \nIn addition, customers from every point in the Internet can directly monitor the conditions of manufacturing for \nmaking orders and building their confidence on the enterprise. It will bring the enterprise a huge economic benefit \nespecially in the current strong competition. \n  \nChallenges of NCS and ICS \nThere are a number of challenges, which NCS and ICS must face. Three major challenges are network latency, safety \nand security, and multiple user access. The data transmission latency is the main difference between NCS\/ICS and \nother tele-operation. Most tele-operating systems are based on private media, by which the transmission delay can be \nwell modelled. The Internet in contrast is a public and shared resource in which various end users transmit data via the \nnetwork simultaneously. The route for transmission between two end points in a wide area is not fixed for different \ntrails and the traffic jam may be caused when too many users traverse the same route simultaneously. The transmission \nlatency of any public network is difficult to model and predict.  \n \nAlthough introducing a public communication network such as the Internet into control systems has yielded benefits \nthrough the open architecture, there are various risks, which result from the application of network technologies. One \ntypical risk is an operational difficulties caused by attacking cyber terrorists. The Internet is always opened to hackers \nbecause of the open architecture. The hackers will try to cause failures by triggering from the Internet through the open \narchitectures. Therefore the scope of the ICS controlled plant safety cannot be limited within plant sites, because there \nis a possibility that the local control system would be accessed or falsified by outsiders through the Internet. On the \nother hand, authorized remote users may cause failures in the plant as well due to the Internet environment constraints.  \n \nCompared with the local control system, the special features of NCS and ICS are multiple users and the uncertainty \nabout who the users are, how many users there are, and where they are. In NCS and ICS, the operators cannot see each \nother, or may never have met. It is likely that multi-users may try to concurrently control a particular parameter. If \nauthorized users have the same opportunity to fully control the whole plant some problems could arise. Some \nmechanism is required to solve control conflict problems between multiple users, and coordinate their operations. \n \nAlthough the notion of NCS and ICS is still in its infancy to the academic control community, it is not new to industry. \nIt has been using in manufacturing plants, aircraft, automobiles, health care, disaster rescue, etc. A number of \nautomation & instrument companies have made their hardware and\/or software products Internet enabled. For \nexample, the latest version of the LabView produced by the National Instrument (NI) has the function of the remote \ncontrol over the Internet. Intuitive Technology Corp. provided web@aGlance for feeding real-time data to an Internet \nenabled Java graphics console. WinCC from SIEMENS is able to link local control systems with the Internet. Sun \nMicrosystems, Cyberonix, Foxboro, Valmet, Emerson and Holywell have made their products Internet enabled as \nwell.  \n \nHowever, if you ask the industry how to choose the NCS and ICS architecture, how to overcome the data transmission \ntime delay and data loss, and how to ensure the safety and security for the Internet enabled control systems, the answer \nyou received might be not so convincing. The reason is simple. These fundamental issues in the design of NCS and \nICS are currently under investigation in the academic control community and there are not available convincing \nanswers to them although they have captured the interest of many researchers worldwide.  \n \nContents of the Special Issue \nIn this issue we return to the submissions in response to our open call for papers. We received 12 articles for this call. \nAll of them were reviewed by experts in this field, and four of them have been selected for publication here, which \nspan different topics in NCS and address some of the fundamental issues presented above. One of them is \nrecommended for publication in an ordinary issue. \n \nThe first paper, by X. He et al., “Networked fault detection with random communication delays and packet Losses” \ndeals with the fault detection problem for a class of discrete-time networked systems with multiple state delays and \nunknown input. Two kinds of incomplete measurements, namely, measurements with random communication delays \nand measurements with stochastic packet losses, are simultaneously. Attention is focused on the design of a fault \ndetection filter. A sufficient condition for the existence of the desired fault detection filter is given.  \n \nThe second article, by G.P. Liu et al., “Networked predictive control of systems with random delay in signal \ntransmission channels” investigates the design and stability of NCS with random delay in signal transmission \nchannels. A networked predictive control strategy is proposed for discrete networked systems. The key parts of the \ncontrol strategy are the control prediction generator that provides a set of future control predictions and the network \ndelay compensator that compensates for the network transmission delay.  \n \nThe third article, by Y. Yang et al., “Design of a networked control system with random transmission delay and \nuncertain process parameters” discusses the compensation of the transmission delay in a NCS with a state feedback, \nwhich possesses a randomly varying transmission delay and uncertain process parameters. The compensation is \nimplemented by using a buffer in the actuator node and a state estimator in the controller node. A sufficient condition \nfor the stability of the NCS under the designed compensation is proposed as well. \n \nFinally, the article, by M. Deng and A. Inoue, “Network based nonlinear control for an aluminium plat thermal \nprocess” discusses an application of network based nonlinear control in an industrial process. This is done by using \noperator based robust right coprime factorisation approach and Bezout identify to guarantee robust stable network \ncontrol system, as well as an operator based tracking controller to ensure the controlled process output tracking the \ndesired reference input. \n \nIn summary, NCS and ICS are realistic and have a great potential to bring a huge economic benefit to industry. It can \nbe efficient, safe and secure if a control structure, a control strategy, and safety and security measures are properly \nchosen in the design of control systems. There exist exciting prospects for innovation and impact in this area. May this \nbrief foretaste encourage you to read further and contribute to the research and application of NCS and ICS.  \n \nFinally, as the guest editors of the special issue, we would like to thanks all the authors who submitted papers to this \nspecial issue for their valuable contribution. Most importantly, we would like to express our appreciation to all \nreviewers who spent their precious time to complete the paper review process within a limited time. Without their \neffort, we would not be able to produce such a quality issue. Last, but not least, we would like to thank the Editor-in-\nChief of International Journal of Systems Science, Professor Peter Fleming, for his full support and encouragement he \nhas given us in the preparation of the special issue. \n \n \nGuest Editors \n  \nProfessor Shuang-Hua Yang, Computer Science Department, Loughborough University, Loughborough, UK. Email: \ns.h.yang@lboro.ac.uk \n \nDr Yi Cao, School of Engineering, Cranfield University, Bedfordshire, UK. Email: y.cao@cranfield.ac.uk \n \n \n"}