{"doi":"10.1111\/j.1365-2966.2005.08731.x","coreId":"194817","oai":"oai:lra.le.ac.uk:2381\/787","identifiers":["oai:lra.le.ac.uk:2381\/787","10.1111\/j.1365-2966.2005.08731.x"],"title":"The unresolved hard X-ray background: the missing source population implied by the Chandra and XMM-Newton deep fields","authors":["Worsley, M. A.","Fabian, A. C.","Bauer, F. E.","Alexander, D. M.","Hasinger, G.","Mateos, S.","Brunner, H.","Brandt, W. N.","Schneider, D. P."],"enrichments":{"references":[{"id":44682254,"title":"in Ho L.C., ed., Coevolution of Black Holes and Galaxies. The Observatories of the Carnegie Institution of Washington,","authors":[],"date":"2003","doi":null,"raw":"Alexander D. M. et al., 2003, AJ, 126, 539 Baldi A., Molendi S., Comastri A., Fiore F., Matt G., Vignali C., 2002, ApJ, 564, 190 Barcons X., Mateos S., Ceballos M. T., 2000, MNRAS, 316, L13 Bauer F. E., Alexander D. M., Brandt W. N., Schneider D. P., Treister E., Hornschemeier A. E., Garmire G. P., 2004, AJ, 128, 2048 Campana S., Moretti A., Lazzati D., Tagliaferri G., 2001, ApJ, 560, L19 Comastri A., 2004, in Maiolino R., Mujica R., eds, Proc. Multiwavelength AGN Surveys. World Scientific, Singapore, p. 323 De Luca A., Molendi S., 2004, A&A, 419, 837 Fabian A. C., 2004, in Ho L.C., ed., Coevolution of Black Holes and Galaxies. The Observatories of the Carnegie Institution of Washington, Washington DC, p. 447 Fabian A. C., Iwasawa K., 1999, MNRAS, 303, L34 Fiore F. et al., 2003, A&A, 409, 79 Franceschini A., Braito V., Fadda D., 2002, MNRAS, 335, L51 Gandhi P., Fabian A. C., 2003, MNRAS, 339, 1095 Giacconi R., Gursky H., Paolini F. R., Rossi B. B., 1962, Phys. Rev. Lett., 9, 439 Giacconi R. et al., 2002, ApJS, 139, 369 Gilli R., Salvati M., Hasinger G., 2001, A&A, 366, 407 Gioia I. M., Henry J. P., Mullis C. R., Bo¨hringer H., Briel U. G., Voges W., Huchra J. P., 2003, ApJS, 149, 29 Gruber D. E., Matteson J. L., Peterson L. E., Jung G. V., 1999, ApJ, 520, Hasinger G., Burg R., Giacconi R., Schmidt M., Trumper J., Zamorani G., 1998, A&A, 329, 482 Hasinger G. et al., 2001, A&A, 365, L45 Lockman F. J., 2003, in Lieu R., ed., Soft X-ray Emission from Clusters of Galaxies and Related Phenomena. Kluwer, Dordrecht, in press (astroph\/0311386) Lockman F. J., Jahoda K., McCammon D., 1986, ApJ, 302, 432 Magdziarz P., Zdziarski A. A., 1995, MNRAS, 273, 837 Maiolino R., Salvati M., Bassani L., Dadina M., della Ceca R., Matt G., Risaliti G., Zamorani G., 1998, A&A, 338, 781 Maiolino R. et al., 2003, MNRAS, 344, L59 Malizia A., Bassani L., Stephen J. B., Di Cocco G., Fiore F., Dean A. J., 2003, ApJ, 589, L17 Marshall F. E., Boldt E. A., Holt S. S., Miller R. B., Mushotzky R. F., Rose L. A., Rothschild R. E., Serlemitsos P. J., 1980, ApJ, 235, 4 Mason K. O. et al., 2000, MNRAS, 311, 456 Moretti A., Lazzati D., Campana S., Tagliaferri G., 2002, ApJ, 570, 502 Moretti A., Campana S., Lazzati D., Tagliaferri G., 2003, ApJ, 588, 696 Morrison R., McCammon D., 1983, ApJ, 270, 119 Roberts T. P., Warwick R. S., 2001, in Giaconni R., Stella L., Serio S., eds, ASP Conf. Ser. Vol. 234, X-ray Astronomy 2000. Astron. Soc. Pac., San Francisco, p. 569 Rosati P. et al., 2002, ApJ, 566, 667 Schwope A. et al., 2000, Astron. Nachr., 321, 1 Shankar F., Salucci P., Granato G. L., De Zotti G., Danese L., 2004, MNRAS, 354, 1020 Stark A. A., Gammie C. F., Wilson R. W., Bally J., Linke R. A., Heiles C., Hurwitz M., 1992, ApJS, 79, 77 Streblyanska A., Bergeron J., Brunner H., Finoguenov A., Hasinger G., Mainieri V., 2004, Nucl. Phys. B, 132, 232 Treister E. et al., 2004, ApJ, 616, 123 Ueda Y., Takahashi T., Ishisaki Y., Ohashi T., Makishima K., 1999, ApJ, 524, L11 Ueda Y., Akiyama M., Ohta K., Miyaji T., 2003, ApJ, 598, 886 Worsley M. A., Fabian A. C., Barcons X., Mateos S., Hasinger G., Brunner H., 2004, MNRAS, 352, L28","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-03-11","abstract":"We extend our earlier work on X-ray source stacking in the deep XMM—Newton observation of the Lockman Hole, to the 2-Ms Chandra Deep Field North (CDF-N) and the 1-Ms Chandra Deep Field South (CDF-S). The XMM—Newton work showed the resolved fraction of the X-ray background (XRB) to be ∼80–100 per cent at ≲ 2 keV but this decreased to only ∼50 per cent above ∼8 keV. The CDF-N and CDF-S probe deeper, and are able to fill in some of the missing fraction in the 4–6 keV range, but the resolved fraction in the 6–8 keV band remains only ∼60 per cent, confirming the trend seen with XMM—Newton. The missing XRB component has a spectral shape that is consistent with a population of highly obscured active galactic nuclei (AGN) at redshifts ∼0.5–1.5 and with absorption column densities of ∼1023–1024 cm−2","downloadUrl":"http:\/\/hdl.handle.net\/2381\/787","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/787\/1\/MNRAS-2005-Worsley-1281-7.pdf","pdfHashValue":"9ef2db86ee8be95474e9065da054e54fc29485c2","publisher":"Oxford University Press (OUP), Royal Astronomical Society","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/787<\/identifier><datestamp>\n                2015-11-25T03:20:00Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nThe unresolved hard X-ray background: the missing source population implied by the Chandra and XMM-Newton deep fields<\/dc:title><dc:creator>\nWorsley, M. A.<\/dc:creator><dc:creator>\nFabian, A. C.<\/dc:creator><dc:creator>\nBauer, F. E.<\/dc:creator><dc:creator>\nAlexander, D. M.<\/dc:creator><dc:creator>\nHasinger, G.<\/dc:creator><dc:creator>\nMateos, S.<\/dc:creator><dc:creator>\nBrunner, H.<\/dc:creator><dc:creator>\nBrandt, W. N.<\/dc:creator><dc:creator>\nSchneider, D. P.<\/dc:creator><dc:subject>\nsurveys<\/dc:subject><dc:subject>\ngalaxies: active<\/dc:subject><dc:subject>\ndiffuse radiation<\/dc:subject><dc:subject>\nX-rays: diffuse background<\/dc:subject><dc:subject>\nX-rays: galaxies<\/dc:subject><dc:description>\nWe extend our earlier work on X-ray source stacking in the deep XMM—Newton observation of the Lockman Hole, to the 2-Ms Chandra Deep Field North (CDF-N) and the 1-Ms Chandra Deep Field South (CDF-S). The XMM—Newton work showed the resolved fraction of the X-ray background (XRB) to be ∼80–100 per cent at ≲ 2 keV but this decreased to only ∼50 per cent above ∼8 keV. The CDF-N and CDF-S probe deeper, and are able to fill in some of the missing fraction in the 4–6 keV range, but the resolved fraction in the 6–8 keV band remains only ∼60 per cent, confirming the trend seen with XMM—Newton. The missing XRB component has a spectral shape that is consistent with a population of highly obscured active galactic nuclei (AGN) at redshifts ∼0.5–1.5 and with absorption column densities of ∼1023–1024 cm−2.<\/dc:description><dc:date>\n2009-12-08T16:24:53Z<\/dc:date><dc:date>\n2009-12-08T16:24:53Z<\/dc:date><dc:date>\n2005-03-11<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nMonthly Notices of the Royal Astronomical Society, 2006, 357 (4), pp.1281-1287<\/dc:identifier><dc:identifier>\n0035-8711<\/dc:identifier><dc:identifier>\nhttp:\/\/mnras.oxfordjournals.org\/content\/357\/4\/1281<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/787<\/dc:identifier><dc:identifier>\n10.1111\/j.1365-2966.2005.08731.x<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:relation>\nX-ray and Observational Astronomy<\/dc:relation><dc:rights>\nThis article has been accepted for publication in Monthly Notices of the Royal Astronomical Society, Copyright 2005 RAS Published by Oxford University Press on behalf of the Royal Astronomical Society. All rights reserved.<\/dc:rights><dc:publisher>\nOxford University Press (OUP), Royal Astronomical Society<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["0035-8711","issn:0035-8711"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007","X-ray and Observational Astronomy"],"year":2005,"topics":["surveys","galaxies: active","diffuse radiation","X-rays: diffuse background","X-rays: galaxies"],"subject":["Article"],"fullText":"Mon. Not. R. Astron. Soc. 357, 1281–1287 (2005) doi:10.1111\/j.1365-2966.2005.08731.x\nThe unresolved hard X-ray background: the missing source population\nimplied by the Chandra and XMM–Newton deep fields\nM. A. Worsley,1\u0001 A. C. Fabian,1 F. E. Bauer,1 D. M. Alexander,1 G. Hasinger,2\nS. Mateos,3 H. Brunner,2 W. N. Brandt4 and D. P. Schneider4\n1Institute of Astronomy, Madingley Road, Cambridge CB3 0HA\n2Max-Planck-Institut fu¨r extraterrestrische Physik, Postfach 1319, D-85740 Garching, Germany\n3Instituto de Fı´sica de Cantabria (CSIC-UC), 39005 Santander, Spain\n4Department of Astronomy and Astrophysics, 525 Davey Laboratory, Pennsylvania State University, University Park, PA 16802, USA\nAccepted 2004 December 9. Received 2004 December 8; in original form 2004 September 30\nABSTRACT\nWe extend our earlier work on X-ray source stacking in the deep XMM–Newton observation of\nthe Lockman Hole, to the 2-Ms Chandra Deep Field North (CDF-N) and the 1-Ms Chandra\nDeep Field South (CDF-S). The XMM–Newton work showed the resolved fraction of the X-ray\nbackground (XRB) to be ∼80–100 per cent at\u0001 2 keV but this decreased to only ∼50 per cent\nabove ∼8 keV. The CDF-N and CDF-S probe deeper, and are able to fill in some of the missing\nfraction in the 4–6 keV range, but the resolved fraction in the 6–8 keV band remains only\n∼60 per cent, confirming the trend seen with XMM–Newton. The missing XRB component\nhas a spectral shape that is consistent with a population of highly obscured active galactic nuclei\n(AGN) at redshifts ∼0.5–1.5 and with absorption column densities of ∼1023–1024 cm−2.\nKey words: surveys – galaxies: active – diffuse radiation – X-rays: diffuse background –\nX-rays: galaxies.\n1 I N T RO D U C T I O N\nThe nature of the X-ray background (XRB) has been a subject of\ncontention since its discovery 40 years ago (Giacconi et al. 1962).\nIt is now clear that that at energies above ∼1 keV the background\nis made up of the summed emission from point sources, princi-\npally active galactic nuclei (AGN). The spectrum measured by the\nHEAO satellite (Marshall et al. 1980) is similar in shape to 40 keV\nbremsstrahlung and is well described by a \u0002 = 1.4 power law from\n∼1 up to ∼15 keV, where it starts to flatten off before peaking in\nνI ν at ∼30 keV. Below ∼1 keV the background is dominated by\ndiffuse Galactic and local bubble emission; the purely extragalactic\ncomponent has not been well determined.\nResolving the XRB into discrete sources is crucial to understand-\ning the nature of the AGN and galaxy populations in the Universe.\nIt also allows us to place limits on the residual XRB emission\nwhich can be attributed to other processes, including that from\ntruly diffuse extragalactic emission. A significant amount (∼70–\n80 per cent) of the 0.5–2 keV XRB was resolved into point sources\nby ROSAT (Hasinger et al. 1998), but progress at harder energies\nhas required the improved sensitivity and spatial resolution of the\nChandra and XMM–Newton observatories. XMM–Newton was able\n\u0001E-mail: maw@ast.cam.ac.uk\nto resolve some ∼60 per cent of the 5–10 keV background in a\ndeep survey of the Lockman Hole, reaching a limiting flux of ∼3 ×\n10−15 erg cm−2s−1 in this band (Hasinger et al. 2001). The Chandra\nDeep Field North (CDF-N) and Chandra Deep Field South (CDF-S)\nprobe down to ∼1.4–2.8 × 10−16 erg cm−2s−1 (over 2–8 keV) and\nresolve ∼70–90 per cent of the background in this broad, hard band\n(Giacconi et al. 2002; Moretti et al. 2002; Alexander et al. 2003;\nand references therein).\nThe large resolved fractions found in the deep surveys appear\nto solve the problem of the origin of the XRB in terms of known\nsources; an extrapolation of the 0.5–2 keV band log N–log S dis-\ntribution points to an integrated flux consistent with the full XRB\nlevel. The substantial resolved fraction in the broad 2–10 keV band\nis not entirely consistent with this picture; a similar extrapolation\nof the 2–10 keV log N–log S distribution is, at most, only able to ac-\ncount for some 93 per cent of the total XRB and is only marginally\nconsistent with complete resolution (Moretti et al. 2003). The most\nrecent XRB intensity measurement by De Luca & Molendi (2004)\nwould make the fraction only ∼80 per cent.\nTo investigate in detail the resolved XRB fraction as a function of\nenergy, Worsley et al. (2004) carried out a source-stacking analysis\nof ∼700 ks of accumulated XMM–Newton exposure in the Lock-\nman Hole. Source photometry was used to determine the resolved\nfraction in a number of narrow energy bands from 0.2 to 12 keV.\nThe authors found the resolved fraction to be \u000280 per cent below\n2 keV, but that this decreased significantly at higher energies, falling\nC© 2005 RAS\n at :: on N\novem\nber 24, 2015\nhttp:\/\/m\nnras.oxfordjournals.org\/\nD\now\nnloaded from\n \n1282 M. A. Worsley et al.\nto only ∼50 per cent above ∼8 keV. The failure to account for XRB\nin the harder bands, along with recent indications of steepening of\nX-ray source number counts at low fluxes, suggest that there may\nbe an as yet undetected population of highly obscured sources, such\nas the heavily absorbed AGN predicted in recent synthesis models\n(e.g. Gilli, Salvati & Hasinger 2001; Franceschini, Braito & Fadda\n2002; Gandhi & Fabian 2003; Ueda et al. 2003; Comastri 2004).\nAlthough Chandra has low effective area at energies exceeding\n7 keV, the Chandra Deep Fields (CDFs) probe to fainter flux lim-\nits than the XMM–Newton Lockman Hole observation. We use the\nCDFs to assess whether the contribution of the fainter sources found\nby Chandra is able to resolve the discrepancy and account for the\nmissing background fraction. Using a similar photometric analysis,\nwe sum the flux from resolved CDF sources in a number of narrow\nenergy bands to determine the resolved fraction of the XRB. We\nalso present a re-analysis of the XMM–Newton Lockman Hole ob-\nservation (Worsley et al. 2004), carried out in identical energy bands\nfor direct comparison with the CDFs. In both cases, we attempt to\nquantify and correct for field-to-field variations and the missing flux,\nwhich would arise from the very bright sources that are not sampled\nin these deep, pencil-beam surveys.\n2 S O U R C E D E T E C T I O N A N D P H OTO M E T RY\n2.1 Chandra deep field observations\nChandra has performed the two deepest ever surveys of the X-\nray Universe: the 2-Ms CDF-N (Alexander et al. 2003) and the\n1-Ms CDF-S (Giacconi et al. 2002). The CDF-N probes down to\n∼2.5 × 10−17 and ∼1.4 × 10−16 erg cm−2s−1 in the 0.5–2 and 2–\n8 keV bands, respectively. Although the CDF-S only reaches down\nto equivalent limits [at signal-to-noise ratio (S\/N ) = 3] of ∼5.2 ×\n10−17 and ∼2.8 × 10−16 erg cm−2s−1, these are both well beyond\nthe 10−14 erg cm−2s−1 break in the log N – log S distribution (see\ne.g. Hasinger et al. 1998; Campana et al. 2001).\nFor both the CDF-N and CDF-S, we use the source catalogues\nand photometry from Alexander et al. (2003), who describe their\napproach thoroughly; we include a brief summary here for com-\npleteness. The 2-Ms CDF-N main point-source catalogue contains\na total of 503 sources and covers a total solid angle of 447.8 arcmin2.\nConservative estimates place the number of falsely detected sources\nto be as high as 20–30, but the true number is probably considerably\nlower (see section 2.3 in Alexander et al. 2003). The CDF-S has 326\nsources from a total field of 391.3 arcmin2.\nThe local background estimate for each source was determined\nin an annulus surrounding the source-extraction region. The mean\nnumber of background counts was computed assuming a Poisson\ndistribution, as n1\/n0; where n1 is the number of pixels contain-\ning a single count and n0 is the number containing no counts. For\nsources with less than 103 counts in the full 0.5–8 keV band, source-\nextraction apertures containing 90–95 per cent of the encircled\nenergy fraction (EEF) were chosen (with the extracted counts cor-\nrected up to 100 per cent). For sources brighter than 103 counts,\nextraction apertures of twice this size were chosen; the EEF in these\ncases is close to 100 per cent. The EEF corrections used to cor-\nrect from aperture counts to total counts were calculated from the\nChandra point spread function (PSF) determined using the Chandra\nX-ray Center MKPSF software (refer to Alexander et al. 2003).\nFor all sources with a sufficient number of counts, the ratio of\ncounts between the 2–8 keV and 0.5–2 keV bands was used to de-\ntermine an effective spectral index for a power-law model, allowing\nfor Galactic absorption of (1.3 ± 0.4) × 1020 and (8.8 ± 4.0) ×\n1019 cm−2 for the CDF-N and CDF-S, respectively (Lockman 2003;\nStark et al. 1992). For sources with an insufficient number of counts,\nthe photon index is fixed at \u0002 = 1.4 (the approximate average for all\nthe sources and the slope of the XRB). The flux for each source was\ncalculated in a number of photometric bands, regardless of whether\nor not the source is actually detected in each of the bands. In each\ncase, the counts-to-flux conversion is appropriate to the spectral in-\ndex of the source. The photometric bands used were 0.5–1, 1–2,\n2–4, 4–6 and 6–8 keV.\nPrior to our stacking analysis (described in Section 3.1), we\napplied the systematic flux correction determined by Bauer et al.\n(2004) for both the CDFs (see section 3 and fig. 2 of their paper).\nThese take into account Eddington bias as well as some further\naperture\/photometry effects that were not considered originally. The\ncorrection is negligible except in the harder (>2 keV) bands, which\neach see an increase in total resolved flux of ∼2–5 per cent.\n2.2 XMM–Newton Lockman Hole observations\nXMM–Newton, whilst unable to match the X-ray resolution and\nultimate sensitivity of Chandra, has the critical advantage of sensi-\ntivity in the 8–12 keV regime. It was this capability, put into effect\nwith ∼700 ks of deep observations in the Lockman Hole (XMM-\nLockman Hole, XMM-LH), that prompted Worsley et al. (2004) to\ninvestigate the resolved fraction of the XRB with energy.\nThe 17 different individual observations that comprise the XMM-\nLH were combined and source detection carried out using sliding-\nbox detection followed by maximum-likelihood PSF fitting. Vi-\nsual inspection of the source candidates was used to exclude\nspurious detections. The analysis was restricted to the central\n314.2-arcmin2 region of the field with the highest exposure time\nand lowest background level.\nIn a similar approach to that taken in the CDFs, simple aperture\nphotometry was performed on the exposure-corrected images in a\nnumber of narrow energy bands. A more detailed description of the\nfollowing is given by Worsley et al. (2004). For each source, the total\ncount rates were extracted in both a circular aperture and a surround-\ning annulus. These were then used to calculate the background-\ncorrected source count rate, taking into account corrections for the\nEEF. These corrections were calculated by integrating an analytical\nmodel of the XMM–Newton PSF given in XMM–Newton Science\nOperations Centre calibration documents (refer to Worsley et al.\n2004). Count-rate extraction apertures\/annuli were chosen to the\nmaximize the signal-to-noise ratio.\nCount-rate–to–flux conversion factors were computed assuming\na fixed spectral slope of \u0002 = 1.4 and Galactic absorption with a\ncolumn density of 5 × 1019 cm−2 (Lockman, Jahoda & McCammon\n1986). This is not as rigorous as the approach taken in the CDFs\nwhere counts-to-flux energy conversion factors (ECFs) appropriate\nto the spectral slope of the source were used, but the larger count-rate\nerrors for the XMM–Newton sources prohibit this and the assumption\nof a fixed \u0002 = 1.4 is more reliable. Furthermore, the dependence of\nthe ECFs on the spectral shape of a source is only weak because of\nthe use of narrow energy bands. The ECFs of all but the 0.2–0.5 keV\nband vary by \u0001 5 per cent over the range \u0002 = 0.9–1.9 (the 0.2–\n0.5 keV band has a ∼15 per cent variation). The resultant uncertainty\nin the resolved total flux from the source population is small in\ncomparison with other errors.\nIn order to allow easy comparison with the Chandra data, the\nXMM-LH analysis was repeated using the same energy bands as in\nthe CDFs with additional bands covering 0.2–0.5 and 8–12 keV. The\nre-processing of the data took advantage of the latest releases of the\nC© 2005 RAS, MNRAS 357, 1281–1287\n at :: on N\novem\nber 24, 2015\nhttp:\/\/m\nnras.oxfordjournals.org\/\nD\now\nnloaded from\n \nThe unresolved hard X-ray background 1283\nTable 1. Parameters used in the XMM-Lockman Hole (XMM-LH) photometric analysis. For each energy band, the cut-out radii are quoted: r1 is the radius\nof the source count-rate extraction aperture; r2 and r3 are the inner and out radii of the background count-rate extraction annulus; refer to sections 2.3–2.4 and\nfig. 1 in Worsley et al. (2004) for further details. Also quoted are the count-rate to flux energy conversion factors calculated for each band following the method\ndescribed in section 2.5 of that paper.\nEnergy band Cut-out radii (arcsec) Weighted energy conversion factors\n(keV) PN MOS (1011 count cm2erg−1)\nr1 r2 r3 r1 r2 r3 PN MOS-1 MOS-2\n0.2–0.5 14 30 40 12 25 35 7.052 1.263 1.242\n0.5–1 15 30 40 13 25 35 7.375 1.757 1.735\n1–2 14 30 40 12 25 35 5.631 1.994 1.977\n2–4 11 30 40 10 25 35 1.960 0.7650 0.7664\n4–6 10 25 35 8 25 35 1.143 0.4017 0.4207\n6–8 8 20 30 6 20 30 0.6694 0.1347 0.1411\n8–12 6 15 25 5 15 25 0.1908 0.02059 0.02220\nXMM–Newton SCIENCE ANALYSIS SYSTEM (SAS) V6.0.0 and the X-ray\nspectral analysis package XSPEC V11.3.1. Additionally, rather than\nuse the original source list (from Worsley et al. 2004), of 126 ob-\njects, we took advantage of the complete (and more rigorously com-\npiled) Lockman Hole source catalogue of Mateos et al. (in prepara-\ntion), which contains 156 sources in the same 314.2-arcmin2 region.\nTable 1 gives the values of various important parameters used in the\nre-processing of the data.\n3 R E S U LT S\n3.1 Resolving the X-ray background\nThe total resolved flux in each energy band was calculated by sum-\nming the measured flux for each source. Every source is included\nregardless of whether or not it is detected in the band. This was\ndone for the CDF-N, CDF-S and each of the three XMM–Newton\ninstruments in the XMM-LH. Appropriate corrections for Galactic\nabsorption were made. These correction factors are: 15 per cent\nin the XMM-LH 0.2–0.5 keV band; 2.6, 7.2 and 4.8 per cent in the\n0.5–1 keV band for the XMM-LH, CDF-N and CDF-S, respectively;\nand \u00011 per cent for all of the harder bands.\nIn order to calculate the resolved intensity, the flux from each\nsource must be divided by a solid angle on the sky. In the case of the\nXMM-LH, the sensitivity is approximately constant over the region\nconsidered here and we simply take the solid angle to be a constant\n314.2 arcmin2. The CDFs, however, show a substantial increase in\nsensitivity towards the centre of the fields. The total solid angles of\n447.8 and 391.3 arcmin2 are only applicable to the brightest sources,\nwhereas fainter sources are only detectable over a fraction of the field\nand the actual solid angles are smaller. Fig. 19 in Alexander et al.\n(2003) shows the solid angle as a function of 0.5-8 keV source flux in\nthe CDF-N. We use this function (and its equivalent for the CDF-S)\nto provide the appropriate solid angle when converting each source\nflux to an intensity. We impose a minimum effective area of 10 per\ncent of the total to avoid catastrophically magnifying the errors in\nthe fluxes from the faintest sources.\nFig. 1(a) shows the resolved XRB fraction obtained in each energy\nband. The fractions are calculated using the most recent estimates\nof the total extragalactic XRB spectrum. For the 1–8 keV band,\nthis is the power-law model of De Luca & Molendi (2004), with a\nspectral slope of \u0002 = 1.41 and 1 keV normalization of 11.6 keV\ncm−2s−1sr−1keV−1. Above 8 keV, the background spectrum starts\nto turn over slightly and so here we use the analytical model of\nGruber et al. (1999), which takes the downturn into account, but\nFigure 1. The fraction of the total extragalactic XRB intensity resolved by\nsimply summing the fluxes of sources in the CDFs and XMM-LH. CDF-N and\nCDF-S data are shown as the black and grey crosses respectively; XMM-LH\nPN camera data are shown as dashed diamonds, and both the MOS-1 (Metal\nOxide Semiconductor) and MOS-2 camera data are both shown using dotted\ndiamonds. The three panels show: (a) the result of summing all sources; (b)\nthe result of excluding sources brighter than 5 × 10−14 erg cm−2s−1 in 0.5–\n8 keV flux; and (c) the result of additionally excluding sources fainter than\n10−16 erg cm−2s−1 in 0.5–8 keV flux.\nC© 2005 RAS, MNRAS 357, 1281–1287\n at :: on N\novem\nber 24, 2015\nhttp:\/\/m\nnras.oxfordjournals.org\/\nD\now\nnloaded from\n \n1284 M. A. Worsley et al.\nrenormalized to the same 2–8 keV XRB flux as found by De Luca\n& Molendi (2004). The spectrum of the purely extragalactic back-\nground is not well constrained below 1 keV because it is difficult to\nseparate from the bright, diffuse, Galactic component. There is evi-\ndence to suggest that the spectrum of the background steepens below\n∼1 keV; Roberts & Warwick (2001) have combined the results of\nseveral X-ray shadowing measurements and report a background\nintensity of 26.6 ± 4.8 keV cm−2 s−1 sr−1keV−1 at 0.25 keV. A\npower-law fit between this value and the De Luca & Molendi (2004)\nintensity at 1 keV gives a spectral slope of \u0002 ∼ 1.5–1.7, and we use\nthis to estimate the background levels in the 0.2–0.5 and 0.5–1 keV\nbands.\nThe stacking of source fluxes reveals a decline in the resolved\nXRB fraction as a function of energy. Below ∼2 keV, the data di-\nverge somewhat, presumably as a result of field-to-field variations.\nSuch variations arise through the cosmic variance in the actual XRB\nnormalization in different regions of the sky, along with the statisti-\ncal noise, which is a consequence of sampling a discrete population\nof sources in a small solid angle. Fig. 1(b) shows the result of ex-\ncluding sources with a 0.5–8 keV band flux >5 × 10−14 erg cm−2\ns−1 from the sum. While only a small number of sources have been\nremoved (from 3–7 out of 156–503), the variation at the softest en-\nergies has been reduced considerably. This demonstrates that a large\namount of the variation <2 keV is the result of soft, bright sources.\nThe XMM-LH data now show a slight decline in the resolved frac-\ntion whilst the CDFs show a slight rise, although both CDFs show\nsignificant drops in the 6–8 keV band. This difference between the\nXMM–Newton and Chandra fractions in the 4–6 keV band is the re-\nsult of sensitivity: the CDFs probe down to fainter fluxes where the\ntypical source spectrum is harder than \u0002 = 1.4 (see e.g. Alexander\net al. 2003; Streblyanska et al. 2004). If the source lists are further\nrestricted to remove the faint sources seen only by Chandra, with a\nminimum flux requirement of 10−16 erg cm−2 s−1, then the spectral\nshapes of the sources are similar for both XMM-LH and CDF, see\nFig. 1(c). Of course, there will always remain differences between\ndata sets: Barcons, Mateos & Ceballos (2000) estimate the cosmic\nvariation in XRB normalization to be of order ∼10 per cent for fields\nof \u00011 deg2.\n3.2 Correcting for the bright-end population\nThe brightest sources in the catalogues have 0.5–8 keV fluxes up to\n∼(1–3) × 10−13 erg cm−2 s−1. There is a non-negligible contribution\nto the whole-sky background by sources brighter than this; in fact,\naround 15–20 per cent of the total XRB is the result of bright, rare\nsources that are not sampled in pencil-beam surveys. A bright-end\ncorrection is necessary to recover this missing intensity.\nIn order to remove some of the bright-end variation, we truncate\nthe source lists above 5 × 10−14 erg cm−2 s−1(0.5–8 keV band).\nThis is the same truncation as used in Fig. 1(b) and corresponds to\nremoving sources that only occur with densities of ∼ a few in the\n∼0.1-deg2 CDF and XMM-LH fields. With the bright-end sources\nremoved, the expected missing flux can be estimated by integrating\nknown log N–log S distributions. These are available in the broad\n0.5–2 and 2–10 keV bands but not in the narrow bands used in this\nwork. In order to calculate the contribution in a narrow band, it is\nnecessary to assume the spectral shape of the sources. Here, we\nassume a power-law spectrum but the typical spectral slope of such\na power-law can be a strong function of source flux.\nA number of studies point to significant evolution of the spectral\nshape with flux (Ueda et al. 1999; Alexander et al. 2003; Fiore\net al. 2003; Streblyanska et al. 2004), with sources brighter than\n∼10−14 erg cm−2 s−1 having typical spectral slopes much softer\nthan the \u0002 = 1.4 of the total background. Shallow surveys (see\ne.g. Ueda et al. 1999) find that the brightest sources, with X-ray\nfluxes \u000210−13 erg cm−2 s−1, have spectral slopes of \u0002 ∼ 1.8–2.2.\nStreblyanska et al. (2004) fitted a power-law spectrum to the stacked\nspectra of sources of a 500-ks XMM–Newton observation in the\nCDF-S. Fitting the hard band (1–8 keV) with a power law reveals\na strong correlation between spectral slope and flux, with \u0002 ∼ 1.8\nfor ∼10−13 erg cm−2 s−1 (2–10 keV flux) decreasing to \u0002 ∼ 1.5 at\n∼10−14 erg cm−2 s−1 and \u0002 ∼ 1.2 at ∼10−15 erg cm−2 s−1. Alexander\net al. (2003) see sources with \u0002 ∼ 1 at fluxes \u000110−16 erg cm−2 s−1\nin the CDF-N.\nWe haven taken a linear fit to the evolution of spectral index with\nflux based on the relationship as observed by Streblyanska et al.\n(2004), although we conservatively impose a maximum value of\n\u0002 = 2. Such a model is only an approximation to the actual depen-\ndence of spectral shape on flux. It does, however, follow the trends\nobserved by Streblyanska et al. (2004) in the CDF-S (using both\nXMM–Newton and Chandra observations) and Ueda et al. (1999)\nusing the ASCA Medium-Sensitivity Survey and, whilst crude, it is\nimportant to take into account the fact that the bright-end correction\nis the result of sources that are significantly softer than those that\nwe have already stacked. Given our model, the bright-source con-\ntribution in each of the 2–4, 4–6, 6–8 and 8–12 keV narrow bands\ncan then be calculated, using an appropriate spectral index at each\nsource flux, from the 2–10 keV flux contribution obtained by inte-\ngrating the Moretti et al. (2003) hard band log N–log S distribution\n(the most complete published to date).\nCorrecting the soft bands (0.2–0.5, 0.5–1 and 1–2 keV) is more\ncomplex, because the shape of the background is not well con-\nstrained. The source stacking approach of Streblyanska et al. (2004)\nin the 0.4–8 keV range revealed a systematically softer spectrum\nthan that seen for 1–8 keV (an increase in \u0002 of ∼0.1). No stud-\nies cover the 0.5–2 keV range ideally required for the soft band\nbright-end correction so we take the same linear fit to the evolu-\ntion of spectral index as used in the hard band, but with an increase\nin \u0002 by 0.1. We use the Moretti et al. (2003) 0.5–2 keV soft band\nlog N – log S distribution. There is now some evidence to suggest\nthat the Moretti et al. (2003) log N – log S slope is too steep at\nthe bright end compared with results from the RIXOS,1 RBS2 and\nNEPS3 surveys (Mason et al. 2000; Schwope et al. 2000; Gioia\net al. 2003); thus, our bright-end correction in the soft band could\npotentially be an underestimate.\nFig. 2 shows the bright-end corrected resolved background frac-\ntions. The XMM-LH, CDF-S and CDF-N are all consistent with a\nsimilar resolved fraction of ∼70–90 per cent up to ∼4 keV. The dif-\nferences are of order ∼10 per cent, which is not inconsistent with\nwhat would be expected from cosmic variance between the fields\n(see Barcons et al. 2000). XMM–Newton sees a drop in the resolved\nfraction in the 4–6 keV band, whereas the CDFs are still consistent\nwith a high resolved fraction of ∼80–90 per cent. This difference\nis a result of the faint, hard sources, which are not detected in the\nXMM-LH; if these sources are removed from the Chandra data then\nall three data sets show agreement in the 4–6 keV fraction. Most\nimportantly, the picture is different at high energies; XMM–Newton\nand both CDFs only resolve ∼50–70 per cent of the background\nin the 6–8 keV band, much less than the fraction at lower energies.\nThe 8–12 keV band, as probed by XMM–Newton, is only ∼40–\n60 per cent resolved.\n1 ROSAT International X-Ray\/Optical Survey.\n2 ROSAT Bright Survey.\n3 ROSAT North Elliptical Pole Survey.\nC© 2005 RAS, MNRAS 357, 1281–1287\n at :: on N\novem\nber 24, 2015\nhttp:\/\/m\nnras.oxfordjournals.org\/\nD\now\nnloaded from\n \nThe unresolved hard X-ray background 1285\nFigure 2. The upper panel shows the total extragalactic XRB (thick black\ncrosses) along with the intensity resolved into sources in the CDF-N (black\ncrosses), CDF-S (grey crosses) and combined PN\/MOS-1\/MOS-2 results in\nthe XMM-LH (black diamonds). The resolved intensities have been corrected\nfor the bright-end population by removing all sources with 0.5–8 keV flux\n>5 × 10−14 erg cm−2 s−1 and then adding the missing flux from sources\nbrighter than this by integrating log N – log S distributions (refer to Section\n3.2). The lower panel shows the resolved intensities as fractions of the total\nextragalactic XRB in each energy band.\nWe find the total resolved fluxes in the 0.5–2 and 2–8 keV bands\nto be (6.9 ± 0.2) × 10−12 and (1.5 ± 0.1) × 10−11 erg cm−2 s−1\nfor the CDF-N. These compare well to the (6.7 ± 0.3) × 10−12 and\n(1.66 ± 0.05) × 10−11 erg cm−2 s−1 reported in Bauer et al. (2004)\nfrom a detailed analysis of the combined CDF number counts.\nThe fluxes can also be compared to the (7.1 ± 0.3) × 10−12 and\n(1.43 ± 0.08) × 10−11 erg cm−2 s−1 determined integrating the\nlog N – log S curves of Moretti et al. (2003; although note that these\ndo not contain the 2-Ms extension to the original 1-Ms CDF-N).\nWe find the total 0.5–2 and 2–8 keV resolved fractions are ∼85\nand ∼80 per cent for the CDF-N (using the total XRB spectrum we\ndescribe in Section 3.1). Such high fractions are often used to claim\nthat the XRB is almost completely resolved into discrete sources\neven in the broad 2–10 keV band. Our results suggest that stating a\nresolved fraction in this manner is misleading, because it is the high\nresolved fractions in the 2–6 keV range that are dominating the total,\nwhilst the resolved fraction beyond 6 keV is significantly lower.\n4 D I S C U S S I O N\nThree independent observations now point to a significant reduction\nin the resolved fraction of the XRB at the hardest energies. XMM–\nFigure 3. Contour plot of fits to the spectral shape of the missing XRB\nspectrum for the XMM-LH data in the 2–12 keV range. 68, 90 and 95 per\ncent confidence contours are shown. The best-fitting point is indicated at z\n∼ 0.8 and N H ∼ 4.5 × 1023 cm−2. The grey contours indicate the maxi-\nmum, unobscured, rest-frame 2–10 keV luminosity (erg s−1) of the source\npopulation required such that the sources remain below the sensitivity limit\n(estimated at ∼1.5 × 10−15 erg cm−2 s−1 in a 4–8 keV band).\nNewton starts to see a downturn above ∼4 keV, whilst Chandra is\nsensitive to the fainter, harder sources, which fill in some of the\nmissing fraction and push the downturn to energies \u00026 keV. The\nmissing fraction has the spectral signature of highly obscured AGN\nand could be evidence of the large population of heavily absorbed\nobjects that are thought to account for the 30 keV peak of XRB\nintensity (see e.g. Maiolino et al. 1998, 2003).\nTo quantify the possible nature of an undetected population, we\nmodelled the spectral shape of the unresolved background as a func-\ntion of redshift and intrinsic absorption column density. A grid of\nspectra was built in the range z = 0.1–3 and N H = 1022–1025 cm−2.\nXSPEC V11.3.1 was used to generate the spectra using a PEXRAV model\n(Magdziarz & Zdziarski 1995), with a \u0002 = 2 power law and an\nR = 1 reflection component (see e.g. Malizia et al. 2003), multiplied\nby ZWABS (Morrison & McCammon 1983) photoelectric absorption\nat the source redshift.\nWe computed the goodness-of-fit between each model spectrum\nand the residual XRB spectrum (i.e. the difference between the re-\nsolved and total backgrounds). Fig. 3 shows the confidence contours\nin the redshift and absorption column density required to account for\nthe shape of the missing AGN population for the XMM-LH. This is\na rather simplistic approximation to the spectra of highly obscured\nsources; specifically, we neglect the effects of iron K emission and\nscattered-flux components, as well as assuming that the missing\nsources occur at a fixed redshift and with a fixed absorption col-\numn density. Nevertheless, some generalized conclusions about the\nnature of the unresolved population can be drawn.\nThe XMM-LH, CDF-N and CDF-S all show similar contour dia-\ngrams for the characteristics of the missing source population. The\nXMM-LH data, which extends to the 8–12 keV band, shows the most\nconstrained set of contours although the degeneracy between low\nz\/low NH and high z\/high NH is clear. The best-fitting point is at\nz ∼ 0.8 and N H ∼ 4.5 × 1023 cm−2. For the CDF-N and CDF-S, the\nlack of data above 8 keV results in much more relaxed contours al-\nthough there is again some preference for sources at z ∼ 0.5–1.5 with\nN H ∼ 1023–1024 cm−2. Fig. 4 shows the total and resolved levels of\nthe XRB in ν I ν as well as the intensity that would be contributed\nby the best-fitting model of an obscured population.\nC© 2005 RAS, MNRAS 357, 1281–1287\n at :: on N\novem\nber 24, 2015\nhttp:\/\/m\nnras.oxfordjournals.org\/\nD\now\nnloaded from\n \n1286 M. A. Worsley et al.\nFigure 4. The upper curve shows the total extragalactic XRB (as described\nin Section 3.1) in ν I ν . The intensity resolved into sources in the CDF-N,\nCDF-S and XMM-LH are shown as black crosses, grey crosses and black\ndiamonds, respectively. The lower curve shows the spectrum of the best-\nfitting model for the missing AGN population with z = 0.8 and N H = 4.5 ×\n1023 cm−2. Sharp features (such as that due to iron at 4 keV), is a consequence\nof our assumption that the missing population is composed entirely of AGN\nwith this spectrum. In reality the missing population will be mixture of\nsources at different redshifts and with different levels of absorption; any\nsharp features will be smeared out.\nWe conclude that whilst the data are unable to constrain tightly\nthe spectral shape of the missing XRB sources, the most plausible\npopulation would seem to be of objects at redshifts of ∼0.5–1.5, with\nunabsorbed luminosities of\u0001 5 × 1043 erg s−1, but heavily obscured\nby column densities of ∼1023–1024 cm−2. The CDFs probe deeper\nthan the XMM-LH but still fail to detect the missing sources in the\n2–4 keV band, or our stacking analysis would have revealed the\nhigher energy emission. Any soft starburst or scattered emission in\nthese objects must be small and this may suggest a high covering\nfraction for the absorption.\nIn order to provide the missing fraction of the hard XRB, these\nsources must have a density on the sky of\u00022800 deg−2. This would\ncorrespond to a lower limit of around 350 undetected AGN in the\nCDF-N. There must therefore be >3 times more undetected, ob-\nscured sources than detected, unobscured ones, in the 4–8 keV band.\nThis requires that the sources in the new population have a high cov-\nering fraction of obscuring matter.\nFrom the absorption-corrected flux, we can estimate the black\nhole mass density of this obscured population to be (6–9 × 104)\n\u0004−1−1κ−1 M\u0003 Mpc−3; where \u0004−1 is the accretion efficiency in units\nof 0.1 and κ−1 is a bolometric correction in units of 0.1. We have used\na similar calculation to Fabian & Iwasawa (1999) although note that\nthe bolometric correction is ∼10–15 for our lower luminosity ob-\njects (Fabian 2004). The missing population thus accounts for ∼10–\n20 per cent of the local black hole mass density of 4–5 × 105 M\u0003\nMpc−3 (see e.g. Shankar et al. 2004), the rest of which is the re-\nsult of bright AGN and, in particular, quasars, where the bolometric\ncorrection is ∼30 or more and where a typical redshift of z ∼ 2 is\nmore appropriate (refer to Fabian & Iwasawa 1999 and references\ntherein).\nThe steepness of the 5–10 keV source number counts, with no\nevidence for a break to a flatter slope at the faint end, also indicates\nthat there remains a substantial number of objects that have yet\nto be found in this band (Hasinger et al. 2001; Baldi et al. 2002;\nRosati et al. 2002). Recent optical and infrared data from the HST\nand Spitzer telescopes, acquired as part of the Great Observatories\nOrigins Deep Survey (GOODS) project, are also providing evidence\nfor large numbers of obscured AGN at z > 1 (e.g. Treister et al.\n2004). Deep, multiwavelength efforts such as GOODS may well\nbe the best way to identify the missing population; confirmation\nof Compton-thick objects will ultimately require X-ray missions\nwith high sensitivities beyond 10 keV, such as the next generation\nof focusing hard X-ray telescopes.\n5 C O N C L U S I O N S\n(i) Whilst the XRB is ∼85 and ∼80 per cent resolved in the broad\n0.5–2 and 2–10 keV bands respectively (depending on XRB normal-\nization), it is only ∼60 per cent resolved above ∼6 keV and ∼50\nper cent resolved above ∼8 keV. This decrease in resolved fraction\nis seen in both the CDFs and the XMM-LH.\n(ii) The decrease in resolved fraction as seen in XMM-LH occurs\nat energies \u00024 keV, whilst in the CDFs the drop occurs at \u00026 keV.\nThis difference is the result of faint, hard sources, which are de-\ntected in CDFs but not the XMM-LH. All three surveys are unable\nto account for almost half of the XRB above ∼6 keV.\n(iii) The missing fraction has a spectral shape that is consistent\nwith that which would be expected from a population of faint, heav-\nily obscured AGN located at a redshift of ∼0.5–1.5 and with intrinsic\nabsorption columns of ∼1023–1024 cm−2.\n(iv) The deep CDF data show that any such obscured population\nis not detected in the 2–4 keV band, or our stacking analysis would\nhave revealed the higher energy emission; consequently, any soft\nscattered or starburst emission from these objects must be small.\nAC K N OW L E D G M E N T S\nBased on observations with XMM–Newton, an ESA science mission\nwith instruments and contributions directly funded by ESA Member\nStates and the USA (NASA). MAW and FEB acknowledge support\nfrom UK Particle Physics and Astronomy Research Council. ACF\nand DMA thank the Royal Society for support. WNB is thankful for\nthe Chandra X-ray Centre grant GO2-31287A. We would also like\nto thank the anonymous referee for help comments.\nR E F E R E N C E S\nAlexander D. M. et al., 2003, AJ, 126, 539\nBaldi A., Molendi S., Comastri A., Fiore F., Matt G., Vignali C., 2002, ApJ,\n564, 190\nBarcons X., Mateos S., Ceballos M. T., 2000, MNRAS, 316, L13\nBauer F. E., Alexander D. M., Brandt W. N., Schneider D. P., Treister E.,\nHornschemeier A. E., Garmire G. P., 2004, AJ, 128, 2048\nCampana S., Moretti A., Lazzati D., Tagliaferri G., 2001, ApJ, 560, L19\nComastri A., 2004, in Maiolino R., Mujica R., eds, Proc. Multiwavelength\nAGN Surveys. World Scientific, Singapore, p. 323\nDe Luca A., Molendi S., 2004, A&A, 419, 837\nFabian A. C., 2004, in Ho L.C., ed., Coevolution of Black Holes and\nGalaxies. The Observatories of the Carnegie Institution of Washington,\nWashington DC, p. 447\nFabian A. C., Iwasawa K., 1999, MNRAS, 303, L34\nFiore F. et al., 2003, A&A, 409, 79\nFranceschini A., Braito V., Fadda D., 2002, MNRAS, 335, L51\nGandhi P., Fabian A. C., 2003, MNRAS, 339, 1095\nGiacconi R., Gursky H., Paolini F. R., Rossi B. B., 1962, Phys. Rev. Lett.,\n9, 439\nGiacconi R. et al., 2002, ApJS, 139, 369\nGilli R., Salvati M., Hasinger G., 2001, A&A, 366, 407\nC© 2005 RAS, MNRAS 357, 1281–1287\n at :: on N\novem\nber 24, 2015\nhttp:\/\/m\nnras.oxfordjournals.org\/\nD\now\nnloaded from\n \nThe unresolved hard X-ray background 1287\nGioia I. M., Henry J. P., Mullis C. R., Bo¨hringer H., Briel U. G., Voges W.,\nHuchra J. P., 2003, ApJS, 149, 29\nGruber D. E., Matteson J. L., Peterson L. E., Jung G. V., 1999, ApJ, 520,\n124\nHasinger G., Burg R., Giacconi R., Schmidt M., Trumper J., Zamorani G.,\n1998, A&A, 329, 482\nHasinger G. et al., 2001, A&A, 365, L45\nLockman F. J., 2003, in Lieu R., ed., Soft X-ray Emission from Clusters of\nGalaxies and Related Phenomena. Kluwer, Dordrecht, in press (astro-\nph\/0311386)\nLockman F. J., Jahoda K., McCammon D., 1986, ApJ, 302, 432\nMagdziarz P., Zdziarski A. A., 1995, MNRAS, 273, 837\nMaiolino R., Salvati M., Bassani L., Dadina M., della Ceca R., Matt G.,\nRisaliti G., Zamorani G., 1998, A&A, 338, 781\nMaiolino R. et al., 2003, MNRAS, 344, L59\nMalizia A., Bassani L., Stephen J. B., Di Cocco G., Fiore F., Dean A. J.,\n2003, ApJ, 589, L17\nMarshall F. E., Boldt E. A., Holt S. S., Miller R. B., Mushotzky R. F., Rose\nL. A., Rothschild R. E., Serlemitsos P. J., 1980, ApJ, 235, 4\nMason K. O. et al., 2000, MNRAS, 311, 456\nMoretti A., Lazzati D., Campana S., Tagliaferri G., 2002, ApJ, 570, 502\nMoretti A., Campana S., Lazzati D., Tagliaferri G., 2003, ApJ, 588, 696\nMorrison R., McCammon D., 1983, ApJ, 270, 119\nRoberts T. P., Warwick R. S., 2001, in Giaconni R., Stella L., Serio S., eds,\nASP Conf. Ser. Vol. 234, X-ray Astronomy 2000. Astron. Soc. Pac., San\nFrancisco, p. 569\nRosati P. et al., 2002, ApJ, 566, 667\nSchwope A. et al., 2000, Astron. Nachr., 321, 1\nShankar F., Salucci P., Granato G. L., De Zotti G., Danese L., 2004, MNRAS,\n354, 1020\nStark A. A., Gammie C. F., Wilson R. W., Bally J., Linke R. A., Heiles C.,\nHurwitz M., 1992, ApJS, 79, 77\nStreblyanska A., Bergeron J., Brunner H., Finoguenov A., Hasinger G.,\nMainieri V., 2004, Nucl. Phys. B, 132, 232\nTreister E. et al., 2004, ApJ, 616, 123\nUeda Y., Takahashi T., Ishisaki Y., Ohashi T., Makishima K., 1999, ApJ,\n524, L11\nUeda Y., Akiyama M., Ohta K., Miyaji T., 2003, ApJ, 598, 886\nWorsley M. A., Fabian A. C., Barcons X., Mateos S., Hasinger G., Brunner\nH., 2004, MNRAS, 352, L28\nThis paper has been typeset from a TEX\/LATEX file prepared by the author.\nC© 2005 RAS, MNRAS 357, 1281–1287\n at :: on N\novem\nber 24, 2015\nhttp:\/\/m\nnras.oxfordjournals.org\/\nD\now\nnloaded from\n \n"}