{"doi":"10.1039\/B703954A","coreId":"194683","oai":"oai:lra.le.ac.uk:2381\/627","identifiers":["oai:lra.le.ac.uk:2381\/627","10.1039\/B703954A"],"title":"Electroless Deposition of Metallic Silver from a Choline Chloride Based Ionic Liquid : A Study Using Acoustic Impedance Spectroscopy, SEM and Atomic Force Microscopy","authors":["Abbott, Andrew P.","Nandhra, Satvinder","Postlethwaite, Stella","Smith, Emma L.","Ryder, Karl S."],"enrichments":{"references":[{"id":44681281,"title":"Electrochemical Aspects of Ionic Liquids,","authors":[],"date":"2005","doi":"10.1002\/0471762512","raw":"Electrochemical Aspects of Ionic Liquids, ed. H. Ohno, John Wiley & Sons, New York, 2005.","cites":null},{"id":44681280,"title":"Electroless Deposition of Metals and Alloys’’","authors":[],"date":"2002","doi":"10.1007\/0-306-47604-5_2","raw":"S. S. Djokic, ‘‘Electroless Deposition of Metals and Alloys’’ in ‘‘Modern Aspects of Electrochemistry’’, ed. Brian E. Conway and Ralph E. White, Springer US, 2002, vol. 35, pp. 51–133.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-05-22","abstract":"In this paper, we describe the first example of a sustained galvanic coating deposited on a surface from a non-aqueous liquid. We present the surface characterization of electroless silver deposits on copper substrates from a solution of Ag[superscript +] ions in an ionic liquid based on a choline chloride (ChCl) eutectic. Through a study of these deposits and the mechanism of formation using acoustic impedance spectroscopy (QCM), probe microscopy (AFM) and electron microscopy (SEM\/EDX), we demonstrate that sustained growth of the silver deposit is facilitated by the porous nature of the silver. This is in contrast to the dip-coating reaction of silver ions in aqueous media, where the reaction stops when surface coverage is reached. Electroless silver deposits of up to several microns have been obtained by dip coating in ionic liquids without the use of catalysts of strong inorganic acids.Peer-reviewedPublisher Versio","downloadUrl":"http:\/\/hdl.handle.net\/2381\/627","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/627\/1\/10.1039_b703954a.pdf","pdfHashValue":"8dedbed557639c523b07b58be0a6b8f6f025f6c5","publisher":"Royal Society of Chemistry","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/627<\/identifier><datestamp>\n                2014-01-25T02:01:13Z<\/datestamp><setSpec>\n                com_2381_118<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_119<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nElectroless Deposition of Metallic Silver from a Choline Chloride Based Ionic Liquid : A Study Using Acoustic Impedance Spectroscopy, SEM and Atomic Force Microscopy<\/dc:title><dc:creator>\nAbbott, Andrew P.<\/dc:creator><dc:creator>\nNandhra, Satvinder<\/dc:creator><dc:creator>\nPostlethwaite, Stella<\/dc:creator><dc:creator>\nSmith, Emma L.<\/dc:creator><dc:creator>\nRyder, Karl S.<\/dc:creator><dc:description>\nIn this paper, we describe the first example of a sustained galvanic coating deposited on a surface from a non-aqueous liquid. We present the surface characterization of electroless silver deposits on copper substrates from a solution of Ag[superscript +] ions in an ionic liquid based on a choline chloride (ChCl) eutectic. Through a study of these deposits and the mechanism of formation using acoustic impedance spectroscopy (QCM), probe microscopy (AFM) and electron microscopy (SEM\/EDX), we demonstrate that sustained growth of the silver deposit is facilitated by the porous nature of the silver. This is in contrast to the dip-coating reaction of silver ions in aqueous media, where the reaction stops when surface coverage is reached. Electroless silver deposits of up to several microns have been obtained by dip coating in ionic liquids without the use of catalysts of strong inorganic acids.<\/dc:description><dc:description>\nPeer-reviewed<\/dc:description><dc:description>\nPublisher Version<\/dc:description><dc:date>\n2009-12-08T16:23:21Z<\/dc:date><dc:date>\n2009-12-08T16:23:21Z<\/dc:date><dc:date>\n2007-05-22<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nPhysical Chemistry Chemical Physics, 2007, 9 (28), pp.3735-3743<\/dc:identifier><dc:identifier>\n1463-9076<\/dc:identifier><dc:identifier>\nhttp:\/\/pubs.rsc.org\/en\/Content\/ArticleLanding\/2007\/CP\/b703954a#!divAbstract<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/627<\/dc:identifier><dc:identifier>\n10.1039\/B703954A<\/dc:identifier><dc:identifier>\n1463-9084<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:rights>\nCopyright © 2007, Royal Society of Chemistry. Deposited with reference to the publisher’s archiving policy available on the SHERPA\/RoMEO website.<\/dc:rights><dc:publisher>\nRoyal Society of Chemistry<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["1463-9076","issn:1463-9076","1463-9084","issn:1463-9084"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007"],"year":2007,"topics":[],"subject":["Article"],"fullText":"Electroless deposition of metallic silver from a choline chloride-based\nionic liquid: a study using acoustic impedance spectroscopy, SEM and\natomic force microscopy\nAndrew P. Abbott, Satvinder Nandhra, Stella Postlethwaite, Emma L. Smith and\nKarl S. Ryder*\nReceived 15th March 2007, Accepted 3rd May 2007\nFirst published as an Advance Article on the web 22nd May 2007\nDOI: 10.1039\/b703954a\nIn this paper, we describe the first example of a sustained galvanic coating deposited on a surface\nfrom a non-aqueous liquid. We present the surface characterization of electroless silver deposits\non copper substrates from a solution of Ag+ ions in an ionic liquid based on a choline chloride\n(ChCl) eutectic. Through a study of these deposits and the mechanism of formation using\nacoustic impedance spectroscopy (QCM), probe microscopy (AFM) and electron microscopy\n(SEM\/EDX), we demonstrate that sustained growth of the silver deposit is facilitated by the\nporous nature of the silver. This is in contrast to the dip-coating reaction of silver ions in aqueous\nmedia, where the reaction stops when surface coverage is reached. Electroless silver deposits of up\nto several microns have been obtained by dip coating in ionic liquids without the use of catalysts\nof strong inorganic acids.\nIntroduction\nHere we describe the physical characterization of electroless\nsilver deposits on copper substrates from a solution of Ag+\nions in an ionic liquid solvent based on a choline chloride\n(ChCl) eutectic.\nThe electroless deposition of silver metal onto copper sub-\nstrates is an important industrial process that is used primarily\nby the manufacturers of printed circuit boards to prevent\ndegradation of exposed copper surfaces (conduction tracks)\nduring the time that elapses between the manufacture of the\ncircuit board and the assembly procedure incorporating the\nboard or component into a finished device. Typically this can\nbe up to several months. This method of protection for the\ncopper surfaces is very effective despite the fact that silver is\nthermodynamically much more susceptible to aerobic oxida-\ntion. This is because silver oxide and sulfide (formed as tarnish\non silver surfaces), as well as the underlying silver metal, are\nvery soluble in the tin- and tin\/lead-based molten solders that\nare used to bond the circuit components to the copper tracks\nof the circuit board. On the contrary, copper oxides are poorly\nsoluble in the molten solder such that aerobic oxidation of the\ncopper surface prior to soldering inhibits interfacial wetting at\nthe copper\/solder interface and prevents bonding of the com-\nponent. In a practical device, this results in failure of the joint\neither through poor conductivity or because of low mechanical\nstress tolerance. Solder fluxes are often used to mitigate this\nproblem by preventing aerobic oxidation of copper surfaces,\nbut this approach is not always successful or practical. Com-\nmercial electroless silver processes typically use an aqueous\nAgNO3 solution in the presence of HNO3. In addition to the\nsocial and environmental concerns that surround the use of\nstrong inorganic acids, here the use of HNO3, whilst necessary\nto the process, has an additional detrimental effect because\nthere is competitive etching of the copper tracks during silver\nplating. This can be a serious problem for the electronics\nindustry, particularly as integration densities continue to\nincrease and consequently feature sizes become smaller. Many\ncomponent failures arise because of copper etching (by the\nHNO3) before the surfaces are silver plated. In addition, the\naqueous process requires the use of a colloidal catalyst (usually\npalladium metal) to sustain silver plating from beyond a few\nnanometres up to 1–5 mmw in thickness.1,2\nIonic Liquids (IL) have recently received a great deal of\nattention in the literature as alternative solvents and electro-\nlytes for a number of electrochemical processes.3,4 These\nprocesses range in scope from fundamental academic investi-\ngations, for example into the structure of the solid\/liquid and\nliquid\/liquid interfaces5 or into the mechanisms of ion diffu-\nsion, to industrial processes where the IL has the potential to\nreplace conventional noxious aqueous media.6 We have re-\ncently described the applications of a relatively new class of IL\nbased on eutectic mixtures of choline chloride with a hydrogen\nbond donor species.7–9 These liquids can be used for the\ndeposition of a range of metal coatings including Zn, Cr, Sn,\nCu, Ag, at high current efficiency and also for metal dissolu-\ntion processes such as electropolishing.10,11 In many cases, the\nuse of IL solvents overcomes the need for strong inorganic\nacids (e.g., chromic acid, HF, H2PO4, H2SO4) and highly toxic\nsalts (e.g., cyanide). Here, we describe the deposition and\nmorphology of metallic electroless silver coatings from\nChemistry Department, University of Leicester, Leicester, UK LE1\n7RH. E-mail: k.s.ryder@le.ac.uk; Fax: +44 (0)116 252 3789\nw Dip coating of Ag onto Cu is spontaneous in aqueous solution but\ngrowth of the Ag deposit in the absence of a catalyst is not sustained\nbeyond surface coverage.\nThis journal is \u0001c the Owner Societies 2007 Phys. Chem. Chem. Phys., 2007, 9, 3735–3743 | 3735\nPAPER www.rsc.org\/pccp | Physical Chemistry Chemical Physics\nPu\nbl\nish\ned\n o\nn \n22\n M\nay\n 2\n00\n7.\n D\now\nnl\noa\nde\nd \nby\n U\nni\nve\nrs\nity\n o\nf L\nei\nce\nste\nr o\nn \n19\n\/0\n8\/\n20\n13\n 1\n5:\n49\n:1\n9.\n \nView Article Online \/ Journal Homepage \/ Table of Contents for this issue\nsolution in an IL based on a choline chloride (ChCl), ethylene\nglycol (EG), ChCl : 2EG, eutectic mix. Crucially, the nature of\nthe morphology of silver deposition facilitates sustained\ngrowth of silver coatings. This is in contrast to the aqueous\ndip-coating reaction. We use acoustic impedance spectroscopy\nperformed with a Quartz Crystal Microbalance (QCM) to-\ngether with AFM and SEM to probe the mechanism of\ndeposition and the structure of the silver deposits. Electroless\nsilver deposits of up to several microns have been obtained by\ndip coating in ionic liquids without the use of catalysts of\nstrong inorganic acids.\nExperimental\nCholine chloride (ChCl) (Aldrich 99%) was recrystallised from\nabsolute ethanol, filtered and dried under vacuum. Ethylene\nglycol (EG) (Aldrich 99+%) was used as received. The\nmixture was formed by stirring the two components in the\nratio 1ChCl : 2EG, at 75 1C until a homogeneous colourless\nliquid was formed. Voltammetry was carried out using an\nAutolab PGSTAT12 potentiostat controlled using GPES soft-\nware. A three-electrode system consisting of a platinum disc\nworking electrode (0.5 mm radius), sealed in glass, a platinum\ncounter electrode and a silver wire reference electrode were\nused.\nAcoustic impedance QCM experiments were carried out\nusing electrodes consisting of thin Au films (no Ti or Cr\nbinding layer was used) evaporated on 10 MHz quartz crystals\n(International Crystal Manufacturing Co., Oklahoma City,\nUSA); the surface finish of these crystals was either polished or\nunpolished. The piezoelectric active electrode area was\n0.23 cm2. Crystal impedance spectra were recorded using a\nHewlett Packard HP8751A network analyser, connected to a\nHP87512A transmission\/reflection unit via 50 O coaxial cable\nsuch that the centre of the spectrum was near the centre of\nresonance, f0, (10 MHz) with a typical sweep width of 20–\n200 kHz depending on the interface. Measured data were fitted\nto a Lorentzian equivalent circuit model (eqn (1)) incorporat-\ning the in-phase impedance, inductance and centre frequency\nwith a simple iterative difference method using Microsoft\nExcel (fitting procedures, etc. are discussed in more detail\nelsewhere12–14). In order to collect the admittance spectra with\ngreater temporal resolution, network analyser data acquisition\nwas controlled by a computer running HP VEE. This program\nwas capable of recording admittance spectra every 3–4 s,\nwhich permitted the investigation under dynamic potential\ncontrol. The crystal was fixed into the simple cell so that one\nface of the crystal was exposed to the solution. The other face\nwas exposed to air.\nUðf Þ ¼ aþ R\nR2 þ 16p2L2ðf \u0002 f0Þ2\nð1Þ\nwhere U(f)\/O\u00021 is the measured admittance curve as a function\nof applied frequency, f\/Hz (and U(f) = 1\/Z(f)), R\/O is the real\ncomponent of the impedance (Z), L\/Henry is the inductance,\nf0\/Hz is the centre frequency and a\/O\n\u00021 is the baseline offset.\nThe latter was used during fitting to compensate for variations\nin the static calibration of the network analyser.\nAFM images were acquired using a Digital Instruments\n(DI) Nanoscope IV, Dimension 3100 instrument using either\nresonant (tapping) or contact mode (software version 6.12).\nSurface analysis with SEM and elemental analysis using\nEDX were carried out under vacuum using a Philips XL30\nESEM instrument with an accelerator voltage of between\n15–20 kV, giving a typical beam current of ca. 120 mA. Gold\nsputter coating was not required in most cases because of the\nhigh intrinsic conductivity.\nCopper substrates for silver deposition were typically 10 \u0003\n40 mm and 2 mm in thickness. Prior to silver deposition\nexperiments, the substrates were first etched using 5% aqueous\nHCl then rinsed with distilled H2O, dried and polished me-\nchanically (using a rotary buffing wheel). The copper sub-\nstrates were then cleaned using dichloromethane and kept\nunder acetone until immediately prior to use.\nAll deposition experiments were carried out at room tem-\nperature (typically 20–23 1C) unless otherwise specifically\nstated. Regions of the samples were masked off from deposi-\ntion using acrylic resin dissolved in ethyl acetate or acetone.\nElectrolytic deposition of copper onto gold QCM crystal\nsurfaces was accomplished in a 0.1 M solution of CuSO4 in\nwater using potential step chronoamperometry with an ap-\nplied potential of \u00020.3 V (versus Ag wire pseudo reference).\nThe time scale was varied according to the desired deposition\ncharge (typically 20–50 s).\nResults and discussion\nDeep eutectic solvents (also referred to here as ionic liquids)\nformulated from stoichiometric mixtures of choline chloride\nand either ethylene glycol (EG) or urea are especially good\nsolvents for a range of metal salts and metal oxides that are\nnot otherwise soluble in aqueous media.7–9 A range of silver\nsalts including AgNO3, AgCl, AgSO4 and Ag(CH3COO) are\nsoluble in both ChCl : 2EG- and ChCl : 2Urea-based ionic\nliquids. Cyclic voltammetry of these silver salts in each type of\nIL are indistinguishable, however, (with the mid-point poten-\ntial between the deposition and stripping occurring at 0 V with\nrespect to a silver wire reference) suggesting that the Ag+\nspeciation is dominated by the nature and formulation of the\nIL rather than by the counterion of the salt. This is most\nprobably because of the very high concentration of chloride\nions in the IL (typically 4.8 mol L\u00021) in comparison to the\nsilver salt concentration (typically 10 mmol L\u00021). Fig. 1 shows\nthe cyclic voltammetry of a mixture of CuCl2 and AgCl in the\nEG-based liquid. Here, three distinct redox processes\nare clearly visible, Fig. 1. The first of these, Fig. 1(a), E =\n\u0002400 mV, shows the deposition and stripping response of Cu\ncorresponding to the reduction of Cu+. Similarly, the process\nshown in Fig. 1(b), E = 0 V, corresponds to the deposition\nand stripping response of Ag. The process labelled Fig. 1(c),\nE = +425 mV, corresponds to the reversible, solution,\nCu2+\/+ couple. These data show clearly that Ag+ ion reduc-\ntion is thermodynamically favoured upon immersing Cu metal\ninto a solution of AgCl in EG-based IL. Additionally, it is also\nclear from the thermodynamics (redox potentials) that the\nconsequential dissolution product accompanying silver de-\nposition is Cu+, rather than Cu2+, according to Scheme 1\n3736 | Phys. Chem. Chem. Phys., 2007, 9, 3735–3743 This journal is \u0001c the Owner Societies 2007\nPu\nbl\nish\ned\n o\nn \n22\n M\nay\n 2\n00\n7.\n D\now\nnl\noa\nde\nd \nby\n U\nni\nve\nrs\nity\n o\nf L\nei\nce\nste\nr o\nn \n19\n\/0\n8\/\n20\n13\n 1\n5:\n49\n:1\n9.\n \nView Article Online\n(the state designation ‘‘IL’’ is used to signify the solvated ion in\nthe IL). Interestingly, both Cu(I) and Cu(II) salts are seen to be\nstable in the ChCl : 2EG IL and there is no evidence of Cu(I)\ndisproportionation seen in aqueous solution. However, FAB\nmass spectrometry analysis of Cu(I), Cu(II), and Ag(I) salts in\nthis liquid have identified [CuCl2]\n\u0002, [CuCl3]\n\u0002 and [AgCl2]\n\u0002\ncomplex anions, respectively. Hence, the relatively high con-\ncentration of chloride ions in the ionic liquid explains why\ndisproportionation of Cu(I) is not observed here.\nElectroless Ag deposition from ChCl : 2EG\nIn a typical procedure, a sample of mechanically polished\n(mirror finish) copper metal was immersed in ChCl : 2EG ionic\nliquid containing 10 mmol L\u00021 AgCl for a period of 5 min.\nThe sample was then removed and sequentially rinsed with\nfresh IL, propanol, and methanol. A region of the sample\nsurface had been masked by painting with a solution of acrylic\nresin (dissolved in ethyl acetate), which was subsequently\nremoved using acetone to reveal a clear boundary edge\nbetween the silver deposit and the uncoated copper substrate.\nSuch samples were then examined under the SEM. The\nresulting SEM image, presented in Fig. 2(a), shows the two\nregions of the sample prepared in the manner described above.\nThe uncoated Cu substrate is seen at the bottom of the image\nand the silver deposit at the top. The horizontal boundary\nseparating the two regions is clearly visible approximately two\nthirds of the way down the image. The copper substrate is\nrelatively smooth, showing some mechanical tool marks from\nthe polishing procedure and pits and scratch marks. The\nmorphology of the silver deposit is qualitatively very rough\nin comparison, the surface features of the substrate are no\nlonger visible in this region. Closer inspection of the silver\ndeposit at higher magnification, Fig. 2(b), shows that the silver\ndeposit has a nodular structure with randomly distributed\nvoids that are of similar magnitude to the nodules. Spectro-\nscopic analysis (EDX) of the two surfaces showed only the\npresence of Cu and Ag emission peaks, respectively. Dip\ncoatings of silver deposits were also obtained on copper\nsubstrates from solutions of other silver salts: AgNO3, AgSO4\nand Ag(CH3COO). Despite the similarity in the voltammetric\nresponses of these silver salts, the dip-coatings of silver varied\nsignificantly, although not systematically, in qualitative ap-\npearance. In order to acquire quantitative data on thickness\nand morphology of the deposits, samples were examined using\nprobe microscopy.\nAtomic force microscopy\nCopper samples plated with electroless silver deposits were\nexamined using scanning AFM in either resonant (tapping) or\ncontact mode. A typical data set is shown in Fig. 3. Fig. 3(a)\nshows the xyz projection of a silver coated sample with the\nboundary between coated (right) and uncoated Cu (left) run-\nning diagonally across the image (left–right). The 2D projec-\ntion of this image is shown as Fig. 3(b); here, the silver coated\nregion is seen in the bottom left diagonal segment. Both of\nthese two representations show clearly that the surface rough-\nness of the silver deposit is orders of magnitude greater than\nthat of the substrate. Height data extracted from the line\njoining bottom-left and top-right hand corners of the image\nshown in Fig. 3(b) are presented in Fig. 3(c). These data show\nquantitatively the magnitude of surface roughness over the\nsilver coating, but also clearly show the thickness of the silver\nlayer, having a mean thickness of ca. 500 nm above the mean\nFig. 1 Cyclic voltammogram of a mixture of CuCl2 and AgCl in a\nChCl : 2EG IL at a Pt disc (0.5 mm dia.) working electrode and a\npotential scan rate of n = 20 mV s\u00021. Process (a) Cu+ reduction and\nstripping, (b) Ag+ reduction and stripping, (c) Cu2+\/+ redox couple.\nPotential measured versus a silver wire reference electrode.\nFig. 2 Scanning electron micrograph of a polished Cu sample exposed to AgCl solution of ChCl : 2EG IL for 5 min: (a) image showing both\nuncoated Cu substrate and Ag coated regions, (b) higher magnification image showing the Ag coated region only (from image (a)).\nScheme 1\nThis journal is \u0001c the Owner Societies 2007 Phys. Chem. Chem. Phys., 2007, 9, 3735–3743 | 3737\nPu\nbl\nish\ned\n o\nn \n22\n M\nay\n 2\n00\n7.\n D\now\nnl\noa\nde\nd \nby\n U\nni\nve\nrs\nity\n o\nf L\nei\nce\nste\nr o\nn \n19\n\/0\n8\/\n20\n13\n 1\n5:\n49\n:1\n9.\n \nView Article Online\nplane defined by the copper substratez. Also present in these\ndata (Fig. 3(c)) is evidence of a narrow depression at the\nboundary between the copper substrate and the silver coating.\nThis depression, approximately 2 mm wide and 400 nm deep,\nextends the length of the boundary forming a narrow trough\nthat seems to have been etched from the substrate. Control\nexperiments were performed in which the copper substrate,\ncoated with acrylic mask, was soaked in neat IL (in the\nabsence of Ag+ ion). Examination of the sample under\nAFM, after subsequent rinsing and removal of the mask,\nshowed no boundary features. Consequently, the presence of\nthe ‘‘trough’’ between the copper and silver deposit is not an\nartefact of the experimental procedure. We speculate that\ncopper must be removed from the substrate to facilitate silver\ndeposition and that the level at the bottom of this depression\ndefines the total degree of etching over the plane of the copper\nsubstrate. Hence, the total thickness of silver could be esti-\nmated as ca. 900 nm.\nSurface roughness is often expressed as a ratio of the\nmeasured topographical surface area, AM, calculated from\nthe height data and the projected geometric sample area (i.e.\nfootprint), AP, (here this is 25 mm\n2). Surface roughness, R, is\nthen expressed as a percentage according to eqn (2).\nR ¼ Am\nAP\n\u0002 1\n\u0001 \u0002\n\u0003 100% ð2Þ\nUsing this method, the silver plated region has an average\nroughness of 45% compared to a value of 1% for the uncoated\nsubstrate. This experiment was repeated using a lower con-\ncentration of Ag+ ions (1 mmol L\u00021) in order to slow the rate\nof deposition. Subsequently, the surface roughness was mea-\nsured as a function of deposition time. In addition, using a\nfixed deposition time of 5 min, the surface roughness was\nmeasured on a further set of samples over a range of tempe-\nratures. The data obtained are summarised in Tables 1 and 2.\nFrom these data, it is clear that during the deposition reaction\nsurface roughness increases and that raising the temperature\nalso increases the surface roughness (rate of deposition) of the\nsilver deposit.\nQuantitative and qualitative differences were observed be-\ntween samples of silver deposit obtained from various silver\nsalts, however, no trends were observed. Dip-coatings from\nAgCl gave the most consistent results and so we have focussed\nour investigation on the formation of silver dip-coatings from\nAgCl solution.\nOne striking feature of the dip-coated silver deposit shown\nin Fig. 3 is the overall thickness (ca. 0.5 mm at the mask\nboundary). This is much thicker than might be anticipated on\nthe basis of a conventional (aqueous) dip-coating mechanism.\nThe mechanism of aqueous (dip-coating) deposition is driven\nby the thermodynamics (i.e. difference in redox potential) in\njust the same way but deposition stops when the surface is\ncovered with silver, since the new silver surface masks the\ncopper from the aqueous Ag+ and prevents dissolution of the\nFig. 3 AFM image (resonant mode) of a Ag plated Cu sample (SEM shown in Fig. 2); (a) xyz surface projection, (b) height contrast image of the\nsame data, (c) height\/distance data for the diagonal line trace sown in (b).\nTable 1 Surface roughness measurements as a function of time for\npolished copper substrates exposed to the AgCl solution in 1ChCl :\n2EG\nSample deposition\ntime\/min\nSurface area ratio %\nAg deposit\nSurface area ratio % Cu\nsubstrate\n5 1.5 0.25\n10 3.0 0.5\n15 6.0 0.3\nz No real-time plane fitting was applied during the acquisition of the\nAFM images; however, plane fitting was subsequently performed on\nthe raw data using the uncoated Cu substrate as the reference plane.\n3738 | Phys. Chem. Chem. Phys., 2007, 9, 3735–3743 This journal is \u0001c the Owner Societies 2007\nPu\nbl\nish\ned\n o\nn \n22\n M\nay\n 2\n00\n7.\n D\now\nnl\noa\nde\nd \nby\n U\nni\nve\nrs\nity\n o\nf L\nei\nce\nste\nr o\nn \n19\n\/0\n8\/\n20\n13\n 1\n5:\n49\n:1\n9.\n \nView Article Online\ncopper ions from the underlying metal. Hence, it is clear from\nour results that the mechanism of electroless deposition of\nsilver from ChCl : 2EG IL is very different to that in aqueous\nsolution.\nAcoustic impedance spectroscopy using QCM\nIn order to investigate the rate of deposition of silver during\nthe electroless process we have used a resonant QCM as a mass\nprobe. Most commercial QCM instruments use a derivative\ntechnique that locks and tracks the peak frequency of crystal\nresonance as a function of time. This technique does not work\nwell with IL solvents because the relatively high viscosity\nattenuates the crystal resonance. Using acoustic impedance\nspectroscopy, we acquire the full resonance spectrum of the\nin situ mass-loaded crystal at any point in time. Subsequent\ncurve fitting yields the peak frequency and the real component\nof the impedance for the crystal circuit. This is particularly\nuseful in analysis because the electrical impedance of the\ncrystal circuit is coupled to the mechanical losses that are\nsustained at the crystal\/liquid interface. These losses are, in\nturn, characteristic of that interface, giving potentially useful\nquantitative information about surface roughness and density.\nIn addition, a direct empirical measure of these mechanical\nlosses is available from the Q factor, Q, of the admittance\nresonance curve. The Q factor of a resonance curve is a\nmeasure of the broadness of resonance given by eqn (3),\nQ ¼ f0=w ð3Þ\nwhere f0 is the frequency value at the centre of resonance and w\nis the Full Width of the peak at Half Height (FWHH). Such\nresonance curves are conventionally presented as admittance,\nU\/Siemens, frequency plots where admittance is the reciprocal\nof impedance, Z\/O.\nThe impedance QCM experiments were carried out using\neither a polished (flat mirror) or unpolished ‘‘frosted’’ finish\ncrystal in a simple cell such that the working face of the crystal\nwas bonded to a circular opening in the base of a quickfit\nvessel similar to that described elsewhere.12–14 In a typical\nexperiment, the admittance spectrum for a dry unpolished\ncrystal was first acquired prior to any surface treatment. The\ngold surface of the crystal was then coated with an electrolytic\ndeposit of copper metal. This was most easily achieved using\npotential step chronoamperometry in a conventional three\nelectrode electrochemical cell, using aqueous CuSO4 solution\n(see Experimental section). During electrolytic copper deposi-\ntion the current was monitored as a function of time to enable\nthe calculation of Faradaic charge.y The CuSO4 solution was\nthen removed from the cell, the crystal was rinsed with fresh\nwater, dried and the admittance spectrum of the dry copper\ncoated crystal recorded. Subsequently, a AgCl solution in\nChCl : 2EG IL was added to the cell and the admittance\nspectrum of the crystal (in contact with the liquid) was\ncontinually recorded using a repetitive scan. At the end of a\ntime period after which the experiment was judged to be\ncompletez the IL solution was removed from the cell, the\ncrystal was then rinsed and dried and the admittance spectrum\nof the dry silver coated crystal was recorded. All of the\nrecorded spectra were then numerically processed (see Experi-\nmental section) to yield the peak frequency and Q factor.\nFrequency trends\nA complete data set of 30 admittance curves recorded during a\nsilver deposition experiment is shown in Fig. 4(a). At time,\nt = 0, the admittance curve has a peak value Upeak = 1.0 mS\nand a Q factor = 401 (measured from the data), which are\nboth quite small and characteristic of an attenuated resonance\nwhen compared with corresponding values for the dry copper-\ncoated crystal; Upeak = 20 mS and Q = 24 160. These\nobservations are consistent with the intrinsic mechanical losses\nassociated with the interface between the IL and the crystal.\nEach of the 30 spectra were numerically fitted; the resultant\nvalues of frequency shift, Df08, are plotted as a function of\ntime in Fig. 4(b). Here, a downward frequency trend is visible\ncorresponding to an increase in mass of the crystal. This is\nconsistent with the replacement of Cu with Ag. The trend\ncontinues for approximately 12 min and then the resonant\nfrequency stabilises at around \u000210 kHz. No further change\nwas observed.** It is clear from Fig. 4(a) that although the\nposition of the resonance peak has moved to lower frequency,\nthe shape of the resonant curve is qualitatively unchanged.\nThis is confirmed by Q factor measurements at the beginning\nand end of the deposition, where Q(t = 0) = 401 and Q(t =\n16 min) = 378. Hence, the broadness of the resonance has\nchanged by less than 7% during deposition.\nThis experiment was repeated several times using the same\ncrystal (following cleaning of the crystal surface by removal of\nthe silver\/copper deposit), each time increasing the total mass\nof Cu deposited. Another sample data set is shown in Fig. 4(c)\nand the corresponding Df0(t) data are presented as Fig. 4(d). In\nthis case, the total Faradaic charge for copper deposition was\n0.23 C, whereas that in the previous example, Fig. 4(a–b), was\n0.066 C. The data set Fig. 4(c) is striking in comparison to the\nprevious case for two reasons; (i) the time scale is very much\nlonger, (ii) the peak frequency of the admittance curve has\nboth shifted to a lower frequency and has become acutely\nattenuated. This latter point is important and will be the focus\nof discussion in a following section. Fig. 4(d) (i) shows the\nTable 2 Surface roughness measurements as a function of tempera-\nture for polished copper substrates exposed to the AgCl solution in\n1ChCl : 2EG for a fixed period of time (5 min)\nSample deposition\ntemperature\/1C\nSurface area\nratio % Ag deposit\nSurface area\nratio % Cu substrate\n30 1.0 0.2\n50 9.0 0.8\n70 12.5 0.5\ny The applied potential was kept sufficiently small so as to maintain a\nhigh current efficiency for copper deposition.\nz The experimental time scale for the deposition process was estimated\nby visual monitoring of the peak position of the admittance curve.\nWhen this was no longer seen to be moving as a function of time the\nexperiment was judged to be complete.\n8 Here, Df0 = f0(t = 0) \u0002 f0(t), where f0(t = 0) is the peak frequency\nof the first spectrum at t = 0, and f0(t) is the peak frequency of each\nsubsequent spectrum at time, t.\n** The slight frequency up turn at 14 min4 t4 12 min may be due to\nsurface reorganisation. We will publish separately on this issue.\nThis journal is \u0001c the Owner Societies 2007 Phys. Chem. Chem. Phys., 2007, 9, 3735–3743 | 3739\nPu\nbl\nish\ned\n o\nn \n22\n M\nay\n 2\n00\n7.\n D\now\nnl\noa\nde\nd \nby\n U\nni\nve\nrs\nity\n o\nf L\nei\nce\nste\nr o\nn \n19\n\/0\n8\/\n20\n13\n 1\n5:\n49\n:1\n9.\n \nView Article Online\ncorresponding Df0(t) data extracted from the spectra. Once\nagain, the frequency data show a downward trend correspond-\ning to increasing mass, culminating in a frequency change of\n\u000247 kHz after a time of ca. 100 min. (The data plotted as Fig.\n4(d) (ii) are taken from Fig. 4(b) and represented on the same\nscale for comparison.) The data for a third similar experiment\nare shown in Fig. 4(d) (iii); here, the initial Faradaic charge for\nthe copper deposit was at an intermediate value of 0.107 C; the\nrate of frequency change was close to zero after 49 min,\nresulting in a value of Df0 = \u000222 kHz. Clearly the variation\nin deposition time scale and the final value of Df0 correlate\nwith the mass of silver deposited and with mass of copper\ninitially electroplated onto the crystal. These data, together\nwith the results of several other similar experiments, are\nsummarised in Fig. 5, where the silver deposition time (i.e.\ntime taken for the frequency response to level out) is plotted\nagainst the Faradic charge for the copper substrate layer.\nThese results show clearly that deposition time is a function\nof the amount of copper present, and that consequently we\nhave observed sustained deposition of electroless silver. The\ndata presented in Fig. 5 also comprise experiments performed\nat both polished and unpolished crystal surfaces. The correla-\ntion appears not to be sensitive to the morphology of the\nunderlying electrode substrate.\nThe strong attenuation of the resonance curves observed in\nthe U(f, t) data of several experiments, particularly at long\ntime scales, see Fig. 4(c), indicates mechanical viscoelastic loss\nat the crystal liquid interface. These losses preclude direct\nconversion of the frequency change, Df0, into equivalent mass,\ni.e., the Sauerbrey equation can not be used here. However,\nthis information can be obtained directly from the dry crystal\nmeasurements before and after the experiment.\nSpectra for another sample experiment are shown in Fig. 6.\nThese resonances are very sharp and well defined (evidenced\nby the large values of Q). In addition, the peak intensities are\nvery similar indicating that in each instance the crystal is\nbehaving as a rigid resonator and that progressive losses after\neach deposition (Cu then Ag) are small. Under these circum-\nstances the shift in peak frequency can be used to calculate\nchange in mass at the crystal according to the Sauerbrey\nequation.15 The peak frequency value, f0, for the gold only\ncoated crystal was taken as a reference zero value, conse-\nquently the peak of the resonance curve for the copper coated\ncrystal occurs at a frequency of f0 =\u000228.8 kHz and that of the\nsilver coated crystal occurs at f0 = \u000245.0 kHz. Calculation of\nequivalent masses yields a value of 500 nmol of Cu metal\nelectrolytically deposited on the gold surface. (Integration of\nthe current–time trace during copper deposition to give\nFig. 4 Acoustic impedance data (QCM) for two silver deposition experiments. Experiment 1; copper deposition charge of qCu = 0.066 C. (a)\nU(f, t) data acquired (spectra recorded every 30 s) during a silver deposition in ChCl : 2EG liquid, (b) peak difference, Df0(t), data, obtained from\nnumerical fitting of the spectra in (a). Experiment 2; copper deposition charge of qCu = 0.23 C. (c) U(f, t) data acquired (spectra recorded every 4 s)\nduring a silver deposition in ChCl : 2EG liquid, (d) Df0(t) data, obtained from numerical fitting of (i) the spectra in Fig. 4(c), (ii) Df0(t) data from\nExperiment 1, (b), presented for clarity and comparison, (iii) Df0(t) data from a third experiment; qCu = 0.107 C.\n3740 | Phys. Chem. Chem. Phys., 2007, 9, 3735–3743 This journal is \u0001c the Owner Societies 2007\nPu\nbl\nish\ned\n o\nn \n22\n M\nay\n 2\n00\n7.\n D\now\nnl\noa\nde\nd \nby\n U\nni\nve\nrs\nity\n o\nf L\nei\nce\nste\nr o\nn \n19\n\/0\n8\/\n20\n13\n 1\n5:\n49\n:1\n9.\n \nView Article Online\nFaradaic charge yielded a value of 550 nmol, giving a current\nefficiency of ca. 91%.) The corresponding value for silver is\n459 nmol. This shows that within an experimental error\n(typically 5–10%), all of the copper deposited on the crystal\nis replaced by silver and that the stoichiometry of the reaction\nis consistent with Scheme 1. The balance of silver may have\nbeen lost from the friable interface during transfer.\nQ factor trends\nDuring silver deposition experiments lasting over relatively\nlong time scales (t 4 30 min) we have observed that the\nimpedance curve becomes acutely attenuated towards the end\nof the deposition process. An example of this behaviour is\nshown in Fig. 4(c). The graph presented as Fig. 7(a) shows Q\nfactor data for this experiment as a function of elapsed time.\nHere, the Q factor data measured directly from the spectra are\nshown (J) as well as the Q factor data calculated from the\nbest numerical fit (TT). Good agreement between these two\napproaches is a semi-quantitative measure of the confidence in\nthe numerical model. From these data, it is clear to see that\nduring the first 40 min of the experiment the peak shape of the\nresonance curve remains fairly constant, with a Q factor of\nbetween 240 and 320. Subsequently, the Q factor falls rapidly\nand continually until the rate of frequency change approaches\nzero after 120 min. A similar trend is also evident when the\nQ factor data are plotted as a function of frequency, Df0,\nFig. 7(b). Early in the experiment, where frequency changes\nare small, Df0o 10 kHz, the Q factor remains fairly constant.\nAt later stages the increase in the magnitude of Df0 resulting\nfrom increased mass loading is accompanied by a decrease in\nQ factor. This effect is most prominent towards the end of the\ndeposition. These observations are consistent with increased\nviscoelastic losses at the crystal\/liquid interface, particularly at\nhigh crystal mass loading. This is almost certainly caused by\nan increase in the surface roughness of the silver deposit. This\nFig. 6 Acoustic impedance spectra, U(f), of (a) dry Au coated\nunpolished crystal untreated in air, Q factor = 3528, f0 = 9.97668\nMHz, hence Df0 = 0 Hz (i.e. this f0 is defined as the reference\nfrequency); (b) the same crystal (part (a)) Cu coated rinsed and dried,\nin air, Q factor = 3237, f0 = 9.94787 MHz, Df0 = \u000228.81 kHz (c) the\nsame crystal after completed silver deposition in ChCl : 2EG liquid,\nrinsed and dried in air, Q factor = 3237, f0 = 9.93166 MHz, Df0 =\n\u000245.02 kHz. (Admittance, U\/mS, is the reciprocal of the measured\nimpedance Z\/O.)\nFig. 7 Q factor data taken from Experiment 2, Fig. 5(c), plotted as a\nfunction of (a) time, the data points, J, are measured directly from\nthe spectra, the solid line represents the values ofQ calculated from the\nbest fit; (b) peak frequency, Df0.\nFig. 5 Plot of silver deposition time (i.e., time for rate frequency\nchange with time to level out (d(Df0)\/dtE 0) versus quantity of copper\nmetal deposited on the crystal. The latter is expressed as the charged\npassed, qCu, during electrolytic deposition; (J) Polished crystal sur-\nface, (K) unpolished crystal.\nThis journal is \u0001c the Owner Societies 2007 Phys. Chem. Chem. Phys., 2007, 9, 3735–3743 | 3741\nPu\nbl\nish\ned\n o\nn \n22\n M\nay\n 2\n00\n7.\n D\now\nnl\noa\nde\nd \nby\n U\nni\nve\nrs\nity\n o\nf L\nei\nce\nste\nr o\nn \n19\n\/0\n8\/\n20\n13\n 1\n5:\n49\n:1\n9.\n \nView Article Online\nobservation is confirmed by SEM analysis of one crystal\nsurface where part of the gold substrate electrode and part\nof the copper coated surface were masked off prior to silver\ndeposition. The SEM image presented as Fig. 8 shows a\nboundary region of this sample after the mask was removed\nat the end of the experiment. Here, three morphologies\ncorresponding to the gold substrate (top), copper (bottom\nright) and silver (bottom left) are clearly visible. The surface\nroughness of the silver deposit is very much greater than that\nof the underlying copper that it has displaced. The surface\nroughness of the copper is also greater than that of the\nunderlying substrate.\nRate of silver deposition\nThe rates of silver deposition d(Df0)\/dt for a range of experi-\nments was measured directly from the Df0(t) plots, see for\nexample Fig. 4(b) and (d). In most cases these data show that a\nsteady state growth phase was preceded by a much faster\ninitial rate of deposition. These data are summarised in, Fig. 9,\nand incorporate data for deposition at both polished (circles)\nand unpolished (triangles) crystal surfaces. These data show a\nwide variation (close to a factor of 10) of initial rate but no\ncorrelation with the amount of copper deposited on the\ncrystal. The variation of initial rate, however, seems most\npronounced at the unpolished crystal surfaces. On the other\nhand the steady state rates show a variation of only around a\nfactor of two (Fig. 9 insert). Again, no correlation is observed\nbetween the amount of copper present on the surface and the\nsteady state rate. These results are consistent with a model in\nwhich there is an initial rapid nucleation of silver on the\ncopper surface followed by a slower bulk growth mechanism\nthat is likely to be limited by mass transport. Eventually, this\nmechanism is terminated when there is no more copper on the\ncrystal surface.\nThe variation in initial rates can be rationalised with this\nmodel because the kinetics of nucleation are likely to be\nsensitive to small\/localised effects such as surface roughness\nand concentration of nucleation sites; it follows that the rate of\nnucleation may vary in magnitude from surface to surface in\neach experiment. In particular, at a polished surface the\nconcentration of nucleation sites may vary significantly from\nexperiment to experiment whereas at an unpolished, relatively\nrough, surface the number of nucleation sites is already large.\nThe rough and porous nature of the silver deposit as\nevidenced by SEM, AFM and QCM suggests that the steady\nstate rate of silver deposition may be limited by diffusion of the\nCu+ ions from the active surface of the crystal. This accounts\nfor the relatively small variation in steady state rates. The\nobservation that the silver deposition is sustained over long\nperiods of time (where sufficient copper is present) suggests\nthat this is possible through pores and channels in the silver\ndeposit that are penetrated by the IL solution, facilitating both\ndiffusion of Ag+ in to the deposit and Cu+ ions out. The latter\nmodel of a rough surface interpenetrated by liquid-filled pores\nand channels is also consistent with the viscoelastic losses\n(resonance damping) observed in the impedance QCM spectra\nof the crystal coated with thick silver deposits.16,17\nConclusions\nHere, we have described the first example of a sustained\ngalvanic coating of silver metal deposited on a copper surface\nfrom a non-aqueous IL. The reduction of silver ions in the IL\nis driven by the difference in redox potential with respect to\nthat of the copper (I) ion. However, the Cu(I) complex is stable\nin the IL, showing no signs of disproportionation as is seen for\nthe equivalent Cu(I) complexes in aqueous solution. This\ndifference in behavior is almost certainly attributable to the\nhigh concentration of chloride ions in the IL. Electroless\ncoatings of silver onto copper substrates from aqueous solu-\ntions are not sustainable without the use of catalysts because\nthe thin silver coating quickly deactivates the copper surface.\nFig. 8 SEM image of a polished quartz crystal showing the metal\nsurfaces of the three stages of the silver coating experiment. These are\nmarked on the image as the untreated Au region, the Cu (electrolytic)\ncoated surface, and the Ag coated surface at the end of the experiment.\n(The linear feature at the top-centre of the image is a registration\nmark, i.e., scratch).\nFig. 9 Rates of silver deposition measured as, d(Df0)\/dt, plotted as a\nfunction of the quantity of copper deposited on the crystal. The latter\nis expressed as the charge passed during electrolytic deposition. Initial\nrates: (.) polished crystal, (K) unpolished crystal surface. Initial rates\nsteady state rates: (,) polished crystal, (J) unpolished crystal surface.\n3742 | Phys. Chem. Chem. Phys., 2007, 9, 3735–3743 This journal is \u0001c the Owner Societies 2007\nPu\nbl\nish\ned\n o\nn \n22\n M\nay\n 2\n00\n7.\n D\now\nnl\noa\nde\nd \nby\n U\nni\nve\nrs\nity\n o\nf L\nei\nce\nste\nr o\nn \n19\n\/0\n8\/\n20\n13\n 1\n5:\n49\n:1\n9.\n \nView Article Online\nThe silver ions in solution can no longer access the copper\nsubstrate and the copper ions have no diffusion pathway from\nthe bulk metal substrate. Here, we have shown that during\nsilver deposition in the IL that both silver ion access to the\ncopper metal substrate and copper ion diffusion away from the\nsubstrate are maintained through pores and channels in the\nsilver deposit. Hence, the non-catalytic deposition mechanism\nis maintained by a rough surface morphology. This has been\nobserved using both SEM and AFM imaging techniques. In\naddition, QCM studies show two types of growth morphol-\nogy: (i) a relatively dense, thin, phase where peak frequency\nchanges are not accompanied by concomitant viscoelastic\nlosses (i.e., the resonant peak shape remains constant), and\n(ii) a phase after sustained growth where acute viscoelastic\ndamping of the crystal resonance is observed. The latter is\nconsistent with a very rough surface interface interpenetrated\nby the ionic liquid solution. These observations may be of\ninterest in the electroless plating industry, particularly the\nelectronics manufacturing sector. Electroless silver deposits\nof up to several microns have been obtained by dip coating in\nIL without the use of catalysts of strong inorganic acids.\nAcknowledgements\nThe authors would like to thank the EU under framework\nprogramme 6 for funding (project IONMET, http:\/\/www.\nionmet.org\/).\nReferences\n1 C. R. Shipley, US Patent 3,011,920, filed (1961).\n2 S. S. Djokic, ‘‘Electroless Deposition of Metals and Alloys’’ in\n‘‘Modern Aspects of Electrochemistry’’, ed. Brian E. Conway and\nRalph E. White, Springer US, 2002, vol. 35, pp. 51–133.\n3 J. Sun, D. R. MacFarlane and M. Forsyth, Electrochim. Acta,\n2003, 48, 1707.\n4 F. Endres, ChemPhysChem, 2002, 3, 144.\n5 Electrochemical Aspects of Ionic Liquids, ed. H. Ohno, John Wiley\n& Sons, New York, 2005.\n6 A. P. Abbott, G. Capper G, D. L. Davies and R. K. Rasheed,\nChem.–Eur. J., 2004, 10(15), 3769–3774.\n7 A. P. Abbott, D. Boothby, G. Capper, D. L. Davies and R. K.\nRasheed, J. Am. Chem. Soc., 2004, 126, 9142–9147.\n8 A. P. Abbott and K. J. McKenzie, Phys. Chem. Chem. Phys., 2006,\n8(37), 4265–4279.\n9 A. P. Abbott, G. Capper, D. Davies, R. K. Rasheed and V.\nTambyrajah, Chem. Commun., 2003, 70–71.\n10 A. P. Abbott, G. Capper, K. J. McKenzie and K. S. Ryder,\nElectrochim. Acta, 2006, 51, 4420.\n11 A. P. Abbott, G. Capper, K. J. McKenzie, A. Glidle and K. S.\nRyder, Phys. Chem. Chem. Phys., 2006, 8(36), 4214–4221.\n12 A. R. Hillman, I. Efimov and M. Skompska, Faraday Discuss.,\n2002, 121, 423–439.\n13 A. R. Hillman, A. Jackson and S. J. Martin, Anal. Chem., 2001, 73,\n540.\n14 A. R. Hillman, I. Efimov and S. K. Ryder, J. Am. Chem. Soc.,\n2005, 127, 16611.\n15 (a) G. Sauerbrey, Z. Phys., 1959, 155, 206; (b) O. Schneider, A.\nBund, A. Ispas, N. Borissenko, S. Z. El Abedin and F. Endres,\nJ. Phys. Chem. B, 2005, 109(15), 7159–7168.\n16 A. Bund, J. Solid State Electrochem., 2004, 8(3), 182–186.\n17 S. Wehner, K. Wondraczek, D. Johannsmann and A. Bund,\nLangmuir, 2004, 20(6), 2356–2360.\nThis journal is \u0001c the Owner Societies 2007 Phys. Chem. Chem. Phys., 2007, 9, 3735–3743 | 3743\nPu\nbl\nish\ned\n o\nn \n22\n M\nay\n 2\n00\n7.\n D\now\nnl\noa\nde\nd \nby\n U\nni\nve\nrs\nity\n o\nf L\nei\nce\nste\nr o\nn \n19\n\/0\n8\/\n20\n13\n 1\n5:\n49\n:1\n9.\n \nView Article Online\n"}