{"doi":"10.1080\/0968776930010203","coreId":"14379","oai":"oai:generic.eprints.org:141\/core5","identifiers":["oai:generic.eprints.org:141\/core5","10.1080\/0968776930010203"],"title":"Student reaction to parallel hypertext and menu‐based interfaces","authors":["Ramaiah, C.K.","Sulaiman, Mubarak","Meadows, A.J."],"enrichments":{"references":[{"id":1043460,"title":"A taxonomy and rule base for the selection of interaction styles'","authors":[],"date":"1991","doi":null,"raw":"Shneiderman, B. (1991), 'A taxonomy and rule base for the selection of interaction styles' in Shackel B. and Richardson, S.J. (eds), Human Factors for Informatics Usability, Cambridge, CUP, 325-342.","cites":null},{"id":201743,"title":"Designing and Implementing User Interfaces for Microcomputer Programs,","authors":[],"date":"1989","doi":null,"raw":"Hayes, B. (1989), Designing and Implementing User Interfaces for Microcomputer Programs, ESRC Programme on Taxation, Incentives and the Distribution of Income, LSE, London.","cites":null},{"id":201738,"title":"Exploring dBase IH+: The Development of a Database for Use","authors":[],"date":"1987","doi":null,"raw":"Burrough, H.C. (1987), Exploring dBase IH+: The Development of a Database for Use in the Teaching of Library and Information Studies (M.Sc. Dissertation, Loughborough University).","cites":null},{"id":201745,"title":"How do you run HyperCard projects?',","authors":[],"date":"1992","doi":null,"raw":"Muir, M. (1992), 'How do you run HyperCard projects?', Computing Teacher, 20, 10-12.","cites":null},{"id":201741,"title":"HyperCard application for teaching information systems',","authors":[],"date":"1991","doi":"10.1145\/107005.107016","raw":"Fritz, J.M. (1991), 'HyperCard application for teaching information systems', SIGCSE Bulletin, 23, 55-61.","cites":null},{"id":201739,"title":"HyperCard for the design, development and delivery of instruction',","authors":[],"date":"1989","doi":"10.1111\/j.1937-8327.1989.tb00418.x","raw":"Eckols, S.L. and Rossett, A. (1989), 'HyperCard for the design, development and delivery of instruction', Performance Improvement Quarterly, 2, 2-20.","cites":null},{"id":201740,"title":"More firms using HyperCard for training as a front end',","authors":[],"date":"1988","doi":null,"raw":"Flynn, L. (1988), 'More firms using HyperCard for training as a front end', InfoWorld, 10, 6.","cites":null},{"id":201742,"title":"The potential of HyperCard for psychological research and instruction',","authors":[],"date":"1989","doi":"10.3758\/bf03205600","raw":"Geisler-Brenstein, E. and Brenstein, R. (1989) 'The potential of HyperCard for psychological research and instruction', Behavior Research Methods, Instruments and Computers, 21, 307-311.","cites":null},{"id":201744,"title":"Using geocoded databases in teaching urban historical geography',","authors":[],"date":"1986","doi":"10.1080\/00221348608979410","raw":"Miller, R.P. (1986), 'Using geocoded databases in teaching urban historical geography', Journal of Geography, 85, 148-153.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1993","abstract":"It is often necessary to consider the question of what sort of interface is most useful for retrieving information from a particular land of database. A small database of text‐based but multi‐faceted items is used here in order to compare ease and speed of retrieval from two commonly used combinations of interface — HyperCard on an Apple Macintosh and dBase III+ on a PC. For the restricted range of tasks employed here, the latter combination appears to be more acceptable to students with limited computer experience. However, in more general terms, the acceptability of an interface for information retrieval depends on what particular aspect of information retrieval is being emphasized, and what conceptual frameworks students bring to their tasks","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14379.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/141\/1\/ALT_J_Vol1_No2_1993_Student%20reaction%20to%20parallel%20h.pdf","pdfHashValue":"5de1062c0ff324228583c7da66e10bc05924fa6f","publisher":"Universit of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:141<\/identifier><datestamp>\n      2011-04-04T09:27:50Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/141\/<\/dc:relation><dc:title>\n        Student reaction to parallel hypertext and menu‐based interfaces<\/dc:title><dc:creator>\n        Ramaiah, C.K.<\/dc:creator><dc:creator>\n        Sulaiman, Mubarak<\/dc:creator><dc:creator>\n        Meadows, A.J.<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        It is often necessary to consider the question of what sort of interface is most useful for retrieving information from a particular land of database. A small database of text‐based but multi‐faceted items is used here in order to compare ease and speed of retrieval from two commonly used combinations of interface — HyperCard on an Apple Macintosh and dBase III+ on a PC. For the restricted range of tasks employed here, the latter combination appears to be more acceptable to students with limited computer experience. However, in more general terms, the acceptability of an interface for information retrieval depends on what particular aspect of information retrieval is being emphasized, and what conceptual frameworks students bring to their tasks.<\/dc:description><dc:publisher>\n        Universit of Wales Press<\/dc:publisher><dc:date>\n        1993<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/141\/1\/ALT_J_Vol1_No2_1993_Student%20reaction%20to%20parallel%20h.pdf<\/dc:identifier><dc:identifier>\n          Ramaiah, C.K. and Sulaiman, Mubarak and Meadows, A.J.  (1993) Student reaction to parallel hypertext and menu‐based interfaces.  Association for Learning Technology Journal, 1 (2).  pp. 17-26.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776930010203<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/141\/","10.1080\/0968776930010203"],"year":1993,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Student reaction to parallel hypertext and\nmenu-based interfaces\nC.K. Ramaiah, Mubarak Sulaiman and A.J. Meadows\nDepartment of Information and Library Studies, Loughborough University, Lough-\nborough LE11 3TU\nAbstract\nIt is often necessary to consider the question of what sort of interface is most useful\nfor retrieving information from a particular land of database. A small database of\ntext-based but multi-faceted items is used here in order to compare ease and speed\nof retrieval from two commonly used combinations of interface — HyperCard on an\nApple Macintosh and dBase III+ on a PC. For the restricted range of tasks\nemployed here, the latter combination appears to be more acceptable to students\nwith limited computer experience. However, in more general terms, the acceptability\nof an interface for information retrieval depends on what particular aspect of\ninformation retrieval is being emphasized, and what conceptual frameworks students\nbring to their tasks.\nIntroduction\nMany types of interface to electronic databases now exist. However, they can readily be\ngrouped into a small number of categories according to their style of approach. Thus\nShneiderman (1991) has recently suggested a taxonomy which distinguishes five styles of\ninteraction. These consist of: menu selection, form fill-in, command language, natural\nlanguage, and direct manipulation. They can be used as a convenient basis for considering and\ncomparing the properties of different types of interface.\nInterfaces aimed at beginners in electronic information retrieval typically rely heavily on\ncomputer-initiated interaction with users. Two of the commonest such interfaces currently are\n(1) menu-based database management systems (DBMS) and (2) hypertext systems. The\ndifferences between these interfaces correspond to two differing interaction styles in\nShneiderman's classification. The former come within the 'menu selection' group, while the\nlatter are classified under 'direct manipulation'. The styles, and correspondingly the interfaces,\n17\nC.K. Ramaiah et al\nStyle\nMenu selection\nDirect manipulation\nAdvantages\nLittle training required.\nEasy structure for\ndecision-making.\nEasy to remember, once\nlearnt. High subjective\nsatisfaction rating.\nStudent reaction to hypertext and menus\nDisadvantages\nAccess via a sequence\nof menus may be\nirritating. Lack of\nflexibility.\nMay be cumbersome to\ninitiate some actions.\nNavigation may be\ndifficult.\nTable 1: Advantages\/disadvantages of different interaction styles\ndiffer in their advantages and disadvantages, as indicated below in Table 1 (where only those\nrelevant to the present study have been included).\nThese particular two interaction styles are especially interesting from the viewpoint of\nteaching requirements, because they relate to a fundamental distinction (which is, perhaps,\nunderstressed in Shneiderman's formulation). This concerns the difference between ease of\nlearning (the ability of a novice user to become proficient in using a system with minimal\ntraining) and ease of use (the ability of knowledgeable users to perform tasks with minimum\nimpediment). Our main purpose here is to use Shneiderman's differentiation of styles, with\nthis slight change of emphasis, to compare the introductory presentation of two popular\ndatabase interfaces to university students.\nThe present study is concerned with evaluating the comparative usability of a menu-based\ninterface (dBase m+ and PC) and a hypertext interface (HyperCard and Macintosh). For this\nstudy of 'usability', the specific set of users comprised student volunteers from the\nDepartment of Information and Library Studies at Loughborough University. They were\nobserved while using the two computer combinations in an isolated laboratory as a means of\nretrieving a series of items from a common database. The study concentrated on examining\ntwo parameters: performance in answering a set of test questions, and user ratings.\nThe two commercial packages investigated here - dBase m + and HyperCard - have different\noverall purposes. The dBase III+ package is a relational database management software\nprogram. HyperCard is a programming system which uses a graphical user-interface to relate\non-screen objects to an underlying database. However, both obviously provide information-\nretrieval facilities which can be studied in parallel. It is hoped that the results will cast some\nlight on the wider question of the differences between menu-based and hypertext-based\ninformation retrieval.\nBoth packages are widely used for educational purposes. There have been several general\nstudies of ways in which HyperCard can be employed in teaching (Eckols and Rossett, 1989;\nMuir, 1992) and training (Flynn, 1988). There has also been a more limited number of\n18\nALTJ VOLUME 1 NUMBER 2\nsubject-specific studies. The most interesting of these for the present work have been in\npsychology (Giesler-Brenstein and Brenstein, 1989) and in teaching information systems\n(Fritz, 1991). There have been considerably fewer studies of the use of dBase HI+ in teaching.\nSome attention has been paid to it in terms of evaluating different DBMS for teaching (Miller,\n1986), but there has been little in generally available sources on its use for teaching\ninformation and library studies (Burrough, 1987).\nMethod\nThe database used in this study was a catalogue of teaching software prepared by the\nComputers in Training Initiative Centre for Library and Information Studies, which is situated\nin the department at Loughborough. This database has the advantage of being of direct\ninterest to library and information students. It is a small catalogue (containing 40 entries), but\neach entry may need to be retrieved under a range of headings. Altogether there are 11 aspects\nof each software entry in terms of which retrieval might be necessary (i.e. who uses the\nsoftware for teaching, what sort of teaching is involved, how much does the software cost,\netc.). All retrieval headings are available simultaneously on the screen. They comprise:\nsoftware designation, card number, type of software, price, author, author address, known\nusers, hardware requirements, availability, supplier, teaching applications.\nThe HyperCard and dBase IH+ interfaces to the database were prepared in parallel by the\nauthors of this paper. The intention in each case was to provide an interface which was\nacceptable to relative beginners in the art of information retrieval, but which also exploited\nthe particular advantages of each type of interface. Both versions were pre-tested with\nstudents and staff from Loughborough and elsewhere. Modifications were made, where\nnecessary, in the light of this pre-testing. It should be emphasized that although two interfaces\nwere used, the catalogue content remained the same for both.\nVolunteers were obtained from among undergraduate and postgraduate students in the\nDepartment of Information and Library Studies. Altogether 40 students participated, 9 of\nwhom were postgraduate research students, 22 postgraduate Master's course students and 9\n' undergraduate students. They were asked to answer a series of questions concerning the\ncontents of the database using successively the HyperCard\/Mac and dBase\/PC combinations.\nTo allow for transfer effects (i.e. experience from the first trial affecting the results of the\nsecond), the participants were divided into two groups - which will be referred to from here\non as Group A and Group B - each consisting of 20 members. Members of Group A used the\nHyperCard\/Mac combination first, while members of Group B used the dBase\/PC\ncombination first.\nGroup A consisted of 14 females and 6 males, whereas Group B contained 6 females and 14\nmales. The spread of ages of the two groups was similar, with averages of 31.3 years for\nGroup A and 33.0 years for Group B (with standard deviations of +\/- 7.7 and +\/- 5.9,\nrespectively). In each group, 18 members had had previous training on computers (mainly\nmicrocomputers), while two had not. Previous training on computers had mainly been on PCs,\nwith word-processing as the most popular activity. Of Group A members, 13 had previous\nexperience with the Macintosh as compared with 9 members of Group B. Previous\nacquaintance with HyperCard and dBase III+ was similar between the two groups, as\nindicated in Table 2.\n19\nC.K. Ramaidh et al Student reaction to hypertext and menus\nPrevious experience with HyperCard\nPrevious experience with dBase m +\nGroup A\nYes No\n3 15\n8 10\nGroup B\nYes No\n5 13\n11 7\nTable 2: Participants' prior acquaintance with HyperCard and dBase 7ZT+\nThe participants consisted of a mix of 20 overseas students and 20 UK-based students, evenly\ndivided (10 overseas and 10 home-based students) in each group. This division formed an\nimportant part of the experiment, since the overseas students differed systematically in terms\nof background from home-based students. In general, overseas students were more\nexperienced in terms of the use of catalogues (i.e. their acquaintance with the domain under\ntest was better), but they had had appreciably less experience with computers (i.e. their system\nknowledge was less extensive). The interesting question, therefore, is whether overseas\nstudents have differing training needs from other students.\nThe evaluation exercises were carried out with one member of Group A and one of Group B\nparticipating simultaneously. As far as possible, each pair of participants was matched (for\nexample if the Group A participant was an older overseas student, so would be the Group B\nparticipant). This was intended to compensate for any changes in the environment (time of\nday, external noise, etc.) as the evaluation exercises proceeded.\nStudents were set a series of 12 questions concerning the contents of the catalogue. Finding\nthe answers entailed accessing different parts of the database, starting each time from the\ninitial screen. The questions were graded so that the routes by which the answers could be\nretrieved varied from the obvious (in terms of the initial menu) and quick (in terms of the\nnumber of steps required) to the less obvious and more roundabout. In terms of this grading,\nthe questions were asked in random sequence (to allow for any learning experience that might\naccrue during the experiment itself). The time taken to find an answer to each question was\nrecorded by an observer, together with the number of steps required to answer the question.\n(A 'step' here is defined as any input by the user to the system, for example a command to\nmove from one screenful of information to another.) The most efficient routes for answering\nthe questions had been worked out beforehand by the authors. The number of steps taken by a\nparticipant was compared with this predetermined figure: any excess was recorded under the\nheading 'extra steps'. The intention here was to examine whether differences in domain\nknowledge and systems knowledge were reflected in the number of steps required to answer a\nquestion.\nResults from the performance tests\nTable 3 shows the times taken (in seconds) averaged over all the participants' answers, along\nwith the number of extra steps similarly averaged. There is no significant difference (at the\n1% level) in times and extra steps taken between Groups A and B. (The implication is that\n20\nALT-J VOLUME 1 NUMBER 2\nGroup A\nGroup B\nNumber\nin group\n20\n20\nTime\ntaken for\nHyperCard\n136\n126\nTime\ntaken for\ndBase m +\n104\n110\nExtra steps\nfor\nHyperCard\n6.4\n5.9\nExtra steps\nfor\ndBase m +\n1.8\n2.0\nTable 3: A comparison of retrieval (Group A v. Group B)\nany transfer effect works to the same extent in either direction.) However, there are\ndifferences in both time and steps taken between HyperCard and dBase m+, with the former\noffering a less rapid and less obvious passage for the user. (Only the difference in the number\nof steps is significant at the 1% level.)\nAn alternative breakdown of the data provides additional illumination. Table 4 shows the time\nand extra steps taken separately for overseas and home-based students. The significant\ndifference between HyperCard and dBase III+ times remains for both groups, but the overseas\nOverseas\nHome-based\nNumber\nin group\n20\n20\nTime\ntaken for\nHyperCard\n165\n98\nTime\ntaken for\ndBase m +\n137\n77\nExtra steps\nfor\nHyperCard\n6.7\n5.7\n•Extra steps\nfor\ndBase m +\n1.5\n1.5\nTable 4: A comparison for retrieval (overseas students v. home-based students)\nstudents clearly have greater problems in rapid retrieval than home-based students (t = 4.075\nfor HyperCard and 3.760 for dBase HI+, as compared with a two-tailed probability of 2.704 at\nthe 1% level.) There was, however, no significant difference in the number of extra steps\ntaken.\nThe value of prior acquaintance with the system for rapid retrieval can be examined by\nlooking separately at the results for students who had used a Mac previously. (Since most of\nthe students had a prior acquaintance with PCs, this factor could not be examined separately.)\nAs Table 5 shows, prior experience of a Mac appreciably affected speed of extracting\n21\nC.K. Ramaiah et al Student reaction to hypertext and menus\nUsed Mac previously\nNot used Mac previously\nNumber in\ngroup\n22\n18\nTime taken for\nHyperCard\n105\n164\nExtra steps for\nHyperCard\n5.4\n7.1\nTable 5: A comparison of retrieval (Mac users v. non-users)\ninformation via HyperCard (t = 3.20 at the 1% level), but not the number of extra steps taken.\nIt will be noted that the average time recorded for experienced Mac users retrieving\ninformation via HyperCard is similar to the average time recorded in Table 3 for retrieval by\nall users via dBase EH+.\nThis may be compared with the effect of prior knowledge of the HyperCard software. As\nTable 6 shows, there is no significant difference in retrieval times between those who had\nPrevious experience\nof HyperCard\nNo previous experience\nNumber in\ngroup\n8\n32\nTime taken for\nHyperCard\n124\n133\nExtra steps for\nHyperCard\n6.1\n6.3\nTable 6: A comparison of retrieval (HyperCard users v. non-users)\nPrevious experience\nof dBase m+\nNo previous experience\nNumber in\ngroup\n19\n21\nTime taken for\nHyperCard\n97\n116\nExtra steps for\nHyperCard\n1.6\n2.1\nTable 7: A comparison of retrieval (dBase III+ users v. non-users)\n22\nALT-J ' VOLUME 1 NUMBER 2\nused HyperCard before, and those who had not (though the number of students in the former\ncategory was small). Almost half of the students had used dBase DI+ before. Table 7 suggests\nsome difference in retrieval speed by this group, but it is not significant at the 1% level.\nResults from the user ratings\nAt the end of the exercises on Mac\/HyperCard and PC\/dBase m+, participants were asked to\ncomplete a questionnaire recording their subjective assessment of the two interfaces. In the\nfirst place, they were asked with which interface they found it easier to retrieve information\nrapidly. The responses (contained in Table 8) indicate a strong preference among both\noverseas and home-based students for dBase III+. This accords with the picture derived from\nthe timings in Table 3 - a point worth noting, since some evidence exists for supposing that\nusers are not always able to recognize which is the fastest interface (Hayes, 1989). There was\nmuch less agreement concerning which was the more flexible interface for seeking\ninformation. Table 9 suggests a fairly even division of opinion, but that conceals an\nappreciable difference between overseas and home-based students. The latter were appreciably\nmore in favour of HyperCard, and the former in favour of dBase III+.\nThe participants were next asked about the appearance of the information on the screen and\nhow well they could absorb it. As Table 10 indicates, both interfaces proved to be generally\nHyperCard\ndBase m +\nEqual\nTotal\n8\n28\n4\nOverseas\n5\n13\n2\nHome-based\n3\n15\n2\nTable 8: Which systems permitted more rapid retrieval?\nHyperCard\ndBase ffl+\nTotal\n22\n18\n• Overseas\n9\n11\nHome-based\n13\n7\nTable 9: Which system was more flexible?\n23\nC.K. Ramaiah et al Student reaction to hypertext and menus\nUser grading\nPoor\nAcceptable\nGood\nHyperCard\n2\n15\n23\ndBase m +\n0\n11\n29\nTable 10: Relative assessment of presentation\nUser grading\nHard\nFairly hard\nFairly easy\nEasy\nHyperCard\n3\n10\n14\n13\ndBase m+\n0\n2\n16\n22\nTable 11: Relative assessment of movement between screens\nUser grading\nPoor\nAcceptable\nGood\nHyperCard\n8\n19\n13\ndBase m+\n0\n11\n29\nTable 12: Relative assessment of organization for rapid retrieval\nacceptable in this respect. The main difference was that some users found the HyperCard\nscreen too full of different types of information for a beginner to disentangle easily. A typical\ncomment was that dBase III+ was easier to read, but not so attractive as HyperCard.\n(Overseas and home-based students agreed in these comments.)\n24\nALT-J VOLUME 1 NUMBER 2\nParticipants were next questioned concerning ease of movement from one screenful of\ninformation to another. Their responses (Table 11) • show that greater difficulty was\nencountered with HyperCard.\nThis point was taken up in a further question, which asked participants to assess how\nwell-organized the information was to allow rapid retrieval via the two interfaces. Their\nresponses (Table 12) clearly favour dBase m+, in correspondence both with observation of\ntheir retrieval activities and of the measured times.\nConclusion\nAlong with the hands-on tests and the questionnaires, the student participants were asked to\nwrite short essays on their opinions of the two systems they had used. Data from all three\nsources has been used here in assessing the results: agreement between them seems to be\ngood.\nIt is clear, in the first place, that dBase 111+ and HyperCard provide good examples of\nShneiderman's 'menu selection' and 'direct manipulation' styles, respectively. As he suggests,\nmenu selection is easier; navigation, for the latter, is more difficult; and so on. In practice, the\nrelative importance of the advantages and disadvantages he lists depends on the form of the\ninterface as much as on the style. In this case, the initial problems of handling a Mac\ncompounded the problems of handling a hypertext interface for the first time. A typical\ncomment was: 'HyperCard looks more user-friendly, but the use of a mouse is not as familiar\nto me as using a keyboard; so I prefer dBase m+' .\nHowever, ultimate judgement of an interface must depend on its suitability for carrying out\nthe kind of task that immediately concerns the user. For library and information students, the\ntypical requirement for this kind of database is rapid retrieval. As the results show,\nexperienced Mac users were retrieving information via the HyperCard interface at only about\nthe same rate as average users of dBase III+. This disadvantage outweighed the advantages of\nHyperCard for many students. As one of them commented: 'I thought that PC\/dBase m+ was\nclearly laid out, uncluttered and could get the required information without resorting to\n\"gimmicks\". The Mac\/HyperCard combination is more fun to use, but if information finding\nis the main prerequisite, then PC\/dBase III+ wins.'\nOverseas students were even more strongly in favour of dBase HI+ than home-based students.\nFor example, home-based students agreed with the implication of Shneiderman's classification\nthat HyperCard was a more flexible interface; this was less accepted by overseas students.\nHere, it seems from the responses that their greater domain knowledge over other students is\nat work. The dBase III+ interface resembles more closely the cataloguing approach with\nwhich most overseas students are well acquainted, and they therefore find it easier to accept.\nThe implications for teaching are twofold. First, new forms of interface (hi this case,\nhypertext) may best be presented initially in terms of their special capabilities, rather than as\nan alternative for standard activities which may fit better - from a student's viewpoint - into\nanother framework (and so a different interface). Secondly, the greater the knowledge students\nhave of a particular domain, the more likely they are to prefer an interface that fits their\nconceptual framework.\n'25\nC.K. Ramaiah et al Student reaction to hypertext and menus\nReferences\nBurrough, H.C. (1987), Exploring dBase IH+: The Development of a Database for Use in the\nTeaching of Library and Information Studies (M.Sc. Dissertation, Loughborough University).\nEckols, S.L. and Rossett, A. (1989), 'HyperCard for the design, development and delivery of\ninstruction', Performance Improvement Quarterly, 2, 2-20.\nFlynn, L. (1988), 'More firms using HyperCard for training as a front end', InfoWorld, 10, 6.\nFritz, J.M. (1991), 'HyperCard application for teaching information systems', SIGCSE\nBulletin, 23, 55-61.\nGeisler-Brenstein, E. and Brenstein, R. (1989) 'The potential of HyperCard for psychological\nresearch and instruction', Behavior Research Methods, Instruments and Computers, 21,\n307-311.\nHayes, B. (1989), Designing and Implementing User Interfaces for Microcomputer Programs,\nESRC Programme on Taxation, Incentives and the Distribution of Income, LSE, London.\nMiller, R.P. (1986), 'Using geocoded databases in teaching urban historical geography',\nJournal of Geography, 85, 148-153.\nMuir, M. (1992), 'How do you run HyperCard projects?', Computing Teacher, 20, 10-12.\nShneiderman, B. (1991), 'A taxonomy and rule base for the selection of interaction styles' in\nShackel B. and Richardson, S.J. (eds), Human Factors for Informatics Usability, Cambridge,\nCUP, 325-342.\n26\n"}