{"doi":"10.1136\/oem.2007.037002","coreId":"141217","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/4224","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/4224","10.1136\/oem.2007.037002"],"title":"The burden of cancer at work: estimation as the first step to prevention","authors":["Rushton, L.","Hutchings, S.","Brown, T. P."],"enrichments":{"references":[{"id":37930387,"title":"A meta-analysis of bladder cancer and diesel exhaust exposure. Epidemiology","authors":[],"date":"2001","doi":"10.1097\/00001648-200101000-00021","raw":"Boffetta P, Silverman D. A meta-analysis of bladder cancer and diesel exhaust exposure. Epidemiology 2001 ;12:1 25–30.","cites":null},{"id":37930407,"title":"A meta-analysis of painting exposure and cancer mortality.","authors":[],"date":null,"doi":"10.1046\/j.1525-1500.1998.00a47.x","raw":"Chen R, Seaton A. A meta-analysis of painting exposure and cancer mortality. Cancer Detect Prev 1 998;22:533–9.","cites":null},{"id":37930380,"title":"A mortality study of workers at seven beryllium processing plants.","authors":[],"date":"1992","doi":"10.1002\/ajim.4700220610","raw":"Ward E, Okun A, Ruder A, et al. A mortality study of workers at seven beryllium processing plants. Am J Ind Med 1992;22:885–904.","cites":null},{"id":37930377,"title":"A review and meta-analysis of formaldehyde exposure and leukaemia. Regul Toxicol Pharmacol","authors":[],"date":"2004","doi":null,"raw":"Collins JJ, Lineker GA. A review and meta-analysis of formaldehyde exposure and leukaemia. Regul Toxicol Pharmacol 2004;40:81–91.","cites":null},{"id":37930410,"title":"An assessment of occupational exposure to polycyclic aromatic hydrocarbons in the UK. Ann Occup Hyg","authors":[],"date":"2006","doi":"10.1093\/annhyg\/mel010","raw":"Unwin J, Cocker J, Scobbie E, et al. An assessment of occupational exposure to polycyclic aromatic hydrocarbons in the UK. Ann Occup Hyg 2006;50:395–403.","cites":null},{"id":37930367,"title":"An overview of methods for calculating the burden of disease due to specific risk factors. Epidemiology","authors":[],"date":"2006","doi":"10.1097\/01.ede.0000229155.05644.43","raw":"Steenland K, Armstrong B. An overview of methods for calculating the burden of disease due to specific risk factors. Epidemiology 2006;17:512–19.","cites":null},{"id":37930423,"title":"Avoidable cancers in the Nordic countries.","authors":[],"date":null,"doi":"10.1111\/j.1600-0463.1997.tb05617.x","raw":"Dreyer L, Andersen A, Pukkala E. Avoidable cancers in the Nordic countries. Occupation. APMIS 1 997;105(Suppl 76):68–79.","cites":null},{"id":37930408,"title":"Bladder cancer risk in painters: a review of the epidemiological evidence, 1989–2004. Cancer Causes Control","authors":[],"date":"2005","doi":"10.1007\/s10552-005-3636-5","raw":"Bosetti C, Pira E, La Vecchia C. Bladder cancer risk in painters: a review of the epidemiological evidence, 1989–2004. Cancer Causes Control 2005;16:997–1008.","cites":null},{"id":37930406,"title":"Cancer among farmers: a meta-analysis.","authors":[],"date":null,"doi":"10.1016\/s1047-2797(97)00120-8","raw":"Acquavella JF, Olsen G, Cole P, etal. Cancer among farmers: a meta-analysis. Ann Epidemiol 1 998;8:64–74.","cites":null},{"id":37930398,"title":"Cancer mortality among shoe manufacturing workers: an analysis of two cohorts. Occup Environ Med","authors":[],"date":"1996","doi":"10.1136\/oem.53.6.394","raw":"Fu H, Demers PA, Costantini AS, et al. Cancer mortality among shoe manufacturing workers: an analysis of two cohorts. Occup Environ Med 1996;53:394–8.","cites":null},{"id":37930388,"title":"Cancer mortality in workers exposed to phenoxy herbicides, chlorophenols, and dioxins: an expanded and updated international cohort study. Am JEpidemiol 1997;145:1061–75.","authors":[],"date":null,"doi":"10.1093\/oxfordjournals.aje.a009069","raw":"Kogevinas M, Becher H, Benn T. Cancer mortality in workers exposed to phenoxy herbicides, chlorophenols, and dioxins: an expanded and updated international cohort study. Am JEpidemiol 1997;145:1061–75.","cites":null},{"id":37930411,"title":"Cancer risk from occupational and environmental exposure to polycyclic aromatic hydrocarbons.","authors":[],"date":null,"doi":null,"raw":"Boffetta P, Jourenkova N, Gustavsson P. Cancer risk from occupational and environmental exposure to polycyclic aromatic hydrocarbons. Cancer Causes Control 1 997;8:444–72.","cites":null},{"id":37930412,"title":"Cancer risk in asphalt workers and roofers: review and metaanalysis of epidemiologic studies.","authors":[],"date":null,"doi":"10.1002\/ajim.4700260602","raw":"Partanen T, Boffetta P. Cancer risk in asphalt workers and roofers: review and metaanalysis of epidemiologic studies. Am J Ind Med 1 994;26:721 –40.","cites":null},{"id":37930395,"title":"Cancer risks in hairdressers: assessment of carcinogenicity of hair dyes and gels.","authors":[],"date":null,"doi":"10.1002\/ijc.11040","raw":"Czene K, Tiikkaja S, Hemminki K. Cancer risks in hairdressers: assessment of carcinogenicity of hair dyes and gels. IntJ Cancer 2003;105:108–12.","cites":null},{"id":37930364,"title":"Carcinogenicity of polycyclic aromatic hydrocarbons. Lancet Oncol","authors":[],"date":"2005","doi":"10.1016\/s1470-2045(05)70458-7","raw":"Straif K, Baan R, Grosse Y, et al. Carcinogenicity of polycyclic aromatic hydrocarbons. Lancet Oncol 2005;6:931.","cites":null},{"id":37930433,"title":"Causal models in epidemiology: past inheritance and genetic future. Environ Health","authors":[],"date":"2006","doi":null,"raw":"Vineis P, Kriebel D. Causal models in epidemiology: past inheritance and genetic future. Environ Health 2006;5:21.","cites":null},{"id":37930359,"title":"Causes of cancer in the world: comparative risk assessment of nine behavioural and environmental risk factors.","authors":[],"date":null,"doi":"10.1016\/s0140-6736(05)67725-2","raw":"Danaeii G, Vander Hoorn S, Lopez AD, et al. Causes of cancer in the world: comparative risk assessment of nine behavioural and environmental risk factors. Lancet 2005;366:1 784–93.","cites":null},{"id":37930376,"title":"Cumulative exposure to arsenic and its relationship to respiratory cancer among copper smelter employees.","authors":[],"date":null,"doi":null,"raw":"Lee-Feldstein A. Cumulative exposure to arsenic and its relationship to respiratory cancer among copper smelter employees. J Occup Environ Med 1986;28:296–302.","cites":null},{"id":37930430,"title":"Current magnitude of occupational disease in the United States: Estimates for New","authors":[],"date":"1989","doi":"10.1111\/j.1749-6632.1989.tb13568.x","raw":"Landrigan PJ, Markowitz S. Current magnitude of occupational disease in the United States: Estimates for New York. In: Landrigan PJ, Selikoff IJ, eds. Occupational health in the 1990s. Developing a platform for disease prevention. New York: Annals of New York Academy of Science, 1989: 27–45.","cites":null},{"id":37930425,"title":"Dying for work: the magnitude of US mortality from selected causes of death associated with occupation.","authors":[],"date":null,"doi":"10.1002\/ajim.10216","raw":"Steenland K, Burnett C, Lalich N, etal. Dying for work: the magnitude of US mortality from selected causes of death associated with occupation. Am J Ind Med 2003;43:461 –82.","cites":null},{"id":37930427,"title":"Epidemiologic estimate of the proportion of fatalities related to occupational factors in Finland.","authors":[],"date":null,"doi":"10.5271\/sjweh.605","raw":"Nurminen MM, Karjalainen A. Epidemiologic estimate of the proportion of fatalities related to occupational factors in Finland. ScandJ WorkEnviron Health 2001;27:161–21","cites":null},{"id":37930382,"title":"Epidemiologic studies of chrome and cancer mortality: a series of meta-analyses. Regul Toxicol Pharmacol","authors":[],"date":"2005","doi":"10.1016\/j.yrtph.2005.06.009","raw":"Cole P, Rodu B. Epidemiologic studies of chrome and cancer mortality: a series of meta-analyses. Regul Toxicol Pharmacol 2005;43:225–31.","cites":null},{"id":37930439,"title":"Equation for combining AFs where exposed populations overlap but are independent and risk estimates are assumed to be multiplicative AFoverall = 1-Pk(1 -AFk) for the k exposures in the set","authors":[],"date":null,"doi":null,"raw":"Equation for combining AFs where exposed populations overlap but are independent and risk estimates are assumed to be multiplicative AFoverall = 1-Pk(1 -AFk) for the k exposures in the set","cites":null},{"id":37930437,"title":"Equation to estimate the proportion of the population exposed Pr(E) = Ne(REP)\/Np(REP) where Np(REP) = numbers ever of working age during the REP from population estimates for the relevant age cohorts in the target year","authors":[],"date":"2004","doi":null,"raw":"Equation to estimate the proportion of the population exposed Pr(E) = Ne(REP)\/Np(REP) where Np(REP) = numbers ever of working age during the REP from population estimates for the relevant age cohorts in the target year (2004)","cites":null},{"id":37930374,"title":"Estimating the number of asbestosrelated lung cancer deaths","authors":[],"date":"1980","doi":null,"raw":"Darnton AJ, McElvenny DM, Hodgson JT. Estimating the number of asbestosrelated lung cancer deaths in Great Britain from 1980 to 2000. Ann Occup Hyg 2006;50:29–38.","cites":null},{"id":37930393,"title":"Ethylene oxide cancer risk assessment based on epidemiological data: application of revised regulatory guidelines.","authors":[],"date":null,"doi":"10.1111\/j.1539-6924.1999.tb01134.x","raw":"Teta MJ, Sielken RJJ, Valdez-Flores C. Ethylene oxide cancer risk assessment based on epidemiological data: application of revised regulatory guidelines. Risk Analysis 1 999;19:1 135–55.","cites":null},{"id":37930422,"title":"Evaluations of Carcinogenicity: an updating ofIARC monographs Vols 1 to 42. IARC Monographs on the Evaluation of the Carcinogenic Risk of Chemicals to Humans. Lyon: International Agency for Research on Cancer,","authors":[],"date":"1987","doi":"10.1002\/food.19890330516","raw":"IARC. Overall Evaluations of Carcinogenicity: an updating ofIARC monographs Vols 1 to 42. IARC Monographs on the Evaluation of the Carcinogenic Risk of Chemicals to Humans. Lyon: International Agency for Research on Cancer, 1987.","cites":null},{"id":37930391,"title":"Exposure to environmental tobacco smoke and the risk of lung cancer: a meta-analysis. Lung Cancer","authors":[],"date":"2000","doi":"10.1016\/s0169-5002(99)00093-8","raw":"Zhong L, Goldberg M, Parent ME, et al. Exposure to environmental tobacco smoke and the risk of lung cancer: a meta-analysis. Lung Cancer 2000;27:3–18.","cites":null},{"id":37930400,"title":"Exposure-response models based on extended follow-up of a cohort mortality study in the automobile industry.","authors":[],"date":"2001","doi":"10.5271\/sjweh.611","raw":"Eisen EA, Bardin J, Gore R, et al. Exposure-response models based on extended follow-up of a cohort mortality study in the automobile industry. Scand J Work Environ Health 2001 ;27:240–9.","cites":null},{"id":37930392,"title":"Extended follow-up of a cohort of British chemical workers exposed to formaldehyde.","authors":[],"date":null,"doi":"10.1093\/jnci\/djg046","raw":"Coggon D, Harris EC, Poole J, et al. Extended follow-up of a cohort of British chemical workers exposed to formaldehyde. J Natl Cancer Inst 2003;95:1 608–15.","cites":null},{"id":37930357,"title":"Global and regional burden of disease and risk factors, 2001: systematic analysis of population health data.","authors":[],"date":null,"doi":"10.1016\/s0140-6736(06)68770-9","raw":"Lopez AD, Mathers CD, Ezzati M, et al. Global and regional burden of disease and risk factors, 2001: systematic analysis of population health data. Lancet 2006;367:1 747–57.","cites":null},{"id":37930413,"title":"Health risks of radon. Chilton: National Radiological Protection Board,","authors":[],"date":"2000","doi":null,"raw":"NRPB. Health risks of radon. Chilton: National Radiological Protection Board, 2000.","cites":null},{"id":37930363,"title":"IARC Carcinogen update. Environ Health Perspect","authors":[],"date":"2005","doi":"10.1289\/ehp.113-a580","raw":"Rousseau M-C, Straif K, Siemiatycki J. IARC Carcinogen update. Environ Health Perspect 2005;113:A580.","cites":null},{"id":37930397,"title":"Lead and cancer in humans:where are we now?","authors":[],"date":null,"doi":"10.1002\/1097-0274(200009)38:3<295::aid-ajim8>3.0.co;2-l","raw":"Steenland K, Boffetta P. Lead and cancer in humans:where are we now? Am J Ind Med 2000;38:295–99.","cites":null},{"id":37930361,"title":"Listing occupational carcinogens. Environ Health Perspect","authors":[],"date":"2004","doi":"10.1289\/ehp.7047","raw":"Siemiatycki J, Richardson L, Straif K, etal. Listing occupational carcinogens. Environ Health Perspect 2004;112:1447–59.","cites":null},{"id":37930381,"title":"lung and prostate cancer: a systematic review of recent epidemiological data.","authors":[],"date":null,"doi":"10.1080\/10937400306465","raw":"Verougstraete V, Lison D, Hotz P. Cadmium, lung and prostate cancer: a systematic review of recent epidemiological data. J Toxicol Environ Health Part B: Critical Reviews 2003;6:227–56.","cites":null},{"id":37930402,"title":"Lung cancer among newspaper printers exposed to ink mist: a study of trade union members in Manchester,","authors":[],"date":null,"doi":"10.1136\/oem.51.2.87","raw":"Leon DA, Thomas P, Hutchings SJ. Lung cancer among newspaper printers exposed to ink mist: a study of trade union members in Manchester, England. Occup Environ Med 1 994;51 :87–94.","cites":null},{"id":37930409,"title":"Lung cancer risk after exposure to polycyclic aromatic hydrocarbons: a review and meta-analysis.","authors":[],"date":null,"doi":"10.1289\/ehp.6895","raw":"Armstrong B, Hutchinson E, Unwin J, et al. Lung cancer risk after exposure to polycyclic aromatic hydrocarbons: a review and meta-analysis. Environ Health Perspect 2004;1 12:970–8.","cites":null},{"id":37930384,"title":"Lung cancer risk in hard-metal workers.","authors":[],"date":"1998","doi":"10.1093\/oxfordjournals.aje.a009631","raw":"Moulin JJ, Wild P, Romazini S, et al. Lung cancer risk in hard-metal workers. Am J Epidemiol 1998;148:241–8.","cites":null},{"id":37930436,"title":"Lung function decrease in relation to pneumoconiosis and exposure to quartz-containing dust in construction workers. Am J Ind Med 2003;43:574–83. STATISTICAL APPENDIX Formulae used in the estimation of attributable fraction","authors":[],"date":null,"doi":"10.1002\/ajim.10229","raw":"Tjoe-Nij E, De Meer G, Smit J, et al. Lung function decrease in relation to pneumoconiosis and exposure to quartz-containing dust in construction workers. Am J Ind Med 2003;43:574–83. STATISTICAL APPENDIX Formulae used in the estimation of attributable fraction","cites":null},{"id":37930379,"title":"Lymphohaematopoeitic cancer risk amongst chemical workers exposed to benzene.","authors":[],"date":null,"doi":null,"raw":"Bloemen LJN, Youk AO, Bradley TD, et al. Lymphohaematopoeitic cancer risk amongst chemical workers exposed to benzene. Occup Environ Med 2004;61 :270–4.","cites":null},{"id":37930373,"title":"Malignant mesothelioma: attributable risk of asbestos exposure. Occup Environ Med","authors":[],"date":"1994","doi":"10.1136\/oem.51.12.804","raw":"Spirtas R, Heineman EF, Bernstein L, etal. Malignant mesothelioma: attributable risk of asbestos exposure. Occup Environ Med 1994:51:804–11.","cites":null},{"id":37930370,"title":"Malignant mesotheliomain south east England: clinicopathological experience of 272 cases.","authors":[],"date":"1997","doi":"10.1136\/thx.52.6.507","raw":"Yates D, CorrinB, Stidolph P, et al. Malignant mesotheliomain south east England: clinicopathological experience of 272 cases. Thorax 1997;52:507–12.","cites":null},{"id":37930417,"title":"Mortality among a cohort of United Kingdom steel foundry workers with special reference to cancers of the stomach and lung,","authors":[],"date":"1946","doi":"10.1136\/oem.51.5.316","raw":"Sorahan T, Faux AM, Cooke MA. Mortality among a cohort of United Kingdom steel foundry workers with special reference to cancers of the stomach and lung, 1946–","cites":null},{"id":37930396,"title":"Mortality from cancer and other causes among male airline cockpit crew in Europe.","authors":[],"date":null,"doi":"10.1002\/ijc.11328","raw":"Blettner M, Zeeb H, Auvinen A, etal. Mortality from cancer and other causes among male airline cockpit crew in Europe. Int J Cancer 2003;1 06:946–52.","cites":null},{"id":37930403,"title":"Mortality of workers at a nickel carbonyl refinery,","authors":[],"date":"1958","doi":"10.1136\/oem.2004.014985","raw":"Sorahan T, Williams SP. Mortality of workers at a nickel carbonyl refinery, 1958–","cites":null},{"id":37930390,"title":"Occupational electric and magnetic field exposure and leukemia: a meta-analysis.","authors":[],"date":null,"doi":"10.1097\/00043764-199711000-00008","raw":"Kheifets L, Afifi A, Buffler PA, et al. Occupational electric and magnetic field exposure and leukemia: a meta-analysis. J Occup Environ Med 1 997;39:1 074–91.","cites":null},{"id":37930429,"title":"Occupational exposure and lung cancer risk: A population-based case-referent study in Sweden.","authors":[],"date":null,"doi":"10.1093\/aje\/152.1.32","raw":"Gustavsson P, Jakobsson R, Nyberg F, etal. Occupational exposure and lung cancer risk: A population-based case-referent study in Sweden. Am J Epidemiol 2000;152:32–40.","cites":null},{"id":37930366,"title":"Occupational Exposure to Carcinogens in Great Britain in 1990–93: Preliminary Results. In: Carex: international information system on occupational exposure to carcinogens. Helsinki: Finnish Institute of Occupational Health,","authors":[],"date":"1998","doi":"10.3320\/1.2765537","raw":"Pannett B, Kauppinen T, Toikkanen J, et al. Occupational Exposure to Carcinogens in Great Britain in 1990–93: Preliminary Results. In: Carex: international information system on occupational exposure to carcinogens. Helsinki: Finnish Institute of Occupational Health, 1998.","cites":null},{"id":37930385,"title":"Occupational exposure to diesel exhaust and lung cancer: a meta-analysis.","authors":[],"date":"1999","doi":"10.2105\/ajph.89.7.1009","raw":"Lipsett M, Campleman S. Occupational exposure to diesel exhaust and lung cancer: a meta-analysis. Am J Public Health 1999;89:1009–17.","cites":null},{"id":37930431,"title":"Occupational injury and illness in the United States. Arch Intern Med","authors":[],"date":"1997","doi":null,"raw":"Leigh JP, Markowitz SB, Fahs M, etal. Occupational injury and illness in the United States. Arch Intern Med 1997;157:1557–68.","cites":null},{"id":37930375,"title":"Occupational urothelial tumours: a regional case-control study.","authors":[],"date":null,"doi":"10.1046\/j.1464-410x.1998.00690.x","raw":"Sorahan T, Hamilton L, Wallace DM, et al. Occupational urothelial tumours: a regional case-control study. Br J Urol 1 998;82:25–32.","cites":null},{"id":37930399,"title":"Oils and cancer.","authors":[],"date":null,"doi":null,"raw":"Tolbert PE. Oils and cancer. Cancer Causes Control 1 997;8:386–405.","cites":null},{"id":37930405,"title":"Persisting risk of nickel related lung cancer and nasal cancer among Clydach refiners. Occup Environ Med","authors":[],"date":"2006","doi":"10.1136\/oem.2005.026336","raw":"Grimsrud TK, Peto J. Persisting risk of nickel related lung cancer and nasal cancer among Clydach refiners. Occup Environ Med 2006;63:365–6.","cites":null},{"id":37930415,"title":"Pooled exposure-response analyses and risk assessment for lung cancer in 10 cohorts of silica-exposed workers: an IARC multicentre study. Cancer Causes Control","authors":[],"date":"2001","doi":null,"raw":"Steenland K, Mannetje A, Boffetta P, et al. Pooled exposure-response analyses and risk assessment for lung cancer in 10 cohorts of silica-exposed workers: an IARC multicentre study. Cancer Causes Control 2001 ;1 2:773–84.","cites":null},{"id":37930369,"title":"Proportion of disease caused or prevented by a given exposure, trait or intervention.","authors":[],"date":null,"doi":null,"raw":"Miettinen O. Proportion of disease caused or prevented by a given exposure, trait or intervention. Am J Epidemiol 1 974;99:325–32.","cites":null},{"id":37930428,"title":"Proportion of lung and bladder cancers in males resulting from occupation: a systematic approach. Arch Environ Health","authors":[],"date":"1991","doi":"10.1080\/00039896.1991.9937423","raw":"Vineis P, Simonato L. Proportion of lung and bladder cancers in males resulting from occupation: a systematic approach. Arch Environ Health 1991 ;46:6–1 5.","cites":null},{"id":37930404,"title":"Respiratory cancer risks associated with low-level nickel exposure: an integrated assessment based on animal, epidemiological, and mechanistic data. Regul Toxicol Pharm","authors":[],"date":"2003","doi":"10.1016\/j.yrtph.2004.09.009","raw":"Seilkop SK, Oller AR. Respiratory cancer risks associated with low-level nickel exposure: an integrated assessment based on animal, epidemiological, and mechanistic data. Regul Toxicol Pharm 2003;37:173–90.","cites":null},{"id":37930383,"title":"Risk of lung cancer among former chromium smelter workers.","authors":[],"date":"1996","doi":"10.1002\/(sici)1097-0274(199605)29:5<491::aid-ajim7>3.0.co;2-p","raw":"Rosenman KD, Stanbury M. Risk of lung cancer among former chromium smelter workers. Am J Ind Med 1996;29:491–500.","cites":null},{"id":37930371,"title":"Routes of asbestos exposure and the development of mesothelioma in an English region.","authors":[],"date":null,"doi":"10.1136\/oem.54.6.403","raw":"Howel D, Arblaster L, Swinburne L, et al. Routes of asbestos exposure and the development of mesothelioma in an English region. Occup Environ Med 1 997;54:403–9.","cites":null},{"id":37930414,"title":"Silicosis and smoking strongly increase lung cancer risk in silica-exposed workers.","authors":[],"date":null,"doi":"10.2486\/indhealth.42.303","raw":"Kurihara N, Wada O. Silicosis and smoking strongly increase lung cancer risk in silica-exposed workers. Ind Health 2004;42:303–314.","cites":null},{"id":37930401,"title":"Sinonasal cancer and occupation: a casecontrol study.","authors":[],"date":null,"doi":null,"raw":"Roush GC, Meigs JA, Kelly JA, et al. Sinonasal cancer and occupation: a casecontrol study. Am J Epidemiol 1 980;1 11:183–93.","cites":null},{"id":37930418,"title":"Sinonasal cancer and occupational exposures: a pooled analysis of 12 case-control studies. Cancer Causes Control","authors":[],"date":"2002","doi":null,"raw":"Luce D, Leclerc A, Begin D, et al. Sinonasal cancer and occupational exposures: a pooled analysis of 12 case-control studies. Cancer Causes Control 2002;13:147–57.","cites":null},{"id":37930394,"title":"Sinonasal cancer, occupation, and tobacco smoking in European women and men.","authors":[],"date":"1999","doi":"10.1002\/(sici)1097-0274(199907)36:1<101::aid-ajim14>3.0.co;2-a","raw":"Mannetje A, Kogevinas M, Luce D, et al. Sinonasal cancer, occupation, and tobacco smoking in European women and men. Am J Ind Med 1999;36:101–7.","cites":null},{"id":37930416,"title":"Sunlight and mortality from breast, ovarian, colon, prostate, and non-melanoma skin cancer: a composite death certificate based case-control study.","authors":[],"date":"2008","doi":"10.1136\/oem.59.4.257","raw":"Freedman DM, Dosemeci M, McGlynn K. Sunlight and mortality from breast, ovarian, colon, prostate, and non-melanoma skin cancer: a composite death certificate based case-control study. Occup Environ Med 2002;59:257–62.Downloaded from oem.bmj.com on 18 November 2008 802 Occup Environ Med 2008;65:789–800. doi:1 0.11 36\/oem.2007.03 7002 Original article","cites":null},{"id":37930358,"title":"The burden of illness of cancer: economic cost and quality of life. Ann Rev Public Health","authors":[],"date":"2001","doi":"10.1146\/annurev.publhealth.22.1.91","raw":"Brown ML, Lipscomb J, Snyder C. The burden of illness of cancer: economic cost and quality of life. Ann Rev Public Health 2001;22:91–113.","cites":null},{"id":37930421,"title":"The carcinogenicity of metals in humans.","authors":[],"date":null,"doi":null,"raw":"Hayes RB. The carcinogenicity of metals in humans. Cancer Causes Control 1 997;8:371–85.","cites":null},{"id":37930360,"title":"The cause of cancer.","authors":[],"date":"1981","doi":"10.1038\/290201a0","raw":"Doll R, Peto R. The cause of cancer. Oxford: Oxford University Press, 1981.","cites":null},{"id":37930432,"title":"The expected burden of mesothelioma mortality","authors":[],"date":"2005","doi":null,"raw":"Hodgson JT, McElvenny DM, Darnton AJ, etal. The expected burden of mesothelioma mortality in Great Britain from 2002 to 2005. Br J Cancer 2005;93:587–93.","cites":null},{"id":37930372,"title":"The French national mesothelioma surveillance program. Occup Environ Med","authors":[],"date":"2006","doi":"10.1016\/s0169-5002(07)70211-8","raw":"Goldberg M, Imbernon E, Rolland P, et al. The French national mesothelioma surveillance program. Occup Environ Med 2006;63:390–5.","cites":null},{"id":37930424,"title":"The global burden of disease due to occupational carcinogens.","authors":[],"date":null,"doi":"10.1002\/ajim.20209","raw":"Driscoll T, Nelson DI, Steenland K, etal. The global burden of disease due to occupational carcinogens. Am J Ind Med 2005;48:41 9–31.","cites":null},{"id":37930368,"title":"The occurrence of lung cancer in man.","authors":[],"date":null,"doi":null,"raw":"Levin M. The occurrence of lung cancer in man. Acta Unio Internationalis Contra Cancrum 1 953;9:531–41.","cites":null},{"id":37930434,"title":"Trends in inhalation exposure: mid 1980s until present.","authors":[],"date":"2006","doi":null,"raw":"Creely KS, Van Tongeren M, While D, etal. Trends in inhalation exposure: mid 1980s until present. HSE Report 460. Sudburg, UK: HSE Books, 2006. http:\/\/www.hse.gov. uk\/research\/rrpdf\/rr460.pdf (accessed January 2008).","cites":null},{"id":37930419,"title":"Update of a meta-analysis on lung cancer and welding.","authors":[],"date":null,"doi":"10.5271\/sjweh.973","raw":"Ambroise D, Wild P, Moulin JJ. Update of a meta-analysis on lung cancer and welding. Scand J Work Environ Health 2006;32:22–31.","cites":null},{"id":37930378,"title":"Updated mortality amongst diverse segments of a petroleum company. Occup Environ Med","authors":[],"date":"2000","doi":null,"raw":"Lewis RJ, Schnatter AR, Katz AM, et al. Updated mortality amongst diverse segments of a petroleum company. Occup Environ Med 2000;57:595–604.","cites":null},{"id":37930386,"title":"Use of job-exposure matrix in an occupational analysis of lung and bladder cancers on the basis of death certificates.","authors":[],"date":"1984","doi":null,"raw":"Coggon D, Pannett B, Acheson ED. Use of job-exposure matrix in an occupational analysis of lung and bladder cancers on the basis of death certificates. J Natl Cancer Inst 1984;72:61–5.","cites":null},{"id":37930420,"title":"Wood dust and sino-nasal cancer: pooled reanalysis of twelve case-control studies.","authors":[],"date":"1995","doi":"10.1002\/ajim.4700280202","raw":"Demers PA, Kogevinas M, Boffetta P, etal. Wood dust and sino-nasal cancer: pooled reanalysis of twelve case-control studies. Am J Ind Med 1995;28:151–66.","cites":null},{"id":37930435,"title":"Wood dust survey 1999\/2000. Buxton: Health and Safety Laboratory,","authors":[],"date":"2000","doi":null,"raw":"Dilworth M. Wood dust survey 1999\/2000. Buxton: Health and Safety Laboratory, 2000.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-12-31T00:00:00Z","abstract":"Objectives: Work-related cancers are largely preventa¬ble. The overall aim of\nthis project is to estimate the current burden of cancer in Great Britain\nattributable to occupational factors, and identify carcinogenic agents,\nindustries and occupations for targeting risk prevention. Methods: Attributable\nfractions and numbers were estimated for mortality and incidence for bladder,\nlung, non-melanoma skin, and sinonasal cancers, leukaemia and mesothelioma for\nagents and occupations classified as International Agency for Research on Cancer\n(IARC) Group 1 and 2A carcinogens with “strong” or “sugges¬tive” evidence for\ncarcinogenicity at the specific cancer site in humans. Risk estimates were\nobtained from published literature and national data sources used for estimating\nproportio","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/141217.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1136\/oem.2007.037002","pdfHashValue":"9712df8c2cced5704a26cd2d07bed31df32cf974","publisher":"BMJ Publishing Group","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/4224<\/identifier><datestamp>2014-02-11T09:54:23Z<\/datestamp><setSpec>hdl_1826_2005<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>The burden of cancer at work: estimation as the first step to prevention<\/dc:title><dc:creator>Rushton, L.<\/dc:creator><dc:creator>Hutchings, S.<\/dc:creator><dc:creator>Brown, T. P.<\/dc:creator><dc:description>Objectives: Work-related cancers are largely preventa¬ble. The overall aim of\nthis project is to estimate the current burden of cancer in Great Britain\nattributable to occupational factors, and identify carcinogenic agents,\nindustries and occupations for targeting risk prevention. Methods: Attributable\nfractions and numbers were estimated for mortality and incidence for bladder,\nlung, non-melanoma skin, and sinonasal cancers, leukaemia and mesothelioma for\nagents and occupations classified as International Agency for Research on Cancer\n(IARC) Group 1 and 2A carcinogens with “strong” or “sugges¬tive” evidence for\ncarcinogenicity at the specific cancer site in humans. Risk estimates were\nobtained from published literature and national data sources used for estimating\nproportion<\/dc:description><dc:publisher>BMJ Publishing Group<\/dc:publisher><dc:date>2012-06-08T23:01:45Z<\/dc:date><dc:date>2012-06-08T23:01:45Z<\/dc:date><dc:date>2008-12-31T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>L Rushton, S Hutchings and T Brown, The Burden of Cancer at Work: Estimation as\nthe first step to prevention, December 1, 2008, 65(12) 789-800<\/dc:identifier><dc:identifier>1351-0711<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1136\/oem.2007.037002<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/4224<\/dc:identifier><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1351-0711","1351-0711"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2008,"topics":[],"subject":["Article"],"fullText":"Downloaded from oem.bmj.com on 18 November 2008\nThe burden of cancer at work: estimation as the\nfirst step to prevention\nL Rushton, S Hutchings and T Brown\nOccup. Environ. Med. 2008;65;789-800; originally published online 13 Dec 2007;\ndoi:10.1 136\/oem.2007.037002\nUpdated information and services can be found at:\nhttp:\/\/oem.bmj.com\/cgi\/content\/full\/65\/12\/789\nThese include:\nReferences\nRapid responses\nThis article cites 70 articles, 22 of which can be accessed free at:\nhttp:\/\/oem.bmj.com\/cgi\/content\/full\/65\/12\/789#BIBL\n1 online articles that cite this article can be accessed at:\nhttp:\/\/oem.bmj.com\/cgi\/content\/full\/65\/12\/789#otherarticles\nYou can respond to this article at:\nhttp:\/\/oem.bmj.com\/cgi\/eletter-submit\/65\/12\/789\nEmail alerting Receive free email alerts when new articles cite this article - sign up in the box at\nservice the top right corner of the article\nTopic collections Articles on similar topics can be found in the following collections\nAccidents, injuries (1 articles)\nCancer (2 articles)\nnjuries, accidents (1 articles)\nOther exposures (9 articles)\nNotes\nTo order reprints of this article go to:\nhttp:\/\/journals.bmj.com\/cgi\/reprintform\nTo subscribe to Occupational and Environmental Medicine go to:\nhttp:\/\/journals.bmj.com\/subscriptions\/\n\nDownloaded from oem.bmj.com on 18 November 2008Orig ina l ar t ic le\nOccup Environ Med 2008;65:789–800. doi:10.1136\/oem.2007.037002 789\nThe burden of cancer at work: estimation as the first\nstep to prevention\nL Rushton,1 S Hutchings,1 T Brown2\nABSTRACT\nObjectives: Work-related cancers are largely preventa-\nble. The overall aim of this project is to estimate the\ncurrent burden of cancer in Great Britain attributable to\noccupational factors, and identify carcinogenic agents,\nindustries and occupations for targeting risk prevention.\nMethods: Attributable fractions and numbers were\nestimated for mortality and incidence for bladder, lung,\nnon-melanoma skin, and sinonasal cancers, leukaemia\nand mesothelioma for agents and occupations classified\nas International Agency for Research on Cancer (IARC)\nGroup 1 and 2A carcinogens with “strong” or “sugges-\ntive” evidence for carcinogenicity at the specific cancer\nsite in humans. Risk estimates were obtained from\npublished literature and national data sources used for\nestimating proportions exposed.\nResults: In 2004, 78 237 men and 71 666 women died\nfrom cancer in Great Britain. Of these, 7317 (4.9%) deaths\n(men: 6259 (8%); women: 1058 (1.5%)) were estimated\nto be attributable to work-related carcinogens for the six\ncancers assessed. Incidence estimates were 13 338\n(4.0%) registrations (men: 11 284 (6.7%); women 2054\n(1.2%)). Asbestos contributed over half the occupational\nattributable deaths, followed by silica, diesel engine\nexhaust, radon, work as a painter, mineral oils in metal\nworkers and in the printing industry, environmental\ntobacco smoke (non-smokers), work as a welder and\ndioxins. Occupational exposure to solar radiation, mineral\noils and coal tars\/pitches contributed 2557, 1867 and 550\nskin cancer registrations, respectively. Industries\/occupa-\ntions with large numbers of deaths and\/or registrations\ninclude construction, metal working, personal and\nhousehold services, mining (not metals), land transport\nand services allied to transport, roofing, road repair\/\nconstruction, printing, farming, the Armed Forces, some\nother service industry sectors and manufacture of\ntransport equipment, fabricated metal products, machin-\nery, non-ferrous metals and metal products, and\nchemicals.\nConclusions: Estimates for all but leukaemia are greater\nthan those currently used in UK health and safety strategy\nplanning and contrast with small numbers (200–240\nannually) from occupational accidents. Sources of\nuncertainty in the estimates arise principally from\napproximate data and methodological issues. On balance,\nthe estimates are likely to be a conservative estimate of\nthe true risk. Long latency means that past high\nexposures will continue to give substantial numbers in the\nnear future. Although levels of many exposures have\nreduced, recent measurements of others, such as wood\ndust and respirable quartz, show continuing high levels.\nThere is increasing interest in estimating and\ncomparing burdens of disease generally1 and for\ncancer.2 3 Estimates can identify major risk factors\nand high-risk populations, support decisions on\npriority actions for risk reduction and provide an\nunderstanding of important contributions to\nhealth inequalities. Nearly 30 years ago Doll and\nPeto (1981), in their report to the US Congress,\npresented a method of estimating the effects of\ndifferent factors on cancer mortality in the USA4;\ntheir estimate for occupational factors was 4% of\nall US cancer deaths with an uncertainty range of\n2%–8%. The aim of this project is to produce an\nupdated and detailed estimate of the current\nburden of occupational cancer in Great Britain\n(GB) that will help to inform the development and\nprioritisation of practical measures to reduce the\nburden in the future, specifically in GB, but also\nmore generally in the developed world. The\nestimates of current burden of occupational cancer\nare based on exposure levels from up to 50 years\nago when exposure levels may have been much\nhigher than they are at present. Prioritisation for\npreventive effort requires consideration of ongoing\nrisks and current exposures. The next phase of the\nproject will include predictions of future burden\nbased on current exposure levels.\nIn this paper the outcomes of the first phase of\nthe project are presented. Estimates have been\nmade of the current burden due to past occupa-\ntional exposures for six cancers, which are impor-\ntant in terms of both the annual numbers of deaths\nand cancer registrations they produce and their\npotential to be caused by exposure to occupational\ncarcinogens. The six are cancer of the bladder;\nleukaemia; cancer of the lung, mesothelioma; non-\nmelanoma skin cancer (NMSC) and sinonasal\ncancer. An overview of the methodology developed\nand the data used is also given.\nMETHODS\nOccupational carcinogens assessed\nAt two international workshops held as part of the\nproject to discuss the methodology (http:\/\/www.\nhse.gov.uk\/research\/hsl_pdf\/2005\/hsl0554.pdf;\nhttp:\/\/www.hse.gov.uk\/research\/hsl_pdf\/2007\/\nhsl0732.pdf) the participants advised that priority\nshould be given initially to International Agency\nfor Research on Cancer (IARC) Group 1 and 2A\noccupationally related carcinogens. Agents or\noccupations in these IARC groups were included\nthat had either “strong” or “suggestive” evidence\nof carcinogenicity in humans for the specific cancer\nsite, as defined by Siemiatycki et al (2004) and\nsubsequent IARC publications.57 Those with\n“strong”evidenceweredefinedas“established”carcinogensforthepurposesofthisstudyand\nthose with “suggestive” evidence of carcinogeni-\nci ty in humans were defined as “u n c e r t a in”\n1 Imperial College London,\nDepartment of Epidemiology and\nPublic Health, Faculty of Medicine,\nSt Mary’s Campus, London, UK; 2\nHealth and Safety Laboratory,\nMathematical Sciences Unit,\nBuxton, UK\nCorrespondence to:\nLesley Rushton, Department of\nEpidemiology and Public Health,\nImperial College London, Faculty\nof Medicine, Norfolk Place,\nLondon W2 1 PG, UK;\nl.rushton@imperial.ac.uk\nAccepted 29 November 2007\nPublished Online First\n31 January 2008\nDownloaded from oem.bmj.com on 18 November 2008\nOccup Environ Med 2008;65:789–800. doi:10.1136\/oem.2007.037002 790\nOriginal art ic le\ncarcinogens. In addition there had to be substantial existing\nexposures in GB and\/or cases of cancer still occurring due to\npast exposures.\nData sources\n(i ) Cancer mortal i ty and registration data\nEstimation was carried out on a cancer by cancer basis for 2004\nfor mortality and 2003 for cancer incidence, the most recent\nyears for which published data were available at the time of\nestimation. Deaths for 2005 and cancer registrations for 2004\nare now available but total numbers do not differ substantially\nfrom those used. Mortality data were obtained from ONS,\nMortality Statistics, Series DH2, for England and Wales and the\nGeneral Register Office for Scotland. Cancer incidence data\nwere obtained from ONS, Cancer Statistics, Registrations,\nSeries MB1 for England, the Scottish Cancer Registry, (http:\/\/\nwww.isdscotland.org\/isd) and the Welsh Cancer Intelligence\nand Surveillance Unit (http:\/\/www.wales.nhs.uk\/sites3\/home.\ncfm?OrgID = 242).\n(i i )Risk es t imates\nStandard search criteria were used to identify key studies, meta-\nanalyses or pooled studies, taking into account relevance to GB,\nlarge sample size, effective control for confounders, adequate\nexposure assessment, and clear case definition. Where only a\nnarrative review was available giving a range of risk estimates\nfrom several relevant studies a combined estimate of the relative\nrisks (RRs) was calculated based on a random- (for hetero-\ngeneous RRs) or fixed- (for homogeneous RRs) effects model. If\nno meta-analysis, pooled study or narrative review were\navailable a single key study was selected using the criteria\nabove. Dose-response risk estimates were generally not avail-\nable, nor were proportions of those exposed at different levels of\nexposure over time available for the working population in GB.\nIn our study separate risk estimates were generally extracted\nrelating to an overall “higher” level and an overall “lower” level.\nFor one or two specific agents it was possible to extract risk\nestimates for three levels of exposure or for specific exposure\nscenarios (see table 2 footnotes). Where no estimate could be\nidentified for very low\/background\/environmental levels of\nexposure, an RR of one was arbitrarily assigned.\n( i i i ) Exposed populat ion est imates\nIf the relative risks were extracted from an industry-based study\npopulation, for example a cohort study, a national (external)\ndata source was used for estimating the proportion of the\npopulation exposed. If the relative risks were extracted from a\npopulation-based study, for example a case-control study of\ncancer registry cases, an estimate of the proportion of cases\nexposed was also obtained from the study, although such\nstudies were rarely available for GB. The national data sources\nused were the CARcinogen EXposure (CAREX) database,8 and\nfor exposures not covered by CAREX, the annual Labour Force\nSurvey (LFS) (http:\/\/www.statistics.gov.uk\/) and the Census of\nEmployment (CoE) (https:\/\/www.nomisweb.co.uk\/). Data\nfrom CAREX are not differentiated by sex; 1991 Census data\nby industry and occupation were used to estimate the relative\nproportions of men and women exposed (http:\/\/cdu.mimas.ac.\nuk). The industry categories listed in CAREX were allocated to\n“higher” and “lower” exposure categories assuming the\ndistributions of levels of exposure and risks associated with\nthese broadly matched those of the studies from which RRs\nwere extracted.\nStatistical analysis\nThe attributable fraction (AF), that is the proportion of cases\nthat would not have occurred in the absence of exposure, has\nbeen estimated. There are two principal methods for estimating\nthe AF, both of which depend on knowledge of the risk of the\ndisease due to the exposure of interest and the proportion of the\npopulation exposed.9\nTo estimate the AFs for each cancer\/occupational carcinogen\nLevin’s equation10 was used if risk estimates came from an\nindustry-based study, review or meta-analysis together with\nestimates of the proportion of the population exposed from\nindependent sources of data. Miettinen’s equation was used if\nrisk estimates and proportion of cases exposed came from a\npopulation-based study.11 The equations used are given in the\nStatistical Appendix. The AFs were applied to total numbers of\ncancer-specific deaths (2004) and cancer registrations (2003) to\ngive attributable numbers. Where AFs were only available for\nmortality these were used for estimation of attributable\nregistrations and vice versa. Similarly if separate AFs for women\ncould not be estimated those for men or for men and women\ncombined were used.\nTo take account of cancer latency a “relevant exposure\nperiod” (REP) was defined as the period during which exposure\noccurred that was relevant to the development of the cancer in\nthe target year 2004. For solid tumours a latency of at least\n10 years and at most 50 years was assumed giving an REP of\n1955–1994. For haematopoietic neoplasms 0–20 years latency\nwas assumed giving an REP of 1985–2004. The proportion of the\nGB population exposed to the occupational carcinogens of\nconcern over the REP was estimated taking into account\nchanges in numbers employed in the primary and manufactur-\ning industry and service sectors in GB over the REP. Figures\nfrom the LFS show, for example, that the numbers of men\nemployed in primary and manufacturing industry were 40%\nhigher in the 1970s than they were in the early 1990s, whereas\nthe numbers employed in the service industries were 10% lower.\nAdjustment for employment turnover over the period for\ngrouped main industry sectors was also carried out using LFS\ndata on the distribution of length of time with current employer\n(in excess of 1 year) by length of employment. This gave the\nnumbers ever employed for at least 1 year during the REP\nallowing for normal life expectancy to 2004 (see Statistical\nAppendix equation 3). The adjustment factors for changing\nemployment levels and percentage annual turnovers used are\nshown in the table in the Statistical Appendix.\nThe AF for mesothelioma was derived directly from several\nstudies of UK mesothelioma cases that suggest that between\n85% and 90% of male mesothel ioma cases are due to\noccupational exposure12 13 (Darnton, personal communication).\nStudies in which results were reported separately for females in\nthe UK (Darnton, personal communication) and elsewhere14 15\ngave estimates of 20%–30%. For the estimate of the AF due to\nthe “Established plus Uncertain carcinogens”, cases described as\ndue to paraoccupational (eg, exposure from living near an\nasbestos factory or handling clothes contaminated due to\noccupational exposure) or environmental exposure to asbestos\nare also included.\nA recent analysis of lung cancer mortality for the whole of GB\nbetween 1980 and 2000 by occupational group in relation to\nindices of asbestos exposure and smoking habits suggested that\nthe ratio of asbestos-related lung cancer to mesothelioma deaths\nis between two-thirds and one.16 A ratio of 1:1, mesothelioma to\nDownloaded from oem.bmj.com on 18 November 2008\n791 Occup Environ Med 2008;65:789–800. doi:1 0.11 36\/oem.2007.03 7002\nlung cancer deaths has been used for the estimation of numbers\nof lung cancers attributable to asbestos.\nDownloaded from oem.bmj.com on 18 November 2008Orig ina l ar t ic le\nOccup Environ Med 2008;65:789–800. doi:10.1136\/oem.2007.037002 792\nFor lung cancer associated with radon exposure from natural\nsources, estimates of rates of lung cancer due to exposure to\nradon in domestic buildings were applied to estimates of the\ntime employees spend in workplaces where radon exposure\noccurs.\nAFs for all the relevant carcinogenic agents and occupational\ncircumstances were combined into a single estimate of AF for\neach separate cancer. AFs in general cannot be summed directly\nif there is a possibility that workers will have been exposed to\nmore than one occupational carcinogen during their working\nlifetimes in the relevant exposure period. Where data allowed,\nthe exposed numbers were therefore partitioned between\noverlapping exposures, for example by excluding steel foundry\nworkers from the CAREX estimates of numbers exposed to\nother lung carcinogens. Alternatively, where exposure to more\nthan one carcinogen associated with the same cancer site\noccurred,anAFwasestimatedonlyforthe“dominant”carcinogenwiththehighestriskestimate.Themethodof\ncombining the AFs was then determined by whether there was\nresidual exposure to multiple carcinogens. If so, it was assumed\nthat the exposures were independent of one another and that\ntheir joint carcinogenic effects were multiplicative. Such multi-\nple\/overlapping exposures were assigned to exposure sets that\nwere judged to be non-overlapping with other exposure sets and\nsingle exposure scenarios. The AFs within exposure sets were\nmultiplied using equation 5 in the Statistical Appendix. The\ncombined AFs for each non-overlapping exposure set were then\nsummed, together with non-overlapping single exposures.\nAn overall AF for occupation for the six cancers assessed so far\nwas estimated by summing the attributable numbers for the six\ncancers and dividing by the total number of cancers in GB\n(table 1).\nAlthough it is relatively straightforward to estimate a\nconfidence interval for AFs of single carcinogenic agents,9 the\nmethodology for estimating confidence intervals for AFs\nestimated from more than one risk estimate for multiple\nexposure levels and for combinations of AFs is more complex,\nfor example requiring Monte Carlo methods. The methodology\nfor this is currently under development and confidence limits\nare not presented.\nSeparate technical reports for each cancer giving full details of\ndata and calculations, and a report expanding on the statistical\nmethodology are accessible at http:\/\/www.hse.gov.uk\/research\/\nrrhtm\/rr595.htm.\nRESULTS\nThe overall occupational AFs for the six cancers investigated so\nfar are summarised in table 1. Six per cent (n = 4693) of cancer\ndeaths in 2004 in men and 1.0% (n = 701) in women in GB have\nbeen estimated to be due to occupation for carcinogens with\nstronghumanevidenceofcarcinogenicity,our“established”carcinogens.Theestimateswere4.9%(7317deaths)intotal,\n8.0% for men (6259 deaths) and 1.5% for women (1058 deaths),\nfor carcinogens with strong or suggestive evidence of carcino-\ngenicity in humans, our “established plus uncertain” carcino-\ngens.\nThe combined AFs for registrations are 6.7% (n = 11 284) for\nmen in 2003 and 1.2% (n = 2054) for women based on\nestablished and uncertain carcinogens. These are lower than\nthat for deaths because of the very large numbers for NMSC.\nTable 2 gives the number of deaths for each cancer\nattributable to each of the agents and occupations considered\n(so far) for established and uncertain carcinogens together. The\nstudies that were used for the risk estimates for each agent or\noccupation and the type of study are also given in table 2.\nOverall, asbestos exposure contributes the largest number of\ndeaths (mesothelioma and lung cancer), followed by exposure\nto silica (lung), diesel engine exhaust (DEE) (lung, bladder),\nradon exposure from natural exposure in workplaces (lung),\noccupation as a painter (lung, bladder), mineral oils in metal\nworkers (bladder, sinonasal, NMSC), environmental tobacco\nsmoke (ETS) in non-smokers (lung), mineral oils in printers\n(lung), occupation as a welder (lung) and exposure to dioxins\n(lung).\nFor the six cancers, exposures in the construction industry are\nestimated to produce over half of GB’s occupational attributable\ncancer deaths in men (n = 3219). Workers in this industry are\nexposed to 17 of the carcinogens considered so far (13 resulting\nin at least one death), shown in fig 1 for men, who account for\nan estimated 99% of the construction workforce in the REPs for\nthese cancers.\nThere are 44 deaths for NMSC attributable to occupational\nexposure to mineral oils, polycyclic aromatic hydrocarbons\n(PAHs) and solar radiation. However, estimated numbers of\nregistrations for NMSC associated with mineral oils are 1745\nmales (M), 122 females (F), with PAHs; mainly coal tars and\npitches are 547 M (544 in construction), 3 F; and with solar\nradiation are 1824 M (805 in construction), 733 F.\nTable 3 gives for each cancer, numbers of deaths (registrations\nfor NMSC) within industry sectors or jobs for which there were\nat least 50 estimated attributable cancers; the exposures\nconcerned are listed, with those contributing most (at least 10\ncancers in men plus women) being shown in bold. Painters and\nwelders are assumed to be exposed to many different carcino-\ngens. The importance of single exposures within some industry\nsectors is also highlighted, for example PAHs in coal tar and\npitches in roofing and road repair and construction, metal\nworking fluids in the metal industries, mineral oils and printing\ninks in the printing industry. In addition to the construction\nindustry table 3 shows that multiple exposures potentially\noccur in several other industries, including the manufacture of\nindustrial chemicals (18, notably asbestos) and other chemical\nproducts (16, also notably asbestos), manufacture of transport\nequipment (15, particularly asbestos, chromium, cobalt, silica,\nradon and solar radiation), electricity, gas and steam (15,\nnotably asbestos and solar radiation), non-ferrous metal basic\nindustries (14, notably arsenic), the manufacture of fabricated\nmetal products (14, notably cobalt, chromium and silica), the\nmanufacture of machinery except electrical (13, notably silica,\nchromium, cobalt and radon), services allied to transport (13,\nnotably DEE and solar radiation), and printing, publishing and\nallied industries (12, notably solar radiation). More than 10\ndifferent exposures were also found in sanitary and similar\nservices (14, notably solar radiation and asbestos), personal and\nhousehold services (11, notably asbestos, diesel engine exhaust,\nETS and radon), and land transport (11, notably DEE, asbestos\nand solar radiation).\nTable 3 also highlights the range of industry sectors where\nparticular substances are occurring and contributing to the\nburden of occupational cancer. These sectors are not always\nthose where substantial historical exposures have occurred. For\nexample, the main occupations with substantial historical\nexposure to inorganic arsenic include hot copper smelting,\nmanufacturing of arsenical pesticides and sheep-dip compounds,\nfur handlers and vineyard workers and some miners.63 64 In GB\nthe majority of exposure occurs in the non-ferrous metal basic\nindustry and the manufacture of wood and wood and cork\nproducts (44 and 31 lung cancer deaths, respectively).\nDownloaded from oem.bmj.com on 18 November 2008\nOccup Environ Med 2008;65:789–800. doi:10.1136\/oem.2007.037002 793\nOriginal art ic le\nTable 1 Estimated attributable fractions, deaths and registrations by cancer site in 2004 (2003 for\nregistrations)\nAttr ibutable numbers\nAttributable fraction (%) Deaths Registrations\nCancer site Male Female Total Male Female Male Female\n(a) Establ ished carcinogens only (IARC Group 1, strong human evidence)\nBladder 1.3 0.6 1.0 40 10 89 17\nLeukaemia 0.3 0.5 0.2 4 5 5 6\nLung 16.5 4.5 11.6 3137 599 3509 680\nMesothelioma 85–90 20–30 74–80 1450 75 1450t 75t\nNMSC 11.8 3.0 8.4 38 6 3992 855\nSinonasal 34.1 10.8 23.4 24 6 74 18\nTotal\nBased on deaths 6.0 1.0 3.6 4693 701\nBased on registrations 5.4 1.0 3.2 9120 1652\n(b) Established + uncertain carcinogens (IARC Group 1 and 2A, strong + suggestive human evidence)\nBladder 11.6 2.0 8.3 362 32 816 57\nLeukaemia 2.7 0.8 1.7 58 11 93 15\nLung 21.6 5.5 15.0 4106 728 4594 826\nMesothelioma 98* 90* 97* 1650 270 1650t 270t\nNMSC 11.8 3.0 8.4 38 6 3992 855\nSinonasal 64.3 18.4 43.3 45 11 140 31\nTotal:\nBased on deaths 8.0 1.5 4.9 6259 1058\nBased on registrations 6.7 1.2 4.0 11 284 2054\nTotal cancers in GB 78 237 71 666 167 506 164 586\nincludes cases described as due to paraoccupational or environmental exposure to asbestos.\ntTaken as equal to attributable deaths for this short-survival cancer.\nMid-points of ranges used when estimating attributable numbers and combining results for mesothelioma with the other cancers.\nGB, Great Britain; IARC, International Agency for Research on Cancer; NMSC, non-melanoma skin cancer.\nAlthough potential asbestos exposure occurred in large\nnumbers of workers (over 65 000 in the REP) in the mining\nindustry (excluding coal mining) giving 305 deaths each from\nlung cancer and mesothelioma in men, the industry with the\ngreatest potential for asbestos exposure was the construction\nindustry, occurring for example in asbestos removal or stripping,\ngiving 1012 deaths each from lung cancer and mesothelioma in\nmen. In personal and household services, 362 deaths each from\nlung cancer and mesothelioma occurred (221 each of these in\nwomen). Other industry groups where asbestos exposure\ncontributed to fairly large numbers of deaths in men for both\nlung cancer and mesothelioma were work in land transport45\nand manufacture of transport equipment.39\nOther substances occurring across several industry sectors\nthat contributed substantially to the burden of cancer are listed\nbelow.\nDiesel engine exhaust\nIn addition to 21 male bladder cancer deaths and a total of 268\nlung cancer deaths attributed to exposure to DEE in the land\ntransport industry where over 600 000 workers were estimated\nto be potentially exposed over the REP, an additional half a\nmillion workers were exposed to DEE over the REP in the\nconstruction industry giving 20 male bladder cancer deaths and\n238 male lung cancer deaths.\nETS (non-smokers)\nSignificant numbers of workers were exposed to ETS in the\nwholesale and retail trade, restaurants and hotels, construction,\nand financing, insurance, real estate and business services giving\n104, 35 and 29 lung cancer deaths, respectively.\nRadon\nThere are now very few workers in metal ore mining in the UK\nexposed to radioactive radon and its progeny. High levels of\nradon in the workplace occur in similar areas to those of concern\nin residential dwellings in the UK such as Cornwall, Devon\nNorthamptonshire and parts of Derbyshire, Somerset, Wales,\nGrampian and the Highlands of Scotland. Approximately 2000\nlung cancer deaths a year have been estimated to be due to\nradon exposure of which between about 90 and 275 are\nattributable to exposure occurring in the workplace.55\nAlthough any workplace in the affected areas is potentially at\nrisk of exposure, the large numbers of workers employed in the\nwholesale and retail trade, restaurants and hotels, and in\nfinance, insurance, real estate and business services gave\nrelatively high estimated numbers of lung cancer deaths — 75\nand 47, respectively.\nSilica\nIn GB the majority of workers exposed to silica work in the\nconstruction industry, manufacture of other non-metallic\nmineral products and manufacture of pottery, china and\nearthenware giving an estimated 667, 28 and 25 deaths of\nmen in these industries, respectively.\nSolar radiation\nThe risk for NMSC caused by occupational exposure to solar\nradiation is difficult to estimate because everyone is exposed to\nsunlight to a greater or lesser degree depending on residential\nlocation and leisure time activities. Risk estimates from a US-\nbased case-control study of 6565 cases of NMSC were used that\nestimated separate risks for work that combined indoor and\noutdoor work, outdoor work by non-farmers and farming.58\nDownloaded from oem.bmj.com on 18 November 2008Orig ina l ar t ic le\nOccup Environ Med 2008;65:789–800. doi:10.1136\/oem.2007.037002 794\nDownloaded from oem.bmj.com on 18 November 2008\n795 Occup Environ Med 2008;65:789–800. doi:1 0.11 36\/oem.2007.03 7002\nOriginal art ic le\nDownloaded from oem.bmj.com on 18 November 2008Orig ina l ar t ic le\nOccup Environ Med 2008;65:789–800. doi:10.1136\/oem.2007.037002 796\nDownloaded from oem.bmj.com on 18 November 2008\n797 Occup Environ Med 2008;65:789–800. doi:1 0.11 36\/oem.2007.03 7002\nDownloaded from oem.bmj.com on 18 November 2008Orig ina l ar t ic le\nOccup Environ Med 2008;65:789–800. doi:10.1136\/oem.2007.037002 798\nOriginal art ic le\nFigure 1 Lung cancer deaths for men in\n2004 attributable to work in the\nconstruction industry. ETS, environmental\ntobacco smoke; PAH, polycyclic aromatic\nhydrocarbon.\nLarge numbers of registrations were estimated for the construc-\ntion industry (860), public administration and defence (armed\nforces) (232), wholesale and retail trade, restaurants and hotels\n(168), land transport (166), manufacture of transport equip-\nment (154), agriculture and hunting (143) and communication\n(132).\nA table giving industry sectors and occupations with at least\n10 attributable deaths and\/or registrations for each of the six\ncancer sites assessed so far (50 registrations for NMSC) by\noccupational exposure is given in a supplementary table online.\nDISCUSSION\nAll occupational cancers are potentially avoidable. Our estimate\nof the current burden in 2004 of six cancers due to past\noccupational exposures of 8% for men and 1.5% for women\ntranslates to over 7300 cancer deaths in GB. This is in contrast\nto the 223 deaths due to occupational injuries that occurred that\nyear (http:\/\/www.hse.gov.uk\/statistics\/overall\/fatl0506.pdf).\nBurden estimates from other studies range between 3% and\n10%.65–72 With the exception of leukaemia, all our updated\nestimates are greater than those of Doll and Peto (1981).4 The\nsteep rise in asbestos-related deaths from lung cancer and\nmesothelioma since 1981 has made a major contribution to the\nincrease.16 73\nOur methodology and the data available in GB have allowed a\nmore detailed investigation of the carcinogenic agents, occupa-\ntional circumstances and industry sectors than has been possible\nin other burden estimation studies. We have also addressed the\npotential to be exposed to several carcinogens concurrently and\nthe impact on total burden.\nThe results must be considered taking account of several\nuncertainties and limitations. These are discussed below and the\npotential impact on the estimates is indicated in table 4.\nAgents classified by IARC as Group 1 and 2A carcinogens\nwere assessed. Other substances such as IARC Group 2B\ncarcinogens, many of which may be treated as if they were\nhuman carcinogens in regulatory settings have not yet been\nevaluated; our estimates could thus be too low.\nUncertainty or bias may have been introduced in the choice of\nthe study for obtaining data for the risk estimates, for example\nif the exposures in the source study did not reflect those\nexperienced in GB or distributions of confounders differed\nbetween the source population and GB. A major gap in available\ninformation was a lack of separate risk estimates for women\nand\/or cancer incidence. The use of risk estimates derived from\nstudies of men for women and mortality risk estimates for\nincidence may have biased the AFs. Epidemiological studies of\noccupational groups often result in a “healthy worker effect”,\nthat is a reduced overall risk estimate compared to the general\npopulation. This together with potential misclassification of\nexposure in epidemiological studies could lead to an under-\nestimation of the true effect and thus an underestimation of the\nburden.\nMost of the risk estimates from the published literature were\nrelated to some estimate of cumulative exposure. In assigning\n“higher” and “lower” categories to the CAREX industry groups\nimplicit assumptions were made regarding the similarity of\ndurations and intensities of exposure between the source and\ntarget (national) populations. National data are not generally\navailable on the proportions of those exposed at different levels\nof exposure.\nWhere no risk estimate could be identified for very low\/\nbackground\/environmental levels of exposure, a risk estimate of\none was arbitrarily assigned to the “lower” group, giving a zero\nattributable burden. This implies an assumption that a thresh-\nold existed in the dose relationship between exposure and effect\ncontrary to usual risk assessment guidelines for carcinogens; this\nmay have contributed to underestimation of the burden; a large\nnumber of people exposed at low levels associated with a low\nrisk of disease may contribute more to the burden than a small\nnumber exposed at high levels associated with a high risk.\nIn most occupational epidemiological studies very short-term\nworkers, for example those employed for less than 1 year, are\nexcluded. Our turnover factor was thus calculated excluding\nworkers with less than 1 year’s employment. Inclusion of these\nwould have increased the numbers ever exposed considerably.\nFor example, for the construction industry, the annual turnover\nwould increase from 13% excluding workers with under 1 year\nof employment to 22% when they are included. The overall\neffect of including these short-term workers would be to\nincrease the AFs and attributable numbers. However, when\nthese short-term workers are excluded the turnover factor\nDownloaded from oem.bmj.com on 18 November 2008\n799 Occup Environ Med 2008;65:789–800. doi:1 0.11 36\/oem.2007.03 7002\nTable 3 Industry sectors and occupations with an estimate of a total of at least 50 attributable deaths (registrations for NMSC) by cancer site and\noccupational exposure\nAttr ibutable deaths (regis trat ions for NMSC)\nBladder Leukaemia Lung Mesothelioma NMSC Sinonasal Total *\nIndustry\/job categories M F M F M F M F M F M F M F Exposures\nConstruction including: 47 0 0 0 2132 10 1012 1336 58 15 0 4543 69 Ar, Asb, Ch, Co, DEE, ETS,\nPb, PAH, R, Si, Sr, W, Ca,\nN, Fo, PAHc , ‘ ‘painting”\nRoofers, glaziers,\nroad surfacers,\nconcreters,\nroadman, paviours,\nkerb layers and\ntheir foremen\n544 3 544 3 PAHc\nPainters & decorators 27 0 201 2 228 2 ‘‘painting”Metal workers 243 13 1745 122 20\n2 2008 137 MWF\nPersonal and household 0 0 1 0 170 240 141 221 6 7 317 468 Asb,Ca,Bz,DEE,ETS,PAH,\nservices R, Sr, Ch, Pb, Fo\nMining (not metals) 2 1 347 15 305 20 11 674 27 Asb, DEE, PAH, Si, Sr\nLand transport 21 2 0 0 288 30 45 77 89 431 121 Asb, Bz, DEE, ETS, PAH, R,\nSr, Ch, Pb, Si, W\nWholesale and retai l t rade\nand restaurants and hotels\nPrinters and printing machine\nminders and their foremen\nPrinting, publishing and allied\nindustries\nFarming, horticulture,\ngardening, forestry and related\nManufacture of transport\nequipment\nPublic administration and\ndefence (Armed Forces)\n0 0 100 110 26 78 90 204 200 Asb, Bz, DEE, ETS, PAH, R,\nSr, Pb\n195 40 195 40 mineral oils + printing ink\n7 3 58 32 65 35 Ca, Co, DEE, Pb, PAH, R, Sr,\nCh, ETS, Ni, Si, W\n15 3 110 11 114 29 239 43 D, NAP, Sr, R, ETS\n3 71 11 39 100 54 1 214 65 Ar, Asb, Be, Ch, Co, DEE,\nN, PAH, R, Si, Sr, Ca, ETS,\nPb, W\n19 22 215 17 234 39 R, ETS, PAH, DEE, Sr, Pb\nServices allied to transport 2 0 0 0 26 6 61 71 89 77 Bz, Co, DEE, ETS, Pb, PAH,\nR, Sr, Ca, Ch, N, Si, W\nWelders 139 13 139 13 ‘ ‘Welding fumes”\nFinancing, insurance, real 27 25 46 53 73 78 R, ETS, Sr\nestate and business services\nCommunication 7 6 61 71 68 77 DEE, ETS, R, Sr, Pb\nManufacture of fabricated 2 0 0 61 21 16 9 1 1 80 31 Be, Ca, Co, Ch, Fo, DEE, Pb,\nmetal products, except N, PAH, R, Si, Sr, ETS, W\nmachinery and equipment\nSanitary and similar services 0 0 9 13 5 8 30 35 44 56 Ar, Asb, Bz, Co, DEE, ETS,\nPAH, R, Sr, Ca, Ch, Pb, Si,\nW\nElectricity, gas and steam 2 16 3 7 33 18 58 21 Ar, Asb, Be, Ch, Co, DEE,\nPAH, R, Si, Sr, Ca, ETS, Pb,\nN, W\n1 0 0 57 20 58 20 Be, Ca, Ch, Co, DEE, PAH,\nR, Si, Fo, ETS, Pb, N, W\n1 0 0 53 15 6 3 0 0 60 18 Ar, Bz, Ca, Ch, Co, DEE, Pb,\nN, PAH, R, Si, Sr, Fo, W\n0 0 4 1 6 2 3 6 4 6 A r , B z , E O , 1 – 3 B , A s b , C h ,\nCo, DEE, Pb, R, Si, Fo, Ca,\nETS, N, W\n5 0 44 15 49 15 ‘ ‘Spray painting”\n7 8 24 28 31 36 Ar, ETS, R, Sr\n0 0 0 0 36 5 22 58 5 Ar, AA, Asb, Bz, Fo, 1–3B,\nCa, Ch, Co, DEE, Pb, PAH, R,\nSi, Be, ETS, N, W\nTable 3 gives for each cancer, numbers of deaths (registrations for NMSC) within industry sectors or jobs for which there were at least 50 estimated\nattributable cancers; the exposures concerned are listed, with those contributing most (at least 10 cancers in men plus women) being shown in bold.\n*Totals are for lung, bladder , leukaemia, mesothel ioma and nasal cancers plus attr ibutable registrations for NMSC. 0 = ,0.5; blank cel l = cancer\nnot represented.\nAA, aromatic amine (bladder); Ar, arsenic (lung); Asb, asbestos (lung, mesothelioma); Be, beryllium (lung); Bz, benzene (leukaemia); Ca, cadmium (lung); Ch, chromium IV (lung,\nsinonasal); Co, cobalt (lung); D, dioxins (lung); DEE, diesel engine exhaust (lung, bladder); EO, ethylene oxide (leukaemia); ETS, environmental tobacco smoke (lung); F, female; Fo,\nformaldehyde (sinonasal, leukaemia); M, male; MWF, metal working fluids (bladder, NMSC, sinonasal); N, nickel (lung, sinonasal); NAP, non-arsenical pesticide (leukaemia); NMSC,\nnon-melanoma skin cancer; PAH, polycyclic aromatic hydrocarbon (lung, bladder); PAHc, coal tar and pitch (NMSC); Pb, lead (lung); R, radon (lung); Si, silica (lung); Sr, solar\nradiation (NMSC); W, wood dust (Sinonasal); 1–3B 1–3 butadiene (leukaemia).\nManufacture of machinery\nexcept electrical\nNon-ferrous metal basic\nindustries\nManufacture of other\nchemical products\nCoach and other spray\npainters and painting\nassembling and related\noccupations\nRecreational and cultural\nservices\nManufacture of industrial\nchemicals\nDownloaded from oem.bmj.com on 18 November 2008Orig ina l ar t ic le\nOccup Environ Med 2008;65:789–800. doi:10.1136\/oem.2007.037002 800\nOriginal art ic le\nestimates are similar to those used in the Global Burden of\nDisease project.66\nThere was a general lack of information on the latency of the\ncancers, particularly in relation to specific occupational expo-\nsures. The assumptions made in the study have influenced the\nnumbers ever exposed giving high estimates in some cases. In\nparticular a uniform distribution of cancer induction between\nthe maximum and minimum latency was assumed, although\nreality may be a distribution that peaks in the early 1970s and\ntails off towards more recent periods.\nIn combining the AFs for different risk factors, multiple\nexposures and other non-occupational risk factors were\nconsidered. Cancer is a multifactorial and multistage disease\nthat may not be due to any single sufficient cause but rather a\nsequence of “hits” over a life course. For example, smoking\nalone may not be sufficient to cause lung cancer and those who\nget it are likely to have been exposed to several lung carcinogens\nand possess other characteristics such as some form of inherited\nsusceptibility. The mathematical implication of this is that the\nsum of attributable fractions for several exposures may be\ngreater than 100%, with the amount exceeding 100% being\npartly due to synergistic interactions among the risk factors.74\nWe have avoided this problem of “double counting” of the\ninteractions to some extent by partitioning exposed worker\npopulations between overlapping carcinogenic exposures before\nestimating AFs. In other cases where overlap remains we have\nassumed risks are multiplicative, so that the combined AF\nincorporates the interaction between exposures.\nMany past exposures will have been at much higher levels\nthan those existing today. However, trends vary depending on\nthe substance and source of data. For example, analyses of\nexposure measurement data held in the National Exposure\nDatabase (NEDB) and from Health and Safety Executive (HSE)\ninspection surveys and other surveys showed downward trends\nof 11% per year for toluene between 1985 and 2002 based on\ninspection surveys but follow-up surveys of eight companies\nusing toluene-containing compounds show an average decrease\nof only 1% per year in toluene concentrations.75 Although\nrespirable dust exposure in the quarry industry declined by 6%\neach year from 1984 to 2003 there was no clear change in\nexposure over time for respirable quartz exposure.\nOther exposures have all but disappeared due to the decline of\nthe industry or the substitution of hazardous substances by\nTable 4 Uncertainties and limitations of the methodology and their\npotential impact on the estimate of the burden of disease due to\noccupation\nPotential impact\non burden\nSource of uncertainty estimate\nExclusion of IARC Group 2B and unknown carcinogens Q\nInappropriate choice of source study for risk estimate IQ\nImprecision in source risk estimate IQ\nSource risk estimate from study of highly exposed workers applied I\nto lower exposed target population\nRisk estimate biased down by healthy worker effect, exposure Q\nmisclassification in both study and reference population\nUse of RR = 1 for very low\/background\/environmental levels of Q\nexposure where no value available from literature\nInaccurate risk-exposure period IQ\nUnknown proportion exposed at different levels of exposure IQ\nEffect of unmeasured confounders IQ\nUse of Levin’s formula when RR adjusted for confounders Q\nIARC, International Agency for Research on Cancer; RR, relative risk. Main\nmessages\nc Overall, 4.9% (8% men, 1.5% women) of all cancer deaths in\nGreat Britain in 2004 were attributable to work-related\ncarcinogens (based on the assessment of six cancers and\nInternational Agency for Research on Cancer Group 1 and 2A\ncarcinogens with strong or suggestive human evidence).\nc Asbestos contributed over half the occupational attributable\ndeaths, followed by silica, diesel engine exhaust, radon, work\nas a painter, mineral oils in metal workers and in the printing\nindustry, environmental tobacco smoke (non-smokers), work\nas a welder and dioxins.\nc Occupational exposure to solar radiation, mineral oils and coal\ntars\/pitches contributed large numbers of skin cancer\nregistrations.\nc Industries\/occupations with large numbers of cancer deaths\nand registrations include construction, metal working, mining,\nland transport, roofing and road repair\/construction, printing,\nfarming, some service industry sectors in particular personal\nand household services and wholesale and retail trades,\nrestaurants and hotels and manufacture of machinery,\ntransport equipment, non-ferrous metals and metal products,\nand chemicals.\nPolicy implicat ions\nc Estimates for all but leukaemia are greater than those currently\nused in UK health and safety strategy planning and contrast\nwith small numbers from occupational accidents.\nc Carcinogenic agents, occupations and industrial areas are\nhighlighted for prioritisation of risk reduction strategies.\nc Past high exposures will continue to give substantial numbers\nin the near future and, although levels of many exposures have\nreduced, recent measurements of others show continuing high\nlevels which must be addressed.\nother non-carcinogenic agents. Other carcinogens such as\nnaturally occurring radon could also easily be eliminated from\nworkplaces. However, the long latency of some cancers means\nthat numbers of deaths and registrations due to past high\nexposures will continue to be substantial in the near future\n(particularly asbestos-related cancers).\nFor some carcinogenic agents exposures remain high. For\nexample, recent wood dust measurements have shown con-\ntinuing high exposures.76 Although some hazards, such as\ncertain solvents in paints, may have been removed from\noccupations with multiple exposures, the potential for exposure\nto other hazards remains, for example, silica exposure in the\nconstruction industry, in which the number of employees is\nincreasing. Studies in the Dutch construction industry sug-\ngested that over half of the full-shift respirable quartz dust\nmeasurements were above the Dutch Occupational Exposure\nLimit with exposure being highly variable from day to day and\nbetween jobs and tasks.77 In addition there will be considerable\nnumbers of workers exposed at low levels and risk to some\ncarcinogens that may contribute substantially to both high AFs\nand numbers.\nFuture work will address estimation of the current burden\ndue to occupational exposures for the remaining cancers, the use\nDownloaded from oem.bmj.com on 18 November 2008\n801 Occup Environ Med 2008;65:789–800. doi:1 0.11 36\/oem.2007.03 7002\nof other measures such as years of life lost and Disability-\nAdjusted Life Years, together with development of appropriate\nmethodology for predicting future estimates of the occupational\ncancers due to more recent exposures and for exploring the\nsensitivity of the estimates to sources of uncertainty and bias.\nIn summary, this project is the first to quantify in detail the\nburden of cancer due to occupation specifically for GB. An up-\nto-date estimation of the current burden of six cancers due to\npast occupational exposures has been carried out using a robust\nand transparent methodology. On balance the estimates are\nlikely to be conservative estimates of the true burden. The\nresults highlight specific carcinogenic agents and the occupa-\ntional circumstances and industrial areas where exposures to\nthese agents occur, and should facilitate prioritisation of risk\nreduction strategies.\nAcknowledgements: Funding was obtained from the HSE and managed through the\nHealth and Safety Laboratory. We would like to thank Damien McElvenny for initiating\nthe project and for his role as HSE project officer and Gareth Evans for his\nmanagement role. Andy Darnton from the HSE provided the data for the work on\nmesothelioma. The contributions to the project and advice received from many other\nHSE and HSL staff is gratefully acknowledged. Two workshops were held during the\nproject bringing together experts from the UK and around the world. We would like to\nthank all those who participated and have continued to give advice and comment on\nthe project.\nFunding: Health and Safety Executive.\nCompeting interests: None.\nREFERENCES\n1. Lopez AD, Mathers CD, Ezzati M, et al. Global and regional burden of disease and\nrisk factors, 2001: systematic analysis of population health data. Lancet\n2006;367:1 747–57.\n2. Brown ML, Lipscomb J, Snyder C. The burden of illness of cancer: economic cost\nand quality of life. Ann Rev Public Health 2001;22:91–113.\n3. Danaeii G, Vander Hoorn S, Lopez AD, et al. Causes of cancer in the world:\ncomparative risk assessment of nine behavioural and environmental risk factors.\nLancet 2005;366:1 784–93.\n4. Doll R, Peto R. The cause of cancer. Oxford: Oxford Universi ty Press, 1981.\n5. Siemiatycki J, Richardson L, Straif K, etal. Listing occupational carcinogens. Environ\nHealth Perspect 2004;112:1447–59.\n6. Rousseau M-C, Straif K, Siemiatycki J. IARC Carcinogen update. Environ Health\nPerspect 2005;113:A580.\n7. Straif K, Baan R, Grosse Y, et al. Carcinogenicity of polycyclic aromatic\nhydrocarbons. Lancet Oncol 2005;6:931.\n8. Pannett B, Kauppinen T, Toikkanen J, et al. Occupational Exposure to Carcinogens in\nGreat Britain in 1990–93: Preliminary Results. In: Carex: international information\nsystem on occupational exposure to carcinogens. Helsinki: Finnish Institute of\nOccupational Health, 1998.\n9. Steenland K, Armstrong B. An overview of methods for calculating the burden of\ndisease due to specific risk factors. Epidemiology 2006;17:512–19.\n10. Levin M. The occurrence of lung cancer in man. Acta Unio Internationalis Contra\nCancrum 1 953;9:531–41.\n11. Miettinen O. Proportion of disease caused or prevented by a given exposure, trait or\nintervention. Am J Epidemiol 1 974;99:325–32.\n12. Yates D, Corrin B, Stidolph P, et al. Malignant mesothelioma in south east England:\nclinicopathological experience of 272 cases. Thorax 1997;52:507–12.\n13. Howel D, Arblaster L, Swinburne L, et al. Routes of asbestos exposure and the\ndevelopment of mesothelioma in an English region. Occup Environ Med 1\n997;54:403–9.\n14. Goldberg M, Imbernon E, Rolland P, et al. The French national mesothelioma\nsurveillance program. Occup Environ Med 2006;63:390–5.\n15. Spirtas R, Heineman EF, Bernstein L, etal. Malignant mesothelioma: attributable\nrisk of asbestos exposure. Occup Environ Med 1994:51:804–11.\n16. Darnton AJ, McElvenny DM, Hodgson JT. Estimating the number of asbestos-\nrelated lung cancer deaths in Great Britain from 1980 to 2000. Ann Occup Hyg\n2006;50:29–38.\n17. Sorahan T, Hamilton L, Wallace DM, et al. Occupational urothelial tumours: a\nregional case-control study. Br J Urol 1 998;82:25–32.\n18. Lee-Feldstein A. Cumulative exposure to arsenic and its relationship to respiratory\ncancer among copper smelter employees. J Occup Environ Med 1986;28:296–302.\n19. Collins JJ, Lineker GA. A review and meta-analysis of formaldehyde exposure and\nleukaemia. Regul Toxicol Pharmacol 2004;40:81–91.\n20. Lewis RJ, Schnatter AR, Katz AM, et al. Updated mortality amongst diverse\nsegments of a petroleum company. Occup Environ Med 2000;57:595–604.\n21. Bloemen LJN, Youk AO, Bradley TD, et al. Lymphohaematopoeitic cancer risk\namongst chemical workers exposed to benzene. Occup Environ Med 2004;61 :270–4.\n22. Ward E, Okun A, Ruder A, et al. A mortality study of workers at seven beryllium\nprocessing plants. Am J Ind Med 1992;22:885–904.\n23. Verougstraete V, Lison D, Hotz P. Cadmium, lung and prostate cancer: a systematic\nreview of recent epidemiological data. J Toxicol Environ Health Part B: Critical\nReviews 2003;6:227–56.\n24. Cole P, Rodu B. Epidemiologic studies of chrome and cancer mortality: a series of\nmeta-analyses. Regul Toxicol Pharmacol 2005;43:225–31.\n25. Rosenman KD, Stanbury M. Risk of lung cancer among former chromium smelter\nworkers. Am J Ind Med 1996;29:491–500.\n26. Moulin JJ, Wild P, Romazini S, et al. Lung cancer risk in hard-metal workers.\nAm J Epidemiol 1998;148:241–8.\n27. Lipsett M, Campleman S. Occupational exposure to diesel exhaust and lung cancer:\na meta-analysis. Am J Public Health 1999;89:1009–17.\n28. Coggon D, Pannett B, Acheson ED. Use of job-exposure matrix in an occupational\nanalysis of lung and bladder cancers on the basis of death certificates. J Natl Cancer\nInst 1984;72:61–5.\n29. Boffetta P, Silverman D. A meta-analysis of bladder cancer and diesel exhaust\nexposure. Epidemiology 2001 ;12:1 25–30.\n30. Kogevinas M, Becher H, Benn T. Cancer mortality in workers exposed to phenoxy\nherbicides, chlorophenols, and dioxins: an expanded and updated international cohort\nstudy. Am JEpidemiol 1997;145:1061–75.\n31. Kheifets L, Afifi A, Buffler PA, et al. Occupational electric and magnetic field\nexposure and leukemia: a meta-analysis. J Occup Environ Med 1 997;39:1 074–91.\n32. Zhong L, Goldberg M, Parent ME, et al. Exposure to environmental tobacco smoke\nand the risk of lung cancer: a meta-analysis. Lung Cancer 2000;27:3–18.\n33. Coggon D, Harris EC, Poole J, et al. Extended follow-up of a cohort of British\nchemical workers exposed to formaldehyde. J Natl Cancer Inst 2003;95:1 608–15.\n34. Teta MJ, Sielken RJJ, Valdez-Flores C. Ethylene oxide cancer risk assessment\nbased on epidemiological data: application of revised regulatory guidelines. Risk\nAnalysis 1 999;19:1 135–55.\n35. Mannetje A, Kogevinas M, Luce D, et al. Sinonasal cancer, occupation, and tobacco\nsmoking in European women and men. Am J Ind Med 1999;36:101–7.\n36. Coggon D, Harris EC, Poole J, et al. Extended follow-up of a cohort of British\nchemical workers exposed to formaldehyde. J Natl Cancer Inst 2003;95:1 608–15.\n37. Czene K, Tiikkaja S, Hemminki K. Cancer risks in hairdressers: assessment of\ncarcinogenicity of hair dyes and gels. IntJ Cancer 2003;105:108–12.\n38. Blettner M, Zeeb H, Auvinen A, etal. Mortality from cancer and other causes among\nmale airline cockpit crew in Europe. Int J Cancer 2003;1 06:946–52.\n39. Steenland K, Boffetta P. Lead and cancer in humans:where are we now? Am J Ind\nMed 2000;38:295–99.\n40. Fu H, Demers PA, Costantini AS, et al. Cancer mortality among shoe manufacturing\nworkers: an analysis of two cohorts. Occup Environ Med 1996;53:394–8.\n41. Tolbert PE. Oils and cancer. Cancer Causes Control 1 997;8:386–405.\n42. Eisen EA, Bardin J, Gore R, et al. Exposure-response models based on extended\nfollow-up of a cohort mortality study in the automobile industry. Scand J Work\nEnviron Health 2001 ;27:240–9.\n43. Roush GC, Meigs JA, Kelly JA, et al. Sinonasal cancer and occupation: a case-\ncontrol study. Am J Epidemiol 1 980;1 11:183–93.\n44. Leon DA, Thomas P, Hutchings SJ. Lung cancer among newspaper printers\nexposed to ink mist: a study of trade union members in Manchester, England. Occup\nEnviron Med 1 994;51 :87–94.\n45. Sorahan T, Williams SP. Mortality of workers at a nickel carbonyl refinery, 1958–\n2000. Occup Environ Med 2005;62:80–5.\n46. Seilkop SK, Oller AR. Respiratory cancer risks associated with low-level nickel\nexposure: an integrated assessment based on animal, epidemiological, and\nmechanistic data. Regul Toxicol Pharm 2003;37:173–90.\n47. Grimsrud TK, Peto J. Persisting risk of nickel related lung cancer and nasal cancer\namong Clydach refiners. Occup Environ Med 2006;63:365–6.\n48. Acquavella JF, Olsen G, Cole P, etal. Cancer among farmers: a meta-analysis. Ann\nEpidemiol 1 998;8:64–74.\n49. Chen R, Seaton A. A meta-analysis of painting exposure and cancer mortality.\nCancer Detect Prev 1 998;22:533–9.\n50. Bosetti C, Pira E, La Vecchia C. Bladder cancer risk in painters: a review of the\nepidemiological evidence, 1989–2004. Cancer Causes Control 2005;16:997–1008.\n51. Armstrong B, Hutchinson E, Unwin J, et al. Lung cancer risk after exposure to\npolycyclic aromatic hydrocarbons: a review and meta-analysis. Environ Health\nPerspect 2004;1 12:970–8.\n52. Unwin J, Cocker J, Scobbie E, et al. An assessment of occupational exposure to\npolycyclic aromatic hydrocarbons in the UK. Ann Occup Hyg 2006;50:395–403.\n53. Boffetta P, Jourenkova N, Gustavsson P. Cancer risk from occupational and\nenvironmental exposure to polycyclic aromatic hydrocarbons. Cancer Causes\nControl 1 997;8:444–72.\n54. Partanen T, Boffetta P. Cancer risk in asphalt workers and roofers: review and meta-\nanalysis of epidemiologic studies. Am J Ind Med 1 994;26:721 –40.\n55. NRPB. Health risks of radon. Chilton: National Radiological Protection Board, 2000.\n56. Kurihara N, Wada O. Silicosis and smoking strongly increase lung cancer risk in\nsilica-exposed workers. Ind Health 2004;42:303–314.\n57. Steenland K, Mannetje A, Boffetta P, et al. Pooled exposure-response analyses and\nrisk assessment for lung cancer in 10 cohorts of silica-exposed workers: an IARC\nmulticentre study. Cancer Causes Control 2001 ;1 2:773–84.\n58. Freedman DM, Dosemeci M, McGlynn K. Sunlight and mortality from breast,\novarian, colon, prostate, and non-melanoma skin cancer: a composite death\ncertificate based case-control study. Occup Environ Med 2002;59:257–62.\nDownloaded from oem.bmj.com on 18 November 2008\n802 Occup Environ Med 2008;65:789–800. doi:1 0.11 36\/oem.2007.03 7002\nOriginal art ic le\n59. Sorahan T, Faux AM, Cooke MA. Mortality among a cohort of United Kingdom steel\nfoundry workers with special reference to cancers of the stomach and lung, 1946–\n90. Occup Environ Med 1994;51:316–22.\n60. Luce D, Leclerc A, Begin D, et al. Sinonasal cancer and occupational exposures: a\npooled analysis of 12 case-control studies. Cancer Causes Control 2002;13:147–57.\n61. Ambroise D, Wild P, Moulin JJ. Update of a meta-analysis on lung cancer and\nwelding. Scand J Work Environ Health 2006;32:22–31.\n62. Demers PA, Kogevinas M, Boffetta P, etal. Wood dust and sino-nasal cancer:\npooled reanalysis of twelve case-control studies. Am J Ind Med 1995;28:151–66.\n63. Hayes RB. The carcinogenicity of metals in humans. Cancer Causes\nControl 1 997;8:371–85.\n64. IARC. Overall Evaluations of Carcinogenicity: an updating ofIARC monographs Vols 1\nto 42. IARC Monographs on the Evaluation of the Carcinogenic Risk of Chemicals to\nHumans. Lyon: International Agency for Research on Cancer, 1987.\n65. Dreyer L, Andersen A, Pukkala E. Avoidable cancers in the Nordic countries.\nOccupation. APMIS 1 997;105(Suppl 76):68–79.\n66. Driscoll T, Nelson DI, Steenland K, etal. The global burden of disease due to\noccupational carcinogens. Am J Ind Med 2005;48:41 9–31.\n67. Steenland K, Burnett C, Lalich N, etal. Dying for work: the magnitude of US\nmortality from selected causes of death associated with occupation. Am J Ind Med\n2003;43:461 –82.\n68. Nurminen MM, Karjalainen A. Epidemiologic estimate of the proportion of fatalities\nrelated to occupational factors in Finland. ScandJ WorkEnviron Health 2001;27:161–21\n3.\n69. Vineis P, Simonato L. Proportion of lung and bladder cancers in males resulting from\noccupation: a systematic approach. Arch Environ Health 1991 ;46:6–1 5.\n70. Gustavsson P, Jakobsson R, Nyberg F, etal. Occupational exposure and lung cancer\nrisk: A population-based case-referent study in Sweden. Am J Epidemiol\n2000;152:32–40.\n71. Landrigan PJ, Markowitz S. Current magnitude of occupational disease in the\nUnited States: Estimates for New York. In: Landrigan PJ, Selikoff IJ, eds.\nOccupational health in the 1990s. Developing a platform for disease prevention. New\nYork: Annals of New York Academy of Science, 1989: 27–45.\n72. Leigh JP, Markowitz SB, Fahs M, etal. Occupational injury and illness in the United\nStates. Arch Intern Med 1997;157:1557–68.\n73. Hodgson JT, McElvenny DM, Darnton AJ, etal. The expected burden of\nmesothelioma mortality in Great Britain from 2002 to 2005. Br J Cancer\n2005;93:587–93.\n74. Vineis P, Kriebel D. Causal models in epidemiology: past inheritance and genetic\nfuture. Environ Health 2006;5:21.\n75. Creely KS, Van Tongeren M, While D, etal. Trends in inhalation exposure: mid 1980s\nuntil present. HSE Report 460. Sudburg, UK: HSE Books, 2006. http:\/\/www.hse.gov.\nuk\/research\/rrpdf\/rr460.pdf (accessed January 2008).\n76. Dilworth M. Wood dust survey 1999\/2000. Buxton: Health and Safety Laboratory, 2000.\n77. Tjoe-Nij E, De Meer G, Smit J, et al. Lung function decrease in relation to\npneumoconiosis and exposure to quartz-containing dust in construction workers.\nAm J Ind Med 2003;43:574–83.\nSTATISTICAL APPENDIX\nFormulae used in the estimation of attributable fraction\n1. Levin’s equation\nAF = Pr(E)*(RR-1 )\/{ 1+Pr(E)*(RR-1 )}\nWhere RR = relative risk, Pr(E) = proportion of the population exposed\n2. Miett inen’s equation\nAF = Pr(E|D)*(RR-1)\/RR\nWhere Pr(E | D) = proportion of cases exposed (E = exposed, D = case)\n3. Turnover equation to estimate numbers ever employed during the REP\nWhere Ne(REP) = numbers ever employed in the REP\nn0 = numbers employed in the exposed job\/industry at a mid-point in the REP\nTO = staff turnover per year\nR = retirement age (65 for men, 60 for women)\nl(adj15)i = the proportion of survivors to age i of those alive at age 15 (from GB life\ntables)\na to b = age range achieved by the original cohort members by the target year\n(2004) (eg 65 to 100 for the solid tumour REP)\nc to d = age range achieved by the turnover recruited cohort members by the target\nyear (25 to 64 for the solid tumour REP)\nage(u) and age(l) = upper and lower recruitment age limits (24 and 15)\nThe derivation and assumptions underlying this formula are described in the\nmethodology technical report (http:\/\/www.hse.gov.uk\/research\/rrhtm\/rr595.htm). The\nequation can be represented as a single factor acting as a multiplier for n0, calculated\nby setting n0 to 1 in the above equation, so that the factor varies only with TO (see\ntable A1).\n4. Equation to estimate the proportion of the population exposed\nPr(E) = Ne(REP)\/Np(REP)\nwhere Np(REP) = numbers ever of working age during the REP from population\nestimates for the relevant age cohorts in the target year (2004)\n5. Equation for combining AFs where exposed populations overlap but are independent\nand risk estimates are assumed to be multiplicative\nAFoverall = 1- Pk(1 -AFk) for the k exposures in the set\nTable A1 Employment level adjustment and turnover factors used in the calculation of attributable fraction\nMain indus try sec tor\nAdjustment factor for\nchange in employment\nlevels* Turnover peryear (%)\nEquivalent turnover factor to\napply to poin t est imate of\nnumbers exposed {\nMen Agriculture, hunting and\nforestry; fishing\n1 9 3\nMining and quarrying,\nelectricity, gas and water;\nmanufacturing industry\n1.4 9 4\nConstruction 1 13 5\nService industries 0.9 11 4\nTotal 1 10 4\nWomen Agriculture, hunting and\nforestry; fishing\n0.75 10 4\nMining and quarrying,\nelectricity, gas and water;\nmanufacturing industry\n1.5 14 6\nConstruction 0.67 16 6\nService industries 0.8 15 6\nTotal 0.9 15 6\n*Applied to CAREX data only. Exposed numbers are obtained for a mid-point year in the REP where national employment data\nsources have been used (the LFS or CoE).\n{Based on a 40-year (solid tumour) REP and life expectancy tables.\nCoE, Census of Employment; LFS, Labour Force Survey; REP, relevant exposure period.\n"}