{"doi":"10.1177\/146499340901000414","coreId":"219199","oai":"oai:eprints.lse.ac.uk:36000","identifiers":["oai:eprints.lse.ac.uk:36000","10.1177\/146499340901000414"],"title":"Book review: Johnson, Craig, 2009: Arresting development: the power of knowledge for social change.","authors":["Forsyth, Tim"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-10","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/219199.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/36000\/1\/Forsyth_Book_review_Johnson_Craig_2009_Arresting_development_2010.pdf","pdfHashValue":"b2de3e7ceb12b687b1fb0e899f04f4b01ef76380","publisher":"SAGE Publications","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:36000<\/identifier><datestamp>\n      2017-01-04T16:13:28Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D44455354<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/36000\/<\/dc:relation><dc:title>\n        Book review: Johnson, Craig, 2009: Arresting development: the power of knowledge for social change.<\/dc:title><dc:creator>\n        Forsyth, Tim<\/dc:creator><dc:subject>\n        HD Industries. Land use. Labor<\/dc:subject><dc:publisher>\n        SAGE Publications<\/dc:publisher><dc:date>\n        2010-10<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/36000\/1\/Forsyth_Book_review_Johnson_Craig_2009_Arresting_development_2010.pdf<\/dc:identifier><dc:identifier>\n          Forsyth, Tim  (2010) Book review: Johnson, Craig, 2009: Arresting development: the power of knowledge for social change.  Progress in Development Studies, 10 (4).  pp. 376-378.  ISSN 1464-9934     <\/dc:identifier><dc:relation>\n        http:\/\/pdj.sagepub.com\/<\/dc:relation><dc:relation>\n        10.1177\/146499340901000414<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/36000\/","http:\/\/pdj.sagepub.com\/","10.1177\/146499340901000414"],"year":2010,"topics":["HD Industries. Land use. Labor"],"subject":["Article","NonPeerReviewed"],"fullText":"  \nTim Forsyth \nBook review: Johnson, Craig, 2009: \nArresting development: the power of \nknowledge for social change \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nForsyth, Tim (2010) Book review: Johnson, Craig, 2009: Arresting development: the power of \nknowledge for social change. Progress in Development Studies, 10 (4). pp. 376-378.  \nISSN 1464-9934 DOI: 10.1177\/146499340901000414   \n \n© 2010 SAGE Publications \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/36000\/ \nAvailable in LSE Research Online: March 2014 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \nJohnson, Craig 2009: Arresting development: The power of knowledge for social change. London: \nRoutledge. pp. xiii + 194. £17.25 paperback, £85 hardback. ISBN 978-0-415-38153-6 paperback, \n978-0-415-38154-3 hardback. \n \n‘Knowledge’ is a difficult thing to pin down. For many development practitioners, knowledge is the \nexpertise and ‘facts’ that consultants or scientists gather in order to justify policy decisions. Or it is \nthe endless World Bank or United Nations reports, statistics, and internet portals that offer \ninformation about what actually is going on in the world. \n \nThe social-science debates about development in the 1990s changed all of this. Famous books such \nas James Ferguson’s (1994) Anti-Politics Machine, or Arturo Escobar’s (1995) Encountering \nDevelopment offered more deconstructionist approaches to knowledge and the ‘facts’ that underlie \ndevelopment thinking. The point of these works was to highlight how ‘knowledge’ and ‘expertise’ \nare not apolitical, neutral advice, but can carry embedded politics. These works, and others, began \nto establish the need to consider discourse within development thinking, and the route to a more \npoliticized approach to knowledge and its implications for policymaking. But at the same time, \nimportant works like these have also been categorized too easily by some observers as a \npostmodern approach to development studies, and consequently somewhat allegedly too academic, \nrather than something to be adopted practically in development. \n \nCraig Johnson’s Arresting Development is a useful update and antidote to these debates. This book \nis a clearly written and well argued summary of debates about ‘knowledge’ in development studies \nand – perhaps more importantly – development practice. It uses the insights and depth of debates \nabout knowledge as a politicized theme, yet relates this to recent developments in, say, the World \nBank, or into proposals for harnessing contested knowledge more critically in practical \ndevelopment disputes. \n \nThe book is divided into two main sections. The first considers how neo-liberalism (and the related \nschools of neo-classical theory and rational choice theory) have contributed to ‘meta-theoretical’ \nassumptions within development. The second section then presents how alternatives to these \nframeworks might be designed and implemented. The focus on current debates and applications \nmakes this book both relevant and valuable for students. \n \nSo, at the start of the book (pp. 1-20), we are introduced to some of the controversies surrounding \nthe World Bank’s World Development Report and ‘Global Development Network’; and the \nCanadian International Development Agency, UK Department for International Development, and \nInstitute of Development Studies’ approaches to generating ‘knowledge for development.’ This \nearly section reiterates that knowledge is rooted in historical contexts, as well as current concerns \nabout what is askable and possible. These themes, Johnson argues (p. 3), are the ideologies that \nshape the construction of knowledge for development. Johnson then illustrates the controversies of \nthese approaches by outlining one particular case of the resignation of Ravi Kanbur, a director of \nthe World Development Report in 2000 following disagreements about what form of consultation \nand framing these reports should have (p.10-11). \n \nThe point of this analysis, according to Johnson, is that development practice has become mired in \ndiverse and balkanized approaches to theory and justifications of knowledge, which need further \nanalysis and explanation. Yet, outside the neo-classical model (and associated rational choice) of \neconomics, social science has become hampered by debates about the possibility of generalizing \nfrom single case studies (p. 15). Johnson claims this trend is arresting because focusing on single \nlocalities can be too removed from general processes of development and inference. Accordingly, \nJohnson urges readers to expand on what Peter Evans (1995) has called the ‘comparative \ninstitutional tradition’ – or ‘an inductive methodology that searches for commonalities and \nconnections to broader historical trends and problems while at the same time incorporating \ndivergent and potentially competing views about the nature of history, culture and development’ (p. \n16). \n \nAccordingly, Johnson then takes us on a review of some of the key theoretical (and \nepistemological) framings of knowledge within development in recent decades. The ‘poverty of \nhistory’ – or the inherent tension between descriptive empiricism and wide-scale inference – is \nanalyzed in terms of debates such as the tragedy of the commons, and the institutions that resource \nusers make around regulating access to common property (pp. 31-36). Here the tension is in the \nmodels to explain institutions – from the earlier assumptions about universalistic political behavior \nby the rational choice school of common property regime theorists, to the more culturally embedded \napproaches of ethnographers. \n \nA further chapter then reviews the debates within Marxism about unified theories of capitalist \ndevelopment, and the challenges these notions have brought from postmodern critics (pp. 51-78). \nThis chapter engages with some of the more bitter disagreements within social scientists who are \nseeking alternatives to neo-classical explanations. The chapter again has useful case studies of \ncontroversy that neatly summarize historic debates. In one example, Johnson discuses the influence \nof the US-funded rational-choice research on how peasants engage in insurgencies during the \nVietnam War era, and how this research contrasted with different analysis within the traditions of \npolitical-economy and the ‘moral economy’ of peasants (pp. 74-75). \n \nThese relatively older debates are then updated in an two other chapters about post-development \nand development as discourse (pp. 79-108), and then Amartya Sen’s various contributions to \ndevelopment as a question of freedom (pp. 109-131). The chapters provide useful summaries for \nstudents of what the key points of concepts such as discourse, normalizing debate, and post-\ncolonialism. This section contains up-to-date summaries of controversies about, for example, the \nWorld Trade Organization, or the (alleged) discursive strategies employed by bilateral aid \norganizations such the UK Department for International Development to maintain networks of \nsupport despite ideological differences in these networks (Mosse, 2005). The discussion of \ndevelopment and freedom leads onto a discussion of agency and social choice, referring to debates \nabout justice, and practical applications in sustainable livelihoods. \n \nIn the final chapter (pp. 132-151), Johnson presents several ideas for resolving many of the \nchallenges listed in the book. This chapters considers ways of operationalizing history, as both a \nmethodology and source of information, within explanations and model of institutions. The key \npoint is that ‘the fragmentation of theory and reality reflects a wider fragmentation of economic and \nsocial life’ (p. 150). We need to acknowledge this fragmentation, and identify who currently \nmonopolizes the legitimization and dissemination of what knowledge is gathered, how it is framed, \nand for what purposes. \n \nThis is a deep book, with wide-ranging references, which engages with philosophy and political \ndebates far beyond the usual remit of development studies. Yet the book is focused upon \ndevelopment studies in a way that provides the readership with useful and clearly-written food-for-\nthought on various themes of development practice. It seems to be a valuable addition to any \ngeneral reading list on development theory, or for more specialized development theorists who want \nto gain more context for their own work. \n \n \nTim Forsyth \nLondon School of Economics and Political Science \n \n \nReferences: \nEscobar, A. (1995) Encountering development: The making and unmaking of development, \nPrinceton: Princeton University Press. \n \nEvans, P. (1995) Embedded autonomy: States and industrial transformation, Princeton: Princeton \nUniversity Press. \n \nFerguson, J. (1994) The anti politics machine, Cambridge: Cambridge University Press. \n \nMosse, D. (2005) Cultivating development: An ethnography of aid policy and practice, London: \nPluto. \n"}