{"doi":"10.1086\/320821","coreId":"66219","oai":"oai:dro.dur.ac.uk.OAI2:2455","identifiers":["oai:dro.dur.ac.uk.OAI2:2455","10.1086\/320821"],"title":"Dynamics of niche width and resource partitioning.","authors":["Dobrev,  S.","Kim,  T-Y.","Hannan,  M. T."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2001-03","abstract":"This article examines the effects of crowding in a market center on rates of change in organizational niche width and on organizational mortality. It proposes that, although firms with wide niches benefit from risk spreading and economies of scale, they are simultaneously exposed to intense competition. An analysis of organizational dynamics in automobile manufacturing firms in France, Germany, and Great Britain shows that competitive pressure not only increases the hazard of disbanding but also prompts organizational transformations that give rise to processes of resource partitioning. Emphasizing the content\/process distinction in conceptualizing organizational change, the article finds that the process effect of changes in niche width and position increases mortality hazards. We discuss our findings in light of the processes investigated by the ecological theories of density dependence, resource partitioning, and structural inertia, and point to the theoretical links that help to integrate these theories","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66219.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2455\/1\/2455.pdf","pdfHashValue":"3c0a3ea08965bf6de8b27b1945bdce15752306e0","publisher":"University of Chicago Press","rawRecordXml":"<record><header><identifier>\n  \n  \n    \n      oai:dro.dur.ac.uk.OAI2:2455<\/identifier><datestamp>\n      2011-08-18T08:57:44Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Dynamics of niche width and resource partitioning.<\/dc:title><dc:creator>\n        Dobrev,  S.<\/dc:creator><dc:creator>\n        Kim,  T-Y.<\/dc:creator><dc:creator>\n        Hannan,  M. T.<\/dc:creator><dc:description>\n        This article examines the effects of crowding in a market center on rates of change in organizational niche width and on organizational mortality. It proposes that, although firms with wide niches benefit from risk spreading and economies of scale, they are simultaneously exposed to intense competition. An analysis of organizational dynamics in automobile manufacturing firms in France, Germany, and Great Britain shows that competitive pressure not only increases the hazard of disbanding but also prompts organizational transformations that give rise to processes of resource partitioning. Emphasizing the content\/process distinction in conceptualizing organizational change, the article finds that the process effect of changes in niche width and position increases mortality hazards. We discuss our findings in light of the processes investigated by the ecological theories of density dependence, resource partitioning, and structural inertia, and point to the theoretical links that help to integrate these theories.<\/dc:description><dc:publisher>\n        University of Chicago Press<\/dc:publisher><dc:source>\n        American journal of sociology, 2001, Vol.106(5), pp.1299-1337 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2001-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2455<\/dc:identifier><dc:identifier>\n        issn:0002-9602<\/dc:identifier><dc:identifier>\n        doi:10.1086\/320821<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2455\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1086\/320821<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2455\/1\/2455.pdf<\/dc:identifier><dc:rights>\n        Copyright 2001 The University of Chicago Press<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0002-9602","issn:0002-9602"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2001,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n23 June 2008\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nDobrev, S. and Kim, T-Y. and Hannan, M. T. (2001) ’Dynamics of niche width and resource partitioning.’,\nAmerican journal of sociology., 106 (5). pp. 1299-1337.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1086\/320821\nPublisher’s copyright statement:\nCopyright 2001 The University of Chicago Press\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n23 June 2008\nVersion of attached file:\nPublished\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nDobrev, S. and Kim, T-Y. and Hannan, M. T. (2001) 'Dynamics of niche width and\nresource partitioning.', American journal of sociology., 106 (5), pp. 1299-1337.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1086\/320821\nPublisher’s copyright statement:\nCopyright 2001 The University of Chicago Press\nAJS Volume 106 Number 5 (March 2001): 1299–1337 1299\n\u0001 2001 by The University of Chicago. All rights reserved.\n0002-9602\/2001\/10605-0003$02.50\nDynamics of Niche Width and Resource\nPartitioning1\nStanislav D. Dobrev\nUniversity of Chicago\nTai-Young Kim\nHong Kong University of Science and Technology\nMichael T. Hannan\nStanford University\nThis article examines the effects of crowding in a market center on\nrates of change in organizational niche width and on organizational\nmortality. It proposes that, although firms with wide niches benefit\nfrom risk spreading and economies of scale, they are simultaneously\nexposed to intense competition. An analysis of organizational dy-\nnamics in automobile manufacturing firms in France, Germany, and\nGreat Britain shows that competitive pressure not only increases\nthe hazard of disbanding but also prompts organizational transfor-\nmations that give rise to processes of resource partitioning. Em-\nphasizing the content\/process distinction in conceptualizing organ-\nizational change, the article finds that the process effect of changes\nin niche width and position increases mortality hazards. We discuss\nour findings in light of the processes investigated by the ecological\ntheories of density dependence, resource partitioning, and structural\ninertia, and point to the theoretical links that help to integrate these\ntheories.\nINTRODUCTION\nThis article investigates processes at the intersection of density-dependent\nevolution and resource partitioning. In particular, it examines the effects\n1 This research was supported by the University of Chicago Graduate School of Busi-\nness and by the Stanford Graduate School of Business. This is part of a collaborative\nproject with Glenn R. Carroll. We are indebted to our teammates Joon Han and John\nTorres for helping us code and analyze the data. We also thank Glenn Carroll, John\nFreeman, Richard Harrison, Susan Olzak, Joel Podolny, Jesper Sørensen, Ezra Zuck-\nAmerican Journal of Sociology\n1300\nof crowding in the center of a market on rates of change in organizational\nniche width and on organizational mortality.\nConsider a product market defined in terms of a single dimension—\nengine capacity of automobiles in our empirical application. Producers\nlocate themselves in such a market by choosing an array of products.\nSpecialists offer products with a small range of variation on the dimension\nof interest, and generalists display a broad range of products. In addition\nto choosing a range (niche width), each producer also chooses a location,\nwhich we identify as the center of its product range. Specialists have great\nfreedom in choice of location; they can locate in the center or toward\neither periphery (above and below the center). Generalists face more con-\nstraint in choice of location because a wide niche covers much of the\nmarket; yet, they can still choose whether to locate the center of their\nrange near the center of the market or toward one of the peripheries.\nThe emergence of a center in a market with many producers means\nthat consumer preferences have become concentrated on a relatively nar-\nrow range. The concentration of consumers at a center has two conse-\nquences. First, producers who gain leadership in the center can grow very\nlarge, and often they can exploit economies of scale. Second, the attrac-\ntiveness of the center intensifies competition in the center (at least initially),\nas many producers seek to match their products with consumer\npreferences.\nHow does crowding in the center affect the organizations in a market?\nAccording to density-dependence theory (and, especially, its generaliza-\ntions to localized-density models), crowding intensifies competition, which,\nin turn, elevates mortality hazards. This theory posits that crowding in-\ncreases the mortality hazards of organizations located in the center. Such\nan effect should be especially pronounced for specialists located in the\ncenter, who have nowhere to hide. In contrast, generalists whose niches\nspan the center can potentially offset some of the deleterious effects of\ncrowding in the center with success in less competitive regions covered\nby their wide niches.\nTechnological niches, though subject to strong inertial pressures, are\nnot fixed. Crowding arguably induces organizations in the center to try\nto modify their niches. Obviously, this can mean change in niche width\nor change in niche position. So, for instance, specialists in the center might\nstay specialized but may move to a peripheral position or broaden their\nniches without changing the centers of their niches.\nerman, and the AJS reviewers for helpful comments. Earlier drafts of the paper ben-\nefited from presentations at the 2000 ASA meeting in Washington, D.C., and at the\nTulane Sociology Department. Direct correspondence to Stanislav Dobrev, Graduate\nSchool of Business, University of Chicago, 1101 East 58th Street, Chicago, Illinois\n60637.\nResource Partitioning\n1301\nIf change in a technological niche requires fundamental reorganization,\nthen such change increases the risk of mortality, at least in the short run.\nSo, crowding has a possible indirect effect on organizational mortality by\nstimulating changes that heighten the risk of mortality.\nBecause the effects of crowding on mortality and the risks due to\nchanges stimulated by crowding depend upon an organization’s position\nand niche width, the processes involved arguably can give rise to market\npartitioning. For instance, resource-partitioning theory (Carroll 1985; Car-\nroll and Swaminathan 2000; Dobrev 2000) assumes that, if generalists are\npresent in the center, then specialists can thrive only in the peripheries.\nThis is an obvious potential consequence of the microprocesses described\nabove. However, these processes can produce other patterns as well.2\nWe examine these issues in the context of the automobile industries of\nFrance, Germany, and Great Britain. The automobile industry has a ma-\njor advantage for study of the dynamics of crowding and resource par-\ntitioning: specialism and small size can be clearly distinguished. This\nmatters because some recent research on partitioning processes treats spe-\ncialization as equivalent to small size (Boone, Bro¨cheler, and Carroll 2000).\nAlthough specialists tend to be small in some industries, there is no in-\nherent connection between size and specialism. Given the current state\nof empirical knowledge, it is important to distinguish the effects of size\nfrom those of specialism, as our empirical setting allows. In the automobile\nindustry, some specialists have grown very large. Indeed, no firm has so\nthoroughly dominated the world automobile industry as Ford in its heyday\nin which it offered a single model, the Model T.3 Examples of dominant\nfirms with very narrow niches in European automobile industries include\nthe Great Horseless Carriage Company in the 1890s, Adam Opel in the\n1920s, Volkswagen in the 1950s and 1960s, and Renault in the 1960s.\nNICHE WIDTH, POSITION, AND LIFE CHANCES\nA fundamental sociological insight holds that opportunities and con-\nstraints are inextricably linked to actors’ locations in a social structure.\nThe concept of organizational niche builds on this view. A niche sum-\nmarizes the ways in which social action (collective and individual) hinges\n2 It is worth noting that the possibility that small niches suitable for specialists can\npersist in the center as a consequence of the geometry of sphere packing (Pe´li and\nNooteboom 1999) does not apply to the case we consider. The niches we consider are\none dimensional; the densest packing is complete in this case.\n3 Various versions of the Model T, with only one engine offered at any one time,\ngarnered sales of over 15 million cars during 1908–27. For some of this period, Ford\ncontrolled over half of the world market for automobiles.\nAmerican Journal of Sociology\n1302\non the position of focal actors in a social space.4 Our focus on organi-\nzational niches stems from our desire to understand how an organization’s\nposition in an industry shapes its life chances. An analysis of niches allows\nus to understand the behavior of organizations as it reflects the competitive\nand symbiotic dynamics of interaction within a particular market segment.\nNiche width refers to an entity’s variance in resource utilization (Han-\nnan and Freeman 1989). This representation proves useful for classifying\norganizations in terms of generalist (wide niche) and specialist (narrow\nniche) competitive strategies. Claimed benefits of specialism (or general-\nism) for organizational performance have received much attention. Con-\nventional strategic analysis builds on an especially simple notion—for\nfirms to grow, expand, and increase profitability, they must diversify\n(Chandler 1962; Steiner 1964). Entry into new markets, products, or serv-\nices not only allows the firm to tap potentially unexplored resources, but\nalso reduces risk by spreading it over several operational domains. Ad-\nditionally, diversification generates economies of scale and scope across\nsimilar functions in the separate lines of business (Paine and Anderson\n1983). Thus, generalism is not merely a desirable state; it stands as a\nrequisite for successful organizational performance on this view.\nThe purported advantages of a generalist strategy underestimate the\nimportance of the timing in the industry evolution, fluctuation in resource\nflows, market concentration, and distributions of organizational size and\nage. Environmental processes have been emphasized in the work on or-\nganizational niche theory (Freeman and Hannan 1983; Hannan and Free-\nman 1989; Pe´li 1997). This theory specifies the configuration of environ-\nmental conditions under which the generalist strategy conveys advantage.\nIn particular, the theory posits that generalists are favored when envi-\nronmental variation is high and the pattern of variation is coarse. Our\nreading of the history of the industry suggests that changes in technology\nand in consumer tastes have been highly uncertain over the history of\nthe industry and that changes have occurred irregularly over time. In\nother words, we think that variations in key environments of this industry\nhave been highly uncertain and coarse grained. Our hypothesis about the\nmain effect of niche width on mortality hazards is based upon this as-\nsumption. That is, in the case of automobile manufacturers we argue:\nHypothesis 1.—An organization’s hazard of mortality is a decreasing\nfunction of its niche width.\n4 Although the constructs of organizational niche and niche-overlap density are closely\nassociated with organizational ecology (Freeman and Hannan 1983; Hannan and Free-\nman 1989; Baum and Singh 1994), they have also been used in sociological research\non networks (Burt 1993), work that combines network and ecological themes (Mc-\nPherson 1983; McPherson, Popielarz, and Drobnicˇ 1992; Podolny, Stuart, and Hannan\n1996), and research on social movements (Olzak and Uhrig 1999).\nResource Partitioning\n1303\nAbove we noted the strong connection between an entity’s niche width\nand the degree to which its niche overlaps the niches of others. When an\norganization broadens its niche, it cannot decrease overlaps and generally\nincreases them. So a complete analysis of the consequences of niche width\nmust take account of the excess overlap entailed by broad-niche strategies.\nOur argument about the pattern of competitive intensity triggered by\nniche crowding builds on ideas about localized competition (Hannan and\nFreeman 1977; Barnett and Carroll 1987; Podolny, Stuart, and Hannan\n1996; Han 1998) and the theory of density-dependent legitimation and\ncompetition (Hannan and Carroll 1992, 2000). We argue that the intensity\nof competition experienced by an organization in a market segment is a\npositive increasing function of the number of niches it overlaps, that is,\nits niche-overlap density.5\nHypothesis 2.—An organization’s mortality hazard is a positive in-\ncreasing function of its niche-overlap density.\nNiche theory, like other first-generation theory fragments in organi-\nzational ecology, deals with highly general specifications. In particular, it\nassumes that the conditions that favor generalism or specialism hold uni-\nversally (Carroll 1984). In the years since niche theory was developed, we\nhave learned about diverse forms of population and industry structure\nthat develop over time, as identities and positions become defined and\nsolidified. Hannan (1997) makes use of these arguments to argue that the\neffects of density on competition (and legitimation) are intense at the early\nstages of population growth when populations and industries lack struc-\nture and that they decrease in strength over time. As an industry con-\nsolidates in form and content, the patterns of organizational interaction\ngradually become embedded in the evolving industry structure. Possibly,\nin certain cases, the increase in niche-overlap density might represent the\ntype of syndicate and alliance formation among newly established part-\nners, rather than the clustering of potential competitors. Analyses of re-\nsource partitioning have also shown that relationships among specialist\nentrants tend to form on the basis of symbiotic cooperation instead of\n5 Not all work on competitive intensity would agree with this proposition. For instance,\nsome industrial economists have argued that the transition from monopoly to duopoly\nhas crucial consequences for strategy formation. Bresnahan and Reiss (1991) show\nthat, for markets with three to five competitors in localized markets, the addition of\nany additional competitors does not make a substantial difference. Ecologists Barnett\nand Hansen (1996) show that, among Illinois banks outside of Chicago, only the arrival\nof the first competitor in the town increases the focal firm’s chances of failure signif-\nicantly. Their results suggest that “additional increases in the number of competitors\nin a local market actually decrease failure rates” (1996, p. 153). We explored this issue\nby supplementing the usual parametric analyses of the effects of overlap density with\na more flexible specification. As we describe below, we found that the effect of overlap\ndensity is much stronger at higher densities.\nAmerican Journal of Sociology\n1304\ncutthroat competition. In the case of the U.S. brewing industry, for ex-\nample, the wave of entries of small niche producers (microbrews and\nbrewpubs) strongly resembles the coevolving mutualism typical of a social\nmovement (Swaminathan and Carroll 1995, p. 236). In general, the del-\neterious effect of niche crowding on survival chances ought to fade as an\nindustry matures (Hannan 1997).\nHypothesis 3.—The effect of niche-overlap density on an organiza-\ntion’s hazard of mortality declines with industry age.\nINERTIA, CHANGE, AND LIFE CHANCES\nIt is important to recognize that the predicted effects of niche width and\nniche-overlap density do not fully reveal or account for the experiences\nof all—or even most—organizations in competitive markets. For example,\nrarely does a firm enter the market with a certain set of product offerings\nand manage to sustain that exact same set throughout a long tenure in\nan industry. Whether as a result of innovation, copying from successful\ncompetitors, or obsolescence, product turnover is an inevitable part of\nkeeping in pace with industry development. As new products become\nintroduced and old ones abandoned, as mandates for technological com-\nparability and standardization intercede with financial objectives and\nlimited resource availability, the line of product offerings that each firm\ncan bring to market might vary substantially. So for many rea-\nsons—strategic, institutional, or random—the boundaries of an organi-\nzation’s niche and its width likely will fluctuate. We believe that such\ntransitions involving change in niche width and market position have\nvital consequences for the organizations that initiate them. Thus under-\nstanding the likely advantages and disadvantages conveyed by niche\nwidth and market position requires that we also investigate the processes\nby which organizations acquire such characteristics. We turn to this issue\nnext by bringing in insights from several ecological theories, including\nstructural inertia, resource partitioning, and organizational learning.\nDo efforts to broaden or narrow the array of an organization’s tech-\nnological competencies, or attempts to reposition in the market in search\nof new opportunities or of a less competitive sector, affect organizational\nperformance and survival chances? Adaptation and selection theories sup-\nply different arguments to answer the question. The former frequently\npoint to the benefits that an organization can derive once the desired\ntransformation has been completed, whereas the latter emphasize the\ndifficulties associated with accomplishing the transition. Thus, the main\nissue in the lingering debate between the two perspectives has centered\nResource Partitioning\n1305\non whether the costs of implementing organizational change outweigh the\npotential benefits of its outcome, or vice versa.\nA body of recent empirical research has singled out several important\nfactors that—when taken into account—help to reconcile the adaptation\nand the selection arguments. This research shows that changes in core\nfeatures of the organization increase mortality hazards, while changes in\nperipheral attributes sometimes have the opposite effect. Hannan and\nFreeman’s (1984) structural-inertia theory, which posits that core change\ndegrades structural reproducibility and hence lowers an organization’s\nability to act as a reliable and accountable collective entity, has been\nconfirmed in most empirical studies conducted using the appropriate re-\nsearch design (Barnett and Carroll 1995; Carroll and Hannan 2000). Ex-\namples of studies showing that mortality hazards rise with core change\ninclude research on several newspaper populations (Carroll 1984; Miner,\nAmburgey, and Stearns 1990; Amburgey, Kelly, and Barnett 1993; Dobrev\n1999), telephone companies (Barnett 1994), voluntary social service as-\nsociations (Singh, House, and Tucker 1986), social movement organiza-\ntions (Minkoff 1999), banks (Han 1998), and film-production companies\n(Kim 1998, 2000).\nBarnett and Carroll (1995) criticize research on this subject for failing\nto distinguish between the content and the process of change. They argue\nthat research is most informative about the hazards of change when it\nseparates the effect of the characteristics of the state to which an organ-\nization is moving from the various obstacles and impediments it undergoes\nin trying to get to that state. Understanding why organizations fail to\nachieve the desired outcome of internal transformation or why they simply\nfail, involves understanding the process dimension of change.\nWe define two types of organizational-level transformations, each per-\ntaining to position in the market. Then we decouple the content from the\nprocess dimension in each. We begin with change in organizational niche.\nHypotheses 1 and 2 posit that organizations with wide product niches\nwill benefit from taking advantage of economies of scale, more adaptive\nresource utilization, and risk spreading, but, at the same time, will face\nstronger competitive pressures. These hypotheses concern states, not pro-\ncesses at the organization level. Therefore, from the perspective of an\norganization’s changing its niche, these hypotheses relate solely to the\ncontent of change. Yet, implementing a substantial change in niche width\nlikely triggers additional unintended effects associated with change, per\nse. The theory of structural inertia predicts that the process effects will\nhave deleterious consequences for survival chances if such changes entail\nfundamental organizational transformation.\nWhy should this be so? The explanations concern both the organization\nand population levels. The loss of established routines and practices means\nAmerican Journal of Sociology\n1306\nlosing capabilities and competencies that need to be replaced with new\nones that take time to develop. The likely reshuffling of the political status\nquo and the internal balance of power generates individual resilience and\ninertia as well as fear of the unknown (Dobrev and Barnett 2001). Re-\nlationships that rest on trust are slow to rebuild. Fundamental change\nalso disrupts the intra- and interorganizational networks among employ-\nees as well as between the organization and its external constituents that\nact as depositories of organization-specific tacit knowledge. In short, the\nprocess of organizational change resets the liability of newness clock (Han-\nnan and Freeman 1984; Amburgey et al. 1993; Pe´li, Po´los, and Hannan\n2000).\nTo develop and test these arguments, we need to define market position,\nchange in market position, and the difference between the content and\nprocess of change. One useful way to conceptualize the social structure\nof a market follows the resource-partitioning model. It construes the mar-\nket as a reflection of an intersection of dimensions capturing the distri-\nbutions of industry-relevant consumer preferences. The peaks of those\ndistributions tell us where the market center lies—where resources are\nmost abundant and competition is ordinarily stiffest. Market position of\nan organization then can be defined in terms of its distance from the\nmarket center, and change in market position corresponds to the difference\nin that distance between sequential observations. The content of change\nin this context refers to the costs and benefits associated with the position\nto which the organization is aspiring to move (as contrasted with those\nfor the state it is leaving).\nBy contrast, the process dimension reveals the difficulties of actually\nimplementing and undergoing such a transition. The market and its center,\nof course, are dynamic constructs that can also change continuously. Al-\nthough an organization can experience a change in its relative position\nwithout making any changes in its own product offerings, the argument\nlinking the process of organizational change to increased exposure to\nselection pressures and higher likelihood of disbanding would not apply\nto such cases. Integrating the theory of structural inertia with the con-\nceptual differentiation between content and process change yields the\nfollowing two hypotheses predicting negative effects of process change in\nniche width and in absolute market position on survival chances of auto-\nmobile manufacturers.\nHypothesis 4.—Change in an organization’s niche width increases its\nhazard of mortality.\nHypothesis 5.—Change in an organization’s absolute market position\nincreases its hazard of mortality.\nResource Partitioning\n1307\nCrowding, Learning, and Rates of Change in Organizational Niches\nAnother important issue in studying organizational change concerns the\nability to discern direct and indirect effects that might impact the outcome\nof internal transformation. For example, in their research on Finnish\nnewspapers, Amburgey et al. (1993) find that organizational age has pro-\nnounced effects on the rate of disbanding and on the rate of change. The\nfindings suggest that young organizations are more likely to change and\nless likely to experience the negative repercussions of that change. Under-\nstanding the possible compounded effect of certain organizational attrib-\nutes on internal transformation mandates analyzing their relevance for\nsurvival chances and also the degree to which such factors influence the\npropensity to implement change.\nAbove we argued that niche-overlap density would increase mortality\nrisks by stiffening competition. Yet, not all organizations fail as a result\nof intensified market-segment rivalries and depleting resources. What al-\nternative strategy might such organizations pursue? To answer this ques-\ntion, we turn to the resource-partitioning theory (Carroll 1985). This model\nderives market segmentation as a result of strong competition for position\nin the most lucrative sector of the market. The process drives industry\nconcentration high, as typically just a few generalists end up occupying\nthe market center. The rest of the competitors either fail or retreat toward\nthe periphery where they tend to specialize and explore untapped re-\nsources. We think the transition toward the market periphery entails sig-\nnificant reorganization. Whether aimed at meeting the demands of new\nconsumer groups or at expanding emergent specialized market segments\nand creating demand by introducing novelty products, the move from a\nmore to a less saturated market segment likely involves both change in\nmarket position and in niche width. So, based on the resource-partitioning\nprocess, we expect that heightened competitive intensity not only increases\nmortality hazards, but it also promotes the occurrence of internal change.\nHypothesis 6.—An organization’s likelihood of changing its niche\nwidth and position increases with its niche-overlap density.\nThe management literature generally emphasizes the value of organi-\nzation’s capacities to learn (Argyris 1999). Much of the sociological lit-\nerature underscores the hazards and limitations of organizational learning\n(March 1991; Hannan and Freeman 1989). The two perspectives, however,\nare not contradictory. Organizations do indeed learn from what they do\nand eventually become better at it. Their propensity to do what they have\nlearned and have become good at increases concurrently. This organi-\nzational feature, of course, need not be construed negatively as long as\nthe substance of the cognitive accumulation itself constitutes the right\ncourse of action under the prevailing environmental conditions. However,\nAmerican Journal of Sociology\n1308\nthe dynamic and multifaceted nature of the environment and the changing\nneeds of the organization at each stage of its life cycle demand continuous\nrealignment between an organization’s strategy and its external constit-\nuents. In that context, falling in a competency trap (March 1988) by relying\nmore on and becoming better at an infeasible course of action is a doomed\nstrategy that results from the mixture of past learning and inertia. We\nexamine possible path dependence in change processes by testing the\nfollowing hypothesis.\nHypothesis 7.—The greater an organization’s experience with a type\nof change, the greater is its likelihood of repeating the same type of change\nand the lower is its likelihood of making other kinds of changes.\nOrganizational sociologists have pointed to a link between structural\ncomplexity and inertia (Hannan and Freeman 1984; Barnett and Carroll\n1995). If organizations with complex structures are inherently less capable\nof fundamental change, what do they learn from their experiences? As-\nsume that the capacity to learn and the type of change incurred are held\nconstant for all organizations (regardless of the complexity of their struc-\ntures). Just as we expect organizations with simpler designs to learn how\nto change and to repeat the same changes that they have already survived,\nthis should be less true for complex organizations. In other words, we\nthink that the “momentum of change” declines with complexity. We do\nnot have a direct measure of organizational complexity. However, our\nreading of the primary sources on this industry leads us to think that\norganizational complexity for automobile manufacturers tends to be di-\nrectly proportionate to their niche width. Based on this assumption, we\nconjecture that\nHypothesis 8.—The effect of an organization’s experience with a type\nof change on its likelihood of repeating that change declines with the\ncomplexity of the organization.\nCompleting the Model\nWe agree with Barnett and Carroll (1995) that modeling internal organ-\nizational change will not be complete unless the general evolutionary\ntrends of the industry are taken into account. So we try to account for\nall of the relevant factors that earlier research on organizational change\nand ecological research on determinants of rates of organizational dis-\nbanding have indicated to be relevant.\nPrevious research shows that organizational age and size have a pro-\nfound impact on both organizational mortality and rates of organizational\nchange. We introduce a measure of relative size, which makes it possible\nto interpret the effects of size in relation to a reference category, namely,\nthe largest organization by year in the population. We use Hannan et al.’s\nResource Partitioning\n1309\n(1998a) nonproportionate specification, which allows the effects of age\nand relative size to interact in affecting mortality hazards.\nWe include a dynamic specification of the density-dependence model\nwhere the density terms are interacted with population age to capture the\ndifferent cycles in the history of the industry (Hannan 1997; Hannan et\nal. 1998b; Dobrev 2001). Following Hannan et al. (1995), we also distin-\nguish between the effects of system-level (European) and subsystem-level\n(country-specific) density to reveal the multilevel nature of the density-\ndependence process. It posits that legitimation can diffuse the image and\nidentity of an organizational form across national boundaries and operates\nat a broader level than competition, which is constrained geographically\nwithin national markets.\nOrganizational age has also played an important role as an explanatory\ncovariate in previous analyses focused on the effects of change on survival\nand determinants of rates of organizational change. For example, Am-\nburgey et al.’s (1993) study of Finnish newspaper mortality found that\nonly old newspapers faced increased hazards when they attempted core\nchange. They also show evidence that the occurrence of organizational\nchange gets modified by organizational age in two important ways. First,\nthe rate of change decreases with organizational age, and second, the\nmomentum effect of prior change is more pronounced for younger or-\nganizations for one type of change, but stronger for older organizations\nfor another. By contrast, a study of core change and survival of social\nmovement organizations in the United States reports that older organi-\nzations are more likely to change, while the momentum of change declines\nwith age (Minkoff 1999).\nRESEARCH DESIGN\nThis research uses data on the automobile industries in France, Germany,\nand Great Britain. It considers the full history of the automobile industry,\nstarting with 1885 and ending with 1981, the last year of full coverage\nin our most comprehensive source of data. The data come from a study\nthat coded histories of automobile manufacturers worldwide from reports\nof automobile historians and collectors.6 The most comprehensive infor-\nmation comes from two encyclopedias: Georgano (1982) and Baldwin et\nal. (1987). Because the sources highlight automobiles as technical products,\nthe resulting histories of firms pertain to spells of automobile production\nnot to lifetimes of the firms. These sources organize their reports around\nmarques, not firms. Entries for marques had to be combined to create\n6 Hannan et al. (1995) and Carroll and Hannan (2000) provide details on the design.\nAmerican Journal of Sociology\n1310\nrecords for firms. The records contain information about spells of auto-\nmobile production by firms but not about their complete lifetimes, which\nsometimes involved operation in another industry before or after a spell\nof automobile production. In some cases, the sources do tell about the\ncreation and destruction of the firms. Insofar as the sources permit, the\nresearch team reconstructed the organizational histories of the firms in\nthese industries.\nThis coding effort yielded data on 828 French, 373 German, and 995\nBritish firms. Many were small, short-lived, and obscure and left little\nhistorical record. However, including information on such obscure or-\nganizations is crucial to sound inference about the causes of organizational\nmortality. Keeping short-lived firms in the analysis means relying on in-\ncomplete information. Therefore, we made several assumptions about\nobscure, short-lived firms to allow us to include them in the analysis, as\nwe explain below.\nEntry and Exit Events\nOrganizations entered automobile production by several paths, as we\nnoted above. Three were especially common: (1) a firm is built de novo—it\nhas no prior organizational experience at time of entry, (2) a new firm\nresults from a merger of automakers or by the division of one automobile\nmanufacturer into two or more firms, or (3) a firm enters from another\nindustry. For the obscure firms, we know only that they began automobile\nproduction but not whether they migrated from other industries.7 This\nset presumably includes both newly founded firms and entrants from other\nindustries. The more complete American data indicate that both types of\nentry were very common.\nPrevious research on these populations found that the life chances of\nlateral entrants and firms that arise by merger or fission of automakers\nwere better than those of firms that began de novo or whose type of entry\nis unknown. However, using the distinction between lateral entry and\nstart by merger or fission did not improve model fits significantly. There-\nfore, as in previous research, we use only one distinction about type of\nentry in this analysis: whether a firm has prior existence of any kind\n(either in the automobile industry or in some other industry). We treat\nfirms with unknown entry events as not having existed previously.\nFor ending events, the most important distinctions concern (1) dis-\n7 Individual entrepreneurs surely did come from other industries, and this information\nis sometimes available. However, our unit of observation is the organization, not the\nentrepreneur. For us, the key distinction is whether the organization is new at auto-\nmobile manufacturing.\nResource Partitioning\n1311\nbanding, (2) exit to another industry, and (3) merger or acquisition. Dis-\nbanding has an unambiguous meaning: the firm failed as a collective actor.\nExit to another industry also suggests a lack of success in automobile\nmanufacturing. Although merger and acquisition both result in the loss\nof one or more independent collective actors, firms merge and acquire for\ndiverse reasons. Sometimes a firm flounders and its owners seek to recover\nsome fraction of their investment by selling the firm. In other cases, a\nthriving firm’s competencies command great value from potential ac-\nquirers or merger partners. Because of the ambiguous meaning of mergers\nand acquisitions, we concentrate on disbanding and exit to another in-\ndustry in this analysis (within the limits of the data, discussed next).\nWe also do not know exactly what happened to most firms when they\ndropped from the set of producers, especially in the European populations.\nThis is invariably the case when spells of automobile production were\nshort.8 Apparently, automobile historians rarely could reconstruct the de-\ntails about an exit unless a firm had become reasonably well established.\nKnowledge that a certain firm disbanded, was acquired, or left the in-\ndustry usually means that it persisted in the industry long enough that\nits exit event received notice in the press.\nAs Hannan et al. (1998a) explain, “unknown exit” could be interpreted\nas an ending event in its own right, governed by its own transition rate.\nBut, they argue against this idea. Because availability of information on\nthe kind of exit depends (strongly) on tenure in the industry for the Eu-\nropean populations, this analytical strategy would confound the specifi-\ncation of the state space (the origin and destination states) and tenure.\nThey note that the historical materials suggest that most exits of unknown\ntype were disbandings or exits to other industries. Analysis of various\nalternative treatments of the unknown-exit cases lead Hannan et\nal. (1998a) to conclude that events of unknown type were governed by\nprocesses more similar to those underlying disbanding and exit. We follow\nthe earlier research in treating these two events alike: the dependent\nvariable in this analysis is disbanding\/exit to another industry, defined to\ninclude events of unknown type. Firms known to have ended by other\nevents (merger, acquisition, nationalization) are treated as (noninforma-\ntively) censored on the right at the times of these events.\nDating Entries and Exits\nThe archival sources contain varying degrees of precision in dating events.\nSometimes the sources give the exact date; other times they give only the\n8 This difference shows up clearly when one calculates integrated hazards of the various\nevents as a function of duration (tenure in the industry). The rate of the unknown\ntype of exit is much higher over the early years of tenure (up to about seven years).\nAmerican Journal of Sociology\n1312\nmonth and year or season and year. Most often, they record only the year.\nTo make analysis tractable, all of the information about timing was con-\nverted into a common metric; exact dates were represented as decimal\nyears. When dates were given in terms of months or seasons, decimal\nyears were assigned using judgments of the midpoint of the time unit.\nFor example, “early fall” was coded as occurring on October 15 (day 288\nin the calendar), giving a decimal year value of 0.79. Dates given to only\nthe year were coded as occurring at the midpoint of the year.\nWhat is normally called organizational age in the literature is, with few\nexceptions, actually a measure of duration or tenure in a particular or-\nganizational population (Carroll and Hannan 2000). Tenures in auto-\nmobile production can be calculated straightforwardly when dates are\nexact or nearly exact. The challenging case involves entry and exit in the\nsame year. The data we used impose the assumption that the tenure (in\nyears) in the industry for such a case is bounded by 0 and 1. Such cases\nare assigned a tenure of 0.5 (the expected tenure under the assumption\nof a uniform distribution of events over the calendar year). Exits for such\ncases are coded as occurring at (just before) the end of the year. When a\nfirm enters in one year and leaves in the next (e.g., a firm is reported to\nhave begun production in one calendar year and ended production during\nthe following year), we attach the starting time to the middle of the first\nyear and the ending time to the midpoint of the next year, giving a com-\npleted tenure of one year (which is, again, the expected tenure under the\nassumption of a uniform distribution).9 These rules generalize to handle\nall of the relevant cases.\nMEASUREMENT\nNiche Width\nAdapted from the field of bioecology (Hutchinson 1957), organizational\nniche theory (Freeman and Hannan 1983; Hannan and Freeman 1989)\ndecouples the construct of the fundamental niche—the multidimensional\nsocial space in which an organization (or an organizational form) can\ngrow or at least sustain itself—from that of the realized niche, a subset\nof the fundamental niche in which an organization can sustain itself in\nthe presence of competitors. We follow the lead of Podolny, Stuart, and\nHannan’s (1996) research on semiconductor manufacturers, which ex-\npresses an organization’s fundamental niche as a function of its position\n9 The general problem concerning data of this kind is known as time aggregation bias.\nThese procedures are consistent with Petersen’s (1991) recommendation for dealing\nwith this problem.\nResource Partitioning\n1313\nTABLE 1\nMeasures of Niche Width, Market Position, and Change in\nMarket Position\nVariable Definition\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .maxEit Firm i’s largest engine ca-\npacity at t\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .minEit Firm i’s smallest engine\ncapacity at t\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .maxE4t The maximum engine ca-\npacity among the four\nlargest firms\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .minE4t The minimum engine ca-\npacity among the four\nlargest firms\nFirm’s niche width ( ) . . . . . . . . . . . . . . . . .Wit\nmax minE \u0001Eit it\nMidpoint of a firm’s niche ( ) . . . . . . . . .Mit\nmin max minE \u0002 (E \u0001E )\/2it it it\nChange in niche width ( ) . . . . . .DW p 1it orW \/W ≤ 0.9it i,t\u00011\nW \/W ≥ 1.1it i,t\u00011\nExpansion . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . W \/W ≥ 1.1it i,t\u00011\nContraction . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . W \/W ≤ 0.9it i,t\u00011\nWidth of market center ( ) . . . . . . . . . . . . .Ct\nmax minE4 \u0001E4t t\nMidpoint of market center ( ) . . . . . . . .midCt \u0002 ( ) \/ 2\nmin max minE4 E4 \u0001E4t t t\nPosition:\nDistance above market center ( ) . . .aPit\nmidmax (M \u0001 C ,0)it t\nDistance below market center ( ) . . .bPit\nmidmax (C \u0001M ,0)t it\nExtent of change in relative position\n( ) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .DPit (M \u0001 C )\u0001 (M \u0001 C )it t i,t\u00011 t\u00011\nAny change in absolute position\n( ) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .aDP p 1it M (Mit i,t\u00011\nin a technological space. Specifically, we measure the niche width of an\nautomobile producer in terms of the spread of engine capacity over all\nmodels that a firm produces measured in cubic centimeters (cc) in a given\nyear.10 (Operational measurements of niche-related measures are presented\nin table 1.) Firms with a single model or more than one model with the\nsame engine have a minimal niche width, which we set to 1 cc to avoid\nhaving to speak of niches of zero width. A firm that produces one or more\n10 When such data were not available but we could find data on horse power, we\npredicted capacity in units of cc using the coefficients of maximum (minimum) capacity\non maximum (minimum) horsepower with controls for historical periods and organi-\nzational properties.\nAmerican Journal of Sociology\n1314\nTABLE 2\nDescriptive Statistics for Niche Width and Niche-Overlap Density\nFrance Germany Great Britain\nNiche width (in 1,000 cc) minimum: .001 .001 .001\nMax . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 11.37 20.0 14.3\nMean . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 1.87 1.85 1.14\nSD . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 2.06 2.24 1.46\nNiche-overlap density:\nMin . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 0 0 0\nMax . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 175 106 218\nMean . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 70.1 28.0 53.4\nSD . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 49.7 21.8 47.2\nmodels with a very small engine and one or more with a very large engine\nhas a broad niche by this construction.11\nWhile the sources frequently provide information on the smallest and\nthe largest engine capacity models, they rarely list all of the models that\ncompose the firm’s set of offerings. This precluded us from constructing\na measure of number of models produced. However, our study of the data\nsources leads us to conclude that firms with wide niches that produced\nvery few models (e.g., producing only two models: a single high-engine-\ncapacity model and a single low-engine-capacity model) have been prac-\ntically nonexistent throughout the history of the industry. In fact, when\nevidence is available, we find that the most intensely exploited techno-\nlogical space falls at or near the center of the firm’s niche. This justifies\nour assumption that there is little, if any, unobserved heterogeneity related\nto product range within firms with similar niche width. Table 2 provides\ndescriptive statistics on niche width for the three populations.\nMeasuring organizational niches along a single dimension—\ntechnological scope, in our case—has its limitations. If our measures of\nniche width and overlap density capture only market position and com-\npetitive dynamics in technological space, they would be less than ideal\nfor testing the theoretical propositions stated in the previous section. How-\never, we believe that our decision to define organizational niches along a\ntechnology dimension has compensating advantages. Most important, it\nprovides us with a means of making meaningful comparisons of firms\nthat have existed in disparate historical periods, thereby allowing us to\nanalyze the evolution of the industry from its origins. It makes it possible\nto draw as complete a picture as possible (given the severe paucity of\ninformation for many of the entries in our data sets) of the overall market\n11 Arguably, two firms with similar niche widths can differ from one another by the\nnumber of models they produce each year.\nResource Partitioning\n1315\nniches of the automobile firms whose fates we analyze. In other words,\nwe think that technological niches in this industry are informative about\nmarket position. We think this is so because, upon examination, the choice\nof engine capacity made by automobile producers over the years proves\nto be revealing not only of the ranges of their technological offerings but\nalso of these firms’ strategies in product marketing and competitive pric-\ning, customer segment targeting, supply-chain management, and inno-\nvation. We illustrate this point below with examples of well-known pro-\nducers from each of the three European industries we investigate.\nIn 1922, the renowned British automobile manufacturer Rolls-Royce\nmade a clear change in direction toward expanding its customer base by\noffering some more affordable models with much smaller engines. In so\ndoing, it also appealed to a customer segment with a different social\ndisposition. The introduction of a smaller-engine model, nicknamed the\nBaby Rolls, complemented the powerful (big engine) and also very prof-\nitable model, known as the Silver Ghost. Interpreting the significance of\nthis strategic decision, the industry historians Baldwin et al. (1987, p. 416)\nwrite,\nAlthough frowned on by the purists, as such innovations always are, [the\nBaby Rolls] brought Rolls-Royce motoring to a new market, not only those\nwho could not afford a Silver Ghost but those who did not want an enor-\nmous car, or those who preferred to drive themselves.\nThe obvious correspondence between difference in price range and\ndifference in model engine capacity can be seen in the case of the legendary\nGerman automaker Mercedes-Benz. In the depression years of the 1930s,\nthe company introduced the smallest Mercedes-Benz ever made until that\ntime, a car with a 1.7 liter engine. Its low starting price of 4,150 marks\nmade it the company’s best-selling model of the interwar era; more than\n85,000 such cars were sold in less than a decade. At the opposite end of\nthe scale, we find the 7.6 liter engine model, which was\naptly nicknamed “der Grosser Mercedes.” . . . Some of the 177 first series\nof Grossers were sold to anyone who could afford them (at 38,000 to 47,000\nmarks), but the 88 second series cars went entirely to the Nazi hierarchy\nor to foreign rulers such as Joseph Stalin, Finland’s Field Marshall\nvon Mannerheim, Spain’s General Franco, and Antonio Salazar of Portugal.\n(Baldwin et al. 1987, p. 122)\nThe technological range of products offered by an automobile producer\nalso speaks to organizational designs and internal arrangements of the\ncompanies, as well as the resources available to them. For example, in\nthe post–World War I period in France, Renault’s technological niche\nAmerican Journal of Sociology\n1316\nranged from a 9.1 liter engine (in an “elephantine” car), on the high end,\nto the modest 0.95 liter engine of the Model KJ, on the low end. This\nextremely broad scope of offerings reflected an expansion of production\nfacilities that allowed the company to make the supply-chain process\ninternal and also clearly provided a resource advantage. According to\nBaldwin et al. (1987, p. 404),\nAs a result of wartime expansion the Renault works . . . in 1919 consisted\nof 87 built up acres, including a steel foundry, . . . three iron foundries, one\naluminum and one brass foundry, general machining shops and assembly\nshops for all components including bodywork. . . . In 1919 Renault acquired\nits own steel works . . . the most modern steel plant in Europe.\nWe think these examples (only a few of the many that we came across\nduring the coding process) justify our reasoning in electing to focus on\ntechnological niches of organizations, a choice that allows us to interpret\nnot only the range of product offerings, but also the overall market strategy\nand position of the firms in our data. That said, we also suspect that the\ndimensionality of niches in this industry has increased over time, as issues\nsuch as safety, durability, fuel economy, and so forth have come into\nprominence. If this surmise is correct, then our measure of the technical\nniche does a better job of characterizing firms’ complete niches in the\nearlier portion of the industry history than in more recent times. This\nreasoning supplies another, slightly different, interpretation of the rela-\ntionship proposed in hypothesis 3, which states that the effect of (technical)\nniche-overlap density on mortality rates declines with industry age. By\nthis interpretation, the decline is due to the increasing dimensionality of\nniches with industry age.\nCompetitive Intensity\nWe measure competitive intensity as proportional to niche-overlap density,\nthe number of organizations present in the focal firm’s niche. Table 2\nprovides descriptive statistics on niche-overlap density for the three pop-\nulations. Notice that the ranges are extremely broad. Each population\ncontains firms whose niches do not intersect any others, and they also\ncontain firms whose niches overlap with hundreds of other firms.\nFigures 1–2 show the joint distribution of niche width and overlap\ndensity for two time slices, 1900 and 1925, for the French population.\n(The pattern for the British and German populations is similar.) Notice\nthat only extreme specialists (those whose niches are very close to zero)\ndo not experience high niche overlap. Movement away from pure spe-\ncialism causes overlaps to increase very sharply.\nResource Partitioning\n1317\nFig. 1.—Niche width and niche-overlap density in the French population of automobile\nmanufacturers in 1900.\nPosition Relative to the Market Center\nRecall that we want to address resource-partitioning theory’s claims about\ncompetition in the center of the market. Ideally, we would like to use\ninformation on the distribution of consumer tastes to identify the market\ncenter. Lacking such information, we use information on the locations of\nthe four largest firms in the (national) market, reasoning that large size\ncan be gained in the market center. We define the range of the center as\nthe range between the lowest minimum and highest maximum engine\ncapacity among the four largest firms and the market center as the mid-\npoint of this range\nWe measure a firm’s position in the market in terms of its distance\nfrom this measure of the market center. We distinguish between position\non the high end (i.e., producing luxury or sports model cars with high\nengine capacity) and position on the low end (i.e., producing economy\nmodels with low engine capacity). Both measures are set to zero for cases\nthat fall on the other side of the market center from the direction being\ncoded.\nAmerican Journal of Sociology\n1318\nFig. 2.—Niche width and niche-overlap density in the French population of automobile\nmanufacturers in 1925.\nChanges in Niche Width and in Position\nOur measures of organizational changes reflect the important substantive\ndichotomy of content vs. process that underscores our theoretical argu-\nments. We constructed a dummy variable for niche-width change that\nequals one if the firm’s niche expanded or contracted by at least 10%\nrelative to the preceding year. We think an increase or decrease in niche\nwidth by at least one-tenth implies a meaningful internal reorganization,\nsufficient to trigger a change in the organizational core. We agree with\nPodolny et al. (1996, p. 663) that “an organization might gradually adjust\nits underlying technological competencies through ‘local search,’ but sig-\nnificant change in position . . . demands fundamental alteration of the\norganization itself.”\nWe use two measures of change in position. Relative change in position\nis the difference in the distance of the firm’s niche center from the market\ncenter between consecutive years. Because relative change in position\nmight occur without change by the organization (i.e., when only the mar-\nket dimensions are shifting), we also include a dummy variable for ab-\nsolute change that captures instances of change undertaken by the or-\nganization, regardless of whether such change modifies the firm’s position\nResource Partitioning\n1319\nTABLE 3\nFrequency of Changes in Niche Width and Position\nFrance Germany Great Britain\nN % N % N %\nSpells with absolute posi-\ntion change . . . . . . . . . . . . . . . . 448 8.7 382 16.8 1,478 26.5\nSpells with niche width\nchange . . . . . . . . . . . . . . . . . . . . . 602 11.6 273 12.0 1,057 18.9\nSpells with both changes . . . 306 5.9 193 8.5 833 14.9\nFirms experiencing absolute\nposition change . . . . . . . . . . . 227 27.7 127 34.0 400 40.5\nFirms experiencing niche\nwidth change . . . . . . . . . . . . . 290 35.4 121 32.4 362 36.7\nFirms experiencing both\nchanges . . . . . . . . . . . . . . . . . . . . 184 22.5 95 25.5 281 29.1\nrelative to the market center. The frequency of changes in niche width\nand absolute position are presented in table 3.\nOrganizational Size: Absolute and Relative\nResearch on age-varying size and life chances has conceptualized and\nmeasured organizational size in two ways: capacity and scale of operations\n(Barron, West, and Hannan 1994; Carroll and Hannan 2000). We follow\nthe previous research on these populations and concentrate on scale of\noperations, and we measure it in terms of a firm’s annual production of\nautomobiles. This measure makes good sense in the context of the industry\nand its history. Even analyses of the current situation focus on market\nshare, measured in vehicles sold. Moreover, this measure is available more\nregularly than accounting measures of performance, and it is likely to be\nmeasured more reliably in most cases.\nAn exhaustive search failed to uncover precise information on annual\nproduction for most short-lived firms. Coverage is worst for France and\nGermany, with precise information lacking for 81% of the firms in each\ncountry’s industry; these account for 68% of the firm-years in France and\n65% in Germany. Information on size is most complete for the British\nindustry, for which precise information on size is lacking for 62% of the\nfirms in the British industry—these firms contribute 43% of the firm-years\nof observation.\nHannan et al. (1998a) argue that information about a firm’s size in-\ndicates clearly that its scale was very small. The counts often come from\nnew vehicle registrations, which were presumably exhaustive, and from\ncounts of surviving automobiles. Often the sources indicate that the firm\nAmerican Journal of Sociology\n1320\nproduced only “a few” automobiles. In others, no mention is made of the\nscale of production. In both cases, a firm was coded as “small.” Sometimes,\nthe sources suggest that production levels were substantial, but they do\nnot provide exact counts. For instance, this is the case when there are\ngaps in the yearly series at the end of a firm’s history and previously\nreported production totals were large. In such cases, our research group\ndistinguished “middle size” (the firm’s production level in a year was much\nhigher than “small” but considerably smaller than the scale of the largest\nfirms in the industry at the time). In a few cases (mostly occurring during\nthe interwar years), it appeared that a firm’s production level approached\nthose of the industry’s biggest firms; size in such cases was coded as\n“large.”\nAs in the previous research, absolute sizes are imputed to firms lacking\nprecise information based on the size distributions of firms whose pro-\nduction levels are observed to impute sizes for the three categories. When\na firm’s yearly observation was coded as “small” and no more precise\ninformation was available, it was assigned a value from a uniform dis-\ntribution ranging from zero to the first quartile of the size distribution\nfor the historical period. Firm-years coded as medium and large were\nassigned the second and third quartile values, respectively.\nHannan et al. (1998a) analyzed the resulting data in two ways. In one,\nthey merely distinguished the three size classes: small, medium, and\nlarge.12 In the second approach, they used the natural logarithm of the\nvalue based on the precise measures and the imputed ones. There was\nlittle substantive difference in the results of the two kinds of analysis:\nboth indicated that the rate of disbanding\/exit is very high for the smallest\nfirms and declines as a function of size. We follow the earlier research in\nusing the constructed metric measure of size. We measured relative size\nof a firm as the ratio of each firm’s size to the size of the largest firm in\nthe national population at the time.\nCONTROLS\nWe use a common population-level clock in the various analyses: industry\nage. The clock for each country begins at zero in 1885, the time of initiation\nof the French population of automobile manufacturing firms.13 This choice\n12 For this analysis, they coded firm-years with precise information as small if the level\nwas below the period’s first quartile, medium if it fell in the interquartile range, and\nlarge if it exceeded the third quartile.\n13 This choice probably has little consequence for the empirical analyses, because the\ndates of initiation of these national automobile industries differs by a decade at most.\nResource Partitioning\n1321\nreflects the view that processes of legitimation likely spill over national\nboundaries (Hannan et al. 1995).\nWe control for changes in institutional conditions and industry structure\nwith period effects, and we chose to follow the prior research on these\npopulations in defining historical periods.14 The analyses reported below\nalso contain effects of economic depression, the level of the gross domestic\nproduct (GDP) adjusted for inflation (taken from Maddison [1991]), and\nthe period effects. We excluded the years of the two world wars from the\nanalysis because the production of motor vehicles for private use was\nstopped in all of these countries.15\nSTOCHASTIC MODELS AND ESTIMATION\nThe Hazard of Mortality\nEach organization in the population has some chance of disbanding\/\nexiting at any time during its tenure. The occurrence of such events is\ncontrolled by an instantaneous hazard. Because we lack information on\nthe length of spells of prior existence for those firms that entered auto-\nmobile production from other industries, the only feasible choice of or-\nganization-level clock, given our design, is tenure—the duration of the\nspell of automobile production. The half-life (considering all kinds of\nending events) of an automobile producer has ranged from 1.8 years in\nthe British and German populations to 2.6 years in the French.\nGiven a random variable, that records whether a firm has dis-Y(u)\nbanded or exited at tenure u (in which case ) or has notY(u)p 1\n( ), the disbanding\/exit hazard can be defined as:Y(u)p 0\n( )prob[Y(u\u0002 d)p 1FY u p0]\nm(u)p lim , u ≥ 0.\nddf0\n(If a firm exits the population by some other event [e.g., acquisition], we\ntreat the spell as [noninformatively] censored at the observed event time.)\nWe represent the effects of changes in tenure with a piecewise-expo-\nnential specification. With the breakpoints denoted as 0 ≤ t ≤ t ≤ … ≤1 2\nand , there are q periods: . Wet t p \u0003 I p {uFt ≤ u ! t }, pp 1, … , qq q\u00021 p p p\u00021\nestimate models with this general form with the method of maximum\n14 Specifically, the breakpoints for Britain are those used by Torres (1995): 1915, 1919,\n1939, 1946, and 1968. The breakpoints for France and Germany are those used by\nHannan et al. (1995): 1915, 1919, 1930, 1939, 1950, and 1970.\n15 Firms that did not resume production of automobiles after a war (often because their\nfactories were destroyed) are treated as right-censored at the end of the last prewar\nyear.\nAmerican Journal of Sociology\n1322\nlikelihood as implemented in TDA 6.2 (Ro¨hwer and Po¨tter 1998). As in\nthe prior research on these populations, we break the duration scale (in\nyears) at: 0.5, 1.0, 3.0, and 7.0. With this choice, the first segment\nincludes dated events that occur within the first six months in the(0,0.5]\nindustry as well as cases that enter and exit at unknown times within the\nsame year (as discussed above). The second segment includes dated(0.5,1]\nevents that occur within the second six months and cases that enter at\nunknown time in one year and exit at unknown time in the next year.\nThe third and fourth segments are defined similarly. The final segment\nbegins at seven years and is open on the right.16\nOur models specify that the disbanding\/exit hazard is a function of\ntenure in the industry (u), industry age (t), a vector of variables ( )siu\npertaining to size and prior experience (absolute and relative size and\ndummies for very small size and prior organizational existence [e]),\na vector of other measured covariates ( ), including GNP, depressionx t\nyear, and density at founding, a function of contemporaneous density and\ndensity-squared, as well as the interactions of these density effects and\nindustry age, denoted by J ( ). The key functions for assessing the ar-7\nguments made above relate to niche width, market position, and niche-\noverlap density, denoted by w ( ), and a function of changes in niche width7\nand various measures of position, denoted by q ( ). We estimate members7\nof the general class of models of disbanding\/exit with the form:\n′ ′( )m (u,t)p exp (m ) exp s a \u0002x p 7J(n ,t)i p iu p it t\nvo( )7w nw ,n ,pos 7q(DW,DP), u \u0001 I . (1)iu iu iu p\nHere denotes a set of duration-specific effects; the log-linear link im-mp\nposes the constraint that the baseline hazards be nonnegative.\nThis kind of specification allows the hazard of disbanding\/exiting to be\na nonproportional function of tenure, size, and prior experience as in\nHannan et al. (1998a). These specifications allow tenure dependence to\nbe negative for some size classes and positive for others. Adding effects\nof niche-related measures has hardly any impact on the effects of tenure\nand size. Therefore, the patterns summarized by Hannan et al. (1998a)\ncontinue to hold. Because this issue is not central to the present analysis,\nwe simply report the relevant estimates without commenting further.\n16 The earlier research using these data showed that the main results are fairly insen-\nsitive to these choices, presumably because so few firms experience tenures of greater\nthan seven years.\nResource Partitioning\n1323\nChanges in Position\nFor the other class of outcomes, change in niche width and market po-\nsition, we have repeated yearly observations on firms (where the number\nof observations per firm is one less than the number of years of tenure\nin the industry because we use year-to-year changes). In other words, the\ndata structure is an unbalanced panel. Although much recent organiza-\ntional research analyzes such data with fixed-effect estimators (which uses\nonly within-firm variation), we take advantage of a new class of robust\nestimators to analyze both between-firm and within-firm variation. Spe-\ncifically, we use the method of generalized estimating equations (GEE),\ndeveloped by Liang and Zeger (1986; see also Zeger and Liang 1986).\nThis approach generalizes quasi-likelihood estimation to the panel con-\ntext. Like quasi-likelihood, GEE requires specification of only the first\nand second moments of the distribution of the outcome, rather than the\nfull distribution as is required for maximum likelihood.17 Under mild\nregularity conditions, GEE estimators are consistent and asymptotically\nnormal.\nThe outcome in each firm-year is a dummy variable that equals 1 if\nthe firm changed the relevant dimension of its niche from the previous\nyear and 0 otherwise. For the ith firm, we have observations; the vectorui\nof outcomes can be written as: . The covariates vary′yp (y ,y , … , y )1 2 N\nover firms and (in some cases) over time for given firms: Xp\n, where is and the number of covariates is′(X ,X , … , X ) X (u # k)1 2 N i i\n. As in the usual framework for generalized linear models, onek\u0001 1\nchooses a distribution for and a link function to connect the outcomey\nto the covariates. In this analysis, we obtain a (generalized) logit regression\nby choosing the binomial distribution and the logit link.\nWe expect that the disturbance process will exhibit autocorrelation of\nthe usual panel type: observations for the same firm will tend to be cor-\nrelated due to permanent and gradually changing unobserved firm prop-\nerties. But, we assume that observations are uncorrelated for different\nfirms. GEE requires a specification of a “working” correlation matrix for\nthe within-organization correlation of observations. The implementation\nwe used—the XTGEE routine in version 6.0 of STATA (StataCorp\n1999)—allows a menu of choices for this matrix. We experimented with\nseveral, including the exchangeable correlation structure familiar from\nthe standard random-effects specification for panel data, as well as first-\norder and second-order serial autocorrelation. We found that there is\nnegligible autocorrelation for the French and German data. However,\n17 Barron (1992) discusses sociological applications of QL estimators (in the context of\nanalysis of counts).\nAmerican Journal of Sociology\n1324\nthere is mild positive autocorrelation in the British data. For the latter,\nthe estimates of key substantive effects were insensitive to specification\nof the working correlation matrix. Inspection of estimates suggested to us\nthat the “exchangeable” version fits well. For consistency, we used this\nspecification for all three data sets. That is, the working correlation matrix\nfor each organization’s observations has the following form:\n1 if sp t\nR(r) p .s,t {r otherwise\nFinally, we based our testing on so-called robust standard errors, using\nthe “sandwich” estimator developed by Huber (1967) and White (1982).\nRESULTS\nRates of Disbanding\/Exit\nEstimates of our basic specifications appear in table 4. Hypothesis 1 re-\nceives strong support: niche width has a negative effect on disbanding\/\nexit hazards in all three populations; the effect is statistically significant\nfor Britain and France. Hypothesis 2 also receives strong support: overlap\ndensity has a significant positive effect on the hazard in all three countries.\nAccording to these results, the worst case (from the perspective of life\nchances) is having a narrow niche that overlaps substantially with those\nof other organizations in the population. In other words, the highest haz-\nards are for specialists in a market center. This pattern accords well with\nthe central image of resource-partitioning theory.\nConsider the situation from the perspective of a specialist on the pe-\nriphery, one whose niche does not overlap with that of any other organ-\nization. Such an organization does not suffer the deleterious consequences\nof competition within its niche, nor does it reap any of the gains of a\nbroad niche. Can organizations improve their life chances by broadening\ntheir niches? The answer to this question depends upon the distribution\nof organizations in the market, on the strength of the effects of niche\nwidth and niche-overlap density, and the possibility that change per se\ncan elevate the hazard of disbanding\/exit.\nWe can explore the first part of the answer by examining figures 1 and\n2. Recall that movement away from pure specialism makes the number\nof overlaps increase sharply. So the specialists face a genuine dilemma.\nWe can get a sense of the “content” effect of change for a pure specialist\nby considering the multiplier of the hazard at different levels of specialism\nand overlap density. We continue to focus on the French population. In\ntable 4, we see that this multiplier is .exp (\u00010.06 7 W\/1,000\u0002 .005 7 NO)\nResource Partitioning\n1325\nTABLE 4\nML Estimates of Effects of Niche Width and Niche-Overlap Density on the\nDisbanding\/Exit Hazards of European Automobile Manufacturers, 1885–1981\nFrance Germany Great Britain\nTenure in the industry:\n. . . . . . . . . . . . . . . . . . . . . . . .u ! 0.5 \u00015.40 (\u00013.81) \u00016.77 (\u00015.15) \u00013.81 (\u00013.63)\n. . . . . . . . . . . . . . . . . . . .0.5 ≤ u ! 1 \u00015.35 (\u00013.77) \u00016.41 (\u00014.90) \u00013.42 (\u00013.26)\n. . . . . . . . . . . . . . . . . . . . . .1 ≤ u ! 3 \u00016.04 (\u00014.26) \u00017.05 (\u00015.38) \u00014.15 (\u00013.98)\n. . . . . . . . . . . . . . . . . . . . . .3 ≤ u ! 7 \u00017.81 (\u00015.91) \u000114.93 (\u00016.19) \u00015.51 (\u00015.47)\n. . . . . . . . . . . . . . . . . . . . . . . . . .u ≥ 7 \u00018.24 (\u00016.22) \u000115.13 (\u00016.32) \u00015.87 (\u00015.83)\nln(GDP) . . . . . . . . . . . . . . . . . . . . . . . . . 1.16 (2.39) .95 (1.28) \u0001.02 (\u0001.04)\nDepression year . . . . . . . . . . . . . . . . .62 (3.02) .80 (2.03) \u0001.12 (\u0001.41)\nPrior existence:\n. . . . . . . . . . . . . . . . . . . . . . . . . .u ! 3 \u0001.70 (\u00014.88) \u0001.83 (\u00014.74) \u0001.58 (\u00014.56)\n. . . . . . . . . . . . . . . . . . . . . . . . . .u ≥ 3 \u0001.20 (\u00011.57) \u0001.59 (\u00012.45) \u0001.25 (\u00011.83)\nln(relative size):\n. . . . . . . . . . . . . . . . . . . . . . . . . .u ! 3 \u00011.22 (\u00012.04) \u00011.63 (\u00012.99) \u0001.98 (\u00012.12)\n. . . . . . . . . . . . . . . . . . . . . . . . . .u ≥ 3 \u00011.98 (\u00013.62) \u00015.01 (\u00014.82) \u00011.49 (\u00013.54)\nln(size) . . . . . . . . . . . . . . . . . . . . . . . . . . . \u0001.04 (\u0001.87) .05 (.77) \u0001.04 (\u00011.38)\nSize ! 50 . . . . . . . . . . . . . . . . . . . . . . . . .62 (3.98) .12 (.61) .67 (4.24)\nDensity at entry . . . . . . . . . . . . . . . . .01 (1.54) .005 (.85) .001 (.63)\nEuropean density ( ):NE\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . .NE \u0001.01 (\u00012.36) \u0001.01 (\u00011.09) \u0001.01 (\u00013.07)\nind. age ( ) . . . . .\u00012N # #10E .03 (1.01) .08 (2.05) .05 (2.28)\nind. age2 ( ) . . . . .\u00013N # #10E \u0001.003 (\u0001.58) \u0001.01 (\u00011.90) \u0001 .005 (\u00011.32)\nCountry density squared :2(n )\n. . . . . . . . . . . . . . . . . . . . .2 \u00013n # 10 .22 (1.85) 3.35 (2.82) .12 (1.27)\nind. age ( ) . . . . . .2 \u00013n # #10 \u0001.003 (\u0001.42) \u0001.26 (\u00013.57) \u0001.01 (\u00011.07)\nind. age2 ( ) . . . . . .2 \u00016n # #10 \u0001.01 (\u0001.07) 4.29 (3.83) .10 (.85)\nNiche width ( ) . . . . . . .\u00013W# 10 \u0001.06 (\u00011.92) \u0001.04 (\u0001.74) \u0001.22 (\u00014.72)\nNiche-overlap density (NO) . . . .005 (3.09) .01 (3.68) .01 (7.15)\nN of spells . . . . . . . . . . . . . . . . . . . . . . 5,171 2,272 5,582\nN of events . . . . . . . . . . . . . . . . . . . . . 718 309 810\nLog likelihood . . . . . . . . . . . . . . . . . . \u00011,732.0 \u0001642.4 \u00011,860.9\nNote.—Figures in parentheses are t-statistics; u denotes tenure in the industry in years. All specifi-\ncations also contain historical period effects.\nThis multiplier is 1.0 for a pure specialist with no overlap.18 For a pure\nspecialist that is unlucky enough to find itself in the center of the market,\nNO might plausibly equal 100, giving it a multiplier of 1.65, meaning that\nits mortality hazard is 65% higher than that of the specialist in an isolated\nposition on the periphery. The multipliers for center specialists in this\nscenario are 2.7 for Germany and Britain (the multipliers for peripheral\n18 Since we added one to all niche widths, the minimum value is actually 0.001, and\nthe multiplier for such a case is 1.001.\nAmerican Journal of Sociology\n1326\nspecialists in all cases equals 1.0). Clearly specialists cannot persist in\ncrowded market centers.\nLess evident from the parameter estimates, the hazard for most gen-\neralists also exceeds the hazard for a peripheral specialist when the center\nis crowded. For instance, if a generalist experiences , then itsNOp 100\nhazard of mortality exceeds the hazard for a peripheral specialist unless\nits niche is extremely wide, greater than 8,333 cc, which is very far out\nin the tail of the distribution (table 2). The level of niche width at which\ngeneralism is superior to specialism for the same circumstances are 25,000\ncc for Germany (far outside the observed range) and 4,500 cc for Britain\n(well below the maximum but four times the mean). Suppose, in contrast,\nthat concentration among generalists has taken place, that all specialists\nhave been pushed out of the center, and that only three generalists remain\nin the center. Consider a remaining generalist with cc. SinceWp 5,000\nit overlaps with only two other firms, its multiplier is exp (\u0001.06 7 5\u0002\n, which means that its multiplier is 25% below that of an.005 7 2)p .75\nisolated specialist. These results too confirm the central intuition of re-\nsource-partitioning theory: it is reduced crowding in the center (concen-\ntration)—not simply generalism—that improves the life chances of\ngeneralists.\nWe addressed the functional form of the localized competitive effects\nof niche overlap by using a nonparametric approach, replacing the log-\nlinear effect of overlap density in table 4 with three dummy variables\nindicating overlap of 1–5, 6–50, and greater than 50 (with 0 as the excluded\ncategory). Although the results vary among the three countries, in each\ncase we find that overlap density does not raise the hazards until it reaches\na count higher than 50.\nWe test hypothesis 3 by adding an interaction of niche-overlap density\nand industry age to the models whose estimates were reported in table\n4. As predicted, the estimated interaction effect is negative (and significant)\nin all three populations in table 5. For example, in France, the effect of\nniche-overlap density, strong at the inception of the industry, has been\neliminated entirely 50 years later in the industry evolution. Competitive\ncrowding and its positive effect on the hazards tend to be more pro-\nnounced in the early stages of the industry evolution.\nNow we turn to the process effects of organizational change on mor-\ntality, net of the effects of the niche width and niche-overlap density that\nresult from the change. Table 5 reports estimates of specifications of the\neffects of niche expansion and niche contraction by 10% or more, along\nwith a “change clock,” which is reset to zero whenever a firm makes either\ntype of change. We explored the issue of nonproportionality of these ef-\nfects, and we determined that the niche-width effects vary with industry\ntenure in France but not in Germany and Britain. Overall, we find that\nResource Partitioning\n1327\nTABLE 5\nML Estimates of the Effects of Niche Width, Overlap Density, and Position\nChange on the Disbanding\/Exit Hazards of European Automobile\nManufacturers, 1885–1981\nFrance Germany Great Britain\nNiche width ( ) . . . . . . . . . . . .\u00013W# 10 \u0001.06 (\u00012.01) \u0001.08 (\u00011.35) \u0001.21 (\u00014.54)\nNiche-overlap density (NO) . . . . . . . . .01 (2.91) .06 (3.21) .01 (4.38)\nNiche-overlap density # industry\nage ( ) . . . . . . . . . . . . . . . . . . . . . . . .\u00012#10 \u0001.02 (\u00012.02) \u0001.12 (\u00012.53) \u0001.02 (\u00011.95)\nChange in niche width expansion:\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .u ! 3 .33 (1.67) .53 (2.86) .03 (1.33)\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .u ≥ 3 .22 (1.20) .53 .03*\nContraction:\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .u ! 3 .50 (2.33) \u0001.03 (\u0001.11) .09 (.61)\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .u ≥ 3 \u0001.27 (1.20) \u0001.03* .09*\nChange clock (niche width) . . . . . . . . .03 (1.61) .03 (.75) .03 (1.33)\nLog likelihood . . . . . . . . . . . . . . . . . . . . . . . \u00011,724.6 \u0001635.5 \u00011,857.8\nLR test vs. model in table 4 (df) . . . 14.8 (6) 13.8 (4) 6.2 (4)\nNote.—Figures in parentheses are t-statistics; u denotes tenure in the industry. All specifications also\ncontain all covariates in table 4.\n* Indicates that a coefficient is constrained to equal the one immediately above.\nthe process effects of change are positive, that is, change increases the\nhazard of disbanding\/exit, whenever the effect is statistically significant.\nMoreover, expansion appears to be more hazardous than contraction.\nExpansion elevates the hazard in all three countries, although the effect\nis not significant in Britain. In addition, the effect is nonproportionate in\nFrance: the effect is smaller after an organization’s tenure in the industry\nexceeds three years. The effect of niche contraction is positive and sig-\nnificant only for French firms with an industry tenure of less than three\nyears (such change increases their hazards by 65% according to this result).\nThe contraction effects are not significant in the German and British\npopulations.\nThe coefficient of the change clock tells how the hazard changes with\nthe time elapsed since the organization’s most recent change. Generally\nresearch that uses specifications like ours finds that the deleterious effects\nof change erode over time. This pattern is usually termed negative du-\nration dependence. This is not the case in the populations we study. In\ncontrast, we find positive (but not significant) duration dependence in\neach case.\nTable 6 reports estimates of an alternative representation of the effects\nof change, looking at change in market position. These specifications,\nwhich include effects of measures of market position and change in market\nAmerican Journal of Sociology\n1328\nTABLE 6\nML Estimates of an Alternative Specification of the Effects of Niche\nWidth, Overlap Density, and Position Change on the Disbanding\/Exit\nHazards of European Automobile Manufacturers, 1885–1981\nFrance Germany Great Britain\nNiche width ( ) . . . . . . . . . . . . . .\u00013W# 10 .004 (.10) .01 (.14) \u0001.17 (\u00013.14)\nNiche-overlap density (NO) . . . . . . . . . . .01 (2.50) .06 (2.91) .01 (3.67)\nNiche-overlap density # industry\nage (# ) . . . . . . . . . . . . . . . . . . . . . . . .\u0001210 \u0001.03 (\u00012.23) \u0001.12 (\u00012.38) \u0001.03 (\u00012.53)\nChange in niche width:\nExpansion . . . . . . . . . . . . . . . . . . . . . . . . . . . \u0001.07 (\u0001.38) .29 (1.23) \u0001.32 (\u00012.23)\nContraction . . . . . . . . . . . . . . . . . . . . . . . . . . \u0001.17 (\u0001.81) \u0001.30 (\u0001.88) \u0001.30 (\u00011.84)\nChange clock (niche width) . . . . . . . . .06 (.97) \u0001.02 (\u0001.28) \u0001.002 (\u0001.05)\nPosition:\nDistance above market center\n(# ) . . . . . . . . . . . . . . . . . . . . . . . . . . .\u0001210 \u0001.04 (\u00012.58) \u0001.02 (\u0001.96) \u0001.01 (\u00011.76)\nDistance below market center\n(# ) . . . . . . . . . . . . . . . . . . . . . . . . . . .\u0001210 \u0001.004 (\u0001.77) \u0001.01 (\u00011.27) .001 (.20)\nChange in relative position (DP#\n) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\u0001210 \u0001.01 (\u00011.19) \u0001.04 (\u00012.10) .001 (.22)\nAny change in absolute position\n( ) . . . . . . . . . . . . . . . . . . . . . . . . . . . .aDP p 1\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .u ! 3 .65 (4.31) .43 (2.21) .95 (7.66)\n. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .u ≥ 3 .32 (1.73) .43* .34 (2.11)\nChange clock (absolute change) . . . \u0001.03 (\u0001.53) .06 (.68) .04 (.65)\nLog likelihood . . . . . . . . . . . . . . . . . . . . . . . . . \u00011,711.1 \u0001627.9 \u00011,824.9\nLR test vs. model in table 4 (df) . . . . . 41.8 (10) 29.0 (9) 72.0 (10)\nNote.—Figures in parentheses are t-statistics; u denotes tenure in the industry. All specifications also\ncontain all covariates in table 4.\n* Indicates that a coefficient is constrained to equal the one immediately above.\nposition, also separate the effects of process and content change.19 It ap-\npears that in the European automobile industries, being a “high end”\nproducer has been a beneficial position. The coefficient capturing distance\nof a firm’s niche center above the market center has a negative effect on\nthe hazard; the effect is significant for the French and British populations.\nIn France, for example, a company whose production centers around a\nmodel that is more powerful than the most sought after generalist model\nby 1,000 cc reduces its hazard of disbanding\/exit by about a third.\nThe effect of relative position change—change that does not necessarily\ninvolve organization-level transformation—is significant only in Germany,\nwhere the estimated effect implies that the hazard drops by about 30%\nif a firm repositions its niche center by 1,000 cc (i.e., whenever a firm’s\n19 To further investigate the effect of change in relative position, we allowed the effect\nto differ by direction (i.e., toward vs. away from the market center), but this distinction\nwas not justified by the results.\nResource Partitioning\n1329\n“average” car becomes more similar or dissimilar to the “average” gen-\neralist car by an engine capacity difference of 1,000 cc). So, it appears\nthat, while in France and Britain being a high-end specialist confers an\nadvantage, the real benefit in Germany came from constant exploration,\neven if it was incidental.\nParadoxically, as the next set of results indicate, exploration generally\ncomes at a very high cost and proves beneficial for life chances only as\nlong as it is incidental. The estimates for the effect of absolute change\n(change that, regardless of its direction, involves repositioning by the focal\nfirm) are positive and highly significant in all three countries. In France\nand Britain, these effects are also nonproportionate; they are much\nstronger for firms with less than three years of tenure in the auto industry.\nIn Britain, such firms are 2.6 times more likely to fail, and they are 1.9\ntimes more likely to fail in France. Once their industry tenure surpasses\nthree years, those disadvantages decline to a level at which they increase\nthe hazard by about 40% in both countries. In Germany, the absolute\nchange effects increase the hazard by roughly one half, irrespective of\ntenure. In France and Britain, where the absolute change effects hinge\non tenure, the initial hump in mortality disappears to reveal monotonic\nnegative tenure dependence. Overall, the results in tables 5 and 6 provide\nstrong support for hypotheses 4 and 5.\nSummarizing the main results presented so far, we note two sets of\neffects that stand out as robust and consistent across the three populations\nof automakers. Both competitive crowding and organizational change (its\nprocess dimension, in particular) significantly elevate mortality hazards.\nEarlier we also argued that a possible second-order (indirect) effect of\ncompetitive crowding might heighten mortality hazards by increasing the\npropensity of firms to initiate change. To test this proposition, we now\nconsider estimates of models of the rates of change in niche-width and\n(absolute) market-position.\nChange in the Niche\nWe report results for change in the center of the niche in table 7, which\nreports GEE results for the panel data on change. Overlap density has\na positive effect on the propensity to change. The effects are highly sig-\nnificant for France and Britain but not Germany. The effects in the French\nand British populations are strong in substantive terms as well. For in-\nstance, a French firm’s log-odds of absolute position change is 112%\nhigher when it overlaps with 75 firms as contrasted to the situation in\nwhich it has no overlaps. In Germany, the log-odds of change at NOp\nis 35% higher than with no overlaps. So, in accord with hypothesis 6,75\nwe find evidence that competitive intensity not only increases mortality\nAmerican Journal of Sociology\n1330\nTABLE 7\nGEE Estimates of Pooled Logit Regression Models of (Any) Change in\nAbsolute Position by European Automobile Manufacturers, 1885–1981\nFrance Germany Great Britain\nConstant . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u00012.97 (\u00011.36) \u00011.07 (\u00011.64) .24 (.51)\nTenure in the industry . . . . . . . . . . . . . . . . \u0001.01 (\u0001.86) .01 (.45) .09 (6.41)\nDepression year . . . . . . . . . . . . . . . . . . . . . . . . .71 (.57) .28 (.85) \u0001.25 (\u00011.13)\nln (GDP) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . \u0001.62 (\u00011.41) \u0001.25 (\u0001.46) .46 (1.40)\nPrior existence . . . . . . . . . . . . . . . . . . . . . . . . . \u0001.24 (\u00011.21) \u0001.37 (\u00012.28) .04 (.35)\nln (relative size) . . . . . . . . . . . . . . . . . . . . . . . . \u0001.31 (\u0001.51) \u0001.09 (\u0001.52) .49 (2.68)\nln (size) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .05 (.50) \u0001.07 (\u0001.81) .0002 (.006)\nSize ! 50 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .28 (1.27) \u0001.04 (\u0001.16) \u0001.29 (\u00012.15)\n% niche width ( ) . . . . . . . . . . . .\u00013W# 10 .02 (.23) .11 (1.56) \u0001.08 (\u00011.50)\n% niche-overlap density (NO) . . . . . . . . .01 (4.12) .01 (1.21) .004 (3.09)\nN of prior changes in niche width . . . \u0001.75 (\u00013.81) \u0001.93 (\u00012.50) \u0001.39 (\u00015.94)\nDistance above market center\n( ) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\u00012#10 .12 (1.14) \u0001.05 (\u00012.51) \u0001.02 (\u00013.20)\nDistance below market center\n( ) . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\u00012#10 .01 (1.13) .01 (2.05) \u0001.002 (\u0001.94)\nN of prior changes in absolute posi-\ntion (NPC) . . . . . . . . . . . . . . . . . . . . . . . . . . . 1.74 (6.01) 1.37 (3.26) .29 (6.70)\nNPC # tenure . . . . . . . . . . . . . . . . . . . . . . . . . \u0001.04 (\u00013.71) \u0001.01 (\u00014.32) \u0001.003 (\u00014.76)\nNPC # niche width . . . . . . . . . . . . . . . . . . \u0001.06 (\u00011.13) \u0001.05 (\u00012.19) .02 (2.19)\nN of observations . . . . . . . . . . . . . . . . . . . . . . 5,171 2,272 5,582\nN of firms . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 819 373 987\nWald x2 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 309.90 105.45 223.09\nNote.—Figures in parentheses are t-statistics; all specifications also contain historical period effects.\nScale parameter p 1; df p 18.\ndirectly, but it also does so indirectly by increasing the rate of organi-\nzational change in two of three populations studied.\nOur hypotheses concerning learning and inertia hold that greater cu-\nmulative absolute-position change will trigger subsequent changes in ab-\nsolute position but will deter change in niche width. Support for the first\npart of this proposition is strong; the estimates in table 7 show that ex-\nperience with the same change has a strong positive effect on the pro-\npensity to change further. Additionally, consistent with earlier studies\nexamining rates of organizational change (Amburgey et al. 1993; Minkoff\n1999), we find that the momentum of change declines with industry tenure.\nWe also find support for the proposition that experience with one type\nof change deters the occurrence of another type of change. Cumulative\nniche-width change has a significant negative effect on the rate of position\nchange in all three countries.\nOur final hypothesis predicts that the effect of previous changes on the\nlikelihood of repeating the same type of change declines with niche width\n(regarded as a measure of complexity). The estimated effects of the product\nResource Partitioning\n1331\nof niche width and number of prior changes in position on the propensity\nto change position are negative, as predicted, for only two of the three\npopulations, and the effect is only significant for the German population.\nEffects of Other Covariates\nTo this point, we have focused on the effects that bear directly on our\narguments. However, we embedded these effects in a model that specifies\neffects of size, industry tenure, density, and several environmental cov-\nariates. Several of these effects deserve note. First, adding the effects of\nniche width and niche-overlap density do not change the pattern found\nearlier without these effects (Hannan et al. 1998a). The hazards of dis-\nbanding\/exit decline with relative size and increase with industry tenure,\nand the effect of each depends upon the level of the other (the effects are\nnonproportional). In particular, there is positive age dependence for small\nfirms and negative age dependence for large ones.\nOne set of findings, concerning the dynamic multilevel specification of\ndensity dependence, is new. The theory of multilevel density dependence\nholds that different levels of population density drive legitimation and\ncompetition. Modified to account for the nonsymmetric effect of popu-\nlation density at different stages of the industry evolution (Hannan 1997),\nthe model, in the form specified here, posits that the baseline density effects\n(low counts increasing survival through legitimation and high counts in-\ncreasing mortality through competition) reverse direction as an industry\nstructure evolves and solidifies. But resurgence in density in the late cycle\nof industry evolution again reverses the direction of effects to the original\npattern. This account is consistent with the resource-partitioning story\nexplaining the late surge in population density with the proliferation of\nspecialists on the market periphery.\nThis model has previously been estimated for founding rates but has\nnot, to our knowledge, been applied to mortality rates. The results in table\n4 offer strong support for the predictions of the theory. Looking at the\nmain effects of density, we see that Europe-wide density has a negative\neffect on mortality rates and (the square of) country density has a positive\neffect. These results agree with the view that legitimation processes flow\nmore easily over national borders than do competitive processes. Looking\nat the interactions of these effects with industry age, we see that, with\nthe exception of the interaction between the squared terms of industry\nage and country density in France, the legitimation and competition effects\nhave the predicted directions for all three countries.\nAmerican Journal of Sociology\n1332\nDISCUSSION\nThe findings of this research expand our knowledge of the processes\ninvestigated by three well-developed and empirically tested theory frag-\nments: density dependence, resource partitioning, and structural inertia.\nOur results help to establish conceptual links that integrate these theory\nfragments into a coherent research stream similar to the Mertonian type\nof theory of the middle range, thus further consolidating the broad knowl-\nedge base accumulated within the ecological framework of organizational\nanalysis.\nOur contribution to density dependence here lies in elaborating the\nmultilevel form of the model. Similar to models of locally partitioned\ndensity-dependence, we describe a process that could be termed “niche-\nlocalized” density dependence.\nAt the core of our argument lies the assumption that a process of\nconstitutive diffusion of a new product resembles the legitimation of a\nnew organizational form. A single organization can rarely carry out the\ninstitutionalization of a new line of products or services. That many com-\npanies are willing to invest in and pursue an emerging market domain\nprovides a sign that inspires trust and confidence in potential customers\nand partners alike. The presence of more than one actor in a market\nsegment also reflects positively on the status of early entrants.\nClearly, the transition from monopoly to duopoly poses constraints on\naccess to resources and introduces a competitive relationship. But, at low\nlevels of niche-overlap density, the disadvantages posed by the entry of\ncompetitors is minimized; indeed our results suggest that they are neu-\ntralized, by the subsequent entrants’ contribution to affirming the identity\nof the new product. Growth in local density also aids in defining, ex-\npanding, and fortifying the boundaries around the evolving market niche.\nThis line of reasoning agrees with the implication of the resource-parti-\ntioning model that the flattening of the resource distribution over time\nresults from the entry of specialists whose arrival promotes the consoli-\ndation of new market niches and changes consumer tastes.\nWe find that there is a threshold level in niche-overlap density, above\nwhich niche crowding heightens mortality. Virtually all ecological studies\nthat have analyzed the distribution of population density over time report\na similar pattern: density increases, slowly at first, and then at a higher\nrate until it reaches a peak followed by a decline. This decline in the\nnumber of organizations can be explained (at least partly) by the higher\nexit rate of existing firms that fail in the competitive process once the\nlimits of the population’s carrying capacity are reached.\nWe find that this effect might also be indirect. Our findings suggest\nthat competitive crowding propels organizations to change their niche\nResource Partitioning\n1333\nwidths and positions. When this happens, organizations can change their\nstrategies to those that seek to find a viable position outside of the market\ncenter, a process that leads to resource partitioning. But, change in range\nof product offerings and in location proves to have vital consequences.\nOrganizations that attempt such change suffer increased exposure to en-\nvironmental selection. So, it appears that density dependence breeds re-\nsource partitioning; that is, competitive crowding also has an indirect\neffect on mortality by decreasing the survival chances of organizations\nexploring less competitive market segments, a process that gives rise to\nthe formation of peripheral niches with thinner but untapped resources.\nThe resource-partitioning model predicts that market segmentation and\nrising concentration improve the survival chances of specialists, but this\nmodel does not specify how specialists come to proliferate outside the\nmarket center. Our findings, however, imply that the survival advantages\nassociated with location on the periphery might hold only for new market\nentrants, because the deleterious effects of changes in niche width and\nposition might offset those advantages. This is especially true in light of\nour finding that the hazard of failure due to niche width and position\nchange does not diminish with time. So it seems that the specialist ad-\nvantage comes at the cost of becoming a specialist—a finding that un-\nderscores the importance of separating the effects of content and process\nchange when studying organizational transformation.\nOrganizational change is precarious partly because of the difficulty of\nforeseeing the amount of related subsequent structural transformations\nthat will be induced by an initial change (Barnett and Carroll 1995). Until\nall such changes are completed, the organization is unfit to operate at its\nprevious levels of accountability and reliability. In other words, a “re-\ncovery” period follows nontrivial transformation attempts. During this\nperiod, the process consequences of organizational change are hard felt.\nIn this research, we found no evidence that an actual recovery from the\nnegative impact of process change is certain to occur. On the contrary, it\nappears that once structural inertia triggers liability to selection, this effect\nis continuously perpetuated and amplified with time.\nWe believe that our approach to defining organizational strategy along\nthe generalist—specialist dimension by using technological niches of or-\nganizations can be explored and refined in future research on resource\npartitioning. Variance in organizational niches can be used to complement\nmeasures of size and product characteristics (e.g., content coverage in\nnewspapers), frequently used to capture this distinction in previous anal-\nyses. The effects of industry concentration, for example, can be tested on\nthe subset of narrow-niche organizations, or those located outside the\nmarket center. Similarly, the proposed scale-based selection mechanism\nthat accounts for consolidation among generalist organizations (Carroll\nAmerican Journal of Sociology\n1334\nand Swaminathan 2000; Dobrev and Carroll 2000) can be applied to\norganizations with wide niches. Overall, the use of the niche construct\ncan be useful in explicating the intricacies in the relationship between\norganizational size, strategy, and resource partitioning (Dobrev, Kim, and\nCarroll 2001).\nThe research presented here points to the variety of ways in which the\nniche construct could be exploited in other research fields. Our findings\nabout the negative relationship between niche change and organizational\nsurvival, for example, can be extended to the sociological investigation\nof collective action in an interesting way. For instance, Olzak and Uhrig\n(1999) suggest that it is helpful to think about the niche of a social move-\nment in terms of its tactical repertoire and routines for organizing, which\neventually become embedded in the movement’s identity. Relying on the\ncontent\/process distinction, one can test if the “fade-away” of social move-\nments occurs when a movement attempts to broaden or diversify its tac-\ntical array. Even though new tactics might become more appealing to\nmembers, more socially acceptable, and thus more effective than old ones,\nthe transition to different routines and tactics itself might imply that the\nmovement’s identity has been lost, that it has been debauched, coopted,\nor defeated. More broadly, much sociological analysis rests on assumptions\nabout embeddedness and structure. Defining and measuring the niche\nalong dimensions and attributes of individual and collective social actors\ncould yield the conceptual utility and the research versatility needed to\ninvestigate the dynamic relationship of persons and organizations to their\npositions in the social structure.\nREFERENCES\nAmburgey, Terry L., Dawn Kelly, and William P. Barnett. 1993. “Resetting the Clock:\nThe Dynamics of Organizational Change and Failure.” Administrative Science\nQuarterly 38:51–73.\nArgyris, Chris. 1999. On Organizational Learning. Cambridge: Blackwell.\nBaldwin, Nick, G. N. Georgano, Michael Sedgwick, and Brian Laban. 1987. The World\nGuide to Automobile Manufacturers. New York: Facts on File Publications.\nBarnett, William P. 1994. “The Liability of Collective Action: Growth and Change\namong Early Telephone Companies.” Pp. 337–54 in Evolutionary Dynamics of\nOrganizations, edited by J. Baum and J. Singh. New York: Oxford University Press.\nBarnett, William P., and Glenn R. Carroll. 1987. “Competition and Mutualism among\nEarly Telephone Companies.” Administrative Science Quarterly 30:400–421.\n———. 1995. “Modeling Internal Organizational Change.” Annual Review of Sociology\n21:217–36.\nBarnett, William P., and Morten Hansen. 1996. “The Red Queen in Organizational\nEvolution.” Strategic Management Journal 17:139–57.\nBarron, David N. 1992. “The Analysis of Count Data: Overdispersion and\nAutocorrelation.” Pp. 179–220 in Sociological Methodology, vol. 22. Edited by Peter\nV. Marsden. Oxford: Basil Blackwell.\nBarron, David N., Elizabeth West, and Michael T. Hannan. 1994. “A Time to Grow\nResource Partitioning\n1335\nand a Time to Die: Growth and Mortality of Credit Unions in New York, 1914–1990.”\nAmerican Journal of Sociology 100:381–421.\nBaum, Joel A. C., and Jitendra V. Singh. 1994. “Organizational Niches and the\nDynamics of Organizational Mortality.” American Journal of Sociology 100:346–80.\nBoone, Christophe, Vera Bro¨cheler, and Glenn R. Carroll. 2000. “Custom Service:\nApplications and Tests of Resource Partitioning Theory among Dutch Auditing\nFirms from 1896 to 1992.” Organization Studies 21:355–81.\nBresnahan, Timothy F., and Peter C. Reiss. 1991. “Entry and Competition in\nConcentrated Markets.” Journal of Political Economy 99:977–1009.\nBurt, Ronald S. 1993. Structural Holes: The Social Structure of Competition.\nCambridge, Mass.: Harvard University Press.\nCarroll, Glenn R. 1984. “The Specialist Strategy.” California Management Review 26:\n126–37.\n———. 1985. “Concentration and Specialization: Dynamics of Niche Width in\nPopulations of Organizations.” American Journal of Sociology 90:1262–83.\nCarroll, Glenn R., and Michael T. Hannan. 2000. The Demography of Corporations\nand Industries. Princeton, N.J.: Princeton University Press.\nCarroll, Glenn R., and Anand Swaminathan. 2000. “Why the Micro Brewery\nMovement? Organizational Dynamics of Resource Partitioning in the American\nBrewing Industry after Prohibition.” American Journal of Sociology 106:712–62.\nChandler, Alfred D. 1962. Strategy and Structure. Cambridge, Mass.: MIT Press.\nDobrev, Stanislav D. 1999. “The Dynamics of the Bulgarian Newspaper Industry in\na Period of Transition: Organizational Adaptation, Structural Inertia, and Political\nChange.” Industrial and Corporate Change 8:573–605.\n———. 2000. “Decreasing Concentration and Reversibility of the Resource Partitioning\nModel: Supply Shortages and Deregulation in the Bulgarian Newspaper Industry,\n1987–1992.” Organization Studies 21:383–404.\n———. 2001. “Revisiting Organizational Legitimation: Cognitive Diffusion and\nSociopolitical Factors in the Evolution of Bulgarian Newspaper Enterprises,\n1846–1992.” Organization Studies, in press.\nDobrev, Stanislav D., and William P. Barnett. 2001. “Organizational Roles and\nTransitions in Entrepreneurship.” Working paper. University of Chicago, Graduate\nSchool of Business.\nDobrev, Stanislav D., and Glenn R. Carroll. 2000. “Size (and Competition) among\nOrganizations: Modeling Scale-Based Selection among Automobile Producers in\nFour Major Countries, 1885–1981.” Presented at the Academy of Management\nMeeting in Toronto, August.\nDobrev, Stanislav D., Tai-Young Kim, and Glenn R. Carroll. 2001. “The Evolution of\nOrganizational Niches: U.S. Automobile Manufacturers, 1885–1981.” Paper\npresented at the Stanford Conference on Organizational Strategy, March.\nFreeman, John, and Michael T. Hannan. 1983. “Niche Width and the Dynamics of\nOrganizational Populations.” American Journal of Sociology 88:1116–45.\nGeorgano, G. N., ed. 1982. The New Encyclopedia of Motorcars: 1885 to the Present,\n3d ed. New York: E. P. Dutton.\nHan, Joon. 1998. The Evolution of the Japanese Banking Industry: An Ecological\nAnalysis, 1873–1945. Ph.D. dissertation. Stanford University, Department of\nSociology.\nHannan, Michael T. 1997 “Inertia, Density, and the Structure of Organizational\nPopulations: Entries in European Automobile Industries, 1886–1991.” Organization\nStudies 18:193–228.\nHannan, Michael T., and Glenn R. Carroll. 1992. Dynamics of Organizational\nPopulations: Density, Legitimation, and Competition. New York: Oxford University\nPress.\nHannan, Michael T., Glenn R. Carroll, Stanislav D. Dobrev, and Joon Han. 1998a.\nAmerican Journal of Sociology\n1336\n“Organizational Mortality in European and American Automobile Industries, Part\nI: Revisiting the Effects of Age and Size.” European Sociological Review 14:279–302.\nHannan, Michael T., Glenn R. Carroll, Stanislav D. Dobrev, Joon Han, and John C.\nTorres. 1998b. “Organizational Mortality in European and American Automobile\nIndustries, Part II: Coupled Clocks.” European Sociological Review 14:302–13.\nHannan, Michael T., Glenn R. Carroll, Elizabeth A. Dundon, and John C. Torres.\n1995. “Organizational Evolution in Multinational Context: Entries of Automobile\nManufacturers in Belgium, Britain, France, Germany, and Italy.” American\nSociological Review 60:509–28.\nHannan, Michael T., and John Freeman. 1977. “The Population Ecology of\nOrganizations.” American Journal of Sociology 82:929–64.\n———. 1984. “Structural Inertia and Organizational Change.” American Sociological\nReview 49:149–64.\n———. 1989. Organizational Ecology. Cambridge, Mass.: Harvard University Press.\nHuber, Peter J. 1967. “The Behavior of Maximum Likelihood Estimates Under Non-\nStandard Conditions.” Pp. 221–33 in Proceedings of the Fifth Berkeley Symposium\nin Mathematical Statistics and Probability, edited by Lucien M. Le Cam and Jerzy\nNeyman. Berkeley: University of California Press.\nHutchinson, G. Evelyn. 1957. “Concluding Remarks.” Cold Spring Harbor Symposium\non Quantitative Biology 22:415–27.\nKim, Tai-Young. 1998. “Mutualism, Competition and an Organization’s Position: Film\nProduction Companies in Britain, 1895–1960.” Presented at the Sunbelt Social\nNetwork Conference in Barcelona, June.\n———. 2000. “Niche Dynamics and Market Segregation.” Ph.D. dissertation. Stanford\nUniversity, Department of Sociology.\nLiang, Kung-Yee, and Scott L. Zeger. 1986. “Longitudinal Analysis Using Generalized\nLinear Models.” Biometrika 73:13–22.\nMaddison, Angus. 1991. Dynamic Forces in Capitalist Development. New York: Oxford\nUniversity Press.\nMarch, James G. 1988. Decisions and Organizations. New York: Blackwell.\n———. 1991. “Exploration and Exploitation in Organizational Learning.”\nOrganization Science 2:71–87.\nMcPherson, J. Miller. 1983. “An Ecology of Affiliation.” American Sociological Review\n48:519–35.\nMcPherson, J. Miller, Pamela Popielarz, and Sonja Drobnicˇ. 1992. “Social Networks\nand Organizational Dynamics.” American Sociological Review 57:153–70.\nMiner, Anne S., Terry L. Amburgey, and Timothy M. Stearns. 1990.\n“Interorganizational Linkages and Population Dynamics: Buffering and\nTransformation Shields.” Administrative Science Quarterly 35:689–713.\nMinkoff, Debra C. 1999. “Bending with the Wind: Change and Adaptation for\nWomen’s and Racial Minority Organizations.” American Journal of Sociology 104:\n1666–703.\nOlzak, Susan, and S. C. Noah Uhrig. 1999. “The Ecology of Protest Tactics.” Presented\nat the Conference on Protest-Event Analysis in Berlin, July.\nPaine, Frank T., and Carl R. Anderson. 1983. Strategic Management. Chicago: Dryden\nPress.\nPe´li, Ga´bor. 1997. “The Niche Hikers Guide to Population Ecology: A Reconstruction\nof Niche Theory Using Logic.” Pp. 1–46 in Sociological Methodology 1997, edited\nby A. E. Raftery. Cambridge: Blackwell.\nPe´li, Ga´bor, and Bart Nooteboom. 1999. “Market Partitioning and the Geometry of\nResource Space.” American Journal of Sociology 104:1132–53.\nPe´li, Ga´bor, La´szlo´ Po´los, and Michael T. Hannan. 2000. “Back to Inertia: Implications\nof Alternative Styles of Formalization.” Sociological Theory 18:193–213.\nPetersen, T. 1991. “Time-Aggregation Bias in Continuous-Time Hazard-Rate Models.”\nResource Partitioning\n1337\nPp. 263–90 in Sociological Methodology, vol. 2. Edited by Peter V. Marsden. Oxford:\nBasil Blackwell.\nPodolny, Joel M., Toby E. Stuart, and Michael T. Hannan. 1996. “Networks,\nKnowledge, and Niches: Competition in the Worldwide Semiconductor Industry,\n1984–1991.” American Journal of Sociology 102:659–89.\nRohwer, Go¨tz, and Ulrich Po¨tter. 1998. Transition Data Analysis 6.2: Users’ Manual.\nRuhr Universita¨t Bochum. (Available at http:\/\/www.ruhr-uni-bochum.de\/sowi).\nSingh, Jitendra V., Robert J. House, and David J. Tucker. 1986. “Organizational Change\nand Organizational Mortality.” Administrative Science Quarterly 31:587–611.\nStataCorp. 1999. Stata Statistical Software: Release 6.0. College Station, Tx.: Stata\nCorporation.\nSteiner, George A. 1964. “Why and How to Diversity.” California Management Review\n4:11–17.\nSwaminathan, Anand, and Glenn R. Carroll. 1995. “Beer Brewers.” In Organizations\nin Industry: Strategy, Structure, and Selection, edited by Glenn R. Carroll and\nMichael T. Hannan. New York: Oxford University Press.\nTorres, John C. 1995. The Dynamics of the U.K. Motor Industry, 1894–1990. Ph.D.\ndissertation. Stanford University, Department of Sociology.\nWhite, Halbert. 1982. “Maximum Likelihood Estimation of Misspecified Models.”\nEconometrica 50:1–25.\nZeger, Scott L., and Kung-Yee Liang. 1986. “Longitudinal Data Analysis for Discrete\nand Continuous Outcomes.” Biometrics 42:121–30.\n"}