{"doi":"10.1029\/2007JA012264","coreId":"71093","oai":"oai:eprints.lancs.ac.uk:6715","identifiers":["oai:eprints.lancs.ac.uk:6715","10.1029\/2007JA012264"],"title":"Temporal evolution of pump beam self-focusing at the High-Frequency Active Auroral Research Program","authors":["Kosch, Mike J.","Pedersen, T.","Mishin, E.","Starks, M.","Gerken-Kendall, E.","Sentman, D.","Oyama, S.","Watkins, B."],"enrichments":{"references":[{"id":16385063,"title":"A large-scale ionospheric depletion by intense radio waves heating,","authors":[],"date":"1988","doi":"10.1029\/gl015i013p01531","raw":"Wright, J. W., H. Kopka, and P. Stubbe (1988), A large-scale ionospheric depletion by intense radio waves heating, Geophys. Res. Lett., 15, 1531– 1533. E. Gerken-Kendall, SRI International, Menlo Park, CA 94025, USA. M. J. Kosch, Department of Communication Systems, Lancaster University, Lancaster LA1 4WA, UK. (m.kosch@lancaster.ac.uk) E. Mishin, Institute for Scientific Research, Boston College, Chestnut Hill, MA 02167, USA. S. Oyama, D. Sentman, and B. Watkins, Geophysical Institute, University of Alaska, Fairbanks, AK 99775, USA. T. Pedersen and M. Starks, Space Vehicles Directorate, Air Force Research Laboratory, Hanscom Air Force Base, MA 01731, USA. A08304 KOSCH ET AL.: PUMP BEAM SELF-FOCUSING 9o f9 A08304","cites":null},{"id":16384950,"title":"Airglow enhancements associated with plasma cavities formed during ionospheric heating experiments,","authors":[],"date":"1989","doi":"10.1029\/ja094ia07p09071","raw":"Bernhardt, P. A., C. A. Tepley, and L. M. Duncan (1989), Airglow enhancements associated with plasma cavities formed during ionospheric heating experiments, J. Geophys. Res., 94, 9071–9092.","cites":null},{"id":16384989,"title":"Amplification of ionospheric heating and triggering of ‘‘spread F’’ by natural irregularities,","authors":[],"date":"1970","doi":"10.1029\/ja075i031p06436","raw":"Georges, T. M. (1970), Amplification of ionospheric heating and triggering of ‘‘spread F’’ by natural irregularities, J. Geophys. Res., 75, 6436–6438.","cites":null},{"id":16385016,"title":"Artificial optical emissions at HAARP for pump frequencies near the third and second gyroharmonic,","authors":[],"date":"2005","doi":"10.5194\/angeo-23-1585-2005","raw":"Kosch, M. J., T. Pedersen, J. Hughes, R. Marshall, E. Gerken, A. Senior, D. Sentman, M. McCarrick, and F. Djuth (2005), Artificial optical emissions at HAARP for pump frequencies near the third and second gyroharmonic, Ann. Geophys., 23, 1585–1592.","cites":null},{"id":16385018,"title":"Coordinated optical and radar observations of ionospheric pumping for a frequency pass through the second electron gyro-harmonic at HAARP,","authors":[],"date":"2007","doi":"10.1029\/2006ja012146","raw":"Kosch, M. J., T. Pedersen, E. Mishin, S.-I. Oyama, J. Hughes, A. Senior, B. Watkins, and B. Bristow (2007), Coordinated optical and radar observations of ionospheric pumping for a frequency pass through the second electron gyro-harmonic at HAARP, J. Geophys. Res., 112, A06325, doi:10.1029\/2006JA012146.","cites":null},{"id":16385005,"title":"Density depletions at the 10-m scale induced by the Arecibo heater,","authors":[],"date":"1995","doi":"10.1029\/95ja00063","raw":"Kelley, M. C., T. L. Arce, J. Salowey, M. Sulzer, W. T. Armstrong, M. Carter, and L. Duncan (1995), Density depletions at the 10-m scale induced by the Arecibo heater, J. Geophys. Res., 100, 17,367–17,376.","cites":null},{"id":16384938,"title":"Evolution of subkilometer scale ionospheric irregularities generated by high-power HF waves,","authors":[],"date":"1997","doi":"10.1029\/96ja03340","raw":"Basu, S., E. Costa, R. C. Livingston, K. M. Groves, H. C. Carlson, P. K. Chaturvedi, and P. Stubbe (1997), Evolution of subkilometer scale ionospheric irregularities generated by high-power HF waves, J. Geophys. Res., 102, 7469–7475.","cites":null},{"id":16385051,"title":"Experimental results from the HERO project: In situ measurements of ionospheric modifications using sounding rockets,","authors":[],"date":"1985","doi":"10.1029\/ja090ia03p02851","raw":"Rose, G., B. Grandal, E. Neske, W. Ott, K. Spenner, J. Holtet, K. Maseide, and J. Trøim (1985), Experimental results from the HERO project: In situ measurements of ionospheric modifications using sounding rockets, J. Geophys. Res., 90, 2851–2860.","cites":null},{"id":16384985,"title":"Fejer","authors":[],"date":"1983","doi":"10.1029\/ja088ia03p02093","raw":"Farley, D. T., C. LaHoz, and B. G. Fejer (1983), Studies of the self-focussing instability at Arecibo, J. Geophys. Res., 88, 2093–2102.","cites":null},{"id":16385048,"title":"First EISCAT observations of the modification of F-region electron temperatures during RF heating at harmonics of the electron gyro frequency,","authors":[],"date":"1996","doi":"10.1016\/0021-9169(95)00043-7","raw":"Robinson, T. R., F. Honary, A. J. Stocker, T. B. Jones, and P. Stubbe (1996), First EISCAT observations of the modification of F-region electron temperatures during RF heating at harmonics of the electron gyro frequency, J. Atmos. Terr. Phys., 58, 385–395.","cites":null},{"id":16385038,"title":"First observations of HF heaterproduced airglow at the High Frequency Active Auroral Research Program facility: Thermal excitation and spatial structuring,","authors":[],"date":"2001","doi":"10.1029\/2000rs002399","raw":"Pedersen, T. R., and H. C. Carlson (2001), First observations of HF heaterproduced airglow at the High Frequency Active Auroral Research Program facility: Thermal excitation and spatial structuring, Radio Sci., 36, 1013–1026.","cites":null},{"id":16384996,"title":"First tomographic estimate of volume distribution of HF-pump enhanced airglow emission,","authors":[],"date":"2001","doi":"10.1029\/2000ja900167","raw":"Gustavsson, B., T. Sergienko, M. T. Rietveld, F. Honary, A. Steen, B. U. E. Bra ¨ndstro ¨m, T. B. Leyser, A. L. Aruliah, T. Aso, M. Ejiri, and S. Marple (2001), First tomographic estimate of volume distribution of HF-pump enhanced airglow emission, J. Geophys. Res., 106, 29,105–29,124.","cites":null},{"id":16385011,"title":"Hagfors (2002a), The high-latitude artificial aurora of 21","authors":[],"date":"1999","doi":null,"raw":"Kosch, M. J., M. T. Rietveld, T. K. Yeoman, K. Cierpka, and T. Hagfors (2002a), The high-latitude artificial aurora of 21 February 1999: An analysis, Adv. Polar Upper Atmos. Res., 16, 1–12.","cites":null},{"id":16385012,"title":"Hagfors (2002b), High-latitude pump-induced optical emissions for frequencies close to the third electron gyro-harmonic,","authors":[],"date":null,"doi":"10.1029\/2002gl015744","raw":"Kosch, M. J., M. T. Rietveld, A. J. Kavanagh, C. Davis, T. Yeoman, F. Honary, and T. Hagfors (2002b), High-latitude pump-induced optical emissions for frequencies close to the third electron gyro-harmonic, Geophys. Res. Lett., 29(23), 2112, doi:10.1029\/2002GL015744.","cites":null},{"id":16384935,"title":"Heater-induced altitude descent of the EISCAT UHF ion-line overshoot: Observations and modeling,","authors":[],"date":"2006","doi":"10.1016\/j.asr.2005.06.079","raw":"Ashrafi, M., M. J. Kosch, and F. Honary (2006), Heater-induced altitude descent of the EISCAT UHF ion-line overshoot: Observations and modeling, Adv. Space Res., 38, 2645–2652.","cites":null},{"id":16384932,"title":"HF phased array observations of heater-induced spread-F,","authors":[],"date":"1974","doi":"10.1029\/rs009i011p00905","raw":"Allen, E. M., G. D. Thome, and P. B. Rao (1974), HF phased array observations of heater-induced spread-F, Radio Sci., 9, 905–916.","cites":null},{"id":16385029,"title":"HF-induced airglow at magnetic zenith: theoretical considerations,","authors":[],"date":"2005","doi":"10.5194\/angeo-23-47-2005","raw":"Mishin, E. V., W. J. Burke, and T. Pedersen (2005), HF-induced airglow at magnetic zenith: theoretical considerations, Ann. Geophys., 23, 47–53.","cites":null},{"id":16385014,"title":"High latitude artificial aurora from HEATING: A unique phenomenon?, paper presented at 28th Annual European Meeting on Atmospheric Studies by Optical Methods, Sodankyla Geophys. Obs.,","authors":[],"date":"2003","doi":null,"raw":"Kosch, M. J., M. T. Rietveld, F. Honary, and T. Hagfors (2003), High latitude artificial aurora from HEATING: A unique phenomenon?, paper presented at 28th Annual European Meeting on Atmospheric Studies by Optical Methods, Sodankyla Geophys. Obs., Oulu, Finland.","cites":null},{"id":16385009,"title":"Highlatitude HF-induced airglow displaced equatorwards of the pump beam,","authors":[],"date":"2000","doi":"10.1029\/2000gl003754","raw":"Kosch, M. J., M. T. Rietveld, T. Hagfors, and T. Leyser (2000), Highlatitude HF-induced airglow displaced equatorwards of the pump beam, Geophys. Res. Lett., 27, 2817–2820.","cites":null},{"id":16384981,"title":"Imaging HF-induced large-scale irregularities above HAARP,","authors":[],"date":"2006","doi":"10.1029\/2005gl024536","raw":"Djuth, F. T., B. W. Reinisch, D. F. Kitrosser, J. H. Elder, A. L. Snyder, and G. S. Sales (2006), Imaging HF-induced large-scale irregularities above HAARP, Geophys. Res. Lett., 33, L04107, doi:10.1029\/2005GL024536.","cites":null},{"id":16385046,"title":"Ionospheric electron heating, optical emissions and striations induced by powerful HF radio waves at high latitudes: Aspect angle dependence,","authors":[],"date":"2003","doi":"10.1029\/2002ja009543","raw":"Rietveld, M. T., M. J. Kosch, N. R. Blagoveshchenskaya, V. A. Kornienko, T. B. Leyser, and T. K. Yeoman (2003), Ionospheric electron heating, optical emissions and striations induced by powerful HF radio waves at high latitudes: Aspect angle dependence, J. Geophys. Res., 108(A4), 1141, doi:10.1029\/2002JA009543.","cites":null},{"id":16384987,"title":"Ionospheric modification and parametric instabilities,","authors":[],"date":"1979","doi":"10.1029\/rg017i001p00135","raw":"Fejer, J. (1979), Ionospheric modification and parametric instabilities, Rev. Geophys., 17, 135–153.","cites":null},{"id":16384979,"title":"Ionospheric modification at twice the electron cyclotron frequency,","authors":[],"date":"2005","doi":"10.1103\/physrevlett.94.125001","raw":"Djuth, F. T., T. R. Pedersen, E. A. Gerken, P. Bernhardt, C. A. Selcher, W. A. Bristow, and M. J. Kosch (2005), Ionospheric modification at twice the electron cyclotron frequency, Phys. Rev. Lett., 94, 125001.","cites":null},{"id":16384977,"title":"Large F region electron-temperature enhancements generated by high-power HF radio waves,","authors":[],"date":"1987","doi":"10.1029\/gl014i009p00953","raw":"Djuth, F. T., B. Thide, H. M. Ierkic, and M. P. Sulzer (1987), Large F region electron-temperature enhancements generated by high-power HF radio waves, Geophys. Res. Lett., 14, 953–956.","cites":null},{"id":16384994,"title":"Magnetic zenith effect in ionospheric modifications,","authors":[],"date":"2002","doi":"10.1016\/s0375-9601(02)01450-0","raw":"Gurevich, A. V., K. P. Zybin, H. C. Carlson, and T. Pedersen (2002), Magnetic zenith effect in ionospheric modifications, Phys. Lett. A, 305, 264–274.","cites":null},{"id":16385040,"title":"Magnetic zenith enhancement of HF radio-induced airglow production at HAARP,","authors":[],"date":"2003","doi":"10.1029\/2002gl016096","raw":"Pedersen, T. R., M. McCarrick, E. Gerken, C. Selcher, D. Sentman, H. C. Carlson, and A. Gurevich (2003), Magnetic zenith enhancement of HF radio-induced airglow production at HAARP, Geophys. Res. Lett., 30(4), 1169, doi:10.1029\/2002GL016096.","cites":null},{"id":16384998,"title":"Nearly simultaneous images of HF-pump enhanced airglow at 6300 A and 5577","authors":[],"date":"2002","doi":"10.1029\/2002gl015350","raw":"Gustavsson, B., B. U. E. Bra ¨ndstro ¨m, A. Steen, T. Sergienko, T. B. Leyser, M. T. Rietveld, T. Aso, and M. Ejiri (2002), Nearly simultaneous images of HF-pump enhanced airglow at 6300 A and 5577 A, Geophys. Res. Lett., 29(24), 2220, doi:10.1029\/2002GL015350.","cites":null},{"id":16384992,"title":"Nonlinear structuring and southward shift of a strongly heated region in ionospheric modification,","authors":[],"date":"2001","doi":"10.1016\/s0375-9601(01)00516-3","raw":"Gurevich, A. V., H. Carlson, and K. P. Zybin (2001), Nonlinear structuring and southward shift of a strongly heated region in ionospheric modification, Phys. Lett. A, 288, 231–239.","cites":null},{"id":16384990,"title":"Nonlinear structuring of the ionosphere modified by powerful radio waves at low latitudes,","authors":[],"date":"1999","doi":"10.1016\/s0375-9601(98)00786-5","raw":"Gurevich, A. V., H. Carlson, M. Kelley, T. Hagfors, A. Karashtin, and K. P. Zybin (1999), Nonlinear structuring of the ionosphere modified by powerful radio waves at low latitudes, Phys. Lett. A, 251, 311–321.","cites":null},{"id":16384983,"title":"Observations of ionospheric cavities generated by high-power radio waves,","authors":[],"date":"1988","doi":"10.1103\/physrevlett.61.239","raw":"Duncan, L. M., J. P. Sheerin, and R. A. Behnke (1988), Observations of ionospheric cavities generated by high-power radio waves, Phys. Rev. Lett., 61, 239–242.","cites":null},{"id":16385026,"title":"On the onset of HFinduced airglow at HAARP,","authors":[],"date":null,"doi":null,"raw":"Mishin, E. V., W. J. Burke, and T. Pedersen (2004b), On the onset of HFinduced airglow at HAARP, J. Geophys. Res., 109, A02305, doi:10.1029\/ 2003JA010205.","cites":null},{"id":16385035,"title":"Persistent enhancement of the HF pump-induced plasma line measured with a UHF diagnostic radar at HAARP,","authors":[],"date":"2006","doi":"10.1029\/2005ja011363","raw":"Oyama, S.-I., B. Watkins, F. T. Djuth, M. J. Kosch, P. Bernhardt, and C. J. Heinselman (2006), Persistent enhancement of the HF pump-induced plasma line measured with a UHF diagnostic radar at HAARP, J. Geophys. Res., 111, A06309, doi:10.1029\/2005JA011363.","cites":null},{"id":16385056,"title":"Production of ionospheric striations by self-focusing of intense radio waves,","authors":[],"date":"1974","doi":"10.1103\/physrevlett.32.1238","raw":"Thome, G. D., and F. W. Perkins (1974), Production of ionospheric striations by self-focusing of intense radio waves, Phys. Rev. Lett., 32, 1238– 1240.","cites":null},{"id":16385007,"title":"Resolution of temporal and spatial ambiguities of intensity variations within pulsating aurorae,","authors":[],"date":"1992","doi":"10.1029\/92ja00447","raw":"Kosch, M. J., and M. W. J. Scourfield (1992), Resolution of temporal and spatial ambiguities of intensity variations within pulsating aurorae, J. Geophys. Res., 97, 14,877–14,883.","cites":null},{"id":16385061,"title":"Saturation and hysteresis effects in ionospheric modification experiments observed by the CUTLASS and EISCAT radars,","authors":[],"date":"2006","doi":"10.5194\/angeo-24-543-2006","raw":"Wright, D. M., J. A. Davies, T. K. Yeoman, T. R. Robinson, and H. Shergill (2006), Saturation and hysteresis effects in ionospheric modification experiments observed by the CUTLASS and EISCAT radars, Ann. Geophys., 24, 543–553.","cites":null},{"id":16384976,"title":"SELF-FOCUSING 8o f9 A08304Bra ¨ndstro","authors":[],"date":"1999","doi":null,"raw":"A08304 KOSCH ET AL.: PUMP BEAM SELF-FOCUSING 8o f9 A08304Bra ¨ndstro ¨m, B. U. E., T. B. Leyser, A. Steen, M. T. Rietveld, B. Gustavsson, T. Aso, and M. Ejiri (1999), Unambiguous evidence of HF pumpenhanced airglow at auroral latitudes, Geophys. Res. Lett., 26, 3561– 3564.","cites":null},{"id":16385043,"title":"Self-focusing of radio waves in an underdense ionosphere,","authors":[],"date":"1981","doi":"10.1029\/ja086ia02p00600","raw":"Perkins, F. W., and M. V. Goldman (1981), Self-focusing of radio waves in an underdense ionosphere, J. Geophys. Res., 86, 600–608.","cites":null},{"id":16384944,"title":"Sheerin (1988a), Spatial and temporal evolution of 630.0 nm airglow enhancements during ionospheric heating experiments,","authors":[],"date":null,"doi":"10.1016\/0273-1177(88)90372-9","raw":"Bernhardt, P. A., L. M. Duncan, C. A. Tepley, R. A. Behnke, and J. P. Sheerin (1988a), Spatial and temporal evolution of 630.0 nm airglow enhancements during ionospheric heating experiments, Adv. Space Res., 8(1), 271–277.","cites":null},{"id":16385021,"title":"Simultaneous measurements of high-frequency pump-enhanced airglow and ionospheric temperatures at auroral latitudes, Adv. Polar Upper Atmos.","authors":[],"date":"2000","doi":null,"raw":"Leyser, T. B., B. Gustavsson, B. U. E. Bra ¨ndstro ¨m, A. Steen, F. Honary, M. T. Rietveld, T. Aso, and M. Ejiri (2000), Simultaneous measurements of high-frequency pump-enhanced airglow and ionospheric temperatures at auroral latitudes, Adv. Polar Upper Atmos. Res., 14, 1–11.","cites":null},{"id":16385059,"title":"Some ionosonde observations of ionosphere modification by very high power, high frequency ground-based transmission,","authors":[],"date":"1970","doi":"10.1029\/ja075i031p06429","raw":"Utlaut, W. F., E. J. Violette, and A. K. Paul (1970), Some ionosonde observations of ionosphere modification by very high power, high frequency ground-based transmission, J. Geophys. Res., 75, 6429–6435.","cites":null},{"id":16385003,"title":"SuperDARN observations of spectral enhancements excited during an ionospheric heating experiment,","authors":[],"date":"2004","doi":"10.1029\/2004gl019613","raw":"Hughes, J. M., W. A. Bristow, and R. T. Parris (2004), SuperDARN observations of spectral enhancements excited during an ionospheric heating experiment, Geophys. Res. Lett., 31, L08808, doi:10.1029\/ 2004GL019613.","cites":null},{"id":16384947,"title":"Tepley (1988b), Artificial airglow excited by high-power radio waves,","authors":[],"date":null,"doi":"10.1126\/science.242.4881.1022","raw":"Bernhardt, P. A., L. M. Duncan, and C. A. Tepley (1988b), Artificial airglow excited by high-power radio waves, Science, 242, 1022–1027.","cites":null},{"id":16384975,"title":"The ionospheric focused heating experiment,","authors":[],"date":"1995","doi":"10.1029\/95gl02778","raw":"Bernhardt, P. A., et al. (1995), The ionospheric focused heating experiment, J. Geophys. Res., 100, 17,331–17,345.","cites":null},{"id":16385000,"title":"The self-focusing instability in the presence of density irregularities in the ionosphere,","authors":[],"date":"1996","doi":"10.1029\/95ja02975","raw":"Guzdar, P. N., P. K. Chaturvedi, K. Papadopoulos, M. J. Keskinen, and S. L. Ossakow (1996), The self-focusing instability in the presence of density irregularities in the ionosphere, J. Geophys. Res., 101, 2453–2460.","cites":null},{"id":16384941,"title":"The theory of ionospheric focused heating,","authors":[],"date":"1987","doi":"10.1016\/0021-9169(87)90093-6","raw":"Bernhardt, P. A., and L. M. Duncan (1987), The theory of ionospheric focused heating, J. Atmos. Terr. Phys., 49, 1107–1117.","cites":null},{"id":16385002,"title":"The thermal self-focussing instability near the critical surface in the high-latitude ionosphere,","authors":[],"date":"1998","doi":"10.1029\/97ja03247","raw":"Guzdar, P. N., P. K. Chaturvedi, K. Papadopoulos, and S. L. Ossakow (1998), The thermal self-focussing instability near the critical surface in the high-latitude ionosphere, J. Geophys. Res., 103, 2231–2237.","cites":null},{"id":16385032,"title":"Thermal response of the F region ionosphere for conditions of large HF-induced electron-temperature enhancements,","authors":[],"date":"1988","doi":"10.1029\/gl015i004p00311","raw":"Newman, A. L., H. C. Carlson, G. P. Mantas, and F. T. Djuth (1988), Thermal response of the F region ionosphere for conditions of large HF-induced electron-temperature enhancements, Geophys. Res. Lett., 15, 311–314.","cites":null},{"id":16385024,"title":"Viggiano (2004a), Stormtime subauroral density troughs: Ion-molecule kinetics effects,","authors":[],"date":null,"doi":"10.1029\/2004ja010438","raw":"Mishin, E. V., W. J. Burke, and A. A. Viggiano (2004a), Stormtime subauroral density troughs: Ion-molecule kinetics effects, J. Geophys. Res., 109, A10301, doi:10.1029\/2004JA010438.","cites":null},{"id":16385053,"title":"Wide band attenuation of radio waves caused by powerful HF waves: Saturation and dependence on ionospheric variability,","authors":[],"date":"1982","doi":"10.1029\/ja087ia03p01551","raw":"Stubbe, P., H. Kopka, T. B. Jones, and T. Robinson (1982), Wide band attenuation of radio waves caused by powerful HF waves: Saturation and dependence on ionospheric variability, J. Geophys. Res., 87, 1551–1555.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-08","abstract":"On 4 February 2005 the High-Frequency Active Auroral Research Program (HAARP) facility was operated at 2.85 MHz to produce artificial optical emissions in the ionosphere while passing through the second electron gyroharmonic. All-sky optical recordings were performed with 15 s integration, alternating between 557.7 and 630 nm. We report the first optical observations showing the temporal evolution of large-scale pump wave self-focusing in the magnetic zenith, observed in the 557.7 nm images. These clearly show that the maximum intensity was not reached after 15 s of pumping, which is unexpected since the emission delay time is <1 s, and that the optical signature had intensified in a much smaller region within the beam after 45 s of pumping. In addition, adjacent regions within the beam lost intensity. Radar measurements indicate a plasma depletion of ∼1% near the HF reflection altitude. Ray tracing of the pump wave through the plasma depletion region, which forms a concave reflecting radio wave mirror, reproduces the optical spatial morphology. A radio wave flux density gain of up to ∼30 dB may occur. In addition, the ray trace is consistent with the observed artificial optical emissions for critical plasma frequencies down to ∼0.5 MHz below the pump frequency","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71093.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/6715\/1\/art_860.pdf","pdfHashValue":"2f9c77fa5eacf20800a7dbff6bcc23f89549fadc","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:6715<\/identifier><datestamp>\n      2018-01-24T03:16:04Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5431<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Temporal evolution of pump beam self-focusing at the High-Frequency Active Auroral Research Program<\/dc:title><dc:creator>\n        Kosch, Mike J.<\/dc:creator><dc:creator>\n        Pedersen, T.<\/dc:creator><dc:creator>\n        Mishin, E.<\/dc:creator><dc:creator>\n        Starks, M.<\/dc:creator><dc:creator>\n        Gerken-Kendall, E.<\/dc:creator><dc:creator>\n        Sentman, D.<\/dc:creator><dc:creator>\n        Oyama, S.<\/dc:creator><dc:creator>\n        Watkins, B.<\/dc:creator><dc:subject>\n        T Technology (General)<\/dc:subject><dc:description>\n        On 4 February 2005 the High-Frequency Active Auroral Research Program (HAARP) facility was operated at 2.85 MHz to produce artificial optical emissions in the ionosphere while passing through the second electron gyroharmonic. All-sky optical recordings were performed with 15 s integration, alternating between 557.7 and 630 nm. We report the first optical observations showing the temporal evolution of large-scale pump wave self-focusing in the magnetic zenith, observed in the 557.7 nm images. These clearly show that the maximum intensity was not reached after 15 s of pumping, which is unexpected since the emission delay time is <1 s, and that the optical signature had intensified in a much smaller region within the beam after 45 s of pumping. In addition, adjacent regions within the beam lost intensity. Radar measurements indicate a plasma depletion of ∼1% near the HF reflection altitude. Ray tracing of the pump wave through the plasma depletion region, which forms a concave reflecting radio wave mirror, reproduces the optical spatial morphology. A radio wave flux density gain of up to ∼30 dB may occur. In addition, the ray trace is consistent with the observed artificial optical emissions for critical plasma frequencies down to ∼0.5 MHz below the pump frequency.<\/dc:description><dc:date>\n        2007-08<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/6715\/1\/art_860.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2007JA012264<\/dc:relation><dc:identifier>\n        Kosch, Mike J. and Pedersen, T. and Mishin, E. and Starks, M. and Gerken-Kendall, E. and Sentman, D. and Oyama, S. and Watkins, B. (2007) Temporal evolution of pump beam self-focusing at the High-Frequency Active Auroral Research Program. Journal of Geophysical Research, 112. A08304. ISSN 0148-0227<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/6715\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1029\/2007JA012264","http:\/\/eprints.lancs.ac.uk\/6715\/"],"year":2007,"topics":["T Technology (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Temporal evolution of pump beam self-focusing at the High-\nFrequency Active Auroral Research Program\nM. J. Kosch,1,2 T. Pedersen,1 E. Mishin,3 M. Starks,1 E. Gerken-Kendall,4 D. Sentman,5\nS. Oyama,5,6 and B. Watkins5\nReceived 9 January 2007; revised 22 April 2007; accepted 7 May 2007; published 15 August 2007.\n[1] On 4 February 2005 the High-Frequency Active Auroral Research Program (HAARP)\nfacility was operated at 2.85 MHz to produce artificial optical emissions in the ionosphere\nwhile passing through the second electron gyroharmonic. All-sky optical recordings were\nperformed with 15 s integration, alternating between 557.7 and 630 nm. We report the\nfirst optical observations showing the temporal evolution of large-scale pump wave self-\nfocusing in the magnetic zenith, observed in the 557.7 nm images. These clearly show that\nthe maximum intensity was not reached after 15 s of pumping, which is unexpected\nsince the emission delay time is <1 s, and that the optical signature had intensified in a\nmuch smaller region within the beam after 45 s of pumping. In addition, adjacent regions\nwithin the beam lost intensity. Radar measurements indicate a plasma depletion of \u00011%\nnear the HF reflection altitude. Ray tracing of the pump wave through the plasma\ndepletion region, which forms a concave reflecting radio wave mirror, reproduces the\noptical spatial morphology. A radio wave flux density gain of up to \u000130 dB may occur. In\naddition, the ray trace is consistent with the observed artificial optical emissions for critical\nplasma frequencies down to \u00010.5 MHz below the pump frequency.\nCitation: Kosch, M. J., T. Pedersen, E. Mishin, M. Starks, E. Gerken-Kendall, D. Sentman, S. Oyama, and B. Watkins (2007),\nTemporal evolution of pump beam self-focusing at the High-Frequency Active Auroral Research Program, J. Geophys. Res., 112,\nA08304, doi:10.1029\/2007JA012264.\n1. Introduction\n[2] Pumping the ionosphere with high-power high-\nfrequency (HF) radio waves can induce several turbulent\ninstabilities, which result in electron acceleration. These\nelectrons excite the neutral atmospheric constituents by\ncollisions. A fraction of this energy is released as photons\nwith wavelengths identical to the natural auroras. Although\nthe phenomenon has been known at middle and low\nlatitudes since the 1970s, it has only been unambiguously\nobserved at high latitudes fairly recently, notably at Euro-\npean Incoherent Scatter Scientific Association (EISCAT)\nfacility in Norway [Bra¨ndstro¨m et al., 1999] and at HAARP\nin Alaska [Pedersen and Carlson, 2001]. Almost immedi-\nately, it was noticed that the optical emission was signifi-\ncantly more intense in the magnetic zenith. For vertical\npumping at EISCAT [Kosch et al., 2000] and HAARP\n[Pedersen and Carlson, 2001] the emission region was\ndisplaced toward the magnetic zenith \u000113\u0001 and \u000115\u0001 away,\nrespectively. The brightest optical emission was sometimes\noutside the \u00023 dB locus of the pump beam. These obser-\nvations could not be explained by neutral winds or plasma\nconvection [Pedersen and Carlson, 2001; Kosch et al.,\n2002a]. Pump beam swinging experiments at EISCAT\n[Kosch et al., 2003] and HAARP [Pedersen et al., 2003]\nclearly show that the maximum optical response occurs in\nthe magnetic zenith at high latitudes, with a gain exceeding\nan order of magnitude compared to all other directions\n[Pedersen et al., 2003]. The ‘‘magnetic zenith’’ effect\nappears to be true for all optical wavelengths and so\noperates for all electron energies.\n[3] The mechanism for electron acceleration is closely\nlinked to pump-induced small-scale field-aligned plasma\nirregularities, called striations, which are symbiotic with\nupper-hybrid electrostatic waves acting perpendicular to the\nmagnetic field line direction [Kosch et al., 2002b, and\nreferences therein]. Striations can be generated at very\nlow pump powers (<4 MW effective radiated power)\n[Wright et al., 2006], hence upper-hybrid resonance is rather\neasily stimulated. Strong production of striations has been\nobserved for pump frequencies above the second electron\ngyroharmonic (\u00012.85 MHz in the F-layer) [Kosch et al.,\n2007]. When pumping occurs outside the so-called Spitze\ncone, zenith angle \u00016\u0001 at EISCAT and \u00018\u0001 at HAARP, the\npump waves will refract down below the nominal HF\nreflection altitude [e.g., Kosch et al., 2002a] whilst propa-\nJOURNAL OF GEOPHYSICAL RESEARCH, VOL. 112, A08304, doi:10.1029\/2007JA012264, 2007\nClick\nHere\nfor\nFull\nArticle\n1Space Vehicles Directorate, Air Force Research Laboratory, Hanscom\nAir Force Base, Massachusetts, USA.\n2Department of Communication Systems, Lancaster University, Lan-\ncaster, UK.\n3Institute for Scientific Research, Boston College, Chestnut Hill,\nMassachusetts, USA.\n4SRI International, Menlo Park, California, USA.\n5Geophysical Institute, University of Alaska, Fairbanks, Alaska, USA.\n6Solar-Terrestrial Environment Laboratory, Nagoya University, Nagoya,\nJapan.\nCopyright 2007 by the American Geophysical Union.\n0148-0227\/07\/2007JA012264$09.00\nA08304 1 of 9\ngating away horizontally from the source. The magnetic\nzenith is always outside the Spitze cone; hence no Airy\nswelling can occur [e.g., Mishin et al., 2005] because the\npump waves directed at the magnetic zenith do not reflect\nback on themselves. Since constructive interference between\nthe primary upward and reflected downward propagating\nwaves boosts the pump wave electric field by an order\nof magnitude, it is not immediately obvious why the optical\nresponse in the magnetic zenith, where no Airy swelling\noccurs, should be so much greater than in the vertical, where\nAiry swelling is routinely observed. However, since the\nupper-hybrid resonance altitude occurs typically <10 km\nbelow the HF reflection altitude, upper-hybrid resonance\nstill occurs at high latitudes in the magnetic zenith. This\nis true for pump frequencies <6.1 MHz at EISCAT and\n<5.4 MHz at HAARP [Mishin et al., 2005]. These lower HF\npump frequencies are generally used for artificial optical\nemission experiments, which typically occur in a decaying\nionosphere at night.\n[4] Gurevich et al. [2001, 2002] suggested that nonlinear\npump wave self-focusing on large-scale bunches of stria-\ntions in the magnetic zenith could explain the dramatic\nenhancement of electron acceleration at high latitudes.\nWright et al. [1988] found that large-scale plasma density\ndepletion could occur when pumping the F-layer ionosphere\nover EISCAT. During artificial optical emission experiments\nat EISCAT [Rietveld et al., 2003] artificial plasma cavities\nwith depletions of \u000110–20% have been observed (M. T.\nRietveld, private communication, 2006). Similarly, also\nduring artificial optical emission experiments at EISCAT\n[Kosch et al., 2002b], HF radio images of ionosonde\nbackscatter often showed significant clustering around the\nmagnetic zenith (M. T. Rietveld, private communication,\n2006). This has been confirmed by Djuth et al. [2006] who\nfound preferential production of large-scale plasma irregu-\nlarities in the magnetic zenith over HAARP. Theory by\nGuzdar et al. [1996] found that self-focusing favors large\ntransverse scale sizes (>km) because diffraction effects\nsuppress self-focusing at shorter wavelengths. Scintillation\nobservations at EISCAT confirm this idea [Basu et al.,\n1997]. However, the growth time of km scale irregularities\nis minutes in contrast tens of seconds for 10 m scale\nirregularities and seconds for meter-scale irregularities\n[Basu et al., 1997].\n[5] Magnetic field-aligned plasma depletion [Thome and\nPerkins, 1974] and pump beam self-focusing [Allen et al.,\n1974] has also been observed at midlatitudes. Plasma\nirregularities set in within \u000110 s of pumping [Utlaut et\nal., 1970] and self-focusing of the pump wave in the\nmagnetic zenith can occur for small plasma depletions of\norder <1% [Georges, 1970]. Rocket and satellite measure-\nments at Arecibo of pump-induced striations revealed small-\nscale plasma depletions up to 12% (mean 6%) [Kelley et al.,\n1995] and 3% [Farley et al., 1983], respectively, for low\nlatitudes. Rocket measurements at EISCAT show small-\nscale pump-induced plasma depletions up to 2% (typically\n<1%) [Rose et al., 1985] for high latitudes.\n[6] Extensive work has been done on pump beam self-\nfocusing and artificial optical emissions at Arecibo, located\nat low latitude (18.48\u0001N), where the pump beam can not be\nsteered into the magnetic zenith. Large-scale magnetic field-\naligned artificial plasma cavities up to 50% depletion were\nfirst reported by Duncan et al. [1988]. The first association\nbetween convecting artificial large-scale plasma cavities and\nartificial optical emissions was made by Bernhardt et al.\n[1988a, 1989]. Bernhardt et al. [1988b] first reported the\ngeomagnetic field alignment of the pump-induced artificial\noptical emissions. Chemical release rocket experiments in\nthe ionospheric F-layer, expressly for the purpose of creating\nan artificial radio wave focusing lens, found the pump wave\nintensity increased by up to 20 dB [Bernhardt and Duncan,\n1987; Bernhardt et al., 1995]. Although a large increase in\noptical emissions was predicted [Bernhardt et al., 1995],\nnone was observed possibly due to the chemicals used.\n[7] Self-focusing has also been studied theoretically\n[Farley et al., 1983, and references therein], showing that\nheating of the ionosphere will lead to thermal self-focusing\nby hydrodynamic expansion of the plasma. Gurevich et al.\n[1999] showed that pump wave trapping on bunches of\nstriations is easily possible at high latitudes and also\npossible at low latitudes with some restrictions. Perkins\nand Goldman [1981] showed that self-focusing can occur in\nan under dense ionosphere.\n[8] Pedersen et al. [2003],Mishin et al. [2005] and Kosch\net al. [2005] have all found that artificial optical emissions\nare produced in the magnetic zenith for pump frequencies\nup to 500 kHz above the nominal plasma critical frequency\n(foF2), i.e. in an under dense ionosphere. This provides\nevidence for electron heating by upper-hybrid resonance\nsince the mechanism operates at an altitude several kilo-\nmeters below the HF reflection level and therefore can be\nstimulated in an under dense ionosphere [Kosch et al., 2005;\nMishin et al., 2005]. Ionospheric HF pumping is accompa-\nnied by large increases in electron temperature of 1000–\n2000 K at low latitudes [Djuth et al., 1987; Newman et al.,\n1988] and 3000–4000 K at high latitudes [Leyser et al.,\n2000; Rietveld et al., 2003]. At high latitudes, it takes tens\nof seconds for the heat to propagate along the magnetic field\nline, covering \u0001200 to >600 km altitude.\n[9] Mishin et al. [2004a, 2004b] have shown that plasma\ndepletion in the ionosphere can occur due to vibrationally\nexcited N2 in the presence of heated electrons. However, the\nmechanism is slow and requires minutes at 400 km to 10 or\nmore minutes at 300 km to produce the plasma depletion.\nGuzdar et al. [1998] showed that for typical powers (100–\n300 mW\/m2) and frequencies (5–10 MHz) of ionospheric\nheaters, the plasma would become unstable to thermal\nfilamentation within seconds, and a broad spectrum of\nplasma irregularity scale sizes, limited by diffraction, would\nappear. They predict that kilometer scale plasma irregular-\nities grow initially but thermal self-focusing causes collapse\nto smaller scale sizes (tens to hundreds meters) with\nsaturation setting in within tens of seconds. Heat conduction\nalong the magnetic field line depletes the plasma density,\npermitting the pump wave to propagate beyond the original\nreflection altitude into the over dense plasma. This is\nconsistent with observations of strong 10-m scale produc-\ntion of striations when pumping the ionospheric F-layer\nabove the second gyroharmonic [Kosch et al., 2007].\n2. Results and Discussion\n[10] On 4 February 2005 the HAARP facility in Alaska\n(62.39\u0001N, 145.15\u0001W) was operated at 2.85 MHz (\u00023 dB\nA08304 KOSCH ET AL.: PUMP BEAM SELF-FOCUSING\n2 of 9\nA08304\nbeam size \u000132 \u0003 45\u0001) between 0300 and 0550 UT\nimmediately after sunset, with \u000111 MW effective radiated\npower (ERP) and pointing into the magnetic zenith (204\u0001\nazimuth, 75\u0001 elevation). Starting at 0300 UT, a pump\nmodulation of 60 s off, 60 s O-mode, 60 s off, and 60 s\nX-mode was used to perform a frequency pass through the\nsecond electron gyroharmonic whilst searching for O- and\nX-mode resonances with the Kodiak SuperDARN radar\n[e.g., Hughes et al., 2004] and HAARP Modular UHF\nIonospheric Radar (MUIR) [Oyama et al., 2006] facilities.\nThese results are reported by Kosch et al. [2007]. The\ncolocated Digisonde provided ionospheric density profiles\nevery 2 min in the range 1–6 MHz. The colocated 446 MHz\nMUIR, which had just been commissioned, used a simple\nlong pulse transmission whilst recording plasma-line data\non a single receiver channel only. The beam (\u00023 dB beam\nsize \u00018.6\u0001) was pointing into the magnetic zenith with a\ntransmitter long pulse of 998 ms (\u0001150 km), receiver gating\nof 10 ms (\u00011.5 km), and a data dump time of 10 ms, which\nwas subsequently integrated for 2 s. Observations were\nmade for 0317–0339 and 0341–0436 UT. Pumping the\nionosphere with powerful HF radio waves results in para-\nmetric decay instabilities just below the HF reflection\naltitude [Fejer, 1979], which produce Langmuir and ion-\nacoustic waves to which MUIR is sensitive in the plasma-\nline and ion-line channels, respectively. Hence during the\npump pulses, the radar can measure the pump wave reflec-\ntion altitude with high temporal resolution.\n[11] All-sky optical recordings were performed at\nHAARP, alternating between the O1S (557.7 nm) and\nO1D (630.0 nm) emissions with 15 s integration, which\nwere synchronized to start with 557.7 nm at pump on. This\ngives a 557.7 nm image integrated in the period 0–15 s and\n30–45 s of each minute. A 13\u0001 field of view imager\npointing into the magnetic zenith recorded the fine spatial\nstructures of the 557.7 nm emissions using 30 s integration.\nThe camera has 512 \u0003 512 pixels, giving a spatial resolu-\ntion of \u0001200 m at 230 km altitude. In addition, simulta-\nneous O1S and O1D optical recordings with 20 s integration\nand\u000130\u0001 field of view were made from Poker Flat Research\nRange \u0001300 km to the north, starting at 0325 UT. These\ndata give an altitude profile of the artificial optical emissions\nover HAARP, covering 120–400 km. These images are not\nsynchronized to HAARP because of technical difficulties.\nThe short delay time of the O1S emission (\u00010.7 s) makes it\nsuitable for observing the temporal evolution of pump-\ninduced optical emissions. The O1D optical emissions are\nnot discussed here because of their relatively long lifetime\n(\u000130 s) in the F-layer ionosphere [Gustavsson et al., 2001].\nOptical viewing conditions were ideal at HAARP, with\nclear sky and natural aurora on the far northern horizon only\n(Kp = 0). The optical path from Poker Flat was contami-\nnated by haze, especially at low elevations. The riometer at\nHAARP recorded no HF absorption in the D-layer. We\nreport the first optical observations of the temporal evolu-\ntion of large-scale pump wave self-focusing in the magnetic\nzenith, as observed in the 557.7 nm images.\n[12] Figure 1 shows the reflection (plus symbols) and\nupper-hybrid resonance altitudes (cross symbols) over\nHAARP at 2.85 MHz from colocated Digisonde data. The\ndotted horizontal line at \u0001225 km altitude corresponds to\nthe second electron gyroharmonic as determined from the\nIGRF magnetic field model. The solid diagonal line gives\nthe solar terminator altitude. The solid bars indicate when\nO-mode pumping occurred. The interleaved X-mode pump-\ning produced no observable optical effects. Clearly, as time\nprogresses, the HF reflection and upper-hybrid resonance\naltitudes ascend. At \u00010345 UT the upper-hybrid resonance\naltitude passed through the second electron gyroharmonic.\nAt \u00010410 UT the ionospheric critical frequency reached\n2.85 MHz, corresponding to the solar terminator ascending\nthrough the F-region peak altitude. Upper-hybrid resonance\nceases after \u00010435 UT.\n[13] Figure 2 shows an altitude-time plot of the back-\nground-subtracted 557.7 nm optical intensity as viewed\nfrom Poker Flat with the HF reflection (solid line) and\nFigure 1. The reflection (plus symbols) and upper-hybrid\nresonance altitudes (cross symbols) over HAARP at\n2.85 MHz from colocated Digisonde data. The dashed\nhorizontal line is the altitude corresponding to the second\nelectron gyroharmonic. The solid diagonal line gives\nthe solar terminator altitude. The solid bars indicate when\nO-mode pumping occurred.\nFigure 2. Altitude-time plot of background-subtracted\n557.7 nm optical data from Poker Flat with the pump wave\nreflection (solid line) and upper-hybrid resonance (dotted\nline) altitudes overlaid. A spatial median filter has been\napplied, corresponding to \u00014 min in the time domain and\n\u000110 (25) km at low (high) altitudes.\nA08304 KOSCH ET AL.: PUMP BEAM SELF-FOCUSING\n3 of 9\nA08304\nupper-hybrid resonance (dotted line) altitudes overlaid.\nA spatiotemporal median filter has been applied, cor-\nresponding to \u00014 min in the time domain and \u000110 (25)\nkm at low (high) altitudes. The quasi-horizontal optical\nstructures are either stars or gravity waves. The figure\nclearly shows the pump-induced artificial optical emissions\nwhose maximum intensity occurs below the upper-hybrid\nresonance altitude at \u0001200–210 km, consistent with Kosch\net al. [2002a, and references therein]. The optical intensity\nappears to extend from \u0001160 to \u0001300 km in altitude,\nconsistent with the electron temperature enhancements\nobserved by Rietveld et al. [2003]. The artificial optical\nemissions centered on the magnetic zenith continued until\n\u00010435 UT when upper-hybrid resonance became impossi-\nble, which is well after HF reflection ceased (\u00010410 UT).\nThis is consistent with the observations of Pedersen et al.\n[2003], Kosch et al. [2005] and Mishin et al. [2005]. At\n0430 UT, foF2 = 2.55 MHz, i.e., 300 kHz below the pump\nfrequency. Optical emissions of irregular structure were\nproduced after 0430 until \u00010438 UT, consistent with the\nobservations of Pedersen et al. [2003] and Kosch et al.\n[2005]. At 0438 UT, foF2 = 2.4 MHz, i.e., 450 kHz below\nthe pump frequency, and no further optical emissions were\nobserved.\n[14] Figure 3 shows the average background-subtracted\nand calibrated 557.7 nm optical intensity for cones of \u000120\u0001\n(solid curve) and \u00012.5\u0001 (dashed curve) diameter centered on\nthe magnetic zenith, extracted from the all-sky images. The\nwide cone covers most of the artificially induced optical\nemission region, whereas the narrow cone covers the central\nbright spot within the artificially induced optical emission\n(see Figure 4, discussed below). Technical problems\nresulted in several data gaps. Background subtraction is\nnecessary due to the changing twilight illumination. The\nbackground was a piecewise linear fit to the data point at the\nend of each 4 min cycle. The uncertainty introduced is <0.5\nRayleighs (R). The intrinsic noise level of the optical data is\n<1 R. The 557.7 nm optical intensity in the magnetic zenith,\npeaking at \u000111 R, is approximately double that averaged\nFigure 3. The average background-subtracted 557.7 nm\noptical intensity integrated in a \u000120\u0001 (solid curve) and\n\u00012.5\u0001 (dashed curve) degree cone about the HAARP beam\ncenter. The dots give the start time of each 15-s integration,\nspaced 30 s apart. The arrows highlight examples of the\ndelayed 557.7 nm emission.\nFigure 4. Example 557.7 nm images of the pump beam\nself-focusing effect for (a) 0349 and (b) 0357 UT. Each\ncolumn is 30 s apart in time. The top row is monochrome\nbackground-subtracted and contrast-stretched all-sky\nimages of 557.7 nm with 15 s integration. The middle\nrow of false color panels shows the first difference images\nof the top row, where red and blue are positive and negative\nintensity changes, respectively, and green corresponds to no\nchange. South and east are to the bottom and right,\nrespectively. Overlaid are contours of percentage pump\nbeam power. The bottom row is first difference mono-\nchrome images from the 557.7 nm 13\u0001 narrow field of view\nimager.\nA08304 KOSCH ET AL.: PUMP BEAM SELF-FOCUSING\n4 of 9\nA08304\nover much of the beam, peaking at \u00017 R. The 630 nm\nemission is similar (not shown), peaking at \u000158 R in the\nmagnetic zenith and \u000124 R over much of the beam [Kosch\net al., 2007]. Clearly, the optical emissions are enhanced\nduring the O-mode pump pulses. No optical emissions are\nproduced during the X-mode pump pulses. The sudden\nincrease in 557.7 nm optical intensity at 0337 UT is\ncorrelated to the HF reflection altitude passing through the\nsecond gyroharmonic and is discussed in more detail by\nKosch et al. [2007]. The key point here is that the 557.7 nm\noptical emission does not reach its maximum intensity 15 s\nafter pump on. This is especially obviously for the small\nintegration cone and two instances are highlighted by\narrows. Pedersen et al. [2003] noted this effect but offered\nno explanation. The observation is very surprising as the\nO1S emission is expected to reach its maximum intensity\nwithin 1 s.\n[15] Figure 4 shows 557.7 nm all-sky images for the\ntimes highlighted in Figure 3 (Figure 4a: 0349 UT, Figure 4b:\n0357 UT). The monochrome all-sky images (top row) are\nbackground-subtracted and contrast-stretched 557.7 images\ncorresponding to 0–15, 30–45, and 60–75 s after pump on,\nthe last image occurring after pump off. The false color\npanels (middle row) show the first difference images of the\ntop row, where red and blue are positive and negative\nintensity changes, respectively, and green corresponds to\nno change. This presentation method was developed to\nhighlight small intensity changes [Kosch and Scourfield,\n1992]. Overlaid are percentage power contours of the\nHAARP beam. The blue region on the southwest horizon\nis due to sunset. There is evidence of natural auroral activity\non the extreme northern horizon. The bottom row of panels\nare first difference monochrome images from the 557.7 nm\n13\u0001 narrow field of view imager, showing fine spatial scale\nstructures. Whilst the raw all-sky images reveal only the\npresence of artificial optical emissions, the color difference\nimages clearly show that the O1S intensity increases (red) in\na cone of \u000122\u0001 for 0–15 s after pump on. This is followed\nby the O1S intensity continuing to increase in a cone of \u00019\u0001\nfor 30–45 s after pump on while the surrounding region\neither is unchanged, or even decreasing, in intensity. The\n(blue) regions of decreasing intensity appear in the form of a\ncorona, which indicates magnetic field-aligned structures.\nNote the \u00013\u0001 equatorward displacement of the focused\noptical emission in the magnetic meridian plane. When\nthe pump turns off, 60–75 s after pump on, the entire\noptical region decays (blue). This indicates that the O1S\noptical emission never decayed to the background level\nthroughout the pump-on cycle. The morphology of the\ndifference images is strong evidence for pump beam self-\nfocusing in the magnetic zenith, despite the low temporal\nresolution of the optical data. The second region of decay-\ning optical intensity north of HAARP is due to unrelated\noperations by the HIPAS heater, \u0001290 km away.\n[16] The MUIR data (not shown) show a reflection altitude\nduring the HAARP transmissions consistent with the iono-\nsonde data shown in Figure 1. However, they also show a\nfeature impossible to extract from the ionosonde data,\nnamely, that the HF reflection altitude ascends by \u000110 km\nduring the pump pulses. Since the pump frequency remains\nconstant, an upward altitude movement is indicative of a\nplasma depletion at the original reflection altitude. This\nassumes that natural variations in the ionosphere are small,\nwhich is always the case during the 1-min pump pulses (see\nFigure 1). From the analyzed ionograms, the depletion level\nis \u00010.5–1.5%, consistent with previous observations [e.g.,\nGeorges, 1970; Rose et al., 1985].\n[17] Various attempts to reproduce the optical results by\nray tracing through a single beam-sized refractive plasma\ndensity cavity have all been unsuccessful. Different cross-\nsectional profiles, vertical extents and depletion depths have\nbeen tried (not shown). Generally, the small plasma deple-\ntion observed produces far too little ray bending to explain\nthe focusing observed regardless of the plasma cavity shape.\nOnly plasma depletions of several tens percent appear to\nwork, and these are not consistent with the MUIR data.\nHence we conclude that our observations are not explained\nby simple geometric optics of a single refracting plasma\ncavity.\n[18] Since the plasma depletion is a function of the\nelectron temperature enhancement [e.g., Guzdar et al.,\n1998], it will be a function of radio wave power delivered\ninto the ionosphere. Given the typical cross-sectional profile\nof a focused HF beam, the plasma depletion will maximize\nin the beam center. This will result in a concave HF mirror\nat the point of reflection, which will result in focusing. The\nexact relationship between HF beam power, electron tem-\nperature enhancement and plasma depletion is unknown\nfor pumping on the second electron gyroharmonic (i.e.,\n\u00012.85 MHz in the F-layer). However, the presence of\nstrong pump-induced striations (20–30 dB above back-\nground) [Kosch et al., 2007] provides evidence of plasma\nheating [Robinson et al., 1996]. The plasma depletion cross-\nsectional profile was not measured since MUIR was not\nscanning. Hence as a reasonable starting point, we have\nperformed HF ray tracing assuming a Gaussian plasma\ndensity depletion profile, consistent with the shape of the\noptical intensity cross-sectional profile [Pedersen et al.,\n2003]. The cross-sectional profile varies in width with\naltitude in accordance with the diverging pump beam. The\nbeam parallel profile is flat topped ±100 km about the\nupper-hybrid resonance height, which is where the electron\nheat source is located, with a 25 km Gaussian roll-off at\neach end, consistent the optical emission shown in Figure 2.\nAs stated earlier, the depletion profile below the HF\nreflection height introduces negligible refraction. The de-\npletion profile above the HF reflection altitude has no effect\non the HF rays. However, the depletion cross-sectional\nprofile at HF reflection is important.\n[19] Figure 5 shows ray tracing results using a Chapman\nlayer fitted to the real ionospheric density altitude profile for\nthe cases shown in Figure 4. Figures 5a and 5b are for peak\nplasma depletions of 1% and 2%, respectively. The projec-\ntion is in the magnetic meridian and the ray tracing is\nperformed for the HAARP beam configuration, i.e., ±16\u0001\nabout the magnetic field direction. The different colors\ndivide the beam into equal thirds. The dashed black line\ndenotes the magnetic field line through HAARP. In both\ncases, rays from the central part of the beam (green) focus,\nalthough this is not immediately obvious for 1% depletion\n(Figure 5a). Figure 5b shows the concave mirror as a small\nbump in the reflection caustic. This permits the HF rays to\npropagate above the original reflection level, consistent with\nGuzdar et al. [1998]. Figures 5c and 5d show the true flux\nA08304 KOSCH ET AL.: PUMP BEAM SELF-FOCUSING\n5 of 9\nA08304\ndensity calibrated using the real HAARP power profile,\ncorresponding to the 1% and 2% depletion cases (Figures 5a\nand 5b), respectively. The dashed white line denotes the\nmagnetic field line through HAARP. The flux densities at\nthe reflection caustic are not reliable because of the singu-\nlarity in the ray trace. However, the flux density at maxi-\nmum focus (\u0001\u00025 dB) shows a gain of up to \u000130 dB\ncompared to the region of unfocused upward propagating\nrays (\u0001\u000235 dB).\n[20] The HF focus forms below the reflection caustic,\nconsistent with Kosch et al. [2002a] and Figure 2, and\ndisplaced southward of where the magnetic field line\nintersects the reflection caustic, consistent with Figure 4.\nThe 1% plasma depletion forms its focus at <230 km\n(Figure 5c), which is close to the upper-hybrid resonance\naltitude (\u0001225 km). Hence this geometry is most likely to\nproduce strong plasma turbulence, consistent with the\noptical data. The flux density foci form long tails descend-\ning in altitude. However, the number and location of these\nfeatures depends on the depletion depth and the shape of the\nHF mirror, which is unknown. In addition, if the pump\nenergy is converted into electron acceleration and photons,\nthen the flux densities below the upper-hybrid resonance\naltitude after reflection may be significantly lower. The\nquality of the pump wave focus will also depend on how\nsmooth the reflecting caustic is. Since prevailing conditions\nwere Kp = 0, geomagnetic conditions were extremely quiet.\nHowever, the Kodiak SuperDARN radar, which is sensitive\nto 10 m scale irregularities, did show natural background\nbackscatter (\u000130–35 dB), which was significantly en-\nhanced by pumping (\u000150–60 dB) [Kosch et al., 2007]\n(not shown). Such natural backscatter at HAARP around\nsunset [Djuth et al., 2005] and pump-enhanced backscatter\n[e.g., Kosch et al., 2002b] are common. Obviously, the\nirregularities make for a nonideal reflecting surface and real\nflux density gain is most likely less than 30 dB. In addition,\nFigure 5. (a and b) Ray tracing of the HAARP pump beam for ±16\u0001 about the magnetic zenith direction.\nThe projection is in the magnetic meridian plane. The different colors divide the beam into equal thirds.\nShown are peak plasma depletions of 1% (Figure 5a) and 2% (Figure 5b), respectively. Also shown are\n(c and d) the true flux density of the HAARP beam. The flux densities at the reflection caustic are not\nreliable. Shown are peak plasma depletions of 1% (Figure 5c) and 2% (Figure 5d), respectively. The\ndashed lines denote the magnetic field line connected to HAARP, located on the ground at 0 km.\nA08304 KOSCH ET AL.: PUMP BEAM SELF-FOCUSING\n6 of 9\nA08304\nit is not known howmuch pump energy is lost to upper-hybrid\nresonance during upward propagation, although anomalous\nabsorption measurements at 3.515MHz suggest this could be\n\u000115 dB in the quiet ionosphere [Stubbe et al., 1982]. Pump\nenergy is converted into electron acceleration before reflec-\ntion as witnessed by the artificial optical emissions produced\nprior to focusing and around the focused spot.\n[21] The 1% plasma depletion ray trace (Figures 5a and\n5c) give a good approximation to the optical observations\nand is consistent with the MUIR radar data. The equator-\nward displacement of maximum focus (\u00015\u0001), the apparent\nangular size of the maximum focus as seen from HAARP\n(\u00015\u0001), and the height of maximum focus (<230 km) are all\nremarkably similar to the optical data shown in Figures 2\nand 4. We can approximately estimate the likely pump wave\nflux density gain for our experiment. Pedersen et al. [2003]\nshowed a quasilinear relationship exists between O1D\n(630.0 nm) photon production and pump power below\n\u000110 MW ERP. This has never been tested for the O1S\n(557.7 nm) emission. However, assuming the quasilinear\nrelationship holds for 557.7 nm for our low ERP experiment\nand anomalous absorption due to striations reduces the\npump wave flux by 15 dB [Stubbe et al., 1982], then for\na focused optical spot of double the intensity (3 dB) of the\nsurrounding emission region (Figure 3) the concave HF\nmirror must result in a flux density gain of 18 dB. This\ncrude estimate is consistent with the idealized gain of 30 dB\nfrom ray tracing (Figure 5).\n[22] Figure 6 shows ray tracing results for an underdense\nionosphere (after 0410 UT) assuming a 1% Gaussian-\nshaped plasma depletion. As before, the projection is in\nthe magnetic meridian and the ray tracing is performed for\nthe HAARP beam configuration, i.e., ±16\u0001 about the mag-\nnetic field direction. The solid line denotes the magnetic field\nline connected to HAARP, located at 0 km. The different\ncolors divide the beam into equal thirds. Figures 6a, 6b, 6c,\nand 6d are for foF2 = 2.85 (\u00010410 UT), 2.75 (\u00010414 UT),\n2.65 (\u00010424 UT), and 2.55 (\u00010430 UT) MHz, respectively.\nFocusing is still possible for foF2 > 2.55 MHz (Figure 6d)\nprior to 0430 UT, consistent with Perkins and Goldman\nFigure 6. Ray tracing of the HAARP pump beam for ±16\u0001 about the magnetic zenith direction for a\npeak plasma depletion of 1%. The projection is in the magnetic meridian plane. The different colors\ndivide the beam into equal thirds. The dashed line denotes the magnetic field line connected to HAARP,\nlocated at 0 km. Shown are a plasma critical frequency of (a) 2.85, (b) 2.75, (c) 2.65, and (d) 2.55 MHz.\nA08304 KOSCH ET AL.: PUMP BEAM SELF-FOCUSING\n7 of 9\nA08304\n[1981] as well as our optical data (see Figure 3), but the\nconcave mirror disappears for foF2 <= 2.55MHz (Figure 6d)\nafter 0430 UT. Figure 1 shows that upper-hybrid resonance\nstopped at 0435 UT. Irregular optical emissions were\nobserved until 0438 UT, these being due to natural large-\nscale plasma irregularities within which upper-hybrid reso-\nnance was still possible [Kosch et al., 2005]. Hence after\n0430 UT, the production artificial optical emissions were\nstill possible but only by the upward propagating pump\nwaves, i.e., not by downward propagating waves after\nreflection.\n[23] For a pump frequency of 2.85 MHz and 1% plasma\ndepletion in their thermal self-focusing model, Guzdar et al.\n[1998] estimate the minimum transverse scale-size of large-\nscale plasma irregularities to be \u0001170 m. The fine scale\nstructures revealed by the 13\u0001 narrow field of view imager\n(Figure 4, bottom rows) have a scale size of \u00012–6 km\nassuming an altitude of \u0001230 km, i.e., the upper-hybrid\nresonance altitude at the time of the observations in Figure 4.\nOur result is consistent with the \u00011–5 km scale size\nobserved by Djuth et al. [2005]. Since these observations\nare taken close to the magnetic field direction, no significant\nparallax is expected. However, ionospheric plasma flow will\ncause the irregularities to move, taking with them the wave-\nplasma interaction regions. Hence the oxygen atoms pro-\nducing the photons will smear out any fine-scale structures\nover the 30 s integration period. Unfortunately, no Dig-\nisonde skymap or SuperDARN radar data are available.\nHowever, Coupled Thermosphere Ionosphere Plasmasphere\n(CTIP) modeling (performed at the Community Coordinated\nModeling Center at http:\/\/ccmc.gsfc.nasa.gov) indicates that\nthe plasma speed was \u0001109 m\/s at 230 km altitude for the\ntime of the observations. The smallest observable structure\nis determined by the pixel resolution of the imager, which is\n\u0001200 m at 230 km. This will appear smeared out by 30 \u0003\n109 ffi 3265 m, which is consistent with our minimum\nestimate above. The larger optical structures (\u00056 km) would\ncome from kilometer-scale plasma irregularities. Hence these\noptical data are consistent with Guzdar et al.’s [1998] model.\nWe note that the large-scale irregularities aremostly likely not\nproduced from a smooth ionospheric background because the\ntime between O-mode pump pulses (3 min) is too short to\nprevent preconditioning of the plasma.\n[24] The presence of hundreds of meters to kilometer-\nscale structures in the optical data, the focusing of the\nartificial optical emissions from \u000122\u0001 to a \u00019\u0001 cone within\ntens of seconds, and the increase in HF reflection altitude\nresulting from a \u00011% plasma depletion are all consistent\nwith the predictions of Guzdar et al. [1998] and their theory\nof thermal self-focusing. Their mechanism appears to ex-\nplain the rapid plasma depletion observed, which then leads\nto the formation of the concave mirror at the reflection\ncaustic and HF ray focusing. Our HAARP experiment does\nnot fall in the range of their numerical simulations (HAARP=\n\u000120 mW\/m2, simulation = 100–300 mW\/m2, and HAARP =\n2.85 MHz, simulation 5–10 MHz). Whilst the pump fre-\nquency does not appear important, pump power determines\nthe electron temperature enhancement and plasma depletion\ndepth in their model. However, we note that with a pump\nfrequency of 2.85 MHz HAARP produces an O1D optical\nemission of 100–300 R for 11 MW ERP [Djuth et al., 2005;\nKosch et al., 2005], whereas for pump frequencies >4 MHz\nEISCAT produces O1D optical intensities of order 100 R for\npump powers of 70–200 MW ERP [Kosch et al., 2000,\n2002b; Rietveld et al., 2003]. Since the O1D 630 nm pump-\ninduced optical emission is at least partly a function of\nelectron temperature [e.g., Ashrafi et al., 2006; Gustavsson\net al., 2002], we conclude that low pump powers at HAARP\nare compensated by pumping the ionosphere near the\nsecond electron gyroharmonic, which seems to produce\nsignificant electron temperature enhancements. Hence our\nobservations are consistent with the model of Guzdar et al.\n[1998]. In addition, since the plasma depletion is controlled\nby the electron temperature enhancement, in principle, the\nfocal length of the HF mirror can be controlled by correctly\nshaping the pump beam and varying the output power. Both\nare possible at HAARP.\n3. Conclusion\n[25] Using images of artificially induced 557.7 nm optical\nemissions, we show the temporal evolution of large-scale\nself-focusing of the pump beam in the magnetic zenith of\nthe high-latitude ionosphere. The optical emission collapses\nfrom a \u000122\u0001 cone down to \u00019\u0001 within tens of seconds. The\nrapid plasma depletion of \u00011% is consistent with thermal\nself-focusing. The optical spatial morphology can not be\nexplained by plasma refraction of the HF beam. However, it\ncan be explained by the formation an HF concave reflecting\nmirror at the reflecting caustic in the ionosphere. This is\ngenerated in the plasma by the pump beam itself by heating\nthe electrons. An HF flux gain of up to \u000130 dB may be\nachieved if the reflecting caustic is smooth.\n[26] Acknowledgments. The authors thank the following persons for\ntheir invaluable contributions: L. Snyder for setting up a fast-sweeping\nDigisonde mode synchronized to HAARP, permitting real time determina-\ntion of the correct pump frequency to find the second gyrofrequency.\nM. McCarrick for operating the HAARP facility. R. Esposito for upgrading\nthe HAARP all-sky imager to improve its sensitivity. The HAARP program\nis a Department of Defense project managed jointly by the U.S. Air Force\nand U.S. Navy. This research was supported in part by AFRL contract\nF19628-02-C-0087 with Boston College and AFOSR under tasks 2311SD\nand 2311AS. M.J.K acknowledges support by the National Research\nCouncil Research Associateship program. M.J.K. is an Honorary Research\nFellow, University of Kwazulu-Natal, Durban, South Africa.\n[27] Amitava Bhattacharjee thanks the reviewers for their assistance in\nevaluating this paper.\nReferences\nAllen, E. M., G. D. Thome, and P. B. Rao (1974), HF phased array ob-\nservations of heater-induced spread-F, Radio Sci., 9, 905–916.\nAshrafi, M., M. J. Kosch, and F. Honary (2006), Heater-induced altitude\ndescent of the EISCAT UHF ion-line overshoot: Observations and mod-\neling, Adv. Space Res., 38, 2645–2652.\nBasu, S., E. Costa, R. C. Livingston, K. M. Groves, H. C. Carlson, P. K.\nChaturvedi, and P. Stubbe (1997), Evolution of subkilometer scale iono-\nspheric irregularities generated by high-power HF waves, J. Geophys.\nRes., 102, 7469–7475.\nBernhardt, P. A., and L. M. Duncan (1987), The theory of ionospheric\nfocused heating, J. Atmos. Terr. Phys., 49, 1107–1117.\nBernhardt, P. A., L. M. Duncan, C. A. Tepley, R. A. Behnke, and J. P.\nSheerin (1988a), Spatial and temporal evolution of 630.0 nm airglow\nenhancements during ionospheric heating experiments, Adv. Space Res.,\n8(1), 271–277.\nBernhardt, P. A., L. M. Duncan, and C. A. Tepley (1988b), Artificial air-\nglow excited by high-power radio waves, Science, 242, 1022–1027.\nBernhardt, P. A., C. A. Tepley, and L. M. Duncan (1989), Airglow enhance-\nments associated with plasma cavities formed during ionospheric heating\nexperiments, J. Geophys. Res., 94, 9071–9092.\nBernhardt, P. A., et al. (1995), The ionospheric focused heating experiment,\nJ. Geophys. Res., 100, 17,331–17,345.\nA08304 KOSCH ET AL.: PUMP BEAM SELF-FOCUSING\n8 of 9\nA08304\nBra¨ndstro¨m, B. U. E., T. B. Leyser, A. Steen, M. T. Rietveld, B. Gustavsson,\nT. Aso, and M. Ejiri (1999), Unambiguous evidence of HF pump-\nenhanced airglow at auroral latitudes, Geophys. Res. Lett., 26, 3561–\n3564.\nDjuth, F. T., B. Thide, H. M. Ierkic, and M. P. Sulzer (1987), Large F region\nelectron-temperature enhancements generated by high-power HF radio\nwaves, Geophys. Res. Lett., 14, 953–956.\nDjuth, F. T., T. R. Pedersen, E. A. Gerken, P. Bernhardt, C. A. Selcher,\nW. A. Bristow, and M. J. Kosch (2005), Ionospheric modification at twice\nthe electron cyclotron frequency, Phys. Rev. Lett., 94, 125001.\nDjuth, F. T., B. W. Reinisch, D. F. Kitrosser, J. H. Elder, A. L. Snyder, and\nG. S. Sales (2006), Imaging HF-induced large-scale irregularities above\nHAARP, Geophys. Res. Lett., 33, L04107, doi:10.1029\/2005GL024536.\nDuncan, L. M., J. P. Sheerin, and R. A. Behnke (1988), Observations of\nionospheric cavities generated by high-power radio waves, Phys. Rev.\nLett., 61, 239–242.\nFarley, D. T., C. LaHoz, and B. G. Fejer (1983), Studies of the self-focussing\ninstability at Arecibo, J. Geophys. Res., 88, 2093–2102.\nFejer, J. (1979), Ionospheric modification and parametric instabilities, Rev.\nGeophys., 17, 135–153.\nGeorges, T. M. (1970), Amplification of ionospheric heating and triggering\nof ‘‘spread F’’ by natural irregularities, J. Geophys. Res., 75, 6436–6438.\nGurevich, A. V., H. Carlson, M. Kelley, T. Hagfors, A. Karashtin, and K. P.\nZybin (1999), Nonlinear structuring of the ionosphere modified by\npowerful radio waves at low latitudes, Phys. Lett. A, 251, 311–321.\nGurevich, A. V., H. Carlson, and K. P. Zybin (2001), Nonlinear structuring\nand southward shift of a strongly heated region in ionospheric modifica-\ntion, Phys. Lett. A, 288, 231–239.\nGurevich, A. V., K. P. Zybin, H. C. Carlson, and T. Pedersen (2002),\nMagnetic zenith effect in ionospheric modifications, Phys. Lett. A, 305,\n264–274.\nGustavsson, B., T. Sergienko, M. T. Rietveld, F. Honary, A. Steen, B. U. E.\nBra¨ndstro¨m, T. B. Leyser, A. L. Aruliah, T. Aso, M. Ejiri, and S. Marple\n(2001), First tomographic estimate of volume distribution of HF-pump\nenhanced airglow emission, J. Geophys. Res., 106, 29,105–29,124.\nGustavsson, B., B. U. E. Bra¨ndstro¨m, A. Steen, T. Sergienko, T. B. Leyser,\nM. T. Rietveld, T. Aso, and M. Ejiri (2002), Nearly simultaneous images\nof HF-pump enhanced airglow at 6300 A and 5577 A, Geophys. Res.\nLett., 29(24), 2220, doi:10.1029\/2002GL015350.\nGuzdar, P. N., P. K. Chaturvedi, K. Papadopoulos, M. J. Keskinen, and S. L.\nOssakow (1996), The self-focusing instability in the presence of density\nirregularities in the ionosphere, J. Geophys. Res., 101, 2453–2460.\nGuzdar, P. N., P. K. Chaturvedi, K. Papadopoulos, and S. L. Ossakow\n(1998), The thermal self-focussing instability near the critical surface in\nthe high-latitude ionosphere, J. Geophys. Res., 103, 2231–2237.\nHughes, J. M., W. A. Bristow, and R. T. Parris (2004), SuperDARN ob-\nservations of spectral enhancements excited during an ionospheric heat-\ning experiment, Geophys. Res. Lett., 31, L08808, doi:10.1029\/\n2004GL019613.\nKelley, M. C., T. L. Arce, J. Salowey, M. Sulzer, W. T. Armstrong, M. Carter,\nand L. Duncan (1995), Density depletions at the 10-m scale induced by the\nArecibo heater, J. Geophys. Res., 100, 17,367–17,376.\nKosch, M. J., and M. W. J. Scourfield (1992), Resolution of temporal and\nspatial ambiguities of intensity variations within pulsating aurorae,\nJ. Geophys. Res., 97, 14,877–14,883.\nKosch, M. J., M. T. Rietveld, T. Hagfors, and T. Leyser (2000), High-\nlatitude HF-induced airglow displaced equatorwards of the pump beam,\nGeophys. Res. Lett., 27, 2817–2820.\nKosch, M. J., M. T. Rietveld, T. K. Yeoman, K. Cierpka, and T. Hagfors\n(2002a), The high-latitude artificial aurora of 21 February 1999: An\nanalysis, Adv. Polar Upper Atmos. Res., 16, 1–12.\nKosch, M. J., M. T. Rietveld, A. J. Kavanagh, C. Davis, T. Yeoman,\nF. Honary, and T. Hagfors (2002b), High-latitude pump-induced optical\nemissions for frequencies close to the third electron gyro-harmonic, Geo-\nphys. Res. Lett., 29(23), 2112, doi:10.1029\/2002GL015744.\nKosch, M. J., M. T. Rietveld, F. Honary, and T. Hagfors (2003), High\nlatitude artificial aurora from HEATING: A unique phenomenon?, paper\npresented at 28th Annual European Meeting on Atmospheric Studies by\nOptical Methods, Sodankyla Geophys. Obs., Oulu, Finland.\nKosch, M. J., T. Pedersen, J. Hughes, R. Marshall, E. Gerken, A. Senior,\nD. Sentman, M. McCarrick, and F. Djuth (2005), Artificial optical emis-\nsions at HAARP for pump frequencies near the third and second gyro-\nharmonic, Ann. Geophys., 23, 1585–1592.\nKosch, M. J., T. Pedersen, E. Mishin, S.-I. Oyama, J. Hughes, A. Senior,\nB. Watkins, and B. Bristow (2007), Coordinated optical and radar obser-\nvations of ionospheric pumping for a frequency pass through the second\nelectron gyro-harmonic at HAARP, J. Geophys. Res., 112, A06325,\ndoi:10.1029\/2006JA012146.\nLeyser, T. B., B. Gustavsson, B. U. E. Bra¨ndstro¨m, A. Steen, F. Honary,\nM. T. Rietveld, T. Aso, and M. Ejiri (2000), Simultaneous measurements\nof high-frequency pump-enhanced airglow and ionospheric temperatures\nat auroral latitudes, Adv. Polar Upper Atmos. Res., 14, 1–11.\nMishin, E. V., W. J. Burke, and A. A. Viggiano (2004a), Stormtime sub-\nauroral density troughs: Ion-molecule kinetics effects, J. Geophys. Res.,\n109, A10301, doi:10.1029\/2004JA010438.\nMishin, E. V., W. J. Burke, and T. Pedersen (2004b), On the onset of HF-\ninduced airglow at HAARP, J. Geophys. Res., 109, A02305, doi:10.1029\/\n2003JA010205.\nMishin, E. V., W. J. Burke, and T. Pedersen (2005), HF-induced airglow at\nmagnetic zenith: theoretical considerations, Ann. Geophys., 23, 47–53.\nNewman, A. L., H. C. Carlson, G. P. Mantas, and F. T. Djuth (1988),\nThermal response of the F region ionosphere for conditions of large\nHF-induced electron-temperature enhancements, Geophys. Res. Lett.,\n15, 311–314.\nOyama, S.-I., B. Watkins, F. T. Djuth, M. J. Kosch, P. Bernhardt, and C. J.\nHeinselman (2006), Persistent enhancement of the HF pump-induced\nplasma line measured with a UHF diagnostic radar at HAARP, J. Geo-\nphys. Res., 111, A06309, doi:10.1029\/2005JA011363.\nPedersen, T. R., and H. C. Carlson (2001), First observations of HF heater-\nproduced airglow at the High Frequency Active Auroral Research Pro-\ngram facility: Thermal excitation and spatial structuring, Radio Sci., 36,\n1013–1026.\nPedersen, T. R., M. McCarrick, E. Gerken, C. Selcher, D. Sentman, H. C.\nCarlson, and A. Gurevich (2003), Magnetic zenith enhancement of HF\nradio-induced airglow production at HAARP, Geophys. Res. Lett., 30(4),\n1169, doi:10.1029\/2002GL016096.\nPerkins, F. W., and M. V. Goldman (1981), Self-focusing of radio waves in\nan underdense ionosphere, J. Geophys. Res., 86, 600–608.\nRietveld, M. T., M. J. Kosch, N. R. Blagoveshchenskaya, V. A. Kornienko,\nT. B. Leyser, and T. K. Yeoman (2003), Ionospheric electron heating,\noptical emissions and striations induced by powerful HF radio waves at\nhigh latitudes: Aspect angle dependence, J. Geophys. Res., 108(A4),\n1141, doi:10.1029\/2002JA009543.\nRobinson, T. R., F. Honary, A. J. Stocker, T. B. Jones, and P. Stubbe (1996),\nFirst EISCAT observations of the modification of F-region electron tem-\nperatures during RF heating at harmonics of the electron gyro frequency,\nJ. Atmos. Terr. Phys., 58, 385–395.\nRose, G., B. Grandal, E. Neske, W. Ott, K. Spenner, J. Holtet, K. Maseide,\nand J. Trøim (1985), Experimental results from the HERO project: In situ\nmeasurements of ionospheric modifications using sounding rockets,\nJ. Geophys. Res., 90, 2851–2860.\nStubbe, P., H. Kopka, T. B. Jones, and T. Robinson (1982), Wide band\nattenuation of radio waves caused by powerful HF waves: Saturation and\ndependence on ionospheric variability, J. Geophys. Res., 87, 1551–1555.\nThome, G. D., and F. W. Perkins (1974), Production of ionospheric stria-\ntions by self-focusing of intense radio waves, Phys. Rev. Lett., 32, 1238–\n1240.\nUtlaut, W. F., E. J. Violette, and A. K. Paul (1970), Some ionosonde ob-\nservations of ionosphere modification by very high power, high fre-\nquency ground-based transmission, J. Geophys. Res., 75, 6429–6435.\nWright, D. M., J. A. Davies, T. K. Yeoman, T. R. Robinson, and H. Shergill\n(2006), Saturation and hysteresis effects in ionospheric modification\nexperiments observed by the CUTLASS and EISCAT radars, Ann. Geo-\nphys., 24, 543–553.\nWright, J. W., H. Kopka, and P. Stubbe (1988), A large-scale ionospheric\ndepletion by intense radio waves heating, Geophys. Res. Lett., 15, 1531–\n1533.\n\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\nE. Gerken-Kendall, SRI International, Menlo Park, CA 94025, USA.\nM. J. Kosch, Department of Communication Systems, Lancaster\nUniversity, Lancaster LA1 4WA, UK. (m.kosch@lancaster.ac.uk)\nE. Mishin, Institute for Scientific Research, Boston College, Chestnut\nHill, MA 02167, USA.\nS. Oyama, D. Sentman, and B. Watkins, Geophysical Institute, University\nof Alaska, Fairbanks, AK 99775, USA.\nT. Pedersen and M. Starks, Space Vehicles Directorate, Air Force\nResearch Laboratory, Hanscom Air Force Base, MA 01731, USA.\nA08304 KOSCH ET AL.: PUMP BEAM SELF-FOCUSING\n9 of 9\nA08304\n"}