{"doi":"10.1103\/PhysRevC.74.067303","coreId":"100622","oai":"oai:epubs.surrey.ac.uk:16","identifiers":["oai:epubs.surrey.ac.uk:16","10.1103\/PhysRevC.74.067303"],"title":"Shapes of neutron-rich A ≈ 190 odd-odd nuclei","authors":["Walker, P. M.","Xu, F. R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-12-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:16<\/identifier><datestamp>\n      2017-10-31T13:56:21Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:70687973696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/16\/<\/dc:relation><dc:title>\n        Shapes of neutron-rich A ≈ 190 odd-odd nuclei<\/dc:title><dc:creator>\n        Walker, P. M.<\/dc:creator><dc:creator>\n        Xu, F. R.<\/dc:creator><dc:date>\n        2006-12-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/16\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Walker, P. M. and Xu, F. R.  (2006) Shapes of neutron-rich A ≈ 190 odd-odd nuclei   Physical Review C, 74 (067303).       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevC.74.067303<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/16\/","10.1103\/PhysRevC.74.067303"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"PHYSICAL REVIEW C 74, 067303 (2006)\nShapes of neutron-rich A ≈ 190 odd-odd nuclei\nP. M. Walker1,* and F. R. Xu2\n1Department of Physics, University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom\n2Department of Technical Physics, Peking University, Beijing 100871, People’s Republic of China\n(Received 6 October 2006; published 19 December 2006)\nThe occurrence of oblate and prolate shapes is investigated theoretically for odd-odd neutron-rich nuclei with\nA ≈ 190. Using the cranked Woods-Saxon-Strutinsky method, including configuration constraints, it is found\nthat collective oblate rotation coexists with high-K prolate rotation, for tantalum and rhenium isotopes with\nN = 115 and 117.\nDOI: 10.1103\/PhysRevC.74.067303 PACS number(s): 21.10.Gv, 21.10.Re, 21.60.−n, 27.80.+w\nFollowing from the prediction by Hilton and Mang [1] of\n“giant backbending” in 180Hf, caused by a collective oblate\nrotational band crossing the prolate ground-state band, there\nhas been further theoretical investigation of this phenomenon\n[2–5]. The calculated shape change is understood to be induced\nby the effects of rotation alignment. It is related to the\nprediction of a ground-state shape transition from prolate to\noblate with increasing neutron number [5–8] in the same\nmass region. An important consideration is the reinforcing\neffect of the protons and neutrons, both of which have their\nFermi levels high in their respective shells. Thus high-K\ncouplings for prolate shapes compete with low-K couplings\nfor oblate shapes. It is the rotation alignment of the latter that,\nunusually, enables collective oblate rotation (γ = −60◦ in the\nLund convention) to become yrast, i.e., to have the lowest\nexcitation energy at a given angular momentum. Nevertheless,\nthe experimental situation remains inconclusive [4,5,9].\nThe present work gives further theoretical insight by\nstudying odd-odd nuclei in the neutron-rich A ≈ 190 region.\nThe initial supposition was that, since the proton and neutron\nshape-driving effects reinforce one another, it may be sufficient\nto have a single nucleon of each type in order to manifest the\nprolate-oblate shape coexistence. This is indeed found from\nthe calculations, as shown below, and may lead to improved\nexperimental opportunities to test the predictions.\nTotal Routhian surface (TRS) calculations have been\nperformed for odd-odd N = 115 and 117 isotopes of tan-\ntalum (Z = 73), rhenium (Z = 75), and iridium (Z = 77),\ncomplementing our earlier study of even-even nuclides [5].\nThe single-particle energies are obtained from the deformed\nWoods-Saxon potential [10], with the Lipkin-Nogami (LN)\ntreatment of pairing [11]. This avoids the spurious pairing\nphase transition encountered in the simpler BCS approach.\nThe pairing strength, G, is determined by the average-gap\nmethod [12]. The total energy of a configuration consists\nof a macroscopic part which is obtained from the standard\nliquid-drop model [13] and a microscopic part resulting from\nthe Strutinsky shell correction [14], δEshell = ELN − ˜EStrut.\nCalculations are performed in the lattice of quadrupole (β2, γ )\ndeformations with hexadecapole (β4) variation. For a given\n*Electronic address: p.walker@surrey.ac.uk\nrotational frequency, pairing is treated self-consistently by\nsolving the cranked LN equation at any given point of the\ndeformation lattice and then the equilibrium deformation is\ndetermined by minimizing the obtained TRS (for details, see,\ne.g., Refs. [15,16]). Configuration-constrained calculations\nhave been performed in the absence of rotation, as described\nby Xu et al. [17].\nThe critical neutron number for prolate-oblate shape\ncoexistence is close to N = 116. This was discussed for\neven-even 190W116 [5], where, a Kπ = 10− two-quasineutron\n(2ν) prolate excitation is predicted to be at similar energy to\nan Iπ ≈ 10+, 2ν oblate excitation. The focus of the present\nwork is on the neighboring odd-odd nuclides 188,190Ta and\n190,192Re. Their TRS diagrams for negative parity are shown\nin Fig. 1 at low rotational frequency, h¯ω = 0.1 MeV. In each\ncase the ground state, at h¯ω = 0, is prolate. Comparison can\nalso be made with configuration-constrained calculations. The\nKπ = 10−{π9\/2−[514] ⊗ ν11\/2+[615]} Nilsson configura-\ntion is calculated to have prolate shape (see Table I) and\nis at low excitation energy. Indeed, it may form the ground\nstate, though lower-K configurations cannot be ruled out.\n(There is experimental evidence for an Iπ = (2)− ground\nstate in 192Re [18].) In contrast, at low rotational frequency,\nh¯ω ≈ 0.1 MeV, the oblate, πh11\/2 ⊗ νi13\/2 configuration, with\nIπ ≈ 12−, becomes energetically favored, as shown in Fig. 1.\nFurther details are given in Table I, and a schematic illustration\nof the competing prolate and oblate shapes is shown in Fig. 2.\nFor oblate shape, the Fermi level is amongst the low-\u0007\nπh11\/2 and νi13\/2 orbitals, and they undergo Coriolis-induced\nrotation alignment. Note that the TRS diagram in Fig. 1\nfor 190Re shows a triaxial shape, but this becomes oblate\nat higher frequency (γ = −72◦ for h¯ω = 0.2 MeV). Also,\nfor 188Ta, the oblate minimum becomes yrast for h¯ω >\n0.1 MeV. Moreover, in all four cases, oblate shapes dominate\nthe high-spin behavior. It should be appreciated, however,\nthat the oblate band heads are not well defined in the TRS\ncalculations. This is due to the rotation alignment effects,\nwith the calculations being performed in a frequency basis,\nrather than an angular-momentum basis. Full πh11\/2 ⊗ νi13\/2\nalignment gives I = 12, but I = 10 band heads are also\npossible, i.e., with incomplete alignment, and this would be\ncompatible with the oblate angular momenta at h¯ω = 0.1 MeV,\nas given in Table I. The decay of an oblate band head to its\n0556-2813\/2006\/74(6)\/067303(3) 067303-1 ©2006 The American Physical Society\nBRIEF REPORTS PHYSICAL REVIEW C 74, 067303 (2006)\nX=β2cos(γ+30o)\n-0.20\n-0.15\n-0.10\n-0.05\n0.00\n0.05\n0.10\n0.15\n0.20\n0.00 0.05 0.10 0.15 0.2\n-0.20\n-0.15\n-0.10\n-0.05\n0.00\n0.05\n0.10\n0.15\n0.20\n0.0 0.05 0.10 0.15 0.20\nY\n=β\n2s\nin\n(γ+\n30\no\n)\nγ = 30o\n 0o\n-30o\n-60o\nFIG. 1. TRS plots in the β2, γ plane for 188,190Ta (lower panels)\nand 190,192Re (upper), all at h¯ω = 0.1 MeV. The N = 115 isotones are\non the left-hand side, and the N = 117 isotones are on the right. The\nlowest energy in each diagram is indicated by a dot. The contours are\nat 200 keV intervals.\nrespective prolate ground state is likely to be associated with\nshape isomerism.\nIncluded in Table I are calculated values for 192,194Ir.\nHere, the high-K configuration is {π11\/2−[505] ⊗\nν11\/2+[615]}11− , but triaxiality becomes a crucial issue and\nconsiderably complicates the interpretation. In the present\nwork, the focus is on the prolate—oblate competition in\n188,190Ta and 190,192Re, where triaxiality plays a relatively\nminor role.\nAccording to the calculations, the rotation alignment of\none proton and one neutron is sufficient to enable the oblate\nshape to become yrast, and additional alignments at higher\nrotational frequency maintain the oblate yrast status. It seems,\ntherefore, that these odd-odd nuclides are very favourable for\nexperimental investigation of the oblate-rotor behavior. While\nthese are neutron-rich nuclides, making them difficult to access\nexperimentally, advances with radioactive-beam facilities may\nsoon open up the possibilities. It is notable, for example, that an\nIπ = (6−) isomer is already known in 190Re [18], and isomeric\ndecays have recently been identified in 188Ta and 192Re [19]\nusing the projectile-fragmentation technique with delayed\nTABLE I. Calculated spins and deformation parameters for N =\n115 and 117 negative-parity, near-prolate high-K energy minima\nat h¯ω = 0 (left-hand columns), and near-oblate energy minima at\nh¯ω = 0.1 MeV (right-hand columns, including energies relative to\nthe high-K minima). The values of β4 are in the range −0.02 to\n−0.07.\nh¯ω = 0 h¯ω = 0.1 MeVa\nI (h¯) β2 γ E (MeV) I (h¯) β2 γ\n188Ta 10 0.18 0◦ 1.12 11.6 0.19 −52◦\n190Ta 10 0.16 0◦ 0.18 11.5 0.19 −60◦\n190Re 10 0.16 0◦ 0.71 10.6 0.17 −37◦\n192Re 10 0.14 ±9◦ 1.31 12.7 0.17 −66◦\n192Ir 11 0.15 ±30◦ 0.49 12.3 0.15 −77◦\n194Ir 11 0.13 ±30◦ 0.05 12.5 0.14 −75◦\naThe 188Ta near-oblate minimum at h¯ω = 0.1 MeV is a local\nminimum (see Fig. 1).\nγ -ray detection. Half-lives of, respectively, 5 and 120µs were\nfound. However, there is insufficient information to associate\nthese isomers with the predicted prolate-oblate coexistence,\nand further data are needed. A key observation would be\nthe rotational bands built on the different shapes, since these\nare expected to be in the form of strongly coupled \bI = 1\nsequences for high-K prolate shapes, and rotation-aligned\n\bI = 2 sequences for oblate shapes.\nThe N = 117 and 119 iridium isotopes, 192,194Ir, are close\nto stability (193Ir is stable) and easier to access experimentally.\nIt is interesting to note that high-spin isomers are known\nin these isotopes [18]: Iπ = (11−), T1\/2 = 241 years, E =\n168 keV in 192Ir; and (10−, 11−), 171 days, 370 keV in 194Ir. A\nsimilar (11)− isomer is also known in 190Ir [18]. Indeed, Jain\net al. [20] specifically mention the possibility of prolate-oblate\nshape coexistence in the vicinity of 192Ir. However, in view of\nthe predicted triaxiality of the iridium isotopes (see above) it\nis likely that their eventual interpretation will be complex.\nIn summary, TRS calculations show that oblate shape is\ninduced in the odd-odd nuclides 188,190Ta and 190,192Re by the\nrotation alignment of the πh11\/2 ⊗ νi13\/2 pair of nucleons,\nE\nI (I + 1)\nprolate\noblate\nFIG. 2. Schematic energy-versus-spin representation of πh11\/2 ⊗\nνi13\/2 prolate-oblate competition, in odd-odd nuclides adjacent to\n190W. The apparently high moment of inertia (low gradient of dashed\nline) for the oblate shape comes from rotation alignment of the\nunpaired proton and neutron.\n067303-2\nBRIEF REPORTS PHYSICAL REVIEW C 74, 067303 (2006)\nand the oblate shape remains yrast over a large range of\nangular momentum. The experimental verification of yrast\noblate rotation remains a challenge.\nWe thank the EPSRC, the Royal Society, and the Natural\nScience Foundation of China, under Grant Nos. 10525520 and\n10475002, for financial support.\n[1] R. R. Hilton and H. J. Mang, Phys. Rev. Lett. 43, 1979\n(1979).\n[2] F. R. Xu, P. M. Walker, and R. Wyss, Phys. Rev. C 62, 014301\n(2000).\n[3] M. Oi, P. M. Walker, and A. Ansari, Phys. Lett. B505, 75\n(2001).\n[4] P. M. Walker, F. R. Xu, and D. M. Cullen, Phys. Rev. C 71,\n067303 (2005).\n[5] P. M. Walker and F. R. Xu, Phys. Lett. B635, 286 (2006).\n[6] J. Jolie and A. Linnemann, Phys. Rev. C 68, 031301(R) (2003).\n[7] Z. Naik et al., Pramana 62, 827 (2004).\n[8] P. D. Stevenson, M. P. Brine, Zs. Podolya´k, P. H. Regan, P. M.\nWalker, and J. Rikovska Stone, Phys. Rev. C 72, 047303 (2005).\n[9] E. Ngijoi-Yogo et al., submitted to Phys. Rev C.\n[10] W. Nazarewicz, J. Dudek, R. Bengtsson, T. Bengtsson, and\nI. Ragnarsson, Nucl. Phys. A435, 397 (1985); S. ´Cwiok,\nJ. Dudek, W. Nazarewicz, S. Skalski, and T. Werner, Comput.\nPhys. Comm. 46, 379 (1987).\n[11] H. C. Pradhan, Y. Nogami, and J. Law, Nucl. Phys. A201, 357\n(1973); W. Nazarewicz, M. A. Riley, and J. D. Garrett, ibid.\nA512, 61 (1990) .\n[12] P. Mo¨ller and J. R. Nix, Nucl. Phys. A536, 20 (1992).\n[13] W. D. Myers and W. J. Swiatecki, Nucl. Phys. 81, 1 (1966).\n[14] V. M. Strutinsky, Yad. Fiz. 3, 614 (1966); Nucl. Phys. A95, 420\n(1967).\n[15] W. Satuła, R. Wyss, and P. Magierski, Nucl. Phys. A578, 45\n(1994).\n[16] W. Satuła and R. Wyss, Phys. Scr. T56, 159 (1995).\n[17] F. R. Xu, P. M. Walker, J. A. Sheikh, and R. Wyss, Phys. Lett.\nB435, 257 (1998).\n[18] G. Audi, O. Bersillon, J. Blachot, and A. H. Wapstra, Nucl. Phys.\nA729, 3 (2003).\n[19] M. Caama˜no et al., Eur. Phys. J. A 23, 201 (2005).\n[20] A. K. Jain, R. K. Sheline, D. M. Headley, P. C. Sood, D. G.\nBurke, I. Hrivnacova, J. Kvasil, D. Nosek, and R. W. Hoff, Rev.\nMod. Phys. 70, 843 (1998).\n067303-3\n"}