{"doi":"10.1017\/S135246580600302X","coreId":"68622","oai":"oai:eprints.lancs.ac.uk:31925","identifiers":["oai:eprints.lancs.ac.uk:31925","10.1017\/S135246580600302X"],"title":"Personality disorder in primary care : factors associated with therapy process and outcome.","authors":["Jones, Steven H.","Burrell-Hodgson, Gerrard","Tate, Graham","Fowler, Barry"],"enrichments":{"references":[{"id":887617,"title":"A comparison of three self-report questionnaires for the diagnosis of DSM-III disorders.","authors":[],"date":"1988","doi":null,"raw":"Dubro, A., Wetzler, S. and Khan, M. (1988). A comparison of three self-report questionnaires for the diagnosis of DSM-III disorders. Journal of Personality Disorders, 2, 185–189.","cites":null},{"id":887863,"title":"An MCMI cluster typology of obsessive-compulsives: a measure of personality characteristics and its relationship to treatment participation, compliance and outcome in behavior therapy.","authors":[],"date":"1993","doi":null,"raw":"Fals-Stewart, W. and Lucente, S. (1993). An MCMI cluster typology of obsessive-compulsives: a measure of personality characteristics and its relationship to treatment participation, compliance and outcome in behavior therapy. Journal of Psychiatry Research, 27, 139–154.","cites":null},{"id":890624,"title":"An MCMI-II item-level component analysis: personality and clinical factors.","authors":[],"date":"1991","doi":null,"raw":"Retzlaff, P. D., Lorr, M., Hyer, L. and Ofman, P. (1991). An MCMI-II item-level component analysis: personality and clinical factors. Journal of Personality Assessment, 57, 323–334.","cites":null},{"id":891754,"title":"Assessing the ﬁeld effectiveness of Acceptance and Commitment Therapy: an example of the manipulated training research method.","authors":[],"date":"1998","doi":null,"raw":"Storsahl, K. D., Hayes, S. C., Bergan, J. and Romano, P. (1998). Assessing the ﬁeld effectiveness of Acceptance and Commitment Therapy: an example of the manipulated training research method. Behavior Therapy, 29, 35–64.","cites":null},{"id":886571,"title":"Clinical Psychology Summary Information for 2000-01,","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":16711283,"title":"Clinical Psychology Summary Information for 2000-01, England. London: Department of Health. Dreessen,L.andArntz,A.(1998).Theimpactofpersonalitydisordersontreatmentoutcomeofanxiety disorders: best-evidence synthesis.","authors":[],"date":"2001","doi":null,"raw":"DoH (2001). Clinical Psychology Summary Information for 2000-01, England. London: Department of Health. Dreessen,L.andArntz,A.(1998).Theimpactofpersonalitydisordersontreatmentoutcomeofanxiety disorders: best-evidence synthesis. Behaviour Research and Therapy, 36, 483–504.","cites":null},{"id":891270,"title":"Cluster A personality disorder: a marker of worse treatment outcome of major depression?","authors":[],"date":"1994","doi":null,"raw":"Sato, T., Sakado, K., Sato, S. and Morikawa, T. (1994). Cluster A personality disorder: a marker of worse treatment outcome of major depression? Psychiatry Research, 53, 153–159.","cites":null},{"id":890737,"title":"Cluster B personality disorder characteristics predict outcome in the treatment of bulimia nervosa.","authors":[],"date":"1993","doi":null,"raw":"Rossiter, E. M., Agras, W. S., Telch, C. F. and Schneider, J. A. (1993). Cluster B personality disorder characteristics predict outcome in the treatment of bulimia nervosa. International Journal of Eating Disorders, 13, 349–357. Safran,J.D.andMuran,J.C.(2000).NegotiatingtheTherapeuticAlliance.NewYork:GuilfordPress.","cites":null},{"id":893241,"title":"Cluster C personality disorder impedes alleviation of symptoms in major depression.","authors":[],"date":"2002","doi":"10.1016\/S0165-0327(01)00412-8","raw":"Viinamaki, H., Hintikka, J., Honkalampi, K., Koivumaa-Honkanen, H., Kuisma, S., Antikainen, R., Tanskanen, A. and Lehtonen, J. (2002). Cluster C personality disorder impedes alleviation of symptoms in major depression. Journal of Affective Disorders, 71, 35–41.","cites":null},{"id":884984,"title":"Comorbidity among anxiety disorders: implications for treatment and DSM-IV.","authors":[],"date":"1992","doi":null,"raw":"Brown, T. A. and Barlow, D. H. (1992). Comorbidity among anxiety disorders: implications for treatment and DSM-IV. Journal of Consulting and Clinical Psychology, 60, 835–844.","cites":null},{"id":891519,"title":"Comorbidity of personality disorders and depression: implications for treatment.","authors":[],"date":"1992","doi":null,"raw":"Shea, M. T., Widiger, T. A. and Klein, M. H. (1992). Comorbidity of personality disorders and depression: implications for treatment. Journal of Consulting and Clinical Psychology, 60, 857– 868.","cites":null},{"id":893514,"title":"Contemporary practices of psychological assessment by clinical psychologists.","authors":[],"date":"1995","doi":"10.1037\/0735-7028.26.1.54","raw":"Watkins, C. E., Campbell, V., Neidberding, R. and Hallmark, R. (1995). Contemporary practices of psychological assessment by clinical psychologists. Professional Psychology, 26, 54–60.","cites":null},{"id":894223,"title":"Diagnosis of personality disorders by the Millon Clinical Multiaxial Inventory.","authors":[],"date":"1990","doi":"10.1097\/00005053-199004000-00008","raw":"Wetzler, S. and Dubro, A. (1990). Diagnosis of personality disorders by the Millon Clinical Multiaxial Inventory. Journal of Nervous and Mental Disease, 178, 261–263.","cites":null},{"id":884479,"title":"Distinctive activities of cognitive-behavioral therapy. A review of the comparative psychotherapy process literature.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":16711267,"title":"Distinctive activities of cognitive-behavioral therapy. A reviewofthecomparativepsychotherapyprocessliterature.ClinicalPsychologyReview,22,671–706.","authors":[],"date":"2002","doi":null,"raw":"Blagys, M. D. and Hilsenroth, M. J. (2002). Distinctive activities of cognitive-behavioral therapy. A reviewofthecomparativepsychotherapyprocessliterature.ClinicalPsychologyReview,22,671–706.","cites":null},{"id":889009,"title":"Effectiveness of cognitive therapy for depression in a community mental health center: a benchmarking study.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":885799,"title":"Factor structure of the MCMI-III.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":886312,"title":"Is electroconvulsive therapy effective for the depressed patient with comorbid borderline personality disorder?","authors":[],"date":"2001","doi":null,"raw":"DeBattista, C. and Mueller, K. (2001). Is electroconvulsive therapy effective for the depressed patient with comorbid borderline personality disorder? Journal of ECT, 17, 91–98.","cites":null},{"id":891019,"title":"Negotiating the Therapeutic Alliance.","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":892399,"title":"New developments in cognitive-behavioural case formulation. Epidemiological, systemic and social context: an integrative approach.","authors":[],"date":"2002","doi":"10.1017\/S1352465802003065","raw":"Tarrier, N. and Calam, R. (2002). New developments in cognitive-behavioural case formulation. Epidemiological, systemic and social context: an integrative approach. Behavioural and Cognitive Psychotherapy, 30, 311–328.","cites":null},{"id":891855,"title":"Personality disorder and clinical syndrome factors of MCMI-II scales.","authors":[],"date":"1992","doi":null,"raw":"Strack, S., Lorr, M., Campbell, L. and Lamnin, A. (1992). Personality disorder and clinical syndrome factors of MCMI-II scales. Journal of Personality Disorder, 6, 40–52.","cites":null},{"id":888438,"title":"Personality disorder, primary care counselling and therapeutic effectiveness.","authors":[],"date":"2002","doi":null,"raw":"Howey, L. and Ormrod, J. (2002). Personality disorder, primary care counselling and therapeutic effectiveness. Journal of Mental Health, 11, 131–139. Kuyken,W.,Kurzer,N.,DeRubeis,R.J.,Beck,A.T.andBrown,G.K.(2001).Responsetocognitive therapy in depression: the role of maladaptive beliefs and personality disorders. Journal of Consulting and Clinical Psychology, 69, 560–566. Merrill,K.A.,Tolbert,V.E.andWade,W.A.(2003).Effectivenessofcognitivetherapyfordepression in a community mental health center: a benchmarking study. Journal of Consulting and Clinical Psychology, 71, 404–409.","cites":null},{"id":887350,"title":"Personality disorders do not influence the results of cognitive behavior therapies for anxiety disorders.","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":16711287,"title":"Personality disorders do not inﬂuence the results of cognitive behavior therapies for anxiety disorders. Comprehensive Psychiatry, 35, 265–274.Personality disorder in primary care","authors":[],"date":"1994","doi":null,"raw":"Dreessen, L., Arntz, A., Luttels, C. and Sallaerts, S. (1994). Personality disorders do not inﬂuence the results of cognitive behavior therapies for anxiety disorders. Comprehensive Psychiatry, 35, 265–274.Personality disorder in primary care 463 Dreessen, L., Hoekstra, R. and Arntz, A. (1997). Personality disorders do not inﬂuence the results of cognitive and behavior therapy for obsessive compulsive disorder. Journal of Anxiety Disorders, 11, 503–521.","cites":null},{"id":887090,"title":"Personality disorders have no excessively negative impact on therapist-rated therapy process in the cognitive and behavioural treatment of Axis I anxiety disorders.","authors":[],"date":"1999","doi":null,"raw":"Dreessen, L. and Arntz, A. (1999). Personality disorders have no excessively negative impact on therapist-rated therapy process in the cognitive and behavioural treatment of Axis I anxiety disorders. Clinical Psychology and Psychotherapy, 6, 384–399.","cites":null},{"id":889564,"title":"Personality pathology and treatment outcome in major depression: a review.","authors":[],"date":"2002","doi":null,"raw":"Mulder, R. T. (2002). Personality pathology and treatment outcome in major depression: a review.","cites":null},{"id":886060,"title":"Prediction of outcome and early vs. late improvement in OCD patients treated with cognitive behaviour therapy and pharmacotherapy.","authors":[],"date":"1997","doi":null,"raw":"de Haan, E., van Oppen, P., van Balkom, A. J., Spinhoven, P., Hoogduin, K. A. and Van Dyck, R. (1997). Prediction of outcome and early vs. late improvement in OCD patients treated with cognitive behaviour therapy and pharmacotherapy. Acta Psychiatrica Scandinavia, 96, 354–361.","cites":null},{"id":885496,"title":"Predictors of response to cognitive-behavioral group therapy for social phobia.","authors":[],"date":"1997","doi":null,"raw":"Chambless, D. L., Tran, G. Q. and Glass, C. R. (1997). Predictors of response to cognitive-behavioral group therapy for social phobia. Journal of Anxiety Disorders, 11, 221–240. Craig,R.J .andBivens,A.(1998).FactorstructureoftheMCMI-III.JournalofPersonalityAssessment, 70, 190–196.","cites":null},{"id":884686,"title":"Psychological test use in criminal forensic evaluation.","authors":[],"date":"1995","doi":null,"raw":"Borum, R. and Grisso, T. (1995). Psychological test use in criminal forensic evaluation. Professional Psychology 26, 465–473.","cites":null},{"id":888730,"title":"Response to cognitive therapy in depression: the role of maladaptive beliefs and personality disorders.","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":888136,"title":"Structured Clinical Interview for DSM-IV Personality Disorders,","authors":[],"date":"1997","doi":null,"raw":"First, M. B., Spitzer, R. L., Gibbon, M. and Williams, J. B. (1997). Structured Clinical Interview for DSM-IV Personality Disorders, (SCID-II). Washington, DC: American Psychiatric Press.","cites":null},{"id":892735,"title":"The assessment of personality disorders: implications for cognitive and behavior therapy.","authors":[],"date":"1996","doi":"10.1016\/0005-7967(96)00026-5","raw":null,"cites":null},{"id":890399,"title":"The diagnosis of personality disorder: a comparison of MMPI proﬁle, Million Inventory, and clinical judgment in a Workers’ Compensation population.","authors":[],"date":"1985","doi":null,"raw":"Repko, G. R. and Cooper, R. (1985). The diagnosis of personality disorder: a comparison of MMPI proﬁle, Million Inventory, and clinical judgment in a Workers’ Compensation population. Journal of Clinical Psychology, 41, 867–881.","cites":null},{"id":893690,"title":"The epidemiology of personality disorders. In","authors":[],"date":"1993","doi":null,"raw":"Weissman, M. M. (1993). The epidemiology of personality disorders. In R. Michels (Ed.), Psychiatry. Philadelphia: Lippincott.","cites":null},{"id":892967,"title":"The impact of personality disorders on behavioral treatment outcome for social phobia.","authors":[],"date":"1997","doi":"10.1016\/S0005-7967(97)00052-1","raw":"van Velzen, C. J., Emmelkamp, P. M. and Scholing, A. (1997). The impact of personality disorders on behavioral treatment outcome for social phobia. Behaviour Research and Therapy, 35, 889–900.","cites":null},{"id":886839,"title":"The impact of personality disorders on treatment outcome of anxiety disorders: best-evidence synthesis.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":889868,"title":"The MCMI as a measure of DSM-III Axis II diagnoses: an empirical comparison.","authors":[],"date":"1987","doi":null,"raw":null,"cites":null},{"id":890120,"title":"The MCMI as a predictor of DSM-III diagnostic categories: a review of the empirical research. In","authors":[],"date":"1993","doi":null,"raw":"Piersma, H. L. (1993). The MCMI as a predictor of DSM-III diagnostic categories: a review of the empirical research. In R. J. Craig (Ed.), The Millon Multiaxial Clinical Inventory. Hillsdale, NJ: Lawrence Erlbaum.","cites":null},{"id":893956,"title":"The Millon Clinical Multiaxial Inventory (MCMI): a review.","authors":[],"date":"1990","doi":"10.1207\/s15327752jpa5503&4_5","raw":"Wetzler, S. (1990). The Millon Clinical Multiaxial Inventory (MCMI): a review. Journal of Personality Assessment, 55, 445–464.","cites":null},{"id":889286,"title":"The prevalence of personality disorder among UK primary care attenders.","authors":[],"date":"2000","doi":null,"raw":"Moran, P., Jenkins, R., Tylee, A., Blizard, R. and Mann, A. (2000). The prevalence of personality disorder among UK primary care attenders. Acta Psychiatrica Scandinavia, 102, 52–57.","cites":null},{"id":892484,"title":"The relationship between the MCMI personality scales and DSM-III, axis II.","authors":[],"date":"1990","doi":"10.1207\/s15327752jpa5503&4_27","raw":"Torgersen, S. and Alnaes, R. (1990). The relationship between the MCMI personality scales and DSM-III, axis II. Journal of Personality Assessment, 55, 698–707. VanVelzen,C.J.andEmmelkamp,P.M.(1996).Theassessmentofpersonalitydisorders:implications for cognitive and behavior therapy. Behaviour Research and Therapy, 34, 655–668.","cites":null},{"id":885243,"title":"Therapeutic empathy and recovery from depression in cognitive-behavioral therapy: a structural equation model.","authors":[],"date":"1992","doi":null,"raw":"Burns, D. D. and Nolen-Hoeksema, S. (1992). Therapeutic empathy and recovery from depression in cognitive-behavioral therapy: a structural equation model. Journal of Consulting and Clinical Psychology, 60, 441–449.","cites":null},{"id":892100,"title":"Using Multivariate Statistics.","authors":[],"date":"2001","doi":null,"raw":"Tabachnik, B. G. and Fidell, L. S. (2001). Using Multivariate Statistics. Needham Heights, MA: Allyn & Bacon.464 S. Jones et al.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-10","abstract":"Assessment and treatment of personality disorder (PD) is a key issue in UK mental health service provision (NIMH report, 2003), but there is limited information on individuals with personality disorder presenting to primary care mental health services. This study investigates the characteristics of PD in individuals receiving cognitive behaviour therapy (CBT) following GP referral and its relationship with therapist ratings of treatment process and outcome. One hundred and forty-eight participants completed the Millon Multiaxial Clinical Inventory (MCMI-III: Millon, Davis and Millon, 1997). Therapists completed a measure of therapy process and outcome (TPOQ) on 100 participants. Key therapy and process questions were answered for 60 participants who attended a minimum of five therapy sessions. MCMI-III indicated a rate of PD of 56.4%. Factor analysis of PD scales identified two factors: inward looking\/emotionally distanced, and aggressive\/acting out. For clinical syndromes (CLS), the factors were general psychopathology and substance abuse. TPOQ had two factors: therapeutic alliance and complexity in therapy. Regression analyses indicated that only those PDs contributing to the inward looking\/emotionally distanced scale score were associated with therapeutic alliance problems. Conversely, complexity in therapy was only predicted by general psychopathology and not by personality disorder. This study identified high rates of personality disorder in primary care referrals to a clinical psychology service. It also indicated that relationships between the presence of personality disorder and therapist ratings of treatment difficulties were only associated with certain types of personality disorder. These findings are discussed in relation to service and therapy planning in mental health","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68622.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/31925\/1\/download1.pdf","pdfHashValue":"977020cb4a6336b1da2ef31b22d3d0fff21d6397","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:31925<\/identifier><datestamp>\n      2018-01-24T02:57:22Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D52:5231<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Personality disorder in primary care : factors associated with therapy process and outcome.<\/dc:title><dc:creator>\n        Jones, Steven H.<\/dc:creator><dc:creator>\n        Burrell-Hodgson, Gerrard<\/dc:creator><dc:creator>\n        Tate, Graham<\/dc:creator><dc:creator>\n        Fowler, Barry<\/dc:creator><dc:subject>\n        R Medicine (General)<\/dc:subject><dc:description>\n        Assessment and treatment of personality disorder (PD) is a key issue in UK mental health service provision (NIMH report, 2003), but there is limited information on individuals with personality disorder presenting to primary care mental health services. This study investigates the characteristics of PD in individuals receiving cognitive behaviour therapy (CBT) following GP referral and its relationship with therapist ratings of treatment process and outcome. One hundred and forty-eight participants completed the Millon Multiaxial Clinical Inventory (MCMI-III: Millon, Davis and Millon, 1997). Therapists completed a measure of therapy process and outcome (TPOQ) on 100 participants. Key therapy and process questions were answered for 60 participants who attended a minimum of five therapy sessions. MCMI-III indicated a rate of PD of 56.4%. Factor analysis of PD scales identified two factors: inward looking\/emotionally distanced, and aggressive\/acting out. For clinical syndromes (CLS), the factors were general psychopathology and substance abuse. TPOQ had two factors: therapeutic alliance and complexity in therapy. Regression analyses indicated that only those PDs contributing to the inward looking\/emotionally distanced scale score were associated with therapeutic alliance problems. Conversely, complexity in therapy was only predicted by general psychopathology and not by personality disorder. This study identified high rates of personality disorder in primary care referrals to a clinical psychology service. It also indicated that relationships between the presence of personality disorder and therapist ratings of treatment difficulties were only associated with certain types of personality disorder. These findings are discussed in relation to service and therapy planning in mental health.<\/dc:description><dc:date>\n        2006-10<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31925\/1\/download1.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S135246580600302X<\/dc:relation><dc:identifier>\n        Jones, Steven H. and Burrell-Hodgson, Gerrard and Tate, Graham and Fowler, Barry (2006) Personality disorder in primary care : factors associated with therapy process and outcome. Behavioural and Cognitive Psychotherapy, 34 (4). pp. 453-466. ISSN 1352-4658<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/31925\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S135246580600302X","http:\/\/eprints.lancs.ac.uk\/31925\/"],"year":2006,"topics":["R Medicine (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"Behavioural and Cognitive Psychotherapy, 2006, 34, 453–466\nPrinted in the United Kingdom doi:10.1017\/S135246580600302X\nPersonality Disorder in Primary Care: Factors Associated\nwith Therapist Views of Process and Outcome\nSteven Jones\nUniversity of Manchester, UK\nGerrard Burrell-Hodgson, Graham Tate and Barry Fowler\nPennine Care Trust, UK\nAbstract. Assessment and treatment of personality disorder (PD) is a key issue in UK\nmental health service provision (NIMH report, 2003), but there is limited information on\nindividuals with personality disorder presenting to primary care mental health services. This\nstudy investigates the characteristics of PD in individuals receiving cognitive behaviour therapy\n(CBT) following GP referral and its relationship with therapist ratings of treatment process and\noutcome. One hundred and forty-eight participants completed the Millon Multiaxial Clinical\nInventory (MCMI-III: Millon, Davis and Millon, 1997). Therapists completed a measure of\ntherapy process and outcome (TPOQ) on 100 participants. Key therapy and process questions\nwere answered for 60 participants who attended a minimum of five therapy sessions. MCMI-\nIII indicated a rate of PD of 56.4%. Factor analysis of PD scales identified two factors:\ninward looking\/emotionally distanced, and aggressive\/acting out. For clinical syndromes\n(CLS), the factors were general psychopathology and substance abuse. TPOQ had two factors:\ntherapeutic alliance and complexity in therapy. Regression analyses indicated that only those\nPDs contributing to the inward looking\/emotionally distanced scale score were associated\nwith therapeutic alliance problems. Conversely, complexity in therapy was only predicted by\ngeneral psychopathology and not by personality disorder. This study identified high rates of\npersonality disorder in primary care referrals to a clinical psychology service. It also indicated\nthat relationships between the presence of personality disorder and therapist ratings of treatment\ndifficulties were only associated with certain types of personality disorder. These findings are\ndiscussed in relation to service and therapy planning in mental health.\nKeywords: Personality disorder, primary care, clinical psychology, therapy outcome.\nIntroduction\nThe National Institute for Mental Health in England document, Personality Disorder: no\nlonger a diagnosis of exclusion (2003), identifies that people with personality disorder (PD)\nmake heavy, often escalating, demands that local services are often ill equipped to deal with.\nReprint requests to Steven H. Jones, University of Manchester, School of Psychology Sciences, Division of\nClinical Psychology, Second Floor, Zochonis Building, Brunswick Street, Manchester M13 9PL, UK. E-mail:\nsteven.jones@manchester.ac.uk\n© 2006 British Association for Behavioural and Cognitive Psychotherapies\n454 S. Jones et al.\nIt aims to address the issues of access to appropriate clinical care and management for PD and\nthe need to establish education and training to provide effective assessment and management.\nAlthough much research and service provision for PD is in secondary and tertiary care, PD\nis common in primary mental health and medical services. Weissman estimated 10–13% of\na community sample met criteria for PD (Weissman, 1993). In primary health care, Moran\nfound 24% of patients met criteria for PD according to informant interviews (Moran, Jenkins,\nTylee, Blizard and Mann, 2000). Moreover, Howey and Ormrod reported 50% of primary care\ncounselling patients met PD criteria on a self-report measure (Howey and Ormrod, 2002),\nwhilst a report from the UK Department of Health for 2000–2001 noted 76,300 referrals to\nClinical Psychology Departments in England (DoH, 2001). These figures indicate that the vast\nmajority of people with PD will not be seen by specialist PD services.\nOne way to obtain information concerning patterns of PD in such services is through\nself-report measures, which are typically used as screening tools rather than as formal\npsychiatric diagnostic instruments. Self-report measures are more practical in clinical practice\nthan structured clinical interviews, such as the Structured Clinical Interview for DSM-IV\nPersonality Disorders, (SCID-II: First, Spitzer, Gibbon and Williams, 1997). The Millon\nClinical Multiaxial Inventory (MCMI-III: Millon et al., 1997) is a self-report measure that\nassesses personality disorder (PD) and clinical syndromes (CLS) and is widely used in both\nclinical and forensic settings (Borum and Grisso, 1995; Watkins, Campbell, Neidberding and\nHallmark, 1995). Comparisons of MCMI with clinician diagnoses indicate elevated rates of PD\nin the former (Repko and Cooper, 1985; Piersma, 1987; Wetzler and Dubro, 1990). However,\ncomparison of MCMI with structured clinical interview indicates higher rates of agreement\n(Wetzler, 1990). Dubro and colleagues (Dubro et al., 1988) reported moderate sensitivity and\nspecificity for MCMI compared to the Structured Interview for DSM-III PD (SIDP). Torgersen\ncompared SIDP with MCMI, finding significant agreement for 5\/8 PD scales (Torgersen and\nAlnaes, 1990). Piersma suggested the MCMI falls between structured clinical interviews and\nunstructured interviews in diagnostic reliability (Piersma, 1993). MCMI may therefore have\nmerit as a screening measure to identify patterns of PD within particular samples.\nSince MCMI-III generates 14 different possible PD categories, factor analysis provides\na data reduction strategy for the comparison of PD with other variables. Studies using the\nMCMI-III indicate that PD is multi-factorial (Retzlaff, Lorr, Hyer and Ofman, 1991; Strack,\nLorr, Campbell and Lamin, 1992; Craig and Bivens, 1998). A number of studies have in\nparticular investigated the factor structures of the PD and CLS scales separately, reporting\ndifferent numbers of factors for MCMI-I and II (Retzlaff et al., 1991; Strack et al., 1992).\nNo studies have investigated the factor structure of these MCMI-III scales in a UK group of\npatients referred by GP for cognitive therapy treatment (CBT).\nA further issue is the clinical importance of PD in therapy outcomes. Some efficacy studies\nof psychological and psychiatric treatment indicate that the presence of PD in general is\nassociated with poorer treatment outcomes compared to participants who only have a CLS\n(Fals-Stewart and Lucente, 1993; Chambless, Tran and Glass, 1997; de Haan et al., 1997;\nDeBattista and Mueller, 2001; Merrill, Tolbert and Wade, 2003). However, the reasons for these\ndifferences have not yet been clearly established (Sato, Sakado, Sato and Morikawa, 1994;\nVan Velzen and Emmelkamp, 1996; Viinamaki et al., 2002). These differential outcomes have\nbeen explained as either a failure to respond therapeutically or an artefact of the more severe\nclinical state of individuals with co-morbid PD. Arntz and colleagues argue such individuals\nshow equivalent response to therapy as those with CLSs alone (Dreessen, Arntz, Luttels and\nPersonality disorder in primary care 455\nSallaerts, 1994; Dreessen, Hoekstra and Arntz, 1997), but remain more disabled after therapy\ndue to the severity of their initial CLS (van Velzen, Emmelkamp and Scholing, 1997). Dreessen\nreported, for anxiety disorders, that clinician ratings of therapy process were more strongly\nrelated to therapist than independent evaluations of PD (Dreessen and Arntz, 1999).\nMany of these studies have only looked at a limited range of PDs. It could be argued that such\nstudies fail to address the central question of whether it is the presence of PD per se, or specific\nPD categories that are associated with particular outcomes. This study aims to investigate\nPD in a sample more representative of routine clinical practice; namely, primary care mental\nhealth. In particular, initial data on the factor structure of the MCMI-III, specifically for PD and\nCLS scales, are presented. This study also aims to assess whether the presence of PD per se,\nor specific PD categories, are associated with therapy outcomes in CBT patients. This will\nbe achieved by investigating associations between PD (assessed by MCMI-III) and treatment\ndifficulties (indicated by a brief clinician report measure practical for everyday clinical use\nwhich was developed for this study).\nMethod\nParticipants and procedure\nParticipants were 148 (60 male: 88 female) GP referrals of mean age 39.3 years (SD 12.5) to\na UK NHS clinical psychology service for CBT. Most participants were experiencing anxiety\nor depression (73.2%); the remainder had anger, bereavement or adjustment problems. One\nparticipant had a referral explicitly indicating the presence of a PD. All were referred over a\n6-month period. Participants completed MCMI-III at initial assessment and clinicians\ncompleted the Therapy Process and Outcome Questionnaire (TPOQ), following completion of\ntherapy. Clinicians completed TPOQ on the basis of case-note information, blind to MCMI-\nIII data that was kept and scored independently. All clinicians were British Association of\nBehavioural and Cognitive Psychotherapy accredited CBT therapists. One participant did not\ncomplete MCM-III (due to inebriation and anger problems) and did not attend subsequently.\nAll other attenders completed the MCMI-III. TPOQs were administered to 100 participants\n(TPOQ was unavailable for use with the first 48 participants) once the case was closed. Key\ntherapy and process questions were answered for those who attended for a course of treatment\n(N = 60). Initial indications from this relatively small sample are that internal reliability is high\n(alpha = 0.88) and test-retest reliability, over a period of 8–12 weeks, is moderate (rho = 0.46,\np < .02).\nTest instruments\nMCMI-III is a 175-item true-false self-report questionnaire which assesses 14 PD and 10 CLS\ncategories (see Table 1). This measure has been identified as being internally consistent and\nreliable (Millon et al., 1997). TPOQ (Appendix 1) was developed as a practical clinician\nrated tool for use with primary care clients. We are not aware of any other clinician rated\nmeasure specifically developed for this purpose. The TPOQ examines whether individuals had\nattended for a course of treatment (at least five sessions), how many sessions were attended,\nand whether on the basis of clinical interview the clinician thought that the person had a PD,\nand if so of what type (following the categories used in the MCMI-III questionnaire). If the\n456 S. Jones et al.\nTable 1. List of scales contained within Millon’s MCMI-III\nPersonality disorders\n1. Schizoid\n2. Avoidant\n3. Depressive\n4. Dependent\n5. Histrionic\n6. Narcissistic\n7. Antisocial\n8. Sadistic\n9. Compulsive\n10. Negativistic\n11. Masochistic\n12. Schizotypal\n13. Borderline\n14. Paranoid\nClinical syndromes\n1. Anxiety\n2. Somatoform\n3. Bipolar\n4. Dysthymia\n5. Alcohol dependence\n6. Drug dependence\n7. Post-traumatic stress disorder\n8. Thought disorder\n9. Major depression\n10. Delusional disorder\nclient had finished therapy or attended for at least five sessions then the additional questions\ndetailed below were also completed. Seven key items were rated by the clinician each on a\n5-point scale. Higher score indicates better outcome, alliance, engagement or psychological\nmindedness for items 1–4: higher scores for items 5–7 indicates fewer problems or revisions\nrequired. TPOQ items: 1) Therapy outcome; 2) Working alliance with patient; 3) Motivation\nto engage; 4) Psychological mindedness; 5) Need to revise formulation during therapy; 6)\nNeed to revise treatment plan during therapy; 7) Problems in therapy.\nItems were defined on the basis of consensus agreement between six BABCP accredited\nCBT therapists on key issues in process and outcome for CBT, reflecting key tasks in CBT\n(Blagys and Hilsenroth, 2002; Tarrier and Calam, 2002).\nResults\nNo invalid Millon questionnaires were returned; 56.4% of participants met MCMI-III criteria\nfor at least one PD and 30.9% for two or more. Depressive (30.9%), Dependent (23.5%) and\nAvoidant (19.5%) were the most common diagnoses obtained. MCMI-III indicated that 62.4%\nof the sample met criteria for at least one CLS and 39.6% for two or more. Anxiety (43.0%),\nMajor Depression (26.8%) and Dysthymia (18.1%) were the most common diagnoses.\nPersonality disorder in primary care 457\nTable 2A. Separate personality disorder (PD) rotated factor loadings for MCMI-III\nFactor 1 Factor 2\nSchizoid (1) 0.71 0.23\nAvoidant (2A) 0.88 0.00\nDepressive (2B) 0.71 0.15\nDependent (3) 0.63 0.26\nHistrionic (4) −0.83 0.00\nNarcissistic (5) −0.79 0.19\nAntisocial (6A) 0.00 0.85\nAggressive\/sadistic (6B) 0.00 0.84\nCompulsive (7) 0.00 −0.69\nPassive-aggressive (8A) 0.41 0.77\nSelf-defeating (8B) 0.73 0.36\nSchizotypal (S) 0.60 0.49\nBorderline (C) 0.45 0.76\nParanoid (P) 0.49 0.52\nVariance % 36.0 27.8\nFactor analysis of MCMI-III\nPrinciple component analyses were undertaken separately for PD and CLS, to identify factor\nstructures and assess how factors related to therapists’ TPOQ ratings. Scree plots indicated the\nfactors to be entered into varimax rotation; eigen values and factor loadings are reported. In all\ncases data met the Kaiser-Meyer-Olkin measure of sampling adequacy (>0.85) and Bartlett’s\ntest of sphericity (p < .01). Loadings >0.50 are discussed to allow clear interpretation of\nfactors with only modest overlapping variance (Tabachnik and Fidell, 2001).\nFactor analysis of PD scale alone. Two factors were identified for the MCMI-III PD\nscale (see Table 2A). Factor 1 (inward looking\/emotionally distanced: eigen value 5.00,\nPVA 35.7) has high positive loadings for Avoidant, Depressive, Schizoid, Self-defeating and\nSchizotypal PD. Strong negative loadings were obtained for Narcissistic and Histrionic PD.\nFactor 2 (aggressive\/acting; eigen value 3.89, PVA 27.8) has a high positive loading for\nAntisocial, Aggressive, Passive-aggressive, and Borderline PD and a strong negative loading\nfor Compulsive PD.\nFactor analysis of CLS scale alone. For CLS there were also two factors identified\n(see Table 2B). Factor 1 (general psychopathology; eigen value 4.42, PVA 44.2) contains\nhigh loadings for Anxiety, Somatoform, Dysthymic, PTSD, Major Depression and Thought\ndisorder. Factor 2 (substance abuse; eigen value 2.29, PVA 22.9) has loadings for Alcohol and\nDrug Dependency and a smaller loading for Bipolar.\nRelationship between MCMI and TPOQ\nFactor analysis of TPOQ. Factor analysis was also undertaken as a data reduction strategy\non the TPOQ. Factor loadings are reported after varimax rotation, in Table 3A. Data met the\nKaiser-Meyer-Olkin measure of sampling adequacy (>0.69) and Bartlett’s test of sphericity\n(p < .01). Factor 1 (therapeutic alliance; eigen value 3.9, PVA 55.4) has high positive factor\nloadings for outcome, bond, engagement and insight. Factor 2 (low complexity in therapy;\n458 S. Jones et al.\nTable 2B. Separate clinical syndrome (CLS) rotated factor loadings for MCMI-III\nFactor 1 Factor 2\nAnxiety (A) 0.75 0.12\nSomatoform (H) 0.78 0.00\nBipolar: Manic (N) 0.50 0.64\nDysthymic 0.84 0.30\nAlcohol dependence 0.00 0.87\nDrug dependence 0.00 0.86\nPost-traumatic stress 0.78 0.24\nThought disorder 0.84 0.23\nMajor depression 0.87 0.12\nDelusional disorder 0.46 0.39\n% Variance 44.2 22.9\nSignificant factor loadings are in bold.\nTable 3A. Rotated factor loadings for therapy process and outcome questionnaire\nFactor 1 Factor 2\nOutcome 0.66 0.46\nBond 0.91 0.00\nEngagement 0.93 0.00\nInsight 0.83 0.19\nModifications 0.00 0.92\nRevision 0.00 0.94\nProblems 0.48 0.69\n% Variance 55.4 23.5\nSignificant factor loadings are in bold.\neigen value 1.7, PVA 23.5) has high positive factor loadings for modifications, revisions and\nproblems in therapy.\nRelationships between MCMI-III and TPOQ scale scores\nA correlation matrix (Table 3B) was drawn up to illustrate relationships between MCMI-III\nand TPOQ scale scores generated by combining scores from variables contributing to the\nrespective factors identified above. This indicated significant negative relationships between\nboth TPOQ scale scores and the Inward looking\/emotionally distanced PD scale score. A\nsimilar pattern was observed between both TPOQ scale scores and CLS scale score 1 (General\npsychopathology).\nThere are also significant correlations between MCMI-III scale scores. All multiple\nregressions were therefore subjected to multicollinearity diagnostics. Mutlicollinearity is\nindicated by a standardized conditioning index >30 and at least two variance proportions\nfor an individual variable >0.5 (Tabachnik and Fidell, 2001). In addition, although only\nbivariate correlations >0.9 cause statistical problems with regression, there may be problems\nwith inflation of error terms and weakened analysis at bivariate correlation above 0.7. Only\nPersonality disorder in primary care 459\nTable 3B. Correlations between MCMI-III and TPOQ factor scores, including histrionic, narcissistic\nand compulsive personality disorder\nPD\nFactor 1\nPD\nFactor 2\nCLS\nFactor 1\nCLS\nFactor 2\nTPOQ\nFactor 1\nTPOQ\nFactor 2\nInward looking\/emotionally\ndistanced (PD Factor 1)\nrsig 0.62\n0.01\n0.81\n0.01\n0.45\n0.00\n−.29\n.03\n−.33\n.01\nAggressive\/acting out\n(PD Factor 2)\nrsig 0.55\n0.01\n0.75\n0.00\n−.06\n.64\n−.23\n.09\nGeneral psychopathology\n(CLS Factor 1)\nrsig 0.43\n0.00\n−.27\n.04\n−.34\n.01\nSubstance abuse\n(CLS Factor 2)\nrsig −.22\n.10\n−.12\n.36\nTherapeutic alliance\n(TPOQ Factor 1)\nrsig 0.45\n0.01\nPD = Personality disorder; CLS = Clinical syndrome, TPOQ = Therapy process and Outcome\nquestionnaire, TPOQ Factor 2 = Low complexity in therapy\nTable 4. MCMI-III predictors of TPOQ factor score\nß T Significance\nTPOQ Factor 1 predictor\nPD F1 −.29 −2.30 <.03\nComposite 1 −.30 −2.37 <.02\nTPOQ Factor 2 predictor\nCLS F1 −.34 −2.67 <.01\nComposite 1 −.36 −2.91 <.01\nPD = Personality disorder; CLS = Clinical syndrome, PD F1 = Inward looking\/emotionally\ndistanced, CLS F1 = General psychopathology, Composite 1 = PD F1 and CLS F1 combined\nMCMI-III scale scores with significant bivariate correlations with respective TPOQ scores\nwere entered into the regression analyses.\nAs none of the correlations between the MCMI-III scale scores were >0.9, the initial\nregression employed was statistical regression with backward deletion in which MCMI-III\nscale scores are entered and then are deleted only if they do not contribute to the regression\nsignificantly. Table 4 indicates the standardized regression coefficients (ß), t values and\nsignificance levels for each significant independent variable. For TPOQ 1 both inward looking\nemotionally distanced PD and the general psychopathology CLS scale score were entered.\nR for the regression containing the two scale scores was not significant (p > .07). When\ngeneral psychopathology was deleted, R for the regression was significantly different from\nzero (F = 5.26 (1, 56), p < .03). Therefore only the inward looking\/emotionally distanced\nPD scale score was a significant predictor (p < .03), accounting for 8.7% of variability in\ntherapeutic alliance scores. Neither regression equation met criteria for multicollinearity.\nFor TPOQ scale score 2 the same variables were again entered. The initial regression model\nwas significant (F = 4.0 (2, 55), p < .03) but neither inward looking emotionally distanced\nPD or the general psychopathology CLS scale score were significant individual predictors.\n460 S. Jones et al.\nThe second model following backward deletion of inward looking emotionally distanced PD\nyielded R significantly above zero (F = 7.21, (1, 56), p < .01). The general psychopathology\nCLS scale score was significantly predictive (p < .01), accounting for 11.4 % of the variance\nin therapeutic complexity scores. In both cases, conditions for mutlicollinearity were not met.\nSince there may be error inflation when correlations between variables of 0.7 or greater\nare present, two composite variables were then constructed combining emotionally distanced\nPD and general psychopathology (Composite 1; r = 0.81) and aggressive\/acting out PD and\nsubstance abuse (Composite 2: r = 0.75). For both TPOQ scale scores only composite 1\nhad a significant bivariate correlation: TPOQ 1 (r = 0.30 p < .02), TPOQ 2 (r = 0.36,\np < .01). Bivariate correlations did not differ significantly from the correlations observed\nbetween inward looking\/emotionally distanced PD scale score and TPOQ 1 and general\npsychopathology CLS scale score and TPOQ 2 respectively (p > .1).\nTable 4 indicates the standardized regression coefficients (ß), t values and significance\nlevels for Composite 1 with respect to TPOQ 1 & 2. For TPOQ scale score 1 the regression\nequation containing Composite 1 was significantly different from zero (F = 5.60, (1, 56),\np < .02) with Composite 1 a significant individual predictor (p < .02) accounting for 9.1%\nof the variance in therapeutic alliance scores. For TPOQ scale score 2 the regression equation\ncontaining Composite 1 was significantly different from zero (F = 5.60, (1, 56), p < .02) with\nComposite 1 a significant individual predictor (p < .02) accounting for 11.6% of the variance\nin therapeutic complexity scores.\nDemographic and scale score comparisons between TPOQ groups\nWithin this study there are essentially three groups with respect to TPOQ. There are those\nfor whom there is no TPOQ data, those for whom there is no outcome TPOQ data (because\nthey did not complete therapy), and those for whom there is complete TPOQ outcome data. In\nterms of the generalizability of the regression results reported above it was important to assess\nwhether these groups differ in terms of demographic characteristics or scale scores. The first\ncomparison made was between individuals for whom there was some or full TPOQ information\nand those for whom there was none. There were no significant age or gender differences and\nno differences in PD or CLS scale scores. A second set of comparisons was made between\nthose for whom there was partial and those for whom there was full TPOQ information. This\nagain revealed no age or gender differences. There were also no differences on emotionally\ndistanced PD or general psychopathology CLS scale scores. There was a significant difference\nfor substance abuse CLS scale score (t = 2.17, p < .05) and for aggressive\/acting out PD (t =\n2.38, p < .05) with higher scores for partial completers in both cases. Neither of these scales\nwas significantly associated with outcome in the TPOQ analyses.\nDiscussion\nThere have been few studies to date that have investigated PD in primary care medical and\nmental health participants. This study focused on a sample of the latter group referred for\npsychological treatment, confirming previous reports of the high frequency of PD presentations\nto non-specialist services (Howey and Ormrod, 2002). Rates of PD were also similar to those\nof 30–60% comorbidity in larger US samples (Brown and Barlow, 1992; Shea, Widiger and\nKlein, 1992). These high rates underscore the importance of understanding more about PD\nPersonality disorder in primary care 461\nin these groups, whose presentation and outcome might be very different to those individuals\npresenting to specialist services.\nIdentification of PD is only significant for clinicians if it indicates something of importance\nabout therapy. This study therefore examined the relationship between PD and CLS and a\nmeasure of therapy process and outcome. Separate factor analyses were conducted for the two\nMillon scales. These led to two factor solutions in each case. For PD the factors were inward\nlooking\/emotionally distanced and aggressive\/acting out. For CLS the factors were general\npsychopathology and substance abuse. Interestingly, Safran and Muran have argued that there\nare two types of rupture in therapeutic alliance (withdrawal and confrontation) that appear to\nmap onto the two PD factors identified in the current study (Safran and Muran, 2000).\nThe TPOQ itself was found to have two factors, one measuring therapeutic alliance and the\nsecond measuring complexity in therapy. Regression analysis indicated that only those PDs\n(as identified by MCMI) that loaded on inward looking\/emotionally distanced scale score were\nassociated with therapeutic alliance problems. These were not predicted by other PDs or by\nCLSs. Importantly, complexity in therapy was only predicted by general psychopathology, but\nnot by either of the PD scale score scores. Previous research has shown that therapy outcomes\nfor a number of axis 1 disorders are not influenced by co-morbid PD (Dreessen and Arntz,\n1998; Kuyken, Kurzer, DeRubeis, Beck and Brown, 2001; Mulder, 2002). The present findings\nwith respect to low complexity appear to be consistent with this, although it is reasonable to\nassume that therapeutic outcomes will be dependent on both therapeutic alliance and low\ncomplexity, rather than either in isolation.\nThese findings suggest that different aspects of the therapy process are influenced by\ndifferent clinical features of the client. It also suggests that PD screening might have merit in\nhelping the CBT clinician to establish realistic targets for therapy. However, it should be noted\nthat interpretation of the regression analyses needs to be cautious in light of the correlations\nbetween PD and CLS scores. A composite variable combining inward looking PD and general\npsychopathology CLS was also associated with both TPOQ scale scores, although in neither\ncase was the bivariate relationship significantly higher than that reported for the individual\nscale scores discussed above.\nThis pattern of results indicates the importance of not assuming that PD is a unitary\nconstruct. Different aspects of PD were found to have different relationships with treatment\ncomplexity in the current study. This is consistent with previous research that has identified\nrelationships between particular PD clusters or types and therapeutic outcomes (Burns and\nNolen-Hoeksema, 1992; Rossiter, Agras, Telch and Schneider, 1993; Sato, Sakado, Sato\nand Morikawa, 1994; Viinamaki et al., 2002). It is also of note that the pattern of factors\nobserved in this sample is different from that observed in US studies using the MCMI (Retzlaff\net al., 1991; Strack et al., 1992; Craig and Bivens, 1998), which vary themselves in reporting\nbetween three and six personality factors. Clearly further studies in UK samples are needed to\nclarify whether this particular factor solution is stable for this client group.\nThe authors chose to use a self-report measure of PD for this study, to estimate PD rates\nacross a reasonably large sample. Although there are structured interview measures (e.g.\nSCID-II; First, Spitzer, Gibbon and Williams, 1997), these are much more time consuming\nand could not be realistically applied in clinical practice in a non-specialist setting. The present\nresults indicate that MCMI-III provides a useful estimate of PD across the current sample. In\naddition, this report also suggests that a simple measure of therapy process and outcome did\nappear to relate to MCMI-III scale scores. It also indicates that specific aspects of PD (namely\n462 S. Jones et al.\nan inward looking\/emotionally distanced scale score) are associated with significant difficulties\nin treatment in a heterogeneous clinical sample. In contrast, low therapeutic complexity is only\nassociated with general psychopathology, suggesting that the effects of PD are limited. Further\nresearch is needed to support these preliminary findings as well as to provide validation of\nthe TPOQ. In particular, future studies could usefully explore the relationships between the\nobserved Millon scale scores and client and independent raters’ views of therapy process and\noutcome.\nThis report extends the findings of previous studies that have tended to look within\ntreatment trials at the impact of PD (Van Velzen and Emmelkamp, 1996), rather than at “field\neffectiveness” (Storsahl, Hayes, Bergan and Romano, 1998), which is the primary concern of\npractising clinicians. Furthermore, it indicates that assumptions in the National Institute for\nMental Health in England document, Personality Disorder: no longer a diagnosis of exclusion\n(2003), might need to be viewed with some caution. For instance, the document proposes that\nPD treatment will require complex, multidisciplinary input. This may be the case in some\ninstances, but it behoves us as clinical scientists to identify which PDs in combination with\nwhich CLSs are likely to require this. Further research within primary care and non-specialist\nsettings is likely to be important in addressing this issue.\nReferences\nBlagys, M. D. and Hilsenroth, M. J. (2002). Distinctive activities of cognitive-behavioral therapy. A\nreview of the comparative psychotherapy process literature. Clinical Psychology Review, 22, 671–706.\nBorum, R. and Grisso, T. (1995). Psychological test use in criminal forensic evaluation. Professional\nPsychology 26, 465–473.\nBrown, T. A. and Barlow, D. H. (1992). Comorbidity among anxiety disorders: implications for\ntreatment and DSM-IV. Journal of Consulting and Clinical Psychology, 60, 835–844.\nBurns, D. D. and Nolen-Hoeksema, S. (1992). Therapeutic empathy and recovery from depression\nin cognitive-behavioral therapy: a structural equation model. Journal of Consulting and Clinical\nPsychology, 60, 441–449.\nChambless, D. L., Tran, G. Q. and Glass, C. R. (1997). Predictors of response to cognitive-behavioral\ngroup therapy for social phobia. Journal of Anxiety Disorders, 11, 221–240.\nCraig, R. J. and Bivens, A. (1998). Factor structure of the MCMI-III. Journal of Personality Assessment,\n70, 190–196.\nde Haan, E., van Oppen, P., van Balkom, A. J., Spinhoven, P., Hoogduin, K. A. and Van Dyck, R.\n(1997). Prediction of outcome and early vs. late improvement in OCD patients treated with cognitive\nbehaviour therapy and pharmacotherapy. Acta Psychiatrica Scandinavia, 96, 354–361.\nDeBattista, C. and Mueller, K. (2001). Is electroconvulsive therapy effective for the depressed patient\nwith comorbid borderline personality disorder? Journal of ECT, 17, 91–98.\nDoH (2001). Clinical Psychology Summary Information for 2000-01, England. London: Department of\nHealth.\nDreessen, L. and Arntz, A. (1998). The impact of personality disorders on treatment outcome of anxiety\ndisorders: best-evidence synthesis. Behaviour Research and Therapy, 36, 483–504.\nDreessen, L. and Arntz, A. (1999). Personality disorders have no excessively negative impact on\ntherapist-rated therapy process in the cognitive and behavioural treatment of Axis I anxiety disorders.\nClinical Psychology and Psychotherapy, 6, 384–399.\nDreessen, L., Arntz, A., Luttels, C. and Sallaerts, S. (1994). Personality disorders do not influence the\nresults of cognitive behavior therapies for anxiety disorders. Comprehensive Psychiatry, 35, 265–274.\nPersonality disorder in primary care 463\nDreessen, L., Hoekstra, R. and Arntz, A. (1997). Personality disorders do not influence the results of\ncognitive and behavior therapy for obsessive compulsive disorder. Journal of Anxiety Disorders, 11,\n503–521.\nDubro, A., Wetzler, S. and Khan, M. (1988). A comparison of three self-report questionnaires for the\ndiagnosis of DSM-III disorders. Journal of Personality Disorders, 2, 185–189.\nFals-Stewart, W. and Lucente, S. (1993). An MCMI cluster typology of obsessive-compulsives: a\nmeasure of personality characteristics and its relationship to treatment participation, compliance and\noutcome in behavior therapy. Journal of Psychiatry Research, 27, 139–154.\nFirst, M. B., Spitzer, R. L., Gibbon, M. and Williams, J. B. (1997). Structured Clinical Interview for\nDSM-IV Personality Disorders, (SCID-II). Washington, DC: American Psychiatric Press.\nHowey, L. and Ormrod, J. (2002). Personality disorder, primary care counselling and therapeutic\neffectiveness. Journal of Mental Health, 11, 131–139.\nKuyken, W., Kurzer, N., DeRubeis, R. J., Beck, A. T. and Brown, G. K. (2001). Response to cognitive\ntherapy in depression: the role of maladaptive beliefs and personality disorders. Journal of Consulting\nand Clinical Psychology, 69, 560–566.\nMerrill, K. A., Tolbert, V. E. and Wade, W. A. (2003). Effectiveness of cognitive therapy for depression\nin a community mental health center: a benchmarking study. Journal of Consulting and Clinical\nPsychology, 71, 404–409.\nMillon, T. E., Davis, R. and Millon, C. (1997). The Millon Multiaxial Clinical Inventory-III.\nMinneapolis: Computer Systems Inc.\nMoran, P., Jenkins, R., Tylee, A., Blizard, R. and Mann, A. (2000). The prevalence of personality\ndisorder among UK primary care attenders. Acta Psychiatrica Scandinavia, 102, 52–57.\nMulder, R. T. (2002). Personality pathology and treatment outcome in major depression: a review.\nAmerican Journal of Psychiatry, 159, 359–371.\nPiersma, H. L. (1987). The MCMI as a measure of DSM-III Axis II diagnoses: an empirical comparison.\nJournal of Clinical Psychology, 43, 478–483.\nPiersma, H. L. (1993). The MCMI as a predictor of DSM-III diagnostic categories: a review of the\nempirical research. In R. J. Craig (Ed.), The Millon Multiaxial Clinical Inventory. Hillsdale, NJ:\nLawrence Erlbaum.\nRepko, G. R. and Cooper, R. (1985). The diagnosis of personality disorder: a comparison of MMPI\nprofile, Million Inventory, and clinical judgment in a Workers’ Compensation population. Journal of\nClinical Psychology, 41, 867–881.\nRetzlaff, P. D., Lorr, M., Hyer, L. and Ofman, P. (1991). An MCMI-II item-level component analysis:\npersonality and clinical factors. Journal of Personality Assessment, 57, 323–334.\nRossiter, E. M., Agras, W. S., Telch, C. F. and Schneider, J. A. (1993). Cluster B personality disorder\ncharacteristics predict outcome in the treatment of bulimia nervosa. International Journal of Eating\nDisorders, 13, 349–357.\nSafran, J. D. and Muran, J. C. (2000). Negotiating the Therapeutic Alliance. New York: Guilford Press.\nSato, T., Sakado, K., Sato, S. and Morikawa, T. (1994). Cluster A personality disorder: a marker of\nworse treatment outcome of major depression? Psychiatry Research, 53, 153–159.\nShea, M. T., Widiger, T. A. and Klein, M. H. (1992). Comorbidity of personality disorders and\ndepression: implications for treatment. Journal of Consulting and Clinical Psychology, 60, 857–\n868.\nStorsahl, K. D., Hayes, S. C., Bergan, J. and Romano, P. (1998). Assessing the field effectiveness\nof Acceptance and Commitment Therapy: an example of the manipulated training research method.\nBehavior Therapy, 29, 35–64.\nStrack, S., Lorr, M., Campbell, L. and Lamnin, A. (1992). Personality disorder and clinical syndrome\nfactors of MCMI-II scales. Journal of Personality Disorder, 6, 40–52.\nTabachnik, B. G. and Fidell, L. S. (2001). Using Multivariate Statistics. Needham Heights, MA: Allyn\n& Bacon.\n464 S. Jones et al.\nTarrier, N. and Calam, R. (2002). New developments in cognitive-behavioural case formulation.\nEpidemiological, systemic and social context: an integrative approach. Behavioural and Cognitive\nPsychotherapy, 30, 311–328.\nTorgersen, S. and Alnaes, R. (1990). The relationship between the MCMI personality scales and\nDSM-III, axis II. Journal of Personality Assessment, 55, 698–707.\nVan Velzen, C. J. and Emmelkamp, P. M. (1996). The assessment of personality disorders: implications\nfor cognitive and behavior therapy. Behaviour Research and Therapy, 34, 655–668.\nvan Velzen, C. J., Emmelkamp, P. M. and Scholing, A. (1997). The impact of personality disorders\non behavioral treatment outcome for social phobia. Behaviour Research and Therapy, 35, 889–900.\nViinamaki, H., Hintikka, J., Honkalampi, K., Koivumaa-Honkanen, H., Kuisma, S., Antikainen,\nR., Tanskanen, A. and Lehtonen, J. (2002). Cluster C personality disorder impedes alleviation of\nsymptoms in major depression. Journal of Affective Disorders, 71, 35–41.\nWatkins, C. E., Campbell, V., Neidberding, R. and Hallmark, R. (1995). Contemporary practices of\npsychological assessment by clinical psychologists. Professional Psychology, 26, 54–60.\nWeissman, M. M. (1993). The epidemiology of personality disorders. In R. Michels (Ed.), Psychiatry.\nPhiladelphia: Lippincott.\nWetzler, S. (1990). The Millon Clinical Multiaxial Inventory (MCMI): a review. Journal of Personality\nAssessment, 55, 445–464.\nWetzler, S. and Dubro, A. (1990). Diagnosis of personality disorders by the Millon Clinical Multiaxial\nInventory. Journal of Nervous and Mental Disease, 178, 261–263.\nAppendix 1. Therapy process and outcome questionnaire\nI. Select the appropriate option to indicate whether the client attended for a course of\ntreatment.\na. Treatment is considered completed or client attended at least 5 times\nb. Client dropped out of treatment (attended less than 5 times and ended by DNAs\nc. No therapy offered\nII. How many sessions did the client attend?\nIII. Please indicate whether you think that this client had a personality disorder Yes\/No\nIV. If you answered yes to question 3, please indicate which personality disorder(s) were\npresent:\na. Schizoid\nb. Avoidant\nc. Depressive\nd. Dependent\ne. Histrionic\nf. Narcissistic\ng. Antisocial\nh. Sadistic\ni. Compulsive\nj. Negativistic\nk. Masochistic\nl. Schizotypal\nPersonality disorder in primary care 465\nm. Borderline\nn. Paranoid\nIf the client attended 5 or more sessions or completed therapy please rate the following\n1. Rate the outcome for the targeted problem:\na. Worse\nb. The same\nc. Slight improvement\nd. Moderate improvement\ne. Considerable improvement\n2. Rate the working alliance formed with the client (the bond established, agreement on\ntherapy goals, tasks and methods):\na. Poor\nb. Slight\nc. Moderate\nd. Good\ne. Excellent\n3. Rate client’s motivation to engage in the therapy process (commitment to treatment and\nreadiness to change):\na. Poor\nb. Slight\nc. Moderate\nd. Good\ne. Excellent\n4. Rate the psychological mindedness of the client (the ability of the client to understand\ntheir own behaviour, to empathize with the feelings of others and to use their insights to\nchange):\na. Poor\nb. Slight\nc. Moderate\nd. Good\ne. Excellent\n5. Please consider the formulation made in over the first two sessions. To what extent did\nthis require modification in subsequent sessions?\na. Not modified at all\nb. Modified slightly\nc. Modified moderately\nd. Modified greatly\ne. Modified totally\n466 S. Jones et al.\n6. Please consider the therapy plan formed by the end of session two. To what extent was it\nnecessary to revise this therapy plan subsequently?\na. Not modified at all\nb. Modified slightly\nc. Modified moderately\nd. Modified greatly\ne. Modified totally\n7. To what extent do you think that execution of the therapy plan was straightforward with\nthis client?\na. No more problems than usual\nb. A few more problems than usual\nc. Moderately more problems than usual\nd. Many more problems than usual\ne. Very many more problems than usual\nN.B. Scoring for Items 1-4 is a = 1, b= 2, c = 3, d =4, e = 5. Scoring for items 5–7 is a = 5,\nb = 4, c = 3, d = 2, e = 1\n"}