{"doi":"10.1063\/1.2801518","coreId":"101000","oai":"oai:epubs.surrey.ac.uk:403","identifiers":["oai:epubs.surrey.ac.uk:403","10.1063\/1.2801518"],"title":"Solid Phase Epitaxy in Uniaxially Stressed (001) Si","authors":["Rudawski, N G","Jones, K S","Gwilliam, R"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-01-01","abstract":"<p>The effect of [110] uniaxial stresses up to 1.5 GPa on defect nucleation during solid phase epitaxy of amorphous (001) Si created via ion implantation was examined. The solid phase epitaxial regrowth velocity was slowed in compression. However, in tension, the velocity was unaffected. Both compression and tension resulted in an increase in regrowth defects compared to the stress- free case. The defects in compression appear to arise from roughening of the crystallizing interface whereas in tension it is proposed that reorientation of crystallites near the initial amorphous\/crystalline interface is responsible for defect formation.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:403<\/identifier><datestamp>\n      2017-10-31T13:58:05Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:696F6E5F6265616D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/403\/<\/dc:relation><dc:title>\n        Solid Phase Epitaxy in Uniaxially Stressed (001) Si<\/dc:title><dc:creator>\n        Rudawski, N G<\/dc:creator><dc:creator>\n        Jones, K S<\/dc:creator><dc:creator>\n        Gwilliam, R<\/dc:creator><dc:description>\n        <p>The effect of [110] uniaxial stresses up to 1.5 GPa on defect nucleation during solid phase epitaxy of amorphous (001) Si created via ion implantation was examined. The solid phase epitaxial regrowth velocity was slowed in compression. However, in tension, the velocity was unaffected. Both compression and tension resulted in an increase in regrowth defects compared to the stress- free case. The defects in compression appear to arise from roughening of the crystallizing interface whereas in tension it is proposed that reorientation of crystallites near the initial amorphous\/crystalline interface is responsible for defect formation.<\/p><\/dc:description><dc:date>\n        2007-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/403\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Rudawski, N G, Jones, K S and Gwilliam, R  (2007) Solid Phase Epitaxy in Uniaxially Stressed (001) Si   Applied Physics Letters, 91 (17).       <\/dc:identifier><dc:relation>\n        10.1063\/1.2801518<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/403\/","10.1063\/1.2801518"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Solid phase epitaxy in uniaxially stressed „001… Si\nN. G. Rudawskia\u0001 and K. S. Jones\nDepartment of Materials Science and Engineering, University of Florida, Gainesville,\nFlorida 32611-6400, USA\nR. Gwilliam\nNodus Accelerator Laboratory, University of Surrey, Guildford, Surrey GU2 7XH, United Kingdom\n\u0001Received 24 July 2007; accepted 2 October 2007; published online 22 October 2007\u0002\nThe effect of \u0003110\u0004 uniaxial stresses up to 1.5 GPa on defect nucleation during solid phase epitaxy\nof amorphous \u0001001\u0002 Si created via ion implantation was examined. The solid phase epitaxial\nregrowth velocity was slowed in compression. However, in tension, the velocity was unaffected.\nBoth compression and tension resulted in an increase in regrowth defects compared to the stress-free\ncase. The defects in compression appear to arise from roughening of the crystallizing interface\nwhereas in tension it is proposed that reorientation of crystallites near the initial amorphous\/\ncrystalline interface is responsible for defect formation. © 2007 American Institute of Physics.\n\u0003DOI: 10.1063\/1.2801518\u0004\nSolid phase epitaxy \u0001SPE\u0002 in amorphous \u0001\u0001\u0002 Si created\nvia ion implantation produces enhanced dopant activation\nand shallower junctions.1 However, stresses found during\ntypical device fabrication may influence the SPE process.2,3\nEarly investigations revealed exponential enhancement of\nthe \u0003001\u0004 SPE using hydrostatic pressure while subsequent\ninvestigations revealed uniaxial stress in the plane of the re-\ngrowing \u0001\/crystalline interface caused smaller changes to\nSPE rates.4–6 In-plane compression also caused significant\nroughening of the regrowing \u0001\/crystalline interface.7 This is\nsignificant since interfacial roughening is known to cause\nSPE-related defect formation.8,9 However, while Barvosa-\nCarter et al.7 quantified and modeled the roughness of the\nregrowing interface, they did not quantify the resulting de-\nfects or examine tensile stresses. Furthermore, the stresses\nused were fairly small in magnitude \u0001\u00020.5 GPa\u0002 and the\nstresses present in Si-based technology can be \u00051 GPa or\nmore.\n2 Thus, the goal of this study is to examine the effect of\nvery high uniaxial \u0003110\u0004 stresses on SPE in \u0001001\u0002 Si.\nFor this study, 50-\u0003m-thick polished \u0001001\u0002 Si wafers\nwere used. The specimens were first Si+ implanted at 50 and\n200 keV with doses of 1.0\u00041015 cm−2 and subsequently As+\nimplanted at 300 keV to a dose of 1.8\u00041015 cm−2. Samples\nwere cleaved along \u0006110\u0007 directions into \u00050.3\u00041.8 cm2\nstrips. Stress was applied by bending and inserting the strips\ninto slots in a quartz tray spaced \u00051.5 cm apart. A Philtec\nlaser displacement measurement system accurate to 1 \u0003m\nmeasured the local radius of curvature along the strips. The\nbent strips were symmetric and parabolic in shape with the\nsmallest radius of curvature at midlength. The \u0003110\u0004 stress\n\u0001\u0005\u0003110\u0004\u0002 was calculated using the \u0003110\u0004 Young’s modulus of\nSi near \u0005500 °C \u0001\u00051.61\u00041011 Pa\u0002, the wafer half-\nthickness, and the local radius of curvature as presented\nelsewhere.10,11 Maximum repeatable stresses of 1.5±0.1 GPa\nwere attained. Specimens were annealed at 525 °C in N2\nambient for 0.7–3.2 h. Stress-free, tensile, and compressive\nspecimens were annealed simultaneously for each anneal\ntime. Upon removal from the quartz tray after annealing, the\nspecimens exhibited no detectable radii of curvature\n\u0001\u00062.0 m\u0002 indicating no measurable plastic strain. Regrowth\nof the \u0001-Si layers was examined using weak-beam dark-field\n\u0001WBDF\u0002 cross-sectional transmission electron microscopy\n\u0001XTEM\u0002. Specimens were prepared via focused ion beam\n\u0001FIB\u0002 milling within a distance of ±3 mm from the specimen\ncenters to minimize the presence of any thermal gradient.\nFigure 1\u0001a\u0002 presents a WBDF-XTEM image of an as-\nimplanted specimen indicating an \u0001-Si layer \u0005340 nm deep\nwith an initial \u0001\/crystalline interface with many small crys-\ntallites residing just inside the \u0001-Si region as observed using\nhigh-resolution XTEM \u0001not presented\u0002. Following annealing\nfor 1.3 h stress-free, shown in Fig. 1\u0001e\u0002, the specimens ex-\nhibit a smooth SPE front with estimated root-mean-squared\nroughness \u0001Rrms\u0002 of 3±2 nm after 250±5 nm of regrowth\nwith a few SPE-related defects \u0001indicated by arrow\u0002. The\ndefects tend to form near the original \u0001\/crystalline interface\nand propagate upward resulting from the misoriented crys-\ntallites after amorphization.12 A small band of end of range\ndefects is observed near the initial \u0001\/crystalline interface.8\nFigures 1\u0001b\u0002–1\u0001d\u0002 present images of specimens annealed for\n1.3 h with \u0005\u0003110\u0004=−0.5, −1.0, and −1.5 GPa, respectively.\na\u0002Author to whom correspondence should be addressed. Electronic mail:\nngr@ufl.edu\nFIG. 1. \u0001a\u0002 WBDF-XTEM image of an as-implanted specimen. WBDF-\nXTEM images of specimens annealed for 1.3 h with \u0005\u0003110\u0004= \u0001b\u0002 −0.5, \u0001c\u0002\n−1.0, \u0001d\u0002 −1.5, \u0001e\u0002 0, \u0001f\u0002 0.5, \u0001g\u0002 1.0, and \u0001h\u0002 1.5 GPa.\nAPPLIED PHYSICS LETTERS 91, 172103 \u00012007\u0002\n0003-6951\/2007\/91\u000217\u0001\/172103\/3\/$23.00 © 2007 American Institute of Physics91, 172103-1\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\nThe specimens annealed with compression exhibit a resulting\n\u0001\/crystalline interface with average Rrms=26±5 nm and a\nlarge number of SPE-related defects. It appears that the de-\nfects nucleate from the initial \u0001\/crystalline interface, as well\nas within the regrown Si. The SPE rate was retarded com-\npared to the stress-free case, as \u0005200 nm of SPE occurred\nwhich agrees with prior results.5,6 However, due to the rough\ninterface, the amount of regrowth is approximate making\nquantification of the SPE rate difficult. The generation of\noff-axis SPE fronts during roughening which was regrown\nslower than the \u0003001\u0004 front may also be a factor in this ob-\nserved retardation.13 Regarding the cases of \u0005\u0003110\u0004=0.5, 1.0,\nand 1.5 GPa, shown in Figs. 1\u0001f\u0002 and 1\u0001g\u0002, respectively, the\nresulting \u0001\/crystalline interfaces are smooth and strikingly\nsimilar to the stress-free case in Fig. 1\u0001e\u0002 with Rrms\n=3±2 nm. However, more SPE-related defects nucleate\nfrom the original \u0001\/crystalline interface in tension compared\nto the stress-free case. The amounts of regrowth were very\nsimilar to the stress-free case with 250±5 nm of regrowth\nwhich disagrees with prior reports observing enhancement to\nSPE.5,6\nTo further examine the effect of tension on SPE rate,\nspecimens were annealed for 0.7 h with \u0005\u0003110\u0004\u00070. In all\ncases, the resulting amount of regrowth was very similar\nwith 100±5 nm of regrowth with resulting Rrms=3±2 nm\n\u0001not presented\u0002. Figure 2 shows the measured \u0001-Si thickness\nversus time. Previous studies5–7 measured an exponential en-\nhancement to SPE velocity with in-plane tension. From these\nstudies, a model was developed, proposing exponential de-\npendence of SPE rate with in-plane stress characterized by\nan activation volume of \u00010.15±0.01\u0002 \b, where \b is the\natomic volume of Si. In order to compare the presented re-\nsults with previous observations, the proposed model5–7 was\nused to estimate the regrowth as a function of time. This is\nalso shown in Fig. 2 and suggests that the regrowth observed\nin this study was significantly slower than expected. One\npossible explanation for the differences between the ob-\nserved effect of tension in the present and previous studies5–7\nis the presence of As, known to enhance14 SPE rates. The As\neffect may have overwhelmed the expected enhancement\nfrom tension. However, this explanation contradicts previous\nresults7 suggesting independent stress and dopant effects on\nSPE rate. In addition, it is unlikely that the presence of As is\ninfluencing volume changes between \u0001-Si and Si as previ-\nously proposed5,6 due to the similarity in size between As\nand Si atoms and the As concentrations used. Experiments\neliminating the dopant implant are in progress to further ex-\namine stress-dependent SPE rates.\nAnnealing for 3.2 h completed regrowth of the \u0001-Si\nlayer in all cases as observed using WBDF-XTEM \u0001not pre-\nsented\u0002. Following SPE, the defect density \u0001ND\u0002 as a function\nof \u0005\u0003110\u0004 was estimated by assuming a sample thickness of\n\u0005200 nm \u0001as fixed by FIB sample preparation\u0002 and measur-\ning the number of defects intersecting the midpoint of the\nregrown layer. This is plotted schematically in Fig. 3 along\nwith the dependence of Rrms after annealing for 1.3 h on\n\u0005\u0003110\u0004. It is evident that ND and Rrms in compression are sig-\nnificantly higher than in the stress-free or tension cases and\nlikely correlated. However, it is interesting that Rrms is very\nsmall both in stress-free and tension cases but ND is signifi-\ncantly higher in tension relative to that in the stress-free case.\nThus, it appears that roughening of the \u0001\/crystalline interface\nduring SPE is not a primary mechanism responsible for SPE-\nrelated defect formation in tension. Furthermore, the obser-\nvation that most of the defects nucleated near the initial\n\u0001\/crystalline interface in tension indicates that the very early\nstages of SPE are critically important for defect formation.\nTo test this theory, some specimens were partially re-\ngrown by annealing for 0.7 h without stress and then an-\nnealed for an additional 1.3 h with stress. The goal of per-\nforming the stress-free annealing was to partially regrow the\nlayer and remove the influence of the misoriented crystallites\nnear the original \u0001\/crystalline interface on subsequent\nstressed SPE. Figure 4\u0001a\u0002 presents a sample annealed for\n0.7 h without stress with subsequent annealing for 1.3 h with\n\u0005\u0003110\u0004=−1.5 GPa. The portion of the implanted layer re-\ngrown during the stress-free annealing is schematically indi-\ncated. The resulting \u0001\/crystalline interface exhibits signifi-\ncant interfacial roughening with nucleation of several SPE-\nrelated defects within the portion of the layer regrown with\nFIG. 2. Plot of measured \u0001\u0001\u0002 \u0001-Si depth vs annealing time for four different\nsamples with 0\t\u0005\u0003110\u0004\t1.5 GPa and predicted \u0001Ref. 6\u0002 \u0001-Si depth vs an-\nnealing time for \u0005\u0003110\u0004=0.5 \u0001\u0002\u0002, 1.0 \u0001\u0003\u0002, and 1.5 GPa \u0001\u0004\u0002.\nFIG. 3. Plot of ND \u0001\u0002\u0002 after annealing for 3.2 h and Rrms \u0001\u0003\u0002 after annealing\nfor 1.3 h vs \u0005\u0003110\u0004.\nFIG. 4. WBDF-XTEM images of specimens annealed for 0.7 h stress-free\nwith subsequent annealing for 1.3 h with \u0005\u0003110\u0004= \u0001a\u0002−1.5 and \u0001b\u0002 1.5 GPa.\n172103-2 Rudawski, Jones, and Gwilliam Appl. Phys. Lett. 91, 172103 \u00022007\u0001\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\nstress. In contrast, the specimen subjected to annealing for\n1.3 h with \u0005\u0003110\u0004=1.5 GPa after stress-free annealing for\n0.7 h, shown in Fig. 4\u0001b\u0002, exhibits a smooth resulting\n\u0001\/crystalline interface with no SPE-related defects nucleat-\ning at the new interface.\nSince misoriented crystallites8,12 near the initial\n\u0001\/crystalline interface and roughening of the regrowing in-\nterface cause SPE-related defect formation, it is plausible\nthat stress acts to cause greater misorientation of these crys-\ntallites which accounts for the observed higher defect density\nin tension compared to the stress-free case. This misorienta-\ntion may, in part, be driven by minimization of strain energy,\nsince Young’s modulus of Si is greatest along \u0006111\u0007\ndirections.15 Furthermore, very slight crystallite reorientation\nin \u0001-Si is highly plausible given the reported viscoelastic\nnature of \u0001-Si.16 Presumably, this effect occurs equally for\ncompression and tension and thus the values of defect den-\nsity in compression are indicative of both stress-induced\ncrystallite misorientation as well as interfacial roughening. It\nis interesting to note the insensitivity of SPE rate with \u0005\u0003110\u0004,\npresented in Fig. 2, though ND tends to increase with tension\nas shown in Fig. 3. Thus, since the SPE rates were very\nsimilar in all cases of \u0005\u0003110\u0004\u00070, the observed influence of\nstress on ND was not due to differences in SPE rates. This is\nimportant to consider since annealing in the vicinity of\n\u0005450 °C is known to reduce the amount of misoriented\ncrystallites though it is unclear if this effect is due to crys-\ntallite dissolution or SPE proceeding very slowly to allow\nmisoriented crystallites time to reorient.8 In any case, the\nobservations of tensile stress on defect density presented in\nthis study indicate that the effect is not related to SPE rate.\nIn summary, the effect of high \u0003110\u0004 uniaxial stresses on\nsolid phase epitaxy and defect nucleation during regrowth of\namorphous \u0001001\u0002 Si created via ion implantation was exam-\nined. No effect on SPE velocity was observed for in-plane\ntension though compression did cause significant retardation.\nThe results indicated that compressive stresses caused the\ngreatest density of defects primarily due to roughening of the\nregrowing amorphous\/crystalline interface. Interestingly, the\napplication of tensile stresses caused greater defect formation\ncompared to stress-free cases even though no significant in-\nterfacial roughening or changes in the \u0003001\u0004 regrowth rate\nwere observed in tension. This was possibly the result of\nstress-induced reorientation of crystallites near the original\namorphous\/crystalline interface.\nThe authors acknowledge the Semiconductor Research\nCorporation for funding this work.\n1J. Vonborany and R. Kogler, Nucl. Instrum. Methods Phys. Res. A 326,\n42 \u00011993\u0002.\n2P. R. Chidambaram, C. Bowen, S. Chakravarthi, C. Machala, and R. Wise,\nIEEE Trans. Electron Devices 53, 944 \u00012006\u0002.\n3C. E. Ross and K. S. Jones, Silicon Front-End Junction Formation-Physics\nand Technology, MRS Symposia Proceedings No. 810 \u0001Material Research\nSociety, Pittsburgh, 2004\u0002, p. C10.4.1.\n4E. Nygren, M. J. Aziz, and D. Turnbull, Appl. Phys. Lett. 47, 232 \u00011985\u0002.\n5W. Barvosa-Carter and M. J. Aziz, Appl. Phys. Lett. 79, 356 \u00012001\u0002.\n6M. J. Aziz, P. C. Sabin, and G.-Q. Lu, Phys. Rev. B 44, 9812 \u00011991\u0002.\n7W. Barvosa-Carter, M. J. Aziz, L. J. Gray, and T. Kaplan, Phys. Rev. Lett.\n81, 1445 \u00011998\u0002.\n8K. S. Jones, S. Prussin, and E. R. Webber, Appl. Phys. A: Solids Surf. 45,\n1 \u00011988\u0002.\n9L. D. Glowinski, K. N. Tu, and P. S. Ho, Appl. Phys. Lett. 28, 312 \u00011976\u0002.\n10S. P. Nikanorov, Yu. A. Burenkov, and A. V. Stepanov, Sov. Phys. Solid\nState 13, 2516 \u00011971\u0002.\n11C. R. Olson, E. Kuryliw, B. E. Jones, and K. S. Jones, J. Vac. Sci. Technol.\nB 24, 446 \u00012006\u0002.\n12T. Sands, J. Washburn, E. Myers, and D. K. Sadana, Nucl. Instrum.\nMethods Phys. Res. B 7-8, 337 \u00011985\u0002.\n13L. Csepregi, E. F. Kennedy, and J. W. Mayer, J. Appl. Phys. 49, 3906\n\u00011978\u0002.\n14J. S. Williams and R. G. Elliman, Phys. Rev. Lett. 51, 1069 \u00011983\u0002.\n15J. J. Wortman and R. A. Evans, J. Appl. Phys. 36, 153 \u00011976\u0002.\n16C. A. Volkert, J. Appl. Phys. 70, 3521 \u00011991\u0002.\n172103-3 Rudawski, Jones, and Gwilliam Appl. Phys. Lett. 91, 172103 \u00022007\u0001\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}