{"doi":"10.1109\/TVLSI.2008.917555","coreId":"68810","oai":"oai:eprints.lancs.ac.uk:31099","identifiers":["oai:eprints.lancs.ac.uk:31099","10.1109\/TVLSI.2008.917555"],"title":"Minimal-power, delay-balanced smart repeaters for global interconnects in the nanometer regime.","authors":["Weerasekera, Roshan","Pamunuwa, Dinesh B.","Zheng, Li-Rong","Tenhunen, Hannu"],"enrichments":{"references":[{"id":926307,"title":"Accurate a priori signal integrirty estimation using a dynamic interconnect model for deep submicron VLSI design,” in","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":924802,"title":"Aggressor aware repeater circuits for improving on-chip bus performance and robustness,”","authors":[],"date":"2003","doi":null,"raw":"A. Katoch, S. Jain, and M. Meijer, “Aggressor aware repeater circuits for improving on-chip bus performance and robustness,” in Eur. SolidState Circuits Conf. (EUSCIRC), Sep. 2003, pp. 261–264.","cites":null},{"id":925679,"title":"Alpha-power law MOSFET model and its applications to CMOS inverter delay and other formulas,”","authors":[],"date":"1990","doi":"10.1109\/4.52187","raw":"T. Sakurai and A. Newton, “Alpha-power law MOSFET model and its applications to CMOS inverter delay and other formulas,” IEEE J. Solid-State Circuits, vol. 25, no. 2, pp. 584–594, Apr. 1990.","cites":null},{"id":924349,"title":"Analysis and implementation of charge recycling for deep sub-micron buses,” in","authors":[],"date":"2001","doi":null,"raw":"P. Sotiriadis, T. Konstantakopoulos, and A. Chandrakasan, “Analysis and implementation of charge recycling for deep sub-micron buses,” in Proc. Int. Symp. Low Power Electron. Des. (ISLPED), 2001, pp. 364–369.","cites":null},{"id":924522,"title":"Boosters for driving long on chip interconnects-design issues, interconnect synthesis, and comparison with repeaters,”","authors":[],"date":"2002","doi":null,"raw":"A. Nalamalpu, S. Sirinivasan, and W. P. Burleson, “Boosters for driving long on chip interconnects-design issues, interconnect synthesis, and comparison with repeaters,” IEEE Trans. Comput.-Aided Des. Integr. Circuits Syst., vol. 21, no. 1, pp. 50–62, Jan. 2002.","cites":null},{"id":924091,"title":"Capacitance coupling immune, transient sensitive accelerator for resistive interconnect signals of subquarter micron ULSI,”","authors":[],"date":"1996","doi":null,"raw":"T. Iima, M. Mizuno, T. Horiuchi, and M. Yamashina, “Capacitance coupling immune, transient sensitive accelerator for resistive interconnect signals of subquarter micron ULSI,” IEEE J. Solid-State Circuits, vol. 31, no. 4, pp. 531–536, Apr. 1996.","cites":null},{"id":925328,"title":"Circuits, Interconnections and Packaging for VLSI.","authors":[],"date":"1990","doi":null,"raw":"H. B. Backoglu, Circuits, Interconnections and Packaging for VLSI. New York: Addison-Wesley, 1990.","cites":null},{"id":16704725,"title":"H.-Y.HuangandS.-L.Chen,“Interconnectacceleratingtechniquesfor sub-100-nm gigascale systems,”","authors":[],"date":"2004","doi":null,"raw":"H.-Y.HuangandS.-L.Chen,“Interconnectacceleratingtechniquesfor sub-100-nm gigascale systems,” IEEE Trans. Very Large Scale Integr. (VLSI) Syst., vol. 12, no. 11, pp. 1192–1200, Nov. 2004.","cites":null},{"id":925039,"title":"Interconnect accelerating techniques for sub-100-nm gigascale systems,”","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":923847,"title":"Interconnect tuning strategies for high-performance ICS,” in","authors":[],"date":"1998","doi":null,"raw":"A. B. Kahng, S. Muddu, E. Sarto, and R. Sharma, “Interconnect tuning strategies for high-performance ICS,” in Proc. Conf. Des., Autom. Test Eur. (DATE), 1998, pp. 471–478.","cites":null},{"id":923284,"title":"Interconnect-power dissipation in a microprocessor,” in","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":16704739,"title":"L.-R.Zheng,D.Pamunuwa,andH.Tenhunen,“Accurateapriorisignal integrirty estimationusing a dynamic interconnect model for deep submicron VLSI design,” in","authors":[],"date":"2000","doi":null,"raw":"L.-R.Zheng,D.Pamunuwa,andH.Tenhunen,“Accurateapriorisignal integrirty estimationusing a dynamic interconnect model for deep submicron VLSI design,” in Proc. Conf. Euro. Solid-State Circuits (ESSCIRC), 2000, pp. 324–327. Authorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:15 from IEEE Xplore.  Restrictions apply.","cites":null},{"id":924578,"title":"Low-power on-chip communication based on transition-aware global signaling (TAGS),”","authors":[],"date":"2004","doi":null,"raw":"H. Kaul and D. Sylvester, “Low-power on-chip communication based on transition-aware global signaling (TAGS),” IEEE Trans. Very Large Scale Integr. (VLSI) Syst., vol. 12, no. 5, pp. 464–476, May 2004.","cites":null},{"id":923581,"title":"Maximizing throughput over parallel wire structures in the deep submicrometer regime,”","authors":[],"date":"2003","doi":null,"raw":"D. Pamunuwa, L.-R. Zheng, and H. Tenhunen, “Maximizing throughput over parallel wire structures in the deep submicrometer regime,” IEEE Trans. Very Large Scale Integr. (VLSI) Syst., vol. 11, no. 2, pp. 224–243, Apr. 2003.","cites":null},{"id":925590,"title":"Minimal-power, delay-balanced smart repeaters for interconnects in the nanometer regime,” in","authors":[],"date":"2006","doi":"10.1109\/TVLSI.2008.917555","raw":"R. Weerasekera, D. Pamunuwa, L.-R. Zheng, and H. Tenhunen, “Minimal-power, delay-balanced smart repeaters for interconnects in the nanometer regime,” in Proc. International Workshop Syst.-Level Interconnect Prediction (SLIP), 2006, pp. 113–120.","cites":null},{"id":16704702,"title":"N.Magen,A.Kolodny,U.Weiser,andN.Shamir,“Interconnect-power dissipation in a microprocessor,” in","authors":[],"date":"2004","doi":null,"raw":"N.Magen,A.Kolodny,U.Weiser,andN.Shamir,“Interconnect-power dissipation in a microprocessor,” in Proc. Int. Workshop Syst. Level Interconnect Prediction (SLIP), 2004, pp. 7–13.","cites":null},{"id":926078,"title":"New generation of predictive technology model for sub-45 nm design exploration,” in","authors":[],"date":"2006","doi":"10.1109\/TED.2006.884077","raw":null,"cites":null},{"id":16704737,"title":"New generation of predictive technology model forsub-45nmdesignexploration,”inProc.7thInt.Symp.QualityElectron.","authors":[],"date":"2006","doi":null,"raw":"W. Zhao and Y. Cao, “New generation of predictive technology model forsub-45nmdesignexploration,”inProc.7thInt.Symp.QualityElectron. Des. (ISQED), 2006, pp. 585–590.","cites":null},{"id":923534,"title":"Switching sensitive interconnect driver to combat dynamic delay in on-chip buses,” in","authors":[],"date":"2005","doi":null,"raw":"R. Weerasekera, L.-R. Zheng, D. Pamunuwa, and H. Tenhunen, “Switching sensitive interconnect driver to combat dynamic delay in on-chip buses,” in Proc. Lecture Notes Comput. Sci. (PATMOS), Sep. 2005, vol. 3728, pp. 277–285.","cites":null},{"id":925976,"title":"The international technology roadmap for semiconductors (ITRS),”","authors":[],"date":"2003","doi":"10.1109\/SOCDC.2009.5423856","raw":"Semiconductor Corp., “The international technology roadmap for semiconductors (ITRS),” 2003 [Online]. Available: http:\/\/www.itrs. net\/Links\/2003ITRS\/Home2003.htm","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-05","abstract":"A smart repeater is proposed for driving capacitively-coupled, global-length on-chip interconnects that alters its drive strength dynamically to match the relative bit pattern on the wires and thus the effective capacitive load. This is achieved by partitioning the driver into main and assistant drivers; for a higher effective load capacitance both drivers switch, while for a lower effective capacitance the assistant driver is quiet. In a UMC 0.18-mum technology the potential energy saving is around 10% and the reduction in jitter 20%, in comparison to a traditional repeater for typical global wire lengths. It is also shown that the average energy saving for nanometer technologies is in the range of 20% to 25%. The driver architecture exploits the fact that as feature sizes decrease, the capacitive load per transistor shrinks, whereas global wire loads remain relatively unchanged. Hence, the smaller the technology, the greater the potential saving","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68810.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/31099\/1\/jn2_TVLSI08.pdf","pdfHashValue":"8499d34dd26f26359c88b637ef3d6e5647eaa16e","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:31099<\/identifier><datestamp>\n      2018-01-24T02:54:38Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D54:5441<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Minimal-power, delay-balanced smart repeaters for global interconnects in the nanometer regime.<\/dc:title><dc:creator>\n        Weerasekera, Roshan<\/dc:creator><dc:creator>\n        Pamunuwa, Dinesh B.<\/dc:creator><dc:creator>\n        Zheng, Li-Rong<\/dc:creator><dc:creator>\n        Tenhunen, Hannu<\/dc:creator><dc:subject>\n        TA Engineering (General). Civil engineering (General)<\/dc:subject><dc:description>\n        A smart repeater is proposed for driving capacitively-coupled, global-length on-chip interconnects that alters its drive strength dynamically to match the relative bit pattern on the wires and thus the effective capacitive load. This is achieved by partitioning the driver into main and assistant drivers; for a higher effective load capacitance both drivers switch, while for a lower effective capacitance the assistant driver is quiet. In a UMC 0.18-mum technology the potential energy saving is around 10% and the reduction in jitter 20%, in comparison to a traditional repeater for typical global wire lengths. It is also shown that the average energy saving for nanometer technologies is in the range of 20% to 25%. The driver architecture exploits the fact that as feature sizes decrease, the capacitive load per transistor shrinks, whereas global wire loads remain relatively unchanged. Hence, the smaller the technology, the greater the potential saving.<\/dc:description><dc:date>\n        2008-05<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/31099\/1\/jn2_TVLSI08.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1109\/TVLSI.2008.917555<\/dc:relation><dc:identifier>\n        Weerasekera, Roshan and Pamunuwa, Dinesh B. and Zheng, Li-Rong and Tenhunen, Hannu (2008) Minimal-power, delay-balanced smart repeaters for global interconnects in the nanometer regime. IEEE Transactions on Very Large Scale Integration (VLSI) Systems, 16 (5). pp. 589-593. ISSN 1063-8210<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/31099\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1109\/TVLSI.2008.917555","http:\/\/eprints.lancs.ac.uk\/31099\/"],"year":2008,"topics":["TA Engineering (General). Civil engineering (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"IEEE TRANSACTIONS ON VERY LARGE SCALE INTEGRATION (VLSI) SYSTEMS, VOL. 16, NO. 5, MAY 2008 589\nTransactions Briefs\nMinimal-Power, Delay-Balanced SMART Repeaters for\nGlobal Interconnects in the Nanometer Regime\nRoshan Weerasekera, Dinesh Pamunuwa, Li-Rong Zheng, and\nHannu Tenhunen\nAbstract—A SMART repeater is proposed for driving capacitively-cou-\npled, global-length on-chip interconnects that alters its drive strength dy-\nnamically to match the relative bit pattern on the wires and thus the effec-\ntive capacitive load. This is achieved by partitioning the driver into main\nand assistant drivers; for a higher effective load capacitance both drivers\nswitch, while for a lower effective capacitance the assistant driver is quiet.\nIn a UMC 0.18- m technology the potential energy saving is around 10%\nand the reduction in jitter 20%, in comparison to a traditional repeater for\ntypical global wire lengths. It is also shown that the average energy saving\nfor nanometer technologies is in the range of 20% to 25%. The driver ar-\nchitecture exploits the fact that as feature sizes decrease, the capacitive\nload per transistor shrinks, whereas global wire loads remain relatively\nunchanged. Hence, the smaller the technology, the greater the potential\nsaving.\nIndex Terms—Buffer, interconnects, nanometer design, on-chip sig-\nnaling, repeaters.\nI. INTRODUCTION\nA key technique in reducing propagation delay and signal degradation\nin global on-chip interconnects is repeater insertion. Although very\neffective and simple, this has an adverse effect on power consumption\nand it has been estimated that over 50% of the power in a high\nperformance microprocessor is dissipated by repeaters charging and\ndischarging interconnects [1]. Further, [1] concludes that over 90%\nof this power is concentrated in only 10% of the interconnets;\ni.e., those which are classed as global and run for a significant\nfraction of the die length.\nThe repeater we propose in this paper exploits the fact that in a par-\nallel wire structure, the effective capacitance of a given wire is dy-\nnamic; i.e., it is a function not only of the physical geometry, but also\nof the relative switching pattern described by the bits on the wire in\nquestion (the victim) and the adjacent wires (aggressors). With a tradi-\ntional repeater, since the drive strength is static, the result is a spread of\nthe propagation delay, with the repeater strength being essentially too\nmuch for every bit pattern other than the worst-case pattern. In the pro-\nposed repeater, the drive strength is dynamically altered depending on\nthe relative bit pattern, by partitioning it into a main driver and assistant\ndriver (see Fig. 1). For a higher effective load capacitance, both drivers\nswitch, while for a lower effective capacitance the assistant driver is\nquiet [2]. By disconnecting part of the repeater when it is not needed,\nthe total load capacitance to the previous stage is reduced, resulting in\nreduced energy consumption for those instances. It is experimentally\nManuscript received July 1, 2006; revised February 9, 2007, March 18, 2007,\nand July 2, 2007.\nR. Weerasekera, L.-R. Zheng, and H. Tenhunen are with KTH School of In-\nformation and Communication Technologies (ICT), Electrum 229, 164 40 Kista,\nSweden (e-mail: roshan@kth.se).\nD. Pamunuwa is at the Center for Microsystem Engineering, Lancaster Uni-\nversity, Lancaster LA1 4WA, U.K.\nDigital Object Identifier 10.1109\/TVLSI.2008.917555\nFig. 1. Basic schematic of the proposed driver scheme.\nshown that for a UMC 0.18-\u0016m technology the potential average saving\nin energy can be as much as 10% over a traditional repeater for typical\nglobal wire lengths in nanometer technologies. Since this SMART re-\npeater works by reducing the variation in the delay, an added benefit\nis that the jitter is reduced. In the same technology, the jitter reduction\nwas as much as 20%.\nThe ramifications of the dynamically changing load in coupled in-\nterconnects have received a fair amount of attention in the literature.\nA comprehensive analysis of design considerations for repeater inser-\ntion in a bus structure with heavy coupling was presented in [3]. A\nscheme proposed in [4] staggers the repeaters so that opposing tran-\nsitions only persist for the length of the offset between repeaters, and\nbecome best-case patterns for the remainder, resulting in a delay reduc-\ntion. Many innovative alternatives to the traditional repeater have also\nbeen proposed, such as the transient sensitive accelerator (TSA) [5],\ncharge recycling technique (CRT) [6], boosters [7], the TAGS receiver\n[8], the aggressor-aware repeater [9], and the capacitor-coupled trigger\nand accelerator combination [10]. Some of these use skewed inverters\nto tradeoff noise margin for speed [5], [7], [8], while others consume\nmore energy [9] and occupy a larger area [5], [7], [8] to produce a faster\nresponse.\nIn general, not only do these alternatives to traditional repeaters re-\nquire much effort in circuit design similar to library cell design, but\nthey also lack a clear high-level abstraction; in contrast, performance\nmetrics such as delay and energy consumption can easily be quantified\nin terms of a few critical design parameters for the traditional inverting\nrepeater [11], resulting in easy amalgamation in computer-aided design\n(CAD) flows at different levels of hierarchy from initial signal planning\nto detailed place and route.\nA secondary advantage of the repeater circuit proposed here is that\nthe relatively minor increase in circuit complexity required to obtain\nthe energy saving and delay equalization described above can be com-\npletely abstracted in the performance analysis.\nII. IMPLEMENTATION OF THE SMART DRIVER\nA. Concept\nIn order to demonstrate the variation of effective capacitance of\nwires, a pair of coupled lines is used as a constituent unit for a bus. For\ntwo simultaneously switching lines, sixteen possible switching combi-\nnations can be identified as given in Table I. These can be categorized\ninto five different groups according to the effective capacitance as\nfollows.\nGroup 1 Both switch in the same direction.\nGroup 2 Both lines are quiet (at 0 or 1).\n1063-8210\/$25.00 © 2008 IEEE\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:15 from IEEE Xplore.  Restrictions apply. \n590 IEEE TRANSACTIONS ON VERY LARGE SCALE INTEGRATION (VLSI) SYSTEMS, VOL. 16, NO. 5, MAY 2008\nTABLE I\nSWITCHING ACTIVITIES ON THE LINES AND THE VARIATION\nOF EFFECTIVE CAPACITANCE\nGroup 3 One line is switching while the other is quiet at 0.\nGroup 4 One line is switching while the other is quiet at 1.\nGroup 5 The lines switch in opposite directions.\nIn Table I, Cwt = (Cs=k) + Ht(Cdmin + Cgmin) and Cws =\n(Cs=k) + HtCdmin + HmCgmin, where Hm and Ha denote the\nsizes of the main and assistant drivers, respectively; Ht = Hm +Ha;\nk is the number of wire segments; Cgmin and Cdmin are the gate\ncapacitance and the drain diffusion capacitance of a minimum sized\ninverter; and Cs and Cc are the total wire-to-ground and wire-to-wire\ncapacitances, respectively.\nTo ensure error-free operation, timing constraints have to be satisfied\nfor the switching pattern that causes the worst-case delay, which are the\n\"# and #\" combinations. Since the effective load is highest for these\npatterns, the size of the buffer designed statically for the worst-case\ndelay is much larger than would be necessary for the same timing re-\nquirements for other patterns [3]. Now this worst-case condition occurs\nonly twice out of 16 possible input switching patterns, with a proba-\nbility of 1\/8 for simultaneously switching lines if the transitions are\nequally distributed as in a random bit stream. For the 14 other cases,\nthe wire is driven faster, which just translates to slack which typically\ncannot be used, consuming energy unnecessarily. The driver proposed\nhere changes its drive strength depending on the neighbour’s switching\ndirection by using some simple logic.\nThe other useful feature in the SMART driver is its ability to re-\nduce jitter while saving energy. The SMART driver achieves this energy\nsaving by delaying the response for the best-case without affecting the\nworst-case (delay-balancing), so that the variation in delay is as small\nas possible [2], [12]. This is illustrated in Fig. 2, where the curves with\nsolid lines represent the output response of a conventional driver for\nminimum effective capacitance (best-case) and maximum effective ca-\npacitance (worst-case).\nWe propose this SMART driver circuit for a regular bus structure, and\nin that case, there will be at least two aggressors for a middle wire.\nThis problem is addressed by adding an extra assistant as in our pre-\nvious work [2] for each extra aggressor, and a unified analytic optimiza-\ntion algorithm is not derived, but an empirical sizing methodology can\neasily be obtained. In terms of the hardware, there is very little added\ncomplexity in the control logic. Similarly, irregularly spaced aggressors\ndo not impose any special problems, because we can merely stagger the\nFig. 2. Jitter reduction using SMART driver.\nspacing of repeaters appropriately, so that long extra control signals are\nnot necessary.\nB. Circuit Realization\nThe implementation has been carried out in a UMC 0.18-\u0016m CMOS\ntechnology, with a VDD of 1.8 V. All simulations are carried out using\nCadence Spectre.\nIn the implementation, a decision is made prior to the next transition\nabout whether or not it constitutes a worst-case pattern. This decision\nis based on the relative logic values of the aggressor and the victim\nat the current time. Since the assistant driver needs to switch on for\nthe worst-case patterns described in Group 5 in Table I, any time the\npresent state has opposing logic values on the victim and aggressor, the\nassistant is turned on. This actually turns the assistant on for two other\npatterns which are not worst-case, namely patterns 10 and 12 in Table I,\nwhich reduces the energy saving from the theoretical maximum, but\nallows a robust and fairly simple circuit implementation.\nThe complete schematic is shown in Fig. 3. The transistors Pa and\nNa form the assistant driver, whereas the inverter I1 is the main driver.\nTwo transmission gates (TGp and TGn), drive the pull-up and pull-\ndown networks of the assistant driver. The weak transistors Pk andNk\nact as keepers ensuring that the assistant driver is turned off properly\nwhen the corresponding transmission gate is disabled.\nThe propagation delay of the selection logic Tlogic is designed to\nbe greater than or equal to the delay of the main driver (from node\nV ictim In to node V ictim Out) so that node V ictim Out is able\nto change before Pa or Na change.\nFigs. 4 and 5 show the simulation results at the far end of a\n2.5-mm-long wire driven by a SMART repeater and a traditional\nrepeater (inverter). The waveforms show the delay equalization for\ndifferent switching patterns taking place.\nAlong with the delay performance, the noise resilience of the pro-\nposed driver is of paramount importance. In our implementation, we\navoid the use of skewed inverters while using complementary logic\nwith a switching threshold of VDD=2 throughout the control circuitry.\nThe only exception is the transmission gate pair, which are protected by\nkeepers. Hence, a preliminary analysis reveals a relatively high noise\nmargin for the circuit. Nevertheless, a more comprehensive noise anal-\nysis is earmarked for future work.\nIII. ENERGY MODEL OF THE SMART DRIVER\n1) Dynamic Energy: If all switching events are random uniformly\ndistributed events with no correlation between neighboring lines, the\naverage energy dissipation per transition for wire i can be obtained by\naveraging out the dynamic energy consumption for each pattern. Then\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:15 from IEEE Xplore.  Restrictions apply. \nIEEE TRANSACTIONS ON VERY LARGE SCALE INTEGRATION (VLSI) SYSTEMS, VOL. 16, NO. 5, MAY 2008 591\nFig. 3. Circuit schematic of the proposed SMART driver and the selector logic.\n(a) Driver circuit. (b) Gate-Level schematic of selector logic. (c) Transistor-level\nschematic of selector logic.\nFig. 4. Waveforms when the aggressor and victim switch in the same direction\nwith only the main driver being active.\nFig. 5. Waveforms when the aggressor and victim switch in opposite directions\nwith both drivers active.\nthe dynamic energy dissipation for a wire buffered with k traditional\nrepeaters is\nEdyntrad =\nV 2DD\n32\n8Cwt + 7\nCc\nk\n(1)\nTABLE II\nBUFFER AND WIRE PARAMETERS FOR VARIOUS FUTURE TECHNOLOGIES\nBASED ON ITRS [15] PROJECTIONS AND [16]. WIRE ELECTRICAL\nPARAMETERS WERE OBTAINED USING FORMULA GIVEN IN [17]\nand that for a wire buffered with k SMART repeaters is\nEdynsmrt =\nV 2DD\n32\n4Cwt + 4Cws + 7\nCc\nk\n: (2)\nThe dynamic energy consumption of the selection logic is found by\nestimating the total effective load capacitance including parasitic ca-\npacitances of all the gates and multiplying it by V 2DD=2 and the activity\nfactor.\n2) Short Circuit Energy: Assuming the short-circuit current spike\nis a triangle with a peak Ipeak, and a base tsc, the short-circuit energy\nis shown in [13], [14] to be\nESC =\n1\n2\nIpeaktscVDD (3)\nwhere\nIpeak = Idsat\nVgs \u0000 Vt\nVDD \u0000 Vt\n1:3\n(4)\ntsc = 1:1 [Rd(Cd + Cg + Cw) +RwCg + 0:4RwCw] (5)\nwith Rd being the device resistance averaged over the switching range\nduring which the short-circuit current flows and Vgs is the source to\ngate voltage of the MOS transistor. It is assumed that the peak current\noccurs in the middle of the transition and hence, Vgs \u0019 VDD=2.\nIn modeling the short circuit power consumed in the selector logic,\nthe series connected pMOS\/nMOS combination is represented by an\nequivalent single pMOS\/nMOS device for the purpose of computing\nthe driving resistance. This resistance is multiplied by the load capac-\nitance to obtain tsc, which is\ntsc gate \u0019 Rgout(Cdout + Cgin) (6)\nwhere Rgout is the equivalent output resistance of the gate, Cdout is\nthe output capacitance, and Cgin is the fan-out capacitance.\n3) Leakage Energy: The average leakage energy of a MOS tran-\nsistor is given by\nEleakage =\nVDDIleakage\nfclk\n(7)\n=\nVDD(Io\u000bnWn + Io\u000bpWp)\n2fclk\n: (8)\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:15 from IEEE Xplore.  Restrictions apply. \n592 IEEE TRANSACTIONS ON VERY LARGE SCALE INTEGRATION (VLSI) SYSTEMS, VOL. 16, NO. 5, MAY 2008\nFig. 6. Variation of energy per transition with the size of assistant driver.\nTABLE III\nENERGY DISSIPATION FOR EACH SWITCHING GROUP (H = 104)\nFig. 7. Delay variation with the size of assistant driver.\nIV. ENERGY MODEL VALIDATION\nThe energy models derived in Section III are validated for the UMC\n0.18-\u0016m implementation by running simulations for a wire length of\n10 mm. The relevant parameters for this technology node are given in\ncolumn one of Table II. For the traditional inverting repeater, the pa-\nrameters of repeater size (Ht = 156) and number of repeaters (k = 5)\nfor minimizing delay are obtained from the well-known methodology\ndescribed in [3]. Applying the general methodology described in the\nAppendix for optimizing the SMART driver, the parameters Hm = 52,\nHa = 104, and k = 5 are obtained.\nThe simulations show that the energy models derived for the tradi-\ntional and SMART repeaters are accurate to within 95% of their sim-\nulated values as evidenced in Fig. 6 and summarized in Table III. As\npredicted by the model, increasing the size of the assistant driver will\nincrease the energy saving, although at the cost of increased delay, if\nthe size is increased beyond the optimal (refer to Fig. 7).\nIt is evident from Table III that the energy loss introduced by the\nextra selection logic for switching patterns in Group 5, where both the\nassistant and main drivers switch, is more than offset by the energy\nsaving for those patterns in Groups 1, 3, and 4, where the assistant\nTABLE IV\nMAXIMUM CROSSTALK ON A QUIET LINE\nTABLE V\nENERGY SAVING FOR FUTURE GENERATIONS\ndoes not switch. On average, assuming equally likely occurrences of\nall patterns, the total energy saving is around 10%.\nThere is a slight increase in the peak crosstalk voltage with a smart\ndriver compared to a traditional driver but the peak crosstalk at the\nfar-end is about 12% of VDD, which is in the normally acceptable range\nof 20% ofVDD. It can be seen from Table IV that the near-end cross-talk\nwith the smart repeater is doubled compared to a traditional repeater,\nbut the total percentage is 0.1% of VDD.\nV. IMPACT OF TECHNOLOGY SCALING\nIn this section, the potential of the SMART Driver to save energy\nin future technology nodes is investigated. As the feature size\ndecreases, the short circuit energy increases fairly sharply, which\nadversely affects the energy saving due to the fact that the SMART\ndriver has a few transistors in the selector logic. However, this is\noffset to some degree due to the relative decrease in area and the\nassociated dynamic energy consumption of the selection logic in\ncomparison to the driving inverters. Since global wires are scaled\nselectively, the wire parasitics remain approximately the same, or\nare worse, and the driving transistors see no reduction in size [15].\nIn contrast, the selection logic can be implemented with minimum\nsized transistors and the dynamic energy consumed becomes truly\nnegligible. An analysis was carried out using ITRS predictions\nto derive the relevant technology parameters, as summarized in\ncolumns 2–6 in Table II. The predicted total average energy saving\nin driving global length wires is shown in Table V, highlighting\nthe usefulness of the SMART driver right up to the 32-nm node.\nVI. CONCLUSION\nIn this paper, we addressed the issue of reducing energy consump-\ntion by exploiting the switching-pattern-dependent delay of repeater-\ninserted global wires. The proposed circuit was implemented in an\nUMC 0.18-\u0016m CMOS technology and tested for proof of concept. The\naverage energy saving was shown to be around 10%, and the jitter re-\nduction to be 20% for a data rate of 1 GB\/s.\nA comprehensive delay and energy analysis was presented,\nincluding a design methodology to obtain the optimal repeater config-\nurations for minimizing delay while also minimizing jitter. Further,\nas processes scale, the selector latency shrinks, and higher data rates\ncan be achieved. The total energy saving that can be achieved by the\nSMART driver in future nanometer technologies is found to be in the\nrange of 20%–25%.\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:15 from IEEE Xplore.  Restrictions apply. \nIEEE TRANSACTIONS ON VERY LARGE SCALE INTEGRATION (VLSI) SYSTEMS, VOL. 16, NO. 5, MAY 2008 593\nAPPENDIX\nDELAY-BALANCED DRIVER SIZING\nThe methodology for delay-balanced driver sizing for the SMART\ndriver is described extensively in our previous work [12]. The delay\nanalysis for SMART repeater insertion uses the characterization of\na minimum-sized repeater in terms of an output resistance Rdmin,\ninput gate capacitance Cgmin, and output drain-diffusion capacitance\nCdmin. When both the main and assistant drivers are switching,\nRd = Rdmin=(Hm + Ha) and Cg = Cgmin(Hm + Ha). An\nexpression can be derived for the associated delay TMA, by using the\nElmore delay as in [13]. When the assistant driver is quite, the driver\nresistance changes to Rd = Rdmin=Hm, and the gate capacitance\nto Cg = HmCgmin. Thus, the delay expression (TM ) when the\nassistant is quiet is found. Since the assistant driver switches only for\nthe worst-case switching pattern defined by Group 5 in Table I, the\nsize of the assistant driver Ha can be used to tune the delays for the\nother switching combinations defined by Groups 1, 3, and 4. The delay\nvariation can be quantified as\n\u0001T = TMA \u0000 TM :\nBy setting \u0001T = 0, delay balancing can be achieved. Using the rela-\ntion HmDB = Ht \u0000 HaDB , a quadratic equation for HaDB can be\nobtained, the solution to which gives the delay balanced assistant driver\nsize.\nREFERENCES\n[1] N. Magen, A. Kolodny, U. Weiser, and N. Shamir, “Interconnect-power\ndissipation in a microprocessor,” in Proc. Int. Workshop Syst. Level\nInterconnect Prediction (SLIP), 2004, pp. 7–13.\n[2] R. Weerasekera, L.-R. Zheng, D. Pamunuwa, and H. Tenhunen,\n“Switching sensitive interconnect driver to combat dynamic delay in\non-chip buses,” in Proc. Lecture Notes Comput. Sci. (PATMOS), Sep.\n2005, vol. 3728, pp. 277–285.\n[3] D. Pamunuwa, L.-R. Zheng, and H. Tenhunen, “Maximizing\nthroughput over parallel wire structures in the deep submicrom-\neter regime,” IEEE Trans. Very Large Scale Integr. (VLSI) Syst., vol.\n11, no. 2, pp. 224–243, Apr. 2003.\n[4] A. B. Kahng, S. Muddu, E. Sarto, and R. Sharma, “Interconnect tuning\nstrategies for high-performance ICS,” in Proc. Conf. Des., Autom. Test\nEur. (DATE), 1998, pp. 471–478.\n[5] T. Iima, M. Mizuno, T. Horiuchi, and M. Yamashina, “Capacitance\ncoupling immune, transient sensitive accelerator for resistive intercon-\nnect signals of subquarter micron ULSI,” IEEE J. Solid-State Circuits,\nvol. 31, no. 4, pp. 531–536, Apr. 1996.\n[6] P. Sotiriadis, T. Konstantakopoulos, and A. Chandrakasan, “Analysis\nand implementation of charge recycling for deep sub-micron buses,”\nin Proc. Int. Symp. Low Power Electron. Des. (ISLPED), 2001, pp.\n364–369.\n[7] A. Nalamalpu, S. Sirinivasan, and W. P. Burleson, “Boosters for\ndriving long on chip interconnects-design issues, interconnect syn-\nthesis, and comparison with repeaters,” IEEE Trans. Comput.-Aided\nDes. Integr. Circuits Syst., vol. 21, no. 1, pp. 50–62, Jan. 2002.\n[8] H. Kaul and D. Sylvester, “Low-power on-chip communication based\non transition-aware global signaling (TAGS),” IEEE Trans. Very Large\nScale Integr. (VLSI) Syst., vol. 12, no. 5, pp. 464–476, May 2004.\n[9] A. Katoch, S. Jain, and M. Meijer, “Aggressor aware repeater circuits\nfor improving on-chip bus performance and robustness,” in Eur. Solid-\nState Circuits Conf. (EUSCIRC), Sep. 2003, pp. 261–264.\n[10] H.-Y. Huang and S.-L. Chen, “Interconnect accelerating techniques for\nsub-100-nm gigascale systems,” IEEE Trans. Very Large Scale Integr.\n(VLSI) Syst., vol. 12, no. 11, pp. 1192–1200, Nov. 2004.\n[11] H. B. Backoglu, Circuits, Interconnections and Packaging for VLSI.\nNew York: Addison-Wesley, 1990.\n[12] R. Weerasekera, D. Pamunuwa, L.-R. Zheng, and H. Tenhunen, “Min-\nimal-power, delay-balanced smart repeaters for interconnects in the\nnanometer regime,” in Proc. International Workshop Syst.-Level Inter-\nconnect Prediction (SLIP), 2006, pp. 113–120.\n[13] T. Sakurai and A. Newton, “Alpha-power law MOSFET model and\nits applications to CMOS inverter delay and other formulas,” IEEE J.\nSolid-State Circuits, vol. 25, no. 2, pp. 584–594, Apr. 1990.\n[14] D. Sylvester, W. Jiang, and K. Keutzer, “Berkeley advanced chip per-\nformance calculator,” [Online]. Available: http:\/\/www.eccs.umich.edu\/\ndennis\/bacpac\/\n[15] Semiconductor Corp., “The international technology roadmap for\nsemiconductors (ITRS),” 2003 [Online]. Available: http:\/\/www.itrs.\nnet\/Links\/2003ITRS\/Home2003.htm\n[16] W. Zhao and Y. Cao, “New generation of predictive technology model\nfor sub-45 nm design exploration,” in Proc. 7th Int. Symp. Quality Elec-\ntron. Des. (ISQED), 2006, pp. 585–590.\n[17] L.-R. Zheng, D. Pamunuwa, and H. Tenhunen, “Accurate a priori signal\nintegrirty estimation using a dynamic interconnect model for deep sub-\nmicron VLSI design,” in Proc. Conf. Euro. Solid-State Circuits (ESS-\nCIRC), 2000, pp. 324–327.\nAuthorized licensed use limited to: Lancaster University Library. Downloaded on November 30, 2009 at 05:15 from IEEE Xplore.  Restrictions apply. \n"}