{"doi":"10.1080\/0968776980060114","coreId":"14298","oai":"oai:generic.eprints.org:266\/core5","identifiers":["oai:generic.eprints.org:266\/core5","10.1080\/0968776980060114"],"title":"Active paper for active learning","authors":["Brown, Heather","Harding, Robert","Lay, Steve","Robinson, Peter","Sheppard, Dan","Watts, Richard"],"enrichments":{"references":[{"id":199881,"title":"A framework for interacting with paper',","authors":[],"date":"1997","doi":"10.1111\/1467-8659.16.3conferenceissue.34","raw":"Robinson, P., Sheppard, D., Watts, R., Harding, R. D. and Lay, S. (1997), 'A framework for interacting with paper', Proceedings of Eurographics '97, 16 (3).","cites":null},{"id":199877,"title":"Encoding the British National Corpus',","authors":[],"date":"1993","doi":null,"raw":"Burnage, G. and Dunlop, D. (1993), 'Encoding the British National Corpus', in Aarts, J., de Haan, P. and Oostdijk, N. (eds), English Language Corpora: Design, Analysis and Exploitation, Amsterdam: Rodopi, 79-95.","cites":null},{"id":199882,"title":"Guidelines for Electronic Text Encoding and","authors":[],"date":"1994","doi":"10.1007\/978-94-011-0325-1_3","raw":"Sperberg-McQueen, C. M. and Burnard, L. (1994), Guidelines for Electronic Text Encoding and Interchange (TEI P3), Chicago and Oxford: ACH\/ACL\/ALLC (Association for Computers and the Humanities, Association for Computational Linguistics, Association for Literary and Linguistic Computing).","cites":null},{"id":199884,"title":"Interacting with paper on the DigitalDesk',","authors":[],"date":"1993","doi":"10.1145\/159544.159630","raw":"Wellner, P. (1993), 'Interacting with paper on the DigitalDesk', Communications of the ACM 36 (7), July.","cites":null},{"id":199880,"title":"New technology for interactive CAL\\","authors":[],"date":"1997","doi":null,"raw":"Harding, R. D., Lay, S., Robinson, P., Sheppard, D. and Watts, R. (1997), 'New technology for interactive CAL\\ ALT-J, 5 (1).","cites":null},{"id":199876,"title":"SGML: A User's Guide to Structured Information,","authors":[],"date":"1995","doi":"10.1093\/combul\/38.3.26","raw":"Alschuler, L. (1995), ABCD . . . SGML: A User's Guide to Structured Information, London: International Thomson Computer Press.","cites":null},{"id":199883,"title":"The DigitalDesk calculator - tangible manipulation on a desk-top display',","authors":[],"date":"1991","doi":"10.1145\/120782.120785","raw":"Wellner, P. (1991), 'The DigitalDesk calculator - tangible manipulation on a desk-top display', Proceedings of the ACM Symposium on User Interface Software and Technology, Hilton Head, November 1991.","cites":null},{"id":199879,"title":"The SGML Handbook,","authors":[],"date":"1990","doi":"10.1007\/978-3-642-46881-0_1","raw":"Goldfarb, C. F. (1990), The SGML Handbook, Oxford: OUP.","cites":null},{"id":199878,"title":"Users' Reference Guide for the British National Corpus, Version 1.0,","authors":[],"date":"1995","doi":null,"raw":"Burnard, L. (1995), Users' Reference Guide for the British National Corpus, Version 1.0, Oxford: Oxford University Computing Services.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1998","abstract":"Recent research into distance learning and the virtual campus has focused on the use of electronic documents and computer‐based demonstrations to replace or reinforce traditional learning material. We show how a computer‐augmented desk, the DigitalDesk, can provide the benefits of both paper and electronic documents using a natural interface based on real paper documents. Many electronic documents, particularly those created using the guidelines produced by the Text Encoding Initiative (TEI), include detailed semantic and linguistic information that can be used to good effect in learning material. We discuss potential uses of TEI texts, and describe one simple application that allows a student's book to become an active part of a grammar lesson when placed on the DigitalDesk. The book is integrated into an interactive point‐and‐click interface, and feedback is related to the currently visible pages of the boo","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14298.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/266\/1\/ALT_J_Vol6_No1_1998_Active%20paper%20for%20active%20learni.pdf","pdfHashValue":"a708a5b623fa20d83731311ccc57d684fd2d3ef3","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:266<\/identifier><datestamp>\n      2011-04-04T08:50:00Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/266\/<\/dc:relation><dc:title>\n        Active paper for active learning<\/dc:title><dc:creator>\n        Brown, Heather<\/dc:creator><dc:creator>\n        Harding, Robert<\/dc:creator><dc:creator>\n        Lay, Steve<\/dc:creator><dc:creator>\n        Robinson, Peter<\/dc:creator><dc:creator>\n        Sheppard, Dan<\/dc:creator><dc:creator>\n        Watts, Richard<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Recent research into distance learning and the virtual campus has focused on the use of electronic documents and computer‐based demonstrations to replace or reinforce traditional learning material. We show how a computer‐augmented desk, the DigitalDesk, can provide the benefits of both paper and electronic documents using a natural interface based on real paper documents. Many electronic documents, particularly those created using the guidelines produced by the Text Encoding Initiative (TEI), include detailed semantic and linguistic information that can be used to good effect in learning material. We discuss potential uses of TEI texts, and describe one simple application that allows a student's book to become an active part of a grammar lesson when placed on the DigitalDesk. The book is integrated into an interactive point‐and‐click interface, and feedback is related to the currently visible pages of the book<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        1998<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/266\/1\/ALT_J_Vol6_No1_1998_Active%20paper%20for%20active%20learni.pdf<\/dc:identifier><dc:identifier>\n          Brown, Heather and Harding, Robert and Lay, Steve and Robinson, Peter and Sheppard, Dan and Watts, Richard  (1998) Active paper for active learning.  Association for Learning Technology Journal, 6 (1).  pp. 95-101.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776980060114<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/266\/","10.1080\/0968776980060114"],"year":1998,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Active paper for active learning\nHeather Brown,* Robert Harding** Steve Lay** Peter Robinson * * *\nDan Sheppard*** and Richard Watts***\n*Computing Laboratory, University of Kent at Canterbury\n**Department of Applied Mathematics and Theoretical Physics,\nUniversity of Cambridge\n***Computing Laboratory, University of Cambridge\nRecent research into distance learning and the virtual campus has focused on the use of electronic\ndocuments and computer-based demonstrations to replace or reinforce traditional learning material. We\nshow how a computer-augmented desk, the DigitalDesk, can provide the benefits of both paper and\nelectronic documents using a natural interface based on real paper documents. Many electronic\ndocuments, particularly those created using the guidelines produced by the Text Encoding Initiative\n(TEI), include detailed semantic and linguistic information that can be used to good effect in learning\nmaterial. We discuss potential uses of TEI texts, and describe one simple application that allows a\nstudent's book to become an active part of a grammar lesson when placed on the DigitalDesk. The book\nis integrated into an interactive point-and-click interface, and feedback is related to the currently visible\npages of the book\nIntroduction\nPaper documents have great advantages in readability, portability and familiarity, but are\nnecessarily static and slow to update. Much recent research has concentrated on the\ndynamic demonstrations, immediate feedback, and easy updating that can be provided by\nelectronic teaching material. Although an increasing number of teaching packages make\nuse of both paper and electronic documents, the two are typically accessed by completely\nseparate interfaces. We have been taking a different approach and investigating the use of a\nDigitalDesk (Wellner, 1991; Wellner, 1993) as a means of integrating normal paper teach-\ning material with electronic versions of the same material. Many printed books also exist in\nelectronic form, and our goal is to allow these books to be used as natural interfaces to any\nadditional information that may be present in the electronic version.\n95\nHeather Brown et al Active paper for active learning\nWe have looked primarily at electronic texts prepared according to the guidelines published\nfor the Text Encoding Initiative (TEI) (Sperberg-McQueen and Burnard, 1994) as these\nprovide a potentially rich field of additional information to exploit. Many large projects\nhave produced texts conforming to the TEI guidelines. The majority provide information\non old books and manuscripts, but the British National Corpus (BNC) (Burnage and\nDunlop, 1993) provides information on the part-of-speech of over 90 million words of\nmodern English texts. As a concrete example of learning material based on TEI informa-\ntion, we have taken a publicly available text from the BNC - a simplified modern version of\nLewis Carroll's Alice's Adventures in Wonderland (Carroll, 1994) - and have used it as the\nbasis of a student's grammar lesson. The DigitalDesk recognizes the text on the open pages\nof the physical book - the one the student carries around and reads in the normal way -\nand matches it up with the corresponding part of the BNC text in a way that allows the\nbook to become part of an active grammar lesson based on the currently open pages.\nThe following sections introduce a few of the most relevant features of the TEI, explain the\nexample application in more detail, and outline a number of further possible uses of TEI\ntexts in learning material.\nThe Text Encoding Initiative\nThe Text Encoding Initiative provides detailed guidelines for creating SGML (Goldfarb,\n1990; Alschuler, 1995) documents that encode many different types of information about\nthe original documents in addition to their textual content. The guidelines are designed\nparticularly for capturing scholarly information about old manuscripts, but have been used\nfor a wide variety of texts and projects\nIn (over-)simplified terms, SGML provides a syntax for adding markup or tags to a text to\nidentify the start and end of every element of a document. Elements may contain nested\nelements, so the SGML document is a hierarchy of nested elements, Tags contain the name\nof the element, and start tags may also contain further information expressed by attribute-\nvalue pairs. An SGML Document Type Definition (DTD) controls the syntax by defining\nthe names of the elements allowed and the ways in which they may be nested and\ncombined. An associated application defines the meaning of the elements. The TEI is an\napplication of SGML, so the guidelines consist of a DTD together with recommendations\non the meaning and use of the 400 elements it defines.\nA text may use any subset of the full TEI facilities, but if a particular type of information\nis encoded it must conform to the recommended markup. As a simple example of this, a\nparagraph of text may simply be coded as a single 'p' element by enclosing it in start and\nend tags(<p> <\/p>). Alternatively, it may be further broken down into sentences (<s>),\nwords (<w>) and punctuation (<c>). This more detailed form is used throughout the BNC\ntexts. Each sentence is also given a sequence number, and each word is labelled with a code\nindicating its part of speech. The following sample from the start of the BNC Alice text\nillustrates the level of information provided.\n<s n=002>\n<w NP0>Alice <w VBD>was <w W O b e g i n n i n g <w TO0>to\n<w W I > g e t <w AV0>very <w AJO-WN>bored<c PUN>.\n96\nALT-J Volume 6 Number I\nThis detailed encoding of each word in a BNC text forms the basis of the application\ndescribed in the next section.\nUsing the DigitalDesk for a grammar lesson\nThe DigitalDesk is built around an ordinary physical desk. It enables the user to interact\nwith paper and electronic documents (projected onto the desk) using an LED-tipped pen.\nThe movement of the pen is monitored by a computer connected to a video camera\nmounted above the desk. Harding et al (1997) used the DigitalDesk to develop prototype\neducational applications by printing documents on special paper marked with computer-\nreadable glyph codes (Robinson et al, 1997). We extend this approach by using the\ninformation in the BNC texts to recognize pages instead, enabling previously published\nmaterial to become activated too.\nThe normal published version of the Alice text is a book of about 40 pages. The BNC text\ncovers all the running text of the book, but not the pictures, captions or page headers.\nWhen the book is placed on the DigitalDesk, the page images captured by the camera are\nused to match the visible running text to its BNC counterpart. This is done by recognizing\nthe positions of the lines of text on the pages and using the pattern of ascenders and\ndescenders in the lines to provide a match with the BNC text. Once this has been done, it is\nrelatively simple to find the position of each word on the pages and to associate it with its\npart of speech as specified in the electronic version.\nThe user interface for the example grammar lesson has been kept deliberately simple. Once\nthe pages of the book have been recognized, two windows of information are projected\nonto the desk, one either side of the book. One of these leads into a simple lesson\nproviding information about different types of words. The other is for a grammar quiz\nbased on the words on the page. The lesson provides information on the main types of\nwords. Users point to menu items in the projected information to request more detailed\ninformation or examples. Figure 1 (left) shows the initial information that appears if a user\nasks about nouns, and Figure 1 (right) shows the further information that appears if the\nuser points to the Proper Nouns menu item.\nAs Figure 1 (left) shows, the user can also ask to see all the words of a given type on the\npages. Selecting this option causes all the appropriate words on the open pages to have\ncoloured rectangles projected onto them, providing a vivid illustration of the use of the\nwords, and integrating the paper text into the lesson. Different colours are used throughout\nthe design to identify the different types of words. Thus the nouns shown in italics in\nFigure 1 are projected using the colour for nouns, and if nouns are highlighted on the\npages the same colour is used. At any time users can also point to a word on one of the\npages and see information about that word. Figure 2 shows the result of pointing to the\nword 'her' in the book.\nThe quiz is also used to bring the pages to life. It tests users' knowledge of the words on the\npages by asking them to solve simple problems such as 'Find two adjectives on the pages',\n'Find three words from the verb \"to be\" on the pages', or 'Is the highlighted word an\nadjective or an adverb?'. To solve the 'Find . . .' problems, users point to words on the\npages and receive feedback on their choices. The emphasis throughout is on using the book\nas the source of the information, and on projecting information onto the book to relate the\n97\nHeather Brown et al Active paper for active learning\nFigure I: Information\nabout nouns (left) and\n'proper nouns'(right).\nNouns\nNouns ere words for things (cct, house,\nsta-, nose, pcticeman, ship).\nMost nouns hive a. singular and a plural\nform. The common way to turn a singular\nnoun into its plural form is to add V or\n'es' (cct\/cats, dth, dishes) but some have\nunusual plurals (pony\/ponies, fooffeet)\nand some do not change (sheep, arcrtft,\nfood).\nMore about nouns\nProper nouns (names)\nMore examples\nShow me the nouns on the pages\nProper nouns\nNames of people and places are proper\nnouns and are written with an initial\ncapital letter (Janes, Amanda, Ionian,\nCdcutta, Jcpai).\nThis includes the names given to\nmountains (Everest), rivers (Thanes)\nand animals (Fever).\nUnlike ordinary nouns, we do not use\nan article in front of many proper nouns\n(use 'London' not 'the London').\nMost proper nouns do not have a plural\nform (use 'London' not 'the Londons\").\nFigure 2: Feedback on 'her\".\nPro no im-personal\nA pronoun is use d inste ad of a noun (she,\nwe, his, everything whom)\n'her' is a personal pronoun- one that\nrefers to particular people or things (\/,\nthm.yours)\nFigure 3: Words\non t\/ie page have\nrectangles\nprojected onto\nthem.\n98\nALT-J Volume 6 Number I\ngrammar information to the 'real' text that the student is familiar with. In this way, the\npaper itself becomes an active part of the learning process.\nDifferent versions of the lesson and quiz would be appropriate for different levels of\nknowledge. The version implemented is at an intermediate level; it contains approximately\n50 different sets of information in the lesson. Adjectives, adverbs, determiners, nouns,\npronouns and verbs are presented at the highest level. Information on prepositions,\nconjunctions, numbers, interjections, negatives, infinitives and possessives is available at a\nsecondary level. Several of these word categories are subdivided when the user asks for\nmore details (normal, comparative and superlative adjectives, for example, and separate\ncategories for the verbs 'be', 'do' and 'have'). The BNC text uses 57 different word cate-\ngories (Burnard, 1995), but not all of these are identified as separate categories in this\nlesson (adverb particles, for example, are never distinguished from general adverbs).\nHowever, the system has been designed so that the level of detail presented can easily be\nchanged by altering the hierarchy of windows and menus, and by changing an internal\ngrouping of the BNC categories into 'super-categories'.\nIt should be clear that, just as it is simple to alter the level of the grammar lesson provided,\nit would also be relatively straightforward to adapt the main features of this system to\nforeign-language teaching. The essential requirements are a book that has a corresponding\nelectronic text containing part-of-speech information, and a DigitalDesk with the software\nto match the paper and electronic texts. Lessons and quizzes for different languages would\nneed careful design - and different word categories might be needed for different languages\n- but the general method of involving the paper text in the lesson would be appropriate for\nall languages based on Latin scripts.\nUsing theTEl for learning material\nThis section looks briefly at a few of the more specialized features of the TEI guidelines\nthat could provide valuable active paper applications for university students or even for\nprofessional linguists or historians.\nIn the applications suggested below, the information available would be much more\ncomplex than the part-of-speech information used in the grammar lesson. A word in a\nbook might be associated with several different pieces of information and, conversely, a\npiece of information might refer to a paragraph or span of text rather than to a single\nword. Nevertheless, the users' interaction with the book would probably be based on the\ntwo basic mechanisms used in the grammar lesson: 'Show me . . .' menus to highlight all\nthe areas on the open pages associated with a particular type of information, and pointing\nat a position on a page to see all the information associated with that point.\nThe printed versions used would normally be modern transcripts of old books and manuscripts.\nVerse\nThe TEI provides many special facilities for verse. These include encoding mechanisms for\nline groups of different types (<lg type=sestet>) , or to specify the pattern of rhyme in\nthe group (<lg rhyme=\"ababcdcd\">). Individual lines within a group are marked\n(<1>) and may have characteristics such as their metrical pattern specified (<1 n=357\n99\nHeather Brawn et al Active paper for active learning\nmet=\"-+1 -+ | -+\">). Segments (<seg>) within lines allow the metrical structure of the\nverse to be encoded down to the level of each foot or syllable (<seg type=foot\nmet= *+-\">).\nTEI texts containing this level of information represent a significant scholarly resource.\nAllowing direct access to them from a printed version would be invaluable to scholars or\nstudents of classical verse.\nVariant versions\nWhen multiple versions of important manuscripts exist, scholarly editions are often\nproduced with a critical apparatus that records known variations attested by particular\n'witnesses'. Typically, these identify one base or lemma version and a number of different\nreadings provided by the different witnesses. A TEI text may record such information using\nan <app> (apparatus) element containing one <lem> element for the base version and one\nor more <rdg> elements for the other variants. Attribute values in the start tags identify\nthe witness concerned, and give further information about the type of variation. Variations\nmay apply to minor differences in the spelling of single words or to significant changes\nover a span of text. The following example from the TEI guidelines shows how variant\nspellings of a single word might be encoded.\n<app>\n<lem wit='\"El Ra2\">though<\/>\n<rdg wit=wHg\" type=Morthographic\">thogh<\/>\n<rdg wit=\"La\" type=\"orthographic\">thouh<\/>\n<\/app>\nA modern transcription of such a manuscript could be used on the DigitalDesk to identify\nall parts of the text with variant versions and to allow users to see either the base version or\nthe variation attributed to one particular witness.\nOld manuscripts\nMany other features of old manuscripts may be recorded in TEI texts: the condition of the\nmanuscript (damaged areas), a record of erasures and insertions in the original hand-\nwritten version, the level of certainty about the transcription of the text from hard-to-read\nareas, the colour of the ink used, changes in the 'hand' of the scribe, and so on. This may\nbe supplemented with information provided by various scholars who have studied the text\nand have added corrections of apparent errors, expansions of abbreviations used, and\nsuggested text to use in place of damaged areas.\nRelating such information directly to the pages of a modern version could provide a\nvaluable teaching and research tool.\nConclusion\nBooks, printed worksheets and other paper-based documents are likely to remain a key\npart of every student's learning environment. The challenge facing teachers and students is\nto integrate computer-enhanced activities into this environment.\n100\nAIT-J Volume 6 Number I\nWe have shown that it is feasible to use the DigitalDesk as a means of accessing the\ninformation in TEI texts from ordinary printed texts. Although the existing system lacks\nthe speed required for use in real learning situations, it is constructed from readily available\ncomponents which are improving in performance all the time. One of the most time-\nconsuming parts of the system, page recognition, can also be achieved in other ways (foe\nexample, the barcodes regularly used for this purpose in industry), and a hybrid system\ncould be developed in the future.\nAcknowledgements\nThe original DigitalDesk was built by Pierre Wellner, a research student sponsored by\nRank Xerox in the Computer Laboratory at the University of Cambridge. Current work\non animated paper documents is sponsored by the EPSRC. Heather Brown would like to\nthank the Computer Laboratory at the University of Cambridge for its hospitality during\n1997 while this work was in progress.\nReferences\nAlschuler, L. (1995), ABCD . . . SGML: A User's Guide to Structured Information, London:\nInternational Thomson Computer Press.\nBurnage, G. and Dunlop, D. (1993), 'Encoding the British National Corpus', in Aarts, J.,\nde Haan, P. and Oostdijk, N. (eds), English Language Corpora: Design, Analysis and\nExploitation, Amsterdam: Rodopi, 79-95.\nBurnard, L. (1995), Users' Reference Guide for the British National Corpus, Version 1.0,\nOxford: Oxford University Computing Services.\nCarroll, L. (retold by Bassett, X, 1994), Alice's Adventures in Wonderland, Oxford: Oxford\nBookworms (OUP).\nGoldfarb, C. F. (1990), The SGML Handbook, Oxford: OUP.\nHarding, R. D., Lay, S., Robinson, P., Sheppard, D. and Watts, R. (1997), 'New technology\nfor interactive CAL\\ ALT-J, 5 (1).\nRobinson, P., Sheppard, D., Watts, R., Harding, R. D. and Lay, S. (1997), 'A framework for\ninteracting with paper', Proceedings of Eurographics '97, 16 (3).\nSperberg-McQueen, C. M. and Burnard, L. (1994), Guidelines for Electronic Text Encoding\nand Interchange (TEI P3), Chicago and Oxford: ACH\/ACL\/ALLC (Association for Com-\nputers and the Humanities, Association for Computational Linguistics, Association for\nLiterary and Linguistic Computing).\nWellner, P. (1991), 'The DigitalDesk calculator - tangible manipulation on a desk-top\ndisplay', Proceedings of the ACM Symposium on User Interface Software and Technology,\nHilton Head, November 1991.\nWellner, P. (1993), 'Interacting with paper on the DigitalDesk', Communications of the\nACM 36 (7), July.\n101\n"}