{"doi":"10.1063\/1.2908893","coreId":"69756","oai":"oai:eprints.lancs.ac.uk:22893","identifiers":["oai:eprints.lancs.ac.uk:22893","10.1063\/1.2908893"],"title":"Neutron reflection from the liquid helium surface.","authors":["Charlton, T. R.","Dalgliesh, R. M.","Ganshin, A.","Kirichek, O.","Langridge, S.","McClintock, Peter V. E."],"enrichments":{"references":[{"id":1027559,"title":"Phys.","authors":[],"date":"1997","doi":"10.1103\/physrevlett.79.4218","raw":"K. Shirahama, O.I. Kirichek and K. Kono Phys. Rev. Lett. 79, 4218, (1997)","cites":null},{"id":1027268,"title":"Two-Dimensional Coulomb Liquids and Solids,","authors":[],"date":"2004","doi":"10.1007\/978-3-662-10639-6","raw":"Yu. Monarkha and K. Kono Two-Dimensional Coulomb Liquids and Solids, Springer (2004)","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-04","abstract":"The reflection of neutrons from a helium surface has been observed for the first time. The 4He surface is smoother in the superfluid state at 1.54 K than in the case of the normal liquid at 2.3 K. In the superfluid state we also observe a surface layer ~200 Å thick which has a subtly different neutron scattering cross-section, which may be explained by an enhanced Bose-Einstein condensate fraction close to the helium surface. The application of neutron reflectometry described in this paper creates new and exciting opportunities for the surface and interfacial study of quantum fluids","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69756.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/22893\/1\/preLTP2008NeutronReflection.pdf","pdfHashValue":"f74249656f99b1e777bbc599a8f6dfd2942a61ff","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:22893<\/identifier><datestamp>\n      2018-01-24T02:42:24Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Neutron reflection from the liquid helium surface.<\/dc:title><dc:creator>\n        Charlton, T. R.<\/dc:creator><dc:creator>\n        Dalgliesh, R. M.<\/dc:creator><dc:creator>\n        Ganshin, A.<\/dc:creator><dc:creator>\n        Kirichek, O.<\/dc:creator><dc:creator>\n        Langridge, S.<\/dc:creator><dc:creator>\n        McClintock, Peter V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        The reflection of neutrons from a helium surface has been observed for the first time. The 4He surface is smoother in the superfluid state at 1.54 K than in the case of the normal liquid at 2.3 K. In the superfluid state we also observe a surface layer ~200 Å thick which has a subtly different neutron scattering cross-section, which may be explained by an enhanced Bose-Einstein condensate fraction close to the helium surface. The application of neutron reflectometry described in this paper creates new and exciting opportunities for the surface and interfacial study of quantum fluids.<\/dc:description><dc:date>\n        2008-04<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/22893\/1\/preLTP2008NeutronReflection.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1063\/1.2908893<\/dc:relation><dc:identifier>\n        Charlton, T. R. and Dalgliesh, R. M. and Ganshin, A. and Kirichek, O. and Langridge, S. and McClintock, Peter V. E. (2008) Neutron reflection from the liquid helium surface. Low Temperature Physics, 34 (4). pp. 316-319. ISSN 1090-6517<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/22893\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1063\/1.2908893","http:\/\/eprints.lancs.ac.uk\/22893\/"],"year":2008,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"Neutron reflection from the liquid helium surface \n \nT. R. Charlton\n1\n,  R. M. Dalgliesh\n1\n,  A. Ganshin\n2\n, O. Kirichek\n1\n,   S. Langridge\n1\n, \nP. V. E. McClintock\n2\n \n \n1\nISIS, STFC, Rutherford Appleton Laboratory, Harwell, Didcot, UK \n2\n Lancaster University, Lancaster, UK \n \nThe importance of liquid helium for physics can hardly be overestimated. Its \nunique ability to remain liquid right down to absolute zero makes helium an ideal \nexperimental sample for studying quantum phenomena in condensed matter. Helium-4 \nwas first liquefied by Kamerlingh Onnes in 1908. Since then the properties of bulk \nhelium liquid (including \n4\nHe, \n3\nHe and isotopic mixtures) have been studied in detail,  \nresulting in the discovery of many fundamental phenomena including, especially, \nsuperfluidity. However the free surface of liquid helium has attracted significantly less \nattention than the bulk liquid, perhaps due to the relatively complex experimental \nmethods that are needed for surface studies. Currently the best-known approaches are \nprobably optical ellipsometry, surface tension measurements, and investigations of two-\ndimensional charge sheets above and below the surface.  \nOptical ellipsometry was exploited for measuring the thickness and density profile \nof the liquid helium surface [1]. It was shown in experiments that the vertical thickness \nwithin which the density changes from 90 to 10% of the bulk liquid density increases \nslightly with temperature from 1.4 to 2.1 K , with an average value of 9.4 Å at 1.8 K. \nThere was also evidence of a rise of up to 3 Å between 2.1K and the superfluid transition \ntemperature (λ point). A very close value for the vertical thickness, of 9.2 ± 1 Å at 1.13 \nK, was obtained in experiments where liquid-vapor density profiles of thick \n4\nHe films \nwere measured using X-ray reflectivity [2]. \nThe surface tension of liquid helium can be measured by various experimental \nmethods [3, 4] and may be compared directly with the values derived from theoretical \nmodels [5, 6]. However, establishing the relationship between surface tension and the \ndynamical properties of superfluid helium remains a rather complex task [7]. \nPerhaps the most powerful experimental technique for studying the surface \nproperties of liquid helium is through measurements on two-dimensional charge systems \nincluding surface electrons (SE) and layer of ions trapped under the surface of liquid \nhelium [8]. The existence of the quantized capillary surface waves, or ripplons, earlier \nproposed by Atkins [7] in order to explain surface tension data, has been clearly proven \nin experiments with a two-dimensional plasma resonance in surface electrons [9]. Later, \nripplons [10] as well as scattering of surface electrons with Fermi quasi-particles from \nbulk liquid [11] were detected on liquid \n3\nHe. Soon after that, it was found that the \nmobility of surface electrons on \n3\nHe deviates drastically from the single-electron-ripplon \nscattering theory below 70 mK [12]. In contrast, the mobility of surface electrons on \n4\nHe \nfollows the single-electron-ripplon scattering theory down to 20 mK, the lowest \ntemperature achieved in the experiment. This may suggest a crossover to the long-mean-\nfree-path regime, implying a connection to the Rayleigh-like waves predicted \ntheoretically in [13, 14]. A peculiar temperature dependence was also observed during \nstudies of the surface tension of liquid \n3\nHe [4], behavior that could not be explained in \nterms of ripplons and the quasi-particle-scattering contribution. \nCapillary waves on the surface of thick superfluid \n4\nHe films have been detected \nvia the dielectric ponderomotive effect [15]. This method allowed measurement of the \nspectrum and damping of capillary waves within the wavelength range 3.3 – 20 μm. The \ndamping was orders of magnitude smaller than the value predicted theoretically.  \n In some respects, the SE, surface tension and capillary wave methods provide \nrather indirect ways of studying the liquid helium surface experimentally, inevitably \nleading to ambiguities in the interpretation of the data. A complementary experimental \napproach that might facilitate direct studies of the microscopic properties of liquid helium \nsurface, thus illuminating this fascinating subject, is therefore much to be desired. \nIn this paper we propose a new experimental method based on the unique \ncombination of neutron reflection and ultra-low temperature sample environment: small-\nangle neutron reflection from the liquid surface, opening new opportunities for studying \nthe interface properties of quantum liquids. We also present our preliminary \nmeasurements of reflection from the superfluid and normal liquid \n4\nHe surfaces.  \nNote that a range of classical optical phenomena such as reflection, refraction and \ninterference can be also observed for slow neutrons [16, 17]. For a neutron approaching a \nplane surface at a glancing angle θ, the refractive index at the boundary between two \nmedia is defined as: \n\n\n\n\n\n\ncos\ncos\nk\nk\nn                                  (1) \nwhere k   and k  are the neutron wave vectors inside and outside the medium. Since 1n , \na limiting case occurs when 1cos  , characterized by the critical angle c  such \nthat nc cos . For c  we have total external reflection. The phenomenon is \nanalogous to the total internal reflection of light; the difference is in the sign of  1n . \nFor the thermal neutrons 1c  we can write 21cos\n2  , which leads to: \n)1(2 nc                                      (2) \nTotal reflection of slow neutrons was first reported by Fermi and co-workers [18, 19] \nand since been extensively applied to range of problems. The specular reflection of \nneutrons gives information on the neutron refractive index profile normal to a surface. \nThe refractive index is simply related to the scattering length density and hence specular \nneutron reflection can provide important information about the composition of surfaces \nand interfaces. Similar information can be obtained from x-ray reflection experiments. \nThere are many instances,  however, where the neutron method provides distinct \nadvantages. For example the neutron’s ability to penetrate through bulk samples and their \ncontainers, including cryostats, is much higher than that of x-rays. It allows for an easy \ncombination of neutron scattering with an ultra low temperature sample environment.  \n \nFig. 1 Schematic diagram of the CRISP reflectometer showing the major components. \nItems used for polarization handling have been removed from the drawing since they \nwere not used in the experiments described. \n \nOur experiments were performed on the CRISP Instrument, which was designed as a \ngeneral purpose reflectometer for the investigation of a wide spectrum of interfaces and \nsurfaces. It uses a broad-band neutron time-of-flight method for determination of the \nwavelength at fixed angles. Fig. 1 shows a schematic digram out of the instrument. 1.The \nsample geometry is horizontal, allowing investigation of liquid surfaces. The instrument \nuses the pulsed neutron beam from the ISIS neutron facility and passage via a 20 K \nhydrogen moderator provides neutron wavelengths in the range 0.5 - 6.5 Å at the source \nfrequency of 50 Hz, extending up to a maximum of 13 Å  if operated at 25 Hz. The \nincident beam is well collimated by both coarse and fine adjustable collimating slits ( S1 \n– S4) to give a variable beam size and angular divergence, with typical dimensions of 40 \nmm wide (horizontal direction) and anything up to 10 mm in height (vertical direction). A \nvariable aperture disc chopper defines the wavelength band, and prompt pulse \nsuppression is achieved by a nimonic chopper. Additional frame overlap suppression is \nprovided by the nickel-coated silicon wafer frame overlap mirrors, which remove \nwavelengths greater than 13 Å. The instrument has two types of detectors, a He single \ndetector and a 1-D position-sensitive multidetector. The instrument can also be run in a \npolarized mode allowing polarized neutron reflectivity measurements as well being able \nto perform full polarization analyes.  \nThe experimental arrangement is extremely flexible and, with the neutron beam \ninclined at 1.5˚ to the horizontal, provides well for the study of liquid surfaces. Provision \nfor liquid surfaces angles of less than 1.5˚ is achieved by the insertion of a supermirror. \nThe sample position is designed to be vibrationally isolated from the rest of the \ninstrument, further aided by active anti-vibrational damping. Much of the instrument is \nautomated allowing for precision control and a high degree of reproducibility.  \nA large variety of sample environment equipment including cryostats and ultra low \ntemperature refrigerators is available. For the experiment to be described, we used an \nOxford Instruments Variox \nBL\n cryostat for neutron scattering experiments with a variable \ntemperature insert (VTI). The temperature range of the VTI is 1.25 – 300K. A cylindrical \ncell made of aluminium alloy 6082 with inner diameter 31.4 mm, internal length 74.0 mm \nand wall thickness 0.5 mm was attached to the sample stick of the VTI. The temperature \nof the cell was measured with a calibrated Cernox sensor. \nIn order to estimate the influence of the cell and sample environment on the signal \nfrom the scattered neutrons, we performed neutron reflection calibration measurements \nfrom the surface of liquid D2O at room temperature in the same experimental setup. The \ntest demonstrated a negligible influence of the sample environment on the experimental \ndata. \nIn our experiments we attempted to study neutron reflection from the surfaces of both \nliquid \n4\nHe and \n3\nHe. However, due to the large cross-section for neutron scattering from \nthe \n3\nHe nucleus in the vapour phase, we could not detect a reflection signal from the \n3\nHe \nliquid surface within the experimental temperature range down to 1.25K. The \n3\nHe vapour \npressure decreases rapidly with temperature, and we therefore we believe that the \ntemperature reduction below ~1K should solve this problem. \nIn the experiment we condense approximately 10 litres of helium gas (at STP) into \nthe cell, which is kept at a temperature of 2 K. After the reflection signal is detected, the \ntemperature of the cell is stabilized and controlled for a sufficient period of time to collect \nneutron reflection data over a range of values of wave vector transfer Qz perpendicular to \nthe reflecting surface (see the diagram in the inset of Fig. 2), which typically takes a few \nhours. \n0.0001\n0.001\n0.01\n0.1\n1\n0.006 0.01 0.05\nT = 2.30 K\nData\nCalculation\nN\no\nrm\na\nliz\ne\nd\n R\ne\nfl\ne\nc\nti\nv\nit\ny\n (\na\nrb\n. \nu\nn\nit\ns\n)\nQ\nz\n (1\/Å)\nk\ni\nk\nf\nQ\nz\nLiquid He\n \nFig. 2 The reflectivity of the liquid \n4\nHe surface as a function of Qz measured at 2.3 K. \nThe inset shows the orientation of the incoming ki and outgoing kf wave vectors as well as \nthe momentum transfer vector Qz in relation to the liquid helium surface. \n \nWe have measured the reflectivity of the liquid \n4\nHe surface as a function of Qz at \ntemperatures of  2.3 K and 1.54 K, obtaining the results  presented in Figs. 2 and 3 \nrespectively. As a general feature both data sets show a slight downward slope of the \nreflectivity approaching the critical value, Qc~0.006 1\/Å, attributable to absorption of \nneutrons by traces of \n3\nHe at the natural isotopic ratio of about 2 x 10\n-7 \nin the supplied \n4\nHe \ngas.  Without absorption the signal below Qc would be completely flat. Past Qc, from Qz > \n0.08 1\/Å where the Born approximation applies we observe the typical ~ Qz\n-4 \ndecrease in \nthe reflectivity curve indicating, qualitatively, that the surface is smooth. \n \n10-5\n0.0001\n0.001\n0.01\n0.1\n1\n0.006 0.01 0.05\nT = 1.54\nData\nCalculation\nN\no\nrm\na\nliz\ne\nd\n R\ne\nfl\ne\nc\nti\nv\nit\ny\n (\na\nrb\n. \nu\nn\nit\ns\n)\nQ\nz\n (1\/Å)\n \nFig. 3 The reflectivity of liquid \n4\nHe surface as a function of Qz measured at 1.54 K. \n \nTo extract quantitative information from the data we compare the reflectivity profile \nwith an optical model.  In its simplest form, the model reduces to the quantum \nmechanical problem of a particle incident on a potential step. In our case, the optical \npotential has three distinct regions (vacuum, near surface, and bulk) with the transition \nbetween adjacent steps calculated as an interface roughness.  The reflectivity is calculated \nfrom the optical potential using a recursive definition of the reflectivity, taking into \naccount multiple reflections [20].  The numerical description of the interface roughness \nfollows that of reference [21].  The results of the calculation are shown as lines through \nthe data in Fig. 2 and 3 with the optical potential shown in Fig. 4. From the calculations it \nis clear that, near the surface, a region with higher scattering power exits in the 1.54K \ncase as compared to the 2.30K calculations.  Also the transition from bulk to vacuum at \n2.30K occurs gradually over a large 800 Å distance while, at 1.54K, the transition is \ncompressed into ~400 Å. We can suggest a possible explanation for this observation.   \n \n0\n2 10-7\n4 10-7\n6 10-7\n8 10-7\n1 10-6\n1.2 10-6\n0 200 400 600 800 1000\nT = 2.30 K\nT = 1.54 K\nS\nc\na\ntt\ne\nri\nn\ng\n P\no\nte\nn\nti\na\nl \n(1\n\/Å\n2\n)\nDepth (Å)\n \n \n Fig. 4 The scattering potential profiles obtained by numerical simulation, using the \nreflectivity data for 2.3 K and 1.54 K. The abscissa corresponds to vacuum below 0 Å, to \nthe near-surface region between 0 Å and 800 Å, and to bulk liquid \n4\nHe above 800 Å. \nNote that the optical potential is proportional to the density and scattering power of the \nmaterial.  \n \n \nExperiments on liquid \n4\nHe with both neutron scattering [22, 23] and X-ray diffraction \n[24] indicate a significant change in the structure of liquid as it cools through the \nsuperfluid transition. This observation was also supported by Monte Carlo simulations \n[25] where it was shown that, when Bose condensation takes place, the liquid \n4\nHe \nbecomes more disordered in Cartesian space with some rearrangement of atoms occurring \nto create the necessary space for delocalization to occur. If there is an enhanced Bose-\nEinstein condensate fraction close to the surface of the superfluid [26, 27], an increase in \ndisorder could be expected, possibly accounting for the alteration in the neutron \nscattering structure factor. However thorough theoretical modelling is now required to \nestablish whether the results observed in the experiment can be accounted for \nquantitatively on this basis.    \n  \nIn conclusion, we have observed neutron reflection from the \n4\nHe surface for the first \ntime. The surface is smoother in the superfluid state at 1.54 K than in the case of the \nnormal liquid at 2.3 K. We have also observed a surface layer ~200 Å thick with slightly \ndifferent neutron scattering structure factor in superfluid \n4\nHe. The new experimental \nmethod described in this paper opens up fresh opportunities in the study of quantum \nfluids and solid quantum surfaces and interfaces. For example it could be used for direct \nobservation of Fomin surface excitations on liquid \n3\nHe [13], or in the search for a \nsuperfluid transition in 2D \n3\nHe on the surface of micro-separated \n3\nHe-\n4\nHe liquid mixture \n[28] \n \n \nReferences \n \n1. D.V. Osborne, J. Phys.: Condens. Matter 1, 289 (1989)  \n2. L.B. Lurio,  T.A. Rabedeau, P.S. Pershan, Isaac F. Silvera, M. Deutsch, S.D. \nKosowsky, and B.M. Ocko Phys. Rev. Lett. 68, 2628, (1992) \n3. K.N. Zinoveva, ZhETF 29, 899 (1955) \n4. K. Matsumoto, Y. Okuda, M. Suzuki, and S. Misawa  J. of Low Temp. Phys. 125, 59 \n(2001) \n5. K.R. Atkins Can. J. Phys. 31, 1165 (1953) \n6. A.D. Singh, Phys. Rev. 125, 802 (1962)  \n7. K.R. Atkins and Y. Narahara Phys. Rev. 138, A437 (1965) \n8. Yu. Monarkha and K. Kono Two-Dimensional Coulomb Liquids and Solids,  \nSpringer (2004) \n9. C.C. Grimes and G. Adams Phys. Rev. Lett. 36, 145, (1976) \n10. K. Shirahama, S. Ito, H. Suto and K. Kono J. Low Temp. Phys. 101, 439 (1995) \n11. K. Shirahama, O.I. Kirichek and K. Kono Phys. Rev. Lett. 79, 4218, (1997) \n12. O. Kirichek, M. Saitoh, K. Kono, F.I.B. Williams Phys. Rev. Letts, 86, 4064 (2001) \n13. I.A. Fomin, Sov. Phys. JETP 34, 1371 (1972) \n14. Yu.B. Ivanov, Sov. Phys. JETP 52, 549 (1980) \n15. P. Roche, G. Deville, K.O. Keshishev, N.J. Appleyard, and F.I.B. Williams Phys. \nRev. Lett. 75, 3316, (1995) \n16. A.G. Klein and S.A. Werner Rep. Prog. Phys. 46, 259 (1982) \n17. J. Penfold and R.K. Thomas J. Phys.: Condens. Matter 2, 1369 (1990) \n18. E. Fermi and W. Zinn Phys. Rev. 70, 103 (1946) \n19. E. Fermi and W. Marshall Phys. Rev. 71, 666 (1947) \n20. L. G. Parratt, Phys. Rev., 95(2), 359 (1954) \n21. L. Nevot and P. Croce, Rev. Phys. Appl. 15, 761 (1980) \n22. V.F. Sears and E.C. Svensson, Phys. Rev. Lett. 43, 2009 (1979)  \n23. E.C. Svensson, V.F. Sears, A.D.B. Woods, and P. Martel Phys. Rev. B 21, 3638 \n(1980) \n24 H.N. Robkoff, D.A. Ewen, and R.B. Hallock Phys. Rev. Lett. 43, 2006 (1979) \n25. J. Mayers, Phys. Rev. Lett. 84, 314 (2000) \n26. A. Griffin and S. Stringari Phys. Rev. Lett. 76, 259 (1996) \n27. A.F.G. Wyatt Nature 391, 56 (1998) \n28. P.A. Sheldon and R.B. Hallock Phys. Rev. Lett. 77, 2973 (1996)  \n \n \n"}