{"doi":"10.1016\/j.cities.2004.04.003","coreId":"93244","oai":"oai:eprints.lse.ac.uk:2918","identifiers":["oai:eprints.lse.ac.uk:2918","10.1016\/j.cities.2004.04.003"],"title":"Gender and integrated area development projects: lessons from Cato Manor, Durban","authors":["Beall, Jo","Todes, Alison"],"enrichments":{"references":[{"id":17299618,"title":"(Ed) A City for All: Valuing Difference and Working with Diversity,","authors":[],"date":"1997","doi":"10.2307\/216030","raw":"Beall, J (1997) (Ed) A City for All: Valuing Difference and Working with Diversity, Zed, London.","cites":null},{"id":17299635,"title":"A report on the socio-economic survey of the informal area of Cato Crest in Cato Manor.","authors":[],"date":"1995","doi":null,"raw":"Makhathini, M and Xaba, T (1995) A report on the socio-economic survey of the informal area of Cato Crest in Cato Manor. Unpublished manuscript.","cites":null},{"id":17299646,"title":"Alleviating urban poverty in a global city: new trends in upgrading Rio-de-Janiero’s favelas,","authors":[],"date":"1998","doi":null,"raw":"Pamuk, A and Cavallieri, P (1998) Alleviating urban poverty in a global city: new trends in upgrading Rio-de-Janiero’s favelas, Habitat International 22 (4), 449-462.","cites":null},{"id":17299624,"title":"Area based management and the production of the public domain.","authors":[],"date":"2000","doi":null,"raw":"Chipkin, I (2000) Area based management and the production of the public domain. Unpublished manuscript.","cites":null},{"id":17299650,"title":"Area-based initiatives: the rationale for and options for area targeting, Centre for Analysis of Social Exclusion Paper 25, London School of Economics.","authors":[],"date":"1999","doi":null,"raw":"Smith, G  (1999) Area-based initiatives: the rationale for and options for area targeting, Centre for Analysis of Social Exclusion Paper 25, London School of Economics.","cites":null},{"id":17299625,"title":"Cato Manor business audit and business survey project. Report to Cato Manor Development Association.","authors":[],"date":"2002","doi":null,"raw":"Delca (2002) Cato Manor business audit and business survey project. Report to Cato Manor Development Association.","cites":null},{"id":17299627,"title":"Cato Manor: disjunctures between project design and reality on the ground. Paper presented to the Urban Reconstruction and Cato Manor Conference, Cato Manor Development Association,","authors":[],"date":"2003","doi":null,"raw":"Dewar, D and Kaplan, M (2003) Cato Manor: disjunctures between project design and reality on the ground. Paper presented to the Urban Reconstruction and Cato Manor Conference, Cato Manor Development Association, Durban. .","cites":null},{"id":17299631,"title":"Class, race and settlement in Cato Manor: A report on surveys of African and Indian households in Cato Manor –","authors":[],"date":"1993","doi":null,"raw":"Hindson, D and Byerley, M (1993) Class, race and settlement in Cato Manor: A report on surveys of African and Indian households in Cato Manor – 1992. Unpublished manuscript.","cites":null},{"id":17299615,"title":"Doing gender from top to bottom? The South African case, Women: A Cultural Review,","authors":[],"date":"2001","doi":"10.1080\/095740401750534402","raw":"Beall, J (2001) Doing gender from top to bottom? The South African case, Women: A Cultural Review, 12 (2), 135-146.","cites":null},{"id":17299626,"title":"Evolving approaches. In Devas, N and Rakodi, C (Eds) Managing Fast Growing Cities.","authors":[],"date":"1993","doi":"10.2307\/144365","raw":"Devas, N (1993)  Evolving approaches. In Devas, N and Rakodi, C (Eds) Managing Fast Growing Cities. Routledge, London, pp. 63-101.","cites":null},{"id":17299648,"title":"Favelo Barrio and a new generation of housing programmes for the urban poor.","authors":[],"date":"2001","doi":"10.1016\/s0016-7185(01)00016-1","raw":"Riley, E, Fiori, J and Ramirez, R (2001)  Favelo Barrio and a new generation of housing programmes for the urban poor. Geoforum, 32, 521-531.","cites":null},{"id":17299632,"title":"Feminist Visions of Development: Gender Analysis and Policy.","authors":[],"date":"1998","doi":"10.4324\/9780203980460","raw":"Jackson, C and Pearson, R (1998) Feminist Visions of Development: Gender Analysis and Policy. Routledge, New York.","cites":null},{"id":17299613,"title":"Gender and urban development in Cato Manor. Paper presented to the Urban Reconstruction and Cato Manor Conference, Cato Manor Development Association,","authors":[],"date":"2003","doi":"10.1016\/j.cities.2004.04.003","raw":"Beall, J, Todes, A and Maxwell, H (2003). Gender and urban development in Cato Manor. Paper presented to the Urban Reconstruction and Cato Manor Conference, Cato Manor Development Association, Durban.","cites":null},{"id":17299653,"title":"Gender mainstreaming: what is it and should we continue doing it?","authors":[],"date":"2003","doi":"10.1111\/j.1759-5436.2004.tb00157.x","raw":"Woodford Berger, P (2003) Gender mainstreaming: what is it and should we continue doing it? Paper presented to the Institute of Development Studies Conference, Gender Myths and Feminist Fables: Repositioning Gender in Development Policy and Practice, University of Sussex. Captions","cites":null},{"id":17299637,"title":"Gender Planning and Development: Theory, Practice and Training.","authors":[],"date":"1993","doi":"10.4324\/9780203411940","raw":"Moser, C (1993) Gender Planning and Development: Theory, Practice and Training. Routledge, London.","cites":null},{"id":17299633,"title":"Gender, Planning and the Policy Process.","authors":[],"date":"1994","doi":"10.1177\/0739456x9501500111","raw":"Little, J (1994) Gender, Planning and the Policy Process. Pergamon, London.","cites":null},{"id":17299639,"title":"Globalisation and Integrated Area Development in European Cities.","authors":[],"date":"2001","doi":"10.1080\/1360481042000242201","raw":"Moulaert, F  (2001)  Globalisation and Integrated Area Development in European Cities. Pion, London.","cites":null},{"id":17299614,"title":"Headlines and head-space: challenging gender planning orthodoxy in area-based urban development.","authors":[],"date":"2003","doi":"10.1111\/j.1759-5436.2004.tb00154.x","raw":"Beall, J and Todes, A (2003) Headlines and head-space: challenging gender planning orthodoxy in area-based urban development. Paper presented to the Institute of Development Studies Conference, Gender Myths and Feminist Fables: Repositioning Gender in Development Policy and Practice, University of Sussex.","cites":null},{"id":17299649,"title":"Institutional and planning history of the Cato Manor development, 1990-2002, Report to the Cato Manor Development Association.","authors":[],"date":"2002","doi":null,"raw":"Robinson, P and Foster, C (2002) Institutional and planning history of the Cato Manor development, 1990-2002, Report to the Cato Manor Development Association.","cites":null},{"id":17299643,"title":"Integrated local area projects: working towards innovation and sustainability. Paper presented to the Planning Africa Conference,","authors":[],"date":"2002","doi":"10.1007\/s12132-004-0012-6","raw":"Odendaal, N, Todes, A and Cameron, J (2002) Integrated local area projects: working towards innovation and sustainability. Paper presented to the Planning Africa Conference, Durban.","cites":null},{"id":17299641,"title":"Local economic development in a low income area: the case of Cato Manor. Paper presented to the Urban Reconstruction and Cato Manor Conference, Cato Manor Development Association,","authors":[],"date":"2003","doi":null,"raw":"Nel, E, Taylor, B and Eising, W (2003) Local economic development in a low income area: the case of Cato Manor. Paper presented to the Urban Reconstruction and Cato Manor Conference, Cato Manor Development Association, Durban.","cites":null},{"id":17299651,"title":"Localization or mainstream bending in urban regeneration? Local","authors":[],"date":"1999","doi":"10.1080\/02690949908726476","raw":"Turok, I (1999) Localization or mainstream bending in urban regeneration? Local Economy, May, 72-86.","cites":null},{"id":17299640,"title":"Mainstreaming gender or ‘streaming’ gender away: feminists marooned in the development business.","authors":[],"date":"2003","doi":"10.1111\/j.1759-5436.2004.tb00161.x","raw":"Mukhopadhyay, M (2003) Mainstreaming gender or ‘streaming’ gender away: feminists marooned in the development business. Paper presented to the Institute of Development Studies Conference, Gender Myths and Feminist Fables: Repositioning Gender in Development Policy and Practice, University of Sussex.","cites":null},{"id":17299628,"title":"men, women, crowds, violence, politics and history. In: Maylam, P and Edwards, I (Eds) The People’s City: African Life","authors":[],"date":"1996","doi":null,"raw":"Edwards, I (1996) Cato Manor, June 1959: men, women, crowds, violence, politics and history. In: Maylam, P and Edwards, I (Eds) The People’s City: African Life in 20 th Century Durban, University of Natal Press, Pietermaritzburg.","cites":null},{"id":17299630,"title":"Public entrepreneurship in a low income township development. Paper presented to the Urban Reconstruction and Cato Manor Conference, Cato Manor Development Association,","authors":[],"date":"2003","doi":null,"raw":"Hindson, D, Foster, C and Eising, W (2003) Public entrepreneurship in a low income township development. Paper presented to the Urban Reconstruction and Cato Manor Conference, Cato Manor Development Association, Durban.","cites":null},{"id":17299622,"title":"Regen(d)eration: women and urban policy in","authors":[],"date":"2000","doi":null,"raw":"Brownill, S (2000) Regen(d)eration: women and urban policy in Britain. In: Darke, J, Ledwith, S, and Woods, R. (Eds) Women and the City. Visibility and Voice in Urban Space. Palgrave, Basingstoke.","cites":null},{"id":17299610,"title":"Rethinking UK aid in urban India: reflections on an impact assessment study of slum improvement projects. Environment and Urbanisation,","authors":[],"date":"2001","doi":"10.1630\/095624701101285694","raw":"Alsop, R., Clisby, S and Craig, G (2001) Young, Urban and Female, YWCA, Oxford. Amis, P (2001) Rethinking UK aid in urban India: reflections on an impact assessment study of slum improvement projects. Environment and Urbanisation, 13(1) 101-113.","cites":null},{"id":17299623,"title":"Rich Mix: Strategies for Inclusive Regeneration.","authors":[],"date":"1998","doi":null,"raw":"Brownill, S and Darke, J (1998) Rich Mix: Strategies for Inclusive Regeneration. Policy Press, Bristol.","cites":null},{"id":17299636,"title":"Space based economic development? Views from Los Angeles. Paper presented to the European Urban","authors":[],"date":"2001","doi":null,"raw":"Modarres, A (2001)  Space based economic development? Views from Los Angeles. Paper presented to the European Urban Research Association Conference on Integrated Area Based Initiatives in Contemporary Urban Policy, Copenhagen.","cites":null},{"id":17299634,"title":"Squatting dynamics: a look from within Cato Manor.","authors":[],"date":"1992","doi":null,"raw":"Makhathini, M (1992) Squatting dynamics: a look from within Cato Manor. Unpublished manuscript.","cites":null},{"id":17299652,"title":"The integrated urban infrastructure development programme and urban management innovations in Indonesia, Institute for Housing and Urban Development Studies Working Paper 7,","authors":[],"date":"1993","doi":"10.3362\/9781780442525.005","raw":"Van der Hoff, R and Steinberg, F (1993)  The integrated urban infrastructure development programme and urban management innovations in Indonesia, Institute for Housing and Urban Development Studies Working Paper 7, Rotterdam.","cites":null},{"id":17299621,"title":"The US empowerment zone program. The evolution of a national urban program and the failure of local implementation in","authors":[],"date":"2001","doi":null,"raw":"Boyle, R and Eisenger, P (2001)  The US empowerment zone program. The evolution of a national urban program and the failure of local implementation in Detroit, Michigan. Paper presented to the European Urban Research Association Conference on Integrated Area Based Initiatives in Contemporary Urban Policy, Copenhagen.","cites":null},{"id":17299616,"title":"Trickle down or rising tide? Lessons on mainstreaming gender policy from Colombia and South Africa, Social Policy and Administration,","authors":[],"date":"1998","doi":"10.1111\/1467-9515.00112","raw":"Beall, J (1998) Trickle down or rising tide? Lessons on mainstreaming gender policy from Colombia and South Africa, Social Policy and Administration, 32 (5), 513-534.","cites":null},{"id":17299620,"title":"Uniting a Divided City, Governance and Social Exclusion in","authors":[],"date":"2002","doi":"10.1093\/afraf\/adh013","raw":"Beall, J, Crankshaw, O and Parnell, S (2002) Uniting a Divided City, Governance and Social Exclusion in Johannesburg, Earthscan, London.","cites":null},{"id":17299619,"title":"Urban Governance: Why Gender Matters,","authors":[],"date":"1996","doi":null,"raw":"Beall, J (1996) Urban Governance: Why Gender Matters, Gender in Development Monograph Series No 1, United Nations Development Programme, New York.","cites":null},{"id":17299647,"title":"Urban regeneration in the era of HIV\/AIDS: the case of Cato Manor, Paper presented to the Urban Reconstruction and Cato Manor Conference, Cato Manor Development Association,","authors":[],"date":"2003","doi":null,"raw":"Petersen, I, Bhagwanjee, A, Bhana, A and Mzimela, F (2003) Urban regeneration in the era of HIV\/AIDS: the case of Cato Manor, Paper presented to the Urban Reconstruction and Cato Manor Conference, Cato Manor Development Association, Durban.","cites":null},{"id":17299612,"title":"What is the special purpose of area based initiatives? How to understand deprived neighbourhoods. Paper presented to the European Urban Research Association Conference on Integrated Area Based Initiatives in Contemporary Urban Policy,","authors":[],"date":"2001","doi":null,"raw":"Anderson, H (2001)  What is the special purpose of area based initiatives? How to understand deprived neighbourhoods. Paper presented to the European Urban Research Association Conference on Integrated Area Based Initiatives in Contemporary Urban Policy, Copenhagen.","cites":null},{"id":17299629,"title":"Women and Planning, Creating Gendered Realities,","authors":[],"date":"1994","doi":"10.4324\/9780203410288","raw":"Greed, C (1994) Women and Planning, Creating Gendered Realities, Routledge, London.","cites":null},{"id":17299645,"title":"Women in the City: Housing, Services and the Urban Environment, Organisation for Economic Cooperation and Development,","authors":[],"date":"1995","doi":null,"raw":"OECD (1995) Women in the City: Housing, Services and the Urban Environment, Organisation for Economic Cooperation and Development, Paris.","cites":null},{"id":17299638,"title":"Women, Housing and Human Settlements.","authors":[],"date":"1987","doi":"10.1017\/s0022216x00003217","raw":"Moser, C and Peake, L (1987) Women, Housing and Human Settlements. Tavistock, London.","cites":null},{"id":17299642,"title":"Women’s Participation in Housing Delivery in South Africa: The Extent of Empowerment","authors":[],"date":"2001","doi":"10.1080\/03768350701650579","raw":"Ndinda, C (2001) Women’s Participation in Housing Delivery in South Africa: The Extent of Empowerment in Post-1994 Era, With Specific Reference to Case Studies in KwaZulu-Natal, PHD Thesis, University of Natal, Durban.","cites":null}],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2004-08","abstract":"The paper examines whether integrated area development projects are particularly well placed to recognize the complexity and diversity of gender relations and provide important space for gender sensitive planning and practice. It recounts the case of the Cato Manor project in Durban, South Africa where, despite no explicit focus on gender in design, practices were remarkably consistent with the prescriptions of the urban gender planning literature. It is argued that a multi-sectoral and integrated approach offers space for innovation and close attention to local dynamics. Hence despite a disjuncture between planning and implementation, a nuanced gender aware approach emerged. There were also limitations and these are highlighted, recognizing feminist critiques of area-based development that show gender-aware practice is not automatic. In the case of Cato Manor, it depended on facilitative political and policy conditions, politically empowered and organized women and gender-aware professionals. Nevertheless, the area-based focus of the project was also helpful","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/93244.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/2918\/1\/Gender_and_integrated_area_development.pdf","pdfHashValue":"cb6e92fdf0fc864a8c831287d750e0a0e0ae6bf1","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:2918<\/identifier><datestamp>\n      2010-10-01T08:48:39Z<\/datestamp><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3236<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D44455354<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/2918\/<\/dc:relation><dc:title>\n        Gender and integrated area development projects: lessons from Cato Manor, Durban<\/dc:title><dc:creator>\n        Beall, Jo<\/dc:creator><dc:creator>\n        Todes, Alison<\/dc:creator><dc:subject>\n        HT Communities. Classes. Races<\/dc:subject><dc:description>\n        The paper examines whether integrated area development projects are particularly well placed to recognize the complexity and diversity of gender relations and provide important space for gender sensitive planning and practice. It recounts the case of the Cato Manor project in Durban, South Africa where, despite no explicit focus on gender in design, practices were remarkably consistent with the prescriptions of the urban gender planning literature. It is argued that a multi-sectoral and integrated approach offers space for innovation and close attention to local dynamics. Hence despite a disjuncture between planning and implementation, a nuanced gender aware approach emerged. There were also limitations and these are highlighted, recognizing feminist critiques of area-based development that show gender-aware practice is not automatic. In the case of Cato Manor, it depended on facilitative political and policy conditions, politically empowered and organized women and gender-aware professionals. Nevertheless, the area-based focus of the project was also helpful.<\/dc:description><dc:date>\n        2004-08<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/2918\/1\/Gender_and_integrated_area_development.pdf<\/dc:identifier><dc:identifier>\n          Beall, Jo and Todes, Alison  (2004) Gender and integrated area development projects: lessons from Cato Manor, Durban.  Cities, 21 (4).  pp. 301-310.  ISSN 0264-2751     <\/dc:identifier><dc:relation>\n        http:\/\/www.elsevier.com\/locate\/issn\/02642751<\/dc:relation><dc:relation>\n        10.1016\/j.cities.2004.04.003<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/2918\/","http:\/\/www.elsevier.com\/locate\/issn\/02642751","10.1016\/j.cities.2004.04.003"],"year":2004,"topics":["HT Communities. Classes. Races"],"subject":["Article","PeerReviewed"],"fullText":""}