{"doi":"10.1016\/j.indmarman.2004.07.016","coreId":"138414","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/2661","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/2661","10.1016\/j.indmarman.2004.07.016"],"title":"Supply chain cost management and value-based pricing.","authors":["Christopher, Martin","Gattorna, John"],"enrichments":{"references":[{"id":38071386,"title":"Consulting Group, Perspectives on Experience,","authors":[],"date":"1972","doi":null,"raw":"Boston Consulting Group, Perspectives on Experience, 1972","cites":null},{"id":38071396,"title":"CPFR Only the Beginning of Collaboration”, Supply Chain Management Review, September\/October","authors":[],"date":"2000","doi":null,"raw":"Ireland, R. & Bruce R., “CPFR Only the Beginning of Collaboration”, Supply Chain Management Review, September\/October 2000, pp 80-88","cites":null},{"id":38071393,"title":"Designing Interactive","authors":[],"date":null,"doi":"10.1002\/jsc.4240040207","raw":"Normann, R. & Ramirez, R., Designing Interactive Strategy, Wiley,","cites":null},{"id":38071397,"title":"Handbook of Supply Chain Management,","authors":[],"date":"2003","doi":"10.1108\/02656710310491276","raw":"Gattorna, John L (ed), Handbook of Supply Chain Management, Gower Publishing: Aldershot, 2003, p.4.Industrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005","cites":null},{"id":38071392,"title":"Logistics and Supply Chain Management,","authors":[],"date":null,"doi":"10.4324\/9780203805862","raw":"Christopher, M.G., Logistics and Supply Chain Management, (1st Edition), Pearson, 1992","cites":null},{"id":38071395,"title":"New Strategic Tools for Supply Chain Management”,","authors":[],"date":"1991","doi":"10.1108\/09600039110002225","raw":"Scott, C. and Westbrook, R., “New Strategic Tools for Supply Chain Management”, International Journal of Physical Distribution & Logistics Management, Vol. 21, No. 1., 1991","cites":null},{"id":38071387,"title":"One World, Ready or Not, Simon","authors":[],"date":"1998","doi":"10.2307\/4613552","raw":"Greider, W., One World, Ready or Not, Simon & Schuster, 1998","cites":null},{"id":38071398,"title":"Strategic Supply Chain Alignment,","authors":[],"date":"1998","doi":"10.4018\/978-1-60960-585-8.ch002","raw":"Gattorna, J.L., (ed), Strategic Supply Chain Alignment, Gower Publishing: Aldershot, 1998, pps. 1-7.","cites":null},{"id":38071399,"title":"The Customer has Escaped”, Harvard Business Review,","authors":[],"date":"2003","doi":null,"raw":"Nunes, Paul, F. and Cespedes, Frank, V., “ The Customer has Escaped”, Harvard Business Review, November 2003, pps. 96-105.","cites":null},{"id":38071390,"title":"The Distribution Age,","authors":[],"date":"1929","doi":null,"raw":"Borsodi, R., The Distribution Age, New York, D Appleton & Co, 1929, p.3","cites":null},{"id":38071394,"title":"The Economic Institutions of Capitalism,","authors":[],"date":null,"doi":"10.1007\/978-3-8349-9320-5_6","raw":"Williamson, O.E., The Economic Institutions of Capitalism, Free Press,","cites":null},{"id":38071388,"title":"The Power of Pricing”,","authors":[],"date":"2003","doi":null,"raw":"Marn, M.V., Roegner, E.V. & Zawada, C.C., The Power of Pricing”, McKinsey Quarterly, 2003, No. 1, pp 27-39","cites":null},{"id":38071391,"title":"The Three-Day Car Challenge – Investigating the Inhibitors of Responsive Order Fulfilment in New Vehicle Supply Systems,","authors":[],"date":"2002","doi":"10.1080\/1367556031000123106","raw":"Holweg, M. The Three-Day Car Challenge – Investigating the Inhibitors of Responsive Order Fulfilment in New Vehicle Supply Systems, Ph.D. Thesis, Cardiff Business School, University of Wales, 2002","cites":null},{"id":38071389,"title":"When your competitor delivers more for less”, McKinsey Quarterly,","authors":[],"date":"2004","doi":null,"raw":"Frank, R.J., George, J.P. & Narasimhan, L., “When your competitor delivers more for less”, McKinsey Quarterly, 2004, No. 1, pp 49-59Industrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-02","abstract":"Continued deflationary trends in many markets around the world are creating greater pressure for cost reduction in order that margins can be maintained. Customers and consumers are increasingly value driven and consequently less brand or supplier loyal. In this challenging world, there is a growing recognition that creative pricing strategies combined with effective supply chain management provide opportunities for significant cost reduction and increased profits. This paper presents evidence to support this viewpoint and suggests an approach to supply chain alignment that can enable cost reduction opportunities to be identified and higher profits to be achieved through collaborative strategies","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138414.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.indmarman.2004.07.016","pdfHashValue":"d4569c368258ac842e0f0ad4bbe120acb89123e9","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/2661<\/identifier><datestamp>2008-06-25T09:01:17Z<\/datestamp><setSpec>hdl_1826_28<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Supply chain cost management and value-based pricing.<\/dc:title><dc:creator>Christopher, Martin<\/dc:creator><dc:creator>Gattorna, John<\/dc:creator><dc:subject>Supply chain<\/dc:subject><dc:subject>Cost management<\/dc:subject><dc:subject>Value-based pricing<\/dc:subject><dc:description>Continued deflationary trends in many markets around the world are creating greater pressure for cost reduction in order that margins can be maintained. Customers and consumers are increasingly value driven and consequently less brand or supplier loyal. In this challenging world, there is a growing recognition that creative pricing strategies combined with effective supply chain management provide opportunities for significant cost reduction and increased profits. This paper presents evidence to support this viewpoint and suggests an approach to supply chain alignment that can enable cost reduction opportunities to be identified and higher profits to be achieved through collaborative strategies.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2008-06-25T09:01:17Z<\/dc:date><dc:date>2008-06-25T09:01:17Z<\/dc:date><dc:date>2005-02<\/dc:date><dc:type>Postprint<\/dc:type><dc:identifier>Martin Christopher, John Gattorna, Supply chain cost management and value-based pricing, Industrial Marketing Management, Volume 34, Issue 2, Pricing Issues in Industrial Marketing, February 2005, Pages 115-121.<\/dc:identifier><dc:identifier>0019-8501<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.indmarman.2004.07.016<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/2661<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0019-8501","issn:0019-8501"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Supply chain","Cost management","Value-based pricing"],"subject":["Postprint"],"fullText":"Industrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nSUPPLY CHAIN COST MANAGEMENT AND\nVALUE-BASED PRICING\nMartin Christopher & John Gattorna\nMartin Christopher*\nSchool of Management\nCranfield University\nCranfield University Bedford\nEngland MK43 0AL\ne-mail : m.g.christopher@cranfield.ac.uk\nJohn Gattorna\nc\/o Sydney Business School, L14\n175 Liverpool Street\nSydney, NSW 2000\nAustralia\ne-mail : john@gattorna-alignment.com.au\n*corresponding author\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nBiographies\nMartin Christopher\nMartin Christopher is Professor of Marketing and Logistics at Cranfield School\nof Management where he chairs the Centre for Logistics and Supply Chain\nManagement, the largest activity of its type in Europe. The work of the\ncentre covers all aspects of transportation and logistics and offers both full-\ntime and part-time Masters degree courses as well as extensive management\ndevelopment programmes.\nJohn Gattorna\nDr John Gattorna is Professorial Fellow in Supply Chain Management, and\nDirector, Supply Chain Research Centre, Sydney Business School. He is also\nVisiting Professor in Logistics and Supply Chain Management at Cranfield\nSchool of Management.\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nSUPPLY CHAIN COST MANAGEMENT AND VALUE-BASED PRICING\nContinued deflationary trends in many markets around the world are creating\ngreater pressure for cost reduction in order that margins can be maintained.\nCustomers and consumers are increasingly value driven and consequently\nless brand or supplier loyal. In this more challenging world there is a\ngrowing recognition that the supply chain provides one of the last remaining\nopportunities for significant cost reduction.\nThis paper presents evidence to support this viewpoint and suggests an\napproach to supply chain alignment that can enable cost reduction\nopportunities to be identified and, through collaborative working, to be\nactioned.\nThe opening years of the new Millennium have seen the emergence of new\ndeflationary pressures. Whilst trends to price reduction may not be universal\nthere can be no doubting that most markets are more price competitive\ntoday than they were a decade ago. Prices in the high streets and the\nshopping malls continue to fall in many western countries and upstream of\nthe retail store the prices of components, raw materials and industrial\nproducts follow the same downward pattern.\nWhilst some of this price deflation can be explained as the result of normal\ncost reduction through learning and experience effects (1), the rapid fall in\nthe price of many consumer goods has other causes. Figure 1 shows the\ncomparative rate at which VCR and DVD player prices fell in the UK market.\nThe striking feature is that whilst it took 20 years for a VCR to fall in price\nfrom £400 to just over £40, it only took 4 years for a DVD player to fall by\nthe same amount. The same phenomenon is apparent in markets as diverse\nas clothing, home furnishings and air travel.\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nFigure 1. Price deflation in consumer electronics (UK High Street\nprices)\nA fundamental change in the global competitive landscape is driving prices to\nlevels which in real terms are as low as they have ever been. A number of\ncausal factors have contributed to this new market environment.\nFirst there are new global competitors who have entered the marketplace\nsupported by low cost manufacturing bases. The dramatic rise of China as a\nmajor producer of quality consumer products is evidence of this. Secondly,\nthe removal of barriers to trade and the de-regulation of many markets has\naccelerated this trend enabling new players to rapidly gain ground. One\nresult of this has been over-capacity in many industries (2). Over-capacity\nimplies an excess of supply against demand and hence leads to further\ndownward pressure on price.\nA further cause of price deflation, it has been suggested (3) is the Internet\nwhich makes price comparison so much easier. The Internet has also\n400 -\n350 -\n300 -\n250 -\n200 -\n150 -\n100 -\n50 -\n1984 1986 1988 1990 1992 1994 1996 1998 2000 2002 2004\nVCR DVD\nVCR\n1984 £400\n2004 £45\nDVD\n1999 £400\n2004 £40\nPrice\n£\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nenabled auctions and exchanges to be established at industry-wide levels\nwhich have also tended to drive down prices.\nThere is also evidence that customers and consumers are more value\nconscious than has hitherto been the case (4). Brands and suppliers that\ncould once command a price premium because of their perceived superiority\ncan no longer do so as the market recognises that equally attractive offers\nare available at significantly lower prices. The success of many retailers’ own\nlabel products or the inroads made by low-cost airlines provide testament to\nthis sea change.\nAgainst the backdrop of a continued downward pressure on price, it is self-\nevident that, in order to maintain profitability, companies must find a way to\nbring down costs to match the fall in price.\nThe challenge to the business is to find new opportunities for cost-reduction\nwhen, in all likelihood, the company has been through many previous cost\nreduction programmes. Our contention is that the last remaining opportunity\nof any significance for major cost reduction will lie in the wider supply chain\nrather than in the firm’s own operations.\nThe Challenge of Supply Chain Costs\nIt has long been recognised by some that the key to major cost reduction lies\nnot so much in the internal activities of the firm but in the wider supply\nchain. Back in 1929 Ralph Borsodi (5) expressed it in the following words:-\n“ …. In 50 years between 1870 and 1920 the cost of distributing\nnecessities and luxuries has nearly trebled, while production costs\nhave gone down by one-fifth …. What we are saving in production we\nare losing in distribution.”\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nThe situation that Borsodi describes can still be witnessed in many industries\ntoday. For example, companies who thought they could achieve a leaner\noperation by moving to just-in-time (JIT) practices often only shifted costs\nelsewhere in the supply chain by forcing suppliers or customers to carry that\ninventory. The car industry, which to many is the home of lean thinking and\njust in time practices (6), has certainly exhibited some of those\ncharacteristics. A recent analysis of the Western European automobile\nindustry (7) showed that whilst the car assembly operations were indeed\nlean with minimal inventory, the same was not true upstream and\ndownstream of those operations. Figure 1 shows the profile of inventory\nthrough the supply chain from the Tier One suppliers down to the car\ndealerships.\nFigure 2. Inventory profile of the automotive supply chain (Source :\nHolweg (7))\nIn this particular case the paradox is that most inventory is being held when\nit is at its most expensive i.e. as a finished product. The true cost of this\ninventory to the industry is considerable. Whilst inventory costs will vary by\nindustry and by company, it can be argued (8) that the true cost of carrying\ninventory is rarely less that 25% p.a. of its value. In the conditions in which\n0\n2 0\n4 0\n6 0\n8 0\n1 0 0\n1 2 0\nR\naw\nm\nat\ne r\nia\nl\nB\no\nug\nh\nt-o\nut\nP\na r\nts\nIn\n-h\no\nus\ne\nb u\nilt\nP\na r\nts\nP r\ne-\nA\nss\nem\nb\ny\nW\nIP\nA\nss\nem\nb\nly\nW\nIP\nFi\nn i\nsh\ned\nC\no m\np o\nn\nen\nts\nIn\nb o\nu\nnd\nT\nr a\nn\nsi\nt\nO\nn-\ns i\nte\nPa\nrt\n( V\nM\n)\nV\neh\nic\nle\nP r\no\nd u\nc t\nio\nn\nW\nIP\nLo\na d\nin\ng\n&\nD\nes\npa\ntc\nh\nO\nu t\nb o\nun\nd\nT r\na\nns\ni t\nM\nar\nk e\ntp\nla\nc e\nC\nus\nto\nm\ner\nM ax im u m\nA v e r a g e\nM in i m u m\nD\nay\ns\nof\nIn\nve\nnt\nor\ny\nFirst Tier\nSupplier\nInbound\nLogistics\nVehicle\nManufacturers\nOutbound\nLogistics\nDistribution\n& Retail\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nthe automobile industry currently finds itself, this alone is enough to make\nthe difference between profit and loss.\nThis example illustrates the failure that is frequently encountered to take a\nwider view of cost. For many companies their definition of cost is limited\nonly to those costs that are contained within the four walls of their business\nentity. However, it has been argued that today’s competition takes place not\nbetween companies but between supply chains (9), hence the proper view of\ncosts has to be ‘end-to-end’ since all costs will ultimately be reflected in the\nprice of the finished product in the final marketplace.\nThe need to take a supply chain view of cost is further underscored by the\nmajor trend that is observable across industries worldwide towards out-\nsourcing. For many companies today, most of their costs lie outside their\nlegal boundaries. Activities that used to be performed in-house are now out-\nsourced to specialist service providers. The amazing growth of contract\nmanufacturing in electronics bears witness to this trend. If the majority of\nan organisation’s costs lie outside the business then it follows that the\nbiggest opportunities for improvement in their cost position will also be found\nin that wider supply chain.\nAs out-sourcing increases the supply chain becomes more like a network\nthan a chain (10) and, as a result, the number of interfaces between\norganisations increases. It is our contention that a growing proportion of\ntotal costs in the network occur at these interfaces. These costs have\nsometimes been labelled ‘transaction’ costs (11) but in truth they are much\nmore than the everyday costs of doing business. These costs result as much\nas anything from the lack of transparency and visibility across organisational\nboundaries. When we talk of visibility and transparency we mean the ability\nto see clearly from one end of the supply chain to another and, in particular,\nto share information on supply and demand issues across corporate\nboundaries.\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nReducing the cash-to-cash cycle time\nFrom an organisational standpoint a critical performance measure is cash-to-\ncash cycle time. From the moment when a business spends money with\nsuppliers for materials and components, through the manufacturing and\nassembly process to final distribution and after-market support, time is being\nconsumed. That time is represented by the number of days of inventory in\nthe pipeline, whether as raw materials, work-in-progress, goods in transit, or\ntime taken to process orders, issue replenishment orders, as well as time\nspent in manufacturing, time in queues or bottlenecks and so on.\nDetailed analysis of logistics pipelines often reveals that the length of these\ncash-to-cash cycles can be significant – often measured in months rather\nthan days. Anything that can be done to refine that end-to-end time clearly\nmeans a release of working capital and hence a reduction in cost. The\nlikelihood also is that most of the time in the pipeline will be non-value-\nadding time and in particular it will be ‘idle time’ or time spent as inventory\nthat is not on the move.\nSupply chain mapping can enable the identification of opportunities for\nreducing inventory and hence cost. Figure 3 shows an actual map for a\nparticular product, a clothing item. The vertical lines reflect the average\ninventory over the period of investigation at each step in the chain.\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nFigure 3. Supply chain mapping – an example (Source : Scott &\nWestbrook (12))\nExamination of the map highlights the fact that most inventory seems to lie\nat the interfaces between organisational entities in the chain. In fact there is\na duplication of inventory – the supplier carries inventory, their customer\ncarries inventory of the same product. Why is this? The reason is that this\ninventory is held by both parties as safety stock. Because there is no clear\nline of sight between the two adjacent entities in the chain – no shared\ninformation on the rate of orders or usage – both parties have to buffer\nagainst uncertainty with additional inventory. Remove the uncertainty and\nthe need for that inventory is removed also.\nEssentially the root cause of this excess inventory is lack of visibility caused\nby lack of communication. Fortunately there is now a growing recognition of\nthe importance of shared information in the supply chain. In consumer\ngoods distribution, for example, the adoption of ‘Collaborative Planning\nForecasting and Replenishment’ (CPFR) is beginning to make a difference.\nCPFR, as the phrase suggests, involves the joint determination of forecasts\nCommodity\nMarket\nEnd User\n(20)\n(10)\n(5) (5) (5)\n(10) (10)\n(15)(15)\n(20)\nSpinning (15) Knitting (10)\nDyeing &\nFinishing (7)\n(2)\nSewing (18)\nFibre\nYarn finished\ngoods store Yarn store\nGrey stock Finished\nfabric\nRaw\nmaterial\nstore\nCut work\nbuffer\nFinished\ngoods\nwarehouse\nDistribution\ncentre\nStore\nSpinning Fabric Supplier Underwear Manufacturer Retailer\nLength 60 Days Volume 175 Days\nComponent\ncutting (5)\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nthrough pooled knowledge and information. Based on this agreed view of\ndemand over the forecast horizon the supplier takes responsibility for the\nreplenishment of supplies based upon the actual rate of sale or usage.\nSignificant inventory reductions have been reported in numerous pilot\napplications along with simultaneous improvement in sales revenue as a\nresult of improved availability (13).\nHowever, despite all these types of initiatives, a fundamentally new approach\nto pricing is required in order to extract further value; this comes in the form\nof the supply chain alignment concept discussed below.\nAligning supply chains with customers to create more value\nAs competitive pressures have rapidly increased over the last decade, we\nhave been forced to look beyond conventional wisdom because this only\nleads to diminishing returns. For example, for a long time we have accepted\nthe convention that as service levels rise, so also does the cost-to-serve,\nexponentially. However, we now understand that this equation is fuelled by\nboth over- and under-servicing, which leads directly to low cost-effectiveness\nand lost revenue opportunities. Inappropriate pricing regimes and trading\nterms are integral to this inefficient use of resources. The more realistic\nparadigm is that cost-to-serve will actually decrease (up to a point) as\nservice profiles increase. See Figure 4 below.\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nFigure 4 . The cost\/service paradigm shift to the ‘best of both worlds’\nstrategy (Source: Gattorna, 2003, p.4 (14))\nHowever, this phenomenon only occurs through improved re-allocation of the\nfirms resources; we call this ‘strategic alignment’, or simply ‘alignment’ (15).\nDriven mostly by the pursuit of functional specialism, the concept of\n‘alignment’ has been largely overlooked, but in today’s operating\nenvironment, that is where the value lies.\nIn short, if enterprises wish to produce sustained operational and financial\nperformance, they must align their strategies, cultural capabilities, and\nleadership styles with customers. Unfortunately, very few organizations in\nthe world today have mastered the art of linking these four levels. The key\nlies in interpreting the marketplace, and doing so by going beyond economic\nconcepts into the world of human behaviour as depicted in Figure 5 below.\nTime\nCost\nLogistics Cost\n(% of Sales)\nLogistics Cost\n(% of Sales)\nCustomer\nSatisfaction\n(%)\nCustomer\nSatisfaction\n(%)\nTime\nTraditional Paradigm New Paradigm\nSatisfaction\nRe-engineering efforts must seek to find the optimal or appropriate level of service,driven always by customer needs and behaviours.\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nFigure 5. Strategic alignment (Source: Adapted from Gattorna (14)\nand Gattorna (15))\nFor the purposes of this paper we will concentrate on levels 1 and 2 of the\nalignment model.\nFrom our empirical work it has become obvious that the best way to segment\nmarkets is along ‘buyer behaviour’ lines. Unfortunately, most enterprises use\ninternal parameters that give little indication of how customers wish to buy\nproducts and services. This type of segmentation is however belatedly\ncoming to the fore (16).\nEssentially, we have found that customers tend to demonstrate a limited\nnumber of ‘dominant’ buying behaviours for any given product or service,\nand that these behaviours may change if the situation changes. Figure 6\ndepicts four types of buying behaviour which appear to be present in many\nproduct\/service situations, but they are not the only ones possible. We have\ngiven them labels for ease of discussion.\nThe Strategic Alignment model brings together the four elements that must be aligned\nto achieve sustained superior performance\nT\nec\nh\nn\no\nlo\ng\ny\nIn\nfr\nas\ntr\nu\nct\nu\nre\nB\nu\nsi\nn\nes\ns\nP\nro\nce\nss\nes\nCompetitive\nSituation\nStrategy\nCulture\nLeadership\nStyle\nS\ntr\nat\neg\ny\nH\nu\nm\nan\np\ner\nfo\nrm\nan\nce\n“Internal\nCapabilities”\n“Rules”\n“Shaping &\nCreating”\n“Playing the\nGame”\n Underlying logic\n– An organisation must be aligned\nwith its operating environment\n Usefulness\n– Shows the interaction between\ncustomers’ needs, the formulation\nof appropriate strategic\nresponses, and the successful\nexecution of these strategies by\nshaping the necessary internal\ncapabilities and corresponding\nleadership styles\n Prerequisite\n– Understanding of the customers’\nfundamental needs and buying\nbehaviours that ultimately drive\nsales, revenues, and profit\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nFigure 6. Across a broad range of product\/service categories, there\nare a finite number of dominant customer buying behaviours\n(Source: Adapted from Table 1.3.1, Gattorna, (14), p.32)\nThe mix of these four buying behaviours will vary across product\/service\ncategories and countries.\nClearly, the ‘Collaborative’ buying behaviour is more driven by a need for\ntrusting relationships and predictability, rather than price. The ‘Consistent’\nbuying behaviour is focused on predictable low-cost service, and is very price\nsensitive. The ‘Dynamic’ buying behaviour’ is price aware, but customers\nexhibiting this type of response will pay a premium if their largely\nunpredictable and demanding behaviour is met, at speed. And finally, the\n‘Innovative Solutions’ buying behaviour is only interested in a quick and\ncreative solution, at practically any price!\nSo the key task becomes one of understanding the mix of these and any\nsimilar behaviour segments for a given product\/service category. Once this is\ncompleted, a pricing strategy by customer-segment type is easily developed,\nCollaborative Efficiency\/Consistency\nDemanding\/\nQuick Response Innovative Solutions\n Mostly predictable\n Regular delivery\n Mature or augmented\nproducts\n Primary source of\nsupply\n Trusting relationship\n Teamwork\/partnership\n Information sharing\n Joint development\n Forgiving\n Price not an issue\n Predictable demand\nwithin contract\n Regular delivery\n Efficiency low cost\nfocus\n Multiple sources of\nsupply\n Little sharing of\ninformation\n More adversarial\n Standard processes\n Power imposed\n Transactional\n Very price sensitive\n Unpredictable demand\n Commodity\nrelationship\n Time priority\/urgency\n Opportunity focus\n Ad hoc source of\nsupply\n Low loyalty,\nimpersonal\n Fewer processes\n Outcome oriented\n Commercial deals\nbased on pragmatism\n Price aware\n Very unpredictable\ndemand\n Higher risk\n Flexible delivery\nresponse\n Innovation focus\n Rapid change\n Individual decision\n making\n Solutions oriented\n Management of IP\n Incentives\/ego\n No price sensitivity\nClose working\nrelationships for mutual\ngain\nConsistent response to\nlargely predictable\ndemands\nRapid response to\nunpredictable supply and\ndemand conditions\nSupplier-led\ndevelopment and delivery\nof new ideas\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nespecially in business-to-business marketplaces. If the initial segmentation is\nwell done, then even if a particular customer is forced to change their\npreferred or dominant buying behaviour for short intervals because of\ninternal or external pressures, they would normally move to another of the\nknown buying behaviour options, thereby making the task of responding\nmuch easier than the case where exceptions are continually created, often at\nexcessive cost.\nSo the appropriate ‘value propositions’, including pricing and other service\nparameters in this ‘multiple supply chain alignment’ scenario would look as\ndepicted in Figure 7 below.\nFigure 7. Different ‘value propositions’ and strategies require\ndifferent supply chain solutions\nEffectively, we are recommending a ‘horses for courses’ principle for supply\nchain design that draws on an understanding of human behavioural as well\nas economic factors. Adherence to the suggested ‘alignment’ approach\nmakes the marketplace less of a mystery, and removes much of the trial and\nSupply Chain\nTypes\nCustomer Segment\nTypes\n“Agile”\n“Continuous\nreplenishment”\n“Fully Flexible”\n“Innovative Solutions”\n Unplanned\/ unplannable demand\n Require innovative solutions in\nproducts & services\n Low sensitivity to price\n“Demanding\/Quick Response”\n Rapid response to uneven demand\n Urgent delivery focus\n Lower loyalty\n Price aware\n“Lean”\n“Efficiency\/Consistency”\n Consistent responses required to\nlargely predictable demands\n Efficiency focus\n Price sensitive\nFocus on responding rapidly\n& commercially to\nunpredictable\nsupply\/demand conditions\nFocus on economics of\nscale, synergies, and low\ncost production and\ndelivery\nFocus on developing\nloyal customer\nrelationships with trusty &\nreliable service\nHedging & deployment\nstrategies used to\nimprove responsiveness\non a selective basis\n“Collaborative”\n Close working relationships\n Mostly predictable demand\n Relationship focus\n Loyal\n“Collaboration zone”\nAligned ‘value propositions’\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\nerror style of management that was the hallmark in previous eras when\nresources were seemingly abundant.\nConclusions\nBecause the supply chain offers the best remaining opportunity for cost\nreduction and value improvement, the management of interfaces in the\nnetwork is critical. We have argued that the idea of ‘alignment’, by which\norganisations adapt their supply chain strategies and processes to customer\nmarkets segmented by buyer behaviour, provides a basis for a service-based\npricing strategy.\nAlignment of supply chain strategies and processes between business\npartners enables service improvements to be achieved at less cost. By\nreleasing value in this way prices can actually be reduced if necessary whilst\nstill maintaining the supplier’s margin. Clearly there are many barriers to\nsuccessful alignment, not the least being the lack of transparency and\nvisibility across supply chains. The opportunity to ‘substitute information for\ninventory’ should be grasped by supply chain partners whenever it arises.\nReferences\n(1) Boston Consulting Group, Perspectives on Experience, 1972\n(2) Greider, W., One World, Ready or Not, Simon & Schuster, 1998\n(3) Marn, M.V., Roegner, E.V. & Zawada, C.C., The Power of Pricing”,\nMcKinsey Quarterly, 2003, No. 1, pp 27-39\n(4) Frank, R.J., George, J.P. & Narasimhan, L., “When your competitor\ndelivers more for less”, McKinsey Quarterly, 2004, No. 1, pp 49-59\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\n(5) Borsodi, R., The Distribution Age, New York, D Appleton & Co, 1929,\np.3\n(6) Womack, J. & Jones, D., The Machine that Changed the World,\nToronto, Collier Macmillan, 1990\n(7) Holweg, M. The Three-Day Car Challenge – Investigating the Inhibitors\nof Responsive Order Fulfilment in New Vehicle Supply Systems, Ph.D.\nThesis, Cardiff Business School, University of Wales, 2002\n(8) Lambert, D. & Stock, J., Strategic Logistics Management, 3rd Edition,\nIrwin, 1993\n(9) Christopher, M.G., Logistics and Supply Chain Management, (1st\nEdition), Pearson, 1992\n(10) Normann, R. & Ramirez, R., Designing Interactive Strategy, Wiley,\n1994\n(11) Williamson, O.E., The Economic Institutions of Capitalism, Free Press,\n1985\n(12) Scott, C. and Westbrook, R., “New Strategic Tools for Supply Chain\nManagement”, International Journal of Physical Distribution & Logistics\nManagement, Vol. 21, No. 1., 1991\n(13) Ireland, R. & Bruce R., “CPFR Only the Beginning of Collaboration”,\nSupply Chain Management Review, September\/October 2000, pp 80-\n88\n(14) Gattorna, John L (ed), Handbook of Supply Chain Management, Gower\nPublishing: Aldershot, 2003, p.4.\nIndustrial Marketing Management, Vol. 34, No. 2, pp. 115-121, 2005\n(15) Gattorna, J.L., (ed), Strategic Supply Chain Alignment, Gower\nPublishing: Aldershot, 1998, pps. 1-7.\n(16) Nunes, Paul, F. and Cespedes, Frank, V., “ The Customer has\nEscaped”, Harvard Business Review, November 2003, pps. 96-105.\n"}