{"doi":"10.1016\/j.chemgeo.2009.10.003","coreId":"57397","oai":"oai:nora.nerc.ac.uk:9885","identifiers":["oai:nora.nerc.ac.uk:9885","10.1016\/j.chemgeo.2009.10.003"],"title":"Fluoride dynamics in the granitic aquifer of the Wailapally watershed, Nalgonda District, India","authors":["Reddy, D.V.","Nagabhushanam, P.","Sukhija, B.S.","Reddy, A.G.S.","Smedley, P.L."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"High concentrations of fluoride (up to 7.6 mg\/L) are a recognized feature of the Wailapally granitic aquifer of Nalgonda District, Andhra Pradesh, India. The basement rocks provide abundant sources of F in the form of amphibole, biotite, fluorite and apatite. The whole-rock concentrations of F in the aquifer are in the range 240–990 mg\/kg. Calcretes from the shallow weathered horizons also contain comparably high concentrations of F (635–950 mg\/kg). The concentrations of water-soluble F in the granitic rocks and the calcretes are usually low (1% of the total or less) but broadly correlate with the concentrations observed in groundwaters in the local vicinity. The water-soluble fraction of fluoride is relatively high in weathered calcretes compared to fresh calcretes.\\ud\n\\ud\nGroundwater major-ion composition shows a well-defined trend with flow downgradient in the Wailapally aquifer, from Na–Ca–HCO3-dominated waters in the recharge area at the upper part of the catchment, through to Na–Mg–HCO3 and ultimately to Na–HCO3 and Na–HCO3–Cl types in the discharge area in the lowest part. The evolution occurs over a reach spanning some 17 km. Groundwater chemistry evolves by silicate weathering reactions, although groundwaters rapidly reach equilibrium with carbonate minerals, favouring precipitation of calcite, and ultimately dolomite in the lower parts of the watershed. This precipitation is also aided by evapotranspiration. Decreasing Ca activity downgradient leads to a dominance of fluorite-undersaturated conditions and consequently to mobilisation of F. Despite the clear downgradient evolution of major-ion chemistry, concentrations of F remain relatively uniform in the fluorite-undersaturated groundwaters, most being in the range 3.0–7.6 mg\/L. The rather narrow range is attributed to a mechanism of co-precipitation with and\/or adsorption to calcrete in the lower sections of the aquifer. The model may find application in other high-F groundwaters from granitic aquifers of semi-arid regions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/57397.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/9885\/1\/ReddyManuscript2__2_.pdf","pdfHashValue":"725898f98fea9b57a34f9676245380c442fcfb02","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:9885<\/identifier><datestamp>\n      2012-11-22T12:10:06Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9885\/<\/dc:relation><dc:title>\n        Fluoride dynamics in the granitic aquifer of the Wailapally watershed, Nalgonda District, India<\/dc:title><dc:creator>\n        Reddy, D.V.<\/dc:creator><dc:creator>\n        Nagabhushanam, P.<\/dc:creator><dc:creator>\n        Sukhija, B.S.<\/dc:creator><dc:creator>\n        Reddy, A.G.S.<\/dc:creator><dc:creator>\n        Smedley, P.L.<\/dc:creator><dc:description>\n        High concentrations of fluoride (up to 7.6 mg\/L) are a recognized feature of the Wailapally granitic aquifer of Nalgonda District, Andhra Pradesh, India. The basement rocks provide abundant sources of F in the form of amphibole, biotite, fluorite and apatite. The whole-rock concentrations of F in the aquifer are in the range 240–990 mg\/kg. Calcretes from the shallow weathered horizons also contain comparably high concentrations of F (635–950 mg\/kg). The concentrations of water-soluble F in the granitic rocks and the calcretes are usually low (1% of the total or less) but broadly correlate with the concentrations observed in groundwaters in the local vicinity. The water-soluble fraction of fluoride is relatively high in weathered calcretes compared to fresh calcretes.\\ud\n\\ud\nGroundwater major-ion composition shows a well-defined trend with flow downgradient in the Wailapally aquifer, from Na–Ca–HCO3-dominated waters in the recharge area at the upper part of the catchment, through to Na–Mg–HCO3 and ultimately to Na–HCO3 and Na–HCO3–Cl types in the discharge area in the lowest part. The evolution occurs over a reach spanning some 17 km. Groundwater chemistry evolves by silicate weathering reactions, although groundwaters rapidly reach equilibrium with carbonate minerals, favouring precipitation of calcite, and ultimately dolomite in the lower parts of the watershed. This precipitation is also aided by evapotranspiration. Decreasing Ca activity downgradient leads to a dominance of fluorite-undersaturated conditions and consequently to mobilisation of F. Despite the clear downgradient evolution of major-ion chemistry, concentrations of F remain relatively uniform in the fluorite-undersaturated groundwaters, most being in the range 3.0–7.6 mg\/L. The rather narrow range is attributed to a mechanism of co-precipitation with and\/or adsorption to calcrete in the lower sections of the aquifer. The model may find application in other high-F groundwaters from granitic aquifers of semi-arid regions.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9885\/1\/ReddyManuscript2__2_.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Reddy, D.V.; Nagabhushanam, P.; Sukhija, B.S.; Reddy, A.G.S.; Smedley, P.L..  2010  Fluoride dynamics in the granitic aquifer of the Wailapally watershed, Nalgonda District, India.   Chemical Geology, 269 (3-4). 278-289.  https:\/\/doi.org\/10.1016\/j.chemgeo.2009.10.003 <https:\/\/doi.org\/10.1016\/j.chemgeo.2009.10.003>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science\/journal\/00092541<\/dc:relation><dc:relation>\n        10.1016\/j.chemgeo.2009.10.003<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/9885\/","http:\/\/www.sciencedirect.com\/science\/journal\/00092541","10.1016\/j.chemgeo.2009.10.003"],"year":2010,"topics":[],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1\nFluoride dynamics in the granitic aquifer of the Wailapally watershed, Nalgonda District, 1 \nIndia 2 \n 3 \nD.V. Reddy1*, P. Nagabhushanam1, B.S. Sukhija1, A.G.S. Reddy2 and Smedley, P.L.3 4 \n 5 \n1National Geophysical Research Institute, (Council of Scientific & Industrial Research) 6 \nHyderabad -500 606, India 7 \n2Central Groundwater Board, Southern Region, Hyderabad -500 029, India 8 \n3British Geological Survey, Wallingford, OX10 8BB, United Kingdom 9 \n*Corresponding author, e mail: ngri.dvr@gmail.com 10 \n 2\nAbstract 11 \nHigh concentrations of fluoride (up to 7.6 mg\/L) are a recognized feature of the Wailapally 12 \ngranitic aquifer of Nalgonda District, Andhra Pradesh, India. The basement rocks provide 13 \nabundant sources of F in the form of amphibole, biotite, fluorite and apatite and whole-rock 14 \nconcentrations of F in the aquifer are in the range 240–990 mg\/kg. Calcretes from the shallow 15 \nweathered horizons also contain comparably high concentrations of F, in the range 635–16 \n950 mg\/kg. The concentrations of water-soluble F in the granitic rocks and the calcretes are 17 \nusually low (1% of the total or less) but broadly correlate with the concentrations observed in 18 \ngroundwaters in the local vicinity. The water-soluble fraction of calcretes is relatively high in 19 \nweathered calcretes compared to fresh samples. 20 \nGroundwater major-ion composition shows a well-defined trend with flow downgradient in 21 \nthe Wailapally aquifer, from Na-Ca-HCO3-dominated waters in the recharge area at the upper 22 \npart of the catchment, through to Na-Mg-HCO3 and ultimately to Na-HCO3 and Na-HCO3-Cl 23 \ntypes in the discharge area in the lowest part. The evolution occurs over a reach spanning 24 \nsome 17 km. Groundwater chemistry evolves by silicate weathering reactions, although 25 \ngroundwaters rapidly reach equilibrium with carbonate minerals, favouring precipitation of 26 \ncalcite, and ultimately dolomite in the lower parts of the watershed. This precipitation is also 27 \naided by evapotranspiration. Decreasing Ca activity downgradient leads to a dominance of 28 \nfluorite-undersaturated conditions and consequently to mobilisation of F. Despite the clear 29 \ndowngradient evolution of major-ion chemistry, concentrations of F remain relatively uniform 30 \nin the fluorite-undersaturated groundwaters, most being in the range 3.0–7.6 mg\/L. The rather 31 \nnarrow range is attributed to a mechanism of co-precipitation with and\/or adsorption to 32 \ncalcrete in the lower sections of the aquifer. The model may find application in other high-F 33 \ngroundwaters from granitic aquifers of semi-34 arid regions. \n 3\nKeywords: Fluoride; groundwater; health, granite; soil profiles; calcrete 35 \n1. Introduction 36 \nThe detrimental effects of long-term ingestion of high concentrations of fluoride in drinking 37 \nwater are well known and include physiological disorders, dental and skeletal fluorosis, 38 \nthyroxine changes and kidney damage (Grandjean et al., 1992). High-fluoride groundwaters 39 \nhave been reported from many parts of the world, particularly in arid and semi-arid areas of 40 \nIndia, China, Sri Lanka, Spain, Mexico and many countries in Africa, western USA and south 41 \nAmerica (Edmunds and Smedley, 2005; Ayoob and Gupta, 2006). The serious health risks 42 \nassociated with high F concentrations in drinking water (exceeding the WHO guideline value 43 \nof 1.5 mg\/L; WHO, 2004) warrant investigations of fluoride chemistry encompassing a wide 44 \nspectrum of hydrochemical and geochemical analyses and appropriate methods of 45 \nremediation. Granitic rocks contain a relative abundance of fluoride-rich minerals such as 46 \nmicas, apatite and amphiboles. Fluorite (CaF2) is the principal fluoride mineral, mostly 47 \npresent as an accessory mineral in granites. Dissolution of such minerals can constitute a 48 \nmajor source of F in groundwater (Ramesham and Rajagopalan, 1985; Abu Rukah and 49 \nAlsokhny, 2004; Edmunds and Smedley, 2005, Shaji et al., 2007). High concentrations in 50 \ngroundwater also result from evapotranspiration which may trigger calcite precipitation and 51 \nresult in a reduction in the activity of Ca (e.g. Jacks et al., 2005). Several studies have noted 52 \nan increase in dissolved F concentrations with increasing groundwater residence time 53 \n(Nordstrom and Jenne, 1977; Apambire et al., 1997; Genxu and Guodong, 2001; Edmunds 54 \nand Smedley, 2005). Relatively high F concentrations have been found in some deeply 55 \ncirculating groundwaters along fault lines (Kim and Jeong, 2005, Kundu et al., 2001). 56 \nThis paper outlines the origin of F in groundwater in a granitic watershed located in Nalgonda 57 \nDistrict, about 70 km south of Hyderabad, 58 India. Nalgonda District is one of the poorest \n 4\nand most drought-prone districts of Andhra Pradesh in southern India. The area has long been 59 \nassociated with high groundwater fluoride concentrations which have been reported to reach 60 \nup to 20 mg\/L (Rammohan Rao et al., 1993). The district has given its name to an established 61 \nwater defluoridation technique, the Nalgonda technique, developed in the 1970s by NEERI 62 \n(National Environmental Engineering Research Institute, Nagpur, India) under a UNDP 63 \nProgram (Nawlakhe et al., 1975). Thousands of inhabitants with paralysing bone diseases, 64 \ndeformities of vertebrae, hands and legs, deformed teeth, blindness and other conditions are a 65 \ncommon manifestations of this natural hazard in the district. The first fluorosis problem in 66 \nNalgonda district was reported by Siddiqui (1968). A comprehensive study of fluoride in the 67 \ngranitic rocks was carried out by the Geological Survey of India (1974). This study reported 68 \nfluoride concentrations up to 7 mg\/L in both groundwater and streamwater around Wailapally, 69 \nattributed to fluorite-rich zones in the bedrock (Natarajan and Mohan Rao, 1974). Clusters of 70 \nfluorite were found disseminated as grains or in vein fills in the porphyritic granite gneiss 71 \n(Natarajan and Murthy, 1974). 72 \nRammohan Rao et al. (1993) concluded that the two main factors governing fluoride in 73 \ngroundwater from the Nalgonda District are the presence of acid-soluble F minerals and low 74 \nconcentrations of Ca and Mg in rocks and soils, with high concentrations of HCO3 in 75 \ncirculating groundwater. Reddy (2002) reported that the F distribution in groundwaters of the 76 \nWailapally watershed is variable and does not follow any pattern in relation to topography, 77 \ngradient or weathered-zone thickness. However, neither of these studies aimed to delineate 78 \nsystematically the spatial distributions in fluoride across the area and to understand the origins 79 \nof the fluoride. A better understanding of fluoride geochemistry in the study area is important 80 \nfor evaluating the contamination process more precisely. 81 \nThis study uses a multifaceted approach to understand the mechanism responsible for the 82 \n 5\nspatial distribution and dynamics of F across a small watershed composed of a single bedrock 83 \ngeological unit (granitic gneiss), based on the chemical analysis of 433 groundwater samples 84 \nand a number of soil profiles, rock and calcrete samples. 85 \n2. Regional setting 86 \n2.1. Study area 87 \nThe study area (130 km2) lies in a semi-arid region, between 17.03o to 17.13o N latitude and 88 \n78.8o to 79.0o E longitude, located about 70 km southeast of Hyderabad, Andhra Pradesh, 89 \nIndia (Fig. 1). The granite exposures are seen as rugged dissected hills (600–650 m a msl) 90 \nwith a N-S trend in the western part, as domed hillocks or sheet-like exposures in the middle 91 \npart and as undulating terrain with black alkaline soils in the eastern part of the study area. 92 \nThese alkaline soils in the east likely formed due to high evaporation rates and a historic 93 \nshallow water table. 94 \nThe aquifer is composed of Archaean basement rocks of the Peninsular Gneissic Complex. 95 \nThese comprise biotite-rich grey or pink granite, porphyritic granite and migmatitic granite 96 \ngneiss (Natarajan and Murthy, 1974). Younger intrusions of pink granite are also common in 97 \nthis area, especially in the western region. 98 \nThe rocks are medium- to coarse-grained and composed of greyish or white feldspars, bluish 99 \ngrey or white translucent to opaque quartz, biotite, and hornblende. Fluorite occurs as 100 \nanhedral grains disseminated in the grey and pink porphyritic gneiss. Quartz and apatite veins, 101 \nand dolerite dykes are aligned along the major N-S or E-W oriented fractures (Reddy, 2002). 102 \nPetrographic investigations show the presence of F-containing minerals: fluorite (0-3.3%), 103 \nbiotite (0.1-1.7%) and hornblende (0.1-1.1%) (Rammohan Rao et al., 1993). Natarajan and 104 \nMohan Rao (1974) reported F concentrations 0.31 to 1.1% in the whole rock from the same 105 \n 6\narea and in particular the higher concentrations are from porphyroblastic and pink granites. 106 \nThe weathered zone overlying the bedrock varies in thickness from 30–40 m in the west to 107 \nless than 10 m in the east. The thick weathered zone in the west has developed as a result of 108 \nabundant joints and fractures in the granite and accumulation of colluvial deposits due to the 109 \nhilly terrain. In the east, the weathered zone is thinner because of less jointing and flatter 110 \ntopography. 111 \nCalcrete is well-developed in the weathered zone over much of the watershed, notably the 112 \ncentral and low-lying eastern parts. It is however, absent from the western section (zone I) and 113 \nthe watershed periphery. Calcrete deposits are observed at the ground surface in the alkaline 114 \nsoils in the east but are also observed in several areas at depths of 10–15 m from dug-well 115 \nsections. Surface and near-surface exposures occur as hard layers, sometimes extensive but 116 \ntypically as discrete patches. Nodular forms of calcrete also occur in some places. Calcretes 117 \nfound in the dug-well sections are highly weathered. 118 \nTopographic elevation varies from 420 m in the west to 280 m in the east with an average 119 \ntopographic gradient of 8 m\/km. The gradient is steeper in the western half than in the east. 120 \nThere is no well-developed drainage system in the area, although streams originating in the 121 \nwestern hills flow eastwards (Fig. 1). The main stream, Wailapally Vagu, flows from the 122 \ncentral part of the catchment and terminates at the man-made irrigation tank at Yelmakanna 123 \n(Fig. 1). Similarly, south of Wailapally Vagu, many small streams end abruptly after flowing 124 \na short distance eastwards, reflecting the high permeability of the soils. There are a few 125 \nartificially made irrigation tanks across the streams where the surface water storage is for a 126 \nlimited period (a few days to 1–2 months depending on rainfall). 127 \nAnnual average rainfall is around 650 mm, most falling during July to September from the 128 \n 7\nSW monsoon. However, rainfall is erratic from year to year, with a variation from 400–129 \n1000 mm. Temperature varies from 9oC during winter (minimum) to 42oC during summer 130 \n(maximum), although average daytime temperatures remain around 30oC for most of the year. 131 \nAs a result of the high temperature, average potential evaporation is about 1400 mm, which is 132 \nmore than twice the average annual rainfall (measured at the Wailapally village, centre of the 133 \nwatershed). 134 \n2.2. Hydrogeology 135 \nGroundwater is present in both the weathered zone and bedrock fractures. Significant 136 \ndeformation has produced a network of intersecting fractures in the weathered zone which 137 \nprovides hydraulic continuity between the two systems. Groundwater occurs mainly under 138 \nunconfined conditions, although semi-confined and confined conditions exist locally due to 139 \nsheet joints in the basement rock. Erratic rainfall and over-exploitation of groundwater in 140 \nrecent years has led to severe water shortages for irrigation and drinking. About 2500 wells 141 \nexist in the catchment, including both dug wells and boreholes, as inventoried in the 88 km2 142 \nnon-hill terrain of the watershed. Of these, almost all dug wells of ≤15 m depth are dry, as are 143 \nsome 40% of the boreholes drilled down to depths ranging to 120 m. Discharge from the 144 \nremaining boreholes is poor, typically in the range 1.5 to 3 L\/s. 145 \nThe watershed is almost a closed basin with only one outlet to the east. The ground elevation 146 \ndifference between the stream area in the central part and the watershed boundary is about 147 \n20–25 m. No external sources of water supply exist in the watershed either for irrigation or for 148 \ndrinking purposes. The main input source to the groundwater is rainfall recharge. A recharge 149 \nstudy (Reddy et al., 2009), conducted in this area using environmental chloride, indicates that 150 \nthe bulk of the vertical recharge in the western elevated land occurs through preferred 151 \npathways and that a small fraction occurs 152 through the soil matrix. The dominating \n 8\npreferential flow is high ( 16% of the annual average rainfall) in the valley fills, but 153 \ndecreases to 5–5.5% in the plains, whereas the matrix (piston flow) recharge is only 1–1.5% 154 \nof rainfall. Furthermore, considerable lateral movement of groundwater down the slope allows 155 \nsequential hydrochemical changes to occur (Reddy et al., 2009). 156 \nThe groundwater sampling campaign for this study was carried out under pre-monsoon 157 \ndrought conditions during June 2004. At the time, the depth to water table varied from 40 m 158 \nin the west to 7 m in the east (380 to 270 m a msl, Fig. 2), with an average hydraulic gradient 159 \n7.5 m\/km. The gradient was steeper in the west. 160 \nIn addition to the quantity problems, the area is facing a severe water-quality problem. High 161 \nconcentrations of naturally-occurring F in the groundwater make it unsuitable for drinking, 162 \nand alternative sources of drinking water are currently not available. 163 \nBased on the relatively high water-level increase (27–35 m) during above-normal rainfall 164 \nconditions in 2005, low Cl concentrations in the groundwater (average 17 mg\/L), and its pulse 165 \nmovement to groundwater recharge (preferential recharge), the western part of the study area 166 \n(zone I) is demarcated as a recharge zone (Fig. 1). The eastern part (zone IV) is demarcated as 167 \na discharge zone based on low water-level fluctuation (ca. 4 m), lower recharge rate (ca. 1%) 168 \nand higher groundwater Cl concentration (average 120 mg\/L) (Reddy et al., 2009). 169 \n2.3. Groundwater samples 170 \nAs almost all open wells were dry, groundwater samples were taken only from boreholes. Out 171 \nof 433 boreholes sampled from the watershed during the well inventory period (pre-monsoon 172 \nperiod of 2004–2005), about 10% were drilled for domestic use, the others being used for 173 \nagriculture. Being in hard-rock terrain, boreholes are not screened except in the top few 174 \nmetres of the highly weathered zone to avoid borehole collapse. The collected samples 175 \n 9\ngenerally represent mixed waters abstracted from a range of depths within a borehole. 176 \nHowever, a few boreholes were abstracting water exclusively from sheet joints at greater 177 \ndepths. Most of the domestic boreholes are fitted with hand pumps and almost all agricultural 178 \nboreholes have 5 HP submersible pumps. 179 \nElectrical conductance and pH of the water samples were measured using the Consort C533 180 \nportable multi-parameter analyzer. Carbonate alkalinity was measured by titration. Other 181 \nanions and cations were measured using a Dionex ion chromatograph. An AS-14A Ion Pac 182 \nwas used with 8.0 mM sodium carbonate and 1.0 mM bicarbonate as eluent and H2SO4 as 183 \nregenerent with a mixed standard of F, Cl, NO2, Br, NO3, PO4 and SO4 made in the required 184 \nproportions from the standards purchased from Merck, Germany. A CS-17 column was used 185 \nfor cation separation with 6 mM methanesulfonic acid as eluent, and a mixed standard of Li, 186 \nNa, K, Mg and Ca prepared in accordance with the approximate sample values. As a result of 187 \nthe high TDS values (>600 mg\/L), the samples were diluted to measure both anions and 188 \ncations. Several routine checks on standards were made to ensure data quality. Measurements 189 \nhave a precision of ±5% of the total value. The majority of analysed samples had ionic charge 190 \nimbalances of <5%. 191 \n2.4. Rock and soil samples 192 \nSoil samples were collected from vertical profiles at nine sites across the study area (Fig. 1). 193 \nThese were extracted by machine-operated auger and were sampled with a sampling interval 194 \nof 10 cm. The depth of the profiles varied from 1 m to 3.6 m. 195 \nFifteen samples of calcrete and granite were also collected from the study area. Calcrete 196 \nsamples are from the surface as well as at different depths in the weathered zone. Samples 197 \nwere analysed for major elements and total F by XRF spectrometry at the National 198 \n 10\nGeophysical Research Institute (NGRI) using a Philips MagiX PRO PW 2440, wavelength-199 \ndispersive XRF spectrometer coupled with a PW 2540 autosampler. The MagiX PRO is a 200 \nsequential instrument with a single goniometer-based measuring channel encompassing the 201 \nentire spectral range from F to U in the concentration range of a few mg\/kg to % levels. 202 \nInternational reference materials from USGS, Canadian and NIST standards (SO-1, SO-2, JB-203 \n2, JP-1, G-2, JG-1A) were used in the preparation of calibration graphs. 204 \nThe soils and calcrete samples were also used in batch leaching experiments. Samples were 205 \nfirst air-dried; 50 g of solid sample were then weighed and 50 mL of milli-Q water added (1:1 206 \nratio). Samples were stirred several times and after 2 hours, the supernatant was decanted 207 \n(Whatman No.1 filter paper) (Sharma and Hughes, 1985; Johnston, 1987; Sukhija et al., 1988). 208 \nSukhija et al. (1988) adopted a similar procedure for investigation of soluble Cl in depth 209 \nprofiles. Soluble F concentration was then measured in the supernatant solution using ion 210 \nchromatography. 211 \nIn a further experiment, samples of calcrete were leached (1:1 ratio) for a week and the 212 \nsupernatant liquid analysed for F in order to investigate dissolution over a longer timescale. 213 \nAnother experiment with 50 g of calcrete and 100 mL milli-Q water (1:2 ratio) was also 214 \nundertaken to investigate the effect of solid\/solution ratio. 215 \n3. Results 216 \nAlthough more than 480 groundwater samples were collected and analysed in the study, 50 217 \nsamples were excluded from consideration due to anthropogenic contamination determined 218 \nfrom associated high nitrate (≥50 mg\/L) and chloride (>100 mg\/L) concentrations. These 219 \nsamples were in all cases located within and close to villages where groundwater suffers 220 \nlocally from contamination by latrines and animal wastes. Thus the data for 433 non-221 \n 11\ncontaminated groundwater samples have been used for analysis and interpretation (Fig. 2). 222 \nTo describe the hydrochemical evolution and processes in the aquifer, the watershed has been 223 \ndivided into four zones based on the geomorphology and hydrogeological conditions. Zone I 224 \ncovers the valley fills (mostly thick weathered zone with some colluvium) in the western part 225 \nof the watershed, zone II is pediment, zone III moderately weathered pediplain and zone IV is 226 \nshallow weathered pediplain in the eastern part of the watershed (Fig. 1). 227 \n3.1. Hydrochemical variation 228 \n3.1.1. Major ions 229 \nA statistical summary of the groundwater chemical data for the watershed is given in Table 1. 230 \nThe complete dataset is provided in the Supplemental Data. For the watershed as a whole, the 231 \naverage pH value is 7.7 with a range of 6.6 to 8.9 and average electrical conductivity is 925 232 \nμS\/cm (TDS 492 mg\/L) with a range of 230 to 2130 μS\/cm (TDS 120–1130 mg\/L). 233 \nGroundwater temperature is around 30ºC. Concentrations of major constituents Na, K, Ca, 234 \nMg, Cl, SO4, HCO3 and CO3 also show wide variation from a few mg\/L to a few hundreds of 235 \nmg\/L. 236 \nThere is significant variation in the average values of different chemical constituents in the 237 \ndifferent zones (Table 1). Some chemical constituents show a linearly increasing trend from 238 \nzone I to zone IV, while others show a decreasing trend. From zone I to zone IV, the spatial 239 \nvariation in the average values of various chemical constituents are: pH 7.4–8.5; EC 525–240 \n1400 μS\/cm; Na 57–310 mg\/L; HCO3 270–660 mg\/L; CO3 <0.1–30 mg\/L; Cl 18–110 mg\/L 241 \nand SO4 12–90 mg\/L. However, average Mg increases from zone I to III (16–47 mg\/L) and 242 \ndecreases in zone IV (26 mg\/L) and Ca decreases downgradient from 27–8 mg\/L. 243 \n 12\n3.1.2. Spatial variability in fluoride concentration 244 \nBoth the mean and median fluoride concentrations in the groundwater are 3.6 mg\/L with a 245 \nrange of 0.5 to 7.6 mg\/L. The frequency distribution of concentrations in the 433 groundwater 246 \nsamples shows that no samples have <0.5 mg\/L, only 3% have fluoride concentrations ≤1.5 247 \nmg\/L (the WHO guideline value), 30% lie in the range 1.6–3 mg\/L, 34% have 3–4 mg\/L, 23% 248 \ncontain 4–5 mg\/L and the remaining 10% have concentrations in the range 5–7.6 mg\/L (Fig. 2 249 \ninset). Groundwaters with F concentrations >4 mg\/L F cover almost three quarters of the 250 \nstudy area (Fig. 2). 251 \nRelatively little variation in groundwater F concentration occurs down the groundwater flow 252 \ngradient. The median fluoride concentrations in zones I to IV are respectively 3.6, 3.6, 2.7 and 253 \n4.3 mg\/L. The relatively low zone-III median is due to dilution of groundwater by surface 254 \nwater from the surface tank\/pond in that area (Fig. 2) and to a contribution of fresh young 255 \nrecharge water being added from the southern hillocks. Fluoride concentrations in this water 256 \nare in the range 0.5–1.5 mg\/L in zone III. This is the only area within the watershed where 257 \ngroundwater has F concentrations within the permissible limits for drinking. 258 \nHigh-F groundwaters in other parts of the world are often of Na-HCO3 type with low Ca 259 \nconcentrations and neutral to alkaline pH values. Several studies have demonstrated positive 260 \ncorrelations between F and both HCO3 and Na in high-F groundwaters as well as an inverse 261 \nrelationship between F and Ca concentrations in fluorite-saturated groundwaters (e.g. Handa, 262 \n1975; Kundu et al., 2001; Wang and Cheng, 2001; Smedley et al., 2002; Ozsvath, 2005; 263 \nEdmunds and Smedley, 2005; Valenzuela et al., 2006; Qinghai Guo et al., 2006). For the 264 \ngroundwaters from the Wailapally watershed, there is no clear correlation between these 265 \nparameters when considering the sample set as a whole (Table 2). Correlations are also 266 \ngenerally poor within zones. However, Table 2 indicates that for groundwaters with low F 267 \n 13\nconcentrations (0.5–1.5 mg\/L), relatively good positive correlations exist between F and Mg 268 \n(r2 0.74) and between F and HCO3 (r2 0.59). This group comprises only 14 samples, the 269 \nmajority being from a small area around the pond in zone III and indicating the effect of 270 \ndilution by surface water and by fresh recharge from the southern side of the watershed. 271 \nDespite the overall lack of spatial trend in F concentrations, some systematic lateral variations 272 \nare observed in small areas. A 3.5 km stretch in the valley fill\/recharge area of zone I shows a 273 \nprogressive downgradient increase in F from 1.6 mg\/L to 4.5 mg\/L (Fig. 3). However, there is 274 \nno significant correlation between F and other major ions in these groundwaters (Fig. 3a-d). 275 \n3.1.3. Variation in fluoride concentration with depth 276 \nSome studies (e.g. Edmunds and Smedley, 2005; Kim and Jeong, 2005; Hudak and Sanmanee, 277 \n2003), have found a positive correlation between borehole\/well depth and concentration of F 278 \nin groundwater, although relationships are not always apparent (e.g. Apambire et al., 1997). In 279 \nthe Wailapally catchment, borehole depths are mostly in the range 30–120 m and groundwater 280 \noccurs in fractures at variable depths within the bedrock. No relationship has been found 281 \nbetween F concentration and borehole depth (Fig. 4). 282 \n3.1.4. Groundwater saturation indices 283 \nRanges and means of saturation indices for calcite, dolomite and fluorite (PHREEQC; 284 \nParkhurst and Appelo, 1999) are given for the different zones in Table 1. An SI range of 285 \n0±0.25 has here been taken as an indication of near-saturated condition. Most groundwaters 286 \nfrom the catchment are saturated or near-saturated with respect to calcite. Around 28% of the 287 \nsamples are oversaturated (SI >0.25). Most of the calcite-undersaturated groundwaters are 288 \nfrom the peripheral areas of zones I and II. The degree of calcite saturation increased 289 \ndowngradient. All calcite-oversaturated samples are from the low-lying areas, particularly in 290 \n 14\nzone IV (Fig. 5). 291 \nSimilarly, most groundwaters are saturated or over-saturated with respect to dolomite. Almost 292 \nall undersaturated groundwaters derive from zone I and saturation index progressively 293 \nincreases downgradient (Fig. 5), although there is an apparent slight decrease in degree of 294 \nsaturation in samples from zone IV. The saturated state of most of the groundwaters with 295 \nrespect to these minerals is consistent with the presence of calcrete deposits, as well as 296 \noccurrence of alkaline soils, in the lower parts of the catchment. 297 \nDespite the large range and often high concentrations of F in the groundwaters, most samples 298 \nare undersaturated with respect to fluorite (around 95% have SIfluorite <0; Fig. 5). Only two 299 \nsamples from the dataset are oversaturated with respect to fluorite (SI >0.25). Almost all 300 \nsaturated samples are from zone I. 301 \n3.2. Chemical variation in rocks and soils 302 \n3.2.1. Fluoride in granite samples 303 \nThe important fluoride minerals in the granitic rocks of the area are fluorite (CaF2) and apatite 304 \n[Ca5(Cl,F,OH)(PO4)3]. Amphiboles (hornblende) and biotite also contain abundant fluoride 305 \nwhich substitutes for hydroxyl in the crystal lattices (Natarajan and Murthy, 1974; Rammohan 306 \nRao et al., 1993; Edmunds and Smedley, 2005). The basement and weathered rocks of the 307 \narea contain substantial quantities of these F-bearing minerals, especially in the porphyritic 308 \npink granites. 309 \nThe average F concentration in surface rock samples collected from the watershed varies from 310 \n242 to 990 mg\/kg (Table 3). The lowest value is found in a grey granite sample from the 311 \neastern part; the highest represents an average of seven measurements (ranging from 19 to 312 \n3125 mg\/kg) on different aliquots of a single 313 sample of pink granite from the western part. \n 15\nThe wide variation in F concentration from different aliquots of one sample can be attributed 314 \nto the presence or absence of fluorite grains. The data indicate that the pink granite contains 315 \nabundant F-bearing accessory minerals. 316 \nThe highest observed F concentration is very similar to that found for rocks from the same 317 \narea by Rammohan Rao et al. (1993). They reported F concentration ranges in granitic rocks 318 \nfrom Nalgonda district from 325 to 3200 mg\/kg with a mean of 1440 mg\/kg. In neighbouring 319 \nHyderabad, Rammohan Rao et al. (1993) reported mean F concentrations in granitic rocks of 320 \n910 mg\/kg, although groundwater F concentrations in this area were generally found to be 321 \nlower because of relatively high solute Ca concentrations. A mean F concentration of 322 \n360 mg\/kg was found for granites in non-endemic areas of India (Rammohan Rao et al., 1993). 323 \nIn the adjacent Hyderabad district, where F concentrations in groundwaters are almost at 324 \npermissible limits (except certain pockets), the granites have an average F concentration of 325 \n910 mg\/kg, which is about 1.5 times less than the Nalgonda Granite (Ramamohana Rao et al., 326 \n1993). 327 \n3.2.2. Chemistry of calcretes 328 \nChemical analyses of 11 calcrete samples from three zones determined by XRF are given in 329 \nTable 4. The concentrations of CaO vary between 30–50% and of MgO between 1.5–16%. 330 \nFluoride concentration varies between 440 and 1160 mg\/kg. The fluoride concentration is 331 \nvery similar to that found in the granitic rocks of the area. 332 \nThe analysed calcrete samples display a positive correlation (r2 0.6) between MgO and F. This 333 \nsuggests that a relationship exists between the concentration of F and the dolomite content of 334 \nthe calcretes. Jacks et al. (2005) also found very high concentrations of F in calcrete samples 335 \ncollected from arid areas of the Indian granitic terrain. They quoted a range of 510–9000 336 \n 16\nmg\/kg in 25 analysed calcrete samples. They also noted that highest F concentrations 337 \noccurred in dolomitic calcretes (>5 mol% Mg) in downslope positions in the valley sites 338 \nstudied. This accords with the observed F distributions in calcretes in this study. 339 \n3.2.3. Total and soluble fluoride in depth profiles and rocks 340 \nThe relationship between total and water-soluble F concentrations has been investigated in the 341 \nnine soil profiles from all four zones in order to assess the lability of F in the solid phase. Data 342 \nfor average total and water-soluble concentrations from profiles, together with concentrations 343 \nin granitic bedrocks and in groundwater from nearby boreholes are given in Table 3. 344 \nOf the soil profiles, that from Wailapally is the thickest (to a depth of 3.6 m) and that from 345 \nPuttapaka is the thinnest (to 0.5 m depth; Table 3). Average water-soluble F concentration in 346 \ndifferent profiles varies from 0.5 to 10 mg\/kg and within the profile the variation is 2–4 times 347 \nthe average concentration. Average water-soluble F in the depth profile at Dubbagadda Tanda 348 \n(to depth 1.7 m; zone I) is only 0.5 mg\/kg, although it increases slightly with depth (0.2–0.8 349 \nmg\/kg; Fig. 6). Total F concentration in the profile averages 626 mg\/kg with relatively little 350 \nvariation. Water-soluble F therefore represents less than 0.1% of the total. Fluoride 351 \nconcentration in the groundwater around this site is 3.7 mg\/L. 352 \nA profile in zone I at Gangamolla Tanda (to 2.5 m depth) shows an average water-soluble F 353 \nconcentration of 3.0 mg\/kg, while the local groundwater has a concentration of 2.5 mg\/L. 354 \nTwo profiles from zone II, Lachammagudem (to 1.2 m depth, Fig. 6) and Wailapally (to 355 \n3.6 m) each have average water-soluble F concentrations of 10 mg\/kg. The Lachammagudem 356 \nwater-soluble profile increases with depth, with concentrations up to 17 mg\/kg at 110 cm 357 \ndepth. The average total F in the soil profile at the site is 1015 mg\/kg and has relatively little 358 \nvariation (Fig. 6). The water-soluble component of F at Lachammagudem is therefore just 359 \n 17\nunder 1% of the total F. Local groundwater at the Lachammagudem site has 7.0 mg\/L F. 360 \nLocal groundwater F concentrations at the Wailapally site are also relatively high, at 5.5 mg\/L. 361 \nThree shallow profiles (to depths of 0.5 to 1 m) from zone III contain average water-soluble F 362 \nconcentrations in the range 1.4–4.9 mg\/kg, compared to average total F values of 343–363 \n568 mg\/kg. Groundwater F at these sites is around 5 mg\/L. The lowest value of soluble F is 364 \nfrom a shallow profile in the alkaline soils (Gattuppal-Yelamakanna Road) where the water-365 \nsoluble and groundwater F concentrations are 1.4 mg\/kg and 5 mg\/L respectively. In all zone 366 \nIII profiles, water-soluble F concentrations represent less than 1% of the total solid F. 367 \nOne profile from zone IV (Yelamakanna, Fig. 6) has an average water-soluble F concentration 368 \nof 5 mg\/kg and an average total F concentration of 670 mg\/kg (water-soluble fraction 0.7% of 369 \nthe total solid F concentration). Groundwater F concentration at this site is 4 mg\/L. 370 \nFigure 7 shows the relationship between average water-soluble F in the soil profiles and F in 371 \nthe local groundwaters. A relatively good correlation is apparent, except for two profiles: 372 \nDubbagadda Tanda and Gattuppal-Yelamakanna Road (in the alkaline soils). The overall 373 \ncorrelation suggests that groundwater F concentration is related to the presence of readily 374 \nleachable F in the solid phase. At Dubbagadda Tanda, in the recharge area (zone I), the 375 \naverage water-soluble F is comparatively low, 0.5 mg\/kg. This may be attributed to the 376 \ncombined effect of low clay content of the profiles (relatively high permeability), and 377 \ncomparatively high recharge (93% of total recharge through preferential flow) in this area 378 \n(Reddy et al., 2009). The reason for the lack of correlation between water-soluble F and 379 \ngroundwater F concentration in the alkaline soil profile (discharge area; zone IV) is less clear. 380 \n3.2.4. Soluble fluoride in calcretes 381 \nWater-soluble concentrations of fluoride in the analysed calcretes vary from not detectable to 382 \n 18\n7.5 mg\/kg (Table 3). The great variation in the water-soluble F concentrations appears largely 383 \nto be controlled by the degree of weathering. For example, despite the high concentration of 384 \ntotal F in fresh nodules collected from the ground surface at Wailapally (average 950 mg\/kg), 385 \nthe water-soluble concentration is below detection limit (Table 3). Likewise, water-soluble 386 \nconcentrations in fresh calcrete (without etching pits) from Gattuppal-Yelamakanna Road 387 \naverage 0.7 mg\/kg, despite the average total F concentration being 685 mg\/kg. Of the 388 \nweathered calcrete samples (with etching pits), average water-soluble concentrations are as 389 \nhigh as 7.6 mg\/kg compared to a total F concentration of 700 mg\/kg. 390 \nLeaching experiments on the weathered calcretes indicated that the concentrations of water-391 \nsoluble F almost doubled in three samples out of six when leached for 1 week instead of 2 392 \nhours. No significant change with time was observed in the unweathered calcretes. 393 \n4. Discussion 394 \n4.1. Controls on the down gradient evolution of groundwater chemistry 395 \nThe chemical variation of groundwaters from the Wailapally watershed indicates that they are 396 \nstrongly impacted by geochemical reactions with the granitic host rocks. Recharge occurs 397 \npredominantly in zone I and groundwater flow occurs under mainly oxic conditions. Lowest 398 \npH values in zone I (down to 6.6) are found in groundwaters with lowest TDS values. These 399 \nrepresent recently recharged groundwater. Most groundwaters in zone I are of Na-Ca-HCO3 400 \ntype, reflecting the importance of reaction of silicate minerals, notably sodic feldspar in the 401 \npresence of acid generated from soil-derived CO2: 402 \n 2NaAlSi3O8 + 2H+ + 9H2O  Al2Si2O5(OH)4 +2Na+ + 4H4SiO4. 403 \nThis generates dissolved Na, consumes protons, and also leads to increasing alkalinity. A 404 \n 19\nminority of groundwaters in zone I are of Ca-Na-HCO3 type. 405 \nDowngradient, the groundwaters rapidly become saturated with respect to calcite, with 406 \nresultant precipitation of this mineral, as manifested by the occurrence of calcretes, in zones II 407 \nto IV. Rapid saturation with respect to dolomite also occurs but the degree of oversaturation 408 \nand the increasing concentrations of Mg downgradient in zones II and III suggest that 409 \ndolomite does not precipitate readily. However, a notable reduction in Mg concentrations in 410 \nzone IV, suggests that precipitation of dolomite occurs in the low-lying part of the catchment, 411 \nlikely promoted by increased evapotranspiration in the zone of discharge. A study by Jacks 412 \nand Sharma (1995), also in granitic terrain in southern India, found a downgradient change in 413 \nthe mineralogy of calcrete deposits, with upslope concretions being dominantly of calcite and 414 \nwith increasing dolomite content in lower-lying valley sites. No systematic changes in Mg\/Ca 415 \nratio of calcretes with distance downgradient are observed in the Wailapally catchment 416 \nhowever (Table 4). 417 \nDowngradient of zone I, the groundwaters evolve from Na-Ca-HCO3 type through a Na-Mg-418 \nHCO3 type in zone II, to Na-Mg-Cl-HCO3 type in zone III, and ultimately to Na-HCO3 or Na-419 \nHCO3-Cl type in discharge zone IV. Groundwater pH also increases downgradient, from a 420 \nmedian of 7.3 in zone I to 8.5 in zone IV, the increase in response to silicate-mineral 421 \ndissolution, and potentially also degassing of CO2 in the discharge zone. Downgradient 422 \nincreases in Cl concentration from values close to 10 mg\/L in zone I to concentrations of 423 \ntypically 150 mg\/L and extremes up to 350 mg\/L in zone IV are supporting evidence for the 424 \ninfluence of evapotranspiration. The observed evolution in geochemical composition of the 425 \ngroundwaters occurs along a flow path of some 17 km. 426 \n4.2. Controls on fluoride mobility 427 \n 20\nInitial inputs of F from rainfall are likely to be relatively low. Satsangi et al. (1998) observed 428 \nconcentrations of around 0.3 mg\/L in rainfall from rural areas of Uttar Pradesh, although 429 \nJacks et al. (2005) suggested that the concentration could be as high as 1 mg\/L in southern 430 \nIndia as a result of an important component contributed by dry deposition. The granitic rocks 431 \nof the watershed contain abundant primary mineral sources of F, including amphibole, biotite, 432 \nfluorite and apatite. The high concentrations of F in calcrete observed in this study also 433 \nindicate that this could be a potential source of dissolved F given suitable conditions for 434 \nrelease to solution. The apparent correlation between concentration of water-soluble F and 435 \nconcentration of F in local groundwaters demonstrates a relatively rapid release rate from 436 \nleachable mineral sites. In zone I where concentrations of dissolved Ca are relatively high, 437 \nsome groundwaters are saturated with respect to fluorite. However, groundwaters become 438 \nundersaturated in zone I and throughout zones II to IV in response to decreasing Ca activities, 439 \nsignifying that fluorite is not controlling F concentrations throughout most of the watershed. 440 \nIncreasing pH and alkalinity downgradient are also more conducive to F mobilisation (Wang 441 \nand Cheng, 2001). 442 \nSeveral workers (Jacks et al., 1993; Gaciri and Davies, 1993; Tirumalesh et al., 2007) have 443 \nobserved increasing F concentrations in groundwater in granitic terrains going downgradient 444 \nfrom recharge to discharge areas. However, in the Wailapally catchment, little spatial pattern 445 \nin F concentrations is observed despite the distinct downgradient evolution in major-ion 446 \ncomposition. The groundwater F concentration varies mostly over the range 3.0–7.6 mg\/L 447 \n(Table 3). It is suggested that the limited range of concentrations of F in the fluorite-448 \nundersaturated waters is due to buffering by co-precipitation with, or adsorption to, calcrete. 449 \n4.3. Calcretes as a potential sink of fluoride 450 \nCalcretes are abundant in the weathered 451 material overlying the granitic rocks. The \n 21\npetrology of these has not been studied in detail, but calcretes elsewhere are dominantly 452 \ncomposed of microcrystalline calcite, with variable but usually low concentrations of Mg 453 \n(typically less than 3 mol % MgCO3). Concentrations of MgO in the analysed calcretes are 454 \nusually <3 weight % but reach up to 15.6 weight % (Table 5). Watts (1980) suggested that the 455 \nconcentration of Mg was related to the rate of evaporation, higher rates favouring higher 456 \nconcentrations. Jacks and Sharma (1995) found a progressively increasing proportion of Mg 457 \nin calcretes with distance downgradient in a catchment in southern India. Additional minerals 458 \nin calcretes can include forms of silica (quartz, chalcedony) and clay minerals. Of these, 459 \npalygorskite, sepiolite and smectite have frequently been recorded (Hay and Wiggins, 1980; 460 \nWatts, 1980; Rodas et al., 1994; Kadir and Eren, 2008). Sepiolite and palygorskite are 461 \ntypically authigenic in origin although both authigenic and detrital smectite have been 462 \ndescribed (Wright and Tucker, 1991). 463 \nThe concept of removal of F from solution by co-precipitation with calcite and dolomite is 464 \nwell established (Carpenter, 1969, Jacks et al., 2005). It is also supported by the observed 465 \nhigh concentrations of F in the calcrete samples analysed in this study. Fan et al. (2003) 466 \ndemonstrated that sorption of F on calcite surfaces can also occur. Turner et al. (2005) showed 467 \nwith extensive laboratory experiments, that F adsorption occurs rapidly over the entire calcite 468 \nsurface with fluorite precipitating at step edges and kinks, where dissolved Ca2+ concentration 469 \nis highest. Sepiolite, palygorskite and smectite, if present in the calcrete deposits, also 470 \nrepresent potential sites for F sorption. Further investigation is needed to establish the relative 471 \nrole of such accessory mineral phases. 472 \nA conceptual model depicting the various processes controlling the F concentration is shown 473 \nin the Fig. 8. The main source of F is from weathering of parent granitic rock with F-rich 474 \nminerals, with mobilization occurring during the percolation of rainwater in vertical\/lateral 475 \n 22\nflow. Groundwater flows laterally downgradient and F concentration increases from relatively 476 \nlow values (typically 1.6 mg\/L) in the west of zone I to around 5 mg\/L near the eastern limit 477 \nof zone I, a stretch of some 3.5 km. The relatively low concentrations are attributed to 478 \ncomparatively high recharge rate, facilitated by large vertical permeability in the form of a 479 \ngreater density of fractures. In zones II to IV, calcite saturation is achieved and calcrete 480 \nprecipitation can occur. From evidence of groundwater Mg concentrations, dolomite 481 \nprecipitation appears to be restricted to the low-lying areas of zone IV, in response to 482 \nincreased evapotranspiration. Groundwaters in zones II to IV contain a rather uniform F 483 \nconcentration, usually of 4–7 mg\/L. A small exception in zone III exists because groundwater 484 \nis locally diluted by low-F pond recharge. As calcretes contain large concentrations of F, the 485 \nrather uniform F concentrations in the groundwaters from the lower reaches of the watershed 486 \ncould be limited by co-precipitation with calcrete, or adsorption of F to carbonate mineral 487 \nsurfaces. 488 \n5. Conclusions 489 \nThe Wailapally granitic watershed, characterized by high-F groundwater (up to 7.6 mg\/L), is 490 \ncomposed of distinct geomorphological segments which experience notable variations in 491 \ngroundwater chemical composition. The western part contains a thick weathered zone (valley 492 \nfill deposits) which acts as the main recharge area for the watershed and groundwater flows 493 \nlaterally towards the eastern part which forms a discharge zone. Hydrochemical facies evolve 494 \nfrom Na-Ca-HCO3 and Ca-Na-HCO3 in the west to Na-HCO3 and Na-HCO3-Cl in the eastern 495 \n(discharge) area. Irrespective of chemical facies of groundwater in different geomorphological 496 \nsegments the F concentration in the dominantly fluorite-undersaturated groundwaters remains 497 \nrelatively constant, at around 3–7 mg\/L. Abundant F sources, in the form of hornblende, 498 \nbiotite, apatite, fluorite and F-rich calcretes, a closed hydrological basin and dry climate 499 \n 23\nprovide favorable conditions for the release of F to groundwater. It is hypothesized that the 500 \nrather uniform concentrations of F in zones II to IV are due to removal of F from the 501 \ngroundwater by co-precipitation with, and\/or adsorption to, calcrete deposits in the weathered 502 \nhorizons of the aquifer. This is supported by the high concentrations of F found in the calcrete 503 \nsamples analysed in the study. 504 \nThe study has an important practical utility as it helps to locate groundwaters with F 505 \nconcentrations below the WHO guideline value and to explain their origin. Sources of 506 \ndrinking water with acceptably low F concentrations in the watershed are mainly located in 507 \nareas of preferential flow recharge and surface water bodies. 508 \nACKNOWLEDGEMENTS 509 \nThe authors are thankful to the Director NGRI for the permission to publish the paper and 510 \nRegional Director, CGWB Southern Region for his kind cooperation during the well 511 \ninventory work. B.S. Sukhija thanks CSIR for the award of Emeritus Scientist scheme. We 512 \nalso thank Dr. Krishna, NGRI, for analyzing the rock and soil samples for total fluoride and 513 \nDr. J.S. Bhargava, Hydrochemical wing of CGWB, for valuable discussions. This work has 514 \nbeen carried out under the CSIR Network Project on Groundwater (COR-0005). 515 \nREFERENCES 516 \nAbu Rukah, Y., Alsokhny, K., 2004. Geochemical assessment of ground water contamination 517 \nwith special emphasis on fluoride concentration in North Jordan. Chemie der Erde, 64, 518 \n171-181. 519 \nApambire, W.B, Boyle, D.R., Michel, F.A., 1997. Geochemistry, genesis, and health 520 \nimplications of fluoriferous ground waters in the upper regions of Ghana. Environmental 521 \n 24\nGeology 33 (1), 13-24. 522 \nAyoob, S., Gupta, A. K., 2006. Fluoride in Drinking Water: A Review on the Status and 523 \nStress Effects, In: Critical Reviews in Environmental Science and Technology, 36:6, 433-524 \n487. DOI: 10.1080\/10643380600678112 525 \nCarpenter, R. 1969. Factors controlling the marine geochemistry of fluorine. Geochimica et 526 \nCosmochimica Acta 33, 1153-1167. 527 \nEdmunds, W.M., Smedley, P.L., 2005. Fluoride in natural waters. In: Selinus O (Ed) 528 \nEssentials of Medical Geology. Elsevier Academic Press, London, pp 301–329. 529 \nFan, X., Parker, D.J., Smith, M.D., 2003. Adsorption kinetics of fluoride on low cost 530 \nmaterials. Water Research 37, 4929-4937. 531 \nGaciri, S.J., Davies, T.C., 1993. The occurrence and geochemistry of fluoride in some natural 532 \nwaters of Kenya. Journal of Hydrology 143, 395–412 533 \nGenxu, W., Guodong, C., 2001. Fluoride distribution in water and the governing factors of 534 \nenvironment in arid north-west China. Journal of the Arid Environment 49, 601-614. 535 \nGeological Survey of India, 1974. Hydrogeochemical investigation for fluoride bearing 536 \nminerals in Kangal and Halia river basin, Nalgonda district, AP. Unpublished GSI Report, 537 \nHyderabad, India. 538 \nGrandjean, P., Olsen, J.H., Jensen, O.M., Juel, K., J., 1992. Cancer incidents and mortality in 539 \nworkers exposed to fluoride. National Cancer Institute (Bathesda), 84, 1903-1909. 540 \nHanda, B.K. (1975) Geochemistry and genesis of fluoride-containing ground waters in India. 541 \nGround Water 13, 275–281. 542 \n 25\nHay, R.L. and Wiggins, B. 1980. Pellets, ooids, sepiolite and silica in three calcretes of the 543 \nsouthwestern United States. Sedimentology 27, 559-576. 544 \nHudak, P.F. Sanmanee, S., 2003. Spatial patterns of nitrate, chloride, sulphate and fluoride 545 \nconcentrations in the Woodbine aquifer of north-central Texas. Environmental Monitoirng 546 \nand Assessment 82(3), 311-320. 547 \nJacks, G., Rajagopalan, K., Alveteg, T. Jonsson, M., 1993. Genesis of high-F groundwaters, 548 \nsouthern. India. Applied Geochemistry, Supplimetary Issue no. 2, 241-244. 549 \nJacks, G., Bhattacharya, P. Choudary, V. Singh, K.P., 2005. Controls on the genesis of some 550 \nhigh fluoride ground waters in India. Applied Geochemistry 20, 221-228. 551 \nJacks G, Sharma, V.P., 1995. Geochemistry of calcic horizons in relation to hillslope 552 \nprocesses, southern India. Geoderma 67, 203-214. 553 \nJohnston, D.C., 1987. Distribution of Environmental chloride in relation to subsurface 554 \nHydrology. Journal of Hydrology, 94, 67-88. 555 \nKadir, S. and Eren, M. 2008. The occurrence and genesis of clay minerals associated with 556 \nQuaternary caliches in the Mersin area, southern Turkey. Clays and Clay Minerals 56, 557 \n244-258. 558 \nKim, K. Jeong, G.Y., 2005. Factors influencing natural occurrence of fluoride rich ground 559 \nwaters: a case study in the southeastern part of the Korean Peninsula. Chemosphere 560 \n58(10), 1399–1408 561 \nKundu, N., Panigrahi, M.K., Tripathy, S., Munshi, S., Powell, M.A., Hart, B.R., 2001. 562 \nGeochemical appraisal of fluoride contamination of groundwater in the Nayagarh District 563 \n 26\nof Orissa, India. Environmental Geology 41, 451-460. 564 \nNatarajan, V Mohan Rao V.R., 1974. Hydrogeochemical investigation for fluoride bearing 565 \nminerals in Kangal and Halia river basin, Nalgonda district, AP. Vol. Of Symposium on 566 \nFluorosis, Indian Academy of Geosciences, Hyderabad. 567 \nNatarajan, V. Murthy, S.R.N., 1974. Fluorite bearing granites of sivanagudem area, Nalgonda 568 \nDisrticrt, Andhra Pradesh. Proc. Of the Sym. On Fluorosis. Held at Hyderabad 1974. 569 \nNawlakhe, W.G., Kulkarni, D.N., Pathak, B.N Bulusu, K.R., 1975. De-fluoridation of water 570 \nby Nalgonda technique. Indian Journal of Environmental Health 17, 26-65. 571 \nNordstrom, D.K., Jenne, E.A. 1977. Fluorite solubility equilibria in selected geothermal 572 \nwaters. Geochimica Cosmochimica Acta 41, 175-188. 573 \nOzsvath, D.L. 2005.  Marathon County, Wisconsin. Environmental Geology 50 (1), 132 – 138.  574 \nParkhust, D.L., Appelo, C.A.J. 1999. User’s Guide to PHREEQC (Version 2) – A computer 575 \nprogram for speciation, batch reaction, one-dimensional transport, and inverse 576 \ngeochemical calculations. U.S.G.S. Water Resources Investigations Report 99-4259, 577 \nU.S.G.S, Denver, USA. 578 \nQinghai Guo, wang, Yanxin., Ma, Teng Ma Rui 2006. Geochemical processes controlling the 579 \nelevated fluoride concentrations in groundwaters of the Taiyuan Basin, Northern China. 580 \nJournal of Geochemical Exploration doi:10.1016\/ j.gexplo.2006.07.001. 581 \nRammohan Rao, N.V., Rao, N., Rao, KS.P., Schuiling, R.D., 1993. Fluorine distribution in 582 \nwaters of Nalgonda District, Andhra Pradesh, India. Environmental Geology 21(1-2), 84–583 \n89. 584 \n 27\nRamesham, V. Rajagopalan, K., 1985. Fluoride ingestion into the natural waters of hard-rock 585 \nareas, Peninsular India, Journal of the Geological Society of India 26, 125-132. 586 \nReddy, A.G.S., 2002. Occurrence, genesis and control strategies of fluoride, Wailapally 587 \nwatershed, Nalgonda district, Andhra Pradesh. CGWB, Southern region report. 588 \nReddy, D.V., Nagabhushanam, P., Sukhija, B.S., Reddy, A.G.S., 2009. Geochemical 589 \nSignatures: Source area, Recharge Processes and dynamic behavior of groundwater in 590 \nWailapally Granitic Watershed, Nalgonda Dist., AP, India. Journal of Hydrology DOI: 591 \n10.1002\/hyp.7236. 592 \nRodas, M., Luque, F.J. Mas, R. and Garzon, M.G. 1994. Calcretes, palycretes and silcretes in 593 \nthe Palaeogene detrital sediments of the Duero and Tajo Basins, central Spain. Clays & 594 \nClay Minerals 29, 273-285. 595 \nShaji, E., Bindu, Viju, J., Thambi, D.S., 2007, High fluoride in groundwater of Palghat district, 596 \nKerala. Current Science 92, 240-245. 597 \nSatsangi, G.S., Lakhani A., Khare P., Singh S.P., Kumari K.M. and Srivastava, S.S. 1998. 598 \nComposition of rain water at a semi-arid rural site in India. Atmospheric Environment 32, 599 \n3783-3793. 600 \nSharma, M.L. Hughes, M.W., 1985. Groundwater recharge estimation using Chloride, 601 \nDeuterium, Oxygen-18 profile in the deep coastal sands of Western Australia. Journal of 602 \nHydrology 81, 93-109. 603 \nSiddiqui, A.H. 1968. Fluorosis in Nalgonda district Hyderabad, India. Fluoride, 1-2, 76-85. 604 \nSmedley, P.L., Nicolli H. B., Macdonald D. M. J., Barros A. J., and Tullio J. O. 2002. 605 \nHydrogeochemistry of arsenic and other 606 inorganic constituents in groundwaters from \n 28\nLa Pampa, Argentina. Applied Geochemistry 17, 259-284. 607 \nSukhija, B.S., Reddy, D.V., Nagabhushanam, P., Chand, R., 1988. Validity of the 608 \nenvironment chloride method for the recharge evaluation of coastal aquifers, India. 609 \nJournal of Hydrology 99, 349-366. 610 \nTirumalesh, K., Shivanna, K., and H.V., Jalihal, A.A. 2007. Isotope, hydrochemical approach 611 \nto understand fluoride release into ground waters of Ilkal area, Bagalkot dist., Karnataka, 612 \nIndia. Hydrogeology Journal 15, 589-598. 613 \nTurner, B.D., Binning, P., Stipp, L.S.S. 2005. Fluoride removal by calcite: evidence for 614 \nfluoride precipitation and surface adsorption. Environmental Science & Technology 39, 615 \n9561-9568. 616 \nValenzuela, L.V., Ramirez, J.H., Reyes, J.L., Sol, A.U., Lazaro O.M. 2006. The origin of 617 \nfluoride in groundwater supply to Hermosillo City, Sonora, Mexico. Environmental 618 \nGeology 51, 17-27. 619 \nWang, G., Cheng, G., 2001. Fluoride distribution in water and the governing factors of 620 \nenvironment in arid north-west China. Journal of the Arid Environment 49, 601–614. 621 \nWatts, N.L. 1980. Quaternary pedogenic calcretes from the Kalahari (southern Africa): 622 \nmineralogy, genesis and diagenesis. Sedimentology 27, 661-686. 623 \nWHO, 2004. Guidelines for Drinking-Water Quality, Third Edition. World Health 624 \nOrganization, Geneva, 212 pp. 625 \nWright, V.P. and Tucker, M.E. (eds.) 1991. Calcretes. Reprint Series 2, International 626 \nAssociation of Sedimentologists. Blackwell, Oxford. 627 \n 29\nLIST OF FIGURES 628 \nFig.1 Location of Wailapally watershed (Nalgonda district, Andhra Pradesh, India) showing 629 \nthe different geomorphological units (zones), along with soil profiles investigated. 630 \nFig. 2 Location of sampled boreholes and distribution of fluoride in groundwater in the 631 \nWailapally watershed. The water-table contours (m amsl) show groundwater flow from 632 \nwest to east. The inset shows a histogram of F distributions. 633 \nFig. 3. Variation of groundwater fluoride concentration in the flow direction in a 3.5 km 634 \nstretch of the valley fill\/recharge area (zone I). Fig. 3a to d: relationship between F and other 635 \nmajor ions in the groundwaters from the same transect. 636 \nFig. 4. Fluoride concentration in the groundwater as a function of borehole depth. 637 \nFig. 5. Variation in saturation indices and concentrations of calcium, magnesium and fluoride 638 \nin groundwaters with distance down the flow gradient. 639 \nFig. 6. Depth distribution of total and water-soluble fluoride in the soil depth profiles: a) 640 \nDubbagadda Tanda (DT, recharge area, zone I), b) Lachammagudem (LG, zone II) and 641 \nc) Yelamakanna (YK, discharge area, zone IV). 642 \nFig. 7. Average soluble fluoride in various depth profiles as a function of fluoride 643 \nconcentration in the respective groundwater. Pink triangle: Dubbagadda Tanda, red circle: 644 \nGattuppal-Yelamakanna Road. 645 \nFig. 8. A conceptual model of the mechanism and processes that control the fluoride 646 \nconcentration in the granitic aquifer. 647 \n 648 \n 30\nTable 1. Statistical summary of the hydrochemical data set of Wailapally groundwater samples. \nZone  pH EC Na K Mg Ca Cl SO4 HCO3 CO3 NO3 F SIC SID SIF \n   µS\/cm mg\/L mg\/L mg\/L mg\/L mg\/L mg\/L mg\/L mg\/L mg\/L mg\/L log log log \nWhole watershed ave 7.66 891 121.1 1.8 32.2 20.8 59.4 24.4 433 3 16.6 3.6 -0.044 0.363 -0.529 \n(n=433) std 0.40 374 86.0 2.8 17.3 9.7 59.5 34.3 174 11 9.4 1.2 0.383 0.960 0.398 \n min 6.57 230 21.6 <0.2 3.0 3.1 4.0 4.1 134 0 0.0 0.5 -1.374 -3.086 -2.037 \n max 8.93 2130 513 28.1 91.7 82.1 349.9 501.2 869 105 49.7 7.6 0.923 2.675 0.381 \nZone I ave 7.38 525 57.1 0.7 15.5 27.1 17.7 11.6 272  14.7 3.6 -0.304 -0.582 -0.276 \n(n=118) std 0.37 123 15.6 0.3 5.5 9.1 11.4 4.8 60  8.1 0.8 0.422 0.907 0.266 \n min 6.57 230 21.6 0.3 3.0 12.5 4.0 4.1 134  0.0 1.6 -1.374 -3.086 -0.922 \n max 8.30 828 91.6 2.2 33.9 56.6 52.4 25.9 447  49.4 5.4 0.588 1.302 0.381 \nZone II ave 7.65 918 108 1.7 38.2 20.4 59.5 17.6 446  16.9 3.6 -0.023 0.504 -0.515 \n(n=218) std 0.26 254 43.0 1.5 14.8 8.8 47.6 10.1 147  9.7 1.1 0.298 0.622 0.339 \n min 6.93 322 40.3 0.3 6.7 4.7 5.5 5.3 193  0.0 1.3 -0.825 -1.915 -1.645 \n max 8.38 1710 253 13.1 85.6 82.1 302.8 69.5 775  49.7 7.6 0.923 2.422 0.241 \nZone III ave 7.76 1210 179 4.8 47.1 17.9 110.6 35.6 564  18.7 3.0 0.086 0.876 -0.856 \n(n=60) std 0.23 386 80.2 5.3 17.0 6.1 84.2 28.1 163  8.3 1.5 0.230 0.579 0.432 \n min 7.41 447 37.8 0.9 15.6 5.5 10.9 4.4 189  0.9 0.5 -0.428 -0.711 -2.024 \n max 8.50 1960 346 28.1 91.7 33.0 349.9 176.5 869  39.5 6.0 0.733 2.228 -0.087 \nZone IV ave 8.45 1380 311 1.9 26.4 7.7 108 87.1 655 32 17.6 4.3 0.450 1.709 -0.882 \n(n=37) std 0.20 361 94.5 4.0 12.8 2.7 65.3 84.2 110 25 12.0 1.3 0.245 0.392 0.396 \n min 7.95 777 133 <0.2 7.6 3.1 16.7 8.1 397 0 0.0 1.1 -0.117 0.713 -2.037 \n max 8.93 2130 513 25.1 61.0 14.4 238.0 501.2 848 105 45.2 7.0 0.922 2.675 -0.225 \n \n 31\nTable 2. Correlation coefficient (r2) between fluoride and other chemical constituents in \ngroundwater for different ranges of fluoride concentration. \nF range (mg\/L) 0.5 to 7.6 0.5 to 1.5 1.6 to 3.0 3.1 to 5.0 5.1 to 7.6 \nNo. samples 433 14 129 246 44 \npH 0.200 0.465 -0.007 0.128 0.016 \nConductivity 0.191 0.354 0.036 0.143 0.254 \nNa 0.243 0.374 0.071 0.179 0.217 \nK -0.133 -0.625 -0.260 0.077 0.021 \nMg 0.077 0.741 -0.078 0.047 0.103 \nCa 0.001 -0.370 0.137 0.014 -0.137 \nCl 0.061 0.352 0.059 0.033 0.169 \nHCO3 0.287 0.591 0.035 0.198 0.160 \nCO3 0.235 -0.207 0.275 0.271 0.023 \nSO4 0.092 0.197 0.015 0.154 0.362 \n \nTable 3. Total fluoride concentrations in the country rock and soil profile, and soluble \nfluoride in the soil profile and fluoride in the groundwater. \nProfile location Zone Total F in \nrocks (mg\/kg)\nProfile \ndepth \n(m) \nAverage total \nF in soil \nprofile \n(mg\/kg) \nAverage water-\nsoluble F in \nprofile (mg\/kg) \nF in nearby \ngroundwater \n(mg\/L) \nDubbagadda Tanda I 989@1 1.7 626 0.5 3.7 \nGangamolla Tanda I  2.5  3.0 2.5 \nLachammagudem \nLacham’m calcrete \nII \nII \n338@2 \n875 \n1.2 \n- \n1015 \n- \n10 \n1.8 \n7.0 \n7.0 \nWailapally \nWailapally calcrete \nII \nII \n- \n947* \n3.6 \n- \n- \n- \n10 \nnd \n5.5 \n5.0 \nDarma Tanda III 716@3 1.0 343 3.6 2.2 \nGattuppal III  3.2  6.2 5.0 \nPuttapaka \nPuttapaka calcrete \nIII  \n635 \n0.5 568 4.9 \nnd \n2.5 \nGattuppal-\nYelamakanna Road \nG-VR calcrete \nG-VR calcrete \nIII \n \n \nIII \n2884 \n \n7005 \n685* \n0.8 \n \n \n- \n384 \n \n \n- \n1.4 \n \n7.6 \n0.7 \n5.0 \n \n \n6.0 \nYelamakanna IV 242@ 3.4 685 5.0 4.0 \n@ rock samples1 – average of 7 samples; 2 – average of 2 samples; 3 – average of 3 samples; 4 – \naverage of 3 samples; 5 – average of 5 weathered calcrete samples; *fresh surface calcrete (two \nsamples each); nd – F is not detected \n 32\nTable 4. Chemical composition of calcretes from the Wailapally watershed. \nSample Sample names Zone SiO2 Al2O3 Fe2O3(T) MnO MgO CaO Na2O K2O TiO2 P2O5 Sum F \n   % % % % % % % % % % %  \n               \n1 Calcrete over alkaline soil II 13.99 3.44 1.57 0.08 3.09 37.95 0.46 0.70 0.30 0.04 61.62 583 \n2 CLC-LG II 16.04 4.28 1.88 0.2 2.13 35.16 1.04 0.74 0.30 0.03 61.8 875 \n3 CLC over alkaline soil -WP II 18.08 4.64 1.66 0.11 13.5 29.22 1.11 0.97 0.30 0.01 69.64 948 \n4 CLC YKGT-RD III 13.26 3.03 1.49 0.17 9.06 37.03 0.33 0.6 0.29 0.02 65.28 691 \n5 Nodules YKGT-RD III 12.64 2.73 1.41 0.08 1.54 41.28 0.08 0.57 0.29 0.02 60.64 441 \n6 CLC YKGT-RD III 14.34 3.63 1.71 0.14 15.6 32.63 0.97 0.65 0.3 0.01 69.98 1158 \n7 CLC YKGT-RD III 13.71 3.22 1.59 0.13 6.56 37.23 0.25 0.60 0.29 0.01 63.59 684 \n8 CLC below red soil III 14.84 4.14 1.70 0.13 1.78 36.89 0.44 0.87 0.30 0.02 61.11 634 \n9 Calcrete GT-YK road III 14.16 3.47 0.86 0.02 11.98 51.13 1.19 0.36 0.10 0.02 83.29 660 \n10 CLC\/weathered IV 14.27 3.55 1.62 0.08 2.21 37.63 0.89 0.64 0.30 0.01 61.2 538 \n11 CLC kk IV 14.81 3.61 1.55 0.23 1.84 37.08 0.51 0.89 0.29 0.02 60.83 457 \n \n"}