{"doi":"10.1049\/ip-smt:20040855","coreId":"135685","oai":"oai:bradscholars.brad.ac.uk:10454\/3617","identifiers":["oai:bradscholars.brad.ac.uk:10454\/3617","10.1049\/ip-smt:20040855"],"title":"SAR and Radiation Performance of Balanced and Unbalanced Mobile Antennas using a Hybrid Computational Electromagnetics Formulation.","authors":["Abd-Alhameed, Raed A.","Excell, Peter S.","Khalil, K.","Alias, R.","Mustafa, J."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2004","abstract":"NoA procedure to reduce the effect of the mobile antenna on the handset by using balanced antennas has been investigated. Use of this type of antenna may degrade the antenna performance, such as bandwidth and gain, although it can cause less effect on the body to which they are adjacent. If the antennas are well designed, the maximum specific absorption rate (SAR) values are likely to be reduced when placed next to the head, since the coupling of such antennas to the body of the handset is very weak. A study on balanced and unbalanced antennas for mobile handsets next to the human head is presented, using a hybrid electromagnetics method for the analysis. The method uses the hybridisation technique between the frequency-domain method of moments (MoM) and the finite-difference time-domain method (FDTD). The antenna was modelled using MoM whereas the head tissues were modelled using FDTD. Two antennas were designed and investigated with respect to the SAR and radiation performance for two different antenna positions on the top edge of a mobile handset. Radiation patterns are presented and compared, with and without the head, and the maximum SAR values and field distributions inside the head are discussed. The balanced antenna shows good improvements with respect to the unbalanced antenna in terms of the SAR values and variations of the input impedances","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/3617<\/identifier><datestamp>\n                2017-03-21T13:14:12Z<\/datestamp><setSpec>\n                com_10454_413<\/setSpec><setSpec>\n                col_10454_6345<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nSAR and Radiation Performance of Balanced and Unbalanced Mobile Antennas using a Hybrid Computational Electromagnetics Formulation.<\/dc:title><dc:creator>\nAbd-Alhameed, Raed A.<\/dc:creator><dc:creator>\nExcell, Peter S.<\/dc:creator><dc:creator>\nKhalil, K.<\/dc:creator><dc:creator>\nAlias, R.<\/dc:creator><dc:creator>\nMustafa, J.<\/dc:creator><dc:subject>\nSAR<\/dc:subject><dc:subject>\nAntennas<\/dc:subject><dc:subject>\nSpecific absorption rate<\/dc:subject><dc:subject>\nMoM<\/dc:subject><dc:subject>\nFDID<\/dc:subject><dc:subject>\nBalanced antennas<\/dc:subject><dc:subject>\nMobile antennas<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nA procedure to reduce the effect of the mobile antenna on the handset by using balanced antennas has been investigated. Use of this type of antenna may degrade the antenna performance, such as bandwidth and gain, although it can cause less effect on the body to which they are adjacent. If the antennas are well designed, the maximum specific absorption rate (SAR) values are likely to be reduced when placed next to the head, since the coupling of such antennas to the body of the handset is very weak. A study on balanced and unbalanced antennas for mobile handsets next to the human head is presented, using a hybrid electromagnetics method for the analysis. The method uses the hybridisation technique between the frequency-domain method of moments (MoM) and the finite-difference time-domain method (FDTD). The antenna was modelled using MoM whereas the head tissues were modelled using FDTD. Two antennas were designed and investigated with respect to the SAR and radiation performance for two different antenna positions on the top edge of a mobile handset. Radiation patterns are presented and compared, with and without the head, and the maximum SAR values and field distributions inside the head are discussed. The balanced antenna shows good improvements with respect to the unbalanced antenna in terms of the SAR values and variations of the input impedances.<\/dc:description><dc:date>\n2009-10-06T10:10:17Z<\/dc:date><dc:date>\n2009-10-06T10:10:17Z<\/dc:date><dc:date>\n2004<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nNo full-text available in the repository<\/dc:type><dc:identifier>\nAbd-Alhameed, R.A., Excell, P.S., Khalil, K. and Alias, R. et al. (2004).  SAR and Radiation Performance of Balanced and Unbalanced Mobile Antennas using a Hybrid Computational Electromagnetics Formulation.   KIEE Proceedings - Science Measurement and Technology. Vol. 151, No. 6, pp. 440-444.<\/dc:identifier><dc:identifier>\n90002586<\/dc:identifier><dc:identifier>\n90008859<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/3617<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1049\/ip-smt:20040855<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1049\/ip-smt:20040855"],"year":2004,"topics":["SAR","Antennas","Specific absorption rate","MoM","FDID","Balanced antennas","Mobile antennas"],"subject":["Article","No full-text available in the repository"],"fullText":null}