{"doi":"10.1145\/1296951.1296964","coreId":"102117","oai":"oai:epubs.surrey.ac.uk:1564","identifiers":["oai:epubs.surrey.ac.uk:1564","10.1145\/1296951.1296964"],"title":"Viable Wikis - Struggle for life in the wikisphere","authors":["Roth, Camille"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-01-01","abstract":"<p>Wikis are collaborative platforms enabling collective elaboration of knowledge, the most famous and possibly the most successful thereof being the Wikipedia. There are currently plenty of other active open-access wikis, with varying success: some recruit many users and achieve sustainability, while others strive to attract sufficient active contributors, irrespective of the topic of the wiki. We make an exploratory investigation of some factors likely to account for these various destinies (such as distinct policies, norms, user incentives, technical and structural features), examining the demographics of a portion of the wikisphere. We underline the intertwining of population and content dynamics and emphasize the existence of different periods of development of a wiki-based community, from bootstrapping by founders with a pre-established set of rules, to more stable regimes where constant enrollment and training of new users balances out the occasional departure of more advanced users.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1564<\/identifier><datestamp>\n      2017-10-31T14:02:22Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:736F63696F6C6F6779<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1564\/<\/dc:relation><dc:title>\n        Viable Wikis - Struggle for life in the wikisphere<\/dc:title><dc:creator>\n        Roth, Camille<\/dc:creator><dc:description>\n        <p>Wikis are collaborative platforms enabling collective elaboration of knowledge, the most famous and possibly the most successful thereof being the Wikipedia. There are currently plenty of other active open-access wikis, with varying success: some recruit many users and achieve sustainability, while others strive to attract sufficient active contributors, irrespective of the topic of the wiki. We make an exploratory investigation of some factors likely to account for these various destinies (such as distinct policies, norms, user incentives, technical and structural features), examining the demographics of a portion of the wikisphere. We underline the intertwining of population and content dynamics and emphasize the existence of different periods of development of a wiki-based community, from bootstrapping by founders with a pre-established set of rules, to more stable regimes where constant enrollment and training of new users balances out the occasional departure of more advanced users.<\/p><\/dc:description><dc:date>\n        2007-01-01<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1564\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Roth, Camille  (2007) Viable Wikis - Struggle for life in the wikisphere  In: Proceedings of the 2007 international symposium on Wikis - WikiSym '07.     <\/dc:identifier><dc:relation>\n        10.1145\/1296951.1296964<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1564\/","10.1145\/1296951.1296964"],"year":2007,"topics":[],"subject":["Conference or Workshop Item","PeerReviewed"],"fullText":"Viable Wikis\nStruggle for Life in the Wikisphere\nCamille Roth ∗\nCRESS \/ Department of Sociology, University of Surrey, Guildford, GU2 7XH, UK\nc.roth@surrey.ac.uk\nAbstract\nWikis are collaborative platforms enabling collective elabo-\nration of knowledge, the most famous and possibly the most\nsuccessful thereof being the Wikipedia. There are currently\nplenty of other active open-access wikis, with varying suc-\ncess: some recruit many users and achieve sustainability,\nwhile others strive to attract sufficient active contributors, ir-\nrespective of the topic of the wiki. We make an exploratory\ninvestigation of some factors likely to account for these var-\nious destinies (such as distinct policies, norms, user incen-\ntives, technical and structural features), examining the de-\nmographics of a portion of the wikisphere. We underline the\nintertwining of population and content dynamics and empha-\nsize the existence of different periods of development of a\nwiki-based community, from bootstrapping by founders with\na pre-established set of rules, to more stable regimes where\nconstant enrollment and training of new users balances out\nthe occasional departure of more advanced users.\nCategories and Subject Descriptors H.3.3, H.3.4 [Infor-\nmation storage and retrieval]: systems and software, online\ninformation services; K.4.3 [Computers and society]: col-\nlaborative work\nGeneral Terms Human Factors, Management, Reliability\nKeywords Wikis, online communities, viability, wikisphere,\ncollaborative work, user incentives, Wikipedia.\n1. Introduction\nWikis are websites whose content can be elaborated by gen-\nerally any user in a collective and collaborative fashion — the\nmost famous and possibly the most successful of these plat-\nforms being Wikipedia, a multi-lingual encyclopedia which\nalso attracted a substantial academic interest recently [1–\n∗ I am grateful for enlightening talk with Julien Levrel, and discussions with Nigel\nGilbert, Chris Goldspink, Bastien Guerry, Dario Taraborelli and Lu Yang. Research\npartly funded by EC project “PATRES”, contract #043268.\nPermission to make digital or hard copies of all or part of this work for personal or\nclassroom use is granted without fee provided that copies are not made or distributed\nfor profit or commercial advantage and that copies bear this notice and the full citation\non the first page. To copy otherwise, to republish, to post on servers or to redistribute\nto lists, requires prior specific permission and\/or a fee.\nWikiSym’07, October 21–23, 2007, Montréal, Québec, Canada.\nCopyright c© 2007 ACM 978-1-59593-861-9\/07\/0010. . . $5.00\n13].1 There are currently, however, plenty of other active\nwikis, with varying success: some recruit many users, achiev-\ning sustainability with established role distributions, frequent\nupdating and efficient fight against vandalism, while others\nstrive to attract contributors. These many projects either have\ndistinct policies or scope but are still sustainable, or have\nidentical policies but die; all endeavoring to survive within\nwhat may be called the “wikisphere”. Examples include top-\nical wikis, such as ExampleProblems, a repository of math\nexample problems, or geographical wikis, such as DavisWiki\nwhich aims at creating Davis, CA-related content.\nIn this paper, we make an exploratory investigation of\nsome factors likely to account for these various destinies, in\nterms of policies, norms, user incentives, as well as techni-\ncal and structural features, so as to describe the pillars of the\nviability of wiki-based communities. Viability should be un-\nderstood as dynamic stability of both population and quality\ncontent: in other words, a viable wiki should be able to sur-\nvive large variations in the stock of users and articles so that\nthe whole content can be maintained by a sufficient number\nof users. As our main interest is in online communities, we\ndo not wish to consider wikis primarily supported by (and\nwhose viability is thus linked to) pre-existing offline work-\ngroups, where casual visitors would be unable to join as (full)\ncontributors. We thus focus on communities emanating from\nthe wiki platform, even if boundaries become relatively fuzzy\nwhen non-wiki groups open a wiki and let online visitors\ncontribute (e.g., open-source developers of iPodLinux open-\ning their documentation-writing process on a wiki) or when\nwiki groups partially transform into “real-life” communities\n(e.g., Wikipedians attending WikiMania conferences).\nWe first examine the current state of the wikisphere and\n(dis)similarities between wikis, supported by quantitative\nanalysis of their demographics. In a second part, we qual-\nitatively describe several processes which may account for\ntheir dynamics and survivability, and eventually outline some\nbasic ingredients of a model of a viable wiki community.\n2. Many wikis... many communities\nIn this section, we empirically investigate how homogeneous\nand heteregeneous the wikisphere may be, focusing on two\nsets of wiki communities: (I) for a qualitative insight on the\n1 Online collaborative knowledge creation is not a brand-new phenomenon: discussion\nforums with experts tutoring novices, open-source software development groups are of\nthe same sort. By contrast, sharp computer-related skills are not needed to participate\nin most wikis, whose ease of use have pulled in a larger range of users.\n119\nname platform license language scope from users pages governance main website\nWikipedia MediaWiki GFDL multi all-purpose 2001 4,540k 9,047k admins wikipedia.org\nEnciclopediaLibre MediaWiki GFDL Spanish all-purpose 2002 <2k 56k admins enciclopedia.us.es\nCitizendium MediaWiki GFDL multi all-purpose 2006 31k 18k RR, moderated en.citizendium.org\nEkopedia MediaWiki L.A.L. multi topical 2004 <2k 6k admins ekopedia.org\nWikiIndex.org MediaWiki CC multi topical 2005 <2k 12k admins wikiindex.org\niPodLinux MediaWiki GFDL English topical 2004 7k 3k RR, admins ipodlinux.org\nExampleProblems MediaWiki pd English topical 2005 <2k 27k RR, admins exampleproblems.com\nWikinfo MediaWiki GFDL multi all-purpose 2003 <2k 52k admins internet-encyclopedia.org\nWikiTravel MediaWiki CC multi topical 2003 16k 43k admins wikitravel.org\nWorld66 proprietary CC English topical 2001 n.a. 131k admins world66.com\nWikiWikiWeb proprietary pd English topical 1995 n.a. 32k no admins http:\/\/c2.com\/cgi\/wiki\nDavisWiki proprietary CC English topical 2004 4k 10k RR, no admins daviswiki.org\nTable 1. Some features of a few wikis. Platform: in this small sample, at least, MediaWiki is predominant. License: CC stands for “Creative\nCommons”, GFDL “Gnu Free Document License”, L.A.L. “License Art Libre”, pd “public domain”. Language: set of languages in use\n(actual or tentative), “multi” means multi-lingual (in which case statistics correspond to the main\/most important language). Governance:\n“RR” means “Registration Required to contribute”; “admins” denotes the enforcement of community decisions by administrators, while\n“moderated” means that editions will be reviewed before being published. Data retrieved in May 2007.\nwikisphere, we use an arbitrary selection of a dozen wikis;\nwe gather some very basic features for these sites on Tab. 1\n(although this random set may seem rather partial, we deem it\nsufficiently large and diverse to provide an intuition of both\nsimilarity and variety among wikis) (II) for a quantitative\ninsight, we use a larger set of 7649 wikis selected from\ns23.org, a website providing statistics on MediaWiki-based\nwikis2 — see Sec. 2.3 for detailed statistics.\n2.1 Functional regularity\nSome features are shared by many wikis: tautologically,\nthese communities are all based on “wiki” platforms —\nsoftware that generally allows modification of content by\nanyone, to at least some extent: despite a large variety of\nwiki interfaces3, key functional features enabling easy col-\nlective and collaborative content edition are eventually quite\nhomogenous, including notably the possibility of creating\nan account and online identity, immediate inline content\nedition, comprehensive revision history and, often, discus-\nsion or “talk” pages [9]. Also determinant is the licensing\nmode of contributed content: regardless of the profusion of\nlicenses in use on wikis, from the GNU Free Documentation\nLicense to Creative Commons and Licence Art Libre, inter\nalia, their function is essentially identical — allowing con-\ntributions from everyone while providing some protection\non the content for future use, without the rigidity of clas-\nsical copyrighted work. In some instances, no license at all\nis used and contributions enter in the public domain (e.g.,\nWikiWikiWeb or ExampleProblems). From a structural point\nof view, a technical study of article networks in Wikipedias in\nseveral languages [11] suggested that wiki sites share some\ntopological features with WWW networks, notably identical\ndistributions of local patterns, scale-free degree distribution,\nunassortative linking (highly linked pages are connected to\nweakly linked articles) and high clustering\/transitivity.4\n2 Retrieved on 5\/5\/07. wikia wikis were excluded as artifacts, with roughly the same\nnumber of users (∼135k) and very few pages (≤10), suggesting an automatic process.\n3 The Wikipedia page on wikis denombrates at least 60 of them. Among them,\nMediaWiki appears to be prominent, possibly because of its exemplar use in\nWikipedia — it also makes the large majority of our arbitrary selection (Tab. 1) and\nsupports our quantitative case study, with several thousands of wikis based on it. To\nour knowledge, there is however no easy way to assess its exact usage.\n4 The fact that article networks in wikis and WWW are similar should not be surprising\nper se, yet other networks could be defined in wikis (such as social and socio-semantic\n2.2 Organizational variety\nIn contrast to this functional homogeneity, several semantic\nand organizational dimensions strongly differentiate wikis.\nForemost is the scope: there are all-purpose projects aiming\nat building broad encyclopedias, vs. topical projects based on\nnarrower matters, e.g. precise technical or geographical ar-\neas, particular political flavors. Scope includes language(s),\nas wikis may aim at building multi-language content. In this\ncase, language may or may not define distinct communi-\nties, depending on the existence of bridges between various\nlanguage sub-wikis, possibly typical of distinct culturally-\nbiased behaviors or representing various instances of a same\nsystem at distinct development stages, the latter being more\na matter of knowledge diffusion than cultural relativism.\nEditing content within the scope of the wiki project and\nusing its prescribed language(s) may be among the most ba-\nsic policies a benevolent user has to respect. Wikis gener-\nally obey to several other types of policies [3, 7, 9], which\nmay be explicit (rules, usually presented in dedicated meta-\narticles) or implicit (norms), some of the latter potentially\nbecoming explicit as crystalized norms — all such policies\ndepending on the particular, historical development of each\nwiki. For instance, the so-called rule of “Neutral of Point of\nView” (NPOV) in encyclopedia projects such as Wikipedia\nor Citizendium is indeed not common to all wikis: it does\nnot exist in some topical wikis focused on travel (such as\nWikiTravel or World66), environmental or alternative is-\nsues (like Ekopedia), and even in some encyclopedia projects\nsuch as for instance Wikinfo which precisely encourages di-\nverse points of views for a same article.\nTraditional rules include editorial scope policies or be-\nhavioral prescriptions, determining e.g. how to deal with\nconflicts. Some wikis have policy pages, enabling users to\nthemselves evolve the wiki rules. On the same level, some\nrules essentially relate to governance issues and have a di-\nrect influence on how the wiki is managed: non-open and\/or\nasynchronous encyclopedia such as Citizendium obviously\nrequire a different institutional structure and administration\nthan more “anarchic” wikis, such as WikiWikiWeb.\nnetworks: interactions between authors or around articles) and conceivably reveal\npatterns typical of stable wikis or functionally helpful towards their viability.\n120\nEventually, policy variations extend to strict technical\npolicies, directly opposed to the low-level technical similar-\nities emphasized in Sec. 2.1. In particular, some criteria rel-\nevant for appraising technical policies in other types of col-\nlaborative online systems (such as tagging systems [14]) and\npertaining to contributor rights, access rights to other users’\ninformation and social interaction opportunities, inter alia,\nmay be valid for wikis as well. Drawing a comprehensive\ntypology of technical divergences between wikis could start\nwith questions such as: who can contribute? (anonymous vis-\nitors; registered users; approved contributors), how are in-\nteraction and social identity building concretely organized?\n(user pages; discussion pages; off-wiki media such as IRC\nchannels or mailing-lists), what kind of technical features\nare available? (existence of special pages such as category,\nproject, policy pages; possibility of uploading multimedia\ncontent). In turn, these diverse features are likely to funda-\nmentally influence wiki viability, plausibly providing large-\nscale levers to shape their evolution.\nFigure 1. Cumulative numbers of wikis having at least P\npages (W>P , left) and U users (W>U , right).\n2.3 Demographics\nTo shed some light on how this diversity translates in quan-\ntitative terms, we examine basic statistical and demographic\nparameters on the above-mentionned dataset of 7,649 Media-\nWiki wikis: (i) population size, or number of registered users\nU ; (ii) content size, or number of so-called “good pages” P\n(i.e. excluding technical pages such as redirection and talk\npages); (iii) activity measures, or number of edits E.\nFirst, distributions of wiki populations and content sizes\nare very heterogeneous, with many wikis being weakly pop-\nulated or having few pages, and a handful of wikis having a\nlarge number of users or articles — the cumulative distribu-\ntions, presented on Fig. 1, exhibit power-law shapes. How-\never, this statistical parameter hides the much deeper diver-\nsity of the wikisphere, which displays a rather unclear rela-\ntionship between the number of articles and the population\nsize. Indeed, for the 95% least populated wikis (U ≤ 898),\ncontent sizes appear to be spread over several orders of mag-\nnitude (roughly, P is essentially included in [1; 2.103]), with\nbest linear fits being generally weakly accurate and without\nany obvious scale for any of these variables, as the density\nplot emphasizes (Fig. 3, top and left). Most of these relatively\nweakly populated wikis, with less than a thousand users and\nthus perhaps generally younger, may correspond to diverse\ngrowth stages with significantly varied success. Conversely,\nfor larger numbers of users and, more precisely, for the first\npercentile of population size (U ≥ 8111), the spectrum is\nnarrower with a more monotonous relationship between both\nvariables (Fig. 3, right).\n1 100 10000 1. ! 106\nP1\n100\n10000\n1. ! 106\n1. ! 108\nE\n1 10 100 1000 10000 100000.\nU1\n10\n100\n1000\n10000\n100000.\nP\nFigure 2. Left: activity, or number of editsE as a function of\n“good pages” P . Right: scatterplot of P vs. number of users\nU . Each dot is a wiki, the thick line shows the best linear fit.\n1 10 100 1000 10000 100000\n1\n10\n100\n1000\n10000\n100000\n1000000\n1 10 100 1000 10000 100000\n1\n10\n100\n1000\n10000\n100000\n1000000\n1 5 10 50 100 500\nU1\n10\n100\n1000\n10000\n100000.\n1. ! 106\nP\n10000 20000 50000 100000. 200000. 500000. 1. ! 106\nU\n1\n10\n100\n1000\n10000\n100000.\n1. ! 106\nP\nFigure 3. Density plot of P vs. U (top), and scatterplots, as\non Fig.2-right, but plotted for the 95% least populated wikis\nonly (left) and the 1% most populated ones only (right).\nA plausible interpretation of the “fat” area on Fig. 3 could\nbe that it captures both starting wikis (few users, few to\nmany pages) and prospering wikis (more users, more pages)\nwith all intermediate configurations possible and apparently\nequally likely. Nonetheless, activity exhibits a much more\nregular pattern and appears to be roughly proportional to the\nnumber of pages (Fig. 2): hence, activity directly scales with\ncontent size, whereas users do not seem to.\n3. Life and death of wikis\nIn this context, what makes a wiki a lively, or at least viable,\ncommunity? Technically, it consists of just two things: (i) a\ngroup of users, which may or may not become an active com-\nmunity, and (ii) a set of pages or articles, which may or may\nnot become esteemed content. The growth and dynamic sta-\nbility of a wiki community should thus helpfully be measured\nthrough two variables, the number of users U and of articles\nP . These variables, in turn, are linked in a subtle way: if more\nusers allow for more articles to be created and cared of, more\narticles both require more users to maintain them and attract\nmore users because of a better content. In short, population\nis dependent on content, and vice versa. The viability of a\n121\nwiki is thus a dual issue, in terms of population dynamics\n(recruitment, retention, and exclusion or leave) and content\ndynamics (growth as well as stabilization, with quality arti-\ncles), which co-evolve. We hereafter review various factors\nthat may impact one or both of these dynamics.\n3.1 Bootstrapping and founding principles\nFounders usually design both the wiki purpose and initial\npolicies, determinant for bootstrapping the community and\nattracting its pioneer contributors. Sanger [15] notes that\ndesigning Wikipedia’s founding principles had been a cen-\ntralized process — only applying them has later been de-\ncentralized, through “administrators”. Further, the birth of\na new wiki may precisely be triggered by the desire of in-\ntroducing mutations on the core set of rules governing an\nalready-existing wiki, and therefore experiment the effect of\nnew bootstrapping rules [16]. The myriad of encyclopedia\nprojects inspired by Wikipedia are all such instances: for ex-\nample, while Citizendium removed the possibility of imme-\ndiately editing articles, Wikinfo introduced the SPOV.\nVarious policies, as a result, have various authoritative-\nness: while some of the founding principles appear to be\nnon-negotiable — they make the core spirit of the wiki, if\nnot part of their purpose — other rules are more permissive\nand prone to discussion. In particular, if the rule that there\nshould not be any copyrighted material on the site is gener-\nally unchallenged on the Wikipedia, on the other hand, the\nNPOV rule is rather open and often re-interpreted. Old poli-\ncies can generally be modified, while new rules can also be\nproposed, such as categories and related pages which only\nemerged in 2004 in the Wikipedia [9, esp. Fig. 5].\nAs such, various policies also obey to various timescales:\nwhile some rules are discussed often and are potentially mod-\nifiable by new users, founding principles are much more sta-\nble. Wikipedia, again, makes a distinction between “policies”\nand “guidelines”5; in this sense, rules may have distinct le-\ngal statuses, with the core set of policies playing the role\nof a constitution [16]. Still, any Wikipedia policy page has\nthe following banner: “When editing this page, please ensure that\nyour revision reflects consensus. When in doubt, discuss first on the\ntalk page” suggesting indeed that all policies are modifiable,\nincluding the most fundamental ones like NPOV — they may\njust have a very long-lasting effect and thereby provide the\nimpression that they are absolutely irremovable and\/or con-\ntrolled by a small set of etablished users.\n3.2 Population dynamics\nEnabling user incentives. While bootstrapping policies\ndefine a context of primary incentives, there are more broadly\ngeneral incentives for participation in online or open com-\nmunities, which are likely to apply to wikis as well. Several\nprevious works have proposed typologies of the ingredients\nmaking such communities attractive, including studies on the\nWikipedia [3, 5], tagging systems (e.g. Flickr, CiteYouLike,\netc.) [14] or open-source software development [17], or re-\nviews of past literature on web-based community survivabil-\nity [18], to cite a few. On the whole, these studies may offer\n5 http:\/\/en.wikipedia.org\/wiki\/Wikipedia:Policies_and_guidelines\na relevant guide for analyzing wikis in the general case; for\ninstance and in particular, users may generally be interested\nin building one’s own identity, elaborating a common good\nuseful to oneself or to others, improving and displaying one’s\ncreativity, inter alia. Not all users should display sensibility\nto incentives of some kind, nor be driven by only a certain\nkind of incentives. Broadly speaking, however, it seems to be\npossible to distinguish three classes of incentives:\n• “altruistic”, by benevolently contributing to a public good\n(ensured by the type of licenses used by wikis);\n• “socially concerned”, such as influencing others or a\nbroader, less visible audience; sharing with others, be-\nlonging to a community, meeting\/interacting with people,\nbeing seen by others and building an online reputation\nand identity to climb an online social hierarchy;\n• “selfish”, such as improving one’s skills, or enabling the\nfuture retrieval of information for one’s own usage.\nThe variety of combinations of participation, edition and\ntechnical policies creates diverse incentive landscapes, plau-\nsibly determinant for the viability profile of each wiki. Of\ncourse, a minimal requirement would be that at least the topic\nis appealing to some users — possibly providing an advan-\ntage to broad, all-purpose projects such as the Wikipedia,\nwhere anyone could think of being an expert in something.\nEnrollment and leadership. Incentives are, especially at\nthe beginning, crucial ingredients for retaining contributors\nand recruiting new users. Bryant et al. [3] carried one of the\nfirst ethnographic inquiries on a wiki-based community by\ndescribing the whole involvement process and distribution of\nlabor on the Wikipedia, from initial discovery of the wiki\nand its rules, to first contributions such as correcting typos,\naccount creation, up to becoming administrators. Eventually,\nthis process compares with how apprentices progressively in-\ntegrate into a community of practice, being granted knowl-\nedge and use of more and more skills, with older members\nlenient towards newbies. As for an explicit distribution of\nroles, hierarchies in wikis often reduce to a simple dichotomy\nbetween contributors as suppliers of content and administra-\ntors as enforcers of community decisions. Still, this rudimen-\ntary institution not only gives administrators legal and actual\npower over less established users, but also broadly relates to\nperiphery–center roles. Kittur et al. [6] exhibit quantitative\ndifferences between Wikipedia administrators and users: the\nformer are often among the most active contributors; they in-\nformally owe their status to remarkable involvement. In ad-\ndition, their edits themselves seem to be essentially differ-\nent. Normal users indeed appear to make less changes than\nadministrators, deleting more words than they add, thus sug-\ngesting that elite users contribute more to the wiki growth.\nAs a result, administrators in general do not disinguish\nthemselves only on formal powers: they also build their infor-\nmal authority through humble and sustained efforts towards\nthe project [8], such as being concerned with explaining poli-\ncies and transmitting norms to newbies [3]. In turn, respected\nmembers are likely to gain some command when crises arise.\nIn an alleged egalitarian wikipedia, and very probably in\nwikis in general as it does in other virtual communities [17],\n122\nimplicit authority commands: as such, leadership substanti-\nates one aspect of user incentives — virtual identity building\nis not vain — and shed light on wiki viability — in spite of a\npurported decentralized decision process, leaders may exert\nsome limited centralized power to sustain a wiki.6\nGrowth and decline. As shown in Sec. 2.3, wiki population\nmildly correlates with content size. The exponential growth\nof the Wikipedia in terms of both articles and users suggests\nthat successful wikis follow a virtuous demographic path,\nwith content and contributors co-evolving and most likely\npositive feedbacks between both. In the present study we\ndid not gather dynamic data and could not elaborate fur-\nther on potential development regimes which could be ob-\nserved in the larger wikisphere. Nevertheless, the dichotomy\nbetween simple contributors and more involved administra-\ntors appears to induce distinct population dynamics [6]: after\na first period where expert users are the largest contributors\nin terms of edits, and where their influence grows, a second\nstep exhibits a larger overall activity from small contributors.\nInitially, thus, a small group of people becomes involved with\nan embryo of content, bootstraps and establishes the founda-\ntions of the wiki, as said above; then the wiki should ideally\nevolve towards a phase of recruitment of more users and\/or\ncontent of better quality. While there does not seem to be\na clear-cut transition between the two modes, one may dis-\ntinguish the gestation period from the “cruising” mode. This\nprocess may support the explanation of the “wide” area at the\nlower-left of the scatterplot of Fig. 3, with wikis bootstrap-\nping and wikis at a more advanced stage altogether.\nOpen questions relate to which wiki-related reasons may\nmake people leave. As Levrel [16] notes, holding contrib-\nutors in an open project is a challenge in itself, notably\nwhen the project grows and requires more and more super-\nvising and strongly involved users: in the French-language\nWikipedia for example, some administrators required their\nnumber to be increased under the threat of leaving the\nproject, as they were at some point too few to maintain the\never-growing content. Another dreadful threat lies in forks,\ni.e. concurrent wikis emerging from a given project while\nre-using the same content as a seed, dividing communi-\nties and significantly lowering the available workforce for\neach fork, possibly increasing confusion between them. On\nthe bright side, yet, the open-licensing system makes coups\nd’état pointless, as anyone can create a fork whenever the\nproject appears to be monopolized by a small club. For in-\nstance Enciclopedia Libre, a fork of the Spanish-language\nWikipedia, appeared at the very first rumor that advertising\ncould be used to sustain maintenance costs — the project\ngoing “private” would suppress one fundamental user incen-\ntive, the contribution to a common good.\n3.3 Content dynamics\nSome factors underlying population growth are directly\nlinked to content characteristics. Quality content, attesting\na successful collaborative project, is likely to have a posi-\ntive impact on population dynamics. Content growth, on the\n6 See Wikipedia’s founder, Jim Wales, who could willingly play the role of “a British\nmonarch” [19, 8].\nother hand, has a more ambiguous effect, by both improv-\ning the completeness of the project (hence the quality) and\nthe number of users needed to maintain it. In particular, the\n“upper-left” wikis on Fig. 3, with a deficit in users com-\npared to content size, are likely to experience a higher threat\nof abandon, relinquishment or vandalism than other wikis.\nGiven these constraints, how to ensure sustainability?\nContent stabilization. First, “content disasters” [5] are im-\npossible on wikis: the effortless reversibility discourages\nmass vandalism. More interesting are regular threats towards\ncontent consistency, including inaccurate contributions, oc-\ncasional vandalism, more or less ostensible rule-breaking and\nedit wars. Whereas the grossest vandalism does not require\nmore than an appropriate number of users watchdogging wiki\ncontents7, fact falsification or disputes among editors, e.g.,\ninduce more subtle regulation and arbitration procedures.\nConflict-solving mechanisms are in this case well-develo-\nped, talk pages being a prominent means to achieve this [9],\nin particular in relation with (self-organized) policies which\nare interactively set up by Wikipedians, precisely through\ntalk pages themselves — such as, for instance, the “3-revert”\nrule on Wikipedia,8 which in turn induces a certain robust-\nness to vandalism of various kinds. Later, discussion pages\nare also the place where such policies may be enforced, and\neventually, as such, the locus of the coevolution of disputes\nand policies; Viegas et al. [9] emphasize more broadly that\na conventional organization could emerge on wikis from ac-\ntivity patterns in talk pages, rather than from a top-down im-\nposition of norms by some agents. It is therefore a crucial\ninstrument on which contributors may act to restore the via-\nbility of a wiki, either at a local level, e.g. introducing page\nprotection to avoid vandalism, or at a more global level, e.g.\nby defining new ways of dealing with conflicts9. Finally “of-\nfline”, i.e. off-wiki, social networks offer immediate assis-\ntance to more serious conflicts [6], as informal places where\na smaller and more involved part of the community as a real\nsocial network discusses and acts in common outside of the\nwiki, including IRC channels and mailing-lists, notably.\nHere, it is likely that wikis without a governance struc-\nture (i.e., administrators) would have more trouble dealing\nwith conflicts and achieve viability. As a whole, these vari-\nous kinds of stabilization mechanisms suggest that viability\ncan be enforced by various kinds of actors, from very local,\nbottom-up interactions to global, top-down constraints im-\nposed by a small group of “experts”. To another extent, pol-\nicy evolutions have a meta-impact on the content by modify-\ning the landscape of user incentives, inducing a modification\non the longer-term dynamics — as such a method to adapt to\nevolutions in user demand and sustain a wiki.\nQuality evaluation. A last feature of content stabilization\nrelates to its quality, as a key criterion to attract users [3]; and\n7 On Wikipedia for example the “Recent Changes patrol”, a self-organized group,\nchecks recently-modified pages for vandalized content.\n8 Any user making 3 successive reversions of others’ modifications of an article is\nbanned from further editing this article for some time.\n9 For instance, to avoid expelling worthy contributors having an occasional issue\non some article, Wikipedians replaced their policy for dealing with “editor-with-\nproblems” with “relationship-between-two-people-with-problems”, thus without fo-\ncusing on a single person [20].\n123\nindeed content-stabilizing policies intertwine quality poli-\ncies: on Wikipedia for instance, Stvilia et al. [12] show that\nthe notion of “featured article” sets a quality target, while\n“articles for deletion” are a permanent threat establishing a\nminimal quality threshold. Apart from strict vandalism (dele-\ntion, corruption, obvious non-respect of rules) quality re-\nmains hard to appraise with objective criteria, some criterias\nmay nonetheless be induced and operationalized from stud-\nies focused on content quality on one side, and user qual-\nity on the other side. As for content quality, Lih [1] has es-\ntablished criteria correlating quality to the number of edits\n(“rigor”) and editors (“diversity”), while a correlation has\nrecently been established by Wilkinson & Huberman [10]\nbetween Google’s PageRank and edit activity; meanwhile, a\nhand-made comparison of Wikipedia articles with Encyclo-\npedia Britannica unsuccessfully looked for significant differ-\nences [13]. As for user quality, Anthony et al. [2] measure the\nsurvivability of edits made by Wikipedians and identify two\ncategories of worthwhile actors: registered users producing\nmany edits (experts) and anonymous users making few edits\n(passers-by, who are more and more [6]), the importance of\nthis last category being counter-intuitive (esp. with respect to\n[3]), as novices-with-respect-to-a-wiki appear in this case to\nproduce better content than a whole class of registered users.\n4. Conclusion\nWe exhibited both the current state of the wikisphere in terms\nof resembling and differentiating features and properties, and\na few key mechanisms likely to be determinant in explaining\ndiverse destinies of wiki-based communities: bootstrapping\nsettings, initial recruitment processes, incentives to stay in\nthe community and relationships between contributor and\ncontent dynamics. From this, we may now sketch out some\nof the most salient patterns for modeling wiki viability:\n• Population dynamics: (1) Agents: growth is directly co-\nevolving with content size (Sec. 3.2); a proportion of\nusers leave, partially depending on the overall quality. (2)\nStatus: registered users improve over time; a small subset\nof most active users is granted administrator status, mak-\ning better edits, lowering vandalism; some anonymous\nvisitors are better than recently-registered users [2].\n• Content dynamics: (1) Articles: their growth is linked to\npopulation size and existing articles; quality could be as-\nsessed through the number of editors and edits [1], the lat-\nter proportional to previous edits [10]. (2) Meta-content:\nrecreating the ecology of policies would be limited by\nontological uncertainty [21], unless one reproduces ob-\nserved or predefined norms histories; yet, policies could\nstill be independent variables in order to compare devel-\nopment paths induced by various policy sets.\nSuch population and content dynamics might be sufficient\nto describe and perhaps predict the viability and history of\nwiki communities. In this respect, the present paper could\nbe seen as a position paper. Since existing work on wikis is\nessentially focused on the Wikipedia, it could be instructive\nto carry additional qualitative research on behaviors in other\nwikis. Besides, further research should endeavor at observing\nthe growth and perhaps decline of a large set of wikis, instead\nof focusing on their structure at some static timepoint, so as\nto distinguish a variety of development paths.\nReferences\n[1] A. Lih. Wikipedia as participatory journalism: Reliable\nsources? Metrics for evaluating collaborative media as a news\nresource. In 5th Intl Symp on Online Journalism, Austin, TX,\nUSA, April 16–17 2004.\n[2] D. Anthony, S. Smith, and T. Williamson. Explaining quality\nin internet collective goods: Zealots and good samaritans in\nthe case of wikipedia. 2005.\n[3] S. Bryant, A. Forte, and A. Bruckman. Becoming wikipedian:\nTransformation of participation in a collaborative online\nencyclopedia. In Group’05, Sanibel Island, FL, Nov 2005.\n[4] A. Capocci, V. D. P. Servedio, F. Colaiori, L. S. Buriol,\nD. Donato, S. Leonardi, and G. Caldarelli. Preferential\nattachment in the growth of social networks: The internet\nencyclopedia wikipedia. Phys. Rev. E, 74(3):036116, 2006.\n[5] A. Ciffolilli. Phantom authority, self-selective recruitment\nand retention of members in virtual communities: The case of\nwikipedia. First Monday, 8(12), 2003.\n[6] A. Kittur, E. Chi, B. Pendleton, B. Suh, and T. Mytkowicz.\nPower of the few vs. wisdom of the crowd: Wikipedia and the\nrise of the bourgeoisie.\n[7] J. Levrel. Wikipédia, un dispositif médiatique de publics\nparticipants. Réseaux, 24(138):185–218, 2006.\n[8] J. M. Reagle. Do as I do: leadership in the Wikipedia.\nhttp:\/\/reagle.org\/joseph\/2005\/ethno\/leadership.html, 2005.\n[9] F. Viegas, M. Wattenberg, J. Kriss, and F. van Ham. Talk\nbefore you type: Coordination in Wikipedia. In Proc 40th\nHawaii Intl Conf on System Sciences, 2007.\n[10] D. Wilkinson and B. Huberman. Assessing the value of\ncooperation in Wikipedia. First Monday, 12(4), 2007.\n[11] V. Zlatic, M. Bozicevic, H. Stefancic, and M. Domazet.\nWikipedias: Collaborative web-based encyclopedias as\ncomplex networks. Phys. Rev. E, 74(1):016115, 2006.\n[12] B. Stvilia, M. Twidale, L. Smith, and L. Gasser. Information\nquality work organization in Wikipedia. 2007.\n[13] J. Giles. Internet encyclopaedias go head to head. Nature,\n438(7070):900–901, 2005.\n[14] C. Marlow, M. Naaman, d. boyd, and M. Davis. Position\npaper, tagging, taxonomy, flickr, article, toread. In Proc of\nCollaborative Web Tagging Workshop, WWW 06, 2006.\n[15] L. Sanger. The early history of nupedia and wikipedia:\nA memoir. http:\/\/features.slashdot.org\/article.pl?sid=\n05\/04\/18\/164213, 2005.\n[16] J. Levrel. Le développement des contenus libres sur Internet\n- Wikipedia. Technical report, FT R&D TECH\/SUSI, 2005.\n[17] A. Mockus, R. Fielding, and J. Herbsleb. Two case studies\nof open source software development: Apache and Mozilla.\nACM Transactions on Software Engineering and Methodol-\nogy, 11(3):309–346, 2002.\n[18] L. Gallant, G. Boone, and A. Heap. Five heuristics for\ndesigning and evaluating web-based communities. First\nMonday, 12(3), 2007.\n[19] T. McNicho. Wikipedia founder hunts for gold. Business 2.0,\nCNN, February 27, 2007.\n[20] J. Levrel. Personal communication, 2007.\n[21] D. Lane and R. Maxfield. Ontological uncertainty and\ninnovation. J. Evolutionary Econ., 15(1):3–50, 2005.\n124\n"}