{"doi":"10.1177\/0047287509332337","coreId":"102765","oai":"oai:epubs.surrey.ac.uk:2289","identifiers":["oai:epubs.surrey.ac.uk:2289","10.1177\/0047287509332337"],"title":"The Dependence of Tourism SMEs on NTOs The Case of Finland","authors":["Seppala-Esser, R","Airey, D","Szivas, E"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-11-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"SAGE PUBLICATIONS INC","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2289<\/identifier><datestamp>\n      2017-10-31T14:04:57Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:746F757269736D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2289\/<\/dc:relation><dc:title>\n        The Dependence of Tourism SMEs on NTOs The Case of Finland<\/dc:title><dc:creator>\n        Seppala-Esser, R<\/dc:creator><dc:creator>\n        Airey, D<\/dc:creator><dc:creator>\n        Szivas, E<\/dc:creator><dc:publisher>\n        SAGE PUBLICATIONS INC<\/dc:publisher><dc:date>\n        2009-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2289\/2\/AIREY_EMBARGOED_posted.pdf<\/dc:identifier><dc:identifier>\n          Seppala-Esser, R, Airey, D and Szivas, E  (2009) The Dependence of Tourism SMEs on NTOs The Case of Finland   JOURNAL OF TRAVEL RESEARCH, 48 (2).  pp. 177-190.      <\/dc:identifier><dc:relation>\n        http:\/\/jtr.sagepub.com\/content\/48\/2\/177.abstract<\/dc:relation><dc:relation>\n        10.1177\/0047287509332337<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2289\/","http:\/\/jtr.sagepub.com\/content\/48\/2\/177.abstract","10.1177\/0047287509332337"],"year":2009,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" 1 \nThe Dependence of Tourism SMEs on NTOs: the case of Finland \n \n \nAbstract:  \nThis paper reports on a study to explore the level of dependence of small and medium sized \ntourism enterprises (SME) in Finland on the resources of the Finnish Tourist Board (FTB). A \ntool to measure resource dependence was developed.  The overall importance of specified \nresources, the level of exchange of these resources acquired from the FTB, the existence of \nalternative sources for similar resources, as well as access to them, were assessed. The level \nof dependence of Finnish tourism SMEs on the FTB was reported to be moderate.  \nDifferences were, however, identified among different types of enterprises.  The size of \nenterprises, their proportion of foreign guests, their marketing planning, and their cooperation \nwith others affected the level of resource dependence.  The FTB resources on which tourism \nSMEs were most dependent were destination marketing and marketing knowledge.  The \nresults contribute to an understanding of the role of national tourism organizations. \n \nKeywords: Small and Medium Enterprises, tourism, National Tourism Office, inter-\norganizational relations, resource dependence \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 2 \n \nINTRODUCTION \n \nStudies of inter-organizational relationships (IOR) have shown that organizations interact in \norder to attain resources or to tackle uncertainties (Pfeffer and Salancik 2003).  According to \nthe transaction-cost theory, interaction between organizations might also result from their \nneed to reduce the costs, which occur when transactions are arranged, managed, and \nmonitored (Child and Faulkner 1998).  Interaction with others comes at a price, however, for \nit also means that an organization has to give up some of its autonomy (Schmidt and Kochan \n1977; Whetten 1981; Galaskiewicz 1985; Pfeffer and Salancik 2003).  This means that an \norganization eventually becomes to some extent dependent on others in its environment. \n \nThis study was conducted to explore how a National Tourism Organization (NTO) and small- \nand medium-sized tourism enterprises (SME) interact.  More specifically, the study focused \non the resource dependence of SMEs in Finland on the Finnish Tourist Board (FTB). Given \nthe importance of SMEs in tourism and the particular support that the NTOs can provide, their \nrelationship is important not only in understanding the factors that might influence, and \nindeed justify, the work of NTOs but also in understanding the success of tourism \ndestinations.   \n \nThe main aim of the paper is to reveal the potential dependence of tourism SMEs on the key \nresources provided by the FTB.     The results of the research are expected to provide a better \nunderstanding of the resource needs of different kinds of tourism SMEs as well as insights \ninto how important a largely publicly funded NTO is as a resource provider for small and \nmedium sized tourism enterprises.   \n \n \n 3 \nThe study on which the paper is based was carried out in 2005 in Finland which has a large \ntourism SME sector as well as a well-established and active NTO.  By way of background, \nFinland currently records about 18.2 million registered overnight stays annually, two-thirds of \nwhich are by domestic visitors. However, in a country with about five million inhabitants, the \ngrowth prospects for the domestic market are limited.  SMEs - employing up to 249 people \naccording to the EU classification (European Commission 2003) - account for more than 99% \nof businesses in total in the country, with micro businesses (fewer than 10 people) making up \n93%. The value added of SMEs is almost at the same level as that for large enterprises (Small \nBusiness Institute 2000). In other words SMEs are of key importance and this is also true for \ntourism with an estimated 90% of tourism businesses being classified as micro enterprises \n(Peltonen, Komppula, and Ryhänen 2004). The NTO, the Finnish Tourist Board , was \nfounded in 1973. It is a statutory organization with the task of carrying out marketing and \npromotion, in cooperation with the tourist industry, as well as supporting tourism product \nquality and development.  \n 4 \n \nBACKGROUND AND DEFINITIONS \nNATIONAL TOURISM ORGANIZATIONS \n \nThe term tourism organization is, according to Pearce (2000: 586), commonly used “to refer \nto destination-based organizations constituting the official administrative bodies responsible \nfor tourism”.   National tourism organizations are established for the purpose of servicing \nnational objectives (Gee, Makens, and Choy 1997; Peattie and Moutinho 2000).   They vary \nin size, structure, tasks and funding, with many receiving support from the private sector, but \noverwhelmingly they are public bodies in receipt of public funds. This is the case in Finland.  \n \nMarketing is one of the most common tasks of NTOs,  although many are also engaged in \nother activities to support tourism in the destination including product development, quality \ncontrol, research, training and lobbying   (Pearce 1992; Choy 1993; Hall 1994; Elliott 1997; \nKeller and Smeral 1997; Page 2003; Horner and Swarbrooke 2005; Middleton and Clarke \n2005). The FTB carries out most of these functions.   \n \nAccording to Middleton and Clarke (2005) NTO marketing is carried out at two levels: \ndestination promotion and market facilitation.  With promotion, NTOs aim to increase the \nawareness of consumers of the destination.  Middleton and Clarke suggest that when a certain \nlevel of awareness has been reached, it is complemented with market facilitation activities.  \nMarket facilitation means cooperation and coordination between various sectors of tourism \nand may include such activities as joint marketing campaigns, shared information and \nreservation systems, and sales promotion measures.  Destination promotion and market \nfacilitation activities as depicted by Middleton and Clarke provided a basis for the definition \nof NTO resources for the purpose of this study. \n 5 \nSMALL AND MEDIUM-SIZED ENTERPRISES (SME) IN THE TOURISM SECTOR \n \nAccording to a European Union (EU) recommendation (European Commission 2003),  SMEs \nare classified into three categories – micro, small and medium-sized enterprises – based on \nfour criteria.  Applicable to all are the number of employees, annual turnover, and total \nbalance sheet. The fourth criterion, independence, is applied only to small and medium-sized \ncategories.  The details of the criteria are outlined in Table 1. \n \n[Table 1] \n \nThe SME sector is regarded as fundamental to the competitive development and as the \nbackbone of the European economy (Mulhern 1995; European Commission 2000c; ENSR - \nEuropean Network for SME Research 2002). As stated by the European Commission,  “SMEs \nmake a significant contribution in terms of competitiveness, research, innovation, skills and \nemployment” (European Council 2000:84).  SMEs also play an important role in fostering \nvariety, self-fulfilment, and independence in society (Holmlund and Kock 1998) as well as \nessentially contributing to social and local integration (European Commission 2000c).   \nFurther, SMEs are claimed to contribute significantly to the productivity and growth of large \nenterprises, they increase competition, add to a diversity of enterprises, and adapt new \ntechnology and ideas developed in other enterprises (European Network for SME Research \n2004).   Because the tourism sector in Europe is dominated by SMEs (European Commission \n2006), inevitably each tourism destination represents an amalgam of the SMEs providing \ntourism products and services.  Finland is no exception in this. As a consequence, the \ndestination and their businesses are interrelated and the well-being of one depends upon the \naccomplishments of the others (Buhalis and Cooper 1999; Thomas and Augustyn 2007).  \n 6 \nSMEs are also claimed to be a key factor in the development of tourism destinations (Shaw \n2004). \n \n SMEs are argued to be well suited to tourism; but they also face a number of challenges. As \nfar as their suitability for tourism is concerned small business owners have personal contacts \nwith their customers and they are therefore able to respond rapidly to customer needs and \ndemands (Beaver, Lashley, and Stewart 1998).  They provide an interface and a contact \nbetween local culture and tourists and contribute thereby in communicating the particular \ncharacteristics of their destination (Middleton 1997; Shaw and Williams 2002). As SMEs are \nflexible due to their size, they are also able to provide customised products and services \n(Buhalis and Cooper 1999).  In addition, through SMEs, tourism expenditure reaches the local \neconomy rapidly (Buhalis and Cooper 1999).  Kozak and Rimmington (1998) maintain that \nsmall businesses have a great influence on how tourists perceive destinations as well as on the \ndestination image. \n \nTurning to the challenges, SMEs in tourism, including those in Finland, and like SMEs \nelsewhere,  face: a shortage of financial resources, lack of management and marketing skills, \nlack of industry expertise and strategic vision (Beaver, Lashley, and Stewart 1998; Boer 1998; \nDewhurst and Horobin 1998; Friel 1998; Shaw and Williams 1998; Wanhill 1998; Webster \n1998; Augustyn 2004; Thomas and Augustyn 2007). Also, like other SMEs there is debate \nabout their underlying motives. Whereas economic motives play an important role in the \nfoundation of firms in general, the motive behind establishing a new small business in tourism \nis often claimed to be non-economic (Szivas 2001; Shaw and Williams 2002; Thomas and \nAugustyn 2007) although elsewhere Shaw (2004) maintains that the majority of tourism \n 7 \nenterpreneurs are business-oriented.  Shaw and Williams (2004:101) suggest “that, in many \ncases, lifestyle motives are, to some extent, embedded within an economic agenda”. \n \nFor tourism SMEs the literature suggests that co-operation appears to be a vital option in their \nsurvival and possible growth.  Exchange of information, research as well as joint marketing \nfacilitate product development and expansion of markets beyond the local area (Buhalis and \nCooper 1999; Thomas and Augustyn 2007).  Buhalis and Cooper suggest that SME \ncooperation is needed at the destination level in order to increase the competitiveness of \nSMEs and their respective destinations as well as to facilitate higher customer satisfaction. \nAccording to Friel (1998),  cooperation allows small firms to enjoy many of the advantages of \nlarger businesses and sustain the advantages of being small.  Mikhailitchenko and Lundstrom \n(2006) maintain that transactions and linkages occurring between SMEs and organizations in \ntheir environment are considered as a tool, which small businesses use in order to cushion \nthem from environmental uncertainty and to improve their performance. All of these areas of \ncooperation point to a role for the NTO in supporting SMEs both to allow the SMEs to \nprosper as well as for the NTO to achieve its own objectives of creating a successful tourist \ndestination. \n 8 \nINTERORGANIZATIONAL RELATIONS (IOR) \n \nThe concept of Interorganizational Relations (IOR) is based on studies of organizational \nbehaviour (Gamm 1981; Selin and Beason 1991).  A number of theoretical paradigms have \nbeen developed to inquire into the relations between organizations.  Among them, resource \ndependence theory, transaction cost economics, strategic management theory, and networking \ntheory are the most commonly used (Wang and Xiang 2007).  \n \nBacharach and Lawler (1980) maintain that dependence (or interdependence) is an inherent \nfeature of social life.  Only parties operating in total isolation can stay independent.  There are \nvarious reasons for organizations to interact with each other, albeit acquisition of resources as \nwell as uncertainties in an organization’s environments are the chief motivators. These are \nalso grounds for SMEs to collaborate (Mikhailitchenko and Lundstrom 2006). Though \ninteracting with others means that an organization has to give up some of its authority, for an \norganization to survive, interaction is often inevitable (Schmidt and Kochan 1977; Whetten \n1981; Galaskiewicz 1985; Pfeffer and Salancik 2003).    \n \nResource dependence is a theory developed by academics since the 1960’s.  It is a form of \npower-dependence relations between organizations.  The term resource dependence in social \nsciences as discussed here is based on Emerson’s (1962) theory of power in social relations.  \nSocial relations involve reciprocal actions, where the power of one results from another’s \ndependence (Emerson 1962).  The emphasis on power in contrast to economic efficiency \ndifferentiates resource dependence from transaction-cost theory (Williamsson 1975). The \nterm “resource dependence” denotes interorganizational interactions and dependencies.   \nThe resource dependence concept regards the environment in which organizations act as \nbeing uncertain.  It also implies that decisions of organizations are constrained by their \n 9 \nenvironment.  Consequently, actors as well as factors outside an organization can – according \nto the resource dependence perspective – to some extent influence and control the decision-\nmaking in an organization (Pfeffer and Salancik 2003).  Responding to environmental and \nresource factors, organizations attempt to reduce uncertainty by minimising – or at least \nmanaging – their dependencies (Kleymann 2001). But this environment is also characterized \nby resource scarcity (Aldrich 1975; Kleymann 2001). Organizations lacking critical resources \nor wanting to have more possibilities to act must be prepared to give up some of their \nautonomy and independence towards procurement of resources (Ahrne 1994; Child and \nFaulkner 1998; Kleymann 2001; Pfeffer and Salancik 2003).  Such resources may either be \nmonetary, or physical, or they may consist of information, skills, knowledge, or social \nlegitimacy (White 1974; Pfeffer and Salancik 2003).  \n \nOver the years, empirical evidence supporting resource dependence theory has continued to \naccumulate.  The focus of research has mainly been on the effects of environment on \norganizations, on organizational efforts to manage environmental constraints, and how these \nconstraints affect internal organizational dynamics (Pfeffer and Salancik 2003).  Although, \naccording to Pfeffer and Salancik, the resource dependence logic has found wide acceptance, \nmore systematic empirical work – also quantitative - should be done (Pfeffer and Salancik \n2003).  They suggest that “Specifically, studies of strategic change might consider both the \nextent to which a given firm is dependent on various customers and the particular demands of \nthose customers…” (Pfeffer and Salancik, p xvii). The resource dependence theory explored \nin this study is primarily based on Pfeffer and Salancik’s (2003) developments of the theory \nas well as Saidel’s (1990) research on resource interdependence. \n 10 \nMETHODOLOGY \nAPPROACH AND ASSUMPTIONS \n \nThe importance of SMEs for tourism in Europe is clear. At least in terms of numbers they \ndominate the tourism sector.  They do, however, lack resources.  One of the potential \nproviders of resources is the NTO.  As a consequence of the resource exchange between \nNTOs and tourism SMEs, a resource dependence relationship may emerge. As suggested by \nresource dependence theory, the extent of dependence of one organization on another implies \nin turn the extent of power this organization has over the other.  Dependence of tourism SMEs \non NTO resources would therefore imply that the NTO might be in a position to influence \nSMEs.  The focus of this research is on this dependence relationship between tourism SMEs \nand the Finnish Tourist Board. \n \nBased on what is known about SMEs as well as on the basis of resource dependence theory, a \nnumber of assumptions regarding the possible dependence of tourism SMEs on NTO \nresources were made as follows: \n \n1) Enterprises are seldom, if ever, self-sufficient and they need to exchange resources in order \nto survive (Ahrne 1994).  As assumption was made that the fewer its resources the more an \nenterprise is likely to be dependent on others.  On this basis very small enterprises could be \nexpected to be very dependent, particularly so in tourism in relation to the NTO since publicly \nfunded NTOs may provide resources for the tourism sector at favourable conditions.  \nConsequently, these small enterprises could be expected to be more dependent on an NTO \nthan somewhat larger enterprises. \n \n 11 \n2) Start-up enterprises are particularly in need of adequate externally sourced resources.  \nNTOs are one possible external source.   On this basis it was assumed that the age of an SME \nwould affect the extent of resource dependence.  Start-ups and other enterprises which are not \nso well established were expected to have a greater dependence on NTO resources than those \nwhich have been operating for some time. \n \n3) SMEs intending to internationalize are often held back because of a lack of appropriate \nresources (Holmlund and Kock 1998).  The resources that an NTO provides can help tourism \nSMEs to overcome this obstacle hence there is likely to be a link between resource \ndependency and the extent of international activities.   \n \n4) Resource dependence theory suggests that a possible way of managing dependencies is to \nenact its environment (Pfeffer & Salancik, 2003).  Enacting means that by responding to \nenvironmental and resource factors organizations attempt to reduce uncertainty by minimizing \ntheir dependencies (Kleymann 2001). Strategic planning is one possible way of “enacting” the \nenvironment (Beaver, Lashley, and Stewart 1998; Margerison 1998; Webster 1998).  It was \nassumed that those SMEs which plan their operations would be more aware of the demands in \ntheir environment and would be able to respond to them better.  Therefore, they would be less \ndependent on external resources than SMEs which did not make plans. Consequently, \nplanning of operations could reduce also SMEs’ dependence on an NTO. \n \n5) Growing SMEs have a greater need for external resources than enterprises which do not \naim to grow (Augustyn 2004). Use of external resources may increase an SME’s dependence \non resource providers.  Therefore, enterprises’ plans for the future were expected to explain \ndifferences in the extent of resource dependence between enterprises. \n \n 12 \n6) Cooperation is not only considered to be an important factor in helping small enterprises \nachieve economies of scale and expand their business, but it is also believed to be important \nfor their mere survival.  SMEs might need to cooperate with other organisations in order to \ngain the resources they require.  According to Pfeffer and Salancik (1978) cooperation is a \nmeans for an organization to decrease its dependency on external resources. On the other \nhand, cooperation is said to lead to interdependence between partners (Akinobe and Clark \n1976; Himmelman 1996; Child and Faulkner 1998).  Resource dependence was thought to \nvary as a result of cooperation.  \n \n7) NTOs provide some resources that are unique. For example marketing the destination \n(country) as a whole is rarely carried out by other bodies. On the other hand some NTO \nresources, such as research data or training are available elsewhere. Against this background it \nwas assumed that SMEs would be most dependent on the NTO for those resources that it \nuniquely could provide. \n 13 \nMEASUREMENT AND SCALES \nOperational Definition of the Resource Dependence Concept \n \n \nIn order to render the resource dependence concept measurable, it needed to be operationally \ndefined. By operationally defining the resource dependence concept, its dimensions are \nidentified.  These are then converted into observable and measurable elements (Sekaran, \n2001).   \n  \nAccording to Pfeffer and Salancik (2003), resource dependence is a function of the \nimportance of a resource to an organization, of the availability of alternative resources, and of \nan organization’s ability to influence an external provider’s decisions regarding its resource \nallocation.   The dimensions of the resource dependence concept can hence be defined as \nimportance, alternatives, and influence. \n \nThe importance-dimension, consistent with Pfeffer and Salancik, is composed of two \nelements: the importance of a resource to an organization’s operation on the one hand, and the \nextent of resource exchange from an external organization on the other.  These elements can \nbe defined as perceived importance (later: importance) and magnitude of exchange (later: \nmagnitude). \n \nThe alternative-dimension can also be broken down into two elements: the organization’s \nknowledge about existing alternative resources (later: alternatives) and its access to \nalternatives (later: access). \n \n 14 \nOnly one element marks the influence-dimension. In order to measure this dimension, one has \nto find out how an organization can affect the provision of external resources. This element \ncan be defined as influence on the provision of the resource (later: influence).   \n \nFigure 1 illustrates the dimensions and their elements resulting from the operational \ndefinition of the resource dependence concept.  \n   \n[Figure 1] \n 15 \nDefinition of NTO resources \n \nIn order to build a resource dependence measure, resources made available by NTOs to \ntourism enterprises had to be identified.  Besides tangible, also intangible resources - like \ninformation, skills, and legitimacy - are exchanged between organisations (Pfeffer and \nSalancik 1978) \n \nMiddleton and Clarke (1998) suggest that typical tasks of an NTO include destination \npromotion and market facilitation.  Destination promotion includes advertising, public \nrelations, and production of promotional material.  Market facilitation includes flow of \nresearch data, representation abroad, organization of workshops, trade shows and \nfamiliarization trips, travel trade information, joint campaigns, information and reservations \nsystems, support for new products, marketing expertise for trade consortia, customer services, \nand general advisory services for the industry.  All of these can be defined as resources of \nNTOs.  They were employed as a framework to identify those resources which the Finnish \nTourist Board provides for the tourism industry. Two papers, the strategy (Finnish Tourist \nBoard 2003) and the marketing plan of the Finnish Tourist Board (2004) provided a source \nfor specifying these resources.  The 17 resources identified are given in Figure 2. \n[Figure 2] \n 16 \nResource dependence scale construction \n \n \n \nResource dependence, although a widely used concept, has not been frequently measured \nquantitatively.  Initial guidelines for the development of the research instrument were \nprovided by Saidel’s study (1990) on resource interdependence between state agencies and \nnon-profit organizations.  Saidel constructed three scales, measuring resource importance, the \navailability of alternatives, and the ability to compel the resource provision. Respondents \nindicated intensity of agreement or disagreement on six-point, Likert-type scales.  The \nconceptual anchors of each scale were independence and dependence. Scale items in Saidel’s \nstudy were predominantly attitudinal, some were behavioural.  Resource interdependence was \nthen calculated as an average of the total scale scores.  \n \nIn this study, resource dependence was defined to be a function of three dimensions which \nhave been further broken down into five elements: importance, magnitude, alternatives, \naccess, and influence. In order to combine these in a way that is commensurate, a five point \nLikert type measurement scale was used for each of the five elements. For four of these \nelements, importance, magnitude, alternatives, access, they were measured against all 17 of \nthe resources provided by the FTB.  The fifth element, influence, was measured against a \nsingle item. So for example, the importance measure shows the importance that respondents \nattached to the destination marketing, research data, reservations systems and other resources \nprovided by the FTB, as given in Figure 1. Similarly the alternative measure shows the extent \nto which respondents had knowledge about alternative sources, other than the FTB, for \nresources such as training or lobbying or other resources provided.  The actual wording of the \nstatements, for example, in relation to “Information about foreign markets” was: Importance:  \n“Information about foreign markets is vitally important for this enterprise.” Magnitude:  “This \nenterprise uses information provided by the FTB about foreign markets. Alternatives:  “There \n 17 \nare suppliers of information about foreign markets other than the FTB.”  Access:  “If needed, \nthis enterprise has access to information about foreign markets from different sources.”  \n \nFor the final measure, influence, the single item was designed to show the extent to which the \nrespondents felt able to influence the FTB’s decisions regarding the allocation of its \nresources. There were two reasons for confining this to a single item. First the influence of an \norganization upon others is often indirect and, therefore, cannot necessarily be measured for a \nsingle resource. Secondly, as noted from the pilot study, with 17 items the research instrument \nwas lengthy. Restricting one of the elements to a single question helped to shorten it without \nunduly reducing its effectiveness.  \n \nAt the data analysis stage the effects of the influence measure on the overall resource \ndependence created a problem in that the results showed that when the magnitude of resource \nexchange scored low – indicating low level of dependence - influence also scored low \nindicating a high level of dependence. At the extreme an enterprise in which no exchange \ntakes place would have no need to influence the resource providers and hence could answer \nthat they had no influence over the providers giving the impression of a high level of \ndependence. This is potentially misleading, and for this reason, influence was not included in \nthe overall scores for resource dependency. \n 18 \nMeasurement Scale \n \nThe five point Likert-type scale used to measure the dependent variables extended from 1 for \n“strongly disagree” with the statement to 5 “strongly agree”.   A combined resource \ndependence score of 1.00 would stand for total independence of SMEs on NTO resources.  \nConversely, a score of 5.00 would indicate total dependence.  Resource dependence was \ncalculated as an average of scale scores.  An additive model for the four elements was used to \narrive at the overall dependence. This had the advantage of being straightforward and is also \nsupported by the work of Pfeffer and Salancik , who argue that “Concentration of the control \nof discretion over resources and the importance of the resources to the organization together \ndetermine the focal organization’s dependence on any given other group or organization. \nDependence can then be defined as the product of the importance of a given input or output to \nthe organization and the extent to which it is controlled by a relatively few organizations” \n(2003:51).  For the scales used in this research and for the aggregate resource dependence \nscores, the following reliability coefficients (Cronbach’s Alpha) were computed: importance-\nscale 0.914, magnitude-scale 0.965, alternatives-scale 0.958, access-scale 0.946, and for the \naggregate (resource dependence) scale 0.952.  \n 19 \nSURVEY INSTRUMENTS \n \nAn online questionnaire was supplemented by a version sent by mail to those without email \naccess. The initial questionnaire was designed and refined in collaboration with several \nexecutives of Finnish tourism SMEs.  This procedure facilitated the use of appropriate \nlanguage and provided important comments on the length of the questionnaire.      \n \n 20 \nSAMPLING \n \n \nThe study population consisted of all the small and medium-sized tourism enterprises in \nFinland.  To obtain a representative sample, two different databases had to be used.  A \ndatabase for Finnish companies is maintained by Bluebook Finland.  But since this database \ndoes not include farms, a database of the Finnish Ministry for Agriculture of companies \noffering farm stays, was used to complement the sample.  The sampling frame included 7,845 \naddresses.  The samples from both databases were drawn by using a random sampling \ntechnique.  \n 21 \n \nDATA COLLECTION \n \nThe data were collected in Finland.  Two pilot tests were carried out.   For the pilot study as \nwell as for the final survey, for those enterprises in the sample that had submitted their e-mail \naddresses, an online questionnaire was offered.  Enterprises not having an e-mail address or \nnot having provided it received a mailed questionnaire with postage paid return envelope.   \nThe final survey was sent to 1,141 tourism SMEs, of which 80% received the survey by e-\nmail and 20% received a mailed questionnaire.  Some 173 e-mails and four mailed \nquestionnaires were undeliverable and therefore returned.  Two reminders were sent to the e-\nmail database, whereas the recipients of the mailed questionnaire were reminded once.  The \ntotal response was 238 giving a response rate of 25%. \n 22 \nDATA TREATMENT AND ANALYSIS \n \nThroughout the ongoing survey the data from the online-survey were saved in the Lotus Notes \ndatabase using SSM software.  The complete online survey data were then imported to SPSS \nsoftware.   The returned mailed questionnaires were numbered and the data were manually \nentered.  For the entire statistical analysis, SPSS 12.0.1 for Windows was used.  \nApart from the descriptive statistics used to measure the central tendency and the measures of \ndispersion, the main statistical tests used to analyze resource dependence were independent \nsample T-test and One-Way ANOVA.  Tests for multicollinearity did not detect high \ncorrelations between independent variables.   \n 23 \nFINDINGS \nSAMPLE CHARACTERISTICS \n \nOver 60% of the responses came from enterprises in various accommodation sectors.  Also \nspecialist holiday organizers were well represented in the sample, while incoming operators \ncontributed the smallest number. Some 67% of the businesses were located in rural areas and \n33 % in cities.  Farm stays, other accommodation and specialist holiday organizers were \nmainly located in rural areas, while enterprises from the transport, hotel, incoming operators, \nand other sectors were mainly based in cities. \n \nOver half of the responding enterprises had existed for more than ten years. The size of the \nresponding enterprises was defined by their turnover and by the number of their full-time \nemployees.  The majority (97%) of the respondents were small, while the remaining 3 % were \nmedium size enterprises. Some 82.5% were so called micro enterprises, i.e., they employed \nfewer than ten people.  Over one third of all the respondents were in organizations that \nemployed only one person. Most of these were from the farm stay sector. Medium size \nenterprises were from the transport and the hotel sector.  \n \nThe responding enterprises in this sample were only moderately international. In total, 88 % \nof the respondents had fewer than half of their guests from abroad.  Some 52 % of them had \nless than a 10 % share of foreign guests and 4 % of the respondents had only domestic guests. \nEnterprises in the transport and hotel sectors were the most internationally oriented.  The \nvisitor attraction sector proved to be the most domestically oriented.  \n \nOf the respondents some 25 % had a formal marketing plan while about 50 % planned their \nmarketing in an informal manner. One quarter of the responding companies did not plan \n 24 \nmarketing at all.  Those who planned their marketing most often did so one to two years in \nadvance (65.5%). Some 15.5 % planned their marketing short term (up to one year); another \n19 % planned long term (three to five years in advance). Nearly two thirds of all enterprises \n(63 %) had plans to grow in the future.   The great majority of the respondents cooperated \nwith other organisations (93.4%).  Only a small proportion of them did not (6.6 %).   \n 25 \nOVERALL RESOURCE DEPENDENCE \n \nThe mean value of the overall resource dependence of the respondents was 2.43 on a scale \nfrom one to five.  Adopting Saidel’s classification of dependence levels (Saidel 1990), the \noverall resource dependence of Finnish tourism SMEs on the FTB can be considered to be \nmoderate (between 2.40 and 3.60).  Resource dependence can also be defined in relative \nterms. A total of 100 % would stand for a complete dependence, while 0 % would signify a \ncomplete independence (Saidel 1990). On this basis the dependence of Finnish SMEs was \ncalculated at 36 %.   In one of the questions in the survey, respondents were asked to rate the \nimportance of the FTB for their business. Some 18.5 % of enterprises considered the FTB to \nbe at least somewhat important while more than 50% considered the FTB unimportant for \ntheir business.   This may suggest, that respondents are not quite aware of all of their \ndependencies. Interestingly when asked to rate the importance of the FTB for Finland as a \nwhole, the largest number, about 69% regarded the FTB as being important for Finland.   \n \n 26 \nDETAILED RESOURCE DEPENDENCE \n \nLevels of resource dependence by resource and by element are given in Table 2.  Turning to \nthe elements, on the importance dimension the most important resource by far is the NTO’s \nmarketing knowledge (4.14).  This is followed by other resources associated with markets and \nmarketing, consumer information and product development support, all scoring above 3.5.  \nThe lowest 2.44 is for contacts with the foreign media, presumably a reflexion of the \nrelatively low involvement in foreign tourism by many of the respondents.  The level of \nmagnitude of resource exchange at 1.99, on a scale from 1 to 5, is substantially lower than the \nscores for importance (3.29), alternatives (3.87) and access (3.70).  As far as individual \nresources are concerned (mean for all resources 2.43) Finnish tourism SMEs regarded \ndestination marketing (2.77) and marketing knowledge (2.66) as being clearly the most \nimportant. These were followed by information on domestic (2.58) and foreign (2.51) \nmarkets, research (2.51), product development support (2.49) joint domestic marketing (2.48) \nlobbying (2.48), joint foreign marketing (2.47) and distribution of consumer information \n(2.47).  The highest scores for the magnitude dimension were measured for destination \nmarketing (2.94), for information on domestic market (2.42), and for research (2.31).  Also, \ninformation on foreign markets (2.27) and marketing knowledge (2.25) scored higher than the \naverage on the magnitude scale. Of the FTB resources these are thus exchanged most \nfrequently by tourism SMEs.   Scores for knowledge about alternatives were high, ranging \nfrom 3.50 to 4.20.  The lowest scores and hence the least knowledge about alternatives \navailable were all related to foreign markets (joint foreign marketing, contacts with foreign \nmedia, information on foreign markets).  Regarding access to alternative resources these again \nscored relatively high notably for training (4.07), information on the domestic market (4.01), \ncontacts with domestic media (4.00), and joint domestic marketing (3.99).  Lobbying received \nthe lowest score in this regard (3.25).  Overall, the perceived ability of tourism SMEs to \n 27 \ninfluence the FTB’s resource decisions (not shown in Table 2) had the lowest overall score \n(1.69). \n \n [Table 2] \nLevels of resource dependence varied among SMEs.   Significantly the size of enterprises, the \nnumber of their international guests, their marketing planning procedures and their degree of \ncooperation with others affected the level of dependence on the FTB.  Age of SMEs and their \nfuture plans regarding growth did not affect the level of resource dependence.   \n \nAs the number of employees increases, the level of resource dependence increases as well.  \nWhereas enterprises with only one employee show an average resource dependence level of \n2.31, a level of 2.88 is computed for medium-sized enterprises.  The distribution of scores is \nshown in Table 3.  \n[Table 3] \n \nA significant difference between enterprises in different size categories was reported (F\n \n(3,219)=5.995, p=0.001).  A post-hoc test (Bonferroni) was conducted.  This showed that \nenterprises employing only one person showed significantly lower levels of resource \ndependence than enterprises with two to nine employees (p<0.05) or enterprises with over \nfifty employees (p<0.01).  A contrast test was carried out to compare the dependence between \nmicro enterprises and enterprises with 10 employees and more.  This test showed a significant \ndifference between these two groups (t=3.390, df=219, p=0.001).  \n \nThe number of international guests had an impact on the level of SMEs’ dependence on the \nFTB resources as well. Resource dependence levels were lowest among enterprises with no \n 28 \nforeign guests whereas enterprises with shares of 51% to 100% foreign guests showed the \nhighest levels of dependence.  Resource dependence score distribution between groups is \npresented in Table 4. \n[Table 4] \n \nThe difference in resource dependence scores between groups was statistically significant \n(F(4,217)=4.884, p=0.001).   The 17 resources provided by the FTB included in the resource \ndependence scale allowed a separate investigation of the dependence of SMEs on individual \nFTB resources. SMEs with a large number of foreign guests were most dependent on \nresources such as ‘joint foreign marketing’, ‘destination marketing’, and ‘information on \nforeign markets’, ‘contacts with foreign media’, and ‘representation overseas’.   \n \n \nSMEs which planned their marketing were more dependent on FTB resources than enterprises \nplanning their marketing informally or which were not making any plans at all.   An \nANOVA-test showed a significant difference between these groups (F(2,224)=8.433, p<0.001), \nwhile a post-hoc test (Bonferroni) showed significant effects between enterprises with a \nformal marketing plan and enterprises with an unwritten plan (p<0.05) as well as between \nenterprises with no marketing plan (p<0.01).   \n \nEnterprises which cooperate with at least one organization, consider the resources included in \nthe survey to be more important and they exchange more of them with the FTB than those not \ncooperating at all.  They also have better access to alternative resources.  Differences between \nthese three elements were statistically significant, although no statistical significance was \nfound regarding the fourth element, alternative resources.  A summary of the scores for \nresource dependence dimensions is presented in Table 5.  However, there was no difference in \n 29 \noverall resource dependence between those who cooperated and those who did not.   But \ndepending on with whom the tourism SMEs cooperate their level of dependence on the FTB \nresources varies. Cooperation with local and regional tourism organizations was associated \nwith increased dependence on certain FTB resources.    \n \n[Table 5] \n \nOverall, enterprises, regardless of their size, their sector, or of other demographic indicators, \nshowed very similar levels of knowledge of alternative resources as well as access to these \nresources.   \n 30 \nDISCUSSION \n \nTaken as a whole, the tourism SMEs in Finland are moderately dependent on the FTB \nresources.  Resource dependence varies, however, among different resources and among \ndifferent kinds of enterprises. Based on the literature, some propositions were made regarding \nthe dependence of tourism SMEs.   \n \nIt was assumed that very small enterprises would be more dependent on FTB resources than \nsomewhat larger SMEs.  This assumption was not supported by the results.  The larger an \nenterprise the higher was its dependence on FTB resources.  It was notable that the smallest \nSMEs, employing only one person, did not acutely need the resources currently provided by \nthe FTB.  They also used significantly fewer FTB resources than other enterprises.  Very \nsmall tourism enterprises are often established in order to ensure their owners a certain life-\nstyle, and not so much on entrepreneurial  grounds  (Szivas 2001) .  This might, at least partly, \nexplain the low level of perceived importance of resources as well as the low level of use of \nthese resources among the smallest tourism SMEs.  Put simply they may not be interested in \nany form of sophisticated marketing or market knowledge beyond placing small \nadvertisements and word of mouth publicity. On the other hand, somewhat larger enterprises \nmight be better aware of the importance of certain resources for their business.  They might \nalso be better informed about resources which the FTB provides for the tourism industry.  \nAlso, small businesses are less exposed to the volatility of demand in international markets \nwhich might make them less prone to work with the FTB.   \n \nGiven the specific resource needs of SMEs which want to internationalize, it was assumed \nthat enterprises with foreign customers would be more dependent on the FTB resources than \n 31 \nSMEs which rely on the domestic market.   This proposition was verified.   A larger number \nof foreign guests increased SMEs’ dependence on the FTB.   \n \nPlanning of operations was expected to decrease SMEs’ dependence on external resources. \nThe results of this research suggest that quite the contrary was the case; indeed, the more \nsophisticated the planning procedure of an SME, the higher was its dependence on the \nprovision of FTB resources. This might indicate that a strategic approach to planning possibly \nmakes SMEs more aware of the resources needed as well as where to obtain them from.  They \nmight also be more aware of the costs of alternative resources.  Given that they come from a \npublicly funded body the resources provided by an NTO might prove to be more cost-\neffective than other alternatives. \n \nIt was noted above that the overwhelming majority of SMEs cooperated with other \norganizations. It was notable that these found the resources specified in this research \nsignificantly more important than did those enterprises which did not cooperate.  This of \ncourse might have been a reason for them to cooperate in the first place.  Cooperating SMEs \nalso showed a significantly better access to alternative resources.   Although cooperating \nSMEs showed significantly higher scores regarding the importance dimension (importance \nand magnitude), which increases the level of their resource dependence, the scores were \nlevelled out by the higher scores in the alternative dimension (alternatives and access).  As a \nresult, no difference regarding the overall resource dependence level between cooperating and \nnon-cooperating SMEs was found.  This finding supports the claim that cooperation might \nhelp organizations decrease their level of resource dependence.   \n \nStart-up SMEs were expected to be more dependent on the FTB resources than already well \nestablished enterprises.  However, the age of tourism SMEs did not have a significant effect \n 32 \non the level of its resource dependence. Also, companies which intended to grow in the future \nwere not more dependent on the FTB resources than companies not planning to grow. \n \nSMEs showed high levels of availability of alternatives to the FTB resources. In other words \nthe resources provided by the FTB cannot be considered unique for the SME sector. This \nsuggests that the Finnish NTO might in fact be competing with other providers of similar \nresources.  Since the provision of FTB resources increasingly includes monetary \ncompensation for their use, even the question of FTB competing with commercial providers \nof similar resources might become more relevant in the future.  The provision of exclusive \nresources, that would complement other available resources, would surely secure the FTB \nmore influence on the tourism industry. \n \nIn many destinations, SMEs aiming to grow must expand by promoting and selling overseas. \nThis may be particularly important in Finland given its relatively small domestic market. If \nSMEs intend to achieve growth in international markets, they also need to become more \ninvolved in marketing their products internationally.  However, activities in international \nmarkets make heavy demands on resources – not only money, but access to information and \nknowledge as well. Lack of resources is one of the most crucial obstacles for SMEs hindering \nthem in their efforts to internationalise (Holmlund and Kock, 1998).  Thus, in order to grow \nand to expand their markets, they are dependent on outside support. The provision of \nactivities aimed at foreign markets is one possible way of supporting the internationalization \nof SMEs. Therefore, measures specifically designed to support the export of SME tourism \nservices could be provided.   Since growing and internationalizing enterprises are more prone \nto survive in the long term, it is in the interest of governments to assist and support them in \nthis regard hence there is an important role for the FTB here as suggested by the findings.   \n \n 33 \nThe highest overall dependence score was recorded for the destination marketing. In addition, \nthe SMEs considered the FTB in Finland as highly important for the country as a whole.  \nAlthough destination marketing was not considered unique as a resource by the SMEs - many \nalternatives available were reported - it is probably still a resource uniquely assigned to the \nFTB by the tourism industry.  This study suggests the destination marketing is one of the FTB \nresources that benefit the tourism SME sector in Finland. \n \nFor most tourism SMEs, the availability of alternative resources decreased their perceived \ndependence on the FTB resources significantly.  Especially enterprises which cooperated with \nothers were reported to have plenty of alternatives.  The range of alternative resources and the \ngood access to them imply that SMEs are able to use these resources and not only those \ncurrently provided by the FTB.   \n 34 \nCONCLUSION \n \nThis research was based on one country, Finland, and hence covered relations with only one \nNTO.  Clearly, a next step would be to attain comparable information from a larger number of \ncountries and a larger number of  NTOs and possibly using the same instruments.  This would \ngive a better understanding of similarities as well as differences relating to the tourism \nindustry in various geographical locations, economies, and stages of tourism development.  \nHowever, notwithstanding this obvious limitation the work here does provide the basis to \ndraw some key conclusions. \n \nIn general, Finnish tourism SMEs were found to be moderately dependent on the resources of \nthe national tourism organization.  However, mainly with increasing size, with increasing \nproportion of foreign guests, and with increasing sophistication of their marketing planning, \ndependence of enterprises on the FTB resources increased.  Apart from the assessment of the \nlevel of resource dependence, the framework developed brings forward some interesting \ninformation regarding resource importance and the alternative resources.   \n \nIn terms of overall dependence and in some of the details, the findings of this research do not \npoint to an absolutely crucial role for the FTB in providing support to SMEs, indeed some \nSMEs seem to be able to operate with scant involvement of the FTB. To this extent the power \nof the FTB is limited. On the other hand, the findings do provide sufficient evidence that the \nFTB, and in this case public funding, still has an important role for this tourist destination.  \nThis provides an important context for considering how an NTO might review its activities to \nprovide the most effective support, particularly during an era of likely reductions in public \nexpenditure. Clearly, marketing and especially international marketing as well as market \n 35 \ninformation are among the key activities, but the important thing is that the NTO focuses on \nthe things that it can uniquely provide if it is to give real value to the destination.  \n \nOne finding from this study that potentially provides an important pointer both to the work of \nthe NTO and to future research lies in the relationship between the degree of cooperation and \nresource dependency. In this context if, as seems to be the case, cooperation with regional and \nlocal tourism organizations is associated positively with dependence on the NTO there is \nscope here to expose potential overlaps in resource provision of local, regional, and national \norganizations and help them to increase their operational efficiency. \n \nAlthough SMEs outnumber large enterprises in tourism, research on them is still limited \n(Page et al 1999; Szivas 2001). Moreover, resource dependence as well as interdependencies \nbetween tourism organizations is a field that has not been much explored. This study has \nmade an effort to add to the existing body of knowledge on tourism SMEs by investigating \nthe understanding of the resource dependence of tourism SMEs on a National Tourism \nOrganization. \n   \nThis research has offered explanations for differences in the extent of resource dependence \nbetween tourism enterprises.  It has further looked into the types of resources on which \ntourism SMEs are dependent.  NTO provision of resources to the tourism industry can be \nregarded as an aspect of a tourism strategy implementation process.  It is therefore important \nfor policy makers to understand which of these resources, based on the needs of the industry, \nthe public sector should provide.   In order to target public support more effectively, more \nknowledge of the needs of SMEs is required.  This study has made an effort to contribute to \nthe existing body of knowledge in this regard. \n 36 \n \n \nThe resources of NTOs were the focal point of this enquiry.  The resource dependence of \nFinnish tourism SMEs on the national tourism organization of Finland was consequently \nmeasured based only on these resources.  Further research on the resource needs of tourism \nSMEs would help in identifying resources which are important for SMEs but which are not \neasily or not yet available for them. A qualitative study would help in determining such \nresources. This would assist in formulating more effective public policies supporting SMEs as \nwell as indicate to NTOs the possible resource needs of SMEs not yet satisfied by other \nproviders of resources.  But,  perhaps more important for this area of research and to provide \na basis for NTO strategies for SMEs more generally, as noted at the start of this section, is to \nextend the study to other countries and other NTOs. \n 37 \nREFERENCES \n \nAhrne, Göran (1994). Social Organizations: Interaction inside, outside and between \norganisations. London: SAGE Publications. \nAkinobe, I. Adelofu, and Robert C. Clark (1976). \"A Framework for Analyzing \nInterorganizational Relationships\". Human Relations 29 (2):101-114. \nAldrich, Howard. \"Resource Dependence and Interorganizational Relations\".(paper presented \nat IIM Conference Interorganizational Decision Making and Public Policy, Berlin, Germany, \nMay 18-20, 1975) \nAugustyn, Marcjanna M. (2004). \"Coping with Resource Scarcity: The Experience of U.K. \nTourism SMEs\". In Small Firms in Tourism: International Perspectives, edited by Rhodri \nThomas. Amsterdam: Elsevier, Pp257-275. \nBacharach, Samuel B., and Edward J. Lawler (1980). Power and Politics in Organization: \nThe Social Psychology of Conflict, Coalitions, and Bargaining. San Francisco: Jossey-Bass \nPublishers. \nBeaver, Graham, Conrad Lashley, and Jim Stewart (1998). \"Management Development\". In \nThe Management of Small Tourism and Hospitality Firms, edited by Rhodri Thomas. London: \nCassell, Pp156-173. \nBoer, Andrew (1998). \"An Assessment of Small Business Failure\". In The Management of \nSmall Tourism and Hospitality Firms, edited by Rhodri Thomas. London: Cassell, Pp39-57. \nBuhalis, Dimitrios, and Chris Cooper (1999). \"Competition or Co-operation?\" In Embracing \nand Managing Change in Tourism, edited by Eric Laws, Bill Faulkner and Gianna Moscardo. \nLondon: Routledge, Pp324-346. \nChild, John, and David Faulkner (1998). Strategies of Co-operation; Managing Alliances, \nNetworks, and Joint Ventures. Oxford: Oxford University Press. \n 38 \nChoy, Dexter J.L. (1993). \"Alternative roles of national tourism organizations\". Tourism \nManagement 14 (5):357-365. \nDewhurst, Peter, and Helen Horobin (1998). \"Small Business Owners\". In The Management \nof Small Tourism and Hospitality Firms, edited by Rhodri Thomas. London: Cassell, Pp19-\n38. \nElliott, James (1997). Tourism: politics and public sector management. London: Routledge. \nEmerson, Richard M. (1962). \"Power-Dependence Relations\". American Sociological Review \n27 (February):31-41. \nENSR - European Network for SME Research (2002).Observatory of European SMEs, 2002, \nNo.2 - SMEs in Europe, including a first glance at EU candidate countries. Luxembourg.  \nEuropean Commission (2000c).European Charter for Small Enterprises. Santa Maria de \nFeira.  \n________ (2003).Commission recommendation of 6 May 2003. 2003\/361\/EC \n________ (2006).A renewed EU Tourism Policy: Towards a stronger partnership for \nEuropean Tourism. Brussels. COM (2006) 134 final \nEuropean Council (2000).Council decision of 20 December 2000 on a multiannual \nprogramme for enterprise and entrepreneurship, and in particular for small and medium-\nsized enterprises (SMEs) (2001-2005). Brussels.  \nEuropean Network for SME Research (2004).SMEs in Europe. Luxembourg. No. 7 \nFinnish Tourist Board (2003). Strategia (Strategy), www.mek.fi\/Strategia.htm (retrieved \n11.11.2003) \n________ (2004).Markkinointisuunnitelma 2004 (Marketing Plan 2004). Helsinki.  \nFriel, Martin (1998). \"Marketing\". In The Management of Small Tourism and Hospitality \nFirms, edited by Rhodri Thomas. London: Cassell, Pp117-137. \nGalaskiewicz, Joseph (1985). \"Interorganizational Relations\". Annual Review of Sociology \nVol.11:281-304. \n 39 \nGamm, Larry (1981). \"An Introduction to Research in Interorganizational Relations (IOR)\". \nJournal of Voluntary Research Vol.10 (1):18-52. \nGee, Chuck Y, James C Makens, and Dexter J.L Choy (1997). The Travel Industry. 3rd ed. \nNew York: von Nostrand Reinhold. \nHall, Colin M. (1994). Tourism and Politics. Chichester: John Wiley & Sons. \nHimmelman, A.T. (1996). \" On the theory and practice of transformational collaboration: \nfrom social service to social justice\". In Creating Collaborative Advantage, edited by C. \nHuxham. London: Sage Publications, Pp19-43. \nHolmlund, Maria, and Soren Kock (1998). \"Relationships and the Internrnationalisation of \nFinnish Small and Medium-sized Companies\". International Small Business Journal Vol. 16 \n(4):46-63. \nHorner, Susan, and John Swarbrooke (2005). Leisure Marketing - A Global Perspective. \nOxford: Elsevier Butterworth-Heinemann. \nKeller, Peter, and Egon Smeral. \"Increased International Competition: New Challenges for \nTourism Policies in European Countries\".(paper presented at WTO\/CEU-ETC Joint Seminar, \nSalzburg, Austria, April 9-10, 1997) \nKleymann, B. (2001). \"A Resource Dependence Perspective on Multilateral Alliances: The \nCase of the Airline Industry\". Helsinki: Helsinki School of Economics and Business \nAdministration. \nKozak, Metin, and Mike Rimmington (1998). \"Benchmarking: destination attractiveness and \nsmall hospitality business performance\". International Journal of Contemporary Hospitality \nManagement 10 (5):184-188. \nMargerison, John (1998). \"Business Planning\". In The Management of Small Tourism and \nHospitality Firms, edited by Rhodri Thomas. London: Cassell, Pp101-116. \nMiddleton, Victor (1997). \"Fouling the Nest? Environmental Impact of Small Businesses\". \nInsights 9:D13-D19. \n 40 \n________ (1998). \"Agenda 2010: SMEs in European Tourism: The Context and a Proposed \nFramework for European Action\". The Tourist Review 4:29-37. \nMiddleton, Victor, and Jackie Clarke (2005). Marketing in Travel and Tourism. Oxford: \nElsevier Butterworth-Heinemann. \nMikhailitchenko, Andrei, and William J. Lundstrom (2006). \"Inter-organizational relationship \nstrategies and management styles in SMEs\". Leadership & Organization Development \nJournal 27 (6):428-448. \nMulhern, Alan (1995). \"The SME Sector in Europe: A Broad Perspective\". Journal of Small \nBusiness Management (July):83-87. \nPage, Stephen J. (2003). Tourism Management - Managing for change. Oxford: Butterworth-\nHeinemann. \nPearce, Douglas G (1992). Tourist Organizations. Harlow: Longman Group UK. \nPeattie, Ken, and Luiz Moutinho (2000). \"The Marketing Environment for Travel and \nTourism\". In Strategic Management in Tourism, edited by Luiz Moutinho. Wallingford: \nCABI Publishing, Pp17-38. \nPeltonen, Arvo, Raija Komppula, and Hannu Ryhänen (2004). \"Overview of SMEs in \nTourism, Finland\". In SMEs in Tourism. An International Overview, edited by Alison \nMorrison and Rhodri Thomas. Arnhem: Atlas, Pp25-33. \nPfeffer, Jeffrey, and Gerald R. Salancik (1978). The External Control of Organizations: A \nResource Dependence Perspective. New York: Harper & Row Publishers. \n________ (2003). The External Control of Organizations: A Resource Dependence \nPerspective, Stanford Business Classics. Standford: Standford University Press. \nSaidel, Judith R. (1990). \"Resource Interdependence: The Relationship Between State \nAgencies and Nonprofit Organizations\". PhD thesis, Rockefeller College of Public Affairs \nand Policy, Department of Public Administration and Policy, University of Albany, Albany. \n 41 \nSchmidt, Stuart M., and Thomas Kochan (1977). \"Interorganisational Relationships: Patterns \nand Motivations\". Administrative Science Quarterly 22:220-234. \nSelin, Steven, and Kim Beason (1991). \"Interorganizational Relations in Tourism\". Annals of \nTourism Research 18 (4):639-652. \nShaw, Gareth (2004). \"Entrepreneurial Cultures and Small Business Enterprises in Tourism\". \nIn A Companion to Tourism, edited by Alan A Lew, C. Michael Hall and Allan M Williams. \nOxford: Blackwell Publishing, Pp122-133. \nShaw, Gareth, and Allan M Williams (2002). Critical Issues in Tourism: a geographical \nperspective. 2nd ed. Oxford: Blackwell Publishers  \n________ (2004). \"From Lifestyle Consumption to Lifestyle Production: Changing Patterns \nof Tourism Entrepreneurship\". In Small Firms in Tourism: International Perspectives, edited \nby Rhodri Thomas. Amsterdam: Elsevier, Pp99-113. \nShaw, Gareth, and Allan M. Williams (1998). \"Entrepreneurship, Small Business Culture and \nTourism Development\". In The Economic Geography of the Tourist Industry. A Supply-side \nAnalysis, edited by D. Ioannides and K.G. Debbage. London: Routledge, Pp235-255. \nSmall Business Institute (2000).Pk-yritykset kansantaloudessa (SMEs in the national \neconomy). Helsinki. 3\/2000 \nSzivas, Edith (2001). \"Entrance into tourism entrepreneurship: A UK case study\". Tourism \nand Hospitality Research 3 (2):163-172. \nThomas, Rhodri, and Marcjanna M. Augustyn (2007). \"Small Firms in the New Europe: Key \nIssues, Conclusions and Recommendations\". In Tourism in the New Europe, edited by \nMarcjanna M. Augustyn and Rhodri Thomas. Oxford: Elsevier, Pp227-236. \nWang, Youcheng, and Zheng Xiang (2007). \"Toward a Theoretical Framework of \nCollaborative Destination Marketing\". Journal of Travel Research 46:75-85. \n 42 \nWanhill, Stephen (1998). \"Government Organisations\". In Tourism – Principles and Practice, \nedited by Cooper Chris, John Fletcher, David Gilbert, Rebecca Shepherd and Stephen \nWanhill. Harlow: Pearson Education Limited, Pp225-246. \nWebster, Michele (1998). \"Strategies for Growth\". In The Management of Small Tourism and \nHospitality Firms, edited by Rhodri Thomas. London: Cassell, Pp207-216. \nWhetten, David (1981). \"Interorganizational Relations: A Review of the Field\". Journal of \nHigher Education 52 (1):1-28. \nWhite, Paul E. (1974). \"Resources as Determinants of Organizational Behavior\". \nAdministrative Science Quarterly 19::366-379. \nWilliamsson, O.E. (1975). Markets and Hierarchies. New York: Free Press. \n \n 43 \n \nTABLE 1 \nDEFINITION OF SMALL AND MEDIUM-SIZED ENTERPRISE (SME) \n(European Community Recommendation 2003) \n \nCRITERIA \nMICRO-\nENTERPRISE \nSMALL \nENTERPRISE \nMEDIUM-SIZED \nENTERPRISE \nNumber of \nEmployees \n<10 <50 <250 \nAnnual Turnover \n \nor \n \nTotal Balance \nSheet \n<EUR 2 million  \n \n<EUR 2 million \n <EUR 10 million  \n \n<EUR 10 million \n <EUR 50 million  \n \n<EUR 43 million \nIndependence  \n \nNo more than 25% of the capital or voting \nrights held by one or more enterprises \nwhich are not themselves SMEs \n \n \n \n 44 \n \n \n \n \nFigure 1 Operational definition of the resource dependence concept\n \nResource \nDependence \n \n \nImportance \n \n \nAlternatives \n \n \nInfluence \n \nPerceived \nImportance \n(Importance) \nMagnitude  \nof \nExchange \n(Magnitude) \nKnowledge \nof \nAlternatives \n(Alternatives) \n \nAccess to \nAlternatives \n(Access) \nInfluence on the \nProvision of the \nResource \n(Influence) \n 45 \n \n\u0001 Destination marketing \n\u0001 Research data \n\u0001 Representation overseas \n\u0001 Contacts with the travel trade \n\u0001 Contacts with foreign media \n\u0001 Contacts with domestic media \n\u0001 Joint domestic marketing \n\u0001 Joint foreign marketing \n\u0001 Consumer information \n\u0001 Reservation systems \n \n \n \n\u0001 Support for tourism product \ndevelopment \n\u0001 Marketing knowledge \n\u0001 Information about domestic markets \n\u0001 Information about foreign markets \n\u0001 Information for the travel trade \n\u0001 Training \n\u0001 Lobbying \n \nFigure 2 Resources provided by an NTO (based on Middleton and Clarke, 2005) \n 46 \nTABLE 2 \nDEPENDENCE SCALE ITEM SCORES AND \nTHE TOTAL DEPENDENCE SCORE FOR INDIVIDUAL RESOURCES \nImportance Magnitude Alternatives Access \n \nResource \nDependence \n \n \nDIMENSION\/ \nResource \nMean SD Mean SD Mean SD Mean SD Mean SD \nInformation on domestic \nmarket \n3.74 0.974 2.42 1.175 3.86 0.911 4.01 0.925 2.58 0.515 \nInformation on foreign \nmarkets \n3.03 1.175 2.27 1.228 3.62 0.998 3.68 1.048 2.51 0.625 \nMarketing knowledge 4.14 0.976 2.25 1.200 3.94 0.901 3.90 0.969 2.66 0.528 \nProduct development \nsupport \n3.52 1.074 1.92 1.066 3.95 0.904 3.58 1.209 2.49 0.555 \nResearch 3.13 0.992 2.31 1.246 3.79 0.908 3.61 1.107 2.51 0.561 \nDestination marketing 3.55 1.177 2.94 1.346 3.90 0.916 3.54 1.101 2.77 0.653 \nJoint domestic marketing 3.62 1.158 1.97 1.185 3.77 0.908 3.99 1.078 2.48 0.598 \nJoint foreign marketing 2.92 1.268 1.96 1.284 3.50 0.930 3.53 1.217 2.47 0.686 \nReservation systems 3.10 1.357 1.70 1.106 3.98 0.908 3.58 1.188 2.33 0.605 \nConsumer information 3.77 1.165 1.77 1.105 3.93 0.917 3.81 1.071 2.47 0.572 \nTravel trade information 3.49 1.195 1.69 1.031 3.99 0.895 3.73 0.953 2.38 0.551 \nContacts with travel trade 3.02 1.172 1.93 1.240 3.98 0.903 3.78 1.095 2.30 0.602 \nContacts, domestic media 3.18 1.178 1.69 0.991 3.97 0.875 4.00 0.946 2.23 0.535 \nContacts, foreign media 2.44 1.141 1.73 1.112 3.61 1.025 3.41 1.138 2.28 0.604 \nTraining 3.39 1.127 1.63 0.920 4.20 0.886 4.07 0.991 2.20 0.552 \nRepresentation overseas 2.62 1.223 1.74 1.167 3.81 1.010 3.43 1.179 2.27 0.631 \nLobbying 3.24 1.195 1.76 1.059 3.85 0.960 3.25 1.214 2.48 0.576 \nTotal 3.29 0.751 1.99 0.931 3.87 0.706 3.70 0.799 2.43 0.436 \n 47 \nTABLE 3 \nSCORES OF RESOURCE DEPENDENCE ELEMENTS BY EMPLOYEES \n \n \nEmployees \n  \nImportance Magnitude Alter-\nnatives Access \n \nResource \nDependence \nMean 3.15 1.61 3.87 3.67 2.31 \nMedian 3.06 1.44 3.88 3.71 2.25 \n1 person \n(n=81) \nSD .733 .592 .644 .769 .401 \nMean 3.24 2.03 3.80 3.60 2.47 \nMedian 3.29 1.88 3.82 3.53 2.54 \n2 - 9 \npeople \n(n=103) \nSD .735 .878 .749 .750 .403 \nMean 3.69 2.49 3.99 4.12 2.53 \nMedian 3.68 2.15 4.00 4.27 2.56 \n10 -49 \npeople \n(n=32) \nSD .607 1.207 .758 .738 .515 \nMean 4.06 3.57 4.06 4.04 2.88 \nMedian 4.12 3.59 4.24 4.38 2.75 \n50 - 249 \npeople \n(n=7) \nSD .304 .750 .681 .768 .433 \n \n 48 \n \nTABLE 4 \n \nRESOURCE DEPENDENCE SCORES BY THE NUMBER OF FOREIGN GUESTS \n \n \nForeign Guests      Resource  \nDependence \nScore \n \nNo foreign guests \n(n=9) \n2.23 \n \n1 – 10% \n(n=118) \n2.35 \n \n11 – 25% \n(n=57) \n2.58 \n \n26 – 50% \n(n=25) \n2.43 \n \n51 – 100% \n(n=17) \n2.64 \n 49 \nTABLE 5 \n \nSCORES OF RESOURCE DEPENDENCE ELEMENTS BY COOPERATION \n \n \nCOOPERATION \n  \nIMPORT-\nANCE \nMAGNI-\nTUDE \nALTER-\nNATIVES ACCESS \nMean 2.60 1.42 3.57 2.94 \nMedian 2.59 1.12 3.58 3.00 \n \nNo \n(n=15)  \n  \nSD .888 .550 1.038 1.001 \nMean 3.34 2.03 3.89 3.75 \nMedian 3.35 1.81 3.88 3.76 \n \nYes \n(n=212)  \nSD .718 .940 .677 .756 \n \n"}