{"doi":"10.1016\/j.geomorph.2006.12.032","coreId":"65853","oai":"oai:dro.dur.ac.uk.OAI2:4444","identifiers":["oai:dro.dur.ac.uk.OAI2:4444","10.1016\/j.geomorph.2006.12.032"],"title":"Climatically controlled river terrace staircases : a worldwide quaternary phenomenon.","authors":["Bridgland, D. R.","Westaway, R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-05-24","abstract":"A comparison of fluvial terrace sequences from around the world, based on data collected as part of International Geoscience Programme (IGCP) Project No. 449, has revealed significant patterns. River terraces provide important records of uplift, which is essential for their formation, and of landscape evolution. Their cyclic formation, however, almost invariably seems to have been a response to climatic fluctuation. Sequences in the European core area of\\ud\nIGCP 449, which has the longest and most extensive research history, have been used as templates for worldwide comparison. There is evidence for a global acceleration of uplift at the time of, and perhaps in response to, the Mid-Pleistocene Revolution, when climatic fluctuation switched to 100 ky Milankovitch cycles. Terraces formed prior to this generally consist of wide aggradational sheets that probably each represent formation over several 41\\ud\nky cycles. Subsequently, river valleys became more steeply entrenched and terraces formed in response to the stronger 100 ky climatic forcing, in many cases at approximately one per cycle. This paper uses the new data resource to explore differences between records in different climate zones, between sequences with variable numbers of Middle-Late Pleistocene terraces and between systems in which the all-important incision event has occurred in different parts of climatic cycles. Key records discussed include European examples from the Rhine, Thames, Somme, Dniester, Dnieper, Don, Volga and Aguas; from Asia the Gediz (Turkey) and Orontes (Syria); from North America, the South Platte and Colorado; from South Africa the Vaal and Sundays; from Australia the Shoalhaven; and from South America, the Amazon, Paraguay and tributaries of the Colorado and Negro","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65853.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4444\/1\/48304.pdf","pdfHashValue":"06f5fd08fbd040011f76f5b035c7ecb6c5d3b053","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4444<\/identifier><datestamp>\n      2010-10-20T14:13:33Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Climatically controlled river terrace staircases : a worldwide quaternary phenomenon.<\/dc:title><dc:creator>\n        Bridgland, D. R.<\/dc:creator><dc:creator>\n        Westaway, R.<\/dc:creator><dc:description>\n        A comparison of fluvial terrace sequences from around the world, based on data collected as part of International Geoscience Programme (IGCP) Project No. 449, has revealed significant patterns. River terraces provide important records of uplift, which is essential for their formation, and of landscape evolution. Their cyclic formation, however, almost invariably seems to have been a response to climatic fluctuation. Sequences in the European core area of\\ud\nIGCP 449, which has the longest and most extensive research history, have been used as templates for worldwide comparison. There is evidence for a global acceleration of uplift at the time of, and perhaps in response to, the Mid-Pleistocene Revolution, when climatic fluctuation switched to 100 ky Milankovitch cycles. Terraces formed prior to this generally consist of wide aggradational sheets that probably each represent formation over several 41\\ud\nky cycles. Subsequently, river valleys became more steeply entrenched and terraces formed in response to the stronger 100 ky climatic forcing, in many cases at approximately one per cycle. This paper uses the new data resource to explore differences between records in different climate zones, between sequences with variable numbers of Middle-Late Pleistocene terraces and between systems in which the all-important incision event has occurred in different parts of climatic cycles. Key records discussed include European examples from the Rhine, Thames, Somme, Dniester, Dnieper, Don, Volga and Aguas; from Asia the Gediz (Turkey) and Orontes (Syria); from North America, the South Platte and Colorado; from South Africa the Vaal and Sundays; from Australia the Shoalhaven; and from South America, the Amazon, Paraguay and tributaries of the Colorado and Negro.<\/dc:description><dc:subject>\n        River terrace<\/dc:subject><dc:subject>\n         Climatic fluctuation<\/dc:subject><dc:subject>\n         Uplift<\/dc:subject><dc:subject>\n         Fluvial incision<\/dc:subject><dc:subject>\n         Climatic geomorphology<\/dc:subject><dc:subject>\n         Crustal provinces.<\/dc:subject><dc:publisher>\n        Elsevier<\/dc:publisher><dc:source>\n        Geomorphology, 2007, Vol.98(3-4), pp.285-315  [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-05-24<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4444<\/dc:identifier><dc:identifier>\n        issn:0169-555X<\/dc:identifier><dc:identifier>\n        doi:10.1016\/j.geomorph.2006.12.032<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4444\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1016\/j.geomorph.2006.12.032<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4444\/1\/48304.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0169-555X","0169-555x"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["River terrace","Climatic fluctuation","Uplift","Fluvial incision","Climatic geomorphology","Crustal provinces."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n18 March 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBridgland, D. R. and Westaway, R. (2007) ’Climatically controlled river terrace staircases : a worldwide\nquaternary phenomenon.’, Geomorphology., 98 (3-4). 285-315 .\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1016\/j.geomorph.2006.12.032\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nPage 1; Bridgland & Westaway; 18\/03\/2008 \nClimatically controlled river terrace staircases: a worldwide Quaternary \nphenomenon  \nDavid Bridgland 1 & Rob Westaway2 \n1 - Department of Geography, Durham University,  \nSouth Road, Durham DH1 3LE, UK; d.r.bridgland@dur.ac.uk \n2 - Faculty of Mathematics and Computing, The Open University, Eldon House, Gosforth, \nNewcastle-upon-Tyne NE3 3PW, UK; also at: School of Civil Engineering and Geosciences, \nNewcastle University, Newcastle-upon-Tyne NE1 7RU, UK; r.w.c.westaway@ncl.ac.uk \nAbstract \nA comparison of fluvial terrace sequences from around the world, based on data collected as \npart of International Geoscience Programme (IGCP) Project No. 449, has revealed significant \npatterns.  River terraces provide important records of uplift, which is essential for their \nformation, and of landscape evolution.  Their cyclic formation, however, almost invariably \nseems to have been a response to climatic fluctuation.  Sequences in the European core area of \nIGCP 449, which has the longest and most extensive research history, have been used as \ntemplates for worldwide comparison.  There is evidence for a global acceleration of uplift at \nthe time of, and perhaps in response to, the Mid-Pleistocene Revolution, when climatic \nfluctuation switched to 100 ky Milankovitch cycles.  Terraces formed prior to this generally \nconsist of wide aggradational sheets that probably each represent formation over several 41 \nky cycles.  Subsequently, river valleys became more steeply entrenched and terraces formed \nin response to the stronger 100 ky climatic forcing, in many cases at approximately one per \ncycle.  This paper uses the new data resource to explore differences between records in \ndifferent climate zones, between sequences with variable numbers of Middle-Late Pleistocene \nterraces and between systems in which the all-important incision event has occurred in \ndifferent parts of climatic cycles.  Key records discussed include European examples from the \nRhine, Thames, Somme, Dniester, Dnieper, Don, Volga and Aguas; from Asia the Gediz \n(Turkey) and Orontes (Syria); from North America, the South Platte and Colorado; from \nSouth Africa the Vaal and Sundays; from Australia the Shoalhaven; and from South America, \nthe Amazon, Paraguay and tributaries of the Colorado and Negro.  \nKeywords: river terrace, climatic fluctuation, uplift, fluvial incision, climatic geomorphology, \ncrustal provinces \n \nPage 2; Bridgland & Westaway; 18\/03\/2008 \n1. Introduction \nThis paper arises directly from the activities of International Geoscience Programme (IGCP) \nProject No. 449 (Global Correlation of Late Cenozoic Fluvial Deposits), which has compiled \ndata on fluvial sedimentary records worldwide, enabling patterns and variations to be \nobserved in the resultant databank.  Fluvial sedimentary records can be divided into two main \ntypes, on the basis of preservation style: (1) stacks of deposits in superposition, although \ninvariably with numerous hiatuses, and (2) terraced sequences, where the more important \nhiatuses have coincided with incision below the base level of the pre-existing deposits, into \nbedrock.  This paper concerns the second of these types and will show, first, that they occur \nworldwide; second, that they have formed in response to climatic fluctuation; and third, that \nuplift is an essential requirement, with differences in uplift histories causing variations in \nterrace records between different areas and, in particular, different crustal provinces.   \nThe staircases of aggradational river terraces that constitute this second type of record \nsometimes show wide separation, such that the fluvial deposits of each terrace level never \ncome into contact with others in the terrace staircase.  Alternatively, separation can be much \nless, such that in vertical extent each set of deposits overlaps those of the terraces immediately \nabove and below within the staircase.  Variations in degree of terrace separation and, indeed, \nbetween terraced and stacked sequences, can occur within a single fluvial system, either \nupstream - downstream (e.g. the Rhine sequence; Fig. 1) or in terms of variation through time \n(e.g. the Dniester, Dnieper and Don sequences; Fig. 2).   The large dataset now assembled as a \nresult of IGCP 449 allows such patterns to be investigated and evaluated, providing insights \ninto their possible implications for understanding crustal and landscape evolution, key topics \nfor follow-up project IGCP 518 (Fluvial sequences as evidence for landscape and climatic \nevolution in the Late Cenozoic).   \nPage 3; Bridgland & Westaway; 18\/03\/2008 \nFig. 1 \n \nRiver terrace formation in areas remote from lithospheric plate boundaries has often been \nattributed to base-level fluctuation, driven by the rising and falling of global sea level in \nresponse to Quaternary climatic fluctuation (McCave, 1969; Törnqvist, 1998; Karner and \nMarra, 1998; Blum and Straffin, 2001), with aggradation thought to have occurred when the \nlower reaches of rivers were inundated by interglacial marine transgressions and incision at \ntimes of falling sea-level.  The role of that same climatic fluctuation in triggering the different \nfluvial activities seen in terrace records, particularly alternations between incision and \nsedimentation, has long been recognized (e.g. Zeuner, 1945; Wymer, 1968; Bourdier, 1968, \n1974; Antoine, 1994; Bridgland, 1994, 2000) and has been implicated as the driving force \nbehind terrace generation in areas remote from coastlines, where sea-level fluctuation seems \nunlikely to be influential (e.g., Tyráček, 1983; Bull and Kneupfer, 1987; Green and \nMcGregor, 1987; Bull, 1991; Starkel, 2003).  This mechanism fits well with the empirical \nPage 4; Bridgland & Westaway; 18\/03\/2008 \nevidence from fluvial sequences, even those nearer to coasts, which shows that much of the \naggradation, especially of gravel, has taken place under cold-climate conditions (e.g. Rose \nand Allen, 1977; Green and McGregor, 1980; Gibbard, 1985; Vandenberghe, 1995), at times \nwhen base levels were low and rivers should, according to the ‘received wisdom’ of the base-\nlevel paradigm, have been incising into their valley floors. \nFig. 2 \n \nThere is now a consensus that long-timescale terrace staircases are responses to, and therefore \nrecords of, regional uplift (e.g. Maddy, 1997; Antoine et al., 2000; Bridgland, 2000; van den \nBerg and van Hoof, 2001; Westaway et al., 2002, 2006a; cf. Kiden and Tornqvist, 1998).  \nKey to this line of thinking is that subsidence gives rise to stacked sequences, that uplift gives \nrise to terrace staircases and that without vertical movement of the crust rivers continue to \nflow at more or less the same relative level.  Recently areas of highly stable crust have been \nPage 5; Bridgland & Westaway; 18\/03\/2008 \nrecognized in which exactly this last type of activity, or relative inactivity, has prevailed: \nArchaean cratons (Westaway et al., 2003; Fig. 3).  Such areas include parts of peninsular \nIndia and southern Africa (Helgren, 1977, 1978; Mishra 1995; Westaway et al., 2003; Fig. 3).  \nThis is not negative evidence; these areas have ancient fluvial deposits at or near to valley-\nfloor level, rather than tens of metres higher (contrast Fig. 3 with Fig. 2b).  The explanation \nfavoured by Westaway et al (2003) is that these cratonic areas have not experienced the \ntypical uplift that has raised surface levels in areas of younger crust and that this is because \nArchaean cratonic crust lacks the mobile lower crustal layer thought to be present in other, \nyounger, continental crust.  This is a result of its low radiogenic heat production and relatively \nthick (up to ~400 km) underlying lithosphere.  Younger continental crust typically reaches \n>350 °C at depth, the temperature threshold above which plastic flow can occur.  In contrast, \nArchaean cratonic crust is thought to be brittle throughout, preventing lower crustal flow.  \nCrustal loading and unloading, resulting indirectly from Quaternary climatic forcing (e.g. ice \nsheet formation and melting; fluctuating sea-level; erosion and sedimentation) is thought to \ninduce flow of lower crustal material from beneath areas that are subsiding to beneath areas \nthat are uplifting (cf. Westaway, 2001, 2002a,b).  If crustal stability is indeed the explanation \nfor such records as depicted in Figure 3, it is clear that areas with extensive terrace staircases \ncannot have been stable, as was long supposed (cf. Westaway et al., 2002).  A complicating \nfactor is that many cratonic regions lie within the tropical zone, where differences in \ngeomorphological processes might also be anticipated (Büdel, 1977, 1982; see below). \nPage 6; Bridgland & Westaway; 18\/03\/2008 \nFig. 3 \n \nPage 7; Bridgland & Westaway; 18\/03\/2008 \nSeveral modern researchers have identified Late Cenozoic uplift in many areas of Europe but \nhave generally attributed it to plate tectonic activity, particularly as a consequence of \ncompressive plate boundary forces causing ‘buckling’ of the continental lithosphere that can \nextend, in series of upward and downward 'ripples', for considerable distances (e.g., Nikishin \net al., 1997; Cloetingh et al., 2005). This interpretation envisages the uplift of various parts of \nnorth-west Europe, as evidenced by river terraces, as a distant response to the collision \nbetween the African and Eurasian plates.  It requires this entire area to be in compression, \nthus conflicting with evidence, such as normal faulting, that shows much of it to be in \nextension.  It cannot explain uplift in continental areas that are unrelated to compressive plate \nboundaries, so the discovery of comparable terrace staircases in such areas would pose a \nsignificant problem for the theory (see below). \nIf it is accepted that surface uplift has been influential in producing the terrace sequences in \nareas of post-Archaean crust, the IGCP 449 dataset can then be explored to see whether \ndifferent styles of terrace preservation can perhaps be related to rates and styles of uplift.  A \nlong-standing observation, of importance in understanding landscape evolution, is of \nimmediate relevance here.  It is well established that pre-Middle Pleistocene fluvial terraces \nare characterized by wide expanses of sediment that record significantly greater valley-floor \nwidths than are seen today, whereas terraces formed in the last million years or so record \nsteeper incision and the narrowing of valleys (e.g. Kukla, 1978; Maddy et al., 2000; Fig. 1b).  \nThis pattern has been attributed to accelerated uplift starting at ~900 ka (Kukla, 1975, 1977, \n1978; Meyer and Stets, 1998; Westaway, 2002a).  A similar pattern can now been recognized \nin areas of post-Archaean crust in every continent except Antarctica (cf. Westaway et al., \n2003).  The closeness in the timing of this change in uplift rates to the so-called ‘Mid-\nPleistocene Revolution’, when Milankovitch forcing of climatic cyclicity changed from \npredominantly 41 ky, obliquity-driven cycles to 100 ky eccentricity-driven cycles, is unlikely \nto be coincidental; instead a coupling between climatic fluctuation and the driving of uplift \nthrough lower crustal flow has been invoked, related to increased erosion brought about by \nthe greater severity of the 100 ky climatic cycles predominant since ~1 Ma (Westaway, \n2002a).  Being linked to crustal loading and unloading by ice sheets, sea-level change and \nerosion, climatic forcing of uplift can be expected to have intensified in response to the \nchange to 100 ky cycles.  It is thus a mechanism that can plausibly provide a linkage between \nQuaternary climate and landscape evolution.  \nPage 8; Bridgland & Westaway; 18\/03\/2008 \n \n2. Empirical evidence for climatic control of terrace formation \nSome of the most detailed fluvial records in the world are found in Europe, particularly in \nregions between the maximum extents of the Pleistocene Alpine and Scandinavian ice sheets \n(e.g., Figs 4 and 5).  Most of these sequences span the Middle and Late Pleistocene, many \nalso include the Early Pleistocene and a few extend back in time to the Pliocene and Miocene.  \nWithin these sedimentary archives are clues about the relation between fluvial activity and \nclimatic fluctuation, primarily where fossils are preserved within the fluvial sediments, since \nthese are often excellent indicators of palaeoclimate.  Also important is the growing databank \nof geochronology from fluvial archives, which, coupled with biostratigrapical evidence, \ndemonstrates approximate 100 ky cyclicity in terrace formation in many rivers: i.e., in \nsynchrony with the Milankovitch cycles since ~1 Ma.  This is by no means universal, many \nsequences having fewer terraces than one per 100 ky cycle and some having more.  There are \nalso potentially important differences as to when within the climate cycle the all-important \nincision event, leading to terrace formation, has occurred.  Based on evidence from the Lower \nThames (Fig. 4), Bridgland (2000) placed the downcutting during cold-to-warm transitions, as \nindicated by the occurrence of interglacial sediments in basal situations within each terrace.  \nIn the River Avon (English Midlands), the similar basal situation of interglacial remnants \nwithin terraces (Maddy et al., 1991) led to the same interpretation (Bridgland et al., 2004a).  \nIn other valleys in the same region of NW Europe, however, interglacial preservation is at or \nnear the tops of terrace ‘treads’, leading to the conclusion that the downcutting event has \noccurred at the warm-to-cold transition.  The Somme (Antoine, 1994; Antoine et al., 2000, \n2003, in press; Fig. 5) and the Moselle (Cordier et al. 2004, 2006) are examples of systems in \nwhich this style of record occurs.  It is possible that systems with many more terraces than \n100 ky cycles, such as the (now-drowned) River Solent of southern England, have seen \nterrace formation at both transition episodes (cf., Vandenberghe, 1995, this volume; \nBridgland, 2001).  However, it is perhaps equally likely that a response to Milankovitch \nsubstage fluctuation is instead indicated (Westaway et al., 2006a); more precise \ngeochronology will be required to determine which.  A modified version of the Bridgland \n(2000) climatic model for terrace formation is presented in Figure 6, in which the various \npossibilities are accommodated.  Vertical pairing of closely spaced terraces (Fig. 6B) would, \nas noted by Bridgland (2001), be expected where downcutting has occurred at both the \nPage 9; Bridgland & Westaway; 18\/03\/2008 \nwarming and cooling transition, since the relative shortness of interglacials would mean the \nhighly unequal separation of these events by ~80 and 20ky, respectively.  Steady and \nprogressive uplift would therefore have led to a comparable inequality in terrace spacing; \ndowncutting at cooling-transitions might, therefore, coincide with shallow incision that fails \nto reach bedrock, whereas that at the warming transition might be expected to be much \ndeeper.  Indeed, major incision at cooling transitions (Fig. 6C) would perhaps only be \nexpected in situations where warming-transition incision has failed to occur, perhaps because \nsystems are swamped with sediment from destabilized landscapes, negating the increases in \ndischarge brought about by melting permafrost. \nPage 10; Bridgland & Westaway; 18\/03\/2008 \nFig. 4 \n \nPage 11; Bridgland & Westaway; 18\/03\/2008 \nFig. 5 \n \n \n \nPage 12; Bridgland & Westaway; 18\/03\/2008 \nFig. 6 \n \n3. Terrace staircases worldwide \nAs noted above, the occurrence of extensive terrace sequences in NW and central Europe is \nwell established.  In the latter area the recognition of long and complex Quaternary \nstratigraphies based on loess\/soil sequences overlying river terrace deposits, in what was then \nCzechoslovakia (Kukla, 1975, 1977, 1978), paved the way for modern schemes in which \nterrestrial records are correlated with that from the deep oceans.  IGCP 449 has documented \nPage 13; Bridgland & Westaway; 18\/03\/2008 \nimportant terrace sequences in the River Vltava, Czech Republic (Tyráček et al., 2004), and \nthe Wipper and Ilm, central Germany (Mania, 1995; Schreve and Bridgland, 2002; Bridgland \net al., 2004b).  In the German examples there is excellent preservation of interglacial evidence \nwithin subaerial travertines that typically overlie cold-climate fluvial sediments, suggesting \nthat here, as in the Somme, downcutting has occurred following interglacials.  \n3.1 Eastern Europe and the former Soviet Union \nAlthough poorly known in the west, considerable research has been undertaken on fluvial \nsequences in the former Soviet Union.  Summary review papers were therefore produced as \npart of IGCP 449, describing the sequences of the northern Black Sea and Caspian Sea rivers \n(Matoshko et al., 2002, 2004) and from rivers flowing to the Russian Arctic, namely the \nKolyma (Patyk Kara and Postolenko, 2004) and Lena (Alekseev and Drouchits, 2004).  The \nBlack Sea and Caspian rivers, in particular, have records of great significance.  Four south-\nflowing systems have been documented: the Dniester, Dnieper, Don and Volga (Matoshko et \nal., 2004; Fig. 2).  Considerable variation is seen in the vertical disposition patterns of their \nsedimentary sequences, apparently in direct relation to the type of underlying crust.  The \ndating of these various sequences makes use of biostratigraphical evidence from the \nsediments themselves, of overlying loess\/palaeosol records, of sedimentary evidence in their \nlower reaches for the fluctuation of sea level and, in their upper reaches, for the direct \ninfluence of northern glaciation.  Indeed, certain glaciations are named after the river basins in \nwhich they are best documented: the Don glaciation, correlated with MIS 16, and the Dnieper \nglaciation, generally attributed to MIS 8 (Matoshko et al., 2004). \nThe Dniester flows for ~700 km across Ukraine and Moldova, along the foreland basin of the \nCarpathian mountain range to the Black Sea, staying within the relatively young crust to the \nwest of the East European Platform (Fig. 2a).  As would be expected (see above), since it \nalone flows over ‘normal’ (i.e. relatively young and, therefore, relatively hot) continental \ncrust, the Dniester has a terrace staircase recording continuous surface uplift, amounting to \n~300 m in total, dating back to the Late Miocene (Fig. 2b).  These terraces, 15 in total, consist \nof fluvial gravels, deposited under a braided regime during cold episodes, overlain by finer-\ngrained deposits thought to represent temperate-stage overbank facies, which have yielded \nmost of the age-control evidence.  Again, therefore, this seems to suggest cooling-transition \ndowncutting.  The sequence can be divided into different phases of development based on \nclear variation in the style of terrace formation.  Working backwards, the lowest seven \nPage 14; Bridgland & Westaway; 18\/03\/2008 \nterraces record incision by the Dniester in approximate synchrony with the 100 ky climatic \ncycles of the last million years, although the MIS 10 cycle is apparently missing (replaced by \na wider vertical separation between the MIS 12 and MIS 8 terraces - see Fig. 2b).  The earlier \npart of the sequence is made up of thicker and more extensive terrace deposits, probably \nrepresentative of multiples of the shorter cycles that characterized the Miocene to Early \nPleistocene, as in sequences in NW Europe, such as the Thames (Maddy et al., 2000; \nWestaway et al., 2002).  The terrace staircase is inset into an aggradational (stacked) sequence \nof older fluvial deposits (the Balta Group) biostratigraphically dated to the Late Miocene (Fig. \n2b).  \nThe Dnieper and Don, further east, also flow into the Black Sea, but their courses lie largely \nwithin the Ukrainian shield (Fig. 2a).  In contrast to the ‘classic staircase’ of the Dniester, the \nDnieper and Don sequences record a mix of incision and aggradation, presumably driven by \nalternating uplift and subsidence.  Although rates of vertical crustal motion have at times been \nsubstantial (as indicated by differences in altitude of successive terraces; Fig. 2c and d), they \nwere later cancelled out by reversals in the sense of motion, such that the total net movement \nindicated has never exceeded a few tens of metres.  The fluvial sequences of the Ukrainian \nShield (Fig. 2c, d) are certainly different from those of Archaean cratons but, with their \nindication of long-periodicity fluctuation between uplift and subsidence (producing no great \nnet vertical change over Quaternary timescales), they also differ considerably from those \ntypical of younger crust. The Early Proterozoic crust of this shield is intermediate in terms of \nage and thermal state between the Archaean and the near-ubiquitous younger crustal types and \nmight therefore include a thin mobile lower-crustal layer.   \nThe Volga, even further east, flows into the landlocked Caspian Sea along a course that lies in \npart within the East European Platform and in part within the Pre-Caspian Block, north of the \nCaspian Sea.  The Pre-Caspian Block represents crustal basement of unknown origin (e.g., \nNikishin et al., 1996), which is thought to have accreted against the SE margin of the East \nEuropean Platform in the Late Proterozoic; drilling has reached latest Proterozoic (Vendian) \nsediments but not the underlying basement. This crust is evidently strong, since no significant \ndeformation has occurred throughout the Phanerozoic. It has been suggested that it is a \ntrapped fragment of oceanic lithosphere (cf. Şengör et al., 1993), overlain by sufficient \nsediment to create a subaerial land surface. Such oceanic crust can be presumed to lack a \nmobile lower layer, thereby mimicking the high stability of Archaean cratons (cf. Westaway \nPage 15; Bridgland & Westaway; 18\/03\/2008 \net al., 2003).  Thus the Lower Volga sequence shows accumulation of sediments of different \nages within a narrow height range relative to the altitude of the modern river (Fig. 2e), \nindicative of little net vertical movement since the Early Pleistocene.   \n \n3.2 Mediterranean rivers \nTurning to a warm temperate region, generally beyond the reach of Quaternary glaciation, two \nexample systems from opposite ends of the Mediterranean, both receiving recent attention \nrelated to IGCP 449, will be reviewed.  The first is the River Aguas, which drains the Late \nCenozoic Sorbas and Vera Basins of SE Spain, and the second is the River Orontes of western \nSyria.  The basins drained by the Aguas record marine conditions until the Early Pliocene. \nbroken only during the Messinian salinity crisis, followed by fluvial environments thereafter \n(Harvey and Wells, 1987; Stokes and Mather, 2000; Schulte, 2002; Mather and Stokes, 2003; \nBraga et al., 2003).  In the SW Vera Basin, Early Messinian reefs (pre-dating the salinity \ncrisis; age ~7-6.5 Ma) crop out at ~600 m a.s.l., whereas Early Pliocene marine sediments are \nfound nearby at ~500 m a.s.l. (Braga et al., 2003).  There has thus been significant uplift since \nthe Messinian, at time-averaged rates of ~0.1 mm a-1.  This region forms the northern part of \nthe convergent boundary zone between the African and Eurasian plates, which has led many \nauthors to ascribe the uplift, and its effect on fluvial activity, to active tectonic processes \n(Harvey and Wells, 1987; Stokes and Mather, 2000; Schulte, 2002; Mather and Stokes, 2003).  \nHowever, local rates of relative plate motion are very low, no more than a few millimetres per \nyear (e.g., Westaway, 1990; DeMets et al., 1994), too little to have caused convergent crustal \nthickening sufficient to account for the observed uplift rates throughout a zone several \nhundred kilometres wide (cf. Mitchell and Westaway, 1999).  Harvey and Wells (1987) \ninterpreted this as evidence of epeirogenic (i.e., regional) uplift, onto which local effects of \nactive faulting are superimposed, a view very similar to the ideas now emerging from other \nparts of the Mediterranean region (e.g., Mitchell and Westaway, 1999; Arger et al., 2000; \nWestaway et al., 2006b). \nPage 16; Bridgland & Westaway; 18\/03\/2008 \nFig. 7 \n \nThe Aguas has a staircase of sub-parallel terraces, thought to span the period since the Middle \nPliocene (Schulte, 2002; Fig. 7).  Comparison of their heights above the modern valley floor \nwith the altitudes of dated marine terraces on the nearby coast (Schulte, 2002) is an important \naid in dating the Aguas sequence.  Modelling the fluvial incision and causative uplift, on this \nbasis, results in an estimate of the latter not significantly at variance with those in other \nregions of relatively young continental crust (Fig. 8), raising serious doubts about whether \nplate tectonic activity has any role in influencing this effect. \nPage 17; Bridgland & Westaway; 18\/03\/2008 \nFig. 8 \n \nIn the eastern Mediterranean region terrace sequences are known from the Nile (Said, 1981), \nthe Euphrates (Tyráček, 1987; Demir et al., 2004), the Jordan (Bar-Yosef, 1998), and many \nrivers in Turkey (Demir et al., 2004).  Active crustal deformation in this region has led to \nsome atypical fluvial records, with rivers affected by faulting and volcanism (e.g., Ozaner, \n1992; Bunbury et al., 2001; Westaway et al., 2005, 2006b; Demir et al., 2004).  Another \neastern Mediterranean fluvial archive that has come to light during IGCP 449 is from the \nPage 18; Bridgland & Westaway; 18\/03\/2008 \nUpper Orontes in Syria, studied by the present authors as part of long-running archaeological \nsurvey based on Homs (Bridgland et al., 2003).  This continuing study seeks to relate \nPalaeolithic artefact assemblages from the area south of Homs to aggradational terraces of the \nOrontes, which have been newly mapped in a wide area to the east of the river (Fig. 9).  \nBridgland et al. (2003) reported a well-preserved staircase of at least 12 terraces in the 130 m \nabove the river (Fig. 9), identified in the 2001 field season.  Subsequent work in 2002 and \n2003 has identified several more terraces up to ~200 m above the river.   \nFig. 9 \n \nData from the upper Orontes supplement previous findings from the Middle reach of the river \n(e.g. Besançon and Sanlaville, 1993; Dodonov et al., 1993), including the record from a key \nfossiliferous Palaeolithic site at Latamneh, ~80 km north of Homs (Fig. 9a).  A mammalian \nassemblage from here can be ascribed to the mid-Middle Pleistocene; its combination of \nStephanorhinus hemitoechus and Megaloceros verticornis has no exact parallel in Europe, \nwhere the former post-dates and the latter pre-dates MIS 12. This was used by Bridgland et al. \n(2003) to calibrate the age of their sequence from the Upper Orontes to around the time of this \nglacial (Fig. 9b).  A further constraint is provided by the time of eruption of the latest \nMiocene Homs Basalt, which blocked any pre-existing drainage in this region; following this \neruption the river has incised by ~400 m (Bridgland et al., 2003).  Again the amounts of uplift \nPage 19; Bridgland & Westaway; 18\/03\/2008 \nindicated are comparable with post-Archaean crust remote from plate boundaries, suggesting \nthat no special effect applies to the Orontes related to its situation in the (active) Dead Sea \nFault Zone (the active boundary zone between the African and Arabian plates; cf. Westaway, \n2004).  Localized uplift related to this fault zone has been recognized, but is concentrated to \nthe west rather than the east, where the Orontes flows (cf. Westaway, 2004). \nAnother Eastern Mediterranean river system with a long-timescale record is the Gediz in \nwestern Turkey. This system is situated sufficiently far from any major active faults for it to \nbe clear that it has responded to regional uplift, not local tectonic effects. In the vicinity of the \nKula Quaternary volcanic field, this river has produced a staircase of terraces indicating ~400 \nm of incision since the Pliocene (e.g., Westaway et al., 2004, 2006b; Maddy et al., 2005).  \nBasalt lavas have provided both excellent preservation of underlying Gediz deposits and, \nusing K\/Ar and Ar\/Ar techniques, a means of dating the fluvial activity. In particular, there \nare 11 high-level terraces (~200-140 m above the modern Gediz) that, from the available \ndating of the overlying basalt and from uplift-modelling constraints, may represent successive \n41 ky (Early Pleistocene) Milankovitch cycles (Maddy et al., 2005; Westaway et al., 2006b).   \nPlentiful supplementary evidence is available in support of the notion that the relatively \nyoung continental crust in the Mediterranean region has behaved in a similar way to that (of \npost-Archaean age) elsewhere in the world.  To the terrace sequences of the Nile and \nEuphrates (already mentioned) can be added, as evidence of surface uplift, the terraces of the \nKebir and the occurrence of raised beaches along the Syrian and Lebanese coasts.  Around \nLatakia, northern Syria (Fig. 9a), marine terraces alternate with the Kebir terraces (Besançon \net al., 1978; Besançon and Sanlaville, 1984), indicating that the river terraces did not form \nduring interglacial high-stands (e.g., Copeland and Hours, 1993).  This is important in that it \nsuggests that fluvial aggradation occurred during cold stages, as in the areas further north.  \nWhether temperature fluctuation or variation in precipitation is the key forcing factor for \nclimatic triggering of terrace formation in these warmer regions remains uncertain, however.  \nThe effects of aridity\/precipitation fluctuations on fluvial discharge and sediment load might \nbe comparable with those of temperature; like temperature cycles, humidity fluctuations \nwould be expected to operate both directly and indirectly, the latter by means of their \ninfluence on vegetation density and, thereby, on slope stability (see below).  The two types of \ncycle are likely to be inter-related (e.g. Rossignol-Strick, 1999) and their individual \ncontributions difficult to resolve. \nPage 20; Bridgland & Westaway; 18\/03\/2008 \n3.3 North America  \nIn marked contrast to Europe, river terrace records have had limited prominence in North \nAmerican Quaternary studies.  The Mississippi terraces are well known, but there is a paucity \nof biostratigraphical control on their ages, dating having instead been achieved with reference \nto Laurentian glaciations, which have fed melt-water southwards into this river, and loess-soil \nsequences overlying the terraces (cf. Fisk, 1951; Saucier, 1996; Blum et al., 2000).  North \nAmerican rivers in areas within the zone of repeated Pleistocene glaciation have restricted \nrecords, with little evidence as old as Middle Pleistocene (e.g. Clet-Pellerin and Occhietti, \n2000).  Despite extending well south of the maximum glacial limits, the Lower Mississippi \nterrace sequence can be dated back only to the Middle Pleistocene (Blum et al., 2000; Blum \nand Straffin, 2001), but other systems in the southern part of the continent have records \nspanning the Late Cenozoic and sometimes even the whole of the Cenozoic.  Notable \namongst these is the Susquehanna (e.g., Pazzaglia and Gardner, 1994). \nOne of the best-documented North American records of uplift-driven fluvial incision comes \nfrom right-bank tributaries of the Missouri - Mississippi system that drain eastward from the \nRocky Mountains across the central United States, a notable example being the River Platte \n(Fig. 10).  This system consists of two principal affluents, both with notable terrace staircases.  \nThe South Platte flows through the city of Denver, Colorado, where it has incised by ~500 m \ninto the Miocene \/ (?) Early Pliocene landscape (Fig. 10), whereas the North Platte flows \nacross eastern Wyoming and western Nebraska, where it has formed a comparable terrace \nstaircase within the High Plains (Reed et al., 1965; McMillan et al., 2002; Heller et al., 2003).  \nThere is every reason to suppose that, as elsewhere in the temperate latitudes, these terrace \nsequences have formed as a result of climatic forcing of fluvial activity set against a \nbackground of surface uplift (cf. McMillan et al., 2002).  The sequences exemplified by \nFigure 10 imply terrace formation at a lower frequency than once per 100 ky Milankovitch \ncycle, with only the major climatic oscillations represented, as in certain European rivers (see \nabove).  The apparent absence of any MIS 12 terrace, also a notable feature of the \nSusquehanna sequence (Westaway, in press), is in marked contrast with European records. \nPage 21; Bridgland & Westaway; 18\/03\/2008 \nFig. 10 \n \nDramatic Late Cenozoic fluvial incision has also been documented in western North America, \nthe most famous example being the ~1500 m deep Grand Canyon of the River Colorado in \nArizona.  Time-averaged incision of this canyon has been calculated as ~0.1 mm a-1, from its \nrelation to dated Miocene volcanism (Damon et al., 1974). Along the canyon the amounts of \nincision show a general downstream decrease; for instance, the incision since ~500 ka has \nbeen ~260 m near the upstream end of the canyon in SE Utah (Garvin et al., 2005) but only \n~30-50 m, ~200-300 km to the WSW in NW Arizona (e.g., Lucchitta et al., 2000; Pederson et \nal., 2002). However, the extent to which this results from the localized effects of vertical slip \non active faults, rather than true regional-scale tapering in the regional uplift has yet to be \ndetermined (cf. Pederson et al., 2002, 2003; Hanks and Blair, 2003). \nPage 22; Bridgland & Westaway; 18\/03\/2008 \nFig. 11 \n \n \n The clearest evidence for the history of long-timescale incision by the Colorado \nsystem is derived from upstream of the Grand Canyon, in the Grand Valley region of western \nColorado state, around Grand Junction (Fig. 11). This dataset represents localities up to ~150 \nkm apart; there is thus the possibility that uplift histories and\/or rheological properties of the \ncrust have varied laterally (as for the Dnieper – see Fig. 2c caption); furthermore, there is \nevidence of some local variation in vertical motion associated with minor active faulting (e.g., \nKellogg, 2004).  A total of ~1650 m of fluvial incision is evident since the Middle Miocene \n(Fig. 11). The oldest evidence is provided by dating to ~10 Ma of the basalt cap of Grand \nMesa, this basalt being thought to have flowed into a palaeo-valley occupied by the ancestral \nColorado. Dramatic incision occurred down to the level of the next marker, the Spruce Ridge \nbasalt, which is dated to ~7.8 Ma and caps fluvial gravel at 847 m above the river (Figs 11 \nand 12).  Notable subsequent increases in rates of uplift and incision are evident around 3 Ma \nand 0.9 Ma (Fig. 12). \nPage 23; Bridgland & Westaway; 18\/03\/2008 \nFig. 12 \n \n3.4 Southern Africa \nThis is a temperate-climate region of the southern hemisphere in which the effects of \nQuaternary glacial - interglacial fluctuation would be expected to have left a record \ncomparable to those in equivalent regions of the northern hemisphere; climatically, these \nwould be the Mediterranean regions.  Southern Africa has already featured above, in \nconnection with the Archaean cratonic area at its core.  This is drained by the Vaal, which has \na Late Cenozoic fluvial sequence of restricted vertical range (Fig. 3d), starting with the \nMiocene Proksch Koppie and Wedburg gravels (Fig. 3c).  The oldest Vaal gravel shown in \nFigure 3d, the ‘Younger Gravel A’, is of Pliocene – Early Pleistocene age, indicating no \nsignificant fluvial incision during the Quaternary in this craton.  However, younger crust is \nalso to be found in southern Africa, ranging in age from Early Proterozoic to Palaeozoic.  A \npublished fluvial record from outside the cratonic area, from the Sundays River in the \nNamaqua-Natal crustal province (Middle-Late Proterozoic) and the Cape Foldbelt \n(Palaeozoic), provides an important contrast with the Vaal.    \nThe Sundays has, in its lower reaches, a well-developed terrace staircase (e.g., Hattingh, \n1994; Hattingh and Goedhart, 1997; Hattingh and Rust, 1999; Fig. 13).  The terraces remain \nsubparallel across the transition between the Namaqua-Natal crustal province and the Cape \nPage 24; Bridgland & Westaway; 18\/03\/2008 \nFoldbelt, suggesting that the uplift response within these crustal provinces has been similar.   \nNo direct age-control is available for any of the Sundays terraces, so it is necessary to \nestimate their ages based on relations with other datable deposits and by modelling the fluvial \nincision they record, the latter using the methodology of Westaway (2001; Westaway et al., \n2002; Fig 14). Minimum-age dating control is provided by marine sediments at ~450 m a.s.l. \nnear Kirkwood, which have been attributed to the Middle Pliocene (McMillan, 1990) and \nwhich pre-date the full Sundays sequence (Fig. 13). Taking the age of these marine sediments \nas ~3 Ma, a subsequent time-averaged uplift rate of ~0.15 mm a-1 is indicated. Assuming \nsimple progressive uplift over this period, however, cannot provide a sensible explanation for \nthe configuration of the terraces in the Sundays valley.  Modelling a pulse of accelerated \nuplift in response to the Mid-Pleistocene Revolution, as is seen in well-dated sequences from \nother parts of the world (and demanded by the principles of lower crustal flow forcing - see \nabove; Westaway et al., 2006b), provides a much better match for the Sundays terraces (Fig. \n14).  Indeed, it is also broadly consistent with the set of ages inferred by Maud (1968) for the \nstaircase of marine terraces east of the Sundays estuary.   \nPage 25; Bridgland & Westaway; 18\/03\/2008 \nFig. 13 \n \nIt should be noted that this interpretation differs significantly from that proposed by Hattingh \nand Rust (1999). They adopted a different age model, after Le Roux (1989, 1990), in which \nthe ~450 m marine deposits were attributed to the Late Miocene, rather than Middle Pliocene. \nIn their view, Sundays terraces T1 to T9 formed in the Late Miocene and Pliocene, with only \nT10 to T13 assigned to the Pleistocene. Furthermore, in their view the fluvial incision resulted \nfrom global eustatic sea-level fall, not regional uplift; however, the idea that sea-level could \nhave fallen by ~450 m since the Miocene (or Pliocene) is irreconcilable with the subsequent \nPage 26; Bridgland & Westaway; 18\/03\/2008 \nnet increase in global ice volume. The alternative McMillan (1990) age model for the marine \nsediments, adopted here, has also been preferred in other recent studies of the Late Cenozoic \nevolution of this region (e.g., Partridge, 1997, 1998).   \nFig. 14 \n \nThe modelling results presented in Figure 14 thus envisage an increase in uplift rates in the \nLate Pliocene, followed by a relative lull in the Early Pleistocene, then a renewed increase in \nthe Middle Pleistocene, when the Sundays River switched from aggrading across a broad \nregion to a relatively narrow gorge, represented by terrace T4 onwards (Hattingh and Rust, \n1999; Fig. 13b).  This similarity suggests that the Sundays terraces have probably formed in \nthe same way as those in Northern Hemisphere systems, in response to climatic forcing.  \nThe main difference between these African records and river terrace staircases in Europe \nPage 27; Bridgland & Westaway; 18\/03\/2008 \nconcerns the relative magnitudes of the Late Pliocene and Middle Pleistocene uplift phases.  \nThe present-day climate of most of the Sundays catchment is arid, with mean annual rainfall \nno more than ~300 mm (e.g., Schulze, 1972).  Since there has been no Pleistocene glaciation \nin southern Africa, the most likely forcing agents for Middle Pleistocene uplift (by way of \nlower crustal flow) are erosion and cyclic loading of the continental crust beneath the offshore \ncontinental shelf in response to global sea-level fluctuations (Westaway, 2002a). The \nmagnitude of this effect is evidently a consequence of high mobility of the lower crust in this \nregion, due to its high heat flow. The even greater uplift rates deduced for the Late Pliocene \nthus require an additional cause: probably enhanced erosion. High rates of Late Pliocene \nerosion can be envisaged in this region, arising from the much wetter climatic regime known \nto have prevailed at that time (e.g., Tankard and Rogers, 1978; Tankard et al., 1982; Tyson, \n1986). \n3.5 Australia \nAustralia is well known as a stable and ancient landscape, an axiom consistent with the \noccurrence there of significant cratonic provinces; much of Western Australia coincides \nwith the Archaean Yilgarn and Pilbara cratons, identified as further examples of stable \nareas lacking Late Cenozoic terrace staircases by Westaway et al. (2003).  The extreme \nstability of Australian Archaean crust is underpinned by estimates of Cretaceous sea-level \nand corresponding shorelines, which indicate net vertical motions since the Cretaceous of a \nfew tens of metres at most (cf. Beard, 1998; Westaway et al., 2003). \n \nRelative inactivity in other parts of this southern continent can perhaps be ascribed to \nincreasing aridity - well documented in the internally draining Lake Eyre Basin (e.g., \nKershaw and Nanson, 1993; Nanson and Price, 1998).  The largest fluvial system in \nAustralia, the Murray-Darling, can be shown to have existed since at least the Eocene and \nfor much of its history fed into a subsiding depocentre, in which several hundreds of \nmetres of fluvial, lacustrine and marine sediments accumulated (e.g., Brown and Radke, \n1989; Stevenson and Brown, 1989).  However, as in other parts of the world, uplift in the \nLate Cenozoic, estimated to be 60-110m since the beginning of the Middle Pleistocene \n(e.g., Huntley et al., 1993, 1994; Murray-Wallace et al., 1996) at a rate of between ~0.07 \nand ~0.13 mm a-1, has led to incision into the earlier deposits and the formation of both \nfluvial and marine terraces.  The uplift chronology is constrained by the dating of \nPage 28; Bridgland & Westaway; 18\/03\/2008 \nQuaternary basalt of the Mount Gambier \/ Mount Schank volcanic field (cf Sheard, 1990), \nwhich caps Middle Pleistocene marine terrace deposits along the Southern Ocean coastline \nof eastern South Australia, ~300 km SSE of the mouth of the Murray. Uplift rates vary \nalong this coastline, being lower in the vicinity of the mouth of the Murray and in the \ncratonic region farther west (e.g., Murray-Wallace, 2002). \n \nA well-researched terrace record from ~900 km further ENE is that of the River Shoalhaven, \nwhich drains from the Great Dividing Range eastwards into the Tasman Sea to the south of \nSydney (e.g., Nott, 1992; Nott et al., 2002; Fig. 15).  According to Nott (1992), this river is \nancient, having existed (like the Murray) throughout the Cenozoic.  By the Oligocene it had \nestablished a broad valley, but in the Late Oligocene (~30 Ma) a basalt eruption dammed the \nriver, creating a lake, ~80 km long, in which up to 60 m of sediment was deposited.  The \nShoalhaven has since incised into this Oligocene sediment by ~40 m, forming a staircase of \nsix terraces, the youngest four of which have been dated by Nott et al. (2002) to MIS 12, 8, 4, \nand 2, using the TL technique (Fig. 15).  Uplift modelling of this terrace staircase (not \nillustrated) suggests that the two oldest terraces may relate to MIS 22 and MIS 14 (Fig. 15), \nindicating typical uplift rates during the Middle-Late Pleistocene of ~0.05 mm a-1. Simple \nextrapolation of the pattern of terrace heights in Figure 15 leads to the same conclusion.   \n \nFig. 15 \n \n \nComparative data are provided by the staircase of marine terraces on the adjacent coast of \nsouthern New South Wales. According to Young and Bryant (1993), there are Middle-Late \nPage 29; Bridgland & Westaway; 18\/03\/2008 \nPleistocene wave-cut platforms at 2 m (from MIS 5c or 5a), 4 m (MIS 5e), and 8 m a.s.l. (MIS \n9 or older), all dated using amino acid, uranium series, or TL techniques, plus older undated \nplatforms at 10 m a.s.l. (? Early Pleistocene) and ~20-30 m a.s.l. (? Miocene or older). \nNeglecting any effect of global eustatic sea-level fall, the uplift rate of this coastline was thus \nonly ~0.002 mm a-1 during the Pliocene and Early Pleistocene (for ~10 m of uplift during ~6 \nto ~1 Ma) but ~0.01 mm a-1 since, again suggesting an increase in uplift rates in the early \nMiddle Pleistocene, although the rates involved are lower here than elsewhere in the region. \n \nThe evidence from the Shoalhaven (Fig. 15), which suggests terrace formation in approximate \nsynchrony with Milankovitch cycles (like many rivers in the northern hemisphere), is thus \nconsistent with the evidence from marine terraces in SE Australia.  Both point to an increase \nin uplift rates in the late Early Pleistocene or early Middle Pleistocene, just as in many other \nregions of the world.   \n \n3.6 South America \n \nDespite including the world’s largest river system, the Amazon, relatively little is known of \nfluvial records in South America, with few reported terrace sequences.  There have, however, \nbeen IGCP 449 contributions from Uruguay\/Argentina (Parana-Uruguay system – Ubilla, \n2004) and from Amazonia (Latrubesse and Rancy, 2000; Latrubesse, 2002; Westaway, \n2006a).  Much of Amazonia is on the Archaean crust of the Amazon Craton, which, given the \nobservations noted above (cf. Westaway et al., 2003), might well explain the paucity of \nreported river terraces.  Closer examination of the known geomorphology of this largely \ninaccessible region shows that terraces have indeed been recorded from patches of younger \ncrust around the Amazon craton, although they are generally poorly researched.  For example, \naround Rio Branco, western Brazil, west of the Amazon Craton (location of an IGCP 449 \nfield meeting in June 2003), terraces occur at up to 70m above the present level of Amazon \ntributaries such as the Acre and Purus (Latrubesse et al., 1997; Westaway, 2006a; Fig. 16). \nThese terraces are inset into an older stacked fluvial\/lacustrine succession (the Solimões \nGroup), deposition of which ended ~3 Ma (from biostratigraphy and Ar-Ar dating of \ninterbedded tuff: cf. Westaway, 2006a). Terraces have also been documented from other \ntributaries of the Amazon, including the Jurua, Las Piedras and Madre de Dios, in both \nwestern Brazil and adjacent parts of Peru (~7-13° S; e.g., Räsänen  et al., 1992; Latrubesse et \nal., 1997; Westaway, 2006a). \nPage 30; Bridgland & Westaway; 18\/03\/2008 \nFurther south, the River Mendoza, one of the most northerly tributaries of the Colorado \nsystem in central-western Argentina, has a staircase of at least six terraces (Brunotte, 1983).  \nIn a region of the Eastern Cordillera of the Andes that has witnessed cold-stage glacial \nadvances (e.g., Espizua, 2000), these terraces relate to sedimentary complexes comprising \npediments that pass downslope into fluvial or fluvioglacial aggradations.  Brunotte (1983) \nnoted that the oldest of these pediments is inset into a stacked sequence of fluvial \nconglomerate, the Mogotes Formation, of inferred Pliocene age, and that the top of this (at \n~2500 m a.s.l.) is ~1200 m above present river level.  \nFig. 16 \n \nAnother Colorado tributary, the Diamante, ~150 km further south (around 34° 30’ S), has a \nstaircase of five terraces (Grosso and Corte, 1989).  The highest of these is up to ~200 m \nabove the river, over a zone many kilometres wide, inset into which are younger, much \nnarrower terraces.  On the basis of regional correlations, these five terraces (in reversed \nstratigraphical order) have been dated (Grosso and Corte, 1989) to the Late Würm (i.e., MIS \n2), Early Würm (~MIS 4), ‘Late Pleistocene’ (possibly MIS 6), ‘Middle Pleistocene’ (~ MIS \n12), and Early Pleistocene (~1.2-1.0 Ma).  The attribution of terrace 2 to MIS 12 is based on \nthe presence in sediments at a corresponding position in an adjacent river of deposits from an \nAndean pyroclastic flow dated to ~450 ky ago (Stern et al., 1984).  According to Baker and \nGosse (2003), rates of incision in this reach of the Diamante during the Middle and Late \nPleistocene, based on this and other dating constraints, were typically ~0.2 mm a-1, consistent \nwith an age of ~1 Ma for the ~200 m fluvial terrace.  These observations suggest that a broad \nriver valley existed here in the Early Pleistocene but became progressively entrenched in the \nMiddle-Late Pleistocene, exactly as is recorded in many European systems (see above).  \nPage 31; Bridgland & Westaway; 18\/03\/2008 \nWork in progress to date the incision history of the Diamante using cosmogenic isotopes (cf. \nGosse et al., 2005) will enable this hypothesis to be tested.   \n \nBetter documented are the terraces of the River Neuquen, a major affluent of the Negro, in \ncentral-southern Argentina.  Garleff et al. (1983) have described four Neuquen terraces at up \nto 100m above river level.  There is no age control, although Garleff et al. suggested that the \nlowest two terraces represented the last two glacials.  The imprecision of the age \ninterpretations from all these South American studies, together with the absence of any direct \nevidence for warm-stage activity, makes it impossible to establish whether climatic forcing \nhas taken place, let alone explore its style.  Nonetheless, this southern part of the continent \nhas experienced similar climatic fluctuations to the areas in Europe in which the classic \nsequences of river terraces have formed, so it is tempting to suggest that a comparable \nmechanism of terrace generation has been active here. \n \n4. Discussion: climatic forcing of terrace formation \nFrom the worldwide examination undertaken as part of IGCP 449, terrace staircases are seen \nas ubiquitous features in landscapes all over the planet, recording significant fluvial incision \nduring the Late Cenozoic, especially during the Middle and Late Pleistocene.  The case \nstudies reviewed above represent selected fluvial records from around the world, which, \nthanks especially to the work of project contributors, allow a level of international comparison \nhitherto impossible.  A key comparative feature is uplift, which can be estimated from river \nterrace sequences and shows both remarkable similarities between regions as well as notable \ncontrasts between different crustal types.  There is reason to suggest that climate and uplift are \ncoupled through mechanisms such as the isostatic response to changes in rates of erosion (cf. \nWestaway, 2001, 2002a).  An important aspect of this is the apparently worldwide increase in \nuplift rates following the ‘Mid-Pleistocene Revolution’, seemingly a response to the start of \n100 ky Milankovitch forcing.  Furthermore, longer-timescale sequences such as those from \nthe Rhine (Fig. 1), Maas (van den Berg, 1994;  van den Berg and van Hoof, 2001), Dniester \n(Fig. 2) and Colorado (Fig. 11) show increases in uplift rates around 3 Ma; i.e. coincident \nwith the climatic deterioration following the Middle Pliocene optimum (Westaway, 2002b).  \nWhere terrace levels can be dated, the vertical separation from the modern valley floor \nindicates time-averaged incision rates since ~1 Ma that vary between ~0.03 mm a-1 (e.g. the \nPage 32; Bridgland & Westaway; 18\/03\/2008 \nSusquehanna; Westaway, in press) and ~0.2 mm a-1 (e.g., the Rhine; Figs 1 and 8f).  Evidence \nfrom the best-dated long sequences, such as that from the Dniester (Fig. 2b), allow this \nincision record to be further resolved and interpreted as a measure of the pace of the surface \nuplift that has driven the downcutting.  As already noted, however, this pattern is recognized \nonly on post-Archaean crust; records from more ancient, cratonic areas, such as the Indian \nsubcontinent and the Kaapvaal Craton in South Africa, show little net uplift during the Late \nCenozoic (Fig. 3).  This has led to the conclusion that only continental crust consolidated in \nthe last ~2500 Ma retains the hot, mobile lower layer in which such vertical movement is \ngenerated (see above; Westaway et al., 2003).   \nAn important additional observation that can now be made is that intermediate situations \nexist, in which fluvial records show fluctuating uplift and subsidence of long periodicity, with \nlimited net change in level.  These appear to be characteristic of Early Proterozoic crust, such \nas that forming the Ukrainian Shield, as indicated by the Dnieper and Don records (see above; \nFig. 2c, d); such crust retains only a thin mobile lower layer and so is indeed intermediate \nbetween Archaean cratons and crust younger than the Middle Proterozoic. To a lesser extent \nthe record from the Colorado (Fig. 11), again characterized by fluctuating uplift and \nsubsidence of long periodicity, is a further example of this effect.   \nThe thickness of the mobile lower crust can be characterized by the parameter Wi, defined in \nthe caption of Figure 8. The modelling of the Colorado data in Figure 12 requires Wi=6 km, \nsignificantly less than the various examples from younger crustal provinces in Figure 8; \nsimilar modelling for the Dnieper and Don, not illustrated, requires Wi=5 km. The principal \ncause of the thinness of the mobile lower crustal layer in both these Early Proterozoic \nexamples appears to be the presence of a thick layer of mafic material (which will not flow at \nthe ambient temperatures and thus restricts the depth range of the overlying mobile layer), \nunderplated at the base of the crust.  In the case of the Colorado Plateau, which consolidated \nin the Early Proterozoic, the layer of mafic underplating was apparently emplaced at that time \n(e.g., Wendlandt et al., 1993). The age of the mafic underplating beneath the Ukrainian Shield \nis much less clear; some or all of it may represent the cumulative effect of subsequent mantle \nplume magmatism, such as that associated with the Devonian rifting in the Dnieper Basin \n(e.g., Chekunov et al., 1992; Wilson and Lyashkevich, 1996). Thick layers of mafic \nunderplating, up to ~20 km, are commonly identified at the base of Early to Middle \nProterozoic crust  from seismic wave velocities (e.g., Durrheim and Mooney, 1991, 1994), \nPage 33; Bridgland & Westaway; 18\/03\/2008 \nwhich is thus often ~40-50 km thick. A thin mobile lower-crustal layer may thus be \ncharacteristic of such regions, leading to complex patterns of vertical crustal motion such as \nthose observed in the Ukrainian Shield (Fig. 2c and d) and the Colorado Plateau (Fig. 11).  \nThe idea that crustal rheology, inherited from the ancient geological past, affects rates of \npresent-day vertical crustal motion is not new; it also underpins the work of others, such as \nthe ‘lithospheric memory’ hypothesis of Cloetingh et al. (2005).  However, as noted above, \nthe observed vertical motions are here explained as consequences of coupling between surface \nprocesses and induced lower crustal flow, rather than being consequences of plate boundary \nforces, as Cloetingh et al. (2005) believed.  The fluvial database reviewed here shows several \nexamples of areas that are clearly unaffected by convergent plate motions, as required by the \nCloetingh et al. hypothesis, and yet have river terrace sequences that record surface uplift. \nExamples are the Shoalhaven in Australia (Fig. 15), the Sundays in South Africa (Fig. 13) and \nthe Colorado in the western USA (Fig. 11), none of which is near a recent convergent \nboundary; indeed the Colorado adjoins the actively extending Basin and Range Province.   \n4.1. Climatic forcing of terrace formation \nThe discussion will now explore the usefulness of the new (IGCP 449) data resource for \nexamining the role of climatic fluctuation in river terrace formation.  Uplift alone could \nperhaps have brought about terrace formation, particularly if it had taken the form of sporadic \nbursts of vertical movement interspersed with periods of stability (cf. Matoshko et al., 2004).  \nTerraces that can be attributed to individual earthquake events are only to be found in plate \nboundary zones, however, where faults have very high slip rates (e.g. Leland et al., 1998).  \nThe minimal role of fault movement in accommodating lateral variations in uplift generated \nby lower crustal flow has been discussed elsewhere (Westaway, 2006b). Examples are known \nwhere slip on intraplate active faults is superimposed onto regional uplift, but this results in \nminor warping of terraces rather than the formation of additional features (e.g. Krzyszkowski \net al., 2000; Westaway et al., 2006a). \nEven without climatic triggering or sporadic uplift pulses, channel diversion as a result of \navulsion, meander cut-off or capture could have resulted in terrace formation in areas of \nprogressive elevation.  Indeed, the weakly separated terraces of the Pravara and Kukadi \nsystems of the Deccan plateau, India (Fig. 3a, b), appear to have resulted from shifts in the \nfluvial courses rather than progressive incision\/aggradation cycles (cf. Westaway et al., 2003).  \nPage 34; Bridgland & Westaway; 18\/03\/2008 \nShifting channels are always necessary, of course, for terraces to form; in uplifting regions, if \nchannels remain fixed (e.g. in areas of highly resistant bedrock) the result is a deeply incised \nnarrow valley or gorge, with minimal terrace preservation (as in Fig. 1b).  Terraces formed by \nshifting channels will be localized, however, rather than traceable over large parts of \ncatchments, as in the example terrace sequences used to illustrate this paper.  \nThe most important support for climatic forcing of terrace formation comes from empirical \nevidence in those sequences in which palaeoclimatic indications are well preserved.  This \nnormally means fossils, although sedimentological and pedogenic (including cryogenic) \nevidence is of considerable importance in some instances.  The evidence often indicates a \nclimatic periodicity closely matching the cyclicity of the terraces.  Examples of this are the \ncold-warm-cold sequences of the lower Thames (above; Fig. 4) and the consistent occurrence \nof interglacial beds capping the terraces of the Somme (Fig. 5).  In systems for which a \nrelationship with climatic fluctuation cannot be demonstrated, this is generally because \nevidence for variable palaeoclimate is rare or absent.  In the absence of fossils or pedogenesis, \nthe warm parts of climatic cycles will be difficult to demonstrate, even if they are represented \nwithin the sedimentary sequence.  Clear records of interglacial climate frequently coincide \nwith limestone bedrock and consequent calcareous ground water, which enable preservation \nof vertebrate and molluscan fossils and can even lead to travertine precipitation during \nclimatic optima, as in the Wipper and other rivers of central Germany (Mania, 1995) and \nthose of northern France (Antoine and Limondin-Lozouet, 2004; Antoine et al., in press).  In \nregions where such evidence exists, it seems reasonable to use the records from areas of \noptimal preservation as analogies.  In this way the spacing of terraces and their relation to less \nfrequent dating points, such as glaciations or even the well-documented narrowing of valleys \nfollowing the ‘Mid-Pleistocene Revolution’ (see above), can be used to compare with \nsequences elsewhere.  Invariably the sequences with the best palaeoclimatic evidence will \nalso be the best dated, on the basis of biostratigraphy, the various dating methods that use \nfossils as raw material or even from basic climato-stratigraphy.  Exceptions to this occur in \nvolcanic areas, where lavas and ash deposits interbedded with fluvial sequences can be dated \nby radiometric means (e.g. Pastre, 2004; Westaway et al., 2005, 2006b; Maddy et al., 2005).  \nIn addition, there is an increasing number of systems in which OSL dating has been applied to \nfluvial sands (e.g. Jain et al., 1999, 2004; Jain and Tandon, 2002; Briant et al., 2006) and ESR \ndating of fluvially transported quartz grains has been successfully employed in France \n(Antoine et al., 2003, in press; Despriée et al., 2004; Antoine and Limondin-Lozouet, 2004). \nPage 35; Bridgland & Westaway; 18\/03\/2008 \nAs noted, the idea that river terraces have been climatically generated is long established \n(Zeuner, 1945; Bourdier, 1968), although it fell out of favour during times when terrestrial \nsequences were viewed in terms of over-simplified climato-stratigraphical models (e.g. \nattempts to explain the post-Anglian Thames sequence in terms of only two climatic cycles – \ncf. Bridgland, 1994; Gibbard, 1994).  With the recognition of nine 100 ky cycles since the \n‘Mid-Pleistocene Revolution’, the potential for matching river terraces to climatic forcing is \nconsiderable.  Detailed studies of fluvial activity during the last climatic cycle have revealed \nthe importance of climate as a forcing factor (e.g, Macklin et al., 2002; Howard et al., 2004), \ndespite such records being variably compromised by anthropogenic influences.  It is therefore \nclear that cyclic changes in climate would be capable of driving terrace formation, given \nbackground uplift.  This leaves more sophisticated questions to be explored, such as which are \nthe most important parts of climatic cycles in terms of fluvial activity, whether all rivers \nrespond in the same way, whether (as has always seemed likely) there are differences between \nclimatic zones and whether humidity\/precipitation, rather than temperature, can be the key \nfactor in some cases. \nIt has already been noted that some rivers have cut down, forming new terraces, at cold-to-\nwarm transitions, whereas others seem to have deepened their valleys following interglacials.  \nIt has also been noted that, whereas sequences exist with an approximate one-to-one match \nbetween terraces and glacial-interglacial (Milankovitch 100ky) cycles, there are many others \nwith fewer terraces than this.  A ready explanation exists for these records; the rivers have \npresumably responded only to the more significant climatic cycles, perhaps those identified \nby Kukla (2005) as supercycles.  A good example is Kukla’s (1975, 1977) own record from \nthe River Svratka, Czech Republic.  Rivers with more terraces than 100 ky cycles are rarer.  \nThe Somme (Fig. 5) has just one extra terrace, formed during MIS 7(b) (Antoine, 1994; \nAntoine et al., 2000), as does the Yonne, a Seine tributary (Chaussé et al., 2004).  Another \nexample is the Maas, for which an additional terrace has been attributed to MIS 13(b) \n(Westaway, 2002b).  The Solent, mentioned above, has several extra terraces, perhaps \nachieving nearly two per 100 ky cycle during the late Middle Pleistocene (Westaway et al., \n2006a).  These examples are all from uplifting crustal areas in proximity to the Atlantic, the \nlatter factor perhaps bringing the climatic sensitivity that has led to this type of extreme \nresponse. \nPage 36; Bridgland & Westaway; 18\/03\/2008 \n4.2 Differences between climatic zones \nThe differing patterns of terrace preservation from the four eastern European rivers discussed \nabove (Fig. 2), located within the temperate climatic zone, are important for showing that \ncrustal type, rather than climate, is the key factor influencing the disposition of fluvial \nsedimentary archives.  This is especially true since the cited examples of cratonic stability, \nnamely in India, southern Africa and western Australia (Westaway et al., 2003; Fig. 3), are in \nwarmer regions.  There are several uncertainties involved in extrapolating explanations of \nterrace formation from cooler temperate regions to warmer climatic zones.  These relate to the \npotential role, in the climatic forcing of fluvial activity, of permafrost (or more especially, its \nmelting) and to whether fluctuations of temperature or precipitation are the most influential or \nwhether other processes restricted to warmer climates might also be important.  Indeed, \nfollowing Büdel (1977, 1982), a view emerged that river terraces have not formed in the \ntropics, perhaps because these areas have not experienced the cold\/periglacial – \nwarm\/interglacial fluctuations.  The emphasis on such fluctuations in many explanations of \nterrace formation (Tyráček, 1983; Bridgland, 1994, 2000; Wymer, 1999) would seem to \nsupport Büdel’s view.  Data from IGCP 449 and earlier studies, however, have shown that \nterrace sequences are indeed present between the tropics, important examples occurring in the \nsystems of the River Tana in Kenya (latitudes ~0-2° S; Veldkamp et al., 2004; in press), the \nRiver Niger in eastern Mali and southern Niger (~12-16° N; e.g., Beaudet et al., 1981; Dubois \net al., 1984; Oussini and Morel, 1989; Bergoeing and Gilliard, 1997) and the various South \nAmerica examples mentioned above.  Büdel may have been misled, in formulating his views, \nby basing his impressions of tropical landscapes predominantly on his observations of \ncratonic areas such as Amazonia and the Archaean Congo Craton of central Africa, where the \nabsence of terraces can now be seen to be the result of crustal stability rather than climatic \nregime. \nThe role of temperature as the control on Late Cenozoic fluvial activity may seem counter-\nintuitive, given the importance of precipitation, through its effect on discharge, in riverine \nprocesses.  The importance of temperature, however, is first its influence on vegetation cover, \nwhich dictates the level of slope stability and thus bedload supply, and second its role in the \nperiodic growth and decay of permafrost. In both respects this influence might be expected to \ndecline with decreasing latitude, with lessening of the severity of the cold parts of climate \ncycles.  However, there are indications that temperature is a controlling factor in areas well \nPage 37; Bridgland & Westaway; 18\/03\/2008 \nbeyond the reach of the Quaternary glaciations; it has, for example, been invoked as \nsignificant in the Mediterranean region (Macklin et al., 2002; Martrat et al., 2004).  The \nrelation between the interglacial marine terraces of NW Syria and the fluvial terraces of the \nKebir has already been noted (above) as evidence that the latter formed during cold stages, \nwhich implies that temperature can be the dominant influence as far south as the \nMediterranean regions.  A further important question is whether global temperature and \nhumidity fluctuations during the Quaternary have been in phase (cf. Nanson et al., 1992); if \ntemperature and humidity have been covariant during the last climatic cycle in Europe, their \nindividual effects will be difficult to isolate. \nIt is generally believed that Quaternary temperature fluctuations have been considerably less \nsevere in lower latitudes, although Milankovitch-driven fluctuations in humidity provide an \nalternative triggering system in such areas.  Examples of terrace sequences in tropical regions \nfor which aridity\/humidity cycles are envisaged as principal forcing factors include the \nAmazon, in Brazil (Latrubesse et al., 1997), and the Niger, in the Niger Republic (e.g. Dubois \net al., 1984; Oussini and Morel, 1989).  Some systems in temperate regions might also be \nmore susceptible to fluctuations of humidity, with its effect on discharge and vegetation \ndensity, than of temperature.  Indeed, this type of forcing has been invoked for the eastern \nMediterranean, where it has been linked to fluctuations in the strength of the Indian Ocean \nmonsoon (e.g., Rossignol-Strick, 1985, 1999; Kroon et al., 1998).  Similarly, aridity\/humidity \ncycles are believed to be of considerable importance in Australia, set against a background of \nincreasing aridity since the mid-Pleistocene (cf. Nanson et al., 1992, 1995, 1998). \n \n5. Conclusions \nThe IGCP data confirm that aggradational river terraces, which dominate the long-timescale \nQuaternary fluvial record worldwide, result from the combined effects of progressive surface \nuplift and the cyclic climatic triggering of fluvial activity.  Vertical disposition patterns vary \naccording to crustal province rather than climatic zone, despite the importance of climatic \nfactors and their influence, via vegetation, on landscape stability and, therefore, sediment \nsupply.  Previous received wisdom that terraces have not formed in the tropics is wrong; they \noccur wherever there is relatively young uplifting crust, although the climatic triggering may \ndiffer in contrasting climatic zones and may be stronger in some than in others.  Another \nPage 38; Bridgland & Westaway; 18\/03\/2008 \nimportant difference between terrace records is in the numbers of terraces per climate cycle.  \nMid-late Quaternary systems with more than, less than and approximately one terrace per 100 \nky cycle can all be observed.  Where there are fewer terraces than cycles, it is likely that only \nthe major events are represented; where there are more it is uncertain whether forcing is \nrelated to MIS subcycles or to both cooling-limb and warming-limb forcing.  In sequences \nwith just one terrace per 100 ky cycle, the varying stratigraphical position of interglacial \nsediments within individual terrace ‘treads’ suggests that examples exist of both warming- \nand cooling-limb forcing of incision.  Despite the importance of precipitation in controlling \nfluvial processes, it would seem that temperature fluctuations are the key forcing factor, with \nthe role of varying humidity yet to be demonstrated. \n \nAcknowledgements \nThis paper represents a contribution to IGCP 518 ‘Fluvial sequences as evidence for \nlandscape and climatic evolution in the Late Cenozoic’.  The numerous contributors to the \nprevious project (IGCP 449) are acknowledged by citation of their publications.  This paper \nhas benefited from thorough and constructive reviews by Pierre Antoine and Alain Demoulin, \nwhose efforts are gratefully acknowledged. \n \nReferences  \nAlekseev, M.N., Drouchits, V.A., 2004. Quaternary fluvial sediments; structure, distribution \nand genetic conditions in the Russian Arctic and Subarctic. Proceedings of the \nGeologists’ Association 115, 339-346. \nAntoine, P., 1994. The Somme Valley terrace system (northern France); a model of river \nresponse to Quaternary climatic variations since 800 000 BP. Terra Nova 6, 453-464. \nAntoine P, Limondin-Lozouet N. 2004. Identification of MIS 11 Interglacial tufa deposit in \nthe Somme valley (France): new results from the Saint-Acheul fluvial sequence. \nQuaternaire 15, 41-52. \nAntoine, P., Lautridou, J.P., Laurent, M. 2000. Long-term fluvial archives in NW France: \nresponse of the Seine and Somme rivers to tectonic movements, climate variations and \nsea-level changes. Geomorphology 33, 183-207. \nAntoine, P., Auguste, P., Bahain, J.J., Coudret, P., Depaepe, P., Fagnart, J.P., Falgueres, C., \nFontugne, M., Frechen, M., Hatté, C., Lamotte, M., Laurent, M., Limondin-Lozouet, N., \nLocht, J.L., Mercier, N., Moigne, A.M., Munaut, A.V., Ponel, P., Rousseau, D.D. 2003. \nPaléoenvironnements pléistocènes et peuplements paléolithiques dans le bassin de la \nSomme (Nord de la France). Bulletin de la Société préhistorique Française 100, 5-28. \nAntoine, P., Limondin-Lozouet, N., Chaussé, C., Lautridou, J.-P., Pastre, J.-F., Auguste, P., \nBahain, J.J., Falguères, C., Galehb, B., in press. Pleistocene fluvial terraces from \nnorthern France (Seine, Yonne, Somme): synthesis and new results. Quaternary Science \nReviews. \nArger, J., Mitchell, J., Westaway, R., 2000. Neogene and Quaternary volcanism of south-\nPage 39; Bridgland & Westaway; 18\/03\/2008 \neastern Turkey, In: Bozkurt, E., Winchester, J.A., Piper, J.D.A. (Eds.), Tectonics and \nMagmatism of Turkey and the Surrounding Area: Geological Society, London, Special \nPublication 173, pp. 459-487. \nBaker, F., Rundell, J., Hasebi, K., Cole, R., Aslan, A., 2002. Geomorphic evolution of Grand \nMesa, western Colorado. Geological Society of America, 2002 annual meeting, \nAbstracts with Programs, 34 (6), 472 (abstract). \nBaker, S.E., Gosse, J.C., 2003. Quaternary bedrock incision history of the Rio Diamante, \nMendoza Province, Argentina. Geological Society of America, 2003 annual meeting \nAbstracts with Programs 35 (6), 63. \nBar-Yosef, O., 1998. Early colonizations and cultural continuities in the Lower Palaeolithic of \nwestern Asia. In: Petraglia, M.D., Korisettar, R. (Eds.), Early Human Behaviour in \nGlobal Context. Routledge, London, pp. 221-279. \nBeard, J.S., 1998. Position and developmental history of the central watershed of the Western \nShield, Western Australia. Journal of the Royal Society of Western Australia 81, 157–\n164. \nBeaudet, G., Coque, R., Michel, P., Rognon, P., 1981. Reliefs cuirassés et évolution \ngéomorphlogique des régions orientales du Mali. 1. La région du Tilemsi et la vallée du \nNiger de Taoussa à Gao. Zeitschrift für Geomorphologie, N.F., Supplement 38, 38-62. \nBergoeing, J.P., Gilliard, P., 1997. Géomorphologie des terrasses du Fleuve Niger à la latitude \ndu Parc National du W, Niger. Zeitschrift für Geomorphologie, N.F. 41, 491-504. \nBesançon, J., Sanlaville, P., 1984. Terrasses fluviatiles au Proche-Orient. Bulletin de \nl’Association Française pour l’Étude du Quaternaire 21, 186-191. \nBesançon, J., Sanlaville, P., 1993. La vallée de l’Oronte entre Rastane et Aacharné. In: \nSanlaville, P., Besançon, J., Copeland, L., Muhesen, S. (Eds.), Le Paléolithique de la \nvallée moyenne de l’Oronte (Syrie): Peuplement et environnement. British \nArchaeological Review, International Series 587, 13-39. \nBesançon, J., Copeland, L., Hours, F., Sanlaville, P., 1978. The Palaeolithic sequence in \nQuaternary formations of the Orontes river valley, northern Syria: a preliminary report. \nBulletin of the Institute of Archaeology, London 15 149-170. \nBibus, E., Semmel, A., 1977. Über die Auswirkung quartärer Tektonik auf die altpleistozänen \nMittelrhein Terrassen. Catena 4, 385-408. \nBlum, M.D., Guccione, M.J., Wysocki, D., Robnett, P.C., 2000. Late Pleistocene evolution of \nthe southern Mississippi Valley, southern Missouri to Arkansas. Geological Society of \nAmerica Bulletin 112, 221-235. \nBlum, M.D., Straffin, E.C., 2001. Fluvial responses to external forcing: examples from the \nFrench Massif Central, the Texas Coastal Plain (USA), the Sahara of Tunisia, and the \nlower Mississippi Valley (USA). In: Maddy, D., Macklin, M., Woodward, J. (Eds.), \nRiver Basin Sediment Systems: Archives of Environmental Change. Balkema, \nRotterdam, pp. 195-228. \nBourdier, F., 1968. Les caractéristiques pédologiques des glaciations quaternaires de la \nBièvre-Valloire. Excursions Sous-Commission INQUA pour la stratigraphie du \nQuaternaire européen, 9-10 May 1968. 12 pp. \nBourdier, F. (Ed.), 1974. Quaternaire et Paléolithique des Bassins de la Somme et de la Base-\nSeine. Bulletin de l‘Association Française pour l’étude du Quaternaire 40-41, 273pp. \nBraga, J.C., Martín, J.M., Quesada, C., 2003. Patterns and average rates of Late Neogene – \nRecent uplift of the Betic Cordillera, SE Spain. Geomorphology 50, 3-26. \nBriant, R.M., Bates, M.R., Schwenninger, J-L., Wenban-Smith, F. 2006. An optically \nstimulated luminescence dated Middle to Late Pleistocene fluvial sequence from the \nwestern Solent Basin, southern England. Journal of Quaternary Science 21, 507–523. \nBridgland, D.R. 1994. Quaternary of the Thames. Chapman & Hall, London, 441 pp. \nPage 40; Bridgland & Westaway; 18\/03\/2008 \nBridgland, D.R. 2000. River terrace systems in north-west Europe: an archive of \nenvironmental change, uplift and early human occupation. Quaternary Science Reviews \n19, 1293-1303. \nBridgland, D.R. 2001.  The Pleistocene evolution and Palaeolithic occupation of the Solent \nRiver. In: Wenban-Smith, F.F., Hosfield, R.T. (Eds.) Palaeolithic archaeology of the \nSolent River. Lithic Studies Society Occasional Paper 7. Lithic Studies Society, London, \npp. 15-25. \nBridgland, D.R., 2006. The Middle and Upper Pleistocene sequence in the Lower Thames: a \nrecord of Milankovitch climatic fluctuation and early human occupation of southern \nBritain. Proc. Geol. Assoc. 117, 281-305. \nBridgland, D.R., Schreve, D.C., 2001. River terrace formation in synchrony with long-term \nclimatic fluctuation: supporting mammalian evidence from southern Britain. In: Maddy, \nD., Macklin, M., Woodward, J. (Eds.), River Basin Sediment Systems: Archives of \nEnvironmental Change. Balkema, Abingdon, England, p. 229-248. \nBridgland, D.R., Schreve, D.C. 2004. Quaternary lithostratigraphy and mammalian \nbiostratigraphy of the Lower Thames terrace system, south-east England. Quaternaire \n15, 29-40. \nBridgland, D.R., Philip, G., Westaway, R., White, M. 2003. A long Quaternary terrace \nsequence in the Orontes River valley, Syria: a record of uplift and of human occupation. \nCurrent Science (New Delhi) 84, 1080-1089. \nBridgland, D.R., Maddy, D., Bates, M. 2004a. River terrace sequences: templates for \nQuaternary geochronology and marine-terrestrial correlation. Journal of Quaternary \nScience 19, 203-218. \nBridgland, D.R., Schreve, D.C., Keen, D.H., Meyrick, R., Westaway, R., 2004b. \nBiostratigraphical correlation between the late Quaternary sequence of the Lower \nThames and key fluvial localities in central Germany. Proceedings of the Geologists’ \nAssociation 115, 125-140. \nBridgland, D.R., Antoine, P., Limondin-Lozouet, N., Santisteban, J.I., Westaway, R., White, \nM.J., 2006. The Palaeolithic occupation of Europe as revealed by evidence from the \nrivers: data from IGCP 449. Journal of Quaternary Science 21, 437-455. \nBrown, C.M., Radke, B.M., 1989. Stratigraphy and sedimentology of the Mid-Tertiary \npermeability barriers in the subsurface of the Murray Basin. BMR Journal of Australian \nGeology and Geophysics 11, 367-385. \nBrunotte, E., 1983. Zur allochtonen Formung quartärer Fußflächen in Bolsonen W-\nArgentiniens. Zeitschrift für Geomorphologie, N.F., Supplement 48, 203-212. \nBryant, B., Kunk, M.J.; Kirkham, R.M., 2002. Timing and rates of late Cenozoic incision by \nthe Colorado River in Glenwood Canyon, Colorado. Geological Society of America, \n2002 annual meeting, Abstracts with Programs, 34 (6), 320-321 (abstract). \nBüdel, J. 1977. Klima-Geomorphologie. Gebrüder Borntraeger, Berlin. \nBüdel, J. 1982. Climatic Geomorphology. English translation by Fischer, L. Busche, D. \nPrinceton University Press, Princeton, NJ, 443pp. \nBull, W.B., 1991. Geomorphic Responses to Climatic Change. Oxford University Press, \nOxford, 326pp. \nBull, W.B., Kneupfer, P.L.K., 1987. Adjustments by the Charwell River, New Zealand, to \nuplift and climatic changes. Geomorphology 1, 15-32. \nBunbury, J.M., Hall, L., Anderson, G.J., Stannard, A., 2001. The determination of fault \nmovement history from the interaction of local drainage with volcanic episodes. \nGeological Magazine 138, 185-192. \nButzer, K., Helgren, D., Fock, G., Stuckenrath, R., 1973. Alluvial terraces of the lower Vaal \nRiver, South Africa: A reappraisal and reinvestigation. Journal of Geology 81, 341-362. \nPage 41; Bridgland & Westaway; 18\/03\/2008 \nChaussé, C., Voinchet, P., Bahain, J.-J., Connet, N., Lhomme, V., Limondin-Lozouet, N., \n2004. Middle and upper Pleistocene evolution of the River Yonne valley (France); first \nresults. Quaternaire 15, 53-64. \nChekunov, A.V., Garvish, V.K., Kutas, R.I., Ryabchun, L.I., 1992. Dnieper-Donets paleorift. \nTectonophysics 208, 257-272. \nClet-Pellerin, M., Occhietti, S., 2000. Pleistocene palynostratigraphy in the St. Lawrence \nValley and middle estuary. Quaternary International 68-71, 39-57. \nCloetingh, S.A.P.L., Ziegler, P.A., Beekman, F., Andriessen, P.A.M., Matenco, L., Bada, G., \nGarcia-Castellanos, D., Hardebol, N., Dezes, P., Sokoutis, D., 2005. Lithospheric \nmemory, state of stress and rheology: neotectonic controls on Europe's intraplate \ncontinental topography. Quaternary Science Reviews 24, 241-304. \nCopeland, L., Hours, F., 1993. The Middle Orontes paleolithic flint industries. In: Sanlaville, \nP., Besançon, J., Copeland, L., Muhesen, S. (Eds.), Le Paléolithique de la vallée \nmoyenne de l’Oronte (Syrie): Peuplement et environnement. British Archaeological \nReview, International Series 587, 63-144. \nCordier, S., Harmand, D., Losson, B., Beiner, M. 2004. Alluviation of the Meurthe and \nMoselle valleys (Eastern Paris Basin, France): lithological contribution to the study of \nthe Moselle capture and Pleistocene climatic fluctuations. Quaternaire 15, 65-76. \nCordier, S., Harmand, D., Frechen, M., Beiner, M. 2006. Fluvial system response to Middle \nand Upper Pleistocene climate change in the Meurthe and Moselle valleys (Eastern Paris \nBasin and Rhenish Massif). Quaternary Science Reviews 25, 1460-1474. \nDamon, P.E., Shafiqullah, M., Leventhal, J.S., 1974. K-Ar chronology for the San Francisco \nvolcanic field and rate of erosion of the Little Colorado River. In: Karlstrom, T.N.V., \nSwann, G.A., Eastwood, R.L. (Eds.), Geology of Northern Arizona with Notes on \nArcheology and Paleoclimate: Part 1, Regional Studies. Geological Society of America, \nRocky Mountain Section, 27th Annual Meeting, Flagstaff, Arizona, pp. 221-235. \nDe Mets, C., Gordon, R.G., Argus, D.F., Stein, S., 1994. Effect of recent revision to the \ngeomagnetic reversal time scale on estimates of current plate motions. Geophysical \nResearch Letters 21, 2191-2194. \nDemir, T., Yeşilnacar, Đ, Westaway, R., 2004. River terrace sequences in Turkey: sources of \nevidence for lateral variations in regional uplift. Proceedings of the Geologists’ \nAssociation 115, 289-311. \nDespriée, J., Gageonnet, R., Voinchet, P., Bahain, J-J., Falguères, C., Duvialard, J., Varache, \nF. 2004. Pleistocene fluviatile systems of the Creuse river (Middle Loire basin - Centre \nregion (France). Quaternaire 15, 77-86. \nDethier, D.P., Schildgen, T., Bierman, P., Caffee, M., 2001. Cosmogenic analysis of the \nRocky Flats alluvium near Boulder, Colorado. Geological Society of America, 2001 \nannual meeting, Abstracts with Programs 33 (6), 312-313.  \nDe Wit, M.C.J. 2004. The diamondiferous sediments on the farm Nooitgedacht (66), \nKimberley, South Africa. South African Journal of Geology 107, 477-488.  \nDe Wit, M.C.J., Ward, J.D., Jacob, J.R., 1997. Diamond-bearing deposits of the Vaal-Orange \nriver system. Field Excursion Guidebook, 6th International Conference on Fluvial \nSedimentology, University of Cape Town, September 1997, vol. 2, p. 1-61. \nDodonov, A.E., Deviatkin, E.V., Ranov, V.A., Khatib, K., Nseir, H., 1993. The Latamne \nFormation in the Orontes river valley. In: Sanlaville, P., Besançon, J., Copeland, L., \nMuhesen, S. (Eds.), Le Paléolithique de la vallée moyenne de l’Oronte (Syrie): \nPeuplement et environnement. British Archaeological Reports, International Series 587, \n189-194. \nDingle, B.V., Hendey, Q.B., 1984. Mesozoic and Tertiary sediment supply to the western \nCape Basin and palaeodrainage systems in south-western Africa. Marine Geology 56, \nPage 42; Bridgland & Westaway; 18\/03\/2008 \n13-26. \nDubois, D., Icole, M., Trichet, J., 1984. Évolution géomorphologique de la vallée du Niger \naux abords de Niamey (République du Niger). Bull. Soc. Géol. Fr., ser. 7, 26, 1305-\n1318. \nDurrheim, R.J., Mooney, W.D., 1991. Archean and Proterozoic crustal evolution; evidence \nfrom crustal seismology, Geology 19, 606-609.  \nDurrheim, R.J., Mooney, W.D., 1994. Evolution of the Precambrian litrhosphere: \nseismological and geochemical constraints.  J. Geophys. Res. 99, 15359-15374. \nEspizua, L.E., 2000. Quaternary glacial sequence in the Río Mendoza valley, Argentina. In: \nSmolka, P., Volkheimer, W. (Eds.), Southern Hemisphere Paleo- and Neoclimates: Key \nSites, Methods, Data and Models. Springer-Verlag, Berlin, pp. 287-293. \nFisk, H.N. 1951. Loess and Quaternary geology of the Lower Mississippi Valley. Journal of \nGeology 59, 333-356. \nGansecki, C.A., Mahood, G.A., McWilliams, M., 1998. New ages for climactic eruptions at \nYellowstone: single-crystal 40Ar\/39Ar dating identifies contamination. Geology 26, 343-\n346. \nGarhart, A., Aslan, A., Betton, C.W., 2003. Origin of late Cenozoic lacustrine deposits on the \nUncompahgre Plateau of western Colorado. Geological Society of America, 2003 \nannual meeting, Abstracts with Programs 35 (6), 170. \nGarleff, K., Stingl, H., Lambert, K.-H., 1983. Flußflächen- und Terrassentreppen im \nEinzugsbereich des oberen Río Neuquén, Argentinien. Zeitschrift für Geomorphologie, \nN.F., Supplement 48, 247-259.  \nGarvin, C.D., Hanks, T.C., Finkel, R.C., Heimsath, A.M., 2005. Episodic incision of the \nColorado River in Glen Canyon, Utah. Earth Surface Processes and Landforms 30, 973-\n984. \nGibbard, P.L., 1985. The Pleistocene history of the Middle Thames Valley. Cambridge \nUniversity Press, Cambridge, 155pp. \nGibbard, P.L., 1994. Pleistocene History of the Lower Thames Valley. Cambridge University \nPress, Cambridge, 229 pp. \nGosse, J.C., Baker, S., Pazzaglia, F., Brandon, M.T., Karlstrom, K., Pederson, J., Finkel, R.C., \n2005. Five ways to examine what isn't there with cosmogenic isotopes. Abstracts of the \n15th annual V.M. Goldschmidt conference, Moscow, Idaho, May 2005. Geochimica et \nCosmochimica Acta 69 (10), 163. \nGrosso, S.A., Corte, A.E., 1989. Pleistocene ice wedge casts at 34° S, eastern Andes \npiedmont, south-west of South America. Geografiska Annaler A 71, 125-136. \nGreen, C.P., McGregor, D.F.W. 1980. Quaternary evolution of the River Thames. In: Jones, \nD.K.C. (Ed.), The Shaping of Southern England, Institute of British Geographers \nSpecial Publication 11, Academic Press, London, pp. 177 202. \nGreen, C.P., McGregor, D.F.W. 1987. River terraces: a stratigraphical record of \nenvironmental change. In: Gardiner, V. (Ed.), International Geomorphology 1986 Part \n1., Wiley, Chichester, pp. 977-987. \nHanks, T.C., Blair, J.L., 2003. Differential incision of the Grand Canyon related to \nQuaternary faulting—Constraints from U-series and Ar\/Ar dating: comment. Geology \nOnline Forum, p. e16–e17 (published online; doi: 10.1130\/0091-\n7613(2003)31<e16:DIOTGC>2.0.CO;2). \nHansen, W.R., 1987. The Black Canyon of the Gunnison - in depth. Southwest Parks and \nMonuments Association, Tucson, Arizona, 58 pp. \nHarvey, A.M., Wells, S.G., 1987. Response of Quaternary fluvial systems to differential \nepeirogenic uplift: Aguas and Feos river systems, southeast Spain. Geology 15, 689-\n693. \nPage 43; Bridgland & Westaway; 18\/03\/2008 \nHattingh, J., 1994. Depositional environment of some gravel terraces in the Sundays River \nvalley, Eastern Cap. South African Journal of Geology 97, 156-166. \nHattingh, J., Goedhart, M.L., 1997. Neotectonic control on drainage evolution in the Algoa \nBasin, southeastern Cape Province. South African Journal of Geology 100, 43-52.  \nHattingh, J., Rust, I., 1999. Drainage evolution and morphological development of the late \nCenozoic Sundays River, South Africa. In: Miller, A., Gupta, A. (Eds.), Varieties of \nFluvial Form. International Association of Geomorphologists Geomorphology \nPublication 7, pp. 145-166. \nHeller, P.L., Dueker, K., McMillan, M.E., 2003. Post-Paleozoic alluvial gravel transport as \nevidence of continental tilting in the U.S. Cordillera. Geological Society of America \nBulletin 115, 1122-1132. \nHelgren, D.M., 1977. Geological context of the Vaal River faunas. South African Journal of \nScience 73, 303-307. \nHelgren, D.M., 1978. Acheulian settlement along the lower Vaal River, South Africa. Journal \nof Archaeological Science 5, 39-60. \nHoward, A.J., Macklin, M.G., Bailey, D.W., Mills, S., Andreescu, R. 2004. Late-glacial and \nHolocene river development in the Teleorman Valley on the southern Romanian Plain. \nJournal of Quaternary Science 19, 271-280. \nHuntley, D.J., Hutton, J.T., Prescott, J.R., 1993. The stranded beach-dune sequence of south-\neast South Australia: A test of thermoluminescence dating, 0-800 ka. Quaternary \nScience Reviews, 12, 1-20. \nHuntley, D.J., Hutton, J.T., Prescott, J.R., 1994. Further thermoluminescence dates from the \ndune sequence in the south-east of South Australia. Quaternary Science Reviews 13, \n201-207. \nJain, M., Tandon, S.K. 2003. Fluvial response to Quaternary climate change, western India, \nQuaternary Science Reviews 22, 2223-2235. \nJain, M., Tandon S.K., Bhatt, S.C., Singhvi, A.K., Mishra, S., 1999. Alluvial and aeolian \nsequences along the River Luni, Barmer District: physical stratigraphy and feasibility of \nluminescence chronology methods. Memoirs of the Geological Society of India 42, 273-\n295. \nJain, M., Murray, A.S., Bøtter-Jensen, L. 2004. Optically stimulated luminescence dating: \nHow significant is incomplete light exposure in fluvial environments. Quaternaire 15, \n143-157. \nKarlstrom, K.E., 2005. Influences of Quaternary tectonism on the profile and incision history \nof the Colorado River system of the Southwestern U.S.. Geological Society of America, \nRocky Mountain Section, 57th annual meeting, Abstracts with Programs, 37 (6), 15 \n(abstract). \nKarner, D.B., Marra, F., 1998. Correlation of fluviodeltaic aggradational sections with glacial \nclimate history: a revision of the Pleistocene stratigraphy of Rome. Geological Society \nof America Bulletin 110, 748-758. \nKellogg, K.S., 2004. The geologic story of the Gunnison Gorge National Copnservation Area, \nColorado. U.S. Geological Survey Professional Paper 1699, 50 pp. \nKershaw, A.P., Nanson, G.C., 1993. The last full glacial cycle in the Australian region. \nGlobal and Planetary Change 7, 1-9. \nKiden, P., T.E. Törnqvist, 1998. Can river terrace flights be used to quantify Quaternary \ntectonic uplift rates? Journal of Quaternary Science 13, 573-574. \nKroon, D., Alexander, I., Little, M., Lourens, L.J., Matthewson, A., Robertson, A.H.F., \nSakamoto, T., 1998. Oxygen isotope and sapropel stratigraphy in the Eastern \nMediterranean during the last 3.2 million years. Proceedings of the Ocean Drilling \nProgram, Scientific Results 160, 181-189. \nPage 44; Bridgland & Westaway; 18\/03\/2008 \nKrzyszkowski, D. Przybylski, B, Badura, J. 2000. The role of neotectonics and glaciations \nalong the Nysa-Klodzka River in the Sudeten Mountains (southwestern Poland). \nGeomorphology 33, 149-166. \nKukla, G.J., 1975. Loess stratigraphy of Central Europe. In: Butzer, K.W., Isaac, G.L. (Eds.), \nAfter the Australopithecines: Stratigraphy, Ecology and Culture Change in the Middle \nPleistocene. Mouton, The Hague, pp. 99-188.  \nKukla, G.J., 1977. Pleistocene land-sea correlations. I. Europe. Earth Science Reviews 13, \n307-374.  \nKukla, G.J., 1978. The classical European glacial stages: correlation with deep-sea sediments. \nTransactions of the Nebraska Academy of. Science 6, 57-93. \nKukla, G. 2005. Saalian supercycle, Mindel\/Riss interglacial and Milankovitch’s dating. \nQuaternary Science Reviews 24, 1573-1583. \nLatrubesse, E.M. 2002. Evidence of Quaternary palaeohydrological changes in Middle \nAmazonia: the Aripuaña-Roosvelt and Jiparaná “fans”. Zeitschrift fur Geomorphologie \n129, 61-72. \nLatrubesse, E.M., Rancy, A. 2000. Neotectonic influence on tropical rivers of southwestern \nAmazon during the late Quaternary: the Moa and Ipixuna river basins, Brazil. \nQuaternary International 72, 67-72. \nLatrubesse, E., Bocquentin, J., Santos, J.C.R., Ramonell, 1997. Paleoenvironmental model for \nthe Late Cenozoic of southwestern Amazonia: paleontology and geology. Acta \nAmazonica 27, 103-118. \nLeland, J., Reid, M. R., Burbank, D.W., Finkel, R., Caffee, M., 1998. Incision and differential \nbedrock uplift along the Indus River near Nanga Parbat, Pakistan Himalaya, from 10Be \nand 26Al exposure age dating of bedrock straths, Earth and Planetary Science Letters \n154, 93-107. \nLe Roux, F.G., 1989. The lithostratigraphy of Cenozoic deposits along the south-east Cape \ncoast as related to sea-level changes. MSc thesis, Stellenbosch University, South Africa, \n247 pp.  \nLe Roux, F.G., 1990. Palaeontological correlation of Cenozoic marine deposits of the \nsoutheastern, southern and western coasts, Cape Province. South African Journal of \nGeology 93, 514-518.    \nLindsey, D.A., Langer, W.H., Cummings, L.S., Shary, J.F., 1998. Gravel deposits of the \nSouth Platte River valley north of Denver, Colorado. Part A: Stratigraphy and \nsedimentary structures. U.S. Geological Survey Open-File Report 98-148-A, 22pp. \nLucchitta, I., Curtiss, G.H., Davis, M.E., Davis, S.W., Turrin, B., 2000. Cyclic aggradation \nand downcutting, fluvial response to volcanic activity, and calibration of soil-carbonate \nstages in the western Grand Canyon, Arizona. Quaternary Research 53, 23-33. \nMacklin, M.G., Fuller, I.C., Lewin, J., Maas, G.S., Passmore, D.G., Rose, J., Woodward, J.C., \nBlack, S., Hamlin, R.H.B., Rowan, J.S., 2002. Correlation of fluvial sequences in the \nMediterranean basin over the last 200 ka and their relationship to climate change. \nQuaternary Science Reviews 21, 1633-1641. \nMaddy, D., 1997. Uplift-driven valley incision and river terrace formation in southern \nEngland. Journal of Quaternary Science 12, 539-545. \nMaddy, D., Bridgland, D.R., Green, C.P., 2000. Crustal uplift in southern England; evidence \nfrom the river terrace records. Geomorphology 33, 167-181. \nMaddy, D., Keen, D.H., Bridgland, D.R., Green, C.P., 1991. A revised model for the \nPleistocene development of the River Avon, Warwickshire. Journal of the Geological \nSociety, London 148, 473-484. \nMaddy, D., Demir, T., Bridgland, D.R., Veldkamp, A., Stemerdink, C., Van der Schriek, T., \nWestaway, R. 2005. An obliquity-controlled Early Pleistocene river terrace record from \nPage 45; Bridgland & Westaway; 18\/03\/2008 \nweatern Turkey? Quaternary Research 63, 339-346. \nMania, D., 1995. The earliest occupation of Europe: the Elbe-Saala region (Germany). In: \nRoebroeks, W., Van Kolfschoten, T. (Eds.), The Earliest Occupation of Europe. \nUniversity of Leiden, The Netherlands, pp 85-101. \nMartrat, B., Grimalt, J.O., Lopez-Martinez, C., Cacho, I., Sierro, F.J., Flores, J.A., Zahn, R., \nCanals, M., Curtis, J.A., Hodell, D.A., 2004. Abrupt temperature changes in the western \nMediterranean over the past 250,000 years. Science 306, 1762-1765. \nMather, A.E., Stokes, M., 2003. Long-term landscape development in southern Spain. \nGeomorphology 50, 1-2. \nMatoshko, A.V., Gozhik, P.F., Ivchenko A.S. 2002 The fluvial archive of the Middle and \nLower Dnieper (a review). Netherlands Journal of Geosciences 81, 339-355. \nMatoshko, A., Gozhik, P., Danukalova, G., 2004. Key Late Cenozoic fluvial archives of \neastern Europe: the Dniester, Dnieper, Don and Volga: Proceedings of the Geologists’ \nAssociation 115, 141-173. \nMaud, R.R., 1968. Quaternary geomorphology and soil formation in coastal Natal. Zeitschrift \nfür Geomorphologie, N.F., Supplement 7, 155-199. \nMcCave, I.N., 1969. Correlation of marine and nonmarine strata with example from the \nDevonian of New York state. American Association of Petroleum Geologists Bulletin \n53, 155-162. \nMcMillan, I.K., 1990. A foraminiferal biostratigraphy and chronostratigraphy for the Pliocene \nto Pleistocene Upper Algoa group, Eastern Cape, South Africa. South African Journal of \nGeology 93, 622-644. \nMcMillan, M.E., Angevine, C.L., Heller, P.L., 2002. Postdepositional tilt of the Miocene-\nPliocene Ogallala Group on the western Great Plains: Evidence of Late Cenozoic uplift \nof the Rocky Mountains. Geology 30, 63-66. \nMeyer, W., Stets, J., 1998. Junge Tektonik im Rheinischen Schiefergebirge und ihre \nQuantifizierung. Zeitschrift der Deutschen Geologischen Gesellschaft 149, 359-379. \nMishra, S., 1995. Prehistoric and Quaternary Studies at Nevasa: The Last Forty Years. \nMemoirs of the Geological Society of India 32, 324-332. \nMitchell, J., Westaway, R., 1999. Chronology of Neogene and Quaternary uplift and \nmagmatism in the Caucasus: Constraints from K-Ar dating of volcanism in Armenia, \nTectonophysics 304, 157-186. \nMuhesen, S., 1993. L’Acheuléan recent évolué de l’Oronte. In: Sanlaville, P., Besançon, J., \nCopeland, L., Muhesen, S. (Eds.), Le Paléolithique de la vallée moyenne de l’Oronte \n(Syrie): Peuplement et environnement. British Archaeological Reports, International \nSeries 587, 145-166. \nMurray-Wallace, C.V. 2002. Pleistocene coastal stratigraphy, sea-level highstands and \nneotectonism of the southern Australian passive continental margin - a review. Journal \nof Quaternary Science 17, 469-489. \nMurray-Wallace, C.V., Belperio, A.P., Cann, J.H., Huntley, D.J., Prescott, J.R., 1996. Late \nQuaternary uplift history, Mount Gambier region, South Australia. Zeitschrift für \nGeomorphologie, N.F., Supplement 106, 41-56. \nNanson, G.C., Price, D.M., 1998. Quaternary change in the Lake Eyre Basin of Australia; an \nintroduction. Palaeogeography, Palaeoclimatology, Palaeoecology 144, 235-237. \nNanson, G.C., Price, D.M., Short, S.A.  1992. Wetting and drying of Australia over the past \n300 ka. Geology 20, 791-794. \nNanson, G.C., Chen, X. Y., Price, D.M. 1995. Aeolian and fluvial evidence of changing \nclimate and wind patterns during the past 100 ka in the western Simpson Desert, \nAustralia. Palaeogeography, Palaeoclimatology, Palaeoecology 113, 87-102. \nNanson, G.C., Callen, R.A., Price, D.M. 1998. Hydroclimatic interpretation of Quaternary \nPage 46; Bridgland & Westaway; 18\/03\/2008 \nshorelines on South Australian playas. Palaeogeography, Palaeoclimatology, \nPalaeoecology 144, 281-305. \nNikishin, A.M., Ziegler, P.A., Stephenson, R., Cloetingh, S., Furne, A.V., Fokin, P.A., \nErshov, A.V., Bolotov, S.N., Korotaev, A.S., Alekseev, A.S., Gorbachev, V.I., Shipilov, \nE.V., Lankreijer, A., Shalimov, I.V., 1996. Late Precambrian to Triassic history of the \nEast-European Craton: Dynamics of Basin Evolution. Tectonophysics 268, 23-63. \nNikishin, A.M., Brunet, M.F., Cloetingh, S., Ershov, A.V., 1997. Northern peri-Tethyan \nCenozoic intraplate deformations; influence of the Tethyan collision belt on the \nEurasian continent from Paris to Tian-Shan. Comptes Rendus de l'Academie des \nSciences, Paris, Series IIa 324, 49-57. \nNott, J.F., 1992. Long-term drainage evolution in the Shoalhaven catchment, southeast \nhighlands, Australia. Earth Surface Processes and Landforms 17, 361-374. \nNott, J.F., Price, D., Nanson, G., 2002. Stream response to Quaternary climate change: \nevidence from the Shoalhaven River catchment, southeastern highlands, temperate \nAustralia. Quaternary Science Reviews 21, 965-974. \nOsterkamp, W.R., Fenton, M.M., Gustavson, T.C., Hadley, R.F., Holliday, V.T., Morrison, \nR.B., Toy, T.J., 1987. Great Plains. In: Graf, W.L. (Ed.), Geomorphic Systems of North \nAmerica, Centennial Special Volume 2. Geological Society of America, Boulder, \nColorado, pp. 163-210. \nOusseini, I., Morel. A., 1989. Utilisation de formations alluviales azoïques pour l’étude des \npaléoenvironnements du Pléistocène Supérieur et de l’Holocène au sud du Sahara: \nl’exemple de la vallée du Fleuve Niger dans le Liptako Nigérien. Bull. Soc. Géol. \nFrance, Series 8 5, 85-90. \nOzaner, F.S., 1992. Detecting the polycyclic drainage evolution in Kula region (western \nTurkey) using aerial photographs. ITC Journal [International Journal of Applied Earth \nObservation and Geoinformation] 1992-3, 249-253. \nPartridge, T.C, 1997. Late Neogene uplift in eastern and southern Africa and its paleoclimatic \nimplications. In: Ruddiman, W.F. (Ed.), Tectonic Uplift and Climate Change. Plenum \nPress, New York, pp. 63-86. \nPartridge, T.C., 1998. Of diamonds, dinosaurs and diastrophism: 150 million years of \nlandscape development in southern Africa. South African Journal of Geology 101, 167-\n184. \nPastre, J.F., 2004. The Perrier plateau; a Plio-Pleistocene long fluvial record in the River \nAllier basin, Massif central, France. Quaternaire 15, 87-101. \nPatyk-Kara, N.G., Postolenko, G.A., 2004. Structure and evolution of the Kolyma river \nvalley: from upper reaches to continental shelf. Proceedings of the Geologists’ \nAssociation 115, 325-338. \nPazzaglia, F.J., Gardner, T.W., 1994. Late Cenozoic flexural deformation of the middle U.S. \nAtlantic passive margin. Journal of Geophysical Research 99, 12143-12157. \nPederson, J.L.K., Sharp, W.D., McIntosh, W., 2002. Differential incision of the Grand \nCanyon related to Quaternary faulting; constraints from U-series and Ar\/Ar dating. \nGeology 30, 739-742. \nPederson, J., Karlstrom, K., Sharp, W., McIntosh, W., 2003. Differential incision of the Grand \nCanyon related to Quaternary faulting - Constraints from U-series and Ar\/Ar dating: \nreply. Geology Online Forum, p. e17 (published online; doi: 10.1130\/0091-\n7613(2003)31<e17:R>2.0.CO;2). \nRäsänen, M., Neller, R., Salo, J., Jungner, H., 1992. Recent and ancient fluvial deposition \nsystems in the Amazonian foreland basin, Peru. Geol. Mag. 129, 293-306. \nReed, E.C., Dreeszen, V.H., Bayne, C.K., Schultz, C.B., 1965. The Pleistocene in Nebraska \nand northern Kansas. In: Wright, Jr., H.E., Frey, D.G. (Eds.), The Quaternary of the \nPage 47; Bridgland & Westaway; 18\/03\/2008 \nUnited States Princeton University Press, Princeton, New Jersey, pp. 187-202. \nRose, J., Allen, P. 1977. Middle Pleistocene stratigraphy in south east Suffolk. Journal of the \nGeological Society, London 133, 83-102. \nRossignol-Strick, M., 1985. Mediterranean Quaternary sapropels, an immediate response of \nthe African monsoon to variations of insolation. Palaeogeography, Palaeoclimatology, \nPalaeoecology 49, 237-263. \nRossignol-Strick, M., 1999. The Holocene climatic optimum and pollen records of sapropel 1 \nin the eastern Mediterraneran, 9000-6000 BP. Quaternary Science Reviews 18, 515-530. \nSaid, R., 1981. The geological evolution of the River Nile. Springer-Verlag, New York, \n151pp. \nSaucier, R.T., 1996. Geomorphology and Quaternary geologic history of the Lower \nMississippi Valley. U.S. Army Corps of Engineers, Vicksburg, Mississippi, 364pp. \nSchildgen, T., Dethier, D.P., Bierman, P., Caffee, M., 2002. 26Al and 10Be dating of Late \nPleistocene and Holocene fill terraces: a record of fluvial deposition and incision, \nColorado Front Range. Earth Surface Processes and Landforms 27, 773-787. \nSchreve, D.C., Bridgland, D.R., 2002. Correlation of English and German Middle Pleistocene \nfluvial sequences based on mammalian biostratigraphy. Netherlands Journal of \nGeoscience 81, 357-373. \nSchulte, L., 2002. Quaternary Evolution of the Vera and eastern Sorbas Basin (SE Iberian \nPeninsula). A reconstruction of paleoclimatic fluctuations from morphological and \npedological studies. University of Barcelona Press, Barcelona, Spain, 251 pp. ISBN 84-\n475-2669-0 (in Spanish with English summary). \nSchulte, L., Gómez Ortiz, A., Passmore, D., 2000. Sobre los supuestos restos periglaciares \nPleistocenos en los llanos del sureste de la Península Ibérica. In: Peña, M., Sánchez-\nFabre, M., Lozano, M.V. (Eds.), Procesos y Formas Periglaciares en la Montaña \nMediterránea. Instituto de Estudios Turolenses, Teruel, Spain, pp. 281-297. \nSchulze, B.R., 1972. South Africa. In: Griffiths, J.F. (Ed.), Climates of Africa, World Survey \nof Climatology vol. 10. Elsevier, Amsterdam, pp. 501-586. \nScott, R.B., Steven, T.A., Betton, C.W., Cole, R.D., Aslan, A., Hood, W.C., 2002. Evidence \nfor late Cenozoic uplift on the Uncompahgre Plateau, northeastern Colorado Plateau. \nGeological Society of America, 2002 annual meeting, Abstracts with Programs 34 (6), \n322 (abstract). \nŞengör, A.M.C., Natal’in, B.A., Burtman, V.S., 1993. Evolution of the Altaid tectonic collage \nand Palaeozoic crustal growth in Eurasia. Nature 364, 299-307. \nSheard, M.J., 1990. A guide to the Quaternary volcanoes in the lower south-east of South \nAustralia. Mines and Energy Review, South Australia 157, 40-50. \nStarkel, L., 2003. Climatically controlled terraces in uplifting mountain areas. Quaternary \nScience Reviews 22, 2189-2198. \nStevenson, A.E., Brown, C.M., 1989. The ancient Murray river system. BMR Journal of \nAustralian Geology and Geophysics 11, 387-395. \nStern, C.R., Amini, H., Charrier, R., Godoy, E., Herve, A.F., Varela, J., 1984. Petrochemistry \nand age of rhyolitic pyroclastic flows which occur along the drainage valleys of the Rio \nMaipo and Rio Cachapoal (Chile) and the Rio Yaucha and Rio Papagayos (Argentina). \nRevista Geologica de Chile 23, 39-52. \nStokes, M., Mather, A.E., 2000. Response of Plio-Pleistocene alluvial systems to tectonically \ninduced base-level changes, Vera Basin, SE Spain. Journal of the Geological Society, \nLondon 157, 303-316. \nTankard, A.J., Rogers, J., 1978. Late Cenozoic palaeo-environments on the west coast of \nsouthern Africa. Journal of Biogeography 5, 319-337. \nTankard, A.J., Jackson, M.P.A., Eriksson, K.A., Hobday, D.K., Hunter, D.R., Minter, W.E.L., \nPage 48; Bridgland & Westaway; 18\/03\/2008 \n1982. Crustal evolution of southern Africa: 3.8 billion years of Earth history. Springer-\nVerlag, Berlin, 523 pp. \nTörnqvist, T.E. 1998. Longitudinal profile evolution of the Rhine Meuse system during the \nlast deglaciation: interplay of climate change and glacio eustasy? Terra Nova 10, 11-15. \nTyràček, J., 1983. River terraces – important paleoclimatic indicator. In: Billards, O., \nConchon, O., Shotton, F.W. (Eds.), Quaternary glaciations in the Northern Hemisphere. \nIGCP Project 73-1-24. Report No. 9, Unesco International Geological Correlation \nProgramme, Paris, pp. 34-41. \nTyràček, J., 1987. Terraces of the Euphrates River. Sbornik geologickych ved 18,185-202. \nTyráček, J., Westaway, R., Bridgland, D., 2004. River terraces of the Vltava and Labe (Elbe) \nsystem, Czech Republic, and their implications for the uplift history of the Bohemian \nMassif. Proceedings of the Geologists’ Association 115, 101-124. \nTyson, P.P., 1986. Climatic Change and Variability in Southern Africa. Oxford University \nPress, Oxford, 220 pp.  \nUbilla, M. 2004. Mammalian biostratigraphy of Pleistocene fluvial deposits in northern \nUruguay, South America. Proceedings of the Geologists’ Association 115, 347-357. \nvan den Berg, M.W. 1994. Neotectonics of the Roer Valley rift system. Style and rate of \ncrustal deformation inferred from syn-tectonic sedimentation. Geologie en Mijnbouw \n73, 143 156.  \nvan den Berg, M.W., van Hoof, T., 2001. The Maas terrace sequence at Maastricht, SE \nNetherlands: evidence for 200 m of late Neogene and Quaternary surface uplift. In: \nMaddy, D., Macklin, M.G., Woodward, J.C. (Eds.), River Basin Sediment Systems: \nArchives of Environmental Change. Balkema, Abingdon, England, pp. 45-86. \nVandenberghe, J., 1995. Timescales, climate and river development. Quaternary Science \nReviews 14, 631-638. \nVandenberghe, J., this volume \nVeldkamp, A., Buis, E., Olago, D.O., Boshoven, E.H., Marée, M., Gicheru, P.T., Wijbrans, J., \n2004. Quaternary fluvial terrace record of Tana River, Kenya. ICGP 449 Final Meeting, \nMalaga, Spain, Abstract Volume, p. 49. \nVeldkamp, A., Buis, E., Olago, D.O., Boshoven, E.H., Marée, M., Gicheru, P.T., Wijbrans, J., \nIn press. Late Cenozoic fluvial dynamics of the Tana river, Kenya, an uplift dominated \nrecord. Quaternary Science Reviews. \nWendlandt, E., DePaolo, D.J., Baldridge, W.S., 1993. Nd and Sr isotope chronostratigraphy \nof Colorado Plateau lithosphere; implications for magmatic and tectonic underplating of \nthe continental crust. Earth and Planetary Science Letters, 116, 23-43. \nWestaway, R., 1990. Present day kinematics of the plate boundary zone between Africa and \nEurope, from the Azores to the Aegean. Earth and Planetary Science Letters 96, 393-\n406. \nWestaway, R., 1998. Dependence of active normal fault dips on lower-crustal flow regimes, \nJournal of the Geological Society, London 155, 233-253. \nWestaway, R., 2001. Flow in the lower continental crust as a mechanism for the Quaternary \nuplift of the Rhenish Massif, north-west Europe. In: Maddy, D., Macklin, M., \nWoodward, J. (Eds.), River Basin Sediment Systems: Archives of Environmental \nChange. Balkema, Abingdon, England, pp. 87-167. \nWestaway, R., 2002a. Geomorphological consequences of weak lower continental crust, and \nits significance for studies of uplift, landscape evolution, and the interpretation of river \nterrace sequences. Netherlands Journal of Geosciences 81, 283-304. \nWestaway, R., 2002b. Long-term river terrace sequences: Evidence for global increases in \nsurface uplift rates in the Late Pliocene and early Middle Pleistocene caused by flow in \nthe lower continental crust induced by surface processes. Netherlands Journal of \nPage 49; Bridgland & Westaway; 18\/03\/2008 \nGeosciences 81, 305-328.    \nWestaway, R., 2002c. The Quaternary evolution of the Gulf of Corinth, central Greece: \ncoupling between surface processes and flow in the lower continental crust. \nTectonophysics 348, 269-318. \nWestaway, R., 2004. Kinematic consistency between the Dead Sea Fault Zone and the \nNeogene and Quaternary left-lateral faulting in SE Turkey. Tectonophysics 391, 203-\n237.  \nWestaway, R., 2006a. Late Cenozoic sedimentary sequences in Acre State, southwestern \nAmazonia: fluvial or tidal? Deductions from the IGCP 449 field trip. Journal of South \nAmerican Earth Sciences 21, 120–134. \nWestaway, R., 2006b. Investigation of coupling between surface processes and induced flow \nin the lower continental crust as a cause of intraplate seismicity. Earth Surface Processes \nand Landforms 31, 1480-1509.  \nWestaway, R., in press. Late Cenozoic uplift of the eastern United States revealed by fluvial \nsequences of the Susquehanna and Ohio systems: coupling between surface processes \nand lower-crustal flow. Quaternary Science Reviews. \nWestaway, R., Maddy, D., Bridgland, D., 2002. Flow in the lower continental crust as a \nmechanism for the Quaternary uplift of south-east England: constraints from the Thames \nterrace record. Quaternary Science Reviews 21, 559-603. \nWestaway, R., Bridgland, D., Mishra, S., 2003. Rheological differences between Archaean \nand younger crust can determine rates of Quaternary vertical motions revealed by fluvial \ngeomorphology. Terra Nova 15 287-298.  \nWestaway, R., Pringle, M., Yurtmen, S., Demir, T., Bridgland, D., Rowbotham, G., Maddy, \nD., 2004. Pliocene and Quaternary regional uplift in western Turkey: The Gediz river \nterrace staircase and the volcanism at Kula. Tectonophysics 391, 121-169. \nWestaway, R., Guillou, H., Yurtmen, S., Demir, T., Rowbotham, G., 2005. Constraints on the \ntiming and regional conditions at the start of the present phase of crustal extension in \nwestern Turkey from observations in and around the Denizli region. Geodinamica Acta \n18, 313-343. \nWestaway, R., Bridgland, D., White, M., 2006a. The Quaternary uplift history of central \nsouthern England: evidence from the terraces of the Solent River system and nearby \nraised beaches. Quaternary Science Reviews 25, 2212-2250. \nWestaway, R., Guillou, H., Yurtmen, S., Beck, A., Bridgland, D., Demir, T., Scaillet, S., \nRowbotham, G., 2006b. Late Cenozoic uplift of western Turkey: Improved dating of the \nKula Quaternary volcanic field and numerical modelling of the Gediz river terrace \nstaircase. Global and Planetary Change 51, 131-171. \nWilson, M., Lyashkevich, Z.M., 1996. Magmatism and the geodynamics of rifting of the \nPripyat-Dnieper-Donets Rift, East European Platform. Tectonophysics 268, 65-81. \nWymer, J.J. 1968. Lower Palaeolithic Archaeology in Britain as Represented by the Thames \nValley. John Baker, London, 429pp. \nWymer, J.J., 1999. The Lower Palaeolithic occupation on Britain. Wessex Archaeology and \nEnglish Heritage, Salisbury, 234 pp + 2nd volume of maps. \nYoung, R.W., Bryant, E.A., 1993. Coastal rock platforms and ramps of Pleistocene and \nTertiary age in southern New South Wales, Australia. Zeitschrift für Geomorphologie, \nN.F. 37, 257-272. \nZeuner, F.W., 1945. The Pleistocene Period: its Climate, Chronology and Faunal Successions \n(1st edition). Ray Society, London, publication No. 130, 322pp. \nPage 50; Bridgland & Westaway; 18\/03\/2008 \nFigure Captions \nFig. 1. The Terrace record from the River Rhine; the numbers in circles refer to marine \noxygen isotope stages (MIS) during which each terrace aggradation is inferred to have \nculminated. (a) Longitudinal profile showing terraces of the Middle and Lower Rhine, \nbetween the uplifting Rhenish Massif and the subsiding coastal region of the Netherlands. \nAdapted from Westaway (2001, Fig. 10) and Westaway (2002b, Fig. 6), who listed original \nsources of information. (b) Transverse profile across the Middle Rhine near Koblenz, showing \nthe transition from a broad floodplain in the Early Pleistocene to a narrow gorge lacking \nterraces (after Bibus and Semmel, 1977; Westaway, 2002a).  Abbreviations: HT – \nHauptterrasse (high terrace); MT – Mittelterrasse (middle terrace); NT – Niederterrasse (low \nterrace); TR – Terrasse (terrace; in the reach upstream of Koblenz). \nFig. 2. Fluvial records from the East European Plain (after Matoshko et al., 2002, 2004): a  - \nlocation map, showing the key crustal blocks mentioned in the text; b - generalized transverse \nprofile through the Middle–Lower Dniester terrace sediments; c - transverse profile, ~240 km \nlong, across the Middle Dnieper basin, ~100 km downstream of the city of Kiev; d- transverse \nprofile through the deposits of the Upper Don near the city of Voronezh; e - cross-section \nthrough the sediments of the Lower Volga, in the region of the Pre-Caspian Block (see part a).   \nNote the contrasting disposition of deposits of particular ages in each case.  White numbers in \nblack circles refer to marine oxygen isotope stages to which deposits are attributed.  The \nconsiderable width of the Middle Dnieper basin (c) means that different deposits overlie \ndifferent crustal types.  For further information and source references see Matoshko et al. \n(2002, 2004). \nFig. 3. Transverse profiles illustrating fluvial sequences in cratonic regions (after Westaway \net al., 2003). Sections a and b are from the cratonic part of peninsular India, being records \nfrom the rivers Pravara and Kukadi, respectively. Sections c and d are from the River Vaal, in \nthe Archaean Kaapvaal craton of South Africa: c - after De Wit et al. (1997); d – detail of the \nyounger part of the record, after Helgren (1978). In c, the Wedburg and Proksch Koppie \ngravels are thought to be Miocene (e.g., de Wit et al., 1997) and the oldest deposit known in \nthe succession, the Nooitgedacht gravel, is thought to date from the Late Cretaceous or early \nin the Cenozoic (e.g., de Wit, 2004). Of the three ‘Younger Gravel’ members in d, A and B \nare thought to be Early Pleistocene, whereas C is biostratigraphically dated to the mid-Middle \nPleistocene. In the Riverton Formation, Members I and II have yielded Acheulian artefacts \n(Middle Pleistocene); Member III has yielded Middle Palaeolithic artefacts, suggesting a late \nMiddle Pleistocene or early Late Pleistocene age; and Members IV and V are Holocene (cf. \nWestaway et al., 2003). See, e.g., Dingle and Hendey (1984) for further discussion of the \nCenozoic evolution of the Vaal river system and Butzer et al. (1973) for more detail on its \nfluvial deposits. \nFig. 4. The Thames terraces (after Bridgland 1994 with subsequent modifications), showing \nMIS correlations (? = inferred). a - Idealized transverse section through the terraces of the \nMiddle Thames, ~35 west of London, where the most complete sequence is preserved; b - \nIdealized transverse section through the terraces of the Lower Thames, ~15km east of \nLondon, showing interbedded cold- and warm-climate deposits; this sequence, which begins \nwith the Anglian (MIS 12) glacial diversion of the river, shows optimal preservation of \npalaeoclimatic evidence. See, e.g., Bridgland and Schreve (2001, 2004) or Bridgland (2006) \nfor details of biostratigraphic and archaeological age-control for these deposits. \nFig. 5. Transverse section through the terraces of the River Somme, in the vicinity of Amiens, \nPage 51; Bridgland & Westaway; 18\/03\/2008 \nnorthern France (after Bridgland et al., 2006; Antoine et al., in press), showing MIS \ncorrelations (? = inferred).  \nFig. 6. Model for terrace formation in response to climatic forcing: a - original model from \nBridgland (2000), with downcutting at warming transitions; b - revised model, with \ndowncutting at both warming and cooling transitions (after Bridgland, 2001); c - third \npossible scenario, newly added here, with downcutting at cooling transitions to match rivers \nsuch as the Somme (Fig. 5; see text).  \nFig. 7. Schematic transverse profile through the staircase of terraces of the lower River Aguas \nin the Vera Basin, SE Spain (adapted from Schulte et al. (2000); Schulte (2002)). Inferred \nMIS correlations are shown. \nFig. 8. Comparison of uplift rates deduced from different terrace records: (a) and (b) long-\ntimescale (post-3.5 Ma) and short timescale (post-1.3 Ma) records for the Middle Thames \n~45km west of London, after Westaway et al. (2002; cf. Fig. 4a). (c) and (d) long- and short \ntimescale records for the Somme at Amiens (Fig. 5). (e) and (f) long- and short timescale \nrecords for the Middle Rhine at Andernach (Fig. 1). (g) long-timescale (7.5 Ma) record from \nthe Aguas (Fig. 7), also including the Early Messinian, Early Pliocene and Pleistocene marine \nsediments in the same region; (h) long-timescale (6 Ma) record from the Middle Dniester \n(Fig. 2b). Modelling solutions use the technique of Westaway (2001; Westaway et al., 2002); \nsee also Westaway (2002a, c). Filled symbols indicate preferred fits between observed terrace \nheights and model predictions; open symbols indicate other possible ages for individual river \nterraces. All solutions assume   κ (thermal diffusivity of the crust) 1.2 mm2 s-1.  \nModel parameters are: Wi=zi-zb, where zi is the depth at which the lower-crustal flow is \nconcentrated and zb is the depth of the base of the brittle upper crust (Westaway, 2001; \nWestaway et al., 2002), which is taken at the temperature threshold Tb=350°C. u is the \ngeothermal gradient in the lower crust. ∆Te and to are the magnitude and start timing of each \nphase of LCFF (see Westaway et al., 2002, for full explanations). For the viscosity \nparameterization used for the mobile lower crust, with a temperature-dependent linear viscous \nrheology, and for an assumed uniform steady-state geothermal gradient, the depth zi is \nroughly 9\/10 of the way down from zb to the depth zm of the Moho (Westaway, 1998). As \nnoted previously (e.g., Westaway, 2002b), the thicker the mobile lower-crustal layer is \nassumed to be, the larger Wi is, and thus the more sluggish is the predicted uplift response to a \ngiven phase of lower crustal flow forcing (LCFF). (a) and (b) use Wi=8 km, u=10 °C km\n-1, \nto1=18 Ma, ∆Te1=-6.0 °C, to2=3.1 Ma, ∆Te2=-3.4 °C, to3=0.9 Ma and ∆Te3=-2.0 °C. Observed \nuplift is measured relative to the present-day river level of 18 m a.s.l., except for the marine \nRed Crag deposit, the present-day altitude of which used to indicate uplift since its deposition \n(i.e., palaeo-water depth and any fall in global sea-level are both neglected). (c) and (d) use \nWi=9 km, u=20 °C km\n-1, to1=18 Ma, ∆Te1=-6.0 °C, to2=3.1 Ma, ∆Te2=-2.9 °C, to3=0.9 Ma and \n∆Te3=-2.9 °C. Reference level used for measuring uplift is +2 m, a.s.l., 1 m below the top of \nthe Valley Bottom gravel. (e) and (f) use Wi=10 km, u=20 °C km\n-1, to1=18 Ma, ∆Te1=-9.0 °C, \nto2=3.1 Ma, ∆Te2=-4.5 °C, to3=0.9 Ma and ∆Te3=-11.5 °C. Observed uplift is measured from a \nreference level of 67 m a.s.l., 7 m above the present river level. (g) uses Wi=11 km, u=20 °C \nkm-1, to1=18 Ma, ∆Te1=-10.0 °C,  to2=6 Ma, ∆Te2=-16 °C, to3=3.1 Ma, ∆Te3=-2 °C, to4=0.9 Ma \nand ∆Te4=-3 °C.  To convert fluvial incision to uplift, a channel lengthening correction of \n+100 m has been applied linearly between 3100 ka and 950 ka (MIS 25). Observed uplift is \nmeasured from a reference level 3 m above present river level (for river terraces) and from \npresent sea-level (for marine terraces). (h) uses Wi=8 km, u=20 °C km\n-1, to1=18 Ma, ∆Te1=-\n22.0 °C, to2=5.7 Ma, ∆Te2=-1.5 °C, to3=3.1 Ma, ∆Te3=-0.7 °C, to4=2.0 Ma, ∆Te4=-2.2 °C, \nPage 52; Bridgland & Westaway; 18\/03\/2008 \nto5=0.9 Ma and ∆Te5=-3.7 °C. Observed uplift is measured from 1 m below the present river \nlevel at Serebriya, Ukraine, which is 60 m above the level of the Black Sea. The top of the \nSarmatian ‘marine’ sediment is at ~330 m a.s.l., which is assumed to represent ~300 m of \nuplift and ~30 m of eustatic sea-level fall. This sediment is assumed to have an age of 10.6 \nMa, at the Sarmatian-Meiotian boundary. To link this to the later fluvial record, a 60 m \nchannel-lengthening correction is applied at a uniform rate between 10.6 Ma and 5.3 Ma. \nFig. 9. The sequence in the Upper Orontes valley: (a) Location map; (b) Idealized transverse \nsection through the Orontes terraces in the Homs area (modified from Bridgland et al., 2003). \nBases of terraces and other field relations are shown dashed if not directly observed. Numbers \nin circles indicate MIS correlations. Terrace and archaeological evidence from the Middle \nOrontes (Besançon and Sanlaville, 1993; Dodonov et al., 1993; Muhesen, 1993) is shown, for \ncomparison, to the left of the main staircase. There has been ~400 m of total incision by the \nOrontes since the eruption of the Homs Basalt, which took place in the latest Miocene \n(Messinian; ~6-5 Ma; see Westaway, 2004 for a summary of the dating evidence).  \nFig. 10. Representative transverse profile across the terraces of the River South Platte, near \nDenver, Colorado (modified from Osterkamp et al., 1987), showing MIS correlations (? = \ninferred). Age constraints are from Osterkamp et al. (1987), as amended by Gansecki et al. \n(1998), Lindsey et al. (1998), Dethier et al. (2001), Schildgen et al. (2002) and references \ncited therein. The start of incision below the level of the ‘Late Miocene \/ Early Pliocene’ \nerosion surface can be dated to ~5 Ma from the end of deposition, in adjacent regions, of \nsediment (of the Ogallala Group) that is derived from this erosion (e.g., McMillan et al., \n2002). The Nussbaum terrace gravel is correlated with other deposits (e.g., the Blanco \nFormation of the southern High Plains) with a fauna sssigned to the Blancan mammal \nassemblage zone. Correlative sites underlie calcrete capped by the Guaje ash, from the ~1.6 \nMa eruption of Valles Caldera in New Mexico. This gravel thus probably dates from the early \nEarly Pleistocene. The Rocky Flats terrace gravel, of ‘Nebraskan’ age, is capped by well-\ndeveloped palaeosol thought to record at least two interglacials. It is tentatively dated to ~1.35 \nMa from the extent of soil development and to up to ~1.5 Ma using cosmogenic 10Be; it \nprobably represents the later part of the Early Pleistocene. The deposits of the Verdos terrace \ncontain ash from the 602±4 ka Lava Creek B eruption of Yellowstone, with a well-developed \n‘Yarmouth’ palaeosol. The gravel forming this terrace thus probably aggraded during MIS 16. \nThe deposits of the Slocum and Louviers terraces have yielded uranium series dates on bone \nof 190±50 ka and 129±10 ka, respectively. Both are capped by palaeosol characteristic of the \nSangamon (MIS 5e) interglacial. The gravels forming these terraces thus probably aggraded \nduring MIS 8 and MIS 6, respectively. The deposits forming the Broadway terrace date from \nthe Pinedale (MIS 2) glaciation. Those of the Piney Creek alluvium are Holocene, and those \nof the post-Piney Creek alluvium are late Holocene, with radiocarbon dates of <1 ka.  \nFig. 11. Idealised transverse profile through the terrace staircase of the Colorado River and its \nmajor tributary, the Gunnison, in the vicinity of Grand Junction, Colorado. Numbers in circles \nare interpreted MIS correlations. Data have been derived from localities up to ~150 km apart, \ncompiled from the following sources (see Fig. 12): Hansen (1987), Baker et al. (2002), Bryant \net al. (2002), Scott et al. (2002), Garhart et al. (2003), Kellogg (2004) and Karlstrom (2005). \nNumerical ages are from Ar-Ar dating. Note phases of major incision in the Late Miocene, in \nthe Late Pliocene and starting in the early Middle Pleistocene. There is of course no guarantee \nthat in the earliest of these phases, incision served as a direct proxy for uplift; early in the \ndevelopment of other large river systems, incision significantly exceeded contemporaneous \nuplift (e.g., Westaway, 2002b). The possible association of the ~600 ka Yellowstone Lava \nPage 53; Bridgland & Westaway; 18\/03\/2008 \nCreek B ash with the 250 m Colorado terrace is the highest of a range of possibilities \nindicated by Karlstrom (2005); this ash may correlate in his view with as recent a terrace as \nthat at 190 m, whereas according to Scott et al. (2002) its equivalent may be the 165 m \nterrace.  \nFig. 12. Modelling solution for the uplift history revealed by the Colorado River system in the \nvicinity of Grand Junction, Colorado. Altitudes above the present river level are converted \ndirectly to estimates of uplift. Model prediction, using the same technique and notation as \nFigure 8, is based on the following parameter values: Wi=6 km, u=10 °C km\n-1, κ=1.2 mm2 s-1, \nto1=18 Ma, ∆Te1=-1.0 °C, to2=10 Ma, ∆Te2=-11.6 °C, to3=6 Ma, ∆Te3=+1.2 °C, to4=3.1 Ma, \n∆Te4=-7.2 °C, to5=2.5 Ma, ∆Te5=+4.2 °C, to6=2.0 Ma, ∆Te6=-2.2 °C, to7=1.2 Ma, ∆Te7=+1.0 \n°C, to8=0.87 Ma, and ∆Te8=-7.5 °C. (a) Uplift history since 11 Ma. (b) Enlargement showing \nthe record since 3.5 Ma. (c) Enlargement showing the record since 1.4 Ma. (d) History of \nvariation of uplift rate. Sources of data are indicated. The possible alternative correlations of \nthe Yellowstone Lava Creek B ash with Colorado terraces, indicated in Figure 11 caption, \nwould necessitate lower values of Wi to account for the high rates of incision and uplift \nrequired in the early Middle Pleistocene.  \nFig. 13. Terraces of the River Sundays, South Africa: (a). location map (b). Schematic \ntransverse profile across the terrace staircase at Kirkwood, Eastern Cape province, South \nAfrica (modified from Hattingh and Rust, 1999). Suggested MIS assignments are shown, \nbased on incision\/uplift modelling (see Fig.  14). \nFig. 14.  Uplift modelling of the Sundays terrace staircase at Kirkwood, as illustrated in \nFigure 13b, and of the staircase of marine terraces bounding the adjacent Indian Ocean \ncoastline. Inferred MIS correlations are shown. Observed uplift is measured from present \nriver level, which is 50 m above sea-level. A +50 m correction has been applied to Sundays \nterrace T1 to account for post-depositional downstream channel lengthening. Display format \nis the same as in Figure 8, except round symbols mark marine deposits. Marine terraces \n(after Hattingh and Rust, 1999) are labelled with M followed by the height a.s.l. in metres; \nthus M240 means the ~240 m a.s.l. terrace. Prediction uses Wi=8 km, u=20 °C km\n-1, κ=1.2 \nmm2 s-1, to1=18 Ma, ∆Te1=-10.0 °C, to2=3.1 Ma, ∆Te2=-11.2 °C, to3=0.9 Ma and ∆Te3=-5.5 \n°C. (a) Observed and predicted uplift histories since the Middle Pliocene. (b) Enlargements \nof part (a), showing the Middle and Late Pleistocene in greater detail. (c) Predicted variations \nin uplift rate. \nFig. 15. Schematic transverse profile across the terrace staircase of the River Shoalhaven at \nLarbet, New South Wales, SE Australia (modified from Nott et al., 2002). Inferred MIS \ncorrelations are shown  \nFig. 16. Idealized transverse sequence through the terraces of the River Acre, western Brazil.  \nBased on data from Westaway (2006b).  Age constraint is poor but the low terrace probably \ndates from MIS 2. \n \n"}