{"doi":"10.1093\/jxb","coreId":"68846","oai":"oai:eprints.lancs.ac.uk:30903","identifiers":["oai:eprints.lancs.ac.uk:30903","10.1093\/jxb"],"title":"Hormonal changes in relation to biomass partitioning and shoot growth impairment in salinised tomato (Solanum lycopersicum L.) plants.","authors":["Albacete, Alfonso","Ghanem, Michel Edmond","Martínez-Andújar, Cristina","Acosta, Manuel","Sanchez-Bravo, Jose","Martinez, Vicente","Lutts, Stanley","Dodd, Ian C.","Pérez-Alfocea, Francisco"],"enrichments":{"references":[{"id":932401,"title":"Abscisic acid is correlated with the leaf growth inhibition of four genotypes of maize differing in their response to salinity.","authors":[],"date":"2002","doi":null,"raw":"Cramer GR, Quarrie SA. 2002. Abscisic acid is correlated with the leaf growth inhibition of four genotypes of maize differing in their response to salinity. Functional Plant Biology 29, 111–115.","cites":null},{"id":931811,"title":"Auxin transport promotes Arabidopsis lateral root initiation.","authors":[],"date":"2001","doi":null,"raw":"Casimiro I, Marchant A, Bhalerao RP, et al. 2001. Auxin transport promotes Arabidopsis lateral root initiation. The Plant Cell 13, 843–852.","cites":null},{"id":930463,"title":"Carbon partitioning and sucrose metabolism in tomato plants growing under salinity. Physiologia Plantarum 110,","authors":[],"date":"2000","doi":null,"raw":"Balibrea ME, Dell’Amico J, Boları ´n MC, Pe ´rez-Alfocea F. 2000. Carbon partitioning and sucrose metabolism in tomato plants growing under salinity. Physiologia Plantarum 110, 503– 511.","cites":null},{"id":931557,"title":"Comparison of 4 methods for the extraction and quantification of 1-aminocyclopropane-1-carboxylic acid (ACC) in tomato fruits.","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":16705786,"title":"Comparison of 4 methods for the extraction and quantiﬁcation of 1-aminocyclopropane-1-carboxylic acid (ACC) in tomato fruits. Revista de Agroquimica y Tecnologı ´a de Alimentos","authors":[],"date":"1989","doi":null,"raw":"Casas JL, Del Rı ´o JA, Serrano M, Acosta M. 1989. Comparison of 4 methods for the extraction and quantiﬁcation of 1-aminocyclopropane-1-carboxylic acid (ACC) in tomato fruits. Revista de Agroquimica y Tecnologı ´a de Alimentos 29, 191–198.","cites":null},{"id":932102,"title":"Control of plant growth resides in the shoot, and not in the root, in reciprocal grafts of ﬂacca and wild-type tomato (Lycopersicon esculentum), in the presence and absence of salinity stress. Plant and Soil 256,","authors":[],"date":"2003","doi":null,"raw":"Chen G, Fu X, Lips H, Sagi M. 2003. Control of plant growth resides in the shoot, and not in the root, in reciprocal grafts of ﬂacca and wild-type tomato (Lycopersicon esculentum), in the presence and absence of salinity stress. Plant and Soil 256, 205– 215.","cites":null},{"id":932940,"title":"Cytokinin translocation: changes in zeatin and zeatin-riboside levels in the root exudate of tomato plants during their development.","authors":[],"date":"1976","doi":null,"raw":"Davey JE, van Staden J. 1976. Cytokinin translocation: changes in zeatin and zeatin-riboside levels in the root exudate of tomato plants during their development. Planta 130, 69–72.","cites":null},{"id":930774,"title":"Cytoplasmic sucrolytic activity controls tomato fruit growth under salinity.","authors":[],"date":"1999","doi":null,"raw":"Balibrea ME, Parra M, Boları ´n MC, Pe ´rez-Alfocea F. 1999. Cytoplasmic sucrolytic activity controls tomato fruit growth under salinity. Australian Journal of Plant Physiology 26, 561– 568.","cites":null},{"id":931335,"title":"Regulation of the shoot\/root ratio by cytokinins","authors":[],"date":"1996","doi":null,"raw":"Beck EH. 1996. Regulation of the shoot\/root ratio by cytokinins in Urtica dioica: opinion. Plant and Soil 185, 3–12.","cites":null},{"id":931090,"title":"Response of cytokinin concentration in the xylem exudate of bean (Phaseolus vulgaris L.) plants to decapitation and auxin treatment and relationship to apical dominance.","authors":[],"date":"1994","doi":null,"raw":"Bangerth F. 1994. Response of cytokinin concentration in the xylem exudate of bean (Phaseolus vulgaris L.) plants to decapitation and auxin treatment and relationship to apical dominance. Planta 194, 439–442.","cites":null},{"id":932637,"title":"The inﬂuence of salinity on the utilization of root anaplerotic carbon and nitrogen metabolism in tomato seedlings.","authors":[],"date":"1995","doi":null,"raw":"Cramer MD, Schierholt A, Wang YZ, Lips SH. 1995. The inﬂuence of salinity on the utilization of root anaplerotic carbon and nitrogen metabolism in tomato seedlings. Journal of Experimental Botany 46, 1569–1577.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-11","abstract":"Following exposure to salinity, the root\/shoot ratio is increased (an important adaptive response) due to the rapid inhibition of shoot growth (which limits plant productivity) while root growth is maintained. Both processes may be regulated by changes in plant hormone concentrations. Tomato plants (Solanum lycopersicum L. cv Moneymaker) were cultivated hydroponically for 3 weeks under high salinity (100 mM NaCl) and five major plant hormones (abscisic acid, ABA; the cytokinins zeatin, Z, and zeatin-riboside, ZR; the auxin indole-3-acetic acid, IAA; and the ethylene precursor 1-aminocyclopropane-1-carboxylic acid, ACC) were determined weekly in roots, xylem sap, and leaves. Salinity reduced shoot biomass by 50–60% and photosynthetic area by 20–25% both by decreasing leaf expansion and delaying leaf appearance, while root growth was less affected, thus increasing the root\/shoot ratio. ABA and ACC concentrations strongly increased in roots, xylem sap, and leaves after 1 d (ABA) and 15 d (ACC) of salinization. By contrast, cytokinins and IAA were differentially affected in roots and shoots. Salinity dramatically decreased the Z+ZR content of the plant, and induced the conversion of ZR into Z, especially in the roots, which accounted for the relative increase of cytokinins in the roots compared to the leaf. IAA concentration was also strongly decreased in the leaves while it accumulated in the roots. Decreased cytokinin content and its transport from the root to the shoot were probably induced by the basipetal transport of auxin from the shoot to the root. The auxin\/cytokinin ratio in the leaves and roots may explain both the salinity-induced decrease in shoot vigour (leaf growth and leaf number) and the shift in biomass allocation to the roots, in agreement with changes in the activity of the sink-related enzyme cell wall invertase","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/68846.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/30903\/1\/4119.pdf","pdfHashValue":"5eb09df7efbbebc1254515495cedbabf1d30f07f","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:30903<\/identifier><datestamp>\n      2018-01-24T02:54:10Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4745<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Hormonal changes in relation to biomass partitioning and shoot growth impairment in salinised tomato (Solanum lycopersicum L.) plants.<\/dc:title><dc:creator>\n        Albacete, Alfonso<\/dc:creator><dc:creator>\n        Ghanem, Michel Edmond<\/dc:creator><dc:creator>\n        Martínez-Andújar, Cristina<\/dc:creator><dc:creator>\n        Acosta, Manuel<\/dc:creator><dc:creator>\n        Sanchez-Bravo, Jose<\/dc:creator><dc:creator>\n        Martinez, Vicente<\/dc:creator><dc:creator>\n        Lutts, Stanley<\/dc:creator><dc:creator>\n        Dodd, Ian C.<\/dc:creator><dc:creator>\n        Pérez-Alfocea, Francisco<\/dc:creator><dc:subject>\n        GE Environmental Sciences<\/dc:subject><dc:description>\n        Following exposure to salinity, the root\/shoot ratio is increased (an important adaptive response) due to the rapid inhibition of shoot growth (which limits plant productivity) while root growth is maintained. Both processes may be regulated by changes in plant hormone concentrations. Tomato plants (Solanum lycopersicum L. cv Moneymaker) were cultivated hydroponically for 3 weeks under high salinity (100 mM NaCl) and five major plant hormones (abscisic acid, ABA; the cytokinins zeatin, Z, and zeatin-riboside, ZR; the auxin indole-3-acetic acid, IAA; and the ethylene precursor 1-aminocyclopropane-1-carboxylic acid, ACC) were determined weekly in roots, xylem sap, and leaves. Salinity reduced shoot biomass by 50–60% and photosynthetic area by 20–25% both by decreasing leaf expansion and delaying leaf appearance, while root growth was less affected, thus increasing the root\/shoot ratio. ABA and ACC concentrations strongly increased in roots, xylem sap, and leaves after 1 d (ABA) and 15 d (ACC) of salinization. By contrast, cytokinins and IAA were differentially affected in roots and shoots. Salinity dramatically decreased the Z+ZR content of the plant, and induced the conversion of ZR into Z, especially in the roots, which accounted for the relative increase of cytokinins in the roots compared to the leaf. IAA concentration was also strongly decreased in the leaves while it accumulated in the roots. Decreased cytokinin content and its transport from the root to the shoot were probably induced by the basipetal transport of auxin from the shoot to the root. The auxin\/cytokinin ratio in the leaves and roots may explain both the salinity-induced decrease in shoot vigour (leaf growth and leaf number) and the shift in biomass allocation to the roots, in agreement with changes in the activity of the sink-related enzyme cell wall invertase.<\/dc:description><dc:date>\n        2008-11<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/30903\/1\/4119.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1093\/jxb\/ern251<\/dc:relation><dc:identifier>\n        Albacete, Alfonso and Ghanem, Michel Edmond and Martínez-Andújar, Cristina and Acosta, Manuel and Sanchez-Bravo, Jose and Martinez, Vicente and Lutts, Stanley and Dodd, Ian C. and Pérez-Alfocea, Francisco (2008) Hormonal changes in relation to biomass partitioning and shoot growth impairment in salinised tomato (Solanum lycopersicum L.) plants. Journal of Experimental Botany, 59 (15). pp. 4119-4131. ISSN 1460-2431<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/30903\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1093\/jxb\/ern251","http:\/\/eprints.lancs.ac.uk\/30903\/"],"year":2008,"topics":["GE Environmental Sciences"],"subject":["Journal Article","PeerReviewed"],"fullText":"Journal of Experimental Botany, Vol. 59, No. 15, pp. 4119–4131, 2008\ndoi:10.1093\/jxb\/ern251\nThis paper is available online free of all access charges (see http:\/\/jxb.oxfordjournals.org\/open_access.html for further details)\nRESEARCH PAPER\nHormonal changes in relation to biomass partitioning and\nshoot growth impairment in salinized tomato (Solanum\nlycopersicum L.) plants\nAlfonso Albacete1,*, Michel Edmond Ghanem2,*, Cristina Martı´nez-Andu´jar1,†, Manuel Acosta3,\nJose´ Sa´nchez-Bravo3, Vicente Martı´nez1, Stanley Lutts2, Ian C. Dodd4 and Francisco Pe´rez-Alfocea1,‡\n1 Departamento de Nutricio´n Vegetal, Centro de Edafologı´a y Biologı´a Aplicada del Segura (CEBAS), Consejo\nSuperior de Investigaciones Cientı´ficas (CSIC), Campus Universitario de Espinardo, E-30100, Espinardo, Murcia,\nSpain\n2 Groupe de Recherche en Physiologie Ve´ge´tale, Universite´ catholique de Louvain (UCL), Croix du Sud 5, boıˆte 13,\nB-1348 Louvain-la-Neuve, Belgium\n3 Departamento de Biologı´a Vegetal-Fisiologı´a Vegetal, Facultad de Biologı´a, Universidad de Murcia, Campus\nUniversitario de Espinardo, E-30100, Espinardo, Murcia, Spain\n4 The Lancaster Environment Centre, Lancaster University, Lancaster LA1 4YQ, UK\nReceived 19 June 2008; Revised 11 September 2008; Accepted 15 September 2008\nAbstract\nFollowing exposure to salinity, the root\/shoot ratio is\nincreased (an important adaptive response) due to the\nrapid inhibition of shoot growth (which limits plant\nproductivity) while root growth is maintained. Both\nprocesses may be regulated by changes in plant\nhormone concentrations. Tomato plants (Solanum\nlycopersicum L. cv Moneymaker) were cultivated\nhydroponically for 3 weeks under high salinity (100 mM\nNaCl) and five major plant hormones (abscisic acid,\nABA; the cytokinins zeatin, Z, and zeatin-riboside, ZR;\nthe auxin indole-3-acetic acid, IAA; and the ethylene\nprecursor 1-aminocyclopropane-1-carboxylic acid,\nACC) were determined weekly in roots, xylem sap, and\nleaves. Salinity reduced shoot biomass by 50–60% and\nphotosynthetic area by 20–25% both by decreasing\nleaf expansion and delaying leaf appearance, while\nroot growth was less affected, thus increasing the\nroot\/shoot ratio. ABA and ACC concentrations\nstrongly increased in roots, xylem sap, and leaves\nafter 1 d (ABA) and 15 d (ACC) of salinization. By\ncontrast, cytokinins and IAA were differentially af-\nfected in roots and shoots. Salinity dramatically de-\ncreased the Z+ZR content of the plant, and induced the\nconversion of ZR into Z, especially in the roots, which\naccounted for the relative increase of cytokinins in the\nroots compared to the leaf. IAA concentration was also\nstrongly decreased in the leaves while it accumulated\nin the roots. Decreased cytokinin content and its\ntransport from the root to the shoot were probably\ninduced by the basipetal transport of auxin from the\nshoot to the root. The auxin\/cytokinin ratio in the\nleaves and roots may explain both the salinity-induced\ndecrease in shoot vigour (leaf growth and leaf number)\nand the shift in biomass allocation to the roots, in\nagreement with changes in the activity of the sink-\nrelated enzyme cell wall invertase.\nKey words: Abscisic acid, 1-aminocyclopropane-1-carboxylic\nacid, indole-3-acetic acid, plant hormones, salt stress, sodium\nchloride, tomato (Solanum lycopersicum L.), zeatin, zeatin-\nriboside.\n* AA and MEG contributed equally to this work.\ny Present address: Department of Horticulture-Seed Biology, Oregon State University, OR 97331, Corvallis, USA.\nz To whom correspondence should be addressed: E-mail: alfocea@cebas.csic.es\nAbbreviations: ABA, abscisic acid; ACC, 1-aminocyclopropane-1-carboxylic acid; CK, cytokinin; CWIN, cell wall invertase; IAA, indole-3-acetic acid; RGR,\nrelative growth rate; RER, relative expansion rate; Z, zeatin; ZR, zeatin riboside.\nª 2008 The Author(s).\nThis is an Open Access article distributed under the terms of the Creative Commons Attribution Non-Commercial License (http:\/\/creativecommons.org\/licenses\/by-nc\/2.0\/uk\/) which\npermits unrestricted non-commercial use, distribution, and reproduction in any medium, provided the original work is properly cited.\n at Lancaster University on 10 December 2009 http:\/\/jxb.oxfordjournals.orgDownloaded from \nIntroduction\nSalinity is a major factor reducing crop productivity in\nagriculture as well as a major cause of the abandonment\nof lands and aquifers for agricultural purposes. Improving\nthe use of such marginal resources requires insight about\ntheir limiting effects on plant development. The release of\nsalt-tolerant crops to optimize the use of salt-contaminated\nwater and soil resources has been a much prosecuted\nscientific goal but with little success to date, as few major\ndeterminant genetic traits of salt tolerance have been\nidentified (Flowers, 2004; Munns, 2005). Although main-\ntenance of ionic and water homeostasis is necessary for\nplant survival, salinity decreases crop productivity both by\nreducing leaf growth and inducing leaf senescence. This\nlowers the total photosynthetic capacity of the plant, thus\nlimiting its ability to generate further growth or harvest-\nable biomass and also to maintain defence mechanisms\nagainst the stress (Yeo, 2007).\nThe major physiological processes believed to be\ninvolved in the control of plant growth under salinity\nhave been water relations, hormonal balance, and carbon\nsupply, with their respective importance depending on the\ntime scale of the response (Munns, 2002). Salinity affects\nplant growth in two phases (Munns, 1993). During the\ninitial phase of salinity, the osmotic effect predominates\nand induces water stress due to the high salt concentration\nin the root medium. During this phase, shoot growth arrest\noccurs very quickly (seconds to minutes) but recovers\n(over several hours) to a new steady-state that is\nconsiderably lower than under non-stress conditions.\nThese changes seem to be driven by changes in water\nrelations (Munns, 2002), but during this initial period\nwhen osmotic effects predominate (days to weeks),\ngrowth seems to be regulated by hormones and\/or\ncarbohydrates. During the second phase of the stress\n(weeks to months), growth is governed by toxic effects\ndue to the high salt accumulation in leaf tissues.\nOverall, salinity affects plant productivity by reducing\nthe photosynthetic area by inhibiting cell division and cell\nexpansion rates during leaf growth and by affecting\ndevelopmental programmes regulating leaf emergence,\nthe production of lateral primordia, and the formation of\nreproductive organs (Munns, 2002). However, the mech-\nanism(s) that down-regulates leaf growth and shoot\ndevelopment under the osmotic phase of salinity is not\nknown. It has been hypothesized that leaf growth in-\nhibition must be regulated by hormones or their precur-\nsors, because the reduced leaf growth rate is independent\nof carbohydrate supply, water status, nutrient deficiency,\nand ion toxicity (see Munns and Tester, 2008, for\na review). Since plant meristems are actively growing\ntissues where cell division governs sink strength, environ-\nmental signals can modulate plant responses to the\ngrowing conditions through changes in phytohormone\nconcentrations, thus controlling assimilate partitioning\nbetween different sink tissues (Hartig and Beck, 2006).\nThese hormonal changes not only influence the\nadaptive response but also affect the normal growth of\nthe harvestable organs and thus influence economic\nproductivity. Hence, plant hormones are considered\na primary component of the signalling pathways control-\nling these processes.\nThis integrated plasticity in plant development probably\ninvolves long-distance communication between different\norgans with hormones playing an essential role (Sachs,\n2005) or differential changes in root and shoot hormone\nconcentrations. Although salinity increased plant ABA\nconcentration in all plant compartments (Wolf et al.,\n1990; Kefu et al., 1991), its role in growth regulation has\nbeen equivocal as different studies have suggested it can\ninhibit (Dodd and Davies, 1996) or maintain growth by\nrestricting the evolution of ethylene, another potential\ngrowth inhibitor (Sharp and LeNoble, 2002). Both\ncytokinins and auxins act as endogenous mitogens whose\nconcentrations can be environmentally modulated to\nregulate the formation of roots and shoots and their\nrelative growth (Werner et al., 2001; Sachs, 2005). It has\nbeen hypothesized that a decrease in CK supply from the\nroot to the shoot could inhibit leaf growth while a low CK\ncontent would promote root growth and thus the root\/\nshoot ratio (van der Werf and Nagel, 1996; Rahayu et al.,\n2005). It has been reported that salinity decreased the\nauxin indoleacetic acid (IAA) levels in the roots but not in\nthe leaves of tomato plants (Dunlap and Binzel, 1996),\nwhile leaf zeatin concentration declined under osmotic\nstress in tomato (Walker and Dumbroff, 1981). However,\nsince many of these (relatively scarce) studies were only\nable to measure one or two of the major hormone groups\nfollowing a step-change in salinity or any other stress,\ninterpretation of changes in biomass allocation by specific\nauthors has generally favoured the hormones that each\nauthor measured, and thus there are several divergent\nhypotheses of the regulation of biomass allocation (van\nder Werf and Nagel, 1996; Munns and Cramer, 1996;\nSachs, 2005) that co-exist in the literature.\nThe advent of multi-analyte techniques for hormone\nquantification allows a far more comprehensive analysis\nof the changes in plant hormone status following salinity.\nAccordingly, the endogenous concentrations of five major\nplant hormones; ABA, ACC, IAA, and two major active\ncytokinins (Davey and van Staden, 1976) in tomato, Z and\nZR, were analysed in leaves of a cultivated tomato\ngenotype submitted to salinity stress (100 mM NaCl for 3\nweeks), in order to study the influence of local changes in\nboth plant hormones and ionic status on leaf senescence\n(Ghanem et al., 2008). In this study, however, root and\nxylem hormone concentrations were measured to evaluate\nwhether differential hormonal changes in and between\nroots and shoots regulated growth and biomass\n4120 Albacete et al.\n at Lancaster University on 10 December 2009 http:\/\/jxb.oxfordjournals.orgDownloaded from \npartitioning under salinity. Tomato was chosen for this\nwork since it is an economically important crop, whose\ncropping area (particularly in the Mediterranean) is often\nlimited by the availability of sufficient high quality (non-\nsaline) water for irrigation.\nMaterials and methods\nPlant material and culture conditions\nSeeds of tomato (Solanum lycopersicum L.) cv. Moneymaker were\nobtained from the Tomato Genetics Resource Center (TGRC)\n(University of California-Davis, CA, USA). Seeds were sown in\ntrays filled with a perlite-vermiculite mix (1:3 v\/v proportion)\nmoistened regularly with half-strength Hoagland’s nutrient solution.\nFourteen days after sowing, the substrate was gently washed from\nthe roots and seedlings placed on polyvinyl chloride plates floating\non aerated half-strength Hoagland’s nutrient solution in a growth\nchamber. Solutions were refilled every 2 d and renewed every\nweek.\nPlants were grown in a growth chamber under a 16 h daylight\nperiod. The air temperature ranged from 25–28 \u0001C during the day\nand 17–18 \u0001C during the night. Relative humidity was maintained at\n7065% during the night and at 5065% during the day. Light\nintensity at the top of the canopy was around 245 lmol m\u00012 s\u00011\n(PPFD). After 4 d acclimation in control conditions (18 d after\nsowing), the seedlings were exposed to 0 mM (control) or 100 mM\nNaCl added to the nutrient solution for three more weeks. Three\nreplications with eight plants per replication and salt treatment were\nused. An actively growing leaf, present at the moment that salt\nstress was applied (identified as leaf number 4 by numbering from\nthe base of the plant) was tagged for subsequent growth measure-\nments and harvest for biochemical determinations. Six plants per\ntreatment were harvested for different analyses at 1, 9, 15, and 22 d\nof salt treatment. Xylem sap was obtained from three plants per\ntreatment immediately after severing the shoot about 2–3 cm above\nthe root system. The root system was placed into a Scholander\npressure chamber, and samples obtained by applying a nitrogen\npressure similar to the leaf water potential (–0.5 MPa for control\nplants and about –0.9 MPa for stressed ones) in order to maintain\nsap flow rates as close as possible to whole plant transpiration rate\n(Pe´rez-Alfocea et al., 2000).\nVegetative growth assessment\nSix plants per treatment were used for growth analysis. The number\nof leaves on the main stem with a length >2 cm was recorded every\n2 d, and the rate of leaf appearance was estimated from the slope of\nleaf number versus time. At each harvest, the shoots and roots of\neach plant were separated and weighed to determine fresh weight\n(FW) and the root\/shoot ratio. The area of the tagged leaf 4 was\ndetermined by using a Li-Cor 3100 area meter (Li-Cor Inc.,\nLincoln, Nebraska, USA). The relative growth rate (RGR) on a FW\nbasis, and the relative expansion rate (RER) of leaf 4, and the RGR\nof the root system, were evaluated as the increase in FW or leaf area\nper unit of FW or leaf area present per unit of time and were\nestimated from the equation [(lnPt2–lnPt1)\/(t2–t1)], where Pt2 and\nPt1 are the values of each parameter at the end (t2) and at the\nbeginning (t1) of the corresponding growing period.\nHormone extraction and analysis\nCytokinins (zeatin, Z, and zeatin riboside, ZR), indole-3-acetic acid\n(IAA), and abscisic acid (ABA) were extracted and purified\naccording to the method of Dobrev and Kaminek (2002). One gram\nof fresh plant material (leaf or root) was homogenized in liquid\nnitrogen and placed in 5 ml of cold (–20 \u0001C) extraction mixture of\nmethanol\/water\/formic acid (15\/4\/1 by vol., pH 2.5). After over-\nnight extraction at –20 \u0001C solids were separated by centrifugation\n(20 000 g, 15 min) and re-extracted for 30 min in an additional 5 ml\nof the same extraction solution. Pooled supernatants were passed\nthrough a Sep-Pak Plus yC18 cartridge (SepPak Plus, Waters, USA)\nto remove interfering lipids and plant pigments and evaporated to\ndryness. The residue was dissolved in 5 ml of 1 M formic acid and\nloaded on an Oasis MCX mixed mode (cation-exchange and reverse\nphase) column (150 mg, Waters, USA) preconditioned with 5 ml of\nmethanol followed by 5 ml of 1 M formic acid. To separate\ndifferent CK forms (nucleotides, bases, ribosides, and glucosides)\nfrom IAA and ABA, the column was washed and eluted stepwise\nwith different appropriate solutions indicated in Dobrev and\nKaminek (2002). ABA and IAA were analysed in the same fraction.\nAfter each solvent was passed through the columns, they were\npurged briefly with air. Solvents were evaporated at 40 \u0001C under\nvacuum. Samples then dissolved in a water\/acetonitrile\/formic acid\n(94.9:5:0.1 by vol.) mixture for HPLC\/MS analysis. Analyses were\ncarried out on a HPLC\/MS system consisting of an Agilent 1100\nSeries HPLC (Agilent Technologies, Santa Clara, CA, USA)\nequipped with a l-well plate autosampler and a capillary pump,\nand connected to an Agilent Ion Trap XCT Plus mass spectrometer\n(Agilent Technologies, Santa Clara, CA, USA) using an electro-\nspray (ESI) interface. Prior to injection, 100 ll of each fraction\nextracted from tissues or a similar volume of xylem sap were\nfiltered through 13 mm diameter Millex filters with 0.22 lm pore\nsize nylon membrane (Millipore, Bedford, MA, USA). 8 ll of each\nsample, dissolved in mobile phase A, was injected onto a Zorbax\nSB-C18 HPLC column (5 lm, 15030.5 mm, Agilent Technologies,\nSanta Clara, CA, USA), maintained at 40 \u0001C, and eluted at a flow\nrate of 10 ll min\u00011. Mobile phase A, consisting of water\/\nacetonitrile\/formic acid (94.9:5:0.1 by vol.), and mobile phase B,\nconsisting of water\/acetonitrile\/formic acid (10:89.9:0.1 by vol.),\nwere used for the chromatographic separation. The elution pro-\ngramme maintained 100% A for 5 min, then a linear gradient from\n0% to 6% B in 10 min, followed by another linear gradient from\n6% to 100% B in 5 min, and finally 100% B maintained for another\n5 min. The column was equilibrated with the starting composition\nof the mobile phase for 30 min before each analytical run. The UV\nchromatogram was recorded at 280 nm with a DAD module\n(Agilent Technologies, Santa Clara, CA, USA). The mass spectrom-\neter was operated in the positive mode with a capillary spray voltage\nof 3500 V, and a scan speed of 22 000 m\/z s\u00011 from 50–500 m\/z.\nThe nebulizer gas (He) pressure was set to 30 psi, whereas the drying\ngas was set to a flow of 6.0 l min\u00011 at a temperature of 350 \u0001C. Mass\nspectra were obtained using the DataAnalysis program for LC\/MSD\nTrap Version 3.2 (Bruker Daltonik GmbH, Germany). For quantifi-\ncation of Z, ZR, ABA, and IAA, calibration curves were constructed\nfor each component analysed (0.05, 0.075, 0.1, 0.2, and 0.5 mg l\u00011)\nand corrected for 0.1 mg l\u00011 internal standards: [2H5]trans-zeatin,\n[2H5]trans-zeatin riboside, [\n2H6]cis,trans-abscisic acid (Olchemin\nLtd, Olomouc, Czech Republic), and [13C6]indole-3-acetic acid\n(Cambridge Isotope Laboratories Inc., Andover, MA, USA).\nRecovery percentages ranged between 92% and 95%.\nACC (1-aminocyclopropane-1-carboxylic acid) was determined\nafter conversion into ethylene by gas chromatography using an\nactivated alumina column and a FID detector (Konik, Barcelona,\nSpain). ACC was extracted with 80% (v\/v) ethanol and assayed by\ndegradation with alkaline hypochlorite in the presence of 5 mM\nHgCl2 (Casas et al., 1989). A preliminary purification step was\nperformed by passing the extract through a Dowex 50W-X8, 50–\n100 mesh, H+-form resin and later recovered with 0.1 N NH4OH.\nThe conversion efficiency of ACC into ethylene was calculated\nseparately by using a replicate sample containing 2.5 nmol of ACC\nas an internal standard and used for the correction of data.\nHormones in salinized tomato 4121\n at Lancaster University on 10 December 2009 http:\/\/jxb.oxfordjournals.orgDownloaded from \nEnzyme extraction and assay\nFor cell wall invertase activity (CWIN, EC 3.2.1.25), the enzyme\nextracts were prepared essentially as described in Balibrea et al.\n(1999). Fresh leaf or root tissue samples (100 mg) were frozen with\nliquid nitrogen and stored at \u000120 \u0001C until analysis. Samples\ncontaining polyvinylpyrrolidone and Fontainebleau sand were\nhomogenized in 1 ml of extraction buffer containing 50 mM\nHEPES-KOH (pH 7), 10 mM MgCl2, 1 mM Na2EDTA, 2.6 mM\nDTT, 10% ethylene glycol, and 0.02% Triton X-100. After\ncentrifugation at 20 000 g, the supernatant was discarded and the\npellet was washed three times and resuspended in 30 mM acetate\nbuffer (pH 5). The amount of hexose was determined through an\nenzyme-linked assay monitoring NADH formation at 340 nm, after\nadding 25 ll 0.6 M sucrose and incubating at 30 \u0001C for 15 min. The\nproteins were analysed in the pellet after solubilization with 1 M\nNaCl and the specific enzymatic activities were expressed as nkat\nmg\u00011 protein.\nStatistical analysis\nData were subjected to an analysis of variance (ANOVA II) using\nthe SAS software (SAS System for Windows, version 8.02). The\nstatistical significance of the results was analysed by the Student–\nNewman–Keuls test at the 5% level.\nResults\nPlant development and biomass allocation\nSalinization decreased shoot fresh weight by 50–60%\n(compared to control plants) from the first week of\nsalinization (Fig. 1A). However, root fresh weight was\nonly significantly affected (30%) after 3 weeks under\nsaline conditions (Fig. 1B). As a consequence, salinization\nincreased the root\/shoot ratio by 2-fold compared to\ncontrol plants, reaching the highest values after the first\nweek of salinization (Fig. 1C).\nShoot growth reduction during the first week of salinity\nwas attributable partially to an arrest in the appearance of\nnew leaves, which was detected from day 5 (Fig. 2A). By\nday 9, the salinized plants had three fewer leaves than the\ncontrol plants. After this 4 d growth arrest, leaf appear-\nance rate recovered to control values (about 1 new leaf\nevery 2 d).\nAnother major factor limiting shoot growth was the\nimpaired development of individual leaves. After 3 weeks\nof salinity, fresh weight and area of actively expanding\nleaves (4 g FW and 100 cm2 at the time of imposing\nsalinity) were decreased by 60% and 25%, respectively\n(Fig. 2B, C).\nHormonal profiling\nCytokinins: Although ZR concentrations were 2-fold\nlower in the root than in the leaf (cf. Fig. 3D, F), they\nshowed similar dynamics through the experiment, as they\ndid in xylem sap (Fig. 3E), with an immediate and\nsustained decrease in ZR concentration following the\nFig. 1. Shoot (A) and root (B) biomass and root\/shoot ratio (C) in\ntomato plants (cv. Moneymaker) grown for 3 weeks on half-strength\nHoagland’s medium in the absence (black bars) or presence of 100 mM\nNaCl (grey bars). Data are means of six plants 6SE. Asterisks indicate\nsignificant differences between treatments according to Student–New-\nman–Keuls test at P <0.05.\n4122 Albacete et al.\n at Lancaster University on 10 December 2009 http:\/\/jxb.oxfordjournals.orgDownloaded from \nimposition of salinity. By contrast, the transient (day 1)\nincrease in leaf Z concentration following salinity (Gha-\nnem et al., 2008) was maintained throughout the experi-\nment in the roots (cf. Fig. 3A, C). Xylem sap Z\nconcentrations progressively decreased throughout the\nexperiment (Fig. 3B). Since ZR concentrations were 4.5-,\n5-, and 10-fold higher than Z ones in leaves, xylem sap, and\nroots, respectively, the total CK (Z+ZR) concentration was\ndecreased by salinity throughout the experiment [except on\nday 1 in the leaves, as noted previously (Ghanem et al.,\n2008) where the decrease in ZR concentration sustained the\nincrease in Z concentration] (Fig. 3G, H, I).\nIndeed, the ratio between (the putatively more active)\nzeatin and one of its supposed storage forms (ZR) was\nmaintained almost constant in both leaves and roots under\ncontrol conditions (Fig. 3J, L). However, salinity pro-\nvoked a general increase in the Z\/ZR ratio following leaf\ndevelopment, but it occurred especially and more pro-\ngressively in the roots (from 2 to 12 times more than in\ncontrol roots, following salinization). Only in the xylem\nsap of control plants did the Z\/ZR ratio increase with time,\nbut it was reduced under salinity during the second week\n(Fig. 3K).\nIndoleacetic acid (IAA): Salinity induced opposite changes\nin IAA concentrations in leaves and roots. Salinity\ndecreased leaf IAA concentration by 80% (Fig. 4A), but\nincreased root IAA concentration 2-fold (Fig. 4B) during\nthe first day of salt treatment, compared with control\nplants. These changes remained statistically significant\nthroughout the experiment, even though leaf IAA levels of\nboth control and salinized plants fluctuated with time.\nThe IAA\/(Z+ZR) ratio in the leaves fluctuated in both\ntreatments throughout the experiment, and reached mini-\nmum values in salinized plants during the first and\nthird weeks (Fig. 4C), coinciding with the greatest\nsalinity-induced growth reduction (Fig. 2B, C). By\ncontrast, the maximum IAA\/(Z+ZR) ratios were in the\nroots of salinized plants, and were 2–3 times higher than\ncontrol plants from the first day of salinization (Fig. 4D).\nAbscisic acid (ABA) and aminocyclopropane carboxylic acid\n(ACC): ABA concentrations of both roots and leaves\n(although not xylem sap) increased on the first day of\nsalinity and with time in all compartments, reaching up to\n8-fold, 4-fold, and 2.3-fold higher concentrations than\ncontrol plants in roots, leaves, and xylem sap, respectively\n(Fig. 5A, B, C). Increased ACC concentrations in re-\nsponse to salinization were first detected on day 15 in both\nleaves and xylem sap, but not in roots (Fig. 5D, E, F).\nACC increased with time in all compartments, reaching\n2.4-fold, 12-fold, and 30-fold higher than control plants\nby the end of the experiment in roots, leaves, and xylem\nsap, respectively.\nFig. 2. Leaf number (A), leaf 4 biomass (B), and leaf 4 area (C) in tomato\nplants (cv. Moneymaker) grown for 3 weeks on half-strength Hoagland’s\nmedium in the absence (closed circles) or presence of 100 mM NaCl\n(open circles). Data are means of six plants. Asterisks: see Fig. 1.\nHormones in salinized tomato 4123\n at Lancaster University on 10 December 2009 http:\/\/jxb.oxfordjournals.orgDownloaded from \nCell wall invertase activity\nSalt-stress significantly decreased CWIN activity in leaf 4\nfrom the first day of salt treatment (Fig. 6). However, root\nCWIN activity was significantly increased from the\nsecond week of salinization.\nLeaf to root hormonal ratios\nRelative changes in hormone concentrations between leaves\nand roots may explain relative changes in growth ratios\nand biomass partitioning induced by salt stress. In spite of\nthe small effect on leaf Z concentration, salinity decreased\nthe [Z]leaf\/[Z]root ratio by 60–70% compared with the\ncontrol plants from the first week (Fig. 7A), while it\nincreased the [ZR]leaf\/[ZR]root by 40% during the same\nperiod (Fig. 7B). Since these changes were somewhat\ncompensatory, the leaf\/root ratio for total CK (Z+ZR) was\nonly reduced by 20% during the last two weeks of\nsalinization, and a similar increase occurred on day 1\n(Fig. 7C). The most dramatic change induced by salinity\nwas the 70–95% decrease in [IAA]leaf\/[IAA]root ratio from\nthe first day of salinity and throughout the experiment\n(Fig. 7D). As in the case of ZR, the [ABA]leaf\/[ABA]root\nand the [ACC]leaf\/[ACC]root ratios were also increased by\nsalinity during the experiment (Fig. 7E, F). Thus, salinity\nfavours the accumulation of CK (especially Z) and IAA in\nthe roots compared to a mature leaf, while it promotes the\naccumulation of ABA and the ethylene precursor ACC in\nthe leaf compared to the roots.\nCorrelation analysis: Relative leaf growth (expressed as\neither fresh weight, RGR, or area, RER) was positively\ncorrelated with the leaf IAA concentration (r¼0.89, P\n<0.001) and still more closely with the IAA\/(Z+ZR) ratio\n(Fig. 8A, B). No significant correlations were found\nbetween the other leaf hormonal concentrations or ratios\nand leaf growth (Table 1). However, while both shoot and\nroot RGR were positively correlated with leaf Z, ZR, and\nZ+ZR concentrations (r¼0.82–0.93, P <0.05; Table 1),\nthe RGR of the root was negatively correlated with\nthe [Z+ZR]root\/[Z+ZR]leaf ratio (r ¼ –0.83, P <0.05)\nFig. 3. Cytokinin (Z, ZR, and Z+ZR) concentrations and Z\/ZR ratio in leaf 4 (A, D, G, J), xylem sap (B, E, H, K), and roots (C, F, I, L) of tomato\nplants (cv. Moneymaker) grown for 3 weeks on half-strength Hoagland’s medium in the absence (closed circles) or presence of 100 mM NaCl (open\ncircles). Data are means of three plants 6SE. Asterisks: see Fig. 1. (Leaf data are replotted from Ghanem et al., 2008.)\n4124 Albacete et al.\n at Lancaster University on 10 December 2009 http:\/\/jxb.oxfordjournals.orgDownloaded from \n(Fig. 8C). Interestingly, the accumulation of IAA in the\nroot was negatively correlated with leaf growth parame-\nters, while the ratios of both CK (Z+ZR) and IAA with\nABA in the root were positively correlated with shoot\ngrowth (Table 1).\nDiscussion\nAlthough the economic impact of salinity on tomatoes\ndepends on fruit growth, overall plant growth can first be\nconsidered as two local processes (shoot and root de-\nvelopment) but also as co-ordinated responses between\ndifferent organs (biomass partitioning), which must be\nessentially regulated by hormones (Sachs, 2005). During\nthis time, prior to ion toxicity, when the osmotic stress\nand nutrient imbalances (e.g. N uptake) mediate changes\nin hormone concentrations (Pe´rez-Alfocea et al., 1993;\nMunns, 2002; Rahayu et al., 2005; Ghanem et al., 2008;\nMunns and Tester, 2008), growth responses may account\nfor differences in the overall plant productivity by\nmaintaining ion homeostasis and generating new energetic\nresources (Balibrea et al., 2000; Munns and Tester, 2008).\nShoot growth regulation\nSalinity decreased both the total number of leaves (Fig.\n2A) and the growth of individual leaves (Fig. 2B, C), thus\ncell division, elongation, and primordium formation were\nall decreased. Shoot CK and auxins are probably involved\nin these processes since they were strongly reduced by\nsalinity in the shoot tissues: about 50% for Z+ZR contents\nin leaf (Ghanem et al., 2008) and xylem sap, and 50–90%\nfor IAA during leaf development. This idea is supported\nby the significant correlation found between both the leaf\nIAA content and the IAA\/(Z+ZR) ratio with leaf de-\nvelopment under both control and saline conditions (Fig.\n8A, B; Table 1). In addition, the leaf CK (ZR and Z+ZR)\nconcentrations were also positively correlated with the overall\nshoot growth capacity (Table 1), which may be explained\nnot only by promoting cell division but also by delaying leaf\nsenescence under salinity (Ghanem et al., 2008).\nThe phenotype of salinized tomato plants, where leaf\nCKX activity was enhanced by salinity (Ghanem et al.,\n2008), was similar to that of CKX-transgenic tobacco\nplants (Werner et al., 2001), where total CK contents were\nalso diminished compared to the wild type. In both cases,\nleaf growth and the leaf appearance rate were strongly\nFig. 4. IAA concentration and IAA\/(Z+ZR) ratio of leaf 4 (A, C) and root (B, D) of tomato plants (cv. Moneymaker) grown for 3 weeks on half-\nstrength Hoagland’s medium in the absence (closed circles) or presence of 100 mM NaCl (open circles). Data are means of three plants 6SE.\nAsterisks: see Fig. 1. (Leaf data are replotted from Ghanem et al., 2008.)\nHormones in salinized tomato 4125\n at Lancaster University on 10 December 2009 http:\/\/jxb.oxfordjournals.orgDownloaded from \nreduced, suggesting that modulation of CKs through\ncatabolism is involved in regulating leaf initiation and\ngrowth under salinity.\nAuxins are also considered to be a positive factor in leaf\ninitiation having antagonistic interactions with CKs\n(Kepinski, 2006; Shani et al., 2006). Assuming that\nchanges in leaf hormone concentration also occur in other\nparts of the shoot, delayed leaf appearance (Fig. 2A) could\nbe explained by the decrease in shoot IAA concentration\nduring the first days of salt treatment. The later recovery\nin leaf appearance rate coincided with the increased IAA\nconcentration and IAA\/Z+ZR ratio in the leaf (Fig. 4A,\nC). Since CK and auxin contents changed in parallel, it is\ndifficult to resolve their independent effects and more\nfunctional work is needed, but it is interesting to note that\nboth hormones could exert a major control on the leaf\ngrowth rate, as suggested from correlative analysis\n(Fig. 8A, B; Table 1), probably by promoting cell\nelongation after cell division.\nAlthough increased leaf ABA accumulation (Fig. 5A)\nwas correlated with impaired shoot development (Figs 1,\n2), experiments investigating natural genetic variation in\nABA concentration of salinized plants showed a positive\n(de Costa et al., 2007) or negative (Cramer and Quarrie,\n2002; He and Cramer, 1996) correlation between leaf area\nand ABA concentration, and further studies are needed to\ndetermine the physiological significance (if any) of such\ncorrelations. That one of the functions of ABA\nFig. 5. ABA and ACC concentrations of leaf 4 (A, D), xylem sap (B, E), and roots (C, F)) of tomato plants (cv. Moneymaker) grown for 3 weeks on\nhalf-strength Hoagland’s medium in the absence (closed circles) or presence of 100 mM NaCl (open circles). Data are means of three plants 6SE.\nAsterisks: see Fig. 1. (Leaf data are replotted from Ghanem et al., 2008.)\n4126 Albacete et al.\n at Lancaster University on 10 December 2009 http:\/\/jxb.oxfordjournals.orgDownloaded from \naccumulation may be to inhibit ethylene production\n(Sharp et al., 2000; Sharp and LeNoble, 2002) provided\na rationale to measure ACC concentration. That ethylene\ninhibits shoot growth of salinized plants was suggested by\nthe improved growth of transgenic canola containing ACC\ndeaminase activity (Sergeeva et al., 2006). Although ACC\nlevels were at the limit of detection of our analytical\nprocedures, the fact that leaf and xylem ACC concen-\ntrations increased during the third week of salinization\n(Fig. 5) while growth was inhibited from the first week of\nsalinization (Figs 1, 2), suggests that it was unlikely that\nACC was responsible for the initial reduction in leaf\ngrowth and leaf appearance rate (Fig. 2).\nRoot growth regulation\nSince CKs promote shoot growth but inhibit root growth\n(Thomas et al., 1995), low root CK content could\nstimulate or maintain root growth by prolonging the\nmeristematic phase and thus increasing the number of\ncells before root elongation took place, as suggested for\nCKX-overexpressing transgenic plants exhibiting en-\nhanced root development (Werner et al., 2001). Indeed,\nthe relative accumulation of CKs in the roots compared to\nthe leaves (Fig. 7A, C) may be involved in the late root\ngrowth reduction under salinity, as these parameters were\nnegatively correlated (Fig. 8C). Interestingly, salinity\nactually increased root Z concentration from day 1 (Fig.\n3C), probably due to conversion from its conjugate ZR\n(Fig. 3L), which should inhibit root growth rather than\npromote it. However, variable effects of CKs as a function\nof concentration and tissue specificity, suggests that\na positive role of the increased root Z concentration on\nroot growth cannot be ruled out. Indeed, exogenous CKs,\nespecially the most active form Z, but also its derivatives\nsuch as ZR, stimulated tomato root growth (length and\nfrequency) at very low concentrations (10\u000111 M) but\ninhibited growth at higher concentrations (Taylor and van\nStaden, 1998).\nThe interaction of CKs with other hormones such as\nauxins can also influence root biomass allocation (Sachs,\n2005). Although salinity (300 mM for an unknown\nperiod) decreased root IAA concentration in tomato\n(Dunlap and Binzel, 1996), salt-induced auxin accumula-\ntion in the roots increased the auxin\/CK ratio (Fig. 4B, D),\nwhich may promote cell elongation and root growth.\nSince auxin is formed in developing and mature leaves\nand is necessary for the formation of lateral primordia in\nboth root and shoot apical meristems (Kepinski, 2006),\na link between acropetal and basipetal auxin transport has\nbeen suggested to co-ordinate shoot and root responses to\nenvironmental stimuli depending on the organ of detection\n(Casimiro et al., 2001; Sachs, 2005). Furthermore, IAA\nmay act as a negative feed-back signal temporarily to\nrepress CK synthesis in the roots and their xylem transport\nto the shoot (Bangerth, 1994; Rahayu et al., 2005), as\nseems to occur under salinity (this study).\nMoreover, increased assimilate partitioning to the roots\ncan be explained by changes in CWIN activity in both\nroots and leaves, as reported in CK-deficient tobacco\nplants (Werner et al., 2008). This enzyme regulates\nsucrose transport by controlling the apoplastic unloading\nstep from phloem (Roitsch et al., 2003). However,\nalthough CKs are major hormones establishing sink\nactivity through the co-ordinated induction of extracellular\ninvertases and hexose transporters in order to enhance\nphloem carbohydrate supply to actively growing tissues\n(Roitsch et al., 2000), this response seems to depend on\nthe tissue, and Z is unlikely to be responsible for the\nCWIN induction in the roots. This idea is supported by\nthe induction or maintenance of this enzyme activity\nreported in the roots of CKX-overexpressing tobacco\nplants (Werner et al., 2008) with lowered total CK and Z\ncontents (Werner et al., 2001). However, IAA seems to\ninduce both sink (sucrose allocation) and CWIN activities\nFig. 6. Cell wall invertase activity (CWIN)of leaf 4 and roots of tomato\nplants (cv. Moneymaker) grown for three weeks on half-strength\nHoagland’s medium in the absence (black bars) or presence of 100 mM\nNaCl (grey bars). Data are means of three plants 6SE. Asterisks: see\nFig. 1.\nHormones in salinized tomato 4127\n at Lancaster University on 10 December 2009 http:\/\/jxb.oxfordjournals.orgDownloaded from \nin both young leaves and roots (Roitsch et al., 2003;\nA. Albacete et al., unpublished results), supporting its role\nin the relative increase in the root sink strength under\nsalinity.\nSimilar to its action in the shoot, ABA accumulation\nmay also be necessary to maintain the root growth of\nsalinized plants. Although both WT and ABA-deficient\n(flacca) tomato plants showed a 50% reduction in root\nbiomass at 200 mM NaCl, reciprocal grafting experiments\nshowed that flacca scions with the same shoot biomass\nhad a much greater root biomass with a WT rootstock\nthan with a flacca rootstock (Chen et al., 2003). As in the\nshoot, it is possible that root growth of these ABA-\ndeficient rootstocks may have been inhibited by ethylene,\nsince transgenic canola plants containing ACC deaminase\n(Sergeeva et al., 2006) had greater root growth, although\nthis may be a consequence of improved shoot growth.\nWhile root ABA accumulation was apparently sufficient\nto limit root ACC concentration during the first two weeks\nof salinization (Fig. 5), a late increase in root ACC\nconcentration coincided with root growth inhibition.\nWhether this correlation is causative remains to be\ndetermined.\nLong-distance transport\nWhile local hormone concentrations can influence local\ngrowth processes in both roots and shoots, the extent to\nwhich a root-applied stress influences long-distance\nhormone signalling and thus shoot hormone status\nremains an ongoing research field (Dodd, 2005). Although\non some measurement occasions, for some hormones,\nFig. 7. Leaf 4\/root hormone concentration ratios for zeatin (A), ZR (B), Z+ZR (C), IAA (D), ABA (E), and ACC (F) in tomato plants (cv.\nMoneymaker) grown for 3 weeks on half-strength Hoagland’s medium in the absence (closed circles) or presence of 100 mM NaCl (open circles).\nData are ratios of mean hormonal concentrations of three plants.\n4128 Albacete et al.\n at Lancaster University on 10 December 2009 http:\/\/jxb.oxfordjournals.orgDownloaded from \nconcentration changes were significant in the roots but not\nthe xylem, salinity only produced opposite changes in root\nand xylem hormone concentration for zeatin (cf. Fig. 3B,\nC) and root and shoot hormone concentrations for IAA\n(cf. Fig. 4A, B). While this correspondence between root\nand xylem hormone concentrations might suggest that the\nformer regulates the latter, the contributions of roots and\nshoots to xylem hormone concentrations can only be\nassessed by detailed flow modelling experiments (Jiang\nand Hartung, 2008) and\/or girdling to block phloem\ntransport to the roots and thus hormone recycling via the\nxylem (reviewed in Dodd, 2005).\nWhile the roots are the first to perceive the osmotic\ncomponent of saline stress, rapid loss of shoot turgor\nwithin minutes and hours (Munns, 2002) could alter shoot\nhormone concentrations (Pierce and Raschke, 1980).\nHowever, root pressurization during salinity revealed that\nleaf ABA accumulation was independent of shoot turgor\n(Kefu et al., 1991), but possibly induced by specific ions\nsuch as sodium, disproportionately to their osmotic\npressure (Montero et al., 1998). Nutrient relations may\nalso be involved in stress perception by the roots and CKs\nare considered long-distance signals mediating the shoot\nresponse to NO\u00013 availability in the roots (Beck, 1996;\nRahayu et al., 2005). Thus NO\u00013 =CI\n\u0001 antagonism at the\ntransport level (Kafkafi et al., 1982) may decrease root\nnitrate uptake and xylem loading (Cramer et al., 1995),\nand long-distance CK transport to limit shoot growth\nunder salinity. This idea is supported by observations that\nonly the most tolerant tomato genotypes were able to\nmaintain leaf nitrate concentration (Pe´rez-Alfocea et al.,\n1993), while deleterious effects of salinity can be\nalleviated by increasing NO\u00013 in the substrate (Grattan\nand Grieve, 1999). However, the contribution of xylem\nCK delivery to shoot CK status remains controversial\n(Dodd and Beveridge, 2006).\nConclusions\nFigure 9 summarizes the different hormonal and growth\nchanges induced by salinity in this study. Although much\nattention has been directed towards the role of the ‘stress\nhormones’ ABA and ACC in growth regulation, these do\nnot seem to be the primary factors controlling growth\nunder salinity, at least during the early (osmotic) phases of\nsalinity. Alternatively, cytokinins and auxins seem better\ncandidates in explaining shoot growth impairment and\nFig. 8. Linear correlations between leaf RGR or RER and the IAA\nconcentrations (A) or the IAA\/(Z+ZR) ratio (B) in leaf 4, and between\nthe RGR of the root and the ratio for CK (Z+ZR) contents in the roots\ncompared to the leaf 4 (C) of tomato plants (cv. Moneymaker) grown\nfor 3 weeks on half-strength Hoagland’s medium in the absence or\npresence of 100 mM NaCl.\nHormones in salinized tomato 4129\n at Lancaster University on 10 December 2009 http:\/\/jxb.oxfordjournals.orgDownloaded from \nchanges in biomass partitioning. More direct evidence on\nthe roles of these changes in hormone concentration are\nbeing sought from experiments involving genotypes\ndiffering in salt tolerance, tomato mutants, transgenic\nplants, and grafting procedures.\nAcknowledgements\nThe authors are very grateful to Dr A Torrecillas (CAID,\nUniversidad de Murcia) for his help on hormonal analyses, to the\nFonds National de la Recherche Scientifique-FNRS (Belgium) and\nto the Fundacio´n Se´neca (Comunidad Auto´noma de Murcia, Spain)\nfor a travel grant to MEG and FPA, respectively, and to the CSIC\n(Spain) for a research grant to AA (I3P Program). ICD thanks the\nBBSRC for support of his research on ACC signalling. Research\nwas also supported by the Fundacio´n Se´neca de la Regio´n de\nMurcia, Spain (project 03011\/PI\/05) and by the CICYT-FEDER\nproject AGL2007-63610\/AGR. The authors dedicate this paper to\nthe memory of the late Professors Manuel Caro (CEBAS-CSIC) and\nGilles Guerrier (Universite´ d’Orle´ans, France).\nReferences\nBalibrea ME, Dell’Amico J, Boları´n MC, Pe´rez-Alfocea F.\n2000. Carbon partitioning and sucrose metabolism in tomato\nplants growing under salinity. Physiologia Plantarum 110, 503–\n511.\nBalibrea ME, Parra M, Boları´n MC, Pe´rez-Alfocea F. 1999.\nCytoplasmic sucrolytic activity controls tomato fruit growth\nunder salinity. Australian Journal of Plant Physiology 26, 561–\n568.\nBangerth F. 1994. Response of cytokinin concentration in the\nxylem exudate of bean (Phaseolus vulgaris L.) plants to de-\ncapitation and auxin treatment and relationship to apical domi-\nnance. Planta 194, 439–442.\nBeck EH. 1996. Regulation of the shoot\/root ratio by cytokinins in\nUrtica dioica: opinion. Plant and Soil 185, 3–12.\nCasas JL, Del Rı´o JA, Serrano M, Acosta M. 1989. Compari-\nson of 4 methods for the extraction and quantification of\n1-aminocyclopropane-1-carboxylic acid (ACC) in tomato fruits.\nRevista de Agroquimica y Tecnologı´a de Alimentos 29, 191–198.\nCasimiro I, Marchant A, Bhalerao RP, et al. 2001. Auxin\ntransport promotes Arabidopsis lateral root initiation. The Plant\nCell 13, 843–852.\nChen G, Fu X, Lips H, Sagi M. 2003. Control of plant growth\nresides in the shoot, and not in the root, in reciprocal grafts of\nflacca and wild-type tomato (Lycopersicon esculentum), in the\npresence and absence of salinity stress. Plant and Soil 256, 205–\n215.\nCramer GR, Quarrie SA. 2002. Abscisic acid is correlated with\nthe leaf growth inhibition of four genotypes of maize differing in\ntheir response to salinity. Functional Plant Biology 29, 111–115.\nCramer MD, Schierholt A, Wang YZ, Lips SH. 1995. The\ninfluence of salinity on the utilization of root anaplerotic carbon\nand nitrogen metabolism in tomato seedlings. Journal of\nExperimental Botany 46, 1569–1577.\nDavey JE, van Staden J. 1976. Cytokinin translocation: changes in\nzeatin and zeatin-riboside levels in the root exudate of tomato\nplants during their development. Planta 130, 69–72.\nFig. 9. Changes in hormonal concentrations in leaves, xylem sap, and\nroots in relation to local (shoot, leaf, and root growth) and co-ordinated\nprocesses (biomass partitioning) in tomato plants cultivated under\nsalinity (100 mM NaCl) for 3 weeks. The relative increase (arrow up)\nor decrease (arrow down) in hormone concentration induced by salinity\nat the end of the experiment is indicated by both arrow and font sizes\nwhere the largest, intermediate, and smallest sizes indicate a more than\n5-fold, a 2–5 fold, or a less than 2-fold change in hormone\nconcentration.\nTable 1. Linear correlation coefficients between growth-related parameters (leaf, shoot and root RGR, and leaf RER) and hormonal\nconcentrations and ratios in both leaf 4 and roots on plants grown for 3 weeks on half-strength Hoagland medium in the absence\n(Control) or presence of 100 mM NaCl\nLeaf hormonal parametersa\nZ ZR Z+ZR IAA ACC ABA CK\/ACC CK\/ABA IAA\/CK IAA\/ACC IAA\/ABA ACC\/ABA\nLeaf RGR 0.52 0.27 0.34 0.97*** \u00010.39 \u00010.39 0.21 0.39 0.97*** 0.29 0.46 \u00010.21\nLeaf RER 0.48 0.01 0.10 0.82* \u00010.20 \u00010.18 \u00010.02 0.14 0.96*** 0.13 0.26 \u00010.15\nShoot RGR 0.46 0.84* 0.82* 0.25 \u00010.36 \u00010.48 0.63 0.75* \u00010.16 0.29 0.53 0.10\nRoot RGR 0.54 0.93* 0.90** 0.14 \u00010.48 \u00010.39 0.66 0.60 \u00010.33 0.19 0.34 0.07\nRoot hormonal parametersa\nLeaf RGR \u00010.26 0.30 0.31 \u00010.85* \u00010.67 \u00010.46 0.52 0.33 \u00010.53 0.10 0.31 \u00010.21\nLeaf RER \u00010.08 0.08 0.08 \u00010.72 \u00010.50 \u00010.23 0.32 0.15 \u00010.33 0.05 0.13 \u00010.22\nShoot RGR \u00010.36 0.46 0.50 \u00010.34 \u00010.31 \u00010.48 0.63 0.85** \u00010.47 0.19 0.85** \u00010.50\nRoot RGR \u00010.23 0.38 0.44 \u00010.05 \u00010.45 \u00010.39 0.65 0.55 \u00010.33 0.59 0.57 \u00010.36\na * P <0.05,** P <0.01, *** P <0.001, n¼6–8).\n4130 Albacete et al.\n at Lancaster University on 10 December 2009 http:\/\/jxb.oxfordjournals.orgDownloaded from \nDe Costa W, Zorb C, Hartung W, Schubert S. 2007. Salt\nresistance is determined by osmotic adjustment and abscisic acid\nin newly developed maize hybrids in the first phase of salt stress.\nPhysiologia Plantarum 131, 311–321.\nDobrev PI, Kaminek M. 2002. Fast and efficient separation of\ncytokinins from auxin and abscisic acid and their purification\nusing mixed-mode solid-phase extraction. Journal of Chromatog-\nraphy 950, 21–29.\nDodd IC. 2005. Root-to-shoot signalling: assessing the roles of ‘up’\nin the up and down world of long-distance signalling in planta.\nPlant and Soil 74, 257–275.\nDodd IC, Beveridge CA. 2006. Xylem-borne cytokinins: still in\nsearch of a role? Journal of Experimental Botany 57, 1–4.\nDodd IC, Davies WJ. 1996. The relationship between leaf growth\nand ABA accumulation in the grass leaf elongation zone. Plant,\nCell and Environment 19, 1047–1056.\nDunlap JR, Binzel ML. 1996. NaCl reduces indole-3-acetic acid\nlevels in the roots of tomato plants independent of stress-induced\nabscisic acid. Plant Physiology 112, 379–384.\nFlowers TJ. 2004. Improving salt tolerance. Journal of Experimen-\ntal Botany 55, 307–319.\nGhanem ME, Albacete A, Martı´nez-Andu´jar C, Acosta M,\nRomero-Aranda R, Dodd IC, Lutts S, Pe´rez-Alfocea F. 2008.\nHormonal changes during salinity-induced leaf senescence in\ntomato (Solanum lycopersicum L.). Journal of Experimental\nBotany 59, 3039–3050.\nGrattan SR, Grieve CM. 1999. Salinity-mineral nutrient relations\nin horticultural crops. Scientia Horticulturae 78, 127–157.\nHartig K, Beck E. 2006. Crosstalk between auxin, cytokinins, and\nsugars in the plant cell cycle. Plant Biology 8, 389–396.\nHe T, Cramer GR. 1996. Abscisic acid concentrations are\ncorrelated with leaf area reductions in two salt-stressed rapid-\ncycling Brassica species. Plant and Soil 179, 25–33.\nJiang F, Hartung W. 2008. Long-distance signalling of abscisic\nacid (ABA): the factors regulating the intensity of the ABA\nsignal. Journal of Experimental Botany 59, 37–43.\nKafkafi U, Valoras N, Letey J. 1982. Chloride interaction with\nnitrate and phosphate nutrition in tomato (Lycopersicon esculen-\ntum L.). Journal of Plant Nutrition 5, 1369–1385.\nKefu Z, Munns R, King RW. 1991. Abscisic-acid levels in NaCl-\ntreated barley, cotton and saltbush. Australian Journal of Plant\nPhysiology 18, 17–24.\nKepinski S. 2006. Integrating hormone signalling and patterning\nmechanisms in plant development. Current Opinion in Plant\nBiology 9, 28–34.\nMontero E, Cabot C, Poschenrieder C, Barcelo J. 1998. Relative\nimportance of osmotic-stress and ion-specific effects on ABA-\nmediated inhibition of leaf expansion growth in Phaseolus\nvulgaris. Plant, Cell and Environment 21, 54–62.\nMunns R. 1993. Physiological processes limiting plant growth in\nsaline soils: some dogmas and hypotheses. Plant, Cell and\nEnvironment 16, 15–24.\nMunns R. 2002. Salinity, growth and phytohormones. In: La¨uchli\nA, Lu¨ttge U, eds. Salinity: environment–plants–molecules. Dor-\ndrecht: Kluwer Academic Publishers, 271–290.\nMunns R. 2005. Genes and salt-tolerance: bringing them together.\nNew Phytologist 3, 645–663.\nMunns R, Cramer GR. 1996. Is coordination of leaf and root\ngrowth mediated by abscisic acid? Opinion. Plant and Soil 185,\n33–49.\nMunns R, Tester M. 2008. Mechanisms of salinity tolerance.\nAnnual Review of Plant Biology 59, 651–681.\nPe´rez-Alfocea F, Balibrea ME, Alarco´n JJ, Boları´n MC. 2000.\nComposition of phloem and xylem exudates in relation to the\nsalt-tolerance of domestic and wild tomato species. Journal of\nPlant Physiology 156, 367–374.\nPe´rez-Alfocea F, Estan˜ MT, Santa Cruz A, Boları´n MC. 1993.\nEffects of salinity on nitrate, total nitrogen, soluble protein and\nfree amino acid levels in tomato plants. Journal of Horticultural\nScience 68, 1021–1027.\nPierce M, Raschke K. 1980. Correlation between loss of turgor\nand accumulation of abscisic-acid in detached leaves. Planta 148,\n174–182.\nRahayu YS, Walch-Liu P, Neumann G, von Wire´n N,\nBangerth F. 2005. Root-derived cytokinins as long-distance\nsignals for NO\u00013 induced stimulation of leaf growth. Journal of\nExperimental Botany 56, 1143–1152.\nRoitsch T, Balibrea ME, Hofmann M, Proels R, Sinha AK.\n2003. Extracellular invertase: key metabolic protein and PR\nprotein. Journal of Experimental Botany 54, 513–524.\nRoitsch T, Ehneß R, Goetz M, Hause B, Hofmann M,\nSinha AK. 2000. Regulation and function of extracellular\ninvertase from higher plants in relation to assimilate partitioning,\nstress responses and sugar signalling. Australian Journal of Plant\nPhysiology 27, 815–825.\nSachs T. 2005. Auxin’s role as an example of the mechanisms of\nshoot\/root relations. Plant and Soil 268, 13–19.\nSergeeva E, Shah S, Glick BR. 2006. Growth of transgenic canola\n(Brassica napus cv. Westar) expressing a bacterial 1-amino-\ncyclopropane-1-carboxylate (ACC) deaminase gene on high\nconcentrations of salt. World Journal of Microbiology and\nBiotechnology 22, 277–282.\nShani E, Yanai O, Ori, N. 2006. The role of hormones in shoot\napical meristem function. Current Opinion in Plant Biology 9,\n484–489.\nSharp R, LeNoble ME. 2002. ABA, ethylene and the control of\nshoot and root growth under water stress. Journal of Experimen-\ntal Botany 53, 33–37.\nSharp R, LeNoble ME, Else MA, Thorne ET, Gherardi F. 2000.\nEndogenous ABA maintains shoot growth in tomato indepen-\ndently of effects on plant water balance: evidence for an\ninteraction with ethylene. Journal of Experimental Botany 51,\n1575–1584.\nTaylor JLS, Van Staden J. 1998. Plant-derived smoke solutions\nstimulate the growth of Lycopersicon esculentum roots in vitro.\nPlant Growth Regulation 26, 77–83.\nThomas JC, Smigocki AC, Bohnert HJ. 1995. Light-induced\nexpression of ipt from Agrobacterium tumefaciens results in\ncytokinin accumulation and osmotic-stress symptoms in trans-\ngenic tobacco. Plant Molecular Biology 27, 225–235.\nVan Der Werf A, Nagel OW. 1996. Carbon allocation to shoots\nand roots in relation to nitrogen supply is mediated by cytokinins\nand sucrose: opinion. Plant and Soil 185, 21–32.\nWalker MA, Dumbroff EB. 1981. Effects of salt stress on abscisic\nacid and cytokinin levels in tomato. Zeitschrift f}ur Pflanzenphy-\nsiologie 101, 461–170.\nWerner T, Holst K, Po¨rs Y, Guivarc’h A, Mustroph A,\nChriqui D, Grimm B, Schmu¨lling T. 2008. Cytokinin deficiency\ncauses distinct changes of sink and source parameters in tobacco\nshoots and roots. Journal of Experimental Botany 59, 2659–2672.\nWerner T, Motyka V, Srnad M, Schmu¨lling T. 2001. Regulation\nof plant growth by cytokinin. Proceedings of the National\nAcademy of Sciences USA 98, 10487–10492.\nWolf O, Jeschke WD, Hartung W. 1990. Long-distance transport\nof abscisic-acid in NaCl-treated intact plants of Lupinus albus.\nJournal of Experimental Botany 41, 593–600.\nYeo AR. 2007. Salinity. In: Yeo AR, Flowers TJ, eds. Plant solute\ntransport. Oxford: Blackwell Publishing Ltd, 340–365.\nHormones in salinized tomato 4131\n at Lancaster University on 10 December 2009 http:\/\/jxb.oxfordjournals.orgDownloaded from \n"}