{"doi":"10.1017\/S1472669610000654","coreId":"17301","oai":"oai:eprints.lse.ac.uk:32979","identifiers":["oai:eprints.lse.ac.uk:32979","10.1017\/S1472669610000654"],"title":"Copyright? Why would I need to worry about that? The challenge of providing copyright support for staff","authors":["Secker, Jane","Bell, Maria"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"Presents an overview of the challenges of providing copyright training to staff at LSE. The institution does not employ a dedicated copyright officer, but instead employs a range of tactics to ensure academic, administrative and Library staff are made aware of copyright issues. Several training sessions are run throughout the year. LSE have also developed an online course and produce a range of online and printed guides to brief staff on copyright issues. Advice and queries are also dealt with by a number of individuals who have specialist knowledge in areas such as copyright and the internet and copying archival materials","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/17301.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/32979\/3\/Copyright_Why_would_I_need_to_worry_about_that_%28LSERO%29.pdf","pdfHashValue":"899d75c142f23cca38c3cf41f3f79f9b3da32c97","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:32979<\/identifier><datestamp>\n      2011-04-14T15:19:22Z<\/datestamp><setSpec>\n      74797065733D43454E54524553:4C53452D52432D434C54<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3432<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/32979\/<\/dc:relation><dc:title>\n        Copyright? Why would I need to worry about that? The challenge of providing copyright support for staff<\/dc:title><dc:creator>\n        Secker, Jane<\/dc:creator><dc:creator>\n        Bell, Maria<\/dc:creator><dc:subject>\n        KD England and Wales<\/dc:subject><dc:subject>\n        Z665 Library Science. Information Science<\/dc:subject><dc:description>\n        Presents an overview of the challenges of providing copyright training to staff at LSE. The institution does not employ a dedicated copyright officer, but instead employs a range of tactics to ensure academic, administrative and Library staff are made aware of copyright issues. Several training sessions are run throughout the year. LSE have also developed an online course and produce a range of online and printed guides to brief staff on copyright issues. Advice and queries are also dealt with by a number of individuals who have specialist knowledge in areas such as copyright and the internet and copying archival materials.<\/dc:description><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/32979\/3\/Copyright_Why_would_I_need_to_worry_about_that_%28LSERO%29.pdf<\/dc:identifier><dc:identifier>\n          Secker, Jane and Bell, Maria  (2010) Copyright? Why would I need to worry about that? The challenge of providing copyright support for staff.  Legal Information Management, 10 (3).  pp. 166-170.  ISSN 1472-6696     <\/dc:identifier><dc:relation>\n        http:\/\/journals.cambridge.org\/action\/displayJournal?jid=LIM<\/dc:relation><dc:relation>\n        10.1017\/S1472669610000654<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/32979\/","http:\/\/journals.cambridge.org\/action\/displayJournal?jid=LIM","10.1017\/S1472669610000654"],"year":2010,"topics":["KD England and Wales","Z665 Library Science. Information Science"],"subject":["Article","PeerReviewed"],"fullText":"  \nJane Secker and Maria Bell\nCopyright? Why would I need to worry \nabout that? The challenge of providing \ncopyright support for staff \n \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nSecker, Jane and Bell, Maria (2010) Copyright? Why would I need to worry about that? The \nchallenge of providing copyright support for staff. Legal Information Management, 10 (3). pp. 166-\n170. \n \nDOI: 10.1017\/S1472669610000654\n \n© 2011 Cambridge University Press\n \nThis version available at: http:\/\/eprints.lse.ac.uk\/32975\/\n \nAvailable in LSE Research Online: March 2011 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any article(s) \nin LSE Research Online to facilitate their private study or for non-commercial research. You may \nnot engage in further distribution of the material or use it for any profit-making activities or any \ncommercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE Research \nOnline website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, incorporating \nany revisions agreed during the peer review process.  Some differences between this version and \nthe published version may remain.  You are advised to consult the publisher’s version if you wish \nto cite from it. \nLegal Information Management Article \nCopyright? Why would I need to worry about that? -  the \nchallenges of providing copyright support for staff \n \nJane Secker  \nLSE Centre for Learning Technology (S169)  \nHoughton Street \nLondon, WC2A 2AE \nEmail: j.secker@lse.ac.uk  \n \nMaria Bell \nLibrary, London School of Economics and Political Science \n10 Portugal Street \nLondon, WC2A 2HD \nEmail: m.bell@lse.ac.uk  \n \nAbstract (100 words) \nPresents an overview of the challenges of providing copyright training to staff at LSE. The \ninstitution does not employ a dedicated copyright officer, but instead employs a range of tactics to \nensure academic, administrative and Library staff are made aware of copyright issues. Several \ntraining sessions are run throughout the year. LSE have also developed an online course and \nproduce a range of online and printed guides to brief staff on copyright issues. Advice and queries \nare also dealt with by a number of individuals who have specialist knowledge in areas such as \ncopyright and the internet and copying archival materials.  \n \nBrief biography \nDr Jane Secker works in the Centre for Learning Technology at London School of Economics and \nPolitical Science, where she trains and advises staff about copyright and other digital literacy issues \nin relation to their use of new technology. Jane is Chair of the Heron User Group representing over \n50 higher education institutions in the UK. She is also a member of the Universities UK Copyright \nworking group, negotiating with bodies such as the Copyright Licensing Agency (CLA) to develop \nlicences for the higher education sector and Conference Officer for the CILIP Information Literacy \nGroup, which organises LILAC – an international conference on information literacy.  \n \nMaria Bell is the law librarian at the Library of the London School of Economics and Political \nScience. In addition to collection responsibilities for the law and inter-governmental organizations \ncollections and liaison with academic staff, she updates, advises and trains library staff on copyright \nissues and trains academic staff on copyright issues for teaching and research with Jane Secker.   \n \nArticle word count: 2245 \nIntroduction \nCopyright is a tricky issue. Few people confess to fully understanding it and often it seems many \nlecturers and teachers would prefer not to think about whether they might be infringing copyright \nlaws. Ignorance is bliss it would seem and there seems to be a general perception that copying \nmaterial for educational purposes should be enshrined in UK law. So for many academic staff \ngetting to grips with a complex beast such as the CLA Licence1 and all the rules and regulations \nrelated to scanning material is an anathema. As librarians responsible for providing copyright \ntraining and advice it often feels like we are struggling to get our message across. We advertise \ntraining sessions only to find very few people actually show up to sessions. We design web pages, \nposters and booklets, but wonder if anyone actually reads them. This article discusses how at LSE \ntwo librarians employ a range of tactics to encourage staff at their institution to learn about \ncopyright and even sometimes to attend training sessions on the topic! \nCopyright Training sessions \nBy running face to face copyright training sessions an organization can demonstrate that they take \ncopyright matters seriously. At LSE, sessions are run for different groups of staff, depending on \nwhat they need to know. So for example, an introductory session about copyright is run twice per \nyear, covering copyright law basics, the Copyright Licensing Agency (CLA) Licence and other \nlicensing schemes available at the School. Separate training is run for staff who use Moodle, the \nSchool’s virtual learning environment and a third session is run for library staff.  \nTraining for academic and administrative staff \nTwo face to face training sessions are run several times each year and they are open to academic \nand administrative staff. The first course: ‘An Introduction to Copyright’ tends to attract \ndepartmental administrators and a smaller number of academics. It covers the following topics: \n• An overview of UK Copyright law  \n• What is copyright and who owns it? \n• What can be copied– what is fair dealing? \n• Licences at LSE including the CLA Licence \n• Copyright in the electronic environment \n• Using images and multimedia \n \nThis course was designed as a basic introduction to copyright, with the idea that staff might be \nwilling to attend a second course, entitled ‘Copyright, the Internet and Teaching Online’ to build on \ntheir knowledge. This second course is aimed at staff using Moodle and covers: \n• An introduction to copyright law and licensing schemes \n• Copyright and the Internet \n• Digitising text \n• Linking to e-journals \n• Images and multimedia \n• Conclusions and any questions \n \nIn reality the trainers have found there is very little overlap between the people who sign up for \neach course, so much of the basic copyright information needs to be included in the second session \nas many people have not attended the first session. One specific point worth noting at LSE; as an \ninternational institution attracting academic staff from around the world, some staff are not familiar \nwith UK copyright law. For example, staff from the US often confuse the terms ‘fair dealing’ with \n‘fair use’.  \n                                                 \n1 Copyright Licensing Agency Higher Education Licence http:\/\/www.cla.co.uk\/licences\/licences_available\/he\/  \nTraining for Library staff \nThe LSE Library does ensure that staff working at service points are aware of copyright law - what \nLibrary users can do within the law and when and to whom to refer copyright advice questions. \nLibrary staff working at service points are not expected to provide instruction or formal advice to \nusers on copyright. Training provided needs to enlighten staff to the law as it relates to copying in \nlibraries and the typical issues that arise. This became more even more important when the law \nchanged in 2003 and users were required to declare if their photocopying was for a commercial \npurpose. The Library is heavily used by ‘walk –in’ users from other universities, government \ndepartments and businesses and the Library had to implement the CLA Library Sticker Scheme.2\n \nSome Library departments are heavily involved in the detail of complying with copyright law  – \nTeaching Support and Inter-lending and Document Delivery. The Library’s Teaching Support \nteam3 administer the course pack services, ensuring that all print course packs and Epacks in \nMoodle are compliant with the CLA HE Licence. Training is provided to all Teaching Support staff \nand team members may also attend external copyright seminars and training. Both teams are \ncopying material on a daily basis and understanding what copying is allowed within the law or \nunder the CLA HE Licence is vital.  \n \nA general training session is run for Library staff at least once a year and all staff are encouraged to \nattend. Last year it was run as part of a lunchtime seminar series. To encourage greater engagement \nin the topic, scenarios were created for discussion. Discussing real situations opens up the issues \nand the ‘grey areas’ and complexities much more easily than just presenting details about laws and \nlicences. It can be seen as a ‘dry’ subject. The sessions cover the key information that staff will \nneed to know and the trainers try not to confuse staff with too much information. A typical training \nsession for library staff includes the following: \n \n• Copyright law and some general points: Why do we have copyright laws? What is copyright \nand who owns it? \n• Scenarios and discussion \n• Copyright – what can you do?  \n• Licences \n• Copyright in the electronic environment \n \nThere were three scenarios:  \n1. Copyright, teaching and online resources - with an example of a member of LSE academic staff \nquerying whether he could photocopy a chapter from a 1935 book and provide copies to his \nstudents.  \n2. Students and copying for private study – a student asks about copying services but also mentions \nthat they that want to copy a government report in it entirety for researching an assignment.  \n3. Researchers in the Library – an accountant is carrying out some research for his business and \nneeds to make a copy of an article.  \n    \nEmbedding copyright training \nOne issue with copyright training is that a session entitled ‘An Introduction to Copyright Law’ can \nbe less than enticing for staff to attend. Thinking creatively about course titles is important when \nmarketing courses, but relatively few staff will want to come along to an entire session devoted to \ncopyright. At LSE, one approach to counteract this has been to embed copyright information into \nother training sessions, particularly those offered by the Centre for Learning Technology. In this \n                                                 \n2 CLA Library Sticker Scheme http:\/\/www.cla.co.uk\/licences_available\/library\/  \n3 LSE Library Teaching Support services http:\/\/www2.lse.ac.uk\/library\/services\/tss\/teachingsupport.aspx  \nway, copyright knowledge is similar to other information literacy skills, and ideally it needs to be \nembedded into other sessions and delivered in such a way that people immediately see the benefit to \ntheir day to day work. So for example, a training session about finding and using images for use in \nteaching can easily incorporate material about why copyright is an important issue, how to find \ncopyright cleared, or copyright free image collections. However the focus is on something practical \nthat teaching staff are keen to learn about. Wherever possible staff in the Centre for Learning \nTechnology try to embed copyright training into their workshops and programmes on using \ntechnology in teaching. So for example, in a session on using blogs, staff are reminded they should \nonly use images with copyright permission and they are encouraged to search for images using the \nCreative Commons Search (http:\/\/search.creativecommons.org\/).  \nOnline Courses \nTo supplement the face to face training, CLT now provide a number of online courses for staff. The \nfirst course they developed was an online version of Copyright, the internet and teaching online \nwhich is now available in Moodle. Rather than simply including the PowerPoint slides and links to \nresources, the course content is available online to work through at a convenient time and place. \nThe online course is divided into three sections and at the end of each section includes a short quiz \nto assess learning. The course has the following learning outcomes: \n \nBy the end of the course you should be able to: \n• Explain the concept of copyright law in the UK. \n• Distinguish between copying for private study, copying for classroom use and distribution in \nthe virtual learning environment \/ via a network. \n• Explain the types of electronic resources that qualify for copyright protection. \n• Demonstrate good practice when providing access to electronic resources. \n• Explain how licences are used in the digital environment. \n• Define ‘Creative Commons’ and identify resources licensed under ‘Creative Commons’. \n \nSince the course was launched in October 2008 it has been accessed by over 40 members of staff, \nhowever despite publicity in the all staff newsletter almost everyone who accesses the online course \nhas attended a face to face session. \n \n[Screenshot of online course: Copyright, the internet and teaching online. Jane will send a high \nresolution image of the screenshot below.] \n Copyright advice and dealing with queries \nThere is a general LSE wide email account for copyright queries, although staff are also encouraged \nto get in touch with different individuals depending on the nature of their query. So for example, the \nLearning Technology Librarian deals with queries relating to copyright and Moodle. Archives staff \ndeal with queries about copying material from their collections and queries relating to the Library’s \nprint collections are referred to the law librarian. Enquiries have included academic staff wishing to \nreproduce a photograph from a published book and querying the copyright status of the item for \npublication in their own book; a student wishing to use a quotation from an LSE PhD thesis; and  \nlibrary staff asking whether a pamphlet from 1920 can be copied for another library or digitized. \nThe JISCmail discussion list Lis – Copyseek is an invaluable help with particularly complex \nproblems.  \nNot all copyright questions have clear cut answers (as other copyright specialists will know) \ntherefore staff involved will provide their views in these cases providing the enquirer with the \ninformation required to make a decision.  \n \nGuides \nLSE produce two booklets in printed format for staff to advise them about copyright issues: an \nIntroduction to Copyright and Copyright and E-learning: a guide for staff. There is a lot of \nguidance and advice on the LSE Library website4 and the Centre for Learning Technology \nwebsite5. New academic staff are given copies of the print guides. Library Liaison newsletters for \ndepartments will periodically carry articles to raise awareness of the issues and the guidance \navailable.  \n                                                 \n4 A short guide to copyright for LSE staff http:\/\/www2.lse.ac.uk\/library\/services\/liaison\/ShortGuideToCopyright.aspx  \n \n5 Copyright and Moodle http:\/\/clt.lse.ac.uk\/Copyright\/index.php  \nManaging the CLA Licence  \nThe scanning provision in the CLA Licence introduced in 2005 presented a number of challenges at \nLSE in terms of educating staff about what was permitted under this licence. However, it also \nprovided a tremendous opportunity for the Library and Centre for Learning Technology to scale up \nthe scanning service for core readings that had been offered on a pilot basis since 2001. The service, \nknown as the E-course pack service, had become incredibly popular with staff by 2005, however, \nthe need to obtain copyright clearance for each reading, and often to pay high permission fees \nmeant that further expansion had been halted. The CLA Licence allowed this service to be offered \nto all staff using e-learning, however the reporting requirements of the licence meant that there were \nconcerns about how this would be managed. Consequently it was decided to ensure all requests for \nscanned readings were dealt with centrally, by the Teaching Support team in the Library, who could \nensure the material was covered by the Licence and keep the appropriate records for the purposes of \nthe CLA data return. This means that copyright booklets inform staff that they are not permitted to \nscan under this licence and should refer all requests for scanning for teaching purposes to the Epack \nteam.  \nCollaboration at LSE \nLSE do not employ a copyright officer, but instead have a number of staff with responsibility for \ndifferent aspects of copyright including training, compliance, advice and guidance. Licences and \ncompliance are handled centrally by the Planning and Corporate Policy Division (PCPD) who also \nmaintain a web page6 which directs staff to the appropriate sources of help and advice. Meanwhile, \ncentral photocopying and scanning services are provided by the Reprographics team. They work \nclosely with colleagues to ensure staff are made aware of the copyright implications when scanning \nand photocopying materials. They also check all requests to ensure that they are covered by an \nappropriate licence or have permission and refer staff who wish to scan material for teaching \npurposes to the Library’s Teaching Support team. Copyright advice for staff using Moodle is \navailable from the Centre for Learning Technology, who work closely with the Library to advise \nstaff about copying more traditional printed based resources. Good communication between all \nthese teams helps ensure that the central messages about copyright are clear and consistent for staff.  \nConclusion \nIn summary, LSE has staff across several departments that work with copyright matters and work \ncollaboratively. The challenge is to ensure that all LSE staff are aware of the importance of \ncopyright whether in research or teaching. The copyright ‘specialists’ have to find new methods of  \ndelivering accurate and consistent guidance that is available at the point of need whether through a \none to one meeting, an online course or in a training session. With the enactment of the Digital \nEconomy Act in April 2010 institutions may find it even more imperative that they demonstrate \nhow they advise their staff about copyright issues and take steps to ensure infringement does not \nhappen via their networks.  \n \nFurther reading \nSecker, Jane (2010). Copyright and E-learning: a guide for practitioners. Facet publishing: \nLondon.  \n                                                 \n6 Copyright and licences \nhttp:\/\/www.lse.ac.uk\/collections\/planningAndCorporatePolicy\/legalandComplianceTeam\/copyright\/Default.htm  \n"}