{"doi":"10.1017\/S147474640400171X","coreId":"65630","oai":"oai:dro.dur.ac.uk.OAI2:5210","identifiers":["oai:dro.dur.ac.uk.OAI2:5210","10.1017\/S147474640400171X"],"title":"The worlds of welfare : illusory and gender-blind ?","authors":["Bambra,  C."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-07-01","abstract":"The nature of welfare state regimes has been an ongoing debate within the comparative social policy literature since the publication of Esping-Andersen's The Three Worlds of Welfare Capitalism (1990). This paper engages with two aspects of this debate; the gender critique of Esping-Andersen's thesis, and Kasza's (2002) assertions about the ‘illusory nature’ of welfare state regimes. It presents a gender-focused defamilisation index and contrasts it with Esping-Andersen's decommodification index to illustrate that, whilst individual welfare states have been shown to exhibit internal variety across different policy areas, they are both consistent and coherent in terms of their policy variation by gender. It concludes, in contrast to both the gender critique of Esping-Andersen, and Kasza's rejection of the regimes concept, that the ‘worlds of welfare’ approach is therefore neither gender blind or illusory, and can, if limited to the analysis of specific areas such as labour market decommodification or defamilisation, be resurrected as a useful means of organising and classifying welfare states","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65630.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/5210\/1\/5210.pdf","pdfHashValue":"11ce403d144c2c16f72cd2a38655d93a55e0d2ff","publisher":"Cambridge University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:5210<\/identifier><datestamp>\n      2011-10-26T08:42:36Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The worlds of welfare : illusory and gender-blind ?<\/dc:title><dc:creator>\n        Bambra,  C.<\/dc:creator><dc:description>\n        The nature of welfare state regimes has been an ongoing debate within the comparative social policy literature since the publication of Esping-Andersen's The Three Worlds of Welfare Capitalism (1990). This paper engages with two aspects of this debate; the gender critique of Esping-Andersen's thesis, and Kasza's (2002) assertions about the ‘illusory nature’ of welfare state regimes. It presents a gender-focused defamilisation index and contrasts it with Esping-Andersen's decommodification index to illustrate that, whilst individual welfare states have been shown to exhibit internal variety across different policy areas, they are both consistent and coherent in terms of their policy variation by gender. It concludes, in contrast to both the gender critique of Esping-Andersen, and Kasza's rejection of the regimes concept, that the ‘worlds of welfare’ approach is therefore neither gender blind or illusory, and can, if limited to the analysis of specific areas such as labour market decommodification or defamilisation, be resurrected as a useful means of organising and classifying welfare states.<\/dc:description><dc:publisher>\n        Cambridge University Press<\/dc:publisher><dc:source>\n        Social policy and society, 2004, Vol.3(3), pp.201-212 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2004-07-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:5210<\/dc:identifier><dc:identifier>\n        issn:1474-7464<\/dc:identifier><dc:identifier>\n        issn: 1475-3073 <\/dc:identifier><dc:identifier>\n        doi:10.1017\/S147474640400171X<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5210\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1017\/S147474640400171X<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/5210\/1\/5210.pdf<\/dc:identifier><dc:rights>\n        Copyright © Cambridge University Press 2004. This paper has been published by Cambridge University Press in Social policy and society (3:3 (2004) 201-212) http:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=228839<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1474-7464","issn: 1475-3073","1474-7464"," 1475-3073"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n01 April 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBambra, C. (2004) ’The worlds of welfare : illusory and gender-blind ?’, Social policy and society., 3 (3). pp.\n201-212.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1017\/S147474640400171X\nPublisher’s copyright statement:\nCopyright Cambridge University Press 2004. This paper has been published by Cambridge University Press in Social\npolicy and society (3:3 (2004) 201-212)\nhttp:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=onlineaid=228839\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n  \n \nDurham Research Online \n \nDeposited in DRO: \n01 April 2010 \n \nPeer-review status: \nPeer-reviewed \n \nPublication status: \nPublished version \n \nCitation for published item: \nBambra, C. (2004) 'The worlds of welfare: illusory and gender-blind ?', Social policy and \nsociety.,  3 (3). pp. 201-212. \n \nFurther information on publisher’s website: \nhttp:\/\/dx.doi.org\/10.1017\/S147474640400171X \n \nPublisher’s copyright statement: \nCopyright © Cambridge University Press 2004. This paper has been published by \nCambridge University Press in Social policy and society (3:3 (2004) 201-212) \nhttp:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=228839 \n \n \n \n \n \n \n \n \n \n \nUse policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior \npermission or charge, for personal research or study, educational, or not-for-profit purposes provided that : \n \n a full bibliographic reference is made to the original source \n a link is made to the metadata record in DRO \n the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders. \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nhttp:\/\/journals.cambridge.org Downloaded: 17 Jun 2009 IP address: 129.234.4.76\nSocial Policy & Society 3:3, 201–211 Printed in the United Kingdom\nC© 2004 Cambridge University Press DOI:10.1017\/S147474640400171X\nThe worlds of welfare: illusory and gender blind?\nC l a r e B am b r a\nSchool of Social Science and Law, Sheffield Hallam University\nE-mail: c.bambra@shu.ac.uk\nThe nature of welfare state regimes has been an ongoing debate within the comparative\nsocial policy literature since the publication of Esping-Andersen’s The Three Worlds of\nWelfare Capitalism (1990). This paper engages with two aspects of this debate; the\ngender critique of Esping-Andersen’s thesis, and Kasza’s (2002) assertions about the\n‘illusory nature’ of welfare state regimes. It presents a gender-focused defamilisation index\nand contrasts it with Esping-Andersen’s decommodification index to illustrate that, whilst\nindividual welfare states have been shown to exhibit internal variety across different\npolicy areas, they are both consistent and coherent in terms of their policy variation\nby gender. It concludes, in contrast to both the gender critique of Esping-Andersen, and\nKasza’s rejection of the regimes concept, that the ‘worlds of welfare’ approach is therefore\nneither gender blind or illusory, and can, if limited to the analysis of specific areas such\nas labour market decommodification or defamilisation, be resurrected as a useful means\nof organising and classifying welfare states.\nI n t roduct ion\nEsping-Andersen’s ‘three worlds of welfare’ thesis has been the subject of an ongoing\ncritical debate in the comparative social policy literature (Esping-Andersen, 1990; 1999;\nLewis, 1992; Leibfreid, 1992; Castles and Mitchell, 1993; Orloff, 1993; Borchost, 1994;\nDaly, 1994; Kangas, 1994; Ragin, 1994; Ferrera, 1996; Shalev, 1996; Abrahamson, 1999;\nGoodin et al., 1999; Sainsbury, 1999; Pitruzzello, 1999; Arts and Gelissen, 2002; Kasza,\n2002). The debate has included a variety of different critiques: the range (Leibfreid, 1992;\nCastles and Mitchell, 1993; Ferrera, 1996), the methodology (Kangas, 1994; Ragin, 1994;\nShalev, 1996; Pitruzzello, 1999), the omission of gender (Lewis, 1992; Orloff, 1993;\nBorchost, 1994; Daly, 1994; Sainsbury, 1999), and most recently, the central concept –\nwelfare state regimes – itself (Kasza, 2002). This paper, through the presentation of a\ndefamilisation index and a subsequent typology, critically engages with the latter two\naspects of this debate; the critique that the ‘worlds of welfare’ typology is gender blind,\nand Kasza’s assertions about the ‘illusory nature’ of welfare state regimes.\nThe Th r ee wor lds o f we l f a r e\nIn The Three Worlds of Welfare Capitalism (1990), Esping-Andersen argues that ‘existing\ntheoretical models of the welfare state are inadequate’ (1990: 2) as their analysis relies\ntoo heavily upon the misleading comparison of aggregate welfare state expenditure. The\nfocus on total expenditure figures conceals the variety of state approaches to welfare;\nas ‘even if the lion’s share of expenditure or personnel serve welfare aims, the kind\n201\nhttp:\/\/journals.cambridge.org Downloaded: 17 Jun 2009 IP address: 129.234.4.76\nClare Bambra\nTable 1 The welfare state regimes\nLiberal Conservative Social Democratic\nAustralia Austria Denmark\nCanada Belgium Finland\nIreland France Norway\nNew Zealand Germany Sweden\nUK Italy\nUSA Japan\nNetherlands\nSwitzerland\nAdapted from: Esping-Andersen, 1990: 52.\nof welfare provided will be qualitatively different, as will its prioritisation relative to\ncompeting activities’ (Ibid. 1). He asserts that it is therefore more beneficial to focus\nupon what a welfare state does, rather than how much money it is afforded. On this\nbasis, Esping-Andersen presents a typology of capitalist welfare states based upon three\nprinciples: decommodification; levels of social stratification; and the relationship between\nthe state, the market and the family’s role in social provision. He concludes that through\nthe application of these principles, welfare states can be divided into three broad regime\ntypes: Liberal, Conservative; and Social Democratic (Table 1).\nThe gende r b l i nd ‘wo r lds o f we l f a r e ’\nCommentators (for example, Langan and Ostner, 1991; Lewis, 1992; Borchost, 1994;\nBussemaker and Kersbergen, 1994; Daly, 1994; Hobson, 1994; Lewis and Ostner, 1995;\nSainsbury, 1994, 1999) have argued that this ‘three worlds of welfare’ typology is deeply\nflawed because it marginalized women in its analysis. Aside from the overt absence of\nwomen in Esping-Andersen’s analysis, the critique revolves around three other issues: the\ngender blind concept of decommodification (Daly, 1994; Hobson, 1994; Lewis, 1992),\nthe unawareness of the role of women and the family in the provision of welfare (Borchost,\n1994; Bussemaker and Kersbergen, 1994; Daly, 1994), and the lack of consideration given\nto gender as a form of social stratification (Bussemaker and Kersbergen, 1994). These\ncriticisms have in turn led to both theoretical attempts to ‘gender’ Esping-Andersen’s\nanalysis (for example, Orloff, 1993; O’Connor, 1996), and the construction of alternative\nwelfare state typologies in which gender has been a more overt and centralised part of\nthe analysis (for example Lewis, 1992; Lewis and Ostner, 1995; Sainsbury, 1999). These\nrival typologies, although often flawed themselves (Esping-Andersen, 1999) through the\nuse of only one factor (Sainsbury, 1999) or a limited number of countries (Lewis, 1992),\nhave been used to undermine the ‘worlds of welfare’ thesis and to denigrate its validity,\nespecially in respect to claims about women, welfare and the family.\nThe i l l u s i on o f we l f a r e s t a t e r e g imes\nSimilarly, Kasza (2002) has also questioned the validity of the regimes concept. He argues\nthat ‘the concept of welfare regimes is not a workable basis for research’ (2002: 283) as\n202\nhttp:\/\/journals.cambridge.org Downloaded: 17 Jun 2009 IP address: 129.234.4.76\nThe worlds of welfare: illusory and gender blind?\nit incorporates two flawed assumptions: firstly, that most of the key social policy areas,\nsuch as income maintenance, education, health or housing, within a welfare regime will\nreflect a similar, across the board approach to welfare provision, particularly in respect of\nthe role of the state; and, secondly, that each regime type itself reflects ‘a set of principles\nor values that establishes a coherence in each country’s welfare package’ (Kasza, 2002:\n272). Kasza asserts that instead of an internal policy homogeneity or cohesion, welfare\nstates and welfare regimes exhibit significant variation across different areas of social\nprovision. He asserts that the regime concept therefore ‘does not capture the complex\nmotives that inform each country’s welfare programmes’ and, in pursuit of consistency,\nit ignores the fact that different areas of welfare state provision exhibit different cross-\nnational variations. Kasza concludes that, in light of the internal policy diversity of welfare\nstates, the best approach for future comparative research may be to abandon the regimes\nconcept altogether – even for single policy comparisons (2002: 284).\nThe defamilisation index presented in this paper is used, in conjunction with Esping-\nAndersen’s original typology, to examine two interrelated hypotheses: firstly, that the\ngender critique of the worlds of welfare thesis is not empirically robust, as the ‘three\nworlds of welfare’ typology is not altered in any significant way by the addition of a more\novertly gendered approach; and, secondly, in so doing, to reiterate that, whilst welfare\nstate regimes have been shown to exhibit internal inconsistency across different policies\n(Kasza, 2002; Kautto, 2002; Bambra (in press), the regimes concept can, if limited to the\nanalysis of specific areas such as labour market decommodification or defamilisation,\nbe resurrected as a useful means of organising and classifying welfare states (Arts and\nGelissen, 2002). It concludes, in contrast to both the gender critique of Esping-Andersen,\nand Kasza’s rejection of the regimes concept, that the ‘worlds of welfare’ approach is\ntherefore neither gender blind or illusory.\nThis article proceeds with a critical overview of the concept of defamilisation, presents\nthe alternative index, and discusses the resulting typology in relation to the two hypotheses\ndrawn from the debate that has surrounded the ‘three worlds of welfare’.\nDefami l i sa t ion\nThe concept of defamilisation originates in the feminist literature on citizenship (Lister,\n1988) and it has been appropriated by, and used intermittently within, the post-‘worlds of\nwelfare’ debate (Taylor-Gooby, 1996; Esping-Andersen, 1999; Korpi, 2000). Indeed, there\nhave been previous attempts at ‘defamilisation’ based typologies – most notably those of\nEsping-Andersen (1999) and Korpi (2000). However, the term ‘defamilisation’ has often\nbeen, inappropriately, defined by commentators as the extent to which welfare states\nsupport the family. For example, in their work both Esping-Andersen and Korpi utilise\nthis conceptualisation of defamilisation and their typologies subsequently rely on factors\nwhich assess the extent to which welfare states support the family (Esping-Andersen,\n1999) or different family models (Korpi, 2000), such as overall public family spending\nor overall public commitment to the subsidy of child families. There is an alternative\ndefinition of defamilisation that, whilst it has been far less apparent within the literature,\nseems more relevant to the gender critique of Esping-Andersen’s typology (Borchost, 1994;\nBussemaker and Kersbergen, 1994; Daly, 1994). In this definition, defamilisation refers to\nthe extent to which the welfare state undermines women’s dependency on the family and\nfacilitates women’s economic independence (Taylor-Gooby, 1996). The defamilisation\n203\nhttp:\/\/journals.cambridge.org Downloaded: 17 Jun 2009 IP address: 129.234.4.76\nClare Bambra\nindex presented in this paper reflects this second definition and therefore uses factors\nthat are concerned with female freedom from the family, rather than the freedom of the\nfamily.\nDefami l i sa t ion index\nThe defamilisation index is methodologically constructed in the same way as Esping-\nAndersen’s decommodification index. Even though his methodology has certain draw-\nbacks, such as the use of averaging, and has met with some criticism within the literature\n(Castles and Mitchell, 1993; Kangas, 1994; Ragin, 1994; Shalev, 1996; Pitruzello, 1999),\nit is important that the index replicates Esping-Andersen’s method to ensure compatibility,\ncomprehensiveness and sophistication.\nCoun t r i e s\nThe defamilisation index includes the same 18 OECD countries used by Esping-Andersen:\nAustralia, Austria, Belgium, Canada, Denmark, Finland, France, Germany, Ireland, Italy,\nJapan, Netherlands, New Zealand, Norway, Sweden, Switzerland, UK, and USA.\nData and s ou rces\nLocating suitable data for the defamilisation index was a difficult task as there is very\nlittle international data which specifically relate to women. International data are seldom\n‘gender sensitive’ as, for example, whilst wage rate comparisons between countries are\noften provided, statistical sources seldom compare male and female wage rates within\nand\/or between countries, and there are no specific international databases relating to\nsuch issues as female employment, maternity leave or child care provision. Although there\nare a number of different national statistics that relate to the specialised contents of the\ndefamilisation index, their availability is limited and furthermore, statistics from individual\ncountries are often difficult to compare with one another, as they have been collected and\npresented using a variety of different methods, concepts and measurements. Therefore, the\ndefamilisation index is based upon data from a number of different international statistical\nsources, such as the OECD and the UN, and international studies by commentators such\nas Gaulthier (1996). Unfortunately, the shortage of available data has also led to a slight\ntime lag, as the most recent available and comparable data were from 1997.\nM e a s u r e s\nIn this paper, defamilisation is concerned directly with the relationship between women,\nthe state and the family; the index is therefore based on the assessment of the following\nfour factors (see Table 2 for data details):\n(1) Relative female labour participation rate;\n(2) Maternity leave compensation;\n(3) Compensated maternity leave duration;\n(4) Average female wage.\nEach of these factors has been specifically selected to highlight a certain aspect of how the\nwelfare state undermines female dependency on the family and facilitates their economic\n204\nhttp:\/\/journals.cambridge.org Downloaded: 17 Jun 2009 IP address: 129.234.4.76\nThe worlds of welfare: illusory and gender blind?\nTable 2 Defamilisation index data (1996\/7)\nMaternity Leave\nRelative female Compensation Compensated Average Female\nlabour participation for First 12 weeks Maternity Leave Wage (expressed\nrate for persons (expressed as Duration as a percentage\naged 15–64 a percentage (number of of male average\n(percent)(i) of normal pay) weeks) wage)(x)\nAustralia 19.5 0(ii) 0 85.1\nAustria 18.6 100 16 65.6\nBelgium 20.2 77(iii) 15 79.5\nCanada 13.4 55 15 (76.5)\nDenmark 11.7 100 18 83.3\nFinland 5.2 80 28(vii) 79.3\nFrance 14.2 100 16(viii) 79.1\nGermany 18.0 100 14 74.3\nIreland 27 70 14 73.7\nItaly 29 80 35 (76.5)\nJapan 26.1 60 14 56.7\nNetherlands 20.4 100 16 75.1\nNew Zealand 16.7 0 0 77.8\nNorway 10.0 100 18 87.3\nSweden 4.6 75(iv) 65(ix) 90.0\nSwitzerland 17.5 100 8 68.7\nUK 17.1 50(v) 18 72.5\nUSA 14.2 0 0 (76.5)\nMean 16.86 83.1(vi) 20.66(vi) 76.5\nNotes: (i) Calculated as the difference between the female and male labour participation rate. For\nexample, if the male participation rate was 78.9 per cent and the female participation rate was 76.4\nper cent then the relative female labour participation rate would be (−) 2.5 per cent.\n(ii) A replacement rate of 60 per cent is available to some women but this scheme only covers\naround 10 per cent of the female population and it has therefore not been included (see Sainsbury,\n1999: 125).\n(iii) 82 per cent for the first 4 weeks and 75 per cent for the remaining 11 weeks.\n(iv) 1 year at 75 per cent, the remaining 3 months at the flat rate.\n(v) 90 per cent for 6 weeks, flat rate for remaining 12 weeks.\n(vi) Excluding those countries that have a value of 0.\n(vii) 15 weeks maternity leave; the remaining 13 weeks are parental leave that can be taken by the\nmother or the father.\n(viii) Maternity leave duration ranges between 16 and 26 weeks depending on the number of\nchildren. Since 1981, paid leave is 26 weeks for the third and subsequent children (Gaulthier,\n1996: 175).\n(ix) Paid parental leave which can be taken by either the mother or the father. Compulsory maternity\nleave (which is only available to the mother) constitutes 14 weeks of this period. The first 52 weeks\nare compensated at 75 per cent and the remaining 13 weeks are paid at the flat rate.\n(x) Figures in brackets depict those countries for which separate male and female wage data was\nnot available and which have therefore been weighted by the mean.\nAdapted from: Gaulthier, 1996: Table 10.5, p. 179; Table 10.3, p. 180; Table 10.6, p. 181;\nOECD, 1998: pp. 82–83; UN, 1999: Table 33, pp. 303–310; UN, 2000: Chart 5.23, p. 132;\nTable 5c, pp. 142–143.\n205\nhttp:\/\/journals.cambridge.org Downloaded: 17 Jun 2009 IP address: 129.234.4.76\nClare Bambra\n< (mean + SD) = 3\nFactor  × (1,2,3)  } c. (mean) = 2\n> (mean + SD) = 1\nFigure 1. Decommodification scoring formula.\nAdapted from: Esping-Andersen, 1990: 54.\nindependence. The first factor, relative female labour participation rate has been chosen\nbecause it indicates the extent to which the economy of the welfare state facilitates\nfemale employment. It is ‘relative’ because it is measured in relation to male employment\nlevels, thus reducing the influence of different national unemployment rates. This factor\nprovides a measure of one way in which women gain economic independence from\nthe family, enter the public realm; and gain access to certain social rights (Meyer, 1994:\n67–68).\nFactors 2 and 3, maternity leave compensation and compensated maternity leave\nduration, are intended to show whether the welfare state provides economic support\nwhen women decide to have children or if it encourages reliance on the family. Factor 2,\nmaternity leave compensation, shows the level of replacement income which women\nreceive when they are absent from work due to pregnancy. Factor 3, compensated\nmaternity leave duration, indicates the length of time for which women can take paid\nmaternity leave.\nFactor 4, average female wage, has been selected to weight the other factors because\nit indicates the ease with which women can independently maintain a decent standard\nof living and, as it is expressed as a percentage of the average male wage (Table 2),\nit also shows the extent of gender pay inequality. Furthermore, the level of a woman’s\nindependent income is an important factor in providing women with a choice between\nfamily\/state dependency and paid employment. This factor has been chosen as a weight\nin preference to the other factors because if the paid employment in which women\nparticipate provides only a small average income then it is not a real alternative to\nreliance upon the family or the state.\nMethod\nThe process of scoring for the defamilisation index replicates that used by Esping-Andersen\n(1990: 50−54) and is by way of the numerical description of the relationship of an\nindividual country’s score to the mean (and standard deviation) for three (1−3) of the four\nfactors that make up the index (Figure 1). On the basis of the values on each of these\nthree indicators for the 18 nations, a score of 1 for low defamilisation; 2 for medium;\nand 3 for high defamilisation was given. Following Esping-Andersen, the classification\ninto three scores has been done on the basis of one standard deviation from the mean\nwith adjustment where necessary for extreme outliers (1990: 54). These individual factor\nscores have then been combined and the total has been weighted by factor four – average\nfemale wage.\n206\nhttp:\/\/journals.cambridge.org Downloaded: 17 Jun 2009 IP address: 129.234.4.76\nThe worlds of welfare: illusory and gender blind?\nTable 3 The degree of defamilisation\nAustralia 17.0\nAustria 45.9\nBelgium 47.7\nCanada 38.3\nDenmark 66.6\nFinland 63.4\nFrance 55.4\nGermany 52.0\nIreland 36.9\nItaly 45.9\nJapan 22.7\nNetherlands 52.6\nNew Zealand 15.6\nNorway 69.8\nSweden 72.0\nSwitzerland 41.2\nUK 36.3\nUSA 15.3\nMean 44.1\nResu l ts\nThe assessment and combination of these factors produces an indicative defamilisation\nindex (Table 3). This index shows a wide range of defamilisation scores, from the USA’s\nscore of 15.3 to the highest score of 72.0 awarded to Sweden. The majority of countries\nfall in a smaller range of between 36.3 (UK) and 55.4 (France). None of the scores are\nsurprisingly high or surprisingly low and those allotted to each country, and the range\nof scores, are very similar to those under Esping-Andersen’s index (Esping-Andersen,\n1990: 54). This suggests that the addition of a more gender sensitive analysis does\nnot greatly alter the relative relationships of the index countries. In order to make a\nmore informed comparison between the results of the defamilisation index and Esping-\nAndersen’s typology the, mean plus\/minus SD method (figure 1) used to construct the\nindex can be continued in order to place the countries into one of three groups. This\nprocess produces a comparable typology (Table 4).\nThere are striking similarities between the arrangements of countries in Esping-\nAndersen’s decommodification regimes and the defamilisation groups. The vast majority\nof countries are placed in similar groupings as in Esping-Andersen’s index. For example,\nAustralia (17.0), New Zealand (15.6), and the USA (15.3) are in the lowest defamilisation\ngroup; Austria (45.9), Belgium (47.7), France (55.4), Germany (52.0), Italy (45.9), the\nNetherlands (52.6) and Switzerland (41.2) are in the medium level defamilisation group;\nand Denmark (66.6), Finland (63.4), Norway (69.8) and Sweden (72.0) are by far the\nhighest scoring countries and remain as a distinctive high-scoring group, separate from\nthe other index countries by a large difference in both their decommodification (Esping-\nAndersen, 1990: 52) and defamilisation scores. There are however some slight differences\nin group composition, most notably there has been a reduction in the size of the lowest\nscoring group of countries: Canada (38.3), Ireland (36.9) and the UK (36.3) are in the\n207\nhttp:\/\/journals.cambridge.org Downloaded: 17 Jun 2009 IP address: 129.234.4.76\nClare Bambra\nTable 4 Worlds of welfare and defamilisation\nLiberal Low Defamilisation\nAustralia Australia\nCanada Japan\nIreland New Zealand\nNew Zealand USA\nUK\nUSA\nConservative Medium Defamilisation\nAustria Austria\nBelgium Belgium\nFrance Canada\nGermany France\nItaly Germany\nJapan Ireland\nNetherlands Italy\nSwitzerland Netherlands\nNorway\nSwitzerland\nUK\nSocial Democratic High Defamilisation\nDenmark Denmark\nFinland Finland\nNorway Norway\nSweden Sweden\nmedium defamilisation group 2, whereas in the decommodification typology they were\nin the low scoring Liberal regime. Another difference between the two typologies is\nthe alteration of Japan’s (22.7) group position from the Conservative regime (medium\ndecommodification) to the lowest defamilisation group. However, overall the differences\nbetween the two typologies are very slight – only four countries have changed position –\nand the emphasis is therefore on similarity rather than change in respect of the relative\nscores and relationships of the countries.\nDiscuss ion\nEarlier in the paper, two interrelated hypotheses were outlined: first, that the gender\ncritique of the worlds of welfare thesis is not empirically robust, as the ‘three worlds\nof welfare’ typology is not altered in any significant way by the addition of a more\novertly gendered approach; and, secondly, that the regimes concept can, if limited to the\nanalysis of specific areas such as labour market decommodification or defamilisation, be\nresurrected as a useful means of organising and classifying welfare states. It is useful to\nbriefly return to these hypotheses in the context of the comparison of the two typologies.\nThe gender critique of Esping-Andersen’s ‘three worlds of welfare’ is centred upon the\nclaim that the typology is gender blind and does not therefore reflect women’s experiences\nof the welfare state. The defamilisation index presented in this paper has focused\nitself upon gender and the role of the welfare state in facilitating women’s economic\n208\nhttp:\/\/journals.cambridge.org Downloaded: 17 Jun 2009 IP address: 129.234.4.76\nThe worlds of welfare: illusory and gender blind?\nindependence from the family. The resulting typology has shown stark similarities with\nthe ‘three worlds of welfare’ typology and it therefore undermines the gender critique\nas it suggests that, whilst Esping-Andersen had gender in the corner rather than the fore\nfront of his eye when constructing the decommodification index, it nonetheless has fairly\naccurately captured the extent to which women’s experiences of the welfare state differ\nby country and regime type. The ‘three worlds’ typology is therefore not gender blind as\nhas been claimed, as it has reflected women’s relationship with the welfare state, albeit\nin an implicit rather than an overt way.\nThe second hypothesis focused on Kasza’s critique of the regimes concept itself. The\ncomparison of the defamilisation and decommodification indexes partially undermines\nKasza’s claim that welfare state regimes are illusory. This paper, whilst acknowledging one\naspect of Kasza’s critique – that it is inappropriate to use the regime concept, and Esping-\nAndersen’s ‘three worlds’ thesis, to generalise about all different aspects of a country’s\nwelfare provision – has nonetheless suggested, through the addition of the defamilisation\nindex to Esping-Andersen’s original, that it is unnecessary to wholeheartedly reject the\nentire regimes concept as Kasza has implied (2002: 284). The similarities identified\nbetween the two typologies suggest that the regimes concept maintains its value as a\nmeans of identifying commonalities within, and between, the principles and provisions of\ndiverse welfare states. Regimes, ideal types or ‘worlds’, remain a useful way of describing,\norganising and classifying (Arts and Gelissen, 2002) across what can be quite broad\nareas of policy, such as labour market decommodification or defamilisation. However,\nthe concept is still analytically restricted and it should therefore not be overused: the\ngeneralised claims that result from regime typologies are only valid when they are limited\nto the actual original areas of analysis; otherwise the concept may well become illusory\nand unrelated to empirical reality.\nConc lus ions\nThe comparison of the defamilisation index groups with Esping-Andersen’s ‘worlds of\nwelfare’ typology has revealed remarkable similarities in the composition of the three\ngroups and the relative relationships of the 18 countries. These results are not isolated, as\nother ‘defamilisation’ typologies have also noted a lack of significant difference (Esping-\nAndersen, 1999; Korpi, 2000). The two hypotheses under examination in this paper\nhave thereby both been upheld: the gender critique of the worlds of welfare thesis is not\nempirically robust, as the ‘three worlds of welfare’ typology is not altered in any significant\nway by the addition of a more overtly gendered approach; and the regimes concept can,\nif limited to the analysis of specific areas such as labour market decommodification or\ndefamilisation, be resurrected as a useful means of organising and classifying welfare\nstates. In contrast to both the gender critique of Esping-Andersen, and Kasza’s rejection\nof the regimes concept, the joint examination of defamilisation and decommodification\nhas revealed that the ‘worlds of welfare’ approach is neither gender blind or illusory.\nAcknowledgements\nThe research in this paper was funded by a UK Economic and Social Research Council\nBursary.\n209\nhttp:\/\/journals.cambridge.org Downloaded: 17 Jun 2009 IP address: 129.234.4.76\nClare Bambra\nRefe rences\nAbrahamson, P. (1999), ‘The welfare modelling business’, Social Policy and Administration, 33, 4,\n393−415.\nArts, W. and Gelissen, J. (2002), ‘Three worlds of welfare or more?’, Italic of European Social Policy, 12,\n2, 137−158.\nBambra, C. (in press), ‘Worlds of welfare and the health care discrepancy’, Social Policy and Society.\nBorchost, A. (1994), ‘Welfare state regimes, women’s interests and the EC’, in D. Sainsbury (ed.), Gendering\nWelfare States, London: Sage.\nBussemaker, J. and Kersbergen, K. (1994), ‘Gender and the welfare state: some theoretical reflections’, in\nD. Sainsbury (ed.), Gendering Welfare States, London: Sage.\nCastles, F.G. and Mitchell, D. (1993), ‘Worlds of welfare and families of nations’, in F.G. Castles (ed.),\nFamilies of Nations: Patterns of Public Policy in Western Democracies, Aldershot: Dartmouth.\nDaly, M. (1994), ‘Comparing welfare states: towards a gender friendly approach’, in D. Sainsbury (ed.),\nGendering Welfare States, London: Sage.\nEsping-Andersen, G. (1990), The Three Worlds of Welfare Capitalism, London: Polity.\nEsping-Andersen, G. (1999), Social Foundations of Post-Industrial Economies, Oxford: Oxford University\nPress.\nFerrera, M. (1996), ‘The southern model of welfare in social Europe’, Italic of European Social Policy, 6,\n1, 17–37.\nGaulthier, A. (1996), The State and the Family: A Comparative Analysis of Family Policies in Industrialised\nCountries, Oxford: Clarendon.\nGoodin, R., Headley, B., Muffels, R., and Dirvin, H. (1999), The Real Worlds of Welfare Capitalism,\nCambridge: Cambridge University Press.\nHobson, B. (1994), ‘Solo mothers, social policy regimes, and the logics of gender’, in D. Sainsbury (ed.),\nGendering Welfare States, London: Sage.\nKangas, O. (1994), ‘The politics of social security: on regressions, qualitative comparisons and cluster\nanalysis’, in T. Janoski and A. Hicks (eds), The Comparative Political Economy of the Welfare State,\nCambridge: Cambridge University Press.\nKasza, G. (2002), ‘The illusion of welfare regimes’, Italic of Social Policy, 31, 2, 271–287.\nKautto, M. (2002), ‘Investing in services in West European welfare states’, Italic of European Social Policy,\n12, 1, 53–65.\nKorpi, W. (2000), ‘Faces of inequality: gender, class and patterns of inequalities in different types of welfare\nstates’, Social Politics, 7, 2.\nLangan, M. and Ostner, I. (1991), ‘Gender and welfare: towards a comparative framework’, in G. Room\n(ed.), Towards a European Welfare State, Bristol: SAUS Publications.\nLeibfried, S. (1992), ‘Towards a European welfare state’, in Z. Ferge and J.E. Kolberg (eds), Social Policy in\na Changing Europe, Frankfurt: Campus-Verlag.\nLewis, J. (1992), ‘Gender and the development of welfare regimes’, Italic of European Social Policy,\n2, 3.\nLewis, J. and Ostner, I. (1995), ‘Gender and the evolution of European social policy’, in S. Leibfreid and\nP. Pierson (eds), European Social Policy, Washington, DC: Brookings Institute.\nLister, R. (1988), Citizenship: Feminist Perspectives, London: Macmillan.\nMeyer, T. (1994), ‘The German and British welfare state as employers: patriarchal or emancipatory’, in\nD. Sainsbury (ed.), Gendering Welfare States, London: Sage.\nO’Connor, J.S. (1996), ‘Gendering welfare state regimes’, Current Sociology, 44, 2, 1–130.\nOECD (1998), Employment Outlook, Paris: OECD.\nOrloff, A. (1993), ‘Gender and the social rights of citizenship: the comparative analysis of gender relations\nands welfare states’, American Sociological Review, 58, 303–328.\nPitruzello, S. (1999), ‘Decommodification and the worlds of welfare capitalism: a cluster analysis’, Seminar\narticle WS\/90, Florence: European University Institute.\n210\nhttp:\/\/journals.cambridge.org Downloaded: 17 Jun 2009 IP address: 129.234.4.76\nThe worlds of welfare: illusory and gender blind?\nRagin, C. (1994), ‘A qualitative comparative analysis of pension systems’, in T. Janoski and A. Hicks (eds),\nThe Comparative Political Economy of the Welfare State, Cambridge: Cambridge University Press.\nSainsbury, D. (1999), ‘Gender, policy regimes and politics’, in D. Sainsbury (ed.), Gender and Welfare\nState Regimes, Oxford: Oxford University Press.\nSainsbury, D. (ed.) (1994), Gendering Welfare States, London: Sage.\nShalev, M. (1996), The Privatisation of Social Policy? Occupational Welfare and the Welfare State in\nAmerica, Scandinavia and Japan, London: Macmillan.\nTaylor-Gooby, P. (1996), ‘The response of government: fragile convergence’, in V. George and P. Taylor-\nGooby (eds), European Welfare Policy, London: Macmillan.\nUnited Nations (1999), Statistical Yearbook, New York: United Nations.\nUnited Nations (2000), The World’s Women 2000, New York: United Nations.\n211\n"}