{"doi":"10.1093\/heapro","coreId":"15535","oai":"oai:dro.dur.ac.uk.OAI2:6938","identifiers":["oai:dro.dur.ac.uk.OAI2:6938","10.1093\/heapro"],"title":"The evolution of a UK regional tobacco control office in its early years : social contexts and policy dynamics.\\ud","authors":["Russell,  A.","Heckler,  S.","White,  M.","Sengupta,  S.","Chappel,  D.","Hunter,  D. J.","Mason,  J.","Milne,  E.","Lewis,  S."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-09-01","abstract":"The Smoke Free North East Office (SFNEO) is the first dedicated tobacco control office in the UK coordinating a regional tobacco control network, Smoke Free North East (SFNE). On the basis of ethnographic research conducted between 2006 and 2008, this article examines the context for SFNEO's emergence at this time and in this region of England, and the main policy and practice challenges it has faced in its early years. SFNE formed in a favourable political and cultural climate, although regional champions were crucial in setting it up. It has worked well in branding itself and in taking advantage of the opportunity to lobby in support of comprehensive smoke-free legislation, although the success of the legislation presents a risk that people will regard SFNE's work as finished. There is a need for independent sustainable funding, strong partnership working and the ‘bringing together’ of existing organizations under its leadership for an organization such as SFNE to succeed. SFNE offers a model that is transferable to other places as well as to other public health concerns such as alcohol, and has been taken up by public health planners and policy makers with alacrity. This indicates a general perception that SFNE plays an effective role in public health delivery. \\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15535.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/6938\/1\/6938.pdf","pdfHashValue":"917230cdaee2f69aeaed43e3198edbb465f37537","publisher":"Oxford University Press","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:6938<\/identifier><datestamp>\n      2010-07-21T11:06:40Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The evolution of a UK regional tobacco control office in its early years : social contexts and policy dynamics.\\ud\n<\/dc:title><dc:creator>\n        Russell,  A. <\/dc:creator><dc:creator>\n        Heckler,  S. <\/dc:creator><dc:creator>\n        White,  M. <\/dc:creator><dc:creator>\n        Sengupta,  S. <\/dc:creator><dc:creator>\n        Chappel,  D. <\/dc:creator><dc:creator>\n        Hunter,  D. J. <\/dc:creator><dc:creator>\n        Mason,  J. <\/dc:creator><dc:creator>\n        Milne,  E. <\/dc:creator><dc:creator>\n        Lewis,  S.<\/dc:creator><dc:description>\n        The Smoke Free North East Office (SFNEO) is the first dedicated tobacco control office in the UK coordinating a regional tobacco control network, Smoke Free North East (SFNE). On the basis of ethnographic research conducted between 2006 and 2008, this article examines the context for SFNEO's emergence at this time and in this region of England, and the main policy and practice challenges it has faced in its early years. SFNE formed in a favourable political and cultural climate, although regional champions were crucial in setting it up. It has worked well in branding itself and in taking advantage of the opportunity to lobby in support of comprehensive smoke-free legislation, although the success of the legislation presents a risk that people will regard SFNE's work as finished. There is a need for independent sustainable funding, strong partnership working and the ‘bringing together’ of existing organizations under its leadership for an organization such as SFNE to succeed. SFNE offers a model that is transferable to other places as well as to other public health concerns such as alcohol, and has been taken up by public health planners and policy makers with alacrity. This indicates a general perception that SFNE plays an effective role in public health delivery. \\ud\n<\/dc:description><dc:subject>\n        Tobacco control<\/dc:subject><dc:subject>\n         Public health practice<\/dc:subject><dc:subject>\n         Public policy<\/dc:subject><dc:subject>\n         England.<\/dc:subject><dc:publisher>\n        Oxford University Press<\/dc:publisher><dc:source>\n        Health promotion international, 2009, Vol.24(3), pp.262-268 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2009-09-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:6938<\/dc:identifier><dc:identifier>\n        issn:0957-4824<\/dc:identifier><dc:identifier>\n        issn: 1460-2245<\/dc:identifier><dc:identifier>\n        doi:10.1093\/heapro\/dap023 <\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6938\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1093\/heapro\/dap023 <\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/6938\/1\/6938.pdf<\/dc:identifier><dc:rights>\n        This is a pre-copy-editing author-produced PDF of an article accepted for publication in Health promotion international following peer review. The definitive publisher-authenticated version Russell, A. and Heckler, S. and White, M. and Sengupta, S. and Chappel, D. and Hunter, D. J. and Mason, J. and Milne, E. and Lewis, S. (2009) 'The evolution of a UK regional tobacco control office in its early years : social contexts and policy dynamics.', Health promotion international., 24 (3). pp. 262-268 is available online at: http:\/\/heapro.oxfordjournals.org\/cgi\/content\/abstract\/24\/3\/262<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1460-2245","0957-4824","issn:0957-4824"," 1460-2245"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["Tobacco control","Public health practice","Public policy","England."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n21 July 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nRussell, A. and Heckler, S. and White, M. and Sengupta, S. and Chappel, D. and Hunter, D. J. and Mason, J.\nand Milne, E. and Lewis, S. (2009) ’The evolution of a UK regional tobacco control office in its early years :\nsocial contexts and policy dynamics.’, Health promotion international., 24 (3). pp. 262-268.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1093\/heapro\/dap023\nPublisher’s copyright statement:\nThis is a pre-copy-editing author-produced PDF of an article accepted for publication in Health promotion\ninternational following peer review. The definitive publisher-authenticated version Russell, A. and Heckler, S. and\nWhite, M. and Sengupta, S. and Chappel, D. and Hunter, D. J. and Mason, J. and Milne, E. and Lewis, S. (2009) ’The\nevolution of a UK regional tobacco control office in its early years : social contexts and policy dynamics.’, Health\npromotion international., 24 (3). pp. 262-268 is available online at:\nhttp:\/\/heapro.oxfordjournals.org\/cgi\/content\/abstract\/24\/3\/262\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nThe evolution of a UK regional tobacco control office in its early \nyears: social contexts and policy dynamics \n \nAuthors: Andrew Russell, Serena Heckler, Martin White, Soumen Sengupta, David Chappel, \nDavid J Hunter, James Mason, Eugene Milne, Susan Lewis \n \nCorresponding author: \nDr Andrew Russell \nMedical Anthropology Research Group \nDurham University \nDepartment of Anthropology \n43 Old Elvet \nDurham DH1 3HN \n \na.j.russell@durham.ac.uk \nTel: +44-191-334-6196 \nFax: +44-191-334-6101 \n \nCo-authors: \nSerena Heckler, Durham University, Durham, UK \nMartin White, Institute of Health & Society, Newcastle University, Newcastle-upon-Tyne, \nUK \nSoumen Sengupta, West Dunbartonshire Community Health Partnership, Dumbarton, UK \nDavid Chappel, North East Public Health Observatory, Stockton-on-Tees, UK \nDavid J Hunter, Durham University, Durham, UK \nJames Mason, Durham University, Durham, UK \nEugene Milne, North East Strategic Health Authority, Newcastle-upon-Tyne, UK \nSusan Lewis, Durham University, Durham, UK \n \nKeywords: \nTobacco control, public health practice, public policy, England \n \nText length (excluding title page, summary, references, and table): 3,612 \nTotal word count (including title page, summary, references, and table): 4,413 \n    \n \n \nSUMMARY \nThe Smoke Free North East Office (SFNEO) is the first dedicated tobacco control \noffice in the UK coordinating a regional tobacco control network, Smoke Free North \nEast (SFNE). Based on ethnographic research conducted between 2006 and 2008, \nthis article examines the context for SFNEO’s emergence at this time and in this \nregion of England, and the main policy and practice challenges it has faced in its \nearly years. SFNE formed in a favourable political and cultural climate, although \nregional champions were crucial in setting it up. It has worked well in branding itself \nand in taking advantage of the opportunity to lobby in support of comprehensive \nsmoke free legislation, although the success of the legislation presents a risk that \npeople will regard SFNE’s work as finished. There is a need for independent \nsustainable funding, strong partnership working, and the ‘bringing together’ of \nexisting organisations under its leadership if an organisation such as SFNE is to \nsucceed. SFNE offers a model that is transferable to other places as well as to other \npublic health concerns such as alcohol, and has been taken up by public health \nplanners and policy makers with alacrity. This indicates a general perception that \nSFNE plays an effective role in public health delivery. \n \n    \n \nThe evolution of a UK regional tobacco control office in its early \nyears: social contexts and policy dynamics \n \nINTRODUCTION \nWhen it was launched on 31 May 2005, the Smoke Free North East Office (SFNEO) was the \nfirst tobacco control office of its kind in the UK (Fresh Smoke Free North East, 2006). It \noffers a public health delivery model that has generated considerable interest, not only for \ntobacco control but also as a way of tackling other issues such as alcohol. This article looks at \nthe formation and early years development of the SFNEO and the regional tobacco control \nnetwork that it coordinates, Fresh Smoke Free North East (SFNE). It answers Wanless (2002; \n2004) and the call of other UK policy documents (such as the 2004 White Paper Choosing \nHealth) for micro-level, real time studies of how decisions are made and the processes that \nunderpin them. This is the subject matter of this paper. While the efficacy of complex \ninterventions such as SFNE can be tested using evaluations based on health outcomes, the \ninstitutional and cultural contexts in which these interventions are carried out are less \namenable to experimental manipulation but can be crucial for the effective translation of \nresearch into practice (Nutbeam, 1998; Campbell et al., 2007; Oldenburg et al., 1999; \nEckersley et al., 2001:285; Glasgow et al., 2003). We look at how SFNEO has developed in \nits first few years, the international, national and regional contexts for this development, and \nsuggest principles from its early years‟ experience that can be generalised to other areas. \n \nMETHODS \nData for this article was collected between April 2006 and March 2008. Ethnographic \nmethods were used to build up a detailed and comprehensive picture of the organisational \nculture and policy contexts in which the director, two regional coordinators and other \n    \n \ncommissioned and administrative staff of SFNEO operate. Participant-observation of events \nwas supplemented by the analysis of relevant documents, and semi-structured interviews with \nkey stakeholders – SFNEO staff, 15 of the 20 members of the SFNE Strategic Advisory Panel \n(SAP), eight of the nine other Regional Tobacco Programme managers (RTPMs), and four \nmembers of staff on the national tobacco team at the Department of Health. Examples of \nparticipant-observational research activities included „deep hanging out‟ (Wogan 2004) in the \nSFNEO, shadowing the director and other members of staff to observe the roles and \nrelationships of the SFNEO with other bodies, and attending meetings of the various SFNE \ncommittees and those of related organisations. Interviews were either face-to-face or by \ntelephone, and the results recorded (with permission of the interviewee), transcribed and \nanalysed by coding into key topics identified by the research team (Miles and Huberman, \n1994). Research progress and outcomes were overseen and reflected upon by a \nmultidisciplinary steering committee which met at six weekly intervals. Ethical approval for \nthe research was obtained from the Sunderland NHS research ethics committee on behalf of \nthe Central Research Ethics Committee of the NHS.  \n \nRESULTS \nInternational, national and regional contexts \nThe initial inspiration for the development of a tobacco control office in the NE of England \nwas the experience of California where smoking rates reduced to 14% from 1989 through the \nprinciple of changing social norms so that tobacco became less desirable, acceptable and \naccessible (California Department of Health Services, 1998; CDC, 1999). However, the \nsituation in the NE of England is different to that of California, and SFNE does not slavishly \nfollow the California model. Other countries (e.g. Ireland in March 2004 and Scotland in \nMarch 2006) subsequently introduced tobacco control measures in advance of England, where \nsmoke free public places legislation came into force in July 2007. Models for tobacco control \n    \n \nalso existed in Australia, where the director of the SFNEO had worked for several years, and \nNew Zealand (Studlaw, 2005).  \nThe national context was also important. In 1997, a new Labour government was \nswept to power which, through its „Third Way‟ (Hale et al., 2004), sought to define itself as \ndifferent from what had gone before, including launching a new public health agenda. For \nexample, the 1999 White Paper Saving Lives: Our Healthier Nation rejected “the old \narguments of the past” through altering the discourse from „health variation‟ to „health \ninequality‟, and shifting the emphasis towards social, economic and environmental factors as \ndeterminants of ill-health. This orientation was also reflected in the 1998 Report of the \nScientific Committee on Tobacco and Health which highlighted the dangers of passive as well \nas active smoking. The White Paper Smoking Kills, published in the same year, highlighted \nthe key role of smoking in shortening lives, and listed all the areas of concern which were \nsubsequently to become the focus of SFNE‟s work. Following a policy introduced by the ten \nyear NHS Plan, one of the first National Service Frameworks (NSFs), that for coronary heart \ndisease (CHD), came out in 2000. It highlighted smoking cessation services and tobacco \nadvertising as two important areas for the prevention of CHD. With the increasing focus on its \ndangers, the idea of „controlling tobacco‟ was no longer regarded as maverick. The UK \nTobacco Advertising and Promotion Act of 2003 banned most forms of tobacco advertising in \nprint media, billboards, direct mailing and other promotions. Although sponsorship of Formula \nOne motor racing was allowed until July 2005, it appeared that the power of the „tobacco \nlobby‟, which had been a strong influence on policy in the 1980s, was waning. \n The changing political and health policy climate in England was conducive to the \nformation of a tobacco control office but does not explain why the North East of England was \nhome to the country‟s first such organisation. The role of regional champions was crucial in \nthis regard. Data presented at an NHS health promotion conference in 2002 showed that, if \nefforts to reduce smoking prevalence in the North East were limited to smoking cessation, it \n    \n \nwould take decades to achieve the set targets (Milne, 2005), and indicated the need for new, \nmore comprehensive models of tobacco control. The concept of a tobacco control office was \nparticularly attractive to those working in a region with a smoking prevalence rate of 28%, the \nhighest in the country (Chappel et al., 2006). A major bid to the European Union Public \nHealth programme in 2003, supported by partners such as the Regional Development Agency, \nGovernment Office for the North East, the Association of North East Councils and the North \nEast Regional Assembly, argued that smoking was more than just an NHS issue. Although it \nwas unsuccessful, interviewees suggested that the collaborating on the bid had a galvanizing \ninfluence on the individuals and organisations involved. \n SFNE thus reflects a move in both political and public health discourse away from an \nexclusive focus on smoking cessation towards more comprehensive, community-based and \npolicy-oriented strategies. Examples from other parts of the world provided models and \napproaches that could be applied to the regional context of the North East of England, where \nindividual champions were particularly energetic and the needs particularly great. \n \nThe SFNE model \nThe SFNE model has not been formally articulated but emerged from our analysis of the \nethnographic and interview data. The SFNEO is distinctive for the following reasons: \n1. It brings together a diverse range of tobacco control activities - including education and \nmarketing, regulatory and policy measures, and cessation services - under one umbrella \norganisation with a common „brand‟ and public face. \n2. In addition to the money received from the Department of Health (DoH) as part of its \nnormal Regional Tobacco Programme Management functions, it receives additional funding \nfrom the sixteen Primary Care Organisations (PCOs) in the region, based on a formula of \n£0.32p per head of population. This has boosted its income nearly fivefold between 2005 and \n2008. \n    \n \n3. It maintains an identity that is separate from the NHS, despite its funding. This is \nunderscored by its location in government offices in the centre of the region and by its \ngovernance arrangements. \n4. It promotes social norm change (the „denormalization‟ of tobacco) rather than smoking \ncessation as its core strategy. \n5. Its quasi-independence gives it scope to act as a lobbying organisation.  \n \nThe SFNE model in practice \nThe SFNEO‟s work is overseen by the SAP, 18 people representing a range of statutory and \nvoluntary sector agencies and organisations, only a minority of which are NHS. The SAP is \nchaired by the regional director of public health, a joint civil service\/DoH appointment. The \nmanagement committee (which scrutinises the budget) is chaired by a member of the Local \nAuthority Chief Executives‟ Group, while regional universities as well as NHS and DoH-\nfunded research and evaluation bodies are represented on the Intelligence sub-committee. \nSuch a broad and diverse grouping of leaders is unusual for public health delivery and reflects \nthe wider constituency from which its identity strongly derives. \nSFNE works to a Regional Tobacco Strategy that broadly derives from a DoH \ntemplate and provides eight key areas for action (Table 1). Its average total income of \n£810,483 (+\/- 5%) over the three years has made a big difference to the scope of SFNE‟s \nwork and what it has been able to achieve, particularly with regard to items „1‟, „2‟ and „4‟ of \nthe strategy. One eighth of the Office‟s first year budget was allocated to establishing a public \nface and key messages for SFNE. An external integrated media agency with extensive \nexperience in social marketing was commissioned to undertake brand development. The \nrationale for using a media agency in this way, articulated by a member of the SAP, was that \nenthusiasm and interest in tobacco control alone does not necessarily generate or translate into \nthe specific marketing skills required for an organisation such as SFNE to flourish. Key \n    \n \ncommunication principles the media agency established were for SFNE to be seen as „anti-\nsmoking, not anti-smoker‟, and for its logo to allow both regional and local identities to be \nrepresented. Thus „FRESH‟ was chosen as the umbrella title, with „Smoke Free North East‟ or \n„Smoke Free (place name\/agency\/activity)‟ underneath it (Figure 1). \nMedia expertise of this sort is traditionally held at arms length by the NHS. Its use was \nparticularly significant when the Health Improvement and Protection Bill was announced by \nthe Government in May 2005, offering the chance for a comprehensive ban on smoking in \nenclosed public places and workplaces. However, such an outcome was not a foregone \nconclusion. The government initially proposed exempting private members‟ clubs and \nlicensed premises that did not prepare or serve food („wet pubs‟) from the legislation, while \nan even weaker option contained in the Bill was that of devolving the decision about whether \nor not to go „smoke free‟ to local authority level. The SFNEO was heavily involved in \nlobbying for the comprehensive option during the consultation on the smoke free elements of \nthe Bill, which ran from June to September 2005. In interviews, other RTPMs said that, since \ntheir appointments were as civil servants, they were denied the chance for such overt political \nengagement. SFNE, in receiving the bulk of its funding from local PCOs rather than central \ngovernment, was in a different position with regards to what it could or could not do. \n SFNE commissioned a region-wide survey in May 2005 which found that 52% of \npubs in the North East were „wet‟ and hence would be exempt if the Government‟s favoured \noption were accepted; in Easington, the sixth most deprived local authority in England, the \nfigure was 81%. SFNE encouraged North East PCOs, local authorities and key regional \nagencies to write declaring their support for a comprehensive ban. Sources in the DoH report \nthat responses to the Health Bill triggered by SFNE were second only to those from \nsupporters of Cancer Research UK. The majority of the region‟s 30 MPs originally favoured \nthe Bill‟s weaker options but, after SFNE‟s lobbying, two-thirds (20) voted for the \ncomprehensive ban. SFNE also found increasing public support for this measure – 70% of \n    \n \nNorth East adults supported smoke-free legislation by the time the Bill was passed in its \ncomprehensive form, compared to 63% in 2003. Documentary sources monitoring subsequent \ncompliance with the smoke-free legislation indicate a 98.7% compliance rate, the highest in \nthe country (DoH, 2008).  \n The successful lobbying by partners for a comprehensive ban was the first such \nexperience for many, and media training was provided. Interviews with the SAP members \nsuggested this task-focussed activity helped establish a „campaigning mentality‟ and strong \nsense of dynamism, energy and positive affect unique in their experience of partnership \nworking (Heckler and Russell, 2008). However, the unexpected emergence and success of the \nHealth Bill presented both an opportunity and a threat for SFNE in the longer term. It was \nhelpful insofar as it provided an instant, emotionally charged „issue‟, which drew partners \ntogether in powerful ways that many found unexpected and exciting. However, success of this \nsort also proved challenging since, following the introduction of a comprehensive ban on \nsmoking in enclosed public places on July 1\nst\n 2007, there was a risk that SFNE‟s task would \nbe regarded as finished. However interviews with SFNEO staff and SAP members reflected \ntheir view that their job had only just begun. With a national Public Service Agreement aimed \nat reducing overall smoking prevalence to 21% by 2010, and other targets to reduce major \ninequalities in smoking prevalence far from being achieved, there was still much to do. \nSFNEO staff have made progress in identifying new issues, such as the challenge of cheap \nand illicit tobacco. Participant-observation at a North of England summit on tobacco \nsmuggling hosted by the SFNEO in December 2007, which drew over 250 people, indicated a \ngalvanizing effect. However, others who lack the vantage point of the SFNEO‟s staff need to \nbe drawn into tackling issues such as this with similar zeal. \n Bringing all tobacco control activities under one umbrella organisation has sometimes \nbeen problematic. One issue that the SFNEO faced initially was its somewhat difficult \nsituation vis-à-vis the Regional Tobacco Control Alliance, a collection of individuals with an \n    \n \ninterest in tobacco control established voluntarily in 1996 with intermittent DoH funding. The \nSFNEO took over much of the coordination and strategic planning work of this alliance, \nwhich seriously limited the latter‟s role and caused some early years friction which needed \ncareful „change management‟.  \nAnother problem for SFNE in its early years has been ensuring its financial \nsustainability during a period of major NHS reorganisation (Hunter and Marks, 2005). Public \nhealth work like tobacco control needs long-term funding to ensure results, and SFNE was \nfortunate in being independent of the NHS during the considerable stress and uncertainty that \naccompanied this reorganisation. Discussions in the planning phase of the SFNEO had \nproposed that the organisation should be part of an NHS PCO. In retrospect, given the \nsubsequent reorganisation of primary care, such a move would have been disastrous for \nSFNE‟s identity, sustainability and effectiveness. SFNE suffered from the NHS \nreorganisation in 2005\/6 when it was announced that the two North East Strategic Health \nAuthorities were to be merged into one, and a new Regional Director of Public Health \n(RDPH) was to be appointed. During this interregnum, some PCOs challenged the \ncontinuation of annual per capita funding beyond 2005\/6, even though the amount sought was \nless than a third of their annual smoking cessation budgets. A dip of seven percent in the total \namount given by PCOs in 2006-7, for example, (£657,275 down to £608,668) was due to one \nchoosing to make its contribution „in kind‟. There were discussions at some meetings about \nthe more radical possibility (in health terms) of local authorities taking over or contributing to \nthe funding stream currently provided by the PCOs, but achieving agreements on „equal buy-\nin‟ from local authorities proved even more difficult than it was from PCOs. Strong \nleadership and negotiating skills were needed when the new RDPH (the person ultimately \nresponsible for „signing off‟ the public health activities of PCOs in the region) took up his \npost in July 2006. The RDPH subsequently gave a commitment that all PCOs were to \ncontinue their per capita support of SFNE for three years from April 2008. \n    \n \nSFNE, then, demonstrates unique features in terms of its funding streams, unusual \npartnerships for public health delivery, its focus on broader issues than purely smoking \ncessation services, and how it delivers on these concerns. It provides leadership and the \npotential for long-term, steady progress on the twin tasks of denormalizing tobacco and \nsignificantly reducing smoking prevalence without being derailed by the all too familiar \nturmoils of reorganisation in the NHS. The alternative (and the norm in many other areas of \npublic health work, according to several interviewees) is a preoccupation with regularly \nchanging, immediate problems, targets and workforce planning (i.e. „who does what and in \nwhat way?‟ rather than „what are we trying to achieve and for whom?‟), often to the detriment \nof longer term issues. \n \nDISCUSSION \n We have identified the significant political and policy contexts that led to the \nformation of SFNE in the North East of England, and the key successes and challenges of its \nearly years. A number of high profile national organisations have explicit interests in tobacco \ncontrol, for example the National Institute for Health and Clinical Excellence (NICE), and \nAction on Smoking and Health (ASH). There have also been a number of alliances of \nagencies that have been pro-active in co-ordinating tobacco control activities, particularly at \nregional levels (for example, Smoke Free London). However, our research demonstrates that \nthe SFNEO is unique in terms of its multiple sources of statutory funding and its ability to act \nas a quasi-independent, campaigning organisation able to bring unusual partners together to \nlobby where other organisations and individuals might otherwise have been prevented or \ndiscouraged from doing so. Its focus on social norm change, manifested through its extensive \nuse of media agencies and social marketing, has been another unique and pioneering feature \nof SFNEO in its early years. As the delivery mechanism for a large-scale tobacco control \nprogramme that brings all aspects of tobacco control under one umbrella, SFNEO provides \n    \n \nleadership, accountability, and an organisational structure for the evidence-based achievement \nof a range of measurable outcomes (Nutbeam, 1998) that commissioners\/funders can „buy \ninto‟ with relative confidence. The partnerships that have developed around SFNE extend \nwell beyond the normal boundaries of NHS working, are dynamic in how they operate, and \nare charged with positive affect (Heckler and Russell, 2008). The office has been able to \nachieve some durability and direction during a time of upheaval and reorganisation within the \nNHS, and has developed strong and dynamic partnerships amongst an unusually broad range \nof groups and individuals. It now has to channel the energies generated during its highly \nsuccessful lobbying for the smoke free legislation of July 1\nst\n 2007 into new challenges that \ncontinue to demonstrate the appropriateness of its unique modus operandi for these tasks. The \nestablished partnerships will need to grow and develop further as the focus and action \npriorities of SFNE alter to sustain this momentum. There is evidence that this is happening \nalready, with the increasing involvement of revenue and border control agencies in the \nstrategies on cheap and illicit tobacco (HM Treasury, 2006), one of the issues that SFNE is \ndrawing into the tobacco control agenda. \n There has been much research interest in policy networks in different social arenas. \nAccording to an earlier study of the UK tobacco policy network, SFNE should be part of a \nperipheral „issue network‟ surrounding a „producer network‟ that is an amalgam of \ngovernment and tobacco industry interests surrounded by a public environment ambivalent \nabout the smoke-free debate (Read, 1992). This contrasts with the findings of our study \nwhere, as in the USA (Krauss, 2004), the policy dynamic has shifted from tobacco networks \nto tobacco control networks. SFNE is at the centre of a complex partnership of organisations \nthat contribute positively to debate and action on tobacco control in a public environment that \nis, in general, increasingly favourably disposed towards the tobacco control agenda. The \narrival of the SFNEO has caused some existing organisations that were already working at \nlocal or regional levels to feel disenfranchized or disempowered, although the increased \n    \n \nresources it has been able to put at their disposal and the centralised lobbying SFNE has been \nable to coordinate has helped soften this antipathy. SFNE has also established itself as a key \numbrella organisation at the national level, although it remains dependent on sustained \nfunding from its regional base. \nIt is too early, and not the purpose of this article, to measure many of the outcomes on \nwhich SFNE must ultimately be judged, although some (such as changes in public opinion \nand compliance rates with the new legislation) have been alluded to above. Some measures, \nsuch as smoking prevalence data, will only assume significance over a period beyond the \nlifetime of our project and will not necessarily be directly attributable to SFNE anyway. A \nmonitoring framework is in place which will start to yield results by 2010. The ability to be \njudged against the delivery of such tangible outcomes is unusual in the public health field \nwhere delivery often tends to be haphazard and piecemeal. As such, the SFNEO may offer a \nmodel of public health organisation and leadership that has considerable potential for \napplication elsewhere. Examples include use of a model deriving from that of the SFNEO in \nestablishing a NE Alcohol Office. This new office has similar funding arrangements to the \nSFNEO and a similar emphasis on social marketing, lobbying and collective action by \ndifferent public sector agencies working in partnership. Meanwhile two other English regions \n(North West and South West) have copied the SFNE funding, marketing and partnership \nmodel for their own tobacco control activities. The interest in extending this organisational \nform into other areas and types of public health delivery is a tangible demonstration of the \nperception, across the region and beyond, that the SFNE model is effective. \n \n \nFUNDING \nThis work was supported by the National Prevention Research Initiative (grant number \nG0501277). The funding partners relevant to this award are: British Heart Foundation; Cancer \n    \n \nResearch UK; Department of Health; Diabetes UK; Economic and Social Research Council; \nMedical Research Council; Research and Development Office for the Northern Ireland Health \nand Social Services; Chief Scientist Office, Scottish Executive Health Department; and Welsh \nAssembly Government. Further information on the website http:\/\/www.npri.org.uk. \n \nACKNOWLEDGEMENTS \nWe thank the staff of Smoke Free North East for their tolerance and support, the key \nstakeholders who gave of their time so freely, and to Julie Jowett and Helen Taylor for their \ntranscriptions. \n \nREFERENCES \nCDC [Centers for Disease Control and Prevention] (1999) Best practices for comprehensive \ntobacco control programs—August 1999. Department of Health and Human Services, Centers \nfor Disease Control and Prevention, National Center for Chronic Disease Prevention and \nHealth Promotion, Office on Smoking and Health, Atlanta. \nCampbell N.C., Murray E., Darbyshire J., Emery J., Farmer A., Griffiths F., Guthrie B., \nLester H., Wilson P., and Kinmonth A.L. (2007) Designing and evaluating complex \ninterventions to improve health care. British Medical Journal, 334, 455-9. \nChappel D.C., Walrond S. and Bailey K. (2006) The prevalence of smoking in the North East \nof England. North East Public Health Observatory Occasional Paper No. 23, Stockton-on-\nTees. \nDoH [Department of Health] (2008) Smoke Free England - one year on. The Stationery \nOffice, London. \nEckersley, R., Dixon, J.M., and Douglas, B. (2001) The social origins of health and \nwellbeing. Cambridge University Press, Cambridge. \n    \n \nFresh Smoke Free North East (2005) A Smoke free North East regional tobacco strategy \n2005-2008. Fresh Smoke Free North East, Chester-le-Street. \nFresh Smoke Free North East (2006) Annual report 2005-6. Fresh Smoke Free North East, \nChester-le-Street. \nGlasgow, R.E., Lichtenstein, E., and Marcus, A.C. (2003) Why don‟t we see more translation \nof health promotion research to practice? Rethinking the efficacy-to-effectiveness transition. \nAmerican Journal of Public Health, 93, 1261-7. \nHale, S., Leggett, W., and Martell, L. (eds) The third way and beyond: criticisms, futures, \nalternatives. Manchester University Press, Manchester. \nHeckler, S. and Russell, A. (2008) Analysing successful partnerships: the role of affect in a \ntobacco control advisory panel in the North East of England. Evidence and Policy, 14, 331-\n54. \nHM Treasury (2006) New Responses to New Challenges: Reinforcing the Tackling Tobacco \nSmuggling Strategy. HM Treasury, London. \nHunter, D., Marks L. (2005) Managing for health: what incentives exist for NHS managers to \nfocus on wider health issues? King‟s Fund, London. \nKrauss, M., Mueller, N., and Luke, D. (2004) Interorganizational relationships within state \ntobacco control networks: a social network analysis. Preventing Chronic Disease: Public \nHealth Research, Practice and Policy, 1, 1-25. \nMiles, M.B., and Huberman, A.M. (1994) Qualitative data analysis. Sage, Newbury Park. \nMilne, E. (2005) NHS smoking cessation services and smoking prevalence: observational \nstudy. British Medical Journal, 330, 760. \nNutbeam, D. (1998) Evaluating health promotion – progress, problems and solutions. Health \nPromotion International, 13, 27-44. \n    \n \nOldenburg, B.F., Sallis, J.F., Ffrench, M.L. and Owen, N. (1999) Health promotion research \nand the diffusion and institutionalization of interventions. Health Education Research, 14, \n121-30. \nRead, M.D. (1992) Policy networks and issue networks: the politics of smoking. In Rhodes, \nR.A.W., and Marsh, D. (eds) Policy networks in British government. Clarendon Press, \nOxford. \nStudlaw, D. (2005) The political dynamics of tobacco control in Australia and New Zealand: \nexplaining policy problems, instruments, and patterns of adoption. Australian Journal of \nPolitical Science, 40, 255-74. \nWogan, P. (2004) Deep hanging out: reflections on fieldwork and multisited Andean \nethnography. Identities: Global Studies in Culture and Power, 11: 129-39. \n \n \nFigure 1: Brand identity of FRESH North East \n \n \n \nTable 1: The eight key action areas of the Regional Tobacco Strategy \n1. Developing infrastructure, skills and capacity to deliver tobacco control \n2. Reducing people‟s exposure to second hand smoke \n3. Helping smokers to stop smoking through the NHS Stop Smoking Services \n4. Using media and education to raise awareness of tobacco issues \n5. Reducing the supply and availability of illegal tobacco products such as smuggled and \ncounterfeit tobacco \n6. Reducing the illegal supply of tobacco products to children \n7. Reducing the level of tobacco promotion \n8. Research, monitoring and evaluation \n \nSource: (Fresh Smoke Free North East, 2005) \n \n"}