{"doi":"10.1007\/s00221-007-1038-5","coreId":"54758","oai":"oai:eprints.lincoln.ac.uk:2426","identifiers":["oai:eprints.lincoln.ac.uk:2426","10.1007\/s00221-007-1038-5"],"title":"Initial fixation placement in face images is driven \\ud\nby top-down guidance","authors":["Guo, Kun"],"enrichments":{"references":[{"id":1022253,"title":"Anim Behav 22:144-149 Yarbus A","authors":[],"date":"1967","doi":null,"raw":"Anim Behav 22:144-149 Yarbus A (1967) Eye movements and vision. Plenum, New York Legends","cites":null},{"id":1022051,"title":"Trends Cog Sci 7:498-504 Keating CF, Keating EG","authors":[],"date":"1982","doi":null,"raw":"Trends Cog Sci 7:498-504 Keating CF, Keating EG (1982) Visual scan patterns of rhesus monkeys viewing faces. Perception 11:211–219 Langton SR, Watt RJ, Bruce II (2000) Do the eyes have it? Cues to the direction of social attention. Trends Cogni Sci 4:50-59 Mannan SK, Ruddock KH, Woodings DS (1997) The relationship between the locations of spatial features and those of fixations made during visual examination of briefly presented images. Spatial Vis 10:165-188 Nahm FKD, Perret A, Amaral DG, Albright TD (1997) How do monkeys look at faces? J Cogn Neurosci 9:611–623 Noton D, Stark L (1971) Scanpaths in saccadic eye movements while viewing and recognizing patterns. Vision Res 11:929–942 Parkhurst D, Law K, Niebur E (2002) Modelling the role of salience in the allocation of overt visual attention. Vision Res 42:107-123 Parr LA, Winslow JT, Hopkins WD (2000) Recognizing facial cues: individual discrimination by chimpanzees (Pan troglodytes) and rhesus monkeys (Macaca mulatta). J Comp Psychol 114:1–14 11Peters RJ, Iver A, Itti L, Koch C (2005) Components of bottom-up gaze allocation in natural images. Vision Res 45:2397-2416 Rauschenberger R (2003) Attentional capture by auto- and allo-cues. Psychon Bull Rev 10:814-842 Thomsen CE (1974) Eye contact by non-human primates toward a human observer.","cites":null},{"id":1021803,"title":"Young A","authors":[],"date":"1998","doi":"10.1093\/acprof:oso\/9780198524205.003.0013","raw":"Bruce V, Young A (1998) In the eye of the beholder. New York: Oxford University Press Carpenter RH, Williams ML (1995) Neural computation of log likelihood in control of saccadic eye movements. Nature 377:59–62 Emery NJ (2000) The eyes have it: the neuroethology, function and evolution of social gaze. Neurosci Biobehav Rev 24:581–604 Farroni T, Csibra G, Simion F, Johnson MH (2002) Eye contact detection in human from birth. Proc Natl Acad Sci USA 99:9602-9605 Ghazanfar AA, Nielsen K, Logothetis NK (2006) Eye movements of monkey observers viewing vocalizing conspecifics. Cognition 101:515-529 Ghazanfar AA, Santos LR (2004) Primate brains in the wild: the sensory bases for social interactions. Nat Rev Neurosci 5:603-616 Gothard KM, Erickson CA, Amaral DG (2004) How do rhesus monkeys (Macaca mulatta) scan faces in a visual paired comparison task? Anim Cogn 7:25-36 Guo K, Robertson RG, Mahmoodi S, Tadmor Y, Young MP (2003) How do monkeys view faces? – A study of eye movements. Exp Brain Res 150:363-374 Guo K, Robertson RG, Mahmoodi S, Young MP (2005) Centre-surround interactions in response to natural scene stimulation in the primary visual cortex. Eur J Neurosci 21:536-548 Guo K, Mahmoodi S, Robertson RG, Young MP (2006) Longer fixation duration while viewing face images. Exp Brain Res 171:91-98 Henderson JM (2003) Human gaze control during real-world scene perception.","cites":null}],"documentType":{"type":0.5555555556}},"contributors":[],"datePublished":"2007-08","abstract":"The eyes are often inspected first and for longer period during face exploration. To examine whether this saliency of the eye region at the early stage of face inspection is attributed to its local structure properties or to the knowledge of its essence in facial communication, in this study we investigated the pattern of eye movements produced by rhesus monkeys (Macaca mulatta) as they free viewed images of monkey faces. Eye positions were recorded accurately using implanted eye coils, while images of original faces, faces with scrambled eyes, and scrambled faces except for the eyes were presented on a computer screen. The eye region in the scrambled faces attracted the same proportion of viewing time and fixations as it did in the original faces, even the scrambled eyes attracted substantial proportion of viewing time and fixations. Furthermore, the monkeys often made the first saccade towards to the location of the eyes regardless of image content. Our results suggest that the initial fixation placement in faces is driven predominantly by ‘top-down’ or internal factors, such as the prior knowledge of the location of “eyes” within the context of a face","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/54758.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/2426\/1\/EBR_2007.pdf","pdfHashValue":"8dc26e36a3d1ecba6462277d7857d9855afd7fa5","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:2426<\/identifier><datestamp>\n      2013-03-13T08:37:25Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F43:6A6163735F43383030<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F43:6A6163735F43383530<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F43:6A6163735F43383330<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/2426\/<\/dc:relation><dc:title>\n        Initial fixation placement in face images is driven \\ud\nby top-down guidance<\/dc:title><dc:creator>\n        Guo, Kun<\/dc:creator><dc:subject>\n        C800 Psychology<\/dc:subject><dc:subject>\n        C850 Cognitive Psychology<\/dc:subject><dc:subject>\n        C830 Experimental Psychology<\/dc:subject><dc:description>\n        The eyes are often inspected first and for longer period during face exploration. To examine whether this saliency of the eye region at the early stage of face inspection is attributed to its local structure properties or to the knowledge of its essence in facial communication, in this study we investigated the pattern of eye movements produced by rhesus monkeys (Macaca mulatta) as they free viewed images of monkey faces. Eye positions were recorded accurately using implanted eye coils, while images of original faces, faces with scrambled eyes, and scrambled faces except for the eyes were presented on a computer screen. The eye region in the scrambled faces attracted the same proportion of viewing time and fixations as it did in the original faces, even the scrambled eyes attracted substantial proportion of viewing time and fixations. Furthermore, the monkeys often made the first saccade towards to the location of the eyes regardless of image content. Our results suggest that the initial fixation placement in faces is driven predominantly by ‘top-down’ or internal factors, such as the prior knowledge of the location of “eyes” within the context of a face.<\/dc:description><dc:publisher>\n        Springer<\/dc:publisher><dc:date>\n        2007-08<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/2426\/1\/EBR_2007.pdf<\/dc:identifier><dc:identifier>\n          Guo, Kun  (2007) Initial fixation placement in face images is driven by top-down guidance.  Experimental Brain Research, 181  (4).   pp. 673-677.  ISSN 0014-4819  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1007\/s00221-007-1038-5<\/dc:relation><dc:relation>\n        10.1007\/s00221-007-1038-5<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/2426\/","http:\/\/dx.doi.org\/10.1007\/s00221-007-1038-5","10.1007\/s00221-007-1038-5"],"year":2007,"topics":["C800 Psychology","C850 Cognitive Psychology","C830 Experimental Psychology"],"subject":["Article","PeerReviewed"],"fullText":" Initial fixation placement in face images is driven  \nby top-down guidance \n \nKun Guo  \n Research Centre for Comparative Cognition, Department of Psychology,  \nUniversity of Lincoln, Lincoln LN6 7TS, UK \n \n \n \n \n \n \nCorresponding Author:  \nDr. Kun Guo \nDepartment of Psychology, University of Lincoln, Lincoln, LN6 7TS, UK \nEmail address: kguo@lincoln.ac.uk  \nTel: +44-1522-886294 \n 1\nAbstract \nThe eyes are often inspected first and for longer period during face exploration. To \nexamine whether this saliency of the eye region at the early stage of face inspection is \nattributed to its local structure properties or to the knowledge of its essence in facial \ncommunication, in this study we investigated the pattern of eye movements produced \nby rhesus monkeys (Macaca mulatta) as they free viewed images of monkey faces. \nEye positions were recorded accurately using implanted eye coils, while images of \noriginal faces, faces with scrambled eyes, and scrambled faces except for the eyes \nwere presented on a computer screen. The eye region in the scrambled faces attracted \nthe same proportion of viewing time and fixations as it did in the original faces, even \nthe scrambled eyes attracted substantial proportion of viewing time and fixations. \nFurthermore, the monkeys often made the first saccade towards to the location of the \neyes regardless of image content. Our results suggest that the initial fixation \nplacement in faces is driven predominantly by ‘top-down’ or internal factors, such as \nthe prior knowledge of the location of “eyes” within the context of a face. \n \nKeyword: Eye movements – Faces – Eyes - Monkey  \n \nIntroduction \nVisual exploration of the world around us involves a series of saccadic eye \nmovements and fixations, and we tend to concentrate our fixations on interesting and \ninformative regions in the scene (Yarbus 1967). The choice of the potential fixation \ntargets can be driven by both bottom-up exogenous or external factors and top-down \nendogenous or internal factors. External factors are image immanent features, such as \nlocal image contrast and local image structure, which transiently attract eye gaze, \n 2\nindependent of a particular task. Internal factors, such as an individual’s attentional \nstate, expectation, experience and memory, are top-down and task-dependent (Noton \nand Stark 1971; Mannan et al. 1997; Henderson 2003). It is argued that in general, the \ninitial saccade to an image is driven predominantly by external factors (Parkhurst et \nal. 2002; Peters et al. 2005), but can also be biased by internal factors (Henderson \n2003). \nAs faces can provide visual information about an individual’s gender, age and \nfamiliarity, and their expressions provide significant cues to intention and mental \nstate, the ability to recognize these cues and to respond accordingly plays a crucial \nrole in our social communication (Bruce and Young 1998; Emery 2000). Just like \nhumans, rhesus monkeys are sensitive to faces of conspecifics. They are able to \ndiscriminate faces of unfamiliar individuals after only a short exposure to sets of their \nimages (Parr et al. 2000). Viewing of faces is accompanied by longer fixations \ncompared with natural scenes (Guo et al. 2006), and is typically associated with a \nstereotypical eye scanning patterns (Keating and Keating 1982; Nahm et al. 1997; \nGuo et al. 2003; Gothard et al. 2004; Ghazanfar et al. 2006). Specifically, the eye \nregion in neutral, expressive or vocalizing faces is often the first destination of the \nsaccade and attracts a disproportionate share of fixations compared with other local \nfacial features, suggesting its dominant saliency in the faces. \nHowever, it remains unclear whether this interest in eyes, especially at the \nearliest stage of face exploration, is attributable solely to its local structure properties, \nor may derive from the knowledge\/memory of its location and essence in facial \ncommunication. To address this question, in this experiment we systemically \nmanipulated the local image structures of inner face components (i.e. eye region), and \ncompared rhesus monkeys’ eye scanning patterns when viewing original monkey face \n 3\nand modified face images. Our results suggested that the top-down guidance (i.e. prior \nknowledge of the location of the eyes in the faces) plays a crucial role in the saliency \nof the eye region during early stage of face exploration.  \n \nMethods \nSubjects \nTwo male adult rhesus monkeys (Macaca mulatta, 4.5-6.0 kg) were used in \nthis study. Initially they were trained to fixate a spot on a computer screen for several \nseconds in a dimming fixation detection task (Guo et al. 2003). For the purpose of \nrecording eye movements, a scleral eye coil and head restraint were then implanted \nunder aseptic conditions. Throughout the period of the recordings, the animal’s \nweight and general health were monitored daily. All procedures complied with the \n“Principles of laboratory animal care” (NIH publication no. 86-23, revised 1985) and \nUK Home Office regulations.   \nStimuli and apparatus \nDigitized grey scale images were presented through a VSG 2\/3 graphics \nsystem (Cambridge Research Systems) and displayed on a high frequency non-\ninterlaced gamma-corrected color monitor (110 Hz frame rate, Sony GDM-F500T9) \nwith the resolution of 1024 × 768 pixels. At a viewing distance of 57cm the monitor \nsubtended a visual angle of 40 × 30°. The mean luminance of uniform grey \nbackground was kept at 6.0 cd\/m2. \n20 neutral monkey (Macaca mulatta) face images were used as stimuli. All \nimages (512 × 512 pixels, 256 grey-levels) were gamma-corrected. For each original \nface image, we created two scrambled versions (scrambling eye region only, \nscrambling whole face except for eye region) with the same first- and second-order \n 4\nstatistics (image properties determined by the amplitudes of the Fourier spectrum) but \ndifferent higher-order correlations (image properties determined by the phases of the \nFourier spectrum). This was done by computing the Fourier transform over the \nscrambled facial features and randomizing the phase spectrum (0-2π) in the frequency \ndomain. The Fourier amplitude spectrum of the images was not affected by this \nprocedure. Without higher-order statistical structures corresponding to the sparse \ndistributions of local features, these scrambled image regions lack any visual objects \nand have a cloud-like appearance (see Fig.1 for examples), although they have the \nsame mean luminance and root-mean-square contrast as the corresponding facial \nfeatures (Guo et al. 2005).  \nIn total, three different classes of images were presented to monkeys: (1) 20 \noriginal face images, (2) 20 face images with scrambled eyes (eyes scrambled); (3) 20 \nscrambled faces except for eye regions (eyes only). All images were displayed once in \na random order at the center of the screen with a resolution of 512 × 512 pixels (20 × \n20°). \n--- Figure 1 about here --- \nDuring the experiments the monkey was seated in a purpose-built primate \nchair with head restrained, and viewed the display binocularly. To calibrate eye \nmovement signals, a small red fixation point (FP) (0.2° diameter, 7.8 cd\/m2 \nluminance) was displayed randomly at one of twenty-five positions (5 × 5 matrix) \nacross the monitor. The distance between adjacent FP positions was 5°. The monkey \nwas trained to follow the FP and maintain fixation for 1 second. After the calibration \nprocedure, the trial was started with a FP displayed on the center of monitor. If the \nmonkey maintained fixation for 500 msec, the FP disappeared and a face image was \npresented for 10 seconds. During the presentation, the monkeys passively viewed the \n 5\nimages. No reinforcement was given during this procedure, neither were the animals \ntrained on any other task with these stimuli, which could have potentially affected the \nstructure of their behaviour. It was considered that with their lack of training, and in \nthe absence of instrumental responding, their behavior should be as natural as \npossible.  \nEye movement recordings and analysis \nHorizontal and vertical eye positions were measured using an 18-inch cubic \nscleral search coil assembly with 6 min arc sensitivity (CNC Engineering). Eye \nmovement signals were amplified and sampled at 500 Hz through CED1401 plus \ndigital interface (Cambridge Electronic Design). The software developed in Matlab \ncomputed horizontal and vertical eye displacement signals as a function of time to \ndetermine eye velocity and position. Fixation locations and durations were then \nextracted from the raw eye tracking data using velocity (less than 0.2° eye \ndisplacement at a velocity of less than 20°\/s) and duration (greater than 50 ms) criteria \n(Guo et al. 2006).  \n \nResults \n Not surprisingly, the original face images were the most salient to the \nmonkeys. They attracted longer viewing time (1 way ANOVA, F(2,129)=22.36, p=4.6E-\n9) and more fixations (1 way ANOVA, F(2,129)=30.01, p=1.98E-11) than the modified \nface images (Fig. 2A and B). The two monkeys spent 68±3% (mean±SEM) of the 10-\ns image presentation time viewing the original faces, making 17.11±0.9 fixations \nacross the images. The proportion of time spent viewing the image decreased to \n44±3% and 39±4%, and the number of fixations declined to 11.25±0.78 and 8.2±0.8 \nfor the eyes scrambled and eyes only images. \n 6\n --- Figure 2 about here --- \n Among local facial features, the eye region in original faces often receives the \nhighest proportion of fixations during face exploration (Guo et al. 2003). In this \nexperiment, the eye region in eyes scrambled and eyes only images still attracted a \nsubstantial amount of attention, although the cumulative viewing time (Fig. 2C) and \nthe number of fixations (Fig. 2D) were decreased in these two conditions (viewing \ntime: original face 2.91±0.3s, eyes scrambled 1±0.13s, eyes only 1.96±0.32s, 1 way \nANOVA, F(2,129)=12.81, p=8.44E-6; number of fixations: original face 8.73±0.65, \neyes scrambled 3.59±0.38, eyes only 4.89±0.57, 1 way ANOVA, F(2,129)=24.11, \np=1.27E-9). When the same data in figure 2C and D was expressed as the percentage \nof face viewing time (Fig. 2E) and as the proportion of the number of fixations within \nthe images (Fig. 2F), the eye region in original face and eyes only images received the \nsame proportion of face viewing time and fixations (viewing time: original face \n41±3%, eyes only 43±4%, Tukey’s least significant procedure, p=0.6; fixations: \noriginal face 52±3%, eyes only 55±4%, Tukey’s least significant procedure, p=0.47). \nThe unrecognisable eyes in eyes scrambled face images attracted less proportion of \nface viewing time (23±3%, 1 way ANOVA, F(2,129)=12.15, p=1.46E-5) and fixations \n(32±3%, 1 way ANOVA, F(2,129)=14.66, p=1.83E-6). \n To examine whether there were any differences in the spatial distribution of \nsequential fixation placement during image exploration, we compared the first five \nfixation placements in each image (this number was chosen as it represented the \nmaximum number of saccades for some images). The probability of fixation \nplacement in the eye region as a function of fixation sequence is plotted in Fig. 3. The \neyes had a very higher probability as the first saccade destination (>90%) once the \nimage was presented, even when they were unrecognisable in the eyes scrambled \n 7\nimages. For the next four saccades, they had the same probability to be fixated in the \noriginal face and eyes only images (Kolmogorov-Smirnov test, p>0.05), but much less \nchance to be inspected in the eyes scrambled images (Kolmogorov-Smirnov test, \np<0.05). \n \nDiscussion \nFaces are probably the most important visual stimuli in primate social \ncommunications (Bruce and Young 1998). The saliency of the face, however, is \ndependent on appropriate facial configurations. Disruptions such as inverting faces or \nrandomly rearranging local facial components would reduce the amount of viewing \ntime and fixations directed to the faces (Guo et al. 2003). Here we further observed \nthat the saliency of the face was decreased with the manipulation of local facial \nstructures by scrambling eyes or non-eye regions (Fig. 2A and B), suggesting that the \nselection of the face as a target for fixation would depend on the prior knowledge \nconcerning the likelihood of the occurrence of the faces (Carpenter and Williams \n1995), such as faces presented in a given orientation and within a given context. \nAmong local facial components, eye region is the most attended feature. \nDuring face exploration, both human and non-human primates demonstrated an \nexaggerated interest in the eye region of the faces of conspecifics (Yarbus 1967; \nKeating and Keating 1982; Nahm et al. 1997; Guo et al. 2003; Gothard et al. 2004; \nGhazanfar et al. 2006). This preferential interest in the eyes remained when the eyes \nor the rest of the facial structures were scrambled. The eye region in the scrambled \nfaces attracted the same proportion of viewing time and fixations as it did in the \noriginal faces, even the unrecognisable eyes in the eyes scrambled images attracted \nsubstantial proportion of viewing time (~23%) and fixations (~32%, Fig. 2E and F). \n 8\nTaken together, it seems that both the intrinsic structure (e.g. local contrast or local \nedges) of the eye region and the knowledge of its location and essence in facial \ncommunication contribute to its salience during face exploration. However, the \ndeclined cumulative viewing time and fixation numbers towards the eye region in the \neyes scrambled and eyes only images (Fig. 2C and D) suggest that the eyes are better \nprocessed in concert with other facial features.  \nThe eye region is often the first fixation target following the appearance of the \nfaces (Guo et al. 2003). It is argued that in general, the initial saccade to an image is \ndriven predominantly by ‘bottom-up’ process or external factors such as local image \ncontrast (Parkhurst et al. 2002; Peters et al. 2005). From this perspective, the saliency \nof the eye region at the earliest stage of face inspection could be attributed to its local \nstructure properties (i.e. the eye region has relatively higher local contrast in grey \nscale images). However, in our test condition of face images with scrambled eyes, the \neye region was also inspected first even when it was unrecognisable (Fig. 3), \nsuggesting that the visual system may retain prior knowledge of the location of “eyes” \nwithin the context of a face from past experience, and this knowledge could bias the \ndestination of the initial saccade. In addition, when the face images were inverted or \nthe position of the eyes were rearranged within the faces, the time into the trial for the \nfirst saccade directed at the eyes was significantly delayed, indicating the first saccade \nwithin the image was not directed at the eyes although their local image properties \n(contrast and structure) were unaltered (Guo et al. 2003). Taken together, it seems the \ninitial fixation placement in a face image is driven predominantly by ‘top-down’ \nguidance or internal factors, in particularly the prior knowledge of the location of \n“eyes” within the context of a normal face. Furthermore, it could be the global \n 9\nsemantic characteristics of the faces that determine the initial fixation placement \nrather than the local semantic characteristics of the eyes.  \nOur results are consistent with previous behavioural, psychophysical, \nneurophysiological and neuroimaging studies on the role of the eyes in social \ninteraction in humans and non-human primates. The eyes are one of the first points of \ncontact between infants and mothers, and play a pivotal role in identity recognition \nand emotional communication (Bruce and Young 1998). They often provide ‘early \nwarning signals’ for rapid assessment and response to salient and potential harmful \nevents (i.e. through the process of joint attention), hence may capture attention \ninvoluntarily (Langton et al. 2000; Rauschenberger 2003). While presented alone, the \neyes can selectively activate neurons in superior temporal sulcus and amygdala, \nsometimes with the same response amplitude as the presentation of whole face \n(Emery 2000; Ghazanfar and Santos 2004). Furthermore, the observation that the eyes \ndo not carry the same relevance for human and monkey infants as human and monkey \nadults (Thomsen 1974; Farroni et al. 2002) suggests that the sensitivity to the eyes is a \nlearnt mechanism. Given these considerations, it is reasonable to assume that the \nknowledge of the location of eye region within a face and its social relevance \ncontribute significantly to its saliency at the earliest stage of face exploration even \nwithout specific task demands. \n \nReferences \nBruce V, Young A (1998) In the eye of the beholder. New York: Oxford University \nPress \n \nCarpenter RH, Williams ML (1995) Neural computation of log likelihood in control \nof saccadic eye movements. Nature 377:59–62 \n \nEmery NJ (2000) The eyes have it: the neuroethology, function and evolution of \nsocial gaze. Neurosci Biobehav Rev 24:581–604 \n 10\n \nFarroni T, Csibra G, Simion F, Johnson MH (2002) Eye contact detection in human \nfrom birth. Proc Natl Acad Sci USA 99:9602-9605 \n \nGhazanfar AA, Nielsen K, Logothetis NK (2006) Eye movements of monkey \nobservers viewing vocalizing conspecifics. Cognition 101:515-529 \n \nGhazanfar AA, Santos LR (2004) Primate brains in the wild: the sensory bases for \nsocial interactions. Nat Rev Neurosci 5:603-616 \n \nGothard KM, Erickson CA, Amaral DG (2004) How do rhesus monkeys (Macaca \nmulatta) scan faces in a visual paired comparison task? Anim Cogn 7:25-36 \n \nGuo K, Robertson RG, Mahmoodi S, Tadmor Y, Young MP (2003) How do monkeys \nview faces? – A study of eye movements. Exp Brain Res 150:363-374 \n \nGuo K, Robertson RG, Mahmoodi S, Young MP (2005) Centre-surround interactions \nin response to natural scene stimulation in the primary visual cortex. Eur J Neurosci \n21:536-548 \n \nGuo K, Mahmoodi S, Robertson RG, Young MP (2006) Longer fixation duration \nwhile viewing face images. Exp Brain Res 171:91-98 \n \nHenderson JM (2003) Human gaze control during real-world scene perception. \nTrends Cog Sci 7:498-504  \n \nKeating CF, Keating EG (1982) Visual scan patterns of rhesus monkeys viewing \nfaces. Perception 11:211–219 \n \nLangton SR, Watt RJ, Bruce II (2000) Do the eyes have it? Cues to the direction of \nsocial attention. Trends Cogni Sci 4:50-59 \n \nMannan SK, Ruddock KH, Woodings DS (1997) The relationship between the \nlocations of spatial features and those of fixations made during visual examination of \nbriefly presented images. Spatial Vis 10:165-188 \n \nNahm FKD, Perret A, Amaral DG, Albright TD (1997) How do monkeys look at \nfaces? J Cogn Neurosci 9:611–623 \n \nNoton D, Stark L (1971) Scanpaths in saccadic eye movements while viewing and \nrecognizing patterns. Vision Res 11:929–942 \n \nParkhurst D, Law K, Niebur E (2002) Modelling the role of salience in the allocation \nof overt visual attention. Vision Res 42:107-123 \n \nParr LA, Winslow JT, Hopkins WD (2000) Recognizing facial cues: individual \ndiscrimination by chimpanzees (Pan troglodytes) and rhesus monkeys (Macaca \nmulatta). J Comp Psychol 114:1–14 \n \n 11\nPeters RJ, Iver A, Itti L, Koch C (2005) Components of bottom-up gaze allocation in \nnatural images. Vision Res 45:2397-2416 \n \nRauschenberger R (2003) Attentional capture by auto- and allo-cues. Psychon Bull \nRev 10:814-842 \n \nThomsen CE (1974) Eye contact by non-human primates toward a human observer. \nAnim Behav 22:144-149 \n \nYarbus A (1967) Eye movements and vision. Plenum, New York \n \n \n \nLegends \nFigure 1, Examples of static grey scale monkey face images used in the recording. \nFrom left to right: original face image, face image with scrambled eyes, scrambled \nface except for eye region. \n \nFigure 2, A and B, cumulative viewing time and number of fixations within original \nface, eyes scrambled and eyes only images. C and D, cumulative viewing time and \nnumber of fixations for the eye region within original face, eyes scrambled and eyes \nonly images. E and F, proportion of cumulative face viewing time and number of \nfixations for the eye region within original face, eyes scrambled and eyes only \nimages. Errors bars indicate standard error of mean. \n \nFigure 3, The probability of the eye region as the destination of first five saccades \nmeasured while viewing original face, eyes scrambled and eyes only images.  \n \n 12\nFigure 1  \n \n \n              \n   \n \n \n \n 13\nFigure 2 \n \n \n \nWhole face\n0\n2\n4\n6\n8\nVi\new\nin\ng \ntim\ne \n(s\nec\n)\nA Eye region\n0\n2\n4\n6\n8\nVi\new\nin\ng \ntim\ne \n(s\nec\n)\nC\n \nEye region\n0\n20\n40\n60\nVi\new\nin\ng \ntim\ne \n(%\n)\nE\n \n0\n5\n10\n15\n20\nNu\nm\nbe\nr o\nf f\nix\nat\nio\nns\nB\n \n0\n5\n10\n15\n20\nNu\nm\nbe\nr o\nf f\nix\nat\nio\nns\nD\n \n0\n20\n40\n60\nP\nro\npo\nrt\nio\nn \nof\n fi\nxa\ntio\nns\n (%\n)F\n \n \n 14\nFigure 3 \n \n \n \n \n \n0\n25\n50\n75\n100\n1 2 3 4 5\nFixation sequence\nP\nro\nba\nbi\nlit\ny \nof\n e\nye\ns \nto\n \nbe\n fi\nxa\nte\nd \n(%\n)\nOriginal face\nScrambled eyes\nEyes only\n \n 15\n"}