{"doi":"10.1016\/j.triboint.2004.10.007","coreId":"141045","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/888","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/888","10.1016\/j.triboint.2004.10.007"],"title":"Identification of the acoustic emission source during a comparative study on\ndiagnosis of a spur gearbox","authors":["Tan, Chee Keong","Mba, David"],"enrichments":{"references":[{"id":37924251,"title":"A new diagnostic technique for asperity contact.","authors":[],"date":"1993","doi":"10.1016\/0301-679x(93)90035-y","raw":"Smith, J.D. A new diagnostic technique for asperity contact. Tribology International. Vol. 26, pp 25-27. 1993.","cites":null},{"id":37924239,"title":"A review of transmission vibration monitoring at Westland Helicopter Ltd. 20 Th European Rotorcraft Forum.","authors":[],"date":"1994","doi":null,"raw":"Cameron, B.G. and Stuckey, M.J. A review of transmission vibration monitoring at Westland Helicopter Ltd. 20 Th European Rotorcraft Forum. Paper 116. pp 116\/1 – 116\/16. 1994.","cites":null},{"id":37924226,"title":"Acoustic Emission Testing,","authors":[],"date":"1987","doi":null,"raw":"Miller, R.K. and McIntire, P. Acoustic Emission Testing, Volume 5, 2 nd ed., Nondestructive Testing Handbook. Ed., American Society for Non-destructive Testing, pp 275-310, 1987.   35","cites":null},{"id":37924235,"title":"Acoustic emissions diagnosis of rotor-stator rubs using the KS statistic,","authors":[],"date":"2004","doi":"10.1016\/s0888-3270(03)00050-5","raw":"Hall, L.D. and Mba, D. Acoustic emissions diagnosis of rotor-stator rubs using the KS statistic, Mechanical Systems and Signal Processing, 18(4), 849-868. 2004.   36","cites":null},{"id":37924247,"title":"Adhesive and abrasive wear studies using acoustic emission techniques.","authors":[],"date":"1991","doi":"10.1016\/0043-1648(91)90363-y","raw":"Boness, R.J. and McBride, S.L. Adhesive and abrasive wear studies using acoustic emission techniques. Wear. Vol. 149, 41-53, 1991.","cites":null},{"id":37924245,"title":"AE in Tooth Surface Failure Process of Spur Gears,","authors":[],"date":"1998","doi":null,"raw":"Sentoku, H. AE in Tooth Surface Failure Process of Spur Gears, Journal of Acoustic Emission. Vol. 16, Issue 1-4, S19-S24, 1998.","cites":null},{"id":37924240,"title":"An experimental and theoretical study of the effect of simulated pitch line pitting on the vibration of a geared system. ASME Publication Report 77-DET-123,","authors":[],"date":"1977","doi":null,"raw":"Drosjack, M.J. and Houser D.R. An experimental and theoretical study of the effect of simulated pitch line pitting on the vibration of a geared system. ASME Publication Report 77-DET-123, 1977.","cites":null},{"id":37924233,"title":"An initial investigation on the potential applicability of Acoustic Emission to rail track fault detection.","authors":[],"date":null,"doi":"10.1016\/j.ndteint.2004.02.001","raw":"Bruzelius, K. and Mba, D. An initial investigation on the potential applicability of Acoustic Emission to rail track fault detection. NDT & E International, 37(7), 507-","cites":null},{"id":37924230,"title":"Applicability of acoustic emissions to monitoring the mechanical integrity of bolted structures in low speed rotating machinery: case study.","authors":[],"date":"2002","doi":"10.1016\/s0963-8695(01)00053-6","raw":"Mba, D. Applicability of acoustic emissions to monitoring the mechanical integrity of bolted structures in low speed rotating machinery: case study. NDT and E International. 35(5), 293-300. 2002.","cites":null},{"id":37924228,"title":"Bearing defect diagnosis and acoustic emission","authors":[],"date":"2003","doi":"10.1243\/135065003768618614","raw":"Morhain, A. and Mba, D. Bearing defect diagnosis and acoustic emission Journal of Engineering Tribology, I Mech E, Vol 217, No. 4,  Part J, p 257-272,  2003. ISSN 1350-6501Mba, D. (2002).","cites":null},{"id":37924246,"title":"Condition Monitoring of a Gear Box Using Acoustic Emission Testing, Material Evaluation.","authors":[],"date":"1997","doi":null,"raw":"Siores, E.  and Negro, A.A. Condition Monitoring of a Gear Box Using Acoustic Emission Testing, Material Evaluation. 183-187, 1997.","cites":null},{"id":37924237,"title":"Condition monitoring of helicopter gearboxes using automatic vibration analysis techniques. AGARD CP 369. Gears and power transmission system for helicopter turboprops.","authors":[],"date":null,"doi":null,"raw":"Gadd, P. and Mitchell, P.J. Condition monitoring of helicopter gearboxes using automatic vibration analysis techniques. AGARD CP 369. Gears and power transmission system for helicopter turboprops. 29\/1 – 29\/10.1984.","cites":null},{"id":37924227,"title":"Condition monitoring of low-speed rotating machinery using stress waves:","authors":[],"date":null,"doi":"10.1243\/0954408991529906","raw":"Mba, D. and Bannister, R.H. Condition monitoring of low-speed rotating machinery using stress waves: Part1 and Part 2. Proc Inst Mech Engrs. 213(3), Part E, 153-185.","cites":null},{"id":37924244,"title":"Detecting Gear Tooth Breakage Using Acoustic Emission: A Feasibility and Sensor Placement Study,","authors":[],"date":"1999","doi":"10.1115\/1.2829503","raw":"Singh, A., Houser, D. R., and Vijayakar, S. Detecting Gear Tooth Breakage Using Acoustic Emission: A Feasibility and Sensor Placement Study, Journal of Mechanical Design. Vol. 121, 587-593, 1999.   37","cites":null},{"id":37924241,"title":"Detection of Defects in Gears by Acoustic Emission Measurements,","authors":[],"date":"1999","doi":null,"raw":"Tandon, N. and Mata, S. Detection of Defects in Gears by Acoustic Emission Measurements, Journal of Acoustic Emission. Vol. 17, Issue 1-2, 23-27, 1999.","cites":null},{"id":37924231,"title":"Detection of shaft-seal rubbing in large-scale power generation turbines with Acoustic Emissions; Case study.","authors":[],"date":null,"doi":"10.1243\/095765004773644076","raw":"Mba, D., Cooke, A.,  Roby, D. and  Hewitt, G. Detection of shaft-seal rubbing in large-scale power generation turbines with Acoustic Emissions; Case study. Journal of Power and Energy - Part A, I Mech E, Vol 218, No. 2, Part A, p 71-82, March","cites":null},{"id":37924234,"title":"Diagnosis of continuous rotor–stator rubbing in large scale turbine units using acoustic emissions,","authors":[],"date":"2004","doi":"10.1016\/j.ultras.2003.09.002","raw":"Hall, L.D. and Mba, D. Diagnosis of continuous rotor–stator rubbing in large scale turbine units using acoustic emissions, Ultrasonics, 41(9), 765-773. 2004.","cites":null},{"id":37924243,"title":"Early Detection of Gear Pitting,","authors":[],"date":"1996","doi":null,"raw":"Singh, A., Houser, D. R., and Vijayakar, S. Early Detection of Gear Pitting, Power Transmission and Gearing Conference, ASME. DE-Vol. 88, 673-678, 1996.","cites":null},{"id":37924250,"title":"Elasto-hydrodynamic Lubrication. 1 st ed.","authors":[],"date":"1977","doi":"10.1016\/b978-0-08-021302-6.50012-6","raw":"Dowson, D. and Higginson, G.R. Elasto-hydrodynamic Lubrication. 1 st ed. Oxford: Pergamon Press, 1977.","cites":null},{"id":37924248,"title":"Gear noise and vibration, 1 st ed.","authors":[],"date":"1999","doi":null,"raw":"Smith, J.D. Gear noise and vibration, 1 st ed. New York: Marcel Dekker In cooperation, 1999.","cites":null},{"id":37924238,"title":"Helicopter gearbox vibration analysis in the Canadian Forces-applications and lessons.","authors":[],"date":"1990","doi":null,"raw":"Leblanc, J.F.A., Dube, J.R.F. and Devereux, B. Helicopter gearbox vibration analysis in the Canadian Forces-applications and lessons.  1 st International Conference, Gearbox noise and vibration. IMechE, Cambridge, UK. C404\/023, pp 173 -177. 1990.","cites":null},{"id":37924236,"title":"Monitoring extremely slow rolling element bearings: Part I and II,","authors":[],"date":"2002","doi":"10.1016\/s0963-8695(02)00006-3","raw":"Mba, D and Jamaludin, N. Monitoring extremely slow rolling element bearings: Part I and II, NDT and E International, 35(60), 349-366, 2002.","cites":null},{"id":37924232,"title":"Observation of Acoustic Emission Activity During Gear Defect Diagnosis.","authors":[],"date":"2003","doi":"10.1016\/s0963-8695(03)00063-x","raw":"Toutountzakis, T. and Mba, D. Observation of Acoustic Emission Activity During Gear Defect Diagnosis. NDT and E International. 36(7), 471-477. 2003.","cites":null},{"id":37924252,"title":"Slip detection using acoustic emission signal analysis.","authors":[],"date":null,"doi":"10.1109\/robot.1987.1087812","raw":"Dornfeld, D. and Handy, C. Slip detection using acoustic emission signal analysis. IEEE International Conference on Robotics and Automation.  Vol. 4, pp 1868 -","cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2005-05-01T00:00:00Z","abstract":"Condition monitoring of gears with vibration analysis is well established whilst\nthe application of acoustic emission (AE) to gear defect diagnosis and\nmonitoring is still in its infancy. This paper details results of an\nexperimental programme to ascertain and validate the applicability of AE to\nseeded gear defect identification. Furthermore, comparisons are made to\nvibration diagnosis. As a direct consequence of the experimental programme, the\nrelationship between temperature, oil film thickness and AE activity were\ninvestigated. It is shown that similar to the lubricant film thickness between\nnon-conforming surfaces under isothermal conditions, AE activity is not\ninfluenced by load. Limitations of applying AE to seeded defect identification\nare presented and it is concluded that the source of AE activity is attributed\nto asperity contact","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/141045.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.triboint.2004.10.007","pdfHashValue":"2b9b0caf0234c240f98c641140753838181d3ae6","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/888<\/identifier><datestamp>2011-11-28T23:03:26Z<\/datestamp><setSpec>hdl_1826_19<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Identification of the acoustic emission source during a comparative study on\ndiagnosis of a spur gearbox<\/dc:title><dc:creator>Tan, Chee Keong<\/dc:creator><dc:creator>Mba, David<\/dc:creator><dc:subject>Acoustic emission<\/dc:subject><dc:subject>Asperity contact<\/dc:subject><dc:subject>Condition monitoring<\/dc:subject><dc:subject>Gear defect diagnosis<\/dc:subject><dc:subject>Lubricant film thickness<\/dc:subject><dc:subject>Rolling friction<\/dc:subject><dc:subject>Sliding friction<\/dc:subject><dc:description>Condition monitoring of gears with vibration analysis is well established whilst\nthe application of acoustic emission (AE) to gear defect diagnosis and\nmonitoring is still in its infancy. This paper details results of an\nexperimental programme to ascertain and validate the applicability of AE to\nseeded gear defect identification. Furthermore, comparisons are made to\nvibration diagnosis. As a direct consequence of the experimental programme, the\nrelationship between temperature, oil film thickness and AE activity were\ninvestigated. It is shown that similar to the lubricant film thickness between\nnon-conforming surfaces under isothermal conditions, AE activity is not\ninfluenced by load. Limitations of applying AE to seeded defect identification\nare presented and it is concluded that the source of AE activity is attributed\nto asperity contact.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-11-28T23:03:26Z<\/dc:date><dc:date>2011-11-28T23:03:26Z<\/dc:date><dc:date>2005-05-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Chee Keong Tan and David Mba, Identification of the acoustic emission source\nduring a comparative study on diagnosis of a spur gearbox, Tribology\nInternational, Volume 38, Issue 5, May 2005, Pages 469-480.<\/dc:identifier><dc:identifier>0301-679X<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.triboint.2004.10.007<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/888<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0301-679X","0301-679x"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Acoustic emission","Asperity contact","Condition monitoring","Gear defect diagnosis","Lubricant film thickness","Rolling friction","Sliding friction"],"subject":["Article"],"fullText":" 1\nIdentification of the Acoustic Emission source during a \ncomparative study on diagnosis of a spur gearbox \n \nChee Keong Tan and David Mba \nSchool of Engineering, Cranfield University, Bedfordshire. MK43 0AL, UK \nTel +44 (0) 1234-754681, Fax: +44 (0) 1234-751566. \n E-mail: c.k.tan@cranfield.ac.uk and d.mba@cranfield.ac.uk \n \nAbstract \n \nCondition monitoring of gears with vibration analysis is well established whilst the \napplication of Acoustic Emission (AE) to gear defect diagnosis and monitoring is still in \nits infancy. This paper details results of an experimental programme to ascertain and \nvalidate the applicability of AE to seeded gear defect identification. Furthermore, \ncomparisons are made to vibration diagnosis. As a direct consequence of the \nexperimental programme, the relationship between temperature, oil film thickness and \nAE activity were investigated. It is shown that similar to the lubricant film thickness \nbetween non-conforming surfaces under isothermal conditions, AE activity is not \ninfluenced by load. Limitations of applying AE to seeded defect identification are \npresented and it is concluded that the source of AE activity is attributed to asperity \ncontact. \n \n 2\nKeyword: Acoustic Emission, asperity contact, condition monitoring, gear defect \ndiagnosis, lubricant film thickness, rolling friction, sliding friction. \n \n1. Introduction \n \nThe application of Acoustic Emission (AE) to static structures is well documented [1]. \nHowever, the application of AE to fault diagnosis of rotating machines is in its infancy \n[2–10]. The use of vibration analysis to gear fault diagnosis and monitoring has been \nwidely investigated and its application in industry is well established [11-13]. This is \nparticularly reflected in the aviation industry where the helicopter engine, transmission \nsystems, drive trains and rotor systems have been fitted with vibration systems for \ncomponent health and monitoring.  \n \nDrosjact et al [14] attempted to establish the actual physical mechanism that caused \nvibration change in the gear defect frequencies. Drosjact et al postulated that changes in \ntooth thickness due to presence of pits caused modifications in the Hertzian compliance. \nFurthermore, it was suggested that pitting will cause instantaneous changes in Hertzian \nstiffness which generate a Hertzian impact due to the sudden velocity differences \nbetween the pinion and wheel. In addition, micro pitting was also identified as a source of \nincreased vibrations. Micro pitting is related to the initiation of other failure modes such \nas pitting, scuffing, and flank initiated bending failures.  \n \n 3\nResearch publications in the application of AE to gear fault detection and monitoring are \nlimited. This paper explores the applicability of AE to gear defect diagnosis. \nFurthermore, it explores the source of AE activity from the gearbox.  \n \n2. Acoustic Emission \n \n \nAcoustic Emission is defined as the transient elastic wave generation due to a rapid \nrelease of strain energy within or on the surface of a material. These waves are detected \nat the surface of the body by a suitable sensor. The principal advantage of AE comes \nfrom its high sensitivity. Since AE is produced at a microscopic level, it is more sensitive \nto detection of loss of mechanical integrity as compared to the well established vibration \nmonitoring technique. The main disadvantage of using AE is attenuation experienced \nover distances and particularly across interfaces.  \n                                                                                                                                                                             \n3. Literature Reviews \n \nToutountzakis et al [6] presented some interesting observations on AE activity due to \nmisalignment and natural pitting and concluded that the AE technique was a viable \ntechnique for monitoring gear deterioration. Tandon et al. [15] concluded that the AE \nparameters increased with increased defect size (diameter of pit) and load. Tandon also \nrevealed that the AE technique was able to detect smaller defects in comparison to \nvibration measurements. \n \n 4\nSingh et al [16, 17] noted that AE could provide earlier detection over vibration \nmonitoring for pitting of gears, excluding extremely high gear speeds or unloaded gear \nconditions. Furthermore, it was commented that AE could detect crack initiation and \ngrowth, while the accelerometer could only detect the crack growth at a later stage of the \ncrack growth process. The final experiment performed by Singh et al involved an \nassessment of the transmissibility of AE signal within a gearbox. It was concluded that \nthe attenuation across the gearbox was an accumulation of losses across each individual \ninterface within the transmission path. Sentoku [18] correlated tooth surface damage such \nas pitting to AE whilst Siores et al [19] concluded that the AE results could be correlated \nto various defect conditions. \n \nThe papers reviewed have illustrated the potential of AE becoming a useful diagnostic \ntool in condition monitoring of gears.  \n \n4. Experimental set-up \n \n4.1 Gearbox \nThe test-rig employed for this investigation consisted of two identical oil-bath lubricated \ngearboxes, connected in a back-to-back arrangement, see figure 1. The 49 and 65 teeth \ngear sets were made of 045M15 steel without heat treatment. The gears have a pressure \nangle of 20°, module of 3 mm and surface roughness between 2-3 µm (before running-\nin). Each gearbox had four identical bearings. The method of applying torque was a \nsimple mechanism that allowed a pair of coupling flanges to be rotated relative to each \nother, and locked in position. This effectively locks the torque within the gearboxes \n 5\nensuring that the motor used to drive the test rig only overcome power losses associated \nwith the meshing gears. It must be noted that the 0 Nm condition is not literally ‘0 Nm’. \nThere will exist a light load at this condition due to the bearing friction and \nlosses\/resistance associated with the rubber seals, gear churning and windage. If a true ‘0 \nNm’ condition was obtainable, the gear would run in a non-linear manner. The motors \nused to drive the gearbox were single speed motors (1.1 kw and 0.55 kw) providing a \nrotational speed of 745 rpm and 1460 rpm respectively. For these experimental \ninvestigations, five torque loadings were used; 0 Nm, 55 Nm, 110Nm 183 Nm and 220 \nNm. \n \nFigure 1 Test-rig gearbox arrangement. \n \n \n \n \n 6\n4.2 Data Acquisition \nThe AE sensors used for this experiment were wide band type sensors with a relative flat \nresponse between 100 kHz and 1 MHz (WD model, ‘Physical Acoustics Corporation’). \nAn AE sensor was placed on the pinion (49 teeth), see figure 2. The cable connecting the \npinion sensor was fed into the pinion shaft to the pre-amplifier via a slip ring. This \narrangement allowed the AE sensor to be placed as close as possible to the gear teeth. \nBoth sensors were held in place with mechanical fixtures. An ‘IDM Electronics Ltd’ \nmanufactured PH-12 slip ring was employed. The slip ring used sliver contact and could \naccommodate a maximum of 12 channels. The cooling air pressure for the slip ring was \n1400 kg\/mm2. Pre-amplification was set at 40dB. The signal output from the pre-\namplifier was connected (i.e. via BNC\/coaxial cable) directly to a commercial data \nacquisition card. The data acquisition card could provide 10 MHz sampling rate and \nincorporated 16-bit precision giving a dynamic range of more than 85 dB. Prior to the \nanalog-to-digital converter (ADC), the card employed anti-aliasing filters that can be \ncontrolled directly in software. A K-type (Chromel-Alumel) thermal couple, rated from -\n2000C to 13780C, was employed to measure the oil temperature for computation of oil \nfilm thickness. The oil bath temperature was measured through an opening on top of the \ngearbox casing using the specified thermal couple probe. This position for acquiring oil \ntemperatures was adjacent to the gear mesh position as this was the closest position the \nauthors could get access to. \n \n 7\n \n \n \n \n \n \n \n \n \n \nFigure 2 AE sensor located on the pinion. \n \nThe accelerometer (see figure 3) used for vibration measurement in this experiment was \nresonant type sensor with a flat frequency response between 10 Hz and 8000 Hz (Model \n236 Isobase accelerometer, ‘Endevco Dynamic Instrument Division’). The accelerometer \nwas mounted on the base of the pinion bearing casing to capture vibration data of the \ngearbox. The charge amplifier employed was a single channel PE amplifier (Endevco \nDynamic Instrument Division, Model 2721B). The accelerometer was connected to a \ncharge amplifier, and the signal output from the pre-amplifier was fed to a commercial \ndata acquisition card. Energy, r.m.s and frequency domain information were computed \nfrom the raw time-domain data. A 1V peak from the pre-amplifier corresponded to 1g. \nThis was calibrated using a calibration table from Endevco. \nSensor on \ndriving gear \n 8\n \nFigure 3 Accelerometer located on bearing casing. \n \n5. Test procedure \n \nPrior to the start of the experiment the gearbox was ran for 15 hours. Following this a \nlarge addendum defect (extended from the pitch-line) measuring 12 mm along the face \nwidth and 3 mm from the pitch-line to the gear tip was seeded on one of the pinion tooth \nsurface, see figure 4. A total of six experimental combinations were undertaken: two \nspeed and three load conditions. For each test condition, the gearbox ran from a cold start \nfor several hours until the oil temperature reached equilibrium, i.e. it reached a \ntemperature that did not change as a function of running time. Equilibrium was \nestablished when oil temperature varied by less than 0.20C for a period of one hour. The \noil temperatures and vibration data were taken at 15 minute intervals throughout the \nduration of the test whilst AE r.m.s. and energy values were monitored continuously (see \nAccelerometer on \nbearing casing \n 9\nsection 9.1). AE time signatures were acquired for each test condition after 30 minutes \nfrom the start. For analysis of AE data obtained from these experiments, r.m.s and energy \nwere employed to provide a comparison to other published work and because of the \nsimplicity and proven robustness of these parameters for machine health diagnosis.  \n \n \nFigure 4 Seeded large addendum defect. \n \n \n \n6. Results of operational background noise \n \nFigure 5 displays a typical AE signature with corresponding frequency spectrum \nassociated with operational background noise. Background noise is defined as the \noperational condition of the machine prior to seeding the defect. It clearly shows 16 \nmeshing gear teeth. The frequency range of the AE signals associated with these tests \nranged from 70 kHz to 350 kHz. Figures 6 and 7 illustrate the time domain signatures for \nSeeded \nDefect \n 10\nthe load and speed cases considered with the simulated defect. The gear mesh frequency \ncan also be calculated from the time domain AE signal by calculating the rate of AE \nbursts, though this is only clearly evident at 745 rpm. At 1460 rpm, it is more difficult to \nseparate the AE transients associated with the gear mesh. This is primarily because the \nauthors could not increase the sampling rate of the acquisition beyond 10 MHz. \n \n0 0.005 0.01 0.015 0.02 0.025 0.03\n-4\n-2\n0\n2\n4\n6\nTime (seconds)\nV\nol\nts\n0 0.5 1 1.5 2 2.5 3 3.5 4 4.5 5\nx 105\n0\n0.02\n0.04\n0.06\n0.08\nFrequency (Hz)\nV\nol\nts\n \nFigure 5 Time and frequency domain of an AE signature showing clearly the \nAE transient response associated with gear meshing of 16 teeth for the \nrotational speed of 745 rpm; load 110 Nm. \nSeeded defect \n 11\n0 0.005 0.01 0.015 0.02 0.025\n-2\n-1\n0\n1\n2\nA\nm\npl\nitu\nde\n (v\n)\n0 0.005 0.01 0.015 0.02 0.025\n-5\n0\n5\nA\nm\npl\nitu\nde\n (v\n)\n0 0.005 0.01 0.015 0.02 0.025\n-4\n-2\n0\n2\n4\nA\nm\npl\nitu\nde\n (v\n)\nTime (seconds)\n(a) \n(b) \n(c) \n \nFigure 6  Raw AE signal for large addendum defect for (a) no load, (b) 55 Nm \nload and (c) 110 Nm load at 745 rpm.  \n0 0.005 0.01 0.015 0.02 0.025\n-1\n-0.5\n0\n0.5\n1\nA\nm\npl\nitu\nde\n (v\n)\n0 0.005 0.01 0.015 0.02 0.025\n-5\n0\n5\nA\nm\npl\nitu\nde\n (v\n)\n0 0.005 0.01 0.015 0.02 0.025\n-5\n0\n5\nTime (seconds)\nA\nm\npl\nitu\nde\n (v\n)\n (a)\n (b)\n(c) \n \nFigure 7 Raw AE signal for large addendum defect for (a) no load, (b) 55 Nm \nload and (c) 110 Nm load at 1460 rpm. \n \nSeeded defect\nSeeded defect\n 12\n7. AE fault identification capability \n \nFor the rotational speeds of 745 and 1460 rpm, the recorded AE time waveform was split \ninto regions representing 2-teeth and 1-tooth. Figure 8 illustrates the case for 2-teeth \nregions at 745 rpm. The r.m.s. value for each region was calculated for each data set. This \nwas equivalent to ‘8’ and ‘16’ r.m.s values for 2-teeth and 1-tooth data sets respectively. \nA total of 50 data sets were acquired for each test condition and the r.m.s values \npresented were averaged for each region over all fifty data sets. The averaging could be \naccomplished due to the optical triggering system employed ensuring that the acquisition \nsystem always started at the same rotational position of the gears. It was thought that this \nmethod of grouping the data would enhance the possibilities of detecting the seeded \ndefect particularly as the defect had been seeded in the centre of the acquisition window, \nsee figure 8. \n \nFor the seeded defect simulation at 745 rpm, the r.m.s. values remained random for the \nthree loading conditions, see figure 9. The centre region ‘4’, where the seeded defect was \nintroduced, did not exhibit the highest r.m.s. value as expected. The same observations \nwere made for the rotational speed of 1460 rpm, the highest r.m.s. values did not \nhappened in the seeded fault region of region ‘8’, see figure 10.  \n \n \n \n \n 13\n  1    2   3    4    5    6    7    8    9   10  11  12   13  14  15  16  (Teeth Number) \n     1      2      3       4      5           6          7          8 \nGear Teeth \nDefective Tooth\n \n \n \n \n \nFigure 8  Sectioning of gear teeth for analysis. \nSimilar observations were noted using the single-tooth group, the r.m.s. value at the \nseeded fault tooth, regions ‘8’ and ‘15’ (based on a single tooth demarcation for 745 and \n1460 rpm respectively), were not the highest values. These results revealed that this \ntechnique was unsuccessful for defect identification. Based on a normal distribution the \nvariation in AE r.m.s at the seeded defect location fell within one-standard deviation \nwhile all AE r.m.s values were within two-standard deviations. The results would have \nbeen conclusive had the r.m.s. level for the defective tooth being higher than other \nregions within the acquisition window. For the same test condition, AE energy exhibited \nsimilar observations. \n \nExamples of the raw AE signals from defect conditions are displayed in figures 6 and 7. \nThis shows the non-consistent observation of AE burst in relation to the defect position. \nThe largest amplitude burst of the AE signal did not always occur in the centre region of \nthe window where the seed fault was located even though the defect was comparatively \nlarge. Hence, it was not possible to detect the seeded defect using the AE indicators of \nr.m.s. and energy. This contradicts the work of a few researchers [15, 16, 19] that claimed \n 14\nAE indicators could clearly identify a simulated pit defect. It was interesting to note that \nin general, the r.m.s. values increased with increasing load conditions.  \n0.00\n0.10\n0.20\n0.30\n0.40\n0.50\n0.60\n0.70\n1 2 3 4 5 6 7 8\nRegion\nr.m\n.s\n. (\nv)\n0 Nm\n55 Nm\n110 Nm\n \nFigure 9 r.m.s against loads for 2-teeth analysis at 745 rpm. (8 regions) \n0.00\n0.20\n0.40\n0.60\n0.80\n1.00\n1.20\n1.40\n1.60\n1.80\n2.00\n1 2 3 4 5 6 7 8 9 10 11 12 13 14 15\nRegion\nr.m\n.s\n. (\nv)\n0 Nm\n55 Nm\n110 Nm\n \nFigure 10 r.m.s against loads for 2-teeth analysis at 1460 rpm. (15 regions) \n 15\n8. Vibration Analysis \n \nFrom acquired vibration signatures, the r.m.s. and energy values were calculated, and \nvibration frequency spectrum investigated. A sampling rate of 8192 data points per \nsecond (8192 Hz) over duration of approximately five seconds (40000 data points), \nwhich is approximately equivalent to 61 and 119 revolutions, was employed for vibration \ndata acquisition at rotational speeds of 745 and 1460 rpm respectively.  \n \nFor the rotational speed of 745 rpm, all three load conditions exhibited similar frequency \ncontent; the highest peaks in the frequency domain occurred at the gear mesh frequency, \n608 Hz, and sidebands were observed around this frequency (see figure 11). Harmonics \nof the gear mesh frequency were noted at 1200 Hz, 1800 Hz and 2400 Hz. The peak \nvalue at the gear mesh frequency increased from 0.5 to 1.0 g from no-load condition to \n110 Nm. As side bands about the gear mesh frequency were observed, see figure 11, this \nwas indicative of a defective tooth.  \n \nVibration frequency spectra results at 1460 rpm are presented in figure 12. A unique \nobservation was the wide band of frequency response ranging from 0 to 2600 Hz which \nwas not present at the lower speed of 745 rpm (figure 11). Under no-load condition, the \npeak value at the gear mesh (GM) frequency of 1200 Hz was 0.03 g. The dominant \nfrequencies in this spectrum were noted to be the sub-harmonics of the gear mesh \nfrequency at 300, 400, 600 and 800 Hz (0.25, 0.33, 0.5 and 0.67 GM). When the load \nincreased to 55 Nm, the dominant frequency was at 400 Hz (0.33 GM). Following an \n 16\nincrease in load to 110 Nm, the dominant frequency shifted back to the gear mesh \nfrequency with a peak value of 0.2 g. It is also important to note the strong presence of \nthe second harmonic gear mesh frequency at 2400 Hz. At this load side bands were \nobserved about the gear mesh frequency, again evident of a defective tooth.  \n \n \n \nFigure 11 Frequency spectra for (a) 0 Nm, (b) 55 Nm and (c) 110 Nm load \nconditions at 745 rpm. \n(a) \n(b) \n(c) \n 17\n \n \n \nFigure 12 Frequency spectra for (a) 0 Nm, (b) 55 Nm and (c) 110 Nm load \nconditions at 1460 rpm. \n \nFurther investigations were undertaken to understand the unique frequency spectra at \n1460 rpm. Gears are described as lightly loaded when applied load on the gear is not \nsufficiently high enough to maintain contact during meshing. The phenomenon usually \n(a) \n(b) \n(c) \n 18\noccurs due to light loads or high loads with large transmission errors (TE). Smith [21] \nstated that in general, the presence of strong harmonics at the tooth mesh frequency \nindicates loss of contact, and this condition is reinforced if the harmonics increase with \nreducing loads. From figure 12, the presence of strong harmonics at the gear mesh \nfrequency was evident and the harmonics increased with a reduction in load. Hence, a \nlightly loaded condition was suspected to exist under certain conditions at 1460 rpm. \n \nIt was thought prudent to ascertain if the test gears could be considered as lightly loaded. \nSmith [21] details the procedure for determining such a condition. Assuming a \nTransmission Errors (TE) of 5 µm, which is typical for spur gears [21], the torques \nrequired to maintain the meshing teeth in contact was calculated at 43 Nm and 107 Nm \nfor the pinion and gear respectively, both at a rotational speed of 1460 rpm. Hence, for \nthe 55 Nm test condition, the applied load was lower than the required torque to maintain \nthe meshing teeth in contact, 107 Nm, hence loss of contact was likely to occur, as \nconfirmed earlier. For the 110 Nm test condition, the applied torque was marginally \nhigher than the required torque of 107 Nm. Thus, it may be concluded that no contact loss \noccurred under this situation, which is evident from the differences in the frequency \nspectra between figure 12(c) and 12(b).  Based on the same concept, the required torques \nfor the gear teeth to remain in contact are also computed for the case of 745 rpm; 11 and \n28 Nm for the pinion and gear respectively. With the minimum applied torque of 55 Nm, \nwhich is higher than the required torque of 28 Nm, the gears will not be lightly loaded.  \n \n 19\nClearly, vibration analysis was capable of diagnosing the large seeded defect, however, \nthis was not evident from analysis of AE data. \n \n9. Oil Temperature and Film Thickness \n \nTo understand the limitations of the AE technique for defect identification further tests \nwere undertaken. This involved measuring the oil temperature of the gearbox sump from \na cold start to the operational oil temperature and calculating the oil film thickness \nbetween the gears. Results from the six test conditions were plotted to observe the effect \nof speed and load over the oil temperature and film thickness.  For both speeds (745 and \n1460 rpm), the operational oil temperatures increased with increased loads and speeds, \nsee figures 13 to 15. \n0\n5\n10\n15\n20\n25\n30\n35\n40\n45\n50\n0 1 2 3 4 5 6 7\nTime (hours)\nTe\nm\npe\nra\ntu\nre\n (D\neg\nre\ne \nC\n)\n0 Nm\n55 Nm\n110 Nm\n \nFigure 13 The effect of load on oil temperature for speed of 745 rpm. \n 20\n0\n10\n20\n30\n40\n50\n60\n0 1 2 3 4 5 6 7\nTime (hours)\nTe\nm\npe\nra\ntu\nre\n (D\neg\nre\ne \nC\n)\n0 Nm\n55 Nm\n110 Nm\n \nFigure 14 The effect of load on oil temperature for speed of 1460 rpm. \n \nThe oil film thickness, µm, [22] was calculated from equation (1) \n5.0\n11min })1\n{(sin325.0 += r\nrVdVh kφ         (1) \n \nResults of theoretical oil film thickness are presented in figures 16 and 17. Based on the \nsurface finish of 1.75 µm, the results indicated asperity contact for all test condition. \n \n 21\n0\n10\n20\n30\n40\n50\n60\n0 1 2 3 4 5 6 7\nTime (hours)\nTe\nm\npe\nra\ntu\nre\n (D\neg\nre\ne \nC\n)\n745 rpm\n1460 rpm\n \nFigure 15 The effect of speed on oil temperature for load of 110 Nm. \n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n0 1 2 3 4 5 6 7\nTime (hours)\nO\nil \nFi\nlm\n T\nhi\nck\nne\nss\n (µ\nm\n)\n0 Nm\n55 Nm\n110 Nm\n \nFigure 16 The effect of load on oil film thickness for speed of 745 rpm. \n 22\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\n1.8\n2.0\n0 1 2 3 4 5 6 7\nTime (hours)\nO\nil \nFi\nlm\n T\nhi\nck\nne\nss\n (µ\nm\n)\n0 Nm\n55 Nm\n110 Nm\n \nFigure 17 The effect of load on oil film thickness for speed of 1460 rpm. \n \nPossible sources of errors for the oil film thickness calculation include:  \n• The assumption of constant density, as oil density will change with temperature and \naffect on oil film thickness.  \n• The measurement of oil temperatures. It was not possible to measure the oil \ntemperature in the gear mesh due to obvious access problems. Hence, the oil \ntemperatures were taken at the oil bath location as near to the gear mesh as possible. \nThe oil bath temperatures recorded would certainly be lower than the actual oil \ntemperatures.  \n \n \n \n 23\n9.1 Relationship between temperature and AE \n \nThe relationship between AE peak amplitude and r.m.s. with load has been detailed [15]. \nIncreasing the load resulted in an increase in AE r.m.s. and peak amplitude. However, the \nresults of AE r.m.s and energy presented thus far were considered unsatisfactory in \nidentifying the defect location. This resulted in yet further tests to explain the \ndiscrepancies, particularly as other authors had supported the applicability of these \nparameters to gear defect detection. These new tests were carried out using the same test \nset-up, but in this instance the AE r.m.s. and energy data were monitored and recorded \ncontinuously while oil temperature in the gearbox was also measured at fifteen minute \nintervals. \n \nContinuous Acoustic Emission energy and r.m.s values were calculated in real time by \nthe ADC controlling software. The software employed a hardware accelerator so that \ncalculations could be performed in real time. The hardware accelerator takes each value \nfrom the ADC and squares it. The results are added into an accumulator for a \nprogrammable time interval, based on the user set time constant which in this instance \nwas 100 ms. At the start of the time interval the accumulator is cleared and at the end of \nthe time interval the accumulator value is stored. The r.m.s is then calculated by taking \nthe square root of the sum of the accumulated squared ADC readings. The energy value \ncomputed was equivalent to the area under the time waveform and is measured in Atto-\nJoules. The time interval for acquisition was also set at 100 ms. \n \n 24\nThese additional tests were run at three load conditions and were started from cold and \nterminated when the oil temperatures remained stable for one hour. Continuous AE r.m.s. \nand energy were calculated throughout the period of testing. Equilibrium at the oil \ntemperatures was achieved when the temperature remained within 0.20C for the duration \nof one hour. \n \nA smoothening technique was applied to the continuous AE data using moving average \nof 255 data points. From figures 18 and 19, it was noted that the AE r.m.s. varied with \ntime as the gear box reached a stabilised temperature. This was observed for both r.m.s \nand energy values. This implied that depending on what time the AE data was collected \nfor a given speed and load condition, the variation in AE activity r.ms or energy could be \nas much as 50% for 745 rpm and 125% at 1460 rpm. For these particular tests the point at \nwhich the data was captured is highlighted in figures 18 and 19. Thus, the AE signal \ncaptured during seeded defect tests were ‘snapshots’ that are largely influenced by load \nand oil temperature. As ‘snapshots’ only provide information at an instance in time, the \nrepeatability of the derived AE parameters will be subjected to considerable variation. \nThe influence of load and oil temperature on AE activity is directly linked to the oil film \nthickness between the meshing gears. The oil film thickness will influence the rate of \nwear and asperity deformation, both of which generate the AE activity.  \n \nThe complications of the effect of oil temperature on AE activity have far reaching \nconsequences, particularly as most of the published work to date have not take \ncognisance of this effect. The authors of this paper believe it is flawed to compare AE \n 25\nactivity from defect free and\/or simulated defect conditions under varying loads without \naccounting for the influence of oil temperature.  \n0.00\n0.10\n0.20\n0.30\n0.40\n0.50\n0.60\n0.70\n0 1 2 3 4 5 6 7 8\nOperating Time (hours)\nA\nE \nr.m\n.s\n. (\nv)\n0 Nm 55 Nm 110 Nm\n \nFigure 18  Continuous AE r.m.s values 745 rpm. \nAcquisition time for the test  \n0 Nm \n110 Nm \n55 Nm\n 26\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\n1.8\n2.0\n0 5000 10000 15000 20000 25000 30000\nTime (s)\nr.m\n.s\n. (\nv)\n \nFigure 19  Continuous AE r.m.s values 1460 rpm. \nTaking cognisance that AE activity is generated during the sliding of the gears, \nprincipally due to asperity contacts [20], the introduction of a seeded defect which \nremoves surface material digresses from the basic source of AE generation. Therefore the \nauthors argue that defect identification of seeded defects of this nature cannot be \naccomplished with the AE technique. This statement will hold true if seeded defect \ninvolved the removal of material from the surface. However, other authors [15, 16, 19] \nhave claimed success and it is argued that the more likely reason for this is as follows: It \nis highly possible that in the process of material removal from the gear face ‘mounds’ or \n‘protrusions’ will be formed at the boundaries of the seeded defect, see figure 20. These \nare created due to the displacement of material from the region of material removal. The \nauthors postulate that it is these ‘protrusions’ that was responsible for AE activity. \nHowever, this activity will only last until the ‘protrusions’ are flattened during the \nAcquisition time for the test  \n0 Nm\n55 Nm \n110 Nm \n 27\noperation of the gear, see figure 21. In the later instance, AE will be generated by asperity \ncontacts. \n \nFigure 20 Mounds or Protrusions of the gear surfaces in contact during \nrotation. \n \n \nFigure 21  Flattened protrusions of gear surfaces \n \nSeeded Fault \nSource of AE activity: contact \nbetween material protrusions of \nseeded fault and surface asperity \nof the other gear. \nGear 1 \nGear 2 \nDirection of sliding\nDirection of sliding \nFlattening of \nprotrusions around \nthe seeded fault \nGear 1 \nGear 2 \nDirection of sliding \nDirection of sliding \n 28\nWhilst researchers [15, 16, 19] have stated that AE indicators such as r.m.s. and energy \nincreased with increasing load and speed, none have taken cognisance of the effect of \ntemperature on AE activity. Clearly measuring the load and speed will cause a change in \nlubricant temperature. The authors believe that the lubricant temperature is the dominant \nfactor in the AE generation and the load or speed is a secondary factor of the oil \ntemperature. This has far reaching consequences as it implies that whilst other \nresearchers have stipulated the effect of load\/speed on AE activity, the time of data \nacquisition, in effect the temperature of the lubricant, will determine what values of r.m.s. \nare obtained. If as observed in this paper, the AE parameters continually change for \nseveral hours, the data presented by other researchers are subjected to variation caused by \nenvironmental conditions. This implies that even if attempts were undertaken to collect \nAE data at specified times, the effect of ambient temperature, which will influence the \ntemperature at which the data is collected, could present inconsistencies or repeatability \nissues. Developing AE as a robust diagnosis tool without taking cognisance of the \ntemperature influence will not be robust. To prove this postulation, the authors undertook \nan additional test. \n \n10. Constant Temperature Tests \n \nThe three main factors affecting the AE signal in these experiments are namely; speed of \nrotation, applied torque (load) and the oil temperature. In order to further examine the \nspeed and load effect on AE signal for this back-to-back gearbox arrangement, constant \n 29\ntemperature tests were performed. Since the oil temperatures were kept constant, the oil \nviscosity and film thickness will remain constant during the experiment.  \n \nThe gearbox was run at 745 rpm with a load of 220 Nm for 5 hours at which time the oil \ntemperature stabilised at 42.70C. The gearbox was brought to a stop and adjusted to no-\nload condition. The gearbox was re-started and run for 10 minutes whilst continuous AE \ndata in the form of r.m.s and energy was recorded. The gearbox was again brought to a \nstop and adjusted to the next load condition. Every load condition was run for a 10- \nminute interval while the continuous AE r.m.s. and energy data were taken. The time \ntaken to strip the rig and set the new torque level was approximately three minutes. \nDuring this period the acquisition system was paused. A total of 5 load conditions; 0, 55, \n110, 183 and 220 Nm, were tested. In these tests, the average oil temperature was at \n42.40C with a maximum temperature difference of 1.80C to minimise the temperature \neffect. \n \nAt the rotational speed of 745 rpm, the continuous AE r.m.s. values were plotted for the 5 \nloading conditions and presented in figure 22. It was observed that the AE r.m.s remained \nrather constant at 0.58 volts with increasing loads. For the 1460 rpm test condition, the \nsame test procedures were employed, the oil temperature stabilised at 51.80C. The mean \noil temperature was kept at 50.80C with a maximum temperature difference of 3.50C to \nensure constant temperature condition. The AE r.m.s. was plotted against the five loading \nconditions, see figure 23. Similar trends were observed when compared to the lower \nrunning speed condition. With increasing load, the AE r.m.s remained constant at 1.2 \n 30\nvolts. From the above results, it can be concluded that at constant oil temperature, the \napplied load on the gear system had negligible effect on AE r.m.s. On the other hand, \nspeed had a more significant effect on the AE indicators. By doubling the rotational \nspeed from 745 rpm to 1460 rpm, the AE r.m.s increased from 0.58 to 1.2 volts by a \nfactor of 2. Between the two rotational speeds, there was a temperature difference of \n8.40C.  \n \nBoness et al [20] showed that AE r.m.s increased with decreasing viscosity. Hence, for \nthis experiment, the increase in the AE parameters at 1460 rpm was partially due to the \nhigher oil temperature at the higher rotational speed. This will be the topic of future \nresearch by the authors. \n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0 600 1200 1800 2400 3000 3600\nTime (seconds)\nr.\nm\n.s\n. (\nv)\n \nFigure 22 AE r.m.s. remained constant with increased load at 745 rpm \n \n \nAcquisition systems paused for load change. \n 31\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\n0 600 1200 1800 2400 3000 3600\nTime (seconds)\nr.m\n.s\n. (\nv)\n \nFigure 23 AE r.m.s. remained constant with increased load at 1460 rpm \n \n11 AE Source Mechanisms \n \nFrom the observations presented thus far two possible sources of AE were identified; \ntooth resonance and asperity contacts.  \n \n11.1 Tooth resonance \nEstimation of the tooth resonance frequency was accomplished by modelling the gear \ntooth as a cantilever beam and spring mass systems. Using the gear tooth geometries, \nloading boundary conditions and the assumption that the load is transmitted through the \npitch-line, the tooth resonance frequency was calculated at 75kHz. This eliminated gear \ntooth resonance as a source of AE activity in the gear mesh. \nAcquisition systems paused for load change. \n 32\n11.2 Friction and asperity contacts \nDuring the gear mesh; sliding, rolling or a combination of both will occur. As the gear \nteeth surfaces are limited to manufacturing capabilities (approximately 0.4µm) asperity \ncontacts will occur during meshing on almost all gears, particularly as the calculated oil \nfilm thickness in this instance is less than the composite roughness.  \n \nDuring gear experiments, Smith [23] noted transient shock pulses during gear mesh at the \ngear mesh frequency. It was concluded that these shocks were attributed to asperity \ncontact. Whilst a single asperity model was presented as the probable cause of the shocks, \nthe likelihood of such scenario in practice is limited, multiple contacts will be present. \nHowever, it was shown that based on a asperity width of 5µm and sliding and rolling \nvelocities of the order of 500mm\/s, the raise time for such a transient event was 10µs. It \nmust be noted that the sensors employed by Smith had a natural frequency of 50 kHz and \nis outside the range of AE. \n \nThe relationship between sliding and rolling friction has been investigated [22]. It was \nshown that whilst the rolling friction traction is independent of load the sliding friction \ntraction is influenced by the lubricant viscosity and load. Furthermore, it was shown that \nincreasing rolling speed resulted in a reduction of friction traction for a fixed load and \nlubricant viscosity. Following observations presented in this paper of relatively constant \nr.m.s. values at a fixed speed and temperature irrespective of load, some resemblance to \nthe phenomena of rolling friction, and elastohydrodynamic lubrication, as detailed by \nDowson et al is evident.  \n 33\nStudies in tribology are significant to the work presented. Boness et al [20] studied the oil \nviscosity effects on AE and wear in lubricated sliding contacts. Several observations were \nnoted including an increase in AE r.m.s with decreasing viscosity and increased rotational \nspeed, but more importantly, the source of AE under lubricated sliding conditions was \nattributed to asperity contact. In relating AE to sliding friction Dornfeld [24] et al have \nshown the high sensitivity of AE to sliding speed and applied load. It was noted that the \nbasic mechanism for AE generation was the elastic deformation of the material at \nasperity contacts. This deformation was accented or mated by increased rates (sliding \nspeed), contact forces and lubrication. The range of surface finish for the materials \ninvestigated was from 1 to 4µm; comparable with the gears tested in this study.  \n \nAll the above comments provided strong evidence to suggest that the source of AE during \ngear mesh is attributed to asperity contact. The authors are currently investigating this \nphenomenon in more detail and results of the study will be subject to future publication. \n \n12. Conclusion \n \nThe main element contributing to the change in vibration level is the stiffness of the \noperating gear system. Hence, as long as the defect is able to alter the stiffness of the \nsystem, it will be detected by the accelerometer, as observed in the experiments reported. \nThis is in contrast to the AE technique which was excited by asperity contacts.  \n \nThe general relationships between monitoring parameters (such as vibration and AE \nindicators) and the gearbox operating conditions (such as load, speed and oil film \n 34\nthickness) have been established in this experiment. It is important to note that various \nindicators within a monitoring technique must be used simultaneously in order to \nestablish and explain the phenomena observed. The most ideal situation is to use various \ntechniques to monitor the gearbox health status at the same time. This paper has \ndemonstrated that gear defect detection with AE is fraught with difficulties. Seeded \ndefect identification with AE r.m.s. and energy were not satisfactory. The influence of oil \ntemperature on AE activity has been presented as the primary reason for this limitation. It \nis concluded that the source of AE mechanism that produced the gear mesh bursts was \nfrom asperities contact. It is postulated that the variation in amplitude of each AE \ntransient burst at the mesh, as evident in figures 5 to 7, is attributed to the changing \nnature of the asperity contact with time, particularly as the individual teeth involved in \neach mesh are not identical at each mesh due to the difference in number of teeth on each \nwheel.  \n \n Finally, the constant temperature tests have revealed far reaching consequences which \nmay alter the approach of applying AE technique to gear fault diagnosis and monitoring. \nFurthermore, it may offer tribologists a means of assessing the effectiveness of a \nlubricant under a range of operating condition. \n \n13. References \n \n1. Miller, R.K. and McIntire, P. Acoustic Emission Testing, Volume 5, 2nd ed., Non-\ndestructive Testing Handbook. Ed., American Society for Non-destructive Testing, \npp 275-310, 1987. \n 35\n2. Mba, D. and Bannister, R.H. Condition monitoring of low-speed rotating machinery \nusing stress waves: Part1 and Part 2. Proc Inst Mech Engrs. 213(3), Part E, 153-185. \n1999. \n3. Morhain, A. and Mba, D. Bearing defect diagnosis and acoustic emission Journal of \nEngineering Tribology, I Mech E, Vol 217, No. 4,  Part J, p 257-272,  2003. ISSN \n1350-6501Mba, D. (2002). \n4. Mba, D. Applicability of acoustic emissions to monitoring the mechanical integrity \nof bolted structures in low speed rotating machinery: case study. NDT and E \nInternational. 35(5), 293-300. 2002. \n5. Mba, D., Cooke, A.,  Roby, D. and  Hewitt, G. Detection of shaft-seal rubbing in \nlarge-scale power generation turbines with Acoustic Emissions; Case study. Journal \nof Power and Energy - Part A, I Mech E, Vol 218, No. 2, Part A, p 71-82, March \n2004. ISSN 0957-6509. \n6. Toutountzakis, T. and Mba, D. Observation of Acoustic Emission Activity During \nGear Defect Diagnosis. NDT and E International. 36(7), 471-477. 2003. \n7. Bruzelius, K. and Mba, D. An initial investigation on the potential applicability of \nAcoustic Emission to rail track fault detection. NDT & E International, 37(7), 507-\n516. 2004. \n8. Hall, L.D. and Mba, D. Diagnosis of continuous rotor–stator rubbing in large scale \nturbine units using acoustic emissions, Ultrasonics, 41(9), 765-773. 2004. \n9. Hall, L.D. and Mba, D. Acoustic emissions diagnosis of rotor-stator rubs using the \nKS statistic, Mechanical Systems and Signal Processing, 18(4), 849-868. 2004. \n 36\n10. Mba, D and Jamaludin, N. Monitoring extremely slow rolling element bearings: \nPart I and II, NDT and E International, 35(60), 349-366, 2002.  \n11. Gadd, P. and Mitchell, P.J. Condition monitoring of helicopter gearboxes using \nautomatic vibration analysis techniques. AGARD CP 369. Gears and power \ntransmission system for helicopter turboprops. 29\/1 – 29\/10.1984. \n12. Leblanc, J.F.A., Dube, J.R.F. and Devereux, B. Helicopter gearbox vibration \nanalysis in the Canadian Forces-applications and lessons. 1st International \nConference, Gearbox noise and vibration. IMechE, Cambridge, UK. C404\/023, pp \n173 -177. 1990. \n13. Cameron, B.G. and Stuckey, M.J. A review of transmission vibration monitoring at \nWestland Helicopter Ltd. 20Th European Rotorcraft Forum. Paper 116. pp 116\/1 – \n116\/16. 1994. \n14. Drosjack, M.J. and Houser D.R. An experimental and theoretical study of the effect \nof simulated pitch line pitting on the vibration of a geared system. ASME \nPublication Report 77-DET-123, 1977. \n15. Tandon, N. and Mata, S. Detection of Defects in Gears by Acoustic Emission \nMeasurements, Journal of Acoustic Emission. Vol. 17, Issue 1-2, 23-27, 1999. \n16. Singh, A., Houser, D. R., and Vijayakar, S. Early Detection of Gear Pitting, Power \nTransmission and Gearing Conference, ASME. DE-Vol. 88, 673-678, 1996. \n17. Singh, A., Houser, D. R., and Vijayakar, S. Detecting Gear Tooth Breakage Using \nAcoustic Emission: A Feasibility and Sensor Placement Study, Journal of \nMechanical Design. Vol. 121, 587-593, 1999. \n 37\n18. Sentoku, H. AE in Tooth Surface Failure Process of Spur Gears, Journal of \nAcoustic Emission. Vol. 16, Issue 1-4, S19-S24, 1998. \n19. Siores, E.  and Negro, A.A. Condition Monitoring of a Gear Box Using Acoustic \nEmission Testing, Material Evaluation. 183-187, 1997. \n20. Boness, R.J. and McBride, S.L. Adhesive and abrasive wear studies using acoustic \nemission techniques. Wear. Vol. 149, 41-53, 1991. \n21. Smith, J.D. Gear noise and vibration, 1st ed. New York: Marcel Dekker In \ncooperation, 1999. \n22. Dowson, D. and Higginson, G.R. Elasto-hydrodynamic Lubrication. 1st ed. Oxford: \nPergamon Press, 1977. \n23. Smith, J.D. A new diagnostic technique for asperity contact. Tribology \nInternational. Vol. 26, pp 25-27. 1993. \n24. Dornfeld, D. and Handy, C. Slip detection using acoustic emission signal analysis. \nIEEE International Conference on Robotics and Automation. Vol. 4, pp 1868 -\n1875. 1987. \n"}