{"doi":"10.1088\/1126-6708","coreId":"66308","oai":"oai:dro.dur.ac.uk.OAI2:2036","identifiers":["oai:dro.dur.ac.uk.OAI2:2036","10.1088\/1126-6708"],"title":"DGP specteroscopy.","authors":["Charmousis, C.","Gregory, R.","Kaloper, N.","Padilla, A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-10-24","abstract":"We systematically explore the spectrum of gravitational perturbations in codimension-1 DGP braneworlds, and find a 4D ghost on the self-accelerating branch of solutions. The ghost appears for any value of the brane tension, although depending on the sign of the tension it is either the helicity-0 component of the lightest localized massive tensor of mass 0<m2<2H2 for positive tension, the scalar `radion' for negative tension, or their admixture for vanishing tension. Because the ghost is gravitationally coupled to the brane-localized matter, the self-accelerating solutions are not a reliable benchmark for cosmic acceleration driven by gravity modified in the IR. In contrast, the normal branch of solutions is ghost-free, and so these solutions are perturbatively safe at large distance scales. We further find that when the Z2 orbifold symmetry is broken, new tachyonic instabilities, which are much milder than the ghosts, appear on the self-accelerating branch. Finally, using exact gravitational shock waves we analyze what happens if we relax boundary conditions at infinity. We find that non-normalizable bulk modes, if interpreted as 4D phenomena, may open the door to new ghost-like excitations","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66308.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2036\/1\/2036.pdf","pdfHashValue":"2011c29b6c31e57ab2697de49c095ba660f79cb7","publisher":"Institute of Physics","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:2036<\/identifier><datestamp>\n      2015-06-17T11:06:21Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        DGP specteroscopy.<\/dc:title><dc:creator>\n        Charmousis, C.<\/dc:creator><dc:creator>\n        Gregory, R.<\/dc:creator><dc:creator>\n        Kaloper, N.<\/dc:creator><dc:creator>\n        Padilla, A.<\/dc:creator><dc:description>\n        We systematically explore the spectrum of gravitational perturbations in codimension-1 DGP braneworlds, and find a 4D ghost on the self-accelerating branch of solutions. The ghost appears for any value of the brane tension, although depending on the sign of the tension it is either the helicity-0 component of the lightest localized massive tensor of mass 0<m2<2H2 for positive tension, the scalar `radion' for negative tension, or their admixture for vanishing tension. Because the ghost is gravitationally coupled to the brane-localized matter, the self-accelerating solutions are not a reliable benchmark for cosmic acceleration driven by gravity modified in the IR. In contrast, the normal branch of solutions is ghost-free, and so these solutions are perturbatively safe at large distance scales. We further find that when the Z2 orbifold symmetry is broken, new tachyonic instabilities, which are much milder than the ghosts, appear on the self-accelerating branch. Finally, using exact gravitational shock waves we analyze what happens if we relax boundary conditions at infinity. We find that non-normalizable bulk modes, if interpreted as 4D phenomena, may open the door to new ghost-like excitations.<\/dc:description><dc:subject>\n        Large extra dimensions<\/dc:subject><dc:subject>\n         Classical theories of gravity.<\/dc:subject><dc:publisher>\n        Institute of Physics<\/dc:publisher><dc:source>\n        Journal of high energy physics, 2006, Vol.2006(10), pp.66 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-10-24<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2036<\/dc:identifier><dc:identifier>\n        issn:1126-6708<\/dc:identifier><dc:identifier>\n        issn: 1029-8479<\/dc:identifier><dc:identifier>\n        doi:10.1088\/1126-6708\/2006\/10\/066<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2036\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1088\/1126-6708\/2006\/10\/066<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2036\/1\/2036.pdf<\/dc:identifier><dc:rights>\n        © SISSA 2006. Published by IOP Publishing for SISSA. This is an author-created, un-copyedited version of an article accepted for publication in Journal of high energy physics. IOP Publishing Ltd is not responsible for any errors or omissions in this version of the manuscript or any version derived from it. The Version of Record is available online at 10.1088\/1126-6708\/2006\/10\/066.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1126-6708","1126-6708"," 1029-8479","issn: 1029-8479"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Large extra dimensions","Classical theories of gravity."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n07 May 2008\nVersion of attached file:\nOther\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nCharmousis, C. and Gregory, R. and Kaloper, N. and Padilla, A. (2006) ’DGP specteroscopy.’, Journal of high\nenergy physics., 10 . p. 66.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1088\/1126-6708\/2006\/10\/066\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 3042 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online 25 April 2008 \n \nCitation for item:  \nCharmousis, C. and Gregory, R. and Kaloper, N. and Padilla, A. (2006) 'DGP \nspecteroscopy.' , Journal of high energy physics., 10, 66. \n \nDefinitive version available at:  \nhttp:\/\/dx.doi.org\/10.1088\/1126-6708\/2006\/10\/066 \nar\nX\niv\n:h\nep\n-th\n\/0\n60\n40\n86\nv2\n  1\n7 \nM\nay\n 2\n00\n6\nPreprint typeset in JHEP style - PAPER VERSION hep-th\/0604086\nDGP Specteroscopy\nChristos Charmousis1, Ruth Gregory2, Nemanja Kaloper3 and Antonio Padilla4\n1 LPT, Universite de Paris-Sud, Bat. 210, 91405 Orsay CEDEX, France\nE-mail: Christos.Charmousis@th.u-psud.fr\n2 Centre for Particle Theory, University of Durham, Durham, DH1 3LE, UK\nE-mail: r.a.w.gregory@durham.ac.uk\n3 Department of Physics, University of California, Davis, CA 95616, USA\nE-mail: kaloper@physics.ucdavis.edu\n4 FFN, Universitat de Barcelona, Diagonalley 647, Barcelona, 08028, Spain\nE-mail: padilla@ffn.ub.es\nAbstract: We systematically explore the spectrum of gravitational perturbations in\ncodimension-1 DGP braneworlds, and find a 4D ghost on the self-accelerating branch\nof solutions. The ghost appears for any value of the brane tension, although depending\non the sign of the tension it is either the helicity-0 component of the lightest local-\nized massive tensor of mass 0 < m2 < 2H2 for positive tension, the scalar ‘radion’\nfor negative tension, or their admixture for vanishing tension. Because the ghost is\ngravitationally coupled to the brane-localized matter, the self-accelerating solutions\nare not a reliable benchmark for cosmic acceleration driven by gravity modified in the\nIR. In contrast, the normal branch of solutions is ghost-free, and so these solutions\nare perturbatively safe at large distance scales. We further find that when the Z2 orb-\nifold symmetry is broken, new tachyonic instabilities, which are much milder than the\nghosts, appear on the self-accelerating branch. Finally, using exact gravitational shock\nwaves we analyze what happens if we relax boundary conditions at infinity. We find\nthat non-normalizable bulk modes, if interpreted as 4D phenomena, may open the door\nto new ghost-like excitations.\nKeywords: braneworlds, modified gravity, ghosts.\nContents\n1. Introduction 1\n2. What are DGP braneworlds? 6\n2.1 Background solutions 8\n2.2 How do we obtain 4D gravity in the DGP model? 10\n3. The occult sector of DGP 13\n3.1 Learning to count: mode expansion 14\n3.2 Fluctuations around the vacuum 18\n3.3 Linearized fields of matter lumps 26\n3.4 Forking the ghost: calculating the effective action 28\n3.5 Perturbations that break Z2 symmetry 32\n4. Shocking 4D nonlocalities 34\n5. Summary 40\n6. Proof of tensor decomposition in Eq. (3.8) 43\n7. Helicity-0 ghosts in de Sitter space 45\n1. Introduction\nEver since Einstein introduced his famous “biggest blunder”, the cosmological constant\nhas been one of the most frustrating, yet intriguing aspects of General Relativity (GR).\nIronically, just as Einstein needed a Λ to make a static universe, if we take his theory\nof GR as the description of gravity at the largest scales, we now seem to need a Λ to\naccount for the cosmic acceleration observed at redshifts z . 1.7 [1, 2, 3]. Unfortunately,\nmanufacturing a sufficiently small, positive cosmological constant from a consistent\ntheory is not entirely straightforward, to say the least. The methods of effective field\ntheory have so far failed to yield a satisfactory microscopic theory of the cosmological\nconstant [4, 5]. Moreover, while the mystery of the cosmological constant is usually\n– 1 –\nposed as a problem for the field theory of matter, one may even wonder if in fact\nit might really be related to our formulation of gravity and inertia. Our hands-on\nexperimental knowledge of gravity conforms with GR at distances between ∼ 0.1 mm\n[6, 7] and, say, ∼ 10 − 100 MPc. At these large scales we enter the domain of dark\nmatter, a necessary component of the standard cosmological model needed to explain\ngalactic rotation curves, which cannot be accounted for with GR and baryonic matter\nalone. At the moment, dark matter still needs to be completely explained by particle\nphysics despite a plethora of reasonable candidates. A popular common theme in recent\nresearch is that perhaps it is not matter that is needed, but a modification of Newton’s\nlaw and\/or gravity at large scales. This idea is not new: ever since galactic rotation\ncurves were found to be inconsistent with the luminous matter, such alternatives have\nbeen pursued [8].\nWhile it is natural to hope that modifying gravity could be an interesting alter-\nnative to dark matter, why might one hope that it could help with the cosmological\nconstant? To illustrate this, we offer the following simple, heuristic argument. It is\nclear that in the Einstein-Hilbert action, the cosmological constant term appears as the\nLegendre transform of the field variable\n√−g =√| det(gµν)|:\nSEH = M\n2\n4\n∫\nd4x\n√−gR− 2√−gΛ+ . . . . (1.1)\nFrom the canonical field theory rules, this means that this term trades the independent\nfield variable\n√| det(gµν)| for another independent variable Λ. This is exactly the same\nas in quantum field theory, where one defines the generating function of the theory\nby shifting the Lagrangian by a ‘coupling’\n∫\nφ(x)J(x). This trades the independent\nvariable φ for another independent variable J . After this transformation, the variable\nJ is not calculable; it is an external parameter that must be fixed by hand at the end of\nthe calculation, by a choice of boundary conditions. Once J is fixed to some value, φ is\ncalculable in terms of it. The only difference between the usual field theory Legendre\ntransform and the cosmological constant term arises because of gauge symmetries of\nGR, which render\n√| det(gµν)| non-propagating. It is a pure gauge variable that can\nalways be set to a constant number by a change of coordinates. Therefore the Legendre\ntransformation (1.1) loses information about only one number, which must be fixed\nexternally: namely, by the value of Λ itself. As a result, in GR the cosmological\nconstant is a boundary condition rather than a calculable quantity. One may then hope\nthat by changing gravitational dynamics one could render\n√| det(gµν)| propagating, so\nthat, in turn, Λ is also rendered dynamical. This could provide us with new avenues\nfor relaxing the value of Λ. Such hopes have been already expressed before on a few\n– 2 –\noccasions [9, 10, 11]. However, analyzing modifications of gravity systematically, to\ncheck if they remain compliant with the tests of GR, hasn’t been easy.\nOn the other hand, in recent years the braneworld paradigm has emerged as a com-\npelling alternative to standard Kaluza-Klein (KK) methods of hiding extra dimensions\nand a new framework for solving the hierarchy problem. In this approach our uni-\nverse is realized as a slice, or submanifold, of a higher dimensional spacetime. Unlike\nin KK compactifications, where the extra dimensions are small and compact, in the\nbraneworld approach they can be relatively large [12, 13], or infinite [14, 15]. We do\nnot directly see them since we are confined to our braneworld, rather, their presence is\nfelt via corrections to Newton’s law. Many of the more fascinating phenomenological\nfeatures of these braneworld scenarios arise in models of warped compactification. In\nwarped compactifications the scale factor of a four-dimensional brane universe actu-\nally varies throughout the extra dimensions, providing us with a new way of making a\nhigher dimensional world appear four-dimensional. In general, one can conceal extra\ndimensions from low energy probes by either 1) making the degrees of freedom which\npropagate through the extra dimensions very massive so as to cut the corrections to\nNewton’s law off at long distances, or 2) suppressing the couplings of the higher di-\nmensional modes to ordinary matter so that the 4D gravitational couplings dominate,\nensuring that the corrections to Newton’s law are very small at long distances. The\nlatter case is naturally realized in warped models, so that even infinite extra dimensions\nmay be hidden to currently available probes.\nBraneworlds provide a natural relativistic framework for exploring means of mod-\nifying gravity. It was quickly realized that by using free negative tension branes, one\ncould alter Newton’s constant at large scales [16]. More dramatically, Gregory, Rubakov\nand Sibiryakov (GRS) [17] noticed that by combining negative tension branes with in-\nfinite extra dimensions, it was possible to “open-up” extra dimensions at very large\nscales, making gravity effectively higher-dimensional very far away. However, it was\nsoon discovered by the authors that this model contained ghosts [18]. This was unfor-\ntunate since the metastable graviton had many desirable gravitational properties, but\nfrom a particle physics point of view the existence of a ghost is disastrous. Soon after, a\nradically new braneworld model was put forward, the DGP (Dvali-Gabadadze-Porrati)\nmodel [19], with graviton kinetic terms on the brane as well as in the bulk. The simpler\nversions of this theory are described by the action\nSDGP = M\n4+n\n5\n∫\n(4 + n)D bulk\n√−gR(g) +M24\n∫\nbrane\n√−γR(γ)\n+ extrinsic curvature terms +\n∫\nbrane\nLmatter . (1.2)\n– 3 –\nIn general, there may be additional terms in the bulk. The key new ingredient here\nis the induced curvature on the brane. It could be generated, as it was claimed ini-\ntially, by quantum corrections from matter loops on the brane [20], or again in a\npurely classical picture of a finite width domain wall1 as corrections to the pure tension\nDirac-Nambu-Goto brane action [22, 23]. Furthermore, it is also intriguing to note\nthat induced curvature terms appear quite generically in junction conditions of higher\ncodimension branes when considering natural generalizations of Einstein gravity [24]\nas well as in string theory compactifications [25]. Using holographic renormalization\ngroup arguments [26], DGP was shown to be equivalent in the infrared to GRS, how-\never, crucially, it appeared to be ghost-free, corroborating the perturbative analysis of\n[27]. This made it seem a real candidate for a new gravitational phenomenology at\nlarge distances. The induced curvature term yields a particularly interesting new phe-\nnomenon. In the case of a brane in 5D Minkowski bulk it allows for a self-accelerating\ncosmological solution [28], for which the vacuum brane is de Sitter space, with constant\nHubble parameter H = 2M35 \/M\n2\n4 , even though the brane tension vanishes.\nClearly, the possibility of a fully consistent explanation of large scale acceleration\nis extremely exciting. It has generated a great deal of activity and investigation into\nthe DGP set-up [29] (for a recent review, see [30]), with an astrophysical emphasis on\nblack hole solutions [31], solar system tests [32], shock wave limits [33], and of course,\nwhether DGP can truly explain dark energy [34]. Although many cosmologists have\nalready embraced the DGP model, it has been found to suffer from various problems.\nThere is the issue of strong coupling [35, 36, 37, 38], related to the feature that the\ngraviton interactions go nonlinear at intermediate scales. More importantly, various\ninvestigations pointed out that there are ghosts on the self-accelerating branch [37, 38,\n39], however this debate still persists.\nOur aim here is to explore this issue in full detail. Since most of the explicit\nwork on DGP has been done for the simplest case of a brane in flat 5D bulk, with\nthe dynamics given by (1.2), we will work in the same environment, and start with\na review of this case. We will next consider the spectrum of small perturbations of\nthe cosmological vacua of DGP, which describe a 4D de Sitter geometry. One of the\nconfusing aspects of the literature on these braneworld perturbations (as opposed to\nbraneworld cosmological perturbations!) is the alternate approaches of direct ‘hands-\non’ calculations, which analyze the curved space wave operator for the gravitational\nperturbation directly [14, 40, 41] and the “effective action” approach, which was used\nto particular effect to confirm the ghost [18] of the GRS model via a radion mode\nanalysis [42]. Naturally these approaches should be entirely equivalent, and we will\n1Harking back to the early manifestations of braneworlds [21].\n– 4 –\nindeed see that. The technical complications in the identification of the spectrum of\nDGP gravity arise from the mixed boundary conditions for perturbations that may\nobscure the computation of the norm.\nThe relevant modes in the spectrum of perturbations for addressing the concerns\nabout stability are the tensors and the scalars. By going to a unitary gauge, we will\nsee that the tensors are generically organized as a gapped continuum of transverse-\ntraceless tensor modes, with 5 polarizations per mass level, and an isolated localized\nnormalizable tensor, which lies below the gap. On the normal branch, this localized\ntensor is massless, implying that it has only two helicity-2 polarizations; on the self-\naccelerating branch it is massive, with 0 < m2 < 2H2 for positive tension, and has\n5 polarizations. When the brane tension is positive, the helicity-0 mode is the ghost,\nprecisely because its mass sits in the region prohibited by unitarity, explored in [43,\n44, 45, 46]. Furthermore, the propagating scalar mode, or the ‘radion’, is tachyonic.\nThis tachyonic instability of scalar perturbations is very generic, and by and large\nbenign (see section 3.2). Moreover, the tachyonic scalar completely decouples on the\nnormal branch in the limiting case where the bulk ends on the horizon2. On the\nself-accelerating branch, the scalar mode remains tachyonic but mostly harmless for\npositive tension branes, but as the tension vanishes it mixes with the helicity-0 tensor,\nand prevents the ghost from decoupling even in the vacuum by breaking the accidental\nsymmetry of the massive tensor theory in de Sitter space in the limitm2 = 2H2, studied\nin partially massless theories [43, 45, 46]. This mode becomes a pure and unadulterated\nghost when the brane tension is negative, because it contains the brane Goldstone mode\nwhich does not decouple in a way similar to the GRS model [17, 18], consistent with the\nclaim of [37]. Thus the self-accelerating solutions always have a ghost, and therefore do\nnot represent a reliable benchmark for an accelerating universe in their present form.\nOn the other hand the normal solutions are ghost-free, and thus may be useful as a\nmodel of gravitational modifications during cosmic acceleration.\nOur calculations further allow us to extend the analysis to perturbations which are\nnot Z2-symmetric around DGP branes. This symmetry can be relaxed for braneworld\nmodels3, and actually this may be a more natural setting for the DGP setup which\nis more closely analogous to finite width defects or quantum corrected walls. In\nfact, in general braneworld models, when the requirement of Z2-symmetry is dropped\none can get a whole range of interesting gravitational phenomenology, including self-\nacceleration, without appealing to induced gravity [48, 49]. We will show here that\n2We remind the reader that the situation here is similar to the single positive tension brane in the\nRS model where the radion also decouples.\n3The Randall-Sundrum model [13, 14] was Z2-symmetric by construction, enabling to interpret it\nas a dual AdS\/CFT with a UV cut-off and coupling to gravity [47].\n– 5 –\nif Z2-antisymmetric modes are allowed, then in addition to the ghost, there is an ex-\ntra excitation which corresponds to the free motion of the DGP brane. This mode is\ntachyonic, and while it decouples on the normal branch in the single brane limit, it\npersists on the self-accelerating branch of DGP solutions. Nevertheless it still remains\ntame, since the scale of instability is controlled by the Hubble parameter, and so the\ninstability may remain very slow.\nThe presence of the ghost in the 4D description of the self-accelerating solutions of\nDGP indicates that the instability originates from the ‘reduction’ of the theory, and may\nnot really represent a fundamental problem of the bulk set-up. A different prescription\nfor boundary conditions might be able to circumvent the contributions from the brane\nlocalized ghost. However this requires rather special boundary conditions very far from\nthe brane mass, that would not normally arise dynamically in a local theory. They\nallow the leakage of energy to, or from, infinity. Worse yet, an explicit exploration of\npotentials of relativistic sources shows that in this case other modes behave like ghosts,\nif interpreted in the 4D language. We can see this directly from the gravitational shock\nwave solutions which include the contributions from the modes that are not localized\non the brane.\nThe paper is organized as follows. In the next section we will review some of the\nsalient features of the DGP model, describing its two branches of background solutions,\nthe normal branch and the self-accelerating branch. In section 3, we will discuss the\nperturbation theory around the 4D cosmological vacua of DGP, and identify its occult\nsector by an explicit calculation. In section 4, using gravitational shock waves, we will\nconsider what happens when we include the contributions from non-normalizable bulk\nmodes to the long range gravitational potential of brane masses. We will summarize in\nsection 5.\n2. What are DGP braneworlds?\nWe will work with the simplest and most explicit incarnation of DGP, where our uni-\nverse is a single 3-brane embedded in a 5 dimensional bulk spacetime. The bulk is\nlocally Minkowski and the brane carries the curvature of the induced metric as well\nas the brane localized matter. The induced curvature terms will generically arise from\nthe finite brane width corrections. The brane may be viewed as a δ-function source\nin the bulk Einstein equations, whose dynamics ensues from the total stress-energy\nconservation that follows from the covariance of the theory. Alternatively the brane\nmay be treated as a common boundary of two distinct regions, M+ and M− in the\nbulkM =M+∪M−, which are on the different sides of the brane Σ = ∂M+ = ∂M−.\nThe boundary conditions at the brane are given by the Israel equations [50], which\n– 6 –\ncorrespond precisely to the brane equations of motion. These two approaches are phys-\nically completely equivalent because the theory is completed with the inclusion of the\nGibbons-Hawking boundary terms [51], which properly covariantize the bulk Einstein-\nHilbert action in the presence of a boundary. As a result, varying with respect to the\nmetric gives the correct boundary equations as well as the correct bulk. The simpler\nδ-function form of the field equations then corresponds to the unitary gauge, realized\nby going to brane Gaussian-normal coordinates, which essentially describe the brane’s\nrest frame in the bulk, and then gauge fixing residual gauge invariance.\nThe dynamics of the model can therefore be derived from the action\nS = M35\n∫\nM\nd5x\n√−gR+2M35\n∫\nΣ\nd4x\n√−γ∆K+\n∫\nΣ\nd4x\n√−γ(M24R−σ+Lmatter) (2.1)\nHere gab is the bulk metric with the corresponding Ricci tensor, Rab (in M = M+ ∪\nM−). The induced metric on the brane is given by γab and its Ricci tensor is Rab, while\nσ is the brane tension. The extrinsic curvature of the brane is given by Kab = −12Lnγab,\nwhere Ln is the Lie derivative of the induced metric with respect to unit normal, na,\noriented fromM− into M+; ∆Kab = K+ab −K−ab is the jump of Kab fromM− toM+,\nand Lmatter is the Lagrangian of brane localized matter fields, with vanishing vacuum\nexpectation value, because the brane vacuum energy was explicitly extracted as tension.\nIn what follows we will use different gauges for the bulk geometry, because the brane\nGaussian-Normal gauge is very convenient for counting up the modes in the spectrum\nof the theory, while other gauges may be easier to compute the effective actions for\nparticular modes. Thus, thinking of the solutions geometrically as a bulk in which the\nbrane moves, we will write the field equations which follow from (2.1) as separate bulk\nand brane equations of motion respectively. These are valid in an arbitrary gauge, and\nmay be thought of as a breakdown of the full set of field equations on a space with a\nboundary, where the boundary conditions describe a codimension-1 brane. The bulk\nequations of motion are simply the vacuum Einstein equations,\nGab = Rab − 1\n2\nRgab = 0 , (2.2)\nwhereas the brane equations of motion are given by the Israel junction conditions [50],\nΘab = M\n3\n5∆ [Kab −Kγab] +M24 (Rab −\n1\n2\nRγab) + σ\n2\nγab =\n1\n2\nTab . (2.3)\nwhere\nTab = − 2√−γ\n∂(\n√−γLmatter)\n∂γab\n, (2.4)\nexplicitly does not include the brane energy-momentum, σγab.\n– 7 –\nIn most of what follows we will impose Z2 orbifold symmetry about the brane\n(section 3.5 will deal with general perturbations). In other words, we will identifyM+\nand M−, restricting the dynamics to the Z2 symmetric action given by\nS = 2M35\n∫\nM\nd5x\n√−gR+4M35\n∫\nΣ\nd4x\n√−γK+\n∫\nΣ\nd4x\n√−γ(M24R−σ+Lmatter) (2.5)\nwhere Kab = K\n+\nab = −K−ab. The bulk equations of motion (2.2) are of course unchanged,\nwhile the brane equations of motion simplify to\nΘab = 2M\n3\n5 [Kab −Kγab] +M24 (Rab −\n1\n2\nRγab) + σ\n2\nγab =\n1\n2\nTab . (2.6)\n2.1 Background solutions\nCosmological DGP vacua describe tensional branes in 5D locally Minkowski patches\nglued together such that the jump in extrinsic curvature matches the tension and\nthe intrinsic Ricci curvature contributions as in Eq. (2.6). The solutions can be easily\nconstructed by taking a bulk geometry which solves the sourceless bulk equations (2.2),\nand slicing it along a trajectory (t(τ), R(τ)) which solves (2.3). Then R becomes the\ncosmological scale factor and τ the comoving time coordinate. Such techniques have\nbeen used before in the RS2 framework [52, 53]. When the brane only carries nonzero\ntension, its worldvolume is precisely a 4D de Sitter hyperboloid representing the 4D\nde Sitter embedding in a 5D Minkowski space as required by the symmetries of the\nproblem [54]. This solution generalizes the geometry of Vilenkin-Ipser-Sikivie inflating\ndomain walls in 4D [55], and was in fact also found in [56] in the context of finite\nthickness domain walls.\nIn conformal coordinates xa = (xµ, y), the full background metric is given by\nds2 = g¯abdx\nadxb = a2(y)\n(\ndy2 + γ¯µνdx\nµdxν\n)\n, (2.7)\nwhere\nγ¯µνdx\nµdxν = −dt2 + e2Ht d~x2 . (2.8)\nand\na(y) = exp(ǫHy), ǫ = ±1. (2.9)\nThe bulk spacetime,M, is the image of the line 0 < y <∞, with the brane positioned\nat y = 0. In DGP brane induced gravity theory there exist two distinct branches of\nbulk solutions, labelled by ǫ = ±1. The solution with ǫ = −1 is commonly referred\nto as the normal branch whereas the solution with ǫ = +1 is referred to as the self-\naccelerating branch, a terminology which will become transparent shortly. The brane\nmetric in (2.8) represents the 4D de Sitter geometry in spatially flat coordinates, which\n– 8 –\ncover only one half of the 4D de Sitter hyperboloid. The complete cover with global\ncoordinates involves the metric ds2 = −dτ 2 + 1\nH2\ncosh2(Hτ)dΩ3 describing a sequence\nof spatial spheres S3, of radius 1\nH\ncosh(Ht) and spatial line element dΩ3, which initially\nshrink from infinite radius to radius 1\/H , and then re-expand back to infinity.\nFigure 1: Embedding of a de Sitter brane in a flat 5D bulk. The brane world volume is\nthe hyperboloid in the Minkowski bulk. The normal branch (ǫ = −1) corresponds to keeping\nthe interior of the hyperboloid, and its mirror image around the brane. In contrast, for the\nself-accelerating branch (ǫ = +1), we keep the exterior, and its reflection. The latter scenario\nincludes the inflating tensionless brane solution.\nThe intrinsic curvatureH is given by the tension, as dictated by the brane equations\nof motion (a.k.a. brane junction equations) (2.3) at y = 0,\n3M24H\n2 − 6ǫM35H =\nσ\n2\n. (2.10)\nThe solutions are\nH =\nǫM35\nM24\n[\n1±\n√\n1 +\nM24σ\n6M65\n]\n. (2.11)\nThis equation suggests that there are in fact four possible values of the intrinsic curva-\nture. However this is not the case. It is easy to see that only two of these solutions are\n– 9 –\nindependent. Indeed, note that a bulk reflection z → −z and a time reversal t → −t\nmap two of the solutions (2.7,2.8) with H < 0 onto the solutions with H > 0 simulta-\nneously reversing the sign of ǫ. Thus without any loss of generality we fix the signs by\nrequiring that a positive tension corresponds to positive intrinsic curvature H , so that\nH =\nM35\nM24\n[\nǫ+\n√\n1 +\nM24σ\n6M65\n]\n. (2.12)\nWe can embed these solutions in the bulk as in figure 1 [33]. For ǫ = 1, or “self-\naccelerating” branch, we retain the exterior of the hyperboloid. For ǫ = −1, or the\n“normal branch”, we keep the interior of the hyperboloid. It is now clear whence the\nterminology: on the self-accelerating branch, even when the tension vanishes, σ =\n0, the geometry describes an accelerating universe, with a non-vanishing curvature\n(H = 2M35 \/M\n2\n4 ) produced solely by the modification of gravity. The scale of the\ncurvature needs to be specially tuned to the present horizon scale of ∼ 10−33 eV, which\ncorresponds to about M5 ∼ 40 MeV [28, 29], but once this is done one may hope\nto explain the current bout of cosmic acceleration even without any Standard Model\nvacuum energy. The self-accelerating branch of solutions are a distinct new feature of\nthe DGP model, they do not exist on Z2-symmetric brane without the induced gravity\nterms on the brane [54, 28]. However, related solutions may arise in theories with\nasymmetric bulk truncations [48, 49].\n2.2 How do we obtain 4D gravity in the DGP model?\nA crucial question is: given the cosmological DGP vacua reviewed above, how could\nthere be a low energy 4D gravitational force between masses inhabiting them? Unlike in\nRS2, for solutions given by (2.8) and (2.10), the ‘apparent’ warping of the bulk cannot\nplay a significant role in manufacturing 4D gravity at large distances. In RS2 bulk\ngravitational effects pull the KK gravitons away from the brane, strongly suppressing\ntheir couplings to brane localized matter. As a result, the extra dimension is hidden.\nThat does not happen here because the bulk in (2.8) is locally flat. Moreover, on\nthe self-accelerating backgrounds the bulk volume is infinite, and so the 4D graviton\nzero mode is decoupled: it is not perturbatively normalizable, and the mass scale\nwhich governs its coupling diverges. Although the bulk volume for the normal branch\nsolutions is finite for finite 1\/H , and there is a normalizable graviton mode, its coupling4\nis g0 ∝ H\/M35 , and so it also decouples in the limit H → 0 [33]. In fact, from the general\nembedding of a 4D de Sitter hyperboloid in 5D Minkowski space (2.8) we see that the\n4This formula is precisely the analogue of the Gauss law relation between bulk and effective 4D\nNewton’s constant in models with large extra dimensions [12].\n– 10 –\nH → 0 limit corresponds to taking the radius of extrinsic curvature of the hyperboloid\non the normal branch to infinity, de facto pushing it to the spatial infinity of Minkowski\nspace. In this limit the bulk volume between the brane and the horizon diverges, which\nis why the zero mode graviton decouples. This agrees with the perturbative analysis of\nthe H = 0 case of [19, 27] where the zero mode graviton was completely absent. Hence\n4D gravity ought to emerge from the exchange of bulk graviton modes.\nSuppose first that the graviton kinetic terms reside only in the bulk. In an infinite\nbulk, a typical bulk graviton sourced by a mass on the brane will not venture too far\nfrom the brane because it would cost it too much energy. Nonetheless if kinetic terms\nreside only in the bulk, a typical bulk graviton would still peel away from the brane\nand explore the region of the bulk around the brane out to distances comparable to\nthe distance r between the source and a probe on the brane. The momentum transfer\nby each such virtual graviton to the brane probe would be ∼ 1\/p, where p is the 4D\nmomentum along the brane, as dictated by the 5D graviton propagator and brane\ncouplings. Thus the gravitational potential would scale as 1\/r2, and the resulting\nforce as 1\/r3. Such force-distance dependence would reveal the presence of the extra\ndimension. This would remain true even when H 6= 0 on the normal branch. Although\na zero mode is present in this case, it cannot conceal the extra dimension because it\nwould still be too weakly coupled to provide the dominant contribution to the long\nrange force at sub-horizon scales.\nThe induced curvature terms on the brane change this in DGP. In order for this\ntrick to work, one needs M4 to be big. In this case, the brane localized kinetic terms\neffectively pull the zero mode gravitons closer to the brane, making their exploration\nof the bulk at distances shorter than rc ∼ M24 \/2M35 energetically costly [19, 27]. This\nalters the scaling of the momentum transfer to 1\/p2 for momenta p > M35 \/M\n2\n4 , which\nin turn produces a force which scales as 1\/r2. This is manifest from the explicit form\nof the graviton propagator projected on to the Minkowski brane (i.e. the H = 0 limit\nof the normal branch solutions of (2.8) and (2.10)) [19, 27]:\nG(p)|z=0 = 1\nM24 p\n2 + 2M35 p\n(1\n2\nηµαηνβ +\n1\n2\nηµβηνα − 1\n3\nηµνηαβ\n)\n. (2.13)\nFrom the 4D point of view, the graviton resonance which is exchanged is composed of\nmassive tensor modes, and so it will contain admixtures of longitudinal gravitons. This\nis encoded in the propagator (2.13) in the coefficient 1\/3 of the last term of the spin\nprojector, as opposed to 1\/2 which appears in the linearized limit of standard 4D GR.\nThis difference is an example of the venerated Iwasaki-van Dam-Veltman-Zakharov\n(IvDVZ) discontinuity of modified gravity [57], and signifies the persistence of a scalar\ncomponent of gravity in the theory, that could conflict with the known tests of GR.\n– 11 –\nHowever, it has been argued for massive gravity [58] and similarly for the DGP model\n[59] that the extra scalar may be tamed by nonlinearities once the correct background\nfield of the source is included. The idea is that the perturbative treatment of the scalar\ngraviton breaks down at a distance scale rV first elucidated by Vainshtein [58]. For\nDGP, for a source of mass m, this new scale is given by rV ∼ (mr2c\/M24 )1\/3 [60, 61].\nBelow that distance, one can’t trust linearized perturbation theory and must re-sum the\nbackground corrections, which should presumably decouple the scalar graviton mode.\nSimilar weakening of the scalar graviton coupling may occur at cosmological scales if\nthe universe is curved.\nThis scale dependence of the scalar graviton couplings has very interesting and im-\nportant implications for the DGP setup. It has been pointed out [35, 36, 37, 38] that the\neffective field theory description of DGP gravity will suffer from a loss of predictivity\ndue to the problems with strong couplings at distances rstrong ∼ (r2c\/M4)1\/3, which could\nbe much larger than the naive UV cutoff. The most recent analysis of this issue [38]\nhowever suggests that the brane nonlinearities may push the scale of strong coupling\ndown, to about r˜strong ∼ rstrong\/\n√\nMearth\/M4 ∼ 1cm on the surface of the Earth, pos-\nsibly making DGP marginally consistent with current table top experimental bounds\n[6, 7]. In what follows we will assume this claim [38] and imagine that we work in the\nperturbative regime of DGP, although we feel that this issue deserves further atten-\ntion. We note that the exploration of DGP with gravitational shock waves [33] shows\nthat the scalar graviton decouples from the background of relativistic sources, indicat-\ning that the coupling is effectively suppressed by the ratio of\n√\n(T µµ)2\/T µνTµν of the\nsource. Note, that this is not enough to ascertain that a theory is phenomenologically\nsafe. For example, a Brans-Dicke theory will admit identical shock waves as ordinary\nGR for any value of the Brans-Dicke parameter ω, while the observations require that\nω ≥ 5000. Thus one still needs to study the model for slowly moving sources to check\nif the predictions agree with observations. However one may hope that the strong cou-\npling problems might be resolved in a satisfactory fashion. After all, the shock waves\n[33] remain valid down to arbitrarily short distances from the source, behaving much\nbetter than they are entitled to given the concern about the strong coupling problems.\nIn what follows we will focus on uncovering the ghosts (and\/or other instabilities)\non the self-accelerating branch, and a discussion of their implications for DGP. Before\nwe turn to this, we should stress that there is no technical inconsistency between our\nresults and the earlier claims that there are ghost-free regimes in DGP [19, 27]. Indeed:\nstarting with the backgrounds of the family (2.8,2.10) and fixing M5 and M4, the only\nway to consistently take the limit to H → 0 is to pick the normal branch solutions\nand dial the brane tension σ to zero. In this way one reproduces the H = 0 brane\nbackgrounds with fixed M5, M4 that were studied in [19, 27]. Moreover, ghosts may\n– 12 –\nalso be absent if the brane geometry is anti de Sitter, as opposed to dS [62]. Thus\nthe results of the perturbative analysis of [19, 27], implying the absence of ghosts and\nother instabilities on H = 0 branes, applies only to the normal branch backgrounds\nof DGP (2.8), (2.10). In fact, our results will confirm this for the general H 6= 0\nbackgrounds of the normal branch, showing that they are ghost-free. However the\nanalysis of [19, 27] has nothing to say about the self-accelerating branch solutions, and\nspecifically about the σ = 0 limit, that describes a universe where cosmic acceleration\narises from modification of gravity alone. In what follows we will confirm that in all\nthose cases there are ghosts, which invalidate the self-accelerating branch solutions in\ntheir present form as realistic cosmological vacua.\n3. The occult sector of DGP\nWe now turn to the exploration of the spectrum of light modes in the gravitational\nsector of DGP, around the cosmological vacua (2.8), (2.10). We will confirm that there\nare ghosts in the 4D effective field theory description on the self-accelerating branch\nof DGP solutions. More specifically: in the 4D effective field theory which describes\nthe perturbative regime of self-accelerating branch of DGP backgrounds (2.8), (2.10)\nbetween the Vainshtein scale rV and the scale of modification of gravity rc = m\n2\npl\/2M\n3\n5\nthere are scalar fields with negative, or vanishing, kinetic term around the vacuum,\nwhich couple to the brane-localized matter with at least gravitational strength. Now,\nthis may appear surprising at the first glance: there are no ghosts in the action (2.1)\nof the full 5D bulk theory. Indeed, the full bulk Lagrangian in (2.1) does not appear\nto contain any instabilities. However, the background solutions (2.8), (2.10) of (2.1)\ninvolve an end-of-the-world brane, which is a dynamical object, whose world-volume is\ndetermined by (2.3). The problems arise because the brane will curl up and wiggle when\nburdened with a localized mass, in a way that alters the gravitational fields of the source\nmass, spoiling the 4D guise of the theory. Thus the perturbative ghost encountered\nin 4D theory is really a diagnostic of the failure of the 4D perturbation theory to\ndescribe the dynamics of the long range gravity on the self-accelerating solutions. Thus\nalthough the applications [28, 29, 63] of the self-accelerating solutions to 4D cosmology\nare interesting and tempting, the presence of the ghost renders them unreliable at the\npresent stage of understanding of the theory, and hence de facto inadequate as a method\nof accommodating the present stage of cosmic acceleration.\nIn the following subsections we will identify the independent degrees of freedom\ndescribing small perturbations around DGP vacua in both branches, derive their lin-\nearized equations of motion and solve them. We will then compute the four dimensional\neffective action, isolate the ghost of the 4D theory, and discuss its consequences.\n– 13 –\nThe physical interpretation of these solutions is based on the mathematical analysis\nof a differential operator derived by considering perturbations of Einstein’s equations:\nthe Lichnerowicz operator ∆Lhab. This operator acts on a five-dimensional spacetime\nwith a timelike boundary (the brane). We can solve these perturbation equations in\nwhatever gauge we like, however, in order to get a braneworld interpretation of the\nresults, the cleanest procedure we can follow is to separate this problem (operator\nplus space on which it acts) into a direct sum of a purely four-dimensional operator\nacting on a four-dimensional spacetime, and a self-adjoint ordinary differential operator\nacting on the semi-infinite real line. Obviously this latter operator acts on the space\nperpendicular to the brane, and hence to really benefit from this factorization, in these\ncoordinates the brane should be held at a fixed coordinate position. Once we have\nmade this decomposition, we will be able to identify the physical states and their norms\nfrom the braneworld point of view. To this end, we should write the perturbation in its\nirreducible components with respect to the braneworld, correctly identify the degrees of\nfreedom corresponding to “motion” of the brane, and reduce our perturbation equations\nto a self-adjoint form.\n3.1 Learning to count: mode expansion\nWe turn to the linearized perturbations hab(x, y) about the background metric (2.7),\n(2.8), (2.10), defined by the general formula\nds2 = a2(y)\n(\nγˆab + a(y)\n−3\/2hab(x, y)\n)\ndxadxb , (3.1)\nwhere we use the shorthand γˆabdx\nadxb = dy2+ γ¯µνdx\nµdxν . Note that a(y) = exp(ǫHy)\nas specified in (2.7), (2.8), (2.10). From now on, we will raise and lower 4D indices\n(µ, ν, . . .) with respect to the 4D de Sitter metric γ¯µν , and designate 4D de Sitter\ncovariant derivatives by Dµ. Our normalization convention for the perturbations in\n(3.1) reflects after-the-fact wisdom, in that it simplifies the bulk mode equations to a\nSchro¨dinger form, as we will see later on.\nSince the spacetime ends on the brane, if we fix the gauge in the unperturbed\nsolution (2.7), (2.8), (2.10) such that the brane resides at y = 0, a general perturbation\nof the system will also allow the brane itself to flutter, moving to\ny = F (xµ) . (3.2)\nThe explicit expressions for the perturbations hab, F are obviously gauge-dependent.\nNow, to consider their transformation properties under diffeomorphisms\ny → y′ = y + ζ(x, y) ,\nxµ → x′µ = xµ + χµ(x, y) , (3.3)\n– 14 –\nwe should first classify them according to different representations of the 4D diffeomor-\nphism group as\nperturbations =\n\n\nhµν , a tower of 4D tensors ;\nhyµ , a tower of 4D vectors ;\nhyy , a tower of 4D scalars ;\nF , a single 4D scalar.\n(3.4)\ncomprising in total 10 tensor + 4 vector + 1 scalar towers = 15 towers of degrees of\nfreedom plus one more 4D scalar, i.e. precisely the number of independent fluctuations\nof a symmetric 5×5 bulk metric and the brane location. Clearly, not all of these degrees\nof freedom are physical: some can be undone by diffeomorphisms (3.3). Indeed, we can\neasily derive the explicit infinitesimal transformation rules,\nh′µν = hµν − a3\/2\n(\nDµχν +Dνχµ + 2ǫHζγ¯µν\n)\n,\nh′yµ = hyµ − a3\/2\n(\nDµζ + ∂yχµ\n)\n,\nh′yy = hyy − 2a3\/2\n(\n∂yζ + ǫHζ\n)\n,\nF ′ = F + ζy=0 , (3.5)\nwhere we have used that ∂ya = ǫH a.\nIn order to have a clear braneworld interpretation of variables, we find it convenient\nto work in the Gaussian-normal (GN) gauge (see e.g. [64]), in which any orthogonal\ncomponent of the metric perturbation vanishes. Given any perturbation (3.4), we can\ntransform to a GN gauge by picking the gauge parameters ζ, χµ\nζ =\n1\n2a\n∫ y\n0\ndya−1\/2hyy ,\nχµ =\n∫\ndy a−3\/2hyµ −Dµ\n∫\ndy ζ , (3.6)\nwhich set h′yν and h\n′\nyy to zero. This still leaves us with 10 components of hµν and the\nbrane location F (omitting the primes), accompanied by 5 residual gauge transforma-\ntions\nζ =\nf(x)\na\n,\nχµ = χµ0(x) +\n1\nǫHa\nDµf(x) , (3.7)\nwhich can remove several more mass multiplets from the perturbations. However these\ncould only be zero modes of some of the bulk fields, because of the restricted nature\n– 15 –\nof the bulk variation of (3.7). Rather than completely gauge fix the perturbations\nnow, it is more useful to resort to dynamics to find out which of the modes hµν , F\nare propagating and which are merely Lagrange multipliers. To this end we can first\ndecompose the tensor hµν in terms of irreducible representations of the diffeomorphism\ngroup. This yields (for a proof, see Appendix (6))\nhµν = h\nTT\nµν +DµAν +DνAµ +DµDνφ−\n1\n4\nγ¯µνD\n2φ+\nh\n4\nγ¯µν , (3.8)\nwhere hTTµν is a transverse traceless tensor, Dµh\nTT µ\nν = h\nTT µ\nµ = 0, with 5 components,\nAµ is a Lorentz-gauge vector, DµA\nµ = 0, with 3 components, and φ and h = hµµ are\ntwo scalar fields (such that they correctly add up to the total of 10 degrees of freedom).\nTo get some feel of the dynamics before looking directly at the field equations,\nwe can check how these modes transform under the residual gauge transformations\n(3.7). Substituting the residual gauge transformation (3.7) into (3.5), we find that\nthe surviving, symmetric, tensor mode in the GN gauge and the brane location field\ntransform as\nh′µν = hµν − a3\/2\n(\nDµχ0 ν +Dνχ0µ\n)\n− 2a\n1\/2\nǫH\nOµνf ,\nF ′ = F + f , (3.9)\nwhere Oµν = DµDν + H2γ¯µν , and we have used that a(0) = 1. If we further split up\nthe gauge transformation parameter χ0 µ = Eµ + 12Dµω, where DµEµ = 0, and apply\nthe decomposition (3.4) of hµν into the irreducible representations h\nTT\nµν , Aµ, φ and h to\n(3.9), after a straightforward computation we find that the irreducible representations\ntransform according to\nh′TTµν = h\nTT\nµν ,\nA′µ = Aµ − a3\/2Eµ ,\nφ′ = φ− a3\/2ω − 2a\n1\/2\nǫH\nf ,\nh′ = h− a3\/2D2ω − 2a\n1\/2\nǫH\nD2f − 8ǫHa1\/2f ,\nF ′ = F + f . (3.10)\nNote that while the decomposition (3.8) of a general hµν into irreducible represen-\ntations of the diffeomorphism group is kinematically unique, implying the breakdown\nof the residual gauge transformations as in (3.10), it does not - in general - guarantee\nthat different modes won’t mix dynamically. Indeed, in writing (3.8) we are implicitly\n– 16 –\nassuming that different irreducible transformations live on different mass shells, and\nhence cannot mix dynamically at the quadratic level. This can be glimpsed at, for\nexample, by noting that while the symmetries of the problem allow us to write the\ncouplings like hTTµν(g1D\nµDν + g2γ¯\nµν)φ etc, the TT conditions for hTTµν would imply that\nsuch couplings are pure boundary terms for non-singular couplings g1, g2. While this is\ntrue in general, the situation is considerably subtler when the representations become\ndegenerate. In this instance the decomposition (3.8) requires more care. New acciden-\ntal symmetries mixing different representations, notably tensor and scalar, may arise,\nmodifying (3.10) and dynamically mixing the modes. This occurs in the vanishing\nbrane tension limit on the self-accelerating branch of DGP. We will revisit this limit in\nmore detail later on.\nKeeping with the general situation for now, the transverse-traceless tensor hTTµν is\ngauge invariant, while the vector and the scalars are gauge dependent – we can gauge\naway the zero mode of the vector and one of the scalars. In addition, we see how\nthe motion of the brane can be gauged away, choosing f = −F to set the location of\nthe brane to y = 0. By doing this, we are explicitly choosing coordinates which are\nbrane-based, and the metric perturbation (3.8) has an explicit OµνF term describing\nthe brane fluctuation. In the brane-based approach, we have completely and rigorously\nseparated the Lichnerowicz operator into brane parallel and transverse parts. However:\nonce we have taken these coordinates, we do not have the liberty of making residual\ngauge transformations parameterized by f in (3.10), because they would move the\nbrane from the coordinate origin. In effect, the brane is tied to the dynamical fields φ\nand h in the bulk, but its fluctuation F turns into a Goldstone boson of the system.\nWe emphasize that this is a gauge choice. We are choosing the brane-GN gauge to\nmake the separation of the Lichnerowicz operator mathematically clean. However, one\ncan also choose to allow the brane to fluctuate freely (and indeed the effective action\ncomputation is better done this way) by having a bulk-GN gauge, with the f -gauge\nfreedom in (3.10), and the brane sitting at y = F . In this case, there are no fixed\nterms in the perturbation, and the brane motion enters into the boundary condition\nvia evaluation of the background solution at y = F . The actual equations of motion\nand boundary terms in both gauges are identical, giving the same physical results and\nthe same dynamical scalar fields. Thus, explicitly in brane-GN gauge:\nhµν = h\nTT\nµν +DµAν +DνAµ +\n(Oµν − 14Oλλγ¯µν)φ+ 2a1\/2ǫH OµνF + 14hγ¯µν . (3.11)\nTo proceed with setting up the problem, we derive the field equations for the ir-\nreducible modes. Having restricted to the family of brane-GN gauge perturbations\n(3.11), we can substitute them in the field equations (2.2), (2.3) and after straightfor-\n– 17 –\nward algebra write the linearized field equations in the bulk,\nδGab = 0 , (3.12)\nwhere\na3\/2δGµν = Xµν(h)− 12\n[\n∂2\n∂y2\n− 9H2\n4\n]\n(hµν − hγ¯µν) , (3.13)\na3\/2δGµy =\n1\n2\n[\n∂\n∂y\n− 3ǫH\n2\n]\nDν (hµν − hγ¯µν) , (3.14)\na3\/2δGyy =\n3ǫH\n2\n[\n∂\n∂y\n− 3ǫH\n2\n]\nh− 1\n2\n[\nDµDν − γ¯µν(D2 + 3H2)]hµν , (3.15)\nand\nXµν(h) = −1\n2\n(\nD2 − 2H2)hµν +D(µDαhν)α − 12DµDνh\n− 1\n2\nγ¯µν\n[\nDαDβhαβ − (D2 +H2) h\n]\n, (3.16)\nand on the brane,\nδΘµν =\n{\nM24Xµν(h)−M35\n[\n∂\n∂y\n− 3ǫH\n2\n]\n(hµν − hγ¯µν)\n}\ny=0\n= 1\n2\nTµν . (3.17)\nBefore we proceed with the details of the mode decomposition of this system by direct\nsubstitution of (3.8), we note that the Lorentz-gauge vector Aµ turns out to be a free\nfield in the linearized theory in flat bulk. Thus the solutions for Aµ decouple from\nthe brane-localized matter in the leading order. They are irrelevant for the stability\nanalysis which is our purpose here. Hence we will set Aµ = 0 from now on, assuming we\nhave arranged for bulk boundary conditions which guarantee this in the linear order.\n3.2 Fluctuations around the vacuum\nFirst note that independently of matter on the brane, the yy and yµ equations must\nbe identically satisfied. In conjunction with the trace of the µν equation, this can be\nseen to imply that a gauge can be chosen in which h = 0, and Oλλφ = 0. If in addition\nwe have no matter on the brane, then we see that\nOλλF = (D2 + 4H2)F = 0 , (3.18)\nand so the metric perturbation (3.11) is completely transverse and traceless.\nThe remaining µν bulk equations then simplify considerably to give[\nD2 − 2H2 + ∂\n2\n∂y2\n− 9H\n2\n4\n]\nhµν(x, y) = 0 . (3.19)\n– 18 –\nwith the boundary condition[\nM24\n(\nD2 − 2H2)hµν + 2M35\n(\n∂\n∂y\n− 3ǫH\n2\n)\nhµν\n]\ny=0\n= 0 (3.20)\nNow, to solve this equation we should carefully decompose the tensor into orthog-\nonal modes, which in general do not mix at the linearized level. Those are exactly the\nirreducible representations we discussed previously. Thus using linear superposition, we\ncan expand the general metric fluctuation in hTTµν and φ, the latter of which couples to\nthe field F through the boundary condition (3.20), leaving the TT-tensors with entirely\nhomogeneous boundary conditions. We therefore write\nhµν =\n∑\nm\num(y)χ\n(m)\nµν (x) + h\n(φ)\nµν +\n2a1\/2\nǫH\nOµνF (3.21)\nwhere we have performed the mode expansion hTTµν(x, y) =\n∑\nm um(y)χ\n(m)\nµν (x), in terms\nof the 4D modes χ\n(m)\nµν (x) which satisfy (D2 − 2H2)χ(m)µν = m2χ(m)µν . We have also\ndefined the scalar mode h\n(φ)\nµν = Oµνφ, and separated variables in the scalar field by\nsetting φ =W (y)φˆ(x), where φˆ is a general 4D tachyonic field obeying\n(D2 + 4H2)φˆ = 0 . (3.22)\nThis tachyonic mode is present whenever we compactify the theory on an interval\nwith de Sitter boundary branes. It can be traced back to the repulsive nature of\ninflating domain walls [55]. Here, it is simply an indication that a multi-de Sitter\nbrane configuration requires a special stabilizing potential, as is familiar already in the\ncontext of RS2 braneworld models [65, 66, 67]. This kind of an instability is generically\nmuch slower and hence less dangerous than the ghost, as it is governed by the scale τ ∼\n1\/mtachyon ∼ H−1 that is as long as the age of the universe. When tension is positive,\nthis mode therefore remains largely harmless for the phenomenological applications of\nthe theory. However, on the self-accelerating branch it mixes with the ghost in the\nvanishing tension limit on the self-accelerating branch, and becomes the ghost itself for\nnegative tension, as we will see later.\nWe now turn to the analysis of the TT perturbations which form the main part of the\npropagator, and determine the norm on the transverse y-space. The bulk field equation\n(3.19) and the boundary condition (3.20) reduce to the boundary value problem\nu′′m(y) +\n(\nm2 − 9H\n2\n4\n)\num(y) = 0 ,\nM35\n[\nu′m(0)−\n3ǫH\n2\num(0)\n]\n+ 1\n2\nm2M24um(0) = 0 , (3.23)\n– 19 –\nwhich is self-adjoint with respect to the inner product\n〈u|v〉 =\n∫ ∞\n−∞\ndy\n(\nM35+M\n2\n4 δ(y)\n)\nu(y)v(y) = 2M35\n∫ ∞\n0\ndy u(y)v(y)+M24u(0)v(0) . (3.24)\nThe eigenmodes um with different eigenvalues m are orthogonal. We choose the normal-\nization such that the discrete modes, if any, satisfy 〈um|un〉 = δmn, while the continuum\nmodes satisfy 〈um|un〉 = δ(m− n). This is simply a reflection of the fact that far from\nthe brane the bulk modes behave just like bulk plane waves, and the 4D mass is pre-\ncisely the py-component of the 5D momentum.\nTo determine the spectrum of the boundary value problem (3.23), (3.24) we rewrite\nthe boundary value problem (3.23) as a Schro¨dinger equation\nu′′m +\n[\nm2 − 9H\n2\n4\n+ (\nM24\nM35\nm2 − 3ǫH)δ(y)\n]\num = 0 . (3.25)\nIt is now clear that the solutions of (3.23) must fall into two categories: (i) one dis-\ncrete mode for each branch, localized to the δ-function potential, if it is normalizable\naccording to (3.24), and (ii) a continuum of ‘free’ modes, gapped by m ≥ 3\n2\nH .\n• m2 < 9H2\n4\n: the normalizable solution of (3.23) in the bulk, representing a single,\nlight, localized graviton on each branch, with a mass\nm2d =\nM35\nM24\n[\n3H − 2M\n3\n5\nM24\n]\n(1 + ǫ) , (3.26)\nfixed by the boundary conditions (3.23), and wave function\num(y) = αm exp(−λmy) , αm = 1\nM4\n[\n3M24H − 2M35 (1 + ǫ)\n3M24H − 2M35 ǫ\n]1\n2\n. (3.27)\nwhere λm =\n√\n9H2\n4\n−m2 and 〈u|u〉 = 1. On the normal branch (ǫ = −1),\nmd = 0 . (3.28)\nOn the self accelerating branch (ǫ = +1),\n0 < m2d < 2H\n2 , for σ > 0 ;\nm2d > 2H\n2 , for σ < 0 . (3.29)\nHerein is our first glimpse of the tensor ghost: for positive tension, the localized\nlight graviton mode on the self accelerating branch lies in the forbidden mass\nrange 0 < m2 < 2H2 discussed in [44, 45, 46]. Its helicity-0 component is the\nghost, as we will review later on (see Appendix (7)).\n– 20 –\n• m2 ≥ 9H2\n4\n: the δ-function normalizable modes are\num(y) = αm sin(ωmy + δm) , αm =\n√\nm\nπM35ωm\n, (3.30)\nwhere ωm =\n√\nm2 − 9H2\n4\nand 〈um|um¯〉 = δ(m− m¯). The integration constant δm\nwhich solves the boundary condition (3.23) is\ntan δm =\n2M35ωm\n3M35 ǫH −m2M24\n(3.31)\nTurning now to the scalar component h\n(φ)\nµν (x, y) = W (y)Oµνφˆ(x), it is not difficult\nto see that it obeys (\nD2 − 2H2) h(φ)µν = 2H2h(φ)µν , (3.32)\n(equivalent to a 4D mass m2 = 2H2). The bulk equation (3.19) then yields the wave\nequation for W ,\nW ′′(y)− H\n2\n4\nW (y) = 0 . (3.33)\nThe boundary condition (3.20) enforces a relation between φˆ and F :(\nW ′(0)−\n(3\n2\nǫH − M\n2\n4H\n2\nM35\n)\nW (0)\n)\nφˆ = 2\n(\n1− ǫHM\n2\n4\nM35\n)\nF . (3.34)\nThe wave function solutions for either of the DGP branches are\nW (y) = α exp\n(\n−H\n2\ny\n)\n+ β exp\n(\nH\n2\ny\n)\n. (3.35)\nFrom (3.24), the norm is determined by\n∫∞\n0\ndyW 2(y), where the lower limit of inte-\ngration accounts for the unperturbed location of the brane at y = 0, around which we\nimpose the Z2 symmetry. Thus the α-mode is normalizable but the β-mode is not.\nWe therefore set β = 0. This choice, at least in principle, corresponds to prescribing\nboundary conditions at infinity, which ensure the brane is an isolated system. Thus\nsetting β = 0, and separating the variables by setting φˆ = F in (3.34) we find\n−\n((1 + 3ǫ)H\n2\n− M\n2\n4H\n2\nM35\n)\nα = 2\n(\n1− M\n2\n4 ǫH\nM35\n)\n. (3.36)\nHowever, we must be mindful of this choice because of the possible interplay with the\nbrane bending term (3.10), as we will see next.\nNow: on the normal branch (ǫ = −1), it follows from (3.10) that the normalizable\nα-mode is gauge-dependent: in fact, it is of the same form as the brane-bending mode\n– 21 –\nsince it is proportional to a1\/2 = exp\n(−H\n2\ny\n)\n. On the other hand the non-normalizable\nβ-mode is gauge-invariant by itself, and so setting it equal to zero is straightforward.\nThen (3.36) gives α = 2\/H , which means that the brane boundary condition (3.20) in\nfact precisely sets the normalizable gauge-invariant mode αφˆ− 2F\/H to zero. Hence\nhµν ≡ hTTµν (3.37)\nThus the net effect of the α-mode is to undo the brane bending. This is because\nthe translational invariance of the brane-bulk system, which yields the residual gauge\nsymmetry (3.10) is linearly realized in the presence of the brane, which imposes gauge-\ninvariant boundary condition, so that the normalizable bulk mode and the brane bend-\ning completely compensate each other. Put another way, the only consistent matter-free\nsolution for the normal branch DGP brane is where the brane does not move from y = 0,\nand only TT GN perturbations in the metric are allowed. This, of course, should have\nbeen expected all along, as it is just the statement that the radion field decouples in\nthe case of single UV brane with 4D Minkowski or de Sitter geometry embedded in the\nstandard way in 5D Minkowski or AdS space. Here we see explicitly how gauge invari-\nance and normalizability enter this subtle conspiracy to remove this mode, essentially\nallowing that any scalar bulk perturbation localized to the brane can be bent away.\nOn the self-accelerating branch (ǫ = +1), the situation is very different: now, the\nnormalizable scalar mode is gauge-invariant by itself. The non-normalizable β-mode\nis not, and so imposing boundary conditions which require β = 0 breaks the residual\ngauge invariance (3.10). The brane bending mode F is the Goldstone field of the broken\nsymmetry, and the brane boundary condition (3.20) for a generic value of H (i.e. for\nnon-zero tension) yields\nα = − 2\nH\n[\nM35 −M24H\n2M35 −M24H\n]\n, (3.38)\nwhich pins the Goldstone F to the normalizable gauge-invariant scalar perturbation φ:\nh(φ)µν = −\n2\nH\n[\nM35 −M24H\n2M35 −M24H\n]\ne−Hy\/2OµνF . (3.39)\nThis perturbation represents a genuine radion, or physical motion of the brane with\nrespect to infinity. Although our choice of brane-GN gauge fixes the brane to the\ncoordinate position y = 0, it does so at the cost of, this time, breaking the residual\ngauge symmetry generated by f in (3.10) and introducing the explicit “book-keeping”\nOµνF term in hµν , which is the remnant of the translational zero mode of the brane.\nHad we instead allowed the brane position to be arbitrary, at y = F , (without the OµνF\nterm in (3.11)), the boundary conditions at y = F would still have had the same form,\n– 22 –\nsince the F -terms would have entered when evaluating the background at nonzero y.\nBoth approaches are completely equivalent, the former being more suitable to a brane\nbased observer and the latter to an asymptotic observer. The gauge transformation\nbetween these is a y-translation, which therefore corresponds to real motion of the\nbrane, just as in the 2-brane RS case [41]. The absence of this mode on the normal\nbranch reflects the fact that there is no distinguishable motion of an individual Z2\nsymmetric brane.\nWhen the tension is different from zero, the solutions χ\n(m)\nµν are precisely the TT-\ntensors hTTµν of (3.4) from the previous subsection. The scalar mode h\n(φ)\nµν has eigenvalue\nm2 = 2H2, as seen from (3.32), and the eigenvalues of the eigenmodes χ\n(m)\nµν are all\ndifferent from 2H2 when σ 6= 0. Thus the scalar mode φ, disguised as the tensor h(φ)µν ,\nis orthogonal to all χ\n(m)\nµν . Hence χ\n(m)\nµν coincide with the TT tensors hTTµν , and so when\nthere is no matter on the brane, the solutions are given by\nhµν(x, y) = αmde\n−λmdyχ(md)µν (x) +\n∫ ∞\n3H\n2\ndm um(y)χ\n(m)\nµν (x)\n+\n(1 + ǫ)\nH\n{\na1\/2OµνF −\n[\nM35 −M24H\n2M35 −M24H\n]\na−1\/2OµνF\n}\n. (3.40)\nThis solution clearly remains valid on the normal branch even in the limit of vanishing\ntension, σ → 0, and for the full range of σ < 0, because when ǫ = −1 the potentially\ndangerous OµνF terms vanish identically.\nHowever on the self-accelerating branch where ǫ = +1 the solution (3.40) – as it\nstands – fails when the tension vanishes, σ = 0, because of the pole in φ, or α, (3.38),\n(3.39). Indeed, (2.12) implies that when σ → 0, H → 2M35 \/M24 , and so the parameter\nα in (3.38) diverges. Thus the mode φ as given by (3.39) is ill-defined in this limit. At\na glance, noting that the coefficient of φˆ in (3.34) vanishes, one may interpret equation\n(3.38) as implying F = 0, thus fixing the brane rigidly at y = 0, and allowing φˆ to\nfluctuate independently of F . However, in light or the residual gauge transformations\n(3.10) and our gauge-fixing β = 0, that removed the non-normalizable gauge-dependent\nbulk scalar, setting F = 0 also would completely break the residual gauge symmetry\ngroup. This is dangerous, since it may miss physical degrees of freedom, which warns us\nagainst such a quick conclusion. To see what is really going on we must tread carefully.\nWhat’s going on when the tension vanishes is that the mass of the localized tensor\nmode on the self-accelerating branch approaches m2d = 2H\n2, as is clear from (3.26).\nFurther, the bulk wave function of the lightest localized tensor (3.27) converges to\nexp(−λmdy) = exp(−Hy\/2), i.e. it becomes identical to the bulk wave function of\nthe gauge-invariant scalar mode h\n(φ)\nµν . Thus the lightest tensor, h\nTT(md)\nµν , and the scalar\n– 23 –\nh\n(φ)\nµν = Oµνφ become dynamically degenerate, and can mix5 together: they both solve\nthe 4D field equations (D2−4H2)χµν = 0 and have formally the same tensor structure.\nNow, it has been noted by Deser and Nepomechie [43] that in the special case when\nthe mass of the massive 4D Pauli-Fierz theory in de Sitter space equals 2H2, the\ntheory develops an accidental symmetry[43, 44, 45, 46]. The tensor dynamics becomes\ninvariant under the transformation χ\n(\n√\n2H)\nµν → χ(\n√\n2H)\nµν + Oµνϑ, where ϑ is any solution\nof the equation (D2 + 4H2)ϑ = 0, affecting only the helicity-0 component of χ\n(\n√\n2H)\nµν .\nLifting this symmetry to the present case is considerably more intricate because of\nthe degenerate scalar h\n(φ)\nµν . Noting first that the wave profile of the lightest localized\ntensor is now e−Hy\/2 = 1\/\n√\na, the accidental symmetry of [43] shifts the bulk TT-tensor\nby\nh′TTµν = h\nTT\nµν + a\n−1\/2Oµνϑ . (3.41)\nHowever given the higher-dimensional origin of the perturbations hµν we cannot ar-\nbitrarily shift these modes around. The only gauge generators available to us, that\ncould in principle generate such shifts, are the residual gauge transformation rules of\n(3.9). However as is clear from (3.9), none of the residual gauge transformations have\nthe correct bulk wave profile to yield (3.41). Thus the transformation (3.41) must be\nunderstood as the Stu¨ckelberg symmetry of the problem: shifting χ\n(\n√\n2H)\nµν by a ϑ piece\nmust be compensated by shifting another field in the decomposition (3.8) to keep the\ntotal metric perturbation hµν invariant. The only available mode with the correct wave\nprofile, and the correct tensor structure so as not to break the diffeomorphism invari-\nance, is the normalizable scalar that is invariant under (3.10). Thus the scalar must\nnow be promoted into a Stu¨ckelberg field for ϑ. Note that this is completely analogous\nto rewriting the massive U(1) gauge theory in the Stu¨ckelberg form, formally giving up\non the Lorentz gauge for Aµ by introducing the Stu¨ckelberg scalar field.\nSo to properly account for the accidental symmetry on the self-accelerating brane\nin the vanishing tension limit generated by ϑ, we must enhance the residual gauge\ntransformation group (3.10) by also including in it\nh′TTµν = h\nTT\nµν + a\n−1\/2Oµνϑ , φ′ = φ− a−1\/2ϑ . (3.42)\nHence once we insert σ = 0 explicitly in the field equations (2.2), (3.20), we can\nseparate the field equations for the scalar and the lightest tensor from each other only\nafter explicitly gauge-fixing the Stu¨ckelberg symmetry generated by ϑ. The full field\nequations are merely covariant under it because of the scalar field φ. Once we have\n5This mixing has been noticed as the resonance instability in the shock wave analysis of [33], and\ndiscussed at length in [68].\n– 24 –\ngauge-fixed the brane at y = 0, the boundary conditions at the brane will really relate\nF to a linear combination of the helicity-0 tensor and the gauge-invariant normalizable\nscalar φˆ. A simple way to think about the boundary conditions is to fix the ϑ gauge\nby completely removing the helicity-0 mode from the tensor and absorbing it into φˆ.\nThen the brane boundary condition (3.38) just states that this ϑ-gauge fixed field φˆ is\nfluctuating freely - but it does not disappear from the spectrum. Indeed, we can go\nto a different ϑ-gauge, fixing it now such that the φˆ is completely eaten by the tensor\nχ\n(\n√\n2H)\nµν , which regains its helicity-0 component. This of course is completely equivalent\nto the unitary gauge of a theory with the Stu¨ckelberg fields, where the gauge fields eat\nStu¨ckelberg and gain mass. This is crucial for the failure of the ghost to decouple in\nthe tensionless brane limit, and is a simple way to understand the analysis of [68].\nHowever, neither of these gauges is convenient for the computation of the effective\naction, to be pursued later on. Instead, we can pick another ϑ gauge by taking the\ngeneral solution (3.40) and defining a ϑ which removes the pole in (3.40) as σ → 0 and\nproduces a smooth limit [39, 68]. We can do this by a shift\nαmdχ\n(md)\nµν (x) = Hµν(x)− αOµνF . (3.43)\nSubstituting this in (3.40) yields\nhµν(x, y) = e\n−λm\nd\nyHµν(x) +\n∫ ∞\n3H\n2\ndm um(y)χ\n(m)\nµν (x)\n+α\n{\ne−Hy\/2 − e−λmdy}OµνF + 2\nH\neHy\/2OµνF . (3.44)\nThen carefully taking the limit σ → 0 (noting that α ∝ 1\/σ, and λmd = H\/2 + O(σ))\nyields\nhµν(x, y) = e\n−H\n2\ny\n(\nHµν(x)− yOµνF\n)\n+\n∫ ∞\n3H\n2\ndm um(y)χ\n(m)\nµν (x) +\n2\nH\neHy\/2OµνF . (3.45)\nwhere the 4D tensor Hµν satisfies 6\n(D2 − 4H2)Hµν = −HOµνF . (3.46)\nNote that the trace of this equation yields OλλF = (D2 + 4H2)F = 0. In this gauge,\na way to think about Eq. (3.46) is to view the field F as the independent degree\nof freedom, and the helicity-0 component of the graviton Hµν as being completely\n6This follows from the σ → 0 limit of (D2 −m2d − 2H2)Hµν from (3.43), or can be readily derived\nfrom the equations of motion (3.19, 3.20).\n– 25 –\ndetermined by the source F . Yet, the brane localized matter can only feel its influence\nthrough the couplings to the helicity-0 component of Hµν , as can be seen from Eq.\n(3.45), which shows that on the brane at y = 0 the ∝ OµνF terms vanish. In this way,\nthe tensor Hµν(x) retains five physical, gauge-invariant degrees of freedom precisely\nbecause of this mixing with F , inherited from the bulk scalar φ. In effect what happened\nin the limiting procedure is that the pole of (3.40) was a pure gauge term of the\nStu¨ckelberg gauge symmetry, and was absorbed away by the choice of ϑ, leaving in its\nwake the smooth function (3.45).\n3.3 Linearized fields of matter lumps\nHere we include the contributions from localized stress-energy lumps on the brane. In\nthe linearized theory, the general solution is a linear combination of the homogeneous\nsolution, given by (3.40) or (3.45), describing propagating graviton modes, and a par-\nticular solution comprising of a TT piece and the relevant brane bending term which\ndescribe the response of the fields to the source. Thus we write:\nhµν(x, y) = h\n(hom)\nµν (x, y) + χ˜µν(x, y) +\n2a1\/2\nǫH\nOµνf(x) , (3.47)\nwhere the fields χ˜µν(x) and f(x) are the sought-after particular solutions that include\nthe effects of the brane sources. They must be the solution of the boundary value\nproblem, [\nD2 − 2H2 + ∂\n2\n∂y2\n− 9H\n2\n4\n]\nχ˜µν(x, y) = 0 ,[\n1\n2\nM24 (D\n2 − 2H2) χ˜µν +M35\n(\n∂\n∂y\n− 3ǫH\n2\n)\nχ˜µν\n]\ny=0\n−2 (M35 −M24 ǫH) (Oµν −Oλλγ¯µν) f = −12Tµν(x) , (3.48)\nTracing the boundary condition immediately gives\nOλλf =\n[\nD2 + 4H2\n]\nf(x) = −\n[\nT\n12(M35 −M24 ǫH)\n]\n. (3.49)\nThis fixes f(x) completely, as any homogeneous brane-bending term is accounted for\nin h\n(hom)\nµν .\nWe can write the particular solution as a spectral expansion, using the properties\nof the 4D mass eigenmodes determined in section 3.2. Formally, we consider the 4D\ndifferential operatorD2−2H2 whose tensor spectrum is given by TT-tensors χ(p)µν obeying\n(D2 − 2H2)χ(p)µν = p2χ(p)µν , and expand the solutions and the sources as\nχ˜µν(x, y) =\n∫\np\nvp(y)χ\n(p)\nµν (x) , τµν(x) =\n∫\np\nτp χ\n(p)\nµν (x) . (3.50)\n– 26 –\nwhere\nτµν(x) = Tµν − 4(M35 −M24 ǫH)\n[\nDµDν − γ¯µν(D2 + 3H2)\n]\nf(x) . (3.51)\nThe χ\n(p)\nµν tensors are an orthonormal basis of the spectrum of D2 − 2H2, whose eigen-\nvalues p2 6= m2 are taken to be off mass shell as is usual in the inhomogeneous problem.\nHere,\n∫\np\nis a generalized sum, accounting for the integration over the continuum part\nof the spectrum and the summation over the discrete, localized modes. Then the\nboundary value problem (3.48) reduces to the system\nv′′p(y) +\n(\np2 − 9H\n2\n4\n)\nvp(y) = 0 ,\nM35\n[\nv′p(0)−\n3ǫH\n2\nvp(0)\n]\n+ 1\n2\np2M24 vp(0) = −12τp , (3.52)\nextending (3.23) of section 3.2 with a source term τp. We can write the solutions vp’s\nin terms of the on-shell eigenfunctions um(y). First, rewrite (3.52) as\nv′′p +\n[\np2 − 9H\n2\n4\n+ (\nM24\nM35\np2 − 3ǫH)δ(y)\n]\nvp = − τp\nM35\nδ(y) . (3.53)\nThen expanding as vp(y) = vpmdumd(y)+\n∫∞\n3H\/2\ndmvpmum(y), substituting in (3.53) and\ncomparing with (3.25), and finally using the orthonormality of the eigenmodes um with\nrespect to the inner product (3.24), we find\nvp(y) = −\n[\numd(y)umd(0)\np2 −m2d\n+\n∫ ∞\n3H\n2\ndm\num(y)um(0)\np2 −m2\n]\nτp . (3.54)\nHence we can rewrite the linearized field of the matter on the brane as\nχ˜µν(x, y) =\n∫\nd4x′\n√−γ¯ Gµναβ(x, y; x′, 0)ταβ(x′) , (3.55)\nwhere the Green’s function is given by the eigenmode expansion\nGµν\nαβ(x, y; x′, 0) = −\n∫\np\n[\numd(y)umd(0)\np2 −m2d\n+\n∫ ∞\n3H\n2\ndm\num(y)um(0)\np2 −m2\n]\nχ(p)µν (x)χ\n∗ (p)αβ(x′) ,\n(3.56)\nwhere the asterisk denotes complex conjugation. Thus in the case when the only source\nof perturbation of the vacuum is matter on the brane, and the propagating geometric\nmodes are not excited, the brane geometry is perturbed by\nδγµν = χ˜µν(x, 0) +\n2ǫ\nH\nOµνf (3.57)\n– 27 –\nwhere f is given by (3.49) and χ˜µν(x, 0) by (3.55). Note however that one must treat\nthe Green’s function (3.56) with care, because the summation\n∑\np over the continuum\nhas a branch cut at m2 = 9H2\/4, which can be seen from the form of the continuum\neigenfunctions presented in section 3.2.\nThe ghost is hidden in the localized mode contribution to Gµν\nαβ(x, y; x′, 0), (i.e.\nthe\num\nd\n(y)um\nd\n(0)\np2−m2\nd\nterm), specifically, it resides in the helicity-0 component. We could\ndivine the ghost by computing the residues at the pole p2 = m2d of the propagator.\nAlternatively, as we will do in the next section, we can simply compute the effective\naction for small metric fluctuations and unveil the ghost-like behavior from the negative\ncontributions to it.\n3.4 Forking the ghost: calculating the effective action\nLet us now fork7 the ghost: we compute the effective 4D action of normalizable small\nperturbations considered in the previous section, that will serve as a straightforward\ndiagnostic of the ghost. We start with the general case of non-vanishing tension, σ 6= 0,\nand consider the limit σ = 0 separately. Let us consider the general metric perturbation\nin bulk GN gauge. Starting from (3.8), considering the µy and yy Einstein equations\n(3.14), (3.15), and the mode decomposition discussed in the previous sections we can\nwrite,\nδgµν(x, y) =\n√\na(y)\n(\nOµνφ+ umd(y)h(md)µν (x) +\n∫ ∞\n3H\n2\ndm um(y)h\n(m)\nµν (x)\n)\n,\nδgyy = δgµy = 0 , (3.58)\nwhere φ(x, y) = exp(−Hy\/2)φˆ(x) as before, and the Oλλφ and h terms automatically\ncancel each other in bulk GN gauge. In order to calculate the effective action, it is\nconvenient to fix the brane position so that it lies at y = 0, whilst maintaining the bulk\nGN gauge near infinity. This can be done with a carefully chosen y-dependent gauge\ntransformation:\nxµ → xµ − ξµ , y → y − ξy , (3.59)\nwhere\nξµ(x, y) =\n{\n1\nǫHa\nDµ( φˆ\nα\n+ f) for y ≪ R\n0 for y ≫ R\n, ξy(x, y) =\n{\n1\na\n( φˆ\nα\n+ f) for y ≪ R\n0 for y ≫ R\n,\n(3.60)\nwhere R > 0 is some arbitrary finite radius, and α is given in Eq. (3.36). The gauge\ntransformation (3.60) should be viewed as the limiting form of a smooth interpolating\n7“Forking”, or “dowsing”, is a practice which sometimes reveals an occult presence by means of a\ntwo-pronged fork, whose role in our case is assumed by the second order effective action.\n– 28 –\nfamily of test functions that continuously vary in the bulk. The new gauge is not Gaus-\nsian Normal everywhere, interpolating instead between a brane-GN gauge at the brane\npositioned at y = 0, and a bulk-GN gauge near infinity. The bulk metric perturbation\nin this gauge is\nδgab → δgab(x, y) + ∇¯aξb + ∇¯aξb , (3.61)\nwhere ∇¯ is the covariant derivative for g¯ab. The brane metric perturbation in turn is\nδγµν = hµν(x, 0) +\n2ǫ\nH\nOµν( φˆ\nα\n+ f) , (3.62)\nwhere f is the gauge transformation of section 3.3, needed to keep the tensor pertur-\nbation transverse-traceless in the presence of matter perturbations. The second-order\nperturbation of the total action is\nS = M35\n∫\nM\nd5x\n√−g¯δgabδGab + 1\n2\n∫\nΣ\nd4x\n√−γ¯δγµν (δΘµν − Tµν) , (3.63)\nand to get the 4D effective action we should integrate out the bulk, substituting the\nmode expansion for the radial coordinate y, while keeping all the 4D, x-dependent\nmodes off-shell. This means that in the explicit evaluation of the terms in the action\n(3.63) we do not require that (D2 + 4H2)φˆ = 0, or (D2 − m2 − 2H2)χ(m)µν = 0. In\nfact, once we have used our Ansatz for the perturbations (3.58), which respects the TT\nconditions, as a means for properly identifying the propagating degrees of freedom in\nthe theory about the backgrounds (2.7), we can relax these conditions when working\nout the effective action by evaluating (3.63) on (3.58). The TT conditions for χ\n(m)\nµν will\nnevertheless still emerge from the 4D field equations obtained by varying the effective\naction, just like in massive U(1) gauge theory (see also [68]). We stress that we could\nhave used the gauge-fixed action from the start, enforcing TT constraints directly in\nthe effective action. We won’t do so for the sake of simplicity, because the results are\ncompletely equivalent at the classical level.\nUsing (3.61), (3.62) and the Bianchi identity ∇¯aδGab = 0, we find that to the\nquadratic order in perturbations the action is\nS = −M35\n∫\nd4x\n√−γ¯\n∫ ∞\n0\ndy a\n√\nahµνδGµν − 2M25\n∫\nd4x\n√−γ¯ ξa(x, 0)δGay|y=0\n−1\n2\n∫\nd4x\n√−γ¯\n[\nhµν(x, 0) +\n2ǫ\nH\nOµν( φˆ\nα\n+ f)\n]\n(δΘµν − Tµν) .\n(3.64)\n– 29 –\nFrom the metric (3.61) and Eqs. (3.13) - (3.15) it then follows that the variations of\nthe Einstein tensor obey\na\n√\naδGµν = umd(y)X\n(md)\nµν +\n∫ ∞\n3H\n2\ndm um(y)X\n(m)\nµν , (3.65)\nδGµy|y=0 = − M\n2\n4\n4M35\n[\nm2dumd(0)D\nν\n(\nh(md)µν − h(md)γ¯µν\n)\n+\n∫ ∞\n3H\n2\ndm m2um(0)D\nν\n(\nh(m)µν − h(m)γ¯µν\n) ]\n, (3.66)\nδGyy|y=0 = −1\n2\n[\nDµDν − γ¯µν(D2 + 3H2)]\n[\numd(0)h\n(md)\nµν +\n∫ ∞\n3H\n2\ndm um(0)h\n(m)\nµν\n]\n−3ǫH\n2\n(\nM24\n2M35\n)[\nm2dumd(0)h\n(md) +\n∫ ∞\n3H\n2\ndm m2um(0)h\n(m)\n]\n−3\n4\nH2(1 + ǫ)(D2 + 4H2)φˆ . (3.67)\nIn these equations we have been using the tensorial operator X\n(m)\nµν , defined by\nX(m)µν = Xµν(h\n(m)) + 1\n2\nm2\n(\nh\n(m)\nµν − h(m)γ¯µν\n)\n. (3.68)\nwhere Xµν(h\n(m)) is given by (3.16). We further use the formula for the variation of the\nbrane stress-energy, which is\nδΘµν = M\n2\n4\n[\numd(0)X\n(md)\nµν +\n∫ ∞\n3H\n2\ndm um(0)X\n(m)\nµν\n]\n+2\n(\nM35 −M24 ǫH\n) [\nDµDν − γ¯µν(D2 + 3H2)\n]\nf . (3.69)\nA useful identity which follows from Bianchi identities and stress-energy conservation\nDµXµν(h) = D\nµTµν = 0 is D\nµ (δΘµν − Tµν) = −2M35 δGµy|y=0. Using it, the orthogo-\nnality of mode functions um, the projections\n(m2d − 2H2)\n〈\numd\n∣∣∣α exp(−H\n2\ny\n)〉\n= −4(M35 −M24 ǫH)umd(0) ,\n(m2 − 2H2)\n〈\num\n∣∣∣α exp(−H\n2\ny\n)〉\n= −4(M35 −M24 ǫH)um(0) , (3.70)\nand the defining equation (3.49) of the gauge parameter f , after a straightforward albeit\ntedious calculation we finally determine the 4D effective action, Seff =\n∫\nd4x\n√−γ¯ Leff,\n– 30 –\nwhere the Lagrangian density is\nLeff = −12h(md)µνX\n(md)\nµν + 12umd(0)h\n(md)µντµν\n+\n∫ ∞\n3H\n2\ndm\n[\n−1\n2\nh(m)µνX\n(m)\nµν + 12um(0)h\n(m)µντµν\n]\n−3(1 + ǫ)\n2\nM35H\n2 φˆ\nα\n(D2 + 4H2)φˆ , (3.71)\nand where we use the gauge invariant brane stress-energy perturbation\nτµν = Tµν − 4\n(\nM35 −M24 ǫH\n) [\nDµDν − γ¯µν(D2 + 3H2)\n]\nf . (3.72)\nVarying this action reproduces the correct field equations for h\n(m)\nµν and φˆ. The scalar\nfield φˆ does not have direct matter couplings at the level of quadratic action, and in\nfact drops out altogether on the normal branch (ǫ = −1), reflecting the fact that the\nnormalizable scalar mode in this case is pure gauge. On the self-accelerating branch\n(ǫ = +1), this mode is gauge-invariant, and since it sees the metric it should couple at\nleast to gravity at higher orders in perturbative expansion. This mode is itself a ghost\nwhen α > 0, which occurs when brane tension is negative, as can be readily seen by\nusing (2.10). The tensors, h\n(m)\nµν , are described mode-by-mode by the standard Pauli-\nFierz Lagrangian for massive gravity. They couple to matter with the coupling strength\ngiven by the bulk wave function overlap with the brane um(0). For the continuum\nmodes, this coupling is of the order of M\n− 3\n2\n5 . For the discrete mode, it is\numd(0) =\n1\nM4\n[\n3M24H − 2M35 (1 + ǫ)\n3M24H − 2M35 ǫ\n]1\n2\n(3.73)\nOn the normal branch, this coupling vanishes as σ → 0. This is simply the consequence\nthat the normalizable zero mode on the normal branch decouples in the limit of infinite\nbulk volume, as is well known [19, 27].\nIn contrast, on the self accelerating branch, the coupling does not vanish, but\nremains of the order of 1\/M4. As we have already discussed above, for all positive\nvalues of the tension, the helicity-0 component of this mode is a ghost, which therefore\nremains coupled to matter on the brane with the gravitational strength. It does not\ndecouple even when in the vanishing tension limit where the accidental symmetry of\n[43] for the tensor of mass m2 = 2H2 appears, because the symmetry is now realized\nas a Stu¨ckelberg symmetry which mixes the lightest tensor and the normalizable scalar\nmode φ because they are degenerate. This has also been discussed in the recent work\n[68]. Thus the dynamical degrees of freedom of the tensionless self-accelerating solution\n– 31 –\nare given by the combination (3.45), which we repeat here for completeness,\nhµν = e\n−H\n2\ny\n(\nHµν(x)− yOµνF\n)\n+\n∫ ∞\n3H\n2\ndm um(y)χ\n(m)\nµν (x) +\n2\nH\neHy\/2OµνF ,\nwhere\nHµν(x) = lim\nσ→0\n(\nαmdχ\n(md)\nµν (x) + αOµνF\n)\n.\nThe 4D tensor Hµν obeys (D2 − 4H2)Hµν = −HOµνF . The mixing of the lightest\ntensor with the brane Goldstone F in effect really just promotes the particular, non-\ndynamical, gauge function f that enforces the TT gauge conditions into a full-fledged\ndynamical mode ξ = F +f which mixes with the field Hµν . Indeed, in this case we can\nrewrite the boundary condition for Hµν(x) by subtracting the degenerate eigenmode\nOµνF to (3.48), which will modify the stress-energy source for this mode to\nτ (2H\n2)\nµν = Tµν + 4M\n3\n5\n[\nDµDν − γ¯µν(D2 + 3H2)\n]\nξ , (3.74)\nwhere we have used that in the limit of vanishing tension on the self-accelerating branch,\nH → 2M35 \/M24 and m2d → 2H2. Substituting this in the action, and renormalizing\nHµν → 1√2M4Hµν we finally find the zero tension effective lagrangian\nLeff = −12HµνXµν(H)− 12H2 (HµνHµν −H2) + 12√2M4H\nµντ\n(2H2)\nµν\n+\n∫ ∞\n3H\n2\ndm\n[\n−1\n2\nh(m)µνX\n(m)\nµν +\n1\n2\num(0)h\n(m)µντµν\n]\n, (3.75)\nwhere τµν is given by (3.72), and τ\n(2H2)\nµν by (3.74). In this case the scalar ξ does not\nhave a normal kinetic term, and only enters the action through mixing with the discrete\nmode Hµν . This occurs because 1\/α vanishes as σ → 0, as per Eq. (3.36). Yet this is\nsufficient to ensure that the ghost survives the vanishing tension limit from the point\nof view of the effective action.\n3.5 Perturbations that break Z2 symmetry\nSo far we have been mostly concerned with Z2 symmetric perturbations about the Z2\nsymmetric background (2.7), (2.9), following the conventional analysis of the stability\nof DGP backgrounds. However, even with a Z2 symmetric background, if we regard the\nbrane as a domain wall rather than an orbifold, which may be well-motivated for DGP\nbranes, there is no reason why perturbations about that background should respect\nthe Z2 symmetry. Indeed, given the notion that induced curvature is a finite width\ncorrection for domain walls, one may argue that non-Z2 perturbations are in principle\njust as important as their Z2 symmetric counterparts.\n– 32 –\nTo extend the perturbations to non-Z2 symmetric configurations, we take the warp\nfactor to still be\na(y) = exp(ǫH|y|) , (3.76)\nbut imagine that the bulk spacetime describes two separate half-intervals, parameter-\nized explicitly by −∞ < y < 0 and 0 < y < ∞, with the brane positioned at y = 0.\nWe now consider non-Z2 symmetric perturbations about this background for the case\nwhere Tµν = 0. These perturbations must satisfy the bulk equations of motion (2.2)\nand the non-Z2 symmetric Israel equations (2.3) to linear order. In addition we demand\ncontinuity of the metric across the brane. This comes for free by construction for Z2\nsymmetric perturbations, but not otherwise. If we choose a GN gauge (δgyy = δgµy = 0)\nwith brane fixed at y = 0, we note that the following perturbation satisfies (2.2) and\n(2.3), to linear order, and is continuous at y = 0,\nδgµν(x, y) =\n2(1 + ǫ)\nH\n√\na(y) sinh\n(\nHy\n2\n)\nOµν φ˜(x) +\n√\na(y)\n∫ ∞\n3H\n2\ndm sin(ωmy)χ\n(m)\nµν (x)\n(3.77)\nwhere χ\n(m)\nµν is transverse-traceless, and\n(D2 − 2H2)χ(m)µν = m2χ(m)µν , (D2 + 4H2)φ˜ = 0 (3.78)\nThis solution is clearly non-Z2 symmetric since δgab(x,−y) = −δgab(x, y). Note that\nthe tachyonic scalar, φ˜, is not present for the normal branch (ǫ = −1), but is present\non the self-accelerating branch (ǫ = +1). It represents yet another instability for the\nself accelerating background. Indeed, for ǫ = +1, φ˜ corresponds to a crinkling up of the\nbrane. We can see this by transforming to bulk-GN gauge, which is the appropriate\ngauge for an observer at infinity. To transform to this gauge, we take\nxµ → xµ + D\nµφ˜\nHa\nsgn(y), y → y + φ˜\na\n(3.79)\nThe bulk metric is now given by δgyy = δgµy = 0, and\nδgµν(x, y) = − 2\nH\nsgn(y)Oµνφ˜(x) +\n√\na(y)\n∫ ∞\n3H\n2\ndm sin(ωmy)χ\n(m)\nµν (x) (3.80)\nSince the brane resides y = φ˜(x) we can immediately interpret the tachyon φ˜ as a\ncrinkling up of the brane. However, we stress that this instability is phenomenologically\nvery mild when compared to the ghost, since it is controlled by the time scale given by\nthe inverse mass of φ˜, τinstability ∼ H−1.\n– 33 –\n4. Shocking 4D nonlocalities\nUp until now we have only considered perturbations of the backgrounds (2.7) which are\nnormalizable in the bulk. They admit to an effective 4D description mode-by-mode,\ninsofar as one is interested in computing their couplings and propagators as measured\nby brane-localized processes. This does not imply that the full picture is 4D over all\nthe relevant scales in the infra-red. The additional helicities of massive gravitons spoil\nthe 4D description, albeit at very long distances ∝ rc, by altering momentum transfer\nat very low momenta. As obscure as this may seem in the 4D effective action, it\nbecomes transparent in the shock wave analysis of [33]. On the other hand, once one\nrestricts only to the normalizable modes localized to the brane, as we have seen above\none inevitably encounters the lightest graviton on the self-accelerating branch, with\nmass in the unitarity violating window of [44, 45, 46], and so with a helicity-0 ghost.\nThis signals an instability which renders the perturbation theory within the effective\n4D description essentially meaningless. Indeed one does not know how to define the\nground state of the theory on top of which to perturb, and has no clear description\nof the evolutionary end points to which the perturbative ghost may lead. Thus before\ntrusting 4D perturbative description one must find ways to neutralize the ghost.\nSince the ghost comes on board with the localized massive graviton, one might try\nchanging perturbative definition of the theory, for example by changing prescriptions\nfor boundary conditions at infinity, to avoid this mode8. This possibility seems natural\nsince after all DGP is really a higher-dimensional theory, disguising as 4D at best over\na finite range of scales. Its ghost arises only after one ‘reduces’ the theory on the bulk-\nbrane background and restricts to the normalizable bulk modes, and so the ghost may\nrepresent merely an intrinsic instability of this reduction. A brane laden with matter\nmay want to move around the bulk in ways which require reintroduction of genuine\nbulk modes, that are not normalizable and hence remain completely outside of the\nscope of the usual 4D effective action analysis. This is supported by the observation of\n[33] that the singular behavior of a shock wave sourced by a photon on the tensionless\nbrane may be smoothed by reintroducing a genuine bulk mode, which then resonates\nwith the brane. A brane carrying a photon pulse behaves like an antenna, emitting\nbulk gravitons.\nHowever in this approach, energy will leak from the brane into the bulk as time\ngoes on, revealing the fifth dimension. This leakage may eventually strongly deform\nthe bulk far away. Alternatively, one could imagine a time-reversal of this process,\nwhere the description of a particle moving on the brane requires an incoming wave\nin the bulk, with the phase precisely tuned to cancel the ghost divergence, pouring\n8We thank G. Gabadadze for useful discussions about this approach.\n– 34 –\nenergy into the brane. One might try cutting the bulk infinity out of the picture,\nseeking boundary conditions that ought to keep the brane stable and self-accelerating.\nIt however remains difficult to imagine how this could ever insulate the brane physics\nfrom distant bulk in the full nonlinear covariant theory, and simultaneously retain the\nguise of a local, causal, 4D description. Every time something happens on the brane,\none would think that one needs to change the bulk far away, which either requires\nunacceptable external interference, appearing as nonlocalities, or the cross-bulk causal\ntransfer of signals that would violate 4D description. Furthermore, while individual\nnon-normalizable modes may be treated separately in the linearized theory, they will\nin general couple to each other at higher orders because they will have non-vanishing\noverlaps when nonlinearities are included. Thus once any one non-normalizable mode\nat a fixed 4D mass level is brought back, it should pull alongside it modes at other\nmass levels. These modes may introduce new dangers.\nA full bulk perturbation theory including all non-normalizable modes is beyond the\nscope of our work, requiring first setting up the precise perturbative formulation of the\nproblem, defining the set of new orthogonal modes et cetera. However to shed some\nlight on the problem we can completely circumvent all those issues by going directly to a\nspecial limit where we can solve field equations exactly. We shall solve exactly the field\nequations describing the gravitational field of a photon moving on the brane, including\nnon-normalizable modes. Such methods have been used in the context of braneworlds\nin [33, 69]. The result of this calculation shows that this time the exchange of the new,\nlightest non-normalizable tensor modes also generates repulsive contributions to the\npotential. This points that light non-normalizable tensor modes behave like 4D ghosts,\nsince their contribution to the potential is precisely the off-shell scattering amplitude\nfor the single-particle exchange between the brane source and a probe, which in the 4D\nlanguage would be the propagator, that would need to have its sign flipped to account\nfor repulsive force.\nTo see this, let us revisit the calculation of [33], describing the shocked background\ngeometry (2.7) with the metric\nds25 = e\n2ǫH|y|\n{ 4dudv\n(1 +H2uv)2\n− 4δ(u)Φdu\n2\n(1 +H2uv)2\n+ (\n1−H2uv\n1 +H2uv\n)2\ndΩ2\nH2\n+ dy2\n}\n. (4.1)\nThe induced metric on the brane is\nds24 =\n4dudv\n(1 +H2uv)2\n− 4δ(u)Φdu\n2\n(1 +H2uv)2\n+ (\n1−H2uv\n1 +H2uv\n)2\ndΩ2\nH2\n. (4.2)\nThese metrics are obtained from the static patch form of (2.7) written in terms of the\nnull coordinates u = 1\nH\n√\n1−Hr\n1+Hr\nexp(Ht) and v = 1\nH\n√\n1−Hr\n1+Hr\nexp(−Ht). To determine the\n– 35 –\nfield of a photon in de Sitter geometry, for technical reasons it is simplest to actually\nconsider the case of two photons with the same momentum p which run in the opposite\ndirection in the static patch [70, 71, 72]. So as in [33] we add two antipodal photons on\nthe brane, moving along the geodesics u = 0, θ = 0, and u = 0, θ = π, by introducing\nmetric discontinuities along the photon worldlines by substituting dv → dv− δ(u)Φdu.\nThis yields (4.1), (4.2). To return to a single source we can multiply this solution by\nthe step function Θ(π\/2− θ) as in [72]. The photon stress-energy tensor is\nT µν = −σδµν + 2 p√\ng5\ng4uv\n(\nδ(θ) + δ(θ − π)\n)\nδ(φ)δ(u)δvµδ\nu\nν , (4.3)\nwhere we use the notation g4uv for the metric on the brane in Eq. (4.2). A straightfor-\nward calculation [33] then yields the wave profile equation\nM35\nM24H\n2\n(\n∂2yΦ+3ǫH∂|y|Φ+H\n2(∆2Φ+2Φ)\n)\n+(∆2Φ+2Φ)δ(y) =\n2p\nM24\n(\nδ(Ω)+δ(Ω′)\n)\nδ(y) ,\n(4.4)\nwhere we use the shorthand δ(Ω) = δ(cos θ − 1)δ(φ) and δ(Ω′) = δ(cos θ + 1)δ(φ).\nThe operator ∆2 is the Laplacian on the transverse 2-sphere on the brane. Using the\nspherical symmetry of the brane geometry transverse to the photon directions, the\naddition theorem for spherical harmonics and linearity of (4.4), we can decompose the\nsolution as\nΦ =\n∞∑\nl=0\n(\nΦ\n(+)\nl (y)Pl(cos θ) + Φ\n(−)\nl (y)Pl(− cos θ)\n)\n. (4.5)\nHere Φ\n(±)\nl (z) are the bulk wave functions; Φ\n(+)\nl is sourced by the photon at θ = 0\nand Φ\n(−)\nl by the photon at θ = π. By orthogonality and completeness of Legendre\npolynomials, the field equation (4.4) yields an identical differential equation for both\nmodes Φ\n(±)\nl (z):\n∂2yΦl+3ǫH∂|y|Φl+H\n2(2− l(l+1))Φl = M\n2\n4H\n2\nM35\n((2l + 1)p\n2πM24\n−(2− l(l+1))Φl\n)\nδ(y) . (4.6)\nUsing pillbox integration and recalling Z2 symmetry which imposes Φl(−y) = Φl(y) we\nfinally determine the boundary value problem for Φl:\n∂2yΦl + 3ǫH∂yΦl +H\n2(2− l(l + 1))Φl = 0 ,\nΦl(−y) = Φl(y) , (4.7)\nΦ′l(0) +\n2− l(l + 1)\ng\nHΦl(0) =\nH\ng\n2l + 1\n2πM24\np ,\n– 36 –\nwhere g = 2M35 \/(M\n2\n4H) = 1\/(Hrc). Hence Φ\n(+)\nl = Φ\n(−)\nl = Φl since both satisfy the\nsame boundary value problem. Further because Pl(−x) = (−1)lPl(x), in the expansion\n(4.5) only even-indexed terms survive. This yields\nΦ = 2\n∞∑\nl=0\nΦ2l(y)P2l(cos θ) , (4.8)\ncircumventing the unphysical 4D singularities of l = 1 terms [70, 72]. Solving the dif-\nferential equation in (4.7) we see that the modes are of the form χ ∼ e[±2l−(∓1+3ǫ)\/2]H|y|.\nIn [33] only normalizable mode, for which ||Φ||2 ∝ ∫ dy e3H|y| |Φ|2 was finite, were kept.\nHere we want to see what happens when the non-normalizable modes are retained\ninstead, and so we use the general bulk wave function\nΦ2l = A2le\n−(2l+ 3ǫ+1\n2\n)H|y| +B2le(2l−\n3ǫ−1\n2\n)H|y| , (4.9)\nwhere A2l-mode is normalizable and B2l-mode is not. Substituting this into (4.7), (4.8),\nand introducing the parameter α2l by B2l = − p4πM24\n4l+1\n(2l−1− 1−ǫ\n2\ng)(l+1− 1+ǫ\n4\ng)\nα2l, because it\nmakes the representation (4.10) particularly transparent, after simple algebra we obtain\nΦ(Ω, y) = − p\n2πM24\n∞∑\nl=0\n(4l + 1)P2l(cos θ)\n( 1− α2l\n(2l − 1 + 1+ǫ\n2\ng)(l + 1 + 1−ǫ\n4\ng)\ne−(2l+2)H|y|\n+\nα2l\n(2l − 1− 1−ǫ\n2\ng)(l + 1− 1+ǫ\n4\ng)\ne(2l−1)H|y|\n)\n.\n(4.10)\nThe parameters α2l are selected by the boundary conditions at the bulk infinity, and,\nin the language of 4D theory, they correspond to the choice of the vacuum, since\ntheir specification picks out a specific linear combination of the solutions to represent\na particle state with a given mass and 4-momentum. Clearly, α2l = 0 corresponds\nto keeping only the normalizable modes in the description, and (4.10) reduces to the\nshock wave solution of [33], whereas α2l = 1 selects only the non-normalizable modes,\nthrowing out the normalizable ones.\nNow, how should we read the solution (4.10)? First notice that using the spherical\nharmonics addition theorem, 2n+1\n4π\nPn(cos θ) =\n∑n\nm=−n Y\n∗\nnm(0, 0) Ynm(θ, φ), and setting\nn = 2l, we can rewrite (4.10) as\nΦ(Ω, y) = − 2p\nM24\n∞∑\nl=0\n2l∑\nm=−2l\nY ∗2lm(0, 0) Y2lm(θ, φ)×\n×\n( 1− α2l\n(2l − 1 + 1+ǫ\n2\ng)(l + 1 + 1−ǫ\n4\ng)\ne−(2l+2)H|y|\n+\nα2l\n(2l − 1− 1−ǫ\n2\ng)(l + 1− 1+ǫ\n4\ng)\ne(2l−1)H|y|\n)\n. (4.11)\n– 37 –\nThis is the Green’s function of the problem (4.4), describing the gravitational field of\na ‘particle’ of effective mass p in the space transverse to the photon’s u, v propagation\nplane. Now, we recall that in the conventional approach, a tree-level perturbative\npotential generated by an exchange of a mediating boson is the Fourier transform\nof the scattering amplitude involving the boson propagator. The formula (4.11) is\nprecisely the same: since the transverse space to the shock is a S2brane × Rbulk, the\nterms of the expansion (4.11) can be interpreted as the off-shell tree level amplitudes\ninvolving the exchange of the discretized Fourier modes on the sphere, described by\nthe spherical harmonics, and weighed by the bulk radial functions which account for\nthe dilution of intermediary’s wave function due to the warping of the bulk, when the\nintermediary slides just outside of the brane. The ‘quantum numbers’ l measure the\nEuclidean momentum of the intermediary modes on the S2brane, q ∼ Hl, and control\nthe momentum transfer in a scattering process between the photon and a distant test\nparticle mediated by a virtual intermediary. The bulk y-dependence scales the coupling\nup or down depending on the location of the probe versus the brane.\nNow, to see how the shock wave looks on the self-accelerating brane, we can set\nǫ = 1 and y = 0 in Eq. (4.10), which yields\nΦ = − 2p\nM24\n∞∑\nl=0\n2l∑\nm=−2l\n( 1− α2l\n(2l − 1 + g)(l + 1) +\nα2l\n(2l − 1)(l + 1− g\n2\n)\n)\nY ∗2l m(0, 0) Y2lm(θ, φ) .\n(4.12)\nThese formulae are very revealing. First, let us suppose that 0 ≤ α2l ≤ 1. It is clear\nfrom the y-dependence of (4.10) that general solutions with α2l 6= 0 peak far from the\nbrane, indicating that they are very sensitive to the perturbations near the bulk infinity.\nHowever, from (4.12) we see that the local physics on the brane is not that sensitive to\ndistant bulk, since for large momentum transfer l ≫ g, i.e. at short distances between\nthe source and the probe, HR ≃√2(1− cos θ)≪ 1, the α2l terms which encode bulk\nboundary conditions completely cancel in the leading order in (4.10), (4.11), (4.12):(\n1−α2l\n(2l−1+g)(l+1) +\nα2l\n(2l−1)(l+1− g\n2\n)\n)\n= 1\n2l\n+O(g\nl\n). Thus to the leading order (4.12) behaves the\nsame at short distances as the wave profile with α2l = 0, composed only of normalizable\nmodes. Its short distance form will be very well approximated by the Aichelburg-Sexl\nwave profile, in exactly the same way as the purely normalizable wave profile [33].\nHowever, at very low momentum transfer, or at very large distances, a general\nsolution (4.10) with non-normalizable modes differs very dramatically from the one\nbuilt purely out of the normalizable modes. The point is that the coefficients of the\nexpansion of the wave profile ∝ α2l are not positive definite when viewed as a function\nof l. Indeed, when g > 2, all the coefficients in the second term change sign for\nall l < g\/2 − 1 except for l = 0, which remains positive because of the 1\/(2l − 1)\n– 38 –\nfactor. Now when g < 2, terms with l ≥ 1 remain positive, but the l = 0 term turns\nnegative. Hence these modes come in with opposite signs relative to the contributions\nfrom their normalizable partners ∝ 1 − α2l, and because their dependence on the\ntransverse distance from the source is the same as for the normalizable modes, this\nmeans that they yield repulsive contributions to the gravitational potential at large\ndistances. Given our interpretation of the contributions of the terms in the expansion of\nthe wave profile (4.11) as the discretized propagator of the exchanged virtual graviton,\nthe repulsive contributions to the potential at very large distances signal a ghost-like\nbehavior among the lightest states in the non-normalizable tensor sector. Note further\nthat when g is an integer, there are pole-like singularities in the sums (4.10)-(4.12). In\nthe normalizable sector, the only pole in fact occurs when g = 1, that corresponds to\nthe limit of vanishing tension and as discussed in [33] which can be interpreted as the\ninstability that leads to rapid release of energy into the bulk, related to the lightest\ntensor ghost. The non-normalizable contributions however have poles at all even integer\nvalues of g > 0, that indicate that if energy were to be inserted into them at infinity, it\nwould be quickly transferred into the normalizable modes, which could produce large\ngravitational effects on the brane.\nThis shows that resurrecting non-normalizable modes, if viewed as 4D phenomena,\nmay open the door to new ghost-like modes, over and above the helicity-0\/scalar ghost.\nIn this case one further needs to recheck carefully the scalar sector for any pathologies\namong the non-normalizable scalar modes, which cannot be revealed by the shock\nwave analysis as they are not sourced by relativistic particles. Note that taking α2l\noutside of the interval [0, 1] will not remove the repulsive contributions to the shock\nwave, but would further exacerbate the problem. For α2l > 1, all the normalizable\nmode contributions would switch sign, whereas for α2l < 0, all but the lightest non-\nnormalizable modes would be repulsive. Thus it appears that the repulsive terms in\nthe non-normalizable tensor sector will be avoided only if we set α2l = 0, but then this\nretains only the normalizable modes in the helicity-0 sector as well, leaving one with\nthe helicity-0 ghost.\nInterestingly, one can check explicitly using (4.10) that the situation on the normal\nbranch is better, in the sense that the relative sign between the normalizable and non-\nnormalizable contributions remains the same for all the terms in the expansion. In\nfact, on the normal branch, the only term which contributes to the wave profile with\na negative sign is the l = 0 mode, but this mode is completely constant on the brane\nand produces no force on brane particles. It will only repel bulk probes, but this is\nconsistent with the picture that domain walls in flat space, when viewed from the wall’s\nrest frame, exert repulsive force on particles in the bulk [55].\n– 39 –\n5. Summary\nIn this work we have reconsidered the perturbative description of codimension-1 DGP\nvacua. Our results confirm that in the normalizable sector of modes, there is always\na perturbative ghost on the self-accelerating branch. For positive brane tension, it\nresides in the localized lightest graviton multiplet as the helicity-0 state, whereas for\nthe negative tension it is the scalar ‘radion’-like field. In the borderline case of zero\ntension, describing a background where the brane expansion accelerates solely due to\ngravity modification, the ghost is an admixture of the helicity-0 and scalar modes,\nwhich become completely degenerate. In contrast, the normal branch vacua are free of\nghosts, at least when the brane tension is non-negative.\nThe ghost makes a simple 4D perturbative analysis of the self-accelerating dy-\nnamics prohibitive. It signals an instability which renders the effective 4D description\nperturbatively meaningless. Off hand, one does not know how to define the ground\nstate of the theory, and has no clear description of the evolutionary end points to\nwhich the perturbative ghost may lead. To illustrate the dangers from ghosts, let us\nreview a very simple, intuitive example of the classical ghost instability which, to our\nsurprise, does not seem to be widely discussed. Consider a system of two degenerate\nharmonic oscillators x and y. One could solve it by solving each individual oscillator\nproblem and then define the full set of states as the direct product of the individual\noscillators. However, these states do not naturally reflect the O(2) rotational symmetry\nof the system, which can be made manifest by going to polar coordinates x = R cos θ,\ny = R sin θ. Then the angle θ is a Goldstone mode, whose conserved charge is the\nangular momentum of the system, while the radial variable is an anharmonic oscilla-\ntor moving in an effective potential composed of the original parabolic piece far away\nand the centrifugal barrier erected by the angular momentum close in. This system is\nclassically stable. Now imagine making one of the original harmonic oscillators purely\nimaginary, e.g. y → iy. This changes the symmetry group to O(1, 1), the ‘polar’ coor-\ndinate maps become hyperbolic functions, and the phase is now the ghost, whereas the\nradial mode remains a normal field. The ghost’s centrifugal contribution to the radial\nmotion is now an infinite well, instead of a barrier. Thus even a tiniest perturbation\nwith non-zero angular momentum will send the oscillator spiralling into the infinitely\ndeep centrifugal well, spinning it up indefinitely as it goes in. In terms of the origi-\nnal Cartesian variables, the two oscillators gain infinite kinetic energy at the expense\nof each other, while keeping their difference constant. When the physical oscillator x\ncouples to other normal degrees of freedom, it can transfer its kinetic energy to them,\ndestabilizing the rest of the world. The rate of the instability is controlled by the os-\ncillator period, and in a field theory where one has a tower of ghastly oscillators with\n– 40 –\narbitrarily high frequencies, the energy transfer rates can therefore be very fast. Inter-\nestingly, this situation is reminiscent9 of what one encounters on the self-accelerating\nbranch of DGP, where among the degenerate lightest gravitons there is a ghost.\nWe should stress that we do not claim that it is ultimately impossible to get rid\nof the ghost. The question is, what is the price one must pay to exorcize it. We have\nconsidered what happens when one restores non-normalizable modes in the bulk, and\nallows them to couple to brane matter. This may be an interesting arena to explore if\nby abandoning description in terms of normalizable modes alone, some of the effects\nof the helicity-0 ghost may be controlled. If one reinstates the bulk scalar modes that\ncould couple to the helicity-0 ghost, however, by bulk general covariance one should\nalso bring in the tensors. All of these modes dwell outside of the realm of 4D effective\ntheory at all scales. Even so, our direct calculation of their couplings to relativistic\nbrane matter, modelled by a photon zipping along the brane, shows that at short\ndistances from it, the photon’s gravitational field follows closely the 4D form, being\nindistinguishable from the purely normalizable contributions in the leading order of the\nexpansion in g = 1\/Hrc. However, we have noted new repulsive gravitational effects at\nlarge distances from the source, arising from the non-normalizable tensor sector, which\nindicate that low momentum tensors behave as ghosts. This issue clearly deserves more\nattention, and it would be interesting to develop a description of the processes beyond\nquadratic perturbation theory to see how the system evolves.\nWe note in passing that another possibility may be to consider altering the theory\nat the level of the action itself, for example by adding extra terms in the bulk or on the\nbrane, and compactifying the bulk by adding new branes10. In the former case adding\nthe Gauss-Bonnet term in the bulk seems an intriguing possibility since the resulting\nfield equations are of second order and so they maintain the simple distributional\nbrane setup without adding new, possibly dangerous, graviton states of generic higher-\nderivative models. Cutting the bulk at a finite distance will reintroduce the zero mode\ngraviton, and may change the boundary conditions for the massive modes, affecting\nthe values of masses. If this could lift the localized lightest tensor out of the unitarity-\nviolating window, and\/or break degeneracies with scalar modes, the ghost instability\nmay be tamed. One then expects to be left with a strongly coupled massive graviton\non the original DGP brane, which could dominate over the zero mode in a range\nof scales, and so one may consider phenomenological aspects of such a multi-gravity\ntheory. However compactifying the bulk would turn DGP immediately into an effective\n9The differences are the presence of background de Sitter geometry and a different isospin group\n(O(2, 1) instead of O(1, 1)) but much of the rest appears the same, at least the linearized perturbation\ntheory level.\n10We understand that K. Izumi and T. Tanaka are pursuing such approaches.\n– 41 –\n4D theory at large scales, exposing it to the edge of the Weinberg’s venerable no-go\ntheorem [4] for the adjustment of cosmological constant. Thus while removing the\nghost by a compactification of the bulk might work, it may automatically restore the\nusual fine-tunings of the 4D vacuum energy, completely obscuring the whole point of\nself-acceleration.\nThus it is doubtful that self-acceleration in its present guise may serve as a model\nof the current epoch of cosmic acceleration, since after all it does appear that some\nperturbative description of our universe at the largest scales should exist. The self-\naccelerating branch does not seem to fit this bill due to its occult sector. Yet, if\none wants to study the implications of modified gravity, one may still find a useful\nframework among the brane-induced gravity models. The simplest one may be the\nnormal branch solutions. True, they undergo cosmic acceleration at the right rate\nbecause one fine-tunes the brane tension to just the right value by hand, σ ≃ (10−3eV )4.\nBut there is no ghost, and perturbative description is reliable. If one then also tunes the\nscale of modification of gravity, rc ∼ 1\/H , one gets interesting signatures of weakened\ngravity at the largest scales. Namely although there is a zero mode graviton on the\nnormal branch, the light bulk modes also contribute to gravity at scales smaller than\nrc ∼ 1\/H and the effective graviton that mediates sub-horizon interactions is really a\nresonance composed of many modes. Thus local gravity is stronger than the horizon\nscale gravity. At the horizon scale, the force weakens because the effective momentum\ntransfer of the massive admixtures changes from 1\/q2 to 1\/q as the extra dimension\nopens up. This weakening of gravity may simultaneously change the cosmic large scale\nstructure [34] and masquerade the cosmological constant as dark energy with w < −1\n[73], in a way that could be accessible to observations.\n– 42 –\nAcknowledgments\nWe would like to thank Thibault Damour, Cedric Deffayet, Jean-Francois Dufaux,\nGia Dvali, Keisuke Izumi, Kazuya Koyama, Markus Luty, Ian Moss, Massimo Porrati,\nLorenzo Sorbo, Norbert Straumann, Takahiro Tanaka, John Terning, Andrew Waldron,\nRobin Zegers and especially Gregory Gabadadze and Rob Myers for useful discussions.\nR.G. thanks the KITP, UC Santa Barbara, for hospitality during the completion of this\nwork, which was supported in part by the NSF under grant no. PHY99-0794. N.K. is\ngrateful to IHES, Bures-sur-Yvette, France, to IPPP, University of Durham, UK, to\nBIRS Research Station, Banff, Canada, to KITP, UC Santa Barbara and to Yukawa\nInstitute, Kyoto University, Japan, for kind hospitality in the course of this work. NK\nthanks the cabin crews of several United and Lufthansa flights for making the skies\nfriendly during the finalization of this article. NK was supported in part by the DOE\nGrant DE-FG03-91ER40674, in part by the NSF Grant PHY-0332258 and in part by\na Research Innovation Award from the Research Corporation. A. Padilla thanks UC\nDavis for kind hospitality during the completion of this work.\n6. Proof of tensor decomposition in Eq. (3.8)\nTo prove (3.8) we first introduce auxiliary fields Σµν = hµν − h4 γ¯µν , Bµ and B, where\nwe require that Bµ and B are solutions of differential equations\n(D2 + 4H2)B =\n2\n3\nDµDνΣµν ,\nD2Bµ +D\nνDµBν − 1\n2\nDµB = D\nνΣµν . (6.1)\nThese differential equations are integrable, despite the cumbersome nature of the\nvector field equation that appears to mix different components. We can simplify the\nsystem by introducing an additional scalar auxiliary field, as follows. First, commute\nthrough the derivatives acting on the vector, using the standard rules for commutators\nof covariant derivatives in de Sitter metric γ¯µν and rewrite the vector equation as\n(D2 + 3H2)Bµ = D\nνΣµν −Dµ(DνBν − 1\n2\nB) . (6.2)\nNext multiply this equation by Dµ, commute the derivatives again, and using the\ndefining equation for B to eliminate DµDνΣµν , finally obtain the equation for Ψ =\nB −DµBµ :\n(D2 + 3H2)Ψ = 0 . (6.3)\n– 43 –\nThus Ψ is a completely free field on de Sitter background, and this equation can be\nsolved at least in principle.\nWe can now consider a different system of equations governing the auxiliary fields,\nwhere we eliminate DµB\nµ in (6.2) in terms of Ψ and B. The full system then becomes\n(D2 + 3H2)Ψ = 0 ,\n(D2 + 4H2)B =\n2\n3\nDµDνΣµν ,\n(D2 + 3H2)Bµ = D\nνΣµν −Dµ(B\n2\n−Ψ) . (6.4)\nClearly, once we find a solution Ψ and determine a B, which we can do because we know\nthe source in the B equation, given by the original tensor hµν , we can integrate the\nremaining 4 equations for the vector to get the full solution. It will, clearly, depend on\nthe choice of the auxiliary function Ψ. To select precisely the required solution of (6.1)\nwe must extract that solution of (6.4) which automatically satisfies Ψ = B−DµBµ. So\nindeed multiplying the vector field with Dµ yields\n3H2Ψ = (D2 + 6H2)(B −DµBµ) , (6.5)\nand when we exclude the null eigenvalue spurions of D2 + 6H2 from B − DµBµ by\nan appropriate choice of boundary conditions11, the field equation (D2 + 3H2)Ψ = 0\nimplies (D2 + 3H2)(B − DµBµ) = 0. In this case Ψ1 = B − DµBµ solves the same\nequation as Ψ. But then, since (D2 + 6H2)Ψ1 = 3H\n2Ψ1, comparing with (6.5) gives\nΨ1 = Ψ. Thus as required Ψ = B − DµBµ, and any such solution of (6.4) will be\nexactly a solution of (6.1). Having a solution, we can now define the tensor\nh¯µν = Σµν −DµBν −DνBµ + B\n2\nγ¯µν , (6.6)\nand note, using the differential equations (6.1) that it is transverse, Dµh¯\nµ\nν = 0. Its\ntrace is\nh¯µµ = 2B − 2DµBµ , (6.7)\nand so we can eliminate B from the solution writing it as B = DµB\nµ+ h¯\/2. Moreover,\nwe can separate the vector field Bµ as a Lorentz-gauge vector Aµ, DµA\nµ = 0, plus a\nscalar gradient,\nBµ = Aµ +\n1\n2\nDµφ , (6.8)\n11We can always exclude these spurions, because by (D2 + 3H2)Dµϑˆ = Dµ(D\n2 + 6H2)ϑˆ, the gauge\nshifts Bµ → Bµ +Dµϑˆ by functions obeying (D2 + 6H2)ϑˆ = 0 drop out from the field equations (6.4)\nbut shift the spurion in B −DµBµ by 6H2ϑˆ. So we can simply choose ϑˆ to completely cancel away\nthe spurion.\n– 44 –\nand substitute all this back in (6.6). Solving for the original tensor field hµν , we write\nhµν = h¯µν +DµAν +DνAµ +DµDνφ− 1\n4\nγ¯µνD\n2φ+\nh− h¯\n4\nγ¯µν , (6.9)\nNow, we are almost there: the field h¯µν is transverse, but not yet traceless. However\nits trace is equal to the auxiliary free field Ψ by Eq. (6.7), which we can pick to be\nexactly zero by choosing appropriate boundary conditions, amounting to gauge fixing\nBµ. Hence the tensor is\nh¯µν |Ψ=0 = hTTµν , (6.10)\nwhich is also traceless! Thus indeed we recover (3.8), as claimed. Note that nowhere\nin this decomposition did we need to specify anything about y-dependence, which\nwas treated as an extra parameter. Hence, Eq. (3.8) will remain valid for a Fourier\ntransform of the metric perturbation as well. So we see that an arbitrary perturbation\nin the GN gauge can be separated as a 5-component transverse-traceless tensor, a 3-\ncomponent Lorentz vector, and 2 scalars, in addition to the brane location F , which is\na separate 4D field.\n7. Helicity-0 ghosts in de Sitter space\nHere we review the proof that a helicity-0 mode of the massive Pauli-Fierz spin-2\ntheory in de Sitter space is a ghost if the mass obeys 0 < m2 < 2H2. In the early\nwork of Higuchi [44] this was demonstrated by showing that the helicity-0 sector of the\nHilbert space contains negative norm states, but since then simpler methods based on\nHamiltonian analysis have been developed [46]. Here we largely follow the analysis of\n[46], although we note that a Lagrangian analysis based on correctly identifying the\nresidual gauge symmetries of the helicity-0 sector would produce equivalent results.\nWe start with the Pauli-Fierz massive spin-2 theory in a background metric γ¯µν ,\nwhich is given by L = √−γ¯ − 1\n2\nhµνX\n(m)\nµν , where X\n(m)\nµν is defined in Eqs. (3.68) and\n(3.16). We take γ¯µν to be the de Sitter metric (2.8), and Dµ its covariant derivative.\nThis Lagrangian describes the localized lightest tensor multiplet on the self-accelerating\nbranch, with mass m = md, which for positive brane tension lies in the unitarity-\nviolating window 0 < m2 < 2H2. The explicit form of the Pauli-Fierz action is\nSPF =\n∫\nd4x\n√−γ¯ − 1\n4\nDαhµνDαhµν +\n1\n2\nDµh\nµ\nνD\nαhνα − 12DµhµνDνh + 14DµhDµh\n−1\n2\nH2hµνhµν − 14H2h2 − m\n2\n4\n(hµνhµν − h2) , (7.1)\nwhere the hµν are the general metric perturbations. Now, using the after-the-fact\nwisdom [46], we know that if the mass m2 were zero, this theory would only have two\n– 45 –\nhelicity-2 excitations as the propagating modes. Thus the modifications can only arise\nbecause some of the scalar and vector perturbations of the general 4D metric do not\ndecouple when m2 6= 0. Further, because the theory remains Lorentz-invariant, the\nvectors and the scalars decouple from the tensors, and moreover the vectors can only\nyield the helicity-1 modes. Thus the helicity-0 mode can only arise from the scalar\nperturbations, which we can parameterize as\nhij = 2e\n− 1\n2\nHt (∂i∂jE + Aδij) , hit = e\n− 1\n2\nHt ∂iB , htt = 2e\n− 3\n2\nHt φ . (7.2)\nHere ∂i are spatial derivatives. We have normalized the perturbations by the appropri-\nate powers of eHt to simplify the analysis, following [46]. Plugging the perturbations\n(7.2) into (7.1) yields, with SPF =\n∫\ndtd3x L,\nL = −6A˙2 − 4A˙X˙ + (4m2 − 9H2)AX + A\n(\n6m2 − 27\n2\nH2 − 2e−2Ht∆\n)\nA\n−φ\n[\n4HX˙ + 2(m2 − 3H2)X + 12HA˙+ 6(m2 − 3H2)A− 4e−2Ht∆A\n]\n+e−Ht∆B\n(\n4Hφ+ 4A˙− 6HA\n)\n− 6H2φ2 − 1\n2\nm2B∆B , (7.3)\nwhere we have introduced X = ∆E, with ∆ =\n∑\ni ∂\n2\ni the flat 3-space Laplacian, and\ndenoted time differentiation by a dot. To define the Hamiltonian as in [46], we write\ndown the conjugate momenta ΠQ =\n∂L\n∂Q˙\n, which are\nΠX = −4A˙− 4Hφ , ΠA = −12A˙− 4X˙ − 12Hφ+ 4e−2Ht∆B ,\nΠB = Πφ = 0 . (7.4)\nThus the Lagrangian and the Hamiltonian are related by L = ΠXX˙ + ΠAA˙−H, and\nso using this and (7.4) the Hamiltonian is given by\nH = 3\n8\nΠ2X −\n1\n4\nΠXΠA + A\n(\n27\n2\nH2 − 6m2 + 2e−2Ht∆\n)\nA + (9H2 − 4m2)AX\n+φ\n[\n2(m2 − 3H2)X + 6(m2 − 3H2)A− 4e−2Ht∆A−HΠA\n]\n+e−Ht∆B (ΠX + 6HA)− 12m2B∆B (7.5)\nFrom the Hamiltonian we immediately see that the fields φ and B aren’t propagating -\nwhich of course comes as no surprise, since they are the scalar remnants of the shift and\nlapse functions. Varying the Hamiltonian with respect to them yields the Hamiltonian\nand momentum constraints respectively, which can be written as\nΠA − 1\nH\n[\n2(m2 − 3H2)X + 6(m2 − 3H2)A− 4e−2Ht∆A] = 0 ,\nB +\ne−Ht\nm2\n(ΠX + 6HA) = 0 , (7.6)\n– 46 –\nwhere we are holding m2 6= 0 in the last equation. Substituting these equations in the\nLagrangian we integrate out the lapse and shift, and integrating by parts find\nL =\n(\nΠX − 2\nH\n(m2 − 3H2)A\n)\nX˙ − ΠX\n(\n3\n8\n− e\n−2Ht∆\n2m2\n)\nΠX +\n1\n2H\n(m2 − 3H2)ΠXX\n+ΠX\n[\n3\n2H\n(m2 − 3H2)− 1\nm2H\n(m2 − 6H2)e−2Ht∆\n]\nA + (4m2 − 9H2)AX\n+A\n[\n6m2 − 27\n2\nH2 − 6\nm2\n(m2 − 3H2)e−2Ht∆\n]\nA (7.7)\nA field redefinition ΠX = p+\n2\nH\n(m2 − 3H2)A recasts the Lagrangian as\nL = pX˙ − p\n(\n3\n8\n− e\n−2Ht∆\n2m2\n)\np + p\ne−2Ht∆\nH\nA+\nν2\n2H\npX +\n3m2ν2\n2H2\nA2 +\nm2ν2\nH2\nXA , (7.8)\nwhere ν2 = m2 − 2H2. This shows that with these variables A is not a dynamical\nfield. Its field equation is algebraic, and for m2 6= 2H2 it yields A = −X\n3\n− He−2Ht∆\n3m2ν2\np.\nSubstituting this into (7.8) gives\nL = pX˙−p\n[\ne−4Ht∂4\n6m2ν2\n− e\n−2Ht∆\n2m2\n+\n3\n8\n]\np−p\n[\ne−2Ht∆\n3H\n− 1\n2H\n(m2 − 3H2)\n]\nX−m\n2ν2\n6H2\nX2 .\n(7.9)\nAt long last, we make the one last field redefinition,\nX = q +\nH\n2m2ν2\n[\n3(m2 − 3H2)− 2e−2Ht∆] p , (7.10)\nwhich casts the Lagrangian in the form\nL = pq˙ − m\n2ν2\n6H2\nq2 − 3H\n2\n2m2ν2\np\n(\nm2 − 9H\n2\n4\n− e−2Ht∆\n)\np . (7.11)\nThis equation looks slightly unusual, since the Lagrangian seems to depend on the\nspatial gradients of the ‘momentum’ p rather than the ‘field’ q. However, this is just a\nmirage, which can be easily removed by a canonical transformation q = −π, p = ϕ, and\nthe integration by parts of pq˙ = −ϕπ˙ = πϕ˙ − d\ndt\n(ϕπ). Dropping the total derivative,\nwe can extract the final Hamiltonian from the Lagrangian L = πϕ˙−H, to find\nH = m\n2ν2\n6H2\nπ2 +\n3H2\n2m2ν2\nϕ\n(\nm2 − 9H\n2\n4\n− e−2Ht∆\n)\nϕ . (7.12)\nWe immediately see that when ν2 < 0 (i.e. 0 < m2 < 2H2) the Hamiltonian is\nnegative definite, and so the field ϕ is a ghost. It can be viewed as literally a massive\n– 47 –\nscalar field covariantly coupled to de Sitter gravity, with the sign of the Lagrangian\nreversed. When m2 = 0 and ν2 = 0 the ghost decouples in the pure Pauli-Fierz\ntheory, which can be glimpsed at from the canonically normalized scalar ϕ = m|ν|√\n3H\nϕC ,\nπ =\n√\n3H\nm|ν| πC , indicating that all the perturbative Lagrangian couplings of ϕ to matter\nare proportional to positive powers ofm|ν|. This does not occur for the self-accelerating\nbranch DGP because of the additional scalar localized mode, as discussed in the text\nand in [68].\nAlso note that the 0 < m2 < 2H2 ghost has a very mild tachyonic instability,\ninduced by de Sitter expansion. One can see it from the field equation for the Fourier\ncomponents of ϕC , which from (7.12) is, by setting ϕC = ϕˆC(k)e\ni~k·~x,\n¨ˆϕC(k) +\n(\nm2 − 9H\n2\n4\n+ ~k2e−2Ht\n)\nϕˆC(k) = 0 . (7.13)\nAs time goes on, the 3-momentum term ∝ ~k2 becomes insignificant, so that ϕˆC(k) →\nexp(±\n√\n9H2\n4\n−m2 t) for m2 < 2H2. This behavior changes for all gravitons above de\nSitter gap m2 ≥ 9H2\n4\n(as discussed in [46]), and when m2 = 0 the ghost is absent in the\nfirst place. Yet it is clear that these instabilities simply correspond to the freezing out\nof long wavelength ghost modes at super-horizon scales, as is common in inflation, and\nit would be interesting to explore the implications of this mechanism for DGP.\nReferences\n[1] A. G. Riess et al. [Supernova Search Team Collaboration], Astron. J. 116, 1009 (1998)\n[arXiv:astro-ph\/9805201];\nA. G. Riess et al., arXiv:astro-ph\/0402512.\n[2] S. Perlmutter et al. [Supernova Cosmology Project Collaboration], Astrophys. J. 517,\n565 (1999) [arXiv:astro-ph\/9812133].\n[3] J. L. Tonry et al., Astrophys. J. 594 1, (2003);\nR. A. Knop et al., arXiv:astro-ph\/0309368.\n[4] S. Weinberg, Rev. Mod. Phys. 61, 1 (1989).\n[5] V. Sahni and A. A. Starobinsky, Int. J. Mod. Phys. D 9, 373 (2000)\n[arXiv:astro-ph\/9904398];\nP. J. E. Peebles and B. Ratra, Rev. Mod. Phys. 75, 559 (2003) [arXiv:astro-ph\/0207347].\n[6] C. D. Hoyle, U. Schmidt, B. R. Heckel, E. G. Adelberger, J. H. Gundlach, D. J. Kapner\nand H. E. Swanson, Phys. Rev. Lett. 86, 1418 (2001) [arXiv:hep-ph\/0011014]; Phys.\nRev. D 70, 042004 (2004) [arXiv:hep-ph\/0405262].\n– 48 –\n[7] E. G. Adelberger, B. R. Heckel and A. E. Nelson, Ann. Rev. Nucl. Part. Sci. 53, 77\n(2003) [arXiv:hep-ph\/0307284].\n[8] M. Milgrom, Astrophys. J. 270, 365 (1983);\nR. H. Sanders, Mon. Not. Roy. Astron. Soc. 296, 1009 (1998) [arXiv:astro-ph\/9710335];\nJ. D. Bekenstein, arXiv:astro-ph\/0403694.\n[9] A. M. Polyakov, Sov. Phys. Usp. 25 187, (1982) [Usp. Fiz. Nauk 136, 538 (1982)]; Phys.\nAtom. Nucl. 64 540, (2001) [Yad. Fiz. 64 (2001 IMPAE,A16,4511-4526.2001) 594]\n[arXiv:hep-th\/0006132].\n[10] A. A. Tseytlin, Phys. Rev. Lett. 66, 545 (1991).\n[11] N. Arkani-Hamed, S. Dimopoulos, G. Dvali and G. Gabadadze, arXiv:hep-th\/0209227.\n[12] N. Arkani-Hamed, S. Dimopoulos and G. R. Dvali, Phys. Lett. B 429, 263 (1998)\n[arXiv:hep-ph\/9803315]; Phys. Rev. D 59, 086004 (1999) [arXiv:hep-ph\/9807344];\nI. Antoniadis, N. Arkani-Hamed, S. Dimopoulos and G. R. Dvali, Phys. Lett. B 436, 257\n(1998) [arXiv:hep-ph\/9804398].\n[13] L. Randall and R. Sundrum, Phys. Rev. Lett. 83, 3370 (1999) [arXiv:hep-ph\/9905221].\n[14] L. Randall and R. Sundrum, Phys. Rev. Lett. 83, 4690 (1999) [arXiv:hep-th\/9906064].\n[15] N. Arkani-Hamed, S. Dimopoulos, G. R. Dvali and N. Kaloper, Phys. Rev. Lett. 84\n586, (2000) [arXiv:hep-th\/9907209];\nN. Kaloper, JHEP 0405, 061 (2004) [arXiv:hep-th\/0403208].\n[16] I. I. Kogan, S. Mouslopoulos, A. Papazoglou, G. G. Ross and J. Santiago, Nucl. Phys.\nB 584, 313 (2000) [arXiv:hep-ph\/9912552];\nI. I. Kogan and G. G. Ross, Phys. Lett. B 485, 255 (2000) [arXiv:hep-th\/0003074].\n[17] R. Gregory, V. A. Rubakov and S. M. Sibiryakov, Phys. Rev. Lett. 84, 5928 (2000)\n[arXiv:hep-th\/0002072].\n[18] R. Gregory, V. A. Rubakov and S. M. Sibiryakov, Phys. Lett. B 489, 203 (2000)\n[arXiv:hep-th\/0003045].\n[19] G. R. Dvali, G. Gabadadze and M. Porrati, Phys. Lett. B 485, 208 (2000)\n[arXiv:hep-th\/0005016].\n[20] N. D. Birrell and P. C. W. Davies, “Quantum fields in curved space”, Cambridge\nUniversity Press, 1982.\n[21] V. A. Rubakov and M. E. Shaposhnikov, Phys. Lett. B 125, 139 (1983); Phys. Lett. B\n125, 136 (1983).\n– 49 –\n[22] B. Carter and R. Gregory, Phys. Rev. D 51, 5839 (1995) [arXiv:hep-th\/9410095];\nF. Bonjour, C. Charmousis and R. Gregory, Phys. Rev. D 62, 083504 (2000)\n[arXiv:gr-qc\/0002063].\n[23] E. Kiritsis, N. Tetradis and T. N. Tomaras, JHEP 0108, 012 (2001)\n[arXiv:hep-th\/0106050].\n[24] C. Charmousis and R. Zegers, Phys. Rev. D 72, 064005 (2005) [arXiv:hep-th\/0502171];\nJHEP 0508, 075 (2005) [arXiv:hep-th\/0502170].\n[25] I. Antoniadis, arXiv:hep-ph\/0512182;\nI. Antoniadis, R. Minasian and P. Vanhove, Nucl. Phys. B 648, 69 (2003)\n[arXiv:hep-th\/0209030].\n[26] C. Csaki, J. Erlich, T. J. Hollowood and J. Terning, Phys. Rev. D 63, 065019 (2001)\n[arXiv:hep-th\/0003076].\n[27] G. R. Dvali and G. Gabadadze, Phys. Rev. D 63, 065007 (2001)\n[arXiv:hep-th\/0008054].\n[28] C. Deffayet, Phys. Lett. B 502, 199 (2001) [arXiv:hep-th\/0010186].\n[29] C. Deffayet, G. R. Dvali and G. Gabadadze, Phys. Rev. D 65, 044023 (2002)\n[arXiv:astro-ph\/0105068].\n[30] A. Lue, arXiv:astro-ph\/0510068.\n[31] H. Collins and B. Holdom, Phys. Rev. D 62, 105009 (2000) [arXiv:hep-ph\/0003173];\nT. Tanaka, Phys. Rev. D 69, 024001 (2004) [arXiv:gr-qc\/0305031];\nC. Middleton and G. Siopsis, Mod. Phys. Lett. A 19, 2259 (2004)\n[arXiv:hep-th\/0311070];\nG. Gabadadze and A. Iglesias, Phys. Rev. D 72 (2005) 084024 [arXiv:hep-th\/0407049].\n[32] G. Dvali, A. Gruzinov and M. Zaldarriaga, Phys. Rev. D 68, 024012 (2003)\n[arXiv:hep-ph\/0212069].\n[33] N. Kaloper, Phys. Rev. Lett. 94, 181601 (2005) [Erratum-ibid. 95, 059901 (2005)]\n[arXiv:hep-th\/0501028];\nN. Kaloper, Phys. Rev. D 71, 086003 (2005) [Erratum-ibid. D 71, 129905 (2005)]\n[arXiv:hep-th\/0502035].\n[34] A. Lue, R. Scoccimarro and G. D. Starkman, Phys. Rev. D 69, 124015 (2004)\n[arXiv:astro-ph\/0401515].\n[35] N. Arkani-Hamed, H. Georgi and M. D. Schwartz, Annals Phys. 305 96, (2003)\n[arXiv:hep-th\/0210184].\n– 50 –\n[36] V. A. Rubakov, arXiv:hep-th\/0303125.\n[37] M. A. Luty, M. Porrati and R. Rattazzi, JHEP 0309, 029 (2003)\n[arXiv:hep-th\/0303116].\n[38] A. Nicolis and R. Rattazzi, JHEP 0406, 059 (2004) [arXiv:hep-th\/0404159].\n[39] K. Koyama, Phys. Rev. D 72, 123511 (2005) [arXiv:hep-th\/0503191];\nsee also K. Koyama and K. Koyama, Phys. Rev. D 72, 043511 (2005)\n[arXiv:hep-th\/0501232].\n[40] J. Garriga and T. Tanaka, Phys. Rev. Lett. 84, 2778 (2000) [hep-th\/9911055].\n[41] C. Charmousis, R. Gregory and V. A. Rubakov, Phys. Rev. D 62, 067505 (2000)\n[arXiv:hep-th\/9912160].\n[42] L. Pilo, R. Rattazzi and A. Zaffaroni, JHEP 0007, 056 (2000) [arXiv:hep-th\/0004028].\n[43] S. Deser and R. I. Nepomechie, Phys. Lett. B 132 321, (1983); Annals Phys. 154 396,\n(1984).\n[44] A. Higuchi, Nucl. Phys. B 282, 397 (1987); Nucl. Phys. B 325, 745 (1989);\nI. I. Kogan, S. Mouslopoulos and A. Papazoglou, Phys. Lett. B 503, 173 (2001)\n[arXiv:hep-th\/0011138].\n[45] S. Deser and A. Waldron, Phys. Rev. Lett. 87, 031601 (2001) [arXiv:hep-th\/0102166].\n[46] I. Bengtsson, J. Math. Phys. 36, 5805 (1995) [arXiv:gr-qc\/9411057];\nS. Deser and A. Waldron, Phys. Lett. B 508 (2001) 347 [arXiv:hep-th\/0103255].\n[47] H. Verlinde, Nucl. Phys. B 580, 264 (2000) [arXiv:hep-th\/9906182];\nS. S. Gubser, Phys. Rev. D 63, 084017 (2001)[arXiv:hep-th\/9912001];\nS. B. Giddings, E. Katz and L. Randall, JHEP 0003, 023 (2000) [arXiv:hep-th\/0002091];\nM. J. Duff and J. T. Liu, Phys. Rev. Lett. 85, 2052 (2000) [Class. Quant. Grav. 18,\n3207 (2001)] [arXiv:hep-th\/0003237];\nN. Arkani-Hamed, M. Porrati and L. Randall, JHEP 0108, 017 (2001)\n[arXiv:hep-th\/0012148].\n[48] S. Kachru, M. B. Schulz and E. Silverstein, Phys. Rev. D 62, 045021 (2000)\n[arXiv:hep-th\/0001206]; Phys. Rev. D 62, 085003 (2000) [arXiv:hep-th\/0002121].\n[49] A. Padilla, Class. Quant. Grav. 22, 681 (2005) [arXiv:hep-th\/0406157]; Class. Quant.\nGrav. 22, 1087 (2005) [arXiv:hep-th\/0410033].\n[50] W. Israel, Nuovo Cim. B 44S10, 1 (1966) [Erratum-ibid. B 48, 463 (1967\nNUCIA,B44,1.1966)].\n– 51 –\n[51] G. W. Gibbons and S. W. Hawking, Phys. Rev. D 15, 2752 (1977).\n[52] N. Kaloper, Phys. Rev. D 60, 123506 (1999) [arXiv:hep-th\/9905210].\n[53] P. Kraus, JHEP 9912 011, (1999) [arXiv:hep-th\/9910149].\n[54] N. Kaloper and A. D. Linde, Phys. Rev. D 59, 101303 (1999) [arXiv:hep-th\/9811141].\n[55] A. Vilenkin, Phys. Lett. B 133, 177 (1983);\nJ. Ipser and P. Sikivie, Phys. Rev. D 30, 712 (1984).\n[56] D. Garfinkle and R. Gregory, Phys. Rev. D 41, 1889 (1990).\n[57] Y. Iwasaki, Phys. Rev. D 2, 2255 (1970) ;\nH. van Dam and M. J. G. Veltman, Nucl. Phys. B 22, 397 (1970);\nV. I. Zakharov, JETP Lett. 12 312, (1970).\n[58] A. I. Vainshtein, Phys. Lett. B 39 393, (1972).\n[59] C. Deffayet, G. R. Dvali, G. Gabadadze and A. I. Vainshtein, Phys. Rev. D 65 044026,\n(2002) [arXiv:hep-th\/0106001].\n[60] A. Gruzinov, New Astron. 10, 311 (2005) [arXiv:astro-ph\/0112246].\n[61] M. Porrati, Phys. Lett. B 534, 209 (2002) [arXiv:hep-th\/0203014].\n[62] R. Bao, M. Carena, J. Lykken, M. Park and J. Santiago, Phys. Rev. D 73, 064026\n(2006) [arXiv:hep-th\/0511266].\n[63] C. Deffayet, S. J. Landau, J. Raux, M. Zaldarriaga and P. Astier, Phys. Rev. D 66,\n024019 (2002) [arXiv:astro-ph\/0201164].\n[64] H. A. Bridgman, K. A. Malik and D. Wands, Phys. Rev. D 65, 043502 (2002)\n[arXiv:astro-ph\/0107245].\n[65] J. Garriga and M. Sasaki, Phys. Rev. D 62, 043523 (2000) [arXiv:hep-th\/9912118].\n[66] J. Khoury, P. J. Steinhardt and D. Waldram, Phys. Rev. D 63, 103505 (2001)\n[arXiv:hep-th\/0006069].\n[67] A. V. Frolov and L. Kofman, Phys. Rev. D 69 044021, (2004) [arXiv:hep-th\/0309002].\n[68] D. Gorbunov, K. Koyama and S. Sibiryakov, arXiv:hep-th\/0512097.\n[69] N. Kaloper and L. Sorbo, JHEP 0508, 070 (2005) [arXiv:hep-th\/0507191].\n[70] M. Hotta and M. Tanaka, Class. Q. Grav. 10 307, (1993).\n[71] J. Podolsky and J. Griffiths, Phys. Rev. D 56 4756, (1997).\n– 52 –\n[72] K. Sfetsos, Nucl. Phys. B 436 721, (1995) [arXiv:hep-th\/9408169].\n[73] V. Sahni and Y. Shtanov, JCAP 0311, 014 (2003) [arXiv:astro-ph\/0202346];\nA. Lue and G. D. Starkman, Phys. Rev. D 70, 101501 (2004) [arXiv:astro-ph\/0408246].\n– 53 –\n"}