{"doi":"10.1086\/423619","coreId":"194796","oai":"oai:lra.le.ac.uk:2381\/759","identifiers":["oai:lra.le.ac.uk:2381\/759","10.1086\/423619"],"title":"Kinematically Cold Populations at Large Radii in the Draco and Ursa Minor Dwarf Spheroidal Galaxies","authors":["Wilkinson, M. I.","Kleyna, J. T.","Evans, N. W.","Gilmore, G. F.","Irwin, M. J.","Grebel, E. K."],"enrichments":{"references":[{"id":44682236,"title":"Galactic Dynamics (Princeton:","authors":[],"date":"1987","doi":"10.1063\/1.2811635","raw":"Binney, J., & Tremaine, S. 1987, Galactic Dynamics (Princeton: Princeton Univ. Press) Carrera, R., Aparicio, A., Martı´nez-Delgado, D., & Alonso-Garcı´a, J. 2002, AJ, 123, 3199 Harbeck, D., et al. 2001, AJ, 122, 3092 Irwin, M., & Hatzidimitriou, D. 1995, MNRAS, 277, 1354 Johnston, K. V., Choi, P. I., & Guhathakurta, P. 2002, AJ, 124, 127 Johnston, K. V., Sigurdsson, S., & Hernquist, L. 1999, MNRAS, 302, 771 (J99) King, I. 1962, AJ, 67, 471 Klessen, R. S., Grebel, E. K., & Harbeck, D. 2003, ApJ, 589, 798 Kleyna, J. T., Wilkinson, M. I., Evans, N. W., & Gilmore, G. 2001, ApJ, 563, L115 Kleyna, J. T., Wilkinson, M. I., Evans, N. W., Gilmore, G., & Frayn, C. 2002, MNRAS, 330, 792 Kleyna, J. T., Wilkinson, M. I., Gilmore, G., & Evans, N. W. 2003, ApJ, 588, L21 Kuhn, J. R., Kocevski, D., & Fleck, J.-J. 2004, in Satellites and Tidal Streams, ed. F. Prada & D. Martinez-Delgado (San Francisco: ASP), in press (astroph\/0309207) Martı´nez-Delgado, D., Alonso-Garcı´a, J., Aparicio, A., & Gomez-Flechoso, M. A. 2001, ApJ, 549, L63 Mateo, M. 1997, in ASP Conf. Ser. 116, The Nature of Elliptical Galaxies, ed. M. Arnaboldi, G. S. Da Costa, & P. Saha (San Francisco: ASP), 259 Odenkirchen, M., et al. 2001, AJ, 122, 2538 Palma, C., Majewski, S., Siegel, M. H., Patterson, R. J., Ostheimer, J. C., & Link, R. 2003, AJ, 125, 1352 Schlegel, D. J., Finkbeiner, D. P., & Davis, M. 1998, ApJ, 500, 525 Schweitzer, A. E., Cudworth, K. M., & Majewski, S. R. 1997, in ASP Conf.","cites":null},{"id":44682237,"title":"Proper Motions and Galactic Astronomy,","authors":[],"date":"2002","doi":"10.1007\/978-94-010-3417-3_39","raw":"Ser. 127, Proper Motions and Galactic Astronomy, ed. R. M. Humphreys (San Francisco: ASP), 103 Stoehr, F. 2004, MNRAS, submitted (astro-ph\/0403077) Stoehr, F., White, S. D. M., Tormen, G., & Springel, V. 2002, MNRAS, 335,","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-07-12","abstract":"We present projected velocity dispersion profiles for the Draco and Ursa Minor (UMi) dwarf spheroidal galaxies based on 207 and 162 discrete stellar velocities, respectively. Both profiles show a sharp decline in the velocity dispersion outside ~30' (Draco) and ~40' (UMi). New deep photometry of Draco reveals a break in the light profile at ~25'. These data imply the existence of a kinematically cold population in the outer parts of both galaxies. Possible explanations of both the photometric and the kinematic data in terms of both equilibrium and nonequilibrium models are discussed in detail. We conclude that these data challenge the picture of dwarf spheroidal galaxies as simple, isolated stellar systems","downloadUrl":"http:\/\/iopscience.iop.org\/article\/10.1086\/423619\/meta","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/759\/1\/APJ-10.1086-423619.pdf","pdfHashValue":"5a934fae635e3677e32b2920905dd4393ce60281","publisher":"American Astronomical Society, IOP Publishing","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/759<\/identifier><datestamp>\n                2015-12-02T17:10:37Z<\/datestamp><setSpec>\n                com_2381_1<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_10633<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nKinematically Cold Populations at Large Radii in the Draco and Ursa Minor Dwarf Spheroidal Galaxies<\/dc:title><dc:creator>\nWilkinson, M. I.<\/dc:creator><dc:creator>\nKleyna, J. T.<\/dc:creator><dc:creator>\nEvans, N. W.<\/dc:creator><dc:creator>\nGilmore, G. F.<\/dc:creator><dc:creator>\nIrwin, M. J.<\/dc:creator><dc:creator>\nGrebel, E. K.<\/dc:creator><dc:description>\nWe present projected velocity dispersion profiles for the Draco and Ursa Minor (UMi) dwarf spheroidal galaxies based on 207 and 162 discrete stellar velocities, respectively. Both profiles show a sharp decline in the velocity dispersion outside ~30' (Draco) and ~40' (UMi). New deep photometry of Draco reveals a break in the light profile at ~25'. These data imply the existence of a kinematically cold population in the outer parts of both galaxies. Possible explanations of both the photometric and the kinematic data in terms of both equilibrium and nonequilibrium models are discussed in detail. We conclude that these data challenge the picture of dwarf spheroidal galaxies as simple, isolated stellar systems.<\/dc:description><dc:date>\n2009-12-08T16:24:40Z<\/dc:date><dc:date>\n2009-12-08T16:24:40Z<\/dc:date><dc:date>\n2004-07-12<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nAstrophysical Journal Letters, 2004, 611 (1), pp.21-24<\/dc:identifier><dc:identifier>\n0004-6388<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/759<\/dc:identifier><dc:identifier>\nhttp:\/\/iopscience.iop.org\/article\/10.1086\/423619\/meta<\/dc:identifier><dc:identifier>\n10.1086\/423619<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nRAE 2007<\/dc:relation><dc:relation>\nTheoretical Astrophysics<\/dc:relation><dc:rights>\nArchived with reference to SHERPA\/RoMEO and publisher website. © 2004. The American Astronomical Society. All rights reserved.<\/dc:rights><dc:publisher>\nAmerican Astronomical Society, IOP Publishing<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0004-6388","0004-6388"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["RAE 2007","Theoretical Astrophysics"],"year":2004,"topics":[],"subject":["Article"],"fullText":"L21\nThe Astrophysical Journal, 611:L21–L24, 2004 August 10\n\u0001 2004. The American Astronomical Society. All rights reserved. Printed in U.S.A.\nKINEMATICALLY COLD POPULATIONS AT LARGE RADII IN THE DRACO AND URSA MINOR\nDWARF SPHEROIDAL GALAXIES\nMark I. Wilkinson,1 Jan T. Kleyna,2 N. Wyn Evans,1 Gerard F. Gilmore,1\nMichael J. Irwin,1 and Eva K. Grebel3\nReceived 2004 May 24; accepted 2004 June 23; published 2004 July 12\nABSTRACT\nWe present projected velocity dispersion profiles for the Draco and Ursa Minor (UMi) dwarf spheroidal galaxies\nbased on 207 and 162 discrete stellar velocities, respectively. Both profiles show a sharp decline in the velocity\ndispersion outside ∼30\u0001 (Draco) and ∼40\u0001 (UMi). New deep photometry of Draco reveals a break in the light\nprofile at ∼25\u0001. These data imply the existence of a kinematically cold population in the outer parts of both\ngalaxies. Possible explanations of both the photometric and the kinematic data in terms of both equilibrium and\nnonequilibrium models are discussed in detail. We conclude that these data challenge the picture of dwarf\nspheroidal galaxies as simple, isolated stellar systems.\nSubject headings: dark matter —\ngalaxies: individual (Draco dwarf spheroidal, Ursa Minor dwarf spheroidal) —\ngalaxies: kinematics and dynamics — Local Group — stellar dynamics\n1. INTRODUCTION\nThe dark matter–dominated Local Group dwarf spheroidal\ngalaxies (dSph’s) have emerged as valuable laboratories in\nwhich to test dark matter models. Recently, the projected ve-\nlocity dispersion profiles of the Fornax and Draco dSph’s have\nbeen obtained (Mateo 1997; Kleyna et al. 2001). Detailed mod-\neling of the discrete stellar velocities in Draco enabled the\nhypothesis that mass follows light to be discarded at the 2.5 j\nlevel and suggested that the halo density falls off morer(r)\nslowly than the light distribution with (Kleyna et\u00011.7r(r) ∼ r\nal. 2002). In this Letter, we present new observations of the\nDraco and Ursa Minor (UMi) dSph’s that yield the velocity\ndispersion profiles of both galaxies to the edge of their light\ndistributions. The new data suggest the existence of kinemat-\nically cold populations in the outer parts of both galaxies. These\ndata make it possible to test the validity of isolated equilibrium\nmodels of dSph’s.\n2. OBSERVATIONS\n2.1. Discrete Velocities\nWe observed the Draco and UMi dSph’s with the multi-\nfiber instrument AF2\/Wide-Field Fiber Optics Spectrograph\n(WYFFOS) on the William Herschel Telescope on La Palma\non 2003 June 20–23 and 2003 May 6–11, respectively. We\ndrew our Draco targets from the Sloan Digital Sky Survey,\nwhile we took our UMi targets from our own KPNO 4 m\nMOSAIC imaging. In each case, we identified potential targets\nby drawing a polygon around the giant branch of a V, V\u0001 I\ncolor-magnitude diagram with a faint magnitude limit of V !\n. The data were reduced using the WYFFOS-specific20\nWYFRED data reduction package in IRAF and cross-correlated\nwith the two bluemost lines of the Calcium triplet, in the same\nmanner as described by Kleyna et al. (2002). To determine the\nfinal member list for each dSph we assumed that their velocity\n1 Institute of Astronomy, Madingley Road, Cambridge CB3 OHA, UK;\nmarkw@ast.cam.ac.uk.\n2 Institute for Astronomy, University of Hawaii, 2680 Woodlawn Drive,\nHonolulu, HI 96822.\n3 Astronomisches Institut, Universita¨t Basel, Venusstrasse 7, CH 4102 Bin-\nningen, Switzerland.\ndistribution was Gaussian with a dispersion (including mea-\nsurement error) of \u000212.5 km s\u00011.\nOur final Draco data set contains 112 velocities within\n39 km s\u00011 of Draco’s mean velocity with a median velocity\nerror of 2.4 km s\u00011. The union of these data with the data set\nof Kleyna et al. (2001) contains 207 unique members with good\nvelocities. The median velocity of the combined data set is\n, where the uncertainties are obtained through\u00021.2 \u00011\u0001290.7 km s\u00010.6\nbootstrap resampling. Our final UMi data set has 144 stars within\n36 km s\u00011 of the mean velocity, with a median velocity error of\n2.9 km s\u00011. Adding the earlier UMi velocities of Kleyna et al.\n(2003) produces a data set with 162 member stars. The median\nvelocity of the combined data set is .\u00021.0 \u00011\u0001245.2 km s\u00010.6\nFor both Draco and UMi, at large radii the individual ve-\nlocities of the stars relative to the mean tend to decline with\nincreasing distance from the center. In the case of UMi, this is\nparticularly striking with six of the seven outermost stars lying\nwithin 1 j of the mean bulk velocity of the dSph. Fig-\nure 1 shows the radial variation of the line-of-sight velocity\ndispersion jP in Draco and UMi. The projected dispersion drops\nsharply at large radii. In each dSph, we detect no rotation\nbeyond that identified in previous work. Since our selection\ncriterion for dSph membership is based on the assumption of\na Gaussian velocity distribution, we would expect to discard\nless than one genuine member in Draco (UMi) by imposing a\n39 km s\u00011 (36 km s\u00011) cutoff with the possible exception of\nextreme binaries. The presence of some outliers just inside the\nvelocity cutoff at large radii suggests that we may, in fact, be\nretaining some nonmembers in our sample. If 3% of our data\nbelong to the Galactic foreground (assumed to have a flat ve-\nlocity distribution between our velocity limits), then the overall\ndispersion of our sample would be increased by about\n1 km s\u00011. Thus, nonmember contamination at large radii would\ntend to strengthen our conclusion of a falling velocity disper-\nsion. It could be invalidated only if we had erroneously re-\nmoved large-velocity bound stars from the sample.\n2.2. Photometry\nFigure 2 shows the azimuthally averaged surface brightness\nprofile of Draco based on deep imaging to and ′V ≈ 25 i ≈\nwith the Isaac Newton Telescope. This has been corrected24\nL22 WILKINSON ET AL. Vol. 611\nFig. 1.—Line-of-sight velocity dispersion profiles (with 1 j error bars) for\nDraco and UMi. See text for a detailed discussion.\nFig. 2.—Azimuthally averaged surface brightness profile of Draco. The solid\nand dashed curves show, respectively, the best-fitting Plummer profile and a\nKing (1962) profile fit to the data within 25\u0001.\nfor the effects of variable extinction using the reddening map\nof Schlegel et al. (1998). The limiting magnitude of our ob-\nservations is about 2 mag fainter than that of the Sloan Digital\nSky Survey data used by Odenkirchen et al. (2001) to determine\nthe light profile of Draco and permits more robust background\nsubtraction in the outer regions. In contrast to the Odenkirchen\net al. photometry, the profile in Figure 2 shows a clear break\nat ∼25\u0001. We note that a similar result has been recently claimed\nby Kuhn et al. (2004). The light profile of UMi displays a\nsimilar feature (e.g., Irwin & Hatzidimitriou 1995; Palma et\nal. 2003; Martı´nez-Delgado et al. 2001) at about 34\u0001. This\nmilitates against the idea that the dSph’s currently possess ex-\ntended halos (e.g. Stoehr et al. 2002).\nUsing simulations, Johnston et al. (1999, hereafter J99) sug-\ngested that stellar systems in the Milky Way halo will show\nbreaks in their surface density profiles, beyond which unbound\nor extratidal stars begin to predominate over bound stars. Their\nresults are superficially similar to our photometric data on Draco\nand UMi, but there are some important differences. First, J99\nfound an enhanced velocity dispersion due to the extratidal stars,\nand second, they argued for a slow falloff (proportional to R\u00011)\nin surface brightness beyond the break. Johnston et al. (2002)\nconsidered noncircular dSph orbits and found a wide variety of\nprofile shapes and outer falloff rates, with milder breaks and\nsteeper falloffs occurring around the apocenters of more eccentric\norbits. They also found that the ratio of the break radius to the\nactual tidal radius varies with orbital phase and eccentricity and\nis significantly below unity near apocenter.\nAlso shown in Figure 2 are the best-fitting King (1962) and\nPlummer profiles for the surface brightness profile of Draco. The\nformer fits the inner parts well but requires an additional extra-\ntidal population at to mimic the break. The latter provides′R 1 25\na reasonable description of the entire profile. In the rest of this\nLetter, we use these models to try to understand the surprising\ndata on the velocity dispersions of Draco and UMi.\n3. MODELING\n3.1. Equilibrium Models\nUsing the simplifying assumptions of virial equilibrium and\nspherical symmetry, the observable line-of-sight velocity dis-\npersion jP as a function of projected radius R is\n\u0003\n2 GM(r)2j (R)p dr n(r)f (r)P \u0001I(R) rR\nr 2w R\n# dw 1\u0001 b(w) , (1)\u0001 [ ]22 2\u0002 wf (w) w \u0001 RR\nwhere is the surface brightness and is the stellarI(R) n(r)\nluminosity density. This expression also involves the mass\nprofile of the dark matter halo and the stellar velocityM(r)\nanisotropy parameter . The function2 2b(r)p 1\u0001 Av S\/Av Sv r\nis the integrating factor for the spherical Jeans equation,f (r)\nnamely, .rexp [\u0001 dr 2b(r)\/r]∫0\nUnder the assumption of isotropy ( ), equation (1) be-bp 0\ncomes an Abel integral equation, which can be inverted to give\nthe mass profile of the dark matter halo (Binney & Tre-M(r)\nmaine 1987, § 4.2). Using an analytic fit to Draco’s projected\ndispersion together with either a Plummer or a King profile in\nthe Abel inversion, we find that the cumulative mass M(r)\nbecomes unphysical ( ) beyond . An isotropic′dM\/dr ! 0 r ∼ 30\nmodel with a Plummer or King profile cannot reproduce the\nobserved sharp decline in jP for Draco. Analogous fits to the\ndispersion profile and luminosity density of UMi lead to a\nsimilar conclusion for its mass profile at the radius where its\nvelocity dispersion falls.\n3.1.1. A Sharp Change in the Velocity Anisotropy?\nOne possibility is that the velocity anisotropy changes\nabruptly from isotropy in the inner parts to strong(bp 0)\nradial anisotropy ( ) in the outer parts. This could causeb r 1\na sharp drop in the projected dispersion, even if the stellar\ndensity and dark matter profile vary slowly and smoothly. We\nhave investigated this option using equation (1) together with\nan anisotropy parameter , which tends to an n nb(r)p r \/(r \u0002 r )a\nNo. 1, 2004 KINEMATICALLY COLD POPULATIONS AT LARGE RADII L23\nFig. 3.—Projected velocity dispersion for a Plummer light profile (scale\nlength ) in a dark matter halo assuming four different velocity anisotropyR0\nlaws. Even an extremely sharp change in the velocity anisotropy does not\nreproduce the decrease in velocity dispersion seen in UMi.\nHeaviside function about the anisotropy radius asH(r ) ra a\n. Figure 3 shows the projected velocity dispersion jPn r \u0003\nassuming a Plummer model for the dSph luminosity density.\nThe halo is a “parabolic velocity curve” model as advocated by\nStoehr (2004) as an excellent fit to subhalos in high-resolution\nsimulations of the Milky Way halo. The observable dispersion\nis computed under the assumption of isotropy or extreme tan-\ngential or radial anisotropy together with the Heaviside step-\nfunction anisotropy. A very sharp change in anisotropy can cause\njP to fall at . In fact, for a stellar population with luminosityR ∼ ra\ndensity in a dark halo with an underlying rotation curve\u0001nn ∝ r\nbehaving like , jP falls by a factor of\u0001gV(r) ∼ r 1\/ (n\u0002 2g\u0001\nafter a sudden change to radial anisotropy.1\/22)\nFor Draco, a smooth Plummer profile provides a reasonable\nfit to the stellar density. Given the large error bar on the outermost\ndata point of the velocity dispersion, a sudden change in the\nanisotropy at large radii could plausibly explain the data. For\nUMi, however, the outermost dispersion data point is better\nconstrained and the photometry is less well represented by a\nsmooth profile. A sharp change in the anisotropy cannot by\nitself produce the drop in jP, unless the stellar density or the\ndark halo also changes at the anisotropy radius ra.\n3.1.2. A Sharp Edge in the Light Distribution?\nIf a dSph has a sharp edge in its light distribution, then jP\nwould necessarily fall to zero at projected radii approaching that\nedge. Let us suppose that as , the stellar density behavesr r rt\nlike . Then, by expanding equation (1), it can benr ∼ (r \u0001 r)t\nshown that\n1\/2 \u0001(1\u0002g)\/2j ∼ C(r \u0001 R) R . (2)P t\nThe anisotropy b and the falloff in the stellar density n alter\nthe constant C but not the scaling with distance from the edge\nrt. The dark halo has been assumed to possess an underlying\nrotation curve behaving like , so that the case\u0001gV(r) ∼ r gp\n(Keplerian rotation) corresponds to truncation of the dark12\nhalo. So, irrespective of whether the dark halo is extended or\ntruncated, the velocity dispersion of the dSph must always go\nto zero like , if the stellar distribution has a sharp1\/2(R\u0001 r )t\nedge.\nFor both Draco and UMi, a sharp edge to the stellar distri-\nbution seems at first sight inconsistent with the photometry.\nHowever, as the overplotted King profile in Figure 2 shows,\nwe can associate a tidally limited model with Draco provided\nthat the excess of stars at is interpreted as an extratidal′R \u0003 25\n(and possibly unbound) population. If so, it is surprising that\nthe extratidal stars are kinematically colder than those in the\nmain body of Draco. This situation admits two possible ex-\nplanations. First, the tails could be kinematically cold, either\nintrinsically or because of projection effects. This is not out of\nthe question, as discussed later in § 3.2. Here, we merely note\nthat Liouville’s theorem tells us that phase-space density is\nconserved in the absence of mixing, so that a stretching of\nmaterial to form a tidal tail must be accompanied by a cor-\nresponding contraction in velocity space. Second, given the\nsmall numbers involved, is it possible that we have missed stars\nassociated with the extratidal enhancement? This seems un-\nlikely, as the density in the tails is higher than that of Draco\nat the radii sampled by our outer velocity bin. However, the\npresence of age or metallicity gradients could potentially lead\nus to sample preferentially one population in the outer parts;\nour Draco photometric data provide some evidence that the\nblue and red horizontal branches have different spatial distri-\nbutions (see also Klessen et al. 2003). In the case of UMi, the\nnarrowness of the red giant branch (RGB) makes it more dif-\nficult to miss a dominant tail population in the outer parts; the\nweak age gradients identified by Carrera et al. (2002) do not\nmanifest themselves in the RGB. One might also worry that\nthe geometry of our WYFFOS pointings in UMi might miss\nthe areas dominated by the extratidal population. In fact, our\nouter pointings were aligned with the major axis of the stellar\ndistribution and completely sample the elliptical region with a\nsemimajor axis of 50\u0001.\n3.1.3. Two-population Models for dSph’s?\nIt is worth considering whether Draco and UMi might con-\ntain two kinematic populations: a hot, inner “bulgelike” com-\nponent surrounded by either a “disk” or a “halo” component.\nOne objection to this model is that populations with different\nspatial distributions must have formed under different condi-\ntions and would therefore not be expected to display such sim-\nilar stellar populations. However, it is possible that the weak\nage gradients seen in UMi and the differences in the spatial\ndistributions of blue and red horizontal branch stars in Draco\nindicate the presence of more than one old population (see,\ne.g., Harbeck et al. 2001).\nThe low projected velocity dispersion in the outer parts of\nboth Draco and UMi would appear to be consistent with the\nvertical velocity dispersion of a thin disk. However, in each\ncase the absence of an observed rotation signal across the face\nof the dSph implies that we must be observing the disk ap-\nproximately face-on. For the line-of-sight component of rota-\ntion to be smaller than our velocity errors, any disk would have\nto be aligned to within of face-on. This is in contradiction6\u0002\nwith the observed flattening of UMi, which suggests that any\nL24 WILKINSON ET AL. Vol. 611\ndisk must be close to edge-on. A pressure-supported halo pop-\nulation might be a more plausible candidate for the extratidal\npopulation. In Draco, the isopleths of the stellar density dis-\ntribution suggest that the extratidal population within about 50\u0001\nhas the same symmetry as the main body of the dSph. However,\nthe observed kinematics require that both populations be trun-\ncated in order to give projected dispersions for each population\nthat fall rapidly in the outer parts. For UMi, this model suffers\nfrom the additional difficulty of the significant flattening re-\nquired for both populations. If this is produced by anisotropy\nin the velocity distribution (rather than by the effects of external\ntides), it is at the extreme end of the range normally seen for\nflattened systems without rotation.\n3.2. Tidal Sculpting of Draco and UMi?\nA natural explanation for a break in the light distribution of\na Local Group dSph is to invoke the external tidal field pro-\nduced by the Milky Way. This perturbs the outer regions of\nall Galactic satellites leading to the escape of stars and the\nformation of tidal tails (e.g., J99). However, in the case of\nDraco and UMi there are two problems associated with this\nsimple scenario. First, for Draco our mass estimate interior to\nthe break radius in the light is M,, while for UMi it81# 10\nis M,. Flattening of the gravitational potential and82# 10\nvelocity anisotropy causes uncertainty in these masses by a\nfactor of ∼2. Both dSph’s seem sufficiently massive that, given\nany reasonable assumed Milky Way halo profile, their current\ntidal radii lie outside the observed light distribution. This sug-\ngests that neither Draco nor UMi is currently experiencing tidal\ndisturbance of its stellar distribution. Second, tidal effects typ-\nically result in the heating of stellar populations, and therefore\nthe velocity dispersion of the dSph’s is expected to rise in the\nregion that has been influenced by tides, in stark contrast to\nthe observed data.\nThe difficulties might be resolvable if the Galactic orbits of\nDraco and UMi are significantly elongated with pericenters\nsmaller than 20 kpc. For Draco, such an orbit is not inconsistent\nwith the observed space motion due to the large uncertainties\non the measured proper motion. The proper motion of UMi is\ncurrently better constrained (Schweitzer et al. 1997) and ap-\npears to rule out a deeply plunging orbit. However, a prelim-\ninary measurement of the proper motion based on Hubble\nSpace Telescope data with a 4 year baseline is consistent with\nan elongated orbit (S. Piatek 2004, private communication).\nDuring pericenter passages, the tidal radii of the dSph’s are\nsmaller than at their present locations. If a dSph passes close\nto the disk of the Milky Way, then the rapidly time-varying\ngravitational field disturbs its outer parts. This generates a\nheated population of stars at the edge of the dSph with an\ninflated velocity dispersion. If the orbit is further constrained\nto have a pericenter passage after the mild disk shock, then the\nheated extratidal population can drift away from the dSph.\nSubsequently, as the dSph moves out to its current location,\nthe tidal radius increases again, and the colder stars in the tidal\ntails that have not had sufficient time to escape during the\npericenter passage are recaptured. This results in a population\nthat has the morphological appearance of a tidal tail but is\nkinematically cold. It is also possible that the cold clump near\nthe center of UMi (Kleyna et al. 2003) is a projection of this\ncold extratidal population onto the face of the dSph.\nThis scenario places rather tight constraints on the properties\nof both Draco and UMi as well as on their possible Galacto-\ncentric orbits. First, their orbits must take them within 20 kpc\nof the Milky Way. Second, a simple estimate of their tidal radii\n(following, e.g., Kleyna et al. 2001) shows that even at this\nradius their tidal limits are large with respect to their stellar\npopulations unless their masses are below M,, which75# 10\nis at the lower limit allowed by the data. Third, their orbits\nmust spend sufficient time near pericenter to allow the stars\nthat have been most heated during the close passage to escape\nbefore the sphere of influence of the dSph engulfs them. We\nconclude that this scenario is plausible only if Draco and UMi\nhave somewhat lower masses than previously estimated and\nhave a low dark matter density outside about 30\u0001. Furthermore,\nboth dSph’s must be on deeply plunging orbits that take them\nclose to the disk of the Milky Way. We are currently performing\nN-body simulations to investigate this scenario in more detail.\nWe are very grateful to Slawomir Piatek for giving us access\nto his preliminary results on the orbit of UMi prior to publi-\ncation. M. I. W. acknowledges support from the Particle Physics\nand Astronomy Research Council. J. T. K. is supported by the\nBeatrice Watson Parrent Fellowship. The authors gratefully\nthank the staff of the Isaac Newton Group for help in acquiring\nthe data and Michael Odenkirchen for help with the Draco\ntarget list. We also thank the anonymous referee for useful\ncomments.\nREFERENCES\nBinney, J., & Tremaine, S. 1987, Galactic Dynamics (Princeton: Princeton\nUniv. Press)\nCarrera, R., Aparicio, A., Martı´nez-Delgado, D., & Alonso-Garcı´a, J. 2002,\nAJ, 123, 3199\nHarbeck, D., et al. 2001, AJ, 122, 3092\nIrwin, M., & Hatzidimitriou, D. 1995, MNRAS, 277, 1354\nJohnston, K. V., Choi, P. I., & Guhathakurta, P. 2002, AJ, 124, 127\nJohnston, K. V., Sigurdsson, S., & Hernquist, L. 1999, MNRAS, 302, 771\n(J99)\nKing, I. 1962, AJ, 67, 471\nKlessen, R. S., Grebel, E. K., & Harbeck, D. 2003, ApJ, 589, 798\nKleyna, J. T., Wilkinson, M. I., Evans, N. W., & Gilmore, G. 2001, ApJ, 563,\nL115\nKleyna, J. T., Wilkinson, M. I., Evans, N. W., Gilmore, G., & Frayn, C. 2002,\nMNRAS, 330, 792\nKleyna, J. T., Wilkinson, M. I., Gilmore, G., & Evans, N. W. 2003, ApJ, 588,\nL21\nKuhn, J. R., Kocevski, D., & Fleck, J.-J. 2004, in Satellites and Tidal Streams,\ned. F. Prada & D. Martinez-Delgado (San Francisco: ASP), in press (astro-\nph\/0309207)\nMartı´nez-Delgado, D., Alonso-Garcı´a, J., Aparicio, A., & Gomez-Flechoso,\nM. A. 2001, ApJ, 549, L63\nMateo, M. 1997, in ASP Conf. Ser. 116, The Nature of Elliptical Galaxies,\ned. M. Arnaboldi, G. S. Da Costa, & P. Saha (San Francisco: ASP), 259\nOdenkirchen, M., et al. 2001, AJ, 122, 2538\nPalma, C., Majewski, S., Siegel, M. H., Patterson, R. J., Ostheimer, J. C., &\nLink, R. 2003, AJ, 125, 1352\nSchlegel, D. J., Finkbeiner, D. P., & Davis, M. 1998, ApJ, 500, 525\nSchweitzer, A. E., Cudworth, K. M., & Majewski, S. R. 1997, in ASP Conf.\nSer. 127, Proper Motions and Galactic Astronomy, ed. R. M. Humphreys\n(San Francisco: ASP), 103\nStoehr, F. 2004, MNRAS, submitted (astro-ph\/0403077)\nStoehr, F., White, S. D. M., Tormen, G., & Springel, V. 2002, MNRAS, 335,\nL84\n"}