{"doi":"10.1109\/TIE.2010.2051399","coreId":"141171","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/6872","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/6872","10.1109\/TIE.2010.2051399"],"title":"A simple state-based prognostic model for railway turnout systems","authors":["Eker, Ömer Faruk","Camci, Fatih","Guclu, Adem","Yilboga, Halis","Sevkli, Mehmet","Baskan, Saim"],"enrichments":{"references":[{"id":37929215,"title":"A Digital Filter Based Approach to the Remote Condition Monitoring of Railway Turnouts, Reliability Engineering and System Safety, 92,","authors":[],"date":"2007","doi":"10.1016\/j.ress.2006.02.011","raw":"Marquez F. P. G., Schmid F., A Digital Filter Based Approach to the  Remote  Condition  Monitoring  of  Railway  Turnouts, Reliability Engineering and System Safety, 92, (2007), 830-840","cites":null},{"id":37929235,"title":"A fuzzy extension of the silhouette width criterion for cluster analysis”, Fuzzy Sets and Systems,","authors":[],"date":"2006","doi":"10.1016\/j.fss.2006.07.006","raw":"R.J.G.B.  Campello,  E.R.  Hruschka,  “A  fuzzy  extension  of  the silhouette  width  criterion  for  cluster  analysis”,  Fuzzy  Sets  and Systems, 157(21), 2858-2875, 2006 Omer Faruk Eker is M.Sc. student in Computer Engineering Department at  Fatih  University  and  works  as  a  research assistant  in  the  project  (108M275)  funded  by TUBITAK.  He  received  his  B.Sc.  degree  in Department  of  Secondary  School  Science  and Mathematics  Education  from  Marmara University  in  Istanbul,  Turkey.  His  research interests  include  failure  diagnostics  and prognostics  of  electro-mechanical  systems  by using Classification\/Clustering and Time Series Analysis techniques. Fatih  Camci  received  the  B.S.  degree  in  computer  engineering  from Istanbul University, Istanbul, Turkey, the M.S. degree  in  computer  engineering  from  Fatih University,  Istanbul,  and  the  Ph.D.  degree  in industrial  engineering  from  Wayne  State University,  Detroit,  MI.  He  is  an  Assistant Professor in computer engineering department at Meliksah  University.  He  worked  in  several projects  related  to  prognostic  health management in USA and Turkey.  His expertise includes  prognostics  health  management, intelligence  engineering  systems,  engineering optimization, and video processing. Adem Guclu is B.Sc. student in Computer Engineering Department at Fatih  University.  His  research  interests  include Artificial  Intelligence,  Machine  Learning,  Pattern Recognition,  Data  Mining  and  Web  Application Architectures and Development. Halis Yilboga was born in Van, Turkey in 1986. He is a B.Sc. student in Computer  Engineering  Department  at  Fatih University.  His  research  interests  include Artificial  Intelligence,  Machine  Learning, Natural  Language  Processing,  Pattern Recognition, and Distributed Systems. Mehmet  Sevkli  is  an  Assistant  Professor  in  Industrial  Engineering Department, Fatih University, Istanbul, Turkey. He received his B.S. in Industrial Engineering from  Sakarya  University,  his  M.Sc.  in Industrial  Engineering  from  Fatih  University and his Ph.D. in Industrial Engineering, from Istanbul  Technical  University.  His  research interests  include  Meta-heuristics  algorithms applied  to  the  combinatorial  optimization problem  and  Multi  Criteria  Decision  Making Methods. Saim  Baskan  is  an  Assistant  Professor  in  Electrical  Engineering Department at Fatih University. He received his Ph.D. in Engineering Science  from  Rensselaer  Polytechnic Institute in  New  York,  USA.  He  received his  M.S  degree  in  Electric  Power Engineering  from  Rensselaer  Polytechnic Institute.  He  received  his  B.S.  degree Electrical  Education  from  Gazi  University in Turkey. He has worked as Senior Project Engineer at Omega Advanced Solutions in New York, USA. He has been involved in mechanical  testing  system  design.  His expertise  includes  motor  control,  data acquisition, and sensor less motor control.","cites":null},{"id":37929218,"title":"A novel approach to fault diagnostics and prognostics,","authors":[],"date":"2003","doi":"10.1109\/robot.2003.1241660","raw":"C. Kwan, X. Zhang, R. Xu, L. Haynes, A novel approach to fault diagnostics  and  prognostics,  Proceedings  of  ICRA  '03:  IEEE International  Conference  on  Robotics  and  Automation.  1(3), September 2003, 604-609","cites":null},{"id":37929212,"title":"A Reliability centered approach to remote condition monitoring: A railway points case study,","authors":[],"date":"2003","doi":"10.1016\/s0951-8320(02)00166-7","raw":"Marquez F. P. G., Schmid F., Collado J. C., A Reliability centered approach to remote condition monitoring: A railway points case study, Reliability Engineering and System Safety, 80, (2003), 33-40","cites":null},{"id":37929182,"title":"A review on machinery diagnostics and prognostics implementing condition-based maintenance”,","authors":[],"date":"2006","doi":"10.1016\/j.ymssp.2005.09.012","raw":"A.K.S. Jardine, D. Lin, and D. Banjevic, “A review on machinery diagnostics  and  prognostics  implementing  condition-based maintenance”, Mechanical Systems and Signal Processing, vol.20, no. 7, 1483-1510, 2006","cites":null},{"id":37929221,"title":"A segmental hidden semi-Markov model (HSMM) -based diagnostics and prognostics framework and methodology,","authors":[],"date":"2007","doi":"10.1016\/j.ymssp.2006.10.001","raw":"M.  Dong,  D.  He,  A  segmental    hidden  semi-Markov  model (HSMM)  -based  diagnostics  and  prognostics  framework  and methodology,  Mechanical  Systems  and  Signal  Processing,  21, 2007, 2248-2266","cites":null},{"id":37929201,"title":"A.J.M.; A New Model-Based Technique for the Diagnosis of Rotor Faults in RFOC Induction Motor Drives,","authors":[],"date":"2008","doi":"10.1109\/tie.2008.2003365","raw":"Cruz, S.M.A.; Stefani, A.; Filippetti, F.; Cardoso, A.J.M.; A New Model-Based  Technique  for  the  Diagnosis  of  Rotor  Faults  in RFOC Induction Motor Drives, IEEE Transactions on Industrial Electronics,  55(12), 2008, 4218 - 4228","cites":null},{"id":37929197,"title":"Application of Speed and Load Torque Observers in HighSpeed Train Drive for Diagnostic Purposes,","authors":[],"date":"2009","doi":"10.1109\/tie.2008.928103","raw":"Guzinski, J.; Diguet, M.; Krzeminski, Z.; Lewicki, A.; Abu-Rub, H.; Application of Speed and Load Torque Observers in HighSpeed Train Drive for Diagnostic Purposes, IEEE Transactions on Industrial Electronics,  56(1), 2009, 248 - 256","cites":null},{"id":37929223,"title":"Autonomous diagnostics and prognostics in machining processes through competitive learningdriven HMM-based clustering,","authors":[],"date":"2009","doi":"10.1080\/00207540802232930","raw":"R.  B.  Chinnam,  P.  Baruah,  Autonomous  diagnostics  and prognostics in machining processes through competitive learningdriven  HMM-based  clustering,  International  Journal  of Production Research, 47 (23), 2009, 6739 – 6758","cites":null},{"id":37929188,"title":"Bin “ImpairedCooling-Condition Detection Using DC-Signal Injection for SoftStarter-Connected Induction Motors”,","authors":[],"date":"2009","doi":"10.1109\/tie.2009.2021588","raw":"Z.  Pinjia,  D.  Yi,  D.  Jing,  T.  G.  Habetler,  L.  Bin  “ImpairedCooling-Condition Detection Using DC-Signal Injection for SoftStarter-Connected  Induction  Motors”,  IEEE  Transactions  on Industrial Electronics, vol. 56 , no. 11, 4642 – 4650, 2009","cites":null},{"id":37929184,"title":"CostEffective Condition Monitoring for Wind Turbines”,","authors":[],"date":null,"doi":"10.1109\/tie.2009.2032202","raw":"Y. Wenxian, P. J. Tavner, C.J. Crabtree, M. Wilkinson, “CostEffective  Condition  Monitoring  for  Wind  Turbines”,  IEEE Transactions  on  Industrial  Electronics,  vol.  57  no.  1,  263-271,","cites":null},{"id":37929229,"title":"Detection and Diagnosis of Incipient Faults in Heavy Duty Diesel Engines”,","authors":[],"date":null,"doi":"10.1109\/tie.2009.2038337","raw":"I. Morgan; H. Liu; B. Tormos; A. Sala, ”Detection and Diagnosis of  Incipient  Faults  in  Heavy  Duty  Diesel  Engines”,  IEEE Transactions  on  Industrial  Electronics, doi:10.1109\/TIE.2009.2038337","cites":null},{"id":37929199,"title":"Diagnosis of Induction Machines' Rotor Faults in Time-Varying Conditions","authors":[],"date":"2009","doi":"10.1109\/tie.2009.2016517","raw":"Stefani,  A.;  Bellini,  A.;  Filippetti,  F.;  Diagnosis  of  Induction Machines'  Rotor  Faults  in  Time-Varying  Conditions  IEEE Transactions on Industrial Electronics, 56(11), 2009, 4548 – 4556","cites":null},{"id":37929177,"title":"Directive 2001\/12\/EC of the European Parliament and of the","authors":[],"date":"2001","doi":"10.1002\/9780470987391.app4","raw":"Directive  2001\/12\/EC  of  the  European  Parliament  and  of  the Council  of  26  February  2001  amending  Council  Directive 91\/440\/EEC  on  the  development  of  the  Community’s  railways Official, L75 of 15 March 2001, SIN 1012-9200","cites":null},{"id":37929178,"title":"Directive 2001\/13\/EC of the European Parliament and of the","authors":[],"date":"2001","doi":"10.1002\/9780470987391.app4","raw":"Directive  2001\/13\/EC  of  the  European  Parliament  and  of  the Council  of  26  February  2001  amending  Council  Directive 95\/18\/EC  on  the  licensing  of  railway  undertaking,  L75  of  15 March 2001, SIN 1012-9200","cites":null},{"id":37929179,"title":"Directive 2001\/14\/EC of the European Parliament and of the Council of 26","authors":[],"date":"2001","doi":"10.1002\/9780470987391.app4","raw":"Directive  2001\/14\/EC  of  the  European  Parliament  and  of  the Council  of  26  February  2001  amending  Council  Directive 91\/440\/EEC on the allocation of railway infrastructure capacity and the levying of charges for the use of railway infrastructure and safety certification, L75 of 15 March 2001, SIN 1012-9200","cites":null},{"id":37929214,"title":"Distributed quantitative and qualitative fault diagnosis: Railway junction case study,","authors":[],"date":"2002","doi":"10.1016\/s0967-0661(01)00159-9","raw":"C.  Roberts,  H.P.B.  Dassanayake,  N.  Lehrasab,  C.J.  Goodman: Distributed quantitative and qualitative fault diagnosis: Railway junction case study, Control Engineering Practice, 10(4), 2002, 419-429","cites":null},{"id":37929181,"title":"Failure analysis and diagnostics for railway trackside equipment,","authors":[],"date":"2007","doi":"10.1016\/j.engfailanal.2007.03.005","raw":"Fausto  Pedro  Garcia  Marquez,  Paul  Weston,  Clive  Roberts, Failure analysis and diagnostics for railway trackside equipment, Engineering Failure Analysis 14, 1411–1426, 2007","cites":null},{"id":37929216,"title":"Failure Diagnostics for Railway Point Machines Using Expert Systems &quot;,","authors":[],"date":null,"doi":"10.1109\/demped.2009.5292755","raw":"V.  Atamuradov,  F.  Camci,  S.  Baskan,  M.  Sevkli,  &quot;Failure Diagnostics for Railway Point Machines Using Expert Systems &quot;, The  7th  IEEE  International  Symposium  on  Diagnostics  for Electric Machines, Power Electronics & Drive, Cargese, France,","cites":null},{"id":37929219,"title":"Health-State Estimation and Prognostics in Machining Processes&quot;,","authors":[],"date":null,"doi":"10.1109\/tase.2009.2038170","raw":"Camci  F.,  Chinnam  R.  B.,  &quot;Health-State  Estimation  and Prognostics  in  Machining  Processes&quot;,  IEEE  Transactions  on Automation  Science  and  Engineering,  doi: 10.1109\/TASE.2009.2038170","cites":null},{"id":37929222,"title":"HMMs for diagnostics and prognostics in machining processes,","authors":[],"date":"2005","doi":"10.1080\/00207540412331327727","raw":"P. Baruah, P and R.B. Chinnam, R.B., HMMs for diagnostics and prognostics  in  machining  processes,  International  Journal  of Production Research, 43(6), 2005, 1275-1293","cites":null},{"id":37929227,"title":"Honghai Liu; Predicting Future States With n -Dimensional Markov Chains for Fault Diagnosis,","authors":[],"date":null,"doi":"10.1109\/tie.2008.2011306","raw":"Morgan,  I.;  Honghai  Liu;  Predicting  Future  States  With  n  -Dimensional  Markov  Chains  for  Fault  Diagnosis,  IEEE Transactions on Industrial Electronics, vol. 56 no. 5, 1774 – 1781,","cites":null},{"id":37929186,"title":"Induction Motor Diagnosis Using Line Neutral Voltage Signatures”,","authors":[],"date":"2010","doi":"10.1109\/tie.2008.2010209","raw":"A.  Khezzar,  M.  El  Kamel  Oumaamar,  M.    Hadjami,  M. Boucherma,  H.  Razik,  “Induction Motor  Diagnosis  Using  Line Neutral  Voltage  Signatures”,  IEEE  Transactions  on  Industrial Electronics, vol. 56 no. 11, 4581 - 4591, 2010","cites":null},{"id":37929196,"title":"Instantaneous Frequency of the Left Sideband Harmonic During the Start-Up Transient: A New Method for Diagnosis of Broken Bars”,","authors":[],"date":null,"doi":"10.1109\/tie.2009.2026211","raw":"M.  Pineda-Sanchez,  M.  Riera-Guasp,  J.A.  Antonino-Daviu,  J. Roger-Folch,  J.  Perez-Cruz,  R.  Puche-Panadero,  “Instantaneous Frequency of the Left Sideband Harmonic During the Start-Up Transient: A New Method for Diagnosis of Broken Bars”, IEEE Transactions on Industrial Electronics, vol. 56 no.11 4557 – 4570,","cites":null},{"id":37929180,"title":"Life cycle costs for railway condition monitoring,","authors":[],"date":"2008","doi":"10.1016\/j.tre.2007.12.003","raw":"Garcia Marquez, F., Lewis, W.R., Tobias, M.A., Roberts, C., Life cycle costs for railway condition monitoring, Transport Res. Part E., vol. 44 no. 6, 1175-1187, 2008","cites":null},{"id":37929211,"title":"Mechanical Health Assessment of a Railway Traction System,&quot;","authors":[],"date":"2008","doi":"10.1109\/melcon.2008.4618477","raw":"S. Hedayati Kia, H. Henao, G.A. Capolino, &quot;Mechanical Health Assessment of a Railway Traction System,&quot; Proceedings IEEEMELECON'08, Ajaccio (France), 5-7 May 2008, pp.453-458.","cites":null},{"id":37929203,"title":"Mechanical Transmission and Torsional Vibration Effects on","authors":[],"date":"2009","doi":"10.1109\/demped.2009.5292750","raw":"S.  Hedayati  Kia,  H.  Henao,  G.A.  Capolino,  &quot;Mechanical Transmission  and  Torsional  Vibration  Effects  on  Induction Machine  Stator  Current  and  Torque  in  Railway  Traction Systems,&quot; Conference Record of the 1st ECCE, San Jose (USA), 21-24 September 2009, vol. CD-ROM, pp. 3182-3187.","cites":null},{"id":37929233,"title":"Performance Evaluation of Some Clustering Algorithms and Validity Indices”","authors":[],"date":"2002","doi":"10.1109\/tpami.2002.1114856","raw":"U. Maulik, S. Bandyopadhyay, “Performance Evaluation of Some Clustering Algorithms and Validity Indices” IEEE Transactions on Pattern Analysis and Machine Intelligence, 24(12), 2002, 1650-1654","cites":null},{"id":37929187,"title":"R Rubini “Detection of Generalized-Roughness Bearing Fault by Spectral-Kurtosis Energy of Vibration or Current Signals”,","authors":[],"date":"2009","doi":"10.1109\/tie.2009.2025288","raw":"F. Immovilli, M. Cocconcelli, A. Bellini, R Rubini “Detection of Generalized-Roughness  Bearing  Fault  by  Spectral-Kurtosis Energy of Vibration or Current Signals”, IEEE Transactions on Industrial Electronics, vol. 56 no.11, 4710 – 4717, 2009","cites":null},{"id":37929217,"title":"Railway point Mechanisms: condition monitoring and fault detection,","authors":[],"date":null,"doi":"10.1243\/09544097jrrt289","raw":"Marquez  F.  P.  G.,  Roberts  C.,  Tobias  A.  M,  Railway  point Mechanisms:  condition  monitoring  and  fault  detection,  Proc. IMechE Vol. 223 Part F: Journal of Rail and Rapid Transit, doi: 10.1243\/09544097JRRT289","cites":null},{"id":37929231,"title":"Residual Life Predictions in the Absence of Prior Degradation Knowledge”,","authors":[],"date":"2009","doi":"10.1109\/tr.2008.2011659","raw":"N. Gebraeel, A. Elwany J. Pan, “Residual Life Predictions in the Absence of Prior Degradation Knowledge”, IEEE Transactions on Reliability, 58(1), 2009, 106-116","cites":null},{"id":37929225,"title":"Time–Frequency Analysis for Efficient Fault Diagnosis and Failure Prognosis for Interior Permanent-Magnet AC Motors”,","authors":[],"date":"2008","doi":"10.1109\/tie.2008.2007529","raw":"E.G.  Strangas;  S.  Aviyente;  S.  S.  H.  Zaidi,  “Time–Frequency Analysis for Efficient Fault Diagnosis and Failure Prognosis for Interior  Permanent-Magnet  AC  Motors”,  IEEE  Transactions  on Industrial Electronics, vol. 55 no. 12, 4191 – 4199, 2008","cites":null},{"id":37929209,"title":"Torsional Vibration Assessment in Railway Traction System Mechanical Transmission,&quot;","authors":[],"date":"2009","doi":"10.1109\/demped.2009.5292750","raw":"S. Hedayati Kia, H. Henao, G.A. Capolino, &quot;Torsional Vibration Assessment  in  Railway  Traction  System  Mechanical Transmission,&quot;  Proceedings  International  Symposium  on Diagnostics for Electrical Machines, Power Electronics & Drives (SDEMPED'2009),  Cargese  (France),  31  August-3  September 2009, vol. CD-ROM, 7 pages.","cites":null},{"id":37929189,"title":"Torsional Vibration Effects on Induction Machine Current and Torque Signatures in GearboxBased Electromechanical System”","authors":[],"date":"2009","doi":"10.1109\/tie.2009.2026772","raw":"S. H. Kia, H. Henao, G. A. Capolino, “Torsional Vibration Effects on Induction Machine Current and Torque Signatures in GearboxBased  Electromechanical  System”  IEEE  Transactions  on Industrial Electronics, vol. 56, no.11, 4689 – 4699, 2009","cites":null},{"id":37929213,"title":"Unobserved component models applied to the assessment of wear in railway points: A case study.,","authors":[],"date":"2007","doi":"10.1016\/j.ejor.2005.10.037","raw":"Marquez  F.  P.  G.,  D.  J.  P.  Tercero,  Schmid  F.,  Unobserved component models applied to the assessment of wear in railway points: A case study., European Journal of Operation Research, 176 (2007), 1703-1712","cites":null},{"id":37929220,"title":"Z.J.; Chunting Mi; Hongjie Wu; Garg, V.K.; Prognostic and Warning System for Power-Electronic Modules in Electric, Hybrid Electric, and Fuel-Cell Vehicles,","authors":[],"date":"2008","doi":"10.1109\/tie.2008.918399","raw":"Yali Xiong; Xu Cheng; Shen, Z.J.; Chunting Mi; Hongjie Wu; Garg, V.K.; Prognostic and Warning System for Power-Electronic Modules  in  Electric,  Hybrid  Electric,  and  Fuel-Cell  Vehicles, IEEE Transactions on Industrial Electronics, 55(6),  June 2008, 2268 - 2276","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-05-31T00:00:00Z","abstract":"The importance of railway transportation has been increasing in the world.\nConsidering the current and future estimates of high cargo and passenger\ntransportation volume in railways, prevention or reduction of delays due to any\nfailure is becoming ever more crucial. Railway turnout systems are one of the\nmost critical pieces of equipment in railway infrastructure. When incipient\nfailures occur, they mostly progress slowly from the fault free to the failure\nstate. Although studies focusing on the identification of possible failures in\nrailway turnout systems exist in the literature, neither the detection nor\nforecasting of failure progression has been reported. This paper presents a\nsimple state-based prognostic method that aims to detect and forecast failure\nprogression in electro-mechanical systems. The method is compared with Hidden\nMarkov Model based methods on real data collected from a railway turnout system.\nObtaining statistically sufficient failure progression samples is difficult\nconsidering that the natural progression of failures in electro-mechanical\nsystems may take years. In addition, validating the classification model is\ndifficult when the degradation is not observable. Data collection and model\nvalidation strategies for failure progression are also presented","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/141171.pdf","fullTextIdentifier":"https:\/\/dspace.lib.cranfield.ac.uk\/bitstream\/1826\/6872\/1\/Railway_Turnout_Systems-2009.pdf","pdfHashValue":"39e8b4f9e91583944bdc5024c7a3177bea8120ad","publisher":"IEEE Institute of Electrical and Electronics","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/6872<\/identifier><datestamp>2016-02-24T10:02:36Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>A simple state-based prognostic model for railway turnout systems<\/dc:title><dc:creator>Eker, Ömer Faruk<\/dc:creator><dc:creator>Camci, Fatih<\/dc:creator><dc:creator>Guclu, Adem<\/dc:creator><dc:creator>Yilboga, Halis<\/dc:creator><dc:creator>Sevkli, Mehmet<\/dc:creator><dc:creator>Baskan, Saim<\/dc:creator><dc:subject>Fault Diagnosis, Diagnostic expert system, Failure Analysis, Rail transportation\nmaintenance, Forecasting, Prognostics, Remaining useful life estimation, Railway\nTurnouts, Time Series<\/dc:subject><dc:description>The importance of railway transportation has been increasing in the world.\nConsidering the current and future estimates of high cargo and passenger\ntransportation volume in railways, prevention or reduction of delays due to any\nfailure is becoming ever more crucial. Railway turnout systems are one of the\nmost critical pieces of equipment in railway infrastructure. When incipient\nfailures occur, they mostly progress slowly from the fault free to the failure\nstate. Although studies focusing on the identification of possible failures in\nrailway turnout systems exist in the literature, neither the detection nor\nforecasting of failure progression has been reported. This paper presents a\nsimple state-based prognostic method that aims to detect and forecast failure\nprogression in electro-mechanical systems. The method is compared with Hidden\nMarkov Model based methods on real data collected from a railway turnout system.\nObtaining statistically sufficient failure progression samples is difficult\nconsidering that the natural progression of failures in electro-mechanical\nsystems may take years. In addition, validating the classification model is\ndifficult when the degradation is not observable. Data collection and model\nvalidation strategies for failure progression are also presented.<\/dc:description><dc:publisher>IEEE Institute of Electrical and Electronics<\/dc:publisher><dc:date>2012-01-23T23:03:25Z<\/dc:date><dc:date>2012-01-23T23:03:25Z<\/dc:date><dc:date>2010-05-31T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Omer F. Eker, Fatih Camci, Adem Guclu, Halis Yilboga, Mehmet Sevkli, Saim Baskan, A simple state-based prognostic model for railway turnout systems, IEEE Transactions on Industrial Electronics, Volume 58, Issue 5, 2011, Pages 1718 - 1726.<\/dc:identifier><dc:identifier>0278-0046<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1109\/TIE.2010.2051399<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/6872<\/dc:identifier><dc:language>en_UK<\/dc:language><dc:rights>© 2011 IEEE. Personal use of this material is permitted. However, permission to reprint\/republish this material for advertising or promotional purposes or for creating new collective works for resale or redistribution to servers or lists, or to reuse any copyrighted component of this work in other works must be obtained from the IEEE.”<\/dc:rights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0278-0046","0278-0046"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Fault Diagnosis, Diagnostic expert system, Failure Analysis, Rail transportation\nmaintenance, Forecasting, Prognostics, Remaining useful life estimation, Railway\nTurnouts, Time Series"],"subject":["Article"],"fullText":" Abstract – The importance of railway transportation has \nbeen increasing in the world. Considering the current and \nfuture estimates of high cargo and passenger transportation \nvolume in railways, prevention or reduction of delays due to \nany failure is becoming ever more crucial. Railway turnout \nsystems are one of the most critical pieces of equipment in \nrailway infrastructure. When incipient failures occur, they \nmostly progress slowly from the fault free to the failure state. \nAlthough studies focusing on the identification of possible \nfailures in railway turnout systems exist in the literature, \nneither the detection nor forecasting of failure progression \nhas been reported. This paper presents a simple state-based \nprognostic method that aims to detect and forecast failure \nprogression in electro-mechanical systems. The method is \ncompared with Hidden Markov Model based methods on \nreal data collected from a railway turnout system. Obtaining \nstatistically sufficient failure progression samples is difficult \nconsidering that the natural progression of failures in \nelectro-mechanical systems may take years. In addition, \nvalidating the classification model is difficult when the \ndegradation is not observable. Data collection and model \nvalidation strategies for failure progression are also \npresented.   \n \nIndex Terms—Fault Diagnosis, Diagnostic expert system, \nFailure Analysis, Rail transportation maintenance, \nForecasting, Prognostics, Remaining useful life estimation, \nRailway Turnouts, Time Series \nNOTATION \nφ  : Constant in exponential degradation model \nβ\n : Random variable following s-normal distribution \nβµ  : Mean of β  \n2\nβσ  : Variance of β  \nλ  : HMM Model \npi  : Initial probabilities of HMM \nl\njiA ,  : Transition probability from state i  to j in level l  \nB  : Observation probability distributions \nCH : Calinski-Harabasz cluster validity index \ncn  : Number of samples clustered in cluster c \ncz  : Center of cluster c \nz  : Center of all clusters \nix  : Time series data sample i \nk  : Number of clusters  \nI. INTRODUCTION \nIt is now an obligation to improve reliability, \navailability, and safety of railway systems to \naccommodate increasing passenger and cargo \ntransportation with higher train speeds, greater axle loads, \nand increased service frequency. According to a report of \nthe European Commission, the passenger and cargo \ntransportation volume in European railways are expected \nto double and triple respectively in 2020 [1]-[5]. It is \nobvious that this demand increase cannot be satisfied with \nonly building new railways; the efficiency of existing and \nnew railways should be increased. This could be achieved \nwith minimum cost by increasing the availability of \nrailways, which is directly related with repair and \nmaintenance frequency.  \nBritain’s railway infrastructure operator, Network Rail, \nwas responsible for approximately 14 million minutes of \ntrain delay in 2002-2003, costing approximately 560 \nmillion GBP [5]. Railway turnout systems are the main \ncomponent of railway infrastructure that affects the \navailability of the system [6]. For example in England, 3.4 \nmillion GBP is spent every year for the maintenance of \nturnout systems for 1000 km of railways [6]. Condition-\nBased Maintenance (CBM), in which the health of the \nmachine is observed in real time and maintenance \ndecisions are based on the current and forecasted machine \nhealth, increases system availability, reliability and safety \nwhile reducing operating and support costs [7]-[8]. Thus, \nthe application of CBM on railway turnout systems has \ncritical importance for increasing the efficiency of \nrailways.  \nDiagnostics and prognostics are the two main \ncomponents of CBM [7]. Diagnostics, the process of \nidentifying the failure, is basically a classification \nproblem; prognostics, the prediction of the failure time of \nthe component with an incipient failure, is a forecasting \nproblem. Various diagnostic methods have been presented \nin the literature for many diverse industrial systems [9] -\n[14]. Diagnostic methods on various components of the \nrailway and train have also been reported [15]-[20].  \nThere are three main approaches in the literature for \ndiagnostics on turnout systems: feature-, model- and \nempirically-based methods. In the first approach, special \nfeatures that help to identify the failures are defined. For \nexample in [21], three features (i.e., irregularity, location \nof maximum point, and symmetry) are defined in the time \nseries data. These features are obtained by analyzing the \nabsolute difference between the reference and actual \nsignals. The reference signal is collected from a fault-free \nsystem. The absolute difference is in the form of a time \nseries-like reference. Irregularity is defined as an \nunexpected bump in the absolute difference. The location \nA Simple State-Based Prognostic Model for \nRailway Turnout Systems \nOmer F. Eker, Fatih Camci, Member, IEEE, Adem Guclu, Halis Yilboga, Mehmet Sevkli, Saim \nBaskan, Member, IEEE \n   Manuscript received December 25, 2009; revised received March 26, \n2010. First published XXXX; current version published XXXX. This \nresearch was supported by The Scientific and Technological Research \nCouncil of Turkey (TUBITAK) under project number 108M275. \n \n   Omer Faruk Eker, Adem Guclu, and Halis Yılboga are students at Fatih \nUniversity, Istanbul Turkey. (omerfarukeker@hotmail.com, \nademguclu@live.com, halis65@gmail.com). Fatih Camci is with Meliksah \nUniversity, Kayseri Turkey (fcamci@meliksah.edu.tr). Mehmet Sevkli and \nSaim Baskan are with Fatih University, Istanbul, Turkey. \n(msevkli@fatih.edu.tr, sbaskan@fatih.edu.tr). Copyright (c) 2009 IEEE. \nPersonal use of this material is permitted. However, permission to use this \nmaterial for any other purposes must be obtained from the IEEE by sending \na request to pubs-permissions@ieee.org. \n  \nof the maximum point is compared with the maximum \npoint location in the reference data. The symmetry of the \nabsolute difference of the left and right sides of the \nmaximum point location is used as the third feature.  \nIn model-based approaches, a model is defined to \ncharacterize the system. Deviation from the model is \ndefined as failure and identified as the difference between \nthe model outcome and actual data. Various methods may \nbe applied. In [22], the unobserved component model, in \nwhich an observable variable is written as a function of \nseveral unobservable components, is used. In [23], \nparameters like velocity and air volume are expressed as \npolynomial functions of pressure in a pneumatic turnout \nsystem. Thus, the difference between the actual velocity \nand\/or air volume and their expected values for a given \npressure identifies the failure.  \nIn empirically-based approaches, a fault-free sample is \nconsidered as a reference signal, and failures are \nidentified based on the resemblance of a given signal to \nthe reference signal. The Kalman filter is used in [24] for \nnoise removal and failure identification based on a \nreference signal. Ref. [25] presents an expert system for \nfailure identification using resemblance to the reference \nsignal. The resemblance is quantified using simple \nEuclidian distance and dynamic time warping approaches. \nA good review for failure detection methods for railway \nturnouts is given in [26]. \nFailure diagnosis is an important task; however, it only \naims to stop (and schedule a maintenance\/repair) the \nsystem when a failure is identified or let the system \ncontinue to work otherwise. Incipient failures progress \nslowly [27]. This progression starts from the fault free \nstate and ends at the failure state [28]. The system \nfunctions properly and does whatever is expected (albeit \nmaybe with decreasing efficiency) until reaching the \nfailure state. It is obvious that the detection of failure \nprogression is more valuable than its detection after the \nfailure reaches to a point. In addition, it is a prerequisite \nfor prognostics [28], [29].  \nStudies of prognostics for different systems have \nappeared in the literature in recent years. Prognostic \nmethods can be separated into three categories: \nevolutionary, degradation prediction, and state-based \nprognostics [8]. Evolutionary prognostics involves \ntrending features until a predefined threshold, whereas the \ndegradation calculated with features is predicted with \nstatistical and computational methods in the degradation \nprediction based prognostics [8]. In the last category, the \nstates representing the failure progression are detected and \nforecasted. \nHidden Markov Models (HMMs) have been used as \nstate-based prognostics in [28], [30]-[34] with different \napplication areas such as drilling processes, pump \nsystems, and AC motors. The life of a drill-bit is \nrepresented by health states, each of which is modeled as \na single HMM in [31]-[32]. Health state of a drill-bit is \nidentified with the HMM with highest likelihood value \ngiven the observed time series signal. In standard HMM, \ntransition from one state to another is independent of time \nspent in the current state. This assumption is not true in \nfailure degradation applications and it is relaxed in [30] \nwith semi-Markov concept.  \nIn [28], health states are represented as the top state of \nHierarchical HMM, rather than a distinct HMM as in [28], \n[31], [32]. Monte-Carlo simulation with health state \ntransition probabilities is used in [28] to calculate the \nremaining useful life (RUL). In [33], frequency and \nseverity of noncatastrophic faults are used to detect RUL \nof an electric drive. Four methods have been used for fault \ndetection and HMM based framework is presented for \nprognostics. Second order HMM, in which states depend \non the two previous states, is used for prediction of health \nstates in [34]. In [35], concentration of lubrication \nsamples is used to identify the abnormality in diesel \nengines. Then, a belief network created with expert \nknowledge is used for prognostics. \nThis paper presents a simple state-based prognostic \n(SSBP) method that aims to detect and forecast failure \nprogression in electro-mechanical systems. The method is \ncompared with HMM-based methods using real data \ncollected from a railway turnout system. Failures in \nelectro-mechanical systems mostly occur slowly, and it \nmay take months\/years for a failure to occur. Thus, \nobtaining statistically sufficient samples from the fault-\nfree state to the failure state may require a very long time. \nIn addition, the validation of classification methods \nrequires knowing the real failure progression states. \nHowever, observing the real failure progression states is \nvery difficult, if not impossible, in most systems [28]. \nThis paper also presents a solution to these problems. The \nmain contributions of this paper can be summarized as \nfollows: \n1. Presenting a simple state-based prognostic method and \nits comparison with HMM-based prognostics;  \n2. Application of presented (SSBP) and HHM-based \nprognostics methods in a railway turnout system; \n3. Presenting a data collection strategy for slowly \ndeveloping failures to model the real failure progression; \n4. Proposing a strategy to validate the state estimation \nmethod without knowing the real failure progression \nstates.  \nThe organization of the paper is as follows: section II \ngives the details of a turnout system, section III presents \nthe modeling structure, section IV gives experiments and \nresults with real data collected from a turnout system, and \nsection V concludes the paper.  \n \n \nFig. 1. Railway tracks to be moved by a turnout system \n II. RAILWAY TURNOUT SYSTEM\nRailway turnout systems allow trains to change their \ntracks by moving the rails before the train passes\nin Fig 1. The turnout system, which is a form of single \nthrow mechanical equipment, is run by a motor as shown \nin Fig 2.  There exist different types of railway turnouts \nbased on motor working principle, such as electro\nmechanic, hydraulic, and pneumatic. The m\nthe blades\/switches in two directions, called normal and \nreverse. This movement takes several seconds. Once the \nmovement is completed, the switches are locked in their \nposition. It is claimed that the turnout systems are the \nof the most important component of the railway \ninfrastructure, and there exist examples of accidents \ncaused by turnout failure [6]. This paper focuses on \nelectro-mechanic turnout systems, which consist of \nmotor, reduction gear, several bearings, drive\nrods, switches etc.  \n \nFig. 2.  A railway turnout system \nIII. MODELING STRUCTURE \nThis section includes two sub-section\nprogression modeling and a simple state-based prognostic \nmethod.  \nA. Failure Progression Modeling  \nElectro-mechanical failures mostly occur slowly\nfollowing a degradation path [36]. It is easy to understand \nthe difficulty of obtaining statistically sufficient\nprogression samples, considering that a failure may \nprogress for several months to years in real systems\nThere are two ways to overcome this problem: 1) using \nprototypes for data collection or 2) creating the failure \nprogression unnaturally.  \nThe prototypes are created with vulnerable materials\nand operating conditions are set so that the failure \nprogresses faster than normal [28], [31]-[32\nthin drill-bits or preventing the proper functioning of \ncooling systems are some examples used in the literature \n[28]. Although this approach may be applicable for simple \ncomponents like a drill-bit, it is difficult to obtain an \nacceptable prototype to represent something complex like \n \n, as seen \n-\notor moves \none \na \n-detection \n \ns: failure \n, \n failure \n. \n, \n]. Choosing \na turnout system. In such a complex system, the failure \nprogression should be created unnaturally. \nThe exponential degradation model \nprior information about degradation \nused in this paper and formulated \ndegradation paths for samples as shown in Fig. \nobtained using this formula. Then, \ndefined as the point where the degradation reaches a \nthreshold, providing various lifetimes for multiple turnout \nsystems. The degradation level is divided into several \ngroups as illustrated with dashed horizontal lines\nfigure. Each group is defined as a state in the failure \nprogression. The time spent in a state \nlength of the x-axis (time) of the degradation \nwhen the y-axis falls in that state.  \n( ) ( ) \n\n\n\n\n\n−+\n=\n2\n2σ\nεβ\nφ ii\ntt\ni etS\n  \nFig. 3.  Failure degradation and discrete health states\nAfter obtaining the life and the time \nfor all samples, the data can be collected by creating the \nfailure progression states unnaturally. This could be the \nsize of a crack, how loose a screw has become\nof wear and tear, or dryness level in the slide chair \nturnout system. When the failure progression\nunnaturally, the data that can be used as representative of \nthat state in different turnout systems\nB. Simple State-Based Prognostics Method\nThe presented method (SSBP) includes three steps\nillustrated in Fig. 4: clustering, cluster \nexpected RUL calculation. For clustering, data from \ndifferent health states of multiple systems are clustered \nusing any clustering method. k-means \nthis paper due to its simplicity and effectiveness. \nHowever, SSBP is independent of the \nFig. 4. Prognostics s\nIn clustering, the best number of clusters for the given \ndataset should be identified. In k-\nnumber of clusters (k) should be given\nclassification problems parameters can be optimized using \nTraining \nSamples \nClustering \nTransition \nProbability \nCalculation \nTrained \nModel \nExpected RUL \nCalculation \n \n \nfor systems with no \npresented in [36] is \nas in (1). The \n3 are \nthe failure time is \n in the \ncorresponds to the \npath (signal) \n        (1) \n \n \nspent in each state \n, the level \nof the \n is created \n, are collected. \n \n, as \nevaluation, and \nthe \nclustering is used in \nclustering method.  \n \nteps \nmeans clustering, the \n.  Although in \nCluster \nevaluation \nBest number of \nhealth states \nExpected  \nRUL \n  \nclassification accuracy, clustering problems require \ndifferent evaluation parameters because the real number \nof clusters and samples that belong to real clusters are not \nknown. Several cluster validity indexes have been \nproposed in the literature [37],[38]. Silhouette, Davies-\nBouldin, Calinski-Harabasz, Dunn, C-index, Krzanowski-\nLai, and several other indexes are implemented, and \nCalinski-Harabasz (CH) is chosen as the most robust one \nfor the dataset used in this paper. The formulation of CH \nindexes is given in (2).  \n2 2\n1 1 1\/\n1\nck k n\nc c i cc c i\nn z z x z\nCH\nk n k\n= = =\n   \n− −\n   =\n− −      \n∑ ∑ ∑\n(2) \nThe cluster validity index gives the optimal number of \nclusters and health states in our problem. In a failure \nprogression problem, it is very difficult, if not impossible, \nto observe the health states the system goes through and to \nknow their total number. Thus, clustering and validity \nindexes are used to identify the number of health states.  \nAfter the current health state of a given system is \nidentified using clustering, the remaining useful life is \nforecasted as illustrated in Fig. 5. The expected RUL is \ncalculated using the transition probabilities between \nhealth states as shown (3). The transition probability is the \nprobability of the current health state to change. The \nresults of the k-means clustering are used to identify these \nprobabilities. k number of clusters and the number of \ntransitions from one cluster to another are found with all \ntraining samples. For example, assume three turnout \nsystems with health states numbered sequentially from 1 \nto 4 (from the brand new to the failure state) as shown in \nTable 1. Each row shows the progression in health states \nfor a turnout system. The three turnout systems fail after \n13, 10, and 9 time units. A total of twelve transitions from \nstate 1 (transition to state 2 after 4, 6, and 2 time steps, \nstate 1 otherwise) have happened in three turnouts. \nBecause three state transitions out of twelve from state 1 \nhave happened to state 2, the transition probability from \nstate 1 to state 2 is initialized as 3\/12. Similarly, the state \ntransition probability from state 1 to state 1 (state 3) is \ninitialized as 9\/12 (0\/12). Other transition initialization \nvalues are calculated similarly.  \nThe current health state of the system is represented by\n \nch in (3) and is obtained using the clustering method. \nNote that the ∞ in the formula is represented as the RUL \nupper limit in the SSBP. As the upper limit increases, the \napproximation of the RUL improves. The probability of \nthe RUL of each value between 1 and the RUL upper \nlimit is calculated one by one. For a given RUL, there \nexist many different combinations of possible health \nstates. For example, if the RUL is given as 5 with 3 health \nstates, the combinations are as follows: 3 1 1 (i.e., 3 time \nunit in state 1, and 1 time unit in state 2 and state 3), 2 2 1, \n2 1 2, 1 3 1, 1 2 2, and 1 1 3. The number of combinations \nincreases exponentially with the number of health states. \nTo handle the computations, transitions are only allowed \nfrom a health state to itself or to a consecutive state.  \nThus, a state cannot jump to second, third, and so on, \nconsecutive health states directly. The probability of \nstaying in a health state n for \nnst  times means that the \nhealth state transitions to itself 1−nst times and \ntransitions to the consecutive health state one time. The \ncalculation is given in (6). \n[ ] ( )∑\n∞\n=\n==×==\n1\n||\ni\ncc hstirulPihstRUL   (3) \n( ) ( )∏\n=\n====\nfail\nhn\nnn ststayPhstiRULP |  (4) \nist\nfail\nhn\nn =∑\n=\n            (5)     \n        \n( ) ( )nnstnnnn qqststayP n ,1, 1−== −      (6)    \n The Monte Carlo simulation with HMM used in [28] \ndoes not make the assumption of transition of a state only \nto itself or the consecutive state. However, SSBP removes \nsome of the complications of HMM. The results of SSBP \nare compared with those of HMM-based prognostics in \nsection IV. The following subsection discusses the details \nof Hierarchical Hidden Markov Models (HHMM).  \n \nFig. 5. Flow chart of RUL calculation \nrul=1, expRul=0 \nTransition probabilities between \nstates \nSelect a RUL upper limit \nFind all combinations of time \nspent in all states when remaining \nuseful life is equal to rul \ni=1, prob(rul)=0 \nSelect i th combination \nCalculate probability of i th \ncombination (pi) \nprob(rul)= prob(rul)+pi \nCombinations \nfinished \nrul=rul+1 \n \nrul< RUL \nupper limit \nexpRul=expRul+rul* prob(rul) \ni=i+1 \nNo \nYes \nexpRul \n  \nC. Hierarchical Hidden Markov Model \nThe Hierarchical HMM (HHMM) is a version of the \nHidden Markov Model (HMM) designed to model \nhierarchical structures for sequential data. The simplest \nHHMM includes two hidden layers; the state in the top \nhidden layer is considered to be a self-contained \nprobabilistic model. In other words, in the simplest \nHHMM, each state in the top layer  is itself an HMM. The \nobserved state is affected by both nodes in the top and low \nhidden layer in any given time frame. The states in the top \nhidden layer represent the health states of the turnout \nsystem, whereas states in the low hidden layer represent \nthe state of the movement of the rails. In other words, the \nlow level states show the location of the rail during the \nback and forth movement of the rail. Readers are referred \nto [8] and [28] for the details of HHMM.  \nInitialization of HHMM  \nAn HHMM model is represented as λ  ( ( ), ,A Bλ pi= ) \nand includes parameters of initial probabilities ( pi ), \ntransition probabilities ( A ), and observation probability \ndistributions ( B ). The following paragraphs discuss the \ninitialization of parameters in an HHMM. \n Initial probabilities ( pi ) exist for two hidden variables: \ntop and sub-hidden states. Top hidden states represent the \nhealth state of the turnout system. The initial probability \nof a top state is the probability of a turnout system to be in \na given health state for the first usage or after \nmaintenance\/repair. This is always 1 for a brand new state \n(and also after maintenance assuming perfect \nmaintenance) and 0 for other states. The data collected \nduring the movement of the rails with force generated by \nthe turnout system is in the form of a time series and \nconsists of several states (i.e., sub-states). The initial \nprobability of a sub-state is the probability of sub-states in \nthe beginning of the movement. In our experiments, the \ninitial probabilities are assumed to be 1 for the first top \nand sub-states and 0 for the other states. That is, the \nperfect maintenance assumption is made, and all turnout \nmovements are assumed to start from the same sub-state.  \n \nTable 1. Turnout health states progression examples \nThe top state transition probabilities are initialized \nusing the transition probabilities obtained using k-means \nclustering as discussed above. The other transition \nprobability parameter is the probability of the current sub-\nstate to change. To initialize this parameter, the time \nseries data collected during the rail movement are divided \ninto equal number of successive groups: s that also is the \nnumber of sub-states. Then 2\n, jiA  is initialized as follows: \nsA ii \/1\n2\n1, =+ , sA ii \/11\n2\n,\n−= , and 02\n,\n=jiA  ji,∀   \nji ≠  and 1+≠ ij .  \nThe last parameter to be initialized is the observation \nprobability distribution parameter, \n ,i jB , which represents \nthe distribution parameters of the observed parameter \nunder health state i  and sub-state j . To initialize\n ,i jB , \nthe data points that are collected from a turnout system \nwith each health state and sub-state are categorized. The \ndata from all of the h s×  categories are obtained, where \nh  and s  are the number of health and sub-states, \nrespectively. Then, the distribution parameters (i.e., mean \nand standard deviation) of the data in each category are \ncalculated and used as initialization values for\n ,i jB .   \nIV. EXPERIMENT & RESULTS \nThe presented method (SSBP) is applied to data \ncollected from a turnout system of the Turkish State \nRailways located in Babaeski, Tekirdag. The following \nsubsections discuss the data collection, failure \nprogression, and results of the SSBP.  \nA. Data Collection \nThe system used for data collection is an electro-\nmechanical type turnout with two drive rods, one for each \nrail. Nine sensors were installed in the turnout system: \ntwo force sensors for each drive rod, one current, two \nvoltage (separate sensors for forward and backward \nmovement), two proximity sensors for each rail and two \nlinear rulers for each drive rod. The most commonly used \nsensors in the literature are current and force sensors [24]. \nForce sensors are electrical sensing devices that are used \nto measure tension and compression forces. Tension cells \nare used for measuring a straight-line force \"pulling apart\" \nalong a single axis; the force is typically denoted as \npositive.  Compression tension cells are used for \nmeasurement of a straight-line force \"pushing together\" \nalong a single axis; the force is typically annotated \nas negative. Current sensors measure DC current levels. \nThey receive current inputs and provide outputs as analog \nvoltage signals, analog current levels, switches, or audible \nsignals. Voltage sensors are used to measure voltage in \nelectric circuits. Proximity sensors measure the distance \nbetween the stock rail and switch rail of railway turnout \nsystems. A linear position measuring sensor is installed on \nstretchers of the turnout system and measures the linear \nposition of the switch rails. Time series data are acquired \nfrom both normal to reverse and reverse to normal \nmovements of a turnout system. Figs. 6 shows the sensors \ninstalled in turnout system.  \nB. Failure Progression Mechanism  \nThere are multiple failure modes in a turnout system. \nThe dry slide chair failure mode is the most frequently \noccurring failure in turnout systems [22]. Slide chairs are \nthe metal platforms installed on twelve wooden traverses, \non which the rail is located, as illustrated in Fig. 7. Slide \nchairs are oiled periodically and in a fault-free system \nthese slide chairs are oily.  \nSwitch rails move back and forth on the slide chairs on \nthe twelve traverses.  They move around 17.5 cm on the \nslide chair located on the traverse closest to the turnout \nsystem. As the traverse gets far away from the turnout \nsystem, the movement on that traverse gets smaller. When \ndry\/contaminated slide chair failure modes occur, the \nfriction in the slide chair increases, leading to increased \nforce in the force sensors and changes in voltage and \ncurrent signals in the motor. In addition, the time to \ncomplete the movement may increase.  \n  \nThe failure progression from the fault-free health state \nto the failure health state is modeled using the exponential \ndegradation mentioned. The natural progression of the \nfailure mode occurs over a long period of time due to \nweather and environmental effects. Thus, it is not practical \nto wait and observe the natural progression of the failure \nmode. In addition, if the failure progresses naturally, the \nobservation of health states becomes very difficult, if not \nimpossible. In this work, the progression of the dry slide \nchair failure mode is modeled. \n \nFig. 6. Sensors used for data collection installed in turnout systems \n \nFig. 7. Modeling the Dry\/Contaminated Slide Chair Failure Mode \nThe failure state is defined as the state when all twelve \nslide chairs are dry or contaminated. The slide chairs have \nnot been lubricated for a long time to obtain the failure \nstate. The data from the failure state are collected. Then, \nthe slide chairs in the three farthest traverses from the \nturnout system are oiled, and data are collected. Then, the \nnext farthest traverse is oiled, and data are collected. The \noiling and collection of data is repeated one by one from \nthe farthest to the closest slide chairs of the turnout system \nuntil all slide chairs are oiled.  All of the slide chairs are \noily in the final state, which represents the fault-free state. \nThis is achieved in ten steps, each step representing a \nhealth state in the failure progression. As a result, many \nsamples from ten health states are obtained. At this point, \nthe life of a turnout system and the time spent in each \nhealth state in the failure progression are obtained using \nexponential degradation modeling with the following \nparameters: 1=φ , 8.0=βµ\n, \n1.0=βσ .  \nAn example of current and force signals among ten \nturnout systems that progress from fault-free to failure \nstates with various lives is shown in Fig 8. As seen from \nthis figure, 13 samples are collected from this turnout \nsystem from fault-free to failure state. In other words, its \nlife is 13 units. One can observe the change in the current \nand force signals as the failure progresses.   \nThis paper uses only the dry slide chair failure mode for \nthe case study and all other conditions, such as operating \nconditions and wear in the components of the turnout \nsystem, are assumed to remain constant. This is a \nreasonable assumption because all the data are collected in \none day, and the dry slide chair failure mode is obtained \nunnaturally as mentioned above.   \n \n \nFig. 8. a) Current b) Force signals with failure \nprogression from ‘fault free’ state to ‘close to failure’state \nC. Results  \nThe samples are divided into training and testing \ngroups, with 80% of the samples in the training and the \nrest in the testing group. The training data are clustered \nusing the number of clusters from two to ten, and the CH \ncluster validity index is calculated and displayed in Fig. 9. \nThe maximum of the evaluation function (which indicates \nthe best number of clusters found) occurs at eight clusters. \nThus, failure progression should be modeled with eight \nhealth states. Note that when the failure progression was \nmodeled, ten unnatural health states were used. When \nanalyzing the health state clustering results, it is observed \nthat health states 8, 9, and 10 are combined into one \nhealth state. This is logical considering the variance \nincrease in the states close to failure. However, the best \nhealth state number found will be checked with \n0 50 100 150 200 250 300\n-2\n-1\n0\n1\n2\n3\n4\nLife of the turnout\nCu\nrr\nen\nt\nA\nsample\nFailure Progresses\nFault \nFree \nState\nClose to\nFailure\nState\n0 50 100 150 200 250 300 350\n-1.5\n-1\n-0.5\n0\n0.5\n1\n1.5\n2\n2.5\n3\nLife of the turnout\nF\no\nr\nc\ne\n(b)\nA\nsample\nClose to\nFailure state\nFault \nFree \nState\nFailure Progresses\nTraverse 1 \nTraverse 2 \nSlide \nChairs \n(a) Force Sensors (b) Linear Ruler Sensor \n(c) Proximity Sensors (d) Motor Current Sensors \nInstalled Sensors on Turnout System \n  \nforecasting effectiveness to validate the result obtained \nwith the cluster validity index.  \nTwo models (i.e., the SSBP and the HHMM model) are \nanalyzed: samples from the training and testing data are \nselected, the health states are identified and health state \nforecasting is performed for both methods. Transition \nprobabilities from both models are extracted, and the \nexpected remaining useful life is calculated as discussed \nin section III.  \n \n \nFig. 9. Evaluation of the number of clusters \nThe effectiveness of the estimated RUL (RULe) is \ncalculated by comparing the RULe with the real RUL \n(RULr). The real and estimated RULs calculated using \nHHMM-based prognostics and the SSBP are displayed for \nten turnout systems in Fig. 10. Each graph represents one \nof the turnout systems. The x-axis represents the age of \nthe system, whereas the y-axis represents the remaining \nuseful life of the system. The dashed line represents the \nreal RUL of the system given the current age. Note that \nthe sum of the x-axis and y-axis for the real RUL gives the \nlife of the system. The solid line represents the estimated \nRUL.  \n \nFig. 10. RULr and RULe for ten turnout systems with HHMM and SSBP \nThe root mean square error (RMSE) and r-square \nvalues between real RUL (RULr) and RULe are used as \nmeasures to evaluate the effectiveness of the prognostic \nmethod in [26] and [30]. Figs. 11 displays the RMSE (Fig \n11.a) and r-square (Fig 11.b) between the RULr and RULe \nobtained with HHMM and SSBP. The x-axis represents \nthe turnout systems, whereas the y-axis gives the RMSE \nand r-square values. It was expected that HHMMs would \noutperform the presented simple prognostics method, but \nthe opposite was true. The RMSE values are smaller and \nthe r-square values are greater for the presented method. \nOne can conclude that the optimization within HHMM \nduring training makes the parameters worse from a \nprognostics perspective, considering its design and \ntechnical requirements.  \n \n \n(a) \n \n(b) \n \nFig. 11.  Comparison of SSBP and HHMM using a) RMSE b) R-\nsquare \nThe presented method is very simple and outperforms \nHHMM-based prognostics. As a disadvantage, the \npresented method has restrictions on state transitions that \nallow transition of a state only to itself and a consecutive \nstate.  \n \nFig 12. r-square values for different numbers of health states \n0\n1000\n2000\n3000\n4000\n1 2 3 4 5 6 7 8 9 10\nCalinski-Harabasz\n0 5 10 15 20\n0\n10\n20\nTurnout System 1\n0 5 10 15\n0\n10\n20\nTurnout System 2\n0 5 10 15\n0\n10\n20\nTurnout System 3\n0 5 10 15 20\n0\n10\n20\nTurnout System 4\n0 5 10 15\n0\n10\n20\nTurnout System 5\n0 5 10 150\n10\n20\nTurnout System 6\n0 5 10 15\n0\n10\n20\nTurnout System 7\n0 5 10 15\n0\n10\n20\nTurnout System 8\n0 5 10 150\n10\n20\nTurnout System 9\n0 5 10 15 200\n10\n20\nTurnout System 10\nSystem Current Age\nEx\npe\nct\ne\nd \nR\nUL\n \n \nReal RUL\nSSBP\nHHMM\n0,00\n0,50\n1,00\n1,50\n2,00\n2,50\n1 2 3 4 5 6 7 8 9 10\nSSBP\nHHMM\n0,75\n0,80\n0,85\n0,90\n0,95\n1,00\n1 2 3 4 5 6 7 8 9 10\nSSBP\nHHMM\n1 2 3 4 5 6 7 8 9 100\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\nNumber of Health States\nr-\nsq\nu\na\nre\n \n \nSSBP\nHHMM\n  \n \nFig. 12 displays the r-square values of RULr and RULe \nfor different health states. The r-square values are \nnegative for the second and third health states and starts \nincreasing thereafter. The highest value obtained is with \nthe eighth and ninth health states, and the r-square value \nstarts decreasing beyond the tenth health state. Note that \neight health states were recommended by the CH cluster \nvalidity index. Thus, the prognostics results support the \nresult of the CH cluster validity index.  \nV. CONCLUSION \nFailures often go through several states before making \nthe system unusable. It is critical to identify and forecast \nthese health states as the failure progresses for effective \nusage of the system. Railway turnouts are one of the most \nimportant components of railway infrastructure. Although \nseveral studies on failure identification in turnout systems \nare present in the literature, health state estimation and \nforecasting have not been reported. One of the most \nimportant difficulties in failure progression analysis is the \ninability to observe the natural progression of failures due \nto time constraint. Failures occur slowly and obtaining \nstatistically enough failure progression data may take \nyears. This paper presents a strategy to collect data with a \ngiven failure degradation model. Then, a simple \nprognostic method (SSBP) is presented. SSBP and \nHHMM based prognostic methods are applied to data \nobtained from a turnout system in the Turkish State \nRailway and their results are compared. The presented \nmethod outperforms the HHMM-based prognostics in the \npaper. In addition, a validation strategy for health state \nestimation is presented in the paper.  \nREFERENCES \n[1]   EU Corporate Responsibility Report, 2005 \n[2]  Directive 2001\/12\/EC of the European Parliament and of the \nCouncil of 26 February 2001 amending Council Directive \n91\/440\/EEC on the development of the Community’s railways \nOfficial, L75 of 15 March 2001, SIN 1012-9200 \n[3]    Directive 2001\/13\/EC of the European Parliament and of the \nCouncil of 26 February 2001 amending Council Directive \n95\/18\/EC on the licensing of railway undertaking, L75 of 15 \nMarch 2001, SIN 1012-9200 \n[4]    Directive 2001\/14\/EC of the European Parliament and of the \nCouncil of 26 February 2001 amending Council Directive \n91\/440\/EEC on the allocation of railway infrastructure capacity \nand the levying of charges for the use of railway infrastructure \nand safety certification, L75 of 15 March 2001, SIN 1012-9200 \n[5]  Garcia Marquez, F., Lewis, W.R., Tobias, M.A., Roberts, C., Life \ncycle costs for railway condition monitoring, Transport Res. Part \nE., vol. 44 no. 6, 1175-1187, 2008 \n[6] Fausto Pedro Garcia Marquez, Paul Weston, Clive Roberts, \nFailure analysis and diagnostics for railway trackside equipment, \nEngineering Failure Analysis 14, 1411–1426, 2007 \n[7]  A.K.S. Jardine, D. Lin, and D. Banjevic, “A review on machinery \ndiagnostics and prognostics implementing condition-based \nmaintenance”, Mechanical Systems and Signal Processing, vol.20, \nno. 7, 1483-1510, 2006   \n[8] F. Camci, R. B. Chinnam, Process Monitoring, Diagnostics and \nPrognostics in Machining Processes, LAP Lambert Academic \nPublishing, 978-3838335667, Jan. 2010  \n[9] Y. Wenxian, P. J. Tavner, C.J. Crabtree, M. Wilkinson, “Cost-\nEffective Condition Monitoring for Wind Turbines”, IEEE \nTransactions on Industrial Electronics, vol. 57 no. 1, 263-271, \n2010 \n[10] A. Khezzar, M. El Kamel Oumaamar, M.  Hadjami, M.  \nBoucherma, H. Razik, “Induction Motor Diagnosis Using Line \nNeutral Voltage Signatures”, IEEE Transactions on Industrial \nElectronics, vol. 56 no. 11, 4581 - 4591, 2010 \n[11] F. Immovilli, M. Cocconcelli, A. Bellini, R Rubini “Detection of \nGeneralized-Roughness Bearing Fault by Spectral-Kurtosis \nEnergy of Vibration or Current Signals”, IEEE Transactions on \nIndustrial Electronics, vol. 56 no.11, 4710 – 4717, 2009  \n[12]  Z. Pinjia, D. Yi, D. Jing, T. G. Habetler, L. Bin “Impaired-\nCooling-Condition Detection Using DC-Signal Injection for Soft-\nStarter-Connected Induction Motors”, IEEE Transactions on \nIndustrial Electronics, vol. 56 , no. 11, 4642 – 4650, 2009  \n[13]  S. H. Kia, H. Henao, G. A. Capolino, “Torsional Vibration Effects \non Induction Machine Current and Torque Signatures in Gearbox-\nBased Electromechanical System” IEEE Transactions on \nIndustrial Electronics, vol. 56, no.11, 4689 – 4699, 2009 \n[14]  M. Pineda-Sanchez, M. Riera-Guasp, J.A. Antonino-Daviu, J. \nRoger-Folch, J. Perez-Cruz, R. Puche-Panadero, “Instantaneous \nFrequency of the Left Sideband Harmonic During the Start-Up \nTransient: A New Method for Diagnosis of Broken Bars”, IEEE \nTransactions on Industrial Electronics, vol. 56 no.11 4557 – 4570, \n2009 \n[15] Guzinski, J.; Diguet, M.; Krzeminski, Z.; Lewicki, A.; Abu-Rub, \nH.; Application of Speed and Load Torque Observers in High-\nSpeed Train Drive for Diagnostic Purposes, IEEE Transactions on \nIndustrial Electronics,  56(1), 2009, 248 - 256  \n[16] Stefani, A.; Bellini, A.; Filippetti, F.; Diagnosis of Induction \nMachines' Rotor Faults in Time-Varying Conditions IEEE \nTransactions on Industrial Electronics, 56(11), 2009, 4548 – 4556 \n[17] Cruz, S.M.A.; Stefani, A.; Filippetti, F.; Cardoso, A.J.M.; A New \nModel-Based Technique for the Diagnosis of Rotor Faults in \nRFOC Induction Motor Drives, IEEE Transactions on Industrial \nElectronics,  55(12), 2008, 4218 - 4228  \n[18] S. Hedayati Kia, H. Henao, G.A. Capolino, \"Mechanical \nTransmission and Torsional Vibration Effects on Induction \nMachine Stator Current and Torque in Railway Traction \nSystems,\" Conference Record of the 1st ECCE, San Jose (USA), \n21-24 September 2009, vol. CD-ROM, pp. 3182-3187.  \n[19] S. Hedayati Kia, H. Henao, G.A. Capolino, \"Torsional Vibration \nAssessment in Railway Traction System Mechanical \nTransmission,\" Proceedings International Symposium on \nDiagnostics for Electrical Machines, Power Electronics & Drives \n(SDEMPED'2009), Cargese (France), 31 August-3 September \n2009, vol. CD-ROM, 7 pages.  \n[20] S. Hedayati Kia, H. Henao, G.A. Capolino, \"Mechanical Health \nAssessment of a Railway Traction System,\" Proceedings IEEE-\nMELECON'08, Ajaccio (France), 5-7 May 2008, pp.453-458. \n[21] Marquez F. P. G., Schmid F., Collado J. C., A Reliability centered \napproach to remote condition monitoring: A railway points case \nstudy, Reliability Engineering and System Safety, 80, (2003), 33-\n40 \n[22] Marquez F. P. G., D. J. P. Tercero, Schmid F., Unobserved \ncomponent models applied to the assessment of wear in railway \npoints: A case study., European Journal of Operation Research, \n176 (2007), 1703-1712 \n[23] C. Roberts, H.P.B. Dassanayake, N. Lehrasab, C.J. Goodman: \nDistributed quantitative and qualitative fault diagnosis: Railway \njunction case study, Control Engineering Practice, 10(4), 2002, \n419-429   \n[24]  Marquez F. P. G., Schmid F., A Digital Filter Based Approach to \nthe Remote Condition Monitoring of Railway Turnouts, \nReliability Engineering and System Safety, 92, (2007), 830-840 \n[25] V. Atamuradov, F. Camci, S. Baskan, M. Sevkli, \"Failure \nDiagnostics for Railway Point Machines Using Expert Systems \", \nThe 7th IEEE International Symposium on Diagnostics for \nElectric Machines, Power Electronics & Drive, Cargese, France, \n2009  \n[26] Marquez F. P. G., Roberts C., Tobias A. M, Railway point \nMechanisms: condition monitoring and fault detection, Proc. \nIMechE Vol. 223 Part F: Journal of Rail and Rapid Transit, doi: \n10.1243\/09544097JRRT289 \n[27] C. Kwan, X. Zhang, R. Xu, L. Haynes, A novel approach to fault \ndiagnostics and prognostics, Proceedings of ICRA '03: IEEE \nInternational Conference on Robotics and Automation. 1(3), \nSeptember 2003, 604-609 \n[28] Camci F., Chinnam R. B., \"Health-State Estimation and \nPrognostics in Machining Processes\", IEEE Transactions on \nAutomation Science and Engineering, doi: \n10.1109\/TASE.2009.2038170  \n[29] Yali Xiong; Xu Cheng; Shen, Z.J.; Chunting Mi; Hongjie Wu; \nGarg, V.K.; Prognostic and Warning System for Power-Electronic \nModules in Electric, Hybrid Electric, and Fuel-Cell Vehicles, \n  \nIEEE Transactions on Industrial Electronics, 55(6),  June 2008, \n2268 - 2276  \n[30] M. Dong, D. He, A segmental  hidden semi-Markov model \n(HSMM) -based diagnostics and prognostics framework and \nmethodology, Mechanical Systems and Signal Processing, 21, \n2007, 2248-2266 \n[31] P. Baruah, P and R.B. Chinnam, R.B., HMMs for diagnostics and \nprognostics in machining processes, International Journal of \nProduction Research, 43(6), 2005, 1275-1293 \n[32] R. B. Chinnam, P. Baruah, Autonomous diagnostics and \nprognostics in machining processes through competitive learning-\ndriven HMM-based clustering, International Journal of \nProduction Research, 47 (23), 2009, 6739 – 6758 \n[33] E.G. Strangas; S. Aviyente; S. S. H. Zaidi, “Time–Frequency \nAnalysis for Efficient Fault Diagnosis and Failure Prognosis for \nInterior Permanent-Magnet AC Motors”, IEEE Transactions on \nIndustrial Electronics, vol. 55 no. 12, 4191 – 4199, 2008  \n[34] Morgan, I.; Honghai Liu; Predicting Future States With n -\nDimensional Markov Chains for Fault Diagnosis, IEEE \nTransactions on Industrial Electronics, vol. 56 no. 5, 1774 – 1781, \n2009  \n[35] I. Morgan; H. Liu; B. Tormos; A. Sala, ”Detection and Diagnosis \nof Incipient Faults in Heavy Duty Diesel Engines”, IEEE \nTransactions on Industrial Electronics, \ndoi:10.1109\/TIE.2009.2038337  \n[36] N. Gebraeel, A. Elwany J. Pan, “Residual Life Predictions in the \nAbsence of Prior Degradation Knowledge”, IEEE Transactions on \nReliability, 58(1), 2009, 106-116 \n[37] U. Maulik, S. Bandyopadhyay, “Performance Evaluation of Some \nClustering Algorithms and Validity Indices” IEEE Transactions on \nPattern Analysis and Machine Intelligence, 24(12), 2002, 1650-\n1654  \n[38] R.J.G.B. Campello, E.R. Hruschka, “A fuzzy extension of the \nsilhouette width criterion for cluster analysis”, Fuzzy Sets and \nSystems, 157(21), 2858-2875, 2006 \n \n \n \nOmer Faruk Eker is M.Sc. student in Computer Engineering Department \nat Fatih University and works as a research \nassistant in the project (108M275) funded by \nTUBITAK. He received his B.Sc. degree in \nDepartment of Secondary School Science and \nMathematics Education from Marmara \nUniversity in Istanbul, Turkey. His research \ninterests include failure diagnostics and \nprognostics of electro-mechanical systems by \nusing Classification\/Clustering and Time Series \nAnalysis techniques. \n \n \n \n \n \nFatih Camci received the B.S. degree in computer engineering from \nIstanbul University, Istanbul, Turkey, the M.S. \ndegree in computer engineering from Fatih \nUniversity, Istanbul, and the Ph.D. degree in \nindustrial engineering from Wayne State \nUniversity, Detroit, MI. He is an Assistant \nProfessor in computer engineering department at \nMeliksah University. He worked in several \nprojects related to prognostic health \nmanagement in USA and Turkey.  His expertise \nincludes prognostics health management, \nintelligence engineering systems, engineering \noptimization, and video processing. \n \n \n \n \n \n \n \n \n \n \n \n \nAdem Guclu is B.Sc. student in Computer Engineering Department at \nFatih University. His research interests include \nArtificial Intelligence, Machine Learning, Pattern \nRecognition, Data Mining and Web Application \nArchitectures and Development. \n \n \n \n \n \n \n \nHalis Yilboga was born in Van, Turkey in 1986. He is a B.Sc. student in \nComputer Engineering Department at Fatih \nUniversity. His research interests include \nArtificial Intelligence, Machine Learning, \nNatural Language Processing, Pattern \nRecognition, and Distributed Systems.  \n \n \n \n \n \n \n \n \n \n \nMehmet Sevkli is an Assistant Professor in Industrial Engineering \nDepartment, Fatih University, Istanbul, Turkey. \nHe received his B.S. in Industrial Engineering \nfrom Sakarya University, his M.Sc. in \nIndustrial Engineering from Fatih University \nand his Ph.D. in Industrial Engineering, from \nIstanbul Technical University. His research \ninterests include Meta-heuristics algorithms \napplied to the combinatorial optimization \nproblem and Multi Criteria Decision Making \nMethods. \n \n \n \n \n \n \nSaim Baskan is an Assistant Professor in Electrical Engineering \nDepartment at Fatih University. He received his Ph.D. in Engineering \nScience from Rensselaer Polytechnic \nInstitute in New York, USA. He received \nhis M.S degree in Electric Power \nEngineering from Rensselaer Polytechnic \nInstitute. He received his B.S. degree \nElectrical Education from Gazi University \nin Turkey. He has worked as Senior Project \nEngineer at Omega Advanced Solutions in \nNew York, USA. He has been involved in \nmechanical testing system design. His \nexpertise includes motor control, data \nacquisition, and sensor less motor control. \n \n"}