{"doi":"10.1109\/TNS.2007.892115","coreId":"102529","oai":"oai:epubs.surrey.ac.uk:1992","identifiers":["oai:epubs.surrey.ac.uk:1992","10.1109\/TNS.2007.892115"],"title":"Results from the Galileo giove - A radiation monitors and comparison with existing radiation belt models","authors":["Taylor, B","Underwood, C","Evans, HDR","Ryden, K","Rodgers, D","Daly, EJ","Mandorlo, G","Falcone, M","Morris, PA","Prieto, RG"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-08","abstract":"The radiation monitors on board the Galileo Giove-A satellite, CEDEX and Merlin, and their data are presented. The instruments include energetic proton and ion detectors, an internal charging monitor, RADFETs and experimental dose-rate photodiodes. A comparison of the data with existing monitors and models is presented","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"IEEE-INST ELECTRICAL ELECTRONICS ENGINEERS INC","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1992<\/identifier><datestamp>\n      2017-10-31T14:03:56Z<\/datestamp><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:535343<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1992\/<\/dc:relation><dc:title>\n        Results from the Galileo giove - A radiation monitors and comparison with existing radiation belt models<\/dc:title><dc:creator>\n        Taylor, B<\/dc:creator><dc:creator>\n        Underwood, C<\/dc:creator><dc:creator>\n        Evans, HDR<\/dc:creator><dc:creator>\n        Ryden, K<\/dc:creator><dc:creator>\n        Rodgers, D<\/dc:creator><dc:creator>\n        Daly, EJ<\/dc:creator><dc:creator>\n        Mandorlo, G<\/dc:creator><dc:creator>\n        Falcone, M<\/dc:creator><dc:creator>\n        Morris, PA<\/dc:creator><dc:creator>\n        Prieto, RG<\/dc:creator><dc:description>\n        The radiation monitors on board the Galileo Giove-A satellite, CEDEX and Merlin, and their data are presented. The instruments include energetic proton and ion detectors, an internal charging monitor, RADFETs and experimental dose-rate photodiodes. A comparison of the data with existing monitors and models is presented.<\/dc:description><dc:publisher>\n        IEEE-INST ELECTRICAL ELECTRONICS ENGINEERS INC<\/dc:publisher><dc:date>\n        2007-08<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1992\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Taylor, B, Underwood, C, Evans, HDR, Ryden, K, Rodgers, D, Daly, EJ, Mandorlo, G, Falcone, M, Morris, PA and Prieto, RG  (2007) Results from the Galileo giove - A radiation monitors and comparison with existing radiation belt models       <\/dc:identifier><dc:relation>\n        10.1109\/TNS.2007.892115<\/dc:relation><dc:language>\n        EN<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1992\/","10.1109\/TNS.2007.892115"],"year":2007,"topics":[],"subject":["Conference or Workshop Item","NonPeerReviewed"],"fullText":"1076 IEEE TRANSACTIONS ON NUCLEAR SCIENCE, VOL. 54, NO. 4, AUGUST 2007\nResults From the Galileo Giove—A Radiation\nMonitors and Comparison With Existing\nRadiation Belt Models\nBen Taylor, Member, IEEE, Craig I. Underwood, Hugh D. R. Evans, Keith Ryden, David Rodgers,\nEamonn J. Daly, Giuseppe Mandorlo, Marco Falcone, P. A. Morris, and Rafael Garcia Prieto\nAbstract—The radiation monitors on board the Galileo Giove-A\nsatellite, CEDEX and Merlin, and their data are presented. The in-\nstruments include energetic proton and ion detectors, an internal\ncharging monitor, RADFETs and experimental dose-rate photodi-\nodes. A comparison of the data with existing monitors and models\nis presented.\nIndex Terms—Electron, Galileo, GIOVE-A, GSTB-V2, integral,\nionising dose, IREM, LET, proton, radiation environment, radia-\ntion monitor.\nI. INTRODUCTION\nI N preparation for the Galileo system, the European SpaceAgency commissioned two test satellites, the first of which is\nthe Giove-A, built by Surrey Satellite Technology. These satel-\nlites will test the technology required for the Galileo System and\ncharacterise the space environment that the final constellation\nwill encounter. Giove-A was launched on the 28th December\n2005 into a 23 260 km circular orbit with an inclination of 56 .\nThe second, Giove-B, built by Galileo Industries, is planned for\nlaunch in 2007, and will carry a SREM instrument [1]. To char-\nacterise the environment, Giove-A’s payload includes two radia-\ntion monitors: CEDEX (Univ. Surrey) and MERLIN (QinetiQ).\nThe Cosmic-Ray Energy Deposition Experiment (CEDEX)\nmonitors high-energy (45–50 MeV) proton fluxes and provides\na detailed LET spectrum for the cosmic-ray ion environment\nwith a pair of 300 m silicon PIN diode detectors arranged to\nform a telescope. In addition, CEDEX carries four experimental\ndose-rate sensors, shielded by domes of thickness 2 mm Al,\n4 mm Al, 2 mm Cu, and 4 mm Cu.\nManuscript received October 6, 2006; revised January 10, 2007.\nB. Taylor and C. I. Underwood are with the Surrey Space Centre, University\nof Surrey, Guildford, Surrey GU2 7XH, U.K. (e-mail: B.Taylor@surrey.ac.uk;\nC.Underwood@surrey.ac.uk).\nH. D. R. Evans is with the European Space Agency, ESTEC\/TEC-EES,\nPostbus 299, 2200 AG Noordwijk, The Netherlands and also with the Rhea\nSystem SA, Louvain-la-Neuve B-1348, Belgium (e-mail: Hugh.Evans@\nesa.int).\nK. Ryden, D. Rodgers, and P. A. Morris are with the QinetiQ Space Division,\nCody Technical Park, Farnborough GU14 OLX, U.K. (e-mail: KARYDEN@\nqinetiq.com; djrodgers@space.qinetiq.com; pamorris@qinetiq.com).\nE. J. Daly, G. Mandorlo, M. Falcone, and R. G. Prieto are with the European\nSpace Agency, ESTEC\/TEC-EES, Postbus 299, 2200 AG Noordwijk, The\nNetherlands (e-mail: Eamonn.Daly@esa.int; Giuseppe.Mandorlo@esa.int;\nMarco.Falcone@esa.int; Rafael.Garcia.Prieto@esa.int).\nColor versions of one or more of the figures in this paper are available online\nat http:\/\/ieeexplore.ieee.org.\nDigital Object Identifier 10.1109\/TNS.2007.892115\nFig. 1. The University of Surrey’s CEDEX instrument.\nMerlin includes a PIN diode detector to measure MeV\nproton fluxes, a LET telescope for measuring cosmic rays, two\nRADFETs and the SURF instrument for measuring energetic\nelectrons and monitoring electrostatic charging.\nII. CEDEX INSTRUMENT\nThe Giove-A CEDEX (as seen in Fig. 1) is a development of\nthe TiungSAT-1 CEDEX payload, which was launched in 2000\ninto low-Earth orbit. This payload in turn has flight heritage\nthrough Surrey’s series of Cosmic-Ray Experiment (CRE)\npayloads flown on KITSAT-1 (1992), PoSAT-1 (1993) and\nAMSAT-OSCAR-40 (2000) [2], [3]. CEDEX’s mass is 2.05 kg\n(including radiation shielding) and its power consumption is\n4.2 W at 38 V.\nA. Proton\/Heavy Ion Telescope\nThe CRE and CEDEX payloads each detect single-event ef-\nfect (SEE)-inducing particles (protons and heavy ions) by means\nof PIN diode detectors. Particles passing through the detector\nlose energy by creating electron-hole pairs. The resulting charge\nis proportional to the total energy deposited by the particle,\nwhich is itself related to the particle’s Linear Energy Transfer\n(LET). This charge is measured, and a running total is kept of\nthe number of particle events in each charge or LET “bin”.\n0018-9499\/$25.00 © 2007 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on March 26,2010 at 06:02:49 EDT from IEEE Xplore.  Restrictions apply. \nTAYLOR et al.: RESULTS FROM THE GALILEO GIOVE 1077\nFig. 2. The QinetiQ Merlin instrument.\nThe sensing elements comprise two precision 3 cm 3 cm\nPIN diodes at 74 mm spacing, mounted co-axially to give\na 44 –60 field-of-view particle telescope. The upper diode\nacts as a coincidence detector, whilst the lower diode is con-\nnected to a 512-channel charge pulse-height analyser, capable\nof processing up to 200 000 events per second. The vertical\nincidence LET range is 32 MeV cm g to MeV\ncm g . Counts in the first 3 channels (up to MeV\ncm g —equivalent to 6 MeV of energy deposited in the\ndetector) are taken to be primarily due to protons, whereas\nevents in the channels representing LETs of 95 MeV cm g\nand above are taken to be due to heavier ions only. Possible\ncontamination in the proton channels due to heavy ions is under\ninvestigation. Coincident and non-coincident events (i.e., those\nthat do not trigger the front detector) are recorded separately.\nCEDEX particle telescope data are integrated over 75 second\nperiods and are sent to the spacecraft’s central on-board com-\nputer every five minutes.\nB. Experimental Dose-Rate Photo-Diodes\nThe dose-rate diodes comprise small PIN diodes configured\nto give a direct photo current output, the dark current of which\nprovides the dose-rate measurement. The diodes are placed be-\nhind domes of aluminium (2 mm and 4 mm) and copper (2 mm\nand 4 mm) to give a representative series of measurements of\nthe dose-rate inside the spacecraft at different shielding depths.\nThe diodes are commercial UV-enhanced photodiodes, with the\nquartz window left in place.\nThe dark current from these diodes is partly due to the\ntemperature of the diodes, leakage currents in the amplifiers\nand the presence of ionising particles inducing a current due\nto the ionising dose-rate. The thermal response of the diodes\nwas taken during Thermal Vacuum Testing, together with the\nCEDEX temperature sensor. The Engineering Model (EM) of\nCEDEX and complementary photo-diodes were tested with the\nSr source in the REEF facility at QinetiQ to determine their\nresponse to radiation.\nIII. MERLIN INSTRUMENT\nMerlin (as seen in Fig. 2) is a space weather hazard monitor,\nwhich provides a comprehensive space environment monitoring\ncapability on Giove-A. Merlin measures key parameters of the\nFig. 3. The mean differential flux spectrum as measured by CEDEX between\nearly January 2006 and late August 2006 overlaid with CREME86 model\npredictions.\nspace environment which have practical importance for space-\ncraft in medium Earth orbit (MEO), namely: internal charging\ncurrents, energetic proton fluxes, ion LET spectra and total ion-\nising dose rates in silicon.\nMerlin is based on two unique but highly successful instru-\nments, SURF and CREDO, which have flown before on orbits\npassing through the MEO regime [4]. These two instruments\nhave been repackaged into a 1 kg unit with combined data han-\ndling and power conditioning. For the Giove-A mission an extra\ninterface stage was needed for the CAN bus communications\nand also additional box level radiation shielding, so giving a 2\nkg overall mass.\nA. Particle Telescopes\nMerlin provides two particle telescopes, one for heavy ion\nLET measurements and one for proton counting. The tele-\nscopes comprise two large-area planar silicon diodes separated\nby 25 mm. Pulse height analysis is applied to determine LET\nvalues, and simple thresholds applied for particle counting pur-\nposes. The telescope arrangement provides three main benefits:\ndirectionality, which enables the particle flux per steradian to\nbe determined; clearer measurements of LET by constraining\nthe angles at which the measured particles pass through the\nsilicon; and better discrimination of the particles of interest\nagainst contamination effects from energetic electrons.\nB. SURF Monitor\nThe SURF monitor is configured to measure internal charging\ncurrents in three 70 mm diameter detector plates stacked one\non top of the other. The top two plates are 0.5 mm thick, and\nthe bottom plate is 1 mm thick. The combined shielding of\nthe sensor cover and thermal blankets contribute to additional\nshielding of 0.5 mm equivalent Aluminium on top of the de-\ntector plates. For each plate there is a high-sensitivity and low-\nsensitivity channel, providing a wide dynamic range. The low-\nsensitivity channel provides a (dynamic) output of 10 mV\/pA,\nand the high-sensitivity (dynamic) output is 500 mV\/pA. This\nAuthorized licensed use limited to: University of Surrey. Downloaded on March 26,2010 at 06:02:49 EDT from IEEE Xplore.  Restrictions apply. \n1078 IEEE TRANSACTIONS ON NUCLEAR SCIENCE, VOL. 54, NO. 4, AUGUST 2007\nFig. 4. The Ionisation Currents of the photo diodes from CEDEX plotted against Universal Time for 23 February 2006, overlaid with the McIlwain L shell\nGeomagnetic coordinate. The signal to noise ratio of the 2 mm Al diode is quite good, and the effects of the radiation belt quite clear. The lower dose deposition\nin the 4 mm Al diode, though, has a lower signal to noise ratio, but the effects of the radiation belt are still clearly apparent.\nFig. 5. The Merlin SURF Charging Currents plotted against Universal Time for 23 February 2006, overlaid with the McIlwain L shell Geomagnetic coordinate.\nAll Currents have excellent signal to noise ratios and all register the crossings of the belts.\ndesign has proven itself to be virtually immune to proton con-\ntamination, overcoming a drawback of many conventional elec-\ntron detectors that can become contaminated during solar par-\nticle events.\nC. RADFETs\nTotal dose is measured at two locations within the unit using\ncalibrated RADFETs. These devices are left unbiased so that in-\nterruptions in power do not affect their readings. The shielding\nand sensitivity of the RADFETs is adjusted according to the\nmission. For Giove-A the shielding is 3 mm and 6 mm of equiv-\nalent Aluminium in the (space facing) direction with greater\nshielding elsewhere—including the RADFET lids.\nIV. PRELIMINARY DATA\nThe Merlin and CEDEX monitors were both switched on\nsoon after launch, and a near continuous dataset has been\nprovided commencing at the beginning of January. A prelimi-\nnary investigation of the data reveals that both instruments are\nworking well and are detecting the magnitude and variability\nof the outer radiation belts.\nThe Heavy Ion telescope on CEDEX is monitoring the\ncosmic ray particle flux and data shows a good agreement with\nCREME86 predicted fluxes [5], as seen in Fig. 3. The particle\nflux is preliminarily assumed to be over with shielding of\n10 mm Al. A mm deviation produces a maximum error of\n20% at high LET for the model predictions.\nAuthorized licensed use limited to: University of Surrey. Downloaded on March 26,2010 at 06:02:49 EDT from IEEE Xplore.  Restrictions apply. \nTAYLOR et al.: RESULTS FROM THE GALILEO GIOVE 1079\nFig. 6. The daily mean Ionisation current from the CEDEX experimental photo diodes from early January to late August 2006 with preliminary AE-8 model\npredictions for mean currents overlaid. The dynamics of the radiation belt are clearly shown in the 2 mm and 4 mm Al. channels, whereas the Cu. Channels are\ndominated by noise. Here, the 2 mm Al diode saturates at 410 pA. GOES > 2 MeV Electron Flux is plotted in arbitrary units.\nThe experimental CEDEX photodiodes are registering the\ncrossings of the belt. The lightest shielded diode (2 mm Al)\nclearly shows the crossing of the radiation belts, as seen\nin Fig. 4. The passage of the radiation belt is not as clear in the\n4 mm Al shielded diode, but this is as expected as the radiation\nbelt models indicate that the dose-rate from this photo-diode\nshould be approximately a factor of 10 lower than the 2 mm,\nor pA. The belt crossings are clearly seen in the three\nMerlin SURF charging currents. All produce clear signals for\nbelt crossings as seen in Fig. 5.\nThe time series data of the CEDEX photo diodes, seen in\nFig. 6, show the strong variability of the outer radiation belt,\nregistering the enhancement and subsequent decays of the\nbelt over the period. A number of events are apparent, all of\nwhich coincide with enhancements detected in the GOES-12\nMeV daily fluence data at an L-shell of 6.6 . The\nmodel predictions are based on basic 3D GRAS (GEANT-4\nRadiation Analysis for Space) [6] Monte Carlo simulations\nusing the AE-8 model spectrum for Solar Minimum, which\nis the standard model in engineering applications for trapped\nelectrons [7].\nThe Merlin SURF plates are detecting significant rates of\ninternal charging caused by the energetic electron environment\nat three different shielding depths. Large variations in charging\nrates are noted both around the orbit and also over longer\ntimescales due to outer belt enhancements as seen in Fig. 7.\nThe model predictions are again based on basic 3D GRAS\nmodelling of the energy response of the SURF plates using\nMonte Carlo simulations using the AE-8 energy spectrum. The\neffect of the enhancement events is clearly seen in the Merlin\nFig. 7. The daily maximum charging current from the three SURF plates from\nearly January to late August 2006 with preliminary AE-8 model predicted mean\nCharging Current for the SURF plates. GOES> 2MeV Electron Flux is plotted\nin arbitrary units.\nRADFETs with dose-rate accumulation increasing during the\nevents in Fig. 8.\nV. CONCLUSION\nBoth Giove-A radiation monitors are functional and col-\nlecting data. A preliminary look at the data shows that the\ninstruments are registering large variations in the state of the\nouter electron belt. This high variability is due to geomagnetic\nstorm conditions triggered by interactions with solar wind\nAuthorized licensed use limited to: University of Surrey. Downloaded on March 26,2010 at 06:02:49 EDT from IEEE Xplore.  Restrictions apply. \n1080 IEEE TRANSACTIONS ON NUCLEAR SCIENCE, VOL. 54, NO. 4, AUGUST 2007\nFig. 8. The Accumulated Total Dose from the two Merlin RADFETs, clearly dominated by a reoccurring event indicated by SURF charging currents. The Total\nDose is greater than predicted by AE-8\/AP-8 due to periodic electron enhancements, primarily to a single event in April.\nstreams caused by a Coronal hole on the Sun. This causes\nchanges in the intensity and spatial structure of the belt when\nthe Coronal holes are magnetically directed at Earth. Coronal\nholes can be a persistent feature at this point in the solar cycle\nand indeed many of the events registered stem from a single\ncoronal hole, rotating with the Sun giving a periodicity of\ndays. These storm conditions and subsequent enhancements\ncan also be triggered by Coronal Mass Ejections directed at the\nEarth, however to date no significant events of this nature have\nbeen observed.\nThe data thus far shows that ionising dose is delivered pri-\nmarily in distinct surges during electron enhancement events\ntriggered by interactions with Coronal holes on the Sun. Over\nthe 8 months to date the dose measured in the RadFET at 3 mm\nAl eq. shielding ( direction) exceeds the prediction based on\nAE8 by only a small margin % . The dose received by the\nmore heavily shielded RADFET (6 mm Al eq. in direction) is\nhigher than the AE8 prediction by a factor 2. Since a large frac-\ntion of these doses have been received during a small number of\nelectron enhancements, in particular the April 2006 event, the\nresults are unlikely to be representative of the average condi-\ntions over a whole solar cycle. A longer period of observation\nwill be needed to compare measured doses with those predicted\nby a long term average model such as AE-8.\nThe Cosmic ray spectrum measured by the CEDEX instru-\nment telescope is in good agreement with CREME86 models\nwith the interplanetary weather index set to take into account\nGalactic cosmic rays and the fully ionised component (i.e.,:\nCREME86 ) and the 90% worst case cosmic ray level\n(i.e.,: CREME86 ). The majority of the spectrum lies be-\ntween the and CREME86 models.\nComparison of CEDEX Dose Rate Diodes to MeV elec-\ntron INTEGRAL\/IREM count rate data from periods when the\nspacecraft was between L shells of 4.45 and 4.55 Earth radii\nproduces a good empirical agreement with INTEGRAL\/IREM\ndata over time as seen in Fig. 9.\nAuthorized licensed use limited to: University of Surrey. Downloaded on March 26,2010 at 06:02:49 EDT from IEEE Xplore.  Restrictions apply. \nTAYLOR et al.: RESULTS FROM THE GALILEO GIOVE 1081\nFig. 9. INTEGRAL\/IREM data for 1st January to 1st June 2006 for electrons\n>2 MeV and between 4.45 and 4.55 Earth Radii over-plotted with CEDEX 2\nmm Al Ionisation current \u00021000. Demonstrates good proportionality between\nthe two datasets.\nREFERENCES\n[1] A. Mohammadzadeh, “The ESA standard radiation environment\nmonitor program first results from PROBA-1 and INTEGRAL,” IEEE\nTrans. Nucl. Sci., vol. 50, no. 6, pp. 2272–2277, Dec. 2003.\n[2] C. I. Underwood, A. da Silva Curiel, and M. N. Sweeting, “In-orbit\nmonitoring of ‘space weather’ and its effects on commercial-off-the-\nshelf (COTS) electronics—A decade of research using micro-satel-\nlites,” presented at the 53rd Int. Astronautical Congress, Houston, TX,\nOct. 10–19, 2002, IAC-02-IAA.6.3.04.\n[3] C. I. Underwood, A. da Silva Curiel, and M. Sweeting, “A double-\npeaked profile of the inner radiation belt—First flight results from the\nAMSAT-OSCAR-40 cosmic-ray experiment,” presented at the 53rd\nInt. Astronautical Congress, Houston, TX, Oct. 10–19, 2002, IAC-02-\nIAA.11.1.02.\n[4] K. Ryden, “The MERLIN space weather monitor and its planned flight\non the Galileo system testbed satellite (GSTB-V2\/A),” presented at\nthe 55th Int. Astronautical Congress, Vancouver, BC, Canada, 2004,\nIAC-04-IAA.4.9.3\/U.6.04.\n[5] J. H. Adams, Jr., Cosmic Ray Effects on MicroElectronics NRL Mem-\norandum Rep. 5901, 1986, Part IV.\n[6] G. Santin, “GRAS: A general-purpose 3-D modular simulation tool for\nspace environment effects analysis,” IEEE Trans. Nucl. Sci., vol. 52, no.\n6, pp. 2294–2299, Dec. 2005.\n[7] J. I. Vette, The AE-8 Trapped Electron Model Environment, NSSDC\/\nWDC-A-R&S 91-24, 1991a.\nAuthorized licensed use limited to: University of Surrey. Downloaded on March 26,2010 at 06:02:49 EDT from IEEE Xplore.  Restrictions apply. \n"}