{"doi":"10.1214\/105051606000000376","coreId":"66125","oai":"oai:dro.dur.ac.uk.OAI2:3032","identifiers":["oai:dro.dur.ac.uk.OAI2:3032","10.1214\/105051606000000376"],"title":"Periodicity in the transient regime of exhaustive polling systems.","authors":["MacPhee,  I. M.","Menshikov,  M. V.","Popov,  S.","Volkov,  S."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-11-01","abstract":"We consider an exhaustive polling system with three nodes in its transient regime under a switching rule of generalized greedy type. We show that, for the system with Poisson arrivals and service times with finite second moment, the sequence of nodes visited by the server is eventually periodic almost surely. To do this, we construct a dynamical system, the triangle process, which we show has eventually periodic trajectories for almost all sets of parameters and in this case we show that the stochastic trajectories follow the deterministic ones a.s. We also show there are infinitely many sets of parameters where the triangle process has aperiodic trajectories and in such cases trajectories of the stochastic model are aperiodic with positive probability","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66125.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/3032\/1\/3032.pdf","pdfHashValue":"3703f7589933bf8577994f859de15f414ff123c7","publisher":"Institute of Mathematical Statistics","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:3032<\/identifier><datestamp>\n      2010-05-17T15:19:40Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Periodicity in the transient regime of exhaustive polling systems.<\/dc:title><dc:creator>\n        MacPhee,  I. M.<\/dc:creator><dc:creator>\n        Menshikov,  M. V.<\/dc:creator><dc:creator>\n        Popov,  S.<\/dc:creator><dc:creator>\n        Volkov,  S.<\/dc:creator><dc:description>\n        We consider an exhaustive polling system with three nodes in its transient regime under a switching rule of generalized greedy type. We show that, for the system with Poisson arrivals and service times with finite second moment, the sequence of nodes visited by the server is eventually periodic almost surely. To do this, we construct a dynamical system, the triangle process, which we show has eventually periodic trajectories for almost all sets of parameters and in this case we show that the stochastic trajectories follow the deterministic ones a.s. We also show there are infinitely many sets of parameters where the triangle process has aperiodic trajectories and in such cases trajectories of the stochastic model are aperiodic with positive probability. <\/dc:description><dc:subject>\n        Polling systems<\/dc:subject><dc:subject>\n         Greedy algorithm<\/dc:subject><dc:subject>\n         Transience<\/dc:subject><dc:subject>\n         Random walk<\/dc:subject><dc:subject>\n         Dynamical system<\/dc:subject><dc:subject>\n         Interval exchange transformation<\/dc:subject><dc:subject>\n         a.s. convergence.<\/dc:subject><dc:publisher>\n        Institute of Mathematical Statistics<\/dc:publisher><dc:source>\n        Annals of applied probability, 2006, Vol.16(4), pp.1816-1850 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-11-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:3032<\/dc:identifier><dc:identifier>\n        issn:1050-5164<\/dc:identifier><dc:identifier>\n        doi:10.1214\/105051606000000376<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3032\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1214\/105051606000000376<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/3032\/1\/3032.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1050-5164","1050-5164"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":["Polling systems","Greedy algorithm","Transience","Random walk","Dynamical system","Interval exchange transformation","a.s. convergence."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n17 May 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nMacPhee, I. M. and Menshikov, M. V. and Popov, S. and Volkov, S. (2006) ’Periodicity in the transient\nregime of exhaustive polling systems.’, Annals of applied probability., 16 (4). pp. 1816-1850.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1214\/105051606000000376\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nThe Annals of Applied Probability\n2006, Vol. 16, No. 4, 1816–1850\nDOI: 10.1214\/105051606000000376\n© Institute of Mathematical Statistics, 2006\nPERIODICITY IN THE TRANSIENT REGIME OF\nEXHAUSTIVE POLLING SYSTEMS\nBY I. M. MACPHEE, M. V. MENSHIKOV, S. POPOV1 AND S. VOLKOV\nUniversity of Durham, University of Durham, University of São Paulo\nand University of Bristol\nWe consider an exhaustive polling system with three nodes in its tran-\nsient regime under a switching rule of generalized greedy type. We show\nthat, for the system with Poisson arrivals and service times with finite second\nmoment, the sequence of nodes visited by the server is eventually periodic al-\nmost surely. To do this, we construct a dynamical system, the triangle process,\nwhich we show has eventually periodic trajectories for almost all sets of pa-\nrameters and in this case we show that the stochastic trajectories follow the\ndeterministic ones a.s. We also show there are infinitely many sets of para-\nmeters where the triangle process has aperiodic trajectories and in such cases\ntrajectories of the stochastic model are aperiodic with positive probability.\n1. Introduction. A polling system has N nodes where jobs arrive and queue\nand a single server which switches between the nodes to process the jobs. In ex-\nhaustive polling systems the server processes all jobs at its current node i, say,\nincluding any that arrive while jobs there are being processed, before switching\nto another node j , chosen by some rule. Conditions for transience\/recurrence of\npolling systems using a greedy switching rule were given in [5, 6]. There is a crit-\nical case which has been investigated in [8] and [9]. In this paper we show that,\nfor an exhaustive polling system with N = 3 nodes, with arrival streams and ser-\nvice times putting the system in its transient regime and switching according to\na threshold rule (a type of generalized greedy rule), the sequence in which the\nserver visits the nodes is eventually periodic for almost all choices of threshold\nparameters.\nTo show this, we consider in Section 2 the embedded Markov chain in ZN+ where\nwe observe the polling system at service and switching time completions. We con-\nstruct a dynamical system using the vector field of expected drifts of the chain for\nthe server at each node. As the polling system is transient, this dynamical system\nexits any finite ball eventually, so we project it onto the unit simplex. With N = 3\nnodes, we call this the triangle process, as it lives in a triangle—it has piecewise\nlinear trajectories that change direction when they meet the triangle boundary so\nReceived May 2004; revised November 2005.\n1Supported in part by CNPq (302981\/02–0) and FAPESP (04\/03056–8).\nAMS 2000 subject classifications. Primary 60K25; secondary 90B22, 37E05.\nKey words and phrases. Polling systems, greedy algorithm, transience, random walk, dynamical\nsystem, interval exchange transformation, a.s. convergence.\n1816\nTRANSIENT POLLING SYSTEMS 1817\nit looks something like a billiards model, but where “reflections” are caused by\nchanges of dynamics due to the server switching to another node. We call any tra-\njectory which returns to its start point after finitely many server switchings an orbit.\nIt is worth mentioning that this deterministic system closely resembles (and in\nsome cases is) the so-called affine interval exchange transformation model. How-\never, the affine interval exchange transformation here is contracting so it is not a bi-\njection and it reverses orientation so it is not order-preserving. It is thus rather dif-\nferent from the usual interval exchange transformation model that has been much\nstudied during the past 30 years. We comment more on this in Section 5.\nWe state our main results in Section 3. Theorem 3.1 states that for a.s. all choices\nof switching thresholds the triangle process has a finite number of orbits and every\ntrajectory converges toward one of these orbits. We say the triangle process is sta-\nble in this case. That there are no more than four orbits for any triangle process\nparameters is the content of Theorem 3.2. In Theorem 3.3 we show that there are\n(infinitely many) choices of the switching thresholds that lead to the existence of\naperiodic trajectories of the triangle process. These results are proved in Sections\n4 and 5. Using these results for the deterministic triangle process, we show, in The-\norem 3.4, that the projections of the trajectories of the stochastic queueing model\na.s. converge onto the orbits of the triangle process, when it is stable. This implies\nthe periodicity of the sequence of nodes receiving service for the polling system.\nFinally, in Theorem 3.5, we show that when the triangle process has nonperiodic\ntrajectories then, in some situations, the sequence of nodes visited by the stochastic\nmodel is periodic with positive probability and aperiodic with positive probability.\nThese results are proved in Sections 6 and 7.\n2. System description. An exhaustive polling system has N nodes where\njobs queue and a single server which switches to the next node j , chosen with\nsome rule, after processing all jobs at the current node i, including any that arrive\nwhile jobs at i are being processed. In the general model switching takes a time\nwhich depends upon the pair i, j . We will assume the following at each node i: the\narrival processes are independent Poisson streams with arrival rate λi ; the service\ntimes are i.i.d. and independent of the arrivals with finite mean µ−1i and variance\nσ 2i < ∞; the switching times are independent with finite means that depend upon\nthe initial and final node while the server just waits for the next arrival at any node\nwhen it completes service at i and finds the system is empty.\nFor the results in our paper, we will assume that the switching times are zero.\nWe believe our argument can be extended to a more general situation, but our main\ninterest is in the transient case, where the system behavior is not sensitive to the\nswitching time distributions, though of course it is affected by the switching rule.\nThe methods we know for showing that periodicity of the node sequence for the\ndeterministic triangle process implies the same for the stochastic process are ap-\nplicable only to Markov processes. As the sequence of nodes visited is determined\n1818 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\nby the jump chain, we will consider the discrete time process\n\u0003 = {(ξ(t); s(t))}, t = 0,1, . . . ,\nwhere ξ(t) describes the queue lengths and s(t) the server location at the epochs of\nservice time and switching time completions. Its state space is ZN+ ×{1,2, . . . ,N}.\nThat \u0003 is well defined, irreducible and aperiodic follows from the assumptions of\nPoisson arrivals and finite first moments of the service times. For later convergence\narguments, we also require finite second moments of the service times and under\nthese conditions, standard results imply this embedded chain is essentially equiva-\nlent to the continuous time process as regards transience\/recurrence. The transition\nprobabilities can be computed via the Laplace transforms of the service times, but\nwe do not need them explicitly at any point. A standard conditioning argument\nreadily produces the expected one-step mean drifts\nE\n(\nξi(t + 1)− ξi(t)|(ξ(t); s(t))= (x; j))= λiµ−1j − I{i=j},(1)\ni = 1, . . . ,N,\nfor x ∈ ZN+ with xj ≥ 1 and the server at node j and we make considerable use\nof these. A similar result holds for expected drifts during switching times, but we\nwill not detail these as, in fact, we will assume switching to occur instantaneously.\nOther arrival and service processes for which there is an embedded Markov chain\ncan be found, but their treatment needs no significant extension of our methods.\nWe will start by stating the known explicit conditions for recurrence\/transience.\nFor exhaustive polling models, the conditions for recurrence\/transience depend\nonly upon the total loading (or traffic intensity)\nρ =\nN∑\ni=1\nρi where ρi = λi\/µi at each node i\nfor a great many (and seemingly all sensible) switching rules under the assumption\nthat switching times have finite first moment. We have the following:\nTHEOREM 2.1. The process \u0003 is positive recurrent if ρ < 1, transient if\nρ > 1.\nREMARKS. Foss and Last [5] establish the result for a more general model.\nThe method of proof is via Lyapunov functions as described in [1, 4] or [10]. The\npapers by MacPhee and Menshikov [8] and Menshikov and Zuyev [9] consider\nthe critical case ρ = 1, where the behavior of the system depends strongly on the\nfirst two moments of the switching time distribution. Foss and Last [6] obtain the\nresult of this theorem for nonexhaustive polling systems under a greedy switching\npolicy.\nTRANSIENT POLLING SYSTEMS 1819\nGeneralized greedy switching rules. When the server has completed all the\ntasks at its current node, it chooses its next node using a switching rule which\nwe will assume depends upon the queue lengths, that is, the rule is a function\nR : ∂RN+ → {1,2, . . . ,N}, where ∂RN+ =\n⋃\nj {y ∈ RN+ :yj = 0}. Any R must sat-\nisfy R(y) \u0005= j if yj = 0 and a variety of such rules have been studied in the litera-\nture. We will study only a class of generalized greedy rules defined as follows. For\neach node j , there is a vector of positive weights bj = (bj1, . . . , bjN) and at states\ny ∈ ∂RN+ with yj = 0, R(y) = i, where bjiyi = maxk(bjkyk) (for our results it is\nnot important how ties are resolved). The simple greedy rule is the special case\nwhere all bjk are equal.\nA deterministic model. Our subsequent analysis of the transient case is based\naround the following deterministic model of the system. Consider a particle mov-\ning in RN+ × {1, . . . ,N} with linear dynamics given by the one-step mean drifts\nof \u0003 as calculated in (1). With its position denoted y = (y1, y2, . . . , yN) and the\nserver at node j , we see that at (y, j) with yj > 0 the particle has velocity\nµ−1j\nN∑\ni=1\nλiei − ej = µ−1j\n(∑\ni \u0005=j\nλiei + (λj −µj)ej\n)\n,\nwhere the ei denote the axial unit vectors in RN . If a point with yj = 0 is reached,\nthen a different set of dynamics (corresponding to the server switching to another\nnode) is chosen instantaneously according to some generalized greedy switching\nrule R.\nThe trajectory y(t) of our particle is constructed as follows. From start point\ny(t0) = y¯ ∈ RN+ with y¯j > 0 and the server at node j , the particle travels along the\nline\n\u0007j (y¯) =\n{\ny ∈ RN :y = y¯ +µ−1j (t − t0)\n(∑\ni \u0005=j\nλiei + (λj −µj)ej\n)\n, t ∈ R\n}\nthrough y¯ with the appropriate velocity. If ρj ≥ 1, the particle never reaches ∂RN+ ,\nwhile if ρj < 1, the particle reaches\ny(t1) =\n∑\ni \u0005=j\n(\ny¯i + λiy¯j\nµj − λj\n)\nei ∈ ∂RN+(2)\nat time t = t0 + y¯j \/(1 − ρj ) =: t1. Now the server switches to node R(y(t1)) and\nthe next and subsequent pieces of the trajectory are computed as above.\nThe node process. In the transient case the trajectory exits from any finite ball\neventually, so, in order to study whether there is any periodicity in the order the\n1820 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\nserver visits the queues, we project onto the unit simplex. Project the lines \u0007j (y¯)\nonto the hyperplane S1 = {y ∈ RN :∑i yi = 1} using\n\b :RN \\ {0} → S1 where \b(y) = y∑\ni yi\n,\nwhich maps each line \u0007j (y¯) onto the intersection of S1 with the plane contain-\ning \u0007j (y¯) and the origin. The feasible positions for the particle will be mapped\nonto points in the unit simplex S+1 = {y ∈ RN+ :\n∑\ni yi = 1}. For starting points y¯\nand αy¯ for any α > 0, the lines \u0007j (y¯) and \u0007j (αy¯) have exactly the same image\nin S1, so we can restrict our attention to reference points y¯ ∈ ∂S+1 , the boundary\nof S+1 .\nUnder the condition ρj > 1, the server in the stochastic process can remain\nserving at queue j indefinitely, so we will only consider the cases where ρj < 1\nat all queues j . Under the condition ρj < 1, we see from equation (2) that the\ntrajectory y(t) leaving y¯ ∈ ∂S+1 along \u0007j (y¯) next reaches ∂RN+ in finite time at the\npoint∑\ni \u0005=j\n(\ny¯i + λiy¯j\nµj − λj\n)\nei with projection\n∑\ni \u0005=j\n(µj − λj )y¯i + λiy¯j\n(µj − λj )+µjθj y¯j ei ∈ A\n0\nj ,\nwhere A0j = {y ∈ RN :\n∑\ni yi = 1, yj = 0, yi ≥ 0 for i \u0005= j} for j = 1,2, . . . ,N are\nregions of the switching boundary ∂S+1 and\nθj := µ−1j\n∑\ni\nλi − 1, j = 1,2, . . . ,N.(3)\nThere is a very nice geometric description of the projected process. For any\nfixed j , the lines \u0007j (y¯) through different points y¯ are parallel so they are concur-\nrent after projection, that is, their image lines on S1 are either parallel or share a\ncommon focus, vj , say. The line \u0007j (y¯) with y¯ =∑i \u0005=j λiei + (λj − µj)ej passes\nthrough 0 so vj is the point where \u0007j (y¯) meets S1 if this happens. This is the case\nwhenever θj \u0005= 0, in which case\nvj = 1\nµjθj\n(∑\ni \u0005=j\nλiei + (λj −µj)ej\n)\n.(4)\nWhen θj = 0, the \u0007j (y¯) with y¯ ∈ S1 all lie in S1 and the projected lines through\ndifferent y¯ are parallel.\nThe focus point vj will be outside S+1 when θj < 0 or when θj > 0 and ρj =\nλj\/µj < 1, conditions which correspond to the next switching event taking place\nafter some finite time.\nAs our aim is to study the switching sequence, we assume from now on that\nρi < 1, i = 1, . . . ,N and ρ =\nN∑\ni=1\nρi > 1(5)\nTRANSIENT POLLING SYSTEMS 1821\nFIG. 1. The node process when N = 3.\n(which means that the whole system is transient, yet the server does not get stuck\nat any individual node). We can now define the discrete dynamical system Z =\n{z(t)}, t = 0, 1, . . . , living on A0 ≡⋃i A0i = ∂S+1 . Define mappings\nfj (z) =\n∑\ni \u0005=j\n(µj − λj )zi + λizj\n(µj − λj )+µjθj zj ei ∈ A\n0\nj , z ∈ A0 \\A0j , j = 1, . . . ,N.(6)\nThe image under fj of a point z ∈ A0i lies at the intersection of the line through z\nand vj and the boundary region A0j , as shown for the case N = 3 in Figure 1. For\ngiven z(0) ∈ ∂S+1 let\nz(t + 1) = ϕ(z(t)), t = 0,1, . . . ,\n(7)\nwhere ϕ(z) =\nN∑\nj=1\nI{R(z)=j}fj (z), z ∈ A0.\nWe will call Z the node process, as it records information about the projection of\nthe dynamical system y(t) only at switching epochs.\n3. The three node case. From this point our analysis is restricted to the case\nwhere the system has three nodes and the switching decision is made using a gen-\neralized greedy rule. This enables us to give clear statements of our results and\nmethods, but is complex enough to be very interesting in our opinion.\n1822 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\nFIG. 2. The triangle process trajectory.\nRecall that when the server has completed all jobs at queue i, the switching rule\nis defined by parameters bij > 0 and selects the next node k when bij xj < bikxk\nfor i, j, k any permutation of 1, 2, 3. Projection by \b onto S1+ reduces the switch-\ning boundaries {x :bij xj = bikxk, xi = 0} to decision points, one on each side of\nthe triangle A0 as shown in Figure 2. This rule can be applied to the stochastic\nprocess \u0003 and the dynamical process y(t) as stated with the following resolu-\ntion of boundary cases. For the stochastic process \u0003, a randomized rule may be\nused whenever bij xj = bikxk , so we will consider the consequences for the node\nprocess Z of both possible decisions at such points. Specifically, we will consider\ntrajectories of the node process which branch when they exactly hit the decision\npoints. From now on, we will call the node process Z the triangle process and spe-\ncialize our notation. The construction in Section 2 is somewhat abstract, but the\nsystem which we have defined and wish to study is really very simple to describe.\nFigure 2 shows a trajectory starting from z(0) = z near e3. This is mapped to z(1)\nalong the line from z to v3 and then to z(2) just below d1. As z(2) is toward e2\nfrom d1, the next point z(3) is on the line from z(2) to v2. From here the trajectory\ncontinues toward v3, then v1, then back toward v3 and from there toward v2 and\nso on.\nWe note that the mapping which determines the trajectories is not continuous\nat the di . However, during extensive numerical investigation, we found that, for\nall the configurations of rates and decision points we tried, the trajectories we\nexamined converged toward periodic orbits.\nTriangle process notation. Let ıˆ, ˆ , kˆ denote the values 1, 2, 3 or either of its\ncyclic permutations 2, 3, 1 or 3, 1, 2 and let i, j, k denote any permutation of 1, 2,\n3. For z = (1 − x)eˆ + xekˆ ∈ A0ıˆ with x ∈ [0,1], we define Side(z) := ıˆ, π(z) := x\nTRANSIENT POLLING SYSTEMS 1823\nand write z = (x, ıˆ) (with standard right-hand axes, increasing x corresponds to\ngoing around the triangle anticlockwise).\nFor the triangle process Z, any generalized greedy rule R has the form\nR(x, ıˆ) =\n{\nˆ , x ≤ dıˆ ,\nkˆ, x ≥ dıˆ ,\nfor values dıˆ = (1 + bıˆkˆ\/bıˆˆ )−1 ∈ (0,1) for ıˆ = 1,2,3. The decision points (di, i)\nwill usually be written simply di . We will usually refer to rules of this type as\nthreshold rules.\nFor z = (x, i), z′ = (x′, j), we will use distance |z − z′|1 := ‖z − z′‖\/\n√\n2, the\nEuclidean distance scaled so that when i = j, |z− z′|1 = |π(z)−π(z′)| = |x −x′|,\nthat is, it is length along the side of the triangle.\nThe forward mapping ϕ defined in (7) is 1–1 except at the di which have two\nimages, while the inverse of ϕ is 1–1 where it exists. Call z a pre-image of z′ when\nz′ = ϕ(t)(z) for some t ≥ 1.\nDEFINITION. A sequence z(t), t = 0,1, . . . , satisfying (7) is a trajectory of Z.\nIf z(0) is a pre-image of a decision point di , then there are at least two trajectories\nstarting from z(0).\nWe will study closely the sets At = ϕ(At−1), t = 1,2, . . . , which are such\nthat At contains the possible locations for z(t) from all initial points z(0) ∈ A0.\nAlternatively, A0 \\At is the set of points with fewer than t pre-images, a descrip-\ntion which we will use later. The set A1 = ϕ(A0) is a strict subset of A0 for any de-\ncision points since, for example, ei \/∈ A1, i = 1,2,3. Hence, A0 ⊃ A1 ⊃ · · · ⊃ At\nfor t = 2,3, . . . . Further, A1 is a union of three disjoint closed intervals, one in\neach A0i . We introduce now the notation Ati ≡ At ∩ A0i for later use—A11 is de-\npicted in Figure 3. As only intervals containing a decision point will be split by ϕ,\nit follows that At is a union of at most 3t disjoint closed intervals.\nPeriodicity definitions. We call a trajectory z(t), t = 0, 1, . . . , eventually-m-\nperiodic if there is N > 0 such that, for all n ≥ N ,\nSide\n(\nz(n+m))= Side(z(n)).\nA trajectory which is not eventually-m-periodic for any m is called nonperiodic.\nWe say that Z has a periodic orbit if there is a finite sequence of points\nu1, u2, . . . , um with φ(ui) = ui+1 for i = 1,2, . . . ,m − 1 and φ(um) = u1. The\nsequence Side(u1),Side(u2), . . . ,Side(um) is the node-cycle of the orbit. We will\nconsider cyclic permutations of orbits\/node-cycles to be equivalent to the original\norbit\/node-cycle. All orbits are disjoint since, for any point u on an orbit, ϕ(−t)(u)\nis uniquely defined for all t ≥ 0 so there is no point at which two orbits could join.\n1824 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\nFIG. 3. The triangle process.\nA trajectory converges onto an orbit u1, . . . , um when there exists n0 ≥ 0 such\nthat\n|z(mt + n+ n0)− un|1 → 0 as t → ∞ for each n = 1,2, . . . ,m,\nthat is, for each n, the subsequence of the trajectory corresponding to phase n of\nthe node-cycle converges to un. For any point z = (x, i) ∈ A0i and 0 < ε < x, let\nNε(z) = {z′ ∈ A0i : |π(z′)− x|1 < ε}(8)\ndenote the ε-neighborhood of u, N +ε (z) = {z′ ∈ A0i : 0 ≤ π(z′) − x < ε} and\nN −ε (z) = {z′ ∈ A0i : 0 ≤ x − π(z′) < ε} the one-sided ε-neighborhoods of z. We\nwill say an orbit is stable when, for each un, there exists ε > 0 such that trajecto-\nries starting from any z ∈ Nε(un) converge onto the orbit. When trajectories started\nfrom z ∈ N +ε (un) but not from N −ε (un) (or vice versa) converge onto the orbit,\nwe say the orbit is stable on one side and otherwise we say the orbit is unstable.\nAn orbit containing a decision point must be unstable if it is of odd length m and\nmay be stable on one side if m is even.\nWe are now in position to state our main results for the triangle process Z. These\nhold for any set of parameters λi , µi , i = 1,2,3, satisfying conditions (5).\nTHEOREM 3.1. For almost all decision points di ∈ A0, i = 1,2,3, the trian-\ngle process Z has finitely many periodic orbits. For such sets of decision points,\nall trajectories z(t) are eventually periodic and each converges onto one of these\norbits as t → ∞.\nThe quantifier “almost all” is used in the sense of Lebesgue measure × counting\nmeasure on [0,1] × {1,2,3}. Due to the convergence behavior of all trajectories,\nTRANSIENT POLLING SYSTEMS 1825\nwe will call this the stable case. Typically, in this case all the orbits are stable, but\nunstable orbits are possible when an orbit includes a decision point.\nTHEOREM 3.2. For any set of decision points di, i = 1,2,3, there are at most\nfour periodic orbits.\nThe next result shows that not all choices of decision points result in all trajec-\ntories being eventually periodic.\nTHEOREM 3.3. There is an uncountable set of decision points for which Z\nhas nonperiodic trajectories.\nThese results have important consequences for the behavior of the underly-\ning stochastic process \u0003 = {ξ(t)}t . We now introduce the random times τt , t =\n1,2, . . . , at which the server changes queues. Under the assumptions in (5) on the\nparameters, the τt are all a.s. finite. The next result concerns the stochastic triangle\nprocess\nζ(t) = \b(ξ(τt )), t = 1,2, . . . .(9)\nThis process has trajectories living on A0, so we can use the same definition of\nconvergence for it as for the triangle process.\nTHEOREM 3.4. Suppose the service times have variances σ 2i < ∞. For any\nset of decision points (d1, d2, d3) such that Z is stable, the stochastic process ζ\nis also stable in the sense that a.s. each trajectory of ζ converges onto one of the\nperiodic orbits of Z.\nTHEOREM 3.5 (No zero–one law). There exist configurations of the decision\npoints such that the stochastic process ζ has nonperiodic trajectories with positive\nprobability.\nWe construct an example with trajectories that can converge to a periodic orbit\nof Z with positive probability and also can be nonperiodic with positive probabil-\nity.\nSome open problems.\n• It seems from numerical computations that there are, in fact, at most three orbits.\nIs this correct or are there examples with four orbits?\n• Is it also true that, for any given set of decision points di , the sets of parameters\nλ,µ where there are nonperiodic orbits has measure zero?\n• Which of the results proved here also hold when there are four or more nodes?\n• Can the stochastic process ζ converge with positive probability to an orbit of\neven length which contains a decision point and is only stable on one side?\n1826 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\n4. Proofs for the triangle process. The conditions for transience or recur-\nrence of the stochastic process \u0003 are in terms of the traffic intensities ρi in accord\nwith the intuition that considering weighted work at nodes rather than just the\nnumbers of queued jobs should not affect such properties. Such a re-weighting\nalso helps simplify the treatment of the triangle process. To describe its effect, we\nintroduce the fractional linear functions Fα : [0,1] → [0,1], where, for any α > 0,\nFα(x) = x\/(α+ (1−α)x). These have a key composition property Fα ◦Fβ = Fαβ .\nLEMMA 4.1 (Re-weighting). Consider the triangle process Z with parame-\nters λi , µi , di for i = 1,2,3 and define T :A0 → A0 by T (z) = Fµ\nkˆ\n\/µˆ (z), z ∈\nA0\nıˆ\n, ıˆ = 1,2,3. Z is isomorphic to the triangle process Z′ with parameters µ′i = 1,\nλ′i = λi\/µi = ρi and d ′i = T (di), i = 1,2,3. Specifically, for any given z(0) ∈ A0,\nif Z′ is started from T (z(0)), then z′(t) = T (z(t)) for t = 1,2, . . . .\nPROOF. We start by assuming that only parameters λıˆ , µıˆ for some ıˆ are\ntransformed by multiplication by α > 0 and briefly describe an isomorphism be-\ntween trajectories of the dynamical processes y and y′. Define \u0013ıˆ :R3+ → R3+ by\n\u0013ıˆ(y) = y + (α − 1)yıˆeıˆ , so \u0013ıˆ rescales R3+ by α in the eıˆ direction. Let \u0007j (y¯) and\n\u0007′j (y¯) denote the lines through y¯ parallel to the trajectories of y(t) and y′(t) respec-\ntively when the server is at node j . Then \u0013ıˆ(\u0007j (y¯)) = \u0007′j (\u0013ıˆ(y¯)). This space rescal-\ning provides an isomorphism between entire trajectories whenever the switching\ndecisions are identical, or, equivalently, r ′(\u0013ıˆ(y¯)) = r(y¯) for all y¯ ∈ ∂R3+.\nThe class of threshold policies is closed under space rescalings \u0013ıˆ with the\nparameters bˆ ıˆ being mapped to αbˆ ıˆ and bkˆıˆ to αbkˆıˆ with consequent changes\nto dˆ and dkˆ . Now for any y¯ ∈ ∂R3+ and z = \b(y¯) = (x, i), we find that z′ =\n\b(\u0013ıˆ(z)) satisfies\nz′ =\n\n\n(x, i), i = ıˆ,(\nF1\/α(x), i\n)\n, i = ˆ ,(\nFα(x), i\n)\n, i = kˆ,\nwhere (ıˆ, ˆ , kˆ) is a cyclic permutation of (1,2,3). Applying successive rescalings\nby 1\/µi in the ei direction for i = 1, 2, 3 and using the composition property\nof Fα gives the result. Note that Fα satisfies Fα(0) = 0, Fα(1) = 1 and F ′α(x) > 0,\nx ∈ (0,1), so the mapping T fixes the corners ei of A0 and smoothly rescales the\nsides. \u0001\nThe implication of Lemma 4.1 is that we need only study the triangle process\nwith parameters µ1 = µ2 = µ3 = 1 and general λi and di to understand the pos-\nsible behavior of the general case. We will work with the rates µk = 1 from this\npoint. We now find, from (3), that θk =∑n ρn − 1 =: θ > 0 for each k as we are\nin the transient case. It follows from standard projective geometry results that the\nTRANSIENT POLLING SYSTEMS 1827\nfoci vk are the vertices of an equilateral triangle V with sides parallel to the A0i , as\nshown in Figure 3. It can also be seen directly as, from equation (4) for each k,\nvk = 1\nθ\n(\nρiei + ρjej + (ρk − 1)ek) and, hence, vi − vj = 1\nθ\n(ej − ei).\nUnder conditions (5), the vk are outside S+1 , as remarked after equation (4). Let VA\ndenote those points of A0 which are internal to V and VAi = A0i ∩ VA. In Figure 3,\nVA contains all of A0 except the neighborhood of e1.\nWhen ρk < θ or, equivalently, ρi + ρj > 1, the line from vi to vj meets A0i\nat the point (1 − α)ej + αek with α = ρk\/θ ∈ (0,1), while if ρi + ρj < 1, then\nek ∈ VA. If ekˆ \/∈ VA, let Jkˆ = {z ∈ A0ıˆ :x > ρkˆ\/θ} ∪ {z ∈ A0ˆ :x < 1 − ρkˆ\/θ} denote\nthe corner of A0 containing e\nkˆ\nand lying outside VA. Let J\nkˆ\n= ∅ when e\nkˆ\n∈ VA (so\nJ2 = J3 = ∅, but J1 \u0005= ∅ in Figure 3).\nThe next two lemmas state key properties of the node process mappings but\nignore the effect of the decision points. Translating definition (6) into the triangle\nprocess notation, we find that fˆ :A0ıˆ ∪A0kˆ → A0ˆ satisfies\nfˆ (x, ıˆ) =\n(\nρıˆ(1 − x)\n1 − ρˆ + θ(1 − x), ˆ\n)\nand\n(10)\nfˆ (x, kˆ) =\n(\nρıˆx + (1 − ρˆ )(1 − x)\n1 − ρˆ + θx , ˆ\n)\nand fˆ (eˆ ) = fˆ (0, ıˆ) = fˆ (1, kˆ) = ρıˆ\/(ρıˆ + ρkˆ), which demonstrates continuity\nof the fj at the corners ej of A0.\nLEMMA 4.2 (Contraction property). The function fˆ is monotone on A0ıˆ ∪A0kˆ\nand there exists γ ∈ (0,1) and Cˆ (γ ) ⊂ A0ıˆ ∪A0kˆ such that for z, z′ ∈ Cˆ (γ )∩A0n,\nn = ıˆ, kˆ, we have |fˆ (z)− fˆ (z′)|1 < γ |z − z′|1 and further,\nCˆ (γ ) ⊃ {(x, ıˆ) : 0 ≤ x ≤ min(1, ρkˆ\/θ)} ∪\n{\n(x, kˆ) : max\n(\n0,1 − (ρıˆ\/θ)\n)≤ x ≤ 1},\nso Cˆ (γ ) ⊃ VAıˆ ∪ VAkˆ . The containment is strict if Jıˆ ∪ Jkˆ \u0005= ∅.\nPROOF. On A0\nıˆ\n, let g(x) = π(fˆ (x, ıˆ)) = ρıˆ(1 − x)\/(1 − ρˆ + θ(1 − x)).\nAs g′(x) = −ρıˆ(1 − ρˆ )\/(ρıˆ + ρkˆ − θx)2 < 0, g is monotone decreasing in x.\nChoose γıˆ such that if ρkˆ > θ , then |g′(1)| = ρıˆ\/(1 − ρˆ ) ≤ γıˆ < 1, while if\nρ\nkˆ\n< θ , |g′(ρ\nkˆ\n\/θ)| = (1 − ρˆ )\/ρıˆ ≤ γıˆ < 1. The same argument applies for se-\nlecting γ\nkˆ\non A0\nkˆ\nusing g(x) = (ρıˆx + (1 − ρˆ )(1 − x))\/(1 − ρˆ + θx). Finally,\nchoose γ ≥ max(γıˆ, γkˆ) and set Cˆ (γ ) = {z ∈ A0ıˆ ∪A0kˆ : |g′(x)| ≤ γ }. \u0001\n1828 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\nThe mapping fˆ may not be contracting near eıˆ or ekˆ if they are not in\nVA. This\nimplies that ϕ may not be contracting around, say, (x,1) if ρ3 < θ , d1 is close to e3\nand ρ3\/θ < x < d1.\nStarting from z ∈ A0i , we can apply either fj or fk to z, then again apply ei-\nther fi or fk to fj (z) ∈ A0j and so on. Let σ ∈ {1,2,3}N denote a sequence with the\nproperties σ1 \u0005= i, σt \u0005= σt−1, t = 1, 2, . . . (such a sequence will be called allowed\nsequence). For z ∈ A0i , let f (t)σ (z) = fσt (fσt−1(· · · (fσ1(z) · · ·)). As the mappings fi\nare monotone, they are invertible and we will need, a little later, to consider map-\npings f (−t)σ (z) = f (−1)σt (f (−1)σt−1 (· · · (f (−1)σ1 (z) · · ·)).\nLEMMA 4.3. There exists a constant κ > 0 such that, for any short enough\ninterval [u,w] ⊂ VAi , i ∈ {1,2,3}, and any allowed sequence σ , with the constant\nγ ∈ (0,1) from Lemma 4.2:\n(i) ∣∣f (t)σ (w)− f (t)σ (u)∣∣1 ≤ γ t |w − u|1 for t = 1,2, . . . ,\n(ii) e−κ|w−u|1 |v − u|1|w − u|1 ≤\n|f (t)σ (v)− f (t)σ (u)|1\n|f (t)σ (w)− f (t)σ (u)|1\n≤ eκ|w−u|1 |v − u|1|w − u|1 , t = 1,2, . . . ,for any v ∈ (u,w).\nPROOF. Inequalities (i) follow immediately from Lemma 4.2 since we have\nfj (\nVAi) ⊂ VAj for all pairs i \u0005= j . For part (ii), consider any monotone function g\non a short interval [a, b] with |g′(x)| > α1 > 0 and |g′′(x)| < α2. Expanding g to\nsecond order around a with Taylor’s theorem, we find that, for any c ∈ (a, b),\ng(c)− g(a)\ng(b)− g(a) =\nc − a\nb − a (1 + η) where η = O(b − a)\nand is nonzero by monotonicity of g. Composing this result t times, we obtain\n|f (t)σ (v)− f (t)σ (u)|1\n|f (t)σ (w)− f (t)σ (u)|1\n= |v − u|1|w − u|1\nt∏\nn=1\n(1 + ηn),\nwhere |ηn| < κ1|w − u|1γ n for some κ1 > 0 independent of u, v, w and σ . This\nestablishes the second set of inequalities. Intuitively, the idea here is that lines from\npoints v ∈ [u,w] to vertex vj will be almost parallel when |w − u|1 is small, so\nrelative lengths of subintervals will be about the same after mapping by fj . \u0001\nFrom Lemmas 4.2 and 4.3, it follows that there is 0 < γ < 1 such that map-\nping ϕ is uniformly contracting on C(γ ) := Cıˆ(γ ) ∪ Cˆ (γ ) ∪ Ckˆ(γ ). Fix this γ\nfrom now on.\nLEMMA 4.4. All points z on a periodic orbit lie in VA.\nTRANSIENT POLLING SYSTEMS 1829\nFIG. 4. A case in the proof of Lemma 4.4.\nPROOF. We show instead that points outside VA, that is, z ∈ J\nkˆ\nfor some kˆ,\ncannot lie on a periodic orbit because they have terminating sequences of pre-\nimages. Suppose J\nkˆ\n\u0005= ∅.\nIf neither dıˆ or dˆ ∈ Jkˆ , then ϕ(Jkˆ) ⊂ A0kˆ ∩ VA and no z ∈ Jkˆ has a pre-image.\nIf dˆ ∈ Jkˆ but dıˆ \/∈ Jkˆ , then, recalling the notation π(z) = x for z = (x, i), those\nz ∈ A0\nıˆ\n∩ J\nkˆ\nwith π(z) < π(fıˆ(dˆ )) have a single pre-image, while the other z ∈ Jkˆ\nhave none. The case with dıˆ ∈ Jkˆ but dˆ \/∈ Jkˆ is similar.\nIf both dıˆ , dˆ ∈ Jkˆ , as shown in Figure 4, then fˆ (dıˆ), fıˆ(dˆ ) ∈ Jkˆ , but no\nz ∈ {z ∈ A0\nıˆ\n:π(z) > π(fıˆ(dˆ ))} ∪ {z ∈ A0ˆ :π(z) < π(fˆ (dıˆ))} has a pre-image\nunder ϕ. Let σ = {ıˆ, ˆ , ıˆ, ˆ , . . .} and observe that f (−2t)σ (z) → ekˆ as t → ∞\nfor any z ∈ A0\nˆ\n∩ J\nkˆ\n. Hence, for z ∈ A0\nˆ\nwith π(z) > π(fj (dıˆ)), we see that\nπ(f\n(−2t)\nσ (z)) < π(fˆ (dıˆ)) for some finite t and these z have only finitely many pre-\nimages under ϕ. Any point in A0\nˆ\n∩J\nkˆ\ncan be written as fj (z) for some z ∈ A0ıˆ ∩Jkˆ ,\nso they too have finitely many pre-images in this case. We note that a forward tra-\njectory from any z ∈ J\nkˆ\neither enters VA or converges onto the period two orbit on\nthe points (ρ\nkˆ\n\/θ, ıˆ) and (1 − ρ\nkˆ\n\/θ, ˆ ). \u0001\nLEMMA 4.5. For any starting point z(0), there is t0 > 0 such that z(t) ∈ C(γ )\nfor all t ≥ t0.\nPROOF. We see that VA is closed under ϕ, so once a trajectory enters it never\nleaves. Any trajectory that never enters VA must remain in one of the Jıˆ and so, by\nLemma 4.4, converges to the two cycle on the endpoints of that Jıˆ . In either case\nLemma 4.2 implies that it enters the contracting region and remains there. \u0001\nLEMMA 4.6. For any eventually-m-periodic trajectory z(t), t = 0,1,2, . . . :\n1830 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\n(i) there exists an orbit u1, . . . , um of period m onto which the trajectory z(t)\nconverges;\n(ii) trajectories z′(t) with the same node-cycle converge onto the same orbit;\n(iii) there can be at most one orbit having a given node-cycle.\nPROOF. (i) Note that, as z(t) is eventually-m-periodic, there exists t0 > 0 such\nthat Side(z(t +m)) = Side(z(t)) for t ≥ t0. Now Lemma 4.5 implies there will be\nt1 > 0 such that z(t) ∈ C(γ ) for all t ≥ t1. Since Side(z(tm + i)) is the same for\nall t ≥ t0, Lemma 4.2 implies∣∣z((t + 1)m+ i)− z(tm+ i)∣∣1 ≤ γm∣∣z(tm+ i)− z((t − 1)m+ i)∣∣1\nand, hence, ui = limt→∞ z(tm + i) exists. For parts (ii) and (iii), Lemmas\n4.4 and 4.2 imply that, for some r ≤ m, |z(t) − z′(t + r)|1 → 0 exponentially\nquickly as t → ∞, so the trajectory z′(t) converges onto the orbit u1, . . . , um.\nThe existence of another orbit v1, . . . , vm with the same node-cycle is impossible\nbecause we can choose z′(0) = v1. \u0001\nRecall the notation At+1 = ϕ(At ) = · · · = ϕ(t+1)(A0). The set At contains all\npoints that have at least t pre-images under ϕ. Let P = {ϕ(−t)(di) : i = 1,2,3; t =\n0,1,2, . . .} be the set of pre-images of the decision points and P be its closure. Let\n|z−P |1 = infz′∈P |z−z′|1 denote the distance from z to P—of course, |z−P |1 =\n|z−P |1.\nREMARKS. If {d1, d2, d3} ∩ At = ∅ for some finite t , then P is finite. If\n{d1, d2, d3} ∩ At \u0005= ∅ for any finite t , then P can still be finite when there is a\nfinite orbit containing one or more of the decision points. The only other possibil-\nity is that at least one decision point has infinitely many distinct pre-images and\nso P is infinite. An orbit containing a decision point must be unstable if it is of\nodd length m and may be stable on one side if m is even.\nLEMMA 4.7. (i) If P is finite, then the triangle process has a finite number\nof periodic orbits and each trajectory z(t), from any starting point z(0), converges\nonto one of these orbits as t → ∞.\n(ii) Whether P is finite or not, if z \/∈ P and the trajectory z(t) with z(0) = z\nconverges onto the orbit u1, . . . , um, then, for some ε > 0, there is a unique tra-\njectory starting from each z′ ∈ Nε(z) and it converges onto this orbit.\n(iii) Any orbit u1, . . . , um with un \/∈ P for each n = 1, . . . , m is stable.\nPROOF. (i) As P is finite, we can partition A0 into |P | open intervals On\n(indexed anticlockwise from the interval containing e1, say) with points of P as\nendpoints. These On are never split by mapping with ϕ as they and their images\nnever contain decision points, so each On is mapped into another by ϕ as it is\nTRANSIENT POLLING SYSTEMS 1831\ncontinuous and monotone except at the di . Thus, ϕ induces a mapping h of the\nindices {1, 2, . . . , |P |} into itself and, hence, h has a core K ⊆ {1, 2, . . . , |P |}\nsuch that h(K) = K . As h has no fixed points, it permutes K and so factors into a\nproduct of disjoint nontrivial cycles and, hence, all trajectories starting from z \/∈ P\nare periodic with one of a finite number of node-cycles. Each node-cycle supports\nonly a single orbit by Lemma 4.6 and these trajectories converge onto one of these\norbits.\nNow consider trajectories with z(0) = z ∈ P . If, for any t ≥ 1, we have\nz(t) ∈ On for some n, then the trajectory is periodic and converges onto a finite\norbit by the above argument. This only leaves trajectories with z(t) ∈ P for all\nt ≥ 0. As was remarked when orbits were defined, all orbits are disjoint, so a tra-\njectory can only remain in P by following a single orbit.\n(ii) As z \/∈ P , the trajectory started from z never hits a decision point and so\nnever branches. As P is closed, there exists ε > 0 such that |z − P |1 > ε, so no\ntrajectory started from any z′ ∈ Nε(z) ever branches. As Nε(z) contains no pre-\nimages of decision points, the same switching decisions are made for each of these\ntrajectories at all times t , so they have the same node-cycle and by Lemma 4.6, they\nconverge to the orbit u1, . . . , um. Part (iii) follows immediately by considering\nz(0) = u1. \u0001\nWe are now ready to establish Theorems 3.1 and 3.2. Let µ denote Lebesgue\nmeasure on A0 in the following proofs. This measure is consistent with the dis-\ntance | · |1 we are using and any null sets in A0 will remain so under change of the\nparameters, as the re-weighting in Lemma 4.1 is smooth.\nPROOF OF THEOREM 3.1. It suffices to show that almost all choices of deci-\nsion points di lie outside the At they generate after some finite t . It follows from\nLemmas 4.4 and 4.2 that µ(At) → 0 as t → ∞ for any decision points di , but this\nis not sufficient since lim inft At is a function of the di . What we show is that, for\nany given parameters ρi , there is a measure zero set of locations for the decision\npoints where they could have infinitely many pre-images.\nWe start with the case ei \/∈ VA or, equivalently, Ji \u0005= ∅, i = 1,2,3. Let J 1i =\nfi(Ji) and J t+1i = fi(J tj ∪ J tk ) for i = 1,2,3 and t = 1,2, . . . (here {j, k} =\n{1,2,3} \\ {i}). These sets are well defined as J 1i ⊂ VAi and, hence, J ti ⊂ VAi\nfor all t . Further, Ji ∩ J 1i = ∅ and, hence, J t+1i ∩\n⋃t\nn=1 Jni = ∅ for all t . Let\nI ti = VAi \\\n⋃t\n1 J\nn\ni and note that I\nt+1\ni = fi(I tj ∪ I tk).\nWe initially consider only VAi . At stage t ′, the set\n⋃t ′\n1 J\nn\ni consists of 2t\n′+1 − 1\ndisjoint intervals interleaved with the 2t ′+1 intervals forming I t ′i . The set J t\n′+1\ni\ncontains 2t ′+1 intervals, each interior to one of those of I t ′i . Recall that µ is the\nmeasure induced by the distance | · |1. Let K > 0 be such that µ(I t ′j ) < Kµ(J t\n′+1\nj ),\nj = 1, 2, 3. As ∑tn=1 µ(Jni ) ≤ µ(VAi) ≤ 1, it follows that µ(J ti ) → 0 as t → ∞.\n1832 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\nFrom Lemma 4.3(i), each subinterval of I t ′j , j = 1, 2, 3, has length bounded\nby γ t ′ for some γ < 1. Now from Lemma 4.3(ii), it follows, by summing over all\nthe subintervals in I t ′i and mapping sequences, that\nµ\n(\nI t\n′+t\ni\n)\n< eκγ\nt ′\nKµ\n(\nJ t\n′+t+1\ni\n)\n, t = 2,3, . . .\nand, hence, µ(I ti ) → 0 as t → ∞. The set I ti contains all points in A0i that could\nhave t or more pre-images, given appropriately chosen decision points. Hence,\nI∞i =\n⋂∞\n1 I\nt\ni contains those points that could have infinitely many pre-images and\nµ(I∞i ) = 0 .\nThis construction is independent of the choice of the decision points and works\non all three sides of VA. With I∞ =⋃31 I∞i , we have shown µ(I∞) = 0, that is,\nµ-almost all choices of the decision points have only finitely many pre-images\nunder the mapping ϕ that they define. The theorem now follows in this case from\nLemma 4.7.\nIt remains to modify this argument in the case where one or more of the ei ∈\nVA. For any such corner, Ji = ∅, so let J 0i (ε) = {|z − ei |1 < ε} when ei ∈ VA,\nJ 0i = Ji otherwise, where ε > 0 is small. The previous double mapping process\nwill produce overlapping sets, so we modify it by setting J 1i = fi(J 0i ) \\ (J 0j ∪\nJ 0k ) and then J\nt+1\ni = fi(J tj ∪ J tk ) \\ (J 0j ∪ J 0k ) for i = 1, 2, 3 and t = 1, 2, . . . .\nThis change ensures the previous disjointness properties and the construction goes\nthrough without further change, except that now some of the sub-intervals of I ti\nmay be empty. As before, we conclude that µ(I∞) = 0, though here I∞ does\ndepend upon ε.\nTo relate this construction to the existence of pre-images, let Dn = {(d1, d2,\nd3) : all z ∈ J 0i (1\/n), i = 1,2,3, have no legitimate pre-images under ϕ}. Then⋃\nnDn = A01 × A02 × A03. For any fixed n, D∞n = Dn ∩ I∞ has µ(D∞n ) = 0 and\nhence µ(\n⋃∞\n1 D\n∞\nn ) ≤\n∑∞\n1 µ(D\n∞\nn ) = 0. Now the result follows as before. \u0001\nPROOF OF THEOREM 3.2. We consider first the case where P = {ϕ(−t)(di) :\ni = 1,2,3; t = 0,1,2, . . .}, the set of pre-images of the decision points, is finite.\nA point z ∈ P is of type i when it is a pre-image of di . P splits A0 into closed\nintervals Mn, n = 1, 2, . . . , |P | which are never split by iterated mappings with ϕ.\nHence, each Mn contains points from at most one periodic orbit and as ϕ is con-\ntracting on VA, each Mn can contain only a single point from an orbit—in cases\nwhere the shared endpoint of Mn and Mn+1 lies on an orbit, that is, this orbit con-\ntains one or more decision points, there can be at most one other orbit with a point\nin Mn ∪Mn+1.\nThe number of orbits is limited by each di being at the boundary of just two\nintervals. Consider an orbit with a point u ∈ Mt which has an endpoint ϕ(−r)(di).\nThe point ϕ(r)(u) lies on the same orbit but occupies one of the Mn neighboring di ,\nor equals di . By the preceding paragraph, there are at most six orbits.\nTRANSIENT POLLING SYSTEMS 1833\nWe can reduce the bound as there are at least two intervals Mn with endpoints\nof different type, ij and ik, say. Suppose the first is Mt with endpoints ϕ(−r)(di)\nand ϕ(−s)(dj ) with r < s. The interval ϕ(r)(Mt) has endpoints di and ϕ(r−s)(dj )\nso it neighbors di . ϕ(s)(Mt) sits inside an interval neighboring dj . If Mt contains\na point from an orbit, then this orbit occupies two of the six intervals neighboring\nthe decision points. If Mt contains no point from any orbit, then neither can one\nof the intervals neighboring di . Either way, the maximum number of orbits is now\nonly five. Repeat the argument with the interval with endpoints ik and there are at\nmost four orbits in the stable case, that is, where P is finite.\nWe now extend this argument to the case where P is infinite—let P ′ = {z ∈\nP : z has infinitely many pre-images}. Suppose there are some finite orbits and\nconsider any of them. It cannot include any points in P ′, so choose ε > 0 small\nenough that |un − di |1 > ε for every un on the orbit and each di ∈ P ′. It follows\nthat |un − ϕ(−r)(di)|1 > ε for every un on the orbit and every point in P ′ for sup-\npose this was not true. Select the ϕ(−r)(di) with minimal r within ε of un. By\nLemma 4.3(i), it follows that∣∣ϕ(r)(un)− di ∣∣1 ≤ γ r ∣∣un − ϕ(−r)(di)∣∣1 < ε,\nin contradiction to our choice of ε. Now our argument for the stable case applies\nwith the added possibility that one or more di may be limit points (from one or\nboth sides) of P further restricting the opportunities for orbits. \u0001\nWe show later that it is possible for finite orbits to exist simultaneously with\nnonperiodic trajectories in this nonstable case. In our study of this model we sim-\nulated the triangle process over the whole range of its parameters ρi and di . To\navoid problems with rounding, we used an algebraic representation of the process\nwhich is described below in Section 5. The representation there of the decision\npoints has to be finite in practice, so the results of the computer analysis were\nsometimes inconclusive, for example, the implemented algorithm sometimes pro-\nduced trajectories that were not trapped by an orbit in the number of steps we could\naccurately calculate. Otherwise, the algorithm identified either 1, 2 or 3 orbits and\nnever more. Therefore, we conjecture that Theorem 3.1 can be strengthened, by\nreplacing at most four orbits by three orbits. We did not manage to prove this an-\nalytically, though. That three orbits can exist is easily seen after a little numerical\nwork with Figure 5 as a guide.\n5. The triangle process in the nonstable case. We now show that there are\nlocations for the decision points where at least one of them has infinitely many\npre-images and nonperiodic trajectories exist. This argument necessarily uses yet\nanother way of describing the triangle process. We will consider only the case\nwhere each Ji = ∅, but our construction can be carried out in other cases too, with\nsome limitations.\n1834 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\nFIG. 5. An example with three orbits.\nWe first construct a binary representation z = ıˆ :x1x2x3 . . . with each xt ∈ {0,1}\nfor all points of A0. For each z ∈ A0\nıˆ\n, ıˆ = 1,2,3, set [recall the notation π(·) from\nSection 3]\nx1 =\n{0, if π(z) < π(fıˆ(eıˆ)),\n1, if π(z) ≥ π(fıˆ(eıˆ)).\nTo continue this construction, set B1\nıˆ\n= {fıˆ(eıˆ)} and Bt+1ıˆ = fıˆ(Btˆ ∪Btkˆ) for ıˆ = 1,\n2, 3 and t = 1, 2, . . . .\nEach set Bt\nıˆ\ncontains 2t−1 points which, by monotonicity of the mappings fıˆ ,\ninterleave the 1 + 2t−1 points of ⋃t−1r=1 Brıˆ and, hence, split in two each of the 2t−1\nintervals created up to stage t − 1. Label the br ∈ Btˆ ∪ Btkˆ clockwise and the\nar ∈⋃t−1r=1 Brıˆ anticlockwise so that a0 = ej and\nπ(ar−1) < π(fıˆ(br)) < π(ar), r = 1,2, . . . ,2t−1,\nand for z ∈ [ar−1, ar), set\nxt =\n{0, if π(z) < π(fıˆ(br)),\n1, if π(z) ≥ π(fıˆ(br)).\nThis encodes every point of A0 with a unique binary code up to the usual indeter-\nminacy for points terminating with infinite strings of zeros or ones, for example,\ne1 = 2 : 111 · · · = 3 : 000 · · · .\nThis binary encoding can be used to define a distance between points z =\ni :x1x2 · · · , z′ = i :x′1x′2 · · · by\n|z− z′|b ≡\n∞∑\nt=1\n|xt − x′t | · 2−t(11)\nTRANSIENT POLLING SYSTEMS 1835\nand we note the following: (i) ordering of points on A0i by π(z) corresponds to\nlexicographic ordering on the binary sequence x; (ii) any sequence of points which\nis convergent under | · |1 remains convergent under | · |b and vice versa; (iii) this\nmetric induces a measure µb on A0i .\nIn defining the required decision points, we will make much use of the inverse\nmapping ψ , where\nψ(z) = f (−1)i (z), z ∈ A0i\nfor i = 1,2,3. When ϕ(−1)(z) exists, then we will say ψ is legitimate and we\nhave ψ(z) = ϕ(−1)(z). The mapping ψ can be described quite simply using the\nbinary encoding. For z = ıˆ :x1x2 · · · with x1 = 0, then ψ(z) = kˆ :y1y2 · · · , where\ny1 = 1 − x2, y2 = 1 − x3 and so on. In general, let w¯ = 1 − w for w ∈ {0,1},\nx¯ = x¯1x¯2 · · · and with this notation ψ maps\nıˆ : 0x −→ kˆ : x¯ and ıˆ : 1x −→ ˆ : x¯(12)\nfor ıˆ = 1, 2, 3.\nThe forward mapping ϕ thus can be represented as\nıˆ :x −→ ˆ : 0x¯ if x ≤ dıˆ and ıˆ :x −→ kˆ : 1x¯ if x ≥ dıˆ .\nNow represent each point of A0 by a point in the interval [0,1] using the mapping\ni :x1x2 · · · −→ i − 13 +\n1\n3\n∞∑\nj=1\n2−j xj\nand ignore, for the moment, the branching at the decision points. The forward\nmapping ϕ becomes\nϕ(x) =\n{−12x + 1, for x ∈ [d˜1, d˜2)∪ [d˜3,1),\n−12x + 12 , for x ∈ [0, d˜1)∪ [d˜2, d˜3),\n(13)\nfor x ∈ [0,1), where d˜1, d˜2 , d˜3 ∈ [0,1) are the points corresponding to the decision\npoints. The mapping above can be regarded as a particular case of the affine inter-\nval exchange transformation model (see, e.g., [2, 7]). The mapping defined by (13)\nis contracting and is not order-preserving, which makes it different from the usual\nand well-studied case of interval exchange transformations (see, e.g., [3, 11] and\nreferences therein). Note also that, for interval exchange transformations with con-\ntracting and\/or flips, it is natural that cycles do exist (see [3]), as happens in our\nmodel.\n5.1. A decision point with infinitely many pre-images. We are now ready to\nconstruct decision points providing a nonstable case. We will use q = 1001 and\nr = 0110, two four digit sequences such that q¯ = r and such that ψ successively\nmaps z = ıˆ :qx and z = ıˆ : rx as follows:\nz = ıˆ : 1001x −→ ˆ : 110x¯ −→ kˆ : 01x −→ ˆ : 0x¯ −→ ıˆ :x = ψ(4)(z)\n1836 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\nand, similarly,\nz = ıˆ : 0110x −→ kˆ : 001x¯ −→ ˆ : 10x −→ kˆ : 1x¯ −→ ıˆ :x = ψ(4)(z).\nThe decision points have the form\nd1 = 1 :qrx · · · ,\nd2 = 2 : 1010100000 · · · ,(14)\nd3 = 3 : 0100000 · · · ,\nwhere x, the infinite tail of the sequence for d1, will be constructed recursively\nat a later point to ensure that d1 has infinitely many legitimate ψ-images. As the\nnotation di identifies the triangle side, we will sometimes use it to denote just the\nbinary sequence. Note that, under lexicographic ordering, r = 0110 < 1001 = q .\nFor d1 to have infinitely many legitimate ψ-images, it must certainly have one\nand the intervals with at least one legitimate ψ-image are\non A01 [0d3,1d2] = [0101111 · · · ,1010101111 · · ·],\non A02 [0d1,1d3] = [0rqx¯ · · · ,110111111 · · ·],\non A03 [0d2,1d1] = [00101011111 · · · ,1rqx¯ · · ·],\nwhich the reader can readily check certainly contain d1 and the ψ(t)(d1) for t =\n1, 2, . . . , 8. We will construct the rest of the binary sequence for d1 so that its\nψ-images always fall in these three intervals by finding a sequence of quadruples\nq and r that guarantees legitimacy.\nExtended legitimacy property. The sequence d1 = y1y2y3 · · · where y1 = q ,\ny2 = r and yt ∈ {q, r} for t = 3,4, . . . has extended legitimacy if, under lexico-\ngraphical ordering,\n(a) when yt = r , then yt+1yt+2 · · · > d1,\n(b) when yt = q , then yt+1yt+2 · · · < d1,\nwhere q > r as remarked above.\nAt each t ≥ 3 this property ensures the legitimacy of ψ(4t−r)(d1) for r = 3, 2,\n1, 0. We will now construct an aperiodic sequence with extended legitimacy and\nshow that this means there are decision points leading to the existence of aperiodic\norbits which is crucial for establishing Theorem 3.3.\nFix an irrational α ∈ (1,2) and some β ∈ [−1,1]. Let y = y(α,β) = y1y2y3 · · ·\nbe a sequence of quadruples q and r with y1 = q , y2 = r and for t = 3,4, . . . ,\nyt+1 =\n{\nq, if 1 +Qt < α(1 +Rt)+ β,\nr, otherwise,\nwhere Qt = Qt(y) =∑tr=1 1{yr=q} and Rt = t − Qt , that is, Qt is the number of\ntimes q appears in the sequence y1y2 · · ·yt . This sequence is defined using suc-\ncessive rational approximations to the irrational number α as shown in Figure 6,\nwhich shows a staircase approximating the line y = αx + β .\nTRANSIENT POLLING SYSTEMS 1837\nFIG. 6. Staircase diagram for sequence qrqqrqrq . . . .\nLEMMA 5.1. There are uncountably many sets of decision points where at\nleast one of them has infinitely many pre-images.\nPROOF. We first show that, for any irrational α > 0, the sequence y′ =\ny(α,β ′) is lexicographically less than y′′ = y(α,β ′′) whenever −1 ≤ β ′ < β ′′ ≤ 1.\nSuppose y′ and y′′ are not equal. Then there is t ≥ 1 such that y′n = y′′n for\nn ≤ t , but y′t+1 \u0005= y′′t+1. Evidently, Qt(y′) = Qt(y′′) and Rt(y′) = Rt(y′′), so the\nonly way for y′t+1 \u0005= y′′t+1 is\nα\n(\n1 +Rt(y′))+ β ′ < 1 +Qt(y′)\n= 1 +Qt(y′′)\n< α\n(\n1 +Rt(y′′))+ β ′′,\nin which case y′t+1 = r < q = y′′t+1. As the fractional parts of mα, m = 1,2, . . . ,\nare dense in (0,1), the inequalities β ′ < n − mα < β ′′ are satisfied for infinitely\nmany pairs of integers m, n and so the above inequalities also show that y′ = y′′ is\nnot possible.\nNow consider the sequence y = y(α,0) which starts qr · · · . Each r is followed\nby a q and there cannot be more than two qs in succession as α < 2. Suppose\nyt = r . Then the sequence yt+1yt+2yt+3 · · · coincides with y(α,βt ), where\nβt = αRt −Qt > 0\n1838 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\nand so yt+1yt+2yt+3 · · · > y. If instead yt = q , then either yt+1 = r so that imme-\ndiately we have yt+1yt+2yt+3 · · · < y or yt+1 = q , in which case yt+1yt+2yt+3 · · ·\ncoincides with y(α,βt ), where\nβt = αRt −Qt < 0\nand so yt+1yt+2yt+3 · · · < y. In all cases we see that the sequence y has extended\nlegitimacy at t for all t ≥ 3. As α is irrational, αRt − Qt = 0 is not possible and,\nhence, there is no t such that yt+1yt+2yt+3 · · · = y from which it follows immedi-\nately that y is aperiodic.\nTo establish this lemma, let d1 = 1 :y(α,0) and d2, d3 be as defined in (14)\nfor some irrational α ∈ (1,2). By construction, d1 has an infinite sequence of le-\ngitimate ψ-images or, equivalently, an infinite sequence of pre-images under ϕ.\n\u0001\nREMARKS. For the above set of the decision points, there is also a period 3\norbit: (a, c, b), with the points of the orbit given by\n1 : 101010 · · ·10 · · · ,\n3 : 101010 · · ·10 · · · ,(15)\n2 : 101010 · · ·10 · · · .\nWe mention here that originally we were not sure that the nonstable case was pos-\nsible and unsuccessfully tried to prove this using the triangle process description\nof this section. The specific combination of decision points producing the nonpe-\nriodic orbits described above was discovered by studying computer output (of a\nprogramme written to generate sample trajectories) to assess various lines of in-\nvestigation.\n5.2. The nonstable case has µb-measure 0. The measure µb on A0 induced\nby the metric | · |b is generally singular with respect to Lebesgue measure, but the\nset of decision points with infinitely many ϕ pre-images has µb-measure 0.\nSuppose we select the decision points uniformly, that is, each digit in the binary\nsequence is 0 or 1 with chance 1\/2 independently of the other digits. Then µb\na.s. we can write, for some k ≥ 0,\nd2 = 2 : 11 · · ·11︸ ︷︷ ︸\nk times\n0 · · · .\nThis means the interval in A01 with legitimate ψ-images has left endpoint\n00 · · ·00︸ ︷︷ ︸\nk+1 times\n1 · · · .\nTRANSIENT POLLING SYSTEMS 1839\nThe Borel–Cantelli lemma tells us that µb a.s. there is a subsequence in the binary\nsequence for d1 of the form\ny = 00 · · ·00︸ ︷︷ ︸\nm times\n10 00 · · ·00︸ ︷︷ ︸\nm times\n10 00 · · ·00︸ ︷︷ ︸\nm times\n,\nwhere m> k + 3 is even. Now consider the sequence ψ(t)(d1), t ≥ 1. For some r ,\nψ(r)(d1) starts with either the above sequence y or with y¯ and for some s ≤ 2m+6,\nψ(t+s)(d1) is a point on A01 with binary sequence starting with at least k + 2 zeros\nand so its next ψ-image is not legitimate. It follows immediately that the set of\ndecision points di with infinitely many pre-images has µb-measure 0.\n5.3. Properties of the deterministic system when P is infinite. For the triple\nof the decision points constructed in (14), d1 has infinitely many pre-images and\nsince ψ−5(d2) = 1 : 000 · · · = e2 and ψ−2(d3) = 1 : 111 · · · = e3, both d2 and d3\nhave finitely many pre-images under ϕ, unlike d1. Throughout this section, the\ntriple of the decision points is assumed to be such that d1 has infinitely many pre-\nimages, while d2 and d3 have only finitely many. We also assume in this subsection\nthat VA = A0 so that ϕ is contracting everywhere.\nLet P1 = {d1,ψ(d1),ψ(2)(d1), . . .} be the infinite set of pre-images of d1 under\nϕ which, by assumption, are all legitimate. We will study the properties of this set.\nLet P 1 denote the closure of the set P1.\nLEMMA 5.2. Each u ∈ P1 is a limiting (accumulation) point of P1.\nPROOF. It is sufficient to show that d1 is a limiting point for P1. Indeed, since\nthe mapping ψ doubles the distance | · |b between points, if d1 is limiting for a\nsequence u1, u2, . . . ⊂ P1, then ψ(i)(d1) is a limiting point for ψ(i)(u1), ψ(i)(u2),\n. . . ⊂ P1 [as mentioned just after (11), the distances | · |1 and | · |b are topologically\nequivalent so sets of points generate the same limit points under both].\nConsider any point u ∈ A0 which is a limiting point for P1, that is, there is a\nsequence of indices t1 < t2 < t3 < · · · such that limn ψ(tn)(d1) = u. No such u can\nbe a pre-image of d2 or d3, as for each t , A0 \\At , the set of points with fewer than t\nlegitimate pre-images, is open. Hence, around each pre-image of d2 or d3 there is\nan open interval of points which have only finitely many pre-images and so cannot\ncontain any ψ(t)(d1).\nIf u ∈ P1, then u = ψ(m)(d1) for some m which is unique (otherwise u is in a\nfinite orbit and P1 cannot be infinite). Without loss of generality, we can assume\nm < t1 and then, since the mapping ϕ(m) is continuous except at ψ(n)(d1) for\nn <m, d1 = φ(m)(u) = limn ψ(tn−m)(d1).\nIf u \/∈ P1, fix a small ε > 0 and consider the ε-neighborhood Nε(u) of u as\ndefined in (8). Assume that ε is so small that there are no pre-images of d2 or d3\nin Nε(u). Let m be the smallest index such that ψ(m)(d1) ∈ Nε(u). Then Nε(u)\n1840 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\ncontains infinitely many points of P1 and each is a pre-image of d1 with the index\nof at least m. Now map Nε(u) with ϕ(m)(·) which sends ψ(m)(d1) to d1 and all\nthe points of the neighborhood Nε(u) follow the same trajectory. As ϕ(m)(·) is\ncontracting here, ϕ(m)(Nε(u)) is an interval within Nε(d1). This implies that there\nare infinitely many points of P1 in Nε(d1). Letting ε ↓ 0, we obtain that d1 is a\nlimiting point for P1. \u0001\nThe following statement immediately follows from Lemma 5.2, properties of\nperfect sets and the fact that P1 is infinite and countable.\nCOROLLARY 5.1. The set P 1 is a perfect set (≡ it is closed and every point\nof it is an accumulation point). Therefore, P 1 is uncountable, and hence, P 1 \\P1\nis also uncountable.\nRecall that P is the union of P1 and the set of d2 and d3 and their finitely\nmany pre-images. Then P is the union of P 1 and the set of d2 and d3 and their\npre-images, and is also closed.\nLEMMA 5.3. If u ∈ P 1, then u does not belong to any finite orbit and no\ntrajectory z(t) with z(0) = u can be periodic.\nPROOF. If u ∈ P1, then ϕ(n)(u) = d1 for some n. However, if u belonged to a\nfinite orbit, then ϕ(m)(u) = u for some m and, hence, ϕ(m)(d1) = d1, contradicting\nthe fact that d1 has more than m distinct pre-images under ψr = ϕ(−1).\nNow suppose u ∈ P 1 \\ P1 and u belongs to a finite orbit. As d2, d3 \/∈ An for\nsome finite n and An is closed, we can choose ε > 0 so that |di − An|1 > ε for\ni = 2, 3. Since P 1 ⊂ An, it follows that the neighborhood Nε(u) contains no pre-\nimages of d2 or d3. Let n = n(ε) be the smallest index such that ψ(n)(d1) ∈ Nε(u).\nAs ϕ(n) does not split this neighborhood, ϕ(n)(Nε(u)) ⊂ N2ε(d1) and so there is a\npoint of the orbit, u′, say, with |u′ − d1|1 < 2ε. Letting ε ↓ 0, we obtain a contra-\ndiction, since this orbit contains only m distinct points and does not contain d1.\nFinally, consider any trajectory z(t) with z(0) = u and suppose it is periodic. By\nLemma 4.6(i), z(t) converges onto an orbit w1, . . . , wm and we have just shown\nthere exists ε > 0 such that Nε(w1)∩P 1 = ∅. However, z(t) = ϕ(t)(u) ∈ Nε(w1)\nfor some large t , while simultaneously, by Lemma 5.2, ϕ(t)(u) is a limiting point\nand, hence, an element of P 1 which is impossible. \u0001\nPROOF OF THEOREM 3.3. Lemma 5.1 explains how to construct d1 with an\ninfinite sequence of pre-images under ϕ. Also, by Lemma 5.1, the binary sequence\nfor d1 is not periodic and, hence, by Lemma 5.3, there are nonperiodic trajectories\n{z(t) : t ≥ 0} for the triangle process. \u0001\nThis completes the main task of this section, but it is possible to say more about\nthe mixture of periodic and nonperiodic trajectories. We know from Lemma 4.6(ii)\nTRANSIENT POLLING SYSTEMS 1841\nthat all periodic trajectories avoiding decision points are stable. It is easy to see that\nthere can be stable periodic trajectories even if P is infinite. For example, for the\ndecision points given by (14), the sequence in (15) is an orbit with period 3.\nWe say that a point u ∈ A0i is an R-limit (L-limit resp.) for P1 if there is a\nsequence of points u1, u2, . . . in A0i ∩P1 such that π(un) ↓ u [π(un) ↑ u resp.], that\nis, for an R-limit, un+1 is clockwise of un for each n. The next result strengthens\nLemma 5.2.\nLEMMA 5.4. Each point u ∈ P1 is limiting for P1 on both sides, that is, it is\nboth an R-limit and an L-limit for P1.\nPROOF. It suffices to show that d1 is both an R-limit and an L-limit, since all\nother points of P1 are ψ-images of d1.\nBy Lemma 5.2, d1 is a limiting point for P1, but suppose that it is just an R-limit\nand not an L-limit. Then there is δ > 0 such that:\n(i) there are no P1 points on the interval (d1 − δ, d1), and\n(ii) there are no pre-images of d2 or d3 in the segment [d1, d1 + δ].\nSince mapping ψ reverses the orientation of intervals, if u = ψ(n)(d1) ∈ A01 and n\nis even, then u is an R-limit and not an L-limit, while if n is odd, then u is an\nL-limit and not an R-limit.\nFix 0 < δ1 < δ. Denote dn1 := ψ(n)(d1), n = 1,2, . . . , and define\nr := min{n :ψ(n)(d1) ∈ (d1, d1 + δ1]},(16)\nso dr1 is the point of P1 ∩[d1, d1 + δ1] with the smallest index. If r is even, then we\nobtain a contradiction since ϕ(r)((d1, dr1]) is not split during these mappings and\nϕ(r)(dr1) = d1. Since r is even, ϕ(r) preserves orientation and is contracting so that\nϕ(r)((d1, d\nr\n1]) ⊂ (d1 − δ, d1], which contradicts the assumption that (d1 − δ, d1)∩\nP1 = ∅.\nTherefore, in any small interval (d1, d1 + δ1), dr1 has r odd and there will be\ninfinitely many dn1 with odd n within (d1, d1 + δ1). This implies there will also\nbe dm1 with even m in (d1, d1 + δ1) since ϕ(r) reverses orientation and is contract-\ning, so ϕ(r)((d1, dr1]) ⊂ [d1, dr1) and all the dn1 ∈ (d1, dr1] with odd n > r have been\nmapped to dn−r1 with n− r even.\nNow choose dm1 in (d1, d1 + δ) with the smallest possible even index m ≥ 2 and\nchoose odd index t < m such that dt1 ∈ (d1, dm1 ) with dt1 the closest of such points\nto dm1 . Such a t ≥ r exists by the arguments following (16) above. The interval\n(dt1, d\nm\n1 ] contains no dn1 with index less than m so, as ϕ(t) reverses orientation and\nis contracting, ϕ(t)(dm1 ) = dm−t1 ∈ (d1 − δ, d1), contradicting the assumption that\n(d1 − δ, d1)∩P1 = ∅. \u0001\n1842 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\nLEMMA 5.5. Fix a point u and suppose u \/∈ P . Then u belongs to the segment\n[l˜(u), r˜(u)] = [l˜, r˜] such that each of l˜ and r˜ is either a pre-image of d2 or d3, or\nbelongs to P 1 and l˜(u) is the largest of such points and r˜(u) is the smallest of such\npoints:\nl˜(u) = max{π(s) : Side(s) = Side(u), π(s) < π(u), s ∈ P },\nr˜(u) = min{π(s) : Side(s) = Side(u), π(s) > π(u), s ∈ P }.\nMoreover, the trajectory started from u can be periodic only if both l˜(u) and r˜(u)\nare pre-images of d2 or d3.\nPROOF. The existence of l˜(u) and r˜(u) follows from the fact that P is closed.\nAlso, π(l˜(u)) < π(r˜(u)) since the complement of the set P is open.\nSuppose, for example, that l˜(u) is not a pre-image of d2 or d3, that is, l˜(u) ∈ P 1.\nSince there are no pre-images of the decision points on [l˜(u), u], u and l˜(u) can\nfollow the same trajectory under mapping ϕ. On the other hand, by Lemma 5.3, no\ntrajectory started from l˜(u) is periodic, hence, the trajectory starting from u is not\nperiodic. \u0001\nLemma 5.5 implies that the set of points from which periodic trajectories can\nstart—call this the periodic set—consists of finitely many intervals, since d2 and d3\nhave only finitely many pre-images. Also, the periodic set has measure smaller than\nthe total length of the sides of the triangle, since P1 is infinite. At the same time,\nLemma 5.4 yields that, for any u \/∈ P , if l˜(u) ∈ P 1, then l˜(u) \/∈ P1, and the same\nis true for r˜(u).\nCall the set of points u for which one of l˜(u) or r˜(u) is in P 1, while the other\nis a pre-image of d2 or d3, semi-periodic. The endpoint which is in P 1 will be\nreferred to as an aperiodic endpoint.\nSince there are finitely many pre-images of d2 and d3, the length \u0019 > 0 of the\nshortest interval in either in the periodic set or the semi-periodic set is properly\ndefined. We say that a point belongs to the aperiodic set if it does belong either to\nthe periodic or the semi-periodic set.\n6. Behavior of the stochastic process when P is finite. We can now show\nhow the behavior of the stochastic process \u0003 introduced in Section 2 is influenced\nby the behavior of the deterministic triangle process. Recalling (9), we consider\nζ(n) = \b(ξ(τn)),\nthe projection onto S+1 of \u0003 at the random times τn, n = 0,1,2, . . . , when the\nserver switches from one queue to another (where τ0 = t0, a constant to be deter-\nmined), under the transience conditions in (5), that is, λi\/µi = ρi < 1 for each i\nand ρ =∑ρi > 1.\nTRANSIENT POLLING SYSTEMS 1843\nWe wish to prove Theorem 3.4, namely, that the trajectories of ζ(n) a.s. con-\nverge onto one of the stable orbits of the triangle process, under the assump-\ntion that P , the set of pre-images of the decision points under ϕ, is finite and\nP ∩At = ∅ for some finite t .\nRecall the assumption that the service time distribution with the server at\nqueue i has finite variance σ 2i . It is convenient, as with the triangle process, to\nuse the transformation in Lemma 4.1, so we can assume that each µi = 1. We now\nspell out some elementary properties of random walks and Poisson processes.\nPreliminaries. Consider a random walk Sn = ∑nt=1 Xt on Z, where S0 = 0,\nE(Xt) = ρj − 1 < 0 and Var(Xt) = σ 2 and Xt ≥ −1. Define the stopping times\nTc = min{n :Sn = −c} for c = 1, 2, . . . and let T1,n be independent copies of T1\nso that Tc is equal in distribution to\n∑c\nt=1 T1,t . Using the standard martingales\nSn +n(ρj − 1) and (Sn +n(ρj − 1))2 −nσ 2, we find that E(T1) = 1\/(1−ρj ) and\nVar(T1) = σ 2\/(1 − ρj )3 and, hence, that\nE(Tc) = c\/(1 − ρj )\nand\nVar(Tc) = cσ 2\/(1 − ρj )3.\nChebyshev’s inequality provides the bound P[|Tc − c\/(1 − ρj )| > c2\/3] ≤\ncσ 2\/c4\/3(1 − ρj )3 = c−1\/3σ 2\/(1 − ρj )3 on the likely size of deviations from\nthe mean.\nNext consider a homogeneous Poisson process with arrivals at rate ρ and\nlet L = L0 + N(Tc), where L0 is constant and N(Tc) the number of arrivals\nby time Tc. Standard calculations give E(L) = L0 + ρE(Tc) and Var(L) =\nρ2 Var(Tc)+ ρE(Tc). Applying these to the process \u0003 over the interval τn+1 − τn\nwith the server at node j , we have, for i \u0005= j ,\nE\n(\nξi(τn+1)|ξ(τn))= ξi(τn)+ ρiξj (τn)\n(1 − ρj )(17)\nand\nVar\n(\nξi(τn+1)|ξ(τn))= ξj (τn)ρ2i σ 2j + ρi(1 − ρj )2\n(1 − ρj )3 .(18)\nUsing Chebyshev’s inequality, we have\nP\n[∣∣∣∣ξi(τn+1)− ξi(τn)− ρiξj (τn)(1 − ρj )\n∣∣∣∣> ξj (τn)2\/3∣∣∣ξ(τn)\n]\n(19)\n≤ ξj (τn)−1\/3\nρ2i σ\n2\nj + ρi(1 − ρj )2\n(1 − ρj )3 .\n1844 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\nWhile typical deviations on the number of arrivals are of order\n√\nξj (τn), this simple\nbound for larger deviations will be enough for our purposes.\nTo estimate the effect of the projection, we apply Taylor’s theorem to the func-\ntion\ng(u1, u2;a, b) = a + u1\nb + u1 + u2 ,\nwhere 0 ≤ a ≤ b are constants [compare with equation (10)], which provides the\nformula\ng(u1 + h1, u2 + h2;a, b)− g(u1, u2;a, b) = h1u2 − h2(a + u1)\n(b + u1 + u2 + α(h1 + h2))2 ,\nwhere α ∈ (0,1). Applying this at u1 + u2 = u with |hi | ≤ u2\/3 for i = 1, 2—the\ndeviation considered in (19)—we obtain the bound\n|g(u1 + h1, u2 + h2;a, b)− g(u1, u2;a, b)|\n≤ (a + u1 + u2)(|h1| + |h2|)\n(b + u1 + u2 + α(h1 + h2))2(20)\n≤ |h1| + |h2|\nb + u1 + u2\n(\n1 + 2 |h1| + |h2|\nb + u1 + u2 +O(u\n−2\/3)\n)\n≤ 2u−1\/3 as u → ∞.\nDeviations hi = O(√u) give a smaller bound, but what we have will suffice.\nPROOF OF THEOREM 3.4. We start with the stochastic process Wn =∑3\ni=1 ξi(τn), n = 0,1,2, . . . , the total number of jobs at the queues at switch-\ning epochs subsequent to τ0 = t0, some initial time to be chosen below. From (17)\nand (18), we have\nE\n(\nWn+1|ξ(τn),R(ξ(τn)) = j )= ρi + ρk1 − ρj ξj (τn)+ ξi(τn)+ ξk(τn)\n= Wn + θ1 − ρj ξj (τn),\nwhere θ =∑31 ρk − 1 > 0. As we are only considering threshold switching rules,\nthere is some value D > 0 (dependent on the decision points) such that if the\nserver switches to queue j at time τn, then ξj (τn) > DWn for each j and every n.\nHence, with ν = 12 minj Dθ\/(1 − ρj ) > 0, this implies that {(1 + 2ν)−nWn} is a\nnonnegative submartingale and so Wn grows exponentially in mean. At this point\nwe also introduce ν′ > 0 with (1 + ν′)3 = 1 + ν.\nWe are assuming that P ∩ At = ∅ eventually so, for any sufficiently small\nε0 > 0, there exists n0(ε0) such that |z − z′|1 > 2ε0 whenever z ∈ P , z′ ∈ An0 ,\nTRANSIENT POLLING SYSTEMS 1845\nthat is, the set An0 is at least 2ε0 away from the decision points and their pre-\nimages. Also, by Lemma 4.2, we can choose n0 large enough that An0 ⊂ C(γ ),\nthe set where ϕ is contracting. We want to show that any stochastic trajectory (in\nprojection) enters An0 and then converges onto a trajectory of the triangle process.\nDefine a sequence of events Gn, n = 0,1,2, . . . , depending on parameters w0,\nε0 by [recall (9)] G0(w0) = {W0 ≥ w0} ∩ {|ζ(0)− z|1 < ε0 for some z ∈ An0} and\nGn = {Wn >w0(1 + ν)n} ∩ {∣∣ζ(n)− ϕ(ζ(n− 1))∣∣1 ≤ ε0ν′(1 + ν′)−n}.\nWe first bound P[Gn|⋂n−11 Gt ]. Choose w0 large enough that w1\/3 > 1\/ν or,\nequivalently, w2\/3 < νw for all w ≥ w0. As E(Wn|Wn−1) ≥ (1 + 2ν)Wn−1, we\nhave from (19)\nP[Wn ≤ w0(1 + ν)n|Wn−1 >w0(1 + ν)n−1]\n< P\n[∣∣Wn − E(Wn|Wn−1)∣∣> νw0(1 + ν)n−1|Wn−1 >w0(1 + ν)n−1]\n< ην−1\/3w−1\/30 (1 + ν′)−(n−1),\nwhere η = maxijk((ρi + ρj )2σ 2k + (ρi + ρj )(1 − ρk)2))\/(1 − ρk)3, a loose but ad-\nequate bound which shows that Wn grows geometrically quickly with large prob-\nability.\nNow we deal with deviation of the stochastic triangle process from the deter-\nministic one. From any y ∈ R3+ with \b(y) = z ∈ A0 \\A0ˆ with the server at node ˆ ,\nwe have\nfˆ (z) =\n∑\ni \u0005=ˆ\n(1 − ρˆ )zi + ρizˆ\n(1 − ρˆ )+ θˆ zˆ ei ≡\n(\n(1 − ρˆ )zıˆ + ρıˆzˆ\n(1 − ρˆ )(zıˆ + zkˆ)+ (ρıˆ + ρkˆ)zˆ\n, ˆ\n)\nand multiplying the fraction by\n∑\nyi\/\n∑\nyi to switch to un-normalized values, we\nhave\n(1 − ρˆ )zıˆ + ρıˆzˆ\n(1 − ρˆ )(zıˆ + zkˆ)+ (ρıˆ + ρkˆ)zˆ\n= (1 − ρˆ )yıˆ + ρıˆyˆ\n(1 − ρˆ )(yıˆ + ykˆ)+ (ρıˆ + ρkˆ)yˆ\n.(21)\nFor the stochastic process \u0003 starting from ξ(τn−1) = y with ∑i yi > w0(1+ν)n−1\nand the server at ˆ , the bound (19) implies that, for i \u0005= ˆ ,\nP\n[∣∣∣∣ξi(τn)−\n(\nyi + ρi yˆ1 − ρˆ\n)∣∣∣∣> y2\/3ˆ ∣∣∣ξ(τn−1) = y\n]\n≤ ηy−1\/3\nˆ\n.\nNow the identity (21) and the estimate (20), when applied at ξ(τn−1) = y with∑\nyi > w0(1 + ν)n−1 and ξi(τn) in place of the ui + hi , immediately imply\nP\n[∣∣ζ(n)− ϕ(ζ(n− 1))∣∣1 < 2w−1\/30 (1 + ν′)−(n−1)|ξ(τn−1)]\n≥ 1 − 2ηw−1\/30 (1 + ν′)−(n−1).\n1846 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\nThis bound only relies upon Wn−1 =∑i ξi(τn−1) > w0(1+ ν)n−1, an event which\ncontains\n⋂n−1\n1 Gt . As the process \u0003 is Markov and we can choose w0 large enough\nthat 2w−1\/30 < ε0ν′\/(1 + ν′) and, as above, w1\/30 > 1\/ν, we have established, for\nsuch w0, that\nP\n[\nGn\n∣∣∣ n−1⋂\n1\nGt\n]\n≥ 1 − ηε0ν′(1 + ν′)−n.\nA very similar argument can be used to show that P[G0] ≥ 1−ηε0 when we choose\nw0 such that 2n0w−1\/30 < ε0.\nAs the stochastic trajectory projects into C(γ ) (the region of A0 where ϕ is con-\ntracting), then, as long as the switching decision is the same at ζ(t) and ϕ(t)(ζ(0))\nfor every t , we have\nζ(n)− ϕ(n)(ζ(0)) =\nn−1∑\nt=0\nϕ(t)\n(\nζ(n− t))− ϕ(t+1)(ζ(n− t − 1))\n≤\nn−1∑\nt=0\nζ(n− t)− ϕ(ζ(n− t − 1))\n≤ ε0ν′\nn∑\nt=1\n(1 + ν′)−t < ε0 on\nn⋂\n0\nGt.\nThis inequality says that the trajectory ζ(t) is never further than ε0 from the trian-\ngle process trajectory z(t) started at ζ(0). By choice of G0, every point of z(t) is\nmore than ε0 from any di , so the switching decisions for ζ(t) and z(t) will always\nbe the same. This shows that on\n⋂∞\n0 Gt the projections of the trajectories ξ(t)\nconverge a.s. onto deterministic trajectories of the triangle process which by The-\norem 3.1 are periodic.\nFinally,\nP\n[\nn⋂\nt=0\nGt\n]\n= P[G0]\nn∏\nt=1\nP\n[\nGt\n∣∣∣ t−1⋂\n0\nGs\n]\n≥\nn−1∏\nt=0\n(\n1 − ηε0ν′(1 + ν′)−t )\n→ p(ε0) > 0 as n → ∞,\nwhere p(ε0) → 1 as ε0 → 0. This establishes Theorem 3.4, namely, that the sto-\nchastic trajectories ζ(t) converge onto the stable orbits of z, as we can choose ε0\nas small as we like. \u0001\nTRANSIENT POLLING SYSTEMS 1847\nREMARK. The argument above is not delicate enough to decide whether tra-\njectories ζ(t) converge with positive probability onto orbits which are stable on\none side, for example, that are of even length and contain a decision point.\n7. The stochastic process when P is infinite. The proofs of the following\nresults employ the results of Section 5.3.\nLEMMA 7.1. Let ζ(n) denote the state of the stochastic system at time n. Fix\nδ > 0. Define the event EN,δ by\nEN,δ =\n{∣∣ζ(N + k)− ϕ(k)(ζ(N))∣∣< δ for all k ≥ 0 such that\nSide\n(\nζ(N + i))= Side(ϕ(i)(ζ(N))) for i = 0,1, . . . , k\n}\n.(22)\nThen there exists a.s. N = N(δ,ω) such that EN,δ occurs.\nPROOF. Analogously to Section 6, one can conclude that there is 0 < γ < 1\nsuch that a.s., for all large n,\nεn :=\n∣∣ζ(n)− ϕ(ζ(n− 1))∣∣< γ n.(23)\nLet N1 = N1(ω) be the smallest of such n and set N := max(N1,min{n :∑∞\ni=n γ i < δ}). Then as long as ζ(N + k) and ϕ(k)(ζ(N)) go through the same\nsequence of sides of the triangle A0,∣∣ζ(N + k)− ϕ(k)(ζ(N))∣∣\n= ∣∣ζ(N + k)− ϕ(ζ(N + k − 1))+ ϕ(ζ(N + k − 1))− ϕ(ϕ(k−1)(ζ(N)))∣∣\n≤ γ n+k + ∣∣ζ(N + k − 1)− ϕ(k−1)(ζ(N))∣∣,\nwhere we used the fact that ϕ is contracting. Now the statement of the lemma\nfollows from induction. \u0001\nRecall the definition of the aperiodic set and of \u0019 at the end of Section 5.3.\nLEMMA 7.2. Define the event E by\nE = {the stochastic system never comes\ncloser than \u0019\/2 to pre-images of d2 or d3}.\nThen, given that the stochastic system starts in the aperiodic set, P(E) > 0.\nPROOF. First of all, we show that there is a constant K > 0 such that if u\nbelongs to the semi-periodic set, then ϕ(k)(u) belongs to the aperiodic set for some\nk ≤ K . Indeed, the image of an interval I of the semi-periodic set must be either\nanother semi-periodic interval, or must lie entirely inside an aperiodic interval or\n1848 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\na semi-periodic interval. However, if ϕ(k)(I ) is in one of the finitely many semi-\nperiodic intervals for each k, this would imply that the points of I are periodic.\nThis contradicts Lemma 5.5.\nNow let δ = \u0019\/(2K) and suppose the system starts in the aperiodic set. By\nsimilar arguments to those of Section 6, with positive probability,\n∑∞\nn=0 |εn| < δ,\nwhere εn is defined in (23). If for some n, ζ(n) is in the aperiodic set but ζ(n+ 1)\nis not, then u := ζ(n + 1) cannot be “far” from the points of P1 since |εn| < δ.\nBecause the intervals of the periodic set are separated from the aperiodic set by\nthe intervals of semi-periodic set, u a.s. belongs to a semi-periodic interval, say,\nI := [l˜, r˜], where l˜ ∈ P 1 and r˜ is a pre-image of d2 or d3. We claim that, within\nthe next K applications of ϕ, u will be “thrown out” of the image of I , or will be in\nthe aperiodic set or some semi-periodic interval not far from its aperiodic endpoint\nagain.\nTo show this, suppose ζ(n + k) lies in ϕ(k)(I ) for the first K steps. Then, by\nthe choice of K , for some k, it will end up in the aperiodic set, and also it will not\napproach ϕ(k)(r˜) (which could possibly be d2 or d3) closer than K × δ ≤ \u0019\/2. On\nthe other hand, if ζ(n+k−1) ∈ ϕ(k−1)(I ) and yet ζ(n+k) \/∈ ϕ(k)(I ), it means that\nζ(n+k) is no further from ϕ(k)(r˜) than εn+k and it lies either in the aperiodic set or\nin a semi-periodic interval not far from its aperiodic endpoint ϕ(k)(r˜). (Conditioned\non\n∑∞\nn=0 |εn| < δ, there is not enough randomness for the stochastic system to exit\nthe interval via the endpoint which is a pre-image of d2 or d3.) \u0001\nLEMMA 7.3. Conditioned on the event E, periodicity of the stochastic system\nimplies that d1 is a limiting point for the trajectory of the stochastic system.\nPROOF. Suppose not. Then there is δ = δ(ω) > 0 such that the points in the\nδ-neighborhood of d1 are never hit by the stochastic system. Without loss of gener-\nality, suppose δ <\u0019\/2. By Lemma 7.1, there exists an N for this δ such that (22) is\nfulfilled. Then for any k ≥ 0, the distance between points ϕ(k)(ζ(N)) and ζ(N +k)\ndoes not exceed δ as long as they follow the same trajectory. On the other hand,\nthey will follow the same trajectory, as there will never be the decision point d1\nbetween them, nor decision points d2 or d3, since we are conditioning on E.\nHence, l˜(ϕ(k)(ζ(N))) will be also periodic, following the same path as\nϕ(k)(ζ(N)), yielding contradiction with Lemma 5.3. \u0001\nNow we are able to finish the proof of Theorem 3.5.\nPROOF OF THEOREM 3.5. First, analogously to the proof of Theorem 3.4, one\ncan easily show that, with positive probability, the stochastic system will converge\nto one of the finite cycles. So, it remains to show that, with positive probability, the\nstochastic system is not periodic.\nTRANSIENT POLLING SYSTEMS 1849\nCondition on the event E. Suppose that the stochastic system is periodic with\nperiod m, that is, for some N1, we have\nSide(ζ(n)) = Side(ζ(n+m)) whenever n ≥ N1.(24)\nFor the moment consider only one image ϕ(d1) = f2(d1) of d1. Since f2(d1) is not\nperiodic by Lemmas 5.4 and 5.3, there is a positive integer K1 = K1(m) >m such\nthat\nSide\n(\nϕ(K1)(d1)\n) \u0005= Side(ϕ(K1−m)(d1)).(25)\nSimilarly, for the other possible image of d1, f3(d1), there is K2 = K2(m) > m\nsuch that\nSide\n(\nϕ(K2)(d1)\n) \u0005= Side(ϕ(K2−m)(d1)),(26)\nunder the assumption that ϕ(d1) ∈ A03.\nChoose δ > 0 so small, that each of the one-sided δ-neighborhoods of d1 which\nmap onto sides A02 and A03, respectively, does not intersect with d1 for the first\nK = max{K1,K2} applications of ϕ, and let δ1 ≤ δ be the size of the smaller of\nthese neighborhoods after K mappings by ϕ.\nBy Lemma 7.3, the stochastic system will hit the δ1\/2 neighborhood of d1 at,\nsay, time N . Since, in fact, the stochastic system will hit this neighborhood at\narbitrary large times, we can suppose that N > N1 and that\n∑∞\nn=N |εn| < δ1\/2,\nwhere εn is defined in (23). Also, for definiteness suppose that ζ(n) is on the\nside of d1 which maps onto A02. Then the stochastic system will follow the image\nof d1 which maps onto A02 for the next K steps, in the sense Side(ϕ(k)(ζ(n))) =\nSide(ϕ(k)(d1)) since δ1\/2 + δ1\/2 ≤ δ1. However, recall that K was chosen in such\na way that the sequence Side(ϕ(k)(d1)), k = 1,2, . . . ,K , cannot be m-periodic,\ncreating the contradiction between (24) and (25). \u0001\nREFERENCES\n[1] ASMUSSEN, S. (2003). Applied Probability and Queues, 2nd ed. Springer, New York.\nMR1978607\n[2] COELHO, Z., LOPES, A. and DA ROCHA, L. F. (1995). Absolutely continuous invariant mea-\nsures for a class of affine interval exchange maps. Proc. Amer. Math. Soc. 123 3533–3542.\nMR1322918\n[3] DAJANI, K. (2002). A note on rotations and interval exchange transformations on 3-intervals.\nInt. J. Pure Appl. Math.1 151–160. MR1900223\n[4] FAYOLLE, G., MALYSHEV, V. A. and MEN′SHIKOV, M. V. (1995). Topics in the Constructive\nTheory of Countable Markov Chains. Cambridge Univ. Press. MR1331145\n[5] FOSS, S. and LAST, G. (1996). Stability of polling systems with exhaustive service policies\nand state-dependent routing. Ann. Appl. Probab. 6 116–137. MR1389834\n[6] FOSS, S. and LAST, G. (1998). On the stability of greedy polling systems with general service\npolicies. Probab. Engrg. Inform. Sci. 12 49–68. MR1492140\n[7] LIOUSSE, I. and MARZOUGUI, H. (2002). Échanges d’intervalles affines conjugués à des\nlinéaires. Ergodic Theory Dynam. Systems 22 535–554. MR1898804\n1850 MACPHEE, MENSHIKOV, POPOV AND VOLKOV\n[8] MACPHEE, I. M. and MENSHIKOV, M. V. (2003). Critical random walks on two-dimensional\ncomplexes with applications to polling systems. Ann. Appl. Probab. 13 1399–1422.\nMR2023881\n[9] MENSHIKOV, M. and ZUYEV, S. (2001). Polling systems in the critical regime. Stochastic\nProcess. Appl. 92 201–218. MR1817586\n[10] MEYN, S. P. and TWEEDIE, R. L. (1993). Markov Chains and Stochastic Stability. Springer,\nLondon. MR1287609\n[11] VEECH, W. A. (1984). The metric theory of interval exchange transformations, I–III. Amer. J.\nMath. 106 1331–1422. MR0765582\nI. M. MACPHEE\nM. V. MENSHIKOV\nDEPARTMENT OF MATHEMATICAL SCIENCES\nUNIVERSITY OF DURHAM SCIENCE SITE\nDURHAM DH1 3LE\nUNITED KINGDOM\nE-MAIL: i.m.macphee@durham.ac.uk\nmikhail.menshikov@durham.ac.uk\nS. POPOV\nINSTITUTO DE MATEMÁTICA E ESTATÍSTICA\nUNIVERSIDADE DE SÃO PAULO\nSÃO PAULO SP\nBRASIL\nE-MAIL: popov@ime.usp.br\nS. VOLKOV\nSCHOOL OF MATHEMATICS\nUNIVERSITY OF BRISTOL\nBRISTOL BS8 1TW\nUNITED KINGDOM\nE-MAIL: s.volkov@bristol.ac.uk\n"}