{"doi":"10.1017\/S0031819104000348","coreId":"71349","oai":"oai:eprints.lancs.ac.uk:1951","identifiers":["oai:eprints.lancs.ac.uk:1951","10.1017\/S0031819104000348"],"title":"Wrongful Life.","authors":["Archard, David"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-07","abstract":"I argue that it is wrong deliberately to bring into existence an individual whose life we can reasonably expect will be of very poor quality. The individual's life would on balance be worth living but would nevertheless fall below a certain threshold. Additionally the prospective parents are unable to have any other child who would enjoy a better existence. Against the claims of John Harris and John Robertson I argue that deliberately to conceive such a child would not be to exercise the right to procreate. For this right is internally constrained by the requirement that any resultant child has the reasonable prospect of a minimally decent life","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71349.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/1951\/2\/BA1D6F3B.pdf","pdfHashValue":"bf74144a1c35ad57707285e3858ccbf4fc8a9371","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:1951<\/identifier><datestamp>\n      2018-01-24T02:32:46Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D42:4231<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Wrongful Life.<\/dc:title><dc:creator>\n        Archard, David<\/dc:creator><dc:subject>\n        B Philosophy (General)<\/dc:subject><dc:description>\n        I argue that it is wrong deliberately to bring into existence an individual whose life we can reasonably expect will be of very poor quality. The individual's life would on balance be worth living but would nevertheless fall below a certain threshold. Additionally the prospective parents are unable to have any other child who would enjoy a better existence. Against the claims of John Harris and John Robertson I argue that deliberately to conceive such a child would not be to exercise the right to procreate. For this right is internally constrained by the requirement that any resultant child has the reasonable prospect of a minimally decent life.<\/dc:description><dc:date>\n        2004-07<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1017\/S0031819104000348<\/dc:relation><dc:identifier>\n        Archard, David (2004) Wrongful Life. Philosophy, 79 (3). pp. 403-420. ISSN 0031-8191<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/1951\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1017\/S0031819104000348","http:\/\/eprints.lancs.ac.uk\/1951\/"],"year":2004,"topics":["B Philosophy (General)"],"subject":["Journal Article","PeerReviewed"],"fullText":"http:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nWrongful Life\nDAVID ARCHARD\nIs it wrong deliberately to bring into existence an individual whose\nlife we can reasonably expect will be of very poor quality? Several\nphilosophers do not think so, and for very similar reasons. In this\narticle I want to expose their arguments to critical scrutiny with a\nview to defending an affirmative answer to the question above. I will\ncarefully specify the kind of case they, and I, have in mind distin-\nguishing it from others whose putative wrongfulness rests on\ndifferent grounds. Hopefully my counter argument will shed light\non the proper, and improper, ways to think about procreation.\nLet me start by addressing the use of the word ‘deliberately’ in\nthe opening question. Clearly a conscious decision to conceive a\nchild can be made, though no such decision is guaranteed to yield\nthe desired outcome. However as often as not conception is not\ndeliberate although it may be very welcome after the event. In these\ncases the appropriate question will be: Is it wrong to proceed with a\npregnancy whose outcome will be an individual whose life we can\nreasonably expect will be of very poor quality? In answering this\nquestion the putative wrongfulness of allowing such a person to\ncome into being must be balanced against the putative wrongfulness\nof terminating the pregnancy. Any final judgment in these cases\nmust thus await a determination of the moral permissibility or\nimpermissibility of abortion. This is obviously controversial. So, to\navoid these problems, I concentrate on cases where conception is\ndeliberate. The most obvious are those involving artificial repro-\nduction, such as in vitro fertilization (IVF) where preimplantation\ngenetic diagnosis (PGD) permits the identification of the\nprobabilities of any child coming to suffer from a particular disease\nor disability.\nThe qualification within the question signified by the words ‘we\ncan reasonably expect’ is important to rule out cases where nobody\ncould have been expected to know that the individual brought into\nexistence would suffer from some very serious disease; or where the\nknown risk of her doing so was very small. It is important to add\nthat there are non-medical circumstances in which we can\nreasonably expect that somebody will enjoy a very poor life. These\ninclude being born into extreme poverty or to be brought up by\nPhilosophy 79 2004 403\ndoi:10.1017\/S0031819104000348 ©2004 The Royal Institute of Philosophy\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nvery cruel, abusive, or neglectful parents. Of course such circum-\nstances can change, and be changed. However we can still imagine\nbeing reasonably sure that they will not, and hence being reasonably\nsure that the individual brought into being will suffer a very poor\nlife. In what follows I want to allow for both medical and non-med-\nical grounds on which we could reasonably expect a created life to\nbe of very poor quality.\nI have framed the question in terms of an individual’s life. It is\npossible that the person brought into being does not survive beyond\nher childhood. Nevertheless, even the child who does mature into\nadulthood has, I shall argue, a right not to suffer a very poor life.\nThe child has this right in her own right and not just in the person\nof the future adult whose life is blighted. I shall thus speak of the\ncase of a child whose life is very poor. I also speak in terms of rights,\nthough the argument I advance does not depend on acceptance of\nthe view that rights-talk is a proper part of the moral language we\nshould use. We might equally speak simply of the wrongness of\nbringing into being an individual whose life will be very poor.\nI\nI start my argument that it is wrong deliberately to bring into\nexistence an individual whose life we can reasonably expect will be\nof very poor quality by defending the ‘birthright claim’. This is as\nfollows. If a child should be guaranteed a set of rights then no child\nshould knowingly be brought into existence lacking the reasonable\nprospect of enjoying these same rights. Feinberg defends something\nvery similar:\nif you cannot have that to which you have a birthright then you\nare wronged if you are brought to birth. Thus, if the conditions\nfor the eventual fulfilment of the child’s future interests are\ndestroyed before he is born, the child can claim, after he has been\nborn, that his rights (his present rights) have been violated.\nMoreover, if before the child has been born, we know that the\nconditions for the fulfilment of his most basic interests have\nalready been destroyed, and we permit him nevertheless to be\nborn, we become a party to the violation of his rights.1\nFollowing Feinberg, Bonnie Steinbock writes that ‘it is a wrong to\nthe child to be born with such serious handicaps that many very\nDavid Archard\n404\n1 Joel Feinberg, Harm to Others (Oxford: Oxford University Press,\n1984), 99.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nbasic interests are doomed in advance, preventing the child from\nhaving the minimally decent existence to which all citizens are\nentitled’.2\nIn contradistinction to Feinberg and Steinbock I want to defend\nsomething more specific. Feinberg speaks of a child’s general right\nto be born with a guarantee that her most basic interests will be ful-\nfilled. He describes a child’s ‘right not to be born’ as ‘a compendious\nway of referring to the plausible moral requirement that no child be\nbrought into the world unless certain very minimal conditions of\nwellbeing are assured’.3 Now one of the problems of both Feinberg’s\nand Steinbock’s approach is the multiplicity of those against whom\nthe claim of rights violation can be made.4 For instance we could\nsurely and plausibly hold ourselves responsible for ‘permitting’ a\nchild we know will have a serious disability to be born, even though\nwe have played no part in the conception of the child. Similarly, it is\nreasonable to think that Steinbock’s stated view implies that we do a\nwrong to such a child by permitting it to be born and hence pre-\nventing her from having a minimally decent existence.\nI want to understand the birthright claim as the claim to a right\nthat any possible child has not to be intentionally and knowingly\nconceived with the reasonable prospect of not enjoying a life above\na certain threshold. What that threshold is I shall come to in due\ncourse. The birthright claim is thus made against those who can and\ndo play a direct causal role in the child’s conception, in other words\nthe prospective genetic and gestational parents.\nThe birthright claim rests on the following argument. I violate a\nchild’s given right, let us say her right to Ø, if I act so as to deny her\nthe enjoyment of Ø.5 I also violate her right to Ø if I knowingly and\navoidably put her into a situation where she cannot enjoy Ø (or\ncannot reasonably be expected to enjoy Ø). If I know that a future\nchild will be incapable of enjoying Ø and I nevertheless act to bring\nher into existence then I knowingly put her in a situation where she\ncannot enjoy Ø. I thus violate the future child’s right to Ø by\nknowingly bringing about her birth. This argument is valid and the\nbirthright claim is thus warranted.\nWrongful Life\n405\n2 Bonnie Steinbock ‘The Logical Case for “Wrongful Life”’ Hastings\nCenter Report 16 (April 1986), 19.\n3 Harm to Others, 101.\n4 E. Haavi Morriem, ‘The Concept of Harm Reconceived: A Different\nLook at Wrongful Life,’ Law and Philosophy 7 (1988), 21.\n5 I hold that the enjoyment of a right is more than its mere possession.\nI possess a right if it is recognized—morally or in law—that I have the\nright. I enjoy the right if I can, as a matter of fact, exercise the right.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nDeliberately conceiving a child who will be born to desperate\nsocial and economic circumstances violates that child’s birthright.\nSo too does deliberately conceiving a child who will suffer a dread-\nful handicap. In what follows I want, first, to be clearer about the\nthreshold below which a child’s prospective life is so bad that it is a\nviolation of her birthright knowingly and deliberately to bring her\ninto existence. Second, I want to offer a critique of those who main-\ntain that no wrong is done in conceiving a child whose life falls\nbelow this threshold so long as the life is worth living and her\nconception is, in a sense to be explained, unavoidable.\nWhat is the threshold of acceptable existence? As we have seen\nFeinberg and Steinbock speak of the conditions for the fulfilment of\nbasic interests. Others speak in terms of a minimally decent life.\nKavka defines a ‘restricted life’ as one that is ‘significantly deficient\nin one or more of the major respects that generally make human\nlives valuable and worth living’.6 Since my preferred mode of\nargumentative exposition is in terms of rights I shall define the\nthreshold of a minimally acceptable life as one in which the child\nhas the reasonable prospect of enjoying a good number of those\nrights possessed by all children. For the sake of the argument I shall\ntake the United Nations Convention on the Rights of the Child as\nproviding a useful list of these rights. I want to allow that what is\nmeant by ‘a good number’ of rights is vague and also that some\nrights are more fundamental than others. Nevertheless it should be\nclear that there are imaginable lives which are very poor in the\nrequired sense and are so inasmuch as the child cannot enjoy a\nsignificant number of these rights she is entitled to enjoy.\nII\nThe case I want to consider is of a child who will enjoy a life that\nfalls below the threshold I have defined but whose life is still on\nbalance worth living. For many people do not think it wrong\ndeliberately and knowingly to conceive a child who will enjoy such\na life. Let me carefully specify the kind of case I, and they, have in\nmind. It has two important defining features. First, the child’s life\nis worth living but barely so. Her life is of less value than it would\nbe if more of her rights were enjoyed. Nevertheless the child’s life\nDavid Archard\n406\n6 Gregory Kavka, ‘The Paradox of Future Individuals’, Philosophy &\nPublic Affairs 11 (2) 1981, 105. For the citation of other relevant and\nsimilar thresholds see Morriem, , ‘The Concept of Harm Reconceived: A\nDifferent Look at Wrongful Life,’ 24–5.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nis not worse than non-existence. Now it is notoriously hard to\nspecify exactly what this comparative claim means. It need not\nmean, for instance, that a child brought into being and faced with\nthe prospect of such a terrible life would choose to commit suicide.\nFollowing a suggestion of Feinberg, I shall take it to mean this.7A\ndisinterested, fully informed and rational proxy adult choosing on\nbehalf of the prospective child would prefer that the child should\nnot be born rather than endure the life in question. ‘Wrongful life’\ncases have principally been ones in which courts have been asked to\nconsider whether the child’s prospective life is worse than non-exis-\ntence. However in the envisaged example the child’s life is worth\nliving even if barely so. It is better, just, than non-existence but it is\nworse than the life that would be had if enjoyment of most of her\nrights were guaranteed. \nSecond, the child cannot avoid being brought into existence. The\nunavoidability in question is to be understood in this sense. There\nis no possibility of a child being born to its prospective parents\nenjoying a better life than the one envisaged. Thus this is not the\nkind of case, made famous by Derek Parfit’s ingenious examples, of\nthe birth of a child with a handicap that could have been avoided\nhad conception been deferred to a later time, or had the mother\ntaken a relatively costless course of treatment at the time of con-\nception.8 In these kind of cases we want to say that wrong is done\nby not deferring conception or by not taking the treatment since by\ndoing these things a handicap-free child could have been conceived.\nThe point Parfit seeks to make by means of this kind of example is\nthat, although wrong is done by conceiving the handicapped child,\nno wrong is done to the child in question since if conception did not\noccur at the envisaged time then this child would not have existed.\nThis is because Parfit holds it a necessary condition of X’s personal\nidentity that X was conceived within a particular time period and\nunder certain specified circumstances. For Parfit an impersonal\nwrong is done in conceiving the handicapped child, but no wrong is\ndone to the child conceived at that particular moment. This is the\njustly famous ‘non-identity problem’. \nHowever this is not the kind of example I am here concerned\nwith. If the child is not conceived here and now, and under these\ncircumstances, then there will be no child born to these parents. Or\nany child born to these parents, whenever and however conceived,\nWrongful Life\n407\n7 Joel Feinberg, ‘Wrongful Life and the Counterfactual Element in\nHarming’, Social Philosophy and Policy 4(1) (1987), 145–78.\n8 Derek Parfit, Reasons and Persons (Oxford: Clarendon Press, 1984),\n357–66.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nwill enjoy substantially the same advantages and disadvantages. The\nbirth is not unavoidable in the sense that the prospective parents could\nnot decide either not to conceive or to terminate the conception.\nRather it is unavoidable in the sense that a child with this miserable\nfuture life, that is enjoying the envisaged prospect of a barely\nendurable existence, is the only child that can be born to these parents. \nSo imagine that we know that any child of these parents will suf-\nfer a life that is only just worth living and that the only alternative\nis that they should have no child. Is a wrong done if the parents\nhave such a child? As I indicated, many people do not think so. John\nRobertson is clear that ‘bringing unavoidably handicapped off-\nspring into the world does not harm them because there is no way\nfor them to be born healthy’.9 Indeed he thinks that even if we know\nthat a prospective parent will seriously abuse her child ‘it is not clear\nthat they will enjoy such a horrible life that they never should have\nbeen born at all, and thus are harmed by being born to an abusing\nmother’.10 John Harris is also clear that no wrong is done, and\nindeed that conception in the circumstances envisaged is in the best\ninterests of the child. If a woman can only have a handicapped child\nand does have such a child then ‘she is acting in the best interests of\nthe child’. She ‘wrongs no-one in having a handicapped child\nbecause it is in that child’s interest to be born’.11\nThe reasoning of Harris and Robertson about such cases follows\nfrom their possession of the two features just outlined. First, the life\nthat the abused or seriously handicapped child endures is still bet-\nter than non-existence. Thus ‘even serious child abuse does not\nappear to cause a life of such unremitting suffering that its life is\nwrongful, e.g., that the child would have preferred no life at all’.12 It\nis in the handicapped ‘child’s interests to be born’ since ‘although\nthe child will inevitably suffer, it will have a life worth living’.13\nSecond, the birth is unavoidable in the sense indicated. If the\nprospective parents could conceive a non-handicapped child then\nthey would be misusing their reproductive capacity if they\nproduced a less than healthy child.14 Nevertheless if they can only\nDavid Archard\n408\n9 John Robertson, Children of Choice: Freedom and the New Reproductive\nTechnologies (Princeton: Princeton University Press, 1994), 152.\n10 Ibid., p. 82.\n11 John Harris, ‘Wrongful Birth’, M. E. Dalton and J. Jackson (eds.)\nPhilosophical Issues in Reproductive Medicine (Manchester: Manchester\nUniversity Press, 1990), 165.\n12 Ibid, 248 (282 fn. 32).\n13 Harris, op. cit., 165.\n14 Robertson, op. cit., 171.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nconceive a child who will be seriously handicapped or subsequently\nabused then they do no wrong in so conceiving. This point about\nhow unavoidability is to be understood needs emphasizing. Harris\nis clear that where parents can avoid bringing suffering into the\nworld ‘by declining to have the disabled child and yet fulfil their\ndesire to have a child by trying again for a healthy child then if they\ndeliberately produce children with more than slight disability they\nare blameworthy’. However, he immediately continues, if ‘the\nparticular parent must have disabled children if they are to have\nchildren at all, then they will be blameworthy only if the children\nwould be wronged by existence, that is, if they would find it not\nworth living.’15 In other words parents are not blameworthy and do\nno wrong by bringing into existence a child whose life is barely\nworth living so long as that is the only life a child of theirs can enjoy.\nThey can avoid bringing such a life into being by not having a child.\nBut if they are to have a child then they cannot avoid her suffering\nan existence that is barely worth living.\nAvoidability is understood then in terms of the specified alterna-\ntives. In the case under consideration the alternatives are no child or\na child with a less than minimally decent existence. In the case\nwhere Harris and Robertson admit of wrong being done the alter-\nnatives are no child, a child with a less than minimally decent exis-\ntence and a child with at least a minimally decent existence. Melinda\nRoberts describes the contrast as between ‘type 2-alt’ cases and\n‘type 3-alt’ cases. She too thinks no wrong is done to the child in the\nformer case,that is one where the only alternative to a less than min-\nimally decent but at least worth living existence is non-existence.16\nLet me now turn to a discussion, in succession, of the two fea-\ntures of case being considered: a life better than non-existence and\nits unavoidability. With respect to the first feature some think that\nsuch a comparison is impossible to make in the sense that existence\nand non-existence are, strictly speaking, incomparable. Indeed very\nmany ‘wrongful life’ suits have failed precisely because the courts\nhave determined that no such comparison is possible.17 A New\nWrongful Life\n409\n15 John Harris, Wonderwoman and Superman: The Ethics of Human\nBiotechnology (Oxford: Oxford University Press, 1993), 90.\n16 Melinda Roberts, Child Versus Childmaker: Future Persons and Present\nDuties in Ethics and the Law (Boulder: Rowman and Littlefield, 1998), 27\nand 101.\n17 ‘Wrongful life’ cases are brought by or on behalf of the individual\nwhose life is allegedly worse than non-existence. By contrast ‘wrongful\nbirth’ cases are brought by or on behalf of parents in respect of the avoid-\nable birth of a child whose condition, e.g. extreme disability, allegedly\ncauses them serious harm.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nJersey Supreme Court observed in a 1967 ‘wrongful life’ suit: ‘The\ninfant plaintiff would have us measure the difference between his\nlife with defects against the utter void of non-existence, but it is\nimpossible to make such a determination’.18 The English courts\nhave reasoned in an exactly similar fashion. McKay v. Essex Health\nAuthority (1982) was a case for damages brought by an infant born\nto a mother who was infected with rubella in the early months of her\npregnancy, a condition she alleged her doctors should have but\nfailed to detect. A principal reason for rejecting the suit was the\ncourt’s view that it could not measure the loss to the child by com-\nparing her disabled condition with that of her never having been\nborn. ‘But how can a court begin to evaluate non-existence ... No\ncomparison is possible’. ‘The court … has to compare the state of\nthe plaintiff with non-existence, of which the court can know noth-\ning; this I regard as an impossible task’.19\nIf a child’s miserable life cannot be compared with her non-exis-\ntence then we cannot speak of her interest in being born (as opposed\nto remaining unconceived). Hence her interests are not a considera-\ntion in the determination of the moral permissibility of her being\nbrought into existence. The only relevant considerations would be the\nprospective parents’ interests in having such a child, the public costs\nof supporting the parents in their wishes to have the child, and the\ninterests of any third-parties such as the child’s future siblings.\nMoreover, the child herself is not harmed by being brought into exis-\ntence. A choice of action only harms someone if it makes her worse\noff than she would have been in the absence of the choice.20 Morreim\ndenies that all harms can be conceived of in terms of a making worse\nthan what otherwise (in the absence of an action or event) would have\nbeen the case. Nevertheless she does acknowledge that ‘all ascriptions\nof harm do involve comparison’.21 But if no comparison can be made\nthen there can be no ascription of harm. If the counterfactual condi-\ntion of non-existence cannot be compared with that of existence then\nit cannot be the case that the child is harmed by being born.\nNot everyone does deny that existence and non-existence are\nincomparable. If they can be compared it seems clear that non-\nDavid Archard\n410\n18 Gleitman v. Cosgrove, 227 A. 2d 689, at p. 6982; quoted in Bernard M.\nDickens, ‘Artificial Reproduction and Child Custody’, The Canadian Bar\nReview , 66 (1987), 55. Dickens comments that ‘existence and non-exis-\ntence per se may not be contrasted’, ibid., 56.\n19 McKay v. Essex Health Authority [1982) ALR 2 771, at 787 and 790.\n20 M. Hanser, ‘Harming Future People,’ Philosophy and Public Affairs,\n19 (1990), p. 52.\n21 ‘The Concept of Harm Reconceived’, 23.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nexistence is very bad. It may not, as Cynthia Cohen argues, be as\nbad as death.22 But it is surely still very bad. Certainly it is suffi-\nciently bad that existence, even if it falls below the minimal\ndecency threshold, is preferable. Even a barely worthwhile life is\nbetter than none at all. Hence either non-existence and existence are\nincomparable in which case the question of whether the child who\nenjoys the miserable life is harmed does not arise. Or they are com-\nparable and even a miserable life is better than none in which case\nthe child is not harmed by being conceived. Indeed she benefits.\nTurning to the second feature of the case being considered, the\nconception and birth of a child whose life is miserable is, to repeat,\nunavoidable only in the sense that if any child is to be born it can-\nnot but be a child enjoying a barely worthwhile existence.\nConception and birth are not unavoidable in the sense that contra-\nception could not be used or a termination not sought. They can be\nbut are not. Moreover the view of Harris and Robertson is that\nhuman beings should not be required to desist from conception or\nto secure a termination in this case. Better, they have a presumptive\nright to have children. As Robertson puts it, ‘Procreative liberty\nshould enjoy presumptive primacy when conflicts about its exercise\narise because control over whether one reproduces or not is central\nto personal identity, to dignity, and to the meaning of one’s life.’23\nEssentially the right to have or not to have a child is a central\nliberty right. As such it can, at least for liberals, only be constrained\nby a harm principle or something similar. Thus, since by the argu-\nment already considered, giving birth to a child whose life is only\nbarely worth living does not harm the child the prospective parents\nrightly exercise their presumptive procreative liberty right in\nhaving the child if that is what they choose to do. Its conception and\nbirth are unavoidable in the sense that it is their moral entitlement\nif they wish to have children.24\nWrongful Life\n411\n22 Cynthia Cohen, ‘The Morality of Knowingly Conceiving Children\nWith Serious Conditions: An Expanded “Wrongful Life” Standard’, N.\nFotion and Jan C. Heller (eds.) Contingent Persons: On the Ethics of\nDeciding Who Will Live, or Not, in the Future (Dordrecht: Kluwer\nAcademic Publishers, 1997), 31-5.\n23 Children of Choice, 24.\n24 Note that the procreative liberty right in question holds a special\nsignificance for those who are strongly opposed to the use of contraception\nor to abortions. Their views raise interesting questions. But I will concen-\ntrate on those seeking artificial means of reproduction. For they wish to\nexercise their right to have children. Their situation is such that they can-\nnot otherwise conceive and cannot thus choose in the normal course of\nevents either not to reproduce or to reproduce.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nFor Robertson, Roberts and Harris, the parents who create a\nchild—so long as it enjoys at least a barely endurable existence—do\nno harm and do no wrong. This seems to me to be deeply and obvi-\nously mistaken. Consider Gregory Kavka’s example of the couple\nwho produce a child they intend to sell at birth into slavery.\nAssuming that life as a slave is better than never existing, then—on\nthe reasoning I have considered—they do not harm the child.\nCrucially in the absence of the offer from the slave owner they\nwould not have a child. They were not planning to have one and do\nso only as a result of his offer. Thus their conception of the about-\nto-be-enslaved child is, in the requisite sense, unavoidable. I concur\nwith Kavka in viewing their actions as morally ‘outrageous’. This\nwould be so even if they used the money from the slavery contract\nfor selfless and morally commendable purposes.25\nKavka thinks the couple err in ‘misusing their reproductive pow-\ners’. I agree. Kavka construes this misuse in terms of their ‘extort-\ning’ an unfair (excessive and unearned) price for the exercise of\nthese powers. The couple give life to a child but charge the child too\nmuch for it. In my view the error in Kavka’s approach is that it\nassumes that a fair price can be charged for the exercise of one’s\nreproductive powers. Kavka himself glosses his claim with the fur-\nther assertion that the seller of life ‘improperly treats human life as\na commodity to be passed out to the highest bidder’.26 But this gloss\nsuggests—correctly in my view—that it is not that a fair price\nshould be charged for existence but that no price at all is appropri-\nate. Existence is literally priceless. Taking Kavka at his own word,\na price cannot both be excessive and unearned. If one has not\nearned the right to put a price on something then no price should be\ncharged. A price can nevertheless be earned but excessive.\nThere are, I think, a number of background thoughts that may\nlend apparent but misguided support to the view that a price can be\ncharged for bringing someone into being. The first is the Lockean\ntheory of property whereby somebody owns whatever they have\nlaboured on, ‘mixed their labour with’.27 Since procreation is\narguably a labouring the procreators must own that which they\ncreate, namely the child. Further, it is entirely proper to alienate and\nto charge a price for the transfer of what one owns. Locke himself\nDavid Archard\n412\n25 Gregory Kavka, ‘The Paradox of Future Individuals’, Philosophy &\nPublic Affairs, 11 (2) (1981), 100–2.\n26 Ibid., 108.\n27 John Locke, Two Treatises of Government, a critical edition with an\nintroduction and apparatus criticus by Peter Laslett, revised edition\n(Cambridge: Cambridge University Press, 1963), II, Chapter V.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nsaw the implication of his own theory and laboured, unpersuasive-\nly, to block it.28 Contemporary neo-Lockeans, such as most notably\nHillel Steiner, have also recognized the implication and sought in\nvarious ways to block it.29\nI think the Lockean theory does not have the implication in ques-\ntion, chiefly because if individuals do own what they produce then\nit is in virtue of the fact that they, at bottom, own themselves. Any\nhuman being, including a child, is self-owning. Whatever owns\nitself cannot be owned by others. I note here only that the Lockean\ntheory casts a very long shadow over much thinking about the rela-\ntionship in which a parent stands to its own children.\nA second background thought is that somebody may properly\ncharge another for continued existence, by supplying, for instance,\na life-saving course of medicine. Here it is proper to talk of an\nunfair or excessive price being charged. This would be the case, for\ninstance, if a person acquired monopoly control of, rather than\ninvented or developed, a drug that others needed to stay alive.30 Yet\nthere is a fundamental and crucial asymmetry between bringing\ninto existence and ensuring the continued existence of someone\nalready alive. A price can be charged for the latter but not for the\nformer. We do not owe our lives to our parents in the same way or\nin the same sense as we do to a rescuer, to a surgeon, or to the sup-\nplier of an anti-toxin.\nThe third background thought is that it is appropriate to charge\nothers than the resultant child for the exercise of one’s reproductive\npowers. The reason is that any such exercise is a use of one’s own\nbodily powers whose costs—the expenditure of time, the attendant\ndiscomfort and pain, the postponed opportunities of pursuing other\nends, etc.—are voluntarily incurred and, in principle, merit\ncompensatory payment. Indeed those who enter into surrogacy\ncontracts determine a proper price for such services. But while it is\nappropriate for a surrogate mother to charge an aspirant parent for\nthe use of her reproductive powers it is not appropriate to fix a price\nfor existence that the resultant child must pay. \nA final brief comment on this matter is appropriate. The vast\nmajority of those who deliberately choose parenthood rightly\nregard the existence of a child of their own as sufficient recompense\nfor the ‘pains’ of reproductive labour. The creative act of\nWrongful Life\n413\n28 See the excellent critical discussion in Robert Nozick, Anarchy, State,\nand Utopia (Oxford: Basil Blackwell, 1974), 287–9.\n29 Hillel Steiner, An Essay on Rights (Oxford: Basil Blackwell, 1994),\n241–8.\n30 Nozick, op. cit., 181.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nconceiving a future human being is its own reward. It does not have\na further chargeable price. That is how most people view it. They\nare correct to do so.\nIII\nRather then than quite literally cashing out the proper or improper\nuse of reproductive rights in terms of a fair price for existence, we\nshould think of a right with internal constraints. Adults have a pre-\nsumptive procreative liberty right. This liberty right is rooted in the\nconsiderable interests adults have in bearing children.31 However\nthere are internal constraints on its exercise. By an internal con-\nstraint I mean the following. A full and adequate specification of the\nright in question contains or immediately entails a list of the\ncircumstances under which it may be exercised. By contrast an\nexternal constraint on a right is a contingent consideration—\nanother right or other moral facts—which may or does limit or\nvitiate the exercise of the right. If there is a right to Ø the internal\nconstraints specify what it is properly to Ø whereas the external\nconstraints specify when it is not permissible, all things considered,\nto Ø.\nConsider the right to drive that in the U.K. at least all qualified\nmotorists in possession of a valid licence have. An external con-\nstraint on its exercise might be the government’s determination that\nfor security reasons certain roads must be blocked off. Or that noise\nlevels have now reached such a high level that cars may no longer\ndrive down particular residential streets. Here contingent consider-\nations—security, noise pollution—are thought sufficiently weighty\nto constrain the exercise of the right to drive. By contrast an inter-\nnal constraint on the right to drive specifies what the right to drive\nallows the rights-holder to do, namely drive a licensed, insured car\non designated highways within the appropriate speed limits. A\nmotorist who drives on a pavement does not exercise a right to drive\nwhich is appropriately constrained by considerations such as the\nsafety of pedestrians. He simply does not exercise the specified\nright to drive. \nOr consider the right to freedom of expression guaranteed by the\nFirst Amendment to the American Constitution and by Article 10\nof the European Convention on Human Rights, incorporated into\nthe law of the United Kingdom by the Human Rights Act 1998.\nInternal constraints on the right specify what forms of speech one\nDavid Archard\n414\n31 John A. Robertson, op. cit., Chapter 2.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nhas a right to the free expression of. In the United States the\nSupreme Court has adopted the policy of categorizing certain forms\nof expression as falling outside the protection of the First\nAmendment. Thus, for instance, advertising is ‘commercial speech’\nand has in past judgments been categorized by the Supreme Court\nas not a form of speech to which American citizens have a First\nAmendment right of free expression.  \nBy contrast an external constraint on this right might be given by\nconsiderations of the public good. An individual could thus be pre-\nvented from the expression of a view—the expression nonetheless\ncounting as a form of protected speech—on the grounds that under\nthe circumstances it constitutes a clear and serious harm to some pub-\nlic interest. Moreover courts could determine that a particular form\nof expression falling within the scope of the right is nevertheless enti-\ntled to less protection than other forms of expression. Less weighty\nconsiderations of the public good would be needed to trump the right\nto this form of expression than would be necessary to set aside the\nright to other forms. Thus it might be determined that commercial\nspeech is a form of expression protected by the First Amendment but\none requiring less protection than other forms also so protected.\nInternal constraints in the above examples specify the action\ntypes that fall within the scope of a right. But there is no reason why\nan internal constraint should not take the form of a requirement or\nduty incumbent on those who possess a right in their exercise of\nthat right. For instance, Robert Nozick argues that the Lockean\nproviso—leave as much and as good for others—internally con-\nstrains the right of property acquisition. So when the proviso is\ntransgressed it is not the case that the right to property is overrid-\nden by other considerations. ‘There is no such external (and ad\nhoc?) overriding. Considerations internal to the theory of property\nitself, to its theory of acquisition and appropriation’ explain why the\nright in question cannot be exercised.32\nI maintain that the right to procreate is internally constrained and\nin the following manner. An adult may exercise his or her repro-\nductive powers to bring a child into being only if the child in ques-\ntion has the reasonable prospect of a minimally decent life.\nSteinbock and McClamrick speak in this context of ‘a principle of\nparental responsibility’ which requires of individuals that they\n‘refrain, when possible, from having children if they cannot give\nthem a decent chance of a happy life’.33 Onora O’Neill similarly\nWrongful Life\n415\n32 Robert Nozick, op. cit, 180–1 (second emphasis added).\n33 B. Steinbock and R. McClamrock, ‘When is Birth Unfair to the\nChild?’, Hastings Center Report, Nov–Dec 1994, 18.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nargues that ‘the right to beget or rear is not unrestricted, but con-\ntingent upon begetters and bearers having or making some feasible\nplan for their child to be adequately reared by themselves or by will-\ning others. Persons who beget or bear without making any such\nplans cannot claim that they are exercising a right’.34 She thinks that\nsomeone who conceives a child with no such plan does not exercise\nthe right to procreate. Just as someone who publicly advertises his\nwares may not exercise a right to free speech and an unlicensed\ndriver who drives an uninsured car on public roads does not\nexercise a right to drive a vehicle\nAny parent who intentionally and knowingly brings into existence\na child whose prospect of life is better than non-existence yet below\nthe threshold does wrong. It is not that harms are done to the future\nchild which somehow outweigh or override the exercise of the right\nto procreate. The parent does not exercise that right, and thus does\nnot do something that is presumptively morally permissible. The\nchild is wronged by being born even if it is not harmed. The child is\nwronged in that it has a right to be given the reasonable prospect of\na life, one that is not just barely but is sufficiently worth living and\nmeets the specified threshold. This right, the child’s birthright, is\nthe corollary of the prospective parent’s duty to exercise its procre-\native liberty in the manner specified by its internal constraints. \nIt is not a problem that an action may wrong another but not harm,\nindeed may even benefit, them. Consider the broken promise that\nrebounds to the benefit of the promisee, or the theft of the airline\nticket for a flight that crashes killing all on board.35 Thus I am happy\nto say that the parents who bring into existence a child knowing that\nshe will enjoy a less than minimally decent life wrong the child even\nif they do not harm the child—either because non-existence cannot\nsensibly be compared with her miserable existence or because, ex\nhypothesi, her miserable existence is better than non-existence. The\nparents violate the child’s birthright to a minimally decent existence.\nIV\nIn the concluding section of this article I want to do three things:\nmeet an important objection to my claim, clarify whether it is always\nDavid Archard\n416\n34 Onora O’Neill, ‘Begetting, Bearing and Rearing’, O. O’Neill and W.\nRuddock (eds.), Having Children: Philosophical and Legal Reflections on\nParenthood (Oxford: Oxford University Press, 1979), 25.\n35 James Woodward, ‘The Non-Identity Problem,’ Ethics 96 (1986),\n804–31.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nwrong to create an individual who may be reasonably expected to\nlead a very poor life, and to state what follows from my claim. The\nobjection is that my claim appears circular or unsubstantiated.36\nThere is a duty not to bring miserable children into existence\nbecause they have a right not to be brought into such an existence.\nThe duty’s warrant derives from the birthright that in turn is either\nsimply asserted or justified by appeal to the idea that we ought not\nto create barely worthwhile lives, that is that we are under the duty\ncorrelate with the putative birthright.\nThere is a reply to this charge. It is that thinking of the right of\nprocreative liberty, as internally constrained in the manner suggest-\ned, is warranted whereas thinking, as Harris and Robertson do, of\nthe right as only externally constrained by a harm principle is not.\nThe warrant is to be found in the idea of consistency. Here I follow\nand expand on some comments of Onora O’Neill.37 She points out\nhow Robertson and Harris both see the exercise of procreative lib-\nerty as simply a mode of making exclusively personal choices.\nHarris follows Ronald Dworkin who views the right of procreative\nautonomy as guaranteed by the First Amendment right of free self-\nexpression.38 Harris explicitly echoes Dworkin when he writes that\n‘the sorts of freedom which freedom of religion guarantees, free-\ndom to choose one’s own way of life according to one’s own most\ndeeply held beliefs, are also at the heart of procreative choices.’39\nOnora O’Neill rightly comments that reproductive choice ‘is not\nbest seen on the model of the exercise of a liberty right, such as a\nright to freedom of expression’ but adds only that this is because\nreproduction ‘aims to create a dependent being, and reproductive\ndecisions are irresponsible unless those who make them can reason-\nably offer adequate and lasting care and support to the hoped-for\nchild.’40 This may well accord with many people’s considered judg-\nment but it sounds question-begging. Moreover Harris and\nRobertson will surely respond that the presumptive liberty right\nthey defend is not unconstrained. It does take account of the inter-\nests of the future child. A child whose reasonable life prospects are\nWrongful Life\n417\n36 Morreim, op. cit., 22.\n37 Onora O’Neill, Autonomy and Trust in Bioethics (Cambridge:\nCambridge University Press, 2002), 60–3.\n38 Ronald Dworkin, Freedom’s Law (Oxford: Oxford University Press,\n1996), 104–5.\n39 John Harris, ‘Rights and Reproductive Choices’, John Harris and\nSøren Holm (eds.) The Future of Human Reproduction: Ethics, Choice and\nRegulation (Oxford: Clarendon Press, 1998), 35.\n40 Autonomy and Trust in Bioethics, 61 and 62.\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nworse than non-existence is harmed if brought into being. A parent\nalso does wrong if she could—at no unreasonable cost to herself—\ncreate a child whose prospects of life are significantly better than\nthose of the child she does conceive.\nThinking as O’Neill does certainly accords with our broader\nintuitions about the value and point of using our reproductive pow-\ners to bring another human being into existence. However more can\nbe said to defend this way of thinking against Harris and Robertson\nalong the following lines. A right of procreative liberty is one of a\nset of rights that the adult human being may be presumed to pos-\nsess. The exercise of any of these rights cannot be at the expense of\nanother’s rights, that is be such as to subvert or vitiate the posses-\nsion or enjoyment of another’s rights. But that is precisely what\nwould be the case if the right to procreate could be exercised so as\nto bring into being a child incapable of enjoying her rights. The\nsame essential claim can be made in terms of interests. Grant that\nhuman beings do have a fundamental interest in the creation of\ntheir own offspring and that it is proper not to seek to frustrate the\nenjoyment of this basic interest. However its satisfaction cannot be\nat the expense of another human being’s enjoyment of her most\nbasic interests. But that is precisely what would be the case if a\nhuman being knowingly and deliberately conceived a child whose\nown life is likely to fall below a minimum specified in terms of\ninterests. \nThe birthright is to the enjoyment of a significant number of the\nrights possessed by any child. A parent would not do wrong by\ncreating a child who might be reasonably expected not to enjoy one\nof her rights. Wrong is done when the child’s life falls below a\nthreshold which has been identified as the secure enjoyment of a\ngood number of her rights. It is conceded that this is somewhat inde-\nterminate. Yet it should be transparently clear that exercising one\nliberty right in such a fashion and with the consequence that\nanother human being cannot enjoy most of her rights is wrong.\nIs it always wrong deliberately to bring into being an individual\nwhose life may reasonably be expected to be very poor? There are\ntwo very different circumstances which might give us pause. The\nfirst is when bringing someone into existence arguably serves a very\ngreat public good, or averts a very great public harm. Imagine, at\nthe extreme, that after some awful catastrophe only two couples on\nearth remain. They know this is the case and that any child each\ncouple can conceive will enjoy a barely acceptable existence. They\nhad not otherwise planned to conceive. If one thinks, reasonably,\nthat the continued existence of the human species is, ceteris paribus,\nDavid Archard\n418\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\na very great good and, further, that the only chance of its continu-\ning in these circumstances is if the couples have children then the\ncouples are permitted to conceive. Indeed arguably they are obliged\nto do so.\nA less extreme situation is one in which the continued existence\nof a society or a culture or a tribe is similarly dependent upon the\nbirth of one or more children to members of the group. These chil-\ndren will enjoy a less than minimally decent existence. It could be\nargued that bringing children into being in these circumstances is\nalso permissible. However I am far less sure that the continued exis-\ntence of the group is an evident good, in the way that the continua-\ntion of the species is, that outweighs the wrong done to the children.\nThe second type of circumstance in which it might not be\nthought wrong, all things considered, to create a barely tolerable life\nis where the situation of the future child is not attributable to any\nactions by her parents. Imagine then that the child will be born to\nextreme poverty and that this condition can reasonably be explained\nas the result of the actions, individual and collective, of human\nbeings other than the parents. In short it is not the parents’ fault\nthat they are very poor and that any child they have will suffer a\nvery poor life. Should they be denied a choice to have a child that is\navailable to those richer than they are? If it is wrong that they can\nonly do wrong by having a child, is their having the child really\nwrong?\nHowever the wrongfulness of having the child in these circum-\nstances does not transfer from the parents to those responsible for\ntheir poverty such that the parents act blamelessly in conceiving a\nchild whose life will be very poor. Their decision to have the child\nis deliberate. It is not done under duress. Not having the child does\nnot threaten their life; it merely frustrates an admittedly central\ninterest of theirs. That they cannot have a child without doing\nwrong is the result of the wrongful actions of others. This provides\na moral reason to change their economic circumstances. It does not\nexempt them from blame if they do have the child.\nConsider a very rich and avid stamp collector, Smith, who needs\na particular and unique stamp to complete his collection. It has been\nhis whole life’s ambition to do this. The stamp in question is not\navailable for purchase because at some point in the past it was\nstolen, and has passed subsequently into the hands of another col-\nlector, Jones, who is unwilling to sell it.  Smith would be wrong to\nsteal the stamp from Jones. That this is the only way for Smith to\npossess the stamp, and complete his life ambition, is the result of a\npast wrong. This fact is a moral reason for changing the status of the\nWrongful Life\n419\nhttp:\/\/journals.cambridge.org Downloaded: 26 Mar 2009 IP address: 194.80.32.9\nstamp, warranting the state, for instance, in taking the stamp from\nJones. But the same fact does not give us a reason to think Smith’s\nact of theft any the less wrong.\nThe practical upshot of my claim is simple. Assisted reproduction\nshould not be available to couples where one can be reasonably sure\nthat any child they will conceive will enjoy a life that falls below the\nspecified threshold. In the case of couples who do not need assis-\ntance in conceiving things are obviously more complicated. Where\nconception was unintended but subsequently welcomed we cannot,\nto repeat, determine whether wrong, all things considered, is done by\nallowing the pregnancy to continue. This is because such a judgment\nrequires a determination of the moral permissibility or impermissi-\nbility of abortion. Those who deliberately create a miserable life are\nblameworthy. But it should be recognized that appropriate practical\nmeasures are limited and most likely ineffective.\nHowever consideration should be given to the compulsory steril-\nization of those who can only bring into existence persons whose\nlives will fall below the threshold. The principal moral reason\nagainst the compulsory sterilization of anyone is that it abrogates\ntheir procreative liberty right. However those who can only con-\nceive persons whose lives will be very poor cannot exercise this\nright. For this right is internally constrained by the requirement\nthat anyone conceived will be born to lead a life that can reasonably\nbe expected to be a minimally decent one. One does not do wrong\nin abrogating a right that cannot be exercised. One may do wrong in\nother respects but cannot do so in this regard.\nTo conclude: the minimum threshold entitlement of any child is\nthe secure enjoyment of a good number of those rights that are listed\nin the United Nations Convention on the Rights of the Child. This\nis every child’s birthright. A parent does wrong in knowingly bring-\ning into existence a child who will not enjoy most of these rights.\nActing in this wrongful way she does not exercise a procreative\nliberty right since that right is internally constrained by the\nobligation to ensure that any child will be guaranteed at least the\nadequate life which these rights circumscribe.41\nLancaster University\nDavid Archard\n420\n41 An earlier version of this article was presented as a paper to a confer-\nence on the new reproductive technologies at the University of Giessen. I\nam grateful to those present, including John Harris and John Robertson,\nfor their comments at the time and subsequently. The paper was also pre-\nsented to a seminar at the University of Lancaster, and I am grateful to my\nphilosophy colleagues, John O’Neill, Alison Stone, Cain Todd, Rachel\nCooper, and Garrath Williams, for their very helpful critical suggestions.\n"}