{"doi":"10.1016\/S0037-0738(01)00251-2","coreId":"71959","oai":"oai:eprints.lancs.ac.uk:19","identifiers":["oai:eprints.lancs.ac.uk:19","10.1016\/S0037-0738(01)00251-2"],"title":"Melting of the glacier base during a small-volume subglacial rhyolite eruption: evidence from Blahnukur, Iceland.","authors":["Tuffen, H","Pinkerton, H","Gilbert, JS","McGarvie, DW"],"enrichments":{"references":[{"id":16437079,"title":"A comparison of Miocene and Archean rhyolite hyaloclastites - evidence for a hot and fluid rhyolite lava.","authors":[],"date":"1985","doi":"10.1016\/0377-0273(85)90040-x","raw":"Yamagishi, H., Dimroth, E., 1985. A comparison of Miocene and Archean rhyolite hyaloclastites - evidence for a hot and fluid rhyolite lava. J. Volcanol. Geotherm. Res. 23, 337-355.","cites":null},{"id":16437077,"title":"A new model for the evolution of table mountains: volcanological and petrological evidence from Herðubreið and Herðubreiðartogl volcanoes (Iceland).","authors":[],"date":"1996","doi":"10.1007\/bf02422244","raw":"Werner, R., Schmincke, H.U., Sigvaldason, G., 1996. A new model for the evolution of table mountains: volcanological and petrological evidence from Herðubreið and Herðubreiðartogl volcanoes (Iceland). Geol. Rundschau. 85, 390-397.","cites":null},{"id":16437056,"title":"Effect of hydrostatic confining pressure on the failure mode and compressive strength of polycrystalline ice.","authors":[],"date":"1998","doi":"10.1021\/jp963163b","raw":"Mizuno, Y., 1998. Effect of hydrostatic confining pressure on the failure mode and compressive strength of polycrystalline ice. J. Phys. Chem. B 102, 376-381.","cites":null},{"id":16437036,"title":"Effects of subglacial geothermal activity observed by satellite radar interferometry.","authors":[],"date":"1998","doi":"10.1029\/98gl50567","raw":"Jónsson, S., Adam, N., Björnsson, H., 1998. Effects of subglacial geothermal activity observed by satellite radar interferometry. Geophys. Res. Lett. 25, 1059-1062.","cites":null},{"id":16436996,"title":"Environmental effects on volcanic eruptions,","authors":[],"date":"2000","doi":"10.1007\/978-1-4615-4151-6_3","raw":"Chapman, M.G., Allen, C.C., Guðmundsson, M.T., Gulick, V.C., Jakobsson, S.P., Lucchita, B.K., Skilling, S.P., Waitt, R.B., 2000. Volcanism and ice interactions on Earth and Mars. In: Zimbelman,  J.R., Gregg, T.K.P (Eds.), Environmental effects on volcanic eruptions, pp. 39-73.","cites":null},{"id":16437065,"title":"Evolution of an englacial volcano -","authors":[],"date":"1994","doi":"10.1007\/bf00302837","raw":"Skilling, I.P., 1994. Evolution of an englacial volcano - Brown Bluff, Antarctica. Bull. Volcanol. 56, 573-591.","cites":null},{"id":16437054,"title":"Extended cooling and viscous flow of large, hot rhyolite lavas: implications of numerical modelling results.","authors":[],"date":"1992","doi":"10.1016\/0377-0273(92)90072-l","raw":"Manley, C.R., 1992. Extended cooling and viscous flow of large, hot rhyolite lavas: implications of numerical modelling results. J. Volcanol. Geotherm. Res. 53, 27-46.","cites":null},{"id":16437040,"title":"Firn caves in the volcanic craters of Mount Rainier,","authors":[],"date":"1975","doi":"10.1126\/science.173.3994.320","raw":"Kiver, E.P., Steele, W.K., 1975. Firn caves in the volcanic craters of Mount Rainier, Washington. Nat. Spel. Soc. Bull. 37, 45-55.","cites":null},{"id":16437081,"title":"Fumaroles in ice caves on the summit of Mount Rainier - preliminary stable isotope, gas, and geochemical studies.","authors":[],"date":"2000","doi":"10.1016\/s0377-0273(99)00180-8","raw":"Zimbelman, D.R., Rye, R.O., Landis, G.P., 2000. Fumaroles in ice caves on the summit of Mount Rainier - preliminary stable isotope, gas, and geochemical studies. J. Volcanol. Geotherm. Res. 97, 457-473.","cites":null},{"id":16437063,"title":"Fumarolic mounds and ridges of the Bishop Tuff,","authors":[],"date":"1970","doi":"10.1130\/0016-7606(1970)81[851:fmarot]2.0.co;2","raw":"Sheridan, M.F., 1970. Fumarolic mounds and ridges of the Bishop Tuff, California. Geol. Soc. Am. Bull. 81, 851-868.","cites":null},{"id":16436998,"title":"Glacier outburst floods from Hazard Lake, Yukon Territory, and the problem of flood magnitude prediction.","authors":[],"date":"1982","doi":"10.1139\/e81-136","raw":"Clarke, G.K.C, 1982. Glacier outburst floods from Hazard Lake, Yukon Territory, and the problem of flood magnitude prediction. J. Glaciol. 28, 3-21.","cites":null},{"id":16436994,"title":"Hydrology of ice caps in volcanic regions.","authors":[],"date":"1988","doi":"10.1017\/s0032247400011293","raw":"Björnsson, H., 1988. Hydrology of ice caps in volcanic regions. Soc. Sci. Isl. Rit. 45, 1-129.","cites":null},{"id":16436988,"title":"Icelandic subglacial volcanism: thermal and physical studies.","authors":[],"date":"1980","doi":"10.1086\/628478","raw":"Allen, C.C., 1980. Icelandic subglacial volcanism: thermal and physical studies. J. Geol. 88, 108-117. Alsdorf, D.E., Smith, L.C., 1999. Interferometric SAR observations of ice topography and velocity changes related to the 1996, Gjálp subglacial eruption, Iceland. Int. J. Rem. Sens. 20, 3031-3050.","cites":null},{"id":16437044,"title":"Lava and ice interaction at stratovolcanoes: use of characteristic features to determine past glacial extents and future volcanic hazards.","authors":[],"date":"2000","doi":"10.1029\/2000jb900214","raw":"Lescinsky, D.T., Fink, J.H., 2000. Lava and ice interaction at stratovolcanoes: use of characteristic features to determine past glacial extents and future volcanic hazards. J. Geophys. Res. 105, 23711-23726.","cites":null},{"id":16437003,"title":"Modelling the evolution of subglacial tunnels due to varying water input.","authors":[],"date":"1998","doi":null,"raw":"Cutler, P.M., 1998. Modelling the evolution of subglacial tunnels due to varying water input. J. Glaciol. 44, 485-497.","cites":null},{"id":16436992,"title":"New light on caldera evolution:","authors":[],"date":"1991","doi":"10.1130\/0091-7613(1991)019<0352:nlocea>2.3.co;2","raw":"Brown, G.C., Everett, S.P., Rymer, H., McGarvie, D.W., Foster. I., 1991. New light on caldera evolution: Askja, Iceland. Geology 19, 352-355.","cites":null},{"id":16437015,"title":"Non-explosive, constructional evolution of the ice-filled caldera at Volcan Sollipulli,","authors":[],"date":"1996","doi":"10.1007\/s004450050127","raw":"Gilbert, J.S., Stasiuk, M.V., Lane, S.J., Adam, C.R., Murphy, M.D., Sparks, R.S.J., Naranjo, J.A., 1996. Non-explosive, constructional evolution of the ice-filled caldera at Volcan Sollipulli, Chile. Bull.Volcanol. 58, 67-83.","cites":null},{"id":16437024,"title":"On the role of mechanical energy in maintaining subglacial water conduits at atmospheric pressure.","authors":[],"date":"1984","doi":null,"raw":"Hooke, R.L., 1984. On the role of mechanical energy in maintaining subglacial water conduits at atmospheric pressure. J. Glaciol. 30, 180-187.","cites":null},{"id":16437008,"title":"Porous media: fluid transport and pore structure (2nd ed.).","authors":[],"date":"1992","doi":"10.1002\/aic.690380819","raw":"Dullien, F.A.L. (1992) Porous media: fluid transport and pore structure (2nd ed.). Academic Press, 574pp.","cites":null},{"id":16437075,"title":"Products of an effusive subglacial rhyolite eruption:","authors":[],"date":"2001","doi":"10.1007\/s004450100134","raw":"Tuffen, H., Gilbert, J.S., McGarvie, D.W., 2001. Products of an effusive subglacial rhyolite eruption: Bláhnúkur, Torfajökull, Iceland. Bull. Volcanol., in press.","cites":null},{"id":16437067,"title":"Products of subglacial volcanic eruptions under different ice thicknesses - two examples from Antarctica.","authors":[],"date":"1994","doi":"10.1016\/0037-0738(94)90125-2","raw":"Smellie, J.L., Skilling, I.P., 1994. Products of subglacial volcanic eruptions under different ice thicknesses - two examples from Antarctica. Sed. Geol. 91, 115-129.","cites":null},{"id":16437032,"title":"Pumiceous peperite in a submarine volcanic succession at Mount Chalmers,","authors":[],"date":"1999","doi":"10.1016\/s0377-0273(99)00015-3","raw":"Hunns, S.R., McPhie, J., 1999. Pumiceous peperite in a submarine volcanic succession at Mount Chalmers, Queensland, Australia. J. Volcanol. Geotherm. Res. 88, 239-254.","cites":null},{"id":16437042,"title":"Ridge-forming, ice-bounded lava flows at Mount Rainier,","authors":[],"date":"1998","doi":"10.1130\/0091-7613(1998)026<0351:rfiblf>2.3.co;2","raw":"Lescinsky, D.T., Sisson, T.W., 1998. Ridge-forming, ice-bounded lava flows at Mount Rainier, Washington. Geology 26, 351-354.","cites":null},{"id":16437052,"title":"Snow and ice perturbation during historical volcanic eruptions and the formation of lahars and floods.","authors":[],"date":"1989","doi":"10.1007\/bf00641384","raw":"Major, J.J., Newhall, C.G., 1989. Snow and ice perturbation during historical volcanic eruptions and the formation of lahars and floods. Bull. Volcanol. 52, 1-27.","cites":null},{"id":16437069,"title":"Subglacial eruptions. In: Encyclopaedia of Volcanoes, (Ed. by H.","authors":[],"date":"1999","doi":null,"raw":"Smellie, J.L., 1999. Subglacial eruptions. In: Encyclopaedia of Volcanoes, (Ed. by H. Sigurdsson), Academic Press, San Diego, pp. 403-418.","cites":null},{"id":16437073,"title":"Subglacial rhyolite volcanism at Torfajökull, Iceland. Unpublished PhD thesis,","authors":[],"date":"2001","doi":"10.1007\/s004450100134","raw":"Tuffen, H., 2001. Subglacial rhyolite volcanism at Torfajökull, Iceland. Unpublished PhD thesis, Open University, UK.","cites":null},{"id":16437013,"title":"Subglacial volcanics - on the formation of acid hyaloclastites.","authors":[],"date":"1980","doi":"10.1016\/0377-0273(80)90009-8","raw":"Furnes, H., Fridleifsson, I.B., Atkins, F.B., 1980. Subglacial volcanics - on the formation of acid hyaloclastites. J. Volcanol. Geotherm. Res. 8, 95-110.","cites":null},{"id":16437027,"title":"Subglacial water pressures and the shape of subglacial conduits.","authors":[],"date":"1990","doi":null,"raw":"Hooke, R.L., Laumann, T., Kohler, J., 1990. Subglacial water pressures and the shape of subglacial conduits. J. Glaciol. 36, 67-71.","cites":null},{"id":16437038,"title":"Summit firn caves,","authors":[],"date":"1971","doi":"10.1126\/science.173.3994.320","raw":"Kiver, E.P., Mumma, M.D., 1971. Summit firn caves, Mount Rainier, Washington. Science 173, 320-322.","cites":null},{"id":16437034,"title":"The confined compressive strength of polycrystalline ice.","authors":[],"date":"1982","doi":null,"raw":"Jones, S.J., 1982. The confined compressive strength of polycrystalline ice. J. Glaciol. 28, 171-177.","cites":null},{"id":16437018,"title":"The creep of polycrystalline ice.","authors":[],"date":"1955","doi":"10.1098\/rspa.1955.0066","raw":"Glen, J.W., 1955. The creep of polycrystalline ice. Proc. R. Soc. Lond. Series A 228, 519-538.","cites":null},{"id":16437071,"title":"The equivalence of enthalpy and shear stress relaxation in rhyolitic obsidians and quantification of the liquid-glass transition in volcanic processes.","authors":[],"date":"1995","doi":"10.1016\/0377-0273(95)00015-1","raw":"Stevenson, R.J., Dingwell, D.B., Webb, S.L., Bagdassarov, N.S., 1995. The equivalence of enthalpy and shear stress relaxation in rhyolitic obsidians and quantification of the liquid-glass transition in volcanic processes. J. Volcanol. Geotherm. Res. 68, 297-306.","cites":null},{"id":16437058,"title":"The flow law of ice from measurements in glacier tunnels, laboratory experiments and the Jungfraufirn borehole experiment.","authors":[],"date":"1953","doi":"10.1098\/rspa.1953.0161","raw":"Nye, J.F., 1953. The flow law of ice from measurements in glacier tunnels, laboratory experiments and the Jungfraufirn borehole experiment. Proc. R. Soc. Lond. Series A 219, 477-489.","cites":null},{"id":16437061,"title":"The physics of glaciers (3rd ed). Pergamon,","authors":[],"date":"1994","doi":"10.1016\/0277-3791(96)83791-7","raw":"Paterson, W.S.B., 1994. The physics of glaciers (3rd ed). Pergamon, 480pp.","cites":null},{"id":16437030,"title":"Thermodynamics and fluid dynamics of effusive subglacial eruptions.","authors":[],"date":"1997","doi":"10.1007\/s004450050187","raw":"Hoskuldsson, A., Sparks, R.S.J., 1997. Thermodynamics and fluid dynamics of effusive subglacial eruptions. Bull. Volcanol. 59, 219-230.","cites":null},{"id":16436990,"title":"Thermodynamics of water-permeated unwelded pyroclasts.1. Equilibrium properties.","authors":[],"date":"1993","doi":"10.1016\/0377-0273(93)90013-h","raw":"Ascolese, E., Aurisicchio, A., Briggssmith, M., Mita, D.G., Perna, G., Rossi, S., Gaeta, F.S., 1993. Thermodynamics of water-permeated unwelded pyroclasts.1. Equilibrium properties. J. Volcanol. Geotherm. Res. 57, 219-233.","cites":null},{"id":16437048,"title":"Torfajökull - a volcano dominated by magma mixing.","authors":[],"date":"1984","doi":"10.1130\/0091-7613(1984)12<685:tavdbm>2.0.co;2","raw":"McGarvie, D.W., 1984. Torfajökull - a volcano dominated by magma mixing. Geology 12, 685-688.","cites":null},{"id":16437005,"title":"Use of joint-growth directions and rock textures to infer 15 thermal regimes during solidification of basaltic lava flows.","authors":[],"date":"1989","doi":"10.1016\/0377-0273(89)90045-0","raw":"DeGraff, J.M., Long, P.E., Aydin, A., 1989. Use of joint-growth directions and rock textures to infer    15 thermal regimes during solidification of basaltic lava flows. J. Volcanol. Geotherm. Res. 38, 309-324.","cites":null},{"id":16437046,"title":"Vesiculated tuff and associated features.","authors":[],"date":"1974","doi":"10.1111\/j.1365-3091.1974.tb02059.x","raw":"Lorenz, V., 1974. Vesiculated tuff and associated features. Sedimentology 21, 273-291.","cites":null},{"id":16437021,"title":"Volcanic ash.","authors":[],"date":"1985","doi":"10.1002\/gea.3340030112","raw":"Heiken, G., Wohletz, K., 1985. Volcanic ash. University of California Press, Berkeley, 246 pp.","cites":null},{"id":16437050,"title":"Volcanology and petrology of mixed magmas and rhyolites from the Torfajökull volcano, Iceland. Unpublished PhD thesis,","authors":[],"date":"1985","doi":null,"raw":"McGarvie, D.W., 1985. Volcanology and petrology of mixed magmas and rhyolites from the Torfajökull volcano, Iceland. Unpublished PhD thesis, University of Lancaster, UK.","cites":null},{"id":16437011,"title":"Water flow through temperate glaciers.","authors":[],"date":"1998","doi":"10.1029\/97rg03579","raw":"Fountain, A.G., Walder, J.S., 1998. Water flow through temperate glaciers. Rev. Geophys. 36, 299-328.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-05-15","abstract":"Although observations of recent volcanic eruptions beneath Vatnajokull, Iceland have improved the understanding of ice deformation and meltwater drainage, little is known about the processes that occur at the glacier base. We present observations of the products of a small-volume, effusive subglacial rhyolite eruption at Blahnukur, Torfajokull, Iceland. Lava bodies, typically 7 m long, have unusual conical morphologies and columnar joint orientations that suggest emplacement within cavities melted into the base of a glacier. Cavities appear to have been steep-walled and randomly distributed. These features can be explained by a simple model of conductive heat loss during the ascent of a lava body to the glacier base. The released heat melts a cavity in the overlying ice. The development of vapour-escape pipes in the waterlogged, permeable breccias surrounding the lava allows rapid heat transfer between lava and ice. The formed meltwater percolates into the breccias, recharging the cooling system and leaving a steam-filled cavity. The slow ascent rates of intrusive rhyolitic magma bodies provide ample time for a cavity to be melted in the ice above, even during the final 10 m of ascent to the glacier base. An equilibrium cavity size is calculated at which melting is balanced by creep closure. This is dependent upon the heat input and the difference between glaciostatic and cavity pressure. The cavity sizes inferred from Blahnukur are consistent with a pressure differential of 2-4 MPa, suggesting that the ice was at least 200 m thick. This is consistent with the volcanic stratigraphy, which indicates that the ice exceeded 350 m in thickness. Although this is the first time that a subglacial cavity system of this type has been reconstructed from an ancient volcanic sequence, it shares many characteristics with the modern firn cave system formed by fumarolic melting within the summit crater of Mount Rainier, Washington. At both localities, it appears that localised heating at the glacier base has resulted in heterogeneous melting patterns. Despite the different rheological properties of ice and firn, similar patterns of cavity roof deformation are inferred. The development of low-pressure subglacial cavities in regions of high heat flux may influence the trajectory of rising magma, with manifold implications for eruptive mechanisms and resultant subglacial volcanic landforms","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71959.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/19\/1\/Microsoft_Word_%2D_Tuffen_et_al_Sed_Geol_2002.pdf","pdfHashValue":"f725d32686a5027374f13e5d205937f25e477a72","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:19<\/identifier><datestamp>\n      2018-01-24T02:30:49Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5145<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Melting of the glacier base during a small-volume subglacial rhyolite eruption: evidence from Blahnukur, Iceland.<\/dc:title><dc:creator>\n        Tuffen, H<\/dc:creator><dc:creator>\n        Pinkerton, H<\/dc:creator><dc:creator>\n        Gilbert, JS<\/dc:creator><dc:creator>\n        McGarvie, DW<\/dc:creator><dc:subject>\n        QE Geology<\/dc:subject><dc:description>\n        Although observations of recent volcanic eruptions beneath Vatnajokull, Iceland have improved the understanding of ice deformation and meltwater drainage, little is known about the processes that occur at the glacier base. We present observations of the products of a small-volume, effusive subglacial rhyolite eruption at Blahnukur, Torfajokull, Iceland. Lava bodies, typically 7 m long, have unusual conical morphologies and columnar joint orientations that suggest emplacement within cavities melted into the base of a glacier. Cavities appear to have been steep-walled and randomly distributed. These features can be explained by a simple model of conductive heat loss during the ascent of a lava body to the glacier base. The released heat melts a cavity in the overlying ice. The development of vapour-escape pipes in the waterlogged, permeable breccias surrounding the lava allows rapid heat transfer between lava and ice. The formed meltwater percolates into the breccias, recharging the cooling system and leaving a steam-filled cavity. The slow ascent rates of intrusive rhyolitic magma bodies provide ample time for a cavity to be melted in the ice above, even during the final 10 m of ascent to the glacier base. An equilibrium cavity size is calculated at which melting is balanced by creep closure. This is dependent upon the heat input and the difference between glaciostatic and cavity pressure. The cavity sizes inferred from Blahnukur are consistent with a pressure differential of 2-4 MPa, suggesting that the ice was at least 200 m thick. This is consistent with the volcanic stratigraphy, which indicates that the ice exceeded 350 m in thickness. Although this is the first time that a subglacial cavity system of this type has been reconstructed from an ancient volcanic sequence, it shares many characteristics with the modern firn cave system formed by fumarolic melting within the summit crater of Mount Rainier, Washington. At both localities, it appears that localised heating at the glacier base has resulted in heterogeneous melting patterns. Despite the different rheological properties of ice and firn, similar patterns of cavity roof deformation are inferred. The development of low-pressure subglacial cavities in regions of high heat flux may influence the trajectory of rising magma, with manifold implications for eruptive mechanisms and resultant subglacial volcanic landforms.<\/dc:description><dc:date>\n        2002-05-15<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/S0037-0738(01)00251-2<\/dc:relation><dc:identifier>\n        Tuffen, H and Pinkerton, H and Gilbert, JS and McGarvie, DW (2002) Melting of the glacier base during a small-volume subglacial rhyolite eruption: evidence from Blahnukur, Iceland. Sedimentary Geology, 149 (1-3). pp. 183-198. ISSN 0037-0738<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/19\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1016\/S0037-0738(01)00251-2","http:\/\/eprints.lancs.ac.uk\/19\/"],"year":2002,"topics":["QE Geology"],"subject":["Journal Article","PeerReviewed"],"fullText":" 1 \nMelting of the glacier base during a small-volume subglacial \nrhyolite eruption: evidence from Bláhnúkur, Iceland. \n \nTuffen H, Pinkerton H, McGarvie DW, Gilbert JS \n \nAbstract    \nAlthough observations of recent volcanic eruptions beneath Vatnajökull, Iceland have \nimproved understanding of ice deformation and meltwater drainage, little is known \nabout the processes that occur at the glacier base. We present observations of the \nproducts of a small-volume, effusive subglacial rhyolite eruption at Bláhnúkur, \nTorfajökull, Iceland. Lava bodies, typically 7 m long, have unusual conical \nmorphologies and columnar joint orientations that suggest emplacement within \ncavities melted into the base of a glacier. Cavities appear to have been steep-walled \nand randomly distributed. These features can be explained by a simple model of \nconductive heat loss during the ascent of a lava body to the glacier base. The heat \nreleased melts a cavity in the overlying ice. The development of vapour-escape pipes \nin the waterlogged, permeable breccias surrounding the lava allows rapid heat transfer \nbetween lava and ice. The meltwater formed percolates into the breccias, recharging \nthe cooling system and leaving a steam-filled cavity.  \n The slow ascent rates of intrusive rhyolitic magma bodies provides ample \ntime for a cavity to be melted in the ice above, even during the final 10 m of ascent to \nthe glacier base. An equilibrium cavity size is calculated, at which melting is balanced \nby creep closure. This is dependent upon the heat input and the difference between \nglaciostatic and cavity pressure. The cavity sizes inferred from Bláhnúkur are \nconsistent with a pressure differential of 2-4 MPa, suggesting that the ice was at least \n200 m thick. This is consistent with the volcanic stratigraphy, which indicates that the \nice exceeded 350 m in thickness. \nAlthough this is the first time that a subglacial cavity system of this type has \nbeen reconstructed from an ancient volcanic sequence, it shares many characteristics \nwith the modern firn cave system formed by fumarolic melting within the summit \ncrater of Mount Rainier, Washington. At both localities it appears that localised \nheating at the glacier base has resulted in heterogeneous melting patterns. Despite the \ndifferent rheological properties of ice and firn, similar patterns of cavity roof \ndeformation are inferred. The development of low-pressure subglacial cavities in \nregions of high heat flux may influence the trajectory of rising magma, with manifold \nimplications for eruptive mechanisms and resultant subglacial volcanic landforms. \n \nHugh Tuffen  \nDepartment of Earth Sciences, The Open University, Milton Keynes, MK7 6AA, UK and \nDepartment of Environmental Science, Lancaster University, Lancaster LA1 4YQ, UK \nE-mail: h.tuffen@lancaster.ac.uk \n \nHarry Pinkerton, Jennie Gilbert \nDepartment of Environmental Science, Lancaster University, Lancaster LA1 4YQ, UK \n \nDave McGarvie  \nDepartment of Earth Sciences, The Open University, Milton Keynes, MK7 6AA, UK \n \n \n \n 2 \nKeywords Subglacial, rhyolite, lava, cavity, melting, volcano, ice \n \n \nIntroduction    \nConsiderable progress has been made in recent years in understanding subglacial \nvolcanic phenomena. Observations of the 1996 Gjálp eruption beneath Vatnajökull, \nIceland have shed light on ice deformation, melting rates and meltwater drainage \npatterns that accompany small-volume subglacial basaltic eruptions (Guðmundsson et \nal., 1997; Alsdorf & Smith 1999). Meanwhile, detailed lithofacies analysis of ancient \nsubglacial volcanic sequences has helped to reconstruct the mechanisms of much \nlarger-volume basaltic eruptions (e.g. Smellie & Skilling, 1994; Werner et al., 1996; \nSmellie, 1999). The principal hazards during subglacial volcanic eruptions are caused \nby the accumulation of meltwater, which can interact explosively with rising magma, \nand which may drain suddenly, causing catastrophic floods (Major & Newhall, 1989; \nChapman et al., 2000). It is thus of paramount importance to understand the \nmechanisms and rates of melting that occur during different types of subglacial \neruption. A vexed question is the mechanism of energy exchange between magma and \nice. To date, little is known about processes that occur at the ice-magma interface. \nThis paper presents observations from Bláhnúkur, a subglacial rhyolite volcano at \nTorfajökull, Iceland. Lava bodies at Bláhnúkur may provide a unique record of \nmelting patterns at the glacier base during a small-volume rhyolite eruption. \n \nMelting of ice during subglacial eruptions \nSubglacial volcanic eruptions are dynamic multi-component systems, in which ice, \nwater, steam and intact and fragmented magma can interact. Various mechanisms of \nenergy exchange between magma and ice may occur, depending upon the magma \nproperties, eruption rate, and environmental factors (e.g. presence of meltwater, \neffective pressure, architecture of subglacial cavities). Since these environmental \nfactors are themselves largely determined by the local melting rate (Hooke, 1984; \nHooke et al, 1990; Hoskuldsson & Sparks, 1997; Fountain & Walder, 1998), there is \ncoupling between eruptive and melting mechanisms (Tuffen et al., 2001). \nConsequently, the style of magma-ice interaction may be both spatially and \ntemporally heterogeneous, being sensitive to fluctuations in eruption rate and cavity \nposition (Tuffen et al., 2001; Tuffen, 2001).  \n To date, there have been few detailed studies of energy exchange mechanisms \nin a subglacial setting (Allen 1980; Hoskuldsson & Sparks, 1997; Lescinsky & Fink, \n2000). Hoskuldsson & Sparks develop a conceptual model, in which energy is \ntransferred from effusive lava 'pillows' to ice via convecting meltwater. It leads to low \nestimates of ice melting rates: 10-5 m s-1 in basaltic and 10-6 m s-1 in rhyolitic \neruptions. Considerably higher melting rates of 10-3 m s-1 occurred during the 1996 \nGjálp eruption in Iceland (Guðmundsson et al., 1997). This is though to be due to \nrapid heat exchange between fragmenting magma and meltwater, and rapid heat \nexchange between the convecting, heated meltwater and the surrounding ice. To \nimprove the understanding of energy exchange during a specific phase of a ancient \nsubglacial eruption, it is necessary to construct models that account for all features of \nthe lithofacies produced. Recent fieldwork on subglacial lithofacies in Iceland \nsuggests that convecting meltwater models (Hoskuldsson & Sparks, 1997; Lescinsky \n& Fink, 2000) are inappropriate for effusive rhyolitic eruptions, since there is \nevidence of meltwater drainage, rather than accumulation (Tuffen et al., 2001). This \ncomes from 1) the presence of juvenile sediments at the base of the subglacial rhyolite \n 3 \nsequence thought to be have been deposited by flowing water, and 2) the massive, \npoorly-sorted nature of the bulk of the fragmental deposits, which indicates that \nreworking within standing water did not occur (c.f. Skilling, 1994). However, little is \nknown about the thermodynamics of alternative melting mechanisms (e.g. convecting \nsteam or abrasion of ice by ash particles during subglacial explosions). \n \nEvidence from ice caves in volcanic areas \n \nObservations of subglacial volcanic eruptions can help to reconstruct ice-\nmelting and drainage patterns (Guðmundsson et al., 1997). However, the glacier base \nis generally obscured during an eruption, and extreme hazards prevent researchers \nfrom entering any subglacial cavities. Thankfully, useful insights into melting patterns \nand cavity morphologies can be gained from glacier-bearing volcanoes currently in a \nquiescent phase. Fumarole-melted ice and firn caves are known to exist at Mount \nRainier, Washington, Mount Baker, Washington, Mount Wrangell, Alaska and Mount \nErebus, Antarctica (Kiver & Steele, 1975). Of these, the summit firn caves of Mount \nRainier are by far the best documented (e.g. Kiver & Mumma, 1971; Kiver & Steele, \n1975; Zimbelman et al., 2000). A cave system totalling 1.9 km in length has been \nmapped to date within the summit craters (Fig. 1), beneath snow and firn up to 120 m \nthick. Although the mechanical properties of firn differ from those of ice (e.g. \nPaterson, 1994), the patterns of basal melting and deformation are likely to be similar. \nKiver & Steele (1975) made the following observations: \n1. Meltwater drips almost continuously from firn walls and ceilings, but \npercolation into the permeable substrate appears to prevent the accumulation \nof standing water. Drainage occurs because the water table is significantly \nbelow the base of the firn. \n2. Rates of cavity closure by firn deformation and enlargement by fumarolic \nmelting were in approximate equilibrium during the period 1970-1974. \nDeformation and melting rates were estimated at 2-3 m per year (~10-7 m s-1). \nDeformation was entirely ductile, despite a pressure difference of up to 1 MPa \nbetween the 'glaciostatic' pressure of the firn roof and the cavity at \natmospheric pressure. \n3. The position of cavities is strongly influenced by the spatial distribution of \nbasal heating, with individual cavities related to single fumaroles. However, \nsome sections of cavities appear to be maintained by motion of warm air.  \n4. Cavities occur as slope-normal 'perimeter passages' and slope-parallel cavities \n(Fig. 1). Both types are roughly semi-circular in cross section and bounded by \nsteep, scalloped firn walls. There is well-established airflow from one cavity \nto the next. \n5. Talus on cavity floors is close to the angle of repose (30-40°), and highly \nunstable. \n6. Smooth-walled conical 'steam cups' develop above the most powerful \nfumaroles. \n \nExperimental and numerical simulations of cavity evolution \n \nHoskuldsson & Sparks (1997) used blocks of ice and PEG wax and a basal heat \nsource to simulate the formation of subglacial cavities during volcanic eruptions. \nCavities entirely filled with convecting meltwater had conical morphologies, whereas \nthose in which an air gap developed became ‘pancake-shaped’. This reflects slower \n 4 \nmelting rates of ice in contact with air than ice in contact with convecting meltwater.  \nIn a study of melting during 'normal' conditions (i.e. no geothermal heat), finite \nelement analysis was used to investigate the evolution of a subglacial conduit carrying \na variable meltwater flux (Cutler, 1998). During periods of high meltwater discharge, \nconduits may become only partially filled with meltwater. This acts to focus melting \nlow on the walls, forming broad, low conduits (c.f. Hooke, 1984). Pressure in \nconduits may become atmospheric, if a hydrological connection is established with \nthe glacier snout, or to the glacier surface via a system of fractures. Thermal energy \nreleased in a subglacial eruption may cause heating or even boiling of meltwater, \ndepending upon the relative rates of magma-water and meltwater-ice energy exchange \n(Hoskuldsson & Sparks, 1997) and the cavity pressure. Melting by heated meltwater \nmay be an order of magnitude more rapid than melting caused purely by the \nmechanical energy of flowing meltwater at the pressure melting point (Clarke, 1982). \nLittle is currently understood about subglacial melting mechanisms during eruptions. \nThe shape of evolving cavities may be controlled by the patterns of convection within \nmeltwater or steam in the cavity (Hoskuldsson & Sparks, 1997). \n \nCavity pressure and hydrology \nHoskuldsson & Sparks (1997) predicted that eruption of rhyolite within a water-filled \nsubglacial cavity would cause positive pressure changes. This is because the volume \nreduction upon melting of ice is insufficient to accommodate the volume increase \ncaused by injection of magma into the cavity. However, overpressure could not be \nsustained if the subglacial substrate is permeable, as meltwater would be driven into \nthe substrate, with a flux proportional to the local pressure gradient (Dullien, 1992). \nPoorly-consolidated fine-grained ash, which forms the substrate at Bláhnúkur, has a \nrelatively high permeability (Ascolese et al., 1993), which would favour re-\nequilibration of subglacial pressure by porous flow.  \nThe position of the water table at the glacier base controls patterns of water \nflow (Björnsson 1988), including flow between subglacial cavities and the glacier \nsubstrate. If the water table is below the subglacial volcanic edifice, low pressure air-\nfilled cavities may develop, and the edifice will tend to be rather dry, with only minor \nmagma-water interaction. A water table at or above the edifice will favour the \ndevelopment of water-filled cavities at higher pressures. The latter scenario is the \nmore likely for eruptions beneath temperate glaciers and ice sheets such as those in \nIceland (e.g. Björnsson, 1988).   \nLow-pressure conditions are known to develop in subglacial drainage conduits \nclose to the glacier snout during periods of high water flux (Hooke, 1984; Fountain & \nWalder, 1998). This is due to the melting rate exceeding the deformation rate, leading \nto conduit enlargement and the presence of an air gap, which will be at atmospheric \npressure if there is a hydraulic connection with the glacier snout (Hooke, 1984). Rapid \nmelting by geothermally-heated meltwater will strongly favour the establishment of \nlow-pressure conditions (Clarke, 1982). A vexed question is whether low-pressure \nconditions may develop in the vent area if a subglacial eruption occurs far from the \nglacier snout, since there is the problem of backfilling from regions of high subglacial \nwater pressure (Hooke, 1984). If so, pressure in cavities adjacent to such low-pressure \nconduits may be significantly less than glaciostatic. \nIt is not currently possible to estimate the magnitude of pressure gradients \nwithin the permeable substrate, due to uncertainties in the flow regime, hence no \ntemporal or spatial variations in cavity pressure will be considered. Furthermore, the \nposition of the water table during the eruption is unclear. Hence, for the purposes of \n 5 \nthe model, we assume that cavity pressure may vary between glaciostatic (c. 2-4 MPa) \nand atmospheric (0.1 MPa). \n \nDeformation of ice above subglacial cavities \nIf the pressure in a subglacial cavity is less than the glaciostatic pressure, the ice will \ndeform (e.g. Paterson, 1994). Ice deformation may be brittle or ductile, depending \nupon the strain rate, confining pressure and the ice structure (e.g. Jones, 1982; \nMizuno, 1998). Ductile deformation is best approximated by Glen's flow law (Glen, \n1955), in which \n \n \nwhere ε' is the shear strain rate, τ is the shear stress, n is a constant (~3) and A is \ndetermined by the properties of the ice. Nye (1953) showed that the roof of a \nhemispherical cavity of radius r beneath a glacier of thickness h will deform in a \nductile manner at a rate r'c given by the relation \n \nwhere effective pressure ∆P = glaciostatic pressure (Pi) – cavity pressure (Pc), n is \nGlen’s flow law constant, ~3, and B is an ice viscosity parameter. However, this \nrelation only applies when r << h. When the cavity size approaches that of the glacier \nthickness, high strain rates trigger brittle failure of the ice, as observed during the \n1996 Gjálp eruption (Guðmundson et al., 1997; Alsdorf & Smith, 1999). Since this \npaper considers cavities of radius <10 m beneath ice 100-1000 m in thickness, it is \nassumed that r << h, and ice deformation will thus be ductile and approximated by \nequation (2). Some justification for the assumption of ductile ice deformation comes \nfrom observations of the evolution of ice cauldrons above regions of geothermal \nmelting (MT Guðmundsson, personal communication). The ice surface is often \nsmooth and unfractured during the early stages of cauldron formation, indicating that \nductile deformation of the surface is occurring. The glacier base is likely to also \ndeform in a ductile manner at this stage, as ductile behaviour is favoured by a high \nconfining pressure (Jones, 1982). Cavity sizes during the initial stage of ice cauldron \ndevelopment may be similar to those considered in this paper. \n \nImplications for cavity evolution during subglacial eruptions \nAn important conclusion gained from Mount Rainier is that subglacial melting may be \nstrongly heterogeneous, and controlled by the distribution of heat at the glacier base. \nFurthermore, meltwater accumulation within subglacial cavities may be prevented if \nthe substrate is sufficiently permeable and the water table is below the glacier (firn) \nbase. Evolving subglacial cavities may attain an equilibrium size and shape, \ndetermined by the balance between inward creep deformation and melting. The rate of \nmelting is influenced by the mechanism of energy transfer from magma to ice (e.g. \nwater\/steam\/air\/ash slurry), which is in turn controlled by the subglacial hydrological \nsystem and eruption mechanisms. In order to reconstruct the melting processes that \noccurred during the subglacial volcanic eruption at Bláhnúkur, it is thus necessary to \nevaluate the field evidence for: \n(1) n\nxyxy Aτε ='\nn\nc\nnB\nP\nrr \n\n\n∆−=' (2) \n 6 \n1. Morphology and distribution of subglacial cavities \n2. Accumulation or drainage of meltwater  \n3. Mode of heat loss from magma (e.g. fragmentation, cooling and crystallisation) \n4. Presence of a vapour phase. \n \nField observations \n \nGeological setting of Bláhnúkur \n \nTorfajökull central volcano, the largest silicic centre in Iceland, is located in south-\ncentral Iceland at the southern terminus of the eastern rift zone (Fig. 2a). Torfajökull  \nhas erupted >250 km3 of mildly alkaline to peralkaline rhyolites over the last ~1 Ma \n(McGarvie, 1984). Eruptions during glacial and interglacial periods have produced a \nvariety of volcanic landforms (McGarvie, 1985). The youngest subglacial eruption at \nTorfajökull is thought to have occurred at Bláhnúkur, close to Landmannalaugar in \nthe north of the complex (Fig. 2a, 2b).  \nBláhnúkur is a 350 m-high conical edifice consisting of a veneer of subglacial \nrhyolite >50 m thick that overlies older, altered rhyolite and till. Ubiquitous evidence \nfor magma-water and magma-ice interaction suggests that the eruption was entirely \nsubglacial (Tuffen et al., 2001). Detailed descriptions of the lithofacies and eruption \nmechanisms are given elsewhere (Tuffen et al., 2001; Tuffen, 2001). We focus on the \nlava lobe lithofacies, which preserves strong evidence for unusual patterns of lava-ice \ninteraction. \n \nLava lobe lithofacies \nMuch of the subglacial sequence at Bláhnúkur consists of rhyolitic lava lobes set in \npoorly sorted breccias (Furnes et al., 1980, Tuffen et al., 2001), shown in Fig. 3a. \nLava lobes are conical to irregular in shape and vary between 5 and 20 m in length \n(Fig. 3a). They can be subdivided into flow lobes and feeder lobes (Tuffen et al., \n2001). Flow lobes are commonly cylindrical to prismatic in shape, with the long axis \naligned parallel to the modern day slope (Fig. 3b). They consist of a black obsidian \ncarapace 0.05-0.5 m thick that envelops a pale grey microcrystalline rhyolite interior. \nA banded zone up to 0.2 m thick at the obsidian-microcrystalline rhyolite contact \nconsists of sheared blebs of pale crystalline lava 0.01-0.1 m long enclosed within dark \ncrystal-poor obsidian.  \nThe obsidian carapace of the upper part of flow lobes is frequently cut by \npolygonal columnar joints 0.07-0.1 m apart, and normal to a steeply inclined near-\nplanar surface which dips approximately down the maximum modern day slope (Fig. \n3b). The orientation of fifty-eight of these near-planar surfaces were measured and are \nplotted in Fig. 4. The vast majority of columnar jointed surfaces dip at between 50 \nand 80° from the horizontal. Joints penetrate into the microcrystalline rhyolite core of \nmost flow lobes. The bases of flow lobes dip more gently downslope (typically 20-\n30°). Intact black obsidian at the bases of these flow lobes grades downward into \ngrey, highly fractured, perlitised obsidian, which becomes increasingly fragmented \nand grades into massive, poorly sorted breccia. Columnar joints are absent.  \nThe breccia consists of 0.5-30 cm wide angular clasts of pale grey perlitised \nobsidian in an ash matrix (Tuffen et al., 2001). Ash shards are typically 10-100 µm in \ndiameter, glassy, and have blocky-to-cuspate morphologies (Fig. 3c). The breccia is \ncut by an anastamosing network of veins 5-30 mm wide and up to 10 m in length (Fig.   \n3d). These are entirely filled by ash, which contains spherical to elongate vesicles up \n 7 \nto 20 mm in length (Tuffen et al., 2001). Veins terminate at the intact obsidian of the \nlower margin of flow lobes. Vesicularity varies from <5% in the microcrystalline \nrhyolite core to 15-40% in the perlitised lower carapace and breccias.  \nFeeder lobes are irregular to sheet-like, oriented roughly perpendicular to flow \nlobes, and typically 5-20 m across. Where exposed, feeder lobes are seen to be linked \nto one or more flow lobes (Fig. 3e). Feeder lobes have hackly jointed, \nmicrocrystalline cores and 0.1-0.5 m thick obsidian margins, which grade outwards \ninto the massive breccias described above. The banded obsidian-microcrystalline \ntransition zone common in flow lobes is absent. Vesicularity is generally less than \n5%. \n \nInterpretation \nThe orientation of columnar joints in lavas indicates the direction of heat loss during \ncooling (DeGraff et al., 1989). The upper carapaces of flow lobes thus appear to have \nchilled against steeply inclined, near-planar surfaces. Our interpretation is that the \nflow lobes were emplaced at the base of a glacier, where they flowed and chilled \nagainst the walls of cavities melted into the basal ice (c.f. Furnes et al., 1980). Similar \nrhyolitic lava lobes within a submarine volcanic succession lack columnar joints \n(Yamagishi & Dimroth, 1985). There is strong corroborative evidence for a subglacial \neruptive setting, such as the presence of facetted clasts within diamicton in the \nvolcanic sequence at Bláhnúkur (Tuffen et al., 2001). Similar columnar-jointed lava \nflows elsewhere are interpreted as an ice-contact feature (Lescinsky & Sisson, 1998). \nThe position of flow lobes suggests that the subglacial cavities were randomly \ndistributed. The consistently steep orientation of a number of inferred cavity walls \nsuggests a common melting mechanism.  \nMeanwhile, flow lobe bases share many features with shallow-level peperitic \nintrusions (e.g. Hunns & McPhie, 1999). Perlitisation, blocky ash shards and matrix \nvesicles are all evidence for magma\/water interaction (Lorenz, 1974; Heiken & \nWohletz, 1985; Hunns & McPhie, 1999). We therefore infer that lobes rose towards \nthe glacier base within poorly-consolidated, water-bearing (and possibly water-\nsaturated) breccias. Flow lobes reached the glacier base and show ice-contact features, \nwhereas feeder lobes solidified within the breccia. The fate of meltwater released \nduring the melting of subglacial cavities is likely to have been controlled by the local \npressure patterns. The cavity may have filled up with meltwater until the cavity \npressure exceeded the pore pressure in the underlying breccia, whereupon meltwater \nwas expelled by porous flow (Dullien, 1992). A steam-filled cavity may develop if the \ncavity pressure is low and the meltwater can be heated sufficiently rapidly. Steam-\nfilled cavities would be most likely to develop under thin glaciers (≤ 100 m), but the \npresence of steam in cavities beneath much thicker ice cannot be ruled out until the \nthermodynamics of energy exchange are better constrained. \nThe poorly sorted breccias lack evidence for aqueous reworking, supporting \nthe view that standing bodies of meltwater did not accumulate in cavities. Instead, \ncavities were probably filled with either convecting meltwater or steam. This may \nexplain the steepness of the inferred ice walls, since a cavity only partially filled with \nmeltwater is expected to develop a broad, low shape (Hoskuldsson & Sparks, 1997; \nCutler, 1998). Cavity morphology may also be influenced by the patterns of \nconvection within the meltwater or steam. Steam-filled cavities (steam cups) on \nMount Rainier have smooth, steeply inclined walls (Kiver & Steele, 1975). The \norientation of ice walls may have been controlled by the angle at which meltwater \nceased to run down the wall and began to drip off. \n 8 \nAsh-filled veins are interpreted as vapour-escape pipes, which formed during \nbrittle failure of poorly consolidated breccia. Veins were filled by the ash matrix of \nthe breccia, which was remobilized by rising steam. Vapour escape was probably \naccompanied by the development of numerous fumaroles, as observed in ignimbrites \n(Sheridan, 1970). The position of fumaroles would have been highly localised, being \nconcentrated close to the heat source (an individual magma body). We propose that \ncavities may have melted in the ice above a rising magma body during the last ~10 \nmetres of its ascent to the glacier base. Rapid, focussed transfer of heat from magma \nto ice by convecting steam within vapour-escape pipes facilitated melting ahead of the \nadvancing magma (Fig. 5). Cavities acted as moulds for the advancing magma, which \nflowed and chilled against the ice walls. The ability of ice to deflect moving lava \nflows has been observed during a basaltic eruption in Alaska (Vinogradov & \nMurav'ev, 1988).  \n \nModel for melting of basal ice during lava lobe emplacement  \nIn order to test the viability of our interpretations, we present a simple heat transfer \nmodel, which predicts the evolution of subglacial cavities during the emplacement of \nlava lobes. The model is constructed to be consistent with all the field evidence \ngathered from the lava lobe lithofacies. The symbols and constants used are listed in \nTable 1. \n \nAssumptions \n1. Ice is incompressible and deforms in accordance with Glen's law  \n2. Ice is at 0 °C \n3. Rising magma loses heat through conduction, aided by the formation of joints \n4. Convecting steam carries this heat to the glacier base in vapour-escape pipes \n5. Vapour-escape pipes develop during the final 10 m of magma ascent to the glacier \nbase, and localised melting of ice occurs, forming subglacial cavities \n6. Cavities have attained approximate size equilibrium when they are entered by lava \nbodies \n7. Meltwater may flow into the permeable substrate - with flow governed by local \npressure patterns, which are determined by the position of the groundwater table \nand the proximity of low-pressure meltwater conduits. \n8. Cavity pressure may be less than or equal to glaciostatic pressure, and possibly as \nlow as atmospheric pressure \n9. All of the thermal energy of heated meltwater is transferred to the ice (i.e. \nmeltwater leaves the system at 0 °C) \n10. The ice roof does not thin significantly during basal melting, hence glaciostatic \npressure is constant. \n \nFormulation of the model \n \n1. Heat flux from cooling body of magma \nIn order to simulate the rise of lava lobes to the glacier base, we consider the rise of a \ncylindrical magma body of radius R with a hemispherical upper surface towards \nisothermal ice at 0 °C  (Fig. 5). In order to simplify calculations, the magma body is \nassumed to be isothermal (Tm = 850 °C) and loses heat by conductive cooling from \nthe hemispherical upper portion (Fig. 5). An isothermal magma body is deemed \nappropriate because it is likely to have lost only a fraction of its heat on the timescales \nconsidered (see later in text). Furthermore, the magma temperature is likely to have \n 9 \nbeen buffered by latent heat released during microlite crystallisation, which can be \nshown texturally to have occurred during lobe emplacement (Tuffen, 2001). \nThe conductive heat flux Qh from an isothermal hemispherical magma body is given \nby \n         \n \nwhere S is a shape term, kl is the thermal conductivity of magma, and ∆T is the \ntemperature difference between the magma and surrounding breccia (Holman, 1997). \nEstimating the effective ∆T is not straightforward. We assume that the breccia was \nmaintained close to 100 °C, the temperature of steam at atmospheric pressure, \nbecause of the field evidence for steam fluxing through the breccia. Field observations \nsuggest that the magma body developed a fractured, chilled rind during its ascent and \nemplacement. The effect of this rind on the conductive heat flux is twofold:- its lower \ntemperature will reduce the temperature contrast between the magma and the breccia \n(∆T), but fracturing will increase the surface area available for energy exchange, \nhence increasing S. The relative magnitudes of these two effects can be estimated:-  \na) Chilled rind \nWe assume that the fractures in the obsidian rind propagated inwards as far as magma \nat the glass transition temperature Tg (~400 °C, Stevenson et al., 1995), and the \noutermost portion of the rind was in thermal equilibrium with the surrounding breccia \n(T = 100 °C, Fig. 6). Assuming a linear temperature gradient within the obsidian, the \naverage temperature of the fractured obsidian surfaces is therefore roughly (400 °C + \n100 °C ) \/ 2 = 250 °C. Hence ∆T, the temperature difference between the obsidian \nrind and the surrounding breccia, is 150 °C. Without a chilled rind, ∆T is 750 °C. \nSince the conductive heat output Qh is proportional to ∆T, the presence of a chilled \nrind reduces Qh by a factor of about 5. \nb) Fractured rind \nIn accordance with field observations, we assume that fractures propagated a distance \nzj = 0.1 m into the obsidian rind, and were spaced a distance wj = 0.1 m apart (Fig. 6). \nThe number of regular hexagonal columns of side length wj on a hemispherical \nsurface, N, is given by hemisphere surface area \/ column surface area  \n \n         \n2\/33\n2\n2\n2\njw\nR\nN\npi\n=  \n \nwhere R is the hemisphere radius. The total surface area of each column is thus  \n \n \n2\/336 2jjjcolumn wwzA +=  \n \n   \nand the total surface area of the fractured hemisphere \n \n[ ] .\n3\n4\n122\/336\n2\/33\n2 22\n2\n2\n\n\n\n\n\n\n\n\n+=+=\nj\nj\njjj\nj\nf\nw\nz\nRwwz\nw\nR\nA pi\npi\n \n,TSkQ lh ∆= (3) \n(4) \n \n(5) \n \n(6) \n \n 10 \n \nTherefore, as \n \n \n \n \n  \n \n3.3\n3\n4\n1\n0\n=+=\nj\njf\nw\nz\nA\nA\n \n \n \nwhere zj = wj = 0.1 m, fracturing of the obsidian rind is expected to increase the \nconductive heat flux by a factor of 3.3.  \nCombining the two effects, rind cooling and fracturing will reduce the heat \nflux by a factor of 5\/3.3 = 1.5. Many parameters in the heat flux model have been \nonly roughly estimated, hence we assume that the effects approximately cancel out, \nand ignore the chilled rind in our heat flux calculations. Instead, we consider the \nconductive cooling of an isothermal magma body at 850 °C, with ∆Teff = Tmagma – \nTsteam ≈ 750 °C. The conductive heat flux Qh from a hemisphere with radius R = 2.5 m \nis thus ~ 0.15 MW. \n  \n2. Energy transfer from lava to ice \nThe presence of vapour-escape pipes within the lava lobe lithofacies at Bláhnúkur \nsuggests active and locally focussed steam flux through the breccia during lava \nemplacement (Tuffen et al., 2001). We interpret that conductive heat released from \nmagma generated a steam envelope in the adjacent breccias, and that the steam \nformed travelled within vapour-escape pipes to the base of the glacier. From the \nlength of vapour-escape pipes observed at Bláhnúkur, we expect that this process \nbegan to operate efficiently once the magma bodies had risen to within 10 metres of \nthe glacier base, and that heat was then transferred almost instantaneously from the \nmagma to the overlying ice. The fraction of released heat that causes melting of ice, \nEh, is given by Eh = Qm \/ Qh. Eh is thus assume to be 0 at z > 10m (no heat reaches the \nglacier base) to 1 at z ≤ 10 m (all the heat reaches the glacier base). \n \n3. Magma ascent rate  \nIt is necessary to estimate the ascent rate of magma bodies. Since the magma is denser \nthan the surrounding breccia, its rise must be triggered by a connection to an \nunderlying over-pressured magma chamber. A lower limit on the magma rise rate can \nbe obtained by considering the dimensions of lava lobes. Lobes are typically 100 m3 \nin volume. The length of feeder lobes suggests that magma bodies have risen ~10 m \nthrough breccia to the glacier base. The minimum ascent rate Vl min is thus the distance \ntravelled\/cooling time. Taking 105-106 s as a reasonable cooling time (c.f. \nHoskuldsson & Sparks, 1997), we acquire Vl min = 10\n-4-10-5 m s-1.  \n \n4. Rate and distribution of ice melting \nAs discussed above, we anticipate that heat from the rising lava lobes will be carried \nby convecting steam to the glacier base. If all the thermal energy of the magma is \nused to melt ice, the volume of ice melted per second a is given by \n(7) \n \n 11 \n \n,\nii\nm\nL\nQ\na\nρ\n=  \n \n \n \nwhere Li is the heat of fusion of ice. The mean meltback rate of the ice walls  \n \n \nAar m \/' =  \n \n                   \nwhere A is the ice wall area. For simplicity, we assume that the ice cavity is \nhemispherical, thus for a cavity of radius r, \n \n.2 2rA pi=  \n \nHence the melting rate is proportional to the inverse square of the cavity radius \n \n.\n22\n'\n22\nii\nm\nm\nLr\nQ\nr\na\nr\nρpipi\n==  \n \n5. Cavity closure by ice deformation \nIf glaciostatic pressure exceeds cavity pressure, the cavity walls are likely to close by \nvisco-plastic deformation (Nye 1953), as discussed earlier. The deformation rate r'c is \ngiven by the relation \n \nn\nc\nnB\nP\nrr \n\n\n∆−='  \n \n(Nye, 1953) where effective pressure ∆P = glaciostatic pressure (Pi) – cavity pressure \n(Pc), n is Glen’s flow law constant, ~3 (Glen, 1955) and B is an ice viscosity \nparameter.  \nAn equilibrium radius can be thus be calculated, at which the melting and closure \nrates are equal and opposite. This is obtained by combining equations (11) and (12): \n \n3\/1\n32\n)(\n\n\n\n\n\n\n\n\n∆\n=\nii\nn\nm\neq\nLP\nnBQ\nr\nρpi\n \n \nwhich reduces to \n \n3\/1\n3 \n\n\n\n∆\n=\nP\nCQ\nr meq  \n \nwhere C is a constant, of value (nB)n \/2pi Li ρi  = 2.1×1015 J kg-3 s5, where n = 3. The \nequilibrium cavity radius is thus weakly dependent on the basal heat input and \n(8) \n \n(9) \n \n(10) \n \n(11) \n \n(12) \n \n(13) \n \n(14) \n \n 12 \ninversely proportional to the effective pressure. The summit firn caves of Mount \nRainier appear to be close to equilibrium, and r'c is estimated at 10\n-7 m s-1 from \nmeasurements of the ablation rate (Kiver & Steele, 1975). Deformation rates of \nglacier ice at Bláhnúkur are likely to have been orders of magnitude higher, since the \neffective pressures were probably greater and ice deforms more readily than firn \n(Paterson, 1994). \n \n6. Equilibrium cavity radii \nFig. 7a shows equilibrium cavity radii as a function of effective pressure and the \nradius of spherical lava bodies at ∆T.= 750 °C. Equilibrium radii are weakly \nproportional to lava body size, but strongly influenced by the effective pressure. For a \nrange of magma sphere sizes consistent with the volume of Bláhnúkur feeder lobes \n(1.5-4 m), equilibrium cavity radii of 2-4 m, inferred from flow lobes, require \neffective pressures of 2-4 MPa. The equilibrium cavity radius is only weakly \nproportional to the lava-breccia temperature contrast ∆T (Fig. 7b). Cavity sizes \napplicable to Bláhnúkur develop at effective pressures of 2-4 MPa for all reasonable \nvalues of ∆T. \n \n7. Timescales of cavity enlargement and lava rise \nThe rate of change of the cavity radius is obtained by combining equations (11) and \n(12): \n \n,\n2\n''\n2\nn\nii\nm\ncm\nnB\nP\nR\nLR\nQ\nrr\ndt\ndR\n\n\n\n∆−=−=\nρpi\n \n \nwhich is a second order differential equation of the form \n \n0\n2\n=+− NR\nR\nM\ndt\ndR\n \n \nwhere M is a melting term of value Qm\/2piLiρi and N is a deformation term of value  \n[∆P\/nB]n. Thus the cavity radius at time t, Rt is given by \n \n \nand R0 is assumed to be zero. Analytical solutions of (17) indicate that approximate \nequilibrium is attained within 5 × 105 s (Fig. 7c). This results is in accordance with the \nresponse time of subglacial cavities to changes in meltwater flux obtained by finite \nelement modelling (Cutler, 1998). Assuming that magma bodies rise at a velocity of \n10-4 m s-1, melting will occur during the 105 s that a magma body takes to rise the \nfinal 10 metres to the glacier base, and the lava lobe will then enter the cavity. At 105 \ns, the rate of wall recession (dR\/dt) has fallen to <10-5 m s-1 (Fig. 7c), which is an \norder of magnitude slower than the lava lobe advance rate. Ice walls with thus be \neffectively stationary when flow lobes enter cavities, and advancing lavas will be \nmoulded and chilled against the ice. It is assumed that the melting rate will not greatly \n∫+=\nt\nt dt\ndt\ndR\nRR\n0\n0\n(15) \n \n(16) \n \n(17) \n \n 13 \nincrease once the lava has enter the cavity, and that the lava will solidify against the \nnear-stationary ice wall (Vinogradov & Murav'ev, 1988; Lescinsky & Sisson, 1998). \n \n8. Application to Bláhnúkur lava lobe lithofacies \nThe formation of steep-walled steam- or water-filled subglacial cavities is consistent \nwith many features of the lava lobe lithofacies, including lobe morphologies, joint \npatterns, magma-water interaction at lobe bases, and the presence of vapour-escape \npipes. We suggest that lobes were emplaced within cavities with an effective pressure \nin the range 2-4 MPa. This may correspond to a cavity at atmospheric pressure \nbeneath ice 200-400 m thick. If the cavity pressure were much greater than \natmospheric, this may imply that the ice was considerably thicker. Thus the model \npredicts that the cavity pressure was significantly less than glaciostatic, possibly \ncaused by the high permeability of the substrate, and the steep slope of the glacier \nbase, which may favour the development of low-pressure meltwater conduits (Hooke, \n1984). The palaeo-ice thickness has been independently estimated at >350 m from the \nvolcanic stratigraphy (Tuffen et al., 2001). An obvious problem is that there is no \nclear relationship between the stratigraphic position (elevation) of lava lobes at \nBláhnúkur and their size, which the model predicts. More detailed measurements of \nice-contact lobes at Bláhnúkur are necessary to test this relationship. Analyses of the \nvolatile contents and vesicle populations of Bláhnúkur lobes would provide \ninformation on the degassing patterns within lobes, and may help to constrain the \npressure of emplacement, and possibly the position of the groundwater table during \nthe eruption. \nA cavity system of this nature is likely to be peculiar to effusive subglacial \neruptions with a low magma flux, which favours the slow rise of intrusive magma \nbodies within permeable ‘hyaloclastite’ breccias. Drained cavities could only develop \nduring a basaltic eruption if meltwater were heated significantly above 0 °C \n(Björnsson, 1988; Hoskuldsson & Sparks, 1997). This is due to ice deformation above \nthe region of melting, which forms a ‘potential trap’ and prevents the escape of \nmeltwater. Such hindered drainage is not thought to apply to subglacial rhyolite \neruptions, because of positive pressure changes (Hoskuldsson & Sparks, 1997). This \nmay explain the lack of evidence for meltwater accumulation within subglacial \nrhyolite sequences (Tuffen, 2001). Similar melting patterns may occur during \nquiescent degassing at other volcanoes, as observed at Mount Rainier, and may \nprecede many subglacial eruptions. Extremely rapid melting may occur at high \neruption rates, as heat is rapidly transferred from lava to ice via mechanisms such as \nexplosive magma-water interaction (Guðmundsson et al., 1997). The isolated cavity \nsystem may be quickly overwhelmed, and much larger ice vaults formed (Tuffen, \n2001). \n \nImplications of localised melting during subglacial eruptions \nLocalised melting during a subglacial eruption may create heterogeneous pressures at \nthe glacier base, varying from atmospheric pressure within cavities to glaciostatic \npressure (~MPa) elsewhere. Magma may rise preferentially towards low-pressure \ndomains, and therefore become focussed in regions of high heat output, such as a \ncaldera wall or crater rim. A prolonged period of high heat flux would favour the \ndevelopment of low-pressure domains. This is a possible explanation for the evolution \nof subglacial ‘constructional caldera’ complexes such as Askja (Brown et al., 1990) \nand Sollipulli (Gilbert et al., 1996), at which caldera walls are built up by a ring of \nsubglacial domes.  \n 14 \nMagma may be extremely rapidly decompressed if it enters a low-pressure \ncavity, with a pressure drop of several MPa possible over a timescale of seconds. This \nmay lead to non-equilibrium degassing and unusual fragmentation patterns. Cavity \npressures may increase suddenly if they become filled with tephra, with the potential \nfor volatile resorption and rewelding of pyroclasts. To date, one locality has been \ndiscovered at Torfajökull at which it appears that an explosive eruption has entered a \nlow-pressure subglacial cavity (Tuffen 2001).  \n \nConclusions \nRhyolitic lava lobe lithofacies at Bláhnúkur display evidence for lava\/ice interaction. \nLobes are inferred to have been emplaced within steep-sided, steam-filled cavities \nmelted into the basal ice. A simplified model shows that a cavity may be melted in the \noverlying ice during the ascent of a magma body to the glacier base. The model \nsuggests that the cavities at Bláhnúkur formed beneath ice 200-400 thick, in \naccordance with field observations. Heterogeneous melting patterns during a \nsubglacial eruption may influence the trajectory of rising magma and the resultant \nvolcanic landforms. \n \nAcknowledgements \nWe thank G. Finnsdottír, B. Sigmarsdottír, F. Eíriksson and D. Samuelsson of Ferðafelag Íslands for \ntheir help and hospitality during fieldwork. Thanks to M. T. Guðmundsson and A. Hoskuldsson for \nthorough reviews which greatly improved the manuscript. The assistance of N. M. Williams with the \nelectron microscope was much appreciated. H. T. was supported by an Open University research \nstudentship. H. P. and J. S. G.'s fieldwork was supported by a Lancaster University travel grant. D. \nMcG.'s fieldwork was supported by an Open University research grant. \n \nReferences \n \nAllen, C.C., 1980. Icelandic subglacial volcanism: thermal and physical studies. J. Geol. 88, 108-117. \n \nAlsdorf, D.E., Smith, L.C., 1999. Interferometric SAR observations of ice topography and velocity \nchanges related to the 1996, Gjálp subglacial eruption, Iceland. Int. J. Rem. Sens. 20, 3031-\n3050. \n \nAscolese, E., Aurisicchio, A., Briggssmith, M., Mita, D.G., Perna, G., Rossi, S., Gaeta, F.S., 1993.  \nThermodynamics of water-permeated unwelded pyroclasts.1. Equilibrium properties.  \nJ. Volcanol. Geotherm. Res. 57, 219-233. \n \nBrown, G.C., Everett, S.P., Rymer, H., McGarvie, D.W., Foster. I., 1991. New light on caldera  \nevolution: Askja, Iceland. Geology 19, 352-355. \n \nBjörnsson, H., 1988. Hydrology of ice caps in volcanic regions. Soc. Sci. Isl. Rit. 45, 1-129. \n \nChapman, M.G., Allen, C.C., Guðmundsson, M.T., Gulick, V.C., Jakobsson, S.P., Lucchita, B.K.,  \nSkilling, S.P., Waitt, R.B., 2000. Volcanism and ice interactions on Earth and Mars. In: \nZimbelman,  J.R., Gregg, T.K.P (Eds.), Environmental effects on volcanic eruptions, pp. 39-\n73. \n \nClarke, G.K.C, 1982. Glacier outburst floods from Hazard Lake, Yukon Territory, and the problem of  \nflood magnitude prediction. J. Glaciol. 28, 3-21. \n \nCutler, P.M., 1998. Modelling the evolution of subglacial tunnels due to varying water input.  \nJ. Glaciol. 44, 485-497.  \n \nDeGraff, J.M., Long, P.E., Aydin, A., 1989. Use of joint-growth directions and rock textures to infer  \n 15 \nthermal regimes during solidification of basaltic lava flows. J. Volcanol. Geotherm. Res. 38, \n309-324. \n \nDullien, F.A.L. (1992) Porous media: fluid transport and pore structure (2nd ed.). Academic Press,  \n574pp. \n \nFountain, A.G., Walder, J.S., 1998. Water flow through temperate glaciers. Rev. Geophys. 36, 299- \n328. \n \nFurnes, H., Fridleifsson, I.B., Atkins, F.B., 1980. Subglacial volcanics - on the formation  \nof acid hyaloclastites. J. Volcanol. Geotherm. Res. 8, 95-110. \n \nGilbert, J.S., Stasiuk, M.V., Lane, S.J., Adam, C.R., Murphy, M.D., Sparks, R.S.J., Naranjo, J.A.,  \n1996. Non-explosive, constructional evolution of the ice-filled caldera at Volcan Sollipulli, \nChile. Bull.Volcanol. 58, 67-83. \n \nGlen, J.W., 1955. The creep of polycrystalline ice. Proc. R. Soc. Lond. Series A 228, 519-538. \n \nGuðmundsson, M.T., Sigmundsson, F., Björnsson, H., 1997. Ice-volcano interaction of the 1996 Gjálp  \nsubglacial eruption, Vatnajökull, Iceland. Nature 389, 954-957. \n \nHeiken, G., Wohletz, K., 1985. Volcanic ash. University of California Press, Berkeley, 246 pp. \n \nHolman, J.P., 1997. Heat Transfer (8th ed.) McGraw-Hill, 696 pp. \n \nHooke, R.L., 1984. On the role of mechanical energy in maintaining subglacial water  \nconduits at atmospheric pressure. J. Glaciol. 30, 180-187.  \n \nHooke, R.L., Laumann, T., Kohler, J., 1990. Subglacial water pressures and the shape of subglacial  \nconduits. J. Glaciol. 36, 67-71. \n  \nHoskuldsson, A., Sparks, R.S.J., 1997. Thermodynamics and fluid dynamics of effusive  \nsubglacial eruptions. Bull. Volcanol. 59, 219-230. \n \nHunns, S.R., McPhie, J., 1999. Pumiceous peperite in a submarine volcanic succession at Mount  \nChalmers, Queensland, Australia. J. Volcanol. Geotherm. Res. 88, 239-254. \n \nJones, S.J., 1982. The confined compressive strength of polycrystalline ice. J. Glaciol. 28, 171-177. \n \nJónsson, S., Adam, N., Björnsson, H., 1998. Effects of subglacial geothermal activity observed by  \nsatellite radar interferometry. Geophys. Res. Lett. 25, 1059-1062. \n \nKiver, E.P., Mumma, M.D., 1971. Summit firn caves, Mount Rainier, Washington. Science 173, 320- \n322. \n \nKiver, E.P., Steele, W.K., 1975. Firn caves in the volcanic craters of Mount Rainier, Washington. Nat.  \nSpel. Soc. Bull. 37, 45-55. \n \nLescinsky, D.T., Sisson, T.W., 1998. Ridge-forming, ice-bounded lava flows at Mount Rainier,  \nWashington. Geology 26, 351-354. \n \nLescinsky, D.T., Fink, J.H., 2000. Lava and ice interaction at stratovolcanoes: use of characteristic  \nfeatures to determine past glacial extents and future volcanic hazards. J. Geophys. Res. 105, \n23711-23726. \n \nLorenz, V., 1974. Vesiculated tuff and associated features. Sedimentology 21, 273-291. \n \nMcGarvie, D.W., 1984. Torfajökull - a volcano dominated by magma mixing. Geology  \n12, 685-688. \n \n 16 \nMcGarvie, D.W., 1985. Volcanology and petrology of mixed magmas and rhyolites from the  \nTorfajökull volcano, Iceland. Unpublished PhD thesis, University of Lancaster, UK. \n \nMajor, J.J., Newhall, C.G., 1989. Snow and ice perturbation during historical volcanic eruptions and  \nthe formation of lahars and floods. Bull. Volcanol. 52, 1-27.  \n \nManley, C.R., 1992. Extended cooling and viscous flow of large, hot rhyolite lavas: implications of  \nnumerical modelling results. J. Volcanol. Geotherm. Res. 53, 27-46. \n \nMizuno, Y., 1998. Effect of hydrostatic confining pressure on the failure mode and compressive  \nstrength of polycrystalline ice. J. Phys. Chem. B 102, 376-381. \n \nNye, J.F., 1953. The flow law of ice from measurements in glacier tunnels, laboratory experiments and  \nthe Jungfraufirn borehole experiment. Proc. R. Soc. Lond. Series A 219, 477-489. \n \nPaterson, W.S.B., 1994. The physics of glaciers (3rd ed). Pergamon, 480pp. \n \nSheridan, M.F., 1970. Fumarolic mounds and ridges of the Bishop Tuff, California. Geol. Soc. Am.  \nBull. 81, 851-868. \n \nSkilling, I.P., 1994. Evolution of an englacial volcano - Brown Bluff, Antarctica. Bull. Volcanol. 56,  \n573-591. \n \nSmellie, J.L., Skilling, I.P., 1994. Products of subglacial volcanic eruptions under different ice  \nthicknesses - two examples from Antarctica. Sed. Geol. 91, 115-129. \n \nSmellie, J.L., 1999. Subglacial eruptions. In: Encyclopaedia of Volcanoes, (Ed. by H. Sigurdsson),  \nAcademic Press, San Diego, pp. 403-418.  \n \nStevenson, R.J., Dingwell, D.B., Webb, S.L., Bagdassarov, N.S., 1995. The equivalence of enthalpy  \nand shear stress relaxation in rhyolitic obsidians and quantification of the liquid-glass \ntransition in volcanic processes. J. Volcanol. Geotherm. Res. 68, 297-306. \n \nTuffen, H., 2001. Subglacial rhyolite volcanism at Torfajökull, Iceland. Unpublished PhD thesis, Open  \nUniversity, UK. \n \nTuffen, H., Gilbert, J.S., McGarvie, D.W., 2001. Products of an effusive subglacial rhyolite eruption:  \nBláhnúkur, Torfajökull, Iceland. Bull. Volcanol., in press. \n \nVinogradov, V.N., Murav'ev, Y.D., 1988. Lava-ice interaction during the 1983  \nKlyuchevskoi eruption. Volcanology and Seismology 7, 39-61. \n \nWerner, R., Schmincke, H.U., Sigvaldason, G., 1996. A new model for the evolution of table  \nmountains: volcanological and petrological evidence from Herðubreið and Herðubreiðartogl \nvolcanoes (Iceland). Geol. Rundschau. 85, 390-397. \n \nYamagishi, H., Dimroth, E., 1985. A comparison of Miocene and Archean rhyolite  \nhyaloclastites - evidence for a hot and fluid rhyolite lava. J. Volcanol. Geotherm. Res. 23, \n337-355.  \n \nZimbelman, D.R., Rye, R.O., Landis, G.P., 2000. Fumaroles in ice caves on the summit of Mount  \nRainier - preliminary stable isotope, gas, and geochemical studies. J. Volcanol. Geotherm. \nRes. 97, 457-473. \n \n \n"}