{"doi":"10.1111\/1467-6486.00374","coreId":"135849","oai":"oai:bradscholars.brad.ac.uk:10454\/3852","identifiers":["oai:bradscholars.brad.ac.uk:10454\/3852","10.1111\/1467-6486.00374"],"title":"Invoking Satan or the ethics of the employment contract.","authors":["Ford, Jackie M.","Harding, Nancy H."],"enrichments":{"references":[],"documentType":{"type":null}},"contributors":[],"datePublished":"2003","abstract":"NoStudies of mergers of organizations focus upon the financial and economic outcomes, with little attention paid to the effect on the people working in the merging organizations. This paper reports the findings of a study of the impact on managers of an organizational merger. Rather than the cool calculations of accountants and economists and the rational application of a managerial logic, we found the impact on these managers was upon their emotions, which seemed sometimes too buffeted to allow them to continue in their work. A narrative analysis of the stories told by these managers suggested they experienced their involvement with the merging organizations as akin to a Faustian contract, whereby they had sold their souls to the organizational devil and were now reaping the costs. When we came to write this paper we found that using the usual rubrics of academic writing suppressed the sheer emotionality of their experiences. We have therefore followed the imperative of our conclusions, and written our analysis in the form of a play, based upon Christopher Marlowe's Dr Faustus, which allows us to use our interviewees' own words to illustrate the impact of the merger. The play is, of course, in the format of a tragedy: it has four main characters ¿ the narrator, the manager, Faustus and Mephistopheles ¿ and five acts. We use the Prologue to insert our own words, where we argue for a turn away from the 'hard' school of human resource management towards one that is ethically informed. Programme notes contain the technical details which justify our research methods. We remain totally unapologetic for intruding emotions into the rational world of academia","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:bradscholars.brad.ac.uk:10454\/3852<\/identifier><datestamp>\n                2016-07-25T17:12:04Z<\/datestamp><setSpec>\n                com_10454_232<\/setSpec><setSpec>\n                col_10454_6344<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nInvoking Satan or the ethics of the employment contract.<\/dc:title><dc:creator>\nFord, Jackie M.<\/dc:creator><dc:creator>\nHarding, Nancy H.<\/dc:creator><dc:subject>\nEmployment contracts<\/dc:subject><dc:subject>\nOrganizations<\/dc:subject><dc:subject>\nMergers<\/dc:subject><dc:subject>\nEffects on staff<\/dc:subject><dc:subject>\nOrganizational mergers<\/dc:subject><dc:description>\nNo<\/dc:description><dc:description>\nStudies of mergers of organizations focus upon the financial and economic outcomes, with little attention paid to the effect on the people working in the merging organizations. This paper reports the findings of a study of the impact on managers of an organizational merger. Rather than the cool calculations of accountants and economists and the rational application of a managerial logic, we found the impact on these managers was upon their emotions, which seemed sometimes too buffeted to allow them to continue in their work. A narrative analysis of the stories told by these managers suggested they experienced their involvement with the merging organizations as akin to a Faustian contract, whereby they had sold their souls to the organizational devil and were now reaping the costs. When we came to write this paper we found that using the usual rubrics of academic writing suppressed the sheer emotionality of their experiences. We have therefore followed the imperative of our conclusions, and written our analysis in the form of a play, based upon Christopher Marlowe's Dr Faustus, which allows us to use our interviewees' own words to illustrate the impact of the merger. The play is, of course, in the format of a tragedy: it has four main characters ¿ the narrator, the manager, Faustus and Mephistopheles ¿ and five acts. We use the Prologue to insert our own words, where we argue for a turn away from the 'hard' school of human resource management towards one that is ethically informed. Programme notes contain the technical details which justify our research methods. We remain totally unapologetic for intruding emotions into the rational world of academia.<\/dc:description><dc:date>\n2009-11-09T08:27:07Z<\/dc:date><dc:date>\n2009-11-09T08:27:07Z<\/dc:date><dc:date>\n2003<\/dc:date><dc:type>\nArticle<\/dc:type><dc:type>\nNo full-text available in the repository<\/dc:type><dc:identifier>\nFord, J.M. and Harding, N.H. (2003).  Invoking Satan or the ethics of the employment contract.  Journal of Management Studies. Vol. 40, No. 5, pp. 1131-1150.<\/dc:identifier><dc:identifier>\n90017716<\/dc:identifier><dc:identifier>\n90016613<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/10454\/3852<\/dc:identifier><dc:language>\nen<\/dc:language><dc:relation>\nhttp:\/\/dx.doi.org\/10.1111\/1467-6486.00374<\/dc:relation>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1111\/1467-6486.00374"],"year":2003,"topics":["Employment contracts","Organizations","Mergers","Effects on staff","Organizational mergers"],"subject":["Article","No full-text available in the repository"],"fullText":null}