{"doi":"10.1016\/j.watres.2010.05.015","coreId":"139809","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/4771","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/4771","10.1016\/j.watres.2010.05.015"],"title":"Model-based energy optimisation of a small-scale decentralised membrane bioreactor for urban reuse","authors":["Verrecht, Bart","Maere, Thomas","Benedetti, Lorenzo","Nopens, Ingmar","Judd, Simon J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-07","abstract":"The energy consumption of a small-scale membrane bioreactor, treating high strength domestic wastewater for community level wastewater recycling, has been optimised using a dynamic model of the plant. ASM2d was chosen as biological process model to account for the presence of phosphate accumulating organisms. A tracer test was carried out to determine the hydraulic behaviour of the plant. To realistically simulate the aeration demand, a dedicated aeration model was used incorporating the dependency of the oxygen transfer on the mixed liquor concentration and allowing differentiation between coarse and fine bubble aeration, both typically present in MBRs. A steady state and dynamic calibration was performed, and the calibrated model was able to predict effluent nutrient concentrations and MLSS concentrations accurately. A scenario analysis (SCA) was carried out using the calibrated model to simulate the effect of varying SRT, recirculation ratio and DO set point on effluent quality, MLSS concentrations and aeration demand. Linking the model output with empirically derived correlations for energy consumption allowed an accurate prediction of the energy consumption. The SCA results showed that decreasing membrane aeration and SRT were most beneficial towards total energy consumption, while increasing the recirculation flow led to improved TN removal but at the same time also deterioration in TP removal. A validation of the model was performed by effectively applying better operational parameters to the plant. This resulted in a reduction in energy consumption by 23% without compromising effluent quality, as was accurately predicted by the model. This modelling approach thus allows the operating envelope to be reliably identified for meeting criteria based on energy demand and specific water quality determinants","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139809.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.watres.2010.05.015","pdfHashValue":"011de69b40aeb1012e78c4df069ca849cd6692db","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/4771<\/identifier><datestamp>2011-01-27T11:55:32Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Model-based energy optimisation of a small-scale decentralised membrane bioreactor for urban reuse<\/dc:title><dc:creator>Verrecht, Bart<\/dc:creator><dc:creator>Maere, Thomas<\/dc:creator><dc:creator>Benedetti, Lorenzo<\/dc:creator><dc:creator>Nopens, Ingmar<\/dc:creator><dc:creator>Judd, Simon J.<\/dc:creator><dc:subject>Energy<\/dc:subject><dc:subject>Reuse<\/dc:subject><dc:subject>Model-based optimisation<\/dc:subject><dc:subject>Scenario analysis<\/dc:subject><dc:subject>MBR calibration<\/dc:subject><dc:description>The energy consumption of a small-scale membrane bioreactor, treating high strength domestic wastewater for community level wastewater recycling, has been optimised using a dynamic model of the plant. ASM2d was chosen as biological process model to account for the presence of phosphate accumulating organisms. A tracer test was carried out to determine the hydraulic behaviour of the plant. To realistically simulate the aeration demand, a dedicated aeration model was used incorporating the dependency of the oxygen transfer on the mixed liquor concentration and allowing differentiation between coarse and fine bubble aeration, both typically present in MBRs. A steady state and dynamic calibration was performed, and the calibrated model was able to predict effluent nutrient concentrations and MLSS concentrations accurately. A scenario analysis (SCA) was carried out using the calibrated model to simulate the effect of varying SRT, recirculation ratio and DO set point on effluent quality, MLSS concentrations and aeration demand. Linking the model output with empirically derived correlations for energy consumption allowed an accurate prediction of the energy consumption. The SCA results showed that decreasing membrane aeration and SRT were most beneficial towards total energy consumption, while increasing the recirculation flow led to improved TN removal but at the same time also deterioration in TP removal. A validation of the model was performed by effectively applying better operational parameters to the plant. This resulted in a reduction in energy consumption by 23% without compromising effluent quality, as was accurately predicted by the model. This modelling approach thus allows the operating envelope to be reliably identified for meeting criteria based on energy demand and specific water quality determinants.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2011-01-27T11:55:32Z<\/dc:date><dc:date>2011-01-27T11:55:32Z<\/dc:date><dc:date>2010-07<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>Bart Verrecht, Thomas Maere, Lorenzo Benedetti, Ingmar Nopens and Simon Judd, Model-based energy optimisation of a small-scale decentralised membrane bioreactor for urban reuse,  Water Research, Volume 44, Issue 14, July 2010, Pages 4047-4056<\/dc:identifier><dc:identifier>0043-1354<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.watres.2010.05.015<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/4771<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0043-1354","issn:0043-1354"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Energy","Reuse","Model-based optimisation","Scenario analysis","MBR calibration"],"subject":["Article"],"fullText":"Accepted Manuscript\nTitle: Model-based energy optimisation of a small-scale decentralised membrane\nbioreactor for urban reuse\nAuthors: Bart Verrecht, Thomas Maere, Lorenzo Benedetti, Ingmar Nopens, Simon\nJudd\nPII: S0043-1354(10)00323-4\nDOI: 10.1016\/j.watres.2010.05.015\nReference: WR 8010\nTo appear in: Water Research\nReceived Date: 11 November 2009\nRevised Date: 7 May 2010\nAccepted Date: 11 May 2010\nPlease cite this article as: Verrecht, B., Maere, T., Benedetti, L., Nopens, I., Judd, S. Model-based\nenergy optimisation of a small-scale decentralised membrane bioreactor for urban reuse, Water\nResearch (2010), doi: 10.1016\/j.watres.2010.05.015\nThis is a PDF file of an unedited manuscript that has been accepted for publication. As a service to\nour customers we are providing this early version of the manuscript. The manuscript will undergo\ncopyediting, typesetting, and review of the resulting proof before it is published in its final form. Please\nnote that during the production process errors may be discovered which could affect the content, and all\nlegal disclaimers that apply to the journal pertain.\nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n1 \nModel-based energy optimisation of a small-scale 1 \ndecentralised membrane bioreactor for urban reuse 2 \nBart Verrecht*, Thomas Maere**, Lorenzo Benedetti**, Ingmar Nopens** and Simon Judd*1 3 \n*Centre for Water Science, Cranfield University, Cranfield, Bedfordshire MK43 0AL, UK 4 \n**BIOMATH, Department of Applied Mathematics, Biometrics and Process Control, Ghent 5 \nUniversity, Coupure Links 653, B-9000 Gent, BE 6 \n1Corresponding author: s.j.judd@cranfield.ac.uk 7 \n 8 \nAbstract 9 \nThe energy consumption of a small-scale membrane bioreactor, treating high strength 10 \ndomestic wastewater for community level wastewater recycling, has been optimised using a 11 \ndynamic model of the plant. ASM2d was chosen as biological process model to account for 12 \nthe presence of phosphate accumulating organisms. A tracer test was carried out to 13 \ndetermine the hydraulic behaviour of the plant. To realistically simulate the aeration demand, 14 \na dedicated aeration model was used incorporating the dependency of the oxygen transfer 15 \non the mixed liquor concentration and allowing differentiation between coarse and fine 16 \nbubble aeration, both typically present in MBRs. A steady-state and dynamic calibration was 17 \nperformed, and the calibrated model was able to predict effluent nutrient concentrations and 18 \nMLSS concentrations accurately. A scenario analysis (SCA) was carried out using the 19 \ncalibrated model to simulate the effect of varying SRT, recirculation ratio and DO set point on 20 \neffluent quality, MLSS concentrations and aeration demand. Linking the model output with 21 \nempirically derived correlations for energy consumption allowed an accurate prediction of the 22 \nenergy consumption. The SCA results showed that decreasing membrane aeration and SRT 23 \nwere most beneficial towards total energy consumption, while increasing the recirculation 24 \nflow led to improved TN removal but at the same time also deterioration in TP removal. A 25 \nvalidation of the model was performed by effectively applying better operational parameters 26 \nto the plant. This resulted in a reduction in energy consumption by 23% without 27 \ncompromising effluent quality, as was accurately predicted by the model. This modelling 28 \napproach thus allows the operating envelope to be reliably identified for meeting criteria 29 \nbased on energy demand and specific water quality determinants. 30 \n 31 \nKeywords: Energy, Reuse, Model-based optimisation, Scenario analysis, MBR calibration 32 \nSymbols and abbreviations 33 \nAOTR  Actual oxygen transfer rate in gO2.d-1 34 \nASM2d Activated sludge model no.2d 35 \nBOD5 5 day biological oxygen demand in mg.l-1 36 \nBODf 5 day biological oxygen demand of a sample filtered through 0.45 µm, in mg.l-1  37 \nbPAO   Rate constant for lysis of XPAO in d-1 38 \nCAS Conventional activated sludge 39 \nCOD Chemical oxygen demand in mg.l-1  40 \nCODf Chemical oxygen demand of a sample filtered through 0.45 µm in mg.l-1 41 \nCrsat_average  Average dissolved oxygen saturation concentration in gO2.m-3, for clean water 42 \nin an aeration tank for a given temperature T 43 \nCssat  Dissolved oxygen saturation concentration in gO2.m-3, in clean water at 20 °C 44 \nand 1 atm 45 \nCSTR  Continuously stirred tank reactor 46 \nCtank  Actual oxygen concentration in the aeration tank in gO2.m-3 47 \nDO  Dissolved oxygen in mgO2.l-1 48 \nF  Correction factor for fouling of the air diffusers (1 for clean diffusers) 49 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n2 \nFcoarse Correction factor for fouling of the coarse bubble air diffusers (1 for clean 50 \ndiffusers) 51 \nFfine Correction factor for fouling of the fine bubble air diffusers (1 for clean 52 \ndiffusers) 53 \nHRT  Hydraulic retention time in hours 54 \nKO  Half saturation coefficient for oxygen, in mgO2.l-1 55 \nMBR  Membrane bioreactor 56 \nMLSS  Mixed liquor suspended solids in mg.l-1 57 \nNH4-N  Ammonia-nitrogen in mgN.l-1 58 \nNO2-N  Nitrite-nitrogen in mgN.l-1 59 \nNO3-N  Nitrate-nitrogen in mgN.l-1 60 \nOair   Fraction of oxygen in the air in % \nON  Organic nitrogen in mgN.l-1 61 \nOTE   Oxygen transfer efficiency in m-1  \nOTEcoarse Coarse bubble oxygen transfer efficiency in m-1 62 \nOTEfine  Fine bubble oxygen transfer efficiency in m-1 63 \nPO4-P  Ortho-phospate in mgP.l-1 64 \nQair  Airflow rate in Nm3.h-1 \nQair,coarse Coarse bubble airflow rate in Nm3.h-1 65 \nQair,fine  Fine bubble airflow rate in Nm3.h-1 66 \nSA  Fermentation products, considered to be acetate, in mgCOD.l-1 67 \nSCA  Scenario analysis 68 \nSF  Fermentable, readily biodegradable organic substrates in mgCOD·l-1 69 \nSI  Inert soluble organic material in mgCOD.l-1 70 \nSNH4  Ammonium plus ammonia nitrogen in mgN.l-1 71 \nSOTR   Standard oxygen transfer rate in gO2.d-1 72 \nSPO4  Inorganic soluble phosphorus, primarily ortho-phosphates in mgP.l-1 73 \nSRT  Solids retention time in days 74 \nSS  Suspended solids in mg.l-1 75 \nT  Temperature of the mixed liquor in °C 76 \ntCOD Total COD in mg.l-1 77 \nTKN  Total Kjeldahl nitrogen in mgN.l-1 78 \nTN Total nitrogen in mgN.l-1  79 \nTON  Total oxidised nitrogen in mgN.l-1 80 \nTP  Total phosphorous in mgP.l-1 81 \nXH  Heterotrophic organisms in mgCOD.l-1 82 \nXI  Inert particulate organic material in mgCOD.l-1 83 \nXS  Slowly biodegradable substrates in mgCOD.l-1 84 \ny   Aerator depth in m \nYPO Polyphosphate (PP) requirement for storage of poly-hydroxy-alkanoates 85 \n(PHA), in gP.(gCOD)-1 86 \nα  Clean-to-process water correction factor for oxygen transfer 87 \nβ   Salinity surface tension correction factor, dimensionless 88 \nµPAO   Maximum growth rate of XPAO in d-1 89 \nρair   Density of air at standard conditions in kg·m-3 \nφ  Temperature correction factor for oxygen transfer 90 \nω α-factor exponent coefficient, dimensionless 91 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n3 \n1 Introduction  92 \nMembrane bioreactors (MBR) offer a low-footprint option with high quality effluent for 93 \nrecycling municipal wastewater. For applications at small community level, small MBRs are 94 \nrequired (Fletcher et al., 2007; Gnirrs et al., 2008, Abegglen et al.,2008), which are then 95 \ninherently less energetically efficient due to wide variations in flows and commensurately 96 \nlarge peak loading factors demanding more conservative design. Given that the energy 97 \ndemand contributes significantly to the running costs, it is important to optimise process 98 \nenergy consumption to make the technology more competitive (Judd, 2006). 99 \n 100 \nMathematical models are widely recognized as providing a useful tool for optimising 101 \nbiological treatment, and several semi-empirical models for the optimisation of MBRs are 102 \ndescribed in literature (Verrecht et al., 2008; Wen et al., 1999; Yoon et al., 2004). These 103 \nmodels, however, have limited predictive power regarding biological performance and total 104 \nenergy demand under dynamic conditions, or else focus mainly on sludge production. The 105 \nactivated sludge models (ASMs) by Henze et al. (2000), created with the purpose of 106 \ndescribing the biological dynamics of conventional activated sludge (CAS) systems, have 107 \nbeen successfully used in the past to optimise full scale CAS plants (Dochain and 108 \nVanrolleghem, 2001). However, literature on the application of the activated sludge models 109 \nto full scale MBR is scarce or not readily accessible (Erftverband, 2001; Erftverband, 2004), 110 \nand research focuses mainly on sludge production through application of ASM1 and ASM3 to 111 \nlab and pilot scale MBR (Sperandio and Espinosa, 2008; Lubello et al., 2009). The 112 \nrequirement for full scale validation of the ASM models for MBR applications has recently 113 \nbeen identified as an urgent research need (Fenu et al., 2010). Applying these ASM to MBRs 114 \ndemands that the differences between MBR and CAS systems be recognised, viz.: a) 115 \nmicrobiological composition, leading to different stoichiometric and kinetic parameters (inter 116 \nalia Wen et al., 1999; Jiang et al., 2005; Lobos et al., 2005), b) biomass concentration, 117 \nleading to changes in oxygen transfer and uptake (Krampe and Krauth, 2003; Germain et al, 118 \n2007), and c) requirement for additional aeration for membrane scouring (Judd, 2006). 119 \n 120 \nIn this paper, the application of ASM2d to a small community-scale MBR for reuse has been 121 \nappraised with the key objective of optimising energy demand without compromising nutrient 122 \nremoval. The study uses the BIOMATH calibration protocol (Vanrolleghem et al., 2003), 123 \nproceeding through a hydraulic characterisation of the system and employing both steady 124 \nstate and dynamic model calibration to predict water quality. The paper thus provides a case 125 \nstudy of the calibration and application of ASM2d to a community-scale MBR. The MBR 126 \nmodel incorporates an aeration model accounting for oxygen mass transfer at the operational 127 \nbiomass concentration and differentiates between coarse and fine bubble aeration. Energy 128 \nconsumption values for the different unit processes are derived empirically. A scenario 129 \nanalysis is conducted to link the predicted biological performance for different operational 130 \nparameters with the empirically derived energy consumption values. The scenario analysis 131 \nthus allows identification of better operational parameters, and the predicted energy saving 132 \nand biological removal performance are verified on the full scale plant. 133 \n  134 \n2 Materials and Methods 135 \n2.1 Plant description 136 \nThe wastewater recycling plant produces an average reclaimed water flow of 25 m3.d-1 for 137 \ntoilet flushing and irrigation (Figure 1). Domestic wastewater from the residences is collected 138 \nvia a pumping station and septic tanks, which provide buffering volume and primary settling. 139 \nInfluent from the septic tanks flows through 3 mm screens to the MBR, which contains both 140 \nanoxic and aerobic zones for nitrification and denitrification respectively (Table 1). Although 141 \nno anaerobic tank is provided, some of the influent phosphorous is biologically removed, 142 \nsuggesting that part of the anoxic tank may be (intermittently) anaerobic. The membrane 143 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n4 \nseparation step is provided by 2 x 3 ZW500c (GE Zenon, Canada) membrane modules with 144 \na total membrane surface area of 139 m2, submerged in the aerobic zone. 145 \n 146 \n2.2 Hydraulic profile 147 \nA tracer test was carried out using a 22.1 g spike of LiCl dosed into the anoxic zone, with 148 \nsamples taken from the anoxic to aerobic tank overflow weir, the effluent and the sludge 149 \nrecirculation loop every 20 to 30 minutes for the next 40 hours (corresponding to ~1.5 times 150 \nthe hydraulic residence time, HRT). Samples were analysed for Li by atomic emission 151 \nspectroscopy at 670.784 nm (iCAP 6500 Dual View; Thermo Scientific). To validate the 152 \nresults and determine the number of tanks in series according to the tanks-in-series model 153 \n(Levenspiel, 1998), the MBR was implemented (Figure 1) as an anoxic tank followed by an 154 \nMBR unit (aerated tank with submerged membrane modules) in the modelling and simulation 155 \nplatform WEST® (MOSTforWATER N.V., Kortrijk, Belgium; Vanhooren et al., 2003). Both 156 \ntanks were assumed to be completely mixed. During the tracer test, the plant was run under 157 \nnormal flow conditions (Table 1).   158 \n 159 \n2.3 Influent characterisation 160 \nThe MBR was fed with domestic wastewater without rainwater dilution from dwellings with 161 \naverage water consumption of 80-100 l.capita-1.d-1. The wastewater strength was thus high 162 \n(Table 2), and comparable to values reported for a single household MBR by Abegglen et al. 163 \n(2008). The septic tanks were estimated to remove 20-30% of the COD, and 0-10% of the N 164 \nand P (VSA, 2005), as well as buffering the variations in influent concentration to the benefit 165 \nof biological performance (Gnirss et al., 2008). 166 \n  167 \nTable 3 compares the community wastewater characterised according to the STOWA 168 \nprotocol (Roeleveld and van Loosdrecht, 2002) to data for a typical wastewater (Henze et al., 169 \n1999), and indicates this wastewater to be 48%, 324% and 81% higher in concentrations of 170 \ntotal COD, TKN and TP respectively. The relative quantity of readily biodegradable 171 \nsubstrates (SF and SA) is also higher due to hydrolysis in the septic tanks (Zaveri and Flora, 172 \n2002), which enhances bio-P removal for which the presence of fermentation products such 173 \nas acetate (SA) is required (Henze et al, 1999; Gernaey and Jørgensen, 2004). Flow variation 174 \nwas between 0 and 1.8 m3.hr-1, with substantially larger loads (up to 25%) over the weekend 175 \n(Figure 2). 176 \n 177 \n2.4 Steady state and dynamic plant modelling using ASM2d 178 \nFor the steady state and dynamic simulations of the plant, ASM2d was chosen as the bio-179 \nchemical model since it includes enhanced biological P removal in addition to COD and N 180 \nremoval (Henze et al., 1999). To obtain better representation of P removal, the ASM2d 181 \nbiomass decay rates modifications proposed by Gernaey and Jørgensen (2004) were 182 \nadopted.   183 \n 184 \nFor the model calibration, influent, mixed liquor and effluent data was taken collected from 185 \nJanuary till May 2009, totalling 93 days, which corresponds to approximately twice the SRT 186 \n(47 days). A steady-state calibration of the full model was performed based on average data 187 \nover this period (Table 2), and a DO set point of 2 mg.l-1 was used, reflecting the average DO 188 \nvalue in the aerobic zone. For the dynamic calibration, a high frequency measurement 189 \ncampaign was carried out, and an influent file was produced through analysis of SCADA 190 \ndata, containing a data recorded every 15 minutes for 93 days for the following parameters: 191 \ninfluent flow, influent COD, CODf, BOD5, TSS, NH4-N, TKN, PO4-P, TP, recirculation flow, 192 \nDO value and wastage flow. During the sampling period, the temperature ranged from 15.8 193 \nto 20.7 °C. A number of process upsets occurred ove r this period, such as a mixer failure, 194 \nresulting in a necessary manual increase in the recirculation flow to keep the anoxic zone 195 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n5 \nmixed and a blower failure resulting in low DO levels for a number of days. These upsets 196 \nwere included in the model.   197 \n 198 \nSince the model predictions were used for energy consumption calculations, the use of an 199 \nadequate aeration model was of utmost importance. Basic aeration models, such as the one 200 \nused in Benchmark Simulation Model 1 (BSM1, Copp, 2002) and many ASM model 201 \napplications do not account for the detrimental effect of elevated MLSS concentrations on 202 \noxygen transfer, and control the oxygen transfer rate by controlling the oxygen transfer 203 \ncoefficient kLa: 204 \n( ) VDODOakSOTR satL ⋅−⋅=         (1) 205 \nTo account for the effect of elevated MLSS concentrations on oxygen transfer and for other \ndependencies of oxygen transfer, e.g., the difference in oxygen transfer from coarse and fine \nbubble aeration, typical for MBR, a more extensive model as described in Maere et al. (2009) \nwas used (Metcalf and Eddy, 2003; Henze et al., 2008; Verrecht et al., 2008, Krampe and \nKrauth, 2003; Germain et al, 2007, Stenstrom and Rosso, 2008), viz: \nF\nC\nCC\nSOTRAOTR T\nssat\nkaveragersat\n⋅⋅⋅\n−⋅\n⋅=\n− αϕ\nβ )20(tan_ )(\n     (2) 206 \n10000\/24 airairair OyOTEQSOTR ⋅⋅⋅⋅⋅= ρ        (3) \nMLSSe ⋅−= ωα\n           (4) 207 \n \nIn this model the influence of MLSS concentration on the AOTR is accounted for through the \nα-factor (Eq. 4), and the effect of using different types of diffusers for biological and \nmembrane aeration can be incorporated by calculating the SOTR for each type of diffuser \nindividually, with appropriate values of oxygen transfer efficiency (OTE) and fouling factor F. \nMore details about the aeration model can be found in Maere et al. (2009). \n 208 \n2.5 Scenario analysis 209 \nA scenario analysis (SCA) was carried out to determine the optimum operating conditions by 210 \nvarying the experimentally-adjustable degrees of freedom (DOF) that were regarded as 211 \nhaving the greatest impact on effluent quality and energy consumption: 212 \n• SRT: 9 values for the wastage rate, equally spaced between 0.1 to 2.278 m3.d-1 213 \nyielding SRT values ranging from 10 to 228.7 days 214 \n• Recirculation rate: 9 values, equally spaced between 28.8 m3.d-1 to 187.2 m3.d-1 215 \n(upper range of recirculation pump) yielding recirculation ratios to the influent flow of 216 \n1.13 to 7.78 217 \n• Dissolved oxygen set point: 5 values, equally spaced between 0.75 and 2 mg.l-1 218 \n 219 \nFor inputting to the SCA, a data set containing 35 days of influent was taken from the plant 220 \nwhen operating under normal influent conditions. The scenario analysis was duplicated using 221 \ntwo different membrane aeration rate values (84 and 42 Nm3.h-1), corresponding to the 222 \nmaximum and minimum realistic values for coarse bubble air flow (Qair,coarse), since this 223 \nparameter accounts for a large part of the total energy consumption. 224 \n 225 \nThe SCA grid, using the values described above, resulted in 486 different scenarios. The 226 \nimpact on activated sludge aeration, nutrient removal and MLSS concentration was studied. 227 \nTo calculate the energy consumption for each degree of freedom, empirical correlations for 228 \nenergy consumption of the unit processes (membrane aeration, biology aeration, 229 \nrecirculation pumping, permeate pumping and mixing) were derived from measurements on 230 \nthe plant, at an MLSS of 8,000 mg.l-1. Membrane aeration energy was 0.029 to 0.034 231 \nkWh.Nm-3 for Qair,coarse of 84 and 42 Nm3.h-1 respectively, indicating that the blower becomes 232 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n6 \nless efficient at lower air flow rates. Energy demand for the recirculation pump varied linearly 233 \nwith the flow rate, up to a maximum of 0.037 kWh.m-3 of sludge pumped. Since the activated 234 \nsludge blower for biology aeration is controlled by an on\/off controller at around 2 mgO2.l-1 (or 235 \naround the different DO set points, as described above) and runs at fixed speed when in 236 \noperation, the energy consumption per Nm3 is constant at 0.0289 kWh.(Nm3)-1. For the 237 \nscenario analysis, the mixing energy was considered constant at 4.6 kWh.d-1. Since mixing 238 \naccounts for less than 5% of the total energy demand, changes in mixing energy arising from 239 \nchanges in viscosity at different MLSS concentrations were considered negligible. The 240 \npermeate pump was constantly running at 1.8 m3.h-1 when in operation, resulting in an 241 \nenergy consumption of 0.056 kWh.m-3 of permeate. Sludge handling costs were ignored 242 \nsince these depend on site-specific sludge management strategies. 243 \n 244 \n3 Results and discussion 245 \n3.1 Hydraulic profile 246 \nFigure 3 displays measured versus predicted Li concentrations in the anoxic and aerobic 247 \nzone during the tracer test. The correlation between the measured and predicted data for 248 \nboth the anoxic and aerobic zone corroborates the assumption of perfect mixing. The 249 \nrecovery of Li, defined as the ratio of Li added to Li recovered in the effluent, determined 250 \nthrough integration of the effluent Li flux, was 87%, and would have been higher for an 251 \nextended campaign. The measured Li concentrations in the effluent were always about 7.5 ± 252 \n3.5% lower than the Li concentrations measured in the recirculation sludge, suggesting some 253 \nLi adsorption onto the flocs arose but not to a significant extent. The tanks could thus each 254 \nbe considered CSTRs for the remainder of the modelling exercise.   255 \n 256 \n3.2 Model calibration 257 \n3.2.1 Steady state calibration 258 \nA steady state calibration was performed to achieve an accurate simulation of the MLSS 259 \nconcentration, this being instrumental in correctly predicting the aeration energy demand due 260 \nto its effect on oxygen transfer (via the α-factor). However, as shown in Table 4, using default 261 \nvalues as reported by Henze et al. (1999) for all stoichiometric and biokinetic parameters, 262 \nleads to an underestimation of sludge production (MLSS concentration) by about 15%, as the 263 \ngrowth of XPAO (and consequently bio-P removal) could not be simulated correctly in steady 264 \nstate. This can be attributed to the fact that anaerobic conditions, required for the growth of 265 \nXPAO, do not occur during steady state simulation, indicating the need for a dynamic 266 \ncalibration taking into account the influent variations. In steady state, a correct representation 267 \nof MLSS concentrations could only be achieved by making substantial and unrealistic 268 \nchanges to µPAO (2 d-1 vs. default value of 1 d-1), bPAO (0.1 d-1 vs. default value of 0.2 d-1) and 269 \nYPO (0.2 gP.(g COD)-1 vs. default value of 0.4 gP.(g COD)-1 (Table 4).   270 \n 271 \n3.2.2 Dynamic calibration 272 \nWhen the dynamic influent file was applied to the model, the concentration of XPAO started to 273 \nincrease without the adjustments to µPAO, bPAO and YPO that were necessary in the steady 274 \nstate calibration. Upon reaching dynamic equilibrium, MLSS concentrations were 275 \nrepresented accurately using the default parameter values as reported by Henze et al. 276 \n(1999), thereby eliminating the need to adjust µPAO, bPAO and YPO as was necessary under 277 \nsteady-state conditions.  278 \n 279 \nTo calibrate the aeration model, the measured Qair,fine (averaged over a 15 minute period) 280 \nwas used as the input for the aeration model, while Qair,coarse was fixed at 84 Nm3.h-1, to mimic 281 \nthe prevailing operational conditions during the calibration period. The values for OTEfine 282 \n(0.045 m-1),  OTEcoarse (0.015 m-1) were taken from Metcalf and Eddy (2003), the value for ω 283 \n(0.084) was the mean value derived from the data of Germain et al. (2007), Krampe and 284 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n7 \nKrauth (2003), and Metcalf and Eddy (2003). Fcoarse (0.8) and Ffine (0.8) were calibrated to 285 \nclosely match the measured DO profile. Calibrating the fouling factors could be justified since 286 \nan inspection of the diffusers had shown visible fouling. Moreover, more advanced 287 \ntechniques for measuring the α-factor and OTEcoarse and OTEfine were unavailable. 288 \n  289 \nDespite the plant upsets during the evaluated period, the used parameter set allowed for a 290 \nsatisfactory reproduction of the NH4-N, NO3-N and MLSS concentration trajectories; Figure 4 291 \ncompares the simulated nitrogen removal profiles (NH4-N and NO3-N) and MLSS 292 \nconcentrations with concentrations measured during an intensive sampling period on Days 293 \n61-62 of the 93 day campaign. Predicted NH4-N concentrations were consistently slightly 294 \nhigher than the measured values (~0.25 mg.l-1 simulated vs ~0.04 mg.l-1 measured and 295 \nconfirmed by using two different analytical techniques). MBRs tend to achieve more stable 296 \nand complete nitrification than CAS systems (Munz et al., 2008), a fact that is apparently not 297 \nwell incorporated into the various CAS ASM models. Despite this shortcoming, when looking 298 \nat the total nitrogen removal, the prediction is still very accurate (Figure 4). Predicted PO4-P 299 \nconcentrations show acceptable values and dynamic behaviour (Figure 5) though 300 \nconsistently a few hours ahead of those measured. It is postulated that this is caused by the 301 \noversimplification of the actual hydraulics by the tanks-in-series concept, which may be 302 \nunable to accurately predict the occurrence of localised anaerobic zones under certain 303 \nconditions. However, a CFD model study and on-line data at different locations in the tank 304 \nwould be required to confirm this. In general it can be concluded that the calibrated model 305 \npredicts nutrient and MLSS concentrations accurately using the default values for ASM2d 306 \n(Henze et al., 1999) and its modification (Gernaey and Jørgensen, 2004), and the model 307 \nused along with the energy demand calculations in the subsequent scenario analysis. 308 \n 309 \n3.2.3 On\/off controller for aeration model for predictive Qair,fine values in energy profiling 310 \nTo lend predictive value to the model, the fine bubble aeration flow rate (Qair,fine) demanded 311 \nan extra on\/off controller, switching on aeration at DO < 1.5 mg.l-1 with Qair,fine at 90 Nm3.h-1 312 \nand switching off at DO > 2.5 mg.l-1, simulating the actual blower operation at the plant. The 313 \nintegral of the predicted Qair,fine value was within 3% difference from the actual measured 314 \nvalue when using the parameters as calibrated in Section 3.2.2, indicating that aeration 315 \ndemand could be predicted accurately through this approach. Nutrient and MLSS 316 \nconcentrations were reproduced well, with predicted values generally well within 10% of the 317 \nmeasured ones (Figure 4 and Figure 5). Any differences can be attributed to slight deviations 318 \nfrom reality using the implemented on\/off controller.  319 \n 320 \n3.3 Scenario analysis 321 \nThe evolution of biological aeration demand and maximum effluent NH4-N concentration as a 322 \nfunction of the SRT (Figure 6) demonstrates that lowering the SRT by increasing the 323 \nwastage rate has a beneficial effect on demand for Qair,fine. However, Figure 6 also shows 324 \nthat this also leads to higher maximum effluent NH4-N concentrations, indicating a trade-off 325 \nbetween minimising the aeration demand (and thus energy consumption) and achievable 326 \neffluent quality. Operation at SRTs below 23 days leads to a deterioration in nitrification, 327 \nbecause of a decrease in MLSS and autotrophs concentration, and to an increase in F\/M 328 \nratio, similar to observations by Cicek et al. (2001). Lowering the DO setpoint had a similar 329 \nbut less pronounced effect on nitrification.  330 \n 331 \nThere is a similar phenomenon regarding phosphate and nitrate (Figure 7), in that an 332 \nincrease in the recirculation ratio leads to respectively lower and higher effluent NO3-N and 333 \nPO4-P concentrations. This arises because the denitrification and bio-P removal processes 334 \ncompete for the same carbon source (Metcalf and Eddy, 2003) and anaerobic conditions is 335 \nless sustainable at higher recirculation ratios. 336 \n 337 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n8 \nFigure 8 shows that a change in the SRT (through variation in wastage rate), and thus MLSS 338 \nconcentration, has a much larger impact on total aeration energy demand than changing the 339 \nrecirculation ratio. At a DO setpoint of 1.25 mg.l-1 and fixed recirculation ratio, the total fine 340 \nbubble aeration demand (Qair,fine) can change by up to 342% depending on the wastage rate, 341 \nwhile this change is limited to 44% when varying the recirculation ratio at fixed SRT and DO 342 \nset point. This confirms the importance of incorporating the MLSS dependency of the oxygen 343 \ntransfer into the aeration model. The model thus allows the operating envelope to be 344 \nidentified for meeting criteria based on energy demand and\/or specific water quality 345 \ndeterminants. 346 \n 347 \nIt is acknowledged that over the range of operating conditions studied in the SCA, the 348 \nbiological processes and kinetics may change. For instance, Sperandio and Espinosa (2008) 349 \nsuggest that at elevated SRT some of the influent XI should be considered as XS, which has 350 \nimplications on the overall sludge balance. Also, simultaneous nitrification and denitrification 351 \nmay occur at low DO set points. The model accounts for this by using oxygen half-saturation 352 \ncoefficients KO for XH and XPAO. The effect of floc size on the value of KO is still debated, the 353 \nsmall flocs of an MBR compared to those from CAS would be expected to yield lower values 354 \nfor the halfsaturation constants (inter alia Manser et al., 2005). However, no clear consensus 355 \nhas been reached on the impact of specific operational conditions on kinetics. Hence, rather 356 \nthan varying the biokinetic parameters in the model over the studied range of operational 357 \nparameters, all biokinetic parameters were assumed constant, and an a posteriori model 358 \nvalidation carried out by confronting the obtained model predictions of the scenario analysis 359 \nwith experimental data independent of the calibration data set (Section 3.4). 360 \n 361 \nThe outcomes of the scenario analysis were linked with the empirical energy consumption 362 \ncalculations, and ranked in terms of energy consumption while compliant with effluent quality 363 \nstandards of <0.5 mg.l-1 NH4-N, <20 mg.l-1 TN < 20 mg.l-1, and 5,000 mg.l-1 minimum MLSS. 364 \nSince reuse regulations - such as the US EPA guidelines for unrestricted urban reuse (EPA, 365 \n2004) - generally do not include stringent NH4-N or TN guidelines, these parameters were 366 \nchosen to achieve consistent effluent quality under conservative operating conditions that 367 \ncould be achieved in a real system.  368 \n 369 \nWhen comparing the different parameter sets for the two studied air flow rates displayed, the 370 \naverage energy consumption was 13.1 ± 4.7% lower at a membrane coarse bubble aeration 371 \nof 42 Nm3.h-1 compared to 84 Nm3.h-1. The maximum difference in energy consumption 372 \nbetween simulations for the different membrane airflow values was 28%, while the minimum 373 \nwas 4.6%. When the membrane aeration airflow rate was set at 42 Nm3.h-1, the minimum and 374 \nmaximum predicted energy consumption was 2.25 kWh.m-3 and 3.83 kWh.m-3 respectively. 375 \nThese values increased to 2.74 kWh.m-3 and 4.46 kWh.m-3 when the membrane aeration was 376 \nkept at its original value of 84 Nm3.h-1. 377 \n 378 \n3.4 Model application for optimisation 379 \nResults from the scenario analysis were used in the selection of better operational parameter 380 \nvalues (Table 5). The higher wastage rate (and lower SRT) resulted in a modest decline in 381 \nMLSS and higher F\/M ratio, which previous studies have indicated may increase the sludge 382 \nfouling propensity (Trussell et al., 2006). However, data collected on the real MBR over a 383 \nperiod corresponding to approximately twice the SRT indicated permeability to be maintained 384 \nat the levels achieved in the original without changing the cleaning regime, notwithstanding 385 \nthe reduction in membrane aeration rate. This is attributable to the low operational fluxes (10-386 \n13 l.m-2.h-1), well below the operating flux values for most large-scale MBRs. However, the 387 \nlower membrane aeration set point corresponded to a SADm of 0.3 Nm3.m-2.h-1, which is still 388 \nwithin the range of SADm values (0.2 – 1.28 Nm3.m-2.h-1) typically considered sufficient for 389 \nsustainable operation, even at higher fluxes (Judd, 2006). Changing the parameter values 390 \ndid not compromise the effluent quality in terms of COD and N removal based on data 391 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n9 \nobtained through twice weekly grab sampling, but biological P removal deteriorated due to 392 \nthe increased recirculation ratio, as predicted by the model.  393 \n 394 \nTable 5 also displays the resulting energy saving compared to the original values. A 395 \nsubstantial reduction in energy consumption per m3 of permeate produced was achieved 396 \n(23%), and this value was predicted by the model within 5-10%. The energy consumption 397 \nvalue of 3.11 kWh.m-3 is at the lower end of values typically reported for small MBRs (Boehler 398 \net al., 2007; Gnirss et al., 2008), which can range from 3 to 12 kWh.m-3 depending on the 399 \ndesign and circumstances. However, this value is high when compared to larger, more 400 \nefficient plants, which can be as low as 0.62 kWh.m-3 for standard intermittent aeration 401 \n(Garcés et al., 2007). Other reported values for large-scale MBRs range from 0.6 to 2.0 402 \nkWh.m-3, depending on operational parameters and flow conditions (Brepols et al., 2009).  403 \n 404 \nThe proposed modelling approach can be readily applied to other MBRs, even when 405 \noperating under more stringent conditions, which is likely for larger scale plants, since it is 406 \nwidely reported that MBRs achieve good and consistent nutrient removal at lower HRT (inter 407 \nalia Judd, 2006). However, operation at high HRTs is not uncommon for smaller plants, as 408 \nindicated in Gnirss et al. (2008), and the findings of this paper may thus provide useful 409 \ninformation for future design and operation of small scale installations. The extent of the 410 \nreduction in energy consumption that can be achieved by applying the proposed 411 \nmethodology will depend on the influent wastewater composition, desired effluent quality, 412 \nallowable MLSS range and SRT, and initial operating conditions. 413 \n 414 \n4 Conclusions 415 \n• A small MBR for domestic water recycling, running under unusual and challenging 416 \ninfluent conditions, was dynamically modelled in ASM2d. The model provided an 417 \naccurate prediction of the dynamic nutrient removal profile and MLSS concentrations 418 \nusing default ASM2d values for all biokinetic and stoichiometric parameters.  419 \n• A dedicated aeration model was used, incorporating the effect of elevated MLSS 420 \nconcentrations on oxygen transfer, and allowing differentiation between coarse and 421 \nfine bubble aeration such that aeration demand could be accurately simulated. 422 \n• To allow realistic modelling of the plant, influent fractionation was carried out based 423 \non average influent concentrations obtained over a four-month sampling period. 424 \nAnalysis has shown the wastewater strength to be considerably higher than for a 425 \ntypical wastewater of entirely domestic origin with no dilution or infiltration. The 426 \namount of readily biodegradable substrate (45%) was also higher than typically 427 \nreported values (20%) due to hydrolysis in the septic tank.     428 \n• A scenario analysis was conducted to simulate the effect of varying the SRT, the 429 \nrecirculation ratio and the DO set point on effluent quality, MLSS concentrations and 430 \naeration demand. Linking the outcomes with empirically-derived calculations for 431 \nenergy consumption allowed quantification and optimisation of the energy demand. 432 \nDecreasing the membrane aeration flow and SRT had the most profound effect on 433 \ntotal operational energy consumption, but there was a trade-off in achievable NH4-N 434 \nremoval due to diminished nitrification with decreasing SRT. Increasing the 435 \nrecirculation flow led to improved TN removal and to deterioration in TP removal. This 436 \nmodelling approach thus allows the operating envelope to be identified for meeting 437 \ncriteria based on energy demand and\/or specific water quality determinants - and 438 \nnutrients in particular. 439 \n• New operational parameter values were applied to the plant, resulting in an on-site 440 \nreduction in energy consumption by 23%, without compromising effluent quality, as 441 \npredicted by the model.   442 \n 443 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n10 \nAcknowledgements 444 \nThe authors are grateful to MOSTforWATER N.V. (Kortrijk, Belgium) for providing the 445 \nWEST® modelling software, and would also like to thank Thames Water for the resources 446 \nprovided by them for this paper. Thomas Maere is supported by the Institute for 447 \nEncouragement of Innovation by means of Science and Technology in Flanders (IWT). 448 \nLorenzo Benedetti is post-doctoral researcher of the Special Research Fund (BOF) of Ghent 449 \nUniversity.  450 \n 451 \nReferences 452 \nAbegglen, C., Ospelt, M. and Siegrist, H. (2008), \"Biological nutrient removal in a small-scale 453 \nMBR treating household wastewater\", Water Research, vol. 42, no. 1-2, pp. 338-346.  454 \nBoehler, M., Joss, A., Buetzer, S., Holzapfel, M., Mooser, H. and Siegrist, H. (2007), 455 \n\"Treatment of toilet wastewater for reuse in a membrane bioreactor\", Water Science and 456 \nTechnology, vol. 56, no. 5. 457 \nBrepols, C., Schäfer, H. and Engelhardt, N. (2009), \"Economic aspects of large scale 458 \nmembrane bioreactors\", Final MBR-Network Workshop: \"Salient outcomes of the European 459 \nprojects on MBR technology\", 31\/03\/2009 - 01\/04\/2009, Berlin, Germany.  460 \nCicek, N., Macomber, J., Davel, J., Suidan, M. T., Audic, J. and Genestet, P. (2001), \"Effect 461 \nof solids retention time on the performance and biological characteristics of a membrane 462 \nbioreactor\", Water Science and Technology, vol. 43, no. 11, pp. 43-50.  463 \nCopp, J. B. (2002), \"The COST Simulation Benchmark - Description and Simulator Manual.\" 464 \nOffice for Official Publications of the European Communities, Luxembourg.  465 \nDochain, D. and Vanrolleghem, P. A. (2001), \"Dynamical Modelling and Estimation in 466 \nWastewater Treatment Processes\", IWA Publishing, London, UK.  467 \nEPA (2004). \"Guidelines for Water Reuse\", US Environmental Protection Agency. 468 \nEPA\/625\/R-04\/108. 469 \nErftverband (2001), \"Weitergehende Optimierung einer Belebungsanlage mit 470 \nMembranfiltration – Zwishenbericht (Advanced optimisation of an activated sludge plant with 471 \nmembrane filtration – mid-term report)\", Report to the Ministry of Environment North-Rine 472 \nWestphalia, Germany, Erftverband Bergheim, pp. 73-93. 473 \nErftverband (2004), \"Optimierung einer Belebungsanlage mit Membranfiltration – Band 3 474 \n(Optimisation of an activated sludge plant with membrane filtration – volume 3)\".  Report to 475 \nthe Ministry of Environment North-Rine Westphalia, Germany, Erftverband Bergheim, pp. 73-476 \n93. 477 \nFenu, A., Guglielmi, G., Jimenez, J., Sperandio, M., Saroj, D, Brepols, C., Lesjean, B. and 478 \nNopens, I. (2010) \"ASM-based biological modelling of MBR processes: A critical review with 479 \na special regard to MBR specificities\", Submitted for publication in Water Research.  480 \nFletcher, H., Mackley, T. and Judd, S. (2007), \"The cost of a package plant membrane 481 \nbioreactor\", Water research, vol. 41, no. 12, pp. 2627-2635. 482 \nGarcés, A., De Wilde, W., Thoeye, C. and De Gueldre, G. (2007), \"Operational cost 483 \noptimisation of MBR Schilde\" Proceedings of the 4th IWA International Membranes 484 \nConference \"Membranes for Water and Wastewater Treatment\", 15-17 May 2007, Harrogate, 485 \nUK.  486 \nGermain, E., Nelles, F., Drews, A., Pearce, P., Kraume, M., Reid, E., Judd, S. J. and 487 \nStephenson, T. (2007), \"Biomass effects on oxygen transfer in membrane bioreactors\", 488 \nWater research, vol. 41, no. 5, pp. 1038-1044.  489 \nGernaey, K. V. and Jørgensen, S. B. (2004), \"Benchmarking combined biological 490 \nphosphorus and nitrogen removal wastewater treatment processes\", Control Engineering 491 \nPractice, vol. 12, no. 3, pp. 357-373.  492 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n11 \nGnirss, R., Vocks, M., Stueber, J., Luedicke, C. and Lesjean, B. (2008), \"Membrane 493 \nTechnique in a Freight Container for Advanced Nutrients Removal - The ENREM 494 \nDemonstration Project\", IWA World Water Conference and Exhibition 2008, 7-12 September 495 \n2008, Vienna, Austria.  496 \nHenze, M., van Loosdrecht, M., Ekama, G. A. and Brdjanovic, D. (2008), \"Biological 497 \nWastewater Treatment: Principles, Modelling and Design\". IWA Publishing, London.  498 \nHenze, M., Gujer, W., Mino, T., Matsuo, T., Wentzel, M. C., Marais, G. v. R. and Van 499 \nLoosdrecht, M. C. M. (1999), \"Activated Sludge Model No.2d, ASM2d\", Water Science and 500 \nTechnology, vol. 39, no. 1, pp. 165-182.  501 \nHenze, M., Gujer, W., Mino, T., van Loosdrecht, M. (2000), \"Activated Sludge Models ASM1, 502 \nASM2, ASM2d and ASM3\", IWA Publishing, London. 503 \nJiang, T., Kennedy, M. D., Guinzbourg, B. F., Vanrolleghem, P. A. and Schippers, J. C. 504 \n(2005), \"Optimising the operation of a MBR pilot plant by quantitative analysis of the 505 \nmembrane fouling mechanism\", Water Science And Technology, vol. 51, no. 6-7, pp. 19-25.  506 \nJiang, T., Myngheer, S., De Pauw, D. J. W., Spanjers, H., Nopens, I., Kennedy, M. D., Amy, 507 \nG. and Vanrolleghem, P. A. (2008), \"Modelling the production and degradation of soluble 508 \nmicrobial products (SMP) in membrane bioreactors (MBR)\", Water research, vol. 42, no. 20, 509 \npp. 4955-4964.  510 \nJudd, S. (2006), \"The MBR book : principles and applications of membrane bioreactors in 511 \nwater and wastewater treatment\", 1st ed, Elsevier, Amsterdam; Boston; London.  512 \nKrampe, J. and Krauth, K. (2003), \"Oxygen transfer into activated sludge with high MLSS 513 \nconcentrations\", Water Science And Technology, vol. 47, no. 11, pp. 297-303.  514 \nLevenspiel, O. (1998), \"Chemical Reaction Engineering\", Third edition, John Wiley and Sons, 515 \nInc., Hoboken, NJ, USA.  516 \nLobos, J., Wisniewski, C., Heran, M. and Grasmick, A. (2005), \"Effects of starvation 517 \nconditions on biomass behaviour for minimization of sludge production in membrane 518 \nbioreactors\", Water Science and Technology, vol. 51, no. 6-7, pp. 35.  519 \nLubello, C., Caffaz, S., Gori, R., & Munz, G. (2009). A modified activated sludge model to \nestimate solids production at low and high solids retention time. Water Research, 43(18), \n4539-4548.  \nMaere, T., Verrecht, B., Benedetti, L., Pham P.T., Judd, S. J. and Nopens, I. (2009), 520 \n\"Building a Benchmark Simulation Model to Compare Control Strategies for Membrane 521 \nBioreactors: BSM-MBR\", 5th IWA specialised membrane technology conference for water & 522 \nwastewater treatment, 01-03 September 2009, Beijing, China.  523 \nManser, R., Gujer, W. and Siegrist, H. (2005). Consequences of mass transfer effects on the \nkinetics of nitrifiers. Water Research, 39(19), 4633-4642. \nMetcalf and Eddy, Tchobanoglous, G., Burton, F. L. and Stensel, H. D. (2003), \"Metcalf and 524 \nEddy - Wastewater Engineering – Treatment and Reuse\", 3rd edition, McGraw-Hill, New 525 \nYork.  526 \nMunz, G., De Angelis, D., Goria, R., Moric, G., Casarci, M., Lubello, C. (2008), \"Process 527 \nefficiency and microbial monitoring in MBR and conventional activated sludge process 528 \ntreatment of tannery wastewater\", Bioresource Technology, vol. 99, pp. 8559-8564. 529 \nRoeleveld, P. J. and Van Loosdrecht, M. C. M. (2002), \"Experience with guidelines for 530 \nwastewater characterisation in The Netherlands\", Water Science and Technology, vol. 45, 531 \nno. 6, pp. 77-87.  532 \nSpérandio, M., and Espinosa, M. C. (2008). “Modelling an aerobic submerged membrane \nbioreactor with ASM models on a large range of sludge retention time”. Desalination vol. 231, \nno. 1-3, pp. 82-90.  \nStenstrom, M.K. and Rosso, D. (2008) \"Aeration and mixing\", Chapter in \"Biological 533 \nWastewater Treatment: Principles, Modelling and Design\", Henze, M., van Loosdrecht, M., 534 \nEkama, G. A. and Brdjanovic, D. (2008), IWA Publishing, London. 535 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n12 \nTrussell, R. S., Merlo, R. P., Hermanowicz, S. W. and Jenkins, D. (2006), \"The effect of 536 \norganic loading on process performance and membrane fouling in a submerged membrane 537 \nbioreactor treating municipal wastewater\", Water research, vol. 40, no. 14, pp. 2675-2683.  538 \nVanhooren, H., Meirlaen, J., Amerlink, Y., Claeys, F., Vangheluwe, H., Vanrolleghem, P.A., 539 \n2003. \"WEST: Modelling biological wastewater treatment\", Journal of Hydroinformatics 5 (1), 540 \n27-50. 541 \nVanrolleghem, P., Insel, G., Petersen, B., Sin, G., De Pauw, D., Nopens, I., Dovermann, H., 542 \nWeijers, S. and Gernaey, K. (2003) \"A comprehensive model calibration procedure for 543 \nactivated sludge models\", Proceedings of WEFTEC03. 544 \nVerrecht, B., Judd, S., Guglielmi, G., Brepols, C. and Mulder, J. W. (2008), \"An aeration 545 \nenergy model for an immersed membrane bioreactor\", Water research, vol. 42, no. 19, pp. 546 \n4761-4770.  547 \nVSA (2005), \"Leitfaden Abwasser im landlichen Raum - Wastewater in the rural 548 \nenvironment\", Swiss Water Pollutant Control Association, Zurich, Switzerland.  549 \nWen, X., Xing, C. and Qian, Y. (1999), \"A kinetic model for the prediction of sludge formation 550 \nin a membrane bioreactor\", Process Biochemistry, vol. 35, no. 3-4, pp. 249-254.  551 \nYoon, S., Kim, H. and Yeom, I. (2004), \"The optimum operational condition of membrane 552 \nbioreactor (MBR): cost estimation of aeration and sludge treatment\", Water research, vol. 38, 553 \nno. 1, pp. 37-46.  554 \nZaveri, R. M. and Flora, J. R. V. (2002), \"Laboratory septic tank performance response to 555 \nelectrolytic stimulation\", Water research, vol. 36, no. 18, pp. 4513-4524.  556 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n13 \n 557 \nTable 1: Plant dimensions and operational parameters during the tracer test 558 \nParameter Unit Value \nAnoxic zone \n Volume anoxic zone m3 10.09 \nAerobic zone \/ MBR \n Membrane surface m2 139.2 \n Membrane flux during filtration l.m-2.h-1 10.78 \n Filtration time s 600 \n Relaxation time s 30 \n Backwash time s 30 \n Backwash flux l.m-2.h-1 10.78 \n Minimum tank volume m3 12.21 \n Maximum tank volume m3 12.78 \n Recirculation flow m3.d-1 57.6 \n 559 \nTable 2: Average characteristics of influent to the MBR (after septic tanks + screening; samples taken 560 \ntwice per week from January to May 2009) 561 \nVariable Unit Average St.Dev. Variable Unit Average St.Dev \nBOD5 mg\n.l-1 228.17 21.31 TON mg.l-1 0.30 0.00 \nBODf mg\n.l-1 114.60 14.37 NO2-N mg\n.l-1 0.02 0.01 \nCOD mg.l-1 480.50 36.67 PO4-P mg\n.l-1 9.29 0.41 \nCODf mg\n.l-1 247.67 48.11 TP mg.l-1 10.87 0.54 \nTN mg.l-1 81.58 3.51 SS mg.l-1 107.32 9.29 \nON mg.l-1 12.21 3.31 pH - 7.14 0.09 \nNH4-N mg\n.l-1 69.10 5.52     \n 562 \nTable 3: Treatment plant wastewater fractionation vs. typical wastewater composition (Henze et al., 563 \n1999) 564 \n  MBR influent composition in this \nstudy (COD=480 mg.l-1, TKN=81 \nmg.l-1, TP=11 mg.l-1) \nTypical wastewater composition  \n(COD=260 mg.l-1,TKN=25 mg.l-1, TP=6 \nmg.l-1) \nSoluble     \nVariable Unit Value % of tCOD Value % of tCOD \nSF mg.l-1 126.86 26.4% 30 11.5% \nSA mg.l-1 88.89 18.5% 20 7.7% \nSNH4 mg.l-1 69.10 - 16 - \nSPO4 mg.l-1 9.29 - 3.6 - \nSI mg.l-1 21.56 4.5% 30 11.5% \nParticulate \n    \nVariable Unit Value % of tCOD Value % of tCOD \nXI mg.l-1 41.57 8.7% 25 9.6% \nXS mg.l-1 191.26 39.8% 125 48.1% \n* Symbols used according to Henze et al., 1999 565 \n 566 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n14 \n 567 \n 568 \nTable 4: Steady state simulation results compared with average measured values 569 \nParameter Units Measured \nValues \n- Default ASM2d values \n(Henze et al., 1999) \n- Bio-P module (Gernaey and \nJørgensen, 2004) \n- Default ASM2d values \n(Henze et al., 1999) \n- Bio-P module (Gernaey \nand Jørgensen, 2004) \n- µPAO  = 2 d-1 \n- bPAO  = 0.1 d-1 \n- YPO  = 0.2 gP.(g COD)-1 \nNH4-N g.m-3 0.07 0.337 0.338 \nNO3-N g.m-3 21.4 21.9 21.68 \nPO4-P g.m-3 4.35 9.65 5.18 \nMLSS g.m-3 7,832 6,584 7,869 \n 570 \n 571 \nTable 5: Changes in operational parameter values according to the conclusions from the scenario 572 \nanalysis, and comparison in energy consumption between original and optimised system (energy 573 \ndemand of membrane aeration, activated sludge aeration, mixing of anoxic zone, permeate pump and 574 \nrecirculation pump) 575 \n Unit Original New \nOperational parameters    \nMembrane aeration Nm3.hr-1 84 42 \nWastage rate m3.d-1 0.485 0.645 \n i.e. SRT d 47 35 \nDO set-point mg.l-1 2 1.25 \nRecirculation flow m3.d-1 57.6 108 \n i.e. Recirculation ratio - 2.27 4.25 \nEnergy consumption    \nMeasurement kWh.m-3 4.03 3.11 \nReduction %  23% \n \n   \nModel prediction kWh.m-3 4.25 2.99 \nDeviation from real value % 5.1 3.9 \n 576 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n15 \n \nPre-treatment Post-\ntreatment \nAerobic zone \nQPermeate \nQRecirculation \nQWastage Anoxic zone \nPost-treatment \n 577 \nFigure 1: Schematic overview of the wastewater recycling plant 578 \n0\n0.2\n0.4\n0.6\n0.8\n1\n1.2\n1.4\n1.6\n1.8\n2\n0:\n00\n1:\n00\n2:\n00\n3:\n00\n4:\n00\n5:\n00\n6:\n00\n7:\n00\n8:\n00\n9:\n00\n10\n:0\n0\n11\n:0\n0\n12\n:0\n0\n13\n:0\n0\n14\n:0\n0\n15\n:0\n0\n16\n:0\n0\n17\n:0\n0\n18\n:0\n0\n19\n:0\n0\n20\n:0\n0\n21\n:0\n0\n22\n:0\n0\n23\n:0\n0\nTime (h)\nIn\nflu\nen\nt f\nlo\nw\n \n(m\n3.\nhr\n-\n1 )\nWeekend Weekday\n 579 \nFigure 2: Comparison of typical diurnal flow profiles during a weekday and a day in the weekend 580 \n0\n0.5\n1\n1.5\n2\n2.5\n0 0.5 1 1.5 2\nTime (days)\nLi\n \nc\no\nn\nc\nen\ntr\na\ntio\nn\n (m\ng\/\nl)\nSimulated Li concentration (mg\/l) Measured Li concentration (mg\/l)\n \n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0 0.5 1 1.5 2\nTime (days)\nLi\n \nc\no\nn\nce\nn\ntr\nat\nio\nn\n (m\ng\/\nl)\nSimulated Li concentration (mg\/l) Measured Li concentration (mg\/l)\n 581 \nFigure 3: Predicted and actual Li concentrations in (a) anoxic, and (b) aerobic tanks during the tracer 582 \ntest 583 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n16 \n0\n5\n10\n15\n20\n25\n30\n61.5 62 62.5\nTime (days)\nNH\n4-\nN \nan\nd \nN\nO\n3-\nN\n \nco\nn\nc\nen\ntr\nat\nio\nn\n \n(m\ng.\nl-1\n)\n7000\n8000\n9000\n10000\nM\nLS\nS \nc\no\nn\nc\nen\ntr\nat\nio\nn\n \n(m\ng.\nl-1\n)\nSimulated NO3-N concentration (mg\/l) Measured NO3-N concentrations (mg\/l)\nSimulated NH4-N concentration (mg\/l) Measured NH4-N concentrations (mg\/l)\nSimulated MLSS concentration (mg\/l) Measured MLSS concentrations (mg\/l)\n 584 \nFigure 4: Simulated and recorded NH4-N, NO3-N and MLSS concentrations using measured Qair,fine, 585 \naveraged per 15 minute interval, as input  586 \n 587 \n 588 \n0\n1\n2\n3\n4\n5\n6\n7\n61 61.5 62 62.5\nTime (days)\nPO\n4-\nP \nco\nn\nc\ne\nn\ntr\nat\nio\nn\n \n(m\ng.\nl-1\n)\nSimulated PO4-P concentration Measured PO4-P concentrations\n 589 \nFigure 5: Simulated and measured PO4-P values using measured measured Qair,fine, averaged per 15 590 \nminute interval, as input  591 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n17 \n0\n20\n40\n60\n80\n100\n10 20 30 40 50 60\nSRT (d)\nA\nv\ne\nra\nge\n \nde\nm\na\nn\nd \nfo\nr \nQ a\nir,\nfin\ne\n \n(N\nm\n3 .\nm\n-\n3  \na\ner\no\nbi\nc\n \nta\nn\nkv\no\nlu\nm\ne\n.\nd-\n1 )\n0\n1\n2\n3\n4\nM\na\nx\n \nN\nH\n4-\nN\n \nc\no\nn\nce\nn\ntr\na\ntio\nn\n \n(m\ng.\nl-1\n)\nAverage demand Qair,fine (Nm3\/(m3 aerobic tankvolume.d)) Max NH4-N concentration (mg\/l)\n 592 \nFigure 6: Influence of wastage rate on the total demand for biology aeration (Qair,fine) and the maximum 593 \noccurring effluent NH4-N concentration during the 35-day simulation (Qair,coarse = 42 Nm3.h-1; DO 594 \nsetpoint = 1.25 mg.l-1; recirculation flow = 108 m3.d-1) 595 \n 596 \n0\n5\n10\n15\n20\n25\n30\n35\n1 2 3 4 5 6 7\nRecirculation ratio (-)\nA\nv\ne\nra\nge\n \nN\nO 3\n-\nN\n \nco\nn\nc\ne\nn\ntr\nat\nio\nn\n \n(m\ng.\nl-1\n)\n0\n2\n4\n6\n8\n10\n12\n14\nA\nv\ner\na\nge\n \nPO\n4-\nP \nc\no\nn\nc\nen\ntr\na\ntio\nn\n \n(m\ng.\nl-1\n)\nAverage NO3-N concentration (mg\/l) Average PO4-P concentration (mg\/l)\n 597 \nFigure 7: Influence of recirculation flow rate on the average effluent NO3-N and PO4-P concentrations 598 \nduring the 35-day simulation (Qair,coarse = 42 Nm3.h-1; DO setpoint = 1.25 mg.l-1) 599 \nM\nAN\nUS\nCR\nIP\nT\n \nAC\nCE\nPT\nED\nACCEPTED MANUSCRIPT\n18 \n0\n20\n40\n60\n80\n100\n120\n140\n1 2 3 4 5 6 7\nRecirculation ratio (-)\nA\nv\ner\nag\ne \nde\nm\nan\nd \nfo\nr \nQ a\nir,\nfin\ne \n(N\nm\n3 .\nm\n-\n3 \nae\nro\nbi\nc \nta\nn\nkv\no\nlu\nm\ne.\nd-\n1 )\nAeration demand for SRT = 227 d Aeration demand for SRT = 35.6 d\nAeration demand for SRT = 10 d\nSRT = 227 d\nSRT = 35.6 d\nSRT = 10 d\n 600 \nFigure 8: Influence of recirculation rate and SRT on total demand for Qair,fine (Qair,coarse = 42 Nm3.h-1; DO 601 \nsetpoint = 1.25 mg.l-1) 602 \n 603 \n \n"}