{"doi":null,"coreId":"10443","oai":"oai:eprints.gla.ac.uk:47730","identifiers":["oai:eprints.gla.ac.uk:47730",null],"title":"Do differences in the administrative structure of populations confound comparisons of geographic health inequalities?","authors":["Jackson, A.L.","Davies, C.A.","Leyland, A.H."],"enrichments":{"references":[{"id":586717,"title":"Women and Social-Class - a Methodological Study Comparing Individual, Household, and Census Measures as Predictors of BlackWhite Differences in Reproductive History.","authors":[],"date":"1991","doi":"10.1136\/jech.45.1.35","raw":"Krieger N: Women and Social-Class - a Methodological Study Comparing Individual, Household, and Census Measures as Predictors of BlackWhite Differences in Reproductive History. Journal of Epidemiology and Community Health 1991, 45(1):35-42.","cites":null},{"id":587227,"title":"Class and Health - Should We Be Focusing on Places or People.","authors":[],"date":"1993","doi":"10.1017\/s0047279400019310","raw":"Macintyre S, Maciver S, Sooman A: Area, Class and Health - Should We Be Focusing on Places or People. Journal of Social Policy 1993, 22:213-234.","cites":null},{"id":587228,"title":"Output areas for 2001. The Census Data System Chichester:","authors":[],"date":"2002","doi":null,"raw":"Martin D: Output areas for 2001. The Census Data System Chichester: John Wiley & Sons 2002, 37-46.","cites":null},{"id":587229,"title":"AE: Socioeconomic inequalities in health in 22 European countries.","authors":[],"date":"2008","doi":"10.1056\/nejmsa0707519","raw":"Mackenbach JP, Stirbu I, Roskam AJR, Schaap MM, Menvielle G, Leinsalu M, Kunst AE: Socioeconomic inequalities in health in 22 European countries. New England Journal of Medicine 2008, 358(23):2468-2481.","cites":null},{"id":587230,"title":"SV: Individual and collective bodies: using measures of variance and association in contextual epidemiology.","authors":[],"date":"2009","doi":"10.1136\/jech.2009.088310","raw":"Merlo J, Ohlsson H, Lynch KF, Chaix B, Subramanian SV: Individual and collective bodies: using measures of variance and association in contextual epidemiology. J Epidemiol Community Health 2009, 63(12):1043-1048.","cites":null},{"id":587231,"title":"Multilevel modelling of the geographical distributions of diseases.","authors":[],"date":"1999","doi":"10.1111\/1467-9876.00153","raw":"Langford IH, Leyland AH, Rasbash J, Goldstein H: Multilevel modelling of the geographical distributions of diseases. J R Stat Soc Ser C-Appl Stat 1999, 48:253-268.","cites":null},{"id":587232,"title":"Multilevel Analysis London:","authors":[],"date":null,"doi":null,"raw":"Snijders TAB, Bosker R: Multilevel Analysis London: Sage Publications Ltd","cites":null},{"id":587233,"title":"Increasing inequalities in premature mortality in Great Britain.","authors":[],"date":"2004","doi":"10.1136\/jech.2003.007278","raw":"Leyland AH: Increasing inequalities in premature mortality in Great Britain. Journal of Epidemiology and Community Health 2004, 58(4):296-302.","cites":null},{"id":587575,"title":"Shifting Boundaries, Shifting Results: The Modifiable Areal Unit Problem.","authors":[],"date":"2001","doi":"10.1007\/springerreference_62469","raw":"Oliver L: Shifting Boundaries, Shifting Results: The Modifiable Areal Unit Problem. 2001 [http:\/\/www.geog.ubc.ca\/courses\/geog570\/talks_2001\/ scale_maup.html], Accessed 20 June 2010.","cites":null},{"id":587576,"title":"The modifiable areal unit problem. Geo Books","authors":[],"date":"1984","doi":"10.1007\/springerreference_62469","raw":"Openshaw S: The modifiable areal unit problem. Geo Books Norwich 1984,","cites":null},{"id":639481,"title":"FA: Cause-specific inequalities in mortality in Scotland: two decades of change. A population-based study.","authors":[],"date":"2007","doi":"10.1186\/1471-2458-7-172","raw":"Leyland A, Dundas R, McLoone P, Boddy FA: Cause-specific inequalities in mortality in Scotland: two decades of change. A population-based study. BMC Public Health 2007, 7(1):172.","cites":null},{"id":639482,"title":"Office for National Statistics: Gazetteer of the old and new geographies of the United Kingdom London: Office for National Statistics","authors":[],"date":"1999","doi":null,"raw":"Office for National Statistics: Gazetteer of the old and new geographies of the United Kingdom London: Office for National Statistics 1999.","cites":null},{"id":639483,"title":"The production of an updated set of data zones to incorporate","authors":[],"date":"2001","doi":null,"raw":"Flowerdew R, Graham E, Feng Z: The production of an updated set of data zones to incorporate 2001 census geography and data. University of St Andrews 2004. Pre-publication history The pre-publication history for this paper can be accessed here: http:\/\/www.biomedcentral.com\/1471-2288\/10\/74\/prepub doi:10.1186\/1471-2288-10-74 Cite this article as: Jackson et al.: Do differences in the administrative structure of populations confound comparisons of geographic health inequalities?. BMC Medical Research Methodology 2010 10:74. Submit your next manuscript to BioMed Central and take full advantage of: • Convenient online submission • Thorough peer review • No space constraints or color ﬁgure charges • Immediate publication on acceptance • Inclusion in PubMed, CAS, Scopus and Google Scholar • Research which is freely available for redistribution Submit your manuscript at www.biomedcentral.com\/submit Jackson et al. BMC Medical Research Methodology 2010, 10:74 http:\/\/www.biomedcentral.com\/1471-2288\/10\/74 Page 9 of 9","cites":null},{"id":18089148,"title":"Deprivation indices, population health and geography: An evaluation of the spatial effectiveness of indices at multiple scales.","authors":[],"date":"2007","doi":"10.1007\/s11524-007-9193-3","raw":"Schuurman N, Bell N, Dunn JR, Oliver L: Deprivation indices, population health and geography: An evaluation of the spatial effectiveness of indices at multiple scales. Journal of Urban Health-Bulletin of the New York Academy of Medicine 2007, 84(4):591-603.","cites":null},{"id":18089149,"title":"Geocoding and monitoring of US socioeconomic inequalities in mortality and cancer incidence: Does the choice of area-based measure and geographic level matter? The Public Health Disparities Geocoding Project.","authors":[],"date":"2002","doi":"10.1093\/aje\/kwf068","raw":"Krieger N, Chen JT, Waterman PD, Soobader MJ, Subramanian SV, Carson R: Geocoding and monitoring of US socioeconomic inequalities in mortality and cancer incidence: Does the choice of area-based measure and geographic level matter? The Public Health Disparities Geocoding Project. American Journal of Epidemiology 2002, 156(5):471-482.","cites":null},{"id":18089159,"title":"Achieving data compatability over space and time: create consistent geographical zones.","authors":[],"date":"2003","doi":"10.1002\/ijpg.294","raw":"Norman P, Rees P, Boyle P: Achieving data compatability over space and time: create consistent geographical zones. International Journal of Population Geography 2003, 9(5):365-386.","cites":null},{"id":18089161,"title":"Dorling D: Are socioeconomic inequalities in mortality decreasing or increasing within some British regions? An observational study,","authors":[],"date":"1990","doi":"10.1093\/pubmed\/fdg055","raw":"Rees P, Brown D, Norman P, Dorling D: Are socioeconomic inequalities in mortality decreasing or increasing within some British regions? An observational study, 1990-1998. Journal of Public Health Medicine 2003, 25(3):208-214.","cites":null},{"id":18089163,"title":"Small area inequalities in health: Are we underestimating them? Soc Sci Med","authors":[],"date":"2008","doi":"10.1016\/j.socscimed.2008.05.028","raw":"Stafford M, Duke-Williams O, Shelton N: Small area inequalities in health: Are we underestimating them? Soc Sci Med 2008, 67(6):891-899.","cites":null},{"id":18089165,"title":"DH: The impact of area deprivation on differences in health: does the choice of the geographical classification matter?","authors":[],"date":"2000","doi":null,"raw":"Reijneveld SA, Verheij RA, de Bakker DH: The impact of area deprivation on differences in health: does the choice of the geographical classification matter? Journal of Epidemiology and Community Health 2000, 54(4):306-313.","cites":null},{"id":18089167,"title":"Representation and local democracy: Geographical variations in elector to councillor ratios. Political Geography","authors":[],"date":"2007","doi":"10.1016\/j.polgeo.2006.10.013","raw":"Norman P, Purdam K, Tajar A, Simpson L: Representation and local democracy: Geographical variations in elector to councillor ratios. Political Geography 2007, 26(1):57-77.","cites":null},{"id":18089169,"title":"Organisation: Atlas of Mortality","authors":[],"date":"1997","doi":null,"raw":"World Health Organisation: Atlas of Mortality in Europe: Subnational patterns, 1980\/1981 and 1990\/1991 Scientific publication No 75 1997.","cites":null},{"id":18089170,"title":"Lung cancer mortality in European regions (1955-1997). Ann Oncol","authors":[],"date":"2003","doi":null,"raw":"Borras JA, Fernandez E, Gonzalez JR, Negri E, Lucchini F, La Vecchia C, Levi F: Lung cancer mortality in European regions (1955-1997). Ann Oncol 2003, 14(1):159-161.","cites":null},{"id":18089171,"title":"An Introduction to Medical Statistics Oxford:","authors":[],"date":"1995","doi":"10.1002\/(sici)1097-0258(19971015)16:19<2262::aid-sim659>3.3.co;2-h","raw":"Bland M: An Introduction to Medical Statistics Oxford: Oxford Medical Publications 1995.","cites":null},{"id":18089172,"title":"Health Organization: Measuring Health Inequalities: Gini Coefficient and Concentration Index. Epidemiological Bulletin","authors":[],"date":"2001","doi":null,"raw":"Pan American Health Organization: Measuring Health Inequalities: Gini Coefficient and Concentration Index. Epidemiological Bulletin 2001, 22(1):3-4.","cites":null},{"id":18089173,"title":"On the Measurement of Inequalities in Health.","authors":[],"date":"1991","doi":"10.1016\/0277-9536(91)90212-u","raw":"Wagstaff A, Paci P, Vandoorslaer E: On the Measurement of Inequalities in Health. Social Science & Medicine 1991, 33(5):545-557.","cites":null},{"id":18089174,"title":"Using Gini-Style Indexes to Evaluate the Spatial Patterns of Health Practitioners - Theoretical Considerations and an Application Based on Alberta Data.","authors":[],"date":"1994","doi":"10.1016\/0277-9536(94)90189-9","raw":"Brown MC: Using Gini-Style Indexes to Evaluate the Spatial Patterns of Health Practitioners - Theoretical Considerations and an Application Based on Alberta Data. Social Science & Medicine 1994, 38(9):1243-1256.","cites":null},{"id":18089175,"title":"A: Bayesian measures of model complexity and fit.","authors":[],"date":"2002","doi":"10.1111\/1467-9868.00353","raw":"Spiegelhalter DJ, Best NG, Carlin BR, van der Linde A: Bayesian measures of model complexity and fit. Journal of the Royal Statistical Society Series BStatistical Methodology 2002, 64:583-616.","cites":null},{"id":18089176,"title":"Choosing area based socioeconomic measures to monitor social inequalities in low birth weight and childhood lead poisoning: The Public Health Disparities Geocoding Project (US).","authors":[],"date":"2003","doi":"10.1136\/jech.57.3.186","raw":"Krieger N, Chen JT, Waterman PD, Soobader MJ, Subramanian SV, Carson R: Choosing area based socioeconomic measures to monitor social inequalities in low birth weight and childhood lead poisoning: The Public Health Disparities Geocoding Project (US). Journal of Epidemiology and Community Health 2003, 57(3):186-199.","cites":null},{"id":18089177,"title":"MP: Choice of geographic unit influences socioeconomic inequalities in breast cancer survival.","authors":[],"date":"2005","doi":null,"raw":"Woods LM, Rachet B, Coleman MP: Choice of geographic unit influences socioeconomic inequalities in breast cancer survival. British Journal of Cancer 2005, 92(7):1279-1282.","cites":null},{"id":18089178,"title":"al: Educational inequalities in avoidable mortality in Europe.","authors":[],"date":"2010","doi":"10.1136\/jech.2008.081737","raw":"Stirbu I, Kunst AE, Bopp M, Leinsalu M, Regidor E, Esnaola S, Costa G, Martikainen P, Borrell C, Kalediene R, et al: Educational inequalities in avoidable mortality in Europe. J Epidemiol Community Health 2010.","cites":null},{"id":18089179,"title":"Ecological Correlations and the Behavior of Individuals. American Sociological Review","authors":[],"date":"1950","doi":"10.2307\/2087176","raw":"Robinson WS: Ecological Correlations and the Behavior of Individuals. American Sociological Review 1950, 15:351-357. Jackson et al. BMC Medical Research Methodology 2010, 10:74 http:\/\/www.biomedcentral.com\/1471-2288\/10\/74 Page 8 of 930. Subramanian SV, Jones K, Kaddour A, Krieger N: Revisiting Robinson: The perils of individualistic and ecologic fallacy. International Journal of Epidemiology 2009, 38(2):342-360.","cites":null},{"id":18089180,"title":"Differential mortality - Some comparisons between England and Wales, Finland and France, based on inequality measures.","authors":[],"date":"1990","doi":"10.1093\/ije\/19.4.1001","raw":"Leclerc A, Lert F, Fabien C: Differential mortality - Some comparisons between England and Wales, Finland and France, based on inequality measures. International Journal of Epidemiology 1990, 19(4):1001-1010.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"<p>Background: Geographical health inequalities are naturally described by the variation in health outcomes between areas (e.g. mortality rates). However, comparisons made between countries are hampered by our lack of understanding of the effect of the size of administrative units, and in particular the modifiable areal unit problem. Our objective was to assess how differences in geographic and administrative units used for disseminating data affect the description of health inequalities.<\/p>\\ud\n\\ud\n<p>Methods: Retrospective study of standard populations and deaths aggregated by administrative regions within 20 European countries, 1990-1991. Estimated populations and deaths in males aged 0-64 were in 5 year age bands. Poisson multilevel modelling was conducted of deaths as standardised mortality ratios. The variation between regions within countries was tested for relationships with the mean region population size and the unequal distribution of populations within each country measured using Gini coefficients.<\/p>\\ud\n\\ud\n<p>Results: There is evidence that countries whose regions vary more in population size show greater variation and hence greater apparent inequalities in mortality counts. The Gini coefficient, measuring inequalities in population size, ranged from 0.1 to 0.5 between countries; an increase of 0.1 was accompanied by a 12-14% increase in the standard deviation of the mortality rates between regions within a country.<\/p>\\ud\n\\ud\n<p>Conclusions: Apparently differing health inequalities between two countries may be due to differences in geographical structure per se, rather than having any underlying epidemiological cause. Inequalities may be inherently greater in countries whose regions are more unequally populated.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"BioMed Central","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.gla.ac.uk:47730<\/identifier><datestamp>\n      2016-08-25T11:32:18Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><rioxx xmlns=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/\" xmlns:ali=\"http:\/\/ali.niso.org\/2014\/ali\/1.0\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:dcterms=\"http:\/\/purl.org\/dc\/terms\/\" xmlns:rioxxterms=\"http:\/\/docs.rioxx.net\/schema\/v2.0\/rioxxterms\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/ http:\/\/www.rioxx.net\/schema\/v2.0\/rioxx\/rioxx.xsd\" ><ali:free_to_read>\n    \n      <\/ali:free_to_read><ali:license_ref start_date=\"2010\" >http:\/\/creativecommons.org\/licenses\/by\/3.0<\/ali:license_ref><dc:description><p>Background: Geographical health inequalities are naturally described by the variation in health outcomes between areas (e.g. mortality rates). However, comparisons made between countries are hampered by our lack of understanding of the effect of the size of administrative units, and in particular the modifiable areal unit problem. Our objective was to assess how differences in geographic and administrative units used for disseminating data affect the description of health inequalities.<\/p>\\ud\n\\ud\n<p>Methods: Retrospective study of standard populations and deaths aggregated by administrative regions within 20 European countries, 1990-1991. Estimated populations and deaths in males aged 0-64 were in 5 year age bands. Poisson multilevel modelling was conducted of deaths as standardised mortality ratios. The variation between regions within countries was tested for relationships with the mean region population size and the unequal distribution of populations within each country measured using Gini coefficients.<\/p>\\ud\n\\ud\n<p>Results: There is evidence that countries whose regions vary more in population size show greater variation and hence greater apparent inequalities in mortality counts. The Gini coefficient, measuring inequalities in population size, ranged from 0.1 to 0.5 between countries; an increase of 0.1 was accompanied by a 12-14% increase in the standard deviation of the mortality rates between regions within a country.<\/p>\\ud\n\\ud\n<p>Conclusions: Apparently differing health inequalities between two countries may be due to differences in geographical structure per se, rather than having any underlying epidemiological cause. Inequalities may be inherently greater in countries whose regions are more unequally populated.<\/p><\/dc:description><dc:format>application\/pdf<\/dc:format><dc:identifier>http:\/\/eprints.gla.ac.uk\/47730\/1\/47730.pdf<\/dc:identifier><dc:language>en<\/dc:language><dc:publisher>BioMed Central<\/dc:publisher><dc:source>1471-2288<\/dc:source><dc:title>Do differences in the administrative structure of populations confound comparisons of geographic health inequalities?<\/dc:title><rioxxterms:author>Jackson, A.L.<\/rioxxterms:author><rioxxterms:author>Davies, C.A.<\/rioxxterms:author><rioxxterms:author>Leyland, A.H.<\/rioxxterms:author><rioxxterms:publication_date>2010<\/rioxxterms:publication_date><rioxxterms:type>Journal Article\/Review<\/rioxxterms:type><rioxxterms:version>VoR<\/rioxxterms:version><rioxxterms:version_of_record>http:\/\/dx.doi.org\/10.1186\/1471-2288-10-74<\/rioxxterms:version_of_record><\/rioxx><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":[],"fullText":""}