{"doi":"10.1063\/1.1637717","coreId":"66439","oai":"oai:dro.dur.ac.uk.OAI2:1426","identifiers":["oai:dro.dur.ac.uk.OAI2:1426","10.1063\/1.1637717"],"title":"Influence of alloy composition and interlayer thickness on twist and tilt mosaic in AlxGa1-xN\/AlN\/GaN heterostructures.","authors":["Lafford, T. A.","Parbrook, P. J.","Tanner, B. K."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-12-29","abstract":"High-resolution x-ray diffraction, in surface symmetric, skew symmetric, and grazing incidence in-plane diffraction geometries, has been used to investigate the effect of an AlN interlayer between micron thick GaN and AlxGa1–xN layers grown by metalorganic vapor phase epitaxy on basal plane sapphire. No change is found in the tilt mosaic (threading screw dislocation density) with thickness or Al fraction x of the upper layer. A linear increase in the twist mosaic (threading edge dislocation density) was observed as a function of interlayer thickness and x. For all samples the twist mosaic of the AlGaN was significantly greater, by at least a factor of two, than that of the GaN layer. With increasing interlayer thickness the in-plane lattice parameter of the AlGaN decreased. The results are explained in terms of extra threading edge dislocations resulting from relaxation at the GaN\/AlN interface","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66439.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1426\/1\/1426.pdf","pdfHashValue":"350aff9e66d045a040e3f446ae97bb37e5bd1521","publisher":"American Institute of Physics","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1426<\/identifier><datestamp>\n      2015-08-18T12:47:26Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Influence of alloy composition and interlayer thickness on twist and tilt mosaic in AlxGa1-xN\/AlN\/GaN heterostructures.<\/dc:title><dc:creator>\n        Lafford, T. A.<\/dc:creator><dc:creator>\n        Parbrook, P. J.<\/dc:creator><dc:creator>\n        Tanner, B. K.<\/dc:creator><dc:description>\n        High-resolution x-ray diffraction, in surface symmetric, skew symmetric, and grazing incidence in-plane diffraction geometries, has been used to investigate the effect of an AlN interlayer between micron thick GaN and AlxGa1–xN layers grown by metalorganic vapor phase epitaxy on basal plane sapphire. No change is found in the tilt mosaic (threading screw dislocation density) with thickness or Al fraction x of the upper layer. A linear increase in the twist mosaic (threading edge dislocation density) was observed as a function of interlayer thickness and x. For all samples the twist mosaic of the AlGaN was significantly greater, by at least a factor of two, than that of the GaN layer. With increasing interlayer thickness the in-plane lattice parameter of the AlGaN decreased. The results are explained in terms of extra threading edge dislocations resulting from relaxation at the GaN\/AlN interface.<\/dc:description><dc:subject>\n        Aluminium compounds<\/dc:subject><dc:subject>\n         Gallium compounds<\/dc:subject><dc:subject>\n         III-V semiconductors<\/dc:subject><dc:subject>\n         Wide band gap semiconductors<\/dc:subject><dc:subject>\n         X-ray diffraction<\/dc:subject><dc:subject>\n         Semiconductor heterojunctions<\/dc:subject><dc:subject>\n         Tilt boundaries<\/dc:subject><dc:subject>\n         Twist boundaries<\/dc:subject><dc:subject>\n         MOCVD coatings<\/dc:subject><dc:subject>\n         Vapour phase epitaxial growth<\/dc:subject><dc:subject>\n         Semiconductor growth.<\/dc:subject><dc:publisher>\n        American Institute of Physics<\/dc:publisher><dc:source>\n        Applied physics letters, 2003, Vol.83(26), pp.5434-5436 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2003-12-29<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1426<\/dc:identifier><dc:identifier>\n        issn:0003-6951<\/dc:identifier><dc:identifier>\n        issn: 1077-3118<\/dc:identifier><dc:identifier>\n        doi:10.1063\/1.1637717<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1426\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1063\/1.1637717<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1426\/1\/1426.pdf<\/dc:identifier><dc:rights>\n        © 2003 American Institute of Physics. This article may be downloaded for personal use only. Any other use requires prior permission of the author and the American Institute of Physics. The following article appeared in Lafford, T. A. and Parbrook, P. J. and Tanner, B. K. (2003) 'Influence of alloy composition and interlayer thickness on twist and tilt mosaic in AlxGa1-xN\/AlN\/GaN heterostructures.', Applied physics letters., 83 (26). pp. 5434-5436 and may be found at http:\/\/dx.doi.org\/10.1063\/1.1637717<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":[" 1077-3118","issn:0003-6951","0003-6951","issn: 1077-3118"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2003,"topics":["Aluminium compounds","Gallium compounds","III-V semiconductors","Wide band gap semiconductors","X-ray diffraction","Semiconductor heterojunctions","Tilt boundaries","Twist boundaries","MOCVD coatings","Vapour phase epitaxial growth","Semiconductor growth."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n21 April 2011\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nLafford, T. A. and Parbrook, P. J. and Tanner, B. K. (2003) ’Influence of alloy composition and interlayer\nthickness on twist and tilt mosaic in AlxGa1-xN\/AlN\/GaN heterostructures.’, Applied physics letters., 83\n(26). pp. 5434-5436.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1063\/1.1637717\nPublisher’s copyright statement:\nCopyright (2003) American Institute of Physics. This article may be downloaded for personal use only. Any other use\nrequires prior permission of the author and the American Institute of Physics. Lafford, T. A. and Parbrook, P. J. and\nTanner, B. K. (2003) ’Influence of alloy composition and interlayer thickness on twist and tilt mosaic in\nAlxGa1-xN\/AlN\/GaN heterostructures.’, Applied physics letters., 83 (26). pp. 5434-5436. and may be found at\nhttp:\/\/link.aip.org\/link\/?apl\/83\/5434\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nInfluence of alloy composition and interlayer thickness\non twist and tilt mosaic in AlxGa1ÀxNÕAlNÕGaN heterostructures\nT. A. Lafford\nBede Scientific Instruments Ltd., Belmont Business Park, Durham DH1 1TW, United Kingdom\nP. J. Parbrook\nDepartment of Electrical and Electronic Engineering, University of Sheffield, Mappin Street,\nSheffield S1 3JD, United Kingdom\nB. K. Tanner a)\nDepartment of Physics, University of Durham, South Road, Durham DH1 3LE, United Kingdom\n~Received 21 July 2003; accepted 10 November 2003!\nHigh-resolution x-ray diffraction, in surface symmetric, skew symmetric, and grazing incidence\nin-plane diffraction geometries, has been used to investigate the effect of an AlN interlayer between\nmicron thick GaN and AlxGa12xN layers grown by metalorganic vapor phase epitaxy on basal plane\nsapphire. No change is found in the tilt mosaic ~threading screw dislocation density! with thickness\nor Al fraction x of the upper layer. A linear increase in the twist mosaic ~threading edge dislocation\ndensity! was observed as a function of interlayer thickness and x. For all samples the twist mosaic\nof the AlGaN was significantly greater, by at least a factor of two, than that of the GaN layer. With\nincreasing interlayer thickness the in-plane lattice parameter of the AlGaN decreased. The results are\nexplained in terms of extra threading edge dislocations resulting from relaxation at the GaN\/AlN\ninterface. © 2003 American Institute of Physics. @DOI: 10.1063\/1.1637717#\nCommercially successful nitride devices have been fab-\nricated on GaN buffer layers grown on sapphire, and other\nheteroepitaxial substrates, despite the relatively high disloca-\ntion density in the material. The performance range of these\ndevices can be extended through use of AlGaN buffer layers,\nallowing control of the in-plane lattice parameter while re-\ntaining an ideally low threading dislocation density. One suc-\ncessful method of fabricating AlGaN buffer layers that act as\ntemplates for subsequent device structure growth, without\nthe formation of cracks due the tensile strain between AlGaN\nand GaN,1 is through the use of AlN interlayers. These re-\nlieve the stress between the GaN underlayer and the AlGaN\nlayer on top,2 although some increase in the edge dislocation\ndensity threading through the AlGaN layer was observed.\nThe best device layer growth occurs with the thinnest AlN\ninterlayer for which cracking does not occur. Such inter-\nlayers have been used successfully in Bragg reflector\nmirrors3,4 and solar blind detectors.5\nThe mechanism of stress relief in interlayers is now re-\nceiving significant attention. Bla¨sing et al.6 showed that for\nlow temperature interlayers a thin 100 nm Al0.21Ga0.79N was\ncompressively stressed due to the effect of the interlayer, but\nthat this was reversed at higher interlayer growth tempera-\ntures. They concluded that the lowering of the growth tem-\nperature leads to a decoherence of the growth between the\nGaN underlayer and AlGaN overlayer.\nGrowth of the epilayers used in the present study was\ncarried out using low pressure metalorganic vapor phase ep-\nitaxy in a showerhead reactor. GaN was grown on basal\nplane sapphire substrates using a GaN low temperature\nnucleation layer followed by growth of ;1 mm GaN at\n1035 °C. The temperature was lowered to 600 °C and the\nAlN interlayer deposited. The AlGaN growth ~typically 1\nmm! was carried out at a temperature of 1050 °C. The details\nof the sample structures are given in Table I. Two series of\nsamples were grown. The first had the device buffer of com-\nposition Al0.25Ga0.75N and AlN interlayer thicknesses of\n80 Å<d<220 Å. The second had varying device buffer\ncomposition AlxGa12xN, with 0.16<x<0.46 and constant\nAlN interlayer thickness d5150 Å.\nHigh resolution x-ray diffraction ~HRXRD! measure-\nments were performed on a dual source Bede D1 diffracto-\nmeter using a Cu target Microsource® microfocus generator\nequipped with a polycapillary focusing optic of divergence\n0.17°. Surface-symmetric HRXRD measurements were made\nwith a symmetrically cut Ge 004 beam-conditioning crystal,\ngiving a beam of 2 mm32 mm on the sample. An asym-\nmetrically cut Si 220 analyzer crystal of 12 arcsec accep-\ntance permitted the separation of mosaic tilt from strain.\nSkew-symmetric reflections were used to determine the re-\nlaxation ~by measurement of a and c lattice parameters! of\nthe individual GaN and AlGaN buffer layers. Here, an\nasymmetrically cut Ge 004 beam-conditioner gave an\n;0.3 mm3;2 mm spot on the sample; the same analyzer\ncrystal was again used. The asymmetric Ge beam conditioner\na!Electronic mail: b.k.tanner@durham.ac.uk\nTABLE I. Growth conditions and nominal structure.\nLayer Composition Thickness\nGrowth temperature\n~°C!\nDevice buffer AlxGa12xN ;1 mm 1050\nInterlayer AlN d 600\nGrowth buffer GaN ;1 mm 1035\nNucleation GaN 300 Å\nSubstrate Sapphire ~00.1! - -\nAPPLIED PHYSICS LETTERS VOLUME 83, NUMBER 26 29 DECEMBER 2003\n54340003-6951\/2003\/83(26)\/5434\/3\/$20.00 © 2003 American Institute of Physics\nDownloaded 21 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/about\/rights_and_permissions\nwas also used for grazing incidence in-plane diffraction ~GI-\nIXD! measurements to determine the AlGaN tilt mosaic7,8\nand the in-plane lattice parameter; 0.4° acceptance Soller\nslits were used as an analyzer. Both for GIIXD and HRXRD\ngeometries the instrumental resolution, determined using a\nsingle crystal silicon wafer, was over an order of magnitude\nsmaller than the measured rocking curve widths.\nFigure 1 shows the full width at half height maximum\n~FWHM! of the rocking curve versus interlayer thickness for\nthe first set of samples. In the surface symmetric reflections\nwe resolved the individual Bragg peaks associated with the\nGaN and AlGaN. For both layers, the rocking curves of the\n00.2, 00.4, and 00.6 reflections were of almost identical\nshape and had FWHM within 6% of each other, there being\nno systematic trend with Bragg angle. This indicates that the\nFWHM is dominated by the mosaic spread. For surface sym-\nmetric reflections, the mosaic is pure tilt, associated with\nthreading screw dislocations. Similarly, in the GIIXD mea-\nsurements, the shape and FWHM of the 10.0, 20.0 and 11.0\nrocking curves were almost equal, showing that the FWHM\nhere determines the twist mosaic, associated with threading\nedge dislocations.9 In GIIXD, where the incident beam inci-\ndence angle is below the critical angle for total external re-\nflection, the evanescent wave does not penetrate more than a\nfew nanometers and the 11.0 reflection rocking curve\nFWHM corresponds to the value of the twist mosaic spread\nof the AlGaN buffer. We note in Fig. 1 that the tilt mosaic,\nand hence the threading screw dislocation density, is equal\nfor GaN and AlGaN buffer layers and independent of inter-\nlayer thickness. The twist mosaic of the AlGaN layer in-\ncreases linearly with interlayer thickness and is significantly\nlarger than the tilt mosaic.\nThe rocking curve FWHM versus the AlxGa12xN buffer\nlayer composition in the second series of samples is dis-\nplayed in Fig. 2. Again, the tilt mosaic is equal for the GaN\nand AlGaN layers and is independent of Al fraction in the\nAlGaN layer. There is also no change in the FWHM when\nthe AlGaN is grown at 1080 °C, rather than 1050 °C. The\nFWHM of the 11.0 reflection, and hence twist mosaic, rises\nwith Al fraction and is 3 or 4 times the value of the tilt\nmosaic.\nThe origin of the twist mosaic in the AlGaN must relate\nto the role of the interlayer. A series of skew symmetric\nreflections was taken for the sample with x50.46 and d\n5150 Å to determine the twist mosaic in the buried GaN\nbuffer layer. For this sample, the AlGaN layer is ;0.4 mm\nthick. The high resolution triple axis setting permits the scat-\nter around the reciprocal lattice points associated with the\nGaN and AlGaN layers to be separated and the high inci-\ndence angle permits the GaN peak to be independently ob-\nserved in the rocking curve. However, skew symmetric re-\nflection rocking curves contain contributions from both tilt\nand twist mosaic and it is necessary to extrapolate the\nFWHM values to a skew angle of 90° in order to determine\nthe twist mosaic. This has been done in Fig. 3, using the\nmodel of Srikant et al.10 For the GaN layer, the twist mosaic\nis determined to be 0.16°, comparable with the tilt mosaic\nand much less than the twist mosaic of 0.46° in the corre-\nsponding AlGaN layer. The interlayer appears to add thread-\ning edge dislocations as has been observed using transmis-\nsion electron microscopy by Amano and Akasaki.2\nThe twist mosaic in the GaN buffer layer arises from the\nthreading components of the dislocations associated with the\nlattice mismatch between the nucleation layer and the sap-\nphire substrate. There is initial island growth, with subse-\nquent growth being equivalent to lateral overgrowth. The\ntwist mosaic arises from the coalescence of the islands, giv-\ning blocks of high perfection separated by high dislocation\ndensity cell walls and rotated with respect to each other.\nWhile the interlayer does not affect the tilt mosaic\n~threading screw dislocation density!, there is a linear in-\nFIG. 1. Rocking curve FWHM vs interlayer thickness. Lines are linear least\nsquares ~LLSq! fits.\nFIG. 2. Rocking curve FWHM vs Al fraction in the AlGaN layer. Interlayer\nthickness 150 Å. Lines are LLSq fits.\nFIG. 3. FWHM of skew symmetric reflections from a sample with x\n50.46 and d5150 Å. Solid lines are fits to Srikant’s model with m50 and\nGaussian profiles.\n5435Appl. Phys. Lett., Vol. 83, No. 26, 29 December 2003 Lafford, Parbrook, and Tanner\nDownloaded 21 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/about\/rights_and_permissions\ncrease in twist mosaic with interlayer thickness. There is also\na change in the in-plane lattice parameter of the AlGaN layer\nwith interlayer thickness. From the analyzer peak position in\nthe symmetric 00.2 and in-plane diffraction 11.0 reflections,\nthe a and c lattice parameters as a function of the AlGaN\nlayer thickness ~Fig. 4! can be determined independently of\nthe Al fraction.11 As the interlayer thickness increases, the\nin-plane lattice parameter of the AlGaN layer decreases. It\ntherefore becomes more strained with respect to the underly-\ning AlN interlayer ~assumed to be fully relaxed with respect\nto the GaN buffer!. The variation in strain does not fit well\nthe standard strain relief models, shown by the solid lines in\nFig. 4, but the trend is similar. As observed by Bla¨sing\net al.,6 the AlGaN layer is seen to be compressively strained\nin-plane when the a lattice parameter is plotted against Al\nfraction x ~Fig. 5!. There is a linear fall in lattice parameter\nwith x, and although the gradient is very close to that for\nrelaxed AlxGa12xN there is a shift in absolute values.\nThe increase in twist mosaic in the AlGaN as a function\nof interlayer thickness cannot be associated with an increase\nin threading edge segments from additional misfit disloca-\ntions at the AlN\/AlGaN interface. The additional threading\nedge dislocations appear to originate in the AlN layer. They\ncould be associated with an increase in misfit dislocation\ndensity at the GaN\/AlN interface as the AlN interlayer thick-\nness increases. The best growth then occurs when the AlN\ninterlayer has a minimum number of misfit and threading\nedge dislocations. However, this also corresponds to a maxi-\nmum elastic strain, relieved beyond a critical threshold by\ncracking.\nThe increase in twist mosaic, and thus threading edge\ndislocation density, with increasing Al fraction in the AlGaN\nlayer is less easy to explain. Increase of the Al content for a\nconstant interlayer thickness decreases the lattice mismatch\nwith respect to the AlN interlayer. The higher threading dis-\nlocation density for higher Al fraction therefore does not\nappear to be driven by relaxation between the AlN interlayer\nand the AlGaN layer. It has, however, been observed12 that\nthe surface morphology of the AlGaN layer changes as a\nfunction of the Al fraction. For higher Al content, the rough-\nness correlation length decreases, implying that the size of\nthe growth islands of the AlGaN on the AlN decreases. There\nis also an indication that the roughness amplitude increases\nwith x. However, the increase in FWHM could only be ex-\nplained by reduction of the diffracting domain size if the\nFWHM remained constant in reciprocal space. Our measure-\nments show that the FWHM is constant in angular space.9 If\nthe reduction in domain size results in an increased FWHM,\nthen it must also indicate an increase in the threading edge\ndislocation density associated with the smaller diffracting el-\nement boundaries.\nFinancial support for the GaN MOVPE growth program\nis acknowledged from EPSRC.\n1 R. T. Murray, P. J. Parbrook, and D. A. Wood, J. Mater. Sci. Lett. 22, 113\n~2003!.\n2 H. Amano and I. Akasaki, Opt. Mater. ~Amsterdam, Neth.! 19, 219 ~2002!.\n3 F. Natali, D. Bryne, A. Dussaigne, N. Grandjean, J. Massies, and B.\nDaminterlayerano, Appl. Phys. Lett. 82, 499 ~2003!.\n4 K. E. Waldrip, J. Han, J. J. Fiegel, H. Zhou, E. Makarona, and A. V.\nNurmikko, Appl. Phys. Lett. 78, 3205 ~2001!.\n5 C. Pernot, A. Hirano, M. Iwaya, T. Detchprohm, H. Amano, and I.\nAkasaki, Jpn. J. Appl. Phys., Part 2 39, L387 ~2000!.\n6 J. Bla¨sing, A. Reiher, A. Dadgar, A. Diez, and A. Krost, Appl. Phys. Lett.\n81, 2722 ~2002!.\n7 M. S. Goorsky and B. K. Tanner, Cryst. Res. Technol. 37, 647 ~2002!.\n8 T. A. Lafford, P. A. Ryan, D. E. Joyce, M. S. Goorsky, and B. K. Tanner,\nPhys. Status Solidi A 195, 265 ~2003!.\n9 T. A. Lafford, B. K. Tanner, and P. J. Parbrook, J. Phys. D 36, A245\n~2003!.\n10 V. Srikant, J. S. Speck, and D. R. Clark, J. Appl. Phys. 82, 4286 ~1997!.\n11 D. K. Bowen and B. K. Tanner, High Resolution X-Ray Diffractometry\nand Topography ~Taylor and Francis, London, 1998!, p. 252.\n12 P. J. Parbrook and T. Wang ~unpublished!.\n13 R. Beanland, D. J. Dunstan, and P. J. Goodhew, Adv. Phys. 45, 87 ~1996!.\nFIG. 4. a and c lattice parameters of the AlGaN layer vs interlayer thickness\nt. Solid lines are fits to the strain relief equation y5A2(B\/t), A and B\nbeing constants ~Ref. 13!.\nFIG. 5. In-plane a lattice parameter of the AlGaN layer vs aluminum frac-\ntion x ~interlayer thickness 150 Å!.\n5436 Appl. Phys. Lett., Vol. 83, No. 26, 29 December 2003 Lafford, Parbrook, and Tanner\nDownloaded 21 Apr 2011 to 129.234.252.66. Redistribution subject to AIP license or copyright; see http:\/\/apl.aip.org\/about\/rights_and_permissions\n"}