{"doi":"10.1017\/S000711450784284X","coreId":"102967","oai":"oai:epubs.surrey.ac.uk:2612","identifiers":["oai:epubs.surrey.ac.uk:2612","10.1017\/S000711450784284X"],"title":"UK Food Standards Agency Workshop Report: the effects of the dietary n-6 : n-3 fatty acid ratio on cardiovascular health","authors":["Stanley, JC","El Som, RL","Calder, PC","Griffin, BA","Harris, WS","Jebb, SA","Lovegrove, JA","Moore, CS","Riemersma, RA","Sanders, TAB"],"enrichments":{"references":[{"id":16839053,"title":"Appel LJAmerican Heart Association. Nutrition Committee","authors":[],"date":"2002","doi":null,"raw":"Kris-Etherton PM, Harris WS & Appel LJAmerican Heart Association. Nutrition Committee (2002) Fish consumption, ﬁsh oil, omega-3 fatty acids, and cardiovascular disease. Circulation 106, 2747–2757.","cites":null},{"id":16839040,"title":"Controlled trial of a diet high in unsaturated fat for prevention of atherosclerotic complications. Lancet ii,","authors":[],"date":"1968","doi":"10.1016\/s0140-6736(68)91531-6","raw":"Dayton S, Pearce ML, Goldman H, Hamish A, Plotkin D, Shickman M, Winﬁeld M, Zager A & Dixon W (1968) Controlled trial of a diet high in unsaturated fat for prevention of atherosclerotic complications. Lancet ii, 1060–1062.","cites":null},{"id":16839043,"title":"Controlled trial of soya-bean oil in myocardial infarction. Lancet ii,","authors":[],"date":"1968","doi":"10.1016\/s0140-6736(68)90746-0","raw":"Medical Research Council (1968) Controlled trial of soya-bean oil in myocardial infarction. Lancet ii, 693–699.","cites":null},{"id":16839034,"title":"Conversion of a-linolenic acid in humans is inﬂuenced by the absolute amounts of a-linolenic acid and linoleic acid in the diet, and not by the ratio.","authors":[],"date":"2006","doi":null,"raw":"Goyens PL, Spilker ME, Zock PL, Katan MB & Mensink RP (2006) Conversion of a-linolenic acid in humans is inﬂuenced by the absolute amounts of a-linolenic acid and linoleic acid in the diet, and not by the ratio. Am J Clin Nutr 84, 44–53.","cites":null},{"id":16839060,"title":"Diet could prevent many diseases.","authors":[],"date":"2003","doi":"10.1007\/s11745-003-1066-0","raw":"Lands WE (2003) Diet could prevent many diseases. Lipids 38, 317–321.","cites":null},{"id":16839039,"title":"Diet, serum cholesterol and death from coronary heart disease.","authors":[],"date":"1981","doi":"10.1056\/nejm198101083040201","raw":"Shekelle RB, Shryock AM, Paul O, Lepper M, Stamler J, Liu S & Raynor WJ Jr (1981) Diet, serum cholesterol and death from coronary heart disease. N Eng J Med 304, 65–70.","cites":null},{"id":16839057,"title":"Dietary a-linolenic acid alters tissue fatty acid composition, but not blood lipids, lipoproteins or coagulation status in humans.","authors":[],"date":"1993","doi":"10.1007\/bf02536085","raw":"Kelley DS, Nelson GJ, Love JE, Branch LB, Taylor PC, Schmidt PC, Mackey BE & Iacono JM (1993) Dietary a-linolenic acid alters tissue fatty acid composition, but not blood lipids, lipoproteins or coagulation status in humans. Lipids 28, 533–537.","cites":null},{"id":16839055,"title":"Dietary a-linolenic acid and health-related outcomes: a metabolic perspective.","authors":[],"date":"2006","doi":"10.1079\/nrr2005113","raw":"Burdge GC & Calder PC (2006) Dietary a-linolenic acid and health-related outcomes: a metabolic perspective. Nutr Res Rev 19, 36–52.","cites":null},{"id":16839037,"title":"Dietary fat and risk of coronary heart disease in men: cohort follow up study in the United States.","authors":[],"date":"1996","doi":"10.1136\/bmj.313.7049.84","raw":"Ascherio A, Rimm EB, Giovannucci EL, Spiegelman D, Stampfer M & Willett WC (1996) Dietary fat and risk of coronary heart disease in men: cohort follow up study in the United States. BMJ 313, 84–90.","cites":null},{"id":16839038,"title":"Dietary fat and risk of coronary heart disease in women.","authors":[],"date":"1997","doi":"10.1056\/nejm199711203372102","raw":"Hu FB, Stampfer MJ, Manson JE, Rimm E, Colditz GA, Rosner BA, Hennekens CH & Willett WC (1997) Dietary fat and risk of coronary heart disease in women. N Eng J Med 337, 1491–1499.","cites":null},{"id":16839045,"title":"Dietary fat intake and proinﬂammatory cytokine levels in patients with heart failure.","authors":[],"date":"2005","doi":"10.1016\/j.cardfail.2005.06.434","raw":"Lennie TA, Chung ML, Habash DL & Moser DK (2005) Dietary fat intake and proinﬂammatory cytokine levels in patients with heart failure. J Cardiac Failure 11, 613–618.","cites":null},{"id":16839042,"title":"Dietary prevention of coronary heart disease: the Finnish Mental Hospital Study.","authors":[],"date":"1979","doi":"10.1093\/ije\/12.1.17","raw":"Turpeinen O, Karvonen MJ, Pekkarinen M, Miettinen M, Elosuo R & Paavilainen E (1979) Dietary prevention of coronary heart disease: the Finnish Mental Hospital Study. Int J Epidemiol 8, 99–118.","cites":null},{"id":16839056,"title":"Distribution, interconversion and dose response of n-3 fatty acids in humans.","authors":[],"date":"2006","doi":null,"raw":"Arterburn L, Hall EB & Oken H (2006) Distribution, interconversion and dose response of n-3 fatty acids in humans. Am J Clin Nutr 83, 1467S–1476S.","cites":null},{"id":16839062,"title":"Dose-related effects of eicosapentaenoic acid on innate immune function in healthy humans: a comparison of young and older men.","authors":[],"date":"2006","doi":null,"raw":"Rees D, Miles EA, Banerjee T, Wells SJ, Roynette CE, Wahle KW & Calder PC (2006) Dose-related effects of eicosapentaenoic acid on innate immune function in healthy humans: a comparison of young and older men. Am J Clin Nutr 83, 331–342.","cites":null},{"id":16839068,"title":"Effect of varying the ratio of n-6 to n-3 fatty acids by increasing the dietary intake of a-linolenic acid, eicosapentaenoic acid and docosahexaenoic acid, or both on ﬁbrinogen and clotting factors VII and XII in persons aged 45–70y: The OPTILIP Study.","authors":[],"date":"2006","doi":null,"raw":"Sanders TA, Lewis F, Slaughter S, Grifﬁn BA, Grifﬁn M, Davies I, Millward DJ, Cooper JA & Miller GJ (2006) Effect of varying the ratio of n-6 to n-3 fatty acids by increasing the dietary intake of a-linolenic acid, eicosapentaenoic acid and docosahexaenoic acid, or both on ﬁbrinogen and clotting factors VII and XII in persons aged 45–70y: The OPTILIP Study. Am J Clin Nutr 84, 513–522.","cites":null},{"id":16839050,"title":"Fatty acid composition of serum cholesterol esters, and erythrocyte and platelet membranes as indicators of long-term adherence to fat-modiﬁed diets.","authors":[],"date":"1994","doi":null,"raw":"Sarkkinen ES, Agren JJ, Ahola I, OvaskainenML&UusitupaMI (1994) Fatty acid composition of serum cholesterol esters, and erythrocyte and platelet membranes as indicators of long-term adherence to fat-modiﬁed diets. Am J Clin Nutr 59, 364–370.","cites":null},{"id":16839046,"title":"Habitual dietary intake of n-3 and n-6 fatty acids in relation to inﬂammatory markers among US men and women.","authors":[],"date":"2003","doi":null,"raw":"Pischon T, Hankinson SE, Hotamisligil GS, Rifai N, Willett WC & Rimm EB (2003) Habitual dietary intake of n-3 and n-6 fatty acids in relation to inﬂammatory markers among US men and women. Circulation 108, 155–160.","cites":null},{"id":16839064,"title":"Healthy intakes of n-6 and n-3 fatty acids: estimations considering worldwide diversity.","authors":[],"date":"2006","doi":null,"raw":"Hibbeln JR, Nieminen LR, Blasbalg TL, Riggs JA & Lands WE (2006) Healthy intakes of n-6 and n-3 fatty acids: estimations considering worldwide diversity. Am J Clin Nutr 83, 1483S–1493S.","cites":null},{"id":16839066,"title":"Increased n-6 PUFA intake does not attenuate effects of dietary long chain n-3 PUFA on insulin sensitivity or triacylglycerol reduction in Indian Asians.","authors":[],"date":"2004","doi":null,"raw":"Brady LM, Lovegrove SS, Lesauvage SV, Gower BA, Minihane AM, Williams CM & Lovegrove JA (2004) Increased n-6 PUFA intake does not attenuate effects of dietary long chain n-3 PUFA on insulin sensitivity or triacylglycerol reduction in Indian Asians. Am J Clin Nutr 79, 983–991.","cites":null},{"id":16839036,"title":"Interplay between different polyunsaturated fatty acids and risk of coronary heart disease in men.","authors":[],"date":"2005","doi":null,"raw":"Mozaffarian D, Ascherio A, Hu FB, Stampfer MJ, Willett WC, Siscovick DS & Rimm EB (2005) Interplay between different polyunsaturated fatty acids and risk of coronary heart disease in men. Circulation 111, 157–164.","cites":null},{"id":16839051,"title":"Kinetics of the incorporation of dietary fatty acids into serum cholesteryl esters, erythrocyte membranes, and adipose tissue: an 18-month controlled study.","authors":[],"date":"1997","doi":null,"raw":"Katan MB, Deslypere JP, van Birgelen AP, Penders M & Zegwaard M (1997) Kinetics of the incorporation of dietary fatty acids into serum cholesteryl esters, erythrocyte membranes, and adipose tissue: an 18-month controlled study. J Lipid Res 38, 2012–2022.","cites":null},{"id":16839065,"title":"Lack of effect of dietary n-6:n-3 PUFA ratio on plasma lipid and markers of insulin response in Indian Asians.","authors":[],"date":"2005","doi":"10.1007\/s00394-004-0488-9","raw":"Minihane AM, Brady LM, Lovegrove SS, Lesauvage SV, Williams CM & Lovegrove JA (2005) Lack of effect of dietary n-6:n-3 PUFA ratio on plasma lipid and markers of insulin response in Indian Asians. Eur J Nutr 44, 26–32.","cites":null},{"id":16839070,"title":"Long-chain n-3 polyunsaturated fatty acids in plasma in British meat-eating, vegetarian, and vegan men.","authors":[],"date":"2005","doi":null,"raw":"Rossell MS, Lloyd-Wright Z, Appleby PN, Sanders TA, Allen NE & Key TJ (2005) Long-chain n-3 polyunsaturated fatty acids in plasma in British meat-eating, vegetarian, and vegan men. Am J Clin Nutr 82, 327–334.","cites":null},{"id":16839069,"title":"Maintenance of lower proportions of (n-6) eicosanoid precursors in phospholipids of human plasma in response to added dietary (n-3) fatty acids.","authors":[],"date":"1992","doi":"10.1016\/0925-4439(92)90063-s","raw":"Lands WE, Libelt B, Morris A, Kramer NC, Prewitt TE, Bowen P, Schmeisser D, Davidson MH & Burns JH (1992) Maintenance of lower proportions of (n-6) eicosanoid precursors in phospholipids of human plasma in response to added dietary (n-3) fatty acids. Biochim Biophys Acta 1180, 147–162.","cites":null},{"id":16839052,"title":"n-3 Fatty acids and cardiovascular disease: evidence explained and mechanisms explored.","authors":[],"date":"2004","doi":"10.1042\/cs20040119","raw":"Calder PC (2004) n-3 Fatty acids and cardiovascular disease: evidence explained and mechanisms explored. Clin Sci 107, 1–11.","cites":null},{"id":16839054,"title":"n-3 Fatty acids from ﬁsh or ﬁsh-oil supplements, but not a-linolenic acid, beneﬁt cardiovascular disease outcomes in primary- and secondary-prevention studies: a systematic review.","authors":[],"date":"2006","doi":null,"raw":"Wang C, Harris WS, Chung M, Lichtenstein AH, Balk EM, Kupelnick B, Jordan HS & Lau J (2006) n-3 Fatty acids from ﬁsh or ﬁsh-oil supplements, but not a-linolenic acid, beneﬁt cardiovascular disease outcomes in primary- and secondary-prevention studies: a systematic review. Am J Clin Nutr 84, 5–17.","cites":null},{"id":16839063,"title":"n-3 Polyunsaturated fatty acids, inﬂammation and inﬂammatory diseases.","authors":[],"date":"2006","doi":"10.1037\/12065-004","raw":"Calder PC (2006) n-3 Polyunsaturated fatty acids, inﬂammation and inﬂammatory diseases. Am J Clin Nutr 83, Suppl. 6, 1505S–1519S.","cites":null},{"id":16839071,"title":"Oily ﬁsh reduces plasma triacylglycerols: a primary prevention study in overweight men and women.","authors":[],"date":"2006","doi":"10.1016\/j.nut.2006.07.005","raw":"Moore CS, Bryant SP, Mishra GD, Krebs JD, Browning LM, Miller GJ & Jebb SA (2006) Oily ﬁsh reduces plasma triacylglycerols: a primary prevention study in overweight men and women. Nutrition 22, 1012–1024. J. C. Stanley et al. 1310 B r i t i s h J o u r n a l o f N u t r i t i o n","cites":null},{"id":16839044,"title":"Reduced or modiﬁed dietary fat for preventing cardiovascular disease The Cochrane Database of Systematic Reviews","authors":[],"date":"2000","doi":"10.1002\/14651858.cd002137","raw":"Hooper L, Summerbell CD, Higgins JP, Thompson RL, Clements G, Capps N, Davey S, Riemersma RA & Ebrahim S (2000) Reduced or modiﬁed dietary fat for preventing cardiovascular disease The Cochrane Database of Systematic Reviews 2000, CD002137. http:\/\/www.mrw.interscience.wiley. com\/cochrane\/clsysrev\/articles\/CD002137\/frame.html","cites":null},{"id":16839035,"title":"Relation between dietary linolenic acid and coronary artery disease in the National Heart, Lung, and Blood Institute Family Heart Study.","authors":[],"date":"2001","doi":null,"raw":"Djousse L, Pankow JS, Eckfeldt JH, Folsom AR, Hopkins PN, Province MA, Hong Y & Ellison RC (2001) Relation between dietary linolenic acid and coronary artery disease in the National Heart, Lung, and Blood Institute Family Heart Study. Am J Clin Nutr 74, 612–619.","cites":null},{"id":16839047,"title":"Relationship of plasma polyunsaturated fatty acids to circulating inﬂammatory markers.","authors":[],"date":"2006","doi":"10.1210\/jc.2005-1303","raw":"FerrucciL,CherubiniA,BandinelliS,BartaliB,CorsiA,Lauretani F, Martin A, Andres-Lacueva C, Senin U & Guralnik JM (2006) Relationship of plasma polyunsaturated fatty acids to circulating inﬂammatory markers. J Clin Endocrinol Metab 91,439–446.","cites":null},{"id":16839058,"title":"Supplementing lactating women with ﬂaxseed oil does not increase docosahexaenoic acid in their milk.","authors":[],"date":"2003","doi":null,"raw":"Francois CA, Connor SL, Bolewicz LC & Connor WE (2003) Supplementing lactating women with ﬂaxseed oil does not increase docosahexaenoic acid in their milk. Am J Clin Nutr 77, 226–233.","cites":null},{"id":16839067,"title":"The effects of altering the ratio of dietary n-6\/n-3 fatty acids on insulin sensitivity, lipoprotein size and postprandial lipemia in men and postmenopausal women aged 45 to 70 years: The OPTILIP Study.","authors":[],"date":"2006","doi":null,"raw":"Grifﬁn MD, Sanders TA, Davies IG, Morgan LM, Millward DJ, Lewis F, Slaughter S, Cooper JA, Miller GJ & Grifﬁn BA (2006) The effects of altering the ratio of dietary n-6\/n-3 fatty acids on insulin sensitivity, lipoprotein size and postprandial lipemia in men and postmenopausal women aged 45 to 70 years: The OPTILIP Study. Am J Clin Nutr 84, 1290–1298.","cites":null},{"id":16839061,"title":"The omega-3 index: a new risk factor for death from coronary heart disease?","authors":[],"date":"2004","doi":"10.1016\/j.ypmed.2004.02.030","raw":"Harris WS & von Schacky C (2004) The omega-3 index: a new risk factor for death from coronary heart disease? Prev Med 39, 212–220.","cites":null},{"id":16839033,"title":"The omega-6\/omega-3 fatty acid ratio and cardiovascular disease risk: uses and abuses.","authors":[],"date":"2006","doi":"10.1007\/s11883-006-0019-7","raw":"Harris WS (2006) The omega-6\/omega-3 fatty acid ratio and cardiovascular disease risk: uses and abuses. Curr Atheroscler Rep 8, 453–459.","cites":null},{"id":16839041,"title":"The Oslo diet-heart study. Eleven-year report.","authors":[],"date":"1970","doi":"10.1161\/01.cir.42.5.935","raw":"Leren P (1970) The Oslo diet-heart study. Eleven-year report. Circulation 42, 935–942.","cites":null},{"id":16839048,"title":"Tissue omega-6\/ omega-3 fatty acid ratio and risk for coronary heart disease.","authors":[],"date":"2006","doi":"10.1016\/j.amjcard.2005.12.023","raw":"Harris WS, Assaad B & Poston WC (2006) Tissue omega-6\/ omega-3 fatty acid ratio and risk for coronary heart disease. Am J Cardiol 98, 19i–26i.","cites":null},{"id":16839049,"title":"Total fat intake modiﬁes plasma fatty acid composition in humans.","authors":[],"date":"2001","doi":null,"raw":"Raatz SK, Bibus D, Thomas W & Kris-Etherton P (2001) Total fat intake modiﬁes plasma fatty acid composition in humans. J Nutr 131, 231–234.","cites":null},{"id":16839059,"title":"UK Food Standards Agency a-linolenic acid workshop report.","authors":[],"date":"2002","doi":"10.1079\/bjn2002691","raw":"Sanderson P, Finnegan YE, Williams CM, Calder PC, Burdge GC, Wootton SA, Grifﬁn BA, Millward DJ, Pegge NC & Bemelmans WJ (2002) UK Food Standards Agency a-linolenic acid workshop report. Br J Nutr 88, 573–579.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-12-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"CAMBRIDGE UNIV PRESS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:2612<\/identifier><datestamp>\n      2017-10-31T14:06:01Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6865616C7468616E646D65646963616C:62696F736369656E6365735F6D65646963696E65:6E7574726974696F6E<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/2612\/<\/dc:relation><dc:title>\n        UK Food Standards Agency Workshop Report: the effects of the dietary n-6 : n-3 fatty acid ratio on cardiovascular health<\/dc:title><dc:creator>\n        Stanley, JC<\/dc:creator><dc:creator>\n        El Som, RL<\/dc:creator><dc:creator>\n        Calder, PC<\/dc:creator><dc:creator>\n        Griffin, BA<\/dc:creator><dc:creator>\n        Harris, WS<\/dc:creator><dc:creator>\n        Jebb, SA<\/dc:creator><dc:creator>\n        Lovegrove, JA<\/dc:creator><dc:creator>\n        Moore, CS<\/dc:creator><dc:creator>\n        Riemersma, RA<\/dc:creator><dc:creator>\n        Sanders, TAB<\/dc:creator><dc:publisher>\n        CAMBRIDGE UNIV PRESS<\/dc:publisher><dc:date>\n        2007-12-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/2612\/1\/UK_food_standards_GRIFFIN_07.pdf<\/dc:identifier><dc:identifier>\n          Stanley, JC, El Som, RL, Calder, PC, Griffin, BA, Harris, WS, Jebb, SA, Lovegrove, JA, Moore, CS, Riemersma, RA and Sanders, TAB  (2007) UK Food Standards Agency Workshop Report: the effects of the dietary n-6 : n-3 fatty acid ratio on cardiovascular health   BRITISH JOURNAL OF NUTRITION, 98 (6).  pp. 1305-1310.      <\/dc:identifier><dc:relation>\n        http:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=1451932<\/dc:relation><dc:relation>\n        10.1017\/S000711450784284X<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/2612\/","http:\/\/journals.cambridge.org\/action\/displayAbstract?fromPage=online&aid=1451932","10.1017\/S000711450784284X"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Workshop Report\nUK Food Standards Agency Workshop Report: the effects of the dietary\nn-6:n-3 fatty acid ratio on cardiovascular health\nJohn C. Stanley1,2*, Rachel L. Elsom3, Philip C. Calder4, Bruce A. Griffin5, William S. Harris6, Susan\nA. Jebb7, Julie A. Lovegrove8, Carmel S. Moore7, Rudolph A. Riemersma9 and Tom A. B. Sanders10\n1Trinity College and St Hugh’s College, Oxford, UK\n2Lincoln Edge Nutrition, The Cottage, Sleaford Road, Wellingore, Lincoln LN5 0HR, UK\n3Nutrition Division, Food Standards Agency, London, UK\n4Institute of Human Nutrition, School of Medicine, University of Southampton, Southampton, UK\n5Centre for Nutrition and Food Safety, School of Biomedical and Life Sciences, University of Surrey, Guildford, UK\n6Institute of Nutrition and Metabolic Disease, South Dakota Health Research Foundation, Sioux Falls, South Dakota, USA\n7MRC Human Nutrition Research, Elsie Widdowson Laboratory, Cambridge, UK\n8Hugh Sinclair Unit of Human Nutrition, School of Food Biosciences, University of Reading, Reading, UK\n9Centre for Cardiovascular Science, The Queen’s Medical Research Institute, University of Edinburgh, Edinburgh, UK\n10Nutritional Sciences Division, King’s College London, London, UK\n(Received 3 September 2007 – Revised 10 September 2007 – Accepted 11 September 2007)\nThis report summarises a workshop convened by the UK Food Standards Agency (FSA) on 11 September 2006 to review the results of\nthree FSA-funded studies and other recent research on effects of the dietary n-6:n-3 fatty acid ratio on cardiovascular health. The\nobjective of this workshop was to reach a clear conclusion on whether or not it was worth funding any further research in this area. On\nthe basis of this review of the experimental evidence and on theoretical grounds, it was concluded that the n-6:n-3 fatty acid ratio is\nnot a useful concept and that it distracts attention away from increasing absolute intakes of long-chain n-3 fatty acids which have\nbeen shown to have beneficial effects on cardiovascular health. Other markers of fatty acid intake, that more closely relate to physiological\nfunction, may be more useful.\nPolyunsaturated fatty acids: Cardiovascular disease: Fish oil\nThe UK Food Standards Agency (FSA) convened a work-\nshop on 11 September 2006 to review the results of three\nFSA-funded studies and other recent research on effects of\nthe dietary n-6:n-3 fatty acid ratio on cardiovascular health.\nThe objective of this workshop was to reach a clear con-\nclusion on whether or not it was worth funding any further\nresearch in this area. Professors Bill Harris and Philip\nCalder presented overviews of the literature in order to set\nthe scene. These two general presentations were followed\nby three specific presentations, given by Dr Julie Lovegrove,\nProfessor Tom Sanders and Dr Carmel Moore, each of which\nfocused on the results from an individual FSA-funded pro-\nject. The presentations were followed by a general discussion\nof the scientific issues raised. The workshop was chaired by\nProfessor Rudolph Riemersma.\nUses and abuses of the n-6:n-3 fatty acid ratio\nProfessor Bill Harris presented his theoretical concerns with\nthe n-6:n-3 fatty acid ratio and then discussed the experimen-\ntal evidence for the usefulness of the ratio(1). Three theoretical\nconcerns with the n-6:n-3 fatty acid ratio were identified. First,\ndepending on how the proportion of n-6 fatty acids changed,\nthe proportion of n-3 fatty acids could decrease, remain\nunchanged or increase and still lead to a lowering of the\nn-6:n-3 fatty acid ratio. This would be a concern as the phys-\niological effects of a decrease, no change or an increase in the\nproportion of n-3 fatty acids are likely to be very different. A\nsecond concern with the n-6:n-3 fatty acid ratio, as frequently\nused, is its failure to distinguish between the n-3 fatty acids\na-linolenic acid (ALA), EPA and DHA or the n-6 fatty\n*Corresponding author: Dr J. C. Stanley, fax þ 44 1865 279911, email john.stanley@trinity.oxford.ac.uk\nAbbreviations: AA, arachidonic acid; ALA, a-linolenic acid; FSA, Food Standards Agency; LA, linoleic acid; VLC, very-long-chain.\nBritish Journal of Nutrition (2007), 98, 1305–1310 doi: 10.1017\/S000711450784284X\nq Food Standards Agency 2007\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\nacids linoleic acid (LA) and arachidonic acid (AA). It is well\nestablished that the effects of the 18-carbon n-3 fatty acids on,\nfor example, TAG lowering are very different from those of\nthe 20- or 22-carbon n-3 fatty acids. A third concern is that\nthe ratio assumes that both higher levels of n-6 fatty acids\nand lower levels of n-3 fatty acids increase cardiovascular\nrisk. This is not likely to be the case, as higher levels of\nboth n-6 and n-3 fatty acids are associated with reduced cardi-\novascular risk (see below).\nThe basis of the alleged in vivo antagonism between n-6 and\nn-3 fatty acids is the competition between the two classes of\nfatty acid for metabolism by D6-desaturase. If this competition\noccurs in vivo, then increasing dietary LA should result in\nincreased production of AA, which will compete with EPA\nfor incorporation into membrane phospholipids. As a result\nmore AA might be available for metabolism by either the\ncyclo-oxygenase or lipoxygenase enzymes into a variety of\neicosanoids. Since eicosanoids derived from AA tend to be\nmore potent stimulators of platelet aggregation and inflam-\nmation than eicosanoids derived from EPA, then a high diet-\nary LA intake should encourage a pro-inflammatory and\npro-aggregatory state. Although this is a clear potential bio-\nchemical mechanism for opposing actions of n-6 and n-3\nfatty acids, a crucial question is whether there is any exper-\nimental evidence in adults consuming mixed diets for vari-\nations in the dietary n-6:n-3 fatty acid ratio having the\npredicted physiological effects.\nOne prediction of the hypothesis is that a high n-6:n-3 fatty\nacid ratio in the diet would inhibit the conversion of ALA to\nEPA. This prediction has been tested recently in human sub-\njects(2). Twenty-nine healthy volunteers ate a control diet\nwith an n-6:n-3 fatty acid ratio of 19:1 for 4 weeks. The sub-\njects were then randomised to receive two diets for 6 weeks\nwith the same n-6:n-3 fatty acid ratio (7:1) designed by\neither reducing LA while keeping ALA constant or by increas-\ning ALA while keeping LA constant. At the end of each\nperiod the conversion of [U-13C]ALA to EPA and DHA was\nmeasured. By comparison with the control diet, the rate of\nconversion did not change in the low LA group in which\nALA was kept constant but increased when dietary ALA\nincreased without changing LA. Thus the amounts of ALA\nand LA in the diet, but not the n-6:n-3 fatty acid ratio, deter-\nmine ALA conversion to EPA. The hypothesis predicted that\nrates of conversion of ALA should have decreased in response\nto a high n-6:n-3 ratio.\nA second prediction of the hypothesis is that high intakes of\nn-6 fatty acids should be associated with high risk of CVD and\nshould antagonise effects of n-3 fatty acids. This prediction is\nnot supported by the results of either epidemiological studies\nor randomised controlled trials. In the National Heart, Lung\nand Blood Institute Family Heart Study high intakes of ALA\nor LA were both associated with low risk of CVD in a\ncross-sectional study(3). In the Health Professionals Follow-\nup Study the LA content of the diet had no effect on the ability\nof long-chain n-3 fatty acids or ALA to lower the risk of\nsudden cardiac death(4). The Health Professionals Follow-up\nStudy also showed that intakes of LA were inversely associ-\nated with CHD risk in men(5) and the Nurses’ Health Study\nshowed the same association in women(6). In the Western\nElectric Study intakes of PUFA were inversely associated\nwith risk of death from CHD(7). The results of randomised\ncontrolled trials do not support the second prediction either.\nFour trials have demonstrated that increasing the intake of\nLA lowers the risk of total cardiovascular events(8–11). In\naddition, a systematic review of primary and secondary pre-\nvention trials where SFA were replaced by PUFA showed a\nreduction in coronary events with a non-significant trend for\na reduction in all-cause mortality(12).\nA third prediction of the hypothesis is that a high n-6:n-3 fatty\nacid ratio in the diet should elevate markers of inflammation.\nThree studies have been published on the relationship between\nthe level of inflammatory markers and either plasma levels or\ndietary intakes of n-3 or n-6 fatty acids. In one study it was\nfound that higher intakes of PUFA (about 90% n-6) or n-3\nfatty acids were both associated with lower levels of two soluble\nreceptors of TNF-a(13). A second study confirmed the inverse\nrelationship between intakes of EPA þ DHA and the plasma\nlevels of the two soluble receptors for TNF-a but a relationship\nwas not demonstrated for n-6 fatty acid intake(14). A third epide-\nmiological study looked at the relationship between plasma\nlevels of fatty acids and a variety of inflammatory markers(15).\nSeveral statistically significant associations were found, but in\neach case, the long-chain n-6 and the n-3 fatty acids were related\nto inflammatory markers in the same way. Hence there is no evi-\ndence that n-6 fatty acids elevate markers of inflammation. On\nthe contrary, they appear to be directly associated with anti-\ninflammatory states, as are the n-3 fatty acids.\nThe hypothesis also predicts that if cases of CHD and con-\ntrols are compared then serum levels of n-6 fatty acids should\nbe higher and serum levels of n-3 fatty acids should be lower\nin the cases than in the controls. Thirteen such studies have\nrecently been reviewed and it was found that serum\nEPA þ DHA was significantly lower in the cases than in the\ncontrols as predicted(16). However, contrary to the hypothesis,\nserum or tissue AA levels also tended to be lower in the cases\nthan in the controls.\nA final prediction of the hypothesis is that lowering dietary\nintake of LA should decrease tissue AA levels which would\nthen allow EPA to more effectively compete with AA for\nmetabolism and the subsequent production of less potent eico-\nsanoids would be greater. However, it was found that the pro-\nportion of AA in plasma phospholipids tended to be lower in\nresponse to a diet containing 12% of energy as LA than to one\ncontaining only 6%(17). In a second study in which diets con-\ntaining four different levels of LA were fed it was found that\nneither erythrocyte nor platelet AA was related to the LA con-\ntent of the diet(18). While the tissue content of AA cannot be\nlowered by lowering the LA content of the diet (except in\nfrank LA deficiency states) it can be readily lowered by\nincreasing the EPA þ DHA content of the diet. Thus\nincreasing the intake of very-long-chain (VLC) n-3 PUFA\n(i.e. EPA þ DHA) by 1, 2 or 3 g\/d lowered the erythrocyte\ncontent of n-6 highly unsaturated fatty acids by 26, 39 and\n48% respectively(19). Thus increasing the intake of n-3 fatty\nacids is a more effective way of lowering tissue AA content\nthan decreasing the intake of n-6 fatty acids.\nOn the basis of this review of the experimental evidence\nand on theoretical grounds, Professor Harris concluded that\nthe n-6:n-3 fatty acid ratio is not a useful concept and that it\ndistracts attention away from increasing absolute intakes of\nVLC n-3 fatty acids which have been shown to have beneficial\neffects on cardiovascular health(20–22).\nJ. C. Stanley et al.1306\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\nMeaning and usefulness of the n-6:n-3 fatty acid ratio\nProfessor Philip Calder discussed the meaning and usefulness\nof the n-6:n-3 fatty acid ratio. He opened with the contention\nthat the n-6:n-3 fatty acid ratio is potentially useful because of\nthe competition between LA and ALA for metabolism by D6-\ndesaturase. As a result, the ratio may say something about the\nrelative rates of metabolism of the two fatty acids in vivo. In\nthe absence of high intakes of oily fish and fish oil supplemen-\ntation the dietary n-6:n-3 fatty acid ratio approximates the\ndietary LA:ALA ratio, as LA makes up about 95% of the\nn-6 fatty acid intake and ALA about 90% n-3 fatty acid intake.\nFour assumptions that are frequently made about the n-6:n-3\nfatty acid ratio were highlighted. First, that all ways of chan-\nging the ratio are equivalent. Second, that a decrease in the\nratio will, by definition, be beneficial. Third, that changing\nthe ratio will have a physiological impact. Fourth, that the\nratio can be used when n-6 and n-3 PUFA other than LA and\nALA are consumed in the diet in significant amounts.\nThere are many ways of arriving at the same ratio either\nby changing LA intake and keeping ALA intake constant, or\nby keeping LA intake constant and changing ALA intake,\nor by changing both LA and ALA intakes. Experiments car-\nried out by Goyens et al.(2) clearly demonstrate that using\ndifferent strategies to change the ratio can produce different\nresults in terms of LA and ALA metabolism and the fatty\nacid composition changes observed in target pools. Thus,\nnot all ways of changing the ratio are equivalent in their effect.\nContrary to assumptions frequently made, a decrease in the\nn-6:n-3 fatty acid ratio is not always beneficial. Although there\nis ample evidence that increasing ALA intake (i.e. decreasing\nthe n-6:n-3 fatty acid ratio) can increase plasma, cell and\ntissue EPA concentrations(23,24), increasing ALA intake does\nnot increase DHA status and may even decrease it(25,26).\nThus, a decrease in the n-6:n-3 fatty acid ratio may not\nalways be beneficial.\nWhile increasing intake of either LA or ALA in place of\nSFA will lower CVD risk, changing the n-6:n-3 fatty acid\nratio of the diet by increasing ALA intake at the expense of\nLA may make very little difference to risk of CVD(22,23,27).\nThus, changing the n-6:n-3 fatty acid ratio may not have\nany physiological impact.\nThere is an increasing tendency to include fatty acids other\nthan LA and ALA in the calculation of the n-6:n-3 fatty acid\nratio of foods or the diet. This assumes that all n-6 fatty acids\nare equivalent and that all n-3 fatty acids are equivalent and\nignores the metabolic rationale that gave rise to the ratio in\nthe first place. The idea that all n-6 fatty acids are physiologi-\ncally equivalent and all n-3 fatty acids, including ALA, EPA\nand DHA, are physiologically equivalent is untenable. Thus,\nadding 2 g ALA to the diet will decrease the n-6:n-3 ratio\nbut the effects on cardiovascular risk will be minimal, whereas\nadding 2 g EPA þ DHA to the diet, which will also decrease\nthe n-6:n-3 ratio, is likely to have an impact on cardiovascular\nrisk. Thus, fatty acids other than LA and ALA should not be\nincluded when calculating the n-6:n-3 fatty acid ratio and, fur-\nthermore, the ratio is of limited usefulness when intake of\nlonger-chain n-3 fatty acids (EPA and DHA) is significant.\nIt was concluded that the dietary n-6:n-3 fatty acid ratio is\nof limited usefulness. However, other markers of fatty acid\nintake that more closely relate to physiological function may\nbe more useful. These alternatives could include n-6 or n-3\nhighly unsaturated fatty acids as a percentage of total highly\nunsaturated fatty acids in plasma, cells or tissues(28) or the\nn-3 index (EPA þ DHA as a prcentage of fatty acids in eryth-\nrocytes)(29), both of which are related to cardiovascular risk.\nFinally, the AA:EPA þ DHA ratio in cells or tissues may be\na useful functional marker(30,31) and disease indicator32).\nn-6:n-3 Polyunsaturated fatty acid ratio in Asians\nDr Julie Lovegrove presented the results of an FSA-funded\nproject on the dietary n-6:n-3 PUFA ratio in UK Asians and\nits relevance to cardiovascular risk and modification by dietary\nmeans. It is known that the prevalence of CVD, type 2 dia-\nbetes and the metabolic syndrome is higher in individuals\nliving in the UK and originating from the Indian subcontinent\nthan it is in European natives(33). However, the reasons for this\nexcess disease risk are unclear. Genetic predisposition and\nenvironmental factors including diet have been proposed as\npossible contributing factors, with low VLC n-3 PUFA\nstatus in the context of a high n-6 PUFA intake hypothesised\nas a potential contributing factor.\nThe results of the project showed that UK Sikh men and\nwomen living in and around the Reading area had a signifi-\ncantly higher platelet membrane phospholipid n-6:n-3 PUFA\nratio and a significantly lower n-3 index compared with\nmatched Europeans(34). This was also reflected in a signifi-\ncantly lower dietary intake of total VLC n-3 PUFA and a sig-\nnificantly higher dietary n-6:n-3 PUFA ratio(34). Following\nsupplementation of the Sikh diet with 2·4 g EPA þ DHA\/d\nfor 12 weeks, the platelet phospholipid n-6:n-3 PUFA ratio\nand n-3 index normalised to levels observed in the matched\nEuropean natives(34). This was accompanied by a significant\nreduction in plasma TAG and apo B-48 concentrations.\nResults from this study suggest that UK Sikhs are very respon-\nsive to VLC n-3 PUFA supplementation irrespective of back-\nground dietary n-6:n-3 PUFA ratio.\nIn another study the intake of dietary n-6 PUFA was\nincreased by the use of specially formulated oils and spreads,\nthereby changing the background dietary n-6:n-3 PUFA ratio.\nUK Sikh men were randomised to follow a diet with an\nn-6:n-3 ratio of 16 or 9 for a 6-week period. It was observed\nthat there were small but significant effects on the platelet phos-\npholipid n-6:n-3 fatty acid ratio and the n-3 index(35). However,\nthis was not associated with changes in insulin sensitivity or\nblood lipid profiles. When both groups were then given a sup-\nplement of 2·4 g EPA þ DHA\/d for a further 6 weeks, in\naddition to the specialised foods, significant reductions in fast-\ning plasma TAG levels were observed in both groups, although\nno differences were observed between the groups. However,\nthe group eating the diet with an n-6:n-3 fatty acid ratio of 16\ndid show a significant reduction in postprandial plasma TAG\nand LDL3 levels not seen in the group eating a diet with an\nn-6:n-3 ratio of 9(36). Hence, the lower background dietary\nn-6:n-3 PUFA ratio did not beneficially modulate the effects\nof EPA þ DHA on plasma TAG levels or other CVD risk\nfactors measured.\nDr Lovegrove concluded that the results of these studies\nprovided little support for the idea that the dietary n-6:n-3\nfatty acid ratio modifies CVD risk.\nDietary n-6:n-3 fatty acid ratio 1307\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\nQuantification of the optimal n-6:n-3 fatty acid ratio\nProfessor Tom Sanders presented the results of an FSA-funded\nproject on the quantification of the optimal n-6:n-3 fatty acid\nratio in the UK diet. This research group carried out a random-\nised controlled trial in older men and postmenopausal women\nwho had a mean 10-year risk of CHD of 18%(37,38). In a ran-\ndomised, parallel design in 258 subjects aged 45–70 years,\nthey compared four diets providing 6% of energy as PUFA\nwith an n-6:n-3 ratio between 5:1 and 3:1 with a control\ndiet that had an n-6:n-3 ratio of 10:1. The diets were enriched\nin ALA, EPA, DHA or EPA þ DHA.\nThe diets enriched in EPA þ DHA significantly increased\nthe proportion of EPA and DHA found in both plasma and\nerythrocyte lipids. The findings were in line with the predic-\ntions of Lands et al.(39). The diets with an n-6:n-3 fatty acid\nratio of about 3:1 containing EPA þ DHA significantly low-\nered both fasting and 3 h postprandial TAG concentrations\nand the proportion of small dense LDL decreased while the\nproportion of HDL2 increased. In women not using hormone\nreplacement therapy, diets enriched in EPA þ DHA signifi-\ncantly increased total and LDL-cholesterol levels. However,\nfasting plasminogen activator inhibitor 1, tissue plasminogen\nactivator, fibrinogen, factors XIIa, VIIc, VIIa and VIIag and\npostprandial factor VIIa were unaffected by diet. Similarly\nthere were no effects of diet on insulin sensitivity, postpran-\ndial NEFA response or postprandial lipoprotein lipase activi-\nties. By contrast, arterial stiffness was significantly lower in\nresponse to the diets enriched in EPA þ DHA although\nthere were no significant effects on blood pressure or endo-\nthelial function. Lowering the n-6:n-3 fatty acid ratio by\nincreasing the intake of EPA þ DHA increased levels of trans-\nforming growth factor b1 and decreased levels of C-reactive\nprotein in comparison with diets enriched in ALA. There\nwere no other significant effects of diet on markers of inflam-\nmation or haemostasis.\nProfessor Sanders concluded that the results of this project\ndo not support the idea that consumption of ALA is equival-\nent to consumption of EPA þ DHA with respect to the\neffects of these fatty acids on CVD risk markers. He also\nconcluded that decreasing the n-6:n-3 ratio to approximately\n3:1 by increasing the intake of EPA and DHA lowers fasting\nand postprandial plasma TAG concentrations in older indi-\nviduals but does not influence haemostatic factors. The\nresults from this study, however, did indicate that the\nintake of LA was a determinant of the proportion of EPA\nand DHA in membrane lipids: the higher the intake of LA\nthe lower the proportion of EPA and DHA. This was in\nagreement with observational data from a comparison of\nvegans, vegetarians and omnivores in the Oxford cohort of\nthe EPIC study(40). Overall, the findings indicate that in the\ncontext of a total PUFA intake of 6% of energy, decreasing\nthe ratio by increasing the intake of VLC n-3 fatty acids to\napproximately 1–1·5 g\/d resulted in potentially beneficial\neffects with regard to cardiovascular risk.\nImpact of changes in the dietary n-6:n-3 polyunsaturated\nfatty acid ratio on risk factors for disease\nDr Carmel Moore presented the results of an FSA-funded\nproject to examine the public health impact of changes in\nthe dietary n-6:n-3 PUFA ratio. This research group carried\nout a randomised controlled trial with a parallel-group\ndesign(41). At baseline there were 142 overweight subjects ran-\ndomly assigned to eat either a control diet or diets containing\ntwo portions of white fish (providing 0·7 g EPA þ DHA\/week)\nor two portions of oily fish (providing 4·5 g EPA þ DHA\/\nweek) each against a background of use of either rapeseed\noil (low LA:ALA) or sunflower-seed oil (high LA:ALA) for\n24 weeks. Dietary n-6:n-3 fatty acid ratios varied between\n6·9:1 and 8·0:1 at baseline and during the intervention were\n7:1 (control), 6:1 (white fish–rapeseed), 11:1 (white fish–sun-\nflower-seed), 4:1 (oily fish–rapeseed) and 6:1 (oily fish–sun-\nflower-seed).\nPlasma levels of EPA and DHA were significantly lower in\nresponse to the white fish diets than in response to either of the\noily fish diets. In addition, plasma TAG levels were signifi-\ncantly lower in the oily fish groups than in the white fish–sun-\nflower-seed oil group(41). Other markers of cardiovascular risk\nincluding insulin sensitivity, other plasma lipids including\ntotal, LDL- and HDL-cholesterol, a variety of markers of hae-\nmostatic and inflammatory status did not differ amongst the\nfive dietary groups.\nDr Moore concluded that two portions of oily fish per week\ncan lead to significant reductions in fasting plasma TAG levels\nin comparison with two portions of white fish per week. There\nwere no effects of the n-6:n-3 fatty acid ratio of the\ndiet although it should be emphasised that this study looked\nat a comparatively narrow range of n-6:n-3 ratios.\nRecommendations\nThe following recommendations were made:\n(1) Based upon theoretical and scientific grounds (described\nearlier), use of the n-6:n-3 fatty acid ratio to estimate\nCVD risk should be abandoned.\n(2) Given the lack of effects of varying the dietary n-6:n-3\nfatty acid ratio on CVD risk factors, further research in\nthis area is unlikely to be fruitful.\n(3) Future research on dietary fatty acids would benefit from\nfocusing on the effects of absolute amounts of individual\nn-6 and VLC n-3 fatty acids on cardiovascular risk fac-\ntors and other physiological outcomes related to risk of\nchronic disease.\n(4) It would be desirable wherever possible to investigate the\neffects of dietary fatty acids on CVD endpoints rather\nthan on risk factors.\n(5) Further studies are needed to identify effects of dietary\nfatty acids on insulin sensitivity as this underlies the\nabnormalities of the metabolic syndrome.\nAttendees\nProfessor Rudolph Riemersma, University of Edinburgh; Pro-\nfessor William Harris, University of South Dakota; Professor\nPhilip Calder, University of Southampton; Dr Julie Lovegrove\nand Dr Parveen Yaqoob, University of Reading; Professor\nTom Sanders and Dr Fiona Lewis, King’s College, London;\nDr Carmel Moore and Dr Susan Jebb, MRC Human Nutrition\nResearch, Cambridge; Dr Judy Buttriss, British Nutrition\nFoundation, London; Dr Jason Gill, University of Glasgow;\nJ. C. Stanley et al.1308\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\nDr Bruce Griffin, University of Surrey; Dr Frank Thies, Uni-\nversity of Aberdeen; Dr John Stanley, Trinity College and St\nHugh’s College, Oxford; Dr Alison Tedstone, Dr Elaine\nStone, Ms Rachel Elsom and Ms Lynda Harrop, Food Stan-\ndards Agency, London, UK.\nReferences\n1. Harris WS (2006) The omega-6\/omega-3 fatty acid ratio and\ncardiovascular disease risk: uses and abuses. Curr Atheroscler\nRep 8, 453–459.\n2. Goyens PL, Spilker ME, Zock PL, Katan MB & Mensink RP\n(2006) Conversion of a-linolenic acid in humans is influenced\nby the absolute amounts of a-linolenic acid and linoleic acid\nin the diet, and not by the ratio. Am J Clin Nutr 84, 44–53.\n3. Djousse L, Pankow JS, Eckfeldt JH, Folsom AR, Hopkins PN,\nProvince MA, Hong Y & Ellison RC (2001) Relation between\ndietary linolenic acid and coronary artery disease in the National\nHeart, Lung, and Blood Institute Family Heart Study. Am J Clin\nNutr 74, 612–619.\n4. Mozaffarian D, Ascherio A, Hu FB, Stampfer MJ, Willett WC,\nSiscovick DS & Rimm EB (2005) Interplay between different\npolyunsaturated fatty acids and risk of coronary heart disease\nin men. Circulation 111, 157–164.\n5. Ascherio A, Rimm EB, Giovannucci EL, Spiegelman D, Stamp-\nfer M & Willett WC (1996) Dietary fat and risk of coronary\nheart disease in men: cohort follow up study in the United\nStates. BMJ 313, 84–90.\n6. Hu FB, Stampfer MJ, Manson JE, Rimm E, Colditz GA,\nRosner BA, Hennekens CH & Willett WC (1997) Dietary fat\nand risk of coronary heart disease in women. N Eng J Med\n337, 1491–1499.\n7. Shekelle RB, Shryock AM, Paul O, Lepper M, Stamler J, Liu S\n& Raynor WJ Jr (1981) Diet, serum cholesterol and death from\ncoronary heart disease. N Eng J Med 304, 65–70.\n8. Dayton S, Pearce ML, Goldman H, Hamish A, Plotkin D,\nShickman M, Winfield M, Zager A & Dixon W (1968) Con-\ntrolled trial of a diet high in unsaturated fat for prevention of\natherosclerotic complications. Lancet ii, 1060–1062.\n9. Leren P (1970) The Oslo diet-heart study. Eleven-year report.\nCirculation 42, 935–942.\n10. Turpeinen O, Karvonen MJ, Pekkarinen M, Miettinen M,\nElosuo R & Paavilainen E (1979) Dietary prevention of coron-\nary heart disease: the Finnish Mental Hospital Study. Int J\nEpidemiol 8, 99–118.\n11. Medical Research Council (1968) Controlled trial of soya-bean\noil in myocardial infarction. Lancet ii, 693–699.\n12. Hooper L, Summerbell CD, Higgins JP, Thompson RL,\nClements G, Capps N, Davey S, Riemersma RA & Ebrahim S\n(2000) Reduced or modified dietary fat for preventing\ncardiovascular disease The Cochrane Database of Systematic\nReviews 2000, CD002137. http:\/\/www.mrw.interscience.wiley.\ncom\/cochrane\/clsysrev\/articles\/CD002137\/frame.html\n13. Lennie TA, Chung ML, Habash DL & Moser DK (2005) Diet-\nary fat intake and proinflammatory cytokine levels in patients\nwith heart failure. J Cardiac Failure 11, 613–618.\n14. Pischon T, Hankinson SE, Hotamisligil GS, Rifai N, Willett WC\n& Rimm EB (2003) Habitual dietary intake of n-3 and n-6 fatty\nacids in relation to inflammatory markers among US men and\nwomen. Circulation 108, 155–160.\n15. Ferrucci L,CherubiniA,Bandinelli S, Bartali B,Corsi A, Lauretani\nF, Martin A, Andres-Lacueva C, Senin U & Guralnik JM (2006)\nRelationship of plasma polyunsaturated fatty acids to circulating\ninflammatory markers. J Clin Endocrinol Metab 91, 439–446.\n16. Harris WS, Assaad B & Poston WC (2006) Tissue omega-6\/\nomega-3 fatty acid ratio and risk for coronary heart disease.\nAm J Cardiol 98, 19i–26i.\n17. Raatz SK, Bibus D, Thomas W & Kris-Etherton P (2001) Total\nfat intake modifies plasma fatty acid composition in humans.\nJ Nutr 131, 231–234.\n18. Sarkkinen ES, Agren JJ, Ahola I, OvaskainenML&UusitupaMI\n(1994) Fatty acid composition of serum cholesterol esters, and\nerythrocyte and platelet membranes as indicators of long-term\nadherence to fat-modified diets. Am J Clin Nutr 59, 364–370.\n19. Katan MB, Deslypere JP, van Birgelen AP, Penders M &\nZegwaard M (1997) Kinetics of the incorporation of dietary\nfatty acids into serum cholesteryl esters, erythrocyte mem-\nbranes, and adipose tissue: an 18-month controlled study.\nJ Lipid Res 38, 2012–2022.\n20. Calder PC (2004) n-3 Fatty acids and cardiovascular disease: evi-\ndence explained and mechanisms explored. Clin Sci 107, 1–11.\n21. Kris-Etherton PM, Harris WS & Appel LJAmerican Heart\nAssociation. Nutrition Committee (2002) Fish consumption,\nfish oil, omega-3 fatty acids, and cardiovascular disease.\nCirculation 106, 2747–2757.\n22. Wang C, Harris WS, Chung M, Lichtenstein AH, Balk EM,\nKupelnick B, Jordan HS & Lau J (2006) n-3 Fatty acids\nfrom fish or fish-oil supplements, but not a-linolenic acid, ben-\nefit cardiovascular disease outcomes in primary- and second-\nary-prevention studies: a systematic review. Am J Clin Nutr\n84, 5–17.\n23. Burdge GC & Calder PC (2006) Dietary a-linolenic acid and\nhealth-related outcomes: a metabolic perspective. Nutr Res\nRev 19, 36–52.\n24. Arterburn L, Hall EB & Oken H (2006) Distribution, intercon-\nversion and dose response of n-3 fatty acids in humans. Am J\nClin Nutr 83, 1467S–1476S.\n25. Kelley DS, Nelson GJ, Love JE, Branch LB, Taylor PC,\nSchmidt PC, Mackey BE & Iacono JM (1993) Dietary a-linole-\nnic acid alters tissue fatty acid composition, but not blood lipids,\nlipoproteins or coagulation status in humans. Lipids 28,\n533–537.\n26. Francois CA, Connor SL, Bolewicz LC & Connor WE (2003)\nSupplementing lactating women with flaxseed oil does not\nincrease docosahexaenoic acid in their milk. Am J Clin Nutr\n77, 226–233.\n27. Sanderson P, Finnegan YE, Williams CM, Calder PC, Burdge\nGC, Wootton SA, Griffin BA, Millward DJ, Pegge NC &\nBemelmans WJ (2002) UK Food Standards Agency a-linolenic\nacid workshop report. Br J Nutr 88, 573–579.\n28. Lands WE (2003) Diet could prevent many diseases. Lipids 38,\n317–321.\n29. Harris WS & von Schacky C (2004) The omega-3 index: a new\nrisk factor for death from coronary heart disease? Prev Med 39,\n212–220.\n30. Rees D, Miles EA, Banerjee T, Wells SJ, Roynette CE, Wahle\nKW & Calder PC (2006) Dose-related effects of eicosapentae-\nnoic acid on innate immune function in healthy humans: a com-\nparison of young and older men. Am J Clin Nutr 83, 331–342.\n31. Calder PC (2006) n-3 Polyunsaturated fatty acids, inflammation\nand inflammatory diseases. Am J Clin Nutr 83, Suppl. 6,\n1505S–1519S.\n32. Hibbeln JR, Nieminen LR, Blasbalg TL, Riggs JA & Lands WE\n(2006) Healthy intakes of n-6 and n-3 fatty acids: estimations\nconsidering worldwide diversity. Am J Clin Nutr 83,\n1483S–1493S.\n33. Tillin T, Forouhi N, Johnston DG, McKeigue PM, Chaturvedi N\n& Godsland IF (2005) Metabolic syndrome and coronary\nheart disease in South Asians, African-Caribbeans and white\nEuropeans: a UK population based cross-sectional study.\nDiabetologia 48, 649–656.\nDietary n-6:n-3 fatty acid ratio 1309\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\n34. Lovegrove JA, Lovegrove SS, Lesauvage SV, Brady LM, Saini\nN, Minihane AM & Williams CM (2004) Moderate fish oil sup-\nplementation reverses low platelet membrane long chain n-3\nPUFA status and reduces plasma triacylglycerol concentrations\nin British Sikhs. Am J Clin Nutr 79, 974–982.\n35. Minihane AM, Brady LM, Lovegrove SS, Lesauvage SV,\nWilliams CM & Lovegrove JA (2005) Lack of effect of dietary\nn-6:n-3 PUFA ratio on plasma lipid and markers of insulin\nresponse in Indian Asians. Eur J Nutr 44, 26–32.\n36. Brady LM, Lovegrove SS, Lesauvage SV, Gower BA, Minihane\nAM, Williams CM & Lovegrove JA (2004) Increased n-6 PUFA\nintake does not attenuate effects of dietary long chain n-3 PUFA\non insulin sensitivity or triacylglycerol reduction in Indian\nAsians. Am J Clin Nutr 79, 983–991.\n37. Griffin MD, Sanders TA, Davies IG, Morgan LM, Millward DJ,\nLewis F, Slaughter S, Cooper JA, Miller GJ & Griffin BA\n(2006) The effects of altering the ratio of dietary n-6\/n-3 fatty\nacids on insulin sensitivity, lipoprotein size and postprandial\nlipemia in men and postmenopausal women aged 45 to 70\nyears: The OPTILIP Study. Am J Clin Nutr 84, 1290–1298.\n38. Sanders TA, Lewis F, Slaughter S, Griffin BA, Griffin M,\nDavies I, Millward DJ, Cooper JA & Miller GJ (2006) Effect\nof varying the ratio of n-6 to n-3 fatty acids by increasing the\ndietary intake of a-linolenic acid, eicosapentaenoic acid and\ndocosahexaenoic acid, or both on fibrinogen and clotting factors\nVII and XII in persons aged 45–70 y: The OPTILIP Study. Am J\nClin Nutr 84, 513–522.\n39. Lands WE, Libelt B, Morris A, Kramer NC, Prewitt TE, Bowen\nP, Schmeisser D, Davidson MH & Burns JH (1992) Mainten-\nance of lower proportions of (n-6) eicosanoid precursors in\nphospholipids of human plasma in response to added dietary\n(n-3) fatty acids. Biochim Biophys Acta 1180, 147–162.\n40. Rossell MS, Lloyd-Wright Z, Appleby PN, Sanders TA, Allen\nNE & Key TJ (2005) Long-chain n-3 polyunsaturated fatty\nacids in plasma in British meat-eating, vegetarian, and vegan\nmen. Am J Clin Nutr 82, 327–334.\n41. Moore CS, Bryant SP, Mishra GD, Krebs JD, Browning LM,\nMiller GJ & Jebb SA (2006) Oily fish reduces plasma triacyl-\nglycerols: a primary prevention study in overweight men and\nwomen. Nutrition 22, 1012–1024.\nJ. C. Stanley et al.1310\nB\nri\nti\nsh\nJo\nu\nrn\nal\no\nf\nN\nu\ntr\nit\nio\nn\n"}