{"doi":"10.1111\/j.1365-2915.2008.00726.x","coreId":"62966","oai":"oai:nora.nerc.ac.uk:3192","identifiers":["oai:nora.nerc.ac.uk:3192","10.1111\/j.1365-2915.2008.00726.x"],"title":"Immunomodulatory arsenal of nymphal ticks","authors":["Peterková, K.","Vančová, I.","Hajnická, V.","Slovák, M.","Šimo, L.","Nuttall, P. A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":"Ticks have developed their own immunomodulatory mechanisms to inhibit the host inflammatory response. One of them involves the ability to subvert the cytokine network at the site of tick feeding by secreting cytokine binding molecules. Most studies have focused on the immunomodulatory prowess of adult female ticks. Here we describe anti-cytokine activity in salivary gland extracts (SGEs) prepared from 2-day-fed nymphs of Dermacentor reticulatus Fabricius, Ixodes ricinus L., Rhipicephalus appendiculatus Neumann and Amblyomma variegatum Fabricius. Anti-CXCL8 activity was detected in nymphs of all species. Relatively high activity against CCL2, CCL3 and CCL11 was observed in SGEs of R. appendiculatus and A. variegatum nymphs, whereas SGEs of I. ricinus nymphs showed comparatively high anti-interleukin-2 (-IL-2) and anti-IL-4 activities. These data show that nymphs, which epidemiologically are usually more important than adults as disease vectors, possess a range of anti-cytokine activities that may facilitate pathogen transmission","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/62966.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/3192\/1\/Peterkova2008.pdf","pdfHashValue":"214bf7989cf9563fd890e60de6d41463aa0c1ed6","publisher":"Blackwell","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:3192<\/identifier><datestamp>\n      2014-05-30T11:14:22Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D5335<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3192\/<\/dc:relation><dc:title>\n        Immunomodulatory arsenal of nymphal ticks<\/dc:title><dc:creator>\n        Peterková, K.<\/dc:creator><dc:creator>\n        Vančová, I.<\/dc:creator><dc:creator>\n        Hajnická, V.<\/dc:creator><dc:creator>\n        Slovák, M.<\/dc:creator><dc:creator>\n        Šimo, L.<\/dc:creator><dc:creator>\n        Nuttall, P. A.<\/dc:creator><dc:subject>\n        Biology and Microbiology<\/dc:subject><dc:description>\n        Ticks have developed their own immunomodulatory mechanisms to inhibit the host inflammatory response. One of them involves the ability to subvert the cytokine network at the site of tick feeding by secreting cytokine binding molecules. Most studies have focused on the immunomodulatory prowess of adult female ticks. Here we describe anti-cytokine activity in salivary gland extracts (SGEs) prepared from 2-day-fed nymphs of Dermacentor reticulatus Fabricius, Ixodes ricinus L., Rhipicephalus appendiculatus Neumann and Amblyomma variegatum Fabricius. Anti-CXCL8 activity was detected in nymphs of all species. Relatively high activity against CCL2, CCL3 and CCL11 was observed in SGEs of R. appendiculatus and A. variegatum nymphs, whereas SGEs of I. ricinus nymphs showed comparatively high anti-interleukin-2 (-IL-2) and anti-IL-4 activities. These data show that nymphs, which epidemiologically are usually more important than adults as disease vectors, possess a range of anti-cytokine activities that may facilitate pathogen transmission.<\/dc:description><dc:publisher>\n        Blackwell<\/dc:publisher><dc:date>\n        2008<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/3192\/1\/Peterkova2008.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Peterková, K.; Vančová, I.; Hajnická, V.; Slovák, M.; Šimo, L.; Nuttall, P. A..  2008  Immunomodulatory arsenal of nymphal ticks.   Medical and Veterinary Entomology, 22 (2). 167-171.  https:\/\/doi.org\/10.1111\/j.1365-2915.2008.00726.x <https:\/\/doi.org\/10.1111\/j.1365-2915.2008.00726.x>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.blackwell-synergy.com\/doi\/abs\/10.1111\/j.1365-2915.2008.00726.x<\/dc:relation><dc:relation>\n        doi:10.1111\/j.1365-2915.2008.00726.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/3192\/","http:\/\/www.blackwell-synergy.com\/doi\/abs\/10.1111\/j.1365-2915.2008.00726.x","doi:10.1111\/j.1365-2915.2008.00726.x"],"year":2008,"topics":["Biology and Microbiology"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Medical and Veterinary Entomology (2008) 22, 1–5\n© 2008 The Authors\nJournal compilation © 2008 The Royal Entomological Society 1\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n61\n62\n63\n Feeding ticks stay attached to their hosts for several days or \nweeks, depending on the species and developmental stage. The \nprolonged feeding period provides ample time for inflammation \nto promote haemostasis at the feeding site. Host immune mech-\nanisms may reduce the feeding success of ticks by enhancing \ninflammatory reactions. Ticks have developed mechanisms to \nsubvert the host response, presumably as an adaptation to obtain \nlarger bloodmeals that would result in increased tick fitness. In \nparticular, the saliva of ticks has anti-inflammatory and immu-\nnosuppressive properties ( Brossard & Wikel, 2004 ). \n The host response to foreign antigens requires the co-ordinated \naction of innate and acquired components of the immune system, \nwhich is regulated by small secreted proteins known as cytokines \n( Borish & Steinke, 2003 ). Cytokines are a diverse group of solu-\nble messenger proteins involved in the activation, growth, control \nand repair of cells, and regulation of immune events. Chemok-\nines, a sub-set of cytokines, play an important role in controlling \nleucocyte migration. In previous studies, saliva and\/or salivary \ngland extract (SGE) of ixodid (hard) adult tick species was shown \nto bind numerous cytokines (interleukin-2, IL-4 and some impor-\ntant chemokines) and suppress the activity of immune cells that \nare responsive to their stimulation. Results varied between spe-\ncies, and also between adult males and females of the same spe-\ncies ( Gillespie  et al. , 2001 ;  Hajnická  et al. , 2001, 2005 ). \nManipulation of the host cytokine network by ticks provides a \nmechanism to help ticks feed and may also facilitate tick-borne \npathogen transmission ( Nuttall & Labuda, 2004 ). \n The nymphal stage is often the most important in tick-borne \npathogen transmission. Several studies have shown that nym-\nphal feeding induces changes to host haemostatic and immune \nresponses, with some evidence of differences between nymphs \nand adults ( Brossard & Wikel, 2004 ;  Narasimhan  et al. , 2007 ; \n Pedra  et al. , 2007 ). To determine whether nymphs have immu-\nnomodulatory mechanisms similar to adults, we compared anti-\ncytokine activity in SGEs prepared from nymphs of four ixodid \ntick species,  Dermacentor reticulatus ,  Ixodes ricinus ,  Rhipi-\ncephalus appendiculatus  and  Amblyomma variegatum , all of \nwhich are important vectors of tick-borne pathogens ( De Vos, \n1981; Camus & Barre, 1992 ;  Nambota  et al. , 1994 ;  Hubalek \n et al. , 1997 ;  Labuda & Nuttall, 2004 ;  Foldvari  et al. , 2005 ; \n Kelly, 2006 ;  Sreter-Lancz  et al. , 2006 ;  Skarphedinsson  et al. , \n2007 ). The materials and methods used followed those de-\nscribed in our previous studies with adult ticks (Hajnická  et al. , \n2005;  Van č ová  et al. , 2006 ). \n5\n Immunomodulatory arsenal of nymphal ticks \n K .   P E T E R K OV Á  1  ,   I .   VA N  Č  OV Á  1  ,   V.   H A J N I C K Á  1  ,   M .   S L OV Á K  2  , \n L .   Š  I M O  2   and  P.  A .   N U T TA L L  3  \n \n1\n Department of Xxx , Institute of Virology, Slovak Academy of Sciences, Bratislava, Slovakia ,  2 Department of Xxx , Institute of \nZoology, Slovak Academy of Sciences, Bratislava, Slovakia and  3 Department of Xxx , Centre for Ecology and Hydrology, Oxford, U.K . \n Abstract .  Ticks have developed their own immunomodulatory mechanisms to inhibit \nthe host inflammatory response. One of them involves the ability to subvert the cytokine \nnetwork at the site of tick feeding by secreting cytokine binding molecules. Most studies \nhave focused on the immunomodulatory prowess of adult female ticks. Here we de-\nscribe anti-cytokine activity in salivary gland extracts (SGEs) prepared from 2-day-fed \nnymphs of  Dermacentor reticulatus  Fabricius,  Ixodes ricinus  L.,  Rhipicephalus appen-\ndiculatus  Neumann and  Amblyomma variegatum  Fabricius. Anti-CXCL8 activity was \ndetected in nymphs of all species. Relatively high activity against CCL2, CCL3 and \nCCL11 was observed in SGEs of  R. appendiculatus  and  A. variegatum  nymphs, whereas \nSGEs of  I. ricinus  nymphs showed comparatively high anti-interleukin-2 (-IL-2) and \nanti-IL-4 activities. These data show that nymphs, which epidemiologically are usually \nmore important than adults as disease vectors, possess a range of anti-cytokine activities \nthat may facilitate pathogen transmission. \n Key words .  Cytokine inhibitors ,  Ixodid ticks ,  nymph salivary glands . \n1\n2\n3\n4\n Correspondence:  Professor Pat A. Nuttall, NERC Centre for Ecology and Hydrology, Maclean Building, Benson Lane, Crowmarsh Gifford, \nWallingford, Oxfordshire OX10 8BB, U.K. Tel.: + 44 1491 692560; Fax: + 44 1491 692598; E-mail:  pan@ceh.ac.uk \nM V E 7 2 6 B Dispatch: 02.04.08 Journal: MVEJournal Name Manuscript No.  Author Received: No. of pages: 5 ME: Nagalakshmi\n S H O RT  C O M M U N I C AT I O N \n 2  K. Peterková  et al.\n© 2008 The Authors\nJournal compilation © 2008 The Royal Entomological Society, Medical and Veterinary Entomology, 22, 1–5\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n61\n62\n63\n Nymphs were allowed to feed on rabbits, on which complete \nengorgement takes approximately 5 – 8 days for  D. reticulatus \n nymphs, 3 – 6  days for  I. ricinus , 5 – 9  days for  R. appendiculatus , \nand 5 – 9  days for  A. variegatum  ( Honzáková, 1971 ;  Jones \n et al. , 1988 ). As anti-cytokine activity of ixodid species is most \nconsistently detected after feeding commences but prior to en-\ngorgement, nymphs were collected when they had completed \napproximately 2  days of feeding (Van č ová  et al. , 2006). \nApproximately 300 partially fed nymphs of each species were \ncollected and SGEs prepared as described previously ( Slovák \n et al. , 2000 ). The total amounts of protein from 10 nymphs ob-\ntained from two independent feeding sessions were 2.8  \u0001 g and \n3.9  \u0001 g in  D. reticulatus , 5.1  \u0001 g and 3.5  \u0001 g in  I. ricinus , 5.5  \u0001 g \nand 6.8  \u0001 g in  R. appendiculatus , and 11.6  \u0001 g and 9.7  \u0001 g in \n A. variegatum . Pooled SGE was prepared as 10, 5, 2.5, 1 or \n0.5 nymphal equivalents per 5  \u0001 l. Salivary gland extracts were \nscreened by ELISA for activity against human CXCL8, CCL2, \nCCL3, CCL5, CCL11, IL-2 and IL-4 using commercial ELISA \nkits obtained from R&D Systems (Xxx ) and\/or Bender MedSys-\ntems Diagnostics (Xxx ), as described previously, with duplicate \nassays of each sample (Hajnická  et al. , 2005). The results \nrepresent the means obtained with the two batches of SGEs \nderived from independent feeding sessions. A reduction in the \ndetectable level of a particular cytokine, compared with the con-\ntrol, was interpreted as evidence of putative cytokine binding \nactivity. \n The SGEs of all the nymphal species reduced the level of \nCXCL8 (Fig. 1). The highest levels of inhibition were shown by \n R. appendiculatus  and  D. reticulatus . Thus there was no correla-\ntion between the total protein content of SGE from each species \nand the levels of inhibitory activity ( D. reticulatus  had the low-\nest protein content and  R. appendiculatus  the second highest). \nRelatively high activity against CCL2, CCL3 and CCL11 was \nobserved in  R. appendiculatus  and  A. variegatum  nymphs, \nwhereas activity was barely detectable in  D. reticulatus  and \n undetectable in  I. ricinus . Only  A. variegatum  showed signifi-\ncant levels of activity with CCL5. Anti-IL-2 activity was de-\ntected in SGE of  I. ricinus  nymphs and low levels of activity in \nSGE of  D. reticulatus  nymphs, whereas anti-IL-4 was demon-\nstrated in SGE of  I. ricinus  and  R. appendiculatus . Thus nymphs \nof four ixodid tick species showed contrasting patterns of anti-\ncytokine activity after 2  days of feeding on rabbits. Similar re-\nsults were obtained using murine (rather than human) cytokines \n(data not shown), reflecting the high degree of amino acid iden-\ntity between mammalian cytokines and the likelihood that anti-\ncytokine activity is effective irrespective of (mammalian) host \nspecies. \n For  I. ricinus  and  A. variegatum , nymphal anti-cytokine pro-\nfiles were similar to those recorded for adults, whereas adult  D. \nreticulatus  showed a much greater repertoire of anti-cytokine \nactivity compared with conspecific nymphs ( Table  1 ). The dif-\nferences between species and between stages may reflect differ-\nences in host preference. However,  I. ricinus  has probably \nthe most catholic  ‘ taste ’ , but appears to have the poorest anti-\ncytokine repertoire. An alternative explanation may be that \nanti-cytokine activity reflects the size of the mouthparts and\/or \nthe duration of feeding. For example,  A. variegatum  has \nlarge mouthparts that penetrate deep into the dermis, and takes \na comparatively long time to reach engorgement ( Stewart  et al. , \n1998 ). The mechanics and physiology of  A. variegatum  feeding \nmay antagonize different cytokines to those provoked by a spe-\ncies such as  I. ricinus , which has much smaller mouthparts and \nengorges faster. \n Soon after tissue damage, specific leucocyte subsets emigrate \nfrom the circulation into the affected area. These leucocytes \nfunction as the primary line of host defence in the destruction of \nmicro-organisms and initiation of tissue repair. The histopatho-\nlogy of tick-bite lesions shows that, depending on the tick spe-\ncies and host species, the predominant cells infiltrating \nattachment sites are neutrophils (in mammals) or heterophils (in \nnon-mammals), eosinophils and basophils ( Latif  et al. , 1990 ; \n Szabo & Bechara, 1999 ;  Van der Heijden  et al. , 2005 ). Neu-\ntrophils are the first infiltrating cell type in the dermis; their mi-\ngration to inflammatory sites is directed by the chemokine \nCXCL8. The molecular structure of CXCL8 has been deter-\nmined for various vertebrate species and shown to be similar. \nIndeed, the most ancient chemokine, found in a primitive group \nof vertebrates, resembles mammalian CXCL8, indicating high \nconservation of this chemokine since the evolution of early ver-\ntebrates ( Najakshin  et al. , 1999 ). The chemotactic ability of hu-\nman CXCL8 is not species-specific; granulocytes from many \nvertebrate species migrate to this chemokine  in vitro  \n( Rot, 1991 ). Polymorphonuclear neutrophils inform and shape \nimmune responses. Thus it is perhaps not surprising that all the \nixodid species and stages showed anti-CXCL8 activity, presum-\nably indicating the importance to ixodid ticks of controlling \nneutrophil activity. Even adult female  A. variegatum , which has \nlow anti-CXCL8 activity at 5  days of feeding, shows compara-\ntively higher activity earlier in feeding (Van č ová  et al. , 2006). \n The CC chemokines have pleiotropic activities; they are po-\ntent attractants for monocytes, eosinophils, basophils, natural \nkiller cells and memory T cells ( Laing & Secombes, 2004 ). The \nimportance of cells of the host immune system infiltrating the \ntick feeding site resides in their ability to produce cytokines that \nmodulate the downstream response ( Falcone  et al. , 2001 ). Sub-\nversion of the activity of the four CC chemokines examined \nappears important for the two larger nymphal species, \n R. appendiculatus  and  A. variegatum. \n Because of the relatively long duration of tick blood- feeding, \nticks must suppress host immune reactions at all levels. The \nmain function of IL-2 is to stimulate the growth and cytotoxic \nresponse of activated T lymphocytes. In addition, IL-2 is impli-\ncated in the development, homeostasis and function of natural \nkiller cells. For nymphal  I. ricinus  in particular, the results \nsuggest the importance of suppressing one or more of these \nfunctions. \n The adaptive immune system has evolved two types of im-\nmune cells, Th1 and Th2, as the system supervisors ( Kidd, \n2003 ). Th1 cells are predominantly involved in the type-1 path-\nway of cellular immunity, whereas Th2 cells drive the type-2 \npathway of humoural immunity. Th2 differentiation is a central \nprocess in the protection against parasites such as helminths. \nTick infestation also results in a Th2 immune response, as \nshown by the cytokine profile induced in murine lymph node \ncells ( Ferreira & Silva, 1999 ). IL-4 is a key cytokine in the in-\nduction of Th2 immunity, mediating B-cell activation. Activated \n6\n7\n8\n Immunomodulatory arsenal of nymphal ticks  3 \n© 2008 The Authors\nJournal compilation © 2008 The Royal Entomological Society, Medical and Veterinary Entomology, 22, 1–5\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n61\n62\n63\n  \n Fig.  1.  Anti-cytokine activities of salivary gland extract (SGE) obtained from 2-day-fed nymphs of  Dermacentor reticulatus  (DR),  Ixodes ricinus  (IR), \n Rhipicephalus appendiculatus  (RA) and  Amblyomma variegatum  (AV) ticks. Salivary gland extracts equivalent to 10.0, 5.0, 2.5, 1.0 or 0.5 nymphs (la-\nbelled 1, 2, 3, 4, 5, respectively) were pre-incubated with 50  pg of each cytokine for 90  min before ELISA analysis. Results are expressed as percentage \nreduction of OD  reading compared with control . 19\n14\n 4  K. Peterková  et al.\n© 2008 The Authors\nJournal compilation © 2008 The Royal Entomological Society, Medical and Veterinary Entomology, 22, 1–5\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n61\n62\n63\nbasophils with enhanced IL-4 production are candidates to \n mediate the innate-adaptive link for Th2 responses during \nhelminth infections ( Min  et al. , 2006 ). As the Th2 cells mature \nthey also produce IL-4, which generates an autocrine loop to the \nnaïve T cells to make more Th2 cells. As for IL-2,  I. ricinus \n nymphs appear to target IL-4, suggesting they manipulate the \nTh2 response. When fed on laboratory mice,  I. ricinus  nymphs \ninduce a Th2 response, but do not elicit a host rejection response \n( Brossard & Wikel, 2004 ). However, on natural hosts,  I. ricinus \n nymphs induce resistance in  Apodemus flavicollis , although not \nin  Clethrionomys glareolus  ( Dizij & Kurtnebach, 1995 ). Thus \nthe interplay between tick-induced manipulation of host innate \nand acquired immunity, and Th1 and Th2 responses, for differ-\nent host species, is highly complex. Identification of the tick \nmolecules active in cytokine manipulation is needed to help un-\nravel this complexity. \n The importance of disrupting the host cytokine\/chemokine \nnetwork is demonstrated by the many  ‘ large ’ DNA viruses that \nproduce cytokine\/chemokine inhibitors ( Deane  et al. , 2000 ; \n Webb & Alcami, 2005 ). Arthropod-borne viruses (arboviruses) \nare  ‘ small ’ RNA viruses (with one exception, African swine fe-\nver virus) and appear to exploit the immunomodulatory proper-\nties of their vector ’ s saliva ( Nuttall & Labuda, 2004 ). Our results \nshow that even nymphal ticks, which epidemiologically are gen-\nerally more important than adults as vectors of arboviruses (and \nother tick-borne pathogens), produce a wealth of cytokine\/\nchemokine inhibitors. Such important immunosuppressors will \nneed to be considered in designing novel vaccines that target \nticks and block arbovirus transmission. \n Acknowledgements \n This study was supported by the Slovak Research and Develop-\nment Agency (contract no. APVV-51-004505) and Slovak \nVEGA  (grant 2\/7158\/27). \n References \n Borish ,  L.C. &  Steinke ,  J.W . ( 2003 )  2. Cytokines and chemokines . \n Journal of Allergy and Clinical Immunology ,  111 ( Suppl .),  460 – 475 . \n Brossard ,  M. &  Wikel ,  S.K . ( 2004 )  Tick immunobiology .  Parasitology , \n 129 ( Suppl .),  161 – 176 . \n Camus ,  E. &  Barre ,  N . ( 1992 )  The role of  Amblyomma variegatum  in \nthe transmission of heartwater with special reference to Guadeloupe . \n Annals of the New York Academy of Science ,  653 ,  33 – 41 . \n De Vos  A.J . ( 1981 )  Rhipicephalus appendiculatus : cause and vector of \ndiseases in Africa .  Journal of the South African Veterinary Associa-\ntion ,  52 ,  315 – 322 . \n Deane ,  D. ,  McInnes ,  C.J. ,  Percival ,  A .  et al . ( 2000 )  Orf virus encodes a \nnovel secreted protein inhibitor of granulocyte-macrophage colony-\nstimulating factor and interleukin-2 .  Journal of Virology ,  74 ,  1313 –\n 1320 . \n Dizij ,  A. &  Kurtnebach ,  K . ( 1995 ).  Clethrionomys glareolus , but not \n Apodemus flavicollis , acquires resistance to  Ixodes ricinus  L., the \nmain European vector of  Borrelia burgdorferi .  Parasite Immuno -\nlogy ,  17 ,  177 – 183 . \n Falcone ,  F.H. ,  Pritchard ,  D.I. &  Gibbs ,  B.F . ( 2001 )  Do basophils play \na role in immunity against parasites?  Trends in Parasitology ,  17 , \n 126 – 129 . \n9\n10\n     Ta\nbl\ne   1\n.   \n  H\nos\nt p\nre\nfe\nre\nnc\nes\n o\nf n\nym\nph\nal\n a\nnd\n a\ndu\nlt \nix\nod\nid\n sp\nec\nie\ns a\nnd\n th\nei\nr a\nnt\ni-c\nyt\nok\nin\ne \nac\ntiv\niti\nes\n.     \n  \n D\ner\nm\nac\nen\nto\nr r\net\nic\nul\nat\nus\n \n Ix\nod\nes\n ri\nci\nnu\ns \n Rh\nip\nic\nep\nha\nlu\ns a\npp\nen\ndi\ncu\nla\ntu\ns \n Am\nbl\nyo\nm\nm\na \nva\nrie\nga\ntu\nm\n   \nN\n * \nF   †\n   \nM\n   †   \nN\n * \nF   †\n   \nM\n   †   \nN\n * \nF\nM\nN\n * \nF   †\n   \nM\n   †       \nPr\nef\ner\nre\nd \nho\nst\nSm\nal\nl \nm\nam\nm\nal\ns\nM\ned\niu\nm\n\/la\nrg\ne \nm\nam\nm\nal\ns (\ne.g\n. \nde\ner\n,\n \ndo\ng,\n sh\nee\np)\nM\ned\niu\nm\n\/la\nrg\ne \nm\nam\nm\nal\ns (\ne.g\n. \nde\ner\n,\n \nca\nttl\ne,\n \nsh\nee\np)\nSm\nal\nl \nm\nam\nm\nal\ns; \nbi\nrd\ns, \nre\npt\nile\ns\nM\ned\niu\nm\n\/la\nrg\ne \nm\nam\nm\nal\ns (\ne.g\n. \nde\ner\n,\n \nsh\nee\np)\nN\neg\nlig\nib\nle\n \nfe\ned\nin\ng\nSm\nal\nl \nm\nam\nm\nal\ns\nM\ned\niu\nm\n\/la\nrg\ne \nu\nn\ngu\nla\nte\ns (\ne.g\n. \nsh\nee\np,\n w\nat\ner\n \nbu\nffa\nlo\n)\nM\ned\niu\nm\n\/la\nrg\ne \nu\nn\ngu\nla\nte\ns (\ne.g\n. \nsh\nee\np,\n w\nat\ner\n \nbu\nffa\nlo\n)\nM\nam\nm\nal\ns, \nbi\nrd\ns, \nre\npt\nile\ns\nLa\nrg\ne \nu\nn\ngu\nla\nte\ns \n(e.\ng. \nca\nttle\n)\nLa\nrg\ne \nu\nn\ngu\nla\nte\ns \n(e.\ng. \nca\nttle\n)  \n *\n A\nnt\ni-c\nyt\nok\nin\ne \nac\ntiv\nity\n  \nCX\nCL\n-8\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\nN\nD\nN\nD\n+\n+\n+\n+\n+\n  \nCC\nL2\n+\n+\n+\n+\n+\n+\n+\n+\n+\n − \n − \n+\n+\n+\n+\n+\nN\nD\nN\nD\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n  \nCC\nL3\n+\n+\n+\n+\n+\n+\n − \n − \n+\n+\n+\n+\n+\nN\nD\nN\nD\n+\n+\n+\n+\n+\n+\n+\n+\n+\n  \nCC\nL5\n+\n+\n+\n+\n+\n+\n+\n − \n − \n+\n+\nN\nD\nN\nD\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n  \nCC\nL1\n1\n+\n+\n+\n+\n+\n+\n+\n+\n+\n − \n − \n+\n+\n+\n+\n+\nN\nD\nN\nD\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n  \nIL\n-2\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\nN\nD\nN\nD\n+\n − \n+\n+\n  \nIL\n-4\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\n+\nN\nD\nN\nD\n − \n+\n+\n+\n+\n  \n     *\n Sa\nliv\nar\ny \ngl\nan\nd \nex\ntr\nac\nts\n o\nbt\nai\nne\nd \nfro\nm\n 2\n-d\nay\n-fe\nd \nny\nm\nph\ns: \n3.\n5    \u0001\n g \n D\n. r\net\nic\nul\nat\nus\n ,\n \n4.\n0    \u0001\n g \n I. \nri\nci\nnu\ns , \n6.\n0    \u0001\n g \n R.\n a\npp\nen\ndi\ncu\nla\ntu\ns , \n10\n.0\n    \u0001\n g \n A.\n v\nar\nie\nga\ntu\nm\n.     \n     †   S\nal\niv\nar\ny \ngl\nan\nd \nex\ntr\nac\nts\n o\nbt\nai\nne\nd \nfro\nm\n 5\n-d\nay\n-fe\nd \nad\nul\nts:\n 5\n    \u0001\n g \n D\n. r\net\nic\nul\nat\nus\n ,\n \n10\n    \u0001\n g \n I. \nri\nci\nnu\ns , \n5    \u0001\n g \n A.\n v\nar\nie\nga\ntu\nm\n  (f\nrom\n V.\n \nH\najn\nick\ná  e\nt a\nl . \n20\n05\n an\nd \nun\npu\nbl\nish\ned\n d\nat\na).\n    \n    ‡   A\nv\ner\nag\ne \n  v\nal\nue\ns o\nf t\nhe\n in\nhi\nbi\ntio\nn \nof\n 5\n0 \npg\n cy\nto\nki\nne\ns d\net\nec\ntio\nn \nby\n E\nLI\nSA\n:  −\n ,\n \nu\nn\nde\nte\nct\nab\nle\n; +\n,\n \n1 −\n 25\n%\n; +\n+\n,\n \n26\n − 5\n0%\n; +\n+\n+\n,\n \n51\n − 7\n5%\n; +\n+\n+\n+\n,\n \n76\n − 1\n00\n%\n. N\nD\n, n\not\n d\non\ne.\n   \n N\n, x\nx\nx\n  : \nF,\n \nx\nx\nx\n  , \nM\n, x\nx\nx\n  .      \n1515 1616 1717 1818\n Immunomodulatory arsenal of nymphal ticks  5 \n© 2008 The Authors\nJournal compilation © 2008 The Royal Entomological Society, Medical and Veterinary Entomology, 22, 1–5\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n23\n24\n25\n26\n27\n28\n29\n30\n31\n32\n33\n34\n35\n36\n37\n38\n39\n40\n41\n42\n43\n44\n45\n46\n47\n48\n49\n50\n51\n52\n53\n54\n55\n56\n57\n58\n59\n60\n61\n62\n63\n Ferreira ,  B.R. &  Silva ,  J.S . ( 1999 )  Successive tick infestations selec-\ntively promote a T-helper 2 cytokine profile in mice .  Immunology , \n 96 ,  434 – 439 . \n Foldvari ,  G. ,  Hell ,  E. &  Farkas ,  R . ( 2005 )  Babesia canis canis  in dogs \nfrom Hungary: detection by PCR and sequencing .  Veterinary Para-\nsitology ,  127 ,  221 – 226 . \n Gillespie ,  R.D. ,  Dolan ,  M.C. ,  Piesman ,  J. &  Titus ,  R.G . ( 2001 )  Iden-\ntification of an IL-2 binding protein in the saliva of the Lyme \ndisease vector tick,  Ixodes scapularis .  Journal of Immunology , \n 166 ,  4319 – 4327 . \n Hajnická ,  V. ,  Kocáková ,  P. ,  Sláviková ,  M. ,  Slovák ,  M. ,  Ga š perík ,  J. , \n Fuchsberger ,  N. &  Nuttall ,  P.A . ( 2001 )  Anti-interleukin-8 activity of \ntick salivary gland extracts .  Parasite Immunology ,  23 ,  483 – 489 . \n Hajnická ,  V. ,  Van č ová ,  I. ,  Kocáková ,  P .  et al . ( 2005 )  Manipulation of \nhost cytokine network by ticks: a potential gateway for pathogen \ntransmission .  Parasitology ,  130 ,  333 – 342 . \n Honzáková ,  E . ( 1971 )  Development of some tick species under standard \nlaboratory conditions .  Folia Parasitologica ,  18 ,  357 – 363 . \n Hubalek ,  Z. ,  Sixl ,  W. ,  Halouzka ,  J. &  Mikulaskova ,  M . ( 1997 )  Preva-\nlence of  Francisella tularensis  in  Dermacentor reticulatus  ticks col-\nlected in adjacent areas of the Czech and Austrian Republics .  Central \nEuropean Journal of Public Health ,  5 ,  199 – 201 . \n Jones ,  L.D. ,  Davies ,  C.R. ,  Steele ,  G.M. &  Nuttall ,  P.A . ( 1988 )  The rear-\ning and maintenance of ixodid and argasid ticks in the laboratory . \n Animal Technology ,  39 ,  99 – 106 . \n Kapsenberg ,  M.L . ( 2003 )  Dendritic-cell control of pathogen-driven \nT-cell polarization .  Nature Reviews Immunology ,  3 ,  984 – 993 . \n Kasama ,  T. ,  Miwa ,  Y. ,  Isozaki ,  T. ,  Odai ,  T. ,  Adachi ,  M. &  Kunkel ,  S.L . \n( 2005 )  Neutrophil-derived cytokines: potential therapeutic targets in \ninflammation .  Current Drug Targets Inflammation and Allergy ,  4 , \n 273 – 279 . \n Kelly ,  P.J . ( 2006 )  Rickettsia africae  in the West Indies .  Emerging Infec-\ntious Diseases ,  12 ,  224 – 226 . \n Kidd ,  P . ( 2003 )  Th1\/Th2 balance: the hypothesis, its limitations, and \nimplications for health and disease .  Alternative Medicine Review ,  8 , \n 223 – 246 . \n Labuda ,  M. &  Nuttall ,  P.A . ( 2004 )  Tick-borne viruses .  Parasitology , \n 129 ( Suppl .),  221 – 245 . \n Laing ,  K.J. &  Secombes ,  C.J . ( 2004 )  Chemokines .  Developmental and \nComparative Immunology ,  28 ,  443 – 460 . \n Latif ,  A.A. ,  Maina ,  J.N. ,  Dhadialla ,  T.S. &  Nokoe ,  S . ( 1990 )  Histologi-\ncal reactions to bites of  Amblyomma variegatum  and  Rhipicephalus \nappendiculatus  (Acari: Ixodidae) fed simultaneously on naïve or sen-\nsitized rabbits .  Journal of Medical Entomology ,  27 ,  316 – 323 . \n Min ,  B. ,  Le Gros ,  G. &  Paul ,  W.E . ( 2006 )  Basophils: a potential liaison \nbetween innate and adaptive immunity .  Allergology International , \n 55 ,  99 – 104 . \n Najakshin ,  A.M. ,  Mechetina ,  L.V. ,  Alabyev ,  B.Y. &  Taranin ,  A.V . ( 1999 ) \n Identification of an IL-8 homolog in lamprey ( Lampetra fluviatilis ): \nearly evolutionary divergence of chemokines .  European Journal of \nImmunology ,  29 ,  375 – 382 . \n Nambota ,  A. ,  Samui ,  K. ,  Sugimoto ,  C. ,  Kakuta ,  T. &  Onuma ,  M . ( 1994 ) \n Theileriosis in Zambia: aetiology, epidemiology and control mea-\nsures .  Japanese Journal of Veterinary Research ,  42 ,  1 – 18 . \n Narasimhan ,  S. ,  DePonte ,  K. ,  Marcantonio ,  N .  et al . ( 2007 )  Immunity \nagainst  Ixodes scapularis  salivary proteins expressed within 24 hours \nof attachment thwarts tick feeding and impairs  Borrelia  transmission . \n PLoS ONE ,  2 ,  e451 . \n Nuttall ,  P.A. &  Labuda ,  M . ( 2004 )  Tick − host interactions: saliva-\n activated transmission .  Parasitology ,  129 ( Suppl .),  177 – 190 . \n Pedra ,  J.H. ,  Narasimhan ,  S. ,  DePonte ,  K. ,  Maracantonio ,  N. ,  Kantor ,  F.S. , \nFikrig ,  E . ( 2007 )  Disruption of the salivary protein 14 in  Ixodes \nscapularis  nymphs and impact on pathogen acquisition .  American \nJournal of Tropical Medicine and Hygiene ,  75 ,  677 – 682 . \n Rot ,  A . ( 1991 )  Chemotactic potency of recombinant human neutrophil \nattractant\/activation protein-1 (interleukin-8) for polymorphonuclear \nleucocytes of different species .  Cytokine ,  3 ,  21 – 27 . \n Skarphedinsson ,  S. ,  Lyholm ,  B.F. ,  Ljungberg ,  M. ,  Sogaard ,  P. ,  Kolmos , \n H.J. &  Nielsen ,  L.P . ( 2007 )  Detection and identification of  Anaplas-\nma phagocytophilum ,  Borrelia burgdorferi , and  Rickettsia helvetica \n in Danish  Ixodes ricinus  ticks .  Acta Pathologica, Microbiologica et \nImmunologica ,  115 ,  225 – 230 . \n Slovák ,  M. ,  Hajnická ,  V. ,  Labuda ,  M. &  Fuchsberger ,  N . ( 2000 )  Com-\nparison of the protein profiles of salivary gland extracts derived from \nthree species of unfed and partially fed ixodid ticks analysed by SDS-\nPAGE .  Folia Parasitologica ,  47 ,  67 – 71 . \n Sreter-Lancz ,  Z. ,  Szell ,  Z. ,  Kovacs ,  G. ,  Egyed ,  L. ,  Marialigeti ,  K. & \n Sreter ,  T . ( 2006 )  Rickettsiae of the spotted-fever group in ixodid ticks \nfrom Hungary: identification of a new genotype ( ‘ Candidatus Rick-\nettsia kotlanii ’ ) .  Annals of Tropical Medicine and Parasitology ,  100 , \n 229 – 236 . \n Stewart ,  J.R. ,  Burgdorfer ,  W. &  Needham ,  G . ( 1998 )  Evaluation of three \ncommercial tick removal tools .  Wilderness and Environmental Medi-\ncine ,  9 ,  137 – 142 . \n Szabo ,  M.P. &  Bechara ,  G.H . ( 1999 )  Sequential histopathology at the \n Rhipicephalus sanguineus  tick feeding site on dogs and guinea pigs . \n Experimental and Applied Acarology ,  23 ,  915 – 928 . \n Van č ová ,  I. ,  Slovák ,  M. ,  Hajnická ,  V .  et al . ( 2006 ).  Differential anti-\n chemokine activity of  Amblyomma variegatum  adult ticks during \nblood-feeding .  Parasite Immunology ,  29 ,  169 – 177 . \n Van der Heijden ,  K.M. ,  Szabo ,  M.P. ,  Egami ,  M.I. ,  Pereira ,  M.C. & \n Matushima ,  E.R . ( 2005 )  Histopathology of tick-bite lesions in natu-\nrally infested capybaras ( Hydrochoerus hydrochaeris ) in Brazil . \n Experimental and Applied Acarology ,  37 ,  245 – 255 . \n Webb ,  L.M.C. &  Alcami ,  A . ( 2005 )  Virally encoded chemokine binding \nproteins .  Mini Reviews in Medicinal Chemistry ,  5 ,  833 – 848 . \n Accepted 7 January 2008 \n11\n12\n13\n Author Query Form \n Journal: Medical and Veterinary Entomology\nArticle: mve_726 \n Dear Author, \n During the copy-editing of your paper, the following queries arose. Please respond to these by marking up your proofs \nwith the necessary changes\/additions. Please write your answers on the query sheet if there is insuffi cient space on the \npage proofs. Please write clearly and follow the conventions shown on the attached corrections sheet. If returning the \nproof by fax do not write too close to the paper’s edge. Please remember that illegible mark-ups may delay publication. \nMany thanks for your assistance. \n Query No. Query Remark \n  1 Au: insert name of department. \n  2 Au: insert name of department. \n  3 Au: insert name of department. \n  4 Au: Please provide the department name (if any) for all the affi liations. \n  5 Au: Please note that in text citation  ‘ Van č ova  et al.  (2006) has been \nchanged to Van č ová  et al.  (2006) as per the list. Please check. \n  6 Au: insert town, state (abbreviation), country for R&D Systems. \n  7 Au: insert town, state (abbreviation), country for Bender MedSystems \nDiagnostics. \n  8 Au: Please note that in text citation  ‘ van der Heijden  et al.  (2005) has \nbeen changed to Van der Heijden  et al.  (2005) as per the list. Please \ncheck. \n  9 Au: Please note that spelling of author name  ‘ Kurtenbach ’ in text citation \n ‘ Dizij & Kurtenbach (1995) ’ has been changed to  ‘ Kurtnebach ’ as per \nthe list. Please check. \n 10 Au: give VEGA in full. \n 11 Au: Please note that  ‘ Kapsenberg (2003) ’ has not been cited in text. \nPlease cite it in text or delete from the list. \n 12 Au: Please note that  ‘ Kasama  et al.  (2005) ’ has not been cited in text. \nPlease cite it in text or delete from the list. \n 13 Au: please check and correct journal title. \n 14 Au: defi ne OD. \n 15 Au:  ‡ does not appear in the table; please correct. \n 16 Au: defi ne N. \n 17 Au: defi ne F. \n 18 Au: defi ne M. \n 19 Au: Figure 1 is in low resolution with poor quality. Please provide high \nresolution fi gure at 300 dpi. For more information about supplying \nelectronic artwork, please see the journal webpage or our electronic \nartwork guidelines at http:\/\/www.blackwellpublishing.com\/authors\/\ndigill.asp.\nMARKED PROOF\nPlease correct and return this set\nInstruction to printer\nLeave unchanged under matter to remain\nthrough single character, rule or underline\nNew matter followed by\nor\nor\nor\nor\nor\nor\nor\nor\nor\nand\/or\nand\/or\ne.g.\ne.g.\nunder character\nover character\nnew character \nnew characters \nthrough all characters to be deleted\nthrough letter   or\nthrough characters\nunder matter to be changed\nunder matter to be changed\nunder matter to be changed\nunder matter to be changed\nunder matter to be changed\nEncircle matter to be changed\n(As above)\n(As above)\n(As above)\n(As above)\n(As above)\n(As above)\n(As above)\n(As above)\nlinking characters\nthrough character    or\nwhere required\nbetween characters or\nwords affected\nthrough character    or\nwhere required\nor\nindicated in the margin\nDelete\nSubstitute character or\nsubstitute part of one or\nmore word(s)\nChange to italics\nChange to capitals\nChange to small capitals\nChange to bold type\nChange to bold italic\nChange to lower case\nChange italic to upright type\nChange bold to non-bold type\nInsert ‘superior’ character\nInsert ‘inferior’ character\nInsert full stop\nInsert comma\nInsert single quotation marks\nInsert double quotation marks\nInsert hyphen\nStart new paragraph\nNo new paragraph\nTranspose\nClose up\nInsert or substitute space\nbetween characters or words\nReduce space between\ncharacters or words\nInsert in text the matter\nTextual mark Marginal mark\nPlease use the proof correction marks shown below for all alterations and corrections. If you  \nin dark ink and are made well within the page margins.\nwish to return your proof by fax you should ensure that all amendments are written clearly\n"}