{"doi":"10.1103\/PhysRevB.70.235417","coreId":"101777","oai":"oai:epubs.surrey.ac.uk:1208","identifiers":["oai:epubs.surrey.ac.uk:1208","10.1103\/PhysRevB.70.235417"],"title":"Disorder, clustering, and localization effects in amorphous carbon","authors":["Carey, JD","Silva, S. R. P."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-12-16","abstract":"<p>The nanostructure of amorphous carbon thin films is described in terms of a disordered nanometer-sized conductive sp2 phase embedded in an electrically insulating <i>sp<\/i><sup>3<\/sup> matrix. It is shown that the degree of clustering and disorder within the <i>sp<\/i><sup>2<\/sup> phase plays a determining role in the electronic properties of these films. Clustering of the <i>sp<\/i><sup>2<\/sup> phase is shown to be important in explaining several experimental results including the reduction of the electron spin resonance linewidth with increasing spin density and the dispersion associated with the width of the Raman active G band. The influence of structural disorder, associated with <i>sp<\/i><sup>2<\/sup> clusters of similar size, and topological disorder, due to undistorted clusters of different sizes, on both spin density and Raman measurements, is discussed. An extension of this description to intercluster interactions to explain some of the electrical transport and electron field emission behavior is also presented.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1208<\/identifier><datestamp>\n      2017-06-23T11:54:07Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1208\/<\/dc:relation><dc:title>\n        Disorder, clustering, and localization effects in amorphous carbon<\/dc:title><dc:creator>\n        Carey, JD<\/dc:creator><dc:creator>\n        Silva, S. R. P.<\/dc:creator><dc:description>\n        <p>The nanostructure of amorphous carbon thin films is described in terms of a disordered nanometer-sized conductive sp2 phase embedded in an electrically insulating <i>sp<\/i><sup>3<\/sup> matrix. It is shown that the degree of clustering and disorder within the <i>sp<\/i><sup>2<\/sup> phase plays a determining role in the electronic properties of these films. Clustering of the <i>sp<\/i><sup>2<\/sup> phase is shown to be important in explaining several experimental results including the reduction of the electron spin resonance linewidth with increasing spin density and the dispersion associated with the width of the Raman active G band. The influence of structural disorder, associated with <i>sp<\/i><sup>2<\/sup> clusters of similar size, and topological disorder, due to undistorted clusters of different sizes, on both spin density and Raman measurements, is discussed. An extension of this description to intercluster interactions to explain some of the electrical transport and electron field emission behavior is also presented.<\/p><\/dc:description><dc:date>\n        2004-12-16<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1208\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Carey, JD and Silva, S. R. P.  (2004) Disorder, clustering, and localization effects in amorphous carbon   Physical Review B, 70 (235417).       <\/dc:identifier><dc:relation>\n        10.1103\/PhysRevB.70.235417<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1208\/","10.1103\/PhysRevB.70.235417"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Disorder, clustering, and localization effects in amorphous carbon\nJ. D. Carey* and S. R. P. Silva\nNanoelectronics Centre, Advanced Technology Institute, School of Electronics and Physical Sciences, University of Surrey,\nGuildford, GU2 7XH, United Kingdom\n(Received 2 August 2004; revised manuscript received 28 September 2004; published 16 December 2004)\nThe nanostructure of amorphous carbon thin films is described in terms of a disordered nanometer-sized\nconductive sp2 phase embedded in an electrically insulating sp3 matrix. It is shown that the degree of cluster-\ning and disorder within the sp2 phase plays a determining role in the electronic properties of these films.\nClustering of the sp2 phase is shown to be important in explaining several experimental results including the\nreduction of the electron spin resonance linewidth with increasing spin density and the dispersion associated\nwith the width of the Raman active G band. The influence of structural disorder, associated with sp2 clusters\nof similar size, and topological disorder, due to undistorted clusters of different sizes, on both spin density and\nRaman measurements, is discussed. An extension of this description to intercluster interactions to explain some\nof the electrical transport and electron field emission behavior is also presented.\nDOI: 10.1103\/PhysRevB.70.235417 PACS number(s): 71.23.Cq, 79.70.1q, 85.45.Db, 73.61.Jc\nI. INTRODUCTION\nConsiderable research effort into amorphous group IV\nsemiconductors has been spurred on by the ability to control\ntheir electronic properties by varying the deposition condi-\ntions and a capability to deposit films over large areas. Amor-\nphous carbon sa-Cd thin films have the added advantage that\nthey can be deposited at low substrate temperatures where it\nis possible to achieve hard films with rms roughnesses of less\nthan 1 nm over large areas.1,2 This has led to applications\nsuch as hard disk and biomedical coatings. Less success has\nbeen forthcoming in the development of active electronic\napplications of a-C and hydrogenated a-C sa-C:Hd films3\nand as a consequence it is necessary to examine the elec-\ntronic properties and the effects of disorder and localization\nat a nanometer level. Unlike other group IV tetrahedral\namorphous semiconductors, such as amorphous silicon or\ngermanium, the different hybridizations of C atoms allows\nfor the formation of sp2 as well as sp3 bonding. The sp2\nhybridized carbon atoms tend to exist as nm-sized clusters in\nthe form of graphitic rings or olephinic chains giving rise to\np and p* bands, whereas the sp3 component tends to be in\nthe form of aliphatic chains. The optoelectronic properties of\nthese films are usually discussed in terms of transitions be-\ntween occupied p states to unoccupied p* states with the s\nand s* states (associated with sp3 C) further separated from\neach other. It has been shown4 that it is possible to represent\nthe occupied p and unoccupied p* bands by Gaussian func-\ntions centered at Epsp*d. The usual methods for extracting\nparameters such as the (parabolic) Tauc gap or the (exponen-\ntial) Urbach energy are used, although there is a growing\nrealization that this approach may be too simplistic for this\ncomposite amorphous system.5\nIn most disordered semiconductors, the Tauc band gap\ncorresponds to optical transitions between extended states,\nand in the case of a-C:H, in the absence of disorder, the\nTauc gap is given by the separation between the p and p*\nbands and gives a magnitude of 2Ep. The larger the average\nsize of the sp2 cluster, the smaller the Tauc gap. An alterna-\ntive band gap that is sometimes employed is to measure the\nenergy at which the absorption coefficient is 104 cm−1; this is\nknown as the E04 gap. Values associated with the E04 gap\ntend to be larger than the Tauc gap as the absorption associ-\nated with 104 cm−1 tends to occur in states beyond the p and\np* band edges. Transitions between extended-to-localized\nstates in amorphous semiconductors are usually character-\nized by the Urbach energy, EU, which is determined by fit-\nting an exponential function to the slope of the absorption\nedge. In the case of low defect density a-Si:H the valence\nband tail has an exponential slope of about 45 meV, which is\nlarger than the slope of the conduction band s25 meVd. In\nthis manner the Urbach energy of 55 meV for low defect\ndensity a-Si:H is mainly determined by the valence band\nand associated with low-lying defect states. In this way the\nUrbach energy is a measure of disorder.\nA second measure of disorder, based upon bond angle\ndistortion, is the width (full width half maximum) of the\nRaman active G band, GG. This Raman signal is found at\naround 1580 cm−1 and originates from the E2g vibration be-\ntween sp2 C bonds.6 Several complementary optical7–9 and\nRaman studies6,10 have revealed that as the Tauc gap in-\ncreases the Urbach energy increases monotonically but that\nthe width of the G band undergoes a maximum about 1.5 eV,\nas shown in Fig. 1(a). In this respect if the Urbach energy\nand the width of G band are valid measures of disorder in the\na-C:H system, then they measure different aspects or types\nof disorder. Robertson has concluded that the Urbach energy\nis a measure of an inhomogeneous disorder associated with\ndifferent sp2 cluster sizes, whereas the G band width has\nbeen attributed to a homogeneous disorder associated with\nbond angle disorder.2 However, this interpretation is unable\nto explain\n(i) why the largest values of EU are observed at the high-\nest Tauc gaps [Fig. 1(a)] where the cluster sizes are smallest\nand as a result there is only a small limited number of dif-\nferent cluster conformations possible,\n(ii) the observation of a maximum in the G band line-\nwidth with the Tauc gap [Fig. 1(b)],\nPHYSICAL REVIEW B 70, 235417 (2004)\n1098-0121\/2004\/70(23)\/235417(8)\/$22.50 ©2004 The American Physical Society235417-1\n(iii) why the G band position is also dependant on the\nexcitation wavelength, with the G band position tending to\nsaturate at ,1600 cm−1 for excitation wavelengths below\n350 nm and the peak shifting to lower energies at longer\nwavelengths, as shown in Fig. 2(a), and\n(iv) the observation that the G band linewidth depends on\nthe excitation wavelength with the narrower values of GG\nobserved at increasing excitation energy as seen in Fig. 2(b).\nSince the Raman spectra are a result of resonant excita-\ntion of sp2 clusters, dispersion of the G peak reflects excita-\ntion of clusters with different band gaps. The saturation of\nthe G band position at ,1600 cm−1 in Fig. 2(a) reflects the\nmaximum possible Raman shift for C atoms bonded in sp2\nrings (noting that higher Raman shifts are possible for sp2 C\natoms found in chains, with shorter bond lengths).6 The ob-\nservation of dispersion of the Raman linewidth implies that\nthere is an inhomogeneous distribution in bond angle disor-\nder. Furthermore, the reduction of the G width with increas-\ning excitation energy implies that there is a narrower distri-\nbution of higher gap sp2 states, in contradiction with the\nsuggestion that there must be a larger distribution of sp2\nstates required for the large Urbach energy.\nIn order to understand the types of disorder that are\npresent it is also worthwhile highlighting the role of electron\nspin resonance (ESR) active “defects.” A high concentration\nof paramagnetic defects s1020 cm−3d tends to be found in\nfilms deposited under energetic conditions, such a high nega-\ntive self-bias found in plasma enhanced chemical vapor\ndeposition (PECVD).11 Films grown with a high H content\nand low internal stresses tend to have much lower defect\ndensities, typically ,1017 cm−3.12 The term “defect” is per-\nhaps a misnomer since the ESR active species are generally\nagreed to result from different configurations of sp2 clusters.\nIn this way a proper interpretation of the ESR data can be\nlinked to optical band gap, Raman data as well as from\nnuclear magnetic resonance measurements. The exploration\nof these intracluster interactions and how they are related to\ndisorder is one of the aims of this paper. The paper is orga-\nnized into three sections. First, the importance of disorder\nand localization of the electron wave function in the a-C\nsystem is introduced. Second, the structure and bonding on a\nnanoscale is explored in order to understand the intracluster\ninteractions and evidence of clustering found in a-C:H and\na-C films. Finally, we show how the intercluster interactions\ncan be altered and their resultant effects on the electronic\nproperties of the films.\nFIG. 1. Variation of (a) Urbach energy from (j) from Ref. 7,\n(P) from Ref. 8, and (s) from Ref. 9 and (b) linewidth of the\nRaman G band for films deposited from CH4 (P), C6H6 (h), and\nC4H10 (j) from Ref. 10 and from CH4 (s) from Ref. 6 as a func-\ntion of the optical Tauc gap.\nFIG. 2. Variation of (a) the G band Raman shift and (b) G band\nlinewidth for a series of polymerlike a-C:H films (j), diamondlike\na-C:H (h), and graphitic carbon (P) thin films as a function of\nRaman excitation wavelength (Ref. 6).\nJ. D. CAREY AND S. R. P. SILVA PHYSICAL REVIEW B 70, 235417 (2004)\n235417-2\nII. DISORDER AND LOCALIZATION EFFECTS\nIN AMORPHOUS CARBON\nIt is now well established that in the case of metals the\nconductivity is determined by diffusive electronic states. In\nthe case of amorphous materials, disorder plays an important\nrole with a net reduction of the mobility of the carriers via\nscattering. Anderson showed that in a sufficiently disordered\none-band model no movement of carriers can take place\nwithout thermal activation.13 Tunneling between localized\nstates becomes possible at higher temperatures and the extent\nof electron hopping is controlled by the properties of the\nmidgap and tail states. Using the notation developed by\nAnderson, it was shown that localization can be described in\nterms of a tight-binding model with a single band of width B,\nwhich is equal to 2zV, where z is the coordination number\nand V is the potential well of the atom. When the magnitude\nof the disorder potential, dV, is larger than B, it is found that\ndV\/B = dV\/2zV . 1 and dV\/V . 2z . s1d\nIn the case of a-C:H, where both p and s bonding is\npresent, the calculations of Chen and Robertson showed that\nthe entire p band is localized with a high inverse participa-\ntion ratio of the p states that control the conduction\nproperties.14 Unlike the case of spherical hybridized wave\nfunctions, for which a random arrangement of spheres retains\na high degree of spherical wave function overlap, the planes\ninvolving p bonds with p hybridized states in a-C end up\nbeing close to orthogonal to each other. This results in little\ninteraction as the potential well overlap of each atom tends\nto zero. In terms of Eq. (1) this means that the potential V is\nnow comparable to the disorder term dV, resulting in elec-\ntron localization. One consequence of a localized wave func-\ntion is that the photoluminescence (PL) emission is predicted\nto be highly polarized, a prediction that was subsequently\nconfirmed by polarized PL measurements.15 Another experi-\nmental result to note is the localization length measured16 in\nlow-defect-containing a-C:H films, which was about\n1.5 nm. This value can be compared with that found in\na-Si, which is typically around 10–12 nm. In the case of\na-Si, in which only s bonds are present, localization only\noccurs at the tail states of both conduction and valence\nbands.\nThe increase in the Urbach energy with increasing p-p*\nseparation and small numbers of possible sp2 cluster con-\nfigurations coupled with the dispersion in the G linewidth\nhave led Fanchini and Tagliaferro to conclude that the Ur-\nbach energy in amorphous carbon is not a good measure of\ndisorder.17 Furthermore, they went on to propose two types\nof disorder:\n(i) A structural disorder associated with clusters of the\nsame size but with different amounts of distortion. This type\nof inhomogeneous disorder would increase the Urbach en-\nergy as well as broaden the G band linewidth.\n(ii) Topological disorder arising from undistorted clusters\nbut of different sizes. This would also broaden the Urbach\nenergy but have no effect on the G linewidth.\nBy modeling the p-p* bands as Gaussian bands, Fanchini\nand Tagliaferro showed that it is the ratio of the Gaussian\nwidth to the p band energies that is important, not simply the\nwidth of the p bands. This gives rise to a disorder-induced\nnarrowing of the Tauc optical gap. As a consequence the\ndifference between distorted and undistorted sp2 clusters\nneeds to be explored. The location of the sp2 clusters in the\nenergy gap depends on two factors: whether they consist of\neven or odd numbers of carbon atoms and whether they are\ndistorted. Undistorted even numbered clusters will give rise\nto states near the Fermi level sEFd only if they are sufficiently\nlarge. This differs from the case of odd numbered clusters,\nwhich can give rise to gap states even if composed of a small\nnumber of atoms. In general, distorted clusters give rise to\nstates that are closer to EF than undistorted clusters. In this\nmanner ESR can give a measure of the density of sp2 states\nat the Fermi level, provided that a majority of these states\nhave a net unpaired electron spin present. Note that measure-\nments of ESR spin densities do not themselves measure the\nsp2 content. For example, electron energy loss spectroscopy\nmeasurements made on PECVD grown films showed that the\np bonds per carbon atom, taken to be the sp2 content, varied\nfrom 63% to 72% for a change of negative self-bias from\n100 to 265 V. This was accompanied by an increase in the\nspin density from 4.931019 to 1.531020 cm−3. However,\nwhilst increasing the negative self bias to 540 V the spin\ndensity hardly changed fs2–3d31020 cm−3g, the sp2 content\nincreased to nearly 100%.11\nIII. CLUSTERING, DISORDER, AND INTRACLUSTER\nEFFECTS IN AMORPHOUS CARBON\nIn order to examine the degree of clustering present in a\n-C:H films, solid state nuclear magnetic resonance (NMR)\nhas been employed. This has the distinct advantage over Ra-\nman spectroscopy in that NMR is able to quantify the rela-\ntive amounts of sp2 and sp3 C bonding along with the degree\nof protonation of each type of atom. The biggest disadvan-\ntage of NMR is the relatively large amount of sample re-\nquired since only the 13C nucleus, with an abundance of\n1.1%, possesses a nonzero nuclear spin of 12 . Jäger et al. used\ncross-polarization 13C NMR to measure the effects on the\nproton relaxation times in different environments of films\ndeposited from acetylene and benzene and found evidence18\nfor a two-component 1H spin-lattice relaxation with time\nconstants of 14 and 120 ms. This was interpreted as being\ndue to the presence of two differently relaxing proton sys-\ntems in which the shorter relaxation time originates from CH\ngroups in the sp2 and sp3 matrix. The long T1 time corre-\nsponds to short CH2 polymer units with a sp3 configuration.\nIn this description the two environments are separated by\nregions of nonhydrogenated sp2 C. Further interpretation\nabout the nature of the (hydrogenated) sp2 component of the\nfilms comes from the observation of a virtually temperature-\nindependent proton relaxation time of ,10 ms for films de-\nposited by rf glow discharge from benzene at a self-bias\nvoltage of −200 V. The temperature independence of the\nshorter T1 component is consistent with the nuclei being re-\nlaxed via spin diffusion to paramagnetic centers. It is there-\nfore the degree of electron aggregation or clustering associ-\nated with paramagnetic centers that determines the proton\nDISORDER, CLUSTERING AND LOCALIZATION\u0085 PHYSICAL REVIEW B 70, 235417 (2004)\n235417-3\nrelaxation. The influence of spin diffusion to paramagnetic\ncenters as an explanation of the temperature independence of\nthe spin-lattice relaxation times implies that an understand-\ning of the facts that affect the spin density and linewidth are\nimportant.\nFilms of a-C:H were deposited on either the driven or\nearthed electrode of a Plasma Technology DP800 capaci-\ntively coupled radio-frequency 13.56 MHz plasma-enhanced\nchemical vapor deposition system. Films were grown on\nCorning 7059 glass for optical measurements and high-\nresistivity substrates for ESR measurements. During deposi-\ntion, feed gases of methane [30 sccm (standard cubic centi-\nmeters per minute)] with He s75 sccmd were used and the\ntotal deposition pressure was 200 mTorr. Film thicknesses\nwere measured using ellipsometry. Films grown at low nega-\ntive self-biases are soft, low stress, low density\ns,1.5 g cm−3d, possess high H contents (up to 40 at. %) and\nare optically transparent. These films are referred to as poly-\nmerlike amorphous carbon (PAC) films. Diamondlike carbon\n(DLC) films are hard, have a high Young’s modulus, high\ndensity, possess lower hydrogen contents, have relatively\nlarge dielectric constants, have high stress (overconstrained\nnetworks), and lower optical band gaps. In the limit of films\nexhibiting high sp2 content, graphitic carbon (GC) is formed\nwith close to zero optical gap.1 Figure 3 shows the variation\nof the spin density, Ns, and peak-to-peak linewidth, DBpp,\nwith negative self-bias for a series of films deposited from\nCH4 as a hydrocarbon source gas. Two other sets reported in\nthe literature are also presented.7,11 It is evident that the spin\ndensity rises from a low value of ,1017 cm−3 and saturates\nat 1020 cm−3. The ESR linewidth initially increases, often as\nthe spin density increases, but at higher biases the linewidth\ndecreases before saturating.\nSince the spin densities under high bias conditions re-\nported are typically ,1020 cm−3, corresponding to ,1 at. %\nof the material present, we may reasonably assume that the\nESR signal can be considered as originating from a dilute\nparamagnetic material. It is therefore possible to apply the\ntheory of Abragam to calculate the contribution to DBpp from\nthe dipole-dipole interaction between like spins.19 Such a\nbroadening mechanism will produce a Lorentzian ESR line\nshape, a prediction that was subsequently observed.11 At\nlower biases, the line shape is often Gaussian, characteristic\nof inhomogeneous broadening, and usually attributed to un-\nresolved H hyperfine interactions. The presence of this extra\ncontribution to the linewidth complicates the discussion of\nthe linewidth at low values of Ns. Assuming a spin concen-\ntration Ns, measured in cm−3, the contribution to the dipolar\ninteraction DBpp, measured in mT, can be given as11\nDBpp =\n4p2\n9\ngmBNs. s2d\nBarklie et al. applied Eq. (2) for a typical C-related g value\nof 2.0025 to obtain the expression DBpp=8.12310−21Ns.\nFigure 4 shows the variation of DBpp against Ns directly for\nthe same three data sets reported in Fig. 3, as well the pre-\ndicted linewidth (dashed line) based solely on dipolar broad-\nening using Eq. (2). It is apparent that significant reductions\nin DBpp are observed at high Ns, indicating an additional\nmechanism is responsible for reductions in the linewidth.\nThis additional interaction is due to the motional averaging\nof the electron wave function within the sp2 cluster. As the\nsp2 cluster increases in size the probability of the electron\nbeing associated with a particular atom decreases. This\nspread out or delocalization of the wave function as the clus-\nter size increases is accompanied by a general reduction in\nthe Tauc gap. Evidence of delocalization can also be found in\nan examination of the spin resonance relaxation times. The\nspin-lattice relation time, T1, decreases from 3310−5 s for\nPAC films down to 2310−7 s for DLC films, which implies\na greater interaction between the spin system and lattice.11 At\nthe same time the spin-spin relaxation times increase, reflect-\ning a change in the exchange frequency. It has been\nreported11 that in films with a high sp2 content that the ex-\nchange frequency is approximately ,1010 rad s−1.\nFurther evidence confirming the influence of clustering\ncan be found from NMR measurements. Tamor et al. esti-\nmated the protonated and nonprotonated C concentration\nwith either sp2 or sp3 hybridization.20 At a self-bias of\n−500 V, the H content was estimated to be 36 at. % and the\nfraction of protonated sp3 C atoms to be 0.16, nonprotonated\nsp3 C atoms to be 0.20, protonated sp2 C atoms to be 0.25,\nand nonprotonated sp2 C atoms to be 0.37. For a film density\nFIG. 3. Variation of (a) spin density and (b) peak-to-peak line-\nwidth with negative self-bias for a series of DLC films (j) and\nfrom Ref. 7 (P) and Ref. 11 (s).\nJ. D. CAREY AND S. R. P. SILVA PHYSICAL REVIEW B 70, 235417 (2004)\n235417-4\nof 1.7 g cm−3 this result suggests there are 5.131022 sp2 C\natoms cm−3 in the film. If the signal observed from ESR is\nassociated with sp2 C centers, then for a value of Ns of\n1020 cm−3, this corresponds to 1 spin per 510 sp2 C atoms or\nequivalent to 1 spin per 300 atoms of nonprotonated sp2 C\natoms. If these spins were randomly distributed throughout\nthe film cooperative effects, such as exchange, should not\noccur. Since exchange effects have been attributed to films\ngrown at high bias, the combined use of NMR and ESR\nconfirms and quantifies the clustering of the sp2 phase that\nhas taken place.\nIn addition to the concentration of the sp2 clusters, the\nsize of the sp2 clusters is therefore an important feature of\nthis description. Indeed there have been attempts to infer the\ncluster size and shape using visible Raman spectroscopy.21\nAs a result considerable interest was generated by the recent\nobservation22 of apparent anisotropy in the ESR signal of\ndefects in DLC films measured at high frequency s94 GHzd\nand low temperature s4 Kd. A fully amorphous material with\na single spin–12 paramagnetic center should exhibit a single\nisotropic line. The presence of strong exchange results in a\nsingle line whose linewidth is exchange narrowed below that\npredicted by Eq. (2). In Ref. 22 it was proposed that the ESR\nsignal could be attributed to the sum of an anisotropic pow-\nder spectrum with axial g values of gi ,2.005 and g’\n,2.0025 and one symmetric unresolved line with g\n=2.0025. From ESR studies of nanocrystalline graphite it is\nknown that the g tensor is anisotropic and the g values de-\npend on the average crystallite size, such that the observed\nvalue of gi of 2.005 being associated23 with a crystallite size\nof less than 7.5 nm. In this way it was believed that ESR was\nproviding a way to quantify the size of the nanoclusters. This\nis an extremely attractive feature since it has been proposed\nthat the ratio of the intensities of the G and D Raman bands\n(located at 1350 cm−1 and associated with the A1g breathing\nmode of six-fold sp2 rings) can be related to the in-plane\ncorrelation of disordered graphite.6,21 The reason that no an-\nisotropy was observed at the more conventional 9 GHz\nroom-temperature measurement was due to the strong ex-\nchange narrowing. Unfortunately, in this analysis the role of\ndemagnetizing fields, which at room temperature and “low”\nmagnetic fields (,0.3 T for a microwave frequency of\n9 GHz, corresponding to a g=2 center) are negligible, but\nmust be included when operating at 4 K and especially at\nhigher resonance fields required at the higher microwave\nfrequencies.24,25 When demagnetizing fields are taken into\naccount, an apparent anisotropy of the resonance can occur\nsince the demagnetizing field results in an effective shift\ndownwards of the effective g value when the applied Zee-\nman magnetic field is perpendicular to the film. Similarly, an\nupshift in the g value occurs when the applied field is parallel\nto the plane, as can be seen in Fig. 5 for a range of samples\nboth deposited and ion implanted.26 Typically, for an applied\nfield of 0.3 T and spin concentration of 1020 cm−3 the de-\nmagnetizing field is about 1 mT. As a result exchange inter-\nactions are still prevalent at high microwave fields.\nFinally, apart from changes in deposition conditions, e.g.,\nself bias or the addition of N, nanoclustering within a-C\nfilms can be adjusted via thermal annealing. Siegal et al.\nannealed nonhydrogenated a-C films produced by pulsed la-\nser ablation and reported the presence, via high-resolution\ntransmission electron microscopy, of regions 3–5 nm in size\nthat were 5–10 % more dense that the surrounding regions.27\nThe as-deposited films have stresses of 5–7 GPa and a film\ndensity of 3.0 g cm−3 but near-complete stress relief had oc-\ncurred and the density had dropped to 2.8 g cm−3 with ther-\nmal annealing to 600 °C. Over the same annealing tempera-\nture range the optical transparency of the film decreased,\ndemonstrating that clustering of the sp2 within the film is\nincreasing. By considering different bonding topologies on\nthe basis of Raman spectroscopy, Siegal et al. concluded that\nFIG. 4. Variation of peak-to-peak linewidth with spin density for\na series of DLC films (j) and from Ref. 7 (P) and Ref. 11 (s). The\ndashed line represents the predicted dipolar contribution to the line-\nwidth based on Eq. ((2)).\nFIG. 5. Variation of the effective g value for the magnetic field\nin the plane of (open symbols) and perpendicular to (closed sym-\nbols) the film with measurement temperature for a series of DLC\nfilms after growth (circles) (Ref. 22 ), after implantation with Ni\n(squares) and W (diamonds) (Ref. 26).\nDISORDER, CLUSTERING AND LOCALIZATION\u0085 PHYSICAL REVIEW B 70, 235417 (2004)\n235417-5\nthe as-grown films consist of the small and isolated sixfold\nclusters but that above annealing temperatures of 300 °C the\nfraction of five-membered rings begins to increase. The pres-\nence of five-membered rings was attributed to the newly\nformed p bonded atoms, rather than a reduction in the popu-\nlation of the six-membered rings themselves. Despite the re-\nduction in the film’s density, nanoindentation measurements\nshowed that the nanocomposite films were 15% harder than\nthe as deposited films. Computational studies showed that\nwithin this nanocomposite film, the residual stress consists of\nan inhomogeneous stress distribution where the threefold-\ncoordinated atoms are under tensile stress but that the four-\nfold atoms are under a smaller compressive stress.28 During\nannealing small regions of high stress relax, leading to the\npreferential generation of threefold-coordinated atoms. The\nstress relief is, as a result of fourfold sp3 C bonds, being\nreplaced by threefold sp2 C bonds. This change to the shorter\nsp2 C bond is irreversible under normal conditions. If the\nnear-zero stress is achieved due to high-temperature anneal-\ning, care must the exercised to prevent an excessive thermal\nstress being introduced into the film on cooling back to room\ntemperature. The thermal stress can be eliminated by grow-\ning the film at above room temperature, which introduces\nsome tensile stress. Further evidence of the formation of\nclustering in tetrahedral amorphous carbon (ta-C) films was\nreported in the fluctuation microscopy studies recently un-\ndertaken by Chen et al.29 Annealing up to 600 °C resulted in\nthe increase of locally ordered regions, but the formation of\ngraphitic ordering did not occur until annealing to 1000 °C.\nMuch of the research for stress relief in hard a-C films, es-\npecially ta-C films is driven by the development of carbon-\nbased microelectromechanical systems.\nIV. INTERCLUSTER INTERACTIONS\nIN AMORPHOUS CARBON\nThe increase in intracluster delocalization also manifests\nitself in changes that can be associated with intercluster in-\nteractions. Specifically, we shall discuss how influence on\n(low-field) conductivity and (high-) field-induced electron\nemission into vacuum. Various transport studies of a-C films\nreveal a commonality in behavior with high resistivity asso-\nciated with samples with large Tauc gap. The resistivity de-\ncreases as the Tauc gap decreases and the conductivity asso-\nciated with various mechanisms such as variable range\nhopping in the more conductive DLC films.1,2 In the case of\nresistive “polymeric” amorphous carbon the conductivity has\nbeen attributed to a space charge induced current\nmechanism.1 Improvements in the conductivity have also\nbeen reported with nitrogen incorporation and attributed to a\nweak “doping” effect30 or to a reduction of the band gap\nthrough graphitization.31 In terms of postdeposition process-\ning, transport studies of annealed films also reveal an im-\nprovement in the conductivity; however, this is almost al-\nways accompanied by significant modification to the\nstructure of the film at a microscopic level. In this respect\nthermal annealing in a furnace results in an improvement in\nelectrical properties but accompanied by global changes to\nthe film. Ion implantation as a method of injection of thermal\nenergy is therefore an alternative process to modify the film\nproperties in a highly controlled manner with precise depth\ncontrol by the correct choice of ion species, ion energy, and\ndose. We have previously shown30 that by using high-dose\nB+ implantation into polymerlike films, it is possible to re-\nduce the low-field resistivity from 231014 V cm (unim-\nplanted) to 631012 V cm s231014 B+ cm−2d. Over the same\nrange the Tauc gap remained constant at about 2.6 eV, indi-\ncating that no significant increase in the mean sp2 cluster size\nhas occurred. For doses greater than 231014 cm−2, a fall in\nthe optical gap finally ends with a total collapse to 0.2 eV at\na high dose s231016 B+ cm−2d and the resistivity concomi-\ntantly decreases to 53106 V cm. The improvement in the\nelectrical characterization has been attributed to improve-\nments in the cluster-cluster interaction via a hopping related\nmechanism as shown in Fig. 6.\nDuring low-dose implantation, localized heating results in\nlocalized sp2 clusters, which remain small (as evidenced by\nthe absence of a reduction in the Tauc gap)—as shown in\nFig. 6. Before the formation of damage cascades, the con-\ncentration of the induced sites will be proportional to the ion\ndose. This nanoclustering of the sp2 sites, which maintains\nthe wide gap, increases the conductivity by decreasing the\nhopping distance. At higher doses, nanostructuring of the\nbulk of the film occurs and the band gap decreases. As a\nresult, ion implantation demonstrates that it is possible to\nimprove the conductivity without inducing extensive graphi-\ntation of the film. Further evidence for the idea of dielectric\ninhomogeneity of conductive sp2 clusters embedded in a\nmore insulating matrix can be found in the high-resolution\nscanning tunneling microscope for a DLC film, as shown in\nFig. 7. Despite the atomic smoothness, as measured by\natomic force microscopy, the STM (scanning tunneling mi-\ncroscopy) results show that there are nanometer-sized re-\ngions of higher conductivity surrounded by other regions of\nlower conductivity as shown in Fig. 7. In this respect the\nmodel presented in Fig. 6 is able to explain the STM results.\nIncreasing the concentration and size of the clusters results in\nimproved localized electrical conductivity. This is an impor-\ntant result since conventional “large area” contacts used in\ncurrent-voltage characteristics would mask the localized na-\nture of the conductivity.\nThe implication of this “dielectric inhomogeneity” can\nalso be extended to examine the field-induced electron emis-\nFIG. 6. Schematic of how the different bias growth conditions\ncan give rise to a change in the size and concentration of\nsp2 clusters.\nJ. D. CAREY AND S. R. P. SILVA PHYSICAL REVIEW B 70, 235417 (2004)\n235417-6\nsion from a-C:H films. Application of an applied electric\nfield can result in electron emission from the surface. In the\ncase of PAC films it was previously reported32 that the\nthreshold electric field for emission exhibited a dependence\nwith the film thickness with a minimum threshold observed\nfor a thickness of 65 nm. This behavior was attributed to the\neffects of internal high electric field effects within the film\nand the absence of any significant screening of the applied\nelectric field. Such an explanation is possible when one\nconsiders that the electric field from the anode will terminate\non the “more conductive” parts of the films and if these\nare associated with the sp2 clusters the low density\ns,1017 cm−3d will be insufficient to screen the film\/substrate\ninterface from the applied field. In such a situation the con-\ntrolling step in the electron emission process is at the film\/\nsubstrate interface. A different situation will result for films\ngrown at higher biases when the defect density increases. For\ntwo films deposited at −90 and −265 V self-bias, it was\nobserved33 that there is little dependence on the film thick-\nness and the lowest threshold field was reported for the film\ngrown at the highest bias, consistent with the model pre-\nsented in Fig. 6. Here, the film with the largest bias has the\ngreatest intercluster interactions since the clusters are larger\nand the cluster-cluster separation will be lowest. This gives\nrise to an emission mechanism that is dominated by the front\nsurface properties of the film. Furthermore, the local electric\nfield in the neighborhood of the clusters is enhanced, result-\ning in lower than predicted threshold fields for emission\nIt has been reported in several studies that the onset of\nstable field emission, often in more resistive samples, occurs\nonly after several voltage cycles.32,34,35 This conditioning be-\nhavior often results in lower threshold fields. In a previous\nstudy we showed that it is possible to condition a PAC film\nby current stressing—that is, the intentional passing of a cur-\nrent through the film.35 Mercer et al. performed a similar\nexperiment using a scanning tunneling microscope tip to\ngenerate a highly spatially localized electric field and effec-\ntively current stress ta-C films.36 They observed that after\nramping the tip-sample bias and current, nanostructures of\nabout 100 nm in extent form. By using high-resolution spa-\ntially resolved electron energy loss spectroscopy (EELS)\nthey showed that the predominant bonding configuration\nchanges from predominately fourfold coordinated C to three-\nfold coordinated. The net effect of the conditioning or the\ncurrent stressing treatments may well be to generate conduc-\ntive sp2-rich areas or filaments through localized Joule heat-\ning, reminiscent of the use of ion implantation to deposit\nenergy locally.\nV. CONCLUSIONS\nIn conclusion, different amorphous carbon thin films are\ncharacterized in terms of disorder and states near the Fermi\nlevel. PAC films have small clusters with a small distribution\nof cluster sizes and dominated by topological disorder. This\nis confirmed by the reduction of the Raman width at the\nhigher excitation energies and the low spin density. PAC\nfilms possess low stress with long spin-lattice relaxation\ntimes. As a result in a-C:H films, the Urbach energy is not a\ngood measure of disorder, and topological disorder domi-\nnates. Moving from PAC to DLC films, by growing at higher\nnegative self-biases the reduction in the Tauc gap and blue\nshift of the G band implies that a higher concentration of\nlarger clusters is present. Furthermore the increase in spin\ndensity s1020 cm−3d coupled with the increase in the G band\nwidth implies more distorted clusters are present. The spin-\nlattice relaxation time also shortens, implying that the para-\nmagnetic electron states couple more strongly with the lat-\ntice. At the higher spin density the ESR linewidth is no\nlonger determined by the dipole interaction, with intracluster\nexchange interactions determining the linewidth. The ex-\nchange interaction is also present at high microwave frequen-\ncies. In this regime both topological and structural disorder is\npresent and can effect the stress in the film. The disorder is\ndominated by structural disorder with little topological dis-\norder reduces thereby reducing linewidth of G band.\nACKNOWLEDGMENTS\nThe authors would like to thank the EPSRC for funding\nvia an Advanced Research Fellowship (J.D.C.) and via a\nPortfolio Partnership grant and the Carbon Based Electronics\nprogram.\n*Electronic mail: David.Carey@surrey.ac.uk\n1 S. R. P. Silva, J. D. Carey, R. U. A. Khan, E. G. Gerstner, and J.\nV. Anguita, in Handbook of Thin Film Materials, edited by H. S.\nNalwa, (Academic Press, New York, 2002), Vol. 4, Chap. 9, pp.\n403–506.\n2 J. Robertson, Mater. Sci. Eng., R. 37, 129 (2002).\n3 S. R. P. Silva and J. D. Carey, Diamond Relat. Mater. 12, 151\n(2003).\nFIG. 7. (color online) High-resolution scanning tunneling mi-\ncroscope images of a DLC film deposited at −265 V bias. The\nimage shows localized regions of higher conductivity of several\nmillimeters in diameter surrounded by less conductive regions.\nDISORDER, CLUSTERING AND LOCALIZATION\u0085 PHYSICAL REVIEW B 70, 235417 (2004)\n235417-7\n4 D. Dasgupta, F. Demichelis, C. F. Pirri, and A. Tagliaferro, Phys.\nRev. B 43, 2131 (1991).\n5 G. Fanchini, S. C. Ray, and A Tagliaferro, Diamond Relat. Mater.\n12, 891 (2003).\n6 A. C. Ferrari and J. Robertson, Phys. Rev. B 61, 14 095 (2000).\n7 J. Ristein, J. Schäfer, and L. Ley, Diamond Relat. Mater. 4, 509\n(1995).\n8 A. Zeinert, H-J von Bardeleben, and R. Bouzerar, Diamond Relat.\nMater. 9, 728 (2000).\n9 F. Giorgis, F. Giuliani, C. F. Pirri, and A. Tagliaferro, Appl. Phys.\nLett. 72, 2520 (1998).\n10 M. A. Tamor and W. C. Vassell, J. Appl. Phys. 76, 3823 (1994).\n11 R. C. Barklie, M. Collins, and S. R. P. Silva, Phys. Rev. B 61,\n3546 (2000).\n12 M. Collins, R. C. Barklie, J. V. Anguita, J. D. Carey, and S. R. P.\nSilva, Diamond Relat. Mater. 9, 781 (2000).\n13 P. W. Anderson, Phys. Rev. 109, 1492 (1958).\n14 C. W. Chen and J. Robertson, J. Non-Cryst. Solids 227, 602\n(1998).\n15 Rusli, J. Robertson, and G. A. J. Amaratunga, J. Appl. Phys. 80,\n2998 (1996).\n16 S. R. P. Silva, J. Robertson, Rusli, G. A. J. Amaratunga, and J.\nSchwan, Philos. Mag. B 74, 369 (1996).\n17 G. Fanchini and A. Taliaferro, Appl. Phys. Lett. 85, 730 (2004).\n18 C. Jäger, J. Gottwald, H. W. Spiess, and R. J. Newport, Phys. Rev.\nB 50, 846 (1994).\n19 A. Abragam, in Principles of Nuclear Magnetism (Clarendon,\nOxford, 1996), p. 126.\n20 M. A. Tamor, W. C. Vassell, and K. R. Carduner, Appl. Phys.\nLett. 58, 592 (1991).\n21 A. Ilie, A. C. Ferrari, T. Yagi, and J. Robertson, Appl. Phys. Lett.\n76, 2627 (2000).\n22 H. J. von Bardeleben, J. L. Cantin, A. Zeinert, B. Racine, K.\nZellama, and P. N Hai, Appl. Phys. Lett. 78, 2843 (2001).\n23 G. Wagoner, Phys. Rev. 118, 647 (1960).\n24 B. Druz, I. Zaritskiy, Yu. Evtuikhov, A. Konchits, M. Ya Valakh,\nS. P. Kolesnik, B. D. Shanina, and V. Visotskij, Mater. Res. Soc.\nSymp. Proc. 593, 249 (2000).\n25 B. J. Jones, R. C. Barklie, G. Smith, H. El Mkami, J. D. Carey,\nand S. R. P. Silva, Diamond Relat. Mater. 12, 116 (2003).\n26 A. A. Konchits, M. Ya. Valakh, B. D. Shanina, S. P. Kolesnik, I.\nB. Yanchuk, J. D. Carey, and S. R. P. Silva, J. Appl. Phys. 93,\n5905 (2003).\n27 M. P. Siegal, D. R. Tallant, P. N. Provencio, D. L. Overmyer, R.\nL. Simposn, and L. J. Martinez-Miranda, Appl. Phys. Lett. 76,\n3052 (2000).\n28 P. C. Kelires, Phys. Rev. B 62, 15 686 (2000).\n29 X. Chen, J. P. Sullivan, T. A. Friedmann, J. Murray Gibson, Appl.\nPhys. Lett. 84, 2823 (2004).\n30 G. A. J. Amaratunga and S. R. P. Silva, Appl. Phys. Lett. 68,\n2529 (1996).\n31 R. U. A. Khan, J. D. Carey, S. R. P. Silva, B. J. Jones, and R. C.\nBarklie, Phys. Rev. B 63, 121201 (2001).\n32 R. D. Forrest, A. P. Burden, S. R. P. Silva, L. K. Cheah, and X.\nShi, Appl. Phys. Lett. 73, 3784 (1998).\n33 J. D. Carey, R. D. Forrest, and S. R. P. Silva, Appl. Phys. Lett.\n78, 2339 (2001).\n34 A. A. Talin, T. E. Felter, T. A. Friedmann, J. P. Sullivan, and M.\nP. Siegal, J. Vac. Sci. Technol. A 14, 1719 (1996).\n35 J. D. Carey and S. R. P. Silva, Appl. Phys. Lett. 78, 347 (2001).\n36 T. W. Mercer, N. J. DiNardo, J. B. Rothman, M. P. Siegal, T. A.\nFriedmann, and L. J. Martinez Miranda, Appl. Phys. Lett. 72,\n2244 (1998).\nJ. D. CAREY AND S. R. P. SILVA PHYSICAL REVIEW B 70, 235417 (2004)\n235417-8\n"}