{"doi":"10.1080\/0968776960040207","coreId":"6845","oai":"oai:generic.eprints.org:214\/core5","identifiers":["oai:generic.eprints.org:214\/core5","10.1080\/0968776960040207"],"title":"Reviews","authors":["Barker, Philip","Hawkridge, David","Bell, Margaret","Unwin, Derick","Seek, Barbara","Richey, Rita"],"enrichments":{"references":[{"id":193236,"title":"A Taxonomy of Communication Media, Englewood Cliffs NJ,","authors":[],"date":"1971","doi":null,"raw":"Bretz, R. (1971), A Taxonomy of Communication Media, Englewood Cliffs NJ, Educational Technology Publications.","cites":null},{"id":193238,"title":"Constructivism: new implications for instructional technology',","authors":[],"date":"1991","doi":null,"raw":"Duffy, T.M. and Jonassen, D.H. (1991), 'Constructivism: new implications for instructional technology', Educational Technology, 31 (5), 7-12.","cites":null},{"id":193242,"title":"Constructivist Learning Environments: Case Studies in Instructional Design, Englewood Cliffs NJ,","authors":[],"date":"1996","doi":"10.1109\/tpc.1997.650010","raw":"Wilson, B. G. (1996), Constructivist Learning Environments: Case Studies in Instructional Design, Englewood Cliffs NJ, Educational Technology Publications.","cites":null},{"id":193237,"title":"Educational technology - a faculty resistance review',","authors":[],"date":"1996","doi":null,"raw":"Cummings, L.E. (1996), 'Educational technology - a faculty resistance review', Educational Technology Review, 5 (Winter), 18-20.","cites":null},{"id":193241,"title":"Encyclopaedia of Educational Media Commechnology,","authors":[],"date":null,"doi":null,"raw":"and McAleese , R. (eds), Encyclopaedia of Educational Media Commechnology, London, Macmillan. 71Reviews Lumsdaine, A.A. and Glaser, R. (eds) (I960;, Teaching Machines and Programmed Learning, Washington DC, N.E.A. Pressey S.L. (1926), 'A simple apparatus which gives tests and scores - and teaches', School & Society, 23, 373-6.","cites":null},{"id":193239,"title":"Human performance technology: an overview'","authors":[],"date":"1986","doi":null,"raw":"Geis, G.L. (1986), &quot;Human performance technology: an overview' in Smith, M.E. (ed.), Introduction to Performance Technology, Vol. 1, Washington DC, National Society for Performance and Instruction.","cites":null},{"id":193240,"title":"Media classification',","authors":[],"date":"1978","doi":null,"raw":"Heidt, E. (1978), 'Media classification', in Unwin, D.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"1996","abstract":"Seels, Barbara B. and Richey, Rita C, Instructional Technology: The Definition and Domains of the Field, Washington DC, Association for Educational Communications and Technology, 1994. ISBN 0–89240–072–2","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/6845.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/214\/1\/ALT_J_Vol4_No2_1996_Reviews.pdf","pdfHashValue":"ba36cda90e18624d54575ca5c31e504e6d3e35f0","publisher":"Universit of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:214<\/identifier><datestamp>\n      2011-04-04T09:23:27Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/214\/<\/dc:relation><dc:title>\n        Reviews<\/dc:title><dc:creator>\n        Barker, Philip<\/dc:creator><dc:creator>\n        Hawkridge, David<\/dc:creator><dc:creator>\n        Bell, Margaret<\/dc:creator><dc:creator>\n        Unwin, Derick<\/dc:creator><dc:creator>\n        Seek, Barbara<\/dc:creator><dc:creator>\n        Richey, Rita<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Seels, Barbara B. and Richey, Rita C, Instructional Technology: The Definition and Domains of the Field, Washington DC, Association for Educational Communications and Technology, 1994. ISBN 0–89240–072–2.<\/dc:description><dc:publisher>\n        Universit of Wales Press<\/dc:publisher><dc:date>\n        1996<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/214\/1\/ALT_J_Vol4_No2_1996_Reviews.pdf<\/dc:identifier><dc:identifier>\n          Barker, Philip and Hawkridge, David and Bell, Margaret and Unwin, Derick and Seek, Barbara and Richey, Rita  (1996) Reviews.  Association for Learning Technology Journal, 4 (2).  pp. 61-72.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776960040207<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/214\/","10.1080\/0968776960040207"],"year":1996,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"ALT-J Volume 4 Number 2\nReviews\nedited by Philip Barker\nSeels, Barbara B. and Richey, Rita C, Instructional Technology: The\nDefinition and Domains of the Field, Washington DC, Association for\nEducational Communications and Technology, 1994. ISBN 0-89240-072-2.\nEditorial note\nThis review differs from others we have so far published in ALT-J. In order to offer a\nmultiple perspective on a contentious area, we approached three reviewers. We then\nasked Barbara Seels and Rita Richey, in the light of the reviews we received, to\nreconsider their position set out in their book. In addition, Ray McAleese (Heriot-\nWatt University) has commented both on the reviews and on the reactions to them\nby Seels and Richey. We welcome any comments you may have.\nThe order in which the reviews are published here has been determined by the extent\nto which the reviewers offered a description of the book's contents.\nThis review, written by the Foundation\nDirector of the Institute for Education\nTechnology (IET) at the Open University,\nreflects the OU'spre-eminence in course\ndesign. The IET was an early pioneer of\ncollaborative course teams by including an\neducational technologist as well as a subject\nspecialist.\nDavid Hawkridge, Institute of Educational Technology,\nThe Open University\nEmail: d.g.hawkridge@open.ac.uk\nWhat is instructional technology (or, for that matter,\neducational technology)? That is a question asked\nrepeatedly by lay people when they first hear the term,\nand it can be embarrassing, even tiresome, to have to\nexplain. It is therefore entirely appropriate that AECT\n(Association for Educational Communications and\nTechnology), founded in the USA, should have\nfostered this plain book about changes since 1977 in\ninstructional technology as perceived by practitioners\nin the USA.\n61\nReviews\nAECT does not pretend to be an international\norganization, and its Committee on Definition and\nTerminology consulted widely within the USA, not\nbeyond. Nevertheless, all who work in the broad field\nof applying technology in education can benefit from\nreading this book.\nThe term instructional technology has no precise\nequivalent in Europe. Educational technology\noverlaps with it, as Seels and Richey note, but is it\ncloser to tecnologie didattiche (Italian),\nUnterrichtswissenschaft (German) or tecnologia\neducativa (Spanish)? The definition eventually agreed\nby AECT in 1994 is that instructional technology is\nthe theory and practice of design, development,\nutilization, management and evaluation of processes\nand resources for learning. Seels and Richey tackle the\nissues of definition rather thoroughly, as we would\nexpect in 124 pages. Drawing on a modicum of recent\nwritings, they analyse in detail and comment upon the\nfive domains in the definition. Fair enough, but then\nthey discuss the sources of influence on instructional\ntechnology. Here they correctly note the major\ninfluence of positivist science, particularly\nbehaviourism, without giving enough space to\ncriticisms of its failures. In my opinion, they over-\nestimate the extent to which theory has determined\npractice: a great deal of instructional technology in\npractice is still atheoretical, much like a craft.\nHaving said that, however, am I right in saying that\nnowhere is there an exposition of the ontological and\nepistemological roots of instructional technology? If\nso, that is disappointing in a reference work like this.\nWas it left out because committees do not like such\nserious and abstract discussion? Or because nobody\nwants to know about it?\nSeels and Richey describe briefly and uncritically\ncertain aspects of practice and the practitioners. In\ntheir efforts to systematize instructional technology,\nthey seem to focus their attention on what they believe\nthey have seen rather than on what might be best\npractice. Their view of the practitioners is clear but\nlimited when compared with, say, Eraut's book\nDeveloping Professional Knowledge and Competence\n(1994), which draws on Schon's ideas.\nFinally, Seels and Richey examine the role and\nimplications of the definition. It will aid\ncommunication and build a sense of community, they\nsay, because it will add to shared understanding. They\nalso suggest that the new definition, because it is\ndifferent from the 1977 one, will aid new agenda-\nbuilding. The chief difference, for me, is that in 1977\ninstructional technology was defined as a practice-\noriented problem-solving process, while in 1994 the\ndefinition is oriented towards both theory and\nThe American national perspective does come\nover in the book, in spite of AECTs attempt\nto be more international. There is a degree of\nparochialism in the citations, and the flavour\nof the book defines it as American.\nI am glad the reviewer has made the point\nabout craft. Many activities are craft-like in\ntheir eclectic use of multiple paradigms and\natheoretic assumptions. I do not feel that\ncraft should be taken to imply 'lacking\nprofessionalism'; rather, it should locate the\npractices in the authentic world of learners\nand designers - students and teachers.\n62\nAn-} Volume 4 Number 2\nThis must be getting at the heart of the\nmatter. Practice leads to better practice and\nthe development of criteria for producing\nsuch practice. These criteria must in time\nbecome an integrated body of knowledge, a\ntheory of practice. Therefore, one would\nimagine that as the practice-based approach\nbecomes more useful, the acquired procedures\nand knowledge contribute to a theory. The\nquestion one is left with when one reads the\nSeels and Richey book is 'Has learning\ntechnology come far enough?'\nOne can not but be impressed with a Code of\nEthics. The AECT Code certainly makes one\nthink about the responsibilities designers have\nto ensure that knowledge is made accessible\nand is not hidden by a particular design\nphilosophy. As historical gate-keepers,\nteachers and designers have this ethical role\nwith regard to how learners acquire skills and\ncompetencies.\nAs NCET is the official Government-sponsored\nagency that supports, applies and advises on\nwhat is known about educational technology,\none would expect this review to take a utility\nview. NCET plays a middle-of-the-road role\nbetween the academic community and the\nmarketplace.\nAbstract: No. Academic: Yes. If theory-\nbuilding is not part of a discipline and\nprofession, I do not know what is. I suspect\nMargaret Bell is more concerned with the\nutility of such a framework than how it\ncontributes to the professionalization of the\nfield.\npractice. Seels and Richey say that the change implies\nthe need for increased research and theory construc-\ntion unique to this field, and decreased reliance upon\nthe products of the research and theory of other fields.\nFor me, there's the rub. The boundaries of\ninstructional technology are fuzzy, thank goodness,\nand in its eclectic approach should lie its strength. It\ncannot stand apart. It must change with changes in the\narts and sciences it depends upon.\nFor good measure, Seels and Richey add a glossary.\nThe terms selected indicate well the book's lusty\npositivist bias. Three appendices provide data of\nvariable potential value. Do you really want 40 other\nglossaries of instructional technology? The directory of\nassociations and their publications may be useful to\nstudents and practitioners, but is already looking\ndated.\nThe AECT Code of Ethics makes interesting reading,\nbut I probably would not be able to sign up to it\nbecause I do not know how to represent accurately\nand truthfully the facts concerning educational\nmatters. The facts change and need definition and re-\ndefinition. So does instructional technology.\nMargaret Bell, Chief Executive, National Council for\nEducational Technology\nEmail: margaret_bell@ncet.org.uk\nI should make it clear that I am not an academic, and\nam not familiar with the systems and processes which\nare of relevance and important in academia. I looked\nat this book in terms of its practical use in progressing\nthe development of technology-based learning\nmaterials. I would be interested to know if the\ncontents have been tested with a commercial producer\nof instructional technology, and if so, whether they\nwere found to have made a contribution.\nI am not convinced of the value of building an abstract\nacademic subject of Instructional Technology.\nUnderstanding the effectiveness of instructional-\ntechnology materials, the full potential of them and\nthe complexity of their design, is a living topic, one\nwhich continues to grow and develop rapidly. In my\nopinion, this approach could, at worst, hinder that\nnatural progression and, at best, rapidly become out of\nstep with what is happening on the ground.\nChapter 1 left me with only one question: 'so what?'.\nWhy do we need a definition which is so carefully\nworked and in so much detail. Understanding of this\narea is in a fluid state, the technology is developing\nrapidly, new opportunities are opening up, and our\nunderstanding of technology's application to learning\nis growing. This continued development and change\n63\nReviews\ncannot be tamed, controlled or better understood by a\ndefinition; neither should progress be constrained by\nit. There is no evidence that the development of\ninstructional technology has been hampered through\nlack of definition.\nThroughout this chapter there is, in my view, too\nmuch emphasis on instruction and teaching; not\nenough on learning. The main impact of the\nintroduction of technology into the learning process is\nthat students have more opportunity to develop into\nactive learners. It changes the focus from the teaching\nto the learning process. In designing computer-based\nlearning materials, we are challenged much more by\nunderstanding the necessary support to learning than\nin the required support to teaching.\nIs it the lack of taxonomy that impedes communica-\ntion and discourages transfer of expertise from one\ntechnology to another? In any case, does the\ntaxonomy suggested in Chapter 2 not need to change\nto accommodate advances in technology?\nThe management domain does not appear to include\nlearner management. This is a very important part of\ntechnology-based learning, and may provide the key to\neffective open and flexible learning.\nIn the development domain, what is meant by\nintegrated technologies? The integration of what? CBT\nis an integration of approaches; it integrates the\nintelligence of the computer with text, graphics, etc.,\nand now increasingly with pictures and sound. CBT\nand integrated technologies are surely part of the same\ncontinuum. I am not sure that there is a common\nunderstanding of the terminology used to describe the\ndomains. I agree with the authors that Integrated\nSystems Design is an iterative process, but where, in\nthe four areas of the domain of design, is there\nconsideration of exploitation of the media? New media\nallow approaches not previously possible. How are\nthese identified and integrated into the design? My\nexperience is that new technologies require a re-think\nof learning processes.\nLearning styles (cognitive, etc.) should be recognized\nand selected, but there is no reason why more than one\nshould not be accommodated within a single product,\nadapting to the learner's requirements as identified\nand demanded.\nIn the domain of development, I am not sure why\nprint is considered the foundation of all others. Some\nproducts do not have print. Print, audio-visual media\nand CBT are all components of integrated\ntechnologies. The key characteristics of computer-\nbased materials are not those that are visible. You\ncannot, therefore, categorize\/define the media by the\nvisible characteristics. How will the new electronic\nThere is evidence that the imprecise definition\nof the field affects the way learning\ntechnologists are integrated into the academic\ncommunity (Cummings, 1996). Surely\nlearning technologists need some form of\naccreditation?\nThat makes sense. The book does seem to\navoid, if not miss, a perspective from the\nlearner. Of course, the authors set out to\nexamine the design of learning opportunities.\nOne might argue that the whole emphasis\nshould be learning technology, not\ninstructional technology.\nTaxonomies do seem to have an 'academic'\nflavour. What would be useful in the book is\nto have more instances and examples. With a\nclassification and instances (for example,\n'positive' and 'negative'), the reader might\nmake more use of the framework. For an\nearly taxonomy, readers should look at Bretz\n(1971) or Heidt (1978).\nThis seems very important. The mean-end-\nmeans dialectic of instructional design often\nalerts the designer to new media\nopportunities, and such opportunities often\nlead to radical new designs.\nVolume 4 Number 2\nThe issue here, to my mind, is that of\nconvergence. There is an inevitable\nconvergence of all forms of technology. This\nwill lead to less emphasis on media\nclassification and selection (see above). To\nsome it may be a pity that the unique\ncharacteristics of some media are lost, for\ninstance the entertainment aspect of early film\nand the fun of early simulation games.\nNo, but practice or utility are not sufficient\nattributes for a technology of learning or\ninstruction.\nThis is a pity. I sense that there is a growing\napproach in education to the utility of skills\nfor the present (being fit for the job) as\nopposed to an investment in generic skills (of\nuse in some unknown setting). Commercial\ninstructional technology may have to be more\n'immediate' in its design philosophy.\ncommunication technologies be categorized, and what\nwill be the result of the convergence of telecom-\nmunication and multimedia?\nThe main problem with this chapter, as I see it, is that\nit does not recognize that the relationships between\nand within the processes are more important than the\ncomponent parts. In interactive design, the\nrelationships and links are more important than the\nindividual components. I do not believe the\ninstructional design process can be understood\nthrough a reductionist approach. The principles of\ncognitive science are not confined to the development\nof CBT. (Again what is the difference between CBT\nand Integrated Technologies?) Even in CBT there\nmust be some visual presentation of material, and\nmost computers now have sound output.\nThe concepts of media utilization and media selection\nare being overtaken by the digitization of the full\nrange of media, and this is being driven by the\nincreasing availability and bandwidth of electronic\ncommunications. We are moving rapidly to a situation\nwhere all media will have a common form; different\ntypes of information will be selected and combined for\nspecific purposes.\nIn Chapter 4 (The Practice of Instructional\nTechnology) the authors state that 'practice has had\nmore influence than theory'. I agree entirely. But I was\nvery interested in the assertion that instructional\ntechnology has moved from a craft via a profession to\na field of study. Is it that mature? If so, has it followed\nthat path? Can the field of study be separated from the\nprofession and practice?\nI would suggest that the developments have been, and\nstill are, so rapid that a different approach may be\nneeded. New stages in the history of instructional\ntechnology have often brought new practitioners; not\nnecessarily learning from their predecessors. For\nexample, the introduction of interactive video brought\na number of video producers into the field who made\nmany of the mistakes evident in the early years of\nCBT. Commercial producers work in a competitive\nenvironment; this can cause resistance to sharing\nexperience and expertise.\nMy understanding of the link between a field of study\nand a profession is that the route to the profession is\nestablished through academic achievement; I think\nthere is little evidence of that in commercial instruc-\ntional technology.\nThe implications in the last chapter are not positive\nones. Trying to capture and define the process has led\nto a feeling of stagnation, inflexibility and immobility\nin an area that is at the core of the changes impacting\n65\nReviews\non society. This is a dynamic, iterative process; it\ncannot be captured in a static medium. This area of\nwork and thought may need a different approach.\nI was left wondering about the purpose of the book. I\nassume it is to carve a position for instructional\ntechnology in academia; perhaps to fit educational\ntechnologists into the academic hierarchy. It may also\nbe driven by a need to create a recognized profession\nand professionalism in this area.\nAll of those reasons are valid and probably worth\npursuing. However, they are not on my agenda, nor do\nthey contribute to my personal or corporate objec-\ntives. I am not qualified to comment on what a group\nof scholars agree to agree on.\nDerick Unwin, formerly Head of Educational Research\nand Development at Queensland University of\nTechnology, Brisbane, Australia\nEmail: eemcat@ozemail.com.au\nAs one who in recent years has withdrawn from day-\nto-day involvement with instructional\/educational\ntechnology (edtech), I was particularly interested to\nsee if this latest attempt to define and delimit would\nappeal to me as a non-practitioner. I have to report\nthat little has changed over the years: all is still\nenmeshed in a thicket of Brer Rabbitry. This is almost\ncertainly inevitable: the academic leaders in the field\nhave always tried to draw together threads which\nresolutely resist any such taxonomic weaving.\nIn their seminal work defining the scope of\neducational technology Lumsdaine and Glaser (1960)\neven included arcane devices such as one for\nimproving firearm trigger-work as an example of the\ngenre. The 1960s impetus was very much geared to the\nconcept of the teaching machine, with a generous\noverlay of psychological justification. Since that time,\neach and every promising candidate - and some not so\npromising - from the worlds of entertainment, military\ntraining, business management, computer technology,\netc. has been press-ganged into educational\ntechnology, along with all the associated jargon and\nanecdotal evidence. Not surprisingly, the notion of\nwhat educational technology actually is becomes a\nlittle hazy along the way.\nOne solution would be to set out an operational\ndefinition; i.e. a statement of what educational\ntechnology really does. The problem with this\napproach is that it yields slim pickings: few of us could\nput hand on heart and list a series of benefits (to\nlearners not to educational-technology professionals!)\nwhich have arisen as a result of all the educational\ntechnology developments since, say, 1954. In fact, an\nThis view is surely a little too anti-\nscholarship. Clearly, the real-world trainers\nneed results not theories, but is not the\napproach that education supports of\nproviding a generalizable explanation of what\nto teach, as well as how to teach, worth\nmaintaining?\nThis review should be influenced by the fact\nthat Derick Unwin was one of the founding\nfathers of programmed learning in the UK He\nhas seen the emergence of the technology of\ninstruction and education over 30 years. Of\ncourse, it may be that with such a historical\nperspective he may yearn for the values of early\nUK-based programmed learners. One must\nread the enthusiasm of the early programmed\nlearners to wonder where things went wrong.\nFor example, Annett (1964) writes of'putting\nteaching on a firmly scientific basis and from\nthis develop a new technology adequate to meet\nthe rapidly growing demands for training and\neducation.\nIt is fair to comment that this reviewer had his\nown attempts to classify media and provide\nguidelines for its use (Unwin, 1969).\n66\nALT-J Volume 4 Number 2\nThe word academic has such a pejorative ring.\nPerhaps there is a free masonry to the\nprofession. Certainly to the uninitiated,\ndesign models that draw on 'epitomes'\n(Rigileuth) and 'algo-heuristic' paradigms\n(Landa) have the feel of arcane practice.\nThere must be strength in having denotive\nmodels and practices if- and only if- they\nare used and are found to be useful.\nunbiased observer of the educational scene might feel\nquite justified in concluding that the output of the\neducational systems in Western countries has\nimproved little, if at all, in spite of the staggering\nincrease of available technological resources, and huge\ninvestments in the design of materials. It is noteworthy\nthat at the cutting edge of instruction, e.g. the\nprovision of 'tutorials' for computer software, despite\nthe use of interactive CD-ROM and other 1990s\nreincarnations of Sidney Pressey's teaching machine\n(Pressey, 1926), we frequently encounter absolutely\nabysmal teaching materials.\nNor does the quality of instruction encountered in\nUniversities of the Air seem to have advanced much\nfurther than the 'Tell 'em what you're going to tell\n'em, then tell 'em, then tell 'em what you've told 'em'\nschool of educational communication. Instructional\nand educational technology can be usefully compared\nto the entertainment industry. Both are concerned\nwith communication, and both have evolved from very\nbasic uses of human skills and rudimentary\ntechnology, through to exploitation of the latest\nelectronic and optical techniques. Both sets of\nendeavours employ a smorgasbord of experts, and in\neach case there is an end product, hopefully tailored to\nthe requirements of the consumer. Why is there no\nequivalent in educational technology of internationally\nrecognized producers, directors, performers, authors,\nphotographers, and so on?\nIn fact, the only celebrities in educational technology\nare not practitioners at all: they are prominent\nacademics whose main hands-on familiarity with\neducational technology is using a word processor to\nwrite lecture notes for their own courses. Without\nbeing discourteous, one might diffidently suggest that\neducational technology as defined and described in the\nvolume under review has effectively been hijacked by\nan academic masonry, fiercely defensive of its rituals\nand esoteric protocols.\nIn this context one can only admire the thoroughness\nof Seels and Richey: in a mere 124 pages (plus\nappendices, etc.) they have visited every possible\naspect of their subject matter. This is a t our deforce in\nits coverage of the liturgy of academic educational\ntechnology in 1994, a veritable catechism for the\nfaithful.\nThere is no doubt that members of educational\ntechnology academia will find much to applaud in this\nrigorous exposition of the minutiae of their tools of\ntrade. Perhaps fortunately, nothing here is likely to\nhave much effect on learning and teaching.\n67\nReviews\nBarbara B. Seek and Rita C. Richey: A considered\nreply (April 1996)\nEmail: bseels+@pitt.edu & rrichey@cms.cc.wayne.edu\nA mature field demands a complementary and\ncontinuous relationship between practice and theory.\nInstructional\/educational\/learning technology has\nprogressed to the' point where both are well\nestablished. When a book intended to explain this\ninteraction of practice and theory is examined only\nfrom a practitioner orientation, distortions can occur.\nOur book describes the evolution of our field. The\nbook was not intended to be evaluative; therefore,\npositions were not taken about one theoretical\norientation or another. Apparent emphases only\nreflect historical development. Depending on the\nsetting in which one works, there is a tendency to feel\nthat more attention should have been paid to a specific\ntheory. For example, many people in schools voice a\nconcern for more attention to constructivism (Duffy\nand Jonassen, 1991; Wilson, 1996). Conversely, many\nworking in corporate training environments would\nprefer more emphasis on performance technology\n(Geis, 1986).\nThese controversies reflect the healthy diversity of the\nfield. We deliberately included alternate perspectives,\nand viewed the field as broad. and inclusive. One\nimportant area of discussion, as the project\nprogressed, was the choice of domains and their\ncomponents. We anticipate that both the sub-\ncategories and the domains will grow and change as\nthe field develops. Furthermore, the taxonomy\npresented in the book represents the points of view of\na group of people at a given period in time, and\ncontinued analysis and discussion is desirable.\nFor example, we think the recommendation of the\naddition of learner management is valuable. It is true\nthat the field has expanded historically primarily\nthrough changes in practice. The increasing demand\nfor practice has created pressure for the many\nacademic programmes in the field. In the United\nStates, most practitioners either enter the field from\nacademic programmes, or enter an academic\nprogramme after obtaining a position in the field.\nThere are about 50 doctoral programmes here, and\nmore than twice that number with master's and six\nyear programmes. In addition, there are over 50\ngraduate programmes in educational computing.\nThese programmes are listed annually in The\nEducational Media and Technology Yearbook\npublished by Libraries Unlimited.\nThere is also pressure for synthesis from over 40 years\nof extensive research, including the development and\nThe authors of the book were given the\nopportunity of reading the reviews above and of\ncommenting. They were asked to extend the\ndebate rather than make counter-claims or\nconcentrate on justifying their own approach.\nThis was, then, the starting point. The field\nhas come far enough to merit careful scrutiny,\nand one test that needs to be applied is 'Can\nthe pragmatics of practice lead to a\nsustainable theory?'\nOf course the book - like any volume - is\ntime-stamped. But the question here is: 'Has\nthe field come far enough to merit a defining\ntreatment?' It is not a question of how Seels\nand Richey view it: it is instructional\ntechnology that is under the microscope.\nThe impressive influence of the ID 'free\nmasonry' is not to be ignored. Surely the\ngraduates of such programmes represent a\ncritical audience for the value that a training\nin instructional technology provides?\n68\nALT-} Volume 4 Number 2\nThis is where one wonders about the\ninfluences of instructional theorists on the\nAECT definition. Although there is ample\ncitation given to theorists such as Rigileuth's\n(1983) Elaboration Theory, such theories are\nnot instantiated in the AECT definition. One\nis left with a question about the atheoretic\nview this definition of instructional\ntechnology has. I do not see an attempt to\nsynthesize Merrill's Component Display\nTheory with Gagne-Briggs' Events of\nInstruction. Perhaps AECT and its expert\ngroup could not reach a negotiated settlement\nbased on the conflicting theories of\ninstruction.\nThe authors are a little self-conscious here.\nThe reviewers have not necessarily found that\nthe book has no use; rather, one senses that\nthey feel that the field does not merit such\ntreatment.\nThis is where the Atlantic divide makes most\nimpact. It may well be that there is a\nconsiderable influence felt in schools, training\norganizations and even business due to\ninstructional technology - in the USA. The\nquestion one is left with is: 'Why has this not\nhappened in the UK?'(see the reference to the\ndevelopment of programmed learning above).\nI would like a citation here to corroborate the\nassertion that instructional theory has an\neffect on teaching and learning.\ndissemination of theory. The existence of this research\nand theory is documented by the forthcoming\nHandbook of Research on Educational Communications\nand Technology edited by David H. Jonassen and\nbeing published by Macmillan. Moreover, Pergamon\nhas just released the second edition of the International\nEncyclopaedia of Educational Technology edited by\nTjerd Plomp and Donald P. Ely, which emphasizes the\nfield's rich theoretical history.\nWhile we do not feel adequate to describe the situation\nin the United Kingdom, in the United States the areas\nof theory and practice are equally dynamic. Here,\nacademic-programme faculty rightfully see themselves\nas training practitioners as well as those who will teach\nin higher education settings and do research.\nIt is seldom that one teaches or does research here\nwithout also developing materials and consulting on\ndesign. It seems likely that this orientation to academic\nprogrammes was not shared by the reviewers.\nConsequently, cross-cultural differences between our\ntwo countries lead to conflicting viewpoints.\nWe would like to explain why the book was written\nbecause the reviewers seemed to feel the project was\nneither needed nor useful. The AECT has an\ninternational focus. It has members from 42 countries,\nincluding a large contingent from Canada and a well-\nestablished international division.\nMany of those who attend AECT's annual convention\nare international members. This convention is\nregarded by many as one of the most dynamic\nconvocations of professionals in the field offered\ntoday. AECT has a long standing Committee on\nDefinition and Terminology which has published a\nconsensus on the field's functions and identity in 1963,\n1972,1977, and now in 1994. The Committee involved\nwith the 1994 redefinition effort, which was an attempt\nto update language and description about the field,\ndecided to focus the effort nationally in order to make\nthe task manageable. However, several members of the\nCommittee were active internationally, and one\nmember was from Canada.\nOne of the reasons AECT makes a continuous\ncommitment to the process of redefinition is to\nimprove communications with the many organizations\nthat contribute research and practice to the field and\nthat use instructional technology. As for the point that\nthe field and its theory have no effect on teaching and\nlearning, research does not support this.\nResearch and theory help practitioners justify their\nroles and predict the impact of specific strategies and\ntechniques. This is especially important in an era of\nlimited resources. It is much more difficult to defend\nprogrammes and jobs without a consensus on identity\n69\nReviews\nand areas of contribution. It takes the joint efforts of\npractitioners and academicians to sustain a field and\nprofession.\nThe book is intended for all those in the field:\nresearchers, academicians, and practitioners. Hope-\nfully, everyone finds a home, though clear boundaries\nare established and not set in concrete. Nevertheless,\nthe reviewers are right in stating that academic\nprogrammes led the redefinition effort, and that they\nneed the book more than practitioners. What is\nmissing from this observation is that in today's world,\npractitioners need the theory disseminated by\nacademic programmes in order to collaborate and be\ncompetitive, just as academic programmes need\ninteraction with practice in order to make dynamic\ncontributions.\nEvery year in the United States, a loosely organized\ngroup of academic professors in Instructional\nTechnology meets at a lake near Indiana University in\nBloomington. Attendance is usually about 120.\nTypically, practitioner representatives also attend this\nmeeting, and there have been representatives from the\ninternational arena. The redefinition effort was\nsuccessful because of support from this group\n(Professors in Instructional Design and Technology).\nIt is not surprising that there is more interest among\nacademic programmes than among practitioners.\nThe definition does not change the tasks or functions\nof a practitioner. The impact is greater in academic\nprogrammes because redefinition can have a direct\neffect on (a) teaching and learning about instructional\ntechnology, (b) reporting and synthesizing research\nand theory, and (c) communicating across disciplines\nand areas. The domains and sub-categories can\nilluminate gaps in theory that need to be addressed\nand thus help build support for research agendas.\nOther issues arose during the redefinition project such\nas whether to use the term instructional or educational\ntechnology, and whether the field is a discipline.\nInstructional was chosen because in the USA the field\nof instructional technology is more active in corporate\nand government settings than in schools, and\neducational implies schools only.\nThis term also allowed us to begin the definition with\nthe word instruction and end it with the word learning,\nwhich many felt reflected the field's focus more than\nthe word educational. Nevertheless, we continue to be\nconcerned about the different usage internationally,\nalthough we treat the terms as synonymous. A further\ndiscussion of these issues and the redefinition process\nis found in a case study we wrote for the 1994\nEducational Media and Technology Yearbook.\nWe would like to conclude by responding briefly to a\nThis must be the test. Can such a definition\nhelp the practitioner? This is the question that\nall three reviewers have been asking. I had\nhoped for a stronger case to be made for the\nexpertise of instructional designers. The book\ndoes seem to avoid the evidence that\nparticular instructional strategies can and do\nmake for effective learning situations. Do I\nwant a theory of design or a theory of\nlearning? I feel that there are too many\nlearning theories to be of any practical use to\ncourseware or learning designers.\nTerms such as instructional technology can be\nseen as pejorative in the UK. The same is true\nof IT- Information Technology. I fail to see,\nin its many definitions, the effective use of\n'information' when we use this term as being\nsynonymous with educational technology in\nUK higher education. It was probably for this\nreason that the Association for Learning\nTechnology adopted the term learning\ntechnology.\n70\nALT-] Volume 4 Number 2\nI am left a little disappointed. I had hoped\nthat after being in the field for 25 years, I\ncould begin to use the description of\n'educational technologist'. In fact, I find the\nmore relevant 'learning technologist' still\ndifficult to sustain. I feel that the field should\nhave progressed more. Seels and Richey have\nbrought a scholarly treatment to selective\nelements. I would have liked them to address\nthe integration of instructional theories. I feel\nthat such a bottom-up approach would have\nbeen more useful than the top-down\napproach adopted by Seels and Richey.\nfew specific points raised by the reviewers, starting\nwith Margaret Bell's comments. We agree that a\ndefinition cannot and should not contain or control or\neven constrain the field. We believe, however, that it\ncan improve communication. Each AECT definition\nhas become part of the historical record of our field.\nOne way in which the field is hampered by lack of\ncurrency in definition is in defending jobs and\nprogrammes. We also agree that many aspects of the\ndefinition need elaboration and discussion.\nThe committee always intended to expand the debate\ninternationally once a national consensus was achieved\nand opportunities were available. The book contains\nvisual representations which emphasize important\nrelationships among domains and between theory and\npractice. The authors take the position that a field of\nstudy cannot be separated from the profession or\npractice. The book relates practice to the knowledge\nbases of the field.\nFinally, we address specific points made by Derick\nUnwin. The field has progressed beyond purely\noperational or practice-based definitions. These are\nfine but are not adequate to meet all the field's needs\nfor definition. Hopefully, one benefit of taxonomic\ntheory presented in the book is the continued progress\nof a profession that provides support for learning. If\nnothing in teaching or learning has or will change due\nto instructional technology, then neither practice nor\ntheory in the field are justifiable. This is patently not\ntrue as the demand for instructional technology and\nthe performance of instructional technologists, in the\nUSA at least, documents.\nReferences\nAnnett, A. (1964), Editorial, Programmed Learning, 1\n(1), 2-4.\nBretz, R. (1971), A Taxonomy of Communication\nMedia, Englewood Cliffs NJ, Educational Technology\nPublications.\nCummings, L.E. (1996), 'Educational technology - a\nfaculty resistance review', Educational Technology\nReview, 5 (Winter), 18-20.\nDuffy, T.M. and Jonassen, D.H. (1991), 'Construc-\ntivism: new implications for instructional technology',\nEducational Technology, 31 (5), 7-12.\nGeis, G.L. (1986), \"Human performance technology:\nan overview' in Smith, M.E. (ed.), Introduction to\nPerformance Technology, Vol. 1, Washington DC,\nNational Society for Performance and Instruction.\nHeidt, E. (1978), 'Media classification', in Unwin, D.\nand McAleese , R. (eds), Encyclopaedia of Educational\nMedia Commechnology, London, Macmillan.\n71\nReviews\nLumsdaine, A.A. and Glaser, R. (eds) (I960;,\nTeaching Machines and Programmed Learning,\nWashington DC, N.E.A.\nPressey S.L. (1926), 'A simple apparatus which gives\ntests and scores - and teaches', School & Society, 23,\n373-6.\nUnwin, D. (1969), Media and Methods: Instructional\nTechnology in Higher Education, London, McGraw\nHill.\nWilson, B. G. (1996), Constructivist Learning Environ-\nments: Case Studies in Instructional Design,\nEnglewood Cliffs NJ, Educational Technology\nPublications.\nJudith Jeffcoate, Multimedia in Practice -\nTechnology and Applications, BCS Practitioner\nSeries, Prentice-Hall International, 1995. ISBN:\n0-13-123324-6. £24.95.\nRay Welland concludes his editorial preface to\nthis book with the sentence: 'If you want to find\nout what multimedia is and what it has to offer\nthis is an excellent place to start'. The comment\nreflects the major strength of this book, which\ndoes provide an excellent starting place for\nanyone wanting to learn more about\nmultimedia. The author explains what multi-\nmedia' is today and the technology involved,\ngives example applications, and projects current\ntrends forward to explore the use of multimedia\nin the future. She clearly states the perceived\naudience for the text as 'business managers and\nproject leaders who need to introduce\nmultimedia technology into their applications'.\nA guide to using the text is provided: Parts I\nand III are suitable for readers with no technical\nknowledge; Part II requires familiarity with\ncomputer architecture, and Part IV is most\nsuitable for managers planning a multimedia\nproject. These guidelines are useful, but the text\nas a whole will appeal to anyone who has an\ninterest in learning about multimedia. Technical\nknowledge is advantageous in some sections,\nbut the author takes time to explain clearly, and\nuses examples to illustrate points.\nThe book is very well structured. The author\nprovides an excellent summary of the content in\nthe preface. This clarity of structure continues\nthroughout the text; for example, each chapter\nbegins with a brief outline of its contents and\nconcludes with a summary and references.\nMultimedia is a subject engulfed by acronyms\nand, to prevent confusion, the author provides a\ndetailed glossary which at times proves to be\nvery useful. A bibliography and a full index are\nfurther resources which the reader can draw\nupon.\nPart I, 'Multimedia Today', begins by painting\na scenario of a modern family using new\ntechnology in their everyday lives, then projects\nthe same family into the year 2001, highlighting\nthe role technology may play in their lives in the\nfuture.\nPart II, 'Technology', deals with the complex\nareas that make up multimedia, and is the most\ntechnical section of the book, dealing with\ndifferent platforms, development tools, storage\nmethods and the components that make up a\ntruly multimedia application such as images,\naudio and video. The chapters focusing on the\ndifferent media are divided into sections\ndescribing applications, capture, compression\nand standards, as well as detailing information\nspecific to each medium. A history of the media\nis provided, enabling the reader to see, for\nexample, .how standards have evolved. This\ntechnique of placing information within its\nhistorical context is used throughout the book,\nand is vital for a reader who may be coming to\nthe topic for the first time.\nPart III returns to the theme with which the\nbook began: 'Applications'. It focuses on\npresent use and future trends. Again the author\nplaces the use of multimedia in its historical\ncontext: the early use of multimedia was largely\nfor off-line training and education using\ninteractive videodisk and standalone players.\n72\n"}