{"doi":"10.1063\/1.1332980","coreId":"71222","oai":"oai:eprints.lancs.ac.uk:4490","identifiers":["oai:eprints.lancs.ac.uk:4490","10.1063\/1.1332980"],"title":"Superluminescence in InAsSb circular-ring-mode light-emitting diodes for CO gas detection. .","authors":["Sherstnev, V. V.","Monahov, A. M.","Krier, A.","Hill, G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2000-12-11","abstract":"We report on the superluminescence of an InAsSb light-emitting diode, operating at 4.6 mum, suitable for carbon monoxide gas detection. The source is based on an optical whispering (or circulating) mode which is generated near the edges of the mesa and which is responsible for the superluminescence. A pulsed optical output power in excess of 2.2 mW at room temperature has been measured, making these emitters suitable for use in cost-effective instruments for the environmental monitoring of carbon monoxide at 4.6 mum. (C) 2000 American Institute of Physics. [S0003-6951(00)04151-6]","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/71222.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/4490\/1\/sherstnev2000a.pdf","pdfHashValue":"f7184b38de2560b1feb5f96e98907b382e96e72a","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:4490<\/identifier><datestamp>\n      2018-01-24T03:12:58Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Superluminescence in InAsSb circular-ring-mode light-emitting diodes for CO gas detection. .<\/dc:title><dc:creator>\n        Sherstnev, V. V.<\/dc:creator><dc:creator>\n        Monahov, A. M.<\/dc:creator><dc:creator>\n        Krier, A.<\/dc:creator><dc:creator>\n        Hill, G.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We report on the superluminescence of an InAsSb light-emitting diode, operating at 4.6 mum, suitable for carbon monoxide gas detection. The source is based on an optical whispering (or circulating) mode which is generated near the edges of the mesa and which is responsible for the superluminescence. A pulsed optical output power in excess of 2.2 mW at room temperature has been measured, making these emitters suitable for use in cost-effective instruments for the environmental monitoring of carbon monoxide at 4.6 mum. (C) 2000 American Institute of Physics. [S0003-6951(00)04151-6].<\/dc:description><dc:date>\n        2000-12-11<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/4490\/1\/sherstnev2000a.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1063\/1.1332980<\/dc:relation><dc:identifier>\n        Sherstnev, V. V. and Monahov, A. M. and Krier, A. and Hill, G. (2000) Superluminescence in InAsSb circular-ring-mode light-emitting diodes for CO gas detection. . Applied Physics Letters, 77 (24). pp. 3908-3910. ISSN 1077-3118<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/4490\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1063\/1.1332980","http:\/\/eprints.lancs.ac.uk\/4490\/"],"year":2000,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"APPLIED PHYSICS LETTERS VOLUME 77, NUMBER 24 11 DECEMBER 2000Superluminescence in InAsSb circular-ring-mode light-emitting\ndiodes for CO gas detection\nV. V. Sherstnev and A. M. Monahov\nIoffe Physico-Technical Institute, St. Petersburg, 195279, Russia\nA. Kriera)\nPhysics Department, Lancaster University, Lancaster, LA1, 4YB, United Kingdom\nG. Hill\nIII–V Central Facility, Electronic and Electrical Engineering Department, University of Sheffield,\nMappin Street, Sheffield, S1 3JD, United Kingdom\n~Received 19 June 2000; accepted for publication 26 October 2000!\nWe report on the superluminescence of an InAsSb light-emitting diode, operating at 4.6 mm,\nsuitable for carbon monoxide gas detection. The source is based on an optical whispering ~or\ncirculating! mode which is generated near the edges of the mesa and which is responsible for the\nsuperluminescence. A pulsed optical output power in excess of 2.2 mW at room temperature has\nbeen measured, making these emitters suitable for use in cost-effective instruments for the\nenvironmental monitoring of carbon monoxide at 4.6 mm. © 2000 American Institute of Physics.\n@S0003-6951~00!04151-6#The midinfrared ~2–5 mm! spectral range contains the\nstrong fundamental molecular absorption bands of a number\nof combustible and atmospheric pollutant gases. Currently,\ninfrared gas detection techniques based on optical absorption\nare becoming increasingly popular as they are the only ones,\nwhich are truly gas specific and therefore reliable for gas\nsensor instrumentation.1,2 Consequently, there has been\nmuch research interest aimed at providing monochromatic\nsources suitable for gas analysis and detection, such that a\nnumber of midinfrared light-emitting diodes ~LEDs! operat-\ning at different target wavelengths have been realized.3–6\nNonradiative recombination is a significant problem in\nnarrow gap III–V semiconductor light sources and both Au-\nger and Shockley–Read–Hall recombination processes can\nlimit the internal quantum efficiency and output power. Until\nnow, this has prevented the practical application of these\nLEDs in gas sensor instrumentation. Previously, we reported\non the fabrication of a LED for CO detection with an optical\noutput power of 50 mW ~Ref. 7! and subsequently, by using\na rare earth gettering technique8 to purify the active region,\nan improved device with a pulsed output power in excess of\n1 mW has been achieved.9 The increase in optical output\npower in our recent investigations has come about largely\nthrough a careful reduction of the residual carrier concentra-\ntion in the active region of mesa etched LEDs with a central\ndot contact. In this letter, we report on the fabrication of a\nsuperluminescent LED with a ring contact which produces a\ncircular waveguide due to current crowding effects. A whis-\npering gallery mode is generated as injection is increased,\nresulting in superluminescence and a 300 K LED with an\noptical output power in excess of 2.2 mW at 4.6 mm.\nThe LEDs were all fabricated from III–V double hetero-\nstructures grown by liquid phase epitaxy ~LPE!. A conven-\ntional horizontal, multiwell graphite sliding boat was used\na!Electronic mail: a.krier@lancaster.ac.uk3900003-6951\/2000\/77(24)\/3908\/3\/$17.00for the LPE growth of the LED structures onto n-type InAs\n~100! substrates. These were 14 mm314 mm square with a\ncarrier concentration of 131018 cm23 and were obtained\nfrom Wafer Technology Ltd. The LED structure, which has\nbeen described in detail previously elsewhere,7 consists of\ntwo cladding layers of N–InAsSbP and P–InAsSbP and an\nundoped active region of InAs0.89Sb0.11 sandwiched between\nthem. Because the InAs0.89Sb0.11 ternary active region mate-\nrial has a large lattice mismatch with respect to the InAs\nsubstrate layer, a buffer layer, with an intermediate compo-\nsition of InAs0.94Sb0.06 and having a 0.41% positive mis-\nmatch to the InAs substrate layer, was introduced between\nthe substrate and the N-type InAsSbP layer in order to reduce\ndislocations and to relieve strain caused by the lattice mis-\nmatch.\nThe buffer layer was heavily doped ~n type! with Te up\nto 431018 cm23 and was 4 mm in thickness. The quaternary\ncladding layers were doped to 131017 cm23 n type and 2\n31017 cm23 p type, respectively. The resulting epitaxial\nstructures were processed using conventional photolithogra-\nphy, but two different types of LED chips were fabricated for\ncomparison. For the first type ~LED I! mesa diodes were\nfabricated from the patterned epitaxial wafers by dry plasma\netching using CH4:H2 to produce round mesas 420 mm in\ndiameter ~emitting area 1.3931023 cm2!. The mesa surface\nwas then passivated using Si3N4. A Nomarski microscope\nphotograph of a typical mesa etched ~LED I! chip produced\nin this way is shown in Fig. 1. For the second type of device\n~LED II! square chips of dimensions 450 mm3450 mm ~with\nemitting area 1.9431023 cm2! were defined, again using\nphotolithography, and were etched out, but this time using\nwet chemical etching and without forming a mesa structure.\nThe ohmic top contact which was employed was the same\nfor both types of devices and was produced in the form of a\nring contact which was 300 mm in diameter and 30 mm wide.\nThe corresponding back contact was deposited over the en-8 © 2000 American Institute of Physics\n3909Appl. Phys. Lett., Vol. 77, No. 24, 11 December 2000 Sherstnev et al.tire rear surface of the chip. Each of the contacts was depos-\nited by thermal evaporation of Au:Zn alloy1Au on the p\nside and Au:Te alloy1Au on the n side of the diode, respec-\ntively. Once the LED chips had been prepared, they were\nmounted onto standard TO49 packages using Ag epoxy. Be-\nfore testing, they were also equipped with a small parabolic\nreflector which was attached to the TO-49 header in order to\nhelp focus the LED output in the forward direction. The full\nwidth at half maximum ~FWHM! of the resulting output\nbeam obtained with this arrangement ~for each LED type!\nwas about 12°. Since the LED chip was effectively placed at\nthe focus of a parabola, the output beam was focused to a\nsmall spot ~,1 mm diam.! at a distance about 40 mm away,\nwhich is near optimal for many gas sensor instrument appli-\ncations.\nFigure 2 shows the electroluminescence emission spectra\nof the mesa etched LED I measured with increasing drive\ncurrent. The distinctive feature of these spectral curves is\nFIG. 1. Nomarski microscope photograph of LED I.\nFIG. 2. The room-temperature electroluminescence emission spectrum ob-\ntained from LED I, measured at increasing drive currents: 15 mA ~curve 1!,\n50 mA ~curve 2!, and 100 mA ~curve 3! at 560 Hz using a 50% duty cycle.their decreasing linewidth with increasing current. The half-\nwidth ~FWHM! of the line at 15 mA is 880 nm whereas at\n100 mA it is only 580 nm. The ratio of these halfwidths is\n1.51. This spectral behavior shows that the device under con-\nsideration is a superluminescent diode. LED II also exhibited\nsome line narrowing in the electroluminescence spectrum but\nthe ratio of the halfwidths under the same drive conditions\nwas only 1.17. The dip near 4.2 mm is due to CO2 absorption\nfrom the atmosphere. The optical output power was also\nmeasured for the two different devices with a pulse duration\nof 2 ms at a repetition rate of 1 kHz in the current range from\n0.2 to 3 A. The resulting optical output–current relationships\nare compared in Fig. 3. Both the curves have a linear portion\nin the current range from 0.2 to 1 A. The corresponding\nslopes were determined to be 1.05 for LED I and 0.88 for\nLED II. A value of the slope of the light–current character-\nistic which is greater than 1 is further evidence for superlu-\nminescence in LED I.\nThe above results demonstrate that LED I operates as a\nsuperluminescent diode unlike LED II. The LED I device\nhas a ring contact with external and internal diameters much\nlarger than the active layer thickness. The conductivity of the\nupper gold ring contact and the heavily doped n1 layer ~and\ncertainly the lower contact! are at least two orders of mag-\nnitude higher than the conductivity of the active layer. One\ncan estimate the resulting current density distribution in the\nactive layer by considering, as a model, a conductive layer\nbetween an infinite metal plate and a metal ring.10 The cur-\nrent density distribution on the lower plate is given by ~units\nare chosen so that the layer width is a unit of length and the\ncoefficient before the integral is equal to 1!;\njZ~R !5E\nr1\nr2\nES 4Rx11~R2x !2D\n~11~R2x !2!3\/2 dx , ~1!\nwhere r1 and r2 are the internal and external radii of the ring,\nFIG. 3. Light–current characteristics measured from the 2 different LEDs.\nLED I is a mesa etched LED chip with a diameter of 420 mm, LED II is\n4503450 mm square. Both LEDs were fabricated with a ring contact 300\nmm in diameter. The characteristics were measured at room temperature at\ncurrents from 0.2 to 3.0 A in the pulsed regime with a 1 kHz frequency\nusing a 0.2% duty cycle ~2.0 ms pulses!.\n3910 Appl. Phys. Lett., Vol. 77, No. 24, 11 December 2000 Sherstnev et al.R is the distance from the center of the ring to the point of\nobservation, and E is the complete elliptic integral;\nE~x !5E\n0\np\/2\n~12x sin2 u!1\/2du .\nA plot of the resulting current density distribution is\nshown in Fig. 4 and from which current crowding in the\np-type material under the ring electrode is evident. Because\nof the increased carrier concentration the refractive index is\nreduced11 and a circular ring waveguide arises between the\nring and the edge of the mesa. The resulting refractive index\nprofile is also shown schematically in Fig. 4. Consequently,\nthe optical gain is locally higher near the edge of the mesa\nthan in the rest of sample. This is of course the same for both\nLED I and LED II. However, the optical output power dif-\nference between LED I and LED II is due to the fact that the\nround mesa in LED I can support a circulating\/whispering\ngallery mode much more easily. We also note that passiva-\ntion of the mesa edge prevents the formation of an oxide\nwhich can produce a surface inversion layer. Consequently,\nthe optical gain in this device is higher than in the square\ndevice without passivation.\nSimilar optical resonant mode behavior has been ob-\nserved in microdisk lasers12,13 and LEDs operating at much\nshorter wavelengths.14,15 It has been shown that such a mi-\ncrodisk cavity may support two different resonant mode\ntypes, radial and whispering gallery modes ~WG!.16 Radial\nmodes are dominated by photon wave motion along the ra-\ndial direction of the disk, the equivalent cavity being formed\nbetween the edge and the center of the disk. These radial\noscillations are unlikely, in our case, due to the ring contact\nand local current crowding which prevents such propagation.\nThe WG mode, on the other hand, may be thought of as\nin-plane propagation around the inside perimeter of the disk,\nor mesa in our case, which is facilitated by total internal\nreflection. The modes are solutions of the three-dimensional\nMaxwell equations. If, however, we assume that the radia-\ntion is effectively confined vertically within the active region\nof our mesa, then we may approximate this situation using a\nFIG. 4. Current density distribution in the lower plane obtained from Eq.\n~1!. ~The contact internal diameter in our units is 60 and the external diam-\neter is 80.!two dimensional solution which yields Bessel function solu-\ntions for the radial field distribution. The effective cavity\nlength of 2pR imposed by the periodic boundary condition\non the circulating wave results in the WG eigenmode condi-\ntion: 2pRn5ml for large integer m, where R is the mesa\nradius, n is the refractive index, and the mode spacing is\nsimply given by DlWG5l2\/2pRn . This enables us to esti-\nmate a WG mode spacing of 4.6 nm which was too small for\nus to resolve with our low resolution spectrometer as is evi-\ndent from the spectra of Fig. 2. Lasing is inhibited by the Q\nspoiling effect of the rough circumference of the mesa. But,\nhigher order modes are less affected since their intensity\nmaxima reside further away from the perimeter, while the\nring contact suppresses the modes in the central area of the\ndevice. Although the parabolic reflector collects light emitted\nat low angles, further measurements showed that light was\nemitted from both the surface and the edges of the mesa.\nIn summary, we have observed superluminescence in the\nmidinfrared at 4.6 mm from a mesa etched LED. Spectral\nline narrowing was observed and the optical output power of\nthese diodes was found to be more than two times greater\nthan that of analogous diodes of a different configuration.\nThe superluminescence was due to optical resonant mode\nbehavior which we attribute to high order whispering gallery\nmodes, previously not reported in LEDs operating at wave-\nlengths as long as 4.6 mm. This result suggests the possibility\nof creating a whispering gallery mode semiconductor laser\nworking at room temperature in the spectral range 3–5 mm.\nThe authors wish to thank EPSRC for the award of a\nvisiting fellowship for V.V.S. One of the authors ~A.M.!\nwould like to thank the Ministry of Science of the Russian\nFederation for partial support of this work through the pro-\ngram ‘‘Optics and Laser Physics.’’\n1 S. McCabe and B. D. MacCraith, Electron. Lett. 29, 1719 ~1993!.\n2 S. D. Smith, A. Vass, P. Bramley, J. G. Crowder, and C. H. Wang, IEE\nProc.-J: Optoelectron. 144, 266 ~1997!.\n3 M. K. Parry and A. Krier, Electron. Lett. 30, 1968 ~1994!.\n4 A. A. Popov, V. V. Sherstnev, Y. P. Yakovlev, A. N. Baranov, and C.\nAlibert, Electron. Lett. 33, 86 ~1997!.\n5 A. Krier and Y. Mao, IEE Proc.-J: Optoelectron. 144, 355 ~1997!.\n6 A. A. Popov, M. V. Stepanov, V. V. Sherstnev, and Y. P. Yakovlev, Tech.\nPhys. Lett. 24, 596 ~1997!.\n7 H. H. Gao, A. Krier, and V. V. Sherstnev, J. Phys. D 32, 1768 ~1999!.\n8 A. Krier, H. H. Gao, and V. V. Sherstnev, J. Appl. Phys. 85, 8419 ~1999!.\n9 A. Krier, H. H. Gao, V. V. Sherstnev, and Y. Yakovlev, Electron. Lett. 35,\n1665 ~1999!.\n10 W. K. H. Panofsky and M. Phillips, Classical Electricity and Magnetism\n~Addison–Wesley, Reading, MA, 1960!.\n11 P. P. Paskov, J. Appl. Phys. 81, 1890 ~1997!.\n12 S. A. Backes, J. R. A. Cleaver, A. P. Heberle, J. J. Baumberg, and K.\nKohler, Appl. Phys. Lett. 74, 176 ~2000!.\n13 S. Chang, B. N. B. Rex, R. K. Chang, G. Chong, and L. J. Guido, Appl.\nPhys. Lett. 75, 166 ~2000!.\n14 S. X. Jin, J. Li, J. Z. Li, J. Y. Lin, and H. X. Jiang, Appl. Phys. Lett. 76,\n631 ~2000!.\n15 R. A. Mair, K. C. Zeng, J. Y. Lin, H. X. Jiang, B. Zhang, L. Dai, A.\nBotchkarev, W. Kim, H. Morkoc, and M. A. Khan, Appl. Phys. Lett. 72,\n1530 ~1998!.\n16 R. P. Wang and M. M. Dumitrescu, J. Appl. Phys. 81, 3391 ~1997!.\n"}