{"doi":"10.1016\/j.snb.2009.11.052","coreId":"139314","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/4282","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/4282","10.1016\/j.snb.2009.11.052"],"title":"Rapid qualitative and quantitative detection of beef fillets spoilage based on Fourier transform infrared spectroscopy data and artificial neural networks","authors":["Argyri, Anthoula A.","Panagou, Efstathios Z.","Tarantilis, P. A.","Polysiou, M.","Nychas, George-John E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009","abstract":"A machine learning strategy in the form of a multilayer perceptron (MLP) neural network was employed to correlate Fourier transform infrared (FTIR) spectral data with beef spoilage during aerobic storage at chill and abuse temperatures. Fresh beef fillets were packaged under aerobic conditions and left to spoil at 0, 5, 10, 15, and 20 °C for up to 350 hours. FTIR spectra were collected directly from the surface of meat samples, whereas total viable counts of bacteria were obtained with standard plating methods. Sensory evaluation was performed during storage and samples were attributed into three quality classes namely fresh, semi-fresh, and spoiled. A neural network was designed to classify beef samples to one of the three quality classes based on the biochemical profile provided by the FTIR spectra, and in parallel to predict the microbial load (as total viable counts) on meat surface. The results obtained demonstrated that the developed neural network was able to classify with high accuracy the beef samples in the corresponding quality class using their FTIR spectra. The network was able to classify correctly 22 out of 24 fresh samples (91.7%), 32 out of 34 spoiled samples (94.1%), and 13 out of 16 semi-fresh samples (81.2%). No fresh sample was misclassified as spoiled and vice versa. The performance of the network in the prediction of microbial counts was based on graphical plots and statistical indices (bias and accuracy factors, standard error of prediction, mean relative and mean absolute percentage residuals). Results demonstrated good correlation of microbial load on beef surface with spectral data. The results of this work indicated that the biochemical fingerprints during beef spoilage obtained by FTIR spectroscopy in combination with the appropriate machine learning strategy have significant potential for rapid assessment of meat spoilage","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139314.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.snb.2009.11.052","pdfHashValue":"45a1fc5d087286cf56a416043665217645dfa881","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/4282<\/identifier><datestamp>2014-02-18T13:39:05Z<\/datestamp><setSpec>hdl_1826_2005<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Rapid qualitative and quantitative detection of beef fillets spoilage based on Fourier transform infrared spectroscopy data and artificial neural networks<\/dc:title><dc:creator>Argyri, Anthoula A.<\/dc:creator><dc:creator>Panagou, Efstathios Z.<\/dc:creator><dc:creator>Tarantilis, P. A.<\/dc:creator><dc:creator>Polysiou, M.<\/dc:creator><dc:creator>Nychas, George-John E.<\/dc:creator><dc:subject>Artificial neural networks<\/dc:subject><dc:subject>Aerobic storage<\/dc:subject><dc:subject>Beef fillets<\/dc:subject><dc:subject>FTIR<\/dc:subject><dc:subject>Machine learning<\/dc:subject><dc:subject>Meat spoilage<\/dc:subject><dc:description>A machine learning strategy in the form of a multilayer perceptron (MLP) neural network was employed to correlate Fourier transform infrared (FTIR) spectral data with beef spoilage during aerobic storage at chill and abuse temperatures. Fresh beef fillets were packaged under aerobic conditions and left to spoil at 0, 5, 10, 15, and 20 °C for up to 350 hours. FTIR spectra were collected directly from the surface of meat samples, whereas total viable counts of bacteria were obtained with standard plating methods. Sensory evaluation was performed during storage and samples were attributed into three quality classes namely fresh, semi-fresh, and spoiled. A neural network was designed to classify beef samples to one of the three quality classes based on the biochemical profile provided by the FTIR spectra, and in parallel to predict the microbial load (as total viable counts) on meat surface. The results obtained demonstrated that the developed neural network was able to classify with high accuracy the beef samples in the corresponding quality class using their FTIR spectra. The network was able to classify correctly 22 out of 24 fresh samples (91.7%), 32 out of 34 spoiled samples (94.1%), and 13 out of 16 semi-fresh samples (81.2%). No fresh sample was misclassified as spoiled and vice versa. The performance of the network in the prediction of microbial counts was based on graphical plots and statistical indices (bias and accuracy factors, standard error of prediction, mean relative and mean absolute percentage residuals). Results demonstrated good correlation of microbial load on beef surface with spectral data. The results of this work indicated that the biochemical fingerprints during beef spoilage obtained by FTIR spectroscopy in combination with the appropriate machine learning strategy have significant potential for rapid assessment of meat spoilage.<\/dc:description><dc:publisher>Elsevier<\/dc:publisher><dc:date>2010-03-02T15:38:26Z<\/dc:date><dc:date>2010-03-02T15:38:26Z<\/dc:date><dc:date>2009<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>A.A. Argyri, E.Z. Panagou, P.A. Tarantilis, M. Polysiou, G.-J.E. Nychas, Rapid qualitative and quantitative detection of beef fillets spoilage based on Fourier transform infrared spectroscopy data and artificial neural networks, Sensors and Actuators B: Chemical, Volume 145, Issue 1, 4 March 2010, Pages 146-154<\/dc:identifier><dc:identifier>0925-4005<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.snb.2009.11.052<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/4282<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0925-4005","issn:0925-4005"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":["Artificial neural networks","Aerobic storage","Beef fillets","FTIR","Machine learning","Meat spoilage"],"subject":["Article"],"fullText":"Accepted Manuscript\nTitle: Rapid qualitative and quantitative detection of beef\nfillets spoilage based on Fourier transform infrared\nspectroscopy data and artificial neural networks\nAuthors: A.A. Argyri, E.Z. Panagou, P.A. Tarantilis, M.\nPolysiou, G.-J.E. Nychas\nPII: S0925-4005(09)00917-4\nDOI: doi:10.1016\/j.snb.2009.11.052\nReference: SNB 11942\nTo appear in: Sensors and Actuators B\nReceived date: 27-7-2009\nRevised date: 3-11-2009\nAccepted date: 22-11-2009\nPlease cite this article as: A.A. Argyri, E.Z. Panagou, P.A. Tarantilis, M. Polysiou, G.-\nJ.E. Nychas, Rapid qualitative and quantitative detection of beef fillets spoilage based\non Fourier transform infrared spectroscopy data and artificial neural networks, Sensors\nand Actuators B: Chemical (2008), doi:10.1016\/j.snb.2009.11.052\nThis is a PDF file of an unedited manuscript that has been accepted for publication.\nAs a service to our customers we are providing this early version of the manuscript.\nThe manuscript will undergo copyediting, typesetting, and review of the resulting proof\nbefore it is published in its final form. Please note that during the production process\nerrors may be discovered which could affect the content, and all legal disclaimers that\napply to the journal pertain.\nPage 1 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 1 \n 1 \nRapid qualitative and quantitative detection of beef fillets spoilage based on 2 \nFourier transform infrared spectroscopy data and artificial neural 3 \nnetworks 4 \n 5 \nA.A. Argyri\na,b\n, E.Z. Panagou\na,*\n, P.A. Tarantilis\nc\n, M. Polysiou\nc\n, G.-J.E. Nychas\na \n6 \n 7 \na \nLaboratory of Microbiology and Biotechnology of Foods, Department of Food Science and 8 \nTechnology, Agricultural University of Athens, Iera Odos 75, 118 55 Athens, Greece 9 \nb\n Applied Mycology Group, Cranfield Health, Cranfield University, College Road, Cranfield, 10 \nBedfordshire MK43 0AL, United Kingdom 11 \nc \nLaboratory of Chemistry, Agricultural University of Athens, Iera Odos 75, 118 55 Athens, Greece     12 \n 13 \n 14 \n 15 \n 16 \n 17 \n 18 \n 19 \n 20 \n 21 \n 22 \n 23 \n 24 \n 25 \n 26 \nCorresponding author. Tel\/Fax: +30 210 529 4693. E-mail address: stathispanagou@aua.gr 27 \n 28 \nRunning title: Monitoring meat spoilage with FTIR and neural networks   29 \n30 \nManuscript\nPage 2 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 2 \nAbstract 1 \nA machine learning strategy in the form of a multilayer perceptron (MLP) neural network 2 \nwas employed to correlate Fourier transform infrared (FTIR) spectral data with beef spoilage 3 \nduring aerobic storage at chill and abuse temperatures. Fresh beef fillets were packaged under 4 \naerobic conditions and left to spoil at 0, 5, 10, 15, and 20°C for up to 350 hours. FTIR spectra 5 \nwere collected directly from the surface of meat samples, whereas total viable counts of 6 \nbacteria were obtained with standard plating methods. Sensory evaluation was performed 7 \nduring storage and samples were attributed into three quality classes namely fresh, semi-fresh, 8 \nand spoiled. A neural network was designed to classify beef samples to one of the three 9 \nquality classes based on the biochemical profile provided by the FTIR spectra, and in parallel 10 \nto predict the microbial load (as total viable counts) on meat surface. The results obtained 11 \ndemonstrated that the developed neural network was able to classify with high accuracy the 12 \nbeef samples in the corresponding quality class using their FTIR spectra. The network was 13 \nable to classify correctly 22 out of 24 fresh samples (91.7%), 32 out of 34 spoiled samples 14 \n(94.1%), and 13 out of 16 semi-fresh samples (81.2%). No fresh sample was misclassified as 15 \nspoiled and vice versa. The performance of the network in the prediction of microbial counts 16 \nwas based on graphical plots and statistical indices (bias and accuracy factors, standard error 17 \nof prediction, mean relative and mean absolute percentage residuals). Results demonstrated 18 \ngood correlation of microbial load on beef surface with spectral data. The results of this work 19 \nindicated that the biochemical fingerprints during beef spoilage obtained by FTIR 20 \nspectroscopy in combination with the appropriate machine learning strategy have significant 21 \npotential for rapid assessment of meat spoilage.  22 \n 23 \n 24 \n 25 \nKeywords: Artificial neural networks, Aerobic storage, Beef fillets, FTIR, Machine learning, 26 \nMeat spoilage.27 \nPage 3 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 3 \n1. Introduction      1 \nIn most developed countries meat consumption is very high mainly due to its high 2 \nnutritional value in the human diet. The great variability in raw meat in terms of chemical 3 \ncomposition, technological and chemical attributes results in highly variable end products 4 \nwhich are marketed without a desired and controlled level of quality [1]. In order to maintain 5 \nquality standards, control procedures must be carried out on meat comprising chemical 6 \nanalyses, instrumental methods, organoleptic evaluation, and molecular screening methods. 7 \nMore than fifty methods have been used for the detection of microbiologically spoiled or 8 \ncontaminated meat (e.g. organoleptic, microbiological, and physico-chemical), all of which 9 \nare well documented [2]. However, these techniques are invasive, time consuming, labour 10 \nintensive, demand highly trained personnel, and thus they are unsuitable for online application 11 \nand routine analysis [3-7]. The lack of general agreement on the early signs of incipient 12 \nspoilage for meat makes more difficult the task to evaluate it objectively, mainly due to 13 \nchanges in the technology of meat preservation (e.g. vacuum, modified atmospheres, etc.). 14 \nThe use of microbial metabolites as a consequence of microbial activity in meat has been 15 \ncontinuously recognized as a potential means for assessing meat quality [4, 6, 8]. The 16 \nattempts that have been made over the last two decades to associate given metabolites with 17 \nmicrobial spoilage of meat have not been very much appreciated, due to low understanding of 18 \nthe underlying phenomena [6].    19 \nRecently, some interesting analytical approaches using mathematical equations have been 20 \napplied to describe the kinetics of ephemeral\/specific spoilage organisms (E(S)SO) with the 21 \npurpose to predict spoilage of various foods [7, 9]. Other approaches are based on the use of 22 \nbiosensors (enzymatic reactor systems), electronic noses (array of sensors), and vibrational 23 \nspectroscopy methods (e.g. FTIR, Raman spectroscopy) [10-12] for the same purpose. In 24 \ncontrast to conventional methods, Fourier transform infrared (FTIR) spectroscopy is rapid, 25 \nPage 4 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 4 \nnon-invasive, requires no specific consumable or reagent permitting users to collect full 1 \nspectra in a few seconds allowing simultaneous assessment of numerous meat properties [4-5, 2 \n13]. The basic concept underlying this method stipulates that as bacteria grow on meat, they 3 \nutilize nutrients and produce by-products that cause spoilage. The quantification of these 4 \nmetabolites represents a fingerprint characteristic of any biochemical substance, providing 5 \nthus information about the type and the rate of spoilage [2, 13]. The integration of the FTIR 6 \nAttenuated Total Reflectance biosensors or other biosensors in tandem with an information 7 \nplatform would result in the development of an “expert system” that would be able to 8 \nqualitatively and\/or quantitatively discriminate between meat samples based on extracted pre-9 \nprocessing features.  10 \nThe application of advanced statistical methods (e.g. discriminant function analysis, 11 \nclustering analysis, partial least square regression, chemometrics) and intelligent 12 \nmethodologies (neural networks, fuzzy logic, evolutionary algorithms, genetic programming) 13 \ncan be used as qualitative indices rather quantitative since their primary target is to distinguish 14 \nobjects or groups or populations [14-15]. Nowadays, machine learning strategies are based on 15 \nsupervised learning algorithms [16]. The last mentioned approach together with the 16 \ndevelopment of artificial neural networks (ANN) could be used effectively in the evaluation 17 \nof meat spoilage. Interest in using artificial neural networks in food science is increasing in 18 \nthe last years, as they have shown promising results in several applications such as sensory 19 \nanalysis, pattern recognition, classification, microbial predictions, and food process 20 \noptimization [17-21]. Essentially, ANNs are computing algorithms that attempt to imitate the 21 \ncomputational capabilities of large, highly connected networks of relatively simple elements 22 \nsuch as neurons in the human brain [22]. They contain a series of mathematical equations that 23 \nare used to simulate biological processes such as learning and memory. Their development 24 \nfirst involves a learning process that adaptively responds to the input variables according to a 25 \nPage 5 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 5 \nlearning rule. The network has the ability to learn from its environment and adapt to it similar 1 \nto its biological counterparts [23]. An ANN normally has no restriction on the type of 2 \nrelationship between the growth parameters (input patterns) and the desired output. In contrast 3 \nto conventional models in which a mathematical equation must be stated beforehand, ANNs 4 \ndirectly explore the knowledge contained in the input-output patterns by adjusting the highly 5 \nnonlinear topology, as the input-output patterns are repeatedly presented to the network [24]. 6 \nThe aim of the present study was to build upon previous experience undertaken in our 7 \nlaboratory on beef spoilage using FTIR spectroscopy and develop an artificial neural network 8 \nthat could (i) discriminate between different quality classes of beef fillets during aerobic 9 \nstorage at chill (0, 5°C) and abuse (10, 15, and 20°C) temperatures, and (ii) predict the 10 \nmicrobial load on the surface of meat samples directly from FTIR spectral data.     11 \n    12 \n2. Materials and methods 13 \n2.1 Sample preparation 14 \nFresh deboned pieces of beef were purchased from a local meat retail outlet and 15 \ntransported under refrigeration to the laboratory within 30 min. On arrival, the samples were 16 \nprepared by cutting the meat pieces into portions (40 mm wide x 50 mm long x 10 mm thick) 17 \nand maintained at 4°C for 1 h until use. The portions were subsequently placed into 90 mm 18 \nPetri dishes and stored at 0, 5, 10, 15, and 20˚C in high-precision (±0.5°C) incubation 19 \nchambers (MIR-153, Sanyo Electric Co., Osaka, Japan) for an overall period of 350 h, 20 \ndepending on storage temperature, until spoilage was pronounced. Meat samples were not 21 \nsubjected to any prior pre-treatment such as fat and connective tissue removal, or inoculation 22 \nwith selected species of bacteria. For the FT-IR measurements, a thin slice of the aerobic 23 \nupper surface of the fillet was excised and used for further spectral analysis. 24 \n 25 \nPage 6 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 6 \n2.2 Microbiological analyses 1 \nFor microbiological analysis a portion (40 mm wide x 50 mm long x 10 mm thick) was 2 \nadded to 150 ml sterile quarter strength Ringer‟s solution, and homogenized in a stomacher 3 \n(Lab Blender 400, Seward Medical, London, UK) for 60 s at room temperature (ca. 20°C). 4 \nFurther decimal dilutions were prepared with the same diluent, and duplicate 0.1 ml samples 5 \nof three appropriate dilutions were spread in triplicate on plate count agar (PCA 4021452; 6 \nBiolife, Italy) for counts of total viable bacteria (TVC), which was incubated at 30ºC for 48 h. 7 \nDuplicate samples from each storage temperature were analyzed at appropriate time intervals 8 \nto allow for efficient kinetic analysis of total viable counts. Specifically, meat samples stored 9 \nat 0 and 5°C were analyzed every 24 h, whereas samples stored at 10, 15, and 20°C were 10 \nanalyzed every 8, 6, and 4 h, respectively. Growth data from plate counts were log 11 \ntransformed and fitted to the primary model of Baranyi and Roberts [25] using the in-house 12 \nprogram DMFit (Institute of Food Research, Norwich, UK) to determine the kinetic 13 \nparameters of microbial growth (maximum specific growth rate and lag phase duration).   14 \n 15 \n2.3 Sensory analysis 16 \nSensory evaluation of meat samples was performed during storage according to Gill and 17 \nJeremiah [26] by a sensory panel composed of five members (staff from the laboratory) at the 18 \nsame time intervals as for microbiological analyses. The same trained persons were used in 19 \neach evaluation, and all were blinded to the sample tested. The sensory evaluation was carried 20 \nout in artificial light and the temperature of all samples was close to ambient. The descriptors 21 \nselected were based on the perception of colour, smell, and taste. The first two descriptors 22 \nwere assessed before and after cooking for 20 min at 180˚C in a preheated oven, while the last 23 \ndescriptor was evaluated only after cooking. Each sensory attribute was scored on a three-24 \npoint hedonic scale corresponding to: 1=Fresh; 2=Marginal; and 3=Spoiled. Score of 1.5 was 25 \nPage 7 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 7 \ncharacterized as Semi-fresh and it was the first indication of meat spoilage. Odour 1 \ncharacteristics of beef fillets, as determined by special samples kept frozen and thawed prior 2 \nto each sensory evaluation, were considered as fresh. Putrid, sweet, sour, or cheesy odours 3 \nwere regarded as indicative of microbial spoilage and classified the samples as spoiled. Bright 4 \ncolours typical of fresh oxygenated meat were considered fresh, whereas a persistent dull or 5 \nunusual colour rendered the sample spoiled. Overall, 74 meat samples were assessed by the 6 \nsensory panel and classified into the selected three groups as fresh (n = 24), semi-fresh (n = 7 \n16), and spoiled (n = 34). 8 \n 9 \n2.4 FT-IR\/ATR spectroscopy 10 \nMeat samples were analyzed in parallel to the microbiological and sensory analyses. FT-11 \nIR spectra were collected using a ZnSe 45° ATR (Attenuated Total Reflectance) crystal on 12 \na Nicolet 6700 FT-IR Spectrometer equipped with a DLaTGS (deuterated L-alanine doped 13 \ntriglycene sulphate) Detector with KBr beamspliter. The samples were placed on the ZnSe 14 \nATR crystal so that the aerobic upper surface of the meat was in intimate contact with the 15 \ncrystal, and then pressed with the machine‟s gripper in order to obtain the best possible 16 \ncontact with the crystal. The ZnSe ATR crystal was capable of 12 external reflections, with 17 \nthe evanescent field effecting a depth of 1.01 μm. The spectrometer was controlled by Omnic 18 \nSoftware-version 7.3 to collect spectra over the wavenumber range of 4,000 to 400 cm\n-1\n, by 19 \naccumulating 100 scans with a resolution of 4 cm\n-1\n. The collection time for each sample 20 \nspectrum was 2 min. Each sample was analyzed in duplicate and results are displayed as mean 21 \nvalue of both measurements. Reference spectra were acquired by collecting a spectrum from 22 \nthe cleaned blank crystal prior to the presentation of each sample replicate. At the end of each 23 \nsampling, the crystal surface was cleaned with detergent, washed with distilled water, dried 24 \nPage 8 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 8 \nwith lint-free tissue, cleaned with ethanol and finally dried with lint-free tissue at the end of 1 \neach sampling interval. 2 \n 3 \n2.5 Pre-treatment of the data and neural network development 4 \nThe FT-IR spectra collected between 1800 and 1000 cm\n-1\nwere initially submitted to 5 \nsmoothing based on the Savitzky-Golay algorithm. Subsequently, mean-centred and 6 \nstandardized spectral data were subjected to principal components analysis (PCA). The PCA 7 \nis an unsupervised method that transforms a large number of potentially correlated factors 8 \ninto a small number of orthogonal (uncorrelated) factors (i.e. principal components), reducing 9 \nthus the size of the initial dataset and optimizing the feature vector [27]. Since the raw 10 \nspectral data could not be used because of the strong correlation among the variables 11 \n(wavenumbers), the uncorrelated principal components from PCA analysis were employed for 12 \nthis purpose. The variables (wavenumbers), for which the communality values of the first 13 \nthree PCs were higher or equal to 0.6 were considered as significantly explaining the variance 14 \nof the spectral data, and hence they were considered as potential wavenumbers associated 15 \nwith the biochemical changes during meat spoilage. The wavenumbers that were selected 16 \nfrom the first PCA to be significant in this data set ranged from 1718 to 1203 cm\n-1\n and 1020 17 \nto 1001 cm\n-1\n and were selected for further analyses. A second PCA with the selected variables 18 \n(wavenumbers) revealed the Principal Components (PCs) that significantly contributed to the 19 \nvariance of the data set. In our case, the total variance (100%) of the data set could be 20 \nexplained by 37 principal components (PCs) from which the first five were extracted and used 21 \nas input to the developed neural network, accounting for 98.08% of cumulative variance 22 \nobserved in the experiment (data not shown). 23 \nA multilayer perceptron (MLP) network based on backpropagation was developed to 24 \ndetermine the applicability of neural networks as a meat quality classifier. The network 25 \nPage 9 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 9 \nconsisted of an input layer with seven input nodes for storage temperature, sampling time, and 1 \nthe five principal components (Fig. 1). The output layer consisted of two nodes, one for the 2 \nquality class (Fresh, Semi-fresh, Spoiled), and another for the predicted total viable counts of 3 \nthe meat sample. The class membership of a single sample pattern was coded in a numerical 4 \nformat by assigning 1 for “Fresh” samples, 2 for “Semi-fresh”, and 3 for “Spoiled” samples 5 \nwith a cut-off value of 0.5. In order to keep the neural network as simple as possible one 6 \nhidden layer was selected with a varying number of neurons. The network configuration was 7 \napproached empirically by testing different possibilities (i.e. neurons in the hidden layer, 8 \nlearning rate, and momentum) and selecting the one that provided the best classification 9 \naccuracy. In a fully interconnected network, all neurons in the hidden layer are connected to 10 \nall neurons in the input and output layers, but no connections are allowed between neurons in 11 \none layer or from one neuron to itself, or directly between input and output layer neurons. The 12 \nhidden neurons are in fact the elements in a neural network that provide high degree of 13 \nnonlinearity (24). In these networks each node receives signals through connections with 14 \nother nodes or the outside world in the case of the input layer. The net input to node j has the 15 \nform: 16 \n \nn\ni\njiijj xwI\n1\n          (1) 17 \nwhere xi are the inputs, wij are connection weights associated with each input\/node and θj is 18 \nthe bias associated with node j. The output from each node is used as an input in a nonlinear 19 \ntransfer function: 20 \nOj = f (Ij )           (2) 21 \n                                                                                                                   22 \nThe most commonly used transfer functions are sigmoidal, hyperbolic tangent and linear 23 \nfunction. In our work the sigmoidal and hyperbolic tangent were selected as transfer functions 24 \nin both hidden and output layers. All inputs were normalized in the range from 0.1 to 0.9 and 25 \nPage 10 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 10 \n-1 to +1 for sigmoidal and hyperbolic tangent functions, respectively, to avoid saturation 1 \nproblems in their performance due to different value ranges of the inputs. 2 \nThe standard backpropagation algorithm for network training is based on the steepest-descent 3 \ngradient approach applied to the minimization of the error function defined as: 4 \n 5         (3) \n 6 \nwhere dq represents the desired network output for the q\nth\n input pattern in the s network layer 7 \nand yout is the network output. The generalized delta rule was applied for adjusting the weights 8 \nof the feedforward networks in order to minimize equation 3. The rule for adjusting weights 9 \nwas given by the following equation: 10 \n1s s s s s\nij ij j j ij\nw t w t y w t        (4) 11 \nwhere η is the learning rate parameter, α the momentum term, and δ the negative derivative of 12 \nthe total square error with respect to the neuron‟s output. 13 \nThe entire database consisted of 74 meat spectral patterns corresponding to different 14 \nstorage temperatures and sampling times. As the number of observations was small, 15 \nseparation of the dataset into training and testing subsets (hold-out method) would further 16 \nreduce the number of data and would result in insufficient training of the network. Therefore, 17 \nin order to improve the robustness of classification, the leave-1-out cross validation technique 18 \nwas employed to evaluate the performance of the developed network. The classification 19 \naccuracy of the MLP network was determined by the number of correctly classified samples 20 \nin each sensory class divided by the total number of samples in the class. The performance of 21 \nthe neural network in the prediction of total viable counts for each meat sample analyzed was 22 \ndetermined by the bias (Bf) and accuracy (Af) factors [28], the mean relative percentage 23 \nresidual (MRPE) and the mean absolute percentage residual (MAPR) [29], and finally by the 24 \nroot mean squared error (RMSE) and the standard error of prediction (SEP) [30]. The MLP 25 \n3\n2\n,\n1\n1\n2\nqs out s\ns\nE d y\nPage 11 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 11 \nnetwork was developed in MATLAB version 7.0 code (Mathworks, Inc., Massachusetts, 1 \nUSA). 2 \n 3 \n3. Results 4 \nThe population dynamics of total viable counts (TVC) during beef fillet storage at different 5 \ntemperatures is presented in Figure 2, whereas the estimated kinetic parameters after fitting 6 \nwith the primary model of Baranyi and Roberts are shown in Table 1. Lag phase was 7 \nobserved only at 0 and 5°C, while a progressive increase of maximum specific growth rate 8 \n(μmax) values with storage temperature was evident. The aerobic plate counts of meat samples 9 \nindicated that the total microflora ranged from 2.9-3.3 log10 cfu cm\n-2\n at the onset of storage 10 \n(fresh samples) to 8.7-9.4 log10 cfu cm\n-2 \nfor samples characterised as spoiled.   11 \nTypical FTIR spectral data in the range of 1800 to 1000 cm\n-1\n collected from fresh and spoiled 12 \nbeef fillet samples stored at 5°C for 10 days are shown in Figure 3. These spectra can be 13 \nemployed to obtain metabolic snapshots (fingerprints) of beef fillets during storage at 14 \ndifferent temperatures in an attempt to monitor meat spoilage. The temperature of 5°C was 15 \nchosen as a typical chill storage temperature for meat. The comparison of FTIR spectra could 16 \nprovide information on certain biochemical changes occurring during meat spoilage. Hence, 17 \nbased on Figure 2, a major peak at 1640 cm\n-1\n due to the presence of moisture (O-H stretch) 18 \nwith an underlying contribution from amide I in the meat sample was apparent, whereas a 19 \nsecond peak at 1550 cm\n-1\n appeared due to the absorbance of amide II (N-H bend, C–N 20 \nstretch). A second amide vibration was shown at 1400 cm\n−1\n (C–N stretch), followed by amide 21 \nIII peaks at 1315 and at 1240 (C-N stretch, N-H bend, C-O stretch, O=C-N bend). The peaks 22 \nat 1460, 1240 and 1175 cm\n-1\n can be attributed to fat (C=O ester). Finally, the peaks arising 23 \nfrom 1025 to 1140 could be absorbance due to amines (C-N stretch) [4-5, 13, 31, 32].  24 \nPage 12 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 12 \n An MLP neural network based on back propagation was used to classify beef fillet 1 \nsamples into three sensorial categories (fresh, semi-fresh, spoiled) from the metabolic 2 \nfingerprints of FTIR spectral data after dimensionality reduction with principal components 3 \nanalysis. The classification performance of the MLP network with variable number of 4 \nneurons in the hidden layer and different transfer functions (logistic sigmoid and hyperbolic 5 \ntangent) is presented in Fig. 4. The learning rate (n = 0.10) and momentum (α = 0.20) 6 \nparameters were selected to ensure that the convergence of the learning process was achieved. 7 \nGenerally, the classification performance of the network obtained for the meat samples stored 8 \nat different temperatures and cross validated with leave-1-out method was lower when the 9 \nselected transfer function was hyperbolic tangent despite the fact that the algorithm converged 10 \nfaster. The highest overall correct classification with hyperbolic tangent transfer function 11 \n(86.5%) was obtained with 20 neurons in the hidden layer (Fig. 4b), however within the 12 \nindividual classes performance was low, especially for semi-fresh meat samples (62.5%). The 13 \nbest performance of the classifier was obtained with 10 neurons in the hidden layer and a 14 \nlogistic sigmoid transfer function (Fig. 4a) providing a 90.5% overall correct classification, 15 \nwhich within the selected classes corresponded to 91.7%, 94.1%, and 81.3% for fresh, 16 \nspoiled, and semi-fresh meat samples, respectively. The classification accuracies obtained 17 \nfrom this network, designated as 7-10-2, are presented in the form of a confusion matrix in 18 \nTable 2. The sensitivities (i.e. how good the network is at correctly identifying the positive 19 \nsamples) for fresh and spoiled meat samples were 91.7% and 94.1%, respectively, 20 \nrepresenting 2 misclassifications out of 24 fresh meat samples, and also 2 misclassifications 21 \nout of 34 spoiled samples. In the case of semi-fresh samples the respective figure was 22 \nsomehow lower (81.2%). In this case 3 samples out of 16 were misclassified, 1 as fresh and 2 23 \nas spoiled. The specificity index (i.e. how good the network is at correctly identifying the 24 \nPage 13 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 13 \nnegative samples) was also high especially in fresh and spoiled samples, indicating 1 \nsatisfactory discrimination between these two classes (Table 2). 2 \nThe plot of predicted versus observed total viable counts (Fig. 5) showed reasonably good 3 \ndistribution around the line of equity (y = x), with the majority of data (ca. 78%) included 4 \nwithin the ± 1 log unit area, although some over-prediction was evident in the case of fresh 5 \nmeat samples, especially with low observed initial counts. The performance of the MLP 6 \nnetwork is also presented in Figure 6 where the % relative error of prediction is depicted 7 \nagainst the observed microbial population. Based on this plot, data were almost equally 8 \ndistributed above and below 0, with approximately 88% of predicted microbial counts 9 \nincluded within the ± 20% RE zone. It needs to be emphasized though that the network over-10 \nestimated the bacterial population for certain fresh samples, especially at lower observed 11 \nmicrobial counts, corresponding to low temperature (0°C) and short storage time. The 12 \nperformance of the MLP network to predict total viable counts in meat samples in terms of 13 \nstatistical indices is presented in Table 3. Based on the calculated values of the bias factor (Bf) 14 \nit can be inferred that the network under-estimated total viable counts in semi-fresh and 15 \nspoiled samples (Bf  < 1), whereas for fresh samples over-estimation of microbial population 16 \nwas evident (Bf  > 1). In addition, the values of the accuracy factor (Af) indicated that the 17 \npredicted total viable counts were 18.1%, 12.2%, and 8.4% different (either above or below) 18 \nfrom the observed values for fresh, semi-fresh, and spoiled meat samples, respectively. The 19 \nmean relative percentage residual index (MRPR) also confirmed the under-prediction for 20 \nsemi-fresh and spoiled samples (MRPR > 0) and over-prediction for fresh samples (MRPR < 21 \n0), whereas the values of mean absolute percentage residual (MAPR), representing the 22 \naverage deviation between observed and predicted counts, verified the information provided 23 \nby the accuracy factor. The standard error of prediction (SEP) index is a relative typical 24 \ndeviation of the mean prediction values and expresses the expected average error associated 25 \nPage 14 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 14 \nwith future predictions. The lower the value of this index is, the better the capability of the 1 \nnetwork to predict microbial counts in new meat samples. The value of the index was less 2 \nthan 10% in spoiled samples indicating good performance of the network for microbial count 3 \npredictions in this class (Table 3). Comparable results were observed for semi-fresh samples 4 \n(SEP 13.6%), but for fresh samples the index gave higher values as the network over-5 \nestimated microbial counts for some fresh samples, particularly those stored at 0°C and for 6 \nshort storage time (Fig. 5). 7 \n 8 \n4. Discussion 9 \nA major challenge facing the meat industry today is to obtain reliable information on meat 10 \nquality throughout the production, distribution, and storage chains, and turn this information 11 \ninto decision support systems which would ultimately provide a guaranteed quality of meat 12 \nproducts for consumers [1]. The metabolomic concept in food microbiology which has been 13 \nintroduced recently [14] improved the concept of using single biochemical indicators as 14 \nproposed in late 80s and 90s [3, 33-36]. Chemometrics  (e.g. principal components analysis-15 \nPCA, hierarchical cluster analysis-HCA, discriminant function analysis-DFA, partial least 16 \nsquare regression-PLSR), in parallel with machine learning approaches based on soft 17 \ncomputing (e.g. artificial neural networks-ANN, genetic algorithms, support vector machines-18 \nSVM) have been applied as data mining techniques in bioprocess data [16, 37]. These 19 \napproaches could rapidly provide information related to the contribution of the ephemeral 20 \nspoilage organisms (ESO) in meat or to the categorization of meat with regard to (i) type of 21 \nmeat and (ii) spoilage [3, 15, 38, 39]. Ellis and co-workers [4, 5] have been the pioneers 22 \nstipulating that FTIR spectroscopy can be used directly on the surface of food to produce 23 \nbiochemical interpretable „„fingerprints” (metabolic snapshots), enabling thus early detection 24 \nof microbial spoilage of chicken breast and beef rump steaks. 25 \nPage 15 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 15 \nIn this work, FTIR spectroscopy was employed to obtain metabolic fingerprints of beef 1 \nfillets during storage in aerobic conditions at five different storage temperatures (0, 5, 10, 15, 2 \nand 20°C). A machine learning approach was then followed to develop a pattern recogniser 3 \nbased on a simple multi-layer perceptron (MLP) neural network, in an attempt to classify 4 \nmeat samples in three quality classes (Fresh, Semi-fresh, Spoiled) as judged previously by a 5 \ntaste panel. The classification performance of the MLP network was very good for fresh and 6 \nspoiled samples with correct classification rates exceeding 91% (Table 2) after leave-1-out 7 \ncross validation of the dataset. It is characteristic that no fresh samples was misclassified as 8 \nspoiled and vice versa, indicating that the biochemical fingerprints provided by FTIR spectral 9 \ndata could discriminate these two classes quite accurately. Lower percentages were obtained 10 \nfor semi-fresh samples (ca. 81%) with erroneous classifications in the other two classes. It 11 \nmust be emphasized however that the number of examined samples within each class was not 12 \nequally distributed, due to the different spoilage rate of beef samples at the different 13 \ntemperatures assayed (Table 2). This may have affected the learning process of the neural 14 \nnetwork, which is basically a data driven approach [40], and thus could account for the lower 15 \nclassification accuracies observed for this class. It is also worth noting that the logistic 16 \nsigmoid transfer function employed in the neurons of the hidden layer gave higher 17 \nclassification accuracies compared with the hyperbolic tangent transfer function (Fig. 4), 18 \ndespite the fact that the latter results in faster convergence of the training algorithm [24]. It is 19 \nworth-noting that initially two independent neural networks were developed for the prediction 20 \nof either quality class or TVC counts, with lower prediction accuracies each (data not shown). 21 \nMoreover, as both output parameters are not independent, in the sense that quality class is 22 \nrelated to microbiological counts and vice versa, a network that would combine both outputs 23 \nwould be more efficient. The relatively lower accuracies obtained in the semi-fresh class 24 \ncould also be attributed to the performance of the sensory evaluation process, as the difference 25 \nPage 16 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 16 \nbetween “fresh” and “semi-fresh” class is sometimes not very clear. So further improvement 1 \non prediction could be based on better training of sensory evaluation panels in combination 2 \nwith the development of an improved\/standardised protocol for meat assessment.    3 \nThe application of machine learning to correlate FTIR spectral data with meat spoilage is 4 \nnot new and it has been tackled in the past [2, 4, 5]. However, in these works, the focus was 5 \ngiven on the rapid detection of bacterial spoilage, in terms of microbiological analyses, 6 \nwhereas no attempt was made to correlate spectral data with quality classes defined by 7 \nsensory assessment of the samples. In addition, spoilage was monitored in only one storage 8 \ntemperature (room temperature), whereas in our work five different storage temperatures have 9 \nbeen assayed (0, 5, 10, 15 and 20°C). In this way spoilage has been monitored not only at 10 \nabuse temperatures but also at chill temperatures. Concerning TVC counts indicating beef 11 \nspoilage it was found by sensory evaluation that the respective values ranged from 7.0-8.2 12 \nlog10 cfu cm\n-2\n, depending on storage temperature. In a previous work undertaken in our lab 13 \n[13], FTIR snapshots were taken into account for the characterization of minced beef samples 14 \ninto the same quality classes using linear discriminant function analysis (DFA) analysis. 15 \nResults showed that the classification accuracies of the MLP classifier were better compared 16 \nwith DFA in the characterization of meat samples, indicating the advantage of ANN approach 17 \nin tackling complex, non-linear problems as meat spoilage.         18 \nAnother challenge from the microbiological perspective would be the implementation of 19 \nmachine learning approaches to correlate FTIR spectral data to bacterial counts on meat 20 \nsamples. As reported in previous works [5], spectra collected from the surface of beef 21 \ncontained biochemical information that could be correlated with the spoilage status of the 22 \nsamples. In this way, expensive and time-consuming microbiological analysis could be 23 \nreplaced in the long term by an on-line system based on spectroscopic data, providing rapid, 24 \nnon-invasive, and low cost microbiological analyses [4, 7]. To investigate this issue, the MLP 25 \nPage 17 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 17 \nclassifier was designed with two nodes in the output layer, one corresponding to the sensorial 1 \nclass of beef fillets, and another one for the prediction of microbial counts for each sampling 2 \ntime and storage temperature, based on TVC measurements. The comparison of observed and 3 \npredicted bacterial counts, based on calculated statistical induces and plots (Figs. 5-6, Table 4 \n3), presented reasonably good agreement, showing that the developed neural network 5 \napproach could be used effectively to assess the spoilage condition of beef fillets. The plots of 6 \nthe estimates versus observed bacterial counts were within ca. 1 log10 cfu cm\n-2\n from the line 7 \nof equity, which is comparable with a value of ca. 0.5 log10 cfu cm\n-2\n for beef steaks reported 8 \npreviously [5]. These results were also confirmed by the percent relative error index (%RE) 9 \nbetween observed and predicted values (Fig. 6) with the exception of three samples 10 \ncorresponding to fresh beef fillets with low initial counts. The calculated validation indices 11 \nshowed acceptable performance of the developed neural network in predicting total viable 12 \ncounts of beef samples directly from FTIR spectral data. The values of the bias factor (Bf) 13 \nwere close to unity indicating good agreement between predictions and observations when the 14 \nthree quality classes were taken together (Table 3). However, within classes, underestimation 15 \nwas evident for spoiled and semi-fresh samples, while TVC for fresh samples were 16 \noverestimated. However, the calculated values Bf are within the range of 0.9 to 1.0 or 1.0 to 17 \n1.05 which are considered adequate [41], whereas other authors have accepted Bf values of 18 \nbetween 0.75 and 1.25 as being acceptable for spoilage microorganisms [42].  Generally, the 19 \nhighest prediction accuracy of the neural network was observed in the case of spoiled samples 20 \nas this class presented the lowest values of indices compared to the other two classes. 21 \nConcerning the values of the accuracy factor (Af) it has been reported [43] that an increase of 22 \n0.15 (15%) would be acceptable for each independent variable included in model 23 \ndevelopment. Therefore, in our study, with only one independent variable (temperature) we 24 \nwould expect Af up to 1.15, which is in good agreement with the calculated values for the 25 \nPage 18 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 18 \nthree classes and the overall model as well (Table 3). The mean relative percentage residual 1 \nand the mean absolute percentage residual are statistics similar to the bias and accuracy 2 \nfactors [44] which provided similar information as the other two indices about the 3 \nperformance of the neural network.  4 \n 5 \n4. Conclusion 6 \nIn conclusion, these data demonstrate the utility of the analytical approach based on FTIR 7 \nspectroscopy which in combination with an appropriate machine learning strategy (artificial 8 \nneural networks) could become an effective tool for monitoring beef fillets spoilage during 9 \naerobic storage at chill and abuse temperatures. The collected spectra could be considered as 10 \nbiochemical fingerprints containing valuable information for the discrimination of meat 11 \nsamples in quality classes corresponding to different spoilage levels, and also could be used to 12 \npredict satisfactorily the microbial load directly from the sample surface. 13 \n 14 \nAcknowledgements 15 \nThe authors acknowledge the Symbiosis-EU (www.symbiosis-eu.net) project (no 211638) 16 \nfinanced by the European Commission under the 7\nth\n Framework Programme for RTD. The 17 \ninformation in this document reflects only the authors‟ views and the Community is not liable 18 \nfor any use that may be made of the information contained therein.    19 \n  20 \n   21 \n22 \nPage 19 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 19 \nReferences 1 \n[1] J.L. Damez, S. Clerjon, Meat quality assessment using biophysical methods related to 2 \nmeat structure, Meat Sci. 80 (2008) 132-149. 3 \n[2] D.I. Ellis, R. Goodacre, Rapid and quantitative detection of the microbial spoilage of 4 \nmuscle foods: current status and future trends, Trends Food Sci. Technol. 12 (2001) 5 \n414-424. 6 \n[3] R.H. Dainty, Chemical\/biochemical detection of spoilage, Int. J. Food Microbiol. 33 7 \n(1996) 19-34. 8 \n[4]  D.I. Ellis, D. Broadhurst, D.B. Kell, J.J. Rowland, R. Goodacre, Rapid and 9 \nquantitative detection of the microbial spoilage of meat by Fourier transform infrared 10 \nspectroscopy and machine learning, Appl. Environ. Microbiol. 68 (2002) 2822-2828. 11 \n[5] D.I. Ellis, D. Broadhurst, R. Goodacre, Rapid and quantitative detection of the 12 \nmicrobial spoilage of beef by Fourier transform infrared spectroscopy and machine 13 \nlearning, Anal. Chim. Acta 514 (2004) 193-201. 14 \n[6] G.-J.E. Nychas, E.H. Drosinos, R.G. Board, Chemical changes in stored meat, in R.G. 15 \nBoard, A.R. Davies (Eds.), The Microbiology of Meat and Poultry, Blackie Academic 16 \nand Professional, London, 1998, pp. 288-326. 17 \n[7] G.-J.E. Nychas, P.N. Skandamis, C.C. Tassou, K.P. Koutsoumanis, Meat spoilage 18 \nduring distribution, Meat Sci. 78 (2008) 77-89. 19 \n[8] J. Sutherland, Modelling food spoilage, in P. Zeuthen, L. Bogh-Sorensen (Eds.), Food 20 \nPreservation Techniques, CRC Woodhead Publishing, Cambridge, 2003, pp. 452-474. 21 \n[9] T.A. McMeekin, J. Baranyi, J. Bowman, P. Dalgaard, M. Kirk, T. Ross, S. Schmid, 22 \nM.H. Zwietering, Information systems in food safety management, Int. J. Food 23 \nMicrobiol. 112 (2006) 181-194. 24 \nPage 20 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 20 \n[10] D.I. Ellis, D. Broadhurst, S.J. Clarke, R. Goodacre, Rapid identification of closely 1 \nrelated muscle foods by vibrational spectroscopy and machine learning, Analyst 130 2 \n(2005) 1648-1654. 3 \n[11] A.M. Herrero, Raman spectroscopy a promising technique for quality assessment of 4 \nmeat and fish: a review, Food Chem. 107 (2008) 1642-1651. 5 \n[12] T. Rajamäki, H.L. Alakomi, T. Ritvanen, E. Skyttä, M. Smolander, R. Ahvenainen, 6 \nApplication of an electronic nose for quality assessment of modified atmosphere 7 \npackaged poultry meat, Food Control 17 (2006) 5-13. 8 \n[13] M.S. Ammor, A. Argyri, G.-J.E. Nychas, Rapid monitoring of the spoilage of minced 9 \nbeef stored under conventionally and active packaging conditions using Fourier 10 \ntransform infrared spectroscopy in tandem with chemometrics, Meat Sci. 81 (2009) 11 \n507-514. 12 \n[14] R. Goodacre, S. Vaidyanathan, W.B. Dunn, G.G. Harrigan, D.B. Kell, Metabolomics 13 \nby numbers: acquiring and understanding global metabolite data, Trends Biotechnol. 14 \n22 (2004) 245-252. 15 \n[15] M.P.H. Verouden, J.A. Westerhius, M.J.V. Werf, A.K. Smilde, Exploring the analysis 16 \nof structured metabolomics data, Chemometr. Intell. Lab. 98 (2009) 88-96. 17 \n[16] R. Goodacre, Applications of artificial neural networks to the analysis of multivariate 18 \ndata, in H.M. Cartwright (Ed.), Intelligent data analysis in science: a handbook, 19 \nOxford University Press, Oxford, 2000, pp. 123-152. 20 \n[17] A.H. Geeraerd, C.H. Herremans, C. Cenens, J.G. Van Impe, Application of artificial 21 \nneural networks as a non-linear modular modelling technique to describe bacterial 22 \ngrowth in chilled food products, Int. J. Food Microbiol. 44 (1998) 49-68. 23 \n[18] D. Guyer, X. Yang, Use of genetic artificial neural networks and spectral imaging for 24 \ndefect detection in cherries, Comp. Electron. Agric. 29 (2000) 179-194. 25 \nPage 21 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 21 \n[19] R. Krishnamurthy, A.K. Srivastava, J.E. Paton, G.A. Bell, D.C. Levy, Prediction of 1 \nconsumer liking from trained sensory panel information: Evaluation of neural 2 \nnetworks, Food Qual. Pref. 18 (2007) 275-285. 3 \n[20] E.Z. Panagou, V. S. Kodogiannis, Application of neural networks as a non-linear 4 \nmodelling approach in food mycology, Expert Syst. Appl. 36 (2009) 121-131. 5 \n[21] P. Poirazi, F. Leroy, M.D. Georgalaki, A. Aktypis, L. Vuyst, E. Tsakalidou, Use of 6 \nartificial neural networks and a gamma-concept-based approach to model growth of 7 \nand bacteriocin production by Streptococcus macedonicus ACA-DC 198 under 8 \nsimulated conditions of kasseri cheese production, Appl. Environ. Microbiol. 73 9 \n(2007) 768-776. 10 \n[22] J.S. Almeida, Predictive non-linear modelling of complex data by artificial neural 11 \nnetworks, Curr. Opin. Biotechnol. 13 (2002) 72-76. 12 \n[23] F.M. Ham, I. Kostanic, Fundamental neurocomputing concepts, in F.M. Ham, I. 13 \nKostanic (Eds.), Principles of neurocomputing for science and engineering, Arnold 14 \nPublishers, London, 2001, pp. 24-91. 15 \n[24] C.M. Bishop, Neural networks for pattern recognition, Oxford University Press, 16 \nOxford, 2004. 17 \n[25] J. Baranyi, T.A. Roberts, A dynamic approach to predicting bacterial growth in food. 18 \nInt. J. Food Microbiol. 23 (1994) 277-294. 19 \n[26] C.O. Gill, L.E. Jeremiah, The storage life of non-muscle offals packaged under 20 \nvacuum or carbon dioxide, Food Microbiol. 8 (1991) 339-353. 21 \n[27] B.S. Everitt, G. Dunn, Principal components analysis, in B.S. Everitt, G. Gunn (Eds.), 22 \nApplied multivariate data analysis, Arnold Publishers, London, 2001, pp. 48-71. 23 \n[28] T. Ross, Indices for performance evaluation of predictive model in food microbiology, 24 \nJ. Appl. Microbiol. 81 (1996) 501-508. 25 \nPage 22 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 22 \n[29] A. Palanichamy, D.S. Jayas, R.A. Holley, Predicting survival of Escherichia coli 1 \nO157:H7 in dry fermented sausage using artificial neural networks, J. Food Prot. 71 2 \n(2008) 6-12. 3 \n[30] R.M. García-Gimeno, C. Hervás-Martínez, R. Rodríguez-Pérez, G. Zurera-Cosano, 4 \nModelling the growth of Leuconostoc mesenteroides by artificial neural networks, Int. 5 \nJ. Food Microbiol. 105 (2005) 317-332. 6 \n[31] G. Socrates, Infrared and Raman Characteristic Group Frequencies: Tables and 7 \nCharts, 3rd edition, John Wiley and Sons, West Sussex, 2001. 8 \n[32] M. Chen, J. Irudayaraj, D.J. McMahon, Examination of full fat and reduced fat 9 \ncheddar cheese during ripening by Fourier Transform Infrared Spectroscopy, J. Dairy 10 \nSci. 81 (1998) 2791–2797. 11 \n[33] C.O. Gill, The control of microbial spoilage in fresh meats, in A.M. Pearson, T.R. 12 \nDutson (Eds.), Advances in meat research: Meat poultry microbiology, AVI 13 \nPublishing Co., Westport, 1986, pp 49–88. 14 \n[34] A. Kakouri, G.-J.E. Nychas, Storage of poultry meat under modified atmospheres or 15 \nvacuum packs; possible role of microbial metabolites as indicator of spoilage, J. Appl. 16 \nBacteriol. 76 (1994) 163-172. 17 \n[35] T.A. McMeekin, Microbial spoilage of meats, in R. Davies (Ed.), Developments in 18 \nfood microbiology, Applied Science Publishers, London, 1982, pp. 1–40. 19 \n[36] G.-J.E. Nychas, D.M. Dillon, R.G. Board, Glucose: a key substrate in microbial 20 \nspoilage of meat and meat products, Biotechnol. Appl. Biochem. 10 (1988) 203-231. 21 \n[37] S. Charaniya, W.S. Hu, G. Karypis, Mining bioprocess data: opportunities and 22 \nchallenges, Trends Biotechnol. 26 (2008) 690-699. 23 \nPage 23 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 23 \n[38] M. Mataragas, P. Skandamis, G.-J.E. Nychas, E.H. Drosinos, Modelling and 1 \npredicting spoilage of cooked, cured meat products by multivariate analysis, Meat Sci. 2 \n77 (2007) 348-356. 3 \n[39] S. Panigrahi, S. Balasubramanian, H. Gu, C. Logue, M. Marchello, Neural-network-4 \nintegrated electronic nose system for identification of spoiled beef, Lebensm.-Wiss. 5 \nTechnol. 39 (2006) 135-145. 6 \n[40] I.A. Basheer, M. Hajmeer, Artificial neutal networks: fundamentals, computing, 7 \ndesign, and application. J. Microbiol. Methods 43 (2000) 3-31. 8 \n[41] T. Ross, Predictive microbiology for the meat industry, Meat and Livestock Australia, 9 \nNorth Sydney, 1999. 10 \n[42] P. Dalgaard, Fresh and lightly preserved seafood, in C.M.D. Man, A.A. Jones (Eds.), 11 \nShelf-life evaluation of foods, Aspen Publishing Inc., Maryland, 2000, pp. 110-139. 12 \n[43] T. Ross, P. Dalgaard, S. Tienungoon, Predictive modeling of the growth and survival 13 \nof Listeria in fishery products, Int. J. Food. Microbiol. 62 (2000) 231-245. 14 \n[44] S. Jeyamkondan, D.S. Jayas, R.A. Holley, Microbial modelling with artificial neural 15 \nnetworks, Int. J. Food Microbiol. 64 (2001) 343-354. 16 \n 17 \n 18 \n19 \nPage 24 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 24 \nBiographies 1 \n 2 \nAnthoula Argyri is a PhD candidate within the Applied Mycology Group at Cranfield 3 \nUniversity. Her PhD research is focused on the application of rapid instrumental techniques 4 \n(FTIR, Raman spectroscopy, e-nose, HPLC, GC) for spoilage detection of meat. 5 \n 6 \nEfstathios Panagou is a Lecturer of quantitative food microbiology at the Agricultural 7 \nUniversity of Athens. His PhD degree was focused on fermentation processes and microbial 8 \necology of naturally fermented table olives. His current research interests include table olive 9 \nfermentation, predictive microbiology and rapid methods for the determination of food 10 \nspoilage and quality.    11 \n 12 \nPetros Tarantilis is Assistant Professor of instrumental analysis of plants at the Agricultural 13 \nUniversity of Athens. His research interests involve the isolation, purification and structure 14 \ndetermination of natural products using spectroscopic techniques, the instrumental analysis of 15 \nfood as well as the development of new techniques for the separation, evaluation and analysis 16 \nof main compounds of natural products.    17 \n 18 \nMoschos Polysiou is Professor of instrumental analysis - organic chemistry at the 19 \nAgricultural University of Athens, Director of the Chemistry Laboratory and Vice-Rector for 20 \nAcademic Affairs and Personnel. His research interests involve isolation, identification and 21 \nstudy of the main components of natural products by spectroscopic and analytical methods, 22 \nstudy of synthetic and natural products as anticancer agents, study of the stereochemistry of 23 \nbiologically active compounds by molecular modeling and development of new techniques 24 \nfor the classification-identification of pollen and microorganisms by FTIR spectroscopy.  25 \nPage 25 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 25 \n 1 \nGeorge-John Nychas is Professor at the Food Science and Technology Department of the 2 \nAgricultural University of Athens, and also Director of the Laboratory of Microbiology and 3 \nBiotechnology of Foods. In the last 20 years he has coordinated and\/or participated in 30 EU 4 \nprojects, in the area of food safety, food microbial ecology, microbial physiology of 5 \npathogenic and spoilage bacteria, natural antimicrobial systems, metabolomics, mathematical 6 \n(predictive) modeling and risk analysis. 7 \n8 \nPage 26 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 26 \nFigure Legends 1 \n 2 \nFig. 1. Schematic structure of the developed neural network. The input layer contains the 3 \nincoming signals of the network corresponding to storage temperature, time, and the values of 4 \nthe five principal components. The output layer contains two nodes, one for the predicted 5 \nquality class (Fresh, Semi-fresh, Spoiled) of meat samples and one for total viable counts. 6 \nij\nw : synaptic weights with i being the index of the input signal neuron and j being the output 7 \nsignal neuron; b: bias term. 8 \n 9 \nFig. 2. Changes of total viable counts (TVC) obtained from beef fillets stored under aerobic 10 \nconditions at 0°C (), 5°C (), 10°C (), 15°C (), and 20°C (). Data points are values 11 \nfrom duplicate meat samples after incubation at 30°C for 48 h. Lines represent growth curves 12 \nfitted with the Baranyi primary model.  13 \n 14 \nFig. 3.  Typical FTIR spectra in the range of 1800 to 1000 cm\n-1\n collected from fresh (black 15 \nline) and spoiled (red line) beef fillets stored at 5°C for 10 days.  16 \n 17 \nFig. 4. Classification performance of neural networks with variable number of neurons in the 18 \nhidden layer according to logistic sigmoid (a) and hyperbolic tangent activation transfer 19 \nfunctions. 20 \n 21 \nFig. 5. Comparison of total viable counts (TVC) of beef fillets generated by the ANN model 22 \nagainst experimentally observed values during storage at aerobic conditions (F: fresh; SF: 23 \nsemi-fresh; S: spoiled meat samples). 24 \n 25 \nFig. 6. Percent relative errors between observed and predicted by the neural network total 26 \nviable counts (TVC) during storage of beef fillets at aerobic conditions (F: fresh; SF: semi-27 \nfresh; S: spoiled meat samples).      28 \n29 \nPage 27 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 27 \n 1 \n 2 \n 3 \n 4 \nFig. 1. 5 \n 6 \n 7 \n 8 \n 9 \n 10 \n 11 \n 12 \n 13 \n14 \nPage 28 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 28 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n 10 \n 11 \n 12 \n 13 \n 14 \n 15 \n 16 \n 17 \n 18 \n 19 \n 20 \n 21 \n 22 \n 23 \n 24 \n 25 \n 26 \n 27 \nFig. 2. 28 \n29 \n2\n3\n4\n5\n6\n7\n8\n9\n10\n0 50 100 150 200 250 300 350\nStorage time (hours) \nlo\ng\n c\nfu\n c\nm\n-2\n \nPage 29 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 29 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n 10 \n 11 \n 12 \n 13 \n 14 \n 15 \n 16 \n 17 \n 18 \n 19 \n 20 \nFig. 3.  21 \n22 \n \n 0.0\n 0.1\n 0.2\n 0.3\n 0.4\n 0.5\n 0.6\n 0.7\n 0.8\n 0.9\n 1.0\n 1.1\n 1.2\n 1.3\n 1.4\n 1.5\n 1.6\nA\nb\ns\no\nrb\na\nn\nc\ne\n 1000   1100   1200   1300   1400   1500   1600   1700   1800  \nWavenumbers (cm-1)\nPage 30 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 30 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n 10 \n 11 \n 12 \n 13 \n 14 \n 15 \n 16 \n 17 \n 18 \n 19 \n 20 \n 21 \n 22 \n 23 \n 24 \n 25 \n 26 \n 27 \n 28 \n 29 \n 30 \n 31 \n 32 \n 33 \n 34 \n 35 \n 36 \n 37 \n 38 \n 39 \n 40 \n 41 \n 42 \n 43 \n 44 \n 45 \n 46 \n 47 \n 48 \nFig. 4. 49 \n50 \nNumber of neurons \nC\no\nrr\nec\nt \ncl\nas\nsi\nfi\nca\nti\no\nn\n (\n%\n) \n40\n50\n60\n70\n80\n90\n100\n5 10 15 20 25\nFresh Semi-fresh Spoiled Overall\n40\n50\n60\n70\n80\n90\n100\n5 10 15 20 25\nFresh Semi-fresh Spoiled Overall\n(b) \n(a) \nPage 31 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 31 \n 1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n 10 \n 11 \n 12 \n 13 \n 14 \n 15 \n 16 \n 17 \n 18 \n 19 \n 20 \n 21 \n 22 \n 23 \n 24 \n 25 \n 26 \nFig. 5. 27 \n28 \nObserved N (log10 cfu cm\n-2\n) \nP\nre\nd\nic\nte\nd\n N\n (\nlo\ng\n1\n0\n c\nfu\n c\nm\n-2\n) \n2\n4\n6\n8\n10\n2 4 6 8 10\nF\nSF\nS\nPage 32 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 32 \n  1 \n 2 \n 3 \n 4 \n 5 \n 6 \n 7 \n 8 \n 9 \n 10 \n 11 \n 12 \n 13 \n 14 \n 15 \n 16 \n 17 \n 18 \n 19 \n 20 \n 21 \n 22 \n 23 \n 24 \n 25 \nFig. 6.  26 \n-80\n-60\n-40\n-20\n0\n20\n40\n60\n80\n2 4 6 8 10\nF\nSF\nS\nR\nel\nat\niv\ne \nE\nrr\no\nr \n(%\n) \nObserved N (log10 cfu cm\n-2\n) \nPage 33 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 33 \nTable 1 \nEstimated kinetic parameters of total viable counts (TVC) by the Baranyi model as a fun tion of storage temperature (initial counts 3.10 ± 0.30 \nlog10 cfu cm\n-2\n). \n \nTemperature (°C) μmax (h\n-1\n)\na \nLag phase (h) y0 (log10 cfu cm\n-2\n)\nb \nyend (log10 cfu cm\n-2\n)\nc \nStandard error of fit R\n2\n \nObserved Predicted \n0 0.057 125.2 3.03 8.71\nf \n-\ne \n0.445 0.953 \n5 0.091 42.5 3.26 9.44 9.47 0.384 0.974 \n10 0.111 -\nd \n3.26 8.77 8.78 0.522 0.924 \n15 0.194 - 2.87 9.15 9.07 0.338 0.975 \n20 0.312 - 3.17 9.42 9.18 0.278 0.982 \na \nmaximum specific growth rate \nb, c \ninitial and final total viable counts estimated by the Baranyi model \nd \nnot observed \ne \nnot computed as fitted curve presented no upper asymptote \nf \nmean value from two independent experiments  \nPage 34 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 34 \nTable 2 \nConfusion matrix of the 7-10-2 MLP classifier performing the task of discrimination of meat \nsamples based on the leave-1-out cross validation method.  \n \nTrue class \nPredicted class \nRow Total (ni.) Sensitivity (%) \nFresh Semi-fresh Spoiled \nFresh (n=24) 22  2  0 24 91.7 \nSemi-fresh (n=16) 1 13 2 16 81.2 \nSpoiled (n=34) 0 2 32 34 94.1 \nColumn Total (n.j) 23 17 34 74   \nSpecificity (%)\n \n95.6 76.5 94.1   \n \nOverall correct classification (accuracy): 90.5%.  \n \n \n \nPage 35 of 35\nAc\nce\npte\nd M\nan\nus\ncri\npt\n 35 \nTable 3 \nPerformance of the 7-10-2 MLP classifier for the prediction of total viable counts in meat samples (fresh, semi-fresh, spoiled, overall) analyzed \nby FTIR.     \n \nStatistical index Mathematical expression Fresh Semi-fresh Spoiled Overall \nBias factor (Bf) 10\nlog( \/ )\/P O n\n \n1.031 0.951 0.982 0.991 \nAccuracy factor (Af) 10\nlog( \/ ) \/P O n\n 1.181 1.122 1.084 1.123 \nMean Relative Percentage Residual (MRPR %) 1001 O P\nn O\n \n-5.572 3.971 1.082 -0.451 \nMean Absolute Percentage Residual (MAPR %) 1001 O P\nn O\n \n17.564 11.078 7.869 11.708 \nRoot Mean Squared Error (RMSE) 2( )O P\nn\n \n0.872 0.846 0.835 0.850 \nStandard Error of Prediction (SEP %)  2100 ( )O P\nnO\n \n20.861 13.622 9.917 12.937 \n \n"}