{"doi":"10.1088\/0022-3727","coreId":"138632","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/3227","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/3227","10.1088\/0022-3727"],"title":"Interaction of Stern layer and domain structure on photochemistry of lead-zirconate-titanate.","authors":["Jones, Paul M.","Dunn, Steve"],"enrichments":{"references":[{"id":38064093,"title":"A and Kalinin S V","authors":[],"date":"2002","doi":"10.1557\/proc-738-g4.4","raw":"Bonnell D A and Kalinin S V 2002 Ferro. Thin Films 688 317","cites":null},{"id":38064094,"title":"Estefania A","authors":[],"date":"2004","doi":"10.1063\/1.1797535","raw":"Dunn S Cullen D Estefania A G Bertoni B Carter R Howorth D and Whatmore R W 2004 Appl. Phys. Lett. 85 3537","cites":null},{"id":38064096,"title":"Ferroelectric memories London","authors":[],"date":"2000","doi":"10.1007\/978-3-662-04307-3_2","raw":"Scott J F 2000 Ferroelectric memories London Springer","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-03","abstract":"Perovskite ferroelectric materials such as PZT have long been known to have wideband semiconducting properties. It has also been found that they have interesting spatially controllable surface photochemical effects that are not seen in 'normal' semiconductors. This has led to their being studied as possible tools in areas such as metal salt reduction and oxidation for nanoparticle growth. This paper discusses the effects of incident photon energy on the reduction of Ag0 onto PZT(30\/70) surfaces with particular emphasis on the part played by energy band bending and the Stern layer. It was found that for increasing photon energy between 4.4 and 5.0 eV both the [1 1 1] and the [1 0 0] orientations of PZT followed a similar trend in that the average Ag0 cluster cross-sectional area increased by a ratio of ca 1.6 to 1. This increase was put down to the higher energy photons exciting more electrons from deeper in the density of states for the material allowing a greater reduction rate of Ag+ at the surface","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/138632.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1088\/0022-3727\/42\/6\/065408","pdfHashValue":"fb292c9d9f9c93e7ac3984c93cb0660833039551","publisher":"Institute of Physics","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/3227<\/identifier><datestamp>2011-08-08T14:41:39Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Interaction of Stern layer and domain structure on photochemistry of lead-zirconate-titanate.<\/dc:title><dc:creator>Jones, Paul M.<\/dc:creator><dc:creator>Dunn, Steve<\/dc:creator><dc:description>Perovskite ferroelectric materials such as PZT have long been known to have wideband semiconducting properties. It has also been found that they have interesting spatially controllable surface photochemical effects that are not seen in 'normal' semiconductors. This has led to their being studied as possible tools in areas such as metal salt reduction and oxidation for nanoparticle growth. This paper discusses the effects of incident photon energy on the reduction of Ag0 onto PZT(30\/70) surfaces with particular emphasis on the part played by energy band bending and the Stern layer. It was found that for increasing photon energy between 4.4 and 5.0 eV both the [1 1 1] and the [1 0 0] orientations of PZT followed a similar trend in that the average Ag0 cluster cross-sectional area increased by a ratio of ca 1.6 to 1. This increase was put down to the higher energy photons exciting more electrons from deeper in the density of states for the material allowing a greater reduction rate of Ag+ at the surface.<\/dc:description><dc:publisher>Institute of Physics<\/dc:publisher><dc:date>2009-02-27T16:24:27Z<\/dc:date><dc:date>2009-02-27T16:24:27Z<\/dc:date><dc:date>2009-03<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>P M Jones and S Dunn, Interaction of Stern layer and domain structure on photochemistry of lead-zirconate-titanate. Journal of Physics D: Applied Physics. 2009, Volume 42, Number 6, 065408<\/dc:identifier><dc:identifier>0022-3727<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1088\/0022-3727\/42\/6\/065408<\/dc:identifier><dc:identifier>http:\/\/hdl.handle.net\/1826\/3227<\/dc:identifier><dc:language>en<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0022-3727","0022-3727"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article"],"fullText":"Journal of Physics D: Applied Physics, Volume 42, Number 6, 21 March 2009, 065408\nInteraction of Stern layer and domain structure on\nphotochemistry of lead-zirconate-titanate.\nP M Jones and S Dunn\nBld. 70, Nanotechnology Centre, Cranfield University, Bedfordshire, MK43 0AL, UK.\nE-mail: paul.jones@cranfield.ac.uk\nAbstract.\nPerovskite ferroelectric materials such as PZT have long been known to have wideband\nsemiconducting properties. It has also been found that they have interesting spatially\ncontrollable surface photochemical effects that are not seen in “normal” semiconductors. This\nhas led to them being studied as possible tools in areas such as metal salt reduction and\noxidation for nanoparticle growth. This paper discusses the effects of incident photon energy\non the reduction of Ag0 onto PZT(30\/70) surfaces with particular emphasis on the part played\nby energy band bending and stern layer. It was found that for increasing photon energy\nbetween 4.4eV and 5.0eV both the [111] and [100] orientations of PZT followed a similar\ntrend in that the average Ag0 cluster cross sectional area increased by a ratio of ca 1.6 to 1.\nThis increase was put down to the higher energy photons exciting more electrons from deeper\nin the density of states for the material allowing a greater reduction rate of Ag+ at the surface.\nKeywords: Grain boundaries; Surfaces; Electrical properties; Optical properties; PZT.\n1. Introduction\nFerroelectric materials of the perovskite ABO3 structure, such as BaTiO3 [1] and Pb(Zrn,Ti1-\nn)O3 (PZT) [2,3], have been shown to act as polarisable wide bandgap semiconductor\nphotocatalysts [4,5]. It has been shown that the surface of ferroelectric materials, in their thin\nfilm form, have interesting photochemical interactions when in contact with metal salt\nsolutions in the presence of super bandgap irradiation. These interactions are dependent on\nthe polarisation of the surface domains [6] and form the well known REDOX cycle where\nreduction occurs on positive, C+, domains and oxidation occurs on the negative, C-, domains.\nAs an example when PZT(30\/70) is immersed in AgNO3 solution and irradiated with UV the\nAg+ reduces to Ag0 on the surface of the C+ domains while at the C- domain oxidation of H2O\nand possibly the NO3 anion takes place [7]. It is the spatial controllability of these REDOX\nreactions on the ferroelectric surface that is getting much interest in areas as diverse as the\nsynthesis of nanoparticles of defined morphology and hydrogen evolution from water for use\nin fuel cells as an alternative to fossil fuels. It is also possible to use ferroelectric materials in\noptoelectronic devices such as photovoltaics where efficient separation of electron holes pairs\nare required.\nThe reduction of cations from solution is due to a series of complex steps that take place at\nthe ferroelectric interface [7]. As an interface is an area where the bulk crystallographic\nplanes of a solid are interrupted, the energy levels in these areas will differ from those in the\nbulk. In a ferroelectric these interruptions cause the development of a depolarisation field [8]\nwhich is screened by various processes. These can be internal in the form of energy band\nbending and the formation of a space charge region (SCR) within the surface, or external as\nan electrical double layer [9]. When exposed to UV with energy above the bandgap (Eg) of\nthe material electron-hole pairs are formed. Those in the SCR are driven apart by the field\ngenerated in this region; in C+ domains the electrons (e-) migrate to the interface and holes\n(h+) into the bulk. In C- domains the h+ migrate to the surface.\nIn the case of Ag reduction on the surface of PZT the reduced ions form as clusters across the\nsurface [2,10]. It has been shown that grain boundaries experience the greatest growth of Ag\nunder UV irradiation by a ratio of at least 50 to 1 [7]. From these observations it was shown\nthat grain boundaries are the most photoactive areas on the PZT surface. The preferential\ngrowth at the boundaries was explained by the existence of a charged region in the core of the\ngrain boundary and the formation of double SCR, one on either side. Photoexcited e- in the\ngrain migrate to the boundary due to the field generated by the SCR and are then accepted by\nthe Ag+ ions in solution which then reduced to metallic Ag0 at the boundary surface. It has\nalso been seen that the nucleation density across the film was fixed from the initial growth of\nthe Ag clusters through to the final cluster. From this it can be concluded that the surface\nmorphology controls the nucleation of the metal and the domain polarity controls the type of\ncarrier that migrates to that surface.\nEnergy band bending and subsequent formation of a SCR are the internal, compensation\nmechanisms at the PZT\/Solution interface. The formation of a stern layer is the external\ncompensation mechanism. This layer consists of an inner and outer Helmholtz plane and a\ndiffusion region that extends into the bulk of the solution. An interface only partially screened\nby the internal processes will have a surface potential countered by these outer ionic layers.\nPZT which has a high quantity of oxygen vacancies across the surface plane, ca 1014 cm-2\n[11], will mostly be compensated by the internal migration of charge carriers. However, the\nformation of a stern layer will still occur.\nRecent work [10] has shown the reduction of Ag0 onto the PZT surface can be affected by the\nflux and energy of the incident photons. Here we show that these effects are related to the\ninterplay between photon energy and the internal and external energy compensation processes\nat the PZT surface\/solution interface. This was accomplished by examining the effects of\nmonochromatic UV over various wavelengths on Ag reduction and deposition to gain a\ngreater understanding of the effects photon energy on the growth of clusters on PZT.\n2. Experimental\n70nm thick [111] and [100] orientated PZT(30\/70) samples were manufactured using the sol-\ngel method [12]. The [111] orientated samples were deposited on to Ti\/Pt sputtered Si\nsubstrates and the [100] on Pt coated MgO substrates. The films were pyrolised at 220°C for\n2 minutes before being annealed at 560°C for 5 minutes. Film structure and orientation was\nconfirmed by X-ray diffraction. The grain size was found to be in the region of 70-100nm.\nThe films were cleaved into smaller samples and patterned using a modified Dimension 3000\nAFM which was also used to undertake Piezoresponse Force Microscope (PFM)\ncharacterisation of the films polar domains [13,14]. Each sample was immersed in fresh\n0.01M AgNO3 solution and placed into a UV irradiation chamber with a Honle 400W Hg\nlamp as the light source. The irradiating wavelength was controlled via a monochromator\nwith a bandwidth of ca 5nm. Due to the non continuous nature of the lamp output intensity\nover its spectrum, various wavelengths were chosen that gave the same flux for each test.\nIrradiation time was 4 hours and a different wavelength was used for each pair of samples, a\npair being a [111] and [100] oriented set of samples. The sample temperature was constant at\n25˚C. After irradiation the samples were rinsed with deionised water and dried using nitrogen.\nThe irradiated samples were examined using a scanning electron microscope (SEM) in high-\nresolution mode. The cross sectional area of the particles was measured using the ImageJ\nv1.37 imaging software.\n3. Results and Discussion\nAfter irradiation in the AgNO3 solution the resulting deposition across the PZT surfaces\nshowed that there was a strong link between photon energy and the final size of the Ag0\nclusters. It also highlighted that the orientation of the film played a part in the rate of growth\nof the clusters. Figure 1 and Figure 2 show the C+ domains for the [111] and [100] samples\nrespectively. It was found that as photon energy increased so there was an increase in average\ncluster cross sectional area.\nFigure 1 C+ domain on [111] orientated PZT 30\/70, after irradiation with 4.1eV (Left) and\n5eV (Right) UV.\nFigure 2 C+ domain on [100] orientated PZT 30\/70, after irradiation with 4.4eV (left) and\n5.0eV (Right) UV.\nThe average cluster size for both film orientations is plotted in Figure 3 over a range of\nphoton energies. Deposition started to occur on the [111] sample at 4.18eV and the [100] at\n4.43eV and stopped for both at 5.06eV, the cut off point for UV transmission through the\nAgNO3 solution. It can be seen that between these points both orientations follow a similar\ntrend, as photon energy increases so there is a linear increase in cluster cross sectional area.\nThis linearity stops at ca 4.84eV where there is an increased area to energy ratio.\nFigure 3 Ag cluster size v photon wavelength and energy for the [111] and [100] samples.\nIt is interesting to note that the cluster density for both samples also seem to be linked to\nincreasing photon energy, though this in fact is not the case. Figure 4 shows this apparent\nincrease in density, as with the cluster area there is a linear increase in cluster numbers up to\n4.8eV and then the rate of increase doubles. The discrepancy between the observed density\nand actual density can be explained by the limitations of the equipment used for imaging the\nsamples. This density increase is not due to new clusters forming on the surface during\nirradiation at increased energy but ones that, due to their relatively low growth rates compared\nto those around them, have already nucleated but are too small to be observed by the SEM\nused in this work. It is not until higher energy photons impinge on the surface that these\nclusters grow to a size that is observable.\nFigure 4 Ag cluster density on C+ domains verses photon energy.\nIn order for clusters to form on C+ domains during irradiation there needs to be a disturbance\nin the external stern layer formed on the surface of the PZT, if not then there would exist a\nlarge barrier of negative charge that would inhibit the necessary reaction with e-. The\nformation of the stern layer on PZT, as discussed earlier, is due to the surface potential that\nforms when the internal charge compensation process is only partially screening the surface\ndepolarising field, Figure 5. As shown the Poisson equation (1) the surface potential, V, is\nlinked to surface charge, , and the remnant polarisation, Pr. The surface charge is in turn\ndetermined by the balance of positive and negative carriers and ionised atoms in the PZT\nsurface (2).\nFigure 5 Internal band bending and external Stern layer formation on C+ and C- domains in\nPZT.\n r\nro\nPxV  \n1\n)(2 (1)\n)(   AD NeNhq (2)\nWhen there is no irradiation and the surface is under equilibrium conditions Pr is greater than\n on the C+ domain. From (1) it can be seen that this imbalance will give a positive V, leading\nto the attraction of negative counterions, i.e. the inner Helmholtz plane will consist of strongly\nattracted anions. With the aqueous AgNO3 solution used in this work the layer would consist\nof desolvated NO3 ions and polarised H2O molecules which acts as a barrier to the Ag+ ions in\nthe outer Helmholtz and diffusion region. The thickness of the inner Helmholtz layer is\ndependent on the radius of the NO3 ions which is ca 0.189nm [15]. In order for the Ag+ ion to\nreach the C+ domain and nucleate there must be a disturbance in the stern layer. Such a\ndisturbance can occur where there is a variation in surface morphology such as the grain\nboundaries where V is different to the surrounding area [16,17]. The process is illustrated in\nFigure 6, in (A) the inner Helmholtz layer, made up NO3 anions, masks the surface of the C+\ndomain from the Ag+ cations. In (B) photoexcited e- migrate to the grain boundaries during\nsuper bandgap illumination of the C+ domain. At the surface of these boundaries the\nmigrating e- accumulate causing a localised variation in V, in effect  becomes greater that Pr,\nand V becomes negative repelling the NO3 anions and attracting Ag+ ions (C) which accept\nthe e- from the PZT surface.\nFigure 6 Stern layer disturbance due to a PZT surface anomaly and cluster nucleation. (A)\nUnder equilibrium conditions, i.e. no photoexcitation, the inner Helmholtz layer, consisting of\nCl- anions, acts as a barrier to the Ag+ cations. (B) Upon UV illumination migrating\nphotoexcited electrons cause a change in the local surface potential of the anomaly. (C) Ag+\ncations are attracted to the anomaly surface and reduce forming the initial nucleation point.\nThe variation in the size of the clusters to change in photon energy can be explained by the\nfact that the morphology of the boundaries can affect the magnitude of V. Photoexcited e- will\nmigrate to the points of highest potential along the grain boundaries. The lower energy\nphotons will excite e- from a shallower region of the valence band which has a low density of\nstates in PZT [18]. The local accumulation of charge at these peaks will cause the required\ndisturbance in the inner Helmholtz layer and allow Ag nucleation to begin. Thus by\nincreasing photon energy more areas along surface defects will experience an accumulation of\ne- and the cluster growth rate will increase.\nThe difference in growth rate between the two orientations can also be explained by the above\nprocess. Though both films have similar surface morphologies, i.e. grain and grain boundary\nsizes etc, there is a variation in the Pr between the [100] and [111] orientations, ca 14μC cm-1\nand ca 21μC cm-1 respectively [19]. Looking at (1) it can be seen that variations in Pr will\naffect surface potential V. As the Pr for [100] is lower than the [111] its V will also be lower\nwhich means that less charge is required to disrupt the stern layer. In this work the grain size\nfor both orientations of film is the same, therefore the wavelength of the light used and the\norientation of the film controls the processes taking place in Ag cluster growth. It has been\nfound in films of large grain size, > 4μm, that have large grain boundaries the Ag clusters can\ngrow at a greater rate than the films used here [7], this effect suggests that the size of the grain\ncan affect the rate of Ag cluster growth.\nThe photoexcited e- that migrate to a growing cluster distribute around its surface giving it a\nnegative charge, this in turn attracts more Ag+ ions from the solution which then reduce. If the\nclusters are not allowed to grow to saturation then there final areas are dependent on the time\nof irradiation and the flux of e- to the PZT surface due to the photons striking that surface. An\nexample of cluster size variations can be seen in Figure 7, where the PZT sample has been\nirradiated for 30 minutes using a wideband light source.\nFigure 7 PZT surface after 30 minute irradiation with mercury wideband UV source.\n4. Conclusion\nThis work has shown that there is a link between the photon energy used for irradiation and\nthe resulting metallic Ag cluster size. As the photon energy increased so it was observed that\narea increased. It was also found that the change in area with increasing energy was linear up\nto 4.8eV where the rate almost doubled; this was explained by the density of states which has\na lower density near the edge of the valence band and then a sudden increase further at higher\nenergy levels. The formation of individual clusters was put down to the interactions taking\nplace in the Stern layer and its disturbance during UV excitation at points of higher relative\npotential to their surroundings.\nAcknowledgments\nThe authors wish to thank Dr Diego Gallardo for his invaluable input, Dr Qi Zhang for the\nPZT sols and Dr Chris Shaw for assistance in sample preparation. This work was undertaken\nas part of the project funded by EPSRC grant number EP\/C510291\/1.\nReferences\n[1] Giocondi J L and Rohrer G S 2001 Chem. Mater. 13 241\n[2] Bonnell D A and Kalinin S V 2002 Ferro. Thin Films 688 317\n[3] Dunn S Tiwari D Jones P M and Gallardo D E 2007 J. Mater. Chem. 17 4460\n[4] Pintilie L Lisca M and Alexe M 2006 J. Optoelect. Adv. Mater. 8 7\n[5] Lee H Kang Y S Cho S J Xiao B and Morkoc H 2005 J. Appl. Phys. 98 94108-1\n[6] Giocondi J L and Rohrer G S 2001 J. Phys. Chem. B 105 8275\n[7] Jones P M and Dunn S 2007 Nanotech. 18 185702\n[8] Yang W C Rodriguez B J Gruverman A and Nemanich R J 2004 Appl. Phys. Lett. 85 2316\n[9] Dunn S Cullen D Estefania A G Bertoni B Carter R Howorth D and Whatmore R W 2004\nAppl. Phys. Lett. 85 3537\n[10] Dunn S Jones P M and Gallardo D E 2007 J. Am. Chem. Soc. 129 8724\n[11] Scott J F 2000 Ferroelectric memories London Springer\n[12] Zhang Q Huang Z Vickers M E and Whatmore R W 1999 J. Euro. Ceram. Soc. 19 1417\n[13] Dunn S Shaw C P and Huang Z 2002 Nanotech. 13 456\n[14] Dunn S 2003 J. Appl. Phys. 94 5964\n[15] Ariza M J and Otero T 2007 J. Membra. Sci. 290 241\n[16] Kim Y Bühlmann S Kim J Park M No K Kim Y K and Hong S 2007 Appl. Phys. Lett. 91\n052906-1\n[17] R Hagenbeck 2001 Sol. State. Phen. 80-81 21\n[18] Silva M S and Cilense M et al 2005 J. Lumin. 111 205\n[19] Kobayashi T Ichiki M Tsaur J and Maeda R 2005 Thin Sol. Film. 489 74\n"}