{"doi":"10.1016\/j.tourman.2003.06.005","coreId":"101709","oai":"oai:epubs.surrey.ac.uk:1139","identifiers":["oai:epubs.surrey.ac.uk:1139","10.1016\/j.tourman.2003.06.005"],"title":"Best Practices In Responsible Marketing Of Tourism: The Case Of Canadian Mountain Holidays","authors":["Hudson, Simon","Miller, Graham"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-04-01","abstract":"<p>Heli-tourism represents one of the great dilemmas and conflicts between recreational enjoyment of the wilderness and the conservation of the fragile alpine and mountain areas where the activity takes place. The question of responsibility towards the environment is one, which tourism operators generally seem reluctant to accept but one operator that appears to have taken a proactive approach to environmental issues in mountain regions is heli-operator Canadian Mountain Holidays (CMH). This paper expands on the limited amount of research that exists on the complex relationship between tourism and the environment by applying a responsible marketing model to CMH. This model is grounded on previous literature in marketing, and strategic and environmental management. Interviews with key stakeholders, observational research, and content analysis of communication materials, were used to identify how near CMH is to finding a balance between responsible action and the communication of these activities.<\/p","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1139<\/identifier><datestamp>\n      2017-10-31T14:00:48Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D6172747368756D616E736369656E636573:746F757269736D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1139\/<\/dc:relation><dc:title>\n        Best Practices In Responsible Marketing Of Tourism: The Case Of Canadian Mountain Holidays<\/dc:title><dc:creator>\n        Hudson, Simon<\/dc:creator><dc:creator>\n        Miller, Graham<\/dc:creator><dc:description>\n        <p>Heli-tourism represents one of the great dilemmas and conflicts between recreational enjoyment of the wilderness and the conservation of the fragile alpine and mountain areas where the activity takes place. The question of responsibility towards the environment is one, which tourism operators generally seem reluctant to accept but one operator that appears to have taken a proactive approach to environmental issues in mountain regions is heli-operator Canadian Mountain Holidays (CMH). This paper expands on the limited amount of research that exists on the complex relationship between tourism and the environment by applying a responsible marketing model to CMH. This model is grounded on previous literature in marketing, and strategic and environmental management. Interviews with key stakeholders, observational research, and content analysis of communication materials, were used to identify how near CMH is to finding a balance between responsible action and the communication of these activities.<\/p><\/dc:description><dc:date>\n        2004-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1139\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Hudson, Simon and Miller, Graham  (2004) Best Practices In Responsible Marketing Of Tourism: The Case Of Canadian Mountain Holidays   Tourism Management, 26 (2).       <\/dc:identifier><dc:relation>\n        10.1016\/j.tourman.2003.06.005<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1139\/","10.1016\/j.tourman.2003.06.005"],"year":2004,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" 1 \nBEST PRACTICES IN RESPONSIBLE MARKETING OF TOURISM: THE CASE OF \nCANADIAN MOUNTAIN HOLIDAYS  \n \nINTRODUCTION \n \nThe theory on sustainable tourism emphasizes the critical importance of environmental \nstewardship (Brandner et al., 1995; Bieger et al. 2000) particularly for those destinations \nin mountain areas (United Nations, 1993). Similarly a common thread running through all \nof the existing literature on competitiveness suggests that to be competitive, a company \nmust be sustainable from an environmental perspective (d’Hauteserre, 2000; Crouch and \nRitchie, 1999; Goeldner, Ritchie and McIntosh, 2000; Hassan, 2000). However, we are in \na transitional phase of industrial history in which companies generally are still \ninexperienced in handling environmental issues creatively (Porter and van der Linde, \n1995). A substantial fraction of environmental spending relates to the regulatory struggle \nitself and not to improving the environment, particularly in the service sector (Henriques \nand Sadorsky, 1996). But corporate managers in certain industry sectors have begun to \nconsider environmental management a critical component for sustaining competitive \nadvantage (Hunt and Auster, 1990; Barrett, 1992), and in the tourism industry it is time \nfor managers to start recognizing environmental improvement as an economic and \ncompetitive opportunity, rather than an annoying cost or inevitable threat. \n \nYet, if environmental improvement is to provide a competitive opportunity there must be \nconsideration of responsible marketing, defined here as the balancing of environmental \n 2 \ninitiatives and environmental communication in order to achieve sustainable competitive \nadvantage. Unfortunately, there has been no consistent approach to environmental \nmarketing practices in tourism. Some companies neglect their environmental obligations, \nperhaps due to lack of guidelines and examples of best practice, or perhaps because they \ndon’t understand the benefits (Hudson, 1996). Others exploit environmental \ncommunication for short-term gains, or fail to tell visitors about their environmental \ninitiatives (Wight, 1994). This article proposes a model for responsible marketing that \nmanagers in the tourism industry can use to improve their environmental marketing \npractices, and applies the model to Canadian Mountain Holidays (CMH), a medium-sized \nCanadian tour operator. \n  \nTHEORETICAL FRAMEWORK \nINSERT FIGURE 1 \n \nFigure 1 has been developed as a framework for this study based on previous literature in \nmarketing, and strategic and environmental management (Wartick and Cochran, 1985; \nHunt and Auster, 1990; Meagher, 1991; Roome, 1992; Wight, 1994; Henriques and \nSadorsky, 1996; Aragon-Correa, 1998). The model adopts the view that a company can \nbe plotted on a two-by-two matrix to identify its position regarding responsible \nmarketing. The vertical axis represents environmental action and the horizontal axis \nrepresents communication of these activities. Companies can take up one of four \ntheoretical positions on the model. They can be classified as inactive when they tend not \nto see the benefits of allocating any resources toward environmental activities; they have \n 3 \na low level of commitment to both environmental improvement and to communication of \nenvironmental activities. Those that see the benefits of environmental action (perhaps for \nregulatory purposes), but fail to communicate these efforts are reactive. Companies that \nexploit consumer interests in environmentally friendly products without considerations of \nresource characteristics, environmental ethics or a long-term perspective are seen as \nexploitive. The position on the model most likely to remain sustainable (and competitive) \nis where environmental action and environmental communication of this action is high, \nand these organizations are labelled as proactive. Here the company and its associated \nproducts\/services are developed sensitively, with regard to their long-term future, and \nconsumers are aware (both before purchase and during the visit) of the concern for the \nresources involved.   \n \nIt is important to recognize that a company’s position on the model may only be \ntemporary, as it may be in transit between one place in the model and the next. Further, \nthere are likely to be a variety of contingency factors that will affect a company’s \nposition on the model. Previous research suggests that these influences include the level \nof environmental pressures from stakeholders (Henriques and Sadorsky, 1996), \nmanagerial interpretations of environmental issues (Sharma, 2000), the level of \nenvironmental regulations (Rugman and Verbeke, 1998), and the size and the financial \nposition of the company (Aragon-Correa, 1998).  \n \n \n 4 \nHELI-TOURISM AND CANADIAN MOUNTAIN HOLIDAYS \n \nOne of the fastest growing sectors of the adventure tourism industry is heli-tourism \n(Thirkell, 1999). Under this catchy compound name, several subcategories have evolved, \noffering the public a diverse range of activities encompassing everything from heli-fly \nfishing to heli-picnicking. But the most popular are winter heli-skiing and summer heli-\nhiking. One company that specializes in both is Canadian Mountain Holiday (CMH). \nCMH, a helicopter pioneer, was founded in 1965 and operates in 11 mountain areas of \nSouth Eastern British Columbia. The Banff-based company has annual revenues of about \nCDN$50 million, and claims a 70 per cent repeat-booking figure. CMH holds license \nrights from the B.C. government to more than 15,000 square kilometres of remote \nterritory in the Purcell, Cariboo, Selkirk and Monashee mountain ranges. CMH is several \ntimes the size of its next competitor in heli-ski visits, its operations include 30 \nhelicopters, and seven remote lodges – many accessible in winter only by helicopter. \nThere are three main strands to its business: heli-skiing; heli-hiking; and mountaineering. \n \nSince 1965, CMH has experienced strong growth, but a challenge to this growth has \nappeared in the form of increased environmental awareness and opposition to such tourist \nactivities by environmentalists. Some have raised concerns about the negative \nenvironmental impacts on fish and wildlife, about waste and fuel storage areas, and about \nnoise pollution. Heli-tourism has not escaped this attention. In Europe, heli-skiing is \ntechnically banned in France and most of Switzerland and Austria because of \nenvironmental concerns, and environmentalists are beginning to focus their attention on \n 5 \nNorth America. The East Kootenay Environmental Society (EKES) has emerged as a \nfierce opponent to tourism organizations who operate in British Columbia’s (B.C.) \nbackcountry. Claiming that BC’s backcountry is home to 75 percent of the world’s \nmountain goat population as well as being the last refuge for the endangered mountain \ncaribou, EKES claim that heli-tourism seriously impacts their critical wildlife habitats \nand wild spaces.  \n \nOBJECTIVES \n \nUnfortunately, the quality of marketing research for tourism organizations is still wholly \ninadequate and this is arguably the greatest single obstacle to the development of \nsustainable competitive strategies (Middleton and Hawkins, 1998). The objective of this \nstudy therefore, was to build on the research that exists on the complex relationship \nbetween tourism and the environment by applying the responsible marketing model to \nCMH. By positioning tourism operators like CMH on the model, inconsistencies between \nthe publicly stated policies of companies and their actions can be identified. Those \norganizations that achieve a balance between environmentally responsible action and \ncommunication of these activities can be used as role models in the industry, as proactive \ntourism operators that have gone beyond compliance have typically been guided by the \npractices of others (Todd and Williams, 1996).  \n \n \n \n 6 \nMETHODOLOGY \n \nInterviews with key stakeholders, observational research, and content analysis of \ncommunication materials, were used to identify how near CMH is to finding a balance \nbetween responsible action and the communication of these activities. Key stakeholders \nwere identified using the ‘snowball effect’, and in-depth interviews were conducted with \nindividuals from CMH, other heli-tourism operators, environmental groups, the \ngovernment, tourism action groups, and ski area associations. In the interviews the \nquestions followed an interview guide format, with appropriate probes used to encourage \nan informal conversation. In all the interviews a few main concepts were explored with \nall the informants. These concepts were based on the marketing model described above. \n \nParticipant observational research took place during the heli-hiking summer training \ncourse for guides in 2002. Many authors believe that the distinctive capabilities of \nobservational methodologies for investigating services phenomena have not yet been \nwidely recognized (Crano and Brewer, 1986; Jorgensen, 1989; Grove and Fisk, 1992). A \nfull discussion of the advantages and disadvantages of observational methods is not \npossible here, but there are several widely used classifications (see Boote and Mathews, \n1999 for a brief outline of the most popular of these). In this study the author examined \nthe operations of CMH in practice and looked for evidence of environmental initiatives to \nsupport the material gathered in the interviews. \n \n 7 \nContent analysis was employed to examine the nature and level of communication of \nenvironmental activities by CMH. Content analysis uses an objective, systematic \napproach to measure the meaning of communicated material through the classification \nand evaluation of selected words, themes or concepts. Content analysis has evolved since \nits introduction in the 1920s, largely in social science applications and has great promise \nas a tool for tourism marketing analysis (Fletcher, Witt and Moutinho, 1994). It has been \nthe chosen methodology in most previous ethical code studies, and is useful as it seeks to \nunderstand data as symbolic phenomena and lends itself well to examining language in \nwritten documents (Krippendorff, 1980). All types of communication materials were \nanalyzed including CMH brochures, Web pages, newsletters, press releases and videos. \nInterviews with guides and overseas agents provided further insights into the level of \nenvironmental communication given to consumers both before and during a holiday. \n \n RESULTS \n \nEnvironmental Activities \n \nEnvironmental Policy \nAs yet, CMH does not have a specific environmental policy. However, the company is \nclose to publishing a new sustainability report, one of the first major tour operators in \nCanada to produce a corporate report of this kind. CMH has implemented a program \ncalled ‘Second Nature’, an in-house comprehensive program of social and environmental \ninitiatives which is an attempt to put all of their environmental and sustainability projects \n 8 \nunder one umbrella (Hay, 2002). The company says that the environment has always \nbeen a cornerstone of its vision which is to “lead in safety, excellence of service and \nenvironmental harmony, maintaining the family atmosphere on which the company was \nfounded”(CMH, 2002).  \n \nAccording to Eileen Fletcher, Tourism Development Coordinator for the Tourism Action \nSociety of the Kootenays (TASK), CMH is the only operator in the Kootenays that has \nthe resource capacity to sit back and think about visioning: CMH’s understanding of \nenvironmental issues is usually about four years ahead of anyone else” she says. “The \ncompany is very often a source of information about where things are going to go…and \nbecause they are proactive, it has given them credibility in Government”. She believes \nthat industry driven best practices are going to be important in the future, and it is “good \nbusiness for CMH to observe best practices – CMH’s clients are well educated and \nwouldn’t buy products that have negative environmental impact” (Fletcher, 2001). \n \nWildlife \nOver the years, CMH has trained its guides to keep a vigilant watch for wildlife. The \nguides plan their flying and skiing routes to avoid contact, and all wildlife sightings are \nprovided annually to the B.C. Government for their overall management purposes. They \nuse computer software to map wildlife sightings, and to maintain a sense, over time, \nabout the areas where animals spend their time at various times of the year. CMH also \nlooks to external biologists to give them a sense of how best to behave in these habitats. \nThe goal according to Dave Butler “is to prevent disturbance, and to ensure that our \n 9 \nactivities don’t contribute to mortality, or to changes in use of habitat, or changes in \ndistribution of the animals across the landscape … to work our operations so that the \nanimals see us as a neutral influence in their lives” (Butler, 2002). \n \nHowever, the company, according to industry experts, “is involved in a gruelling battle \nwith the East Kootenay Environmental Society, over the impacts of heli-tourism on \nwildlife” (Spencer, 2001; Madson, 2002). EKES claim that heli-tourism seriously \nimpacts the mountain goat and caribou.  For example, the society claims that a two-\nkilometre avoidance distance to goat habitat is strongly supported by research and \nprovincial wildlife biologists. CMH, University researchers and BCAL (the Crown \nCorporation in charge of land use tenures on Crown Land) say that research is not \nconclusive, and a further study of mountain goat reaction to helicopter use is presently \nproposed: “Their claims fail to recognize the many factors that are at work on these \npopulations, including predation, habitat loss, hunting, weather, disease, etc.” says \nButler.   \n \nVegetation  \nIn the summer, existing trails are used where possible, and use is dispersed throughout \neach operating area so that impacts on fragile alpine environments are minimized. The \ncompany claims that the potential impact on the land in the winter is negligible because \nvisitors leave only tracks in the snow. They also have the ABLE (Applying Backcountry \nLandscape Evaluations) project underway, where they are measuring and re-measuring a \nseries of 250 permanent plots in their hiking areas, and looking at how these areas might \n 10 \nbe changing (or not) over time as a result of their activities. “This project has already \nallowed us to change and improve our hiking program”, says Butler, suggesting that \nperhaps there were some impacts to begin with. \n \nGarbage and Waste Management \nCMH claims to reduce waste at every opportunity. For example in the Adamant Lodge in \nthe Selkirk Mountains, food waste (that used to be consumed by lodge pigs until foot-\nand-mouth scares encouraged CMH to change procedures) is eliminated by using a \nprototype composting system developed by the maintenance manager Duane Dukart. In \n2002, CMH implemented the ‘President’s Award for Environmental Initiative’, a \nprogram which empowers all staff to take a look at what they can change in their own \njobs that will help the environment. Duane received the first President’s Award for his \nefforts to promote environmental stewardship. The company also employs the latest \ntechnology in sewage treatment and use only environmentally friendly soaps and paper.  \n \nFuel Management \nEach of the helicopter fuelling locations use leading edge technology to prevent fuel \nspills from reaching the ground or the water. These systems include the use of engineered \ncontainment berms and a state of the art emergency spill response system. Use of the \nhelicopters is minimized wherever possible as this is the greatest direct cost of operations. \nThe fuel for the helicopters is stored at the lodges, and at remote fuel caches, using \nleading-edge storage facilities. \n \n 11 \nEnergy and Recycling \nCMH continually seek to reduce the amount of fuel used for heating and power. For \nexample, propane use has been reduced significantly by recycling the heat produced by \ngenerators to heat the water in the lodges. Most of the lodges are powered by diesel \ngenerators, while propane is used for heating and cooking. By using heat exchangers on \nthe generators, they save about 30,000 litres of propane per area, per year. And by using \nlow-flow shower-heads, energy efficient light bulbs, new methods of handling laundry, \ntreating waste water and a full recycling program, they reduce energy consumption even \nfurther. \n \nForest Harvesting and Trail Construction \nGuides at CMH are trained in the latest low-impact travel techniques for alpine areas, and \nthey share these approaches with the visitors. In the summer they hike on routes that are \nhardy, such as rocky ridges and dry meadows. For the winter products, CMH works with \nlocal forestry companies coordinating efforts to harvest in ways that work best for skiers \nwhile reducing the visual impact of harvesting. Landing and pick-up locations are also \nplaced in areas of minimum impact on the forest. To help rejuvenate the forests, the \ncompany plants a tree each year for each hiker and skier.   \n \nEducation and training \nAccording to the CMH brochure, “the company is committed to ensuring that guests who \ncome from all over the world to experience the mountains will have the opportunity to \nlearn more about these special areas.” In addition, CMH wants to share this knowledge \n 12 \nwith educational institutions, community groups and other users of these special areas. \nFor example, to help better educate hikers, vacationers and others about black and grizzly \nbears, CMH was an active participant in the ‘Year of the Bear Program 2001’ – a \nHeritage Stewardship and Learning Program sponsored by Parks Canada.  \n \nTo run their operation CMH employs over 500 people, and training is taken very \nseriously. Guides are encouraged to share with the guests their techniques for low-impact \ntravel in alpine areas, and each year, the company brings in experts to guide training to \nensure that guides are kept up-to-date. “Last year, we had a top bear biologist in, giving \nus ideas about how to minimize our impacts on, and interactions with, bears. The year \nbefore, it was one of the mountain goat researchers”, says Dave Butler.  \n \nCommunity Relations \nCMH is also committed to contributing to, and remaining, an important part of the \ncommunities in which it operates. The company supports a range of community projects, \nsport teams and education institutions. In response to the tragic death of former President \nof CMH in 2001, the Mark Kingsbury Foundation was formed to act as a long-term \nlegacy to support Kingsbury’s vision and passion towards the environment. Employees \nhave taken the lead in getting the Foundation up and running, and some of its purposes \nare: \nto encourage, support and nurture projects and initiatives designed to protect and enhance \nthe ecological and social components of sustainable tourism; to provide environmental \n 13 \neducation programs for tourism guides; and to support research projects designed to \nimprove operational practices for tourism operations from an environmental perspective. \n \nResearch and Knowledge \nOne highly charged issue is the potential impact of heli-tourism on the mountain caribou. \nCMH and the British Columbia Helicopter and Snowcat Skiing Operators Association \n(BCHSSOA) are currently trying to move forward with a research project looking at the \ninteractions between caribou and helicopter and snow-cat skiing that recently received \nthe conceptual support of the province’s Mountain Caribou Technical Advisory \nCommittee (MCTAC). CMH has been involved in other wildlife conservation projects, \nan example being the Mountain Goat Research Program, which will evaluate the effects \nof commercial tourism in traditional goat habitat. CMH is also active in a Wolverine \nResearch Project, a study of Wolverine habitat, a project that the company assists in \nconjunction with the Columbia Basin Fish and Wildlife Compensation Program.  \n \nConnections to Regulatory Regimes \nCMH is a member of the British Columbia Helicopter and Snowcat Skiing Operators \nAssociation (BCHSSOA). The BCHSSOA represents 29 independent operating \ncompanies in Western Canada, each offering helicopter skiing, snow-cat skiing and\/or \nhelicopter hiking to its guests. Part of the BCHSSOA mandate is to set standards for \nenvironmental stewardship; act as a collective voice for backcountry ski operators to \nensure members govern themselves in a responsible manner; and promote high mountain \nskiing as a viable eco-tourism industry. In September, 2001, BCHSSOA produced a \n 14 \ndraft discussion paper urging for a set of best practices to be maintained and up-dated \nby an Environmental Standards Committee (comprised of associated members and \noutside environmental consultants) of the BCHSSOA membership. The group has been \nasked to move the ‘best practices’ project forward. The intent is to take it to a point where \ncompliance will be a condition of membership, and external (third-party) audits will be \nused to monitor and report compliance. As Dave Butler acknowledges “the key will be \nconnecting (somehow..) with government and NGO’s to ensure credibility”. \n \nCommunication of Environmental Activities  \n \nThe evidence above suggests that CMH has been generally proactive in environmental \ninitiatives, but does the company communicate these initiatives to the various publics? \nThe company uses a number of communication avenues, and these are discussed in turn.   \n \nBrochures \nCMH produces colourful brochures for each of its three brands (with winter brochures \nbeing produced in six languages). The 2002\/2003 heli-skiing brochure has one page of 50 \ndedicated to “The Operation and our environment”, and describes the major \nenvironmental initiatives the company is undertaking “to ensure the long-term viability of \nour mountain heritage”. The summer heli-hiking brochure also has a page dedicated to \n“CMH and the environment”, and begins by saying “environmental sensitivity is a \npriority at CMH and we view ourselves as stewards of these mountains”. In the \nmountaineering brochure there is no mention of environmental initiatives, apart from a \n 15 \nsentence about the lodges which are “designed to fit harmoniously within the mountain \nenvironment”.   \n \nCMH is also part of the ‘Adventure Collection’, a group of six adventure companies who \nhave joined together to form an alliance based on the principle that each company is \ndeeply committed to the environment and culture through which they travel. According \nto Chief Marketing Officer Marty von Neudegg, this is not a marketing alliance but rather \na group formed to demonstrate that tourism can be a positive force rather than a negative \none. However, the alliance has been criticized for being nothing more than a marketing \nalliance - an excuse to exchange mailing lists, and to combine itineraries to create new \ntrips (Higgins, 2000). At the guides training course, these criticisms were justified when \nthe CEO of CMH, Walter Bruns, addressed the audience on the marketing benefits of this \nalliance.  \n \nNewsletters \nCMH publishes a newsletter called “CMH News”, previously known as “CMH Heli-\nFacts”. In the very first issue in 1998 there was a section called “CMH and the \nEnvironment” that talks about the “stewardship ethic” at CMH and the various \nenvironmental initiatives. Since then, the environment has always featured in the \nnewsletters, and the most recent, published in the fall of 2002, included one page \ndedicated to the new President’s Award for environmental initiatives, and another page \nprofiled Director of Land Resources, Dave Butler, and his environmental \naccomplishments. \n 16 \n \nWeb Site \nCMH has several Web pages dedicated to the company and the environment. For \nexample, a link from the heli-skiing home page leads to a separate Web page titled “The \nOperation and our Environment”. CMH begins communicating its environmental \ninitiatives via the Internet by saying “for nearly 40 years environmental sensitivity has \nbeen a priority at CMH. We view ourselves as stewards of these mountains and take this \nresponsibility very seriously”. There follows a list of some of the environmental \ninitiatives the company is undertaking to “ensure the long-term viability of our mountain \nheritage”. Another link from the heli-hiking home page takes the surfer to a page titled \n“CMH and the environment” where the reader is informed about “low-flow shower \nheads and energy-efficient light bulbs, optional towel and linen replacement, recycling of \ncans, bottles and paper”. \n \nPress Releases \nCMH is beginning to be more active in the public relations area, although some of the \nCMH guides expressed concerns that the company did not seem as ‘media savvy’ as the \nenvironmental groups: “EKES always has the first say on environmental issues, and we \nare left trying to clear our name”, one said. In a press release from 2001, the company \npromoted to the trade their involvement in the Year of the Bear Program. In the article \ntitled “CMH adds ‘Year of the Bear’ to Wildlife Programs”, Dave Butler said “our teams \ndevelopment of a healthy respect for, and understanding of wildlife is crucial to our \ncontinued enjoyment of Canada’s backcountry” (Canadatourism, 2001).  CMH used this \n 17 \nopportunity to publicize three other major wildlife conservation projects they were \ninvolved in: the Cariboo Recovery Project; the Mountain Goat Research Program; and \nthe Wolverine Research Project. In the same year, on the Tourism Together Web site in \nJuly 2001, CMH publicized the Mark Kingsbury Foundation with a full-page article \nabout the foundation and how donations could be made (Tourism Together, 2001). \n \nVideos \nExpensive videos are made for all three activities in up to six languages. In the most \nrecent promotional videos for heli-skiing (A Guides View, 1999) and mountaineering \n(Reach Your Peak, 1998) there is no mention of the CMH environmental philosophy or \nits environmental initiatives. Once in a Lifetime (1998), the heli-hiking promotional \nvideo, does have more pictures of wildlife and suggests that guests can learn about the \nnatural history of the mountains from their guides. \n \nEnvironmental Awards \nCMH made a submission for the first Travel Alberta Tourism Awards (ALTO) under the \ncategory of sustainable tourism in 2001. One of the authors of this paper was a judge for \nthese awards and noted that the application did not included many of the initiatives that \nCMH undertake with regards to the environment. Although not successful on that \noccasion, they have begun to submit to other award programs such as ASTA (American \nSociety of Travel Agents), and Oceans Blue Foundation in Canada. In fact the company \nreceived an honourable mention from Oceans Blue for their Starfish Awards in 2002.  \n \n 18 \nInvitation Evenings \nCMH hosts “An evening with CMH” throughout North America, Europe, Japan and \nAustralia. These are invitation only evenings where past guests are invited to bring their \nfriends to an evening with CMH staff and guides. These events are very successful with \nconversion rates exceeding 75 percent of all participants. Although there is always some \ndiscussion of environmental issues at these evenings, “it is less an issue than is \ncommunicating the experience” (Huber, 2002). \n \nIMPLICATIONS AND RECOMMENDATIONS \n \nIs CMH engaged in responsible marketing, or just a “Green Wash exercise”, as claimed \nby Kat Hartwig, Wilderness Recreation\/Tourism Campaign Spokesperson for EKES \n(Hartwig, 2002)? The results of this study suggest that CMH is generally active in \nenvironmental issues and is in fact proactive in some. In B.C.’s tourism sector, many \nsuggest the company has taken a lead role in a range of activities. Its willingness to \nsupport and chair the BCHSSOA’s Environmental Standards Committee, and to produce \na sustainability report is evidence of this. But some of the environmental actions, such as \nplanting a tree for every skier or hiker, could be construed as ineffective. By taking \nexternal action that does not really strike to the heart of the problems caused by the nature \nof the business could lead to accusations of “tokenism” and may fall into the \n“exploitative” category of Figure 1.  However, such action is an increasingly well-\nrecognised way of demonstrating a company’s commitment to the environment in a \nsimilar way to the totemic, though often energy inefficient practice of recycling.   \n 19 \n \nIn terms of communications, CMH  “has been remiss in communicating its \nenvironmental activities. The company may pay towards research for example, but do not \npublicize it” (Spencer, 2001).  Accusations of ‘Green Wash’ are supported by \ninconsistencies in statements concerning the Adventure Collection alliance, and CMH \nwill have to address these, in order to avoid allegations of exploitation. In addition, \nstatements like “our lodges are designed to fit harmoniously within the mountain \nenvironment” can be seen as the written equivalent to the practice of planting trees, in \nthat without further explanation of the practices of the company it risks creating a \ncynicism and the company’s message appears to be beyond its actions.  \n \nSo on the evidence of the research, the authors would position CMH in the ‘Reactive’ \nquadrant of the model (see Figure 1), but the company appears to be moving towards a \nmore sustainable position where there is a balance between environmentally responsible \naction and environmental communication of these activities – taking a ‘Proactive’ stance.  \nTo reach this ‘desired position’ on the model, the authors have made the following \nrecommendations in terms of actions and communications.  \n \nFirstly, CMH could work towards developing an eco-label scheme for the heli-skiing \nindustry. It seems highly probable that eco-labels will become increasingly important in \ntourism as in other industries (Buckley, 2001). A routine program of environmental \nbenchmarking within the heli-skiing sector will be an important adjunct of an effective \neco-labelling scheme. This will require companies like CMH to report regularly on their \n 20 \nenvironmental management measures and performance. The sustainability document that \nCMH is working on can act as such a report, but should include unprecedented \ndocumentation of natural resource consumption and the associated pollution, and explain \nwhat the company is doing about it. CMH will have to ensure that representatives of \nconcerned public agencies are consulted on an ongoing basis in the production of this \nreport. Much can be gained through open discussion with the local communities and local \nenvironmental groups, particularly those who are heli-ski critics or development \nopponents. The environmental practices and results should also be published and made \navailable to the general media in addition to interested groups. \n \nAny new lodges should be built with the environment in mind. To date, CMH has not \nbeen proactive in this regard. Green development is an approach to design, construction \nand management that reduces the impact of buildings on the environment and offers \nmany benefits to owners and occupants. These buildings use less energy and water, \nmeaning they cost less to operate; they are more comfortable, often using natural \nventilation and avoiding toxic adhesives and plastics; and they look better, blending into \nthe environment and using sunlight to supplement heat and interior lighting. If lodges are \nto be replaced in the future they should follow Aspens’ new summit lodge example and \n‘deconstruct’ rather that bulldoze. Aspen have published Guidelines for Environmentally \nSustainable Design and Construction of Aspen Skiing Company Buildings, intended to \nguide future development.  \n \n 21 \nIn terms of communications, a strong public relations effort would promote CMH’s green \nmission while educating and setting standards for the industry. The more powerful a \nbusiness gets, the more likely it will come under scrutiny from stakeholders, and adopting \ncause related marketing could counter-balance the bad publicity emanating from this \nclose scrutiny. Cause-related marketing is a rapidly expanding public relations trend in \ncorporate America, particularly during a time when the public is increasingly cynical \nabout big business (Earle, 2000; Wilkinson, 1999). Companies use cause marketing to \ncontribute to the well being of society and to associate themselves with a positive cause \nthat will reflect well on their corporate image. A weakness of cause marketing is that it is \noften short-term, opportunistic, and is seen by more and more people as self-serving and \nexploitive (Smith and Stodghill, 1994). It is therefore important that CMH adopt a cause \n– perhaps using the Mark Kingsbury Foundation as the vehicle - and make the cause an \nimportant part of the company’s business by integrating a non-commercial, socially \nredeeming value system into the company’s business plan and operations. This strategic \nphilanthropy adds an element of trust to the relationship between the company, its \ncustomers and other stakeholders.  \n \nStakeholder credibility would also be improved if CMH publicized its achievements. \nWinning environmental awards would be one way of doing this. Examples include the \nStarfish Award sponsored by the Oceans Blue Foundation in Canada, and the Golden \nEagle Awards established to recognize the environmental contributions of the North \nAmerican Ski Industry. CMH could also consider hosting a Symposium for \n 22 \nEnvironmental Solutions, which would be an opportunity for employees, the Government \nand special interest groups to work together for the environment. \n \nAccording to Mihalic (2000), since the environmental image, not the real environmental \nimpact and environmental quality managerial efforts, influence the choice of tour \noperator, the environmental image of the company has to be communicated to the \npotential visitors. CMH could start by including a section on the environment in the \nmountaineering brochure. At the lodges the company could put “What You Can Do” \nposters up similar to the  ‘6 steps to Sustainable Slopes’ ads appearing in ski magazines \nthat ask skiers to respect wildlife, be considerate, and get involved with others. There \nshould be more emphasis on the environment in the promotional videos, and at invitation \nevenings potential guests should be given more information on CMH’s environmental \ninitiatives. \n \nOther recommendations for CMH include running ‘Ecology Lectures’ to inspire and \neducate customers (maybe as an addition to the ‘evenings with CMH’), employees and \nthe community. Environmental education programs targeting all age groups could also be \nconducted at the lodges, especially during the summer season, and even themed \n‘environmental weeks’ could be packaged. These weeks would emphasize the Eco-\naccommodations, Eco-cuisine, Eco-service etc. and could be actively marketed using \ntraditional mediums. Finally, the company Web site should be improved and updated \nregularly to emphasize environmental achievements. It should be designed to educated \n 23 \nand involve guests, employees, and the public in the company’s efforts to improve its \nenvironmental performance.  \n \nHowever, there are some limitations to being proactive. Mihalic warns that too many \nenvironmental initiatives can be harmful: “too many environmental signs, programs etc. \ncause confusion for potential customers, result in inflation of environmental brands and \nalso lower the value of every single green brand” (Mihalic, 2000 p. 76). In addition, \nsome employees at CMH question the wisdom of raising their heads up and saying “hey, \nwe’re doing a great job here”. For example, one of the summer guides indicated that as \nsoon as the company publicized its use of leading-edge storage facilities at remote fuel \ncaches, the environmentalists – who were unaware of these fuel caches – began to \ncriticize CMH for having such facilities in the wilderness: “it just gave them more \nammunition in their crusade to get us out of here”.  Indeed, this may be a reason why the \nresearch by Rondinelli and Berry (2000) shows companies preferring to take actions \ninternally rather than risk external actions, especially when the internal actions are more \nefficacious in achieving environmental improvements than those external to the \norganisation.  However, once a company has raised its head above the parapet, then it is \nno longer possible to withdraw itself as a target.  Communication of an environmental \nmessage can achieve many potential benefits including increased custom and better, more \nmotivated employees, yet the possible cost of a raised profile is increased attention from \ngroups seeking to ensure the message is matched by action.   \n \n \n 24 \nREFERENCES \n \nAnon (2001). CMH adds ‘Year of the Bear’ to wildlife programs. \nwww.canadatourism.com, 10 April. \n \nAnon (2001). Tourism Together News, www.tourismtogether.com, 6 June.  \n \nAragon-Correa, J.A. (1998). Strategic proactivity and firm approach to the natural \nenvironment. Academy of Management Journal, 41(5), 556-567. \n \nBarrett, S. (1992). Strategy and the environment. Columbia Journal of World Business, \n27(3&4), 202-208. \n \nBieger, T., Muller, H., Elsasse, H., & OK FIS Alpine Ski WM Engadin 2003 (2000). \nNachhaltigkeit der FIS Alppine Ski WM 2003 St. Moritz – Pontesina, Engadin. Eine \nSportveranstaltung im Spannungsfeld zwischen wintschafltichen, okologischen und \ngesesllschaftlichen Anspruchen. St Gallen\/Bern\/Zuerich\/St. Moritz, Switzerland. \n \nBoote, J. & Mathews, A. (1999). Saying is one thing; doing is another: the role of \nobservation in marketing research.  Qualitative Market Research: An International \nJournal, 2(1), 15-21. \n \n 25 \nBrandner, B., Muller, H., Elsasser, H., Meier-Dahlbach, H.P, Sauvain, P., & Sadler, U. \n(1995). Skitourismus: Von der Vergangenheit zion Potential der Zukumft. Teil IV – \nSkitourismus und Nachhaltigkeit. Verlag Rugger AG, Zuerich, Switzerland. \n \nBuckley, R. (2001). Tourism ecolabels. Annals of Tourism Research, 29(1), 183-208. \n \nButler, D. (2002). CMH Land Resources Director. Personal Interviews, 5 February and \n20 June. \n \nCMH Company brochure (2002). Banff, Canada: Canadian Mountain Holidays. \n \nCrano, W.D. & Brewer, M.B. (1986). Observational and archival data, in W.D. Crano, \nand M.B. Brewer (Eds.) Principles and Methods of Social Research, 279-309. \nNewton, MA: Allyn-Bacon. \n \nCrouch. G. I. &  Ritchie, B.J.R. (2000). Tourism, competitiveness, and societal \nProsperity. Journal of Business Research, 44, 137-152.  \n \nEarle, R. (2000). The Art of Cause Marketing, New York: McGraw-Hill. \n \nFletcher, E. (2001). Tourism Development Coordinator for the Tourism Action Society of \nthe Kootenays (TASK). Personal Interview, 6 November. \n \n 26 \nFletcher, J.E., Witt, S.F. & Moutinho, L. (1994). Analytical Methods Applied to Tourism, \nHemel Hempsted: Prentice-Hall. \n \nGoeldner, C. R., Ritchie, J. R. B. & McIntosh, R. W. (2000). Tourism. Principles, \nPractices, Philosophies, New York: John Wiley & Sons, Inc.  \n \nGrove, S.J. & Fisk, R. (1992). Observational data collection methods for services \nmarketing: an overview. Journal of the Academy of Marketing Science, 20(3), 217-224. \n \nHartwig, K. (2002). Wilderness Recreation\/Tourism Campaign Spokesperson for EKES. \nPersonal Interview, 2 January. \n \nHassan, S. S. (2000). Determinants of market competitiveness in an environmentally \nsustainable tourism industry. Journal of Travel Research, 38(3), 239-245. \n \nd'Hauteserre, A. (2000). Lessons in managed destination competitiveness: the case of \nFoxwoods Casino Resort. Tourism Management, 21(1), 23-32.  \n \nHay, J. (2002). CMH Staff Feature. CMH News, 40, 8. \n \nHenriques, I. & Sadorsky, P. (1996). The determinants of an environmentally responsive \nfirm: an empirical approach. Journal of Environmental Economics and Management, \n30(3), 381-395. \n 27 \n \nHiggins, M. (2000). Takeoffs and landings. Wall Street Journal, 20 October. \n \nHuber, S. (2002). European Sales Agent for CMH. Personal Interview, 8 April. \n \nHudson, S. (1996). The ‘greening’ of ski resorts: a necessity for sustainable tourism, or a \nmarketing opportunity for skiing communities? Journal of Vacation Marketing, 2(2), \n176-185. \n \nHunt, C.B. & Auster, E.R. (1990). Proactive environmental management: avoiding the \ntoxic trap. Sloan Management Review, 31(2), 7-18. \n \nJorgensen, D.L. (1989). Participant Observation: A Methodology for Human Studies, \nNewbury Park, CA: Sage Publications. \n \nKrippendorff, K. (1980). Content Analysis: An Introduction to its Methodology, Beverly \nHills: Sage. \n \nMadson, R. (2002). President of R.K Heli-Ski. Personal Interview, 3 January. \n \nMeagher, M. (1991). Canadian environmental marketing programs: how to walk the \nbalance in making good environment into good business. In I. Rhind (Ed.) The Canadian \nGreen Marketing Alert, 1(1), 7-10. \n 28 \n \nMiddleton, V.T.C. & Hawkins, R. (1998). Sustainable Tourism: A Marketing \nPerspective, Oxford: Butterworth-Heinemann. \n \nMihalic, T. (2000). Environmental management of a tourist destination: a factor of \ntourism competitiveness. Tourism Management, 21(1), 65-78. \n \nPorter, M. & van der Linde, C. (1995). Green and competitive. Harvard Business Review, \nSeptember-October, 120-134. \n \nRondinelli, D.A. & Berry, M.A (2000). Environmental citizenship in multinational \ncorporations:  social responsibility and sustainable development.  European Management \nJournal, 18(1), 70-84 \n \nRoome, N. (1992). Developing environmental management systems. Business Strategy \nand the Environment, 1, 11-24. \n \nRugman, A.M. & Verbeke, A. (1998). Corporate strategy and international environmental \nPolicy. Journal of International Business Studies, 29(4), 819-833. \n \nSharma, S. (2000). Managerial interpretations and organizational context as predictors of \ncorporate choice of environmental strategy. Academy of Management Journal, 34(4), \n681-697. \n 29 \n \nSmith, G. & Stodghill, R. (1994). Are good causes good marketing? Business Week, 21 \nMarch, 64. \n \nSpencer, J. (2001). CEO of Canada West Ski Areas. Personal Interview, 7 August. \n \nThirkell, K. (1999). View from the top. The Ottawa Citizen, October, 2, K1. \n \nTodd, S.E. & Williams, P.W. (1996). From white to green: a proposed environmental \nmanagement system for ski areas. Journal of Sustainable Tourism, 4(3), 147-173. \n \nUnited Nations (1993). Agenda 21: Programme of Action for Sustainable Development, \nNew York: United Nations Department of Public Information. \n \nvon Neudegg, M. (2002). CMH Chief Marketing Officer. Personal Interview, 13 \nFebruary. \n \nWartick, S.L. & Cochran, P.L. (1985). The evolution of the corporate social performance \nmodel. Academy of Management Review, 10(4), 758-769. \n \nWight, P. (1994). Environmentally responsible marketing of tourism. In E. Cater and G. \nLowman (Eds.) Ecotourism: A Sustainable Option?, 39-55. New York: John Wiley & \nSon. \n 30 \n \nWilkinson, A. (1999). Cause for concern. Marketing Week, 11 February, 28-31. \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n 31 \n \n \nFigure 1: A Model for Responsible Marketing \n \n \n \n \n \n \n \n \n \n \n \n \nHIGH \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n  \n \n \nINACTIVE  EXPLOITIVE \nNo support or involvement  Some involvement of top \nfrom top management  management \nEnvironmental management  Environmental issues dealt \nnot necessary  with only when necessary \nNo environmental reporting External reporting but no \nNo employee environmental  internal reporting \ntraining or involvement Little employee training or \ninvolvement  \n \nREACTIVE  PROACTIVE \nSome involvement of  Top management involved in \ntop management  environmental issues \nEnvironmental management  Environmental management is \nis a worthwhile function a priority item \nInternal reporting but no  Regular Internal and external             \nexternal reporting  reporting including an  \nSome employee environmental     environmental plan or report \ntraining or involvement Employee environmental \ntraining or involvement \nencouraged \nENVIRONMENTALLY \nRESPONSIBLE ACTION \n \nMeasured by analyzing: \nEnvironmental policy \nPolicy on wildlife \nPolicy on vegetation \nWaste management                  LOW \nFuel management \nEnergy & recycling \nForest harvesting \nEducation & training \nCommunity relations \nResearch & knowledge \nConnections to regulatory regimes \n \n \nHIGH \nAs \nMeasured by analysis of brochures, newsletters, websites, \ncompany reports, press releases, signs, and awards. \n           LOW   HIGH \n \nENVIRONMENTAL COMMUNICATION \n"}