{"doi":"10.1017\/S0020818306060231","coreId":"93300","oai":"oai:eprints.lse.ac.uk:3288","identifiers":["oai:eprints.lse.ac.uk:3288","10.1017\/S0020818306060231"],"title":"The unequal burden of war : the effect of armed conflict on the gender gap in life expectancy","authors":["Plümper, Thomas","Neumayer, Eric"],"enrichments":{"references":[{"id":17301798,"title":"Alcohol in Russia.","authors":[],"date":"1999","doi":"10.1093\/alcalc\/34.6.824","raw":"McKee, Martin. 1999. Alcohol in Russia. Alcohol atid Alcoholism 34 (6):824-29.","cites":null},{"id":17301818,"title":"An Analysis of Mortality Trends Among Refugee Populations","authors":[],"date":"1988","doi":null,"raw":"Toole, Michael J., and R. J. Waldman. 1988. An Analysis of Mortality Trends Among Refugee Populations in Somalia, Sudan, and Thailand. Bulletin ofthe WHO 66:237-47, United Nations (UN). 20(X). Women. Peace and Security. Study submitted by the Secretary-General pursuant lo Security Council Resolution 1325 (2000). New York: UN.","cites":null},{"id":17301783,"title":"Analy.sis of Panel Data. Cambridge;","authors":[],"date":"2003","doi":null,"raw":"Hsiao. Cheng. 2003. Analy.sis of Panel Data. Cambridge; Cambridge University Press.","cites":null},{"id":17301780,"title":"Arms and Public Health: A Global Perspective. In War and Public Health, edited by","authors":[],"date":"1997","doi":"10.1001\/jama.279.24.1931","raw":"Foege, William H. 1997. Arms and Public Health: A Global Perspective. In War and Public Health, edited by Berry S. Levy and Victor W. Side!, .3-11. New York: Oxford University Press. Garfield. Richard M., and Alfred 1. Neugut. t997. The Human Consequences of War. In War and Public Health, edited by Berry S. Levy and Victor W. Sidel, 27-38. New York: Oxford University Press. Ghobarab, HaTiem Adatn, Paul Huth, and Bruce Rus.sett. 2(X)3. Civil Wars Kill and Maim People— Long After the Shooting Stops. .Americtin Political Science Review 97 (2): 189-202. . 2(K)4. The Postwar Public Health Eftects of Civil Conflict. Social Science & Medicine 59 (2):869-84.","cites":null},{"id":17301792,"title":"Beyond Dichotomy: Conversations Between Intemational Relations and Feminist Theory.","authors":[],"date":"1998","doi":"10.1111\/0020-8833.00076","raw":"Keohane, Robert O. 1998. Beyond Dichotomy: Conversations Between Intemational Relations and Feminist Theory. Internutiotial Studies Quarterly 42 (I): 19.3-98.","cites":null},{"id":17301801,"title":"Bogus Refugees? The Determinants of Asylum Migration to Western Europe.","authors":[],"date":"2005","doi":"10.1111\/j.1468-2478.2005.00370.x","raw":"Neiimayer, Eric. 2005. Bogus Refugees? The Determinants of Asylum Migration to Western Europe. International Studies Quarterly 49 (4):389-409.","cites":null},{"id":17301821,"title":"Consolidated Inter-Agency Appeal for the Democratic Republic of the Congo","authors":[],"date":"2003","doi":null,"raw":". 2003. Consolidated Inter-Agency Appeal for the Democratic Republic of the Congo 2003, New York: UN, 16 January 2003.","cites":null},{"id":17301784,"title":"Deadly Connections: Tbe War\/Disease Nexus Workshop Report","authors":[],"date":"2004","doi":null,"raw":"Human Security Centre. 2004. Deadly Connections: Tbe War\/Disease Nexus Workshop Report March 22-23, Vancouver, Canada: Human Security Centre.","cites":null},{"id":17301803,"title":"Declining Sex Differences in Mortality from Lung Cancer in High-Income Nations.","authors":[],"date":"2003","doi":"10.1353\/dem.2003.0007","raw":"Pampel, Fred. 2003. Declining Sex Differences in Mortality from Lung Cancer in High-Income Nations. Demography 40 (0:45-65.","cites":null},{"id":17301806,"title":"Demography—Measuring and Modeling Population Processes.","authors":[],"date":"2001","doi":"10.2307\/1535065","raw":"Preston, Samuel H., Patrick Heuveline, and Michel Guillot. 2001. Demography—Measuring and Modeling Population Processes. Oxford, England: Blackweil.","cites":null},{"id":17301823,"title":"Development Programme (UNDP).","authors":[],"date":"2004","doi":"10.4324\/9780203806852","raw":"United Nations Development Programme (UNDP). 2004. Human Development Report. New York: Oxford Universiiy Press.","cites":null},{"id":17301816,"title":"Displaced Persons and War. In War and Public Health, edited by","authors":[],"date":"1997","doi":"10.1093\/acprof:oso\/9780195311181.003.0013","raw":"Toole, Michael J. 1997. Displaced Persons and War. In War and Public Health, edited by Berry S. Levy and Victor W. Sidel, 197-21 I. New York: Oxford University Press.","cites":null},{"id":17301804,"title":"Efficient Estimation of Rarely Changing Variables in Fixed Effects Models. Working Paper Series 622581. Social Science Research Network. Available at (www.ssm.com). Accessed","authors":[],"date":"2004","doi":"10.2139\/ssrn.622581","raw":"Plumper, Thomas, and Vera E. Troeger. 2004. Efficient Estimation of Rarely Changing Variables in Fixed Effects Models. Working Paper Series 622581. Social Science Research Network. Available at (www.ssm.com). Accessed March 15 2006.","cites":null},{"id":17301805,"title":"Efficient Estimation of Time-Invariant and Rarely Changing Variables in Finite Sample Panel Analyses with Unit Fixed Eftects. Paper presented at the American Political Science Association Conference, September,","authors":[],"date":"2005","doi":"10.1093\/pan\/mpm002","raw":". 2005. Efficient Estimation of Time-Invariant and Rarely Changing Variables in Finite Sample Panel Analyses with Unit Fixed Eftects. Paper presented at the American Political Science Association Conference, September, Washington, D.C. Plumper, Thomas, Vera E. Troeger, and Philip Maiiow. 2005. Panel Data Analysis in Comparative Politics, Linking Method to Theory. European Journal of Political Re.search 44 (2):327-54.","cites":null},{"id":17301810,"title":"Failed States in a Worid of Terror.","authors":[],"date":"2002","doi":"10.2307\/20033245","raw":"Rotberg, Robert I. 2002. Failed States in a Worid of Terror. Fore'tgn Affairs 81 (4): 127-40. , ed. 2(X)4. When States Fail: Causes and Consequences. Princeton, N.J.: Princeton University Press.","cites":null},{"id":17301828,"title":"Female Life Expectancy, Gender Stratification. Heallh Status, and I,^vcl of Economic Development: A Cross-national Study of Less Developed Countries.","authors":[],"date":"1997","doi":"10.1016\/s0277-9536(96)00346-2","raw":"Williamson. John B., and Ulrike Boehmer. 1997. Female Life Expectancy, Gender Stratification. Heallh Status, and I,^vcl of Economic Development: A Cross-national Study of Less Developed Countries. Social Science & Medicine 45 (2):3O5-I7.","cites":null},{"id":17301763,"title":"Feminist IR Theory and Quantitative Methodology: A Critical Analysis.","authors":[],"date":"2004","doi":"10.1111\/j.1521-9488.2004.00398.x","raw":". 2004. Feminist IR Theory and Quantitative Methodology: A Critical Analysis. Internationut Studies Review 6 (2):253-69.","cites":null},{"id":17301788,"title":"Gender and Ethnic Conflict in Ex Yugoslavia.","authors":[],"date":"1994","doi":"10.1080\/01419870.1994.9993815","raw":"Jones, Adam. 1994. Gender and Ethnic Conflict in Ex Yugoslavia. Fthriic and Racial Studies 17 (O:II5-.14.","cites":null},{"id":17301797,"title":"Gender Empowerment and ihe Willingness of States to Use Force. Working Paper. Severn, Md.: Center for Systemic Peace.","authors":[],"date":"1999","doi":null,"raw":"Marshall, Monty G., and Donna Ramsey, 1999. Gender Empowerment and ihe Willingness of States to Use Force. Working Paper. Severn, Md.: Center for Systemic Peace.","cites":null},{"id":17301762,"title":"Gender Equality and Stale Aggression: The Impaet of Dome.stic Gender Equality on State First Use of Force.","authors":[],"date":"2003","doi":"10.1080\/03050620304595","raw":"-. 2003. Gender Equality and Stale Aggression: The Impaet of Dome.stic Gender Equality on State First Use of Force. International hilermtiom 29 (3): 195-214.","cites":null},{"id":17301772,"title":"Gender Theory in World Politics: Contributions of a Nonfeminist Standpoint?","authors":[],"date":"2002","doi":"10.1111\/1521-9488.00269","raw":"Carpenter. R. Charli. 2002. Gender Theory in World Politics: Contributions of a Nonfeminist Standpoint? International Studies Review 4 (3): 153-65, . 2003. &quot;Women and Children First&quot;; Gender, Norms, and Humanitarian Evacuation in the Balkans 1991-95. hiternatiotial Organization 57 (4):66I-94, . 2004. Beyond &quot;Genderdice.&quot; In Geudercide and Genocide, edited by Adam Jones, 230-56. Nashville. Tenn.: Vanderbilt University Press.","cites":null},{"id":17301771,"title":"Gender, Violence, and intemational Crisis.","authors":[],"date":"2001","doi":null,"raw":"Caprioli. Mary, and Mark A. Boyer. 2001. Gender, Violence, and intemational Crisis. Journal of Confiict Resolution 45 (4):503-18.","cites":null},{"id":17301789,"title":"Gendercide and Genocide,","authors":[],"date":"2000","doi":"10.1080\/713677599","raw":". 2000. Gendercide and Genocide, Journal of Genocide Resean-h 2 (2): I H$-211, . 2(K)2. Gender and Genocide in Rwanda. Journal of Getiocide Research 4 (1 ):65-94.","cites":null},{"id":17301790,"title":"Gendercide atid Genocide.","authors":[],"date":"2004","doi":null,"raw":"ed. 2004. Gendercide atid Genocide. Nashville, Tenn.: Vanderbill University Press.","cites":null},{"id":17301824,"title":"Global Population Profile","authors":[],"date":"2004","doi":"10.2307\/2735308","raw":"U.S. Census Bureau. 2004. Global Population Profile 2002. Washington, D.C: Government Printing Office.","cites":null},{"id":17301785,"title":"Human Security Report 200S.","authors":[],"date":"2005","doi":null,"raw":". 2005. Human Security Report 200S. Vancouver, Canada: Human Security Centre.","cites":null},{"id":17301778,"title":"Hunger and Public Action.","authors":[],"date":"1990","doi":"10.1093\/0198283652.001.0001","raw":"Drfeze. Jean, and Amartya Sen. 1990. Hunger and Public Action. Oxford, England: Clarendon Press, Food and Agriculture Organization (FAO). 2005. A.ssesstnent ofthe World Food Security Situation. Rome: FAO.","cites":null},{"id":17301777,"title":"Intemaiional Peacebuilding: A Theoretical and Quantitative .Analysis.","authors":[],"date":"2000","doi":"10.2307\/2586208","raw":"Doyle. Michael W,, and Nicholas Sambanis. 2000. Intemaiional Peacebuilding: A Theoretical and Quantitative .Analysis. Attierican Political Science Review 94 14):779-XOI.","cites":null},{"id":17301802,"title":"Internally Displaced People: A Global Survey.","authors":[],"date":"2002","doi":"10.4324\/9781849774260","raw":"Norwegian Refugee Council, 2002. Internally Displaced People: A Global Survey. London: Earthscan.","cites":null},{"id":17301809,"title":"Invasion of Iraq: Cluster Sample Survey.","authors":[],"date":"2004","doi":"10.1016\/s0140-6736(04)17441-2","raw":"Roberts, Les, Riyad Lafta, Richard Garfield, Jamal Khudhairi, and Gilberi Brunham. 2004. Mortality Before and After the 200.1 Invasion of Iraq: Cluster Sample Survey. The Lancet 364 (2):l857-64.","cites":null},{"id":17301795,"title":"Monitoring Trends in Global Combat: A New Dataset of Batile Deaihs.","authors":[],"date":"2005","doi":"10.1007\/978-1-4020-5135-7_7","raw":"Lacina. Bethany, and Nils Petter Gleditsch. 2005. Monitoring Trends in Global Combat: A New Dataset of Batile Deaihs. European Journal of Population 21 (2\/3):145-66.","cites":null},{"id":17301781,"title":"No Lessons Learned from the Holocaust? Asse.ssing Risks of Genocide and Political Mass Murder Since","authors":[],"date":"1955","doi":"10.1017\/s0003055403000522","raw":"Harff. Barbara. 2(H)3. No Lessons Learned from the Holocaust? Asse.ssing Risks of Genocide and Political Mass Murder Since 1955. American Political Science Review 97 (l):57-73.","cites":null},{"id":17301786,"title":"of ibe Red Cross (ICRC).","authors":[],"date":"2001","doi":"10.1017\/s0020860400001121","raw":"International Committee of ibe Red Cross (ICRC). 2001. Women Facing War. Geneva: ICRC.","cites":null},{"id":17301774,"title":"On the Economic Consequences of Civil War.","authors":[],"date":"1999","doi":"10.1093\/oep\/51.1.168","raw":"Collier, Paul. 1999. On the Economic Consequences of Civil War. Oxford Economic Papers 51 (0:168-83.","cites":null},{"id":17301770,"title":"Primed tor Violence: The Role of Gender Inequality in Predicting Intemal Conflict.","authors":[],"date":"2005","doi":"10.1111\/j.0020-8833.2005.00340.x","raw":"-. 2005. Primed tor Violence: The Role of Gender Inequality in Predicting Intemal Conflict. Interneitional Studie.t Quaricfly 49 (2): 161-78.","cites":null},{"id":17301800,"title":"Quantifying the Burden of Disease: The Technical Basis for DisabilityAdjusted Life Years.","authors":[],"date":"1994","doi":null,"raw":"Murray, Christopher J. L. 1994. Quantifying the Burden of Disease: The Technical Basis for DisabilityAdjusted Life Years. Bulletin of the World Health Organization 72 (3):429-4.S. Murray. Christtipher J. L,, Gary King, Alan D. Li>pe\/, N. Tomijinia, and B. G. Krug. 2002. Armed Conflict as a Public Health Problem. British Medical Journal 324 (7333):346-49.","cites":null},{"id":17301819,"title":"Resolution Li25","authors":[],"date":"2000","doi":null,"raw":". 2(XJ2. Resolution Li25 (2000) Adopted by the Security Council al Its 4213th Meeting, on 31 October 2000. New York: UN.","cites":null},{"id":17301794,"title":"Sharing Sovereignty: New Institutions for Collapsed and Failing States.","authors":[],"date":"2004","doi":"10.1162\/0162288042879940","raw":"Krasner, Stephen D. 2004. Sharing Sovereignty: New Institutions for Collapsed and Failing States. International Security 29 {2):85-l20.","cites":null},{"id":17301808,"title":"Sierra Leone: Warfare in a Post-Stale Society. In State Failure and State Weakness in a Time of Terror,","authors":[],"date":"2003","doi":null,"raw":"Reno, William. 2003. Sierra Leone: Warfare in a Post-Stale Society. In State Failure and State Weakness in a Time of Terror, edited by Robert I. Rotberg, 71-100. Washington, D.C: Brookings Institution Press.","cites":null},{"id":17301782,"title":"Social and Environmental Factors and Life Expectancy, Infant Mortaiily. and Maternal Mortality Rates: Results of a Cross-National Comparison.","authors":[],"date":"1994","doi":"10.1016\/0277-9536(94)90170-8","raw":"Hertz. Erica. James R. Heberl, and Joan Landon. 1994. Social and Environmental Factors and Life Expectancy, Infant Mortaiily. and Maternal Mortality Rates: Results of a Cross-National Comparison. Social Science & Medicine 39 (l):105-44.","cites":null},{"id":17301791,"title":"Social Capital, Life Expectancy and Mortality: A Cross-National Examination.","authors":[],"date":"2003","doi":"10.1016\/s0277-9536(02)00241-1","raw":"Kcnnelly. Brendan, Eamon O'Shea, and Eoghan Garvey. 2003. Social Capital, Life Expectancy and Mortality: A Cross-National Examination. Social Science <& Medicine 56 (I2):2367-77.","cites":null},{"id":17301775,"title":"Sometimes You Ju.st Have to Leave: Domestic Threats and Forced Migration,","authors":[],"date":"2003","doi":"10.3886\/icpsr01288.v1","raw":"Davenport, Christian. Will H. Moore, and Sieven C. Poe. 2003. Sometimes You Ju.st Have to Leave: Domestic Threats and Forced Migration, 1964-1989. Intermttiotial ltueraction.\\ 29 (5):27-55.","cites":null},{"id":17301787,"title":"Testing for Unit Roots in Heterogeneous Panels.","authors":[],"date":"2003","doi":"10.1016\/s0304-4076(03)00092-7","raw":"Im. K.. H. Pesaran. and Y. Shin. 2003. Testing for Unit Roots in Heterogeneous Panels. Journal of Econometrics 115 (0:53-74.","cites":null},{"id":17301826,"title":"Testing the Double-Genocide The.sis for Central and Southern Rwanda.","authors":[],"date":"2003","doi":null,"raw":"Venvimp, Philip. 2003. Testing the Double-Genocide The.sis for Central and Southern Rwanda. Journal ofCcmfiict Resolution 47 (4):423-42.","cites":null},{"id":17301776,"title":"The Dynamics of Civil War Duration and Outcome.","authors":[],"date":"2004","doi":"10.1177\/0022343304043771","raw":"DcRcmen, Karl R., Jr., and David Sobek. 2004. The Dynamics of Civil War Duration and Outcome. Journal of Peace Re.fearch 41 <.1):27.S-30l.","cites":null},{"id":17301757,"title":"The Evolving Paltern of Avoidable Mortality in Russiu,","authors":[],"date":"2003","doi":null,"raw":"Andreev, Evgueni. Ellen Nolte, Vladimir Shkolnikov, Elena Varavikova, and Mariin McKee. 2003. The Evolving Paltern of Avoidable Mortality in Russiu, Intertiat'umul Journal of Epltiemiolog\\ 32 (3):437-46.","cites":null},{"id":17301799,"title":"The Gendered Continuum of Violence and Conflict. In Victims. Perpetrators or Actors? edited by Caroline","authors":[],"date":"2001","doi":null,"raw":"Moser, Caroline O. N. 2001. The Gendered Continuum of Violence and Conflict. In Victims. Perpetrators or Actors? edited by Caroline O. N. Moser and Fiona C. Clark, 30-51. London: Zed Books, Murdoch. James C, and Todd Sandier. 2002. Economic Growth, Civil Wars, and Spalial Spillovers. Journal of Conflict Resolution 46 (0:91-110.","cites":null},{"id":17301793,"title":"The Human Costs of Military Conflict.","authors":[],"date":"2001","doi":null,"raw":"King, Gary, and Lisa L. Martin. 2001. The Human Costs of Military Conflict. Overview Paper forArmed Conflict and the Gender Gap 753 Conference on Military Conflict as a Public Health Problem. September, Cambridge, Mass.: Harvard University.","cites":null},{"id":17301796,"title":"The Immediate and Lingering Effects of Armed Conflict on Adult Mortality, A Time-Series Cross-National Analysis,","authors":[],"date":"2005","doi":"10.1007\/978-1-4020-5135-7_8","raw":"Li, Quan, and Ming Wen. 2005, The Immediate and Lingering Effects of Armed Conflict on Adult Mortality, A Time-Series Cross-National Analysis, Journal of Peace Research 42 (4):47l-92.","cites":null},{"id":17301758,"title":"The Impact of War on Women. In War and Puhlk Health, edited by","authors":[],"date":"1997","doi":"10.1093\/acprof:oso\/9780195311181.003.0012","raw":"Ashford, Mary-Wynne, and Yolanda Huet-Vaughn. 1997. The Impact of War on Women. In War and Puhlk Health, edited by Berry S. Levy and Victor W. Sidel, 186-96. New York: Oxford University Press.","cites":null},{"id":17301811,"title":"War and Rape: A Preliminary Analysis. In Mass Rape: The War Against Women in Bosnia-Herzegovina, edited by Alexandra Stiglmayer","authors":[],"date":"1994","doi":"10.2307\/2076482","raw":"Seiferi, Ruth. 1994. War and Rape: A Preliminary Analysis. In Mass Rape: The War Against Women in Bosnia-Herzegovina, edited by Alexandra Stiglmayer and Marion Faber, 54-72. Lincoln: University of Nebraska Press.","cites":null},{"id":17301814,"title":"What Is Your Research Program? Some Feminist Answers lo Intemational Rciations Methtxiologica!","authors":[],"date":"2005","doi":null,"raw":"-. 2005. What Is Your Research Program? Some Feminist Answers lo Intemational Rciations Methtxiologica! Questions. International Studies Quarterly 49 111:1-21.","cites":null},{"id":17301779,"title":"Why Do Some Civil Wars Last so Much Longer Than Others?","authors":[],"date":"2004","doi":"10.1177\/0022343304043770","raw":"Fearon, James D. 2004. Why Do Some Civil Wars Last so Much Longer Than Others? Journal of Peace Research 41 (3):275-3OI.","cites":null},{"id":17301812,"title":"Women and Wars Within States: Internal Conflict, Women's Rights and International Security. Civil Wars 4","authors":[],"date":"2001","doi":"10.1080\/13698240108402477","raw":"Shoemaker, Jolynn. 2001. Women and Wars Within States: Internal Conflict, Women's Rights and International Security. Civil Wars 4 (3):i-34.754 International Organization Stiglmayer, Alexandra, and Marion Faber. 1994. Mass Rape: The War Against Women in BosniaHerzegovina. Lincoln: University of Nebraska Press. Strand, Havard. Lars Wilhelmsen, and Nils Petter Gleditsch. 2()04. Armed Conflict Dataset Ctxlebook Version 2.1. Oslo: Intemational Peace Research Institute Oslo and Uppsala Univereity. Available al (www.prio.no\/cscw\/armedconflict). Accessed 15 March 2(K)6.","cites":null},{"id":17301773,"title":"Women, Children and Other Vulnerable Groups&quot;: Gender, Strategic Frames and the Protection of Civilians as a Transnational Issue.","authors":[],"date":"2005","doi":"10.1111\/j.0020-8833.2005.00346.x","raw":"-. 2005. &quot;Women, Children and Other Vulnerable Groups&quot;: Gender, Strategic Frames and the Protection of Civilians as a Transnational Issue. International Studies Quarterly 49 (2):295-334.752 Intemational Organization Carver. Terrell. 2(X)4. Men and Masculinities in Gentiercide\/Genocide. In Gendercide and Genocide, edited by Adam Jones. 272-94. Nashville, Tenn.: Vanderbilt University Press.","cites":null},{"id":17301807,"title":"Women's Access to Politics and Peaceful States.","authors":[],"date":"2003","doi":"10.1177\/0022343303040003003","raw":"Regan, Patrick M., and Aida Paskeviciute. 2003. Women's Access to Politics and Peaceful States. Journal of Peace Research 40 (31:287-302.","cites":null},{"id":17301829,"title":"World Development Indicators on CD-Rom.","authors":[],"date":"2004","doi":"10.1596\/0-8213-5729-8","raw":"World Bank. 2004. World Development Indicators on CD-Rom. Washington, D.C: World Bank.","cites":null},{"id":17301761,"title":"Wtir Crimes Against Women—Prosecution in War Crimex Tribunals. The Hague. Nether!iind,s:","authors":[],"date":"1997","doi":null,"raw":"A,skin, Kelly Dawn. 1997. Wtir Crimes Against Women—Prosecution in War Crimex Tribunals. The Hague. Nether!iind,s: Martirius NijholT. Beck, Nathaniel, and Jonuihan Kai7. 20()l. Throwing Out the Baby with the Bath Water: A Comment on Green, Kim, and Yoon. Interiuitiotml Organization 55 (2):487-95.","cites":null},{"id":17301813,"title":"You Just Don't Understand: Troubled Engagements Between Feminists and IR Theorists.","authors":[],"date":"1997","doi":"10.1111\/1468-2478.00060","raw":"Tickncr, J. Ann. 1997. You Just Don't Understand: Troubled Engagements Between Feminists and IR Theorists. International Studies Quarterly 41 (4):611-32, . 2001. Gendering World Politics: Issues and Approaches in the Post-Cold War Era. New York: Columbia University Press.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-07","abstract":"Most combatants in armed conflict are men, so naturally men are the major direct victims of military operations. Yet, armed conflicts have important indirect negative consequences on agriculture, infrastructure, public health provision and social order. These indirect consequences are often overlooked and under-appreciated. They will also affect women and arguably more so than men. This article provides the first rigorous analysis of the impact of armed conflict on female relative to male life expectancy. We find that over the entire conflict period interstate and civil wars on average affect women more adversely than men. In peace times, women typically live longer than men. Hence, armed conflict tends to decrease the gap between female and male life expectancy. For civil wars, we find that it is ethnic wars that are damaging to women and particularly so if they take place in ‘failed’ states. Our findings challenge policy makers as well as international and humanitarian organizations to develop policies that tackle the large indirect and long-term negative health impacts of armed conflicts","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/93300.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/3288\/1\/Unequal_burden_of_war_%28publisher_version%29.pdf","pdfHashValue":"55fd7676b2db27be91415aed2931c8df89cd7626","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:3288<\/identifier><datestamp>\n      2010-12-14T09:43:12Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D4759<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/3288\/<\/dc:relation><dc:title>\n        The unequal burden of war : the effect of armed conflict on the gender gap in life expectancy<\/dc:title><dc:creator>\n        Plümper, Thomas<\/dc:creator><dc:creator>\n        Neumayer, Eric<\/dc:creator><dc:subject>\n        HQ The family. Marriage. Woman<\/dc:subject><dc:subject>\n        GF Human ecology. Anthropogeography<\/dc:subject><dc:description>\n        Most combatants in armed conflict are men, so naturally men are the major direct victims of military operations. Yet, armed conflicts have important indirect negative consequences on agriculture, infrastructure, public health provision and social order. These indirect consequences are often overlooked and under-appreciated. They will also affect women and arguably more so than men. This article provides the first rigorous analysis of the impact of armed conflict on female relative to male life expectancy. We find that over the entire conflict period interstate and civil wars on average affect women more adversely than men. In peace times, women typically live longer than men. Hence, armed conflict tends to decrease the gap between female and male life expectancy. For civil wars, we find that it is ethnic wars that are damaging to women and particularly so if they take place in ‘failed’ states. Our findings challenge policy makers as well as international and humanitarian organizations to develop policies that tackle the large indirect and long-term negative health impacts of armed conflicts.<\/dc:description><dc:date>\n        2006-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/3288\/1\/Unequal_burden_of_war_%28publisher_version%29.pdf<\/dc:identifier><dc:identifier>\n          Plümper, Thomas and Neumayer, Eric  (2006) The unequal burden of war : the effect of armed conflict on the gender gap in life expectancy.  International Organization, 60 (3).  pp. 723-754.  ISSN 0020-8183     <\/dc:identifier><dc:relation>\n        http:\/\/journals.cambridge.org\/action\/displayJournal?jid=INO<\/dc:relation><dc:relation>\n        10.1017\/S0020818306060231<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/3288\/","http:\/\/journals.cambridge.org\/action\/displayJournal?jid=INO","10.1017\/S0020818306060231"],"year":2006,"topics":["HQ The family. Marriage. Woman","GF Human ecology. Anthropogeography"],"subject":["Article","PeerReviewed"],"fullText":"The Unequal Burden of War: The\nEffect of Armed Conflict on the\nGender Gap in Life Expectancy\nThomas Plumper and Eric Neumayer\nAbstract Most combatants in armed conflict are men, so naturally men are the\nmajor direct victims of military operations. Yet armed conflicts have important indi-\nrect negative consequences on agriculture, infrastructure, public health provision, and\nsocial order. These indirect consequences are often overlooked and underappreci-\nated. They also affect women—arguably more so than men. This article provides the\nfirst rigorous analysis of the impact of armed conflict on female life expectancy rel-\native to male. We lind that over the entire conflict period, interstate and civil wars oti\naverage affect women more adversely than men. In peacetime, wometi typically live\nlonger than men. Hence, armed conflict tends to decrease the gap between female\nand male life expectancy. For civil wars, we also find that ethnic wars and wars in\n\"failed\" states are much more damaging to women than other civil wars. Our find-\nings challenge policymakers as well as intemational and humanitarian organizations\nto develop policies that tackle the large indirect and long-term negative health impacts\nof armed conflicts.\nThere can be no doubt that armed conflict directly kills, injures, and harms more\nmen than women in that combatants are predominantly male.' Yet, armed conflict\nhas many negative indirect consequences on health and survival. Indeed, there are\ngood reasons to presume that the indirect consequences of conflict are much more\nimportant in many cases than the direct casualties. Lacina and Gleditsch concur\nthat direct conflict fatalities do \"not provide a remotely adequate account of the\ntrue human costs of conflict.\"^ Most victims of war die in silence. We will argue\nEqual authorship. We are grateful for helpful suggestions by Andrew Mack, Havard Hegre,\nDavid Hugh-Jones, Lisa Martin, and the anonymous referees. Eric Neumayer acknowledges financial\nas.sistance from the Leverhulme Trust and Thomas Pliimper financial assistance by the European\nCommission-DG Research Sixth Framework Program (CIT-2-CT-2{XM-506084). Data and do-files to\ngeneraie the results are available on request.\n1. The World Health Organization (WHO) estimates the share of females among direct war fatali-\nties to fall between as low as 9.9 percent in 2(K)4 and up to 42 perceni in 199S (WHO various years).\nThe WHO mortality figures have been heavily criticized as being unreasonably inflated (Human Secu-\nrity Cenire 2005). It is unclear, however, whether this criticism affects ihe share of female mortality. In\nany case, a higher shLire of men among direct war mortality is plausible.\n2. Lacina and Gleditsch 2005, 7.\nIntemational Organization 60, Summer 2006, pp. 723-754\n© 2006 by The 10 FoundaUon. DOI: 10.1O17\/SO02O818306O6O23I\n724 Intemational Organization\nin this article that women are likely to suffer most from the indirect consequences.\nOur estimation results show that on average women are overall more negatively\naffected by armed conflict than men, suggesting that the indirect consequences are\nstronger than the direct effects.\nThe indirect effects of militarized conflicts' result from, among others, reduced\naccess to food, hygiene, health services, and clean water—and by lifting the thin\nveil of civilization. Women suffer more severely from the damage to the health\nand other infrastructure and the wider economic damage as well as from displace-\nment and dislocation during and after conflict. The breakdown of social order and\nthe ensuing brutalization fuels male aggression against women, who suffer from\nsexual violence both within and outside their domestic household. Until recently,\nno particular attention was paid to the gender-specific aspects of the negative\nimpacts of violent conflict. Recent reports by the United Nations (UN) General\nSecretary to the Security Council, the UN Development Fund for Women, and (lie\nIntemational Committee of the Red Cross have tried to spotlight the issue,'* Ours\nis the tirst serious attempt at testing rigorously and directly whether armed con-\nflict does indeed affect women's survival chances more severely than that of men.\nSpecifically, this article analyzes the impact of militarized conflict on the so-called\ngender gap in life expectancy, which we define as the ratio of female to male life\nexpectancy at hirth (in most countries women live longer than men in peacetime\nsuch that the ratio is above unity).^ We study whether armed confiict—intemational\nand civil war—decreases this ratio. In brief, we find that on average and given the\nsample that we analyze, armed conflict decreases the ratio of female to male life\nexpectancy at birth. Consequently, armed conflict appears to narrow rather than\nwiden the gender gap in life expectancy. Yet we also find that civil wars differ in\nrespect to their impact on the gender gap in life expectancy. Specifically, noneth-\nnic civil wars have no effect on the gender gap, whereas in ethnic civil wars women\nseem to he the prime victims and particularly so if the ethnic conflict lakes place\nin a \"failed\" state. '\nDespite a rise in quantitative gender-analytical studies in recent years, no one\nhas yet rigorously analyzed the uneven effect that armed conflict has on men and\nwomen. Instead, existing scholarship has focused on whether gender inequality\naffects the likelihood of using violence in intra- and interstate conflict.^ Similarly,\ndespite the fact that armed political conflict has some obvious consequences on\npublic health, mortality, and life expectancy, surprisingly few conflict studies have\n.3. We u.se Ihe terms \"'anned conllict,\" \"militarized conflict.\" and \"war\" interchangeably.\n4. See UN 2002; UNDFW 2()t)2; and ICRC 2(K)1.\n5. The gender gap in life expectancy is usually measured as the absolute difference between female\nand male life expectancy, rather than the raliu between the Iwo. For reasons explained below. Ihis\nabsolute tlitference can be a misleading indicator. We stress, however, that our result.s uphold even if\nwe defined the gender gap as the absolute difference.\n6. See Marshall and Ram.sey 1999; Caprioli 2()00, 2003, and 2005; Caprioli and Boyer 2001; and\nRegan and Paskeviciute 2003,\nArmed Conflict and the Gender Gap 725\ntried to estimate these effects systematically and rigorously. Indeed, we know of\nonly four relevant studies.^ These analyses report a significant negative impact of\ninternational and civil wars on life expectancy or disability-adjusted life years.\nNone of these studies directly analyzes the gender gap in life expectancy, however.\nThe remainder of this article is organized as follows. The first section explains\nhow our study relates to two strands of literature in international relations, namely,\ngender studies and studies on the health consequences of conflict. The second sec-\ntion provides an explanation of why militarized conflicts should have an influence\non the gender gap in life expectancy. The third section discusses the research design\nof our quantitative study. The fourth section presents the results; and the final sec-\ntion concludes.\nLink to Existing Literature\nOur study relates to two important strands of literature in international relations\n(IR). First, our analysis is located in an emergent strand within IR that employs\ngender as an analytical category. This means that we try to explain the differential\nitnpacts of armed confiict on men and women not merely by recourse to biologi-\ncal differences, hut also by tracing the different vulnerabilities that derive from\nthe social roles men and women assume, voluntarily or involuntarily. As Moser\nhas argued, a gender analysis assists in understanding why men and women as\nsocial actors and with differential access to resources are differentially affected hy\nviolence.^ Taking gender seriously also means that despite focusing on the harm\nthat anned conflicts impose on women, we must not ignore the violence and harm\nsuffered by men as either combatants or civilians. In certain contexts, noncombatant\nmen can be singled out for massacres, as happened in Rwanda and Yugoslavia, at\nthe same time as large-scale sexual and other abuse and violence is inflicted on\nwomen.** Our analysis will show that women on average suffer more from the\nindirect and long-term consequences of armed conflict, which calls for much greater\nattention being paid to these effects. It does not, however, justify the neglect of\ncivilian men in humanitarian crisis evacuations, which can go contrary to the very\naim of evacuating those most vulnerable, as Carpenter has forcefully argued in the\ncontext of evacuations in the Yugoslav conflicts.'\" Such ill-informed policy deci-\nsions are probably attributable to the preponderance of gender stereotypes that see\nmen only and exclusively as perpetrators and women only and exclusively as vic-\ntims of violence.\" Carpenter shows that such stereotypes are often strategically\n7. See Davis and Kuritsky 2002; Ghobarah, Huth, and Russett 2003 and 2004; and Li and Wen\n2005.\n8. Moser 2001.\n9. See Jones 1994, 2000, 2002. and 2004; and Carpenter 2003.\n10. Carpenter 2003.\n11. Carver 2004.\n726 Intemational Organization\nemployed by humanitarian organizations to raise and mobilize support for their\noperations.'-\nTaking gender seriously as an analytical concept does not imply that we sub-\nscribe to the feminist IR agenda of active engagement in a political struggle for\nthe empowerment of women.'-' Carpenter has lamented that mainstream IR schol-\nars have heen largely silent on gender, thus depriving knowledge on gender of non-\nfeminist insights.'•' As mainstream IR scholars, we aspire lo correct this potential\nbias to some extent hy directly focusing on gender for an important aspect of IR,\nnamely, the consequences of the use of armed violence. Our main question can be\nanswered by employing traditional IR methods of formulating and testing hypoth-\neses using procedures that are publicly known and replicahle.'^ Our analysis thus\ncomplements quantitative gender-analytical IR studies undertaken hy scholars, some\nof which would regard themselves as feminists, whereas others would not.\"' The\nmain difference to these studies is that we quantitatively estimate the gender-specific\neffects of armed political conflict, whereas existing studies address the impact of\ngender inequality on the use of violence in interstate and intrastate conflict.'\"'\nSecond, our analysis directly relates to studies that have addressed Ihe broader\nand long-term public health consequences of armed conflict. Our t>riginal contri-\nbution is that we look at these consequences with a gender-analytical perspective.\nThree recent articles have demonstrated the seemingly obvious: intemational and\ncivil wars reduce the quality of life of broad parts of the population and reduce\nthe mean life expectancy of the country that is engaged in militarized conflicts.\nFor example, Ghobarah. Huth, and Russett study cross-national variation in 1999\ndata on disability-adjusted life years (DALYs).\"* DALY is a new measure that has\nbeen estitnated by the World Health Organization (WHO) starting in the late 1990s.\nDALYs are calculated for individual major disease categories and reflect the years\nof life lost due to death in the fatal cases as well as the expected disability caused\nby a disease in nonfatal cases. They are the most important input for estimating\nhealth adjusted life expectancy (HALE), which adjusts nominal life expectancy\nfor expected yciu-s with disability. Specifically, Ghobarah, Huth. and Rus.sett regress\nDALYs in 1999 on estimated fatality figures from civil wars in the period 1991 to\n1997 as well as a range of control variables. The results are interpreted as the\nlong-term effects of civil wars. They estimate that around 12 million DALYs were\nlost in 1999 due to civil wars in the same countries plus perhaps another 3 million\nDALYs in neighboring countries, which is close to twice WHO's estimate of direct\n12. Carpenter 2(H)5.\n13. As outlined, for example, by Tickner 1997, 2001, and 2005.\n14. Carpenter 2(M)2, 133.\n15. Keohiine 1998, 196.\n16. See Caprioli 2004 for an overview.\n17. See Marshall and Ramsey 1999; Caprioli 2000. 2003, and 2005; Caprioli and Boyer 2001; and\nRegan and Paskeviciute 2003.\n18. Ghobarah, Huth. and Russett 2003 and 2004.\nArmed Conflict and the Gender Gap 727\nand immediate loss of DALYs from all armed conflicts in 1999.''' Looking at indi-\nvidual disease categories broken down by gender and age group, Ghoharah, Huth,\nand Russett find that infectious diseases and transport accidents are the categories\nfor which there is most consistent evidence for an effect of civil war. They also\nfind that past fatality figures had a statistically significant effect on more disease\ncategories for women than for men and for more categories for children than chunce\nwould predict. This is interpreted as evidence that women and children arc affected\nmost by the long-term con.sequences of conflict, which is problematic, however,\nwithout detailed information on the number of fatalities in each disease category,\nbroken down by age and sex. Only an aggregate measure of mortality such as the\ngender-specific life expectancy we use is capable of telling us whether in total\nmore women were killed than men or were killed at an earlier age than men by\ntbe combined direct and indirect effects of war.\nDavis and Kuritsky use panel data to estimate the effect of armed conflict on\nlife expectancy and other health indicators in sub-Saharan Africa over the period\n1980 to 1997.-^ \" They estimate that life expectancy in countries, which experi-\nenced a conflict with at least 1,000 deaths, on average declined by about one year.\nThis increases to an estimated 2.35 years for severe conflicts, defined as conflicts\nin the course of which at least 1 percent\nA recent study by Li and Wen analyzes the effects of an armed conflict dummy\nas well as of past conflict duration on adult mortality (people aged fifteen to sixty-\nfour).-' While their main focus is on quantifying the effects of wars on mortality\nrather than on the gender differences in mortality, they find that men typically\nsuffer higher immediate conflict mortality, whereas men and women are affected\nto about the same extent by the long-term effect (as proxied by past conflict dura-\ntion). One might think that, in combination, this would imply that men are more\nadversely affected by armed conflict than women, thus contradicting the main result\nof our study. However, for at least two reasons Li and Wen's results do not allow\nsuch a conclusion (and we stress that they themselves do not draw such a conclu-\nsion). First, the estimated coefficients for botb conflict dummies and past conflict\nduration on male mortality are not statistically significantly different from the\nestimated coefficients on female mortality. Second, and more importantly, by focus-\ning on adult mortality, they leave out children and the elderly; thus no conclusions\non the differential gender effect of armed conflict on the entire population can be\ndrawn.\nSeveral more papers have studied variation in life expectancy, mostly in a cross-\nnational setting, but without addressing the impact of armed conflict.-- These stud-\nies inform our choice of control variables (see the section on research design below).\n19. Murray 1994 discusses the technicat basis of DALYs.\n20. Davis and Kuritsky 2002.\n21. Li and Wen 2005.\n22. See Hertz. Heberl, and Landon 1994; Williamson and Boehmer 1997; Kennelly, O'Shea, and\nGarvey 2003; and Bossuyt et al. 2004.\n728 Intemational Organization\nIn particular, they point toward the importance of controlling for per capita income,\nbasic education, and the participation of women in economic life. However, little\nsocial science research has specifically addressed female life expectancy, let alone\nthe gender gap in life expectancy.^'\nConflict and the Gender Gap in Life Expectancy\nWars kill, before, during, and after military operations take place. Before the actual\nconflict starts, military expenditures often rise and drag scarce resources away from\nhealth services and medical care. During conflict, the most obvious victims are\nthe casualties directly attributable to conflict. Both soldiers and civilians suffer\nmorbidity and mortality inflicted by wounds. The direct effects of combat and\nmilitary operations are likely to affect men more. Because most soldiers in most\narmies are male, men should be more severely affected hy the direct causes of war\nthan women. The more civilians are directly killed by military operations, the more\nwomen will be directly killed as well.-\"* But there is no reason to presume that\nmore women than men are killed in combat. Yet the major losses of life and other\nnegative public health effects can be the indirect consequences of armed conflict.\nIndirect effects of wars on life expectancy result from various sources. Armed con-\nflict both generates conditions for increased morbidity and mortality and weakens\nthe capacity for dealing with the increase in adverse health conditions.-^\nThe many indirect negative consequences on health and mortality are likely to\naffect men and women differently, partly because of biological rea.sons, but mainly\nbecause of variation in the socioeconomic status of men and women. In the fol-\nlowing subsections, we identify three indirect effects that account for the fact that\nmilitarized conflicts unevenly affect men and women. We refer to these effects as\nthe economic damage e_ffeci, the displacement ejfecl, and the sexual violence effect.\nClearly, these effects are nol independent but may ea.sily reinforce one another,\nthereby rendering the situation more dramatic for the people involved. Keeping\nthese interaction effects in mind, it is for explanatory purposes that we discuss the\nthree effects separately and in turn. After this discussion, the theoretical section\nconcludes with a discussion of why the identified effects can be expected to be\nparticularly strong when armed conflict has ethnic roots or takes place in a coun-\ntry in which the central political order has collapsed.\n23. Williamson and Boehmer 1997.\n24. It is difficult lo estimate reliably ihe .share of civilian victims of armed conflici. The often quoted\nstatistic [hat this share increased from 14 perceni during Worid War ! to 67 perceni in World War II,\nreaching 75 percent and 90 percent during the armed conflicts of the 1980s and 199O.s (which were\npredotninanily civil wars), respectively, is based on shaky empirical evidence, as Murray et al. 2002,\n346f, have poinied out.\n25. Foege 1997.\nArmed Confiict and the Gender Gap 729\nThe Economic Damage Effect\nArmed confiicts affect all aspects of life, including the economy. They often lead\nto the destruction of agricultural systems causing food shortages. Food shortage\nleads to rising food prices, which in crucial cases may cause famines. As observed\nby Dreze and Sen, famine is a problem of food distribution and poverty rather\nthan a problem resulting from an absolute lack of food.-^ In addition to damage to\nagriculture and systems of food distribution, armed confiict damages the basic infra-\nstructure such that access to electricity, safe water, and sanitation is impeded. In\nmany conflicts, the warring parties actively and explicitly target the infrastructure,\nwith the consequence that drinking water, sewage and sanitation facilities, power\nplants, communication lines, and the basic health infrastructure are severely dam-\naged and cease to function reliably. This strategy is supposed to lead to chaos and\nsocial disorder, destabilizing the opposite party. It is not entirely new, as age-old\nmilitary strategies have included blockading food, burning crops, and introducing\ninfectious diseases to cities under siege.^^ However, King and Martin argue that\nadvances in military strategy and technology have led to \"increasingly severe pub-\nlic health consequences of war,\"^^ while Garfield and Neugut state that \"modem\nweaponry and tactics extend the battlefield to the entire society, including\ncivilians.\" '^^\nParticularly problematic to the civilian population is damage to the medical and\nhealth care infrastructure. Hospitals and pharmacies are destroyed; doctors and\nnurses have fled the country or have been killed. Economic collapse and a short-\nage of public funds lead to severe underfunding and underprovision of both pri-\nvate and puhlic health services. Even emergency medical problems fail to be\nattended to on time, while fundamental prevention policies with long-term benefi-\ncial health effects such as immunization and monitoring programs are simply ter-\nminated. For example, a WHO report on the medical situation in Bosnia between\n1992 and 2000 concludes: \"Pharmaceutical supply during the war and postwar\nperiod was mostly channeled through humanitarian aid programs, covering up\nto 70% of supplies—according to some estimates. In a large number of cases,\nthis heavily influenced the choice of therapy, which often depended on the kind\nand quantity of drugs available.\"^'' With other countries less easy to reach and\nwith some militarized conflicts being less present in the media, one should expect\nthese problems to mount. However, not only does the provision of health services\ndecline in conflicts, often medical equipment is destroyed. In the same study, the\nWHO estimates that about 40 percent of medical equipment was out of use during\nand after the civil war in Bosnia. As a consequence, prices of medicines and\n26. Dr&ze and Sen 1990.\n27. Ashford and Huei-Vaughn 1997.\n28. King and Martin 2001, 2.\n29. Garfield and Neugut 1997, 35. See also Roberts et al. 2004.\n30. WHO 2004, 1.\n730 Intemational Organization\nhealth services increase so rapidly that the poorer parts of the population can no\nlonger afford medication and are often doomed to die even from otherwise trivial\ndiseases.\nWith agricultural systems as well as infrastructure damaged, it is no wonder\nthat armed confiicts have a significant effect on average income levels and the\neconomic growth rate. Estimates of the effect of intemational and civil war on per\ncapita income and the growth rate typically find a significant and robu.st negative\ninfluence.^' Collier estimates that per capita income declines at an average annual\nrate of 2.2 percent relative to its counterfactual during civil wars.'^ This is the\naverage effect of civil war on per capita income. In some cases, and with civil\nwars sometimes lasting decades rather than years, ihe economic damage can he\nfar more severe. For instance, the per capita income in Nicaragua at the onset of\nthe civil war was $4,276. At the end of the civil war, per capita income had declined\nto $1,913, which represents an annual decline in per capita income of about 6.5\npercent—compared to the average growth rate of 2.5 percent after the civil war,\nthe relative loss in wealth was almost 10 percent per year. During the Nicaraguan\ncivil war, the ratio of women's to men's life expectancy increased between 1978\nand 1979 (indicating that most combatant victims were male) but declined in the\nlater years—probably indicating thai the indirect losses of the civil war outnum-\nbered the direct losses and that most indirect victims were female.\nIn addition to loss in average incomes, wars influence the absolute and relative\nprice levels. The majority of the population, for which income does not keep up\nwith inflation, has increasing difficulties in meeting their basic needs. Price increases\nare most severe for goods for which demand reacts least elastically on price\nincrea.ses—in other words: goods that are most desperately needed: clean water,\nfood, electric power, and medication.\nWhy is the economic damage caused by armed confiict likely to affect women\nmore than men? Women are likely to suffer more from an increase in food prices\nand famines than men. For physiological reasons, women are particularly suscep-\ntible to vitamin and iron deficiencies in diets. In addition, in male-dominated soci-\neties, males get priority in food distribution at the expense of girls and women.\nThe decline in basic health care hits women more because of their specific repro-\nductive roles. Damage caused to the health infrastructure reduces obstetrical care\nand increases the number of miscarriages as well as maternal and infant mortality.^-'\nFor example, a recent study hy the Intemational Red Cross indicated an extraor-\ndinarily high maternal mortality rate of 3 percent in the rebel-con trolled areas of\ncivil war-ridden Congo. The high levels of maternal mortality are associated with\nearly sexuality and motherhood (the teenagers of less than twenty years contribute\n20 percent to the total fertility), too many pregnancies and births (the total is esti-\nil. See Collier t999; Murdoch and Sandier 2002; and Gyimah-Brempong and Coriey 2005.\n32. Collier 1999.\n33. Ashford and Huet-Vaughn 1997. ^\nArmed Conflict and the Gender Gap 731\nmated at seven children per woman), unspaced pregnancies (the average period\nbetween two births is less than two years), motherhood at a late age, and induced\nclandestine abortions associated with unwanted pregnancies that affect 30 percent\nof the teenagers.'^ This poor health care situation in civil war-torn regions already\naccounts for a severe drop in the life expectancy of women in the Congo.\nMore generally, a significant decline in purchasing power will affect women\ndifferently than men because in many cultures men receive preferential access to\nresources. When resources become scarcer, then the part of the population suffer-\ning from discrimination is necessarily hit even harder. Many of the negative effects\nof armed conflict on women are thus not due to biological reasons, but are due to\nwhat Carpenter calls \"preexisting gendered social structures.\"-^^ For example, the\nextra burden of securing water, food, and wood for heating purposes, which comes\non top of caring and nurturing their family, often falls on women and exposes\nthem to many dangers. Thus in societies where female discrimination is wide-\nspread even during peacetime, women will suffer particularly strongly from the\ndestructive power of violent conflict.'''\nThe Displacement Effect\nArmed conflict often dislocates people from their usual homes, crowding them\ninto remaining shelters. Worse still, often they have to leave their home cities or\nvillages and have to seek refuge in makeshift refugee tent camps—either in for-\neign countries across the border or as internally displaced persons (IDPs). As a\nconsequence, infectious diseases such as diarrhea, measles, acute respiratory dis-\neases, and malaria, but also sexually transmitted diseases including HIV\/AIDS,\nspread more easily, often turning into epidemics. Weakened and fragile individu-\nals die more easily from diseases they might have survived in better physical and\nmental conditions.\nHealth conditions are particularly poor in refugee camps. Toole reports mortal-\nity rates from refugee camps that are up to 100 times higher than the normal mor-\ntality rate in the affected country.\" IDP refugee camps can be particularly severely\nhit if they are geographically close to zones of ongoing conflict as people are either\ndirectly affected by the fighting or the ongoing conflict delays and impedes assis-\ntance. Data disaggregated according to gender is rare, but Tooie reports data from\na Burmese refugee camp in Bangladesh where female infants were twice as likely\nto die than male infants and the mortality rates of females above the age of five\nwas 3.5 times higher than that of males.^ ** While we do not argue that women\n34. UN 2003. 41.\n35. Carpenter 2004. 243.\n36. See ICRC 2001: and UN 2002.\n37. Toole 1997.\n38. Wotnen are not only more likely to die from the dire conditions in refugee camps, they also\npossibly account for the largest average share of camp population.\n732 Intemational Organization\nwould have been better off if they had not fled into refugee camps, there can nev-\nertheless be little doubt that the mortality differences in these camps can be sig-\nnificant. This situation can become exacerbated if culturally binding norms allow\ncertain fonns of female hygienic care only under conditions of privacy and sepa-\nration from men, which are often impossible to maintain in refugee camps.\nThough there is little reason to formulate a deterministic negative influence of\ndisplacement in militarized conflicts on the gender gap in life expect<mcy, we believe\nthat the probabilistic argument is fairly strong. With an increased number of dis-\nplaced persons, the gender gap in life expectancy is likely to decline, because of\nthe health conditions in refugee camps and the possible overrepresentation of\nwomen in these camps.\n-t\nThe Sexual Violence Effect . : . • • •\nA third effect is due to the targeted infliction of violence on women as part of a\n\"gender ideology.\"-^^ Girls and women become the victims of sex trafficking and\nare forced to serve in military brothels or endure other forms of sexual slavery.\nThough all figures must be treated with caution, estimates amount to organized\nand systematic rape of at least 20,000 women and girls by the Serbian military\nand the murder of many of the victims during the civil war in Bosnia.\"\"' At the\nsame time, there is evidence that young Bosnian and, later on. Kosovo Albanian\nmales fit for battle were specifically targeted for killing by Serbian militia to extin-\nguish armed resistance.\"\" Still, women have been targeted and victimized to such\nan extent during the Balkan conflicts that so-called gender crimes form part of the\ncrimes against humanity prosecuted by the Intemational Criminal Tribunal for the\nFormer Yugoslavia (ICTY).'*'^  Similarly, Article 7 of the newly established Rome\nStatute of the International Criminal Court (ICC) includes \"rape, sexual slavery,\nenforced prostitution, forced pregnancy, enforced sterilization, or any other form\nof sexual violence of comparable gravity\" among crimes against humanity open\nto prosecution.\nReports on systematic rapes and murders of women in relation to war are by no\nmeans limited to Bosnia. In other conflicts, particularly in sub-Saharan Africa,\nrape was used with the intention of spreading HIV\/AIDS and other sexually trans-\nmitted diseases. Injuries to vagina! tissue is a common consequence of rape and\nrenders affected women much more susceptible to sexually transmitted diseases.\nIn principle, women should enjoy special protection in armed conflict. The Geneva\nConvention relative to the Protection of Civilian Persons in Time of War from\n1950 requires that civilians \"shall he at all times humanely treated, and shall be\n39. Carpenter 2004, 237.\n40. Stiglmayer and Faber 1994.\n41. See Carpenter 2002; and Jones 2004.\n42. See Askin 1997; and UN 2002.\nArmed Conflict and the Gender Gap 733\nprotected especially against acts of violence,\" while women \"shall be especially\nprotected against any attack on their honor, in particular against rape, enforced\nprostitution, or any form of indecent assault\" (Article 27). However, many war-\nring parties simply do not obey their obligations under the Geneva Convention\nand other humanitarian law, which has prompted the UN's Security Council to\ncall on \"all parties to armed conflict to take special measures to protect women\nand girls from gender-based violence, particularly rape and other forms of sexual\nabuse, and all other forms of violence in situations of armed conflict.\"*^\nThe Role of Ethnicity and Collapse of Political Order\nThe economic damage effect, displacement effect, and the sexual violence effect\ncan be expected to be particularly strong where armed conflict takes place in a\ncountry where the political order has collapsed or where conflict has ethnic roots.\nA collapse of political order almost by definition means that the central govern-\nment is no longer capable of providing even the most hasic infrastructure and other\npublic goods, not least because it no longer commands over an effective tax sys-\ntem.\"*^  Without being able to raise sufficient revenues, the government cannot com-\nbat imminent social catastrophes, even if it is willing to do so. Often, civil wars\nare the reason for a country to develop into a failed state, but it is as important to\nnote that civil wars also tend to be more dirty and intense in failed states. Col-\nlapse, disintegration, and armed conflict have occurred in the former Soviet Union,\nthe Balkans, the Caucasus, and Central Africa. In all instances, dozens of political\nentities emerged, in which self-appointed political leaders struggle among each\nother and with entities of overlapping claims. As a consequence, failed states can\nno longer perform basic functions such as education, security, or governance. In\nthese countries, civil wars do not take place between insurgents and government\ntroops, but between different paramilitary groups competing for political control\nof the country or particular regions. Such a civil war between various warlords,\nwhose prime interest is mostly in arms and drug trafficking for short-term profit\nmaximization, often tums out to cost many more civilian victims than militarized\nconflicts between the govemments and groups that aim at taking over political\ncontrol.\nIn the burgeoning literature on failed states. Sierra Leone often serves as an\nexample.^ *^ Between the mid-1970s and the late-1990s, government revenues\ndeclined from approximately $250 million to less than $10 million. In some failed\nstates such as Somalia, civil disorder ultimately led to famine as food distribution\nsystems broke down. More generally, eight of the ten countries that have the high-\n43. UN 2000, par. 9.\n44. Roiberg 2002 and 2004.\n45. See Reno 2003; and Krasner 2004.\n734 International Organization\nest share of undernourished population according to Food and Agriculture Orga-\nnization (FAO) data—Afghanistan, Angola, Ethiopia, Somalia, Sudan, Mozam-\nbique, Liberia, and Sierra Leone—frequently went through cycles of autocratic\ngovernment, ethnic conflict, and political failure.\"*^\nEthnic conflict also increases the likelihood that governments will treat foreign\nhelp with political reservations, even if the emergency is caused by natural fac-\ntors. After the devastating tsunami in December 2004 that caused deaths in eleven\ncountries, the Indonesian govemment was most reluctant to accept foreign assis-\ntance even though the province Banda Aceh, location of a civil conflict with eth-\nnic roots, was hit harder than any other coastal strip around the Indian Ocean.\nThis behavior mirrors the dismissive policies of the Sudanese government during\nthe ongoing civil war in Darfur, which also has ethnic roots. The Sudanese gov-\nernment not only denied carrying out miUtary operations against the rebels, but\nalso strongly opposed humanitarian intervention by the UN, while the Janjaweed\nmilitias have been reported of killing civilians, mass rape of women, and looting\nproperty.\nConflicts in failed states are also likely to generate higher numbers of refugees\nand internally displaced people because the central authority can no longer guar-\nantee anything resembling security in many areas.'^ ^ Conflicts with ethnic origin\ncan also be expected to generate higher refugee flows because the very intention\nof warfare is often the ethnic cleansing of certain regions (if not the whole coun-\ntry) from other ethnic groups. Neumayer reports a strong effect of civil and ethnic\nwars as well as coUap.se of state authority on asylum migration to Westem Europe,\nwhich is likely to be highly correlated with refugee flows to neighboring countries\nas well as intemal displacement.^\" Davenport, Moore, and Poe find that ethnically\nmotivated genocidal conflicts drastically increase the number of refugees and inter-\nnally displaced persons.^\" Of the seven countries with the highest number of inter-\nnally displaced to resident populations in 2002 according to the Norwegian Refugee\nCouncil—Azerbaijan, Lebanon, Burundi, Sierra Leone, Bosnia Herzegovina, Sudan,\nand Angola—all of them experienced a militarized ethnic conflict, and in five coun-\ntries the political control collapsed.'^\" Hence, five of these seven countries com-\nbined ethnic conflicts with a breakdown of political control; and while Azerbaijan\nand Sudan maintained political control, one can doubt whether this control extended\nover the entire territory of the country. On average, the relation between the eth-\nnic roots of conflict, state failure and the number of displaced persons appears to\nbe quite strong.\nThe sexual violence effect of armed conflict is facilitated by the fact that many\nmilitarized conflicts lead to a partial or complete collapse of political order. The\n46. FAO 2005.\n47. Rotberg 2002 and 20(M.\n48. Neumayer 21)05.\n49. Davenport. Moore, and Poe 2003.\n50. Norwegian Refugee Council 2002, 5.\nIT\nArmed Conflict and the Gender Gap 735\nabsence of a rule of law hits the vulnerable most severely. At the same time, reports\non systematic rapes and rape-related murder of women, forced impregnation, and\nforced abortion are particularly abundant during ethnic wars. In such conflicts,\nsexual violence serves as a means of ethnic cleansing, terrorization, and humilia-\ntion, not only of the violated women, but also the men of the same ethnic group\nwho are forcibly demonstrated their failure to protect \"their\" women. Sexual vio-\nlence against women thus serves as an important signal \"from man to man,\" wound-\ning the men of the opposing ethnic group in their masculinity by marking them as\nincompetent.^' Intlicting sexual violence on women from other ethnic groups also\nserves as an assault on \"the honor of the community and for defiling women who\nare entrusted by the community to maintain the purity of lineage.\"*^- The mere\nthreat of widespread rape is often enough to prompt women and their families to\nleave certain places and flee elsewhere, as happened in the Kosovo, and can thus\nbe employed as a means of ethnic cleansing.^' But because the destruction of the\nother ethnic group's culture and identity is as important in ethnic wars as gains of\nland, targeting violence on women can form an important strategy of war also\nbecause of women's central role in culture and family structures.^'' Wars with eth-\nnic roots are aiso likely to affect more people on both sides as the appeal to ethnic\nkinship facilitates mobilization of one's own group and hatred for the other. In\naddition, they are also likely to last longer and are more difficult to end. Some\nstudies find that civil wars with ethnic roots last much longer than other types of\ncivil wars.^'' Our sample contains fourteen ethnic conflicts and four nonethnic con-\nflicts with a duration of over ten years, with most long-lasting nonethnic civil wars\ntaking place in Central American countries.\nHypotheses\nSocial phenomena such as civil wars can hardly be explained by deterministic\ntheories. Our discussion of the link between militarized confiict and the gender\ngap in life expectancy is no exception to the rule. Yet the preceding discussion has\nidentified three effects that make a negative influence of militarized conflict on\nthe gender gap in life expectancy probable. In particular, we have explained how\nand why the economic consequences of war, the displacement effect and the sex-\nual violence effect are likely to jointly affect women more adversely than men.\nTaking the probabilistic nature of our theory into consideration, we derive the fol-\nlowing testable hypotheses from the above discussion:\n51. Seifcrt 1994,58.\n52. Liz Kelly, cited in Shoemaker 2001, 8.\n53. Shoemaker 2001.\n54. Seiferl 1994.\n55. See Fearon 2004; and DeRouen and Sobek 2004.\n736 Intemational Organization\nHI: Armed conflict is likely to decrease the gender gap in life expectancy.\nH2: Armed conflict is likely to decrease the gender gap more strongly if the\nconfiict has ethnic origins.\nH3: Armed confiict is likely to decrease the gender gap more strongly if confiict\ntakes place in a country in which the central political order has collapsed.\nThe following section puts these hypotheses to empirical test. \"^\nResearch Design ,.\nIn the last section we argued that while most direct victims are men, women are\nlikely to suffer more from the indirect adverse consequences of international and\ncivil wars. We measure these adverse consequences by life expectancy. But life\nexpectancy and the gender gap are a product of multiple influences^—^geographical,\nsocial, economical, and political—that one would need to control for to test our\nhypotheses. Not ail determinants of life expectancy are easy to measure. Geograph-\nical influences such as the likelihood of acquiring malaria are not equal across\ncountries. A simple cross-sectional analysis of life expectancy is likely to suffer\nfrom omitted variable bias, or, if we were to collect data on the national propen-\nsities of serious diseases, would suffer from potentially severe measurement errors.\nTo deal with (he various estimation problems, we have opted for gathering inter-\nnationally comparable panel data of life expectancy. The main advantage of\nrelying on panel data is that only pooled data allows controlling for unobserved\nfactors that vary across countries and are possibly correlated with our explanatory\nvariables. Fixed effects estimators eliminate bias from omitted time-invariant vari-\nables and also remove the level effects of time-varying omitted variables. Unfor-\ntunately and inevitably, the dynamic effects of omitted time-varying variables may\nstill bias the estimates.\nTo our knowledge, the most reliable source for life expectancy data in panel\nform is provided by the U.S. Census's International Data Base (IDB). In compar-\nison, for example, to data provided by the World Bank,''*' the IDP is much better\nmaintained and has by far less missing data. The IDP was created for scientific\npurposes—in response to the information requirements of Intemational Program\nCenter (IPC) staff to meet the needs of organizations that sponsor research efforts.\nThe IDB combines data from country sources (especially censuses and surveys)\n56. World Bank 2004.\nArmed Conflict and the Gender Gap 737\nwith IPC's estimates and projections, which are based on available census data\nand group cohort population projection techniques to compute data between the\ncensuses. These projections are based on country-specific fixed-slope logistic inter-\npolations in the years between national censuses. Moreover, recent population and\nsocioeconomic trends are taken into account *if the projected trends are plausi-\nble.\"^^ For instance, the projection of fertility takes into account trends in age at\nmarriage, the percentage of women using contraception, and existence and scof>e\nof family-planning programs; and data on educational attainment are used in life\nexpectancy calculations.\nWe nevertheless should expect that analyses of IDB data to some extent suffer\nfrom correlated errors, because models that are used to predict the values of a\ncertain variable cannot avoid systematic error. Our analyses inherit these system-\natic errors. To avoid seriously biased estimates, we use a lagged dependent vari-\nable approach, which sufficiently eliminates serially correlated errors. As explained\nin the literature review, the new WHO data on DALYs lost represent a compre-\nhensive and data-intensive measure and with less measurement errors than a life\nexpectancy measure, but the disadvantage is that DALYs are not yet available over\na longer period of time, allowing only a cross-sectional analysis. A cross-sectional\nanalysis does not allow controlling for time-invariant country-specific omitted\nvariables. For these reasons, we prefer data that allows more advanced estimation\ntechniques over cross-sectional data with less measurement errors. Also, while non-\nadjusted life expectancy is theoretically inferior to disability adjusted life expec-\ntancy, we note that the WHO itself has pointed out that the two are highly\ncorrelated.'^ *' In conclusion, in the absence of panel data on adjusted life expec-\ntancy, we believe that nonadjusted life expectancy is the single most relevant aggre-\ngate measure of public health, which has the important advantage of relatively\ngood over-time and across-country data availability.\nThe IDB data base provides information on life expectancy for 145 countries\nand for the years between 1975 and 2002. However, the panel is not balanced,\nthat is, the amount of information available for each country may vary. Next, we\nwill first briefly introduce the data. Then we discuss the estimation problems and\nthe remedies in greater detail. The following sections present the results of our\nanalyses.\nVariables and Data Sources\nWe use data from various sources. As we explained before, the dependent vari-\nable, gender differences in life expectancy, comes from the U.S. Census's IDP\ndata base. Life expectancy varies greatly in the sample we analyze. The mean life\nexpectancy across countries is slightly above sixty-one years, but varies between\n57. U.S. Census 2004, B5.\n58. Mathers etal. 2001, fig. 4.\n738 Intemational Organization\nthirty-seven years in Angola and eighty years in Japan. Over time, average life\nexpectancy has increased from approximately fifty years in 1970 to sixty-five years\nin 2002.\nWe use as our dependent variable the ratio rather than the absolute difference of\nfemale to male life expectancy. The reason is thai, under certain conditions,^''\nchanges in the absolute difference of female to male life expectancy can be a mis-\nleading indicator of the health effects of events. Therefore, if we measured the\ngender gap as the absolute difference between the life expectancies of men and\nwomen, it is possible that even though an equal number of men and women die,\nthe gender gap is still decreasing. This, in turn, implies that it is possible that male\nand female life expectancy can decrease by the same number of years and yet\nmore men had died than women. Furthermore, equal proportional decreases in\nmale and female life expectancy will lead to a larger absolute fall in the life expec-\ntancy of the gender with the higher ex ante life expectancy—typically the female\nlife expectancy. This problem is accounted for if we measure the gender gap as\nthe ratio of female to male life expectancy. To be on the safe side, we additionally\nadd the absolute change in population life expectancy as a regressor. In simula-\ntions, we found that using the life expectancy ratio and controlling for the abso-\nlute changes in population life expectancy removes the distortions that result from\nthe computation of life expectancies,**\nFigure 1 displays the distribution of the ratio of female to male life expectancy\nacross countries.\nIn 100 out of 2,956 country-years, men lived longer than women (hence the\nratio of life expectancies in percent is smaller than 100). In Bangladesh, India,\nand Nepal, this phenomenon is common and can possibly be attributed to the tra-\nditional cultural bias against females in these countries. In all other cases a \"'neg-\native gender gap\"—that is, men living longer than women—is the exception rather\nthan the rule. The highest men-women incline (in our sample) was reported from\nSudan in 1988. This was also the time when the civil war in the south had caused\na large refugee movement to the cities, especially to Khartoum. In September 1988\nthe WHO estimated the total number of refugees as up to 750,000, among which a\nlarge portion suffered from severe undemutrition.*\"' On the other end of the spec-\n59. Changes in mortality rates of a specific age cohort affect also person-years lived of older age\ncohorts due to changes to the number of survivors to older age, und this h;is a larger effect on life\nexpectancy ai birth if the life expectancy of the age cohort is higher. See Preston. Hcuveline, and\nGiiillfil 2(KM, 64. Militarized conHiL-t.s lead to relatively larger changes in the gender gap in life expec-\ntancy if the persons killed have not yet reached age cohorts that show targe gender differences in\nmortality rates. For example, if most individuals killed in a war are below thirty years old. and if\nwomen above thirty are less likely to die at a certain age than men of the same age and women's life\nexpectancy at birth is higher, then ihe change in the absolute difference between female and male life\nexpectancy is a biased proxy for the mortality rates of that conllicl.\n61). For technical details on life expectancy computation, see <http:\/\/maihworld.wolfram.com\/\nLifeExpectancy.html). Accessed 28 April 2(K>6.\n6!. Toote and Waldman 1988.\nArmed Conflict and the Gender Gap 739\n.2-\n.15-\ng.l\nD\n.05-\n—I 1 1\n0 5 10\nFemale life expectancy to male life expectancy(%)\n—I\n15\n-5\nFIGURE t. Kernel density distribution of the GENDER GAP IN LIFE EXPECTANCY\ntrum, the absolute difference in female to male life expectancy is largest in post-\ntransition Russia. The life expectancy difference between Russian women and men\npeaked in 1994 reaching an extraordinary 13.74 years. Reasons were manifold.^^\nNoteworthy, countries from the former Soviet Republic hold forty-eight of the top\nfifty country-years in term.s of gender gap. In all cases, women lived about sev-\nenty to seventy-five years wbile men on average died at the age of sixty or before.\nif we consider the ratio of female to male life expectancy, then posttransition Rus-\nsia also has some of the highest values, but Cambodia tops the list. Due to Pol\nPot's killing fields, during the years 1975 to 1978 the life expectancies of both\ngenders become extremely low, but female life expectancy is almost 50 percent\nhigher than male life expectancy.\nAs our measures of civil war, we rely on Fearon and Laitin's coding of civil\nwars.**^  Fearon and Laitin count an armed conflict between a state and an orga-\nnized, nonstate group as a civil war if the conflict leads to at least 1,000 battle deaths\n62. While Andreev el al. 2003 hold the Russian health care system responsible, other sources report\na steep increase in alcohol abuse and deaths from organized crime; see McKee 1999.\n63. Fearon and Laitin 2003. We updated their data from 1999 up to 2002.\n740 Intemational Organization\nover the course of conflict with a yearly average of at least 100 deaths following\ninitial onset. This definition has the advantage of ruling out minor clashes, while\nat the same time not excluding intermediate conflicts, typically excluded by alter-\nnative sources, such as the Correlates of War (COW) project.^ Fearon and Laitin\nalso distinguish between ethnic and nonethnic civil wars, which we need to test our\nsecond hypothesis. Unfortunately, there is no coding of international war that uses\nfully compatible rules. However, our source for international conflict, the Uppsala\/\nPRIO Armed Conflict Database, allows coding of intemational conflict that is sim-\nilar to Fearon and Laitin's coding rules for civil war. An international confiict is\ncounted if it reached at least twenty-five battle deaths in any one year in addition\nto an accumulated total of at least 1,000 deaths.\"'* Note that we have adjusted the\noriginal data such that the reference point for coding is whether the conflict takes\nplace on the territory of a country. A conflict is not coded for a country participat-\ning in a conflict outside its territory. Thus, for example, the NATO war on Yugo-\nslavia is coded as a conflict for Yugoslavia, but not for the participating NATO\ncountries. The reason for this recoding is that, apart from direct batile deaths, con-\nflict participation in foreign countries is unlikely to affect life expectancy much,\nwhereas the country of conflict location experience.s the full direct and indirect con-\nsequences on life expectancy in general and on the gender gap in particular.\nInformation on collapse of the political order is taken from the Polity project,\nwhich codes both the democracy and the autocracy score \" - 7 7 \" when coders\nobserved \"a complete collapse of central political authority.\"^ To capture socio-\neconomic differences across countries we include gross domestic product (GDP)\nper capita, literacy, and the female labor force participation rate.*'\"' These three\nvariables are supposed to catch the effects of three different dimensions, each of\nwhich being directly related to individual well-being: income, education, and gen-\nder equality. We further include the autocracy score and durability of political\nregimes, boih from the Polity data base in the list of regres.sors.^ ''* Regime durabil-\nity is defined as the number of years since the most recent three-point change on\nthe polity score or the end of transition from a period of lack of stable political\ninstitutions. Other socioeconomic variables, such as health expenditures, access to\nfood, safe water and clean sanitation, income inequality, and the degree of eco-\nnomic freedom typically have poor data availability if they are measurable at all\nand are highly correlated with the variables we explicitly control for or with the\ncountry-specific fixed effects.\n64. See (http:\/\/www.correlatesofwar.org\/). Accessed 15 March 2006.\n63. Strand, Wilhelmsen, and Gleditsch 2004. Recently, there have been attetnpts to develop cardi-\nnal estimates of battle deaths—see, for example, Doyle and Sambanis 2000; and Lacina and Gleditsch\n2005. The validity and reliability of these estimates are currently still unclear and we leave using these\ncardinal measures for future research.\n66. See (www.cidcm.umd.edu\/inscr\/polity). Accessed 15 March 2006.\n67. Data from World Bank 2004.\n68. See (www.cidcm.umd.edu\/mscr\/polity\/>. Accessed 15 March 2006.\nArmed Conflict and the Gender Gap 741\nFinally, we add a series of dummy variables that—though imperfectly—seek to\ncatch the effects of natural disasters {earthquake, storms, tsunamis, and so on) and\nepidemics (HIV\/AIDS) on life expectancy. In both cases, we use crude proxies\nthat aim at reducing errors rather than capturing the variance across countries. For\nnatural disasters, we use data from the Emergency Disasters Data Base (EM-\nDAT).^'' We code the variable I if the number of victims of a disaster reported by\nEM DAT exceeds 10,000. Along similar lines, we code the HIV\/AIDS variable 1\nif the share of people living with HIV\/AIDS to total population aged fifteen to\nforty-five exceeds 10 percent, a level at which it is said to have become epidem-\nic.^\" Appendix 1 provides summary descriptive variable information.\nThis list of regressors is perhaps incomplete. One should keep in mind, how-\never, that we control for correlation with fixed effects of all variables with suffi-\ncient within variation. Of course, there can always exist an omitted time-varying\nvariable whose within variance is highly correlated with the within variance of\none of these regressors. We cannot rule out the possibihty that such a variable\nexists, hut we are not aware of one.\nEstimation Procedure\nMirroring our theoretical expectations, we are particularly interested in uncondi-\ntional and conditional effects of armed conflict on the gender gap in life expec-\ntancy over the entire conflict period. In principle, it would be useful to distinguish\nbetween immediate and lagged effects of conflict. Unfortunately, this is rendered\ndifficult given that conflict data is only discrete and most conflicts last longer than\none year. We observe an average conflict duration of 2.77 years for international\nwars, 7.53 years for nonethnic civil wars, and 11.71 years for ethnic civil wars in\nour sample. In seven countries—Colombia, Chad, Ethiopia, Sudan, India, the Phil-\nippines, and Indonesia—the civil war spans over the entire observation period. A\nlagged conflict variable would therefore be highly collinear with the contempora-\nneous conflict variable, which then results in inefficient estimation. Estimation of\ndummy variables within a lagged dependent variable (LDV) model is even more\nproblematic, because the lagged dependent variable reduces the efficiency of the\nestimation already. Furtber adding the lagged values of a dummy regressor would\nonly lead to unreliable estimates.\nThe fact that armed conflicts and especially civil wars often have a long dura-\ntion has some advantages as well, however. This is because our coefficients esti-\nmate the effects of conflict on life expectancy over the entire conflict periods and\nthus cover some of the long-term effects of conflict. Ufe expectancy data is more\nproblematic for estimating short-term effects of conflict because census data for\nsingle years of intense conflict often does not exist and the influence of unexpected\n69. See (www.em-dal.net). Accessed 15 March 2006.\n70. Data from UNDP 2004.\n742 Internationa! Organization\nshocks on Ufe expectancy is notoriously hard to estimate and therefore tends to be\nunreliable. Specitically, we found life expectancy data in the years of genocides\nhardly consistent with reported evidence. For example, while Verwimp reports\nhousehold-level data that suggests that men were more likely to be killed during\nthe genocide in Rwanda than women,^' the U.S. census's life expectancy data\nreports a small decline in the gender gap: while life expectancy of men declined\nfrom 45.1 to 41.1 years between 1993 and 1995, female life expectancy declined\nby 4.8 years from 47.2 to 42.4 years over the same period (implying that the ratio\nof female to male life expectancy decreased from 104.6 lo 103.2 percent during\nthose years}.^^ However, life expectancy data allows more precise estimates of the\ntotal effects of armed conflict over the entire conflict period, because it captures\nnot only the direct but also the indirect casualties of war. Often these indirect casu-\nalties of armed conflict find little attention in the media and in academic research.\nLife expectancy data may help to unveil these long-term effects.\nBasically, the estimation procedure we employ compares average change in the\ngender gap in life expectancy in conflict countries with the average change in the\ngender gap in nonconflict countries. However, the interpretation of our estimation\ncoefficients is slightly more complex. To capture the explainable level differences\nbetween countries we add the lagged dependent variable to the right-hand-side\nvariables. With a coefficient of approximately 0.9, our dependent variable is \"quasi-\ndifferenced\"—as econonietricians dubbed it.\nAn unbiased and etficient estimation has to resolve a serie.s of econometric com-\nplications. We di.scuss the most important problems in turn. To start with, panel\ndata analyses are typically hampered by the notorious problem of serially corre-\nlated errors. Unfortunately, serial correlation may have many sources. A wrongly\nspecified model, false assumptions about lagged effects of explanatory variables,\npersistent effects, and related problems all may lead to autocorrelation. Broadly\nspeaking, the literature provides two ways to deal with autocorrelation. The first\napproach seeks to exactly model the dynamics of all variables and has clear advan-\ntages in time-series analyses. In panel data, however, it is likely that unit-specific\ndynamics exist. In this case, the first approach would lead to estimates that at best\ncapture the average dynamics over all units. Therefore, most dynamic analyses of\npanel data have relied on the second approach and treated autocorrelation as nui-\nsance. Researchers aim at estimating unbiased coefficients without carefully mod-\neling the dynamics of the explanatory variables. The LDV approach, on which we\nrely, is the most prominent example of the second group.\nIn addition, a fixed-effects model is required if omitted variables or initial vari-\nance exists that are correlated with at least one explanatory variable. However,\n71. Verwimp 2003.\n72. Men were possibly the main target in other historical events of large-scale genocides as well,\neven though this is contested—see the conlributions in Jones 2(H>4. In sensiiiviiy analy.sis we found\nthat it makes little difference to our estimates if we drop observations from years of and surrounding\nevents of geniKide from the data based on information contained in Hiirff 2003.\nArmed Conflict and the Gender Gap 743\nscholars have frequently argued that fixed effects models may \"throw the baby out\nwith the bathwater\" because they completely abandon the between variance.^^ The\nestimation of rarely changing variables becomes highly inefficient—.so inefficient\nthat point estimates can be extremely biased. This is important because militarized\nconflict must be classified as a rarely changing variable. Specifically, conflict is\nextremely rare with a within variance between 0.009 (international war) and 0.054\n(civil war). Estimation of the impact of conflict on life expectancy by a fixed-\neffects model can lead to coefficients far off the true coefficients. Moreover, nat-\nural disasters of a given magnitude are even less frequent. In all these cases, we\ncannot expect to obtain unbiased point estimates using a fixed effects approach.\nHsiao and Plumper and Troeger have suggested a remedy for this type of esti-\nmation problem.^^ Plumper and Troeger—in brief—propose using a three-stage\nestimator to obtain unbiased estimates of variables that have enough within vari-\nance to allow efficient e.stimation while at the same time estimating rarely chang-\ning variables by pooled ordinary least .squares (OLS). This technique thus trades\nunhiasedness for efficiency, which in finite samples pays off with more reliable\npoint estimates if the within variance is really low. Efficient estimation is espe-\ncially important if the regressor of interest is an event dummy as in our case.\nDe-meaning these event dummies leads to extremely inefficient estimation. Units\nthat show no within-variation over time either because they never experienced a\nmilitarized conflict or because a conflict stretched over the entire period that we\nanalyze would not contribute to the estimation of the militarized conflict coeffi-\ncients\/^ As a result, the point estimates would be hardly reliable. We thus esti-\ntnate the conflict variables (as well as the natural disaster and the HIV\/AIDS\nvariables that have similar characteristics) using both within and between vari-\nance while at the same time controUing for potential correlation with country fixed\neffects for the remaining variables that have enough within variation over time.\nAnalysis\nMean Sample Effects\nTable I presents our estimation results.^'' We report results from two models: A\nfull sample mode! and a model that excludes countries where HIV\/AIDS has\n73. Beck and Kat\/ 2O01.\n74. See Hsiao 2003; 51-53; and Pliimper and Troeger 2004 and 2005.\n75. See Plumper. Troeger, and Manow 2005.\n76. We have tested whether our dependent variable ha.-; a unit root. Because we analyze an unbal-\nanced panel, ihe standard Im, Pesaran, and Shin 2003 test, the most reliable unit root test for panel\ndata, is not applicable. Instead, we regressed the gender gap on its lagged value In an otherwise empty\nfixed effects model. We then u.se an F4est to test whether the estimated coefficient equals I. This is\n68.81 in the full sample and 131.77 in the sample where the high HIV prevalence countries are excluded,\nsignificantly rejecting the null. We thus do not consider the possibility of a unit root further.\n744 Intemational Organization\nTABLE 1. Determinants of the dependent variable GENDER GAP IN LIFE\nF.XPECTANCY\n*\nDependent variable:\nRatio of female ro male life e.vpectancy * l()0\nLAGGED GliNDER (UP\nCHANGE IN POPULATION LIFE EXPECTANCY\nINTERSTATE CONFLICT , ,\nriVlI. WAR\nINCOME PER CAPrTA > ' . . -. ,\n1\nAUTOCRATIC INSTrrUTIONS\nREGIME DURABILITY\nLITERACY RATi;\nFEMALE LABOR FORCE PARTICIPATION\nNATURAL DISASTERS\nHIV\/AfDS > 10% OF POPULATION 15-45\nIntercept\nObservations\nCountries\nF-test\nt(eta)\nAdjusted R^\nL\nT-\nModel I\n{full sample)\n0.S899\n(0.0088)***\n0.0604\n(0.0158)*** i\n* 0.3835\n(0.2047)*\n-0.3471\n(0.0621)***\n0.0000\n(0-0000)\n0.0260\n• (0.0077)***\n-0.0042\n(0.0016)**\n-0.0250\n(0.0025)***\n0.0428\n(0.0043)***\n-1.5821\n(0.3302)***\n-0.7437\n(0.0854)***\n12.0858\n(0.9489)***\n18:^6 ' _ •\n106\n3606.75**\"\n0.0791***\n0.959\nModel 2\n{HIV epidemic\ncountry-year.s\nexcluded)\n0.8370\n(0.01121-**\n0.0656\n(0.0169)***\n-0.4293\n(0.2016)*\n-O..^212\n(0.0613)***\n0.0000\n(0.0000)\n0.0363\n• (O.(X)82)***\n-0.0014\n(0.0017)\n-0.0181\n(0.0021)***\n0.0425\n(0.0041)***\n-1.7831\n(0.3432)***\n1, . . . .\n17.1981\n(1.1842)***\n\\mi\n96\n3580.32***\n0.0736***\n0.960\nNote: Standard errors UFL- in parentheses.*^ < 0.05; *V *P ^ O.OOi.\nbecome epidemic (prevalence rates over 10 percent). We will see that the results\nare largely robust. Table 1 shows that both intemational and civil conflicts tend to\ngradually close the gender gap in life expectancy. Based on Model 1, an interstate\nwar reduces the ratio of female to male life expectancy by 0.38 percentage points,\na civil war reduces this ratio by 0.34 percentage points. Perbaps surprisingly, wars\nbetween two countries bave a larger average effect on tbe gender gap than civil\nwars. Further below, we will see thai tbere are important differences among civil\nwars nol yet accounted for. In the restricted sample, the coefficients for interstate\nand internal conflict remain statistically significant. Tbe significant coefflcient of\ntbe eta, wbich is the unexplained part of the unit fixed effects, suggests that the\nestimation still has to account for omitted time-invariant variables.\nArmed Conflict and the Gender Gap 745\nBefore we explore the relations between the various conflict types and tbe gen-\nder gap in life expectancy further, we briefly discuss tbe estimated effects of tbe\ncontrol variables. We fmd that wbile a bigber per capita income boosts life expec-\ntancy, it does not seem lo make a difference to tbe life expectancy gap between\nmen and women. Tbe gender gap significantly widens in autocratic regimes. Polit-\nical stability has no effect in the restricted sample, but decreases the gender gap in\ntbe full sample. We are not surprised to find tbat female labor force participation\nactually widens the gender gap. Of course, women's predisposition for heart attacks\nand lung cancer is likely to increase witb higher labor force participation,^^ but\neven if tbis is tbe case, the beneficial effects of a more self-determined life seem\nto outweigb the disadvantages of workplace stress. Events of natural disasters bave\na qualitatively similar effect to armed conflict, also closing tbe gender gap.^ ** Coun-\ntries with a bigh HiV\/AIDS prevalence rate have a lower gender gap in life expec-\ntancy, all otber things equal. It appears that young women in sub-Sabaran Africa,\nthe region with the highest prevalence rates, are more likely to become infected\nthan men.^'' As a consequence, HIV\/AIDS has a greater impact on women than\nmen in developing countries relative to otber causes of disease and disability.**\"\nConditional Effects\nNot all militarized conflicts are alike— t^o say the least. Some wars are more vio-\nlent, some occur in politically unstable countries, some conflicts are etbnically\nmotivated, and so on. Of course, one could say tbis variance in the severity of\nmilitarized conflicts renders the estimation of mean effects such as those pre-\nsented in the previous section meaningless. But that is not true: knowing that\non average women are more affected over tbe entire conflict period is already\ninteresting.\nIn the theoretical section, we bave argued that the influence of militarized con-\nflict on the gender gap is likely to be influenced by whether tbe conflict bas ethnic\nroots and the political autbority in tbe country bas collapsed. In this section we\ntest these conjectures by estimating individual coefficients for ethnic and noneth-\nnic civil conflicts as well as for these conflict types in countries wbere tbe central\npolitical autbority bas collapsed and where it has not (in our sample, no failed\nstates engaged in international conflict). Table 2 reports the results. It allows an\neasy robustness cbeck because we repeat resuits from Model 1 again in tbe first\ncolumn.\nObserve that our estimates do not vary much following the inclusion of vari-\nables tbat capture conditionality. Most coefficietits of tbe conditional Model 3 do\n77. Painpel 2003.\n78. We intend to explore the effect of natural disasters on ihe gender gap in life expectancy in more\ndetail in future research.\n79. UN 2002, 20.\n80. ICRC 2001, 112.\n746 Intemational Organization\nTABLE 2. Conditional estimation results (full sample)\nDependent variable:\nratio of female to male life e.xpectanry * 100 Modell Model .f Model 4\nLAGGED CENDER GAP\nCHANGE IN POPULArtON LIFE EXPECTANCY\nINTERSTATE CONFLICT\nC I V I L W A R • , , . i • J\nNONETHNIC CIVIL WAR\nETHNIC CIVIL WAR\nNONETHNIC CIVIL WAR w\/o STATE FAILURE\nNONETHNIC CIVn WAR IN TAILED STATES\nETHNIC CIVIL W.AR w\/O STATE FAILURE\nETHNIC CIVIL WAR IN FAILED STATES\nINCOME PER CAPITA\nAUTOCRATIC INSTITUTIONS\nREGIME DURABILITY\nLITERACY RATE\nFEMALE LABOR FORCE PARTICIPATION\nNATURAL DISASTERS i\nHIV\/AIDS > 109!' OF POPULATION 15-45\nIntercept\nObservatiotis\nCountries\nF-test\nt(eta)\nAdjusted R'\n0.8899\n(0.0088)*'*\n0.0604\n(0.0158)***\n-0.3835\n(0.2047)*\n-0.3471\n(0.0621)***\nL\nO.OOOC)\n(0.0000)\n0.0260\n(0.0077)***\n-0.0042\n(0.0016)**\n-0.0250\n(0.0025)***\n0.0428\n(0.0043)***\n-I..S82I\n(0.3302)***\n-0.7437\n(0.0854)***\n12.0858\n(0.9489)***\n1836\n106\n3606.75***\n0.0791***\n0.959\n0.8895\n(0.0088)***\n0.0609\n(0.0158)**'\n-0.3388\n(0.2050)*\n-0.0486\n(0.1209)\n-0.4122\n(0.0677)***\n0.0000\n(0.0000)\n0.0256\n(0.0077)**\n-0.0039\n(0.0017)*\n-0.0251\n(0.0025)***\n0.0431\n(0.0043)*'*\n-1.5.^33\n(0.3306)***\n-0.7352\n(0.0852)***\n12.1190\n(0.9530)***\n1836\n106\n3328.32***\n0.0792***\n(1.959\n0.8866\n(0.0089)***\n0.0613\n(0.0158)***\n-0.3746\n(0.2053)\"\n-0.0616\n(0.1215)\nl.O.WI\n(0.9711)\n-0.4074\n(0.0677)***\n-0.7925\n(0.3258)'\n-0.0000\n(O.DOOO)\n0.0225\n(0.0076)***\n-0.0030\n(0.0016)*\n-0.0252\n(0.0025)***\n0.0429\n(0.0043)**\n-1.5508\n(0.3305)***\n-0.7361\n(0.0851)***\n12.4568\n(0.9678)***\n1836\n106\n2890.55***\n0,0782***\n0.959\nSlandard cmitu are in < 0.05; **p < 0,01; \"*p < 0.001.\nnot deviate significantly from the coefficients of the unconditional Model !. When\nwe di.stinguish between ethnic and nonethnic civil wars, we find that it is only\nethnic civil wars that reduce the gender gap in life expectancy. Of course, one has\nto keep in mind that the vast majority of civil wars has ethnic roots. When we\nArmed Conflict and the Gender Gap 747\nfurther di.stinguish between ethnic and nonethnic civil wars taking place in \"failed\"\nstates and \"nonfaiied\" states (Model 4), then we find that it is ethnic wars in failed\nstates that have the largest impact on the gender gap in life expectancy, reducing\nthe female to male life expectancy ratio by 0.79 percentage points, whereas the\neffect of ethnic civil wars in other countries i.s 0.40 percentage points.\"' In both\nconditional models, the effect of interstate confiict remains statistically signifi-\ncant, with an estimated magnitude of between 0.34 and 0.38 percentage points.\nTo sum up, we found support for our first hypothesis that over the entire con-\nfiict period, the gender gap in life expectancy decreases. Our second and third\nhypotheses, namely, that this decline is stronger when the confiict has ethnic ori-\ngins or the political order collapses, needs to be qualified, however: ethnic civil\nwars have an effect that is stronger still in failed states, whereas nonethnic civil\nwars do not have any effect. This finding does not necessarily falsify our second\nand third hypotheses in respect to nonethnic civil wars. Rather, ethnic civil wars\nare more common than nonethnic civil wars and ethnic civil wars are more likely\nthan nonethnic civil wars to take place in failed states. Therefore, the conditional\nestimates for nonethnic civil wars suffer largely from inefficiency. Better state fail-\nure data and more wars may help to improve estimates, but the world would be\nmuch better off if we had to wait a long time before the conditions for efficient\nestimation were satisfied.\nConclusion\nMilitarized conflicts kill in various ways. They kill soldiers and civilians directly,\nbul also have important indirect effects and find their victims among the larger\ncivilian population, killing people that have never crossed the line of fire. We have\nargued that women are likely to suffer more from these negative indirect effects\nand possibly to an extent that overall they could be more adversely affected by\nconflict than men, despite the fact that men naturally are the main direct victims\nof war. We have demonstrated that, indeed, on average women suffer more than\nmen from international and civil wars, as measured by the effect of conflict on the\nratio of female to male life expectancy. This confirms our first hypothesis. The\naverage decline in the gender gap in life expectancy suggests that the direct and\nindirect con.sequences of wars combined either kill more women or that the killed\nwomen are younger on average than the killed men. Findings on our second and\nthird hypotheses have been more mixed, however. We have found that the effect\non the gender gap is indeed stronger if the civil war has ethnic roots, which con-\ns i . To illustrate, assume thai life expectancy in a country i.s 60.0 years for men and 64.8 years for\nwomen (implying a score of 108 on our dependeiil variable). If an ethnic war in a faiied state reduced\nmen's life expectancy by 2 years to 58.0 years, women's life expectancy would decline by 2.62 years\nto 62.18 years.\n748 International Organization\nflrms our second hypothesis. But the type of civil war matters even more than we\nexpected because we find that only ethnic civil wars decrease the gender gap,\nwhereas nonethnic civil wars do not. Similarly, we find that it is only for ethnic\ncivil wars that the effect on the gender gap becomes stronger if the conflict takes\nplace in a \"failed\" state, in accordance with our third hypothesis, hut not for non-\nethnic civil wars. As we explained above, the caveat is that few civil wars are\nnonethnic and even fewer civil wars in \"failed\" states are nonethnic, such that\nvariation is low and estimation inefficient.\nThe finding that, on average, conflicts lower the life expectancy of women more\nthan that of men means that policymakers, nongovernmental organizations, and\nthe academic community need to pay much closer attention to the hidden, indirect\nconsequences of conflict, which are both \"profound\" and \"underappreciated.\"^^\nThe three recent studies from UN bodies and the International Committee of the\nRed Cross mentioned in the introduction represent a first start. Our findings chal-\nlenge policymakers and intemational and humanitarian organizations to develop\npolicies that mitigate and ideally prevent the adverse impact of armed confiict on\nwomen. Such policies have to address the .specific vulnerabilities of women that\nfollow from severe damage to the health and other infrastructure that result when\na large part of the population has been displaced from their homes and when sex-\nual violence against women forms part of the military strategy employed. While\nthe priority given to women in emergency evacuations during episodes of armed\nconfiict might be misguided given the specific vulnerability of noncombatant men\nduring ongoing conflicts,^^ this does not imply that giving priority to women is\ngenerally misguided. Instead, our findings suggest giving priority to women when\nit comes to the indirect and long-term effects of armed conflicts.\nOur study opens up important avenues for future research in IR. First, future\nresearch could explore characteristics of confiicts other than the ones looked at\nhere, which might help explain why some conflicts apparently are so much more\ndamaging to women, whereas others are not. In the analyses supplementing the\nestimates we reported here (see Appendix 2), we found some regional differences\nfor international wars, but not for ethnic civil wars (only ethnic civil wars in south-\nem Africa were estimated to be even more damaging to women than the average\neffect). More in-depth case study research might be able to elicit reasons for these\ndifferences. Second, the theoretical justification for our hypotheses can explain\nour findings, but future research should provide a better understanding and a more\ndetailed account on the relative importance of specific channels through which\narmed conflict harms women more than men. For example, is damage to the health\ninfrastructure or damage to agricultural and food distribution systems more impor-\ntant? Third, future research should address what role, if any, the effect of armed\nconflict on the gender gap in life expectancy plays for the likelihood of extemal\n82. Human Security Centre 2004, 18.\n83. As demonstrated by Jones 1994. and 2000; and Carpenter 2003.\nArmed Conflict and the Gender Gap 749\npolicy intervention as well as how extemal intervention impacts on the effect of\narmed conflict. Why do multinational peace-keeping forces intervene in some con-\nflicts but not in others? Why do international donors attempt to rebuild the coun-\ntry with the help of enormous sums of development aid and technical assistance\nafter some conflicts but not others? How is international aid related to the politics\nof the government in crisis countries? Do these interventions have a significant\neffect on the impact of armed confiict on the gender gap in life expectancy and, if\nso, under what conditions?\nFrom a methodological point of view, we believe that future research would\nbenefit from a more disaggregated and case-study type of approach. On the one\nhand, studies are needed that analyze the individual level. For instance, political\nscientists and economists should have a better understanding of how government\nfailure and ethnic conflicts affect the prices of goods of basic need. As yet, we\nhave a much better understanding on how markets work in good times, but we\nknow relatively little about the operation of markets in the presence of natural or\nman-made disasters. On the other hand, ca.se studies could provide additional\ninsights into the interdependencies between the various effects of militarized con-\nflict and political institutions. For many of the new re.search avenues that could be\ntaken from this study's results, the quality of data and the number of observations\nare likely to be insufficient for macro-level studies to provide interesting results.\nAppendix 1, Descriptive Statistics\nVririahles Observations Mean\nStandard\ndeviation Minimum Maximum\nGBNDI-R CiAP\nCHANGE IN POPULATION\nl.rFE EXPECTANCY\nPliR TAPITA INCOME\nAUTOCRATIC INSTITUTIONS\nKKGIME DURABILITY\nLITERACY RATE\nFEMAi.K LABOR FORCE PARTICIPATION\nNATURAL niSASTERS\nINTERNATIONAL CONFLICT\nCIVIL WAR\nNONETHNIC CIVIL WAR\nETHNir CIVIL WAR\nNONETHNIC CIVIL WAR WITHOUT\nSTATE FAILURE\nNONETHNir CIVIL WAR IN FAILED STATES\nETHNIC CIVIL WAR W \/ o STATE FAILURE\nETHNIf CIVIL WAR IN FAILED STATES\nS > ]0% OF POPULATION 1 5 - 4 5\n1836 107.31 4.80 yi.O7 128.30\n1836\n1836\n1836\n1836\n1836\n836\n1836\n1836\n1836\n1836\n1836\n836\n836\n1836\n836\n836\n0.16\n4366.94\n3.37\n14.97\n70.42\n37.28\n0.005\n0.014\n0.230\n0.039\n0.196\n0.001\n0.039\n0.190\n0.005\n0.103\n1.48\n4185.52\n3.48\n15.75\n23.21\n9.23\n0.070\n0.116\n0.421\n0.194\n0.397\n0.023\n0.193\n0.392\n0.074\n0.304\n-36.47\n438.61\n0.00\n0.00\n11.04\n6.30\n0.00\n0.00\n0.00\n0.00\n0.00\n0.00\n0.00\n0.00\n0.00\n(1.00\n32.09\n23408.34\n10.00\n82.00\n99.80\n52.72\n.00\n.00\n.00\n.00\n.00\n.00\n.00\n.00\n.00\nNote: Based on Models I, 3, and 4 samples.\n750 International Organization\nTABLE Al. Jackknife permutation test (groupwise exclusion) based on Mode! 3\nBaselinf. (no exclusions)\nCOW code 0-99 excluded\nCOW code 100-199 f.xctuded\nCOW code 200-325 excluded\nCOW cade 339-373 excluded\nCOW code 400-499 excluded\nCOW code 500-599 excluded\nCOW code 600-699 e.xcluded\nCOW code 700-850 excluded\nCOW code >850 excluded\nExcluded group\n\"•' •\"\"nl'-ie^\nNone\nNorth and Middle America\nSouth America\nWeil and Central Europe\nEast und Souih-East Europe\nCentral Africa\nSouthern Africa\nNorthern Africa\nAsia\nAustralia & Oceania\n95% confidence intervals .\nInterstiiti-\n-0.74.\n-0.49.\n-0.70.\n-0.74.\n-0.60.\n-1.25.\n-0 .71 .\n-1.28.\n-0.57.\n-0 .73.\nflirt\n. 0.06\n. 0.23\n. 0.17\n. 0.08\n. 0.20\n.-0.37\n. 0.74\n.-0.43\n. 0.99\n. 0.08\nCivil\n-0 .29. .\n-0 .28 . .\n-0 .33 . .\n-0 .25 . .\n-0 .15 . .\n-0 .67. .\n-0 .24. .\n-0 .55 , .\n-0 .28 . .\n-0 .29. ,\nwar\n0.19\n0.27\n0.23\n0.23\n0.32\n-0 .16\n0.19\n-0.27\n0.28\n0.19\nEtlmifiil\ncivil war\n-0.54.\n-0.55.\n-0.75.\n-0.87.\n-0.77.\n-0.86.\n-0 .23 .\n-0 .71 .\n-0 .81 .\n-0.57.\n.-0.28\n.-0.29\n.-0.41\n.-0.53\n.-0.43\n.-0.51\n. 0.02\n.-0.41\n.-0.45\n.-0.30\nNoie: COW ccide refers lo couiilr)' code frcim [he Currelates <il' W;ir pn\nTABLE A2. Results from bootstrap modeling\nVariable\nStandard\nReplications Ohscrvtd Bias error\n95% confidence\ninterval\nModel I\nINTERSTATE CONFLICT llMH) - 0 . 3 8 3 - 0 . 0 0 4 U,I73\ncivi l . WAR 1000 - 0 . 3 4 7 - 0 . 0 0 1 0.080\na723\n0.676\n0.505\n0.507\n-0.044\n-0.002\n-0.189\n-0.191\nN\nBC\nN\nBC\nModel .<\nINTERNATIONAL WAK I (MHl\nNONETHNir CIVIL WAR 1000\nETHNIC OVIL WAR KXH)\n0..13V\n0.049\n0.412\n0,0fl7\n0.001\n0.002\n(1,1 M5\n0,178\n0.093\n- 0.7(12\n- 0 . 6 7 1\n- 0 . 3 9 8\n-0,350\n-0.595\n-0.611\n(1,025\n0.048\n0.300\n0.369\n-0.230\n-0.238\nN\nBC\nN\nBC\nN\nBC\nNote: N - normul, BC = bias correcied.\nAppendix 2. Robustness Tests\nWe did two robustness tests—groupwise jackknife and bootstrap—to study whether the\nresults reported in Model 3 ot Table 2 stand up against the apparent variance across con-\nflicts. See Table AI. A groupwise jackknife excludes each group of observation once. In the\njackknife, we tested the robustness of our model in respect to such influence by eliminating\nArmed Conflict and the Gender Gap 751\ngroups of neighboring countries from the estimation. We distinguish between nine country\ngroups: North and Middle America, South America, West and Central Europe, East and\nSouth-East Europe, Central Africa, Southern Africa, Northern Africa, Asia, as well as Aus-\ntralia and Ozeania. We found that for civil wars and especially for ethnic civil wars the\nestimates presented in Table 2 are fairly robust to the exclusion of geographical regions.\nThe effect of interstate wars on the relative gender gap, however, shows strong regional\nvariations, suggesting that not all international wars are alike in their influence on the civil\npopulation. The only statistically signilicant deviation for ethnic civil wars is southern Africa,\nwhere such conflicts affect women more strongly still than the average conflict in the global\nsample as the confidence interval ties entirely above the one from the global sample.\nWe observe similar robustness when bootstrapping Models 1 and 3. See Table A2. We\nused various procedures, each with I,(X)O replications. We observed that the estimated bias\nfor all variables including the conflict variables is negligibly low (we show only the boot-\nstrapped results of the conflict variables here). The confidence intervals of both the normal\nregression and the bias corrected results almost perfectly overlap. Thus we may conclude\nthai our results are not sensitive to particular cases.\nReferences\nAndreev, Evgueni. Ellen Nolte, Vladimir Shkolnikov, Elena Varavikova, and Mariin McKee. 2003.\nThe Evolving Paltern of Avoidable Mortality in Russiu, Intertiat'umul Journal of Epltiemiolog\\ 32\n(3):437-46.\nAshford, Mary-Wynne, and Yolanda Huet-Vaughn. 1997. The Impact of War on Women. In War and\nPuhlk Health, edited by Berry S. Levy and Victor W. Sidel, 186-96. New York: Oxford University\nPress.\nA,skin, Kelly Dawn. 1997. Wtir Crimes Against Women—Prosecution in War Crimex Tribunals. The\nHague. Nether!iind,s: Martirius NijholT.\nBeck, Nathaniel, and Jonuihan Kai7. 20()l. Throwing Out the Baby with the Bath Water: A Comment\non Green, Kim, and Yoon. Interiuitiotml Organization 55 (2):487-95.\nBossuyt, N., S. Gadeyne, P. Deboosere, and H. v;iri Oyen. 2004. Socio-Economic Inequalities in Heallh\nExpectancy in Belgium. Public Health 118 (l):3-10.\nCaprioli, Mary. 20(K). Gendered Conflict, Journal of Peace Research 37 (l);51-68.\n-. 2003. Gender Equality and Stale Aggression: The Impaet of Dome.stic Gender Equality on\nState First Use of Force. International hilermtiom 29 (3): 195-214.\n. 2004. Feminist IR Theory and Quantitative Methodology: A Critical Analysis. Internationut\nStudies Review 6 (2):253-69.\n-. 2005. Primed tor Violence: The Role of Gender Inequality in Predicting Intemal Conflict.\nInterneitional Studie.t Quaricfly 49 (2): 161-78.\nCaprioli. Mary, and Mark A. Boyer. 2001. Gender, Violence, and intemational Crisis. Journal of Con-\nfiict Resolution 45 (4):503-18.\nCarpenter. R. Charli. 2002. Gender Theory in World Politics: Contributions of a Nonfeminist Stand-\npoint? International Studies Review 4 (3): 153-65,\n. 2003. \"Women and Children First\"; Gender, Norms, and Humanitarian Evacuation in the Bal-\nkans 1991-95. hiternatiotial Organization 57 (4):66I-94,\n. 2004. Beyond \"Genderdice.\" In Geudercide and Genocide, edited by Adam Jones, 230-56.\nNashville. Tenn.: Vanderbilt University Press.\n-. 2005. \"Women, Children and Other Vulnerable Groups\": Gender, Strategic Frames and the\nProtection of Civilians as a Transnational Issue. International Studies Quarterly 49 (2):295-334.\n752 Intemational Organization\nCarver. Terrell. 2(X)4. Men and Masculinities in Gentiercide\/Genocide. In Gendercide and Genocide,\nedited by Adam Jones. 272-94. Nashville, Tenn.: Vanderbilt University Press.\nCollier, Paul. 1999. On the Economic Consequences of Civil War. Oxford Economic Papers 51\n(0:168-83.\nDavenport, Christian. Will H. Moore, and Sieven C. Poe. 2003. Sometimes You Ju.st Have to Leave:\nDomestic Threats and Forced Migration, 1964-1989. Intermttiotial ltueraction.\\ 29 (5):27-55.\nDavis, David R., and Joel N. Kuritsky. 2002. Violent Conflict and Its Impact on Health Indicators in\nSub-Saharan Africa. Workini> Paper. Atlanta, Ga.: Emory University.\nDcRcmen, Karl R., Jr., and David Sobek. 2004. The Dynamics of Civil War Duration and Outcome.\nJournal of Peace Re.fearch 41 <.1):27.S-30l.\nDoyle. Michael W,, and Nicholas Sambanis. 2000. Intemaiional Peacebuilding: A Theoretical and Quan-\ntitative .Analysis. Attierican Political Science Review 94 14):779-XOI.\nDrfeze. Jean, and Amartya Sen. 1990. Hunger and Public Action. Oxford, England: Clarendon Press,\nFood and Agriculture Organization (FAO). 2005. A.ssesstnent ofthe World Food Security Situation.\nRome: FAO.\nFearon, James D. 2004. Why Do Some Civil Wars Last so Much Longer Than Others? Journal of\nPeace Research 41 (3):275-3OI.\nFearon, James D., and David D. Laititi. 2003. Ethnicity, Insurgency, and Civil War. American Political\nScience Review 97 (1 ):7S-90.\nFoege, William H. 1997. Arms and Public Health: A Global Perspective. In War and Public Health,\nedited by Berry S. Levy and Victor W. Side!, .3-11. New York: Oxford University Press.\nGarfield. Richard M., and Alfred 1. Neugut. t997. The Human Consequences of War. In War and\nPublic Health, edited by Berry S. Levy and Victor W. Sidel, 27-38. New York: Oxford University\nPress.\nGhobarab, HaTiem Adatn, Paul Huth, and Bruce Rus.sett. 2(X)3. Civil Wars Kill and Maim People—\nLong After the Shooting Stops. .Americtin Political Science Review 97 (2): 189-202.\n. 2(K)4. The Postwar Public Health Eftects of Civil Conflict. Social Science & Medicine 59\n(2):869-84.\nGyimab-Brempong, Kwabena. and Marva E. Corley. 2005. Civil War Incidence and Economic Growth\nin Africa, Journal of African Economics 14 (2):270-3I I.\nHarff. Barbara. 2(H)3. No Lessons Learned from the Holocaust? Asse.ssing Risks of Genocide and Polit-\nical Mass Murder Since 1955. American Political Science Review 97 (l):57-73.\nHertz. Erica. James R. Heberl, and Joan Landon. 1994. Social and Environmental Factors and Life\nExpectancy, Infant Mortaiily. and Maternal Mortality Rates: Results of a Cross-National Compari-\nson. Social Science & Medicine 39 (l):105-44.\nHsiao. Cheng. 2003. Analy.sis of Panel Data. Cambridge; Cambridge University Press.\nHuman Security Centre. 2004. Deadly Connections: Tbe War\/Disease Nexus Workshop Report March\n22-23, Vancouver, Canada: Human Security Centre.\n. 2005. Human Security Report 200S. Vancouver, Canada: Human Security Centre.\nInternational Committee of ibe Red Cross (ICRC). 2001. Women Facing War. Geneva: ICRC.\nIm. K.. H. Pesaran. and Y. Shin. 2003. Testing for Unit Roots in Heterogeneous Panels. Journal of\nEconometrics 115 (0:53-74.\nJones, Adam. 1994. Gender and Ethnic Conflict in Ex Yugoslavia. Fthriic and Racial Studies 17\n(O:II5-.14.\n. 2000. Gendercide and Genocide, Journal of Genocide Resean-h 2 (2): I H$-211,\n. 2(K)2. Gender and Genocide in Rwanda. Journal of Getiocide Research 4 (1 ):65-94.\ned. 2004. Gendercide atid Genocide. Nashville, Tenn.: Vanderbill University Press.\nKcnnelly. Brendan, Eamon O'Shea, and Eoghan Garvey. 2003. Social Capital, Life Expectancy and\nMortality: A Cross-National Examination. Social Science <& Medicine 56 (I2):2367-77.\nKeohane, Robert O. 1998. Beyond Dichotomy: Conversations Between Intemational Relations and\nFeminist Theory. Internutiotial Studies Quarterly 42 (I): 19.3-98.\nKing, Gary, and Lisa L. Martin. 2001. The Human Costs of Military Conflict. Overview Paper for\nArmed Conflict and the Gender Gap 753\nConference on Military Conflict as a Public Health Problem. September, Cambridge, Mass.: Har-\nvard University.\nKrasner, Stephen D. 2004. Sharing Sovereignty: New Institutions for Collapsed and Failing States.\nInternational Security 29 {2):85-l20.\nLacina. Bethany, and Nils Petter Gleditsch. 2005. Monitoring Trends in Global Combat: A New Data-\nset of Batile Deaihs. European Journal of Population 21 (2\/3):145-66.\nLi, Quan, and Ming Wen. 2005, The Immediate and Lingering Effects of Armed Conflict on Adult\nMortality, A Time-Series Cross-National Analysis, Journal of Peace Research 42 (4):47l-92.\nMarshall, Monty G., and Donna Ramsey, 1999. Gender Empowerment and ihe Willingness of States to\nUse Force. Working Paper. Severn, Md.: Center for Systemic Peace.\nMaihers, Colin D,, Ritu Sadana, Joshua A, Salomon, Christopher J. L. Murray, and Alan D. Lope\/,.\n2001. Healthy Life Expectancy in 191 Countries, 1999. The Lancet 351 (9269):1685-91.\nMcKee, Martin. 1999. Alcohol in Russia. Alcohol atid Alcoholism 34 (6):824-29.\nMoser, Caroline O. N. 2001. The Gendered Continuum of Violence and Conflict. In Victims. Perpetra-\ntors or Actors? edited by Caroline O. N. Moser and Fiona C. Clark, 30-51. London: Zed Books,\nMurdoch. James C , and Todd Sandier. 2002. Economic Growth, Civil Wars, and Spalial Spillovers.\nJournal of Conflict Resolution 46 (0:91-110.\nMurray, Christopher J. L. 1994. Quantifying the Burden of Disease: The Technical Basis for Disability-\nAdjusted Life Years. Bulletin of the World Health Organization 72 (3):429-4.S.\nMurray. Christtipher J. L,, Gary King, Alan D. Li>pe\/, N. Tomijinia, and B. G. Krug. 2002. Armed\nConflict as a Public Health Problem. British Medical Journal 324 (7333):346-49.\nNeiimayer, Eric. 2005. Bogus Refugees? The Determinants of Asylum Migration to Western Europe.\nInternational Studies Quarterly 49 (4):389-409.\nNorwegian Refugee Council, 2002. Internally Displaced People: A Global Survey. London:\nEarthscan.\nPampel, Fred. 2003. Declining Sex Differences in Mortality from Lung Cancer in High-Income Nations.\nDemography 40 (0:45-65.\nPlumper, Thomas, and Vera E. Troeger. 2004. Efficient Estimation of Rarely Changing Variables in\nFixed Effects Models. Working Paper Series 622581. Social Science Research Network. Available\nat (www.ssm.com). Accessed March 15 2006.\n. 2005. Efficient Estimation of Time-Invariant and Rarely Changing Variables in Finite Sample\nPanel Analyses with Unit Fixed Eftects. Paper presented at the American Political Science Associ-\nation Conference, September, Washington, D.C.\nPlumper, Thomas, Vera E. Troeger, and Philip Maiiow. 2005. Panel Data Analysis in Comparative\nPolitics, Linking Method to Theory. European Journal of Political Re.search 44 (2):327-54.\nPreston, Samuel H., Patrick Heuveline, and Michel Guillot. 2001. Demography—Measuring and Mod-\neling Population Processes. Oxford, England: Blackweil.\nRegan, Patrick M., and Aida Paskeviciute. 2003. Women's Access to Politics and Peaceful States. Jour-\nnal of Peace Research 40 (31:287-302.\nReno, William. 2003. Sierra Leone: Warfare in a Post-Stale Society. In State Failure and State Weak-\nness in a Time of Terror, edited by Robert I. Rotberg, 71-100. Washington, D.C: Brookings Insti-\ntution Press.\nRoberts, Les, Riyad Lafta, Richard Garfield, Jamal Khudhairi, and Gilberi Brunham. 2004. Mortality\nBefore and After the 200.1 Invasion of Iraq: Cluster Sample Survey. The Lancet 364 (2):l857-64.\nRotberg, Robert I. 2002. Failed States in a Worid of Terror. Fore'tgn Affairs 81 (4): 127-40.\n, ed. 2(X)4. When States Fail: Causes and Consequences. Princeton, N.J.: Princeton University\nPress.\nSeiferi, Ruth. 1994. War and Rape: A Preliminary Analysis. In Mass Rape: The War Against Women in\nBosnia-Herzegovina, edited by Alexandra Stiglmayer and Marion Faber, 54-72. Lincoln: University\nof Nebraska Press.\nShoemaker, Jolynn. 2001. Women and Wars Within States: Internal Conflict, Women's Rights and Inter-\nnational Security. Civil Wars 4 (3):i-34.\n754 International Organization\nStiglmayer, Alexandra, and Marion Faber. 1994. Mass Rape: The War Against Women in Bosnia-\nHerzegovina. Lincoln: University of Nebraska Press.\nStrand, Havard. Lars Wilhelmsen, and Nils Petter Gleditsch. 2()04. Armed Conflict Dataset Ctxlebook\nVersion 2.1. Oslo: Intemational Peace Research Institute Oslo and Uppsala Univereity. Available al\n(www.prio.no\/cscw\/armedconflict). Accessed 15 March 2(K)6.\nTickncr, J. Ann. 1997. You Just Don't Understand: Troubled Engagements Between Feminists and IR\nTheorists. International Studies Quarterly 41 (4):611-32,\n. 2001. Gendering World Politics: Issues and Approaches in the Post-Cold War Era. New York:\nColumbia University Press.\n-. 2005. What Is Your Research Program? Some Feminist Answers lo Intemational Rciations\nMethtxiologica! Questions. International Studies Quarterly 49 111:1-21.\nToole, Michael J. 1997. Displaced Persons and War. In War and Public Health, edited by Berry S.\nLevy and Victor W. Sidel, 197-21 I. New York: Oxford University Press.\nToole, Michael J., and R. J. Waldman. 1988. An Analysis of Mortality Trends Among Refugee Popu-\nlations in Somalia, Sudan, and Thailand. Bulletin ofthe WHO 66:237-47,\nUnited Nations (UN). 20(X). Women. Peace and Security. Study submitted by the Secretary-General\npursuant lo Security Council Resolution 1325 (2000). New York: UN.\n. 2(XJ2. Resolution Li25 (2000) Adopted by the Security Council al Its 4213th Meeting, on\n31 October 2000. New York: UN.\n. 2003. Consolidated Inter-Agency Appeal for the Democratic Republic of the Congo 2003,\nNew York: UN, 16 January 2003.\nUnited Nations Development Programme (UNDP). 2004. Human Development Report. New York:\nOxford Universiiy Press.\nUnited Nations Development Fund for Women (U^fDPW). 2002. Women, War and Peace. New York:\nUNDFW.\nU.S. Census Bureau. 2004. Global Population Profile 2002. Washington, D.C: Government Printing\nOffice.\nVenvimp, Philip. 2003. Testing the Double-Genocide The.sis for Central and Southern Rwanda. Jour-\nnal ofCcmfiict Resolution 47 (4):423-42.\nWorid Heallh Organization (WHO). 2004, Country Profile Bosnia and Herzegovina, Geneva: WHO.\n, Various years. World Health Report. Geneva: WHO.\nWilliamson. John B., and Ulrike Boehmer. 1997. Female Life Expectancy, Gender Stratification. Heallh\nStatus, and I,^vcl of Economic Development: A Cross-national Study of Less Developed Countries.\nSocial Science & Medicine 45 (2):3O5-I7.\nWorld Bank. 2004. World Development Indicators on CD-Rom. Washington, D.C: World Bank.\n\n"}