{"doi":"10.1039\/b819373h","coreId":"195304","oai":"oai:lra.le.ac.uk:2381\/7378","identifiers":["oai:lra.le.ac.uk:2381\/7378","10.1039\/b819373h"],"title":"Precise and accurate isotopic analysis of microscopic uranium-oxide grains using LA-MC-ICP-MS","authors":["Lloyd, Nicholas Selwyn","Parrish, Randall R.","Horstwood, Matthew S.A.","Chenery, Simon R.N."],"enrichments":{"references":[{"id":44687644,"title":"1 uranium hexafluoride reduction facility (Fernald, OH). If Fernald produced the UF4 for NLI, it seems likely that the UF6 was supplied from neighbouring Portsmouth.","authors":[],"date":null,"doi":null,"raw":"Puducah, KY; Portsmouth, OH) and 1 uranium hexafluoride reduction facility (Fernald, OH). If Fernald produced the UF4 for NLI, it seems likely that the UF6 was supplied from neighbouring Portsmouth.","cites":null},{"id":44687647,"title":"A survey of uranium in soils surrounding the NL Bearings Plant, Report IWL-9488-461, Teledyne Isotopes,","authors":[],"date":"1980","doi":null,"raw":"H. W. Jeter and D. M. Eagleson, A survey of uranium in soils surrounding the NL Bearings Plant, Report IWL-9488-461, Teledyne Isotopes, Westwood, NJ, 1980.","cites":null},{"id":44687653,"title":"Alloys Compd.,","authors":[],"date":"1998","doi":null,"raw":"D. L. Donohue, J. Alloys Compd., 1998, 271-273, 11-18.","cites":null},{"id":44687654,"title":"Applied Spectroscopy Reviews,","authors":[],"date":"2005","doi":"10.1081\/asr-200064495","raw":"X. Hou, W. Chen, Y. He and B. T. Jones, Applied Spectroscopy Reviews, 2005, 40, 245-267.","cites":null},{"id":44687655,"title":"Association, Processing of Used Nuclear Fuel for Recycle http:\/\/www.world-nuclear.org\/info\/inf69.html, Accessed 02\/09\/2008.","authors":[],"date":null,"doi":null,"raw":"World Nuclear Association, Processing of Used Nuclear Fuel for Recycle http:\/\/www.world-nuclear.org\/info\/inf69.html, Accessed 02\/09\/2008.","cites":null},{"id":44687645,"title":"Consultation: Colonie Site, Agency for Toxic Substances and Disease Registry,","authors":[],"date":"2004","doi":"10.4135\/9781412963855.n24","raw":"ATSDR, Health Consultation: Colonie Site, Agency for Toxic Substances and Disease Registry, Atlanta, USA, 2004.","cites":null},{"id":44687652,"title":"Health Phys.,","authors":[],"date":"2008","doi":null,"raw":"R. L. Fleischer, Health Phys., 2008, 94, 292-293.","cites":null},{"id":44687646,"title":"Investigation of Excess Alpha Activity Observed in Recent Air Filter Collections and Other Environmental Samples, Letter CHEM-434-LAD, Knolls Atomic Power Laboratory, General Electric Company,","authors":[],"date":"1980","doi":null,"raw":"L. A. Dietz, Investigation of Excess Alpha Activity Observed in Recent Air Filter Collections and Other Environmental Samples, Letter CHEM-434-LAD, Knolls Atomic Power Laboratory, General Electric Company, Schenectady, NY, USA, 1980.","cites":null},{"id":44687656,"title":"Past Recycled Uranium Programs Under Review as Energy Department Investigation Continues, http:\/\/www.ne.doe.gov\/home\/9-29-99.html, Accessed 02\/09\/2008.","authors":[],"date":null,"doi":null,"raw":"DoE, Past Recycled Uranium Programs Under Review as Energy Department Investigation Continues, http:\/\/www.ne.doe.gov\/home\/9-29-99.html, Accessed 02\/09\/2008.","cites":null},{"id":44687649,"title":"Precise and accurate isotopic analysis of microscopic uranium-oxide grains using LA-MC-ICP-MS.","authors":[],"date":"2008","doi":"10.1039\/b819373h","raw":"N. S. Lloyd, R. R. Parrish, S. R. Chenery and J. G. Arnason, Geochim. Cosmochim. Acta, 2008, 72, A566. CREATED USING THE RSC ARTICLE TEMPLATE (VER. 3.0) - SEE WWW.RSC.ORG\/ELECTRONICFILES FOR DETAILS Lloyd, N. S., Parrish, R. R., Horstwood, M. S. A. & Chenery, S. R. N. 2009. Precise and accurate isotopic analysis of microscopic uranium-oxide grains using LA-MC-ICP-MS. Journal of Analytical Atomic Spectrometry, 24 (6), 752-758.","cites":null},{"id":44687648,"title":"Total Environ.,","authors":[],"date":"2004","doi":null,"raw":"E. R. Trueman, S. Black and D. Read, Sci. Total Environ., 2004, 327, 337-340.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-06","abstract":"This is the author's final draft of the paper published as Journal of Analytical Atomic Spectrometry, 2009, 24 (6), pp. 752-758.  The final version is available from http:\/\/www.rsc.org\/publishing\/journals\/JA\/article.asp?doi=b819373h.  Doi: 10.1039\/b819373hUranium isotope (235U, 236U, 238U) ratios were determined for microscopic uranium-oxide grains using laser-ablation multi-collector inductively-coupled-plasma mass-spectrometry (LA-MC-ICP-MS). The grains were retrieved from contaminated soil and dust samples. The analytical technique utilised is rapid, requires minimal sample preparation, and is well suited for nuclear forensic applications. Precision and accuracy were assessed by replicate analyses of natural uraninite grains: relative uncertainty for 235U\/238U is 0.2% (2), and the mean is in agreement with the natural ratio. A total of 115 uranium-oxide grains were analysed from environmental samples (soils and dusts); all of these were depleted uranium (DU) from a factory that produced uranium articles. Knowledge of the range of isotope ratios from particles of this controversial contaminant has proven useful when interpreting isotope ratios from bulk samples. Variation of the measured isotope signatures reveals details of the history of uranium processing and emissions","downloadUrl":"http:\/\/hdl.handle.net\/2381\/7378","fullTextIdentifier":"https:\/\/lra.le.ac.uk\/bitstream\/2381\/7378\/3\/Lloyd%20et%20al%202009%20-%20Precise%20and%20accurate%20isotopic%20analysis%20of%20microscopic%20uranium-oxide%20grains%20using%20LA-MC-ICP-MS%20-%20PREPRINT.pdf","pdfHashValue":"f73f6ed119dea3e0f37f7d2de3468d0602119efb","publisher":"Royal Society of Chemistry","rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:lra.le.ac.uk:2381\/7378<\/identifier><datestamp>\n                2011-03-14T16:45:25Z<\/datestamp><setSpec>\n                com_2381_851<\/setSpec><setSpec>\n                com_2381_9549<\/setSpec><setSpec>\n                col_2381_4180<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nPrecise and accurate isotopic analysis of microscopic uranium-oxide grains using LA-MC-ICP-MS<\/dc:title><dc:creator>\nLloyd, Nicholas Selwyn<\/dc:creator><dc:creator>\nParrish, Randall R.<\/dc:creator><dc:creator>\nHorstwood, Matthew S.A.<\/dc:creator><dc:creator>\nChenery, Simon R.N.<\/dc:creator><dc:description>\nThis is the author's final draft of the paper published as Journal of Analytical Atomic Spectrometry, 2009, 24 (6), pp. 752-758.  The final version is available from http:\/\/www.rsc.org\/publishing\/journals\/JA\/article.asp?doi=b819373h.  Doi: 10.1039\/b819373h<\/dc:description><dc:description>\nUranium isotope (235U, 236U, 238U) ratios were determined for microscopic uranium-oxide grains using laser-ablation multi-collector inductively-coupled-plasma mass-spectrometry (LA-MC-ICP-MS). The grains were retrieved from contaminated soil and dust samples. The analytical technique utilised is rapid, requires minimal sample preparation, and is well suited for nuclear forensic applications. Precision and accuracy were assessed by replicate analyses of natural uraninite grains: relative uncertainty for 235U\/238U is 0.2% (2), and the mean is in agreement with the natural ratio. A total of 115 uranium-oxide grains were analysed from environmental samples (soils and dusts); all of these were depleted uranium (DU) from a factory that produced uranium articles. Knowledge of the range of isotope ratios from particles of this controversial contaminant has proven useful when interpreting isotope ratios from bulk samples. Variation of the measured isotope signatures reveals details of the history of uranium processing and emissions.<\/dc:description><dc:date>\n2010-01-04T15:31:39Z<\/dc:date><dc:date>\n2010-01-04T15:31:39Z<\/dc:date><dc:date>\n2009-06<\/dc:date><dc:type>\nArticle<\/dc:type><dc:identifier>\nJournal of Analytical Atomic Spectrometry, 2009, 24 (6), pp. 752-758.<\/dc:identifier><dc:identifier>\n0267-9477<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1039\/b819373h<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2381\/7378<\/dc:identifier><dc:language>\nen<\/dc:language><dc:publisher>\nRoyal Society of Chemistry<\/dc:publisher>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:0267-9477","0267-9477"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article"],"fullText":"CREATED USING THE RSC ARTICLE TEMPLATE (VER. 3.1) - SEE WWW.RSC.ORG\/ELECTRONICFILES FOR DETAILS \n \nLloyd, N. S., Parrish, R. R., Horstwood, M. S. A. & Chenery, S. R. N. 2009. Precise and accurate isotopic analysis of \nmicroscopic uranium-oxide grains using LA-MC-ICP-MS. Journal of Analytical Atomic Spectrometry, 24 (6), 752-758. \nPrecise and accurate isotopic analysis of microscopic uranium-oxide \ngrains using LA-MC-ICP-MS \nNicholas S. Lloyd *a, Randall R. Parrish a,b, Matthew S. A. Horstwood b, Simon R. N. Chenery c \nReceived (in XXX, XXX) Xth XXXXXXXXX 200X, Accepted Xth XXXXXXXXX 200X \nFirst published on the web Xth XXXXXXXXX 200X 5 \nDOI: 10.1039\/b000000x \nUranium isotope (235U, 236U, 238U) ratios were determined for microscopic uranium-oxide grains \nusing laser-ablation multi-collector inductively-coupled-plasma mass-spectrometry (LA-MC-ICP-\nMS). The grains were retrieved from contaminated soil and dust samples. The analytical technique \nutilised is rapid, requires minimal sample preparation, and is well suited for nuclear forensic 10 \napplications. Precision and accuracy were assessed by replicate analyses of natural uraninite \ngrains: relative uncertainty for 235U\/238U is 0.2 % (2σ), and the mean is in agreement with the \nnatural ratio. A total of 115 uranium-oxide grains were analysed from environmental samples \n(soils and dusts); all of these were depleted uranium (DU) from a factory that produced uranium \narticles. Knowledge of the range of isotope ratios from particles of this controversial contaminant 15 \nhas proven useful when interpreting isotope ratios from bulk samples. Variation of the measured \nisotope signatures reveals details of the history of uranium processing and emissions.\n1. Introduction \nCase-study \nNational Lead Industries (NLI) operated a plant in Colonie \n(NY, USA), from 1958 – 1984. The plant processed uranium \nmetals (depleted uranium and some enriched uranium); \nmanufacturing kinetic energy penetrators (munitions), \ncounterweights and radiation shielding from depleted uranium \n(DU). Scrap metal was combusted in a furnace prior to \ndisposal as uranium-oxide, and this resulted in emissions of \nuranium-oxide particulate to the environment (at times via an \nunfiltered chimney).1 Contamination of the suburban \nenvironment surrounding NLI by depleted uranium is evident \nin air filters, surface soils, reservoir sediments, and the urine \nof former employees and some residents 2-7. \nIt is desirable to know the isotope ratios of the contaminant \nuranium when assessing bulk samples that comprise both \nbackground natural uranium and anthropogenic uranium. \nFurthermore it is possible that the uranium feedstock(s) used \nat NLI varied in isotopic composition. DU particulates from \nair filters collected 15.6 km NNW of NLI in 1979 had variable \nisotopic composition 2. \nWe hypothesise that bulk soil and dust samples aggregate \nparticulates over several decades, and that individual primary \nuranium-oxide grains from these samples each record the \nisotopic composition emitted from NLI during a short interval \nof time. \nThe bulk environmental samples of interest are contaminated \nsoils (silica-rich medium to fine grained mineral sands with \norganic matter) and wind-blown dusts, typically comprising \nup to 500 mg kg-1 anthropogenic uranium, as microscopic \nuranium-oxide particulate in a matrix of natural mineral grains \n(that comprise trace natural uranium, less than 2.2 mg kg-1). \nThe aim of this study is to analyse the isotopic composition(s) \nof a population of anthropogenic uranium-oxide grains on an \nindividual particle basis. \nDepleted Uranium (DU) \nDU is the by-product of nuclear enrichment, and is depleted in \nthe fissile isotope 235U, typically (2 – 3) x10-3 235U\/238U 8. The \natom ratio, 235U\/238U (or n235U\/n238U), of natural uranium has \na traditional consensus value 7.253 x10-3 (1\/137.88) 9, 10, \nrecently recommended as 7.257 x10-3 11-13. However, there is \nevidence of natural isotopic fractionation c. ± 0.009 x10-3 of \nthis value 14, and one known example (Oklo, Gabon) of \nsustained natural fission resulting in 235U depletion 15, 16. \nA useful fingerprint of anthropogenic contamination is the \npresence of 236U, which naturally occurs at negligible \nabundances (in the order of x10-11 – x10-10 236U\/238U 17, 18). In \ncontrast, DU is typically contaminated by up to 3 x10-5 \n236U\/238U from reprocessed uranium 8 †. \n \nFig. 1 Isotope ratios of DU penetrators reported in the literature. \nMeasured by gamma-ray spectrometry: a) Trueman et al. (uncertainties \nfrom counting statistics only) 19; alpha spectrometry: b) McLaughlin et al \n20, c) Pöllänen et al 21, d) Jia et al 22; ICP-MS: e) Desideri 23 \nCREATED USING THE RSC ARTICLE TEMPLATE (VER. 3.0) - SEE WWW.RSC.ORG\/ELECTRONICFILES FOR DETAILS \n \nLloyd, N. S., Parrish, R. R., Horstwood, M. S. A. & Chenery, S. R. N. 2009. Precise and accurate isotopic analysis of \nmicroscopic uranium-oxide grains using LA-MC-ICP-MS. Journal of Analytical Atomic Spectrometry, 24 (6), 752-758. \nFigure 1 shows a range of 236U\/238U and 235U\/238U ratios that \nhave been reported in the literature for DU penetrators. There \nare ranges for both these ratios, but the data are scarce and it \nis not clear if this reflects a continuously variable range, or \ndiscrete batches of DU with distinct isotope signatures. \nFurthermore, it is possible that the isotopic compositions of \nother DU articles are not represented by these data. \nDepleted uranium is also depleted in 234U; literature values for \nDU munitions range (0.64 – 1.1) x10-5 234U\/238U 19-23. \nHowever, the abundance of this isotope is variable in nature \n(in the order of 10-4 – 10-5 234U\/238U) due to alpha recoil \neffects, and 234U\/238U is not a reliable measure of low-level \nanthropogenic contamination 24, 25. \nAnalytical Methods \nRadiometric methods of uranium isotopic analysis include \nalpha and gamma-ray spectrometry. Due to the long half-lives \nof the uranium isotopes, long counting times (days) are \nrequired for precise determination of the minor isotopes. \nFurthermore, alpha spectrometry requires laborious chemical \nseparation of the analyte from its matrix. \nThe high-precision analysis of actinide bearing particles by a \ncombination of fission track analysis and thermal ionisation \nmass spectrometry (FT- TIMS) was described by Dietz 2, and \nis the traditional, but laborious method in nuclear forensics 26. \nFission-track analysis is first used to locate actinide-bearing \nparticles for analysis by TIMS. It is also possible to estimate \n235U\/238U ratios directly by fission-track analysis 27. Fission-\ntrack analysis is time consuming and requires access to \nneutron irradiation facilities. Digital autoradiography 28 or \nenvironmental scanning electron microscopy (SEM) are \nalternatives for particle location. A disadvantage of TIMS is \nthe requirement for careful chemical separation of the analyte, \nwhich may be imperfect and result in poor ionisation and \nhence precision (risky with only a ‘one-shot’ analysis per \nparticle). \nInductively-coupled-plasma mass-spectrometry (ICP-MS) \noffers faster analyses when compared to TIMS, and achieves \ngood precision with multi-collector instruments (MC-ICP-\nMS). However, as for TIMS, particles of interest need to be \nmanipulated and dissolved prior to analysis, and ideally the \nanalyte is chemically separated from its matrix to avoid \nisobaric interferences. Hydride formation is also an issue \nwhen introducing solution samples, e.g. 235U1H on 236U, but \nthis can be minimised by the use of a desolvating nebuliser. \nSecondary ion mass spectrometry (SIMS) has been used in the \nnuclear forensics context for the precise analysis of uranium \nand plutonium isotope ratios directly from particulates 29-31. \nSIMS offers excellent spatial resolution, enabling particle \nlocation and sub-sampling 32. \nMore recently laser ablation ICP-MS (LA-ICP-MS) has been \nused 33-35, a method that also requires only minimal sample \npreparation. Varga 36 applied LA- sector-field single-collector \nICP-MS (LA-SF-SC-ICP-MS) to non-environmental \nmicroscopic grains, demonstrating good agreement with \nsolution SF-SC-ICP-MS, obtaining relative uncertainties (2σ) \nof c. 5 % for 235U\/238U. \nMulti-collector (MC-) ICP-MS offers superior isotope ratio \nmeasurement precision to ICP-MS and SF-SC-ICP-MS, as the \nisotope signals are measured simultaneously and generally \nwith higher sensitivity. This is especially important for laser \nablation, which produces a variable and transient signal. \nBoulyga and Prohaska 37 used a lengthy screening procedure \nto identify six micro-samples from Chernobyl contaminated \nsoils, for analysis by LA-MC-ICP-MS, obtaining relative \nuncertainties (2σ) of 2 – 3 % for 235U\/238U. \nThe major advantage of both SIMS and LA-ICP-MS is that \nparticles of interest can be selectively sampled directly from \nsolid materials, requiring only minimal sample preparation. \nHowever, in practice particles of interest may be very scarce \nin environmental samples. It is therefore desirable to \nconcentrate these particles prior to analysis, and essential to \nlocate them within the sample mount. The sampling volumes \nfor both techniques are small, enabling replicate analyses of \nparticles, or analysis by other methods. \nThe NERC Isotope Geosciences Laboratory (NIGL) are \nexperienced users of LA-MC-ICP-MS for U-Pb dating of \nzircons (trace uranium decay series) from geological samples. \nWe have ‘borrowed’ these sample preparation and analytical \ntechniques for this novel application. To the best of our \nknowledge, this paper demonstrates for the first time, the \napplication of high precision isotope ratio LA-MC-ICP-MS \nanalysis to a large population of individual uranium-oxide \ngrains from environmental samples. \n2. Experimental \nSample Preparation \nSamples \nA dust and a surface soil sample were collected from \nresidential properties within 200 m of the former NLI site. \nAliquots of these materials were analysed by scanning \nelectron microscopy with an energy dispersive X-ray analyser \n(SEM-EDX: Hitachi S-3600N with Oxford Instruments Inca \nx-sight), revealing discrete uranium-oxide particles. Bulk \nuranium concentration and isotopic composition were \nestimated by quadrupole ICP-MS (VG Elemental PQ ExCell \nwith Cetac Technologies Aridus II desolvating nebuliser) after \ntotal dissolution: for the soil 90 ± 9 mg kg-1 uranium, \n(2.1 ± 0.1) x10-3 235U\/238U (2s); and for the dust 385 ± 33 mg \nkg-1 uranium, (2.2 ± 0.1) x10-3  235U\/238U. These isotope ratios \nconfirm that the vast majority of the uranium in these samples \nis from anthropogenic DU contamination. \nPre-concentration \nCREATED USING THE RSC ARTICLE TEMPLATE (VER. 3.1) - SEE WWW.RSC.ORG\/ELECTRONICFILES FOR DETAILS \n \nLloyd, N. S., Parrish, R. R., Horstwood, M. S. A. & Chenery, S. R. N. 2009. Precise and accurate isotopic analysis of \nmicroscopic uranium-oxide grains using LA-MC-ICP-MS. Journal of Analytical Atomic Spectrometry, 24 (6), 752-758. \nTable 1 Methodology for concentrating uranium-oxide grains from soil \nand dust sample, and fractions removed. \nprocess criteria fraction removed \ndry 60 °C moisture \nsieve <250 µm coarse grains \nhand-magnet magnetic magnetite, iron \ndense-liquid \n(di-iodomethane) \nρ  > 3.3 g cm-3 silica and silicates, fine \nparticulate \nisodynamic magnetic \nseparation (Frantz LB-1) \n0.1-1A iron-oxides, some zircons \nsieve 40 µm coarse and fine fractions \n \nThe uranium-oxide particulates were concentrated from the \nbulk samples using the protocol summarized in Table 1. \nDense-liquid (di-iodomethane, ρ 3.3 g cm-3) was used to \nseparate low-density silicates from the bulk samples, \nrecovering dense grains including uranium-oxides \n(ρ 10.96 g cm-3) greater than about 20 µm diameter. \nGrain Mounts \nAliquots of the concentrates were mounted in epoxy resin, \nensuring separation of grains, and then ground and polished to \nreveal cross sections (alternatively, they could be adhered \nwhole to the surface of a suitable mount). The mounts were \nscanned using SEM-EDX to map the uraniferous grains, see \nFigure 2. Sample preparation and the grain mapping are \nmoderately time consuming. However, the methodology does \nproduce robust grain mounts with a good density of \nuraniferous grains, which can be quickly located using the \nlaser ablation system’s optical microscope. \n \nFig. 2 SEM image of a grain mount surface, overlain by uranium EDX \nmap (highlighting uraniferous grains). Uraniferous grain dimensions for \nthis mount range 12 to 82 μm, mean 36 μm. \nSolutions \nSolutions were prepared from uraniferous grains from these \nand two other soil dust samples collected from the vicinity of \nNLI, for comparison with the laser ablation dataset. Spherical \ngrains that appeared metallic or glassy (anthropogenic in \nappearance) under an optical microscope were picked from \nthe concentrates (under ethanol) using fine tweezers, and then \ntransferred to a low-tack adhesive (Glue Dots Repo ™), as \nshown in Figure 3. These mounts were scanned using \nSEM-EDX, but fewer than 1 in 40 proved to be uraniferous \n(the others were mostly lead, tin or lead glass). \n \nFig. 3 SEM (uncoated sample, 20 Pa pressure, back scattered electron) \nimage of a typical uranium-oxide sphere, picked from dust concentrate \n(left). SEM image of a temporary mount, particles with identifiable U Mα \nX-ray peaks from EDX analysis circled (right). \nSEM-EDX analyses show the uraniferous grains were \ntypically comprised of only uranium and oxygen (elemental \nLLD c. 1 %), for this reason, it was not considered necessary \nto chemically separate the uranium from these solutions. \nSubsequent analysis of similar grains shows that they are \ntypically polycrystalline UO2 (unpublished data), and they \noften include cavities. \nTwenty-four uranium-oxide grains were successfully \ntransferred by tweezers into individual pre-leached \nmicro-centrifuge tubes, and then dissolved in ultrapure \ndouble-distilled concentrated nitric acid (within a class 100 \nclean room, typical digest blanks <100 fg U). This method of \nsample preparation is by comparison with the previous, \nrelatively time-consuming. \nAnalysis \nMass Spectrometry \nAnalysis was made using a double-focussing MC-ICP-MS \ninstrument (VG Elemental Axiom), coupled with a \ndesolvating nebuliser (Cetac Technologies Aridus) to reduce \nhydride interference from solutions. Following peak centring, \nlow abundance 236U was measured on a secondary electron \nmultiplier, 235U and 238U on Faraday cups. Abundance \nsensitivity and mass bias were quantified at the start and end \nof each analytical run, using a natural uranium solution \n(U950a). \nSolutions \nThe solutions were diluted in ultrapure 2% HNO3 (aq) to \napproximately 25 ng g-1 uranium. The sample analyses were \nbracketed by analyses of a solution of enriched uranium \nstandard reference material U010 that includes 236U (New \nBrunswick Laboratory). \nLaser Ablation of grain mounts \nThe grain mounts were sampled by laser-ablation (New Wave \nResearch LUV266x), using a c. 25 x 14 µm  spot, 1 Hz \nrepetition rate  at a fluence of c. 68 mJ cm-2 (sufficient to give \na stable signal within detector range). The output from the \ndesolvating nebuliser provided the carrier-gas flow \n(c. 1 l min-1 Ar2) for the ablation cell, and was used for the \nintroduction of solution reference materials U950a and U010 \nat the start and end of each analytical run. \nFor each analysis, two baselines were measured at half-mass \nunits (217.5 and 216.5), well away from the masses of \ninterest, to record a good instrument baseline. The laser \nshutter was opened and the 238U signal monitored until \napproximately stable, prior to acquisition of 30 one-second \nCREATED USING THE RSC ARTICLE TEMPLATE (VER. 3.0) - SEE WWW.RSC.ORG\/ELECTRONICFILES FOR DETAILS \n \nLloyd, N. S., Parrish, R. R., Horstwood, M. S. A. & Chenery, S. R. N. 2009. Precise and accurate isotopic analysis of \nmicroscopic uranium-oxide grains using LA-MC-ICP-MS. Journal of Analytical Atomic Spectrometry, 24 (6), 752-758. \nintegrations. These data were output as the mean and standard \nerror of the mean, after rejection (10%, 2σ). The large volume \n(c. 30 cm3) of the ablation cell attenuates the pulses of sample \nfrom the ablation, and thereby minimises the effects of the \ndetector response delays between Faraday cups and electron \nmultiplier. The 238U signal was then monitored for \napproximately 30 seconds, to allow the passing of ‘spikes’ \nfrom previously ablated material and the return to baseline \nvalues, before the next analysis was started. \nThe ablation protocol used produced irregular conical pits, \napproximate dimensions 25 x 14 x 1 µm in uranium-oxide \nsample grains (measured using SEM and Caminex Enterprises \nAlicona infinite focus microscope). The sampling volume is \nroughly equivalent to a 9 µm diameter uranium oxide sphere, \nor 4 ng uranium. \nAblation of the resin gave negligible 238U detector responses \n(c. 3 x10-5 V using a 1011 ohm resistor, c.f. 1.6 V from typical \nsamples). Sample grains were bracketed by analyses of natural \nuraninite grains for quality control. Of the 115 sample grains, \n68 were analysed in replicate (up to 21 repeats from a single \ngrain). \n \nData Processing \nCorrections were made to the data using U950a as a primary \nreference material: abundance sensitivity (238U on 236U, \nc. 1.2 x10-6); hydride for solutions (238U1H\/238U c. 4 x10-6, \nresulting in 235U1H\/238U on 236U\/238U < 1 x10-8); followed by \nexternal correction for 235U\/238U instrumental response \neffects 38 (approximated by an exponential mass-bias \nfunction 39). A secondary reference material, U010, was used \nto correct for bias between the ion counter and Faraday cups. \nEstimates of uncertainty were propagated from the analytical \nstandard error of the mean (σm) and the relative standard \ndeviations of the corrected primary and secondary reference \nmaterials. \n3. Results \nQuality Control \n \nFig. 4 235U\/238U ratios for natural uraninite grains by LA-MC-ICP-MS, \nfrom four analytical runs. Nine of the data have been used as reference \nmaterials (RM) to correct an observed bias in the second half of run 4. \nNatural uraninite grains were ablated 155 times throughout \nthe four analytical runs for quality control. The data are \npresented in Figure 4 (with 8 outliers removed). Following \nmid-session calibration, the data in the fourth analytical run \ndrift from a significant low bias. Nine of the uraninite data \nhave been used to bracket the remaining sample and quality \ncontrol data for that interval (as a tertiary reference material). \nThese self-corrected data are highlighted in Figure 4, and are \nexcluded from the following quality control statistics. \nThe remaining data (n=138) are normally distributed about an \narithmetic mean 235U\/238U (7.259 ± 0.002) x10-3 (2σm). The \nrelative precision for these data is 0.22 % (2σ). The mean is \nwithin uncertainty of the recently recommended value 12, \nwithin the range of natural variability 14, or slightly biased \nwhen compared to the traditional consensus 9. \nThe mean square weighted deviation (MSWD) for these QC \ndata was 1.2, demonstrating that the propagated uncertainty \nhad probably been slightly underestimated 40. Therefore, the \nuncertainties for 235U\/238U have been expanded by 0.1 %. \nA sample grain (of unknown composition), analysed in \nreplicate during one analytical run (2 outliers excluded, n=21) \nhas an MSWD of 1.6 for 235U\/238U; demonstrating that the \nexpanded uncertainties are reasonable. For 236U\/238U, an \nMSWD of 2.6 suggests the uncertainties were underestimated; \ntherefore, they have been expanded by 2 %.  \nThe relative expanded uncertainties (2σ) for the sample grain \ndata-points, range from 0.2 – 1.8 % for 235U\/238U, 2.3 – 4.0 % \nfor 236U\/238U, with medians of 0.4 and 2.7 % respectively. \nCompared to the uraninite grains, the sample grains have \nlower 235U\/238U, and their ablation is more variable and hence \nsignal, resulting in slightly poorer precisions. \nData \nThe analytical data for the laser ablation of uranium-oxide \ngrains are presented in Figure 5A, alongside those from \nanalyses of solutions. The solution data show a similar spread \nof isotopic compositions to the laser ablation data. All these \ndata are expressed as atom ratios. \nFigure 5B shows the data for soils and dusts, and the spread of \nisotopic compositions from these samples are similar. \nParticle-solution exchange in the wet soil environment does \nnot explain the spread of data. \n4. Discussion \nCase-study Interpretation \nThe data confirm the hypothesis that the individual particles \nof uranium-oxide record a variety of anthropogenic isotopic \ncompositions, which are averaged in bulk soil and dust \nsamples.  \nAll of the uranium-oxide grains analysed are from DU, with \n235U\/238U less than 2.4 x10-3. Enriched uranium grains were \nnot observed; these may be very scarce as comparatively little \nenriched uranium was handled by NLI, and it may have been \nrecycled because of its value. Enriched uranium was evident \nin one former employee’s urine 6, implying dispersal of some \nof this material within the plant and possibly further afield. \nNLI reduced uranium tetrafluoride  (UF4, greensalt) feedstock \nduring the 1960s and ‘70s 1 ‡, these may have been from \ndiscrete batches with distinct isotope signatures, or an \nevolving series of isotopic compositions. A number of \nCREATED USING THE RSC ARTICLE TEMPLATE (VER. 3.1) - SEE WWW.RSC.ORG\/ELECTRONICFILES FOR DETAILS \n \nLloyd, N. S., Parrish, R. R., Horstwood, M. S. A. & Chenery, S. R. N. 2009. Precise and accurate isotopic analysis of \nmicroscopic uranium-oxide grains using LA-MC-ICP-MS. Journal of Analytical Atomic Spectrometry, 24 (6), 752-758. \nprocesses at NLI could also have mixed these isotopic \ncompositions: feedstock storage, reduction to uranium metal \n(derby), castings, machining, shop-floor debris, scrap storage, \nand finally chip burning (conversion) in the furnace releasing \nuranium-oxide particulates to the environment. \nThere is a large spread in 236U abundance, with a reasonably \nwell defined mixing-line from (5 – 31) x10-6 236U\/238U. These \ndata range from (2.05 – 1.99) x10-3 235U\/238U with increasing \n236U\/238U. The data cluster around 2.7 x10-5 236U\/238U, \n2.0 x10-3 235U\/238U. We interpret these ratios to follow either a \nmixing line between two isotopically discrete batches, or an \nevolving series of compositions. The former hypothesis seems \nless likely, as there does not appear to be a second cluster. \nThere is a scatter of ratios up to 5 x10-5 236U\/238U, and up to \n2.4 x10-3 235U\/238U. These ratios are explained by \ninhomogeneous mixing (possibly in the NLI conversion \nfurnace) of a continuation of the previous trend with a third \ncomponent of slightly less depleted uranium. This \nhypothesised process also appears to affect some of the grains \nfrom the clustered region (Figure Aii), drawing them away \nfrom the mixing line. \n \n \n \nFig. 5Ai Isotopic compositions from LA- and solution MC-ICP-MS of individual grains. A mixing line passes through the data up to 3 x10-5 236U\/238U (Aii \nexpansion of clustered region showing some deviation of, and scatter away from a simple mixing line). B Comparison between analyses of grains from \nsoil and dust samples, showing similar distributions of isotopic compositions.\nTwo grains have distinct isotope signatures with (1.5 –\n1.6) x10-3 235U\/238U, and (3.2 – 3.3) x10-5 236U\/238U. The \nscarcity of these grains suggests that this was a small batch, or \nthat little was released due to improvements in stack filtration. \nThe isotope signatures revealed by this study are not \nconstrained with respect to age, except for four particles \nCREATED USING THE RSC ARTICLE TEMPLATE (VER. 3.0) - SEE WWW.RSC.ORG\/ELECTRONICFILES FOR DETAILS \n \nLloyd, N. S., Parrish, R. R., Horstwood, M. S. A. & Chenery, S. R. N. 2009. Precise and accurate isotopic analysis of \nmicroscopic uranium-oxide grains using LA-MC-ICP-MS. Journal of Analytical Atomic Spectrometry, 24 (6), 752-758. \ncollected by air filters in April and May 1979 and analysed by \nFT-TIMS 2 (Figure 6). These ratios fit into the scattered \nregion of out dataset, and support the continuation of the trend \nof increasing 236U to at least 6 x10-5 236U\/238U. These are most \nlikely to have been from emissions at that time. However, the \nscrap metal may have accumulated for several months before \nconversion. The isotopic compositions of the uranium \nmaterials processed by NLI appear to have been more variable \nduring this period. \nIt was reported that in 1980, 150 drums of waste uranium had \naccumulated over several months, and nearly 2 tonnes were \nconverted to oxide in March and April of that year, with the \nrelease of only 7.5 g of uranium, thanks to operation of, and \nimprovements to a filtration system, following enforcement \naction 41. Extensive uranium contamination of soils is evident \nby 1980 3, estimated in the order of 5 tonnes uranium \ndeposited on soils within 1 km2  6. The vast majority of the \ncontamination from NLI pre-dates 1980, therefore the sample \ngrains analysed in this study probably also pre-date 1980. \nBased on the number of grains loosely tied to 1979 (c. 20%), a \nsignificant portion of the contamination appears to have been \nemitted during that period. \nWe speculate that the feedstock received by NLI evolved \nthrough a series of compositions, from 2.05 x10-3 235U\/238U \nwith minor 236U contamination (<5 x10-6 236U\/238U), to \n1.99 x10-3 235U\/238U with 3 x10-5 236U\/238U. Subsequently, and \nby 1979, the primary NLI feedstock evolved to at least 6 x10-5 \n236U\/238U, but during that time ‘less depleted’ uranium was \nalso used. Continued depletion at the gaseous diffusion plant \nof uranium comprising 2 x10-3 235U\/238U, 4 x10-5 236U\/238U \ncould result in the isotope ratios of the most depleted \nuranium-oxide grains analysed. These interpretations are \nsummarised in Figure 6. \nA chronology for these data could be established using \n230Th\/234U, 231Pa\/235U or possibly 232Th\/236U dating of \nparticles. The measurements would be technically \nchallenging; with daughter radionuclides in the sub-\nfemtogram range per grain (and are dependent on initial \nuranium separation). Uranium dating by 230Th\/234U using ICP-\nMS has been successfully demonstrated by Varga and Surányi \n42, but improvements in sensitivity would be required for the \ndating of individual grains. \n \nFig. 6 Speculative explanation of the isotope ratios measured for this \ncase-study. The solid arrow shows the primary NLI feedstock evolving \nwith increasing 236U contamination. A possible secondary feedstock \nfollows the dashed arrow with increasing 235U depletion at the gaseous \ndiffusion plant, leading to the most depleted grains. A scatter of isotopic \ncompositions within the dotted triangular region can be explained by \ninhomogeneous mixing with ‘less depleted’ uranium batch(es). The \ntiming is loosely tied by four particles collected by air filters in April and \nMay 1979 2. A larger dataset could resolve these details. \nThe spread of 235U\/238U isotope ratios revealed by this study is \nmatched by those in Figure 1, but we are able to resolve more \ninformation from this large and precise dataset. Some of these \nDU grains comprise more 236U than previously reported. \nThese data show that at least some of the DU processed at \nNLI had low levels of 236U. Therefore, 236U cannot be used as \na defining fingerprint of DU contamination if, as for \nquadrupole ICP-MS, the lower limit of detection of the \nanalytical technique approaches these ratios. \nAnalytical Methodology \nLaser ablation allows for the rapid collection of data, when \ncompared to TIMS or solution ICP-MS. A typical sample \ngrain analysis took less than two minutes, and the \ninstrumental productivity (including set-up, reference \nmaterials, and particle location), was around 16 minutes per \nsample grain. Modern MC-ICP-MS systems offer faster set-up \ntimes, which could further improve productivity.  \nPre-concentration of particles of interest using dense liquid \nseparation was quick and effective, and allows for efficient \nanalysis by laser ablation (or SIMS). However, the \nmethodology does bias the sample by excluding particulates \nand grains smaller than approximately 20 µm. Smaller grains \ncould be recovered using heavy-liquids with centrifugation 43, \nfroth-floatation 44, or inertial separation. Alternatively raw \nsamples may be analysed, but requiring more time searching \nfor the grains of interest and exchanging sample mounts. It is \nnot necessary to embed and polish the particles; they could be \nadhered to a mount with a clean adhesive, or sampled directly \nfrom a swipe sample. \nCREATED USING THE RSC ARTICLE TEMPLATE (VER. 3.1) - SEE WWW.RSC.ORG\/ELECTRONICFILES FOR DETAILS \n \nLloyd, N. S., Parrish, R. R., Horstwood, M. S. A. & Chenery, S. R. N. 2009. Precise and accurate isotopic analysis of \nmicroscopic uranium-oxide grains using LA-MC-ICP-MS. Journal of Analytical Atomic Spectrometry, 24 (6), 752-758. \nThe volume of sample consumed per analysis is small when \ncompared to the volume of the grains of interest, and allows \nfor replicate analyses. The sampling area is similar to the \nextent of the grains presented on the mount surface. Smaller \nparticles can be analysed, when sufficiently separated from \neach other, as the uranium content of the resin is \nindistinguishable from detector noise. However, there is \npotential for minor additional 235U1H formation with hydrogen \nliberated from the epoxy resin. Clean mounting material \nwould be necessary for fine particulates, for example carbon \nplanchets. Modern laser systems can also achieve better \nspatial resolution. \nAn observed bias in the quality control data for part of one \nanalytical run was corrected by using some of these data as a \ntertiary standard. There are variations in the uraninite data, \nand the uncertainties were slightly underestimated, both of \nwhich can also be explained by changes in instrument bias \nbetween external corrections. This demonstrates the need for \nmore frequent monitoring, preferably by laser ablation of a \nsolid reference material that includes 236U (e.g. New \nBrunswick Laboratory U005-A). These minor issues were not \nsignificant to our interpretations of the sample data. \nAccuracy was demonstrated by repeat analyses of natural \nuraninite grains; the mean value agrees with the ‘natural \nratio’. Relative precision over four analytical runs of 0.2 % \n(2σ) for 235U\/238U is better or at least comparable to the \ncurrent methodologies used for nuclear forensic applications. \nRelative uncertainties (2σ) for the sample grains ranged \nbetween 0.2 – 1.8 % for 235U\/238U, and 2.3 – 4.0 % for \n236U\/238U. The precision of this method was more than \nadequate to resolve differences in the isotopic composition of \nmicroscopic grains of DU-oxide. \nThe precision of LA-MC-ICP-MS compares favourably with \nLA-SF-SC-ICP-MS 36, and is similar for SIMS analyses of \nparticles from environmental samples 29, 31. It is hard to judge \nfrom the literature that achieved by FT-TIMS, although TIMS \nmay offer better analytical precision. However, our method \nallows the acquisition of large datasets that may be more \nrepresentative of the samples, the precision is fit-for-purpose, \nand appears to be a significant way forward for nuclear \nforensics. For this case-study, a larger dataset could resolve \nfurther details regarding the history of uranium processing at \nNLI (perhaps twice as large, and including sample from other \nlocations for representativity). \n5. Conclusions \nWe have demonstrated the use of LA-MC-ICP-MS to rapidly \nanalyse a large population of microscopic uranium-oxide \ngrains for an environmental case-study. It is clear from these \nand other data that the isotopic compositions of depleted \nuranium are variable, especially with respect to 236U. \nThe accuracy and precision analysing 235U\/238U for natural \nuranium was excellent. Typical relative uncertainties (2σ) of \n0.4% for 235U\/238U and 2.7 % for 236U\/238U, are well-suited to \nnuclear forensic applications, and are an improvement over \nsingle-collector (quadrupole or sector-field) LA-ICP-MS. LA-\nMC-ICP-MS offers several advantages to nuclear forensics, \nincluding fast analysis time, minimal sample preparation, and \npartial ablation of the sample. \nAcknowledgements \nThis study is sponsored by the British Geological Survey and \nthe NERC Isotope Geosciences Laboratory. The authors \nwould like to thank Tim S. Brewer RIP, Mark A. Purnell a, \nJennifer M. Bearcock c, Adrian K. Wood b and John G. \nArnason for their assistance. \nIn memoriam Leonard A. Dietz: an inspiration to this study as \na pioneer of early TIMS and electron multiplier technologies. \nHe highlighted the contamination of the environment by NLI \nin 1979, and latterly campaigned against DU munitions. \nThis paper is published with the permission of the Director of \nthe British Geological Survey. \nNotes and References \na University of Leicester, Department of Geology, University Road, \nLeicester, LE1 7RH, UK. E-mail: nsl3@le.ac.uk \nb NERC Isotope Geosciences Laboratory, Kingsley Dunham Centre, \nKeyworth, Nottingham, NG12 5GG, UK. E-mail: rrp@bgs.ac.uk, \nmsah@bgs.ac.uk \nc British Geological Survey, Kingsley Dunham Centre, Keyworth, \nNottingham, NG12 5GG, UK. E-mail: srch@bgs.ac.uk \nSample data are available from the RSC’s Electronic Supplementary \nInformation (ESI) service at: www.rsc.org\/XXXXX. \n† The source of 236U contamination is from reprocessed uranium (neutron \ncapture on 235U in nuclear power or production reactors). Reprocessed \nuranium can comprise up to 0.5 % 236U 26, typically 0.4 - 0.6 % 236U 45, \nwhich when enriched would produce by-product DU in the order of a part \nper thousand 236U, with 236U concentrated in the enriched uranium. For \nDU with 3 x10-5 236U, the source of 236U is either cross-contamination via \nenrichment-plant machinery, or blending of virgin uranium with \nreprocessed uranium, on the order of a percent reprocessed uranium. \nPresumably the level of contamination depends on the nuclear enrichment \nfacilities’ history of handling reprocessed uranium. Civilian uranium \nreprocessing in the USA ceased in 1977 45, therefore the abundance of \n236U in recently produced DU is likely to be lower. \n‡ It is not clear where the DU feedstock for NLI was sourced. A DoE \npress release 46 identifies 11 US sites that handled reprocessed uranium, \nincluding 3 gaseous diffusion enrichment plants (Oak Ridge, TN; \nPuducah, KY; Portsmouth, OH) and 1 uranium hexafluoride reduction \nfacility (Fernald, OH). If Fernald produced the UF4 for NLI, it seems \nlikely that the UF6 was supplied from neighbouring Portsmouth. \n \n1. ATSDR, Health Consultation: Colonie Site, Agency for Toxic \nSubstances and Disease Registry, Atlanta, USA, 2004. \n2. L. A. Dietz, Investigation of Excess Alpha Activity Observed in \nRecent Air Filter Collections and Other Environmental Samples, \nLetter CHEM-434-LAD, Knolls Atomic Power Laboratory, General \nElectric Company, Schenectady, NY, USA, 1980. \n3. H. W. Jeter and D. M. Eagleson, A survey of uranium in soils \nsurrounding the NL Bearings Plant, Report IWL-9488-461, Teledyne \nIsotopes, Westwood, NJ, 1980. \n4. J. G. Arnason and B. A. Fletcher, Environ. Pollut., 2003, 123, 383-\n391. \n5. D. Lo, R. L. Fleischer, E. A. Albert and J. G. Arnason, J. Environ. \nRadioact., 2006, 89, 240-248. \n6. R. R. Parrish, M. Horstwood, J. G. Arnason, S. Chenery, T. Brewer, \nN. S. Lloyd and D. O. Carpenter, Sci. Total Environ., 2008, 390, 58-\n68. \n7. N. S. Lloyd, R. R. Parrish, S. R. Chenery and J. G. Arnason, \nGeochim. Cosmochim. Acta, 2008, 72, A566. \nCREATED USING THE RSC ARTICLE TEMPLATE (VER. 3.0) - SEE WWW.RSC.ORG\/ELECTRONICFILES FOR DETAILS \n \nLloyd, N. S., Parrish, R. R., Horstwood, M. S. A. & Chenery, S. R. N. 2009. Precise and accurate isotopic analysis of \nmicroscopic uranium-oxide grains using LA-MC-ICP-MS. Journal of Analytical Atomic Spectrometry, 24 (6), 752-758. \n8. A. Bleise, P. R. Danesi and W. Burkart, J. Environ. Radioact., 2003, \n64, 93-112. \n9. R. H. Steiger and E. Ja ̈ger, Earth Planet. Sci. Lett., 1977, 36, 359-\n362. \n10. K. J. R. Rosman and P. D. P. Taylor, J. Phys. Chem. Ref. Data, 1998, \n27, 1275-1287. \n11. S. Richter, A. Alonso, W. De Bolle, R. Wellum and P. D. P. Taylor, \nInt. J. Mass Spectrom., 1999, 193, 9-14. \n12. J. R. De Laeter, J. K. Böhlke, P. De Bièvre, H. Hidaka, H. S. Peiser, \nK. J. R. Rosman and P. D. P. Taylor, Pure Appl. Chem., 2003, 75, \n683-800. \n13. S. Richter, A. Alonso-Munoz, R. Eykens, U. Jacobsson, H. Kuehn, \nA. Verbruggen, Y. Aregbe, R. Wellum and E. Keegan, Int. J. Mass \nSpectrom., 2008, 269, 145-148. \n14. S. Weyer, A. D. Anbar, A. Gerdes, G. W. Gordon, T. J. Algeo and E. \nA. Boyle, Geochim. Cosmochim. Acta, 2008, 72, 345-359. \n15. R. Bodu, H. Bouzigues, N. Morin and J. P. Pfiffelmann, C. R. \nSeances Acad. Sci., Ser. D, 1972, 275, 1731-1732. \n16. M. Neuilly, J. Bussac, C. Frèjacques, G. Nief, G. Vendryes and J. \nYvon, C. R. Seances Acad. Sci., Ser. D, 1972, 275, 18471849. \n17. X. L. Zhao, M. J. Nadeau, L. R. Kilius and A. E. Litherland, Nucl. \nInstrum. Methods Phys. Res., Sect. B, 1994, 92, 249-253. \n18. D. Berkovits, H. Feldstein, S. Ghelberg, A. Hershkowitz, E. Navon \nand M. Paul, Nucl. Instrum. Methods Phys. Res., Sect. B, 2000, 172, \n372-376. \n19. E. R. Trueman, S. Black and D. Read, Sci. Total Environ., 2004, 327, \n337-340. \n20. J. P. McLaughlin, L. L. Vintro, K. J. Smith, P. I. Mitchell and Z. S. \nZunic, J. Environ. Radioact., 2003, 64, 155-165. \n21. R. Pöllänen, T. K. Ikäheimonen, S. Klemola, V.-P. Vartti, K. \nVesterbacka, S. Ristonmaa, T. Honkamaa, P. Sipilä, I. Jokelainen, A. \nKosunen, R. Zilliacus, M. Kettunen and M. Hokkanen, J. Environ. \nRadioact., 2003, 64, 133-142. \n22. G. Jia, M. Belli, U. Sansone, S. Rosamilia and S. Gaudino, J. \nRadioanal. Nucl. Chem., 2004, 260, 481-494. \n23. D. Desideri, M. A. Meli, C. Roselli, C. Testa, S. F. Boulyga and J. S. \nBecker, Anal. Bioanal. Chem., 2002, 374, 1091-1095. \n24. R. L. Fleischer, Geochim. Cosmochim. Acta, 1982, 46, 2191-2201. \n25. R. L. Fleischer, Health Phys., 2008, 94, 292-293. \n26. D. L. Donohue, J. Alloys Compd., 1998, 271-273, 11-18. \n27. O. Stetzer, M. Betti, J. Van Geel, N. Erdmann, J. V. Kratz, R. \nSchenkel and N. Trautmann, Nucl. Instrum. Methods Phys. Res., Sect. \nA, 2004, 525, 582-592. \n28. C. J. Zeissler, Nucl. Instrum. Methods Phys. Res., Sect. A, 1997, 392, \n249-253. \n29. M. Betti, G. Tamborini and L. Koch, Anal. Chem., 1999, 71, 2616-\n2622. \n30. G. Tamborini, Microchim. Acta, 2004, 145, 237-242. \n31. F. Esaka, M. Magara, C. G. Lee, S. Sakurai, S. Usuda and N. \nShinohara, Talanta, 2009, 78, 290-294. \n32. X. Hou, W. Chen, Y. He and B. T. Jones, Applied Spectroscopy \nReviews, 2005, 40, 245-267. \n33. J. S. Becker, Int. J. Mass Spectrom., 2005, 242, 183-195. \n34. Z. Stefánka, R. Katona and Z. Varga, J. Anal. At. Spectrom., 2008, \n23, 1030-1033. \n35. J. S. Becker, H. Sela, J. Dobrowolska, M. Zoriy and J. S. Becker, Int. \nJ. Mass Spectrom., 2008, 270, 1-7. \n36. Z. Varga, Anal. Chim. Acta, 2008, 625, 1-7. \n37. S. F. Boulyga and T. Prohaska, Anal. Bioanal. Chem., 2008, 390, \n531-539. \n38. C. P. Ingle, B. L. Sharp, M. S. A. Horstwood, R. R. Parrish and D. J. \nLewis, J. Anal. At. Spectrom., 2003, 18, 219-229. \n39. W. A. Russell, D. A. Papanastassiou and T. A. Tombrello, Geochim. \nCosmochim. Acta, 1978, 42, 1075-1090. \n40. I. Wendt and C. Carl, Chem. Geol., 1991, 86, 275-285. \n41. D. J. Romano, in Governor's Task Force on NL, N.Y.S. Department \nof Environmental Conservation, Albany, NY, USA, 1982. \n42. Z. Varga and G. Surányi, Anal. Chim. Acta, 2007, 599, 16-23. \n43. K. J. Henley, Am. Mineral., 1977, 62, 377-381. \n44. US Pat., 4830738, 1989. \n45. World Nuclear Association, Processing of Used Nuclear Fuel for \nRecycle http:\/\/www.world-nuclear.org\/info\/inf69.html, Accessed \n02\/09\/2008. \n46. DoE, Past Recycled Uranium Programs Under Review as Energy \nDepartment Investigation Continues, http:\/\/www.ne.doe.gov\/home\/9-\n29-99.html, Accessed 02\/09\/2008. \n"}