{"doi":"10.1109\/VETECS.2007.292","coreId":"102165","oai":"oai:epubs.surrey.ac.uk:1614","identifiers":["oai:epubs.surrey.ac.uk:1614","10.1109\/VETECS.2007.292"],"title":"A cross-layer approach for packet scheduling in reliable multicast data transmission over geostationary satellite networks","authors":["Sali, A","Acar, G","Evans, B"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-01-01","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1614<\/identifier><datestamp>\n      2017-10-31T14:02:31Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:63637372<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1614\/<\/dc:relation><dc:title>\n        A cross-layer approach for packet scheduling in reliable multicast data transmission over geostationary satellite networks<\/dc:title><dc:creator>\n        Sali, A<\/dc:creator><dc:creator>\n        Acar, G<\/dc:creator><dc:creator>\n        Evans, B<\/dc:creator><dc:date>\n        2007-01-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1614\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Sali, A, Acar, G and Evans, B  (2007) A cross-layer approach for packet scheduling in reliable multicast data transmission over geostationary satellite networks   2007 IEEE 65TH VEHICULAR TECHNOLOGY CONFERENCE, VOLS 1-6.  pp. 1395-1399.      <\/dc:identifier><dc:relation>\n        10.1109\/VETECS.2007.292<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1614\/","10.1109\/VETECS.2007.292"],"year":2007,"topics":[],"subject":["Article","PeerReviewed"],"fullText":" Abstract— In this paper, we propose a channel-aware scheduling \nalgorithm that exploits the reported Channel State Information \n(CSI) from all users in the multicast group for reliable transmission \nof multicast information over a geostationary satellite network. \nReliability is guaranteed via a multicast transport protocol that \nretransmits lost segments to the multicast group. The proposed \nscheduling mechanism uses cross-layer CSI before making a \ndecision whether or not a data segment is to be transmitted. As \nsuch, the algorithm avoids unfavourable channel conditions to \nreduce the forward link resources that would be wasted to \nretransmit lost segments. Scheduling delay and retransmission \ndelay are found to be the elements of a trade-off, and simulations \nare conducted to attain optimal algorithm parameters to minimize \nsession transfer delay in the face of L-band mobile channel \nconditions. \n \nIndex Terms— cross-layer design, channel-state-information, \npacket scheduling, geostationary satellite networks \nI. INTRODUCTION \nesearch on cross-layer design has recently attracted  \nsignificant interest. Cross-layer design suggests (possibly \njoint) adaptation of protocol mechanisms at various \nlayers according to the information collected at other layers of \nthe communication system. Recent growth of heterogeneous \nnetworks entails adaptive mechanisms. In this frame, a cross \nlayer approach would be more effective and flexible. In wireless \nsystems where both radio resources and power are strictly \nconstrained, resource optimisation is needed when such \noptimisation is not guaranteed by the current layered protocol \nstack. For an instance, in [1], to achieve efficient resource \nallocation, channel variations and traffic burstiness information \nare exploited resulting significant increase in resource \nutilisation. In [2], the scheduling information in medium access \ncontrol (MAC) layer is merged with rate selection in \nphysical\/link (PHY\/LINK) layer. The mechanism interestingly \n                                                        \n \nrelies on a low-complexity 1-bit ACK\/NACK feedback signal \nfrom receivers indicating the correct reception\/failure of the \nsegment in downlink transmission. In [3], cross-layer design for \nmultiuser scheduling at the data link layer is developed where \neach user employs adaptive modulation and coding (AMC) \nscheme at PHY layer.  \n \nII. MULTICAST TRANSMISSION OVER SATELLITE \nNETWORKS \nIn transmission of multicast data from a satellite to N direct \nreceivers, repeated retransmission process due to bad channel \ncondition may exhaust the forward link capacity. This problem \nis exacerbated for large multicast groups. In order to \ncountermeasure this problem, we propose a channel-aware \npacket scheduling algorithm on the forward link that exploits \ntime-varying channel variations to reduce the number of \nretransmissions.  \nThe reference system in this study is based on a L-Band \ngeostationary satellite network similar to Inmarsat BGAN \n(Broadband Global Area Network) TDMA-based system as \ndepicted in Figure 1. The packet scheduler is at the Radio \nNetwork Controller (RNC) and a geostationary satellite relays \nthe multicast information to all multicast users through Multicast \nTerminals (MT) and Terminal Equipment (TE).  \nWe assume that multicast reliability is achieved via a \nmulticast transport protocol with a retransmission strategy that is \nbased on StarBurst MFTP (Multicast File Transfer Protocol) [5]. \nIn the reference model, the satellite-receivers links form one-to-\nmany (star-based) reliable multicast protocol. More specifically, \nthrough this higher layer protocol, we assume that a multicast \nfile is transmitted to all multicast group members in its entirety. \nIn response, the receivers send feedback messages for lost \nsegments. Subsequent passes may be initiated by the multicast \nserver to retransmit the lost segments. Note that MFTP allows \nretransmissions of lost segments only after the end of current \npass of segments.   \nR \nA Cross-layer Approach for Packet Scheduling \nin Reliable Multicast Data Transmission over \nGeostationary Satellite Networks \nA. Sali, G. Acar, B. Evans\nCenter for Communication Systems Research (CCSR),  \nUniversity of Surrey, \nGU2 7XH Guildford, \nUnited Kingdom. \n1550-2252\/$25.00 ©2007 IEEE  1395\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 12, 2010 at 06:15 from IEEE Xplore.  Restrictions apply. \nService \nProvider R NC \nPSTN\n \nInternet\n \nMT \n  \nMT \n  TE   \nTE \n  \nUser\/ Subscriber  \ncontent \nSatellite O perator \n \nFigure 1 Reference system architecture \n \nIII. CHANNEL MODEL \nWe consider a two-state semi-Markov model [4], that \nalternates between a ‘good’ state representing LOS (Line-Of-\nSight) areas and a ‘bad’ state representing shadowed areas. The \nsojourn time spent in the LOS state follows power law \ndistribution. The duration in the shadowed state follows a \nlognormal distribution. The semi-Markov model parameters are \ndisplayed in Table I.  \n \nTABLE I CHANNEL MODEL PARAMETERS \nµ Open (LOS) Shadowed Prop. \nType \n \nk P01 P02 \n \nσ  \nβ \n \nχ \n \nα \n \nδ \n1 2.00 3.50 3.00 2.7 0.88 0.61  2.68 1.45 \n2 2.00 2.75 4.00 3.1 0.21 0.58 0.22 0.12 \n3 5.01 3.25 1.75 0.8 0.12 0.84 0.22 1.22 \n4 1.00 3.00 4.00 0.4 0.83 0.66 3.14 1.33 \n \nPropagation environment of type r, termed as PTr, represent \nthe channel environment of multicast users. PT1 and PT4 are \nsuburban environments whereas PT2 and PT3 are wooded \nenvironment. PT1 is in higher elevation angle compared to PT4. \nThe durations of non-fade (LOS) and fade for all propagation \ntypes are controlled by parameters β, χ, α and δ in Table I. From \n[4], the duration of the open area LOS in suburban environments \ndecrease slightly with decreasing elevation angle while for PT2 \nand PT3, which are wooded environment, the durations of open \narea state are significantly smaller than in suburban areas. The \nmobility level for all users is fixed throughout the multicast \nsession. From the fixed mobility, the (non)fade duration in \nseconds are found to be larger than one RTT. In other words, the \nvalue of reported CSI remains constant during update and \ntransmission period.  \n \nIV CHANNEL-AWARE SCHEDULING ALGORITHM \nThe considered scenario is a point-to-multipoint network \nbetween a satellite and N direct receivers. A file of size F is \ndivided into D number of segments. Each segment p is fixed to \nL bits. Prior to downlink transmission for each segment p, the \nRNC shall decide whether to delay or to transmit the segment \naccording to the collected CSI parameters from all users. At this \npoint it is proposed that the most recent Channel State \nInformation (CSI) from all users in the multicast group is \nperiodically collected. The CSI parameter, which is the segment \nerror rate for user j, termed as P0j, from all users in the group is \nupdated periodically. CSI information is time varying and \nuncorrelated among the users in the group. From this input, \nprobability of retransmission for segment i at frame n for users \nj={1,..,N} is calculated:  \n \n ∏\n=\n−−=\nN\nj\nojRtx nPnP i\n1\n))(1(1)(ˆ    (1) \n \nand compared with QoS parameter P0 which can be regarded as \na tolerable upperbound segment error rate for any particular user \nj in the form of upperbound probability of retransmission \n \n NT PP )1(1 0−−=    (2) \n \nThe value of RtxPˆ  is compared with ( )TPM × where M is a \ndesign parameter. Based on this comparison, if the estimated \nRtxPˆ  for segment i at frame n is less than (M×  PT), \n \n TRtx PMP ×≤ˆ     (3) \n \nthen the segment i will be transmitted. Otherwise, the segment \nwill be delayed for 1 slot to wait for relatively good CSI \nparameter for all users.  \nTo find optimum value of M, referred as MOpt, simulation \nresults of File Transfer Delay (FTD) against M is analysed. MOpt \nis recorded when FTD is minimum. FTD is defined as session \ndelay measured from the first segment of the file assigned to the \nscheduler until the last (re)transmitted segment is successfully \nreceived by all users, including scheduling delay and \nretransmission delay. Note that in this definition, \nretransmissions of lost segments have to wait until after the end \nof current pass of segments as outlined by the higher layer \ntransport protocol. The calculation of FTD is as below: \n \nFTD SchSlot TRTTkMaxTNSRD +×+×+= )())((  (4) \n \nwhere FTD is measured in seconds, D is number of segments in \na file, NSR is total number of segments retransmitted throughout \nthe session, TSlot is slot size in seconds, kMax is total number of \nretansmissions, RTT is round-trip-time delay which is set to \n800ms and TSch is scheduling delay measured in seconds. \n \n \n \n \n 1396\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 12, 2010 at 06:15 from IEEE Xplore.  Restrictions apply. \nV CHANNEL-AWARE SCHEDULING IN HOMOGENEOUS \nENVIRONMENT \nA scenario of homogeneous environment, where N number of \nusers in one propagation type throughout the multicast session \nare simulated. In Figure 2, propagation type 2 for P0= 0.01 is \nsimulated, with defined channel parameters in Table I for N=60 \nand D=800 segments. From the figure, it is observed directly \nthat the value of M is 0.14 when FTD is minimum, i.e., \nMOpt=0.14.  \nFig. 2 Simulation result of FTD vs M \n \nResults for other propagation types are tabulated and recorded \nin Table II. The value of P0 is set to P01 and P02 taking the values \nof 0.01 and 0.001, respectively. The four propagation types from \nTable I for P0=P02 are termed as Propagation Type 1, 2, 3, 4 and \nthe same propagation types with P0=P01 are named as \nPropagation Type 5, 6, 7, 8.  File size of 800 segments is chosen \nsince it is noted that other file sizes give approximately the same \nvalues of MOpt although the FTD values increase with number of \nsegments. For higher number of users, the values of MOpt and \nTRtx PP \/ is expected to increase as will be proven in numerical \nanalysis later. \nTABLE II VALUES OF ξ, MOpt AND \nT\nRtx\nP\nP\n  \nFile size=800 Segments \nPr\nop\n. T\nyp\ne \nMOpt  \n(from sim.) \nTRtx PP \/  \n(from \ncalculation) \nξ=\nTRtx\nOpt\nPP\nM\n\/\n \n1 0.72 0.72 1.00 \n2 1.05 1.03 1.02 \n3 0.20 0.20 0.99 \n4 0.08 0.08 1.00 \n5 0.19 0.19 1.01 \n6 0.14 0.14 1.00 \n7 0.05 0.05 1.03 \n8 0.65 0.65 1.00 \n \nTo analyze MOpt, the statistics of measured P0j are recorded \nand it is observed that the value of MOpt is related to TRtx PP \/ , \nwhere )1(1 0 jRtx PP −−= and jP 0  is average value of P0j for a \nparticular propagation type. Thus, equality  \n \n MOpt=ξ ×\nT\nRtx\nP\nP              (5) \n \nis formulated where ξ is a coefficient to fit the linear \nrelationship. From Table II, an important result is observed, \nwhere the value of ξ is very close to 1 regardless of propagation \ntypes and file size. \nFrom this observation, the linear equation is reduced to \n \n \nN\nN\nj\nT\nRtx\nOpt\nP\nP\nP\nPM\n)1(1\n)1(1\n0\n0\n−−\n−−\n==                                  (6) \n \nwhere ∑\n=\n=\nN\nj\njj PN\nP\n1\n00\n1 . From inequality (3) and equation (6), \nwhere the value of M is taking MOpt, it is noted that inequality \n(3) becomes  \n \nN\nojRtx PP )1(1ˆ −−≤                                                      (7) \n \nwhen NjTOpt PPM )1(1 0−−=× where 1-(1- P 0j)\nN on the right \nhand side of the inequality is the expected probability of \nretransmission. From Figure 3 the expected probability of \nretransmission increases with average P0j and number of users N.  \nIn general, a multicast group with large number of users in \nrelatively poor channel condition has a higher probability of \nretransmission. For this scenario, the scheduling algorithm shall \ndelay the segment until the inequality is satisfied.  \n10−4 10−3 10−2 10−1 100\n0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1\nPoj\nEx\npe\nct\ned\n P\nRt\nx \n \n \nN=50\nN=100\nN=200\n \nFig. 3 The expected probability of retransmission vs P0j \n \nV CHANNEL-AWARE SCHEDULING IN MIXED ENVIRONMENTS \nThe algorithm in (7) is validated in mixed environments \nwhere users are spread around different propagation types. Three \nscenarios are simulated according to Table III where NPTr is \n 1397\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 12, 2010 at 06:15 from IEEE Xplore.  Restrictions apply. \nnumber of users in terms of fraction from the total number of \nusers, N. In scenario I, out of 100 users, each propagation type \nhas 25% of them. In scenario II 40% of total users are in PT1, \n10% in PT2, another 10% in PT3 and the last 40% in PT4. \nWhereas in scenario III, the propagation type mix is 10% in \nPT1, 40% in PT2, 40% in PT3 and 10% in PT4. From this \nsimulation setup, file transfer delay (FTD) is again plotted \nagainst M in Figure 4. In Table III, MOpt values from simulations \nand expected values from theoretical analysis are compared.  \nFrom the comparison of simulations and expected values, it is \nfound that simulations error is within the range of 1% of \ntheoretical value. Since the error is small it is concluded that the \ncalculation to find MOpt in mixed environments is \nN\nN\nj\nT\nRtx\nOpt\nP\nP\nP\nPM\n)1(1\n)1(1\n0\n0\n−−\n−−\n== , which is the same equation used \nin homogeneous environment. \n \nTABLE III SIMULATION SETUP AND RESULTS FOR MIXED ENVIRONMENTS \nSCENARIO \nScenario NPT1 NPT2 NPT3 NPT4 MOPT \n(from \nsim.) \nMOPT \n= N\nN\nj\nP\nP\n)1(1\n)1(1\n0\n0\n−−\n−−\n; \n[N=100, P0=0.001, \nFile=1000segments] \n1 0.25 0.25 0.25 0.25 0.7 0.69 \n \n2 0.4 0.1 0.1 0.4 2.3 2.278 \n \n3 0.1 0.4 0.4 0.1 0.6 0.660 \n \n \nVI CSI COLLECTION POLICY \nLooking at the CSI feedback collected at the gateway, it is \nobserved that it is sufficient for the gateway to track the CSI \nonly when there are changes. A change detection scheme based \non sliding window is implemented to overcome the problem of \nhigh volume of feedback on the return link due to CSI updates. \nFurthermore, it avoids scheduling decision based on \ninstantaneous short events which could lead to false alarm and \nreceivers with large changes of CSI values to have higher \npriority to update their CSIs over other receivers. The choice of \nsliding window size, L, determines the robustness and agility of \nthe algorithm against time-varying channel conditions. \nTherefore, it is essential that L values should be chosen \naccordingly.  \nThe change detection scheme is employed by implementing a \nloss function to filter the CSI variations. The loss function is \nchosen to be the least square over sliding window algorithm, \ntermed as Windowed Least Square (WLS) which means the \nchange detection algorithm uses time batches (sliding window) \nfor averaging and thresholding. Note that in WLS there are two \nupdates for each new sample, and a memory of the last t-L \nmeasurements is needed for comparison. The first update is \naverage value of nγ  from an observation sliding window of size \nL. This average value, termed as 1ˆθ  is compared with the \nsecond update which is an average value from a longer window, \n0θˆ ,  using all past data since the last update, t-L. Parameter 1ˆθ is \nused as instantaneous value of P0j and 0θˆ is used to \ncalculate jP 0 . \n \nFig. 4 FTD vs M for Mixed Environments \n \nTABLE IV CSI COLLECTION POLICY SETUP \nData ,.....,2,1 Lt−γγγ  \n \ntLt γγ .......,,1+−  \n \nModel R0 \nReference Model \nR1 \nTest Model \nWLS \nQuantities 0θˆ  1ˆθ  \nVariance \n o\nλ  1λ  \nNumber of \nData \n \nn0=t-L n1=L \n \nFrom this setup, a file of 100000 segments delivered to 50 \nmulticast users is simulated in homogeneous environment. The \nresult of normalized file transfer delay (FTD) against length of \ntest window, L, is plotted in Fig 5. In Fig. 6, return link \nthroughput (RLT) per user is plotted against L. RLT is defined \nas    RLT=\nN\nFTDU \/  where U is total number of updates in one \nmulticast session.  \nFrom Fig 5 it is noted that FTD for users in suburban \nenvironment is higher than for users in wooded environment. \nThis is because of the nature of suburban environment where the \nshadowed duration is longer than wooded environment. Note in \nthe implemented scheduling algorithm, a longer shadowed \nduration would result segments to be delayed longer until good \n 1398\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 12, 2010 at 06:15 from IEEE Xplore.  Restrictions apply. \nchannel condition is reported. Also, it is observed that FTD \nincreases with L. This is because for a fixed t, a shorter test \nwindow would allow a longer size for reference window. With a \nlonger reference window, global parameter jP 0 is obtained from \na larger sample size, where its value should converge to the \ntheoretical value. This leads to optimum value of global \nparameter jP 0  in the right hand side of the \ninequality ∏\n=\n−−≤−−\nN\nj\nN\nj PP\n1\n00 )1(1)1(1 . In essence, a longer \nreference window (hence shorter test window) gives lower FTD.  \nIn Fig 6, it is observed that RLT decreases with L. This is \nbecause in shorter test window, the discrepancy between test \nwindow and reference window is large. As L increases, the \nvariance of test and reference windows approaches a common \nvalue hence lower number of updates is observed. In general, a \nshorter test window results higher return link throughput \ncompared to longer test window. From the two observations, it \nis essential to find LOpt, where both FTD and RLT are low. \nBased on this criterion, the simulation results show that LOpt \nequals to 16. \n \nVII CONCLUSION \nIn this paper channel-aware scheduling for reliable \ntransmission of multicast data over geostationary satellite \nnetworks is proposed. We introduce design parameter MOpt \nwhich reduces file transfer delay (FTD) by comparing most \ncurrent values of CSI parameters to its expected values. \nPerformance parameter FTD is observed in homogeneous and \nmixed environments. In both scenarios, simulations results to \nfind MOpt are confirmed with theoretical results using expected \nvalues of CSI parameter. In conclusion, lowest FTD is achieved \nwhen estimated probability of retransmission is lower than its \nexpected value. Note that the estimated probability of \nretransmission is calculated from instantaneous values of most \nrecently reported CSI parameter and its expected probability is \ncalculated from mean value of CSI parameter. \nThe assumption of periodic CSI collection from all users \ncould be resource consuming in the return link. Thus, we adopt \nCSI collection policy where CSI values arrive intermittently or \nfrom only a subset of users. Instead of updating every slot, the \nchange detection based on sliding window policy averages two \nCSI values from test and reference windows over two different \nlengths. The length of test window is denoted as L and the \nlength of reference window is (t-L). If there are differences in \nthe mean and variance values from the two windows, the CSI \nvalues from that particular user is updated. It is observed that a \nshorter test window gives lower FTD due to higher number of \nupdates. We are still, however, use simplified assumptions on \nupper layer transport protocol. It will be a complete \nimplementation if the scheduling and CSI collection algorithms \nare integrated with full implementation of reliable multicast \ntransport protocol. \n8 10 12 14 16 18 20 22 24\n1.06\n1.08\n1.1\n1.12\n1.14\n1.16\n1.18\n1.2\n1.22\n1.24\nL\nN\nor\nm\nal\niz\ned\n F\nile\n T\nra\nns\nfe\nr D\nel\nay\n \n \nPT1\nPT2\nPT3\nPT4\n \nFig 5 Normalized file transfer delay vs L \n8 10 12 14 16 18 20 22 24\n0\n0.002\n0.004\n0.006\n0.008\n0.01\n0.012\n0.014\n0.016\n0.018\nL\nR\net\nur\nn \nLi\nnk\n T\nhr\nou\ngp\nut\n p\ner\n U\nse\nr\n \n \nPT1\nPT2\nPT3\nPT4\n \nFig. 6 Return link throughput vs L \nREFERENCES \n[1] J. Zhang, \"Bursty traffic meets fading: a cross-layer design perspective,\" \nProceeding of the 40th Allerton Conference on Communications, Control, and \nComputing, Oct. 2002. \n[2] M.A.Haleem, R.Chandramouli, ‘Adaptive Downlink Scheduling and Rate \nSelection: A Cross-Layer Design’, IEEE Journal in Selected Areas in \nCommunications, Vol. 23, No. 6, May 2005. \n[3] Q.Liu, S.Zhou, G.B.Giannakis, ‘Cross-Layer Scheduling With Prescribed \nQoS Guarantees in Adaptive Wireless Networks’, IEEE Journal in Selected \nAreas in Communications, Vol. 23, No. 5, May 2005. \n[4] L. E. Braten, T.Tjelta, ‘Semi-Markov Multistate Modeling of Land Mobile \nPropagation Channel for Geostationary Satellites’. IEEE Transactions on \nAntennas and Propagation, Vol. 50, No. 12, Dec 2002. \n[5] K. Miller and K. Robertson, “StarBurst Multicast File Transfer protocol \n(MFTP) Specification,” IETF, IETF-Draft <draft-miller-mftp-spec-03.txt>, July \n1998. \n[6] G. Giambene, S. Kota, ‘Cross-Layer Protocol Optimization for Satellite \nCommunications Networks: A Survey’, International Journal of Satellite \nCommunications and Networking, 2006, 24:323-341 \n[7] M. W. Koyabe, G. Fairhurst, ‘Reliable Multicast Via Satellite: A Comparison \nSurvey and Taxonomy’, International Journal of Satellite Communications, \n2001, 19:3-28 [8] F. Gustafsson, ‘Adaptive Filtering and Change Detection’, \nJohn Wiley&Sons, 2000, pp221-223, 133-163 \n 1399\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 12, 2010 at 06:15 from IEEE Xplore.  Restrictions apply. \n"}