{"doi":"10.1016\/S0169-4332(01)00646-8","coreId":"53016","oai":"oai:eprints.lincoln.ac.uk:3258","identifiers":["oai:eprints.lincoln.ac.uk:3258","10.1016\/S0169-4332(01)00646-8"],"title":"Determination of the absorption length of CO2, Nd:YAG and high power diode laser radiation for a selected grouting material","authors":["Lawrence, Jonathan","Minami, Kanaka","Li, Lin","Edwards, Roger E.","Gale, Andrew W."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002","abstract":"The laser beam absorption lengths of CO2, Nd:YAG and a high power diode laser (HPDL) radiation for a newly developed SiO2\/Al2O3-based tile grout have been determined through the application of Beer-Lambert’s law. The findings revealed marked differences in the absorption lengths despite the material having similar beam absorption coefficients for the lasers. The absorption lengths for the SiO2\/Al2O3-based tile grout for CO2, Nd:YAG and HPDL radiation were calculated as being 23211 m, 1934 m and 1838 m respectively. Moreover, this method of laser beam absorption length determination, which has hitherto been used predominantly with lasers operated in the pulsed mode, is shown to be valid for use with lasers operated in the continuous wave (CW) mode, depending upon the material being treated","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/53016.pdf","fullTextIdentifier":"http:\/\/eprints.lincoln.ac.uk\/3258\/1\/Paper_41.pdf","pdfHashValue":"a7827bf25b89b17ae046d409899c6d093318418c","publisher":"Elsevier Science","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lincoln.ac.uk:3258<\/identifier><datestamp>\n      2013-03-13T08:45:22Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48363830<\/setSpec><setSpec>\n      7375626A656374733D6A6163735F48:6A6163735F48373030<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lincoln.ac.uk\/3258\/<\/dc:relation><dc:title>\n        Determination of the absorption length of CO2, Nd:YAG and high power diode laser radiation for a selected grouting material<\/dc:title><dc:creator>\n        Lawrence, Jonathan<\/dc:creator><dc:creator>\n        Minami, Kanaka<\/dc:creator><dc:creator>\n        Li, Lin<\/dc:creator><dc:creator>\n        Edwards, Roger E.<\/dc:creator><dc:creator>\n        Gale, Andrew W.<\/dc:creator><dc:subject>\n        H680 Optoelectronic Engineering<\/dc:subject><dc:subject>\n        H700 Production and Manufacturing Engineering<\/dc:subject><dc:description>\n        The laser beam absorption lengths of CO2, Nd:YAG and a high power diode laser (HPDL) radiation for a newly developed SiO2\/Al2O3-based tile grout have been determined through the application of Beer-Lambert’s law. The findings revealed marked differences in the absorption lengths despite the material having similar beam absorption coefficients for the lasers. The absorption lengths for the SiO2\/Al2O3-based tile grout for CO2, Nd:YAG and HPDL radiation were calculated as being 23211 m, 1934 m and 1838 m respectively. Moreover, this method of laser beam absorption length determination, which has hitherto been used predominantly with lasers operated in the pulsed mode, is shown to be valid for use with lasers operated in the continuous wave (CW) mode, depending upon the material being treated.<\/dc:description><dc:publisher>\n        Elsevier Science<\/dc:publisher><dc:date>\n        2002<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lincoln.ac.uk\/3258\/1\/Paper_41.pdf<\/dc:identifier><dc:identifier>\n          Lawrence, Jonathan and Minami, Kanaka and Li, Lin and Edwards, Roger E. and Gale, Andrew W.  (2002) Determination of the absorption length of CO2, Nd:YAG and high power diode laser radiation for a selected grouting material.  Applied Surface Science, 186  (1-4).   pp. 162-165.  ISSN 0169-4332  <\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1016\/S0169-4332(01)00646-8<\/dc:relation><dc:relation>\n        10.1016\/S0169-4332(01)00646-8<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lincoln.ac.uk\/3258\/","http:\/\/dx.doi.org\/10.1016\/S0169-4332(01)00646-8","10.1016\/S0169-4332(01)00646-8"],"year":2002,"topics":["H680 Optoelectronic Engineering","H700 Production and Manufacturing Engineering"],"subject":["Article","PeerReviewed"],"fullText":"  1 \nPAPER REFERENCE: L\/P3.30 \n \n \n \n \n \n \nDetermination of the absorption length of CO2, Nd:YAG and high \npower diode laser radiation for a selected grouting material \n \n \nJ. Lawrence\n1*\n, K. Minami\n2\n, L. Li\n2\n, R.E. Edwards\n3\n and A.W. Gale\n3\n \n \n1 \nManufacturing Engineering Division, School of Mechanical and Production Engineering, Nanyang \nTechnological University (NTU), Nanyang Avenue, Singapore 639798. \n2 \nLaser Processing Research Centre, Department of Mechanical, Aerospace and Manufacturing \nEngineering, University of Manchester Institute of Science & Technology (UMIST), PO Box 88, \nManchester, M60 1QD, UK. \n3 \nDepartment of Civil and Construction Engineering, University of Manchester Institute of Science \n& Technology (UMIST), PO Box 88, Manchester, M60 1QD, UK. \n \n \n \nAbstract \nThe laser beam absorption lengths of CO2, Nd:YAG and a high power diode laser (HPDL) radiation \nfor a newly developed SiO2\/Al2O3-based tile grout have been determined through the application of \nBeer-Lambert’s law. The findings revealed marked differences in the absorption lengths despite the \nmaterial having similar beam absorption coefficients for the lasers. The absorption lengths for the \nSiO2\/Al2O3-based tile grout for CO2, Nd:YAG and HPDL radiation were calculated as being \n232±11 µm, 193±4 µm and 183±8 µm respectively. Moreover, this method of laser beam absorption \nlength determination, which has hitherto been used predominantly with lasers operated in the pulsed \nmode, is shown to be valid for use with lasers operated in the continuous wave (CW) mode, \ndepending upon the material being treated.  \nKeywords: Laser, Absorption, Grout \n \n \n1. Introduction \nThe potential of the high power diode laser (HPDL) as a most effective, and in certain cases unique \ntool for a whole host of materials processing applications is being increasingly realised. Therefore, \n*Corresponding Author: Tel: +65 790 5542; Fax: +65 791 1859; E-mail: mjlawrence@ntu.edu.sg \n  2 \nit is imperative that a variety of comparative studies between HPDL's and the other main industrial \nlasers are conducted. This paper essentially compares the effects of wavelength differences between \na CO2, an Nd:YAG and a HPDL and the effects thereof on the lasers’ absorption lengths in a newly \ndeveloped SiO2\/Al2O3-based tile grout. Previously, Schmidt et al. [1] compared the performance of \nCO2, excimer and HPDL in the removal of chlorinated rubber coatings from concrete surfaces, \nnoting wavelength dependant differences in the process performance. Additionally, Bradley et al. \n[2] compared the CO2 and HPDL for the treatment of Al2O3-based refractory materials in terms of \nmicrostructure, observing wavelength dependant microstructural characteristics unique to each \nlaser. In more comprehensive investigations, Lawrence et al. compared the effects of CO2, \nNd:YAG, excimer and HPDL radiation on the wettability characteristics of ceramics [3, 4] and a \nmild steel [5, 6], noting that in all instances, changes in the wettability characteristics of the material \nvaried depending upon the laser type. \n \nThe large quantity of published literature to date testifies to the fact that the laser surface treatment \nof ceramics is an active field of research. The treatment of both bulk ceramic materials [7-11] and \nceramic coatings [12-15] has been reported. The knowledge of how far a laser beam is absorbed by \na material’s surface is of fundamental interest, since the outcomes of many laser processing \nprocedures are intrinsically influenced by this parameter. Indeed, such information is essential to \nscientists and engineers interested in the laser processing of ceramic materials. Notwithstanding \nthis, only a limited amount of published work exists pertaining to the determination of the \nabsorption length of laser beams in ceramic materials. Although not directly using the method \ndescribed in this paper to determine laser beam absorption length, namely the application of Beer-\nLambert’s law, the fundamental theory behind the method was employed by a number of workers. \nAndrew et al. [16] used the method to ascertain the minimum fluence required to etch polymeric \nmaterials. Schmidt et al. [1] utilised the method to calculate the thermal loading of chlorinated \nrubber during CO2 and HPDL treatment. \n \n  3 \nThis paper describes for the first time the determination of the absorption length of CO2, Nd:YAG \nand HPDL radiation in a newly developed SiO2\/Al2O3-based tile grout through the application of \nBeer-Lambert’s law. The material studied has been recently developed to provide a crack and \nporosity free seal in the void between adjoining vitrified ceramic tiles. Essentially the material is \nthere to provide an alternative to using commercially available epoxy tile grout to seal ceramic tiles. \nMoreover, the method of employing Beer-Lambert’s law for the determination of laser beam \nabsorption length, which has hitherto been used predominantly with lasers operated in the pulsed \nmode, is shown to be valid for use with lasers operated in the continuous wave (CW) mode \ndepending upon the material being treated. \n \n \n2. Experimental procedures \n \nThe composition by weight of the SiO2\/Al2O3-based tile grout is as follows: SiO2 (72.0%), TiO2 \n(1.6%), Al2O3 (20.5%), Fe2O3 (0.8%), CaO (1.0%), MgO (1.6%), K2O (2.0%), Na2O (0.5%). For \nthe purpose of experimental convenience the SiO2\/Al2O3-based tile grout was sectioned into small \ncubes (20 x 20 x 10 mm\n3\n) prior to laser treatment. The refractory was treated with lasers at room \ntemperature and in normal atmospheric conditions. \n \nThe work was carried out using a CO2 laser (Rofin-Sinar GmBh) emitting at 10.6 µm with a \nmaximum output power of 1 kW, an Nd:YAG (Lumonix Ltd.) emitting at 1.06 µm with a maximum \noutput power of 400 W and a HPDL (Diomed Ltd.) emitting at 940 nm with a maximum output \npower of 120 W. The CO2 laser beam was delivered to the work surface by focusing the beam \nthrough a 150 mm focal length ZnSe lens to give a stable diverging beam. The beam of the \nNd:YAG laser was delivered to the work area by means of a 3 m long, 1 mm core diameter optical \nfibre. The beam was then focused on to the surface of the samples by means of a 120 mm focal \nlength focusing lens assembly. Similarly, the HPDL beam was delivered to the work area by means \n  4 \nof a 4 m long, 1 mm core diameter optical fibre, the end of which was connected to a 2:1 focusing \nlens assembly. In all instances the laser optics were protected by means of a coaxially blown Ar \nshield gas jet at a rate of 5 l\/min. All three lasers produced a multi-mode beam. The laser fluences \nwere set such that no melting occurred. An optical profiling system (ProScan) was employed to \ndetermine the various depth values. The absence of melting was verified by subjecting the irradiated \nareas to an X-ray diffraction (XRD) analysis to ensure the SiO2\/Al2O3-based tile grout retained its \ncrystallinity.  \n \n \n3. Results \n \nAs one can see from Fig. 1, the depth rate per shot, h, for the surface of the SiO2\/Al2O3-based tile \ngrout irradiated with both lasers was seen to exhibit a logarithmic dependence on the laser fluence, \nE. Using the optical profiling system, the values of h for the various values of E. It is evident from \nboth Fig. 1(a) and Fig. 1(b) that a threshold for discernible material removal exists, with the \nminimum required fluence being approximately 74 J\/cm\n2\n for the CO2 laser, 135 J\/cm\n2\n for the \nNd:YAG laser and approximately 181 J\/cm\n2\n for the HPDL.  \n0\n200\n400\n600\n800\n1000\n1 10 100 1000 10000\nCO2 Laser Fluence, E (J\/cm\n2\n)\nR\ne\nm\no\nv\na\nl \nR\na\nte\n, \nh\n (\nµµ µµ\nm\n\/s\nh\no\nt)\n \n(a) \n  5 \n0\n100\n200\n300\n400\n500\n600\n1 10 100 1000 10000\nNd:YAG Laser Fluence, E (J\/cm\n2\n)\nR\ne\nm\no\nv\na\nl \nR\na\nte\n, \nh\n (\nµµ µµ\nm\n\/s\nh\no\nt)\n \n(b) \n0\n100\n200\n300\n400\n500\n600\n1 10 100 1000 10000\nHPDL Fluence, E (J\/cm\n2\n)\nR\ne\nm\no\nv\na\nl \nR\na\nte\n, \nh\n (\nµµ µµ\nm\n\/s\nh\no\nt)\n \n(c) \n \nFig. 1. Removal rate per shot, h, as a function of (a) CO2 laser, (b) Nd:YAG laser and (c) HPDL \nfluence, E. \n \n \n \n  6 \n4. Discussion \n \nAlthough the approach described above has been adopted previously to examine pulsed lasers, \nnamely excimer lasers, and has been shown to be a sound approach [16], the technique has also \nbeen used to investigate CW lasers [1, 17, 18]. Moreover, the distinct linearity of the data points \nshown in Fig. 1 further validates the use of this approach for the examination of CW lasers. It is \nimportant to note that this would assume a minimal conduction loss. But the SiO2\/Al2O3-based tile \ngrout has a very low value of thermal conductivity (1.36 W\/mK), thus it is reasonable to suppose the \nlaser power densities used were high enough and the pulses short enough to minimise the thermal \nconduction loss. \n \nSince the energy deposition profile will be governed by the optical absorption coefficient, α, then \nthe depth of material removed per shot, h, is given by Beer-Lambert’s law: \n \n h\nE\nE\nt\n=\n\n\n\n\n\n\n1\nα\nln  (1) \n \nwhere, Et, is the threshold value of the fluence at which significant material removal occurs and can \nbe estimated from [16] \n \n \n( )\nE\nH C T\nR\nt\np d=\n+\n−\nρ\nα 1\n (2) \n \nHere, H is the latent heat of fusion, ρ the density, Cp the specific heat and R the reflectivity. Td is \nsome critical temperature at which rapid thermal degradation of the material occurs leading to the \nproduction of volatile fragments within the thermal time scale of the experiments. It is important to \nnote that Eqn. (1) takes no account of absorption of incident radiation by the plume of removed \n  7 \nmaterial and probable changes in the material’s level of absorption as removal progresses. \nNonetheless, as the work of Andrew et al. [16] and Schmidt et al. [1] demonstrated, this simple \nform of the expression is quite adequate as a first approximation. By rearranging Eqn. (1) in terms \nof the absorption length, 1\/α, thus: \n \n \n1\nα\n=\n\n\n\n\n\n\nh\nE\nE\nt\nln\n (3) \n \nthen it is possible to determine the absorption length of the CO2, Nd:YAG and HPDL radiation into \nthe surface of the SiO2\/Al2O3-based tile grout. By introducing the ablation depth rate per shot, h, \nand the corresponding value of laser fluence, E, for each data point into Eqn. (3), it was possible to \ncalculate the average absorption length for each laser under the actual experimental conditions. \nThese were found to be 1\/α=232±11 µm for the CO2 laser, 1\/α=193±4 µm for the Nd:YAG laser \nand 1\/α=183±8 µm for the HPDL. \n \nThe principal factors that may influence the melt depth differences are arguably the absorption \nlength and the actual absorptivity of the surface of the SiO2\/Al2O3-based tile grout. But, absorptivity \nmeasurements made at room temperature using a comparative technique detailed elsewhere [19] \nrevealed that the surface of the SiO2\/Al2O3-based tile grout absorbed around 81% of CO2 laser \nradiation, 70% of the Nd:YAG laser radiation and around 63% of the HPDL radiation. \n \n \n5. Conclusions \n \nBy employing Beer-Lambert’s law, the laser beam absorption lengths of CO2 and a high power \ndiode laser (HPDL) radiation for the SiO2\/Al2O3-based tile grout were determined. The absorption \n  8 \nlengths for the SiO2\/Al2O3-based tile grout of CO2, Nd:YAG and a HPDL radiation were         \n232±11 µm, 193±4 µm and 183±8 µm respectively. The principal factors that may influence the \nmelt depth differences are arguably the absorption length and the actual absorptivity of the surface \nof the SiO2\/Al2O3-based tile grout. But, absorptivity measurements made at room temperature using \na comparative revealed that the surface of the SiO2\/Al2O3-based tile grout absorbed around 81% of \nCO2 laser radiation, around 70% of the Nd:YAG laser radiation and around 63% of the HPDL \nradiation.  \n \n \nReferences \n \n1. M.J.J. Schmidt, L. Li, J.T. Spencer, Appl. Surf. Sci. 138\/139 (1998) 378. \n2. L. Bradley, L. Li, F.H. Stott, Appl. Surf. Sci. 138\/139 (1998) 522. \n3. J. Lawrence, L. Li, J. Phys. D 32 (1999) 1075. \n4. J. Lawrence, L. Li, J.T. Spencer, Appl. Surf. Sci. 138\/139 (1999) 388. \n5. J. Lawrence, L. Li, J. Phys. D 32 (1999) 2311. \n6. J. Lawrence, L. Li, Appl. Surf. Sci. 154\/155 (2000) 664. \n7. M. Quinglin, Z. Zengui, D. Xiangzhu, J. Northeast Inst. Tech. 36 (1983) 31. \n8. F.S. Galasso, R. Veltri, Ceram. Bull. 62 (1983) 253. \n9. M.F. Chen, Y.L. Ge, Z.Q. Hu, High Temp. Technol. 3 (1985) 29. \n10. W. Maocai, J. Zhujing, W. Weito, Mater. Sci. Eng. 92 (1987) 145. \n11. J.V. Armstrong, M. McLoughlin, J.G. Lunney, J.M.D. Coey, Supercond. Sci. Tech. 4 (1991) 89. \n12. Z. Liu, W.M. Steen, W. O’Neill, in: T.S. Sudarshsn, D.G. Bhat, M. Jeaudin (Eds.), Surface \nModifications Technologies IV, The Minerals, Metals and Materials Society, PA, USA, 1991. \n  9 \n13. R. Sivakumar, B.L. Mordike, Surf. Eng. 4 (1988) 127. \n14. J. Pou, P. Gonzalez, E. Garcia, Appl. Surf. Sci. 79\/80 (1994) 388. \n15. S.Z. Lee, K.H. Zum Gahr, Mat.-Wiss. Und Werkstofftech 23 (1992) 117. \n16. J.E. Andrew, P.E. Dyer, D. Forster, P.H. Key, Appl. Phys. Lett. 43 (1983) 717. \n17. J. Lawrence, E.P. Johnston, L. Li, J. Phys. D 33 (2000) 745. \n18. J. Lawrence, L. Li, Appl. Surf. Sci. 168 (2000) 72. \n19. L. Li, J. Lawrence, J.T. Spencer, Proc. of SPIE: Europto’97 Lasers in Material Processing, \nMunich, Germany, 1997, 3097, 600 \n"}