{"doi":"10.1016\/S0257-8972(03)00737-0","coreId":"139873","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/757","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/757","10.1016\/S0257-8972(03)00737-0"],"title":"Nano and Micro indentation studies of bulk zirconia and EB PVD TBCs","authors":["Wellman, R. G.","Dyer, A.","Nicholls, J. R."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-01-01T00:00:00Z","abstract":"In order to model the erosion of a material it is necessary to know the material\nproperties of both the impacting particles as well as the target. In the case of\nelectron beam (EB) physical vapour deposited(PVD) thermal barrier coatings\n(TBCs) the properties of the columns as opposed to the coating as a whole are\nimportant. This is due to the fact that discrete erosion events are on a similar\nscale as the size of the individual columns. Thus nano* and micro* indentation\nwere used to determine the hardness and the Young\"s modulus of the\ncolumns. However, care had to be taken to ensure that it was the hardness of the\ncolumns that was being measured and not the coating as a whole. This paper\ndiscusses the differences in the results obtained when using the two different\ntests and relates them to the interactions between the indent and the columns of\nthe EB PVD TBC microstructure. It was found that individual columns had a\nhardness of 14 GPa measured using nano indentation, while the hardness of the\ncoating, using micro indentation decreased from 13 to 2.4 GPa as the indentation\nload increased from 0.1 to 3N. This decrease in hardness was attributed to the\ninteraction between the indenter and a number of adjacent columns and the\nability of the columns to move laterally under indentation","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/139873.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/S0257-8972(03)00737-0","pdfHashValue":"3f07eb777e75518672a7d9c68a1eb72817a6f30f","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/757<\/identifier><datestamp>2011-07-08T14:19:12Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Nano and Micro indentation studies of bulk zirconia and EB PVD TBCs<\/dc:title><dc:creator>Wellman, R. G.<\/dc:creator><dc:creator>Dyer, A.<\/dc:creator><dc:creator>Nicholls, J. R.<\/dc:creator><dc:subject>EB<\/dc:subject><dc:subject>PVD<\/dc:subject><dc:subject>TBCs<\/dc:subject><dc:subject>microhardness<\/dc:subject><dc:subject>nanohardness<\/dc:subject><dc:description>In order to model the erosion of a material it is necessary to know the material\nproperties of both the impacting particles as well as the target. In the case of\nelectron beam (EB) physical vapour deposited(PVD) thermal barrier coatings\n(TBCs) the properties of the columns as opposed to the coating as a whole are\nimportant. This is due to the fact that discrete erosion events are on a similar\nscale as the size of the individual columns. Thus nano* and micro* indentation\nwere used to determine the hardness and the Young\"s modulus of the\ncolumns. However, care had to be taken to ensure that it was the hardness of the\ncolumns that was being measured and not the coating as a whole. This paper\ndiscusses the differences in the results obtained when using the two different\ntests and relates them to the interactions between the indent and the columns of\nthe EB PVD TBC microstructure. It was found that individual columns had a\nhardness of 14 GPa measured using nano indentation, while the hardness of the\ncoating, using micro indentation decreased from 13 to 2.4 GPa as the indentation\nload increased from 0.1 to 3N. This decrease in hardness was attributed to the\ninteraction between the indenter and a number of adjacent columns and the\nability of the columns to move laterally under indentation.<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-02-07T23:08:37Z<\/dc:date><dc:date>2011-02-07T23:08:37Z<\/dc:date><dc:date>2004-01-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>R. G. Wellman, A. Dyer and J. R. Nicholls, Nano and Micro indentation studies of bulk zirconia and EB PVD TBCs, Surface and Coatings Technology, Volume 176, Issue 2, 1 January 2004, Pages 253-260.<\/dc:identifier><dc:identifier>0257-8972<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/S0257-8972(03)00737-0<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/757<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0257-8972","0257-8972"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["EB","PVD","TBCs","microhardness","nanohardness"],"subject":["Article"],"fullText":"1Surface and Coatings Technology, Volume 176, Issue 2, 1 January 2004, Pages 253-260\nNANO AND MICRO INDENTATION STUDIES OF BULK ZIRCONIA AND\nEB PVD TBCs\nR.G Wellman, A Dyer and J.R Nicholls\nSchool of Industrial and Manufacturing Science\nCranfield University\nBedford, MK 43 OAL\nUK\nABSTRACT\nIn order to model the erosion of a material it is necessary to know the material properties of both the\nimpacting particles as well as the target. In the case of electron beam (EB) physical vapour deposited (PVD)\nthermal barrier coatings (TBCs) the properties of the columns as opposed to the coating as a whole are\nimportant. This is due to the fact that discrete erosion events are on a similar scale as the size of the\nindividual columns. Thus nano* and micro* indentation were used to determine the hardness and the Young’s\nmodulus of the columns. However, care had to be taken to ensure that it was the hardness of the columns that\nwas being measured and not the coating as a whole. This paper discusses the differences in the results\nobtained when using the two different tests and relates them to the interactions between the indent and the\ncolumns of the EB PVD TBC microstructure. It was found that individual columns had a hardness of 14 GPa\nmeasured using nano indentation, while the hardness of the coating, using micro indentation decreased from\n13 to 2.4 GPa as the indentation load increased from 0.1 to 3N. This decrease in hardness was attributed to\nthe interaction between the indenter and a number of adjacent columns and the ability of the columns to\nmove laterally under indentation.\nKeywords: EB PVD TBCs, nanohardness, microhardness\nINTRODUCTION\nThe nano indentation of electron beam (EB) physical vapour deposited (PVD) thermal barrier coatings\n(TBCs) reported here was part of a larger project involving modelling the erosion of EB PVD TBCs [1,2].\nThere were two main reasons for initiating the nano indentation tests; the first was to determine the\n* All the hardness tests were carried out using either the Nano Test 600 or the Micro Test 200.\n2material properties of the individual columns of the coating which were needed as input parameters for the\nerosion model - Figure 1 and 2 illustrate the columnar microstructure of EB PVD TB Cs-; the second was to\nassess the depth of the plastic zone due to solid particle impact, which proved unsuccessful because the\nboundary effects were too great. It was expected that by measuring the change in nano-hardness down a\nsectioned column it would be possible to determine the depth of the plastic zone. However, due to the scatter\nin the results obtained, it was not possible to determine any changes in hardness due to densification of the\ncolumns caused by impact. This scatter was attributed to the fact that the columns were only 10-15 µm in\ndiameter and hence in sectioned samples there was not sufficient material underneath the indent to stop\nboundary effects influencing the results.\nDuring solid particle erosion of EB PVD TBCs, where the impacting particles are typically less than 1 50µm\nin diameter and the contact footprints are 5-25 µm in diameter, the properties of the individual columnar\ngrains are more important than those of the coating as a whole. This is due to the fact that discrete erosion\nevents are of a similar scale (5-25µm) to the size of the individual columns, which are typically 10-1 5µm in\ndiameter. The erosion tests were carried out using 1 00µm silica at typically 170 m\/s, a full description of the\nerosion test rig used and the conditions under which the EB PVD TBCs were tested can be found in the\nliterature [3]. Thus in modelling the erosion of EB PVD TBCs by particles of size 1 50µm or less, it is the\nhardness, Young’s Modulus and the fracture toughness of the columns that needs to be known rather than those\nof the coating as a whole. The thinking was that nano indentation could provide the information on the first\ntwo, but in order to do this it was first necessary to determine how to obtain the hardness of a single column\nwithout the results being affected by microstructural features of the coating as a whole, i.e. porosity,\nboundaries or neighbouring columns.\nIn a sense this problem was similar to that of nano and micro indentation of thin film coatings, where it is\ndifficult to separate effects of the coating and substrate interactions when determining the mechanical\nproperties of continuous coatings [4]. To address this, other papers have concentrated on the cracking of the\ncoatings and how this is affected by the substrate hardness [5]. In this project, it was necessary to separate the\neffects of lateral rather than vertical contributions to the constraint on indentation, since the EB PVD TBCs\nwere of sufficient thickness not to be influenced by the substrate. As far as the authors are aware, only one\nother piece of work has been done on the nano and micro indentation of TBCs, by K.D Bouzakis et al [5].\nHowever, the loads that were used, 200 to 1000 mN, which is on the border between nano and micro\nindentation, meant that they were not measuring the individual column properties but rather the coating\nproperties.\n32. METHOD\nTwo different hardness testers were used for this project a Nano Test 600 and a Micro Test 200. Three\ndifferent samples were used for the testing. These included a bulk zirconia sample, and two 8wt% yttria\nstabilised zirconia thermal barrier coatings (TBC) which had been deposited using electron beam physical\nvapour deposition techniques onto a prepared aluminised substrate. One of the TBC samples had been eroded\nwith one gram of 100 µm alumina at 140 m\/s and was then sectioned and polished. Both the nano and the\nmicro indentation tests were conducted on automated systems. All the samples tested were polished to a\nfinish of less the 1 µm Ra, and the hardness and reduced Young’s Modulus were determined by the\ninstruments from the unloading curve from the load displacement curves obtained during nano-\/micro-\nindentation. Three different forms of indentation test were used during the project; on the bulk zirconia\nsample each indent position on the bulk Zirconia sample was indented five times at increasing loads from 40\nto 200mN; on the tops of the columns each indent position was indented five times at increasing loads from\n20 to 100mN; all the other tests (both nano- and micro-) were single loading\/unloading cycles.\nThe indentation test program will be discussed in 4 sections. The first section involves the nano-indentation\nof bulk zirconia, the second the nano- indentation of a sectioned EB PVD TBC. The large scatter in these\nresults prompted the attempts to do nano indentation tests on the top of individual EB PVD TBC\ncolumns(section 3) and then it was decided to determine how an increase in load would affect the measured\nhardness and micro indentation tests, at loads from 0.1 -3N, carried out on the tops of the EB PVD TBCs\ncolumns (section 4).\n2.1 NANO INDENTATION OF BULK ZIRCONIA\nInitial nano indentation tests were conducted on a bulk zirconia sample in order to get baseline data against\nwhich to compare those of the EB PVD TBCs and to identify any possible problems. From the results in\nTable 1 and Figure 3, it can be seen that there was a fair degree of scatter. Each set of results was obtained\nfrom one position by indenting the same position at increasing loads from 40-200mN, thus the scatter\nrepresents variability in the zirconia properties at the micro-scale.\nFrom figure 3, it can be seen that in a number of cases there is a reduction in the hardness as the load is\nincreased. This was attributed to the indent being at or near a grain boundary or region of increased porosity.\nThus as the load was increased the hardness decreased due to the increased interaction of the indent and the\nlocal defect. In order to determine which results were unaffected by defects and which results where low due\nto underlying porosity\/defects the results of the hardness tests at 200mN were plotted on probability graph\npaper (Figure 4).\n4As can be seen from Figures 4a and 4b (diamond markers – represent a plot of all the results) it is apparent\nthat there are two distinct sets of data (two Gaussian trends with different slopes – here each individual\nGaussian trend plots a straight line against a normal probability ordinate). Thus it was possible to ascertain\nwhich readings were taken near underlying porosity and which represented the natural variation in the\nmaterial hardness. The top eight results (those conforming to the linear trend with a shallow slope) were then\nre-plotted against a probability ordinate (Figure 4b - square markers); these results can be assumed to be true\nhardness readings of the bulk zirconia ceramic which have not been influenced by underlying or\nneighbouring porosity\/defects. The bottom six results (those conforming to the linear trend with a steep slope,\nin Figure 4b – triangle markers) represent the results, which were taken above or near regions of\nporosity\/defects, and were thus affected significantly by such defects resulting in a large scatter in the results.\nIn this example some 40% of the hardness readings taken are affected by local surface defects.\n2.2 NANO INDENTATION ON THE CROSS SECTION OF AN EB PVD TBC\nUnder solid particle impact conditions, a small degree of plastic deformation occurs in EB PVD TBCs. Since\ncracking occurs at the elastic plastic interface when indenting or impacting ceramics [6], then in order to\nmodel erosion, the depth of the plastic zone needs to be known [1,2]. The aim was that nano-indentation\ncould be used to determine the degree \/ depth of plastic deformation occurring on impact.\nTo do this, it was necessary to nano-indent the cross section of an eroded specimen along the length of a\ncolumn with the aim of seeing a hardness change at the plastic zone boundary. These measurements were\nachieved, however, there was a large scatter in the results obtained and it was not possible to determine the\nplastic zone boundary from the data. The scatter was thought to be due to the uncertainty in the proximity of\ncolumn boundaries for the cross-sectioned samples, i.e it was not possible to determine the thickness of the\ncolumn under the indent. Thus for the case where the column boundaries interacted with the indentation\nprocess the effective hardness reading was low and also cracking sometimes occurred. This resulted in a wide\nscatter of hardness readings, see Table 2, the average of which would under read the true hardness of a\ncolumn.\nFrom the wide scatter in the hardness results of the sectioned coating and from the probability graph, Figure\n5, it can be deduced that the results were influenced by underlying porosity and column boundaries. Hence\nthe hardness results from the cross section of the coating can not be used as a measure of the hardness of the\ncolumns. In reality the true hardness and elastic modulus is more likely to be estimated from the larger values\nin each of the measured parameters, vis 11.3 GPa for hardness and 168 GPa for the elastic modulus. Further,\ndue to this scatter in the results nano hardness test could not be used to determine the extent of plastic\ndeformation within the impacted region of EB PVD TBCs, since the change in the\n5hardness due to particle impact may well be expected to be less than the scatter in the results of the nano\nhardness tests.\n2.3 NANO INDENTATION ON TOP OF THE EB PVD TBC COLUMNS\nSince it was not possible to unequivocally determine the column hardness from indentation results on a\nsectioned coating, it was decided to do nano indentation on the top of the columns. Indenting the top of the\ncolumns has the added advantage of being an effective ‘infinite’ thickness sample in the direction of loading.\nThus, this method does not have the same problems as those associated with indenting the x - section of a\ncoating, provided the indent is in the centre of the column and only interacts with that one column. In order to\nindent the top of the column it was necessary to lightly polish the specimen prior to-indentation in order to\nremove the pyramidal tops of the columns (see Figure 1 for a micrograph of an EB PVD TBC) to ensure that\nthe sample was sufficiently flat for nano indentation. The main problem with nano indentation on the tops of\nthe columns was ensuring that the indent was centred in the middle of a column and did not interact with\nneighbouring columns. The results, summarised in Table 3, were the only ones where the indent was\ncontained within one column. It should be noted that these results are significantly higher than those\nmeasured along the sectioned sample and they agree fairly closely to the results from the bulk zirconia\nsample. They are thus assumed to be an accurate measure of the hardness of the columns in an EB PVD TBC.\n2.4 MICRO HARDNESS TESTS ON THE TOP OF THE EB PVD TBC COLUMNS\nA number of micro hardness tests were also conducted on the tops of the columns under different loads to\ndetermine what would happen when the load was spread across a number of different columns and how this\nwould affect the apparent hardness. Figure 6 is a micrograph of these microhardness indents on the top of a\npolished EB PVD TBC; the arrows point to the indents corresponding to the different loads. The results of\nthe microhardness tests are summarised in table 4. Note that as the load increased the measured hardness of\nthe coating decreased, as shown in Figure 7. This decrease in the measured hardness was strongly dependent\non the number of columns indented and the manner in which these columns interacted with the indenter. The\nlargest of these hardness values, measured at the smallest load, approaches the value measured by nano-\nindentation on the top of the column.\n3 DISCUSSION\nThe nano indentation of the bulk zirconia and the subsequent statistical analysis shows that an analysis of\nprobability distributions could be used to separate results measured within grains from those which had been\ninfluenced by porosity. This analysis supplied a ‘reference’ distribution of hardness data for\n6comparison against the results obtained from the X-sectioned sample, EB PVD TBC samples. It showed that\nall the hardness results from the sectioned EB PVD TBC sample had been affected by porosity and\/or\nboundary defects, although the largest of these values approach those measured within grains on the bulk\nzirconia samples. Since the columns were only 15µm in diameter this result was not surprising as the\nsectioned columns were not sufficiently thick enough to contain the indent within the column, thus boundary\naffects were influencing the hardness readings.\nThe nano hardness testing of the tops of the EB PVD columns, however, was successful in determining the\nhardness of the columns. These measurements had to be used in conjunction with microscopy to determine\nwhether the indent was contained within one column. This requirement was confirmed by a series of micro\nhardness tests conducted on the top of the EB PVD TBC columns under increasing loads where only the\nsmallest load indents approached the hardness of the columns measured by nano-indentation. Figure 7\nindicates that the apparent hardness of the coating decreased as the load increased until at a load of about 1N\nthe hardness remained almost constant at about 2.4GPa. This can be explained in terms of the interaction of\nthe indent with the columns and column boundary regions. As the load increased the number of columns,\nwhich interacted with the indent, increased. It should be noted that due to the columnar microstructure of EB\nPVD TBCs some lateral movement is possible between the columns. Hence some of the load can be adsorbed\nby the lateral movement of the columns and the measured hardness consequently is decreased. Further, as the\nload is increased, what one measures changes. At low indent loads, and provided that the indent was\ncontained within one column, the hardness measured is that of the column. While at loads greater that 1 -2N,\nwhen the indent acts across a number of columns, it is the mean hardness of the coating that is measured. The\ninteractions of the indents with the columns is illustrated in the micrographs in Figures 8a-d.\nFigure 8a shows an example were the indent (3N) acts across a number of columns (possibly 16-20 in this\nexample) with significant interaction between neighbouring columns. It is this interaction of the indent with a\nnumber of columns that accounts for the observed reduction in hardness, and is attributed to the high degree\nof lateral movement available to the columns. In contrast to this Figure 8b, a 0.5N indent, shows much less\ninteraction between neighbouring columns, however the indent has still interacted with more than one\ncolumn. In the first example it would appear that the hardness of the coating is being measured (neighbouring\ncolumn interactions are observed), while in the second example it is questionable whether the hardness of the\ncoating or the hardness of the column was measured. Figure 8c, a 0.3N indent, shows only a small degree on\ninteraction with neighbouring columns, while the 0.1 N indents, Figure 8d, were centred within their\nrespective columns, with minimal interaction, possibly with one neighbouring column, in both cases. These\nlatter results are the ones, which gave the highest hardness readings (13.73 and 13.72) and are the closest to\nthe results of the nano hardness tests. The reason that the hardness measured using 0.2 to 0.4 N loads were\nlow is that the indents for these loads all spread across two or more grains and were\n7not centred in one grain alone. Thus, referencing back to Figure 7, and with reference to the micrographs in\nfigure 10, one can see that there is a transition between measuring the hardness of the individual columns to the\nhardness of the coating. This transition is dependent on the relative sizes of both the columns and the indents,\nwhich in turn determines the number of columns with which that indenter interacts.\n4. CONCLUSIONS\nThis study has shown that there is a significant difference in the hardness between the individual columns of\nan EB PVD TBC (14 GPa) and the hardness of the bulk coating (2.4 GPa). This difference can be attributed\nto the ability of the coating to accommodate the indentation event by lateral movement of the individual\ncolumns. When measuring the microhardness of EB PVD TBCs the hardness of the coating decreased from\n13.7 to 2.4 GPa as the indentation load increased from 0.1 to 3N.\nProbability distribution functions have been used to identify which results, based on nano indentation, have\nbeen affected by porosity\/boundary defects and what represent the natural scatter in hardness and elastic\nmodulus readings of individual columns. Thus when using micro hardness to determine the hardness of an\nEB PVD TBC, a load of at least 2N should be used. However, in order to determine the properties (hardness,\nelastic modulus) of individual columns in an EB PVD TBC, nano indentation techniques in conjunction with\nmicroscopy and statistic analysis should be used.\n5. Reference List\n1. R.G Wellman and J.R Nicholls, Wear, 242, (2000) 89.\n2. R.G Wellman, Ph.D. Thesis, Cranfield University (2001).\n3. J.R Nicholls, Y Jaslier and D.S Rickerby, Materials at High Temperature, 15, (1998) 15.\n4. E.G Berasategui, S.J Bull and T.F Page, International Conference on Metallurgical Coatings and Thin\nFilms , San Dieago USA, 2002.\n5. K.D Bouzakis, A Lontos, N Michailidis, O Knotek, E Lugscheider, K Bobzin and A Etzkorn, 2003,\nVol. 163-164, p. 75.\n6. A.G Evans, M.E Gulden and M Rosenblatt, Proceedings of the Royal Society (1978) 343.\n8Figure 1: Scanning Electron Micrograph Figure 2: Scanning Electron Micrograph of an\nshowing the columnar microstructure of EB EB PVD coating showing various microstructural\nTBCs. features [1].\nFigure 3: Graph of the nano hardness of bulk PSZ at a number of different positions under increasing\nloads.\n9(b)\nFigure 4: Probability plot of nano-hardness of bulk PSZ.\n10\nFigure 5: Hardness vs probability for the nano hardness tests on the cross section of the EB PVD TBC.\nFigure 6: Micrograph of the micro indents on the top of the columns of an EB PVD TBC, arrows indicate\nthe indents with load written above it.\n11\nFigure 7: Graph of load vs hardness for the micro indentation tests on the tops of the columns of an EB\nPVD TBC, the curve through the points illustrates the trend.\n(c) (d)\nFigure 8: a) 3 N micro indent showing interaction with a number of columns. B) Two 0.5 N indents showing\na much lower degree of interaction with neighbouring columns. c) The 0.3 N indent showing how in this case\nthe column has been pushed down into the coating. d) The 0.1 N indents showing minimal interaction with\ncolumn boundaries.\n12\nLoadZR121 ZR122 ZR123 ZR124 ZR125 ZR131 ZR132 ZR133 ZR134 ZR135 ZR141 ZR142 ZR143 ZR144ZR145\nmN GPa GPa GPa GPa GPa GPa GPa GPa GPa GPa GPa GPa GPa GPa GPa\n200 10.23 11.55 12.83 13.48 14.58 15.69 15.81 16.01 16.85 16.63 16.72 17.22 16.62 15.77 16.47\n160 10.63 12.32 13.62 13.84 14.84 15.62 15.68 15.84 16.55 16.49 16.55 16.95 16.34 15.787 16.26\n120 11.13 13.09 14.24 14.35 14.87 15.6 15.49 15.56 16.2 16.26 16.23 16.39 16.31 15.4 15.98\n80 12.21 13.92 14.7 14.25 14.66 15.45 15.08 15.08 15.55 15.79 15.54 15.55 15.73 15.26 15.58\n40 13.6 14.55 14.47 14.01 14.66 14.47 14.74 13.98 14.83 14.71 14.43 14.63 14.55 14.42 14.75\nTable 1: Results of the nano-hardness tests on bulk PSZ.\nLoad Hardness Modulus\nmN GPa GPa\n100 7.42 104\n100 9.37 144\n100 8.06 124\n100 5.5 120\n100 8.84 132\n100 11.24 145\n100 7.81 142\n100 5.87 110\n100 4.38 109\n100 11.32 168\nTable 2: Results from the nano tests on a cross-sectioned EB PVD TBC.\nLoad Sample ZR 28 Sample ZR 27\nmN Hardness Modulus Reduced Mod Hardness Modulus Reduced Mod\nGPa GPa GPa GPa GPa GPa\n100 15.82 218 191 16.32 198 176\n80 15.86 216 190 14.62 197 175\n60 15.18 226 197 13.35 187 168\n40 14.67 223 195 11.68 180 162\n20 13.67 214 188 10.02 173 157\nTable 3: Nano hardness and Modulus measured from the top of a sample.\n13\nLoad N Hardness GPa\n1 0.1 13.73\n2 0.1 13.72\n3 0.2 7.4\n4 0.2 5.13\n5 0.3 2.67\n6 0.4 3.51\n7 0.5 4.31\n8 0.5 4.98\n9 1 2.41\n10 1 3.07\n11 1 3.18\n12 2 2.45\n13 3 2.47\nTable 4: Table of hardness vs load for various micro hardness indents.\n"}