{"doi":"10.1108\/00242530710750581","coreId":"8503","oai":"oai:eprints.brighton.ac.uk:3005","identifiers":["oai:eprints.brighton.ac.uk:3005","10.1108\/00242530710750581"],"title":"Supporting lifelong learning in public libraries across Europe","authors":["Eve, Juliet","de Groot, M.","Schmidt, A.M."],"enrichments":{"references":[{"id":42749793,"title":"Educación (n.d.) Informe nacional sobre el debate acerca del aprendizaje permanente en España. Available at:","authors":[],"date":"2006","doi":null,"raw":"Ministerio de Educación (n.d.) Informe nacional sobre el debate acerca del aprendizaje permanente en España. Available at: Schreiber, T. (2006) The open learning centre in the public library: an evaluation of the experiences of the PuLLS project. [unpublished project document – draft version available at www.pulls.dk] Sommerland et al. (2004) Books and Bytes: new service paradigms for the 21st century: an evaluation of the People’s Network and ICT Training for Public Library Staff Programme. London: Big Lottery Fund Tampere City Library (2006) Netti-Nysse is Internet Bus at: http:\/\/www.tampere.fi\/kirjasto\/nettinysse\/english.htm# [accessed 16 January 2007] Unesco (2005) International Adult Learners Week 2005. available at: http:\/\/www.unesco.org\/education\/uie\/InternationalALW\/ [accessed 20 January 2007] Usherwood, Wilson & Bryson (2005) Perceptions of archives, libraries, and museums in modern Britain, Library & Information Research, Vol.29, No. 93 pp. 50-57.","cites":null},{"id":42749787,"title":"Library Policy 2006-2009 Available at: http:\/\/www.aakb.dk\/graphics\/portal\/bibliotekerne\/Bibliotekspolitik_2006-2009.pdf [accessed 27","authors":[],"date":"2005","doi":null,"raw":"Bibliography Aarhus Public Libraries (2005) Library Policy 2006-2009 Available at: http:\/\/www.aakb.dk\/graphics\/portal\/bibliotekerne\/Bibliotekspolitik_2006-2009.pdf [accessed 27 January 2007) Campaign for Learning. (n.d) About Us. Available at: http:\/\/www.campaign-forlearning.org.uk\/aboutus\/aboutus.htm [accessed 2 June 2005] EBLIDA. (2001) The Role of Libraries in Lifelong Learning. Available at: http:\/\/www.eblida.org\/position\/LLL_Statement_June01.htm [accessed 16 January 2007] European Commission (2000) A Memorandum on Lifelong Learning. Available at: http:\/\/europa.eu.int\/comm\/education\/policies\/lll\/life\/memoen.pdf [accessed 20 January 2007] European Commission (1995) Towards the Learning Society. Available at: http:\/\/europa.eu\/documents\/comm\/white_papers\/pdf\/com95_590_en.pdf European Commission (2003a) What is lifelong learning? Available at: http:\/\/ec.europa.eu\/education\/policies\/lll\/life\/what_islll_en.html [accessed 20 January 2007] European Commission (2003b) Making a European Area of Lifelong Learning a Reality. Available at: http:\/\/ec.europa.eu\/education\/policies\/lll\/life\/index_en.html [accessed 20 January 2007] European Commission (2006) It Is Never Too Late To Learn Available at: http:\/\/eur-lex.europa.eu\/LexUriServ\/site\/en\/com\/2006\/com2006_0614en01.pdf FINFO (2007) Information for Ethnic Minorities in Denmark. At: www.finfo.dk.","cites":null},{"id":42749791,"title":"Library strategy 2010. Helsinki: Ministry of Education. Available at: http:\/\/www.minedu.fi\/OPM\/Julkaisut\/2003\/kirjastostrategia_2010?lang=en [accessed 20","authors":[],"date":"2003","doi":null,"raw":"Finland (2003) Library strategy 2010. Helsinki: Ministry of Education. Available at: http:\/\/www.minedu.fi\/OPM\/Julkaisut\/2003\/kirjastostrategia_2010?lang=en [accessed 20 January 2007] Germany (2004) Learning Regions - Providing Support for Networks. Berlin: Federal Ministry of Education. Available at: http:\/\/deutschland.dasvonmorgen.de\/pub\/learning_regions_providing_supports_for_n etworks.pdf [accessed 20 January 2007] IFLA. (1994) Public Library Manifesto. Available at: http:\/\/www.ifla.org\/VII\/s8\/unesco\/eng.htm [accessed 16 January 2007] Local Government Association (2002) Partnership in Action, London: LGA Publications.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"Purpose: This paper presents findings from the European project PuLLS (Public Libraries in the Learning Society), funded by the EU’s Socrates programme.   \\ud\nApproach: Describes a piece of action research, outlining the development and implementation of a model for delivering open learning to adult library users. \\ud\nFindings: Details of the model, and the course developed and offered by partner libraries are described. Results suggest there is a significant role for libraries to play in supporting both ICT skills and wider information literacy learning. \\ud\nResearch implications: Suggests that libraries are beginning to move from a passive access approach to supporting learning  to a more active approach in delivering library-generated content themselves. \\ud\nPractical implications: Sharing of results may be useful for public libraries wishing to develop open learning facilities\/develop audiences for lifelong learning. \\u","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Emerald","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.brighton.ac.uk:3005<\/identifier><datestamp>\n      2017-10-03T08:31:33Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D50303030:50313030:50313130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.brighton.ac.uk\/3005\/<\/dc:relation><dc:title>\n        Supporting lifelong learning in public libraries across Europe<\/dc:title><dc:creator>\n        Eve, Juliet<\/dc:creator><dc:creator>\n        de Groot, M.<\/dc:creator><dc:creator>\n        Schmidt, A.M.<\/dc:creator><dc:subject>\n        P110 Information Management<\/dc:subject><dc:description>\n        Purpose: This paper presents findings from the European project PuLLS (Public Libraries in the Learning Society), funded by the EU’s Socrates programme.   \\ud\nApproach: Describes a piece of action research, outlining the development and implementation of a model for delivering open learning to adult library users. \\ud\nFindings: Details of the model, and the course developed and offered by partner libraries are described. Results suggest there is a significant role for libraries to play in supporting both ICT skills and wider information literacy learning. \\ud\nResearch implications: Suggests that libraries are beginning to move from a passive access approach to supporting learning  to a more active approach in delivering library-generated content themselves. \\ud\nPractical implications: Sharing of results may be useful for public libraries wishing to develop open learning facilities\/develop audiences for lifelong learning. \\ud\n<\/dc:description><dc:publisher>\n        Emerald<\/dc:publisher><dc:date>\n        2007<\/dc:date><dc:type>\n        Journal article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        <\/dc:rights><dc:identifier>\n        http:\/\/eprints.brighton.ac.uk\/3005\/1\/pulls-paper.pdf<\/dc:identifier><dc:identifier>\n          Eve, Juliet, de Groot, M. and Schmidt, A.M.  (2007) Supporting lifelong learning in public libraries across Europe  Library Review, 56 (5).  pp. 393-406.  ISSN 0024-2535     <\/dc:identifier><dc:relation>\n        10.1108\/00242530710750581<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.brighton.ac.uk\/3005\/","10.1108\/00242530710750581"],"year":2007,"topics":["P110 Information Management"],"subject":["Journal article","PeerReviewed"],"fullText":"Supporting lifelong learning in public libraries across Europe. \n \nJuliet Eve, Margo de Groot and Anne-Marie Schmidt \nCorrespondence author: Juliet Eve, Senior Lecturer, University of Brighton \nAddress: CMIS, Watts Building, Lewes Road, Brighton, BN2 4GJ. Tel: +44 (0) 1273 \n643506; email: j.eve@brighton.ac.uk. \n \n \nAbstract \n \nPurpose: This paper presents findings from the European project PuLLS (Public \nLibraries in the Learning Society), funded by the EU’s Socrates programme.   \nApproach: Describes a piece of action research, outlining the development and \nimplementation of a model for delivering open learning to adult library users. \nFindings: Details of the model, and the course developed and offered by partner \nlibraries are described. Results suggest there is a significant role for libraries to play \nin supporting both ICT skills and wider information literacy learning. \nResearch implications: Suggests that libraries are beginning to move from a passive \naccess approach to supporting learning  to a more active approach in delivering \nlibrary-generated content themselves. \nPractical implications: Sharing of results may be useful for public libraries wishing to \ndevelop open learning facilities\/develop audiences for lifelong learning. \nKeywords: lifelong learning; public libraries; ICT and information literacy skills. \nCase study. \n \nIntroduction \nThe PuLLS (Public Libraries in the Learning Society) project was part of the EU’s \nGrundtvig programme (under the broader remit of the Socrates programme), the aim \nof which is to enhance the European dimension of lifelong learning, and improve the \navailability and accessibility of learning opportunities for adults.  The PuLLS project \nsought to improve the role public libraries across Europe can play in delivering \nlearning opportunities.  The project aimed to improve adults’ (particularly \ndisadvantaged adults) information literacy and active citizenship through informal \nlearning by developing the concept of the public library as an open learning centre.  \nOne of the key tasks was to develop a European model for open learning in public \nlibraries, which can develop and deliver (e-)courses, and multimedia content which \nsupports and fosters adult learning.  Partners involved in the project were: Århus \nLibraries in Denmark, Helsinki Libraries in Finland, Sutton Libraries and the \nUniversity of Brighton in the UK, Ljubljana Libraries in Slovenia, Würzburg Librraies \nin Germany, Barcelona Libraries and MK5060 – full circle projects based in the \nNetherlands (1). Details of partners, and the materials and documents discussed \nbelow can be found at www.pulls.dk. \n \n \nContext: lifelong learning in Europe \n \nDefinitions \n \nLifelong learning has become one of the major policy goals of Western governments \nover the last few years, and is closely related to a broad range of other social policies \nsuch as (ICT) literacy, or digital citizenship, training and reskilling citizens for the \n‘Information Society’, competitiveness, and job creation.  Lifelong learning is defined \nby the European Commission as: \n 1\n \nall learning activity undertaken throughout life, with the aim of improving knowledge, \nskills and competence, within a personal, civic, social and\/or employment-related \nperspective. (European Commission, 2003a) \n \nThe stress falls on the skills and training aspect of learning, as the Commission sees \nthe role of lifelong learning as a key area in facing up to a number of [social and \neconomic] challenges: \n \nThe scale of current economic and social change, the rapid transition to a \nknowledge-based society and demographic pressures resulting from an ageing \npopulation in Europe are all challenges which demand a new approach to education \nand training, within the framework of lifelong learning. (European Commission, \n2003a) \n \nThis approach is reflected in the policy statements and initiatives established by the \nCommission and many member states, and is closely allied with wider ‘Information \nSociety’ developments which focus on lifelong learning, social inclusion and the \nexpansion of ICT facilities and training as the essential strands for exploiting the \nbenefits of the information age for EU citizens. \n \nIn the UK, the Campaign for Learning’s definition allows for a more expanded idea of \nlearning as engaging with the world around us: \n \nLearning is a process of active engagement with experience. It is what people do \nwhen they want to make sense of the world. It may involve an increase in skills, \nknowledge or understanding, a deepening of values of the capacity to reflect. \nEffective learning will lead to change, development and a desire to learn more. \n(Campaign for Learning, n.d) \n \nIn Spain, the concept of lifelong learning is legally defined at both the State and \nAutonomous Community level. The Informe nacional sobre el debate acerca del \naprendizaje permanente en España [National report on the debate on lifelong \nlearning in Spain] defines lifelong learning as the act of useful learning carried out \ncontinuously with the aim of improving qualifications, expanding knowledge and \naptitudes. (Ministerio de Educación, n.d.) \n \nDenmark’s Ministry of Education stresses the long-standing tradition of lifelong \nlearning for adults, and the key role CVU (Continuing Vocational Training) plays in \nthis – in line with European policy, the stress here is on training for unskilled workers, \nbut relevant courses are offered for all adults. \n \n \nEuropean policy developments \n \nUntil the mid-1990s, European educational policy – and resources for projects to \nsupport education, such as the Socrates and Leonardo programmes – was focused \non formal adult learning via educational institutions. The white paper of 1995, \nTowards the Learning Society, saw a shift towards supporting informal ways of \nlearning, and was the start of many policy initiatives designed to encourage what has \nnow come to be known as lifelong learning. 1996, indeed, was designated the \nEuropean Year of Lifelong Learning; the stress on lifelong learning to support \neconomic policies is evidenced by the launch of this initiative in the EU’s white paper \nentitled Growth, Competitiveness, Employment. Much was made of the need for \neducation and training to ‘meet the challenges of the twenty-first century’, and to skill \n 2\nan adaptable workforce in support of the ‘information society’ or ‘knowledge \neconomy’. This trend towards viewing both formal and informal education as a key \nweapon in the fight to remain economically competitive has become entrenched in \nEuropean and national governments during the intervening decade. In 2000, the \nLisbon Council produced the Memorandum on Lifelong Learning (European \nCommission, 2000), re-affirming its belief that: \n \nEurope has indisputably moved into the Knowledge Age \n \nand setting out its position that  \n \nthe move towards lifelong learning must accompany a successful \ntransition to a knowledge –based economy and society (p.3). \n \nThe Memorandum sets out six key messages (with related objectives) for creating a \nlifelong learning strategy: \n \n• New basic skills for all \no guarantee universal and continuing access to learning for gaining and \nrenewing the skills needed for sustained participation in the \nknowledge society; \n \n• More investment in human resources \no visibly raise levels of investment in human resources in order to place \npriority on Europe’s most important assets – its people; \n \n• Innovation in teaching and learning \no develop effective teaching and learning methods and contexts for the \ncontinuum of lifelong and lifewide learning; \n \n• Valuing learning \no significantly improve the ways in which learning participation and \noutcomes are understood and appreciated, particularly non-formal and \ninformal learning; \n \n• Rethinking guidance and counselling \no ensure that everyone can easily access good quality information and \nadvice about learning opportunities throughout Europe and throughout \ntheir lives; \n \n• Bringing learning closer to home \no provide lifelong learning opportunities as close to learners as possible, \nin their own communities and supported through ICT-based facilities \nwherever appropriate. (pp.10-18) \n \n \nThese were followed in 2001 by a set of indicators on lifelong learning, in an attempt \nto measure progress, and during the following couple of years, five benchmarks for \nEducation and Training were developed - including one on lifelong learning, which \nsuggested that 15% of the adult working population should be engaged in some kind \nof learning. In May 2003, this was adopted as a measure, but the target set was \n12.5%. Most recently, in October 2006, the Communication, It Is Never Too Late To \nLearn (European Commission, 2006), stressed the importance of adult learning, \nrecognising that adult participation in lifelong learning varies widely across member \n 3\nstates, and that the focus of activity remains on training and educating young people. \nThe document proposed an Action Plan on Adult Learning, to be launched in 2007, \nand aiming to meet five challenges: \n1. Lifting the barriers to participation; \n2. Ensuring the quality of adult learning; \n3. Introducing systems which recognise and validate learning outcomes; \n4. Investing in older people and migrants; \n5. Measuring progress via reliable data, and appropriate benchmarks and \nindicators, in order to inform evidence-based policy making. \n \nDuring this time, the Socrates and Leonardo programmes have been funding a wide \nrange of projects aimed at supporting these policy concerns, and libraries have been \npart of a number of networking and research initiatives. \n \n \nPublic libraries and lifelong learning \n \nPublic libraries have an established history of supporting individual and informal \nlearners, and so can also be expected to play an important part in the current lifelong \nlearning landscape. As lifelong learning has been adopted as a policy goal, and \nformalised in EU and national government agendas, so have libraries formalised their \nroles in supporting learners – both via policy and position statements, and via the \nnature of how – and with whom – they provide services. Increasingly, public libraries \nare being drawn in to assist the delivery of strategic policy goals, and many have \nseized the opportunity to align themselves with government agendas. This can be \nseen as a way of raising the profile of libraries, and, in the UK, certainly, is \nincreasingly linked to the ‘evaluation’ culture in which all (local) government services \nare having to prove their value, and relevance to wider policy agendas. The \nMuseums, Libraries and Archives Council (MLA) – the UK body which provides \nstrategic direction and support for the library, museums and archives sector – has \nestablished strategic initiatives around what are termed the ‘Shared Priorities’ \nbetween national and local government (see Local Government Association, 2002; \nMLA, n.d.). Public libraries are keen to place themselves at the heart of these \ndebates and policy initiatives around lifelong learning, taking back some of the \nground they naturally feel is their own as traditional supporters of learners. Libraries \nare an obvious choice to deliver, for example, on the sixth key message form the \n2000 Memorandum (bringing learning closer to home), as they already have \nestablished infrastructures in communities, and are highly trusted by the public (see \nfor example, Usherwood, Wilson & Bryson, 2005). \n \nThree major trends can be identified which have had significant impact on how \nlibraries perceive and articulate their role – and relevance – for the twenty-first \ncentury: \n \n• Alignment of library goals with local, national and European policy agendas; \n• Increasing formalisation of what libraries have always offered (in the form of \nlearning support and opportunities); \n• Partnership working with other educational providers. \n \nIn addition to these, there is also a move towards libraries as content providers, \nrather than as access facilitators; this is a small, but developing role, but seems set \nto grow in importance. The advent of ICT infrastructures in public libraries (such as \nthe UK’s People’s Network) has, in many ways been a catalyst for much of the \ninitiative. Not only has delivering ICT access and support been seen as a way to \n 4\nrevitalise the image of libraries in the public mind, but it has also been seized eagerly \nby managers, library bodies and policy makers as a way to generate renewed \ninterest (and investment) in libraries, and provide them with a role in the twenty-first \ncentury. In the UK, certainly, this trend is not without its critics, and much debate has \nbeen generated around the (possibly false) battle between ICT provision and \ntraditional book provision. However, the role libraries will play in supporting lifelong \nlearning agendas across Europe is set to stay. \n \nAt international level, this can be seen for example in the IFLA Public Library \nManifesto and directives, which are also key for partner countries involved in the \nPuLLS project.  The manifesto includes 12 key missions relating to information, \nliteracy, education and culture, which should be at the core of public library services.  \nThese include: supporting both individual and self conducted education as well as \nformal education at all levels and facilitating the development of information and \ncomputer literacy skills (IFLA, 1994).  The EBLIDA statement on the role of libraries \nin lifelong learning (EBLIDA, 2001), which supports the conclusions of the Lisbon \nEuropean Council, suggests that: \n \nLibraries therefore have a key role to play in underpinning learning in its \nbroadest sense, both as a formal activity in an institution and informally within \nthe community. Libraries, especially public libraries, can be a focal point for \nthe local community, stimulating learning within the community at all levels. \n(EBLIDA, 2001)  \n \nLibraries, and library organisations from the partner countries in the PuLLS project \nhave drawn on these statements to formulate their own positions, and to emphasise \ntheir commitment to supporting lifelong learning. In addition, many have adopted \ndefinitions which go beyond the rather narrower scope of EU and national \ngovernment concerns with re-skilling, and training, to embrace wider concepts of the \nimportance of learning. In the UK, the MLA (Museums, Libraries and Archives \nCouncil) has adopted the Campaign for Learning’s definition for its Inspiring Learning \nfor All initiative, supported by a toolkit to evaluate support of learning by these \ninstitutions. (http:\/\/www.mla.gov.uk\/action\/learnacc\/00insplearn.asp). The \ncommitment libraries have to supporting lifelong learning is well articulated by the \nMunicipality of Århus’ Library Policy, which stresses the personal dimension of \nlearning for individuals, as well as supporting the more strategic aims articulated by \nthe EU and national governments: \n \nLifelong learning is a key concept in a world, which is undergoing changes at \na staggering pace. …  Lifelong learning relates to both the professional and \nthe personal development of the individual.  From a social point of view there \nis a need for a high level of education and strong innovation skills when \ncompeting with other countries. \n  \nlibraries must support lifelong learning – the professional and the personal \ndevelopment alike.  They must assist both students attending educational \ncourses and anyone who independently wishes to become more educated.  \nThis could involve supporting public information activities, individual, personal \ninterests or inspiration to learning. \n \n(Århus Public Libraries, 2005: 9) \n \n \n 5\nPublic library activity in Europe \n \nThis section provides a brief overview of some of the learning provision and activities \nundertaken across Europe, focusing on the partner countries involved in the PuLLS \nproject. \n \n \nAccess to learning materials \nAccess to learning materials and support, both in the form of learning materials (in a \nvariety of formats), and by offering information about learning opportunities is a well-\nestablished feature of public library provision. The Learning Exchange (the Oton \nŽupančič Public Library, Ljubljana), for example, is a mediation point between \nlearning providers and users, collecting learning requests and offers and establishing \nthe link between request and offer. The origins of the service lie in the Adult \nEducation Centre of Slovenia, which started as a pilot project in 1992. The first \nservice was implemented in the library in Ljubljana, and there are now nine such \nservices across Slovenia, in a national network. In the UK, Birmingham Central \nLibrary opened its Learning Centre in 2002, and houses PCs, a meeting room, a \nlearndirect [footnote for explanation] room and a room for formal ICT sessions.  \nThere is also a self-study collection, ESOL collection, and Skills for Life collection.  \nOne of the aspects that differentiates this centre is the staffing: a team of staff \n(including some funded by learndirect) called Learner Support Officers, identify, \nselect and acquire resources to support learning, and carry out tasks such as \nenrolling learndirect users (or directing learners to other materials where \nappropriate); they can advise and mentor learners, though they are not tutors.   \n \nICT facilities \nProvision of facilities to offer training in ICT skills is also a feature of European library \nprovision, although here there are some interesting cultural differences in approach. \nIn the UK, for example, the development of the People’s Network [footnote], has \nreflected government policy on supporting training both in and via ICT skills. In \nDenmark and Finland, however, the emphasis for libraries has been less on fostering \nICT skills, and more on providing training in information literacy skills. Projects such \nas ‘The Barefoot Librarian’ in Vejle providing information literacy skills for ethnic \nminorities, and the learning centre in Århus library, which provides individual training \nsessions for users, are typical of Danish library provision. Another feature common to \nboth Denmark and Finland is the development of co-ordinated national services, \nsuch as the Danish Bibkurs, providing information retrieval skills via an e-learning \npackage, and the PublicLibraries.fi portal operated by Finland’s public libraries which \nhas its own information retrieval channel that provides customers with extensive help \nin finding information from various sources on the Internet. \n \nTargeting communities \nDeveloping services for specific communities is also a growing trend of European \nlibrary provision – Barcelona libraries for example provides materials and ICT to \nsupport self learning skills in Catalan (the official language of Catalonia), which aims \nto foster the integration of immigrant people. Tampere library in Finland also offers a \nlibrary guide for immigrants, giving details of services in nine languages \n(http:\/\/www.tampere.fi\/kirjasto\/mamut\/). The International Library in Frankfurt \nprovides programmes for language learning and integration for ethnic minority \ncommunities, and Danish libraries provide FINFO (Information for Ethnic Minorities in \nDenmark), a web service which aims to: \n \nprovide representatives of ethnic\/language minorities with better access to \ninformation about their rights, obligations and opportunities in the Danish \n 6\nsociety. Access to information is considered a prerequisite to integration into \nsociety and to active participation in all spheres of social life. \n \n(FINFO, 2007) \n \nPart of this development involves taking services out to communities, and beyond the \nphysical walls of the library itself is developing as a feature of public library provision; \nthe Netti-Nysse (Internet Bus) in Finland is one such example.  \nThe purpose of this mobile service is to encourage the residents of Tampere, Finland \nto start using computers and the Internet and give to them the initial guidance to be \nable to do that. Basic instruction is free of charge. Similar UK initiatives exist, such as \nLIAZe: Libraries and Information Access Zone (http:\/\/www.liaze.com\/) a fully \naccessible bus service providing access to learning at community locations, co-\nordinated to the needs of communities visited, which include travellers’ sites, \nworkplaces and old people’s homes.  They also offer wireless internet access and a \nshort-term laptop loan scheme. Knowsley’s ICT bus – Get IT on Board, launched in \n2003, in partnership with community college and Community and Youth service \noffers a range of learning support. \n \nPartnership working  \nPartnership working is becoming an increasing feature of library provision; whilst this \nhas been part of the library landscape for some time, it is now becoming increasingly \nformalised. Germany has a well-established network of adult education centres and \nthe PuLLS partner in Würzburg has developed open learning packages in \nconjunction with the Volkshochschule, including modules on finding information and \nlearning (Information und Wissen), and learning and living (Lernen und Leben). This \ntype of collaboration also exists in the Netherlands, with projects such as the \nagreement between the Dutch Volksuniversiteiten (Peoples universities), the \nNetherlands Public Library Association and two educational broadcasters. Launched \nin 2005, educational activities will be offered via television, radio, internet and \nlibraries under one recognisable flag.  \nThese developments all contribute to a changing library landscape, with the \ntraditional model of a more ‘passive’ provision of access (for those motivated and \nskilled to take advantage of it) to a more active reaching out beyond established \nservices and users, and an engagement with both user communities and wider policy \nagendas. Part of this shift involves moves towards the development of materials by \nlibraries themselves, and the PuLLS project represents some of the activity in this \narea. Research in the UK suggests that this is much needed: \n  \nWhat is currently missing in nearly all public libraries is a well designed and \nextensive range of online courseware with content that is relevant to people’s \nneeds and interests as well as being fun and enjoyable. (Sommerland et al. \n2004).   \n \nPuLLS: aims \n \nThe aims of the PuLLS project were to: \n \n• Share skills, knowledge and expertise across the partner institutions; \n• Develop a Europe-wide model for supporting adult lifelong learning; \n• Provide learning opportunities for adult learners, particularly those at risk of \nexclusion from the ‘information society’; \n 7\n• Develop a range of training materials to be delivered in open learning centres, \nand which could be shared with other libraries wishing to develop open \nlearning facilities. \n \nPart of the activities proposed were to specifically address the above point, in terms \nof creating content for adult learners, based on the kinds of skills libraries can offer \n(such as ICT skills, information-seeking etc. This is something of a departure for \npublic libraries, whose traditional role has been to offer information about learning \nopportunities provided by others, and to offer supporting materials for individual \nstudy. During the project, librarians were to act as content developers (and, to \nvarying degrees, as tutors); these are relatively under-developed activities in public \nlibraries, and partners in the project had varying experiences of these roles to draw \non.  \n \n \nMethods \n \nThe project ran from December 2004 to November 2006, and during that time, a \nnumber of key stages were identified and implemented. \n \nDeveloping a model \n \nThe first activity was to share existing knowledge in order to identify what the \nelements of a successful model for open learning might be, and to develop a model \nwhich would then be adopted by those partners providing services to the public. \nPartners conducted desk research to provide information about policy initiatives and \nlibrary activities in their own countries; these were then brought together and framed \nwithin wider the European context to produce an overview report [footnote]. From \nthis, trends and differences in approach were identified, and elements extracted to \ninform a model for implementing open learning centres. Target groups were \nidentified, and each library, using the model as a framework, devised its own plan for \ndeveloping content and delivering services. \n \nPiloting the model\/training courses \n \nFrom September 2005, the library partners worked on developing training materials, \nestablishing open learning centres (or spaces) within their libraries, and delivering \ncourses to their target audience(s). During this time, materials and experiences were \nshared via a number of mechanisms – the PuLLS website was a focal point for \nuploading content, partners shared experiences via webcams, and a physical \nmeeting in Barcelona in April 2006 provided the opportunity to discuss progress, \nshare experiences and materials, and monitor progress. An essential part of the \nproject was sharing good practice; at the Barcelona meeting it was decided that, \nwhere possible, partners would try to adapt and use materials developed in other \ncountries in their home institutions. \n \nEvaluation  \n \nTwo forms of evaluation were conducted; a common questionnaire was developed as \npart of the project for use with the users in each open learning centre, and an \nevaluation of the project using interviews with project partners was carried out by \nTrine Schreiber, of the Danish Royal School of Library and Information Science. \n \n \n 8\nResults\/outcomes \n \nThe following section reports on the outcomes of the model and the courses offered \nto the public. The results incorporate finding from the evaluations – full reports on \nthese (and all the materials developed) are available through the project website \n[footnote web address] \n \nA model for open learning centres \n \nThe development of the model to inform the direction of how partners implemented \nopen learning in their home countries was a useful way to distil information gathered \nas part of the desk research exercise. A number of elements were identified as \ndesirable, and target groups for training also identified. Within the project overall, the \ntarget users were defined as those at risk of exclusion from the information society in \nsome way (e.g. age, gender, ethnic origin, lack of ICT skills, lack of formal \neducation), and specific user groups identified by each partner. The model included a \nrange of other elements, all of which included aspects core to the project, and \naspects deemed important to be decided at a local level. The elements of the model \nwere: \n \n\u0083 The training of users: different types of training (individual, group, e-learning \netc.), and related issues such as the role of librarians – as trainers, teachers, \nguides? \n\u0083 Staff issues: training of staff in new roles; focus on ICT, presentation and \ncommunication skills. \n\u0083 Physical environment within the library: a flexible, open and accessible \nenvironment which should appeal to users. \n\u0083 ICT: range of equipment to be used, including video conferencing, assistive \ntechnologies etc. \n\u0083 Learning Materials: a range of multimedia courses, including those delivered \nover the web, and to include EU citizenship-related material. \n\u0083 Evaluation of courses and trainers: use of questionnaires and focus groups to \ngain user feedback; questionnaires and interviews to gain views of library \npartners. \n\u0083 Marketing: development of marketing plans very much devolved to local \nlevels. \n\u0083 Involvement of users in designing of courses and learning materials in open \nlearning centres: this was not a key part of the PuLLS project, but it was \nagreed that it would be a useful issue to consider for future development. \n \nEach partner library, then, developed and offered courses which contributed to the \noverall goals of PuLLS but which were considered most appropriate, or achievable, \nwithin their locality. Materials were shared both on the PuLLS website, and at partner \nmeetings, and translated into the different languages. Some materials were \ndeveloped in a number of languages from the outset (such as Barcelona’s ‘Finding \nthe North’ web tutorial, available in Spanish, Catalan, and English).  \n \n \nResults  \n \nIntroduction \nMany of the partner libraries built on existing provision or projects during the project, \ncontinuing work already started; others used the opportunity to set up new open \nlearning centres (or spaces) and to release staff for training. Others were able to \nprovide services for which they knew, or thought, there was a demand, though mostly \n 9\nthis was based on impressions rather than any specific user needs evaluation with \nlocal communities. As one partner remarked: \n \nWe have not gone out in the area making heavy investigations about the \nneeds of the people. We have some suppositions and we have looked at the \nexperience of others. (Schreiber, 2006) \n  \nThis had been highlighted in the model as an area of potential future development; \nhowever, the Würzburg partner did engage in some initial market research before \nembarking on the modules. A user needs evaluation was conducted, using focus \ngroup sessions with local people and this, combined with interviews with experts, \nassisted with the identification of suitable content. User feedback was additionally \ncollected via questionnaire as the courses were rolled out.  \n \nTarget Users \nThe project proposal identified adult users who had left school with only basic \neducation, and those without ICT skills as key target groups. These were seen as \ngroups likely to be at risk of exclusion from the ‘information society’ due to lack of \ntechnical or (information) literacy skills. The implementation of the model on a local \nlevel, however, meant that each partner library identified its own user group(s). \nCertain trends emerged in both what was offered to users – as might be expected, \nthere was an emphasis on training in ICT skills -  and in who was targeted (for \nexample, a tendency to focus on providing opportunities for older people).  \nAll libraries identified ‘older users’ as target groups, although there were different \nages set, including ‘adults over 45’ and ‘senior citizens’. Wherever the age limit was \nset, it was generally perceived that there was a demand for, in particular, ICT skills \nfrom older users, who also made up, in some areas, a large percentage of the \npopulation, and certainly of the existing library user population. The other target \ngroups were women (in the Danish libraries) and the long-term unemployed (in \nWürzburg). \n \n \nCourse content \n \nFive of the six partners developed courses in computer skills (the exception being  \nÅrhus libraries. These courses focused on training users in the basics of computer \nequipment, and three partners also offered specific software training, for example \nusing Microsoft Word. Sutton libraries for example, offered basic introduction to \ncomputer skills courses to the over 50s. Courses lasted an hour, and numbers were \nrestricted to six people (this later became eight), with one librarian to every two \nstudents. Five modules were offered: getting started; managing files; word \nprocessing; the internet; and email.  \nSearching for information, and using the internet were offered by all PuLLS partners, \nand there were some interesting variations in how this was approached. Helsinki, \nLjubljana and Sutton integrated internet skills within their ICT skills classes, whereas \nWürzburg and Barcelona separated these courses out. \nDespite none of the libraries using the term, many aspects of information literacy \nwere developed during courses. Information literacy may be defined as follows: \n \nInformation Literacy is defined as the ability to know when there is a need for \ninformation, to be able to identify, locate, evaluate, and effectively use that \ninformation for the issue or problem at hand. (National Forum on Information \nLiteracy, n.d.) \n \n 10\nWith that definition in mind, it is clear that many PuLLS activities were addressing \ninformation literacy issues with their users. Århus libraries, for example, developed a \nspecific module, How to Google, and also on training users in how to use specific \nwebsites (including: www.NetBorger.dk, a website offering citizens’ information; \nwww.aakb.dk, Århus public library website; and Fiction on the internet, using \nwww.litteratursiden.dk). This approach reflects the existing tradition in Denmark for \nproviding information literacy education (often on a one-to-one basis). The situation \nin the UK, for instance is somewhat different - since the implementation of the \nPeople’s Network (and earlier), training in how to use a computer and very basic \nintroductions to the internet and email have been commonplace.  \nBarcelona libraries developed a multimedia self-training course around searching for \ninformation on the web, entitled Troba el nord (Find the north), which was available in \nEnglish, Catalan and Spanish. In addition to searching skills, this offered advice on \ninterpreting results, thus also moving beyond the technical skills to further information \nliteracy skills. \n \nAppealing to new trends in technology was a successful aspect of a number of \ncourses, with three libraries offering training in digital photography, and suggestions \nthat future courses on, for example, how to use ipods, be introduced. \n \nA strong emphasis on ICT and information-related skills is notable, suggesting that \nlibraries are still happiest when offering training in areas where the existing staff \nexpertise exists. However, Würzburg’s provision was significantly different to other \npartners; an extensive range of courses was offered, including job applications , \ncourses about reading and learning, and how to handle both work and private life \nconflicts and stress. The job-related courses were very popular in Germany, though \ninterestingly, a similar offering by Århus did not attract any participants. This may \nhave been due to marketing (one of Würzburg’s target groups was unemployed \npeople), or may be a reflection of the differing expectations of public libraries in \ndifferent countries. Significant also in Würzburg was the extent of the joint working \nwith a local institute of adult education – again, this reflects the culture and practice \nof German libraries. \n \n \nCourse delivery \n \nThe mode of delivery of course varied quite widely. Three libraries (Sutton, Helsinki, \nand Ljubljana) offered courses lasting several weeks, though the length of each \nsession also differed – from one hour sessions in Sutton, to three hour sessions in \nHelsinki, whilst Ljubljana’s ICT skills course consisted of three ‘modules’ each one \nlasting a day. \n \n \nOf note here is the prevalence of offering training with low user-trainer ratios; whilst a \nfew sessions were run as teaching sessions with up to 15 or 25 participants (e.g \nthose delivered by the adult learning institute in Würzburg), the majority of courses \nenabled high levels of individual attention, ranging from 1:1 tuition to 1:4. \n \nThe target groups identified were quite consistent across the partner countries: older \npeople (although that ranged from over 45s, to over 50s, to ‘seniors’); the \nunemployed; and women [get details of which groups which partners targeted]. \nAn important characteristic of the delivery of the training was the high teacher\/trainer-\nstudent ratio, with most courses running on a 1-8 basis as a maximum, and many \nproviding 1-1 or 1-2 support. All partners carried out basic evaluation (via \nquestionnaires) of the courses, and received very high ratings for the usefulness of \n 11\ncourses. In Würzburg, for example, 93% indicated they would participate in a similar \ncourse, and 100%  that they would recommend courses to others. \nAll the partners intend to continue with their courses, and where possible to expand \nwhat they offer currently. \n \nKnowledge sharing between partners \n \nAlthough one of the aims of the project was to share knowledge – and possibly \ncontent – between the partners, it emerged that there were significant barriers to this. \nFirstly, the language barriers and need to translate material meant that partners \ntended to develop their own materials, rather than ‘joint’ or European content being \ncreated. For example, the Danish module, How to Google was deemed inappropriate \nfor the level of users attracted to the courses in Sutton (the target group was the over \n50s). Cultural differences also affected the type – and style – of materials offered. \nThe starting point for each library was, naturally, what they already knew and did, or \ncould do, within the scope of budgets and physical space. This tended towards \nbuilding on existing strengths, and extending work already taking place. However, \nevaluations of the project by the partners indicate that knowledge sharing was valued \nby those staff taking part, and new ways of supporting adult learning were shared: \n \nbefore going into the project we were not aware of the full potential for life-\nlong learning the libraries have; we saw training as a sporadic, individual \nactivities, not as a strategic line to follow.  Now, thanks to the PuLLS \nexperience, we are convinced that this is where our future lies. (quoted in \nSchreiber, 2006) \n \n \nDiscussion: Implications for libraries \n \n \nA number of commonalities emerged in how the partners approached the project, \nand in what they offered users. Some interesting questions can be raised here about \nthe popularity of courses offered – were the partner libraries successfully training \nusers in what might be termed core library skills, or were they offering courses \ntailored to user demands? If libraries are to use the ‘hook’ of lifelong learning – via \noffering a wide range of training in consumer or technology-led skills – what are the \nimpacts on staff and staff training, and what issues does this raise for what role \nlibraries are – and should be – playing in terms of education? This can be seen as \npart of a wider debate about what the function of a public library is in the twenty-first \ncentury; part of the learning landscape or competing as an alternative leisure \nactivity?  \n \nOffering a range of courses as part of a commitment to supporting learning of all \nkinds is set to become a feature of public library provision. What the PuLLS project \nhas illustrated is the moves libraries are making in a number of directions, all of \nwhich can be seen as part of the formalisation of library roles referred to above, and \nparty of what Trine Schreiber has described as a more aggressive mediation than \npreviously (Schreiber, 2006). Libraries are moving away from passive modes of \ninformation provision towards actively seeking to engage and engage with their users \n– and crucially, attract new ones. This is demonstrated by the move from: \n• Finding the information for the user to showing the user how to find \ninformation herself (i.e. supporting users in information literacy learning); \n• Engaging in marketing of services as part of external communication with the \n(potential) user community more than previously; \n 12\n• Consciously testing new models and methods for reaching users and \nproviding services. \n \nWhat the PuLLS partners have shown, and have been committed to during the last \ntwo years, is the desire to make public libraries special places of learning that can \nattract users because of the strengths they have in meeting clients as individuals. \nOverall, the approach taken suggests that libraries are well suited to offer both ICT \nskills training and a range of information literacy support to groups of users who may \nhave had little exposure to, for example, ICTs, and few opportunities for informal \nlearning elsewhere.  A certain shift has taken place in these libraries towards actually \ndesigning and delivering content, moving beyond the traditional role of providing \naccess on a self-help basis. There are perhaps further developments which could be \nusefully pursued, such as actively engaging with users (and, importantly, current \nlibrary non-users) in designing content and identifying areas of learning which draw \non more than existing assumptions or ‘hunches’ that staff may have about user \nneeds. \n \n \nConclusions \n \nThe PuLLS project has provided an enriching space for public librarians across \nEurope to share knowledge, and build their confidence in delivering content which \nsupports adult learners, particularly those lacking ICT or information-related skills. \nThe partners successfully delivered series of courses to users, which tapped into a \ndemand for this kind of training in small groups allowing for high levels of individual \nattention. Most libraries were unable in fact to meet the demand for course, and the \nmajority intend to keep running courses in the future. The project signals that libraries \nare building on traditional strengths in supporting learners, and in addition, beginning \nto move towards a more active service delivery, which targets services at groups of \nusers, and also specifically develops content for those users. Staff also are gaining \nnew skills and beginning to se a development of their role from passive facilitator to \nactive provide, and in some cases, tutor. \n \n1. The PuLLS project consisted of eight partners, six of whom were public libraries \nimplementing the model and delivering the courses. The University of Brighton \nprovided research support and MK5060 Full Circle projects co-ordinated publicity \nmaterials and provided project management support. \n \nBibliography \n \nAarhus Public Libraries (2005) Library Policy 2006-2009 Available at: \nhttp:\/\/www.aakb.dk\/graphics\/portal\/bibliotekerne\/Bibliotekspolitik_2006-2009.pdf \n[accessed 27 January 2007) \n \nCampaign for Learning. (n.d)  About Us.  Available at: http:\/\/www.campaign-for-\nlearning.org.uk\/aboutus\/aboutus.htm  [accessed 2 June 2005] \n \nEBLIDA.  (2001)  The Role of Libraries in Lifelong Learning.  Available at: \nhttp:\/\/www.eblida.org\/position\/LLL_Statement_June01.htm  [accessed 16 January \n2007] \n \n 13\nEuropean Commission (2000) A Memorandum on Lifelong Learning.  Available at: \nhttp:\/\/europa.eu.int\/comm\/education\/policies\/lll\/life\/memoen.pdf  [accessed 20 \nJanuary 2007] \n \nEuropean Commission (1995) Towards the Learning Society. Available at: \nhttp:\/\/europa.eu\/documents\/comm\/white_papers\/pdf\/com95_590_en.pdf \n \nEuropean Commission (2003a)  What is lifelong learning?  Available at: \nhttp:\/\/ec.europa.eu\/education\/policies\/lll\/life\/what_islll_en.html [accessed 20 January \n2007] \n \nEuropean Commission (2003b)  Making a European Area of Lifelong Learning a \nReality.  Available at: \nhttp:\/\/ec.europa.eu\/education\/policies\/lll\/life\/index_en.html  [accessed 20 January \n2007] \n \nEuropean Commission (2006) It Is Never Too Late To Learn Available at: \nhttp:\/\/eur-lex.europa.eu\/LexUriServ\/site\/en\/com\/2006\/com2006_0614en01.pdf \nFINFO (2007) Information for Ethnic Minorities in Denmark. At: www.finfo.dk. \n \nFinland (2003)  Library strategy 2010.  Helsinki: Ministry of Education. Available at: \nhttp:\/\/www.minedu.fi\/OPM\/Julkaisut\/2003\/kirjastostrategia_2010?lang=en  [accessed \n20 January 2007] \n \nGermany (2004)  Learning Regions - Providing Support for Networks.  Berlin: Federal \nMinistry of Education.  Available at: \nhttp:\/\/deutschland.dasvonmorgen.de\/pub\/learning_regions_providing_supports_for_n\networks.pdf [accessed 20 January 2007] \n \nIFLA. (1994)  Public Library Manifesto.  Available at: \nhttp:\/\/www.ifla.org\/VII\/s8\/unesco\/eng.htm  [accessed 16 January 2007] \n \nLocal Government Association (2002) Partnership in Action, London: LGA \nPublications. \n \nMinisterio de Educación (n.d.) Informe nacional sobre el debate acerca del \naprendizaje permanente en España. Available at: \nhttp:\/\/www.mec.es\/educa\/sistema-educativo\/eadul\/files\/apren_permanente.pdf \n[accessed 20 January 2007] \n \nMLA (n.d.) A Quiet Revolution. London: MLA. Available at: \nhttp:\/\/www.mla.gov.uk\/webdav\/harmonise?Page\/@id=73&Document\/@id=26575&Se\nction[@stateId_eq_left_hand_root]\/@id=4302&Session\/@id=D_eMKnd6xRowQksp5\n4PgSK \n \nMLA  (2004)  Inspiring Learning for All.  Available at: \nhttp:\/\/www.inspiringlearningforall.gov.uk\/default.aspx?flash=true   \n[accessed 16 January 2007] \n \nNational Forum on Information Literacy, (n.d.) What is information literacy? Available \nat: http:\/\/www.infolit.org\/ [accessed 16 January 2007] \n \nNIACE. (n.d.) A Memorandum on Lifelong Learning.  Available at: \nhttp:\/\/www.niace.org.uk\/Organisation\/advocacy\/memorandum\/Default.htm  [accessed \n20 January 2007] \n 14\n \nSchreiber, T. (2006) The open learning centre in the public library: an evaluation of \nthe experiences of the PuLLS project. [unpublished project document – draft version \navailable at www.pulls.dk] \n \nSommerland et al. (2004)  Books and Bytes: new service paradigms for the 21st \ncentury: an evaluation of the People’s Network and ICT Training for Public Library \nStaff Programme.  London: Big Lottery Fund \n \nTampere City Library (2006) Netti-Nysse is Internet Bus at: \nhttp:\/\/www.tampere.fi\/kirjasto\/nettinysse\/english.htm# [accessed 16 January 2007] \n \nUnesco (2005)  International Adult Learners Week 2005.  available at: \nhttp:\/\/www.unesco.org\/education\/uie\/InternationalALW\/  [accessed 20 January 2007] \n \nUsherwood, Wilson & Bryson (2005) Perceptions of archives, libraries, and museums \nin modern Britain, Library & Information Research, Vol.29, No. 93 pp. 50-57. \n \n \n 15\n"}