{"doi":"10.1103\/PhysRevD.66.086002","coreId":"65764","oai":"oai:dro.dur.ac.uk.OAI2:4869","identifiers":["oai:dro.dur.ac.uk.OAI2:4869","10.1103\/PhysRevD.66.086002"],"title":"The dual of nothing.","authors":["Balasubramanian, V.","Ross, S. F."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2002-10-01","abstract":"We consider “bubbles of nothing” constructed by analytically continuing black hole solutions in anti–de Sitter space. These provide interesting examples of smooth time-dependent backgrounds which can be studied through the AdS\/CFT correspondence. Our examples include bubbles constructed from Schwarzschild-AdS, Kerr-AdS and Reissner-Nordström AdS. The Schwarzschild bubble is dual to Yang-Mills theory on three-dimensional de Sitter space times a circle. We construct the boundary stress tensor of the bubble spacetime and relate it to the properties of field theory on de Sitter space","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65764.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4869\/1\/4869.pdf","pdfHashValue":"240745349d0dfe0cabccbb1be205e45f940d5ad1","publisher":"American Physical Society","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4869<\/identifier><datestamp>\n      2011-02-14T12:28:30Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        The dual of nothing.<\/dc:title><dc:creator>\n        Balasubramanian, V.<\/dc:creator><dc:creator>\n        Ross, S. F.<\/dc:creator><dc:description>\n        We consider “bubbles of nothing” constructed by analytically continuing black hole solutions in anti–de Sitter space. These provide interesting examples of smooth time-dependent backgrounds which can be studied through the AdS\/CFT correspondence. Our examples include bubbles constructed from Schwarzschild-AdS, Kerr-AdS and Reissner-Nordström AdS. The Schwarzschild bubble is dual to Yang-Mills theory on three-dimensional de Sitter space times a circle. We construct the boundary stress tensor of the bubble spacetime and relate it to the properties of field theory on de Sitter space.<\/dc:description><dc:publisher>\n        American Physical Society<\/dc:publisher><dc:source>\n        Physical review D : particles and fields, 2002, Vol.66(8), pp.86002 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2002-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4869<\/dc:identifier><dc:identifier>\n        issn:0556-2821<\/dc:identifier><dc:identifier>\n        issn: 1089-4918<\/dc:identifier><dc:identifier>\n        doi:10.1103\/PhysRevD.66.086002<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4869\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevD.66.086002<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4869\/1\/4869.pdf<\/dc:identifier><dc:rights>\n        © 2002 by The American Physical Society. All rights reserved.<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0556-2821","issn:0556-2821"," 1089-4918","issn: 1089-4918"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2002,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n02 August 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nBalasubramanian, V. and Ross, S. F. (2002) ’The dual of nothing.’, Physical review D : particles and fields.,\n66 (8). p. 86002.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1103\/PhysRevD.66.086002\nPublisher’s copyright statement:\n2002 by The American Physical Society. All rights reserved.\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nThe dual of nothing\nVijay Balasubramanian*\nDavid Rittenhouse Laboratories, University of Pennsylvania, Philadelphia, Pennsylvania 19103\nSimon F. Ross†\nCentre for Particle Theory, Department of Mathematical Sciences, University of Durham, South Road, Durham DH1 3LE,\nUnited Kingdom\n~Received 10 June 2002; published 16 October 2002!\nWe consider ‘‘bubbles of nothing’’ constructed by analytically continuing black hole solutions in anti–de\nSitter space. These provide interesting examples of smooth time-dependent backgrounds which can be studied\nthrough the AdS\/CFT correspondence. Our examples include bubbles constructed from Schwarzschild-AdS,\nKerr-AdS and Reissner-Nordstro¨m AdS. The Schwarzschild bubble is dual to Yang-Mills theory on three-\ndimensional de Sitter space times a circle. We construct the boundary stress tensor of the bubble spacetime and\nrelate it to the properties of field theory on de Sitter space.\nDOI: 10.1103\/PhysRevD.66.086002 PACS number~s!: 11.25.Hf, 04.70.2s\nI. INTRODUCTION\nThere are many open questions in string theory, such as\nunderstanding cosmological evolution or the information\nflow in a black hole formation, for which the key element is\na better understanding of dynamical spacetimes. There has\nrecently been a surge of interest in studying string theory in\ntime-dependent backgrounds. Several authors have discussed\norbifold constructions giving solutions with tractable string\ntheory descriptions @2#. These spacetimes contain singulari-\nties; this provides an opportunity to learn about novel\nsingularity-resolution mechanisms in string theory, but it also\nmakes these rather challenging examples. In another ap-\nproach Sen has considered dynamical solutions of open\nstring field theory with cosmological interpretations @3#, but\nthe corresponding spacetime solutions have not yet been un-\nderstood. Against this context, it is useful to consider simpler\nspacetimes which exhibit interesting time dependence. In @1#,\nAharony, Fabinger, Horowitz and Silverstein pointed out that\nthe double analytic continuation of Schwarzschild or Kerr\nspacetimes, dubbed ‘‘bubbles of nothing,’’ provide interest-\ning examples of smooth time-dependent solutions. Since\nthese are vacuum solutions, they are consistent backgrounds\nfor string theory at least to leading order.\nIt would also be interesting to find time-dependent asymp-\ntotically AdS solutions, as we could then use the AdS con-\nformal field theory ~CFT! correspondence to relate the time\ndependence to the behavior of the non-perturbative field\ntheory dual. By relating this dynamical background to the\ndual field theory, it may be possible to sidestep, and get\nanother perspective on, some of the difficult issues associ-\nated with studying string theory on these backgrounds, such\nas the possible appearance of non-local boundary interac-\ntions @1#.\nIn this paper we will extend the work of @1# by consider-\ning the double analytic continuation of black hole solutions\nin AdS. These bubbles of nothing should then be related to\nsome state in the field theory dual to string theory on AdSp\n3Sq. As we will see, this construction gives rise only to\nasymptotically locally AdS spacetimes and it would be inter-\nesting to find an example asymptotic to global AdS.\nWe will focus on the AdS53S5 case, as this corresponds\nto the most well-understood field theory dual. For most of\nour results, there will be an obvious extension to the AdS4\n3S7 and AdS73S4 cases. It might seem that the AdS33S3\ncase was equally interesting, but the double analytic continu-\nation of the locally AdS3 black hole solutions is just global\nAdS3.1\nWe begin by studying the analytic continuation of time\nand an angle (t→ix ,u→it) of Schwarzschild-AdS5 in Sec.\nII.2 As in the flat space case, x is periodically identified, and\nthe resulting geometry is only asymptotically locally AdS\n~even though the proper length of the x circle grows at large\ndistance!. We find that the natural conformal boundary of\nthis spacetime is three-dimensional de Sitter space times a\ncircle (dS33S1). By the AdS\/CFT correspondence, the\nSchwarzschild bubble should therefore be dual to N54\nSU~N! Yang-Mills theory on dS33S1. The characteristic ex-\nponential expansion of the bulk spacetime is therefore seen\ndirectly in the background for the field theory dual. We pro-\nvide evidence for the duality by computing the boundary\nstress tensor of the bubble spacetime and relating it to the\nexpectation value of the stress tensor of Yang-Mills theory in\ndS33S1.\nIn Sec. III, we consider the extension to rotating black\nholes. Analytically continuing time, an angle and a rotation\nparameter (t→ix ,u→it ,a→ia), we find that the presence\nof the negative cosmological constant introduces a qualita-\ntively new feature compared to flat space: the metric has a\ncoordinate singularity at a finite value of t . It would be\ninteresting to understand this breakdown of the metric in\n*Email address: vijay@endive.hep.upenn.edu\n†Email address: S.F.Ross@durham.ac.uk\n1This is related to the observation in @4# that the AdS soliton for\nd53 is just global AdS3.\n2Related solutions were previously discussed in @4#.\nPHYSICAL REVIEW D 66, 086002 ~2002!\n0556-2821\/2002\/66~8!\/086002~9!\/$20.00 ©2002 The American Physical Society66 086002-1\nmore detail. However, the extension to include rotation does\nnot introduce any simplification: since the proper distance in\nall directions grows like r, the spacetime is still locally as-\nymptotically AdS ~unlike in flat space, where it was asymp-\ntotically flat!, and the spacetime the dual field theory lives in\nstill has an S1 factor.\nFinally, we consider the extension to charged black holes\nin AdS in Sec. IV. We think of this charge as arising from\nangular momentum on the S5, so we consider the analytic\ncontinuation of time, an angle and the charge (t→ix ,u\n→it ,q→i%), parallelling the discussion of Kerr-AdS. These\ncharged cases are interesting because they have the same\ndS33S1 conformal boundary, but there is now an additional\nparameter in the solution.\nIn Sec. V, we speculate about the interpretation of these\nresults from the dual field theory point of view, and outline a\nprogram for future work. It is particularly appealing that the\ntime dependence of the spacetime in these examples can be\nseen directly in the background for the dual field theory.\nII. AdS-SCHWARZSCHILD BUBBLES\nIn this section we consider the bubbles obtained by ana-\nlytic continuation of the AdS-Schwarzschild black hole. We\nwill argue that these are related to SU(N) super YM ~SYM!\ntheory on a background which includes a de Sitter factor, and\ncalculate the field theory stress tensor from the asymptotics\nof spacetime by the counterterm subtraction procedure. The\n5D AdS-Schwarzschild black hole has a metric\nds252S 11 r2l2 2 r0\n2\nr2\nD dt21S 11 r2l2 2 r0\n2\nr2\nD 21dr2\n1r2~du21cos2u dV2\n2!, ~1!\nwhere dV2\n2 is the metric of the unit 2-sphere. We can ana-\nlytically continue t→ix and u→it to obtain another vacuum\nsolution to gravity with a negative cosmological constant:3\nds25S 11 r2l2 2 r0\n2\nr2\nD dx21S 11 r2l2 2 r0\n2\nr2\nD 21dr2\n1r2~2dt21cosh2t dV2\n2!. ~2!\nTo get a smooth spacetime, we require x to be identified with\nperiod\nDx5\n2pl2r1\n2r1\n2 1l2 , ~3!\nwhere r1 is the minimum value of r,\nr2>r1\n2 5\nl2\n2 F211A11 4r02l2 G . ~4!\nAt any time t , at fixed large r the space is the x circle times\na 2-sphere. As r→r1 the x circle collapses, but the 2-sphere\napproaches a finite size r1\n2 cosh2t. This 2-sphere is the\nboundary of a bubble of nothing in AdS space which con-\ntracts from infinite size at t52‘ to a minimum size at t\n50 and then expands back out to infinite size as t→‘ . The\nmetric on the bubble boundary is that of 3d de Sitter space.\nAt large r, this metric will approach AdS locally. This is\nnot obvious from the form of the asymptotic metric:\nds2’S 11 r2l2 D dx21S 11 r\n2\nl2 D\n21\ndr21r2~2dt2\n1cosh2t dV2\n2!. ~5!\nHowever, we can relate this to the usual embedding coordi-\nnates X1\n21X2\n21X3\n31X4\n22T1\n22T2\n252l2 by\nX25r cosh t cos u sin f ,\nX35r cosh t cos u cos f ,\nX45r cosh t sin u ,\n~6!\nT25r sinh t ,\nX15~r21l2!1\/2sinh x\/l ,\nT15~r21l2!1\/2cosh x\/l .\nBy contrast, the usual global AdS metric is\nds252cosh2rdt21l2dr2\n1l2sinh2r~dc21cos2c dV2\n2!, ~7!\nwhere 2p\/2,c,p\/2. This is related to the embedding co-\nordinates by\nX25l sinh r cos c cos u sin f ,\nX35l sinh r cos c cos u cos f ,\nX45l sinh r cos c sin u ,\n~8!\nX15l sinh r sin c ,\nT25l cosh r sin t\/l ,\nT15l cosh r cos t\/l .\nThus, the time-dependent metric ~5! is related to the standard\nglobal AdS coordinates ~7! by\n3In the string theory context, the solution of interest is the black\nhole 3S5, with a constant Ramond-Ramond ~RR! 5-form flux in\nboth black hole and S5 components. Since we analytically continue\ntwo coordinates in the black hole, the RR 5-form flux in this new\nspacetime will still be real.\nV. BALASUBRAMANIAN AND S. F. ROSS PHYSICAL REVIEW D 66, 086002 ~2002!\n086002-2\nr2\/l25sinh2r cos2c2cosh2r sin2t\/l , ~9!\nsinht5\ncosh r sin t\/l\n@sinh2r cos2c2cosh2r sin2t\/l#1\/2\n, ~10!\nsinh x\/l5\nsinh r sin c\n@sinh2r cos2c2cosh2r sin2t\/l11#1\/2\n.\n~11!\nTo understand the asymptotic metric, consider ~5! as a\ncoordinatization of AdS, which we will call the time-\ndependent AdS coordinates. We see that these time-\ndependent coordinates do not even cover the entirety of a\nsingle period in global AdS: the coordinate patch has a\nboundary at r50, corresponding to\ntanh r cos c56sin t\/l . ~12!\nIn particular, on the asymptotic boundary of the spacetime in\nglobal coordinates, r→‘ , the boundary of the patch covered\nby the time-dependent coordinates is given by the null lines\nc56t\/l6p\/2. We also see that in the time-dependent AdS\ncoordinates, we should use the full range 2‘,x,‘ . As in\nthe usual flat space case @6#, the main effects of considering\nthe exact metric ~2! on the coordinates are twofold; the range\nof r is restricted to r.r1 ~which restricts us to a region of\nAdS covered by the time-dependent coordinates!, and the\nspacetime is identified under x;x1Dx .\nAt large distances in AdS, i.e., as r→‘ , the restriction to\nr.r1 coincides with c56t\/l6p\/2, the boundary of the\ntime-dependent coordinate patch ~up to exponential correc-\ntions in r). The action of the periodic identification of x on\nthe asymptotic metric is, however, slightly complicated. We\nwill express it in terms of the global AdS coordinates. From\nEq. ~11!, we can see that a surface x5x0 in Eq. ~5! corre-\nsponds to\nsin c5\ntanh x0 \/l\ntanh r cos t\/l . ~13!\nIn, for example, the t50 slice, this surface will extend to the\nboundary along c5c0 where sin c05tanh x0 \/l. It reaches a\nminimum value rmin5x0 \/l at c5p\/2. Away from the re-\ngion near the bubble, we can approximate the bubble solu-\ntion ~2! by the time-dependent AdS space ~5!, with these two\nrestrictions. From the point of view of the usual AdS coor-\ndinates, the periodic identification in x will identify two sur-\nfaces of the form ~13!, as depicted in Fig. 1. This looks\npictorially rather like the construction of Ban˜ados-\nTeitelboim-Zanelli ~BTZ! from AdS3, but identifying hyper-\nsurfaces rather than geodesics. Note, however, that this pic-\nture only takes into account the effects on the coordinates,\nand not the fact that the bubble geometry ~2! differs from the\ntime-dependent AdS metric ~5! in the interior. If we just\nmade these identifications on the time-dependent AdS metric\n~5!, it would not be smooth at small r—in particular, in Fig.\n1, it looks like there is a finite minimum distance between\nthe two surfaces of fixed x , but in the true bubble geometry\n~2!, the distance between surfaces of fixed x goes smoothly\nto zero.\nIn the time-dependent AdS coordinates ~5!, the natural\nconformal compactification is a rescaling by l2\/r2, giving a\nboundary metric\ndsS\n2 5dx21l2~2dt21cosh2tdV2\n2!. ~14!\nThis is a (211)-dimensional de Sitter space times S1. Thus,\nif we assume the AdS\/CFT correspondence can be extended\nto such asymptotically locally AdS cases, we should think of\nthe dual description of this spacetime as given by some state\nof the SYM theory on dS33S1. This can be related to the\nusual theory on S33R obtained from global AdS by consid-\nering the boundary limit of the coordinate transformations\n~10!, ~11!:\nsinh t5\nsin t\/l\n@cos2c2sin2t\/l#1\/2\n,\n~15!\nsinh x\/l5\nsin c\n@cos2c2sin2t\/l#1\/2\n.\nThese transformations take the metric ~14! to\ndsS\n2 5\n1\n~cos2c2sin2t\/l !\n3@2dt21l2~dc21cos2cdV2\n2!# . ~16!\nHence, from the boundary point of view, the coordinate\ntransformation between time-dependent and global AdS co-\nordinates involves a conformal rescaling by cos2c2sin2t\/l.\nThis conformal factor vanishes at the boundary of the time-\ndependent AdS coordinate patch at c56t\/l6p\/2, as ex-\npected. If we also consider the effect of the periodic identi-\nfication in x , by restricting to the fundamental region\n2Dx\/2<x<Dx\/2, we find that this conformal factor is\nnon-zero except at t\/l56p\/2.\nFIG. 1. Periodic identification of x in global coordinates in the\nt50 slice. The figure shows the radial coordinate in AdS and c .\nOver every point in the figure there is a 2-sphere. The locus of\npoints of fixed x is shown.\nTHE DUAL OF NOTHING PHYSICAL REVIEW D 66, 086002 ~2002!\n086002-3\nFrom the field theory point of view, there is a single di-\nmensionless parameter: the ratio of the size of the S1 to the\nradius of curvature of the de Sitter factor. This is just Dx\/l ,\nand to understand the physics from the field theory point of\nview, we should express all quantities in terms of this param-\neter. In fact, if we solve Eq. ~3! for r1 in terms of Dx , we\nfind there are two roots:\nr15\npl2\n2Dx F16S 12 2Dx\n2\np2l2 D\n1\/2G . ~17!\nIn terms of the black hole solutions, this is just the usual\nstatement that there is a minimum temperature for the black\nhole solutions, and there are two black holes for each tem-\nperature above that value—a smaller, unstable one and a\nlarger stable one.\nIn the discussion of the flat space analogue in @1#, it was\nargued that the bubble spacetime would be classically stable,\nbut quantum mechanically unstable. Our expectations here\nare slightly different. For the larger root in Eq. ~17!, we\nwould expect that the bubble will be both classically and\nquantum mechanically stable. The argument for classical sta-\nbility is in the same spirit as @1#: the black hole solution is\nclassically stable, so when one performs the analytic continu-\nation, one expects to find no modes of the form eikx with\nnegative mass squared on the de Sitter factor ~it would be\nuseful, however, to check this explicitly!.\nThe quantum instability in @1# was to the production of a\nwidely separated bubble. First of all, we should note that the\nglobal AdS space ~7! with two surfaces of the form ~13!\nidentified is not smooth. It is therefore not clear that we\nshould give the bubble of nothing the same interpretation as\na non-perturbative instability that the flat-space case had in\n@6#. Also, the presence of a negative cosmological constant\nimplies widely separated objects cannot be treated indepen-\ndently. Finally, far from the original bubble, the x direction\nhas a large proper radius. As a result any identification of x\nrequired to make a second bubble in the background of the\nfirst one will involve identifications over a very large proper\nlength. This also suggests that there should be no instability\nto creating further bubbles.\nFor the smaller root in Eq. ~17!, on the other hand, there\nare signs of both classical and quantum instability. The cor-\nresponding black holes are thermodynamically unstable; it\nhas been argued @7# that this corresponds to a dynamical\ninstability. This may well lead to a classical instability of the\nbubble solution. Also, the solution with the larger root in Eq.\n~17! has lower energy, so we would expect the one with the\nsmaller root to decay quantum mechanically into this larger\nbubble.\nThe dual field theory: Stress-energy tensor\nWe have shown that the asymptotic boundary of the\nbubble spacetime is dS33S1. Therefore, by the AdS\/CFT\ncorrespondence, we expect that N54 SU~N! Yang-Mills\ntheory on dS33S1 should be dual to the bubble. The time\ndependence of the bubble spacetime is reflected directly in\nthe fact that the CFT lives on an expanding space. Here we\nwill present evidence for this duality by comparing the CFT\nstress tensor to the boundary stress tensor calculated from the\nbulk spacetime using the counterterm subtraction procedure\nof @8,9#.\nCalculating the boundary stress tensor for the bubble\nspacetime ~2! is a straightforward adaptation of the standard\ncalculation of the boundary stress tensor for the\nSchwarzschild-AdS black hole. We must rescale the bound-\nary stress tensor to express it in terms of the field theory in\nthe boundary metric ~14!. The result for the bubble is\nTx\nx52\n3\n16pGl3 ~r0\n21l2\/4!52\n3N2\n8p2l4 S r0\n2\nl2 1\n1\n4 D ,\nTt\nt5\n1\n16pGl3~r0\n21l2\/4!5\nN2\n8p2l4 S r0\n2\nl2 1\n1\n4 D , ~18!\nTu\nu5Tf\nf5\n1\n16pGl3 ~r0\n21l2\/4!5\nN2\n8p2l4S r0\n2\nl2 1\n1\n4 D ,\nwhere in the second equality we have used the standard re-\nlation l3\/G52N2\/p to rewrite the stress tensor in terms of\nfield theory quantities. It is interesting to compare this to the\ncorresponding result for the ordinary Schwarzschild-AdS\ncase:\nTt\nt52\n3\n16pGl3 ~r0\n21l2\/4!52\n3N2\n8p2l4 S r0\n2\nl2 1\n1\n4 D ,\nTc\nc5\n1\n16pGl3 l~r0\n21l2\/4!5\nN2\n8p2l4S r0\n2\nl2 1\n1\n4 D , ~19!\nTu\nu5Tf\nf5\n1\n16pGl3 ~r0\n21l2\/4!5\nN2\n8p2l4S r0\n2\nl2 1\n1\n4 D .\nThe positive sign of the Tt\nt component in Eq. ~18! implies\nthat this solution has a negative mass, while the negative Tx\nx\ncomponent is interpreted as a negative pressure ~i.e., a ten-\nsion! along this direction. The stress tensor is traceless, as in\nSchwarzschild-AdS. This is as expected, since the boundary\nmetric is the product of a circle and a three-dimensional Ein-\nstein space, so the trace anomaly vanishes. Notice that the\nstress tensor has one piece that depends on the parameter r0\nand another that only depends on the cosmological constant.\nBelow we will argue that the latter can be understood in the\ndual field theory as an anomaly contribution, while the\nformer depends on the state.\nNow, the dual description is in terms of N54 SYM on\nthe dS33S1 spacetime ~14!. This spacetime is conformally\nflat. We have already seen that the coordinate transformation\n~15! takes it to the form ~16!, which is conformal to the\nEinstein static universe; since flat space can be conformally\nembedded in the Einstein static universe, this implies that the\nboundary metric ~14! is conformally flat. Since the spacetime\nis conformally flat, there is a standard result for the stress\ntensor @10#\nV. BALASUBRAMANIAN AND S. F. ROSS PHYSICAL REVIEW D 66, 086002 ~2002!\n086002-4\n^Tn\nm&52\n1\n16p2 ~A\n(1)Hn\nm1B (3)Hn\nm!1T˜ n\nm\n, ~20!\nwhere (1)Hn\nm and (3)Hn\nm are conserved quantities constructed\nfrom the curvature ~see @10# for their definitions!, and T˜ n\nm is\na traceless state-dependent part. For the dS33S1 space, the\ngeometrical quantities are\n(1)Hn\nm5\n6\nl4 diag~23,1,1,1! ~21!\nand\n(3)Hn\nm52\n1\nl4 diag~23,1,1,1!. ~22!\nTo fix the coefficients A and B, we compute the trace of Eq.\n~20!,\n^Tm\nm&52\n1\n16p2 @26AhR2B~RmnR\nmn21\/3R2!# ~23!\nand compare this to the conformal anomaly for N54 SYM\n@9,11#\n^Tm\nm&5\n~N221 !\n64p2 ~2RmnR\nmn22\/3R2!, ~24!\nwhich fixes A50 and B5(N221)\/2. As a result, the field\ntheory stress tensor is\n^Tn\nm&5\n~N221 !\n32p2l4 diag~23,1,1,1!1T\n˜\nn\nm\n. ~25!\nThus the geometrical part of the stress tensor precisely re-\nproduces the second term in Eq. ~18! that is independent of\nthe parameter r0. This suggests that the state-dependent part\nof the field theory stress tensor should match the other term\nin Eq. ~18!, and should not produce an r0-independent con-\nstant. It would be interesting to clearly identify the field\ntheory states corresponding to the r0.0 bubbles and show\nthat this is the case.\nSince we obtained the bubble spacetime by analytic con-\ntinuation from a Euclidean solution, there is a natural\nvacuum state on the bulk spacetime defined by analytic con-\ntinuation from the vacuum on the Euclidean spacetime. Simi-\nlarly, there is a natural vacuum state in the field theory de-\nfined by analytic continuation from S33S1. It is presumably\nthis Euclidean vacuum state we should be considering.4\nWe will defer detailed consideration of the field theory\nstate to future work. Here, we will simply note that to com-\npare to the field theory, we should rewrite the stress tensor in\nterms of the dimensionless parameter Dx\/l . The form of the\nstress tensor rewritten in terms of Dx\/l is lengthy, so we will\nnot give it explicitly; it can be easily obtained using Eqs. ~4!\nand ~17!. Note that there are two roots in Eq. ~17!, giving\ntwo contributions to the partition function for a given Dx\/l .\nWe expect that the larger root will dominate for the field\ntheory state obtained from the Euclidean vacuum.\nIII. KERR-AdS BUBBLES\nThe Schwarzschild-AdS bubble discussed above is as-\nymptotically locally AdS; it would be interesting to identify\nasymptotically AdS solutions. In @1#, the same issue for the\nSchwarzschild bubble was explored by adding rotation.\nBubbles of nothing obtained by analytic continuation of Kerr\nspacetimes were also considered previously in @12#. We will\nnow examine the effects of including a rotation parameter in\nthe AdS case. We will find that, unlike the flat space case,\nthis fails to remove the identification in the asymptotic re-\ngion. There is also a new subtlety which arises from the\npresence of a negative cosmological constant.\nTo simplify comparison to the flat space treatment in @1#,\nconsider first the case d54. Then the metric obtained by\ntaking t→ix , a→ia and u→it in the Kerr-AdS black hole\n@13# is\nds25\nDr\nr2 Fdx2 a~11a2l22!cosh2tdfG\n2\n1\nr2\nDr\ndr22\nr2\nDt\ndt21cosh2t\nDt\nr2\n3Fadx1 ~r22a2!\n~11a2l22!\ndfG 2 ~26!\nwhere\nr25r21a2sinh2t , ~27!\nDt512\na2\nl2 sinh\n2t ~28!\nand\nDr5~r\n22a2!S 11 r2l2 D22Mr . ~29!\nThere is a bubble at r5rb , where rb is the largest root of\nDr . But there is also now a breakdown of the metric at t\n5sinh21@l\/a#, where Dt vanishes. The curvature remains fi-\nnite at this point, so it may be just a coordinate singularity. If\nwe write sinh t5l\/a2b2, the leading-order b-dependent part\nof the metric is\n2\n2la~ l21r2!\n~ l21a2! db\n21b2\n2~ l21a2!\nla~ l21r2!\n3Fadx1 ~r22a2!\n~11a2l22!\ndfG 2. ~30!\nFor any given fixed value of r, this looks like the Rindler-like\nmetric in the future light cone of a point. It therefore seems4We are grateful to Djordje Minic for discussions on this subject.\nTHE DUAL OF NOTHING PHYSICAL REVIEW D 66, 086002 ~2002!\n086002-5\nvery likely that the singularity at b50 corresponds to a ho-\nrizon. However, a different combination of dx and df is\nplaying the role of the hyperbolic angle in the Rindler-like\ncoordinates for each r, so it is difficult to find a coordinate\ntransformation that takes us through the horizon.\nSimilar difficulties arise in the case d55. The\nanalytically-continued Kerr-AdS5 solution gives the bubble\nmetric\nds25\nDr\nr2Fdx2 a~11a2l22!cosh2tdf1 b~11b2l22!sinh2tdcG\n2\n1\nr2\nDr\ndr22\nr2\nDt\ndt21cosh2t\nDt\nr2Fadx1 ~r22a2!~11a2l22! dfG\n2\n2sinh2t\nDt\nr2Fbdx1 ~r22b2!~11b2l22! dcG\n2\n2\n~11r2l22!\nr2r2\nFabdx1 b~r22a2!cosh2t\n~11a2l22!\ndf2\na~r22b2!sinh2t\n~11b2l22!\ndcG 2 ~31!\nwhere\nr25r21a2sinh2t2b2cosh2t , ~32!\nDt512\na2\nl2 sinh\n2t1\nb2\nl2 cosh\n2t , ~33!\nand\nDr5\n1\nr2\n~r22a2!~r22b2!S 11 r2l2 D2r02 . ~34!\nHere, the coordinates f and c are angles with period 2p . If a.b , there will be a breakdown of the metric where Dt vanishes,\nas before. If b.a , Dt.0, but we now encounter problems where r50.\nThere is still one case left, however: a5b . This leads to a considerable simplification of the metric, which becomes\nds25\nDr\nr2 Fdx2 a~11a2l22! ~cosh2tdf2sinh2tdc!G\n2\n1\nr2\nDr\ndr22\nr2\n~11a2l22!\ndt22\nr2\n~11a2l22!\ncosh2t sinh2t~df2dc!2\n1\n1\nr2 Fadx1 r2~11a2l22! ~cosh2tdf2sinh2tdc!G\n2\n, ~35!\nwhere\nr25r22a2 ~36!\nand\nDr5\n1\nr2\n~r22a2!2S 11 r2l2 D2r02 . ~37!\nIn this metric, we must restrict r to r>r1 , where r1 is the\nlargest root of\n~r1\n2 2a2!2~r1\n2 1l2!5r0\n2l2r1\n2\n. ~38!\n~Note that this equation has roots for all real non-zero\na ,r0 ,l .! The periodic identifications are\n~x ,f ,c!;~x1Dxn1 ,f1DxVn112pn2 ,c\n1DxVn112pn3!, ~39!\nwhere\nV52\na~11a2l22!\n~r1\n2 2a2!\n. ~40!\nThe surface of the bubble is at r5r1 . The induced metric\nis\nds252\n~r1\n2 2a2!\n~11a2l22!\ndt2\n2\n~r1\n2 2a2!\n~11a2l22!\ncosh2t sinh2t~df˜ 2dc˜ !2\n1\n1\nr1\n2\n~r1\n2 2a2!2\n~11a2l22!2\n~cosh2tdf˜ 2sinh2tdc˜ !2,\n~41!\nwhere\nV. BALASUBRAMANIAN AND S. F. ROSS PHYSICAL REVIEW D 66, 086002 ~2002!\n086002-6\nf˜ 5f1\na~11a2l22!\n~r1\n2 2a2!\nx , c˜ 5c1\na~11a2l22!\n~r1\n2 2a2!\nx .\n~42!\nIt is also useful to consider a coordinate\nf¯ 5f˜ 2c˜ . ~43!\nIn terms of (t ,f¯ ,c˜ ) coordinates, the metric on the bubble is\nds252\n~r1\n2 2a2!\n~11a2l22!\ndt2\n2\n~r1\n2 2a2!\n~11a2l22!\ncosh2t sinh2tdf¯ 2\n1\n1\nr1\n2\n~r1\n2 2a2!2\n~11a2l22!2\n~cosh2tdf¯ 1dc˜ !2. ~44!\nWe see that the constant t slices of the bubble are tori. Un-\nlike the non-rotating case, these tori are not all of finite size.\nThe cycle parametrized by c˜ at fixed f˜ goes to zero size at\nt50, as we can see from the first form of the metric. More\nworrisome, the gf¯ f¯ component in Eq. ~44! is\ncosh2t~r1\n2 2a2!\n~11a2l22!2\nS ~r12 2a2!\nr1\n2 cosh2t2~11a2l22!sinh2t D ,\n~45!\nso the cycle parametrized by f¯ at fixed c˜ will go to zero size\nwhen t satisfies\ntanh2t5\n~r1\n2 2a2!\nr2~11a2l22!\n, ~46!\nand becomes timelike for larger values of t . We will leave\nthe resolution of these difficulties for future work.5\nAs a general comment, we note that even if we had better\nexamples, adding rotation would not remove the asymptotic\nidentification. In the flat space case, proper lengths in the x\ndirection are asymptotically constant, while proper lengths in\nthe f ,c directions grow linearly in r at large distances. Thus,\nthe circle in the x direction formed by the identification ~39!\nwould have divergent size at large r for non-zero V . In the\nanti–de Sitter case, however, proper lengths in the x and\nsphere directions all grow linearly in r, but this growth is\nremoved by the conformal rescaling to obtain a boundary\nmetric. Hence, replacing the identification ~3! by ~39! will\nnot eliminate identifications in the conformal boundary; the\nKerr-AdS bubble spacetimes are still only asymptotically lo-\ncally AdS.\nIV. REISSNER-NORDSTRO¨ M AdS BUBBLES\nSince we are interested in considering bubbles in the con-\ntext of the AdS\/CFT correspondence, and hence in space-\ntimes which are asymptotically AdS53S5, there is another\npossibility to consider: we can add angular momentum on\nthe S5. From the five-dimensional point of view, this corre-\nsponds to considering charged black holes: a particularly\nsimple example is to add three equal commuting angular\nmomenta, which will give electrically charged Reissner-\nNordstro¨m AdS black holes @14#. This leads to new examples\nwith the same asymptotic structure as in the Schwarzschild-\nAdS case.\nPerforming the analytic continuations t→ix , u→it , q\n→i% on the solution of @14# gives us the bubble solution6\nds25S 11 r2l2 2 r0\n2\nr2\n2\n%2\nr4\nD dx2\n1S 11 r2l2 2 r0\n2\nr2\n2\n%2\nr4\nD 21dr2\n1r2~2dt21cosh2tdV2\n2! ~47!\nwith the gauge field\nAx5\nA3%\n2r2\n2\nA3%\n2r1\n2 . ~48!\nAs in the Schwarzschild case, we need to periodically iden-\ntify x with period\nDx5\n2pl2r1\n5\n2r1\n6 1r1\n4 l212%2l2 , ~49!\nwhere r1 is the largest root of\nr1\n6\nl2 1r1\n4 2r0\n2\nr1\n2 2%250. ~50!\nNote that this equation has a solution for r1 for all r0 and %;\nas in flat space examples, the analytic continuation of q\neliminates the possibility that there is no root.\nThe effects of % in the metric are negligible at large r, so\nthe asymptotic structure of this spacetime is the same as the\nuncharged case, and we get the same dS33S1 metric ~14! on\nthe conformal boundary. Here, we can think of Dx\/l and %\n~which is an R charge in the CFT! as the appropriate param-\neters.\nWe can determine the branch structure by considering the\nbehavior of Dx as a function of r1 . For small and large r1 ,\n5See, however, @5# for a construction in higher dimensions.\n6We must analytically continue the charge so that the resulting\nten-dimensional metric is real.\nTHE DUAL OF NOTHING PHYSICAL REVIEW D 66, 086002 ~2002!\n086002-7\nDx→0. There will be a maximum where Dx850, which\ngives\n2r1\n6 2r1\n4 l2210%2l250. ~51!\nSince this equation has only one real root, Dx(r1) has a\nsingle maximum. Below this maximum value, there are two\nsolutions for r1 for given Dx , as in the uncharged case.\n~Note that this branch structure is quite different from that\nobtained for real q.! It would be interesting to explore the\nstability of these solutions as well.\nSince the boundary stress tensor is independent of sub-\nleading terms in the metric, it will have the same form as in\nthe uncharged case ~18!. However, because Eq. ~49! gives us\na sixth-order polynomial to solve for r1 , we cannot write\nthe stress tensor explicitly in terms of Dx and % .\nV. CONCLUSIONS\nWe have begun an investigation of time-dependent bulk\nspacetimes in the context of the AdS\/CFT correspondence.\nInspired by the work of @1#, we have considered the smooth\nbubble solutions obtained from analytic continuation of bulk\nblack hole solutions. This gives asymptotically locally AdS\nspacetimes which are dual to field theory on simple time-\ndependent backgrounds. The fact that the time dependence of\nthe bulk spacetime shows up as time dependence in the back-\nground for the dual field theory is very encouraging. It sug-\ngests that there may be interesting connections between, for\nexample, the notions of particle creation on the two sides of\nthe duality.\nWe focused on asymptotically AdS53S5 spacetimes, dual\nto N54 SYM theory. The extension to other cases of interest\nshould be straightforward. For the simplest example, the\nSchwarzschild-AdS5 bubble, the dual field theory lives on\nthree-dimensional de Sitter space cross a circle. We calcu-\nlated the boundary stress tensor of the bubble spacetime and\nshowed that that it had two pieces, one which depended on\nthe parameters of the bubble, and the other which was uni-\nversal. We showed that this universal part is reproduced by\nthe universal anomaly contribution to the stress tensor of\nYang-Mills theory on dS33S1. It will be very interesting for\nthe future to understand the bubble parameter dependent part\nof the boundary stress tensor from the dual perspective. For a\ngiven radius of the circle, there are two bubble solutions,\nwith different values for the minimum radius of the bubble.\nWe expect that the smaller bubble solution should be un-\nstable. A careful analysis of the classical perturbations of\nboth these solutions, along the lines of the analysis of the\nAdS solitons in @4#, would be very useful.\nWe extended the construction to include angular momen-\ntum both in the AdS factor and on the S5. For angular mo-\nmentum on the AdS factor, there are new coordinate singu-\nlarities which appear after analytic continuation for generic\nvalues of the parameters. These seem to be associated with a\nhorizon in the bulk spacetime, but we did not attempt to\nresolve this issue in detail. Angular momentum on the S5 is\nmore tractable, and leads to a structure which is very similar\nto the Schwarzschild-AdS case, but with an additional pa-\nrameter. Varying this parameter provides additional opportu-\nnities to study the behavior of the dual field theory. We note\nthat unlike in @1#, adding either kind of angular momentum\ndoes not simplify the asymptotic structure of the spacetime\nor alter the late-time behavior of the bubble.\nThe main direction for future work is to study the prop-\nerties of the field theory on dS33S1, and attempt to relate\nthe vacuum states on that background to the bulk spacetimes\ndiscussed here. It would be very interesting if particle pro-\nduction in the bulk and on the boundary could be related.\nAnother open area is to attempt to find constructions that\ngive tractable time-dependent asymptotically AdS solutions,\nwhich could be related to the field theory on R4.\nIt would also be interesting to consider the analogues of\nthe construction in @2#, quotienting AdS by a timelike or a\nnull isometry. However, since these isometries also act on the\nconformal boundary, this will lead to identifications in the\ndual as well, and it may be difficult to deal with the resulting\nbackgrounds in the field theory.\nNote added. While this paper was in preparation, Ref. @5#\nappeared, which discusses some of the same solutions.\nACKNOWLEDGMENTS\nWe thank Jan de Boer, Djordje Minic and Asad Naqvi for\ndiscussions. V.B. was supported by DOE grant DE-FG02-\n95ER40893. S.F.R. was supported by the EPSRC. S.F.R.\nthanks the University of Pennsylvania for hospitality while\nthis work was initiated.\n@1# O. Aharony, M. Fabinger, G.T. Horowitz, and E. Silverstein, J.\nHigh Energy Phys. 07, 007 ~2002!.\n@2# V. Balasubramanian, S.F. Hassan, E. Keski-Vakkuri, and A.\nNaqvi, ‘‘A space-time orbifold: A toy model for a cosmologi-\ncal singularity,’’ hep-th\/0202187; L. Cornalba and M.S. Costa,\nPhys. Rev. D 66, 066001 ~2002!; N.A. Nekrasov, ‘‘Milne uni-\nverse, tachyons, and quantum group,’’ hep-th\/0203112; J. Si-\nmon, J. High Energy Phys. 06, 001 ~2002!; H. Liu, G. Moore,\nand N. Seiberg, ibid. 06, 045 ~2002!; S. Elitzur, A. Giveon, D.\nKutasov, and E. Rabinovici, ibid. 06, 017 ~2002!.\n@3# A. Sen, J. High Energy Phys. 04, 048 ~2002!.\n@4# G.T. Horowitz and R.C. Myers, Phys. Rev. D 59, 026005\n~1999!.\n@5# D. Birmingham and M. Rinaldi, Phys. Lett. B 544, 316 ~2002!.\n@6# E. Witten, Nucl. Phys. B195, 481 ~1982!.\n@7# V.E. Hubeny and M. Rangamani, J. High Energy Phys. 05, 027\n~2002!.\n@8# V. Balasubramanian and P. Kraus, Commun. Math. Phys. 208,\n413 ~1999!.\n@9# M. Henningson and K. Skenderis, J. High Energy Phys. 07,\n023 ~1998!; K. Skenderis, Int. J. Mod. Phys. A 16, 740 ~2001!.\n@10# N.D. Birrell and P.C. Davies, Quantum Fields In Curved Space\nV. BALASUBRAMANIAN AND S. F. ROSS PHYSICAL REVIEW D 66, 086002 ~2002!\n086002-8\n~Cambridge University Press, Cambridge, England, 1982!.\n@11# O. Aharony, S.S. Gubser, J.M. Maldacena, H. Ooguri, and Y.\nOz, Phys. Rep. 323, 183 ~2000!.\n@12# F. Dowker, J.P. Gauntlett, G.W. Gibbons, and G.T. Horowitz,\nPhys. Rev. D 52, 6929 ~1995!; 53, 7115 ~1996!.\n@13# S.W. Hawking, C.J. Hunter, and M.M. Taylor-Robinson, Phys.\nRev. D 59, 064005 ~1999!.\n@14# A. Chamblin, R. Emparan, C.V. Johnson, and R.C. Myers,\nPhys. Rev. D 60, 064018 ~1999!.\nTHE DUAL OF NOTHING PHYSICAL REVIEW D 66, 086002 ~2002!\n086002-9\n"}