{"doi":"10.1088\/1751-8113","coreId":"67762","oai":"oai:eprints.lancs.ac.uk:35026","identifiers":["oai:eprints.lancs.ac.uk:35026","10.1088\/1751-8113"],"title":"Controlling current reversals in synchronized underdamped ratchets.","authors":["Vincent, Uchechukwu","Olusola, O. I.","Mayer, D.","McClintock, P. V. E."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-03-31","abstract":"A pair of underdamped ratchets, coupled via a perturbed asymmetric potential, is shown to make a transition to a fully synchronized state wherein stable controlled transport is achieved when the coupling strength exceeds a threshold at which the collective dynamics is attained. This transition to collective transport is connected to a chaos-periodic\/quasiperiodic bifurcation in which current reversal is completely eliminated. Based on the Lyapunov stability theory and linear matrix inequalities, we give some necessary and sufficient criteria for stable controlled transport and obtain an exact analytic estimate of the threshold (kth) for the onset of stable controlled current","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/67762.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/35026\/1\/thresh2PostPrint.pdf","pdfHashValue":"da660bf26c296309f1e7b190704f1154c773aee4","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:35026<\/identifier><datestamp>\n      2018-01-24T03:06:07Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Controlling current reversals in synchronized underdamped ratchets.<\/dc:title><dc:creator>\n        Vincent, Uchechukwu<\/dc:creator><dc:creator>\n        Olusola, O. I.<\/dc:creator><dc:creator>\n        Mayer, D.<\/dc:creator><dc:creator>\n        McClintock, P. V. E.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        A pair of underdamped ratchets, coupled via a perturbed asymmetric potential, is shown to make a transition to a fully synchronized state wherein stable controlled transport is achieved when the coupling strength exceeds a threshold at which the collective dynamics is attained. This transition to collective transport is connected to a chaos-periodic\/quasiperiodic bifurcation in which current reversal is completely eliminated. Based on the Lyapunov stability theory and linear matrix inequalities, we give some necessary and sufficient criteria for stable controlled transport and obtain an exact analytic estimate of the threshold (kth) for the onset of stable controlled current.<\/dc:description><dc:date>\n        2010-03-31<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/35026\/1\/thresh2PostPrint.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1088\/1751-8113\/43\/16\/165101<\/dc:relation><dc:identifier>\n        Vincent, Uchechukwu and Olusola, O. I. and Mayer, D. and McClintock, P. V. E. (2010) Controlling current reversals in synchronized underdamped ratchets. Journal of Physics -London- a Mathematical and General, 43 (16). p. 165101. ISSN 0305-4470<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/35026\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/dx.doi.org\/10.1088\/1751-8113\/43\/16\/165101","http:\/\/eprints.lancs.ac.uk\/35026\/"],"year":2010,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"Controlling current reversals in synchronized\nunderdamped ratchets\nU E Vincent1,2‡, O I Olusola3, D Mayer2 and\nP V E McClintock1\n1 Department of Physics, Lancaster University, Lancaster LA1 4YB, United\nKingdom.\n2 Institut fu¨r Theoretische Physik, Technische Universita¨t Clausthal,\nArnold-Sommerfeld Str. 6, 38678 Clausthal-Zellerfeld, Germany.\n3 Department of Physics, University of Agriculture, P.M.B. 2240, Abeokuta, Nigeria.\nAbstract. A pair of underdamped ratchets, coupled via a perturbed asymmetric\npotential, is shown to transit to fully synchronized state wherein stable controlled\ntransport is achieved when the coupling strength exceeds a threshold at which the\ncollective dynamics is attained. The transition to collective transport is connected\nto chaos-periodic\/quasiperiodic bifurcation in which current-reversal is completely\neliminated. Based on Lyapunov stability theory and linear matrix inequalities, we\ngive some necessary and sufficient criteria for stable controlled transports; and obtain\nexact analytic estimate of the threshold (kth) for the occurrence of stable controlled\ncurrent.\nPACS numbers: 05.45.Xt, 05.45.Ac, 05.40.Fb, 05.45.Pq, 05.60.Cd,\nSubmitted to: J. Physics A: Mathematical & Theoretical\n1. Introduction\nThe ratchet effect, that is, the possibility of realizing directed transport without net\nbias in systems driven out of equilibrium, occurs in many natural situations ranging\nfrom physical through chemical to biological systems. Current reversal is a particularly\nintriguing phenomenon that has been central to recent experimental and theoretical\ninvestigations of transport based on the ratchet mechanism. Much of the recent research\ninterest in transport problems relates to the physics of molecular motors where unbiased,\nnoise-induced transport arises away from thermal equilibrium [1, 2, 3]. Such Brownian\nmotors, especially “ratchet” models, have been widely investigated for several reasons:\n‡ Permanent address: Department of Physics, Olabisi Onabanjo University, P.M.B. 2002, Ago-Iwoye,\nNigeria.\nE-mail: u.vincent@tu-clausthal.de\nPublished in J. Phys. A Math. Gen. 43, 165101 (2010).\nControlling current reversals in synchronized underdamped ratchets 2\n(i) to describe and control the mechanism underlying certain biological processes at\nboth the cellular level as found in ion channels and organism level, for instance\nmuscle contraction [4]; (ii) construction of nanoscale devices for guiding tiny particles\naimed at particle separation, smoothing of atomic surfaces during electromigration, and\ncontrol of the motion of quantized flux vortices in superconductors [2, 5]; and (iii)\nto explore the potential applications of the rectification power of such devices in the\ndesign and operations of high performance and dependable rectifiers, such as arrays\nof Josephson junction [6], long Josephson junctions [7], asymmetric superconducting\nquantum interference devices [8] and quantum electronic devices [5]. Some of these\npossibilities have already been demonstrated in practical applications [9, 10, 11].\nThe large variety of systems that exhibit the ratchet effect can be classified into\ntwo basic types. Those in the first class, where the system is driven out of equilibrium\nby a pulsating force, are called flashing ratchets. The second class is that of rocking (or\ncorrelation) ratchets wherein the system is driven by an external unbiased driving force.\nThe vast majority of these models are overdamped, and noise plays a vital role in the\ntransport process. Yet it has been found that deterministic chaos induced by the inertial\nterm can equivalently replace the role of noise [12, 13]. For inertial ratchets, moving\nin asymmetric rocking potentials, the dynamics and transport properties are strongly\ndependent on the system’s parameters as well as on the initial conditions; in particular,\nthe current can suddenly change direction at specific bifurcation points – these issues\nhave been carefully investigated in [12, 13, 14, 15, 16] and the effect of noise or disorder\nhave also been reported [17, 18, 19].\nTheoretical studies of ratchet models have been largely restricted to noninteracting\nor single-particle systems. However, in reality the interactions between particles are very\nimportant and cannot be ruled out in ratchet systems. For instance, it is well known\nthat molecular motors do not operate as a single particle but congregate in groups\nthat form multimotor – the most prominent example being the actin-myosin system in\nmuscles [20]. Similarly, systems such as microfluidic channels [21], 2DEG nanostructures\nwith strong electron-electron interactions at a large rs parameters [22] and granulated\nmaterials [24, 25], etc represent practical situations where particle-particle interactions\nare essential. For this reason, the relevance of two or more interacting particles, and\nthe effects of their collective dynamics on net transport, have attracted attention (e.g.\n[23, 26, 27, 28, 29, 30, 31, 32, 33] and references therein). Interaction among identical\nratchets can lead to a variety of synchronized dynamics (or collective effects); and stable\ndirected transport could be achieved when the strength of the interaction is larger than\nthe threshold beyond which full synchrony is achieved.\nIn general, synchronization can be understood as a collective state in which two\nor more systems, whose dynamics that can either be periodic or chaotic, adjust each\nother giving rise to a common dynamical behaviour [34]. This can be achieved when the\noscillators interact, either by coupling or forcing. Synchronization is directly related to\nthe observer problem in control theory in which a feedback mechanism is designed for\na receiver (response) system using the transmitted signal of a transmitter (driver) so\nControlling current reversals in synchronized underdamped ratchets 3\nas to ensure that the controlled receiver synchronizes with the transmitter [35]. On the\nother hand, the feedback could be such that the information is mutually transmitted\namong the interacting systems. The design of an effective interaction mechanism or\ncoupling required to achieve a desired synchronization goal is of current interest. Two\nfundamental tasks in the analysis and synthesis of such synchronizing systems are the\nstability of the synchronized state, and a precise determination of the synchronization\nthresholds – these quantities are particularly relevant from the viewpoint of practical\napplication [36], because they provide information regarding the operational regime for\noptimal performance in coupled oscillators.\nRecently, we showed that two mutually interacting ratchets in a perturbed\nasymmetric potential underwent a transition from an on-off intermittently synchronized\nstate to that of full synchronization where collective transport was achieved [37]. In\nthe present paper, we examine the transition to current collective transport and show\nthat depending on the strength of the driving it could be achieved through a chaos-\nperiodic\/quasiperiodic transition to full synchronization during which current-reversals\nare completely eliminated, thereby giving rise to fully rectified transports. We also\nstudy the stability of the fully synchronized state using Lyapunov stability theory and\nlinear matrix inequality (LMI) [38]; and we then give some sufficient conditions for\nglobal asymptotic synchronization, from which we estimate the threshold coupling for\nthe existence of collective and stable controlled transport. The paper is organized as\nfollows: In the next section, we start with a description of coupled ratchets and in\nSection 3 we provide a stability analysis for synchronization. We present numerical\nresults in Section 4; and summarise our conclusions in Section 5.\n2. Coupled inertia ratchets\nWe consider an archetypal model of two coupled underdamped rocking ratchets [13].\nTheir dynamics is given by\nx¨i + bx˙i +\ndV (x1, x2)\ndxi\n= a cos(ωt) (i = 1, 2), (1)\nwhere the normalized time t is measured in units of the small resonant frequency ω−10\nof the system. a, ω, and b are the amplitude and frequency of the external forcing, and\nthe damping parameter, respectively. V (x1,2) is the perturbed two-dimensional ratchet\npotential given as:\nV (x1, x2) = 2C − 1\n4pi2δ\n[Φ(x1) + Φ(x2)] +\nk\n2\n(x1 − x2)2, (2)\nwhere Φ(x1,2) = sin 2pi(x1,2−x0)+ 14 sin 4pi(x1,2−x0); the last term is the coupling term,\nand k is the coupling strength which determines the dynamics and hence the transport\nproperties of Eq. (1). The parameter x0 in Φ(x1,2) is chosen such that when k = 0 the\nminima of V (x1, x2) are located at the integers; whereas the other parameters are fixed.\nHere, we use x0 = 0.82, C = 0.0173 and δ = 1.6.\nControlling current reversals in synchronized underdamped ratchets 4\nFigure 1. Equipotential contours plot of V (x1, x2) with colors growing from blue\n(minima) to red (maxima): (a) No interaction, k = 0, (b) weak coupling, k = 0.05, (c)\nmoderate coupling, k = 0.15 and (d) strong coupling, k = 1.0.\nFig. 1 shows the perturbed 2-dimensional ratchet potential (2) for four different\nvalues of the coupling strength k(k = 0, 0.05, 0.15, 1.0). The minima and maxima of the\npotential are marked in blue and red respectively. Notice that, as the coupling strength\nis increased, the maxima of the potential V (x1, x2) move outward, opening up a valley\nalong the diagonal where the two ratchets may most likely share values. This suggests\nthat, for sufficiently large coupling strength, the oscillators would cooperate and achieve\noptimal transport in some favoured directions.\n3. Stability and criteria for controlled transport\nSystem (1) exhibits intermittent synchronization over a wide range of k values with full\nsynchronization being achieved for large enough coupling strength [37], during which\ncurrent-reversals are fully controlled. The stability of the fully synchronized state was\ntreated in [37] and the exact threshold was only obtained numerically. In what follows,\nwe show theoretically that the fully synchronized manifold (∆x(t) = x1(t)−x2(t) = 0) is\nstable and globally attractive. We establish criteria for global and asymptotic stability of\nthe system (1) on the manifold ∆x(t) = 0, defining the collective state for which current-\nreversals is completely eliminated. We can re-express each isolated ratchet derived from\nEq. (1) in autonomous form as\nx˙i = yi\ny˙i = − byi + σφ(xi) + a cos(ω0t) (i = 1, 2), (3)\nControlling current reversals in synchronized underdamped ratchets 5\nwhere φ(xi) = 2 cos 2pi(xi − x0) + cos 4pi(xi − x0), xi = (xi, yi)T ∈ R2(i = 1, 2) are the\nstate variables and σ = 1\n4piδ\n. In compact vector form, the coupled system is:\nx˙1 =Mx1 + f(x1) +m− u (4)\nx˙2 =Mx2 + f(x2) +m+ u (5)\nu = K(x− y)\nwhereM =\n(\n0 1\n0 −b\n)\n, f(x1) =\n(\n0\nσφ(x1)\n)\n, f(x2) =\n(\n0\nσφ(x2)\n)\n,m =\n(\n0\na cosω0t\n)\n,\nand K ∈ R2×2 is a constant feedback matrix.\nLet us define the synchronization error e, as the difference x1 − x2. Then, by\nsubtracting Eq. (5) from Eq. (4) one readily obtain:\ne˙ = (M − 2K +Q)e (6)\nwhere Q =\n(\n0 0\nq(x1,x2) 0\n)\n, and\nq(x1,x2) =\nσφ(x1, x2)\nx1 − x2 . (7)\nwhere φ(x1,x2) = φ(x1) − φ(x2). Obviously, e = 0 is an equilibrium point of the\nerror system (6) for vanishing K and full synchronization means that any set of initial\nconditions satisfies\nlim\nt→∞ ||e|| = limt→∞ ||x1(t)− x2(t)|| = 0 (8)\nwhere || . || represents the Euclidean norm of a vector. Thus, we treat the synchroniza-\ntion problem as that of asymptotic stability of the error system (6). For this purpose,\nwe shall employ Lyapunov’s stability theory and linear matrix inequality (LMI) in [38]\nto establish criteria for global synchronization according to Eq. (8). To begin with, we\nshall apply the following lemma to prove the main theorems of this paper.\nLemma 1: For q(x1, x2) defined by (9), the inequality\n|q(x1, x2)| ≤ 2\nδ\n(9)\nholds.\nProof: Since x0 = y0 = constant, by the differential mean-value theorem, the func-\ntion φ(x1,x2) can be expressed as\nφ(x1, x2) = 4pi(x1 − x2)σ(− sinϕ− sin η); (10)\nwhere ϕ, η ∈ [0, 2pi]. So that,\nq(x1,x2) = 4piσ(− sinϕ− sin η) = −(sinϕ+ sin η)\nδ\n, (11)\nand hence the inequality (9) holds.\nControlling current reversals in synchronized underdamped ratchets 6\nWe proceed by utilizing the stability theory for time-varying systems [38] to derive\nsufficient criteria for global synchronization in the sense of the error system (6). Here,\nwe propose two theorems. First using the linear matrix inequality, the following theorem\nis related to the general control matrix\nK =\n(\nk11 k12\nk21 k22\n)\n∈ R2×2 (12)\nTheorem 1: If the coupling matrix, K in (12) is chosen such that\n4k11 + 4k22 + 2b > 0\n8k11(2k22 + b) > (|1− 2k12 − 2k21|+ 2\nδ\n)2 (13)\nthen the coupled systems (4) and (5) achieve full synchrony.\nProof: According to the stability theory on time-varying systems [38], we know that\nthe system (6) is globally asymptotically stable at the equilibrium point e = (0, 0), if\nM − 2K +Q(t) + (M − 2K +Q(t))T\n=\n( −4k11 1 + q − 2(k12 + k21)\n1 + q − 2(k12 + k21) −2b− 4k22\n)\n(14)\nis negative definite. The eigenvalues λ of the matrix (14) above satisfy\nλ2 + (2b+ 4k11 + 4k22)λ+ 8k11(b+ 2k22)− (1 + q − 2(k12 + k21) = 0.\nAccording to the Routh-Hurwitz criteria for matrices [44], the matrix (14) is negative\ndefinite if and only if\n2b+ 4k11 + 4k22 > 0,\n8k11(b+ 2k22)− (1 + q − 2(k12 + k21))2 > 0. (15)\nBy Lemma 1, we have\n|1 + q − 2k12 − 2k21| ≤ |1− 2k12 − 2k21|+ 2\nδ\n. (16)\nThe inequalities (16) hold if the conditions (13) are satisfied. This completes the proof.\nBased on Lemma 1 and the above theorem, some synchronization criteria with re-\nspect to the coupling strength may be obtained, which are represented in the following\ncorollaries.\nCorollary 1: If the coupling matrix defined by K = diag(k1, k2) is chosen such that\n4k1 + 4k2 + 2b > 0\n8k1(2k2 + b) > (1 +\n2\nδ\n)2, (17)\nthen the coupled systems (4) and (5) are fully synchronized.\nProof: The inequalities (17) can be obtained from the inequalities (13) by setting\nk11 = k1, k22 = k2 and k12 = k21 = 0.\nControlling current reversals in synchronized underdamped ratchets 7\nCorollary 2: If the coupling, k in Eq. (1) is selected such that\nk >\n−b+\n√\nb2 + (1 + 2\nδ\n)2\n4\n= k1th, (18)\nthen the coupled systems (4) and (5) are fully synchronized.\nProof: The inequalities (18) can be obtained according to the inequalities (17) by\nsetting k1 = k2 = k.\nUsing Lyapunov stability theory, the following theorem is related to the general\ncontrol matrix\nK =\n(\nk11 k12\nk21 k22\n)\n∈ R2×2 (19)\nTheorem 2: If there exists a positive definite symmetric matrix given by P =(\np11 p12\np12 p22\n)\n> 0 ∈ R2, and the coupling matrix in (19) is chosen such that\nΩ1 = − 2k11p11 − 2k21|p12|+ |p12|( 2\nσ\n) < 0\nΩ2 = p12(1− 2k12)− p22(2k22 + b) < 0 (20)\n4Ω1Ω2 > [p11(1− 2k12)− p12(2k11 + 2k22 + b)− 2p22k21 + p22(2\nδ\n)]2\nthen the coupled systems (4) and (5) achieve full synchrony.\nProof: Let us assume a positive definite, decrescent and radially unbounded quadratic\nLyapunov function of the form:\nV (e) = eTPe (21)\nwhere P is a positive definite symmetric matrix as defined earlier. The derivative of the\nLyapunov function with respect to time, t, along the trajectory of the error system (6)\nis of the form:\nV˙ (e) = e˙TPe+ eTPe˙ (22)\nSubstituting (6) into the system (22), we have\nV˙ (e) = eT\n[\n(M− 2K+Q)TP+P(M− 2K+Q)\n]\ne (23)\nV˙ (e) < 0 if\nγ = (M− 2K+Q)TP+P(M− 2K+Q) < 0 (24)\nthat is\nγ =\n(\nµ11 µ12\nµ12 µ22\n)\n(25)\nControlling current reversals in synchronized underdamped ratchets 8\nwhere µ11 = −4p11k11 + 2p12(q − 2k21), µ12 = p11(1 − 2k12) − p12(2k11 + 2k22 + b) +\np22(q−2k21) and µ22 = 2p12(1−2k12)−2p22(b+2k22) respectively. The above symmetric\nmatrix is negative definite if and only if\n− 4p11k11 + 2p12(q − 2k21) < 0\n2p12(1− 2k12)− 2p22(b+ 2k22) < 0 (26)\n4[p12(q − 2k21)− 2p11k11][p12(1− 2k12)− P ∗ > 0\nwhere P ∗ = [p22(b+ 2k22)]− [p11(1− 2k12)− p12(2k11 + 2k22 + b) + p22(q − 2k21)]2\nBy Lemma 1, we have\n−4p11k11 + 2p12(q − 2k21) ≤ −4p11k11 − 4p12k21 + |2p12|q ≤ 2Ω1\n|p11(1−2k12)−p12(2k11+2k22+b)+p22(q−2k21)| ≤ |p11(1−2k12)−p12(2k11+2k22+b)−\n2p22k21| + p22(2δ ). The inequalities in (26) hold if the inequalities in (20) are satisfied.\nThis completes the proof.\nBased on Lemma 1 and the above theorem, some synchronization criteria with respect\nto the coupling strength may be obtained, which are represented in the following corol-\nlaries.\nCorollary 3: If the coupling matrix defined by K = diag(k1, k2) and the positive\ndefinite symmetric matrix P defined earlier is chosen such that\nk1 >\n|p12|(2δ )\n2p11\nk2 >\np12 − bp22\n2p22\n(27)\nβ1 > β2\nwhere β1 = 4[|p12|(2δ )− 2p11k1][p12− p22(2k2+ b)] and β2 = [|(p11− p12(2k1+2k2+ b)|+\np22(\n2\nδ\n)]2; then the coupled systems (4) and (5) achieve full synchrony.\nProof: The inequalities (27) can be obtained according to the inequalities (26) with\nk11 = k1, k22 = k2 and k12 = k21 = 0\nCorollary 4: The coupled systems (4) and (5) achieve global synchronization if the\ncoupling matrix K = diag{k, k} and the positive symmetric matrix P defined earlier\nare chosen such that\nk = max\n( |p12|(2δ )\n2p11\n,\np12 − bp22\n2p22\n)\n≥ 0\n16(p11p22 − p212)k2 − 8k[2p22|p12|(\n2\nδ\n) + Pbδ > 0 (28)\nwhere Pbδ = p11(p12−bp22)−|p12(p11−bp12)|]+4|p12|(2δ )(p12−bp22)−[|p11−bp12|+p22(2δ )]2\nProof: Letting k1 = k2 = k in the partial synchronization conditions (27), the in-\nequality (28) can be obtained .\nControlling current reversals in synchronized underdamped ratchets 9\nFor k > 0 given by (28), we have [p11 − p12(4k + b) + p22(2δ )]2 ≤ [|p11 − bp12|+ 4k|p12|+\np22(\n2\nδ\n)]2. Hence, the inequality (28) can be obtained from the partial synchronization\ncondition (27) with k1 = k2 = k. Since p11p22− p212 > 0, the solution k to the inequality\n(28) exists.\nRemark: We may select p12 = 0, p11 = p22(\n2\nδ\n), to construct a positive definite ma-\ntrix P = p22\n(\n2\nδ\n0\n0 1\n)\n. Based on this matrix, the following algebraic synchronization\ncondition can be obtained from the inequalities in (28):\nk >\n√\nb2 + 8\nδ\n− b\n4\n= k2th. (29)\nNotice that the conditions (18) and (29) are independent of the parameters of the driving\nforce. Thus we expect that, for different choices of external driving, different scenarios\nwould arise. By using parameter values b = 0.1 and δ = 1.6, we see that the two criteria\nyield k1th = 0.538 and k\n2\nth = 0.535, respectively, which are in good agreement.\n4. Results and Discussions\nIn this section, we present numerical simulation results to confirm the above analysis.\nIn Fig. 2, we use three indicators to quantify the transition to collective states, namely:\n(i) the bifurcation diagram for the error states e defining the difference between the\nstate variables x1 and x2 and the velocity of the particle; (ii) the average bare energies,\nh [43] illustrating the interaction mechanism; and (iii) the current J , quantifying the\ntransport. We remark here that our system is highly chaotic and as such, a single\ntrajectory approach is insufficient to capture its full dynamics; implying that e, h and\nJ have to be averaged out over a large number of trajectories generated from the entire\nspace [−1, 1]× [−1, 1] which forms the unit cell of the resulting periodic structure. For\na long time dynamics T , we can evaluate the error state (in the Poincare´ section) for a\ngiven trajectory as\nej =\n1\nT\n∫ T\n0\n(x\n(j)\n1 − x(j)2 )dt (30)\nwhere the full error e = N−1\n∑N\nj=1 ej, is evaluated over the total number of trajectories\nN . The average bare energies [43] defined as,\nh\n(j)\n1,2 =\n1\nT\n∫ T\n0\nh\n(j)\n1,2(t)dt; E\n(j)\n1,2(t) =\np\n2(j)\n1,2\n2\n+ V (x\n(j)\n1 , x\n(j)\n2 ), (31)\nwhere p\n(j)\n1,2 is the associated momentum and V (x\n(j)\n1 , x\n(j)\n2 ) is the potential is computed\nin the same manner. The current of a particle (i = 1, 2) over the total number N of\ntrajectories is defined as:\nJi =\n1\nM − nc\n1\nN\nM∑\nl=1\nN∑\nj=1\nx˙\n(j)\ni (tl) (i = 1, 2). (32)\nControlling current reversals in synchronized underdamped ratchets 10\nwhere tl of xi(tl) is a given observation time. This gives the average velocity; which\nis then further time-averaged over the number of observations M , where nc is an\nempirically obtained cut-off accounting for the transient effect such that a converged\ncurrent is obtained [16, 37].\nFirst, we fix the parameters b = 0.1, ω = 0.67 and a = 0.0809472 we display in Fig.\n2(a) the bifurcation of ej vs k. By inspection, we find that two remarkable dynamical\ntransitions are apparent. First, a sudden crisis occurs for low coupling strength in which\nchaotic behaviour gives way to a period two (P2 ) orbit in the periodic window. The\nP2 orbit is then annihilated when the strength of the interaction increases, and chaotic\nbehaviour is again re-enforced for a wide range of k. Secondly, a sudden bifurcation\ntakes place around a critical value kcr, (kcr ≈ 0.576) at which the dynamics of the two\nratchets become locked in a complete synchronization. For k ≥ kcr, the orbits of the\ntwo oscillators are periodic as depicted by the bifurcation plot in Fig. 2(c). This is in\nreasonable agreement with our theoretical predictions given by Eqs. (18) and (29). The\ncorresponding ensemble current J+ = J1 + J2 shown in Fig. 2(b), for the same range of\ncoupling, reveals that current-reversals still occur prior to the critical coupling strength\n(kcr). However, for k > kcr, the reversals are completely controlled and stable negative\ntransport is achieved.\nThe transition mechanism as well as the direction in which the particle’s motion is\nrectified in the synchronized state, depends on the parameters of the driving force. For\nfixed driving frequency (ω = 0.67), we show in Fig. 3 the behaviour of the current J+\nfor other values of the driving amplitude a. Clearly, we see three remarkable properties:\n(i) for a < 0.08, the positive direction is favoured and the particles motion is rectified\nin this direction when k > kcr (Fig. 3(a)); (ii) for 0.08 ≤ a ≤ 0.1, the negative direction\nis most favourable and the motion is rectified in this direction when k > kcr as shown\nin Fig. 3(a)); and (iii) for a > 0.12 the direction of rectification is strongly dependent\non the value of k (Fig. 3(b)) at variance with (i) and (ii), showing that the conditions\n(18) and (29) do not hold for large a, typically for a > 0.12.\nTo account for the deviation in (iii), we recall that, for larger values of the driving\namplitude a, there is a different bifurcation scenario – namely multistability of attractors\nare manifest in the uncoupled system [45]. The synchronization dynamics of multistable\nsystems has been an outstanding and challenging problem of long standing; and the\nanalysis and synthesis is moreover complicated when two identical multistable systems\nwith fractal basin boundries are coupled, like the system that we study here. Some\nrecent studies have shown that a variety of synchronization behaviours could be observed\n[50, 51, 52, 53], so that the departure which we observed here should be expected.\nHowever, detailed investigation of the characteristics of collective dynamics is on-going\nand will be reported elsewhere.\nThe bifurcation diagram of system (1) for the driving interval 0.1517 ≤ a ≤ 0.1574\ntypically shows that chaotic regions co-exist with periodic regions in the interval\n0.154 ≤ a ≤ 1.574 [45] (Fig. 4(a)). For a < 0.154, a period-1 attractor co-exists\nwith a period-2 attractor. In Fig. 4(b), we show the co-existing attractors for a = 0.156\nControlling current reversals in synchronized underdamped ratchets 11\n-0.9\n-0.6\n-0.3\n0\n0.3\n0.6\n0 0.2 0.4 0.6 0.8 1\nv\n2\n(c)\n-1.2\n-0.9\n-0.6\n-0.3\n0\n0.3\n0.6\n0.9\n1.2\n0 0.2 0.4 0.6 0.8 1\ne\n(a)\n-25\n-20\n-15\n-10\n-5\n0\n5\n0 0.2 0.4 0.6 0.8 1\nJ +\nk\n(d)\n0\n200\n400\n600\n800\n1000\n1200\n0 0.2 0.4 0.6 0.8 1\nh 1\n,2\nk\n(b)\nh1h2\nFigure 2. Transition to collective dynamics. (a) The bifurcation diagram for e vs k\nshows oscillator locking at the critical bifurcation point, (b) shows the average bare\nenergies h1,2 vs k, (c) bifurcation diagram of V2(x˙2) vs k and (d) corresponding\nensemble current J2 in same coupling range. The parameters are set as: a =\n0.0809472, b = 0.1, x0 = 0.82, and ω = 0.67.\nin Poincare´ section along with the trajectories plotted by using the initial conditions\n(x0, x˙0) = (−0.10, 0.25) and (x0, x˙0) = (0.43,−0.12) in Fig. 4(c). Accordingly, the\nbistable states exemplified above could be interpreted as binary mixtures of particles\n[23]. While the former case illustrates a binary mixture of non-identical particles of\ndifferent sizes (i.e. chaotic and periodic), the latter corresponds to a binary mixture\nof two identical particles (i.e. 2 periodic orbits). Notably, these situations are very\nsignificant and have been observed in recent experiments on transport of K and Rb\nions in an ion channel [46], particles of different size in asymmetric silicon pores [49],\npinned and interstitial vortices [47], and two different types of vortices[48]. For such\nco-existing states, the net effects on directed motion of particles when they interact,\nand the design of effective control mechanisms aimed at regulating or rectifying the net\ntransport, are challenges that have attracted much attention from researchers. In this\ndirection, Savel’ev et al. [23] proposed the auxiliary system approach which could be\napplicable in many practical situations.\nControlling current reversals in synchronized underdamped ratchets 12\n-50\n-40\n-30\n-20\n-10\n0\n10\n20\n30\n0 0.2 0.4 0.6 0.8 1\nJ\n+\nk\n(b)\na=0.156\n-25\n-20\n-15\n-10\n-5\n0\n5\n10\n15\n0 0.2 0.4 0.6 0.8 1\nJ\n+\nk\n(a)\na=0.074\na=0.078\na=0.0815\na=0.084\nFigure 3. Ensemble current J+ = J1+J2 vs coupling strength, k for different driving\namplitudes. (a) Weak amplitude 0.07 ≤ a ≤ 0.01,(b) strong amplitude a > 0.1. Other\nparameters are fixed as b = 0.1, x0 = 0.82, and ω = 0.67.\nNotice that the particle transport as captured by Fig. 3(b) shows that, as the\nstrength of the interaction is increased, there is an interplay between the co-existing\nstates such that either state is probable and one of the states (the most probable or\nstable attractor) would survive and “drag” the unstable state (attractor) for a given\nset of driving parameters. Thus, independent of the initial conditions, transport can be\nachieved in either direction. Specifically, Fig. 3(b) shows that, for 0.075 ≤ k ≤ 0.475\nand 0.55 ≤ k ≤ 0.815, the negative direction is most probable; thus the particles motion\nis rectified in the negative direction; and for 0.47 ≤ k ≤ 0.55 and 0.81 ≤ k ≤ 1.0,\nthe positive direction is the most probable, so that the current direction is positive. It\nthus clearly shows that the introduction of a specific interaction mechanism provides an\nefficient means for controlling transports and in particular current-reversals in non-\nequilibrium dynamical systems. This has potential applications for the design and\nControlling current reversals in synchronized underdamped ratchets 13\n-0.2\n-0.1\n0\n0.1\n0.2\n0.3\n0.4\n0.15 0.152 0.154 0.156 0.158\nv\n2\na\n(a)\nk = 0\n-0.25\n0\n0.25\n0.5\n-0.5 -0.25 0 0.25 0.5\nv\n2\nx2\n(b)\nk = 0\n-800\n-600\n-400\n-200\n0\n200\n400\n0 500 1000 1500 2000 2500 3000\nx\n1\n,2\n(t\n)\ntime, t\n(c)\nx1\nx2\nFigure 4. Dynamics of the system (1) when k = 0. (a) Bifurcation diagram\nshowing the range for co-existing attractors, (b) Poincare´ plot showing two co-existing\nattractors for a = 0.156, and (c) the corresponding trajectories of the attractors in\n(b) obtained using the initial conditions: (x0, x˙0) = (−0.10, 0.25) and (x0, x˙0) =\n(0.43,−0.12) (see details in [45]). The other parameters are fixed at b = 0.1, x0 = 0.82,\nand ω = 0.67.\noperation of high performance and dependable rectifiers, such as arrays of Josephson\njunction [6], long Josephson junctions [7], asymmetric superconducting quantum\ninterference devices [8] and quantum electronic devices [5].\n5. Concluding Remarks\nIn this paper, we have examined two underdamped ratchets coupled via a perturbed\nasymmetric potential. We have shown that transport can occur in their synchronized\nstate, which is achieved through a chaos-quasiperiodic bifurcation transition wherein\ncurrent-reversal is completely eliminated. Based on Lypunov stability theory and linear\nControlling current reversals in synchronized underdamped ratchets 14\nmatrix inequalities, some necessary and sufficient criteria for stable transport were\ndeduced; and an exact analytic estimate of the threshold (kth) for the occurrence of\ncollective transport was obtained. The criteria are expressed in algebraic form. They\nare strongly dependent on the driving force parameters and valid in the monostable\nstates of the system. In the multistable state where attractors co-exist, the dynamics and\ntransport properties are quite complicated; and in this regime, complete synchronization\ncould not be reached. This requires further investigation and will be reported\nelsewhere. Finally, we remark that the interaction mechanism employed here could be\nrealized experimentally by linking, for instance, two Josephson junctions in a parallel\nconfiguration via ac driving; and by adjusting the flux, such a device could serve as a\nvoltage rectifier which could be exploited in rapid single flux quantum technology.\nAcknowledgement\nUEV acknowledges research funding from the Alexander von Humbodlt Foundation,\nGermany. He also acknowledges the British Academy, the Engineering and Physical\nSciences Research Council and the Royal Society of London, for support through the\nNewton International Fellowship; and he thanks Olabisi Onabanjo University, Nigeria\nfor granting him Research Leave. We acknowledge useful discussions with Anatole\nKenfack and D. V. Senthilkumar.\nReferences\n[1] P. Reimann, Phys. Rep. 361 57 (2002); P. Reimann and P. Ha¨nggi, Appl. Phys. A 75 169 (2002).\n[2] P. Ha¨nggi et al., Ann. Phys. 14, 51 (2005).\n[3] R. D. Astumian and I. Dere´nyi, Eur. Biophys. J. 27, 474 (1998); D. A. Doyle et al., Science 276,\n179 (2002).\n[4] P. Ha¨nggi and R. Bartussek, in Nonlinear Physics of Complex Systems. Lecture Notes in Physics\nVol. 476, edited by J. Parisi, S. C. Muller, and W. Zimmermann (Springer, Berlin, 1996), pp.\n294-308.\n[5] See: the special issue in Appl. Phys. A: Mater. Sci. Process. 75, 169 (2002) on Ratchets and\nBrownian Motors: Basic experiments and Applications, edited by H. Linke.\n[6] F. Falo, P. J. Mart´ınez, J. J. Mazo and S. Cilla, Europhys. Lett. 45, 700 (1999).\n[7] E. Goldobin, A. Sterck, and D. Koelle, Phys. Rev. E 63, 031111 (2001).\n[8] I. Zapata, R. Bartussek, F. Sols, and P. Ha¨nggi, Phys. Rev. E 77, 2292 (1996).\n[9] J. E. Villegas et al., Science 302, 1188 (2003).\n[10] S. Matthias and F. Muller, Nature (London) 424, 53 (2003).\n[11] Z. Siwy and A. Fulin´ski, Phys. Rev. Lett. 89, 198103 (2002).\n[12] P. Junge, J. G. Kissner, and P. Ha¨nggi, Phys. Rev. Lett. 76, 3436 (1996).\n[13] J. L. Mateos, Phys. Rev. Lett. 84, 258 (2000).\n[14] M. Barbi and M. Salerno, Phys. Rev. E 62, 258 (2000).\n[15] F. Family, H. A. Larrondo, D. G. Zarlenga, and C. M. Arizmendi, J. Phys., Cond. Matter 17, 3719\n(2005).\n[16] A. Kenfack, S. M. Sweetnam, and A. K. Pattanayak, Phys. Rev. E. 75, 056215 (2007).\n[17] J. -H. Li, Phys. Rev. E 74, 011114 (2006).\n[18] C. M. Arimendi, F. Family, and A. L. Salas-Brito, Phys. Rev. E 63, 061104 (2001).\n[19] D. G. Luchinsky, M. J. Greenall, and P. V. E. McClintock, Phys. Lett. A 273, 316 (2000).\nControlling current reversals in synchronized underdamped ratchets 15\n[20] B. Alberts et al., The Molecular Biology of Cell (Garland, New York, 2002).\n[21] V. Studer, A. Pepin, Y. Chen, and A. Adjari, Analyst (Cambridge, U.K.) 129 944 (2004).\n[22] E. Abrahams, S. V. Kravchenko, and M. P. Sarachik, Rev. Mod. Phys. 73, 184301 (2004).\n[23] S. Savel’ev, F. Marchesoni, and F. Nori, Phys. Rev. Lett. 91, 010601 (2003); S. Savel’ev, F.\nMarchesoni, and F. Nori, Phys. Rev. Lett. 92, 160602 (2004); S. Savel’ev, F. Marchesoni, and\nF. Nori, Phys. Rev. E 71, 026228 (2005); S. Savel’ev and F. Nori, Chaos 15, 011107 (2005).\n[24] D. van der Meer, S. Scheidl, and V. M. Vinokur, Phys. Rev. Lett. 94, 186809 (2005).\n[25] B. Braunecker, D. E. Feldman, and J. B. Marston, Phys. Rev. B. 72, 125311 (2005).\n[26] S. Klimpp, A. Mielke, and C. Wald, Phys. Rev. E. 63, 031914 (2001); A. J. Fendrik, L. Romanelli,\nR.P.I. Perazzo, Physica A 368, 7 (2006); H. Goko, Phys. Rev. E 71, 061108 (2005); H.-Y. Wang\nand J.-D. Bao, Physica A 357, 373 (2005);ibid 374, 33 (2007).\n[27] U. E. Vincent et al., Phys. Rev E 72, 056213 (2005);\n[28] M. Kostur et al., Phys. Rev E 72, 036210 (2005).\n[29] H. Chen, Q. Wang, and Z. Zheng, Phys. Rev. E 71, 031102 (2005).\n[30] U. E. Vincent and J. A. Laoye, Phys. Lett A 363, 91, (2007).\n[31] U. E. Vincent and J. A. Laoye, Physica A 384, 230, (2007).\n[32] J. L. Mateos and F. R. Alatrieste, Chaos 18, 043125 (2008).\n[33] A. D. Chenpelianskii, M. V. Entin, L. I. Magarill, and D. L. Shepelyansky, Phys. Rev. E 78,\n041127 (2008).\n[34] A. Pikovsky, M. Rosenblum and J. Kurths, Synchronization: A Universal Concept in Nonlinear\nScience, (Cambridge University Press, Cambridge, 2001).\n[35] H. Nijmeijer, IEEE Trans. Circuits Syst. I, 44, 882 (1997).\n[36] A. Stefan´ski, Determination of Thresholds for Complete Synchronization and Application. (World\nScientific, Singapore, 2009).\n[37] U. E. Vincent, A. Kenfack, D. V. Senthilkumar, D. Mayer and J. Kurths, Current Reversals and\nSynchronization in Coupled Ratchets. Submitted.\n[38] X. Liao, L. Wang and P Yu, Stability of Dynamical Systems: In monographs series on Nonlinear\n(Elsevier B.V., Netherlands, 2007).\n[39] U. E. Vincent, A. N. Njah and J. A. Laoye, Physica D 231, 130 (2007).\n[40] U. E. Vincent, Acta Phys. Pol. B 38, 2459 (2007).\n[41] P. L. Lu, Y. Yang and L. Huang, Phys. Lett. A 372, 3978 (2008).\n[42] S. Xu, Y. Yang and L. Sond, Phys. Lett. A 373, 2226 (2009),\n[43] X. Wang et al., Phys. Rev. E 67, 066215 (2003).\n[44] R.A. Horn, C.R. Johnson, Topics in Matrix Analysis, Cambridge University Press, Cambridge,\n1991.\n[45] J. L. Mateos, Physica A 325, 92 (2003).\n[46] J. H. Morais-Carbral et al, Nature (London) 414, 37 (2001).\n[47] J. E. Villegas, S. Savel’ev, F. Nori, E. M. Gonzalez, J. V. Anguita, R. Garc´ıa, and J. L. Vicent,\nScience 302, 1188 (2003).\n[48] D. Cole, A. Crisan, S. J. Bending, T. Tamegai, K. van der Beek, and M. Koneczykowski, Physica\nC 404, 99 (2004).\n[49] S. Mathias and F. Muller, Nature (London) 424, 53 (2003).\n[50] A.N. Pisarchik et al., Phys. Rev. Lett. 96, 244102 (2006).\n[51] F. R. Ruiz-Oliveras and A. N. Pisarchik, Phys. Rev. E 79, 016202 (2009).\n[52] A. N. Pisarchik et al., Phil Trans. Roc. Soc. A 366, 459 (2008).\n[53] H. H. Zhu and J. Z. Yang, Chin. Phys. Lett. 25 2392 (2008).\n"}