{"doi":"10.1523\/JNEUROSCI.2975-03.2004","coreId":"66205","oai":"oai:dro.dur.ac.uk.OAI2:2523","identifiers":["oai:dro.dur.ac.uk.OAI2:2523","10.1523\/JNEUROSCI.2975-03.2004"],"title":"Integrated memory for object, place and context in rats : a possible model of episodic-like memory?","authors":["Eacott,  M. J.","Norman,  G."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2004-02-25","abstract":"We report an investigation into memory for an object, its spatial location, and the context in which it appeared in rats. A novel task based on the spontaneous recognition paradigm is presented that requires memory for these three aspects. This task is performed easily by intact rats at delays of up to 1 hr. However, performance of the task is severely and selectively disrupted by transection of the fornix. Ability to perform this task is discussed in relation to models of episodic memory in animals, and we suggest that this task provides a simple and useful animal model of episodic memory for use with rats","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66205.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2523\/1\/2523.pdf","pdfHashValue":"53adb8930df4075d9d2c36ce12463f36ba6e78f8","publisher":"Society for Neuroscience","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:2523<\/identifier><datestamp>\n      2017-02-24T10:30:34Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Integrated memory for object, place and context in rats : a possible model of episodic-like memory?<\/dc:title><dc:creator>\n        Eacott,  M. J.<\/dc:creator><dc:creator>\n        Norman,  G.<\/dc:creator><dc:description>\n        We report an investigation into memory for an object, its spatial location, and the context in which it appeared in rats. A novel task based on the spontaneous recognition paradigm is presented that requires memory for these three aspects. This task is performed easily by intact rats at delays of up to 1 hr. However, performance of the task is severely and selectively disrupted by transection of the fornix. Ability to perform this task is discussed in relation to models of episodic memory in animals, and we suggest that this task provides a simple and useful animal model of episodic memory for use with rats.<\/dc:description><dc:subject>\n        Rat<\/dc:subject><dc:subject>\n         Episodic<\/dc:subject><dc:subject>\n         Memory<\/dc:subject><dc:subject>\n         Fornix<\/dc:subject><dc:subject>\n         Context<\/dc:subject><dc:subject>\n         Object<\/dc:subject><dc:subject>\n         Place.<\/dc:subject><dc:publisher>\n        Society for Neuroscience<\/dc:publisher><dc:source>\n        Journal of neuroscience, 2004, Vol.24(8), pp.1948-1953 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2004-02-25<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2523<\/dc:identifier><dc:identifier>\n        issn:0270-6474<\/dc:identifier><dc:identifier>\n        issn: 1529-2401<\/dc:identifier><dc:identifier>\n        doi:10.1523\/JNEUROSCI.2975-03.2004<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2523\/<\/dc:identifier><dc:identifier>\n        https:\/\/doi.org\/10.1523\/JNEUROSCI.2975-03.2004<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2523\/1\/2523.pdf<\/dc:identifier><dc:rights>\n        This work is made available under a Creative Commons Attribution-Noncommercial-Share Alike 3.0 Unported license. Details are available at: http:\/\/creativecommons.org\/about\/licenses<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0270-6474"," 1529-2401","issn: 1529-2401","0270-6474"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2004,"topics":["Rat","Episodic","Memory","Fornix","Context","Object","Place."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n21 May 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nEacott, M. J. and Norman, G. (2004) ’Integrated memory for object, place and context in rats : a possible\nmodel of episodic-like memory ?’, Journal of neuroscience., 24 (8). pp. 1948-1953.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1523\/JNEUROSCI.2975-03.2004\nPublisher’s copyright statement:\nThis work is made available under a Creative Commons Attribution-Noncommercial-Share Alike 3.0 Unported license.\nDetails are available at: http:\/\/creativecommons.org\/about\/licenses\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nBehavioral\/Systems\/Cognitive\nIntegrated Memory for Object, Place, and Context in Rats:\nA Possible Model of Episodic-Like Memory?\nMadeline J. Eacott and Gillian Norman\nDepartment of Psychology, University of Durham Science Laboratories, Durham, DH1 3LE, United Kingdom\nWe report an investigation intomemory for an object, its spatial location, and the context inwhich it appeared in rats. A novel task based\non the spontaneous recognition paradigm is presented that requires memory for these three aspects. This task is performed easily by\nintact rats at delays of up to 1 hr. However, performance of the task is severely and selectively disrupted by transection of the fornix.\nAbility to perform this task is discussed in relation to models of episodic memory in animals, and we suggest that this task provides a\nsimple and useful animal model of episodic memory for use with rats.\nKey words: rat; episodic; memory; fornix; context; object; place\nIntroduction\nUnambiguously demonstrating episodic memory in nonhuman\nanimals has proved to be problematic. Tulving (1983) defined\nepisodic memory as memory that “receives and stores informa-\ntion about temporally dated episodes or events and temporal–\nspatial relations between them.” Thus, one approach is to inves-\ntigate memory for objects (what), their spatial location (where),\nand a temporal element (when). Clayton and colleagues (Clayton\nand Dickinson, 1998; Clayton et al., 2001) have shown that some\nbirds are indeed able to demonstrate memory for this critical\ntriad of memory attributes (“what, where, when”). The food-\nstoring habits of scrub jayswere used to show that the type of food\n(what), its location (where), and how long ago storage took place\n(when) can all be remembered and used for successful cache\nretrieval. Clayton et al. (2001) have claimed that this ability pro-\nvides a useful animal model of episodic-like memory. However,\nthis paradigm uses hand-reared jays and relies on their natural\nfood-storing habits, so it cannot be used directly with other com-\nmon laboratory animals.\nThe when element of the episodic-like triad has proved to be\nparticularly problematic in developing a task for use with rats.\nThus, we have taken another approach and considered the role of\ncontext in such tasks. Memory for the object and the context in\nwhich it was found is impaired after lesions within the putative\nmemory system in both monkeys (Gaffan and Harrison, 1989;\nGaffan, 1994a,b; Gaffan and Parker, 1996; Parker and Gaffan,\n1997a,b) and rats (Simpson et al., 1988; Gaffan et al., 2001). Back-\nground scenes defined the contexts, so Gaffan (1994a) used the\nterm “scene memory” and argued that scene memory is analo-\ngous to episodic memory.\nAlthough scenememory provides a possiblemodel of episodic\nmemory for use with nonhuman animals, it involves lengthy pre-\ntraining to demonstrate memory in both rats and monkeys.\nTherefore, we developed a simple and novel task to examine rats’\nability to demonstrate memory for objects, their spatial position,\nand the context in which they appeared. It is based on the spon-\ntaneous object recognition task (Ennaceur and Delacour, 1988),\nwhich uses rats’ spontaneous tendency to explore novel aspects of\ntheir environment. Rats are presented with two familiar objects,\nonly one of which has not been encountered previously in the\ncurrent location and context, although both location and context\nare themselves familiar. Thus, the configuration of object, loca-\ntion, and context is novel, although no other aspect or combina-\ntion of aspects is novel. If rats possess integrated memory for the\n“what, where, context” triad, we predict that they will preferen-\ntially explore the object that appears in a novel configuration of\nplace and context over an object that is in a familiar location and\ncontext.\nIn experiment 1, intact animals were used to establishwhether\nrats could reliably demonstrate memory in this task. Subse-\nquently, in experiments 2 and 3, the contributions of the hip-\npocampal system (through fornix transection) and two cortical\nareas (through lesions of the perirhinal and postrhinal cortices)\nto performance in this task were examined.\nMaterials and Methods\nExperiment 1\nSubjects\nTen experimentally naive dark Agouti rats were used. Testing began\nwhen the animals were \u00024 months old. They were housed in groups in\ndiurnal conditions (12 hr light\/dark cycle). All testing took place during\nthe light phase. Throughout the study, all animals had ad libitum access\nto food and water.\nApparatus\nTesting was conducted in an open field made of wood (base dimensions,\n1 m2; height, 48 cm). It could be configured to provide two different\ncontexts. In context 1, the base was painted matte black, and the walls\nwere painted matte white. In context 2, the base was 1.5 cm2 white\nReceived June 17, 2003; revised Dec. 8, 2003; accepted Dec. 17, 2003.\nThis work was supported by Biotechnology and Biological Sciences Research Council Grant SO9835 to M.J.E. and\nE. A. Gaffan. We thank Steve Nagle and Christine Richardson for technical assistance.\nCorrespondence should be addressed to Dr. M. J. Eacott, Department of Psychology, Science Laboratories, South\nRoad, Durham, DH1 3LE, UK. E-mail: M.J.Eacott@durham.ac.uk.\nDOI:10.1523\/JNEUROSCI.2975-03.2004\nCopyright © 2004 Society for Neuroscience 0270-6474\/04\/241948-06$15.00\/0\n1948 • The Journal of Neuroscience, February 25, 2004 • 24(8):1948–1953\nplastic-coated wire mesh overlaid on a black base, and the walls were\nnatural wood. Junk objects were placed into the open field equidistant\nfrom the sides of the open field. The objects used were gathered from a\nrange of sources, with the following collection criteria: it should be pos-\nsible to collect four identical copies; they should be stable (or suitable for\nweighting) so that they do not topple when explored by rats; they should\nall be of a broadly similar size; and they should bemade of amaterial that\ncannot be gnawed easily by the rats within the confines of the experiment\n(e.g., glass, metal). Examples of objects used include bottles, jars, candle-\nsticks, and ornaments.\nHabituation\nThe rats received eight habituation sessions at a rate of one per day, to\nhabituate them to the open field, to the contexts to be used in the study,\nand to the junk objects. Four habituation sessions used context 1, and\nfour used context 2. In each habituation session, a different single object\nwas placed in the center of the open field. These objects were not reused\nin later parts of this study. During habituation, the rats were placed in the\nopen field and allowed to explore freely. The first habituation session in\neach context took place in cage-mate groups and lasted 30 min. Subse-\nquent sessions took place singly, and each lasted 10 min. After comple-\ntion of habituation, testing of the main task took place.\nBehavioral testing\nIn the experimental task, each trial consisted of two exposure phases\nfollowed at a delay of 2, 5, 10, 15, 30, 60, or 120 min by a test phase (Fig.\n1). In the first exposure phase, the open field was configured as context 1\nand contained a copy of a novel object (A) on the left side of the open field\nand a copy of a different novel object (B) on the right side. For the second\nexposure phase, the open field was configured as context 2 and contained\na second copy of object B on the left side and a second copy of object A on\nthe right side. In the test phase, the open field was configured either as\ncontext 1 or as context 2 and contained two additional copies of either\nobject A or object B, one on the left and one on the right, equidistant from\nthe sides of the open field.Multiple copies of objects were used to prevent\nodor marking, etc.\nFor each exposure phase, the animal was placed into the open field and\nallowed to explore until it had spent at least 15 sec exploring each object,\nsubject to a minimum of 2 min and a maximum of 5 min in the open\nfield. Exploration of an object was defined as the rat’s nose being within\n1 cm of and oriented toward the object, sniffing at, or otherwise closely\nattending to the object. This definition excludes using the object merely\nas support during rearing or sitting on the object. After the first explora-\ntion phase, the rat was removed from the open field and placed in a\nholding cage for\u00022min to allow the objects and context within the open\nfield to be changed. The animal was then returned to the open field for\nthe second exploration phase. After the second exploration phase, there\nwas a delay of 2, 5, 10, 15, 30, 60, or 120min in the holding cage before the\nanimal was returned to the open field for the test phase. In the test phase,\neach rat was placed in the open field for 3 min, and the time spent\nexploring each of the two copies of the object was recorded.\nEach rat was tested at each delay on four separate occasions, each using\nnovel objects. On two of these occasions, context 1 was used in the test\nphase, and on two occasions, context 2 was used. Equally, within each\ncontext, one test phase used two copies of object A, and the other used\nobject B. Thus, at each delay, each animal was tested using all four com-\nbinations of context and objects. The left–right position within the open\nfield in which an object appeared in each context was controlled between\nanimals, as was the order in which the contexts were experienced. Rats\nexperienced only one test session (two exploration phases and one test\nphase) per day and were tested 5 or 6 d per week.\nExperiment 2\nSubjects\nA total of 46 dark Agouti rats that had taken part previously in tests\ninvolving object–context configurations within the spontaneous recog-\nnition paradigm (Norman and Eacott, 2004) were used. Testing began\n\u00023 weeks after completion of those experiments, when they were \u00028\nmonths old. They were housed in pairs in diurnal conditions (12 hr\nlight\/dark cycle) and tested during the light cycle. Because the animals\nhad completed other experiments recently in the same apparatus, they\ndid not require additional habituation.\nSurgery\nSurgery was performed on 50 animals. Four animals died during surgery\nor as a result of perioperative complications. Of the remainder, 12 ani-\nmals received bilateral lesions of the perirhinal cortex, 12 received bilat-\neral lesions of the postrhinal cortex, 11 animals received bilateral fornix\nlesion, and 11 animals were sham operated.\nPerirhinal lesions. The target lesion was based on the limits of the perirhi-\nnal cortex, as delineated by Burwell and colleagues (Burwell et al., 1995;\nBurwell and Amaral, 1998; Burwell, 2001). Each rat was anesthetized\nusing halothane, and then its head was shaved and positioned in a ste-\nreotaxic headholder angled at 5°. A total of 0.5 ml of the analgesic vetag-\nesic was administered subcutaneously. The scalp was incised along the\nmidline, and bregmawasmeasured at an angle of 12o. The top of the skull\nwasmeasured at three points, 3, 4, and 5mmposterior and 5.1mm lateral\nto bregma. Using a dental drill, a portion of the lateral surface of the skull\noverlying the rhinal sulcus was removed. The dura was cut to allow the\ninsertion of an electrode into the brain. Lesions were made using an\nRFG4-ARF lesion generator (Radionics, Burlington,MA). The electrode\n(tip length, 0.3mm; diameter, 0.25mm)was lowered at an angle of 12o at\nthe three points stated above to a depth of 6.6 mm below the top of the\nskull. Current was passed such that a temperature of\u000275°Cwas achieved\nfor 1min. The electrodewas thenwithdrawn, bregmawasmeasured at an\nangle of \u000312o, and the procedure was performed contralaterally. The\nscalp was closed using wound clips, and antibacterial wound powder was\napplied. Each animal received 5 ml of warmed saline and 0.3 ml of the\nrespiratory stimulant milophyline subcutaneously.\nPostrhinal lesions. The target lesion was based on the limits of the\npostrhinal cortex, as delineated by Burwell and colleagues (Burwell et al.,\n1995; Burwell and Amaral, 1998; Burwell, 2001). The initial procedure\nwas the same as that for the perirhinal lesions, with the exception that ear\nbar zero was also measured. After a midline incision, both bregma and\nlambda were measured. Multiple estimates of the three lesion sites were\nobtained using measurements based on bregma, lambda, and ear bar\nzero using the coordinates shown in Table 1.\nWhen estimates based on different sites differed, judgment was used,\nwith greater weight being given when two sets of calculations agreed\nclosely. The top of the skull wasmeasured at each of the selected sites. An\narea of the skull overlying the target regionwas removed, the durawas cut\nat each site to allow the insertion of an electrode into the brain, and the\nelectrode was lowered vertically to the required depth. Current was\npassed as described previously. The procedure was repeated contralater-\nally, and the scalp was closed.\nFornix lesions. The initial procedure was the same as that used for\npostrhinal lesions.Once themidline incision had beenmade, bregmawas\nmeasured, and the first lesion site was calculated as 5.3 mm anterior and\n0.7mm lateral to ear bar zero and 0.4mmposterior and 0.7mm lateral to\nbregma. A mean was used when the anteroposterior positions differed\nbetween the two calculations. A second target site was calculated in the\nsame way, using a mediolateral measurement of 1.7 mm lateral to both\nbregma and ear bar zero. The skull overlying these sites on each side of\nthe midline was removed in a single section. The top of the dura was\nmeasured at each of the target sites. The dura was cut at each site, and\nthe electrode was lowered. At the first site, depths of 4.5 mm relative\nFigure1. Aschematic representationof anexampleof twoexposurephases anda test phase\nfrom experiments 1 and 2. In the two exposure phases, the open field contains two different\nobjects, whereas in the test phase, two copies of a single object are used.\nEacott and Norman • Memory for Object, Place, and Context in Rats J. Neurosci., February 25, 2004 • 24(8):1948–1953 • 1949\nto the top of the skull measured at bregma and 3.7mm relative to the top\nof the dura were used. At the second site, the depths were 4.6mm relative\nto the top of the skull at bregma and 3.8 mm relative to the top of the\ndura. Current was passed as described previously. The procedure was\nrepeated on the contralateral side, and then the scalp was closed.\nSham surgery. The procedure for the sham animals was identical to\nthat for the animals in the lesion groups, except that the electrodewas not\nlowered into the brain. Four of the animals had their skulls removed as if\nfor a perirhinal lesion, four had their skulls removed as if for a bilateral\npostrhinal lesion, and three had their skulls removed as if for a bilateral\nfornix lesion.\nFor histological purposes, at the end of testing, operated animals were\nperfused intracardially with a 5% formal saline solution. Their brains\nwere removed, embedded in wax, and coronally sectioned into 10 \u0002m\nslices. Every 10th section was stained with cresyl violet (Nissl stain).\nBehavioral task\nThe procedure was identical to that for experiment 1, except that only\ndelays of 2 and 5 min were used.\nExperiment 3: memory for objects and place\nExperiment 3was designed as a control for the effect of place alone on the\nfamiliarity of an object in experiment 2. The same animals used in exper-\niment 2 took part in experiment 3. The open field was configured as\ncontext 1 throughout this experiment. There was a single exposure phase\nthat was identical to the first exposure phase of experiment 1 (i.e., object\nA on the left and object B on the right) (Fig. 2). After the single exposure\nphase and a delay of 2 or 5min, the animal was returned to the open field\nfor the test phase. For the test phase, the open field contained two copies\nof object A, one on the left and one on the right. The test phase lasted 3\nmin, and the time spent exploring each of the two copies of object A was\nrecorded. The side of the open field on which each object appeared in the\nexposure phase was controlled for between animals, as was the object\nused in the test phase. The experiment was repeated twice at each delay\nusing different objects each time.\nData analysis\nThe difference between time spent exploring the objects in the novel and\nfamiliar object–place context (experiments 1 and 2) or object–place (ex-\nperiment 3) combinationswas calculated as a proportion of the total time\nspent exploring both objects (Ennaceur and Delacour, 1988). On this\nmeasure, a value of zero reveals no difference in exploration of the two\nobjects. Values higher than zero (with a maximum of one) reveal greater\nexploration of the novel combination of object–place context (experi-\nments 1 and 2) or object–place (experiment 3).\nResults\nHistology\nPerirhinal\nOne animal died before perfusion could take place. However,\ndeath occurred a substantial amount of time after the completion\nof testing. There was no indication that this animal’s perfor-\nmancewas in anyway affected by illness or disability.Histological\nanalysis revealed that in all other cases, the perirhinal lesions were\nessentially as intended, extending \u00023.0–6.5 mm posterior to\nbregma, as delineated by Burwell et al. (1995), although theywere\nnot complete lesions, with some sparing of the caudal part of the\nperirhinal cortex. This was significant in five of the animals, al-\nthough lesion size assessed qualitatively showed no relationship\nwith performance. Figure 3 (left) shows the extent of the smallest\nand largest lesions.\nPostrhinal\nAs intended, the lesions were all posterior to those found in the\nanimals with perirhinal lesions. There was considerable variation\nin the extent of the lesions, but they were all within the area\ndelineated by Burwell and colleagues (Burwell et al., 1995; Bur-\nwell and Amaral, 1998; Burwell, 2001), although a number of\nanimals showed some damage to the temporal cortex. Figure 3\n(middle) shows the extent of the largest and smallest lesions.\nQualitative analysis showed no indication that the size of these\nlesions affected behavioral performance\nFornix\nAll of the animals had extensive bilateral damage to the fornix. In\nall cases, the fornix was transected completely at anterior levels,\nalthough the anteroposterior extent of the damage varied. All\nanimals had bilateral damage to the posterior part of the lateral\nseptum in addition to the fornix lesions. There was some hip-\npocampal damage in those animals with more extensive lesions,\nwith two animals showing bilateral damage and three showing\nunilateral damage. There was no damage to the corpus callosum.\nFigure 3 (right) shows the extent of the largest and smallest lesions.\nBehavioral\nExperiment 1: memory for objects, place, and context in intact rats\nThe data were analyzed using a 7 (delay)\u0004 2 (context) ANOVA,\nwhich revealed a large effect of delay (F \u0005 4.23; df \u0005 6, 54; p \u0005\n0.001) but no effect of context (F\u0006 1) andno interaction between\ndelay and context (F \u0006 1). Analysis at each delay using one-\nsample t tests showed that, as can be seen in Figure 4, animals\ndiffered from chance (zero) at all delays except 2 hr (2–15 min,\nt\u0007 3.9, df\u0005 9, p\u0006 0.01; 30 min and 1 hr, t\u0007 2.60, df\u0005 9, p\u0006\n0.05; 2 hr, t\u00061).\nIn total exploration, there was amain effect of delay (F\u0005 3.18;\ndf\u0005 6, 54; p\u0005 0.01), and although there was no effect of context\n(F\u0005 1.61; df\u0005 1, 9; p\u0007 0.05), there was an interaction between\ndelay and context (F\u0005 6.54; df\u0005 6, 54; p\u0006 0.001). These effects\nwere caused by the animals showing less exploration in context 1\nthan in context 2 at delays of 5 and 10 min.\nTable 1. Coordinates of the lesion sites for postrhinal lesions relative to landmarks of ear bar zero (EBZ), bregma (Br), and lambda (Lmd)\nSite 1 Site 2 Site 3\nEBZ Br Lmd EBZ Br Lmd EBZ Br Lmd\nAP \b0.2 \u00035.8 \b2.0 \u00031.3 \u00037.1 \b0.7 \u00031.8 \u00037.6 \b0.4\nML \t6.1 \t5.8 \t5.7\nDV \b2.8 \u00038.5 \u00036.6 \b3.8 \u00037.8 \u00035.8 \b4.2 \u00036.8 \u00034.8\nAll measurements are given in millimeters. AP, Anteroposterior; ML, mediolateral; DV, dorsoventral.\nFigure 2. A schematic representation of an example of an exposure and a test phase from\nexperiment 3. In the exposure phase, the open field contains two different objects, whereas in\nthe test phase, two copies of a single object are used.\n1950 • J. Neurosci., February 25, 2004 • 24(8):1948–1953 Eacott and Norman • Memory for Object, Place, and Context in Rats\nExperiment 2: memory for objects, place, and context\nA 4 (lesion) \u0004 2 (context) \u0004 2 (delay) ANOVA revealed a large\ndifference between the groups (F\u0005 17.58; df\u0005 3, 40; p\u0006 0.001).\nPost hoc analysis of these main effects of lesion using Tukey’s test\nshowed that the fornix animals were severely impaired compared\nwith the sham animals ( p \u0006 0.001) (Fig. 5). They were also se-\nverely impaired compared with both perirhinal and postrhinal\nanimals ( p \u0006 0.001), although no other lesion group differed\nfrom the shams. There were no effects of delay (F\u0005 2.00; df\u0005 1,\n40; p\u0007 0.05) or of context (F\u0006 1) and no interactions between\nthe variables (F \u0006 1), indicating that the fornix deficit was con-\nsistent across delays and testing contexts. One-sample t tests at\neach delay indicated that all groups were above chance at both\ndelays (in all cases, t \u0007 5; p \u0006 0.001) except the fornix-lesioned\nanimals (in both cases, t \u0006 1). (Degrees of freedom are 10 for\nsham and fornix groups and 11 for perirhinal and postrhinal\ngroups.) Thus, there is no evidence that the behavior of the fornix\ngroup discriminated between the objects in familiar and novel\ncombinations of object–place and context.\nAnalysis of the levels of object exploration shown by the\ngroups using a 4 (lesion)\u0004 2 (context)\u0004 2\n(delay) ANOVA showed that there was no\ndifference between the groups in the total\namount of object exploration (F \u0005 1.08;\ndf\u0005 3, 40; p\u0007 0.05), no effect of delay on\nthe amount of exploration (F\u0005 1.48; df\u0005\n1, 40; p \u0007 0.05), and no interaction be-\ntween delay and lesion (F\u0006 1). Thus, there\nis no evidence that the differences shown\nabove can be attributed to differences be-\ntween groups in levels of exploration.\nExperiment 3: memory for objects\nand place\nThis experiment was designed to control\nfor the effect of place in experiment 1. A 4\n(lesion) \u0004 2 (delay) ANOVA was per-\nformed (Fig. 6), which revealed no differ-\nences between the groups (F \u0006 1). There\nwas also no effect of delay (F\u0006 1) and no\ninteraction (F \u0006 1). One-sample t tests\nshowed that all groups were above chance\nat both delays (t \u0007 3.27; p \u0006 0.01) except\nfor the perirhinal animals at 2 min (t \u0005\n2.03; p \u0005 0.07). However, because this\ngroupwas above chance at 5min (t\u0005 3.29;\np \u0006 0.01), this result is anomalous. De-\ngrees of freedom are 10 for sham and fornix groups and 11 for\nperirhinal and postrhinal groups. There was no difference be-\ntween the groups in total exploration (F\u0005 2.640; df\u0005 3, 40; p\u0005\n0.063), but there was a main effect of delay (F\u0005 8.91; df\u0005 1, 40;\np\u0006 0.01) and an interaction between delay and lesion (F\u0005 3.40;\ndf \u0005 3, 40; p \u0006 0.05). This resulted from all groups except the\nfornix animals showing less exploration at the 5min delay than at\nthe 2 min delay, with the fornix animals displaying the opposite\npattern of behavior.\nDiscussion\nBoth intact and sham-operated rats showed a clear preference for\nexploring an object that is in a novel configuration with location\nand context over an object that is in a familiar configuration.\nAlthough this preference diminished with increasing delay, in\nintact rats, it was robust at delays of up to 15 min and apparent at\ndelays of up to 1 hr. Moreover, the memory was formed and\nexpressed in the absence of explicit training or motivation and\nthus reflects a naturally formed memory.\nMemory over a 1 hr delay in this task can be contrasted with\nmemory within the standard spontaneous recognition paradigm,\nfor which sham-operated rats in our laboratory have shown\nmemory for single objects at delays of at least 24 hr (Norman and\nEacott, 2004). Although memory in the current task is apparent\nonly at delays of up to 1 hr, the task used two different presenta-\ntion episodes, and because either context could be used at the test\nphase, memory for both episodes was demonstrated. Moreover,\nthe two presentation episodes were very similar, yet the memory\ncontained sufficient detail to distinguish between them. Studies\nusing a range of objects in the standard spontaneous recognition\nparadigm in our laboratory have shown that the delay over which\nreliable discrimination can be shown is much reduced when the\nstimuli are more confusable (Norman and Eacott, 2004). Thus, a\ndirect comparison with simple object recognition in the standard\nspontaneous recognition paradigm is not valid. In the present\ntask, rats showed memory for two different, highly confusable\nFigure3. Histological results for the three lesion groups. From left to right, the groups are perirhinal, postrhinal, and fornix. On\neach section, the largest (stripes) and smallest (semitransparent gray) lesions are shownon standard sections taken from the atlas\nof Paxinos and Watson (1998).\nFigure4. The results fromexperiment 1, as themeandifference between time spent explor-\ning the objects in the novel and familiar object–place–context combinations, calculated as a\nproportion of the total time spent exploring both objects. On this measure, a value of zero\nreveals no difference in exploration of the two objects. Values higher than zero reveal greater\nexploration of the novel object–place– context combination. Errors bars represent SEM.\nEacott and Norman • Memory for Object, Place, and Context in Rats J. Neurosci., February 25, 2004 • 24(8):1948–1953 • 1951\nepisodes after a single exposure over delays of up to 1 hr, which\ncompares well with other memory tasks.\nHaving established that the rats can demonstrate relatively\nlong-lasting memory for configurations of objects, their spatial\nlocations, and the contexts in which they appeared, we consider\nfurther the nature of the memory. In this task, two highly similar\npresentation events were distinguished by the contexts in which\nthey appeared. Thus, context served as an “occasion specifier,”\nwhich was used in memory to distinguish the two occasions. We\nargue that this is similar to the role played by temporal context in\nthe demonstration of episodic-like memory in scrub jays (Clay-\nton and Dickinson, 1998; Clayton et al., 2001). The temporal\naspect in these studies may be viewed as merely defining the\ntemporal context of the caching event, aiding in distinguishing\none event from other similar events. In humans, memory for the\ntemporal context of events is notoriously poor and is dissociable\nfrom episodic memory itself (for review, see Friedman, 1993).\nThus, although episodic memory in humans is associated with a\nfeeling of the past (Tulving, 2001), it need not involve memory\nfor the time of occurrence, although it does involve memory for\nevents that occurred on a specific past occasion. Thus, we argue\nthat the temporal aspect of the episodic triad (when) may be\nmerely a particular example of a characteristic of thememory that\nspecifies the occasion of the event. We argue that it is in this\noccasion-specification role that temporal context may be impor-\ntant to episodic-like memory. This role may be represented\nequally by context, as it is in the current study. Thus, we argue\nthat the critical triad of episodic-likememorymay be redefined to\ninclude any occasion-specifying characteristic of event memory\nin place of the specifically temporal when. In this sense, both the\nepisodic-like memory exhibited by jays (Clayton and Dickinson,\n1998; Clayton et al., 2001) and scene memory (Gaffan, 1994a)\ninvolve our redefined triad of episodic-like memory (what,\nwhere, and occasion-specifying context).\nTo assess the significance of rats’ ability in this task, we also\nconsider whether the performance demonstrated could occur on\nthe basis of familiarity alone (Mandler, 1980). In this task, all of\nthe components (objects, locations, and contexts) are equally\nfamiliar. Moreover, even combinations of any two components\nare equally familiar. For example, object A has been experienced\nin both context 1 and 2 and has appeared on both the left and the\nright. It is only the combination of object, context, and location\nthat is novel. This rules out some possible explanations of our\nresults. For example, one cannot claim that an object appears\nrelatively novel because the reflective qualities of the context give\nit a slightly different appearance: both objects have been experi-\nenced in both contexts. One would have to claim that the unique\ncombination of object position and context resulted in a subtly\ndifferent appearance sufficient to result in a strong preference in\nan untrained rat. We do not consider that this explanation of our\nresults is plausible. However, we are currently devising experi-\nments to exclude conclusively this possibility.\nIf the current task were a model of episodic memory, it would\nbe predicted thatmemory in this task should be severely impaired\nby lesionswithin the hippocampal system. This is indeed the case.\nFornix transection resulted in a severe impairment in this task, an\neffect specific to fornix lesions, because neither perirhinal nor\npostrhinal lesions impaired the task at the delays tested.\nThe lack of impairment in the perirhinal group is not surpris-\ning: although causing clear impairments of object recognition at\nlonger delays than are used here (Ennaceur et al., 1996), peri-\nrhinal lesions do not impair object–place memory (Ennaceur et\nal., 1997) and cause relatively mild, delay-dependent impair-\nments of object–context memory (Norman and Eacott, 2004).\nHowever, we found previously that postrhinal lesions impair\nmemory for object–context associations to a greater extent than\ndo fornix lesions (Norman and Eacott, 2004), suggesting that the\npresent task makes different demands on memory than the\n“object-in-context” task. Indeed, this result was found with\nthe very same group of postrhinal animals. Thus, the absence of\nan impairment in the current study cannot be ascribed to the\nabsence of a functional lesion in the postrhinal groups. Equally,\nthe perirhinal group has revealed previously a marked impair-\nment in object recognition (Norman and Eacott, 2004), again\nconfirming that the lesion was functional.\nIt initially appeared possible that the fornix deficit in the ob-\nject–place context task resulted from the object–place element,\nbecause fornix animals have been found repeatedly to be im-\npaired on such a task (Ennaceur and Meliani, 1992; Ennaceur et\nal., 1997). Yetwe foundno object-in-place deficit (experiment 3).\nHowever, the delays used here are extremely short comparedwith\nthe standard 15 min delay used by many studies, so that the\nfailure to find a deficit in any of the groups is less surprising than\nit might seem at first. An impairment at longer delays might\nreasonably be predicted. Nonetheless, the lack of an impairment\nin the object–place task at the delays used contrasts strongly with\nthe severe fornix impairment in the object–place–context task at\neven very short delays, and thus emphasizes the importance of the\nfornix for the object–place–context task.\nOur design has some similarity to object-in-context designs\nFigure5. The results fromexperiment 2, as themeandifference between time spent explor-\ning the objects in the novel and familiar object–place–context combinations, calculated as a\nproportion of the total time spent exploring both objects. On this measure, a value of zero\nreveals no difference in the exploration of the two objects. Values higher than zero reveal\ngreater explorationof thenovel object–place– context combination. Errors bars represent SEM.\nFigure 6. The results from experiment 3 as themean difference between time spent explor-\ning the objects in the novel and familiar object–place combinations, calculated as a proportion\nof the total time spent exploring both objects. On this measure, a value of zero reveals no\ndifference in exploration of the two objects. Values higher than zero reveal greater exploration\nof the novel object–place combination. Errors bars represent SEM.\n1952 • J. Neurosci., February 25, 2004 • 24(8):1948–1953 Eacott and Norman • Memory for Object, Place, and Context in Rats\n(Dix andAggleton, 1999). However, neither hippocampal lesions\n(Mumby et al., 2002) nor fornix lesions (Norman and Eacott,\n2004) result in impairments in object-in-context tasks, which are\nas uniformor as severe as those reported here.However, themore\nsevere deficits reported here do not result from increased task\ndifficulty, because our task was acquired effortlessly by sham-\noperated animals. Therefore, itmust be concluded that the fornix\nimpairment is produced by the combination of object, place, and\ncontext rather than by any of these elements alone or in pairs or\nby the difficulty of the task itself.\nThese results suggest that the current object–place–context\ntask is processed by a differentmemory system than that involved\nin processing either the object-in-context (Mumby et al., 2002)\nor the standard spontaneous object recognition (Ennaceur et al.,\n1997) tasks. Such a memory system would appear to depend on\nan intact hippocampus, either alone or as part of an extended\nmemory system concerned with episodic-like memory. In con-\ntrast, the standard object recognition task is heavily dependent on\nthe perirhinal cortex (Ennaceur et al., 1996), whereas the object-\nin-context task is dependent on an intact postrhinal cortex (Nor-\nman and Eacott, 2004). This may reflect the difference between\nthe recall of an episodic memory relating to a specific event de-\nfined by occasion and place compared with mere familiarity\n(Aggleton and Brown, 1999), which may be sufficient for ade-\nquate performance on the object-in-context task or the standard\nspontaneous object recognition task. Under such an account, the\nmore restricted impairments found in studies of object–context\nmemory with fornix (Norman and Eacott, 2004) or hippocampal\n(Mumby et al., 2002) lesions reflect the fact that an episodic-like\nmemory system may contribute but is not critical to the object-\nin-context discrimination.\nIn summary, we present a novel task involving discrimination\nof object, place, and context combinations. Like episodic mem-\nory in humans, memory in this task is acquired easily without\napparent effort or motivation and is selectively impaired by dis-\nruption of the hippocampal system. By arguing that context per-\nforms an occasion-specifying role that may be similar to the tem-\nporal aspect normally viewed as being essential to episodic-like\nmemory, we believe that this task may provide a simple and ef-\nfective model of episodic-like memory for the rat.\nReferences\nAggleton JP, Brown MW (1999) Episodic memory, amnesia, and the\nhippocampal-anterior thalamic axis. Behav Brain Sci 22:425–489.\nBurwell RD (2001) Borders and cytoarchitecture of the perirhinal and pos-\ntrhinal cortices in the rat. J Comp Neurol 437:17–41.\nBurwell RD, Amaral DG (1998) Perirhinal and postrhinal cortices of the rat:\ninterconnectivity and connections with the entorhinal cortex. J Comp\nNeurol 391:293–321.\nBurwell RD, Witter MP, Amaral DG (1995) The perirhinal and postrhinal\ncortices of the rat: a review of the neuroanatomical literature and com-\nparison with findings from the monkey brain. Hippocampus 5:390–408.\nClaytonNS, Dickinson A (1998) Episodic-likememory during cache recov-\nery by scrub jays. Nature 395:272–274.\nClayton NS, Griffiths DP, Emery NJ, Dickinson A (2001) Elements of\nepisodic-like memory in animals. Philos Trans R Soc Lond B Biol Sci\n356:1483–1491.\nDix SL, Aggleton JP (1999) Extending the spontaneous preference test of\nrecognition: evidence of object-location and object-context recognition.\nBehav Brain Res 99:191–200.\nEnnaceur A, Delacour J (1988) A new one-trial test for neurobiological\nstudies of memory in rats. I. Behavioral data. Behav Brain Res 31:47–59.\nEnnaceur A,Meliani K (1992) A new one-trial test for neurobiological stud-\nies of memory in rats. III. Spatial vs nonspatial working memory. Behav\nBrain Res 51:83–92.\nEnnaceur A, Neave N, Aggleton JP (1996) Neurotoxic lesions of the peri-\nrhinal cortex do notmimic the behavioural effects of fornix transection in\nthe rat Behav Brain Res 80:9–25.\nEnnaceur A, Neave N, Aggleton JP (1997) Spontaneous object recognition\nand object location memory in rats: the effects of lesions in the cingulate\ncortices, the medial prefrontal cortex, the cingulum bundle and the for-\nnix. Exp Brain Res 113:509–519.\nFriedman WJ (1993) Memory for the time of past events. Psychol Bull\n113:44–66.\nGaffan D (1994a) Scene-specific memory for objects: a model of episodic\nmemory impairment in monkeys with fornix transection. J Cogn Neuro-\nsci 6:305–320.\nGaffan D (1994b) Dissociated effects of perirhinal cortex ablation, fornix\ntransection and amygdalectomy: evidence for multiple memory systems\nin the primate temporal lobe. Exp Brain Res 99:411–422.\nGaffan D, Harrison S (1989) Place memory and scene memory: effects of\nfornix transection in the monkey. Exp Brain Res 74:202–212.\nGaffan D, Parker A (1996) Interaction of perirhinal cortex with the fornix\nfimbria: memory for objects and object in place memory. J Neurosci\n16:5864–5869.\nGaffan EA, Bannerman DM, Warburton EC, Aggleton JP (2001) Rats’ pro-\ncessing of visual scenes: effects of lesions to fornix, anterior thalamus,\nmammillary nuclei or the retrohippocampal region. Behav Brain Res\n121:103–117.\nMandler G (1980) Recognizing: the judgment of previous occurrence. Psy-\nchol Rev 97:252–271.\nMumby DG, Gaskin S, Glenn MJ, Schramek TE, Lehmann H (2002) Hip-\npocampal damage and exploratory preferences in rats: memory for ob-\njects, places, and contexts. Learn Mem 9:49–57.\nNorman G, Eacott MJ (2004) Impaired object recognition with increasing\nlevels of feature ambiguity in rats with perirhinal cortex lesions. Behav\nBrain Res 148:79–91.\nParker A, Gaffan D (1997a) The effect of anterior thalamic and cingulate\ncortex lesions on object-in-placememory inmonkeys. Neuropsychologia\n35:1093–1102.\nParker A, Gaffan D (1997b) Mammillary body lesions in monkeys impair\nobject-in-place memory: functional unity of the fornix-mammillary sys-\ntem. J Cogn Neurosci 9:512–521.\nPaxinos G, Watson W (1998) The rat brain in stereotaxic coordinates. Lon-\ndon: Academic.\nSimpson EL, Gaffan EA, Eacott MJ (1988) Rats’ object-in-place encoding\nand the effect of fornix transection. Psychobiology 26:190–204.\nTulving E (1983) Elements of episodic memory, pp 385. Oxford: Claren-\ndon.\nTulving E (2001) Episodic memory and common sense: how far apart? In:\nEpisodic memory. New directions in research (Baddeley A, Conway C,\nAggleton JP, eds), pp 269–287. London: Oxford UP.\nEacott and Norman • Memory for Object, Place, and Context in Rats J. Neurosci., February 25, 2004 • 24(8):1948–1953 • 1953\n"}