{"doi":"10.1144\/1470-9236","coreId":"63826","oai":"oai:nora.nerc.ac.uk:1513","identifiers":["oai:nora.nerc.ac.uk:1513","10.1144\/1470-9236"],"title":"Monitoring landslides in hazardous terrain using terrestrial LiDAR : an example from Montserrat","authors":["Jones, Lee"],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2006","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/63826.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/1513\/1\/QJEG_Photo_feature_done.pdf","pdfHashValue":"ee4a64b74b599fad64c64f70ab93b2b1d4b460c5","publisher":"Geological Society of London","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:1513<\/identifier><datestamp>\n      2012-11-22T11:49:52Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/1513\/<\/dc:relation><dc:title>\n        Monitoring landslides in hazardous terrain using terrestrial LiDAR : an example from Montserrat<\/dc:title><dc:creator>\n        Jones, Lee<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:publisher>\n        Geological Society of London<\/dc:publisher><dc:date>\n        2006<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/1513\/1\/QJEG_Photo_feature_done.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Jones, Lee.  2006  Monitoring landslides in hazardous terrain using terrestrial LiDAR : an example from Montserrat.   Quarterly Journal of Engineering Geology & Hydrogeology, 39 (4). 371-373.  https:\/\/doi.org\/10.1144\/1470-9236\/06-009 <https:\/\/doi.org\/10.1144\/1470-9236\/06-009>     \n <\/dc:identifier><dc:relation>\n        http:\/\/qjegh.lyellcollection.org\/<\/dc:relation><dc:relation>\n        DOI: 10.1144\/1470-9236\/06-009<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/1513\/","http:\/\/qjegh.lyellcollection.org\/","DOI: 10.1144\/1470-9236\/06-009"],"year":2006,"topics":["Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":"Lee D. Jones \nMONITORING LANDSLIDES IN HAZARDOUS TERRAIN USING TERRESTRIAL LIDAR - A CASE \nSTUDY FROM THE ISLAND OF MONTSERRAT \nL. D. Jones \nBritish Geological Survey, Keyworth, Nottingham, NG12 5GG, UK. (e-mail: ldjon@bgs.ac.uk) \nINTRODUCTION \nIt is important to monitor unstable slopes to determine where adverse changes in morphology \nare indicating the likelihood of failure and a consequent risk to life and property. However, \nwhere highly unstable slopes need to be monitored, their very nature precludes the use of \ndirect measurement by surveyors and remote means must be used to protect the safety of the \nsurvey team. The use of LiDAR (Light Detection and Ranging) enables the accurate location \nof a network of points that can be used to create a detailed 3-D terrain model, or DEM \n(Digital Elevation Model), of greater coverage and accuracy than conventional methods, with \nalmost complete safety of the operators. \nThere can be few more hazardous situations than that of monitoring a volcanic andesite lava \ndome for signs of an impending collapse. Partial collapse of a lava dome generates hot, fast-\nmoving pyroclastic density currents which are categorised as pyroclastic surge or block-and-\nash flow deposits based on sedimentary structures. Monitoring in such circumstances requires \nthat measurements are taken from a distance that minimises the threat from eruption and from \nasphyxiation by volcanic gases. The method also needs to be rapid to minimise the time spent \nby the monitoring team in the hazardous zone. The techniques described here are applicable to \nthe monitoring of any unstable slope or active landslide where hazardous conditions threaten \nthe survey team. \nSURVEY LOCATION \nMontserrat is a volcanic island of the Leeward Islands in the Caribbean Sea situated 43 km \nsouth west of Antigua. The survey was carried out from Perches Mountain, on the margin of \n 1\nLee D. Jones \nthe Soufrière Hills volcanic crater (Figure 1). The survey covered an area of 900 m by 700 m \nwhich encompassed the majority of the crater floor and the area of active dome growth \n(Figure 2). \nBACKGROUND \nThe Soufrière Hills volcano began to erupt in 1995 after at least 400 years of dormancy, \ngenerating primary and secondary volcanic hazards, including pyroclastic flows, lahars, ash \nfalls, landslides and earthquakes. The resulting eruptions have been monitored by scientists \nfrom the Montserrat Volcano Observatory (MVO) and elsewhere. A series of papers can be \nfound in Druitt and Kokelaar (2002) covering all aspects of these eruptions and their \nconsequences. \nGround deformation studies have been employed by the MVO to detect both long-term \nground movement, and short-term rapid movements that could act as pre-cursors to failures in \nthe flanks of the volcano, or the dome. Sparks et al. (1998) made measurements of the dome \nusing compass and abney level surveys, supplemented by photographs and theodolite \nmeasurements. The estimates from this type of survey are subject to systematic and non-\nsystematic errors, whereas LiDAR surveys are not. \nLiDAR SURVEY \nA terrestrial laser scanner, combined with a Global Positioning System (GPS) allows an \naccurate digital 3-D terrain model of the unstable area to be made. Subsequent surveys can be \ncompared to the previous models and differences in morphology can be assessed both \nquantitatively and qualitatively, following the methods described in Hobbs et al. (2002), for \nexample. The surveys can be undertaken without the use of targets being placed on the \nunstable slopes, thus allowing a much safer method of monitoring, compared with \nconventional surveying or photogrammetry. \n 2\nLee D. Jones \nThe Riegl LPM2K Long-Range Laser Scanner (Figure 3), as used for the surveys described \nherein, is designed to provide digital data for 3-D terrain modeling with a range of 2.5 km, a \n10 mm resolution and an accuracy of 50 mm. It is able to operate in automatic mode for area \nscanning or manual mode to record individual targets or features. This feature, combined with \nits long-range capability and good resolution, gives significant flexibility for geoscience \nmapping. The laser uses ‘last-pulse’ time-of-flight detection to determine the distance to a \nreflective surface from the instrument position, along with its azimuth and elevation. It is \ncontrolled and logged using a ruggedised ‘Toughbook’ PC and, typically, 8,000 points can be \ndata-logged in one hour in most weather and light conditions. The data may be transformed to \na grid co-ordinate system using PC software by means of back-sighting to a known target in \nmanual mode, or by independent survey (e.g. GPS). Using the transformed x, y, z data points, \n3-D contoured surface models may be created in various CAD and mapping software \npackages. In addition, reflectivity values are recorded which may be used to distinguish \nbetween rock types and most rock\/soil materials provide a good reflective surface. An \nadditional advantage of LIDAR scanning is that where features are obscured by cloud or gas, \nas is often the case in the crater, a zero reading is obtained which can be filtered out and \nreplaced by true data obtained when the cloud or gas has moved away. Thus, if necessary, a \nfull coverage can be obtained by combining scan data from several partially obscured views. \nThe lava dome topography changes rapidly, extruding lava at rates of 4 to 10 m3 per second, \nwith visible changes being seen daily. This is why the ability of the laser scanner to collect \nthousands of data points rapidly and accurately is important. \n3-D SLOPE MODEL \nThe terrestrial LiDAR data produced by the oriented laser scan and GPS survey were \nprocessed to develop a 3-D terrain model of the crater. The raw data produced by the \nRiPROFILE™ program consisted of ‘point-clouds’ comprising approximately 3,000 x, y, z \n 3\nLee D. Jones \npoints. This does not appear to be a vast amount of data, for the area scanned, but it is over \nten times more than previously used when calculating the dome volume using \nphotogrammetric methods. These data were oriented using the relative GPS positions of both \nthe scanner and the backsight and output as an ASCII file, made up of x, y, z and intensity \nvalues. The data were imported into Surfer™ (a surface mapping program) and manipulated \nusing a geostatistical gridding method, named Kriging, that produced a visually appealing \nmap from the irregularly spaced data points. Figure 4 shows a contour map, colour shaded by \nrelief and Figure 5 shows a surface model of the gridded data. The data were also imported \ninto GoCAD™ (a digital 3-D drawing program) and ‘surfaced’ using a triangulation method to \nproduce a solid 3-D model (Figure 6) that can be viewed from any orientation. The difference \nin the surfacing techniques is clearly displayed, Figure 5 is visually more easily understood \nbut Figure 6 is a more accurate representation of the terrain for analytical use. Although the \nscanner has a resolution of 50 mm the surfaces were created at 1 m grid intervals, this is due \nto inaccuracies that could be caused by the spread of the data, and by the ability of the PC and \nthe software to carry out the gridding calculations. Intensity plots, range plots and, after \nfurther surveys, change plots can also be shown using these surface models. It will also be \npossible to extract cross-sections and calculate volumes. \nCONCLUSIONS \nThe successful creation of 3-D terrain models using LIDAR scanning in the extremely \nhazardous conditions of an active volcano has demonstrated the effectiveness of the technique \nfor gathering data for the assessment of slope instability monitoring accurately, rapidly and \nsafely with regard to the health and safety of the survey team and the work requirements. \n \nACKNOWLEDGEMENTS \nThis paper is published with the permission of the Executive Director, British Geological \nSurvey (NERC). A large number of individuals both at the British Geological Survey (BGS), \n 4\nLee D. Jones \nin Keyworth, and at the MVO, in Montserrat, have contributed to the survey. I would \nparticularly like to thank the following: A Forster (British Geological Survey), Drs S \nLoughlin and G Ryan (Montserrat Volcano Observatory). \nREFERENCES \nDruitt, T.H. and Kokelaar, B.P. (eds) 2002. The Eruption of the Soufrière Hills Volcano, \nMontserrat, from 1995 to 1999. Geological Society, London, Memoirs, 21 (645). \n \nHobbs, P.R.N., Humphreys, B., Rees, J.G., Jones, L.D., Gibson, A., Rowlands, K., Hunter, G. \nand Airey, R. (2002). Monitoring the role of landslides in ‘soft cliff’ coastal recession. \nProceedings, International Conference on Instability, Planning & Management, 589-600. \nVentnor, Isle of Wight, May. Thomas Telford, London.  \n \nSparks, R.S.J., Young, S.R., Barclay, J., Calder, E.S., Cole, P., Darroux, B., Davies, M.A., \nDruitt, T.H., Harford, C., Herd, R., James, M., Lejeune, A.M., Loughlin, S., Norton, G., \nSkerrit, G., Stasiuk, M.V., Stevens, N.S., Toothill, J., Wadge, G. and Watts, R. 1998. Magma \nproduction and growth of the lava dome of the Soufrière Hills Volcano, Montserrat, West \nIndies: November 1995 to December 1997. Geophysical Research Letters, 25 (18), 3421-\n3424. \n \n 5\nLee D. Jones \n \nFigure 1. Location of the Soufrière Hills Volcano and extent of survey area (red box). \n \n \nFigure 2. The volcanic crater and active andesite lava dome (centre) and unstable remnant of \nolder, partially collapsed, lava dome (right). \n 6\nLee D. Jones \n \nFigure 3. Setting-up the Riegl LPM-2K long range terrestrial laser scanner on Perches survey \nstation. \n \n \nFigure 4. Contour map (3-D), viewed from the southeast. \n 7\nLee D. Jones \n 8\n \nFigure 5. Surface model (3-D), viewed from the southeast [Surfer™]. \n \n \nFigure 6. Surface model (3-D), viewed from the southeast [GoCAD™]. \n \n \n"}