{"doi":"10.1023\/A:1024916618904","coreId":"207854","oai":"oai:eprints.lse.ac.uk:17654","identifiers":["oai:eprints.lse.ac.uk:17654","10.1023\/A:1024916618904"],"title":"Digital divide or discursive design? On the emerging ethics of information space","authors":["Couldry, Nick"],"enrichments":{"references":[{"id":17237958,"title":"Avoiding Politics.","authors":[],"date":"1999","doi":"10.1017\/cbo9780511583391.011","raw":"Nina Eliasoph, Avoiding Politics. Cambridge University Press, Cambridge, 1999.","cites":null},{"id":17237961,"title":"Between Facts and Norms.","authors":[],"date":"1996","doi":"10.2307\/2941077","raw":"Jurgen Habermas, Between Facts and Norms. MIT Pres, Cambridge, MA, 1996.","cites":null},{"id":17237963,"title":"Can the “Next-Generation Internet” Effectively Support “Ordinary Citizens”?","authors":[],"date":"1999","doi":"10.1080\/019722499128673","raw":"Rob Kling. Can the “Next-Generation Internet” Effectively Support “Ordinary Citizens”? The Information Society, 15: 57-63, 1999.","cites":null},{"id":17237964,"title":"Code and Other Laws of Cyberspace. Basic Books,","authors":[],"date":"1996","doi":"10.2139\/ssrn.228342","raw":"Lawrence Lessig, Code and Other Laws of Cyberspace. Basic Books, New York, Robin Mansell and Roger Silverstone, Introduction. In Communication by Design: The Politics of  Information and Communication Technologies. Oxford University Press, Oxford, 1996.","cites":null},{"id":17237978,"title":"Communities of Discourse.","authors":[],"date":"1987","doi":"10.1086\/229747","raw":"Robert Wuthnow. Communities of Discourse. Harvard University Press, Cambridge, MA., 1987.","cites":null},{"id":17237966,"title":"Digital Divide.","authors":[],"date":"2001","doi":"10.1017\/cbo9781139164887.003","raw":"Pippa Norris, Digital Divide. Cambridge University Press, Cambridge, 2001.","cites":null},{"id":17237976,"title":"Does the Internet Increase, Decrease or Suplement Social Capital?","authors":[],"date":"2001","doi":null,"raw":"Barry Wellman et al. Does the Internet Increase, Decrease or Suplement Social Capital? American Behavioral Scientist, 45(3): 436-455, 2001.","cites":null},{"id":17237957,"title":"Dryzek Discursive Democracy.","authors":[],"date":"1990","doi":"10.1093\/019925043x.003.0008","raw":"John Dryzek Discursive Democracy. Cambridge University Press, New York, 1990.","cites":null},{"id":17237977,"title":"From the Global Digital Divide to the Global Digital Opportunity. Report to the G-8 Kyushu-Okinawa Summit. Accessed from http:\/\/www.wetforum.org\/digitaldivide.nsf\/ 1","authors":[],"date":"2001","doi":null,"raw":"World Economic Forum. From the Global Digital Divide to the Global Digital Opportunity.  Report  to  the  G-8  Kyushu-Okinawa  Summit.  Accessed  from http:\/\/www.wetforum.org\/digitaldivide.nsf\/ 1 April 2001.","cites":null},{"id":17237945,"title":"Habermas and the Public Sphere.","authors":[],"date":"1992","doi":"10.4324\/9780203020166","raw":"Craig Calhoun, editor, Habermas and the Public Sphere. Harvard University Press, Cambridge,MA., 1992.","cites":null},{"id":17237975,"title":"of Commerce. Falling Through the Net: towards digital inclusion – a report on Americans’ access to technology tools.","authors":[],"date":"2000","doi":null,"raw":"US Department of Commerce. Falling Through the Net: towards digital inclusion – a report  on  Americans’  access  to  technology  tools.  Washington,  DC,  October 2000.  Accessed  from  http:\/\/www.ntia.doc.gov\/ntiahome\/fttnoo\/Frontoo.htm,  1 April 2001.","cites":null},{"id":17237974,"title":"Office of the e-Envoy.","authors":[],"date":"2002","doi":null,"raw":"UK Government, Office of the e-Envoy. In the Service of Democracy. HM Government: London, 2002.","cites":null},{"id":17237973,"title":"Office. Closing the Digital Divide: Information and Communication 16 Technologies in Deprived Areas.","authors":[],"date":"2000","doi":null,"raw":"UK Cabinet Office. Closing the Digital Divide: Information and Communication    16 Technologies in Deprived Areas. London, 2000. Accessed from http:\/\/www.pat15.org.uk\/download.htm, 1 April 2001.","cites":null},{"id":17237956,"title":"Organisation. Information and","authors":[],"date":"2001","doi":"10.14217\/5k3w8fb9pwwb-en","raw":"Commonwealth Telecommunications Organisation. Information and Communication Technologies in the Commonwealth. Report for the Commonwealth ICT Expert Group. London, 2001.","cites":null},{"id":17237970,"title":"Primary Issues in Internet Use.","authors":[],"date":"2002","doi":null,"raw":"Ronald Rice, Primary Issues in Internet Use. In Leah Lievrouw and Sonia Livingstone, editors, Handbook of New Media, pages 105-129. Sage, London and Thousand Oaks, CA, 2002.","cites":null},{"id":17237967,"title":"Report of Joint OECD\/ UN\/ UNDP\/ World Bank Global Forum, Exploiting the Digital Opportunities for Poverty Reduction. OECD,","authors":[],"date":"2001","doi":null,"raw":"OECD. Report of Joint OECD\/ UN\/ UNDP\/ World Bank Global Forum, Exploiting the Digital Opportunities for Poverty Reduction. OECD, 2001. Accessed from http:\/\/www.oecd.org\/dac\/digitalforum\/ 1 April 2001.","cites":null},{"id":17237971,"title":"Republic.com.","authors":[],"date":"1999","doi":null,"raw":"Cass Susstein, Republic.com. Princeton University Press, Princeton, 1999.","cites":null},{"id":17237960,"title":"Splintering Urbanism: Networked Infrastruture, Technological Mobilities and the Urban Condition.","authors":[],"date":"2001","doi":"10.4324\/9780203452202","raw":"Stephen Graham and Simon Marvin. Splintering Urbanism: Networked Infrastruture, Technological Mobilities and the Urban Condition. London: Routledge, 2001 Jurgen Habermas, The Structural Transformation of the Public Sphere. Polity: Cambridge, 1989.","cites":null},{"id":17237968,"title":"The Broadband Difference,","authors":[],"date":"2002","doi":"10.5860\/choice.44-0384","raw":"Pew Internet and American Life Project. The Broadband Difference, 2002. Accessed from http:\/\/www.pewinternet.org\/ October 2002.","cites":null},{"id":17237955,"title":"The Children’s Partnership, Online Context for Low-Income and Underserved Americans. Accessed from http:\/\/www.childrenspartnership.org\/ 7","authors":[],"date":"2001","doi":null,"raw":"The Children’s Partnership, Online Context for Low-Income and Underserved Americans. Accessed from http:\/\/www.childrenspartnership.org\/ 7 June 2001.","cites":null},{"id":17237946,"title":"The Fall of Public Man.","authors":[],"date":"1977","doi":"10.1177\/000169937902200115","raw":"41 Richard Sennett. The Fall of Public Man. Cambridge University Press, Cambridge, 1977, pages 12-16.   15 Manuel Castells. The Internet Galaxy. Oxford University Press, Oxford, 2001.","cites":null},{"id":17237962,"title":"The Internet, 1995-2000: Access, Civic Involvement and Social Interaction.","authors":[],"date":null,"doi":"10.1002\/9780470774298.ch3","raw":"James Katz, Ronald Rice and Philip Apsden. The Internet, 1995-2000: Access, Civic Involvement and Social Interaction. American Behavioral Scientist: 45(3): 405-419.","cites":null},{"id":17237965,"title":"The Internet: An Ethnographic Approach.","authors":[],"date":"2000","doi":"10.2307\/4140832","raw":"Daniel Miller and Don Slater.  The Internet: An Ethnographic Approach. Berg, Oxford, 2000.","cites":null},{"id":17237959,"title":"The Real Digital Divide.","authors":[],"date":"2002","doi":null,"raw":"Oscar Gandy. The Real Digital Divide. In Leah Lievrouw and Sonia Livingstone, editors, Handbook of New Media. Sage, London and Thousand Oaks, CA, 2002.","cites":null},{"id":17237972,"title":"Welcome to Cyberschool. Rowman and","authors":[],"date":"2001","doi":null,"raw":"David Trend, Welcome to Cyberschool. Rowman and Littlefield, Lanham, MA, 2001.","cites":null},{"id":17237969,"title":"Which Equalities Matter? Polity: Cambridge,","authors":[],"date":"1999","doi":"10.1017\/s0047279400266051","raw":"Anne Phillips, Which Equalities Matter? Polity: Cambridge, 1999 Mark Poster. Cyberdemocracy: Internet and the Public Sphere. In David Porter, editor, Internet Culture. New York: Routledge, 1997.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-06","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/207854.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/17654\/1\/Couldry_Digital_divide_discursive_2003.pdf","pdfHashValue":"fd196f4afd5abd1df1480d9ced3ca54f7bd9d7c2","publisher":"Springer Netherlands","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:17654<\/identifier><datestamp>\n      2013-09-12T11:12:43Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D534F<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/17654\/<\/dc:relation><dc:title>\n        Digital divide or discursive design? On the emerging ethics of information space<\/dc:title><dc:creator>\n        Couldry, Nick<\/dc:creator><dc:subject>\n        QA75 Electronic computers. Computer science<\/dc:subject><dc:publisher>\n        Springer Netherlands<\/dc:publisher><dc:date>\n        2003-06<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/17654\/1\/Couldry_Digital_divide_discursive_2003.pdf<\/dc:identifier><dc:identifier>\n          Couldry, Nick  (2003) Digital divide or discursive design? On the emerging ethics of information space.  Ethics and Information Technology, 5 (2).  pp. 89-97.  ISSN 1388-1957     <\/dc:identifier><dc:relation>\n        http:\/\/www.springerlink.com\/content\/103461\/<\/dc:relation><dc:relation>\n        10.1023\/A:1024916618904<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/17654\/","http:\/\/www.springerlink.com\/content\/103461\/","10.1023\/A:1024916618904"],"year":2003,"topics":["QA75 Electronic computers. Computer science"],"subject":["Article","PeerReviewed"],"fullText":"  \nNick Couldry \nDigital divide or discursive design? On the \nemerging ethics of information space \n \nArticle (Accepted version) \n(Refereed) \n \n \n Original citation: Couldry, Nick (2003) Digital divide or discursive design? On the emerging ethics of information \nspace. Ethics and information technology, 5 (2), pp. 89-97. \n \nDOI: 10.1023\/A:1024916618904 \n \n© 2003 Kluwer Academic Publishers \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/17654\/ \nAvailable in LSE Research Online: September 2013 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \n 1\nARTICLE SUBMITTED FOR SPECIAL EDITION OF ETHICS AND \nINFORMATION TECHNOLOGY volume 5(2), 2003 \n \nRunning head: DIGITAL DIVIDE OR DISCURSIVE DESIGN? \n \nFull title:  DIGITAL DIVIDE OR DISCURSIVE DESIGN? \nON THE EMERGING ETHICS OF INFORMATION SPACE \n \n \n \nAUTHOR DETAILS:  \nDR. NICK COULDRY LECTURER IN MEDIA AND COMMUNICATIONS \nLONDON SCHOOL OF ECONOMICS AND POLITICAL SCIENCE \n  \nPostal address: MEDIA@LSE \/DEPARTMENT OF SOCIOLOGY,  \nLONDON SCHOOL OF ECONOMICS AND POLITICAL SCIENCE, \nHOUGHTON STREET, LONDON WC2A 2AE   \nTelephone +44 (0)207 955 6243 \nFax  +44 (0)207 955 7505 \nEmail n.couldry@lse.ac.uk \n \n \n 2\nARTICLE SUBMITTED FOR SPECIAL EDITION OF ETHICS AND \nINFORMATION TECHNOLOGY volume 5(2), 2003 \n \nAbstract: \n \nThis article seeks to identify, theoretically, some broad ethical issues about the type of \nspace which the Internet is becoming, issues which are closely linked to developing \nnew agendas for empirical research into Internet use. It seeks to move away from the \nconcept of ‘digital divide’ which has dominated debate in this area while presuming a \nrather static notion of the space which the Internet is, or could become. Instead, it \ndraws on deliberative democracy theory in general and John Dryzek’s concept of \n‘discursive design’ in particular to formulate six types of issue (Convergence, Who \nConverges?, Deliberation, Public Action, Relations to the State, and Long-term \nPatterns of Practice) around which both empirical research and ethical debate can \nfocus, and which taken together will help answer whether the Internet is, or can be, in \npart a ‘discursive design’ which contributes to the conditions of democratic public \nlife. \n \nKeywords: \n \nDeliberative democracy; digital divide; discursive design; Internet architecture; public \nspace; public sphere.  \n \n \nDIGITAL DIVIDE OR DISCURSIVE DESIGN? \nON THE EMERGING ETHICS OF INFORMATION SPACE \n \nWhat type of space will the Internet become? In his recent book, The Internet Galaxy, \nManuel Castells has argued for a fundamentally positive view of the potential of the \nInternet (since it makes possible ‘for the first time the communication of many to \nmany in chosen time, on a global scale’), 1* but also for an empirically-based caution \nabout whether this potential will be realised and for whom. Many would agree, but the \nquestion remains: what are the modalities for researching emerging inequalities in the \nstructure of Internet use and access? Or, put another way, what might a debate about \nthe ethics of The Internet as information space look like? \n \nAs its title suggests, this article attempts to move away from discussion couched \nexclusively in terms of the ‘digital divide’ and towards another, more open, \nformulation: discursive design. ‘Discursive design’ is a term from political theory, \nspecifically John Dryzek’s version of deliberative democracy theory,2* and we will \ncome to its definition later, but first it is important to explain the changes of emphasis \nwhich this latter term implies for understanding the organisation of the Internet as \ninformation space, or rather a collection of overlapping information spaces.  \n \nA good standard definition of the term we need to move away from - ‘digital divide’ – \nhas recently been offered by Ronald Rice: ‘the differential access to and use of the \n                                                          \n1\n Manuel Castells. The Internet Galaxy. Oxford University Press, Oxford, 2001, page 2. \n2\n John Dryzek Discursive Democracy. Cambridge University Press, New York, 1990. \n 3\nInternet according to gender, income, race and location’.3* As a current definition, \nthis is useful since it incorporates an important shift in digital divide debates, from \nmere ‘access’ to ‘access and use’ (more on this below). Even so, this definition gives \nlittle sense of how the structure of information space, to which individuals are \nunderstood to have access or to put to use, may itself be articulated with changing \npatterns of access and use. ‘The Internet’ in this definition is inert, preformed, simply \n‘there’. This closes down questions about the changing nature of the Internet as \ninformation space or, more broadly, ‘communication space’, and goes hand in hand \nwith limited curiosity about the agents who have such access or make such use. \nCertainly they are more than the units switched ‘on’ or ‘off’ assumed by early digital \ndivide debates, but all the same Rice’s definition does not mention the definitional \nissues embedded within changing forms of use. As Roger Silverstone argued long \nago, information and communication technologies are doubly articulated, both as \nmedia that have significance in themselves and as media for carrying specific sets of \nmeanings.4* People articulate the meanings of information and communication \ntechnologies, partly in accordance with habits and fixed formulas, of course, but \npartly also through explicit reflection as thinking individuals. It is this deliberative \naspect of Internet use, and the recognition that people may also be divided along this \ndimension, which are absent from Rice’s definition.  \n \nThis takes us to an important point that is different when we apply the notion of \n‘discursive design’ to the Internet; it encourages us to see that the Internet is not mere \ninfrastructure (whose organisation, once in place, can be safely black-boxed, insulated \nfrom further deliberation). On the contrary, Internet infrastructure is, and should \nremain, open to deliberative intervention and ethical inquiry. That is one implication \nof the term ‘discursive design’. To emphasise this is, however, to go against \nunderstandings of the Internet as a privatised space of individual market consumption, \nwhich by definition is both outside of all but the most obvious public policy concerns \n(decency, criminality, and so on) and need contain no spaces for public deliberation \nabout anything, including its own architecture. We reach here what Oscar Gandy has \nrecently called ‘the real digital divide’: the widening division between consumer and \ncitizen discourses.5* To discuss the ethics of the Internet as information space is, \nprecisely, to insist that questions of citizenship are at stake in the Internet’s \narchitecture, questions for civic deliberation which go beyond the purely formal rules \nnecessary for market functioning. \n \nThis is not, of course, to suggest that the Internet is only, or even primarily, a space \nfor public deliberation or citizenship practice: that would be absurd, both in principle \n                                                          \n3\n Ronald Rice,  Primary Issues in Internet Use. In Leah Lievrouw and Sonia Livingstone, editors, \nHandbook of New Media, pages 105-129. Sage, London and Thousand Oaks, CA, 2002. Quote at page \n106. \n4\n See discussion in Robin Mansell and Roger Silverstone, Introduction. In Communication by Design: \nThe Politics of Information and Communication Technologies. Oxford University Press, Oxford, 1996.  \n5\n Oscar Gandy. The Real Digital Divide. In Leah Lievrouw and Sonia Livingstone, editors, Handbook \nof New Media, pages 448-460. Sage, London and Thousand Oaks, CA, 2002. \n 4\nand fact. The Internet is many different spaces (of entertainment, general information, \nprivate communication, and, potentially at least, public deliberation) that overlap with \neach other and also connect with a wide range of non-virtual spaces (from the football \nground to dance venue, from shopping mall to trading floor and political meeting). \nThis heterogeneity should not deter general theorisation. The issue is not whether the \nInternet as a whole can be appropriated as political and civic space (clearly it cannot), \nbut whether it is a communication space where the political and the civic will, in the \nlong-term, have any purchase.  \n \nSince its early days, there have been pessimistic arguments that the Internet is \ninimical to politics and civic participation,6*  even if others have seen in the Internet’s \ncommunicative architecture the birth of a new type of participatory politics.7* More \nrecently, US empirical research has suggested that long-term Internet use and facility \nleads not to more, but to less, sense of online community, as Internet access and use \nbecomes incorporated ever more securely into private routines.8* Against this \nbackground, this article will look closely at the factors which might make a \ndifference, long-term, to the emergence of public, civic zones on the Internet. First, \nhowever, we must examine in more detail the limitations of the ‘digital divide’ \nconcept as a starting-point for unlocking the ethics of the Internet as information \nspace.  \n \nBeyond the ‘Digital Divide’ \n \nIn the second half of the 1990s, many national and international organisations became \nexercised by the possibility that new media technologies (above all, the explosive \ngrowth of the Internet and World Wide Web) would widen, not narrow, global \ninequalities. While the main arena for this concern was international, in some cases \n(the US under Clinton, the UK under Blair) this concern was given a national focus as \nwell; if inequalities in access to the Internet, or other media, are most extreme at the \ninternational level, they can hardly be ignored within nations either.   \n \nThe motivation for such concern was always at least partly economic: projected \nexponential growth in markets from the new online connections between consumers \nand businesses became an exponential loss of opportunity, once those who could not \nafford a computer, modem, or even the cost of the local phone call, were taken into \naccount. The gap between early cyberhype and brutal economic reality was so \n                                                          \n6\n See Dan Thu Nguyen and Jon Alexander. The Coming of Cyberspacetime and the End of the Polity. \nIn Rob Shields, editor, Cultures of the Internet, pages 99-124. Sage, London and Thousand Oaks, 1996. \nSee also chapter 5 of David Trend, Welcome to Cyberschool. Rowman and Littlefield, Lanham, MA, \n2001.  \n7\n Mark Poster. Cyberdemocracy: Internet and the Public sphree. In David Porter, editor, Internet \nCulture, pp. 201-217. New York: Routledge, 1997. \n8\n Barry Wellman et al. Does the Internet Increase, Decrease or Suplement Social Capital? American \nBehavioral Scientist, 45(3): 436-455, 2001. \n 5\nobvious in development contexts that different approaches had to be found, and the \nincreasing emphasis on establishing social or public access to new media \ntechnologies, through telecentres and the like, was designed to address this. The \nWest’s vision of a virtual consumer revolution needed major adjustment when, as one \nhelpful recent report put it, ‘a minimum of 676 million households worldwide – \nalmost all of them in developing countries – would be unable to afford private rather \nthan public access to telecommunications’,9* let alone computers and operating \nsoftware. Over time, however, rhetoric shifted away from the political liabilities of \n‘Digital Divide’ to the more comfortable ‘Digital Opportunity’, blowing the cover on \nthe market imperatives underlying the former. Leading the way here were the \nproposals submitted by the World Economic Forum to the G-8 Kyushu-Okinawa \n2000 summit, under the title ‘From The Global Digital Divide to the Global Digital \nOpportunity’. This argued that: \n \n‘instead of fixating on the existence of a divide, it would be far better to focus our \nattention on the “global digital opportunity”, because that is what really confronts \nus today – an unprecedented opportunity to move swiftly up the path towards \nglobal digital development . . .’10* \n \nin other words, the opportunity not so much to avoid social exclusion and division as \nto expand markets.  \n \nThe more lasting problem with digital divide discourse, however, is its fairly shallow \nunderstanding of the divides to which media technologies can give rise. Inequalities in \nownership of media technologies are discussed, with insufficient (if any) emphasis on \nuse, let alone effective use for the purposes of citizenship. Here is a passage from one \nof the more reflective and considered reports in the field:  \n \n‘There are imaginative ways to appeal to children and youths -  through brand \nnames, sport or entertainment stars, kids clubs where they can play or make e-mail \nfriends around the world. Once they are engaged the media can then be used to \npass important information, for example on sexual health, HIV\/AIDS.’11* \n \n                                                          \n9\n Commonwealth Telecommunications Organisation. Information and Communication Technologies in \nthe Commonwealth. Report for the Commonwealth ICT Expert Group. London, 2001. Quotation from \npage 23.  \n10\n World Economic Forum. From the Global Digital Divide to the Global Digital Opportunity. Report \nto the G-8 Kyushu-Okinawa Summit. Accessed from http:\/\/www.wetforum.org\/digitaldivide.nsf\/ 1 \nApril 2001, quotation at page 10.  \n11\n OECD. Report of Joint OECD\/ UN\/ UNDP\/ World Bank Global Forum, Exploiting the Digital \nOpportunities for Poverty Reduction. OECD, 2001. Accessed from \nhttp:\/\/www.oecd.org\/dac\/digitalforum\/ 1 April 2001, quotation at para 10. \n 6\nEntertainment or public health information is, here, the most ambitious target for \nbroadening access: what of the other dimensions of actual and potential use? The last \nof the Clinton Administration’s important series of Department of Commerce reports \nunder the title ‘Falling Through the Net’ announced the achievement of ‘full digital \ninclusion’ yet acknowledged in passing that its research into the US digital divide had \nlooked purely at access, rather than capacities or quality of use:  \n \n‘although this survey did not collect data on the intensity or the quality of Internet \nuse, where an individual uses the Internet – at home, away from home, or both – \nprobably reflects some degree of the quality of his or her Internet access’ (added \nemphasis). 12*  \n \nYet buried in this casual admission is an obscure sense (‘probably’) that the social \ncontext of Internet access and use matters, in fact matters a great deal.  \n \nRecent British Government reports in this area have been more explicit on this point, \nwith a UK Cabinet Office Report on ‘Closing the Digital Divide’ acknowledging the \n‘urgent need for comprehensive data’ on the relative unwillingness of the most \ndisadvantaged groups to take up new media ‘opportunities’.13* This last report \nreferences, in passing, an innovative US study by The Children’s Partnership that \nresearched extensively whether ‘low-income and underserved Americans’ were \nsatisfied with the online content that they accessed. This US report found that ‘a new \ndimension of the digital divide is beginning to take shape, one with a profound impact \non young people and those who guide and teach them: content’.14* That is, the lack of \naccessible, comprehensible content that would help the disadvantaged to improve \ntheir position (through training courses, job searches and so on), or simply feel a sense \nof community. The same report (page 21) suggested that ‘appropriate content’ was \nnot enough: people ‘want to be in a place where others in their community are doing \nthe same thing and where they can count on coaching and support their confidence, \nanswer the questions and guide them in new directions’. Once more, we find that a \nserious attempt to address the digital divide’s policy implications requires attention to \nthe social context of Internet use and the dimensions of social and symbolic exclusion \nagainst which it becomes regular and effective, if at all. This is exactly the conclusion \nof the best recent Internet research, for example Rob Kling’s work on the ‘next-\n                                                          \n12\n Quotation from Part II, first paragraph under heading ‘Location of Internet Use’ of US Department \nof Commerce. Falling Through the Net: towards digital inclusion – a report on Americans’ access to \ntechnology tools. Washington, DC, October 2000. Accessed from \nhttp:\/\/www.ntia.doc.gov\/ntiahome\/fttnoo\/Frontoo.htm, 11 October 2002. \n13\n Section 3.3 of UK Cabinet Office. Closing the Digital Divide: Information and Communication \nTechnologies in Deprived Areas. London, 2000. Accessed from \nhttp:\/\/www.pat15.org.uk\/download.htm, 11 October 2002. \n14\n Quoted from page 12 of The Children’s Partnership, Online Content for Low-Income and \nUnderserved Americans. Accessed from http:\/\/www.childrenspartnership.org\/ 11 October 2002. \n 7\ngeneration Internet’, and the importance for effective use of networks of social or \nfamily support.15* \n \nAn underlying problem here is the way that the ‘digital divide’ concept emerged in \nrelation to telecommunications. Telecommunications is in principle a simpler medium \nthan the Internet, not only because the latter is both interactive and distributive, but \nalso because it is the medium of more complex and open-ended types of use. As \nrecent research has shown, there are enormous differences in what ‘heavy’ Internet \nusers and ‘light’ Internet users do when they switch on their computer and modem.16* \nHeavy internet users, particularly those with broadband access, are much more likely \nto spend their time online sending their own documents and information, rather than \nreceiving public information.17* Light internet users, by contrast, may do little more \nthan access their Web server, look at the headlines and a few links, and check a train \ntime via a familiar search route. Are these two uses to be given the same weight in \nmeasuring the digital divide, particularly across a rich and extremely diverse nation \nsuch as the United States? Surely not, nor can such differences be dismissed as \nmatters of individual taste. To assume that would be to ignore the sheer complexity of \nwhat is on offer online. The vast online universe of information and entertainment \ncannot be assumed to be a universal good, having the same value to everyone. The \nuse you or I make of the Internet depends not only on the speed and reliability of our \nmodems and our individual predilections, but on our particular needs and capabilities \nto do something with the resources we believe are available online. This is why The \nChildren’s Partnership report represented such an important step-forward in policy-\nbased research on Internet use; it talked to people about how they used, or did not use, \nthe Internet and how they thought about it. The barriers to effective Internet use may \nbe subtle indeed. ‘Low-income people think they’re not legitimate information \nproducers’, said one community adviser interviewed by the Children’s Partnership.18 \nSuppose this were true and widespread; it would surely be a barrier to the expansion \nof ‘full’ internet use. ‘Social context’ here is a complex matter, inextricably connected \nwith how people think about Internet use, and its actual or possible purpose. \n \nSome historical perspective may be helpful in formulating the issues here. The \nemergence of an information and communication technology is always, in part, the \nslow process through which particular technological possibilities are articulated into \nspecific social and cultural contexts of action, so that merely potential uses become \nnot only actual but stable. But we cannot stop there. For just as important as the \nexplicit contexts of use are the implicit hierarchies that emerge around use: \nhierarchies between spaces of use and non-use, hierarchies between users and non-\n                                                          \n15\n Rob Kling. Can the “Next-Generation Internet” Effectively Support “Ordinary Citizens”? The \nInformation Society, 15: 57-63, 1999. \n16\n James Katz, Ronald Rice and Philip Apsden. The Internet, 1995-2000: Access, Civic Involvement \nand Social Interaction. American Behavioral Scientist: 45(3): 405-419, 2001. \n17\n Pew Internet and American Life Project. The Broadband Difference. Washington, DC, 2002. \nAccessed from http:\/\/www.pewinternet.org\/ 11 October 2002. \n18\n Quoted Childrens’ Partnership, 2000, page 24. \n 8\nusers. As Peter Stallybrass and Allon White argued in relation to the development of a \nEuropean literary elite in the 17 and 18th centuries,19* the printed book and journal did \nnot simply enable new forms of connection (the proto-public sphere of the London \ncoffee-house); it also enabled new forms of social and spatial hierarchy to emerge (the \ncoffee-house versus the market-square). Seen historically, the issue, as Robert \nWuthnow puts it, is how around the technology of the book new ‘institutional \nframeworks’ emerged for producing and exchanging information and new ‘action \nsequences’ developed as individuals and groups came to organise their time around \nthe information flows which printed matter made possible.20* We can ask similar \nquestions about the Internet: what, in the longer-term, are the types of institutional \nframework and social and individual habits that will coalesce around the Internet and \nthe changes in information flow it enables? The point is not, of course, to predict the \nfuture (a futile occupation, as Castells emphasises), but, first, to work towards \nformulating what might be the key priorities for empirical research in studying \nInternet use and, second (the particular concern of this article), to formulate the key \nethical questions which possible Internet architectures generate. \n \nIt might seem presumptuous to argue that Internet infrastructure raises ethical issues. \nIs there not a danger, as Pippa Norris has argued in her trenchant account of digital \ndivide debates, of confusing the specific issues raised by the Internet itself (if any) \nand underlying social issues, which are worked out not just through Internet use but \nthrough everything else?21* Certainly, but that does not mean there are no issues \nraised by the infrastructure of the Internet: just as there is in public space generally, so \ntoo on the Internet  there is a politics of speech, which concerns what can (and cannot) \nbe said where.22* The structure and ethics of information space, as with all space, can \nonly be understood in terms of its patterns of presence and absence, connection and \ndisconnection, participation and hierarchy. It is time now to try and make these \nabstract points more specific, working outwards from the questions suggested by the \nconcept of ‘discursive design’.  \n \nDiscursive Design \n \nAll imported theoretical terms carry historical baggage, but ‘discursive design’ carries \nmore than most. Its proposal by US political philosopher John Dryzek makes little \nsense initially outside the broad context of critical theory and the specific context of \ndeliberative democracy theory. But, if many aspects of critical theory (particularly the \nwork of Adorno and Horkheimer) remains highly controversial, Jurgen Habermas’ \nconcept of the ‘public sphere’23* has acquired such wide currency that it needs little \n                                                          \n19\n Peter Stallybrass and Allon White. The Politics and Poetics of Transgression. Methuen, London, \n1986. \n20\n Robert Wuthnow. Communities of Discourse. Harvard University Press, Cambridge, MA., 1987, \nquotations from page 7. \n21\n Chapters 3 and 4 of Pippa Norris, Digital Divide?. Cambridge University Press, Cambridge, 2001. \n22\n See Nina Eliasoph, Avoiding Politics. Cambridge University Press, Cambridge, 1999. \n23\n Jurgen Habermas, The Structural Transformation of the Public Sphere. Polity: Cambridge, 1989. \n 9\nintroduction. Deliberative democracy theory which followed in its wake is, of course, \nonly one approach to democracy but it has generated a wide literature in mainstream \npolitical theory debates.24* Indeed its basic principle – that democracy should be \nbased on the actual participation in important decisions of all those within a polity \naffected by such decisions  - might receive assent in political contexts well beyond the \nacademy. Strikingly, it is just the Internet’s affinity with participative processes that \nled Mark Poster, in its early days,25 to see it as a politically positive medium.  \n \nJohn Dryzek represents, however, a particular strand within deliberative democracy \ntheory, which insists it should not be limited to considering the ideal speech situation \nand the broad principles of democratic participation but must think concretely about \nthe institutional preconditions for any actually existing public sphere. This line of \nargument has force when many critiques of Habermas’ original public sphere model \nclaim it ignored historical and institutional realities.26* Dryzek is not alone27* in \narguing that ‘critical theorists have so far failed to generate much in the way of model \ninstitutions, still less attempted to apply them to political reality’.28 Dryzek’s concept \nof ‘discursive design’ is central to his more pragmatic approach. \n \nDefinition \nDryzek defines ‘discursive design’ as ‘a social institution around which the \nexpectations of a number of actors converge [which] . . . therefore has a place in their \nconscious awareness as a site for recurrent communicative interaction among them . . \n. as citizens, not as representatives of the state or any other corporate or hierarchical \nbody’.29 The questions for us here therefore are: will Internet space emerge as a \n‘discursive design’ in this sense and thereby contribute to deliberative democracy? \nWhat are the infrastructural conditions for, and potentially against, such a \ndevelopment?  \n \nSince I am using ‘discursive design’ only as a starting-point for a wider series of \nquestions, I will not offer an exhaustive exposition, but some introductory points need \nto be made. First, the term ‘communicative interaction’ is a term of art about which a \ngreat deal could be said: suffice to say that the consensus among deliberative \ndemocracy theorists remains that a crucial component of ‘communicative interaction’ \nis rationally-based argument on matters of general, not merely individual, \n                                                          \n24\n For an important recent collection, see Seyla Benhabib, editor, Democracy and Difference. Princeton \nUniversity Press, Princeton, 1995. \n25\n Poster, op.cit. \n26\n See especially the essays collected in Craig Calhoun, editor, Habermas and the Public Sphere. \nHarvard University Press, Cambridge,MA., 1992.  \n27\n Compare Anne Phillips, Which Equalities Matter? Polity: Cambridge, 1999, pages 116-123. \n28\n Dryzek, op. cit., page 40. \n29\n Dryzek, op. cit. page 43. \n 10\nsignificance. As recent debates have brought out,30 Habermas’ original insistence on \nexclusively rational debate was too restricting and ignored the mixture of emotion and \nrationality which characterises most important real-world discussions, but the central \nimportance of some, and indeed an orientating, focus on agreement achieved through \nrational argument remains. Second, Dryzek assumes that there should be ‘a social \ninstitution around which the expectations of a number of actors converge’ (added \nemphasis). Once again, recent debates have softened Habermas’ original insistence \nthat even in a complex society there should be one, and one only, central site that we \ncan call the ‘public sphere’, where citizens meet to deliberate: both Habermas in his \nlater work and his follower Seyla Benhabib accept now that the real public sphere is \nmuch more like an interlocking network of sites rather than one central site.31* \nDryzek’s stipulation that people’s expectations ‘converge’ around one site is \nsufficiently loose to accommodate a network of sites. Third, note the importance \nDryzek attaches to people meeting ‘as citizens’ and not as ‘representatives of the state \nor any other corporate or hierarchical body’. A principle of critical theory is that \nparticipatory processes happen not under the aegis of the state but in public spaces \nprecisely not controlled by major public institutions: this distinguishes it from \ndemocratic theories which prioritise state-focussed processes such as elections. In its \nanti-statism, deliberative democracy theory shares an important principle with some \nother influential recent writing about Internet architecture, notably Lawrence Lessig’s \nwork.32* Fourth, Dryzek in amplifying his definition makes an important point about \nthe extent and nature of deliberation in any discursive design: ‘all [its] features should \nbe redeemable within the discursive design itself. Participants should be free to \nreflectively and discursively override any of all of them’.33 Less technically, Dryzek is \nsaying that the deliberative process which a discursive design enables should extend \nto questions of the discursive design’s own structure: compare my earlier point that  \nquestions of the Internet’s architecture and infrastructure need to remain open to \nethical deliberation, rather than being black-boxed. \n \nResulting Questions  \nWhat questions are we led to formulate about the ethics of the Internet as information \nspace, once we assume that, in part at least, the Internet should function as a \ndiscursive design? I would identify six main areas of questions to be pursued \nempirically and in terms of their ethical consequences. \n \n1. Convergence. Does or can the Internet (or any part of the Internet) operate as a \nsite around which people’s expectations of communicative interaction converge? \nAt one level of course yes: there is much general expectation about the Internet as \na new communicative medium. But this gives too little weight to the term \n‘converge’ in Dryzek’s definition. The key question, at the level of what (for \nconvenience) I will loosely call ‘Internet architecture’, is about the scale and \n                                                          \n30\n See the essays by Benhabib and Young in Benhabib, op. cit. \n31\n See essay by Benhabib in Benhabib op. cit. See also Jurgen Habermas, Between Facts and Norms. \nMIT Press, Cambridge, MA, 1996. \n32\n Lawrence Lessig, Code and Other Laws of Cyberspace. Basic Books, New York, 1999, page 208. \n33\n Dryzek, ibid.  \n 11\neffectiveness of convergence: this translates into more specific questions about the \nstrength of connections between particular sites and the strength of disconnections \nbetween others. One major fear about the Internet is that Internet architecture \nencourages divergence, not convergence, of social experience, because of its \nstimulus to increasingly specialised (and exclusive) forms of social connection \nand information exchange.34* Clearly the question of the net balance between \nconnections and disconnections is a matter for (complex) empirical research, not \ntheory, but it is surely a question of ethical significance. \n \n2. Who converges? The second question develops the first, and sharpens the \ndistinction between apparent and real convergence. Dryzek’s actual definition is \nvague (‘a number of actors converge’) but a key principle is, as he notes, that ‘no \nconcerned individuals should be excluded and if necessary some educative \nmechanism should promote competent participation of persons with a material \ninterest in the issues at hand who might otherwise be left out’.35 In other words, so \nas far as possible, all citizens should have access to, and effectively participate in, \nsuch an information space. Here, we return to issues raised by digital divide \ndebates, but with the proviso that the criterion of adequate access\/use is whether \npeople effectively represent their material interests, a much higher criterion than \nthe basic level of access and use that most digital divide discussion implies.  \nWe can ask therefore: what are the conditions that support or hinder effective \nparticipation in online deliberations by all members of a society? Of course, as \nNorris argues, there is an overlap here with issues of social inequality which have \nnothing inherently to do with Internet architecture: economic resources, education, \nstatus, and so on. That does not mean Internet architecture raises no issues: for, if \nin everyday practice, people across the board consistently use the Internet as if it \nwere not a space of convergence, but only an infinite information resource from \nwhich they as individuals can draw whatever materials they like, as and when they \nlike, and if that practice is reinforced by the formats through which ‘the Internet’ \nis presented for use to people in everyday situations, then there is an issue about \nInternet architecture as it is lived to be addressed. If all the signs and routes in a \nbuilding point away from the central space where people could, if they went there, \nmeet to discuss what is happening in that building, then that is a question of \narchitecture with consequences for how that building operates as an information \nspace. In the case of the Internet, it is therefore worth asking; does the Internet \noverall operate as a centripetal or centrifugal space and, if the latter, what are the \nconsequences for politics and social organisation of what is potentially societies’ \nprincipal communication space operating that way? \n \n3. Deliberation. The next question follows on from a possible response to the last \npoint: aren’t there many sites on the Internet where people are currently \nconverging in unprecedented fashion to discuss matters of public concern, such as \nthe adequacy of public provision for particular private health issues? In turn, we \ncan pose the question of whether what people do on those sites is truly \n‘deliberation by citizens’ as the definition of discursive design requires. People \nmust come together to debate matters of general interest aware that they do so in \n                                                          \n34\n See Trend, op. cit.; cf Cass Susstein, Republic.com. Princeton University Press, Princeton, 1999. \n35\n Dryzek, ibid. \n 12\nthe capacity of citizens, that is, not just as private individuals but as people who \nsee their deliberations as having wider public relevance.  \nConsidering Nina Eliasoph’s recent empirical work36 on everyday talk about \npublic issues in the US helps bring out the implications of this point for empirical \nresearch on online sites. Her central point is that, beneath the surface of the US \npopulation’s apparent decline in interest in politics, is a more complex picture: \npeople do talk about citizenship issues but in private, that is, in spaces where there \nare no public consequences of their talk. In public spaces, by contrast, ‘politics’ is \navoided as too contentious. This is an issue about how people imagine both the \nspaces where they speak and the unwritten constraints (built into those spaces) \nabout what can appropriately said and where. In the case of Internet discussion \nsites, how do people actually imagine the space in which they are speaking: is it \none where talk about formal politics is inappropriate and if so why? Or, more \nsubtly, is it a space where political or civic talk is appropriate, but only because \ntalk there has no public consequences? We return here to the question of \nconnection and disconnection across Internet space. Deliberation is not just talk, \nbut public talk about public issues consciously aimed to have wider public impact, \nand accountable as such. \n \n4. Public action. The fourth question builds on the last. We are concerned with the \npossibility that in Internet space there might be some sites where public debate not \nonly occurs, but occurs in a context where it can plausibly lead to \nrecommendations for public action. Deliberation within the definition of \ndiscursive design must be more than a talking-shop without consequences. This \nleads to specific empirical questions about how particular online sites of \ndeliberation (if any) are connected, or not, into wider processes of public decision-\nmaking and action.  \n \n5. Relations to the State. The fifth question applies the fourth. What relationship \ndoes online deliberation have to the actions of the main actor in public space, the \nstate (similar questions could be asked of the interface with corporate power)? We \ncan have as thriving a world of online deliberation as we like, but if its \nrecommendations are systematically ignored by the state, it will achieve little. \nMuch of what states do, of course, falls outside questions of Internet architecture \n(and squarely within political science), but again there are ethical questions to \nwhich Internet architecture gives rise. What is the strength of connections between \nonline discussion sites and state processes (whether online or offline)? Are there \nhierarchies among online sites, such that deliberation in certain places has no \nchance of reaching government, whereas deliberation elsewhere online has a good \nchance? Such questions are almost embarrassingly general, but this reflects a real \ngap in knowledge and policy.  \nAs illustration of this, consider this interesting passage from a recent report issued \non behalf of the UK government:  \n \n‘Active and engaged citizens are likely to lead to more effective and informed \ngovernment. That there is a high level of interest in political issues is borne out by \nsuccessive opinion polls. Individuals already participate in a variety of activities \nthat have no formal connection with the institutions of democracy.  The task for \n                                                          \n36\n Eliasoph, op. cit. \n 13\ngovernment is to link this interest to the political process – and to do so in a way \nthat reflects and responds to changes in the nature of democratic participation. . . . \n[However] The notion of a formal space on the web where anyone can initiate \npolicy ideas, contribute evidence or debate with others is a long way off.’37* \n \nThe evidential gap to which this passage refers is borne out if you visit the current \nversion of the UK Government’s own experiment in e-democracy, CitizenSpace, \nat www.ukonline.gov.uk\/. You might well want first to click on ‘how to contribute \neffectively’. But if you do, the first instruction you get is ‘Be Brief’, ‘use one short \nsentence to explain each point you want to make’ – hardly an encouragement to \nopen-ended deliberation!38  \n \n6. Long-Term Patterns of Practice. We have posed each of the first five questions \nstill fairly abstractly. But, if we have learned anything from digital divide debates \nit is that abstract formulation is ultimately fruitless unless we translate such \nquestions into more specific questions about people’s long-term practices of using \nthe Internet, their habits not only of doing certain things but also of thinking about \nwhat they do online in a certain way, as one type of process (say, public \ndeliberation) rather than another. We need then to look at the broader patterns of \nInternet use, and how they become embedded in particular understandings of what \nthe Internet is. There are of course many actual Internets, 39* not just one \nhomogenous space, and our sense of ‘the Internet’ is variously constructed by \ndifferent people. That does not, however, resolve the question. We must look, as \nsuggested earlier, for patterns not just of presence, but also of absence. What long-\nterm differences will emerge between (I) heavy Internet users and less heavy users \nor non-users, and (ii) between certain user groups and others, in terms of how each \nacts in relation to, and thinks of, the Internet as a ‘discursive design’, that is, as a \nspace where they can converge to deliberate effectively on issues of shared \nconcern? Will the Internet, from this perspective, become in the longer-term a \nuniverse of ‘secessionary networked spaces’ (in the words of two of the most \ntrenchant critics of contemporary cities) with a limited number of highly-lit \n‘colonies of cohesion’ and vast dark spaces of low or zero connection in-\nbetween?40*   \nAnd, switching our focus from the purely empirical, if, in the longer-term, Internet \nuse becomes divided between a small minority for whom the Internet is (in part) a \ndiscursive design, effectively linked to their notion of civic life, and a large \nmajority for whom the Internet is a purely private resource, and if states adapt \ntheir notions of e-government around what the former group do (or don’t do) \n                                                          \n37\n UK Government, Office of the e-Envoy. In the Service of Democracy. HM Government: London, \n2002, page 37. \n38\n Source www.uklonine.gov.uk\/CitizenSpace\/ consulted 18 November 2002. \n39\n See Daniel Miller and Don Slater.  The Internet: An Ethnographic Approach. Berg, Oxford, 2000. \n40\n Stephen Graham and Simon Marvin. Splintering Urbanism: Networked Infrastruture, Technological \nMobilities and the Urban Condition. London: Routledge, 2001, page 222. \n 14\nignoring the latter, then the Internet’s architecture will indeed have consequences \nfor social life that can validly be called ‘ethical’.  \n \nConclusion \n \nIn this article, I have tried to move beyond existing debates about the Digital Divide, \nwhich keep questions of online access and use hermetically sealed from changing \nnotions of what type of space the Internet is, or could become; instead, I have drawn \nupon John Dryzek’s notion of discursive design to focus some questions about how \nthe architecture of the Internet as information space (both objectively and \n‘subjectively’, both as structured and imagined) overlaps with pure questions of use. \nThe aim has been to get a clearer view on a larger question: what type of social space \ncan we expect to emerge from people using, and not using, the Internet in their daily \nlives in the way they are currently doing (or not doing)? Does this social space have \nanything in common with the type of space (a discursive design) which deliberative \ndemocracy theorists suggest is necessary for a participatory democracy?  \n \nThis is to assume, admittedly, that the Internet needs, in part, to take on the features of \na discursive design, which depends on two further undefended premises: first, that we \nneed spaces which answer to the definition of a discursive design and second, that the \nInternet will become an increasingly important part of societies’ overall public \ncommunication space. The second is uncontroversial, but the first is not, indeed it is a \npolitical value. It judges the Internet in the same fashion that many previous writers \nhave judged public space, for example the architecture and spatial organisation of our \nmajor cities. Just as one generation of social commentators asked whether modern \nurban public spaces contributed to, or undermined, the conditions necessary for an \nethical life, so we can ask the same question of the public (not necessarily civic) space \ninto which the Internet is being transformed. Borrowing the terms of Richard \nSennett’s devastating 1970s critique of US mediated public life,41* will the Internet, \nover the long term, become ‘dead space’, merely the ‘means of passage to the \ninterior’? Or will it become a true public space, alive with discussion, debate and \ncollective action? Partly these are questions of politics and the whole direction of \npublic discourse and narrative. But, as Sennett has consistently shown, such questions \nof discourse can never be divorced from the architecture and spatial infrastructure \nwithin which people live their public and private lives, and imagine both the \nboundaries and the connections between them.  It is in this sense that the Internet, as \ninformation space, raises urgent and still unanswered questions not just for \ninformation science, but for political science, sociology and ethics as well.  \n[6283 words] \n \nReferences \n \nSeyla Benhabib, editor, Democracy and Difference. Princeton University Press,   \n      Princeton, 1995. \nCraig Calhoun, editor, Habermas and the Public Sphere. Harvard University Press,  \n      Cambridge,MA., 1992.  \n                                                          \n41\n Richard Sennett. The Fall of Public Man. Cambridge University Press, Cambridge, 1977, pages 12-\n16. \n 15\nManuel Castells. The Internet Galaxy. Oxford University Press, Oxford, 2001. \nThe Children’s Partnership, Online Context for Low-Income and Underserved  \n     Americans. Accessed from http:\/\/www.childrenspartnership.org\/ 7 June 2001. \nCommonwealth Telecommunications Organisation. Information and Communication    \nTechnologies in the Commonwealth. Report for the Commonwealth ICT Expert       \nGroup. London, 2001.  \nJohn Dryzek Discursive Democracy. Cambridge University Press, New York, 1990. \nNina Eliasoph, Avoiding Politics. Cambridge University Press, Cambridge, 1999. \nOscar Gandy. The Real Digital Divide. In Leah Lievrouw and Sonia Livingstone,    \n     editors, Handbook of New Media. Sage, London and Thousand Oaks, CA, 2002. \nStephen Graham and Simon Marvin. Splintering Urbanism: Networked Infrastruture,  \n      Technological Mobilities and the Urban Condition. London: Routledge, 2001 \nJurgen Habermas, The Structural Transformation of the Public Sphere. Polity:  \n      Cambridge, 1989. \nJurgen Habermas, Between Facts and Norms. MIT Pres, Cambridge, MA, 1996. \nJames Katz, Ronald Rice and Philip Apsden. The Internet, 1995-2000: Access, Civic  \nInvolvement and Social Interaction. American Behavioral Scientist: 45(3): 405-\n419. \nRob Kling. Can the “Next-Generation Internet” Effectively Support “Ordinary  \n      Citizens”? The Information Society, 15: 57-63, 1999. \nLawrence Lessig, Code and Other Laws of Cyberspace. Basic Books, New York,  \n     1999 \nRobin Mansell and Roger Silverstone, Introduction. In Communication by Design:   \nThe Politics of  Information and Communication Technologies. Oxford University   \nPress, Oxford, 1996.  \nDaniel Miller and Don Slater.  The Internet: An Ethnographic Approach. Berg,  \n     Oxford, 2000. \nDan Thu Nguyen and Jon Alexander. The Coming of Cyberspacetime and the End of   \nthe Polity. In Rob Shields, editor, Cultures of the Internet. Sage, London and \nThousand Oaks, 1996.  \nPippa Norris, Digital Divide. Cambridge University Press, Cambridge, 2001. \nOECD. Report of Joint OECD\/ UN\/ UNDP\/ World Bank Global Forum, Exploiting  \nthe Digital Opportunities for Poverty Reduction. OECD, 2001. Accessed from \nhttp:\/\/www.oecd.org\/dac\/digitalforum\/ 1 April 2001. \nPew Internet and American Life Project. The Broadband Difference, 2002. Accessed  \n       from http:\/\/www.pewinternet.org\/ October 2002. \nAnne Phillips, Which Equalities Matter? Polity: Cambridge, 1999 \nMark Poster. Cyberdemocracy: Internet and the Public Sphere. In David Porter,  \n       editor, Internet Culture. New York: Routledge, 1997. \nRonald Rice, Primary Issues in Internet Use. In Leah Lievrouw and Sonia  \nLivingstone, editors, Handbook of New Media, pages 105-129. Sage, London and \nThousand Oaks, CA, 2002. \nRichard Sennett. The Fall of Public Man. Cambridge University Press, Cambridge,  \n       1977. \nPeter Stallybrass and Allon White. The Politics and Poetics of Transgression.  \n        Methuen, London, 1986. \nCass Susstein, Republic.com. Princeton University Press, Princeton, 1999. \nDavid Trend, Welcome to Cyberschool. Rowman and Littlefield, Lanham, MA, 2001. \nUK Cabinet Office. Closing the Digital Divide: Information and Communication  \n 16\nTechnologies in Deprived Areas. London, 2000. Accessed from \nhttp:\/\/www.pat15.org.uk\/download.htm, 1 April 2001. \nUK Government, Office of the e-Envoy. In the Service of Democracy. HM  \n        Government: London, 2002.  \nUS Department of Commerce. Falling Through the Net: towards digital inclusion – a  \nreport on Americans’ access to technology tools. Washington, DC, October \n2000. Accessed from http:\/\/www.ntia.doc.gov\/ntiahome\/fttnoo\/Frontoo.htm, 1 \nApril 2001. \nBarry Wellman et al. Does the Internet Increase, Decrease or Suplement Social  \n        Capital? American Behavioral Scientist, 45(3): 436-455, 2001. \nWorld Economic Forum. From the Global Digital Divide to the Global Digital  \nOpportunity. Report to the G-8 Kyushu-Okinawa Summit. Accessed from \nhttp:\/\/www.wetforum.org\/digitaldivide.nsf\/ 1 April 2001. \nRobert Wuthnow. Communities of Discourse. Harvard University Press, Cambridge,  \n       MA., 1987. \n"}