{"doi":"10.1016\/j.scitotenv.2009.06.013","coreId":"140850","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/6529","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/6529","10.1016\/j.scitotenv.2009.06.013"],"title":"Better environmental regulation - contributions from risk-based decision-making","authors":["Gouldson, A.","Morton, A.","Pollard, Simon J. T."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-09-14T00:00:00Z","abstract":"Internationally, pressure is being put on governments and regulators to develop\nmore modern forms of regulation that deliver more for less and in better ways.\nThis review considers the ways in which one large regulator, the Environment\nAgency for England and Wales, has responded to such pressure by developing and\nimplementing risk-based approaches to regulation. After exploring the context\nfor and key elements of risk-based environmental regulation, we consider the\nevolving influence of such approaches. We discuss the impacts of risk-based\napproaches against the UK Government’s principles for better regulation and\nagainst the key criteria for policy evaluation before considering some of the\nkey challenges that still need to be addressed in this area of regulatory\nactivity. These relate to the need to i) understand best practice and promote\nconsistency in risk based regulation; ii) develop reliable, responsive forms of\nrisk assessment and monitoring; iii) build capacities for responsive risk\nregulation; iv) evaluate the influence of different regulatory styles; and v)\nbetter understand the potential role of the private sect","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140850.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1016\/j.scitotenv.2009.06.013","pdfHashValue":"78382a9645196de9af1f7736d00868ca62e4b980","publisher":"Elsevier Science B.V., Amsterdam.","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/6529<\/identifier><datestamp>2011-10-31T12:29:17Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Better environmental regulation - contributions from risk-based decision-making<\/dc:title><dc:creator>Gouldson, A.<\/dc:creator><dc:creator>Morton, A.<\/dc:creator><dc:creator>Pollard, Simon J. T.<\/dc:creator><dc:description>Internationally, pressure is being put on governments and regulators to develop\nmore modern forms of regulation that deliver more for less and in better ways.\nThis review considers the ways in which one large regulator, the Environment\nAgency for England and Wales, has responded to such pressure by developing and\nimplementing risk-based approaches to regulation. After exploring the context\nfor and key elements of risk-based environmental regulation, we consider the\nevolving influence of such approaches. We discuss the impacts of risk-based\napproaches against the UK Government’s principles for better regulation and\nagainst the key criteria for policy evaluation before considering some of the\nkey challenges that still need to be addressed in this area of regulatory\nactivity. These relate to the need to i) understand best practice and promote\nconsistency in risk based regulation; ii) develop reliable, responsive forms of\nrisk assessment and monitoring; iii) build capacities for responsive risk\nregulation; iv) evaluate the influence of different regulatory styles; and v)\nbetter understand the potential role of the private secto<\/dc:description><dc:publisher>Elsevier Science B.V., Amsterdam.<\/dc:publisher><dc:date>2011-10-25T23:02:01Z<\/dc:date><dc:date>2011-10-25T23:02:01Z<\/dc:date><dc:date>2009-09-14T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>A. Gouldson, A. Morton, S.J.T Pollard, Better environmental regulation - contributions from risk-based decision-making, Science of The Total Environment, Volume 407, Issue 19, 15 September 2009, Pages 5283-5288.<\/dc:identifier><dc:identifier>0048-9697<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1016\/j.scitotenv.2009.06.013<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/6529<\/dc:identifier><dc:rights>NOTICE: this is the author’s version of a work that was accepted for publication in Science of The Total Environment. Changes resulting from the publishing process, such as peer review, editing, corrections, structural formatting, and other quality control mechanisms may not be reflected in this document. Changes may have been made to this work since it was submitted for publication. A definitive version was subsequently published in Science of The Total Environment, VOL 407, ISSUE 19, (2009) DOI:10.1016\/j.scitotenv.2009.06.013<\/dc:rights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0048-9697","0048-9697"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Article"],"fullText":"1Scientific Commentary1\nBetter environmental regulation - contributions from risk-based decision-2\nmaking3\n4\nA. Gouldson1, A. Morton2 and S.J.T Pollard3*5\n6\n1University of Leeds, Sustainability Research Institute, School of Earth and Environment,7\nYorkshire, LS2 9JT, UK8\n2London School of Economics, Operational Research Group, Houghton Street, London,9\nWC2A 2AE, UK;10\n3Cranfield University, Collaborative Centre of Excellence in Understanding and Managing11\nNatural and Environmental Risks, Cranfield, MK43 0AL, UK12\n13\n*corresponding author: Tel: +44(0)1234 754101; fax +44(0)1234 751671; E: s.pollard@cranfield.ac.uk14\n15\nAbstract16\nInternationally, pressure is being put on governments and regulators to develop more modern17\nforms of regulation that deliver more for less and in better ways. This review considers the18\nways in which one large regulator, the Environment Agency for England and Wales, has19\nresponded to such pressure by developing and implementing risk-based approaches to20\nregulation. After exploring the context for and key elements of risk-based environmental21\nregulation, we consider the evolving influence of such approaches. We discuss the impacts22\nof risk-based approaches against the UK Government’s principles for better regulation and23\nagainst the key criteria for policy evaluation before considering some of the key challenges24\nthat still need to be addressed in this area of regulatory activity. These relate to the need to i)25\n2understand best practice and promote consistency in risk based regulation; ii) develop1\nreliable, responsive forms of risk assessment and monitoring; iii) build capacities for2\nresponsive risk regulation; iv) evaluate the influence of different regulatory styles; and v)3\nbetter understand the potential role of the private sector.4\n5\nKeywords: risk, modern, better, regulation, policy, Environment Agency.6\n7\n1. Introduction8\nDriven by concerns about public sector expenditure and private sector competitiveness,9\nmany commentators have long been critical of the role that regulation plays in modern10\neconomies. Gunningham and Grobasky (1999) encapsulate these criticisms suggesting that11\nregulations ‘are not effective in delivering their purported goals; or efficient in doing so at12\nleast cost; nor do they perform well in terms of other criteria such as equity, administrative13\nviability or political acceptability’. Regulation has therefore been seen to perform badly14\nwhen measured against all of the key criteria for policy evaluation. However, command and15\ncontrol regulation remains an important policy instrument, and broader forms of regulation16\nare emerging, centred, for example, around market-based or information-based instruments.17\nAs a consequence, pressure is being put on governments and regulators to develop better (or18\nmore modern) forms of regulation that deliver more for less and in better ways. Risk-based,19\nor more correctly, risk-informed regulation is one contributor to this debate (e.g. Rothstein et20\nal., 2006).21\nInternationally, there has been considerable emphasise placed on the need to develop22\nbetter regulation in recent years. The OECD for example first issued its influential23\nrecommendations for regulatory reform in 1997; these subsequently evolved into the OECD24\nGuiding Principles for Regulatory Quality and Performance in 2005 (OECD, 2005). At a25\n3European level, the EU initiated a drive towards better regulation in 2002, and has published1\nthree strategic reviews of better regulation in the EU since 2006 (c.f. European Commission,2\n2009). The UK has been an active participant in these international and European debates and3\ndomestically the UK government’s Better Regulation Task Force has been an influential4\nvoice within government since its creation in 19971. It has called for regulators to adhere to5\nits principles of better regulation by ensuring that regulations are targeted, proportionate,6\nconsistent, transparent and accountable.7\nAs a regulator that employs ca. 12,000 people and has an annual budget of over £18\nbillion, the Environment Agency has been developing its response to the better regulation9\nagenda for some years. It has done this most notably through the adoption of risk based10\napproaches to regulation in its broadest sense, that seek to focus scarce regulatory resources11\non the highest risks and the worst performers, thereby, it is hoped, securing sustainable12\nenvironmental outcomes, delivering public sector efficiency gains and reducing business13\nburdens.14\nAfter examining recent experiences with risk-based regulation in the Environment15\nAgency, this commentary highlights some key gaps in the knowledge base and some of the16\nfuture challenges in the field. We conclude by considering the extent to which risk-based17\napproaches have enabled, or could in the near future allow the Environment Agency to18\ncontinue to improve the implementation of the principles of better regulation and the19\nperformance (i.e. the efficacy, efficiency, equitability, administrative viability and political20\nacceptability) of environmental regulation.21\n22\n2. Risk based environmental regulation23\n1Its growing influence is reflected in the adoption of the Legislative and Regulatory Reform Act of 2006 and creation of the\nDepartment for Business, Enterprise and Regulatory Reform in 2007.\n4Reflecting the broader international agenda on better regulation, risk-based environmental1\nregulation has been explicitly promoted in the UK for over ten years (Parliamentary Office of2\nScience and Technology, 1996; Halfacree, 1998). As well as being driven by the better3\nregulation debate above, it arose through an increased emphasis on better risk governance in4\nGovernment departments (Interdepartmental Liaison Group on Risk Assessment, 1998;5\nOXERA, 2000; Hampton, 2005; Strategy Unit, 2002) and agencies following events such as6\nthe BSE (House of Commons, 2000) and foot and mouth crises, and the associated concerns7\nabout poor public trust in Government decisions on risk (House of Lords, 2000; ESRC8\nGlobal Environmental Change Programme, 2000; Green Alliance, 2000; House of Lords,9\n2006). Given that it has evolved rapidly since its adoption, it is our view that there is10\nsufficient operational experience among regulators (Her Majesty’s Inspectorate of Pollution,11\n1995; Environment Agency, 1997; European Commission, 1998; Department of12\nEnvironment, Transport and the Regions, 1999; Department of Environment, Transport and13\nthe Regions, 2000) to reflect on the contributions that risk-based environmental decision14\nmaking (Department of the Environment, 1995; DETR and the Environment Agency, 2000)15\ncan make towards modern or better environmental regulation.16\nThe Environment Agency has wide-ranging regulatory responsibilities for flood risk17\nmanagement and environmental protection. It adopts environmental risk assessment to18\ninform its decisions at both the strategic and operational levels. Strategically, the Agency19\nleads Government on the application of environmental risk assessment, with the government20\nDepartment for Environment, Food and Rural Affairs (Defra) setting the policy context and21\ndirection (Defra, 2000). At the operational level, the Environment Agency requires22\nenvironmental risk assessments to inform its decision making and, by virtue of its generalised23\npowers, may request a risk assessment of any operation it considers may have a detrimental24\nimpact on human health and the environment. Guidance on environmental risk assessment25\n5and management is in place and implemented (Pollard, 2001; Pollard, 2002); several Agency-1\nadministered regimes are noted as being risk-based (e.g., contaminated land, waste2\nmanagement, flood risk management, process industry regulation, river basin management);3\nand risk-informed regulatory processes are in place for targeting proportionate regulation,4\nsecuring efficiency gains and informing workforce (resource) planning.5\nMany of the risk-informed regulatory processes are based on the application of what is6\nknown as ‘operator and pollution risk appraisal’ (OPRA) (Her Majesty’s Inspectorate of7\nPollution, 1995; Environment Agency, 1997; Environment Agency, 1997). OPRA seeks to8\nassign a ranking to regulated sites according to their innate hazard and the capacity of the9\noperator to manage the likelihood of these hazards being realised – the operator’s10\ndemonstrable performance in risk management. OPRA thus assumes that environmental risk11\nmanagement is, by a large part, determined by the competency of an organisation to manage12\nthe hazards associated with its’ operations. OPRA is designed to enable the Agency to focus13\nits attentions on the higher risks and worse performers, for example by informing the choices14\nthat managers make over how often front line regulators should visit premises and what they15\nshould look for. It may, in some circumstances, also help its officers to decide how much16\ndiscretion they should apply during visits and how to balance their regulatory effort between17\nissues (events occurring now) and risks (potential future issues). Initial work on OPRA18\nprovided valuable insight into the role of risk-based regulation, the choice of regulatory styles19\nand tools, and the influence these can have on driving business behaviours.20\n21\n3. The influence of risk-based environmental regulation22\nWith respect to the development of risk-based regulation, regulated businesses have23\nwelcomed approaches that are risk-based – these are seen to make sound business sense24\n(Confederation of British Industry, 1998; Confederation of British Industry, 1999). For good25\n6operators, these initiatives are likely to result in investments that would be made anyway on1\nthe grounds of responsible corporate governance, and are thus supportable in scientific and2\nbusiness terms. The Agency’s current operator performance assessment seeks to rank the3\nmaturity of an operator’s environmental performance by reference to key attributes. Many4\nregulated sectors (e.g. United Kingdom Offshore Operators Association, 1999) have risk-5\nbased approaches in place to guide operations, reduce business exposure and lessen business6\ninterruption losses. ‘Best-in-class’ organisations are better at managing risks wisely, learning7\nfrom failure, and they exhibit resilience (robustness to shock) and agility (adaptive8\nmanagement and forward-looking) in response to an evolving business climate. Specifically,9\nthey balance business risk and opportunity in a mature fashion that ensures exposures are10\nminimised and strategic competitive advantage is secured. Organisations competent in risk11\nmanagement recognise this maturity of capability is not secured solely through having risk12\nframeworks, risk assessment manuals, audit trails, risk champions and risk registers in place.13\nThey assess their risk maturity (MacGillivray, 2008; IACCM, 2003) because it: (i) helps14\nformalise their appetite for risk; (ii) makes more explicit the role of the group risk manager;15\n(iii) provides opportunity for evaluating the implementation of risk management on the16\nground – that is, a reality check against high-level, corporate statements on risk; and (iv) it17\nbuilds sustained corporate value. The risk management benchmarking tools now applied18\nwithin high reliability sectors have value in the context of self-regulation for high performing19\nsectors.20\nSecuring evidence (Pollard, 2008) for the environmental outcomes mediated by modern21\nregulation infers that causal links are established between regulatory style and environmental22\nimprovements (National Audit Office and Better Regulation Executive, 2007). Among the23\nissues and observations raised by the Hampton implementation review of the Environment24\nAgency’s progress (Better Regulation Executive and National Audit Office, 2008)are that:25\n7(i) the Environment Agency has made encouraging progress in implementing the1\nHampton principles;2\n(ii) better regulation is certainly in the language of the organisation, but not yet embedded3\nthroughout its culture;4\n(iii)there appears to be scope for OPRA to be used more effectively to incentivise5\ncompliance and inform risk-based interventions;6\n(iv)the Agency is currently unable to demonstrate a causal link between day-to-day7\nregulatory activities and outcomes;8\n(v) it is not clear whether it is prioritising its resources on those sectors, emissions or9\nactivities which are most damaging to the environment” (para 95);10\n(vi)the quality and impact of inspections seems to depend on the competence and11\nconfidence of individual inspectors – some inexperienced staff appear to lack the12\nconfidence to exercise balanced risk-based judgements;13\nEstablishing causality in this sense (iv, above) is not easily achieved given the confounding14\nfactors influencing environmental change and the multiple actors with this common interest.15\nWeighted lines of evidence may support (or otherwise) the relationship between regulatory16\nstyle and outcome (McPherson, 2008). Weight-of-evidence approaches (Krimsky, 2005)17\nmay use influence diagrams, evidential support logic, and Bayesian belief nets (Pourret,18\n2008; Schum, 1994) as visual aids to support the presentation of cause and effect. There is an19\nestablished literature for weight of evidence assessments, developed in the fields of public20\nhealth medicine (Hrudey, 2003), forensic science and radioactive waste management, with21\nsome applications to environmental risk and a history of using Bayesian methods, for22\nexample in the regulation of water utilities (O’Hagan, 2007). Individual environmental risk23\nassessments frequently make use of data, concepts and assumptions for which a range of24\nevidence of varying quality exists. In using assumptions to support risk assessments, risk25\n8analysts frequently need to select between competing theories (e.g., low dose extrapolation),1\nbetween a range of individual baseline studies (e.g., arsenic in drinking water) or from a2\npalette of future environmental scenarios (e.g., climate change). Such analyses involve3\nevaluating both complementary and potentially conflicting lines of reasoning, the direction4\nand weight of which must be assessed in support of a specific qualitative or quantitative line5\nof argument. Assembling such evidence within a framework of precaution, whilst also6\nguided by requirements for proportionate levels of intervention, has long been a requirement7\nof the safety cases prepared for radioactive waste disposal. Equally the approach has8\napplication to the management of exposures from engineering nanomaterials.9\nAlongside tools to integrate evidence, effective environmental decision making needs to10\nface up squarely to key value tradeoffs. Value trade-offs are ubiquitous in regulation.11\nExamples include the tradeoffs between efficacy, efficiency and equity, or public good and12\nprivate profit, or in cases where regulatees face choices between visible and reassuring13\nremediation strategies versus invisible but possibly more effective ones (monitored natural14\nattenuation for contaminated groundwaters). For these decisions, the Environment Agency15\nhas been a sponsor of systematic multicriteria (or multiattribute) decision analysis (MCDA;16\nBelton, 2002; Dodgson, 2000) which provide a framework within which value trade-offs can17\nbe made explicit. Agency guidance on best practicable option appraisal for radioactive waste18\ndisposal at nuclear sites (Environment Agency and Scottish Environment Protection Agency,19\n2004; Egan, 2002), for example, recommends nuclear operators undertake a participatory20\nmulticriteria appraisal exercise as part of the choice of disposal technology. The rationale21\noffered is that this not only ensures the regulatee takes into account the views of local22\nstakeholders in the technology choice, but that it also provides a framework for discussion23\nbetween regulator and regulatee. This is in line with experience in other countries, where24\nmulticriteria approaches have been used in heavily regulated environments as a device to25\n9make explicit and balance competing demands from a range of stakeholders, for example by1\nenergy companies BC Gas and BC Hydro in Canada (Keeney and McDaniels 1992; Hobbs2\nand Horn 1997; Keeney and McDaniels 1999). However, there are a range of different3\nphilosophies of how MCDA (broadly conceived) should be applied, particularly for4\nenvironmental applications (Renn, 1993; Gregory, 1992) and the question of what works best5\nin a regulatory setting seems to be an open one.6\nFinally, as to the application of different regulatory styles, the adoption of a risk-based7\napproach has enabled the Agency to engage with firms in a more responsive way that targets8\nscarce regulatory resources on the higher risks and the worse performers. Although it could9\nbe argued that regulators have been using their discretionary powers to do this for many10\nyears, OPRA has given the Agency a more robust way of generating evidence on risk that can11\nbe used to support the adoption of different styles in a relatively clear, consistent and12\ntransparent way. When coupled with a similarly clear and transparent enforcement policy,13\nthis has enabled the Agency to adopt a sanctions-based regulatory style for the higher risks14\nand worse performers (something called for by central government through the Hampton and15\nMacrory Reports (Hampton, 2005; Macrory, 2006), and a more cooperative compliance-16\nbased approach for the lower risk and better performers (Gouldson, 2004). In theory (Ayres,17\n1994), such an approach can deliver more targeted and proportionate forms of regulation in a18\nmore consistent, transparent and accountable way, thereby satisfying the Government’s19\nprinciples for better regulation. It can also deliver efficiency gains for regulators, who are20\nable to focus their resources more effectively, and for the more compliant operators who may21\nbe regulated less intensively. As long as the basis for risk-based decision making is22\ncommunicated effectively, it could also enhance stakeholder trust in, and therefore the23\npolitical acceptability of, environmental regulation.24\n10\nThis interactive aspect of regulation – the fact that one is dealing with a relatively small1\nnumber of informed regulatees who have objectives of their own, and will respond to their2\nperceptions of regulator behaviour - is one of the critical aspects of regulatory decision3\nmaking. Understanding this complex relationship requires drawing on a range of insights4\nfrom a number of academic disciplines. In public administration, for example, the idea of5\n‘relational distance’ has been helpful: the argument has been made, where inspectors are6\ndrawn from a different background from inspectees, that they are more likely to take a tough7\nsanctions-based approach, and where they are drawn from a similar background, they are8\nmore likely to take a gentler compliance-based approach (Hood, 1999; Bevan, 2006). Formal9\napproaches to examining this interaction, particularly in the area of monitoring and10\nenforcement, have attracted attention from environmental economists in the UK and11\ninternationally, particularly in the US (see the extensive collection of readings in Russell12\n2003). Despite the volume of work on this issue, and attempts by such analysts in countries13\nsuch as Germany (Avenhaus 1994) and Denmark (Hansen, Krarup and Russell 2006) to14\ndevelop usable tools based around available practice and data, we are not aware of similar15\ntools having been passed into routine operational use in day-to-day management in the UK.16\n17\n4. Challenges with risk-based regulation18\nThere is, therefore, an accumulation of experience in the design and application of risk19\nbased regulation in the Environment Agency and an ongoing programme of policy-oriented20\nresearch that supports the Agency’s initiatives in this field (Table 1). Although the outcomes21\nof risk-based approaches have yet to be subjected to rigorous evaluation, there is a general22\nbelief that risk based approaches do lead to better regulatory outcomes.23\nWhen considered against the UK government’s principles for better regulation, risk based24\napproaches are seen as the main way of moving beyond a ‘one size fits all’ approach, and as25\n11\ndelivering more targeted forms of intervention. Drawing on the evidence base provided by1\nnew forms of risk assessment, risk based approaches are also seen to provide more2\nproportionate forms of intervention. However, it is not yet explicitly clear that risk based3\napproaches are applied by reference to the same set of overarching principles across different4\ndomains (i.e. the regulation of the different risks associated with climate change, flooding,5\nradioactive waste, toxic pollution etc.), at different levels (i.e. senior managers taking6\nstrategic decisions, front-line managers taking operational decisions, front-line regulators7\ntaking ‘street level’ decisions) or in different sectoral (i.e. commercial, industrial,8\nagricultural) or geographical areas of Agency operation. Furthermore, while schemes such as9\nOPRA make the basis for regulatory decisions more transparent and accountable to10\nregulatees, it is not yet clear that risk-based approaches have made regulatory activities more11\ntransparent and accountable to the public, despite Agency efforts to develop new forms of12\nengagement and communication (Irving et al., 2007).13\nWhen considered against the standard criteria for policy evaluation, it is assumed that risk14\nbased approaches lead to more efficient regulation, both for the public sector as scarce15\nregulatory resources can be applied in a more targeted way and for the private sector as16\nbusiness burdens for the better performing firms and sites are reduced through lighter touch17\nregulation. It is also hoped that it leads to more effective regulation as it increases the18\nincentives for compliance through the prospect of lighter touch regulation, and the dis-19\nincentives for non-compliance through the prospect of more intensive regulation and the20\nimposition of higher sanctions. Because of these assumed incentives, risk based approaches21\nare popular with politicians and businesses, but there has been some concern amongst broader22\nstakeholder groups that better regulation actually means less regulation and that the23\ndistributional impacts of risk based approaches are not yet clear.24\n12\nA fuller and more rigorous evaluation of the extent to which risk based approaches secure1\npositive outcomes as measured against the criteria mentioned above would test these2\nassumptions and strengthen the evidence base that underpins this aspect of Agency3\noperations. It would provide critically important feedback to enable institutional learning4\nwithin the Agency. By providing clear measures of performance, it could also enhance the5\ntransparency and accountability of, and therefore potentially build trust in, risk based6\napproaches to regulation. Research to this effect is now underway within the Agency.7\nRelated to the requirement for fuller and more rigorous evaluations of outcomes, there are8\na number of other more specific challenges facing the Environment Agency:9\ni) Understanding best practice and promoting consistency in risk based regulation10\nThe Environment Agency is not alone in adopting risk-based approaches. Private sector11\norganizations engaged in activities such as insurance, auditing and certification, technology12\nsupply and business development clearly have significant levels of expertise and experience.13\nRegulators in other countries and in other domains also have relevant insights that could14\ninform the development of a best practice model of risk regulation, perhaps most notably15\nfrom the Health and Safety Executive. Potentially, both public and private sector bodies in16\nthe UK have data sets that could be combined to develop a more integrated risk regulation17\nframework. The Environment Agency could benefit from reviewing other models of risk18\nmanagement and risk based regulation in such private and public organisations. Finally, there19\nis a diversity of experience within the Agency that could be evaluated to develop a best20\npractice model of risk-based regulation that could be applied more consistently across the21\nAgency. Initiatives in all of these areas would help to convince the Agency’s key22\nconstituencies and stakeholders that it understood and was consistently applying best practice23\nin risk based regulation. A valuable initiative is the ongoing Agency research into24\n13\nmonitoring the effectiveness of risk-based decisions, and collation of Agency projects where1\nrisk-based decision-making has been at the heart of the decision process.2\nii) Developing reliable, responsive forms of risk assessment and monitoring3\nClearly risk-based approaches rely on risk assessments and on-going monitoring. Some4\nmeasures of risk are routinely assessed and monitored in formalised processes that provide a5\ntransparent and defensible basis for risk-based decision making. However, other more6\nsubjective or experiential measures of risk are harder to measure in a formal way, and there7\nare ill-defined issues about how different stakeholders might meaningfully participate, and8\nhow different forms of risk perception or tolerance should be taken into account. Equally9\nunclear is the extent to which risk data is time and context specific, and whether existing10\nforms of monitoring are sensitive enough to detect subtle but ultimately extremely important11\nchanges in risk management capacities or cultures in regulated firms. By developing new12\nrisk assessment and monitoring techniques that respond to these challenges, the Agency may13\nbe able to enhance the efficacy, efficiency and equitability of risk based approaches. A14\ncritical step forward has been the Agency’s work on strategic risk assessment (Pollard, 2004)15\nand its attempts to better characterize environmental harm through comparative risk16\nassessment (Environment Agency, 2005). This ongoing risk policy research is likely to17\ncontinue to inform the Agency’s strategy and form the basis for assessments of efficacy and18\nefficiency.19\niii) Building capacities for responsive risk regulation20\nAs well as requiring appropriate forms of monitoring, the Agency needs to build on its21\nexisting capacities for risk based decision making. Given the nature of the available22\nevidence, the significance of uncertainty and ignorance and the range of sometimes23\ncompeting risk perceptions, stronger and possibly more open, inclusive and accountable24\nframeworks for multi-criteria or multi-attribute decision making are needed. One of the key25\n14\nchallenges here is to resolve the tensions between the need for rapid, responsive and evidence1\nbased forms of decision making and calls for more open, inclusive and deliberative forms of2\ndecision making. Trade-offs between the speed or efficiency, the quality or efficacy and the3\nfairness or equitability of risk based decision making need to be better understood and4\naddressed. Finally, the Agency will be challenged more and more to ensure that it has5\nresources that can be rapidly redeployed, and the agility to switch between regulatory styles6\nin response to changing levels of risk. By building its capacities to act in these ways, the7\nAgency would be able to respond to the competing pressures that it commonly encounters in8\na well informed and balanced way.9\niv) Evaluating the influence of different regulatory styles10\nWhile a limited body of research has considered the influence of national styles of regulation11\n(Vogel, 1986; Gouldson, 2004) there has been little or no research on the influence that12\ndifferent regulatory styles can have when applied in combination. It is normally expected13\nthat a risk-based approach that regulates lower risks and better performers less intensively14\nand that enables scarce resources to be redirected towards the higher risks and worse15\nperformers will, in aggregate, lead to more effective outcomes (i.e. lower overall levels of16\nrisk\/better overall levels of environmental performance). However, it may be that the17\nopposite is true; intensive scrutiny from regulators maybe the main driver of compliance in18\nbetter performing firms, so lighter touch regulation may, over time, lead to lower levels of19\ncompliance amongst that category of firm; whilst intensive regulatory scrutiny may under20\nsome circumstances prevent the worse performing firms from developing the capacities and21\ncultures needed to manage risks and improve performance. More research is needed on the22\nextent to which different styles (and combinations of style) can build capacities, strengthen23\ncultures and change behaviour in different types of regulated operator. This would enable24\n15\nmore targeted and tailored approaches to regulation to emerge that both improve1\nenvironmental outcomes and reduce business burdens.2\nv) Understanding the role of the private sector3\nIncreasingly, it is acknowledged that regulatory agencies do not have all of the powers,4\nresources and information needed to regulate risks effectively. Indeed, some have suggested5\nthat we are witnessing a shift from state-centred regulation where powers are concentrated in6\nregulatory bodies such as the Environment Agency to de-centred forms of governance, where7\npowers are dispersed in broader networks of public, private and civic actors (Black, 2001;8\nGouldson, 2007). However, the range of roles that private actors such as insurers,9\nconsultants, trade associations, business development agencies and regulated firms can play10\nin achieving public interest goals has yet to be fully investigated. A key issue is whether, and11\nunder what conditions, the Agency might transfer some of its responsibilities to the private12\nsector. An obvious example relates to the role of private regulations such as environmental13\nmanagement systems standards, where the Agency has considered giving ISO14001 certified14\nsites a lighter touch. However, research has questioned the extent to which ISO1400115\nguarantees improvements in environmental performance (Dahlström, 2003), and there are16\nmajor concerns about the accountability of private sector organisations and about their17\ncapacity to regulate firms they have a commercial relationship with. Even where these can be18\naddressed, there remain concerns about transaction costs and risk as it is not clear that basing19\naspects of the regulatory process on complex relationships between regulators and a20\npotentially wide range of private actors would be any cheaper or more reliable than21\ncontinuing to rely on the Agency to deliver risk based approaches. Being clear on this would22\nenable the Agency to better understand when and under what conditions it may be23\nappropriate to delegate some of its powers to private actors.24\n25\n16\nConclusions1\nRisk based approaches are being widely employed within the better regulation agenda2\n(OECD, 2006). They can be used to shape regulatory interventions and prioritise preventative3\ncontrols (Department for Communities and Local Government, 2007), hopefully generating4\nbetter (and in particular more effective and efficient) outcomes. Within this paper, we have5\nreviewed existing experiences with risk-based approaches, but we have also highlighted some6\nof the challenges that need to be addressed if risk-based approaches are to contribute fully to7\nthe realisation of modern or better regulation.8\nWe adopt preventative risk management because we seek to avoid the unwarranted9\nincidents that could lead to environmental harm. Though advocates of the benefits of risk-10\nbased regulation, we sound in closing a note of caution on what we perceive to be a creeping11\neconomic rationalism within regulation. When designed well, piloted and implemented with12\nfeedback, risk-based regulation can provide a sound basis for distinguishing greater risks13\nfrom lesser ones, and for investing resources in risk management proportionate to the risks14\nposed. However, it is important to acknowledge that these regulatory processes may also15\nincur risk, unless the consequences of resource trade-offs are fully understood and, for certain16\nconsequences, guarded against. In other words, whilst risk-based approaches promise better17\nregulation, if they prioritise efficiency over efficacy they also risk contributing to regulatory18\nfailure with potentially significant impacts on human health and the environment. We19\ntherefore suggest that risk-based approaches should be explored, but in a precautionary way20\nwhere reductions in the efficacy or reliability of regulation are not risked in the pursuit of21\nefficiency gains.22\n23\nAcknowledgements24\n17\nThe contribution was funded by the Environment Agency’s Modernising Regulation Science1\nProgramme. The authors thank Chris Booth, Mark White and Phil Irving for the discussions2\nthat have informed this manuscript. The views expressed are the authors’ alone.3\n4\nREFERENCES5\n6\nAvenhaus, R. Decision theoretic analysis of pollutant emission monitoring procedures.7\nAnnals of Operations Research 1994; 54: 23-38.8\nAyres, I. and Braithwaite, J. Responsive regulation: Transcending the deregulation debate,9\n(1994) Oxford OUP10\nBelton, V. and T. J. Stewart Multiple criteria decision analysis: an integrated approach.11\n(2002) Boston, Kluwer12\nBetter Regulation Executive and National Audit Office. Effective inspection and13\nenforcement: implementing the Hampton vision in the Environment Agency, (2008)14\nBRE and NAO, London, 48pp15\nBevan, G. and Cornwell, J. Structure and logic of regulation and governance of quality of16\nhealth care: was OFSTED a model for the Commission of Health Improvement? (2006)17\nHealth Economics, Policy and Law 1: 343-37018\nBlack, J. Decentring regulation: understanding the role of regulation and self regulation in a19\n“post-regulatory” world. (2001) Current Legal Problems 54, November, pp. 103-14620\nConfederation of British Industry. Shaping up: report of the environmental protection survey,21\n(1999) CBI, London, 39pp22\nConfederation of British Industry. Worth the risk: improving environmental regulation,23\n(1998) CBI, London, 23pp24\nDahlström, K., Howes, C., Leinster, P. and Skea, J. Environmental management systems and25\ncompany performance: assessing the case for extending risk-based regulation (2003)26\nEuropean Environment, 13(4): 187-20327\nDefra, Risk management strategy, (2002) Department for Environment, Food and Rural28\nAffairs, London29\nDepartment for Communities and Local Government. The Future of building control, (2007)30\nDCLG, London, 15pp. and the Pensions Regulator, Business plan 2006-2007 (2006),31\nLondon, 33pp32\n18\nDepartment of the Environment, A guide to risk assessment and risk management for1\nenvironmental protection, (1995) HMSO, London, 92pp2\nDepartment of the Environment, Transport and the Regions (DETR), Risk assessment3\nmethod for local air pollution control: A consultation paper; (2000) DETR: London, UK4\nDepartment of Environment, Transport and the Regions (DETR), Waste management5\nlicensing. Risk assessment inspection frequencies. ‘OPRA for Waste’. A consultation6\npaper; (1999) DETR: London, UK7\nDETR and the Environment Agency. Guidelines for environmental risk assessment and8\nmanagement, Revised Guidance, DETR, EA and Institute of Environmental Health,9\n(2000) 88pp. The Stationery Office, London10\nDodgson, J., Spackman, M. et al. Multicriteria analysis: a manual, (2000)11\nhttp:\/\/www.communities.gov.uk\/documents\/corporate\/pdf\/14686812\nEgan, M. et al. Best practicable options for radioactive waste disposal at nuclear sites, (2002)13\nReport P3-094, Environment Agency14\nEnvironment Agency, Informing strategic decisions with comparative risk assessment: a15\nliterature review. (2005) Science report RIS-05-01, Environment Agency, Bristol, ISBN16\n1 844 325 199, 46pp17\nEnvironment Agency, Operator and Pollution Risk Appraisal (OPRA), (1997) Version 2,18\nEnvironment Agency, Bristol, 34pp19\nEnvironment Agency and Scottish Environment Protection Agency. Guidance for the20\nEnvironment Agencies’ Assessment of Best Practicable Environmental Option studies21\nat nuclear sites, (2004) Environment Agency, Bristol22\nESRC Global Environmental Change Programme, Risky choices, soft disasters.23\nEnvironmental decision-making under uncertainty, (2000) University of Sussex,24\nBrighton25\nEuropean Commission, IMPEL Report: Minimum criteria for inspections – frequency of26\ninspections; Implementation and Enforcement of Environmental Law (IMPEL) (1998)27\nNetwork: Brussells, Accessed 1\/5\/01 at URL28\nhttp:\/\/www.europe.eu.int\/comm\/environment\/impel\/reports29\nEuropean Commission (2009) Third Strategic Review of Better Regulation in the European30\nUnion, European Commission communication, COM(2009)15, 28 January.31\nGouldson, A. and Bebbington, J. Corporations and the governance of environmental risks,32\n(2007) Environment and Planning C, Vol 25, Issue1, pp4-2033\n19\nGouldson, A. Cooperation and the capacity for control: regulatory styles and evolving1\ninfluences of environmental regulation in the UK, (2004) Environment and Planning C,2\n22: 583-6033\nGouldson, A. Cooperation and the capacity for control: Regulatory styles and the evolving4\ninfluences of environmental regulation in the UK, (2004) Environment and Planning C,5\n22: 583-6036\nGreen Alliance, Steps into uncertainty: Handling risk and scientific uncertainty, (2000) Green7\nAlliance and ESRC Global Environmental Change Programme, available at8\nwww.green-alliance.org.uk\/Publications9\nGregory, R. Keeney, R. et al. Adapting the environmental-impact statement process to inform10\ndecision-makers. (1992) J. Policy Anal. Manage. 11(1): 58-7511\nGunningham, N. and Grabosky, P. Smart regulation: Designing environmental policy, (1999)12\nClarendon Press13\nHalfacree, S. Pollution risk management, (1998) Issues in Environ. Sci. Technol. 9: 37-5614\nHampton, P. Reducing administrative burdens: effective inspection and enforcement, (2005)15\nHM Treasury, 147pp16\nHampton, P. Reducing administrative burdens: effective inspection and enforcement, (2005)17\nHM Treasury18\nHansen, L. G., S. Krarup and C. S. Russell. Enforcement and Information Strategies. Journal19\nof Regulatory Economics 2006; 30(1): 45-61.20\nHer Majesty’s Inspectorate of Pollution, Operator and Pollution Risk Appraisal (OPRA),21\n(1995) HMIP, London, 22pp22\nHer Majesty’s Inspectorate of Pollution, The application of risk assessment and risk23\nmanagement to integrated pollution control, (1995) Centre for Integrated Environmental24\nRisk Assessment, Report 1, HMIP, London, 59pp25\nHobbs, B. F. and G. T. F. Horn. Building public confidence in energy26\nplanning: a multimethod MCDM approach to demand-side planning at BC gas. Energy27\nPolicy 1997; 25(3): 357-375.28\nHood, C., James, O. et al. Regulation inside government: waste-watchers, quality police and29\nsleazebusters, (1999) Oxford, OUP30\nHouse of Commons, The BSE enquiry, (2000) Volume 1: findings and conclusions; The31\nStationery Office: London32\nHouse of Lords, Select Committee on Science and Technology 1999-2000 (2000), 3rd report.33\nScience and Society, HL Paper 38, The Stationery Office, London34\n20\nHouse of Lords, Select Committee on Economic Affairs, (2006) 5th Report. Government1\npolicy of the management of risk, Volume 1, HL 183-I, The Stationery Office, London2\n40pp3\nHrudey, S.E and Leiss, W. Risk management and precaution – insights on the cautious use of4\nevidence. (2003) Environ. Health Persp. 111:1577-15815\nIACCM, Organisational maturity in business risk management. The IACCM business risk6\nmanagement maturity model (BRM3), (2003) 14pp, Ridgefield, CT, USA7\nInterdepartmental Liaison Group on Risk Assessment, Risk assessment and risk management:8\nImproving policy and practice within Government departments, 37pp, HSE Books,9\nSuffolk10\nIrving, P., Bone, B., Hayes, E., Colvin, J., Irwin, J., Stilgoe, J. and Jones, K. A people’s11\ninquiry on nanotechnology and the environment, (2007) Science Report12\nSCHO0607BMUJ-E-P. Environment Agency, Bristol.13\nOECD (2005) Guiding Principles for Regulatory Quality and Performance, Organisation for14\nEconomic Cooperation and Development, Paris.15\nKeeney, R. L. and T. L. McDaniels. Value-focused thinking about strategic decisions at BC16\nHydro. Interfaces 1992; 22(6): 94-109.17\nKeeney, R. L. and T. L. McDaniels. Identifying and structuring values to guide integrated18\nresource planning at BC Gas. Operations Research 1992; 47(5): 651-662.19\nMacGillivray, B.H. and Pollard, S.J.T. What can water utilities do to improve risk20\nmanagement within their business functions? An improved tool and application of21\nprocess benchmarking, (2008) Environ. Intl., in press22\nMacrory, R. Regulatory justice: making sanctions effective, (2006) Cabinet Office Better23\nRegulation Executive24\nMcPherson, C. et al. The importance of benthos in weight-of-evidence sediment assessments25\n– a case study, (2008) Sci. Tot. Environ. 394: 252-26426\nNational Audit Office and Better Regulation Executive, Hampton implementation reviews:27\nGuidance for review teams, (2007) NAO and BRE, London, 30pp28\nOECD, Risk and regulation: issues for discussion. (2006) Working Party on Regulatory29\nManagement and Reform. Public Governance Committee, Public Governance and30\nTerritorial Development Directorate, OECD, Paris, Paper GOV\/PGC\/REG(2006)1,31\n26pp32\nO’Hagan, A. The ABLE story: Bayesian asset management in the water industry. The33\npractice of Bayesian analysis. (1997) S. French and J. Q. Smith. (eds) London, Arnold34\n21\nOXERA, Policy, risk and science: Securing and using scientific advice. (2000) Contract1\nResearch Report 295\/2000. HSE Books, Sudbury (at: www.hse.gov.uk\/research)2\nParliamentary Office of Science and Technology (POST) Safety in Numbers? Risk3\nAssessment in Environmental Protection, (1996) POST, London,4\nPollard, S.J.T. An overview of the use of risk assessment for environmental regulation in the5\nUK – key drivers and regulatory initiatives, (2001) Risk, Decision & Policy 6: 33-466\nPollard, S.J.T., Davies, G.J., Coley, F. and Lemon, M. Better environmental decision-making7\n– recent progress and future trends, (2008) Sci. Tot. Environ., in press8\nPollard, S.J.T., Kemp, R.V., Crawford, M. Duarte-Davidson, R. Irwin, J.G. and Yearsley, R.9\nCharacterising environmental harm: developments in an approach to strategic risk10\nassessment and risk management, (2004) Risk Anal., 24(6): 1551-156011\nPollard, S.J.T., Yearsley, R., Reynard, N., Meadowcroft, I.C., Duarte-Davidson, R. and12\nDuerden, S. Current directions in the practice of environmental risk assessment in the13\nUnited Kingdom, (2002) Environ. Sci. Technol. 36(4):530-53814\nPourret, O., Naïm, P. et al. Bayesian networks: A practical guide to applications (2008),15\nWiley-Blackwell16\nRenn, O., Webler, T. et al. Public participation in decision making: a three-step procedure.17\n(1993) Policy Science 26: 189-21418\nRothstein, H., Irving, P., Walden, T. and Yearsley, R. (2006) The risks of risk-based19\nregulation: insights from the environmental policy domain, Environment International20\n32: 1056-1065.21\nRussell, C. S., Ed. (2003). The Economics of Environmental Monitoring and Enforcement.22\nThe international library of environmetal economics and policy. Ashgate, Aldershot,23\n2003, 573 pp.24\nSchum, D.A. The evidential foundations of probabilistic reasoning, (1994) Chichester, Wiley25\nStrategy Unit, Risk: Improving Government’s capability to handle risk and uncertainty,26\n(2002) The Strategy Unit, London, 134pp27\nUnited Kingdom Offshore operators Association, (1999) Industry Guidelines on a28\nFramework for Risk Related Decision Support; United Kingdom Offshore Operators29\nAssociation: London, UK30\nVogel, D. National Styles of regulation: Environmental policy in Great Britain and the United31\nStates, (1986) Cornwall University Press32\n33\n22\nTable 1 Recent Agency-funded research on risk-based regulation1\n2\nResearch question Addressed by Report number Date\nHow should we manage conflicts in expert\nopinion on risk?\nUnderstanding risk cultures. Supporting\nconsistency in environmental risk assessment.\nCEH workshop report.\nE2-064 2002\nWhat opportunities exist to align risk-based\nregulation with corporate initiatives on\nbusiness risk management?\nDames and Moore review of current initiatives\nin corporate risk management\nE2-056 2002\nHow should we compare environmental risks\nof strategic importance?\nReviews and methodology for strategic and\ncomparative risk assessment. National Centre\nfor Risk Analysis and Options Appraisal-Galson\nSciences case studies. Review of comparative\nrisk assessment tools\nE2-041\nSC050030\n2002\n2007\nHow is operator environmental performance\nand environmental risk are recognised in the\nregulatory\nArticle 10 of the revised Eco-management and\nAudit Scheme regulation requires member\nstates to take steps to ensure that the work of\nEMAS verifiers and the regulators is not\nduplicated. This report indicates what work has\nbeen undertaken in other member states in this\nregard.\nP6-005 2002\nHow sound are the Agency's environmental \/\nbusiness risk criteria in order to ensure its\npracticality, robustness and credibility\nTenaco Limited report. E2-055 2003\nDoes societal concern lead policy makers to\ndevelop more stringent risk management\nobjectives and standards?\nReport of a one-day workshop SC030032 2004\nHow do the characteristics, functions and\napproaches to influencing used by special\ninterest groups impact of the Agency's work?\nUniversity of Surrey. Study aims to assist staff,\nparticularly at the local level, to engage\neffectively with them as a part of their regular\nactivities and around contentious issues\nSC020067 2004\nHow should we involve stakeholders in risk\nassessment-risk management decisions?\nNational Centre for Risk Analysis and Options\nAppraisal - University of Birmingham study\nSC000009 2004\nWhat do internal Agency staff understand by\nrisk-based regulation?\nEnvironmental Policy, Risk and Forecasting\ninternal questionnaire\nInternal\naudience only\n2007\nDoes risk-based compliance assessment\nsupport the principles of modern regulation?\nRMC study and case study report SC040042 2007\nWhat futures might the Agency utilise to\nevaluate its own business risks against?\nA set of four (updateable and risk-based)\nscenarios (for the 2050s) for the Environment\nAgency to improve the robustness of its future\nplanning by providing a credible, consistent tool\nto aid decision making processes that will be\nsupported by a set of robust indicators.\nSC050002 2007\nCan we secure better, more effective risk-\nbased decision-making?\nCranfield University and Environmental Policy\nstudy. Methodology developed for assessing\nflagship risk-based decisions in Agency in\nresponse to Hampton Implementation Review.\nSC070055 ongoing\n3\n"}