{"doi":"10.1063\/1.2357844","coreId":"100833","oai":"oai:epubs.surrey.ac.uk:231","identifiers":["oai:epubs.surrey.ac.uk:231","10.1063\/1.2357844"],"title":"Interpenetrating multiwall carbon nanotube electrodes for organic solar cells","authors":["Miller, AJ","Hatton, RA","Silva, SRP"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-09-25","abstract":null,"downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"AMER INST PHYSICS","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:231<\/identifier><datestamp>\n      2017-10-31T13:57:14Z<\/datestamp><setSpec>\n      74797065733D61727469636C65<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:6E616E6F656C656374726F6E696373<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/231\/<\/dc:relation><dc:title>\n        Interpenetrating multiwall carbon nanotube electrodes for organic solar cells<\/dc:title><dc:creator>\n        Miller, AJ<\/dc:creator><dc:creator>\n        Hatton, RA<\/dc:creator><dc:creator>\n        Silva, SRP<\/dc:creator><dc:publisher>\n        AMER INST PHYSICS<\/dc:publisher><dc:date>\n        2006-09-25<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/231\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Miller, AJ, Hatton, RA and Silva, SRP  (2006) Interpenetrating multiwall carbon nanotube electrodes for organic solar cells   APPLIED PHYSICS LETTERS, 89 (13), ARTN 1.       <\/dc:identifier><dc:relation>\n        10.1063\/1.2357844<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/231\/","10.1063\/1.2357844"],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"APPLIED PHYSICS LETTERS 89, 133117 \u00012006\u0002Interpenetrating multiwall carbon nanotube electrodes\nfor organic solar cells\nAnthony J. Miller,a\u0001 Ross A. Hatton, and S. Ravi P. Silva\nNano-Electronics Centre, Advanced Technology Institute, University of Surrey, Guildford,\nSurrey GU2 7XH, United Kingdom\n\u0001Received 3 April 2006; accepted 5 August 2006; published online 27 September 2006\u0002\nLow concentrations of multiwall carbon nanotubes \u0001MWCNTs\u0002 \u0001\u00031 wt % \u0002 uniformly distributed\nwithin the donor layer of a heterojunction organic solar cell are shown to be an effective means of\ngreatly reducing cell series resistance without compromising cell shunt resistance, resulting in an\nincrease in cell fill factor of 50–60%. By chemically functionalizing MWCNTs with polar surface\nmoieties, it is also possible to manipulate device open circuit voltage. The results of this study\ndemonstrate that MWCNTs have excellent potential as a versatile interpenetrating electrode material\nfor organic solar cells. © 2006 American Institute of Physics. \u0004DOI: 10.1063\/1.2357844\u0005Organic solar cells have considerable potential as an\neconomically viable path to harvesting energy from\nsunlight.1 The primary obstacles to realizing applications are\nthe poor operational lifetime and low power conversion effi-\nciency of these devices.1 The former principally results from\nthe susceptibility of conjugated polymers to\nphotodegradation,2 thermal degradation,2 and detrimental\ndoping by atmospheric oxygen.3 However, advances in poly-\nmer stability and encapsulation techniques promise to over-\ncome lifetime issues for short to medium lifetime\napplications.4 In order to maximize the power conversion\nefficiency in these devices the short circuit current density\n\u0001Jsc\u0002, open circuit voltage \u0001Voc\u0002, and fill factor \u0001FF\u0002 must all\nbe maximized. A number of researchers have investigated the\npossibility of utilizing single wall carbon nanotubes\n\u0001SWCNTs\u0002 as the electron acceptor and electron extracting\nelectrode in heterojunction organic solar cells.5,6 Unfortu-\nnately, while these devices exhibit large Voc, the Jsc remains\nlow as compared to cells employing Buckminsterfullerene\n\u0001C60\u0002 as the acceptor material. Semitransparent SWCNT\nfilms have also been demonstrated to be potentially low cost\nalternatives to the indium tin oxide \u0001ITO\u0002 glass electrode in\nbulk heterojunction organic solar cells.7–9 This letter reports\nthe results of investigations aimed at utilizing multiwall car-\nbon nanotubes \u0001MWCNTs\u0002 as an interpenetrating hole-\nextracting electrode in bilayer organic solar cells based on\nthe model heterojunction, poly\u0001m-phenylenevinylene-co-2,5-\ndioctyloxy-p-phenylenevinylene\u0002 \u0001PmPV\u0002\/C60. PmPV was\nchosen as the model donor material because it absorbs\nstrongly in the visible spectrum and is known to solubilize\nMWCNTs without the need for covalent functionalization.10\nUnlike SWCNTs—which are invariably a mixture of metal-\nlic and semiconducting nanotubes—all MWCNTs exhibit\nmetallic conductivity, making them a more reliable prospect\nas an electrode material. This study demonstrates the utility\nof MWCNTs as a versatile, interpenetrating, hole-extracting\nelectrode material for organic solar cells.\nHigh purity \u0001\u000190% \u0002 pristine and hydroxyl functional-\nized MWCNTs grown by chemical vapor deposition were\nobtained commercially \u0001Nanocyl\u0002 and used as received. The\ntypical diameter and length of the MWCNTs were confirmed\na\u0002Electronic mail: anthony.miller@surrey.ac.uk\n0003-6951\/2006\/89\u000213\u0001\/133117\/3\/$23.00 89, 13311\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject toby transmission electron microscopy to be 10 nm and several\nmicrons, respectively.\nFluorinated MWCNTs were prepared by reaction of\npentadecafluoro-octanoyl chloride with hydroxyl functional-\nized MWCNTs. The coupling reaction was performed under\nnitrogen at 90 °C for a period of 20 h. The functionalized\ntubes were repeatedly washed with chloroform over a\n0.2 \u0002m polytetrafluoroethylene filter to remove unreacted\nacid chloride and subsequently dried prior to the device fab-\nrication. Stable dispersions of pristine and functionalized\nMWCNTs in chloroform solutions of PmPV \u0001Sigma-Aldrich\u0002\nwere prepared by ultrasonically dispersing carbon nano-\ntubes in chloroform prior to adding PmPV. Devices were\nfabricated on ITO coated glass precoated with 50 nm\npoly \u00013,4-ethylenedioxythiophene\u0002: poly \u0001styrenesulfonate\u0002\n\u0001PEDOT:PSS\u0002. PmPV solutions containing 0%, 0.25%,\n0.5%, 1%, and 2% MWCNTs by weight \u0001wt % \u0002 were spin\ncoated onto the PEDOT:PSS coated ITO glass substrates to a\nthickness of 50 nm. C60 \u000199.9%\u0002 was deposited under high\nvacuum at 0.2 nm s−1 to a thickness of 50 nm followed by\ndeposition of a 50 nm aluminum counter electrode. The pho-\ntoactive device area was typically 5 mm2.\nOwing to their high aspect ratio, MWCNTs generally\ntend to aggregate in solution and have an extremely low\npercolation threshold in the solid state.11 PmPV forms stable\ndispersions of MWCNTs in chloroform, because the conju-\ngated backbone wraps around the graphitic tubes, rendering\nthem soluble and inhibiting the attractive van der Waals in-\nteractions between them.10 For thin film optoelectronic appli-\ncations it is imperative that the MWCNTs are uniformly dis-\ntributed within thin films cast from solution. Scanning\nelectron microscopy \u0001SEM\u0002 studies reveal that for MWCNT\nloadings \u00032 wt % nanotubes are uniformly distributed\nwithin the PmPV layer, when spin cast onto PEDOT:PSS\ncoated ITO glass \u0001Fig. 1\u0002. Furthermore, the peak-to-peak\nroughness of the said films, measured using an atomic force\nmicroscope, is less than 10 nm, confirming that for MWCNT\nloadings \u00032 wt % carbon nanotubes do not protrude from\nthe film surface, but are confined within the nominal film\nthickness of 50 nm. Consequently, the focus of this investi-\ngation is on MWCNT loadings \u00032 wt %.\nAccording to the metal-insulator-metal \u0001MIM\u0002 model,\nthe built-in potential across a thin film of an intrinsic, wide\nband gap material is equal to the difference in work function\n© 2006 American Institute of Physics7-1\n AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n133117-2 Miller, Hatton, and Silva Appl. Phys. Lett. 89, 133117 \u00022006\u0001between the contact electrodes.12 Figure 2 shows how Voc\nvaries as a function of MWCNT loading within the PmPV\nlayer. The Voc of cells without carbon nanotubes, 0.75 V, is\nconsistent with the difference in work function between the\nAl cathode \u00014.25 eV\u0002 and PEDOT:PSS anode \u00015.0–5.1 eV\u0002.\nFor MWCNT loadings \u00010.25 wt %, Voc is reduced by\n\u00030.35 V to a constant value of \u00030.4 V. Literature values for\nthe work function of MWCNTs vary between 4.3 and\n4.95 eV.13–15 This spread of values reflects the sensitivity of\nwork function to surface defects and contamination, which\ndepend strongly on the method of carbon nanotube synthesis\nand purification. According to the MIM model, the work\nfunction of the MWCNTs used here is \u00034.65 eV, which falls\nwithin the range of reported values determined directly using\nphotoelectron spectroscopy. The reduction in Voc to a con-\nstant value of \u00030.4 V indicates that the MWCNTs are in\nelectrical contact with the PEDOT:PSS coated ITO electrode\nrather than isolated within the PmPV layer. Evidence that the\nreduction in the built-in potential cannot be attributed to par-\ntial shorting of the electrodes by the carbon nanotubes is\ntwofold \u0001i\u0002 Voc converges to \u00030.4 V with increasing carbon\nnanotube concentration, rather than continuing to decline,\nand \u0001ii\u0002 the cell shunt resistance \u0001indicated by the gradient of\nthe fourth quadrant response at 0 V\u0002 remains unchanged\nwhen multiwall carbon nanotubes are introduced into the\nPmPV layer, indicating that the carbon nanotubes do not en-\nhance current leakage across the device at the loading and\ndispersion we have used in our cells.\nThe cell FF is increased when MWCNTs are introduced\ninto the PmPV layer, owing to a sharp rise in forward cur-\nrent. This change in the current-voltage characteristics is\nconsistent with a reduction in cell series resistance. For car-\nbon nanotube loadings \u00041 wt %, the FF is increased by a\nfactor of 1.6–1.7, as compared to the reference device. This\nincrease in FF is a function of carbon nanotube loading and\nappears to saturate for loadings \u00041 wt %. The cell series\nresistance is simply the sum of contributions from bulk trans-\nport within the organic layers, carrier extraction at the elec-\ntrodes, and transport through the contacts to the external cir-\ncuit. The current-voltage characteristics of single layer\nFIG. 1. Representative SEM image of a 50 nm film of PmPV\/1 wt %\nMWCNTs spin cast onto PEDOT:PSS coated ITO glass. The polycrystalline\nstructure of the underlying ITO is clearly visible, indicating that the PmPV\nand PEDOT:PSS layers are sufficiently thin to be semitransparent to sec-\nondary electron emission.diodes comprising a 50 nm layer of PmPV with and without\nDownloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject toMWCNTs \u0004Fig. 2 \u0001inset\u0002\u0005 provide direct evidence for the\npercolation of MWCNTs throughout the PmPV layer, since\ndevices incorporating MWCNTs are Ohmic. The reduction in\nseries resistance may therefore be attributed to a reduction in\nthe “average” distance over which positive charge carriers\n\u0001holes\u0002 formed at the organic heterojunction must traverse\nbefore extraction by the anode. While it is unlikely that all of\nthe holes formed at the organic heterojunction are extracted\nby MWCNTs, we suggest that geometrical field enhancement\nat the carbon nanotubes greatly increases the range over\nwhich positive charge carriers can be efficiently extracted by\neach MWCNT. The electric field enhancement factor in this\nconfiguration is estimated to be as great as five fold.16,17\nIn thin film \u0001\u0005100 nm\u0002 organic solar cells, charge carri-\ners formed at the organic heterojunction are extracted by the\nbuilt-in electric field and to a lesser extent the carrier con-\ncentration gradients. Consequently, a change in Jsc is indica-\ntive of a change in the electric field strength across the or-\nganic layers.18 When MWCNTs are incorporated into the\nPmPV layer, Jsc is reduced from 1.0 mA cm−2 in the refer-\nence cell to 0.8 mA cm−2 for MWCNT loadings of\n0.5–2 wt % within the PmPV layer.\nArguably the effect on the electric field strength of the\n50% reduction in the built-in potential in cells utilizing\nMWCNTs is almost offset by the effective reduction in the\nelectrode separation, since the MWCNTs extend throughout\nthe PmPV layer. However, Fig. 1 clearly shows that the den-\nsity of MWCNTs within the PmPV layer is very low. Con-\nsequently, the mean geometric reduction in the electrode\nseparation is very small. Such a small reduction in Jsc is\nevidence that the MWCNTs efficiently extract positive\ncharge carriers formed at the organic heterojunction. It is\nenergetically favorable for holes to be transferred from the\nhighest occupied molecular orbital of PmPV \u00015.8 eV\u0002 \u0001Ref.\n19\u0002 to the Fermi level of MWCNTs \u0001\u00034.6 eV\u0002, whereupon\nthey are extracted to the external circuit along the highly\nconductive MWCNTs. We suggest that geometrical field en-\nhancement at the sidewalls and tips of the MWCNTs also\ncontributes to efficient positive charge carrier extraction.\nPostfabrication annealing of bilayer organic solar cells\n20\nFIG. 2. Summary of Voc and FF of the bilayer heterojunction organic solar\ncell, ITO\/PEDOT:PSS\/PmPV\/C60\/Al, as a function of wt % MWCNTs\nwithin the PmPV layer, under 1 sun \u0001100 mW cm−2\u0002 simulated solar illumi-\nnation. The lines connecting the data points are included to guide the eye\nand have no physical meaning. Inset: I-V characteristics of single layer\ndiodes comprised of PmPV and PmPV with 1 wt % MWCNTs.can dramatically increase Jsc. This occurs because the mol- AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n133117-3 Miller, Hatton, and Silva Appl. Phys. Lett. 89, 133117 \u00022006\u0001ecules comprising each layer are sufficiently thermally agi-\ntated to interdiffuse, thereby increasing the heterojunction\narea. We have investigated the effect of annealing cells with\nand without 1 wt % MWCNTs within the donor layer. Com-\nplete cells were heated in an inert atmosphere to a peak tem-\nperature of 120 °C for 5 min. Typical current-voltage char-\nacteristics made in the dark and with 1 sun simulated solar\nillumination are shown in Fig. 3.\nFor cells with and without MWCNTs, the cell fill factors\nare increased to 0.48 and 0.32, respectively. The fill factor of\ncells incorporating 1 wt % MWCNTs within the PmPV layer\nremains 50% larger than that of the reference. Voc in the\nreference cell is increased by 0.15 V upon annealing, while\nthat of the MWCNT device remains unchanged at \u00030.4 V.\nIn cells with and without MWCNTs, Jsc is significantly in-\ncreased. Notably cells employing MWCNTs within the\nPmPV layer exhibit the greatest increase in Jsc and largest\nJsc. This result is further evidence that the MWCNTs effi-\nciently extract photogenerated positive charge carriers from\nwithin the device.\nThe power conversion efficiency of annealed cells utiliz-\ning MWCNTs within the PmPV layer remains lower than\nthat of the reference \u00010.37% and 0.5%, respectively\u0002. This is\nbecause of the very large Voc in the reference devices. In\norder to translate the large enhancement in cell fill factor and\nincrease in Jsc achieved by incorporating MWCNTs within\nthe PmPV layer into an improvement in power conversion\nefficiency, Voc must be increased. According to the MIM\nmodel increasing the MWCNT work function should result\nin a commensurate increase in Voc. To test this hypothesis the\nouter surface of pristine MWCNTs was acid oxidized, a\ntreatment which is known to increase the work function by\nas much as 0.8 eV.15 Unfortunately oxidized MWCNTs\ncould not be dispersed in PmPV, highlighting the need for\ncompatibility between the surface functionality and the con-\njugated polymer. To facilitate compatibility with PmPV\nwhile increasing the work function, MWCNTs were deriva-\ntized, via ester linkages, with the electron withdrawing func-\ntionality, pentadecafluoro-octanoyl chloride. Previous studies\nhave shown that monolayers of fluorinated alkanes co-\nvalently bonded to electrode surfaces increase the substrate\nFIG. 3. Typical current-voltage characteristics in the dark \u0001empty shapes\u0002\nand under 1 sun simulated solar illumination \u0001filled shapes\u0002 of the annealed\nreference, MWCNT, and functionalized MWCNT devices.Downloaded 30 Mar 2009 to 131.227.178.132. Redistribution subject towork function by increasing the surface potential.21\nMWCNTs functionalized in this way readily disperse in\nchloroform solutions of PmPV. Furthermore, when incorpo-\nrated into annealed cells a 0.21 V increase in Voc is achieved,\nconsistent with an increase in the MWCNT work function as\ncompared to pristine MWCNTs \u0001Fig. 3\u0002. This result is further\nevidence that MWCNTs function as an electrode in this con-\ntext. Crucially, this increase in Voc is achieved while retain-\ning a large FF \u00010.43\u0002, demonstrating the viability of this ap-\nproach. In this particular case the increase in Voc raises the\npower conversion efficiency to 0.46% which is comparable\nto that of the reference. However, efforts to identifying suit-\nable functionality to achieve a further increase in Voc are\ncurrently under way, which, based on the results of this\nstudy, is expected to translate the large increase in FF into a\nsignificant increase in power conversion efficiency.\nThe results of this study have demonstrated that\nMWCNTs have strong potential as an interpenetrating, hole-\nextracting electrode in organic solar cells. Chemically func-\ntionalizing the outer surface of MWCNTs with polar moi-\neties is shown to be an effective means of tuning Voc and the\nkey to realizing the ultimate goal of improved power conver-\nsion efficiency using this approach. Crucially, interpene-\ntrating MWCNT electrodes can be incorporated into the\ndevice structure without complicating the process of device\nfabrication.\nThe authors would like to thank the EPSRC for funding\nvia the Portfolio Partnership scheme.\n1S. E. Shaheen, D. S. Ginley, and G. E. Jabbour, Mater. Res. Bull. 30, 10\n\u00012005\u0002.\n2L. J. Rothberg, M. Yan, F. Papadimitrakopoulos, M. E. Galvin, E. W.\nKwock, and T. M. Miller, Synth. Met. 80, 1 \u00011996\u0002.\n3S. Heutz, P. Sullivan, B. M. Sanderson, S. M. Schultes, and T. S. Jones,\nSol. Energy Mater. Sol. Cells 83, 229 \u00012004\u0002.\n4C. J. Brabec, J. A. Hauch, P. Schilinsky, and C. Waldauf, Mater. Res. Bull.\n30, 50 \u00012005\u0002.\n5E. Kymakis, I. Alexandrou, and G. A. J. Amaratunga, J. Appl. Phys. 93,\n1764 \u00012003\u0002.\n6B. J. Landi, R. P. Raffaelle, S. L. Castro, and S. G. Bailey, Prog.\nPhotovoltaics 13, 165 \u00012005\u0002.\n7A. du Pasquier, H. E. Unalan, A. Kaneal, S. Miller, and M. Chhowalla,\nAppl. Phys. Lett. 87, 203511 \u00012005\u0002.\n8J. van de Lagematt, T. M. Barnes, G. Rumbles, S. E. Shaheen, T. J. Coutts,\nC. Weeks, I. Levitsky, J. Peltols, and P. Glatkowski, Appl. Phys. Lett. 88,\n233503 \u00012006\u0002.\n9M. W. Rowell, M. A. Topinka, M. D. McGehee, H. Prall, G. Dennler, N.\nS. Sariciftci, L. Hu, and G. Gruner, Appl. Phys. Lett. 88, 233506 \u00012006\u0002.\n10S. A. Curran, P. M. Ajayan, W. J. Blau, D. L. Carroll, J. N. Coleman, A.\nB. Dalton, A. P. Davey, A. Drury, B. McCarthy, S. Maier, and A.\nStrevens, Adv. Mater. \u0001Weinheim, Ger.\u0002 10, 1091 \u00011998\u0002.\n11B. Kilbride, J. Coleman, J. Fraysse, P. Fournet, M. Cadek, A. Drury, S.\nHutzler, S. Roth, and W. Blau, J. Appl. Phys. 92, 4024 \u00012002\u0002.\n12S. M. Sze, Physics of Semiconductor Devices \u0001Wiley, New York, 1981\u0002,\np. 553.\n13M. Shiraishi and M. Ata, Carbon 39, 1913 \u00012001\u0002.\n14O. Gröning, O. M. Küttel, C. Emmenegger, P. Gröning, and L. J. Schlap-\nbach, Vac. Sci. Technol. 18, 665 \u00012000\u0002.\n15H. Ago, T. Kugler, F. Cacialli, W. Salaneck, M. Shaffer, A. H. Windle, and\nR. H. J. Friend, J. Phys. Chem. B 103, 8116 \u00011999\u0002.\n16H. C. J. Miller, J. Appl. Phys. 38, 4501 \u00011967\u0002.\n17C. J. Edgecombe and U. Valdre, J. Microsc. 203, 188 \u00012000\u0002.\n18V. D. Mihailetchi, L. J. A. Koster, and P. W. M. Blom, Appl. Phys. Lett.\n85, 970 \u00012004\u0002.\n19D. O’Brien, A. Bleyer, D. G. Lidzey, and D. D. C. Bradley, J. Appl. Phys.\n82, 2662 \u00011997\u0002.\n20M. Drees, R. M. Davies, and J. R. Heflin, Phys. Rev. B 69, 165320\n\u00012004\u0002.\n21B. Choi, J. Rhee, and H. H. Lee, Appl. Phys. Lett. 79, 2109 \u00012001\u0002. AIP license or copyright; see http:\/\/apl.aip.org\/apl\/copyright.jsp\n"}