{"doi":"10.1016\/j.jseaes.2004.01.009","coreId":"65825","oai":"oai:dro.dur.ac.uk.OAI2:4572","identifiers":["oai:dro.dur.ac.uk.OAI2:4572","10.1016\/j.jseaes.2004.01.009"],"title":"Holocene sea-level changes in the Indo-Pacific.","authors":["Woodroffe,  S. A.","Horton,  B. P."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005-04-01","abstract":"Holocene sea-level reconstructions exist from many locations in the Indo-Pacific region. Despite being a large geographical region, the nature of Holocene sea-level change is broadly similar in all locations. Differences do exist, however, in the timing and magnitude of the Mid-Holocene High Stand (MHHS) and the nature of late Holocene sea level fall across the region. When the Indo-Pacific is subdivided into smaller regions, these discrepancies do not disappear, and in some cases the discrepancies are large within a single coastline.\\ud\n\\ud\nIt is clear from this analysis that the fundamental criteria to produce accurate local relative sea-level curves are hardly ever met. There are serious problems associated with the correct interpretation of sea-level indicators and their relationship to mean sea level, and with the quality of age determinations. A consistent methodology throughout the Indo-Pacific for the analysis of sea level data is lacking. Future sea-level analysis from far field locations must involve the application of a consistent methodology in order to allow meaningful comparison between studies. This should help to resolve the ongoing debate about the magnitude and timing of the Mid-Holocene High Stand, and the nature of late Holocene sea-level fall across the region","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/65825.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/4572\/1\/4572.pdf","pdfHashValue":"6e1a0debc132b489ac6c37a3b8bb7825930d79d0","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:4572<\/identifier><datestamp>\n      2011-09-07T10:54:08Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Holocene sea-level changes in the Indo-Pacific.<\/dc:title><dc:creator>\n        Woodroffe,  S. A.<\/dc:creator><dc:creator>\n        Horton,  B. P.<\/dc:creator><dc:description>\n        Holocene sea-level reconstructions exist from many locations in the Indo-Pacific region. Despite being a large geographical region, the nature of Holocene sea-level change is broadly similar in all locations. Differences do exist, however, in the timing and magnitude of the Mid-Holocene High Stand (MHHS) and the nature of late Holocene sea level fall across the region. When the Indo-Pacific is subdivided into smaller regions, these discrepancies do not disappear, and in some cases the discrepancies are large within a single coastline.\\ud\n\\ud\nIt is clear from this analysis that the fundamental criteria to produce accurate local relative sea-level curves are hardly ever met. There are serious problems associated with the correct interpretation of sea-level indicators and their relationship to mean sea level, and with the quality of age determinations. A consistent methodology throughout the Indo-Pacific for the analysis of sea level data is lacking. Future sea-level analysis from far field locations must involve the application of a consistent methodology in order to allow meaningful comparison between studies. This should help to resolve the ongoing debate about the magnitude and timing of the Mid-Holocene High Stand, and the nature of late Holocene sea-level fall across the region. <\/dc:description><dc:subject>\n        Holocene<\/dc:subject><dc:subject>\n         Relative sea level<\/dc:subject><dc:subject>\n         Steric expansion.<\/dc:subject><dc:publisher>\n        Elsevier<\/dc:publisher><dc:source>\n        Journal of Asian earth sciences, 2005, Vol.25(1), pp.29-43 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:4572<\/dc:identifier><dc:identifier>\n        issn:1367-9120<\/dc:identifier><dc:identifier>\n        doi:10.1016\/j.jseaes.2004.01.009<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4572\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1016\/j.jseaes.2004.01.009<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/4572\/1\/4572.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1367-9120","1367-9120"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Holocene","Relative sea level","Steric expansion."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n07 April 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nWoodroffe, S. A. and Horton, B. P. (2005) ’Holocene sea-level changes in the Indo-Pacific.’, Journal of Asian\nearth sciences., 25 (1). pp. 29-43.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1016\/j.jseaes.2004.01.009\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n 07 April 2008 \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n \nWoodroffe, S. A. and Horton, B. P. (2005) 'Holocene sea-level changes in the Indo-\nPacific.' , Journal of Asian earth sciences., 25 (1), pp. 29-43. \n \nThe attached paper is the final author-created version of the above publication, and \nincorporates referee comments.  \n \nThe definitive version is available at:  \n \nhttp:\/\/dx.doi.org\/10.1016\/j.jseaes.2004.01.009 \n \n  \n1\n1\nHolocene sea-level changes in the Indo-Pacific \nS. A. WOODROFFE*. Environmental Research Centre, Department of Geography, University of \nDurham, South Road, Durham, DH1 3LE, UK. Tel: 0191 334 1860  Fax: 0191 334 1801. E-mail: \ns.a.woodroffe@durham.ac.uk. \n \nB. P. HORTON. Environmental Research Centre, Department of Geography, University of \nDurham, South Road, Durham, DH1 3LE, UK.  \n* - Correspondent \nAbstract \nHolocene sea-level reconstructions exist from many locations in the Indo-Pacific region.  Despite \nbeing a large geographical region, the nature of Holocene sea-level change is broadly similar in all \nlocations.  Differences do exist however, in the timing and magnitude of the Mid-Holocene High \nStand (MHHS) and the nature of late Holocene sea level fall across the region.  When the Indo-\nPacific is subdivided into smaller regions, these discrepancies do not disappear, and in some \ncases the discrepancies are large within a single coastline. \nIt is clear from this analysis that the fundamental criteria to produce accurate local relative sea-\nlevel curves are hardly ever met. There are serious problems associated with the correct \ninterpretation of sea-level indicators and their relationship to mean sea level, and with the quality of \nage determinations.  A consistent methodology throughout the Indo-Pacific for the analysis of sea \nlevel data is lacking.  Future sea-level analysis from far field locations must involve the application \nof a consistent methodology in order to allow meaningful comparison between studies.  This \nshould help to resolve the ongoing debate about the magnitude and timing of the Mid-Holocene \nHigh Stand, and the nature of late Holocene sea-level fall across the region. \n \n \n \n \n \n \n  \n2\n2\n \n1. Introduction \nOscillations between glacial and interglacial climate conditions during the Quaternary have been \ncharacterized by the transfer of immense volumes of water between ice sheets and the oceans \n(e.g., Broecker and Denton, 1989; Alley and Clark, 1999; McManus et al., 1999; Lambeck et al., \n2002). Since the latest of these oscillations, the Last Glacial Maximum (between about 30,000 and \n19,000 years ago), approximately 50 x106 km3 of ice has melted from the land-based ice sheets, \nraising global sea level in regions distant from the major glaciation centres (far-field locations) by \nabout 130 metres (Fig 1) (e.g. Lambeck et al., 2002). In contrast, relative sea levels have dropped \nby many hundreds of metres in regions once covered by the major ice sheets (near- and \nintermediate-field locations) as a consequence of the isostatic ‘rebound' of the solid Earth following \nthe melting of land-based ice (Shennan and Horton, 2002). Such rapid changes in sea level are \npart of a complex pattern of interactions among the oceans, ice sheets and solid earth, all of which \nhave different response timescales. Geographical variability in Holocene sea-level change is well \nillustrated by Pirazzoli’s (1991) atlas of sea-level curves and by geophysical model predictions \n(e.g., Clark et al., 1978; Peltier, 2002; Shennan, et al., 2002; Lambeck et al., 2003; Mitrovicia, \n2003). Clark et al. (1978) identified six different sea-level patterns which reflect a range of sea-\nlevel histories recorded at coasts which have emerged, submerged, or are in transitional areas and \nrecord a combination of both uplift and subsidence (Fig 2). Although much contemporary research \n(e.g., Shennan and Horton, 2002) to test such theoretically derived models has focused on data \nsets from near- and intermediate-field locations (Zones I –II), it is widely recognised that ‘far-field \nlocations’ (Zones III – VI) provide the best possible estimate of the ‘eustatic function’ (Clark et al., \n1978; Yokoyama et al., 2000; Peltier, 2002). Consequently, model derived reconstructions are \nincreasingly recognising the importance of these areas to constrain and test their earth-ice models \n(eg. Fleming et al. 1998).  \n2. Past sea-level changes \nAt their simplest changes in relative sea level (RSL) are a product of changes in oceanic and crustal \nvariables.   A change in relative sea level at any time or location is dependent upon a combination of \nsea surface level changes, any isostatic or tectonic changes, and local coastal processes. \nThe ocean, or eustatic level is influenced by three main groups of factors; the water volume in the \noceans; the volume of the ocean basins; and the distribution of the water. The water in the ocean \nand the volume of glacial ice on land are in balance; when one increases the other decreases. \nThis is known as glacial eustasy (first proposed by Suess, 1888). The ocean volume is also \nmodulated by a number of other factors, such as the addition of juvenile water, storage of water in \n  \n3\n3\nsediments, variations in the main hydrologic cycle changing continental lake volumes, cloudiness, \nand the evaporation\/precipitation balance. A factor of high significance is the steric \nexpansion\/contraction of the water column. These changes are driven by temperature and, to a \nlesser degree, salinity. Steric changes are advocated as one of the most important factors in future \nsea-level estimates (e.g., Houghton, 2001). The basins of the oceans may change their level by \ncrustal movements so that they increase and decrease in total volume. This is tectono-eustasy.  In \nreality, this is merely deformation of the hypsographic curve, and is a slow process, which may \nonly change sea level by 0.06 mm yr-1 (Mörner, 1996).  \nThe ocean water level also changes as the result of the global distribution of oceanic water. This is \nknown as geoidal eustasy (Mörner, 1976). The earth is not spherical, but broadly flattened at the \npoles and bulging at the equator and the ocean surface does not parallel that of the earth.  Present \ngeodetic sea level varies with respect to the earths centre by as much as 180 m.  The geoid relief \ndoes not remain stable with time; it deforms vertically as well as horizontally. During the Last \nGlacial Maximum, the weight of continental ice sheets caused downward deformation of the crust, \nforcing sublithospheric flow away from the centres of load.  A low latitude gravitational anomaly \ndeveloped creating a high in the oceanic geoid.  During the last glacial deglaciation, the continents \nviscoelastically rebounded causing the gravity anomaly to decay and the oceanic geoid to migrate \nfrom lower to higher latitudes.  This geoidal process is called equatorial ocean syphoning \n(Mitrovica and Peltier, 1991).  The relative sea level (RSL) effects of equatorial ocean syphoning \nare only seen in the late Holocene (last 3000 years), where in low latitudes oceanic islands such \nas the Cocos Keeling Islands have experienced a fall in RSL (Woodroffe and McLean 1990).   \n \nGlobal glacial isostatic adjustment is the process whereby the Earth's shape and gravitational field \nare modified in response to the large scale changes in surface mass load that have occurred due \nto the glaciation and deglaciation of the planetary surface (according to Archimedes principle). As \nshown by Daly (1934), the development of an ice sheet will result in subsidence beneath the ice \nmass (glacio isostasy), when deeper material flows away and a peripheral bulge is built around the \nice margin. When the ice sheet melts, unloading occurs, resulting in uplift beneath the melted ice \nat rates which may locally reach 50 to 100 mm yr-1 (Pirazzoli, 2000); the marginal rim will \nconsequently tend to subside and move towards the centre of the vanishing load.  Furthermore, \nduring deglaciation meltwater from the ice sheets produces a considerable load (of the order of \n100 t m2 for a sea-level rise of 100 m (Lambeck et al. 2002)) on the ocean floors so that the sea \nfloor subsides (hydro-isostasy). Interest in studying the response of the planet to these Quaternary \nglacial cycles derives primarily from the fact that the geological, geophysical and astronomical data \nwhich record them are of such high quality. Furthermore, these data are almost uniquely capable \nof providing firm constraints upon the viscoelastic properties of the \"solid\" interior of the earth and \n  \n4\n4\na wide range of processes related to the internal dynamics of the climate system itself (e.g., \nAgassiz, 1840; Lambeck, et al., 2000; Peltier, 2002; Shennan et al., 2002; Mitrovica, 2003). While \nmost studies agree on the viscosity structure through the upper mantle and transition zone, there \nis considerable controversy about the average viscosity structure of the lower mantle.  This is \nimportant in modelling the inundation of water into regions uncovered by grounded, retreating \nmarine-based ice and ocean loading at evolving continental margins (e.g., Peltier, 1998; Mitrovica \nand Milne, 2002; Peltier, 2002; Mitrovicia, 2003 Lambeck et al., 2003).  \n \nAlthough the interaction of eustatic and isostatic factors produces the general pattern of RSL \nchanges, various factors operate at the coast and within an estuary that influence the registration \nof relative sea-level changes in the fossil, sedimentary record (Shennan and Horton, 2002). In \ntectonically active areas neotectonic deformation is common and may be due to stresses \nassociated with the isostatic processes, but also due to compression, gliding, elastic rebound, \nfaulting, folding or tilting of crustal blocks. Trends of vertical displacement of tectonic origin often \nappear to be continuous and gradual over time (Pirazzoli 1996), but frequently consist of \nspasmodic movement, often suddenly at the time of earthquakes of great magnitude (eg. Zong et \nal. 2003). Other local scale factors include modifications in the tidal regime according to the \ncoastal configuration and the relationship between the freshwater table and tide levels; (Shennan \nand Horton (2002) observe a change in the elevation of MHWST in relation to MTL through the mid \nto late Holocene in the Humber estuary, UK).  Furthermore, changes in elevation of the sediment \nrecording a past sea level since the time of deposition must be taken into account.  These changes \nmay be due to consolidation because of the accumulation of overlying sediments and land \ndrainage.  \n3. Interpretation of former sea-levels  \nPalaeo sea-levels are reconstructed from a wide variety of environmental indicators including \nmorphological and archaeological data, palaeosols and other lithostratigraphic change. To produce \nsea-level index points, which allow the construction of a sea-level envelope plotted in a time\/depth-\nelevation graph, each indicator must have an indicative meaning (Fig 3). The indicative meaning of \na coastal sample is the relationship of the local environment in which it accumulated to a \ncontemporaneous reference tide level, with an associated error range (van de Plassche, 1986, \nHorton et al. 2000). The indicative meaning can vary according to the type of evidence and it is \ncommonly expressed in terms of an indicative range and a reference water level. The former is a \nvertical range within which the coastal sample can occur and the latter a water level to which the \nassemblage is assigned, for example, mean high water spring tide, mean tide level, etc.  \n  \n  \n5\n5\nBy far the most widely used sea-level indicators in far-field locations are coral. There are many \ndifferent types of coral, but only a few species are found in narrow elevation ranges (e.g., Acropora \npalmata, which lives within 5 m of the water surface (Lighty 1982) and Porites sp. which can live \nnear the surface and at depths up to 30 m (Done 1982)).   Corals in growth position are \nconstrained by water depth, and most are only able to survive up to mean low water spring tides in \nunponded locations. They are readily dated using Uranium series disequilibrium and radiocarbon \ntechniques. Unfortunately the lower depth limit of Acropora growth is relatively poorly constrained, \nleaving coral-based sea-level indicators with a large indicative range (c. ±5 m) (Blanchon and \nShaw 1995).  Microatolls are a particular type of intertidal coral that live near low water and have \nan indicative range as low as 3 cm (e.g., Smithers and Woodroffe, 2000). They are seen as the \nmost precise, geologically persistent and useful diagnostic sea-level indicator on coral reef \nsystems.  \n \nOther widely used sea-level indicators include geomorphological features, such as palaeoshoreline \nnotches, palaeoreef flats and beach deposits (e.g., Tija, 1996, Dickinson, 2001). These indicators \nhave wide indicative ranges, and large error terms associated with any reconstructions. Thus, for \ndetailed Holocene sea-level reconstructions it is often the case that the error term applied to the \nsea-level indicator has the same magnitude as the RSL change under investigation. Fixed \nbiological indicators are also used as sea-level indicators. These include rock clinging oyster beds \nand fossil calcareous tubeworm encrustations  (e.g., Baker and Haworth, 2000).  \n \nWith notable exceptions (eg. Cann et al. 1993, 2000a, 2000b, 2002, Li et al. 2000, Yokoyama et \nal., 2000), studies of microfossils and their relationship to RSL in far-field coastal environments of \nthe Indo-Pacific are few.  In contrast, many detailed studies of former sea levels in Northwest \nEurope and North America have used microfossils (e.g. diatoms, foraminifera, pollen) found within \nlate and post-glacial sedimentary deposits (e.g., Horton et al., 2000; Shennan and Horton, 2002). \nOne of the few studies of sedimentary facies depicting late glacial and Holocene sea-level \nchanges in a far-field location have been undertaken by Yokoyama et al. (2000) in the Bonaparte \nGulf, northern Australia. They used sediment cores and their contained foraminifera and ostracods \nto infer changing environments of deposition through time, enabling sea-level reconstructions back \nto the last glacial maximum. Despite using tightly constrained foraminifera and ostracoda \nevidence, the reconstructions based on facies descriptions such as ‘shallow marine’ and ‘marginal \nmarine’ have relatively wide indicative ranges (c. ± 1 m).  \n  \n6\n6\n4. The late glacial and post-glacial period \nIt is widely implied that far-field locations have a spatially homogenous record of sea-level \nfluctuations. However, several diverse processes, such as gravitational effects causing \nmovements in the geoid and meltwater loading of the ocean floors, tectonism, thermal expansion \nof ocean water and Antarctic mass balance changes, interplay with the overwhelming eustatic \nsignal to create the relative sea-level record in far-field locations. Nevertheless, a small number of \nhigh-resolution RSL records have been used to approximate the Holocene glacio-eustatic signal \n(e.g., Fairbanks, 1989; Chappell and Polach, 1991; Blanchon and Shaw, 1995; Bard et al., 1996; \nYokoyama et al., 2000). In turn these records have been used in geophysical models to estimate \nthe ice mass at the last glacial maximum and to tune models of earth rheology. The first global \neustatic sea-level curve was generated from cored corals (Acropora palmata) in Barbados \n(Fairbanks, 1989). This record concentrates on the late glacial and early Holocene period, creating \na eustatic record for the period 17,100 to 7800 BP. Unfortunately Barbados is situated on an \naccretionary prism between two oceanic plates, and therefore is not immune to problems of \ntectonic lithospheric movement over late glacial timescales (estimated uplift of 0.34 mm yr-1). The \nmajor breakthrough of work in the Caribbean\/Atlantic region on both cored coral and sediment \ncores was the discovery of three ‘catastrophic rise events’, or Meltwater Pulses (MWPs), between \n14,200 and 7600 cal years BP.  The largest rise (approximate magnitude of 13.5 m) occurred at \n14,200 cal years BP (MWP 1a).  This coincides with a period of ice sheet collapse (Heinrich layer \n1) as defined in sediment cores from the north Atlantic, and predates the Younger Dryas cold \nevent by about 1000 years (Fig 4).  However, no consensus on the source of the ice melt has been \nreached, with contributions from North America, Scandinavia and the Barents Sea, and Antarctica \nhaving been proposed (Blanchon and Shaw, 1995; Clark, 1996; Clark et al., 2002).  \n \nFollowing this breakthrough in late glacial eustatic sea-level reconstruction, a coral coring project \nin Tahiti (Bard et al., 1996) produced a late glacial and early Holocene eustatic sea-level curve, \nwhich complements the record from Barbados. The Tahiti record has the advantage of not being \ncontaminated by a complex tectonic component, being an oceanic atoll situated in the centre of the \nPacific plate. However, Tahiti exists because of volcanic and tectonic activity in the past and is \nsubsiding at a rate of 0.2 mm yr-1 (Bard et al., 1996). This new record shows a synchronous hiatus \n(MWP1a) with the Barbados record. However, the Tahiti record questions the global significance of \nthe two other catastrophic rise events, MWP 1b at 11, 500 cal BP and MWP 2 at 7600 cal BP, both \nfound in the Caribbean\/north Atlantic records (Blanchon and Shaw 1995). \n \nA third global late glacial and early Holocene eustatic record has been inferred from raised coral \nterraces on the Huon Peninsula, Papua New Guinea (Chappell and Polach, 1991). The Huon \n  \n7\n7\nPeninsula is tectonically active, being close to the edge of the Philippine plate, and is \nexperiencing uplift at a rate of ~1.9 mm yr-1.  By decoupling the tectonic and eustatic elements of \nRSL history in the area, a global eustatic sea-level curve has been developed. However, aseismic \nuplift on the Huon Peninsula is episodic, dominated by isolated, metre scale events with 1000 year \nreoccurrence intervals, which contaminates the record with a complex tectonic component.  \n \nThe nature of mid to late Holocene global eustatic sea-level change is less well documented. \nIndeed Nunn (1998) refers to the last millennium as a ‘1000-year hiatus’ in sea-level research of \nthe Pacific (Long, 2000). Emphasis switches from aiming to produce a globally valid eustatic sea-\nlevel curve to understanding local and regional influences on RSL reconstructions. Therefore, for \nthe purposes of this review we have split the Indo-Pacific into six sub-regions; Southwest Indian \nOcean, Northern Indian Ocean, Southeast Asia, Northern Asia, Australia and Pacific Ocean (Fig 5 \nand Table 1). \n4.1 Southwest Indian Ocean  \nThe southwest Indian Ocean includes the continental coastline of southeast Africa, the micro \ncontinent of Madagascar, and several oceanic atolls including Mayotte, Reunion, Mauritius and the \nSeychelles. Field observations in these locations have utilized a range of geomorphological and \nbiological indicators including beachrock, oyster beds, coral reefs and marine shells to reconstruct \nmid to late Holocene changes in RSL (e.g., Ramsay, 1995; Colonna et al., 1996; Camoin et al., \n1997; Compton, 2001; Ramsay and Cooper, 2002). The southwest Indian Ocean is tectonically \nstable, being situated towards the centre of the African plate and, therefore, observations from \nthese locations should yield important information regarding glacio-eustasy and hydro-isostasy. \nStudies of Holocene sea-level change in South Africa have relied mainly on radiocarbon dating of \nfossil beachrock. Beachrock is a reliable sea-level indicator, assuming that the skeletal carbonate \ncontent is entirely contemporary. It forms today at the freshwater\/saltwater interface at 0.1 - 0.2 m \nbelow mean sea level (Ramsay and Cooper, 2002). Ramsay (1995) produced a 9000 year record \nshowing early Holocene RSL rise to a mid-Holocene high stand of +3.5 m at 4650 14C yrs BP with \nRSL subsequently falling below present levels, but also shows a secondary high stand at 1610 14C \nyrs BP (+ 1.5 m) before mean sea level is attained at 900 14C yrs BP. The sea-level observations \nare taken from a 180 km long stretch of coastline in eastern South Africa, thus reflecting regional \nRSL influences. However, the sea-level index points are not corrected for their indicative meaning. \nFor example, some index points from the early Holocene use dated wood, which should be treated \nas limiting points, that is RSL must have been at or below the level at which they are found, \nhowever they are included in the curve as standard index points. A second investigation in South \nAfrica has concentrated on a saltmarsh lagoon on the southwest coast (Compton, 2001). This \n  \n8\n8\nlagoon is situated on the Atlantic coast, where tectonic activity has occurred through the \nHolocene, and the RSL history reflects more Atlantic rather than Indian Ocean processes. The \nRSL record, derived from radiocarbon dated saltmarsh peats, agrees with Ramsay’s two mid-late \nHolocene high stands theory, and uses potentially more precise indicators (Fig 6). However, the \nindicative meaning of each indicator is not explicitly stated and all late Holocene sea-level \nfluctuations after the initial mid-Holocene peak of +3 m are within the elevation ranges of the \nindicators.  \n \nHolocene sea-level changes on the oceanic atolls of Mauritius, Reunion and Mayotte have been \ninvestigated to infer reef development histories and eustatic sea-level rise (e.g., Colonna et al., \n1996; Camoin et al., 1997). Drilled Acropora coral cores from the fringing reefs of all 3 islands \ndemonstrate a continuous rise in eustatic sea level through the early and mid Holocene, stabilizing \nto current levels at 3000 14C yrs BP. There is no evidence of two Holocene high stands in these \nlocations. However, on the microcontinent of Madagascar, in situ coral colonies have been dated \nbetween 3000 and 2000 14C yrs BP, 0.3 - 2.5 m above RSL, and at Farqhar Atoll in the Seychelles, \ncoral limestones have been dated at 3640 14C yrs BP at +2 m (Camoin et al., 1997). This apparent \ndiversity in the record may be due to the nature of these small oceanic atolls, which are affected by \nlate-Holocene hydro-isostasy, causing them to react to eustatic sea-level change in the same way \nas the ocean floor. That is, they subside with the ocean floor, whereas sublithospheric flow below \nthe sea floor is drawn to larger atolls and land masses (e.g., Seychelles, Madagascar, Africa) \n(Grossman et al., 1997).  Larger land masses record a drop in RSL through the late Holocene \nwhile small oceanic atolls experience continued sea-level rise.  \n4.2 Northern Indian Ocean \nThe northern Indian Ocean region includes studies from the east coast of India, Bangladesh and \nSri Lanka (Katupotha and Fujiwara, 1988; Islam and Tooley, 1999; Banjeree, 2000). The Indian \nsub-continent is situated on the Indian plate, which in its centre is tectonically stable. Techniques \nused to reconstruct former sea levels here include dating coral and marine shells, beach ridges \nand sedimentary sequences and their contained microfossils. Banjeree (2000) studied regional \nRSL change on the east Indian coastline, utilizing beach ridges and exposed Porites coral colonies \nto indicate two mid-late Holocene high stands, the first peaking at 3 m above current mean sea-\nlevel at 7300 cal yrs BP, followed by a c. 2 m RSL fall, and a second pulse of minor RSL rise \nculminating at +3 m between 4300 and 2500 cal yrs BP. This study analyses evidence from sites \ncovering over 150 km of coastline and, therefore, has a regional focus. The indicative meanings of \nthese records are not explicitly taken into consideration when creating sea-level index points, and \nthe contemporary reference level to which all fossil deposits are calibrated is low tide level rather \n  \n9\n9\nthan mean sea level, which precludes correlation with other studies unless the index points are \nre-calibrated.  \n \nField data from Bangladesh using multi-proxy lithostratigraphical and biostratigraphical techniques \n(Islam and Tooley, 1999) shows a continuously rising RSL record through the Holocene. The field \nsite in Bangladesh is situated on low-lying deltaic deposits, which are susceptible to long term \nsubsidence, release of sediment and water from the catchment and anthropogenic activities. \n \n4.3 Southeast Asia \nThis diverse region includes studies from the Strait of Malacca, Indonesia (Geyh and Kudrass; \n1979), Malay-Thai Peninsula (Tija, 1996), Phuket, southeast Thailand (Scoffin and Le Tissier, \n1998), Sunda Shelf (Hanebuth et al., 2001) and the Huon Peninsula, Papua New Guinea \n(Chappell and Polach 1991). The Indonesian archipelago and its surrounding microcontinents \n(Papua New Guinea, Borneo, Peninsula Malaysia) have been subject to intense tectonic \nprocesses over the Holocene period. The region is a collision zone between the Eurasian, Indian, \nPhilippine and Pacific plates and includes the active subduction zone and island arc of the Java \ntrench, which covers a large part of southern Indonesia.  \n \nHolocene sea-level reconstructions in southeast Asia are limited and fragmentary. Tija (1996) \nstudied abrasion platforms, sea-level notches and oyster beds in Peninsula Malaysia and \nproduced over 130 radiocarbon-dated indicators. The sea-level curve, which proposes two \nHolocene high stands at 5000 and 2800 14C yrs BP, does not take into account the broad \naltitudinal range of the indicators, and the second high stand could easily be accounted for by error \nterms in the general RSL drop after 5000 BP (Fig 7). Tija’s (1996) sea-level reconstruction for \nThailand, based mainly on peat, marine shells and mangrove wood, indicates potentially three \nmid\/late Holocene high stands at 6000, 4000 and 2700 14C yrs BP, which he attributes to sea level \nlowering in a series of short periods of regression and transgression. Over 100 indicators were \ntaken from around the Peninsula Coast, therefore reflecting regional rather than local influences; \nhowever it is hard to reconcile this model of sea-level history with the scattered evidence that is \npresented. Scoffin and Le Tissier (1998) studied intertidal reef-flat corals (microatolls) for mid\/late \nHolocene high stands at Phuket, Southern Thailand. The evidence here suggests a single \nHolocene high stand with a constant rate of RSL fall since 6000 cal yrs BP, and thus, contradicts \nconclusions drawn by Tija (1996). However it should be noted that Scoffin and Le Tissier’s (1998) \nresearch is from only one site with eleven dated samples.  \nGeyh and Kudrass (1979) conducted a study in the Strait of Malacca, Indonesia, which resulted in \n33 directional (limiting) index points from 14C dated fossil mangrove deposits.  These index points, \n  \n10\n10\nwhich are not given an indicative meaning, imply that Holocene sea level rose from below –12.8 \nm to ~1.2 m above present between 8000 and 6000 14C yrs BP, and between 5000 and 4000 14C \nyrs BP rose to its highest recorded level in southeast Asia, at ~5.8 m above present (but this is a \nlimiting index point, uncorrected for indicative meaning). The data does not show whether the late \nHolocene lowering of sea level was a steady or oscillatory process.  \n \nThe Cocos Keeling Islands are a mid-oceanic atoll situated approximately 600km southwest of \nJakarta, Indonesia in the Indian Ocean. Their RSL history is recorded in massive coral and \nmicroatolls.  The microfossil record produces a detailed late Holocene RSL history showing a \nsingle Holocene high stand after 3000 14C yrs BP of at least 0.5 m (Woodroffe and McLean, 1990).  \n4.4 Northern Asia \nThe areas grouped under this heading include Japan and southeast China, bordering the South \nChina Sea. Japan is forms part of a tectonically active island arc, which makes regional sea-level \ncomparisons difficult due to local and regional crustal flexure and warping. Nakada et al. (1991) \nundertook RSL reconstructions from Osaka and Tokyo using previously published data and \nshowed a significant spatial dependence to the amplitude of the mid-Holocene high stand. Fixed \nbiological indicators (oyster beds) have been used at one site on the South China Sea coast to \ninfer the amplitude and timing of the mid-Holocene high stand; no greater than 2 m above modern \nsea level at 5140 14C yrs BP (Yim and Huang, 2002). Further research using fixed biological \nindicators is needed from other locations of the coastline in order to constrain the amplitude of the \nmid-Holocene high stand and to better understand the effect of monsoon forcing on the RSL \nrecord. \n \n4.5 Australia \nAustralia is a tectonically stable continent far from plate margins, situated at the centre of the \nAustralian-Indian plate, and as such should preserve a sea level record dominated by eustatic \nprocesses.  Fixed biological indicators such as tubeworms, oyster beds, barnacles and corals have \nbeen used extensively along the east coast of Australia to infer Holocene sea-level movements \n(e.g., Beaman et al., 1994, Baker and Haworth, 2000, Baker et al., 2001), and foraminifera have \nbeen used to infer relative estuarine\/lagoonal and oceanic influences through the Holocene in the \nestuaries of South Australia (Cann et al. 1993, 2000a, 2000b, 2002). In the Northern Spencer Gulf \nthe highest Holocene sea levels occurred at 7000 cal years BP, followed by continuous RSL fall \nthrough the late Holocene (Cann et al. 2000a).  Studies from north New South Wales show a late \nHolocene high stand at +1.7 m at 3810 cal yrs BP (Baker et al., 2001).  However, evidence for the \n  \n11\n11\nmid-Holocene high stand in northeast Australia is much earlier, at 1.65 m above RSL between \n5660-4040 14C yrs BP in Cleveland Bay, central Great Barrier Reef (Beaman et al., 1994). \n \nThe eastern coast of Australia is affected by differential crustal flexure over late Holocene \ntimescales due to differences in the width of continental shelf and its impact on hydro-isostatic \nadjustment (Flood and Frankel, 1989; Baker et al., 2001). This affects the timing of the mid-\nHolocene high stand along the eastern Australian coast.  Fig 8 illustrates that by fitting a \npolynomial trendline through sea-level index points created from fixed biological indicators (Baker \net al. 2001) it is possible to draw the conclusion that two mid\/late-Holocene high stands have \noccurred in this region, if age and altitude errors in the reconstructions are not taken into account.   \nHowever there is little justification for choosing an episodic late Holocene sea level trend using \nmathematical modelling which does not incorporate the range of potential values for each \nage\/altitude index point. \nLarcombe et al. (1995) and Larcombe and Carter (1998) present evidence for an episodic early \nHolocene marine transgression across the central Great Barrier Reef shelf.  The most contentious \naspect is the evidence for a stillstand at –10 m at 8500 14C years BP, followed by a rapid fall in \nRSL to –17 m at 8200 14C years BP, and then a rapid rise in RSL to –5 m by 7800 14C years BP.     \n \nThe database used to infer this sea-level trend incorporates evidence from a wide range of studies \nover a period of 25 years, by different researchers using different proxy indicators.  The database \nmakes no attempt to reclassify indicators for the inferred sea-level position at the time the indicator \nwas lain down.  Indicators from a wide geographical area (4 degrees of latitude) are included in a \nsingle reconstruction, which would infer that differential crustal movement has not occurred over \nthis wide area during the Holocene.  Evidence from other studies (Hopley 1975, Chappell et al. \n1983) show that up to 3 m of differential movement has occurred along this coastline over the past \n6000 years.    \n4.6 Pacific Ocean \nThe Holocene RSL history of the Pacific Ocean basin is of prime importance for furthering our \nunderstanding of geoidal-eustasy, in particular Equatorial Ocean syphoning. A plethora of studies \nhave emerged in recent years from the oceanic atolls of the Pacific, most noticeably the Tahiti \ncoral record (Bard et al., 1996), and studies from Fiji, Kiribati, French Polynesia, Hawaii, Tonga, \nMarshall Islands and others (e.g., Grossman et al., 1998, Nunn and Peltier 2001). The vast \nmajority of sea-level index points from the Pacific use massive coral species (Acropora and \nPorites), coral microatolls or beachrock as indicators, which each have their own limitations. In \naddition many, if not all, of the oceanic atolls of the Pacific are subject to tectonic movements over \n  \n12\n12\nHolocene and even longer timescales. Many studies assume stability over the Holocene, \nwhereas in fact slow, constant subsidence may be occurring. Mid\/late Holocene sea-level records \nfrom the Pacific have been interpreted as evidence for a migrating geoid, through evidence of \ngreater emergence in the central ocean basin interior during the mid\/late Holocene, and most \nsignificant and recent RSL fall in the central equatorial Pacific (Mitrovica and Peltier, 1991, Nunn \nand Peltier, 2001). In addition sea-level observations indicate that oceanic atolls less than 10 km in \ndiameter are affected by hydro isostasy (Grossman et al., 1997).  \n5. Discussion \nThis review has illustrated the geographical variability of RSL reconstructions, and the variable \nquality of reconstructions across the Indo-Pacific region.  It has also shown that evidence for the \nmid-Holocene high stand is variable in both magnitude and timing across the Indo-Pacific.   In \nseveral locations limited evidence points towards a second, smaller magnitude high stand in the \nlate Holocene (Table 1).  \nField observations of mid-Holocene high stands provide essential constraints to geophysical \nmodels because model predictions of these high stands depend upon three large-scale, high \namplitude, globally applicable mechanisms: ocean syphoning caused mainly by gravitational \neffects due to the collapse of peripheral forebulges, continental levering associated with local \nocean loading, and on-going melting of global ice since the time of the high stand (magnitude and \nsource). The first two mechanisms occur throughout the deglaciation process, with the mid-\nHolocene high stand marking a point in time when the eustatic signal reduces in magnitude so that \nthese solid earth processes become apparent in the RSL record. Syphoning and continental \nlevering are dependant on the viscosity structure and, thus, contribute to the sensitivity of different \nmodels. Since syphoning produces a more geographically uniform sea-level fall than the \ncontinental levering effect, the latter is likely to account for most of the site dependent variations of \npredicted high stands. Differences between sea-level observations and predicted high stand \namplitudes are used to estimate the final mechanism; on-going melting of global ice since the time \nof the high stand (Mitrovica and Peltier 1991, Peltier, 2002, Mitrovica and Milne 2002). If the \nobservations are measured precisely, they may provide constraints on where the meltwater came \nfrom (northern or southern hemisphere), or at least the relative magnitudes. \n \nGrossman et al. (1997) propose that a second, short-lived marine transgression in low and mid \nlatitudes in the late Holocene may be due to the migration of the geoid.  The behaviour of the \nmigrating geoid might be as a series of oscillating waves flowing from its maximum position in the \ncentral ocean basin interior (the central equitorial Pacific), rather than as migration as a single \npeak.  Low and mid latitudes might experience a slight, short-lived transgression and regression \n  \n13\n13\ndue to the interplay between geoidal eustasy and hydro isostasy during the late Holocene period \nwhen glacio-eustasy has ceased.  In addition, Grossman et al. (1997) suggest that the geoidal \nanomoly may decay in the Pacific towards the Asian continent, directing a second transgression to \nthis area only.  This would fit with the evidence, which suggests that two Holocene high stands are \nonly witnessed in areas of the Indo Pacific far from the central equitorial Pacific.  However this may \njust be a coincidence considering the poor quality of the empirical data. \n \nThis review of far field locations has raised the issue that the fundamental criteria to produce an \naccurate Holocene sea-level curve are hardly ever met. The accuracy or significance of each curve \ndepends upon the number of sea level index points, the correct interpretation of its relation to the \ncorresponding mean sea level, and the quality of age determinations. There are serious problems \nassociated with the correct interpretation of the elevational relationship of the sea-level indicators \nto mean sea level. Different types of indicators have different degrees of precision, but this is often \nnot acknowledged. Coral microatolls in some settings have a much higher degree of precision than \nother species such as Porites or Acropora, which have wide elevational ranges, but each study is \nconsidered accurate to the same level. Elevation error ranges are rarely included on sea-level \ncurves. The indicative meaning and reference water level of each indicator is sometimes \naccounted for, sometimes not. Different workers assign different indicative meanings to the same \nindicator. It is common to use low tide level as a common datum rather than mean tide level, but \nthis is not often stated in reports, precluding regional correlation of different studies. \nThe second serious form of error regards age determinations, in particular the calibration of \nradiocarbon dates, a necessary process because the assumption that the specific activity of the \n14C in the atmospheric carbon dioxide has been constant is invalid. The 14C activity in the \natmosphere and other reservoirs, and thus in the initial activity of the samples dated, has varied \nover time (e.g., Stuiver et al., 1998). A calibration dataset is necessary to convert conventional \nradiocarbon ages (14C yr) into calibrated years (cal yr). However, many researchers do not \ncalibrate their radiocarbon dates, or fail to state in their publications whether they have or not. If \nages are calibrated, different researchers use different calibration programs, which use alternative \ncalibration terms and produce different results. Similar uncertainties are found with the application \nof the Marine Reservoir Effect. Radiocarbon ages of samples formed in the ocean, such as shells, \nfish, marine mammals etc., are generally several hundred years older than their terrestrial \ncounterparts. This apparent age difference is due to the large carbon reservoir of the oceans. A \ncorrection is necessary in order to compare marine and terrestrial samples, but because of \ncomplexities in ocean circulation the actual correction varies with location.  \n \n  \n14\n14\n6.  Conclusion \nThus, further sea-level analysis from far field locations must involve the application of the \nconsistent methodology to the reconstruction of sea-level history, which was first formalised during \nInternational Geological Correlation Programme (IGCP) Project 61. This operated in the period \n1979-1983, and has been a component of all subsequent IGCP Projects, especially Projects 200, \n274, 367 and 437 (e.g., van de Plassche, 1986; Shennan and Horton, 2002), however this review \nhas shown serious failings in its application. A new generation of sea-level records from far field \nlocations will improve our understanding of the driving mechanisms behind Holocene sea-level \nchange and coastal evolution over a range of spatial and temporal scales. This sea-level data \ncould be meaningfully compared with the emerging high-precision palaeoenvironmental records \nfrom the ice sheets (cores), the oceans (e.g., corals, high-resolution sediment cores) and other \nterrestrial archives (e.g., peat bogs and loess sequences). Therefore, exploration of the \nimplications of sea-level records for an understanding of existing terrestrial and oceanic records of \nHolocene environmental change, including the leads and lags associated with oceanic and \nterrestrial records (e.g., Visser et al., 2003) could occur. This provides an improved scientific \nbackground against which the role of humans as agents of coastal change can be appreciated. \n \n7.  Acknowledgements \nThis research was carried out while in receipt of a Natural Environment Research Council award \n(NER\/S\/C\/2002\/10581).  Special acknowledgements are given to Operation Wallacea, and to S. \nSmithers and D. Smith for their valuable comments on the original version of this paper.  The \nauthors thank the cartography department at the Department of Geography, University of Durham \nfor producing the figures, and to all members of the Environmental Research Centre, University of \nDurham for their help and advice.   This paper is a contribution to IGCP project 437. \n \n \n \nReferences \nAgassiz, L., 1840. Etudes sur les glaciers, privately published, Neuchtel. \n \nAlley, R.B., Clark, P.U., 1999. The deglaciation of the northern hemisphere: a \nglobal perspective. Annual Review of Earth and Planetary Science  27, 149-\n182. \n \nBaker, R.G.V., Haworth, R.J., 2000. Smooth or oscillating late Holocene sea-\nlevel curve? Evidence from cross-regional statistical regressions of fixed \nbiological indicators. Marine Geology 163, 353-365. \n \nBaker, R.G.V., Haworth, R.J., Flood, P.G., 2001. Inter-tidal fixed indicators of \nformer Holocene sea-levels in Australia: a summary of sites and a review of \nmethods and models. Quaternary International 83-85, 257-273. \n \nBanjeree, P.K., 2000. Holocene and Late Pleistocene relative sea level \nfluctuations along the east coast of India. Marine Geology 167, 243-260. \n \nBard, E., Hamelin, B., Arnold, M., Montaggioni, L., Cabioch, G., Faure, G., \nRougerie, F.,1996. Deglacial sea-level record from Tahiti corals and the timing \nof global meltwater discharge. Nature 382, 241-244. \n \nBeaman, R., Larcombe, P., Carter, R.M., 1994. New evidence for the \nHolocene sea-level high from the inner shelf, Central Great Barrier Reef, \nAustralia. Journal of Sedimentary Research A64 (4), 881-885. \n Blanchon, P., Shaw, J., 1995.  Reef drowning during the last deglaciation: \nEvidence for catastrophic sea-level rise and ice-sheet collapse.  Geology, 23 \n(1), 4-8. \n \nBroecker, W.S., Denton, G.H., 1989. The role of ocean-atmosphere \nreorganizations in glacial cycles. Geochimica et Cosmochimica Acta 53, \n2465-2501. \n  \nCamoin, G.F., Colonna, M., Montaggioni, L.F., Casanova, J., Faure, G., \nThomassin, B.A., 1997. Holocene sea level changes and reef development in \nthe southwestern Indian Ocean. Coral Reefs 16, 247-259. \n \nCann, J. H., Belperio, A. P., Gostin, V. A., Rice, R. L. 1993.  Contemporary \nbenthic foraminifera in Gulf St. Vincent, South Australia, and a refined Late \nPleistocene sea-level history.  Australian Journal of Earth Sciences 40, 197-\n211. \n \nCann, J. H., Belperio, A. P., Murray-Wallace, C. V. 2000a.  Late Quaternary \npalaeosealevels and palaeoenvironments inferred from foraminifera, northern \nSpencer Gulf, South Australia.  Journal of Foraminiferal Research, 30, 29-53. \n \nCann, J. H., Bourman, R. P., Barnett, E. J. 2000b.  Holocene foraminifera as \nindicators of relative estuarine-lagoonal and oceanic influences in estuarine \nsediments of the River Murray, South Australia.  Quaternary Research, 53, \n378-391. \n \nCann, J. H., Harvey, N., Barnett, E. J., Belperio, A. P., Bourman, R. P. 2002.  \nForaminiferal biofacies ecosuccession and Holocene sealevels, Port Pirie, \nSouth Australia.  Marine Micropalaeontology, 44, 31-55. \n \nChappell, J., Chivas, A., Wallensky, E., Polach, H. A., Aharon, P., 1983. \nHolocene palaeo-environmental changes, central to north Great Barrier Reef \ninner zone. BMR Journal of Australian Geology and Geophysics 8, 223-235. \n \nChappell, J., Polach, H., 1991. Postglacial sea-level rise from a coral record at \nHuon Peninsula, Papua New Guinea. Nature 349, 147-149. \n \nClark, J.A., Farrell, W.E, Peltier, W.R., 1978.  Global changes in post glacial \nsea level: a numerical calculation.  Quaternary Research 9,  265-287. \n \nClark, P.U., Alley, R.B., Keigwin, L.D., Licciardi, J.M., Johnsen, S.J., Wang, \nH.X., 1996. Origin of the first global meltwater pulse following the last glacial \nmaximum. Paleoceanography 11,  563-577. \n \nClark, P.U., Mitrovica, J.X., Milne, G.A., Tamisiea, M.E., 2002. Sea-level \nfingerprinting as a direct test for the source of global meltwater pulse IA. \nScience 295,  2438-2441. \n \nColonna, M., Casanova, J., Dullo, W.C., Camoin, G., 1996. Sea-level changes \nand d180 record for the past 34,000 yr from Mayotte Reef, Indian Ocean. \nQuaternary Research 46,  335-339. \n \nCompton, J.S., 2001. Holocene sea-level fluctuations inferred from the \nevolution of depositional environments of the southern Langebaan Lagoon \nsalt marsh, South Africa. The Holocene 11(4),  395-405. \n \nDaly, R.A., 1934. The Changing world of the ice age. Yale University Press, \nNew Haven.   \n \nDickinson, W.R., 2001. Paleoshoreline record of relative Holocene sea levels \non Pacific islands. Earth Science Reviews 55, 191-234. \n \nDone, T. J., 1982.  Patterns in the distribution of coral communities across the \ncentral Great Barrier Reef shelf.  Coral Reefs, 1, 95-108. \n \nFairbanks, R.G., 1989. A 17,000-year glacio-eustatic sea level record: \ninfluence of glacial melting rates on the Younger Dryas event and deep-ocean \ncirculation. Nature 342,  639-642. \n \nFleming, K., Yokoyama, Y., Lambeck, K., Chappell, J., Johnston, P., Zwartz, \nD., 1998. Refining the eustatic sea-level curve since the Last Glacial \nMaximum using far- and intermediate-field sites. Earth and Planetary Science \nLetters, 163(1-4), 327-342. \n Flood, P.G., Frankel, E. 1989. Late Holocene higher sea level indicators from \neastern Australia. Marine Geology 90, 193-195. \n \nGeyh, M. A., Kudrass, H-R. 1979. Sea-level changes during the late \nPleistocene and Holocene in the Strait of Malacca. Nature 278, 441-443. \n \nGrossman, E.E., Fletcher III, C.H., Richmond, B.M., 1998. The Holocene sea-\nlevel high stand in the equatorial Pacific: analysis of the insular paleosea-level \ndatabase. Coral Reefs 17,  309-327. \n \nHanebuth, T., Stattegger, K., Grootes, P.M., 2000. Rapid flooding of the \nSunda Shelf: a Late-Glacial sea-level record. Science 288, 1033-1035. \n \nHopley, D., 1975.  Contrasting evidence for Holocene sea levels with special \nreference to the Bowen-Whitsunday area of Queensland.  In Douglas, I., \nHobbs, J. E., and Pigram, J. J. (Eds) Geographical Essays in Honour of \nGilbert J. Butland, Department of Geography, University of New England, \nArmidale, 51-84.  \n \nHorton, B.P., Edwards, R.J., Lloyd, J.M., 2000. Implications of a microfossil \ntransfer function in Holocene sea level studies. In: Shennan, I and Andrews, \nJ. (Eds.) Holocene land-ocean interaction and environmental change around \nthe North Sea. Geological Society, London. Special Publications 166,  275-\n298.  \n Houghton, J.T., Ding, Y., Griggs, D.J., Noguer, M., van der Linden, P.J., \nXiaosu, D. 2001. Contribution of Working Group I to the third Assessment \nReport of the Intergovernmental Panel on Climate Change (IPCC), Cambridge \nUniversity Press. \n \nIslam, M.S., Tooley, M.J. 1999. Coastal and sea-level changes during the \nHolocene in Bangladesh. Quaternary International 55, 61-75. \n \nKatupotha, J., Fujiwara, K., 1988. Holocene sea level change on the \nSouthwest and South coasts of Sri Lanka. Palaeogeography, \nPalaeoclimatology, Palaeoecology, 68, 189-203. \n \nLambeck, K., Chappell, J., 2001. Sea level change through the last glacial \ncycle. Science 292,  679-686. \n \nLambeck , K., Esat, T.M., Potter, E-K., 2002. Links between climate and sea \nlevels for the past three million years. Nature 419, 199-206. \n \nLambeck, K., Purcell, A., Johnston, P., Nakada, M., Yokoyama, Y., 2003. \nWater-load definition in the glacio-hydro-isostatic sea-level equation. \nQuaternary Science Reviews 22 (2-4), 309-318. \n \nLarcombe, P., Carter, R.M., Dye, J., Gagan, M. K., Johnson, D.P. 1995. New \nevidence for episodic post-glacial sea level rise, central Great Barrier Reef, \nAustralia. Marine Geology, 127, 1-44. \n \nLarcombe, P., Carter, R.M. 1998. Sequence architecture during the Holocene \ntransgression : an example from the Great Barrier Reef shelf, Australia. \nSedimentary Geology, 117, 97-121. \n \nLi, L., Gallagher, S., Finlayson, B. 2000.  Foraminiferal response to Holocene \nenvironmental changes of a tidal estuary in Victoria, southeastern Australia.  \nMarine Micropalaeontology, 38, 229-246. \n \nLighty, R. G., Macintyre, I. G., Stuckenrath, R. 1982.  Acropora palmata reef \nframework: a reliable indicator of sea level in the Western Atlantic for the past \n10,000 years.  Coral Reefs, 1, 125-130. \n  \nLong, A.J., 2000. Late Holocene sea-level change and climate. Progress in \nPhysical Geography 24, 415-423.  \n \nMcManus, J.F., Oppo, D.W. Cullen, J.L., 1999. A 0.5-million-year record of \nmillennial-scale climate variability in the North Atlantic. Science 283, 971-975. \n \nMitrovica, J.X., 2003. Recent controversies in predicting post-glacial sea-level \nchange. Quaternary Science Reviews 22 (2-4), 127-133.  \n \nMitrovica, J.X., Milne, G.A., 2002. On post-glacial sea level 1: General theory. \nGeophysical Journal International 133, 1-19. \n \nMitrovica, J.X., Peltier, W.R., 1991. On postglacial geoid subsidence over the \nequitorial oceans. Journal of Geophysical Research 96 (B12), 20053-20071. \n \nMörner, N.-A., 1976. Eustasy and geoid changes. Journal of Geology 84, 123-\n151. \n \nMörner, N.-A., 1996. Rapid changes in coastal sea level. Journal of Coastal \nResearch 12, 797-800. \n  \nNakada, M., Yonekura, N., Lambeck, K., 1991. Late Pleistocene and \nHolocene sea-level changes in Japan: implications for tectonic histories and \nmantle rheology. Palaeogeography, Palaeoclimatology, Palaeoecology 85, \n107-122. \n \nNunn, P.D., 1998.  Sea-Level changes over the past 1000 years in the Pacific.  \nJournal of Coastal Research 14, 23-30. \n \nNunn, P.D., Peltier, W.R., 2001. Far-field test of the ICE-4G model of global \nisostatic response to deglaciation using empirical and theoretical Holocene \nsea-level reconstructions for the Fiji Islands, Southwestern Pacific. \nQuaternary Research 55, 203-214. \n  \nPeltier, W.R., 1998. Postglacial variations in the level of the sea: implications \nfor climate dynamics and solid-Earth geophysics. Reviews of Geophysics 36 , \n603–689. \n \nPeltier, W.R., 2002. On eustatic sea level history: Last Glacial Maximum to \nHolocene. Quaternary Science Reviews 21, 377-396. \n \nvan de Plassche, O., (Ed.) 1986. Sea-level research: a manual for the \ncollection and evaluation of data. Geobooks, Norwich.  \n \nPirazzoli, P.A., 1991. World atlas of Holocene sea-level changes. Elsevier, \nAmsterdam, Oceanography Series, vol. 58. \n \nPirazzoli, P.A., 1996. Sea-level changes: the last 20 000 years. Wiley, \nChichester. \n  \nRamsay, P.J., 1995. 9000 years of sea-level change along the southern \nAfrican coastline. Quaternary International 31, 71-75. \n \nRamsay, P.J., Cooper, J.A.G., 2002. Late Quaternary sea-level change in \nSouth Africa. Quaternary Research 57, 82-90. \n \nSawai, Y., Nasu, H., Yasuda, Y., 2002.  Fluctuations in relative sea-level \nduring the past 3000 yr in the Onnetoh estuary, Hokkaido, northern Japan.  \nJournal of Quaternary Science, 17, 607-622. \n Scoffin, T.P., Le Tissier, M.D.A., 1998. Late Holocene sea level and reef-flat \nprogradation, Phuket, South Thailand. Coral Reefs 17, 273-276. \n \nShennan, I., Horton, B.P., 2002. Holocene land and sea-level changes in \nGreat Britain. Journal of Quaternary Science 17, 511-526. \n \nShennan, I., Peltier, W.R., Drummond, R. and Horton, B.P. 2002. Global to \nlocal scale parameters determining relative sea-level changes and the post-\nglacial isostatic adjustment of Great Britain. Quaternary Science Reviews, 21, \n397-408.  \n \nSmithers, S.G., Woodroffe, C.D., 2000. Microatolls as sea-level indicators on \na mid-ocean atoll. Marine Geology 168, 61-78. \n \nStuiver, M., Reimer, P. J. 1993.  Extended 14C database and revised CALIB \nradiocarbon calibration program.  Radiocarbon, 35, 215-230. \n \nStuiver, M., Reimer, P.J., Bard, E., Beck, J.W., Burr, G.S., Hughen, K.S., \nKromer, B., McCormac, F.G., van der Plicht, J., Spurk, M., 1998. INTCAL98 \nRadiocarbon Age Calibration, 24,000-0 cal BP. Radiocarbon 40, 1041-1083. \n \nStuiver, M., Reimer, P.J., Braziunas, T.F. ,1998.  High precision radiocarbon \nage calibration for terrestrial and marine samples  Radiocarbon 40, 1127-\n1151. \n \nSuess, E., 1888. Das Anlitz der Erde, II: Die Meere der Erde. Wien. \n \nTija, H.D., 1996. Sea-level changes in the tectonically stable Malay-Thai \nPeninsula. Quaternary International 31, 95-101. \n \nVisser, K., Thunell, R., Stott, L., 2003. Magnitude and timing of temperature \nchange in the Indo-Pacific warm pool during deglaciation. Nature 421, 152 - \n155 \n \n \nWoodroffe, C.D., McLean, R., 1990. Microatolls and recent sea-level change \non coral atolls. Nature 344, 531-534. \n \nYim, W.W.-S., Huang, G., 2002. Middle Holocene higher sea-level indicators \nfrom the South China coast. Marine Geology 182(3-4), 225-230. \n \nYokoyama, Y., Lambeck, K., De Deckker, P., Johnston, P., Fifield, L.K., 2000. \nTiming of the Last Glacial Maximum from observed sea-level minima. Nature \n406, 713-716.  \n \nZong, Y., Shennan, I., Combellick, R. A., Hamilton, S. L., Rutherford, M. M., \n2003.  Microfossil evidence for land movements associated with the AD 1964 \nAlaska earthquake.  The Holocene, 13, 7-20. \nLIST OF FIGURES \nFIGURE 1. The relative sea-level curve for the last glacial cycle for Huon Peninsula \n(Lambeck and Chappell, 2001) supplemented with observations from Bonaparte Gulf, \nAustralia (Yokoyama et al., 2000). Error bars define the upper and lower limits (modified \nfrom Lambeck et al., 2002). \n \nFIGURE 2. Sea-level zones and typical relative sea-level curves deduced for each zone \nby Clark et al. (1978) under the assumption that no eustatic change has occurred since 5 \nka BP. \n \nFIGURE 3. Schematic diagram of the Indicative Meaning illustrating the how the Indicative \nRange (IR) and Reference Water Level (RWL) are derived from Mean Tide Level (MTL) \n(not drawn to scale). \n \nFIGURE 4. Sea-level history reconstructed for long drill cores from Tahiti (triangles), \nBarbados (squares) and Papua New Guinea (dots). All radiocarbon dates have been \ncorrected to calendar years and all data points have been appropriately corrected for \nuplift\/subsidence. \n \nFIGURE 5. Location of sea-level reconstructions in the Indo-Pacific region.  Numbers refer \nto locations in Table 1. \n \nFIGURE 6. Holocene sea-level fluctuations inferred from sea-level index points from the \nsouthern Langebaan Lagoon salt marsh, South Africa.  Horizontal error bars refer to \nanalytical uncertainty in radiocarbon age calibration (2σ range), and vertical error bars \nrefer to uncertainty in sea level predictions derived from organic matter and shell material \nindicators (modified from Compton, 2001). \n \nFIGURE 7. Holocene sea-level envelope for Peninsula Malaysia (modified from Tija 1996).  \nData points with arrows indicate directional (limiting) index points. Some index points have \nvertical error bars, where the vertical range of the sea-level indicator is understood.  No \nage errors are considered, radiocarbon ages are plotted.  The boundaries of the envelope \nare drawn midway between the extreme data points and the neighbouring points within the \nenvelope (Tija 1996). \n \nFIGURE 8. A summary of linear and oscillating regression models from sea-level index \npoints created using fixed biological indicators from SE Australia for the past 5000 years.  \nDotted line – 4th order polynomial (r2 = 0.69), smooth line – 5th order polynomial (r2 = 0.78) \n(after Baker et al. 2001). \n \nLIST OF TABLES \nTABLE 1.  Details of sea-level reconstructions from the Indo-Pacific region (HS = high \nstand).  Radiocarbon ages calibrated to 2σ using the probability method in the program \nCALIB rev. 4.3, (Stuiver and Reimer 1993), including corrections for the marine reservoir \neffect using the calibration data of Stuiver et al. (1998). \n \n \n\n\n\n\n\n\n\n\n \nIndo-\nPacific \nregion \nLocation \non Fig. 5 \nLocation and authors Shoreline indicators used and \nindicative range (if known) \nTectonic \nactivity\/tidal range \netc \nDating \nmethod \nNo. of \nHolocene \nhigh \nstands \nTiming of mid-Holocene high stand Magnitude of mid-Holocene high \nstand \nSW \nIndian \nOcean \n1 South Africa (Ramsay & Cooper \n2002) \nBeachrock (+\/- 0.2m), barnacles & \nattached oysters (+\/- 0.5m), estuarine \nfill sequences \nStable   \n \n \n  \n \n  \nUranium\nseries \n(beachrock) \n2 1st HS – 4650 14C yrs BP  \n(4627 cal yrs BP) \n2nd HS 1610 14C yrs BP (966 cal yrs \nBP) \n1st HS – 3.5m above SL \n2nd HS – 1.5m above SL \nSW \nIndian \nOcean \n2 South Africa (Compton, 2001) Saltmarsh organic material\/molluscs \n \nStable, microtidal \nrange \nRadiocarbo\nn \n2 1st HS – 6800 cal yrs BP \n2nd HS – 1300 cal yrs BP \n1st HS - 1-3m above SL \n2nd HS – 0.5-1m above SL \nSW \nIndian \nOcean \n3 Mauritius, Reunion & Mayotte \n(Colonna et al., 1996; Camoin et al., \n1997,) \nFringing coral reefs  Stable Uranium \nseries \n0 SL stabilized at current levels 3ka cal \nBP \nNo HS recorded – small atolls sinking \nthrough Holocene with ocean floor \nsubsidence \nNorthern \nIndian \nOcean \n4 Sri Lanka (Katupotha & Fujiwara \n1988) \nCoral and marine shells Stable Radiocarbo\nn \n2 1st HS – 6170 to 5100 14C yrs BP \n(6485 to 5370 cal yrs BP) \n2nd HS – 3210 to 2330 14C yrs BP \n(2902 to 1558 cal yrs BP) \n1st HS – 1m above SL \n2nd HS – 1m (may not have lowered \nbtwn 2 highs) \nNorthern \nIndian \nOcean \n5 East coast of India (Banjeree 2000) Beach ridges (+\/- 0.5m), Porites coral \ncolony, intertidal shells \nStable Radiocarbo\nn (shells) \nUranium \nseries \n(coral) \n2 1ST HS – 7300 to 5660 cal yrs BP \n2nd HS – 4300 to 2500 cal yrs BP \n1st HS – 3m above SL \n2nd HS – 3m above SL \nNorthern \nIndian \nOcean \n6 Bangladesh (Islam & Tooley 1999) Sedimentary sequences & microfossils Possible tectonic \nactivity\/glacio \nisostasy \nRadiocarbo\nn \n0 No evidence for SL High Stand No evidence for SL HS \nSE Asia  7 Malay-Thai Peninsula (Tija 1996) Malaysia - Abrasion platforms, sea-level \nnotches, oyster beds \nThailand – peat, marine shells, \nmangrove wood \nStable assumes TL \nnot changed \nRadiocarbo\nn \n2 \n \n3 \nMalaysia - 5000 and 2800 14C yrs BP \n(5131 and 2358 cal yrs BP) \nThailand – 6000, 4000 and 2700 14C \nyrs BP (6262, 3808 and 2198 cal yrs \nBP) \nMalaysia - 5m and 3m above SL \nThailand – 4m, 2.5 and 2m above SL \nSE Asia  8 Sunda Shelf, Indonesia (Hanebuth \net al., 2000) \nSediment facies from cores Stable Radiocarbo\nn \nN\/A Record from 12,000-14,000 cal yrs \nBP – shows MWP 1a (16m SL rise in \n300yrs) \nN\/A \nSE Asia  9 Phuket, S Thailand (Scoffin & Le \nTissier 1998) \nCoral microatolls Stable Radiocarbo\nn \n1 Before 6000 cal yrs BP 1m above SL \nSE Asia  10 Huon Peninsula, P. New Guinea \n(Chappell & Polach 1991) \nRaised coral terraces Tectonically active \n(emergence btwn \n0.5-3m\/1000yrs) \nUranium \nseries  \nN\/A Late glacial\/early Holocene record of \nSL rise up to 5800 14C yrs BP (6053 \ncal yrs BP) \nN\/A \nSE Asia 11 Cocos Keeling Islands (Woodroffe & \nMclean 1990) \nCoral microatolls Stable Radiocarbo\nn \n1 Since about 3000 14C yrs BP (2600 \ncal yrs BP) \nAt least 0.5m \nSE Asia 12 Strait of Malacca (Geyh et al., 1979) Mangrove wood and peat (indicative \nmeaning not accounted for) \nStable Radiocarbo\nn \n1 Approx 4980 14C yrs BP (5089 cal yrs \nBP) \nBetween 2.5-5.8m above SL \nNorthern \nAsia \n14 Japan (Nakada et al., 1991) Intertidal and subtidal shells, wood and \npeat \nTectonically active Radiocarbo\nn \n1 HS at 600 cal yrs BP 5m above SL \nNorthern \nAsia \n15 Japan (Sawai et al. 2002) Sedimentary sequences and \nmicrofossils \nTectonically active Radiocarbo\nn \nN\/A 3 falls in RSL since 3000 cal yrs BP N\/A \nNorthern \nAsia \n16 Southeast China (Yim & Huang, \n2002) \nFixed biological indicators (oyster beds) Local monsoon \nactivity \nRadiocarbo\nn \n1 \n \n \n \n \n5140 14C yrs BP (5371 cal yrs BP) No more than 2m above SL \n Australia 17 Central Great Barrier Reef, Australia \n(Beaman et al., 1994; Larcombe et \nal., 1995; Larcombe and Carter, \n1998) \nOyster beds Stable, some \ndifferential flexing of \nshelf over past 6000 \nyrs \nRadiocarbo\nn \n1 Between 5660 and 4040 14C yrs BP \n(6000  and 4053 cal yrs BP) \n1.65m above SL \n Australia 18 Eastern Australia (Flood & Frankel \n1989) \nIntertidal tube worms Stable Radiocarbo\nn \n1 Some time before and after 3420 14C \nyrs BP (3274 cal yrs BP) \nAt least 1m above SL \n Australia 19 Bonaparte Gulf, NE Australia \n(Yokoyama et al., 2000) \nSedimentary facies and their contained \nmicrofossils \nStable Radiocarbo\nn \nN\/A LGM and early late glacial record N\/A \nAustralia 20 New South Wales (Baker et al., \n2001) \nFixed biological indicators (tubeworms, \nbarnacles, oysters) \nStable Radiocarbo\nn \n1 Around 3900 cal yrs BP At least 1m above SL \nPacific 21 Fiji (Nunn & Peltier 2001) Coral (Porites) microatolls and intertidal \nshells from raised beaches \nHotspot activity over \nHolocene timescales \n(subsidence) \nRadiocarbo\nn \n1 or 2 1st  HS – 5650 to 3200 14C yrs BP \n(6021 to 2939 cal yrs BP) \n2nd HS – 6100 to 4550 and 3590 to \n2800 14C yrs BP (6477 to 4678 and \n3422 to 2485 cal yrs BP) \n1st  HS – 1.35 to 1.5m above SL \n2nd  HS – (i) 0.75-1.85m, (ii) 0.90-\n2.46m above SL \nPacific 22 Taihiti (Bard et al., 1996) Coral (Acropora) Slight subsidence\n(~0.2mm\/yr) \n Uranium \nseries \nN\/A Record from 14,000-5000 cal yrs BP, \nshows MWP 1A \nN\/A \nPacific 23 W Central Equitorial Pacific \n(Grossman et al., 1998) \nCoral, microatolls, beachrock, molluscs, \npeat \nHotspot activity over \nHolocene \nRadiocarbo\nn \n1 4ka 14C yrs BP (3942 cal yrs BP) 1-2m above SL \n \n  \n"}