{"doi":"10.1007\/978-1-4419-0251-1","coreId":"15512","oai":"oai:dro.dur.ac.uk.OAI2:7057","identifiers":["oai:dro.dur.ac.uk.OAI2:7057","10.1007\/978-1-4419-0251-1"],"title":"illycaffè and the Brazilian espresso knowledge network.","authors":["Rauscher,  I.","Andriani,  P."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":["Romano,  A.","Secundo, G."],"datePublished":"2009-01-01","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15512.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7057\/1\/7057.pdf","pdfHashValue":"6917e0a24311b859610c4d36877c6ce7a47d49ee","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7057<\/identifier><datestamp>\n      2010-07-19T11:40:37Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        illycaffè and the Brazilian espresso knowledge network.<\/dc:title><dc:creator>\n        Rauscher,  I.<\/dc:creator><dc:creator>\n        Andriani,  P.<\/dc:creator><dc:publisher>\n        Springer<\/dc:publisher><dc:source>\n        Romano,  A. & Secundo, G. (Eds.). (2009). Dynamic learning network : models and cases in action. New York: Springer, pp. 57-74<\/dc:source><dc:contributor>\n        Romano,  A.<\/dc:contributor><dc:contributor>\n        Secundo, G.<\/dc:contributor><dc:date>\n        2009-01-01<\/dc:date><dc:type>\n        Book chapter<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7057<\/dc:identifier><dc:identifier>\n        doi:10.1007\/978-1-4419-0251-1<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7057\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1007\/978-1-4419-0251-1<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7057\/1\/7057.pdf<\/dc:identifier><dc:rights>\n        The original publication is available at www.springerlink.com<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2009,"topics":[],"subject":["Book chapter","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n19 July 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nRauscher, I. and Andriani, P. (2009) ’illycaff and the Brazilian espresso knowledge network.’, in Dynamic\nlearning network : models and cases in action. New York: Springer, pp. 57-74.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1007\/978-1-4419-0251-1\nPublisher’s copyright statement:\nThe original publication is available at www.springerlink.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nChapter 3. Illycaffè and the Brazilian espresso \nknowledge network  \nIngrid Rauscher, Pierpaolo Andriani \nADS Assessoria de Comunicações, São Paulo (SP), Brazil \nDurham Business School, UK and eBMS-Scuola Superiore ISUFI, University of \nSalento, IT \nIntroduction \nItalian roaster illycaffè celebrated its 75th anniversary in 2008. It is known \nworldwide for the quality of its espresso, serving 6 million cups in more than 50 \nthousand shops spread over 144 countries. The illy espresso is a refined blend of \nnine types of coffee beans purchased in 13 producing countries. Out of those, the \nArabica variety produced in Brazil accounts for 50% of the coffee used in the \nblend. \nIn order to acquire quality coffee beans in the volume and scale needed to \nserve its customers while meeting the stringent quality requirements of the \ncompany, illycaffè developed an extensive and complex supplier network. \nAiming to ensure quality along all processes, the company brought into the \nnetwork all the links of the coffee production chain, from the plantation to the \nprocessing of the coffee beans in the company facilities in Trieste (Italy). To \nshow its appreciation for suppliers and ensure a reliable supply of fine Brazilian \ncoffee, the company developed a series of strategic actions that went beyond \nbusiness relations to include an educational effort, generating and disseminating \ninformation and knowledge on how to produce quality coffee (also known as \nspecialty or gourmet coffee), while also forging strong ties with all the elements \nin the net.  \n36      Ingrid Rauscher, Pierpaolo Andriani \nWe should bear in mind that in the early 90’s, when illycaffè started building \nup its relationship with Brazilian coffee producers, the international coffee \nmarket was very different from today. First, flat global prices did not \ndifferentiate products with different characteristics. Therefore, in coffee \nproducing countries, the widespread practice was to mix good quality and poor \nquality beans in the same lot. This caused losses to illycaffè: the company had to \ndiscard up to 70% of the volume purchased because the beans did not meet the \nstandards set by the company. Second, the coffee sector was ripe for radical \ntransformation. Until 1990, the coffee market had effectively been regulated by a \ncartel (ICO: International Coffee Agreement) lead by Brazil via the Instituto \nBrazileiro do Caffe’ (IBC) (Luttinger and Dicum, 2006). The cartel controlled \nprice and price volatility by agreing quota among the producer countries and \ncontrolling the amount of stock (Daviron, 2005). The end of ICO in 1989 and \nIBC in 1990 opened the gate for the emergence of new business models. \nIf on the one hand there were flat prices for the producers, on the other hand \ndemand for premium coffee experienced a boom in importing countries. \nConsumers wanted a fine drink made with quality beans, something that would \nadd to pleasant relaxing moments. At the same time, by re-inventing the century-\nold tradition of the coffeehouse (Allen, 2001), the so-called ‘Latte Revolution’ \n(Daviron and Daponte, 2005) changed the habit of coffee drinking and \ntransformed the perception of coffee in the US first and then in most other \nindustrialized countries. \nChallenged in its efforts to provide this growing market with a great espresso, \nillycaffè undertook initiatives that would enable the company to reach its \nstrategic goal of bringing about structural changes in the cultural values of \nBrazilian coffee producers to promote premium quality. The company devised \nmechanisms and developed tools to map producing regions and to identify those \nproducers who were willing to adhere to its concepts of superior quality. Another \nobjective was to ensure their loyalty, so that the company could rely on them to \nprovide coffee beans in the volume and scale needed to meet not only current \ndemand but also its market expansion plans. \nAn Award for Quality \nWhen it first came to the Brazilian market, the first strategic action of illycaffè to \nchange the prevailing culture among coffee producers and promote quality was to \nChapter 3. Illycaffè and the Brazilian espresso knowledge network      37 \nlaunch the “Brazil Award for Quality in Coffee for Espresso”, together with \nADS Assessoria de Comunicações, the partner agency chosen for company’s \npublic relations in Brazil. After 17 annual editions, it was renamed “The Ernesto \nIlly Foundation Award for Quality in Coffee for Espresso” to honor the late \npresident of the company who died at the beginning of 2008. \nWith the award, the company kicked off its strategy of identifying producers \nof fine coffees who were also interested in adhering to premium quality concepts, \nand mapping the more favorable regions for quality crops. This effort led to the \nformation of a base of loyal suppliers who could support the growing demand. \nToday, illycaffè distributes more than US$ 100,000 in prizes every year to the \n50 top contestants, besides committing to purchase all lots submitted for \nevaluation that pass a quality test. The prizes are awarded in a gala event \npromoted by the company to celebrate the quality of the coffee traded and the \nsuccessful acquisition of products meeting their high standards.   \nBesides ensuring the purchase of coffee from finalists, the company rewards \nquality with prices that are approximately 30% higher than the market average. \nFor producers, it makes sense to adhere to the concepts of premium quality, as it \nrepresents an alternative to the flat prices they would otherwise get. It is also \ngood business for the company, since it minimizes losses and provides a reliable \nsupply of the most important type of coffee beans in the blend served to \ndiscriminating customers wherever the Italian brand is present. \nBesides the contest and prizes, strategic actions by illycaffè included the \nforging of direct relationships with suppliers, eliminating the so-called \nintermediaries. The company made arrangements with the export organization \nPorto de Santos and started purchasing directly from Brazilian producers and \ntaking charge of the export procedures.   \nHaving created the contest and set a direct channel to producers, the company \nhelped establish the Assicafé, a laboratory led by one of the most respected \nspecialists in coffee quality in Brazil, Dr. Aldir Alves Teixeira. Assicafé analyzes \nthe samples submitted to the contest and the samples being offered for purchase \nby the company. The lab also assists coffee producers on technical matters and \ntrains the classification specialists who work with the coffee producers. \nThe actions undertaken by illycaffè around the award  drew the attention of the \nagricultural market in Brazil. Communication actions involving cooperatives and \nassociations in major producing regions and the press helped disseminate \ncompany concepts, as well as its vision and values, and this was a driving force \nfor transformation in the local culture, promoting greater commitment to superior \nquality. In time, the award came to involve other agents, such as classification \n38      Ingrid Rauscher, Pierpaolo Andriani \nprofessionals, technicians working in cooperatives and associations who help \ncoffee producers identify the best beans. Starting to reap the positive results of its \nactions, the company went on to create new strategic actions to further stimulate \nsuperior quality. Some examples are the creation of a special network group \ncalled the “illy Coffee Club”, and the establishment of the illy Coffee University, \nUnilly, currently called Brazil Coffee University. Both initiatives aim to \ndisseminate knowledge among the links in the production chain. The university \nwas created with the cooperation of professors and technicians of the Program of \nStudies of the Agro-Industrial System Business (Pensa), of the Foundation of the \nInstitute of Administration (FIA), associated with the School of Economics and \nAdministration of the University of São Paulo (FEA\/USP). \nThe results of the actions can be seen not only by illycaffè but also by its \nBrazilian suppliers. It was on the one hand beneficial for the company, for it \nchanged the prevailing culture among coffee producers and prodded them to \nembrace quality concepts through actions that went beyond creating commercial \nties to weaving a complex network geared to generating and disseminating \nknowledge. Some figures for context: to date, illycaffè has distributed close to \nUS$ 2 million in prizes, received more than 10,000 samples, and built a base of \nmore than 1.6 thousand suppliers who are proud to belong to a differentiated \nclass of producers of fine coffees, the “elite” among their peers, and whose \nproducts are welcome in the most demanding international markets.  \nOn the other hand, Brazilian coffee producers and the local market also \nperceive significant results. In the wake of the pioneering contest, a number of \nother awards for coffee producers have emerged, sponsored both by public and \nprivate institutions. Another positive point was the differentiation of premium \ncoffees introduced initially by the company, which contributed to the launch of a \nnumber of other fine coffee brands in the country. This was essential for shaping \na culture of coffee appreciation, and led to the establishment of a number of new \nbusinesses, besides enabling restaurants to offer their patrons a special way to \nclose their meals, and generate extra income.  \nIn the case of the special premium brands that followed the illycaffè award, an \nexample worthy of mention is “Café do Cerrado”. In the first years of the contest, \nthe positive results obtained by producers in the region called Cerrado, in the \nMidwest State of   Minas Gerais, led to a local strategy of using the high ranking \npositions obtained in the contest as a marketing tool, positioning the region as a \ndenomination for premium coffee. Regional associations and cooperatives got \ntogether and created the Council of the Associations of Cerrado Coffee Producers \n(CACCER), in the municipality of Patrocínio (MG), launching the denomination \nChapter 3. Illycaffè and the Brazilian espresso knowledge network      39 \nas a means to claim more favorable trade conditions. The results were highly \npositive: they did in fact climb to a privileged position within the market, and the \nimage of a region that became known for quality coffee even improved the \nselling price of land. At present, premium quality concepts are so widespread and \ningrained that CACCER features certification programs both for products and for \nproperties to meet the requirements of domestic and export customers. The \nhistory of the council featured at their webpage (www.cafedocerrado.org.br) \nrecognizes the actions started by illycaffè to stimulate superior quality in coffee. \nThis is a very clear example of how results in the contest were used as a \nreference in marketing actions: \nThe award proved beyond doubt the superiority of the Cerrado coffee. \nExploiting this fact, the Caccer started to make use of the award as a marketing \ntool to promote the coffee from the region. As the Illycaffè  award was widely \nknown and impacted heavily on the coffee market, we built our strategy around \nthe award. Given the magic presence of Cerrado growers among the award \nwinners, in a short time the image of the Cerrado coffee and of the award spread \nall over and the quality of the region started to be recognised on the global scale. \nA network for generating and disseminating knowledge \nThe strategic actions of illycaffè to improve quality spontaneously evolved into a \ncomplex network, shaped not only by trade relations but also by the pride to \nbelong to the top producers who were glad to share information and knowledge \nabout their activities. The tissue of the illycaffè network in Brazil is created by \nthe direct trade between company and loyal suppliers of fine coffees and by the \nstrong ties between all links in the coffee producing chain. It is enabled by \nefficient communication that generates and disseminates information and \nknowledge, and above all, it is nurtured by the mutual trust of all parties \ncommitted to improving the quality of coffee in Brazil. \nThe establishment of the Coffee University of Brazil, the meetings of \nproducers in the illy Coffee Club and the award for quality gradually shaped a \ntrue ecosystem generating gains for the Brazilian coffee producing chain and for \nthose regions in the country that embraced the quality concepts in the production \nof premium coffee. In this ecosystem, the transmission of information and \nknowledge is faster and more efficient, and is shared in a viral manner, as a \n“healthy epidemic”, reaching all links in the large scale production chain.   \n40      Ingrid Rauscher, Pierpaolo Andriani \nThe illy Coffee Club, created in June 2000 by illycaffè to bring together its \nBrazilian providers of premium coffee, was the first initiative of this kind in \nBrazil aiming to generate loyalty among suppliers. Through the club, the \ncompany organizes direct communication actions with members, and rallies them \nfor actions geared to conveying, exchanging and sharing information and \nknowledge. At the club, it is quite common for members to meet on the so-called \n“field days”, where they get together on a property to watch up close what \npractices are being adopted for the production of superior quality coffee, and the \nmethodologies used for improvement based on information or techniques. The \nimportance of these get-togethers, always featuring a specialist associated with \nthe Brazil Coffee University, can be easily seen: some members will travel close \nto 1000 kilometers to take part in a field day. The illy Coffee Club is an \nimportant knot in this mesh of information and knowledge woven by illycaffè in \nBrazil; it is an example of collective intelligence whereby coffee producers learn \nfrom each other and from the group, leading to new ideas and new knowledge for \nthe improvement of the quality of Brazilian coffee. \nLast year, the illy Coffee Club boasted 583 members, 95% more than it had in \n2002, shortly after it was created. Besides the possibility to sell their produce to \nillycaffè at prices that are higher than the market average, members also get \nbetter prices for the portion of the crop not sold to illycaffè. The membership \ncard ensures elite status among peers, and illycaffè suppliers are recognized as \nproducers of premium quality coffee. The local market and peers understand they \nwork with the information and techniques aligned with the strict requirements of \na brand known for superior quality – press reports and studies by research \ninstitutes place illycaffè among the 15 top companies in Italy. \nAt the illy Coffee Club, members are distinguished for the uninterrupted time \nthey have been supplying the company. First year members carry a red card; after \ntwo years, members have a silver card. Members who have sold their product to \nillycaffè for three or more consecutive years receive a gold card. Gold and Silver \nmembers enjoy more than the benefits of the club: they have the chance to enter \nthe “Supplier of the Year” contest, in which a number of aspects regarding \nregularity and quality of lots are evaluated.  The award for the winner is a trip for \ntwo to Trieste and Venice to visit the illycaffè’s facilities and see firsthand the \ntechnology adopted for the production of the illy espresso, and to enjoy one of \nthe major tourist destinations in Italy. The winner is announced at the award \nceremony. Besides the trip, the “Supplier of the Year” receives market \nrecognition given the publicity in the press and the story featured in L´Espresso \nChapter 3. Illycaffè and the Brazilian espresso knowledge network      41 \nmagazine, an illycaffè publication distributed in the areas in which the company \noperates.  \nAnother important node in the illycaffè network in Brazil is the Brazil Coffee \nUniversity, with courses and seminars aiming to train all links in the coffee \nproduction chain, from production systems to management. The professors are \nspecialists from Pensa\/USP, and from illycaffè’s Università del Caffè in Trieste, \nItaly. Over the past 8 years, almost 6,000 producers participated in the programs, \nexchanging information and knowledge among themselves and with specialists.  \nTo tie the knots in this mesh aimed to generate, disseminate and share \ninformation and knowledge, illycaffè develops a series of communication actions \nin cooperation with the agency responsible for its public relations in Brazil, ADS. \nSome examples of communication pieces are the video “How to make coffee a \nwork of art”, with tips and cases selected from within the coffee production \nchain; the instruction manuals “The roads to excellence”, guiding coffee \nproducers on good management practices they can adopt in their properties for \nbetter quality in all aspects of coffee farming; and printed technical reports on \nroutine problems that can be avoided or corrected in the field. Other examples of \ntools that facilitate communication between the company and other nodes in the \nnetwork, and also serve as a platform for disseminating information and \nknowledge are the magazine “L´Espresso” and the newsletter “Focus on illy \nClub”, both of which feature reports on initiatives by the company, its partners \nand suppliers – and ultimately, on all the areas and nodes of the national network. \nOther tools also help strengthen the ties between the nodes and build up \nrelationships, like the webpage of the illy Coffee Club – \nwww.clubeilly.com.br. In this digital space, the company shows the actions \nundertaken by the club and also interacts with members, communicating not only \ntechnical information but also “field days”, courses, seminars and lectures \npromoted by the Brazil Coffee University and information on the contest and \naward ceremony. Other initiatives promoted by  illycaffè for customer \nrelationship include a toll free number for customer service, exclusive illy gifts, \nspecial sales on illy products (coffee machines, cups, coffee blends among \nothers) as well as  traditional greeting cards (birthdays, Christmas, etc).   \nThe initiatives meant to disseminate information and knowledge are aligned \nwith the interests of all parties involved in the mesh woven by illycaffè in Brazil. \nA recent survey among 96 members of the illy Coffee Club showed supplier \nsatisfaction in a number of strategic aspects related to the proper functioning of \nthe network. Among the suppliers that responded to the questionnaire: 96% said \nthey are very happy with their relationship with the company; 84% participate in \n42      Ingrid Rauscher, Pierpaolo Andriani \nthe contest; 54% take part in the courses and seminars of the Brazil Coffee \nUniversity; 92% perceive the benefits offered by the illy Coffee Club as \ncompetitive advantage; 69% participate in the “field days” promoted by the club; \n92% enjoy reading the L´Espresso magazine; 88% welcome the information in \nthe newsletter “Focus on the illy Club”; 70% like the club webpage; and 79% \nstated they are very satisfied with their sales to illycaffè. The findings are very \nencouraging, confirming that the company has overcome the hurdles it found \nwhen it first came to Brazil. The survey also proves that the strategic actions go \nbeyond mere business relations; they have shaped a network for the \ndissemination of quality concepts, tying together all the parties involved in the \ntrade of coffee beans used in the preparation of a drink enjoyed by customers \nrequiring the highest standards in more than 140 countries all over the world. \nThe findings show that results exceeded the highest expectations for the initial \nstrategy devised to organize a base of suppliers of fine coffees. The company \ninitiatives in Brazil, especially the creation of the award, the club and the \nuniversity, became so relevant in the Brazilian scenario that they actually lead to \nother unpredicted positive outcomes.   There are plenty of such examples. One of \nthose is the case of the “Zona da Mata” region, in the State of Minas Gerais. The \nregion was once known for the poor quality of its coffee, and with the support of \nthe nodes in the illycaffè network in Brazil, it successfully turned the situation \naround. Using the relations in the illy Coffee Club and the suggestions of \nillycaffè’s specialists, producers in the region adopted best agricultural practices \nand improved the quality of their product, climbing to the top ranks in illycaffè \ncontest, and improving their trading conditions. By adhering to quality concepts, \nproducers united to change the identification of the region, using a new \ndenomination, “Matas de Minas”, to distance themselves from the negative \nimage associated with the old denomination “Zona da Mata”. \nThe case of “Matas de Minas” serves as evidence of the viral, epidemic-like \neffect of the information and expertise exchanged and shared through the \nnetwork among all the nodes connecting illycaffè relations in Brazil. The efforts \ngeared to the adoption of new agricultural concepts and practices in the region \ndrew the attention of the market not only locally but also internationally. Besides \nthe production-related aspects, the efforts impacted even the personal lives of the \nproducers. Case in point is the example of brothers Edmilson and Walter Dutra, \nfarmers in the municipality of Manhuaçu (MG). By adhering to illycaffè quality \nconcepts, they gained access to new markets and better trading conditions. This \nbrought in more income and improved quality of life for their families – they can \nnow afford to travel to the US and Europe on vacations. Also, the benefits of \nChapter 3. Illycaffè and the Brazilian espresso knowledge network      43 \nadhering to quality in agriculture motivated them to adopt the same concepts in \ntheir other businesses, with similar positive results. \nThe structure of the knowledge flows within the illycaffè  suppliers network \nshow some interesting features: \nMulti-layer  \nThe network shows different layers of connectenedness and control. At the centre \nsits Illycaffè  in Trieste, Italy. The centre sets the strategic direction and practises \na fairly hands-off policy in terms of implementation of strategy. But Illycaffè  \nalso keeps a close involvement with the Brazilian Espresso Knowledge Network \nby participating to the club field tours, administering technical course, visiting \nsuppliers, etc. These actions create and maintain a network of personal \nrelationships between the centre and the other layers of the network that infuse \nthe network with a human touch, generate long-term trust and reduces the \nknowledge path length (Watts, 2003). \nIllycaffè ’s inner network. This is composed by a limited number of \ncompanies, in tight contact with illycaffè  in Trieste, specialising in the \nmanagement of all operations related to the Brazilian environment, such as, \nquality, PR, marketing, export, logistic, training, management of the illy award, \netc.  \nCore suppliers’ network: this is the set of suppliers that are part of the Club. \nWe call it core as it shares and promotes by their actions and professional success \nthe quality philosophy of illycaffè .  Club members are active participants to the \nBrazil Coffee University training initiatives and are widely considered as the best \nquality producers of coffee for espresso in Brazil. Illycaffè  invest heavily in the \nrelationship with these suppliers, some of whom do collaborate on Research and \nDevelopment programs with illycaffè  and other Brazilian institutions.  \nSuppliers - not part of the Club. this is a broader set of suppliers from which \nthe core of suppliers is selected. Though this layer is more distant than the Club \nsuppliers, nevertheless, it provides a crucial source of weak links (Granovetter, \n1992) through which a wide variety of information can flow. Also, it constitutes \na basin for further expansion of the suppliers base. \nMulti-channels \nKnowledge flows through a variety of different channels: \n44      Ingrid Rauscher, Pierpaolo Andriani \nTop-down \nFrom illycaffè  to growers via Brazil Coffee University: this is the channel \ncontrolled by illycaffè  and illycaffè ’s inner network in  Brazil. This is the \npreferential channel through which the Brazil Coffee University training takes \nplace. Two different strands of knowledge flow through this channel: first, \ntechnical and scientific knowledge mainly related to coffee growing and acquired \nin central labs (learning-by-researching) is spread in a top-down fashion to \nsuppliers; second, the channel helps diffuse ‘best practice’ acquired in a bottom-\nup fashion (see below).  \nBottom-up-down  \nFrom growers to illycaffè : visits to farms and conversations with growers in \nBrazil and beyond enable illycaffè  people to observe and select innovations and \nlocal practices (largely based on learning-by-doing). These innovations are then \ndiffused within the network through the top-down mechanism described above.  \nBottom-out \nFrom growers to growers via Club visits: besides the vertical channels discussed \nabove, we have also observed the spreading of innovations through an horizontal \nchannel. Growers that participate to farm visits organized within the Club \nobserve local innovations and improvements, upon which they can experiment. \nThis process results in a transformation of the initial product\/process innovation \nwith a consequent improvement and adaptation to a local context. Occasionally \nsome of the organizational innovations turn into best practices. Further visits will \nspread the improved product\/process innovation throughout the network. The \nstunning feature of this channel is that it is an unintended consequence of the \nloyalty program introduced with the Club. It is, in other word, a self-organizing \nand distributed innovation mechanism. Innovation and knowledge diffusion \nwithin the horizontal channel occur outside the planning and intentions of \nillycaffè ’s inner network. As it happens with many self-organizing features in \nnetwork, this one too is exposed to virtuous network effects (or externalities). \nThe larger the network and the more frequent and intense the conversations \noccurring within, the higher the chance that some innovation will be picked, \nimproved and diffused for the benefit of the whole network. Though in principle \nthis may look like a net loss of competitive advantage, in practice there are \nChapter 3. Illycaffè and the Brazilian espresso knowledge network      45 \npowerful reputational and peer-pressure mechanisms at play from which the \ninnovators draw some kinds of returns.  \nOutside-in  \nFrom growers abroad to Brazilian growers: the replication of the Brazilian \n‘experiment’ outside of Brazil has created a further channel for knowledge \nexchange. For instance, we can document the case of the ‘raised beds’: this a \ntechniques for exsiccation of coffee cherries, used in the African coffee \nproducing regions, that has been ‘imported’ in Brazil by an illycaffè suppliers, \nfollowing an illycaffè -sponsored trip to Africa.  \nTrust-based and high knowledge density  \nOur research has revealed that Illycaffè  has devised a business model based on \nfour features: a) higher price for coffee supplies, about 30%, or more, than the \nmarket price (set at the New York Coffee Exchange); b) investment in improving \nsuppliers’ produce quality by freely diffusing technical knowledge; c) direct \nrelationships with suppliers based on personal interactions; d) long-term \nrelationship based on expectation that Illycaffè  never fails to honour the promise \nto buy quality coffee.  \nThe synergistic combination of the four business model aspects and the long-\nterm reliability of illycaffe, have generated a high-trust environment, in which at \nmost two degrees of separation exists between any two members of the network. \nTrust, short path length and wide geographic dimension covered by the network, \nenable diversity to coexists with a smooth and fast diffusion of information.  \nNon-exclusive and open \nMembership in Club is non exclusive and non-binding. The most entrepreneurial \nsuppliers are usually part of multiple overlapping associations, clubs, \ncooperatives, and other organizational forms. Participation in multiple fora \nincreases the variety of context to which suppliers are exposed, amplifies the \nquality and diversity of the circulating information and stories and allows the \ncross-fertilisation of knowledge among different sectors. In fact, many suppliers \nhave diversified from coffee into other crops, such as soy, sugar cane, wood, etc. \nand applied the knowledge developed in one sector to the others. Illycaffè  \n46      Ingrid Rauscher, Pierpaolo Andriani \nencourages all initiatives that lead to a quality increase even in the case, as \nindeed it is often the case, illycaffe’s competitors may profit.   \nThis business model together with illycaffè  reputation of the best espresso \nroaster in the world has generated powerful incentives to join the network and \nengendered a high level of trust between illycaffè and suppliers and within the \nsuppliers community. \nThe insertion of coffee in the information and knowledge \neconomy \nThe many connections of the illycaffè network in Brazil show that the strategic \nactions initiated by the company brought great innovations to the local coffee \nmarket. The company always pioneered the use of technology and innovation in \nits operations, introducing a significant number of advances in the industry. The \nhistory of illycaffè is based on the tripod “science, technology and art”: these are \nthe factors behind the development of programs for generating, disseminating, \nexchanging and sharing knowledge and information and guiding the design of \ntools for communication and relationship management.   \nShaping a complex information and knowledge network with suppliers in \nBrazil is consistent with Spanish sociologist Manuel Castells’ description of a \n“network society”. In the late 1990’s, Castells published a study on the \ntechnological evolution of the many layers of society and its local and global \nimpact. In his book The network society, 2007, which first edition was published \nin 1999 as the first volume of a trilogy called The information age: economy, \nsociety and culture, the author analyzes the transformations caused mostly by the \nadvance of what he calls the “information and knowledge economy”, leading \nultimately to a network society. \nAlthough Castells focuses more closely the development of communication \nand information technologies, the movement towards a network society may help \ndescribe the impacts of the network formed by illycaffè and suppliers in Brazil, \nwith connections expanded by interwoven nodes or knots tied by the generation \nand dissemination of knowledge. Like the movements observed by Castells, this \nis a local network in terms of operation, yet global in its reach. The knowledge \ntransmitted and generated in Brazil stimulates the production of quality coffee \nbeans exported to Italy, where they are processed together with beans from other \ncountries for the blend used in the espresso enjoyed by customers in more than \nChapter 3. Illycaffè and the Brazilian espresso knowledge network      47 \n140 countries. The creation of a network featuring complex connections and \nembedded in the economy of information and knowledge permeating any \nintended market (in the case of illycaffè, the premium coffee market) impacts the \ndifferent economic and social environments described by Castells.  \nAware of the emergence of new social and economic scenarios facing global \ncompanies, the strategic actions by illycaffè are related to Castells’ observation \nconcerning the restructuring process of capitalism itself, characterized by factors \nassociated with the economy of information and knowledge, such as: flexible \nmanagement; decentralization of companies and organization in internal and \nexternal networks (involving other companies and institutions; individualization \nand diversification of labor relations; incorporation of women in the remunerated \nworkforce; state intervention for the deregulation of markets and dissolution of \nthe welfare state; and fiercer economic competition. (Castells, 2007: 39) \nSome key points shaping the new scenario described by Castells are also \npresent in the structure developed by illycaffè in Brazil to promote quality. \nAmong them, he mentions economic and social changes leading to an \ninformational, global, networked environment. \nIt is informational because productivity and competitiveness among units or \nagents in the economy (whether companies, regions or nations) depend basically \non their ability to generate, process, and efficiently apply the knowledge-based \ninformation. It is global because the key productive activities, consumption and \ncirculation, as well as its components (capital, labor, raw materials, \nadministration, information, technology and markets) are organized on a global \nscale, either directly or through a network connecting economic players. It is a \nnetwork because, under the new historical conditions, productivity and \ncompetition arise within a global network of interactions among corporate \nnetworks. (Castells, 2007: 119) \nThe characteristics of the new scenario described by Castells show that the \nunfolding of the information economy is relevant to every economic activity, and \nvery especially to industrial operations. In this context, the network structured by \nillycaffè to disseminate quality concepts in coffee is aligned with the \nrestructuring of capitalism defined by the author as “informationalism”. As for \nthe effects of economic transformations, Castells believes factors such as \nproductivity, competitiveness and profitability are now very much influenced by \nthe accumulation and application of knowledge and the access to information, as \nwell as by the information flow between the different nodes connecting corporate \nnetworks in different economic activities. Once again, the concepts described by \nthe author can be used to explain the impact of the knowledge network structured \n48      Ingrid Rauscher, Pierpaolo Andriani \nby illycaffè in Brazil, as well as the efficiency of the strategic actions developed \nby the company to create a base of  loyal suppliers using knowledge applied to \ncrops for the production of premium coffee. \nAnother author who writes on the creation of knowledge networks is Yochai \nBenkler (2006), professor at the Yale Law School in the US. As illycaffè’s \ninitiatives brought about a cultural change in Brazilian coffee production aiming \nsuperior quality through the use of knowledge, Benkler analyzes the function and \nrole of networks within the new scenario where the format in which information \nand knowledge are disseminated has been altered. The author shows that the \ntraditional communication pattern “one to many” has evolved to “many to many” \nwithin networks. This is a more malleable, interactive pattern, allowing for \nstrategies that do not have to conform to the traditional information market, since \nknowledge is now exchanged and shared.  \nIn his study, Benkler defines the current scenario as the “network information \neconomy”, in which the exchange of information through open platforms is \nincreasingly important; where knowledge is built on the decentralized, \ncooperative, shared traffic of information among peers or individuals sharing the \nsame interests. Albeit driven by clear business objectives, the illycaffè case fits \nthe description, given the fact that the actions went beyond the initial strategies \ndevised to support the purchase of quality coffee beans by the company. In the \ncase of the network structured by the company, the decentralized information \nflow among coffee producers and the other nodes in the network has fostered the \ngeneration of new knowledge on coffee agriculture, as well as the dissemination \nof proven concepts and techniques as best practices in growing and producing \nfine coffees.   \nAlthough it is a network structured around a company, the nodes in the \nillycaffè network in Brazil feature a new logic, one that Benkler claims must not \nbe aligned to a market system, or that in other situations may run parallel to such \na system. In either system, the logic identified by Benkler and deployed in the \nknowledge network devised by illycaffè for quality in coffee features clear \ncooperation between peers in networks, or among the many nodes within them, \nwith information being exchanged and shared and thus generating and \ndisseminating knowledge that can be adopted and applied, and consequently \ncause ongoing transformation and improvement in reality.  \nChapter 3. Illycaffè and the Brazilian espresso knowledge network      49 \nFinal considerations – Changing the landscape through \nknowledge \nThis article illustrates an example of a knowledge network in the agrifood sector \nwith some notable characteristics both in terms of its evolution (how it came to \nbe) and of the structure of its knowledge flows. \nIn 1991 when Illycaffè  changed their purchasing policy they unwittingly \ntriggered a radical change in the coffee value chain (CVC). The global CVC was \nand still is characterised by two peculiar features: a) geographic isolation \nbetween production and consumption - production takes place in the Southern \nhemisphere, whereas consumption occurs predominantly in the Northern -; b) \ndramatic imbalances in the CVC (Daviron and Daponte, 2005) with a ‘coffee \nboom’ in consuming countries and a ‘coffee crisis’ in producing countries’ \ntogether with a high supply of ‘low quality’ coffee and a dire shortage of ‘high \nquality’ coffee. \nAgainst this background Illycaffe’s decided to disintermediate the coffee \nsupply chain and to interact directly with coffee producers in Brazil. This \ndecision had a radical effect: it created a direct link between consumption \nmarkets and production markets, through which knowledge and information \ncould flow. Before then, the multiple links between production and consumption \n(roasters),  cooperatives, traders, buyers, financial markets, etc. – effectively \nblocked knowledge and information flows between users and producers, that is, \nbetween consumption in the Northern hemisphere and production in the \nSouthern. One of the great intuitions of illycaffè  and specifically of the late \nErnesto Illy, the chairman of the company, was to understand that the structure of \nthe global CVC froze the coffee sector and the lives of thousands of growers into \na business model geared toward increasing product standardization, ideal for a \ncommodity market (Andriani and Detoni, 2007). The way to break the trap of \ncommodity markets was twofold: by designing of knowledge management \napproach that transferred knowledge of consumption markets directly to the \nprovider of the ‘raw’ material and by providing a business channel that bypassed \nthe commodity markets and its bottleneck centred around the New York Coffee \nExchange.  \nThe network for the generation and dissemination of knowledge structured by \nillycaffè produced a lasting change in the culture of coffee production activities \nin Brazil, ultimately leading to the insertion of the country in the worldwide \nmarket for premium coffees. Considered as a whole, the strategic actions \n50      Ingrid Rauscher, Pierpaolo Andriani \nundertaken by the company to stimulate Brazilian producers to commit to \nproducing superior quality in coffee helped some of the players in the production \nchain to focus their efforts not only on the commodity market, where quantity \nalone is what matters, but also on new value-added markets that reward superior \nquality in coffee beans with higher prices. We can thus say that the illycaffè \nnetwork contributed to the emergence of a new paradigm for Brazilian coffee.  \nOther macro-economic reflexes of the strategic actions undertaken by the \ncompany in Brazil were the recovery of the image of Brazil as a country \nproducing specialty coffee, conquering international reputation, and access to \nnew markets both domestically and internationally. In the case of the new market \nconditions for fine Brazilian coffees, two facts deserve mention. First, the \nconcern illycaffè showed for the quality of Brazilian coffee created a new culture \nof espresso appreciation and consumption. It contributed to creating new habits \namong Brazilian consumers, and also opened the market to competitors who \ncame to Brazil to offer their products to the newfound consumers of special \ncoffees. The growing number of coffee bars spread out over large cities all over \nBrazil is evidence of the emergence of new coffee consuming patterns. Also, in \nthe specific case of illy espresso, for example, sales went from practically zero in \nthe early 90’s to the current 54 tons a year. Second, today there are dozens of \nspecial domestic and international coffee brands available in supermarkets as \nwell as coffee bars and many other places for consumers who want to enjoy a \ngood espresso and find out more about the different types of coffee. Regarding \nthe larger volume of espressos sold today, illycaffè always defended the idea that \nlarger sales are correlated with better quality products available for coffee lovers \n– that is why the company believes in ongoing investment in new technologies \nand initiatives to enhance quality in all phases of the production chain, from plant \nto cup.  \nFor rural producers, after the arrival of the Italian company and the creation of \nthe award for quality, a number of other contests were launched both by public \nand private institutions, all aiming to identify quality coffees. This is true for all \nproducing regions, both traditional and new areas mapped by illycaffè’s \npioneering contest. In fact, the contest was decisive for the emergence of new \nareas associated with quality in coffee, such as Cerrado Mineiro and Matas de \nMinas (formerly known as Zona da Mata, in the State of Minas Gerais); the \nMountains of the State of Espírito Santo; the Western regions in the State of \nBahia; the surroundings of the municipality of Piraju, in the State of São Paulo, \nand the States of Paraná and Goiás.  \nChapter 3. Illycaffè and the Brazilian espresso knowledge network      51 \nAmong the suppliers that are part of the illycaffè network in Brazil, one can \nsee market recognition for the quality concepts they chose to adhere to, and a \nnew status for being associated with a company whose name is synonymous with \npremium quality.  \nThe success of the strategic actions leading to the unfolding of the illycaffè \nnetwork in Brazil inspired the company to export the model to other countries \nwhere it also purchases fine coffees for the espresso blend it offers consumers \naround the world. Today, India and Colombia have their own version of a award \nthat recognizes superior quality in coffee and identifies suppliers and regions \nproducing fine coffees, with a view to develop a loyal base of producers who can \nmeet the high standards set by illycaffè and its consumers.  \nReferences \nAllen SL (2001) The devil’s cup: coffee, the driving force in history. Canongate Books, \nEdinburgh \nAndriani P, Detoni AF (2008) An interview with Ernesto Illy on complexity, coffee and \nManagement. Emergence: Complexity and Organization Vol. 10(1): 84–88 \nBenkler Y (2006) The wealth of networks: how social production transforms markets and \nfreedom. Yale University Press, New Haven and London. Available at: \nhttp:\/\/www.benkler.org\/Benkler_Wealth_Of_Networks.pdf Accessed on Feb. 20, \n2008 \nCACCER – Conselho das Associações dos Cafeicultores do Cerrado (The Council of \nCoffee Producer Associations of the Cerrado). História do conselho. (History of the \ncouncil). Available at: http:\/\/www.cafedocerrado.org\/br\/doc\/caccer_hist.pdf \nCastells M (2007) A sociedade em rede. A era da informação: economia, sociedade e \ncultura. (The networked society. The information era: economy, society and culture) \nV. 1, 10th edition. Paz e Terra, São Paulo \nDaviron B, Ponte S (2005) The coffee paradox: global markets, commodity trade and the \nelusive promise of development. Zed Books, London \nGranovetter M (1992) Problems of explanations in economic sociology. In Nohria N, \nEccles RG (eds) Networks and organizations: structure, form, and action. Harvard \nBusiness School Press, Cambridge, MA \nLuttinger N and Dicum G (2006) The coffee book: anatomy of an industry from crop to \nthe last drop. The New Press, New York \nWatts, D. 2003. Six Degrees: The Science of a Connected Age. Norton, New York \n"}