{"doi":"10.1186\/1748-5908-3-50","coreId":"177240","oai":"oai:aura.abdn.ac.uk:2164\/1223","identifiers":["oai:aura.abdn.ac.uk:2164\/1223","10.1186\/1748-5908-3-50"],"title":"Explaining the effects of an intervention designed to promote evidence-based diabetes care : a theory-based process evaluation of a pragmatic cluster randomised controlled trial","authors":["Francis, Jillian J","Eccles, Martin P.","Johnston, Marie","Whitty, Paula","Grimshaw, Jeremy M","Kaner, Eileen F. S.","Smith, Liz","Walker, Anne"],"enrichments":{"references":[{"id":427282,"title":"Attitude and the Attitude-Behavior Relation: Reasoned and Automatic Processes.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":188155,"title":"Constructing questionnaires based on the theory of planned behaviour. A manual for health services researchers. University of Newcastle upon Tyne: Centre for Health Services Research;","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":188149,"title":"Diabetes Mellitus Care. In Closing the Quality Gap: a critical analysis of quality improvement strategies.","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":188148,"title":"Diabetes Study (UKPDS) Group: Intensive bloodglucose control with sulphonylureas or insulin compared to conventional treatment and risk of complications in patients with type 2 diabetes (UKPDS 33). Lancet","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":188153,"title":"Do self-reported intentions predict clinicians' behaviour: a systematic review. Implement Sci","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":188150,"title":"Improving services for people with diabetes: lessons from setting up the DREAM trial. Practical Diabetes International","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":427285,"title":"Intrinsic motivation and self-determination in human behaviour","authors":[],"date":"1985","doi":null,"raw":null,"cites":null},{"id":188154,"title":"L: A cluster randomised controlled trial of a Diabetes Recall and Management system: the DREAM trial.","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":427283,"title":"Moderation of cognition-intention and cognition-behaviour relations: a meta-analysis of properties of variables from the theory of planned behaviour.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":427284,"title":"Orbell S: Evidence that intentions based on attitudes better predict behaviour than intentions based on subjective norms.","authors":[],"date":"1999","doi":null,"raw":null,"cites":null},{"id":188152,"title":"Salient beliefs and intentions to prescribe antibiotics for patients with a sore throat.","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":427281,"title":"SJ: Attitude-accessibility, attitude-behavior consistency, and the strength of the object-evaluation association.","authors":[],"date":"1982","doi":null,"raw":null,"cites":null},{"id":427287,"title":"SJH: Functional significance of psychological variables that are included in the theory of planned behaviour: A self-determination theory approach to the study of attitudes, subjective norms, perceptions of control and intentions.","authors":[],"date":"1998","doi":null,"raw":null,"cites":null},{"id":427286,"title":"The &quot;what&quot; and &quot;why&quot; of goal pursuits: Human needs and the self-determination of behavior. Psychological Inquiry","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":188147,"title":"The Acropolis Affirmation: Diabetes Care – St Vincent in Progress. Statement from the Saint Vincent Declaration meeting,","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":427288,"title":"the Evidencebased OutReach (EBOR) Trialists: A randomised trial of the effect of educational outreach by community pharmacists on prescribing in the UK General Practice.","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":427280,"title":"The expectancy-value muddle in the theory of planned behaviour – and some proposed solutions.","authors":[],"date":"2003","doi":null,"raw":null,"cites":null},{"id":188151,"title":"The Theory of Planned Behavior. Organ Behav Hum Decis Process","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":188156,"title":"The Theory of Planned Behaviour: A Review of Its Applications to Health-related Behaviours.","authors":[],"date":"1996","doi":null,"raw":null,"cites":null},{"id":427279,"title":"Understanding attitudes and predicting social behaviour Englewood Cliffs,","authors":[],"date":"1980","doi":null,"raw":null,"cites":null}],"documentType":{"type":1}},"contributors":["University of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Applied Health Sciences","University of Aberdeen, Medicine, Medical Sciences & Nutrition, Other Applied Health Sciences"],"datePublished":"2008-11-19","abstract":"Acknowledgements We are grateful to the health care professionals who participated in this study. This project was funded by the European Union as part of the ReBEQI project http:\/\/www.rebeqi.org. Jeremy Grimshaw holds a Canada Research Chair in Health Knowledge Transfer and Uptake. Eileen Kaner holds a Department of Health funded NHS Primary Care Career Scientist award.Peer reviewedPublisher PD","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n        \n            \n                oai:aura.abdn.ac.uk:2164\/1223<\/identifier><datestamp>\n                2018-01-05T20:42:07Z<\/datestamp><setSpec>\n                com_2164_632<\/setSpec><setSpec>\n                com_2164_364<\/setSpec><setSpec>\n                com_2164_330<\/setSpec><setSpec>\n                com_2164_705<\/setSpec><setSpec>\n                col_2164_633<\/setSpec><setSpec>\n                col_2164_706<\/setSpec>\n            <\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:doc=\"http:\/\/www.lyncode.com\/xoai\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n            \nExplaining the effects of an intervention designed to promote evidence-based diabetes care : a theory-based process evaluation of a pragmatic cluster randomised controlled trial<\/dc:title><dc:creator>\nFrancis, Jillian J<\/dc:creator><dc:creator>\nEccles, Martin P.<\/dc:creator><dc:creator>\nJohnston, Marie<\/dc:creator><dc:creator>\nWhitty, Paula<\/dc:creator><dc:creator>\nGrimshaw, Jeremy M<\/dc:creator><dc:creator>\nKaner, Eileen F. S.<\/dc:creator><dc:creator>\nSmith, Liz<\/dc:creator><dc:creator>\nWalker, Anne<\/dc:creator><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition, Institute of Applied Health Sciences<\/dc:contributor><dc:contributor>\nUniversity of Aberdeen, Medicine, Medical Sciences & Nutrition, Other Applied Health Sciences<\/dc:contributor><dc:subject>\nplanned behavior<\/dc:subject><dc:subject>\nself-determination<\/dc:subject><dc:subject>\nsubjective norms<\/dc:subject><dc:subject>\nintentions<\/dc:subject><dc:subject>\nattitudes<\/dc:subject><dc:subject>\nvariables<\/dc:subject><dc:subject>\nRA Public aspects of medicine<\/dc:subject><dc:subject>\nRA<\/dc:subject><dc:description>\nAcknowledgements We are grateful to the health care professionals who participated in this study. This project was funded by the European Union as part of the ReBEQI project http:\/\/www.rebeqi.org. Jeremy Grimshaw holds a Canada Research Chair in Health Knowledge Transfer and Uptake. Eileen Kaner holds a Department of Health funded NHS Primary Care Career Scientist award.<\/dc:description><dc:description>\nPeer reviewed<\/dc:description><dc:description>\nPublisher PDF<\/dc:description><dc:date>\n2011-02-21T15:53:01Z<\/dc:date><dc:date>\n2011-02-21T15:53:01Z<\/dc:date><dc:date>\n2008-11-19<\/dc:date><dc:type>\nJournal article<\/dc:type><dc:identifier>\nFrancis , J J , Eccles , M P , Johnston , M , Whitty , P , Grimshaw , J M , Kaner , E F S , Smith , L & Walker , A 2008 , ' Explaining the effects of an intervention designed to promote evidence-based diabetes care : a theory-based process evaluation of a pragmatic cluster randomised controlled trial ' Implementation Science , vol 3 , no. 50 . DOI: 10.1186\/1748-5908-3-50<\/dc:identifier><dc:identifier>\n1748-5908<\/dc:identifier><dc:identifier>\nPURE: 1159935<\/dc:identifier><dc:identifier>\nPURE UUID: 25cd5aaf-f27a-49f9-8acd-62d139f5561e<\/dc:identifier><dc:identifier>\nWOS: 000265156000001<\/dc:identifier><dc:identifier>\nScopus: 57649219805<\/dc:identifier><dc:identifier>\nhttp:\/\/hdl.handle.net\/2164\/1223<\/dc:identifier><dc:identifier>\nhttp:\/\/dx.doi.org\/10.1186\/1748-5908-3-50<\/dc:identifier><dc:language>\neng<\/dc:language><dc:relation>\nImplementation Science<\/dc:relation><dc:rights>\nhttp:\/\/www.biomedcentral.com\/about\/license<\/dc:rights><dc:format>\n11<\/dc:format>\n<\/oai_dc:dc>\n<\/metadata>\n        <\/record>","journals":[{"title":null,"identifiers":["issn:1748-5908","1748-5908"]}],"language":{"code":"en","id":9,"name":"English"},"relations":["Implementation Science"],"year":2008,"topics":["planned behavior","self-determination","subjective norms","intentions","attitudes","variables","RA Public aspects of medicine","RA"],"subject":["Journal article"],"fullText":"BioMed CentralImplementation Science\nssOpen AcceResearch article\nExplaining the effects of an intervention designed to promote \nevidence-based diabetes care: a theory-based process evaluation of \na pragmatic cluster randomised controlled trial\nJillian J Francis*1, Martin P Eccles2, Marie Johnston3, Paula Whitty2, \nJeremy M Grimshaw4, Eileen FS Kaner5, Liz Smith6 and Anne Walker1\nAddress: 1Health Services Research Unit, University of Aberdeen, Aberdeen, UK, 2Institute of Health and Society, Newcastle University, Newcastle \nupon Tyne, UK, 3College of Life Sciences and Medicine, University of Aberdeen, Aberdeen, UK, 4Clinical Epidemiology Program, Ottawa Health \nResearch Institute and Department of Medicine, University of Ottawa, Ontario, Canada, 5Faculty of Medical Sciences, Newcastle University, \nNewcastle upon Tyne, UK and 6Manchester Business School, University of Manchester, Manchester, UK\nEmail: Jillian J Francis* - j.francis@abdn.ac.uk; Martin P Eccles - Martin.Eccles@newcastle.ac.uk; Marie Johnston - m.johnston@abdn.ac.uk; \nPaula Whitty - p.m.whitty@ncl.ac.uk; Jeremy M Grimshaw - jgrimshaw@ohri.ca; Eileen FS Kaner - E.F.S.Kaner@newcastle.ac.uk; \nLiz Smith - liz.smith@mbs.ac.uk; Anne Walker - anne_walker@yahoo.co.uk\n* Corresponding author    \nAbstract\nBackground: The results of randomised controlled trials can be usefully illuminated by studies of the processes by\nwhich they achieve their effects. The Theory of Planned Behaviour (TPB) offers a framework for conducting such studies.\nThis study used TPB to explore the observed effects in a pragmatic cluster randomised controlled trial of a structured\nrecall and prompting intervention to increase evidence-based diabetes care that was conducted in three Primary Care\nTrusts in England.\nMethods: All general practitioners and nurses in practices involved in the trial were sent a postal questionnaire at the\nend of the intervention period, based on the TPB (predictor variables: attitude; subjective norm; perceived behavioural\ncontrol, or PBC). It focussed on three clinical behaviours recommended in diabetes care: measuring blood pressure;\ninspecting feet; and prescribing statins. Multivariate analyses of variance and multiple regression analyses were used to\nexplore changes in cognitions and thereby better understand trial effects.\nResults: Fifty-nine general medical practitioners and 53 practice nurses (intervention: n = 55, 41.98% of trial participants;\ncontrol: n = 57, 38.26% of trial participants) completed the questionnaire. There were no differences between groups in\nmean scores for attitudes, subjective norms, PBC or intentions. Control group clinicians had 'normatively-driven'\nintentions (i.e., related to subjective norm scores), whereas intervention group clinicians had 'attitudinally-driven'\nintentions (i.e., related to attitude scores) for foot inspection and statin prescription. After controlling for effects of the\nthree predictor variables, this group difference was significant for foot inspection behaviour (trial group × attitude\ninteraction, beta = 0.72, p < 0.05; trial group × subjective norm interaction, beta = -0.65, p < 0.05).\nConclusion: Attitudinally-driven intentions are proposed to be more consistently translated into action than\nnormatively-driven intentions. This proposition was supported by the findings, thus offering an interpretation of the trial\neffects. This analytic approach demonstrates the potential of the TPB to explain trial effects in terms of different\nrelationships between variables rather than differences in mean scores. This study illustrates the use of theory-based\nprocess evaluation to uncover processes underlying change in implementation trials.\nPublished: 19 November 2008\nImplementation Science 2008, 3:50 doi:10.1186\/1748-5908-3-50\nReceived: 1 May 2006\nAccepted: 19 November 2008\nThis article is available from: http:\/\/www.implementationscience.com\/content\/3\/1\/50\n© 2008 Francis et al; licensee BioMed Central Ltd. \nThis is an Open Access article distributed under the terms of the Creative Commons Attribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), \nwhich permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited.Page 1 of 11\n(page number not for citation purposes)\nImplementation Science 2008, 3:50 http:\/\/www.implementationscience.com\/content\/3\/1\/50Background\nThere is broad, international agreement over what consti-\ntutes high quality health care for people with diabetes\n[1,2]. In the UK, this has been enshrined in a National\nService Framework for people with diabetes [3]. However,\nthe most efficient method of delivering care remains\nunclear [4]. A recent systematic review [4] of quality\nimprovement interventions to improve the quality of care\nin patients with diabetes showed that a range of different\ninterventions resulted in small to modest improvements\nin glycaemic control and in provider adherence to optimal\ncare. However it also identified important methodologi-\ncal concerns, including evidence of publication bias.\nGiven the variety of possibly effective interventions, it\nmay be instructive to focus on possible mechanisms\nunderlying intervention effects, with the goal of identify-\ning how such interventions may work. This type of process\nevaluation can lead to the identification of general princi-\nples that will help to optimise interventions. The study\nreported here was a theory-based process evaluation of a\npragmatic cluster randomised controlled trial design. The\ntrial evaluated the effectiveness and efficiency of an area\nwide 'extended' computerised diabetes register incorpo-\nrating a full structured recall and management system,\nactively involving patients and including individualised\npatient management prompts to primary care clinicians\nbased on locally-adapted evidence-based guidelines.\nThree Primary Care Trusts (PCTs) (geographically based\norganisational units that are directly responsible for\nhealth care) served by a district hospital-based diabetes\nregister had produced improvements in the quality of\ncare, but performance had later plateaued leaving scope\nfor further improvement. The opportunity arose to extend\nthe computerised diabetes register to a full structured\nrecall and management system.\nThe development and implementation of the Diabetes\nRecall and Management System (DREAM) intervention\nhas been described in detail elsewhere [5,6]. In summary,\nthe pre-existing diabetes register functioned as a central\nregister of patients with diabetes. A structured dataset was\ncompleted on paper forms and returned to the central reg-\nister; from these data, both patient-specific and aggregated\ninformation were provided annually to patients and clini-\ncians. This system was enhanced in five ways. The software\nwas enhanced by incorporating locally adapted national\nevidence-based guidelines. The functionality of the system\nwas enhanced to provide: automated prompts to patients\nand primary care clinicians that a review consultation was\nnecessary; a structured management sheet (including\npatient-specific management suggestions); an enhanced\nmonitoring system to follow up reasons for non-attend-\nance from both patients and clinicians and to re-schedule\nappointments, based on non-return of a completed man-\nagement sheet; and patient feedback for patients in pri-\nmary care. Because of difficulties operating this element of\nthe software, it was not possible to run the final feature\nduring the lifetime of the trial.\nAlongside this trial, a process evaluation study was con-\nducted. In the literature about randomised controlled tri-\nals, process evaluation may focus on one or more of three\ngroups of issues:\n1. Quality control, fidelity, or coverage (i.e., was the inter-\nvention successfully and consistently implemented?).\n2. Acceptability of the intervention from the participants'\nperspective.\n3. Explanatory modelling: an exploration of processes\nunderlying change (or lack of change) following a success-\nfully implemented intervention.\nThe study reported here investigated the third of these:\nprocesses underlying change or lack of change to assess\npossible reasons for the success or lack of success of the\nintervention. The evaluation was based on the Theory of\nPlanned Behaviour (TPB) [7]. The TPB proposes a model\nabout how human action is guided. It predicts the occur-\nrence of a specific behaviour, provided that the behaviour\nis intentional (i.e., the model does not claim to predict\nbehaviours that are habitual or automatic). The model is\nincreasingly being used to predict intentions and behav-\niour with respect to clinical actions [8]. The TPB model is\ndepicted in Figure 1 and represents the three cognitive var-\niables that the theory suggests will predict the intention,\nwhich is the precursor of behaviour. Because this process\nevaluation was conducted at the end of the intervention\nperiod, we do not claim that the cognitive variables\ncaused a change in behaviour. We distinguish between\nprediction –, something that researchers do when they\nknow one score (e.g., attitude) and want to estimate\nanother (e.g., intention) – and causation (i.e., when one\nfactor is brought about by another, independently of\nwhether the factors are measured). By using a model\nwhich is predictive in this sense, we may illuminate proc-\nesses underlying the trial results.\nThe TPB is predicated on careful specification of the\nbehaviour under investigation. The behaviour is defined\nin terms of its target, action, context and time (TACT). For\nexample, for the clinical behaviour of measuring a\npatient's blood pressure, the target is the patient; the\naction is taking the blood pressure reading; the context is\nthe clinical consultation; and the time may be expressed\nin terms of frequency (e.g., every time the patient visits the\nsurgery; at least once every six months) or delay (e.g., atPage 2 of 11\n(page number not for citation purposes)\nImplementation Science 2008, 3:50 http:\/\/www.implementationscience.com\/content\/3\/1\/50the patient's next routine visit to the surgery; within the\nnext six months). In the current study, three behaviours\nwere identified from the clinical guidelines used in the\nDREAM Trial as being central in the management of Type\n2 diabetes: measuring blood pressure, inspecting feet, and\nprescribing statins (to lower cholesterol). As data about\nactual behaviour were not available at the level of the\nindividual clinician (but only at the level of primary care\npractices), we used the measure of intention as the\ndependent variable for this process evaluation. A recent\nsystematic review concluded that intention is an appropri-\nate proxy measure of individual behaviour [9].\nThe findings of the trial are reported elsewhere [10], but\nthe findings relevant to these three behaviours were: first,\npatients in intervention practices were significantly more\nlikely than patients in control practices to have a recording\nof having had either a foot check or a measurement of\nblood pressure but not a measurement of serum choles-\nterol; and second, the mean cholesterol level in patients\nfrom intervention practices was significantly lower than in\ncontrol practices, but there was no difference between\nintervention and control groups in the levels of blood\npressure recorded.\nThe aim of this study was to elucidate the cognitions of\nhealth professionals that underlay these selected clinical\nbehaviours. We did this in two ways: first, by testing for\ndifferences in cognitions between the intervention and\ncontrol groups of the trial and second, by identifying the\npatterns of association within each trial group and com-\nparing these with effects of the intervention on clinical\npractice [10].\nMethods\nDevelopment of the questionnaire\nThe three 'predictor' variables in the TPB are attitudes\n(being in favour of, or against doing something); subjec-\ntive norms (perceived pressure from social sources to do,\nor not to do something); perceived behavioural control,\nor PBC (perception of having, or not having control over\nthe behaviour). They may be measured 'directly' by asking\nresponders to summarise their overall attitude, perceived\npressure and so on, or 'indirectly', by asking responders\nabout specific beliefs and combining the answers in a\nmanner specified by the theory [7]. According to the TPB,\nwhen using direct measures in a regression analysis to pre-\ndict intention, adding the indirect measures should not\nincrease the level of prediction. However, we included\nThe theory of planned behaviour (Ajzen, 1991)Figure 1\nThe theory of planned behaviour (Ajzen, 1991). Attitude = being in favour of, or against, doing something (the behav-\niour). Subjective norm = perceived pressure to do, or not to do, the behaviour. Perceived Behavioural Control = perception of \nhaving, or not having, control over the behaviour.\nATTITUDE \n(Behavioural beliefs \nweighted by Outcome \nevaluations) \nBEHAVIOURAL \nINTENTION \nPERCEIVED \nBEHAVIOURAL \nCONTROL\n(Control beliefs weighted \nby Influence of control \nbeliefs) \nBEHAVIOUR \nSUBJECTIVE NORM \n(Normative beliefs \nweighted by Motivation \nto comply) Page 3 of 11\n(page number not for citation purposes)\nImplementation Science 2008, 3:50 http:\/\/www.implementationscience.com\/content\/3\/1\/50both measures in the questionnaire to test this part of the\ntheory, because direct and indirect measurement\napproaches make different assumptions about the under-\nlying cognitive structures [11]. Briefly, indirect measures\nare based on responses to items about specific beliefs and\nscores are then combined by the researcher. The assump-\ntions are that the method used for combining responses\n(weighting and then averaging the scores) reflects the\nmethods that individuals use when forming, for example,\nan attitude, and that all relevant beliefs have been repre-\nsented among the questionnaire items. Direct measure-\nment effectively asks individuals themselves to combine\nthe separate beliefs. It does not rely on the assumption\nthat all relevant beliefs have been represented in the ques-\ntionnaire but assumes that people can accurately combine\nand report a global attitude, subjective norm, and per-\nceived level of control over the behaviour in question. The\nconstruction of the measures of the three predictor varia-\nbles and of intention was based on standard practice in\nthe field including the advice of researchers [7,11-13].\nTo construct the indirect measures we first conducted a\nqualitative study. A member of the research team (LS)\ninterviewed 12 general practitioners (GPs) and practice\nnurses not involved in the DREAM trial about the behav-\niours under investigation. We designed the schedule for\nthese semi-structured interviews to elicit responders'\nbeliefs relating to the constructs of the TPB. Both GPs and\npractice nurses were encouraged to talk freely about these\nbeliefs, and any ambiguities were clarified using appropri-\nate prompts. Interviews were tape recorded and tran-\nscribed. Answers to questions were entered into response\ntables. We identified the most frequently mentioned\nbeliefs and used them to develop items for indirect meas-\nurement of the three predictor variables.\nWe developed a questionnaire for each of the three behav-\niours. The response format for all items was a seven-point\nLikert-type scale, from 1 (strongly agree) to 7 (strongly\ndisagree). We pre-tested this initial draft of the question-\nnaire with six GPs not involved in the DREAM trial for\nstyle and clarity of content and to determine completion\ntime. Minor revisions of wording were made to the ques-\ntionnaire in the light of their comments. Responses were\nexplored for range, and items with low variance were\neliminated from the final questionnaire, because they\nwould be unlikely to discriminate within the analysis. The\nfinal questionnaire consisted of 154 items, including\nquestions about the size of practices and demographic\ndetails. Sample questions are presented in Table 1; the full\nquestionnaire is available as Additional file 1.\nProcedure\nThe questionnaire was mailed to all 280 GPs and practice\nnurses in the DREAM trial. Two reminder letters were sent\nto non-responders at fortnightly intervals.\nPsychometric properties of the questionnaire\nInternal consistency coefficients were calculated for the\nintention measure and for the direct measure of attitude,\nfor each of the three behaviours. Coefficient alpha was sat-\nisfactory (between 0.87 and 0.98). Direct measures of sub-\nTable 1: Sample questionnaire items for the constructs relating to measuring blood pressure.\nConstruct Sample item\nAttitude (direct) Overall I think measuring these patients' blood pressure is beneficial to them\nAttitude (indirect)\n(If I measure a patient's blood pressure, I will detect any problems at an early stage) × (Detecting any \nproblems at an early stage is very important)\nSubjective norm (direct) People who are important to me think that I should measure the blood pressure of my patients with \ndiabetes\nSubjective norm (indirect)\n(Patients would approve of me measuring their blood pressure) × (Patients' approval of my practice is of \nimportance to me)\nPerceived behavioural control (direct) Measuring patients' blood pressure is easy\nPerceived behavioural control (indirect) (If the patient has high blood pressure they think they have another illness as well as diabetes) × (If the \npatients did not see raised blood pressure as a separate illness to diabetes I would be more likely to \nmeasure their blood pressure)\nIntention I intend to measure the blood pressure of most of the patients' with diabetes that I see during the next \nmonthPage 4 of 11\n(page number not for citation purposes)\nImplementation Science 2008, 3:50 http:\/\/www.implementationscience.com\/content\/3\/1\/50jective norm and perceived behaviour control were two-\nitem measures, and so consistency was assessed using\nPearson's correlation coefficients. Using a criterion for\nacceptability of r > 0.25, internal consistency was high (r\n> 0.4) for the measures of subjective norms and mixed\n(two coefficients close to zero) for the measures of PBC. It\nis not appropriate to use an internal consistency criterion\nfor assessing the reliability of indirect measures, as the\nobjective in using these measures is to sample a diverse\nrange of beliefs [11].\nBecause the two PBC items did not have adequate internal\nconsistency, it was not valid to combine these scores for\nthe main analysis. We selected one item ('Overall, I feel\nthat I can [do X]') to represent PBC for the analysis as it\nwas more consistently related to the other TPB variables\nacross the three behaviours.\nIndirect measures were computed using the 'multiplica-\ntive composite' approach suggested by Ajzen and Fishbein\n[13]. That is, the score for each belief was multiplied by\nthe score of its perceived importance weight (see Figure 1)\nand the resulting products were summed to give a total\nscore for attitude, subjective norms, and PBC for each of\nthe three behaviours. For direct and indirect measures,\nscores were scaled so that a low score always indicated a\nmore positive attitude, intention, etc.\nThere is considerable debate in the TPB literature about\nwhether to use response scales of 1 to 7 or -3 to +3 in the\nmultiplicative composite approach (e.g., French and\nHankins [14]). As the questionnaire was lengthy, we\ndecided, on a pragmatic basis, to use a consistent 1–7\nresponse format to minimise responder fatigue.\nResults\nNon-response Analysis\nFigure 2 presents the response rates for the survey relative\nto the trial, for the intervention and control groups. Over-\nall, the individual response rate was 40.0% (intervention:\n42.6%; control: 37.7%). The practice level response rate\n(at least one responder in the practice) was 81.0% (inter-\nvention: 82.1%; control: 80.0%). We used a series of chi-\nsquare analyses to compare responders and non-respond-\ners on variables that could be accessed for non-respond-\ners. These showed no associations with trial group,\nregister, gender, professional role, or working in a training\npractice (all p > 0.05). However, responders had been\nqualified for significantly longer than non-responders (M\n= 22.46 years and M = 18.92 years, respectively; 95% con-\nfidence interval for mean difference: 0.42 – 6.66).\nChi-square analyses of responders showed no association\nbetween trial group (intervention versus control) and the\nfollowing variables: diabetes register, number of GPs in\nthe practice, number of nurses in the practice, prescribing\nstatus of nurses, and years since qualified (all p > 0.3).\nNevertheless, as this was a process evaluation of a trial, the\nremaining descriptive analyses were conducted separately\nfor intervention and control participants.\nInitial analyses\nBivariate correlations between the direct measures for\neach of the three behaviours are presented, separately for\nthe intervention and control groups, in Table 2. Means,\nstandard deviations, and correlations between the direct\nand indirect measures of the same construct are also\nincluded. These correlations may be used to assess the\ncontent validity of the indirect measures. If the indirect\nmeasures were individually relevant and together ade-\nquately represented the range of beliefs, this should result\nin moderate-to-strong positive correlations between direct\nand indirect measures. Using this criterion, validity of the\nindirect measures was acceptable for attitudes and subjec-\ntive norms, but questionable for PBC. That is, it is possible\nthat, to create a questionnaire of acceptable length, we\nmay have excluded important control beliefs that influ-\nence clinicians' perceptions of control over these behav-\niours.\nGroup differences in TPB variables: Multiple analyses of \nvariance (MANOVAs)\nTo identify factors affecting the mean values of the TPB\nvariables, a series of MANOVAs were conducted. For each\nof the three behaviours under investigation, intention and\ndirect measure scores for the three predictor variables were\nentered as dependent variables. Three designs were used:\nTrial group (intervention; control) × job title (GP; nurse)\n× PCT)\nTrial group (intervention; control) × practice size (< 4\nGPs; ≥ 4 GPs)\nTrial group (intervention; control) × years since qualified\n(≤ 23 years; > 23 years)\nThere was no main effect of trial group and no interaction\neffects involving trial group on the profile of TPB scores.\nThat is, the intervention appears to have had no effect on\nscores for attitudes, subjective norms, PBC, or intentions.\nHowever, there was a main effect of practice size on inten-\ntions. Responders (both GPs and nurses) in smaller prac-\ntices had stronger intentions to measure blood pressure.\nIn addition, there was a main effect of job title (GP; nurse)\non cognitions. Nurses had more positive intentions and\nattitudes than GPs for measuring BP and examining feet.\nThe pattern for statins was reversed, with GPs reporting\nstronger intentions, more positive attitudes, and also\ngreater PBC than nurses. This again lends support to thePage 5 of 11\n(page number not for citation purposes)\nImplementation Science 2008, 3:50 http:\/\/www.implementationscience.com\/content\/3\/1\/50criterion validity of the PBC item, as it would be expected\nthat nurses, most of whom are not eligible to prescribe,\nwould report lower control over prescribing behaviour.\nNo other main effects or interaction effects were signifi-\ncant in the MANOVAs.\nPredicting intention: Regression analyses\nA multiple linear regression analysis on intentions for\neach of the three behaviours was carried out separately for\nthe intervention and control groups (Table 3). At the first\nstep, the direct measures of Attitude, Subjective Norm,\nand PBC were entered; indirect measures were entered at\nthe second step. This was to check whether the solution\nwould change depending on which method of measure-\nment (direct or indirect) was used. In the intervention\ngroup, the addition of indirect measures did not improve\nprediction of intention for any of the three behaviours. In\nthe control group, the addition of indirect measures did\nnot improve prediction of intention to prescribe statins or\nto examine feet. However, prediction of intention to\nmeasure blood pressure did improve when indirect meas-\nures were added (R2 change = 0.14, p < 0.05). The signifi-\ncant predictor at the second step was attitude (indirect), β\n= 0.47, p = .002. Although this finding relates to only one\nIndividual-level and [practice-level] response rates, DREAM surveyFigure 2\nIndividual-level and [practice-level] response rates, DREAM survey.Page 6 of 11\n(page number not for citation purposes)\nImplementation Science 2008, 3:50 http:\/\/www.implementationscience.com\/content\/3\/1\/50of six regression analyses performed, it suggests the possi-\nbility that clinicians in the control group and intervention\ngroup may have been thinking about their beliefs and\nintentions in different ways.\nWe performed a second series of hierarchical regression\nanalyses, with professional (GP or nurse) and practice size\n(< 4 GPs; ≥ 4 GPs) entered at the first step and the direct\nTPB measures entered at the second step. After controlling\nfor job title and practice size, the TPB predictor variables\nagain significantly added to the variance in intention\nexplained, and the patterns of significant predictors were\nsimilar to the first set of analyses. This finding was consist-\nent in both the control and intervention group for all\nthree behaviours.\nInterpreting trial effects\nTable 3 shows a consistent pattern that may represent an\neffect of the intervention. Specifically, for inspecting feet\nand prescribing statins there was a trend for intentions to\nbe predicted most strongly by subjective norms in the con-\ntrol group and by attitudes in the intervention group. To\ndetermine whether these trends were reliable, two further\nhierarchical regression analyses were performed in which\nthe interactions between trial group and attitude, and\nbetween trial group and subjective norm, were entered in\nthe second step (Table 4). In the analysis relating to the\ninspection of feet, intention was predicted not only by the\nmain effect of subjective norm (β = 0.97) but also by both\ninteractions. The directions of the interaction effects indi-\ncate that subjective norm was a stronger predictor of\nintention in the control group than in the intervention\ngroup. Conversely, attitude was a stronger predictor of\nTable 2: Means, standard deviations (SD), and correlations between the predictor variables (direct measures) and intention scores and \nindirect measures, for each of the three behaviours, computed separately for the intervention and control groups.\nControl Group: Direct Measures Intervention group: Direct Measures\nAttitude Subj Norm PBC Attitude Subj Norm PBC\nMeasuring Blood Pressure\nSubjective Norm 0.52** - 0.25 -\nPBC 0.56** 0.36** - 0.15 0.25 -\nIntention 0.47** 0.21 0.47** 0.28* 0.07 0.39**\nIndirect Measure 0.57** 0.43* 0.29* 0.34* 0.39* -0.07\nMean (sd) 1.62(0.67) 2.62(1.33) 2.69(1.81) 1.41(0.63) 2.22(1.32) 2.70(1.97)\nFoot examination\nSubjective Norm 0.63** - 0.49** -\nPBC 0.26 0.22 - 0.12 0.25 -\nIntention 0.61** 0.77** 0.33* 0.28* 0.48** 0.14\nIndirect Measure 0.70** 0.66* -0.03 0.64* 0.54* 0.13\nMean (sd) 2.12(0.91) 2.99(1.44) 3.00(1.51) 1.96(1.09) 2.64(1.43) 3.04(1.73)\nPrescribing statins\nSubjective Norm 0.52** - 0.61** -\nPBC 0.50** 0.52** - 0.44** 0.56** -\nIntention 0.31* 0.48** 0.44** 0.42* 0.36** 0.41**\nIndirect Measure 0.37** 0.52* 0.32* 0.28* 0.36* 0.07\nMean (sd) 2.44(1.12) 2.94(1.27) 2.83(1.54) 2.19(1.12) 2.66(1.39) 2.62(1.52)\n*p < 0.05, **p < 0.01.\nPBC = Perceived Behavioural Control; Subj Norm = Subjective Norm.\nLower mean scores reflect stronger positive attitudes towards the behaviour, stronger perceived social pressure to enact the behaviour and \ngreater perceived control over the behaviour.Page 7 of 11\n(page number not for citation purposes)\nImplementation Science 2008, 3:50 http:\/\/www.implementationscience.com\/content\/3\/1\/50intention in the intervention group than in the control\ngroup. Neither interaction term was significant in the\nanalysis predicting intention to prescribe statins.\nDiscussion\nThis study was a theory-based process evaluation under-\ntaken to investigate the cognitive processes underlying\ntrial effects. In addition, extraneous variables that may\naffect clinicians' cognitions and behaviour were investi-\ngated, and patterns of clinical behaviours were explored.\nResults are discussed below in four sections: trial effects;\neffects of demographic factors on cognitions about clini-\ncal behaviours; limitations of the study; and general con-\nclusions.\nTrial effects\nIn the context of the effect of interventions on cognitive\nvariables, there are two possible types of effect. First, an\nintervention may alter the mean values of scores on pre-\ndictor variables. Second, an intervention may alter the\nrelationships between the cognitive predictor variables\nand an outcome, in this case, intentions. It appears that\nthe effect of the intervention in the DREAM trial was of the\nsecond kind. With respect to inspecting feet, subjective\nnorms were more strongly related to intention in the con-\ntrol group than in the intervention group, and attitudes\nwere more strongly related to intention in the interven-\ntion group than in the control group. Thus, at the end of\nthe intervention, intentions to inspect feet were 'norma-\ntively-driven' in the control group but 'attitudinally-\ndriven' in the intervention group.\nTable 3: Results of regression analyses on intentions for three behaviours, with direct measures entered at Step 1 and indirect \nmeasures entered at Step 2, for control and intervention groups.\nDependent variable Independent variables Step 1 Step 2\nControl Group\nβ R Adj R2 R2 change R2\nIntention to measure blood pressure Attitude 0.28\nSubjective -0.09\nNorm 0.39*\nPBC 0.56*** 0.28 0.14* 0.42\nIntention to inspect feet Attitude 0.17\nSubjective 0.67***\nNorm 0.16\nPBC 0.80*** 0.64 0.03 0.67\nIntention to prescribe statins Attitude 0.04\nSubjective 0.41*\nNorm 0.13\nPBC 0.50** 0.20 0.06 0.26\nIntervention Group\nIntention to measure blood pressure Attitude 0.28*\nSubjective -0.13\nNorm 0.50***\nPBC 0.56*** 0.27 0.01 0.28\nIntention to inspect feet Attitude 0.54***\nSubjective 0.21\nNorm 0.02\nPBC 0.67*** 0.42 0.03 0.45\nIntention to prescribe statins Attitude 0.33*\nSubjective 0.06\nNorm 0.40**\nPBC 0.62*** 0.34 0.03 0.37\n*p < 0.05, **p < 0.01, ***p < 0.001\nPBC = Perceived behavioural control.Page 8 of 11\n(page number not for citation purposes)\nImplementation Science 2008, 3:50 http:\/\/www.implementationscience.com\/content\/3\/1\/50There are a number of possible explanations for how the\nintervention might have strengthened the attitude-inten-\ntion relationship. It could be that clinicians became more\nfamiliar with the content of the guideline by receiving the\nintervention, and that this familiarity (or additional\nknowledge) strengthened the consistency between atti-\ntudes and intentions. In addition, when attitudes are\nbased on direct experience, they are more likely to be\nbrought to mind in the relevant context [15]. Further-\nmore, it may be that the systematic application of the\nguideline in terms of prompts relating to specific patients\nmade the importance of key clinical indicators more sali-\nent. For all of these possibilities, attitudes would super-\nsede subjective norms as the primary predictor of\nintentions.\nThere is empirical evidence that attitudinally-driven\nintentions are more likely to be translated into action than\nnormatively-driven intentions [16-18]. This has been\nexplained by reference to self-determination theory [19],\nwhich distinguishes between self-determined (or intrinsi-\ncally motivated) and externally controlled regulation of\nintention. Within this framework, attitudes represent\ninternal pressure (one's own views), whereas subjective\nnorms represent external pressure (the perceived views of\nothers), to act. Self-determination theory proposes that\ninternalised motivation is related to the stability of inten-\ntions and is a better predictor of behaviour than motiva-\ntion arising from external sources [20,21].\nThe implication of this in the context of the DREAM trial\nis as follows. On the basis of these findings, we would\nexpect higher levels of foot inspection to be recorded in\nthe intervention group than in the control group. This is\nwhat was found in the trial. Thus, the results of the current\nstudy support the principle that attitudinally-driven\nintentions are better translated into action than are norm-\natively-driven intentions. A further key trial effect (low-\nered cholesterol among participants in the intervention\ngroup) was possibly related to the trend (albeit non-sig-\nnificant in our analysis) for statin prescription also to be\nattitudinally-driven (i.e., internally motivated) in the\nintervention group.\nA strength of this study was that we investigated three\nbehaviours among the same population at the same time.\nThis enabled us to compare and contrast patterns of pre-\ndiction across the behaviours. The three selected behav-\niours were strongly contrasting: the measurement of\nblood pressure is a frequently enacted behaviour (inten-\ntion data in this study showed restricted range and possi-\nble ceiling effects); the inspection of feet is a clinical\naction that both physicians and their practice nurses are\nqualified to do (although our data showed that cognitions\nof the two professional groups tend to be different); and\nthe prescription of statins is restricted to physicians and a\nsmall proportion of nurses. Yet the TPB was effective in\npredicting intentions to do these contrasting behaviours,\nsuggesting that the model was stable across a range of\nbehaviours\nEffects of demographic factors\nDemographic factors appeared to affect cognitions about\nclinical behaviours. As may be expected from the different\nresponsibilities assigned to different roles, professional\nrole (GP versus nurse) influenced cognitions. Nurses had\nstronger positive attitudes and intentions to measure\nblood pressure and inspect feet, whereas for prescribing\nstatins, GPs had stronger attitudes, perceived control, and\nintentions. This would be expected and supports the\nvalidity of the measurement instruments.\nTable 4: Results of regression analyses (n = 112) on intentions to inspect feet and intentions to prescribe statins, with direct measures \nentered at Step 1 and the interaction between direct measures and trial group entered at Step 2.\nDependent variable Independent variables Step 1 Step 2\nβ R Adj R2 β R2 change R2\nIntention to inspect feet Attitude 0.42*** -0.21\nSubjective Norm (SN) 0.38*** 0.97***\nPBC 0.06 0.08\n0.71*** 0.48\nTrial group × Attitude 0.72*\nTrial group × SN -0.65* 0.03* 0.51\nIntention to prescribe statins Attitude 0.09\nSubjective Norm 0.67**\nPBC 0.16\n0.52*** 0.25 0.02 0.27\n*p < 0.05, **p < 0.01, ***p < 0.001. PBC = Perceived behavioural control. Control group coded '0; intervention group coded '1'.Page 9 of 11\n(page number not for citation purposes)\nImplementation Science 2008, 3:50 http:\/\/www.implementationscience.com\/content\/3\/1\/50A further demographic effect was practice size. In smaller\npractices, GPs and nurses had stronger intentions to meas-\nure blood pressure, and GPs had stronger intentions to\nprescribe statins. This is consistent with the results of a\nprevious trial that tested the effects of educational out-\nreach in a primary care setting [22], and suggests that a\nfruitful approach to exploring the implementation of evi-\ndence-based practice could include an investigation of\norganisational factors in relation to practice size.\nLimitations\nThis study had a number of limitations. First, although the\nnon-response analysis indicated that the sample was rep-\nresentative in all but one of the measured variables\n(number of years since professional qualification), the\nresponse rate was low (40% at the individual level; 81%\nat the practice level). It is also possible that some respond-\ners were completing the questionnaire on behalf of other\npractice staff and this would introduce measurement\nerror. Second, the items measuring PBC had poor psycho-\nmetric properties, and so their reliability is uncertain.\nThird, TPB constructs were measured only once – after the\nintervention. However, randomisation of primary care\npractices to the intervention and control groups in the\ntrial should have resulted in similar cognitions between\ngroups before the intervention took place. Finally, as the\nprocess evaluation study sampled only three clinical\nbehaviours out of all the appropriate behaviours relating\nto this complex intervention, there may have been other\nmechanisms underlying trial effects that were not detected\nby this study. For example, it may have been that the auto-\nmated prompts to patients and clinicians regarding the\nneed for a review consultation resulted in increased con-\ncordance in interactions between patients and clinicians\nand that this increased patients' involvement in the man-\nagement of their condition.\nConclusion\nThis theory-based process evaluation of the DREAM trial\nexplored cognitions about three clinical behaviours relat-\ning to the management of diabetes to identify possible\neffects of the trial intervention on cognitions, including\nintentions. Independently of whether participants were in\nthe intervention group or control group, professional role\nand practice size influenced attitudes, PBC, and inten-\ntions. This suggests that interventions that are directed to\nentire practices or health care teams may have different\neffects on individuals within those teams and across dif-\nferent organisational structures. Finally, it appears that the\nintervention strengthened the link between attitudes and\nintentions towards inspecting feet, with similar non-sig-\nnificant trends in cognitions about prescribing statins.\nThis stronger link between internal pressures (attitudes)\nand intentions than between external pressures (subjec-\ntive norms) and intentions was associated with trial out-\ncomes. This lends support to the principle that when\nintentions are driven by attitudes rather than perceived\nsocial pressure, those intentions are more likely to be\ntranslated into action. Thus, understanding the difference\nbetween attitudes and subjective norms allowed us to\nunderstand some of the intervention effects. This study\nthus illustrates the use of theory-based process evaluation\nto uncover processes underlying change in implementa-\ntion trials.\nCompeting interests\nThe authors declare that they have no competing interests.\nAuthors' contributions\nMPE, AW, JMG and MJ developed the idea for the study.\nMPE, AW, LS, MJ and PW developed the instruments and\nconducted the data collection. JJF, MPE, MJ, conducted\nthe analyses. JJF, MPE, MJ, PW, JMG and EK contributed\nto the interpretation of the analyses and the drafting of the\npaper. All authors have seen and approved the final draft.\nAdditional material\nAcknowledgements\nWe are grateful to the health care professionals who participated in this \nstudy.\nThis project was funded by the European Union as part of the ReBEQI \nproject http:\/\/www.rebeqi.org. Jeremy Grimshaw holds a Canada Research \nChair in Health Knowledge Transfer and Uptake. Eileen Kaner holds a \nDepartment of Health funded NHS Primary Care Career Scientist award.\nReferences\n1. The Acropolis Affirmation: Diabetes Care – St Vincent in\nProgress. Statement from the Saint Vincent Declaration\nmeeting, Athens, Greece, march 1995.  Diabetic Med 1995,\n12:636.\n2. UK Prospective Diabetes Study (UKPDS) Group: Intensive blood-\nglucose control with sulphonylureas or insulin compared to\nconventional treatment and risk of complications in patients\nwith type 2 diabetes (UKPDS 33).  Lancet 1998, 352:837-853.\n3. Department of Health: National Service Framework for Diabetes: Delivery\nStrategy London: Department of Health; 2003. \n4. Shojania KG, Ranji SR, Shaw LK, Charo LN, Lai JC, Rushakoff RJ,\nOwens DK: Diabetes Mellitus Care.  In Closing the Quality Gap: a\ncritical analysis of quality improvement strategies. Technical review 9 Vol-\nume 2. Edited by: Shojania KG, McDonald KM, Wachter RM, Owens\nDK. Rockville, MD: Agency for Healthcare Research and Quality;\n2004. \n5. Eccles M, Hawthorne G, Whitty P, Steen N, Vanoli A, Grimshaw J,\nWood L: A randomised controlled trial of a patient based Dia-\nbetes Recall and Management System: the DREAM trial: A\nAdditional file 1\nDREAM PE Final Questionnaire. This questionnaire is the theory-based \ninstrument that was used to collect the data for the DREAM process eval-\nuation study.\nClick here for file\n[http:\/\/www.biomedcentral.com\/content\/supplementary\/1748-\n5908-3-50-S1.doc]Page 10 of 11\n(page number not for citation purposes)\nImplementation Science 2008, 3:50 http:\/\/www.implementationscience.com\/content\/3\/1\/50Publish with BioMed Central   and  every \nscientist can read your work free of charge\n\"BioMed Central will be the most significant development for \ndisseminating the results of biomedical research in our lifetime.\"\nSir Paul Nurse, Cancer Research UK\nYour research papers will be:\navailable free of charge to the entire biomedical community\npeer reviewed and published immediately upon acceptance\ncited in PubMed and archived on PubMed Central \nyours — you keep the copyright\nSubmit your manuscript here:\nhttp:\/\/www.biomedcentral.com\/info\/publishing_adv.asp\nBioMedcentral\nstudy protocol [ISRCTN32042030].  BMC Health Services\nResearch 2002, 2:5.\n6. Whitty P, Eccles MP, Hawthorne G, Steen N, Vanoli A, Grimshaw JM,\nWood L, Speed C, McDowell D: Improving services for people\nwith diabetes: lessons from setting up the DREAM trial.  Prac-\ntical Diabetes International 2004, 21:323-328.\n7. Ajzen I: The Theory of Planned Behavior.  Organ Behav Hum\nDecis Process 1991, 50:179-211.\n8. Walker AE, Grimshaw JM, Armstrong E: Salient beliefs and inten-\ntions to prescribe antibiotics for patients with a sore throat.\nBritish Journal of Health Psychology 2001, 6:347-360.\n9. Eccles MP, Hrisos S, Francis J, Kaner E, Dickinson HO, Beyer F, John-\nston M: Do self-reported intentions predict clinicians' behav-\niour: a systematic review.  Implement Sci 2006, 1:28.\n10. Eccles MP, Hawthorne G, Whitty P, Steen N, Vanoli A, Grimshaw JM,\nWood L: A cluster randomised controlled trial of a Diabetes\nRecall and Management system: the DREAM trial.  In Centre\nfor Health Services Research Report No. 113 University of Newcastle\nupon Tyne: Centre for Health Services Research; 2006. \n11. Francis JJ, Eccles MP, Johnston M, Walker AE, Grimshaw JM, Foy R,\nKaner EFS, Smith L, Bonetti D: Constructing questionnaires\nbased on the theory of planned behaviour. A manual for\nhealth services researchers.  University of Newcastle upon Tyne:\nCentre for Health Services Research; 2004. \n12. Godin G, Kok R: The Theory of Planned Behaviour: A Review\nof Its Applications to Health-related Behaviours.  American\nJournal of Health Promotion 1996, 11:87-98.\n13. Ajzen I, Fishbein M: Understanding attitudes and predicting social behav-\niour Englewood Cliffs, New Jersey: Prentice-Hall; 1980. \n14. French DP, Hankins M: The expectancy-value muddle in the\ntheory of planned behaviour – and some proposed solutions.\nBritish Journal of Health Psychology 2003, 8:37-55.\n15. Fazio RH, Chen J, McDonel EC, Sherman SJ: Attitude-accessibility,\nattitude-behavior consistency, and the strength of the\nobject-evaluation association.  Journal of Experimental Social Psy-\nchology 1982, 18:339-57.\n16. Ajzen I, Fishbein M: Attitude and the Attitude-Behavior Rela-\ntion: Reasoned and Automatic Processes.  In European Review of\nSocial Psychology Edited by: Stroebe W, Hewstone M. New York: John\nWiley & Sons; 2001:1-33. \n17. Cooke R, Sheeran P: Moderation of cognition-intention and\ncognition-behaviour relations: a meta-analysis of properties\nof variables from the theory of planned behaviour.  Br J Soc Psy-\nchol 2004, 43:159-186.\n18. Sheeran P, Norman P, Orbell S: Evidence that intentions based\non attitudes better predict behaviour than intentions based\non subjective norms.  European Journal of Social Psychology 1999,\n29:403-406.\n19. Deci EL, Ryan RM: Intrinsic motivation and self-determination in human\nbehaviour New York: Plenum; 1985. \n20. Deci EL, Ryan RM: The \"what\" and \"why\" of goal pursuits:\nHuman needs and the self-determination of behavior.  Psycho-\nlogical Inquiry 2000, 11:227-268.\n21. Chatzisarantis NLD, Biddle SJH: Functional significance of psy-\nchological variables that are included in the theory of\nplanned behaviour: A self-determination theory approach to\nthe study of attitudes, subjective norms, perceptions of con-\ntrol and intentions.  European Journal of Social Psychology 1998,\n28:303-322.\n22. Freemantle N, Nazareth I, Eccles M, Wood J, Haines A, the Evidence-\nbased OutReach (EBOR) Trialists: A randomised trial of the\neffect of educational outreach by community pharmacists on\nprescribing in the UK General Practice.  British Journal of General\nPractice 2002, 52:290-295.Page 11 of 11\n(page number not for citation purposes)\n"}