{"doi":"10.3384\/ijal.1652-8670.094155","coreId":"8216","oai":"oai:eprints.brighton.ac.uk:5826","identifiers":["oai:eprints.brighton.ac.uk:5826","10.3384\/ijal.1652-8670.094155"],"title":"Living in single person households and the risk of isolation","authors":["Banks, Laura","Haynes, Philip","Hill, Michael"],"enrichments":{"references":[{"id":42742017,"title":"Changes in levels of social isolation and loneliness among older people in a rural area: A twenty year longitudinal study.","authors":[],"date":"2004","doi":"10.1353\/cja.2004.0028","raw":"Wenger, G. C. & Burholt, V. (2004). Changes in levels of social isolation and loneliness among older people in a rural area: A twenty year longitudinal study. Canadian Journal on Aging 23(2): 115127. International Journal of Ageing and Later Life","cites":null},{"id":42741990,"title":"Consistencies and Differences in a Cross-National Survey. The International Social Survey Programme.","authors":[],"date":"1997","doi":null,"raw":"Park, A. & Jowell, R. (1997). Consistencies and Differences in a Cross-National Survey. The International Social Survey Programme. London: SCPR.","cites":null},{"id":42741966,"title":"Exclusion in very old age: The impacts of three critical life events.","authors":[],"date":"2007","doi":"10.3384\/ijal.1652-8670.07219","raw":"Cavelli, S., Bickel, J. & D’Epinay, C. (2007). Exclusion in very old age: The impacts of three critical life events. International Journal of Ageing and Later Life 2(1): 931.","cites":null},{"id":42741953,"title":"Family support in social and family context.","authors":[],"date":"2005","doi":null,"raw":"Attias-Donfut, C., Ogg, J. & Wolff, F. (2005). Family support in social and family context. In J. Siegrist (ed.), Health, Ageing and Retirement in Europe  First Results from the Survey of Health, Ageing and Retirement in Europe. Mannheim: Mannheim Research Institute for the Economics of Aging, University of Mannheim.","cites":null},{"id":42742001,"title":"Gender and social support networks in later life.","authors":[],"date":"1995","doi":null,"raw":"Scott, A. & Wenger, C. (1995). Gender and social support networks in later life. In S. Arber & J. Ginn (eds.), Connecting Gender and Ageing (pp. 158 172). Buckingham: Open University Press.","cites":null},{"id":42741981,"title":"Health risk appraisal in older people 1: Are older people living in single person households an ‘at-risk’ group?","authors":[],"date":"2007","doi":"10.1017\/s1463423611000077","raw":"Kharicha, K., Iliffe, S., Harari, D., Swift, C., Gillmann, G. & Stuck, A. (2007). Health risk appraisal in older people 1: Are older people living in single person households an ‘at-risk’ group? British Journal of General Practice 57: 271276.","cites":null},{"id":42741984,"title":"Interactions of middle-aged Japanese with their parents.","authors":[],"date":"1991","doi":"10.1080\/0032472031000145456","raw":"Martin, L. & Noriko, T. (1991). Interactions of middle-aged Japanese with their parents. Population Studies 45(2): 299311.","cites":null},{"id":42741982,"title":"ISSP study monitoring","authors":[],"date":"2001","doi":null,"raw":"Klein, S. & Harkness, J. (2001). ISSP study monitoring 2001 report to the ISSP general assembly. Available on http:\/\/www.za.uni-koeln.de\/ data\/en\/issp\/codebooks\/ZA3680_mr.pdf (Accessed: June 19, 2009).","cites":null},{"id":42741968,"title":"Kinship and friendship. In","authors":[],"date":"1989","doi":"10.17658\/issn.2058-5462\/issue-01\/look-first\/005","raw":"Finch, J. (1989). Kinship and friendship. In R. Jowell., S. Witherspoon & L. Brook (eds.), British Social Attitudes: Special International Report (pp. 87 103). Aldershot: Gower.","cites":null},{"id":42741974,"title":"Kinship and social networks in modern societies: A cross-cultural comparison among seven nations.","authors":[],"date":"1990","doi":null,"raw":"Hollinger, F. & Haller, M. (1990). Kinship and social networks in modern societies: A cross-cultural comparison among seven nations. European Sociological Review 6(2): 103124.","cites":null},{"id":42741967,"title":"Living arrangement choices of older residents: Assessing quantitative results with qualitative data.","authors":[],"date":"1983","doi":"10.2307\/3339846","raw":"Connidis, I. (1983). Living arrangement choices of older residents: Assessing quantitative results with qualitative data. Canadian Journal of Sociology 8(4): 359375.","cites":null},{"id":42742006,"title":"Loneliness among older adults in the Netherlands, Italy, and Canada: A multifaceted comparison.","authors":[],"date":"2004","doi":"10.1353\/cja.2004.0026","raw":"Van Tilburg, T., Havens, B. & De Jong, G. (2004). Loneliness among older adults in the Netherlands, Italy, and Canada: A multifaceted comparison. Canadian Journal of Aging 23: 169180.","cites":null},{"id":42742009,"title":"Loneliness in later life.","authors":[],"date":"2004","doi":"10.1108\/14717794200200006","raw":"Victor, C., Scrambler, S., Bond, J. & Bowling, A. (2004). Loneliness in later life. In A. Walker & C. Hagan Hennessy (eds.), Growing Older  Quality of Life in Old Age (pp. 107126). New York: Open University Press.","cites":null},{"id":42741975,"title":"Loneliness, health and social network among elderly people  a follow-up study.","authors":[],"date":"2002","doi":"10.1016\/s0167-4943(02)00049-3","raw":"Holmen, K. & Furukawa, H. (2002). Loneliness, health and social network among elderly people  a follow-up study. Archives of Gerontology and Geriatrics 35(3): 261274.","cites":null},{"id":42741969,"title":"Neighbourhood care scheme, the ‘Coronation Street’ model of community care.","authors":[],"date":"2007","doi":"10.1332\/policypress\/9781861348715.003.0012","raw":"Fyvie-Gauld, M. & de Podesta, S. (2007). Neighbourhood care scheme, the ‘Coronation Street’ model of community care. In S. Balloch & M. Hill (eds.), Care, Community and Citizenship (pp. 177192). Bristol: Policy Press.","cites":null},{"id":42741978,"title":"Old age and loneliness: Cross-sectional and longitudinal analyses in the Tampere longitudinal study on aging.","authors":[],"date":"2004","doi":"10.1353\/cja.2004.0023","raw":"Jylha¨, M. (2004). Old age and loneliness: Cross-sectional and longitudinal analyses in the Tampere longitudinal study on aging. Canadian Journal of Aging 23: 157168.","cites":null},{"id":42742008,"title":"Old and Alone: A Sociological Study of Old People. London: Routledge and Kegan Paul.","authors":[],"date":"1966","doi":"10.2307\/2092833","raw":"Tunstall, J. (1966). Old and Alone: A Sociological Study of Old People. London: Routledge and Kegan Paul.","cites":null},{"id":42741999,"title":"Poverty and social exclusion  growing older in deprived urban neighbourhoods.","authors":[],"date":"2004","doi":"10.1007\/s10433-005-0025-6","raw":"Scharf, T., Phillipson, C. & Smith, A. E. (2004). Poverty and social exclusion  growing older in deprived urban neighbourhoods. In A. Walker & C. Hagan Hennessy (eds.), Growing Older  Quality of Life in Old Age (pp. 81106). Maidenhead: Open University Press.","cites":null},{"id":42741945,"title":"Science Policy and Research Centre), School of Applied Social Science, Mayfield House, Falmer,","authors":[],"date":"2001","doi":null,"raw":"Corresponding Author Laura Banks, University of Brighton, SSPARC (Social Science Policy and Research Centre), School of Applied Social Science, Mayfield House, Falmer, Brighton BN1 9PH, UK. Email: l.c.banks@bton.ac.uk Ajrouch, K., Antonucci, T. & Janevic, M. (2001). Social networks among blacks and whites: The interaction between race and age. Journal of Gerontology: Social Sciences 56B(2): 112118.","cites":null},{"id":42741960,"title":"Sibling ties in later life: A social network analysis.","authors":[],"date":"1999","doi":"10.1177\/019251399020001006","raw":"Campbell, L., Connidis, I. & Davies, L. (1999). Sibling ties in later life: A social network analysis. Journal of Family Issues 20(1): 114148.","cites":null},{"id":42742007,"title":"Single households and risk of isolation","authors":[],"date":"1957","doi":null,"raw":"Single households and risk of isolation Townsend, P. (1957). The Family Life of Old People. Harmondsworth: Penguin.","cites":null},{"id":42741994,"title":"Social support in later life: A study of three areas.","authors":[],"date":"2000","doi":"10.4324\/9780203459058","raw":"Phillips, J., Bernard, M., Phillipson, C. & Ogg, J. (2000). Social support in later life: A study of three areas. British Journal of Social Work 30: 837 853.","cites":null},{"id":42742010,"title":"Support networks in old age: Constructing a typology.","authors":[],"date":"1989","doi":null,"raw":"Wenger, G. C. (1989). Support networks in old age: Constructing a typology. In M. Jeffreys (ed.), Ageing in the 20th Century (pp. 166 185). London: Routledge.","cites":null},{"id":42742005,"title":"The Council of the European Union.","authors":[],"date":"2002","doi":"10.4324\/9781315063072","raw":"The Council of the European Union. (2002). Fight Against Poverty and Social Exclusion: Common Objectives for the Second Round of National Action Plans  Endorsement. The Social Protection Committee. AGE: The European Older People’s Platform, Brussels.","cites":null},{"id":42741995,"title":"The Family and Community Life of Older People: Social Networks and Social Support in three Urban Areas.","authors":[],"date":"2001","doi":"10.4324\/9780203459058","raw":"Phillipson, C., Bernard, M., Phillips, J. & Ogg, J. (2001). The Family and Community Life of Older People: Social Networks and Social Support in three Urban Areas. London: Routledge.","cites":null},{"id":42741956,"title":"The lineage structured social networks of older people in France.","authors":[],"date":"1996","doi":null,"raw":"Attias-Donfut, C. & Rozenkier, A. (1996). The lineage structured social networks of older people in France. In H. Litwin (ed.), The Social Networks of Older People (pp. 3154). London: Praeger.","cites":null},{"id":42741980,"title":"The Role of Social Capital in Ageing Well in Social Capital in Action Thematic Policy Studies.","authors":[],"date":"2005","doi":null,"raw":"International Journal of Ageing and Later Life Keating, N., Swindle, J. & Foster, D. (2005). The Role of Social Capital in Ageing Well in Social Capital in Action Thematic Policy Studies. Edmonton, Alberta: Policy Research Initiative, University of Alberta.","cites":null},{"id":42741957,"title":"The Social Exclusion of Older People: Evidence from the First Wave of the English Longitudinal Study of Ageing (ELSA). London: New Horizons Single households and risk of isolation programme, Office of the Deputy Prime Minister.","authors":[],"date":"2006","doi":null,"raw":"Barnes, M., Blom, A., Cox, K., Lessof, C. & Walker, A. (2006). The Social Exclusion of Older People: Evidence from the First Wave of the English Longitudinal Study of Ageing (ELSA). London: New Horizons Single households and risk of isolation programme, Office of the Deputy Prime Minister. http:\/\/monash. bepress.com\/research\/199\/ Burholt, V., Wenger, G. C. & Lamura, G., (with Paulsson, C., van der Meer, M., Ferring, D. & Glu¨ck, J.) (2003). European Study of Adult Wellbeing: Social Support Resources Comparative Report, Report to European Commission, Brussels, Centre for Social Policy Research and Development, Institute for Medical and Social Care Research, University of Wales, Bangor.","cites":null},{"id":42742003,"title":"The Social Medicine of Old Age.","authors":[],"date":"1948","doi":"10.1038\/162466a0","raw":"Sheldon, J. H. (1948). The Social Medicine of Old Age. Oxford: Oxford University Press.","cites":null},{"id":42741952,"title":"The social networks of elderly people in Sweden. In","authors":[],"date":"1996","doi":null,"raw":"Andersson, L. & Sundstro¨m, G. (1996). The social networks of elderly people in Sweden. In H. Litwin (ed.), The Social Networks of Older People (pp. 1530). London: Praeger.","cites":null},{"id":42741979,"title":"Understanding the caring capacity of informal networks of frail seniors: A case for care networks.","authors":[],"date":"2003","doi":"10.1017\/s0144686x02008954","raw":"Keating, N., Otfinowski, P., Wenger, C., Fast, J. & Derksen, L. (2003). Understanding the caring capacity of informal networks of frail seniors: A case for care networks. Ageing and Society 23(1): 115 127.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009","abstract":"Data from the International Social Survey Programme (2001) was used to analyse the social networks of older people and whether living in single person households increased the risk of isolation. When comparing respondents with one or more adult children, there was no significant\\ud\ndifference in the likelihood of experiencing familial isolation between people living in single person households and those living in larger households. A majority of those living in single person households had at least regular contact with a sibling, adult child or close friend and participated in a social organisation. Friends compensate to some extent for a lack of support from the family, although in southern and eastern European countries, other relatives appeared to be more important in support networks. People living in single person households were more likely to experience isolation, but this was largely related to advanced age and childlessness. Whilst a very small minority in Japan were living in single person households, they were significantly more likely to be severely isolated than those living in single person households in other countries","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Linkoping University Electronic Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.brighton.ac.uk:5826<\/identifier><datestamp>\n      2015-03-20T10:59:19Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C303030:4C343030<\/setSpec><setSpec>\n      7375626A656374733D4C303030<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.brighton.ac.uk\/5826\/<\/dc:relation><dc:title>\n        Living in single person households and the risk of isolation<\/dc:title><dc:creator>\n        Banks, Laura<\/dc:creator><dc:creator>\n        Haynes, Philip<\/dc:creator><dc:creator>\n        Hill, Michael<\/dc:creator><dc:subject>\n        L400 Social Policy<\/dc:subject><dc:subject>\n        L000 Social Sciences<\/dc:subject><dc:description>\n        Data from the International Social Survey Programme (2001) was used to analyse the social networks of older people and whether living in single person households increased the risk of isolation. When comparing respondents with one or more adult children, there was no significant\\ud\ndifference in the likelihood of experiencing familial isolation between people living in single person households and those living in larger households. A majority of those living in single person households had at least regular contact with a sibling, adult child or close friend and participated in a social organisation. Friends compensate to some extent for a lack of support from the family, although in southern and eastern European countries, other relatives appeared to be more important in support networks. People living in single person households were more likely to experience isolation, but this was largely related to advanced age and childlessness. Whilst a very small minority in Japan were living in single person households, they were significantly more likely to be severely isolated than those living in single person households in other countries.<\/dc:description><dc:publisher>\n        Linkoping University Electronic Press<\/dc:publisher><dc:date>\n        2009<\/dc:date><dc:type>\n        Journal article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by<\/dc:rights><dc:identifier>\n        http:\/\/eprints.brighton.ac.uk\/5826\/1\/ijal09v4i1a3.pdf<\/dc:identifier><dc:identifier>\n          Banks, Laura, Haynes, Philip and Hill, Michael  (2009) Living in single person households and the risk of isolation  International Journal of Ageing and Later Life, 4 (1).  pp. 55-86.  ISSN 1652-8670     <\/dc:identifier><dc:relation>\n        http:\/\/www.ep.liu.se\/ej\/ijal\/<\/dc:relation><dc:relation>\n        10.3384\/ijal.1652-8670.094155<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.brighton.ac.uk\/5826\/","http:\/\/www.ep.liu.se\/ej\/ijal\/","10.3384\/ijal.1652-8670.094155"],"year":2009,"topics":["L400 Social Policy","L000 Social Sciences"],"subject":["Journal article","PeerReviewed"],"fullText":"Living in single person households and the\nrisk of isolation in later life\nBy LAURA BANKS1, PHILIP HAYNES1 & MICHAEL HILL1\nAbstract\nData from the International Social Survey Programme (2001) was used to\nanalyse the social networks of older people and whether living in single\nperson households increased the risk of isolation. When comparing\nrespondents with one or more adult children, there was no significant\ndifference in the likelihood of experiencing familial isolation between\npeople living in single person households and those living in larger\nhouseholds. A majority of those living in single person households had\nat least regular contact with a sibling, adult child or close friend and\nparticipated in a social organisation. Friends compensate to some extent for\na lack of support from the family, although in southern and eastern\nEuropean countries, other relatives appeared to be more important in\nsupport networks. People living in single person households were more\nlikely to experience isolation, but this was largely related to advanced age\nand childlessness. Whilst a very small minority in Japan were living in\nsingle person households, they were significantly more likely to be severely\nisolated than those living in single person households in other countries.\nKeywords: isolation, older people, single person households,\nchildlessness, ISSP.\n1Laura Banks, Philip Haynes & Michael Hill, School of Applied Social Science, University of\nBrighton, Brighton, UK.\nInternational Journal of Ageing and Later Life, 2009 4(1): . # The Authors\n55\n55–86\nIntroduction\nThe International Social Survey Programme (ISSP) is a continuing annual\nprogramme of cross-national social science survey activity. In 2001\u00022002,\nthe agreed standard questions included topics relating to social network\ncontact. The data included accounts of respondents’ contacts with relatives\nand friends, their participation in civic and religious organisations as well\nas information about where they would be most likely to turn for help if\nfaced with illness. The secondary data analysis in this paper is based on a\nsub-sample extracted for an international project supported by the\nEconomic and Social Research Council of the UK. The sub-sample of the\n2001 ISSP includes individual cases of those aged 50 or over from 18\ncountries that are members of the Organisation for Economic Co-operation\nand Development (OECD) (13 of which are European). In some places in\nthe article, the findings are discussed in terms of European regions: where\nItaly and Spain represent Southern Europe; Britain, France, Germany,\nSwitzerland and Austria represent Western Europe; Denmark, Norway\nand Finland represent Northern Europe; and Hungary, Poland and Czech\nRepublic represent Eastern Europe.\nBackground\nConcerns around the possible social isolation of older people living in\nsingle person households are not new. In the UK, for example, several\nimportant post-war studies (Sheldon 1948; Townsend 1957; Tunstall 1966)\nwere carried out which explored the connection between these two\nvariables. Such studies have consistently identified living in single person\nhouseholds as a risk factor for wider social isolation and loneliness (Victor\net al. 2004). However, as Victor et al. have pointed out, there have in more\nrecent years been a number of social changes, which may affect the\nexperience of older persons living in single person households, not least\nthe fact that this has become a much common arrangement. Living in a\nsingle person household cannot be assumed to lead to social isolation, as\nolder people living without others may have good friendship, neighbour-\nhood and community social networks. Similarly, living with a partner may\nlead to feelings of social isolation if the relationship is abusive and not of a\ngood psychological quality.\nInternational Journal of Ageing and Later Life\n56\nThe increasing number of older people living in single person house-\nholds has often been viewed as a negative development related to a decline\nin familial solidarity. An interest in the subject of familial obligations\ntowards elders was reawakened towards the end of the 1970s when\nsociologists started to question assumptions of this simple association\n(Attias-Donfut & Rozenkier 1996: 51). Such writers have argued a ‘‘myth of\nabandonment’’, through which a stereotype had been created of the lonely\nolder person, neglected by family (Connidis 1983).\nA growing government interest in the role of the family in supporting\nolder people has been evident in recent years. This has been fuelled at least\nin part by a growing interest to maintain a system heavily dependent on\ninformal support due to demographical and political change which have in\nmany states resulted in squeezing public funding in social care for older\npeople (Attias-Donfut & Rozenkier 1996: 51). These issues have been\nbrought to public attention through government departments responsible\nfor healthy ageing agendas, and under the banner of the broader concept\nof ‘‘social exclusion’’. The term ‘‘social exclusion’’, first appearing in France\nin the 1960s, has become official parlance of the European Union (Cavelli\net al. 2007: 10). It is a contested notion often used to highlight the multi-\ndimensional inter-connected elements of social isolation and material\ndeprivation. However, the majority of national government and EU studies\non social exclusion have focused on children, adolescents and those of\nworking age, whilst there has been less interest in the exclusion suffered\nby older people (Scharf et al. 2004: 83\u000284). Reducing social exclusion\namong older people has, however, now become a Europe-wide priority\n(The Council of the European Union 2002).\nA recent UK study commissioned by the Social Exclusion Unit has\nfocused on these issues, defining the social exclusion of older people by\nseven dimensions. The study found living in single person households to\nbe associated with exclusion from social relationships and civic activities.\nBeing female was also associated with social exclusion in cultural and civic\nactivities (but not contact with family and friends). Other risk factors of\nsocial exclusion included having no living children, being aged 80 and\nover, as well as non-White ethnicity, having poor health, low income,\nrented accommodation, no car and no telephone (Barnes et al. 2006).\nKharicha et al. (2007) found living in single person households to increase\nSingle households and risk of isolation\n57\nthe risk of social isolation even when controlling for age, sex, income and\neducational attainment. Holmen & Furukawa (2002), however, found that\nwith increasing age, ‘‘having a good friend to talk to’’ and ‘‘being\nsubjectively healthy’’ to be increasingly important in guarding against\nloneliness, whilst the effect of ‘‘not living in single person households’’\nremained stable. A study by Scharf et al. (2004) found that the social and\nmaterial exclusion was related to ethnicity (specific non-White ethnic\ngroups were at greater risk) and age (those aged 75 and over being more\nlikely to be at risk), whilst risk of exclusion was not found to vary\nsignificantly by gender.\nResearch findings are inconclusive over the affect of age on social\nisolation. Cavelli et al.’s (2007) study in Switzerland, for example, found\nthat family and other social relations remained stable in advanced old age\nand social activity was only reduced as a result of declining health. Van\nTilburg et al. (2004) and Wenger & Burholt (2004) found advancing age to\nincrease the risk of isolation. Jylha¨ (2004) finds weakening social\nintegration in old age (along with increasing disability) to be a causal\nfactor of increased isolation. Victor et al. (2004), however, found rates of\nisolation among the older cohort to fall.\nIf older persons live without others, we cannot assume they are\n‘‘lonely’’. Cross-cultural studies have found loneliness among older\npersons to be more frequently reported in more traditionally family-\ncentred countries of southern Europe, despite a lesser prevalence of living\nin single person households (Andersson & Sundstro¨m 1996: 23). This,\nhowever, also raises issues around definition of the terms ‘‘social isolation’’\nand ‘‘loneliness’’, and to what extent the psychological experience of\nloneliness is related to external patterns of social contact and engagement.\nThe degree to which one may feel isolated varies depending on the extent\nof contact with others, but also with a number of other social and\npsychological factors including personal temperament. Indeed, it is\npossible to be lonely without living on your own and vice versa. As\nfound by Wenger & Burholt (2004), caring responsibilities among older\npersons is one factor that may contribute to loneliness, i.e. where older\npersons (often women) are themselves the primary carer for their husband\nor wife and may feel isolated in this role.\nInternational Journal of Ageing and Later Life\n58\nSocial isolation is defined in this study with reference to three\ndimensions. These are the number and regularity of reported social\ncontacts with: family relatives (separate to any partner or spouse); friends;\nand the wider community. The concept of ‘‘severe isolation’’ is used to\ndescribe those who lack a quantity of contact in all these different social\nnetworks. No attempt is made to control for social psychological, self-\nreported accounts of feelings and personal experiences of isolation and\nloneliness. Such data was not available to this study. Social isolation is\ndefined and explored with reference to the quantity of contacts that older\npeople have with other people, and measurement is based on the self-\nreporting of such contacts. It is also beyond this study and dataset to\nexplore a more multifaceted definition of social exclusion and the focus of\nthis study is on the quantity of social contacts.\nResearch Questions\n. Are older people living in single person households at a significantly\ngreater risk of social isolation than those living in a two or more\nperson household?\n. What influence do the factors of childlessness, age, gender and social\nclass have upon the risk of social isolation among older persons who\nlive in single person households?\n. What are the differences in social and support patterns between\ncountries by household structure? In particular, do countries with a\nlarger proportion of older people living in single person households\nalso have a larger proportion at risk of isolation?\nMethod\nThe ISSP is a random sample drawn from each host country’s population.\nAll samples include sample response rates of over 900 and most have final\nresponse samples of between 1000 and 2000. The ISSP social network data\n(2001\u00022002) was collected in 30 countries. We reduced the sample study\nto 18 countries, by only using those countries that are also members of the\nOECD (N\u00049942). The final sample included 13 European countries. Our\nanalysis was only applied to a sub-sample of those aged 50 and over.\nSingle households and risk of isolation\n59\nKlein & Harkness (2001) indicate that response rates are difficult to\nestimate precisely and vary considerably between countries taking part in\nthe ISSP owing to different quota procedures used and the use of\nsubstitution in some countries (see also Park & Jowell 1997). Data has\nbeen analysed with SPSS, using cross-tabulations and Pearson Chi Square\nsignificance testing. Significance values when quoted reflect these tests.\nCountry aggregate data has also been explored using bivariate correla-\ntions.\nFindings\nHousehold Structure and Number of Adult Children by Country\nThose living in single person households were more than twice as likely to\nhave no children than those living with one or more other persons. Around\na quarter of those living in single person households were childless, which\ncompared to just over 9% of respondents living in a two or more person\nhousehold. However, as shown in Figure 1, this difference varied between\ncountries, most notably Spain and Poland in which those living in single\nperson households were nearly four times as likely to have no adult\nchildren, and in particular Japan, where almost 40% of people living in\nsingle person households were childless.\nFamily Members\nThe dataset included information on how often respondents see their close\nfamily members: sibling; son or daughter (who they have most contact\nwith); mother and father. Data on contact with extended family members\nis also available and will be discussed briefly.\nAdult child. A large majority of the sample (85%) had one or more adult\nchildren. However, those in the sample without children were more than\ntwice as likely to live in a single person household (46%) than those who\nhad one or more offspring (21%). However, less than 25% of people living\nin single person households in the sample were childless. Therefore an\nimportant indicator of the extent to which living in single person\nInternational Journal of Ageing and Later Life\n60\nhouseholds may increase the general risk of social isolation, may be\nfrequency of contact with their adult child. This variable refers to contact\nwith the adult child the respondent sees the most (where they have more\nthan one). In the majority (53%) of cases, respondents stated this adult\nchild (the one which they either saw most often or was their lone child)\nwas a daughter.\nAs shown in Table 1, the data showed that, overall, people living in\nsingle person households (excluding those with no children) were slightly\nless likely to see their adult child at least once a month (83%) than those\nliving in a two or more person household (89%). This pattern was true for\nall countries except for Great Britain which had a relatively high rate of\nmonthly contact with their adult child amongst its people living in single\nperson households (89%), despite, as shown in Figure 2, also having a\ncomparatively high proportion living in single person households (34%).\nFor the sample as a whole, living in single person households was found to\nmake a significant difference to the percentage seeing their adult child on a\nFigure 1. Proportion with no adult children by household structure (living\nalone\/2\u0003 household).\n0\n5\n10\n15\n20\n25\n30\n35\n40\n45\n50\nNo adult child 14 4 14 7 17 7 19 10 20 7 20 9 21 11 22 11 24 10 25 13 25 9 26 11 27 7 30 14 31 12 38 10 38 7 40 15\n1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+\nCZ DK AU CA NZ NO FR IT HU GB AT FI PL US DE ES JP CH\nSingle households and risk of isolation\n61\nweekly or monthly basis (pB0.0005). However, as shown in Table 1, this\ndifference was only statistically significant for seven of the 18 countries, i.e.\nthe Eastern (Poland, Hungary and Czech) and Central (Austria, Switzer-\nland and Germany) European countries and Denmark. When those who\nlive with an adult child were excluded from analysis, those living in a two\nor more person household were only slightly more likely to see their adult\nchild once a month (p\u00040.044).\nTable 1. Proportion having weekly\/monthly face-to-face contact with\ntheir adult child by household size and country\nAt least once a week (%) At least once a month (%)\nHousehold size Household size\nCountry 1 2\u0003 All Sig. 1 2\u0003 All Sig.\nAustralia 64.2 71.7 70.5 NS 82.6 86.6 85.9 NS\nAustria 72.9 84.0 80.8 ** 87.2 95.7 93.2 **\nCanada 65.4 71.2 70.4 NS 80.8 83.0 82.7 NS\nCzech Republic 68.9 86.8 82.3 *** 88.3 96.8 94.7 **\nDenmark 50.4 63.0 59.7 * 80.7 90.9 88.2 **\nFinland 60.6 66.7 65.7 NS 77.5 84.0 83.0 NS\nFrance 58.9 57.5 57.9 NS 79.1 79.7 79.5 NS\nGermany 57.1 73.4 70.1 ** 72.7 87.7 84.7 **\nGreat Britain 75.2 70.4 72.1 NS 89.1 85.5 86.8 NS\nHungary 76.0 86.0 83.3 ** 90.2 95.2 93.9 *\nItaly 84.0 91.5 90.3 NV 96.0 96.5 96.4 NV\nJapan 42.3 71.8 70.5 ** 65.4 87.3 86.4 NV\nNew Zealand 58.1 65.1 63.9 NS 75.6 77.7 77.3 NS\nNorway 63.2 67.9 67.2 NS 79.4 84.1 83.4 NS\nPoland 68.4 86.8 82.6 *** 82.7 94.0 91.4 ***\nSpain 86.7 92.6 91.9 NV 91.1 97.3 96.6 NV\nSwitzerland 69.4 75.2 73.8 NS 83.5 92.7 90.5 *\nUnited States 58.9 70.7 66.8 * 78.6 82.2 81.0 NS\nTotal 65.8 74.9 73.0 *** 83.0 88.7 87.5 ***\n*pB0.5; **pB0.01; ***pB0.001.\nNote: n\u00048426 (excludes those with no adult child), NV\u0004not valid since \u000220% of cells have\nexpected counts B5, NS\u0004not significant.\nInternational Journal of Ageing and Later Life\n62\nWhen the analysis was conducted by social class, working\/lower\nmiddle class respondents were more likely to see their adult child once\nweekly or monthly than upper middle\/upper class respondents (pB\n0.0005). Likelihood of monthly contact increased with age for those living\nin single person households but decreased for those living with one or\nmore other persons. With increasing age, therefore, the gap in frequency of\ncontact narrowed between those living in single person households and\nthose living in a two or more person household. The greater proportion of\nwomen in the older age groups may be one reason for this, since for all age\ngroups, household types and social classifications, women were more\nlikely than men to see their adult child at least weekly\/monthly.\nTable 1 shows there is some variation in face-to-face contact between the\ncountries, such as the comparatively high levels of contact evident in the\nSouthern European countries. However, the data shows that the large\nmajority see their adult child at least once a month, and the norm for\npeople living in single person households in all countries (excluding Japan,\nwhere to live apart from one’s adult child is less common) is to retain a\nminimum of weekly face-to-face contact.\nFigure 2. Bar chart showing proportion living alone, by contact with adult\nchild.\n0.0\n5.0\n10.0\n15.0\n20.0\n25.0\n30.0\n35.0\n40.0\nSee child >,,\n–\n once a month 13.9\nSee child < once a month 2.8\nHave no child\n2.6 8.8 9.2 8.4 10.4 9.7 13.3 11.6 10.2 15.5 19.8 18.2 20.3 14.8 18.5 20.8 21.6 20.2\n1.4 2.1 2.4 0.8 2.2 2.8 0.6 3.8 3.8 3.3 2.6 4.3 2.2 2.9 4.9 3.1 2.6 5.5\n2.4 2.7 3.1 5.7 2.9 3.9 3.9 3.9 7.6 7.1 3.9 3.8 7.5 12.3 6.7 8.6 9.6 11.7 5.8\nJP CA NO ES AU FI IT NZ DE PL CZ DK HU CH FR AT GB US Tot\nSingle households and risk of isolation\n63\nThe majority of respondents had other contact (besides visiting) with\ntheir adult child at least once a week. In fact, if those who were living in\nthe same household as their adult child are excluded, only 20% of\nrespondents reported to have no form of distance contact with their adult\nchild at least once a week. Most of those (63%) who saw their adult child\nless than once a week were in remote contact with him or her at least once\na week, and 21% at least several times a week. The majority (52%) of those\nin face-to-face contact less than once a month were also in remote contact\nat least once a week. As has been found by findings from the previous ISSP\ndataset on social networks (Finch 1989), contact from a distance does not\ntherefore appear to reflect a straightforward pattern of compensation for\nlack of face-to-face contact. In fact, there was a strong positive correlation\n(by country) between the proportion who see their adult child at least\nweekly and the proportion who have weekly distance contact (r\u00040.899,\npB0.0005). Thus, those who reported to see their adult child more often\nwere also more likely to be in more frequent contact by remote means. The\nproportion of those who saw their adult child at least once a week (but\ndidn’t live with them) and also kept in touch through another form of\ncontact on a weekly (or more often) basis was particularly high (89%) and\nin fact most of these (66%) were in remote contact with their adult child at\nleast several times a week.\nJapan stands out from the overall pattern since a very low proportion of\nits respondents were in touch by remote means on a weekly basis. In fact,\namong those who see their adult child less than once a week in Japan, less\nthan a quarter (24%) were in contact through other means. This suggests\nthat where Japanese older persons do not live with their adult child, they\nmay be less likely to stay in regular contact. This may be to some extent\nexplained by the traditional family pattern, whereby a married daughter\nmay have little contact with adult parents as she would be considered part\nof her husband’s family (Martin & Noriko 1991).\nSibling. Although siblings are less likely than children and spouses to\nprovide instrumental support, they have been found to be important\nproviders of support in times of crisis for older persons in general, and as\nparticularly important sources of help for those who are single, widowed\nand childless (Campbell et al. 1999). The ISSP data supports this finding\nInternational Journal of Ageing and Later Life\n64\nshowing that among those with a living sibling, people living in single\nperson households were significantly more likely to see him\/her on a\nweekly basis than those living in a multiple person household (p\u00040.006).\nThe difference was, however, more acute between those with and without\nchildren with childless respondents significantly more likely to regularly\nsee their brother or sister than those who had one or more adult child (pB\n0.0005) (Figure 3). In fact, when childlessness was controlled for, no\nsignificant difference was found in contact levels by household type.\nHigher levels of contact amongst those living in single person households\ntherefore appears to be a confounding factor of childlessness, i.e. since\nthose living in single person households are more likely to have no\nchildren.\nGreater weekly contact was particularly significant for the childless\ngroup, with a greater proportion of childless respondents reporting\nweekly contact with a sibling in each of the 18 countries. However, this\nFigure 3. Proportion seeing sibling at least weekly\/monthly by frequency\nof contact with adult child. n\u00047131 (71.7%), pB0.0005.\n0.0\n10.0\n20.0\n30.0\n40.0\n50.0\n60.0\n70.0\nAt least once a week 15.4 21.4 31.8 33.0 38.2\nAt least once a month 29.8 47.0 52.0 56.3 57.3\nDaily\/live in\nsame hhd\nAt least once \na week\/sev \ntimes a week\nAt least once \na month\nAt least once \na year\/sev \ntimes a year\nNo adult \nchild\nSingle households and risk of isolation\n65\ndifference was only statistically significant for Hungary, New Zealand and\nDenmark. Nevertheless, as is shown in the chart below (for the whole\nsample), the data suggests that childlessness, and less frequent contact\nwith an adult child may to a small extent be compensated for by greater\ncontact with a brother or sister.\nDistance contact. Among all respondents with a living sibling, 39% were in\ntouch with him or her at least once a week and 69% at least once a month.\nSeventy-seven percent of those who saw their sibling at least once a week\nwere also in contact by remote means and 26% of those who did not see\ntheir sibling at least once a week were in touch through another means.\nTherefore, nearly half (43%) of those with a sibling were in some form of\ncontact (either remote or face-to-face) at least once a week and the majority\n(69%) were in touch with, or saw their sibling at least once a month.\nThose living in single person households were more likely to have\nregular distance contact with a brother or sister than those living with\nothers. Forty-six percent of people living in single person households had\n(at least) weekly contact, compared to 38% of those living with others (pB\n0.0005) and 71% were in touch at least once a month compared to 68% of\nthose living in bigger households (p\u00040.041). Those without children were\nalso more likely to have regular remote contact with their sibling, although\nthis was only statistically significant at a weekly level (pB0.0005).\nRegular remote contact declined by age. Women were more likely than\nmen to be in touch with their sibling at least once a week (pB0.0005) or\nonce a month (pB0.0005), but for both genders contact was greater for\nthose who had no adult children. Contact was also greater for those living\nin single person households when controlling for gender and childlessness,\ni.e. for both men and women, with or without children, contact was greater\nwhen living in single person households. No significant difference was\nfound by social class. When comparing weekly remote contact with sibling\nby country, the variation was greater than for adult child, ranging from\nover half in Italy, Spain and Hungary to only 18% in Japan.\nIsolation from Family Contact\nAlthough the frequency of face-to-face contact with close family members\nwas greatest in Southern and Eastern Europe, the similarities in level of\nInternational Journal of Ageing and Later Life\n66\ncontact are perhaps most interesting with the majority of respondents from\neach of the 18 countries seeing an adult child or sibling at least once a\nweek, and 89% of the whole sample reporting to have either (or both) face-\nto-face or distance contact with an adult child or sibling at least once a\nmonth. The remaining 11% of respondents reporting no contact with either\nof these relatives during an average month are, for the purpose of this\nanalysis here defined as ‘‘isolated’’.\nAs shown in Figure 4, the proportion seeing either an adult child or\nsibling less than once a month, was smallest in Italy (1.9%) and largest in\nGreat Britain (8.7%). There was no significant difference in the likelihood\nof seeing an adult child or sibling at least once a month by number in\nhousehold (one or more) or by marital status. Only 4% of all respondents\nin the total sample lived in a single person household and fitted the criteria\nof the ‘‘isolated’’ family contact variable (2.8% did not have an adult child\nor sibling).\nWhen the ‘‘isolated’’ group was compared with the majority group by\nage, gender and class, it was found that men were more likely to be\nisolated, since 13% of men reported no monthly contact with an adult\nchild or sibling, which compared to 9% of women (pB0.0005). Middle to\nupper class respondents were less likely to be isolated. However, this is\nlargely due to the lower proportion having no living relative. The\nlikelihood of being in the isolated group significantly increased with age\nfor women, from 8% of those aged below 70 to 14% of those aged 70 and\nabove.\nIf contact with extended family members (i.e. cousins, brothers and\nsisters-in-law, and nieces and nephews) are taken into account, the\nproportion with no monthly contact reduces to just 5.5% of the whole\nsample. Almost half of those with no monthly contact with a sibling or\nchild had some contact with one of these extended relatives. However,\npeople living in single person households were less likely to have seen\nan extended family member in the last four weeks (pB0.0005). This\nwas the case even when controlling for age, gender and childlessness,\nand this pattern was reflected in each of the 18 countries in the sample.\nThe lowest proportion with no monthly contact with a close or\nextended family relative was amongst Italian respondents (2.5%) and\nthe highest amongst those from Great Britain (11.8%). The majority of\nSingle households and risk of isolation\n67\ntotal respondents (67%) and over half of people living in single person\nhouseholds (58%) had some monthly contact with at least one of these\nextended family members.\nFriends\nThe questionnaire asks respondents about numbers of close friends in\nseveral categories, including those within the same locality, from the\nworkplace and other friends. It also asks about frequency of contact with\nclosest friend. These two measurements of friendship ties are discussed\nbelow.\nFigure 4. Proportion of all respondents having infrequent (less than\nmonthly) contact with an adult child or sibling, by household type and\ncountry. n\u00049942 (includes those with no living relative and missing cases\nas no contact).\n0.0\n5.0\n10.0\n15.0\n20.0\n25.0\nLive in 2+ hhd\nLive alone \n1.9 13.4 6.4 4.0 4.6 7.7 9.2 7.4 6.8 3.4 6.0 9.5 5.0 3.8 5.0 12.4 5.7 12.5 7.0\n1.9 2.2 2.4 2.5 2.6 2.9 3.0 3.1 3.6 3.7 4.5 4.6 4.8 5.0 5.8 6.0 7.1 8.7 4.0\nIT NO JP DK CZ CA AU ES NZ HU FR FI PL AT CH DE US GB Total\nInternational Journal of Ageing and Later Life\n68\nNumber of close friends. As shown in Figure 5, the average reported number\nof total close friends ranged from 5.1 in Hungary to 12.6 in Norway. In\ncontrast with family contact levels, average number of close friends was\nfound to be lowest in Southern (7.4) and Eastern European countries (7.0).\nIn fact, there was a significant negative association between number of\nnon-work based friends and weekly family contact (adult child and\nsibling) by country (r\u0004\u00020.654, p\u00040.003). Thus, respondents in countries\nwith an average greater level of family contact tended to report on average\na smaller number of close friends in their network.\nPrevious research has found a greater likelihood of older persons living\nin single person households or with only a spouse, to include more friends\nand neighbours in their social networks (Wenger 1989). The ISSP data\nshows little difference in overall average number of close friends between\nthose living in single person households or in a two person household\n(11.4) and those in a 3\u0003 person household (11.7), although those living in\na one or two person household had a slightly greater average number of\nnon-work based friends than those in 3\u0003 person households. Those living\nin single person households had on average a slightly smaller number of\nclose friends, but childless respondents living in single person households\nFigure 5. Average number of close friends by type and country.\n0\n2\n4\n6\n8\n10\n12\n14\nWorkplace \nOther\nNeighbourhood\n1.8 0.4 1.2 2.3 0.5 1.7 1.8 1.2 1.4 2.8 2.4 2.4 1.9 1.9 1.5 2.8 1.9 2.9 1.6\n1.9 2.2 2.8 2.5 4.4 3.1 3.6 5.3 4.4 3.6 4.3 4.5 4.3 5.2 5.6 5.5 6.1 6.2 4.2\n1.4 2.6 2.3 1.7 2.4 2.5 2.4 2.2 3.2 2.8 2.6 2.6 3.8 3.0 3.1 2.9 3.5 3.5 2.7\nHU ES CZ IT FR PL DE DK GB AT FI CH JP CA NZ US AU NO Total\nSingle households and risk of isolation\n69\nhad in fact more friends on average than childless persons living in a two\nor more person household.\nThe average number of close friends declined with age. However, this\nappears to be primarily related to the inclusion of workplace friendships\nheld by those ofworking age. If total friends are compared, those agedbelow\n70 had on average 11.8 close friends which declined to 9.4 among those aged\n70 and over. However, the difference was very slight if workplace friends\nwere omitted, with an average of 9.4 for those aged below 70 and 9.2 for the\nolder age group. And those aged 70 and over reported to have more close\nfriends living in their neighbourhood. The most notable decline of average\nnumber of friends was in the age group those aged 80 and over (7.7).\nIn terms of gender and social class, there was a reversal in the pattern\nidentified for family contact where higher levels were found among\nwomen and those from the lower social class groups. When average\nnumbers of close friends were compared, those in the higher strata\n(middle to upper class) reported to have a greater number of close friends\nin each category, than those in the lower social classes (working to lower\nmiddle class). Male respondents on average reported to have a greater\nnumber of close friends than women even when controlling for age,\nmarital status, social class, household type and childlessness.\nWhen comparing the number of average friends by country or groups of\ncountries, issues around the cultural interpretation of such a subjective\nconcept should be considered (Hollinger & Haller 1990: 114). There may\nalso be gender differences in interpretation of this concept. Another issue\nrelated to this is that simply counting the number of reported friends may\nalso not be an accurate measurement of the strength of non-kin networks\nbecause the size of the network gives no information as to the actual level\nof contact or support received (Keating et al. 2003: 118). Although\ninformation of this type is not fully provided in the ISSP dataset, it does\ninclude an additional measurement of the strength of friendship ties:\nfrequency of contact with closest friend.\nFrequency of contact with close friend. There was no significant association\nbetween number of close friends and frequency of contact with closest\nfriend. But, countries in which respondents had on average more frequent\nfamily contact also tended to report more frequent contact with their\nInternational Journal of Ageing and Later Life\n70\nclosest friend.1 The higher frequency of best friend contact may indicate\nthat respondents in the more ‘‘family-centred’’ countries, may be more\nlikely to have a smaller number of more intense friendships. Indeed,\nSouthern and Eastern Europeans were the most likely to see both their\nclosest friend and their adult child or sibling on a daily basis.2 However,\nthose from the Southern and Eastern European countries were also on\naverage most likely to report having no close friend.\nPeople living in single person households were more likely to have\nreported frequent face-to-face contact with their closest friend. Over half\n(52%) of those who lived alone saw their closest friend at least once a\nweek, which compared to 44% of those in a two or more person\nhouseholds (pB0.0005). In fact as is shown in Figure 6 below, in all\ncountries except Italy, people living in single person households had\nhigher levels of weekly contact with a best friend than people living in\nlarger households, and the difference was significant regardless of age and\nsex. A similar pattern was identified when comparing contact by marital\nstatus in that the unmarried were more likely to have regular contact with\ntheir close friend (except in Italy). Women were more likely to have weekly\ncontact with their best friend than were male respondents (pB0.0005),\nFigure 6. Proportion of respondents who see their closest friend at least\nonce a week by household type (living alone\/2\u0003 household) and country.\n0\n10\n20\n30\n40\n50\n60\n70\n80\n1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+ 1 2+\nNZ ES CH CA AT CZ FI GB AU US DE NO JP HU PL FR DK IT\nSingle households and risk of isolation\n71\nwhilst middle to upper class respondents were less likely to see a close\nfriend on a weekly basis than those classified as working to lower middle\nclass. Employment status made little difference to levels of weekly contact.\nSocial Participation\nParticipation in social and community groups has been shown to be an\nimportant indicator of non-kin network size (Burholt et al. 2003: 14) and of\nrelational inclusion (Cavelli et al. 2007). In order to measure social\nparticipation amongst the ISSP respondents, a binary variable of participa-\ntion (do\/do not participate) was used in relation to participation in a\npolitical party, church or religious organisation, sports group, charitable\norganisation, neighbourhood group or other organisation.\nThe pattern of social participation by country contrasted with that of\nfamily contact in that respondents from Eastern and Southern European\ncountries were less likely to participate in a social group or organisation\nthan other respondents. There was a strong negative correlation by\ncountry between weekly close family contact and the percent that\nparticipate by country (r\u0004\u00020.823, pB0.0005). This suggests some support\nto the theory that close-knit family ties may militate against community\nlinkages (Keating et al. 2005: 29).\nHowever, the overall participation rate was lower among people living\nin single person households than those living in a two or more person\nhousehold (pB0.0005) even when controlling for gender. There was some\nvariation between the countries, with Great Britain, for example, having\nhigher participation rates among those living in single person households\n(p\u00040.022). There was little difference in participation rates between the\n50\u000264 (59%) and 65\u000279 (58%) age groups, but level of participation\ndeclined (48%) amongst the oldest age (80\u0003 ) group (pB0.0005).\nFor all age groups, married persons had higher participation rates, than\nthe unmarried, although participation rates were higher for the ‘‘never\nmarried’’ than for the ‘‘widowed, divorced or separated’’. Although there\nwere some country differences in this pattern, overall, men (61%) were\nmore likely to participate than women (55%) even when controlling for\nmarital status and age. Middle to upper class respondents were signifi-\ncantly more likely to participate (pB0.0005) even when controlling for\nage, gender and household type and childlessness.\nInternational Journal of Ageing and Later Life\n72\nAlthough there are issues around the subjectivity of the concept of close\nfriendship which may have an influence upon the number of friends\nrespondents included in their network, as Hollinger & Haller (1990) note\nthe proportion reporting they have no close friend is likely to be a\nsignificant measure of isolation. When asked how about frequency of\ncontact with closest friend, 17% reported to have no close friend, and this\ngroup was more likely not to participate in any social organisation (pB\n0.0005). About 13.4% of all respondents neither had a close friend nor\nparticipated in any social organisation.\nUnder both definitions (i.e. whether including those with no close\nfriends or having less than monthly contact) Eastern Europeans were most\nlikely to be socially isolated. There were, however, differences between the\nEastern European countries, with Hungarians in particular being likely to\nreport having both no close friends (a finding that was also noted by\nHollinger and Haller) and no participation (32%), followed by Poles (23%),\nwhilst those from Czech Republic were much less likely to do so (12%).\nUnder both definitions, the Southern European region also had higher\nlevels of ‘‘social isolation’’ than those from the other European and non-\nEuropean countries in the sample, whilst the lowest rates of social isolation\nwere found in Australia, New Zealand and North America.\nIf ‘‘social isolation’’ is here defined as those reported to neither have\nmonthly contact with a close friend nor any participation in a social\norganisation, people living in single person households were no more\nlikely to be socially isolated, whilst childless respondents were slightly\nmore likely to be in this group (p\u00040.005). The risk of isolation increased\nwith age with 30% of those aged 80 and over in the socially isolated group\ncompared to 23% of those aged 65\u000279 and 19% of those in the youngest\nage group (pB0.0005). Working and lower middle class respondents were\nover two and a half times more likely to be isolated when using this\ndefinition than middle to upper class respondents (pB0.0005) and the\ndifference remained even when controlling for age and gender.\nSevere Isolation\nThe influences of various social characteristics upon the likelihood of being\n‘‘isolated’’ from family or friendship contact and social participation have\nbeen discussed above. This section now explores the occurrence of severe\nSingle households and risk of isolation\n73\nisolation, which is here defined by a combination of ‘‘isolation’’ in all three\ndimensions.\nOnly a very small proportion of respondents (3.5%) in the international\nsample could be defined as ‘‘severely isolated’’ in terms of reporting no\nmonthly contact (face-to-face or remote) with either a close relative (sibling\nor adult child), a close friend or any involvement in social groups and\norganisations. This however ranged from under 1% in Italy to 6.5% in\nGreat Britain. Nearly a quarter (23%) were found to be isolated in two of\nthe three dimensions.\nOverall, a greater risk of severe isolation (all three dimensions), was\napparent for men than women (pB0.0005) although the gap narrowed in\nthe older age groups. Being unmarried increased the risk of severe\nisolation more for men than for women. Those from rural areas were\nslightly more likely to be severely isolated than those from suburban\/\nurban areas (p\u00040.040). For all types of areas and for both genders,\nworking\/lower middle class respondents were more likely to be severely\nisolated than those defined as middle\/upper class. Those on a relatively\nlow household income3 were also slightly more likely to be in the severely\nisolated group (p\u00040.004).\nRisk of severe isolation increased with age, with those aged 80 and over\nmore than twice as likely to be in this category than younger respondents\n(pB0.0005). Those with no adult children, however, were eight times more\nlikely to be characterised by all three aspects of isolation (pB0.0005). The\ndata suggests that the risk of isolation is not increased by living in single\nperson households per se, but due to the confounding factors of greater\nlikelihood of advanced age, and primarily of childlessness among those\nliving in single person households.\nFew respondents were ‘‘isolated’’ in all three dimensions, or even in the\ntwo dimensions of apparent weak family and weak non-kin ties. A large\nmajority (almost 90%) of the sample had either at least above average\ncontact with sibling, adult child, close friend or social participation.\nHowever, the data does not appear to suggest that those who are isolated\nin one dimension significantly compensate in another. Those who were\nisolated in family contact were in fact more likely to also be isolated in\nterms of social contact and participation (pB0.0005). This was true for all\ncountries in the sample, except Italy. There may, however, be some degree\nInternational Journal of Ageing and Later Life\n74\nof substitution for low family contact through friendship networks as\nthose with below average frequency of family contact, reported to have a\nlarger number of friends on average (pB0.0005).\nWhen comparing countries by regional groupings, no significant\ndifferences were found in the overall risk of severe isolation. However,\nthe Japanese were much more likely to be severely isolated if living in\nsingle person households. Risk of severe isolation among people living in\nsingle person households was also relatively high among Eastern\nEuropeans and almost one in five childless Eastern Europeans were\nseverely isolated, which compared with 13% of the sample population as a\nwhole.\nSupport Networks\nThe ISSP questionnaire asks some key questions about who the respon-\ndent would turn in three hypothetical scenarios which give an indication\nof sources of support accessed in three different areas: emotional; practical;\nand financial. The questionnaire asks who the respondent would turn to\nsupposing s\/he: (a) were ill for a few days and needed some practical\nhelp; (b) were a bit down or depressed and wanted someone to talk to; and\n(c) needed to borrow a large sum of money. This section will compare the\nreported primary support networks of those living in single person\nhouseholds and\/or have no children with other respondents, and it will\nalso consider the impact of country, age, gender and social class. However,\nfor want of space, this section will focus primarily on the first variable\n(who to turn to when ill).\nThus far, we have discussed data relating to the social networks of the\nparticipants and how these differ between people living in single person\nhouseholds and those living in larger households, as well as looking at\ndifferences based on other social criteria. However, one problematic issue\nwith such social network analysis is that information regarding the size of\nnetworks and frequency of contact, tell us little about how that equates to\nactual support. As Walker has argued: ‘‘One truism of network analysis is\nthat mere presence of a tie between two people does not equate with the\nprovision of support’’ (Walker et al. 1993 cited in Keating et al. 2005: 25).\nTherefore, although we have shown, for example, how people living in\nsingle person households had on average more frequent contact with a\nSingle households and risk of isolation\n75\nclose friend, this tells us little about the role of that friendship in terms of\nsupporting that person in everyday life. And in particular, such social\nnetwork data gives us little clue about the potential caring capacity of\ninformal ties should need arise, and the extent to which family and friends\nmay ‘‘rally round’’ in a crisis (Cavelli et al. 2007: 23; Keating et al. 2003).\nSocial network analysis has found that older people tend not to mobilise\nthe whole of their social networks for support but rather turn to their ‘‘core\nnetwork’’, which is usually constituted of close kin (Keating et al. 2005;\nPhillips et al. 2000; Phillipson et al. 2001). Frequency of contact with close\nfamily gives one indication of the strength of these potential support\nnetworks. However, as Hollinger & Haller (1990) argue, the reduced\nfrequency of face-to-face family contacts in Northern and Western\nEuropean countries does not necessarily imply a reduction of support.\nAs Hollinger and Haller’s study of previous ISSP data found, informal\nsupport networks continue to be much more important than formal\nsources of support in all countries (except for borrowing money). Indeed,\nthe 2001 ISSP data shows that formal services would only be turned to in\nthe first instance in a very small number of cases if the respondents were ill\n(although more common in Western Europe).\nAs was found in relation to the 1986 ISSP module on social networks\n(Finch, 1989: 87), first impressions are that the data on sources of support,\nreveal more similarities between the countries than differences. Past\nresearch has found older persons to prefer to receive support from spouses\nthan from children, other family members or friends and neighbours\n(Ajrouch et al. 2001). This universal importance of the role of the spouse is\nindeed most noticeable in the ISSP data. The data suggests that\nrespondents are most likely to turn first to a spouse for practical and\nemotional support in each of the 18 countries in the sample. Nevertheless,\nas (Finch, 1989: 101) found in regard to Italy, respondents from Southern\nand Eastern Europe and Austria, were less likely to look to a spouse and\nmore likely to state they would turn to an adult child than were other\nrespondents. In addition, when first and second choices were combined,\nadult children were more commonly selected than a spouse or partner in\nSouthern and Eastern Europe.\nAs shown in Figure 7, non-kinship informal contacts were more\nimportant as primary providers of emotional than practical support. In\nInternational Journal of Ageing and Later Life\n76\nfact, 18% reported they would turn to a friend first when depressed which\ncompared with 16% who stated they would turn to a daughter or son.\nAgain, Southern and Eastern Europeans were the least likely to select a\nfriend (as a first or second choice), whilst non-Europeans were the most\nlikely. Although non-kin ties may be less dependable than close family in\nterms of providing more intensive practical and care support, their\nimportance in terms of contributing to the mental health and well-being\nof older persons in particular should not be under-estimated. Indeed, as\nresearch in the UK has suggested, the importance of friendship ties in the\n‘‘personal communities’’ of older people may be increasing (Phillipson\net al. 2001). The importance of support from friends was particularly\nevident for people living in single person households without children.\nNearly half of this group (43%) said they would turn first to a friend or\nother non-kin informal contact (e.g. neighbour or colleague) for support\nwhen either ill or depressed. Those with more regular contact with a close\nfriend were more likely to turn to a close friend for support and were more\nlikely to have a larger number of close friends on average. This suggests\nFigure 7. Bar chart showing who the respondent would turn to ﬁrst for\nsupport, by household type (living alone\/2\u0003 household).\n0%\n10%\n20%\n30%\n40%\n50%\n60%\n70%\n80%\n90%\n100%\nFormal services\nFriend\/other\nOther relative\nChild\nSpouse\/partner\nNo-one\nFormal services 5 1 9 4 32 37\nFriend\/other 25 2 34 13 7 3\nOther relative 18 5 15 7 15 12\nChild 42 14 27 12 23 13\nSpouse\/partner 6 77 5 59 2 25\nNo-one 4 1 10 4 21 10\n1 2+ 1 2+ 1 2+\nPractical Emotional Financial\nSingle households and risk of isolation\n77\nthat stronger non-kin social ties are more likely to translate into support. It\nis important, however, to better understand the role of non-kin ‘‘weak\nties’’, as there has been little research around their importance in the lives\nof older people (Keating et al. 2005: 29).\nIn the case of illness, people living in single person households were\nmost likely to turn to an adult child for support than to friends and other\nrelatives, although a daughter (29%) was more than twice as likely to be\ncalled upon as a son (14%). However, where the lone person had no adult\nchild to turn to, a friend, neighbour or colleague was reported to be either\na first or second choice contact (44%) followed by other relatives (37%) \u0002\nalthough the reverse was true in Southern Europe where extended kin\nappeared to have a greater role in providing support. Childless respon-\ndents living with one or more other persons were more than twice as likely\nto turn first to another relative, than to a friend, perhaps due in part to the\ngreater likelihood of co-residence with an extended family member.\nWhen controlling for marital status, the greater likelihood of childless\nrespondents turning to a close relative, is strongly influenced by cultural\ndifferences, particularly noticeable among those from Southern Europe.\nAmong Southern Europeans who were married without children, only\n60% reported they would turn first to their spouse (compared with 86%\noverall) when ill, and over a quarter (26%) to another relative (compared to\nless than 6% of the sample as a whole). Over three quarters of lone\nunmarried Southern Europeans with an adult child stated they would turn\nto him\/her (52% to a daughter) and only 7% to a friend. In contrast, almost\na quarter (23%) of Western Europeans turned first to a friend and just over\nhalf to a daughter or son (51%). People living in single person households\nwith no adult child were also most likely to turn to another relative in\nSouthern Europe (48%), whilst Western Europeans were the most likely to\nturn to an informal non-kin contact (48%). North Americans in this group\nwere the most likely to say they would turn to no-one (13%), whilst\nJapanese (19%) and Northern Europeans (13%) were the most likely to\nstate they would turn to formal services or pay someone to help.\nFew persons, whether living in single person households or with others,\nstated they had no-one to turn to for practical (1.5%), emotional (6%) or\nfinancial (13%) help. However, the likelihood of having no-one to turn to,\nwas greater for people living in single person households. This was\nInternational Journal of Ageing and Later Life\n78\nespecially true for those in the ‘‘severely isolated’’ group, 15% of whom\nstated they would have no-one to turn to when ill, 27% if depressed and\n44% if in need of a large loan. The likelihood of having no-one to turn to\ndiffered little between those who were severely isolated (i.e. in all three\ndimensions) and had an adult child or not (since by definition they had\nlittle contact with their adult child). Severely isolated persons also tended\nto be more likely to turn to formal services for help. In terms of gender,\nthere was little difference in the proportion stating they would have no-one\nto turn to, despite the greater preponderance of widowhood among\nwomen. Even among married persons it is notable that females were more\nlikely to turn to someone other than their spouse for support than males.\nIn terms of emotional support it was particularly evident that married\nwomen were more than four times as likely to turn to a daughter and more\nthan twice as likely to turn to another relative or close friend (pB0.0005).\nAs has been found in past research, the data suggests that support\nnetworks may differ less for women by marital status than for men (Scott\n& Wenger 1995: 160). Those who had no informal contact to turn to (i.e.\nstated they would turn either to no-one or a formal service) when either ill\nor when depressed were more than twice as likely to be aged 80 or over\n(15%) than under 80 (7%). Women over 80 were nearly twice as likely to\nstate they had no-one to turn to when ill than men in this age group (p\u0004\n0.018), but there was no difference between the genders in terms of the\nemotional support variable. In all the age groups, males were significantly\nless likely to state they would turn to an informal contact to borrow a large\nsum of money even when controlling for household type (pB0.0005).\nDespite the greater likelihood of having no-one to turn to, the large\nmajority of people living in single person households, with or without\nadult children could state at least two informal contacts they could turn to.\nAs Keating et al. note, the question thus remains as to ‘‘whether the non-\nmarried have smaller support networks because of the absence of\nmembers with normative obligations or larger networks because, in the\nabsence of a spouse or children, they invest more in diverse supportive\nrelationships’’ (Keating et al. 2003: 119). The ISSP data does suggest\nthough, that childless unmarried respondents compensate at least to some\nextent for lack of support from offspring by turning to other relatives\n(particularly siblings) and friends (with those living in single person\nSingle households and risk of isolation\n79\nhouseholds depending to a greater extent on friends). The ISSP data also\nshows, however, that the make-up of support networks varies between\ncountries. There are some broad similarities such as how, across the board\nmost were primarily dependent on a spouse and few people stated they\nwould have no-one to turn to for support, or that they would turn to\nformal services. However, the most notable difference suggested by the\ndata is a lesser dependence on spousal support in Southern Europe even\nwhere there are no adult children to turn to. Although married Eastern\nEuropeans and Japanese were also more likely to turn to an adult child,\nchildless married persons were much more likely to be dependent on a\nspouse than in Southern Europe. This was particularly evident in Italy,\nwhere there was no significant difference by household type in having an\ninformal contact to turn to for practical or emotional support (this was also\nsurprisingly true of Norway where despite high dependence on spousal\nsupport in a two or more person households, very few stated they would\nturn to formal services or have no-one to turn to if they were ill).\nThe greater likelihood among Southern Europeans of married persons in\na two or more person household, turning to someone other than a spouse,\nmay be in part related to a greater likelihood of co-residence with another\nfamily member. The proportion by country turning to an adult child for\nsupport, and the proportion having their offspring living with them is, for\nexample, strongly correlated, particularly when including only married\npersons (r\u00040.837, pB0.0005). However, the greater proportion turning to\nanother family member in Southern Europe (particularly Italy) and also (to\na lesser extent) in Eastern Europe and Japan, even when married and co-\nresiding with an adult child, is perhaps indicative of differences in\ncloseness of extended kinship ties (meaning the person requiring care is\nless dependent on a partner), and differing cultural expectations concern-\ning the role of spouse, children and other kin (Attias-Donfut et al. 2005;\nHollinger & Haller 1990)\nConclusion\nPeople living in single person households were no less likely to see their\nadult child than those living in a two or more person household where the\nrespondent’s adult child did not reside. People living in single person\nInternational Journal of Ageing and Later Life\n80\nhouseholds were more likely to have frequent face-to-face contact with a\nsibling, although this was due to the confounding factor of childlessness,\ni.e. childless respondents were more likely to have frequent contact with a\nsibling and people living in single person households were more likely to\nbe childless than those living with a spouse and\/or others. In addition,\nthose living in single person households were more likely to have frequent\ndistance contact with a sibling and no less likely to have distance contact\nwith an adult child when controlling for age. People living in single person\nhouseholds were, however, less likely to have seen another extended\nfamily member in the previous four weeks. Overall, those living in single\nperson households were more likely to be isolated from family contact\nwhen all the different family relationships were considered together.\nHowever, there was no significant difference when controlling for child-\nlessness. Thus, people living in single person households were at a greater\nrisk of familial isolation in terms of lack of contact with an adult child or\nsibling but this is mainly due to the greater likelihood of having no adult\nchild, and the limited extent to which sibling contact compensates for this.\nThere was no evidence that people living in single person households\nwere any more likely to be socially isolated on the other dimensions of\nfriendships and social participation. They were no less likely to have a\nsmaller number of friends when controlling for age, and in fact were more\nlikely to have frequent contact with a close friend. They were less likely to\nparticipate in social organisations overall, but when comparing the oldest\ngroup (over 80s) there was no significant difference. For many people with\nbelow average family contact, social contact seems to compensate to a\nlimited extent. Friends also appear to play a more important role in the\nsupport networks of people living in single person households, especially\namong those with no adult child. Friendship ties may compensate for the\nlack of close family support available to people who live in single person\nhouseholds and do not have children. However, there remained a small\nminority of people living in single person households who were severely\nisolated in both the family and the social sphere and stating they would\nhave no-one to turn to when in need of support.\nOverall, people living in single person households were no more likely\nto experience severe isolation (i.e. combined social and familial iso-\nlation). There were, however, some country differences which should be\nSingle households and risk of isolation\n81\nemphasised, most notably the different pattern evident in Japan, where\npeople living in single person households were at a much greater risk of\nsevere isolation even when controlling for childlessness.\nFor the unmarried, in particular, the data also reveals the important role\nof non-spousal kinship ties in providing practical and emotional support,\nparticularly in Southern and Eastern Europe, whilst non-kinship ties\ntended to be relied upon to a greater extent elsewhere. Again Japan\ndiffered from this pattern, clustering with Southern and Eastern Europe on\nthe variable showing type of support preferred when ill, but being top of\nthe ‘‘league table’’ in turning to a friend for emotional support.\nThis study raises some concerns about the small sub-section of severely\nisolated people living in single person households who were cut off from\ncontact with both a family member, or friend, as well as having no\nparticipation in social organisations. Although living in single person\nhouseholds in itself does not appear to increase the risk of severe isolation,\nthe combination of factors associated with living in single person house-\nholds, such as advanced age (and worsening health), lower social class,\nlow income and most importantly, childlessness, means that those living in\nsingle person households are likely to be at a greater risk. The fact that\nthe data shows the small number of older people who are living in single\nperson households and severely isolated to be more likely to have ‘‘no-one\nto turn to’’ for practical, emotional or financial support, remains a cause\nfor concern. This study therefore highlights the need for policy initiatives\nto target this most isolated of groups and to find ways of supporting and\ndeveloping their social networks. Befriending schemes through which\nvolunteers visit isolated older people in their homes, are one example of a\npractical intervention which aims to address this need and combat social\nexclusion (Fyvie-Gauld & de Podesta 2007).\nAcknowledgements\nThis work is supported by an Economic and Social Research Council\n(ESRC) research grant: RES-000-22-2114. The ﬁndings represent the\nviews of the authors and do not necessarily represent the views of the\nERSC.\nInternational Journal of Ageing and Later Life\n82\nNotes\n1. When correlating weekly contact for seeing adult child or sibling (valid\npercentage) against weekly contact with closest friend r\u00040.626, p\u0004\n0.005.\n2. The Japanese also scored highly on daily contact with close relative, but\nwere much less likely to see a close friend daily.\n3. However, it should be noted that household income data is relative to\neach speciﬁc country and not therefore strictly comparable \u0002 i.e. ‘‘low\nincome’’ persons are computed as those whose household income falls\nwithin the bottom third of the distribution for each country.\nCorresponding Author\nLaura Banks, University of Brighton, SSPARC (Social Science Policy and\nResearch Centre), School of Applied Social Science, Mayfield House,\nFalmer, Brighton BN1 9PH, UK. Email: l.c.banks@bton.ac.uk\nReferences\nAjrouch, K., Antonucci, T. & Janevic, M. (2001). Social networks among\nblacks and whites: The interaction between race and age. Journal of\nGerontology: Social Sciences 56B(2): 112\u0002118.\nAndersson, L. & Sundstro¨m, G. (1996). The social networks of elderly\npeople in Sweden. In H. Litwin (ed.), The Social Networks of Older People\n(pp. 15\u000230). London: Praeger.\nAttias-Donfut, C., Ogg, J. & Wolff, F. (2005). Family support in social and\nfamily context. In J. Siegrist (ed.), Health, Ageing and Retirement in\nEurope \u0002 First Results from the Survey of Health, Ageing and Retirement in\nEurope. Mannheim: Mannheim Research Institute for the Economics of\nAging, University of Mannheim.\nAttias-Donfut, C. & Rozenkier, A. (1996). The lineage structured social\nnetworks of older people in France. In H. Litwin (ed.), The Social\nNetworks of Older People (pp. 31\u000254). London: Praeger.\nBarnes, M., Blom, A., Cox, K., Lessof, C. & Walker, A. (2006). The Social\nExclusion of Older People: Evidence from the First Wave of the English\nLongitudinal Study of Ageing (ELSA). London: New Horizons\nSingle households and risk of isolation\n83\nprogramme, Ofﬁce of the Deputy Prime Minister. http:\/\/monash.\nbepress.com\/research\/199\/\nBurholt, V., Wenger, G. C. & Lamura, G., (with Paulsson, C., van der Meer,\nM., Ferring, D. & Glu¨ck, J.) (2003). European Study of Adult Well-\nbeing: Social Support Resources Comparative Report, Report to\nEuropean Commission, Brussels, Centre for Social Policy Research\nand Development, Institute for Medical and Social Care Research,\nUniversity of Wales, Bangor.\nCampbell, L., Connidis, I. & Davies, L. (1999). Sibling ties in later life: A\nsocial network analysis. Journal of Family Issues 20(1): 114\u0002148.\nCavelli, S., Bickel, J. & D’Epinay, C. (2007). Exclusion in very old age: The\nimpacts of three critical life events. International Journal of Ageing and\nLater Life 2(1): 9\u000231.\nConnidis, I. (1983). Living arrangement choices of older residents:\nAssessing quantitative results with qualitative data. Canadian Journal\nof Sociology 8(4): 359\u0002375.\nFinch, J. (1989). Kinship and friendship. In R. Jowell., S. Witherspoon & L.\nBrook (eds.), British Social Attitudes: Special International Report (pp. 87\u0002\n103). Aldershot: Gower.\nFyvie-Gauld, M. & de Podesta, S. (2007). Neighbourhood care scheme, the\n‘Coronation Street’ model of community care. In S. Balloch & M. Hill\n(eds.), Care, Community and Citizenship (pp. 177\u0002192). Bristol: Policy\nPress.\nHollinger, F. & Haller, M. (1990). Kinship and social networks in modern\nsocieties: A cross-cultural comparison among seven nations. European\nSociological Review 6(2): 103\u0002124.\nHolmen, K. & Furukawa, H. (2002). Loneliness, health and social network\namong elderly people \u0002 a follow-up study. Archives of Gerontology and\nGeriatrics 35(3): 261\u0002274.\nJylha¨, M. (2004). Old age and loneliness: Cross-sectional and longitudinal\nanalyses in the Tampere longitudinal study on aging. Canadian Journal\nof Aging 23: 157\u0002168.\nKeating, N., Otﬁnowski, P., Wenger, C., Fast, J. & Derksen, L. (2003).\nUnderstanding the caring capacity of informal networks of\nfrail seniors: A case for care networks. Ageing and Society 23(1): 115\u0002\n127.\nInternational Journal of Ageing and Later Life\n84\nKeating, N., Swindle, J. & Foster, D. (2005). The Role of Social Capital in\nAgeing Well in Social Capital in Action Thematic Policy Studies. Edmonton,\nAlberta: Policy Research Initiative, University of Alberta.\nKharicha, K., Iliffe, S., Harari, D., Swift, C., Gillmann, G. & Stuck, A.\n(2007). Health risk appraisal in older people 1: Are older people living\nin single person households an ‘at-risk’ group? British Journal of General\nPractice 57: 271\u0002276.\nKlein, S. & Harkness, J. (2001). ISSP study monitoring 2001 report to the\nISSP general assembly. Available on http:\/\/www.za.uni-koeln.de\/\ndata\/en\/issp\/codebooks\/ZA3680_mr.pdf (Accessed: June 19, 2009).\nMartin, L. & Noriko, T. (1991). Interactions of middle-aged Japanese with\ntheir parents. Population Studies 45(2): 299\u0002311.\nPark, A. & Jowell, R. (1997). Consistencies and Differences in a Cross-National\nSurvey. The International Social Survey Programme. London: SCPR.\nPhillips, J., Bernard, M., Phillipson, C. & Ogg, J. (2000). Social support in\nlater life: A study of three areas. British Journal of Social Work 30: 837\u0002\n853.\nPhillipson, C., Bernard, M., Phillips, J. & Ogg, J. (2001). The Family and\nCommunity Life of Older People: Social Networks and Social Support in three\nUrban Areas. London: Routledge.\nScharf, T., Phillipson, C. & Smith, A. E. (2004). Poverty and social\nexclusion \u0002 growing older in deprived urban neighbourhoods.\nIn A. Walker & C. Hagan Hennessy (eds.), Growing Older \u0002 Quality of\nLife in Old Age (pp. 81\u0002106). Maidenhead: Open University Press.\nScott, A. & Wenger, C. (1995). Gender and social support networks in later\nlife. In S. Arber & J. Ginn (eds.), Connecting Gender and Ageing (pp. 158\u0002\n172). Buckingham: Open University Press.\nSheldon, J. H. (1948). The Social Medicine of Old Age. Oxford: Oxford\nUniversity Press.\nThe Council of the European Union. (2002). Fight Against Poverty and Social\nExclusion: Common Objectives for the Second Round of National Action\nPlans \u0002 Endorsement. The Social Protection Committee. AGE: The\nEuropean Older People’s Platform, Brussels.\nVan Tilburg, T., Havens, B. & De Jong, G. (2004). Loneliness among older\nadults in the Netherlands, Italy, and Canada: A multifaceted compar-\nison. Canadian Journal of Aging 23: 169\u0002180.\nSingle households and risk of isolation\n85\nTownsend, P. (1957). The Family Life of Old People. Harmondsworth:\nPenguin.\nTunstall, J. (1966). Old and Alone: A Sociological Study of Old People. London:\nRoutledge and Kegan Paul.\nVictor, C., Scrambler, S., Bond, J. & Bowling, A. (2004). Loneliness in later\nlife. In A. Walker & C. Hagan Hennessy (eds.), Growing Older \u0002 Quality\nof Life in Old Age (pp. 107\u0002126). New York: Open University Press.\nWenger, G. C. (1989). Support networks in old age: Constructing a\ntypology. In M. Jeffreys (ed.), Ageing in the 20th Century (pp. 166\u0002\n185). London: Routledge.\nWenger, G. C. & Burholt, V. (2004). Changes in levels of social isolation and\nloneliness among older people in a rural area: A twenty year\nlongitudinal study. Canadian Journal on Aging 23(2): 115\u0002127.\nInternational Journal of Ageing and Later Life\n86\n"}