{"doi":"10.1068\/d2301ed","coreId":"66772","oai":"oai:dro.dur.ac.uk.OAI2:188","identifiers":["oai:dro.dur.ac.uk.OAI2:188","10.1068\/d2301ed"],"title":"Remember Fallujah : demonising place, constructing atrocity.","authors":["Graham,  S. D. N."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2005","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66772.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/188\/1\/188.pdf","pdfHashValue":"b7c12d595c4994a3c79292a338908e97cbcb1d30","publisher":"Pion","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:188<\/identifier><datestamp>\n      2011-04-20T09:14:37Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Remember Fallujah : demonising place, constructing atrocity.<\/dc:title><dc:creator>\n        Graham,  S. D. N.<\/dc:creator><dc:subject>\n        Urban warfare<\/dc:subject><dc:subject>\n         Cities<\/dc:subject><dc:subject>\n         Military targets.<\/dc:subject><dc:publisher>\n        Pion<\/dc:publisher><dc:source>\n        Environment and planning D : society and space, 2005, Vol.23(1), pp.1-10 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2005<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:188<\/dc:identifier><dc:identifier>\n        issn:0263-7758<\/dc:identifier><dc:identifier>\n        issn: 1472-3433<\/dc:identifier><dc:identifier>\n        doi:10.1068\/d2301ed<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/188\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1068\/d2301ed<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/188\/1\/188.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1472-3433","issn:0263-7758","0263-7758"," 1472-3433"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2005,"topics":["Urban warfare","Cities","Military targets."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n02 July 2008\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nGraham, S. D. N. (2005) ’Remember Fallujah : demonising place, constructing atrocity.’, Environment and\nplanning D : society and space., 23 (1). pp. 1-10.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1068\/d2301ed\nPublisher’s copyright statement:\nAdditional information:\nGuest editorial.\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n1 \n \nRemember Fallujah :  \nDemonising Place, Constructing Atrocity \n \nGuest Editorial for Environment and Planning D: Society and Space \n \nStephen Graham \n \nAnd what will their faces tell them \nWhen they look in the mirror \nWhen they look on their dressers \nAnd see the pieces of metal they were given \nFor killing us in our own homes, in our cities, in our mosques and \nchurches, \nWhat will their eyes say, what will they say when their twisted lies \nare uncovered \nWhen the rest of the world speaks of their massacres of women \nand children, of old men \nOf bombing hospitals \n \nExcerpt, ‘This Night in Fallujah’ by Sam Hamod  \n(cited in Whitney, 2004). \n \nIn late 2001 I received an invitation from a Geographers at Haifa University to attend \nan ‘urban’ conference. Through the usual e-mail channels, he had heard that, at that \ntime, Simon Marvin and I were organising a  conference called Cities as Strategic \nSites: Militarisation, Anti-Globalisation, and War, to be held in Manchester the \nfollowing Spring. The Haifa academics organising the event thought that the two \nevents would clearly address similar issues -- hence the invite.  Simon and I, whilst \ndeeply ambivalent about attending an event in Israel, decided to go, expecting that it \nwould involve social science discussions about the changing intersections of \nurbanisation and political violence.  \n \n2 \nIt was no such event. Populated by senior US Marine Corps, Israeli Defense Force \nand British Army specialists and commanders in ‘urban warfare’, and representatives \nfrom the likes of the RAND Corporation, we quickly realised that the conference was \none of an ongoing series where practitioners of state ‘urban warfare’ exchanged  \npractical tips on fighting wars and counter-insurgency operations in cities. Once the \ninitial shock of being catapulted into a dark world of ‘urban research’ that we never in \nour wildest nightmares imagined existed, Simon and I retreated to a nearby bar for a \nlong discussion about what to do. Fairly naïvely, in retrospect, we were revolted and \nangry to discover that urban state killing had been elevated to a technoscientific \ndiscipline with its own conference series, research centres and journals. We were \nsickened by the euphemistic and obfuscatory language where every discursive trick \nwas employed to not call a killing a killing. We were amazed to discover that US, \nIsraeli and British ‘experts’ in this emerging field of ‘urban warfare’ were such close \nfriends that they seemed to constituted a  transnational  social body, orchestrating \nthe intense exchange of technology, experience, training and experience between \nthe three nations.  We were nauseated at the bellicose technophiliac masculinities, \nwhere systematic repression and state killing were portrayed in glossy Powerpoint \nSlides  with a palpable sense of fascination, even excitement. Finally, the fact that \nthe organisers of the event were geographers astonished us.  \n \nAfter considerable deliberation we decided to stay on to the end of the event, \nconscious that this dark world of ‘urban’ research was virtually unknown in critical \nsocial science (at least as far as we knew). Better to stay, and record everything we \ncould, we thought, than make some political statement by leaving half way through. \n \nThe Construction of ‘Urban Warfare’ \n \nIn the years since that week has constantly haunted me. My personal research \nagenda radically transformed, I have since tried to help expose the dark, obscured \nterrains where states systematically practice, hone, and exchange their skills in city \nkilling, and killing in cities. Meanwhile, the murderous effects of Sharon’s incursions \ninto the Occupied Territories, and Bush’s ‘war on terror’ invasions of Afghanistan and \nIraq, have provided a continuous stream of gory evidence of the importance of \nemerging doctrines of ‘urban warfare’ (see Graham, 2003, 2004a,b,c). Strikingly, the \n3 \ntricks of the trade of such warfare have, since 2001, quickly morphed to once again \nbecome central platforms of state geopolitical power. Fuelled by a paranoid sense \nthat global urbanisation is somehow working to undermine the technoscientific, \ndisciplinary and killing abilities of imperial nation states, so the techniques and \nstrategies discussed in Haifa have provided the basis for radical rethinks in how the \nUnited States, the other Western powers, and Israel, wage war. \n \nThe symptoms and  results of such a transformation are now all too clear. In fact, \nthey are difficult to escape. There is the demonisation and the calls to annihilate \ncities that symbolise resistance to colonial power ; the masking of atrocities through \nan all-encompassing ‘terrorist’ discourse; and the Orientalist ‘Othering’ of Arab urban \nplaces and their inhabitants.  Then there are the assaults on dense cities with \nhelicopter gunships, cluster bombs and artillery; the ‘psychological operations’ that \ninvolve the bombing and targeting of journalists’  who have the temerity to show the  \nresulting carnage on the ground ; and the voyeuristic consumption of city-killing for \npleasure and entertainment  in news and video games (some produced by the \nmilitaries themselves). Finally, there are the political calls to destroy, ‘cleanse’ or \n‘pacify’ aberrant, dehumanised ‘terrorist nest’ cities who’s inhabitants, it is endlessly \nimplied, might easily project unimaginable terror on to western cities if not \nannihilated. \n \nAll are elements in the call to legitimise, celebrate, be entertained by, even consume, \norgies of state terror.  Sharon’s ‘Operation Defensive Shield’ in 2002 provided the \ntemplate here. Two months after the Haifa conference, with US ‘urban warfare’ \nspecialists actually participating,  the Israeli ‘Defense’ Force, using the techniques \ndiscussed in  that event, demonstrated that they could violently repress the Intifadah \nby going into the hearts of densely packed Palestinian cities and refugee camps. \nWith techniques blending real-time high-tech surveillance, total coverage by sniper \nfire, bulldozing, and blowing  continuous new streets and walkways through the built \nfabric of cities, the Israelis laid the basis for a paradigm shift in military thinking that \nhas since been closely studied as the model for the US invasions of Afghanistan \nand, particularly, Iraq. \n \n4 \nFallujah: Atrocity Invisible \n \nIn Iraq it has been estimated in a Lancet article that at least 100,0000 people died  \nprematurely between the US-UK invasion in March 2003 and September 2004, \nmostly through the effects of aerial bombing,  helicopter gunships, rockets, and the \nurban insurgency (Roberts et al, 2004). More than 50% of the deaths recorded in this \nstudy were women and children.   \n \nTellingly, one Iraqi city was systematically excluded from this research because the \ndeath-rates revealed by the adopted methodology were considered so high by the \nresearch team  that they would unreasonably skew the overall national results, so \nradically increasing the above estimate still further. This is the city that, after Jenin in \n2002, has now come to symbolise the attempted killing of a city, or urbicide, by the \nmassive high-tech forces of  imperial  nation states  in our ‘colonial present’ \n(Gregory, 2004a).  \n \nThis city, of course, is Fallujah, a largely Sunni and densely populated city with a  \npopulation of 300,000, 50 kms to the west of Baghdad. The initial insurgency in the \nCity was sparked by the killing there, in cold blood, of 18 civilians protesting about \nthe US military’s initial occupation of their primary school on April 28 2003. Following \nthis, the burgeoning resistance against US occupation in Fallujah emerged to \nsymbolise the wider Iraqi insurgency on both sides. Fallujah was thus constructed as \nthe symbolic centre of resistance against the installation of a US friendly regime in \nIraq. It was also repeately alleged, but totally unproven, that the City was the base \nfor the key Islamist resistance leader Aby Musab al Zarqawi.  \n \nThe US forces’ first attempt to ‘pacify’ the City began between the 4 and 9th April, \n2004, after four private military contractors were killed and mutilated there in front of \nglobal news teams.  2,000 US Marines took part in the first siege and assault.  \nThrough a carefully orchestrated strategy of air strikes, helicopter missile attacks, \nmortar and artillery bombardments, cluster bomb raids, assaults by circling Hercules \n‘gunship’ aircraft, and night-time ‘sweeps’ by ground forces, the US forces together \nparticipated in the most unrestricted US assault on a densely populated city since \n5 \nthe Iraq war had begun. US forces withdrew on April 29th and less intense gun \nbattles resumed in the City.  \n \nBy then at least six hundred (and possibly up to  880) Iraqis lay dead. Over 1500 \nwere seriously wounded. 60,000 refugees had been forced from their homes. Ten \nMarines had also been killed (Wilding, 2004). On 14th April Iraqi medical staff \nworking for the Médecins sans Frontières NGO -- who had entered Fallujah on April \n10th on a bus filled with medical equipment -- spoke of the casualties that they found \nin the City on their arrival. By Sunday 11th April, an audit of all hospitals treating \ncasualties from the assault revealed that, of the 518 confirmed dead by that date, at \nleast 157 were women and 146 were children. 100 of the dead children were under \nthe age of twelve. 1200 wounded people had also been admitted (Ekklesia, 2004).  \nDr Abed Al-Ilah, a representative of the US-appointed Iraqi Governing Council, \nreported after visiting the city on April 13th that \"about 350 out of the 600 dead were \nwomen and children [..]. Many died from simple wounds and could have been saved \nif they had had medical attention\" (Cockburn,  2004). \n \nAfter the temporary withdrawal of US forces, the lack of control of the US military \nover Fallujah morphed into a massive symbolic call amongst large parts of the US \npolity and media to urbicide and place annihilation. As the US Presidential election \ncampaign continued, and radical Islamists stepped up their hostage-taking (and \nmurdering), and their brutal suicide bomb campaigns against those associated with \nthe Interim government, so the political and popular obsession with ‘taking out \nFallujah’ reached frenzied proportions.  \n \nWith Bush re-elected, a much more massive, and even more violent, second assault \non Fallujah was launched in early November 2004. Deliberately bombing the Nazzal \nhospital first -- presumably to reduce the chances of casualty images and figures \nleaking out to the outside world this time -- this assault seems likely, at the time of \nwriting (26th November 2004), to go down as one of the major war crimes of the early \n21st century. The horrors of the assault are only now starting to emerge.  As of \nNovember 20th, US forces claimed that at least 1200 \"insurgents’ lay dead. Little \nmention was made, however, of the very high numbers of dead and wounded \ncivilians (100,0000 of which were still in the City during the second assault). The \n6 \nNew York Times, quoting the International Red Crescent, estimated on November \n20th that over 800 civilians had been killed (Wong, 2004). 54 US Marines and 9 Iraqi \nsoldiers had also been killed by that date.  \n \nIt is very clear that the newly re-elected Bush regime, emboldened by the electoral \nvictory, was keen to unleash their deepest fantasies of place annihilation in the \nsecond Fallujah assault. Simply irritated that the population of an entire city, grieving \nand enraged after the carnage of the first assault, could sit outside their dreams of \n‘Full Spectrum Dominance,’ Fallujah and its citizens were singled out for special \nattention. As Robin Cook, Blair’s ex Foreign Secretary, commented, Paul Wolfowitz, \nin particular, was \"furious [in Spring 2004] when the outcry among both Sunnis and \nShias obliged the Marine corps to abandon its siege\" (2004, 28). US forces, \nmeanwhile, entertained fantasies of some final military assault  on Fallujah that \nwould be their biggest ‘urban operation’ since they invaded Hue in Vietnam after the \nTel Offensive in 1968  (Ramadani, 2004, 30). \n \nIn this second assault, indiscriminate artillery barrages were employed. British forces \nwere moved North to help lay siege to the City. Once the barriers were in place, all \nmen of ‘military age’ were prevented from leaving the City. Water and power were \nswitched off. Mass demolitions were employed. Dozens of mosques were occupied \nor bombed. Humanitarian aid convoys and non-‘embedded’ independent journalists \nwere prevented from entering the City. Above all, over 12,000 Marines were \nsystematically trained to employ new rules of engagement. \"Shoot everything that \nmoves and everything that doesn’t move\", instructed one Marine commander in the \nrun-up to the assault (Al-Jazeera, 2004). Marines were told that they should shoot \ndead any male on the street between 15 and 50 -- even if they unarmed -- if they \ncould in any way be viewed as a \"security threat\".  When Marines asked a  Gunnery \nSergeant for clarification on this policy, he told his men that if they saw \"military-age\" \nmen on the street that they should ‘drop ‘em\" (Al-Jazeera, 2004) This policy was \ncaptured on film when an embedded TV reporter filmed the routine killing of injured \nfighters in the City. \n \nBoth assaults on Fallujah were legitimised by powerful propaganda campaigns, by \nUS state PR operations and mainstream and pro-Bush US media alike.  Both \n7 \ndepicted virtually all the Iraqi casualties that resulted from the attack as \"terrorists\", \n\"al-Qaeda fighters,  \"Saddam loyalists\", or \"foreign insurgents\". Both also widely \nfollowed General Richard Myers, Chair of the US Joint Chiefs of Staff, when he \nlabelled the whole of Fallujah as a dehumanised \"rat’s nest\" or \"hornet’s nest\" of \n\"terrorist resistance\" against US occupation that needed to be \"dealt with\" \n(News24.com 2004). \"The enemy has got a face\", Marine Colonel Gareth Brandl told \nthe BBC before the second assault. \"He’s called Satan. He lives in Fallujah\" (quoted \nin Klein, 2004a). The second assault was also legitimised as necessary so that ‘free’ \nelections could go ahead in January 2005. So complicit were mainstream US media \nin such constructions that, astonishingly, letters to various newspapers after the \nsecond assault complained that a widely circulated picture of one Marine in action \nduring the battle showed him smoking a cigarette (Klein, 2004b).  \n \nIn making sense of the Fallujah atrocities, three points deserve special emphasis. \n \nOrientalist Dehumanisation \n \nFirst, the Fallujah assaults, and the United State’s many other military incursions into \nIslamic cities are, of course, discursively constructed and legitimised. They rest on \ncomplex imaginative geographies which manipulate the discourses of the ‘war on \nterror’ to project, and construct, Islamic urban places, and their inhabitants, in \nextremely powerful ways (Gregory, 2004a).  \n \nCentral here is the principle of the absolute eternality of the ‘terrorist’  -- the inviolable \ninhumanity and shadowy, monster-like status of those deemed to be actual or dormant \n‘terrorists’ or those deemed sympathetic to them. Crucially, any act of resistance to US \ninvasion and occupation is branded as a ‘terrorist’ act through such discourses (even \nthough ‘terrorist’ violence against a military occupier of one’s homeland is, by most \ndefinitions of the word, impossible). The ‘enemy’ is thus \"criminalised if he defends \nhimself and returns fire with fire\" (Zizek, 2002).  \n \n“Terrorist’ discourses do much to shield the realities of  US state terror. As Al-Mufthi \n(2004) notes, describing one family’s losses in the second assault, that: \n8 \n “relatives of Ateka Abdel Hamid, 24, did not know that this \nseven-month pregnant woman was a terrorist until the day she \ndied. As the family collected the mutilated bodies of Ateka and \nher family, a United States spokesman boasted that the \n‘multinational forces’ killed a number of terrorists and Al-\nZarqawi supporters during an offensive in Falluja. The terrorists, \nit turned out, were Ateka, her three-year-old son Omar, her \nhusband Tamer and six other members of her family.”  \n \nLegitimations of the assaults on Fallujah, and other Iraqi cities, have also relied on \nOrientalist tropes and clichés  (see Tuasted, 2003). These emphasise the supposed \nimpenetrability and structurelessness of Islamic cities and the purported irrationality, \nbackwardness and infantile nature of their inhabitants. Closely leavened here also \nare heavy doses of dehumanising racism and Islamophobia. All this, of course, is \nconstructed in a complex binary system where the Orientalized, barbarian, terroristic \nOther is opposed to the legitimate, rational, technologised mastery of \"Western \ncivilisation\", who have the mandate to possess and direct the \"Orient\", colonially, \nfrom afar (Said, 1978). \n \nLike Palestinian civilians in Israeli military discourse, then, US depictions of Iraqi \ncivilians construct them, \"essentially, as evil children who have to be brought back to \nan honest life by stern discipline and punishment\" (Zizek, 2002). As Edward Said \nstressed just before his death,  \"without a well-organised sense that these people \nover there were not like ‘us’ and didn’t appreciate ‘our’ values -- the very core of the \nOrientalist dogma -- there would have been no war\" in Iraq  (Said, 2003, x-xxiii.). \n \nWidespread pronouncements of the US soldiers themselves illustrate these racist \nimaginative geographies all too clearly. In both assaults US Marine snipers in \nFallujah, for example, talked exultantly about their ‘kills’ of \"rag-heads\" and \"sand \nniggers\" (Davis, 2004). US officers also widely employed Orientalist tropes \nemphasising some essentialised, racist notion of the ‘Arab mind’ to legitimise the use \nof overwhelming US fire power.  Take, for example, the view of Captain Todd Brown, \none company commander with the U.S. Fourth Infantry Division in Baghdad. In early \n9 \nDecember 2003, he stated that, to control Iraqi cities with military force, \"you have to \nunderstand the Arab mind. The only thing they understand is force – force, pride and \nsaving face\" (cited in Filkins, 2003). \n \nSuch a blend of Orientalism, dehumanisation, Islamophobia, and ‘terrorist’ Othering  \ndoes the (geo)political work of casting out Islamic cities -- and their inhabitants -- \nfrom any notion of ‘civilisation’. From Huntingdon’s binaries of a ‘clash of \ncivilisations’, to a widespread demonisation of entire Islamic cities as ‘terrorist’ or \nbarbarian ‘nests’ amongst US military and political leaders and mainstream media, \nsuch discourses directly legitimise the use of massive, indiscriminate force by US \nforces in Islamic cities.  \n \n‘Kill Faster!’ Constructing Islamic Cities as Military Targets \n \nThe discursive roots of the US military’s racist, dehumanising approach to Islamic \ncities are deep and multitudinous. They are influenced, of course, by the \npronouncements of their political leaders that Iraq is a pivot in an \"axis of evil\" where \nthe US forces of ‘freedom’ and ‘good’ must engage ruthlessly with ‘terrorist’ \nbarbarians, ensconced within fundamentally ‘evil’ cities. They are also constructed \nthrough the outputs of  mainstream US media, which pumps out endless ‘action’ \nfilms in which Arabs are unerringly \"portrayed as stupid, animalistic, amoral, sex-\nstarved, abusive, wife-battering terrorists who seek to kill themselves and their \nchildren\" (Al-Atraqchi,  2004). \n \nAbove all, though -- and this is my second key point -- huge discursive efforts are \nalso being made to continually construct, and reconstruct, Islamic cities as little more \nthan receiving points for US military ordnance (Gregory, 2004a). \n \nThe US Army  -- which now brands itself as \"the world’s premier land force\" -- itself \nworks hard and at many levels to demonise Islamic urbanism per se. Now one of the \nworld’s biggest developer of video games, it gives games such as America’s Army  -- \nwith its simulations of ‘counter terror’ warfare in densely packed Islamic cities in a \nfictional country of ‘Zekistan’ --  free to millions over the Internet. \"The mission\" of \nAmerica’s Army, writes Steve O’Hagan: \n10 \n\"is to slaughter evildoers, with something about ‘liberty’ [...] going on in \nthe back ground [...]. These games may be ultra-realistic down to the \ncalibre of the weapons, but when bullets hit flesh people just crumple \nserenely into a heap. No blood. No exit wounds. No screams\" (O’Hagan, \n2004, 12). \n \nTo parallel such virtual, voyeuristic Othering -- the mass, racist construction of \n(virtual) bodies for potential  and actual US military recruits to routinely kill for \nentertainment -- US forces have constructed their own ‘shadow’ urban system : a \nchain of 60 mock ‘Islamic’ urban districts, built across the world since 9\/11, and \ndesigned purely to hone the skills of US forces in fighting and killing in ‘urbanised \nterrain\".  Taking 18 months to construct, these simulated ‘cities’ are then endlessly \ndestroyed and remade in practise assaults that hone the US forces for the ‘real thing’ \nin sieges such as those in Fallujah (Davis, 2004).  \n \nReplete with minarets, pyrotechnic systems, loop-tapes with calls to prayer, donkeys \nand hired ‘civilians’ in Islamic dress  wandering through narrow streets, and olfactory \nmachines to create the smell of rotting corpses, this shadow urban system works like \nsome bastard child of Disney. It simulates, of course, not the complex cultural, social \nor physical realities of Middle eastern urbanism, but the imaginative geographies of \nthe military and theme park designers that are brought in to design and construct it.  \n \nAll this furthers the deep discursive equivalence that is constructed between Islamic \nurban places and ‘terrorist nest’ war zones to be assaulted and ‘cleansed’. Military \ncommanders often compare the various facilities as though comparing cities as \nholiday destinations. \"The advantage of [the training complex at] George Air Force \nBase\", reflected Colonel James Cashwell in March 2003, \"is that it is ugly, torn up, all \nthe windows are broken and trees have fallen down in the street. It’s perfect for the \nreplication of a war-torn city.\" (cited in Wilson, 2004). \n \nFinally,  the US Military’s demonisation of Islamic (and other majority world) cities per \nse is accomplished through the combined vitriol of a whole legion of US military \n‘commentators’ who enjoy huge coverage,  exposure and influence in the US media. \nTaking advantage on the traditional reticence of US forces to engage in urban \n11 \nwarfare, these commentators endlessly discuss what is known in the jargon as \n\"Military Operations on Urbanized Terrain\" (or ‘MOUT’). Once again, they serve to \nconstruct  Islamic urbanism as little more than a combat site, a killing zone which \nchallenges the US to harness its techno-scientific might to sustain hegemony and \nempire by killing ‘terrorists’ as rapidly and efficiently as possible with as few (US) \ncasualties as possible.  \n \nCrucially, here, the purportedly irrational, structureless and impenetrable spaces of \nCasbahs and Medinas are cast as little more than the results of deliberate strategies \nto interrupt the high-tech killing power of US forces: the only  remaining shelters  \nfrom the verticalised, orbital targeting that sustains US global military pre-eminence.  \n \nOne of the most influential sources of these discursive appeals to the Islamic  city-\nas-target is Ralph Peters, a retired U.S. military urban warfare specialist and an \ninfluential columnist on Rupert Murdoch’s neo-conservative New York Post. Peters’s \nstarting point is that  the majority world’s burgeoning megacities and urbanising \ncorridors are spaces where \"human waste goes undisposed, the air is appalling, and \nmankind is rotting\" (Peters, 2002, 6).  Here, cities and urbanisation represent little \nbut decay, anarchy, disorder and the post Cold War collapse of ‘failed’ nation states.  \n\"Boom cities pay for failed states\", he writes, \"post-modern dispersed cities pay for \nfailed states, and failed cities turn into killing grounds and reservoirs for humanity’s \nsurplus and discards (guess where we [i.e. the United States military] will fight)\" \n(Peters, 1996, 2). \n \nAnd yet even the savagery of the  first US assault on what Ralph Peters calls the \n\"terror-city\" of Fallujah did little to satisfy Peters’s bloodlust for violent mastery of \nIslamic cities (Peters, 2004a). Praising the US Marines \"for hammering the terrorists \ninto the dirt\" during this first assault, Peters nevertheless  castigated the cease fire \nnegotiations  after the battle that, he argued, allowed those ‘terrorists’ left alive to \nmelt back into the civilian population (Peters, 2004b). Again, the symbolic \nimportance of Fallujah was strong in his mind : \"make no mistake: There can be no \ncompromise in Fallujah. It we stop one inch short of knocking down the last door in \nthe last house in the city, our enemies will be able to present the Battle of Fallujah to \ntheir sympathisers as a great victory\" (Peters, 2004b).  \n12 \n \nNearly a month later, Peters concluded that a military, technological solution was \navailable to US forces that would enable them to ‘win’ such battles more conclusively \nin the near future: killing faster, before any international media coverage is possible. \n\"This is the new reality of combat,\" he wrote. \"Not only in Iraq. But in every broken \ncountry, plague pit and terrorist refuge to which our troops have to go in the future\" \n(2004b).  \n \nArguing that the presence of \"global media\" meant that \"a bonanza of terrorists and \ninsurgents\" were allowed to \"escape’ US forces in Fallujah, US forces, he argued \" \nhave to speed the kill\" (Peters, 2004c).  By \"accelerating urban combat\" to \"fight \nwithin the ‘media cycle’ before journalists sympathetic to terrorists and murderers \ncan twist the facts and portray us as the villains,\" new technologies are needed, \nPeters argues, so that \"our enemies are overwhelmed and destroyed before hostile \ncameras can defeat us. If we do not learn to kill very, very swiftly, we will continue to \nlose slowly\" (Peters, 2004c). \n \nThe second Fallujah assault was certainly planned to maximise the speed, and \nscale, of  the killing of ‘insurgents’. \"By quitting in April, we created the terrorist city-\nstate of Fallujah\", Peters argued. \"Now we need to shut it down for good\" (sic. \n2004d). Discussing the high ‘kill number’ on Murdoch’s Fox News, he argued that \n\"the best outcome, frankly, is that  [the insurgents are] all killed\". He was proud that \n\"the proportion of killed to prisoners is extraordinarily high and that is good news \nbecause, at the end of the day, this is about taking Fallujah […]. You kill enough of \nthe right people and you make the problem a lot smaller\" (cited by News Hounds, \n2004). “Even if Fallujah has to go the way of Carthage, reduced to shards, the price \nwill be worth it” (Peters, cities in Lobe, 3004). \n \nCasting Out Islamic Cities \n \nThe third and final point to stress is that the tightly-coupled projects of dehumanising \nthe people living in islamic cities, and demonising such cities so that they can be \nconstructed as little more than spaces to absorb US military firepower, together work \nto produce a third discursive trick. In constructing people as inhuman ‘terrorist’ \n13 \nbarbarians understanding little but force, and urban places as animalistic labyrinths \nor \"nests\" demanding massive military assault,  Islamic cities, and their inhabitants, \nare, in turn, cast out beyond any philosophical, legal or humanitarian definitions of \nhumankind or \"civilisation\" (Gregory, 2004a, chapter 6).  Civilian inhabitants of cities \nsuch as Fallujah are thus denied the protection of international law. Their piling up \nbodies remain unworthy, largely invisible, unrecorded and uncounted. And their \ndeaths are rendered of no account. Like the inmates of Abu Ghraib, Basra Airbase or \nGuantánamo Bay (Gregory, 2004c), such dying civilians and resistance fighters \nbecome examples of Agamben’s homo sacer or ‘bare life’ -- mere zoological \norganisms to be targeted through force and disciplinary measures who are \ncompletely devoid of political or human rights (Agamben, 1998).  Derek Gregory has \ntermed such  people \"the half-human detritus of Bush’s Holy War\" (Gregory, 2004b).  \n \nHere a final perverse twist emerges in the massive discursive work being done \nto construct Iraqi civilians and the cities in which they live as targets for the \nUnited State’s latest military firepower. Here, the already deep connections \nbetween the Iraq war and the Israeli-Palestinian war become deeper still \n(Graham, 2004c). For, by ‘casting out’ ordinary Iraqi civilians so that they, their \ncities, and the fragile infrastructures upon which they rely to survive become \nthe targets of massive US firepower, these discourses help to forcibly create a \nkind of chaotic urban hell.  \n \nPerversely, then, in places like Fallujah, the violence of the ‘war on terror’ -- \nfollowing as it does the massive demodernisation brought by the 1991 war and \ntwelve years of sanctions-- produces exactly what the above discourses depict \n: an urban world \"outside of the modern, figuratively as well as physically\" \n(Gregory, 2003, 313). As the despair amongst those unlucky enough to be in \nthe way of the hate-filled violence of US forces pushes them to support their \nown violent resistance, so the self-fulfilling cycles of ‘war on terror’ take another \nbloody turn. For, as Zulaika argues: \n“the ultimate catastrophe is that such a categorically ill-\ndefined, perpetually deferred, simple minded Good-versus-\nEvil war [‘against terror’] echoes and re-creates the very \nabsolutist mentality and exceptionalist tactics of the insurgent \n14 \nterrorists. By formally adopting the terrorists’ own game – \none that by definition lacks rules of engagement, definite \nendings, clear alignments between enemies and fiends, or \nformal arrangements of any sort, military, political, legal, or \nethical – the inevitable danger lies in reproducing it \nendlessly” (2003, 198),   \n \nReferences \n \nAgamben,  G. 1998, Homo Sacer. Sovereign Power and Bare Life, Stanford, Ca. : \nStanford University Press. \nAl-Atraqchi, F. 2004, \"Racism at core of Iraq invasion\", The Black Commentator, \nIssue 89, May 6. \nAl-Jazeera, 2004 \"Falluja troops told to shoot on sight\",  22 November, \nhttp:\/\/english.aljazeera.net\/NR\/exeres\/75E3CA31-83B0-46FD-A762-\n0C1157C408F9.htm\nAl Mufthi, N. (2004), “Who are the terrorists in Falluja?”,  Abu Saleh, Middle East \nZone, http:\/\/www.abusaleh.com\/index.php?id=513. \nCockburn,  P. 2004, \"The sick, the old, and the young ask: ‘Do we look like \nfighters?’\", Counterpunch.org, April 13 (accessed 10 June 2004). \nCook R. 2004, \"Bush will now celebrate by putting Falluja to the torch’, The \nGuardian, November 5, 28. \nDavis, M. 2004, \"The Pentagon as global slum lord\", TomDispatch, \nhttp:\/\/www.tomdispatch.com\/, April 19th, accessed June 10th. \nEkklesia, 2004, \"Christian peacemakers report killings of women and children by US \ntroops in Fallujah\", Ekklesia, www.ekklesia.co.uk, 14th April, accessed 10 June \n2004. \nFilkins, D. 2003, \"Tough new tactics by US tighten grip on Iraqi towns\", New York \nTimes, December 7. www.nytimes.com, accessed 10 June 2004. \nGraham, S. 2003, \"Lessons in urbicide\", New Left Review, 19, Jan\/Feb, 63-78. \nGraham, S. (ed.) 2004a, Cities, War and Terrorism: Towards an Urban Geopolitics, \nOxford: Blackwell. \nGraham, S. 2004b, \"Constructing urbicide by bulldozer in the Occupied Territories\". \nIn Graham, S. (ed.), Cities, War and Terrorism, Oxford :  Blackwell, 192-213 ;  \n15 \nGraham, S. Graham, 2004c, \"Cities, warfare, and states of emergency\". In Graham, \nS. (ed.), Cities, War and Terrorism: Towards an Urban Geopolitics, Oxford : \nBlackwell.  1-30. \nGregory, D. 2003, \"Defiled cities\", Singapore Journal of Tropical Geography, 24(3), \n307-326. p. 313. \nGregory, D. 2004a, The Colonial Present, Oxford: Blackewell. \nGregory, D. 2004b, \"Who’s responsible? Dangerous geography\", ZNet, \nwww.znet.org, May 3rd, accessed May 10, 2004. \nKeyser, J. 2004, \"Fallujah challenge : Urban warfare\",  Salt Lake Tribune, 29th April. \nKlein, N. 2004a, \"Die, then vote. This is Falluja, The Guardian, November 13, 23.23 \nKlein, N, 2004b, Smoking while Iraq burns, The Guardian, November 26, 27. \nNews24.com 2004, \"Fallujah a ‘rat’s nest’\", www.news24.com, 21st April, accessed \n15 June 2004. \nLobe, J. 2004, “‘Phantom fury’ poised to become phantom victory”, Common Dreams \nNewsCentre, www.commondreams.org, November 9th. \nO’Hagan, S. 2004, \"Recruitment hard drive\", Guardian Guide, June 19-25, 12-13. \nNews Hounds, 2004, \"Lt. Col. Ralph Peters: In Praise of Killing\", News.Hounds.Com \n(25 November, 2004) \nPeters, R.  1996, \"Our soldiers, their cities\", Parameters, Spring, 1-7. \nPeters, R. 2004a, \"Getting Iraq right\", New York Post, April 29th, www.nypost.com, \naccessed 10 June 2004. \nPeters, R. 2004b, \"He who hesitates\", New York Post,  April 27th, www.nypost.com, \naccessed 10 June 2004. \nPeters, R. 2004c, \"Kill faster!\", New York Post, May 20, www.nypost.com, accessed \n10 June 2004. \nPeters, R. 2004d, \"Finishing Fallujah\", New York Post, November 9th, \nwww.nypost.com, accessed 25th November 2004. \nRamadani, 2004, \"Falluja’s defiance of a new empire\", The Guardian, 10th \nNovember, 30. \nRoberts, L., Lafta, R., Garfield, R., Khudhairi, J. and Burnham, G., 2004, \"Mortality \nbefore and after the 2003 invasion of Iraq: Cluster sample survey\", The Lancet, 29 \nOctober, 1-8. \nSaid, E. 1978, Orientalism, London : Routledge and Kegan Paul \n16 \nSaid, E. 2003, \"Preface to Orientalism\". In E. said. Orientalism, 2003 Edition, \nLondon: Penguin, x-xxiii. \nTuastad, D. 2003, \"Neo-Orientalism and the new barbarian thesis: Aspects of \nsymbolic violence in the Middle East conflict(s)\", Third World Quarterly, 24, 4, 591-\n599. \nWhitney, M. 2004, \"Falluja and the erosion of American power\", Znet, November 14, \nZnet.com. \nWilding, J. 2004, \"’Getting aid past US snipers is impossible’\", The Guardian, 17th \nApril, 13.  \nWilson, J. 2004, \"Army expands home-based MOUT training\", Military Training \nTechnology, March 2003, accessed  10 June 2004. \nWong, E. 2004, \"For one family in Falluja, a simple drive turns deadly\", New York \nTimes, 20th November, \nhttp:\/\/www.nytimes.com\/2004\/11\/20\/international\/middleeast\/20family.html \nZizek, S., 2002, \"Are we in a war ? Do we have an enemy ?\",  London Review of \nBooks,  24\/10, 23 May 2002. \nZulaika, J, 2003, “The self-fulfilling prophecies of counterterrorism, Radical \nHistory Review, 85, 191-199. \n \n \nAcknowledgements \n \nThanks to the British Academy without who’s support this research would not have \nbeen possible. \n \n \n \n \n \n \n \n \n \n \n17 \n \n \n \n \n \n \n \n \n \n \n \n \n"}