{"doi":"10.1093\/forestry","coreId":"62057","oai":"oai:nora.nerc.ac.uk:6797","identifiers":["oai:nora.nerc.ac.uk:6797","10.1093\/forestry"],"title":"Effects of climate and management history on the distribution and growth of sycamore (Acer pseudoplatanus L.) in a southern British woodland in comparison to native competitors","authors":["Morecroft, Michael D.","Stokes, Victoria J.","Taylor, Michele E.","Morison, James I. L."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2008-01","abstract":"Sycamore (Acer pseudoplatanus L.) is an invasive, non-native species in Great Britain and its management in conservation areas is controversial. Climate change adds further uncertainty to decision making. We investigated the role of management history in determining present-day abundance and the effects of climatic variability on growth, photosynthesis and phenology at Wytham Woods, a UK Environmental Change Network (ECN) monitoring site. Relatively few sycamore trees were found in undisturbed ancient, semi-natural woodland and recent plantations, despite being common in other areas of the site. Sycamore grew more slowly than ash (Fraxinus excelsior L.), its principal competitor, but at a similar rate to pedunculate oak (Quercus robur L.) in the period 1993–2005. There were fewer sycamore than ash seedlings, regardless of which species dominated the canopy. Growth of sycamore was slower in dry periods than wet ones and lower photosynthetic rates were measured in canopy leaves under dry compared with wet soil conditions. This study therefore suggests that sycamore does not present a serious threat to undisturbed ancient woodland on the site and that it may eventually decline in areas of the site where it competes with ash, in the absence of disturbance. It may also decline under climate change if summer droughts become more frequent. \\ud\n\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/62057.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/6797\/1\/Morecroft_et_al_Forestry_ms_resubmission_final_Sept_07.pdf","pdfHashValue":"4a333bdbf1fd1cc71c7529032b0ef28b63f06492","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:6797<\/identifier><datestamp>\n      2012-11-22T12:03:54Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D5336<\/setSpec><setSpec>\n      7375626A656374733D533131<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/6797\/<\/dc:relation><dc:title>\n        Effects of climate and management history on the distribution and growth of sycamore (Acer pseudoplatanus L.) in a southern British woodland in comparison to native competitors<\/dc:title><dc:creator>\n        Morecroft, Michael D.<\/dc:creator><dc:creator>\n        Stokes, Victoria J.<\/dc:creator><dc:creator>\n        Taylor, Michele E.<\/dc:creator><dc:creator>\n        Morison, James I. L.<\/dc:creator><dc:subject>\n        Botany<\/dc:subject><dc:subject>\n        Ecology and Environment<\/dc:subject><dc:description>\n        Sycamore (Acer pseudoplatanus L.) is an invasive, non-native species in Great Britain and its management in conservation areas is controversial. Climate change adds further uncertainty to decision making. We investigated the role of management history in determining present-day abundance and the effects of climatic variability on growth, photosynthesis and phenology at Wytham Woods, a UK Environmental Change Network (ECN) monitoring site. Relatively few sycamore trees were found in undisturbed ancient, semi-natural woodland and recent plantations, despite being common in other areas of the site. Sycamore grew more slowly than ash (Fraxinus excelsior L.), its principal competitor, but at a similar rate to pedunculate oak (Quercus robur L.) in the period 1993–2005. There were fewer sycamore than ash seedlings, regardless of which species dominated the canopy. Growth of sycamore was slower in dry periods than wet ones and lower photosynthetic rates were measured in canopy leaves under dry compared with wet soil conditions. This study therefore suggests that sycamore does not present a serious threat to undisturbed ancient woodland on the site and that it may eventually decline in areas of the site where it competes with ash, in the absence of disturbance. It may also decline under climate change if summer droughts become more frequent. \\ud\n\\ud\n<\/dc:description><dc:date>\n        2008-01<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/6797\/1\/Morecroft_et_al_Forestry_ms_resubmission_final_Sept_07.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Morecroft, Michael D.; Stokes, Victoria J.; Taylor, Michele E.; Morison, James I. L..  2008  Effects of climate and management history on the distribution and growth of sycamore (Acer pseudoplatanus L.) in a southern British woodland in comparison to native competitors.   Forestry, 81 (1). 59-74.  https:\/\/doi.org\/10.1093\/forestry\/cpm045 <https:\/\/doi.org\/10.1093\/forestry\/cpm045>     \n <\/dc:identifier><dc:relation>\n        http:\/\/forestry.oxfordjournals.org\/cgi\/content\/abstract\/81\/1\/59<\/dc:relation><dc:relation>\n        10.1093\/forestry\/cpm045<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/6797\/","http:\/\/forestry.oxfordjournals.org\/cgi\/content\/abstract\/81\/1\/59","10.1093\/forestry\/cpm045"],"year":2008,"topics":["Botany","Ecology and Environment"],"subject":["Publication - Article","PeerReviewed"],"fullText":"1 \n \n© Oxford Journals \n \nThis version available at http:\/\/nora.nerc.ac.uk\/6797\/ \n \nNERC has developed NORA to enable users to access research outputs \nwholly or partially funded by NERC. Copyright and other rights for material \non this site are retained by the authors and\/or other rights owners. Users \nshould read the terms and conditions of use of this material at \nhttp:\/\/nora.nerc.ac.uk\/policies.html#access  \n \n \nThis document is the author’s final manuscript version of the journal \narticle, incorporating any revisions agreed during the peer review \nprocess. Some differences between this and the publisher’s version \nremain. You are advised to consult the publisher’s version if you wish \nto cite from this article. \n \nhttp:\/\/www.oxfordjournals.org\/ \n \n \n \n \nArticle (refereed) \n \n \n \nMorecroft, Michael D.; Stokes, Victoria J.; Taylor, \nMichele E.; Morison, James I. L., 2008.  Effects of \nclimate and management history on the distribution \nand growth of sycamore (Acer pseudoplatanus L.) in a \nsouthern British woodland in comparison to native \ncompetitors.  Forestry, 81(1):59-74; \ndoi:10.1093\/forestry\/cpm045. \n \n \n \n \n \n  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nContact CEH NORA team at  \nnora@ceh.ac.uk \n \n \n \nThe NERC and CEH  trade marks and logos (‘the Trademarks’) are registered trademarks of NERC in the UK and \nother countries, and may not be used without the prior written consent of the Trademark owner. \n2 \nEffects of climate and management history on the distribution and growth of 1 \nsycamore (Acer pseudoplatanus L.) in a southern British woodland in comparison 2 \nto native competitors  3 \n 4 \nMorecroft M.D.*1, Stokes, V.J2, Taylor, M.E.3, Morison J.I.L.4 5 \n 6 \n 7 \n 8 \n 9 \n 10 \n 11 \n 12 \n 13 \n 14 \n1Centre for Ecology & Hydrology, Maclean Building, Crowmarsh Gifford, 15 \nWallingford.  OX10 8BB. 01491 692461.  mdm@ceh.ac.uk 16 \n* Corresponding author 17 \n 18 \n2Forest Research, Alice Holt Lodge, Wrecclesham, Farnham, Surrey, GU10 4LH. 19 \n 20 \n3Centre for Ecology & Hydrology, Oxford University Field Station, Wytham, Oxford.  21 \nOX2 8QJ. 22 \n 23 \n4 Department of Biological Sciences, University of Essex, Wivenhoe Park, 24 \nColchester, CO4 3SQ.  25 \n3 \nSummary 1 \nSycamore (Acer pseudoplatanus L.) is an invasive, non-native species in Great Britain 2 \nand its management in conservation areas is controversial.  Climate change adds 3 \nfurther uncertainty to decision-making.  We investigated the role of management 4 \nhistory in determining present-day abundance and the effects of climatic variability on 5 \ngrowth, photosynthesis and phenology at Wytham Woods, a UK Environmental 6 \nChange Network (ECN) monitoring site.  Relatively few sycamore trees were found 7 \nin undisturbed ancient, semi-natural woodland and recent plantations, despite being 8 \ncommon in other areas of the site.  Sycamore grew more slowly than ash (Fraxinus 9 \nexcelsior L.), its principal competitor, but at a similar rate to pedunculate oak 10 \n(Quercus robur L.) in the period 1993-2005.  There were fewer sycamore than ash 11 \nseedlings, regardless of which species dominated the canopy.  Growth of sycamore 12 \nwas slower in dry periods than wet ones and lower photosynthetic rates were 13 \nmeasured in canopy leaves under dry compared to wet soil conditions.  This study 14 \ntherefore suggests that sycamore does not present a serious threat to undisturbed 15 \nancient woodland on the site and that it may eventually decline in areas of the site 16 \nwhere it competes with ash, in the absence of disturbance.  It may also decline under 17 \nclimate change if summer droughts become more frequent.18 \n4 \nIntroduction 1 \nSycamore has expanded its range in north west Europe in recent centuries.  It is non-2 \nnative in Great Britain and has colonised widely since it was introduced, probably in 3 \nmedieval times (Jones, 1945).  It grows quickly compared to most broadleaved 4 \nspecies and can produce a good timber crop (Savill, 1997; Binggeli & Rushton, 1999).  5 \nIts invasive nature has however led to sycamore being regarded as a threat to the 6 \nconservation of native woodlands, particularly where ash has historically been the 7 \ndominant tree species (Scurfield, 1959; Binggeli, 1992, 1993; Peterken, 1996).  8 \nAttempts are often made to remove the species in conservation areas, although this is 9 \nusually only practical for the most sensitive sites (Morton Boyd, 1992).  The view of 10 \nsycamore as a threat to biodiversity has moderated in recent years as studies have 11 \nshown that it supports a range of epiphytes, herbivores and ground flora, comparable 12 \nto those of many native species (Binggeli, 1993; Peterken, 2001).  There is also 13 \nevidence that sycamore and ash each tend to regenerate better under the canopy of the 14 \nother species and may establish a cyclical pattern with dominance alternating between 15 \nthe two species (Waters and Savill, 1992; Savill et al., 1995).  Sycamore may 16 \ntherefore potentially offer good opportunities for combining wood production with the 17 \nsupport of biodiversity in some circumstances, such as the creation of new farm 18 \nwoodlands, where preserving existing tree species composition is not a priority.  19 \nHowever, sycamore remains a controversial species and the necessity for control to 20 \nprotect conservation sites is still a matter for debate.  Much information on the species 21 \nis essentially anecdotal and there is a need for more detailed scientific study. 22 \n 23 \nClimate change adds to the complexity of the issues surrounding sycamore.  Current 24 \nprojections (Hulme et al., 2002) indicate that Great Britain is likely to become 25 \n5 \nwarmer, with proportionally less precipitation falling in summer, leading to an 1 \nincreased incidence of summer droughts in southern and eastern areas, including most 2 \nof England.  Modelling by Broadmeadow et al. (2005) indicates that the productivity 3 \nof sycamore will decline in much of central, southern and eastern England because of 4 \nits sensitivity to drought.  The same projections indicated that most of its competitors, 5 \nsuch as ash and pedunculate oak, would be less adversely affected.  Drought 6 \nsensitivity is consistent with sycamore’s natural distribution, which is centred on cool, 7 \ndamp, mountainous regions in central Europe (Jones, 1945; Rusanen & Myking, 8 \n2003).  It is also consistent with the observation that within semi-natural British 9 \nwoodlands, sycamore is most dominant in the relatively cool, wet areas of the north 10 \nand west (Pigott, 1984; Rodwell et al., 1991; Forestry Commission, 1997).  These 11 \nconjectures are however based on the extrapolation of correlations with geographical 12 \nvariations in present-day climate.  Geographical patterns are not an infallible guide to 13 \nthe climatic sensitivities of species as distributions and productivity can also be 14 \ninfluenced by, for example, soil type and management history.  It is therefore 15 \nimportant to understand the underlying processes which control species responses to 16 \nclimate change and to look for direct evidence of climatic impacts.   17 \n 18 \nThere is some evidence of sycamore’s drought sensitivity, although examples are not 19 \nextensive.  Lemoine et al. (2001) and Tissier et al. (2004) present evidence from 20 \nwithin the natural range of sycamore in France, that its xylem vessels are relatively 21 \nsusceptible to cavitation under dry conditions.  During drought in the UK in 1976, 22 \nCoultherd (1978) reported some death of sycamore, but only in association with sooty 23 \nbark disease (Cryptostroma corticale). 24 \n 25 \n6 \nRising temperatures may have an effect on the competitive balance between sycamore 1 \nand other species, distinct from any effects of an increased frequency of droughts.  In 2 \nparticular, the sensitivity of phenology to temperature is well known and earlier 3 \nleafing of trees in recent decades has been documented at the European scale (Menzel 4 \net al. 2006) and within the UK (Sparks & Carey, 1995; Fitter & Fitter 2002).  There is 5 \nsome evidence (Fenn, 2005; T. Sparks, unpublished data) that the timing of sycamore 6 \nleafing is more sensitive to temperature than that of ash and that its growing season is 7 \ntherefore lengthening to a greater extent.  In these circumstances, warming may have 8 \nthe opposite effect to that of drought by giving sycamore a competitive advantage. 9 \n 10 \nFurther understanding of sycamore’s ecology and ecophysiology is therefore 11 \nnecessary to develop a better understanding of its likely responses to climate change.  12 \nRecent decades have seen a wide range of different weather conditions in Britain (Fig. 13 \n1).  The summer of 1995 was very dry (Marsh, 1996) and was followed by two years 14 \nof unusually low rainfall; the period 1998 to 2002 was, however, marked by very high 15 \nprecipitation.  The summer of 2003 was extremely hot and dry.  This range of weather 16 \nconditions provided an opportunity to investigate the effects on sycamore.  We have 17 \ndone this by bringing together a range of physical and biological monitoring data 18 \ncollected at Wytham Woods, in southern England, under the UK Environmental 19 \nChange Network programme.  This is a well-studied and instrumented site where it is 20 \nalso possible to take account of management history and to gain access to the tree 21 \ncanopy, by means of a walkway.  This range of research and monitoring allows us to 22 \naddress the following questions: 23 \n 24 \n7 \n1) Is there any difference in the extent to which sycamore has colonised different 1 \nareas of Wytham Woods? Do different management histories make the stand more or 2 \nless susceptible to invasion? 3 \n 4 \n2) Is there any evidence that sycamore is out-competing ash or growing faster? 5 \n 6 \n3)  Has tree growth decreased or mortality increased in sycamore trees during dry 7 \ncompared to wet periods? 8 \n 9 \n4) Does tree growth reflect changes in photosynthesis in the canopy during wet and 10 \ndry periods? 11 \n 12 \n5) Is there any interspecific difference in phenological responses to temperature which 13 \nmight affect the outcome of competition in the long-term? 14 \n 15 \nThroughout the paper we compare sycamore with ash because of the interest in their 16 \nrelative competitive advantages and pedunculate oak, which is also found widely in 17 \nBritish woods.  Oak and sycamore are both accessible from a canopy walkway at 18 \nWytham.  Earlier work in the canopy showed that photosynthesis of sycamore was 19 \nlower than that of oak (Morecroft & Roberts, 1999).  This work was carried out in the 20 \nsummer of 1996, which was a relatively dry year, following an extremely dry summer 21 \nin 1995, leading to reduced soil moisture levels.  One possible explanation for the 22 \ndifference in photosynthetic rates was a greater sensitivity of sycamore than oak to 23 \nthese dry conditions.  A PhD study (Stokes, 2002), made similar measurements on the 24 \n8 \nsame trees in wetter conditions in 1999 and 2000 and gave us the opportunity to test 1 \nthis hypothesis. 2 \n 3 \n9 \nMaterials and Methods 1 \nStudy site 2 \nWytham Woods (51° 46’ N 1° 20’ W; UK National Grid: SP 46 08) covers 3 \napproximately 400 ha and includes a wide range of different soil and vegetation types.  4 \nIt has been a research site, owned and managed by Oxford University, since the 5 \n1940s.  Present and historical management of the site are well-documented (Gibson, 6 \n1986, Grayson & Jones, 1955) and tree, shrub and ground layer have been monitored 7 \nsince the mid 1970s (Dawkins & Field, 1978, Kirby et al., 1996; Kirby & Thomas, 8 \n2000).  Since 1992 the site has been part of the ECN, under which climate, air 9 \npollution, soils and selected animal populations have been monitored in addition to 10 \nfurther recording of vegetation and tree growth (www.ecn.ac.uk; Sykes & Lane, 11 \n1996).   12 \n 13 \nFor the purposes of this paper five broad types of management histories can be 14 \nrecognised (Fig. 2), based on the work of Gibson (1986) and Grayson & Jones (1955): 15 \n1) Undisturbed ancient semi-natural woodland.  Ancient woodland is woodland 16 \nwhich has had a continuity of forest cover since approximately 1600; the period for 17 \nwhich historical records are usually available in England (Peterken, 1981).  At 18 \nWytham, this woodland was managed as a ‘coppice with standards’ system (mixture 19 \nof coppice stools interspersed with full height trees).  However coppicing was 20 \ndiscontinued over the course of the twentieth century and these areas have been 21 \nlargely unmanaged for between 40 and 100 years (differing locations were abandoned 22 \nat different times).  Hazel (Corylus avellana L.) is the most frequent coppice species 23 \nand pedunculate oak  the most frequent standard. 24 \n10 \n2) Disturbed ancient woodland.  Ancient woodland areas which were formally 1 \nmanaged as coppice with standards, but converted to high forest during the twentieth 2 \ncentury.  Timber has been extracted at various times but they have not been clear-3 \nfelled.  Extensive natural regeneration has occurred, along with some localised 4 \nplanting. 5 \n3) Secondary woodland.  Areas which have naturally reverted to closed canopy 6 \nwoodland over the last 200 years, having previously been grassland or wood pasture, 7 \n(with scattered trees but no continuous canopy).  A small amount of localised planting 8 \nhas taken place and there has been some timber extraction. 9 \n4) 19th century plantations.  Formerly open areas which were planted in the 19th 10 \ncentury.  This planting was largely ornamental with widely spaced trees, particularly 11 \nof beech (Fagus sylvatica L.).  Management has been minimal in recent decades. 12 \n5) 20th century plantations.  Plantations, mostly of beech and pedunculate oak, mixed 13 \nwith exotic conifers in some places, planted between 1950 and 1970.  Some were 14 \nplanted on grassland others on cleared ancient woodland areas.  Most have been 15 \nmanaged by thinning, following standard forestry practice.  16 \nFor the last 30 years, only the twentieth century plantations have been subject to 17 \nsilvicultural management, entailing occasional thinning. 18 \n 19 \nLong-term Monitoring 20 \nA survey of tree species in 294 sample plots of 10 x 10 m (0.01 ha), systematically 21 \nlocated on a 100m grid, was carried out in the summer of 1993 and in a few cases 22 \n1994 (subsequently we refer to 1993 to include plots surveyed in either year), 23 \nfollowing the ECN ‘baseline’ survey methodology (Sykes & Lane, 1996).  41 of these 24 \nplots were randomly selected for on-going monitoring, with tree diameter at breast 25 \n11 \nheight (DBH – diameter at 1.3m) measured every 3 years and tree height every 9 1 \nyears.  Up to 10 trees over 5cm DBH were selected on the basis of proximity to 2 \nrandom coordinates in each plot and the DBH measured with a diameter tape.  Tree 3 \nheight was measured with a hypsometer (Blume-Leiss altimeter, Berlin-Steglitz, 4 \nGermany) at a known distance (measured with a tape measure) from each tree.  Trees 5 \nwere classified according to their crown classes (Sykes & Lane, 1996): 6 \n1. Dominant - trees with crowns extending above the general level of the crown cover 7 \nand receiving full light from above and partly from the side. 8 \n2. Subdominant - trees with crowns forming the general level of the crown cover and 9 \nreceiving full light from above but comparatively little from the sides. 10 \n3. Intermediate - trees shorter than those in the two preceding classes but with crowns 11 \nextending into the crown cover formed by dominant and co-dominant trees; receiving 12 \na little direct light from above but virtually none from the sides. 13 \n4. Suppressed - trees with crowns entirely below the general level of the crown cover, 14 \nreceiving little light either from above or from the side. 15 \n 16 \nWe report data for the period 1993 to 2006, comprising 4 measurement periods of 17 \nthree years each.  Tree seedlings (young trees or shrubs, grown from seed, with a 18 \nDBH less than 0.5 cm) were counted by species in each plot in 10 400 x 400mm 19 \nquadrats (selected with a random number table), within the plots. 20 \n 21 \nThe date of first leafing in all three species across the site as a whole was recorded 22 \nfrom 1994 onwards.  This was defined as the first observation of a leaf having fully 23 \nemerged from the bud (but not expanded).  Observations were made by professional 24 \n12 \nscientists working on the ECN programme and visiting the same areas of the site 1 \nregularly (several times per week). 2 \n 3 \nMeteorological variables, including temperature and precipitation were monitored 4 \nwith an Automatic Weather Station (Didcot Instruments, Didcot, UK) at a grassland 5 \narea in the middle of the site as part of the ECN programme (Morecroft et al. 1998). 6 \n 7 \nPhotosynthesis measurements 8 \nA scaffolding walkway, approximately 12 m above the ground, gave access to the 9 \ncanopies of 5 sycamore and 5 oak trees.  The sycamore trees were approximately 50 – 10 \n100 years old (27 cm mean DBH), the oak 150-200 years old (66cm mean DBH).  11 \nThe location is described in more detail by Morecroft & Roberts (1999) and Roberts 12 \net al. (1999).  13 \n 14 \nIn this paper we compare rates of photosynthesis in 1996, when soil conditions were 15 \ndry with those made in 1999 and 2000 when they were wet.  Measurements were 16 \ntaken throughout the growing season when conditions were suitable (particularly that 17 \nthe leaves were dry).  In 1996 an ADC LCA 2 infrared gas analyser (IRGA) with 18 \nPLC(B) leaf chamber (ADC Ltd., Hoddesdon, Herts, UK) was used.  In 1999 and 19 \n2000 this was replaced by a PP Systems CIRAS 1, with PLC(B) leaf chamber (PP 20 \nSystems, Hitchin, Herts, UK).  For each species 5 leaves exposed to full sunlight in 21 \nthe upper canopy were measured on each of the 5 trees (intermediate and shade leaves 22 \nwere also sampled; data not presented).  In 1996 a single measurement was taken for 23 \neach leaf, in the later years a mean of 5 measurements over one minute was used for 24 \neach leaf. Measurements were taken in the middle part of the day (09.00-14.00 GMT) 25 \n13 \nwhen gas exchange rates were maximal (Stokes, 2002).  In order to estimate 1 \nmaximum net photosynthetic rates (Amax), only those measurements made when the 2 \nlight was saturating for photosynthesis are included here.  This was defined as a 3 \nPhotosynthetic Photon Flux Density of greater than 1000 μmol m-2 s-1, as measured by 4 \nthe leaf chamber sensors.  Further details can be found in Morecroft & Roberts (1999) 5 \nand Stokes (2002). 6 \nData analysis 7 \nData were analysed using Systat 11 (Systat Software Inc, 2004).  Differences in 8 \ndistribution of species between contrasting areas were tested using chi-squared tests.  9 \nDBH increments were analysed using Analysis of Variance (ANOVA) and Repeat 10 \nMeasures Analysis of Variance (RMANOVA).  Initial investigations indicated that 11 \ndiameter increment in all species was related to starting DBH, so DBH in 1993 was 12 \nincluded as a co-variate in ANOVA and RMANOVA models.  Gas exchange 13 \nmeasurements were compared visually with means and standard errors.  Trees which 14 \ndied during the period and those for which measurements started after 1993 were not 15 \nincluded in the analysis of growth.  Phenological data were tested for correlations 16 \nwith temperature in preceding periods.  17 \n14 \nResults 1 \n 2 \nDistribution of Sycamore 3 \nSycamore was the second most frequently occurring tree species in the baseline 4 \nsurvey plots (Table 1), with ash the most frequent species.  Sycamore was not 5 \nrandomly distributed (chi squared test: χ2=67.09; d.f. = 4; P <0.0001) but was found 6 \nmore frequently in plots located in secondary woodland, disturbed ancient woodland 7 \nand 19th century plantations (Fig. 3a).  Proportionally fewer plots in undisturbed 8 \nancient woodlands and twentieth century plantations had sycamore trees.  There were 9 \nsignificant differences in the frequencies with which sycamore occurred with other 10 \nspecies (χ2=20.09; d.f. = 9; P = 0.017).  The species with which it was most 11 \nfrequently associated was ash (Fig. 3b); they were found together in 56 of the 143 12 \nplots in which sycamore occurred.  Other species with which sycamore frequently 13 \noccurred included elder (Sambucus nigra L.) and hawthorn (Crataegus monogyna 14 \nJacq.).  Ash is also non-randomly distributed (χ2=14.24; d.f. = 4; P = 0.007) being 15 \nmost common in secondary woodland (60% of plots) and least common in ancient 16 \nwoodland (28% of plots).  It therefore shows similar patterns to sycamore, although 17 \nthe differences are less pronounced. 18 \n 19 \nGrowth and Mortality 20 \nBetween 1993 and 2005 mean diameter growth was lower in sycamore (1.5 ± 0.3 cm) 21 \nthan either ash (4.5 ± 0.5 cm) or oak (2.2 ± 0.5 cm).  ANOVA showed a significant 22 \neffect of species (F=17.049, d.f. = 2; P < 0.001) and starting DBH (F=15.239, d.f. = 1; 23 \nP < 0.001).  Because of the effect of starting DBH, size and growth were investigated 24 \nseparately in canopy dominant, sub-dominant and intermediate trees (there were too 25 \n15 \nfew suppressed ash and oak trees to compare).  In each of these three categories the 1 \nincrement in DBH was larger in ash than sycamore or oak (Fig. 4a). The starting DBH 2 \nof sycamore and ash were very similar in canopy dominant and intermediate trees 3 \n(Fig. 4b); amongst sub-dominant trees, it was higher in sycamore than ash 4 \n(Kolmogorov Smirnov test, p=0.041) (Fig. 4b).  Sycamore and ash increments were 5 \nalso compared in the 12 plots where the two species occurred together; in all plots 6 \nmean diameter growth of ash was higher than that of sycamore.  The difference in 7 \ngrowth rates between sycamore and ash is therefore not likely to be an artefact of size 8 \nor canopy position.  The mean starting diameter of canopy dominant oak trees was, 9 \nhowever, substantially larger than those of ash and sycamore and the greater growth 10 \nincrement in oak than sycamore presumably reflects this; sub-dominant and 11 \nintermediate oaks were similar in size to sycamore and similar increments were found 12 \n(Fig. 4b).   13 \n 14 \nMeasurements in 1993 and 2002 indicated that height had increased most in ash trees 15 \n(1.7±0.4 m), with little or no height growth in sycamore (0.2±0.3 m) and oak (0.3±0.7 16 \nm). 17 \n 18 \nDBH growth in each of the 3-year intervals was examined separately (Fig. 5a) for 19 \neach of the three species by RMANOVA.  To facilitate comparison between species 20 \nin different periods on a like-for-like basis, trees over 50 cm DBH (6 oak, 1 sycamore, 21 \n1 ash) were excluded.  Sycamore was the only species in which there was a significant 22 \ndifference with time (Table 2), with growth highest during the period 1999-2002 (Fig. 23 \n5a), which climate records show was 24% wetter than the other periods (Fig. 5b).  24 \nThere was no significant difference between periods in oak (Table 2), although it 25 \n16 \nshowed a similar pattern to sycamore (Fig. 5a)..  Ash grew more than the other two 1 \nspecies in all periods (Fig. 5a) with no significant difference between time periods 2 \n(Table 2). 3 \n 4 \nMortality of the three species was low and there was no significant difference between 5 \nspecies.  Of the 290 trees and shrubs which were originally monitored in the plots, 31 6 \ndied between 1993 and 2005 including 3 of the original 54 sycamores, 2 out of 21 7 \noaks and 1 out of 54 ash.   8 \n 9 \nSeedlings 10 \nThere was no evidence that sycamore seedlings were more abundant under ash 11 \ncanopies, or vice-versa, in the monitoring plots in either 1993 or 2002 (Fig. 6).  The 12 \nlarger baseline survey also failed to show any effect (data not presented).  However 13 \nnumbers of seedlings of all species were very low, particularly in 1993 and very few 14 \nwere older than one or two years old; saplings were almost absent from the wood.   15 \n 16 \nPhotosynthesis 17 \nOf the 3 years in which photosynthesis was measured in the canopy, Amax values in 18 \nsycamore were lowest in the dry year, 1996 (Fig. 7); The highest mean Amax on any 19 \nparticular day in 1996 was only 6.1 μmol m-2 s-1, compared to 12.1 μmol m-2 s-1 in 20 \n1999 and 10.4 μmol m-2 s-1  in 2000.   Values of Amax in oak were also lower in 1996 21 \n(Morecroft et al. 2003) but the difference between years was smaller.  Comparing the 22 \ntwo species in different years, it can be seen that oak consistently had higher Amax 23 \nthan sycamore, but the difference between the two species was greatest in the 1996.  24 \nThis difference in Amax was associated with differences in stomatal conductance (the 25 \n17 \ncapacity for CO2 to diffuse into the leaves, which is largely regulated by the number 1 \nand degree of opening of the stomata) of the two species. 2 \n 3 \nPhenology 4 \nSycamore came into leaf earlier than the other species in 12 of the 13 years (Fig. 8a).  5 \nThe date of leafing was significantly correlated with March temperature in all three 6 \nspecies (Table 3; Fig. 8b).  This correlation was less strong in ash than the other two 7 \nspecies and its leafing was more strongly correlated with mean March-April 8 \ntemperature than that for March alone (Table 3).  9 \n18 \nDiscussion 1 \nIs there any difference in the extent to which sycamore has colonised different 2 \nareas? 3 \nIt is striking how little sycamore has colonised the undisturbed ancient woodland 4 \nareas of Wytham, despite its abundance in other parts of the site.  This may reflect 5 \npoor establishment and growth in shade as these areas have been largely unmanaged 6 \nfor much of the twentieth century.  This is consistent with the observations of Savill 7 \n(1997) and Morton Boyd (1992) that sycamore tends not to become dominant in 8 \nwoodlands with a dense canopy.  There was also relatively little colonisation of recent 9 \nplantations which were managed for timber production; in this case establishment of 10 \nsycamore may have been prevented by weed control and thinning as well as low light 11 \nlevels following canopy closure.  It is also possible that more colonisation of recent 12 \nplantations would take place with time. 13 \n 14 \nIs there any evidence that sycamore is out-competing ash or growing faster? 15 \nWe found no evidence of sycamore out-performing ash, its main competitor, either as 16 \namongst mature trees or seedlings.   17 \n 18 \nDBH increment was consistently higher in ash than sycamore throughout the period 19 \nand ash also showed greater height growth.  Drought sensitivity (discussed further 20 \nbelow) appears to have contributed to sycamore’s overall lower growth rate, but it still 21 \ngrew less than ash during the relatively wet period, 1999-2002.  Data from the 22 \nRadcliffe Meteorological Station, 5km away from the site in Oxford, showed that this 23 \nwas the eighth wettest such period since 1767.  It is therefore unlikely that the growth 24 \nof sycamore would have exceeded that of ash under any climatic conditions over the 25 \n19 \nlast two centuries at this site.  One possible factor contributing to the lower overall 1 \ngrowth rates of sycamore is damage by grey squirrel (Sciurus carolinensis), which 2 \nsycamore is vulnerable to (Mayle et al., 2007).  In writing about Wytham, Elton 3 \n(1966, p.227) commented that squirrels ‘cause tremendous damage to sycamores by 4 \nstripping the bark, frequently killing parts or all of the younger trees’.  Squirrel 5 \ndamage has continued at the site, despite regular control by shooting and poisoning; 6 \nwe did not however identify it as a cause of mortality in our study.   7 \n  8 \nAsh seedlings were more abundant than those of sycamore in both 1993 and 2002.  9 \nDuring the period of our study, the site has been subject to grazing pressure from 10 \nlarge deer populations (fallow, Dama dama, muntjac, Muntiacus reevsii and roe, 11 \nCapreolus capreolus) (Kirby & Thomas 2000; Morecroft et al. 2001; Perrins & 12 \nOverall, 2001).  Linhart & Whelan (1987) reported that sycamore seedlings were 13 \nmore adversely affected by sheep grazing than those of ash and they may also be more 14 \nsensitive to deer herbivory.  There was no evidence of sycamore seedlings performing 15 \nbetter under ash canopies and ash growing better under sycamore canopies, 16 \ncontrasting with the results of Waters & Savill, (1992) and Savill et al. (1997), despite 17 \nthe study being carried out on the same site.  This may however, be obscured by the 18 \nhigh levels of deer herbivory.  19 \n 20 \nHas tree growth decreased or mortality increased in sycamore trees during dry 21 \ncompared to wet periods? 22 \nThe proposition that sycamore is drought-sensitive is supported by the fact that it 23 \ngrew more during the 1999-2002 wet period than the dry ones.  On this basis, it is also 24 \nclear that ash is less drought-sensitive than sycamore; the evidence for oak is more 25 \n20 \nambiguous.  There was, however, no evidence of increased mortality in dry periods.  1 \nThe relatively dry 3 year intervals (1993-6, 1996-9, 2002-5) were in fact slightly 2 \nwetter than average in the Radcliffe meteorological record.  The dry weather that they 3 \nincluded, particularly the summers of 1995 and 2003 (Fig. 1), may, to some extent, 4 \nhave been offset by the wetter weather in the three year periods (by, for example, 5 \nensuring high soil water contents at the start of the summer).  In the context of climate 6 \nchange further work is required on the interactive effects of precipitation at different 7 \ntimes of year. 8 \n 9 \n Does tree growth reflect changes in photosynthesis in the canopy during wet and 10 \ndry periods? 11 \nThe reduction in sycamore growth during dry conditions is most easily interpreted as 12 \na result of reduced photosynthesis resulting from stomatal closure.  The gas exchange 13 \nmeasurements support this interpretation, demonstrating that sycamore photosynthesis 14 \nwas lower in the drier conditions of 1996 than in 1999 and 2000.  Photosynthesis of 15 \noak was slightly lower in 1996 than 1999 and 2000 but to a lesser extent than 16 \nsycamore.  The difference between the two species observed by Morecroft & Roberts 17 \n(1999) in 1996 is therefore likely to be an effect of differing responses to the dry 18 \nconditions.     Sooty bark disease is promoted by hot, dry conditions (Coultherd, 1978; 19 \nDesprez-Loustau et al., 2006) and was associated with sycamore mortality in the 1976 20 \ndrought, but no outbreaks were noted in this case.   21 \n 22 \nIs there any interspecific difference in phenological responses to temperature which 23 \nmight affect the outcome of competition in the long-term? 24 \n21 \nThe sensitivity of phenology to temperature has been demonstrated for all three 1 \nspecies, with similar relationships to temperature.  The time series is relatively short 2 \nand the different species’ sensitivities to different periods in the spring (which may 3 \ndiffer in their relative warmth in different years) complicates the interpretation of 4 \nresults.  It is, however, unlikely that a lengthening of the growing season would give 5 \nsycamore a competitive advantage over ash.  Not only is there little difference in 6 \nresponsiveness to temperature, but also solar radiation increases substantially over the 7 \ncourse of the spring.  An extension of ash’s growing season in late April or early May 8 \nwould have a proportionally bigger impact on total carbon uptake than a similar 9 \nextension of sycamore’s growing season, earlier in the year. The predicted increase in 10 \ndrought frequency would also tend to outweigh the effects of an earlier start to the 11 \ngrowing season.  12 \n 13 \nConclusions and application 14 \nThese results suggest that sycamore does not currently pose a serious threat to the 15 \nundisturbed ancient woodland at Wytham and that it is not outcompeting ash in the 16 \nrest of the woods.  The evidence is that ash is growing faster and producing more 17 \nseedlings than sycamore.  Sycamore is likely to have been planted at Wytham from 18 \nthe early 19th century onwards (Elton, 1966), but many of the present trees have 19 \nnaturally regenerated and this appears to have been favoured by the conditions in the 20 \nsecondary and disturbed woodlands.  In contrast the minimum intervention regime in 21 \nthe undisturbed ancient woodland has presented few opportunities for sycamore to 22 \ngain a foothold.  It is possible that sycamore would eventually decline in those areas 23 \nwhere it currently coexists with ash, in the absence of active management. 24 \n 25 \n22 \nThe resistance of ancient woodlands to sycamore invasion under a minimum 1 \nintervention regime, may not be so clear cut in other situations; in particularly 2 \nsycamore is likely to be more of a threat in wetter areas.  However, Climate change 3 \nwill tend to decrease sycamore growth over much of England, if, as projections 4 \nsuggest, summer droughts increase in frequency.  Our results provide empirical 5 \nsupport for the projections of Broadmeadow et al. (2005), indicating a decline in the 6 \nproductivity of sycamore with climate change over much of England.  Sycamore is 7 \ntherefore likely to be a reduced threat to conservation in future, however, as a timber 8 \ncrop, foresters may find it a less productive species. 9 \n23 \nAcknowledgements 1 \nWe are grateful to the University of Oxford for allowing access to Wytham Woods 2 \nand to Nigel Fisher, Nick Crawford and Kevin Ewart for their help and cooperation.  3 \nWe thank the many people who have contributed to establishing and maintaining the 4 \nlong-term monitoring, especially Carolyn Walls and Andrew Whitehouse.  The late 5 \nJohn Roberts gave much useful advice and encouragement, as well as collaborating in 6 \nmaking the earlier measurements of gas exchange, together with Rebecca Hopkins.  7 \nPeter Savill, two referees and the editor made helpful comments on earlier drafts of 8 \nthe paper. 9 \n 10 \nFunding 11 \nNatural Environment Research Council (Environmental Change Network programme 12 \nand a CASE studentship to VJS).13 \n24 \nReferences 1 \n 2 \nBinggeli, P. 1992 Patterns of invasion of sycamore (Acer pseudoplatanus L.) in 3 \nrelation to species and ecosystem attributes. Unpublished PhD thesis, University of 4 \nUlster, Ulster. 5 \nBinggeli, P. 1993 The conservation value of Sycamore. Quarterly Journal of Forestry 6 \n87, 143-146. 7 \nBinggeli, P. And Rushton, B.S. 1999 Sycamore and ash – A review of aspects 8 \nrelevant to Irish forestry. COFORD, Dublin. 9 \nBroadmeadow, M. & Ray D. (2005) Climate Change and British Woodland.  Forestry 10 \nCommission Information Note 69. Forestry Commission, Edinburgh, UK. 11 \nBroadmeadow, M.S.J., Ray, D., Samuel, C.J.A.  2005 Climate change and the future 12 \nfor broadleaved tree species in Britain. Forestry 78, 145-161. 13 \nCoultherd, P. 1978 Observations on the effects of drought on tree species (with 14 \nparticular reference to the summer of 1976). Quarterly Journal of Forestry 72, 67-80. 15 \nCrow P. 2005 The influence of soils and species tree root depth.  Forestry 16 \nCommission Information Note 78, Forestry Commission, Edinburgh, UK. 17 \nDawkins, H.C. and Field, D.R.B. 1978 A Long-term Surveillance System for British 18 \nWoodland Vegetation. Occasional Papers of the Commonwealth Forestry Institute 1. 19 \nCommonwealth Forestry Institute, Oxford. 20 \nDesprez-Loustau, M-L, Marcais, B., Nageleisen, L-M, Piou, D., Vannini, A. 2006  21 \nInteractive effects of drought and pathogens in forest trees.  Annals of Forest Science 22 \n63: 597-612. 23 \nElton C.S. (1966) The pattern of animal communities.  Methuen & Co. Ltd., London. 24 \n25 \nFenn, K. 2005 The effect of air temperature and precipitation on seven phenophases 1 \nin woody species.  Unpublished MRes thesis, University of York. 2 \nFitter, A.H. and Fitter, R.S.R. 2002 Rapid changes in flowering time in British plants. 3 \nScience 296, 1689-1691. 4 \nForestry Commission (1997) Census of Woodlands and Trees 1979-82.  Forestry 5 \nCommission Bulletin 63. HMSO, London. 6 \nGibson, C.W.D. 1986 Management history in relation to changes in the flora of 7 \ndifferent habitats on an Oxfordshire Estate, England. Biological Conservation 38, 8 \n217-232.  9 \nGrayson, A.J. and Jones, E.W. 1955 Notes on the History of Wytham Estate with 10 \nSpecial Reference to the Woodlands. Oxford Forestry Institute, Oxford. 11 \nHulme, M., Jenkins, G.J., Lu, X., et al. 2002 Climate Change Scenarios for the 12 \nUnited Kingdom: the UKCIP02 Scientific Report. Tyndall Centre for Climate Change 13 \nResearch, School of Environmental Sciences, University of East Anglia, Norwich, 14 \nUK. 15 \nJones, E.W. 1945 Biological Flora of the British Isles: Acer Pseudo-Platanus L. 16 \nJournal of Ecology 32, 220-237. 17 \nKirby, K.J. and Thomas, R.C. 2000 Changes in the ground flora in Wytham Woods, 18 \nSouthern England from 1974 to 1991 – implications for nature conservation. J. Veg. 19 \nSci. 11, 871-880. 20 \nKirby, K.J., Thomas, R.C. and Dawkins, H.C. 1996 Monitoring changes in tree and 21 \nshrub layer in Wytham Woods (Oxfordshire). 1974-91. Forestry 69, 319-334. 22 \nLemoine D., Peltier J.-P, & Marigo, G. 2001 Comparative studies of the water 23 \nrelations and the hydraulic characteristics in Fraxinus excelsior, Acer pseudoplatanus 24 \n26 \nand A. opalus trees under soil water contrasted conditions. Annals of Forest Science 1 \n58, 723–731. 2 \nLinhart, Y.B. and Whelan, R.J. (1980)  Woodland regeneration in relation to grazing 3 \nand fencing in Coed Gorswen, North Wales.  Journal of Applied Ecology 17, 827-4 \n840. 5 \nMarsh, T.J. 1996 The 1995 UK drought – a signal of climate instability. Proceedings 6 \nof the Institution of Civil Engineers; Water, Maritime and Energy 118, 189-195. 7 \nMayle, B, Ferryman, M and Pepper, H (2007) Controlling grey squirrel damage to 8 \nwoodlands.  Forestry Commission Practice Note 4 (revised).  Forestry Commission, 9 \nEdinburgh. 10 \nMenzel, A. Spark, T.H., Estrella, N., et al. 2006 European phenological responses to 11 \nclimate change matches the warming pattern. Global Change Biology 12, 1969-1976. 12 \nMorecroft, M.D. and Roberts, J.M. 1999 Photosynthesis and stomatal conductance of 13 \nmature canopy Oak (Quercus robur) and Sycamore (Acer pseudoplatanus) trees 14 \nthroughout the growing season. Functional Ecology 13, 332-342. 15 \nMorecroft M.D., Taylor M.E., Ellwood S.A. & Quinn S.A. 2001 Impacts of deer 16 \nherbivory on ground vegetation at Wytham Woods, central England. Forestry 74, 17 \n251-257. 18 \nM.D. Morecroft , V.J. Stokes, J.I.L. Morison 2003 Seasonal changes in the 19 \nphotosynthetic capacity of canopy oak (Quercus robur) leaves: the impact of slow 20 \ndevelopment on annual carbon uptake.  International Journal of Biometeorology 47, 21 \n221-226 (Special Issue: Proceedings of International Phenology Conference, 22 \nWageningen, Netherlands, December 2001). 23 \n27 \nMorecroft, M.D., Taylor, M.E. and Oliver, H.R. 1998 Air and soil microclimates of 1 \ndeciduous woodland compared to an open site. Agricultural and Forest Meteorology 2 \n90, 141-156. 3 \nMorton Boyd, J. 1992 Sycamore – a review of its status in conservation in Great 4 \nBritain. Biologist 39, 29-31.  5 \nPerrins, C.M. and Overall, R. 2001 Effect of increasing numbers of deer on bird 6 \npopulations in Wytham Woods, central England. Forestry 74, 299-309. 7 \nPeterken, G.F. 1981 Woodland conservation and management.  Chapman & Hall 8 \nLondon. 9 \nPeterken, G.F 1996 Natural Woodland. Ecology and Conservation in Northern 10 \nTemperate Regions. Cambridge University Press, Cambridge.  11 \nPeterken, G.F. 2001 Ecological effects of introduced tree species in Britain. Forest 12 \nEcology & Management 141, 31-42.  13 \nPigott, C.D.1984 The flora and vegetation of Britain: ecology and conservation. New 14 \nPhytologist 98, 119-128. 15 \nRoberts, J.M., Hopkins, R. and Morecroft, M.D. 1999 Towards a predictive 16 \ndescription of forest canopies from litter properties. Functional Ecology 13, 265-272. 17 \nRodwell, J.S. (ed.) 1991 British Plant Communities, Volume 1. Woodlands and scrub. 18 \nCambridge University Press, Cambridge.  19 \nRusanen, M. and Myking, T. 2003 EUFORGEN Technical Guidelines for genetic 20 \nconservation and use for sycamore (Acer pseudoplatanus). International Plant Genetic 21 \nResources Institute, Rome. 22 \nSavill, P.S. 1997 The Silviculture of Trees Used in British Forestry. CAB 23 \nInternational, Wallingford.  24 \nSavill, PS, Thompson FB, Waters TL, 1995. Ecology of Sycamore in Britain (how 25 \n28 \ndoes it compete with native trees?). in Native and Non-Native in British Forestry, 1 \nInstitute of Chartered Foresters, Edinburgh. 2 \nScurfield, G. 1959 The ashwoods of the Derbyshire Carboniferous Limestone: Monks 3 \nDale. Journal of Ecology 47, 357-369.  4 \nSparks, T.H. and Carey, P.D. 1995 The response to climate of species over two 5 \ncenturies: an analysis of the Marsham phonological record, 1736-1947. Journal of 6 \nEcology 83, 321-329. 7 \nStokes V.J. 2002 The impact of microenvironment, leaf development and phenology 8 \non annual carbon gain and water loss of two deciduous tree species.  Unpublished 9 \nPhD Thesis, University of Essex. 10 \nSykes, J.M. and Lane, A.M.J. 1996 The United Kingdom Environmental Change 11 \nNetwork: Protocols for Standard Measurements at Terrestrial Sites. The Stationery 12 \nOffice, London. 13 \nSystat Software Inc. 2004.  Systat for Windows version 11.00.00.  Systat Software 14 \nInc., San Jose, CA., USA. 15 \nTissier, J., Lambs, L., Peltier, J.P. and Marigo, G. 2004 Relationships between 16 \nhydraulic traits and habitat preference for six Acer species occurring in the French 17 \nAlps. Annals of Forest Science 61, 81-86.  18 \nWaters, T.L. and Savill, P.S. 1992 Ash and Sycamore regeneration and the 19 \nphenomenon of their alternation. Forestry 65, 417-433. 20 \n29 \nTables 1 \n 2 \nTable 1  Number of ECN baseline plots in which different tree species were recorded 3 \nin canopy and shrub layer (seedlings excluded). 4 \n 5 \nSpecies Number of plots \nFraxinus excelsior 143 \nAcer pseudoplatanus 114 \nCorylus avellana 109 \nCrategus monogyna 105 \nQuercus robur 82 \nSambucus nigra 53 \nFagus sylvatica 43 \nAcer campestre 40 \nPrunus spinosa 32 \nBetula pendula 29 \nSalix caprea 12 \n 6 \n30 \nTable 2  RMANOVA results for growth increments in 3 year periods between 1993 1 \nand 2005. Time with starting DBH (1993) as a covariate. 2 \n 3 \n Time DBH in 1993 Time x DBH \n F d.f. P F d.f. P F d.f. P \nSycamore 4.761 3 0.003 4.831 1 0.033 3.5 3 0.017 \nAsh 1.415 3 0.241 6.429 1 0.014 2.052 3 0.109 \nOak 1.702 3 0.186 0.675 1 0.429 1.597 3 0.209 \n          \n 4 \n31 \nTable 3  Correlation coefficients (r2) between date of leafing and mean temperature of 1 \ndifferent months or combination of months for three species between 1994 and 2006 2 \nat Wytham Woods.  Bold text indicates significant differences: *p<0.05; **p<0.01. 3 \n 4 \n 5 \n Species \nPeriod Sycamore Ash Oak \nJanuary 0.00 0.06 0.07 \nFebruary 0.09 0.16 0.03 \nMarch 0.44* 0.36* 0.43* \nApril 0.11 0.33 0.04 \nJanuary-April 0.15 0.26 0.06 \nJanuary-March 0.23 0.17 0.09 \nFebruary-April 0.18 0.45* 0.15 \nJanuary-February 0.05 0.02 0.00 \nFebruary-March 0.29 0.33* 0.21 \nMarch-April 0.17 0.53** 0.22 \n 6 \n 7 \n32 \nFigure Legends 1 \n 2 \nFig. 1  Temperature and precipitation at Wytham, 1993-2005.  Data are presented as 3 \nmean temperature and total precipitation for each season: spring (March-May), 4 \nsummer (June-August), Autumn (September-November), winter (December – 5 \nFebruary). 6 \n 7 \nFig. 2  Map of Wytham Woods showing location of ECN baseline plots in relation to 8 \nmanagement history, categories defined in Methods section.  Plots in which sycamore 9 \nwas recorded are solid black, those in which it was not recorded are filled white.  10 \n 11 \nFig. 3 (a) Frequency of occurrence (percentage) of sycamore in plots in areas with 12 \ncontrasting management histories. (b) Frequency (percentage) of occurrence of 13 \nsycamore in the same plot as other species. 14 \n 15 \nFig. 4  (a) Diameter (DBH) growth of the three species over the whole period, 1993-16 \n2005 broken down according to crown class.  (b) Starting DBH (1993) of different 17 \nspecies according to crown class 18 \n 19 \nFig. 5  (a) Growth (DBH) of sycamore, ash and oak in four contrasting 3-year periods 20 \nfrom 1993 to 2006. (b) Climate (total precipitation and mean temperature) during the 21 \nsame four periods. 22 \n 23 \nFig. 6  Number of seedlings of sycamore and ash recorded in plots under sycamore 24 \nand ash canopies in (a) 1993 and (b) 2002.   25 \n33 \n 1 \nFig. 7 Maximum photosynthetic rate (Amax) of sycamore throughout the growing 2 \nseason in (a) 3 contrasting years and then in comparison to oak for (b) a dry year, 3 \n1996, and for two wet years: (c) 1999 and (d) 2000.  Where data were collected on 4 \nmore than one day within the same week they have been combined for clarity.  (The 5 \ndata in (b) have been previously presented in Morecroft & Roberts (1999) and are 6 \nincluded here for comparative purposes). 7 \n 8 \nFig. 8 (a) Leafing date (day of year) of sycamore, ash and oak from 1994 to 2006, 9 \nwith mean March temperature. (b) Relationship between leafing date of sycamore, ash 10 \nand oak and March temperature.  Correlation coefficients are given in Table 2.  Linear 11 \ntrend lines are fitted to the data series.  Equations: sycamore y = -6.2x + 133; ash y = -12 \n5.1x + 139; oak y = -4.1x + 139. 13 \n"}