{"doi":"10.1080\/0968776020100107","coreId":"14232","oai":"oai:generic.eprints.org:369\/core5","identifiers":["oai:generic.eprints.org:369\/core5","10.1080\/0968776020100107"],"title":"Educational innovation, learning technologies and Virtual culture potential’","authors":["Riley, David"],"enrichments":{"references":[{"id":198118,"title":"Changing Minds: Computers, Learning, and Literacy,","authors":[],"date":"2000","doi":"10.5860\/choice.38-2855","raw":"diSessa, A. A. (2000), Changing Minds: Computers, Learning, and Literacy, Cambridge, MA: MIT Press.","cites":null},{"id":1042917,"title":"Evolution in Mind: An Introduction to Evolutionary Psychology,","authors":[],"date":"1997","doi":null,"raw":"Plotkin, H. (1997), Evolution in Mind: An Introduction to Evolutionary Psychology, London: Penguin Books.","cites":null},{"id":198123,"title":"How Maps Work,","authors":[],"date":"1995","doi":null,"raw":"MacEachren, A. M. (1995), How Maps Work, New York: Guilford Press.","cites":null},{"id":1042918,"title":"Mathematics and virtual culture: an evolutionary perspective on technology and mathematics education',","authors":[],"date":"1999","doi":null,"raw":"Shaffer, D. W. and Kaput, J. K. (1999), 'Mathematics and virtual culture: an evolutionary perspective on technology and mathematics education', Educational Studies in Mathematics, 37 (2), 97-119.","cites":null},{"id":198116,"title":"Modelling the World: The Social Constructions of Systems Analysts,","authors":[],"date":"1986","doi":"10.1016\/0016-3287(87)90055-3","raw":"Bloomfield, B. P. (1986), Modelling the World: The Social Constructions of Systems Analysts, Oxford: Basil Blackwell.","cites":null},{"id":198119,"title":"Origins of the Modern Mind: Three Stages in the Evolution of Culture and Cognition,","authors":[],"date":"1991","doi":"10.2307\/416718","raw":"Donald, M. (1991), Origins of the Modern Mind: Three Stages in the Evolution of Culture and Cognition, Cambridge, MA: Harvard.","cites":null},{"id":198120,"title":"Precis of origins of the modern mind: three stages in the evolution of culture and cognition',","authors":[],"date":"1997","doi":"10.1017\/s0140525x00032647","raw":"Donald, M. (1997), 'Precis of origins of the modern mind: three stages in the evolution of culture and cognition', Behavioural and Brain Sciences, 16 (4), 737-91. Also: ftp:\/\/ftp.princeton.edu\/pub\/harnadlBBS\/. WWWIbbs.donald.html (accessed October 2001).","cites":null},{"id":198124,"title":"Remodelling Geography,","authors":[],"date":"1989","doi":"10.1177\/030913259101500123","raw":"Macmillan, B. (ed.) (1989), Remodelling Geography, Oxford: Basil Blackwell.","cites":null},{"id":198122,"title":"Representations, inscriptions, descriptions and learning: a kaleidoscope of windows',","authors":[],"date":"1998","doi":"10.1016\/s0364-0213(99)80062-7","raw":"Kaput, J. J. (1998), 'Representations, inscriptions, descriptions and learning: a kaleidoscope of windows', Journal of Mathematical Behaviour, 17 (2), 265-81.","cites":null},{"id":198121,"title":"The International Game Cultures Conference","authors":[],"date":"2001","doi":null,"raw":"IGCC (2001), 'The International Game Cultures Conference 2001', University of the West of England, http:llhumanities.uwe.acuk\/Gamesculturelindex.htm (accessed October 2001).","cites":null},{"id":198125,"title":"The Prehistory of the Mind: A Search for the Origins of Art, Religion and Science,","authors":[],"date":"1996","doi":"10.2307\/2660973","raw":"Mithen, S. (1996), The Prehistory of the Mind: A Search for the Origins of Art, Religion and Science, London: Phoenix.","cites":null},{"id":198117,"title":"The roles of communicative interaction in learning to model in Mathematics and Science',","authors":[],"date":"1999","doi":null,"raw":"Brna, P., Baker, M. and Stenning, K. (eds) (1999), 'The roles of communicative interaction in learning to model in Mathematics and Science', unpublished proceedings of the CLEMMAS Conference, Ajaccio, Corsica, April 1999.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2002","abstract":"Learning technologies are regularly associated with innovative teaching but will they contribute to profound innovations in education itself? This paper addresses the question by building upon Merlin Donald's co‐evolutionary theory of mind, cognition and culture. He claimed that the invention of technologies for storing and sharing external symbol systems, such as writing, gave rise to a ‘theoretic culture’ with rich symbolic representations and a resultant need for formal education. More recently, Shaffer and Kaput have claimed that the development of external and shared symbol‐processing technologies is giving rise to an emerging ‘virtual culture’. They argue that mathematics curricula are grounded in theoretic culture and should change to meet the novel demands of ‘virtual culture’ for symbol‐processing and representational fluency. The generic character of their cultural claim is noted in this paper and it is suggested that equivalent pedagogic arguments are applicable across the educational spectrum. Hence, four general characteristics of virtual culture are proposed, against which applications of learning technologies can be evaluated for their innovative potential. Two illustrative uses of learning technologies are evaluated in terms of their ‘virtual culture potential’ and some anticipated questions about this approach are discussed towards the end of the paper","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14232.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/369\/1\/ALT_J_Vol10_No1_2002_Educational%20innovation%2C%20learni.pdf","pdfHashValue":"5f58a4c6cfff43ccc66b8c70986ac3b6c4879c7a","publisher":"University of Wales Press","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:369<\/identifier><datestamp>\n      2011-04-04T09:12:37Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/369\/<\/dc:relation><dc:title>\n        Educational innovation, learning technologies and Virtual culture potential’<\/dc:title><dc:creator>\n        Riley, David<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        Learning technologies are regularly associated with innovative teaching but will they contribute to profound innovations in education itself? This paper addresses the question by building upon Merlin Donald's co‐evolutionary theory of mind, cognition and culture. He claimed that the invention of technologies for storing and sharing external symbol systems, such as writing, gave rise to a ‘theoretic culture’ with rich symbolic representations and a resultant need for formal education. More recently, Shaffer and Kaput have claimed that the development of external and shared symbol‐processing technologies is giving rise to an emerging ‘virtual culture’. They argue that mathematics curricula are grounded in theoretic culture and should change to meet the novel demands of ‘virtual culture’ for symbol‐processing and representational fluency. The generic character of their cultural claim is noted in this paper and it is suggested that equivalent pedagogic arguments are applicable across the educational spectrum. Hence, four general characteristics of virtual culture are proposed, against which applications of learning technologies can be evaluated for their innovative potential. Two illustrative uses of learning technologies are evaluated in terms of their ‘virtual culture potential’ and some anticipated questions about this approach are discussed towards the end of the paper.<\/dc:description><dc:publisher>\n        University of Wales Press<\/dc:publisher><dc:date>\n        2002<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/369\/1\/ALT_J_Vol10_No1_2002_Educational%20innovation%2C%20learni.pdf<\/dc:identifier><dc:identifier>\n          Riley, David  (2002) Educational innovation, learning technologies and Virtual culture potential’.  Association for Learning Technology Journal, 10 (1).  pp. 45-51.  ISSN 0968-7769     <\/dc:identifier><dc:relation>\n        10.1080\/0968776020100107<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/369\/","10.1080\/0968776020100107"],"year":2002,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"Educational innovation, learning technologies and\nVirtual culture potential'\nDavid Riley\nImperial College Centre for Educational Development Imperial College of Science,\nTechnology and Medicine\nemail: d.riley@ic.ac.uk\nLearning technologies are regularly associated with innovative teaching but will they\ncontribute to profound innovations in education itself? This paper addresses the question\nby building upon Merlin.Donald's co-evolutionary theory of mind, cognition and culture.\nHe claimed that the invention of technologies for storing and sharing external symbol\nsystems, such as writing, gave rise to a 'theoretic culture' with rich symbolic representa-\ntions and a resultant need for formal education. More recently, Shaffer and Kaput have\nclaimed that the development of external and shared symbol-processing technologies is\ngiving rise to an emerging 'virtual culture'. They argue that mathematics curricula are\ngrounded in theoretic culture and should change to meet the novel demands of 'virtual\nculture' for symbol-processing and representational fluency. The generic character of\ntheir cultural claim is noted in this paper and it is suggested that equivalent pedagogic\narguments are applicable across the educational spectrum. Hence, four general\ncharacteristics of virtual culture are proposed, against which applications of learning\ntechnologies can be evaluated for their innovative potential. Two illustrative uses of\nlearning technologies are evaluated in terms of their 'virtual culture potential' and some\nanticipated questions about this approach are discussed towards the end of the paper.\nThe challenge of recognizing and anticipating educational\ninnovation\nInnovative teaching is one of the key themes of ALT-J and a matter of considerable\npractical concern to lecturers embracing learning technologies. Many innovations, how-\never, are digital variations on previous practices that date back to the times when numbers\nand letters were first inscribed, when literacy became a concern, and formal education was\ninvented as the solution. This paper explores the notion that learning technologies could\n45\nDavid Riky Educational innovation, learning technologies and 'virtual culture potential'\nrequire us to be innovative in a more fundamental sense and will force us to review our\ncultural assumptions about education itself. The question addressed here is how we might\nrecognize, or better still anticipate, profound innovations that could result from the use of\nlearning technologies.\nA low-pass cognitive-cultural filter\nA premiss of this paper is that we need to filter out the high frequency 'noise' of\ntechnological and educational change, whilst attending to the lower frequencies and\nthemes running through human cognitive and cultural evolution. It is assumed that our\nability to appreciate and compose across the full dynamic range of educational innovation\nwill be enhanced by an awareness of these underlying themes.\nA theory of human evolution that is admirably suited to the purpose is outlined next. The\ntheory begins with an account of hominid evolution several million years ago and\nculminates in a cultural critique of education as we know it today. This theory has been\nfurther elaborated by two educationists concerned with the impact of computational\ntechnologies on innovation in mathematics curricula. Their conception of an emergent\n'virtual culture' provides the inspiration for this paper and a device that may prove fruitful\nin the search for innovation in education.\nA theory of cognitive and cultural co-evolution\nThe psychologist Merlin Donald claimed in his landmark book (Donald, 1991) and\nsubsequent precis (Donald, 1997) that the human mind co-evolved in close interaction with\nboth brain and culture over millions of years. He postulated three major cognitive transitions\nwith each cognitive step-change being marked by the development of novel and increasingly\nhybrid forms of representation and by the subsequent rise of more complex human cultures.\nEpisodic culture\nAccording to Donald, early hominids possessed a chimpanzee-like brain that was brilliant\nat event-perception, capable of subtle social interactions, and sensitive to the significance\nof environmental events. He claims, however, that episodic recall was poor and\nenvironmentally driven rather than readily self-triggered at will. He describes this culture\nas 'episodic', with limited scope for the voluntary recall of events, for the rehearsal and\npurposive refinement of skills and the expression of knowledge.\nMimetic culture\nDonald's first biophysical and cognitive transition was a breakthrough in motor and\nmimetic skills, permitting the development of body language as a form of representation\nand communication. This change, he says, occurred around one and a half million years\nago as Homo erectus appeared. The resulting mimetic culture was based on the new-found\ncapability for self-triggered rehearsal and for voluntary representational acts that\nfacilitated sociocultural development. Skilled tool-making, gesture, dance, mime and ritual\nbecame possible through embodied performance with the capacity for iconic representa-\ntion leading to more abstract forms of symbolic but pre-linguistic representation.\nMythic culture\nDonald's second transition resulted from changes to human biological and cognitive\nstructures affecting motor skills, mimesis and symbolic representation. They enabled\n46\nAn-] Volume 10 Number I\nlexical invention and contributed to the development of oral language. He argues that\nspeech and narrative forms emerged some 300,000 years ago, following physical and\ncognitive adaptations of the brain, the nervous system and the human vocal apparatus.\nThe resulting mythic culture was a hybrid, interweaving inherited episodic and mimetic\ncapabilities with the new ones of storytelling, more flexible symbolization and the\npotential for abstraction away from specific events and performances.\nTheoretic culture\nInstead of a biophysical change in memory and cognition, Donald's third transition\nmarked a technological change around fifty to thirty thousand years ago, in the Upper\nPalaeolithic. People produced inscriptions for the first time and externalized symbolic\nmemory, initially in images and later in numerical and written systems. The resulting\ntheoretic culture was founded on external memory records that were created, interpreted\nand applied by a 'literate class' with responsibilities for commerce, governance, legal codes,\nreligion and health.\nHe suggests the demands of numeracy, literacy and the maintenance of specialist discourse\ncommunities were such that formal education became a necessary component of the\nemerging theoretic culture. Over time, education enabled the sharing and dissemination of\nthese literacies whilst reinforcing theoretic culture through the invention of sophisticated\nand specialized symbol systems. Contemporary mathematics, science and technology are\nfruits of this culture, as are the arts and humanities. Technologies for externally storing and\nsharing symbol systems proved to be remarkably potent as Homo sapiens took culture\nbeyond the biological limits of individual memory, mental reasoning and oral trans-\nmission.\nWith respect to modern information and communication technologies, Donald treats these\nas significant developments falling within the scope of theoretic culture. He notes that they\nenhance the storage, communication and display of symbol systems and symbolic\nrepresentations and discusses the cognitive and cultural impact of a 'global electronic\ninformation environment'.\nA critique of theoretic culture\nDonald's inclusion of modern technologies within an established theoretic culture has been\nchallenged by David Shaffer and James Kaput (1999), who believe there has been a fourth\ncognitive transition triggering the emergence of a 'virtual culture'. They suggest that\nDonald overemphasized the importance of memory and external symbol storage functions\nin theoretic culture and underestimated the significance of external symbol processing.\nShaffer and Kaput argue that the advent of computational technologies constitutes a\nmajor cognitive transition bringing culturally unprecedented forms of dynamic and\ninteractive representation, and giving rise to the qualitatively new virtual culture.\nThe educational implications of a virtual culture\nShaffer and Kaput used their conception of an emergent virtual culture to argue that it\nplaces additional and novel demands on people's representational abilities, and hence on\neducation. They argue that mathematics curricula will need to be changed if they are to\nsatisfy the symbol-processing needs of a virtual culture.\n47\nDavid Riley Educational innovation, learning technologies and Virtual culture potential'\nIn their view, the aims of mathematics curricula should be to:\n• promote 'generative fluency', that is, students' ability to learn varieties of represen-\ntational systems (see also Kaput, 1998);\n• provide opportunities to create and modify representational forms;\n• develop skills in making and exploring virtual environments;\n• emphasize mathematics as a fundamental way of making sense of the world;\n• offer a more embedded and situated mathematics, that builds on meaning and places\nless emphasis on exact computation and formal proof - except for students who require\nthese specialized skills.\nIn other words, Shaffer and Kaput say that learning to read and write symbols is no longer\nsufficient for students of mathematics. A virtual culture requires people who are able to\n'read and write' symbol-processing for representational purposes. Thus, an education\nsystem that developed to support the internal symbol-processing needs of theoretic culture\nshould adapt and grow to support the external symbol-processing needs of virtual culture.\nVirtual culture and the challenge of educational innovation\nThe above account of human biological and cultural evolution is stimulating but surely a\nnew and different stage in human culture should be universal in its reach and impact? If\nShaffer and Kaput's claim of a virtual culture is reasonable, their arguments about\nmathematics curricula should be generalizable across most, if not all, curricula. Readers\nare invited to judge for themselves whether they believe computationally based techno-\nlogies are having such a deep impact in their own fields and whether curricula are changing\nor whether they should change as a result.\nThis paper proceeds on the assumption that Shaffer and Kaput's conception of virtual\nculture is insightful and therefore could be of value in evaluating the innovative potential\nof learning technologies. I will regard the use of learning technologies for symbol storage\nand display to be characteristic of a theoretic culture and unlikely to be culturally\ninnovative. In contrast, I regard the use of learning technologies for autonomous symbol\nprocessing and interactive representations to be characteristic of a virtual culture and more\nlikely to be culturally innovative. For instance, students posting an essay on an intranet or\nsending emails to a tutor are using the digital equivalents of earlier systems. These\npractices are digital in their implementation but rely on the communication and sharing of\nsymbols and hence are typical of theoretic culture. The use of online multiple-choice tests\nwith automated feedback for tutors and students takes advantage of machine computation\nand of hybrid, interactive representations. This is indicative of an educational practice\nbelonging to virtual culture.\nVirtual culture potential\nTo structure and take forward these ideas, I introduce the notion of 'virtual culture\npotential' and provide a working definition of virtual culture as an assemblage of four\ndiagnostic practices:\n48\nALT-J Volume 10 Number I\n1. the processing of external symbol systems on interactive, computational devices;\n2. the use of these devices for representational purposes in human communications;\n3. the representation of entities, events and environments that are material, imaginary\nor abstract;\n4. the use of multiple and hybrid forms of representation - the juxtaposition and\ninterweaving of representational forms typical of episodic through to virtual\ncultures.\nThis assemblage of practices makes it possible to characterize uses of learning technologies\nin terms of their alignment with, and potential to further, virtual culture. Applications of\nlearning technologies that entail all four practices should be ascribed a high virtual culture\npotential whilst lower potentials are indicated if these practices are absent or less well\ndeveloped. For instance, both the applications of learning technologies shown in Table 1\nEvaluation criteria for virtual culture\npotential of applications of learning\ntechnologies\nLearning technologies,\neducational applications and\nmatch with criteria\nGeographic information Dynamic modelling\nsystem [GIS] system\nSpatial variability of Nitrogen fluxes\nsoil nitrate-N in an agro-ecosystem\n1I) The processing of external symbol systems on Yes\ninteractive, computational devices\n(2) The use of these devices for representational Yes\npurposes in human communication\n(3) The representation of entities, events and Yes\nenvironments that are material, imaginary or\nabstract\n(4) The use of multiple and hybrid forms Yes\nof representation: the juxtaposition and\ninterweaving of representational forms typical of\nepisodic through to virtual cultures\nYes\nYes\nYes\nYes\nTable \/: Evaluation of the virtual culture potential of two applications of learning technologies\nillustrate high levels of virtual culture potential. This potential would be reinforced by the\nintegration of the two learning activities using a composite spatial and temporal modelling\nsystem (MacEachren, 1995).\nLearning activities such as those illustrated in Table 1 would have been impracticable\nbefore computers became available and few environmental scientists or geographers would\nhave imagined educational projects of this kind. Yet, in the wider world, it no longer seems\nstrange that decision-makers should consult epidemiological models or global climate\nmodellers (Bloomfield, 1986; Macmillan, 1989). Nor does it seem exceptional that\n49\nDavid Riley Educational innovation, learning technologies and 'virtual culture potential'\ninteractive computer simulations should seamlessly represent the past, the present and a\nrange of imaginary futures whilst serving the worlds of science and politics as twenty-first-\ncentury oracles.\nReflections on virtual culture potential\nThis paper has strayed close to the abstract, theoretical and speculative limits of\nrespectability for a journal such as ALT-J. The time has come to acknowledge and address a\nfew anticipated criticisms of the notion of 'virtual culture potential' as it has been\nadvanced in this paper.\nFirstly, whilst Donald's theory is widely acknowledged, it is merely one of several theories\nof the evolution of the human mind (Mithen, 1996; Plotkin, 1997), and I can neither\nsupport nor refute his particular account. Instead, it is regarded as a valuable source of\ninspiration for myself and for Shaffer and Kaput who made the crucial distinction between\nthe importance of symbol-storing and symbol-processing technologies. This distinction\nand their notion of virtual culture could prove to be fruitful in identifying opportunities\nfor educational innovation even if Donald's theory is found to be wanting in some respects.\nSecondly, the distinction between symbol storage and symbol processing is simplistic, in\nthat running an email or intranet system entails considerable information-processing.\nHowever, I believe the computations that are embedded within such systems and that are\ntransparent to users are not germane to the educational issues and approach expressed in\nthis paper.\nThirdly, what is new in this paper? The privileging of computation is not new; diSessa\n(2000) discusses at length his ideas about computers, learning and literacy, whilst\nacknowledging the early influence of Seymour Papert. It seems to me, however, that\nDonald's ideas and their derivatives have a broader cultural sweep than those of diSessa,\nwho restricts much of his thinking to the notion of programming in the mathematical\nsciences and related fields. The challenge of combining or integrating interactive and\nnarrative representational forms is, for instance, an issue gaining attention in the\nhumanities (IGCC, 2001) and sits more comfortably within Shaffer and Kaput's notion of\na virtual culture than within diSessa's frame of reference.\nThe notion of computing to represent and communicate similarly differs from the approach\nexplored by Brna, Baker and Stenning (1999) in a conference on communicative interactions\nand the development of students' modelling skills in mathematics and science. Virtual culture\naffords the wider educational sweep and highlights the activity of modelling to represent and\nto communicate, rather than the activity of communicating in order to model.\nConclusions\nThis paper has developed a notion of 'virtual culture potential' by building on the earlier work\nof Donald, Shaffer and Kaput. The notion is advanced for its heuristic possibilities in recog-\nnizing the potential of learning technologies to trigger profound educational innovations.\nAcknowledgements\nThis paper is dedicated to the memory of the late Professor David Squires of King's\nCollege London. I had looked forward to discussing the implications of virtual culture\n50\nAu-j Volume 10 Number I\nwith David at ALT-C 2001 and it was with great sadness that I learnt of his death two weeks\nbefore the conference.\nI am deeply indebted to Merlin Donald, David Williamson Shaffer and James Kaput,\nwhose ideas have been recast and inevitably caricatured here. Finally, my thanks go to the\nanonymous referees and colleagues who provided feedback on drafts of this paper, in\nparticular, to Dr Benita Cox of the Management School of Imperial College.\nReferences\nBloomfield, B. P. (1986), Modelling the World: The Social Constructions of Systems\nAnalysts, Oxford: Basil Blackwell.\nBrna, P., Baker, M. and Stenning, K. (eds) (1999), 'The roles of communicative interaction\nin learning to model in Mathematics and Science', unpublished proceedings of the C-\nLEMMAS Conference, Ajaccio, Corsica, April 1999.\ndiSessa, A. A. (2000), Changing Minds: Computers, Learning, and Literacy, Cambridge,\nMA: MIT Press.\nDonald, M. (1991), Origins of the Modern Mind: Three Stages in the Evolution of Culture\nand Cognition, Cambridge, MA: Harvard.\nDonald, M. (1997), 'Precis of origins of the modern mind: three stages in the evolution of\nculture and cognition', Behavioural and Brain Sciences, 16 (4), 737-91. Also:\nftp:\/\/ftp.princeton.edu\/pub\/harnadlBBS\/. WWWIbbs.donald.html (accessed October 2001).\nIGCC (2001), 'The International Game Cultures Conference 2001', University of the West\nof England, http:llhumanities.uwe.acuk\/Gamesculturelindex.htm (accessed October 2001).\nKaput, J. J. (1998), 'Representations, inscriptions, descriptions and learning: a kaleido-\nscope of windows', Journal of Mathematical Behaviour, 17 (2), 265-81.\nMacEachren, A. M. (1995), How Maps Work, New York: Guilford Press.\nMacmillan, B. (ed.) (1989), Remodelling Geography, Oxford: Basil Blackwell.\nMithen, S. (1996), The Prehistory of the Mind: A Search for the Origins of Art, Religion and\nScience, London: Phoenix.\nPlotkin, H. (1997), Evolution in Mind: An Introduction to Evolutionary Psychology,\nLondon: Penguin Books.\nShaffer, D. W. and Kaput, J. K. (1999), 'Mathematics and virtual culture: an evolutionary\nperspective on technology and mathematics education', Educational Studies in\nMathematics, 37 (2), 97-119.\n51\n"}