{"doi":"10.1111\/j.1539-6924.2009.01204.x","coreId":"217744","oai":"oai:eprints.lse.ac.uk:32583","identifiers":["oai:eprints.lse.ac.uk:32583","10.1111\/j.1539-6924.2009.01204.x"],"title":"Managing societal and institutional risk in child protection","authors":["Munro, Eileen"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-07","abstract":"Public sector services have been reshaped by two interacting factors: the growing dominance of risk management and the growing demands for transparency and accountability. For the caring professions, these have provoked radical reform. Using the child protection service as a case study, this article explores the impact of the changes on a service that deals with conflicting risks and has a poorly articulated knowledge base. Drawing on Rothstein et al.'s distinction between societal and institutional risks, it is argued that difficulties in managing societal risks are creating serious institutional risks. The latter are then being prioritized in the way the system operates. The preoccupation with such risks has been translated into concerted efforts to formalize the work of front line practitioners to make it transparent and auditable. Although done, in part, with the good intention of spreading good practice standards, this formalization has gone beyond the evidenced knowledge base to the extent that it is creating a new picture of “good practice” that omits significant dimensions of work and is distinct from measures of children's safety or welfare. Moreover, the process of formalization acts as an impediment to knowledge development in disciplines where such learning is urgently needed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/217744.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/32583\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Munro%2C%20E_Managing%20societal%20institutional%20risk_Munro_Managing%20societal%20institutional%20risk_2015.pdf","pdfHashValue":"e6d736df0ad697e4c857a2bf62d9d0eb02a8c415","publisher":"Blackwell Publishing on behalf of the Society for Risk Analysis","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:32583<\/identifier><datestamp>\n      2015-01-20T10:35:39Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5341<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/32583\/<\/dc:relation><dc:title>\n        Managing societal and institutional risk in child protection<\/dc:title><dc:creator>\n        Munro, Eileen<\/dc:creator><dc:subject>\n        HN Social history and conditions. Social problems. Social reform<\/dc:subject><dc:subject>\n        HQ The family. Marriage. Woman<\/dc:subject><dc:subject>\n        HV Social pathology. Social and public welfare. Criminology<\/dc:subject><dc:description>\n        Public sector services have been reshaped by two interacting factors: the growing dominance of risk management and the growing demands for transparency and accountability. For the caring professions, these have provoked radical reform. Using the child protection service as a case study, this article explores the impact of the changes on a service that deals with conflicting risks and has a poorly articulated knowledge base. Drawing on Rothstein et al.'s distinction between societal and institutional risks, it is argued that difficulties in managing societal risks are creating serious institutional risks. The latter are then being prioritized in the way the system operates. The preoccupation with such risks has been translated into concerted efforts to formalize the work of front line practitioners to make it transparent and auditable. Although done, in part, with the good intention of spreading good practice standards, this formalization has gone beyond the evidenced knowledge base to the extent that it is creating a new picture of “good practice” that omits significant dimensions of work and is distinct from measures of children's safety or welfare. Moreover, the process of formalization acts as an impediment to knowledge development in disciplines where such learning is urgently needed.<\/dc:description><dc:publisher>\n        Blackwell Publishing on behalf of the Society for Risk Analysis<\/dc:publisher><dc:date>\n        2009-07<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/32583\/1\/__lse.ac.uk_storage_LIBRARY_Secondary_libfile_shared_repository_Content_Munro%2C%20E_Managing%20societal%20institutional%20risk_Munro_Managing%20societal%20institutional%20risk_2015.pdf<\/dc:identifier><dc:identifier>\n          Munro, Eileen  (2009) Managing societal and institutional risk in child protection.  Risk Analysis, 29 (7).  pp. 1015-1023.  ISSN 1539-6924     <\/dc:identifier><dc:relation>\n        http:\/\/www.blackwellpublishing.com\/journal.asp?ref=0272-4332<\/dc:relation><dc:relation>\n        10.1111\/j.1539-6924.2009.01204.x<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/32583\/","http:\/\/www.blackwellpublishing.com\/journal.asp?ref=0272-4332","10.1111\/j.1539-6924.2009.01204.x"],"year":2009,"topics":["HN Social history and conditions. Social problems. Social reform","HQ The family. Marriage. Woman","HV Social pathology. Social and public welfare. Criminology"],"subject":["Article","PeerReviewed"],"fullText":"  \nEileen Munro \nManaging societal and institutional risk in \nchild protection \n \nArticle (Accepted version) \n(Refereed) \n \n \n \nOriginal citation: \nMunro, Eileen (2009) Managing societal and institutional risk in child protection. Risk Analysis, \n29 (7). pp. 1015-1023. ISSN 1539-6924  \n \nDOI: 10.1111\/j.1539-6924.2009.01204.x  \n \n© 2009 Society for Risk Analysis \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/32583\/ \n \nAvailable in LSE Research Online: January 2015 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final accepted version of the journal article. There may be \ndifferences between this version and the published version.  You are advised to consult the \npublisher’s version if you wish to cite from it. \n \n \n \n 1 \nMANAGING SOCIETAL AND INSTITUTIONAL RISK IN CHILD PROTECTION \nEileen Munro \nAccepted for publication in  ‘Risk Analysis’. \n \n 2 \n \nABSTRACT \nPublic sector services have been re-shaped by two interacting factors: the growing dominance \nof risk management and the growing demands for transparency and accountability. For the \ncaring professions, these have provoked radical reform.  Using the child protection service as \na case study, this article explores the impact of the changes on a service that deals with \nconflicting risks and has a poorly articulated knowledge base.  Drawing on Rothstein, Huber \net al’s  (2006) distinction between societal and institutional risks, it is argued that difficulties \nin managing societal risks are creating serious institutional risks.  The latter are then being \nprioritised in the way the system operates.  The preoccupation with such risks has been \ntranslated into concerted efforts to formalize the work of front line practitioners to make it \ntransparent and auditable.  Although done, in part, with the good intention of spreading good \npractice standards, this formalization has gone beyond the evidenced knowledge base to the \nextent that it is creating a new picture of ‘good practice’ that omits significant dimensions of \nwork and is distinct from measures of children’s safety or welfare.  Moreover, the process of \nformalization acts as an impediment to knowledge development in disciplines where such \nlearning is urgently needed.   \n \nRisk management \nChild protection \nInstitutional risk \n 3 \n \n1. INTRODUCTION \n \nThe impact on the public sector of neoliberalism, new public management, and society’s \npreoccupation with risk has been widely discussed and analysed.  However, the child \nprotection service illustrates some of the problems to a marked degree because it deals with \nan unusually complex set of risks and has an unusually poor knowledge base.  For many \nservices, the aim has been to encourage and disseminate good practice.  In child protection, \nthough, there is only limited knowledge about good practice and the major need is to increase \nthis, to find out more about what methods are effective. This poses problems for the \ndevelopment of a governance regime.  \n \n The way that society has conceptualised and responded to parental cruelty to children has \nchanged markedly in recent decades.  A strongly regulated child protection system has \nevolved in England that is expected not only to identify and help the victims of cruelty but \nalso to predict and prevent such cruelty. The prioritisation of risk management has \nnecessitated fundamental changes and has been highly problematic.  This article explores how \nit has been implemented and questions whether service providers are making progress in their \novert aim of increasing children’s safety and welfare or whether this aim is being subverted \nby efforts to protect workers and agencies from criticism.   \n \nThe question can be rephrased in terms of the distinction between societal and institutional \nrisks (Rothstein et al 2006).  Societal risks, in this instance, are the risks to children of being \nharmed or even killed by their parents or carers.  The agencies charged with managing these \nrisks (predominantly social care, police, health and education services) cannot avoid failure in \ntheir task because of the ‘inherent uncertainties, fragmented organizational settings, \nconstrained resources, ungovernable actors and unintended consequences’ (Rothstein 2006 \n 4 \np.217).   Moreover, the governance mechanisms introduced as part of New Public \nManagement (Hood 1991) mean that their failures are now more apparent because of the \ngreater transparency and accountability demanded of them.   While deaths have always been \nvisible, the audit system has now created new criteria of success and failure with increased \nopportunities for visible failure in cases with less tragic outcomes.   Agencies therefore need \nto manage the institutional risks of being blamed by finding some way of justifying their \nperformance as rational and defensible.  How this then interacts with their primary concern \nwith societal risk is the topic of this article.     \n \nChild protection services are shaped by their social contexts.  Most particularly, the nature of \nthe welfare regime and the relationship between family and state, in general, strongly \ninfluence the way child cruelty is addressed.  Countries which fit Esping-Anderson’s category \nof liberal or neo-liberal welfare regime (Esping-Anderson 1990) have evolved very similar \nchild protection systems whereas the social democratic or Scandinavian countries are \nradically different (Hetherington et al 1997).  This article provides a case study of the system \nin England but the observations have relevance for the other UK countries, the US, Canada, \nAustralia and New Zealand.  In these neo-liberal countries, state intervention into the privacy \nof family life, whether in the form of helping or policing, has been traditionally kept to a \nminimum so that the coercively intrusive dimension to child protection is significantly \ndifferent from the way most welfare problems are dealt with.    \n \nChild protection services have distinctive features.  Unlike most areas of crime detection, the \naim is not just to identify perpetrators and refer them to the criminal justice system but also, if \npossible, to help them to maintain their parental role in a less harmful manner.  This \ncombination of care and control influences the way the service operates.  Historically, the \nworker-family relationship has been deemed of central importance as a means of investigating \nand helping families.  This has contributed to the development of individual styles of practice \nthat have mitigated against the formulation of a shared body of knowledge and shared \n 5 \ndiscourse, a feature that is found, to some degree, in all caring professions.  Consequently, the \nresearch on effectiveness has been limited.  Chaffin and Friedrich (2004 p.1098)  \nsummarising expert reviews of research, conclude: ‘most field services provided to abused \nchildren and their families are not based on any clear evidence that the services actually \nwork’.  In trying to improve child protection services, it is not simply a case of demanding \naccountability and encouraging all agencies to adopt good practice but also of evaluating \npractice to learn how to manage the risks to children better.    \n \nIn analysing the child protection service, this article uses the governance framework proposed \nby Hood, Rothstein et al (2001).  They argue that, in developing a risk management regime, \nagencies need to develop some method of control.  ‘From a cybernetics perspective, \ngovernance could be understood as a control system that sets societal goals, gathers \ninformation on whether the goals are met and modifies behaviour to bring governed activities \ninto line with goals’ (Hood et al 2001).    In child protection, there are two governance \nregimes, one of families by professionals and one of professionals by government.  These \nhave evolved concurrently and influenced each other.  This article focuses on the governance \nof professionals but sketches the way that evolution of this governance regime has interacted \nwith changing governance of families.   \n2. SETTING THE RISK MANAGEMENT  GOALS IN CHILD PROTECTION \n \nChildren’s services have a dual preoccupation with the safety and welfare of children, two \nfactors that can be in conflict in specific decision making contexts since safety concerns tend \nto focus on immediate dangers while welfare assessments take a longer view.  A child’s \nimmediate safety can be achieved by removing him from abusive parents but then his long-\nterm welfare is highly likely to be damaged by separation from his established relationships.  \nThe decision on whether to remove a child from the birth family involves a complex weighing \nof positive and negative outcomes, both immediate and long term, in both options. \n 6 \n \nAlthough welfare services in England have been concerned about cruelty to children since the \n1889 Prevention of Cruelty to Children Act, the language of risk, or indeed of abuse, was not \nused in talking about it.  Services removed children once they had been seriously injured or \nneglected; professionals were not expected to predict and prevent these adverse outcomes.  If \na child died, the killer was punished but services were not criticised; there was little \ninstitutional risk in the event. Parents had considerable autonomy in child-rearing, with early \nlegislation only proscribing extreme forms of physical harm or neglect. The risk agenda has \nslowly taken over since the 1970s, creating increased governance of families and increased \nresponsibilities for professionals.  Why society become more concerned about standards of \nparenting and child homicide is a moot point. There is some debate in the literature whether \nthe rising social concern with risk generally indicates a rise in actual risks or a rise in concern \nabout risk (Rothstein et al 2006).  The actual rate of child cruelty and homicide by parents or \ncarers in the 1970s is difficult to determine since official statistics are incomplete and \nunreliable.  However, the rate of child death from any cause has been falling and it is unlikely \nthat this drop concealed a rise in familial harm.  Perhaps it was the increasing rarity of child \ndeaths that put a stronger spotlight on the few that occurred.  The risk of experiencing child \nabuse or neglect, however, has risen markedly but this is as a result not of changes in parental \nbehaviour but of changes in the definition of unacceptable parenting.  The concept of abuse \nhas been gradually expanded to include sexual and emotional abuse and, for all categories, the \nrange of behaviours deemed abusive has expanded to include moderate forms.    \n \nIn the latest policy for England, the concept of ‘a child at risk’ has been expanded from one at \nrisk of abuse or neglect to any child at risk of failing to fulfil their potential and professionals’ \nduty to protect from significant harm has been augmented with a duty to safeguard all \nchildren from adverse outcomes (HM Treasury 2003).  The increase in professional \nresponsibility for overseeing children’s development creates increased governance of \nfamilies, with all children now to be registered on a national database, ContactPoint, to \n 7 \nfacilitate monitoring.  Child protection continues to function as a distinct sub-set in this \n‘safeguarding’ agenda and is the focus of this article since the wider agenda is still in its \ninfancy.   \n \nThe growing social preoccupation with risk was evidenced in relation to children in a series of \nhigh profile public inquiries into the deaths of children known to children’s services.  In \nEngland, the death of Maria Colwell in 1973 triggered a major public debate about child \nabuse (Department of Health and Social Security 1974).  Similar high profile child deaths \noccurred in other liberal countries, contributing to their parallel development of a child \nprotection system.  The Colwell report was followed by a series of such inquiries through the \n1970s and 80s which created public pressure on professionals to accept responsibility for \navoiding such tragedies.  A child’s death from familial abuse was reformulated as prima facie \nevidence of professional failure.  Members of the public and professionals in contact with \nfamily members were encouraged  to report any concerns about child abuse to the child \nprotection service, leading to a sharp rise in referral rates (Parton 1997).  Consequently, child \nwelfare services became predominantly child protection services in which the key priority \nshifted from supporting families in difficulty to detecting and preventing child abuse \n(Department of Health 1995; Parton 1997).  Similar changes occurred in North America \n(Lindsey 2004) and Australia(Thorpe 1994). \n \nWhile the goal of changes in practice was to reduce the risks to children, this was done in \nways that created new risks. The rise in reports of abuse led to many more families being \nbrought into contact with child welfare service and, for many, it was a distressing experience \nwithout any benefit  (Farmer and Owen 1995).  Since the social pressure was for \nprofessionals not to leave any child in danger, the threshold for removing children was \nlowered to minimise false negatives. This created a rise in false positives – of removing \nchildren from families that were not dangerous enough to warrant such an intrusive response.  \nSociety reacted with hostility to this increased level of intrusion, with social workers in \n 8 \nparticular being seen as becoming too powerful and ‘trampling the rights of innocent victims’ \n(Myers 1994).  This hostility came to a head in 1987 when 121 children in Cleveland were \nremoved from their parents because two paediatricians diagnosed sexual abuse, based on what \nwas later deemed an unreliable physical test ((Department of Health 1988).  The McMartin \npreschool abuse case played a similar role in the US, when a long, expensive trial of teaching \nstaff culminated in no convictions (Myers 1994) The need to redress the perceived imbalance \nin power between parents and professionals in the governance structure led to the 1989 \nChildren Act which set out to achieve a better balance ‘between the need to protect children \nand the need to enable parents to challenge interventions in the upbringing of their children \n(Hansard, col.1107-08, 1989). \n \nFaced with hostile social reactions to both false positives and false negatives, one option for \nprofessionals was to try to reduce the total number of errors by more rigorous investigations \nof any allegation of abuse. The aim was not only to determine whether children had suffered \nharm but to assess the risk of future harm if they stayed at home.  This was very apparent in \nthe way practice was subsequently carried out.  Thorpe (Thorpe 1994)  graphically describes \nhow the therapeutic orientation of child protection was replaced by the ‘forensic gaze’, with \npolice taking a more prominent role in conducting investigations.   \n \nFor families, this made the experience of being investigated even more distressing but it also \nimpacted on them in reducing the availability of welfare services.  Families with problems \nother than abuse or neglect had difficulty in accessing help, e.g disabled children or parents \nwith ill health or disability who needed help (Audit Commission 1994).  This had the \nunintended consequence of leaving families in difficulties so that some deteriorated to the \npoint where they became abusive enough to receive a service.  Professionals frequently had \nthe frustrating experience of dealing with a highly problematic family, knowing that if only \nthey had been able to offer a service when the family first came to attention as not coping \nwell then the problems would have been easier to resolve and less harmful to the children.  \n 9 \nService provision for those families judged abusive by the investigators were also restricted \nby the amount of resources devoted to investigations (Farmer and Owen 1995). \n \nGovernment policy, in the light of these developments, was to recommend that investigations \nshould be conducted with ‘a lighter touch’ (Department of Health 1995).  The law sets out \ntwo responses to referrals.  First, a child protection inquiry can be carried out under Section \n47 of the Children Act 1989 to determine whether the child is suffering or at risk of suffering \nsignificant harm.  This is heavily proceduralised and makes high demands on time and \nresources. Alternatively, under Section 17 of the Act, the family can be assessed for and \noffered support services.  If more referrals were dealt with by the latter route, it would free up \nresources to provide the needed support services.  The decision about which response to \nchoose requires a difficult judgment since abuse tends to be hidden and an apparently \ninnocuous presentation may conceal serious harm.   Research has found a lack of consensus \non such judgments when practitioners are presented with case scenarios (Spratt 2000).  The \nSection 47 route, though more expensive, allows a more thorough assessment (helped by the \nauthority it bestows on the investigator to demand confidential information from others such \nas doctors).    Observers noted that this change in policy advice would have the effect of \nrequiring professionals to make risk assessments on the basis of less evidence and therefore \nincreased the probability of error (Munro 1999b; Parton 1997). \n \nIn summary, by the start of the millennium, parents were subject to greater rules about how \nthey should raise their children while the children’s services who monitored their compliance \nwere faced with a conflicting set of messages: don’t spend so much on carrying out \ninvestigations of alleged abuse; don’t leave any child in danger; don’t remove children from \ntheir families unless you have strong evidence.   This adds up to a nightmarish risk \nmanagement scenario and creates serious problems of institutional risks.  Whatever the level \nof performance, failure against one of these goals seems almost inevitable.   \n \n 10 \n3. GATHERING INFORMATION ON PERFORMANCE  - NPM \n \nChild protection services underwent a radical transformation in the 1980s as the Conservative \ngovernment elected in 1979 sought to overhaul the public sector, bringing in the mechanisms \nof the market to improve efficiency (Hood 1991).  This imposed new demands for \ntransparency and accountability so that finding ways of gathering information on performance \nbecame a major project. The impact of New Public Management on the public sector has been \nwell researched (e.g. (Power 1997)) but, for the caring professions, searching for a way to \nmake practice ‘auditable’ has been particularly problematic (Munro 2004).   The issues in \nsocial work are of particular interest partly because of its central role in child protection and \npartly because it demonstrates the problems in an extreme form. There are two main issues: \nfirstly, the problem of describing workers’ performance and, secondly, of linking that \nperformance to children’s outcomes, to measures of their safety and welfare.  \n3.1. Describing social work practice \n Social work had been a relationship-based service operating predominantly within a \nhumanist tradition with a relatively under-developed professional knowledge base.   Social \nworkers had a high degree of discretion in how they chose to work with clients (Adams 1998) \nand had few standardised forms to complete.  Researchers had found that social workers had \ntrouble in articulating their practice, of giving a clear account of what they were doing or \nwhat their aims were (Parsloe and Stevenson 1978).  Most operated without any explicit \ntheoretical framework and those using theories drew from a vast store, ranging, for example, \nin psychology from psychoanalytic to strict behavioural approaches.   \n \nThis state of affairs posed serious problems.  The audit system required some taxonomy of \npractice: some way of describing and categorising the different activities and purposes of \npractice.  Moreover, since the aim was not just to monitor but to improve practice, it needed \nexplicit criteria of good practice.  In the absence of a detailed professional taxonomy, civil \n 11 \nservants rapidly devised some basic units of description and some documentation in which \nthey could be recorded. Front line social workers played very little part in this process of \ndevelopment.   \n \nEfforts were made to prescribe as well as describe practice. However, the assumptions about \nwhat counted as good practice had a number of problems.  They were based on expert opinion \nrather than empirical research so their validity was unproven.   They were also constricted by \nthe preference for readily measured aspects of professional behaviour (Audit Commission \n2002; Tilbury 2000) such as time taken to respond to a referral, or how many children had \nbeen placed on the child protection register.  This underplayed the significance of the \nrelationships formed between professionals and family members or the quality of the thinking \nin making assessments and decisions.    \n \nThe methodological choice of quantitative not qualitative data has had pervasive \nrepercussions in the way practice has evolved.  The aspects of the work that could not be \nmeasured in this approach have tended to become less valued.  As time goes by, the \ncumulative effect of this neglect becomes more apparent.  In child protection social work, the \nomission of three aspects in particular is proving problematic: relationship skills, emotions, \nand critical reasoning.  No-one would deny their importance and, indeed, many agencies \nstrive to encourage them but there is a strong pressure to give them less time and attention \nwhen the official system of rewards and punishments does not include them. \n3.1.1. Relationship skills \nChild protection work deals with people not with objects. To paraphrase Chapman (2004 \np.10), you can deliver a pizza but you cannot deliver a child protection service: \nAll public services require the ‘customer’ to be an active agent in the ‘production’ of \nthe required outcomes. Education and health care initiatives simply fail if the \n 12 \nintended recipients are unwilling or unable to engage in a constructive way; they are \noutcomes that are co-produced by citizens. \nConsequently, at the micro level, the tasks of obtaining information, making sense of it, and \ndeciding what action to take are all dependent on the relationship skills of the people \ninvolved, both workers and families. A high level of skill is needed to talk to a young girl \nwho is being raped by her father or to gain any information from a belligerent mother.  There \nare particular deficits in workers’ ability to relate to men and to children with serious adverse \nimpacts on the quality of the data on which assessments and decisions are based (Farmer and \nOwen 1995; Munro 1996) A constant lesson from child death reviews is that workers lacked \nadequate skills and knowledge in these tasks (Rose and Barnes 2008).  \n \n3.1.2. Emotions \nChild protection work is highly emotive.  The knowledge of the pain and fear that a child is \nsuffering is distressing to all but the most burnt-out worker.  Parents can trigger fears for \none’s own safety as well as compassion for their problems.   Unless the emotional dimension \nis brought into conscious review, workers are in danger of being unconsciously influenced in \nways that damage their judgments and decisions.  Compassion for a mother, for example, can \ndistract attention away from the harm she is causing her children.  Child abuse inquiries \nprovide ample evidence of the adverse outcomes that arise from unreflective practice that \nignores the emotional impact of the engagement with families (Reder and Duncan 1999; \nReder et al 1993). \n3.1.3. Critical reasoning \nSocial workers are vulnerable to all the cognitive biases of human beings (Kahneman et al \n1982).  The bias that is most frequently shown, to the stupefaction of the media, is the \ntendency to hold onto a belief despite a growing body of evidence that tells against it.  Once \nsocial workers have formed a picture of a family, they can retain it, dismissing, ignoring or re-\n 13 \ninterpreting new information that challenges it, thereby failing to notice a child is being \nseriously abused (Munro 1999a).  Supervision has traditionally been seen as the forum in \nwhich workers are helped to take a more critical look at their reasoning.  Research in \npsychology has demonstrated how hard it is for people to correct their own intuitive errors \n(Woods et al 1994) so supervision is crucial.  However, the shift in recent years has been for \nsupervision to be dominated with managerial concerns, of checking that workers are \nfollowing procedures and meeting performance indicators, so that time for clinical review is \nsqueezed out (Rushton and Nathan 1996).   \n \nReducing time for critical reflection in supervision also decreases the opportunities for \nlearning.  Learning requires not only experience but reflection on that experience – time and \nattention paid to mulling over the experience and learning from it (Klein 2000).  Workers who \nhurry from one task to the next without time for reflection fail to develop wisdom from their \nwork.   \n \nThe importance of relationship and reasoning skills argues for the need to develop more \nsensitive methods of evaluating practice and tells against efforts to reduce the work to the \neasily measured.  \n4. LINKING PERFORMANCE TO CHILDREN’S OUTCOMES \n \n‘Good’ practice is that which is most likely to lead to good outcomes for children.  The \ncomplexity of causation in the social world and the minor contribution made by social work \nto the whole of a child’s experience both create serious problems in determining what effect, \nif any, the social work intervention has for any child.  Measuring outcomes for children’s \nsafety and welfare is also problematic.  Child deaths are one clear adverse outcome but, \nfortunately, these are relatively rare and so do not provide an adequate measure of a child \nprotection service.  Physical injuries are a more common adverse outcome that can fairly \n 14 \nreliably be measured but it can be problematic to decide whether the parent had any \nresponsibility for them, i.e. whether they indicate abuse or not.  Many other adverse outcomes \nare longer term, e.g. abused children exhibit higher rates of anti-social behaviour and mental \ndisorder but the pathways to these outcomes are complex, with the experience of abuse being \nneither a necessary nor a sufficient condition (Sutton et al 2005). \n \nThe lack of a well-evidenced knowledge base for social work practice in child protection was, \nand is, a problem but the audit system has the potential for providing valuable data that could \naddress the problem.  However, the current system’s reliance on readily measured data \nprovides a very limited account of what happened in working with a family so that it is hard \nto determine what, if anything, played a significant role in improving the child’s safety or \nwelfare.   \n \nConsiderable concern is now being expressed at all levels of governance about the paucity of \ndata on outcomes so efforts are being made to find reliable measures (Cabinet Office 2008).  \nHowever, there is a danger that a greater focus on children’s outcomes alone will increase \ninstitutional risks by revealing the failings of the service even more clearly without providing \nuseful information on why it is failing.  More attention needs to be given to measuring the \nservice inputs so that it becomes possible to make clearer causal links between inputs and \nchildren’s outcomes.  Progress on this issue, although difficult, will not only improve the \naccuracy of the audit system but also contribute to knowledge of what works in protecting \nchildren.   \n \n5. MODIFYING BEHAVIOIUR BY INCREASING RULES AND GUIDANCE \n \nThe third component of control in a risk regime is to modify behaviour of workers to bring \ngoverned activities into line with goals. The choice of mechanisms for modifying behaviour \n 15 \ninfluences the aspects of behaviour that get modified.  In child protection social work, the \nchoices have been biased towards providing targets, rules, guidance, and tools (particularly \nassessment and decision aids). There is a good rationale behind these choices but problems \narise when the rules and guidance go beyond the evidence-base and when they only deal with \nsome aspects of the tasks.   \n \nSetting targets and performance indicators for the child protection system is one central \nstrategy.  These have the well known hazards of creating perverse incentives and encouraging \nworkers to take the action that meets the performance indicator even when they do not \nconsider it the best action in relation to a particular child.   \n \nThe government has also been very active in prescribing how practice should be conducted, \nby providing detailed procedural guidelines and a range of tools for data-storing, assessment \nand decision making.  The first government guidance, given in 1973 after the inquiry into the \ndeath of Graham Bagnall (Salop County Council 1973), took the form of a short letter to local \nauthorities.  The current guidance in London – the London Child Protection Procedures – is \n551 pages long. Tools that are more or less firmly prescribed are also proliferating.  The \ngovernment is introducing a number of databases that will contain a wide range of data about \nchildren (Anderson et al 2006).  The Integrated Children’s System (ICS) software for child \nprotection social workers provides a complete framework for case management.   Research on \nthe use of ICS raises serious doubts about its value in improving services to children.  It \nsignificantly alters workers’ use of time by creating strong pressures to meet prescribed \ndeadlines for inputting data. In one agency, there was an e-tracking device of traffic lights \nwarning staff how much longer they had to enter data.  Time spent in front of the computer \nhas risen to 60-80%,  markedly reducing the time spent with families (Bell et al 2007; \nBroadhurst et al forthcoming).   \n \n 16 \nRasmussen’s discussion  (Rasmussen 1986) of rule-based (RB) behaviour versus knowledge-\nbased (KB) behaviour provides useful insights when considering the extent to which child \nprotection work can be reduced to formalised procedures.  Rule-based behaviour requires a \nperson to look at a situation and use the rules to classify it into some familiar category. The \nrules may be derived from legislative or policy prescriptions, or they may be rules learned \nfrom experience or acquired through formal training, which are then retrieved from memory \nwhen engaging in a practice task. Under this approach, if a situation is mis-classified, this is \ncalled a rule-based error. For example, a social worker may judge a referral to fit the category \nof ‘family support’ and so follow that route not the alternative child protection route, as \nhappened in the case of Victoria Climbie (Laming 2003).   Had the social worker followed the \nrule that, with hindsight, we know to have been right of conducting a thorough child \nprotection investigation, she might well have perceived the severity of the abuse Victoria was \nsuffering.    \nIn comparison, according to Rasmussen, knowledge-based behaviour is more appropriate in \ncomplex situations, when people have to find the answer to a new problem. They do so by \nworking out what would happen if they tried particular sets of actions. Knowledge based \nbehaviour involves responding to a significant amount of feedback from the situation. \nHowever, with experience and learning, kinds of situations that were initially resolved using a \nknowledge based approach may become more amenable to a rule based approach. In contrast, \nprofessional expertise involving knowledge-based responses to situations will continue to be \nrequired in those situations that are not adequately encompassed by the rules.      \nThe pertinent question in child protection work then becomes ‘how much of practice is more \nappropriately responded to using a rule-based approach?’ Clearly, if the evidence exists to \nshow what the right course of action is in particular circumstance then it should be expressed \nin the form of a rule.  However, it can be tempting to formulate rules going beyond the \nevidence-base.  Partly this is due to the fact that we have limited cognitive resources and it is \n 17 \neasier to apply rules than to concentrate on the hard work of thinking through potential \nsolutions.   \nWhen confronted with a problem, human beings are strongly biased to search for and \nfind a pre-packaged solution at the RB level before resorting to the far more effortful \nKB level, even where the latter is demanded at the outset. … Only when people \nbecome aware that successive cycling around this rule-based route is failing to offer a \nsatisfactory solution will the move down to the KB level take place. (Reason 1990 \np.65). \nAnother reason for opting for rule-based practice is that it creates a ‘right’ way of acting that \nworkers and agencies can point to as justification in the event of adverse outcomes.  For the \nsame reason, it is tempting to interpret what was offered as ‘guidance’ as if it were a set of \nrules, denying the option of workers exercising their discretion in case of future criticism.  \nThe tendency to transform guidance into rules has been found in social work  (Stevenson \n1999).  In circumstances where the evidence to form a rule is lacking, the advantage of \noperating with rules over professional judgement is that when the rule leads to error, no one \nperson is to blame.  If a worker exercises discretion, then he or she can be blamed for any \nadverse consequence.  In a system grappling with serious institutional risks, creating a set of \nrules to prescribe ‘good practice’, or ‘protocolizing’ practice, becomes an effective way of \nneutralising blame (Hood et al 2001).  It has the serious defect of stifling the opportunities for \nlearning better ways of handling the problems and thereby reducing risks to children.   \n6. LEARNING FROM INQUIRIES INTO CHILD ABUSE DEATHS \n \nHigh profile public inquiries into child deaths have been so influential in shaping the \ndevelopment of the child protection system that the nature of their recommendations deserves \nscrutiny. The numerous inquiries into child abuse deaths have followed the format that has \nbeen traditional in other high risk areas such as aviation and surgery, that is, they have looked \n 18 \nfor technical failings and, failing that,  for flaws in human performance (Reason 1990; Woods \net al 1994)\n1\n.  Once human error has been identified, then the search for causation stops. \nTypically, around 70-80% of inquiries have concluded that human error was to blame, a \nstatistic that was also found in a review of child protection inquiries (Munro 1999a).   \n \nThe findings of such inquiries take the form of counterfactuals: ‘if only the social worker had \nchecked with the police, she would have learned of the father’s violent record’.  The central \nproblem is seen as errant human beings and so solutions then take the form of strategies for \ncontrolling them.  The three main strategies are: psychological pressure to perform to a higher \nstandard, minimising the scope for individual judgement by automating or formalizing \npractice as much as possible, and increasing the level of managerial surveillance to ensure \nworkers are complying with the increased set of rules and protocols (Woods et al 1994).   In \nthe child protection system, these three strategies have all been implemented (Munro 2005).  \nThe psychological pressure has created a high level of anxiety among  workers about making \na mistake, leading to serious problems in the recruitment and retention of staff (Audit \nCommission 2002).  Increased formalization through standardised procedures and \ndocumentation has radically altered the individual style of practice.   \n \nIn a study of SCRs 2001-2003, it was noted that: \n \nThe focus of the recommendations was surprising … The conclusions were generally \nrelated to information about the case and its analysis.  The solution to enable these \nlessons to be learned, however, was not in improving practice by increasing \nknowledge and skills but on creating more procedures  (Rose and Barnes 2008 p.55). \n \n                                            \n1\n In engineering and aviation, the traditional person-centred approach has been replaced by \nthe systems-centred approach and initial steps in adapting this to child protection have been \ntaken, e.g. Fish S, Munro E. and Bairstow S. (2008) Learning together to safeguard children.  \nLondon, SCIE. \n 19 \nThe cumulative impact of the series of inquiries has been to increase  proceduralization and \nreduce the space for professional expertise and discretion.  Moreover, the focus on individual \nhuman error in the traditional inquiry places a heavy burden on each worker and makes the \noption of using one’s judgement unappealing.  It looks a far safer option to follow rules and \nprocedures at all times, even if one’s experience suggests it is not in a particular child’s best \ninterests.  \n7. CONCLUSION \n \nWhen child welfare services in England came under the influence of the risk agenda in the \n1970s they were operating with a high degree of professional autonomy and a remit that \nprioritised supporting families in difficulty.  The increased social concern about the dangers \nof familial abuse and neglect radically re-shaped services and, by the 1990s, the services, now \nknown as the child protection system, faced a set of conflicting risk demands: prevent abuse \nand neglect, intervene coercively in the privacy of families as little as possible, and re-focus \npriorities so that more resources are available for supporting families.   In these \ncircumstances, both societal and institutional risks were high.   \n \nThe audit and inspection system instigated by the Conservative government in the 1980s \nprovided a way of managing institutional risks by creating a model of ‘good practice’ defined \nin terms of targets, performance indicators, and procedure manuals.   While the content of \nthese new criteria for judging organisational success or failure was informed by expert \nwisdom on good practice, it was limited by the lack of an extensive empirical evidence base \non what worked and by the methodological choice of opting for readily observed and \nmeasured aspects of performance, thereby neglecting qualitative aspects and the expertise \nneeded to administer a service that was basically reliant on human relationships.  There was \nno strong case for expecting that the new model of good practice would reduce societal risks \n– the harm experienced by children- and there is no strong evidence that it has done so.     \n 20 \n \nHowever, there is emerging evidence that the risk management strategy adopted has led to \nnew societal risks for children.  The child protection system is being perceived by some \nfamilies as powerful and irrational.  Research by the Association for Improvements in the \nMaternity Services found that mothers with postnatal depression were not seeking help in \ncase they were seen as child abusers and that parents were failing to seek appropriate medical \nhelp for their children’s non-abuse problems for fear that they might be mis-diagnosed \n(Association for Improvements in the Maternity Services 2007).  A recent campaign by the \nTimes correspondent Camilla Cavendish, fuelled by allegations of bad legal judgements,  is \nchallenging the secrecy of the family court system which prevents the public scrutinising the \nquality of the professional evidence and reasoning on which the decisions to remove children \nfrom their birth families are based.   \n \nPower (2004) argues that ‘the risk management of everything’ is a ritual of verification to \ndeflect blame.  His critique seems to apply to child protection system in that so many of the \ncriteria of ‘success’ have little connection to children’s safety and welfare. However, in this \narea of practice, ritualistic verification has a limited power to deflect blame because history \nhas shown that, from time to time, a particularly brutal death of a child will provoke public \ncriticism that is not deflected by the assurance that ‘workers followed procedures’.  The \ncurrent survival strategy may well be challenged by such an event and, possibly, lead to a \nmore constructive public debate about how to manage institutional risk so that it more closely \nmirrors the management of risks to children.   \n \nREFERENCES \nAdams R (1998): Quality Social Work London, Macmillan,  \n 21 \nAnderson R, Brown I, Clayton R, Dowty T, Korff D, Munro E (2006): Children's \nDatabases - Safety and Privacy, Information Commissioner's Office, \nWilmslow, Cheshire. \nAssociation for Improvements in the Maternity Services (2007): Letter to Chief \nMedical Officer of Health, www.aims.org.uk London. \nAudit Commission (1994): Seen But Not Heard: Co-ordinating Community \nChild Health and Social Services for Children in Need, HMSO, London. \nAudit Commission (2002): Recruitment and Retention: A public service \nworkforce for the twenty-first century, Audit Commission, London. \nBell M, Shaw L, Sinclair I, Sloper P, Rafferty J (2007): The Integrated \nChildren's System: An Evaluation of the Practice, Process and \nConsequences of the ICS in Councils with Social Services \nResponsiblities, Department for Education and Skills, London. \nBroadhurst K, Wastell D, White S, Hall C, Peckover S, Thompson K, Pithouse \nA, Davey D (forthcoming): Performing 'initial assessment': identifying \nthe latent conditions for error at the front-door of local authority \nchildren's services. British Journal of Social Work. \nCabinet Office (2008): Think Family: Improving the life chances of families at \nrisk, Cabinet Office, London. \nChaffin M, Friedrich B (2004): Evidence-based treatments in child abuse and \nneglect. Children and Youth Services Review 26:1097-1113. \nChapman J (2004): System Failure: Why governments must learn to think \ndifferently London, Demos,  \nDepartment of Health (1988): Report of the Inquiry into Child Abuse in \nCleveland, 1987, London. \n 22 \nDepartment of Health (1995): Child Protection: Messages from Research \nLondon, HMSO,  \nDepartment of Health and Social Security (1974): Report of the Committee of \nInquiry into the Care and Supervision Provided in Relation to Maria \nColwell London, HMSO,  \nEsping-Anderson G (1990): The Three Worlds of Welfare Capitalism \nCambridge, Polity Press,  \nFarmer E, Owen M (1995): Child Protection Practice: Private Risks and Public \nRemedies - Decision Mkaing, Intervention and Outcome in Child \nProtection Work London, HMSO,  \nHetherington R, Cooper A, Smith P, Wilford G (1997): Protecting children: \nMessages from Europe Lyme Regis, Dorset, Russell House Publishing,  \nHM Treasury (2003): Every Child Matters London, HMSO,  \nHood C (1991): A public management for all seasons? Public Administration \n69:3-19. \nHood C, Rothstein H, Baldwin R (2001): The Government of Risk, \nUnderstanding Risk Regulation Regimes Oxford, Oxford University \nPress,  \nKahneman D, Slovic P, A T (1982): Judgement under uncertainty: heuristics \nand biases, Cambridge University Press, Cambridge. \nKlein G (2000): Sources of Power: How People Make Decisions Cambridge, \nMA, MIT Press,  \nLaming H (2003): The Victoria Climbie Inquiry: Report of an Inquiry by Lord \nLaming. London, The Stationery Office,  \nLindsey D (2004): The Welfare of Children Oxford, Oxford University Press,  \n 23 \nMunro E (1996): Avoidable and Unavoidable Mistakes in Child Protection \nWork. british Journal of Social Work 26:793-808. \nMunro E (1999a): Common errors of reasoning in child protection. Child \nAbuse & Neglect 23:745-758. \nMunro E (1999b): Protecting children in an anxious society. Health, Risk and \nSociety 1:117-127. \nMunro E (2004): The impact of child abuse inquiries since 1990. In: \nManthorpe J, Stanley N (eds), The Age of the Inquiry.  Routledge, \nPlace Published, pp 75-91. \nMunro E (2005): Improving practice: child protection as a systems problem. \nChildren and Youth Service Review 27:375-391. \nMyers J (1994): The Backlash: Child Protection under Fire, Sage, London. \nParsloe P, Stevenson O (1978): Social Services Teams: The Practitioners' \nView London, DHSS,  \nParton N (1997): Child Protection and Family Support: Tensions, \nContradictions and Possibilities, Routledge, London. \nPower M (1997): The Audit Society Oxford, Oxford University Press,  \nPower M (2004): The Risk Management of Everything London, Demos,  \nRasmussen J (1986): Information processing and human-machine interaction: \nAn approach to cognitive engineering New York, North-Holland,  \nReason P (1990): Human Error Cambridge, Cambridge University Press,  \nReder P, Duncan S (1999): Lost Innocents: A follow-up study of fatal child \nabuse.  Routledge, Place Published. \nReder P, Duncan S, Gray M (1993): Beyond Blame: Child Abuse Tragedies \nRevisited London, Routledge,  \n 24 \nRose W, Barnes J (2008): Improving safeguarding practice: study of serious \ncase reviews 2001-2003, Department of Children, Schools and \nFamilies, London. \nRothstein H (2006): The institutional origins of risk: A new agenda for risk \nresearch. Health, Risk and Society 8:215-221. \nRothstein H, Huber M, Gaskell G (2006): A theory of risk colonization: the \nspiralling regulatory logics of societal and institutional risk. Economy \nand Society 35:91-112. \nRushton A, Nathan J (1996): The supervision of child protection work. british \nJournal of Social Work 26:357-374. \nSalop County Council (1973): Report of the Inquiry into the Circumstances \nSurrounding the Death of Graham Bagnall (d.o.b. 20.5.70) and the \nRole of the County Council's Social Services, Salop County Council, \nShrewsbury. \nSpratt T (2000): Decision making by senior social workers at point of first \nreferral. british Journal of Social Work 30:597-618. \nStevenson O (1999): Child Welfare in the UK, Blackwell Science, Oxford. \nSutton C, Utting D, Farrington D (2005): Support from the Start: working with \nyoung children and their families to reduce the risks of crime and anti-\nsocial behaviour Research Briefs, Home Office, London. \nThorpe D (1994): Evaluating child protecton Milton Keynes, Open University \nPress,  \nTilbury C (2000): Performance Measurement in Child Protection. british \nJournal of Social Work. \n 25 \nWoods D, Johannesen L, Cook L, Sarter N (1994): Behind Human Error: \nCognitive Systems, Computers and Hindsight Wright-Patterson Air \nForce Base, Ohio, CSERIAC,  \n \n \n"}