{"doi":"10.1063\/1.3483603","coreId":"15220","oai":"oai:dro.dur.ac.uk.OAI2:8063","identifiers":["oai:dro.dur.ac.uk.OAI2:8063","10.1063\/1.3483603"],"title":"Simulation of the loss mechanisms in organic solar cells : a description of the mesoscopic Monte Carlo technique and an evaluation of the first reaction method.","authors":["Groves,  C.","Kimber,  R.G.E.","Walker,  A.B."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-10-01","abstract":"In this letter we evaluate the accuracy of the first reaction method (FRM) as commonly used to reduce the computational complexity of mesoscale Monte Carlo simulations of geminate recombination and the performance of organic photovoltaic devices. A wide range of carrier mobilities, degrees of energetic disorder, and applied electric field are considered. For the ranges of energetic disorder relevant for most polyfluorene, polythiophene, and alkoxy poly(phenylene vinylene) materials used in organic photovoltaics, the geminate separation efficiency predicted by the FRM agrees with the exact model to better than 2%. We additionally comment on the effects of equilibration on low-field geminate separation efficiency, and in doing so emphasize the importance of the energy at which geminate carriers are created upon their subsequent behavior.\\u","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15220.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/8063\/1\/8063.pdf","pdfHashValue":"b39f80e41c284068e45d831e08931641e22049a5","publisher":"American Institute of Physics","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:8063<\/identifier><datestamp>\n      2011-03-09T15:17:02Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Simulation of the loss mechanisms in organic solar cells : a description of the mesoscopic Monte Carlo technique and an evaluation of the first reaction method.<\/dc:title><dc:creator>\n        Groves,  C.<\/dc:creator><dc:creator>\n        Kimber,  R.G.E.<\/dc:creator><dc:creator>\n        Walker,  A.B.<\/dc:creator><dc:description>\n        In this letter we evaluate the accuracy of the first reaction method (FRM) as commonly used to reduce the computational complexity of mesoscale Monte Carlo simulations of geminate recombination and the performance of organic photovoltaic devices. A wide range of carrier mobilities, degrees of energetic disorder, and applied electric field are considered. For the ranges of energetic disorder relevant for most polyfluorene, polythiophene, and alkoxy poly(phenylene vinylene) materials used in organic photovoltaics, the geminate separation efficiency predicted by the FRM agrees with the exact model to better than 2%. We additionally comment on the effects of equilibration on low-field geminate separation efficiency, and in doing so emphasize the importance of the energy at which geminate carriers are created upon their subsequent behavior.\\ud\n<\/dc:description><dc:publisher>\n        American Institute of Physics<\/dc:publisher><dc:source>\n        Journal of chemical physics, 2010, Vol.133(14), pp.144110 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2010-10-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:8063<\/dc:identifier><dc:identifier>\n        issn:0021-9606<\/dc:identifier><dc:identifier>\n        issn: 1089-7690<\/dc:identifier><dc:identifier>\n        doi:10.1063\/1.3483603<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/8063\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1063\/1.3483603<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/8063\/1\/8063.pdf<\/dc:identifier><dc:rights>\n        Copyright 2010 American Institute of Physics. This article may be downloaded for personal use only. Any other use requires prior permission of the author and the American Institute of Physics. The following article appeared in Groves, C. and Kimber, R.G.E. and Walker, A.B. (2010) 'Simulation of the loss mechanisms in organic solar cells : a description of the mesoscopic Monte Carlo technique and an evaluation of the first reaction method.', Journal of chemical physics., 133 (14). p. 144110 and may be found at http:\/\/dx.doi.org\/10.1063\/1.3483603<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0021-9606"," 1089-7690","issn:0021-9606","issn: 1089-7690"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n09 March 2011\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nGroves, C. and Kimber, R.G.E. and Walker, A.B. (2010) ’Simulation of the loss mechanisms in organic solar\ncells : a description of the mesoscopic Monte Carlo technique and an evaluation of the first reaction method.’,\nJournal of chemical physics., 133 (14). p. 144110.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1063\/1.3483603\nPublisher’s copyright statement:\nCopyright 2010 American Institute of Physics. This article may be downloaded for personal use only. Any other use\nrequires prior permission of the author and the American Institute of Physics. The following article appeared in\nGroves, C. and Kimber, R.G.E. and Walker, A.B. (2010) ’Simulation of the loss mechanisms in organic solar cells : a\ndescription of the mesoscopic Monte Carlo technique and an evaluation of the first reaction method.’, Journal of\nchemical physics., 133 (14). p. 144110 and may be found at http:\/\/dx.doi.org\/10.1063\/1.3483603\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nSimulation of loss mechanisms in organic solar cells: A description of the\nmesoscopic Monte Carlo technique and an evaluation of the first\nreaction method\nChris Groves,1,a\u0002 Robin G. E. Kimber,2 and Alison B. Walker2,b\u0002\n1School of Engineering and Computing Science, Durham University, South Road,\nDurham DH1 3LE, United Kingdom\n2Department of Physics, University of Bath, Bath BA2 7AY, United Kingdom\n\u0002Received 5 June 2010; accepted 26 July 2010; published online 13 October 2010\u0003\nIn this letter we evaluate the accuracy of the first reaction method \u0002FRM\u0003 as commonly used to\nreduce the computational complexity of mesoscale Monte Carlo simulations of geminate\nrecombination and the performance of organic photovoltaic devices. A wide range of carrier\nmobilities, degrees of energetic disorder, and applied electric field are considered. For the ranges of\nenergetic disorder relevant for most polyfluorene, polythiophene, and alkoxy poly\u0002phenylene\nvinylene\u0003 materials used in organic photovoltaics, the geminate separation efficiency predicted by\nthe FRM agrees with the exact model to better than 2%. We additionally comment on the effects of\nequilibration on low-field geminate separation efficiency, and in doing so emphasize the importance\nof the energy at which geminate carriers are created upon their subsequent behavior.\n© 2010 American Institute of Physics. \u0004doi:10.1063\/1.3483603\u0005\nI. INTRODUCTION\nOrganic photovoltaic devices \u0002OPVs\u0003 made from\nsolution-processable materials can make use of potentially\nlow-cost manufacture techniques, and as such may prove to\nbe a new paradigm in the generation of renewable energy.\nThe efficiencies of OPVs currently lag behind their inorganic\ncounterparts and must be improved if they are to be success-\nfully commercialized. This is complicated by the seemingly\nunavoidable need of a bulk heterojunction \u0002BHJ\u0003 for efficient\ncharge generation in OPVs.1,2 The formation of a BHJ is in\nitself rather straightforward, since one only needs to cast a\nfilm from a common solution of the two materials with dif-\nfering electron affinities. For optimal OPV performance we\nrequire the domains of the BHJ to be around the exciton\ndiffusion length3,4 of \u000610 nm.5 While this can be broadly\nachieved by altering the manufacture conditions,6,7 the BHJ\ninvariably shows significant heterogeneity in morphology\nand as such heterogeneity in performance.8 Since the perfor-\nmance of OPVs is inextricably linked to morphology, and the\nmorphology can be complicated, this poses the question of\nhow one goes about modeling to understand their operation,\nand ultimately provide guidance as to how they can be im-\nproved.\nAs one might expect there is a wide spectrum of model-\ning techniques for examining charge transport and device\nperformance,9–12 each of which can be useful in different\ncircumstances. Since morphology is key to determining the\nperformance of OPVs, a model that includes the effect of\nmorphology without being computationally expensive desir-\nable. A popular technique to achieve this is mesoscopic\nMonte Carlo \u0002MMC\u0003. In MMC the tangled polymer chains\nand small molecules are simplified into a Cartesian grid, the\ncells of which that has either electron- or hole-transporting\ncharacter. As a result, information as to the effect of, for\nexample chain rotation,13 may be lost, but generic properties\nof the transporting materials such as energetic disorder and\naverage coupling constant between hopping sites are re-\ntained. Most importantly, information relating to the nano-\nscale morphology can be included. This balance of capabili-\nties is particularly appropriate to OPVs and has already been\nused to show the effect of morphology on open-circuit volt-\nage, short-circuit current, and device efficiency.14–17 MMC\nmodels are able to reproduce key findings of experimental\ndata including, for example, the Poole–Frenkel type electric\nfield dependence of carrier mobility,15 the importance\nof geminate recombination14–16,18 as seen in\npolymer-polymer4,19 and polymer-fullerene20,21 OPVs, and\nthe effect of morphology on OPV performance14–16,22 as re-\nported widely in experiment.8 Furthermore, MMC models\nhave allowed close examination of important aspects of OPV\nperformance such as geminate22–25 and bimolecular15,26 re-\ncombination, mobility,27 and exciton dissociation.14,16 MMC\nmodels have allowed examination of the impact of specific\nphysical processes or device geometries upon OPV perfor-\nmance, such as charge trapping,18 high on\/off chain mobility\nratios,25 and bicontinuous gyroid morphologies,3 which\nwould be difficult to achieve experimentally. Thus, while\nhaving its drawbacks, the MMC model has proven itself to\nbe a useful tool in analyzing the performance of OPVs.\nHowever, MMC models are only barely feasible for the\nsimulation of OPV characteristics even when multiple pro-\ncessor supercomputers are used. This is because the number\nof charges considered is typically in the range of 100, and for\neach carrier one must calculate all of the possible hopping\nand recombination events in a morphologically and energeti-\na\u0003Electronic mail: chris.groves@durham.ac.uk.\nb\u0003Electronic mail: a.b.walker@bath.ac.uk.\nTHE JOURNAL OF CHEMICAL PHYSICS 133, 144110 \u00022010\u0003\n0021-9606\/2010\/133\u000314\u0002\/144110\/7\/$30.00 © 2010 American Institute of Physics133, 144110-1\nDownloaded 09 Mar 2011 to 129.234.252.67. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\ncally disordered landscape. Furthermore, the simulation must\nbe allowed to proceed for a sufficiently long time to obtain\nreliable average values. A key simplification to allow these\nsimulations to be possible is the so-called first reaction\nmethod \u0002FRM\u0003.28 The FRM relates to how the hopping be-\nhavior of the charges is calculated, and so before discussing\nthe FRM in detail, we will first review the important consid-\nerations with regard to charge transport in a device. The rate\nof charge hopping depends upon the associated change in\npotential. In conjugated polymers and small molecules the\ndielectric constant is low \u0002\u0002\u00063–4\u0003, meaning that charges\nexperience a strong Coulombic interaction with carriers in\ntheir local vicinity. These charges are mobile, and so the\npotential landscape is constantly fluctuating. In an exact\nsimulation, the behavior of all charges would be updated\nwhenever the potential landscape changed, for example\nwhen a carrier hops or recombines. Constantly updating the\nbehavior of all carriers after any event in the simulation\nmakes it unfeasible to simulate OPV characteristics. In the\nFRM method, the behavior of each charge is calculated once\nwhen a charge is moved to a particular location and not\nupdated when the local potential landscape changes. As num-\nber of carriers in an OPV simulation is of the order \u0006100\n\u0002with variations depending on morphology and incident light\nintensity\u0003, the FRM saves a factor of \u0006100 in run-time com-\npared to the exact simulation. When one considers that even\nan FRM simulation of an OPV J-V curve takes of the order\n10 h on a supercomputing cluster, it soon becomes apparent\nthe exact method carries an almost prohibitive computational\nburden. In addition to the significant savings in run-time, the\nFRM framework allows easy avoidance of the pitfalls asso-\nciated with “double counting” of recombination events,\nwhich will be discussed further in Sec. II.\nOne might expect the FRM to become a bad approxima-\ntion to the exact method in circumstances when the local\npotential changes by large amounts quickly. This is a circum-\nstance that occurs often in the process of geminate recombi-\nnation or separation, as photogenerated geminate charges are\ntethered Coulombically to one another either side of the in-\nterface between electron- and hole-transport materials and\nmake repeated \u0002often unsuccessful\u0003 attempts to separate on\nshort time scales prior to recombination,3,22 unless the carri-\ners are trapped.18 The only test to date on the validity of the\nFRM examined the dynamic behavior of geminate charges\nwhen both electron and hole mobilities were equal,15 in\nwhich it was found the FRM and exact method agreed well.\nHowever the absolute effect of the FRM on the geminate\nseparation efficiency, \u0003GS, has not been measured, nor has\nthe effect of differing carrier mobilities or energetic disorder.\nThe uncertainty surrounding the accuracy of the FRM has\nled some authors26,29 to use the exact method when perhaps\nthe extra computational expense is unnecessary. Since gemi-\nnate recombination has been identified as a major loss\nmechanism in OPVs,4,19–21 it is crucial that the accuracy of\nMMC models using the FRM technique is established.\nHence, in this paper we test the validity of the FRM\nmethod when compared to the exact method in the simula-\ntion of geminate separation efficiency over a wide range of\ncircumstances that are relevant for OPVs. The data presented\nhere were generated by two realizations of the MMC code\nthat have been developed in isolation of one another allow-\ning us to also comment on the portability of MMC tech-\nniques discussed here. Furthermore, since we have generated\ndata for the purposes of comparison over a wide field range,\nwe are able to comment on low-field geminate separation\nefficiency, which is important in determining the open-circuit\nvoltage of OPVs.\nII. SIMULATION METHODOLOGY\nAs is common in MMC models, the morphology is here\nrepresented by a regularly spaced Cartesian array of sites that\nhave either electron- or hole-transporting character, which\nwe will denote as material A and B, respectively. Blend mor-\nphologies are generated using the simulated annealing ap-\nproach of Peumans et al.30 In this technique, each site is\ninitially randomly assigned to be either A or B with a prob-\nability that corresponds to the blend ratio, which here is 1:1.\nA pair of adjacent sites is then chosen at random and the\nchange in interfacial energy associated with the pair swap-\nping positions, \u0004E, is calculated. To ensure that phase sepa-\nration is energetically favored we must satisfy 2EAB−EAA\n−EBB\u00050, and so here we choose\n2EAB = EAA = EBB. \u00021\u0003\nPairwise swaps are accepted with probability\nP\u0002\u0004E\u0003 =\nexp\u0002− \u0004E\/kT\u0003\n1 + exp\u0002− \u0004E\/kT\u0003\n. \u00022\u0003\nMany attempts at pairwise swaps are made until one obtains\nthe desired domain size, d. By assuming the morphology to\nbe a regular array of cubes, one can estimate d from the\nblend volume V and interfacial area A\nd =\n3V\nA\n. \u00023\u0003\nTypically \u0006106 iterations are required to obtain morpholo-\ngies that are of the length scale of \u000610 nm if the lattice\nspacing is 1 nm, as is the case here. The simulated annealing\napproach of generating morphology reproduces some of the\nfeatures seen in real devices, especially those in small-\nmolecule systems. Other techniques have also been used in\nMMC models that allow the inclusion of more information,\nfor example the “slithering snake” approach25,31 allows de-\nscription of chain positions, whereas more complete descrip-\ntions of polymer phase-separation dynamics32 allow descrip-\ntion of heterogeneity on multiple length scales. Here we are\ninterested in examining the behavior of geminate pair sepa-\nration as predicted by the FRM and exact methods and so we\nwill consider bilayers, as they are the simplest test system,\nand d=10 nm blend morphologies, since this is appropriate\nto OPV devices.\nAfter the morphology is generated, each site is assigned\na Gaussian distributed energy to mimic the effects of ener-\ngetic disorder. The standard deviation of the distribution, \u0006,\nis varied over the range of 0–150 meV to encompass the\nrange of values of energetic disorder commonly reported for\nconjugated polymers used in OPVs.33–35 A simulation begins\n144110-2 Groves, Kimber, and Walker J. Chem. Phys. 133, 144110 \u00032010\u0002\nDownloaded 09 Mar 2011 to 129.234.252.67. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nby the introduction of a geminate pair to a randomly chosen\npair of sites that comprise either side of a heterojunction.\nImplicit in this assumption is that charges are created uni-\nformly within the density of states of the highest occupied\nmolecular orbital and lowest unoccupied molecular orbital,\nan assumption that has been made by a number of\nauthors.15,22,23 However, recently it has been shown that the\nenergy of the site which the geminate pair created can have a\ndramatic effect on its eventual separation efficiency.18 This\nhas implications for the simulation of OPVs, since exciton\nmigration will lead to geminate charges being created at\nlower energies in the density of states, and so including the\neffects of exciton migration is likely to be important in simu-\nlating real OPV devices.14 However, since it is difficult to\ndefine an energy at which charges are injected that is univer-\nsally applicable, and our prime purpose is to test the method\nrather than further explore the physical process of charge\nseparation, we make the assumption that charges are injected\nrandomly within the density of states. We discuss in Sec. IV\nthe effect of this assumption on low field dissociation prob-\nability. Returning to the simulation methodology, charges can\nrecombine when adjacent at a constant rate, which here is\ntaken to be 107 s−1. Carriers can also move by nearest neigh-\nbor hops from their current site, i to nearest neighbor sites of\nthe appropriate material \u0002electrons to A, holes to B\u0003, j at a\nrate described by the Marcus equation\nwij = Ne\u0002h\u0003\u0007 exp\u0007− \u0002Ej − Ei + ER\u000324ER kT \b , \u00024\u0003\nwhere \u0007 is a factor that describes the average inter- and in-\ntramolecular coupling that is assumed to be 1011 s−1,18 Ej\nand Ei are the site energies, while ER is the reorganization\nenergy associated with electron- or hole-transfer which for\nthis reaction is twice the polaron energy and taken to be 0.25\neV.18 Ne\u0002h\u0003 is a prefactor to modify the mobility of the elec-\ntron \u0002hole\u0003, which is 1 unless otherwise specified. Site ener-\ngies include Coulomb interactions between carriers, assum-\ning a relative dielectric constant of 4, and the contribution\nfrom energetic disorder with a Gaussian distribution of width\n\u0006 noted above.\nAdditionally, it is worth noting that in device models the\nquestion of how to include Coulomb interactions between\ncharges and image charges is a very important one. In early\nmodels14,15 Coulomb interactions were calculated by use of a\npotential array that had the same dimensions as the morphol-\nogy. Whenever a charge was introduced or removed, this\npotential array was modified by the monopole potential of\nthe charge, and whenever a charge was moved the potential\narray was modified by a dipole potential. The potential array\ncould then be used as a reference to calculate the hopping\nrates of carriers, while paying careful attention to ensure that\nthe potential due to the carrier under consideration was cor-\nrected for in the calculation. To include all Coulombic inter-\nactions would mean modifying every element in the potential\narray whenever an event occurred in the simulation. Practi-\ncally speaking this is too time consuming, since perhaps 106\npotentials within the array would have to be altered any time\nan event within the simulation occurred. The early way of\ncoping with this was to introduce a cut-off radius rc beyond\nwhich Coulombic interactions would not be included. De-\npending upon the value of rc chosen, which varied from the\nCoulomb capture radius \u0002\u000616 nm\u000315 to some multiple of the\nDebye length \u0002\u00069 nm\u0003,14 the number of potentials needing\nto be updated dropped by factors between 30 and 170 when\ncompared to the exact method. Recently\nCasalegno et al.29 evaluated the impact of the cut-off radius\napproximation on simulated OPV performance by compari-\nson to an exact and computationally efficient Ewald sum\ntechnique, and found that the cut-off radius technique\nslightly underestimated the efficiency of devices to an extent\nwhich depended upon the value of rc. Hence the utility of the\nEwald sum technique in application to OPV simulations is\nwell demonstrated. Here we briefly discuss another tech-\nnique that can be used to accurately calculate Coulombic\ninteractions without excessive computational overhead.\nThe occupation probability of a site in a typical OPV\nsimulation is typically 10−4. Thus calculating everywhere the\nlocal potential due to Coulomb interactions, as occurs when\nusing a potential array discussed above, is computationally\nwasteful. We can make significant savings by instead calcu-\nlating the potential only where there is a possible change of\noccupation \u0002i.e., the origin and possible destination sites\u0003.\nPractically this involves stepping through each of the carriers\nin the simulation, again excluding the carrier under consid-\neration, and calculating the potential contribution of that\ncharge and associated image charges to the site where one\nwants to calculate the potential. Calculations of the potential\nusing this method thus scale like the carrier population rather\nthan rc\n3\n, and usually result in orders of magnitude improve-\nment in the simulation run-time while also improving\naccuracy29 when compared to the potential array technique.\nReturning to our present simulations of geminate sepa-\nration efficiency, from all of the possible processes that can\noccur to a charge, we generate a random time-to-event using\nthe following equation:\n\b =\n− ln\u0002X\u0003\nw\n. \u00025\u0003\nHere X is a randomly generated number that is evenly dis-\ntributed between 0 and 1, and w is the rate of the process\nbeing considered. The event with the shortest waiting time is\nchosen as the behavior for the carrier, and the time to that\nevent is logged in the simulation queue. The simulation steps\nforward in time to execute the next event in the queue, short-\nening the time to other events by the corresponding amount,\nuntil either the carriers recombine or successfully separate,\nwhich here we define as having occurred when the carriers\nreach a separation of 25 nm. We note that this definition of\nthe separation radius is somewhat arbitrary since one could\nargue that the carriers are not free until they are separated by\nmore than the thermal capture radius \u0002\u000616 nm\u0003 or infinity.\nHowever, since OPVs are of the order of \u0006100 nm thick\nand domain sizes in optimized OPVs are of the order\n\u000610 nm, we view the separation radius of 25 nm to be a\nrelevant length scale for OPV devices. It is noted that gemi-\nnate and biomolecular recombination will compete in an\nOPV to some extent and consequently it is possible that\ngeminate carriers which have separated by less than 25 nm,\n144110-3 An evaluation of the first reaction method J. Chem. Phys. 133, 144110 \u00032010\u0002\nDownloaded 09 Mar 2011 to 129.234.252.67. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nand so would be considered Coulombically bound by the\nabove definition, may recombine biomolecularly. However,\nsince geminate recombination appears to be the major loss\nmechanism in some OPVs,4,19–21 and that competition be-\ntween geminate and bimolecular recombination ought to be\nviewed in a device context, we here consider geminate re-\ncombination as a standalone process. Returning to the simu-\nlations, at the end of each trial the energetic disorder is re-\nchosen from the same distribution before being run again\nwith a new geminate charge pair. The data shown here are\nthe average of at least 105 trials.\nWe make another point here to comment on the impor-\ntance of how hopping and recombination events are imple-\nmented within the model. Hopping is a process that is spe-\ncific to the carrier under consideration, i.e., it is a one-carrier\nprocess, while recombination is a two-carrier process. This\nintroduces a subtle but significant problem when one is cal-\nculating the behavior of the carriers. The carrier-specific na-\nture of hopping obliges us to decide the behavior of the\ncarrier on an individual basis. Hence if one is not careful,\nrecombination may be double counted. To illustrate this\nproblem, consider a geminate pair which has been created by\na dissociating exciton. If one has structured the program in\nsuch a manner that all recombination processes and all hop-\nping processes are considered for each carrier, the time to\nrecombination will be calculated twice. Since the event at the\ntop of the queue is chosen as the behavior for the carriers,\nthere are two opportunities for recombination to be the fast-\nest event rather than just one, which in turn makes recombi-\nnation more likely. Thus one needs to ensure that for a pair\nof carriers the recombination behavior is calculated once\nonly. Practically this can be achieved by simply “switching\noff” recombination for the first carrier prior to calculating the\nbehavior of the second carrier with recombination “switched\non.” A benefit of the FRM becomes apparent here since car-\nrier behavior is calculated one carrier at a time \u0002apart from\nthe initial injection of carrier pairs\u0003, and so the double count-\ning of recombination does not occur. This would be rather\ndifficult to achieve in an exact device model since for each\nrecalculation of the carrier behaviors, which occur whenever\na carrier hops or recombines, one would need to identify all\nof the carrier pairs and only calculate the time to recombina-\ntion for each pair once.\nIII. RESULTS\nThe simulations reported in the main text were generated\nat the University of Durham, using a Monte Carlo code\nwhich was developed largely by the first author.18,22 Some of\nthese simulations were repeated at the University of Bath\nusing a nominally identical Monte Carlo code3,14 which was\ndeveloped in isolation. The results of the Bath simulations,\nwhich correspond to Figs. 1\u0002a\u0003–1\u0002c\u0003 and are shown in the\nsupporting information,36 are very similar to the Durham\ndata reported in the main text as they reproduce all of the\ntrends which we discuss in the forthcoming paragraphs. This\nFIG. 1. Geminate separation efficiency, \u0003GS, as predicted by MMC for a bilayer when \u0002a\u0003 \u0006=0 meV, \u0002b\u0003 \u0006=50 meV, and \u0002c\u0003 \u0006=100 meV. Black squares,\nred circles, and blue triangles correspond to Ne=1, 0 and 10, respectively, while all curves have Nh=1. Closed symbols and solid lines correspond to the FRM\nmethod, while open symbols and dashed lines to the exact method. Figure 1\u0002d\u0003 shows \u0003GS for a d=10 nm blend when \u0006=100 meV.\n144110-4 Groves, Kimber, and Walker J. Chem. Phys. 133, 144110 \u00032010\u0002\nDownloaded 09 Mar 2011 to 129.234.252.67. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\ndemonstrates the robustness of the technique and its portabil-\nity to other research groups with use of papers freely avail-\nable in the literature.\nWe begin by examining data corresponding to bilayer\nstructures. Figures 1\u0002a\u0003–1\u0002c\u0003 show geminate separation effi-\nciency \u0003GS when \u0006=0, 50, and 100 meV, respectively, for a\nwide range of field F as predicted by both FRM and exact\nmethods. For each value of energetic disorder considered we\npredict the behavior for three values of electron mobility\nfactor Ne=0, 1, and 10 while we maintain Nh=1, which,\nrespectively, correspond to one carrier being trapped, both\ncarriers having nonzero equal mobility, and both carriers\nhaving finite but unequal mobility. The general behavior is\nthe same for all curves, namely, that \u0003GS is saturated at small\nfields, increases as \u0006exp\u0002F \/F0\u0003 when F exceeds \u00064\n\t106 V \/m \u0002where F0 is a constant with units V\/m\u0003, as op-\nposed to linearly with field,10 and saturates at \u0006100% when\nF exceeds \u0006108 V \/m. Before we continue to discuss the\ndifference between the FRM and exact methods, we will first\ndiscuss what such a comparison is expected to reveal by\nconsidering an electron-hole pair either side of a heterojunc-\ntion. Within the FRM method, if the electrons were to move\naway from the hole, the hole would not be subject to the\nreduced Coulomb interaction that is a consequence of the\nreceding electron until the hole moves and the new Coulom-\nbic environment is calculated. Therefore we would expect\nthat the FRM would underestimate the separation efficiency\nwhen both carriers are mobile. By comparison, if one carrier\nis trapped \u0002i.e., Ne=0\u0003 then the potential environment of the\nmobile carrier will never change and hence the FRM and\nexact methods should be coincident. Examining Figs.\n1\u0002a\u0003–1\u0002c\u0003 for Ne=0, we can see that the two models do co-\nincide within the noise of the measurement, in agreement\nwith our expectation. Now turning our attention to the cases\nexamined where both carriers are mobile, Ne=1 and 10, we\ncan see that the FRM model underestimates \u0003GS, again in\nagreement with our expectation. Additionally, we see that the\ndifference between the models is not constant with field, and\nthat the agreement between models improves with field. Fig-\nure 1\u0002d\u0003 shows the separation efficiency predicted by the\nFRM and exact methods for a d=10 nm blend for the same\nrange of mobilities as considered for Figs. 1\u0002a\u0003–1\u0002c\u0003. As an-\nticipated, the separation efficiency for a given mobility and\nfield is lower for a blend than in a bilayer since the space\navailable for separation and orientation of the interface to the\nfield is less conducive to charge separation.22 Furthermore,\nwe see that the separation efficiency begins to increase at a\nhigher field than for the bilayer device with a similar value of\ndisorder. The agreement between the FRM and exact models\nfor the blend is very similar to that shown for the bilayer\ndevice when using the same parameters.\nTo examine the agreement between models more closely,\nwe calculate the average value of the data points shown in\neach of the Figs. 1\u0002a\u0003–1\u0002c\u0003 for the FRM and exact methods,\nwhich we denote as \t\u0003FRM\n and \t\u0003EX\n, respectively, which\ncorrespond to a “field average” value of \u0003GS. We then plot\n\t\u0003FRM\n− \t\u0003EX\n, which relates to the average difference be-\ntween the two models, in Fig. 2 for each of the mobility\ncombinations as a function of disorder. We also include in\nFig. 2 corresponding data for \u0006=25, 75, and 150 meV, which\nwe do not show in more detail for the sake of brevity.\nFigure 2 shows that when both carriers are mobile \u0002Ne\n=1, 10\u0003 the FRM method can underestimate \u0003GS to an ex-\ntent that varies with energetic disorder. At zero disorder the\nFRM model underestimates \u0003GS by less than 1%, and with\nincreasing \u0006, the agreement deteriorates up to \u0006=25 meV,\nwhere the FRM underestimates \u0003GS by \u00066.5%, before\ngradually improving until the FRM and exact methods agree\nto better than 1% when \u0006\u0005100 meV. The agreement\/\ndisagreement between the models appears to be relatively\ninsensitive to the magnitudes of the carrier mobilities pro-\nvided that both carriers are mobile. While a peak disagree-\nment of \u00066.5% may seem serious, two important caveats\nshould be borne in mind. First, the agreement between the\nmodels improves with the electric field \u0004see Figs. 1\u0002a\u0003–1\u0002c\u0003\u0005,\nand thus at short circuit and at the maximum power point of\nan OPV, the agreement between the FRM and exact methods\nwill be better than the field average values shown in Fig. 2.\nSecond, and most importantly, the range of disorder reported\nfor technologically relevant conjugated polymers, such as\npolyfluorenes,33,34,37 polythiophenes,38–40 and alkoxy\npoly\u0002phenylene vinylene\u0003 derivatives,38,41,42 is generally \u0006\n\n50 meV. In this regime the agreement between the com-\nputationally less expensive FRM and exact method is better\nthan 2%. This is a key result.\nIt is interesting to understand the reason for the \u0006 depen-\ndence of the agreement between the FRM and exact models\neven though there is good agreement over the range of inter-\nest. When \u0006=0, the disagreement between models is \u00061%,\nwhich increases rapidly to a peak when \u0006\u000625 meV, before\ngradually reducing as \u0006 increases further. To explain this, we\nwill first consider the effect of introducing disorder to the\nseparation process. In a bilayer geometry, a carrier can es-\ncape its partner’s influence by following any of the routes in\nthe hemisphere of material that transports that charge carrier.\nWhen disorder is introduced, some of these routes will be-\ncome more difficult to follow due to unfavorable combina-\ntions of the local energetic disorder. When disorder is in-\nFIG. 2. The difference between field-average values of \u0003GS values predicted\nby FRM and exact methods, \u0003FRM and \u0003EX, respectively, over a range of\nvalues of energetic disorder \u0006. Black squares, red circles and blue triangles\ncorrespond to Ne=0, 1, and 10, respectively, while all curves have\nNh=1.The range of energetic disorder values reported for conjugated poly-\nmers is rarely below 50 meV and most commonly around 100 meV.\n144110-5 An evaluation of the first reaction method J. Chem. Phys. 133, 144110 \u00032010\u0002\nDownloaded 09 Mar 2011 to 129.234.252.67. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\ncreased, the number of routes to separation is reduced due to\nthe undulating potential landscape, in much the same way a\nblend morphology reduces the number of routes to\nseparation.22 Thus increasing \u0006 carries with it an implicit\nreliance on progressively fewer routes to successful separa-\ntion. We speculate that the reliance on fewer likely routes to\nseparation when \u0006 increases makes the process of predicting\n\u0003GS more sensitive to errors in the way in which electrostat-\nics are treated, thus further reducing \t\u0003FRM\n as compared to\n\t\u0003EX\n when \u0006 increases. However, when we approach the\nlimt of large \u0006, the the probability of carriers becoming\ntrapped increases. Since it has been shown that when one\ncarrier is trapped \u0002Ne=0\u0003 that the the FRM and exact models\ncoincide \u0002Fig. 2\u0003, we further speculate that good agreement\nbetween the FRM and exact models in the limit of large \u0006 is\ndue to charge trapping. These two mechanisms, involving the\nfewer likely routes to separation \u0002which reduces \t\u0003FRM\n with\nincreasing \u0006\u0003 and the increased probability of charge trap-\nping \u0002which reduces the difference between \t\u0003FRM\n and\n\t\u0003EX\n with increasing \u0006\u0003, though speculative, could explain\nthe data shown in Fig. 2.\nWe tested these proposed mechanisms further by repeat-\ning the simulations for the \u0006=50 meV bilayer with spatially\ncorrelated energetic disorder in the manner of Gartstein and\nConwell43 with a correlation range of 1 nm. The effect of\ncorrelating disorder is to reduce the probability of isolated\ntraps or potential barriers, thus reducing the effect of both of\nthe mechanisms we describe above. We find that the agree-\nment between the FRM and exact model “field average” im-\nproves to being better than 2% difference for Ne=1 and 10,\nin comparison to a greater than 3% disagreement shown for\nwhen energetic disorder is spatially random \u0002as shown in Fig.\n2\u0003. These data show that the disagreement between the FRM\nand exact models is sensitive to the spatial arrangement of\nenergetic disorder, which is consistent with our proposed ex-\nplanation of the disagreement between the two models.\nThe low-field values of \u0003GS, as predicted by the exact\nmodel, are shown to have an unexpected dependence on \u0006\nthat is replotted in a more convenient form in Fig. 3. One\nmight expect that increasing the value of \u0006, and thus reduc-\ning the equilibrium mobility, would result in a monotonic\nreduction in the low-field value of \u0003GS. However, for the\ncurrent simulations show that when both carriers are mobile\nthe low-field \u0003GS reduces and then increases with increasing\n\u0006, while when one carrier is mobile the low-field \u0003GS mono-\ntonically increases. It is important to understand these unex-\npected results since low-field charge separation can play a\npart in determining the photocurrent under forward bias, and\nthus the open circuit voltage of OPVs. We explain the trends\nshown in Fig. 3 by equilibration effects. When disorder is\nincreased, we also increase the degree of energy available to\na carrier early in its attempt to separate since the initial en-\nergy of the carrier is that of the site it was created. When one\ncarrier is trapped, the mobile carrier can use this energy to its\nbest advantage since the opposite carrier will not “follow”\nthe mobile charge in the plane of the heterojunction.3,22\nHowever, when both carriers are mobile, any initial\nseparation obtained by a carrier from initial energy can be\nnullified by the opposite carrier “following” it in the plane of\nthe heterojunction. Thus, one must provide more initial enery\n\u0002i.e., large \u0006\u0003 to see an improvement in separation efficiency\nwhen both carriers are mobile compared to when only one\ncarrier is mobile \u0002Fig. 3\u0003. To confirm these assertions, the\nabove simulations were repeated while setting the initial en-\nergy of the charge carriers to be a fraction of the equilibrium\nenergy,44 \u00062 \/2kT, and are plotted as open symbols on Fig. 3.\nThese data recover the monotonic decrease in \u0003GS with in-\ncreasing \u0006 that was originally expected.\nIV. SUMMARY\nHere we have evaluated the accuracy of a commonly\nused approximation in MMC models, the FRM, in the pre-\ndiction of geminate separation efficiency over a wide range\nof values of energetic disorder, mobility, and electric fields\nthat are relevant for OPVs. It is shown that for most OPV\nmaterials in which \u0006\u0006100 meV the separation probability\nof geminate charges predicted by the FRM model agrees\nwith the exact method to within 2%. This shows that the\ncomputational burden of MMC models can in most cases be\nreduced with the use of the FRM method without signifi-\ncantly affecting simulation accuracy. Outside the range of\nvalues of energetic disorder which are of interest in most\nconjugated polymers of interest \u000225 meV\u000b\u0006\u000b50 meV\u0003,\nthe agreement between the FRM and exact method is shown\nto be worse, reaching a peak disagreement of 6.5%. The\ndisorder dependence of the agreement between models is ex-\nplained in terms of the disorder dependence of the number of\navailable routes to separation and the disorder dependence of\ntrapping. Additionally, we demonstrate the strong effect that\nthe initial energy of charges has upon the subsequent sepa-\nration behavior.\nACKNOWLEDGMENTS\nThis work was supported by the European Commission\nFP-6 program MODECOM \u0002Grant No. NMP-CT-2006-\n016434\u0003. R.G.E.K. thanks the UK Engineering and Physical\nSciences Research Council for a studentship. Simulations\nFIG. 3. Low-field dissociation probability \u0003GS as a function of energetic\ndisorder \u0006 as predicted by the exact model when carriers are injected at\nrandom into the density of states \u0002solid\u0003 and when the carriers are injected at\na more equilibrated energy of −\u00062 \/2kT \u0002open\u0003.\n144110-6 Groves, Kimber, and Walker J. Chem. Phys. 133, 144110 \u00032010\u0002\nDownloaded 09 Mar 2011 to 129.234.252.67. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\nwere carried out on the Durham University Hamilton\nSupercomputing cluster and the University of Bath High\nPerformance Cluster “Aquila.”\n1 G. Yu, J. Gao, J. C. Hummelen, F. Wudl, and A. J. Heeger, Science 270,\n1789 \u00021995\u0003.\n2 J. J. M. Halls, C. A. Walsh, N. C. Greenham, E. A. Marseglia, R. H.\nFriend, S. C. Moratti, and A. B. Holmes, Nature \u0002London\u0003 376, 498\n\u00021995\u0003.\n3 R. G. E. Kimber, A. B. Walker, G. E. Schroder-Turk, and D. J. Cleaver,\nPhys. Chem. Chem. Phys. 12, 844 \u00022010\u0003.\n4 C. R. McNeill, S. Westenhoff, C. Groves, R. H. Friend, and N. C. Green-\nham, J. Phys. Chem. C 111, 19153 \u00022007\u0003.\n5 S. R. Scully and M. D. McGehee, J. Appl. Phys. 100, 034907 \u00022006\u0003.\n6 A. J. Moulé and K. Meerholz, Adv. Funct. Mater. 19, 3028 \u00022009\u0003.\n7 C. R. McNeill and N. C. Greenham, Adv. Mater. 21, 3840 \u00022009\u0003.\n8 C. Groves, O. G. Reid, and D. S. Ginger, Acc. Chem. Res. 43, 612\n\u00022010\u0003.\n9 J. Nelson, J. J. Kwiatkowski, J. Kirkpatrick, and J. M. Frost, Acc. Chem.\nRes. 42, 1768 \u00022009\u0003.\n10 R. A. Marsh, C. R. McNeill, A. Abrusci, A. R. Campbell, and R. H.\nFriend, Nano Lett. 8, 1393 \u00022008\u0003.\n11 L. J. A. Koster, E. C. P. Smits, V. D. Mihailetchi, and P. W. M. Blom,\nPhys. Rev. B 72, 085205 \u00022005\u0003.\n12 J. J. M. van der Holst, M. A. Uijttewaal, R. Balasubramanian, R. Coe-\nhoorn, P. A. Bobbert, G. A. de Wijs, and R. A. de Groot, Phys. Rev. B\n79, 085203 \u00022009\u0003.\n13 S. Athanasopoulos, J. Kirkpatrick, D. Martinez, J. M. Frost, C. M. Foden,\nA. B. Walker, and J. Nelson, Nano Lett. 7, 1785 \u00022007\u0003.\n14 P. K. Watkins, A. B. Walker, and G. L. B. Verschoor, Nano Lett. 5, 1814\n\u00022005\u0003.\n15 R. A. Marsh, C. Groves, and N. C. Greenham, J. Appl. Phys. 101,\n083509 \u00022007\u0003.\n16 F. Yang and S. R. Forrest, ACS Nano 2, 1022 \u00022008\u0003.\n17 L. Y. Meng, Y. Shang, Q. K. Li, Y. F. Li, X. W. Zhan, Z. G. Shuai, R. G.\nE. Kimber, and A. B. Walker, J. Phys. Chem. B 114, 36 \u00022010\u0003.\n18 C. Groves, J. C. Blakesley, and N. C. Greenham, Nano Lett. 10, 1063\n\u00022010\u0003.\n19 A. Gonzalez-Rabade, A. C. Morteani, and R. H. Friend, Adv. Mater. 21,\n3924 \u00022009\u0003.\n20 R. A. Marsh, J. M. Hodgkiss, and R. H. Friend, Adv. Mater. 22, 3672\n\u00022010\u0003.\n21 D. Veldman, O. Ipek, S. C. J. Meskers, J. Sweelssen, M. M. Koetse, S. C.\nVeenstra, J. M. Kroon, S. S. van Bavel, J. Loos, and R. A. J. Janssen, J.\nAm. Chem. Soc. 130, 7721 \u00022008\u0003.\n22 C. Groves, R. A. Marsh, and N. C. Greenham, J. Chem. Phys. 129,\n114903 \u00022008\u0003.\n23 U. Albrecht and H. Bassler, Chem. Phys. Lett. 235, 389 \u00021995\u0003.\n24 T. Offermans, S. C. J. Meskers, and R. A. J. Janssen, Chem. Phys. 308,\n125 \u00022005\u0003.\n25 C. Deibel, T. Strobel, and V. Dyakonov, Phys. Rev. Lett. 103, 036402\n\u00022009\u0003.\n26 C. Groves and N. C. Greenham, Phys. Rev. B 78, 155205 \u00022008\u0003.\n27 C. Groves, L. J. A. Koster, and N. C. Greenham, J. Appl. Phys. 105,\n094510 \u00022009\u0003.\n28 J. J. Lukkien, J. P. L. Segers, P. A. J. Hilbers, R. J. Gelten, and A. P. J.\nJansen, Phys. Rev. E 58, 2598 \u00021998\u0003.\n29 M. Casalegno, G. Raos, and R. Po, J. Chem. Phys. 132, 094705 \u00022010\u0003.\n30 P. Peumans, S. Uchida, and S. R. Forrest, Nature \u0002London\u0003 425, 158\n\u00022003\u0003.\n31 J. M. Frost, F. Cheynis, S. M. Tuladhar, and J. Nelson, Nano Lett. 6,\n1674 \u00022006\u0003.\n32 I. C. Henderson and N. Clarke, Macromolecules 37, 1952 \u00022004\u0003.\n33 J. C. Blakesley, H. S. Clubb, and N. C. Greenham, Phys. Rev. B 81,\n045210 \u00022010\u0003.\n34 R. U. A. Khan, D. Poplavskyy, T. Kreouzis, and D. D. C. Bradley, Phys.\nRev. B 75, 035215 \u00022007\u0003.\n35 J. K. Grey, D. Y. Kim, C. L. Donley, W. L. Miller, J. S. Kim, C. Silva, R.\nH. Friend, and P. F. Barbara, J. Phys. Chem. B 110, 18898 \u00022006\u0003.\n36 See supplementary material at http:\/\/dx.doi.org\/10.1063\/1.3483603 for\ncorresponding data from Bath University simulations.\n37 T. Kreouzis, D. Poplavskyy, S. M. Tuladhar, M. Campoy-Quiles, J. Nel-\nson, A. J. Campbell, and D. D. C. Bradley, Phys. Rev. B 73, 235201\n\u00022006\u0003.\n38 C. Tanase, E. J. Meijer, P. W. M. Blom, and D. M. de Leeuw, Phys. Rev.\nLett. 91, 216601 \u00022003\u0003.\n39 R. J. Kline, M. D. McGehee, E. N. Kadnikova, J. Liu, J. M. J. Frechet,\nand M. F. Toney, Macromolecules 38, 3312 \u00022005\u0003.\n40 A. J. Mozer and N. S. Sariciftci, Chem. Phys. Lett. 389, 438 \u00022004\u0003.\n41 W. F. Pasveer, J. Cottaar, C. Tanase, R. Coehoorn, P. A. Bobbert, P. W.\nM. Blom, D. M. de Leeuw, and M. A. J. Michels, Phys. Rev. Lett. 94,\n206601 \u00022005\u0003.\n42 M. Bouhassoune, S. L. M. v. Mensfoort, P. A. Bobbert, and R. Coehoorn,\nOrg. Electron. 10, 437 \u00022009\u0003.\n43 Y. N. Gartstein and E. M. Conwell, Chem. Phys. Lett. 245, 351 \u00021995\u0003.\n44 H. Bässler, Phys. Status Solidi B 175, 15 \u00021993\u0003.\n144110-7 An evaluation of the first reaction method J. Chem. Phys. 133, 144110 \u00032010\u0002\nDownloaded 09 Mar 2011 to 129.234.252.67. Redistribution subject to AIP license or copyright; see http:\/\/jcp.aip.org\/about\/rights_and_permissions\n"}