{"doi":"10.1002\/adma.200700394","coreId":"140002","oai":"oai:dspace.lib.cranfield.ac.uk:1826\/2380","identifiers":["oai:dspace.lib.cranfield.ac.uk:1826\/2380","10.1002\/adma.200700394"],"title":"Cathodic and Anodic Material Diffusion in Polymer\/Semiconductor-Nanocrystal\nComposite Devices","authors":["Gallardo, D. E.","Bertoni, Cristina","Dunn, Steve","Gaponik, Nikolai","Eychmüller, Alexander"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-01-01T00:00:00Z","abstract":"In the present day, the information technologies and telecommunications sector\ncontinually increase their demand for low cost, low power consumption, high\nperformance electroluminescent devices for display applications. Furthermore,\ngeneral lighting applications, such as white light and large array colour\ndisplays, would also benefit from an increase in the overall efficiency. Several\ntechnologies are being investigated to fulfill these needs, such as organic\nlight emitting diodes (OLED), polymeric light emitting diodes (PLED) and field\neffect emission devices. A new and promising technology is light emitting\ndevices (LEDs) based on nanostructured materials. With organic LEDs (OLEDs)\nalready making an impact on the market in an increasingly large number of\napplications, hybrid technologies based on organic\/inorganic nano-composites are\na potential the next step. The incorporation of highefficiency fluorescent\nsemiconductor nanoparticles has been shown to have a beneficial effect on device\nperformance, [1] modify the colour output from the device 2 and provide a\nsimplified route to generation of LED type devices. [3","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/140002.pdf","fullTextIdentifier":"http:\/\/dx.doi.org\/10.1002\/adma.200700394","pdfHashValue":"1c1ff4cc1365cf8f67a16f10de7b1aa267ff42d1","publisher":"John Wiley & Sons, Ltd","rawRecordXml":"<record><header><identifier>\noai:dspace.lib.cranfield.ac.uk:1826\/2380<\/identifier><datestamp>2011-06-21T15:39:03Z<\/datestamp><setSpec>hdl_1826_24<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>Cathodic and Anodic Material Diffusion in Polymer\/Semiconductor-Nanocrystal\nComposite Devices<\/dc:title><dc:creator>Gallardo, D. E.<\/dc:creator><dc:creator>Bertoni, Cristina<\/dc:creator><dc:creator>Dunn, Steve<\/dc:creator><dc:creator>Gaponik, Nikolai<\/dc:creator><dc:creator>Eychmüller, Alexander<\/dc:creator><dc:subject>nanoparticle<\/dc:subject><dc:subject>polymer<\/dc:subject><dc:subject>composite<\/dc:subject><dc:subject>LED<\/dc:subject><dc:subject>nanocrystal<\/dc:subject><dc:subject>CdTe<\/dc:subject><dc:subject>diffusion<\/dc:subject><dc:subject>SIMS<\/dc:subject><dc:subject>OLED<\/dc:subject><dc:subject>degradation<\/dc:subject><dc:subject>PLED<\/dc:subject><dc:subject>ITO<\/dc:subject><dc:subject>PDDA<\/dc:subject><dc:subject>oxide<\/dc:subject><dc:description>In the present day, the information technologies and telecommunications sector\ncontinually increase their demand for low cost, low power consumption, high\nperformance electroluminescent devices for display applications. Furthermore,\ngeneral lighting applications, such as white light and large array colour\ndisplays, would also benefit from an increase in the overall efficiency. Several\ntechnologies are being investigated to fulfill these needs, such as organic\nlight emitting diodes (OLED), polymeric light emitting diodes (PLED) and field\neffect emission devices. A new and promising technology is light emitting\ndevices (LEDs) based on nanostructured materials. With organic LEDs (OLEDs)\nalready making an impact on the market in an increasingly large number of\napplications, hybrid technologies based on organic\/inorganic nano-composites are\na potential the next step. The incorporation of highefficiency fluorescent\nsemiconductor nanoparticles has been shown to have a beneficial effect on device\nperformance, [1] modify the colour output from the device 2 and provide a\nsimplified route to generation of LED type devices. [3]<\/dc:description><dc:publisher>John Wiley & Sons, Ltd<\/dc:publisher><dc:date>2011-04-14T23:35:10Z<\/dc:date><dc:date>2011-04-14T23:35:10Z<\/dc:date><dc:date>2007-01-01T00:00:00Z<\/dc:date><dc:type>Article<\/dc:type><dc:identifier>D. E. Gallardo, C. Bertoni, S. Dunn, N. Gaponik, A. Eychmüller, Cathodic and Anodic Material Diffusion in Polymer\/Semiconductor-Nanocrystal Composite Devices, Advanced Materials, Special Issue: Special Section on Bionanotechnology. 2007, 19(20), 3364–3367<\/dc:identifier><dc:identifier>0935-9648<\/dc:identifier><dc:identifier>http:\/\/dx.doi.org\/10.1002\/adma.200700394<\/dc:identifier><dc:identifier>http:\/\/dspace.lib.cranfield.ac.uk\/handle\/1826\/2380<\/dc:identifier><dc:language>en_UK<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["0935-9648","issn:0935-9648"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["nanoparticle","polymer","composite","LED","nanocrystal","CdTe","diffusion","SIMS","OLED","degradation","PLED","ITO","PDDA","oxide"],"subject":["Article"],"fullText":"THIS PAPER MUST BE CITED AS:\n         Advanced Materials, Vol 19(20), 2007, 3364-3367      \nDOI: 10.1002\/adma.200700394\nCathodic and Anodic Material Diffusion in Polymer\/Semiconductor-\nNanocrystal Composite Devices\nBy Diego E. Gallardo*, Cristina Bertoni, Steve Dunn, Nikolai Gaponik, Alexander Eychmüller\nDr D.E. Gallardo, Dr C. Bertoni, Dr S. Dunn. Microsystems and Nanotechnology Centre. Building 30. Cranfield University.\nMK43 0AL Bedford. England. E-mail: d.e.gallardo@cranfield.ac.uk\nDr N. Gaponik, Prof A. Eychmüller. Physical Chemistry\/Electrochemistry. TU Dresden. Bergstr. 66b, 01062 Dresden.\nGermany\nIn the present day, the information technologies and telecommunications sector continually increase their demand for low\ncost, low power consumption, high performance electroluminescent devices for display applications. Furthermore, general\nlighting applications, such as white light and large array colour displays, would also benefit from an increase in the overall\nefficiency. Several technologies are being investigated to fulfill these needs, such as organic light emitting diodes (OLED),\npolymeric light emitting diodes (PLED) and field effect emission devices. A new and promising technology is light\nemitting devices (LEDs) based on nanostructured materials. With organic LEDs (OLEDs) already making an impact on the\nmarket in an increasingly large number of applications, hybrid technologies based on organic\/inorganic nano-composites\nare a potential the next step. The incorporation of high-efficiency fluorescent semiconductor nanoparticles has been shown\nto have a beneficial effect on device performance,[1] modify the colour output from the device[2] and provide a simplified\nroute to generation of LED type devices.[3]\nFluorescent semiconductor crystallites offer a high spectral purity and excellent luminescence quantum efficiency. These\nproperties stem from the confinement of the carriers within the nanocrystals.[4] However, this confinement also reduces the\ncarrier transport capabilities of the nanocrystals.[5,6] Carrier transport is reduced further when the nanocrystals are\nembedded in a polymer matrix.[3] Therefore, most devices incorporating semi-conductor nanocrystals work at fields in the\norder of 107 V\/m or higher. The implications of high applied fields in device degradation have been investigated by various\ngroups in other structures where similar values of field are applied, particularly in organic LEDs (OLEDs). Gao et al.[7]\nhave described damage in hybrid polymer\/nanocrystal devices caused by the current-induced oxidation of the aluminum\ncathode. In the case of OLEDs, the formation of dark spots has been related to the localized degradation of metallic\ncathodes, caused by electromigration at high operational fields.[8,9] Furthermore, Gautier et al.[10] found that field-\ninduced damage on ITO electrodes can lead to device failure.\nHere, electrode diffusion-related degradation mechanisms in nanoparticles\/polymer composites LEDs have been studied.\nThe structure used for this purpose has been described in detail elsewhere.[3,11] Briefly, a composite multilayer made of a\ndielectric polymer (poly-diallyl-dimethyl-ammonium, PDDA) and CdTe nanoparticles was sandwiched between an\naluminum cathode and an ITO anode. The multilayer was deposited through a layer-by-layer process carried out in air. The\nthicknesses of the different materials are 35nm, 220nm and 130nm for aluminum, multilayer and ITO, respectively. Each\nsubstrate had up to 6 identical independently addressable devices with an active area of 4 mm2 (Fig. 1). Four such devices\nwere biased at 4.0V for 15s, two under moderate vacuum (10-5 mbar), and another two in air.\nThe electric field was approximately 1.8×107 V\/m and measured currents were in all cases below 1μA (25μA\/cm2), and\ndropping 80-100% over the measurement period. Compositional depth profiles were acquired by secondary ion mass\nspectrometry (SIMS). The species examined were Al27+, In115+, and O16ˉ. The composition profiles were taken in both\nactive and passive areas. Active areas were those in which cathode and anode cross, and across which the field is applied,\nnoted as A1 in Fig. 1. Passive areas were those areas which did not receive any applied field. Two different types of passive\nareas were studied: aluminum plus multilayer, noted as P1 in Fig. 1, and multilayer plus ITO, noted as P2 in Fig 1.\nInvestigation of the passive areas P1 and P2 gives information equivalent to a non-biased active area A1. However, there is\nan advantage in that the aluminum and ITO distributions that can be studied independently.\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n3.0\n3.5\n4.0\n0 20 40 60 80 100 120 140\nDepth (a.u.)\nC\no\nu\nn\nts\n(x\n10\n5 )\nAl27 (A1)\nAl27 (P1)\nAl cathode Multilayer ITO anode\nSurface oxide\nInterfacial oxide\nFigure 2. Aluminum depth profiles from areas A1 (circles) and P1 (line). The\ndiscontinuous vertical lines mark the interfaces between the electrodes and\nthe multilayer. The location of these interfaces is an indication only, derived\nfrom AFM and WLI measurements. Although the aluminum has been\nnegatively biased, it can be seen that there is a significant diffusion of\naluminum into the composite in area A1. This diffusion is caused by the\nstrong applied field. Electromigration is ruled out due to the low current\ndensities measured during the biasing of the devices.\nA1\nP1\nP2\nAluminum\nComposite\nITO\nGlass\nSIMS\nFigure 1. The device structure consists in a multilayer of PDDA\/CdTe\nsandwiched between an aluminum anode and an ITO cathode. Device\ncurrents were 25μA\/cm2 (maximum), with an applied bias of 4V (or 107\nV\/m). The areas analyzed with SIMS are marked with black squares. The\ndevice’s active area is that where cathode and anode cross (A1). Two\ndifferent types of passive areas are studied: aluminum plus multilayer (P1),\nand multilayer plus ITO (P2).\nDepth calibration was done by measuring the depth of the SIMS trenches by AFM (contact mode) and white light\ninterferometry. It is important to note that due to the chemical complexity of the structure, no milling rates could be\ncalculated accurately.[12] Consequently, depth information in figures 2 to 5 is only approximate and serves only to give an\nidea of the relative position of the different layers. There was no substantial difference between devices biased in air and in\nmoderate vacuum. All the devices presented qualitatively the same features and properties. Therefore, for simplicity of\ndescription, the results presented here will correspond to the A1, P1 and P2 areas from a single device, but the discussion is\nappropriate to the other three devices on the substrate.\nThe aluminum depth profiles for both A1 and P1 areas are shown in fig. 2. The vertical discontinuous lines are added to\nindicate the position of the organic\/inorganic composite. Both A1 and P1 areas showed an aluminum peak near the top\nsurface of the sample. This peak is associated with the passivation oxide film that forms on aluminum when exposed to the\nair. After this feature the intensity stabilized, with little variation between the readings from active and passive areas. It is\nreasonable to link this region to the “bulk” of the cathode film. After a small peak at the interface between the cathode and\nthe organic multilayer, the aluminum intensity falls sharply in the passive area, and remained practically zero for the rest of\nthe analysis. The small peak can be related to a thin interfacial alumina layer formed during the deposition of the cathode.\nHowever, in the active area the aluminum intensity not only did not fall at the interface with the multilayer, but it presented\na wide peak with a tail extending across all the composite film. This tail is attributed to the diffusion of aluminum atoms\nduring the biasing of the device. The possible influence of the formation of pinholes during cathode deposition on the\naluminum distribution within the organic layer was discarded due to the sharp aluminum edge in the depth profile shown\nby the adjacent P1 area (see Fig. 1). At this point it is useful to remember that the variation in composition with depth into\nthe sample results in different milling rates. This is known as matrix effect.[12] Thus, the interfacial peak in the active areas\nafter the cathode\/multilayer interface must not be interpreted in terms of an aluminum abundance higher than in the bulk of\nthe electrode, but as a change in the chemical nature of the materials present at that depth.[13]\nFigure 3 shows the oxygen profiles of the same A1 and P1 areas of Figure 2. Both profiles showed a first peak at the\nsurface in contact with air, indicating the presence of surface oxide, as described before for aluminum. Both intensities then\ndecayed smoothly with the depth into the cathode, showing similar intensities for both active and passive areas. As with\naluminum, the differences between active and passive areas start at the cathode\/multilayer interface. The active area\npresented a clear second peak in oxygen just after the interface; that peak was also present in the passive area P1, but its\nassociated readings were around 85% lower than in the active area. The agreement in the data collected from the different\ndevices indicates a homogeneous composition for active and passive areas before any of the devices were biased. Therefore,\nthe second peak in A1 had evolved while the device was biased. The evolution of this peak is associated with a change in\nchemical environment for the aluminum, indicating the presence of incorporated oxygen. The extra oxygen in area A1 is\nrelated to the oxidation of the diffused aluminum, which was absorbed from the environment surrounding the device (at 10-\n0.0\n0.5\n1.0\n1.5\n2.0\n2.5\n0 20 40 60 80 100 120 140\nDepth (a.u.)\nC\no\nu\nn\nts\n(x\n10\n5 )\nO16 (A1)\nO16 (P1)\nAl cathode Multilayer ITO anode\nSurface oxide\nInterfacial oxide\nFigure 3. Oxygen depth profiles from the same A1 and P1 areas as in figure\n2. The peak beginning at the cathode\/multilayer interface is substantially\nhigher in the active area, denoting an extra content of oxygen at this region.\nThis extra oxygen is associated with the oxidation of the diffused aluminum.\nThe oxygen peak in A1 near the interface with the anode is due to the\ndiffusion of oxygen from the ITO (connected with the In as shown further\nbelow).\n5 mbar there would be enough oxygen present to oxidize the aluminum). This diffusion of environmental oxygen into\npolymeric layers during device operations has been already reported in other structures.[7,8] The active area also presented\na third oxygen peak deeper into the organic layer that is absent from the profile of the P1 area, but it is present in the P2\narea (Fig. 5). This is associated with the ITO anode (Figures. 4 and 5).\nThe indium’s depth profile corresponding to the active area is shown in figure 4 together with, for reference, that of oxygen.\nIt can be seen that substantial indium contamination is found in the organic multilayer. The indium penetration depth\n(corresponding to an indium count lower than 1% of the peak value) is approximately equivalent to 65% of the multilayer\nthickness. The shape of the indium profile matches the third peak of oxygen, suggesting that this oxygen is associated with\nthe diffused indium in the form of indium oxide. Figure 5 shows the indium and oxygen profiles for a P2 area. Indium\ndiffusion into the organic multilayer can also be observed in this area, with a penetration of 40% in thickness into the\nmultilayer. Indium diffusion is therefore present even in areas in which a field has not been applied. The indium penetration\nis carried further into the composite by an additional 25% with the application of an electric field.\nThe indium diffusion found in the present work has been discussed already in the OLED-related literature. Hirose et\nal.[14,15] reported the spontaneous diffusion of reactive metals like indium and aluminum deposited on top of an organic\nlayer. Schlatmann et al.[16] studied the diffusion of underlying indium into organic layers in OLEDs prior to device\noperation, whereas Gautier et al.[10] reported the diffusion of indium during operation. Chao et al.[17] explained the field\ninduced diffusion as a consequence of the decomposition of the ITO.\nThe case of the aluminum diffusion towards the anode requires a different explanation. The measured currents were too\nlow to produce substantial electromigration[18] or thermal diffusion. Studies of ionic drift of metal into organic layers have\ndemonstrated that aluminum can penetrate deep into organic layers.[15,19-21] However, these studies are based in metal\ngates biased positively, whereas in this work the aluminum is negatively biased and diffuses towards the anode. Also, the\ndiffusion of metallic aluminum across the multilayer should induce an increase in current due to the enhanced field. In the\npresent study, the current did not increase but fell substantially. Consequently, it seems that the diffused aluminum is\nalready oxidized or oxidizes very quickly. The mechanism proposed here is based on the explanation given by Mott[22] for\nthe growth of the passivation layer in aluminum. Mott explained that an electron transfer to adsorbed oxygen atoms creates\nan electric field that forces an ionic current across the thin oxide layer. These ions then get oxidized and thicken the oxide\nlayer, until a point in which electrons cannot tunnel over the thickness of the oxide. In the presence of a strong applied\nelectric field, as is the case of the samples presented here, electrons can tunnel over thicker layers of oxide, allowing a\nfurther growth of the oxide. The growth of a thicker aluminum oxide at the cathode\/multilayer interface explains the loss of\nconductivity noticed in the device. The gradual decay of aluminum intensity within the composite suggests that the diffused\noxide consists of dendritic filaments, rather than maintaining a flat interface. The dendrites might originate from locally\nfield-enhanced areas and penetrate the organic multilayer at weak structural points. These are likely to be located within the\npolymer, as the nanoparticles are comparatively tougher due to their solid crystalline structure.\n0.0\n5.0\n10.0\n15.0\n20.0\n25.0\n0 20 40 60 80 100 120 140\nDepth (a.u.)\nC\no\nu\nn\nts\n(x\n10\n5 )\nIn115 (A1) ×40\nO16 (A1)\nAl cathode Multilayer ITO\nFigure 4. Indium and oxygen depth profiles from area A1. The indium has\ndiffused for more than 65% of the multilayer thickness. The oxygen peak\nnear the anode matches the indium profile at that depth, indicating that both\nelements are associated.\nIt is important to remark that, despite of the presence of the nanoparticles within the polymer, no specific role is played by\nthem in relation with the diffusion process. Their only influence might be reduced to an effect in the SIMS milling rates\nthrough the composite. Thus, the results shown here might be applicable to other structures built with polymers and\nsubjected to high operational fields, like thin-film OLEDs and other opto-electronic devices.\nTherefore, it is concluded that diffusion of metallic ions from the electrodes is a mechanism involved in the degradation of\ndevices built with organic layers or composites. The diffusion of indium had already been identified as a cause of defects\nthat lead to device degradation.[16,17] A cathode diffusion mechanism due exclusively to the applied field has been found,\nwhich can induce structural defects even at low-current regimes. Field-driven aluminum diffusion and oxidation has been\nshown to produce an insulating barrier that reduces the conductivity of the device, causing irreversible device failure.\nSuitable cathodic diffusion barriers compatible with electron injection might result in an improvement of device lifetime\nand performance, both in OLED and hybrid technologies.\nExperimental\nSubstrates were made of ITO-coated glass from Merk (125nm, 13Ω\/□), patterned into stripes with HCl. CdTe nanocrystals\nin aqueous solution (1mg\/ml) were deposited through a layer-by-layer technique. The PDDA water solution concentration\nwas 10mM, 0.2M ionic. The final multilayer presented a CdTe volume fraction of 25-30%. Aluminum cathodes were\nevaporated on top of the multilayer at P<4×10-6mbar, with resultant resistivity between 1.58×10-4 Ω-cm and 1.19×10-5 Ω-\ncm.\nDepth profiles were acquired with a quadrupole-based SIMS, 6500 from Atomika, equipped with a nitrogen gun. The\nprimary ion beam (floating ion gun FLIG5 from Ionoptika) was set at 1.25 kV (N2), with normal incidence on the sample,\nand a current of 120nA. Depth calibration was done with a Veeco Dimension 3000 AFM in contact mode and a Talysurf\nCCI 6000 white light interferometer from Taylor and Hobson.\nAcknowledgements:\nWe would like to thank Mr Richard J. Chater, from Imperial College in London, for his assistance with SIMS analyses.\nReferences\n0.0\n2.0\n4.0\n6.0\n8.0\n10.0\n12.0\n14.0\n16.0\n18.0\n20.0\n0 20 40 60 80 100 120 140\nDepth (a.u.)\nC\no\nu\nn\nts\n(x\n10\n5 )\nIn115 (P2) ×20\nO16 (P2)\nAl cathode Multilayer ITO\nFigure 5. Indium and oxygen depth profiles from area P2. Indium diffusion is\npresent even in areas to which no field has been applied. The indium\npenetration depth is around 40% of the multilayer thickness, some 25% less\nthan in active areas.\n[1] S. Coe, W.K. Woo, M. Bawendi and V. Bulovic, Nature, 2002, 420, 800-803.\n[2] Personal communication, Prof M.C. Petty, Durham University.\n[3] C. Bertoni, D. Gallardo, S. Dunn, N. Gaponik and A. Eychmüller, Appl. Phys. Lett., 2007, 90, 034107.\n[4] S.V. Gaponenko (1998), in Optical properties of semiconductor nanocrystals, (Eds: S.V. Gaponenko), Cambridge\nUniversity Press, Cambridge, UK, 1998, 27-54.\n[5] C.A. Leatherdale, C.R. Kagan, N.Y. Morgan, S.A. Empedocles, M.A. Kastner and M.G. Bawendi, Phys. Rev. B, 2000,\n62, 2669-2680.\n[6] N.Y. Morgan, C.A. Leatherdale, M. Drndic, M.V. Jarosz, M.A. Kastner and M. Bawendi, Phys. Rev. B, 2002, 66,\n075339-1-9.\n[7] M. Gao, B. Richter, S. Kirstein and H. Mohwald, J. Phys. Chem., 1998, 102, 4096-4103.\n[8] B.H. Cumpston , I.D. Parker and K.F. Jensen, J. Appl. Phys., 1997, 81, 3716-3720.\n[9] B.H. Cumpston and K.F. Jensen, Appl. Phys. Lett., 1996, 69, 3941-3943.\n[10] E. Gautier, A. Lorin, J.M. Nunzi, A. Schalchli, J.J. Benattar and D. Vital, Appl. Phys. Lett., 1996, 69, 1071-1073.\n[11] D.E. Gallardo, C. Bertoni and S.C. Dunn, Proc. of SPIE, 2005, 5840, 516-522.\n[12] A.W. Czanderna (1991), in Ion spectroscopies for surface analysis, (Eds: A.W. Czanderna and D.M. Hercules),\nPlenum Press, New York, 1991, 25.\n[13] E. Cuynen, P. Van Espen, G. Goeminne and H. Terryn, J. Anal. At. Spectrom., 1999, 14, 483-486.\n[14] Y. Hirose, A. Kahn, V. Aristov, P. Soukiassian, V. Bulovic and S.R. Forrest, Phys. Rev. B, 1996, 54, 13748-13758.\n[15] Y. Hirose, A. Kahn, V. Aristov and P. Soukiassian, Appl. Phys. Lett., 1996, 68, 217-219.\n[16] A.R. Schlatmann, D.W. Floet, A. Hilberer, F. Garten, P.J.M. Smuldars, T.M. Klapwijk and G. Hadziioannou, Appl.\nPhys. Lett., 1996, 69, 1764-1766.\n[17] C.I. Chao, K.R. Chuang and S.A. Chen, Appl. Phys. Lett., 1996, 69, 2894-2896.\n[18] I.A. Blech and E. Kinsbron, Thin Solid Films, 1975, 25, 327-334.\n[19] A.L.S. Loke , J.T. Wetzel, P.H. Townsend, T. Tanabe, R.N. Vrtis, M.P. Zussman, D. Kumar, C. Ryu and S.S. Wong,\nIEEE T Electron Dev., 1999, 46, 2178-2187.\n[20] A. Mallikarjunan, S.P. Murarka and T.-M. Lu, Appl. Phys. Lett., 2001, 79, 1855-1857.\n[21] K.-L. Fang and B.-Y. Tsui, J. Appl. Phys., 2003, 93, 5546-5550.\n[22] N.F. Mott, Trans. Faraday Soc., 1947, 429-434.\n"}