{"doi":"10.1136\/bmj.a2079","coreId":"210800","oai":"oai:eprints.lse.ac.uk:22495","identifiers":["oai:eprints.lse.ac.uk:22495","10.1136\/bmj.a2079"],"title":"Recruitment to multicentre trials — lessons from UKCTOCS: descriptive study","authors":["Menon, Usha","Gentry-Maharaj, Aleksandra","Ryan, Andy","Sharma, Aarti","Burnell, Matthew","Hallett, Rachel","Lewis, Sara","Lopez, Alberto","Godfrey, Keith","Oram, David","Herod, Jonathan","Williamson, Karin","Seif, Mourad","Scott, Ian","Mould, Tim","Woolas, Robert","Murdoch, John","Dobbs, Stephen","Amso, Nazar","Leeson, Simon","Cruickshank, Derek","McGuire, Alistair","Campbell, Stewart","Fallowfield, Lesley","Skates, Steve","Parmar, Mahesh","Jacobs, Ian"],"enrichments":{"references":[{"id":17208608,"title":"16 ThomsonCA,HarrisRB,CraftNE,HakimIA.Across-sectionalanalysis demonstrated the healthy volunteer effect in smokers. JC l i n Epidemiol 2005;58:378-82. 17 Froom","authors":[],"date":null,"doi":null,"raw":"16 ThomsonCA,HarrisRB,CraftNE,HakimIA.Across-sectionalanalysis demonstrated the healthy volunteer effect in smokers. JC l i n Epidemiol 2005;58:378-82. 17 Froom P, Melamed S, Kristal-Boneh E, Benbassat J, Ribak J. Healthy volunteereffectinindustrialworkers.JClinEpidemiol1999;52:731-5. 18 Lindsted KD, Fraser GE, Steinkohl M, Beeson WL. Healthy volunteer effect in a cohort study: temporal resolution in the Adventist health study. JC l i nE p i d e m i o l1996;49:783-90.","cites":null},{"id":17208613,"title":"23 Office for National Statistics. Cancer statistics registrations: registrations of cancer diagnosed","authors":[],"date":null,"doi":null,"raw":"23 Office for National Statistics. Cancer statistics registrations: registrations of cancer diagnosed in 2004, England. Series MB1 35 2004;24.","cites":null},{"id":17208614,"title":"24 GrayM,PenningtonCR.Screeningsigmoidoscopy:arandomisedtrial of invitation style.","authors":[],"date":null,"doi":null,"raw":"24 GrayM,PenningtonCR.Screeningsigmoidoscopy:arandomisedtrial of invitation style. Health Bull (Edinb) 2000;58:137-40.","cites":null},{"id":17208618,"title":"29 AtkinWS,Edwards R,WardleJ,Northover JM, SuttonS,Hart AR,et al. Design of a multicentre randomised trial to evaluate flexible sigmoidoscopy in colorectal cancer screening.","authors":[],"date":null,"doi":null,"raw":"29 AtkinWS,Edwards R,WardleJ,Northover JM, SuttonS,Hart AR,et al. Design of a multicentre randomised trial to evaluate flexible sigmoidoscopy in colorectal cancer screening. JM e dS c r e e n 2001;8:137-44.","cites":null},{"id":17208599,"title":"6 JacobsI,DaviesAP,BridgesJ,StabileI,FayT,LowerA,etal.Prevalence screening for ovarian cancer in postmenopausal women by CA 125 measurement and ultrasonography.","authors":[],"date":null,"doi":null,"raw":"6 JacobsI,DaviesAP,BridgesJ,StabileI,FayT,LowerA,etal.Prevalence screening for ovarian cancer in postmenopausal women by CA 125 measurement and ultrasonography. BMJ 1993;306:1030-4.","cites":null},{"id":17208612,"title":"A t k i nW S ,H a r tA ,E d w a r d sR ,M c I n t y r eP ,A u b r e yR ,W a r d l eJ ,e ta l . Uptake, yield of neoplasia, and adverse effects of flexible sigmoidoscopy screening.","authors":[],"date":"1998","doi":null,"raw":"2 2 A t k i nW S ,H a r tA ,E d w a r d sR ,M c I n t y r eP ,A u b r e yR ,W a r d l eJ ,e ta l . Uptake, yield of neoplasia, and adverse effects of flexible sigmoidoscopy screening. Gut 1998;42:560-5.","cites":null},{"id":17208622,"title":"Accepted: 5S e p t e m b e","authors":[],"date":"2009","doi":null,"raw":"32 OfficeforNationalStatisticsH.Census2001:populationdata,2001. www.statistics.gov.uk\/populationestimates\/svg_pyramid\/default. htm. Accepted: 5S e p t e m b e r2 0 0 8 RESEARCH BMJ | ONLINE FIRST | bmj.com page 7 of 7 on 4 February 2009  bmj.com Downloaded from","cites":null},{"id":17208610,"title":"Challenges of recruitmentofbreastcancersurvivorstoarandomizedclinicaltrialfor osteoporosis prevention. Cancer Nurs 2006;29:21-31,","authors":[],"date":null,"doi":"10.1097\/00002820-200601000-00004","raw":"20 Ott CD, Twiss JJ, Waltman NL, Gross GJ, Lindsey AM. Challenges of recruitmentofbreastcancersurvivorstoarandomizedclinicaltrialfor osteoporosis prevention. Cancer Nurs 2006;29:21-31, quiz 32-3.","cites":null},{"id":17208621,"title":"Could an open-source clinical trial datamanagementsystembewhatwehaveallbeenlookingfor?PLoSMed 2008;5(3):e6.","authors":[],"date":null,"doi":"10.1371\/journal.pmed.0050006","raw":"31 Fegan GW, Lang TA. Could an open-source clinical trial datamanagementsystembewhatwehaveallbeenlookingfor?PLoSMed 2008;5(3):e6.","cites":null},{"id":17208602,"title":"Decline in use of hormone therapy among postmenopausal w o m e ni nt h eU n i t e dK i n g d o m .Menopause","authors":[],"date":"2007","doi":"10.1097\/01.gme.0000243569.70946.9d","raw":"10 Menon U, Burnell M, Sharma A, Gentry-Maharaj A, Fraser L, Ryan A, et al. Decline in use of hormone therapy among postmenopausal w o m e ni nt h eU n i t e dK i n g d o m .Menopause 2007;14:462-7.","cites":null},{"id":17208606,"title":"Design of the prostate, lung, colorectal and ovarian (PLCO) cancer screening trial.","authors":[],"date":null,"doi":"10.1016\/s0197-2456(00)00098-2","raw":"14 Prorok PC, Andriole GL, Bresalier RS, Buys SS, Chia D, Crawford ED, et al. Design of the prostate, lung, colorectal and ovarian (PLCO) cancer screening trial. Control Clin Trials 2000;21(6 suppl):273-309S.","cites":null},{"id":17208597,"title":"Efficient management of randomised controlled trials: nature or nurture.","authors":[],"date":null,"doi":"10.1136\/bmj.317.7167.1236","raw":"3 Farrell B. Efficient management of randomised controlled trials: nature or nurture. BMJ 1998;317:1236-9.","cites":null},{"id":17208609,"title":"et al.A comparisonofnationalcancer registryand direct follow-upin the ascertainment of ovarian cancer.","authors":[],"date":"1999","doi":null,"raw":"19 MacDonald N, Sibley K, Rosenthal A, Menon U, Jayarajah A, Oram D, et al.A comparisonofnationalcancer registryand direct follow-upin the ascertainment of ovarian cancer. Br J Cancer 1999;80:1826-7.","cites":null},{"id":17208605,"title":"etal.Massmailingandstaffexperienceinatotalrecruitmentprogram for a clinical trial: the SHEP experience. Control Clin Trials","authors":[],"date":"1999","doi":"10.1016\/s0197-2456(98)00055-5","raw":"13 Cosgrove N, Borhani NO, Bailey G, Borhani P, Levin J, Hoffmeier M, etal.Massmailingandstaffexperienceinatotalrecruitmentprogram for a clinical trial: the SHEP experience. Control Clin Trials 1999;20:133-48.","cites":null},{"id":17208596,"title":"Factors that limit the quality, number and progress of randomised controlled trials. Health Technol Assess","authors":[],"date":"1999","doi":"10.4135\/9781848608344.n3","raw":"2 Prescott RJ, Counsell CE, Grant AM, Russell IT, Kiauka S, Colthart IR, et al. Factors that limit the quality, number and progress of randomised controlled trials. Health Technol Assess 1999;3(20):65-70.","cites":null},{"id":17208604,"title":"Flexible Sigmoidoscopy Screening Trial Investigators. Single flexible sigmoidoscopy screening to prevent colorectal cancer: baseline findings of a UK multicentre randomised trial.","authors":[],"date":null,"doi":"10.1016\/s0140-6736(02)08268-5","raw":"12 UK Flexible Sigmoidoscopy Screening Trial Investigators. Single flexible sigmoidoscopy screening to prevent colorectal cancer: baseline findings of a UK multicentre randomised trial. Lancet 2002;359:1291-300.","cites":null},{"id":17208620,"title":"H a s s o nM A ,F a g e r s t r o mR M ,K a h a n eD C ,W a l s hJ","authors":[],"date":null,"doi":null,"raw":"3 0 H a s s o nM A ,F a g e r s t r o mR M ,K a h a n eD C ,W a l s hJ H ,M y e r sM H , Caughman C, et al. Design and evolution of the data management systems in the prostate, lung, colorectal and ovarian (PLCO) cancer screening trial. Control Clin Trials 2000;21(6 suppl):329-48S.","cites":null},{"id":17208593,"title":"in randomised controlled trials involving screening and prevention, havingtoinvitelargenumbersofpotentialparticipants is an additional challenge. 4 In","authors":[],"date":"2000","doi":null,"raw":"3 Furthermore, in randomised controlled trials involving screening and prevention, havingtoinvitelargenumbersofpotentialparticipants is an additional challenge. 4 In 2000 expertise accumulated over a decade of planning and running ovarian cancer screening trials was used to design and set up the UK Collaborative TrialofOvarianCancerScreening(UKCTOCS;www. ukctocs.org.uk).","cites":null},{"id":17208603,"title":"M o s sS M ,C u c k l eH ,E v a n sA ,J o h n sL ,W a l l e rM ,B o b r o wL .E f f e c to f mammographic screening from age 40 years on breast cancer mortalityat10years’follow-up:arandomisedcontrolledtrial.Lancet 2006;368:2053-60.","authors":[],"date":null,"doi":null,"raw":"1 1 M o s sS M ,C u c k l eH ,E v a n sA ,J o h n sL ,W a l l e rM ,B o b r o wL .E f f e c to f mammographic screening from age 40 years on breast cancer mortalityat10years’follow-up:arandomisedcontrolledtrial.Lancet 2006;368:2053-60.","cites":null},{"id":17208598,"title":"Multimodal approach to screening for ovarian cancer.","authors":[],"date":null,"doi":"10.1016\/s0140-6736(88)90351-0","raw":"5 Jacobs I, Stabile I, Bridges J, Kemsley P, Reynolds C, Grudzinskas J, et al. Multimodal approach to screening for ovarian cancer. Lancet 1988;i:268-71.","cites":null},{"id":17208601,"title":"Prospectivestudyusingtheriskofovariancanceralgorithmtoscreen for ovarian cancer.","authors":[],"date":null,"doi":null,"raw":"9 Menon U, Skates SJ, Lewis S, Rosenthal AN, Rufford B, Sibley K, et al. Prospectivestudyusingtheriskofovariancanceralgorithmtoscreen for ovarian cancer. J Clin Oncol 2005;23:7919-26.","cites":null},{"id":17208611,"title":"Recruitment and accrual of women in a randomized controlled trial of spinal manipulation.","authors":[],"date":null,"doi":"10.1067\/mmt.2001.112567","raw":"21 Cambron JA. Recruitment and accrual of women in a randomized controlled trial of spinal manipulation. J Manipulative Physiol Ther 2001;24:79-83.","cites":null},{"id":17208594,"title":"Research Council Clinical Trials Unit, London NW1 2DA Correspondence to: U Menon u.menon@ucl.ac.uk Cite this as:","authors":[],"date":null,"doi":null,"raw":"18Harvard Medical School, Boston, MA 02115, USA 19Medical Research Council Clinical Trials Unit, London NW1 2DA Correspondence to: U Menon u.menon@ucl.ac.uk Cite this as: BMJ 2008;337:a2079 RESEARCH page 2 of 7 BMJ | ONLINE FIRST | bmj.com on 4 February 2009  bmj.com Downloaded from Invitation We sent information about the trial to all general practitioners working in participating primary care trusts, after electronic upload of their details into the trialmanagementsystem.Werequestedelectronicfiles containing details of 2000 to 10000 women on a regular (usually three monthly) basis from each of the participating primary care trusts for upload. We then sent women personal invitations and loggedreplies on the trial management system (fig 2). The patient support groups OVACOME and Cancer BACUP vetted the information for patients, and invitation letters contained their contact details. In the course of the trial, we revised and simplified the invitation. Recruitment and randomisation We set the weekly recruitment target at 100 women per trialcentre.Wesetupindividualprofilescomprisingfive recruitment clinics a week on the trial management systemforeachtrialcentre.Theseconsistedof45minute appointments involving groups of four women. Once acceptance was logged, women were automatically scheduled into the appointment slots at the centre and sent letters. The web browser enabled immediate logging of clinic attendance as well as rescheduling of appointments by both local and coordinating centre staff. At recruitment, women viewed an information video and participated in a group discussion. This was immediately followed by a one to one discussion in a separate room with the research nurse, when women were given the opportunity to discuss any private concernsbeforesigningconsent.Thenursealsochecked their completed datasheet. These documents were sent weekly to the coordinating centre, where the trial managementsystemautomaticallyconfirmedeligibility, didrandomisation,scheduledappropriateappointments to women allocated to screening, and printed letters to the patient and her general practitioner (fig 2). We sent requests for more information to women with incomp l e t ed a t aa n dp l a c e d“on hold” those whose last menstrual period was less than 12 months from date of recruitment.Thetrialmanagementsystemalsoclassifies screening results (ultrasound findings and CA 125 concentrations)enteredoverthewebbrowser,schedules appropriate follow-up appointments, and prints all letters to individual women. It allows electronic exchange of information with the CA 125 analyser in thelaboratoryandwiththeOfficeforNationalStatistics. Weloggedandmonitoredallcomplaintscentrally.A designated person at the coordinating centre wrote to each woman directly after investigating the problems raised.We exploredall suggestions bythe women and amendedtriallogisticswhenappropriateandpossible. RESULTS Between April 2001 and February 2003 we set up the trial in 13 NHS trusts(trial centres) in England, Wales, and Northern Ireland (table). A variety of logistical reasons (lack of space, retirement of potential research leads, unwillingness of trusts’ management to commit to a 10 year trial, involvement in other ovarian cancer screening trials) prevented pre-identified Scottish centres from participating. Overall, 27 primary care trusts (including local health boards in Wales) with 3266 general practices were involved. Of these, 22 (81.5%) primary care trusts provided contact details of the women, and we sent invitations as outlined above. Five (18.5%) primary care trusts (those adjoining the centres at Liverpool, Belfast, and initially Gateshead) refusedaccesstothecontactdetails.Forthesetrusts,we negotiated an alternative method using “unlinked” invitations. This involved sending the standard invitation letter without a recipient’s name to the primary care trust in sealed franked envelopes. Trust staff then attached address labels and forwarded the letters. Women who wished to participate wrote to the coordinating centre with their contact details (fig 2). We modified trial processes and the trial management system to allow manual entry of these data. Invitation We closely monitored acceptance rates from the start and therefore noted within the first six months that recruitment was below target. We rapidly introduced Invitation (B) Invitation letter with no name together with datasheet for entry of personal details sent in sealed franked envelopes to local HA Invitation Personal invitations printed and posted from coordinating centre (A) File with personal information of women provided by local health authority (HA) uploaded on to TMS TMS schedules appointment at recruitment clinic at appropriate centre and prints letters, which are sent out from coordinating centre Consent logged and recruitment datasheet scanned into TMS Recruitment visit Seven minute information video Group discussion facilitated by research nurse Completion of datasheet Five minute interview with research nurse when baseline datasheet checked and consent signed Blood sample (transported overnight to central laboratory) Replies logged on TMS Randomisation by TMS Control group No screening Multimodal group Screening with serum CA125 Ultrasound group Screening with transvaginal scan Address labels pasted by local HA staff and posted Replies with personal details entered into TMS Eligibility confirmed Incomplete datasheet or ineligible Women placed “on hold” and letters sent for clarification Weekly transfer of documents to coordinating centre Fig 2 | Invitation, recruitment, and randomisation. (A)=recruitment in which primary care trusts (PCTs) were allowed access to contact details of women; (B)=recruitment in which PCTs did not allow access to contact details of women; TMS=trial management system RESEARCH BMJ | ONLINE FIRST | bmj.com page 3 of 7 on 4 February 2009  bmj.com Downloaded from measures(listedbelow) toimprove ratesofacceptance of the invitation. Overall, invitations were sent to 1243282 women, 1079485 directly by the coordinating centre and 163797 by the primary care trusts adjoiningthecentresatLiverpool,Belfast,andinitially Gateshead; 288955 (23.2%) women replied that they would like to participate in the trial and were eligible. The overall acceptance rate varied between centres from 19% in East London to 33% in Bristol (table). Recruitment and randomisation Between April 2001 and September 2005 205090 women (73.6% of those who were sent appointments) attended for recruitment, and we finally randomised 202638 women (fig 3). The number of women randomised each month ranged from 117 to 5773 (median 3955) 10; the median time from recruitment to randomisationwas12.3days(25thto75thcentile8.5to 15.5 days). Afurther10192womenwhoacceptedtheinvitation were not sent appointments as the recruitment target wasachieved.Withethicscommitteeapproval,wesent alettertothankeachwomanforherinterestinthetrial andapologiseforourinabilitytoofferheraplaceasthe target recruitment had been reached. Overallrecruitmentwas96%(range87-114%)ofthe weeklytargetof100women.Fivecentresexceededthe weekly target (table). The centres using “unlinked invitations” had some of the lowest recruitment rates. The box details the measures we adopted to ensure target recruitment. Ninety eight (0.008%) invited women complained about recruitment related problems: invitation to trial (32), trial information (28), recruitment appointment (17), and randomisation to control group (21). DISCUSSION Our experience highlights the importance of meticulous planning and management of trial processes. These are as crucial to success as trial design and require equal attention from senior investigators. We quicklylearntthatthekeytosuccessfulrecruitmentwas constantmonitoringbyadedicatedmanagementteam, capable of delivering flexible and rapid solutions as problems arose.Centralisationand automation of trial processes with web based trial management systems werecrucial.Informationvideosandgroupdiscussions facilitated recruitment and helped to maintain quality. TherevisionoftheUKCTOCSinvitationprocedure provides an example of the flexibility needed in running trials. Although most (81.5%) local health authority data controllers allowed access to women’s contact details under the research exemption clause of the Data Protection Act 1998 (www.informationcom missioner.gov.uk), 18.5% (n=5) refused permission. We found a compromise to accommodate their concerns and revised the entire invitation process, includingfunctionalityofthetrialmanagementsystem and the job description of administrative staff at the coordinatingcentre.Excludingthesehealthauthorities would have required suspension of the trial in the adjoining centres, with a major impact on recruitment rates, time, and resources. Strengths and weaknesses We invited women from participating local health authorities’registers.Thisisan approachoftenusedin the United Kingdom. 1112 Other databases in use include electoral rolls, driving licence records, and commercially available directories. 13 The alternative strategy is to advertise the trial extensively and let participants self refer. 14 Recently, this has involved Google adverts and links to studies on a variety of websites. 15 Women who volunteer to participate in research are often more educated and informed than the general population. 16-18 Hence, invitation using health authority lists or electoral rolls is thought to result in participants who are more representative of the general population than those who self refer through adverts. Use of health authority lists provides additionallogisticaladvantages.Recruitmentratescan be controlled by varying the volume and frequency of mailing invitations, and electronic data transfer from health authority files leads to decreased data entry and improved accuracy. This is particularly notable with regard to NHS numbers, which are essential for cost effective follow-up of women through the UK Office for National Statistics. In a previous trial, in which women self referred, most women did not provide an NHS number.","cites":null},{"id":17208600,"title":"Risk of diagnosis of ovarian cancer after raised serum CA 125 concentration: a prospective cohort study.","authors":[],"date":null,"doi":null,"raw":"7 JacobsIJ,SkatesS,DaviesAP,WoolasRP,JeyerajahA,WeidemannP, et al. Risk of diagnosis of ovarian cancer after raised serum CA 125 concentration: a prospective cohort study. BMJ 1996;313:1355-8.","cites":null},{"id":17208616,"title":"Seminars may increase recruitment to randomised controlled trials: lessons learned from WISDOM. Trials 2008;9:5. 26 Denhaerynck","authors":[],"date":null,"doi":"10.1186\/1745-6215-9-5","raw":"25 Paine BJ, Stocks NP, Maclennan AH. Seminars may increase recruitment to randomised controlled trials: lessons learned from WISDOM. Trials 2008;9:5. 26 Denhaerynck K, Lesaffre E, Baele J, Cortebeeck K, Van Overstraete E, BuntinxF.Mammographyscreeningattendance:meta-analysisofthe effect of direct-contact invitation. A mJP r e vM e d2003;25:195-203. 27 Parkes CA, Smith D, Wald NJ, Bourne TH. Feasibility study of a randomised trial of ovarian cancer screening among the general population. JM e dS c r e e n1994;1:209-14.","cites":null},{"id":17208607,"title":"Successful participant recruitment strategies for an online smokeless tobacco cessation program.","authors":[],"date":null,"doi":"10.1080\/14622200601039014","raw":"15 Gordon JS, Akers L, Severson HH, Danaher BG, Boles SM. Successful participant recruitment strategies for an online smokeless tobacco cessation program. Nicotine Tob Res 2006;8(suppl 1):S35-41.","cites":null},{"id":17208592,"title":"Trial registration Current Controlled Trials ISRCTN22488978. INTRODUCTION Randomised controlled trials are widely accepted as the standard for evaluating healthcare interventions. However, only 31% of multicentre randomised controlled trials funded by the","authors":[],"date":"2002","doi":null,"raw":"Trial registration Current Controlled Trials ISRCTN22488978. INTRODUCTION Randomised controlled trials are widely accepted as the standard for evaluating healthcare interventions. However, only 31% of multicentre randomised controlled trials funded by the UK Medical Research Council and the NHS Health Technology Assessment Programme that were recruiting between 1994 and 2002 achieved their original recruitment target.","cites":null},{"id":17208595,"title":"What influences recruitment to randomised controlled trials? A review of trials funded by two UK funding agencies. Trials","authors":[],"date":"2006","doi":null,"raw":"1 McDonald AM, Knight RC, Campbell MK, Entwistle VA, Grant AM, Cook JA, et al. What influences recruitment to randomised controlled trials? A review of trials funded by two UK funding agencies. Trials 2006;7:9.","cites":null}],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2008-11-13","abstract":"Objective To describe the factors that contributed to successful recruitment of more than 200 000 women to the UK Collaborative Trial of Ovarian Cancer Screening, one of the largest ever randomised controlled trials. Design Descriptive study. Setting 13 NHS trusts in England, Wales, and Northern Ireland. Participants Postmenopausal women aged 50-74; exclusion criteria included ovarian malignancy, bilateral oophorectomy, increased risk of familial ovarian cancer, active non-ovarian malignancy, and participation in other ovarian cancer screening trials. Main outcome measures Achievement of target recruitment, acceptance rates of invitation, and recruitment rates. Results The trial was set up in 13 centres with 27 adjoining local health authorities. The coordinating centre team was led by one of the senior investigators, who was closely involved in planning and day to day trial management. Of 1 243 282 women invited, 23.2% (288 955) replied that they were eligible and would like to participate. Of those sent appointments, 73.6% (205 090) attended for recruitment. The acceptance rate varied from 19% to 33% between trial centres. Measures to ensure target recruitment included named coordinating centre staff supporting and monitoring each centre, prompt identification and resolution of logistic problems, varying the volume of invitations by centre, using local nonattendance rates to determine the size of recruitment clinics, and organising large ad hoc clinics supported by coordinating centre staff. The trial randomised 202 638 women in 4.3 years. Conclusions Planning and trial management are as important as trial design and require equal attention from senior investigators. Successful recruitment needs constant monitoring by a committed proactive management team that is willing to explore individual solutions for different centres and use central resources to improve local recruitment. Automation of trial processes with web based trial management systems is crucial in large multicentre randomised controlled trials. Recruitment can be further enhanced by using information videos and group discussions","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/210800.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/22495\/1\/Recruitment_to_multicentre_trials%28published_version%29.pdf","pdfHashValue":"41c743b91c9a6234ae9493b6a92d209627eb7175","publisher":"BMJ Publishing Group Ltd.","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:22495<\/identifier><datestamp>\n      2010-10-01T09:20:38Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5341<\/setSpec><setSpec>\n      74797065733D43454E54524553:4C53455F52435F3839<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/22495\/<\/dc:relation><dc:title>\n        Recruitment to multicentre trials — lessons from UKCTOCS: descriptive study<\/dc:title><dc:creator>\n        Menon, Usha<\/dc:creator><dc:creator>\n        Gentry-Maharaj, Aleksandra<\/dc:creator><dc:creator>\n        Ryan, Andy<\/dc:creator><dc:creator>\n        Sharma, Aarti<\/dc:creator><dc:creator>\n        Burnell, Matthew<\/dc:creator><dc:creator>\n        Hallett, Rachel<\/dc:creator><dc:creator>\n        Lewis, Sara<\/dc:creator><dc:creator>\n        Lopez, Alberto<\/dc:creator><dc:creator>\n        Godfrey, Keith<\/dc:creator><dc:creator>\n        Oram, David<\/dc:creator><dc:creator>\n        Herod, Jonathan<\/dc:creator><dc:creator>\n        Williamson, Karin<\/dc:creator><dc:creator>\n        Seif, Mourad<\/dc:creator><dc:creator>\n        Scott, Ian<\/dc:creator><dc:creator>\n        Mould, Tim<\/dc:creator><dc:creator>\n        Woolas, Robert<\/dc:creator><dc:creator>\n        Murdoch, John<\/dc:creator><dc:creator>\n        Dobbs, Stephen<\/dc:creator><dc:creator>\n        Amso, Nazar<\/dc:creator><dc:creator>\n        Leeson, Simon<\/dc:creator><dc:creator>\n        Cruickshank, Derek<\/dc:creator><dc:creator>\n        McGuire, Alistair<\/dc:creator><dc:creator>\n        Campbell, Stewart<\/dc:creator><dc:creator>\n        Fallowfield, Lesley<\/dc:creator><dc:creator>\n        Skates, Steve<\/dc:creator><dc:creator>\n        Parmar, Mahesh<\/dc:creator><dc:creator>\n        Jacobs, Ian<\/dc:creator><dc:subject>\n        R Medicine (General)<\/dc:subject><dc:description>\n        Objective To describe the factors that contributed to successful recruitment of more than 200 000 women to the UK Collaborative Trial of Ovarian Cancer Screening, one of the largest ever randomised controlled trials. Design Descriptive study. Setting 13 NHS trusts in England, Wales, and Northern Ireland. Participants Postmenopausal women aged 50-74; exclusion criteria included ovarian malignancy, bilateral oophorectomy, increased risk of familial ovarian cancer, active non-ovarian malignancy, and participation in other ovarian cancer screening trials. Main outcome measures Achievement of target recruitment, acceptance rates of invitation, and recruitment rates. Results The trial was set up in 13 centres with 27 adjoining local health authorities. The coordinating centre team was led by one of the senior investigators, who was closely involved in planning and day to day trial management. Of 1 243 282 women invited, 23.2% (288 955) replied that they were eligible and would like to participate. Of those sent appointments, 73.6% (205 090) attended for recruitment. The acceptance rate varied from 19% to 33% between trial centres. Measures to ensure target recruitment included named coordinating centre staff supporting and monitoring each centre, prompt identification and resolution of logistic problems, varying the volume of invitations by centre, using local nonattendance rates to determine the size of recruitment clinics, and organising large ad hoc clinics supported by coordinating centre staff. The trial randomised 202 638 women in 4.3 years. Conclusions Planning and trial management are as important as trial design and require equal attention from senior investigators. Successful recruitment needs constant monitoring by a committed proactive management team that is willing to explore individual solutions for different centres and use central resources to improve local recruitment. Automation of trial processes with web based trial management systems is crucial in large multicentre randomised controlled trials. Recruitment can be further enhanced by using information videos and group discussions.<\/dc:description><dc:publisher>\n        BMJ Publishing Group Ltd.<\/dc:publisher><dc:date>\n        2008-11-13<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/22495\/1\/Recruitment_to_multicentre_trials%28published_version%29.pdf<\/dc:identifier><dc:identifier>\n          Menon, Usha and Gentry-Maharaj, Aleksandra and Ryan, Andy and Sharma, Aarti and Burnell, Matthew and Hallett, Rachel and Lewis, Sara and Lopez, Alberto and Godfrey, Keith and Oram, David and Herod, Jonathan and Williamson, Karin and Seif, Mourad and Scott, Ian and Mould, Tim and Woolas, Robert and Murdoch, John and Dobbs, Stephen and Amso, Nazar and Leeson, Simon and Cruickshank, Derek and McGuire, Alistair and Campbell, Stewart and Fallowfield, Lesley and Skates, Steve and Parmar, Mahesh and Jacobs, Ian  (2008) Recruitment to multicentre trials — lessons from UKCTOCS: descriptive study.  British Medical Journal, 337 (a2079).   ISSN 0959-8138     <\/dc:identifier><dc:relation>\n        http:\/\/www.bmj.com\/<\/dc:relation><dc:relation>\n        10.1136\/bmj.a2079<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/22495\/","http:\/\/www.bmj.com\/","10.1136\/bmj.a2079"],"year":2008,"topics":["R Medicine (General)"],"subject":["Article","PeerReviewed"],"fullText":""}