{"doi":"10.1080\/09505430601022619","coreId":"66540","oai":"oai:dro.dur.ac.uk.OAI2:1241","identifiers":["oai:dro.dur.ac.uk.OAI2:1241","10.1080\/09505430601022619"],"title":"From bio to nano : learning lessons from the UK agriculture biotechnology controversy.","authors":["Kearnes, M. B.","Grove-White, R.","Macnaghten, P. M.","Wilsdon, J.","Wynne, B."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2006-12","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66540.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/1241\/1\/1241.pdf","pdfHashValue":"8baac5206465efd3bf292237192c604c86fd82c3","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:1241<\/identifier><datestamp>\n      2011-08-03T15:35:28Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        From bio to nano : learning lessons from the UK agriculture biotechnology controversy.<\/dc:title><dc:creator>\n        Kearnes, M. B.<\/dc:creator><dc:creator>\n        Grove-White, R.<\/dc:creator><dc:creator>\n        Macnaghten, P. M.<\/dc:creator><dc:creator>\n        Wilsdon, J.<\/dc:creator><dc:creator>\n        Wynne, B.<\/dc:creator><dc:publisher>\n        Routledge<\/dc:publisher><dc:source>\n        Science as culture, 2006, Vol.15(4), pp.291-307 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2006-12<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:1241<\/dc:identifier><dc:identifier>\n        issn:0950-5431<\/dc:identifier><dc:identifier>\n        issn: 1470-1189<\/dc:identifier><dc:identifier>\n        doi:10.1080\/09505430601022619<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1241\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1080\/09505430601022619<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/1241\/1\/1241.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn: 1470-1189","issn:0950-5431"," 1470-1189","0950-5431"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2006,"topics":[],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n02 October 2008\nVersion of attached file:\nSubmitted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nKearnes, M. B. and Grove-White, R. and Macnaghten, P. M. and Wilsdon, J. and Wynne, B. (2006) ’From\nbio to nano : learning lessons from the UK agriculture biotechnology controversy.’, Science as culture., 15 (4).\npp. 291-307.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1080\/09505430601022619\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n Use policy \n \nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without \nprior permission or charge, for personal research or study, educational, or not-for-profit purposes \nprovided that : \n \n\u0083 a full bibliographic reference is made to the original source \n\u0083 a link is made to the metadata record in DRO \n\u0083 the full-text is not changed in any way \n \nThe full-text must not be sold in any format or medium without the formal permission of the copyright \nholders.  \n \nPlease consult the full DRO policy for further details. \n \nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom \nTel : +44 (0)191 334 2975 | Fax : +44 (0)191 334 2971 \nhttp:\/\/dro.dur.ac.uk \nDurham Research Online \n Deposited in DRO:\n02 October 2008\nVersion of attached file:\nSubmitted\nPeer-review status of attached file:\nNot peer-reviewed\nCitation for published item:\nKearnes, M. B. and Grove-White, R. and Macnaghten, P. M. and Wilsdon, J. and Wynne, B. (2006) 'From\nbio to nano : learning lessons from the UK agriculture biotechnology controversy.', Science as culture., 15\n(4), pp.\u0000291-307.\nFurther information on publishers website:\nhttp:\/\/dx.doi.org\/10.1080\/09505430601022619\nFrom Bio to Nano: \nLearning the Lessons, Interrogating the Comparison \nA paper submitted for ‘Science as Culture’ \n \nMatthew Kearnes n \nRobin Grove-White n \nPhil Macnaghten n \nJames Wilsdon o \nBrian Wynne p \n \nn Department of Sociology, Lancaster University \no Demos, London \np Centre for Economic and Social Aspects of Genomics (CESAGen), Lancaster \nUniversity \n \nCorresponding author: m.kearnes@lancaster.ac.uk \n \n \n 1\nFrom Bio to Nano: \nLearning the Lessons, Interrogating the Comparisoni \n \nIn this paper we consider the political, institutional and regulatory contexts in which \ncontemporary considerations of, and debates about, nanotechnology are currently \nsituated. We draw upon an analysis of the public and political controversy which \novertook GM plants and crops in the UK in the 1990s. Given the starkness of the ‘GM \nControversy’, it is not surprising there is now speculation in many quarters as to whether \nnanotechnologies might not be expected to experience a similarly rough passage. Here, it \nis suggested, is a further potentially transformative technology, now arguably at roughly \nthe stage of development as was biotechnology in the late 1970s or early 1980s, and \nsubject to similar levels of utopian promise, expectation and dystopian fear (Nordmann, \n2004b). Some NGOs are already suggesting that the issues and problems nanotechnology \nraises are of such far-reaching political and social importance that ‘governments [should] \ndeclare an immediate moratorium on commercial production of new nanomaterials and \nlaunch a transparent global process for evaluating the socioeconomic, health and \nenvironmental implications of the technology.’ (ETC 2003, 72) \n \nCrudely put, the GM experience represents a warning, a cautionary tale of how not to \nassess an emerging technology and allay public concern. For many, addressing the \nquestion ‘Is nanotechnology the next GM?’ is critical to the commercial success and \npublic acceptability of emerging applications in the field. As such the ‘GM experience’ \nhas been portrayed as a model ‘to be avoided’ in the future development and governance \nof nanotechnology. The comparison between GM and nanotechnology – and the lessons \nthat may be drawn from the regulation of biotechnology – has been made in a number of \ndifferent contexts (see for example, Einsiedel & Goldenberg, 1997; Mayer, 2002; \nBrumfiel, 2003; Wolfson, 2003; Mehta, 2004. As discussed below our analysis here is \nlimited to the UK. However, as we have emphasised elsewhere (see Wilsdon & Willis, \n2004; & Macnaghten et al, 2005) our analysis is also focused on how the governance of \nbiotechnology illuminates the paucity in regulatory responses to new and potentially \n 2\nradical technologies. In this sense the goal of this paper is not a direct comparison \nbetween GM and nanotechnology. Rather the comparison sheds light on the failures of \ngovernance and regulation implicit to the handling of a technology in the early stage of \nits development. \n \nAs with all such stories, however, the comparison between GM and nanotechnology is \nmore complex than may first appear. They are both very different technical endeavours, \nemanating from different disciplines, with vastly different scope. Therefore a direct \ncomparison between GM and nanotechnology is probably of limited value. Rather we ask \nin what ways the GM experience can inform and shape contemporary political and \nregulatory debates in which the development of nanotechnologies will be negotiated. We \nask whether there are any instructive lessons to be learned from this experience, \nparticularly in relation to the governance and regulatory responses to new and emerging \nnanotechnologies.  \n \nThis paper aims to address the above set of questions, albeit in a modest way, through \ncritical reflection on a set of interviews with key individuals active in the pre-1999 \ndevelopment of the regulatory and public involvement phases for GMO plants and crops \nin the UK and Europe.ii The reflections that follow seek to draw lessons from this latter \nexperience – but lessons of a particular kind. Drawing on the interviews, we comment \nfrom our particular research perspective on what might be called the ‘GM experience’ of \nthe past decade or so.iii  \n \nElsewhere we have argued that nanotechnology represents an extraordinary opportunity \nfor social science insights to be reflexively incorporated into its regulation and \ndevelopment (Macnaghten et al. 2005). By taking the reflexive governance of \nnanotechnologies as a central concern, we set out a prospective agenda for the social \nsciences as a progressive actor in these changes, providing insights that are simultaneous \nwith scientific, technological and social changes. In this paper we complement such a \nprospective agenda by taking a backward look at a previous technology – biotechnology \n– by reflecting on the ways in which the public and the science was framed in the \n 3\nformation of regulatory and governance regimes developed during its formative stages. \nWe argue that we can learn from two sets of competing understandings in the exegesis of \nthe biotechnological controversy: competing understandings of ‘the science’, and \ncompeting understandings of ‘the public’.  \n \n1. Competing Understandings of ‘the science’  \nThe formative role of the socio-technical imaginary \nIn the 1970s many leading genetic scientists expressed effusive visions of the \ntransformative societal futures that would result from advances in genetics and biology. \nOne such figure, C.H. Waddington, described the arrival of genetics as presaging a \n‘second industrial revolution’, surmounting the destructive effects of the earlier \nrevolution based (in his view) on physics and chemistry (see Waddington 1978). This \npreceded more recent and now often lamented intensifications of commercial pressures \nwithin science. Visions such as Waddington’s were not simply scientific imaginaries. \nThey were social too.  \n \nMarcus (1995) describes these kinds of visions as technoscientific imaginaries which are \ndefined as: \n \nA socially and culturally embedded sense of the imaginary that indeed looks to \nthe future and the future possibility through technoscientific innovation but is \nequally constrained by the very present conditions of scientific work. (p. 4) \n \nSuch technoscientific imaginaries represent sets of future oriented ‘structures of \ncontingency’ that provide a sociocultural context for technological change. Such \nimaginaries are technical, and social and cultural. Though they are ‘constrained by the \npresent conditions of scientific work’ they articulate the future social worlds in which it is \nimagined that technological innovation will be situated. This imaginary context for \ntechnological innovation defines what might be termed the social constitution of \ntechnology. Marcus’ notion of technoscientific imaginaries expresses this social \nconstitution by describing both the technical and deeply cultural discourses that imbue \ncontemporary science and technology. A resonant feature of technological innovation is, \n 4\ntherefore, a set of future-oriented socio-cultural imaginaries (van Lente, 1993). One of \nour GM interviewees spoke with singular passion about the potential for genetic and \nplant science to transform social relations and agriculture:  \n \nI remember so clearly getting a very passionate talk, a lecture, evangelical almost \nabout the future of biotech. This must have been in the very early 1970s. And I \nwas totally convinced – that in biotech we would start to see the end of the \nchemical industry or massive change in the chemical industry. And I think they \neven said that by the turn of the millennium the chemical industry would have \nbeen gone. To me biotech is using water [where] the chemical industry tends to \nuse organic solvent, biotech is using ambient temperatures where …. the \nchemicals industry uses … high temperatures. Biotechnology allows you to \nproduce some very exciting molecules which you can’t envisage producing \nchemically, proteins being the classic example. I don’t really think then we were \nthinking about DNA, you know gene therapy and that stuff - that was a bit too \nearly. But those were the dreams and that’s still my belief. It’s a belief that goes \nright back to 1972. (Interview with Professor Nigel Poole, Former Chief Bio-\nScientist Zeneca)  \n \nIn the commercial sphere, Monsanto’s initial strategic R&D commitment to GM crops \nand foods systems was justified in terms of equally positive projected visions for future \nglobal agriculture and society, beyond the more narrow and arguably more technical \nvisions of ‘terminator technology’ or proprietary brand herbicide-resistance (Doubleday \n2004). Although now often disparaged as having been focussed exclusively on private \ncorporate profit and control (a plant scientist interviewee spontaneously described GM \nplant science to us as ‘having been hijacked by the big corporations, and not only in their \nown funding but their influence on public funding too’) Monsanto’s imaginaries in the \n1980s and 90s nevertheless reflected a particular social vision for a more \nenvironmentally-benign global agriculture. The move to GM was justified as a major \ncontribution to future sustainable development through its supposed reduction of reliance \non chemical inputs, thus feeding into a wider-ranging debate over the future of \nagriculture both in the US and Europe. Equally striking however was the degree of \nnaiveté within this vision about other social actors’ possible responses and expectations.  \n \nSocietal and scientific imaginaries of this kind – projections of future imagined worlds \nembedded within the present – frequently inform and shape new scientific fields. In the \n 5\nSTS literature, this is often referred to as a sociology of promises, or expectations (see \nBrown and Michael 2003; van Lente, 1993; Hedgecoe and Martin 2003).iv The GM \nexperience points to the fact that, despite their scientific significance and, arguably, \npersuasive power for governments and investors, such imaginaries tend to be insulated \nfrom wider recognition and debate, accountability, and negotiation. They are shielded not \nleast by myths about scientific ‘purity’ with respect to normative influences. \nConventional understandings of the relationship between scientific research and the \npublic domain have assumed that this relationship is essentially linear (Wynne 1991, \n1995). Such models maintain that science produces new knowledge under conditions of \ninsulation from social influence or public values, is ethically neutral, and determined by \nnatural scientific factors alone. Only once scientific knowledge is thought to have \npotential ‘applications’ do such social and ethical dimensions enter in, according to this \nmodel. This means that ethical and social issues are acknowledged to arise only in \nconnection with possible impacts, not with the aims and purposes underlying scientific \nknowledge-production.  \n \nHowever, in the last decade or more this model has come under increasingly intense \npressure, partly due to the changing political economy of research where commercial \nexploitation and property rights have become central, and partly due to emerging policy \nsignificance of ‘public engagement’ discourses notably in the UK and EU. Under these \nconditions the need for even ‘basic’ scientists to project images of how their research \nmight benefit society in the future, has intensified. As basic or pure research comes to be \ncalled ‘pre-market’ research, an unavoidable implication is that ‘basic’ research practices \nare imagining possible market outcomes, in ways which may subtly but significantly \nshape those research agendas and cultures themselves, upstream from eventual outcomes.  \n \nLimitations of risk assessment to anticipate fault-lines of controversy \nThe regulatory context for genetically modified foods was framed within a predominately \nreductionist conception of 'risk' and 'risk assessment'; one which was methodologically \nquantitative and almost exclusively concerned with possible ‘direct’ effects of individual \nGM crops. The overwhelming regulatory response in the UK and Europe to GM crops \n 6\nconcerned the potential risk and safety impacts of particular GM constructs. Whilst \nimportant in itself, this approach had the effect of marginalising social, ecological, \nmedical and political implications of GMO technology from serious official \nconsideration. The primary framing of key issues as exclusively 'risk'-related coupled to \nofficial assurances of safety, had the effect of turning risk assessment into a de facto \nlocus of political contestation towards GM releases (Ravetz, 2005). It also, we argue, \nhandicapped the UK government in developing appropriate responses in the face of \npublic concern, thus playing a shaping role in the development of public controversy in \nthe late 1990s. \n \nThe emergence of the emphasis on determinate 'risks' as the criterion for evaluation, and \nthe associated neglect of wider societal concerns had evolved in the circumstances of  \nworld-wide experience of environmental and social controversies in the 1970s and 1980s \nsurrounding civil nuclear power and the diffusion of agrochemicals. Public acceptance \nproblems with civil nuclear power in the 1970s had led UK bodies like the National \nRadiological Protection Board to develop increasingly elaborate formalised procedures \nfor quantitative risk assessment, building on earlier experience within the chemical \nindustry (Royal Society 1983). Such processes offered procedural templates for the \nadvance ‘expert’ identification of specific potential mishaps (‘risks’), leading to \nassessment of probabilities of adverse outcomes in relation both to particular pathways \nand to the overall ‘system’ in question.  It was against this background that EU \ngovernments began negotiations, in the 1980s, about a system of risk assessment for \npossible releases into the environment of GM artefacts for either research or commercial \npurposes. Consistent with advice of the Royal Commission on Environmental Pollution \n(1989) they adopted the established broad template of product-by-product risk \nassessment. But they also required that the industries concerned look beyond past \nknowledge to possible future hazards in advance of empirical evidence for their \nexistence. Because this system was itself set in place before any products (or their \npossible hazards) were yet in existence, it was seen as a ‘precautionary’ system.  \n \n 7\nThis new GM risk assessment framework (specified in EU Directive 1990\/20 and enacted \nin Britain through the Environmental Protection Act 1990) came quickly to provide more \nthan simply a statutory basis for prior evaluation of specific GM artefacts. Though EU \nDirective 1990\/20 incorporated methodological innovations in risk assessment – creating \nthe conditions for expanded recognition of the presence of scientific uncertainty (see \nLevidow, 2001) – nevertheless its 'risk' framing acted to constitute a normative framing \nthat structured how the nature of GM artefacts was understood by the policy community \nand the way that possible impacts (‘to human health or the environment’) were \nconceptualised and analysed in wider media and NGO discussion. (Grove-White 1996; \nWynne 2001). \n \nIn the UK, the Environmental Protection Act 1990 established the Advisory Committee \nfor Releases to the Environment (ACRE) as the formal body responsible for assessing the \nrisks to human health and the environment from the release and marketing of genetically \nmodified organisms (GMOs). ACRE’s position and framing was awkward from the \noutset. As the only established mechanism for the regulatory assessment of GM releases \nthis advisory body became the de facto political authority on GM releases, backed by the \nGovernment’s commitment to ‘sound science’ (Mayer, 2002; Mayer & Stirling, 2002). \nHowever, as we have noted, ACRE was concerned solely with the risks of individual GM \ncrops, on a case-by-case basis. Tait & Levidow (1992) describe the way in which such \nassessment processes became a ‘reactive\/preventive system of risk regulation’, in which \nthe assessment process reflected only scientifically proven adverse impacts that had \narisen in previous generations of products or processes. In seeking to address specific \nrisks on a case-by-case basis, its assessment template came to rest on past knowledge \nrather than taking into account the potential for new eventualities that could arise in as \nyet unknown forms. \n \nThe ex-Chair of ACRE confirmed in our interviews the way that this created difficulties \nin considering the wider cumulative implications of multiple GM crops:  \n \nThe other big related difficulty [was] in terms of [the way] government \ndepartments respond. We recognised quite quickly in the advisory committee for \n 8\nreleases to the environment that it was really very easy to give approval, say, for \nGM maize as is being done at the moment. You could not see any human risks, \nyou couldn’t really see any serious environmental ones, and as was proven in the \nfarm trials, it’s actually slightly better than traditional herbicide treatment in terms \nof wildlife. But we asked the question, sure, we can do this for one crop, one \nmanipulation. But when all crops are being manipulated, every effect becomes \nadditive. So if you approve an insect resistant oilseed rape, you can do analysis \nand we’ll say well, that particular variety is only likely to occupy such a \npercentage of the area of the UK. The impact on insect production is small, the \nimpact on birds is therefore likely to be small, probably quite acceptable, not \nmajor difference from use of pesticides. However, if every farmer grew those \ncrops at every farm suddenly the impact is enormous. Where is the mechanism to \nput it all together? (Interview with Professor John Berringer) \n \nHe expanded this concern later in the interview: \n \nThe big issue in terms of commercialising is what happens if you then approve \nanother variety with another gene and then another variety with another gene. \nYou’d need to know something about the inter-relationship of those genes if they \ncome together. And I finished chairing the committee before it was properly \ndecided… First person’s dead easy, second person has to take into consideration \nthe first gene, the third has to take into consideration the first two, the fourth has \nthen got three prior genes plus their own in number of different. So there were lots \nof arguments. I think it’s still not remotely solved as to what happens when \nyou’ve got lots of different genes out there, what are the possible combinations of \nactivity. (Interview with Professor John Berringer; See also ACRE, 1998; \nLevidow & Carr, 2000) \n \nCoupled with its case-by-case focus on single GM constructs other attributes of ACRE’s \nframing and self-constitution – such as its ‘bounded’ character, its emphasis on \nquantification, its aggregation of alternative outcomes, presumptions of compliance, and \nneglect of ‘Type II’ errors – produced what Stirling (2003) describes as a ‘reductive \naggregative’ in its approach to the assessment of GM crops. Similarly Levidow et al \n(1999) point to the way in which the risk debates concerning GM crops became \n‘scientised’ as some scientific uncertainties were addressed and others downplayed. \nThough initially imagined in precautionary terms, ACRE’s limited remit and reductionist \nframing nullified the extent in which ongoing and cumulative uncertainties could be \nthoroughly considered, as explained by former ACRE committee member Julie Hill: \n \nI suppose the main sort of insight I have on that is what happened in ACRE with \nsuddenly everybody, it dawning on everyone that huge conditions had been \n 9\nattached to trials but they were conditions that didn’t allow you to gain any level \nof knowledge about what happened at commercial scale and therefore they’d \nactually made an almost impossible leap from trial stage to commercial stage. …  \nSo in effect what ACRE was being was incredibly precautionary. But \nprecautionary to the extent you can make no logical leap from trial to \ncommercialisation so it’s not being that precautionary. (Interview with Julie Hill) \n \nSuch limitations, embodied in the ‘precautionary’ approach developed for GM under \nDirective 1990\/20, contributed to mounting problems for government as wider political \ncontroversies around GM food emerged (Jasanoff, 2000). Such concerns – including the \nperception that government and corporate decisions had already been taken, that GM \nfoods would lead to an inevitable diminution in consumer choice, of GM as 'unnatural', \nand concerns about corporate control of food systems (see Grove-White, et al, 1997; \n2000) – were simply not captured by the language of risk and safety. One effect of this \ndeletion was to make debates about the risk and safety of GM crops stand-in for a host of \nother unacknowledged concerns (Gaskell, et al, 2004). Yet the intensity of these wider \nsocial concerns was reinforced by the lack of any official recognition and official \nassurances of the adequacy of assessment mechanisms.  \n \nOur interviews  confirmed the dilemmas faced by ACRE advisory scientists: constrained \non the one hand by a ‘sound science’ remit, yet also subjected by both internal and \nexternal pressures to extend their remits beyond their science-based domains of \ncompetence. For example, the ex-Chair of ACRE expressed his chagrin at the way that \nACRE had become the default locus for the political contestation of GM crops: \n \nWe [ACRE] were there such that when something has to be done that could be \ncontentious we can be blamed. … I believe that what we’ve set up was the best \nmechanism we had to do something safely, and that was my primary concern. … \nAnd I knew damn well that what they [the government] wanted was a system that \nrelieved them of having to make decisions. And so we were constantly having \nturned on to us ‘We don’t really want to do something? Is it safe?’ That was \nconstantly being articulated in the press and such like wasn’t it? And of course we \nwould do our analysis and we’d have to come back and say well, there are always \nrisks and the risks seem to be sufficiently low that we can’t say it’s not. (Professor \nJohn Berringer) \n \n 10\nThe approach in question embodied a limitation carried over from the treatment of \nnuclear power and agrochemicals in regarding as valid only those the parameters of \nconcern specifiable through (selective) 'risk'-based framings.. Significantly, such \nprocesses failed to generate public confidence or to allay public concern. For example, \nmuch of the controversy surrounding civil nuclear power in the 1970s and 1980s \nrevolved around concerns inaccessible to such an approach, such as the cumulative safety \nimplications of nuclear waste generation, social and political concerns about plutonium \nseparation and dependency, and disquiet about the significance of possible ‘low \nprobability-high impact’ accidents (confirmed as central by the Chernobyl events of \n1986). All of such concerns lay unambiguously outside the methodological scope of case-\nby-case risk assessment.   \n \nThere was a degree of precedent for widening the ways in which GM releases were \nconsidered across certain countries in Northern Europe. Other European governments, \nincluding Denmark, the Netherlands, Germany and Norway, responded to the concerns \nraised about GM artefacts with innovative institutionalised forms of social debate and \ndialogue (Levidov 1998). In modest echoes of such European precedents two such \ninitiatives were undertaken in the UK – a consensus conference, organised in 1995 by the \nScience Museum and AFRC (UK Government 1994; Joss & Durant 1995), and a \ngovernment-organised ‘National Biotechnology Conference’ held in early 1997 (Macrory \n1997). Unfortunately, both of these initiatives were limited in their scope, public \nvisibility and ability to shape the trajectory of GM regulation and development. Similarly \nneither was framed to allow examination of the wider societal and ethical concerns. And \nneither fed into any visible policy process.  \n \nIndeed, in retrospect, much of the intensity of the UK’s GM controversies in the 1990s \ncan now be understood as constituting successive corrective processes to the forms of \nrisk assessment framing adopted EU-wide in 1990. Not only did it prove necessary to \nspend four years painfully revising the scope and terms of the Directive in order to \nencompass ecological and other wider effects (achieved finally in Directive 2001\/18) but \nthe ways in which Ministers and officials defended the manifest inadequacies of the \n 11\nsystem operated by ACRE over the period were central to the UK Government’s \nescalating loss of public credibility on the matter. Indeed, sweeping Prime Ministerial \nportrayals of critiques of biotechnology as mere ‘anti-scientific emotionalism’ further \nexacerbated such a dynamic (Jasanoff 2005b) \n \n2. Competing understandings of ‘the public’ \nThe Misleading Construction of ‘the Public’’  \nDuring the 1970s and 80s public attitudes to civil nuclear power were systematically \ncharacterised as subjective, emotional and false risk perceptions (Wynne 1982; Irwin and \nWynne 1996). In the late 80s and early 90s, an equivalent dynamic emerged in the \nbiotechnology field. With few exceptions, it was assumed that public concerns about GM \ncrops could only be founded on a public deficit of understanding. The overriding \ndiscourse was that public concern about these technologies stemmed from either an \nincorrect understanding of the technology or a complete lack of knowledge altogether.   \n \nAs the 1990s advanced, social-science researchers became increasingly active observers \nof the state of public opinion in relation to GM plants and foods (Durant et al. 1998; \nINRA 1993, 2000; Martin and Tait 1992; MORI 1999). Much of this work focused on \nshifting public ‘attitudes’ rather than wider examinations of underlying sources of social \ntension, and how these reflected limitations in the risk-regulatory framework itself (Irwin \n2001). Indeed, most built on the assumption that the normative discourse of atomised \nscience-defined ‘risks’ offered an analytically sound basis for commentary on the state of \npublic opinion. As such, even though survey data began to point to steady decline of \npublic confidence towards biotechnology throughout the 1990s (Gaskell et al. 2003), \nmost were unable to conceptualise the underlying tensions inherent to GM releases and \nthe increasing political fragility of official reassurances. They therefore offered little \nexplanation or warning for why GM became a site through which concerns over a whole \nraft of ‘risk controversies’ were articulated (for an exception, see Grove-White et al. \n1997. Also see Levidow 1998). \n \n 12\nSuch assumptions tended to be shared by public and expert bodies such as COPUS (the \nRoyal Society Committee on the Public Understanding of Science), the Health and Safety \nExecutive, and the DTI. All such bodies presumed that the key issue of public concern \nwere the risks as defined by the risk-assessment discourse, and that any disinclination by \nthe public to accept such risks was based on a (false) belief that the risks were too high. \nIn other words, this presumed that the meaning of the issue to the public must be the \nsame as its meaning to scientists.  \n \nEven following the official discrediting of this ‘deficit model’ (symbolically put to bed in \nthe House of Lords Science and Society report in March 2000), this misconception has \ncome to be resurrected, albeit in a succession of new versions. Such persistence reflects \nan institutional science and policy culture which continues to project problems of public \nconflict, mistrust and scepticism about prevailing science onto other supposedly \nblameworthy agents – commonly a sensationalist media, or mischievous NGOs. In other \nwords, responsibility for such problems has been continually externalised away from \nofficial institutions and their embedded cultural reflexes, such that government and \nscientists’ own roles are rarely if ever put in question.v  \n \nInherent to this externalisation is the conviction that public opposition is founded in fear, \nas distinct from mistrust or even outrage at being misrepresented by those scientific and \npolicy institutions. Thus on this view the public is concerned only instrumentally about \nrisk, rather than with the aims, purposes and political economy underlying scientific \nknowledge-production, and that risk discourses are the only appropriate resources for \nforms of communication to reassure a misinformed public (Wynne, 2005). \n \nContinuing misunderstandings about NGOs and their relationships with civil society \nIn this view it is assumed that public concern is actually something that has been created \nby NGOs, acting irresponsibly in association with a sensation-seeking media. Some of \nour interviews echoed such views:  \n \n 13\nThere was a clear view that there was an anti-science agenda that was coming \nthrough…The biggest frustration was the dishonesty and the distortion [on the \npart of NGOs and the media] which it’s very difficult to handle. It’s \nextraordinarily difficult to handle (Interview with Professor Raymond Baker, \nformer CEO, BBSRC)  \n \nFear of the unknown…it’s like MMR in many ways. You know, no real benefit – \nand fear of the consequences – and a confusion because they were being fed \ndownright lies by people. There is no way of actually correcting the [NGO] lies \n(Interview with Professor Nigel Poole, Former Chief Bio-Scientist Zeneca)  \n \nForceful allegations of deceit and misrepresentation carry the implication that NGOs \nhave been purposeful institutionalised actors in society, of one mind, and of acting \nruthlessly to manipulate policy in misguided directions. Generalised charges of this kind \nrely on assumptions about the capacities of NGOs to create controversy in the absence of \npre-exisent public unease. Interviews with NGO actors involved with GM campaigns \nthroughout the 1980s and 1990s, supplemented by personal experience of the authors \nthemselves, suggest however that such charges may exaggerate the capacities of NGOs.  \n \nNational bodies like Greenpeace, Friends of the Earth, the Soil Association and RSPB, \neach of which made a distinctly different contribution to the more visible stages of the \nlate 90s' GM controversies, tend routinely to be preoccupied with multiple issues, each of \nwhich have their own particular histories and concerns. Such UK national NGOs were \nrelatively slow and uneven in developing coherent ‘campaigns’ on GM crops. Indeed the \noverall response by these groups to GMOs lacked clarity and unanimity. Greenpeace for \nexample, following its initial (and resonant) direct action drawing attention to \nMonsanto’s first ship import of GM Soya in mid-1996, was uncertain what do next. \nDespite the existence of a long-established formal Greenpeace International stance of \n‘opposition’ to GMOs, there was protracted internal discussion within the UK office \nabout whether there was any appropriate basis for further initiatives, or on what grounds. \nFriends of the Earth took the issue up only in 1998, in parallel with the RSPB’s shared \nconcern, with the statutory agency, English Nature, over the specific issue of potential \nbiodiversity impacts from commercial growing of GM crops. This led to the setting-up of \nthe Government’s Farm-Scale Trials at the end of that year.  \n 14\n To a considerable extent, the national NGOs, far from leading the mounting controversies \nabout GM commercialisation up to this point, found themselves in the position of \nresponding to the intensity of a wider public unease being expressed through the \nspontaneous emergence of new independent networks and initiativesvi. Greenpeace’s \n1996 Soya ship action, followed by a sequence of subsequent supermarket-focused \ndemonstrations, were essentially ad hoc initiatives unrelated to any over-arching \ncampaign strategy. Indeed, the 1998 recognition of possible specific biodiversity impacts \nof GM crop commercialisation, with RSPB in the vanguard, reflected the first successful \ntranslation of public concern into terms familiar to established UK NGO praxis. Once \nthat watershed had been crossed – and given firm official expression through the setting \nin motion of the Farm Scale Trials programme – GM crops became validated as an \nenvironmental issue, and associated NGO interventions then proliferated.  \n \nMuch of the initial difficulty for Greenpeace, Friends of the Earth and others in \ncampaigning coherently on GM-related issues arose from the fact that the dominant ‘risk’ \ndiscourse into which GMO had been channelled offered them minimal scope for \ninterventions. For example Greenpeace’s stated strategic approach to GM issues was \narticulated in the idioms of science alone:  \n \n…the difficulty Greenpeace has, is that we are a global organisation and, if one is \nto take value-based stances on what is and is not natural and the value judgements \nand the sort of loadings that that comes with, how relevant is it to talk about it in \nthose terms and try and explain one’s concern in those terms in China, where the \nterm for nature doesn’t actually exist or certainly doesn’t exist in any meaningful \nform that we would recognise in the West? And the same is true to a greater or \nlesser extent in other cultures, that the term nature is not always translatable in the \nsame way or certainly with the same meanings. So whilst I think it’s true to say \nthat the motivations for the kind of values based campaigning or campaigns with \na value base are, I’d be wrong to dismiss that from what we do. That is not our \nposition. Our position is about scientific risks. Our kind of globally applicable \nstandard is the science of environmental risk. You can say that’s the basis of our \ncampaign policy and that’s where we’re coming from. (Interview with Dr Doug \nParr, Chief Scientist, Greenpeace)  \n \n 15\nCollectively, these various pointers suggest that, whatever the beliefs or personal \ninclinations of individual NGO supporters or even campaign staff members, national \nNGOs face unacknowledged constraints in their ability to transmit the full texture of \nconcerns of the wider population to new technologies. The drive for legitimacy in relation \nto arms of government with whom they must interact continuously enforces its own \ndisciplines and habits – even as such bodies seek to channel and give expression to wider \nconcerns and preoccupationsvii.  \n \nNew technologies may serve as condensation points for new forms of political argument  \nGM crops had become something of an iconic environmental and social issue in many \ncountries by the end of the 1990s. At the immediate level, concern crystallised around the \npotential for unforeseen ecological consequences and the relevance or otherwise of GM \nto the needs of agriculture and food production. But discussion of the technology also \nreflected a broader set of tensions: global drives towards new forms of proprietary \nknowledge; shifting patterns of ownership and control in the food chain; issues of \ncorporate responsibility and corporate closeness to governments; intensifying \nrelationships of science and scientists to the worlds of power and commerce; unease \nabout hubristic approaches to limits in human understanding; conflicting interpretations \nof what might be meant by sustainable development. These and numerous other ‘non-\nscientific’ issues condensed onto GM crops because of a particular range of institutional \nand cultural contingencies shaping the technology and its development (Wynne 2001; \nJasanoff 2005a).  \n \nThis was hardly without precedent. In the very different circumstances of the 1970s, \nworld-wide disputes about civil nuclear power had played something of an analogous \nrole. Here too was an apparently unstoppable technology which became a vector for both \nissue-specific concerns and more general social and political anxieties. Thus beyond \ndetailed challenges about nuclear safety and open-ended problems of nuclear wastes \nwider issues presented themselves in intense forms. Just as the recent generic concerns \nabout GM have been reflections of tensions within the particular 'multi-national'- \ndominated political economy of the millennium, so with nuclear power in the 1970s and \n 16\nearly 80s, a range of then-current preoccupations about then state-dominated political \neconomy were integral to the disputes. The nuclear power controversies gained much of \ntheir dynamism from that technology’s appropriateness as an expression of such \ntendencies of its time, inherent in its very nature or ‘social constitution’ (Grove-White et \nal. 2000).  \n \nFor both GM and nuclear power, the social intensity of the arguments reflected not \nsimply ‘technical’ issues held to be legitimate by governments and scientists, but also \nwider social relations in which the respective technologies were embedded (indeed, of \nwhich they were judged to be reflections) at their particular historical moments. Thus it is \nnot too much to suggest that in the GM case what has been at stake is an implicit debate \nabout different visions of society through the medium of particular manifestations of the \ntechnology itself. In the absence of other meaningful spaces in which such debates could \ntake place, GM became the occasion and the opportunity.  \n \nConclusion  \nIn re-examining the GM experience we have sought to highlight the way in which this \nexperience demonstrates the generic challenges and failures governance and regulation of \nnew and emerging technologies. Rather than a directly compare biotechnology and \nnanotechnology we have sought to outline the implications of this experience for future \napproaches to nanotechnology. The GM experience evidenced a tendency that when \nfaced with new situations and technologies, regulators turn to assessment frameworks \ndeveloped for previous technologies and tied into existing debates. We suggest that, in \nthe context of this understandable tendency to ‘fight the last war’, there is now a need for \nsearching, socially–realistic analysis of the distinctive character and properties of \nparticular new technologies. Similarly we suggest that the deficiencies of case-by-case \nrisk assessment process calls for a more sophisticated understanding of the limitations of \nthe methodology and of its use as a cultural and scientific practice.  \n \nThe GM experience demonstrates the degree to which contemporary scientific research is \ninformed by tacit visions and imaginaries of the social role of technology. Often \n 17\nexplicitly utopic these tacit, technoscientific imaginaries form the basis upon which \nresearch priorities are negotiated and planned. Importantly, however, in the GM \nexperience such tacit visions were never openly acknowledged or subject to public \ndiscussion and debate. As such forms of official regulation and risk assessment – which \nwere largely confined to discussion of the potential human and environmental risks of \nGM crops – effectively denied any broader discussion of the public value of \nbiotechnology. In this context Jasanoff (2005b) suggests that:  \n \nThe problem for governance, then, is not the spread of techno-scientific cultures \nin and of themselves, but rather their increasing isolation from other institutions \nand modalities of deliberation … [which is characterised by a] loss of  reflexivity \nwithin the scientific enterprise itself, a phenomenon that disables modern science \nfrom recognising, and admitting, how profoundly normative are its visions of \nprogress. (p. 196) \n \nAs such Jasanoff suggests that we have entered a ‘new politics of knowledge’ in which \ntacit sociocultural visions of progress will become the subject of increased public concern \nand scrutiny. The implication of Jasanoff’s thesis is that the regulatory and governmental \nresponses to new and emerging technologies – such as nanotechnologies – constitute a \ngenuine opportunity for open-ended public debate and discussion of the social and \npolitical purposes of science and technology. She suggests that the most appropriate \nresponse to this politics of knowledge is to ‘by open up science’s hidden normative \npresumtions to authentic and inclusive public debate’ (p. 197).  \n \nElsewhere we have outlined the ways in which the development of nanotechnologies is \nfuelled by a diverse set of tacit technoscientific imaginaries (Macnaghten et al 2005, \nKearnes 2006 forthcoming). Nanotechnology is variously imagined in a number of ways. \nSome of the most significant technoscientific imaginaries of nanotechnology include: the \nnotion that nanotechnology will lead to the ‘next industrial revolution’; as facilitating \ncomplete control over the very structure of matter; as enabling a technological \nconvergence between biotechnology, information technology and cognitive science at the \nnanoscale; as leading to radical advances in information storage, drug delivery and \nmaterial science; and as a lucrative route for national and corporate wealth creation.viii In \n 18\nthis sense nanotechnology is characterised by forms of social and cultural innovation that \nparallel the technological possibilities of the field. Following Jasanoff’s notion of the new \npolitics of knowledge we contend that these tacit normative visions of societal progress \nimplicit in the current research and development of nanotechnology need to be opened to \nforms of public scrutiny and debate (Wilsdon et al 2004; 2005).  \nSimilarly, risk assessment of the kind implemented in the UK for GM releases, despite its \nEU ‘precautionary’ structure, can no longer be seen as an expert scientific’ tool’ or \n‘method’ entitled to automatic political deference. Before embarking on new frameworks \naiming at assessment of potential impacts of nanotechnology, a more sophisticated \nappreciation needs to be internalised within government and industry of:  \n \na. Inherent limitations of risk assessment applied to new technologies, even \nin its new ‘precautionary’ guises; and  \nb. Developments within the social sciences, and in a growing body of recent \ninternational practice, of the understanding of risk assessment as properly \na social and cultural process, involving public discussion of the values to \nbe protected, the analytical methods to be relied upon, and the parameters \nof the scientific issues to be addressed.  \n \nWhilst risk assessment will be crucial to the regulation of nanotechnology it is important \nto recognise the lesson of the GM experience that such necessarily scientistic forms of \nappraisal must be couched within a broader discussion of public value of nanotechnology \nand its inherent normative aims. The recent report Nanoscience and Nanotechnologies: \nOpportunities and Uncertainties jointly published by the Royal Society and Royal \nAcademy of Engineering (2004) raised concerns about the possible toxic risk of \nnanoparticles and recommended tight regulation and the instigation of stringent risk \nassessments on such particles. Whilst such considerations are strategically important they \nneed now to be situated within a broader upstream dialogue regarding the complex \nnormative dimensions of nanotechnology and how its future development might be \nshaped if wider society is to benefit.  \n \n 19\n In approaching possible concerns about nanotechnology, it is important to be more \nrealistic about the diverse roles and nature of NGOs .The breadth and unfamiliarity of \nissues now being thrown up by new technologies mean that the sphere is in continuing \nflux, to which their responses will vary. The ways in which NGOs ‘represent’ opinion in \nwider society needs richer understanding, if misleading assumptions are not to be \nincorporated into discussions about new social or political processes for nanotechnology.  \n \nThe GM experience suggests that the deficit model of public scepticism or mistrust of \nscience and technology is a fundamental cultural handicap for institutions charged with \nthe regulation and assessment of new technologies. For nanotechnology there is a need to \ndevelop patient and bold attempts to build in more rich, more complex and nuanced, and \nmore mature models of publics into ‘upstream’ modes of practice. This can only lead to \nmore sensitive, intelligent, robust and legitimate forms of science, whatever substantive \nforms they take.  \n \nThe GM experience demonstrates the ways in which new technologies often operate as \nnodal points around which wider public concerns condense. Such processes of \n‘condensation’ are inherently unpredictable. However, a richer understanding of the \nunderlying dynamics of such processes – informed by recent thinking in the social \nsciences – could begin to provide some clues. In considering approaches to the social \nhandling of nanotechnology and its potential manifestations in applied forms, care will \nneed to be taken to ‘design in’ resilience against the strains likely to emerge in the event \nof such patterns of exceptional controversy. This looks set to be a major challenge for \npolitical-democratic institutions in the decades ahead.  \n \n 20\n 21\nAnnex A – Inventory of Interviewees  \n \nProfessor Raymond Baker, former CEO, BBSRC, 24 February 2004.  \n \nProfessor John Beringer, former Chairman ACRE, 23 March 2004.  \n \nSir Thomas Blundell, former CEO BBSRC, 30 April 2004.  \n \nMark Cantley, Adviser, Directorate for Life Sciences (Biotechnology, Agriculture and \nFood), Research Directorate-General, European Commission, 6 April, 2004. \n \nDr Ian Gibson MP, Chairman, House of Commons Science and Technology Select \nCommittee, 15 March 2004.  \n \nJulie Hill, Former ACRE member and Former Director Green Alliance, 30 March 2004.  \n \nProfessor Sir Martin Holdgate, former Chief Scientist Department of the Environment, 19 \nMarch 2004.  \n \nInterview with Sue Mayer, Director Genewatch, 1 April 2004.  \n \nInterview with Doug Parr, Chief Scientist Greenpeace, 4 March 2004.  \n \nInterview with Professor Nigel Poole, Former Chief Bio-Scientist Zeneca, 16 March \n2004. \nBibliography \nACRE, 1998: ACRE Annual Report No. 4: 1996\/7, London: DETR.  \nBrown, N. & Michael, M., 2003: A sociology of expectations: retrospecting prospects \nand prospecting retrospects. Technology Analysis & Strategic Management \n15(1): 4-18.  \nBrumfiel, G., 2003: Nanotechnology: A little knowledge … Nature, 424(6946), 246. \nBusch. L., Grove-White, R.,, Jasanoff, S., Winickoff, D. & Wynne, B., 2004: Amicus \nCuriae Brief. Submitted to the Dispute Settlement Panel of the World Trade \nOrganiza-tion in the Case of EC Measures Affecting the Approval and \nMarketing of Bio-tech Products, \nhttp:\/\/www.genewatch.org\/WTO\/Amicus\/AcademicAmicus_WTO_submissio\nn.pdf \nDepartment of Trade and Industry (DTI). 2004: Nanotechnology offers potential to \nbring jobs,investment and prosperity—Lord Sainsbury. Press release from the \nDepartment of Trade and Industry, July 29. \nDoubleday, R., 2004: Political Innovation: Corporate Engagements in Controversy \nOver Genetically Modified Foods. Unpublished Ph. D. thesis, University \nCollege London.  \nDrexler,K. E. 1986: Engines of Creation: The Coming Era of Nanotechnology. \nNewYork: Anchor Books. \nDurant, J., Bauer, M. and Gaskell, G., 1998: Biotechnology in the Public Sphere: A \nEuropean source book. London: Science Museum \nEasterby-Smith, M., 1997: Disciplines of organizational learning: contributions and \ncritiques. Human Relations, 50, 1085-1113.  \nEinsiedel, E.F.; Goldenberg, L. 2004: Dwarfing the Social? Nanotechnology Lessons \nfrom the Biotechnology Front, Bulletin of Science, Technology & Society, 24, \n28-33. \nETC Group 2003: The Big Down: From Genomes to atoms’, ETC Group.  \nEuropean Commission. 2004: Towards a European strategy on nanotechnology. \nBrussels: European Commission. \nGaskell, G., Allum, N., Bauer, M., Jackson, J., Howard, S. & Lindsey, N. 2003. \nClimate change for biotechnology? UK public opinion 1991-2002. \nAgBioForum, 6 (1&2): 55-67. \n 22\nGaskell, G., Allum, N., Wagner, W., Kronberger, N., Torgersen, H., Hampel, J. & \nBardes, J. 2004: GM foods and the misperception of risk perception. Risk \nAnalysis, 24(1), 185-194. \nGrove-White, R., 1996: Environmental knowledge and public policy needs: on \nhumanising the research agenda, In: S. Lash, B. Szerszynski, and B. Wynne \n(eds.) Risk, Environment and Modernity: towards a new ecology. London, \nSage. \nGrove-White, R., 1997: Environment, risk and democracy. In Jacobs, M. (ed) \nGreening the Millennium. Oxford, Blackwell.   \nGrove-White, R., 2001: GMs, Ethics and Public Policy: some reflections, \nBiotechnology and Global Governance: Crisis and Opportunity conference. \nWeatherhead Centre, Harvard University. April 26-28. \nGrove-White, R., Macnaghten, P., Mayer., S. & Wynne, B., 1997: Uncertain World: \nGenetically Modified Organisms, Food and Public Attitudes in Britain (in \nassociation with Unilever), Lancaster: IEPPP, Lancaster University.  \nGrove-White, Robin, Phil Macnaghten and Brian Wynne (2000), Wising Up: The \npublic and new technologies, Lancaster: IEPPP, Lancaster University.  \nHedgecoe, A. & Martin, P., 2003: The drugs don't work: expectations and the shaping \nof pharmacogenetics. Social Studies of Science, 33(2).  \nHouse of Commons Science and Technology Committee. 2004: Too Little Too Late? \nGovernment Investment in Nanotechnology. Fifth report of session 2003–\n2004. London: House of Commons. \nHouse of Lords Select Committee on Science and Technology., 2000: Science and \nSociety. House of Lords, London. \nHuber, G., 1991: Organizational learning: the contributing processes and the \nliteratures. Organization Science, 2, 88-115.  \nINRA. 1993: Biotechnology and Genetic Engineering: What Europeans think about it \nin 1993. Eurobarometer 39.1, European Commission \nINRA. 2000: The Europeans and Biotechnology. Eurobarometer 52.1, European \nCommission \nIrwin, A. 2001. ‘Constructing the scientific citizen: Science and democracy in the \nbiosciences’, Public Understanding of Science, 10 (1): 1-18 \n 23\nIrwin, A. and Wynne, B. 1996. Misunderstanding Science? The Public Reconstruction \nof Science and Technology. Cambridge and New York, Cambridge University \nPress. \nJasanoff, S., 2000: Commentary: Between risk and precaution – reassessing the future \nof GM crops. Journal of Risk Research, 3(3), 277-282.   \nJasanoff, S., 2005a: Designs on Nature: Science and Democracy in Europe and the \nUnited States. Princeton University Press, Princeton. \nJasanoff, S., 2005b: ‘Let them eat cake’: GM foods and the democratic imagination. \nIn Leach, M., Scoones, I. & Wynne, B. Science and Citizens: Globalization \nand the Challenge of Engagement. London, Zed Books, p. 183-198. \nJoss, S., & Durrant, J., 1995: Public Participation in Science: The Role of Consensus \nConferences in Europe. Science Museum.  \nKearnes, M.B., 2006 forthcoming: Chaos and control: nanotechnology and the politics \nof emergence. Paragraph, forthcoming \nLevidow, L., 2001: Precautionary uncertainty: regulating GM crops in Europe. Social \nStudies of Science, 31(6), 842-74. \nLevidow, L. & Carr, S. 2000: UK: precautionary commercialization. Journal of Risk \nResearch, 3(3), 261-270.  \nLevidow, L., Carr, S. & Wield, D. 1999: Regulating biotechnological risk, straining \nBritian’s consultative style. Journal of Risk Research, 2(4), 307-324. \nLevitt, B., & March, J., 1988: Organizational learning. Annual Review of Sociology, \n14, 319-340.  \nLux Research. 2004. The Nanotech Report 2004: Investment Overview and Market \nResearch for Nanotechnology. 3d ed. New York: Lux Research Inc. \nMacnaghten, P., 2004: Animals in their nature: a case study of public attitudes on \nanimals, genetic modification and “nature”, Sociology , 38(3), 533-551. \nMacnaghten, P., Kearnes, M.  & Wynne, B., 2005: Nanotechnology, governance and \npublic deliberation: What role for the social sciences? Science \nCommunication, 27(2), 268-287  \nMacrory, R., 1997: National Biotechnology Conference: Report of the Rapporteur, \nLondon: DETR \n 24\nMartin, S. and Tait, J., 1992: Attitudes of selected public groups in the U.K. to \nbiotechnology. In Biotechnology in Public, J. Durant, ed., Science Museum, \nLondon. \nMarcus, G. E (ed) 1995: Technoscientific Imaginaries: Conversations, profiles and \nMemoirs. Chicago, University of Chicago Press.  \nMayer, S., 2002: From genetic modification to nanotechnology: the dangers of ‘sound \nscience’. In: Gilland, T (ed.), Science: Can We Trust the Experts?  Hodder and \nStoughton, London, pp. 1-15. \nMayer, S., Hill, J., Grove-White, R. and Wynne, B. 1996: Uncertainty, precaution and \ndecision making: the release of Genetically Modified Organisms into the \nenvironment. UK ESRC Global Environmental Change Programme Briefings, \nNo. 8, 8 June, 1996. \nMayer, S. & Stirling, A., 2002: Finding a precautionary approach to technological \ndevelopments – lessons for the evaluation of GM crops. Journal of \nAgricultural and Environmental Ethics, 15, 57-71.  \nMehta, M.D., 2004: From Biotechnology to Nanotechnology: What Can We Learn \nfrom Earlier Technologies? Bulletin of Science, Technology & Society, 24, 34-\n39. \nMORI. 1999: The Public Consultation on Developments in the Biosciences. London: \nDepartment of Trade and Industry. \nNational Science and Technology Council (NSTC) InteragencyWorking Group on \nNanscience, Engineering and Technology (IWGN). 2000: National \nNanotechnology Initiative: Leading to the next industrial revolution. \nWashington, DC: NSTC. \nNordmann, A. 2004a: Converging Technologies—Shaping the Future of European \nSocieties. Brussels: European Commission. \nNordmann, A., 2004b: Molecular Disjunctions: Staking Claims at the Nanoscale, in \nBaird, D., Nordmann, A & Schummer, J., Discovering the Nanoscale, IOS \nPress, Amsterdam. \nPopper, M. & Lipshitz, R. 1998: Organizational learning mechanisms: a structural and \ncultural approach to organizational learning. Journal of Behaviorial Science, \n34, 161-179.  \n 25\nRavetz, J., 2005: The post-normal science of safety. In Leach, M., Scoones, I. & \nWynne, B. Science and Citizens: Globalization and the Challenge of \nEngagement. London, Zed Books, p. 43-53. \nRoco, M., & Bainbridge, W., (eds) 2001: Societal Implications of Nanoscience and \nNanotechnology. Boston: Kluwer Academic Publishers. \nRoco, M., & Bainbridge, W., (eds) 2003: Converging Technologies for Improving \nHuman Performace: Nanotechnology, Biotechnology, Information Technology \nand Cognitive Science.. Boston: Kluwer Academic Publishers. \nRoyal Commission on Environmental Pollution., 1989: Thirteenth Report July 1989 \nThe Release of Genetically Engineered Organisms to the Environment. Royal \nCommission on Environmental Pollution, London.  \nRoyal Society, 1983: Risk Assessment: A Study Group Report. Royal Society, \nLondon. \nRoyal Society\/Royal Academy of Engineering (RAE). 2004: Nanoscience and \nNanotechnologies: Opportunities and Uncertainties. London: Royal Society \nand Royal Academy of Engineering. \nStirling, A. 2003: Risk, Science and Precaution; some instrumental implications from \nthe social sciences. In Berkhout, F., Leach, M. & Scoones, I. (eds) Negotiating \nChange. London, Elgar. \nTait, J. & Levidow, L., 1992: Proactive and reactive approaches to regulation: the \ncase of biotechnology, Futures 24 (3): 219-31.  \nUK Government. 1994: U.K. National Consensus Conference on Plant \nBiotechnology. Final Report Science Museum, London \nVan Lente, H. 1993: Promising technology: The dynamics of expectations in \ntechnological development, PhD thesis, Twente University, Delft: Eburon. \nWaddington, C. H. 1978: The Man-Made Future. London: Croom Helm.  \nWilsdon, J., and Willis, R., 2004: See-Through Science: Why Public Engagement \nNeeds to Move Upstream. London: Demos. \nWilsdon, J., Wynne, B. & Stilgoe, J., 2005: The Public Value of Science: Or How to \nEnsure that Science Really Matters. London: Demos. \nWolfson, J.R., 2003: Social and Ethical Issues in Nanotechnology: Lessons from \nBiotechnology and Other High Technologies, Biotechnology Law Report, \n22(4), 376-96. \n 26\nWynne, B. 1982. Rationality and Ritual: the Windscape inquiry and nuclear decisions \nin Britain. Chalfont St Giles: British Society for the History of Science \nWynne, B., 1991: Knowledges in Context. Science, Technology & Human Values, \n16(1), 111-121.  \nWynne, B., 1995: Public Understanding of Science. In S. Jasanoff & G. E. Markle & \nJ. C. Petersen & T. Pinch (Eds.), Handbook of Science and Technology \nStudies, Thousand Oaks, Ca.: Sage, pp. 361-388.  \nWynne, B., 2001: Creating public alienation: expert cultures of risk and ethics on \nGMOs. Science as Culture, 10(4), 445-481.  \nWynne, B., 2005: Risk as globalizing ‘democratic’ discourse? Framing subjects and \ncitizens. In Leach, M., Scoones, I. & Wynne, B. Science and Citizens: \nGlobalization and the Challenge of Engagement. London, Zed Books, p. 66-\n82. \n 27\n 28\n                                                \n \n \ni This paper forms part of the output of the ESRC funded project entitled: Nanotechnology, Risk and \nSustainability: Moving Public Engagement Upstream. An earlier version was published under the same \ntitle as a working paper on the project.  \nii These individuals are listed in Annex A. Whilst we quote directly from only a small number of these \ninterviews the analysis presented here draws implicitly on all the interviews, and our own experiences \nof the events of the 1990s (see, for example, Grove-White, 1996; 1997 2000; Mayer, et al, 1996; \nGrove-White, et al, 1997; 2000; Wynne, 200; Macnaghten, 2004).  \niii A preliminary comment should be made on the period discussed in the paper. The principal focus of \nthe analysis is on the 1980s and 1990s, up to the moment when the controversies over the first period of \ngenetic modification (GM) development reached their peak in the United Kingdom, in February 1999. \nClearly, since that time, there have been a number of further developments, including the creation of \nthe AEBC, the UK Government’s GM Dialogue, completion of the Farm Scale Trials, and, not least, \nthe ongoing hearings at the WTO into the formal US complaint on ‘Biotech Products’ against the EU. \nBut we have drawn the line at February 1999 (Busch et al. 2004). This is because for the purpose of \nthis paper is to reflect on the underlying processes which shaped the controversies, rather than the \nunfolding of the post-1998 events themselves. \niv See also papers by Selin and Rip (this volume) for an emerging analysis of the socio-technical \nimagination of nanotechnology.  \nv The emergence of the newly-created and more inclusive AEBC after 2001, led to the 2003 GM \nNation debate and to some effective challenge to these deficit model, risk-ridden institutional \nconstructions of the public. But to the extent this has occurred, it has tended still to be within the \nembedded assumption that risk assessment is the fundamental mode of authority. \nvi Indeed, as a response to the perception that such groups were not campaigning actively on GMOs \nfrom the mid-1990s, wider bodies of opinion, independent of such organisations, crystallised in a host \nof more ad hoc and GM-specific networks – including Genetix Snowball, the Genetics Network, the \nGenetics Alliance, Corporate Watch, Genewatch and many others. This further range of frequently \ninternet-focused associations embraced wide and diverse constituencies of concern, and can be read as \n‘organisational’ crystallisations of the pervasive, but previously latent, public unease about GM-related \nissues noted in UK social research as early as 1996-97 (Grove-White et al. 1997). \nvii Of course, within such constraints, the tactics of environmental NGOs and notably Greenpeace were \nclearly potent, both in their ability to document biophysical risks and especially uncertainties, and in \nthe metaphoric framing of GM material as contaminants (Levidow 2000). \nviii See: Drexler 1986; National Science and Technology Council 2000; Roco and Bainbridge 2001; \n2003; Department of Trade and Industry 2004; European Commission 2004; House of Commons \nScience and Technology Committee 2004; Lux Research 2004; Nordmann 2004a.  \n"}