{"doi":"10.1214\/105051607000000212","coreId":"66138","oai":"oai:dro.dur.ac.uk.OAI2:2996","identifiers":["oai:dro.dur.ac.uk.OAI2:2996","10.1214\/105051607000000212"],"title":"A Markov chain model of a polling system with parameter regeneration.","authors":["MacPhee, I. M.","Menshikov, M.","Petritis, D.","Popov, S."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-10-03","abstract":"We study a model of a polling system i.e. a collection of d queues with a single server that switches from queue to queue. The service time distribution and arrival rates change randomly every time a queue is emptied. This model is mapped to a mathematically equivalent model of a random walk with random choice of transition probabilities, a model which is of independent interest. All our results\\ud\nare obtained using methods from the constructive theory of Markov chains. We determine conditions for the existence of polynomial moments of hitting times for the random walk. An unusual phenomenon of thickness of the region of null recurrence for both the random walk and the queueing model is also proved","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/66138.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/2996\/1\/2996.pdf","pdfHashValue":"7116c26988a59238a7865949f35820d0fa197e72","publisher":"Institute of Mathematical Statistics","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:2996<\/identifier><datestamp>\n      2017-09-25T10:08:58Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        A Markov chain model of a polling system with parameter regeneration.<\/dc:title><dc:creator>\n        MacPhee, I. M.<\/dc:creator><dc:creator>\n        Menshikov, M.<\/dc:creator><dc:creator>\n        Petritis, D.<\/dc:creator><dc:creator>\n        Popov, S.<\/dc:creator><dc:description>\n        We study a model of a polling system i.e. a collection of d queues with a single server that switches from queue to queue. The service time distribution and arrival rates change randomly every time a queue is emptied. This model is mapped to a mathematically equivalent model of a random walk with random choice of transition probabilities, a model which is of independent interest. All our results\\ud\nare obtained using methods from the constructive theory of Markov chains. We determine conditions for the existence of polynomial moments of hitting times for the random walk. An unusual phenomenon of thickness of the region of null recurrence for both the random walk and the queueing model is also proved.<\/dc:description><dc:subject>\n        Polling system<\/dc:subject><dc:subject>\n         Hitting time moments<\/dc:subject><dc:subject>\n         Random environment<\/dc:subject><dc:subject>\n         Parameter regeneration<\/dc:subject><dc:subject>\n         Stability<\/dc:subject><dc:subject>\n         Time-inhomogeneous Markov chains<\/dc:subject><dc:subject>\n         Recurrence<\/dc:subject><dc:subject>\n         Lyapunov functions.<\/dc:subject><dc:publisher>\n        Institute of Mathematical Statistics<\/dc:publisher><dc:source>\n        Annals of applied probability, 2007, Vol.17(5\/6), pp.1447-1473 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2007-10-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:2996<\/dc:identifier><dc:identifier>\n        issn:1050-5164<\/dc:identifier><dc:identifier>\n        doi:10.1214\/105051607000000212<\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2996\/<\/dc:identifier><dc:identifier>\n        https:\/\/doi.org\/10.1214\/105051607000000212<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/2996\/1\/2996.pdf<\/dc:identifier><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:1050-5164","1050-5164"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2007,"topics":["Polling system","Hitting time moments","Random environment","Parameter regeneration","Stability","Time-inhomogeneous Markov chains","Recurrence","Lyapunov functions."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n17 May 2010\nVersion of attached file:\nPublished Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nMacPhee, I. M. and Menshikov, M. and Petritis, D. and Popov, S. (2007) ’A Markov chain model of a polling\nsystem with parameter regeneration.’, Annals of applied probability., 17 (5\/6). pp. 1447-1473.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1214\/105051607000000212\nPublisher’s copyright statement:\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\nThe Annals of Applied Probability\n2007, Vol. 17, Nos. 5\/6, 1447–1473\nDOI: 10.1214\/105051607000000212\n© Institute of Mathematical Statistics, 2007\nA MARKOV CHAIN MODEL OF A POLLING SYSTEM WITH\nPARAMETER REGENERATION\nBY IAIN MACPHEE, MIKHAIL MENSHIKOV,1 DIMITRI\nPETRITIS2 AND SERGUEI POPOV 3\nUniversity of Durham, University of Durham, Université de Rennes 1 and\nUniversidade de São Paulo\nWe study a model of a polling system, that is, a collection of d queues\nwith a single server that switches from queue to queue. The service time dis-\ntribution and arrival rates change randomly every time a queue is emptied.\nThis model is mapped to a mathematically equivalent model of a random\nwalk with random choice of transition probabilities, a model which is of in-\ndependent interest. All our results are obtained using methods from the con-\nstructive theory of Markov chains. We determine conditions for the existence\nof polynomial moments of hitting times for the random walk. An unusual\nphenomenon of thickness of the region of null recurrence for both the ran-\ndom walk and the queueing model is also proved.\n1. Introduction. The results presented in this paper, depending on the affini-\nties of the reader, can be looked at from two different viewpoints: a model from\nqueueing theory or a model from the theory of Markov chains. These two mod-\nels are mathematically equivalent but have their own individual interest. In this\npaper we start by describing the queueing model and stating the results for it. Sub-\nsequently, the proofs are obtained, after the queueing model has been bijectively\nmapped to a random walk model, by using methods from the constructive theory of\nMarkov chains to determine the asymptotic behavior of this random walk. A phe-\nnomenon, exceptional in the theory of stochastic processes, namely, a thick region\nof null recurrence, is also proved for our model.\nOur main objective is to investigate stability conditions for a polling model with\nparameter regeneration. We feel that parameter regeneration is quite a natural hy-\npothesis for realistic queueing systems: it models changes in behavior (of cus-\ntomers or servers) due to factors that are external to the studied system. In our\nReceived July 2006; revised December 2006.\n1Supported in part by FAPESP (20004\/13610-2).\n2Supported in part by the “Réseau Mathématique France–Brésil” and by the European Science\nFoundation.\n3Supported in part by CNPq (302981\/02–0), FAPESP (04\/03056–8) and by the “Rede Matemática\nBrasil–França.”\nAMS 2000 subject classifications. Primary 60K25, 60J10; secondary 60G42, 90B22.\nKey words and phrases. Polling system, parameter regeneration, stability, time-inhomogeneous\nMarkov chains, recurrence, Lyapunov functions.\n1447\n1448 MACPHEE, MENSHIKOV, PETRITIS AND POPOV\nmodel there are d ≥ 2 stations where queues of jobs can form and a single server\nwhich switches from station to station. The server only processes jobs at its cur-\nrent station. For clearer exposition we treat in this paper the case where only two\nstations are open, that is, receiving jobs, at any time. We study the model where\nall stations are open in a separate paper [9]. The reason for splitting this work into\ntwo separate papers, depending on whether two or more stations receive jobs, is\nthat in the former case stability conditions are expressible in terms of explicitly de-\ntermined factors, while in the latter, they are expressible in terms of factors whose\nexistence is shown but whose values are inaccessible to direct computation. These\nfactors are reminiscent of the Lyapunov exponents for products of random matri-\nces whose values can be approximated only by stochastic simulation. Moreover,\nwhile the obtained results in the two papers can be phrased in similar ways, the\ntechniques used to obtain them differ at key points.\nWhen the server completes all the jobs at its current station k, say, it starts to\nmove to the other open station i, station k closes and independently of the process\nhistory, station j \u0002= i opens with probability Pij , where ∑j \u0002=i Pij = 1 for each\nstation i. The sequence of stations visited by the server thus forms a Markov chain\n{Ir : r = 1,2, . . .} on state space Sd = {1,2, . . . , d} with transition matrix P which\nwe will assume is irreducible but may be periodic (this is necessary for the case\nd = 2 and for cases where one station has priority over the others). We call the time\nperiod between the server’s arrival at and departure from a station an epoch. The\nserver takes some time with distribution Hij which is independent of the process\nhistory to switch between stations and we will assume such times have bounded\nfirst moments (for some results a stronger assumption will be needed).\nDuring each switching time and service epoch, jobs arrive at the open stations\nin independent Poisson streams with rates λ1 at the server’s station i and λ2 at\nthe other open station j . The jobs at station i have independent service times with\ndistribution function G, mean µ−1, where G is selected from the class of distrib-\nutions \u0002 with uniformly bounded second moments. This service time distribution\nand the arrival rates (λ1, λ2) are regenerated at the start of each switching time\nindependently of the process history using a measure νij which depends upon the\nordered pair (i, j) of open stations. It will follow from our Condition E, given later\nin the paper, that there exist two positive constants m0 and M0, with m0 < M0\nsuch that m0 < λi < M0 for i = 1, 2. Each job at queue i leaves the system after\nprocessing by the server and when the server completes all jobs at station i, includ-\ning any that arrive since the server switched to i (exhaustive service), the epoch\nends. Succeeding epochs are defined in the same way except that if the system ever\nhas no jobs, then the server waits for some to arrive—we do not go into any de-\ntails as we are interested in establishing stability criteria, not studying equilibrium\nbehavior. Our main interest is in the queue lengths, but their behavior is controlled\nby the process of regenerated parameters, so we consider this in detail.\nA MARKOV CHAIN WITH PARAMETER REGENERATION 1449\nParameter regeneration. The parameters in each epoch have the form (i, j,G,\nλ1, λ2) ∈ S2d ×\u0002× (m0,M0)2 ≡ \u0004e. We impose below conditions on service times\nand arrival rates that ensure that the overall rate of events for the random walk is\nuniformly bounded and all epochs are finite with probability 1.\nAs stated above, we assume that the Markov chain {Ir} supplying the sequence\nof open stations is irreducible and starts from a state i1 ∈ Sd . Denote the space of\nparameter sequences by \u0004S = \u0004Ne = {(ir , ir+1,Gr,λr ) : r = 1,2, . . .}, the collec-\ntion of all sequences of ordered pairs of open stations together with service time\ndistribution and arrival rates.\nProbability is associated with events in \u0004S as follows. At each switching time\nr ≥ 1, the station where the server was closes, the server starts switching to station\nIr = i and at the same time, with chance Pij , j = 1, . . . , d , station Ir+1 = j \u0002= i\nopens. The arrival rates λr = (λ1(r), λ2(r)) and the service time distribution Gr\nat queue i (the random parameters) are chosen using measure νij independently\nof the process history and are constant throughout the epoch. As stated above, the\nserver takes a time with distribution Hij to complete its switch from i to j .\nWe will use ω ∈ \u0004S to denote a sequence of regenerated parameters and ωr =\n(ir , ir+1,Gr,λr ) to denote the parameter set in epoch r . Where it will not cause\nconfusion we will drop the epoch number dependence from parameter sets and\nwrite ωr = (i, j,G,λ).\nEmbedded Markov chain. We find it convenient to establish our stability re-\nsults for the queueing process in a discrete time setting, so we work with a Markov\nchain embedded in the continuous time process. Specifically, we consider the dis-\ncrete time embedded process (W, ξ) = {Wn, ξn}n∈N by observing the continuous\ntime process just after the instants of service completions and the ends of switch-\ning times. Here Wn ∈ \u0004e identifies the parameters immediately after event n and ξn\ndenotes the ordered pair of queue lengths so ξn ∈ N20 (where N0 = {0,1,2,3, . . .})\nand specifically, ξn,1 is the queue length at the server’s current station and ξn,2 the\nqueue length at the other open station.\nLet e1 and e2 denote the unit vectors of R2. Given Wn = (k, i,G,λ), the possible\nincrements of the queue lengths at event n are of the form\nse1 + te2, s, t ∈ N0 during a switching time\nand\nse1 + te2, s ∈ {−1} ∪ N0; t ∈ N0 during a service epoch\n(as the server’s queue is always given by x1). During switching times and during\nservice epochs when ξn = (x1, x2) with x1 > 1, the parameters will not change,\nthat is, Wn+1 = Wn but if, during a service epoch, we have x1 = 1, then an incre-\nment (−1, t) ends the current epoch. For the continuous time process, as stated\nearlier: station k closes; the server starts the switch to station i; some station j ,\n1450 MACPHEE, MENSHIKOV, PETRITIS AND POPOV\nselected using the Markov chain {Ir}, opens; given the pair (i, j) a service time\ndistribution G and arrival rates λ are selected using measure νij ; the customers\nwaiting at station i become the initial queue at the server’s new location and dur-\ning the switching time customers arrive at the open stations (i, j) with the selected\nrates. The possible transitions for our embedded process are to states\n(i, j, Gˆ, λˆ;x2 + s, t) with intensity Pijdνij (Gˆ, λˆ)hki(s, t;λ),\nwhere hki(s, t;λ) is the probability of increment se1 + te2, given the arrival rates\nλ, at the transition where the server switches from station k to i.\nIn order to study the stability of the queueing system, we will consider the tra-\njectories of a particle moving according to drift vector fields D related to the para-\nmeter regeneration process. As such vector field or fluid models are quite standard\nin the queueing literature, we will leave details for later and briefly describe now\nonly what we need to state our main results. The one-step mean drifts of ξ , condi-\ntioned on the parameters in the service epochs, form a vector field D0 :\u0004×N → R2\ndefined by\nD0(ω, r) = E(ξn+1 − ξn | ωr) =\n(\nλ1\nµ\n− 1, λ2\nµ\n)\n,(1)\nwhere ωr = (i, j,G,λ1, λ2). The process ξ is homogeneous during each service\nepoch so the mean drift does not depend on queue lengths ξn but only upon\nωr = (ir , ir+1,Gr,λr ), the parameters in epoch r . Our vector field model will\nnot include switching times so we only define the mean drifts for service epochs.\nNow we observe that if a particle starts from position (x,0) and moves across a\nquarter plane in direction D0, then it eventually arrives at point (0, xλ2\/(µ− λ1)).\nThe multiplying ratio that appears here plays a key role in the phenomena we are\ninterested in. For later use we observe that, given open stations (i, j),\nYij ≡ λ2\nµ− λ1 = tan θ,(2)\nwhere θ is the minor angle between D and the vector −e1. We also introduce the\nnotation\nFij (x) = νij [(G,λ1, λ2) :Yij ≤ x] for x > 0\nfor the cumulative distribution function of the slope Yij for each pair of stations\ni, j ∈ Sd = {1,2, . . . , d} with i \u0002= j . For notational convenience, set Fii(x) = 0,\nx < 1 and Fii(x) = 1, x ≥ 1, for all i ∈ Sd .\nRegularity conditions. In order to obtain our results, we have to impose some\nrestriction on the regeneration of parameters and we state these now.\nCONDITION E. For all pairs of distinct stations i, j , there exists m0 > 0, M0 >\nm0 such that:\nA MARKOV CHAIN WITH PARAMETER REGENERATION 1451\n(i) νij [(G,λ) :λ1 +m0 <µ<M0] = 1,\n(ii) Fij\n(\n1\/M0\n)= 0, Fij (M0)= 1.\nPart (i) ensures that the service rate is uniformly bounded from above and be-\nlow and that the server is never trapped at any station forever. Part (ii) limits the\neffect that any single epoch can have on the long term behavior of the process by\npreventing the mean drift vectors D(ω, r) from approaching the axial directions\ntoo closely (so it is a type of uniform ellipticity condition).\nBy observing the vector field model only at parameter regeneration times we\nobtain a multiplicative Markov process of independent interest which we now de-\nfine.\nMultiplicative model. Let (I,X) = {(Ir ,Xr) : r ≥ 0} denote a discrete time\nMarkov process on the state space Sd × R+ (recall that Sd = {1,2, . . . , d}) which\njumps from state (i, x) \b→ (j, αx) with transition measure PijdFij (α) for α > 0.\nThe matrix P = [Pij ] is the transition matrix of an irreducible Markov chain on\nSd and the Fij are a family of distribution functions with support R+ that satisfy\nCondition E(ii). Assuming that the process waits for time x in state (i, x) before\nmaking its next jump, we associate with (I,X) an accumulated time process {Tr}\ndefined by\nT0 = 0 and Tr = Tr−1 +Xr =\nr∑\n1\nXn, r = 1,2, . . . .(3)\nThe sequence of times {Tr} is increasing and so the limit T = limr→∞ Tr exists (in\nsome cases it is infinite) and we call it the total time of the multiplicative model.\n2. The main results. Let π = (π1, π2, . . . , πd) denote the equilibrium distri-\nbution of the open stations Markov chain {Ir}. For each pair i, j ∈ S2d , let Yij be a\nrandom variable with distribution Fij and for any constant s > 0, set\nLi =\nd∑\nj=1\nPijE(logYij ) and Mij (s) = PijE(Y sij ).(4)\nThe d × d matrix M(s) = [Mij (s)] is nonnegative and irreducible because {Ir}\nis irreducible. Hence, M(s) has a Perron–Frobenius eigenvalue η(s) > 0 such that\nη(s) ≥ |ηi(s)| for all other eigenvalues of M(s). The size of η(s) determines which\nmoments of the total time T of the multiplicative model exist, which in turn affects\nthe long term behavior of the random walk ξ .\nIt is important in Theorem 3.1 below to note that\nη′(0) =\nd∑\ni=1\nπiLi.(5)\n1452 MACPHEE, MENSHIKOV, PETRITIS AND POPOV\nWe briefly indicate why this is the case. We have M ′ij (0) = PijE(logYij ) and we\nnote that the matrix M(0) has η(0) = 1 with corresponding left eigenvector π and\nright eigenvector 1. For any fixed s > 0, let u(s) be the left eigenvector correspond-\ning to eigenvalue η(s) of M(s). Scale u(s) so that (π −u(s)) ·1 = 0 (· indicates the\nscalar product). Now, for s small, write u(s) = π + sx, where x · 1 = 0. We note\nthat Mij (s) = Pij (1 + sE(logYij )) + O(s2) and η(s) = u(s)M(s)1(u(s)1)−1 =\nu(s)M(s)1.\nNow we expand u(s)M(s)1 to get\nη(s) = (π + sx)[Pij (1 + sE(logYij ))]1 +O(s2) = 1 + s∑πiLi +O(s2)\nsince xP1 = x · 1 = 0. The relation η(s) = 1 + s∑πiLi + O(s2) immediately\nimplies (5).\nThe multiplicative Markov chain’s time component and our calculations for it\nare key elements of our main results which give stability conditions for the queue\nlength component ξ = {ξn} of the stochastic model (W, ξ). Let ∅ denote the state\n(0,0) where both open queues have no customers and let τ = min{n > 0 : ξn = ∅}\nbe the time until the system first reaches this empty state. In both of the following\ntheorems it is assumed that the measures νij for selecting the parameters at the\nstarts of epochs satisfy Condition E.\nTHEOREM 2.1. (i) If ∑d1 πiLi < 0, then P(τ < ∞) = 1.\n(ii) If ∑d1 πiLi = 0 and switching times are all 0, then P(τ < ∞) = 1.\n(iii) If ∑d1 πiLi > 0, then P(τ = ∞) > 0.\nREMARK. The case where\n∑d\n1 πiLi = 0 and switching times are nonzero is\ndifficult and we do not consider it here. The two station model in this case but with\nconstant, not regenerated, parameters was considered by Menshikov and Zuyev\nin [11]. A detailed classification of a critical random walk on a 2-dimensional\ncomplex, again with a fixed jump distribution on each face, was given by MacPhee\nand Menshikov in [8]. In these papers, generalizations of the results of Lamperti\non processes with asymptotically zero drift (see [6]) were used to establish how the\nbehavior of the process during switching events affects which moments of hitting\ntimes to the empty state exist.\nThe major result in this paper is that we can make refined statements about\nthe tail of the hitting time τ in the recurrent case (i) of the previous result by\ndetermining which moments of τ are finite and which are infinite. The existence\nof moment s of τ requires moment conditions on the service and switching times,\nspecifically that there is some constant Ks such that\n∫∞\n0 x\ns dG(x) <Ks uniformly\nover G ∈ \u0002 and, similarly, ∫∞0 xs dHij (x) < Ks for all pairs of stations i, j .\nTHEOREM 2.2. If ∑d1 πiLi < 0, then:\nA MARKOV CHAIN WITH PARAMETER REGENERATION 1453\n(i) if η(s) < 1 and the sth moments of switching times and service times are\nuniformly bounded by some constant Ks , then E(τ s) < ∞;\n(ii) if η(s) ≥ 1, then E(τ s) = ∞.\nThis result implies that the region of parameter space where the queueing\nprocess ξ exhibits “null-recurrence” can be of considerable volume. It also implies\nthat we have only polynomial ergodicity in the sense that the time of reaching the\nempty state has only finite order moments and the order smoothly changes when\nwe pass from the null recurrent to the positive recurrent case. Note that as long\nas they have sufficient moments, the switching times play no role whatever in the\nresult which is in accord with what is known about the constant parameter polling\nnetwork in the recurrent case; see [5]. The phenomenon of a large null-recurrence\nregion is present even in the case of zero switching times. We now illustrate it with\na simple example before further commenting on it.\nEXAMPLE. There are d = 2 nodes and the arrival rates are λ1 = λ2 = 1 in all\nepochs. When the server is at station 2 service times are always exponential with\nrate 2. At station 1 service times are again exponential, but there are two possible\nservice rates, 5\/4 and 5. Each time the server comes to station 1 it works at the\nsmaller rate with probability p ∈ [0,1] and at the larger rate with probability 1−p.\nThat is, according to our notation,\nν12[(µ,λ) :µ = 2,λ= (1,1)] = 1,\nν21[(µ,λ) :µ = 5\/4,λ= (1,1)] = p,\nν21[(µ,λ) :µ = 5,λ= (1,1)] = 1 − p.\nNow, elementary computations show that L1 = (4p − 2) log 2, L2 = 0, π1 = π2 =\n1\/2 so that\n∑\nπiLi < 0 is equivalent to p < 1\/2. Further, M11(s) = M22(s) = 0,\nM12(s) = 1 and M21(s) = p4s + (1 − p)(1\/4)s so that\nη(s) = [p4s + (1 − p)(1\/4)s]1\/2 and η′(0) = (2p − 1) log 2.\nBy Theorem 2.1, the process is certain to return to the empty state ∅ when∑\nπiLi < 0, that is, p < 1\/2 and has positive probability of never returning when\np > 1\/2. The condition p < 1\/2 implies that η′(0) < 0 and so η(s) = 1 has a root\nsp = log(1 − p)− logplog 4 > 0\nin this case. By Theorem 2.2, E(τ s) is finite when 0 ≤ s < sp , and is infinite when\ns > sp . We see that sp = 1 for p = 1\/5 and, thus, the system is transient for p ∈\n(1\/2,1], null recurrent for p ∈ [1\/5,1\/2) and positive recurrent for p ∈ [0,1\/5),\nso, indeed, we have a “thick” null recurrent phase here.\n1454 MACPHEE, MENSHIKOV, PETRITIS AND POPOV\nIn order to establish stability results for the queueing system, we need vari-\nous Lyapunov functions. We can find them by studying the long term behavior of\nparticles moving according to some random vector field models built using the pa-\nrameter regeneration process and, in particular, the mean drift vector field of the\nprocess ξ over service epochs.\nThe phenomenon of thickness of the critical region implied by the Theorem 2.2\nand exhibited in the previous example is quite exceptional in the theory both of\nstochastic processes and of critical phenomena. This phenomenon appeared in a\nrelated model but with fixed parameters that was studied by Fayolle, Ignatyuk,\nMalyshev and Menshikov [4] (their results also appear in Section 5 of [3]). Their\nmodel is a random walk ξ on a 2-dimensional complex, that is, a collection of\nquarter planes connected at their edges in some fashion with possible multiple\nconnections and with no edge unconnected. On any quarter plane the walk drifts\naway from one axis and toward the other. When the boundary is reached, the quar-\nter plane to enter next is chosen according to a transition matrix P . Specifically,\nTheorem 5.3.2 of [3] establishes recurrence of the Markov chain ξ in a fixed envi-\nronment (which satisfies our Condition E) if and only if the condition ∑i πiLi < 0\nholds (in fact, their result is established also for cases where the transition matrix\nP is not irreducible). Further, Theorem 5.3.4 of [3] shows that under the same reg-\nularity conditions ξ (again with fixed parameters) is positive recurrent if and only\nif η(1) < 1.\nThe new features in this paper are the following: all the parameters in the FIMM\nmodel are known constants, while here they change at each switching event ac-\ncording to some known distributions; moreover, the results in [4] concern only es-\ntimates of E(τ ), while here we have conditions for deciding whether E(τ s) < ∞\nor not for any s > 0. Finally, the phenomenon of thickness of the critical region\nboth in [4] and in the present paper is due to some underlying randomness in the\nchoice of the next set of parameters. In [4] this randomness is due to a Markovian\nchoice of the next complex, analogous to our matrix P = [Pij ]: when this random-\nness is eliminated, the critical region shrinks to a zero measure manifold. In the\npresent paper the thickness persists even when the Markov process induced by the\nmatrix P = [Pij ] becomes a deterministic routing process.\n3. The multiplicative model and the vector field model. We first establish\nour results for the multiplicative model. We then define the random vector field\nmodel and show that our results for the multiplicative model enable us to describe\nits behavior. Using the vector field model, we can define the “random” Lyapunov\nfunction we use to establish our results for the stochastic process (W, ξ).\nLet (I,X) denote the multiplicative model and σA = min{r > 0 :Xr ≤ A} for\nany given constant A > 0. Part of the next result appears in [2] where conditions\nwere found determining when the expected total time of (I,X) is finite.\nTHEOREM 3.1. Suppose that the multiplicative Markov chain (I,X) has dis-\ntributions Fij that satisfy Condition E above:\nA MARKOV CHAIN WITH PARAMETER REGENERATION 1455\n(i) If ∑d1 πiLi < 0, then Xr → 0 a.s. as r → ∞, the total time T of (I,X) is\na.s. finite and for any s > 0 satisfies\nE(T s)\n{\n< ∞, if η(s) < 1,\n= ∞, if η(s) ≥ 1.\n(ii) If ∑d1 πiLi = 0, then, for any A > 0, P(σA < ∞ | X0 = x0) = 1 for anyfinite x0.\n(iii) If ∑d1 πiLi > 0, then Xr → ∞ a.s. as r → ∞.\nREMARK. It is important to note that η(0) = 1 and η is log-convex in s so\nη(s) < 1 for some s > 0 is equivalent to η′(0) = ∑πiLi < 0. If ∑d1 πiLi > 0,\nthen T = ∞ a.s.\n3.1. Proofs for the multiplicative model. We prove first the results about the\nlimiting behavior of the process {Xr} and then establish conditions for the exis-\ntence of E(T s).\nPROOF OF THEOREM 3.1 (Limiting properties of {Xr}). The process\n(I, logX) ≡ {(Ir , logXr) : r ≥ 0}\nis a nonlattice random walk on Sd × R which is homogeneous in its second coor-\ndinate. Its jumps in this coordinate are bounded due to Condition E(ii). As we now\nshow, its stability conditions can be demonstrated using the Lyapunov function\nf (i, x) = ai + logx, where the ai , i = 1, . . . , d , are constants to be determined.\nFor all states (i, x), let\nβi = E(f (Xr+1)− f (Xr) | Ir = i,Xr = x).\nWriting a = (a1, . . . , ad), L = (L1, . . . ,Ld) and β = (β1, . . . , βd), we find that\nβ = −(I −P)a +L, where I denotes the d × d identity matrix. The Markov chain\n{Ir} is irreducible with equilibrium vector π so it follows that the matrix I − P\nhas rank d − 1 and that π is orthogonal to the range of I − P . Hence, by standard\nlinear algebra arguments, for any ε > 0, there exists a such that:\n(i) βi ≤ −ε for each i only when ∑di=1 πiLi < 0;\n(ii) βi = 0 for each i only when ∑di=1 πiLi = 0;\n(iii) βi ≥ ε for each i only when ∑di=1 πiLi > 0.\nApplying Theorem 2.1.7 of [3], we see that logXr → ±∞ a.s. or, equivalently,\nXr → ∞ or 0 a.s. according as to whether ∑di=1 πiLi is positive or negative. If∑d\ni=1 πiLi = 0, then there exist constants ai such that {f (Ir ,Xr)} is a martingale\nwith bounded jumps. By standard results, for example, Theorem 8.4.3 of Meyn\nand Tweedie [12], the process f (I,X) is recurrent and as\n{Xr ≤ A} ⊃ {f (Ir ,Xr) ≤ amin + logA},\nthe a.s. finiteness of σA follows. \u0001\n1456 MACPHEE, MENSHIKOV, PETRITIS AND POPOV\nREMARK. A similar model, a Markov chain on the half-strip Sd × Z+, was\nstudied in Section 3.1 of [3] and we borrowed the Lyapunov function x + ai from\nthere.\nWe now consider the question of the total time of the multiplicative process.\nWe start by restating its definition (3) in a slightly different way. For each pair\n(i, j) ∈ S2d with i \u0002= j , Fij is a distribution function satisfying Condition E. We\nconstruct a sequence of random variables α1, α2, . . . tied to the Markov chain {Ir}\nas follows: when Ir−1 = i, Ir = j , then αr has distribution function Fij . The αi\nare conditionally independent given the state of {Ir}. The total time of the multi-\nplicative model started from state (i,1) is\nT = 1 + α1 + α1α2 + α1α2α3 + · · · = 1 +\n∞∑\nr=1\nr∏\n1\nαn.\nIf\n∑\ni πiLi ≥ 0, then the set of states (i, x) with x ≥ 1 is visited infinitely often and\nthe total time T will be infinite a.s. When\n∑\ni πiLi < 0, we can calculate which\ns > 0 have E(T s) < ∞.\nRecall the d × d matrix M(s) = [PijE(Y sij )]i,j , where Yij has distribution\nfunction Fij . Let vi(s) denote the right eigenvectors and ηi(s) the correspond-\ning eigenvalues of M(s). As E(Y sij ) > 0 for all pairs i, j and {Ir} is irreducible,\nthe results of Perron–Frobenius state there is a simple eigenvalue η(s) > 0 such\nthat η(s) ≥ |ηi(s)| for all other eigenvalues and its eigenvector v(s) has elements\nv(j)(s) > 0 and is the only eigenvector with this property.\nWe start by determining the asymptotic behavior of E(α1 · · ·αn)s .\nLEMMA 3.2. For any s > 0, there exist constants C > 0, γ ∈ (0,1) such that\nlim\nn→∞η(s)\n−n(E(α1 · · ·αn)s) = C +O(γ n).\nPROOF. Let u be the row vector with ui = P(I0 = i) and 1 denote the d-vector\nof 1s. Following the standard argument for establishing the Chapman–Kolmogorov\nconditions, we can write\nE(α1 · · ·αn)s = u(M(s))n1\nand the result follows directly from this for each fixed s using the result of Frobe-\nnius. \u0001\nThis estimate makes it evident that the value of η(s) is crucial to deciding\nwhether E(T s) is finite or infinite.\nPROOF OF THEOREM 3.1 [Conditions for E(T s) = ∞]. The proof that\nE(T s) = ∞ when η(s) > 1 is straightforward. As the αi are a.s. positive, we have\nfor any n\nE(T s) ≥ E(α1 · · ·αn)s.\nA MARKOV CHAIN WITH PARAMETER REGENERATION 1457\nIf η(s) > 1, then E(α1 · · ·αn)s → ∞ as n → ∞ by Lemma 3.2 and so E(T s) = ∞.\nWhen η(s) = 1 and s ≥ 1, we have T s = (∑∞n=1 α1 · · ·αn)s ≥ ∑∞n=1(α1 · · ·αn)s\nand again the result follows from Lemma 3.2.\nWhen η(s) = 1 and s < 1, we can use Jensen’s inequality applied to f (x) = xs\nwhich says that, for any u, v, G, H > 0 and s < 1 with G \u0002= H ,(\nuG+ vH\nu+ v\n)s\n>\nuGs + vHs\nu+ v\nor\n(uG+ vH)s > (u+ v)s−1(uGs + vHs).(6)\nLet Tn = 1 + α1 + α1α2 + · · · + α1 · · ·αn and let tn = E(T sn ). Applying (6) with\nu = 1, v = n−a , G = Tn and H = naα1 · · ·αn+1 where a > 1 is constant, we obtain\ntn+1 = E(T sn+1) = E((Tn + α1 · · ·αn+1)s)\n> (1 + n−a)s−1(E(T sn )+ na(s−1)E(α1 · · ·αn+1)s).\nFrom Lemma 3.2, there exist constants C > 0, γ ∈ (0,1) such that the term\nE(α1 · · ·αn+1)s = C +O(γ n) and so\ntn+1 > (1 + n−a)s−1(tn +Cna(s−1))+O(γ n)\n>\n(\n1 + (s − 1)n−a)(tn +Cna(s−1))+O(γ n)\n= tn + (s − 1)n−atn +C(na(s−1) − (1 − s)na(s−2))+O(γ n),\nwhere (1+n−a)s−1 > 1+ (s − 1)n−a as s < 1. Choose a = (1− s\/2)\/(1− s) > 1\nand for some constant β ∈ (0,C\/s), pick n0 ≡ n0(C, s) such that, for n ≥ n0,\n(1 − s)(βn−a+s\/2 +Cna(s−2))+O(γ n) < (C − βs\/2)n−1+s\/2.\nThis is possible as −a + s\/2 < −1 + s\/2 and a(s − 2) < a(s − 1) = −1 + s\/2. As\ntn > t1 = E(αs1) > 0 for all n, we can choose β ∈ (0, tn0n−s\/20 ). Hence, tn > βns\/2\nfor some n ≥ n0 and for such n,\ntn+1 > βns\/2 +Cn−1+s\/2 − (1 − s)(βn−a+s\/2 +Cna(s−2))+O(γ n)\n> β\n(\nns\/2 + s\n2\nn−1+s\/2\n)\n> β(n+ 1)s\/2,\nso, by induction, tn > βns\/2 for all n ≥ n0. Finally, as T s > T sn for all n, E(T s) =∞.\nConditions for E(T s) < ∞. Now we assume η(s) < 1. If s ≤ 1, then for, any n,\nT s =\n( ∞∑\nn=1\nα1 · · ·αn\n)s\n≤\n∞∑\nn=1\n(α1 · · ·αn)s\nand E(T s) < ∞ by comparison with the tail sum ∑n≥n0 η(s)n.\n1458 MACPHEE, MENSHIKOV, PETRITIS AND POPOV\nIt only remains to sort out the case when s > 1. Again, applying Jensen’s in-\nequality to the function f (x) = xs , we have, for any real numbers u, v, G, H > 0\nand s > 1 with G \u0002= H , (\nuG+ vH\nu+ v\n)s\n<\nuGs + vHs\nu+ v\nor\n(uG+ vH)s < (u+ v)s−1(uGs + vHs).(7)\nFix any β ∈ ((η(s))1\/s,1), and apply (7) with u = 1, v = βn+1, G = Tn, H =\nβ−(n+1)α1 · · ·αn+1 to obtain the inequality\nE(T sn+1) = E\n(\nTn + βn+1 × β−(n+1)α1 · · ·αn+1)s(8)\n≤ (1 + βn+1)s−1(E(T sn )+ βn+1β−s(n+1)E(α1 · · ·αn+1)s).\nFrom the definition of η(s) and, choice of β , it follows that\nlim\nn→∞β\n−s(n+1)E(α1 · · ·αn+1)s = 0.\nAgain, as tn ≥ t1 = E(αs1) > 0 for any n, it follows that there exists n0 such that,\nfor all n ≥ n0,\nβ−s(n+1)E(α1 · · ·αn+1)s ≤ tn.\nNow (8) implies that, for all n ≥ n0,\ntn+1 ≤ (1 + βn+1)s−1(tn + βn+1tn) = (1 + βn+1)stn.\nThus, for any n,\nE(T sn ) ≤ tn0\n∞∏\nm=n0\n(1 + βm+1)s < ∞.\nThat E(T s) < ∞ when η(s) < 1 and s > 1 follows from this bound and the\nmonotone convergence theorem. \u0001\n3.2. Definition and properties of the random vector field model. We now de-\nfine a random vector field model {(S(ω, t),V (ω, t)) :ω ∈ \u0004S, t ≥ 0} using the pa-\nrameter process W . It is motivated by the one-step mean drift vector field defined\nin (1), but we define a more general version so we can consider perturbations of\nthis natural field. This type of model is simple and standard, but we describe it\ncarefully here as we use it to define the random Lyapunov functions we need to\nestablish the properties of the random walk process ξ .\nThere are no switching times in the vector field model. Consider a particle that\nmoves around on S2d × R2+ with velocity field D = {D(ω, r) ∈ R− × R+ :ω ∈\n\u0004S, r ∈ N}, where the D(ω, r) = (−d1(ωr), d2(ωr)) satisfy conditions equivalent\nto Condition E which we now specify.\nA MARKOV CHAIN WITH PARAMETER REGENERATION 1459\nCONDITION E′ . As before, let Fij denote the distribution function of the slope\nY(ω, r) = d2(ωr)\/d1(ωr) and assume that there exists some constants m0, M0\nsuch that\nνij [d1 >m0,‖D‖ <M0] = 1 and that Fij (1\/M0) = 0, Fij (M0) = 1\nfor each pair i, j .\nFor our regenerated parameter process (W, ξ), the natural vector field satisfies\nd1 = 1 − λ1\/µ, d2 = λ2\/µ and we denote it by D0. In this section we are consid-\nering d1 and d2 to be more general functions of the parameters.\nThe process (S,V ) on the state space \u0004e × N × R2+ has components\nS(ω, t) = (ir , ir+1,Gr,λr , r),\nthe parameter set at time t including the current epoch number and\nV (ω, t) = (v1(ω, t), v2(ω, t)),\nthe position of the particle on the quarter plane indicated by the parameter ir at\ntime t . For each parameter sequence ω and initial point (x0,0) with x0 > 0 and\nt0 = 0, set S(ω, t) = S(ω,0) = ω1 = (i1, i2,G1,λ1,1) and\nV (ω, t) = (x0,0)+ tD(ω,1)\nuntil the particle reaches the boundary of quarter plane (i1, i2) which defines the\nend of the current epoch. This occurs at time\nt1 ≡ t1(ω, x0) = x0\nd1(ω1)\n.\nSwitching times are assumed to be 0 in this model so at t = t1 set\nS(ω, t1) = ω2 and V (ω, t1) =\n(\nd2(ω1)\nx0\nd1(ω1)\n,0\n)\n= (x0Y(ω,1),0),\nwhere Y(ω, r) = d2(ωr)\/d1(ωr). The components of V are transposed at t1 as the\nparticle moves from plane (i1, i2) to plane (i2, i3) at that moment, corresponding\nto the server switching stations. For epochs r = 2, 3, . . . , define their end times by\ntr ≡ tr (ω, x0) = tr−1 + v1(ω, tr−1)\nd1(ωr)\n.(9)\nNow, for t ∈ [tr−1, tr ), we set S(ω, t) = ωr and\nV (ω, t) = V (ω, tr−1)+ (t − tr−1)D(ω, r)\nso that v2(ω, t) = d2(ωr)(t − tr−1) and then\nV (ω, tr) = (d2(ωr)(tr − tr−1),0).\n1460 MACPHEE, MENSHIKOV, PETRITIS AND POPOV\nIt is clear from these definitions that, for every parameter sequence ω, the sequence\n{tr} is increasing and so t∅(ω, x0) = limr→∞ tr (ω, x0) exists. Under conditions\nsuch that t∅ is bounded a.s., it is the time taken for the particle to reach the empty\nstate ∅. We now determine conditions which ensure ‖V (ω, t)‖ → 0 and condi-\ntions under which ‖V (ω, t)‖ → ∞ as t → ∞ and then consider the process time.\nThe sequence v1(ω, tr ), r = 1,2, . . . , describes the distance of the particle from\nthe origin at the starts of epochs r + 1. For each r = 1,2, . . . ,\nv1(ω, tr ) = d2(ωr)(tr − tr−1) = d2(ωr)v1(ω, tr−1)\nd1(ωr)\n= v1(ω, tr−1)Y (ω, r)\nand, hence,\nv1(ω, tr ) = x0\nr∏\nn=1\nY(ω,n).(10)\nWe re-iterate at this point that this vector field model is a random process driven by\nthe parameter regeneration process including the Markov chain {Ir} for the server\nlocation. Recall that when In = i, In+1 = j \u0002= i, then Y(ω,n) = d2(ωn)\/d1(ωn)) ∼\nYij with distribution Fij ; π = (π1, π2, . . . , πd) denotes the equilibrium distribu-\ntion of {Ir}; Li = ∑dj=1 PijE(logYij ) for each i. For C > 0, let tC = min{t ≥\n0 :v1(ω, t)+ v2(ω, t) ≤ C}.\nLEMMA 3.3. For the random vector field model (S,V ):\n(i) if ∑di=1 πiLi < 0, then v1(ω, tr ) → 0 a.s. and\nt∅(ω, x0) = lim\nr→∞ tr (ω, x0) < ∞ a.s.,\n(ii) if ∑di=1 πiLi = 0, then P(tC < ∞) = 1,\n(iii) if ∑di=1 πiLi > 0, then v1(ω, tr ) → ∞ a.s. as r → ∞.\nPROOF. The process {(Ir , v1(ω, tr ))}r is a multiplicative Markov process, so\nparts (i) and (iii) follow immediately from Theorem 3.1(i) and (iii). Theorem 3.1(ii)\nimplies that min{r :v1(ω, tr ) < C} is finite ω-a.s. From equation (9) epoch r lasts\nfor time tr − tr−1 = v1(ω, tr−1)\/d1(ωr) which is finite as d1(ωr) ≥ m0 and, hence,\ntC < ∞ a.s. \u0001\nREMARK. As tr (ω, x0) = x0tr (ω,1) for all r and all x0 > 0, it follows that if\nt∅(ω,1) < ∞, then t∅(ω, x0) < ∞ for all x0 > 0.\nNext we recall the Perron–Frobenius eigenvalue η(s) of the matrix M(s) defined\nin (4).\nLEMMA 3.4. Suppose\n∑d\ni=1 πiLi < 0. For s > 0, if η(s) < 1, then E(ts∅) < ∞\nwhile if η(s) ≥ 1, then E(ts\n∅\n) = ∞.\nA MARKOV CHAIN WITH PARAMETER REGENERATION 1461\nPROOF. Combining equations (9) and (10), we obtain\ntr − tr−1 = v1(ω, tr−1)\nd1(ωr)\n= v1(ω, tr )\nd2(ωr)\n= x0\nd2(ωr)\nr∏\nn=1\nY(ω,n)\nfor r = 1, 2, . . . and so\nt∅ =\n∞∑\nr=1\ntr − tr−1 = x0\n∞∑\nr=1\n1\nd2(ωr)\nr∏\nn=1\nY(ω,n).\nUnder Condition E′ for the vector field model, there exists a constant K > 0 (uni-\nformly in ω) such that 1\/K < 1\/d2(ωr) < K a.s. for all epochs r . It follows that\nx0\nK\n∞∑\nr=1\nr∏\n1\nY(ω,n) < t∅(ω, x0) < Kx0\n∞∑\nr=1\nr∏\n1\nY(ω,n).\nThe expression\n∑\nr\n∏\nn Y (ω,n) is the total time for the multiplicative random walk\nassociated with the parameter regeneration process that drives this vector field\nmodel. From Theorem 3.1(i), it follows that E(ts\n∅\n) < ∞ is equivalent to η(s) < 1.\n\u0001\nThe assumptions in Condition E′ ensure this construction can be carried out\nfor indefinitely many epochs for all parameter sequences from any initial particle\nposition x with x > 0 in any epoch r . To indicate this, we denote the switching\ninstants defined above by tn(ω, r,x) for n ≥ r . Under the condition∑di=1 πiLi < 0,\nit follows that t∅(ω, r,x) = limn→∞ tn(ω, r,x) < ∞ and is the time taken by the\nparticle to reach 0 from initial point x in epoch r . In this case, for any constant\nA> 0,\ntA(ω, r,x) = min{t :V (t) ∈ BA,S(0) = ωr,V (0) = x} < ∞ a.s.,(11)\nwhere BA = {x ∈ R2+ :x + y ≤ A}.\n4. Lyapunov functions and their properties. Now we return to studying\n(W, ξ), the random walk together with its regenerated parameter process. We\nuse the vector field model to construct Lyapunov functions along each parame-\nter sequence ω and then take expectations over the parameter process to estab-\nlish Theorems 2.1 and 2.2. We outline the simplest case of our scheme now to\nhelp explain this general argument. Let Eω denote expectation for the random\nwalk conditioned on the parameter sequence ω, let (rn, ξn) denote the epoch and\nqueue lengths at time n and let τA = min{n : ξn ∈ BA}. For the natural vector field\nD0(ω, r) ≡ (−d01 (ω, r), d02 (ω, r)) = (λr,1\/µr − 1, λr,2\/µr) consider the function\ntA defined in (11). For ω such that tA is finite and for x \/∈ BA,\nEω\n(\ntA(ω, r, ξn+1)− tA(ω, r, ξn) | ξn = x)= −1.(12)\n1462 MACPHEE, MENSHIKOV, PETRITIS AND POPOV\nIn the case where switching happens instantaneously, Foster’s criterion (see Theo-\nrems 2.1.1 and 2.2.3 of [3]) implies that\nEω(τA | ξ0 = x0) < tA(ω,1,x0) < ∞\nand it follows, by taking expectation over \u0004S and using Lemma 3.4 with s = 1,\nthat E(τA | ξ0 = x0) < ∞ whenever η(1) < 1.\nWe see from this that, during epoch r , tA(ω, r, ·) based on D0 is a random\n(ω-dependent) Lyapunov function for establishing stability (E(τA) < ∞) of the\nqueue length process ξ . Our plan is to show that when E(tsA) < ∞ (conditions for\nthis are given in Lemma 3.4), then E(τ sA) < ∞. However, a stronger result than\nFoster’s is necessary to decide whether E(τ sA) < ∞ for given s > 1 (see The-\norem 5.3 below). This result requires stronger bounds, than (12). To get these\nstronger bounds we actually have to use tA from a vector field which is a mod-\nification of D0. It is also necessary to handle nonzero switching times.\nTo establish which moments of τA are infinite, a different approach is needed.\nWe show that for almost all parameter sequences ω there is some probability,\nβ > 0, say, that the random walk takes time comparable with the vector field to\nreach BA. This β is uniform over ω, so we can take expectation over \u0004S to show\nthat E(tsA) = ∞ implies E(τ sA) = ∞.\n4.1. Modified vector fields and Lyapunov functions. Consider the set of par-\nticle trajectories, under a vector field D, from all possible initial points on the e1\naxis in epoch 1. For any parameter sequence ω, any point (r,x) ∈ N × R2+ lies on\na unique such trajectory.\nDEFINITION 4.1. For a vector field D satisfying Condition E′, we define two\ndistinct Lyapunov functions. For each parameter sequence ω, define\ng :\u0004S × N × R2+ → R+ by g(ω, r,x) = γ,\nwhere γ is such that the trajectory under D(ω, ·), started from (1, γ e1), passes\nthrough the point (r,x), that is, g is constant along particle trajectories under the\nvector field D. On\nF = {ω ∈ \u0004S : t∅(ω,1, e1) < ∞},\nthe set of parameter sequences for which t∅ is everywhere finite, define f :F ×\nN × R2+ → R+ by\nf (ω, r,x) = tA(ω, r,x) where A> 0 is a given constant.\nWe will need to consider expectations Eω of f and g as functions of the random\nwalk ξ for given ω and, subsequently, with respect to the measure on the parameter\nsequences.\nA MARKOV CHAIN WITH PARAMETER REGENERATION 1463\nREMARK. For any given ω, the functions f and g are linear within epochs\nand we consider their properties for general vector fields D. We will call f the\nremaining life, as it is the time for the particle to reach BA = {x ∈ R2+ :x + y ≤ A}\nfrom initial point x in epoch r along the trajectory defined by the vector field\nD for the parameter sequence ω ∈ F . Similarly, we will call g the initial value\nfunction and observe that it is everywhere finite for a.s. all ω for any D satisfying\nCondition E′.\nIn particular, we will use f for establishing that specified moments of the ran-\ndom time τA = min{n : ξn ∈ BA} exist, g for establishing instability and f and g\ntogether for showing nonexistence of certain moments of τA. We now describe\nsome of their properties.\nLEMMA 4.2. If vector field D has ∑i πiLi < 0, then P\u0004(F) = 1. For fixed ω,\nthe functions f (for ω ∈ F ) and g are linear in x for fixed r and continuous at\nchanges of epoch r . Writing:\n(i) f (ω, r,x) = arx1 + brx2 + f0 for ω ∈ F (ar , br and f0 are functions of\nω), we have:\n• ar = br−1 for each r and there exists M > 0, uniform in ω and r , such that\nbr\/M ≤ ar ≤ Mbr ,\n• φr ≡ max{ar, br} ≥ 1\/M0 (the constant in Condition E′),\n• f (ω, r,x) ≥ (x1 + x2)\/M0;\n(ii) g(ω, r,x) = crx1 + cr+1x2, we have:\n• cr+1 = cr\/Y (ω, r) for each r and, hence, cr\/cr+1 = Y(ω, r) ∈ (1\/M0,M0) for\nall epochs r ,\n• cr ∏r−1n=1 Y(ω,n) = c1 for all r .\nPROOF. P\u0004(F) = 1 is the content of Lemma 3.3(i). That f , for ω ∈ F , and g\nare linear in x for fixed r and continuous at changes of epoch r follows from the\nvector field D being constant during epochs.\nThe properties of f for ω ∈ F follow from Condition E′ which constrains d1\nand d2 and the relations ar(x1 − d1) + br(x2 + d2) = arx1 + brx2 − 1 or, equiva-\nlently, 1 + brd2(r) = ard1(r) for each r . The lower bound on f is immediate. The\nrelations satisfied by the cr follow similarly. \u0001\nUnfortunately, ar and br , the x-coefficients of f within an epoch, can be arbi-\ntrarily large, so the level curves of f (ω, r, ·) (constructed under D0) in the x-plane\ncan make an arbitrarily small angle with the natural drift direction D0(ω, r) of\n{ξn}. This prevents us making the estimates needed to establish which hitting time\nmoments exist if we construct f with respect to field D0.\n1464 MACPHEE, MENSHIKOV, PETRITIS AND POPOV\nModified vector fields. To resolve this problem, we construct modified vector\nfields (small perturbations of the natural vector field D0) for which f and g per-\nmit some useful estimations. We do this in different ways for showing whether\nE(τ sA) < ∞ or not.\nTo show that E(τ sA) < ∞, we want a vector field D such that its remaining life\nf is greater than that of D0 but is still finite a.s. and for which moment s of f\nexists. When we want to show that E(τ sA) = ∞ for some s, we use a different\nmodification of D0 and the initial value function g.\nDEFINITION 4.3. As in equation (2), we write\nθ0(ω, r) = arctan[λ2(ω, r)\/(µ(ω, r)− λ1(ω, r))]\nfor the minor angle between D0(ω, r) and −e1. We define\nD+(ω, r) ≡ (−d+1 (ωr), d+2 (ωr))(13)\n= ‖D0(ω, r)‖(− cos(θ0(ω, r)+ θ ′), sin(θ0(ω, r)+ θ ′))\nfor some θ ′ > 0 such that θ0(ω, r) + θ ′ < π\/2 for all pairs ω, r . We will say that\nsuch a D+ is uniformly above D0. We further define\nD−(ω, r) ≡ (−d1(ωr), d2(ωr))(14)\n= ‖D0(ω, r)‖(− cos(θ0(ω, r)− θ ′), sin(θ0(ω, r)− θ ′))\nfor some sufficiently small θ ′ > 0. In this case we say that D− is uniformly be-\nlow D0.\nThis definition is possible, as, by Condition E,\nθ0(ω, r) ∈ (arctanm0\/M0, arctanM0\/m0) ⊂ (0, π\/2).\nClearly, there are ω for which the remaining life under D0 is finite, but under\nD+ it becomes infinite. In fact, the set of these has zero probability for some suit-\nably small θ ′ as we now show. Let M+(s), M0(s) and M−(s) denote the matrix\n[PijE(Y sij )] under the vector fields D+, D0 and D− respectively and let η+(s),\nη0(s) and η−(s) denote the Perron–Frobenius eigenvalues of these matrices. Also,\nfor each station i, let L0i =\n∑d\nj=1 PijE(logYij ) under D0 and L\n−\ni the same quanti-\nties under D−.\nLEMMA 4.4. For any given s > 0, we can choose θ ′ > 0 small enough that:\n(i) if η0(s) < 1, then η+(s) < 1;\n(ii) if η0(s) > 1, then η−(s) > 1;\n(iii) if ∑i πiL0i > 0, then ∑i πiL−i > 0\n(θ ′ does not depend upon ω).\nA MARKOV CHAIN WITH PARAMETER REGENERATION 1465\nREMARK. When\n∑\ni πiL\n0\ni < 0 and θ ′ is chosen to satisfy condition (i) or (ii),\nwe say that D+ or D− respectively is s-neutral.\nPROOF OF LEMMA 4.4. For the vector field D+, we have Yij = d+2 \/d+1 =\ntan(θ0 + θ ′) when ωr = (i, j,G,λ). As the function tan is continuous on (0, π\/2)\nand η+(s) is a continuous function of M+(s), it follows that η+(s) is continuous\nin θ ′. Part (i) follows as Condition E bounds the rate of change of η+(s) in θ ′ and\nparts (ii) and (iii) follow from a similar argument. \u0001\nThe advantage of working with D+ rather than D0 is that the expected one-step\njumps of the process {f (ω, rn, ξn)}n are of size comparable to φr where, as before,\nf (ω, r,x) = arx + bry +f0 and φr = max{ar, br}. Let \u0011fn = f (ω, rn+1, ξn+1)−\nf (ω, rn, ξn) and \u0011gn = g(ω, rn+1, ξn+1)− g(ω, rn, ξn).\nLEMMA 4.5. Suppose that D+ lies uniformly above D0 and is s-neutral\nfor some s > 0. Let f denote the remaining life of D+. Then F+ = {ω ∈\n\u0004S :f (ω,1, e1) < ∞} satisfies P\u0004(F+) = 1 and for each ω ∈ F+ and any ser-\nvice epoch r ,\nE(f (ω, r,x)s) < ∞\nand there exists ε1 > 0 such that\nEω(\u0011fn | rn = r, ξn = x) = −ard01 (ω, r)+ brd02 (ω, r) ≤ −ε1φr,\nwhere φr ≥ 1\/M0. Similarly, the initial value function g of a vector field D− which\nis uniformly below D0 satisfies\nEω(\u0011gn | rn = r, ξn = x) = −crd01 (ω, r)+ cr+1d02 (ω, r) ≥ ε2cr\nfor some ε2 > 0 which does not depend upon r and there exists a constant κ > 0\nsuch that\nEω(\u0011g2n | rn = r, ξn = x) ≤ c2r κ.\nPROOF. P(F+) = 1 and E(f (ω, r,x)s) < ∞ follow immediately from\nLemma 3.4 applied to the vector field D+.\nLet β , β+ denote the angles between the vector (ar , br) and D0, D+ respec-\ntively. By comparison with (12), we see that β > π\/2 and, by construction, there\nexists θ ′ > 0 such that β+ = β + θ ′. The inequality for E(\u0011fn) follows from the\ncomparability of ar and br , φr ≥ 1\/M0 (from Lemma 4.2), ‖D0‖ ≥ m0 and the\ncosine rule.\nThe inequality for E(\u0011gn) follows from a very similar argument, while the\nexistence of the constant κ for bounding E(\u0011g2n) follows from the restriction on the\nrates λ imposed by Condition E and the assumption that service time distributions\nG are selected from a set \u0002 with uniformly bounded second moments. \u0001\n1466 MACPHEE, MENSHIKOV, PETRITIS AND POPOV\n5. Proofs for the polling system. We are now in a position to establish The-\norems 2.1 and 2.2. Our treatment of the vector field model in the previous sections\nignored switching times, but we must now consider them.\n5.1. Technique for handling switching times. Our main method is to observe\nthe process not at all transitions, but at carefully calculated sampling times. The-\norem 5.1 below states the semi-martingale result from Fayolle, Menshikov and\nMalyshev [3] which we will use to establish the recurrence part of Theorem 2.1.\nLet {Zt, t ≥ 0} be a sequence of nonnegative random variables with Z0 constant\nand Zt measurable with respect to a filtration F = {Ft , t ≥ 0}. Let {Nn,n ≥ 0} be\na strictly increasing sequence of stopping times adapted to F such that N0 = 0\nand |Nn+1 − Nn| is bounded for all n ≥ 0. Define a sampled process {Xn,n ≥ 0}\nby X0 = Z0 and Xn = ZNn for n ≥ 1. Also, for constant C > 0, let ζC = min{t ≥\n1 :Zt ≤ C} and σ = min{n ≥ 1 :Xn ≤ C}. Finally, let {Xt∧σ } denote the sequence\n{Xt } stopped at σ . With this notation, we now state Theorem 2.1.2 of [3].\nTHEOREM 5.1. If Z0 >C and for some ε > 0 and all n ≥ 0\nE\n(\nX(n+1)∧σ | FNn∧σ\n)≤ Xn∧σ − εE(N(n+1)∧σ −Nn∧σ | FNn∧σ ) a.s.,\nthen E(ζC) ≤ Z0\/ε < ∞.\nTo use this result, we will calculate in the proof of Theorem 2.1 a constant N\nsuch that the inequality of this theorem is satisfied N steps after any switching\ntime.\n5.2. A key supermartingale for the instability results. We now show that the\nlevel curves of the initial value function g of D− form a useful barrier for the\nrandom walk ξ . For each ω ∈ \u0004, K > 0, let\nGK(ω) = {(r,x) ∈ N × R2+ :g(ω, r,x) ≤ K}(15)\ndenote the set of states below the trajectory of D− with initial value K . Let\nρK(ω) = min{n : (rn, ξn) ∈ GK(ω)}\ndenote the hitting time of the random walk to GK (rn denotes the epoch in which\nstep n of ξ occurs). We recall that BA = {x ∈ R2+ :x + y ≤ A}.\nLEMMA 5.2. Let g denote the initial value function of vector field D− and let\nτA denote the hitting time of BA by ξ . Let Zn = g(ω, rn, ξn) for n ∈ N and suppose\nthat Z0 = z0 for some constant z0 > A. Define Un = 1\/Zn∧τA for n = 1, 2, . . . .\nIf A is sufficiently large, then, for every epoch r and every parameter sequence ω,\nEω(Un+1 −Un | rn = r, ξn = x) < 0\nand, hence, U∞ exists a.s.\nA MARKOV CHAIN WITH PARAMETER REGENERATION 1467\nPROOF. Taylor’s theorem applied to the function (1 + x)−1 provides the in-\nequality\n(1 + x)−1 − 1 < −x + x2(1 − t0)−3 at any x > −t0 > −1.\nWrite Zn = z, rn = r and consider ξn = x \/∈ BA. From Lemma 4.2(ii), we have\nz ≥ crA\/M0 and either \u0011gn = Zn+1 − Zn ≥ 0 or 0 < −\u0011gn ≤ cr . In either case\n\u0011gn\/z ≥ −M0\/A > −1 for A > M0. It now follows from Lemma 4.5 and the\nassumption cr\/z ≤ M0\/A that\nEω(Un+1 −Un | ξn = x) = 1\nz\n(\nEω\n( 1\n1 +\u0011gn\/z\n∣∣∣ ξn = x\n)\n− 1\n)\n<\n1\nz\nEω\n(\n−\u0011gn\nz\n+ (1 −M0\/A)−3 \u0011g\n2\nn\nz2\n∣∣∣ ξn = x\n)\n< −ε2M0\nzA\n+ (1 −M0\/A)−3 κM\n2\n0\nzA2\n.\nThe right-hand side can be made negative by choosing A sufficiently large. There-\nfore, along any given parameter sequence, the process (Un) is a bounded super-\nmartingale which guarantees the existence of U∞. \u0001\n5.3. Proof of Theorem 2.1. (i) We wish to show that τ , the return time to the\nempty state ∅, is a.s. finite under the condition\n∑\ni πiLi < 0. Consider a vector\nfield D+ which is uniformly above D0 and s-neutral for some s > 0. As before,\nwe denote the remaining life of D+ by f and let F denote the set of parameter\nsequences where f is a.s. finite for all points (r,x). For each ω ∈ F , Lemma 4.5\nimplies\nEω\n(\nf (ω, r, ξn+1)− f (ω, r, ξn) | ξn = x)≤ −ε1φr ≤ −ε1\/M0\nduring service epochs. During switching times, the queue lengths have drift up-\nward so this inequality does not hold. Let Tr−1 denote the time at which the event\nwhich concludes epoch r − 1 occurs. Then\nEω\n(\nf (ω, r, ξn+1)− f (ω, r, ξn) | ξn = x, Tr−1 = n,ωr = (i, j,G,λ))\n= (arλ1 + brλ2)mij > 0,\nwhere mij is the mean switching time from station i to j . To employ Theo-\nrem 5.1, we choose ε1 > 0 according to Lemma 4.5, ε′ ∈ (0, ε1) and an integer\nN ≥ 2M0m∗\/(ε1 − ε′), where m∗ = maxij mij . As long as x = (x, y) has x > N ,\nEω\n(\nf (ω, r, ξn+N)− f (ω, r, ξn) | ξn = x, Tr−1 = n,ωr = (i, j,G,λ))(16)\n≤ φr [(λ1 + λ2)m∗ − ε1N] < −ε′φrN ≤ − ε\n′\nM0\nN\nas φr = max(ar , br) ≥ 1\/M0 and λ1 + λ2 ≤ 2M0 by Condition E.\n1468 MACPHEE, MENSHIKOV, PETRITIS AND POPOV\nNow we apply Theorem 5.1 to Zn = f (ω, rn, ξn), with C chosen so that τA, the\ntime {ξn} hits BA, satisfies τA < ζC (the time {Zn} falls to level C). This is possible\nbecause, by Lemma 4.2, f (ω, r,x) ≥ ‖x‖\/M0, that is, ‖x‖ large implies f large.\nHence,\nEω(τA | ξ0 = x) < f (ω,0,x)M0\nε′\n< ∞\nfor each ω ∈ F and this in turn implies that the process ξ enters BA infinitely often\nalong almost all parameter sequences. Our process is not irreducible in the normal\nsense, as it is not possible to reach the empty state ∅ in epoch r from state (r,x),\nwhere x = (x, y) with y > 0. However, it is possible to reach ∅ in epoch r + 1\nand the probability of this is bounded away from 0 uniformly in ω (the bound does\ndepend upon A and M0). Hence, by Borel–Cantelli, we have τ < ∞ a.s.\n(ii) Here ∑πiLi = 0. Again, we use f to denote the remaining time for the\nvector field model, but this time with the natural field D0. We have from Lemma 4.2\nthat f is finite a.s. and from the inequality (12), we know that for each parameter\nsequence ω ∈ F the process (f (ω, rn, ξn))n is a supermartingale (remember that\nwe only consider instantaneous switching in this case). Now, from standard results,\nit follows that τA is a.s. finite for every ω ∈ F . That τ is a.s. finite follows as in\npart (i).\n(iii) We have ∑πiLi > 0 and we wish to show that τ = ∞ with positive proba-\nbility. Consider the initial value function g for a vector field D− uniformly below\nD0 but with\n∑\ni πiL\n−\ni > 0. We know from Lemma 3.3(iii) and Lemma 4.2(ii) that,\nfor almost all parameter sequences ω, the x-coefficients cr of g in epoch r con-\nverge to 0 as r → ∞. For such ω and for any given constants A > 0 and K ′ > 0,\nthere exists r0 such that [recall (15)] the set (r,BA) ⊂ GK ′(ω) for all epochs\nr ≥ r0. For any fixed parameter sequence ω, the process ξ is certain to reach\nsome state (r ′,x′) \/∈ GK ′(ω) where r ′ ≥ r0. Let K = g(ω, r ′,x′). Starting from\n(r ′,x′), ρK ′ ≤ τA a.s. by construction but, as we now show, ρK ′ < ∞ a.s. is impos-\nsible. The conditions of Lemma 5.2 hold from which we get Eω(U∞) ≤ 1\/K ,\nbut if ρK ′ < ∞ a.s., then U∞ ≥ 1\/K ′ > 1\/K a.s. As U∞ ≥ 0, it follows that\nPω(τA = ρK ′ = ∞) ≥ 1 −K ′\/K > 0 for almost all ω.\nREMARK. Another way to describe the idea in part (iii) of the proof above\nis to say when (r,BA) ⊂ GK ′ for all epochs r there is some probability β > 0\n(uniform over parameter sequences ω) such that Pω(ξn \/∈ GK ′ for all n) > β , that\nis, if the vector field D− has trajectories that remain outside GK ′ , then the random\nwalk ξ can stay outside GK ′ indefinitely.\n5.4. Semimartingale estimates for Theorem 2.2(i). We now state the key result\nwe use for establishing finiteness of moments of hitting times to the neighborhood\nof the empty state. It is a slight extension of Theorem 1 of [1]. This, in turn, is\nthe generalization to general powers s of Theorem 2.2 of [7] (a similar result for\ninteger moments only).\nA MARKOV CHAIN WITH PARAMETER REGENERATION 1469\nTHEOREM 5.3. Let K > 1, (\u0004, (Fn)n,P) be a filtered probability space and\n(Zn)n∈N an (Fn)n-adapted positive valued process with Z0 = z ≥ K . Let σK =\ninf{n ≥ 1 :Zn ≤ K}, σ ′ an arbitrary (Fn)n-stopping time and σ = inf{σK,σ ′}.\nSuppose that there exists s0 > 0 such that, for every n ∈ N, we have E(Zs0n ) < ∞.\nIf there exists ε2 > 0 such that\nE(Zs0n+1 −Zs0n | Fn) ≤ −ε2Zs0−1n on {σ > n},\nthen, for all s ≤ s0, there exists C = C(s0, ε2) such that E(σ s | Z0 = z) ≤ Czs .\nREMARK. If we try to apply this result to Zn = f (ω, rn, ξn), where f is the\nremaining life of the natural field D0, the condition of the theorem is not generally\nsatisfied. This is why we have to introduce the modified field D+.\nPROOF OF THEOREM 5.3. Straightforward extension (to deal with the intro-\nduction of σ ′) of the corresponding proof of Theorem 1 of [1]. \u0001\nThe following result establishes the key inequality for the application of The-\norem 5.3 under a condition on η0(s), the Perron–Frobenius eigenvalue of M0(s)\nwhich was considered in Lemma 4.4. As in the proof of Theorem 2.1(i), it is nec-\nessary to sample the process at carefully chosen times to deal with the absence of\nservice during switching times.\nPROPOSITION 5.4. Suppose that η0(s0) < 1 for some s0 > 0 and let D+ be\nuniformly above D0 and s0-neutral. Write Zn = f (ω, rn, ξn) for all ω ∈ F , where\nf denotes the remaining life under D+. Then for such ω and all s < s0, there exists\nε2 > 0 such that at times n which are not switching times and for ‖x‖ sufficiently\nlarge,\nEω(Zsn+1 −Zsn | rn = r, ξn = x) ≤ −ε2Zs−1n .\nPROOF. Letting z = Zn = f (ω, r,x), we have, for ‖x‖ (and, hence, z) large,\nby Lemma 4.2, 1\/C‖x‖ ≤ φr\/z ≤ C\/‖x‖ for some C > 0 which is uniform in ω.\nWriting \u0011fn = f (ω, rn+1, ξn+1)− f (ω, rn, ξn), we have\nEω(Zsn+1 −Zsn | rn = r, ξn = x) = Eω\n(\n(z +\u0011fn)s − zs | rn = r, ξn = x)\nand from Taylor’s theorem,\n(z +\u0011fn)s = zs + s\u0011fnzs−1 + s(s − 1)\n∫ 1\n0\n(\u0011fn)\n2(z + t\u0011fn)s−2(1 − t) dt.\nAs \u0011fn ≥ −φr , when rn = r , we have, for t ∈ [0,1],\n(z + t\u0011fn)s−2 ≤ zs−2\n(\n1 − φr\nz\n)s−2\nif s ≤ 2\n1470 MACPHEE, MENSHIKOV, PETRITIS AND POPOV\nand so, from Lemma 4.5,\nE(Zsn+1 −Zsn | rn = r, ξn = x) ≤ φr\n(\n−sε1 +C1s(s − 1)φr\nz\n)\nzs−1,\nwhere C1 > 0 is some constant which is uniform in ω.\nFor s > 2, we have\n(z + t\u0011fn)s−2 ≤\n{\nzs−2(1 + t)s−2, if \u0011fn ≤ z,\n(\u0011fn)\ns−2(1 + t)s−2, if \u0011fn > z.\nThe assumption of a uniform bound Ks on moment s of the service time distri-\nbution implies there is some constant C′ such that Eω(\u0011f sn | rn = r, ξn = x) ≤\nφsrC\n′Ks and, hence, Eω(\u0011f sn I {\u0011fn > z} | rn = r, ξn = x) = O(φsr ). In this case,\nfor ‖x‖ large enough, there exists some C1 > 0 (uniform in ω) such that\nE(Zsn+1 −Zsn | rn = r, ξn = x) ≤ φrzs−1\n(\n−sε1 +C1s(s−1)φr\nz\n+O((φr\/z)s−1)\n)\n,\nagain using Lemma 4.5.\nFinally, for any given s > 2 and any ε2 with 0 < ε2 < sε1, we can choose ‖x‖\nlarge enough that −sε1 + C1s(s − 1)φrz + O((φr\/z)s−1) < −ε2. The argument is\nsimilar for s ≤ 2. This establishes the result as φr ≥ 1\/M0. \u0001\nPROOF OF THEOREM 2.2(i). As in Proposition 5.4, we consider the process\nf (ω, rn, ξn) where f is the remaining life under a vector field D+ which\nis uniformly above D0 and s-neutral. It follows from E(f (ω, r,x)s0) < ∞\n(Lemma 4.5) and the fact that Eω((ξn1 + ξn2)s) < ∞ for all ω, s > 0 and all n\nthat E(f (ω, rn, ξn)s) < ∞ for all s ∈ [0, s0] and all n.\nTo deal with switching times, we sample this process at times Nn where Nn+1 −\nNn = 1 unless Nn is the end of an epoch, in which case Nn+1 − Nn = N for\nsome constant N to be determined. This makes it necessary to introduce modified\nversions of the hitting times for which we wish to make moment estimates.\nLet Zn = f (ω, rNn, ξNn), σ˜K = inf{n ≥ 1 :Zn ≤ K}, τ˜A = inf{n ≥ 1 : ξNn ∈ BA}\nfor suitably large A and σ˜ = min{σ˜K, τ˜A}. For Z0 = z > K for some sufficiently\nlarge constant K , we have, by Proposition 5.4,\nEω(Zsn+1 −Zsn | rn = r, ξn = x) ≤ −ε2Zs−1n on {σ˜ > n}(17)\nas long as jump Nn is not a switching event. If the server switches queues at time\nNn, then\nZn+1 = Zn + f (ω, rNn + 1, ξNn+N − ξNn).\nBy the argument leading to the inequality (16), we have, for large enough N (but\nξNn > N to ensure there is no change of epoch),\nE\n(\nf (ω, rNn + 1, ξNn+N − ξNn) | FNn\n)∝ −N.\nA MARKOV CHAIN WITH PARAMETER REGENERATION 1471\nUsing this together with the moment bound assumed above, it follows that, for\ngiven ε2, there exists N such that the bound (17) also holds when the jump at time\nNn is a switching event.\nHence, by Theorem 5.3, there exists a constant C such that Eω(σ˜ s | Z0 = z) <\nCzs uniformly over ω ∈ F . We can choose A> KM0 which ensures that τ˜A ≤ σ˜K\na.s. and, hence, for x \/∈ BA,\nE(τ˜ sA | ξ0 = x) = E(σ˜ s | Z0 = z)\n= E(Eω(σ˜ s | Z0 = z))\n≤ CE(f (ω,1,x)s) < ∞.\nTo complete the proof, let τA = inf{n ≥ 1 : ξn ∈ BA} for suitably large A (so τA\nis measured in process time n rather than the sampling sequence {Nn}) and recall\nthat τ = inf{n ≥ 1 : ξn = ∅}. Observe that τA < Nτ˜A so that E(τ sA | ξ0 = x) < ∞.\nFinally, by a standard argument, for example, Theorem A.1 from [10], it follows\nthat E(τ s | ξ0 = x) < ∞ for all finite x. \u0001\n5.5. Proof of Theorem 2.2(ii), nonexistence of moments. We start this proof\nby showing that, with a probability that can be bounded away from 0 uniformly\nfor all parameter sequences, the random walk started outside GK stays outside GK\nat least until it hits BA.\nPROPOSITION 5.5. Suppose that η0(s0) < 1 for some s0 > 0 and that g is\nthe initial value function of an s-neutral vector field D−. For any given parameter\nsequence ω, suppose that the queue length process ξ starts at state (r,x) such\nthat g(ω, r,x) = K and x \/∈ BA for A large enough to satisfy the conditions of\nLemma 5.2. For 1 <K ′ <K ,\nPω(ρK ′ ≥ τA) ≥ 1 − K\n′\nK\n> 0.\nPROOF. As η0(s0) < 1, Theorem 2.1(iii) implies that τA is a.s. finite. Con-\nsider the process Un = 1\/g(ξn∧τA∧ρK′ ). By Lemma 5.2, (Un) is a positive super-\nmartingale. Therefore, the limit U∞ exists almost surely and its law is supported\nby [0,1] as K ′ > 1. Moreover, by Fatou’s lemma,\n1\nK\n= Eω(U0) ≥ Eω(U∞)\n= 1\nK ′\nPω(ρK ′ < τA)+ Eω(UτA | ρK ′ ≥ τA)Pω(ρK ′ ≥ τA)\nas τA is a.s. finite. Hence, Pω(ρK ′ < τA) ≤ K ′K < 1 by the initial choice of K and\nK ′ and (Un) being nonnegative. Thus, Pω(ρK ′ ≥ τA) ≥ 1 − K ′K > 0. \u0001\n1472 MACPHEE, MENSHIKOV, PETRITIS AND POPOV\nPROOF OF THEOREM 2.2(ii). We have η0(s) > 1 and η0(s0) < 1 for some\ns0 < s. Hence, the remaining life f of vector field D− (uniformly below D0) is a.s.\nfinite. As f and the initial value function g of D− are both linear within epochs,\ng can be scaled so that g(ω,1, xe1) = f (ω,1, xe1) for all x > 0. Starting ξ from\nstate (r,x) with g(ω, r,x) = K > K ′ and applying Proposition 5.5, we see that\nPω(ρK ′ ≥ τA) ≥ 1 −K ′\/K > 0 uniformly over all ω.\nWe now show that on the event {ρK ′ ≥ τA} the random walk takes such a long\ntime to reach BA that the s0 moment of τA cannot be finite. The event {ρK ′ ≥ τA}\ncan only happen when (i) there is an epoch rˆ where (rˆ,BA) is not a subset of GK ′ ,\nthat is, where the D− trajectory {g(ω,S(t),V (t)) : t ≥ 0, g(ω,S(t),V (t)) = K ′}\nenters BA during epoch rˆ ; (ii) the random walk does not enter GK ′ prior to epoch rˆ .\nFor fixed ω and K ′, suppose the random walk starts from ξ0 = (x0,0) in epoch 1\nwith g(ω,1, x0e1) > K ′. Let the random times T1, T2, . . . denote the ends of the\nepochs (for the random walk, not the dynamical system) up to epoch rˆ − 1. On the\nevent {ρK ′ ≥ τA} we have\nf (ω,1, x0e1) ≤\nrˆ−1∑\nr=1\ntr − tr−1 +AM0\/m0,\nwhere, in the notation of Section 3.2, the tr are the epoch endtimes for a parti-\ncle moving according to the vector field D− and the bound AM0\/m0 on the final\nepoch’s contribution to f (ω,1, x0e1), the time for the particle trajectory to reach\nBA, is obtained from Condition E with some obvious geometry. Recalling the no-\ntation v1(ω, tr−1) for the particle position at the start of epoch r (for the dynamical\nsystem) and writing Xr−1 for the queue length at the start of epoch r (for the ran-\ndom walk), we have, for each epoch r < rˆ ,\nTr − Tr−1 ≥ Xr−1 > v1(ω, tr−1),\nas only one job can complete in each service time and, by assumption, the random\nwalk does not enter GK ′ . From\nv1(ω, tr−1) = d1(tr − tr−1) ≥ m0(tr − tr−1),\nwe have\nτA > Trˆ−1 =\nrˆ−1∑\nr=1\nTr − Tr−1 >\nrˆ−1∑\nr=1\nv1(ω, tr−1) ≥ m0\nrˆ−1∑\nr=1\ntr − tr−1\n≥ m0f (ω,1, x0e1)−AM0\non all random walk trajectories such that τA ≤ ρK ′ .\nFinally, as η−(s) > 1, for any initial vector x \/∈ BA for A sufficiently large,\nE(τ sA | ξ0 = x) ≥ (1 −K ′\/K)ms0E\n([f (ω,1,K ′e1)−AM0]s)= ∞,\nwhere the final equality follows from Lemma 3.4 applied to the vector field D−.\n\u0001\nA MARKOV CHAIN WITH PARAMETER REGENERATION 1473\nREFERENCES\n[1] ASPANDIIAROV, S., IASNOGORODSKY, R. and MENSHIKOV, M. (1996). Passage-time mo-\nments for nonnegative stochastic processes and an application to reflected random walks\nin a quadrant. Ann. Probab. 24 932–960. MR1404537\n[2] DE CALAN, C., LUCK, J. M., NIEUWENHUIZEN, TH. M. and PETRITIS, D. (1985). On the\ndistribution of a random variable occurring in 1D disordered systems. J. Phys. A 18 501–\n523. MR0783195\n[3] FAYOLLE, G., MALYSHEV, V. A. and MENSHIKOV, M. V. (1995). Topics in the Constructive\nTheory of Countable Markov Chains. Cambridge Univ. Press. MR1331145\n[4] FAYOLLE, G., IGNATYUK, I., MALYSHEV, V. and MENSHIKOV, M. (1991). Random walks\nin two-dimensional complexes. Queueing Systems 9 269–300. MR1132178\n[5] FOSS, S. and LAST, G. (1996). Stability of polling systems with exhaustive service policies\nand state-dependent routing. Ann. Appl. Probab. 6 116–137. MR1389834\n[6] LAMPERTI, J. (1960). Criteria for the recurrence or transience of stochastic processes. I.\nJ. Math. Anal. Appl. 1 314–330. MR0126872\n[7] LAMPERTI, J. (1963). Criteria for stochastic processes. II. Passage-time moments.\nJ. Math. Anal. Appl. 7 127–145. MR0159361\n[8] MACPHEE, I. M. and MENSHIKOV, M. (2003). Critical random walks on two-dimensional\ncomplexes with applications to polling systems. Ann. Appl. Probab. 13 1399–1422.\nMR2023881\n[9] MACPHEE, I., MENSHIKOV, M., PETRITIS, D. and POPOV, S. YU. (2007). Polling systems\nwith random changes of regime. Ann. Appl. Probab. To appear.\n[10] MENSHIKOV, M. V. and POPOV, S. YU. (1995). Exact power estimates for countable Markov\nchains. Markov Process. Related Fields 1 57–78. MR1403077\n[11] MENSHIKOV, M. and ZUYEV, S. (2001). Polling systems in the critical regime. Stochastic\nProcess. Appl. 92 201–218. MR1817586\n[12] MEYN, S. P. and TWEEDIE, R. L. (1993). Markov Chains and Stochastic Stability. Springer,\nLondon. MR1287609\nI. MACPHEE\nM. MENSHIKOV\nMATHEMATICS DEPARTMENT\nUNIVERSITY OF DURHAM\nUNITED KINGDOM\nE-MAIL: i.m.macphee@durham.ac.uk\nmikhail.menshikov@durham.ac.uk\nD. PETRITIS\nINSITUT DE RECHERCHE MATHÉMATIQUE\nUNIVERSITÉ DE RENNES 1\nFRANCE\nE-MAIL: dimitri.petritis@univ-rennes1.fr\nS. POPOV\nINSTITUTO DE MATEMÁTICA E ESTATÍSTICA\nUNIVERSIDADE DE SÃO PAULO\nBRASIL\nE-MAIL: popov@ime.usp.br\n"}