{"doi":"10.1016\/S0009-2541(02)00289-9","coreId":"60222","oai":"oai:nora.nerc.ac.uk:7701","identifiers":["oai:nora.nerc.ac.uk:7701","10.1016\/S0009-2541(02)00289-9"],"title":"Do fluid inclusions preserve δ18O values of hydrothermal fluids in epithermal systems over geological time? : evidence from paleo- and modern geothermal systems, Milos island, Aegean Sea","authors":["Naden, Jonathan","Kilias, S.P.","Leng, M.J.","Cheliotis, I.","Shepherd, T.J."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2003-06-15","abstract":"Stable isotope compositions of quartz (δ18Oquartz) and fluid inclusion waters (δ18OFI and δDFI) were analysed from Profitis Ilias, a low-sulphidation epithermal gold mineralisation deposit on Milos island Greece, to establish if δ18OFI preserve a record of paleo-geothermal processes.  Previous studies show that mineralisation at Profitis Ilias resulted from extreme boiling and vaporisation and a zone located at approximately 430 m asl represents the transition between a liquid- and vapour-dominated system [Mineral. Dep. 36 (2001) 43].  The deposit is also closely associated with an active geothermal system, whose waters have a well-characterised stable isotope geochemistry [Pagel and Leroy (1991) Source, transport and deposition of metals.  Balkema, Rotterdam, 107–112].  The samples were collected over an elevation interval of 440 m (210 to 650 m asl) to give information on the liquid- and vapour-segments of the paleo-system.\\ud\nThe data show systematic variations with sample elevation.  Samples from the highest elevations (c. 650 m asl) have the lightest δ18OFI (–7.3 ‰) and δDFI (–68.0 ‰) whilst the deepest (c. 210 m asl) are isotopically heavier (δ18OFI –3.7 ‰; δDFI –19.0 ‰).  Relative changes in δ18OFI closely parallel those in δDFI.  δ18Oquartz shows an opposite trend, from the lightest values (+13.9 ‰) at the lowest elevations to the heaviest (+15.1 ‰) at the highest.  δ18OFI show correlations with other parameters.  For example, variable fluid inclusion homogenisation temperatures in the vapour-dominated part of the system, correlate with a rapid shift in δDFI (–33.3 to –50.5 ‰) and δ18OFI (–4.1 to –6.2 ‰) and gold contents also increase in the same zone (up to 50 ppm).  Comparable correlations in δ18Oquartz or δ18Ocalculated (estimated geothermal fluid from fluid inclusion homogenisation data) are absent.  δ18Ocalculated are always 5 to 10 ‰ heavier than δ18OFI.  Comparison with the modern geothermal system shows that δDFI–δ18OFI are similar.  Isotope data for the modern system and fluid inclusion waters fall on linear trends sub-paralleling the meteoric water line and project towards seawater values.  Numerical modelling favours kinetically controlled fractionation to explain differences in δ18Ocalculated and δ18Ofluid rather than diffusive post-trapping equilibration.  The evidence suggests, that in low-temperature epithermal systems, δ18OFI may represent a better record of fluid process and the isotopic composition of the geothermal fluid than temperature-corrected quartz data","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/60222.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/7701\/1\/Chem_Geol_2003.pdf","pdfHashValue":"e8879a9f284f54cdad9999f75c75590a04135664","publisher":"Elsevier","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:7701<\/identifier><datestamp>\n      2012-11-22T12:02:47Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D533130<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/7701\/<\/dc:relation><dc:title>\n        Do fluid inclusions preserve δ18O values of hydrothermal fluids in epithermal systems over geological time? : evidence from paleo- and modern geothermal systems, Milos island, Aegean Sea<\/dc:title><dc:creator>\n        Naden, Jonathan<\/dc:creator><dc:creator>\n        Kilias, S.P.<\/dc:creator><dc:creator>\n        Leng, M.J.<\/dc:creator><dc:creator>\n        Cheliotis, I.<\/dc:creator><dc:creator>\n        Shepherd, T.J.<\/dc:creator><dc:subject>\n        Earth Sciences<\/dc:subject><dc:description>\n        Stable isotope compositions of quartz (δ18Oquartz) and fluid inclusion waters (δ18OFI and δDFI) were analysed from Profitis Ilias, a low-sulphidation epithermal gold mineralisation deposit on Milos island Greece, to establish if δ18OFI preserve a record of paleo-geothermal processes.  Previous studies show that mineralisation at Profitis Ilias resulted from extreme boiling and vaporisation and a zone located at approximately 430 m asl represents the transition between a liquid- and vapour-dominated system [Mineral. Dep. 36 (2001) 43].  The deposit is also closely associated with an active geothermal system, whose waters have a well-characterised stable isotope geochemistry [Pagel and Leroy (1991) Source, transport and deposition of metals.  Balkema, Rotterdam, 107–112].  The samples were collected over an elevation interval of 440 m (210 to 650 m asl) to give information on the liquid- and vapour-segments of the paleo-system.\\ud\nThe data show systematic variations with sample elevation.  Samples from the highest elevations (c. 650 m asl) have the lightest δ18OFI (–7.3 ‰) and δDFI (–68.0 ‰) whilst the deepest (c. 210 m asl) are isotopically heavier (δ18OFI –3.7 ‰; δDFI –19.0 ‰).  Relative changes in δ18OFI closely parallel those in δDFI.  δ18Oquartz shows an opposite trend, from the lightest values (+13.9 ‰) at the lowest elevations to the heaviest (+15.1 ‰) at the highest.  δ18OFI show correlations with other parameters.  For example, variable fluid inclusion homogenisation temperatures in the vapour-dominated part of the system, correlate with a rapid shift in δDFI (–33.3 to –50.5 ‰) and δ18OFI (–4.1 to –6.2 ‰) and gold contents also increase in the same zone (up to 50 ppm).  Comparable correlations in δ18Oquartz or δ18Ocalculated (estimated geothermal fluid from fluid inclusion homogenisation data) are absent.  δ18Ocalculated are always 5 to 10 ‰ heavier than δ18OFI.  Comparison with the modern geothermal system shows that δDFI–δ18OFI are similar.  Isotope data for the modern system and fluid inclusion waters fall on linear trends sub-paralleling the meteoric water line and project towards seawater values.  Numerical modelling favours kinetically controlled fractionation to explain differences in δ18Ocalculated and δ18Ofluid rather than diffusive post-trapping equilibration.  The evidence suggests, that in low-temperature epithermal systems, δ18OFI may represent a better record of fluid process and the isotopic composition of the geothermal fluid than temperature-corrected quartz data.<\/dc:description><dc:publisher>\n        Elsevier<\/dc:publisher><dc:date>\n        2003-06-15<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/7701\/1\/Chem_Geol_2003.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Naden, Jonathan; Kilias, S.P.; Leng, M.J.; Cheliotis, I.; Shepherd, T.J..  2003  Do fluid inclusions preserve δ18O values of hydrothermal fluids in epithermal systems over geological time? : evidence from paleo- and modern geothermal systems, Milos island, Aegean Sea.   Chemical Geology, 197 (1-4). 143-159.  https:\/\/doi.org\/10.1016\/S0009-2541(02)00289-9 <https:\/\/doi.org\/10.1016\/S0009-2541(02)00289-9>     \n <\/dc:identifier><dc:relation>\n        http:\/\/www.sciencedirect.com\/science\/journal\/00092541<\/dc:relation><dc:relation>\n        10.1016\/S0009-2541(02)00289-9<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/7701\/","http:\/\/www.sciencedirect.com\/science\/journal\/00092541","10.1016\/S0009-2541(02)00289-9"],"year":2003,"topics":["Earth Sciences"],"subject":["Publication - Article","PeerReviewed"],"fullText":" Contact for JN: \nTel: +00 44 (0)115 936 3163 \nFax:  +00 44 (0)115 936 3200 \nE-mail: jna@bgs.ac.uk \nTitle \nDo fluid inclusions preserve δ18\n \nO values of hydrothermal fluids in epithermal systems over \ngeological time? Evidence from paleo- and modern geothermal systems, Milos island, Aegean \nSea. \nAuthors \nJ. Nadena,b, S.P. Kiliasa, M.J. Lengc, I. Cheliotisd and T.J. Shepherd\n \nb \nAffiliations \na National and Kapodistrian University of Athens, Department of Geology, Section of \nEconomic Geology and Geochemistry, Panepistimioupolis, Ano Ilisia, 157 84 Athens, \nGreece \nb British Geological Survey, Keyworth Notts. NG12 5GG, UK \nc NERC Isotope Geosciences Laboratory, British Geological Survey, Keyworth, Notts. \nNG12 5GG, UK. \nd Institute for Geology and Mineral Exploration, 70 Messoghion St, 115 27 Athens, \nGreece. \n  \nAbstract \nStable isotope compositions of quartz (δ18Oquartz) and fluid inclusion waters (δ18OFI and δDFI) \nwere analysed from Profitis Ilias, a low-sulphidation epithermal gold mineralisation deposit \non Milos island Greece, to establish if δ18OFI\nThe data show systematic variations with sample elevation.  Samples from the highest \nelevations (c. 650 m asl) have the lightest δ\n preserve a record of paleo-geothermal processes.  \nPrevious studies show that mineralisation at Profitis Ilias resulted from extreme boiling and \nvaporisation and a zone located at approximately 430 m asl represents the transition between a \nliquid- and vapour-dominated system [Mineral. Dep. 36 (2001) 43].  The deposit is also \nclosely associated with an active geothermal system, whose waters have a well-characterised \nstable isotope geochemistry [Pagel and Leroy (1991) Source, transport and deposition of \nmetals.  Balkema, Rotterdam, 107–112].  The samples were collected over an elevation \ninterval of 440 m (210 to 650 m asl) to give information on the liquid- and vapour-segments \nof the paleo-system. \n18OFI (–7.3 ‰) and δDFI (–68.0 ‰) whilst the \ndeepest (c. 210 m asl) are isotopically heavier (δ18OFI –3.7 ‰; δDFI –19.0 ‰).  Relative \nchanges in δ18OFI closely parallel those in δDFI.  δ18Oquartz shows an opposite trend, from the \nlightest values (+13.9 ‰) at the lowest elevations to the heaviest (+15.1 ‰) at the highest.  \nδ18OFI show correlations with other parameters.  For example, variable fluid inclusion \nhomogenisation temperatures in the vapour-dominated part of the system, correlate with a \nrapid shift in δDFI (–33.3 to –50.5 ‰) and δ18OFI (–4.1 to –6.2 ‰) and gold contents also \nincrease in the same zone (up to 50 ppm).  Comparable correlations in δ18Oquartz or \nδ18Ocalculated (estimated geothermal fluid from fluid inclusion homogenisation data) are absent.  \nδ18Ocalculated are always 5 to 10 ‰ heavier than δ18OFI.  Comparison with the modern \n  \ngeothermal system shows that δDFI–δ18OFI are similar.  Isotope data for the modern system \nand fluid inclusion waters fall on linear trends sub-paralleling the meteoric water line and \nproject towards seawater values.  Numerical modelling favours kinetically controlled \nfractionation to explain differences in δ18Ocalculated and δ18Ofluid rather than diffusive post-\ntrapping equilibration.  The evidence suggests, that in low-temperature epithermal systems, \nδ18OFI\nKeywords:  Fluid inclusions; oxygen and hydrogen isotopes; active Aegean arc; epithermal \nmineralisation \n may represent a better record of fluid process and the isotopic composition of the \ngeothermal fluid than temperature-corrected quartz data. \n 1 \n1 Introduction \nStable isotope analyses (δD and δ18O) of inclusion fluids and minerals provide valuable \ninsights into fluid sources, hydrothermal processes and fluid-rock interaction in a wide range \nof geological environments (e.g. O’Reilly et al., 1997; Wilkinson et al., 1995).  One of the \nmain methodologies for determining D\/Η and 18O\/16O, focuses on measuring δD on extracted \ninclusion fluids and calculating δ18O of the fluid by analysing the host quartz. Recently, \nprocedures that analyse both δD and δ18\nIn this study, we present directly and indirectly measured δD and δ\nO on inclusion fluids have been developed for quartz \nand carbonates (Kishima and Sakai, 1980; Kazahaya and Matsuo, 1984; Ohba and Matsuo, \n1988; Lecuyer and O’Neil, 1994).  However in quartz, scientific opinions as to which \napproach is the most appropriate are divided (Vityk et al., 1993; Ohba et al., 1995).  The \nindirect approach is not ideal as it relies on accurate determination of quartz precipitation \ntemperatures, usually ascertained through fluid inclusion microthermometry.  Also there is \nevidence for isotopic disequilibrium between quartz and the fluid phase at low temperatures \n(<250 °C) (Zhang et al., 1995; Matsuhisa et al., 1978).  Direct measurements also have \nproblems as isotopic re-equilibration can occur after trapping and during cooling of the host \nmineral (Rye and O’Neil, 1968; Ohba et al., 1995). \n18O data for adularia-\nsericite epithermal-Au mineralisation at Profitis Ilias on Milos island (Aegean sea).  A deposit \nclosely linked to a modern geothermal reservoir, and whose geology, mineralogy and fluid \ninclusions are well characterised (Kilias et al., 2001).  In addition, the modern system is well \ndocumented mineralogically, geochemically and isotopically (Liakopoulos, 1987; Liakopoulos \net al., 1991; Pflumio et al., 1991; Christanis and St. Seymour, 1995) and provides an excellent \nanalogue for the epithermal-Au mineralisation. \n 2 \n2 Geological setting and background information \n2.1 The geology of Milos island \nMilos is located on the active Aegean volcanic arc (Fig. 1).  Volcanism, on Milos is Pliocene–\nPleistocene in age and calc-alkaline in nature and resulted from the north-eastward subduction \nof Mediterranean sea floor (part of the African plate) below the Aegean microplate \n(Papazachos and Kiratzi, 1996 and references therein).  The geology, geochronology, \ngeothermal activity and structure of the island are described in detail by Fytikas (1989, and \nreferences therein), Briqueu et al. (1986), Liakopoulos et al. (1991), and Tsokas (1996) and its \nmain geological features are shown in Fig. 1.  Though the last recorded volcanism ceased \n100,000 years ago, Milos is currently an active geothermal field.  Present day activity is \nconcentrated in the central and eastern portions of the island and is expressed by fumaroles, \nhot springs, hot ground, and submarine gas escapes (Fig. 1). \n2.2 Epithermal gold mineralisation at Profitis Ilias \nThe geology, mineralogy and fluid inclusions of Profitis Ilias have been described in detail by \nKilias et al. (2001), and only the salient features are reiterated here.  \nThe deposit is classified as a low-sulphidation epithermal gold-deposit and host rocks consist \nof strongly sericitised rhyolitic lapilli-tuffs and ignimbrites.  The mineralisation, comprising \nnative gold, minor sphalerite, galena, chalcopyrite and pyrite, is developed in a series of \ninterconnected N-S to NE-SW trending vein networks that occupy a fault network.  Vein \nwidths are up to 3 m across and extend to depths of at least 300 m below the present-day \nsurface.  Three broad paragenetic stages to the mineralisation are recognised: (i) barren pre-\nore comprising microcrystalline quartz and pyrite; (ii) fine-grained and vuggy quartz with base \n 3 \nmetal sulphides and native gold and (iii) post-ore fine-grained quartz and barite with minor to \ntrace sulphides. \nFluid inclusion homogenisation temperatures show either show narrow (25–50°C) or large \nranges (>150°C) that are not evenly distributed throughout the depth profile.  In the lower \nlevels of the hydrothermal system (below 430 m above-sea-level [asl]) only the narrow range \nis observed, whilst above this level samples exhibiting a widely varying temperatures \npredominate (Tab. 1).  In terms of Th\n1. A high–salinity trend, where rapidly increasing salinity (3 to 15 wt % NaCl eq) is \nassociated with gradual decreases in homogenisation temperature.  This trend is seen \nthroughout hydrothermal system. \n–salinity relationships, the data fall into two distinct \ntrends: \n2. High–Th\nIn addition to the above, the lowest homogenisation temperatures, at each sample depth, \nclosely follow a depth-to-boiling curve.  This feature is seen in modern geothermal systems \n(e.g. Hedenquist et al., 1992; Lüders et al., 2001) and provides a reference curve for \nestimating quartz precipitation temperatures (Tab. 1) \n trend, where a diffuse tendency of decreasing salinity is associated with \nincreasing temperature.  This trend only occurs in the upper parts of the hydrothermal \nsystem (> 430 m asl). \nKilias et al. (2001) concluded that the fluid inclusion data coupled with geochemical data \nstrongly imply that extreme boiling and vaporisation played a major role in mineralisation.  In \naddition, they noted that a zone, located at approximately 430 m asl marks the transition \nbetween a liquid- and vapour-dominated system.  These results show that the studied samples, \n 4 \nat the deposit scale, can be treated as being temporally and compositionally consistent and \nprovide a coherent framework to interpret the stable isotope data. \n2.3 The modern geothermal system: chemical and isotopic characteristics \nIn the active geothermal system, the reservoir liquid, before phase separation is moderately \nsaline (~9 wt % dissolved salts) and after phase separation the condensed vapour has a salinity \nof 0.12 wt % NaCl.  Geochemically, the residual liquid phase is dominated by sodium \nchloride (up to 14.3 wt % NaCl) with significant potassium (1.1 wt %) and calcium (0.5 wt \n%).  In addition, magnesium (1.36x10-4 mol\/l) and sulphate (1.04x10-5 mol\/l) are strongly \ndepleted compared to seawater.  During its ascent to the surface, the hydrothermal fluid \nseparates into liquid and vapour phases (Liakopoulos, 1987; Liakopoulos et al., 1991).  In \nterms of stable (δ18\n3 Mater ials and methods \nO, δD) isotope systematics, the deep reservoir comprises a fluid that \nresulted from a Rayleigh-type distillation of seawater accompanied by partial re-equilibration \nwith volcanic rocks as the seawater percolated down through the system (Pflumio et al., \n1991). \n3.1 Sample selection and preparation \nSample selection for isotopic analysis was based on fluid inclusion microthermometry and \nelevation data.  The criteria were that quartz samples contained only a single inclusion type \nwith an inclusion population dominated by primary\/pseudosecondary inclusions and that they \ncovered most of the vertical range of the deposit.  In total, eleven quartz samples were \nselected for analysis (Tab. 1).  Approximately 10 g of quartz from each sample were crushed \nand sieved to –1000µm +500µm.  The quartz concentrates were then washed in hot (c. 90 °C) \n 5 \n6M HCl several times with a final rinse in hot (c. 90 °C) Milli Q water to remove “soluble” \nimpurities adhering to the surface of the quartz grains (e.g. iron oxides).  This was followed \nby ultrasonic cleaning in cold Milli Q water for 5 minutes to removed “insoluble” surface \nimpurities (e.g. clay minerals).  Any contaminants left were then removed by careful hand \npicking under a binocular microscope to give a pure quartz concentrate weighing between 0.5 \nand 1.0 g.  Immediately prior to analysis, the sample was briefly ultrasonically cleaned in \ndichloromethane to remove any remaining organic material. \n3.2 δ18\nδ\nO and δD from fluid inclusions \n18O and δD in fluid inclusions were determined using a modified methodology based on \nKishima and Sakai (1980), Kazahaya and Matsuo (1984), and Lecuyer and O’Neil (1994).  \nBetween 0.5 and 1g of hand picked quartz grains were degassed at ~20 °C overnight under \nvacuum. Samples were then decrepitated at 600 °C for 30 minutes and the fluid inclusion \nwater collected cryogenically.  This water was then transferred to a micro-equilibration quartz \ntube sealed at one end, to which 2cm3 of a standard CO2 gas was added, and the tube \ncompletely sealed. The tube was then weighed and the H2O and standard CO2 gases were left \nto exchange oxygen isotopes at 25 °C for 7 days.  After equilibration, H2O and CO2 were \nseparated cryogenically.  The water was converted to hydrogen by reduction over hot zinc and \nratios measured on a SIRA 10 mass spectrometer.  CO2 was collected and ratios determined \non an Optima mass spectrometer along with a sample of the standard gas used for the \nequilibration.  The δ18O values of the water samples were calculated using the mass balance \nequation of Kishima and Sakai (1980) and the CO2-H2O fractionation factor at 25 °C \ndetermined by O’Neil et al. (1975). The δ18O value of standard CO2 used for equilibration \nwas 31.85 ‰ (SMOW), a value close to that expected for the CO2 after equilibration.  Since \n 6 \nthe oxygen isotope ratio of the CO2 only changes slightly during the equilibration, the \nprecision was not compromised. The weight of fluid inclusion water released from the quartz \nwas calculated from the weights of the collection tubes before and after the H2O-CO2 \ncollection.  The water content of each sample was variable, but in most cases 0.5 to 1 g of \nquartz yielded between 0.5 and 4 micro-litres of water (Tab. 1).  At each stage in the \nextraction procedure the line pressure was monitored to check for residual gas.  Precisions \nobtained for the laboratory standard water, extracted and measured at the same time, were 0.1 \n‰ for δ18\n3.3 δ\nO and 3 ‰ for δD (2σ) for samples between 1–2 micro-litre quantities of water.  The \ndata are presented as permil (‰) deviations from VSMOW. \n18\nSilicate ratios were obtained from the quartz after fluid inclusion extraction, using the \nprocedure outlined by Clayton and Mayeda (1963).  Oxygen yields were monitored and \nconsidered acceptable within the range 99–103% of the theoretical yield.  Isotope ratios were \nmeasured on a CJS Sciences mass spectrometer (phoenix 390, rebuilt VG MM903).  δ\nO from quartz \n18\n4 Stable isotope results \nO \nvalues were normalised through laboratory standards and NBS28, and corrected according to \nCraig (1957) and Deines (1970). The data are presented as permil (‰) deviations from \nVSMOW.  Overall analytical reproducibility was of the order of ± 0.10 ‰ (2σ).  \n4.1 Oxygen data \nThe oxygen isotope data show correlations between sample-elevation and δ18O in both fluid \ninclusion waters (δ18OFI) and quartz (δ18Oquartz) (Tab. 1 and Fig. 2).  With the exception of the \nsample from the highest elevation, δ18OFI decreases from -3.7 ‰ at 210 m asl to -7.3 ‰ at \n 7 \n613 m asl.  δ18Oquartz shows an opposite trend, increasing from +13.9 to +15.1 ‰.  However, \nto directly compare the quartz and fluid inclusion water data, δ18Oquartz needs to be corrected \nfor temperature dependent fractionation effects between quartz and the hydrothermal fluid \n(δ18Ocorrected).  However, in low to moderate temperature epithermal systems (<250 °C), \ncorrect estimation of quartz precipitation temperatures from fluid inclusion temperatures can \nbe difficult and errors in temperature estimate can result in significant uncertainties in isotopic \ncompositions – at 200 °C, an uncertainty of +\/– 20 °C in the fluid inclusion homogenisation \ntemperature corresponds to a 2.5 ‰ uncertainty in δ18Ofluid\nFig. 2 compares δ\n.  Furthermore, at Profitis Ilias, \nwhere there is with a temperature difference of approximately 100 °C between the lowest and \nhighest elevations, uncertainties of this magnitude are greater than the total range in the \nmeasured quartz oxygen isotopic composition (1.2 ‰).  Several choices of temperature \nestimate are available to us.  First there is a single value, e.g. 225 °C, that corresponds to \nestimated boiling temperatures, but there is a clear variation in temperature over the \ninvestigated elevation interval (see Tab. 1).  Second, average sample homogenisation \ntemperatures (Tab. 2) could also be appropriate.  However in this case, there is good evidence \nfor heterogeneous trapping (Kilias et al. 2001), which will make this choice an overestimate.  \nThird, minimum homogenisation temperature of each sample (Tab. 1), which represents fluid \ninclusions that have trapped the least vapour, are also valid estimate (see Pichavant et al. \n1982; Ramboz et al. 1982 and Bodnar et al., 1985, for discussions that relate homogenisation \ntemperatures, boiling and heterogeneous trapping).  Last, we have depth-to-boiling \nrelationships to estimate fluid temperatures (Tab. 1). \n18Ocorrected, δ18OFI and δ18Oquartz with sample elevation, using the above \nmethods for estimating temperature.  First, it is clear that trends in the data, alluded to earlier, \nare systematically related to sample elevation.  Second, there is a difference of about +8 to \n 8 \n+12 ‰ between δ18OFI and δ18Ocorrected\n1. Use of a single temperature value preserves the δ\n.  Closer examination of the corrected data raises a \nnumber of further points: \n18\n2. Employing Mean homogenisation temperature results in significant scatter, and makes it \ndifficult to differentiate any data trends. \nO-depth trend seen in the quartz data, \nwhich is still in the opposite sense to the inclusion water data. \n3. Minimum homogenisation temperature, again results in scatter, but trends in the data are \nnow discernible and the δ18\n4. Applying temperature estimates calculated from the boiling curve, with the exception of \nthe sample from the highest elevation, results in a trend with little scatter that closely \nparallels the inclusion water. \nO-depth trend is in a similar sense to that of the inclusion \nwater. \n4.2 Hydrogen data \nδD of inclusion waters (δDFI) varies between –68.0 and –19.0 ‰.  δDFI\n4.3 Correlations between stable isotope, fluid inclusion and geochemical data \n shows a reasonable \ncorrelation with sample-elevation (Fig. 3), with eight of the eleven samples analysed falling \non a linear trend varying from the light values (–47.8 ‰) at high elevations (613 m asl) to \nheavier data (–19 ‰) at lower altitudes (210 m asl). \nIn addition to isotope–elevation data, it is also possible to examine the relationships between \nstable isotope, fluid inclusion and geochemical data (Au and Ag).  It is clear that 430 m asl \nmarks a distinct transition (Fig. 5).  First, δD and δ18OFI water show a significant decrease to \n 9 \nlighter values and relative changes in δD closely parallel those in δ18OFI water.  Second, fluid \ninclusion homogenisation temperatures start to show a high degree of variability above 430 m \nasl.  Here, individual samples commonly record Th ranges in excess of 100°C, whilst below \nthe transition temperature ranges are generally less than 20 °C.  This variation correlates with \nthe shift in δ18OFI and δDFI to lighter values.  Third, at 430 m asl metal contents start to \nincrease and gold contents are commonly greater than 20 ppm. In comparison the variation in \nδ18Oquartz\n5 Discussion \n shows a gradual change along the entire depth profile and there is no clearly marked \nchange at 430 m asl.   \n5.1 Combined δD and δ18\nComparison of the paleo and modern systems show that δ\nO and comparisons with the modern geothermal system. \n18OFI has a number of features in \ncommon with the modern system.  It has a similar range in oxygen isotope composition, and \ncombined δDFI–δ18OFI is close to the vaporisation–mixing trend described by Pflumio et al. \n(1991) (Fig. 5).  In addition, the variation in the isotopic composition of the fluid inclusion \nwaters is modelled by boiling processes.  Fig. 5 shows two steam separation trends that match \nthe δ18OFI data.  Here, the heavier samples, in both δD and δ18O, are located at the lowest \nelevations and are within the liquid-dominated portion of the hydrothermal system (below \n~430 m asl) and correspond to the highest temperatures in the system.  Conversely, the \nlightest samples are located in the vapour-rich part (above ~430 m asl) and have highly \nvariable fluid inclusion temperatures indicative of heterogeneous trapping of liquid and \nvapour (Figs 4 and 5).  The observed depth–temperature–isotopic variation in δ18OFI can be \nexplained by the trapping of varying physical mixtures (as fluid inclusions) of residual liquid \nand steam, with each “quartz extraction” recording an “averaged” isotopic composition.  In \n 10 \nthis manner, samples from the higher elevations will contain more steam and record the \nlightest δD and δ18O values, whilst those in the deeper portions will be more representative of \nthe reservoir and residual fluid compositions.  However in terms of δ18Oquartz compositions, \nirrespective of the temperature used to calculate quartz–water fractionation, the δ18Ocalculated \n5.2 The quartz–inclusion water δ\ndata plot well to the right of the meteoric water line, in a scattered manner that cannot be \nrelated to the modern geothermal system and have no obvious trends.   \n18\nTable 2 compares δ\nO shift \n18OFI and δ18Ocorrected \nFirst, Rye and O’Neil (1968) analysed δ\nand clearly shows calculated fluid compositions do \nnot equate with those measured in the fluid inclusions.  In most cases, irrespective of the \nchoice of temperature, calculated compositions are generally 5–10 ‰ heavier than the \nmeasured fluid inclusion waters.  To address the reasons for this, let us examine the limited \nnumber of cases in the literature where both quartz and inclusion water have been analysed \n(Tab. 3). \n18O in inclusion waters hosted in calcite, sphalerite \nand quartz and concluded that δ18OFI undergoes post-trapping exchange with quartz.  \nHowever, these conclusions are based on limited data and large samples (Tab. 3).  Thus, it is \npossible that they did not sample a single generation of quartz or fluid.  This is important as \nHyashi et al. (2001) have shown that in epithermal quartz δ18Oquartz can vary by up to 7 ‰ in \non a millimetric scale.  Thus, without knowing the homogeneity of the material and \nconsidering the small number of quartz samples analysed it is difficult to assess the effects of \npost-trapping re-equilibration from this data alone.  \n 11 \nSecond, Vityk et al. (1993) and Ohba et al. (1995) analysed both δ18OFI and δ18Oquartz from the \nBeregovo epithermal and Kaneuchi tungsten deposits and had significantly different results.  \nVityk et al. (1993) record two distinct types of quartz and fluid inclusion.  In the first, isotope \nand fluid inclusion temperatures agree and microthermometry indicates a compositionally and \nthermally homogeneous hydrothermal fluid (salinity: 1–2 wt % NaCl eq.; Th: 190–215 ºC).  In \nthe second, isotope and fluid inclusion temperatures disagree and microthermometric data \nvary considerably (wt % NaCl eq: 0–16 wt % Th: 170–260 ºC).  Also, fluid inclusion waters \nextracted from sulphides (sphalerite and galena) and co-existing quartz have very similar \nδ18OFI and δ18DFI (Tab. 3).  These data lead to their conclusion that in epithermal systems \ninclusion fluids can preserve δ18\nIn contrast Ohba et al. (1995), for relatively high temperature (300–400 ºC) and old (c. 91 Ma) \nhydrothermal quartz, show that positive ∆\nO over geologic time. It is also important to note that \nBeregovo is a relatively young deposit (c. 15 Ma). \n18Ocorrected–FI is due to post-trapping diffusional \nexchange.  However, it is important to note that in both Rye and O’Neil (1968) and Ohba et \nal. (1995), formation temperatures for hydrothermal quartz were in excess of 300 ºC.  It is \nknown from experimental work (Matsuhisa et al. 1978; Zhang et al., 1989), that at \ntemperatures in excess of 300 ºC equilibration between quartz and water is relatively rapid \n(circa 30–100 hours) whilst at temperatures lower than 250 ºC isotopic equilibrium is not \nachieved.  Thus, for both of these studies, due to the high precipitation temperature of the \nhydrothermal quartz and the time elapsed since mineralisation some post-trapping exchange \nby diffusion can be expected.  But in lower temperature (<250 ºC) young (<15 Ma) epithermal \ndeposits, such as Profitis Ilias and Beregovo, re-equilibration by diffusion may not occur.  \nHere, as the quartz cools rapidly from hydrothermal to ambient temperatures, slow δ18O \ndiffusion rates may prevent significant post-trapping exchange.  This is indicated qualitatively \n 12 \nat Beregovo, where one type of quartz has clearly not undergone any significant post-trapping \nexchange (Tab. 3). \n5.3 Modelling of post-trapping exchange by diffusion \nWe can examine post-trapping exchange by diffusion by looking at Dodson closure \ntemperatures (Dodson, 1973 and 1979) for δ18O in quartz.  This approach is particularly \nsuccessful in systems dominated by volume diffusion (Valley 2001) and δ18\n( )\n( ) \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n −\n=\ntTE\naDARTLn\nRET\nc\nc\nδδ\n2\n0\n2\nO diffusion \nbetween the wall of a fluid inclusion and bulk quartz is one example of this. \n (1) \nThe Dodson equation (eqn. 1) defines the closure temperature ( cT [K]) in terms of a \ndimensionless diffusional anisotropy parameter ( A ), the gas constant ( R [Jmol-1K-1\n0D\n]), the pre-\nexponential diffusion coefficient ( [m2s-1 E]), activation energy ( [J]), distance over which \ndiffusion takes place ( a [m]) and cooling rate ( tT δδ [Ks-1]).  As individual fluid inclusions \ngenerally have small volumes (<0.125 µl), then diffusion and exchange of δ18O between host \nquartz and inclusion water over short distances will significantly effect the composition of \ninclusion water.  For example, a 1 µm thick shell of quartz surrounding a 10 µm spherical \nfluid inclusion represents over 70% of the inclusion volume (Fig. 6A).  Thus, it is necessary to \nexamine closure temperatures for diffusion distances at the micron and sub-micron scale.  Fig. \n6B shows quartz closure temperatures at a variety of diffusion distances and cooling rates.  \nFrom this is clear that the closure temperature of δ18O in quartz, even for very short distances \n(c. 0.01 µm), is higher than most epithermal mineralisation (c. 250 ºC) for cooling rates in \n 13 \nexcess of c. 100 ºC\/Ma.  This means that in low to moderate temperature epithermal deposits, \nthe δ18O of inclusion water will not be significantly modified by post-trapping exchange with \nquartz.  However, in higher temperature (300–400 ºC) hydrothermal systems, Fig. 6B shows \nthat quartz is not closed to δ18O diffusion.  Hence, post-trapping diffusion will take place and \nthe δ18O composition of the inclusion water will be modified.  Also, in higher temperature \nsystems, the degree of exchange will be dependent on inclusion size, as for a given distance \nand cooling rate smaller inclusions will have proportionally more quartz to exchange with \nthan larger inclusions (see Fig. 6A).  This relationship between inclusion size and degree of \npost-trapping exchange has been recorded by Ohba et al. (1995).  Thus, for high temperature \n(>300 ºC) hydrothermal systems, δ18Oquartz data coupled with accurate knowledge of quartz \nprecipitation temperatures are better estimators of δ18Ofluid than δ18OFI\n5.4 Kinetically controlled fluid–mineral exchange during quartz formation \n.  However, in lower \ntemperature systems (<250 ºC), quartz closure temperatures indicate that fluid inclusions do \nnot re-equilibrate with quartz during cooling, and to this Vityk et al (1993) show that quartz–\nfluid inclusion isotope temperatures associated with a specific quartz type are in good \nagreement with fluid inclusion microthermometry.  However, for the Profitis Ilias samples and \nother quartz types at Beregovo, isotope temperatures do not agree (see Tabs. 2 & 3).  Thus, in \nthe epithermal examples, the fact that some isotope temperatures agree and others suggests \nthat another process must be responsible for the differences. \nDubinina and Lakshtanov (1997) provide a different perspective into reasons for the quartz–\ninclusion water δ18O shift. They show that providing no other isotopic equilibration \nmechanism operates (e.g. diffusion) complete isotopic equilibrium between a mineral and a \nfluid phase cannot be achieved through kinetically controlled solution–precipitation processes.  \n 14 \nDubinina and Lakshtanov (1997) expressed the degree of isotopic exchange (F) between \nquartz and fluid, where the quartz has a silica gel precursor, as \ne0\ni0\n∆−∆\n∆−∆\n=F  (2) \nWhere 0∆ , i∆ and e∆  are differences in δ-values between fluid and (i) silica gel ( 0∆ ), (ii) \nfreshly precipitating quartz ( i∆ ) and (iii) quartz at equilibrium ( e∆ ). Additionally, they \ndescribed the degree of exchange (F) in terms of total mass of water (w) total mass of mineral \n(M) and mass of dissolved and re-precipitated mineral (m) as \n\n\n\n\n\n +\n\n\n\n\n\n\n\n\n\n\n−−=\nM\nw\nw\nmF 1exp1  (3) \nEquation (3) means that during solution–precipitation, isotopic fractionation between mineral \nand fluid can exceed the predicted equilibrium value of ∆mineral-fluid.  This has been recorded \nexperimentally by  Zhang et al. (1989), who document ∆i - ∆e\nThe modelling predicts changes in isotopic composition as an unstable mineral is transformed \nisochemically into a stable one and is particularly relevant to epithermal systems where \ncrystalline quartz can have amorphous precursors (e.g. Dong et al., 1995).  The following \nequation describes variations in the bulk isotopic composition of quartz (\n values of +8.3 ‰ during the \nearly stages of a 250 ºC silica gel–water isotope equilibration experiment. \ns\nBδ ) formed during \nsolution–precipitation processes (for a detailed discussion of its derivation see Dubinina and \nLakshtanov, 1997): \n\n\n\n\n\n\n\n\n\n\n\n−−∆−∆−=\nw\nm\nm\nw i\nA\ns\nB exp1)( 00δδ  (4) \n 15 \nWhere 0Aδ  is the initial isotopic composition of the amorphous (unstable) phase, \n0∆  is \nderived from the initial isotopic compositions of the fluid ( 0wδ ) and the unstable silica phase \n( 000 wA δδ −=∆ ), \ni∆  is calculated from the initial fluid composition and quartz–water \nfractionation at the temperature at which the solution–precipitation process take place \n( αδ Lnw\ni 10000 +=∆ ) and \nw\nm  represents the re-precipitated mineral–fluid ratio as the amount \nof quartz formed ( m ) changes from 0 to M .  To model how kinetic processes relate to our \nmeasured quartz compositions we need to estimate the initial isotopic compositions of the \nfluid, the unstable silica phase and temperature.  A first approximation of solution–\nprecipitation temperatures can be estimated from fluid inclusion data (c. 225 ºC).  For the \ninitial fluid, the composition of the modern reservoir (+3 ‰ – Pflumio et al., 1991) provides a \ngood analogue for the paleo-system at Profitis Ilias.  Kita and Taguchi (1986) measured \nisotopic fractionation factors between colloidal silica and a geothermal fluid at 76 and 88 ºC \nwhere silica was allowed to precipitate by evaporation of the geothermal fluid (this is broadly \nanalogous to Profitis Ilias, where mineralisation is associated with extreme boiling and \nvaporisation — Kilias et al., 2001).  Fig. 7 reproduces their data and compares it with \nfractionation factors for various equilibrium silica–water pairs.  From this it is clear that \nsilica–water oxygen isotope fractionation, under evaporative conditions, is non-equilibrium. \nMoreover, ∆18Osilica–water\n0∆\n  appears to increase with temperature, though it would be difficult to \nextrapolate these data to higher temperatures it would be reasonable to use the higher \ntemperature value (+14 ‰) as a minimum estimate for .  Using the above information and \nequation 4 we can model the bulk isotopic composition of quartz formed from a “colloidal” \nprecursor at 225 ºC.  Fig. 8A illustrates this and three features are evident: (i) the final \ncomposition of transformed quartz is dependent on fluid–mineral ratios, (ii) compositions are \n 16 \napproximately 3 ‰ heavier at low mineral–fluid ratios \n\n\n\n\n = 05.0\nM\nw  than at isotopic \nequilibrium and (iii) with 10>\nM\nw  kinetic processes start to approximate equilibrium quartz–\nwater fractionation.  In terms of our δ18Oquartz data, if we take the deepest and hottest sample \n(PD9380 in Table 1) to be most representative of the reservoir composition, δ18Oquartz and \nδ18OFI can be modelled by solution–precipitation processes, using equation 4 the measured \nδ18Oquartz 05.0=M\nw (+14.5 ‰) predicts an initial fluid composition of 0.7 ‰ (T = 225 ºC, , \n140 +=Aδ  ‰), which is very close to the measured δ\n18OFI\nAt Profitis Ilias the fluids were boiling and temperatures of quartz formation vary \nsystematically with depth (Tab. 1).  Fig. 8B models this variation and depicts a number of \nscenarios where δ\n (–0.3 ‰), whereas equilibrium \nfractionation predicts a fluid composition of +3.9 ‰.   \n18Oquartz M\nwvaries with temperature,  and initial fluid composition ( 0wδ ) and \nfrom this a number of controls on δ18Oquartz \n1. where quartz precipitates in equilibrium with a hydrothermal fluid (\ncan be seen: \n0\nwδ  = 1 ‰), which \nvaries in temperature from 250–100 ºC, δ18Oquartz \n2. Where quartz results from a dissolution–precipitation process at low water to solid \nratios (\nshows a relatively large systematic \nantipathetic variation from 9.9–22.0 ‰. \nM\nw  = 0.01, 0wδ  = 1 ‰) δ\n18Oquartz 0wδis relatively constant and approximates  + \n0∆ (15 ‰). \n 17 \n3. Going from equilibrium to low \nM\nw  and at constant 0wδ  + \n0∆ , δ18Oquartz \n0018 ∆+= wquartzO δδ\nvaries as family \nof curves of increasing radius of arc that pivot in an anticlockwise fashion about the \nintersection between the quartz equilibrium curve and . \n4. Changes in 0wδ  + \n0∆ at constant \nM\nw  simply shift the curve in the direction of changing \n0\nwδ  + \n0∆ without changing the shape of the curve \nIn terms of actual δ18Oquartz compositions, we can compare the predictive curves with the \nmeasured values through the boiling curve data (Table 1).  These provide a reasonable \nestimate of temperature–depth variation within the Profitis Ilias hydrothermal system and \nlocate the quartz samples in temperature–δ18O space. The data show a steep antipathetic \nrelationship between δ18Oquartz and temperature that is modelled by solution–precipitation \nprocesses with a solid mass ratio of 0.25 and, with the exception of the lowest and highest \ntemperature samples, an initial fluid varying in composition by about 1 permil, (Fig. 8B).  \nMoreover, the data do not conform to an equilibrium model of quartz precipitation.  Though \nkinetic processes can explain variation in δ18Oquartz with respect to estimated paleo-\ntemperatures, relating δ18Oquartz to δ18Ofluid through solution–precipitation is more challenging \nas this requires knowledge of ∆18Osilica–water for the quartz precursor.  In our case a value of \n+14 ‰, taken from Kita and Taguchi (1986), predicts a fluid composition in the region of 0–1 \n‰ (Fig. 8B).  This is in approximate agreement with the sample that best reflects the reservoir \ncomposition of the hydrothermal fluid (PD9380 – Tab. 1) and the estimated composition of \nthe modern geothermal reservoir, but samples from higher levels record lighter values (to –7.8 \n‰) that are not predicted by solution–precipitation processes.  However, these can be \n 18 \nexplained by heterogeneous trapping of liquid (δ18\nIn addition when we consider Vityk et al. (1993), kinetically controlled isotopic exchange is a \nmuch better process than post-trapping diffusion for explaining variations in ∆\nO ~ 0–1 ‰) and varying proportions of \nisotopically light vapour during boiling events (Fig. 5) \n18Ocorrected-FI  \nHere, variation in ∆18Ocorrected-FI is systematically related to different quartz types (Tab. 3).  For \nsamples where isotope and fluid inclusion temperatures agree, quartz precipitated in \nequilibrium with the hydrothermal fluid or if it formed from a precursor silica phase then fluid \nto solid ratios were high.  That is conditions of open flow.  For samples where isotope and \nfluid inclusions record different temperatures (∆18Ocalculated–FI: 2.2–8.5 ‰), ∆18Ocalculated–FI can \nbe explained by quartz forming through solution–precipitation processes at low fluid to solid \nratios (Fig 9A).  That is when fluid-flow was restricted and\/or it underwent extensive boiling.  \nThis feature has been observed at lower temperatures by Kita and Taguchi (1986).  When we \nconsider the alternative of post-trapping diffusional exchange as a mechanism for the δ18O \nquartz–inclusion water shift in Vityk et al. (1993), it is difficult to explain the variation.  First, \nit would be expected to affect all samples equally.  That is for a given size of fluid inclusion, \nquartz age and mineralisation temperature, ∆18Ocorrected-FI should be constant in all samples.  It \nis not, some show no shift, whilst others show ∆18Ocorrected-FI\n5.5 What does fluid inclusion δ\n to +8 ‰ (Tab. 3).  In terms, of a \ndiffusion mechanism this can only be explained by significantly different quartz ages or that \nfluid inclusions that are significantly larger in one type of quartz.  Vityk et al. (1993) do not \nindicate that either of these are applicable to the Beregovo quartzes. \n18\nThe modelling of Dodson closure temperatures for quartz show, theoretically, that for \ninclusions larger than about 5 µm and at temperatures less than 250 ºC, quartz does not \nO represent? \n 19 \nsignificantly exchange δ18\n1. the epithermal mineralisation at Profitis Ilias shows a consistency between δ\nO with fluid inclusion water.  A number of lines of independent \nevidence support this: \n18OFI, δDFI, \nand fluid inclusion and geochemical data that is not seen the δ18Ocalculated\n2. On Milos, there is close isotopic and chemical similarity between the composition of the \nfluid inclusion waters and that of the modern geothermal system (see Fig. 5) and there \nare sound geological reasons that a continuum exists between the ancient and modern \nsystems (Kilias et al. 2001). \n data (see Fig. \n5). \n3. The data of Vityk et al. (1993) record quartz–fluid inclusion isotope temperatures that \nagree with fluid inclusion data and cannot be explained by diffusion alone.  Also quartz \nand co-existing sulphides have similar δDFI and δ18OFI\n4. The modelling of solution–precipitation processes show that kinetic factors are a valid \nalternative to post-trapping re-equilibration for explaining differences between \nδ\n (see Tab. 3) \n18Ocalculated and δ18O\nThus the above, lend support that, in epithermal systems, δ\nFI \n18O determined on fluid inclusion \nwaters may be a better guide to the original isotopic composition of the hydrothermal fluid \nthan temperature-corrected quartz data (Fig. 5).  This is because δ18Oquartz in solution–\nprecipitation processes can be significantly different from δ18Oquartz at equilibrium for a given \ntemperature and δ18Ofluid.  However, in higher temperature (>300 ºC) hydrothermal systems, \nsuch as porphyry-Cu, Sn-W and orogenic-Au deposits, Dodson closure temperatures show \n 20 \nthat quartz and fluid inclusion water undergo post-trapping exchange.  Thus in these cases, the \nindirect method will always provide the best estimate of fluid δ18\nAlso, at Profitis Ilias, δ\nO \n18OFI contains a record of fluid processes not seen in δ18Ocalculated (Fig. \n5 and section 5.1).  First, this is probably because temperature estimates within paleo-\nhydrothermal systems are not precise enough to allow accurate reconstruction of variations in \nδ18O of the hydrothermal fluid.  For example, in a boiling epithermal system fluid \ntemperatures can vary by up to 50 to 70 °C over a vertical interval of only 100–200 m (Tab. \n1).  This can represent differences of nearly ten permil in fluid δ18O (i.e., the difference in \nboiling-curve estimated δ18O between 457 and 657 m elevations — Tab. 1).  Second, \nformation of quartz via an amorphous precursor (e.g. Dong et al., 1995) is a non-equilibrium \nprocess and can result in estimates of δ18Ofluid\n5.6 Implications for δ\n that are too heavy.  \n18\nAt Profitis Ilias combined δD–δ\nO analysis of quartz \n18Oquartz and δD–δ18OFI and comparison with the modern \ngeothermal system coupled with kinetic modelling of the data (Figs. 6 and 9) show that the \ndifferences in δ18Oquartz and δ18OFI can be related though a combination of extensive boiling \nand quartz formation via an amorphous precursor.  Whereas calculation of equilibrium fluid \ncompositions appears to over-estimate the fluid composition by + 8 to +10 ‰. If the Kinetic \nmodel is valid, this places limitations on the use of δ18Oquartz in low-temperature epithermal \nsystems to estimate δ18Ofluid where solution–precipitation processes operate.  This is because \nfailure to recognise them can result in significant errors in the estimation of δ18Ofluid.  \nObservations that indicate that δ18Oquartz is kinetically controlled and mitigate against the use \nof quartz to calculate fluid compositions are: \n 21 \n1. Textural information that indicates that it formed from an amorphous precursor (e.g. \nDong 1995).  This can be documented through careful petrography and \ncathodoluminescence studies. \n2. Fluid inclusion data that indicate that mineralisation is associated with extensive boiling \nand vaporisation (e.g. Simmons and Browne 1997, Scott and Watanabe, 1998; Kilias et \nal., 2001). \n3. Where mineralisation temperatures are less than 250 ºC, and data are available, \nsystematic differences between δ18Oquartz and δ18OFI\n6 Summary and conclusions \n can also indicate a kinetic control. \nIn summary, δD and δ18O in extracted fluid inclusion waters from the Profitis Ilias epithermal \nmineralisation were found to show a linear correlation that closely parallels the stable isotope \nsystematics in the active Milos geothermal system, with δD varying from –23.8 to –68.0 and \nδ18O from –3.7 to –7.8.  δ18O analysis of the quartz, using the same samples, showed a \nrestricted variation of 13.4–15.9 ‰ and correction of this data, employing a variety fluid \ninclusion temperature estimates, does not match δ18O in the corresponding fluid inclusion \nwaters. ∆18Ocorrected–FI ranges from + 8 to +12 ‰ and calculated Dodson closure temperatures \nfor quartz, at scales appropriate to fluid inclusions and at cooling rates compatible with the \nlifetime of a geothermal systems, indicate that at temperatures below 250 ºC these differences \ncannot be accounted for by post-trapping diffusional exchange of 18O between inclusion water \nand host quartz.  Thus, for the Profitis Ilias mineralisation, post-trapping re-equilibration is \nnot thought to be an appropriate process for explaining the observed ∆18Ocorrected–FI.  In our \ncase, solution–precipitation processes are preferred as modelling shows that differences, in \n 22 \nrelative terms, between δ18OFI and δ18Oquartz can be explained by kinetic processes.  However, \ninsufficient data and knowledge concerning the δ18\nThe results of diffusion and kinetic modelling coupled with independent lines of evidence, \nsuch as the consistency of δD\nO composition of possible silica precursors \nat temperatures above 150 ºC and fluid to solid ratios preclude a generalised reconstruction of \nfluid compositions using this method. \nFI and δ18OFI with other geochemical data and their similarity to \nthe isotope systematics of the modern systems, lead us to believe that fluid inclusion δ18O has \nthe potential to be a better estimator of oxygen isotope systematics in low-temperature \nhydrothermal systems than δ18Oquartz and fluid inclusion temperatures.  However, as there are \nonly two fluid inclusion δ18O studies in the epithermal environment, further data from other \nsystems are required to extend the applicability our findings.  In the first instance, these should \nconcentrate on boiling systems as these provide the best temperature constraints.  In addition, \ngood petrographic and geologic control is a pre-requisite for reliable interpretations. In our \ncase, this was achieved through detailed petrography and fluid inclusion microthermometry \nwithin a well-constrained spatial and geological framework (Kilias et al., 2001) that enabled \ncomparisons between a mineralised system and its modern analogue.  At a smaller scale, or in \nthe absence of a modern analogue for comparison careful cathodoluminescence petrography \ncoupled with localised isotopic analysis of the quartz will also fulfil the requirement.  Finally, \nrecent analytical developments for the rapid determination of δD and δ18O in small (0.1 µl) \namounts of water (Sharp et al., 2001) indicate it should be possible to routinely analyse \ninclusion waters without the need for the lengthy sample preparation and analytical procedures \nthat have to date hindered systematic investigations into the applicability of oxygen isotope \ndetermination of fluid inclusion water. \n 23 \n7 Acknowledgements \nThis work was funded by the British Council, The Greek General Secretariat of Research and \na Marie Curie Experienced Researcher Fellowship to JN (HPMF-CT-2000-00762).  Special \nthanks go to the JA Crossing and Y Simos, geologists at Midas SA, who allowed access to \ndrill-core and proprietary company data.  Drs. THE Heaton and B. Spiro are thanked for \nproviding impetus and encouragement during the research.  JN, MJL & TJS publish with the \npermission of the Director, British Geological Survey (NERC). \n23 \n8 References \nBodnar R.J., Reynolds T.J., and Kuehn C.A., 1985.  Fluid inclusion systematics in epithermal \nsystems.  In: Berger BR, Bethke PM (eds.): Geology and Geochemistry of \nEpithermal Systems, Rev. Econ. Geol., 2:  73–97. \nBriqueu L., Javoy M., Lancelot J.R. and Tatsumoto M., 1986.  Isotope geochemistry of recent \nmagmatism in the Aegean arc: Sr, Nd, Hf, and O isotopic ratios in the lavas of \nMilos and Santorini — geodynamic implications.  Earth Planet. Sci. Lett., 80:  \n41–54. \nClayton, R.N. and Mayeda, T.K., 1963.  The use of bromine pentafluoride in the extraction of \noxygen from oxide and silicates for isotopic analysis.  Geochim. et Cosmochim. \nActa, 27:  43–52. \nCraig, H., 1957.  Isotopic standards for carbon and oxygen and correction factors for mass \nspectromatic analysis of carbon dioxide.  Geochim. et Cosmochim. Acta ,12:  \n133–149. \nDeines, P. 1970.  Mass spectrometer correction factors for the detection of small isotopic \nvariation of carbon and oxygen.  Int. J. Mass Spectrom. Ion Phys., 4:  283–295. \nDodson, M.H., 1973.  Closure temperature in cooling geochronological and petrologic \nsystems.  Contrib. Mineral. Petrol., 40: 259–274.  \nDodson, M.H., 1979.  Theory of cooling ages.  In: Jaeger E. and Hunziker J.C. (Eds.): \nLectures in Isotope Geology, Springer-Verlag: 194–202.  \n24 \nDrummond. S.E. and Ohmoto, H., 1985.  Chemical evolution and mineral deposition in \nboiling hydrothermal systems. Econ. Geol., 80: 126–147. \nDubinina, E.O. and Lakshtanov, L.Z., 1997.  A kinetic model of isotopic exchange in \ndissolution-precipitation processes.  Geochim. et Cosmochim. Acta, 61:  2265–\n2271. \nFarver, J.R. and Yund, R.A. 1991.  Oxygen diffusion in quartz: Dependence on temperature \nand water fugacity.  Chem. Geol., 90: 55–70. \nFytikas, M., 1989.  Updating of the geological and geothermal research on Milos island.  \nGeothermics, 18:  485–496. \nHaas, J. L., Jr., 1977a.  Physical properties of the coexisting phases and thermochemical \nproperties of the H2\nHaas, J. L., Jr., 1977b.  Thermodynamic properties of the coexisting phases and \nthermochemical properties of the NaCl component in boiling NaCl solutions. \nUnited States Geological Survey Prof. Pap. B 1421-B: B1–B71 \nO component in boiling NaCl solutions.  United States \nGeological Survey Prof. Pap. B 1421-A: A1–A73 \nHayashi, K-I. Maruyama, T. and Satoh, H., 2001.  Precipitation of gold in a low-sulfidation \nepithermal gold deposit: insights from a submillimeter-scale oxygen isotope \nanalysis of vein quartz.  Econ. Geol., 96:  211–216. \nHedenquist, J.W., Reyes, A.G., Simmons, S.F. and Taguchi, S., 1992. The thermal and \ngeochemical structure of geothermal and epithermal systems: a framework for \ninterpreting fluid inclusion data.  European Journal Mineralogy, 4: 989–1015. \n25 \nHorita, J., Cole, D.R. and Wesolowski, D.J., 1995.  The activity-composition relationship of \noxygen and hydrogen isotopes in aqueous salt solutions: III. Vapor-liquid water \nequilibration of NaCl solutions to 350°C.  Geochim. et Cosmochim. Acta, 59:  \n1139–1151. \nKazahaya, K. and Matsuo, S., 1984.  A new ball-milling method for extraction of fluid \ninclusions from minerals.  Geochemical Journal, 19:  45–54. \nKilias, S., Naden, J., Cheliotis, I., Shepherd, T.J., Constandinidou, H., Crossing, J. and \nSimos, I., 2001.  Epithermal gold mineralisation in the active Aegean Volcanic \narc: the Profitis Ilias deposit, Milos island, Greece.  Mineral. Dep., 36:  32–44. \nKishima, N. and Sakai, H., 1980.  Oxygen-18 and deuterium determinations on a single water \nsample of a few milligrams. Analytical Chemistry, 52:  356–358. \nKita, I. and Taguchi, S., 1986.  Oxygen isotopic behavior of precipitating silica from \ngeothermal water.  Geochemical Journal, 20:  153–157.  \nKita, I., Taguchi, S. and Matsubaya, O., 1985.  Oxygen isotope fractionation between \namorphous silica and water at 34–93 ºC.  Nature, 314: 83–84.  \nLecuyer, C. and O’Neil, J.R., 1994.  Stable isotope compositions of fluid inclusions in \nbiogenic carbonates. Geochim. et Cosmochim. Acta, 58:  353–363. \nLiakopoulos A., 1987.  Hydrothermalisme et mineralisations metalliferes de l’ile de Milos \n(Cyclades–Grece).  Mem. Sc. Terre. Universite Paris, VI No. 87–36. \n26 \nLiakopoulos, A, Katerinopoulos, A, Markopoulos, T. and Boulegue J., 1991.  A \nmineralogical, petrographic and geochemical study of samples from wells in the \ngeothermal field of Milos Island (Greece).  Geothermics, 20:  237–256 \nLüders, L., Pracejus, B. and Halbach, P., 2001.  Fluid inclusion and sulfur isotope studies in \nprobable modern analogue Kuroko-type ores from the JADE hydrothermal field \n(Central Okinawa Trough, Japan).  Chem. Geol., 173:  45–58  \nMatsuhisa, Y., Goldsmith, J.R. and Clayton, R.N. 1978.  Mechanisms of hydrothermal \ncrystallization of quartz at 250°C and 15 kbar.  Geochim. et Cosmochim. Acta, \n42: 173–182. \nO’Neil, J.R., Adami, L.H. and Epstein, S., 1975. Revised value for the 18O fractionation \nbetween CO2\nO’Reilly, C., Jenkin, G.R.T., Feely, M., Alderton, D.H.M. and Fallick, A.E., 1997.  A fluid \ninclusion and stable isotope study of fluid evolution in the Galway Granite, \nConnemara, Ireland.  Contrib. Mineral. Petrol., 129:  120–142. \n and water at 25 °C. U.S. Geological Survey Journal of Research, 3:  \n623–624. \nOhba, T. Kazahaya, K. and Matsuo, S., 1995.  Diffusional 18\nOhba, T., and Matsuo, S., 1988.  Precise determination of hydrogen and oxygen isotope ratios \nof water in fluid inclusions of quartz and halite. Geochemical Journal, 22: 55–68. \nO loss from inclusion water in a \nnatural hydrothermal quartz from the Kaneuchi tungsten deposit, Japan.  \nGeochim. et Cosmochim. Acta, 59:  3039–3047. \nPapazachos, C.B. and Kiratzi, A.A., 1996.  A detailed study of the active crustal deformation \nin the Aegean and surrounding area.  Tectonophysics, 253:  129–153. \n27 \nPflumio, C., Boulegue, J., Liakopoulos, A. and Briqueu L., 1991.  Oxygen, hydrogen, \nstrontium isotopes and metals in the present-date and past geothermal systems of \nMilos island (Aegean arc).  In: Pagel and Leroy (eds.): Source, transport and \ndeposition of metals.  Balkema, Rotterdam, 107–112. \nPichavant M., Ramboz C. and Weisbrod A., 1982.  Fluid immiscibility in natural processes; \nuse and misuse of fluid inclusion data; I, Phase equilibria analysis; a theoretical \nand geometrical approach. Chem. Geol., 37: 1–27. \nRamboz C., Pichavant M. and Weisbrod A., 1982.  Fluid immiscibility in natural processes; \nuse and misuse of fluid inclusion data; II, Interpretation of fluid inclusion data in \nterms of immiscibility.  Chem. Geol., 37: 29–48.  \nRye, R.O. and O’Neil, J.R., 1968.  The O18\nScott A.M. and Watanabe Y., 1998.  \"Extreme boiling\" model for variable salinity of the \nHokko low-sulfidation epithermal Au prospect, southwestern Hokkaido, Japan \nMiner. Deposita, 33: 568–578. \n content of water in primary fluid inclusions from \nProvidencia, north-central Mexico.  Econ Geol., 63: 232–238. \nSimmons S.F. and Browne P.R.L., 1997.  Saline fluid inclusions in sphalerite from the \nBroadlands-Ohaaki geothermal system: A coincidental trapping of fluids being \nboiled toward dryness.  Econ. Geol., 92: 485–489. \nSharp, Z.D., Atudorei, V. and Durakiewicz, T., 2001.  A rapid method for determination of \nhydrogen and oxygen isotope ratios from water and hydrous minerals.  Chem. \nGeol., 178: 197–210. \nSheppard, S.M.F., 1986.  Characterization and isotopic variations in natural waters.  In:  \nValley, J.W., Taylor, H.P. Jr. and O’Neil, J.R. (Eds.), Stable isotopes in high \n28 \ntemperature geological processes.  Reviews in Mineralogy 16, Mineral. Soc. Am. \nWashington DC, 165–183. \nTsokas, G.N., 1996.  Interpretation of the Bouguer anomaly of Milos island (Greece).  J. \nVolcanol. Geotherm. Res., 72:  163–181 \nTruesdell, A.H., 1984.  Stable isotopes in hydrothermal systems.  In: Henley, R.W., Truesdell, \nA.H. and Barton, P.B (eds.), Fluid-mineral equilibria in hydrothermal systems, \nRev. in Econ. Geol., 1: 129–142. \nValley, J.W., 2001.  Stable isotope thermometry at high temperatures.  In Valley. J.W. and \nCole, D.R. (Eds.): Stable Isotope Geochemistry, Rev. Mineral. Geochem., 43: \n365–413. \nVityk, M.O., Krouse, H.R. and Demihov, Y.N., 1993.  Preservation of δ18\nWilkinson, J.J., Jenkin, G.R.T., Fallick, A.E. and Foster, R.P., 1995.  Oxygen and hydrogen \nisotopic evolution of Variscan crustal fluids, south Cornwall, U.K.  Chem. Geol., \n123: 239–254. \nO values of fluid \ninclusion water over geological time in an epithermal environment: Beregovo \ndeposit, Transcarpathia, Ukraine.  Earth and Plan. Sci. Lett., 119:  561–568. \nZhang, L., Liu, J.X., Zhou, H. and Chen Z.S., 1989.  Oxygen isotope fractionation in the \nquartz-water-salt system.  Econ. Geol., 84:  1643–1650. \n32 \nFig. 1. Geological map of Milos Island showing its position on the Aegean arc plus the \nlocations of mineralisation and the geothermal manifestations (modified after Fytikas 1989). \nFig. 2. Plot of sample depth versus δ18O comparing values obtained from inclusion water, \nquartz and δ18\nFig. 3. Graph of δD versus sample elevation, showing a general trend of increasing δD with \nincreasing sample depth. \nO calculated from fluid inclusion temperatures (see text for discussion) \nFig. 4. Combined stable isotope, fluid inclusion and assay graphs, showing how δ18O, δD, \nfluid inclusion Th and gold content vary with depth and how they are related to each other.  \nEach parameter shows a distinct change at approximately 430 m asl.  Both δ18\nFig. 5. Combined D\/H–δ\nO and δD \ndecrease rapidly, fluid inclusion homogenisation-temperatures change from showing only a \nnarrow range to being highly variable and gold contents in quartz start to increase and are \nlocally over 30 ppm. \n18\nFig. 6. Inset diagram shows a cross-section through a hypothetical spherical fluid inclusion \n(diameter r) with a halo of quartz (thickness a) that inclusion water can exchange δ\nO graph comparing directly measured and calculated data with the \nstable isotope systematics of the modern geothermal system.  Included for reference purposes \nare: (i) Two single stage steam separation trends for fluid with 5 wt% dissolved NaCl \n(calculated using the methodology of Truesdell et al., 1984; the steam tables of Haas 1977a,b; \nand the fractionation data of Horita et al., 1995).  (ii) The top left part of the magmatic water \nbox (Sheppard, 1986). (iii) The Mediterranean meteoric water line and Mediterranean \nseawater (see text for discussion of the data). \n18O \nthrough diffusion.  At distances > a the inclusion does not exchange with the quartz. A:  \n33 \nGraph of the volume ratio of a spherical quartz shell and fluid inclusion at different inclusion \nsizes and quartz shell thicknesses — inset graph shows volume ratio variation at low (<0.1) \nthicknesses.  At low volume ratios (< 0.05) any post trapping diffusive exchange will not \nsignificantly affect the isotopic composition of the fluid inclusion as the volume of the \ninclusion is significantly larger than the amount of quartz available for diffusive exchange.  \nThus, for inclusions not to be affected by post-trapping exchange effective diffusion distance \nmust not be greater than ~0.01 µm.  B: Graph of Dodson closure temperatures of quartz as a \nfunction of effective diffusion distance (a in inset).  Line I is a cooling rate reflecting the \nmaximum age and temperature (225 ºC) of the Profitis Ilias mineralisation and present day \nambient temperature (25 ºC) — this represents the lowest possible cooling rate.  Line II \nreflects a typical lifespan of a hydrothermal system (100 ka) and a temperature drop of 200 ºC \n(calculations use data of Farver and Yund, 1991 and an infinite cylinder diffusion model).  \nFrom A and B it is clear that for diffusion distances in the region of 0.01 µm the closure \ntemperature for cooling rates applicable to Profitis Ilias (between Line I and II) is greater than \nthe temperature of mineralisation (225 ºC). \nFig. 7. Silica–water fractionation factors for quartz, amorphous silica and colloidal silica. \nFig. 8. Calculated variations in the bulk isotopic composition of quartz formed from the \nprogressive dissolution–precipitation of a “colloidal” precursor. A:  Variation in δ18Oquartz as \nthe water to solid ratio changes from 0.05 to 10 at constant temperature (225 ºC), fluid \ncomposition (+3 ‰) and ∆0 (+14 ‰). B: Variation in δ18Oquartz as a function of temperature, \nwater to solid ratio and initial fluid composition at constant ∆0 (+14 ‰).  Numbers on the \ncurves refer to initial composition of the fluid (‰).  Filled circles are quartz compositions and \ntheir corresponding boiling curve temperatures given in Tab. 1.  See text for discussion. \n29 \nTable 1. Sample information and stable isotope results. Also shown are summary microthermometric dataa, gold-silver concentrationsa and \nboiling curve temperaturesa\n \n for each sample elevation. \nSample \nno. \nElevation  \n \n(m asl) \nSample \nwt. \n(g) \nFI water \nweight \n(mg) \nδ18Oquartz δ\n(‰) \n18OFI  δD\n(‰) (‰) \nFI Salinity \n \n(wt % NaCl \neq.) \nTh Boiling \ncurve T \n(°C) \n range \n \n(°C) \nG2185 657 1.4 0.5 15.4 –4.5 –28.7 6.1–6.8 150–160 89 \nG1746 621 0.5 2.5 15.5 –7.8 –51.0 5.0–5.5 213–243 149 \nG1810 613 0.5 0.3 15.1 –7.3 –47.8 4.5–4.5 161–284 156 \nG2374 551 1.5 1.2 14.2 –7.8 –68.0 3.4–5.6 190–234 188 \nG2245 499 0.5 3.7 14.6 –6.9 –41.5 3.3–4.9 205–215 204 \nG2255 457 0.5 1.6 13.9 –6.1 –39.8 3.1–4.7 190–219 213 \nG2424 421 0.7 1.2 14.2 –6.2 –50.5 0.0–7.5 215–253 220 \nG2267 405 1.4 3.7 14.3 –4.1 –33.3 6.5–7.8 223–249 223 \nG2268 403 1.2 2.5 13.7 –4.5 –34.9 4.4–9.2 208–231 223 \nG2283 365 1.2 0.3 13.4 –3.7 –23.8 3.1–6.2 219–251 230 \nPD3980 210 0.5 1.2 14.5 –0.3 –19.0 5.6–5.6 233–269 250 \naData from Kilias et al. 2001 \n30 \nTable 2 Comparison of fluid inclusion water δ18\n \nO with calculated fluid compositions for Profitis Ilias.  Calculated fluids use Zhang et al. \n(1989). \nSample no. Elevation \n(m asl) \nδ18OFI δ \n(‰) \n18Oquartz δ \n(‰) \n18Ocalculated δ\n(‰) \n(T = boiling \ncurve) \n18O\n(‰) \n(T = 225°C) \ncalculated δ18O\n(‰) \n(T = Mean \nT\ncalculated \nh\nboiling \ncurve T \n(°C) \n) \nMean \nTh\nG2185 \n \n(°C) \n657 –4.5 15.4 –7.1 4.8 0.0 89 155 \nG1746 621 –7.8 15.5 –0.3 4.9 5.2 149 230 \nG1810 613 –7.3 15.1 –0.1 4.5 4.4 156 223 \nG2374 551 –7.8 14.2 1.4 3.6 3.0 188 214 \nG2245 499 –6.9 14.6 2.8 4.0 3.2 204 211 \nG2255 457 –6.1 13.9 2.6 3.3 2.3 213 207 \nG2424 421 –6.2 14.2 3.3 3.6 4.4 220 241 \nG2267 405 –4.1 14.3 3.6 3.7 4.2 223 234 \nG2268 403 –4.5 13.7 3.0 3.1 2.5 223 215 \nG2283 365 –3.7 13.4 3.0 2.7 3.4 230 238 \nPD3890 210 –0.3 14.5 5.1 3.9 5.8 250 264 \n \n31 \nTable 3. Data from previous inclusion-water–quartz δ18\n \nO studies.  Calculated fluid compositions use Zhang et al. (1989). \nData source Sample \nno. \nSample \nwt. (g) \nFI water \nwt. (mg) \nδ18OFI δ\n(‰) \n18Oquartz δ\n(‰) \n18Ocalculate\nd \n∆\n(‰) \n18Ocalculated–FI Temperature \n(ºC) (‰) \nδDFI \nRye and O'Neil (1968) \n(‰) \n63-R-4 60.6 6.0 –3.7 n.a. — — — n.a. \n 63-R-23 29.5 6.2 –4.5 15.8 8.4 12.9 300 n.a. \n 63-R-23 29.5 6.2 –4.5 15.8 9.0 13.5 315 n.a. \nOhba et al. (1995) G-1 n.g. n.g. –0.3 n.a. — — — n.a. \n G-2 n.g. n.g. –1.1 14.5 7.1 8.2 300 n.a. \n G-2 n.g. n.g. –1.1 14.5 9.9 11.0 400 n.a. \n G-3 n.g. n.g. –5.8 14.5 7.1 12.9 300 n.a. \n G-3 n.g. n.g. –5.8 14.5 9.9 15.7 400 n.a. \n Y-1 n.g. n.g. –11.2 14.2 6.8 18.0 300 n.a. \n Y-1 n.g. n.g. –11.2 14.2 9.6 20.8 400 n.a. \nVityk et al. (1993) 486 QI 3–5 n.g. –5.6 9.2 –2.9 2.7 200 –72 \n 1308 QI 3–5 n.g. –5.0 7.5 –2.8 2.2 230 –80 \n 1522 QI 3–5 n.g. –5.9 9.7 0.3 6.2 250 –79 \n 496 QII 3–5 n.g. –7.1 8.7 –2.8 4.3 210 –56 \n 523 QII 3–5 n.g. –1.9 9.4 –2.7 –0.8 200 –66 \n 515 QII 3–5 n.g. –2.4 8.7 –2.8 –0.4 210 –79 \n 483 QII 3–5 n.g. –2.8 9.1 –3.0 –0.2 200 –84 \n A n.g. n.g. –3.5 — — — — –82 \n B n.g. n.g. –2.5 — — — — –79 \n 477 QII 3–5 n.g. –4.0 8.7 –3.4 0.6 200 –94 \n 100 QIII 3–5 n.g. –2.1 15.1 4.8 6.9 230 –55 \n 331 QIII 3–5 n.g. –0.9 17.9 7.6 8.5 230 –52 \n32 \nn.a. = not analysed; n.g. = not given; A = co-existing sphalerite; B = co-existing galena \nA\nllu\nv\niu\nm\nP\nro\nd\nu\nc\nts\no\nf\np\nh\nre\na\nti\nc\na\nc\nti\nv\nit\ny\nR\nh\ny\no\nlit\ne\ns\n(U\n.\nP\nle\nis\nto\nc\ne\nn\nc\ne\n)\nL\na\nv\na\nd\no\nm\ne\ns\nP\ny\nro\nc\nla\ns\nti\nc\ns\n(L\n.\nP\nle\nis\nto\nc\ne\nn\ne\n)\nD\no\nm\ne\nc\no\nm\np\nle\nx\ne\ns\na\nn\nd\nla\nv\na\nfl\no\nw\ns\nP\ny\nro\nc\nla\ns\nti\nc\ns\n(U\n.\nM\nio\nc\ne\nn\ne\n-\nL\n.\nP\nlio\nc\ne\nn\ne\n)\nM\na\nri\nn\ne\ns\ne\nd\nim\ne\nn\nts\n(U\n.\nM\nic\no\nc\ne\nn\ne\n-\nL\n.\nP\nlio\nc\ne\nn\ne\n)\nM\ne\nta\nm\no\nrp\nh\nic\nb\na\ns\ne\nm\ne\nn\nt\n(M\ne\ns\no\nz\no\nic\n)\nM\na\nin\na\nre\na\no\nf\nth\ne\nrm\na\nl\nm\na\nn\nif\ne\ns\nta\nti\no\nn\ns\nL\na\nv\na\nd\no\nm\ne\ns\n2\nk\nm\n2\n4\n°2\n0\n’\n2\n4\n°3\n0\n’\n3\n6\n°4\n0\n’\n3\n6\n°4\n5\n’\nF\nig\n.\n1\n.\nN\na\nd\ne\nn\ne\nt\na\nl.\nP\nro\nfi\nti\ns\nIl\nia\ns\nC\na\np\ne\nV\na\nn\ni\nT\nri\na\nd\ne\ns\n-G\na\nla\nn\na\nZ\ne\np\nh\ny\nri\na\nA\ne\ng\ne\na\nn\nv\no\nlc\na\nn\nic\na\nrc\nM\nilo\ns\nGre\nece\n200\n300\n400\n500\n600\n700\n-10 -5 0 5 10 15 20\nS\na\nm\np\nle\ne\nle\nv\na\nti\no\nn\n(m\na\ns\nl)\n\u0002\n18O (‰)\nFig. 2. Naden et al.\n\u0002\n18O\nFI\n\u0002\n18\nquartz\nO\n\u0002\n18\ncalculated\nO -- T = boiling curve\n\u0002\n18\ncalculated\nO -- T = 225 ºC\n\u0002\n18\ncalculated h\nO -- T = Mean T\n\u0002\n18\ncalculated h\nO -- T = Min T\n200\n300\n400\n500\n600\n700\n-70 -60 -50 -40 -30 -20 -10\nS\na\nm\np\nle\ne\nle\nv\na\nti\no\nn\n(m\na\ns\nl)\n\u0002D (‰)\nFig. 3. Naden et al.\n0 30 60\nAu (ppm)\n0 2000\nAg (ppm)\n-70 -40 -10\n\u0002D (‰)\n100 300 500\nTh range (°C)\ne\nle\nva\ntio\nn\n(m\na\nsl\n)\n150\n200\n250\n300\n350\n400\n450\n500\n550\n600\n650\n700\n-10\nQuartz\n0\n\u0002\n18\nFIO (‰)\n12 15 18\n\u0002\n18O (quartz ‰)\nFig. 4. Naden et al.\nFI\nBoiling @ 260 ºC; steam separation @ 80 ºC\nBoiling @ 260 ºC; steam separation @ 120 ºC\nMediterranean meteoric water\nFluid inclusion data\nRange in 18Ofluid calculated from\n18Oquartz\nusing minimum and mean fluid inclusion\nhomogenisation temperatures\n\u0002 \u0002\nGeothermal data\nMediterranean sea water\n-70\n-60\n-50\n-40\n-30\n-20\n-10\n0\n10\n20\n-8 -6 -4 -2 0 2 4 6 8\n\u0002\nD\n‰\nVS\nM\nO\nW\n(‰\n)\n\u0002\n18\nVSMOWO (‰)\nFig. 5. Naden et al.\nm\nag\nm\nat\nic\nw\nat\ner\n150\n250\n350\n450\n1 10 100 1000 10000\nCooling rate (ºC\/Ma)\nTe\nm\npe\nra\ntu\nre\n(ºC\n)\n0\n0.2\n0.4\n0.6\n0.8\n1.0\n0.2 0.4 0.6 0.8 1.0\nVo\nlu\nm\ne\nra\ntio\nQuartz thickness ( m)\u0002\nq\nuartz\nr\na\nfluid\ninclusion\nA\nB\n5 l id\ncl io0 m f u in\nus n\n\u0002\n2 m\nfluid in\nclusio\nn\n0 \u0002\n10\nm\nflui\nd in\nclu\nsio\nn\n\u00025\nflu\nd\nnc\nu\nion\n\u0002\nm\ni\ni\nl s\n100\nm\n\u0002\n10 m\u0002\n1 m\u0002\n0.1 m\u0002\n0.0 m1 \u0002\nI II\n5 \u0002\nm\n10\u0002\nm\n20 m\u0002\n50 m\u0002\n0 0.1\n0.10\n0.05\nenlargement of\nshaded area\nFig. 6. Naden et al.\nKita et al. (1985) – Amorphous silica\nZhang et al. (1989) – Quartz\nMatsuhisa et al. (1979) – Quartz\nKita & Taguchi (1986) – Colloidal silica\n0\n10\n20\n30\n40\n50 100 150 200 250 300\nTemperature (ºC)\n\u0002\n18\nO\nw\na\nte\nr\nsi\nlic\na–\nFig. 7. Naden et al.\nw\/M = 10\nEquilibrium\nw\/M =\n1\nw\/M =\n0.1\nw\/M = 0.05\n50\n100\n150\n200\n250\n300\n9 11 13 15 17 19 21 23\n13\n14\n15\n16\n17\n0.0 0.2 0.4 0.6 0.8 1.0\nproportion of \"colloidal\" SiO\ntransformed to quartz 2\n\u0002\n18\nqu\nar\ntz\nO\n(‰\n)\nA\nB\nw\/M=0.01\n0 1 2\n\u0003\n0\n= +14 (‰)\n\u0002\n18\nquartzO (‰)\nTe\nm\npe\nra\ntu\nre\n(ºC\n)\n\u0002\n18\nfluidO = +3 ‰\n\u0003 \u0003\n18O ( ) = +14 ‰colloidal silica–fluid 0\n1\n1\nnumbers at end of lines\nindicate O\u000218 fluid\nw\/M=0.25\nequ\nilibri\num\nq r\nt\nua\nz\nFig. 8. Naden et al.\n"}