{"doi":"10.1103\/PhysRevB.76.214513","coreId":"70627","oai":"oai:eprints.lancs.ac.uk:11188","identifiers":["oai:eprints.lancs.ac.uk:11188","10.1103\/PhysRevB.76.214513"],"title":"Generalized Galitskii approach for the vertex function of a Fermi gas with resonant interaction.","authors":["Vagov, A.","Schomerus, Henning","Shanenko, A."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"We present a generalized Galitskii approach for the Bethe-Salpeter equation for the two-particle vertex function of a Fermi system with the resonant interaction by accounting for the resonant state in the scattering potential and utilizing the universal form of the resonant scattering amplitude. The procedure can be carried out both for the normal as well as for the condensate state. In both cases, the vertex function in the vicinity of the resonance is shown to formally coincide with that obtained for a weakly attractive Fermi gas. Thus we justify the popular calculational framework in which results for the weakly attractive Fermi gas are formally extrapolated into the domain of strong coupling, and further to the repulsive side of the resonance, where molecular states are formed","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/70627.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/11188\/1\/Galitskii.pdf","pdfHashValue":"420a5ad882ae75485b491ae13f46e0b3206d7d47","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:11188<\/identifier><datestamp>\n      2018-01-24T00:03:35Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D51:5143<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Generalized Galitskii approach for the vertex function of a Fermi gas with resonant interaction.<\/dc:title><dc:creator>\n        Vagov, A.<\/dc:creator><dc:creator>\n        Schomerus, Henning<\/dc:creator><dc:creator>\n        Shanenko, A.<\/dc:creator><dc:subject>\n        QC Physics<\/dc:subject><dc:description>\n        We present a generalized Galitskii approach for the Bethe-Salpeter equation for the two-particle vertex function of a Fermi system with the resonant interaction by accounting for the resonant state in the scattering potential and utilizing the universal form of the resonant scattering amplitude. The procedure can be carried out both for the normal as well as for the condensate state. In both cases, the vertex function in the vicinity of the resonance is shown to formally coincide with that obtained for a weakly attractive Fermi gas. Thus we justify the popular calculational framework in which results for the weakly attractive Fermi gas are formally extrapolated into the domain of strong coupling, and further to the repulsive side of the resonance, where molecular states are formed.<\/dc:description><dc:date>\n        2007<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:relation>\n        http:\/\/dx.doi.org\/10.1103\/PhysRevB.76.214513<\/dc:relation><dc:identifier>\n        Vagov, A. and Schomerus, Henning and Shanenko, A. (2007) Generalized Galitskii approach for the vertex function of a Fermi gas with resonant interaction. Physical Review B, 76. p. 214513. ISSN 1550-235X<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/11188\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1103\/PhysRevB.76.214513","http:\/\/eprints.lancs.ac.uk\/11188\/"],"year":2007,"topics":["QC Physics"],"subject":["Journal Article","PeerReviewed"],"fullText":"Generalized Galitskii approach for the vertex function of a Fermi gas with resonant\ninteraction\nA. Vagov and H. Schomerus\nDepartment of Physics, Lancaster University, Bailrigg, Lancaster, LA1 4YB, UK\nA. Shanenko\nDepartement Fysica, Universiteit Antwerpen, Groenenborgerlaan 171, B-2020 Antwerpen, Belgium\n(Dated: August 4, 2008)\nWe present a generalized Galitskii approach for the Bethe-Salpeter equation for the two-particle\nvertex function of a Fermi system with resonant interaction by accounting for the resonant state\nin the scattering potential and utilizing the universal form of the resonant scattering amplitude.\nThe procedure can be carried out both for the normal as well as for the condensate state. In both\ncases, the vertex function in the vicinity of the resonance is shown to formally coincide with that\nobtained for a weakly attractive Fermi gas. Thus we justify the popular calculational framework in\nwhich results for the weakly attractive Fermi gas are formally extrapolated into the domain of strong\ncoupling, and further to the repulsive side of the resonance, where molecular states are formed.\nPACS numbers: 03.75.Ss,03.75.Hh\nI. INTRODUCTION\nThe problem of an interacting Fermi system with\nstrong resonant coupling is relevant to many areas of\nphysics, in particular, ultracold gases1–3 and high Tc\nsuperconductors.1 Experimental insight into this prob-\nlem has recently been obtained using ultracold atomic 6Li\nand 40K gases,2,3 in which the s-wave scattering length a\ncan be tuned from positive (repulsive) to negative (at-\ntractive) values by crossing a Feshbach resonance, at\nwhich the scattering length diverges. These experiments\nstarted with the successful formation of long-living paired\nfermions in the strong-coupling regime,4 which were sub-\nsequently seen to condense into a Bose-Einstein conden-\nsate (BEC) of bound molecular states.5–7 Soon afterward\nthe interaction was tuned to the attractive side,8–11 and\nit was established that the condensate crosses over to a\nBCS superfluid of extended Cooper pairs.12–17\nThe first theoretical studies of the BCS-BEC crossover\nwere initiated not long after the development of the BCS\ntheory of superconductivity itself, when it was noticed\nthat the nonzero solution of the BCS gap equation, com-\nplemented with the condition of a constant number of\nparticles and regularized to eliminate an ultraviolet di-\nvergency, can be smoothly extrapolated to the domain\nof positive scattering lengths (without diverging at the\nresonance), where it describes molecular states.18–21\nThis mean-field interpolation between the two types of\ncondensates is believed to be most accurate at T = 0,\nwhere bosonic excitations of paired fermions (Cooper\npairs or molecular states of finite momentum) are not\npopulated. Subsequent works established that the pair\nexcitations induce fluctuation corrections which modify\nthe thermodynamics especially in the strong-coupling\nlimit.22–27 In many of these works the fluctuation cor-\nrections are treated within the self-consistent T -matrix\napproximation which involves the ladder approximation\nfor the vertex function.\nThe calculations beyond the mean field approxima-\ntion in the BCS theory were initiated by Gor’kov and\nMelik-Barkhudarov;28 similar types of corrections were\nalso applied to the BCS-BEC crossover.29 Other recent\napproaches combine the ladder approximation with the\nfully self-consistent solution for the single particle Green\nfunction,30 and account for the scattering of the weakly\nbound composite bosons. It should be noted that the\nscattering length for the two molecules in vacuo can be\ncalculated exactly,31 providing a useful guidance for the\nmany-body calculations. Furthermore, the BEC-BCS\ncrossover can also be studied numerically in Monte Carlo\nsimulations,32–34 or via the renormalization group analy-\nsis with ε and 1\/N expansions at the unitary point.35–39\nComparison with experiment and Monte-Carlo calcu-\nlations reveal that the ladder approximation captures\nthe qualitative features for various physical quantities\nin the BCS-BEC crossover far better than it could be\nexpected.40,41 This is also astonishing since the corre-\nsponding Bethe-Salpeter equation is conventionally de-\nrived by assuming the constant approximation for the\nscattering matrix,42 which does not explicitly account\nfor the resonant state. This approximation is strictly\nvalid only for a weakly attracting Fermi gas. In order to\nstudy the strong-coupling limit, the resulting expressions\nare formally extrapolated, and these expressions are also\nused on the repulsive side of the resonance. Curiously,\nthey then capture molecular states of the correct energy,\nand also recover the scattering length for the molecules\nin the Born approximation. Moreover, the results turn\nout to be nondivergent at resonance. These observations\nhave motivated several works which address the justi-\nfication of solving the Bethe-Salpeter equation for the\nstrong coupling case and in the presence of bound molec-\nular states. In the context of high-Tc two-dimensional\nsuperconductors the validity of the extrapolation pro-\ncedure for the strong coupling regime was discussed by\nRanderia et al.43, while for the ultracold Fermi gases the\n2properties of the resonant scattering amplitude were used\nby Combescot44 to search for the universal form of the\nscattering matrix which would be applicable close to the\nresonance while recovering both limiting cases far from\nit.\nIn this work we solve the Bethe-Salpeter equation for\nthe two-particle vertex function of a Fermi system near\nthe resonance, and show that the resulting expression\ncoincides with the result of the extrapolation and regu-\nlarization procedure. Our derivation proceeds via an ex-\ntension of the Galitskii formalism,42 which reformulates\nthe Bethe-Salpeter equation by using the scattering am-\nplitude instead of the scattering potential. In its original\nversion, the Galitskii formalism is unsuitable to describe\nresonant scattering, since it does not explicitly account\nfor the resonant state and as a result treats the case of\npositive scattering length a as a repulsive Fermi system.\nIn our derivation we do not use any assumptions beyond\nthe condition that the resonant state induces a broad\nFeshbach resonance. The state is eliminated by using\nthe completeness and orthogonality of the set of all scat-\ntering states. This procedure can be carried out both for\nthe normal state as well as for the condensate state, and\nleads to a fully analytical solution of the Bethe-Salpeter\nequation which is inherently valid in the vicinity of the\nresonance, as well as in the domain of the positive scat-\ntering length. The resulting expressions of this formal\nderivation turn out to be identical to the BCS extrapo-\nlation scheme with the renormalized contact interaction.\nFurthermore, our derivation constitutes a reorganization\nof the ladder approximation which demonstrates that the\nrelevant expansion parameter does not diverge at reso-\nnance. Thus we establish a firm basis for the common\nconceptual framework which is used both in the mean\nfield description of the BCS-BEC crossover, as well as in\nmany calculations accounting for the fluctuation correc-\ntions.\nThis paper is organized as follows. Section II defines\nthe microscopic Fermi model on which all considerations\nare based. In Section III we present the modified Galit-\nskii formalism for the Fermi gas in the normal state. In\nSection IV we present the derivation for the Fermi sys-\ntem in the condensate state, and also briefly discuss the\ngap equation. The results of this paper are summarized\nin Section V.\nII. SINGLE-CHANNEL MODEL FOR THE\nRESONANTLY INTERACTING FERMI GAS\nIn order to describe an ultracold gas of fermionic atoms\nin the vicinity of a Feshbach broad resonance we use the\nstandard single-channel Hamiltonian\nH =\n∑\nα\n∫\ndx\n{\nψ†α(r)\n(\n− h¯\n2∇2\n2m\n− µ\n)\nψα(r)\n}\n+\n1\n2\n∑\nα,β\n∫\ndrdr′ψ†α(r)ψ\n†\nβ(r\n′)Uαβ(r− r′)ψβ(r′)ψα(r),\n(1)\nwhere ψα(r) is a fermionic field operator for a particle\nwith spin α. In the following we work in the units m ≡ 1,\nh¯ ≡ 1, and also set Boltzmann’s constant kB ≡ 1. The\neffective scattering potential Uαβ(r) describes resonant\nscattering of particles of opposite spin in the s-wave chan-\nnel. In the vicinity of a broad resonance with effective\ninteraction radius r0 \u001c k−1F (where kF is the Fermi mo-\nmentum), the scattering amplitude in the s-wave channel\ntakes the universal form45\nf(k) ≈ − 1\nη + i|k| , (2)\nwhere η = a−1 is the inverse scattering length. The scat-\ntering length a diverges at resonance, η = 0. For η < 0\nthe resonant level lies in the continuum, and the inter-\naction is attractive. For η > 0 the resonant level turns\ninto a bound state, and the interaction is repulsive. In\nthe BCS limit η → −∞, the interaction mediates the\nformation of Cooper pairs, which are weakly bound in\nmomentum space. In the BEC limit η → +∞, the inter-\naction mediates the formation of molecular states, which\nare weakly bound in real space. Because these notions\nrefer to the condensate phase, we more broadly speak of\nthe Fermi limit for η → −∞, and of the Bose limit for\nη → +∞.\nIt should be stressed that the Hamiltonian (1) is purely\nfermionic, and can be contrasted to the more detailed\nFermi-Bose models which explicitly account for a bound\nmolecular state in the closed channel.25,46–48 A great deal\nof work has been carried out in the past to give a detailed\njustification of the validity of both models and, in par-\nticular, to show their equivalence in the strong-coupling\nregime of a broad Feshbach resonance.49–54 The univer-\nsality arises for a combination of two facts. Firstly, at\nη = 0 the scattering length diverges, which renders the\nFermi energy EF = k2F \/2 as the only relevant energy\nscale for the thermodynamics.55 Secondly, in this unitary\nlimit the contribution of the closed channel becomes neg-\nligible, which has been directly tested in experiments on\n6Li,56 even though the situation in 40K may be a matter\nof debate.57,58\nIII. MODIFIED GALITSKII FORMALISM FOR\nRESONANT SCATTERING\nWe first assume that the Fermi gas is in the normal\nstate. In the ladder approximation, the vertex function\n3Γ(p1, p2; p3, p4) is then determined by the Bethe-Salpeter\nequation\nΓ(p1, p2; p3, p4) = u(p1 − p3)− T\n∑\nq0\n∫\ndq\n(2pi)3\nu(q)\n×G(p1 − q)G(p2 + q)Γ(p1 − q, p2 + q; p3, p4), (3)\nwhere spin indices are omitted for clarity, pi = (pi,0,p)\nis the 4D energy-momentum vector of an incoming (i =\n1, 2) or outgoing (i = 3, 4) particle, u(q) is the momen-\ntum representation of the interaction potential, and\nG(q) =\n1\nq0 − ξq , ξq =\nq2\n2\n− µ, (4)\nis the Green function of a noninteracting Fermi system.\nWe use the notation q = (q0,q), where q denotes the\nthree-dimensional momentum vector and q0 = ipiT (2n+\n1) is the Matsubara frequency.\nIn solving Eq. (3) one follows the conventional\nstrategy42, developed for the T = 0 case, where the po-\ntential u(q) is eliminated in favor of the vacuo vertex\nfunction Γ0, defined as the solution of Eq. (3) for two\nparticles in absence of all the other particles, i.e., by set-\nting µ = 0. An extension of this strategy for the finite\ntemperature case is conveniently achieved by a subse-\nquent analytic continuation of the energy argument in\nΓ0 as\nE = g0 + 2µ− g2\/4. (5)\nHereafter, we denote the total momentum of the scat-\ntered particles as g = p1 + p2 = (g0,g), while p =\n(p1 − p2)\/2 and p′ = (p3 − p4)\/2 are the relative mo-\nmenta before and after the scattering event, respectively.\nEliminating u(p) in Eq. (3), the Bethe-Salpeter equa-\ntion takes the form\nΓ(p,p′, g) = Γ0(p,p′, g)\n−\n∫\nd3q\n(2pi)3\nΓ0(p,q, g)K(q, g)Γ(q,p′, g). (6)\nThe kernel K is defined as\nK(q, g) = T\n∑\nq0\nG\n(g\n2\n− q, g0 − q0\n)\nG\n(g\n2\n+ q, q0\n)\n+\n1\nE − q2 . (7)\nUsing Eq. (4) one obtains an explicit expression of the\nkernel,\nK(q, g) =\nnF (ξ+) + nF (ξ−)\nE − q2 , (8)\nwhere nF (ε) = [exp(ε\/T ) + 1]−1 is the Fermi function\nand\nξ± =\n1\n2\n(g\n2\n± q\n)2\n− µ. (9)\nIn the Galitskii approach (see, e.g., Ref. 42), the vacuo\nvertex function Γ0 is found by relating it to the two-\nmomentum scattering amplitude f(p,k). However, the\noriginal formalism does not account for a possible bound\nmolecular state in the scattering potential. In the follow-\ning we assume that the scattering potential u(q) allows\nfor a single bound state, with eigenfunction φ(x) and\neigenvalue λ.\nIn the first step, Γ0 is written as an integral\nΓ0(p,p′, g) =\n∫\nd3q\n(2pi)3\nu(q)χ(p− q,p′, g), (10)\nwhere the scattering state χ(p,p′, g) satisfies the equa-\ntion\n(E − p2 + i0)χ(p,p′, g)−\n∫\nd3q\n(2pi)3\nu(q)χ(p− q,p′, g)\n= (2pi)3(E − p2 + i0)δ(p− p′). (11)\nThe left-hand side of this equation is equivalent to a\nSchro¨dinger equation in momentum space. Therefore,\nχ(p,p′, g) can be written using the complete set of solu-\ntions of the Schro¨dinger equation,\nχ(p,p′, g) = (E − p′2 + i0)\n∫\nd3k\n(2pi)3\nψk(p)ψ∗k(p\n′)\nE − k2 + i0\n+\nE − p′2 + i0\nE − 2λ+ i0 φ(p)φ\n∗(p′), (12)\nwhere ψk(p) is the Fourier transform of the scatter-\ning state ψk(r) with momentum k. The last term of\nthis expression explicitly accounts for the bound state\nφ(p). The states ψk(p) can be expressed via the two-\nmomentum scattering amplitude f(p,k),\nψk(p) = (2pi)3δ(p− k) + f(p,k)k2 − p2 + i0 . (13)\nInserting this expression into Eq. (12) one obtains\nχ(p,p′, g) = ψp′(p) +\n∫\nd3k\n(2pi)3\nψk(p)f∗(p′,k)\n×\n(\n1\nE − k2 + i0 +\n1\nk2 − p′2 − i0\n)\n+\nE − p′2 + i0\nE − 2λ+ i0 φ(p)φ\n∗(p′). (14)\nAfter substituting Eq. (14) into Eq. (10) one obtains Γ0\nas a sum of two terms\nΓ0 (p,p′, g) = ΓG0 (p,p\n′, g) + Γb0 (p,p\n′, g) . (15)\nThe first term in Eq. (15) recovers the original Galitskii\nresult\nΓG0 (p,p\n′, g) = f (p,p′) +\n∫\nd3k\n(2pi)3\nf (p,k) f∗ (p′,k)\n×\n{\n1\nE − k2 + i0 +\n1\nk2 − p′2 − i0\n}\n. (16)\n4The second term in Eq. (15) originates from the bound\nstate and is given by\nΓb0 (p,p\n′, g) =\nE − p′2\nE − 2λ\n∫\nd3q\n(2pi)3\nu(q)φ(p− q)φ∗(p′).\n(17)\nThis expression still explicitly depends on the bound\nstate, and at first glance it appears that detailed knowl-\nedge of φ(p) is necessary in subsequent calculations.\nHowever, φ(p) can be eliminated by relating it to f(k,p).\nTo establish this relation we utilize the Schro¨dinger equa-\ntion for φ(p) in the momentum representation\n(2λ− p2)φ(p) =\n∫\nd3q\n(2pi)3\nu(q)φ(p− q) (18)\nand the completeness relation∫\nd3k\n(2pi)3\nψk(p)ψ∗k(p\n′) + φ(p)φ∗(p′) = (2pi)3δ(p− p′).\n(19)\nMultiplying both side of Eq. (17) by φ(p), then using\nEq. (19) and the definition (13) one obtains the correc-\ntion of the Galitskii result due to the contribution of the\nmolecular state as\nΓb0 (p,p\n′, g) =\nE − p′2\nE − 2λ\n2λ− p2\np2 − p′2 − i0\n{∫\nd3k\n(2pi)3\nf (p,k)\n× f∗ (p′,k)\n(\n1\nk2 − p′2 − i0 −\n1\nk2 − p2 + i0\n)\n+ f(p,p′)− f∗(p′,p)\n}\n. (20)\nEquations (15), (16) and (20) reduce the calculation\nof the vacuo vertex to that for the two-momentum scat-\ntering amplitude f(p,k), defined by Eq. (13). This am-\nplitude is obtained by solving the Lippmann-Schwinger\nequation. In the weak-scattering limit, f(p,k) can be ap-\nproximated by a constant 4pi\/η. Following Eq. (15), this\nleads to a constant approximation for Γ0, as well. Since\nthe vertex function then does not possess any poles, the\nconstant approximation cannot be used to describe the\nbound states. In a more accurate analysis, applicable\nclose to the resonance as well as in the limits η → ±∞,\none can utilize the fact that in the vicinity of a reso-\nnance the two-particle scattering amplitude for s-wave\nscattering f(p,k) assumes as similar universal form as\nthe single-particle scattering amplitude f(k),45\nf(p,k) =\n4pi\nη + i|k| , (21)\nwhere in general η depends on p and k. For small mo-\nmenta, η approaches a constant equal to the inverse scat-\ntering length. The leading corrections are quadratic,\n∝ k2 and ∝ p2, but the coefficients for these terms are\nproportional to the effective radius of the scattering po-\ntential r0.42,45 Under the condition of a broad resonance\none has r0kF \u001c 1. Therefore, these terms can be ne-\nglected and η in Eq. (21) can be assumed constant, equal\nto the inverse scattering length. On the molecular side of\nthe resonance, where the potential permits a bound state,\nthe inverse scattering length is furthermore related to the\nbound state energy via 2λ = −η2.45\nIt should be noted that Eq. (21) reduces to the cor-\nrect constant expressions in the weak-coupling limits η →\n±∞, and also satisfies the optical theorem; as we will see\nlater, these observations are strongly linked to the suc-\ncess of the conventional extrapolation-and-regularization\nprocedure for the vertex function.\nSubstituting Eq. (21) into Eq. (16) when η < 0 and\ninto Eqs. (16) and (20) when η > 0 and using 2λ =\n−η2 one obtains a simple expression for the vacuo vertex\nfunction as\nΓ0(E) =\n4pi\nη + i\n√\nE\n, (22)\nwhere the branch cut of the square root lies on the real\nsemi-axis E > 0, such that on the first Riemann sheet\ni\n√−1 = −1. Recalling the definition of E one sees that\nthe vacuo vertex function only depends on the total mo-\nmentum and energy of the molecular pair. Equation (22)\nis applicable on both sides of the resonance and does not\nhave any singularity at the resonance. On the repulsive\nside η > 0, Eq. (22) has a pole at E = −η2, which de-\nscribes a bound state with binding energy η2. On the\nattractive side η < 0, the pole is absent: it is located on\nthe unphysical second Riemann sheet of complex energy\nE. At resonance, Eq. (22) yields a square root singular-\nity, which is different from the simple pole obtained in\nRef. 44.\nFor comparison it is instructive to recalculate Γ0 for\na repulsive potential η > 0 using the original Galitskii\nresult (16), i.e., without the bound state. In this case\none obtains a different expression\nΓ0 (p′, E) = 4pi\n(\n2η\nη2 + p′2\n− 1\nη − i√E\n)\n. (23)\nContrary to Eq. (22), Eq. (23) does not have a pole that\ncorresponds to the bound state. Equations (22) and (23)\nexplicitly distinguish between potentials that have the\nsame scattering length but do or do not permit a bound\nstate, respectively. We note that the series expansion of\nEqs. (22) and (23) with respect to large η differs only in\nthe third-order term. Therefore, both Eqs. (22) and (23)\nyield the same result when the Bethe-Salpeter equation\n(6) is solved in a second-order approximation, as done in\nthe original Galitskii formalism.42\nWe now proceed with the solution of Eq. (6) for the\ntwo-particle scattering amplitude (22). In doing so, we\nperform the analytical continuation defined by Eq. (5).\nThe solution can then be written as\nΓ(g) =\n{\nΓ−10 +K(g)\n}−1\n=\n4pi\nη + i\n√\nE + 4piK(g)\n, (24)\n5where\nK(g) =\n∫\nd3q\n(2pi)3\ntanh(ξ+\/2T ) + tanh(ξ−\/2T )− 2\n2(q2 − E) .\n(25)\nIn the limit η →∞, µ→ −∞, where the system is domi-\nnated by the molecular states, the vertex (24) reduces to\nthe vacuo vertex function (22).\nIn the final step of the derivation we integrate the last\nterm in Eq. (25) by parts. This cancels the term i\n√\nE in\nEq. (24), yielding\nΓ(g) =\n4pi\nη + K˜(g)\n, (26a)\nwhere\nK˜(g) =\n∫\nd3q\n4pi2\n{\ntanh(ξ+\/2T ) + tanh(ξ−\/2T )\nq2 − E −\n2\nq2\n}\n.\n(26b)\nThis expression coincides precisely with the widely used\nextrapolated weak-coupling result,1,2 including the ultra-\nviolet regularization for the contact interaction (see, e.g.,\nRef. 59). The derivation procedure above demonstrates\nthat in the ladder approximation, this expression remains\nstrictly valid in the vicinity of the resonance, as well as\non the molecular side η > 0. The reason for the fact that\nthe vertex function (26), originally derived in the limit\nη → −∞, correctly describes a molecular bound state\nfor η > 0 lies in the fact that Γ approaches Γ0 in Eq.\n(22). There is also another, more intuitive reason why\nthe formal extrapolation of the results for the weakly\ninteracting Fermi limit to the domain η > 0 correctly de-\nscribes the case with a molecular bound state and not the\nweakly repulsive Fermi gas. For a purely repulsive poten-\ntial without such a state, the resonant limit η → 0 can\nonly be realized when the effective radius of the potential\nalso becomes infinite. This would be in conflict with the\ncontinuity of the vertex function (26) as a function of η,\nwhich also holds across the resonance at η = 0.\nIV. VERTEX FUNCTION IN THE\nCONDENSATE STATE\nThe modified Galitskii approach described above can\nbe equally applied to solve the Bethe-Salpeter equation\nfor the vertex function in the condensate system. The\ncondensate system has normal as well as anomalous ver-\ntex functions (with four incoming or outgoing lines) and\nthe resulting Bethe-Salpeter equation becomes a system\nof equations60\nΓ(p1, p2; p3, p4) = u(p1 − p2)− T\n∑\nq0\n∫\nd3q\n(2pi)3\nu(q){\nG(p1 − q)G(p2 + q)Γ(p1 − q, p2 + q; p3, p4)\n+ F (p1 − q)F (p2 + q)Θ(p1 − q, p2 + q; p3, p4)\n}\n, (27)\nΘ(p1, p2; p3, p4) = −T\n∑\nq0\n∫\nd3q\n(2pi)3\nu(q){\nG(q − p1)G(−p2 − q)Θ(p1 − q, p2 + q; p3, p4)\n+ F ∗(p1 − q)F ∗(p2 − q)Γ(p1 − q, p2 + q; p3, p4)\n}\n, (28)\nThe normal and anomalous Green functions G and F ,\nrespectively, are defined as\nG(q) =\nq0 + ξq\nq20 −∆2q\n, F (q) =\n∆\nq20 −∆2q\n, (29)\nwhere ∆ is the BCS single particle spectral gap, related\nto the condensate density, and\n∆q =\n√\nξ2q + ∆2, (30)\nwhile ξq is given in Eq. (4). Solution of this system\nalong the lines of the Galitskii formalism outlined in the\nprevious section yields the algebraic system\nΓ(g) = Γ0(g){1−K(g)Γ(g)− S(g)Θ(g)},\nΘ(g) = −Γ0(−g){K(−g)Θ(g) + S∗(g)Γ(g)}, (31)\nwhere the kernel K(g) is defined as the integral of Eq. (7)\nover k and the Green function, G, defined by Eq. (29)\nwhile S(g) is\nS(g) =\n∫\nd3q\n(2pi)3\nT\n∑\nk0\nF\n(g\n2\n− q\n)\nF\n(g\n2\n+ q\n)\n. (32)\nThe algebraic pair of Eqs. (31) is solved by\nΓ(g) =\nη + i\n√\nE + 4piK(−g)\nΞ(g)\n, Θ(g) =\n4piS∗(g)\nΞ(g)\n, (33)\nwhere the common denominator is given by\nΞ(g) = (η + i\n√\nE + 4piK(g))(η + i\n√\nE + 4piK(−g))\n− 16pi2S(g)S∗(g). (34)\nAs in the normal case the partial integration in the nor-\nmal kernel removes i\n√\nE and the result for the vertex be-\ncomes equivalent to that in the weakly coupled neutral\nBCS system, which again by the virtue of the derivation\nis valid for arbitrary η, including η = 0.\nWe conclude the analysis by a brief discussion of the\ngap equation, which determines the order parameter ∆.\nAccording to the Thouless criterion, the stability of the\n6condensate requires that the bosonic excitation spectrum\ndefined by the poles of Γ is gapless. This yields\nη + i\n√\nE + 4piK(0) + 4piS(0) = 0. (35)\n[The second possible equation with the minus sign in\nfront of S(0) yields instabilities in the corresponding\nbosonic excitation spectrum.] The explicit form of Eq.\n(35) is\n−η = 2\npi\n∫ ∞\n0\ndq\n{\nq2\n2∆q\ntanh\n[\n∆q\n2T\n]\n− 1\n}\n. (36)\nThis is the familiar BCS gap equation for a weakly inter-\nacting BCS system. However, as the underlying vertex\nfunction (33), Eq. (36) is valid (within the mean-field\napproximation) in the vicinity of the resonance as well\nas on its repulsive side, η > 0. The observation that at\nη > 0 this mean-field gap equation, combined with the\ncondition of the constant particle density, correctly de-\nscribes the bound molecular states (see, e.g., Refs. 18 and\n21) is again ensured by the correct limit Γ → Γ0 of the\nvertex function in the molecular limit η →∞, µ→ −∞.\nV. CONCLUSIONS\nIn this work we have presented a procedure of solv-\ning the Bethe-Salpeter equation for the two-particle ver-\ntex functions in the ladder approximation in the vicin-\nity of a broad resonance, as encountered for ultracold\nFermi gases close to a Feshbach resonance. In order to\ndo this we have extended the Galitskii formalism to ac-\ncount for the molecular states in the interaction potential\nand also utilized the universal form of the resonant scat-\ntering amplitude in the vicinity of the resonance. This\nallowed for the exact solution of the Bethe-Salpeter equa-\ntion at resonance and its vicinity. It is also valid in the\nweak-scattering limit, including the limit of the molecular\nstates. The solution is regular in the BCS-BEC crossover\nand coincides exactly with the standard results obtained\nfor the weakly attractive Fermi gas. This agreement pro-\nvides a link between the resonance regime and the weak-\ninteraction regime and serves to justify the widely used\ncalculational framework in which the weak-interaction re-\nsults (with ultraviolet regularization) are extrapolated to\nthe BCS-BEC crossover and further to the domain of\nmolecular states.\nThe derivation of the vertex function can be carried out\nboth in the normal as well as in the condensate state. As\nthe latter is used to extract the equation for the conden-\nsate density (the gap equation), the extrapolation proce-\ndure for the BCS gap equation onto the molecular side of\nthe resonance is also perfectly justified (within the lad-\nder approximation). Thus our results establish the ro-\nbustness of the phenomenological extrapolation from the\nBCS limit used in many previous works.\nWe have not discussed the validity of the ladder ap-\nproximation itself, which is obviously questionable when\nthe system is close to the resonance. The applicability of\nthe ladder approximation is conventionally established\nfor a small gas parameter kF \/|η| \u001c 1. This condition\napparently fails at resonance, where the gas parameter\ndiverges. Still, it has been found that the ladder approxi-\nmation combined with a self-consistency procedure deliv-\ners reliable qualitative, and to some extent even quanti-\ntative information in the complete crossover regime (see,\ne.g., Refs. 1 and 2). The presented solution of the Bethe-\nSalpeter equations in the vicinity of the resonance reveals\nthat the relevant small parameter in the resonant system\nis ∝ kF |f(kF )|, where |f(kF )| is the absolute value of\nthe scattering amplitude. This quantity coincides with\nthe conventional gas parameter in the weak-interaction\nlimit, and, although not small, is not divergent at res-\nonance, approaching a constant of order unity instead.\nWhile not providing a small expansion parameter, this\nobservation provides further insight into the apparent\nsuccesses of the ladder approximation in studies of the\nresonant scattering systems.\nAcknowledgments\nThis work was supported by the European Commis-\nsion, Marie Curie Excellence Grant MEXT-CT-2005-\n023778 (Nanoelectrophotonics).\n1 Q. Chen, J. Stajic, S. Tan, and K. Levin, Phys. Rep. 412,\n1 (2005).\n2 For recent developments in the physics of ultracold\ngases see e.g. I. Bloch, J. Dalibard, and W. Zwerger,\narXiv:0704.3011 (2007).\n3 W. Ketterle and Y. Shin, Physics World 20 (6), 39 (2007).\n4 J. Cubizolles, T. Bourdel, S. J. J. M. F. Kokkelmans, G.V.\nShlyapnikov, and C. Salomon, Phys. Rev. Lett. 91 240401\n(2003).\n5 M. Greiner, C. A. Regal, and D. S. Jin, Nature (London)\n426, 537 (2003).\n6 M. W. Zwierlein, C. A. Stan, C. H. Schunck, S. M. F.\nRaupach, S. Gupta, Z. Hadzibabic, and W. Ketterle, Phys.\nRev. Lett. 91, 250401 (2003).\n7 S. Jochim, M. Bartenstein, A. Altmeyer, G. Hendl, S.\nRiedl, C. Chin, J. Hecker Denschlag, and R. Grimm, Sci-\nence 302, 2101 (2003).\n8 C. A. Regal, M. Greiner, and D. S. Jin, Phys. Rev. Lett.\n92, 040403 (2004).\n9 M. Bartenstein, A. Altmeyer, S. Riedl, S. Jochim, C. Chin,\nJ. H. Denschlag, and R. Grimm, Phys. Rev. Lett. 92,\n120401 (2004).\n10 M. W. Zwierlein, C. A. Stan, C. H. Schunck, S. M. F.\nRaupach, A. J. Kerman, and W. Ketterle, Phys. Rev. Lett.\n792, 120403 (2004).\n11 T. Bourdel, L. Khaykovich, J. Cubizolles, J. Zhang, F.\nChevy, M. Teichmann, L. Tarruell, S. J. J. M. F. Kokkel-\nmans, and C. Salomon, Phys. Rev. Lett. 93, 050401 (2004).\n12 J. Kinast, S. L. Hemmer, M. E. Gehm, A. Turlapov, and\nJ. E. Thomas, Phys. Rev. Lett. 92, 150402 (2004).\n13 M. Bartenstein, A. Altmeyer, S. Riedl, S. Jochim, C. Chin,\nJ. H. Denschlag, and R. Grimm, Phys. Rev. Lett. 92,\n203201 (2004).\n14 C. Chin, M. Bartenstein, A. Altmeyer, S. Riedl, S. Jochim,\nJ. H. Denschlag, and R. Grimm, Science 305, 1128 (2004).\n15 M. W. Zwierlein, J. R. Abo-Shaeer, A. Schirotzek, C. H.\nSchunck, and W. Ketterle, Nature (London) 435, 1047\n(2005).\n16 M. W. Zwierlein, C. H. Schunck, A. Schirotzek, and W.\nKetterle, Nature (London) 442, 54 (2006).\n17 A. Altmeyer, S. Riedl, C. C. Kohstall, M. J. Wright, R.\nGeursen, M. Bartenstein, C. Chin, J. H. Denschlag, and\nR. Grimm, Phys. Rev. Lett. 98, 040401 (2007).\n18 D. M. Eagles, Phys. Rev. 186, 456 (1969).\n19 A. J. Leggett, in Modern Trends in the Theory of Con-\ndensed Matter, ed. by A. Pekalski and R. Przystawa\n(Springer, Berlin, 1980).\n20 J. R. Engelbrecht, M. Randeria and C. A. R. Sa´ de Melo,\nPhys. Rev. B 55, 15153 (1997).\n21 L. Viverit, S. Giorgini, L. P. Pitaevskii, and S. Stringari,\nPhys. Rev. A 69, 013607 (2004).\n22 P. Nozie`res and S. Schmitt-Rink, J. Low Temp. Phys. 59,\n195 (1985).\n23 R. Haussmann, Z. Phys. B 91, 291 (1993).\n24 R. Haussmann, Phys. Rev. B 49, 12 975 (1994).\n25 Y. Ohashi and A. Griffin, Phys. Rev. Lett. 89, 130402\n(2002).\n26 P. Pieri, L. Pisani, and G. C. Strinati, Phys. Rev. B 70,\n094508 (2004).\n27 R. Combescot, X. Leyronas, and M. Yu. Kagan, Phys. Rev.\nA 73, 023618 (2006).\n28 L. P. Gorkov and T. K. Melik-Barkhudarov, Sov. Phys.\nJETP 13, 1018 (1961).\n29 H. Heiselberg, C. J. Pethik, H. Smith, and L. Viverit, Phys.\nRev. Lell. 85, 2418 (2000).\n30 R. Haussmann, W. Rantner, S. Cerrito, and W. Zwerger,\nPhys. Rev. A 75, 023610 (2007).\n31 D. S. Petrov, C. Salomon, and G. V. Shlyapnikov, Lett.\n93, 090404 (2004); Phys. Rev. A 71, 012708 (2005).\n32 G. E. Astrakharchik, J. Boronat, J. Casulleras, and S.\nGiorgini, Phys. Rev. Lett. 93, 200404 (2004).\n33 G. E. Astrakharchik, J. Boronat, J. Casulleras, and S.\nGiorgini, Phys. Rev. Lett. 95, 230405 (2005).\n34 V. K. Akkineni, D. M. Ceperley, and N. Trivedi, cond-\nmat\/0608154 (2006).\n35 Y. Nishida and D. T. Son, Phys. Rev. Lett. 97, 050403\n(2006).\n36 Y. Nishida and D. T. Son, Phys. Rev. A 75, 063617 (2007).\n37 Y. Nishida, Phys. Rev. A 75, 063618 (2007).\n38 P. Nicolic´ and S. Sachdev, Phys. Rev. A 75, 033608 (2007).\n39 M. Y. Veillette, D. E. Sheehy, and L. Radzihovsky, Phys.\nRev. A 75, 043614 (2007).\n40 A. Perali, P. Pieri, and G. C. Strinati, Phys. Rev. Lett. 93,\n100404 (2004).\n41 P. Pieri, L. Pisani, and G. C. Strinati, Phys. Rev. B 72,\n012506 (2005).\n42 A.L. Fetter and J.D. Walecka, Quantum Theory of Many-\nParticle Systems, McGraw-Hill Book Co., New-York, 1971.\n43 M. Randeria, J.-M. Duan, and L.-Y. Shieh, Phys. Rev. B\n41, 327 (1990).\n44 R. Combescot, Phys. Rev. Lett. 91, 120401 (2003).\n45 L. D. Landau and E. M. Lifshitz, Course of Theoretical\nPhysics. Vol 3: Quantum Mechanics: Non-relativistic The-\nory (Pergamon, Oxford, 1977).\n46 M. Holland, S. J. J. M. F. Kokkelmans, M. L. Chiofalo,\nand R. Walser, Phys. Rev. Lett. 87, 120406 (2001).\n47 J. N. Milstein, S. J. J. M. F. Kokkelmans, and M. J. Hol-\nland, Phys. Rev. A 66, 043604 (2002).\n48 G. M. Falco and H. T. C. Stoof, Phys. Rev. Lett 92, 130401\n(2004).\n49 S. J. J. M. F. Kokkelmans, J. N. Milstein, M. L. Chiofalo,\nR. Walser, and M. J. Holland, Phys. Rev. A 65, 053617\n(2002).\n50 G. M. Falco and H. T. C. Stoof, Phys. Rev. A 75, 023612\n(2007).\n51 G. M. Bruun, Phys. Rev. A 70, 053602 (2004).\n52 R. B. Diener and T. L. Ho, cond-mat\/0405174 (2004).\n53 S. Simonucci, P.Pieri, and G. C. Strinati, Europhys. Lett.\n69, 713 (2005)\n54 J. von Stecher and C. H. Greene, Phys. Rev. A 75, 022716\n(2007).\n55 T.-L. Ho, Phys. Rev. Lett. 92, 090402 (2004).\n56 G. B. Partridge, K. E. Strecker, R. I. Kamar, M. W. Jack,\nand R. G. Hulet, Phys. Rev. Lett. 95, 020404 (2005).\n57 M. H. Szymanska, K. Goral, T. Ko¨hler, and K. Burnett,\nPhys. Rev. A 72, 013610 (2005).\n58 M. M. Parish, B. Mihaila, B. D. Simons, and P. B. Little-\nwood, Phys. Rev. Lett. 94, 240402 (2005).\n59 V. N. Popov, Functional Integrals in Quantum Field The-\nory and Statistical Physics (D. Reider, Dordrecht, 1983).\n60 R. Combescot, M. Yu. Kagan, and S. Stringari, Phys. Rev.\nA 74, 042717 (2006).\n"}