{"doi":"10.1080\/09687760802526707","coreId":"14078","oai":"oai:generic.eprints.org:810\/core5","identifiers":["oai:generic.eprints.org:810\/core5","10.1080\/09687760802526707"],"title":"From Multi-User Virtual Environment to 3D Virtual Learning Environment","authors":["Livingstone, Daniel","Kemp, Jeremy","Edgar, Edmund"],"enrichments":{"references":[{"id":194355,"title":"Affordances for learning in a non-linear narrative medium.","authors":[],"date":"2000","doi":"10.1145\/302979.303098","raw":"Laurillard, D., M. Stratfold, R. Luckin, L. Plowman, and J. Taylor. 2000. Affordances for learning in a non-linear narrative medium.  Journal of Interactive Media in Education, no. 2. http:\/\/ www.jime.open.ac.uk\/00\/2 Livingstone, D., and J. Kemp. 2006. Massively multi-learner: Recent advances in 3D social environments. Computing and Information Systems Journal 10, no. 2, School of Computing, University of Paisley.","cites":null},{"id":194354,"title":"An update of the July","authors":[],"date":"2007","doi":null,"raw":"Kirriemuir, J. 2007. An update of the July 2007 ‘snapshot’ of UK higher and further education developments in Second Life. Bath: Eduserv Foundation.","cites":null},{"id":194352,"title":"Confronting the challenges of participatory culture: Media education for the 21st century. Chicago: MacArthur Foundation.","authors":[],"date":"2006","doi":null,"raw":"Jenkins, H. 2006. Confronting the challenges of participatory culture: Media education for the 21st century. Chicago: MacArthur Foundation.","cites":null},{"id":194350,"title":"Design-based research strategies for studying situated learning in a Multi-User Virtual Environment.","authors":[],"date":"2004","doi":null,"raw":"Dede, C., B. Nelson, D.J. Ketelhut, and C. Bowman. 2004. Design-based research strategies for studying situated learning in a Multi-User Virtual Environment. Paper presented at the 6th International Conference on Learning Sciences, 22–26 June, in Santa Monica, California.","cites":null},{"id":194347,"title":"Making learning fun: Quest Atlantis, a game without guns.","authors":[],"date":"2005","doi":"10.1007\/bf02504859","raw":"Barab, S.A., M. Thomas, T. Dodge, R. Carteaux, and H. Tuzun. 2005. Making learning fun: Quest Atlantis, a game without guns. Educational Technology Research and Development 53, no. 1: 86–107.","cites":null},{"id":194346,"title":"Massively multiplayer online role-playing games: The past, present, and future.","authors":[],"date":"2007","doi":"10.1145\/1324198.1324207","raw":"Achterbosch, L., R. Pierce, and G. Simmons. 2007. Massively multiplayer online role-playing games: The past, present, and future. Computers In Entertainment 5, no. 4: article no. 9.","cites":null},{"id":445404,"title":"Multidisciplinary experiential education in econd Life: A global approach.","authors":[],"date":"2006","doi":null,"raw":"Mason, H., and M. Moutahir. 2006. Multidisciplinary experiential education in econd Life: A global approach. Paper presented at the Second Life Education Workshop, 20 August, at SLCC, San Francisco.","cites":null},{"id":194353,"title":"Putting a Second Life ‘Metaverse’ skin on learning management systems.","authors":[],"date":"2006","doi":null,"raw":"Kemp, J., and D. Livingstone. 2006. Putting a Second Life ‘Metaverse’ skin on learning management systems. Paper presented at the Second Life Education Workshop, 20 August, at SLCC, San Francisco.","cites":null},{"id":445405,"title":"Tapped in to teacher professional development: An on-line conference center for education communities. Paper presented at the Serious Uses of MUDs workshop, 16–20 November, at CSCW ‘96,","authors":[],"date":"1996","doi":null,"raw":"Schlager, M., P. Schank, and R. Godard. 1996. Tapped in to teacher professional development: An on-line conference center for education communities. Paper presented at the Serious Uses of MUDs workshop, 16–20 November, at CSCW ‘96, Boston, MA.","cites":null},{"id":445406,"title":"Teaching computer science with virtual worlds.","authors":[],"date":"2004","doi":"10.1109\/te.2004.825513","raw":"Slator, B.M., C. Hill, and D. Del Val. 2004. Teaching computer science with virtual worlds. IEEE Transactions on Education 47, no. 2: 269–75.","cites":null},{"id":194351,"title":"Teaching in 3D: Pedagogical affordances and constraints of 3D virtual worlds for synchronous distance learning.","authors":[],"date":"2003","doi":"10.1080\/01587910303047","raw":"Dickey, M.D. 2003. Teaching in 3D: Pedagogical affordances and constraints of 3D virtual worlds for synchronous distance learning. Distance Education 24, no. 1: 105–21.","cites":null},{"id":194348,"title":"Virtual environments at work: Ongoing use of MUDs in the workplace.","authors":[],"date":"1999","doi":"10.1145\/295665.295677","raw":"Churchill, E.F., and S. Bly. 1999. Virtual environments at work: Ongoing use of MUDs in the workplace. In Proceedings of the international joint conference on work activities coordination and collaboration. San Francisco: ACM.","cites":null},{"id":194349,"title":"Virtual Learning Environments: Making the Web easy to use for teachers and learners.","authors":[],"date":"1999","doi":null,"raw":"Cook, J. 1999.  Virtual Learning Environments: Making the Web easy to use for teachers and learners. University of Bristol: LTSS.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2008","abstract":"While digital virtual worlds have been used in education for a number of years, advances in the capabilities and spread of technology have fed a recent boom in interest in massively multi‐user 3D virtual worlds for entertainment, and this in turn has led to a surge of interest in their educational applications. In this paper we briefly review the use of virtual worlds for education, from informal learning to formal instruction, and consider what is required to turn a virtual world from a Multi‐User Virtual Environment into a fully fledged 3D Virtual Learning Environment (VLE). In this we focus on the development of Sloodle – a system which integrates the popular 3D virtual world of Second Life with the open‐source VLE Moodle. Our intent is not simply to provide additional learning support features for Second Life, but to study more generally the ways in which integrated virtual environments can benefit teaching and learning, and this is the focus of our closing discussion","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14078.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/810\/1\/ALT_J_Vol6_No3_2008_From_Multi%2DUser_Virtual_Enviro.pdf","pdfHashValue":"561527b0a1dab18d0921d8591e64a7d1c95226c7","publisher":"Taylor and Francis Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:810<\/identifier><datestamp>\n      2011-04-04T08:57:25Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/810\/<\/dc:relation><dc:title>\n        From Multi-User Virtual Environment to 3D Virtual Learning Environment<\/dc:title><dc:creator>\n        Livingstone, Daniel<\/dc:creator><dc:creator>\n        Kemp, Jeremy<\/dc:creator><dc:creator>\n        Edgar, Edmund<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        While digital virtual worlds have been used in education for a number of years, advances in the capabilities and spread of technology have fed a recent boom in interest in massively multi‐user 3D virtual worlds for entertainment, and this in turn has led to a surge of interest in their educational applications. In this paper we briefly review the use of virtual worlds for education, from informal learning to formal instruction, and consider what is required to turn a virtual world from a Multi‐User Virtual Environment into a fully fledged 3D Virtual Learning Environment (VLE). In this we focus on the development of Sloodle – a system which integrates the popular 3D virtual world of Second Life with the open‐source VLE Moodle. Our intent is not simply to provide additional learning support features for Second Life, but to study more generally the ways in which integrated virtual environments can benefit teaching and learning, and this is the focus of our closing discussion.<\/dc:description><dc:publisher>\n        Taylor and Francis Ltd<\/dc:publisher><dc:date>\n        2008<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/810\/1\/ALT_J_Vol6_No3_2008_From_Multi-User_Virtual_Enviro.pdf<\/dc:identifier><dc:identifier>\n          Livingstone, Daniel and Kemp, Jeremy and Edgar, Edmund  (2008) From Multi-User Virtual Environment to 3D Virtual Learning Environment.  Association for Learning Technology Journal, 16 (3).  pp. 139-150.  ISSN 0968-7769 (print)\/1741-1629 (online)     <\/dc:identifier><dc:relation>\n        10.1080\/09687760802526707<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/810\/","10.1080\/09687760802526707"],"year":2008,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"ALT-J, Research in Learning Technology\nVol. 16, No. 3, September 2008, 139–150\nISSN 0968-7769 print\/ISSN 1741-1629 online\n© 2008 Association for Learning Technology\nDOI: 10.1080\/09687760802526707\nhttp:\/\/www.informaworld.com\nFrom Multi-User Virtual Environment to 3D Virtual\nLearning Environment\nDaniel Livingstonea*, Jeremy Kempb and Edmund Edgarc\naSchool of Computing, University of the West of Scotland, Paisley, UK;  bSchool of Library and \nInformation Sciences, San José State University, San José, USA; cSocial Minds Learning Systems, \nLondon, UK\nTaylor and FrancisCALT_A_352838.sgm(Received 31 March 2008; final version received 8 September 2008)\n10.1080\/09687760802526707ALT-J, Research in Learning Technology0968 7769 (print)\/1741-1629 (onli e)Original Article2 0Taylor & Fran is63 000Sept mber 2 08D  DanielLivingstoned niel.l vingstone@gmail.com\nWhile digital virtual worlds have been used in education for a number of years, advances\nin the capabilities and spread of technology have fed a recent boom in interest in\nmassively multi-user 3D virtual worlds for entertainment, and this in turn has led to a\nsurge of interest in their educational applications. In this paper we briefly review the use\nof virtual worlds for education, from informal learning to formal instruction, and\nconsider what is required to turn a virtual world from a Multi-User Virtual Environment\ninto a fully fledged 3D Virtual Learning Environment (VLE). In this we focus on the\ndevelopment of Sloodle – a system which integrates the popular 3D virtual world of\nSecond Life with the open-source VLE Moodle. Our intent is not simply to provide\nadditional learning support features for Second Life, but to study more generally the\nways in which integrated virtual environments can benefit teaching and learning, and this\nis the focus of our closing discussion.\nKeywords: Multi-User Virtual Environments; Virtual Learning Environments; game-\nbased learning; Second Life; Immersive Virtual Worlds\nIntroduction\nAs testified by this special issue of ALT-J dedicated to learning in Immersive Virtual\nWorlds (IVWs), there has been a recent marked growth of interest in the use of online\ngraphical Multi-User Virtual Environments (also known as MUVEs) for educational\npurposes.\nBy and large, however, IVWs have not been designed or built specifically for teaching\nand learning, and many elements of support for learning and teaching which are now\ncommonly found in web-based Virtual Learning Environments (VLEs) are completely\nabsent. While it is eminently 9possible to use an existing VLE alongside a graphical IVW,\nwe believe that integrating the two can help transform a Multi-User Virtual Environment\ninto a true 3D Virtual Learning Environment – and this we have been working towards with\nthe Sloodle project.\nOne part of Sloodle is a development project integrating the Second Life IVW and the\nMoodle VLE. In this paper we will outline the background for the application, how commu-\nnity input has been harnessed to drive the design to meet the needs of educators and outline\nfindings from current work piloting Sloodle.\n*Corresponding author. Email: daniel.livingstone@gmail.com\n140  D. Livingstone et al.\nThe other part has a much broader goal – to explore ways in which the primarily text-\ndriven web can be usefully integrated with rich, graphical 3D immersive environments. This\nmore general work – potentially applicable to any combination of IVW and VLE – forms a\nkey part of the discussion closing this paper.\nBut first some background detail is necessary. We will briefly review some of the perti-\nnent history of virtual worlds in education, and consider the potential need and benefits of\nintegration with web-based learning support.\nBackground\nOnline multi-user virtual worlds have been in existence since the late 1970s – initially based\non text descriptions of the world and the actors within it (Achterbosch, Pierce, and Simmons\n2007). With the evolution from the first Multi-User Dungeon (MUD) to later MUD Object-\nOriented (MOOs) came the ability for users to extend and modify the virtual world. Over\ntime, a number of educational projects were established using text-based virtual worlds to\nsupport student, teacher or workplace community development and knowledge sharing or\nfor use in teaching subjects ranging from classics to computer science (c.f. Schlager,\nSchank, and Godard 1996; Churchill and Bly 1999; Slator, Hill, and Del Val 2004).\nUp until recent years IVWs remained very much fringe activities for both entertainment\nand serious use, enjoyed or employed by a relatively small audience. The contemporary\npicture is somewhat different, with Massively Multi-Player Online Games (MMOGs) now\ncommanding a user base in the tens of millions (Achterbosch, Pierce, and Simmons 2007)\nand interest in the use of IVWs for education similarly booming. Current Eduserv Founda-\ntion surveys have found that over half of UK higher education institutions now have some\nform of presence or activity in Second Life (Kirriemuir 2007). Yet few IVWs have been\ndesigned specifically to support educational objectives.\nConsider the early use of the world-wide web in education as a corollary example at this\npoint. Large scale adoption of web-based e-learning required the development of VLEs to\nsupport and simplify common management, instructional, learning, assessment and commu-\nnication tasks used in e-learning (Cook 1999). Without environments purposefully devel-\noped for education, it is likely that many educators would find it more challenging to\neffectively employ the web and deliver e-learning.\nWhat support for e-learning can be found in IVWs? In comparison with VLEs, IVWs\nprovide strong support for synchronous interactions and collaborations, and immersive\nenvironments for experiential and constructionist learning (c.f. Dickey 2003; Livingstone\nand Kemp 2006; Mason and Moutahir 2006). On the other hand, IVWs provide poor\nsupport for asynchronous collaboration, where students are online at different times, and\ntend not to provide support for learning management, assessment or reflective practice\n(Kemp and Livingstone 2006). There are a few existing examples, however, of learning\nsupport being added to existing IVWs.\nFirst, we consider two examples developed using the Active Worlds platform: the River\nCity Project (Dede et al. 2004) and Quest Atlantis (Barab et al. 2005). Active Worlds is an\nIVW which has been available since 1995 and now looks somewhat dated. By default,\nActive Worlds splits the user interface into a number of areas, as seen in the image of the\nRiver City Project (Figure 1).\nFigure 1. Labelled diagram showing the different interactive elements in the River City\/Active Worlds user interface. The ‘Student Workspace’ appears in a web-browser window that is part of the standard Active Worlds UI. River City Project image, used with permission and retrieved from http:\/\/muve.gse.harvard.edu\/rivercityproject\/view\/rc_views_interface.htm.The view and action space contains a number of controls for the 3D camera and for the\nuser’s avatar, with the avatar and surrounding space shown in the second area. Below this\nis a chat window where typed chat messages to and from other avatars appear. The final\narea, although labelled ‘Student Workspace’, is in fact a web-browser built into the\nALT-J, Research in Learning Technology   141\ninterface. As with other IVWs, Active Worlds was not developed as an e-learning platform;\nthe developers of the River City Project added the learning support they felt was required\nvia a separate website which is accessed through the built-in browser. The website provides\na guide, a notebook, a map, tools and help to the students engaged in the virtual space.\nMore generally, the use of built-in guides and notebooks for structured notetaking was\nfound by Laurillard et al. (2000) to support more effective use of CD-ROM e-learning\nresources by providing a learning narrative over student interactions. While the River City\nProject has its own story narrative, it is not too much of a stretch to see how similar use of\nguides and notebooks helps scaffold, structure and focus attention on the learning activities\n– and away from the mechanical activities involved in navigating and exploring a 3D space.\nWhile visually very different, Quest Atlantis uses a similar technique, providing a\ncustom-built interface in the web-browser window to support learners engaged in activities\nin that project. The Quest Atlantis support interface is designed to look more like a user\ninterface from a computer game – with a prominent display of the number of collected\n‘lumin’ crystal rewards and a number of colourful buttons to access information on current\nquests, friends lists, personal information and more.1\nWhile both Quest Atlantis and the River City Project present good examples of integrat-\ning web support into 3D IVW learning environments, both are also examples of heavily\ncustomised virtual worlds, with teams of developers working to create the virtual worlds\nand develop highly specialised and bespoke web-based learning spaces to complement the\n3D graphical environment.\nFigure 1. Labelled diagram showing the different interactive elements in the River City\/Active\nWorlds user interface. The ‘Student Workspace’ appears in a web-browser window that is part of the\nstandard Active Worlds UI. River City Project image used with permission and retrieved from http:\/\n\/muve.gse.harvard.edu\/rivercityproject\/view\/rc_views_interface.htm.\n142  D. Livingstone et al.\nSecond Life has proven popular with many instructors for its flexibility and the possi-\nbility of creating or customising teaching and learning for their own students – without reli-\nance of teams of developers to create the learning content for them. Yet Second Life lacks\neffective built-in learning support and it is, perhaps, asking too much of educators to create\nsuch learning support mechanisms themselves.\nSloodle\nThe need for better support for e-learning in 3D virtual worlds is felt by many, and has\nappeared as an issue in a number of surveys, e.g.: \nintegration of Second Life (which is synchronous) with other Web 2.0 technologies (e.g. wiki,\nforum, etc) is critical. (Kirriemuir 2007, 20)\nThe core concept of Sloodle is to bring flexible support for teaching and learning to 3D\nvirtual worlds via integration with a VLE – specifically Second Life and the open-source\nMoodle VLE. Second Life was selected as the IVW of choice because of its popularity,\nextensibility and the enthusiastic community of educators using the platform. The Moodle\nVLE was selected because of its open-source nature and again a sizeable online community\nsupporting the platform.\nIn its earliest conception, Sloodle would provide a form of 3D ‘virtual classroom’,\npresenting access to a Moodle course in 3D form and automatically mirroring the web-\nlayout of the course (Figure 2) (Kemp and Livingstone 2006). The different blocks making\nup a course would each have a 3D correlate for avatars to interact with. Thus a 3D calendar\nwould highlight important dates; clicking on these would read out the event information to\nstudents or an assignment could be seen to move closer to the deadline by having a flag\ndescend a pole as the due date approached. These designs were innovative though not\ninformed by practical teaching trials in Second Life and with no input from potential users\nto determine actual requirements. They focused on the aesthetic properties of the Moodle\nlayout structure and directly mapping user interface affordances.\nFigure 2. The Sloodle classroom – realising Moodle courses in 3D.An initial problem to be solved was how to identify the Second Life avatar belonging to\na particular Moodle user. So, for example, when a student submits a blog directly from\nSecond Life (see below), the entry needs to be added to Moodle with the student’s Moodle\nFigure 2. The Sloodle classroom – realising Moodle courses in 3D.\nALT-J, Research in Learning Technology   143\nuser details. A number of different approaches and utilities have been tried for this – with a\nsimple ‘registration booth’ being the preferred solution. This appears as a small 3D kiosk in\nSecond Life. When a user clicks on this, they receive a prompt taking them to an avatar\nregistration page on their institution’s Moodle VLE. As they need to log into Moodle to\naccess this page, it is then possible to create and store a link of their Second Life avatar\ndetails against their Moodle credentials.\nThis is implemented through a combination of new scripts running on the Moodle server\nand scripted objects built in Second Life. The former are developed in PHP Hypertext\nProcessor (as is Moodle itself) and can be installed as any other optional module in Moodle.\nThe latter are 3D models which incorporate scripts developed in the Second Life ‘Linden\nScripting Language’ (LSL). Sloodle does not modify the Second Life client software itself\nin any way.\nAs an example of how Sloodle features are implemented, consider the Sloodle web-\nintercom. This mirrors chat between Second Life and Moodle, allowing students to partici-\npate in chats from either environment and it also archives Second Life chat on the Moodle\nserver. Thus, chat activities can be conducted using either Second Life or a regular web-\nbrowser, with the Sloodle scripts and objects supporting the interaction in Second Life\n(Figure 3).\nFigure 3. Sloodle is implemented using a mixture of PHP scripts residing on a Moodle server and LSL scripted objects in Second Life, as shown in this schematic of the web-intercom. Communication between the two is via HTTP, the same protocol used by normal web-browsers.Over time, the direction that Sloodle has taken has changed somewhat from the original\n‘3D classroom’ concept. Rather than being constrained by the layout defined for the web,\nSloodle now aims to provide tools which can be used in a variety of different spaces within\nthe virtual world. Sloodle tools now include: \n● Object distributors which allow objects to be passed to students via a web-interface in\nMoodle and which enable avatars belonging to registered students to select items in-\nworld.\n● A Second Life user-interface enhancement; a toolbar which enables blogging to a\nuser’s Moodle profile, adds animated classroom gestures to Second Life, and which\nFigure 3. Sloodle is implemented using a mixture of PHP scripts residing on a Moodle server and\nLSL scripted objects in Second Life, as shown in this schematic of the web-intercom. Communica-\ntion between the two is via HTTP, the same protocol used by standard web-browsers.\n144  D. Livingstone et al.\nallows a user to query Moodle for the Moodle identities (if any) of avatars nearby in\nthe 3D virtual space (Figure 4).\n● A Sloodle block which can be added to pages in Moodle. This shows a user’s Second\nLife avatar identity and allows access to a number of user and administration tools in\nMoodle (Figure 5).\n● A new Moodle assignment type and associated Second Life object for collecting\nassignments inside Second Life. This allows students to submit 3D projects created in\nSecond Life to a virtual drop-box. Instructors can review submission details in\nMoodle, collect coursework from the drop-box in Second Life at their convenience\nand enter grades and provide feedback as normal in Moodle.\nFigure 4. The Sloodle Toolbar acts as a user-interface extension in Second Life, allowing users to write directly to web-blogs in Moodle. Additional features of this extensible tool include classroom animations and the ability to match avatars to their corresponding Moodle users.5 Slood e menu block. A number of administrativ  features are available via Moodle – including th  ability to send items t  avatars inside Second Life without having  log in to the 3D environ ent.How these tools are used in practice is to some extent instructor and student dependent. Some\nfeatures are aimed at supporting class and learning management, while others are aimed more\nat supporting the learning process itself. For example, using the web-intercom or the avatar\nlisting feature of the toolbar, an instructor can record attendance in Second Life. Conversely,\nmaking chat sessions in Second Life available for review may be of benefit to students as\nan aide-memoir and to help them reflect later on their experiences in the virtual world.\nEnabling blogging to Moodle from within Second Life can also be used as a tool to aid\nreflection and support learning – similar to the use of a notebook in the River City Project.\nStudents can record notes while within the 3D environment, which are then recorded in\nMoodle along with URLs linking back to the location in the 3D world where the note was\ntaken. These can be reviewed later by the student, may be extended if desired, and can also\nbe viewed by classmates or instructors. These can be helpful in disseminating knowledge\namongst classmates in a community of learners and could also be used for formative assess-\nment of student learning.\nIn wanting to direct our efforts most usefully, we have attempted to involve as wide a\ncommunity as possible in shaping the development of Sloodle. How we have strived to\nachieve this is outlined next.\nFigure 4. The Sloodle Toolbar acts as a user-interface extension in Second Life, allowing users to\nwrite directly to web-logs in Moodle. Additional features of this extensible tool include classroom\nanimations and the ability to match avatars to their corresponding Moodle users.\nALT-J, Research in Learning Technology   145\nUser-driven development\nSloodle development began, towards the end of 2006, with the creation of a number of\nproof-of-concept demonstration elements within Second Life – those seen in Figure 2 and\nan early version of the web-intercom.\nAlmost immediately after a number of demonstration events were held in Second Life,\na Moodle website was set up as the online home for the project, with forums and courses\nfor developers and potential users. This was followed by an online survey to help gauge\ndemand and refine Sloodle requirements. While the number of respondents was low, the\nfeedback, combined with attendance and comments at demonstration events, satisfied us\nthat there was some demand for Sloodle. Regular online project meetings and a number of\nonline forums continue to provide avenues for gathering feedback and comments from the\ncommunity.\nDevelopment work progressed and a second, more detailed, online survey was\nconducted in late 2007. One hundred and ninety-three responses to the call were received,\nwith around 155 completing the survey. Questions asked participants to rate the perceived\nusefulness of a large range of possible Sloodle features with answers on a five-point scale\nfrom ‘Unnecessary’ to ‘Vital’.\nStrong demand was indicated in that almost every feature suggested was rated as being\nat least ‘somewhat useful’ by the majority of respondents. Indeed, many features were\nperceived by over 60% of respondents as being at least ‘very useful’. The results of the\nsurvey validated many of the development decisions taken in the intervening year, and have\nFigure 5. Sloodle menu block. A number of administrative features are available via Moodle – in-\ncluding the ability to send items to avatars inside Second Life without having to log in to the 3D en-\nvironment.\n146  D. Livingstone et al.\nhighlighted priorities for future development work. There is limited space to review the\nresults here, but fuller results may be viewed online (http:\/\/www.sloodle.org\/mod\/resource\/\nview.php?id=523).\nOf the survey’s five most highly rated possible features, only one had been prototyped\nprior to the survey – a Second Life drop-box. This has since been completed, as noted\nabove. Three of the five are features that are not dependant on Moodle integration, these\nbeing: pre-prepared objects to support Second Life orientation; a ready to use 3D classroom;\nand an item to manage objects in a 3D virtual classroom. To some degree these are already\navailable in Second Life and we have not allocated resources to developing these as yet. The\nsingle most highly rated feature was a Second Life collaborative whiteboard. There are a\nnumber of significant challenges in creating a collaborative sketching tool which can be\nused inside Second Life. For example, the client software does not easily allow detection of\nthe position of the mouse as it moves over a surface – essential for drawing. An alternative\napproach is to create sketches using an external web-application and display the sketches in\nSecond Life using the software client’s ability to render images and web-pages. Following\nthe survey, work on implementing a Sloodle collaborative whiteboard began – as detailed\nbelow.\nInterestingly, the next three most highly rated features were all ones which were already\nworking or in development – the web-intercom, blogging support and gestures.\nThe Sloodle pilot\nDuring the development of Sloodle, small numbers of early adopters have been using the\ntools to support their teaching – including some of the Sloodle developers themselves. A\nmore formal pilot was conducted during the first few months of 2008. Support was given to\nparticipants wishing to set up Sloodle for their own classes during the pilot, including the\nprovision of a ready to use Moodle\/Sloodle server.2\nA dedicated course was set up to support the pilot at Sloodle.org, with details of the\npilot and a prominent reminder that pilot activity may be used in research. As well as\nforums, regular facilitated discussions were held as a core part of the pilot activity – these\nbeing led by either members of the Sloodle development team or by pilot participants\nsharing their experience with others and inviting discussion. The topics for the meetings\nwere all based on the experience of teaching and learning in virtual worlds. These were set\nup to allow participants to discuss the impact of various issues and the possible role of\nintegrated VLEs in Second Life education activities. Some meetings were led by pilot\nparticipants themselves, allowing them to share their experiences of using Sloodle with\ntheir classes.\nLive meetings in Second Life used the web-intercom to archive typed chat. Where voice\ncommunication was used, audio recordings were kept for later transcription. Individual\nrights to privacy and anonymity have been respected, although we are thankful to those\nparticipants willing and able to share their experiences more publicly, as in the example\ngiven below.\nWhile the pilot evaluation is still in progress, early feedback has proven supportive and\ninformative – revealing unexpected uses of existing tools as well as highlighting potential\nshortcomings and additional requirements. For example, problems trying to distribute items\nin Second Life to avatars who were not registered already on Moodle have led to changes\nand additions to the tools object distribution. An unexpected, and unresolved, issue is how\nto deal with Moodle users who have avatars on both Teen Second Life and the adult Second\nLife – and who would like both to be registered with the same Moodle account.\nALT-J, Research in Learning Technology   147\nA collaborative whiteboard was also trialled during the pilot. Feedback indicated that the\ndrawing tool was not intuitive or easy to use, while alternative web-based sketch tools\nalready exist. Instead of continuing with this, development has shifted into the creation of a\ncollaborative web-browser to extend the very limited functionality available in Second Life\nfor presenting web-content. Being able to share control of a virtual mouse and to use hyper-\nlinks in web-pages are two notable extensions over the standard functionality – Second\nLife’s normal HTML presentation being limited to a non-interactive image of what the web-\npage looks like.\nInnovative uses of existing features\nPerhaps the most promising feedback from any pilot is when users are making effective\nuse of tools in ways unintended by the developers. The intended use of the Sloodle Second\nLife distribution boxes was to make it possible for instructors to pass out, or students to\nselect for their avatars, the different Sloodle tools via a web-interface in Moodle. An alter-\nnative use found by one participant (Chris Surridge of KAIST, South Korea) for this was\nto fill a distribution box with avatar clothing, vehicles, furniture and toys – to allow\nstudents to kit out their avatars from a wide range of pre-selected ‘goodies’. This in itself\nbecame a fun and engaging class activity for students, as they explored the items available\nand swapped and shared the things that they found. It also provided the language students\nwith a context for practicing their English – to tell each other about the objects they had\nfound.\nThe same participant has described how he has been able to motivate his language\nstudents by linking them with students in another country. The two groups of students have\nposed questions to each other using mp3 audio forums in Moodle (enabled by a Moodle\nplug-in), taken part in live video link-ups (again managed by a Moodle plug-in) and finally\nmet and text-chatted in Second Life. The text-chat provides the ability for students to build\nupon their written language skills in a real-time conversational setting, and these have been\nrecorded using the web-intercom.\nA significant advantage of the web-intercom was the ability for students to review\ndiscussions at a later time – to examine passages that confused them during the initial\ndiscussion, or to look more closely at their own performance. Using the intercom, the chat\nactivities were able to combine conversational use of English with enhanced support for\nreflection. As can be seen in Figure 6, the web-intercom lists both Second Life avatar and\nMoodle user names next to the recorded chat messages. In this example, this provided\nadditional support as the students had first made contact with each other using their real\nnames, before adopting pseudonyms within the virtual world.\nFigure 6. A Second Life chat archive in Moodle supports reflection and review of class activities – and links Moodle and Second Life identities of participants.The potential benefits for language learners were not considered during the development\nof the web-intercom, and this example highlights the importance of having educators and\nstudents adapt the use of tools to support their particular mix of class activities.\nA final additional benefit experienced by the KAIST class was seen in having all\nlearning activities supported by a common VLE, whatever the medium of communication.\nThus, with Sloodle acting as a support, Moodle became the glue which held a wide range\nof activities together.\nDiscussion\nThe response to surveys, feedback from the pilot and general participation in forums at\nSloodle.org all demonstrate that respondents perceive a real demand and need for improved\n148  D. Livingstone et al.\nintegration of web-based learning support and Second Life. Although the software is still in\nthe early stages of development, a community of educators interested in and using Sloodle\nto enhance teaching and learning in Second Life is emerging. We are now collecting and\nevaluating evidence which highlights how Sloodle might be effective in supporting learning\nand teaching in Second Life – and which is helping to drive the ongoing development of\nSloodle itself.\nEarlier, in the background review, we saw that effective use of e-learning technologies,\nincluding virtual worlds, requires that learners focus on learning, not on technology. This\nfocus can be provided by a learning ‘narrative’, which provides goals and a means of assess-\ning progress towards achieving those goals. This can form scaffolding for learning, but\ncurrently there is very limited support in Second Life itself for providing this.\nAllowing virtual world activities to be initiated from Moodle, and having notes and\ndiscussions from those activities archived and stored back in Moodle, means instructors are\nable to support the development of just such a narrative within Moodle.\nHowever, we have also found that the provisioning of educational tools is not a one-way\nprocess. It is educators themselves who have the greatest awareness of the most effective\ncontext in which to build an educational narrative appropriate to their desired learning\nFigure 6. A Second Life chat archive in Moodle supports reflection on and review of class activi-\nties – and links Moodle and Second Life identities of participants.\nALT-J, Research in Learning Technology   149\noutcomes and teaching styles. Tools have been used in ways not originally conceived by\ntheir designers, and observation of educators’ innovations is feeding back, in an iterative\nprocess, into the design of the tools. As the pilot experience shows, asking educators which\ntools they imagine would be useful for learning and teaching is not sufficient. We need to\nprovide prototype tools and learn from how they are used in practice.\nThe ability to view web-pages from within Second Life seems to present new possibil-\nities, yet normal use of VLEs is predicated on restricting access to individuals with\nappropriate permissions. This leaves a number of issues to consider if content from Moodle\nis to be displayed inside public spaces in an IVW such as Second Life. While the collabo-\nrative web-browser allows groups of users to share a 3D discussion space in the IVW while\nbrowsing websites together, questions remain over how this could or should be used with\nMoodle specifically.\nConclusions\nAs IVWs become more commonly used for education and learning, the issues of providing\neffective support for teaching and learning are likely to recur across other platforms and\nenvironments.\nWhile it is possible to use discrete and separate tools for such support, greater integra-\ntion is required to realise the full potential of the current generation of 2D and 3D learning\nenvironments. This is beyond the resources of individual educators working with IVWs. We\nhave attempted to address this for one of the most popular IVWs with the creation of\nSloodle, an open-source project to integrate Second Life and Moodle.\nWe have found strong evidence of demand for tools such as Sloodle and, through the\nongoing pilot, have also found evidence that Sloodle is already proving useful to a number\nof educators. We are continuing to gather feedback and ideas from educators to help drive\nthe creation of additional tools to support learning, and hope that this will allow Sloodle to\ngrow in usefulness to an increasingly wide audience of educators.\nLike Moodle, all software used in Sloodle may be freely copied, altered and redistrib-\nuted, leveraging the underlying strengths of both the Open Source development model and\nthe Second Life platform. Educators and learning technologists may modify and customise\nthe Sloodle environment to suit personal and institutional preferences.\nThe evolution from bespoke (and often expensive and proprietary) learning games to\nbottom-up, participatory systems mirrors the evolution seen elsewhere in the web,\nexpressed in the growth of blogs and social networking systems (Jenkins 2006). It is our\nintention that Sloodle will support this transition, making it easier for IVWs to become fully\nintegrated components of institutional e-learning systems and strategies.\nAcknowledgements\nSloodle is supported and funded by the Eduserv Foundation. Early development of Sloodle was\nsupported by The Carnegie Trust for the Universities of Scotland. Thanks to the editors and anony-\nmous reviewers for their perceptive comments. Thanks also to Bronwen for her careful reading of the\nfinal draft.\nNotes\n1. See http:\/\/atlantis.crlt.indiana.edu\/ for images of the Quest Atlantis interface.\n2. http:\/\/moodlefarm.socialminds.jp\/. Moodlefarm now hosts 340 Moodle\/Sloodle systems, with\n250 different users. The majority of these are not associated with the current Sloodle pilot.\n150  D. Livingstone et al.\nReferences\nAchterbosch, L., R. Pierce, and G. Simmons. 2007. Massively multiplayer online role-playing\ngames: The past, present, and future. Computers In Entertainment 5, no. 4: article no. 9.\nBarab, S.A., M. Thomas, T. Dodge, R. Carteaux, and H. Tuzun. 2005. Making learning fun: Quest\nAtlantis, a game without guns. Educational Technology Research and Development 53, no. 1:\n86–107.\nChurchill, E.F., and S. Bly. 1999. Virtual environments at work: Ongoing use of MUDs in the work-\nplace. In Proceedings of the international joint conference on work activities coordination and\ncollaboration. San Francisco: ACM.\nCook, J. 1999. Virtual Learning Environments: Making the Web easy to use for teachers and\nlearners. University of Bristol: LTSS.\nDede, C., B. Nelson, D.J. Ketelhut, and C. Bowman. 2004. Design-based research strategies for\nstudying situated learning in a Multi-User Virtual Environment. Paper presented at the 6th\nInternational Conference on Learning Sciences, 22–26 June, in Santa Monica, California.\nDickey, M.D. 2003. Teaching in 3D: Pedagogical affordances and constraints of 3D virtual worlds\nfor synchronous distance learning. Distance Education 24, no. 1: 105–21.\nJenkins, H. 2006. Confronting the challenges of participatory culture: Media education for the 21st\ncentury. Chicago: MacArthur Foundation.\nKemp, J., and D. Livingstone. 2006. Putting a Second Life ‘Metaverse’ skin on learning manage-\nment systems. Paper presented at the Second Life Education Workshop, 20 August, at SLCC,\nSan Francisco.\nKirriemuir, J. 2007. An update of the July 2007 ‘snapshot’ of UK higher and further education\ndevelopments in Second Life. Bath: Eduserv Foundation.\nLaurillard, D., M. Stratfold, R. Luckin, L. Plowman, and J. Taylor. 2000. Affordances for learning\nin a non-linear narrative medium. Journal of Interactive Media in Education, no. 2. http:\/\/\nwww.jime.open.ac.uk\/00\/2\nLivingstone, D., and J. Kemp. 2006. Massively multi-learner: Recent advances in 3D social environ-\nments. Computing and Information Systems Journal 10, no. 2, School of Computing, University\nof Paisley.\nMason, H., and M. Moutahir. 2006. Multidisciplinary experiential education in econd Life: A global\napproach. Paper presented at the Second Life Education Workshop, 20 August, at SLCC, San\nFrancisco.\nSchlager, M., P. Schank, and R. Godard. 1996. Tapped in to teacher professional development: An\non-line conference center for education communities. Paper presented at the Serious Uses of\nMUDs workshop, 16–20 November, at CSCW ‘96, Boston, MA.\nSlator, B.M., C. Hill, and D. Del Val. 2004. Teaching computer science with virtual worlds. IEEE\nTransactions on Education 47, no. 2: 269–75.\n"}