{"doi":"10.1109\/PAC.2007.4440607","coreId":"101837","oai":"oai:epubs.surrey.ac.uk:1270","identifiers":["oai:epubs.surrey.ac.uk:1270","10.1109\/PAC.2007.4440607"],"title":"PAMELA - A model for an FFAG based hadron therapy machine","authors":["Peach, K","Cobb, J","Yokoi, T","Gardner, I","Edgecock, R","Poole, M","Pozimski, J","Cywinski, B","Jones, B","McKenna, G","Vojnovic, B","Folkard, M","Kirkby, K","Webb, R","Barlow, R","Elliott, A"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2007","abstract":"Approximately one third of the world's 15000 accelerators are used for tumour therapy and other medical applications [1]. The characteristics of FFAGs make them ideally suited to such applications, as the much smaller magnet size and greater compactness offers considerable cost and operational benefits. In the first stage the work on PAMELA will focus on the optimization of the FFAG design to deliver the specific machine parameters demanded by therapy applications. In this phase of the PAMELA project the effort will concentrate on the design of a semi-scaling type FFAGs to deliver a 450 MeV\/u carbon ion beam, including detailed lattice and tracking studies. The second stage will use the existing expertise in the BASROC consortium [2] to undertake a design of the magnets and RF system for PAMELA. An outline of the overall concept of PAMELA will be discussed and the actual status of the work will be presented. ©2007 IEEE","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:epubs.surrey.ac.uk:1270<\/identifier><datestamp>\n      2017-10-31T14:01:18Z<\/datestamp><setSpec>\n      74797065733D636F6E666572656E63655F6974656D<\/setSpec><setSpec>\n      6469766973696F6E733D656E67616E64706879736963616C736369656E636573:656C656374726F6E6963656E67696E656572696E67:415449:696F6E5F6265616D<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/epubs.surrey.ac.uk\/1270\/<\/dc:relation><dc:title>\n        PAMELA - A model for an FFAG based hadron therapy machine<\/dc:title><dc:creator>\n        Peach, K<\/dc:creator><dc:creator>\n        Cobb, J<\/dc:creator><dc:creator>\n        Yokoi, T<\/dc:creator><dc:creator>\n        Gardner, I<\/dc:creator><dc:creator>\n        Edgecock, R<\/dc:creator><dc:creator>\n        Poole, M<\/dc:creator><dc:creator>\n        Pozimski, J<\/dc:creator><dc:creator>\n        Cywinski, B<\/dc:creator><dc:creator>\n        Jones, B<\/dc:creator><dc:creator>\n        McKenna, G<\/dc:creator><dc:creator>\n        Vojnovic, B<\/dc:creator><dc:creator>\n        Folkard, M<\/dc:creator><dc:creator>\n        Kirkby, K<\/dc:creator><dc:creator>\n        Webb, R<\/dc:creator><dc:creator>\n        Barlow, R<\/dc:creator><dc:creator>\n        Elliott, A<\/dc:creator><dc:description>\n        Approximately one third of the world's 15000 accelerators are used for tumour therapy and other medical applications [1]. The characteristics of FFAGs make them ideally suited to such applications, as the much smaller magnet size and greater compactness offers considerable cost and operational benefits. In the first stage the work on PAMELA will focus on the optimization of the FFAG design to deliver the specific machine parameters demanded by therapy applications. In this phase of the PAMELA project the effort will concentrate on the design of a semi-scaling type FFAGs to deliver a 450 MeV\/u carbon ion beam, including detailed lattice and tracking studies. The second stage will use the existing expertise in the BASROC consortium [2] to undertake a design of the magnets and RF system for PAMELA. An outline of the overall concept of PAMELA will be discussed and the actual status of the work will be presented. ©2007 IEEE.<\/dc:description><dc:date>\n        2007<\/dc:date><dc:type>\n        Conference or Workshop Item<\/dc:type><dc:type>\n        NonPeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/epubs.surrey.ac.uk\/1270\/1\/fulltext.pdf<\/dc:identifier><dc:identifier>\n          Peach, K, Cobb, J, Yokoi, T, Gardner, I, Edgecock, R, Poole, M, Pozimski, J, Cywinski, B, Jones, B, McKenna, G, Vojnovic, B, Folkard, M, Kirkby, K, Webb, R, Barlow, R and Elliott, A  (2007) PAMELA - A model for an FFAG based hadron therapy machine       <\/dc:identifier><dc:relation>\n        10.1109\/PAC.2007.4440607<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/epubs.surrey.ac.uk\/1270\/","10.1109\/PAC.2007.4440607"],"year":2007,"topics":[],"subject":["Conference or Workshop Item","NonPeerReviewed"],"fullText":"PAMELA – A MODEL FOR AN FFAG BASED  \nHADRON THERAPY MACHINE \nK. Peach, J. Cobb, T. Yokoi, JAI, Oxford, UK, Ian Gardner, STFC\/RAL\/ISIS, Chilton, UK, Rob \nEdgecock STFC\/RAL\/PPD, Chilton, UK, Mike Poole STFC\/ASTeC, Daresbury UK, J. Pozimski, \nImperial College, London, UK, Bob Cywinski, Leeds University, UK, Bleddyn Jones, Birmingham \nUniversity, UK, Gilles McKenna, Oxford University, UK, Boris Vojnovic, Melvyn Folkard, Grey \nCancer Institute, London, UK,  Karen Kirkby, Roger Webb, Surrey University, UK, Roger Barlow, \nManchester University, UK, Alex Elliott, Beatson Oncology Centre, Glasgow, UK.\nAbstract \nApproximately one third of the world’s 15000 \naccelerators are used for tumour therapy and other \nmedical applications [1]. The characteristics of FFAGs \nmake them ideally suited to such applications, as the \nmuch smaller magnet size and greater compactness offers \nconsiderable cost and operational benefits. In the first \nstage the work on PAMELA will focus on the \noptimization of the FFAG design to deliver the specific \nmachine parameters demanded by therapy applications. In \nthis phase of the PAMELA project the effort will \nconcentrate on the design of a semi-scaling type FFAGs \nto deliver a 450 MeV\/u carbon ion beam, including \ndetailed lattice and tracking studies. The second stage will \nuse the existing expertise in the BASROC consortium [2] \nto undertake a design of the magnets and RF system for \nPAMELA. An outline of the overall concept of PAMELA \nwill be discussed and the actual status of the work will be \npresented. \nINTRODUCTION \nThere has also been a recent, very strong interest in \nusing NS-FFAGs for cancer therapy, as the much smaller \nmagnet size and greater compactness would add both cost \nand operational benefits, in particular the ease of \ndelivering a beam at any energy. Some initial simulation \nwork has been done, the most advanced by a small \ncollaboration led by the Brookhaven National Laboratory \n[3]. This envisages a proton and carbon ion complex \nconsisting of an RFQ and short linac, and then three rings. \nBoth proton and carbon ions are accelerated in the linac. \nThe protons are then accelerated to 31 and 250 MeV in \nthe first two rings and carbon to 69 and 400 MeV\/u in the \nsecond and third. The rings are 35, 43 and 52m in \ncircumference, respectively, and the largest horizontal \nmagnet aperture, in the third ring, is less than 40mm.  \nWhile the main properties of FFAG’s are ideal suited \nfor medical applications there are still some serious issues \nto be solved before building such a machine. The main \nchallenge for the use of NS-FFAG is the resonance \ncrossing acceleration. The lattice of NS-FFAG usually \nconsists of linear magnet. The simplicity and flexibility \ncoming from this are the advantages of NS-FFAG. \nHowever, due to the nature of a linear lattice, it inevitably \nencounters many resonances during acceleration. \nNevertheless, there is considerable concern that the \nresonances will have a much too severe effect on the \nbeam to make this a viable option. This will be \ninvestigated by EMMA, which is to build a 20MeV \nelectron NS-FFAG as a proof-of-principle machine [5]. \nIn PAMELA, the accelerated beams are non-relativistic \nproton or heavy ions. Therefore, though the feasibility of \nNS-FFAG with resonance crossing acceleration is \nestablished in EMMA, considerable additional design \nwork is required especially for lattice design and \nacceleration scheme in PAMERA, where the acceleration \nprocess is much slower compared with EMMA. \nAdditionally the problem of beam injection and extraction \ninto and from the different rings is another challenge in \nPAMELA. \nThe first stage of this work will be the design of \nmachines to deliver a 450 MeV\/u carbon ion beam with \nsmall or zero tune variations. This will include detailed \nlattice and tracking studies. The second phase will be to \nuse the existing expertise in the consortium to undertake a \ndesign of the magnets and RF system for this machine. \nThe output from these stages will be a demonstration of \nfeasibility. The third phase will be a preliminary cost \nestimate for the complex, allowing comparison with \nexisting technologies on performance and cost. \nThe next stage will be to take the work done and to \nscale the design down to both 70 MeV and 230 MeV \nproton machines as possible prototypes, including cost \nestimates. The second of these machines would be \npreferable as not only could it be developed into a therapy \nmachine, it could also be used to produce 68 MeV\/u \ncarbon ions. \nAs there is a lack of evidence demonstrating the \nbenefits of carbon over protons, this machine would be \nused to “treat” mice to obtain this. In addition, it would \nprovide scientifically obtained evidence demonstrating \nthe benefits of hadron therapy over standard radiotherapy. \nIf the higher energy machine proves to be too expensive, \nhowever, the lower energy machine could be used both as \na NS-FFAG prototype and also to do the comparison \nbetween hadron and radiotherapy. \nBEAM PARAMETERS REQUIRED FOR A \nCANCER THERAPY MACHINE \nIn a first step, a list of beam parameters as required for \na hadron therapy machine has been discussed and agreed \non. The beam energy of the protons should be tuneable in \nTHPMN076 Proceedings of PAC07, Albuquerque, New Mexico, USA\n08 Applications of Accelerators, Technology Transfer and Relations with Industry\n2880\nU01 Medical Applications\n1-4244-0917-9\/07\/$25.00 c©2007 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:16 from IEEE Xplore.  Restrictions apply. \nthe range between 50 and 270 MeV (up to 325 MeV for \nproton radiography) and for carbon a beam energy up to \n450 MeV\/nucleon is required. \nFor the treatment with protons a dose of 2 Gray\/minute \nin a volume of 2 litres (protons) will be the goal. One \nshould note that the dose given refers to the radiation \ndeposited in the tumour. The dose is (almost) independent \nof the incident energy of the proton. The residual range \nwhen the Bragg peak starts is about 5cm. Taking the \nirradiated tissue as water, this corresponds in the standard \n“Range\/Mass versus Momentum\/Mass” tables to a βγ of \nabout 4, or a proton momentum of about 0.3 GeV\/c, or a \nproton energy of around 45 MeV. Taking this into \naccount a dose of 2 Gray\/minute would require ~1.35 × \n1013 MeV of proton energy deposited per minute at 45 \nMeV\/proton. This gives a proton flux of 3×1011 protons \nper second, or a average current of 50 nA.  \nThe requirement for the dose calibration is that the dose \ndeposition in a 5 mm × 5 mm × 5mm cube (125 mm3) is \ncontrolled to within 5%. This implies (assuming 100 \npulses) that the individual pulses are controlled and \nknown at the level of 50%, which is a major advantage of \nan rapid cycling machine for such purposes. The \nmaximum field to be irradiated should be of 40 cm × 40 \ncm in size and the penetration depth will be (depending \non the beam energy) up to 25 cm. The spot size of the \nbeam in the tumour should be below 1 cm. For raster \nscanning, the requirement is to perform 60 “spills” in \nabout 2-3 minutes, which is defined by the maximum \ntime the patient can be expected to be “still”. This \nrequires changing the penetration depth and therefore the \nspeed of the energy scanning to be at the Hz level (~0.1-1 \nHz). The number of energy steps will probably be limited \nby the machine. From a clinical point of view, the energy \nsteps should be small compared with the size of the Bragg \npeak (45 MeV see above, so 5-10 MeV). However, the \nmachine is likely to deliver an energy step of a few \nhundred keV\/turn, so that the granularity of the energy \nsteps should not be of concern. \nThe energy spread allowed for the machine is related to \nthe straggling of the ions in the tissue. A proton with \nenergy 250 MeV with straggling ~2.5% has a kinetic \nenergy spread (full width) of about 10-15 MeV. If we do \nnot want the energy spread of the machine to dominate \nover the straggling, we need to keep the energy spread on \nthe beam at 250 MeV to be less than 5 MeV, or 2% (~4% \non momentum). The main requirements of a hadron \ntherapy machine are summarized in table 1. \nTable 1: Summary of Beam Parameters for an FFAG \nBased Hadron Cancer Therapy Facility PAMELA \n protons carbon \nBeam energy (MeV\/u) <325 <450 \nEnergy step size (MeV\/u) ~10 ~10 \nBeam current (enA) 50 3 \nParticle flux (1\/sec) 3×1011 3×1009 \nTHE FRONT END \nTwo different scenarios for the Front End are under \ndiscussion both with different advantages and \ndisadvantages. While the first one requires no change in \nthe field power of the dipole for operation with both \nspecies at the price of a lower proton current, the other \nneeds adjustment of the FFAG dipoles when changing the \nspecies making a fast switching difficult. \nIn the first scenario a commercially available small \ncyclotron with an output energy of 4 MeV will be used to \ninject a proton beam into the FFAG (see figure 1). In this \nfirst phase this beam could be accelerated to the final \nenergy of 350 MeV using two FFAGs, allowing various \noncology studies and proton therapy. In the second phase \nof the project a carbon injector consisting of an ECR ion \nsource, an LEBT utilizing a spectrometer for mass\/charge \nseparation and an RFQ (beam energy at the output of the \nRFQ will be 1 MeV\/u, see second scenario) will be added \ntogether with a third FFAG to allow treatment with \ncarbon ions up to an energy of 450 MeV. \n \nFigure 1: Schematic drawing of the beam injector \nscenario 1. \nThe second scenario is shown in figure 2. It will consist in \nthe first phase of an ECR ion source delivering a beam \ncurrent of 2mA of protons with 10 keV beam energy, in \nthe second phase an additional ECR source will be added \nto deliver 0.2 mA of C4+ at 120 keV beam energy. The \nbeam is injected into LEBT section consisting of \nsolenoids for beam focussing and set up as a spectrometer \nline utilizing a magnetic dipole for charge\/mass \nseparation followed by an RFQ running at about 200 \nMHz. \n \nFigure 2: Schematic drawing of the beam injector \nscenario 2. \nProceedings of PAC07, Albuquerque, New Mexico, USA THPMN076\n08 Applications of Accelerators, Technology Transfer and Relations with Industry\n1-4244-0917-9\/07\/$25.00 c©2007 IEEE\nU01 Medical Applications\n2881\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:16 from IEEE Xplore.  Restrictions apply. \nThe RFQ itself will be approximately 2.5 m long and \nrequires 300 kW of RF power. It will accelerate the beam \nto an energy of 1 MeV\/u. The beam parameters at RFQ \noutput are summarized in Table 2. \nTable 2: Output Parameters for Beam Injector Scenario 1 \nand 2 \n Protons scenario 1 (2) C4+ \npeak Current (mA) <0.1 (>2) ~0.2 \nε100%,n (π*mm*mrad) 0.4-0.6   \nεRMS,n (π*mm*mrad) 0.1-0.15   \nRF Frequency (MHz) ~200   \nBunch length (ps) ~500   \nPulse length (ms) ~100   \nRepetition rate (Hz) ~1000   \nParticles per bunch # 106-107 (107-108) 105-106 \nBeam energy (MeV\/u) 4 (1) 1 \nBehind the RFQ a MEBT beam line consisting of RF \nbunching cavities and magnetic quadrupoles for \ntransversal and longitudinal beam focussing to adopt the \nRFQ output parameters to the required FFAG injection \nparameters. Additionally a stripping foil will be used to \nincrease the charge state of the carbon ions from 4+ to 6+ \nto increase the acceleration efficiency in the FFAG rings. \nThe position of the stripping foil is still under discussion \nbut between the first and second FFAG is most likely, as \nthe stripping efficiency will be much higher compared \nwith stripping behind the RFQ. \nFFAG LAYOUT \nOne of the advantages of NS-FFAG for a particle \ntherapy facility is flexibility in facility operation. Due to \nthe fixed field, just by changing the injection particle, it \ncan immediately change the delivering particle. \nThe planned facility aims to deliver proton and heavy \nion beam for treatment. Thus, considering the injector \nenergy and reasonable momentum range of one NS-\nFFAG ring, which is typically about factor of 3, the \nfacility is to consist of three cascaded rings. The beam \nparameters are summarized in Table 3. The second ring \nworks as the final ring for proton therapy and the booster \nfor the final carbon ring as well. \nBEAM DELIVERY AND GANTRY \nThe fast beam extraction of a FFAG accelerator allows \nit to deliver beams to multiple ports simultaneously. It is a \nunique feature of FFAG as an accelerator for particle \ntherapy and it drastically improves efficiency of a \ntreatment facility. The beam structure is pulsed one, \nwhich is well fitted to the spot scanning irradiation, but it \nneeds consideration in employing the board beam with a \nwobbler. \nTable 3: Parameters of Accelerator Complex \nProton \nInjector 1 \nInjection \n(MeV) \nExtraction \n(MeV,max) \nMomentum \nratio \n1st ring 4 40 3.2 \n2nd ring 40 350 3.2 \nProton \nInjector 2 \n   \n1st ring 1 10 3.2 \n2nd ring 10 100 3.2 \n3rd ring 100 350 1.9 \nCarbon6+    \n1st ring 1 10 3.2 \n2nd ring 10 100 3.2 \n3rd ring 100 450 3.1 \nFor the rotating gantry, an ordinary gantry as developed \nfor existing facilities can be used as long as the energy \nchanging rate is slow (typically several times\/sec) \nHowever, if a much faster change in energy, for instance \nas fast as the repetition rate of FFAG, is required, another \napproach such as FFAG gantry proposed by [6] must be \ntaken. \nSUMMARY \nWhile the PAMELA project has just started and the \nteam is still under formation, the main parameters \nrequired to built a machine for oncology studies as a first \nstep, and to extend this machine finally to a full hadron \ncancer therapy machine based on 3 FFAGs, have been \ndefined. Within the 3 years of the study a robust design \nbased also on the experiences gained from the \ncommissioning of EMMA is expected. \nREFERENCES \n[1] “How Particles can be therapeutic”, Physics World, \nAugust 2003. http:\/\/physicsweb.org\/articles\/world\/ \n16\/8\/9 \n[2] BASROC website http:\/\/www.basroc.org.uk \n[3] C. Johnstone, W. Wan and A. Garren “Fixed Field \nCircular Accelerator Designs”, Proc. PAC’99, New \nYork, 1999, http:\/\/www.jacow.org \n[4] CONFORM website http:\/\/www.conform.ac.uk \n[5] R. Edgecock, “EMMA - the World’s First Non-\nscaling FFAG”, these proceedings \n[6] E.Keil, A.M..Sessler, D.Trbojevic, Proceedings of \nEPAC2006, p. 1681, http:\/\/www.jacow.org\n \nTHPMN076 Proceedings of PAC07, Albuquerque, New Mexico, USA\n08 Applications of Accelerators, Technology Transfer and Relations with Industry\n2882\nU01 Medical Applications\n1-4244-0917-9\/07\/$25.00 c©2007 IEEE\nAuthorized licensed use limited to: University of Surrey. Downloaded on February 5, 2010 at 06:16 from IEEE Xplore.  Restrictions apply. \n"}