{"doi":"10.1080\/09687760601129851","coreId":"14142","oai":"oai:generic.eprints.org:714\/core5","identifiers":["oai:generic.eprints.org:714\/core5","10.1080\/09687760601129851"],"title":"An information and communications technology (ICT)-enabled method for collecting and collating information about pre-service teachers' pedagogical beliefs regarding the integration of ICT","authors":["Vallance, Michael"],"enrichments":{"references":[{"id":195624,"title":"A methodological framework for practice-based research in networked learning,","authors":[],"date":"2003","doi":"10.1007\/1-4020-7909-5_3","raw":"Levy, P. (2003) A methodological framework for practice-based research in networked learning, Instructional Science, 31, 87–109.","cites":null},{"id":447566,"title":"Beyond e-learning: a future for networked learning, in: C. Steeples & C. Jones (Eds) Networked learning: perspectives and issues (London,","authors":[],"date":"2000","doi":"10.1007\/978-1-4471-0181-9_19","raw":"Steeples, C., Jones, C. R. & Goodyear, P. (2000) Beyond e-learning: a future for networked learning, in: C. Steeples & C. Jones (Eds) Networked learning: perspectives and issues (London, Springer Verlag).","cites":null},{"id":195622,"title":"Designs for networked learning in higher education: a phenomenograpic investigation of practitioners’ accounts in design, in: C. Steeples & C. Jones (Eds) Networked learning: perspectives and issues (London,","authors":[],"date":"2000","doi":"10.1007\/978-1-4471-0181-9_15","raw":"Jones, C. & Asensio, M. (2000) Designs for networked learning in higher education: a phenomenograpic investigation of practitioners’ accounts in design, in: C. Steeples & C. Jones (Eds) Networked learning: perspectives and issues (London, Springer Verlag).","cites":null},{"id":195625,"title":"Digital workstyle: the new world of work. Available online at: http:\/\/ www.microsoft.com\/billgates\/speeches\/2005\/05-19ceosummit.asp (accessed 19","authors":[],"date":"2005","doi":null,"raw":"Microsoft (2005)  Digital workstyle: the new world of work.  Available online at: http:\/\/ www.microsoft.com\/billgates\/speeches\/2005\/05-19ceosummit.asp (accessed 19 July 2005).","cites":null},{"id":195621,"title":"Effective evaluation: improving the usefulness of evaluation results through responsive and naturalistic approaches","authors":[],"date":"1981","doi":"10.2307\/1981810","raw":"Guba, E.G. & Lincoln, Y.S. (1981). Effective evaluation: improving the usefulness of evaluation results through responsive and naturalistic approaches (San Francisco, CA, Jossey-Bass, Inc.). Jonassen, D. H., Peck, K. L. & Wilson, B. G. (1999) Learning with technology: a constructivist perspective (Upper Saddle River, NJ, Prentice-Hall).","cites":null},{"id":447655,"title":"Epistemic fluency and constructivist learning environments, in: B.G. Wilson (Ed.) Constructivist learning environments: case studies in instructional design (Englewood Cliffs,","authors":[],"date":"1996","doi":"10.1109\/tpc.1997.650010","raw":"Morrison, D. & Collins, A. (1996) Epistemic fluency and constructivist learning environments, in: B.G. Wilson (Ed.)  Constructivist learning environments: case studies in instructional design (Englewood Cliffs, NJ, Educational Technology Publications), 107–119.","cites":null},{"id":447567,"title":"Growing up digital: the rise of the net generation","authors":[],"date":"1997","doi":"10.1525\/si.2010.33.4.640","raw":"Tapscott, D. (1997) Growing up digital: the rise of the net generation (New York, McGraw-Hill).","cites":null},{"id":195619,"title":"Investigating classroom talk (Lewes,","authors":[],"date":"1987","doi":null,"raw":"Edwards, A. D. & Westgate, D. P. G. (1987)  Investigating classroom talk (Lewes, Falmer Press).","cites":null},{"id":195618,"title":"Oversold & underused. Computers in the classroom (Cambridge,","authors":[],"date":"2002","doi":"10.5860\/choice.39-2921","raw":"Cuban, L. (2002)  Oversold & underused. Computers in the classroom  (Cambridge, Harvard University Press).","cites":null},{"id":195620,"title":"Psychological foundations for networked learning, in: C. Steeples & C. Jones (Eds) Networked learning: perspectives and issues (London,","authors":[],"date":"2001","doi":"10.1007\/978-1-4471-0181-9_19","raw":"Goodyear, P. (2001) Psychological foundations for networked learning, in: C. Steeples & C. Jones (Eds) Networked learning: perspectives and issues (London, Springer Verlag).","cites":null},{"id":447565,"title":"Strategies of social research (Englewood Cliffs,","authors":[],"date":"1981","doi":null,"raw":"Smith, H. W. (1981) Strategies of social research (Englewood Cliffs, NJ, Prentice Hall).","cites":null},{"id":447564,"title":"Teaching information technology to the computer shy: a theoretical approach to a practical problem,","authors":[],"date":"1997","doi":"10.1080\/13636829700200023","raw":"Selwyn, N. (1997) Teaching information technology to the computer shy: a theoretical approach to a practical problem, Journal of Vocational Education and Training, 49(3), 395–408.","cites":null},{"id":447749,"title":"The challenge of informed use: a unique IT experience for teachers and students from the Peoples’ Republic of China,","authors":[],"date":"2005","doi":null,"raw":"Vallance, M. (2005) The challenge of informed use: a unique IT experience for teachers and students from the Peoples’ Republic of China, The Journal of Asia TEFL, 2(1), 55–73.","cites":null},{"id":195623,"title":"The quality of teaching and learning via videoconferencing,","authors":[],"date":"2002","doi":"10.1111\/1467-8535.00265","raw":"Knipe, D. & Lee, M. (2002) The quality of teaching and learning via videoconferencing, British Journal of Educational Technology, 33(3), 301–311.","cites":null},{"id":447748,"title":"The research methods knowledge base (2nd edn). Available online at:","authors":[],"date":"2005","doi":null,"raw":"Trochim, W. M. (2005) The research methods knowledge base (2nd edn). Available online at: http:\/\/ www.socialresearchmethods.net\/kb\/ (acessed 25 July 2006).","cites":null},{"id":447568,"title":"Using IT in the language classroom: a guide for teachers and students in Asia (3rd edn)","authors":[],"date":"2004","doi":null,"raw":"Towndrow, P. A. & Vallance, M. (2004) Using IT in the language classroom: a guide for teachers and students in Asia (3rd edn) (Singapore, Longman).","cites":null},{"id":195617,"title":"Using video in research,","authors":[],"date":"1994","doi":null,"raw":"Bowman, M. D. (1994) Using video in research, SCRE Spotlight No. 45. Available online at: http:\/\/ www.scre.ac.uk\/spotlight\/spotlight45.html (accessed 25 July 2006).","cites":null},{"id":447750,"title":"Where is the technology induced pedagogy? Snapshots from a multimedia EFL classroom,","authors":[],"date":"2002","doi":"10.1111\/1467-8535.00237","raw":"Zhong, Y. X. & Shen, H. S. (2002). Where is the technology induced pedagogy? Snapshots from a multimedia EFL classroom, British Journal of Educational Technology, 33(1), 39–52.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2007-03","abstract":"This paper describes a method that utilized technology to collect and collate quantitative and qualitative data about pre‐service teachers’ use of networked technologies during a 12‐week undergraduate course, and the impact of this use on their pedagogical beliefs regarding the integration of information and communications technology (ICT). The technologies used captured and analysed students’ spoken and written communication while engaging in four synchronous online tasks, and also collected evaluation data from online interviews, surveys and diaries. The richness of data afforded by this ICT‐enabled method enabled the research to produce a rich narrative of how the students used the technology and provided evidence of a change in pre‐service teachers’ pedagogical beliefs during the course","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/14142.pdf","fullTextIdentifier":"http:\/\/repository.alt.ac.uk\/714\/1\/ALT_J%2DVol15_No1_2007_An_information_and_communicati.pdf","pdfHashValue":"d4a0fcdadc77a01f593eb7f26f435ef862dbbad1","publisher":"Taylor and Francis Ltd","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:generic.eprints.org:714<\/identifier><datestamp>\n      2011-04-04T09:02:09Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D4C:4C42<\/setSpec><setSpec>\n      7375626A656374733D4C:4C43:4C4331303232<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/repository.alt.ac.uk\/714\/<\/dc:relation><dc:title>\n        An information and communications technology (ICT)-enabled method for collecting and collating information about pre-service teachers' pedagogical beliefs regarding the integration of ICT<\/dc:title><dc:creator>\n        Vallance, Michael<\/dc:creator><dc:subject>\n        LB Theory and practice of education<\/dc:subject><dc:subject>\n        LC1022 - 1022.25 Computer-assisted Education<\/dc:subject><dc:description>\n        This paper describes a method that utilized technology to collect and collate quantitative and qualitative data about pre‐service teachers’ use of networked technologies during a 12‐week undergraduate course, and the impact of this use on their pedagogical beliefs regarding the integration of information and communications technology (ICT). The technologies used captured and analysed students’ spoken and written communication while engaging in four synchronous online tasks, and also collected evaluation data from online interviews, surveys and diaries. The richness of data afforded by this ICT‐enabled method enabled the research to produce a rich narrative of how the students used the technology and provided evidence of a change in pre‐service teachers’ pedagogical beliefs during the course.<\/dc:description><dc:publisher>\n        Taylor and Francis Ltd<\/dc:publisher><dc:date>\n        2007-03<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by_nc_nd<\/dc:rights><dc:identifier>\n        http:\/\/repository.alt.ac.uk\/714\/1\/ALT_J-Vol15_No1_2007_An_information_and_communicati.pdf<\/dc:identifier><dc:identifier>\n          Vallance, Michael  (2007) An information and communications technology (ICT)-enabled method for collecting and collating information about pre-service teachers' pedagogical beliefs regarding the integration of ICT.  Association for Learning Technology Journal, 15 (1).  pp. 51-65.  ISSN 0968-7769 (print)\/1741-1629 (online)     <\/dc:identifier><dc:relation>\n        10.1080\/09687760601129851<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/repository.alt.ac.uk\/714\/","10.1080\/09687760601129851"],"year":2007,"topics":["LB Theory and practice of education","LC1022 - 1022.25 Computer-assisted Education"],"subject":["Article","PeerReviewed"],"fullText":"ALT-J, Research in Learning Technology\nVol. 15, No. 1, March 2007, pp. 51–65\nISSN 0968-7769 (print)\/ISSN 1741-1629 (online)\/07\/010051–15\n© 2007 Association for Learning Technology\nDOI: 10.1080\/09687760601129851\nAn information and communications \ntechnology (ICT)-enabled method for \ncollecting and collating information \nabout pre-service teachers’ pedagogical \nbeliefs regarding the integration of ICT\nMichael Vallance*\nFuture University, Japan\nTaylor and Francis LtdCALT_A_212917.sgm10.1080\/09687760601129851ALT-J, Research in Learning Technology0968 7769 (pri t)\/174 -1629 (onli e)Original Article2 07 & Fran is5 000Ma ch 2007ssoci te Prof ssor MichaelVallancemichael@fun.ac.jp\nThis paper describes a method that utilized technology to collect and collate quantitative and qual-\nitative data about pre-service teachers’ use of networked technologies during a 12-week undergrad-\nuate course, and the impact of this use on their pedagogical beliefs regarding the integration of\ninformation and communications technology (ICT). The technologies used captured and analysed\nstudents’ spoken and written communication while engaging in four synchronous online tasks, and\nalso collected evaluation data from online interviews, surveys and diaries. The richness of data\nafforded by this ICT-enabled method enabled the research to produce a rich narrative of how the\nstudents used the technology and provided evidence of a change in pre-service teachers’ pedagogical\nbeliefs during the course.\nIntroduction\nTechnology use by teaching practitioners has dramatically altered the learning envi-\nronment, but data that are gathered to determine its effect is often collected and\ncollated using non-technological methods. This paper demonstrates a method for\ncollecting and collating data in research that involves the use of computer-based tech-\nnologies by the researcher and the research participants. The pragmatic method is\nillustrated by the acquisition of data acquired in a Doctoral research study. This infor-\nmation and communications technology (ICT)-enabled method allowed the\nresearcher to capture a variety of qualitative data that, when combined with the\n*School of Systems Information Science, Department of Media Architecture, Future University,\n116-2 Kamedanakano-cho, Hakodate, Hokkaido, T 041-8655, Japan. Email: michael@fun.ac.jp\n52 M. Vallance\nquantitative data, produced abundant, organized and accessible information that\ncould be efficiently analysed and interpreted.\nBefore proceeding, it must be clear what this paper is not about. It is not about\npresenting alterations to the tried and tested research practice of qualitative and\nquantitative data collection (Trochim, 2005). This proposed ICT-enabled method\nsimply utilizes technology to better serve the researcher by efficiently collecting data\nand reducing the time spent collating that data. Through better organization, the\nproposed method allows for a richness in a collection of data that may not be afforded\notherwise. It is acknowledged that the researcher must still undertake many of the\ntime-consuming tasks such as transcribing communication and inputting survey\nresponses. However, once completed, this ICT-enabled method facilitates an\nassociation between textual and visual communication, which can lead to a richer\ninterpretation by the researcher.\nThe research study\nTo situate the context for exemplifying the data collection and collation, a summary\nof the research is first provided. The Doctoral research was entitled ‘The Impact of\nSynchronous Inter-networked Teacher Training in ICT Integration’, and set out to\nfacilitate new perspectives and experiences in technology-based learning. To enable\nthis, the study investigated the development of pre-service teachers’ pedagogical\nbeliefs in the integration of ICT over a 12-week, final-year undergraduate course\n(Towndrow & Vallance, 2004) where collaborative synchronous networked tasks\nwere developed and implemented. The contributions by the pre-service teachers to\nthe process of the iterative task development, post-task discussions and the ongoing\ncommentaries on a Bulletin Board System (BBS) provided insights into any change\nin their pedagogical beliefs.\nThe relevance of research in synchronous networking for higher education and\nbusiness organizations was reinforced in May 2005, when Microsoft revealed its\nvision of the future workspace. In its White Paper entitled ‘Digital Workstyle: The\nNew World of Work’ (Microsoft, 2005), collaboration was considered a key capabil-\nity of its future technology and end-users: \nInstant messaging, telephony and conference will converge in an environment that gives\ninformation workers easy and flexible access to all of their communication tools, with a\nsecure infrastructure that archives the entire collaborative process in one place. Collabo-\nrative workspaces will be simple to set up and use with co-workers, partners and customers\nto create documents, work on projects and find and use relevant business information.\nA product such as the shared documents developed during this research may have\ncontained a presence that was facilitated by the collaborative process. In other\nwords, the finished document represented an artefact of a synchronous process of\nwork by a number of collaborators. Thus, this research of the synchronous network-\ning exemplifies a collaborative workspace in practice and provided pre-service\nteachers with an authentic experience of collaboration that can be transferred to\ntheir in-service teaching.\nPedagogical beliefs regarding the integration of ICT 53\nHowever, today’s technology literate ‘Net-geners’ (Tapscott, 1997) still require\nguidance as they develop competencies using synchronous technology, implement-\ning synchronous collaboration, and communicating in a shared space (Levy, 2003).\nThe result of the Doctoral research revealed, for instance, that the participants (the\npre-service teachers) developed academic competencies that were more appropriate\nand desirable for integrating technology than, say, skills-focused technical work-\nshops. A factor in the development of these competencies was task design. In other\nwords, the data revealed that awareness of good task design led to a better\nunderstanding of ICT usage to support learning. In addition, the competencies\nbecame apparent during the process of collating data. They provided a context for\ninterpretation and discussion of the iterative process of informed ICT integration\nand associated task design.\nSynchronous networked tasks were employed to encourage pre-service teachers to\nconsider their existing practices and facilitate an approach to teaching and learning\nthat supported informed integration of ICT. It is acknowledged that it will be diffi-\ncult to prove what is good design for synchronous networked learning (Jones &\nAsensio, 2000). However, this study was an iterative process and, as suggested by\nJones and Asensio, ‘the products of design are not outcomes of the design itself but\nof a deeply social and situated set of work practices’ (2000, p. 255). Supporting this,\nthe participants were therefore involved in designing the synchronous tasks, and\nthroughout the 12-week course developed a community that reflected, shared and\nexplained their evolving personal beliefs and understandings of ICT-enabled peda-\ngogical practices. The iterative development and recorded implementation of the\ntasks, and the ensuing discussions, revealed that the beliefs of the participants\nemerged and altered through participation in synchronous networked activities. The\nparticipants developed a personal understanding of informed ICT integration by\nsharing and articulating ideas, linking these ideas to their own experiences, engaging\nwith tasks and being exposed to different learning approaches. The qualitative\nevidence categorized these reflections into three broad competencies: generic,\nepistemic and declarative. Consolidation, new ideas and core skills were deemed\ngeneric competencies and linked to what Goodyear (2001) calls ‘transformative\npotential’. Demonstrating understanding, responding to different points of view and\nexpressing own explanations represented declarative conceptual knowledge and\napplying such knowledge in problem-solving or arguments. Epistemic fluency,\nwhere learners are required to be flexible in their use of knowledge (Morrison &\nCollins, 1996), was represented in this study by participants’ values and connections\nto their school environment.\nThroughout the research, the participants began to construct and internalize what\nthey were doing, and consider why they were doing certain activities when imple-\nmenting a synchronous network-based task. This may be considered an initial stage\nin a process of participants changing their pedagogical beliefs. Subsequent stages of\nparticipants’ development in pedagogical beliefs were the sharing of their points of\nview, expressing what they had internalized through discussion and critiquing the\nshared information. Immersed in these discussions (during the task process, on the\n54 M. Vallance\nBBS or during the interviews), the participants refined their understanding of\ninformed ICT integration.\nIn summary, at the beginning of this study many of the participants viewed their\ndesirable teaching as a transmission of content. As this study developed, the partici-\npants were actively involved in, as well as reflecting upon, designing good learning\ntasks in a synchronous networking environment. The resultant learning shifted from\ncontent to activities. To implement synchronous networking tasks successfully, the\nparticipants had to become good task designers and focus upon the activities and\nanticipated cognitive outcomes that may lead to good learning. Goodyear (2001)\nstates that content in these ICT-rich environments becomes the context, and the\nlearning is what the students do with the content. This research revealed that the\nlearning shifted from content to activities; that is, to what students actually did with\nthe tasks’ content. This was borne out of a development of academic competencies\nfacilitated by synchronous networked task design and implementation.\nCollecting the data: an overview\nThe methods used to collect the data needed to enable the research aims to be met.\nFirstly, to explore quantitative and qualitative data in a natural setting; and secondly,\nto obtain an understanding of the process of network-based learning (how students\nused technology) and the product of network-based learning (the impact of use on\npedagogical beliefs) within the context of training teachers to integrate ICT (Lortie,\n1975; Zhong & Shen, 2002). This resulted in data being collected from a variety of\nsources. During the research, the pre-service teachers (hereafter referred to as\nparticipants) engaged in four synchronous tasks where each computer action and\ntheir corresponding communication (both text and spoken) were digitally recorded.\nImmediately after each task, a selected participant subgroup was interviewed to\nreflect upon the collaborative experience, and discuss the activities and associated\ncognitive outcomes required to complete the synchronous task. At the end of each\nlesson, all the participants also completed a survey with 14 ‘yes\/no’ activity and cogni-\ntive outcome questions. The qualitative and quantitative data were consequently\nanalysed and an interpretation offered to the participants and the researcher’s\ncolleagues. The interpretation was posted online within one week for all participants\nto clarify, comment, amend, develop and elaborate prior to the iterative design and\nimplementation of another task two weeks hence. Despite the researcher’s ‘normal’\nteaching and administrative load, the immediacy of an interpretation provided a topic\nfor discussion in the following seminars.\nThe resultant digital method collected data from a variety of sources, and the\nprocedure is represented in Figure 1.\nFigure 1. Flowchart for data collectionTechnology utilization was a focal point of this research but the challenge was how\nto collect data that would be representative of activities and cognitive outcomes\n(Knipe & Lee, 2002) in the process of the synchronous tasks. The researcher needed\nto collect data of the participants working on a task, the communication that\nfacilitated the task process and completion, and an interpretation by both participants\nPedagogical beliefs regarding the integration of ICT 55\nand researcher of what occurred. The use of digital video would offer greater flexibil-\nity (Smith, 1981) and allow for a more detailed retrospective analysis (Edwards &\nWestgate, 1987) than using techniques that involved live coding (Bowman, 1994). A\nvideo recording would also provide the contexts for meaning of exponents before,\nduring and after participants’ actions (Bowman, 1994). Thus, an ICT-enabled\nprocedure for data collection that utilized the existing technologies in the learning\nenvironment was developed; in this case, a digital classroom with 30 computers\nequipped with videoconference cameras, arranged on five hexagonal tables called\n‘learning islands’.\nTwo alternative software solutions considered were HyperTranscribe1 and Tran-\nsana.2 HyperTranscribe and Transana are designed to synchronize recorded video\nand a typed transcription. These are useful tools for researchers but were not adopted\nin this study as the researcher needed to view the data of participants working on a\nsynchronous task and simultaneously capture their computer actions. To the best of\nthe researcher’s knowledge, no such software exists—hence the development of this\ncustomized ICT-enabled method of data collection and collation.\nThe tasks\nHaving established that the data were collected quantitatively and qualitatively, it is\ntimely to discuss the tasks that were utilized to facilitate this process. The tasks\nincorporated the use of synchronous networking technologies adhering to Selwyn’s\nframework of activities, integration, collaboration and shared space (Selwyn, 1997).\nFor effective use of ICT, the participants were provided with opportunities to\ncognitively engage with the materials with ‘high levels of learner control’ (Steeples\net al., 2000, p. 328). Throughout the tasks in this research, the participants were\nFigure 1. Flowchart for data collection\n56 M. Vallance\nprovided with a context and an achievable objective, but the design and process of\nthe tasks, and thus associated learning paths, were flexible. In other words, the\nnetworked participants determined how each task was implemented. The 12-week\nundergraduate course that provided the context for this study did not aim to\ndevelop technical skills, but focused upon the application of ICT (theory, historical\nperspectives, pedagogy, practice, procedures, etc.) in order to encourage and\ndevelop pre-service teachers’ understanding of informed use through an experien-\ntial learning process (Towndrow & Vallance, 2004). All the activities undertaken by\nthe participants were summarized on the class BBS for sharing and asynchronous\ndiscussion.\nAs mentioned, throughout the course there were four instances of data collection\nwhile the participants were undertaking a task specifically using synchronous\nnetworking technology. The participants’ activities were recorded digitally: what they\ndid when using the computer (screen capture) and what they did while working\n(video and audio capture). Immediately after completing a task, a focus group was\nformed in order to discuss the task implementation with the researcher. Each task\nconformed to Selwyn’s framework as illustrated in Table 1.\nIt must be noted at this juncture that tasks 2, 3 and 4 were a result of the interpre-\ntation of the data and corresponding discussions, and were thus designed in conjunc-\ntion with the participants. A concern may be the limited number of synchronous\ntasks; however, within the 12-week undergraduate course a number of additional\ntasks were undertaken either supporting the synchronous collaboration or more tradi-\ntional classroom activities. The next section will explain how the different compo-\nnents of the data were collected and collated.\nCapturing the tasks\nThe task implementation consisted of participants working in groups of three around\na computer terminal. Displayed on their monitor screen was a document that was\nsynchronized with other participants at another location. In other words, a number\nof participants could access one document and type text, and that text would be\nimmediately viewed by participants located elsewhere (synchronous document\ncollaboration). All participants could also simultaneously text chat in the CHAT pane\nwhile waiting for the one group to complete their document text. This is illustrated in\nFigure 2. The software utilized for synchronous document collaboration was iStorm.3\nThe most technology intensive component of the research data included the collec-\ntion of the participants’ communication while on task, and simultaneously recording\nevery computer screen action as they worked on that task.\nFigure 2. Screen capture actions and communication\nCapturing students’ spoken communication\nThe study was conducted in a digital classroom using computers upon which were\nattached small, digital, Apple iSight cameras. One camera was fitted with a wide-\nangle lens (named Vitacon M-Power) to ensure that all participants’ communication\nPedagogical beliefs regarding the integration of ICT 57\nT\nab\nle\n 1\n.\nS\nel\nw\nyn\n’s\n f\nra\nm\new\nor\nk \nan\nd \nth\ne \nsy\nnc\nhr\non\nou\ns \nta\nsk\ns\nC\nha\nra\nct\ner\nis\nti\nc\nE\nxp\nla\nna\nti\non\nT\nas\nk \n1,\n r\nep\nor\nt \nou\ntl\nin\ne\nT\nas\nk \n2,\n e\nxp\nos\nit\nor\ny \nes\nsa\ny\nT\nas\nk \n3,\n id\nio\nm\nT\nas\nk \n4,\n n\nar\nra\nti\nve\nA\nct\niv\nit\nie\ns\nT\nea\nch\ner\ns \nsh\nou\nld\n \nof\nfe\nr \nst\nud\nen\nts\n s\nel\nf-\ndi\nre\nct\ned\n le\nar\nni\nng\n \nac\nti\nvi\nti\nes\n t\nha\nt \nen\nco\nur\nag\ne \nse\nlf\n-\nex\npr\nes\nsi\non\nT\nhe\n s\ntu\nde\nnt\ns \nar\ne \ngi\nve\nn \nro\nle\ns \nan\nd \nre\nsp\non\nd \nac\nco\nrd\nin\ngl\ny.\n \nS\ntu\nde\nnt\ns \nar\ne \npr\nov\nid\ned\n \nop\npo\nrt\nun\nit\nie\ns \nto\n e\nxp\nre\nss\n th\nei\nr \nop\nin\nio\nns\n b\nut\n in\n t\nas\nk \n1 \nth\nei\nr \nco\nnt\nri\nbu\nti\non\ns \nar\ne \nin\nfl\nue\nnc\ned\n \nby\n t\nhe\nir\n a\nss\nig\nne\nd \nro\nle\ns\nS\ntu\nde\nnt\ns \nar\ne \npr\nov\nid\ned\n \nw\nit\nh \nth\ne \nop\npo\nrt\nun\nit\ny \nto\n \nch\noo\nse\n a\nn \nes\nsa\ny \nti\ntl\ne \nfr\nom\n a\n s\nel\nec\nte\nd \nlis\nt \nan\nd \nth\nen\n a\n p\nar\nti\ncu\nla\nr \nro\nle\n t\no \nex\npr\nes\ns v\nie\nw\npo\nin\nts\n. T\nas\nk \n2 \nis\n m\nor\ne \nfl\nex\nib\nle\n t\nha\nn \nta\nsk\n 1\nS\ntu\nde\nnt\ns \nar\ne \npr\nov\nid\ned\n \nw\nit\nh \nan\n id\nio\nm\n a\nnd\n c\nan\n \nof\nfe\nr \nan\ny \nco\nnt\nex\nt \nan\nd \npe\nrs\non\nal\n in\nte\nrp\nre\nta\nti\non\n. \nT\nas\nk \n3 \nis\n c\non\nsi\nde\nre\nd \nfl\nex\nib\nle\n in\n t\ner\nm\ns \nof\n t\nhe\n \nac\nti\nvi\nty\n’s\n p\nro\nce\nss\n a\nnd\n \npr\nod\nuc\nt\nF\nle\nxi\nbl\ne \nle\nar\nni\nng\n \nen\nco\nur\nag\ned\n. S\ntu\nde\nnt\ns \nar\ne \npr\nov\nid\ned\n w\nit\nh \nfi\nve\n p\nic\ntu\nre\ns \nan\nd \nth\nen\n d\nec\nid\ne \na \nla\nng\nua\nge\n \nex\npo\nne\nnt\n fr\nom\n th\ne \nE\nng\nlis\nh \ncu\nrr\nic\nul\num\n a\nnd\n u\nse\n IC\nT\n to\n \npr\nom\not\ne \nth\nei\nr \nan\nd \nth\nei\nr \nle\nar\nne\nrs\n’ u\nni\nqu\nen\nes\ns\nIn\nte\ngr\nat\nio\nn\nT\nea\nch\ner\ns \nar\ne \nm\nor\ne \nef\nfe\nct\niv\ne \naf\nte\nr \nre\nce\niv\nin\ng \nex\nte\nns\niv\ne \ntr\nai\nni\nng\n in\n t\nhe\n \nin\nte\ngr\nat\nio\nn \nof\n \nte\nch\nno\nlo\ngy\n w\nit\nh \nth\ne \ncu\nrr\nic\nul\num\nIn\nte\ngr\nat\nio\nn \nof\n t\nec\nhn\nol\nog\ny \nth\nro\nug\nh \nfo\nrm\nal\n t\nex\nt \nde\nve\nlo\npm\nen\nt,\n in\nfo\nrm\nal\n t\nex\nt \ndi\nsc\nus\nsi\non\ns \nan\nd \nlin\nki\nng\n b\not\nh \nw\nit\nh \nth\ne \nre\npo\nrt\nin\ng \nst\nru\nct\nur\ne \nbe\nin\ng \na \nke\ny \nge\nnr\ne \nof\n t\nhe\n \nE\nng\nlis\nh \nsy\nlla\nbu\ns\nU\nse\n o\nf \nin\nfo\nrm\nat\nio\nn \nte\nch\nno\nlo\ngy\n (\nIT\n) \nto\n \nde\nve\nlo\np \na \nle\nss\non\n t\nha\nt \nin\nte\ngr\nat\nes\n I\nT\n in\n t\nhe\n \nco\nns\ntr\nuc\nti\non\n o\nf \nan\n \nex\npo\nsi\nto\nry\n le\nss\non\n \nou\ntl\nin\ne.\n I\nn \nad\ndi\nti\non\n, u\nse\n \nof\n o\nrg\nan\niz\nat\nio\nn \nso\nft\nw\nar\ne \nan\nd \nw\neb\n s\nea\nrc\nhi\nng\n \nst\nra\nte\ngi\nes\n c\nom\nbi\nne\n t\no \nsu\npp\nor\nt \nst\nud\nen\nt \nto\n \nst\nud\nen\nt \nco\nlla\nbo\nra\nti\non\nT\nas\nk \nis\n c\nus\nto\nm\niz\ned\n f\nor\n \nst\nud\nen\nts\n t\no \nof\nfe\nr \nin\nde\npe\nnd\nen\nt \nop\nin\nio\nns\n \nba\nse\nd \nup\non\n o\nut\n-o\nf-\nsc\nho\nol\n e\nxp\ner\nie\nnc\nes\n (\nfo\nr \nth\ne \nco\nnt\nex\nt \nan\nd \nin\nte\nrp\nre\nta\nti\non\n o\nf \nth\ne \nid\nio\nm\n).\n I\nC\nT\n s\nup\npo\nrt\ns \nth\ne \nin\nte\nra\nct\nio\nns\n. I\nn \nth\ne \nco\nns\ntr\nuc\nti\non\n o\nf i\ndi\nom\n’s\n \nm\nea\nni\nng\n a\nnd\n u\nse\nG\nra\nph\nic\n im\nag\nes\n o\nff\ner\n \nst\nud\nen\nts\n a\nn \nop\npo\nrt\nun\nit\ny \nto\n \nor\nde\nr,\n in\nte\nrp\nre\nt \nan\nd \nde\nve\nlo\np \nm\nea\nni\nng\n w\nit\nhi\nn \nth\ne \nim\nag\nes\n, a\nnd\n a\nls\no \nth\nei\nr \nlin\nka\nge\n. M\nul\nti\n-m\nod\nal\nit\ny \nco\nm\nbi\nne\nd \nw\nit\nh \nIC\nT\n f\nor\n \nco\nm\nm\nun\nic\nat\nio\nn \nfa\nci\nlit\nat\nes\n \nan\n o\npe\nn-\nen\nde\nd \nta\nsk\nC\nol\nla\nbo\nra\nti\non\nS\nm\nal\nl g\nro\nup\n \nco\nlla\nbo\nra\nti\non\n o\nn \nth\ne \nco\nm\npu\nte\nr \nis\n \nes\npe\nci\nal\nly\n e\nff\nec\nti\nve\n \nw\nhe\nn \nst\nud\nen\nts\n h\nav\ne \nre\nce\niv\ned\n tr\nai\nni\nng\n in\n \nth\ne \nco\nlla\nbo\nra\nti\nve\n \npr\noc\nes\ns\nS\ntu\nde\nnt\ns \nw\nor\nk \non\n t\nex\nt \nin\n r\nea\nl \nti\nm\ne \nw\nhi\nle\n d\nev\nel\nop\nin\ng \nid\nea\ns \nin\n C\nH\nA\nT\n f\nra\nm\ne \nin\nfo\nrm\nal\nly\nE\nac\nh \nst\nud\nen\nt \nis\n u\nni\nqu\ne \nin\n th\nei\nr \nex\npe\nri\nen\nce\n u\nsi\nng\n \nIT\n f\nor\n t\nea\nch\nin\ng.\n U\nsi\nng\n \nre\nal\n-t\nim\ne,\n r\nem\not\ne \nte\nch\nno\nlo\ngy\n to\n d\nev\nel\nop\n a\nn \nes\nsa\ny \nou\ntl\nin\ne \nno\nrm\nal\nly\n \nun\nde\nrt\nak\nen\n in\ndi\nvi\ndu\nal\nly\n, \non\n p\nap\ner\n, p\nro\nvi\nde\ns \na \nun\niq\nue\n e\nxp\ner\nie\nnc\ne \nin\n \nco\nlla\nbo\nra\nti\non\nS\ntu\nde\nnt\ns \nfr\nom\n d\nif\nfe\nre\nnt\n \nsc\nho\nol\n s\nec\nto\nrs\n a\nnd\n e\nve\nn \nle\nve\nls\n (\npr\nim\nar\ny \nan\nd \nse\nco\nnd\nar\ny)\n c\nan\n w\nor\nk \nto\nge\nth\ner\n. D\nif\nfe\nre\nnt\n \nin\nfo\nrm\nat\nio\nn \nne\ned\ns \nto\n b\ne \nco\nm\nbi\nne\nd \nfo\nr s\nuc\nce\nss\nfu\nl \nco\nm\npl\net\nio\nn \nof\n t\nhe\n t\nas\nk\nE\nac\nh \ngr\nou\np \nha\ns \na \ndi\nff\ner\nen\nt \npi\nct\nur\ne \nso\n a\nll \nne\ned\n t\no \nco\nm\nbi\nne\n a\nnd\n t\nhe\nn \nre\n-\nin\nte\nrp\nre\nt \nth\ne \nim\nag\nes\n t\no \nfo\nrm\n t\nhe\n f\nin\nal\n o\nut\nco\nm\ne\n58 M. Vallance\nT\nab\nle\n 1\n.\nC\non\ntin\nue\nd\nC\nha\nra\nct\ner\nis\nti\nc\nE\nxp\nla\nna\nti\non\nT\nas\nk \n1,\n r\nep\nor\nt \nou\ntl\nin\ne\nT\nas\nk \n2,\n e\nxp\nos\nit\nor\ny \nes\nsa\ny\nT\nas\nk \n3,\n id\nio\nm\nT\nas\nk \n4,\n n\nar\nra\nti\nve\nS\nha\nre\nd \nsp\nac\ne\nE\nxe\nm\npl\nar\ny \nco\nm\npu\nte\nr-\nus\nin\ng \nte\nac\nhe\nrs\n b\nen\nef\nit\n \nfr\nom\n a\n s\noc\nia\nl \nne\ntw\nor\nk \nof\n o\nth\ner\n \nco\nm\npu\nte\nr-\nus\nin\ng \nte\nac\nhe\nrs\n a\nt \nth\nei\nr \nsc\nho\nol\nA\nll \nre\npo\nrt\n c\non\ntr\nib\nut\nio\nns\n fr\nom\n \nva\nry\nin\ng \nro\nle\ns b\nei\nng\n d\nev\nel\nop\ned\n \nca\nn \nbe\n v\nie\nw\ned\n b\ny \nan\ny \nst\nud\nen\nt.\n F\nol\nlo\nw\n-u\np \npr\nom\not\nes\n \nsh\nar\nin\ng \nof\n p\nro\nce\nss\n a\nnd\n \nou\ntc\nom\ne\nT\nea\nm\n d\nev\nel\nop\nm\nen\nt o\nf a\nn \nes\nsa\ny \nou\ntl\nin\ne \nus\nin\ng \nre\nal\n-\nti\nm\ne \nco\nm\nm\nun\nic\nat\nio\nn.\n \nT\nhe\n I\nT\n u\nse\nd \nca\nn \nfo\nrm\n \nth\ne \npl\nat\nfo\nrm\n fr\nom\n w\nhi\nch\n \nto\n in\nte\ngr\nat\ne \nIT\n w\nit\nh \nle\nar\nne\nrs\n. L\nes\nso\nn \nou\ntp\nut\n \nth\nen\n s\nha\nre\nd \non\n B\nB\nS\n f\nor\n \nus\ne \nby\n a\nll,\n p\nlu\ns \nop\npo\nrt\nun\nit\nie\ns \nfo\nr \nfo\nllo\nw\n-\nup\n p\nos\nt-\nle\nss\non\n \ndi\nsc\nus\nsi\non\ns \nan\nd \nre\nfi\nne\nm\nen\nts\nP\nri\nm\nar\ny \nan\nd \nse\nco\nnd\nar\ny \nst\nud\nen\nt-\nte\nac\nhe\nrs\n \npr\nov\nid\ne \nin\npu\nt \nas\n \nco\nnt\nex\nts\n a\nnd\n \nin\nte\nrp\nre\nta\nti\non\ns \nm\nay\n \ndi\nff\ner\n. A\ngr\nee\nd \nup\non\n \nid\nio\nm\n m\nea\nni\nng\n a\nnd\n u\nse\n \nto\n b\ne \nus\ned\n in\n s\nch\noo\nls\n. \nC\nan\n r\ne-\nde\nve\nlo\np \ndu\nri\nng\n \nin\n-s\ner\nvi\nce\n p\ner\nio\nd \nvi\na \nB\nB\nS\n la\nte\nr\nA\nll \npi\nct\nur\nes\n c\nan\n b\ne \nre\n-\nor\nde\nre\nd \nin\n iS\nto\nrm\n b\ny \nan\ny \nus\ner\n, w\nhi\nch\n th\nus\n a\nff\nec\nts\n th\ne \nst\nor\ny \nan\nd \nit\ns \nde\nve\nlo\npm\nen\nt.\n \nT\nhe\n o\nut\nco\nm\ne \nca\nn \nbe\n \npo\nst\ned\n to\n a\n B\nB\nS\n fo\nr \not\nhe\nrs\n \nto\n o\nff\ner\n d\nif\nfe\nre\nnt\n \nin\nte\nrp\nre\nta\nti\non\ns,\n p\nee\nr \nre\nvi\new\n a\nnd\n u\nse\n in\n c\nla\nss\nPedagogical beliefs regarding the integration of ICT 59\nwhile in front of the computer monitor was digitally recorded. The microphone built\ninto the camera was also set to its highest sensitivity and maximum quality.\nTo record the digital video and audio of the students’ communication to the\ncomputer hard drive, a free application called QuickTime Broadcaster was utilized.\nThe application was set up to record video at MPEG-4 format, 30 frames per second,\nwith audio set to 16 bit, 44.1 kHz stereo for a balance between quality and file size.\nThe application’s ‘Broadcast’ button was selected once the participants were assured\nto be captured within the view of the camera, and then the application was hidden\nfrom view by pressing the \u0001 (Command) and H keys. Upon completion of the task,\nthe ‘Broadcast’ button was again selected to terminate the recording. The resultant\nspoken communication movie file was thus automatically saved.\nCapturing students’ computer text communication\nThe next challenge was to record all instances of the participants’ computer actions.\nThis was more problematic but the digital classroom had been equipped with an appli-\ncation called Apple Remote Desktop. This allowed the teacher’s computer to access\nand view all other computers in the classroom. The participants’ actions could therefore\nFigure 2. Screen capture actions and communication\n60 M. Vallance\nbe viewed from the remote teacher’s computer, but how could the actions be digitally\nrecorded? To enable such recording, an application called Snapz Pro X4 was utilized.\nSnapz Pro X has the function of recording screen actions as a MPEG-4 video. There-\nfore, by using the teacher’s monitor to display one group’s monitor at full screen size,\nSnapz Pro X was activated to record all screen actions throughout the duration of the\ntask. The most reliable settings for Snapz Pro X were 15 frames per second viewed at\n100%. A snapshot of the synchronous document collaboration in action is illustrated\nin Figure 3. Participants used the primary pane to type their collaborative document\nand the CHAT pane on the right for more informal text communication.\nFigure 3. Synchronous collaboration\nCollating the communication data\nThe next stage of the method was to combine the two sets of data. This was undertaken\nby first transcribing the spoken communication and identifying exponents representing\ncommunicative functions. For example, when observing the digitally recorded movie\nfile and transcript of one group undertaking task 1, a number of functions were in\nevidence: making decisions, identifying, familiarization, turn-taking, formulating\nFigure 3. Synchronous collaboration\nPedagogical beliefs regarding the integration of ICT 61\nanswers, associated suggestion and questioning. These functions, and those in tasks\n2, 3 and 4, were not pre-determined by the researcher, but resulted through interpre-\ntation of the language exponents during the study. This is an important statement as\nthis study had no predetermined expectations of what the participants would discuss\nnor directed the on-task discourse to focus upon specific functions. The study observed\nthe processes and products that synchronous networking tasks facilitated, and analysed\nthe collated data. Therefore, the functions were derived from an analysis of the data\nrather than being imposed upon it (Bowman, 1994).\nNext, the combined video capture of the spoken communication and the tran-\nscribed text was saved as one MPEG-4 movie file. This file was then embedded\nwithin the full screen capture of the synchronous document process. Finally, chapter\nmarkers were added to the final movie file in order to access each exponent seamlessly\nduring the research analysis.\nCombining the spoken communication and its text transcription\nFirst, each spoken sentence had to be transcribed and then manually tagged with a\ntime stamp. This process was seamless as the spoken communication movie was\nalready in a digital format that could be displayed on the researcher’s computer. Next\nto this movie file was a plain text document, opened in Text Edit, for typing purposes.\nAs the researcher played the movie file, the time stamp was noted and the transcrip-\ntion inserted. Figure 4 illustrates a small portion of transcribed text with time stamps.\nFor example, [00:00:23.00] represented [hour:minute:second:tenths of a second].\nFigure 4. Transcription file\nFigure 4. Transcription file\n62 M. Vallance\nQuickTime Pro was then used to open the transcription file, resulting in it auto-\nmatically being converted to a movie file with the relevant time stamps (see Figure 5).\nFigure 5. Transcription file in QuickTimeThe transcription and the previously recorded spoken communication movie files\nhad to be the same duration, to the second, in order to combine synchronously. For\nfiles that were slightly different in duration, the end of one of the files had to be\ncropped. Once the duration of both movie files were synchronized, the transcription\nfile was selected (using Edit—Select All), then added to the spoken communication\nmovie (Edit—Add to Movie). The resultant file consisted of a movie-in-a-movie\neffect as shown in Figure 6.\nFigure 6. Transcription and communication movie fileThe penultimate stage in the procedure was to merge this combined transcription\nand communication movie file to the screen capture of the recorded participants’\nactions in the process of generating the collaborative document. The combined\ntranscription and spoken communication movie file was selected (Edit—Select All),\nthen added to the screen capture movie file (Edit—Add to Movie), as shown in\nFigure 5. Transcription file in QuickTime\nFigure 6. Transcription and communication movie file\nPedagogical beliefs regarding the integration of ICT 63\nFigure 2. In this case, the transcription was located to one side in order to view\nparalinguistic features during communication. This was undertaken by opening the\nQuickTime Show Movie Properties window, selecting Visual Settings and offsetting\nthe text track by adjusting by 320 × 430 pixels.\nAdding chapter markers\nFinally, chapter markers were added to the collated movie so that the researcher\ncould quickly locate an exponent, listen and view a related example. To simplify and\nautomate this process an AppleScript was made available to the researcher. Entitled\nChapterMan (available online at: http:\/\/homepage.mac.com\/mvallance\/FileShar-\ning.html), there are four simple commands; \n● Create Chapter Track.\n● Add Chapter at Playhead.\n● Rename Chapter.\n● Delete Chapter.\nAfter opening the collated movie file, a Chapter Track was created using Chapter-\nMan. Then each exponent was identified in the movie and a Chapter added at the\ndesired position. This procedure was repeated until all the exponents were identified.\nThe movie was then saved. This completes the task data collection and collation. As\nshown in Figure 2, at full screen size the movie file can be accessed to reveal the\nparticipants’ actions in the document collaboration while simultaneously listening to\ntheir spoken communication in the process of the task. This customized approach\nallowed the researcher to illustrate data in a format considered best for analysing the\ndata.\nThe interviews\nOne group of participants was interviewed immediately after completing each task.\nAgain the interview was digitally captured as it took place in the vicinity of the\nnetworked computer. The iSight camera and QuickTime Broadcaster software were\nused to record the interview. The procedure was similar to that described above\nwhere QuickTime Broadcaster was used to record the video and audio to the\ncomputer’s hard disk. Again the text was transcribed as described above, converted\nto the MPEG-4 movie format in QuickTime, and added to the interview movie file.\nChapter Markers were added again so that the researcher could quickly synchronize\nexamples of related exponents.\nThe surveys\nAt the end of each lesson, all participants completed a survey, which attempted to\ncategorize the activities and cognitive outcomes (Knipe & Lee, 2002) prevalent in the\nsynchronous document collaboration process. A discussion of the quantitative data is\n64 M. Vallance\noutside the scope of this paper but the survey helped focus the interviews on perceived\nlearning facilitated by the process of the collaborative task design and implementa-\ntion. The data were also utilized by the researcher to seek connections between the\ncaptured qualitative data and the quantitative survey data. Essentially, this was an\nattempt to ensure trustworthiness of the collected data (Guba & Lincoln, 1981).\nThe researcher’s diary\nThe procedure described in the previous section may, at first, appear complicated.\nHowever, once the first task had been completed the remaining tasks were collated\nmuch more quickly. The most time-consuming, but necessary, procedure was the\ntranscribing. Once that had been completed, the collation was straightforward.\nIt is believed that the key to the success of this particular study was to display\nan interpretation of the data as soon as possible after the task completion, using a\nweblog. The researcher undertook this within one week (despite having a\nlecturer’s teaching load). The interpretation provided content for the discussion in\nseminars as well as opportunities for participants to express opinions, ask ques-\ntions, seek clarification and ultimately collaborate in a shared experience of what\nwas meant by informed use of ICT to support learning. Moreover, to facilitate\nasynchronous communication between the researcher and the participants outside\nthe designated seminars, a class BBS was set up. The postings could be read by\nall the participants, thereby sharing the information and facilitating a more open\ndiscussion of the task actions and the resultant learning (Jonassen et al., 1999;\nVallance, 2005).\nConclusion\nPromoters of ICT provide a lot of rhetoric for the need to change education systems,\nyet none provide concrete proposals that are pedagogically focused (Cuban, 2002)\nnor do they provide substantive details on how such change can be achieved (Townd-\nrow & Vallance, 2004). In other words, ICT adoption is gaining recognition as a\nnecessity in education systems worldwide but ‘how’ and ‘why’ ICT is adopted and\nutilized in an informed way remains unclear. One way to provide some clarity and\nanalyse the effect and impact of participants using technology is to consider utilizing\nthe tools readily available in, for example, a digital classroom. This paper has thus\nprovided a context to consider an ICT-enabled method of data collection and\ncollation that may lead to new insights on technology utilization.\nNotes\n1. See http:\/\/www.researchware.com\/ht\/\n2. See http:\/\/www.transana.org\n3. See http:\/\/www.mathgamehouse.com\n4. See http:\/\/www.ambrosiasw.com\nPedagogical beliefs regarding the integration of ICT 65\nReferences\nBowman, M. D. (1994) Using video in research, SCRE Spotlight No. 45. Available online at: http:\/\/\nwww.scre.ac.uk\/spotlight\/spotlight45.html (accessed 25 July 2006).\nCuban, L. (2002) Oversold & underused. Computers in the classroom (Cambridge, Harvard\nUniversity Press).\nEdwards, A. D. & Westgate, D. P. G. (1987)  Investigating classroom talk (Lewes, Falmer Press).\nGoodyear, P. (2001) Psychological foundations for networked learning, in: C. Steeples & C. Jones\n(Eds) Networked learning: perspectives and issues (London, Springer Verlag).\nGuba, E.G. & Lincoln, Y.S. (1981). Effective evaluation: improving the usefulness of evaluation results\nthrough responsive and naturalistic approaches (San Francisco, CA, Jossey-Bass, Inc.).\nJonassen, D. H., Peck, K. L. & Wilson, B. G. (1999) Learning with technology: a constructivist\nperspective (Upper Saddle River, NJ, Prentice-Hall).\nJones, C. & Asensio, M. (2000) Designs for networked learning in higher education: a phenom-\nenograpic investigation of practitioners’ accounts in design, in: C. Steeples & C. Jones (Eds)\nNetworked learning: perspectives and issues (London, Springer Verlag).\nKnipe, D. & Lee, M. (2002) The quality of teaching and learning via videoconferencing, British\nJournal of Educational Technology, 33(3), 301–311.\nLevy, P. (2003) A methodological framework for practice-based research in networked learning,\nInstructional Science, 31, 87–109.\nLortie, D. C. (1975) Schoolteacher (Chicago, University of Chicago Press).\nMicrosoft (2005) Digital workstyle: the new world of work. Available online at: http:\/\/\nwww.microsoft.com\/billgates\/speeches\/2005\/05-19ceosummit.asp (accessed 19 July 2005).\nMorrison, D. & Collins, A. (1996) Epistemic fluency and constructivist learning environments, in:\nB.G. Wilson (Ed.) Constructivist learning environments: case studies in instructional design\n(Englewood Cliffs, NJ, Educational Technology Publications), 107–119.\nSelwyn, N. (1997) Teaching information technology to the computer shy: a theoretical approach\nto a practical problem, Journal of Vocational Education and Training, 49(3), 395–408.\nSmith, H. W. (1981) Strategies of social research (Englewood Cliffs, NJ, Prentice Hall).\nSteeples, C., Jones, C. R. & Goodyear, P. (2000) Beyond e-learning: a future for networked\nlearning, in: C. Steeples & C. Jones (Eds) Networked learning: perspectives and issues (London,\nSpringer Verlag).\nTapscott, D. (1997) Growing up digital: the rise of the net generation (New York, McGraw-Hill).\nTowndrow, P. A. & Vallance, M. (2004) Using IT in the language classroom: a guide for teachers and\nstudents in Asia (3rd edn) (Singapore, Longman).\nTrochim, W. M. (2005) The research methods knowledge base (2nd edn). Available online at: http:\/\/\nwww.socialresearchmethods.net\/kb\/ (acessed 25 July 2006).\nVallance, M. (2005) The challenge of informed use: a unique IT experience for teachers and\nstudents from the Peoples’ Republic of China, The Journal of Asia TEFL, 2(1), 55–73.\nZhong, Y. X. & Shen, H. S. (2002). Where is the technology induced pedagogy? Snapshots from a\nmultimedia EFL classroom, British Journal of Educational Technology, 33(1), 39–52.\n"}