{"doi":"10.2466\/pms.2003.97.1.281","coreId":"19016","oai":"oai:eprints.bham.ac.uk:572","identifiers":["oai:eprints.bham.ac.uk:572","10.2466\/pms.2003.97.1.281"],"title":"Criteria of personal, boys’and girls’ popularity as ranked by Greek adolescents","authors":["Nikitaras, Nikitas","Ntoumanis, Nikos"],"enrichments":{"references":[],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2003","abstract":"This study examined what Greek adolescents believe are the most important criteria of personal, boys’ and girls’ popularity in their age group. Participants were 364 students aged between 12 and 15 years. Seven main criteria of popularity were identified: sport competence, physical appearance, academic ability, being a good friend, being sociable, having a good sense of humor, and having the ‘right circle of friends’. With regard to personal popularity, results showed that being a good friend and being sociable were the two most highly ranked criteria for both boys and girls across all ages. Boys and girls perceived differently the most important criteria of boys’ and girls’ popularity. Specifically, for same-gender popularity, being a good friend was the most highly ranked criterion, whereas for other-gender popularity physical attractiveness was the most highly ranked criterion. The findings imply that friendship and social affiliation are the most important criteria of popularity in Greek adolescents","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"Ammons Scientific","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.bham.ac.uk:572<\/identifier><datestamp>\n      2012-01-16T15:52:45Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D47:4756<\/setSpec><setSpec>\n      7375626A656374733D42:4246<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Criteria of personal, boys’and girls’ popularity as ranked by Greek adolescents<\/dc:title><dc:creator>\n        Nikitaras, Nikitas<\/dc:creator><dc:creator>\n        Ntoumanis, Nikos<\/dc:creator><dc:subject>\n        GV Recreation Leisure<\/dc:subject><dc:subject>\n        BF Psychology<\/dc:subject><dc:description>\n        This study examined what Greek adolescents believe are the most important criteria of personal, boys’ and girls’ popularity in their age group. Participants were 364 students aged between 12 and 15 years. Seven main criteria of popularity were identified: sport competence, physical appearance, academic ability, being a good friend, being sociable, having a good sense of humor, and having the ‘right circle of friends’. With regard to personal popularity, results showed that being a good friend and being sociable were the two most highly ranked criteria for both boys and girls across all ages. Boys and girls perceived differently the most important criteria of boys’ and girls’ popularity. Specifically, for same-gender popularity, being a good friend was the most highly ranked criterion, whereas for other-gender popularity physical attractiveness was the most highly ranked criterion. The findings imply that friendship and social affiliation are the most important criteria of popularity in Greek adolescents.<\/dc:description><dc:publisher>\n        Ammons Scientific<\/dc:publisher><dc:date>\n        2003<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.bham.ac.uk\/572\/1\/Nikitaras__Ntoumanis_2003.pdf<\/dc:identifier><dc:relation>\n        public<\/dc:relation><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/572\/1.hassmallThumbnailVersion\/Nikitaras__Ntoumanis_2003.pdf<\/dc:relation><dc:relation>\n        http:\/\/www.amsciepub.com\/doi\/abs\/10.2466\/pms.2003.97.1.281<\/dc:relation><dc:identifier>\n        Nikitaras, Nikitas and Ntoumanis, Nikos (2003) Criteria of personal, boys’and girls’ popularity as ranked by Greek adolescents. Perceptual and Motor Skills, 97. pp. 281-288. ISSN 0031-5125<\/dc:identifier><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/572\/<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["public","http:\/\/eprints.bham.ac.uk\/572\/1.hassmallThumbnailVersion\/Nikitaras__Ntoumanis_2003.pdf","http:\/\/www.amsciepub.com\/doi\/abs\/10.2466\/pms.2003.97.1.281","http:\/\/eprints.bham.ac.uk\/572\/"],"year":2003,"topics":["GV Recreation Leisure","BF Psychology"],"subject":["Article","PeerReviewed"],"fullText":"Nikitaras, N., & Ntoumanis, N. (2003). Criteria of personal, boys', and girls' \npopularity as ranked by Greek adolescents. Perceptual and Motor Skills, 97, 281-288. \n \n \nCriteria of personal, boys’, and girls’ popularity as ranked by Greek adolescents \n \nNikitas Nikitaras \nDepartment of Physical Education and Sports Science,  \nUniversity of Athens, Greece \n \nNikos Ntoumanis \nSchool of Sport and Exercise Sciences,  \nUniversity of Birmingham, UK \n \nPlease address all correspondence to: \nNikos Ntoumanis, Ph.D., School of Sport and Exercise Sciences, University of \nBirmingham, B15 2TT, UK, or e-mail N.Ntoumanis@bham.ac.uk. \n \n \n \n 1\nSummary \nThis study examined what Greek adolescents believe are the most important criteria \nof personal, boys’ and girls’ popularity in their age group. Participants were 364 \nstudents aged between 12 and 15 years. Seven main criteria of popularity were \nidentified: sport competence, physical appearance, academic ability, being a good \nfriend, being sociable, having a good sense of humor, and having the ‘right circle of \nfriends’. With regard to personal popularity, results showed that being a good friend \nand being sociable were the two most highly ranked criteria for both boys and girls \nacross all ages. Boys and girls perceived differently the most important criteria of \nboys’ and girls’ popularity. Specifically, for same-gender popularity, being a good \nfriend was the most highly ranked criterion, whereas for other-gender popularity \nphysical attractiveness was the most highly ranked criterion. The findings imply that \nfriendship and social affiliation are the most important criteria of popularity in Greek \nadolescents. \n \n 2\nPeer acceptance is very important in adolescence, a time at which peer influence \nbecomes more dominant than parental influence (Weiss & Duncan, 1992). Peer \nacceptance is normally accomplished by being good at something or possessing \nsomething that is highly valued by the peer group. Many studies over the last four \ndecades have examined the relative importance of sport competence, as well as other \nfactors, in determining popularity among children and adolescents. A consistent \nfinding of these, predominantly North American, studies is that sport competence is \nan important criterion of popularity in young boys, but not in girls. \n For example, research by Chase and Dummer (1992) with 478 U.S. students \nfrom grades 4 to 6 showed that ‘being good at sports’ and ‘good looks’ were the most \nhighly ranked criteria of personal popularity in boys whilst in girls this order was \nreversed. Age differences revealed that at each grade level sport competence became \nmore important for boys and physical appearance became more important for girls. A \ncomparison of the mean scores of the criteria of popularity in the Chase and Dummer \n(1992) study with the mean scores reported by Buchanan, Blankenbaker, and Cotton \n(1976) showed that over the two time periods academic achievement became less \nimportant in determining personal popularity for both boys and girls. In contrast, the \nrelative importance of sport competence and physical appearance for boys and \nphysical appearance for girls increased. Chase and Dummer (1992) also presented the \nmain criteria of boys’ and girls’ popularity. Boys rated sport competence as the most \nimportant criterion of boys’ popularity, whilst girls considered physical appearance as \nthe most important criterion of boys’ popularity. For girls’ popularity, physical \nappearance was rated by both gender groups as the most important criterion. In \ncontrast, the comparative role of sport as a criterion of girls’ popularity was found to \nbe of little importance. \n 3\n Other studies conducted in American junior and senior high schools \nexamining peer acceptance have reported relatively similar findings. For example, \nWilliams and White (1983) found that being an ‘athletic star’ was the primary \ncriterion of personal popularity for boys from junior high school to college. This \ncriterion was chosen by 43% of the boys’ sample. Similar high percentages have been \npresented by Coleman (1961) and Eitzen (1975). In comparison, the girls in the \nWilliams and White (1983) study reported ‘being a leader in the activities’ as the most \nimportant criterion of their popularity. ‘Being a leader in the activities’ as well as \n‘being in the leading crowd’ were ranked by female adolescents as the most important \ncriteria for girls’ popularity in a study by Thirer and Wright (1985). \n The aforementioned results could be attributed to the significant role that sport \nplays in the American society and in the school curriculum. In fact, sport is a basic \npart of the educational programs of different age groups (Vanderwerken, 1990). \nFurthermore, research evidence has shown that sport competence plays an important \nrole in peer relations, especially among young boys (Evans & Roberts, 1987; Weiss & \nDuncan, 1992). Thus, it is understandable that sport competence is highly valued by \nyoung American boys. The comparatively lower importance that girls place upon \nsport competence has been attributed by Chase and Dummer (1992) to the relatively \nlow place of sport within the female value system, despite the recent increase in \nopportunities for girls to participate in organized sport. The high importance that boys \nand especially girls place on physical appearance could be attributed to societal \nattitudes and media pressures to achieve certain ‘acceptable’ body physiques (Davis, \n1997). \n However, the research conducted in American elementary and high schools \nmay not generalize to other cultures where sport plays a less central role in the school \n 4\ncurriculum. For example, in the UK most schools allocate one to two hours per week \nto sport and games. Therefore, it may not be surprising that in an investigation of the \nrelative importance that 13- and 15- year- old British students place upon success in \nsport and school work, Whitehead, Evans, and Lee (1997) found that although sport \nsuccess was more important to boys than to girls, both gender groups rated the \nimportance of academic success over sport success. Another limitation of past \nresearch is that it included only a very small number of potential criteria of popularity. \nHowever, this might have resulted in the omission of important criteria (e.g., being \nfriendly), a possibility acknowledged by Chase and Dummer (1992). \n To date, there has been no research looking at the criteria of popularity in \nGreek adolescents. Similar to the UK, sport does not play an important role in the \nGreek school curriculum. In contrast, academic success is highly valued by both \nstudents and their parents (Gari & Kalantzi-Azizi, 1998). Furthermore, Greek \nadolescents place great emphasis on factors relating to friendship and social \nacceptance (Makri-Botsari, 2001). Therefore, the purpose of this study was to \nexamine what Greek adolescents believe are the most important criteria of personal, \nboys’ and girls’ popularity in youth. Since previous research in the U.S. has examined \ngender and age differences in the criteria of popularity, a secondary purpose of this \nstudy was to investigate such differences in Greek adolescents. No hypotheses were \nformulated because the study was of an exploratory nature, but it was expected that \nsport competence would not be an important criterion of popularity when compared to \nthe U.S. studies. In contrast, it was expected that, Greek students would place greater \nemphasis upon social factors and academic success. \n \nMethod \n 5\nParticipants \nParticipants were 364 Greek students (N boys = 180; N girls= 183; 1 did not indicate \ngender) aged between 12 to 15 years (M = 13.6; SD = 1.2), who took part in a 4-week \nsummer camp offering sport, cultural, and educational activities. Approximately 2\/3 \nof the students were regular participants in various sports clubs (competitive \nexperience: M = 4.3 years; SD = 2.3). All participants were Caucasians and came \nfrom a predominantly middle-class background. \nInstrument \nThe participants were presented with a list of possible criteria of popularity in \nadolescence. The list was comprised of items that were used in Chase and Dummer’s \n(1992) study (i.e., academic ability, physical attractiveness, sport competence, and \nwealth), as well as five additional items (being a good friend, being sociable, being \ntrendy, having a good sense of humor, and having the ‘right circle of friends’) that the \nauthors developed based on the existing literature and their experience with working \nwith young people. The participants were encouraged to add other criteria of \npopularity if appropriate. Then, they were then asked to rank all the identified criteria \nstarting with ‘1’ for the most important criterion. Three different ranks were produced \nin order to ascertain the perceived importance of each criterion for a) personal \npopularity, b) the popularity of boys in their age group, and c) the popularity of girls \nin their age group. \nProcedure \nParticipation in this study was voluntary. Informed consent to participate in the study \nwas obtained from the participants and their parents or guardians. The questionnaire \nwas administered to large groups of participants in an assembly hall. The participants \n 6\nwere encouraged to give honest responses and were reminded that their responses \nwould be kept confidential. \n \nData Analysis \nSimilar to Chase and Dummer (1992), we calculated the number of times each \ncriterion of popularity received the highest ranking, that is the number of times each \ncriterion was perceived by the participants to be the most important criterion of \npersonal, boys’ and girls’ popularity. These frequencies were subsequently compared \nusing chi-square analysis. \n \nResults \nFrequency analysis indicated that two of the items in the list (i.e., being trendy and \nwealthy) were rated as being the most important criteria of all three types of \npopularity by less than 3% of the sample. Therefore, these items were dropped from \nthe analysis. Furthermore, none of the additional criteria of popularity obtained from \nthe open-ended questions were mentioned by more than 2 or 3 participants, and \ntherefore, none of these items were included in any further analysis. \nPersonal Popularity \nChi-square analyses revealed no gender (26 = 8.75; p = ns) or age differences (26= \n6.70; p = ns) in the frequencies of the most highly ranked criteria of personal \npopularity. Therefore, a subsequent chi-square analysis was carried out using the \nwhole sample. Results (see Table 1) showed that being a good friend and being \nsociable were the two most frequently chosen first criteria of personal popularity (2 \n(6) = 149.81; p < .001).  \nBoys’ popularity \n 7\nChi-square analyses revealed significant gender differences in the frequencies of the \nmost highly ranked criteria of boys’ popularity (26= 29.76; p < .001). Therefore, \nsubsequent age differences were sought independently for boys and girls. A gender x \nage analysis was not possible due to the very small N in some cells. In both young \n(12-13 years old) and older (14-15 years old) boys, being a good friend was the most \nfrequently chosen first criterion of boys’ popularity (see Table 2). The importance of \nbeing sociable and good at sports increased and decreased respectively across the age \ngroups (26 = 19.74; p < .01). Young girls (12-13 years old) chose physical \nattractiveness and sports competence as the most important criteria of boys’ \npopularity. In older girls (14-15 years old), being sociable, a good friend and \nattractive were the most frequently reported criteria of boys’ popularity. Similar to \nboys, the importance of sport competence decreased across the age groups (2 6= \n13.80; p < .05) (see Table 2). \nGirls’ Popularity  \nChi-square analyses revealed significant gender differences in the frequencies of the \nmost highly ranked criteria of girls’ popularity (2 6= 22.47; p < .001). Therefore, \nsubsequent age differences were sought independently for boys and girls. A gender x \nage analysis was not possible due to the very small N in some cells. No age group \ndifferences (2 6= 8.35; p = ns) emerged in the boys’ sample as both groups believed \nthat physical attractiveness was by far the most important criterion of girls’ popularity \n(see Table 3). In contrast, sport competence was rated as one of the least important \ncriterion of girls’ popularity. No age group differences (2 6= 4.51; p = ns) emerged in \nthe girls’ sample. However, in contrast to the boys’ sample, both younger and older \ngirls believed that physical attractiveness was the second most important criterion of \ngirls’ popularity after that of being a good friend (see Table 3). \n 8\n \nDiscussion \nThe purpose of this study was to examine the main criteria of personal, boys’ and \ngirls’ popularity in a sample of Greek adolescents. Previous research has focused \nalmost exclusively on American students, however, the results of these studies may \nnot generalize to other countries. Indeed, this was the case in the present study whose \nfindings differed from those that have been reported by previous research. Seven main \ncriteria of popularity were identified in this study, more than those reported by \nprevious studies (e.g., Buchanan et al., 1976; Chase & Dummer, 1992). Being a good \nfriend and being sociable were the most highly ranked criteria of personal popularity. \nAmong Greek children there is a strong emphasis on social affiliation and acceptance \n(Makri-Botsari, 2001) and this has probably been reflected by the prominence of the \ntwo criteria in the students’ rankings. \n Boys and girls rated different criteria as being the most important for \ndetermining boys’ and girls’ popularity. For same-gender popularity, as with personal \npopularity, being a good friend was the most highly ranked criterion. However, for \nother-gender popularity the most highly ranked criterion was physical attractiveness. \nThis implies that popularity criteria are, to a certain extent, influenced by the gender \nsimilarity of the rater and those who are rated. The high emphasis on physical \nappearance placed by both boys and girls is consistent with previous research (e.g., \nChase & Dummer, 1992). It is worth noting that adolescents rated differently the \nimportance of physical appearance depending on whether they judged personal \npopularity or someone else’s popularity. That is, whereas physical appearance was the \nleast frequently cited most important criterion for personal popularity, it was very \n 9\nfrequently cited for both girls’ and boys’ popularity. Qualitative research is needed to \ninvestigate the reasons for this discrepancy. \n A possible explanation might be that the participants perceived that they \npersonally lacked this quality. Another explanation is that they implicitly discounted \nits importance for their own popularity focusing instead on more socially acceptable \nqualities such as being a good friend. In any case, this finding is important because, \nunlike many other criteria, physical appearance is to a large extent genetically \ndetermined. Therefore, a possible overemphasis on physical appearance as a criterion \nto judge popularity could be a cause for concern. There is a significant amount of \nevidence in the literature (e.g., see Davis, 1997) indicating the strong link between \nphysical appearance concerns and eating disorders (especially in the population of \ngirls). Future research should investigate whether discrepancies between the criteria \nof personal and same-gender popularity could have an effect on one’s self-worth. \n Another interesting discrepancy between personal and other popularity was \nwith regard to academic competence. Many more adolescents regarded this variable \nas being the most important criterion of their own popularity rather than the \npopularity of boys or girls. The results as far as boys’ and girls’ popularity are \nconcerned are not surprising since academic success is not highly valued by peers \nwhen forming social networks. However, the results for personal popularity are \ndifficult to explain. A possible reason is that this study did not measure the personal \nvalue of each criterion to the student. Greek students value highly academic success \n(Gari & Kalantzi-Azizi, 1998) and this could have had a confounding influence on the \nparticipants’ rating of the importance of academic competence for their own personal \npopularity. \n 10\n In contrast to previous findings in the North American literature (e.g., Chase \n& Dummer, 1992), sport competence was not one of the most frequently chosen \ncriteria of personal, boys’ or girls’ popularity. This finding emerged despite the fact \nthat 2\/3 of the adolescents were active sport participants. Sport competence was less \nimportant criterion of popularity in girls than in boys and in older than in younger \nadolescents. Overall, about 7% of the participants stated that sport competence was \nthe most important criterion of their popularity. In terms of boys’ popularity, sport \ncompetence was rated as the most important criterion by approximately 16% of the \nparticipants. This percentage is about three times lower than the percentages reported \nby Coleman (1961), Eitzen (1975), and Williams and White (1983). Cultural \nexplanations aside, the differences in the findings between the current study and \nprevious research might also have been due to the absence of an open-ended response \nformat in previous studies. As argued earlier, this could have resulted in the omission \nof important criteria of popularity. \n Some interesting age differences also emerged in the criteria used for judging \nboys’ popularity. Specifically, the frequency of being sociable increased with age in \nboth boys and girls. Furthermore, for both young (12-13 years old) and older (14-15 \nyears old) boys, being a good friend was the most frequently first ranked criterion of \nboys’ popularity. In contrast, the perceived importance of sport competence for \njudging boys’ popularity decreased with age, especially among girls. These findings \nmirror the results of Whitehead et al.’s (1997) study who reported an age decrease in \nthe importance of sport success, and an increase in the importance of social activities. \nNo age differences were found in determining girls’ popularity. Both younger and \nolder girls believed that being a good friend was the most important criterion of girls’ \n 11\npopularity. In contrast, both younger and older boys rated physical attractiveness as \nthe highest criterion for girls’ popularity. \n In terms of future research possibilities, it would be interesting to test an \ninterval rating system by rating the importance of each criterion on an interval scale \n(e.g., 7-point scale). With ordinal data (such as those used in this study) the \ndiscrimination between the criteria of popularity could be difficult, especially when \nmore alternatives are introduced. Furthermore, when some criteria are of relatively \nsimilar importance to the participants but need to be differentiated by rank, it might be \ninappropriate to limit the analysis to the highest ranked criteria only. In addition to \ntaking into account these methodological points, future research could examine social \ninfluences in shaping adolescents’ judgments of the importance of different criteria, \nsuch as parental and media influences as well as socio-economic status. Furthermore, \npopularity ratings should be obtained in order to examine whether adolescents with \nhigh and low popularity will differ in their judgments of the importance of different \npersonal popularity criteria. Lastly, future research should investigate the self-worth \n(Harter, 1989) of those adolescents who perceive to be weak in criteria of popularity \nthat are deemed important by their peer group. \n 12\nReferences \nBuchanan, H. T., Blankenbaker, J., & Cotton, D. (1976) Academic and athletic ability \nas popularity factors in elementary school children. Research Quarterly, 47, \n320-325. \nChase, M. A., & Dummer, G. M. (1992) The role of sports as a social status \ndeterminant for children. Research Quarterly for Exercise and Sport, 63, 418-\n424. \nColeman, J. S. (1961) The adolescent society: the social life of the teenager and its \nimpact on education. New York: Free Press. \nDavis, C. (1997) Body image, exercise, and eating behaviors. In K. R. Fox (Ed.) The \nphysical self: from motivation to well-being. Champaign, IL: Human Kinetics. \nPp.143-174. \nEitzen, S.D. (1975) Athletics in the status system of male adolescents: a replication of \nColeman’s The Adolescent Society. Adolescence, 5, 267-276. \nEvans, J., & Roberts, G. C. (1987) Physical competence and the development of \nchildren’s peer relations. Quest, 38, 23-35. \nGari, A., & Kalantzi-Azizi, A. (1998) The influence of traditional values of education \non Greek students' real and ideal self-concepts. The Journal of Social \nPsychology, 138, 5-12. \nHarter, S. (1989) Manual for the Self-perception Profile of Adolescence. Denver, CO: \nThe Univers. of Denver. \nMakri-Botsari, E. (2001) How students determine the importance of self-perception \ndomains and how this relates to self-esteem. Evaluation and Research in \nEducation, 15, 1-16. \n 13\nThirer, J., & Wright, S. D. (1985) Sport and social status for adolescent males and \nfemales. Sociology of Sport Journal, 2, 164-171. \nVanderwerken, D. L. (1990) Sport in the classroom teaching sport-related courses in \nthe humanities. Madison, NJ: Fairleigh Dickinson Univers. Press. \nWeiss, M. R., & Duncan, S. C. (1992) The relationship between physical competence \nand peer acceptance in the context of children’s sports participation. Journal \nof Sport and Exercise Psychology, 114, 177-191. \nWhitehead, J., Evans, N. J., & Lee, M. J. (1997) Relative importance of success in \nsport and schoolwork. Perceptual and Motor Skills, 85, 599-606. \nWilliams, J. M., & White, K. (1983) Adolescent status systems for males and females \nat three age levels. Adolescence, 18, 381-389. \n 14\nTable 1 \nFrequencies of the most highly ranked criteria of personal popularity in the whole \nsample. \n \nCriteria N 26 \nSport competence 27 149.81***\nPhysical attractiveness 25  \nAcademic competence 50  \nBeing a good friend 109  \nBeing sociable 89  \nHaving a good sense of humor 27  \nHaving the ‘right circle of friends’ 25  \n \nNote: *** p < .001 \n \n 15 \nTable 2 \nAge differences in the frequencies of the most highly ranked criteria of boys’ popularity. \n \n Sport \ncompetence \nPhysical \nattractiveness \nAcademic \ncompetence \nBeing a good \nfriend \nBeing \nsociable \nHaving a \ngood sense of \nhumor \nHaving the \n‘right circle of \nfriends’ \n26 \nYounger boys 20 3 7 28 4 9 10  \n19.74** \nOlder boys 15 8 3 28 20 4 4  \n         \nYounger girls 17 22 5 13 11 6 6  \n13.80* \nOlder girls 4 19 4 20 22 7 8  \n \nNote: ** p < .01; * p < .05 \n 16 \nTable 3 \nAge differences in the frequencies of the most highly ranked criteria of girls’ popularity. \n Sport \ncompetence \nPhysical \nattractiveness \nAcademic \ncompetence \nBeing a good \nfriend \nBeing \nsociable \nHaving a \ngood sense of \nhumor \nHaving the \n‘right circle of \nfriends’ \n26 \nYounger boys 4 35 7 22 7 9 3 \n \nOlder boys 4 43 7 11 13 4 4 \n \n8.35 \n         \nYounger girls 8 21 6 27 12 6 5 \n \nOlder girls 3 17 9 23 17 7 4 \n \n4.51 \n \n"}