{"doi":"10.1144\/0036-9276","coreId":"57588","oai":"oai:nora.nerc.ac.uk:9865","identifiers":["oai:nora.nerc.ac.uk:9865","10.1144\/0036-9276"],"title":"The palynology of the Pabay Shale Formation (Lower Jurassic) of SW Raasay, northern Scotland","authors":["Brittain, Jennifer M.","Higgs, Kenneth T.","Riding, James B."],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010","abstract":"A thermally mature palynomorph assemblage containing significant\\ud\nproportions of the characteristic dinoflagellate cyst Liasidium variabile Drugg 1978\\ud\nwas recovered from the Lower Jurassic Pabay Shale Formation of southwest Raasay.\\ud\nThis is the first record of this biostratigraphically important species from the Jurassic\\ud\nof onshore Scotland. Liasidium variabile is a zonal index for the Late Sinemurian in\\ud\nnorthwest Europe, and this occurrence allows a correlation to the Oxynotum Zone of\\ud\nthis substage. This is the first evidence for this chronozone on Raasay. Furthermore,\\ud\nthe presence of morphotypes A and B of Liasidium variabile indicates a probable\\ud\ncorrelation to the Oxynotum Subzone of the Oxynotum Zone. This interpretation is\\ud\nnot consistent with a hiatus within the Upper Sinemurian succession on Raasay","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/57588.pdf","fullTextIdentifier":"http:\/\/nora.nerc.ac.uk\/9865\/1\/Raasay_paper_-SJG_1391.pdf","pdfHashValue":"69e285f1cb37d0c41df95f9c5f8d67e73fec43e9","publisher":"Geological Society of London","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:nora.nerc.ac.uk:9865<\/identifier><datestamp>\n      2012-11-22T12:10:03Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9865\/<\/dc:relation><dc:title>\n        The palynology of the Pabay Shale Formation (Lower Jurassic) of SW Raasay, northern Scotland<\/dc:title><dc:creator>\n        Brittain, Jennifer M.<\/dc:creator><dc:creator>\n        Higgs, Kenneth T.<\/dc:creator><dc:creator>\n        Riding, James B.<\/dc:creator><dc:description>\n        A thermally mature palynomorph assemblage containing significant\\ud\nproportions of the characteristic dinoflagellate cyst Liasidium variabile Drugg 1978\\ud\nwas recovered from the Lower Jurassic Pabay Shale Formation of southwest Raasay.\\ud\nThis is the first record of this biostratigraphically important species from the Jurassic\\ud\nof onshore Scotland. Liasidium variabile is a zonal index for the Late Sinemurian in\\ud\nnorthwest Europe, and this occurrence allows a correlation to the Oxynotum Zone of\\ud\nthis substage. This is the first evidence for this chronozone on Raasay. Furthermore,\\ud\nthe presence of morphotypes A and B of Liasidium variabile indicates a probable\\ud\ncorrelation to the Oxynotum Subzone of the Oxynotum Zone. This interpretation is\\ud\nnot consistent with a hiatus within the Upper Sinemurian succession on Raasay.<\/dc:description><dc:publisher>\n        Geological Society of London<\/dc:publisher><dc:date>\n        2010<\/dc:date><dc:type>\n        Publication - Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        text<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/nora.nerc.ac.uk\/id\/eprint\/9865\/1\/Raasay_paper_-SJG_1391.pdf<\/dc:identifier><dc:identifier>\n         \n\n  Brittain, Jennifer M.; Higgs, Kenneth T.; Riding, James B..  2010  The palynology of the Pabay Shale Formation (Lower Jurassic) of SW Raasay, northern Scotland.   Scottish Journal of Geology, 46 (1). 67-75.  https:\/\/doi.org\/10.1144\/0036-9276\/01-391 <https:\/\/doi.org\/10.1144\/0036-9276\/01-391>     \n <\/dc:identifier><dc:relation>\n        http:\/\/sjg.lyellcollection.org\/content\/46\/1<\/dc:relation><dc:relation>\n        10.1144\/0036-9276\/01-391<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/nora.nerc.ac.uk\/id\/eprint\/9865\/","http:\/\/sjg.lyellcollection.org\/content\/46\/1","10.1144\/0036-9276\/01-391"],"year":2010,"topics":[],"subject":["Publication - Article","PeerReviewed"],"fullText":" 1\nThe palynology of the Pabay Shale Formation (Lower Jurassic) of southwest \nRaasay, northern Scotland \n \nJENNIFER M. BRITTAIN¹, KENNETH T. HIGGS¹ & JAMES B. RIDING² \n \n¹Department of Geology, University College Cork, Ireland \n²British Geological Survey, Kingsley Dunham Centre, Keyworth, Nottingham NG12 \n5GG, UK (e-mail: jbri@bgs.ac.uk) \n \nSynopsis \n \n A thermally mature palynomorph assemblage containing significant \nproportions of the characteristic dinoflagellate cyst Liasidium variabile Drugg 1978 \nwas recovered from the Lower Jurassic Pabay Shale Formation of southwest Raasay. \nThis is the first record of this biostratigraphically important species from the Jurassic \nof onshore Scotland. Liasidium variabile is a zonal index for the Late Sinemurian in \nnorthwest Europe, and this occurrence allows a correlation to the Oxynotum Zone of \nthis substage. This is the first evidence for this chronozone on Raasay. Furthermore, \nthe presence of morphotypes A and B of Liasidium variabile indicates a probable \ncorrelation to the Oxynotum Subzone of the Oxynotum Zone. This interpretation is \nnot consistent with a hiatus within the Upper Sinemurian succession on Raasay. \n \n \nIntroduction \n \n The Jurassic outcrops of western Scotland are the most northwesterly in \nBritain, and are exposed from the Shiant Isles in the north to Mull in the south (Riding \net al. 1991; Morton and Hudson 1995). They occur in westerly-tilted fault blocks in a \nmajor half-graben structure that is one of a system of basins on the margins of the \nNorth Atlantic formed during early extensional phases of the Atlantic Ocean (Morton \n1992). Southwest Raasay is situated on a small block, approximately 10 km wide, \nwhich is bound to the west by the Screapadal Fault, and to the east by the Applecross \nFault (Mellere and Steele 1996). The Jurassic strata have been intruded by Palaeogene \nbasalts and granites. \n 2\n The Lower and Middle Jurassic strata of southwest Raasay have been \npreserved largely due to an overlying sheet of intrusive granophyre, which has caused \nlimited thermal alteration to this succession. The strata are Hettangian to Late \nBajocian in age and the succession is approximately 600 m thick (Cope, Duff et al. \n1980; Cope, Getty et al. 1980; Cox and Sumbler 2002; Simms et al. 2004). It \ncomprises six formations which are, in ascending stratigraphical order, the Breakish \nFormation, the Ardnish Formation, the Pabay Shale Formation, the Scalpay Sandstone \nFormation, the Portree Shale Formation, the Raasay Ironstone Formation and the \nBearreraig Sandstone Formation (Lee 1920; Howarth 1956; Morton 1965; 1976; \nGetty 1973; Page 1992; Morton and Hudson 1995; Hesselbo et al. 1998; Morton \n1999a, b; Cox and Sumbler 2002; Fig. 1). This study is on the palynology and the \nstratigraphical implications of two samples from the lower part of the Pabay Shale \nFormation in Suisinish, southwest Raasay (Fig. 2). In this paper, the zones and \nsubzones are treated as chronostratigraphical subdivisions of stages. They are given \nthe name of the respective ammonite species and written with an initial capital and in \nRoman font (Cox and Sumbler, 2002, p. 6). \n \n \nPrevious Research \n \n The Pabay Shale Formation crops out in various locations in the Inner \nHebrides, notably along the east coasts of Skye and Raasay (Morton and Hudson \n1995; Hesselbo et al. 1998, fig. 3). Most of the previous biostratigraphy on the Pabay \nShale Formation of Raasay has been done on the succession at Hallaig on the east \ncoast of the island. Ammonite faunas indicate that the Pabay Shale Formation in the \nSkye area is Sinemurian to Pleinsbachian in age, ranging from the Semicostatum \nZone (Lyra Subzone) to the ?Middle Ibex Zone (?Valdani Subzone) (Hesselbo et al. \n1998, figs. 3, 12, 13). However not all of the ammonite-based zones and subzones \nhave been recorded and the absence of much of the Upper Sinemurian, notably the \nObtusum and Oxynotum zones, was noted by Oates (1978) and Hesselbo et al. (1998, \nfig. 3). This was thought to be due to outcrops being obscured by landslip. Hesselbo et \nal. (1998, p. 38, 39) also observed that, in southwest Raasay, “The Oxynotum zone is \nunconfirmed but is likely also to be present”. Other authors, such as Richey (1961) \n 3\nand Sellwood (1972), have however suggested there may be a non-sequence in the \nLate Sinemurian succession on Raasay. \n Previous studies on the Jurassic palynology of the Hebrides Basin include \nBradshaw and Fenton (1982), Riding (1984, 1992a), Riding et al. (1991) and Riding \nand Thomas (1997). This report represents the first palynological evidence for Upper \nSinemurian strata in the Hebrides Basin. \n \n \nPalynology \n \n Two dark grey mudstone samples, JMB1 and JMB2, were collected for \npalynological analysis from the Pabay Shale Formation in Suisinish, southwest \nRaasay. These samples were collected from an extensive outcrop of a uniform \nparallel-laminated black shale at Grid References [NG 55353 34600] and [NG 55198 \n35026], respectively (Fig. 3). The bed sampled has been intruded by numerous \nPalaeogene basalt dykes, and is capped by the Raasay Granite. \n The samples were processed using standard palynological laboratory \ntechniques which comprised digestion using hydrochloric acid and 49% hydrofluoric \nacid followed by oxidation with Schultze’s solution and sieving using a 10 μm mesh \nto concentrate the 11 to 200 μm fraction (Wood et al., 1996). The raw organic \nresidues from both samples were dark brown to black in colour. This relatively high \nlevel of thermal maturity is due to the proximity of the basalt dykes and the Raasay \nGranite. Hence they were oxidised using Schultze’s solution for 5 to 6 hours to render \nthe palynomorphs sufficiently light for study. \n The two samples yielded abundant organic particulate matter, mainly \nterrestrially-derived plant fragments, pollen and spores with relatively low proportions \nof marine microplankton (acritarchs and dinoflagellate cysts). Both samples proved \nrelatively low in palynomorph diversity. Sample JMB1 was the richest, with 11 \nspecies of gymnosperm pollen and pteridophyte spores recorded. These miospores \ncomprise Cerebropollenites macroverrucosus (Thiergart 1949) Schulz 1967, \nClassopollis classoides (Pflug 1953) Pocock & Jansonius 1961, Cyathidites minor \nCouper 1953, Gleicheniidites senonicus Ross 1949, Ischyosporites variegatus \n(Couper 1958) Schulz 1967, Osmundacidites wellmanii Couper 1958, \nPerinopollenites elatoides Couper 1958, Podocarpidites spp., Protopinus scanicus \n 4\nNilsson 1958, Retitriletes austroclavatidites (Cookson 1953) Döring et al. 1963 and \nTodisporites major Couper 1958. These taxa are all relatively long ranging, however \nthe absence of the characteristic pollen genus Callialasporites is indicative of an Early \nJurassic age (Riding et al., 1991). \n Marine palynomorphs comprise 5-8% of the palynomorph assemblages. These \nare overwhelmingly dominated by the dinoflagellate cyst Liasidium variabile Drugg \n1978 and small acanthomorphic (spine-bearing) acritarchs referable to Micrhystridium \n(Fig. 4). Liasidium variabile is the most biostratigraphically significant palynomorph \nin the entire microflora. This species is confined to the Late Sinemurian of northwest \nEurope. Bucefalo Palliani and Riding (2000, fig. 5A,B) recognised two morphotypes \nof this taxon from North Yorkshire. Morphotype A is characterised by relatively short \npolar horns, whereas Morphotype B is distinguished by a prominent apical horn, a \nrounded left antapical protuberance and a pronounced right lateral ‘shoulder’ on the \nhypocyst. In the two Pabay Shale Formation samples, both morphotypes of Liasidium \nvariabile were recorded, although Morphotype A is significantly more common than \nMorphotype B. However, Morbey (1978) and Van de Schootbrugge et al. (2005, p. \n82) observed more than two discernible morphotypes of Liasidium variabile. A \nsystematic treatment of Liasidium and Liasidium variabile is presented as Appendix \n1. \n \n \nBiostratigraphy \n \n The previously recorded stratigraphical ranges for Liasidium variabile are \npresented in Fig. 5; the total reported range is Hettangian to Early Pliensbachian. The \noldest recorded occurrences are Hettangian by Brenner (1986) from southwest \nGermany and Rauscher and Schmitt (1990) from northeast France. Both these studies \nare not based on samples correlated to ammonite zones. Likewise, there are two \nrecords from the Pliensbachian Stage; these are Fauconnier (1995) and Williams et al. \n(1990). The report of Fauconnier (1995) is from a borehole drilled in northeast France \nand the range top is apparently within the earliest Pliensbachian Jamesoni Zone. \nWilliams et al. (1990) represents the first non-European report of Liasidium variabile.  \nThe species was identified from four wells in the Scotian Basin, offshore eastern \n 5\nCanada; there is no explanation of the Late Sinemurian-Early Pliensbachian age \nassigned to the Liasidium variabile Zone of Williams et al. (1990, fig. 3.8). \n As is evident from Fig. 5, the overwhelming majority of records of this species \nare from the Late Sinemurian (for example Woollam and Riding, 1983; Feist-\nBurkhardt and Wille, 1992; Poulsen, 1996; Lund, 2003). Furthermore the Late \nSinemurian records with ammonite control indicate that the majority of these \noccurrences are centred on the Oxynotum Zone (both the Simpsoni and Oxynotum \nsubzones). The key records from the Oxynotum Zone are Drugg (1978), Riding \n(1987), Dybkjær (1988) and unpublished data. These unpublished data are records of \nLiasidium variabile from two British Geological Survey cored boreholes drilled in \neastern England. These are the Cockle Pits Borehole, east Yorkshire ([NGR SE 9323 \n2865]; see Gaunt et al., 1980) and the Copper Hill Borehole ([NGR SK 9787 4265]; \nsee Berridge et al., 1999). Abundant Liasidium variabile were recorded at 57.32 m, \nwithin the Oxynotum Zone, in the Cockle Pits Borehole (Woollam and Riding, 1983, \np. 25). In the Copper Hill Borehole, Liasidium variabile was found in significant \nproportions (up to 17.4% of the palynoflora at 177.00 m) in 11 samples from the \nBrant Mudstone Formation, all of which are referable to the Oxynotum Zone between \n182.00 to 172.00 m (Riding, 1992b). \n Weiss (1986) recorded Liasidium variabile from the Lower\/Upper Sinemurian \nboundary beds (Turneri and Obtusum zones) in Germany. Other reports from the \nObtusum Zone include Riding (1987), Bucefalo Palliani and Riding (2000) from \neastern England and Van de Schootbrugge et al. (2005) from west Wales. Despite the \nrelatively restricted range of Liasidium variabile, the spread of records is interesting \nand may represent differing recovery of ammonites and\/or the quality of ammonite \ninterpretations. \n Bucefalo Palliani and Riding (2000) found that Liasidium variabile \nMorphotype A, with short polar horns, first appears in the Late Sinemurian Obtusum \nZone (Denotatus Subzone) and extends into the overlying Simpsoni Subzone of the \nOxynotum Zone. By contrast Liasidium variabile Morphotype B, with a prominent \napical horn, is typically confined to the Oxynotum Subzone (Bucefalo Palliani & \nRiding 2000, p. 5, 10). Hence, the presence of Liasidium variabile morphotypes A \nand B in the two samples from Raasay indicates that this part of the Pabay Shale \nFormation is of Late Sinemurian age and referable to the Oxynotum Zone (and \nprobably the Oxynotum Subzone). \n 6\n \n \nConclusions \n \n The prominent occurrence of the dinoflagellate cyst Liasidium variabile \nwithin a thermally-mature palynomorph association in the Pabay Shale Formation of \nsouthwest Raasay is the first record of this biostratigraphically important Late \nSinemurian species in Scotland. This record unequivocally confirms the presence of \nUpper Sinemurian strata within the Pabay Shale Formation in the southwest part of \nRaasay. This occurrence is strongly indicative of the Oxynotum Zone, and the \npresence of Liasidium variabile morphotypes A and B strongly suggests the \nOxynotum Subzone of the Oxynotum Zone. The Oxynotum Zone has not previously \nbeen identified on Raasay. The presence of the Upper Sinemurian is not consistent \nwith the Late Sinemurian hiatus on Raasay proposed by Richey (1961) and Sellwood \n(1972). \n \n \nAcknowledgements \n \n We gratefully acknowledge the assistance of Mary Lehane for laboratory \npreparation of the samples. The contribution of James B. Riding was completed under \nthe BGS Individual Merit project entitled Global Jurassic dinoflagellate cyst \npalaeobiology and its applications. James B. Riding publishes with the permission of \nthe Executive Director, British Geological Survey (N.E.R.C.). \n \n \nReferences \n \nAINSWORTH, N.R., O'NEILL, M.O., RUTHERFORD, M.M., CLAYTON, G., \nHORTON, N.F. & PENNEY, R.A. 1987. Biostratigraphy of the Lower Cretaceous, \nJurassic and uppermost Triassic of the North Celtic Sea and Fastnet Basins. In: \nBrooks, J. & Glennie, K. (eds.). Petroleum Geology of North West Europe. Graham \nand Trotman, 611-622. \n \n 7\nAINSWORTH, N.R., O'NEILL, M.O. & RUTHERFORD, M.M. 1989. Jurassic and \nUpper Triassic biostratigraphy of the North Celtic Sea and Fastnet Basins. In: Batten, \nD.J. & Keen, M.C. (eds.). Northwest European micropalaeontology and palynology. \nBritish Micropalaeontological Society Series. Ellis Horwood Limited, Chichester, 1-\n44. \n \nBELOW, R. 1987. Evolution und Systematik von Dinoflagellaten-Zysten aus der \nOrdnung Peridiniales. I. Allgemeine Grundlagen und Subfamilie \nRhaetogonyaulacoideae (Familie Peridiniaceae). Palaeontographica Abteilung B, \n205, 1-164. \n \nBERRIDGE, N.G., PATTISON, J., SAMUEL, M.D.A., BRANDON, A., HOWARD, \nA.S., PHARAOH, T.C. & RILEY, N.J. 1999. Geology of the Grantham district. \nMemoir of the British Geological Survey, Sheet 127 (England and Wales). The \nStationery Office, London, 133 p. \n \nBRADSHAW, M.J. & FENTON, J.P.G. 1982. The Bajocian ‘Cornbrash’ of Raasay, \nInner Hebrides: palynology, facies analysis, and a revised geological map. Scottish \nJournal of Geology, 18, 131-145. \n \nBRENNER, W. 1986. Bemerkungen zur Palynostratigraphie der Rhät-Lias-Grenze in \nSW-Deutschland. Neues Jahrbuch für Geologie und Paläontologie Abhandlungen, \n173, 131-166. \n \nBUCEFALO PALLIANI, R. & RIDING, J.B. 2000. A palynological investigation of \nthe Lower and lowermost Middle Jurassic strata (Sinemurian to Aalenian) from North \nYorkshire, UK. Proceedings of the Yorkshire Geological Society, 53, 1-16. \n \nBUJAK, J.P. & DAVIES, E.H. 1983. Modern and fossil Peridiniineae. American \nAssociation of Stratigraphic Palynologists Contributions Series, 13, 1-203. \n \nCOPE, J.C.W., DUFF, K.L., PARSONS, C.F., TORRENS, H.S., WIMBLEDON, \nW.A. & WRIGHT, J.K. 1980. A correlation of Jurassic rocks in the British Isles. Part \n 8\nTwo: Middle and Upper Jurassic. Geological Society of London, Special Report, 15, \n1-109. \n \nCOPE, J.C.W., GETTY, T.A., HOWARTH, M.K., MORTON, N., & TORRENS, \nH.S. 1980. A correlation of Jurassic rocks in the British Isles. Part One: Introduction \nand Lower Jurassic. Geological Society of London, Special Report, 14, 1-73. \n \nCOX, B.M. & SUMBLER, M.G. 2002. British Middle Jurassic Stratigraphy. \nGeological Conservation Review Series, No 26, Joint Nature Conservatiuon \nCommittee, Peterborough, xvi + 508 p. \n \nDRUGG, W.S. 1978. Some Jurassic dinoflagellate cysts from England, France and \nGermany. Palaeontographica Abteilung B, 168, 61-79. \n \nDYBKJÆR, K. 1988. Palynological zonation and stratigraphy of the Jurassic section \nin the Gassum No. 1-borehole, Denmark. Danmarks Geologiske Undersøgelse Serie \nA, 21, 1-73. \n \nDYBKJÆR, K. 1991. Palynological zonation and palynofacies investigation of the \nFjerritslev Formation (Lower Jurassic-basal Middle Jurassic) in the Danish Subbasin. \nDanmarks Geologiske Undersøgelse Serie A, 30, 1-150. \n \nEVITT, W.R. 1985. Sporopollenin dinoflagellate cysts. Their morphology and \ninterpretation. American Association of Stratigraphic Palynologists, Dallas, xv + 333 \np. \n \nFAUCONNIER, D. 1995. Jurassic palynology from a borehole in the Champagne \narea, France-correlation of the lower Callovian-middle Oxfordian using sequence \nstratigraphy. Review of Palaeobotany and Palynology, 87, 15-26. \n \nFAUCONNIER, D. 1997. Kystes de dinoflagellés des domains Nord-Ouest Européen \net Sud-Téthysien. In: Carion, E. & Hantzpergue, P. (eds.). Biostratigraphie du \nJurassique Ouest-Européen et Méditerranéen. Bulletin des Centres de Recherches \nExploration-Production Elf-Aquitaine Memoir, 17, 225-241. \n 9\n \nFEIST-BURKHARDT, S. 1994. Stratigraphic compilation of Below’s data (1987a, \n1987b and 1990) on Early and Middle Jurassic dinoflagellate cysts. Revue de \nPaléobiologie, 13, 313-318. \n \nFEIST-BURKHARDT, S. & WILLE, W. 1992. Jurassic palynology in southwest \nGermany - state of the art. Cahiers de Micropaléontologie Nouvelle Serie, 7, 141-156. \n \nFENSOME, R.A., GOCHT, H. & WILLIAMS, G.L. 1995. The Eisenack Catalog of \nFossil Dinoflagellates. New Series. Volume 3. E. Schweizerbart’sche \nVerlagsbuchhandlung (Nägele und Obermiller), Stuttgart, 1463-2008. \n \nFENSOME, R.A., MACRAE, R.A., MOLDOWAN, J.M., TAYLOR, F.J.R. & \nWILLIAMS, G.L. 1996. The early Mesozoic radiation of dinoflagellates. \nPaleobiology, 22, 329-338. \n \nFENSOME, R.A., RIDING, J.B. & TAYLOR, F.R.J. 1996. Chapter 6. \nDinoflagellates. In: Jansonius, J. & McGregor, D.C. (eds.). Palynology: principles \nand applications. American Association of Stratigraphic Palynologists Foundation, \nDallas, 1, 107-169. \n \nGAUNT, G.D., IVIMEY-COOK, H.C., PENN, I.E. & COX, B.M. 1980. Mesozoic \nrocks proved by IGS boreholes in the Humber and Acklam areas. Institute of \nGeological Sciences Report, 79\/13, 1-34. \n \nGETTY, T.A. 1973. A revision of the generic classification of the family \nEchioceratidae (Cephalopoda, Ammonoidea) (Lower Jurassic). University of Kansas \nPaleontological Contributions, 63, 1-32. \n \nHESSELBO, S.P., OATES, M.J. & JENKYNS, H.C. 1998. The lower Lias group of \nthe Hebrides Basin. Scottish Journal of Geology, 34, 23-60. \n \nHOWARTH, M.K. 1956. The Scalpa Sandstone of the Isle of Raasay. Proceedings of \nthe Yorkshire Geological Society, 30, 353-370. \n 10\n \nLEE, G.W. 1920. The Mesozoic rocks of Applecross, Raasay and North-East Skye. \nMemoir of the Geological Survey of Great Britain, sheets 81 and 71 (Scotland). His \nMajesty’s Stationery Office, Edinburgh, 93 p. \n \nLUND, J.J. 2003. Rhaetian to Pliensbachian palynostratigraphy of the central part of \nthe NW German Basin exemplified by the Eitzendorf 8 well. Courier \nForschungsinstitut Senckenberg, 241, 69-83. \n \nMELLERE, D. & STEELE, R.J. 1996. Tidal sedimentation in Inner Hebrides half \ngrabens, Scotland: the Mid-Jurassic Bearreraig Sandstone Formation. In: De Batiste, \nM. & Jacobs, P (eds.). Geology of Siliciclastic Shelf Seas. Geological Society Special \nPublication, 117, 49-79. \n \nMOLDOVANU, M. 1987. Liassic palynological assemblages in the Moesian \nPlatform (Romania). Analele Universitaţii Bucuresti, Geologie, 1987, 67-73. \n \nMORBEY, S.J. 1978. Late Triassic and Early Jurassic subsurface palynostratigraphy \nin northwestern Europe. Palinologia número extraordinario, 1, 355-365. \n \nMORBEY, S.J. & DUNAY, R. E. 1978. Early Jurassic to Late Triassic dinoflagellate \ncysts and miospores. In: Thusu B. (ed.). Distribution of biostratigraphically \ndiagnostic dinoflagellate cysts and miospores from the northwest European \ncontinental shelf and adjacent areas. Continental Shelf Institute Publication, 100, 47-\n59. \n \nMORTON, N. 1965. The Bearreraig Sandstone Series (Middle Jurassic) of Skye and \nRaasay. Scottish Journal of Geology, 1, 189-216. \n \nMORTON, N. 1976. Bajocian (Jurassic) stratigraphy in Skye, western Scotland. \nScottish Journal of Geology, 12, 23-33. \n \n 11\nMORTON, N. 1992. Dynamic Stratigraphy of the Triassic and Jurassic of the \nHebrides Basin, NW Scotland. In: Parnell, J. (ed.). Basins on the Atlantic Seaboard: \nPetroleum Geology, Sedimentology and Basin Evolution. Geological Society Special \nPublication, 62, 97-110. \n \nMORTON, N. 1999a. The lower Lias Group of the Hebrides Basin: Comment. \nScottish Journal of Geology, 35, 85-87. \n \nMORTON, N. 1999b. Middle Hettangian (Lower Jurassic) ammonites from Isle of \nRaasay, Inner Hebrides, and correlation of the Hettangian-lowermost Sinemurian \nBreakish Formation in the Skye area, NW Scotland. Scottish Journal of Geology, 35, \n119-130. \n \nMORTON, N. & HUDSON, J.D. 1995. Field guide to the Jurassic of the Isles of \nRaasay and Skye, Inner Hebrides, NW Scotland. In: Taylor, P.D. (ed.). Field Geology \nof the British Jurassic. Geological Society, London, 209-280. \n \nOATES, M.J. 1978. A revised stratigraphy of the Western Scottish Lower Lias \nProceedings of the Yorkshire Geological Society, 42, 143-156. \n \nPAGE, K.N. 1992. The sequence of ammonite correlated horizons in the British \nSinemurian (Lower Jurassic). Newsletters on Stratigraphy, 27, 129-156. \n \nPARTINGTON, M.A., COPESTAKE, P., MITCHENER, B. C. & UNDERHILL, J.R. \n1993. Biostratigraphic calibration of genetic stratigraphic sequences in the Jurassic-\nlowermost Cretaceous (Hettangian to Ryazanian) of the North Sea and adjacent areas. \nIn: Parker, J.R. (ed.). Petroleum Geology of Northwest Europe: Proceedings of the \n4th Conference. The Geological Society, London, 371-386. \n \nPOULSEN, N.E. 1996. Dinoflagellate cysts from marine Jurassic deposits of \nDenmark and Poland. American Association of Stratigraphic Palynologists \nContributions Series, 31, 1-227. \n \n 12\nPOULSEN, N.E. & RIDING, J.B. 2003. The Jurassic dinoflagellate cyst zonation of \nSubboreal Northwest Europe. In: Ineson, J.R. & Surlyk, F. (eds.). The Jurassic of \nDenmark and Greenland. Geological Survey of Denmark and Greenland Bulletin, 1, \n115-144. \n \nRAUSCHER, R., & SCHMITT, J.-P. 1990. Recherches palynologiques dans le \nJurassique d'Alsace (France). Review of Palaeobotany and Palynology, 62, 107-156. \n \nRICHEY, J.E. 1961. British Regional Geology. Scotland: The Tertiary Volcanic \nDistricts (Third Edition). Department of Scientific and Industrial Research, \nGeological Survey and Museum. Her Majesty’s Stationery Office, Edinburgh, 120 p. \n \nRIDING, J.B. 1984. Dinoflagellate range top biostratigraphy of the uppermost \nTriassic to lowermost Cretaceous of northwest Europe. Palynology, 8, 195-210. \n \nRIDING, J.B. 1987. Dinoflagellate cyst stratigraphy of the Nettleton Borehole \n(Jurassic: Hettangian to Kimmeridgian), Lincolnshire, England. Proceedings of the \nYorkshire Geological Society, 46, 231-266. \n \nRIDING, J.B. 1992a. On the age of the Upper Ostrea Member, Staffin Bay Formation \n(Middle Jurassic) of north-west Skye. Scottish Journal of Geology, 28, 155-158. \n \nRIDING, J.B. 1992b. A palynological investigation of the BGS Copper Hill Borehole, \nLincolnshire (1\" sheet 127). British Geological Survey Technical Report, \nWH\/92\/307R, 18 p. (unpublished open file report) \n \nRIDING, J.B. and SARJEANT, W.A.S. 1985. The role of dinoflagellate cysts in the \nbiostratigraphical subdivision of the Jurassic System. Newsletters on Stratigraphy, 14, \n96-109. \n \nRIDING, J.B., WALTON, W. & SHAW, D. 1991. Toarcian to Bathonian (Jurassic) \npalynology of the Inner Hebrides, northwest Scotland. Palynology, 15, 115-179. \n \n 13\nRIDING, J.B. & THOMAS, J.E. 1992. Dinoflagellate cysts of the Jurassic System. In: \nPowell, A.J. (ed.). A stratigraphic index of dinoflagellate cysts. British \nMicropalaeontological Society Publications Series. Chapman and Hall, London, 7-97. \n \nRIDING, J.B. & THOMAS, J.E. 1997. Marine palynomorphs from the Staffin Bay \nand Staffin Shale formations (Middle-Upper Jurassic) of the Trotternish Peninsula, \nNW Skye. Scottish Journal of Geology, 33, 59-74. \n \nRIDING, J.B. & HUBBARD, R.N.L.B. 1999. Jurassic (Toarcian to Kimmeridgian) \ndinoflagellate cysts and paleoclimates. Palynology, 23, 15-30. \n \nRIDING, J.B., ROSE, J. & BOOTH, S.J. 2003. Allochthonous and indigenous \npalynomorphs from the Devensian of the Warham Borehole, Stiffkey, north Norfolk, \nEngland; evidence for sediment provenance. Proceedings of the Yorkshire Geological \nSociety, 54, 223-235. \n \nRUEDA-GAXIOLA, J., LÓPEZ-OCAMPO, E., DUEÑAS, M.A., RODRÍGUEZ, J.L. \n& TORRES-RIVERO, A. 1999. Palynostratigraphical method: Basis for defining \nstratigraphy and age of the Los San Pedros allogroup, Huizachal-Peregrina \nanticlinorium, Mexico. In: Bartolini, C., Wilson, J.L., & Lawton, T.F. (eds.). \nMesozoic Sedimentary and Tectonic History of North-Central Mexico. Geological \nSociety of America Special Paper, 340, 229-269. \n \nSELLWOOD, B.W. 1972. Regional environmental changes across a Lower Jurassic \nstage-boundary in Britain Palaeontology, 15, 125-157. \n \nSIMMS, M.J., CHIDLAW, N., MORTON, N. & PAGE, K.N. 2004. British Lower \nJurassic Stratigraphy. Geological Conservation Review Series, No 30, Joint Nature \nConservatiuon Committee, Peterborough, xvi + 458 p. \n \nSTOVER, L.E., BRINKHUIS, H., DAMASSA, S.P., de VERTEUIL, L., HELBY, \nR.J., MONTEIL, E., PARTRIDGE, A.D., POWELL, A.J., RIDING, J.B., \nSMELROR, M. & WILLIAMS, G.L. 1996. Chapter 19. Mesozoic-Tertiary \ndinoflagellates, acritarchs and prasinophytes. In: Jansonius, J. & McGregor, D.C. \n 14\n(eds.). Palynology: principles and applications. American Association of \nStratigraphic Palynologists Foundation, Dallas, 2, 641-750. \n \nVAN DE SCHOOTBRUGGE, B., BAILEY, T.R., ROSENTHAL, Y., KATZ, M.E., \nWRIGHT, J.D., MILLER, K.G., FEIST-BURKHARDT, S. & FALKOWSKI, P.G. \n2005. Early Jurassic climate change and the radiation of organic-walled \nphytoplankton in the Tethys Ocean. Paleobiology, 31, 73-97. \n \nVAN DE SCHOOTBRUGGE, B., TREMOLADA, F., ROSENTHAL, Y., BAILEY, \nT.R., FEIST-BURKHARDT, S., BRINKHUIS, H., PROSS, J., KENT, D.V. & \nFALKOWSKI, P.G. 2007. End-Triassic calcification crisis and blooms of organic-\nwalled ‘disaster species’. Palaeogeography, Palaeoclimatology, Palaeoecology, 244, \n126-141. \n \nWEISS, M. 1986. Liasidium variabile, eine Dinoflagellate mit stratigraphischem Wert \nan der Grenze Unter-\/Ober-Sinemurium. Neues Jahrbuch für Geologie und \nPaläontologie Monatschefte, 1986(5), 317-320. \n \nWILLIAMS, G.L., ASCOLI, P., BARSS, M.S., BUJAK, J.P., DAVIES, E.H., \nFENSOME, R.A. & WILLIAMSON, M.A. 1990. Biostratigraphy and related studies. \nIn: Keen, M.J. & Williams, G.L. (eds.). Geology of the Continental Margin of Eastern \nCanada. Geology of Canada volume 2, Geological Survey of Canada (also The \nGeology of North America v. I-1, Geological Society of America), 89-137. \n \nWOOD, G.D., GABRIEL, A.M. & LAWSON, J.C. 1996. Chapter 3. Palynological \ntechniques – processing and microscopy. In: Jansonius, J. & McGregor, D.C. (eds.). \nPalynology: principles and applications. American Association of Stratigraphic \nPalynologists Foundation, Dallas, 1, 29-50. \n \nWOOLLAM, R., & RIDING, J.B. 1983. Dinoflagellate cyst zonation of the English \nJurassic. Institute of Geological Sciences Report, 83\/2, 1-42. \n \n \nAPPENDIX 1 \n 15\n \n Appendix 1 is a systematic section and comprises a review of the \nstratigraphically important genus Liasidium Drugg 1978, and lists the previously \npublished illustrated occurrences of the single species, Liasidium variabile Drugg \n1978. \n \nSystematic Palaeontology \n \nDivision DINOFLAGELLATA (Bütschli 1885) Fensome et al. 1993 \nSubdivision DINOKARYOTA Fensome et al. 1993 \nClass DINOPHYCEAE Pascher 1914 \nSubclass PERIDINIPHYCIDAE Fensome et al. 1993 \nOrder PERIDINIALES Haeckel 1894 \nSuborder HETEROCAPSINEAE Fensome et al. 1993 \nFamily HETEROCAPSACEAE Fensome et al. 1993 \n \nGenus Liasidium Drugg 1978, p. 69. \nType: Liasidium variabile Drugg 1978, pl. 5, fig. 9; Fensome et al. 1995, p. 1881, fig. \n4. \nRemarks: In phylogenetic terms, Liasidium is a highly significant monotypic \ndinoflagellate cyst genus. It is part of a relatively low-diversity plexus of apparently \nrelatively primitive genera which characterise the Mid-Late Triassic and Early-earliest \nMid Jurassic interval. These forms preceded the major evolutionary radiation of the \nOrder Gonyaulacales which started during the Bajocian Stage of the Mid Jurassic \n(Fensome et al., 1996, fig. 1). The characteristic biconical shape of Liasidium and the \npresence of polar horns are similar to those of Mid-Late Triassic genera such as \nHeibergella Bujak & Fisher 1976, Rhaetogonyaulax Sarjeant 1966 emend. Below \n1987 and Sverdrupiella Bujak & Fisher 1976. Drugg (1978, p. 70) remarked that \nLiasidium appears to have peridiniinean affinities, probably due to the prominent \nanterior intercalary archaeopyle. Bujak and Davies (1983, p. 56, fig. 22) and Evitt \n(1985) also commented that the genus may be one of the earliest representatives of the \nperidinioid lineage. Below (1987, p. 128, fig. 68a,b) also discussed this question and \ninterpreted the shape of the type I2a archaeopyle as heptagonal. The shape of the \narchaeopyle (i.e. the 2a plate) is hence not typical of the Family Peridiniaceae \n 16\nEhrenberg 1831 because it has a geniculate anterior margin. Below (1987, p. 128) \ncommented that, because of this, Liasidium appears to be closely related to \nRhaetogonyaulax. \n Van de Schootbrugge et al. (2005) commented that the presence of younger \ngenera of the Family Heterocapsaceae such as Parvocysta Bjaerke 1980 and \nReutlingia Drugg 1978 emend. Below 1987 in the Toarcian-Aalenian. Liasidium was \nthus considered by these authors to be a ‘missing link’ between the Mid-Late Triassic \nand latest Early-earliest Mid Jurassic Rhaetogonyaulax and Parvocysta\/Susadinium \nsuites respectively. Van de Schootbrugge et al. (2007) commented on the severe \nextinction of dinoflagellate cysts at the Triassic-Jurassic boundary. The presence of \nabundant Liasidium variabile in the late Sinemurian, during the Hettangian to late \nPliensbachian interval which was otherwise largely devoid of dinoflagellate cysts, is \nintriguing. It is possible that it was an opportunistic taxon which thrived briefly, \nperhaps in response to a major palaeoecological event. It is also possible that \nLiasidium variabile may have been a heterotrophic species (S. Feist-Burkhardt, \npersonal communication, 2009), and hence was adapted to particular nutritional \ncircumstances. \n Van de Schootbrugge et al. (2005, p. 87-88) speculated that Liasidium was \nassociated with late sea level highstands, and that this genus migrated from the \npalaeo-Pacific into the Tethys during the Late Sinemurian as a result of changes in \nocean circulation. This is consistent with the interpretation of Liasidium variabile as a \nwarm water taxon by Riding and Hubbard (1999). However, there are no reports of \nthis species from the palaeo-Pacific region, except for the unsubstantiated occurrence \nof cf. Liasidium variabile from the Lower Jurassic of Mexico by Rueda-Gaxiola et al. \n(1999). \n \nSpecies Liasidium variabile Drugg 1979 (Fig. 4.1-4.12) \n \nFull synonymy: \n1978 Liasidium variabile Drugg, p. 69, 70, pl. 4, fig. 10, pl. 5, figs 1-9. \n1978 “Liassogonyaulax complexa” Morbey, figs. 2.2-2.12, pl. 1, figs. 10-29. \n1978 Dinoflagellate sp. 2 Morbey and Dunay, pl. 1, figs. 7-13. \n1983 Liasidium variabile Drugg 1978. Bujak and Davies, fig. 22. \n1983 Liasidium variabile Drugg 1978. Woollam and Riding, pl. 1, fig. 5. \n 17\n1984 Liasidium variabile Drugg 1978. Riding, pl. 1, fig. 4. \n1986 Liasidium variabile Drugg 1978. Brenner, p. 159, fig. 8.25. \n1986 Liasidium variabile Drugg 1978. Weiss, p. 318-320, figs. 1, 2. \n1987 Liasidium variabile Drugg 1978. Below, figs. 68a,b. \n1987 Liasidium variabile Drugg 1978. Riding, fig. 6.1. \n1988 Liasidium variabile Drugg 1978. Dybkjær, p. 26, 27, pl. 13, fig. 6. \n1990 Liasidium variabile Drugg 1978. Rauscher and Schmitt, pl. VI, fig. 12. \n1991 Liasidium variabile Drugg 1978. Dybkjær, p. 30, pl. 16, figs. 3, 6. \n1992 Liasidium variabile Drugg 1978. Riding and Thomas, pl. 2.1, figs. 2-4, 8. \n1996 Liasidium variabile Drugg 1978. Poulsen, pl. 41, figs. 3-5. \n1996 Liasidium variabile Drugg 1978. Fensome et al., pl. 4, fig. 3. \n1996 Liasidium variabile Drugg 1978. Stover et al., pl. 1, fig. 9, pl. 2, fig. 10. \n2000 Liasidium variabile Drugg 1978. Bucefalo Palliani and Riding, figs. 5A-B, \n6A-6H. \n2003 Liasidium variabile Drugg 1978. Lund, pl. 2, fig. 6. \n2003 Liasidium variabile Drugg 1978. Riding et al., fig 3E. \n \nRemarks. In the above synonymy list, all the previous illustrated records of Liasidium \nvariabile are listed in chronological order. This species has also been reported, but not \nfigured by, for example, Riding and Sarjeant (1985), Ainsworth et al. (1987; 1989), \nWilliams et al. (1990), Feist Burkhardt and Wille (1992), Partington et al. (1993), \nFeist Burkhardt (1994), Fauconnier (1995; 1997), Poulsen & Riding (2003) and Van \nde Schootbrugge et al. (2005). Liasidium variabile has been reported from the \nHettangian to the Early Pliensbachian of Europe (Denmark, England, France, \nGermany, offshore Ireland and Wales) and offshore eastern Canada. The numerous \nrecords of this species, however, indicate that it is normally confined to the Late \nSinemurian (Oxynotum Zone) (Fig. 5). The report of this form from the Toarcian of \nRomania by Moldovanu (1987) is not substantiated. A specimen of Liasidium \nvariabile reworked into Late Devensian (Late Quaternary) glaciolacustrine sediments \nof Norfolk was illustrated by Riding et al. (2003, fig. 3E). \n \n \nFigure captions: \n \n 18\nFIG. 1. The Lower and Middle Jurassic lithostratigraphy of Raasay, and the ammonite \nbiostratigraphy of the Pabay Shale Formation. The Oxynotum Zone is asterisked to \nindicate that this has been identified by this study. \n \nFIG. 2. The position of the outcrop sampled between Suisnish Point and Inverarish in \nsouthwest Raasay, and the location of the Isle of Raasay. \n \nFIG. 3. Annotated photographs of the sampling points along the road cutting between \nSuisnish Point and Inverarish, southwest Raasay showing the sampling points, \nfaulting in the Pabay Shale Formation, intrusive dykes cutting through the Pabay \nShale Formation and the overlying Raasay Granite. \n \nFIG. 4. Selected marine microplankton from the Pabay Shale Formation of southwest \nRaasay. All photomicrographs were taken using plain transmitted light. The \nspecimens are curated in the palaeontological collections of the Department of \nGeology, University College Cork, Ireland. Note the relatively high thermal alteration \nlevel of these palynomorphs. \n(1-12) Liasidium variabile Drugg 1978. Note the relatively squat, biconical outline, \nthe polar horns which are somewhat variable in size, the large anterior intercalary \narchaeopyle and the prominent laevorotatory cingulum. Some specimens, for example \nfigures 10-12 have a pronounced right lateral ‘shoulder’ on the hypocyst. \n(1) Sample JMB 1, slide 4, England Finder coordinate F23. \n(2) Sample JMB 1, slide 5, England Finder coordinate J31. \n(3) Sample JMB 1, slide 5, England Finder coordinate O28. \n(4) Sample JMB 1, slide 3, England Finder coordinate P26. \n(5) Sample JMB 2, slide 1, England Finder coordinate M20. \n(6) Sample JMB 1, slide 3, England Finder coordinate N37. \n(7) Sample JMB 1, slide 4, England Finder coordinate D21. \n(8) Sample JMB 1, slide 4, England Finder coordinate L12. \n(9) Sample JMB 1, slide 1, England Finder coordinate L19. \n(10) Sample JMB 1, slide 5, England Finder coordinate R20. \n(11) Sample JMB 1, slide 1, England Finder coordinate K21. \n(12) Sample JMB 1, slide 1, England Finder coordinate J23. \n 19\n(13-16) Micrhystridium spp. These are representatives of an important \nacanthomorphic acritarch genus. \n(13) Sample JMB 1, slide 3, England Finder coordinate D22. \n(14) Sample JMB 1, slide 1, England Finder coordinate H13. \n(15) Sample JMB 1, slide 5, England Finder coordinate R40. \n(16) Sample JMB 1, slide 4, England Finder coordinate P19. \n \nFIG. 5. A compilation of the published records of the range of Liasidium variabile \nfrom northwest Europe and eastern Canada. Reports in generic compilations such as \nStover et al. (1996) are not included because they merely repeat previously published \nranges. If the surnames of the authors are in upper case font, the respective study is \nbased on specified geological materials e.g. a borehole section. If the surnames of the \nauthors are in initial capitals and lower case font, the respective study did not specify \nthe sample database. Records with square symbols indicate that the samples are \npositively correlated to the ammonite zonation. The circular symbols indicate that the \nsamples have no ammonite control. One, two or three symbols indicate that Liasidium \nvariabile is present, common and abundant respectively. \n"}