{"doi":"10.1057\/sub.2008.19","coreId":"95641","oai":"oai:eprints.lse.ac.uk:25593","identifiers":["oai:eprints.lse.ac.uk:25593","10.1057\/sub.2008.19"],"title":"Fantasmatic transactions: on the persistence of apartheid ideology","authors":["Hook, Derek"],"enrichments":{"references":[{"id":17239135,"title":"(Per)versions of love and hate.","authors":[],"date":"1998","doi":"10.1177\/146349960100100122","raw":"Salecl, R. (1998). (Per)versions of love and hate. Verso: London & New York.","cites":null},{"id":17239145,"title":"2 It is worth making mention of two attempts to extend Lacan’s alienation\/separation distinction. Dolar","authors":[],"date":"1998","doi":null,"raw":"2 It is worth making mention of two attempts to extend Lacan’s alienation\/separation distinction. Dolar (1998) makes the promising observation that this opposition can be read “as an elaboration of the difference between metaphor and metonymy” (p. 24). Jacques-Alain Miller (2007) speaks of how alienation “foregrounds the subject of the signifier, just as separation foregrounds the subject of jouissance” (p. 61). He also emphasizes the two different modes of identification thus implied: identification by means of representation (alienation), identification with the object (separation). In separation we cannot say that the subject is represented, by contrast: All…we can say of the subject [of separation] is that it is little a. The subject asserts itself as object a. The positivization we have here with little a comes from the use that the subject makes of its own lack as subject of the signifier, by fitting itself to the Other’s lack. There is no representation. There is an identity as little a (p. 61).","cites":null},{"id":17239138,"title":"Causation and destitution of a pre-ontological nonentity: On the Lacanian subject.","authors":[],"date":"1999","doi":null,"raw":"Verhaeghe, P. (1999). Causation and destitution of a pre-ontological nonentity: On the Lacanian subject. In D. Nobus (Ed.), Key concepts of Lacanian Psychoanalysis, pp. 164-189. New York: Other Press Žižek, S. (1989). The sublime object of ideology. Verso: London.","cites":null},{"id":17239127,"title":"Cogito as the Subject of the Unconscious.","authors":[],"date":"1998","doi":"10.1215\/9780822382126-002","raw":"Dolar, M. (1998). Cogito as the Subject of the Unconscious. In S. Žižek (Ed.) Cogito and the Unconscious, pp. 11-40. Duke University Press: Durham NC & London.","cites":null},{"id":17239139,"title":"Enjoy your Symptom: Jacques Lacan in Hollywood and out. London &","authors":[],"date":"1992","doi":"10.4324\/9780203825402","raw":"Žižek, S. (1992). Enjoy your Symptom: Jacques Lacan in Hollywood and out. London & New York: Routledge.","cites":null},{"id":17239144,"title":"Ethics of the real,","authors":[],"date":"2000","doi":null,"raw":"Zupančič, A. (2000). Ethics of the real, Kant, Lacan. London & New York: Verso. Short biography Derek Hook is a lecturer in the Institute of Social Psychology at the London School of Economics. He is also a Research Fellow in Psychology in the School of Human and Community Development, University of the Witwatersrand, Johannesburg the same institution from which he received his PhD – a Foucault inspired analytics of psychotherapeutic power - in 2001. In 2002 he was a Rockefeller Research Fellow at the Institute for the Study of Public Culture, Emory University, Atlanta. He has acted as lead editor on a series of books published by University of Cape Town Press (Psychology & Social Prejudice (2002), Developmental Psychology (2002), Critical Psychology (2004), Self, Community & Psychology (2004). The over-arching focus of his research concerns the attempt to develop an ‘analytics of power’ sufficiently able to grapple with the unconscious and psychological dimensions of racism and ideological subjectivity. This work, which has drawn on – and often attempted to combine - aspects each of Foucauldian, postcolonial and psychoanalytic modes of critique has resulted in publications in Theory & Psychology, Journal of Community and Applied Social Psychology,  Geoforum,  Psychoanalytic Review and Qualitative Research in Psychology. His first single-authored text Foucault, Psychology & the Analytics of Power, was published by Palgrave in 2007. He is the coordinator of Psychoanalysis@LSE a multi-disciplinary research group that aims to advance the use of psychoanalysis as a distinctive means of sociological and political analysis. 1 As I hope is obvious, just as Lacan’s theory of the processes of alienation\/separation is not to be confused with Marxist or Existentialist notions of alienation, or indeed with any psychological theories of separation (developmental theories, notions of separation-anxiety, attachment, etc.) By contrast, we are here concerned with an unconscious dimension of subject-Other relationship, with one aspect of the inter-implication of the trans-subjective socio-historical substance and unconscious subjectivity.","cites":null},{"id":17239142,"title":"Interrogating the","authors":[],"date":"2005","doi":null,"raw":"Žižek, S. (2005). Interrogating the Real. (Eds.), R. Butler & S. Stephens. New York & London: Continuum.","cites":null},{"id":17239129,"title":"Jacques Lacan. London &","authors":[],"date":"2005","doi":"10.4324\/9780203347232","raw":"Homer, S. (2005). Jacques Lacan. London & New York: Routledge.","cites":null},{"id":17239133,"title":"Sexuality in the field of vision.","authors":[],"date":"1996","doi":null,"raw":"Rose, J. (1996). Sexuality in the field of vision. Verso: London.","cites":null},{"id":17239130,"title":"The four fundamental concepts of psychoanalysis,","authors":[],"date":"1979","doi":null,"raw":"Lacan, J. (1979). The four fundamental concepts of psychoanalysis, (Ed.) J.A. Miller. London: Hogarth Press\/Penguin.","cites":null},{"id":17239140,"title":"The Indivisible Remainder: On Schelling and Related Matters. London &","authors":[],"date":"1996","doi":null,"raw":"Žižek, S. (1996). The Indivisible Remainder: On Schelling and Related Matters. London & New York: Verso.","cites":null},{"id":17239137,"title":"The Lacanian left.","authors":[],"date":"2007","doi":"10.3366\/edinburgh\/9780748619801.001.0001","raw":"Stavrakakis, Y. (2007). The Lacanian left. Edinburgh University Press.","cites":null},{"id":17239128,"title":"The Lacanian subject between language and jouissance.","authors":[],"date":"1995","doi":"10.1093\/fs\/53.3.371","raw":"Fink, B. (1995). The Lacanian subject between language and jouissance. Princeton: Princeton University Press.","cites":null},{"id":17239126,"title":"The location of culture.","authors":[],"date":"2004","doi":"10.4324\/9780203820551","raw":"Bhabha, H. (2004). The location of culture. London: Routledge. Coetzee, J.M. (1991). The mind of apartheid: Geoffrey Cronjé. Social Dynamics, 17: 1-35.","cites":null},{"id":17239141,"title":"The plague of fantasies. London &","authors":[],"date":"1997","doi":"10.1177\/135485659800400213","raw":"Žižek, S. (1997). The plague of fantasies. London & New York: Routledge.   28 Žižek, S. (2000). The fragile absolute, or, why the Christian legacy is worth fighting for. London & New York: Verso.","cites":null},{"id":17239131,"title":"The politics of race, class and nationalism. In S. Marks & S. Trapido (Eds.) The politics of race, class and nationalism in twentieth-century South Africa.","authors":[],"date":"1987","doi":"10.2307\/220216","raw":"Marks, S. & Trapido, S. (1987). The politics of race, class and nationalism. In S. Marks & S. Trapido (Eds.) The politics of race, class and nationalism in twentieth-century South Africa. London: Longmans.","cites":null},{"id":17239132,"title":"The sinthome, a mixture of symptom and fantasy.","authors":[],"date":"2007","doi":null,"raw":"Miller, J.A. (2007). The sinthome, a mixture of symptom and fantasy. In V. Voruz & B. Wolf (Eds.) The later Lacan, pp. 55-72. State University of New York Press: Albany, NY.","cites":null},{"id":17239136,"title":"The subject and the","authors":[],"date":"1995","doi":null,"raw":"Soler, C. (1995). The subject and the Other (I). In R. Feldstein, B. Fink & M. Jaanus (Eds.), Reading Seminar XI, pp. 39-44. Albany: State University of New York.","cites":null},{"id":17239134,"title":"The world, the text and the critic. Cambridge:","authors":[],"date":"1983","doi":"10.2307\/3684960","raw":"Said, E. (1983). The world, the text and the critic. Cambridge: Harvard University Press.","cites":null}],"documentType":{"type":0.7777777778}},"contributors":[],"datePublished":"2008-09","abstract":"Apartheid ideology presents traditional historiography with a series of conundrums: the difficulty of separating historical from subjective agency; the paradoxical status of ideologues who both author ideology and are nonetheless also subject to the spread of its ideas; the issues of the non-material benefits that appear to drive its ideological system. Taking as its starting point J.M. Coetzee's reflections on these issues, this paper builds on his promising intuition of the notion of \"fantasmatic rewards\" as a crucial explanatory element in understanding the \"mind of apartheid\". Crucial in this respect are a number of Lacanian concepts (desire, the Other, fantasy, objet petit a, alienation and separation). Recourse to these notions enables us to provide a series of responses to the above dilemmas of apartheid ideology. Such concepts, moreover, arguably do greater conceptual justice to the inter-implication of the Other and the subject, that is, to the inter-implication of the trans-subjective socio-historical substance and unconscious subjectivity","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/95641.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/25593\/1\/Fantasmatic_transactions_%28LSERO_version%29.pdf","pdfHashValue":"006fb1724cb4f8860ac3290d195b0c75dd27e879","publisher":"Palgrave Macmillan","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:25593<\/identifier><datestamp>\n      2016-06-20T11:17:23Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D5053<\/setSpec><setSpec>\n      74797065733D4445505453:4C53452D504253<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/25593\/<\/dc:relation><dc:title>\n        Fantasmatic transactions: on the persistence of apartheid ideology<\/dc:title><dc:creator>\n        Hook, Derek<\/dc:creator><dc:subject>\n        BF Psychology<\/dc:subject><dc:description>\n        Apartheid ideology presents traditional historiography with a series of conundrums: the difficulty of separating historical from subjective agency; the paradoxical status of ideologues who both author ideology and are nonetheless also subject to the spread of its ideas; the issues of the non-material benefits that appear to drive its ideological system. Taking as its starting point J.M. Coetzee's reflections on these issues, this paper builds on his promising intuition of the notion of \"fantasmatic rewards\" as a crucial explanatory element in understanding the \"mind of apartheid\". Crucial in this respect are a number of Lacanian concepts (desire, the Other, fantasy, objet petit a, alienation and separation). Recourse to these notions enables us to provide a series of responses to the above dilemmas of apartheid ideology. Such concepts, moreover, arguably do greater conceptual justice to the inter-implication of the Other and the subject, that is, to the inter-implication of the trans-subjective socio-historical substance and unconscious subjectivity.<\/dc:description><dc:publisher>\n        Palgrave Macmillan<\/dc:publisher><dc:date>\n        2008-09<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/25593\/1\/Fantasmatic_transactions_%28LSERO_version%29.pdf<\/dc:identifier><dc:identifier>\n          Hook, Derek  (2008) Fantasmatic transactions: on the persistence of apartheid ideology.  Subjectivity, 24 (1).  pp. 275-297.  ISSN 1755-6341     <\/dc:identifier><dc:relation>\n        http:\/\/www.palgrave-journals.com\/sub\/index.html<\/dc:relation><dc:relation>\n        10.1057\/sub.2008.19<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/eprints.lse.ac.uk\/25593\/","http:\/\/www.palgrave-journals.com\/sub\/index.html","10.1057\/sub.2008.19"],"year":2008,"topics":["BF Psychology"],"subject":["Article","PeerReviewed"],"fullText":"  \nDerek Hook  \nFantasmatic transactions: on the \npersistence of apartheid ideology \n \nArticle (Accepted version) \n(Refereed) \nOriginal citation: \nHook, Derek (2008) Fantasmatic transactions: on the persistence of apartheid ideology. \nSubjectivity, 24 (1). pp. 275-297. ISSN 1755-6341  \n \nDOI: 10.1057\/sub.2008.19\n \n© 2008 Palgrave Macmillan  \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/25593\/\n \nAvailable in LSE Research Online: April 2010 \n \nLSE has developed LSE Research Online so that users may access research output of the \nSchool. Copyright © and Moral Rights for the papers on this site are retained by the individual \nauthors and\/or other copyright owners. Users may download and\/or print one copy of any \narticle(s) in LSE Research Online to facilitate their private study or for non-commercial research. \nYou may not engage in further distribution of the material or use it for any profit-making activities \nor any commercial gain. You may freely distribute the URL (http:\/\/eprints.lse.ac.uk) of the LSE \nResearch Online website.  \n \nThis document is the author’s final manuscript accepted version of the journal article, \nincorporating any revisions agreed during the peer review process.  Some differences between \nthis version and the published version may remain.  You are advised to consult the publisher’s \nversion if you wish to cite from it. \n 1\n \nFantasmatic transactions  \nOn the persistence of apartheid ideology \n \nDerek Hook  \nInstitute of Social Psychology, London School of Economics and Political \nScience \n \nCorrespondence: Institute of Social Psychology, London School of Economics \nand Political Science, Houghton Street, London, WC2A 2AE, United Kingdom \nEmail: d.w.hook@lse.ac.uk \n \n \nABSTRACT: Apartheid ideology presents traditional historiography with a \nseries of conundrums: the difficulty of separating historical from subjective \nagency; the paradoxical status of ideologues who both author ideology and \nyet are nonetheless also subject to the spread of its ideas; the issue of the \nnon-material benefits which appear to drive its ideological system. Taking as \nits starting-point J.M. Coetzee’s (1991) reflections on these issues, this paper \nbuilds on his promising intuition of the notion of ‘fantasmatic rewards’ as a \ncrucial explanatory element in understanding the ‘mind of apartheid’. Crucial \nin this respect are a number of Lacanian concepts (desire, the Other, fantasy, \nobjet petit a, alienation and separation). Recourse to these notions enables us \nto provide a series of responses to the above dilemmas of apartheid ideology. \nSuch concepts, moreover, arguably do greater conceptual justice to the inter-\nimplication of Other and subject, that is, to the inter-implication of the trans-\nsubjective socio-historical substance and unconscious subjectivity. \n \nKeywords: Lacanian psychoanalysis, apartheid, ideology, racism, desire, \nOther, agency, alienation, separation, fantasy, objet petit a, fantasmatic \nrewards, unconscious subjectivity. \n \nIntroduction \nThe historical analysis of racist ideology – and that of apartheid in particular – \npresents traditional historiography with a series of conundrums. There is the \nproblem of how to conceptualize the role of madness in history, the issue, that \nis to say, of how rationalist frameworks of explanation grapple with the \nfantasmatic dimension of racism, and the related question of how materialist \napproaches understand racism’s non-material rewards. Additionally, there are \na series of subsidiary considerations of crucial importance in understanding \nthe functioning of apartheid ideology: the difficulty of separating historical from \nsubjective agency; the paradoxical status of ideologues who both author \nideology and yet are nonetheless also subject to its spread of its ideas; and \n 2\nthe issues of what non-material benefits appear to drive the ideological \nsystem. These are not new problems; they have in fact been expertly \nelucidated in an article by the author J.M. Coetzee, which I have taken as a \ntouchstone for the current paper, a vehicle for introducing and dramatizing a \nseries of quandaries of ideology to which I think Lacanian theory offers an \nimportant set of responses.  \nA Lacanian standpoint is clearly not one that doubts the centrality of \ndesire when it comes to issues of subjectivity. It likewise does not shy away \nfrom the complexities and ambiguities evident in the subject-Other (or subject-\nStructure) relation. These Lacanian perspectives make for crucial analytical \nresources - as I hope shortly to demonstrate - and they certainly support the \nargument that a Lacanian frame of analysis enables us to conceptualize the \ntransactions underlying the operation of apartheid ideology. My objective here \nis modest, not to carry out any sustained empirical analysis but simply to \nconnect a particular facet of Lacanian theory to the dilemmas Coetzee \nhighlights. More specifically, my intent is to make the case for Lacan’s notions \nof fantasy, the big Other, the objet petit a and the aligned processes of \nalienation and separation as vital conceptual instruments through which to \napproach the explanatory dilemmas mentioned above.  \n \nLacanian desire  \nDesire for Spinoza, as Lacan reminds us in the final pages of Seminar XI, The \nFour Fundamental Concepts of Psychoanalysis, is “the essence of man” \n(1979, p. 275). Now while this is not strictly Lacan’s position – the \npresumption of any such subjective essence is anathema to his concerns – it \ndoes nonetheless give us a flavour of his concerns in Seminar XI, and a \nsense of where a Lacanian mode of analysis might begin. Desire for Lacan is \nlinked to questions of being, and it retains always a relation to that which the \nsubject is lacking. To refer to Stavrakakis, “socially conditioned desire \nconstitutes the alienated, ‘extimate’…(‘externally intimate’)…essence of our \nreality” (p. 47). This, desire, is what psychoanalysis must attempt to read; it is \nwhat a Lacanian analytics must attempt to follow. \n We can relate this issue of desire – which is always sustained and \nshaped by fantasy, for fantasy tells me what I desire - to a fundamental \n 3\npattern, or perhaps structure of questioning: “What does the Other want?” I \nsay ‘structure’ here to emphasize that despite countless performative \nvariations and innumerable differences of situation and spoken content, there \nis nonetheless a basic type of appeal, and a single addressee in question. \nThe period of early childhood provides us with a context for the emergence of \nsuch a mode of questioning. “What does she (the mother) want?” provides us \nwith perhaps the most elementary form of this questioning, or, in a way which \nbetter lends itself to adaptations of behaviour: “How can I be what she \nwants?”, “How can I incarnate within myself that which embodies her desire?” \nSomething like a riddle of desire emerges here: I desire to be that which she \ndesires and in this way I myself come to desire. Bruce Fink puts this well: “in \nthe child’s attempt to grasp what remains essentially indecipherable in the \nOther’s desire…the child’s own desire is founded; the Other’s desire begins to \nfunction as the cause of the child’s desire” (1995, p. 59). Or, to draw on \nŽižek’s (1996) discussion of the implications of Lacan’s “Desire is the desire \nof the Other”: \nFirst, there is the dialectic of recognition in which the other’s desire \nis the object of my desire: what I desire is to be desired – \nrecognized by the other (‘the first object of desire is to be \nrecognized by the other’). Secondly, ‘it is qua Other that he [the \nsubject] desires – that is, what I desire is predetermined and \ndecided at the Other Place of the anonymous-transsubjective \nsymbolic order, it is ‘mediated’ by the symbolic network of the \ncultural tradition to which I belong” (p. 167). \nThe threefold implication of the above state of affairs is worth reiterating: an \nOther’s desire causes mine, it ignites my desire, sets it in motion, firstly; this \ndesire becomes what I want to be inasmuch as I want to be this object of \ndesire, secondly; I come to desire the same things as this desiring Other, I am \nsimilarly located in the social field of desires, I take on their ‘perspective of \ndesire’, thirdly. Already then we have the indication that the subject’s relation \nto desire and to the Other’s desire – crucial to the problems of ideology to \nwhich we will shortly turn – is of considerable complexity. \nThe child’s eventual realization is that the goal of personifying the \nmother’s desire is futile. This desire is neither static nor unchanging, it proves \n 4\nto be always in excess of the child, out of their reach, headed elsewhere. The \nchild thus must come to understand themselves as lacking, inadequate to the \ntask of embodying this desire. Moreover – and this is the moment which \nheralds the possibility of a type of separation from the Other – the child \nglimpses that the mother is also lacking; she must be, because she is marked \nby desire, she is not complete, she desires something that exceeds her. This \nis the difficulty that plagues the pattern of questioning mentioned above: the \nissue of my desire remains always contingent on an Other, on the question of \nwhat this Other desires which is always somewhat enigmatic, something \nbeyond the subject, and, indeed importantly, beyond the Other themselves \nalso. We have two types of lack then, and a situation in which what is \nessential to the subject - the question of their desire - is continually stretched \nout, moving along this circuit of questioning (“What does the Other want?”, \n“What do I want?”, “Well, what does the Other want?”) that joins two barred \npositions.  \nIt would be a mistake to assume that a kind of balance of lacks exists \nhere. “The relation of the subject to the Other is entirely produced in a process \nof gap” advances Lacan (1979, p. 206). The questioning engagement \nbetween the subject and Other is circular in the sense, as Lacan puts it, of \n“from the subject called to the Other, to the subject of that which he has \nhimself seen appear in the field of the Other, from the Other coming back” (p. \n207). This circularity does not imply a two-way process, it is “circular, but, of \nits nature, without reciprocity. Because it is circular, it is dissymmetrical (1979, \np. 207). \n \nThe ‘Che vuoi?’ formula: alienation in the Other \nThe continual movement of such a circuit of questioning and undecided \nanswers – what we might liken to a transaction of desire – is not limited to \nchildhood. This pattern of questioning, this metonymic movement across an \nendless chain of signifiers, is characteristic of human desire as such. Desire is \nalways caught up in a series of appeals to the Other, that is, to that hovering \ninterlocutor to whom all of my social actions and meanings are inevitably \naddressed, that principle of intelligibility that makes social meaning and \ncommunicative inter-subjectivity possible.  \n 5\nIt is not difficult to improvise a set of variations on this “Che vuoi?” \n(“What do you want?”) repetitively posed entreaty to the Other: “What am I to \nyou?”, “What must I be?”, or in the melodrama of a lover’s quarrel “What do \nyou want from me?”. This attempt of the subject to locate themselves relative \nto the question of the Other’s desire is destined to constant failure. If it might \nbe said to succeed at all, this success is at best momentary, a flickering event \nwhich is quickly tipped over into doubt. We are left with a picture of the \nperpetual motion-machine of desire as it operates in the human subject: an \nincessant querying of the Other’s desire; the assumption of a hypothetical \nanswer gleaned from their gestures and actions; a gradual wearing thin of this \nhypothesis as inadequate; and then, once again: a renewed querying of the \nOther’s desire…  \nThere is something hysterical in this line of questioning – in this ‘Che \nvuoi?’ formula, which, as Žižek (1989) insists, occurs everywhere within the \npolitical domain - inasmuch as no solicited answer will ever be adequate. We \nare dealing with a bottomless succession of questions; to every answer given \n(“This is what you are…”, “This is what is demanded of you”, “This is what I \nwant…”) there is inevitable riposte: “But why?”, “What lies behind what you \nhave told me?”, “What is the real reasons you have said this?” Lacan \ndescribes this incessant questioning as it occurs in the ‘why?’ of the child, \nrelating it both to the structural incompleteness of discourse and to the child’s \npreoccupation with what their role is, their importance, their place in the \nscheme of things: \nA lack is encountered by the subject in the Other, in the very \nintimation that the Other makes to him by his discourse. In the \nintervals of the discourse of the Other, there emerges in the \nexperience of the child something…namely, He is saying this to \nme, but what does he want? ...The desire of the Other is \napprehended by the subject…in the lacks of the discourse of the \nOther, and all the child’s whys reveal not so much an avidity for the \nreason of things, as a testing of the adult, a Why are you telling me \nthis? ever-resuscitated from its base, which is the enigma of the \nadult’s desire (1979, p. 214). \n 6\nThis situation is thus more complicated than it may have at first appeared: not \nonly is the question of my desire impossibly entangled in the Other, so is the \nissue of my social being, of my status, my purpose, my location, of what I am \nto others. The desire of the Other – that, in other words, of the trans-\nsubjective symbolic order – is crucial to any attempt to form an identity within \nmy given community, within the socio-historical and discursive co-ordinates \nwithin which I find myself.  \nTo recap: we have introduced the notion of a ‘structure’ of questioning \nthat is the necessary outcome of a fundamental ‘lack of fit’ – a result of the \nfact that our own desire remains unfixable, brought into being by and tethered \nto the desire of an Other we can never fully know. We have outlined also the \nrelated dilemma according to which we are never wholly accommodated \nwithin our socio-symbolic positions. To appreciate this dilemma is to \nunderstand the pattern of constant recourse to an Other who is thought not \nonly to hold an answer crucial to my being (the answer of desire, of “What do I \nwant?”) but to provide the very co-ordinates of my identity (of what I am, and \nwhy). Once we realize that the linked questions of desire (“What do I want?”) \nand of social location (“What makes sense of the position I occupy in \nsociety?”) are really unanswerable – for they always rebound in the form of \nanother question – then we start to understand the futility of such recourse to \nthe Other, at least within the realm of the signifier, and the alienation of the \nsubject that inevitably results. \n \nSeparation: An overlapping of lacks \nThe notion of alienation within Lacan is often associated, as a matter of \ncourse, with the mirror-phase and the Imaginary, the domain of image and \nidentification. What should be clear from the above line of discussion is that to \nthis mode of alienation we need add another: the alienation of the subject \nwithin the realm of the signifier. As Jacqueline Rose (1996) puts it, the subject \nfirst identifies with the signifier (in the misrecognitions of the mirror stage) and \nthen is determined by the signifier (in the attempt to express and formulate \ntheir desire within the symbolic). The latter is something Lacan never tires of \naffirming. In Seminar XI he declares: “The Other is the locus in which is \nsituated the chain of the signifier that governs whatever may be made…of the \n 7\nsubject” (1979, p. 203). Not only must we appreciate “the constitution of the \nsubject in the field of the Other”, we must understand that “the characteristic \nof this subject of the unconscious is that of being, beneath the signifier that \ndevelops its networks, its chains and its history, at an indeterminate place” (p. \n208).  It is perhaps necessary to provide a brief précis of the alienation in the \nsignifier that Lacan has in mind here, an outline of the fact that in submitting to \nthe Other, the subject assumes the ‘out of jointness’, the divided existence, of \nsubservience to the signifier. \n This mode of alienation is famously described by Lacan in Seminar XI \nas a vel, an either\/or forced choice, like the highway man’s “money or your \nlife”. The vel of alienation, more specifically, presents the subject with the \n‘non-choice’ of being (an existence outside the domain of the signifier) and \nmeaning (existence within the jurisdiction of the signifier and the Other). I say \n‘non-choice’, because to chose being is to fall into non-meaning, which is an \neffective inexistence. Then again – and this is the pertinence of the highway \nman’s threat - to chose meaning is to be “eclipsed by the disappearance of \nbeing, induced by the…function of the signifier” (Lacan, 1979, p. 211), another \nform of inexistence.   \nAs inescapable as alienation appears to be, it does not account for the \nentirety of the subject’s relation to the Other. This relation is also one \ncharacterized by separation. This is regarded as one of the key achievements \nof Seminar XI, Lacan’s theorization of this twin relationship: \nAlienation and separation are linked…they install the subject in a \nnever ending pulsating process of appearing and disappearing. \nAlienation takes the subject away from being, in the direction of the \nOther. Separation is the opposite process, inasmuch as it redirects \nthe subject towards its being, thus opening a possibility of escape \nfrom all-determining alienation, and even a possibility of choice, \nalbeit a precarious one (Verhaeghe, 1999, p. 180).  \nMladen Dolar (1988) is equally helpful here: if alienation excludes the \nchoice of being and the loss of subjectivity – alienation, to reiterate, as a result \nof the operation of the signifier, in the field of the Other – then the process of \nseparation seems to force the subject “to assume precisely that which was \nexcluded: to present itself as the object of the desire of the Other, an object to \n 8\nfill its lack” (p. 24). 1 If the Other were no more than a closed structure, then \nthe subject’s destiny would be one of inescapable alienation. Hence the \nimportance of Lacan’s theorization of separation - or ‘dis-alienation’ as it is \nsometimes understood – as a counterpoint to the alienation in language. This \nis crucial inasmuch as the subject, and indeed, subjectivity within Lacanian \ntheory is not simply the determined result of structure. In this respect we may \nrefer back to the infant-relationship: there must here be some possibility of \ndifferentiation from the mother, a strict identity cannot be maintained between \nmother’s and child’s desire, a gap or sorts must open. As I have implied \nabove, there is a point of realization in which the subject grasps that the \nOther, like themselves, is also missing something, is also characterized by a \n‘not having’, a lack. The moment of respite represented by separation \nprovides the subject a window of sorts “it enables him to avoid total alienation \nin the signifier not by filling out his lack but by allowing him to identify himself, \nhis own lack, with the lack in the Other (Žižek, 1989, p. 122). \nThis means then that there are two dimensions to the Other. This is \nimperative if one is to see beyond the seeming inevitability of alienation: the \nOther is not only the treasury of signifiers, it is also lacking, a site \ncharacterized by a certain desire. It is this other function of the Other that \nmakes separation possible. Soler (1995) makes this very clear: in separation \nwe are dealing with “another aspect of the Other, not the Other full of \nsignifiers [evident in alienation] but…the Other in which something is lacking” \n(p. 49). Homer (2005) extends this idea, emphasizing that separation is linked \nto desire, that it designates the process through which the child differentiates \nitself from the m(O)ther and is hence not simply a subject of language. \nSeparation, he notes, “takes place in the domain of desire and requires from \nthe subject a certain ‘want to be’”, this is a ‘want to be’ which, crucially, is \n“separate from the signifying chain” (p. 72). \nA fundamental facet of separation is a coincidence of lacks, and \nfurthermore – again a sense of circularity, the evocation of a one-way \nrepeated transaction between subject and Other – the fact that the subject \nattempts to offer an answer to the lack of the Other, responding to it with his \nor her own lack. The desire of the Other, notes Dolar, presents a question – \n“What does he want?” – a question inevitably  \n 9\ncountered by another question – do I possess what he wants? \nWhat is it in me that could possibly satisfy this desire? So the \nsubject is ultimately put in a position of offering not only what s\/he \nhas, but essentially what s\/he doesn’t possess – and this is \nprecisely Lacan’s definition of love…“to give what one doesn’t \nhave” (1998, p. 24). \nThis transaction between subject and Other, this loving response of the \nsubject in a circular non-reciprocal pattern of questioning, is well rendered by \nVerhaeghe. He reiterates that the inconsistency of the Other “is answered by \na presentation of the lack at the anterior level”, namely that of the subject’s \nown disappearance, “[h]ence the non-reciprocity and dissymmetry, by which \nthe process topples over into the direction of alienation again (1999, p. 181). \nWe have thus a useful corrective to the idea that separation simply \ntranscends, overcomes the everyday dialectics of alienation. Equally evident \nhere is an emphasis on the fleeting nature of this moment, of the void which \nopens up between subject and Object, thus allowing the possibility of an \nescape from the determinism of the signifying chain, even despite the fact that \nit typically collapses back into a state of alienation. In contradistinction then to \nthe ‘this or that’ forced-choice between meaning and being in alienation, the \noperation of separation is presented as a neither\/nor. So, by contrast to the \nprocess of alienation, the neither\/nor of separation does give rise to a viable \nform of being, although this being is of a profoundly transient and elusive sort, \nas implied in Fink’s (1995)  descriptions of the Lacanian subject as pulse-like \nmovement, a momentary flash between being and meaning. \n \nThe radical problem of desire \nSomething is enabled in the opening of this rift, a fact implied by Lacan’s \ntoying with the term for separation (se parere), which, again drawing on \nVerhaeghe (1999), means at once to defend, to dress, to engender oneself. \nWhat emerges from this neither\/nor situation of separation where both subject \nand Other are eclipsed (neither being able to claim that they “have it”) is the \nobject of fantasy, the object-cause of desire, the Lacanian objet petit a.  Objet \na for Fink (1995) is the remainder of the hypothetical mother-child (subject-\nOther) unity, the last trace and reminder of this posited overlap of desires: \n 10\nBy cleaving to this rem(a)inder, the split subject, though expulsed \nfrom the Other, can sustain the illusion of wholeness; by clinging to \n[objet a], the subject is able to ignore his or her division (p. 59). \nNot only his or her division, we might add, but that of the social order itself; \nobjet a is the reparative object, posited by the subject, as a means of \nresponding to both such lacks. In more basic terms: this object of fantasy, this \nobject-cause of desire, is generated in response to the double lack of subject \nand Other. It is the result of the subject’s attempt to retrieve a scrap of an \nillusory subject-Other wholeness; this objet a, forever fascinating, arousing, \nwill sustain the subject in being, as a being of desire.  \nWith the objet a we are dealing with what Žižek (2000) terms the \nsubject’s ‘objectal counterpart’ that is put to work as means of covering the \nlack in the Other. Its paradoxical status is thus already clear: it belongs wholly \nneither to the subject or the Other. It is, as we might put it, the convexity of the \nsubject’s lack, but given that it functions to paper-over the Other’s lack – and \nso to fantasmatically restore them - it may equally be said to be the convexity \nof the Other’s lack, that which grants it a degree of consistency, lends it a \nsemblance of wholeness, integration. We may provide a further gloss on this \nprocess of separation, on the outcome of this coincidence of two lacks, which \nas Dolar (1998) insists – and here it is worth quoting him at length - \nproduces something:…the object of desire, which appears \nprecisely where the two lacks coincide – the lack of the subject and \nthe lack of the Other. There is an object involved on both sides, \nfiguring as a pivotal point of fantasy – the object “within the subject” \nthat one tries to present in order to fill the lack in the Other, to deal \nwith its desire; and on the other hand, the object “within the Other,” \nits surmised surplus, the source of its unfathomable jouissance, the \nsecret clue as to what makes the Other enjoy and that one wants to \npartake of. Ultimately, what makes the Other the Other, what \nmakes it unfathomable, is what appears in its lack, an object \nheterogeneous to signification, irreducible to signifiers, which poses \nthe radical problem of desire. What the Other lacks now is not just \na signifier…[but] the object. The surplus pairs with the lack, the \ncoincidence of two lacks, and this is the way in which the subject, \n 11\nhaving lost its being in alienation, nevertheless partakes of it in \nseparation – through the elusive surplus object one can never get \nhold of (p. 25). \nIn review then, we have been introduced to an impossible object, one which \nwe may locate at the coincidence of two lacks, an object whose location \nprovides us with the pivotal co-ordinates of fantasy. This is not just the case of \n‘a structure of questioning’, a dissymmetrical circuit between two lacks within \nwhich the vital question of desire is rebounded off an ultimately inconsistent, \ninadequate Other. There is also a return-effect of this questioning, objet a, \nwhich, when posed in the form of fantasy, holds the promise both of the desire \nof the Other and of the completeness of the subject. This impossible object is \nassumed to hold the key, the answer to the question of subject’s place within \nthe social order, and the solution to what would harmonize this social order. It \nis for this reasons that we may think of this non-reciprocal circuit of desire - \nthis particular type of questioning and its posited fantasy-object outcome – as \na fantasmatic transaction. 2 \n \nApartheid and desire \nWe can now take up the issue of apartheid ideology, something I propose to \ndo via an engagement with J.M. Coetzee’s undervalued paper, ‘The mind of \napartheid’ (1991). I will evoke what I take to be the key moments in Coetzee’s \ntext, intervening within his central argument so as to make the case for the \nnecessity of Lacanian psychoanalysis as a mode of critique without which we \ncannot hope to adequately understand the ambiguities and paradoxes of \napartheid ideology. \nCoetzee begins by distancing himself from a commonplace of apartheid \nhistoriography - the notion that apartheid can be understood as a rational (if \nnot extreme) response to various threats to white privilege. He takes a far \nriskier strategy, posing instead the question of the madness underpinning the \ngovernmental rationality of apartheid. “If madness has a place in life” he \ninsists, “it has a place in history too” (1991, p. 2). The challenge thus posed is \nthat of understanding the hold of mad political systems, and more than this, of \nconceptualizing the complex and ambiguous agency of subjects and \nideologues within such historical periods of madness. \n 12\nThe method that Coetzee adopts as a means of pursuing these \nquestions is literary: a painstakingly close reading of the sociology of \nsegregation and separatism devised by a single apartheid ideologue, Geoffrey \nCronjé. In what seems an uncharacteristic moment, Coetzee makes \nreference, at the beginning of his essay, to a Freudian diagnostic system, \nlabelling Cronjé, “technically” an obsessive.  This is one of two psychoanalytic \nmotifs that are immediately present in Coetzee’s analysis of Cronjé’s writings: \ndesire and obsessiveness. This desire is not of an obvious sort; it is a form of \ndesire that is enacted in relations of repudiation and avoidance, it is made \napparent in Cronjé’s very “inability to face the desire of black for white or white \nfor black”; it “manifests itself in motions of evasion…revulsion and denial” \n(Coetzee, p. 11). Cronjé’s obsessiveness is more immediately evident, a \ncompulsive concern with the perils of mixture, racial blood-mixing (rasse-\nmengelmoes) punctuate his texts. Coetzee runs these two themes together: \nWhat Cronjé…repudiates at every turn, is a desire for mixture. \nAround mixture his mind obsessively turns...mixture in its endlessly \nattractive and endlessly repulsive allure… It is mixture and the \ndesire for mixture that is the secret enemy of apartheid…the \nbaffling force that must be thwarted, imprisoned, shut away (1991, \np. 3). \nCronjé’s own analyses never of course address the issue of the unconscious \ndesire underlying the production of apartheid ideology. He does however raise \nthe question of desire, albeit in an odd sort of way: the question he asks of \nmany whites is why there is not a more forceful desire to separate one’s self \nfrom other races. In other words, he questions the very lack of \n‘apartheidsgevoel’, the absence, in other words, of what he takes to be a \n‘natural’ tendency to segregation within ‘die Afrikanervolk’ (the values and \nhistory of his cherished white Afrikaaner community). His question thus takes \nthe defended form of a double negative, ‘why not the desire not to?’ In \nmoments such as this – here Coetzee’s method has something in common \nwith that of the analyst - Cronjé’s texts open up into the reverse of their \nintended meaning, implying, beyond Cronjé’s intention, that there exists in fact \nnone of the instinctual impulse toward racial segregation that he wishes to \nfind. The same seems true of his incessant declaration that as the distance \n 13\nbetween whites and non-whites diminishes, so “unconsciously a gradual \nprocess of feeling equal…begins to take place” (cited in Coetzee, p. 11). Such \na statement, as Coetzee points out, can quite easily be read as an argument \nthat interracial tensions can be reduced by social mixing. \nAnother apparent absence of desire that Cronjé questions is the void \nhe takes to exist at the place where Afrikaner man might desire the black \nwoman. This is a lack in which Coetzee reads the force of a particular \npresence, and a particular defensiveness: “the true force here” he remarks “is \ndesire, and its counterforce, the denial of desire” (1991, p. 14). Desire may \nalso be said to lie at the heart of the problem that apartheid endeavours to \nsolve, namely the need voiced by Cronjé to separate “the white man from the \ndaily view of the black man”, to thus “ensure that an essentially unattainable \nwhite culture and lifestyle do not become the object of his envious desire” \n(Coetzee, p. 15). Coetzee rephrases Cronjé’s rationale here, interjecting his \nown contrary suspicions: such segregation will “remove the black man (the \nblack woman?) from the view of the white man and thus ensure that he (she?) \ndoes not become the object of white desire” (p. 15). \nThe challenge of apartheid governance for Coetzee then is less the \ncontrol of dissent than the control of desire. Cronjé’s version of apartheid \ndevelops precisely as a counterattack upon desire. Coetzee is quick to add \nthe necessary proviso: one should not ignore apartheid’s origins in greed, just \nas one should not elide the complexities of a multifaceted structural history of \noppression. Nonetheless: \nthe text of apartheid deserves to have restored to it that chapter \nthat has been all too smoothly glossed over…removed: a denial \nand a displacement and retrojection of desire re-enacted in further \nhuge displaced projects of displacements: the redrawing of the \nmaps of cities, the re-division of the countryside, the removal and \nresettling of populations (1991, p. 18). \n \nPhantom agency  \nContent that he has made the case for desire in the genealogy of apartheid \nracism, Coetzee turns his attention to what he takes to be a major \nshortcoming of standard apartheid historiography. One of the problems in how \n 14\napartheid has been committed to history, he insists, lies with the active and \nconscious role that many historians have accorded to those subjects who \nwere apartheid’s beneficiaries. This is not simply to make the point that \napartheid’s beneficiaries were also subjects of the unconscious whose \ninvolvement in its ideology, and whose rewards for participation therein, often \nexceeded conscious registration. It is also to make a point about the evident \ninadequacy of many historical theorizations of agency. For Coetzee, there is \nsomething insufficient about how agency is construed in traditional accounts \nof apartheid-as-ideology: \nIf the ideologist as [conscious] subject writing the text of ideology is \none commonplace, the man in the street as the object upon whom \nthe text is written, the one made ready to be written on by his \nsubjection to fears and prejudices that sweep over communities \nlike infections, is another (Coetzee, 1991, p. 28). \nHere we may link Coetzee’s analysis to that of a variety of postcolonial \ntheorists – of whom Homi Bhabha (2004) is perhaps the best-known example \n- who have long taken issue with such clear-cut categories of powerful agent \nand acted upon subject. Questions of the authorship of apartheid ideology - \nmuch like questions of the authorship of fantasy - would seem to require a \ndifferent elaboration of agency to that which Coetzee finds in Structuralist \napproaches to ideology. The analysis of ideology, he argues, aims at \ndeciphering, unmasking. “But who did the original ciphering, the original \nmasking?” Indeed: \nDoes ideology cipher itself, mask itself, unconsciously, or…is \nideology the creation of a group of people…who appropriate more \nor less inchoate popular notions, put them together in a pseudo-\nsystem, flesh them out with the appropriate rhetoric, and use them \nto further [their] interests? (p. 28) \nFurthermore, is apartheid ideology a “free-floating, parasitic idea-system \nrunning the minds of its hosts” (p. 30), or is it an idea-system that has been \nconsciously constructed, carefully crafted, devised and constantly \nreformulated by apartheid intellectuals? How then might we understand the \nbridging of social and individual realms of ideology, and, furthermore, which of \nthese poles should we treat as the pre-eminent or causative category? A \n 15\nseries of inter-related problems come to the fore at this point, two of which are \nparticularly deserving of systematic treatment. Firstly, the question of the \nprimary authorship of apartheid ideology and the associated issue of the \nextraordinary type of authority, indeed, the ‘supra-agency’, that would have to \nunderwrite this authorship. Already we may perceive a hint of what Lacan’s \nformulations can offer us in this respect, especially in view of the supra-\nagency of the Other as historical social substance. This is an agency that \nexists a level above that of everyday individual subjects and that plays the \npart of coordinating their everyday ideological interactions and presumptions.  \nThis seems to lead us in the direction, questionable at best, of an apparently \nagent-less agency, of an ideological authorship beyond the level of subjects. \nSecondly, the issue that seems to most vex Coetzee: the problem of \nthe ostensibly “extra-ideological” position that the authors of apartheid \npresumably occupy in the process of scripting apartheid ideology. Rather than \nquerying a level of agency above that of the subject – i.e. the big Other as \nhistorical process - we are concerned here with the idea of ideologues able to \nrise above the everyday order of ideological discourse and tinker with its \nconstructions.  To clarify: I mean here to signal the awareness on the part of \nsuch ideologues of their role in the ongoing construction of ideology, in the \nscripting of ideological notions. This seems, on the one hand indisputable. Is \nsuch an “extra-ideological” position not presumed in the very task of \nfashioning propaganda? Does such a charge not require that one maintain a \nminimal degree of reflexive distance from one’s own discursive productions? \n(There is an interesting implication here: if such subjects are responding to \nthe Other’s delegation to produce a systematic ideological representation, \nthen surely the greatest truth of this system is its own apparent untruth, the \nfact of its very need for ideologization?). However, as a Žižekian critique of \nsuch a proclaimed “non-ideological” position would quickly point out, an \nimagined “stepping outside of ideology” is ideology at its most efficient. The \nimplication is thus that such authors are themselves caught up in the spell of \nthe ideology that they are conjuring. \nThese comments make apparent the degree of complexity that will be \nrequired in addressing questions of ideological agency and authorship, \nespecially so, one might add, in situations where subject and Other are not \n 16\nclearly delimited, where a fundamental ambiguity, or apparent overlap, \ncharacterizes their relationship. Importantly, this state of affairs, the fact of \nsuch oscillations of agency, the ‘taking of turns’ between subject and Other, \nindicates the need to consider the role of the unconscious, the unconscious \nunderstood in the Lacanian sense of the subjective locus of the Other. This \nlies at the forefront of what a Lacanian perspective brings to these dilemmas \nof ideology: an appreciation of the implication of subject in Other, and of Other \nin subject, an awareness of the inter-implication of the trans-subjective socio-\nhistorical substance and unconscious subjectivity. Coetzee’s critique of \napartheid historiography sounds more Lacanian by the moment: not only must \ndesire be factored into historical analyses of apartheid, so must the issue of \nthe subject-Other relationship, an unconscious relationship which involves the \nsubject’s (transferential) positing of what it is the Other wants. \nWhat is called for then is an account able to understand how subjects \nare active as agents in an authorial ideological process which nonetheless at \ntimes over-rides them. This switching back between moments when the \nsubject is spoken by the Other and when they voice their own fantasmatic \nobjectives that nevertheless remain conditioned by the Other’s presumed \ndesire (as in Cronjé’s own idiosyncratic apartheid visions), suggests that we \nare not far removed from the processes of alienation and separation. There is \nhere something which resembles the circuit of questioning discussed above, \nnamely the relentless (‘Che vuoi?’) recourse to what the Other wants as \nmeans of deciding issues of desire and of the order of an ideal, harmonious \nsociety. Lacan’s concepts give us a degree of subtlety in how we go about \nunderstanding this to and fro movement where alienation in the Other gives \nway to a kind of momentary separation (firstly), and the associated \nemergence of fantasmatic objects and projects that in turn collapses back into \nalienation (secondly).  \n \nIs the big Other racist? \nThe predictable poststructuralist riposte to this situation of “stepping outside of \nideology” is that we have overstated the agency of the ideologue, of the \nauthor. This entanglement of types of agency (subject and Other) has, \nseemingly, resulted from just such an error. We should start our analysis – \n 17\nfollowing this line of critique - with neither the intention of the author nor with \nthe assumption that they are able to transcend the discursive systems of \nwhich they are a part.  At this point however another question emerges which \nthreatens the ascendancy of accounts which stress the de-subjectified and \ndetermining role of societal structure, institutions, discourse and so on. Are we \ndealing with a self-perpetuating system that proliferates simply for the purpose \nof extending itself, a case of a discourse whose predominant goal, to quote \nEdward Said is \"to maintain itself…to manufacture its material continually\" \n(1983, p. 216)? Is this what we need to apprehend, the equivalent of an \nideological virus, a parasite that attaches itself to a society of subjects, certain \nof whom, for a limited time, act as its privileged points of articulation?  \nThis is not an idea that can be simply dismissed: the combined \nmomentum of historical, institutional and material relations of force certainly \nmakes for a significant consideration in understanding the longevity of \nideology. Nevertheless, such a phantom agency seems curiously devoid of \nhuman passions. The risk taken in pursuing such a line of analysis is that the \nfactors of desire, irrationality and enjoyment are elided within accounts of \nhistorical change. Removing passionate human subjects from the equation \nleads us to ask a naïve question: why would the Other – in and of itself – \ncontinue to insist on racist ideology?  \nThere is another problem with collapsing accountability into the \ncategory of the Other, one which will help us identify a potential misapplication \nof Lacanian theory. Mobilizing the notion of the Other of apartheid most \ncertainly does not allow us to summarily conclude that the big Other is \nresponsible for setting in motion the machinery of apartheid, true as it may \nhave been that the historical trans-subjective order of white, colonial, pre-\napartheid South Africa was indeed racist. Here, as elsewhere, it is imperative \nto reiterate that the Other retains the transferential status of presumption. As \nŽižek (1996) reminds us, the Other is posited, ‘virtualized’ by subjects \nprecisely as a means of making sense of an opaque set of social relations; it \nis an operational hypothesis which enables the communicative and ideological \ncoherence of a world they co-inhabit. Clearly then the Other cannot be made \nthe patsy for apartheid, just as it cannot be fully divorced from the subjects \nwho transmit and duplicate its values, subjects who remain thoroughly \n 18\nimplicated in the ideological universe thus extended. To reiterate the fact of \nthe unconscious dimension touched on above: we are not dealing with the big \nOther as simply the objective factuality of the trans-subjective social structure. \nInsofar as we factor the unconscious into our analyses we are concerned also \nwith the subjective locus of the Other. In applying the Other as an analytical \ntool we cannot separate it out from the realm of the subject-Other relationship, \nwhich is of course inclusive of the associated processes of alienation and \nseparation.  \nTo be sure then: the Other is reducible neither to the intra-personal nor \nto the societal; it is a function neither simply of the ‘internal’ nor the ‘external’, \nit is, by contrast, the mediator between these two aspects. My point is clear \nenough: the Other provides no trump-card in claims of non-accountability for \nracism, even though it certainly does add a new level of sophistication to \nquestions of ideological agency as an analytical category that resists \nreduction to either the psychical or the structural. What this means then is that \nwe can concede a type of supra-agency (the trans-subjectivity of historical, \nstructural, societal conditions) as a paramount consideration - one which at \ntimes certainly does over-run or ’determine’ certain utterances\/actions of the \nsubject - without accepting that it wholly exhausts their subjectivity. It is \nprecisely in view of this latter consideration that the crucial distinction between \nalienation and separation comes into play. \nTwo further clarifications need to be made here as a means of \nexpanding our understanding of the role of fantasy and desire, and indeed, of \naccountability and subjectivization, in the subject-Other relation. The first \ninvolves the introduction of a new analytical concept, the notion of enjoyment, \nthat is, the affective intensity of the illicit libidinal gratification of jouissance. \nSuch ‘subterranean’ modes of pleasure-pain elude the grasp of language; \nthey cannot be easily factored into everyday categories of pleasure. However, \ndespite this elusiveness, the subject for psychoanalysis remains \nfundamentally accountable for their jouissance. Now, to be sure, the \ntheorization of alienation discussed above makes it clear that the subject is \nfrequently ‘over-written’, determined by the symbolic structure such that their \nevery attempt at speaking remains radically contingent on the expressive \ntools, the signifiers of their given discursive and historical ‘grounds of \n 19\nspeaking’. Nevertheless - and here we have a clinical pragmatic insisted upon \nalready by Freud - the subject remains utterly responsible for their jouissance. \nZupančič (2000) makes a useful adjoining point: despite Lacan’s ‘de-\npsychologizing of the subject’, that is, his repeated emphasis on the alienation \nof the signifier, he nevertheless insists on an irreducible element of jouissance \nas the ‘proof of the subject’s existence’. What this means then, returning to \nthe concerns of our above discussion, is that the subjects in question remain \naccountable for each element of transgressive enjoyment they experience, be \nit by means of the ‘pleasures’ of racism or by means of the narcissistic \n“superiority” of exclusionary Afrikanervolk identifications. (Interestingly, \nCronjé’s very use of the term ‘apartheidsgevoel’ (apartheid-feeling) appears to \nbetray this fact, that the longevity of apartheid required not just a set of \nobvious libidinal investments, but a certain operation of jouissance, a \nparticular ordering of enjoyment).  \nA second important clarification to the argument offered thus far \nconcerns the difference between the desire of the Other and the ‘individuated’ \nstatus of the subject’s fantasy. This is a distinction which returns us to the \nearlier differentiation between the alienated reproduction of signifiers within \nthe field of the Other (firstly), and the fantasy-productions enabled by \nseparation and supported by given modes of jouissance (secondly). We are, \nin other words, returned to the dissymmetrical circuit of questioning that I have \nelaborated above as a fantasmatic transaction. Important to grasp here is the \nfact that Fantasy is a means of response, the return-effect produced within \nthis circuit by the subject as a means of dealing with the enigma of the Other’s \ndesire.  This is the paradoxical aspect of fantasy that psychoanalysis helps us \nunderstand: fantasy is both that which lies at the very core of our subjectivity – \nit is that which more than anything else constitutes what is irreducible about \nus - despite that it cannot ever be fully separated from the field of the Other. \nHow do we make sense of this paradox? By making it clear that fantasy is \nthus both in a sense autonomous – it is the invention of the subject, their \nunconscious response to the enigma of the Other’s desire – and yet it is \nnevertheless contingent on the Other inasmuch as it is a kind of working \nhypothesis – and a libidinally-loaded one at that, charged with certain modes \nand promises of jouissance - to the question of the Other’s desire. In short, \n 20\nfantasy does not emerge outside of the parameters of this deadlock of the \nOther’s desire, it is always an answer, a fantasmatic solution, to precisely this \nlack; as such fantasy remains dependent on the Other. At the same time, \nfantasy can never be reduced to the Other, it is of the subject; the Other does \nnot generate fantasies, as Salecl (1998) notes, any more than it enjoys, \npartakes of jouissance. \nThis is the importance of the above two clarifications: both the \naccountability of jouissance and fact of fantasy as invention of the subject \ndemonstrate that the subject does attain a degree, no matter how fleeting or \ntransient, of subjective ‘individuation’ (or, more appropriately, separation).  \nFurther evidence then that racism cannot be the sole preserve of the Other, \nthat it must, by contrast, be viewed as a negotiated transaction of desire \nbetween the subject and the Other.  \n \nThe rewards of fantasy \nMy argument thus far has been to suggest that it is with recourse to the \ncomplexities of the subject-Other relationship described above that we may \nbetter understand certain of the ambiguities and paradoxes of ideological \nagency in apartheid. The twin processes of alienation and separation appear \nto offer an answer to whether ideologues are able to stand outside the frame \nof their ideological world. The answer, it would seem, is both ‘yes’ and ‘no’. \n‘No’ inasmuch as such subjects are thoroughly alienated in the Other whose \nsocio-symbolic and historical substance they play their part in extending. ‘Yes’ \ninasmuch as separation allows them a degree of suspension from alienation, \neven if their individual fantasies are nonetheless fashioned as responses to \nthe Other’s desire, and done so within the parameters of certain fundamental \nquestions (“What is it that the Other lacks?, “How might I repair this lack?”, \n“What is my role and function here?”, “What is missing in my society, how \nmight it be restored, made complete?”) \nI wish now to turn to a third set of questions raised by Coetzee in his \ninterrogation of apartheid historiography, that is, to the central issue of what, \naside from the imperatives of Capital, propelled the ideological system of \napartheid for so long? Given that apartheid occurred in the direction of certain \ninterests, not all of which should be seen as material or even rational, then \n 21\nwhat was the nature of its less than tangible, less than rational rewards? The \nidentity of apartheid’s beneficiaries seems clear-cut enough: all aspects of \nwhite South African society profited from apartheid. This much would appear \nbeyond contention, although one should add the obvious qualification: the \ntransactions of reward involved were not only conscious, but also, crucially, \nunconscious in nature. What Coetzee intimates is that we may need take \naccount of a set of intangible rewards, types of interest – or, as we might add, \nmodes of enjoyment - that not only eclipse the terms of clear-cut financial or \nsymbolic gain, but that entirely exceed everyday categories of benefit. \nUp until this point we have pin-pointed three inadequacies in standard \napartheid historiography: the absence of an analytics of desire; the omission \nof any adequate discussion of the unconscious dimension of the subject-\nOther relation; and the neglect of the factor of certain non-material rewards. \nThere is however one further issue that needs to be taken into account before \nturning our attention to an understanding of the evasive and intangible \nrewards underlying the intransigence of apartheid ideology. What we have \nbeen confronted with is not only a series of paradoxes of ideological agency \nwithin the context of a mad political system, we have also the challenge of \nexplaining the particular obduracy of ‘race’ within this and similar systems. \nPart of our task is to understand this potent category of division, this Master-\nsignifier, whose force is not adequately apprehended as a discursive artifact, \na signifying construction. \nObviously, there are - and have been - many ways one might go about \ntracing the discursive deployment of ‘race’ as a constructed notion. A great \nvariety of historical trajectories can be offered as means of tracking the use \nand growth of this notion as a particularly virulent signifier within the confines \nof colonial power. It seems to me however, by virtue of the ‘constructedness’ \nof race in such explanations, that one is obliged to go further, and to offer an \naccount of something else, at a different ontological level, of what brings \nabout or necessitates this construction in the first place. The ‘constructedness’ \nof race, in other words, should not represent the limit of our critical horizons, \nnor should it be the lesson we continually re-articulate. Another analytical \npriority thus takes precedence, one that can be expressed as a question: what \n 22\nunderlying process gives race its particular density and inescapability in the \ncolonial sphere?  \nImplicit in these comments is a charge against the notion that ‘race’ \ncan simply and summarily be deconstructed, ‘re-signified’. Equally evident is \nmy sense of dissatisfaction with the idea that critical analysis is served merely \nby linking ‘race’ to ever more constructions within a broadening textual field.  \nThere is an obvious point to be made here about the limits of the socially-\nconstructed world, about those analytical approaches which restrict their \ncritique to such explanatory presumptions, and, indeed, about the role of \npsychoanalytic explanation in extending such an order of explanation. What is \nbeing neglected in such historicist-discursive accounts is the fact that race is \nbound up in an economy of fantasmatic values and identifications, in the \npursuit of particular enjoyments and rewards.  \nOne response to the question of what continued to propel the \nideological system of apartheid - aside from the obvious incentives of capital – \nis to be found in the idea of the rewards of ideology itself. The first intuition to \nthis effect that Coetzee (1991) finds in the literature - much of which he finds \nwanting in this respect - is Marks & Trapido’s (1987) speculation regarding the \ngains of certain “ideological rewards”. Coetzee initially treats this answer with \na degree of skepticism; surely the notion of an ideological reward is a \ncontradiction in terms, especially so if ‘reward’ must ultimately be traced back \nto a material incentive of sorts? Do we not risk giving an answer here (of \n“ideological rewards”) that merely restates the subject of the question \n(ideology)? If we consider ideology as a system of representations \nengendered to conceal the inequitable “rewards” of various social \ncontradictions, then surely it is not a reward itself, but precisely a means to \nsuch ends, a means that is to say of assuring and protecting a regime of \nmaterial benefits?  \nIf ideology is not just a means to an end, but is in some ways an end in \nitself, if it engenders its own intrinsic rewards outside the frame of material \ngains, then what might be an example of such an intrinsic ideological reward? \nThe psychical benefits of racist ideology are easy enough to imagine; we \nmight take as a case in point the narcissistic gain implied by the reiteration of \none’s own supposed superiority, the consolidation of an imaginary identity or \n 23\ncommunity. Here we are but a step away from Coetzee’s (1991) insight, \nnamely that such ideological rewards might be said to fulfill certain \nfantasmatic functions. This is the closest Coetzee feels he comes to a \nsatisfying answer regards the non-material rewards of apartheid ideology - \nalthough, regrettably it is one he leaves largely undeveloped – namely the \nnotion of what he terms the “phantasmatic reward” (1991, p. 29). As in the \ncase of apartheid’s preoccupation with racial purity – Marks & Trapido (1987) \ncite the massive importance that apartheid’s legislators accorded to the \nImmorality and Mixed Marriages Acts – such ideological rewards were not \nthose of material benefit but those of a very different type of possession: that \nof a particular fantasmatic identity (in this case, of white racial or ethnic \nAfrikaner purity).  \nThe elaboration and protection of such a fantasmatic possession is \npainfully apparent in Cronjé’s writing, much of which is concerned with the \nshoring-up of the fantasmatic identity of the Afrikaanervolk which he treats as \nfar more precious than any material costs that may be incurred in ensuring its \nprotection. What is equally apparent here is the extent to which such \nfantasmatic properties - or indeed, modes of enjoyment – are typically posed \nalongside equally fantasmatic threats. Cronjé’s sublime object of the \nAfrikaanervolk exists always alongside the perils of racial blood-mixing (rasse-\nmengelmoes). We have thus a confirmation of Žižek’s (1997) assertion that \nany given fantasy is divided between its beatific, stabilizing aspect (the \npromise, say, of absolute white racial purity\/superiority) and its vexing, \nradically destabilizing aspect which forms the basis of a variety of \nexaggerated threats (for Cronjé, the contaminant of blackness, or, \nmetonymically, the danger of infection by black blood). The dynamic interplay \nof these aspects should not be lost on us: the beatific dimension of fantasy \nfunctions to mask a structural impossibility (a pure, independent Afrikaner \ncommunity existing in a state of self-contained harmony), whereas the second \ndimension provides the reason - and typically also a scapegoat - for why such \nan inherent impossibility could not be realized. \nCoetzee goes on to query whether Marks & Trapido (1978), who \nsupplied the notion of the ‘ideological rewards’, might not be read as \nsuggesting that the electorate and the legislators alike of the crucial 1948 \n 24\nelection that ushered in the apartheid state were caught in a “phantasmatic \ntransaction” (1991, p. 29). Unfortunately, he veers off from the intriguing \npsychoanalytic implications such an answer affords, although he does \napprovingly suggest that in this depiction “no rigid line is drawn between the \nconstructors of the ideology, and those who misperceive the world through the \nlens it provides” (1991, p. 29). The postulate of such fantasmatic transactions \nhelps to muddy the notions that apartheid intellectuals were, to paraphrase \nCoetzee, the exclusive and conscious authors of this ideology, that apartheid \nideology was merely the text written by them, and that the man in the street \nwas the object upon which this text was written. We have a threefold \ndisruption thus of who authored apartheid (the active role of ideologues \nunderstood in the light of a circuit of questioning of the Other’s desire), the \nnature of its ideology (which is thus more than merely textual) and the type of \nsubjectification thus involved (fantasmatic subjectivation, that is, the active \nsubjective production of fantasies, not merely subjects as structurally-\ndetermined). Likewise, the idea of fantasmatic transactions, especially once \nlinked to the processes of the subject-Other relation described above, help us \nunderstand how apartheid ideology may have been both the “free-floating, \nparasitic idea-system running the minds of its hosts” (Coetzee, 1991, p. 30) \nand an idea system consciously constructed by apartheid intellectuals. \nThe structure of questioning I have described above involves a circuit \njoining two lacks within which the vital question of desire is posed to an \nenigmatic Other. This questioning, to reiterate, yields a return-effect, a \nresponse on the part of the subject in the form of a sublime object of fantasy \nwhich holds the promise of a kind of harmony or completeness, be it of an \nindividual’s social role, or of the key meaning of an apparent societal impasse. \nWe understand then why the naïve question of causality as to which is the \npre-eminent category, the apparent ‘individual’ or ‘social’ dimensions of \nideology, returns an answer of circularity. What do I mean by this? I mean to \nsay yes, apartheid is a parasitic idea-system that is embodied in the Other, \nthat comes before and over-rides its ideologues (the operation of alienation), \nat least in the sense that fantasy always emerges via a transaction with the \nOther’s presumed desire.  However apartheid is also an idea-system put \ntogether by its ideologues. As in the process of separation, we are dealing \n 25\nwith a fantasmatic response to the enigma of the Other’s desire, which is the \ninvention of the subject, a function of their agency – an agency of fantasy and \njouissance alike – that such subjects remain accountable for. 3 \n \nConclusion \nThe motivating objectives behind this paper are by now, I hope, demonstrably \napparent. I have aimed to add nuance and depth to the notion of a \nfantasmatic transaction, to take the promising start offered by Coetzee and \nlink it to a series of Lacanian postulates. Doing so has opened an interesting \nperspective not only on the tenacious hold of ‘mad’ ideological systems and \non the ties that bind subjects to Others during such historical periods, but also \non the complicated patterns of authorship, agency and causality thus entailed. \nI have tried to show that there remains something irreducibly singular about \nthe final, individualized realization of fantasies despite that they take shape \nwithin apparently formulaic socio-historical parameters. This is crucial in \ngrappling with Cronjé’s writings and his role as ideologue, and a point worth \nreiterating: fantasies are the return-effect resulting from the attempted \nseparation of the subject from the Other, as such they bear the imprint of a \nkind of individuation even while they can never be said to be wholly \nindependent of the Other. So, the fantasies that Coetzee is concerned with \nmay be original, characterized by innovative components, unique \narrangements and contents, without its authors having the ability to stand \ncompletely outside the contextualizing domain of the Other. Generic, \nstereotypical parameters of racist fantasy co-exist here alongside the \nindividualized details and texture of its particularized realization, indeed, \nalongside the distinctive modes of its subjectivized enjoyment in unique \nsubjects. Within this relation, this particularly Lacanian articulation of fantasy \nand desire, we have the germs of an account that can simultaneously contain \na non-reductive subjectivity and – paradoxically – the role of a ‘determining’ \nOther. \nLacanian psychoanalysis provides a series of concepts that may be \nprofitably applied in illuminating the fantasmatic functioning of apartheid \nideology. Many of these concepts I have barely touched on: the enjoyment \n(jouissance) entailed in the pursuit of the sublime object, and the related idea \n 26\nthat the Other requires the constant influx of jouissance of those who \nconstitute it (Žižek, 1992); the role of castration as apparent in the interplay \nbetween stabilizing and destabilizing elements of fantasy (the surplus of what \ncould be relative to what has been taken away); the functioning of a \nprospective master-signifier (S1), (say, ‘Afrikaanervolk’) which positivizes a \nlack, and sets in play an unending chain of signifiers or knowledge (S2), hence \ntransforming an empty place of meaning into a nodal-point of ideology. By \ncontrast, I have opted to focus on a different and less evoked aspect of the \nLacanian account of fantasy, namely the processes of alienation and \nseparation as they occur within the dissymmetric circuit – or transaction – of \nfantasmatic desire. The reasons for this are, I hope, by now evident. For a \nstart, it brings into sharp relief the driving force of desire, and the need to \ntrace desire as a key analytical consideration in the analysis of power. \nSecondly, such an approach places the subject-Other relation centre-stage, \nsomething which enables us not only to flag-up the unconscious dimension of \nideological processes (the unconscious here as “the subjective locus of the \nOther”), but also to throw light on a number of the paradoxes of agency and \ncausality evidenced within the vacillating relation between subject and the \nOther.  \nDiscussion of these processes adds new complexity to a series of \nvexing dilemmas of ideology; it disrupts the constraining categories of acted \nupon subjects, ideology as text, and ideologues as conscious authorial agents \nnot themselves subject to the parasitic hold of the idea-system they play their \npart in constructing. Not only does recourse to the processes of alienation and \nseparation help collapse many of these simplistic distinctions, it also does \ngreater conceptual justice to the inter-implication of Other and subject, that is, \nto the inter-implication of the trans-subjective socio-historical substance and \nunconscious subjectivity.  \nThe Lacanian concepts utilized here make a unique contribution to the \nunderstanding of apartheid racism. The fact that a fantasmatic transaction of \nsorts may underlie the workings of racist ideology is here absolutely crucial, \nthe idea, in other words, of the unconscious subject-Other relationship, and of \nfantasy as the form of mediation that joins (or overlaps) these two positions of \nlack. This lies at the heart of the originality of the Lacanian contribution: the \n 27\nnotion that this mediation of lacks is made manageable, ‘domesticated’ by the \nprovision of objet a and an according fantasy-frame. These two issues, the \npotent ideological question of what the trans-subjective socio-historical \nsubstance wants and the vehicle of fantasy which provides a variety of \nresponses to this question of desire, prove absolutely imperative in \nunderstanding the many paradoxes underlying the historical insistence of \napartheid racism. More succinctly put, these factors are of paramount \nimportance if we are to grasp the peculiar economy of fantasy as it functions \nwithin racist ideology, in the ‘mind of apartheid’.   \n \nReferences \nBhabha, H. (2004). The location of culture. London: Routledge. \nCoetzee, J.M. (1991). The mind of apartheid: Geoffrey Cronjé. Social \nDynamics, 17: 1-35.  \nDolar, M. (1998). Cogito as the Subject of the Unconscious. In S. Žižek (Ed.) \nCogito and the Unconscious, pp. 11-40. Duke University Press: \nDurham NC & London. \nFink, B. (1995). The Lacanian subject between language and jouissance. \nPrinceton: Princeton University Press.  \nHomer, S. (2005). Jacques Lacan. London & New York: Routledge.  \nLacan, J. (1979). The four fundamental concepts of psychoanalysis, (Ed.) J.A. \nMiller. London: Hogarth Press\/Penguin. \nMarks, S. & Trapido, S. (1987). The politics of race, class and nationalism. In \nS. Marks & S. Trapido (Eds.) The politics of race, class and nationalism \nin twentieth-century South Africa. London: Longmans. \nMiller, J.A. (2007). The sinthome, a mixture of symptom and fantasy. In V. \nVoruz & B. Wolf (Eds.) The later Lacan, pp. 55-72. State University of \nNew York Press: Albany, NY. \nRose, J. (1996). Sexuality in the field of vision. Verso: London. \nSaid, E. (1983). The world, the text and the critic. Cambridge: Harvard \nUniversity Press. \nSalecl, R. (1998). (Per)versions of love and hate. Verso: London & New York. \nSoler, C. (1995). The subject and the Other (I). In R. Feldstein, B. Fink & M. \nJaanus (Eds.), Reading Seminar XI, pp. 39-44. Albany: State \nUniversity of New York. \nStavrakakis, Y. (2007). The Lacanian left. Edinburgh University Press. \nVerhaeghe, P. (1999). Causation and destitution of a pre-ontological non-\nentity: On the Lacanian subject. In D. Nobus (Ed.), Key concepts of \nLacanian Psychoanalysis, pp. 164-189. New York: Other Press  \nŽižek, S. (1989). The sublime object of ideology. Verso: London. \nŽižek, S. (1992). Enjoy your Symptom: Jacques Lacan in Hollywood and out. \nLondon & New York: Routledge. \nŽižek, S. (1996). The Indivisible Remainder: On Schelling and Related \nMatters. London & New York: Verso. \nŽižek, S. (1997). The plague of fantasies. London & New York: Routledge. \n 28\nŽižek, S. (2000). The fragile absolute, or, why the Christian legacy is worth \nfighting for. London & New York: Verso. \nŽižek, S. (2005). Interrogating the Real. (Eds.), R. Butler & S. Stephens. New \nYork & London: Continuum.  \nZupančič, A. (2000). Ethics of the real, Kant, Lacan. London & New York: \nVerso. \n \nShort biography \nDerek Hook is a lecturer in the Institute of Social Psychology at the London \nSchool of Economics. He is also a Research Fellow in Psychology in the \nSchool of Human and Community Development, University of the \nWitwatersrand, Johannesburg the same institution from which he received his \nPhD – a Foucault inspired analytics of psychotherapeutic power - in 2001. In \n2002 he was a Rockefeller Research Fellow at the Institute for the Study of \nPublic Culture, Emory University, Atlanta. He has acted as lead editor on a \nseries of books published by University of Cape Town Press (Psychology & \nSocial Prejudice (2002), Developmental Psychology (2002), Critical \nPsychology (2004), Self, Community & Psychology (2004). \nThe over-arching focus of his research concerns the attempt to develop \nan ‘analytics of power’ sufficiently able to grapple with the unconscious and \npsychological dimensions of racism and ideological subjectivity. This work, \nwhich has drawn on – and often attempted to combine - aspects each of \nFoucauldian, postcolonial and psychoanalytic modes of critique has resulted \nin publications in Theory & Psychology, Journal of Community and Applied \nSocial Psychology, Geoforum, Psychoanalytic Review and Qualitative \nResearch in Psychology. His first single-authored text Foucault, Psychology & \nthe Analytics of Power, was published by Palgrave in 2007. He is the \ncoordinator of Psychoanalysis@LSE a multi-disciplinary research group that \naims to advance the use of psychoanalysis as a distinctive means of \nsociological and political analysis. \n \n                                            \n1 As I hope is obvious, just as Lacan’s theory of the processes of alienation\/separation is not \nto be confused with Marxist or Existentialist notions of alienation, or indeed with any \npsychological theories of separation (developmental theories, notions of separation-anxiety, \nattachment, etc.) By contrast, we are here concerned with an unconscious dimension of \nsubject-Other relationship, with one aspect of the inter-implication of the trans-subjective \nsocio-historical substance and unconscious subjectivity.  \n \n2 It is worth making mention of two attempts to extend Lacan’s alienation\/separation \ndistinction. Dolar (1998) makes the promising observation that this opposition can be read “as \nan elaboration of the difference between metaphor and metonymy” (p. 24). Jacques-Alain \nMiller (2007) speaks of how alienation “foregrounds the subject of the signifier, just as \nseparation foregrounds the subject of jouissance” (p. 61). He also emphasizes the two \ndifferent modes of identification thus implied: identification by means of representation \n(alienation), identification with the object (separation). In separation we cannot say that the \nsubject is represented, by contrast: \nAll…we can say of the subject [of separation] is that it is little a. The subject \nasserts itself as object a. The positivization we have here with little a comes from \nthe use that the subject makes of its own lack as subject of the signifier, by fitting \nitself to the Other’s lack. There is no representation. There is an identity as little a \n(p. 61). \n \n 29\n                                                                                                                             \n3  The paradoxical time of separation supports this assertion of the circular time of ideology as \nmanifest in the subject-Other relation, certainly so inasmuch as it involves an overlapping of \nfuture and past. Regards the subject’s attempt to move beyond the inescapable determination \nof the symbolic Lacan (1979) makes reference to the ‘future anterior’, that is, the future past \ntense of ‘I will have already been’. \n"}