{"doi":"10.1029\/2008SW000443","coreId":"69191","oai":"oai:eprints.lancs.ac.uk:28033","identifiers":["oai:eprints.lancs.ac.uk:28033","10.1029\/2008SW000443"],"title":"Modification of midlatitude ionospheric parameters in the f2 layer by persistent high-speed solar wind streams","authors":["Denton, M.H.","Ulich, T.","Turunen, E."],"enrichments":{"references":[{"id":969298,"title":"27 day variations in the absorption of the D-region of the ionosphere over Singapore and","authors":[],"date":"1953","doi":null,"raw":"Langehesse, G. (1953), 27 day variations in the absorption of the D-region of the ionosphere over Singapore and Slough, J. Atmos.","cites":null},{"id":971479,"title":"27-day fluctuations in the ionospheric D-region,","authors":[],"date":"1991","doi":null,"raw":"Pancheva, D., R. Schminder, and J. Lastovicka (1991), 27-day fluctuations in the ionospheric D-region, J. Atmos. Terr. Phys., 53, 1145--1150, doi:10.1016\/0021-9169(91)90064-E.","cites":null},{"id":963947,"title":"27-day variations in the F2 layer critical frequencies at Huancayo,","authors":[],"date":"1950","doi":null,"raw":"Bartels, J. (1950), 27-day variations in the F2 layer critical frequencies at Huancayo, J. Atmos. Terr. Phys., 1, 2--12, doi:10.1016\/0021-9169(50)90010-9.","cites":null},{"id":968220,"title":"A double solar-cycle in the 27-day recurrence of geomagnetic activity,","authors":[],"date":"1993","doi":null,"raw":"Hapgood, M. A. (1993), A double solar-cycle in the 27-day recurrence of geomagnetic activity, Ann. Geophys., 11, 248--253.","cites":null},{"id":963623,"title":"A modelling study of the latitudinal variations in the nighttime plasma temperatures of the equatorial topside ionosphere during northern winter at solar maximum,","authors":[],"date":"2000","doi":null,"raw":"Bailey, G. J., M. H. Denton, R. A. Heelis, and S. Venkatraman (2000), A modelling study of the latitudinal variations in the nighttime plasma temperatures of the equatorial topside ionosphere during northern winter at solar maximum, Ann. Geophys., 18, 1435--1446, doi:10.1007\/ s00585-000-1435-6.","cites":null},{"id":967987,"title":"A simple empirical method for estimating the height and semi-thickness of the F2-layer at the Argentine Islands, Graham Land,","authors":[],"date":"1974","doi":null,"raw":"Dudeney, J. R. (1974), A simple empirical method for estimating the height and semi-thickness of the F2-layer at the Argentine Islands, Graham Land, Sci. Rep. 88, Br. Antarct. Surv., Cambridge, U. K.","cites":null},{"id":969873,"title":"Coronal mass ejections and stream interaction region characteristics and their potential geomagnetic consequences,","authors":[],"date":"1995","doi":null,"raw":"Lindsay, G. M., C. T. Russell, and J. G. Luhmann (1995), Coronal mass ejections and stream interaction region characteristics and their potential geomagnetic consequences, J. Geophys. Res., 100, 16,999--17,013, doi:10.1029\/95JA00525.","cites":null},{"id":974729,"title":"Corotating solar wind streams and recurrent geomagnetic activity: A review,","authors":[],"date":"2006","doi":null,"raw":"Tsurutani, B. T., et al. (2006), Corotating solar wind streams and recurrent geomagnetic activity: A review, J. Geophys. Res., 111, A07S01, doi:10.1029\/2005JA011273.","cites":null},{"id":16669307,"title":"D e n t o n ,M .H . ,G .J .B a i l e y ,C .R .W i l f o r d ,A .S .R o d g e r ,a n d S. Venkatraman","authors":[],"date":"2002","doi":null,"raw":"D e n t o n ,M .H . ,G .J .B a i l e y ,C .R .W i l f o r d ,A .S .R o d g e r ,a n d S. Venkatraman (2002), He + dominance in the plasmasphere during geomagnetically disturbed periods: Part 1. Observational results, Ann. Geophys., 20, 461--470.","cites":null},{"id":964260,"title":"Denton (2006a), Differences between CMEdriven storms and CIR-driven storms,","authors":[],"date":null,"doi":null,"raw":"Borovsky, J. E., and M. H. Denton (2006a), Differences between CMEdriven storms and CIR-driven storms, J. Geophys. Res., 111, A07S08, doi:10.1029\/2005JA011447.","cites":null},{"id":964496,"title":"Denton (2006b), The effect of plasmaspheric drainage plumes on solar-wind\/magnetosphere coupling,","authors":[],"date":null,"doi":null,"raw":"Borovsky, J. E., and M. H. Denton (2006b), The effect of plasmaspheric drainage plumes on solar-wind\/magnetosphere coupling, Geophys.","cites":null},{"id":964692,"title":"Denton (2009a), A statistical look at plasmaspheric drainage plumes,","authors":[],"date":null,"doi":null,"raw":"Borovsky, J. E., and M. H. Denton (2009a), A statistical look at plasmaspheric drainage plumes, J. Geophys. Res., 113, A09221, doi:10.1029\/ 2007JA012994.","cites":null},{"id":964930,"title":"Denton (2009b), Relativistic-electron dropouts and recovery: A superposed epoch study of the magnetosphere and the solar wind,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":16669300,"title":"E.Borovsky(2009),The superdenseplasmasheet in the magnetosphere during high-speed-stream-driven storms: Plasma transport and timescales,","authors":[],"date":null,"doi":null,"raw":"Denton,M. H., and J. E.Borovsky(2009),The superdenseplasmasheet in the magnetosphere during high-speed-stream-driven storms: Plasma transport and timescales, J. Atmos. Sol. Terr. Phys., in press.","cites":null},{"id":974960,"title":"Energetics of magnetic storms driven by corotating interaction regions: A study of geoeffectiveness,","authors":[],"date":"2006","doi":null,"raw":"Turner, N. E., E. J. Mitchell, D. J. Knipp, and B. A. Emery (2006), Energetics of magnetic storms driven by corotating interaction regions: A study of geoeffectiveness, in Recurrent Geomagnetic Storms: Corotating Solar Wind Streams, Geophys. Monogr. Ser., vol. 167, edited by B. T. Tsurutani et al., pp. 113--124, AGU, Washington, D. C.","cites":null},{"id":967487,"title":"Geomagnetic storms driven by ICME- and CIR-dominated solar wind,","authors":[],"date":"2006","doi":null,"raw":"Denton,M.H.,J.E.Borovsky,R.M.Skoug,M.F. Thomsen,B.Lavraud, M. G. Henderson, R. L. McPherron, J. C. Zhang, and M. W. Liemohn (2006), Geomagnetic storms driven by ICME- and CIR-dominated solar wind, J. Geophys. Res., 111, A07S07, doi:10.1029\/2005JA011436.","cites":null},{"id":972542,"title":"Global view of refilling of the plasmasphere,","authors":[],"date":"2007","doi":null,"raw":"Sandel, B. R., and M. H. Denton (2007), Global view of refilling of the plasmasphere, Geophys. Res. Lett., 34, L17102, doi:10.1029\/ 2007GL030669.","cites":null},{"id":967429,"title":"He+ dominance in the plasmasphere during geomagnetically disturbed periods: Part 1. Observational results,","authors":[],"date":"2002","doi":null,"raw":null,"cites":null},{"id":967251,"title":"High altitude observations of electron temperature and a possible north\/south asymmetry,","authors":[],"date":"1999","doi":null,"raw":"Denton, M. H., G. J. Bailey, Y. Z. Su, K.-I. Oyama, and T. Abe (1999), High altitude observations of electron temperature and a possible north\/south asymmetry, J. Atmos. Sol. Terr. Phys., 61, 775--788.","cites":null},{"id":968859,"title":"High speed solar wind streams and geospace interactions,","authors":[],"date":"2007","doi":null,"raw":"Kavanagh, A., and M. H. Denton (2007), High speed solar wind streams and geospace interactions, Astron. Geophys., 48, 6.24--6.26.","cites":null},{"id":965885,"title":"Ionospheric ions in the nearEarth magnetotail,","authors":[],"date":"2008","doi":null,"raw":"Chen, S.-H., and T. E. Moore (2008), Ionospheric ions in the nearEarth magnetotail, J. Geophys. Res., 113, A08232, doi:10.1029\/ 2007JA012816.","cites":null},{"id":965642,"title":"Ionospheric storms: A review,","authors":[],"date":"1999","doi":null,"raw":"Buonsanto, M. J. (1999), Ionospheric storms: A review, Space Sci. Rev., 88, 563--601, doi:10.1023\/A:1005107532631.","cites":null},{"id":974498,"title":"Magnetic activity in the polar cap: A new index,","authors":[],"date":"1988","doi":null,"raw":"Troshichev, O. A., V. G. Andrezen, S. Vennerstrøm, and E. FriisChristensen (1988), Magnetic activity in the polar cap: A new index, Planet. Space Sci., 36, 1095--1102, doi:10.1016\/0032-0633(88)90063-3.","cites":null},{"id":966462,"title":"Observation of a decrease in mid-latitude whistler mode signal occurrence prior to geomagnetic storms,","authors":[],"date":"1993","doi":null,"raw":"Clilverd, M. A., T. D. G. Clark, A. J. Smith, and N. R. Thomson (1993), Observation of a decrease in mid-latitude whistler mode signal occurrence prior to geomagnetic storms, J. Atmos. Terr. Phys., 55(10), 1479--1485, doi:10.1016\/0021-9169(93)90113-D.","cites":null},{"id":972216,"title":"Observations of relativistic electron precipitation from the radiation belts driven by EMIC waves,","authors":[],"date":"2008","doi":null,"raw":"Rodger, C. J., T. Raita, M. A. Clilverd, A. Seppa ¨la ¨, S. Dietrich, N. R. Thomsen, and T. Ulich (2008), Observations of relativistic electron precipitation from the radiation belts driven by EMIC waves, Geophys. Res. Lett., 35, L16106, doi:10.1029\/2008GL034804.","cites":null},{"id":968754,"title":"Oscillations of global mean TEC,","authors":[],"date":"2008","doi":null,"raw":"Hocke, K. (2008), Oscillations of global mean TEC, J. Geophys. Res., 113, A04302, doi:10.1029\/2007JA012798.","cites":null},{"id":969977,"title":"Particle precipitation during ICME-driven and CIR-driven geomagnetic storms,","authors":[],"date":"2008","doi":null,"raw":"Longden, N., M. H. Denton, and F. Honary (2008), Particle precipitation during ICME-driven and CIR-driven geomagnetic storms, J. Geophys. Res., 113, A06205, doi:10.1029\/2007JA012752.","cites":null},{"id":966170,"title":"Planetary distribution of 27-day variation of electron concentration in maximum of F-layer of ionosphere,","authors":[],"date":"1975","doi":null,"raw":"Chkhetiya, A. M. (1975), Planetary distribution of 27-day variation of electron concentration in maximum of F-layer of ionosphere, Geomagn. Aeron., 15, 160--161.","cites":null},{"id":963089,"title":"Quantitative forecasting of the 27-day recurrent magnetic activity,","authors":[],"date":"1988","doi":null,"raw":"Akasofu, S. I., C. Olmsted, T. Saito, and T. Oki (1988), Quantitative forecasting of the 27-day recurrent magnetic activity, Planet. Space Sci., 36, 1133--1147, doi:10.1016\/0032-0633(88)90068-2.","cites":null},{"id":973057,"title":"Relativistic electron pitchangle scattering by electromagnetic ion cyclotron waves during geomagnetic storms,","authors":[],"date":"2003","doi":null,"raw":"Summers, D., and R. M. Thorne (2003), Relativistic electron pitchangle scattering by electromagnetic ion cyclotron waves during geomagnetic storms, J. Geophys. Res., 108(A4), 1143, doi:10.1029\/ 2002JA009489. Temmer,M.,B.Vrs ˇnak,andA.M.Veronig(2007),Periodicappearance of coronal holes and the related variation of solar wind parameters, Sol. Phys., 241, 371--383, doi:10.1007\/s11207-007-0336-1.","cites":null},{"id":16669255,"title":"Relativistic-electrondropouts and recovery: A superposed epoch study of the magnetosphere and the solar wind,","authors":[],"date":null,"doi":null,"raw":"Borovsky, J.E., and M. H. Denton (2009b), Relativistic-electrondropouts and recovery: A superposed epoch study of the magnetosphere and the solar wind, J. Geophys. Res., 114, A02201, doi:10.1029\/2008JA013128. B o r o v s k y ,J .E . ,a n dJ .T .S t e i n b e r g( 2 0 0 6 ) ,T h e‘ ‘ c a l mb e f o r et h e storm’’ in CIR\/magnetosphere interactions: Occurrence statistics, solar wind statistics, and magnetospheric preconditioning, J. Geophys.","cites":null},{"id":970877,"title":"Role of the Russell-McPherron effect in the acceleration of relativistic electrons,","authors":[],"date":"2009","doi":null,"raw":"McPherron, R. L., D. N. Baker, and N. U. Crooker (2009), Role of the Russell-McPherron effect in the acceleration of relativistic electrons, J. Atmos. Sol. Terr. Phys., in press.","cites":null},{"id":969603,"title":"Rotating solar coronal holes and periodic modulation of the upper atmosphere,","authors":[],"date":"2008","doi":null,"raw":"Lei, J., J. P. Thayer, J. M. Forbes, E. K. Sutton, and R. S. Nerem (2008), Rotating solar coronal holes and periodic modulation of the upper atmosphere, Geophys. Res. Lett., 35, L10109, doi:10.1029\/2008GL033875.","cites":null},{"id":971937,"title":"Seasonal and solar cycle variations of the ionospheric peak electron density: Comparison ofmeasurement andmodels,","authors":[],"date":"2001","doi":null,"raw":null,"cites":null},{"id":16669363,"title":"Seasonal and solar cycle variations of the ionosphericpeakelectrondensity:Comparisonofmeasurementandmodels,","authors":[],"date":"2001","doi":null,"raw":"Richards, P. G. (2001), Seasonal and solar cycle variations of the ionosphericpeakelectrondensity:Comparisonofmeasurementandmodels, J. Geophys. Res., 106, 12,803--12,819, doi:10.1029\/2000JA000365.","cites":null},{"id":972234,"title":"Semiannual variation of geomagnetic activity,","authors":[],"date":"1973","doi":null,"raw":"Russell, C. T., and R. L. McPherron (1973), Semiannual variation of geomagnetic activity, J. Geophys. Res., 78,9 2 - - 1 0 8 ,d o i : 1 0 . 1 0 2 9 \/ JA078i001p00092.","cites":null},{"id":975242,"title":"Solar variability and long-term trends in the ionosphere,","authors":[],"date":"2000","doi":null,"raw":"Ulich, T. (2000), Solar variability and long-term trends in the ionosphere, Ph.D. thesis, Oulu Univ. Press, Oulu, Finland.","cites":null},{"id":969106,"title":"Solar wind spatial scales in and comparisons of hourly Wind and ACE plasma and magnetic field data,","authors":[],"date":"2005","doi":null,"raw":"King, J. H., and N. E. Papitashvili (2005), Solar wind spatial scales in and comparisons of hourly Wind and ACE plasma and magnetic field data, J. Geophys. Res., 110, A02104, doi:10.1029\/2004JA010649.","cites":null},{"id":971136,"title":"Solar-terrestrial coupling evidenced by periodic behavior in geomagnetic indexes and the infrared energy budget of the thermosphere,","authors":[],"date":"2008","doi":null,"raw":"Russell III, and T. Woods (2008), Solar-terrestrial coupling evidenced by periodic behavior in geomagnetic indexes and the infrared energy budget of the thermosphere, Geophys. Res. Lett., 35, L05808, doi:10.1029\/2007GL032620.","cites":null},{"id":974229,"title":"Statistics of plasma fluxes at geosynchronous orbit over more than a full solar cycle,","authors":[],"date":"2007","doi":null,"raw":"Thomsen, M. F., M. H. Denton, B. Lavraud, and M. Bodeau (2007), Statistics of plasma fluxes at geosynchronous orbit over more than a full solar cycle, Space Weather, 5, S03004, doi:10.1029\/2006SW000257.","cites":null},{"id":970312,"title":"Superposed epoch analysis of a whistler instability criterion at geosynchronous orbit during geomagnetic storms,","authors":[],"date":"2008","doi":null,"raw":"MacDonald, E. A., M. H. Denton, M. F. Thomsen, and S. P. Gary (2008), Superposed epoch analysis of a whistler instability criterion at geosynchronous orbit during geomagnetic storms, J. Atmos. Sol.","cites":null},{"id":966738,"title":"Superposed epoch analysis of high-speed-stream effects at geosynchronous orbit: Hot plasma, cold plasma, and the solar wind,","authors":[],"date":"2008","doi":null,"raw":"Denton, M. H., and J. E. Borovsky (2008), Superposed epoch analysis of high-speed-stream effects at geosynchronous orbit: Hot plasma, cold plasma, and the solar wind, J. Geophys. Res., 113, A07216, doi:10.1029\/2007JA012998.","cites":null},{"id":965017,"title":"The ‘‘calm before the storm’’ in CIR\/magnetosphere interactions: Occurrence statistics, solar wind statistics, and magnetospheric preconditioning,","authors":[],"date":"2006","doi":null,"raw":null,"cites":null},{"id":963354,"title":"The 22-year cycle in the geomagnetic 27-day recurrences reflecting on the F2-layer ionization,","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":16669222,"title":"The 22-year cycle inthe geomagnetic 27-day recurrences reflectingontheF2-layer ionization,","authors":[],"date":"2004","doi":null,"raw":"Apostolov, E. M., D. Altadill, and M. Todorova (2004), The 22-year cycle inthe geomagnetic 27-day recurrences reflectingontheF2-layer ionization, Ann. Geophys., 22, 1171--1176.","cites":null},{"id":971665,"title":"The 27-day variations of plasma densities and temperatures in the topside ionosphere,","authors":[],"date":"2003","doi":null,"raw":"S04006 DENTON ET AL.: PARAMETERS IN THE F2 LAYER DURING HSSS 9o f1 0 S04006Rich, F. J., P. J. Sultan, and W. J. Burke (2003), The 27-day variations of plasma densities and temperatures in the topside ionosphere, J. Geophys. Res., 108(A7), 1297, doi:10.1029\/2002JA009731.","cites":null},{"id":971410,"title":"The causes of midlatitude","authors":[],"date":"2008","doi":null,"raw":"Oliver, W. L., S. Kawamura, and S. Fukao (2008), The causes of midlatitude F Layer behavior, J. Geophys. Res., 113, A08310, doi:10.1029\/ 2007JA012590.","cites":null},{"id":975464,"title":"The effect of the high-speed stream following the corotating interaction region on the geomagnetic activities,","authors":[],"date":"1997","doi":"10.1007\/s00585-997-0662-5","raw":"Watari, S. (1997), The effect of the high-speed stream following the corotating interaction region on the geomagnetic activities, Ann. Geophys., 15, 662--670, doi:10.1007\/s00585-997-0662-5. M. H. Denton, Department of Communication Systems, Lancaster University, Lancaster LA1 4WA, UK. (m.denton@lancaster.ac.uk) E. Turunen and T. Ulich, Sodankyla ¨ Geophysical Observatory, Ta ¨htela ¨ntie 62, FIN-99600 Sodankyla ¨, Finland. S04006 DENTON ET AL.: PARAMETERS IN THE F2 LAYER DURING HSSS 10 of 10 S04006","cites":null},{"id":965288,"title":"The influence of the 27-day variation in the upper atmosphere neutral-particle density on ionospheric spread-F occurrence,","authors":[],"date":"1996","doi":null,"raw":"Bowman, G. G. (1996), The influence of the 27-day variation in the upper atmosphere neutral-particle density on ionospheric spread-F occurrence, J. Geomag. Geoelectr., 48, 1043--1057.","cites":null},{"id":970611,"title":"The solar wind and geomagnetic activity as a function of time relative to corotating interaction regions, in Recurrent Geomagnetic Storms:","authors":[],"date":"2006","doi":null,"raw":"McPherron, R. L., and J. Weygand (2006), The solar wind and geomagnetic activity as a function of time relative to corotating interaction regions, in Recurrent Geomagnetic Storms: Corotating Solar Wind Streams, Geophys. Monogr. Ser., vol. 167, edited by B. T. Tsurutani et al., pp. 125--137, AGU, Washington, D. C.","cites":null},{"id":968507,"title":"The Solar-Terrestrial Environment: An Introduction to Geospace---The Science of the Terrestrial Upper Atmosphere, Ionosphere, and Magnetosphere,","authors":[],"date":"1992","doi":null,"raw":"Hargreaves, J. K. (1992), The Solar-Terrestrial Environment: An Introduction to Geospace---The Science of the Terrestrial Upper Atmosphere, Ionosphere, and Magnetosphere, Cambridge Univ. Press, Cambridge, U. K.","cites":null},{"id":966998,"title":"The superdense plasma sheet in the magnetosphere during high-speed-stream-driven storms: Plasma transport and timescales,","authors":[],"date":"2009","doi":null,"raw":null,"cites":null},{"id":971966,"title":"The Upper Atmosphere and Magnetosphere,","authors":[],"date":"1977","doi":null,"raw":"Roble, R. G. (1977), The Upper Atmosphere and Magnetosphere, Natl. Acad. of Sci., Washington, D. C.","cites":null},{"id":973632,"title":"Thermospheric density oscillations due to periodic solar wind highspeed streams,","authors":[],"date":"2008","doi":null,"raw":null,"cites":null},{"id":16669444,"title":"Thermospheric density oscillations due to periodic solar wind highspeedstreams,J.Geophys.Res.,113,A06307,doi:10.1029\/2008JA013190.","authors":[],"date":"2008","doi":null,"raw":"Thayer, J. P., J. Lei, J. M. Forbes, E. K. Sutton, and R. S. Nerem (2008), Thermospheric density oscillations due to periodic solar wind highspeedstreams,J.Geophys.Res.,113,A06307,doi:10.1029\/2008JA013190.","cites":null},{"id":967715,"title":"Tsurutani","authors":[],"date":"2008","doi":null,"raw":"Denton, M. H., J. E. Borovsky, R. B. Horne, R. L. McPherron, S. K. Morley, and B. T. Tsurutani (2008), High speed solar wind streams: A call for key research, Eos Trans. AGU, 89(7), 62--63, doi:10.1029\/ 2008EO070002.","cites":null},{"id":973361,"title":"Veronig (2007), Periodic appearance of coronal holes and the related variation of solar wind parameters,","authors":[],"date":null,"doi":null,"raw":null,"cites":null},{"id":973992,"title":"Why Kp is such a good measure of magnetospheric convection,","authors":[],"date":"2004","doi":null,"raw":"Thomsen, M. F. (2004), Why Kp is such a good measure of magnetospheric convection, Space Weather, 2, S11004, doi:10.1029\/ 2004SW000089.","cites":null},{"id":972800,"title":"World-wide variations in the height of the maximum electron density of the ionospheric F2 layer,","authors":[],"date":"1955","doi":null,"raw":"Shimazaki, T. (1955), World-wide variations in the height of the maximum electron density of the ionospheric F2 layer, J. Radio Res. Lab. Jpn., 2, 85--97.","cites":null}],"documentType":{"type":1}},"contributors":[],"datePublished":"2009-04-23","abstract":null,"downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/69191.pdf","fullTextIdentifier":"http:\/\/eprints.lancs.ac.uk\/28033\/1\/art_967.pdf","pdfHashValue":"9a80ef863fec872fa26124d3e6671258a74a469f","publisher":null,"rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lancs.ac.uk:28033<\/identifier><datestamp>\n      2018-01-24T02:51:55Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Modification of midlatitude ionospheric parameters in the f2 layer by persistent high-speed solar wind streams<\/dc:title><dc:creator>\n        Denton, M.H.<\/dc:creator><dc:creator>\n        Ulich, T.<\/dc:creator><dc:creator>\n        Turunen, E.<\/dc:creator><dc:date>\n        2009-04-23<\/dc:date><dc:type>\n        Journal Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.lancs.ac.uk\/28033\/1\/art_967.pdf<\/dc:identifier><dc:relation>\n        http:\/\/dx.doi.org\/10.1029\/2008SW000443<\/dc:relation><dc:identifier>\n        Denton, M.H. and Ulich, T. and Turunen, E. (2009) Modification of midlatitude ionospheric parameters in the f2 layer by persistent high-speed solar wind streams. Space Weather, 7 (S04006). pp. 1-10. ISSN 1539-4956<\/dc:identifier><dc:relation>\n        http:\/\/eprints.lancs.ac.uk\/28033\/<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["http:\/\/dx.doi.org\/10.1029\/2008SW000443","http:\/\/eprints.lancs.ac.uk\/28033\/"],"year":2009,"topics":[],"subject":["Journal Article","PeerReviewed"],"fullText":"Modification of midlatitude ionospheric parameters\nin the F2 layer by persistent high-speed solar wind streams\nM. H. Denton,1 T. Ulich,2 and E. Turunen2\nReceived 22 September 2008; revised 23 January 2009; accepted 5 February 2009; published 23 April 2009.\n[1] High-speed solar wind streams (HSSs) are periods of persistently high solar wind, which emanate\nfrom coronal holes and may recur with a frequency related to the solar rotation period of 27 days. On\narrival at the Earth’s magnetopause, such streams cause a series of events which ultimately lead to changes\nin the ionospheric F layer. We present a superposed epoch analysis of parameters in the midlatitude\nF2 layer for a collection of 124 high-speed solar wind streams which occurred between 1993 and 2006. Clear\nchanges in the critical frequency (foF2), density (NmF2), and height (hmF2) are found to occur after the\nonset of magnetospheric convection associated with HSS arrival at the Earth’s magnetosphere. A fall\nin foF2 occurs immediately following convection onset accompanied by a sudden decrease in NmF2 and an\nincrease in hmF2. During the events under study, the height of the F2 layer is found to increase by \u000120 km\nat convection onset. A period of more than 4 days is required for the ionosphere to return to preevent\nlevels. This behavior is explained as the occurrence of ionospheric F region storms following HSS arrival.\nThe results raise the possibility of improved predictions for ionospheric parameters on the basis of\nupstream solar wind conditions and prior identification of stream interfaces.\nCitation: Denton, M. H., T. Ulich, and E. Turunen (2009), Modification of midlatitude ionospheric parameters in the F2 layer\nby persistent high-speed solar wind streams, Space Weather, 7, S04006, doi:10.1029\/2008SW000443.\n1. Introduction\n[2] A quasi-27-day periodicity in various atmospheric,\nionospheric, and magnetospheric parameters has previ-\nously been reported in numerous studies, some dating to\nbefore the space age [e.g., Bartels, 1950; Langehesse, 1953;\nChkhetiya, 1975; Akasofu et al., 1988;Hapgood, 1993; Pancheva\net al., 1991; Bowman, 1996; Rich et al., 2003; Apostolov et al.,\n2004; Hocke, 2008, and references therein]. The \u000127-day\nsolar rotation period is clearly connected with recurrent\nperiodicity in ionospheric disturbances. Features on the\nSun which cause ionospheric disturbances may produce\nrecurrent activity if the features themselves last for more\nthan a single solar rotation. High-speed solar wind streams\n(HSSs) are one phenomena which fulfil this criterion. HSSs\nevolve as a result of fast solar wind emitted from coronal\nholes on the Sun. Such ‘‘fast’’ wind (>\u0001450 km s\u00021) catches\nup with preceding ‘‘slow’’ solar wind (\u0001300 km s\u00021) and at\nthe interface between the two a ‘‘corotating interaction\nregion’’ (CIR) is formed. Thus, a single coronal hole which\npersists for more than one solar rotation may produce\nmultiple CIRs and also multiple periods of fast solar wind.\nThis results in upstream solar wind objects such as the\nEarth encountering similar conditions in a repeatable\nfashion every 27 days (or more frequently if more than\none coronal hole is present on the Sun). Figure 1 shows a\nschematic of this process, with the typical regions and\nmagnetospheric responses given in Table 1 [after Borovsky\nand Denton, 2009a]. It should also be noted that in the\nliterature researchers (including the present authors) have\npreviously used the terms ‘‘CIR’’ and ‘‘HSS’’ somewhat\ninterchangeably, referring to ‘‘CIR-driven’’ and\/or ‘‘HSS-\ndriven’’ storms or events. Strictly, the CIR which forms on\nthe leading edge of theHSS is a region that is of limited size\nand duration (at Earth), and which marks the start of the\nprolonged period of high solar wind speed. From the point\nof view of the inner magnetosphere\/ionosphere response,\nit is the long duration (days) of this high-speed solar wind\nwhich is the most salient feature of these types of events,\nand hence ‘‘HSS event’’ is used in this study as the more\naccurate descriptor.\n[3] Work on HSS effects within the magnetosphere has\naccelerated during the current solar cycle [Denton et al.,\n2008; Kavanagh and Denton, 2007] with a review of HSS-\ndriven storms presented by Tsurutani et al. [2006], and\ndetailed statistical analyses of HSSs being calculated by\nMcPherron and Weygand [2006] and McPherron et al. [2009].\n1Department of Communication Systems, Lancaster University,\nLancaster, UK.\n2Sodankyla¨ Geophysical Observatory, Sodankyla¨, Finland.\nSPACE WEATHER, VOL. 7, S04006, doi:10.1029\/2008SW000443, 2009\nClick\nHere\nfor\nFull\nArticle\nCopyright 2009 by the American Geophysical Union 1 of 10S04006\nBorovsky and Denton [2009a] recently presented correlations\nbetween relativistic electron dropouts at geosynchronous\norbit and the occurrence of plasmaspheric drainage plumes\nand a superhot\/superdense plasma sheet [Denton and\nBorovsky, 2008, 2009], with EMIC wave interactions\nproposed as the principal cause of relativistic electron\nprecipitation into the atmosphere [see also MacDonald et\nal., 2008; Rodger et al., 2008; Sandanger et al., 2009; Summers\nand Thorne, 2003]. With direct relation to the ionosphere-\nplasmasphere system, Borovsky and Denton [2009b] have\nproduced a detailed explanation of plasmaspheric drainage\nplume behavior during HSSs and carried out detailed\nstatistical analyses of plume evolution. Such ionospheric\nmaterial has direct implications for mass\/energy coupling\nof the solar wind to the magnetosphere [Borovsky and\nDenton, 2006b]. For the lower thermosphere, Mlynczak et\nal. [2008] report a 9-day periodicity in the infrared energy\nbudget of the thermosphere using data from SABER and\nSEE instruments on the NASA\/TIMED satellite. This\nperiodicity coincides with coronal holes (and associated\nhigh-speed solar wind streams) which recur with \u00019-day\nfrequency [Temmer et al., 2007] and are particularly strong in\n2002--2006. An indication of broad density changes within\nthe Earth’s thermosphere in response to HSSs has been\nnoted by Lei et al. [2008] and Thayer et al. [2008] who detect\nthis same 9-day periodicity in thermospheric density using\naccelerometer measurements from the CHAMP satellite\nduring 2005 and 2006.\n[4] In comparing and contrasting ‘‘geomagnetic distur-\nbances’’ or ‘‘storms’’ driven by coronal mass ejections\n(CMEs) with similar events driven by HSSs, it should be\nnoted that more attention is generally given to the former\nsince CMEs are events of shorter duration and they\ngenerally cause the largest excursions in the Dst and Kp\nindices. However, HSSs, simply because of their longer\nduration, may actually impart an equivalent (or greater)\namount of energy into the Earth’s magnetosphere as do\nCME-driven storms [Turner et al., 2006]. Indeed, HSSs are\nknown to be of greater importance than CMEs for certain\nmagnetospheric processes (e.g., radiation belt energiza-\ntion, plasma sheet temperature elevation). A general\ncomparison between CME-driven storms and HSS-driven\nstorms are given by Borovsky and Denton [2006a] while\nDenton et al. [2006] compared and contrasted average\nplasma sheet parameters at geosynchronous orbit during\neach type of storm driver and Longden et al. [2008] com-\npared and contrasted particle precipitation rates for CME-\ndriven and HSS-driven storms. In addition, Lindsay et al.\n[1995] have previously compared HSSs and CMEs char-\nacteristics during solar cycle 21 using Pioneer Venus\nOrbiter data while Watari [1997] used IMP-8 data to\ndescribe the broad effects of high-speed streams within\nthe magnetosphere and emphasized the importance of the\nRussell-McPherron effect [Russell and McPherron, 1973]\nupon the coupling.\n[5] Briefly, during its passage over the magnetosphere,\na typical HSS will induce phenomena including the\nfollowing: (1). Elevated solar wind speed lasting for many\ndays. (2) A pulse of elevated density on the leading edge of\nthe CIR. (3) Enhanced magnetospheric convection which\npersists for many days. (4) Elevated heating and higher\ndensity within the Earth’s plasma sheet. (5) The possible\ndropout and recovery of radiation belt fluxes at geosyn-\nchronous orbit. (6) Enhanced wave-particle interactions in\nthe inner magnetosphere. (7) Enhanced particle precipi-\ntation in the auroral regions.\n[6] In this report we aim to determine the average\nresponse of parameters within the Earth’s midlatitude\nionosphere to this sequence of events and show that\nbecause of their repeatable nature it is possible to predict\nthe broad response of the ionosphere on the basis of\nparameters measured by upstream solar wind monitors\nat the L1 point. It is hoped the work will allow inclusion of\nsuch knowledge within current ionospheric models, and\nhence improve predictions of ionospheric conditions.\nAlso, it is hoped the results will help stimulate more\naccurate prediction of radio propagation effects during\nhigh-speed solar wind streams.\n2. Data Set and Statistical Analyses\n[7] HSSs are repeatable phenomena (they recur if the\nsource region persists for more than a single solar rota-\ntion). In the current study, we perform superposed epoch\nanalysis of ionospheric data use the same list of 124 HSS\nevents that have successfully been used in studies of the\nFigure 1. Schematic showing the structure of a typical\nhigh-speed stream (HSS), including the embedded\ncorotating interaction region (CIR) [after Borovsky and\nDenton, 2009b].\nS04006 DENTON ET AL.: PARAMETERS IN THE F2 LAYER DURING HSSS\n2 of 10\nS04006\nmagnetospheric response to HSSs [Denton et al., 2008,\nDenton and Borovsky, 2008, 2009; Borovsky and Denton,\n2009a, 2009b]. In brief, the list is constructed on the basis\nof an initial list of CIR interfaces for 1993--1996 provided\nby R. McPherron (private communication, 2005). More\nevents were added by searching solar wind data for years\nbeyond 1996 and identifying typical signatures of HSSs\n(e.g., E\/W flow deflection followed by sustained elevated\nsolar wind speed). The final list of HSSs between 1993 and\n2006, includes an ‘‘onset time’’ which is the time of\nconvection onset following the stream interface in the\nsolar wind. Convection onsets were initially detected\nfollowing a rise in the Kp index with the final onset time\nat \u000130 min time resolution provided by reference to the\nMBI (Midnight Boundary Index). Increases in Kp and MBI\nhave been shown to be highly correlated with convection\nonsets [Thomsen, 2004]. It should be noted that events with\nno discernable increase in convection following a HSS\nidentification in the solar wind are not included in the\nstudy. Hence, this event selection corresponds solely to\nevents which are the most Russell-McPherron effective\n[Russell and McPherron, 1973; McPherron et al., 2009].\n[8] Figure 2 shows superposed epoch solar wind\/mag-\nnetospheric parameters during the high-speed stream\nevents used in this study from two days prior to zero\nepoch to four days after zero epoch (solar wind parame-\nters are only included in the average for years beyond\n1994). These data are taken from the high time resolution\n(1-min) OMNI2 database [King and Papitashvili, 2005] with\nassociated other parameters. The red and blue lines indi-\ncate the upper and lower quartiles for the data, while the\nblack solid line and the black dashed line indicate the\nmean and the median respectively. The gray region rep-\nresents a spread of one standard deviation from the mean.\nTypical signatures of high-speed streams are evident in\nthe plots which show the following:\n[9] 1. A small decrease in theDst index to around\u000220 nT\nat zero epoch. The Dst index slowly increases during a\nprolonged recovery period lasting days.\n[10] 2. A sharp increase in magnetospheric convection at\nzero epoch as shown by the sudden increase in the Kp\nindex and a decrease in the Midnight Boundary Index.\nSuch elevated convection persists for at least four days\nwhile the ‘‘calm before the storm’’ [Clilverd et al., 1993;\nBorovsky and Steinberg, 2006] is evinced by the extremely\nlow values of Kp prior to zero epoch.\n[11] 3. An increase in the overall solar wind speed (V-SW)\nand a west-to-east deflection in the y component of the\nsolar wind (VY-SW) around zero epoch.\n[12] 4. An increase in the northern hemisphere Polar\nCap Index (PCI) indicating increased coupling between\nthe magnetosphere and the IMF [Troshichev et al., 1988].\n[13] 5. An increase in the density of the solarwind (N-SW)\ndue to the interaction between fast and slow solar winds in\nthe CIR. The density peaks close to zero epoch, and falls to\npreevent levels \u00011 day after zero epoch.\n[14] 6. A brief negative turning in the southward compo-\nnent of the interplanetary magnetic field in GSM coordi-\nnates (Bz-GSM) close to zero epoch indicating that the\narrival of the HSSs being studied was accompanied by\nsouthward IMF-Bz on average.\n[15] 7. A nonvarying value of the F10.7 index indicating\nlittle change in the ionising solar EUV flux throughout\nevents.\n[16] To determine the effects of the events in Figure 2\nupon ionospheric parameters, we perform a superposed\nepoch analysis of ionosonde data, initially for a single\nionosonde station (Juliusruh, Germany; 54.6N, 13.4E).\nThe results of this analysis for the F2 layer critical frequency\n(foF2) are shown in Figure 3. The colored traces plot the\nindividual ionosonde measurements (where available) for\nthe 124 events used in the analysis, while the solid black\nline shows the mean value of foF2 (at one hour time\nresolution), from eight days prior to zero epoch to sixteen\ndays beyond zero epoch (each HSS event is plotted a\ndifferent color). Data are simply binned according to\nepoch time, and at this stage no attempt is made to further\nremove the residual diurnal variation which remains\nevident as a quasi-sinusoidal fluctuation. It is caused by\nthe domination of a few events with exceptionally low\/\nhigh values of foF2. It is evident that in addition to this\ndiurnal variation, there is also a step change in foF2 at the\npoint of zero epoch (onset of convection)where a significant\ndrop in thismagnitude of this parameter occurs. During the\nfollowing few days foF2 recovers to its preepoch value. It is\nclear that the arrival of HSSs and subsequent associated\nTable 1. Summary of How of Geomagnetic Activity Responds During the Passage of a High-Speed Solar\nWind Streama\nSolar Wind Properties Geomagnetic Response\nSlow solar wind ‘‘Calm’’ occurs \u000170% of the time\nStart of CIR End of calm period\nCompressed slow solar wind Mild geomagnetic activity\nStream interface ‘‘Storm’’ onset and elevated geomagnetic activity\nCompressed fast solar wind Elevated geomagnetic activity\nEnd of CIR Elevated geomagnetic activity\nFast solar wind Geomagnetic activity declines over many days\naGeomagnetic activities include, for example, magnetospheric convection.\nS04006 DENTON ET AL.: PARAMETERS IN THE F2 LAYER DURING HSSS\n3 of 10\nS04006\neffects within the magnetosphere produce a clear and\nmeasurable effect in the ionosphere.\n[17] The electron density at the F2 peak is directly\nproportional to the square of the critical frequency of the\nlayer, namely,\nNmF2 ¼ 1:24 1010\u0001 \u0002foF22; ð1Þ\nwhere NmF2 is the number density at the F2 peak (in m\u00023)\nand foF2 is critical frequency at the F2 peak (in MHz)\n[Piggott and Rawer, 1972]. The height of the F2 peak is\nusually obtained from standard ionospheric parameters\nby an empirical formula. A number of such formulae have\nbeen developed over the years. The most fundamental\nstates that height of F2 (hmF2) is simply inversely\nproportional to the maximum usable frequency factor\nM(3000)F2, i.e., for heights in kilometers [Shimazaki, 1955]\nhmF2 ¼ 1490=M 3000ð ÞF2\u0002 176: ð2Þ\nHowever, other authors noted that this formula is too\ncrude, because it neglects the effects of retardation of the\nradio wave due to ionization below the F2 peak. Various\nother formulae try to account for this, usually by adding a\ncorrection term proportional to the ratio of critical\nFigure 2. Superposed epoch plots of various solar wind, magnetospheric, and geophysical indices\nduring 124 high-speed solar wind streams between 1993 and 2006. The variation of these indices is\nshown from 2 days prior to convection onset (zero epoch) to 4 days after convection onset. Typical\nfeatures of HSSs are evident, including an increase in solar wind speed close to zero epoch and\npersistent high speed for a number of days. In addition, magnetic convection (Kp and MBI)\nincreases sharply and remain elevated for days. The thick black line is the mean, the thin black line\nis the median, and the red and blue lines are the upper and lower quartiles of the data,\nrespectively. The gray bars indicate the region within one standard deviation of the mean for each\nparameter.\nS04006 DENTON ET AL.: PARAMETERS IN THE F2 LAYER DURING HSSS\n4 of 10\nS04006\nfrequencies of the F2 and E layer (foF2\/foE). However,\nUlich [2000] found equation (56) of Dudeney [1974] to work\nmost reliably. Hence, in all analyses below, hmF2(1) refers\nto the height of the F2 peak calculated from equation (2)\nand hmF2(2) refers to the height of the F2 peak calculated\nfrom equation 56 of Dudeney [1974].\n[18] To concentrate on the actual changes associated\nwith the stream interface and the subsequent period\nduring the high-speed stream, Figure 4 shows averaged\nfoF2 values and also the derived values of F2 peak density\n(NmF2) and height (hmF2). For clarity, the plots show the\nmean of each parameter (thick black line), median (thin\nblack line), upper (red) and lower (blue) quartiles in a\nsimilar manner to Figure 2. The region within one stand-\nard deviation of the mean is indicated in gray. The most\nstriking feature in the plot is again the diurnal variation\ncaused by high values in these parameters from a number\nof the events which dominate the averages. However,\nseveral other distinct features are readily discernable.\nThe day prior to zero epoch (prior to convection onset),\nthe extremely low values of convection during the ‘‘calm’’\nresult in a gradual decline in average values of hmF2.\nSubsequently, following the onset of convection at zero\nepoch, a sudden decrease occurs in foF2 and results in the\ndecrease of the calculated values of NmF2 and the\nincrease in the calculated values of hmF2. Although a\nprecise estimate of when all three parameters return to\n‘‘preevent’’ values is difficult to ascertain, it is clear that\nthe effects of the high-speed stream in the ionosphere\npersist for at least four days on average.\n[19] To reveal the differences between the daytime\nresponse and nighttime response to HSS arrival at the\nEarth’s magnetosphere, Figures 5 and 6 contain plots of\nequivalent analyses to those shown in Figure 4, but split\nbetween daytime (1100--0300 LT) and nighttime (2300--\n0300 LT), respectively. A similar analysis technique was\nused by Denton et al. [1999] to assess differences in daytime\nand nighttime topside ionosphere temperatures. In the\ncurrent study, these local time ranges are chosen to ensure\nthat the data in each plot are from periods when the\nionosphere is largely in sunlight or darkness. Because of\nthe large spread of data in these plots, only the mean\n(solid black line) and standard deviations (gray) are shown\nfor clarity. Analysis indicates that the increase\/decrease in\nfoF2, NmF2, and hmF2, during both sunlight and dark-\nness, is of a similar magnitude. The only noticeable differ-\nence between the two is that around the time of zero\nepoch, the onset of changes to the aforementioned para-\nmeters occur over a shorter timescale during the daytime\nthan during the night (the changes in foF2, NmF2, and\nhmF2 are sharper during the daytime than during the\nnight). This is likely due to the ‘‘reservoir’’ of plasma\nproduced during the daytime, which then descends along\nflux tubes and undergoes recombination in the nighttime.\nFigure 3. The individual (colored) and mean (black) values of the frequency of the F2 peak (foF2)\nmeasured at Juliusruh as a function of epoch time for 124 HSSs between 1993 and 2006 for 8 days\nprior to zero epoch to 16 days after zero epoch (1-hour time resolution). The underlying sinusoidal,\ndiurnal variation in foF2 is clear. In addition, foF2 undergoes a sharp fall at zero epoch (convection\nonset) and slowly recovers to its preevent level over the next \u00014 days.\nS04006 DENTON ET AL.: PARAMETERS IN THE F2 LAYER DURING HSSS\n5 of 10\nS04006\nHence, during the nighttime this reservoir of plasma\nsuppresses the sharp changes evident at convection onset\nseen in the daytime.\n3. Discussion\n[20] The broad dynamics of the midlatitude F region are\nlargely controlled by production (e.g., solar EUV flux),\ntransport (e.g., thermospheric winds), and loss (e.g.,\nrecombination) processes [e.g., Oliver et al., 2008]. The\nF region is known to vary substantially between solar\nmaximum and solar minimum and this variation may be\ndetected in the ionosphere itself [e.g., Richards, 2001], in\nthe topside and plasmasphere regions [e.g., Denton et al.,\n1999] or in other regions of the magnetosphere such as the\nplasma sheet where ionospheric material is only a minor\nconstituent of the overall population [e.g., Thomsen et al.,\n2007; Chen and Moore, 2008]. Theoretical models help to\ndetermine the principal parameters affecting the density,\ntemperature and composition in the ionosphere and plas-\nmasphere as a function of solar cycle [e.g., Bailey et al.,\n2000], season [e.g., Richards, 2001], or storm driver [e.g.,\nDenton et al., 2002]. HSSs are typically solar minimum\/\ndeclining phase phenomena, and the density, height, and\npeak frequency in the F2 layer respond primarily to the\nionising EUV and X-ray fluxes, the ionising particle flux,\nand the behavior of thermospheric neutral winds. The\nexpected behavior of the density at the F2 peak during an\n‘‘F region ionospheric storm’’ mirrors that of the Dst index\nduring a traditionalmagnetospheric storm [e.g.,Hargreaves,\n1992; Buonsanto, 1999]. The average NmF2 initially falls\nduring such a storm and the entire F region broadens\nduring the ‘‘main phase’’ and then enters a ‘‘recovery\nperiod’’ over a period of one to several days.\n[21] The most reasonable explanation for the results\nshown in Figures 3--6 is the onset of ionospheric F region\nFigure 4. Superposed epoch plots of foF2, NmF2, and hmF2 (calculated via methods 1 and 2) for\n124 HSSs between 1993 and 2006 for 4 days prior to zero epoch to 8 days after zero epoch. A step\nchange is clear in all parameters at zero epoch (convection onset). Averaged values of foF2 and\nNmF2 fall while hmF2 increases. The thick black line is the mean, the thin black line is the median,\nand the red and blue lines are the upper and lower quartiles of the data, respectively. The gray\nbars indicate the region within one standard deviation of the mean.\nS04006 DENTON ET AL.: PARAMETERS IN THE F2 LAYER DURING HSSS\n6 of 10\nS04006\nstorms during HSSs (for a review of F region storms see\nBuonsanto [1999]). Such storms produce an increase in\nheating of the ionosphere at convection onset, caused by\nenhanced particle precipitation rates. Precipitation is\nknown to be significantly enhanced during CME events\nand for a longer duration during HSS events [Longden et\nal., 2008]. Changes in EUV flux can be ruled out as the\ncause of the change in F region parameters during HSSs\nbecause of the flat profile of the F10.7 index (see Figure 2).\nHence, it seems likely that the increase in particle preci-\npitation at high latitude during HSSs leads to an increase\nin ionospheric temperature which in turn increases the\nrecombination rate; the overall result is a decrease in the\ndensity at the F2 peak [e.g., Hargreaves, 1992]. Also, this\nincrease in precipitation occurs in combination with\nchanges in thermospheric neutral wind circulation known\nto occur during enhanced convection and which are\npredicted to elevate the ionosphere [e.g., Roble, 1977;\nBuonsanto, 1999]. However, as noted by Hargreaves [1992],\nseveral explanations have been proposed for explaining\nthe F region storm, and a comprehensive discussion of\nthese is beyond the scope of the current paper. Still, it\nshould be noted that the F region does not respond to\nHSSs in isolation. Because of the coupled nature of the\nthermosphere-ionosphere-magnetosphere system, phe-\nnomena such as drainage plume dynamics [e.g., Borovsky\nand Denton, 2006b, 2009a, 2009b], refilling of the depleted\nouter plasmasphere [e.g., Sandel and Denton, 2007], the\neffectiveness of coupling between the solar wind and the\nmagnetosphere [e.g., Russell and McPherron, 1973], and\nnumerous other processes are all likely to play a part in\nproduction\/loss, heating\/cooling, and transport processes\nwithin the F region ionosphere.\n[22] From the point of view of predicting the behavior of\nthe ionosphere, the results presented above demonstrate\nthe response of the ionosphere is repeatable and should\nbe, to some degree, predictable during HSSs. The values\nof foF2, NmF2 and hmF2 all vary within narrow bands\nwhich have been well characterized in a statistical manner.\nSince the characteristics of HSSs in the solar wind are\nreadily apparent, then predicting the real-time iono-\nspheric response following a particular high-speed stream\nFigure 5. Superposed epoch plots of the daytime (1100--1500 LT) foF2, NmF2, and hmF2\n(calculated via methods 1 and 2) for 124 HSSs between 1993 and 2006 for 4 days prior to zero epoch\nto 8 days after zero epoch.\nS04006 DENTON ET AL.: PARAMETERS IN THE F2 LAYER DURING HSSS\n7 of 10\nS04006\nwould rely on accurate identification of HSS signatures at\nsome point upstream of the Earth (e.g., by a solar wind\nmonitor such as ACE). This would lead directly to a\npredictive capability for ionospheric parameters which\nwould be of use in a number of space-weather-type\napplications (e.g., predicting the characteristic frequencies\nfor radio propagation). One could foresee that predictions\nof the ionospheric conditions for radio propagation would\nthen be directly linked to detection of HSSs at the L1 point,\nupstream of the Earth.\n4. Conclusions and Future Work\n[23] In conclusion, we note the following salient points\nregarding the implications for the midlatitude ionosphere\nof high-speed solar wind streams incident on the Earth’s\nmagnetosphere:\n[24] 1. On average, HSSs cause a sharp decrease in foF2\nand NmF2 which begins at the onset of magnetospheric\nconvection. These decreases are consistent with onset of\nan F region ionospheric storm.\n[25] 2. On average, HSSs cause an increase of \u000120 km in\nthe peak height of the midlatitude F2 layer following\nconvection onset.\n[26] 3. On average, excursions in foF2, NmF2 and hmF2\nvalues within the midlatitude ionosphere last for at least\n4 days, gradually returning to preevent levels following\nevent onset.\n[27] It is planned to extend the work carried out in this\nstudy to include ionosonde data from other stations and\nthus test whether the above conclusions hold true for the\nionosphere at varying latitude and longitude.\n[28] Acknowledgments. This work was funded under the\nEU LAPBIAT II project and the authors gratefully acknow-\nledge this support. We thank everyone who contributed to\nthe Juliusruh ionosonde data set used in this study and thank\nRichard Stamper at Rutherford Appleton Laboratory (RAL),\nUK, for providing us with the data. We thank the World Data\nCentre, C1 at RAL for the geomagnetic indices. We also thank\nthe U.S. Air Force Research Laboratory, Hanscom Air Force\nBase, Massachusetts, for providing the Midnight Boundary\nFigure 6. Superposed epoch plots of the nighttime (2300--0300 LT) foF2, NmF2, and hmF2\n(calculated via methods 1 and 2) for 124 HSSs between 1993 and 2006 for 4 days prior to zero epoch\nto 8 days after zero epoch.\nS04006 DENTON ET AL.: PARAMETERS IN THE F2 LAYER DURING HSSS\n8 of 10\nS04006\nIndex and the Danish Meteorological Institute for the Polar\nCap Index. We are grateful to Robert McPherron for provid-\ning the initial list of CIR interfaces and for useful discussions\nof HSSs and their magnetospheric consequences. M.D. would\nlike to thank the Sodankyla¨ Geophysical Observatory for\ntheir hospitality during his visit in April 2008 and would also\nlike to thank Michelle Thomsen and others in the ISR-1 group\nat Los Alamos National Laboratory for many extremely useful\ndiscussions related to high-speed solar wind streams and\nmagnetospheric physics in general. M.D. would especially\nlike to thank Joe Borovsky at LANL for insightful comments\nand suggestions in the preparation of this manuscript.\nReferences\nAkasofu, S. I., C. Olmsted, T. Saito, and T. Oki (1988), Quantitative\nforecasting of the 27-day recurrent magnetic activity, Planet. Space\nSci., 36, 1133--1147, doi:10.1016\/0032-0633(88)90068-2.\nApostolov, E. M., D. Altadill, and M. Todorova (2004), The 22-year\ncycle in the geomagnetic 27-day recurrences reflecting on the F2-layer\nionization, Ann. Geophys., 22, 1171--1176.\nBailey, G. J., M. H. Denton, R. A. Heelis, and S. Venkatraman (2000), A\nmodelling study of the latitudinal variations in the nighttime plasma\ntemperatures of the equatorial topside ionosphere during northern\nwinter at solar maximum, Ann. Geophys., 18, 1435--1446, doi:10.1007\/\ns00585-000-1435-6.\nBartels, J. (1950), 27-day variations in the F2 layer critical frequencies\nat Huancayo, J. Atmos. Terr. Phys., 1, 2 -- 12, doi:10.1016\/0021-\n9169(50)90010-9.\nBorovsky, J. E., and M. H. Denton (2006a), Differences between CME-\ndriven storms and CIR-driven storms, J. Geophys. Res., 111, A07S08,\ndoi:10.1029\/2005JA011447.\nBorovsky, J. E., and M. H. Denton (2006b), The effect of plasmaspheric\ndrainage plumes on solar-wind\/magnetosphere coupling, Geophys.\nRes. Lett., 33, L20101, doi:10.1029\/2006GL026519.\nBorovsky, J. E., and M. H. Denton (2009a), A statistical look at plasma-\nspheric drainage plumes, J. Geophys. Res., 113, A09221, doi:10.1029\/\n2007JA012994.\nBorovsky, J. E., andM.H. Denton (2009b), Relativistic-electron dropouts\nand recovery: A superposed epoch study of the magnetosphere and\nthe solar wind, J. Geophys. Res., 114, A02201, doi:10.1029\/2008JA013128.\nBorovsky, J. E., and J. T. Steinberg (2006), The ‘‘calm before the\nstorm’’ in CIR\/magnetosphere interactions: Occurrence statistics,\nsolar wind statistics, and magnetospheric preconditioning, J. Geophys.\nRes., 111, A07S10, doi:10.1029\/2005JA011397.\nBowman, G. G. (1996), The influence of the 27-day variation in the\nupper atmosphere neutral-particle density on ionospheric spread-F\noccurrence, J. Geomag. Geoelectr., 48, 1043--1057.\nBuonsanto, M. J. (1999), Ionospheric storms: A review, Space Sci. Rev.,\n88, 563--601, doi:10.1023\/A:1005107532631.\nChen, S.-H., and T. E. Moore (2008), Ionospheric ions in the near-\nEarth magnetotail, J. Geophys. Res., 113, A08232, doi:10.1029\/\n2007JA012816.\nChkhetiya, A. M. (1975), Planetary distribution of 27-day variation\nof electron concentration in maximum of F-layer of ionosphere,\nGeomagn. Aeron., 15, 160--161.\nClilverd, M. A., T. D. G. Clark, A. J. Smith, and N. R. Thomson (1993),\nObservation of a decrease in mid-latitude whistler mode signal\noccurrence prior to geomagnetic storms, J. Atmos. Terr. Phys.,\n55(10), 1479--1485, doi:10.1016\/0021-9169(93)90113-D.\nDenton, M. H., and J. E. Borovsky (2008), Superposed epoch analysis\nof high-speed-stream effects at geosynchronous orbit: Hot plasma,\ncold plasma, and the solar wind, J. Geophys. Res., 113, A07216,\ndoi:10.1029\/2007JA012998.\nDenton,M. H., and J. E. Borovsky (2009), The superdense plasma sheet\nin the magnetosphere during high-speed-stream-driven storms:\nPlasma transport and timescales, J. Atmos. Sol. Terr. Phys., in press.\nDenton, M. H., G. J. Bailey, Y. Z. Su, K.-I. Oyama, and T. Abe (1999),\nHigh altitude observations of electron temperature and a possible\nnorth\/south asymmetry, J. Atmos. Sol. Terr. Phys., 61, 775--788.\nDenton, M. H., G. J. Bailey, C. R. Wilford, A. S. Rodger, and\nS. Venkatraman (2002), He+ dominance in the plasmasphere during\ngeomagnetically disturbed periods: Part 1. Observational results,\nAnn. Geophys., 20, 461--470.\nDenton,M.H., J. E. Borovsky, R.M. Skoug,M. F. Thomsen, B. Lavraud,\nM. G. Henderson, R. L. McPherron, J. C. Zhang, andM.W. Liemohn\n(2006), Geomagnetic storms driven by ICME- and CIR-dominated\nsolar wind, J. Geophys. Res., 111, A07S07, doi:10.1029\/2005JA011436.\nDenton, M. H., J. E. Borovsky, R. B. Horne, R. L. McPherron, S. K.\nMorley, and B. T. Tsurutani (2008), High speed solar wind streams:\nA call for key research, Eos Trans. AGU, 89(7), 62--63, doi:10.1029\/\n2008EO070002.\nDudeney, J. R. (1974), A simple empirical method for estimating the\nheight and semi-thickness of the F2-layer at the Argentine Islands,\nGraham Land, Sci. Rep. 88, Br. Antarct. Surv., Cambridge, U. K.\nHapgood, M. A. (1993), A double solar-cycle in the 27-day recurrence\nof geomagnetic activity, Ann. Geophys., 11, 248--253.\nHargreaves, J. K. (1992), The Solar-Terrestrial Environment: An Introduc-\ntion to Geospace---The Science of the Terrestrial Upper Atmosphere, Iono-\nsphere, and Magnetosphere, Cambridge Univ. Press, Cambridge, U. K.\nHocke, K. (2008), Oscillations of global mean TEC, J. Geophys. Res.,\n113, A04302, doi:10.1029\/2007JA012798.\nKavanagh, A., and M. H. Denton (2007), High speed solar wind\nstreams and geospace interactions, Astron. Geophys., 48, 6.24--6.26.\nKing, J. H., and N. E. Papitashvili (2005), Solar wind spatial scales in\nand comparisons of hourly Wind and ACE plasma and magnetic\nfield data, J. Geophys. Res., 110, A02104, doi:10.1029\/2004JA010649.\nLangehesse, G. (1953), 27 day variations in the absorption of the\nD-region of the ionosphere over Singapore and Slough, J. Atmos.\nTerr. Phys., 3, 153--162, doi:10.1016\/0021-9169(53)90101-9.\nLei, J., J. P. Thayer, J. M. Forbes, E. K. Sutton, and R. S. Nerem (2008),\nRotating solar coronal holes and periodic modulation of the upper\natmosphere,Geophys. Res. Lett., 35, L10109, doi:10.1029\/2008GL033875.\nLindsay, G. M., C. T. Russell, and J. G. Luhmann (1995), Coronal mass\nejections and stream interaction region characteristics and their\npotential geomagnetic consequences, J. Geophys. Res., 100, 16,999--\n17,013, doi:10.1029\/95JA00525.\nLongden, N., M. H. Denton, and F. Honary (2008), Particle precipita-\ntion during ICME-driven and CIR-driven geomagnetic storms,\nJ. Geophys. Res., 113, A06205, doi:10.1029\/2007JA012752.\nMacDonald, E. A., M. H. Denton, M. F. Thomsen, and S. P. Gary\n(2008), Superposed epoch analysis of a whistler instability criterion\nat geosynchronous orbit during geomagnetic storms, J. Atmos. Sol.\nTerr. Phys., 70, 1789--1796, doi:10.1016\/j.jastp.2008.03.021.\nMcPherron, R. L., and J. Weygand (2006), The solar wind and geomag-\nnetic activity as a function of time relative to corotating interaction\nregions, in Recurrent Geomagnetic Storms: Corotating Solar Wind\nStreams, Geophys. Monogr. Ser., vol. 167, edited by B. T. Tsurutani et\nal., pp. 125--137, AGU, Washington, D. C.\nMcPherron, R. L., D. N. Baker, and N. U. Crooker (2009), Role of\nthe Russell-McPherron effect in the acceleration of relativistic\nelectrons, J. Atmos. Sol. Terr. Phys., in press.\nMlynczak, M. G., F. J. Martin-Torres, C. J. Mertens, B. T. Marshall,\nR. E. Thompson, J. U. Kozyra, E. E. Remsberg, L. L. Gordley, J. M.\nRussell III, and T. Woods (2008), Solar-terrestrial coupling\nevidenced by periodic behavior in geomagnetic indexes and the\ninfrared energy budget of the thermosphere, Geophys. Res. Lett.,\n35, L05808, doi:10.1029\/2007GL032620.\nOliver, W. L., S. Kawamura, and S. Fukao (2008), The causes of mid-\nlatitude F Layer behavior, J. Geophys. Res., 113, A08310, doi:10.1029\/\n2007JA012590.\nPancheva, D., R. Schminder, and J. Lastovicka (1991), 27-day fluctua-\ntions in the ionospheric D-region, J. Atmos. Terr. Phys., 53, 1145--\n1150, doi:10.1016\/0021-9169(91)90064-E.\nPiggott, W. R., and K. Rawer (Eds.) (1972), URSI Handbook of Ionogram\nInterpretation and Reduction, 2nd ed., NOAA, Asheville, N. C.\nS04006 DENTON ET AL.: PARAMETERS IN THE F2 LAYER DURING HSSS\n9 of 10\nS04006\nRich, F. J., P. J. Sultan, and W. J. Burke (2003), The 27-day variations of\nplasma densities and temperatures in the topside ionosphere,\nJ. Geophys. Res., 108(A7), 1297, doi:10.1029\/2002JA009731.\nRichards, P. G. (2001), Seasonal and solar cycle variations of the iono-\nspheric peak electron density: Comparison ofmeasurement andmod-\nels, J. Geophys. Res., 106, 12,803--12,819, doi:10.1029\/2000JA000365.\nRoble, R. G. (1977), The Upper Atmosphere and Magnetosphere, Natl.\nAcad. of Sci., Washington, D. C.\nRodger, C. J., T. Raita, M. A. Clilverd, A. Seppa¨la¨, S. Dietrich, N. R.\nThomsen, and T. Ulich (2008), Observations of relativistic electron\nprecipitation from the radiation belts driven by EMIC waves,\nGeophys. Res. Lett., 35, L16106, doi:10.1029\/2008GL034804.\nRussell, C. T., and R. L. McPherron (1973), Semiannual variation of\ngeomagnetic activity, J. Geophys. Res., 78, 92 -- 108, doi:10.1029\/\nJA078i001p00092.\nSandanger, M. I. J., F. Søraas, M. Sørbø, K. Aarsnes, K. Oksavik, and\nD. S. Evans (2009), Relativistic electron losses related to EMIC\nwaves during CIR and CME storms, J. Atmos. Sol. Terr. Phys.,\ndoi:10.1016\/j.jastp.2008.07.006, in press.\nSandel, B. R., and M. H. Denton (2007), Global view of refilling of\nthe plasmasphere, Geophys. Res. Lett., 34, L17102, doi:10.1029\/\n2007GL030669.\nShimazaki, T. (1955), World-wide variations in the height of the\nmaximum electron density of the ionospheric F2 layer, J. Radio\nRes. Lab. Jpn., 2, 85--97.\nSummers, D., and R. M. Thorne (2003), Relativistic electron pitch-\nangle scattering by electromagnetic ion cyclotron waves during\ngeomagnetic storms, J. Geophys. Res., 108(A4), 1143, doi:10.1029\/\n2002JA009489.\nTemmer,M., B. Vrsˇnak, andA.M. Veronig (2007), Periodic appearance\nof coronal holes and the related variation of solar wind parameters,\nSol. Phys., 241, 371--383, doi:10.1007\/s11207-007-0336-1.\nThayer, J. P., J. Lei, J. M. Forbes, E. K. Sutton, and R. S. Nerem (2008),\nThermospheric density oscillations due to periodic solar wind high-\nspeed streams, J. Geophys. Res., 113, A06307, doi:10.1029\/2008JA013190.\nThomsen, M. F. (2004), Why Kp is such a good measure of magneto-\nspheric convection, Space Weather, 2, S11004, doi:10.1029\/\n2004SW000089.\nThomsen, M. F., M. H. Denton, B. Lavraud, and M. Bodeau (2007),\nStatistics of plasma fluxes at geosynchronous orbit over more than a\nfull solar cycle, Space Weather, 5, S03004, doi:10.1029\/2006SW000257.\nTroshichev, O. A., V. G. Andrezen, S. Vennerstrøm, and E. Friis-\nChristensen (1988), Magnetic activity in the polar cap: A new index,\nPlanet. Space Sci., 36, 1095--1102, doi:10.1016\/0032-0633(88)90063-3.\nTsurutani, B. T., et al. (2006), Corotating solar wind streams and\nrecurrent geomagnetic activity: A review, J. Geophys. Res., 111,\nA07S01, doi:10.1029\/2005JA011273.\nTurner, N. E., E. J. Mitchell, D. J. Knipp, and B. A. Emery (2006),\nEnergetics of magnetic storms driven by corotating interaction\nregions: A study of geoeffectiveness, in Recurrent Geomagnetic Storms:\nCorotating Solar Wind Streams, Geophys. Monogr. Ser., vol. 167, edited\nby B. T. Tsurutani et al., pp. 113--124, AGU, Washington, D. C.\nUlich, T. (2000), Solar variability and long-term trends in the iono-\nsphere, Ph.D. thesis, Oulu Univ. Press, Oulu, Finland.\nWatari, S. (1997), The effect of the high-speed stream following the\ncorotating interaction region on the geomagnetic activities, Ann.\nGeophys., 15, 662--670, doi:10.1007\/s00585-997-0662-5.\n\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\u0002\nM. H. Denton, Department of Communication Systems, Lancaster\nUniversity, Lancaster LA1 4WA, UK. (m.denton@lancaster.ac.uk)\nE. Turunen and T. Ulich, Sodankyla¨ Geophysical Observatory,\nTa¨htela¨ntie 62, FIN-99600 Sodankyla¨, Finland.\nS04006 DENTON ET AL.: PARAMETERS IN THE F2 LAYER DURING HSSS\n10 of 10\nS04006\n"}