{"doi":"10.1080\/01436597.2011.543816","coreId":"218518","oai":"oai:eprints.lse.ac.uk:33741","identifiers":["oai:eprints.lse.ac.uk:33741","10.1080\/01436597.2011.543816"],"title":"The 'other diseases' of the millennium development goals: rhetoric and reality of free drug distribution to cure the poor's parasites","authors":["Allen, Tim","Parker, Melissa"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2011-02","abstract":"The sixth MDG aims 'to combat HIV\/AIDS, TB, malaria and other diseases'. The residual category of 'other diseases' has become the focus of intense interest, partly because it has provided an opportunity to increase resources for the control of the mostly parasitic 'neglected tropical diseases' (NTDs). Intense lobbying has secured large amounts of funding from donors, as well as generous donations of medicines from the major drug companies. A massive programme is now underway to treat the parasites of the poor in Africa via integrated vertical interventions of mass drug administration in endemic areas. The approach has been hailed as remarkably effective, with claims that there is now a real prospect of complete control and, for some NTDs, even elimination. However, a closer look at evaluation and research data reveals that much less is known about what is being achieved than is suggested. Competition between implementing organisations is leading to potentially counterproductive exaggerations about treatment coverage. Detailed local-level research in Uganda and Tanzania shows that actual rates of drug take-up among target populations are often lower than is necessary to effectively control the diseases, and that methods of drug distribution may even lead to active resistance to treatment. If current trends are not corrected, declining rates of NTD infection will not be sustained. Much more rigorous and effective monitoring is essential","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/218518.pdf","fullTextIdentifier":"http:\/\/eprints.lse.ac.uk\/33741\/1\/Allen_Parker_Other-diseases-of-millennium-development-goals_2011.pdf","pdfHashValue":"cc2f76264f68cf85a30109cf205ad18a7f7a10fd","publisher":"Routledge","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.lse.ac.uk:33741<\/identifier><datestamp>\n      2014-12-19T09:26:55Z<\/datestamp><setSpec>\n      74797065733D4445505453:4C53452D44455354<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:relation>\n    \n      \n        http:\/\/eprints.lse.ac.uk\/33741\/<\/dc:relation><dc:title>\n        The 'other diseases' of the millennium development goals: rhetoric and reality of free drug distribution to cure the poor's parasites<\/dc:title><dc:creator>\n        Allen, Tim<\/dc:creator><dc:creator>\n        Parker, Melissa<\/dc:creator><dc:subject>\n        HN Social history and conditions. Social problems. Social reform<\/dc:subject><dc:subject>\n        RA Public aspects of medicine<\/dc:subject><dc:description>\n        The sixth MDG aims 'to combat HIV\/AIDS, TB, malaria and other diseases'. The residual category of 'other diseases' has become the focus of intense interest, partly because it has provided an opportunity to increase resources for the control of the mostly parasitic 'neglected tropical diseases' (NTDs). Intense lobbying has secured large amounts of funding from donors, as well as generous donations of medicines from the major drug companies. A massive programme is now underway to treat the parasites of the poor in Africa via integrated vertical interventions of mass drug administration in endemic areas. The approach has been hailed as remarkably effective, with claims that there is now a real prospect of complete control and, for some NTDs, even elimination. However, a closer look at evaluation and research data reveals that much less is known about what is being achieved than is suggested. Competition between implementing organisations is leading to potentially counterproductive exaggerations about treatment coverage. Detailed local-level research in Uganda and Tanzania shows that actual rates of drug take-up among target populations are often lower than is necessary to effectively control the diseases, and that methods of drug distribution may even lead to active resistance to treatment. If current trends are not corrected, declining rates of NTD infection will not be sustained. Much more rigorous and effective monitoring is essential.<\/dc:description><dc:publisher>\n        Routledge<\/dc:publisher><dc:date>\n        2011-02<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:language>\n        en<\/dc:language><dc:rights>\n        cc_by<\/dc:rights><dc:identifier>\n        http:\/\/eprints.lse.ac.uk\/33741\/1\/Allen_Parker_Other-diseases-of-millennium-development-goals_2011.pdf<\/dc:identifier><dc:identifier>\n          Allen, Tim and Parker, Melissa  (2011) The 'other diseases' of the millennium development goals: rhetoric and reality of free drug distribution to cure the poor's parasites.  Third World Quarterly, 32 (1).  pp. 91-117.  ISSN 0143-6597     <\/dc:identifier><dc:relation>\n        http:\/\/www.tandfonline.com\/toc\/ctwq20\/current<\/dc:relation><dc:relation>\n        10.1080\/01436597.2011.543816<\/dc:relation><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":null,"relations":["http:\/\/eprints.lse.ac.uk\/33741\/","http:\/\/www.tandfonline.com\/toc\/ctwq20\/current","10.1080\/01436597.2011.543816"],"year":2011,"topics":["HN Social history and conditions. Social problems. Social reform","RA Public aspects of medicine"],"subject":["Article","PeerReviewed"],"fullText":"  \nTim Allen and Melissa Parker \nThe 'other diseases' of the millennium \ndevelopment goals: rhetoric and reality of \nfree drug distribution to cure the poor's \nparasites \n \nArticle (Published version) \n(Refereed) \n \n \n \n \nOriginal citation: \nAllen, Tim and Parker, Melissa (2011) The 'other diseases' of the millennium development goals: \nrhetoric and reality of free drug distribution to cure the poor's parasites. Third World Quarterly, \n32 (1). pp. 91-117. ISSN 0143-6597  DOI: 10.1080\/01436597.2011.543816  \n \n© 2011 The Authors. Published by Taylor & Francis. \n \nOpen Access article distributed under the terms of the Creative Commons Attribution License \nCC-BY 3.0 \n \nThis version available at: http:\/\/eprints.lse.ac.uk\/33741\/ \nAvailable in LSE Research Online: December 2014 \nThis article was downloaded by: [LSE Library Services]\nOn: 19 December 2014, At: 01:11\nPublisher: Routledge\nInforma Ltd Registered in England and Wales Registered Number: 1072954 Registered office:\nMortimer House, 37-41 Mortimer Street, London W1T 3JH, UK\nThird World Quarterly\nPublication details, including instructions for authors and subscription\ninformation:\nhttp:\/\/www.tandfonline.com\/loi\/ctwq20\nThe ‘Other Diseases’ of the Millennium\nDevelopment Goals: rhetoric and reality\nof free drug distribution to cure the poor's\nparasites\nTim Allen a & Melissa Parker b\na Department of International Development , London School of Economics ,\nHoughton Street , London WC1 , UK\nb Centre for Research in International Medical Anthropology, Brunel\nUniversity , Uxbridge , UK\nPublished online: 23 Feb 2011.\nTo cite this article: Tim Allen & Melissa Parker (2011) The ‘Other Diseases’ of the Millennium Development\nGoals: rhetoric and reality of free drug distribution to cure the poor's parasites, Third World Quarterly, 32:1,\n91-117, DOI: 10.1080\/01436597.2011.543816\nTo link to this article:  http:\/\/dx.doi.org\/10.1080\/01436597.2011.543816\nPLEASE SCROLL DOWN FOR ARTICLE\nTaylor & Francis makes every effort to ensure the accuracy of all the information (the “Content”)\ncontained in the publications on our platform. Taylor & Francis, our agents, and our licensors make\nno representations or warranties whatsoever as to the accuracy, completeness, or suitability for\nany purpose of the Content. Versions of published Taylor & Francis and Routledge Open articles and\nTaylor & Francis and Routledge Open Select articles posted to institutional or subject repositories\nor any other third-party website are without warranty from Taylor & Francis of any kind, either\nexpressed or implied, including, but not limited to, warranties of merchantability, fitness for a\nparticular purpose, or non-infringement. Any opinions and views expressed in this article are\nthe opinions and views of the authors, and are not the views of or endorsed by Taylor & Francis.\nThe accuracy of the Content should not be relied upon and should be independently verified with\nprimary sources of information. Taylor & Francis shall not be liable for any losses, actions, claims,\nproceedings, demands, costs, expenses, damages, and other liabilities whatsoever or howsoever\ncaused arising directly or indirectly in connection with, in relation to or arising out of the use of the\nContent.\n \nThis article may be used for research, teaching, and private study purposes. Terms & Conditions of\naccess and use can be found at http:\/\/www.tandfonline.com\/page\/terms-and-conditions\n \nIt is essential that you check the license status of any given Open and Open Select article\nto confirm conditions of access and use.\nThe ‘Other Diseases’ of the\nMillennium Development Goals:\nrhetoric and reality of free drug\ndistribution to cure the poor’s\nparasites\nTIM ALLEN & MELISSA PARKER\nABSTRACT The sixth MDG aims ‘to combat HIV\/AIDS, TB, malaria and other\ndiseases’. The residual category of ‘other diseases’ has become the focus of\nintense interest, partly because it has provided an opportunity to increase\nresources for the control of the mostly parasitic ‘neglected tropical diseases’\n(NTDs). Intense lobbying has secured large amounts of funding from donors, as\nwell as generous donations of medicines from the major drug companies. A\nmassive programme is now underway to treat the parasites of the poor in Africa\nvia integrated vertical interventions of mass drug administration in endemic\nareas. The approach has been hailed as remarkably effective, with claims that\nthere is now a real prospect of complete control and, for some NTDs, even\nelimination. However, a closer look at evaluation and research data reveals that\nmuch less is known about what is being achieved than is suggested. Competition\nbetween implementing organisations is leading to potentially counterproductive\nexaggerations about treatment coverage. Detailed local-level research in\nUganda and Tanzania shows that actual rates of drug take-up among target\npopulations are often lower than is necessary to effectively control the diseases,\nand that methods of drug distribution may even lead to active resistance to\ntreatment. If current trends are not corrected, declining rates of NTD infection\nwill not be sustained. Much more rigorous and effective monitoring is essential.\nThe sixth Millennium Development Goal (MDG) refers to a vague, residual\ncategory. It aims ‘to combat HIV\/AIDS, TB, malaria and other diseases’.\n‘Other diseases’ is a label that quickly became the focus of intense lobbying,\nTim Allen is in the Department of International Development, London School of Economics, Houghton\nStreet, London WC1, UK. Email: t.allen@lse.ac.uk.\nMelissa Parker is at the Centre for Research in International Medical Anthropology, Brunel University,\nUxbridge, UK.\nThird World Quarterly, Vol. 32, No. 1, 2011, pp 91–117\nISSN 0143-6597 print\/ISSN 1360-2241 online\/11\/010091–27\nDOI: 10.1080\/01436597.2011.543816 91\n\u0001 201 The Author(s). Published by Taylor & Francis.\nThis is an Open Access article distributed under the terms of the Creative Commons Attribution License http:\/\/creativecom-\nmons.org\/licenses\/by\/3.0\/, which permits unrestricted use, distribution, and reproduction in any medium, provided the original\nwork is properly cited. The moral rights of the named author(s) have been asserted.\n1        \nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nbecause capturing it would almost certainly guarantee a huge surge of\nfunding. By the mid 2000s a group of determined and passionate activists had\nclearly won the day. They had shrewdly pooled their resources and networks\nto claim that ‘one of the most convincing ways to make poverty history’ was\nto control a group of infections referred to as the neglected tropical diseases\nor ‘NTDs’.1 In 2005 the UN Millennium Project published a set of ‘Quick\nWin’ interventions that were devised to deliver rapid results in attaining the\nMDGs; an aspect of NTD control was highlighted as one of the most important\nlow-hanging fruits.\nCampaigners have tended to use the NTD acronym as though it\nencapsulates a clearly defined and homogenous problem. It actually refers\nto a diverse range of afflictions, mostly parasitic, which have historically been\nendemic in large parts of the world. So successful has the NTD-control\nmovement been that we now have remarkable claims being taken seriously.\nSachs and Sachs, for example, tell us that ‘Controlling the NTDs is nothing\nless than healing the world’,2 while Hotez and Thompson have published a\npaper called ‘Waging peace through neglected tropical diseases: a US foreign\npolicy for the bottom billion’ in a respected medical journal.3\nMore soberly Hotez has explained that the NTDs are among the most\ncommon infections of the poor. He estimates that one in four of the world’s\npoorest people are infected with soil-transmitted helminths; one in 10 with\nschistosomiasis; one in 20 with lymphatic filariasis and trachoma; and one in\n50 with onchocerciasis. In total, he suggests, 1.1 billion of the world’s 2.7\nbillion people living on less that US$2 per day are infected with one or more\nNTDs, and when the global disease burden of the most prevalent NTDs is\ncombined, the disability they cause rivals that of any of the big three.4 He and\nhis research colleagues have elaborated this latter point in studies comparing\nthe total number of disability-adjusted life years (DALYs), that have been lost\nfrom either premature death or disability from NTDs as opposed to HIV\/AIDS,\nmalaria and TB. By their calculations, NTDs collectively account for more lost\nDALYs than either malaria or TB.5\nThe argument that developing integrated NTD control programmes is a\ncost-effective way forward was found to be particularly compelling. A key\npaper, published in 2005, was co-authored by three of the most prominent\nlong-term advocates of mass drug administration: David Molyneux of the\nLiverpool School of Tropical Medicine, Peter Hotez of the Sabin Vaccine\nInstitute in Washington (who has already been mentioned above) and Alan\nFenwick of London’s Imperial College.6 The paper argued that it is possible\nfor public–private partnerships to develop integrated control programmes for\nseven major NTDs in Africa with only four drugs (albendazole, ivermectin,\npraziquantel and azithromycin) at an estimated cost of $0.40 per person per\nyear. It went on to suggest that if $200 million could be spent each year for\nfive years, it would be possible to treat 500 million individuals. This, in turn,\nwould contribute to current strategies to alleviate poverty among the poorest\nand most marginal people in the world. By way of contrast, it was also\npointed out that it costs $200 each year to treat one person with HIV\/AIDS in\nAfrica; a further $200 to treat an individual with TB; and $7–$10 to treat each\nTIM ALLEN & MELISSA PARKER\n92\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nbout of malaria. The case to support these ‘rapid impact interventions’ was\nstronger still, it was argued, considering the fact that there are millions of\npeople in Africa who are infected with a variety of parasitic infections, but\nwho do not suffer from HIV, TB or malaria.\nIn sum, those promoting NTD control argued that it represents one of the\nmost efficient and cost-effective means of achieving the MDGs in the areas of\nchild and maternal health, infectious diseases and poverty reduction. It could\nalso be a means of building global partnerships, and ‘a step forward in achi-\neving international human rights’.7 The first WHO global report on\nNTDs, published in 2010, reiterates these points. In the foreword the Director\nGeneral claims that NTDs ‘weaken impoverished populations, frustrate the\nachievement of the health-relatedMillenniumDevelopment Goals and impede\nglobal development outcomes . . . The logic has changed: instead of waiting for\nthese diseases to gradually disappear as countries develop and living conditions\nimprove, a deliberate effort to make them disappear is now viewed as a route to\npoverty alleviation that can itself spur socioeconomic development’.8\nIn many ways this has been a remarkable and positive change in thinking\nabout global public health. Thirty years ago there was very little funding or\nsupport for the control of tropical parasitic infections other than malaria.\nIndeed, there was not even much interest in the medical profession outside a\nsmall coterie of specialists. It must come as something of a surprise to such\npeople that the World Health Organisation (WHO) now claims that treatment\nof these diseases has always been one of its main priorities.\nNTDs mostly affect politically marginal populations in parts of the world\nthat are of little strategic or commercial interest to rich countries. Although\nthere have been important exceptions, in general, when attempted at all,\ndisease control has concentrated on more economically significant places,\nsuch as the Gezira\/Managil irrigation region of Sudan. Some veterans of\ncombating NTDs, like Alan Fenwick, were involved in those programmes\nand, whatever their status in the countries concerned, they may well have felt\nlike voices in the wilderness when they attempted to highlight the importance\nof what they were doing on the global stage.9 Not now.\nA 2009 report to an All-Party Parliamentary Group in the UK posed the\nquestion: ‘The Neglected Tropical Diseases: a challenge we could rise to—\nwill we?’. The consensus, it seems, was by then already a resounding ‘yes’.\nSince 2004 the Gates Foundation has allocated more than $46 million to NTD\ncontrol, but this has been dwarfed by the amounts allocated from the US aid\nprogramme. US Agency for International Development (USAID) funding will\nreach $350 million by 2013. The UK’s aid programme has also been caught\nup in the enthusiasm, allocating £50 million by 2010. Compared with what\nhas been available in the past, these are extraordinary amounts of money,\nand substantial further resources are on their way. At a meeting on NTDs in\nGeneva on 14 October 2010 huge commitments were pledged by donors,\nincluding massive quantities of drugs. GlaxoSmithKline, for example, is now\ncommitted to donating a billion albendozole tablets per year to treat school-\naged children in Africa. Other drug companies, including Merck, Eisai,\nSanofi-Aventis and Johnson&Johnson, have been almost as generous.\nTHE OTHER DISEASES OF THE MDGS\n93\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nSo what exactly are these formerly ignored infections that have become the\nnot-so-neglected tropical diseases? Can they really be so readily controlled,\nand what has been achieved so far? Our answer to the latter two questions is\nthat, perhaps not surprisingly, things are very much more complicated than is\nclaimed.\nControlling the NTDs\nThe five most common neglected tropical diseases and disease groups are:\nlymphatic filariasis (otherwise known as elephantiasis), onchocerciasis (river\nblindness), soil-transmitted helminths (intestinal parasitic worms such as\nhookworm, ascaris and trichuris), schistosomiasis (bilharzia) and trachoma.\nOther infectious diseases that are increasingly referred to as NTDs, no doubt\nin part to jump on the bandwagon and secure resources for treatment,\ninclude: African trypanosomiasis; chagas disease; dengue fever; leishmania-\nsis, leprosy; cysticercosis; dracunculiasis (guinea-worm disease); echinococ-\ncosis and foodborne trematode infections. These are all debilitating afflictions\nand, in some instances, can prove fatal. Those who are also infected with HIV\/\nAIDS and\/or TB and malaria are more likely to suffer the severe consequences\nof one or more of these infections more quickly.\nIt is important to note, however, that the figures cited above about the\nspecific number of people affected by different NTDs and the data used in\ncalculating DALYs can be little more than ‘guesstimates’. Robust demo-\ngraphic and epidemiological data are only now beginning to be collected\nsystematically and still remain surprisingly sparse—a point we discuss below.\nNevertheless, it is irrefutable that a large proportion of the world’s most\ndeprived and marginalised people are infected with one or more NTD.\nAccording to the first WHO global report on NTDs, which collates evidence\nfrom multiple sources, NTDs are endemic in 149 countries and territories,\nwith 30 of these being endemic for six or more NTDs. As the report\nemphasises, these afflictions are associated with ‘substandard housing, lack of\naccess to safe water and sanitation, filthy environments, and abundant insects\nand other vectors’.10 Even though it is not only the poor who catch them, it is\nthe poor who are more likely to be exposed to them. The poor have also had\nlittle prospect of securing curative therapy, and in places where symptoms are\nunchecked, the sight of numerous individuals suffering the consequences is\nnot something easily forgotten. There are very good reasons why long-term\nprotagonists like Molyneux, Hotez and Fenwick have remained so\ncommitted to NTD control, and why people like Narcis Kabaterine, the\nhead of vector control at the Ministry of Health in Uganda—recently\nhailed as the ‘Unsung Hero of Neglected Tropical Diseases’11—have\ndedicated their professional lives to the cause with such enthusiasm.\nIn the context of growing interest and concern about these diseases, linked\nto the possibilities of substantial funding under the auspices of the MDGs, a\nnew approach has been initiated, dwarfing previous efforts to control\nparasitic infections among impoverished populations. In its 2010 report on\nNTDs, the WHO claims to have pioneered this paradigm shift in 2003. It\nTIM ALLEN & MELISSA PARKER\n94\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nasserts that the process was led by the former Director General and ‘involved\nan important strategic change, from a traditional approach centred on\ndiseases to one responding to the health needs of marginalized commu-\nnities’.12 This is a very odd way of accounting for what happened—one that\nseems to ignore the history of global primary health care policy dating back\nto the 1970s, in which WHO itself has played an important role.\nAlso, far from being any sort of grassroots initiative, what was actually\nbeing promoted was a reorientation of vertical biomedical interventions\ntowards parasitic and other diseases for which there were potentially cheap,\nsafe and effective cures. There was plenty of talk about comprehensive\nsolutions to improve the overall well-being of target populations but the\npriority was clear. It was to undertake mass drug administration on a vast\nscale. One aspect of the enthusiastic response to the approach was that, while\nmedical professionals were struggling to find a viable clinical response to the\nHIV\/AIDS pandemic, here was a rapidly evolving and increasingly well\nresourced strategic plan to combat dreadful sicknesses by supporting or\nadapting existing medical systems and using readily available treatments.\nIn 2008 Molyneux, Hotez and Fenwick joined forces to throw the cat\namong the pigeons with a paper in an open access medical journal. They called\nfor a new Global Fund to fight NTDs, and argued that ‘there are 740 million\nAfricans who are not infected with HIV\/AIDS; they deserve a slice of the\navailable interventions’.13 One of their co-authors was Lorenzo Savioli, of the\nWHO, and the paper proposed that the new fund could be overseen by a board\nutilising the WHO’s technical resources. However, the proposal was also a\npotential threat to entrenched interests, and was by no means popular with all\nstaff within the WHO. The institution had been largely sidelined by the setting\nup of the Global Fund for HIV\/AIDS, Malaria and TB, and there were concerns\nabout yet another big competitor. It may be for this reason that the WHO has\nnow attempted to assert—or reassert—the initiative with its 2010 NTD report.\nA sense of the stakes involved can be gleaned from the wording of a five-year\nWHO strategic plan for NTD control, dated August 2010, but circulated for\nsome time internally. A highlighted component of the plan is ‘strengthening\npartnerships for NTD control at all levels and repositioning WHO as the\npreferred partner.’14 In short, there is much more going on at the moment\nthan the straightforward presentation of evidence about NTD control.\nLeaving aside overblown assertions about the ways in which NTD control\ncan resolve the world’s problems, as well as rhetoric about mass drug\nadministration going hand in hand with a broad range of poverty alleviation\nmeasures, the strategy that is really being promoted by the WHO, its partners\nand competitors is the massive roll out of drugs to people living in areas\nwhere NTDs are endemic. The strategy is based on three key ideas. First,\nsignificant reductions in overall child and adult mortality and morbidity can\nbe achieved in poor countries, if relatively small proportions of public health\nfinance directed towards the control of HIV\/AIDS, TB and malaria are\nredirected towards the integrated control of certain parasitic infections.\nSecond, there are a number of drugs with a proven track record of success\nwhich can be cheaply manufactured and easily administered to populations\nTHE OTHER DISEASES OF THE MDGS\n95\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \naffected by these NTDs. Third, it is more economical to administer the drugs\nas one integrated, top-down, biomedical intervention, rather than through\nmultiple vertical structures running side-by-side. The main focus is sub-\nSaharan Africa, where the targeted NTDs are known to be widespread and the\npopulation most impoverished.\nAgainst this background, several countries—including those in which we\nhave been researching, namely Uganda and Tanzania—are developing\nnational programmes for NTD control that scale up and aim to integrate\nvertical treatment procedures. Drugs for selected diseases or groups of\ndiseases—notably schistosomiasis, onchocerciasis, lymphatic filariasis, soil-\ntransmitted helminths and trachoma—have been provided to ministries of\nhealth. These programmes attempt to treat school-age children and adults\nliving in endemic areas, free of charge, on a regular basis. In accordance with\nthe World Health Assembly’s Global Targets, an endeavour is made to treat\nhigh percentages of the population en masse, without first testing individuals\nto see if they are infected. For example, 75 per cent of at-risk populations are\nsupposed to be treated for schistosomiasis, soil-transmitted helminths and for\nlymphatic filariasis. This is considered ethical, because the drugs are deemed\nsafe, apart from possible short-term side-effects, and it is much less expensive\nto provide drugs to everyone in endemic locations than to set up and sustain\ndiagnostic facilities.\nThe donated drugs are distributed from the headquarters of ministries of\nhealth to staff employed at a district level. These staff then take responsibility\nfor mobilising and training school teachers and drug distributors at village\nlevel who, in turn, are given responsibility for handing out drugs to all\nchildren and adults living in areas where the diseases are endemic. In many\nlocations it is expected that populations will be infected with a combination\nof NTDs. In these places multiple treatments are given at the same time, or\nstaggered through the year if the treatment protocols require it (such as when\nthere may be possible health risks in taking particular drug combinations).\nTo give an idea of the scale of these operations, in Uganda enough\nalbendazole and praziquantel tablets have been provided to treat some 0.4\nmillion, 1.2 million, three million, 1.5 million and 1.8 million people for\nschistosomiasis and soil-transmitted helminthiases in 2003, 2004, 2005, 2006\nand 2007, respectively.15 Since 2007 there has been further expansion, as US\nfunding has come on stream. According to USAID’s implementing agency, RTI\nInternational, in the third year of their support for programme implementa-\ntion 27 656 133 treatments were supposedly administered to 13 687 841\npeople potentially infected with targeted NTDs in 72 districts.16\nGiven the large quantity of resources being provided for these programmes\nand the needs of those involved in running them to sustain support by\nproducing results, it is perhaps predictable that assessments of what might be\nachieved and what has been achieved tend to be very positive.17 The 2010\nWHO report on NTDs adopts a similar tone. Towards the start the report\nnotes there are ‘challenges that will have to be faced if the current\nachievements in NTD prevention and control are to be sustained and\nextended’,18 but there is scant mention of those challenges in the pages that\nTIM ALLEN & MELISSA PARKER\n96\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nfollow. It is claimed that 670 million people had been reached with preventive\nchemotherapy by the end of 2008, and that for some diseases there is a\nprospect of elimination by 2020. As the current Director-General of WHO\nstates in her foreword, ‘the overall message is overwhelmingly positive’.\nHowever, there is a growing body of research which suggests that the\ncurrent approach to distributing drugs for NTDs is facing serious problems.\nThis is not a homogeneous critique, and many of those who have raised\nconcerns are among those who have been most committed to control of\nAfrica’s parasitic diseases over the long term. For example, the hazards of\nrelying upon unpaid volunteers to distribute tablets at the village level has\nbeen raised by several authors,19 while others draw attention to the point that\ncurrent endeavours to ‘integrate’ vertical control programmes may lead to\nthe development of a parallel health-delivery system, with potentially serious\nconsequences for ministries of health.20 A related concern is raised by\nUtzinger et al, who question the sustainability of control programmes that\nrely so heavily upon preventive chemotherapy.21 Parker et al draw attention\nto a different set of issues by suggesting that it is mistaken for policy makers\nand public health practitioners to assume that populations receiving drugs,\nfree of charge, will necessarily understand or agree with the rationale for\nmass treatment. Instead, free treatment may be actively resisted.22 Finally, a\nnumber of authors have highlighted limits in knowledge surrounding the\nsafety and efficacy of combining drugs for some NTDs, and the consequences\nof repeated treatments over many years.23\nThere is no space here to discuss all these points in detail but, in the light of\nclaims made in the first WHO global report on NTDs, we draw on our research\nin Uganda and Tanzania to comment on some of them. On page 10 of the\nreport, Brock Chisholm, the WHO’s first Director-General, is quoted from\nsomething he wrote in 1951:\nToo often countries requesting assistance have been the object of well-meaning\nbut disastrous attempts to superimpose on the local culture foreign patterns\nwhich, lacking the necessary foundations, are bound to result in friction,\nmisunderstanding and ultimate failure. In health work, as in all other fields of\ntechnical assistance, there can be no question of simply transplanting\ntechniques from one place to another.\nYet transplanting techniques is, of course, what the new agenda for mass\ndrug administration to control NTDs is about. Indeed, the 2010 WHO report is\nall about doing it. Our research findings, while by no means all negative,\nindicate that Chisholm’s warnings remain highly relevant.\nMisleading and partial monitoring and evaluation\nIn February 2010 an editorial appeared in a well known medical journal:\nThe results of this evaluation do not match with the extravagant claims . . .\nmade about the programme . . . Evaluation must now become the top priority in\nglobal health . . . complacency is damaging the global health movement.\nTHE OTHER DISEASES OF THE MDGS\n97\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nWithout proper monitoring and accountability, countries and donors—and\ntaxpayers—have no idea whether or how their investments are working. A lack\nof knowledge about whether aid works undermines everyone’s confidence in\nglobal health initiatives, and threatens the great progress so far made in\nmobilizing resources and political will for health programmes in low-income\nand middle-income countries . . . Evaluation matters . . . It’s time that the global\nhealth community embraced rather than evaded this message.24\nThese excoriating points in the Lancet were directed at UNICEF, in relation to\nthe agency’s accelerated Child Survival and Development programme. But\nidentical observations might soon have to be made about the current target-\nobsessed approach to drug distribution for NTD control. Monitoring and\nevaluation are systematically inadequate. In large part this is a product of the\nperceived need to sustain funding by over-stating achievements. It is\ncompounded by the competing claims of institutions, including academic\nones, seeking to secure a leading role in what is happening. A consequence is\nthat the rhetoric of mass drug administration for the control of NTDs is in\ndanger of moving ever further from the reality, and there will be a backlash.\nIt is, of course, not the first time this has happened. There are striking\nsimilarities with UNICEF’s selective primary health care campaigns in the\n1980s, which were shown to have inflated coverage data on a large scale. This\nperhaps helps explains the irritation in the Lancet’s reaction to UNICEF’s\nmore recent exaggerations. In recent years somewhat similar concerns have\nbeen raised in detailed studies of immunisation coverage in West Africa,25\nand of the control of tuberculosis in Nepal.26 However, it is fair to say that\nthe problems with respect to rapidly expanding NTD treatment are on a\nparticularly large scale.\nIn both Tanzania and Uganda we were surprised by the paucity of\nepidemiological data available. For example, information documenting the\nprevalence of selected NTDs had been collected at some sites, but not\nsystematically, or rarely in a manner whereby the results could be drawn\nupon to help evaluate the overall effects of treatment with any confidence. In\nseveral instances it was unclear how the sample group had been selected or\nwhy a site or sample population was selected in one year but then ignored in\nsubsequent years. In other instances data were collected from the same place\nover time, but proved difficult to analyse, because there was so much\nfluctuation in rates of infection and conjecture as to whether or not mass\ntreatment had occurred between the collection of samples. We found that it\nsimply was not a priority to ascertain overall rates of infection or to observe\nhow these change over time.\nTo give one example, when we showed results from a report we had located\nin Kampala, Uganda to district medical staff in Moyo District, they said they\nhad never seen them before and were unable to make sense of the data\npresented. One senior district official explained that we should not draw any\nconclusions from the various bits of prevalence data we had uncovered,\nbecause no one knew how they had been collected or how big the sample had\nbeen. He also said that data were being manipulated by politicians, because\nTIM ALLEN & MELISSA PARKER\n98\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nthey were making arguments about the number of people resident in the\ndistrict for funding purposes. Exactly how this might affect disease\nprevalence data was unclear, but it gives a good idea of attitudes. It should\nbe added that we subsequently carried out a small amount of testing for\nschistosomiasis and soil-transmitted helminths in endemic parts of the district\ntogether with some of our medically trained students and the district vector\ncontrol office. It was not particularly difficult to organise, and the vector\ncontrol officer himself was very enthusiastic about doing it with us. It seems\nreasonable to ask why it had not been done before on a regular basis.\nEqually difficult to interpret are reports documenting the uptake of drugs.\nAgain, it is often unclear how the summary data have been produced at a\ndistrict level, let alone nationally. One striking example were data documenting\nthe uptake of drugs for the treatment of lymphatic filariasis and soil-\ntransmitted helminths in Muhesa district, Tanga region, Tanzania. A report\nprepared at district headquarters showed that take up was 100 per cent. We\nasked how this was possible, given the guidelines at the time, which specified\nthat pregnant women should not be given the drugs. No one was able to give an\nexplanation of where the 100 per cent rate had come from.\nIn Tanzania, in particular, we found a persistent practice of increasing\ntreatment numbers as reporting was passed up though the system. In the\nabove mentioned example, the records at a more local level had sometimes\nbeen well kept, and corroborated results from our own take-up surveys. Far\nfrom being 100 per cent, actual take up was much lower. At all sites it was\nbelow the 75 per cent target and, at many sites, far below it. At some\nlocations it was less than 30 per cent (see below for details). Interestingly,\neven where the take-up of drugs was found to be good, there was still a\ntendency to inflate numbers. In Ukerewe Island, for example, the uptake of\ndrugs among school children for the treatment of S.mansoni and soil-\ntransmitted helminths ranged from 60 per cent to 78 per cent at the 16\nschools studied. Nine of the schools reported these data accurately. The other\nseven inflated them. Thus, 61 per cent in one case became 96 per cent, and\n70 per cent in another became 100 per cent. Even a school that achieved one\nof the highest rates of take-up felt the need to increase the reported take-up\nof drugs from 79 per cent to 92 per cent.\nIn Uganda there was less pressure within the national health system to\nover-report in this way, although we came across examples of this happening\nin Nebbi and Buliisa districts, northwestern Uganda. More of a problem in\nUganda is the fact that good local-level record keeping is much more\nunusual, and this has been compounded by the proliferation of drug registers\nand changes in the combinations of drugs administered simultaneously. In\nthe past couple of years the situation has deteriorated, because the USAID-\nfunded organisation, RTI International, has introduced a new kind of register\nfor all targeted NTDs. It is meant to replace the previous register documenting\nthe uptake of drugs for schistosomiasis and soil-transmitted helminiths, as\nwell as the register documenting the uptake of drugs for onchocerciasis and\/\nor lymphatic filariasis. In Moyo district in 2009, for example, numerous\ndistributors were found to have multiple registers in their possession for\nTHE OTHER DISEASES OF THE MDGS\n99\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \ndifferent combinations of NTDs, as well as the new USAID\/RTI registers. They\nhad, unsurprisingly, become confused as to when to use which register. A few\nof the most conscientious were found to have abandoned the effort to use any\nof them properly, and to be keeping records informally in their own\nnotebooks. Others were trying to fill in three sets of registers simultaneously\nand many others had given up altogether. It had become too complicated and\ntime-consuming to be worth the trouble. In short, the effect of the USAID\/\nRTI scale-up has been to undermine the already weak local reporting\nmechanisms.\nAs a consequence, aggregate data on drug uptake in Uganda were found to\nbe more obviously ‘estimated’ or based on information about the total\nnumber of drugs received and distributed at a district level rather than\ngrounded in a detailed reporting of actual take-up or observed consumption.\nAll of this is well known to Ministry of Health staff working on the ground,\nbut such weaknesses in the data rarely find their way into reports or\npublished articles. Indeed, published epidemiological and parasitological\nresearch on Uganda overwhelmingly suggests that mass treatment can be\nshown to have successfully reduced the prevalence and intensity of infection,\nas well as clinical indicators of morbidity. Uganda is particularly revealing\nabout overall trends in assessment of control of NTDs in that it was the first\nsub-Saharan African country to adopt integrated drug distribution\nprocedures (launched in 2003 for schistosomiasis and soil-transmitted\nhelminths, and integrated with other NTDs in 2007).\nMuch of the published research on the country focuses on children,\nreflecting the programme’s emphasis on treatment in the schools of targeted\nareas. However, even with respect to data on children, there are limitations\nwith the kinds of studies that have been carried out. This may be illustrated\nwith reference to research monitoring the impact of annual mass drug\nadministration on child morbidity.\nCohort studies have re-tested selected school children six months after\neach annual round of treatment. If they were found to be positive, they\nwere re-treated. The results showed declining rates of infection and intensity\nof infection (ie worm burden) among those studied.27 However, it cannot be\nassumed that these children are representative of all children at the schools\nthey were attending—not least because they were being given the\nopportunity to be treated twice a year instead of once a year. A further\nlimitation with cohort studies is that they are inevitably biased towards\nchildren of long-term and stable residency. Unfortunately, large numbers of\nchildren in northwestern Uganda do not experience such stability. This fact\nexplains the high drop-out rates and the eventual abandoning of the\nresearch project.\nProblems with the generalisabilty of findings apply equally to other\nmethods that have been adopted, such as cross-sectional mapping using the\nLOT Quality Assurance sampling method. Twenty-four schools were sampled\nin each study district and 15 children were tested in each school. The results\nwere then mapped using GPS readings for each school.28 Although the results\nare visually impressive, the lead researcher himself would not claim that such\nTIM ALLEN & MELISSA PARKER\n100\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nsmall and restricted sample groups can be reliably used for an overall\nassessment of changing patterns of infection following mass treatment. The\nresearch was intended to be indicative, and the claim on one NTD website that\nthe results show that there is a ‘realistic chance of bringing bilharzia infection\nin Uganda to below an intensity level at which it is a major public health\nproblem’ cannot be sustained.29 Indeed, doubts about such a claim\nwere underlined by subsequent parasitological testing carried out by Ministry\nof Health staff at a small sample of schools in Nebbi district. This was one of\nthe districts surveyed in the study. Results revealed that many school children\nwere still infected. At one school, 84 per cent of those tested were reported to\nbe positive for S.mansoni in 2008.\nIn addition to epidemiological and geographical surveillance data\nexploring the impact of mass drug administration on schoolchildren in\nUganda, endeavours have been made to monitor social responses to mass\ndrug administration in addition to our own. These have largely focussed on\nadults, whose attitudes are key to the long-term viability of the approach.\nFor example, a ‘process evaluation’ of schistosomiasis control in Uganda,\nwritten by the team implementing the drug distribution, concluded that mass\ntreatment had been delivered effectively, that it was perceived as beneficial\nand that ‘end-users’ are appreciative.30 These findings build on an as-\nsessment undertaken by Lubanga.31 They are based on qualitative data\ncollected in two districts in Uganda: one on the border with Congo and the\nother on the border with Kenya. A series of quotes from study participants in\nthese two districts are analysed with reference to data documenting the\nnumber of drugs distributed from the Ministry of Health’s headquarters in\nKampala. No attention is paid to the differing political, economic or social\ncontexts in which participants lived and how this may have influenced their\nperceptions of mass drug administration. It would also have been helpful if\nthe paper had discussed how the drugs were distributed within and between\ndistricts; whether people actually swallowed them once they arrived in their\nvillages; and how reported findings related to data documenting the uptake\nof drugs in Ministry of Health registers.\nHowever, limitations in the work cited above are relatively minor\ncompared to USAID-funded assessments by RTI International. Information\nfrom this source suggests impressive levels of NTD treatment coverage across\nthe whole county. A map shown on the RTI website illustrates the hugely\nsuccessful programme, with links being provided to reports describing how\n‘community volunteers make a difference’ and how ‘the NTD control program\ntreats war-torn northern Uganda’. Precisely how the data were collected is\nnot made clear, but from our own observations and discussions with staff in\nthe field, they appear to be based on short questionnaires carried out on a\nsmall number of people in each district. There is no indication to suggest that\nany effort was made to look beneath the surface and to see how stated\npractice relates to actual behaviour.\nOverall, assessments of mass drug administration for NTDs in Uganda raise\nmore questions than they answer. Unanswered questions include the\nfollowing: what proportion of children living in endemic areas attend\nTHE OTHER DISEASES OF THE MDGS\n101\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nschool? What proportion of children who do not attend school or do not\nattend on a regular basis receive drugs from community drug distributors?\nWhat proportion of adults receive drugs from mass drug administration on\nan annual basis? How are these free drugs perceived by adults and by\nchildren? Are they being swallowed? Do local understandings of the aetiology\nand treatment of ‘NTDs’ influence the consumption of drugs? Are there any\nindications to suggest that adults are becoming aware of the benefits of\ntreatment? Are they beginning to demand that they and their children are\ntreated on a regular basis? What are the consequences of institutionalising\nintegrated vertical delivery systems for NTD drug distribution that are\neffectively discrete from other work carried out by ministries of health? Is\nthere any possibility of treatment for NTDs being incorporated into\nsustainable national health care systems without continuous, long-term,\ninternational donor-driven support?\nSelected findings from Tanzania and Uganda\nBetween 2005 and 2009 we carried out field research on NTD control at a wide\nrange of study sites spread across Uganda and Tanzania. We were interested\nin the practical ways in which mass drug administration occurred and paid\nparticular attention to finding out what actually happened on the ground.\nThe villages selected for study were located in Nebbi, Buliisa, Moyo and\nAdjumani districts, northwestern Uganda, and Busia and Bugiri districts in\nsoutheastern Uganda. The selected districts in Tanzania were Pangani and\nMuhesa districts in Tanga region, various locations in Morogoro region, and\nUkerewe Island in Mwanza region.\nResearch sites were selected on the basis that the prevalence of NTDs was\nhigh among school children and adults for two or more of these diseases or\ndisease groups. In Uganda the primary focus at all research sites was\nS.mansoni and soil-transmitted helminths. This was also the case in Ukerewe\nIsland, Tanzania. In Muhesa and Pangani districts, Tanga Region, Tanzania,\nresearch initially focused on S.haematobium and soil-transmitted helminths,\nbut later involved assessing treatment programmes for lymphatic filariasis as\nthe drug, albendazole, was used for this disease as well as the treatment of\nsoil-transmitted helminths. Of all the neglected tropical diseases endemic in\nthe region, it was also the disease that concerned residents the most.\nAll sites involved the analysis of Ministry of Health registers documenting\nthe uptake of drugs for the treatment of S.mansoni, soil-transmitted\nhelminths and lymphatic filariasis among school children and adults. In\naddition, open-ended, unstructured interviews were undertaken with political\nfigureheads, religious leaders, local healers, farmers and fisherman; and\nparticipant observation was carried out (including the observation of what\nactually happened when free drugs were distributed at schools and villages).\nThe generalisability of ideas emerging from this open and exploratory\napproach was gauged by undertaking semi-structured interviews with a\nminimum of 10 per cent of households at selected villages. To date more than\n2000 semi-structured interviews have been undertaken.\nTIM ALLEN & MELISSA PARKER\n102\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nBelow we summarise findings from our research sites, focusing on local\nattitudes to being on the receiving end of the campaign and whether or not\npeople have actually taken treatment. We do not attempt to answer all the\nvarious questions raised at the end of the last subsection, and we do not\nprovide a detailed overview of our own results—those are presented\nelsewhere.32 Our aim is to give an indication of how and why responses to\nNTD treatment vary within and between research sites; to highlight the\nramifications of paying insufficient attention to communication with target\npopulations, and to illustrate the realities of mass drug administration with\ninformation on actual take-up rates of the distributed tablets.\nNTDs are experienced in diverse ways\nDiseases falling within the term ‘NTD’ are very different from each other—\nbiomedically and in terms of their perception among target populations. This\nprofoundly affects local responses, as the following findings illustrate. They\nrelate to the three NTDs most common at our research sites: schistosomiasis,\nsoil-transmitted helminths and lymphatic filariasis. These are discussed\nin turn.\nSchistosomiasis. Schistosomiasis, otherwise known as bilharzia, is the broad\ndescriptive term given to a group of parasitic infections caused by trematode\nflatworms of the genus Schistosoma. The majority of human infections in\nsub-Saharan Africa are caused by two species of schistosome: S.mansoni and\nS.haematobium. These schistosomes have similar lifecycles involving an\naquatic snail intermediate host, the human definitive host and their mutual\npresence in a common environment where transmission occurs: typically\nirrigated fields, irrigation and drainage channels, rivers, ponds and ditches.\nThe signs and symptoms of S.haematobium and S.mansoni vary. Blood in\nthe urine (macroscopic haematuria) is the most commonly reported symptom\nof S.haematobium, especially among children. In more advanced cases it may\ncause damage to the kidneys, urinary tract fibrosis and bladder cancer.\nWomen may also present with genital lesions, vaginal bleeding and nodules\nin the vulva; and men can suffer damage to the seminal vesicles and prostate.\nIt is not unusual, however, for children and adults to be infected with\nS.haematobium for many years, and to remain asymptomatic. Similarly,\ninfection with S.mansoni does not necessarily generate obvious signs and\nsymptoms. Over time it can lead to gross swelling of the spleen and liver,\nblood in the stool, diarrhoea and, in extreme cases, the vomiting of blood.\nHowever, this can take years, even decades, to develop and it does not\nhappen in all cases. Indeed, there is some conjecture as to how debilitating\ninfection with S.mansoni or S.haematobium actually is for the majority of\npeople infected.33\nS.mansoni was endemic at all study sites in Uganda as well as on Ukerewe\nIsland, Tanzania, whereas S.haematobium was endemic in Pangani and\nMuhesa districts, Tanzania. With very few exceptions, those interviewed were\nunaware of clinical distinctions between these two species. From a public\nTHE OTHER DISEASES OF THE MDGS\n103\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nhealth perspective this mattered much more at some sites (notably Nebbi\ndistrict, Uganda and Ukerewe Island, Tanzania) than at others (notably\nPangani and Muhesa districts, Tanzania).\nTo start with Pangani and Muhesa districts: the Swahili term for\nschistosomiasis, kichocho, is widely known and local understandings of\nkichocho overlap, rather than mirror, biomedical understandings of\nS.haematobium. The main sign of kichocho is ‘red urine’ or ‘blood in the\nurine’. It is widely understood as an affliction of childhood. This is because\ninfected children typically present with ‘red urine’ or ‘blood in the urine’ (ie\nmacroscopic haematuria) whereas adults, who may have acquired their\ninfection in childhood, typically lose this sign of infection and present with\nother signs instead.\nThe presentation of symptoms influences perceived aetiology and\nresponses to treatment. Among children infection is thought to be acquired\nwhile swimming and occurs through their sexual organs or anus. Adults do\nnot swim and rarely present with ‘red urine’ or ‘blood in the urine’. Not\nsurprisingly, then, they are not thought to suffer from kichocho in large\nnumbers. The concentration of control programmes in schools confirms these\nlocal perceptions.\nThere is widespread support for the mass distribution of drugs in schools\nfor the treatment of kichocho in this part of Tanzania. This, in part, can be\nattributed to the fact that local understandings of kichocho overlap with\nbiomedical understandings of S.haematobium, at least for children. Parents\nand teachers alike observed that children suffering from kichocho lose the\nvisible signs of infection, ‘red urine’, when swallowing the tablets. It works.\nHowever, adults in both districts stated that, if mass treatment occurred in\n‘the community’, rather than schools, they would be reluctant to swallow the\ndrugs. As far as they are concerned, kichocho is not a significant health issue\nfor adults.\nThe situation is much more complicated in places where the mass\ndistribution of drugs is for the treatment of S.mansoni. In Uganda, for\nexample, the term ‘bilharzia’ is widely used to describe both S.mansoni and\nS.haematobium, although there are very few places where S.haematobium is\nfound. In common with northern coastal Tanzania, local understandings of\nbilharzia differ in important ways from biomedical understandings of either\nS.mansoni or S.haematobium and the differences profoundly affect responses\nto the mass distribution of drugs in schools and communities.\nBy way of illustration, bilharzia is understood as a type of okudi in\nPanyimur, northwestern Uganda. Okudi is a general word for worms. Other\ntypes of okudi include okudi ascaris, okudi hookworm and okudi amoeba.\nOkudi bilharzia is frequently said to be the type of worm most likely to cause\nillness and one informant referred to it as ‘the chairman of worms’. Local\nunderstandings of the signs of okudi bilharzia include an extended stomach,\ndiarrhoea, bloody diarrhoea and vomiting blood. Biomedical signs of\ninfection with S.mansoni are similar in a number of important respects, but\nthis counts for little at a local level, as understandings of aetiology and\neffective treatment are so different. With respect to aetiology, a diverse array\nTIM ALLEN & MELISSA PARKER\n104\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nof ideas circulates about the aetiology of okudi bilharzia. These include\ndrinking dirty water, treading on faeces, not washing hands before eating and\nswimming in contaminated water. Local informants, including those\nassociated with the delivery of biomedical health care, were rarely able to\ndescribe the lifecycle of S.mansoni with any accuracy, a fact that can be\nattributed to poorly designed health education materials. A Ugandan\nprimary school textbook, for example, describes the signs and symptoms of\nS.haematobium, but does not mention S.mansoni; and thus conveys the\nimpression that a key sign of infection with bilharzia is red urine. It does not\nmention that it is possible to be infected for many years and to remain\nasymptomatic. In addition, several booklets and posters depict the lifecycle\nof the worm in such a way as to suggest that it possible to see the worms\nwhich penetrate the soft part of the skin in water with the naked eye. This, in\nturn, generates comments like ‘we don’t have worms like that!’.\nIt is equally important to note that the signs of infection associated with\nokudi bilharzia can also be interpreted as signs of witchcraft or a local ailment\nknown as awola. Inflicted on an individual by a witch as a result of envy,\nawola can only be treated by a kind of witchdoctor known as an ajoga. A\nsymptom of this ailment is vomiting blood. The same symptom, along with\nascites, is a biomedical indicator of liver damage, a serious and often fatal\ncomplication associated with S.mansoni. However, treatment with biomedi-\ncal drugs is deemed dangerous as they are perceived to exacerbate the\ncondition and, in some circumstances, cause death.\nPraziquantel is the drug being distributed for the treatment of S.mansoni. It\nis large, strong smelling and has an unpleasant taste. Individuals heavily\ninfected with S.mansoni often experience side-effects such as diarrhoea and\nvomiting after treatment. In many cases this was reported to last for several\ndays and even weeks. Empirical observations of the impact of treatment, in\ncombination with divergent understandings of aetiology and treatment, have\nled to widespread questioning of the rationale for mass drug administration.\nFrequently articulated concerns included the following: ‘why should I take\nthese drugs? They will make me sick’; others expressed a fear that treatment\nwith praziquantel (usually referred to as ‘Bayer’) would not only lead to sick-\nness, but also to infertility, miscarriage and even death. In 2005 these concerns\ncontributed in significant ways to the reluctance to swallow drugs in Panyimur.\nThey were still relevant in subsequent years, but some fears diminished as\nempirical observations were being made that people were taking the tablets\nwithout suffering long-term, damaging consequences to their health.\nLymphatic filariasis. Somewhat similar issues arise with lymphatic filariasis,\nwhich is more popularly known as elephantiasis. It is caused by three species\nof mosquito-borne filarial worms: Wuchereria bancrofti, Brugia malayi and\nBrugia timori. In common with schistosomiasis, it is possible to be infected\nbut free from visible signs and symptoms of infection for many years and to\nfeel well. Over time and repeated bouts of infection, signs and symptoms\nemerge. These typically include the gross swelling of limbs and genital disease\nsuch as hydrocele.\nTHE OTHER DISEASES OF THE MDGS\n105\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nIn Pangani and Muhesa districts, Tanzania local understandings of the\naetiology of lymphatic filariasis, as well as appropriate responses to the signs\nand symptoms of infection, differed considerably from biomedical ap-\nproaches. First and foremost, there is no Swahili word for lymphatic\nfilariasis. While two of the major biomedical signs of infection, enlarged\ntesticles and swollen limbs, are locally recognised ‘diseases’, they are\nperceived to have separate aetiologies. The disease ‘mabusha’, refers to\nenlarged testicles and the disease ‘matende’ refers to swollen limbs. In the\nwords of a mganga (healer) from Pangani: ‘‘Some people have both mabusha\nand matende . . . but they don’t come simultaneously. The fact that mabusha\ncan be operated on and matende cannot be operated on proves that they are\ndifferent diseases.’’\nThe majority of people (including health care workers at government\ndispensaries and health centres) draw upon a pluralistic approach to diagnosis\nand treatment. As a result, they do not attribute a single cause to either\nmabusha or matende. Instead, several causes are likely to be mentioned, with\neach cause being accorded equal weight.Mabusha, for example, was typically\nattributed to at least one of the following: sex, witchcraft, hernia, diet and\nsickness sent by God; the vast majority of people were unaware that it was\ncaused by infection from the bite of mosquitoes. By contrast, matende was\nusually attributed to inherited characteristics and\/or witchcraft, a kind of\nfever known as mgonzo and, sometimes, the bite of a mosquito.\nPerceived aetiology for these two ‘diseases’ not only influenced the type of\ntreatment subsequently sought, but also responses to mass treatment. With\nrespect to mabusha and matende, it was also widely noted that there was no\nobservable connection between swallowing the drugs (albendazole and\nivermectin) and the alleviation of symptoms. The symptoms did not diminish\nin size and the drugs did not, therefore, appear to have an impact. This is\nbecause treatment had not occurred in time to prevent irreversible damage. It\nwas additionally noted that many people who were being asked to take the\ndrugs had no symptoms and felt quite well. For these adults, the programme\nremained, at best, a mystery. Others were angry and suspicious. The\ntreatment programme fed into wider concerns about the unspoken agenda of\nthe government and international aid agencies: Why did the government not\nassist with the bigger problems of HIV\/AIDS and malaria? Was this just\nanother endeavour to reduce the birth rate? Were the rural poor being\nexperimented on with drugs that had not been properly tested?\nSoil-transmitted helminths. Soil-transmitted helminths are sometimes re-\nferred to as intestinal worms. From a public health perspective there are three\nspecies that are particularly important: Ascaris lumbricoides (roundworm),\nAncylostoma duodenale (hookworm) and Trichuris trichua (whipworm). All\nthree species thrive in areas where there is no sanitation system, as the soil\nand water can easily become contaminated with faeces containing worm eggs.\nHumans are infected by ingesting these eggs (typically from uncooked or\npartially cooked food, water or placing unwashed hands into the mouth). In\nthe case of hookworm, it is also possible for the larvae to penetrate the skin.\nTIM ALLEN & MELISSA PARKER\n106\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nThat is, eggs hatch into larvae and rest in the soil. If a person walks barefoot\non the contaminated soil, the larvae can penetrate the skin. There is no direct\nperson-to-person transmission from fresh faeces as eggs passed in the faeces\nneed three weeks in the soil before they become infectious. Many people\ninfected with soil-transmitted helminths experience one or more of the\nfollowing symptoms: nausea, abdominal pain and loss of appetite. All three\nspecies are also associated with anaemia and vitamin A deficiency.\nLocal perceptions of soil-transmitted helminths in Tanzania and Uganda\nwere different from biomedical understandings in a number of important\nrespects. In Pangani and Muhesa districts, Tanzania, for example, soil-\ntransmitted helminths are referred to as minyoo. They are not associated with\nparticular signs or symptoms of infection and they are not thought to present\na major health problem. With the exception of hookworm, which is often\nreferred to as safura, very few people (less than one per cent) had any idea\nthat there were different types of worms with different aetiologies. There was,\nhowever, widespread local awareness of minyoo and recognition that taking a\ntablet can be curative—not least because those infected could sometimes see\nthe worms in their faeces.\nThe drug albendazole is used at all sites in Uganda and Tanzania to treat\nsoil-transmitted helminths. When offered in isolation, it did not present any\nparticular problems or concerns to children or adults and was not perceived\nto cause serious side-effects. However, there has been a decline in the uptake\nof albendazole among both adults and children at most of the sites in which\nwe have worked, often dropping far below target rates of take-up. This has\nbeen a consequence of the NTD control integration procedures, which have\noften meant providing albendazole together with less widely accepted\nmedicines. A vivid illustration of this point is the fact that, among the Alur\nin Nebbi district, the drug for bilharzia is known by the name of Bayer\n(rather than praziquantel) and the drug albendazole is known as ‘anti’ or the\n‘escort’. In other words, it is perceived as an antidote to what were locally\nthought to be serious side-effects associated with the drug praziquantel. In\nparts of Tanzania dramatic declines in albendozole take-up were also noted,\nespecially in locations where it was provided together with ivermectin for the\ntreatment of lymphatic filariasis.\nDeclines in albendozole take-up were found to be less steep in schools,\nbecause children were more likely to take combinations of NTD drugs if\ninstructed to do so by their teacher. However, health education materials\nused at the time of treatment tended to be confusing. Children were often\ninformed about soil-transmitted helminths, but not about other diseases,\nmaking it hard for them—or their parents—to understand why there were\ngiven other drugs too. At sites in coastal Tanzania, for example, Swahili\nlanguage pamphlets were given out explaining soil-transmitted helminths at\nthe time that school treatment for schistosomiasis was occurring in 2007.\nOn that occasion albendozole was not being distributed, because the\nchildren were supposed to have received it as part of an earlier distribution\nof treatment for lymphatic filariasis. Most teachers were found to be\nunaware that this was the case and could not explain what the drugs they\nTHE OTHER DISEASES OF THE MDGS\n107\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nwere giving out were meant to treat. At a village level no one interviewed\nknew that albendazole had the multi-purpose of treating minyoo, mabusha\nand matende.\nInadequate communication and outreach\nThe distribution of NTD drugs in Uganda and Tanzania was organised in\nsimilar ways. Drugs were sent from Kampala and Dar es Salaam to local\nheadquarters (directly to districts in Uganda; to regions and then districts in\nTanzania). District vector control officers distributed drugs to primary\nschools and health centres and, after attending a training session, teachers,\nvolunteer drug distributors and sometimes health workers took on the task of\ndistributing drugs within villages and schools. It sounds relatively\nstraightforward and, at least with respect to treatment programmes in\nschools, it has often been possible to ensure that the majority of children\nregistered at school and attending on the days of distribution receive free\ndrugs, partly because, as has been noted, they will do what their teachers tell\nthem to do. In these school contexts the actual swallowing of drugs is usually\nobserved by the distributors. However, drug distribution in schools is by no\nmeans always so straightforward, and away from school environments\nserious difficulties are quite common.\nIn large part this can be attributed to insufficient and inappropriate\n‘sensitisation’ and ‘mobilisation’. The type of information conveyed along-\nside the distribution of drugs is little more than information about how and\nwhen to take them. It does not challenge or engage with pluralistic outlooks\nand ways of thinking, and makes little attempt to explain the aetiology of the\ndiseases being treated, how it is possible to be asymptomatic, how the\nmedicines provided work, and why mass treatment is provided without\ndiagnostic procedures. Various posters are sometimes displayed and\noccasionally pamphlets are distributed, but these are generally of a poor\nquality, often confusing or even wrong. One example has already been\nmentioned: misleading pictures illustrating the lifecycle of schistosomiasis.\nAnother example is the use of photographs in the new NTD integrated\ntreatment registers being distributed in Uganda. These purportedly show\nsymptoms of onchocerciasis. In fact, they depict symptoms of lymphatic\nfilariasis. In short, lip service is paid to the importance of health education\nbut the reality is that communication with target populations is not\nprioritised, is mostly superficial, and can be experienced as patronising.\nIndeed, the use of overly-simplistic messages comes close to being a deliberate\npolicy, justified on the grounds that to explain things properly would be too\ncomplex for health educators and the target audience.34\nNot surprisingly, then, responses to these vertical, biomedical programmes\nremain bound within existing systems that attribute locally understood\nafflictions such as awola, mabusha and matende to very different aetiologies,\ntreatments and preventive actions. We have also found that, whenever we\nhave held public meetings to discuss the drug distributions, there is usually a\nbarrage of intelligent questions posed by those being offered them. Among\nTIM ALLEN & MELISSA PARKER\n108\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nthe most frequently posed are versions of the following: ‘why should we take\nthe tablets if we are going to go back in the water, because we will be\nreinfected?’ and ‘we have been told not to take medicines unless we are\nproperly diagnosed, so why are you telling us to take treatment when we may\nnot have anything wrong with us?’\nOn occasion the lack of adequate communication about the rationale for\nmass treatment for biomedically defined tropical diseases that are not\nnecessarily recognised at a local level has fuelled conspiracy theories and\ncollective resistance. This can range from being absent on distribution days to\nviolent protests. The latter have occurred where school distributions have\nbeen particularly poorly handled and where there is local suspicion of the\nmotives of central government or district of authorities. In many respects it is\nsurprising that it has not occurred more often than it has.\nImagine a situation in the UK whereby a healthy child goes to school in the\nmorning, but comes home in the afternoon with stomach pains, vomiting\nand\/or diarrhoea. The child then tells her mother and father that her teachers\nmade her swallow several large tablets and this had been something to do\nwith treatment for invisible worms. The parents not only discover that their\nchild is not making this up, but they also find out that several of the child’s\nfriends have become ill with similar symptoms. Almost certainly there would\nbe protests and the school staff would be held to account. This imaginary\nscenario gives an idea of how mass drug administration to school–aged\nchildren in Africa can be experienced the first time it is attempted.\nWhere there have been several drug distributions, the chances of significant\nside-effects seem to lessen. This has not been studied systematically but it is\nprobably because the intensity of infection and infection rates have declined\nwith previous treatments. Where this is reported, repeated treatment in schools\nshows signs of becoming routine. In some research sites, such as in Adjumani\nDistrict in Uganda, we found that school children had gained a reasonable\nlevel of understanding about the control of the diseases being treated. In fact,\nthey often had more precise knowledge about some diseases than community\ndrug distributors or their parents. At other locations in Uganda and Tanzania,\nhowever, people became so angry about what was happening that distribution\nhad to be stopped. In both countries there were conspiracy theories that kept\ncirculating about what the drugs were really for, especially in locations in\nwhich people feel politically marginal—such as parts of northern Uganda,\nnorthern coastal Tanzania and parts of Morogoro.\nIn Tanzania matters came to a head in places around Morogoro in 2008.\nDistribution in schools of tablets for schistosomiasis and soil-transmitted\nhelminths provoked riots, which had to be contained by armed police. It\nbecame a significant national incident, and one of the consequences has been\nthe delay in Tanzania adopting a fully integrated NTD programme, and the\nscaling back some existing drug distributions. The riots were by far the most\nextreme example of resistance to NTD drug distributions, but the sentiments\nexpressed by the protesting mob were far from unique. Drawing on research\nat all our research sites, a summary of some of our key findings on the take-\nup of drugs is presented below.\nTHE OTHER DISEASES OF THE MDGS\n109\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nRealities of drug take up\nIn northwestern Uganda we found that the take up of drugs for S.mansoni\nand soil-transmitted helminths was very variable in locations in Nebbi\nDistrct. To be more specific: in 2004 the average self-reported uptake of\ndrugs among adults ranged from 62 per cent to 78 per cent in the three\nparishes that constitute Panyimur sub-county. In 2005 uptake ranged from\n32 per cent to 43 per cent in these three parishes; and in 2007 it ranged from\n33 per cent to 59 per cent.35\nAcross Lake Albert in Buliisa District rates were also variable, with the\naverage uptake of drugs among adults for schistosomiasis and soil-\ntransmitted helminths ranging from eight per cent to 27 per cent in 2005,\nfour per cent to 15 per cent in 2006; 36 per cent to 58 per cent in 2007 and\n46 per cent to 91 per cent in 2008. In villages where the uptake of drugs was\nlow, this could be attributed to a combination of supply problems and local\nantipathies between resident ethnic groups.\nFurther north, along the Nile close to the Sudan border, the uptake of\ndrugs among adults in Adjumani and Moyo districts was variable again.\nThis was partly the result of a policy of selective treatment in some years,\nwhereby adults were only encouraged to take the drugs if they thought they\nmight be infected. On the other hand, very high take-up rates occurred at\nsome locations when there was distribution of food relief at the same time\nas tablet distribution. In Moyo district self-reported survey data from seven\nvillages suggested an average uptake of 39 per cent, 41 per cent and\n55 per cent in 2006, 2007 and 2008, respectively. In neighbouring Adjumani\ndistrict self-reported uptake of drugs for S.mansoni and soil-transmitted\nhelminths among adults at seven selected sites averaged 29 per cent,\n60 per cent, 51 per cent and 74 per cent in 2005, 2006, 2007 and 2008,\nrespectively. Rates of take-up recorded at primary schools tended to mirror\nadult take-up, especially in Adjumani district. They reached very high levels\non occasions that food was provided to the children at school on\ndistribution days, but were found to drop precipitously when food relief\nwas withdrawn.\nAt the other end of the country in Busia District, located in the southeast\nnear the Kenyan border, average rates of take-up among adults at selected\nsites were 67 per cent in 2008 and 64 per cent in 2009. In neighbouring Bugiri\ndistrict, however, average uptake was 43 per cent in 2007 and 34 per cent in\n2008. Mass drug administration did not occur in 2009 as the vector control\nofficer was seriously ill. In the light of information available, it seems likely\nthat the relatively successful figures in Busia district can be attributed to a\npolitical agenda of making Busia into a flagship district, partly because a\nlarge fish processing plant had been built there. A policy had been introduced\nto drastically reduce the number of people involved in fishing related\nactivities, and to closely regulate access to the shore of Lake Victoria. Many\npeople were displaced into neighbouring Bugiri district (which includes\nislands in the lake), leaving the relatively wealthy and well-connected to\nreceive NTD treatment. Not surprisingly there are indications that rates of\nTIM ALLEN & MELISSA PARKER\n110\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nschistosomiasis infection in Busia have declined, but the limited evidence\navailable suggests that there are high rates in Bugiri.\nMoving to Tanzania, we found that the uptake of drugs among adults for\nS.mansoni and soil-transmitted helminths in Ukerewe Island ranged from\n18 per cent to 74 per cent at 14 selected villages in 2007, with an overall average\nof 44 per cent. As noted previously, the uptake of drugswasmuch higher among\nschool children and sometimes exceeded the target of 75 per cent coverage.\nIn areas of Tanga region we found wide fluctuations in the uptake of drugs\nfor schistosomiasis, as well as for soil-transmitted helminthiases and\nlymphatic filariasis. S.haematobium is endemic in this part of Tanzania.\nParents were found to be positive about their children being treated at\nschool, with recorded uptake often exceeding the target coverage of\n75 per cent. However, the uptake of drugs for the treatment of lymphatic\nfilariasis and soil-transmitted helminthiases was low. In Mwembeni village,\nPangani district, for example, self-reported uptake of drugs among adults fell\nfrom 70 per cent in 2004 to 49 per cent in 2006 and 36 per cent in 2007. In\nneighbouring Jaira village uptake fell from 57 per cent in 2004 to 49 per cent\nin 2006 and 40 per cent in 2007. Similar trends were observed in coastal parts\nof Muhesa district. In Kigombe East and Kigombe West, for example,\nuptake fell from 63 per cent and 44 per cent, respectively in 2004 to\n27 per cent and 34 per cent in 2006 and 27 per cent and 26 per cent in 2007.\nInterestingly, closer to Muhesa town, uptake rose from 47 per cent and\n40 per cent in 2004 in Bwembwera and Magila, respectively to 68 per cent\nand 43 per cent in 2006 and 65 per cent and 70 per cent in 2007.\nIn Doma village, Morogoro, Ministry of Health registers documenting the\nuptake of drugs for the treatment of onchocerciasis suggested that uptake fell\nfrom 31 per cent in 2004 to 29 per cent in 2006 and 17 per cent in 2007.36 This\nwas a location of considerable antipathy to the NTD distributions, and was\nthe site of some of the worst riots in 2008 when attempts were made to treat\nschistosomiasis in schools.\nOverall our research reveals that claims about the effective delivery of drugs\nand positive responses tomass treatment by end users in Uganda and Tanzania\nare not borne out by the evidence. However, there is an eagerness to take the\ndrugs in some locations, and in northern Uganda we found that the majority of\npeople of long-term residence in areas endemic for S.mansoni had taken\npraziquantel at least once. This appeared to be confirmed by testing we carried\nout ourselves with district health staff and some of our students in Moyo and\nNebbi districts, as we found generally low rates of infection among stable\nresidents, even among resident fisherfolk living on the Nile. This contrasted\ndramatically with very high rates among recent migrants, which doubtless\nhelps explain the very high recorded rates of infection—or re-infection—\namong school children in Nebbi mentioned above (more than 80 per cent at\none school tested). Children swim in Lake Albert, where short-term migrants\nhave to defecate because of a lack of pit latrines.\nFinally, while we made every effort to triangulate our findings (by looking\nat data documenting the uptake of drugs in ministry of health registers,\ndiscussing a wide range of issues with community drug distributors, teachers,\nTHE OTHER DISEASES OF THE MDGS\n111\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nother adults and children, and observing drug distribution days), we cannot\nbe sure that all those we recorded as having taken the drugs actually\nconsumed them, or that they consumed them in the correct doses. In many\ninstances, revisiting households and follow-up interviews revealed that\ntablets had been ‘taken’ but not swallowed. On numerous occasions we\nwere shown tablets that were being kept in case someone in the family\nbecame ill. Observations of distributions made it clear, in some locations,\njust how hard it was for a drug distributor to insist on watching a recipient\nconsume the medicines. Some teachers tried to force their pupils to do it,\nnot always successfully. With adults this was not an option, although, on a\nfew occasions, informants spontaneously suggested that a degree of force\nmight be appropriate. As one put it ‘if it was really important to take these\ntablets there would be laws to make us’. It was a good point. At only one\nof our sites was public health legislation used systematically, and that was\nin Busia, where it was evoked to remove people from the vicinity of Lake\nVictoria.\nConclusion\nThere is no question that a focus on the parasites of the poor is appropriate.\nAnyone who has seen the effects of long-term infection on those suffering\nfrom these NTDs would find it hard to deny that treatment should be\nprovided; and the offer of very cheap or free medicines from the major drug\ncompanies is very welcome. There is a remarkable opportunity to make a real\ndifference to large numbers of deprived people. However, it is also hard not\nto be exasperated by the grandstanding rhetoric and exaggerated claims of\nsome protagonists. The targets associated with the MDGs have not helped in\nthis respect, and there is a real possibility that purported achievements will\nbecome more and more illusory.\nThe priorities of institutions competing to secure and sustain funding\nalready seem to be more important than sober assessments of what is\nhappening on the ground. As mass drug administration scales up, it becomes\never harder to learn from what has worked and what is failing. This can only\nbe counterproductive. Thus, while the 2010 WHO report on NTDs is a positive\ninitiative, it is a bit disappointing, not least because it uncritically accepts\nsummative data reporting high rates of drug uptake. Parts of the report read\nlike an elaborate application for funding—particularly those sections\nasserting the WHO’s pivotal co-ordination role with reference to some\ncreative historicising. Would it not be better to set out an agenda for more\nrigorous research and monitoring?\nEveryone we have spoken to inside the drug distribution programmes is\nwell aware that not all of what is claimed is in fact true. But they feel\ncompelled to sweep ongoing problems under the carpet for fear that reso-\nurces will be withdrawn.37 People living in places like the Gezira\/Managil\nirrigation scheme in Sudan, where mass drug administration has occurred in\nthe past, are in danger of returning to former levels of infection following the\ntermination of control projects. So it is understandable that those committed\nTIM ALLEN & MELISSA PARKER\n112\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nto the approach are sensitive to anything that might jeopardise resourcing\nand supply. However, a range of problems has arisen with mass drug\nadministration, and if these problems are ignored, they are likely to\nundermine NTD control programmes anyway.\nA good example of the setting aside of critical voices is the response to the\nconcerns raised by Bruno Gryseels. Aware that the reviewing process in\nconventional medical journals was likely to be very time consuming and would\nprobably require him to tone down his views to secure publication, he decided\nto write an extended letter to the Financial Times.38 Several of the points we\nhave discussed here are addressed in the letter, as well as a warning that large\nscale, long-term distribution of drugs may trigger drug resistance in recipient\npopulations. This is a particularly sensitive issue, for obvious reasons. As far as\nwe know, there are no data indicating that it has happened with medicines used\nin NTD control. But it is hardly an unreasonable point to raise, not least because\ncurrent methods of monitoring might not pick it up. The response was a\nformulaic attack, purportedly penned by leading African supporters of current\nroll-out schemes. Rather than addressing the substantive issues raised (other\nthan to note that drug resistance has not yet been observed), Gryseels was\ncastigated for raising criticisms on the grounds that ‘his position from an\nAfrican perspective is unethical and a violation of the fundamental right to\nheath and contrary to the health policy of African countries’.39 Gryseels, it\nshould be noted, is not an anthropologist like us, whose workmight be set aside\nas interesting but ‘anecdotal’. He is head of the Institute of TropicalMedicine in\nAntwerp. Perhaps that was the reason for the co-ordinated rebuttal.\nIs closing off debate and discussion in this way ever useful? Are donors and\ndrug companies really so unwilling to accept that there might be complications\nand problems with the philanthropic efforts they support? Surely there is space\nto address difficulties and disagreements without resorting to blanket denials\nand defensive assertions. To repeat the key point in the Lancet editorial cited\nabove: ‘Without proper monitoring and accountability, countries and\ndonors—and taxpayers—have no idea whether or how their investments are\nworking.’40 To prevent that happening, an influential institution has to be in a\nposition to lay down guidelines and benchmarks, objectively assess treatment\nprocess, and demonstrate that things are not going according to plan, if that is\nindeed the case. Basically it must be in a position to create adequate space for\ndebate and to learn from what does not work.\nIt seems that schools of public health are so caught up in a desperate\nscramble for grants that they will not be able to do that. Our own research\nhas been supported by Alan Fenwick’s group based at Imperial College,\npartly because Fenwick himself recognises the value of an alternative\nperspective to the consensus-driven analysis that surrounds him—and to\nwhich he has himself been such a leading contributor. But his attitude is\nrelatively rare. More generally assessments of programmes by university-\nbased medical research centres are vulnerable to being compromised by soft\nfunding. The situation with subcontracted commercial organisations like RTI\nInternational is worse. They are, after all, openly competing with each other\nto provide services. They are structurally connected with temporal\nTHE OTHER DISEASES OF THE MDGS\n113\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nconstraints, pre-defined outcomes, and face continuous pressure to position\nthemselves to bid for the next aid grant. This does not preclude them from\noperating efficiently, but they could not survive if they chose to rock the boat.\nIt is also unlikely that things will change if a new Global Fund for NTDs is\nestablished. Such a fund will channel resources into setting up and sustaining\nyet another UN-linked bureaucracy, and will do all it can to redirect\nresources from other institutions by arguing that it can reach targets more\nquickly. Temptations to exaggerate results will intensify. Do current efforts\nby the WHO to gain the initiative in co-ordinating global NTD control,\nunderlined by its first ever major report on the issue, mean that it will\nsuccumb to similar pressures?\nMass drug administration for several debilitating diseases has the potential\nto work. We have seen the benefits for impoverished people at some of our\nresearch sites. However, it will not succeed overall and what has been\nachieved will not be sustained unless there is a serious effort to assess what is\nactually happening on the ground. Practices will need to be adjusted to deal\nwith the kinds of issues we have highlighted in our research. Setting public\nhealth benchmarks based on robust information is the kind of role that the\nWHO was set up to play. It has sometimes found it hard to assert such a\nposition in the past, such as when it was effectively sidelined by UNICEF in the\n1980s or by the World Bank in the 1990s. But someone has to be in able to\nsay that the emperor has no clothes when that is the case, and hopefully to do\nso in time to dress him, before the consequences become too serious.\nNotes\nEthical clearance and acknowledgements\nThe research summarised in this paper is based upon field-work funded by the Schistosomiasis Control\nInitiative (SCI), Imperial College, under the auspices of the Bill and Melinda Gates Foundation. Ethical\nclearance was passed by the ethics committee of Imperial College for surveillance and monitoring activities\nfor the evaluation of national control programmes for control of NTDs. Separate ethical clearance\napplications were also passed through the relevant bodies in Uganda and Tanzania. In both countries we\nworked closely with ministry of health staff, and obtained appropriate research clearance at regional and\ndistrict levels.\nWe are grateful to Professor Alan Fenwick, director of SCI, for his unfailing support, and his\nencouragement of our work, even when our findings made uncomfortable reading. We are also grateful to\nother staff from SCI, some of whom have disagreed with our analysis, but who have continued to provide\nassistance, including Lynsey Blair, Fiona Fleming and Artemis Koukounari. In Uganda we are especially\nindebted to Narcis Kabatereine from the Vector Control Division, Ministry of Health. We have learned a\ngreat deal from the extensive discussions and occasionally heated debates we have had with him since 2005,\nand we would like to take this opportunity to express our admiration for his passionate commitment to\ndisease control. Many other staff from the Ministry of Health in Uganda are owed additional thanks,\nincluding Dr Ambrose Onapa and the vector control officers in all the study districts who, without\nexception, were enormously helpful. Our research in Uganda would not have been possible without the\ndedication and commitment of the following postgraduate students and research assistants: Emily Aldis,\nRosie Bright, Bono O Edward, Rachel Flynn, Philip Goli, Julie Hastings, Ronald Iya, Stanley Bright\nJhopacu, Becky Mitchell, Nstori Onen, Sam Polla, Jill Smith, Ruth Tushememereirwe, Nicola Peach,\nGeorgie Pearson, Nick Rees, Kyla Reid, Laura Storm and Albert Wutham. In Tanzania we have\nbenefitted from challenging discussions with a wide range of personnel working in the health sector, from\nstaff at the National Institute of Medical Research in Mwanza, Muhesa and Tanga to regional and district\nhealth staff at all of our research sites. John Changalucha, Roly Gosling, Nicholas Lwambo, Caroline\nMaxwell and Ursuline Nyandindi, have been especially helpful. Fantastic assistance was provided in the\nTIM ALLEN & MELISSA PARKER\n114\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nfield by Kombo Iddi, Juma Mohamedi, Mishy Singano, Angela Shija and Polly Wingate-Saul. Lastly we\nhave received valuable insights and comments from Pascale Allotey, Bruno Gryseels and Tom Parker. The\nviews expressed in this paper do not necessarily reflect the views of any of the institutions or the people\nmentioned above.\n1 DH Molyneux, PJ Hotez & A Fenwick, ‘Rapid-impact interventions: how a policy of integrated\ncontrol for Africa’s neglected tropical diseases could benefit the poor’, PLoS Med, 2(11), e.336, 2005,\np 6.\n2 SE Sachs & JD Sachs, ‘Foreword’, in PJ Hotez, Forgotten People, Forgotten Diseases: The Neglected\nTropical Diseases and their Impact on Global Health and Development, Washington, DC: ASM Press,\n2008, p x.\n3 PJ Hotez & TG Thomson, ‘Waging peace through neglected tropical disease control: a US foreign\npolicy for the bottom billion’, PLoS Neglected Tropical Diseases, 3(1), 2009, p e346.\n4 PJ Hotez, Forgotten People, Forgotten Diseases.\n5 Ibid.\n6 Molyneux et al, ‘Rapid-impact interventions’.\n7 PJ Hotez, ‘A new voice for the poor’, PLoS Neglected Tropical Diseases, 1(1), 2007, e77.\n8 World Health Organisation, Working to Overcome the Global Impact of Neglected Tropical Diseases,\nGeneva: WHO, 2010, p x.\n9 For example, see A Fenwick, ‘The control of Schistosoma mansoni on a sugar estate in Tanzania’, East\nAfrican Medical Journal, 48, 1971, pp 447–449.\n10 WHO, Working to Overcome the Global Impact of Neglected Tropical Diseases, p iv.\n11 G Lamey, ‘The unsung hero of neglected tropical diseases: interview with Narcis Kabatereine’, PLoS\nNeglected Tropical Diseases, 3(12), 2009, p e546.\n12 WHO, Working to Overcome the Global Impact of Neglected Tropical Diseases, p 1.\n13 PJ Hotez, D Molyneux, A Fenwick, L Savioli & T Takeuchi, ‘A Global Fund to fight neglected\ntropical diseases: is the G8 Hokkaido Toyako 2008 summit ready?’, PLoS Neglected Tropical Diseases,\n2(3), 2008, p e220.\n14 World Health Organisation & African Programme for Onchocerciasis Control’, WHO Joint Strategic\nPlan for the Control of Neglected Tropical Diseases in the African Region, 2010–2015’, WHO\/AFRO,\nAPOC and WHO\/HQ, draft, 4 August 2010.\n15 FM Fleming, A Fenwick, EM Tukahebwa RGN Lubanga, H Namwangye, S Zaramba & NB\nKabatereine, ‘Process evaluation of schistosomiasis control in Uganda, 2003–2006: perceptions,\nattitudes and constraints of a National Control Programme’, Parasitology, 136(13), 2009, pp 1759–\n1769.\n16 Neglected Tropical Disease Program, Uganda, at http:\/\/ntd.rti.org\/about\/index.cfm?fuseaction¼\nstatic&label¼uganda.\n17 For example, see MA Brady, PJ Hooper & EA Ottesen, ‘Projected benefits from integrating NTD\nprograms in sub-Saharan Africa’, Trends in Parasitology, 22(7), 2006, pp 285–291; D Engels & L Savioli,\n‘Reconsidering the underestimated burden caused by neglected tropical diseases, Trends in Parasitology,\n22(8), 2006, pp 363–366; A Fenwick, D Molyneux & V Nantulya, ‘Achieving the Millennium\nDevelopment Goals’, Lancet, 365, 2005, pp 1029–1030; A Fenwick, ‘New initiatives against Africa’s\nworms’, Transactions of the Royal Society of Tropical Medicine and Hygiene, 100(3), 2006, pp 200–207;\nDH Molyneux, ‘‘‘Neglected diseases’’ but unrecognized successes—challenges and opportunities for\ninfectious disease control’, Lancet, 364, 2004, pp 380–383; Molyneux et al, ‘Rapid-impact interventions’;\nHotez et al, ‘A Global Fund to fight neglected tropical diseases’; Hotez, Forgotten People, Forgotten\nDiseases; PJ Hotez, A Fenwick, L Savioli & DH Molyneux, ‘Rescuing the bottom billion through the\ncontrol of neglected tropical diseases’, Lancet, 373, 2009, pp 1570–1575; NB Kabatereine, F Fleming, U\nNyandini JCLMwanza & L Blair, ‘The control of schistosomiasis and soil-transmitted helminths in East\nAfrica’, Trends in Parasitology, 22(7), 2006, pp 332–339; NB Kabatereine et al, ‘Impact of a National\nHelminth Control Programme on infection and morbidity in Ugandan schoolchildren’, Bulletin of the\nWorldHealth Organisation, 85, 2007, pp 91–99; S Knopp,KAMohammed,DRollinson, RJ Stothard, SI\nKhamis, J Utzinger & H Marti, ‘Changing patterns of soil-transmitted helminthiases in Zanzibar in the\ncontext of national helminth control programs’, American Journal of Tropical Medicine and Hygiene,\n81(6), 2009, pp 1071–1080; CJ Standley, M Adriko, M Alinaitwe, F Kazibwe, NB Kabatereine & RJ\nStothard, ‘Intestinal schistosomiasis and soil-transmitted helminthiasis in Ugandan schoolchildren: a\nrapid mapping assessment’, Geospatial Health, 4(1), 2009, pp 39–53; and D Yu, ‘Cost-effectiveness\nanalysis of the impacts on infection and morbidity attributable to three chemotherapy schemes against\nSchistosoma Japonicum in hypoendemic areas of the Dongting Lake region, China’, Southeast Asian\nJournal of Tropical Medicine and Public Health, 33, 2002, pp 441–457.\n18 WHO, Working to Overcome the Global Impact of Neglected Tropical Diseases, p viii.\n19 MN Katabarawa, D Mutabazi & FO Richards, ‘Controlling onchocerciasis by community-directed,\nivermectin-treatment programmes in Uganda: why do some communities succeed and others fail?’,\nTHE OTHER DISEASES OF THE MDGS\n115\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nAnnals of Tropical Medicine and Parasitology, 94, 2000, pp 343–352; MN Katabarwa & F Richards,\n‘Community-directed health (CDH) workers enhance the performance and sustainability of CDH\nprogrammes: experience from ivermectin distribution in Uganda’, Annals of Tropical Medicine and\nParasitology, 95, 2001, pp 275–286; U Amazigo, ‘The challenges of community-directed treatment with\nivermectin (CDTI) within the African Programme for Onchocerciasis Control (APOC)’, Annals of\nTropical Medicine and Parasitology, 96, 2002, pp S41–S58; and M Parker, T Allen & J Hastings,\n‘Resisting control of neglected tropical diseases: dilemmas in the mass treatment of schistosomiasis\nand soil-transmitted helminths in north-west Uganda’, Journal of Biosocial Science, 40, 2008, pp 161–\n181.\n20 JH Kolaczinski, NB Kabatereine, AW Onapa, R Ndyomugyenyi, AS Kakembo & S Brooker,\n‘Neglected tropical diseases in Uganda: the prospect and challenge of integrated control’, Trends in\nParasitology, 23, 2007, pp 485–493; Kabatereine, cited in Lamey, ‘The unsung hero of neglected\ntropical diseases’; and NB Kabatereine, MMalecela, M Lado, S Zaramba, O Amiel & JH Kolaczinski,\n‘How to (or not to) integrate vertical programmes for the control of major neglected tropical diseases\nin sub-Saharan Africa’, PLoS Neglected Tropical Diseases, 4(6), 2010, p e755.\n21 J Utzinger, R Bergquist, X Shu-Hua, BH Singer & M Tanner, ‘Sustainable schistosomiasis control—\nthe way forward’, Lancet, 362, 2003, pp 1932–1934.\n22 Parker, ‘Resisting control of neglected tropical diseases’.\n23 PJ Lammie, A Fenwick & J Utzinger, ‘A blueprint for success: integration of neglected tropical disease\ncontrol programmes’, Trends in Parasitology, 22(7), 2006, pp 313–321; A Fenwick, ‘New initiatives\nagainst Africa’s worms’, Transactions of the Royal Society of Tropical Medicine and Hygiene, 100, 2006,\npp 200–207; and B Gryseels, ‘Mass treatment for worms is mistaken’, Financial Times, 23 November\n2006.\n24 ‘Evaluation: the top priority for global health’ (Editorial), Lancet, 375(9714), 2010, p 526.\n25 M Leach & J Fairhead, Vaccine Anxieties: Global Science, Child Health and Society, London:\nEarthscan Publications, 2007; M Yahya ‘Polio vaccines—‘‘No thank you!’’ Barriers to polio\neradication in northern Nigeria’, African Affairs, 106\/423, 2007, pp 185–204.\n26 I Harper, ‘Anthropology, DOTS and understanding tuberculosis control in Nepal’, Journal of Biosocial\nScience, 38(1), 2006, pp 57–67.\n27 Kabatereine et al, ‘Impact of a National Helminth Control Programme on infection and morbidity in\nUgandan schoolchildren’.\n28 S Brooker, NB Kabatereine, M Myatt, JR Stothard & A Fenwick, ‘Rapid assessment of Schistosoma\nmansoni: the validity, applicability and cost-effectiveness of the LOT Quality Assurance Sampling\nmethod in Uganda’, Tropical Medicine and International Health, 10(7), 2005, pp 647–658.\n29 www.SCI.org.uk, accessed 15 November 2008. The document referenced was subsequently taken down\nwhen the site was redesigned.\n30 Fleming et al, ‘Process evaluation of schistosomiasis control in Uganda’.\n31 RGN Lubanga, ‘District stakeholders’ perceptions of bilharzia and control activities in Uganda’,\nReport submitted to Bilharzia Control Programme, Vector Control Division, Ministry of Health,\n2007.\n32 M Parker & T Allen, ‘Does mass drug administration for the integrated treatment of neglected tropical\ndiseases really work? Assessing evidence for the control of schistosomiasis and soil-transmitted\nhelminths in Uganda’, Health Research Policy and Systems, in press.\n33 M Parker, ‘Re-assessing disability: the impact of schistosomal infection on daily activities among\nwomen in Gezira Province, Sudan’, Social Science and Medicine, 35(7), 1992, pp 877–890; and Parker,\n‘Bilharzia and the boys: questioning common assumptions’, Social Science and Medicine, 37(4), 1993,\npp 481–442.\n34 Kabatereine et al, ‘How to (or not to) integrate vertical programmes for the control of major neglected\ntropical diseases in sub-Saharan Africa’, PLoS Neglected Tropical Diseases 4(6), 2010, p 755.\n35 Ibid; and Parker et al, ‘Resisting control of neglected tropical diseases: dilemmas in the mass treatment\nof schistosomiasis and soil-transmitted helminths in north-west Uganda’.\n36 This information comes from data collected by Julie Hastings, one of our PhD students, who was\nworking in the area in 2008.\n37 A fascinating, and very carefully worded effort to outline some of the ongoing problems and suggest\nways of dealing with them is Kabatereine et al, PLoS Neglected Tropical Diseases. This paper has been\nwritten by key players in the Ugandan and Tanzanian NTD control programmes, together with\ncolleagues from Southern Sudan and Mozambique.\n38 Gryseels, ‘Mass treatment for worms is mistaken’.\n39 TL-A Tchuente, N Kabatereine, D Karanja & E Dennis, ‘Mass treatment for worms is the correct way\nfor Africa’, Financial Times, 16 November 2006.\n40 ‘Evaluation: the top priority for global health’.\nTIM ALLEN & MELISSA PARKER\n116\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \nNotes on contributors\nTim Allen is Professor in the Department of International Development at the\nLondon School of Economics and Political Science. He has carried out long-\nterm field research in Sudan and Uganda, and has also researched in Ghana,\nZimbabwe, Kenya, Tanzania and Botswana. His books include The Lord’s\nResistance Army: Myth and Reality (edited with Koen Vlassenroot); Trial\nJustice: The International Criminal Court and the Lord’s Resistance Army;\nComplex Emergencies and Humanitarian Responses (with Mareike Scho-\nmerus); and The Media of Conflict (edited with Jean Seaton). He has also\npublished numerous papers on tropical diseases, HIV\/AIDS and other health\nissues in Africa. In addition, he has worked as a consultant to various UN\nbodies and charities and has presented or contributed to numerous radio\nprogrammes. Melissa Parker is Director of the Centre for Research in\nInternational Medical Anthropology and Senior Lecturer in Anthropology at\nBrunel University. She has undertaken research on a wide range of global\nhealth issues, including HIV\/AIDS, female circumcision, mental health in war\nzones, health-related quality of life and neglected tropical diseases. Her\npublications include Learning from HIV\/AIDS (edited with George Ellison\nand Cathy Campbell), The Anthropology of Public Health (edited with Ian\nHarper); and articles including ‘Rethinking female circumcision’ and ‘Core\ngroups and the transmission of HIV: learning frommale prostitutes’; and more\nrecently several papers on control programmes for neglected tropical diseases.\nTHE OTHER DISEASES OF THE MDGS\n117\nD\now\nnl\noa\nde\nd \nby\n [L\nSE\n L\nibr\nary\n Se\nrv\nice\ns] \nat \n01\n:11\n 19\n D\nec\nem\nbe\nr 2\n01\n4 \n"}