{"doi":"10.1007\/s10803-009-0889-y","coreId":"15403","oai":"oai:dro.dur.ac.uk.OAI2:7445","identifiers":["oai:dro.dur.ac.uk.OAI2:7445","10.1007\/s10803-009-0889-y"],"title":"Impaired performance on see-know tasks amongst children with autism : evidence of specific difficulties with theory of mind or domain-general task factors ?","authors":["Lind, S.E.","Bowler, D.M."],"enrichments":{"references":[{"id":919151,"title":"Autism: Explaining the enigma.","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":919150,"title":"Beliefs about beliefs.","authors":[],"date":"1978","doi":null,"raw":null,"cites":null},{"id":922244,"title":"Children's understanding of belief: Why it is important to understand what happened. In","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":922245,"title":"Children’s understanding of informational access as a source of knowledge.","authors":[],"date":"1988","doi":"10.2307\/1130318","raw":null,"cites":null},{"id":922248,"title":"Correspondence concerning this article should be addressed to Sophie Lind,","authors":[],"date":"1988","doi":null,"raw":null,"cites":null},{"id":922243,"title":"Designing and Conducting Survey Research: A Comprehensive Guide (2nd Edition).","authors":[],"date":"1997","doi":null,"raw":null,"cites":null},{"id":919145,"title":"Diagnostic and statistical manual of mental disorders (4th edition - text revision).","authors":[],"date":"2000","doi":null,"raw":null,"cites":null},{"id":919154,"title":"Ignorance versus false belief: A developmental lag in attribution of epistemic states.","authors":[],"date":"1986","doi":null,"raw":null,"cites":null},{"id":922247,"title":"Meta-analyses comparing theory of mind abilities of individuals with autism, individuals with mental retardation, and normally developing individuals.","authors":[],"date":"1998","doi":"10.1037\/\/0033-2909.124.3.283","raw":null,"cites":null},{"id":919153,"title":"Methodological issues for experiments on autistic individuals perception and understanding of emotion.","authors":[],"date":"1991","doi":null,"raw":null,"cites":null},{"id":919149,"title":"On mosaics and melting pots: Conceptual considerations of comparison and matching strategies.","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":919148,"title":"Reasoning...what reasoning?","authors":[],"date":"2004","doi":null,"raw":null,"cites":null},{"id":919147,"title":"The 'seeing-leads-to-knowing' deficit in autism: The Pratt and Bryant probe.","authors":[],"date":"1994","doi":null,"raw":null,"cites":null},{"id":919146,"title":"The autistic child's theory of mind: A case of specific developmental delay.","authors":[],"date":"1989","doi":null,"raw":null,"cites":null},{"id":919152,"title":"The role of age and verbal ability in the theory of mind task performance of subjects with autism.","authors":[],"date":"1995","doi":null,"raw":null,"cites":null},{"id":922246,"title":"World Health Organization","authors":[],"date":"1993","doi":"10.2307\/2533484","raw":null,"cites":null}],"documentType":{"type":0.8888888889}},"contributors":[],"datePublished":"2010-04-01","abstract":"It is widely assumed that children with autism have a diminished understanding of the perception-knowledge relationship, as a specific manifestation of a theory of mind (ToM) impairment. However, such a conclusion may not be justified on the basis of previous studies, which have suffered from significant methodological weaknesses. The current study aimed to avoid such problems by adopting more stringent participant matching methods, using a larger sample (N = 80), and implementing a new, more rigorous control task in order to ensure that non-ToM task factors were not confounding results. After excluding children who failed the control task, it was found that children with autism were moderately impaired in their understanding of the perception-knowledge relationship, relative to age- and verbal ability matched comparison children","downloadUrl":"https:\/\/core.ac.uk\/download\/pdf\/15403.pdf","fullTextIdentifier":"http:\/\/dro.dur.ac.uk\/7445\/1\/7445.pdf","pdfHashValue":"bba945e01a7a88c2e2beea41116c88e002f1ddb0","publisher":"Springer","rawRecordXml":"<record><header><identifier>\n  \n    \n      oai:dro.dur.ac.uk.OAI2:7445<\/identifier><datestamp>\n      2010-11-18T10:26:25Z<\/datestamp><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        Impaired performance on see-know tasks amongst children with autism : evidence of specific difficulties with theory of mind or domain-general task factors ? <\/dc:title><dc:creator>\n        Lind, S.E.<\/dc:creator><dc:creator>\n        Bowler, D.M.<\/dc:creator><dc:description>\n        It is widely assumed that children with autism have a diminished understanding of the perception-knowledge relationship, as a specific manifestation of a theory of mind (ToM) impairment. However, such a conclusion may not be justified on the basis of previous studies, which have suffered from significant methodological weaknesses. The current study aimed to avoid such problems by adopting more stringent participant matching methods, using a larger sample (N = 80), and implementing a new, more rigorous control task in order to ensure that non-ToM task factors were not confounding results. After excluding children who failed the control task, it was found that children with autism were moderately impaired in their understanding of the perception-knowledge relationship, relative to age- and verbal ability matched comparison children. <\/dc:description><dc:subject>\n        Autism spectrum disorder<\/dc:subject><dc:subject>\n        Control task<\/dc:subject><dc:subject>\n         Ignorance<\/dc:subject><dc:subject>\n         Knowledge<\/dc:subject><dc:subject>\n         Perception<\/dc:subject><dc:subject>\n         Theory of mind. <\/dc:subject><dc:publisher>\n        Springer<\/dc:publisher><dc:source>\n        Journal of autism and developmental disorders, 2010, Vol.40(4), pp.479-484 [Peer Reviewed Journal]<\/dc:source><dc:date>\n        2010-04-01<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:identifier>\n        dro:7445<\/dc:identifier><dc:identifier>\n        issn:0162-3257<\/dc:identifier><dc:identifier>\n        issn: 1573-3432<\/dc:identifier><dc:identifier>\n        doi:10.1007\/s10803-009-0889-y <\/dc:identifier><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7445\/<\/dc:identifier><dc:identifier>\n        http:\/\/dx.doi.org\/10.1007\/s10803-009-0889-y <\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7445\/1\/7445.pdf<\/dc:identifier><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/dro.dur.ac.uk\/7445\/2\/7445v2.pdf<\/dc:identifier><dc:rights>\n        The original publication is available at www.springerlink.com\\ud\n<\/dc:rights><dc:accessRights>\n        info:en-repo\/semantics\/openAccess<\/dc:accessRights><\/oai_dc:dc><\/metadata><\/record>","journals":[{"title":null,"identifiers":["issn:0162-3257","0162-3257","issn: 1573-3432"," 1573-3432"]}],"language":{"code":"en","id":9,"name":"English"},"relations":[],"year":2010,"topics":["Autism spectrum disorder","Control task","Ignorance","Knowledge","Perception","Theory of mind."],"subject":["Article","PeerReviewed"],"fullText":"Durham Research Online\nDeposited in DRO:\n12 October 2010\nVersion of attached file:\nAccepted Version\nPeer-review status of attached file:\nPeer-reviewed\nCitation for published item:\nLind, S.E. and Bowler, D.M. (2010) ’Impaired performance on see-know tasks amongst children with autism :\nevidence of specific difficulties with theory of mind or domain-general task factors ?’, Journal of autism and\ndevelopmental disorders., 40 (4). pp. 479-484.\nFurther information on publisher’s website:\nhttp:\/\/dx.doi.org\/10.1007\/s10803-009-0889-y\nPublisher’s copyright statement:\nThe original publication is available at www.springerlink.com\nAdditional information:\nUse policy\nThe full-text may be used and\/or reproduced, and given to third parties in any format or medium, without prior permission or charge, for\npersonal research or study, educational, or not-for-profit purposes provided that:\n• a full bibliographic reference is made to the original source\n• a link is made to the metadata record in DRO\n• the full-text is not changed in any way\nThe full-text must not be sold in any format or medium without the formal permission of the copyright holders.\nPlease consult the full DRO policy for further details.\nDurham University Library, Stockton Road, Durham DH1 3LY, United Kingdom\nTel : +44 (0)191 334 3042 — Fax : +44 (0)191 334 2971\nhttp:\/\/dro.dur.ac.uk\n                                              Impaired performance on see-know tasks in autism 1\nArticle: Impaired performance on see-know tasks amongst children with autism: \nEvidence of specific difficulties with theory of mind or domain-general task factors?  \nSophie E. Lind and Dermot M. Bowler\nDepartment of Psychology, City University London, UK\nRunning head: Impaired performance on see-know tasks in autism\nThis article is published at Journal of Autism and Developmental Disorders.  Please quote \nonly from published version, which is available here: \nhttp:\/\/www.springerlink.com\/content\/354521164708w077\/\nFull reference: Lind, S. E., & Bowler, D. M. (2010). Impaired performance on see-know \ntasks amongst children with autism: Evidence of specific difficulties with theory of mind\nor domain-general task factors? Journal of Autism and Developmental Disorders, 40(4),\n479-484. DOI: 10.1007\/s10803-009-0889-y \n                                              Impaired performance on see-know tasks in autism 2\nAbstract\nIt is widely assumed that children with autism have a diminished understanding of the \nperception-knowledge relationship, as a specific manifestation of a theory of mind (ToM) \nimpairment.  However, such a conclusion may not be justified on the basis of previous \nstudies, which have suffered from significant methodological weaknesses.  The current \nstudy aimed to avoid such problems by adopting more stringent participant matching \nmethods, using a larger sample (N = 80), and implementing a new, more rigorous control \ntask in order to ensure that non-ToM task factors were not confounding results.  After \nexcluding children who failed the control task, it was found that children with autism \nwere moderately impaired in their understanding of the perception-knowledge \nrelationship, relative to age- and verbal ability-matched comparison children.     \nKeywords: Autism spectrum disorder; control task; ignorance; knowledge; perception; \ntheory of mind.  \nCorresponding author’s email address: sophie.lind.1@city.ac.uk\n                                              Impaired performance on see-know tasks in autism 3\nImpaired performance on see-know tasks amongst children with autism: Evidence of \nspecific difficulties with theory of mind or domain-general task factors?  \nAutism spectrum disorder (ASD) comprises a range of developmental disorders, \ncharacterised by impairments in social interaction, communication, and behavioural \nflexibility (American Psychiatric Association, 2000; World Health Organization, 1993).  \nOne of the most influential psychological explanations of the social and communication \nimpairments is that children with ASD have an attenuated theory of mind (ToM) (e.g., \nBaron-Cohen, 1989; Frith, 1989; Leslie, 1987).  ToM refers to the capacity to attribute \nmental states to self and others to explain and predict behaviour (Premack & Woodruff, \n1978).  The ability to ascribe false beliefs is considered by many to be the hallmark of a \nfully-fledged ToM (e.g., Dennett, 1978), and it has been consistently found, using a wide \nvariety of paradigms, that children with ASD show diminished performance on false \nbelief tasks (e.g., Happé, 1995; Yirmiya, Erel, Shaked, & Solomonica-Levi, 1998).   \nIn typical development, an important preceding step to false belief competence is \nacquiring the ability to attribute knowledge or ignorance of a given piece of information, \ndepending upon whether an individual has had perceptual access to that information \n(Hogrefe, Wimmer, & Perner, 1986; Wimmer & Gschaider, 2000; Wellman & Liu, \n2004).  Understanding of the relationship between perception and knowledge is most \ncommonly investigated using “see-know” tasks, which assess children’s understanding \nthat visual access to information is a way of gaining knowledge of that information \n(Wimmer, Hogrefe, & Perner, 1988).  In a typical see-know task, participants are \nrequired to ascribe knowledge or ignorance of the contents of an opaque box to \n                                              Impaired performance on see-know tasks in autism 4\nindividuals who either have or have not looked inside the box.  From around 3 years of \nage, typically developing children correctly attribute knowledge of the box’s contents \nonly to individuals who have seen inside the box (e.g., Pratt & Bryant, 1990).  \nOn the basis of such studies, it has been widely assumed that typically developing \nchildren below the age of 3 years lack an explicit conceptual understanding of knowledge \nstates (e.g., Perner, 1991).  However, innovative new research has called this view into \nquestion.  For example, Liszkowski, Carpenter, and Tomasello (2008) found that 12-\nmonth-old typically developing infants, who observed an adult searching for an object, \nwould communicatively point to the object to help the adult more frequently in \nconditions where the adult had not seen (and was therefore ignorant of) the location of \nthe object than in conditions where the adult had seen (and therefore knew) the location \nof the object.  Whilst it may be tempting to conclude that such selective pointing \ndemonstrates explicit conceptual understanding of knowledge states, such findings are far \nfrom unambiguous (Perner & Ruffman, 2005).  An arguably less controversial \ninterpretation of these findings is that such behaviour indexes the (pre-conceptual, \npossibly implicit) ability to detect knowledge states in others, rather than any conceptual \nunderstanding of mental states (e.g., Bremner & Mareschal, 2004; Hood, 2004).  Thus, \ntests such as those devised by Liszkowski et al. may assess the developmental precursors \nof conceptual understanding of knowledge states, whilst see-know tests directly assess \nconceptual understanding of knowledge states.\nGiven their characteristic limitations in false belief understanding, children with \nASD might also be expected to show an impaired understanding of the perception-\nknowledge relationship.  Indeed, two early studies (Leslie & Frith, 1988; Perner, Frith, \n                                              Impaired performance on see-know tasks in autism 5\nLeslie, & Leekam, 1989) found that children with ASD performed significantly less well \nthan children with specific language impairment (SLI) on standard see-know tasks.  \nHowever, in each of these studies, participants with ASD had substantially lower levels \nof verbal intelligence than comparison participants, with a discrepancy in mean levels of \nverbal IQ between the groups of over 23 points1, in each case.  As such, the observed \ndeficit amongst participants with ASD on each experimental task may have been merely \na consequence of their low levels of verbal intelligence, rather than the consequence of an \nASD-specific difficulty with representing the relationship between seeing and knowing \n(see Burack, Iarocci, Flanagan, & Bowler, 2004).\nMore recently, Kazak, Collis, and Lewis (1997) assessed understanding of the \nseeing-knowing relationship using a different kind of task from those used in the studies \nby Leslie and Frith (1988) and Perner et al. (1989).  In this study, participants with ASD, \nas well as matched comparison participants, observed another person being questioned \nabout the contents of an opaque box.  Participants witnessed that sometimes the other \nperson had seen inside the box before being asked about its contents, whereas on other \noccasions the person had not had such informational access.  Under each of these \nconditions, participants were asked to state whether the other person knew what was \ninside the box, or whether they had merely guessed the box’s contents when they were \nasked.  Kazak et al. found that, contrary to their predictions, low-functioning children \nwith ASD were no less able than age and verbal ability matched children with Down \nsyndrome, or verbal ability matched typically developing children, to succeed on this \ntask.  However, Kazak et al.’s results should be treated with some caution given that floor \neffects on the experimental task characterised each of these groups of participants.  \n                                              Impaired performance on see-know tasks in autism 6\nPotentially significant group differences in understanding of the relationship between \nseeing and knowing may, therefore, have been masked by the fact that none of the groups \nperformed at above chance level.  \nPerhaps the most widely cited evidence for an ASD-specific impairment in \nunderstanding of the seeing-knowing relationship emerges from a study by Baron-Cohen \nand Goodhart (1994).  Baron-Cohen and Goodhart compared the performance of 12 \nadolescents with ASD and 12 age and verbal ability matched comparison adolescents \nwith intellectual disability (ID) on a modified version of a paradigm previously \nimplemented with typically developing children by Pratt and Bryant (1990).  The task \ninvolved presenting participants with two dolls, named John and Fiona, and a series of \nfive small closed boxes, each containing an object.  Each test trial involved one of the \ndolls lifting a box and the other opening the box and looking inside.  Participants were \nthen asked the critical test question, “Who knows what’s in the box? John or Fiona?”, a \ncorrect answer being that only the doll who has had the relevant visual access will know \nwhat is inside.\nBaron-Cohen and Goodhart (1994, p.399) reported that participants with ASD \nperformed significantly less well than participants with ID on this task, with group \ndifferences being highly statistically significant (Fisher’s exact probability test, p < .01).  \nHowever, a careful consideration of Baron-Cohen and Goodhart’s results again leads to \nconcerns over the reliability of these findings.  There were some inconsistencies in the \nreporting of the results of the experiment, and a re-analysis of their data indicates that the \ngroups did not, in fact, perform significantly differently from each other.  \n                                              Impaired performance on see-know tasks in autism 7\nBaron-Cohen and Goodhart’s (1994) Table 2 displays the numbers of \nindividuals within the ASD and ID groups who passed the task (scored 5\/5) and failed the \ntask (scored < 5\/5).  Their Table 3 provides further detail, displaying the numbers of \nindividuals within each group who scored 0, 1, 2, 3, 4 and 5, respectively.  However, the \nresults from these tables do not tally.  Although both tables suggest that 4\/12 participants \nwith ASD passed the task (i.e., scored 5\/5 questions correctly), Table 2 suggests that 9\/12 \nparticipants with ID passed the task, whereas Table 3 suggests that 8\/12 participants with \nID passed the task.  Moreover, a re-analysis of these data reveals that the group \ndifference in the numbers of participants passing\/failing the task was only marginally \nsignificant, p (one-tailed) = .05 (if the results reported in Table 2 are taken to be correct) \nor non-significant p (one-tailed) = .11 (if the results reported in Table 3 are taken to be \ncorrect).  The fact that the group difference did not reach statistical significance is \nunsurprising, given the very small sample size involved.  We calculated the effect size for \nthe group difference and found it to be moderate,  = .33, or relatively strong,  = .42 \n(Rea & Parker, 1997), depending upon which results are taken to be correct.  This \nsuggests that if more participants had been tested, the effect may have reached \nsignificance.  \nDespite these issues, one important methodological improvement upon previous \nstudies was that Baron-Cohen and Goodhart (1994) introduced a pre-test control task, \ndesigned to ensure that any subsequent failure on the test itself was not due to a general \nfailure to follow the test procedure.  However, there are concerns over whether the task \nadequately served this purpose.  The control task involved six trials of the experimenter \ngiving a red counter to John and a blue counter to Fiona, or vice versa, and then asking \n                                              Impaired performance on see-know tasks in autism 8\nthe child, “Who has the red\/blue counter?”  All participants were found to pass at least \nfive out of six of these control questions, and it was assumed that all of the participants \nwould, therefore, be able to follow the test procedure.  However, the cognitive demands \nof the control questions differed considerably from those involved in the experimental \nquestions in at least three important respects.  The experimental questions, unlike the \ncontrol questions, involved (a) recalling an action (e.g., Fiona opened the box and looked \ninside), (b) making an inference based on that action (e.g., Fiona must, therefore, know \nwhat is inside the box), whilst (c) reasoning about unobservable variables.  These \ndifferences raise the possibility that those participants in Baron-Cohen and Goodhart’s \nstudy, who failed the task, may have done so because of difficulties with these extraneous \nfactors rather than because of a specific failure to represent the seeing-knowing \nrelationship.\nThus, previous studies of understanding the seeing-knowing relationship in ASD \nhave either found ASD-specific impairments, but failed to include an adequate \ncomparison group, or simply failed to find significant group differences.  So, although \nthere are legitimate theoretical reasons to predict that children with ASD will show an \nimpaired understanding of the perception-knowledge relationship (given that children \nwith ASD are thought to have difficulties with representing mental states), previous \nresearch has not demonstrated this to be the case.  The current study, therefore, aimed to \nassess understanding of the perception-knowledge relationship in ASD with a new, more \ncarefully controlled approach. \nWe decided to replicate Baron-Cohen and Goodhart’s (1994) version of Pratt and \nBryant’s (1990) task with a larger, carefully matched sample, and to design and \n                                              Impaired performance on see-know tasks in autism 9\nimplement our own, more rigorous control task.  Cognitive-experimental tasks, such as \nBaron-Cohen and Goodhart’s task, necessarily invoke multiple cognitive processes – they \nare rarely “pure” tests of a particular cognitive ability such as ToM.  Thus, one of the key \naims of the present study was to screen out non-ToM sources of task difficulty, thereby \nensuring that any group differences on the experimental task were specifically due to the \nhypothesised difficulty with understanding the perception-knowledge relationship.  \nHobson (1991) argues that one of the most powerful methods of determining ASD-\nspecific deficits in a particular cognitive ability is to develop a control task with cognitive \ndemands that closely mirror those of the experimental task except with respect to the key \nvariable of interest.  Thus, we aimed to develop a control task that was analogous to the \nexperimental task in as many respects as possible, whilst eliminating any reference to \nmental states.    \nA series of six new control questions was created.  These questions each required \nthe participant to recall an action and make an inference based on that action.  In order to \nequate the control and experimental questions as closely as possible, the control questions \nwere designed to require inferences about internal, unobservable (but not mental) states, \nsuch as feeling sick or cold.  This was intended to ensure that difficulties were not arising \nas a consequence of problems with reasoning about, or representing, unobservable \nvariables.  It was predicted that after excluding participants who failed the control task, \nparticipants with ASD would perform significantly less well on the test itself than \ncomparison participants.  \n                                              Impaired performance on see-know tasks in autism 10\nMethods\nParticipants\nApproval for this study was obtained from City University Senate Research Ethics \nCommittee.  Participants were recruited through schools located in South-East England.  \nThe parents of all participants gave informed, written consent for their children to take \npart.  The ASD and comparison groups each consisted of 40 participants who were \nindividually matched on chronological age (CA) and verbal mental age (VMA), as \nassessed with the British Picture Vocabulary Scale (Dunn, Dunn, Whetton, & Burley, \n1997).  Participant characteristics are presented in Table 1.\n[Place Table 1 about here]\nAll of the participants in the ASD group attended specialist autism schools or \nunits, for which entry required a formal diagnosis of autistic disorder, Asperger’s \ndisorder, pervasive developmental disorder not otherwise specified, or atypical autism \n(American Psychiatric Association, 2000; World Health Organization, 1993).  A \nthorough review of the participants’ Statements of Special Educational Needs2 confirmed \nthat they had all received formal diagnoses from qualified clinicians of autistic disorder \nor Asperger’s disorder, in accordance with internationally accepted criteria (American \nPsychiatric Association, 2000; World Health Organization, 1993).  \nThe comparison group consisted of children with general intellectual disability \n(ID; i.e., mental retardation) of unknown origin (n = 28; to act as matches for those \n                                              Impaired performance on see-know tasks in autism 11\nchildren with ASD who also had ID) and typically developing children (n = 12; to act as \nmatches for those children with ASD who did not have ID).  Potential comparison \nparticipants were excluded if they had received specific diagnoses, such as dyslexia, \nDown syndrome or attention deficit hyperactivity disorder (given that such diagnoses are \nfrequently associated with atypical cognitive profiles, thereby making it difficult to draw \nuseful conclusions from any observed group differences on experimental tasks).  Any \nmention of social communication difficulties in any comparison child’s Statement of \nSpecial Educational Needs resulted in exclusion from the comparison group, as this may \nhave been indicative of ASD-related symptoms or even undiagnosed ASD.\nMaterials and procedure\nThe experimenter introduced two “Playmobil” dolls as John and Fiona, and then asked \nthe child to identify each doll by name.  For the control procedure, the children were told \nthe following series of one-sentence stories, which were each followed by a question: \n1. “Fiona and John go out to play in the park.  Fiona falls over and cuts her knees and \nJohn gets muddy knees.  Who gets sore knees?”\n2. “John does some colouring while Fiona goes for a long run.  Who gets tired out?”\n3. “It's snowing outside.  Fiona goes outside to make a snowman while John stays indoors \nby the fire and reads a book.  Who gets cold?”\n                                              Impaired performance on see-know tasks in autism 12\n4. “John and Fiona are very hungry. Fiona has a small glass of water and John has a big \nroast dinner.  Who gets full up?”\n5. “John and Fiona go to the beach. John lies down in the sun while Fiona goes \nswimming.  Who gets hot?” \n6. “John and Fiona go to a birthday party.  John has one plate of food and Fiona eats all \nthe cakes and ice cream.  Who starts feeling sick?”\nThe order of the stories and the position of the key information bearing part of the story \n(e.g. “falls over and cuts her knees”) were fully counterbalanced across conditions.  \nParticipants were randomly assigned to each condition without replacement.  For the test \nphase, the children were shown five boxes, each with a distinct appearance, and each \ncontaining a different toy object.  They were told, “Look I’ve got some boxes here.  \nThere’s something inside each box.  I’m going to show the boxes to John and Fiona.”   \nThey were then given the test questions, which were acted-out by the experimenter and \nwhich took the form:  “John lifts up the box and Fiona opens the box and has a look.  \nWho knows what’s in the box?” The order of characters\/looking and lifting was \nrandomly assigned for each of the five questions. Importantly, the participant was not \nallowed to see inside the boxes until the questioning was completed.  \n                                              Impaired performance on see-know tasks in autism 13\nScoring\nIn terms of performance on the see-know task, participants who scored 4 or 5 (out of 5) \nwere deemed to have “passed”, and participants who scored 0 to 3 were deemed to have \n“failed”.  In terms of control task performance, participants who scored 5 or 6 (out of 6) \nwere deemed to have “passed”, and participants who scored 0 to 4 were deemed to have \n“failed”.  These criteria were selected in order to ensure that participants were (a) not \npenalised for making a single mistake due (for example) to loss of concentration and (b) \nunlikely to pass by chance alone.  The probability of succeeding on a single trial in either \nthe control task or the see-know task was .50.  Therefore, the probabilities of scoring 5 or \n6 (out of 6) on the control task were .03 and .02, respectively, and the probabilities of \nscoring 4 or 5 (out of 5) on the see-know task were .06 and .03, respectively.  \nStatistical Analyses\nStatistical analyses were conducted using SPSS 16.0 for Windows.  Chi-square or \nFisher’s exact probability tests were used to analyse categorical data and independent t-\ntests were used to analyse continuous data.  The effect size measures  (phi) and r were \nused to accompany chi-square\/Fisher’s exact probability tests and independent t-tests, \nrespectively.  \nResults\nTwenty-four (60.0%) participants with ASD and 36 (90.0%) comparison participants \npassed the see-know task.  A chi-square test indicated that this group difference was \n                                              Impaired performance on see-know tasks in autism 14\nstatistically significant, ² (1, N = 80) = 9.66, p < .01,  = .35.  Twenty-nine (72.5%) \nparticipants with ASD and 37 (92.5%) comparison participants passed the control task.  \nAgain, this group difference was found to be significant, ² (1, N = 80) = 5.54, p = .04, \n= .26.  Table 2 shows the numbers of participants in each group who passed\/failed the \nsee-know test and control questions.\n[Table 2 here]\nThe fact that the ASD group performed significantly less well on the control task \nthan the comparison group suggests that their poorer performance on the experimental \ntask may not have been specifically due to a difficulty with representing mental states.  \nThus, in order to ensure that group differences on the see-know test itself were not \nentirely accounted for by non-ToM factors, further analyses were conducted.  Individuals \nwho failed the control task (ASD n = 11; comparison n = 3) were excluded from the \nsample and the see-know test data were re-analysed.  After these participants were \nexcluded, the groups remained equated on CA, VMA, and VIQ – there were no \nsignificant group differences on any of these variables and the effect sizes were all \nnegligible to small, indicating close matching (all ts < 1.07, all ps > .29, all rs < .13).  \nHaving excluded participants who failed the control task, it was found that 21\/29 \n(79.4%) participants with ASD and 35\/37 (94.6%) comparison participants passed the \nsee-know test.  This difference was found to be significant, Fisher’s exact probability \ntest3, p = .02,  = .31.  This effect is considered to be moderately strong (Rea & Parker, \n1997).  \n                                              Impaired performance on see-know tasks in autism 15\nDiscussion\nIn the current study, children with ASD were found to perform significantly less well \nthan age and verbal ability matched comparison children on a task designed to assess \nexplicit understanding of the relationship between informational access and knowledge.  \nAs far as we are aware, this is the first study to unambiguously demonstrate a diminished \nunderstanding of this relationship amongst children with ASD.  Although previous \nstudies have reported ASD-specific deficits in this regard, the results of each was \nquestioned on the basis either that (a) an appropriate comparison group (matched for age \nand verbal ability) was not included (Leslie & Frith, 1988; Perner, Frith, Leslie, & \nLeekam, 1989) or (b) results were misreported, and therefore differences between groups \nwere not statistically significant, as originally suggested (Baron-Cohen & Goodhart, \n1994).  \nThe results of the current study are contrary to those of Kazak et al. (1997), who \nfound no significant differences between appropriately matched children with and \nwithout ASD on a task designed to assess the distinction between knowing and guessing.  \nHowever, given the floor effects on this task observed amongst participants in Kazak et \nal.’s study, their results should be treated with some caution.  In the current study, there \nwere neither floor nor ceiling effects on the experimental task, making interpretation of \nresults more reliable.  \nThere are further reasons to suppose that the diminution in understanding of the \nseeing-knowing relationship observed amongst participants with ASD in the current \nstudy is genuine.  Firstly, the present study utilised a substantially larger sample (N = 80) \n                                              Impaired performance on see-know tasks in autism 16\nthan previous studies.  Indeed, it seems likely that the between-group difference in \nBaron-Cohen and Goodhart’s (1994) experimental task did not reach statistical \nsignificance because each group comprised only 12 participants.  Secondly, and most \nimportantly, the current study is arguably the only study to include a control task, which \nis adequate to ensure that any deficits on the experimental task were due to a specific \ndifficulty with representing the seeing-knowing relationship, as opposed to difficulties \nwith other task demands (see Hobson, 1991, for a general discussion of such \nmethodological issues).  \nIndeed, an important finding was that participants with ASD performed \nsignificantly less well than comparison participants on the control task as well as the \nexperimental task.  This suggests that the failure of some individuals with ASD on the \nexperimental task could well have been due to difficulties with “extraneous” task factors, \nwhich may have included (a) recalling an action, (b) making an inference based on that \naction, (c) reasoning about unobservable variables, or perhaps (d) diminished awareness \nof physiological states per se.  This highlights the importance of having included a\ncomprehensive control task.  Crucially, it was found that after excluding participants who \nfailed the control task, differences between the (still well matched) groups in see-know \ntask performance remained significant, with a moderate effect size ( = .31).  This \nmethodological control, which has not been included in previous studies, confirms our \nhypothesis that children with ASD have a specific deficit in understanding that seeing \nleads to knowing.  \n  Future research may seek to investigate whether the more basic (possibility pre-\ncursor) ability to detect knowledge states is diminished in ASD in addition to the ability \n                                              Impaired performance on see-know tasks in autism 17\nto infer knowledge states, as demonstrated by the present study.  Future research may \nalso benefit from the inclusion of quantitative diagnostic measures to enable an \nexploration of whether experimental task performance relates to ASD symptom severity.  \n                                              Impaired performance on see-know tasks in autism 18\nReferences\nAmerican Psychiatric Association (2000). Diagnostic and statistical manual of mental \ndisorders (4th edition - text revision). New York: American Psychiatric \nAssociation.\nBaron-Cohen, S. (1989). The autistic child's theory of mind: A case of specific \ndevelopmental delay. Journal of Child Psychology and Psychiatry, 30, 285-297.\nBaron-Cohen, S. & Goodhart, F. (1994). The 'seeing-leads-to-knowing' deficit in autism: \nThe Pratt and Bryant probe. British Journal of Developmental Psychology, 12,\n397-401.\nBremner, A. J. & Mareschal, D. (2004). Reasoning...what reasoning? Developmental \nScience, 7, 419-421.\nBurack, J. A., Iarocci, G., Flanagan, T. D., & Bowler, D. M. (2004). On mosaics and \nmelting pots: Conceptual considerations of comparison and matching strategies. \nJournal of Autism and Developmental Disorders, 34, 65-73.\nDennett, D. C. (1978). Beliefs about beliefs. Behavioural and Brain Sciences, 1, 568-570.\nDunn, L. M., Dunn, L. M., Whetton, C., & Burley, L. (1997). British Picture Vocabulary \nScale (2nd Edition).  Windsor: NFER-Nelson.\n                                              Impaired performance on see-know tasks in autism 19\nFrith, U. (1989). Autism: Explaining the enigma. Oxford: Blackwell.\nHappé, F. G. E. (1995). The role of age and verbal ability in the theory of mind task \nperformance of subjects with autism. Child Development, 66, 843-855.\nHobson, R. P. (1991). Methodological issues for experiments on autistic individuals \nperception and understanding of emotion. Journal of Child Psychology and \nPsychiatry, 32, 1135-1158.\nHogrefe, G.-J., Wimmer, H., & Perner, J. (1986). Ignorance versus false belief: A \ndevelopmental lag in attribution of epistemic states. Child Development, 57, 567-\n582.\nHood, B. (2004). Is looking good enough or does it beggar belief? Developmental \nScience, 7, 415-421.\nKazak, S., Collis, G. M., & Lewis, V. (1997). Can young people with autism refer to \nknowledge states? Evidence from their understanding of \"know\" and \"guess\". \nJournal of Child Psychology and Psychiatry, 38, 1001-1009.\nLeslie, A. M. (1987). Pretense and representation: The origins of theory of mind. \nPsychological Review, 94, 412-426.\n                                              Impaired performance on see-know tasks in autism 20\nLeslie, A. M. & Frith, U. (1988). Autistic children's understanding of seeing, knowing \nand believing. British Journal of Developmental Psychology, 6, 315-324.\nLiszkowski, U., Carpenter, M., & Tomasello, M. (2008). Twelve-month-olds \ncommunicate helpfully and appropriately for knowledgeable and ignorant \npartners. Cognition, 108, 732-739.\nPerner, J. (1991). Understanding the representational mind. Cambridge, MA: MIT Press.\nPerner, J., Frith, U., Leslie, A. M., & Leekam, S. R. (1989). Exploration of the autistic \nchild's theory of mind: Knowledge, belief, and communication. Child \nDevelopment, 60, 689-700.\nPerner, J. & Ruffman, T. (2005). Infants' insight into the mind: How deep? Science, 308,\n214-216.\nPratt, C. & Bryant, P. (1990). Young children understand that looking leads to knowing \n(so long as they are looking into a single barrel). Child Development, 61, 973-982.\nPremack, D. & Woodruff, G. (1978). Does the chimpanzee have a theory of mind? \nBehavioral and Brain Sciences, 1, 515-526.\nRea, L. M. & Parker, R. A. (1997). Designing and Conducting Survey Research: A \nComprehensive Guide (2nd Edition). San Francisco, CA: Jossey-Bass.\n                                              Impaired performance on see-know tasks in autism 21\nWellman, H. M. & Liu, D. (2004). Scaling of theory of mind tasks. Child Development, \n75, 523-541.\nWimmer, H. & Gschaider, A. (2000). Children's understanding of belief: Why it is \nimportant to understand what happened. In P. Mitchell & K. J. Riggs (Eds.), \nChildren's reasoning and the mind (pp. 253-266). Hove: Psychology Press.\nWimmer, H., Hogrefe, G. J., & Perner, J. (1988). Children’s understanding of \ninformational access as a source of knowledge. Child Development, 59, 386-396.\nWorld Health Organization (1993). International classification of diseases (10th edition).\nGeneva: World Health Organization.\nYirmiya, N., Erel, O., Shaked, M., & Solomonica-Levi, D. (1998). Meta-analyses \ncomparing theory of mind abilities of individuals with autism, individuals with \nmental retardation, and normally developing individuals. Psychological Bulletin, \n124, 283-307.\n                                              Impaired performance on see-know tasks in autism 22\nAuthor note\nSophie Lind, Department of Psychology, City University, London, UK.  Dermot Bowler, \nDepartment of Psychology, City University, London, UK.\nThis research was supported by a City University PhD Studentship awarded to the first \nauthor.  This manuscript was prepared during a Mentor-Based Postdoctoral Fellowship \nawarded to the authors by Autism Speaks.  We would like to thank the following schools \nfor their participation in this research: Bensham Manor, Brent Knoll, Hillingdon Manor, \nKilmorie, Linden Bridge, Southmead, Pendragon, St. Winifred’s, The Park, and West \nWimbledon.  Finally, we are extremely grateful to Dr David Williams, Dr Sebastian \nGaigg, Professor Chris Jarrold, and the anonymous reviewers of this manuscript for \nhelpful comments on an earlier draft.  \nCorrespondence concerning this article should be addressed to Sophie Lind, Department \nof Psychology, City University, Northampton Square, London, EC1V 0HB, UK.  Tel: \n+44 (0) 20 7040 8544.  Fax: +44 (0) 20 7040 8581.  Email: Sophie.Lind.1@city.ac.uk.\n                                              Impaired performance on see-know tasks in autism 23\nFootnotes\n1 Neither Leslie and Frith (1988) nor Perner et al. (1989) reported verbal IQ scores in \ntheir papers.  However, we estimated the mean group VIQs from the VMAs and CAs \nreported in Leslie and Frith’s Table 1 and Perner et al.’s Table 2, using the formula: VIQ \n= (VMA \/CA) x 100.  These calculations indicated that the autistic and SLI groups had \nmean VIQs of approximately 52 and 78, respectively, in Leslie and Frith’s study, and \napproximately 54 and 78, respectively, in Perner et al.’s study.   \n2A Statement of Special Education Needs is a document, based on an assessment by the \nlocal authority, which provides a detailed description of any special needs (e.g., ASD, \nintellectual disability, dyslexia, etc.), including diagnostic information and a \ndevelopmental history.  \n3Given that one of the cells had an expected count of less than 5, a Fisher’s exact \nprobability test was used rather than a chi-square test.  \n                                              Impaired performance on see-know tasks in autism 24\nTable 1 \nParticipant Characteristics \nASD (n = 40, 10 female) Comparison (n = 40, 11 female)\nCharacteristic M SD Range M SD Range t(78) p r\nCA 10.42 3.55 5.00 - 17.08 10.50 4.04 4.58 - 15.67  0.10 .92 .01\nVMA 6.77 2.19 3.00 - 11.33 6.73 2.03 3.25 – 10.83 0.09 .93 .01\nVIQ 75.23 16.75 39 - 102 75.00 20.71 39 – 107 0.05 .96 .01\nNote: CA = chronological age; VMA = verbal mental age; VIQ = verbal IQ; Ages are in years; \nVMA and VIQ are based on BPVS scores.\nTable 2\nContingency Table Showing Numbers of Participants in Each Group who Passed\/Failed \nthe See-Know Test and Control Questions\nTest questions\nASD Comparison\nPass Fail Pass Fail\nControl questions Pass 21 8 35 2\nFail 3 8 1 2\n"}