{"doi":"10.1186\/1472-6920-10-64","coreId":"19010","oai":"oai:eprints.bham.ac.uk:578","identifiers":["oai:eprints.bham.ac.uk:578","10.1186\/1472-6920-10-64"],"title":"How are \"teaching the teachers\" courses in evidence based medicine evaluated? A systematic review","authors":["Walczak, Jacek","Kaleta, Anna","Gabryś, Elżbieta","Kloc, Krzysztof","Thangaratinam, Shakila","Barnfield, Gemma","Weinbrenner, Susanne","Meyerrose, Berit","Arvanitis, Theodoros N","Horvath, Andrea R","Zanrei, Gianni","Kunz, Regina","Suter, Katja","Burnand, Bernard","Arditi, Chantal","Oude Rengerink, Katrien","Harry, Gee","Mol, Ben WJ","Khan, Khalid S"],"enrichments":{"references":[],"documentType":{"type":1}},"contributors":[],"datePublished":"2010-09-29","abstract":"Background \nTeaching of evidence-based medicine (EBM) has become widespread in medical education. Teaching the teachers (TTT) courses address the increased teaching demand and the need to improve effectiveness of EBM teaching. We conducted a systematic review of assessment tools for EBM TTT courses. To summarise and appraise existing assessment methods for teaching the teachers courses in EBM by a systematic review. \n \nMethods \nWe searched PubMed, BioMed, EmBase, Cochrane and Eric databases without language restrictions and included articles that assessed its participants. Study selection and data extraction were conducted independently by two reviewers. \n \nResults \nOf 1230 potentially relevant studies, five papers met the selection criteria. There were no specific assessment tools for evaluating effectiveness of EBM TTT courses. Some of the material available might be useful in initiating the development of such an assessment tool. \n \nConclusion \nThere is a need for the development of educationally sound assessment tools for teaching the teachers courses in EBM, without which it would be impossible to ascertain if such courses have the desired effect","downloadUrl":"","fullTextIdentifier":null,"pdfHashValue":null,"publisher":"BioMed Central","rawRecordXml":"<record><header><identifier>\n    \n    \n      oai:eprints.bham.ac.uk:578<\/identifier><datestamp>\n      2011-10-12T11:09:08Z<\/datestamp><setSpec>\n      7374617475733D707562<\/setSpec><setSpec>\n      7375626A656374733D52:5231<\/setSpec><setSpec>\n      7375626A656374733D54:5441<\/setSpec><setSpec>\n      74797065733D61727469636C65<\/setSpec><\/header><metadata><oai_dc:dc xmlns:oai_dc=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/\" xmlns:dc=\"http:\/\/purl.org\/dc\/elements\/1.1\/\" xmlns:xsi=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsi:schemaLocation=\"http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc\/ http:\/\/www.openarchives.org\/OAI\/2.0\/oai_dc.xsd\" ><dc:title>\n    \n      \n        How are \"teaching the teachers\" courses in evidence based medicine evaluated? A systematic review<\/dc:title><dc:creator>\n        Walczak, Jacek<\/dc:creator><dc:creator>\n        Kaleta, Anna<\/dc:creator><dc:creator>\n        Gabryś, Elżbieta<\/dc:creator><dc:creator>\n        Kloc, Krzysztof<\/dc:creator><dc:creator>\n        Thangaratinam, Shakila<\/dc:creator><dc:creator>\n        Barnfield, Gemma<\/dc:creator><dc:creator>\n        Weinbrenner, Susanne<\/dc:creator><dc:creator>\n        Meyerrose, Berit<\/dc:creator><dc:creator>\n        Arvanitis, Theodoros N<\/dc:creator><dc:creator>\n        Horvath, Andrea R<\/dc:creator><dc:creator>\n        Zanrei, Gianni<\/dc:creator><dc:creator>\n        Kunz, Regina<\/dc:creator><dc:creator>\n        Suter, Katja<\/dc:creator><dc:creator>\n        Burnand, Bernard<\/dc:creator><dc:creator>\n        Arditi, Chantal<\/dc:creator><dc:creator>\n        Oude Rengerink, Katrien<\/dc:creator><dc:creator>\n        Harry, Gee<\/dc:creator><dc:creator>\n        Mol, Ben WJ<\/dc:creator><dc:creator>\n        Khan, Khalid S<\/dc:creator><dc:subject>\n        R Medicine (General)<\/dc:subject><dc:subject>\n        TA Engineering (General). Civil engineering (General)<\/dc:subject><dc:description>\n        Background \nTeaching of evidence-based medicine (EBM) has become widespread in medical education. Teaching the teachers (TTT) courses address the increased teaching demand and the need to improve effectiveness of EBM teaching. We conducted a systematic review of assessment tools for EBM TTT courses. To summarise and appraise existing assessment methods for teaching the teachers courses in EBM by a systematic review. \n \nMethods \nWe searched PubMed, BioMed, EmBase, Cochrane and Eric databases without language restrictions and included articles that assessed its participants. Study selection and data extraction were conducted independently by two reviewers. \n \nResults \nOf 1230 potentially relevant studies, five papers met the selection criteria. There were no specific assessment tools for evaluating effectiveness of EBM TTT courses. Some of the material available might be useful in initiating the development of such an assessment tool. \n \nConclusion \nThere is a need for the development of educationally sound assessment tools for teaching the teachers courses in EBM, without which it would be impossible to ascertain if such courses have the desired effect.<\/dc:description><dc:publisher>\n        BioMed Central<\/dc:publisher><dc:date>\n        2010-09-29<\/dc:date><dc:type>\n        Article<\/dc:type><dc:type>\n        PeerReviewed<\/dc:type><dc:format>\n        application\/pdf<\/dc:format><dc:identifier>\n        http:\/\/eprints.bham.ac.uk\/578\/1\/Arvanitis_2010_BMC_Medical_Education.pdf<\/dc:identifier><dc:relation>\n        public<\/dc:relation><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/578\/1.hassmallThumbnailVersion\/Arvanitis_2010_BMC_Medical_Education.pdf<\/dc:relation><dc:relation>\n        http:\/\/dx.doi.org\/10.1186\/1472-6920-10-64<\/dc:relation><dc:identifier>\n        Walczak, Jacek and Kaleta, Anna and Gabryś, Elżbieta and Kloc, Krzysztof and Thangaratinam, Shakila and Barnfield, Gemma and Weinbrenner, Susanne and Meyerrose, Berit and Arvanitis, Theodoros N and Horvath, Andrea R and Zanrei, Gianni and Kunz, Regina and Suter, Katja and Burnand, Bernard and Arditi, Chantal and Oude Rengerink, Katrien and Harry, Gee and Mol, Ben WJ and Khan, Khalid S (2010) How are \"teaching the teachers\" courses in evidence based medicine evaluated? A systematic review. BMC Medical Education, 10 (1). p. 64. ISSN 1472-6920<\/dc:identifier><dc:relation>\n        http:\/\/eprints.bham.ac.uk\/578\/<\/dc:relation><dc:language>\n        English<\/dc:language><\/oai_dc:dc><\/metadata><\/record>","journals":null,"language":{"code":"en","id":9,"name":"English"},"relations":["public","http:\/\/eprints.bham.ac.uk\/578\/1.hassmallThumbnailVersion\/Arvanitis_2010_BMC_Medical_Education.pdf","http:\/\/dx.doi.org\/10.1186\/1472-6920-10-64","http:\/\/eprints.bham.ac.uk\/578\/"],"year":2010,"topics":["R Medicine (General)","TA Engineering (General). Civil engineering (General)"],"subject":["Article","PeerReviewed"],"fullText":"RESEARCH ARTICLE Open Access\nHow are “teaching the teachers” courses in\nevidence based medicine evaluated?\nA systematic review\nJacek Walczak1*, Anna Kaleta1, Elżbieta Gabryś1, Krzysztof Kloc1, Shakila Thangaratinam2,3, Gemma Barnfield2,3,\nSusanne Weinbrenner4, Berit Meyerrose4, Theodoros N Arvanitis3, Andrea R Horvath5, Gianni Zanrei6, Regina Kunz7\n, Katja Suter7, Bernard Burnand9, Chantal Arditi9, Katrien Oude Rengerink8, Gee Harry2, Ben WJ Mol8,\nKhalid S Khan2,3\nAbstract\nBackground: Teaching of evidence-based medicine (EBM) has become widespread in medical education. Teaching\nthe teachers (TTT) courses address the increased teaching demand and the need to improve effectiveness of EBM\nteaching. We conducted a systematic review of assessment tools for EBM TTT courses. To summarise and appraise\nexisting assessment methods for teaching the teachers courses in EBM by a systematic review.\nMethods: We searched PubMed, BioMed, EmBase, Cochrane and Eric databases without language restrictions and\nincluded articles that assessed its participants. Study selection and data extraction were conducted independently\nby two reviewers.\nResults: Of 1230 potentially relevant studies, five papers met the selection criteria. There were no specific\nassessment tools for evaluating effectiveness of EBM TTT courses. Some of the material available might be useful in\ninitiating the development of such an assessment tool.\nConclusion: There is a need for the development of educationally sound assessment tools for teaching the\nteachers courses in EBM, without which it would be impossible to ascertain if such courses have the desired effect.\nBackground\nEvidence-based medicine (EBM), is defined as the inte-\ngration of the best research evidence with patient’s\nvalues and clinical circumstances for clinical decision\nmaking [1]. However, for EBM to become a reality for\npractice, studies have shown that it needs to be taught\nby competent clinical trainers, who help trainees to\nlearn efficiently by exploiting on-the-job learning oppor-\ntunities [2]. Trainers who have received formal EBM\ntraining are more likely to teach application of EBM in\na clinical setting [3]. Teaching EBM should not only\nequip practitioners with knowledge and skills but also\nfoster their attitudes and encourage the practice of\nEBM. Critical appraisal and EBM teaching that is inte-\ngrated into clinical practice appears to be effective in\nimproving substantial outcomes, including behavioural\nchanges [4]. One of the objectives of TTT courses\nshould be to bring about a positive change in the tea-\ncher’s knowledge, skills and attitude towards EBM\nteaching in a clinical setting. For professional develop-\nment in this field, many trainers attend teaching the tea-\nchers (TTT) courses for EBM, which are widespread.\nThe Leonardo da Vinci programme, part of the Eur-\nopean Commission’s Lifelong Learning Programme, has\nfunded a EU project involving collaboration of 10 part-\nners within Europe to design an e-learning curriculum\nfor continuing professional development (CPD) on how\nto teach EBM in a clinical setting http:\/\/www.ebm-unity.\norg[5,6]. Through this project, we have developed a Eur-\nopean qualification in Teaching Evidence-Based Medi-\ncine which aims to improve transparency across the\nEuropean healthcare sector [7]. Often teachers assess\ntheir own learning through their students’ feedback.\n* Correspondence: jacek.walczak@caspin.org.pl\n1CASPolska, 32-400 Myślenice, ul. Mickiewicza 40, Poland\nFull list of author information is available at the end of the article\nWalczak et al. BMC Medical Education 2010, 10:64\nhttp:\/\/www.biomedcentral.com\/1472-6920\/10\/64\n© 2010 Walczak et al; licensee BioMed Central Ltd. This is an Open Access article distributed under the terms of the Creative Commons\nAttribution License (http:\/\/creativecommons.org\/licenses\/by\/2.0), which permits unrestricted use, distribution, and reproduction in\nany medium, provided the original work is properly cited.\nHowever, this may be naive as it is well known that\nthere is no direct relationship between feedback and\nlearning achievement [8,9]. The use of assessment tools\nif any to evaluate such courses is unknown. There are\ncurrently many courses that train the trainer in teaching\nEBM skills. A review of assessment tools used for such\ncourses can help us to gauge how TTT courses are eval-\nuated. We aimed to systematically review existing\nassessment tools used to evaluate TTT courses in EBM.\nMethods\nThe systematic review has been conducted by a well\ndesigned protocol using robust methodology [10,11] to\nallow us to identify educationally sound assessments of\nEBM TTT courses.\nWe searched the following databases from database\ninception to November 2008: PubMed, EmBase,\nBioMed, Cochrane Library and Eric (Education\nResources Information Centre, a collection of biblio-\ngraphic records of education literature). Search strate-\ngies for electronic databases were developed based on\nthe review of known relevant literature, and combined\nMeSH and free text terms, as shown in Additional File\n1. We handsearched relevant papers identified through\nthe reference list of retrieved articles, examined our\nConsortium’s personal files, explored for related articles\nin Pubmed and searched citations in Google Scholar.\nNo language restrictions were applied. Target audiences\nof the course (teachers) were defined as any health care\nprofessional with teaching responsibilities. The defini-\ntion of a TTT course was based on three characteristics:\nthe aim of the course, the type of participants, and the\npresence of an assessment strategy. We selected the\ncourses that were related to learning teaching skills in\nEBM. We included papers that reported development,\nvalidation or implementation of any assessment tool or\nmethods to evaluate an EBM TTT course. Due to the\nspecificity of the subject matter we did not use restric-\ntive inclusion criteria related to study quality. All titles\nand abstracts were screened by two reviewers for studies\nthat met the inclusion criteria. Any disagreement\nbetween reviewers was resolved by consensus. We\nextracted data on the course objectives, duration, target\naudience, teaching methods, assessment strategy and key\noutcomes.\nResults\nOur search identified 1230 primary articles, of which\nfive were included in the review (Figure 1). The sum-\nmary of all TTT courses, which have been included in\nthis systematic review is shown in Additional File 2,\nproviding details of course objectives, target audience,\nteaching methods, duration of course, assessment meth-\nods and key outcomes.\nThe target audience of the EBM TTT courses identi-\nfied in the review were faculty members in family prac-\ntice residences who help residents develop skills in the\nuse of informatics and evidence based medicine [12],\npodiatric medical educators [13], clinical teachers, and\nlibrarians [14-16]. Diverse teaching methods such as\ninstructional workshops, facilitated discussions, hands-\non exercises and small group sessions were used in the\ncourses. We did not identify a clinically integrated\ncourse teaching application of EBM in routine clinical\npractice. The total duration of these courses varied from\n1 day to 24 months.\nThe courses used various assessment tools indepen-\ndent of the teaching method to evaluate the effective-\nness of the course. The most popular method of course\nassessment was pre-and post-course appraisal as\nobserved in three of the five chosen articles [12,13,15].\nOne course surveyed the participants only once, after\nthe completetion of the course. The most detailed\nassessment method to study the effectiveness of the\ncourse was by Scherrer et al [16]. It was a collaboration\nbetween librarians and medical faculty to train librarians\nand health professionals to teach principles of EBM.\nEBM principles and skills were presented and appropri-\nate teaching methods and techniques were considered.\nAs a method of evaluation, a questionnaire with twenty\nquestions was created and designed to be completed by\na twenty-minute telephone interview. After a pilot pro-\nject, the final survey contained twenty-three questions\nthat took about fifteen minutes to complete. Respon-\ndents were asked to state if the course resulted in\nincreased teaching of EBM concepts by the participants\nand methods used when they returned to their institu-\ntions. It explained the influence of the course on the\nparticipants in teaching EBM principles, their under-\nstanding of EBM principles and confidence in teaching\nEBM concepts. One of the questions aimed to identify\nthe barriers faced by the participants in teaching EBM.\nThe components of this questionnaire may constitute a\nbasis for the development of an assessment tool to eval-\nuate teaching the teachers courses for EBM [16].\nDiscussion\nThis review has revealed variations in the content of\nEBM courses, their duration, methods of teaching and\ncourse assessment. The reviewers have identified a sub-\nstantial gap in assessment methods for the evaluation of\nEBM TTT courses. Very few studies in this field had\nany detail of course assessments. Existing assessment\nmethods are very few and of poor quality. Moreover the\nidentified assessment tools were intended for teacher’\ncourses focused on courses conducted traditionally\n(workshops, one-to-one consultation, lectures) rather\nthan clinically integrated courses.\nWalczak et al. BMC Medical Education 2010, 10:64\nhttp:\/\/www.biomedcentral.com\/1472-6920\/10\/64\nPage 2 of 5\nOur review has been the first one to systematically\nsearch for assessment tools for teaching the teachers\ncourses in EBM. It was systematically conducted with\nrigorous methodology and has comprehensively\nsearched, identified and described existing tools for\nassessing EBM TTT courses. The findings of the review\nare limited by the small number of published reports on\nthe assessment methods used in this area. EBM can\nonly improve care if it is integrated in clinical practice\n[17]. This can be achieved by effective application of\nEBM skills in the clinical environment.To evaluate\nattainment of this objective teaching the teachers\ncourses need to employ appropriate assessment tools.\nThe TTT EBM curricula is widely based on the model\ndeveloped in McMaster University, Sackett’s books on\nhow to teach EBM and User’s guide to medical litera-\nture [18]. But little seems to be reported or known\nabout EBM teaching evaluation tools, with much of this\nknowledge observational [19].\nUntil now several tools for assessment are known to\nbe used in different kinds of courses: Research Self-\nEfficacy Scale (RSES), the stages of change (SOC) model\nTotal number of citations identified by search in \nelectronic databases\nn= 1230\nArticles retrieved for detailed evaluation\nn= 34\nArticles excluded after review of \ncitations n= 1196\nArticles included in the review n= 5\nArticles excluded n=29\nReasons for exclusion\nInappropriate target population n= 15\nNo assessment method described n=3\nNot specific to EBM teaching n=8\nFull text not available n=3\nFigure 1 Flow chart of study selection articles included in the review.\nWalczak et al. BMC Medical Education 2010, 10:64\nhttp:\/\/www.biomedcentral.com\/1472-6920\/10\/64\nPage 3 of 5\nand Kirkpatrick’s model [9,20,21]. RSES scale has good\ninternal consistency but it has been designed to assess\nresearch self-confidence. Thus it lacks face validity for\nteaching the teachers courses which focus on helping\nwith EBM teaching not on conducting or teaching how\nto research. The SOC model suffers the same deficiency\nas it examines learners’ attitudes, intentions and actions\ntowards research, not EBM teaching. Moreover, self\nassessments of this type suffer in the area of criterion\nvalidity as there is a loose link between self-perception\nand objective assessment [22]. The most commonly\nknown tool is the Kirkpatrick’s model, which is used fre-\nquently as a tool for assessing individual trainee perfor-\nmance but also for measuring the effectiveness of\nteaching the teacher courses [20,21]. Evaluation of edu-\ncational interventions must concern at least four dimen-\nsions embedded in Kirkpatrick’s hierarchy, such as\nparticipant’s satisfaction, learning (both knowledge and\nskills), behavioral change (understood as a transfer of\nknowledge and skills to workplace), and outcomes\nwhich are mainly considered as impact on patients [17].\nHowever none of included articles described and made\nuse of this method. Furthermore, change in knowledge\nmay not equate to change in behaviour.\nSuccessful teaching depends not only on good teach-\ning, but also on willingness and effort by the learner, a\nsupportive social environment with teaching and learn-\ning opportunities [8,23]. For evaluation of a teacher’s\nperformance, can we rely on assessments which utilise\ntrainee’s evaluations? Two reasons students’ feedback\nis inappropriate as a measure of teacher quality are\nthat they may not measure all that the teachers are\ntrying to achieve and often do not also provide useful\ninformation for teachers about what they need to\nknow to teach more effectively [8,24]. Moreover, data\nfrom a randomised controlled trial suggests that trai-\nnee feedback can be manipulated by introducing\n“seduction” in teaching [25]. For these reasons we\nshould evaluate trainers’ courses with specifically\ndeveloped assessment tools. To maintain relevance of\nthe course and to achieve its intended objectives,\nassessment tools need to be designed as a part of an\nongoing evaluation cycle [26].\nEffective teacher education is essential to improve\nEBM teaching quality [8] and constitutes the main rea-\nson for development of appropriate assessment tools.\nConclusion\nDue of the lack of well developed assessment tools for\ncourses for EBM teachers, the effect of teaching skills of\ntutors is currently not measurable. There is a need to\ndevelop educationally sound assessment tools to encou-\nrage EBM teachers to provide clinically integrated EBM\nteaching.\nFunding\nThe systematic review was prepared within the study\nwhich was funded by the European Union Leonardo da\nVinci project grant (grant number: UK\/07\/LLP-LdV\/\nTOI-062).\nAdditional material\nAdditional file 1: Search strategy for identification of articles for the\nreview of assessment methods in EBM TTT courses.\nAdditional file 2: Details of primary articles included in the review\nof assessment methods of EBM teaching the teachers courses\nAuthor details\n1CASPolska, 32-400 Myślenice, ul. Mickiewicza 40, Poland. 2Birmingham\nWomen’s NHS Foundation Trust, Metchley Park Road, Edgbaston,\nBirmingham B15 2TG, UK. 3University of Birmingham, Edgbaston,\nBirmingham B15 2TG, UK. 4Agency for Quality in Medicine, Wegleystrasse 3,\n10623 Berlin, Germany. 5TUDOR EBM Network, University of Szeged, Albert\nSzent-Gyorgyi Medical Centre, Semmelweis u. 6, H-6725 Szeged, Hungary.\n6Universita Cattolica del Sacro Curoe, Via Emilia Parmense 84, 29100\nPiacenza, Italy. 7Basel Institute for Clinical Epidemiology and Biostatistics,\nHebelstrasse 10, CH 4031 Basel, Switzerland. 8Academic Medical Center,\nUniversity of Amsterdam, Department of Obstetrics and Gynaecology,\nMeibergdreef 9, 1105 AZ Amsterdam, The Netherlands. 9Centre\nd’épidémiologie clinique, IUMSP, Bugnon 17, 1005 Lausanne, Switzerland.\nAuthors’ contributions\nKSK, ST, BWM and JW conceived the project. AK, EG and KK performed\nliterature search, study selection and data extraction. All authors participated\nin the development of the manuscript and provided input into the final\nversion.\nCompeting interests\nThe authors declare that they have no competing interests.\nReceived: 14 April 2010 Accepted: 29 September 2010\nPublished: 29 September 2010\nReferences\n1. Shaneyfelt T, Baum KD, Bell D: Instruments for evaluating education in\nevidence-based practice: a systematic review. JAMA 2006,\n296(9):1116-1127.\n2. Coppus SF, Emparanza JI, Hadley J, Kulier R, Weinbrenner S, Arvanitis TN,\nBurls A, Cabello JB, Decsi T, Horvath AR, Kaczor M, Zanrei G, Pierer K,\nStawiarz K, Kunz R, Mol BW, Khan KS: A clinically integrated curriculum in\nEvidence-based Medicine for just-in-time learning through on-the-job\ntraining: The EU EBM project. BMC Medical Education 2007, 7:46.\n3. Kljakovic M, Love T, Gilbert A: Attitudes of teachers to evidence based\nmedicine. Australian Family Physician 2004, 33(5).\n4. Coomarasamy A, Khan KS: What is the evidence that postgraduate\nteaching in evidence based medicine changes anything? A systematic\nreview. BMJ 2004, 329:1017.\n5. Kulier R, Hadley J, Weinbrenner S, Meyerrose B, Decsi T, Horvath AR, Nagy E,\nEmparanza JI, Coppus SF, Arvanitis TN, Burls A, Cabello JB, Kaczor M,\nZanrei G, Pierer K, Stawiarz K, Kunz R, Mol BW, Khan KS: Harmonising\nevidence-based medicine teaching: a study of the outcomes of e-\nlearning in five European countries. BMC Med Edu 2008, 8:27.\n6. European Union Evidence Based Medicine Unity. [http:\/\/www.ebm-unity.\norg].\n7. Thangaratinam S, Barnfield G, Weinbrenner S, Meyerrose B, Arvanitis TN,\nHorvath AR, Zanrei G, Kunz R, Suter K, Walczak J, Kaleta A, Oude\nRengerink K, Gee H, Mol BW, Khan KS: Teaching trainers to incorporate\nevidence-based medicine (EBM) teaching in clinical practice: the EU-EBM\nproject. BMC Med Edu 2009, 9:59.\nWalczak et al. BMC Medical Education 2010, 10:64\nhttp:\/\/www.biomedcentral.com\/1472-6920\/10\/64\nPage 4 of 5\n8. Ingvarson L, Rowe K: Conceptualising and evaluating teacher quality:\nsubstantive and methodological issues. The Economics of Teacher Quality\nconference, Australian National University 2007.\n9. Bates I, Ansong D, Bedu-Addo G, Agbenyega T, Akoto AY, Nsiah-Asare A,\nKarikari P: Evaluation of a learner-designed course for teaching health\nresearch skills in Ghana. BMC Medical Education 2007, 7:18.\n10. Khan KS, ter Riet G, Popay J, Glanville J, Sowden AJ, Kleijnen J: (2001b)\nStudy quality assessment: conducting the review. Undertaking Systematic\nReviews of Research on Effectiveness CRD Report No. 4, Phase 5, Stage II 1-20.\n11. Deeks JJ: Systematic reviews in health care: Systematic reviews of\nevaluations of diagnostic and screening tests. Br Med J 2001, 323:157-162.\n12. Cartwright CA, Korsen N, Urbach LE: Teaching the teachers: helping\nfaculty in a family practice residency improve their informatics skills.\nAcad Med 2002, 77:385-91.\n13. Green ML: A train-the-trainer model for integrating evidence-based\nmedicine training into podiatric medical education. Journal of the\nAmerican Podiatric Medical Association 2005, 95:497-504.\n14. Dorsch JL, Jacobson S, Scherrer CS: Teaching EBM teachers: a team\napproach. Medical Reference Services Quarterly 2003, 22.\n15. Kouhpayehzadeh J, Baradaran H, Soltani Arabshahi K, Knill-Jones R: Clinical\nteachers’ attitudes toward the efficacy of evidence-based medicine\nworkshop and self-reported ability in evidence-based practice in Iran.\nThe Journal of Continuing Education in the Health Professions 2006,\n26:210-214.\n16. Scherrer CS: An evaluation of a collaborative model for preparing\nevidence-based medicine teachers. J Med Libr Assoc l 2006, 94(2).\n17. Fritsche L, Greenhalgh T, Falck-Ytter Y, Neumayer H-H, Kunz R: Do short\ncourses in evidence based medicine improve knowledge and skills?\nValidation of Berlin questionnaire and before and after study of courses\nin evidence based medicine. BMJ 2002, 325:1338-1341.\n18. Yousefi-Nooraie R, Rashhidian A, Keating JL, Schonstein E: Teaching\nevidence-based practice: the teachers consider the content. J Eval Clin\nPract 2007, 13:569-75.\n19. Aiyer MK, Dorsch : The transformation of an EBM curriculum: a 10-year\nexperience. Medical Teacher 2008, 30:377-83.\n20. Ribeiro O: Developing criteria for assessing the impact of a trainer\ntraining program in a health care setting: from theory to practice.\nAmerican Society for Training & Development 2006.\n21. Hutchinson L: Evaluating and researching the effectiveness of\neducational interventions. BMJ 1999, 318:1267-1269.\n22. Khan KS, Awonuga AO, Dwarakanath LS, Taylor R: Assessments in\nevidence-based medicine workshops: Loose connection between\nperception of knowledge and its objective assessment. Medical Teacher\n2001, 23:92-94.\n23. Fenstermacher GD, Richardson V: On making determinations of quality in\nteaching. Teachers College Record 2005, 107:186-213.\n24. Darling-Hammond L, Youngs P: Defining “highly qualified teachers\": What\ndoes “scientifically-based research” actually tell us? Educational Researcher\n2002, 9:13-25.\n25. Naftulin DH, Ware JE, Donnelly FA: The doctor Fox lecture: a paradigm of\neducational seduction. Journal of Medicine Education 1973, 48:630-635.\n26. Wilkes M, Bligh J: Evaluating educational interventions. BMJ 1999, 318.\nPre-publication history\nThe pre-publication history for this paper can be accessed here:\nhttp:\/\/www.biomedcentral.com\/1472-6920\/10\/64\/prepub\ndoi:10.1186\/1472-6920-10-64\nCite this article as: Walczak et al.: How are “teaching the teachers”\ncourses in evidence based medicine evaluated? A systematic review.\nBMC Medical Education 2010 10:64.\nSubmit your next manuscript to BioMed Central\nand take full advantage of: \n• Convenient online submission\n• Thorough peer review\n• No space constraints or color figure charges\n• Immediate publication on acceptance\n• Inclusion in PubMed, CAS, Scopus and Google Scholar\n• Research which is freely available for redistribution\nSubmit your manuscript at \nwww.biomedcentral.com\/submit\nWalczak et al. BMC Medical Education 2010, 10:64\nhttp:\/\/www.biomedcentral.com\/1472-6920\/10\/64\nPage 5 of 5\n"}